{
  "modId": 27397.0,
  "modName": "Fiendish Magicka",
  "summary": "Dawnguard and Dragonborn are required.\r\n\r\nThis mod adds 10 new spells to the game and a new bandit faction called Legion, including a handful of custom enemy npcs wearing powerful armor and wielding strong poisonous weapons. ",
  "descriptionHtml": "Dawnguard and Dragonborn are required.\r\n\r\n-Update 1.3-\r\n\r\nI am expanding slightly to incorporate some more unique racial attributes.  As such I have changed how starting point distribution works with the various races as well as modifying base stats.  In general the overall ideas are as follows:\r\n\r\nArgonian - Powerful 1 on 1 combatant due to very large hp recovery and affinity with one handed weapons. \r\nBreton - Hardy light fighter with powerful healing abilities and a resistance to magical attacks.  Starts with Breton\\'s Gift, a powerful HoT spell.\r\nDark Elf - In line with destructive forces the Dark Elves have innate fire resistance and begin with Curse Of Flames, a powerful DoT spell.\r\nNord - Focused on heavy fighting, resistance to the cold and a moderate resilience to damage.\r\nHigh Elf - Magical by nature, highest mana regen and starts with the powerful Maelstrom spell.\r\nImperial - Strong soldiers with stats that reflect a life of war and duty.\r\nKhajiit - Stealthy combatants with powerful claws and reasonable ability to heal.\r\nOrc - Massive physical damage resistance and fantastic smiths but weak versus magical attacksand the lowest mana regen out of the races.\r\nRedguard - A life of hardship and fighting has perfected their ability to duel. *Note - Plan on adding a racial ability to compensate for their lack of changes*\r\nWood Elf - Woodland sneaks and the best archers, they lack close up fighting ability but make up for it by being able to set up traps with their *Trick Traps.\r\nVampire of any race: Powerful HP, mana and stamina regen allows vampires of any race to face their immortality with the confidence and wisdom that no other race can compete with.  \r\n\r\n*Elven Trick trap is a magical rune that let\\'s out a noxious hallucinogen that causes an aoe fear in enemies.\r\n\r\n-Keep in mind these changes have an effect on all characters in the game, this means vampires are exceedingly dangerous now as well as each race having very particular strengths and weaknesses.  More info can be found in the readme.-\r\n\r\nNew spell for all races: Curse of Flames and Flaming Ruin!\r\n\r\n  -Update 1.2-\r\nI have now made all 8 spells craftable at the tanning rack using a ruined book and a new ingredient called Dust of Apocrypha.  The new weapons and spells all use this ingredient to be crafted.  To this end I will be replacing most of the spelltomes that lie about with apocrypha dust and put it in some other logical places around skyrim and solstheim.\r\n\r\nThis mod adds 8 new spells to the game and a new bandit faction called Legion, including a handful of custom enemy npcs wearing powerful armor and wielding strong poisonous weapons.  The scope of this mod is small and does not introduce sweeping changes to the game.  It adds a little bit more content and what I believe to be a nice challenge with a good reward.  The spells are aimed at being usable by any class and several take perks into account.  To this end some of the more potent spells have a long charge time.\r\n\r\n-Now available!-\r\nNew Weapons: New unique weapons balanced with vanilla weapons.  \r\n- Vulturius:  A heavy draw bow that hits like a truck and marks targets for 20 seconds with detect life.\r\n- Sword of Fire and Ice:  An icy sword that sets targets on fire for 3 seconds.  Attack speed is 20% slower than most one-handers, but damage is 20% stronger than most.  Great for strong power attacks and sneaky kills.\r\n- Sword of Apocrypha:  An ebony blade blessed by the infinite knowledge of Hermaeus Mora.  Fast swings allow quick procs of chaos damage.\r\n- Facesmasher: A very powerful two-handed hammer that deals frost damage over 2 seconds.\r\n\r\nAll the weapons use various common to rare crafting material requirements(you will need daedric and nordic smithing) and are balanced versus legendary daedric equipment.  They are made as-is and come pre-enchanted.  \r\n\r\n\r\n(Intro to Spells)~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nSpells added to the game:\r\n\r\n\r\nHatred - An unresistable frenzy spell that lasts for 20 seconds and grants a massive combat bonus.  \r\n\r\nSoulfire - A very long range concentration lightning spell that rapidly disintegrates mana(I mean it, this spell will wreck your mana pool) and leaves a 2 second damage over time effect.\r\n\r\nDoom - Causes the target\\'s shadow to engulf them.  Does not aggro, drains health and stamina until the target perishes(2 hp and 4 stamina/sec.)\r\n\r\n*Soul shackle - 10 second paralyze, Moderately long charge time(~4 seconds).  Useful for ambushes but not live combat.  The projectile has about the same range as a crossbow bolt and has a similar arc.  The dart is very small and difficult to see, this is the same for poison of undeath.\r\n\r\nPoison of Undeath/Titan Undead - Raise any person or beast to fight at your side permanently.  Cast again on your minion to grant a massive boost to their hp and increase their attack speed by 50% for 30 seconds.  They disintegrate after the buff wears off.\r\n\r\nShudder - Charge the air in front of the caster and release a forceful blast of static electricity that stuns and ravages whatever it comes into contact with.  Starts as a cone blast and becomes a large, invisible projectile that electrifies whatever it comes into contact with.  Moderate charge up time.\r\n\r\nAstral Arrow - Materialize an astral arrow and fire with such force as to knock even the mightiest of foes down(within reason.)  Moderate charge time.\r\n\r\n(New! 1.2) Maelstrom - Use the power of wind to pull and push most NPCs to their death! [if you notice this spell working on anything like dragons or mammoths, etc.... let me know.  Dragonpriests should be immune as well.]\r\n\r\n(New! 1.3) Curse of Flames - Deals fire damage over 5 seconds while reducing resistance to fire damage by 10% for each stack.  The more charred the enemy, the more damage it deals.\r\n\r\n(New 1.3) Flaming Ruin - Deals a large amount of fire damage as well as knocking down enemies in a moderate radius.  Bombardment-oriented spell.\r\n\r\n(Technical Stuff)~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nI have added the appropriate resistances to the spells so soulshackle and astral arrow shouldn\\'t negatively impact anything they ought not to.  Please report it if there\\'s any issues with any other creatures.\r\n\r\n(How To Get Started)~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\n1. Start at the standing stones, look to the small fishing camp just below.  I suggest doing this at level 5 with reasonable gear.\r\n\r\n2. Save beforehand, your first encounter might be rough.\r\n\r\n3.  You should find a journal and a spelltome at this campsite, the journal will give you an idea of where you need to go next.\r\n\r\n4.  There are 4 bandit camps all together and each will have a camp with a clue(note, book or journal) to the next area.  The spell tomes will always be out in the open in a conspicuous place.\r\n\r\n5.  If you\\'re getting your ass handed to you, try to get the leg up on them and prioritize the most dangerous out of the group.\r\n\r\n(Feedback)~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nI\\'d like to hear about any bugs or qualms about the difficulty!\r\n\r\nBugs - Give me the location(or as close to as possible) and I will do my best to fix it asap.\r\n\r\nCriticism:\r\nDifficulty - Please let me know what difficulty you play on and what class you use(like thief with dual daggers, heavily armored archer, etc).  Too easy, too hard and the like.  I did my best to make the npcs challenging but not impossible to beat.\r\nIf you know how I can balance the spells and equipment a bit better, please let me know!  I don\\'t have much knowledge in the scripting department so I tried to use assets you might not see often or used in the ways that they are.",
  "categoryId": "93",
  "version": "1.3",
  "author": "Demisovereign",
  "createdUnix": "1353851551",
  "updatedUnix": "1365577907",
  "containsAdultContent": false,
  "uploadedBy": "demisovereign",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101570",
      "name": "Fiendish-Magicka-1",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40",
      "fileName": "Fiendish-Magicka-1-27397-.zip",
      "uploadedUnix": "1353851811",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5fca4ed365dd388a76131b96c7514b3db2e37e7bc68d719adc369223fda626a4/analysis/1407277447/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fiendish-Magicka-1-27397-.zip?fid=101570&ttl=1535800105&ri=8192&rs=8192&setec=2c852bcbeb3c58d132c8ab6203507f79"
    },
    {
      "fileId": "102668",
      "name": "Fiendish-Magicka-1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "42",
      "fileName": "Fiendish-Magicka-1_1-27397-1-1.zip",
      "uploadedUnix": "1354408648",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ad4f913f7903100f2d81c652f1e39ff884e12633a7e6481153da7d2b4792b9cf/analysis/1407287711/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fiendish-Magicka-1_1-27397-1-1.zip?fid=102668&ttl=1535800106&ri=8192&rs=8192&setec=08a293c838b8f74dd2fc92cfb355ec4e"
    },
    {
      "fileId": "1000023560",
      "name": "Fiendish-Magicka-1_3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "156",
      "fileName": "Fiendish-Magicka-1_3-27397-1-3.zip",
      "uploadedUnix": "1365577907",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/2eac00cf93259f0689ac46720f86905fda310f6e59aef643f4f86c7a7b5d6f8d/analysis/1407515171/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fiendish-Magicka-1_3-27397-1-3.zip?fid=1000023560&ttl=1535800106&ri=8192&rs=8192&setec=757ebf11ee05376f5e156129cb0cc687"
    }
  ]
}