{
  "modId": 27407.0,
  "modName": "Fountain Guard Armor",
  "summary": "Fountain Guard Armor",
  "descriptionHtml": "FACEBOOK!\r\nI now have a facebook page! So now you can easily get mod updates, chat to me, give me ideas, sketches, organize  mod projects or anything really. You may even on occasion get access to betas so I can get feedback before releasing final mods. This is the best place to message me as Nexus and steam workshop have limited messaging capability so on here I will always have a record of conversations:)\r\nhttps://www.facebook.com/pages/Maty743-Modder/531811283537450?ref=hl\r\n\r\n[youtube]URuQMqrTzIk[/youtube] [youtube]9R0QWyk-L5o[/youtube]\r\nFountain Guard Armor (lotr*) V1.0\r\n///////////////////////////////\r\nPlease don\\'t forget to endorse if you like :) And submit Screenshots! I will upload best ones :)\r\nHi everyone! I\\'m back modding again finally and have a new armor to celebrate :D\r\nThe armor is compatible with both males and females (excluding khajiit & argonian helmets). It can be crafted at the forge under \\\"Steel\\\". You need the ADVANCED SMITHING perk to be able to see it in forge list and create.\r\n\r\nInstallation:\r\nPlease make sure you skyrim game is up to date. If you do not have a legitimate copy dont complain and comment that the mod is not working. I\\'m not accusing anyone of piracy but I don\\'t want to spend time trying to fix your problem when it could potentially bug the mod for people that have legitimately brought the game.\r\nExtract files so that the data folder merges with the Skyrim Data folder. The ESP. file should also be in the data file.\r\n\r\nMod components and id codes:\r\nArmor (XX000d62)\r\nHelmet (XX000d64)\r\nCape (XX0012CF)\r\nBoots (XX000d65)\r\nGloves (XX000d63)\r\nMask (XX000d6A)\r\nXX being the load order of the mod.\r\nOtherwise you can just type into console...\r\nhelp \\\"Fountain Guard\\\" 0\r\nthis will show the item codes (you will need to type in \\\"Fountain Guard Armor\\\" as well as that piece will not fit into the console area with the others)\r\n\r\nChange log. \r\nV1.1\r\n-All pieces of armor now set as heavy. (no stat changes)\r\n- Items can now be forged in any forge.\r\n- Altered cape so hopefully might fix weird crash issues that some of you encountered (fingers crossed).\r\n\r\nDonators.\r\nA huge thank you to users that have decided to make a donation. It is really appreciated. Thanks!\r\n- FelxcolossiCXx \r\n- Tfig2110\r\n\r\n\r\nFuture Projects: My next project planned is upgrading my Mithril armor mod. This includes new improved textures and also multiple new armor variations. I want to re-texture this mod and implement it so it is more lore friendly. Maybe the Vigilants of Stendarr? My Knights of the Nine mod will also be improved with updated textures and meshes. After these two mods have been updated I may make some more Gondor armor mods since I have already made alot of reusable elements. I also like the idea of making the Elven armor but it depends on the popularity of this mod. Please feel free to leave suggestions on what armors I should make. Even if you have your own armor designs but don\\'t know how to make for game please submit sketches in the user image section of any of my mods  as you never know what I might like :)\r\n\r\nHelp Needed:\r\nIf you know how to easily make _go meshes I would love someone to convert these armors  for me :)\r\n\r\nErrors\r\n- If you find any errors please let me know\r\n\r\nPermissions\r\n- At the moment my assets are not available due to the fact I will be making new armors out of some of these assets. Translation conversions are fine, just credit me and link. If you wanted to use this mod in a quest you can however... Just make duplicate files with the same names as this mod then ask the user to download this as well and put higher in the load order. That means your default armor files will be replaced with these armor files in game. This method also allows both parties to get credit for their contributions easily due to the user having to download both mods. Message me if your not sure what I mean.\r\n\r\n\r\nSide Notes: \r\nI have deliberately made the female armor quite bulky as it is ARMOR! \r\nI may allow argonian and cat people support for the helms if there is enough support for it. Just not sure if it will look well as it is designed for human characters.\r\n[youtube]yIQZALpl2G4[/youtube] [youtube]vL9taK6XwmQ[/youtube]\r\n\r\n*This is a non-profit mod and is not intended for sales of any sort. It is in no way affliated with, or sponsored or approved, by Tolkien Enterprises, the heirs or estate of J.R.R. Tolkien Warner Brothers or any of their respective affiliates or licenses. I make no claim to armor designs that are trademarked, copyrighted or otherwise protected by law. This work is produced solely for the personal, uncompensated enjoyment for myself and other Tolkien fans\r\n",
  "categoryId": "54",
  "version": "1",
  "author": "Maty743",
  "createdUnix": "1353874817",
  "updatedUnix": "1354087326",
  "containsAdultContent": false,
  "uploadedBy": "maty743",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101629",
      "name": "Fountain Guard armor",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32828",
      "fileName": "Fountain Guard armor-27407-1.rar",
      "uploadedUnix": "1353875396",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f3e87d47d08109e272c698ae976aed68463d67310f940a1145522368752f16cc/analysis/1407277941/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fountain%20Guard%20armor-27407-1.rar?fid=101629&ttl=1535800120&ri=8192&rs=8192&setec=ebe455d2439873240eb135ac70de2273"
    },
    {
      "fileId": "102011",
      "name": "Fountain Guard Armor",
      "version": "1.101",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32827",
      "fileName": "Main file 2-27407-1-101.rar",
      "uploadedUnix": "1354070812",
      "modVersion": "1.101",
      "virusScanUrl": "https://www.virustotal.com/file/d6020cd1a074a455843f66d28a997d04f0744427515fb1bb37c95371ce7ec4e3/analysis/1407281233/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20file%202-27407-1-101.rar?fid=102011&ttl=1535800120&ri=8192&rs=8192&setec=b834b240a8b5f1c79760c95b9bb8704a"
    },
    {
      "fileId": "102042",
      "name": "Fountain Guard Armor",
      "version": "1.102",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32827",
      "fileName": "Fountain Guard Armor-27407-1-102.rar",
      "uploadedUnix": "1354087326",
      "modVersion": "1.102",
      "virusScanUrl": "https://www.virustotal.com/file/11191cd93bb8f968bd54f16a7dae87ff775d851fcae6def3e45d3cd5e9f7210f/analysis/1407281529/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fountain%20Guard%20Armor-27407-1-102.rar?fid=102042&ttl=1535800121&ri=8192&rs=8192&setec=ba6920a49ad8a51a61dd7a8886df7ce3"
    }
  ]
}