{
  "modId": 27400.0,
  "modName": "Tormented Followers - Ignus",
  "summary": "Adds Ignus the fire mage from Planescape Torment (PST) to the game, as a fully functional follower and with his voice from PST.",
  "descriptionHtml": "Conjuration experiments have got out of hand under the College of Winterhold, bridging the Planes and, summoning [b]Ignus[/b], the cursed fire mage from [b]Planescape Torment[/b] (PST) into the world of Tamriel. With a new world to .. burn from his fingertips, Ignus is willing to serve the dragonborn and venture into the dangers of Skyrim.\r\n\r\nHave a look at the video preview in the video section for an in-game demonstration.\r\n\r\n[b]Installation[/b]:\r\n----------------\r\nUnpack the file PSTignus.zip and copy the  .bsa and .esp files in the \\\"skyrim\\\\data\\\" folder, then check the PSTignus mod in the Data Files section when launching the game.\r\nIgnus should be available in the Midden, under the College of Winterhold. In order to get there you have to be admited to the College of Winterhold first.\r\n\r\n[b]Known issues[/b]:\r\n-------------------\r\nThere might be conflicts and issues with other follower mods, so if you want to give this mod a try, disable all the other follower mods, including my 1st follower mod, Vhailor, if you have it.\r\nI tested this mod alot and it works just fine, but since I am working on mods in the few hours I have left after work, I often don\\'t have time to test with other mods.\r\n\r\n\\\"The ground shall carry it\\\": Ignus is cursed to live in a plane of fire, so he won\\'t carry items for you. I disabled the carry function for several reasons, one that Ignus is powerful enough with the gear that he has, and I wanted to have some realism, like he would burn the things you give him :)\r\n\r\nIgnus should be immune to fire, but he is vulnerable to frost magic.\r\n\r\nI also wanted to make Ignus float like a flame atronach, but haven\\'t find a way yet. If someone knows how, send me a p.m.\r\n\r\n[b]More about Ignus[/b]:\r\n-------------------\r\nEven though Ignus in Planescape Torment was a chaotic evil pyromaniac, I liked this character because after playing with him in the party, some of his early past is revealed to the player, like the way he was almost tortured by his master to learn the ways of the fire. Ignus is the result of how power consumes people, and transforms them.\r\nIgnus will sometimes have extra comments, depending on the zone he is in, like a place of nightmares ;) or a big temple.\r\n\r\n[b]Copyright stuff[/b]\r\n=============================================\r\nIgnus\\' voice set is voiced by actor [u]Charles Adler[/u].\r\nI used for this mod only content that was already available on the internet through modding communities, fan-sites and Youtube.\r\nThe sources of the sound files I used to voice Ignus in Skyrim:\r\n* Youtube in-game recordings\r\n* http://www.sorcerers.net (Infinity Engine Games modding site)\r\n-------------------\r\n[i][b]No infringement on copyright is intended, as I started this mod as a personal project, and now it is aimed to the fans of Planescape Torment, and, of course, Skyrim. I made this mod for non-commercial use, free, and as a way to celebrate one of my favorite games of all time and its heroes. There is no malicious intent, and I don\\'t have now, or in the future, any expectations of personal gain in any way (monetary, reputation, etc.) related to the content I don\\'t own. [/b][/i]\r\n\r\n-------------------\r\nMany thanks to deck16.net for the voiced (custom) followers tutorial\r\n\r\nP.S. Future plans: working on Dak\\'kon ...\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "Senyn",
  "createdUnix": "1353855764",
  "updatedUnix": "1353856536",
  "containsAdultContent": false,
  "uploadedBy": "Senyn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101585",
      "name": "PSTignus",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7800",
      "fileName": "PSTignus-27400-1-0.zip",
      "uploadedUnix": "1353856536",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a06d25b3520e8321681b297d4f6e28ab6201f5055bfbe31b7cedbebd308eb966/analysis/1407277506/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PSTignus-27400-1-0.zip?fid=101585&ttl=1535800110&ri=8192&rs=8192&setec=7eb0411ba69d60f388d2baf5dc42fcc1"
    }
  ]
}