{
  "modId": 27452.0,
  "modName": "Auto-first-third-person view",
  "summary": "Automatically switches to your preferred view depending on these conditions: bow is drawn, ranged weapon is out, spell or staff is out, melee weapon is out, sprinting, sneaking, in interior or otherwise.",
  "descriptionHtml": "[center][size=9][color=#ff9900]Auto-first-third-person view[/color][/size][/center] \r<br />\r<br />\r<br />[b]Version:[/b] 0.704 \r<br />[b]Date:[/b] 10 July 2013 \r<br />[b]Author:[/b] kuertee \r<br />[b]Source:[/b] [url=http://skyrim.nexusmods.com/mods/27452/]http://skyrim.nexusmods.com/mods/27452/[/url] \r<br />[b]Requirements:[/b] \r<br />[list] [*]Skyrim 1.9 \r<br />[*]Skyrim Script Extender [url=http://skse.silverlock.org/]http://skse.silverlock.org/[/url] \r<br />[*]The [camera] section in your Skyrim.INI exists when Custom 3rd-person camera positions features is used.\r<br />[/list]\r<br />[b]Compatibility[/b]\r<br />[list]\r<br />[*]When used with another 3rd-person camera mod, set userChange3rdPersonCameraPos to False so that my mod&#39;s 3rd-person camera changes are disabled.\r<br />[/list]\r<br /> \r<br />[center][size=7][color=#ff9900]Short description[/color][/size][/center] \r<br />\r<br />Automatically switches to your preferred view depending on these conditions: bow is drawn, ranged weapon is out, spell or staff is out, melee weapon is out, sprinting, sneaking, in interior or otherwise. \r<br />\r<br />[center][size=7][color=#ff9900]Updates since last release (0.703):[/color][/size][/center] \r<br />\r<br />[list] [size=5][color=#ff9900]0.704, 10 July 2013:[/color][/size][*]New feature: You can set your preferred view for when swimming.\r<br />[*]Tweak: You can now change user settings before the main quest is at stage 5 (e.g. before leaving Helgen).\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Updating[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]Simply deactivate and uninstall the previous version then install and activate this version. Note that you do not need to stop the mod in-game. If you do, you will lose your accumulated mod-specific data. Let the new version back-up the data of its old version, clean-up the old data (i.e. zero-out) by stopping itself, restart itself and restore the data of the old version. \r<br />\r<br />[*]If you have Sky UI&#39;s MCM, you can check the settings in Sky UI&#39;s MCM wihtin the game. \r<br />\r<br />[*]Or check the settings in &#34;Data&#92;Ini&#92;kuerteeAutoFirstThirdPersonView.ini&#34;. If you change any of it, execute your changes by typing {bat &#34;ini&#92;kuerteeAutoFirstThirdPersonView.ini&#34;} (without the brackets) in the console. \r<br />\r<br />[*]After the update is finished, the message &#34;kuAFTPV v0.704&#34; will appear. \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Gameplay changes[/color][/size][/center] \r<br />\r<br />[size=5][color=#ff9900]Auto-point-of-view[/color][/size]\r<br />\r<br />Unlike the Oblivion version (http://oblivion.nexusmods.com/mods/21834/) of this mod, this version doesn&#39;t learn your preferences from use. It will use the defaults. Or you&#39;ll need to specify the point-of-views for each condition manually in MCM, in the console or via the INI file. Remember that you need to execute the INI before its changes take effect. Read the Install section if you need more information on this. However, most other features of the Oblivion version is present in this Skyrim version. \r<br />\r<br />When any of these conditions change, the mod will automatically press the Switch Point-Of-View button to put your view into your preferred point-of-view as listed in the INI. \r<br />\r<br />The order of conditions and their default point-of-views are: \r<br />In dialogue: 1st-person \r<br />Torch is out: 1st \r<br />Bow is drawn: 1st-person \r<br />Range weapon is out, ranged weapon is out indoors: 3rd-person \r<br />Spell/Staff is out, spell/staff is out indoors: 1st \r<br />Melee weapon is out, melee weapon is out indoors: 3rd \r<br />Sneaking: 1st \r<br />Sprinting: 3rd \r<br />Swimming: 1st\r<br />In interiors: 1st \r<br />Otherwise: 3rd \r<br />\r<br />You can temporarily switch to the other point-of-view and the mod will keep this view until it detects another required change. For example: Your melee weapon is out and the mod puts your view into 1st-person - but for this one fight, you&#39;d rather that it is in 3rd-person. Manually switch your view and the mod will keep on the 3rd-person view until it detects another required change. Putting your weapon away or switching to a new weapon will trigger the required change. And so the mod will go through each condition and choose the new point-of-view. \r<br />\r<br />The mod will also return the 3rd-person view to it&#39;s previous distance from the player. However, some game events will return this distance to its default. Examples of these events are vampire feeding and using a crafting station. \r<br />\r<br />Note that when the game takes control of the camera (e.g. during kill-views, when on a horse or when using a crafting station), this mod pauses itself and leaves the game to control the camera. It&#39;ll take control of the camera again after the game releases its control. \r<br />\r<br />[size=5][color=#ff9900]Custom 3rd-person camera positions[/color][/size]\r<br />\r<br />By default, this is enabled. Turn off userChange3rdPersonCameraPos in the console, INI or in the MCM to disable this feature. This feature changes the 3rd-person camera&#39;s X and Z positions and Y combat modification for these conditions: no weapons equipped, with a spell ready while standing, with a spell ready while sneaking, with a melee weapon while standing, with a melee weapon while sneaking, with a ranged weapon while standing and with a ranged weapon while sneaking - in that order of priority. Also, this feature requires that the [camera] section exists in your Skyrim.INI file. Simply add it in if it doesn&#39;t exist.\r<br />\r<br />Note that because the 3rd-person camera changes only when you change your equipped weapons (i.e. it does not change when the mod changes any of these variables), going to and from sneak mode without changing your equipped weapons will not change the 3rd-person camera&#39;s position. I&#39;ve already requested a function from the SKSE developers to address this.\r<br />\r<br />Also note that these changes are not written into the Skyrim.INI file. Uninstalling this mod (or turning off this feature), will restore your original 3rd-person camera positions.\r<br />\r<br />Turn this feature off when playing with another 3rd-person camera mod.\r<br />\r<br />[center][size=7][color=#ff9900]Details[/color][/size][/center] \r<br />\r<br />You can configure this mod with SkyUI&#39;s MCM or in the Console by typing &#34;SetPQV kuAFTPVq {mod data} {value}&#34;. Below are the various mod data that you can change, their default values and a short description of their effects. \r<br />\r<br />The allowable values are: \r<br />-1: don&#39;t check against this condition \r<br />0: 3rd-person-view \r<br />100: 1st-person-view \r<br />(Note that the score range from 0 to 100 range was to be used in scoring your changes in the different conditions. This will allow the mod to learn what you use. However, this is currently disabled.) \r<br />\r<br />userWhenInDialogue = 100 \r<br />When in dialogue. \r<br />\r<br />userWhenRangedWeaponStart = 100 \r<br />When you pull on your bow. \r<br />\r<br />userWhenRangedWeaponDrawn = 0 \r<br />userWhenRangedWeaponDrawnIndoors = 0 \r<br />When you have a ranged weapon out. \r<br />\r<br />userWhenSpellDrawn = 100 \r<br />userWhenSpellDrawnIndoors = 100 \r<br />When you have a spell or staff out. \r<br />\r<br />userWhenMeleeWeaponDrawn = 0 \r<br />userWhenMeleeWeaponDrawnIndoors = 0 \r<br />When you have a melee weapon out. \r<br />\r<br />userIgnoreLeftHand = False \r<br />userIgnoreRightHand = False \r<br />When set to true, the mod ignores changes to the hand, allowing you to change equipped items without changing the camera. \r<br />\r<br />userWhenSprinting = 0 \r<br />When sprinting. \r<br />\r<br />userWhenSneaking = 0 \r<br />When sneaking. \r<br />\r<br />userWhenInInterior = 100 \r<br />When you&#39;re in an interior cell. \r<br />\r<br />userWhenOtherwise = 0 \r<br />When no other conditions are met. \r<br />\r<br />userSnapTo1st = False \r<br />When true, the camera doesn&#39;t transition in to 1st-person view. When false, it does. Note that when true, there are some cases when this will force 3rd-person view to snap also. \r<br />\r<br />userSnapTo3rd = False \r<br />When true, the camera doesn&#39;t transition out to 3rd-person view. When false, it does. Note that when true, the camera snaps back to the default distance for the 3rd-person view. It is recommended that this is kept at false. However, there are times when the game takes control of the camera and snaps it to 3rd-person view. When this happens, the 3rd-person camera returns to its default distance. An example of this is when the game takes control of the camera during feeding as a vampire. \r<br />\r<br />userChange3rdPersonCameraPos = True\r<br />When true, the position of the 3rd-person camera will change in these conditions: no weapons equipped, with a melee weapon while standing, with a melee weapon while sneaking, with a ranged weapon while standing, with a ranged weapon while sneaking, with a spell ready while standing and with a spell ready while sneaking. Turn this feature off when playing with another 3rd-person camera mod.\r<br />\r<br />userCameraPosWhenNoWeaponsX = 30, userCameraPosWhenNoWeaponsY = 0, userCameraPosWhenNoWeaponsZ = -10\r<br />userCameraPosWhenMeleeWeaponDrawnX = 0, userCameraPosWhenMeleeWeaponDrawnY = -100, userCameraPosWhenMeleeWeaponDrawnZ = 20\r<br />userCameraPosWhenMeleeWeaponDrawnX2 = 0, userCameraPosWhenMeleeWeaponDrawnY2 = -100, userCameraPosWhenMeleeWeaponDrawnZ2 = 20\r<br />userCameraPosWhenSpellDrawnX = 0, userCameraPosWhenSpellDrawnY = -100, userCameraPosWhenSpellDrawnZ = 20\r<br />userCameraPosWhenSpellDrawnX2 = 0, userCameraPosWhenSpellDrawnY2 = -100, userCameraPosWhenSpellDrawnZ2 = 20\r<br />userCameraPosWhenRangeWeaponDrawnX = 0, userCameraPosWhenRangeWeaponDrawnY = -100, userCameraPosWhenRangeWeaponDrawnZ = 20\r<br />userCameraPosWhenRangeWeaponDrawnX2 = 0, userCameraPosWhenRangeWeaponDrawnY2 = -100, userCameraPosWhenRangeWeaponDrawnZ2 = 20\r<br />These are the 3rd-person camera&#39;s custom positions. Note that for weapon drawn camera positions the first 3 numbers are for when you are standing and the next 3 are for when you are sneaking. The values above are the game&#39;s default 3rd-person camera position. When you first install the mod, the mod will take these values from your Skyrim.INI - in case you&#39;ve already customised the 3rd-person camera positions.\r<br />\r<br />userCommit3rdPersonCameraPosNow = False\r<br />Set to True after changing any of the camera positions. The values will then be inserted into their appropriate Array properties.\r<br />\r<br />A configuration file (data&#92;ini&#92;kuerteeAutoFirstThirdPersonView.ini) is provided with the relevant console commands. If you want to change any of the default values above, change them in the INI file then run the file by typing {bat &#34;ini&#92;kuerteeAutoFirstThirdPersonView.ini&#34;} (without the brackets) in the console. You only need to do this when you want to change the values of the property. Your changes will be saved in your game. \r<br />\r<br />[center][size=7][color=#ff9900]Install[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]Use Wrye Bash (http://skyrim.nexusmods.com/downloads/file.php?id=1840) to install this mod. Just drag the package (which is a normal ZIP file) into Wrye Bash&#39;s Installers tab. However, the package is only a normal ZIP file, so if you know the game&#39;s mod file structure, install it manually. \r<br />\r<br />[*]Change your settings within the game in Sky UI&#39;s MCM or check the settings in &#34;Data&#92;Ini&#92;&#34;. If you change any of it, execute your changes by typing in the console {bat &#34;ini&#92;kuerteeAutoFirstThirdPersonView.ini&#34;} without the brackets. \r<br />\r<br />[*]Activate the mod. \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Uninstall[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]In the console, type &#34;SetPQV kuAFTPVQ uninstallNow True.&#34; Or with Sky UI&#39;s MCM, set the uninstallNow toggle to True then exit the menus. \r<br />\r<br />[*]Wait for a message confirming the uninstallation. Save the game. \r<br />\r<br />[*]Deactivate the mod with Wrye Bash. If you installed this manually, simply delete all the files you installed. (Wrye Bash keeps track of files used, so installing/uninstalling the mod with it is 100% simpler.) \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Troubleshooting[/color][/size][/center] \r<br />\r<br />[list] [*]You can reset the mod by typing {SetPQV kuAFTPVQ resetNow True} (without the brackets) in the console. Or with Sky UI&#39;s MCM, set the resetNow toggle to True then exit the menus. \r<br />[*]When it resets it will ask you either reset all of its data or continue with the current data. Resetting all its data will remove all your configurations and set the mod as if you have first installed it. \r<br />[*]You can check all the mod&#39;s data by typing {SQV kuAFTPVQ} in the console. You can check if your configurations were set in the mod properly with this. \r<br />[*]If you find that your changes (with the command SetPQV or from executing the INI) does not appear in the mod, check the command again for spelling errors. Then try again. \r<br />[*]If you find that resetting (with resetNow) and uninstalling (with uninstallNow) don&#39;t seem to work, the mod may have been suspended. It is best to simply start-over (i.e. reinstall the mod) after a &#34;clean&#34; save. \r<br />[*]Creating a clean save: \r<br />[list=1] \r<br />\r<br />[*]If you can uninstall the mod from the console with {SetPQV kuAFTPVQ uninstallNow True}. \r<br />\r<br />[*]Wait for the mod to confirm the uninstallation. It may take a minute. If no confirmation appears, then simply continue to the next step. \r<br />\r<br />[*]Save the game manually from the console by typing {save uninstalledMod}. \r<br />\r<br />[*]Uninstall all the mod&#39;s files (*.ESP, *.PSC, *.PEX) from the game folders. Make sure that none of the mod&#39;s Scripts are left. A mod manager like Wrye is best used for this. \r<br />\r<br />[*]Load the &#34;uninstalledMod&#34; save. \r<br />\r<br />[*]Save the game manually again from the console by typing {save cleanSave}. Because all of the mod&#39;s files were removed, all of its data will be &#34;zeroed&#34; in this game. \r<br />\r<br />[*]Play from this game. \r<br />\r<br />[/list][/list] \r<br />\r<br /> \r<br />\r<br />[*]As a last resort, you can also enable script logging and investigate it and/or send it to me. Contact me first either on TESNexus or the official Bethesda forums. To enable script logging, read this thread from the official Bethesda Creation Kit Forum: [url=http://forums.bethsoft.com/topic/1345130-having-papyrus-trouble-here-are-some-things-to-try/] http://forums.bethsoft.com/topic/1345130-having-papyrus-trouble-here-are-some-things-to-try/[/url]. \r<br />\r<br /> \r<br />\r<br />[center][size=7][color=#ff9900]History[/color][/size][/center] \r<br />\r<br />[list] [size=5][color=#ff9900]0.703, 2 July 2013:[/color][/size][*]Bug fix: Fixes to the MCM&#39;s ping-back code - again. This will be the last time this bug will resurface - I hope. I found another instance when the RegisterForModEvent () for the ping-back is not registered or loses its registration in the previous version.\r<br />[size=5][color=#ff9900]0.702, 30 June 2013:[/color][/size][*]Bug fix: Fixes to the MCM&#39;s ping-back code - again.\r<br />[size=5][color=#ff9900]0.701, 16 June 2013[/color][/size][*]Tweak: When the MCM &#34;pings&#34; the main mod (to check if it has not stalled), it will wait for the &#34;ping-back&#34; for 60 seconds. Previously this was 10 seconds. In normal play, the ping-back only takes a fraction of a second. But during initialisation on a clean install or an update to a new version, the main mod would not have been set-up to listen for the ping from the MCM yet - which causes the MCM&#39;s ping-back test to fail and then presenting it&#39;s &#34;stalled message&#34;. In this version, I&#39;ve increased the time the MCM waits for the ping-back to 60 seconds.\r<br />[size=5][color=#ff9900]0.7, 14 June 2013:[/color][/size][*]Tweak: Now uses SKSE&#39;s Game.UpdateThirdPerson () to automatically update the camera position in third-person view. Previously, the camera had the default game&#39;s behaviour of updating only when your weapon changes between melee weapons and ranged weapons. In this version (with Game.UpdateThirdperson ()), the third-person camera position changes when you change your equipped weapon or spell or when you enter and leave sneak mode.\r<br />[*]Tweak: The main package and the MCM can now be merged manually (with TES5Edit). Removing the reliance on GetFormFromFile () from the MCM discovery code made this possible. In this new version, SendModEvent () is used by the main package and the MCM to &#34;ping&#34; each other.\r<br />[size=5][color=#ff9900]0.632, 30 April 2013:[/color][/size][*]Bug fix: Cancelling a bow attack now triggers the camera to change.\r<br />[size=5][color=#ff9900]0.631, 7 April 2013:[/color][/size][*]Tweak: Recompiled the main mod with Skyrim&#39;s 1.9 patch and the MCM component with SkyUI&#39;s 3.4 patch.\r<br />[*]New version: Crossbow support.\r<br />[*]New version: Custom 3rd-person camera positions. By default, this is enabled. Turn off userChange3rdPersonCameraPos in the console, INI or in the MCM to disable this feature. This feature changes the 3rd-person camera&#39;s X and Z positions and Y combat modification for these conditions: no weapons equipped, with a spell ready while standing, with a spell ready while sneaking, with a melee weapon while standing, with a melee weapon while sneaking, with a ranged weapon while standing and with a ranged weapon while sneaking - in that order of priority. Also, this feature requires that the [camera] section exists in your Skyrim.INI file. Simply add it in if it doesn&#39;t exist. Turn this feature off when playing with another 3rd-person camera mod. Note that because the 3rd-person camera changes only when you change your equipped weapons (i.e. it does not change when the mod changes any of these variables), going to and from sneak mode without changing your equipped weapons will not change the 3rd-person camera&#39;s position. I&#39;ve already requested a function from the SKSE developers to address this. Also note that these changes are not written into the Skyrim.INI file. Uninstalling this mod (or turning off this feature), will restore your original 3rd-person camera positions.\r<br />[*]Compatibility: Previously, when in a special form (e.g. Vampire Lord or Werewolf), the script failed. It resumed when the player reverted back.\r<br />[size=5][color=#ff9900]0.628, 12 February 2013:[/color][/size][*]Tweak: When you override the mod (by pressing the Toggle View button), it will now be cancelled by changes of any condition. Previously, it changed only when a higher-priority condition than what the camera was set for changed. E.g. Previously, when you have a weapon out and you override the mod, the mod will not take control of the camera until you sheathe your weapon. So you can go into sneak or go in/outdoors, and the camera will not change. This is because having a weapon out has a high priority over the movement conditions (e.g. being on a horse, sprinting, sneaking) and location conditions (e.g. indoors, outdoors). In this version, changes to any conditions will make the mod cancel your override. When you have a weapon out and you override the mod, simply going in/outdoors or going into sneak will cancel your override.\r<br />[*]Tweak: Made the sneaking condition have a higher priority over the other movement condition. This allows you to do the Silent Roll without the camera switching to your sprinting view preference.\r<br />[*]Tweak: Returned the 3-second buffer between between changes. In the previous version, I set this to 1 to try to get the mod to respond quicker to changing conditions. It caused some problems.\r<br />[*]Bug fix: The mod shouldn&#39;t do a double-take anymore. A double-take is when the mod will change the camera incorrectly then change it back soon after.\r<br />[size=5][color=#ff9900]0.627, 2 January 2013:[/color][/size] [*]New features: userWhenRangedWhenDrawnIndoors = 3rd (default), userWhenSpellDrawnIndoors = 1st (default), userWhenMeleeWeaponDrawnIndoors = 3rd (default). These equipped item conditions are applied when indoors. Set to -1 to disable. \r<br />[*]New features: userIgnoreLeftHand = False (default), userIgnoreRightHand = False (default). When set to true, the mod ignores changes to the hand, allowing you to change equipped items without changing the camera. \r<br />[*]New feature: SkyUI&#39;s MCM (Mod Config Menu) support. The configuration tool is a separate download from my mod&#39;s Nexus files section. It requires Sky UI&#39;s beta 3 version or better which can be downloaded from Sky UI&#39;s thread in Bethesda&#39;s official Skyrim mods forum: http://forums.bethsoft.com/forum/183-skyrim-mods/ \r<br />&lt;&#33;--[*]New feature: Vampire feeding unsticker. Uses playerRef.PlayIdle (IdleStop_Loose) near the end of each feeding animation to force the player back to the &#34;idle&#34; state.--&gt; \r<br />[*]Bug fix: Will try to prevent a double camera switch which used to occur when conditions change rapidly. \r<br />[size=5][color=#ff9900]0.624, 16 December 2012[/color][/size] [*]New feature: userSnapTo1st and userSnapTo3rd. By default, these are false. When true, the camera will snap to position instead of zooming in/out. There are some cases when userSnapTo1st, when true, will also force 3rd-person view to snap. When true, the camera transitions out to 3rd-person view. When false, it does. Note that when true, the camera snaps back to the default distance for the 3rd-person view. It is recommended that this is kept at false. However, there are times when the game takes control of the camera and snaps it to 3rd-person view. When this happens, the 3rd-person camera returns to its default distance. An example of this is when the game takes control of the camera during feeding as a vampire. \r<br />[*]Bug-fix: Reworked the in dialogue detection to use SKSE&#39;s OnMenuOpen (&#34;Dialogue Menu&#34;). Previously, the mod searched for nearby NPCs with a Cloak Spell and checked each NPC with IsInDialogueWithPlayer (). This was so the mod can specifically target the NPC. However, using this method had bugs like affecting brawlers and when training with Vilkas at the start of the Companions Quest. Checking for the Dialogue Menu being open is safer. Thanks to Corvyr for finding this bug. \r<br />[*]Tweak: The mod now queries the Switch POV key at every iteration - in case the user changes it&#39;s binding after mod installation. Previously, this was only performed at the initialisation of the mod. \r<br />[*]Tweak: Faster response of camera switches between drawing the bow and releasing the bow. \r<br />[size=5][color=#ff9900]0.619, 5 December 2012[/color][/size] [*]Bug fix: In previous versions, the in-dialogue feature stopped working after the first game-load. \r<br />[*]New feature: Holding torches now trigger a camera change. By default, this sets the camera to 1st-person view. Change userWhenHoldingTorch in the INI or on the console to change your preference. \r<br />[*]Tweak: Rebuilt the NPC in dialogue with player check. It now doesn&#39;t attach a Ability/Script to each NPC like before. \r<br />[*]Bug fix: The temporary manual switch of POV wasn&#39;t working. Fixed in this version. As a reminder: this feature lets you switch the POV - albeit only temporarily. The POV you switch to sticks until the mod detects a new condition to switch the camera to. \r<br />[*]Tweak: Removed the internal code for OnMenuMode since it is not required. \r<br />[size=5][color=#ff9900]0.616, 29 November 2012:[/color][/size] [*]New feature: Dialogue view. By default this is set to 1st-person view. \r<br />[*]Bug fix: The mod was getting prevented in switching to the correct view after putting your weapon away sometimes. \r<br />[size=5][color=#ff9900]0.614, 27 Novmeber 2012:[/color][/size] [*]Initial release. \r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Credits[/color][/size][/center] \r<br />\r<br />kuertee in http://www.bethsoft.com/bgsforums/ \r<br />\r<br />[center][size=7][color=#ff9900]Tools Used[/color][/size][/center] \r<br />\r<br />Creation kit - http://www.creationkit.com \r<br />\r<br />[center][size=7][color=#ff9900]Licensing/Legal[/color][/size][/center] \r<br />\r<br />You can do whatever you want with this mod but all I ask in return is that you give me credit. I would also like to be contacted when you include this mod in part or in full in a public release. ",
  "categoryId": "28",
  "version": "0.704",
  "author": "kuertee",
  "createdUnix": "1353951347",
  "updatedUnix": "1373463859",
  "containsAdultContent": false,
  "uploadedBy": "kuertee",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036873",
      "name": "kuertee Auto-first-third-person view 0p703",
      "version": "0.703",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "kuertee Auto-first-third-person view 0p703-27452-0-703.zip",
      "uploadedUnix": "1372754800",
      "modVersion": "0.703",
      "virusScanUrl": "https://www.virustotal.com/file/4e5750bee5dbaf18f27abc54720a6b770acfa286ccb9813090eb938367d345c3/analysis/1407625684/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuertee%20Auto-first-third-person%20view%200p703-27452-0-703.zip?fid=1000036873&ttl=1535800200&ri=8192&rs=8192&setec=d5cc6d9499f34ea251b3c1f72162adc4"
    },
    {
      "fileId": "1000036874",
      "name": "kuAFTPV x MCM 0p703",
      "version": "0.703",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "kuAFTPV x MCM 0p703-27452-0-703.zip",
      "uploadedUnix": "1372754896",
      "modVersion": "0.703",
      "virusScanUrl": "https://www.virustotal.com/file/8746c9200193ad3e8eed2811ec9440a23541edbd797ebc61cc8f2f9f61b5524a/analysis/1407625684/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuAFTPV%20x%20MCM%200p703-27452-0-703.zip?fid=1000036874&ttl=1535800200&ri=8192&rs=8192&setec=c527c5d3ea0e05a0097f7096ac54ac23"
    },
    {
      "fileId": "1000036875",
      "name": "kuAFTPV 0p703 merged with MCM",
      "version": "0.703",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "50",
      "fileName": "kuAFTPV 0p703 merged with MCM-27452-0-703.zip",
      "uploadedUnix": "1372754988",
      "modVersion": "0.703",
      "virusScanUrl": "https://www.virustotal.com/file/b3328d73964fb8741e3a6a50ae330656bf4ea0f9e244f57e5380de2744b018c8/analysis/1407625685/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuAFTPV%200p703%20merged%20with%20MCM-27452-0-703.zip?fid=1000036875&ttl=1535800201&ri=8192&rs=8192&setec=7574fb9d7554f254283689b5f2c5b706"
    },
    {
      "fileId": "1000038209",
      "name": "kuertee Auto-first-third-person view 0p704",
      "version": "0.704",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37",
      "fileName": "kuertee Auto-first-third-person view 0p704-27452-0-704.zip",
      "uploadedUnix": "1373463686",
      "modVersion": "0.704",
      "virusScanUrl": "https://www.virustotal.com/file/bc2c76c60db35ea4919368c162614e8afd8e4d2eae3660baa26ae2555717367d/analysis/1407637929/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuertee%20Auto-first-third-person%20view%200p704-27452-0-704.zip?fid=1000038209&ttl=1535800201&ri=8192&rs=8192&setec=587164d9edddc7d6d9c70643d669c060"
    },
    {
      "fileId": "1000038210",
      "name": "kuAFTPV x MCM 0p704",
      "version": "0.704",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "16",
      "fileName": "kuAFTPV x MCM 0p704-27452-0-704.zip",
      "uploadedUnix": "1373463752",
      "modVersion": "0.704",
      "virusScanUrl": "https://www.virustotal.com/file/1e03f05c5d48b6d1768dfeb132379a024996f9e2cfd4d57be9ad3a1ecfaa7683/analysis/1407637982/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuAFTPV%20x%20MCM%200p704-27452-0-704.zip?fid=1000038210&ttl=1535800202&ri=8192&rs=8192&setec=4b30751603500160683844127b3daf52"
    },
    {
      "fileId": "1000038211",
      "name": "kuAFTPV merged with MCM 0p704",
      "version": "0.704",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "52",
      "fileName": "kuAFTPV merged with MCM 0p704-27452-0-704.zip",
      "uploadedUnix": "1373463859",
      "modVersion": "0.704",
      "virusScanUrl": "https://www.virustotal.com/file/4cff63a2b3c4c0cd7023c9124e463df7873b72beeb07b21dddfe01244842e2e2/analysis/1407637983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuAFTPV%20merged%20with%20MCM%200p704-27452-0-704.zip?fid=1000038211&ttl=1535800202&ri=8192&rs=8192&setec=6af6bfbcf4c491f1464e4732818329b4"
    }
  ]
}