{
  "modId": 27451.0,
  "modName": "Take a Book",
  "summary": "Small mod that allows you to steal or take the book without reading it first, therefor keeping it in \\\"unread\\\" state in mods like Unread Book Glow.",
  "descriptionHtml": "[center][img]http://i.imgur.com/nOKqX.png[/img][/center]\r\n\r\n[b]Small mod that allows you to steal or take the book without reading it first, therefore keeping it in \\\"unread\\\" state in mods like Unread Book Glow.[/b]\r\n\r\nAs I couldn\\'t find this functionality in any mod and I really felt like it\\'s something that is missing for all of us avid book readers, who want to read their books in peace somewhere on the bench in the city instead of in the middle of the dungeon full of skeletons, bandits and whatnot.\r\n\r\nBasically you are given an option every time you activate a book via menu box - do you want to take/steal it or read it?\r\n\r\nThis includes \r\n[list]\r\n[*]lore books,\r\n[*]skill books,\r\n[*]quest books,\r\n[*]notes.\r\n[/list]\r\n\r\nI\\'ve seen an attempt to do this in [url=\\\"http://skyrim.nexusmods.com/mods/9960\\\"]Improved Skill Books[/url], but only for skillbooks, so that they can be read later. As it is implemented in ISB now, it doesn\\'t work properly with saves made before activating the mod, and it also doesn\\'t steal books that should be stolen - game simply puts the book in your inventory, so if someone notices this bold criminal act, they will think nothing of it, because the book just disappeared and magically appeared in player\\'s backpack. That is not stealing, that must surely be Talos will, so common folks don\\'t get mad at you.\r\n\r\n[center][i]Since I\\'m new to modding Skyrim and this is my first project, I would like to thank Borgut1337, author of [url=\\\"http://skyrim.nexusmods.com/mods/19447\\\"]Sneak Tools[/url] (among others), who I got the idea on how to make this work properly from.[/i][/center]",
  "categoryId": "27",
  "version": "1.0",
  "author": "ceemko",
  "createdUnix": "1353951264",
  "updatedUnix": "1353951264",
  "containsAdultContent": false,
  "uploadedBy": "ceemko",
  "primaryFile": null,
  "files": []
}