{
  "modId": 27476.0,
  "modName": "Seduction Spell",
  "summary": "Seduction Spell from Nikitaa\\'s Succubus Race Mod. Casting this spell on a target will make them fall in love with you and do whatever you ask.",
  "descriptionHtml": "Seduction is an apprentice-level illusion spell that will make the target fall in love with you \r\nand perform almost any task you desire him or her to do.When the target is hit by the spell they will become your follower for a total of 50 seconds. During this interval your target reticle \r\nshould display follower commands such as wait here, take item, unlock door, and attack. The effected target should do anything that you command. However, the effected target cannot be a follower or be commanded to attack members of its own faction. If you try to make the target attack someone of their own faction the spell will break and both targets will attack you. The spell can be learned by purchasing its spell tome at any of the mage vendors in the main cities. It can be equipped to either hand but will not show the glowing spell animation or make any ambient sound. It has a range of 0, so you must be touching the target to effect them. There are no major issues with this spell mod, just that most characters have a limited ability to follow/perform actions due to the fact that they can only do what the game script allows them to. This means if you ask a certain character to sit down on a seat that you have never seen them sit on, they will be unable to do the task.\r\n\r\nThe spell effect and sound have been taken from Nikitaa\\'s Succubus race (link below). Visit her site for videos.\r\nhttp://skyrim.nexusmods.com/mods/22903",
  "categoryId": "75",
  "version": "1",
  "author": "Chapmister333",
  "createdUnix": "1353992270",
  "updatedUnix": "1353992364",
  "containsAdultContent": false,
  "uploadedBy": "chapmister333",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101892",
      "name": "SeductionSpell",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "859",
      "fileName": "SeductionSpell-27476-1.zip",
      "uploadedUnix": "1353992364",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f0e77f2ecf7c0470a5c0df58541b36e4eb954b2cc9076e1fb4d028891775fa31/analysis/1407280096/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SeductionSpell-27476-1.zip?fid=101892&ttl=1535800241&ri=8192&rs=8192&setec=addc75d0aa612d4f13c9e6bbb2fcd178"
    }
  ]
}