{
  "modId": 27478.0,
  "modName": "Androsos - The StormCloak",
  "summary": "",
  "descriptionHtml": "----Basic Info----\r\nNord\r\nCant be killed\r\nLocation- Windhelm\r\n----Equipment----\r\nSteel Battle Axe\r\nStormCloack General Armor\r\nCoin\r\n----Lore----\r\nHe fought in The Great War and was severely wounded in the Retaking the Imperial City. Barley alive and burned from a building that collapsed he was dragged to safety by a young solider named Jongoa. It took 2 days for him to fully recover (Burns are still on face) And was relocated to Highrock were he stayed there as a guard in Dagerfall, After five years of staying in HighRock he was relocated to Valenwood to fight a splinter group of Thalmor who did not agree with the The Great war Treaty. 20 years later he was finally relocated to skyrim where he fought in the civil war. After getting wounded in battle and left for dead he was captured by the Stormcloacks. After being to tourcherd for several months he was given the opertunedy to fight for the rebels. He Joined the stormcloacks and fought at the Battle of Markarth where he saved Ulifric and the other stormcloacks by fighting off the Imperials and the Thalmor. After every one was clear of the city, Androsos got out of the city and tried to make his way back to Windhelm. It took him a year to travel to Windhelm to Markarth. He now resides in Windhelm \r\n ",
  "categoryId": "66",
  "version": "V.1",
  "author": "Myth0is",
  "createdUnix": "1353997278",
  "updatedUnix": "1353997345",
  "containsAdultContent": false,
  "uploadedBy": "Myth0is",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101901",
      "name": "Androsos",
      "version": "V.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Androsos-27478-V-1.rar",
      "uploadedUnix": "1353997345",
      "modVersion": "V.1",
      "virusScanUrl": "https://www.virustotal.com/file/d0909473f8fb50c24e5fd471718df6ecdce366d8b9e0961f4fdffc4e640d0984/analysis/1407280157/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Androsos-27478-V-1.rar?fid=101901&ttl=1535800244&ri=8192&rs=8192&setec=dc87d37f007cd06e01fa3a8c6ee50e46"
    }
  ]
}