{
  "modId": 27491.0,
  "modName": "More Realistic Mjoll",
  "summary": "Changed Mjoll\\'s appearance, some of her mechanics, and added some flavor to her backstory.",
  "descriptionHtml": "This is a pretty simple mod. Primarily I changed Mjoll the Lioness\\' appearance. Before she looked... unrealistic to me. She didn\\'t have the look I\\'d expect a warrior woman \r\n\r\nlike her to have, so I changed it. Mjoll is one of my favorite character\\'s however, so I decided to do a little extra. Not much, but I tried to give her a bit more depth, fix some bugs, and add a wee bit of backstory.\r\n\r\nIn terms of specifics, I changed some of her equipment around a bit, I hopefully fixed the bug where she won\\'t equip any ring you give her, I changed a little bit of her AI, and I changed her skills and fighting style. The latter is simply because Mjoll USED to specialize in 2h, but Grimsever is a 1her. All I did there was change her to a sword and shield fighting style.\r\n\r\nI also removed her level cap so she should level with the player up to level 100, similar to followers like Aela and J\\'Zargo.\r\n\r\nAs a finishing touch, I added some minor backstory. It was a spur of the moment kind of thing. It should be hard to find, but piecing together the whole story might be a bit of a challenge. I\\'ll not spoil it, but it was just something I did for fun.\r\n\r\nFAQ:\r\nQ: What does the mod do?\r\nA: Primarily changes Mjoll\\'s appearance, but does add a little extra content as well.\r\n\r\nQ: Why\\'d you make it?\r\nA: Mjoll is possibly one of my favorite characters, but she\\'s never been 100% convincing in her role to me. I figured I\\'d change that as best I could.\r\n\r\nQ: It\\'s borked, it sucks, it gave me cancer, four hundred camels suddenly poured out of my CPU and trampled my sister to death, what gives?\r\nA: As much as I hate to admit it, this is my first Skyrim mod. I\\'ve been modding for about 10 years off and on since Morrowind but I\\'ve only recently really gotten in to making Skyrim mods so I\\'m relearning the ropes here and I apologize if this in any way inconveniences you!\r\n\r\nINCOMPATIBILITIES:\r\nUnofficial Skyrim Patch - The Patch does a similar fix to one of mine, but in a different way. I change Mjoll to use one handed weapons, they made Grimsever a two handed one. I haven\\'t thoroughly tested how the two interract, so be warned.",
  "categoryId": "66",
  "version": "1.1",
  "author": "Sylvanicus",
  "createdUnix": "1354045917",
  "updatedUnix": "1354045980",
  "containsAdultContent": false,
  "uploadedBy": "Sylvanicus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101966",
      "name": "MoreRealisticMjoll",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "76",
      "fileName": "MoreRealisticMjoll-27491-1-1.zip",
      "uploadedUnix": "1354045980",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b6d07e79f52c21544bba130d48332d9b5222538f391c8177b473eef63fa2b85d/analysis/1407280874/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MoreRealisticMjoll-27491-1-1.zip?fid=101966&ttl=1535800264&ri=8192&rs=8192&setec=4d63f148d5338ad619503b40d3499428"
    }
  ]
}