{
  "modId": 27520.0,
  "modName": "Limbwood Manor - Deutsche Uebersetzung",
  "summary": "Ein wunderschoenes, nobles Baumhaus, welches sich nahe Ivarstatt befindet. \r\n\r\nDies ist die deutsche Uebersetzung von Ithlias Limbwood Manor.",
  "descriptionHtml": "[COLOR=#669933][b]Dies ist die deutsche Übersetzung von Ithlias Mod, welche nun nicht mehr auf Nexus sondern auf [URL=http://tesalliance.org/forums/index.php?/files/file/1572-limbwood-manor/]TES Alliance[/URL] zu finden ist.\r\n\r\nAlle Rechte an dieser Mod liegen bei Ithlia.\r\nIch habe lediglich das Recht einer Uebersetzung erhalten. \r\nFragen zur Mod selbst, stellt bitte an sie.\r\n\r\nDie Versionen 4.0 und 4.5 unterscheiden sich nur darin, dass in 4.5 hinter dem Hühnerstall noch ein Schmelzofen zu finden ist. \r\n [/COLOR] [/b]\r\n\r\n\r\n[center]************************************[/center]\r\n\r\n[COLOR=#F0FFF0]\r\nDiese Mod fügt in der Nähe von Ivarstatt ein kleines Baumhaus ein, welches durch ihren Ideenreichtum und der gestalterischen Umsetzung Ihresgleichen sucht. Es ist kein Baumhaus, wie man es sich im ersten Augenblick vorstellen mag. Es ist ein nobel eingerichtetes Heim, welches sich im Baumstamm einer alten Kiefer befindet. Limbwood Manor liegt im nordosten Ivarstatts, direkt nördlich von Geirmunds Halle. Um Zutritt zum neuen Heim zu bekommen, müsst ihr den Hausschlüssel in den Tiefen von Geirmunds Halle finden. \r\n\r\nDas Äußere des kleinen Anwesens ist einfach und liebevoll gestaltet. Hier findet ihr einen kleinen Brunnen, einen Hühnerstall, einen kleinen Tisch mit einem Schachbrett sowie zwei Hockern. Der Weg zum Haus ist mit Steinplatten bedeckt, die Ränder liebevoll mit Blumen und Pilzen dekoriert.Die ersten beiden Ebenen befinden sich im Inneren der alten Kiefer, die oberen beiden Etagen im Haus, welches sich in der Baumkrone befindet. \r\nIm Eingangsbereich findet ihr alles, was das Schmiede- und Handwerksherz begehrt. Ihr habt an jedem Arbeitsbereich eine Verstaumöglichkeit für eure Materialien. Auf der zweiten Ebene könnt ihr eure Waffen und Rüstungen ablegen, bzw. dekorativ an die Wand hängen. Es befinden sich hier 3 Puppen. Diese stehen auf jeweils einem Schränkchen, die für weitere Kleidung genutzt werden können. \r\nAuf der 3. Ebene nun könnt ihr euch ausruhen, in der Ecke mit einem schönen Buch sitzen und dem Kaminfeuer lauschen. Hier könnt ihr auch euren Wünschen für das leibliche Wohl nachgehen. Es befinden sich ein gekühltes Aufbewahrungsfach für eure Speisen, ein Weinregal, einen Schrank für eure Kräuter und viel Platz für weitere Tränke im Küchenbereich. Eine Arbeitsfläche, um eure Speisen zuzubereiten oder um eure Kräuter in Tränke zu verwandeln findet ihr vor diesen Schränkchen. \r\nUnd eine Kochnische am heimischen Kamin darf natürlich auch nicht fehlen. Eine Tür weist euch den Weg auf die Veranda, die euch einen schönen Ausblick beschert. Die kühle Abendsonne lädt hier nach einem anstrengenden Tag zum Verweilen ein.\r\nAuf der letzten Ebene findet ihr einen Schreibtisch, mit Fächern für eure Papiere, Notizen und Schriftrollen. Außerdem könnt ihr hier euren Arkanen Verzauberkünsten nachgehen und eure Juwelen im Schmuckkästchen ablegen. Hinter einem schönen Bild versteckt sich noch ein Wandsafe. Zuletzt finden sich hier 2 schön bezogene und saubere Betten für das müde Drachenblut und einen Begleiter.\r\n\r\nEin Wort der Warnung: Es kann vorkommen, dass ihr durch die Terrasse fallt und so warscheinlich tot auf dem Boden landet. [/color]\r\n\r\n[COLOR=#669933][b]Kurze Infos: [/COLOR][/b][COLOR=#F0FFF0]\r\nDie Lagerungsmöglichkeiten sind sicher, es werden keine Sachen abhanden kommen. Der Alchemietisch sowie der Arkane Verzauberer sind selbst hergestellt worden. Die Mod wurde mit TES5Edit gesäubert und ist Begleiterfreundlich.\r\nIhr findet im Download-Bereich der originalen Mod sowie meiner Übersetzung eine erweiterte Version (4.5) namens Limbwood Manor with added Smelter. Diese verfügt über einen Schmelzofen hinter dem Hühnerstall. [/color]\r\n\r\n[COLOR=#669933][b]Bitte beachtet noch Folgendes:[/COLOR]\r\n[/b]- Dawnguard oder Hearthfire ist NICHT erforderlich\r\n- Unbedingt erforderlich ist aber Patch 1.8\r\n- Limbwood Manor ist möglicherweise nicht kompatibel mit Mods, die die Größe der Vanilla-Bäume verändert\r\n\r\n[b]Viel Spaß beim Erforschen eures neuen Heims.[/b]\r\n\r\n\r\n[center]************************************[/center]\r\n\r\n\r\n[COLOR=#669933][b]Installation:[/COLOR]\r\n[/b]- Ladet euch zuerst die originale  Mod [URL=http://skyrim.nexusmods.com/mods/27250]Limbwood Manor[/URL] von Ithlia herunter und installiert sie (Dazu entpackt ihr den Inhalt der Mod in den Data-Ordner eures Spiels)\r\n- Danach ladet ihr euch meine Übersetzung und überschreibt die LimbwoodManor.esp\r\n\r\n[COLOR=#669933][b]Deinstallation:[/COLOR]\r\n[/b]- Löscht die LimbwoodManor.esp sowie die Ordner Treehouse123 in den Ordnern Textures, Meshes und Sound/FX.\r\n\r\n\r\n",
  "categoryId": "67",
  "version": "V4.50",
  "author": "Lorina",
  "createdUnix": "1354116957",
  "updatedUnix": "1354447235",
  "containsAdultContent": false,
  "uploadedBy": "Lorina",
  "primaryFile": null,
  "files": [
    {
      "fileId": "102745",
      "name": "Limbwood Manor 4_0 DV",
      "version": "4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "205",
      "fileName": "Limbwood Manor 4_0 DV-27520-4-0.rar",
      "uploadedUnix": "1354447115",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/a8419ca3b3aec6d28c44b2589416b73917250f14a72568e166d73a8d86587ab5/analysis/1407288365/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Limbwood%20Manor%204_0%20DV-27520-4-0.rar?fid=102745&ttl=1535800316&ri=8192&rs=8192&setec=3bddcbefc65932c49d8e1d2e6014a3d4"
    },
    {
      "fileId": "102746",
      "name": "Limbwood Manor 4_5 DV mit Schmelzofen",
      "version": "4.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "207",
      "fileName": "Limbwood Manor 4_5 DV mit Schmelzofen-27520-4-5.rar",
      "uploadedUnix": "1354447235",
      "modVersion": "4.5",
      "virusScanUrl": "https://www.virustotal.com/file/c54d70b523fe22f84f91e92a5c813b83bc2256702b767505f8cb0caa384e4fda/analysis/1407288366/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Limbwood%20Manor%204_5%20DV%20mit%20Schmelzofen-27520-4-5.rar?fid=102746&ttl=1535800317&ri=8192&rs=8192&setec=f068d5f21caf5421460782d5bba09478"
    }
  ]
}