{
  "modId": 27531.0,
  "modName": "Dragon Soul Relinquishment",
  "summary": "Go inside High Hrothgar and relinquish captured dragon souls to redeem shout recovery, shout power, perk points, carry weight or unarmed damage. Lore friendly implementation with animations and effects. Customizable costs and values.",
  "descriptionHtml": "[center]\r\n[img]http://static2.nexusmods.com/110/images/621184-1354137508.jpg[/img]\r\n[youtube]uzF_iLgLr00[/youtube]\r\n\r\n[url=http://www.skyrimgems.com][img]http://SkyrimGEMS.com/images/badge_featured_500.png[/img][/url]\r\n[size=4][b](Category 320 - Miscellaneous Gameplay)[/b][/size]\r\n[/center]\r\n\r\n\r\n[heading]Features[/heading]\r\n[list]\r\n[*] Relinquish captured dragon souls to redeem bonuses.\r\n[*] Lore friendly implementation with animations and effects.\r\n[*] Customizable.\r\n[/list]\r\n\r\n[heading]Installation[/heading]\r\n[list=1]\r\n[*] Update Skyrim to minimum 1.8.151.0.7 version.\r\n[*] You can now download and install the mod.\r\n[/list]\r\n\r\n[heading]Uninstallation[/heading]\r\n[list=1]\r\n[*] Open console and type (StopQuest DSR).\r\n[*] Save the game.\r\n[*] Uninstall the mod.\r\n[/list]\r\n\r\nWhen quest is stopped everything except perk points will reset and relinquished dragon souls will be reimbursed.\r\n\r\n[heading]Description[/heading]\r\nThis mod allows you to spend dragon souls to improve some of your character abilities. It is designed toward the late game when all shouts are already unlocked and dragon souls become useless but you may as well use it in early game. Go inside High Hrothgar where you will find a dragon stone. To interact with the stone you must be acclaimed as Dragonborn by completing the Greybeard\\'s trials (retrieving The Horn of Jurgen Windcaller and learning last word of Unrelenting Force shout). You can then meditate at the stone and perform the ceremony to relinquish any number of unspent dragon souls and redeem specific bonus via easy to use interaction menu. Available bonuses are: Shout Recovery (reduces time between shouts), Shout Power (increases damage of Fire Breath and Frost Breath shouts), Perk Points (adds free perk points), Unarmed Damage, Carry Weight and Attributes (health/magicka/stamina). Each bonus has its own cost, increment value and maximum value.\r\n\r\n[heading]Costs, Values, Balance and Tweaking[/heading]\r\nSome people will finish the game with no more than 20 unspent dragon souls while others might have as much as 200.\r\n\r\nDefault cost and increment values are set according to my own taste:\r\n[list]\r\n[*] Shout Recovery (max 50%, 1 soul = 2%)\r\n[*] Shout Power (max 400%, 1 soul = 8%)\r\n[*] Perk Points (max 100, 5 souls = 1 perk)\r\n[*] Unarmed Damage (max 100, 1 soul = 4 damage)\r\n[*] Carry Weight (max 500, 1 soul = 20 weight)\r\n[*] Attributes (max 500 per attribute, 1 soul = 10 health or magicka or stamina)\r\n[/list]\r\n\r\nIt is not possible to reach ultimate balance and cater every play style so you can tweak all the costs and values to your liking by using SkyUI 3.0 MCM interface or via console by changing some of the global variables, if you find default ones imbalanced. Note that you can change this at any time during game play but you cannot undo what you\\'ve already invested (unless you\\'re uninstalling the mod and stopping the quest but I do not recommend doing that for sole purpose of resetting because all tracking variables will also reset).\r\n\r\n[u]Global variable names (default values):[/u]\r\nDSRShoutRecoveryCost (1)\r\nDSRShoutRecoveryIncrement (2)%\r\nDSRShoutRecoveryMaximum (50)%\r\nDSRShoutPowerCost (1)\r\nDSRShoutPowerIncrement (8)%\r\nDSRShoutPowerMaximum (400)%\r\nDSRPerkPointsCost (5)\r\nDSRPerkPointsIncrement (1)\r\nDSRPerkPointsMaximum (100)\r\nDSRUnarmedDamageCost (1)\r\nDSRUnarmedDamageIncrement (4)\r\nDSRUnarmedDamageMaximum (100)\r\nDSRCarryWeightCost (1)\r\nDSRCarryWeightIncrement (20)\r\nDSRCarryWeightMaximum (500)\r\nDSRAttributesCost (1)\r\nDSRAttributesIncrement (10)\r\nDSRAttributesMaximum (500)\r\n\r\nYou notice there are 3 types of variables for each bonus: Cost, Increment and Maximum. \\\"Cost\\\" is minimum number of dragon souls needed to increase the bonus by \\\"Increment\\\" value. \\\"Increment\\\" is minimum bonus amount you can get by investing \\\"Cost\\\" number of dragon souls. \\\"Maximum\\\" is a total limit for the given bonus amount.\r\nSo for example if you want to make each bonus free perk point cost 10 dragon souls instead of 5 you type in console (set DSRPerkPointsCost to 10). Furthermore, if you want to gain 2 perks for these 10 dragon souls type (set DSRPerkPointsIncrement to 2). Finally, if you want to make it so you can\\'t get more than 10 perks out of dragon souls type (set DSRPerkPointsMaximum to 10), alternatively you can set \\\"Maximum\\\" to 0 to make it unlimited.\r\n\r\n[heading]Compatibility[/heading]\r\nDSR should be compatible with all mods. No shouts are being modified and shout power is scaled via custom perk. Other bonuses are applied by modifying related actor values. Only possible conflict is that this mod uses one of custom actor values on player to store data for shout power scaling perk. There are 10 of these actor values (Variable01-Variable10) and other mods might use one of these for their own purpose. DSR can use any of the 10 and it is chosen and maintained automatically. If some other mod tries to change currently used actor value DSR will detect it and automatically switch to another one that appears to be free, eliminating all future conflicts with that specific mod.\r\n\r\n[heading]Change Log[/heading]\r\n[list]\r\nV1.2:\r\n[*] Added SkyUI 3.0 MCM support for easy mod configuration.\r\n[*] Added health, magicka and stamina attribute bonuses.\r\n[*] NPCs cannot meditate at dragon stone while sandboxing anymore.\r\n[*] Source code is now included in the package.\r\nV1.1:\r\n[*] Removed perk point SKSE dependency.\r\n[*] Dragon stone can now be used even if player has sided with Blades.\r\n[*] Fixed a bug that caused player not to enter meditation state if dragon stone has been activated while weapon is drawn.\r\nV1.0:\r\n[*] Initial release.\r\n[/list]",
  "categoryId": "24",
  "version": "1.2",
  "author": "Alek",
  "createdUnix": "1354137800",
  "updatedUnix": "1357598641",
  "containsAdultContent": false,
  "uploadedBy": "mitchalek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000825",
      "name": "Dragon Soul Relinquishment v1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "84",
      "fileName": "Dragon Soul Relinquishment v1_2-27531-1-2.zip",
      "uploadedUnix": "1357598641",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/f47fa236821efc1b4df818452bd9dd61e4be274bf35b85602ca591eee2b26751/analysis/1407342730/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Soul%20Relinquishment%20v1_2-27531-1-2.zip?fid=1000000825&ttl=1535800337&ri=8192&rs=8192&setec=04ecabf88afce3fbdad9e60278be5e40"
    }
  ]
}