{
  "modId": 27540.0,
  "modName": "Disciples of Azura",
  "summary": "A new Robe, Hood, Boots and a new useful spell. \r\n\r\nThe Trappings of a Disciple of Azura.",
  "descriptionHtml": "[center][img]http://static.skyrim.nexusmods.com/images/3242321-1354156009.jpg[/img][/center]\r\n\r\nThis is a work in progress btw. Some pics of the next 2.0 version are already up, new boots, gloves and proper Khajit and Argonian textures - any feedback appreciated.\r\n\r\nI\\'ve always considered the quest rewards for The Black Star quest to be a no-brainer as a mage.\r\n\r\nAs a caster, you don\\'t want another caster as a companion - most times you want some muscle. \r\nSo the choice between a soul gem that will take ANY soul and one that won\\'t take humanoid souls is a pointless one.\r\n\r\nThis mod aims to change that. If you are true to Azura, she will be true to you.\r\n\r\n[color=red]The Mod Provides a new Robe, Hood, Boots, Gloves and a Spellbook - the outfit is made of totally new textures which I made and are enchanted.\r\nAll items now have a craftable unenchanted version as well - available at the tanning rack under misc.\r\n\r\nThe spell is in the images, you can see what it does and it\\'s also totally new to the game - if not to the nexus ;)\r\n[/color]\r\nAll items are on Aranea at the completion of the quest, you can just dip into her inventory for them - 2 sets of the outfit in case you wish to give one to her.\r\n\r\nIf you wish to give the broken star to Nelacar and complete the quest that way, then you obviously don\\'t get these items, however you get the Black Star instead. Seems like a good tradeoff.\r\n\r\nYou CAN still kill Aranea for them ;)\r\n\r\nAll BSA, no loose files. Please report any issues at all.\r\n\r\nEnjoy!",
  "categoryId": "75",
  "version": "2.3",
  "author": "thefinn",
  "createdUnix": "1354152902",
  "updatedUnix": "1354862779",
  "containsAdultContent": false,
  "uploadedBy": "thefinn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103606",
      "name": "Disciples of Azura",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5796",
      "fileName": "Disciples of Azura-27540-2-3.7z",
      "uploadedUnix": "1354862779",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/befa7e3bec689c1ffd53cdcf27fc5d0c52bea4c58749c523f0849fb6cf9f277f/analysis/1407293898/",
      "changelogHtml": " Fixed gloves being considered armor, they should no longer appear for sale at blacksmiths etc. <br/> \n I am hoping that&#39;s the last of the fixes needed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Disciples%20of%20Azura-27540-2-3.7z?fid=103606&ttl=1535800347&ri=8192&rs=8192&setec=4aa934548ca65225387f7f7fd4cab2b4"
    }
  ]
}