{
  "modId": 27548.0,
  "modName": "Hold and Faction Specific Armors_HSA_WIP",
  "summary": "WIP Open for Testing please give feedback\r\n1: This Mod Requires Immersive Armors Found here http://skyrim.nexusmods.com/mods/19733\r\n2: Recommended Use with Cloaks of Skyrim\r\n2:This mod replaces the original armor loadouts of all hold guards, stormcloak soldiers, imperial soldiers, and Blades with armors.",
  "descriptionHtml": "[center][size=10][color=black][b][u].::News::.[/u][/b][/color][/size][/center]\r\nHello again folks. I\\'ve Finally started working on the mod again and after a few days work i thing i finalyl have a non-crashing full DLC compatabible (also no DLC required) version of the mod working. It will be up on the nexus for user testing with in the hour.\r\n\r\nI have redone some of the armors i will post pictures of the new Falkreath and Riften Armors. They are now the Mercenary and Hunters armors from the Immersive armors Pack. In addition Due to problems that i believe lead to crashing with the stormcloaks They are left wearing standard stormcloak armors.\r\n\r\nThis does have support for post Civil War armors too or it should Still testing that out.\r\nI will be working towards putting out some optional addons for this mod like: \r\n1) Blades where Akaviri Samurai Armor\r\n2) Imperials where Imperial Steel Armor instead of Leather\r\nbut i have to figure out exactly how i want to do that. I would expect them somtime during July though i will not give a specific timetable since i suck at keeping to that. \r\n\r\nEnjoy and Please contact me if you have issues.\r\n\r\n[center][size=8][b][u][i][color=green]=This Mod Absolutely Requires Immersive Armors=[/color][/i][/u][/b][/size][/center]\r\n[url=http://skyrim.nexusmods.com/mods/19733]Immersive Armors[/url] by hothtrooper44\r\n\r\n\r\nThis Does Not Require a New Game Though you may need to leave an area and comeback to notice a change the first after you first install it (i recommend fast travel if you choose to do this).\r\nPersonally i would recommend restart for best performance.\r\n\r\nIf you find a naked guard ~ click on the guard (make sure the id # is not your characters) Then type Resurrect to see if it fixes it. If it does fix it the guard just needed to be reset. If it does Not Fix it Please note For Guards: the Hold the Guard is in, the Faction the Guard is probably aligned with (stormcloak or Empire) and the City he belongs to.\r\n\r\nIt is also Recommended that you do not attack guards early in game Possibly even into mid game, guards will now be more formidable most are wearing high value heavy armors now.\r\n\r\n[color=green]Brief Disclaimer[/color]: Please As you Donwload This Remember the Title Says WIP the title does not say completely 100% bug free. If you are having issues with armor displaying I need to know a bit more than \\\"SOMETIMES MY GUARDS ARE NAKED\\\". With an issue like that i need to know which guards in which city so i know what is going on, and also what faction they are a part of. \r\n\r\nFor Crashes Please ensure that Your Load Order Matches the Instructed one(or any other instructions in a download link). If that does not fix it please provide a list of other mods that you are using.\r\n\r\nAlso Not Posting LIKE THIS, will probably get you a quicker response to your issue. Personally i find Caps Offensive, whether you disagree with me there that\\'s whatever But your issue will have more weight if you try to use your typing manners when expressing it.\r\n\r\n[color=green]Load Order Instructions:[/color] Make Sure this comes after Immersive Armors(and cloaks) just to avoid funny businness >.>.\r\n\r\n[center][size=9][color=orange][b][u]Description[/u][/b][/size][/color]\r\nHold and Faction Specific Armors aims to replace the default armors of non-distinct groups in the game. For example ever noticed how the Hold Guards all wore practically the same Uniform despite the differing Sociopolitical positions of the various holds? Has that ever bothered you? Well it won\\'t anymore. Each hold has been updated to have a unique armor set, from the Immersive Armors Mod, that either better reflects the qualities of the hold or it\\'s perceived status in the grand hierarchy of the holds. How So?\r\n\r\n[u][b]Imperial Initial Holds[/b][/u] since they have the backing of the empire are likely to have better armors though nothing too unimagineable:\r\n\r\n[u]Markarth - Hedge Knight armor[/u]\r\nhaving a decent, yet not entirely wealthy economy, the Guards hear are equiped with a fairly standard yet still ornate yet simple armor.\r\n\r\n[u]Solitude - Spellbinder Armor[/u]\r\nThe richest of the holds and center of the imperial war effort Solitude has spaired no expense to equip it\\'s guards with the best of the best, showing class while bolstering a strong Defense.\r\n\r\n[u]Whiterun - Vanguard Armor[/u] \r\nOne of the 2 Imperial Gateway holds into skyrim, as well as controlling skyrims major central road, Whiterun Guards have taken up the mantle of the Vanguard and watch over travelers and soldiers Alike as they pass through the hold.\r\n\r\n[u]Falkreath-Mercenary Armor[/u]\r\nThe Corrupt Jarl of this hold doesn\\'t trust his people with any real power instead he\\'d rather higher an assortment of bandits and mercenaries to guard [i]his[/i] hold.\r\n\r\n[u]Morthal-Apotheus Armor[/u]\r\nNot the richest or most vital of cities it was gifted large quantaties of this light, yet durable armor to serve it\\'s guards well incase the Stormcloaks ever became brazen enough to lead an attack on the Frontline Hold.\r\n\r\n[u][b]Stormcloak[/b][/u] initial Holds have adopted more nordic or traditional armors inorder to battle the cold, survive the savage attacks from man and beast alike, even to blend better with their environment tracking violators as steathily as possible:\r\n\r\n[u]Riften - Hunter[/u]\r\nHome to one of the warmer environments in skyrim as well as being one of the most mountainous and wooded; the Rangers of the Rift have chosen to go the minimalist route. Wearing as little heavy plate as possible and instead Wearing Armor fit for fast, stealthy, and light Rangers.\r\n\r\n[u]Windhelm - Stormcloak[/u]\r\n\r\n\r\n[u]Winterhold and Dawnstar [/u]- Variants of Einherjer Armor\r\nBeing among the harshest holds in skyrim and containing many of the elaborate Nordic Tombs written and spoken about for ages they have clung to older and warmer ways seeking to maintain their Culture above all else especially in the face of trade and mystical forces. \r\n\r\n [/center]\r\n\r\n[center][u][b][size=10].::Compatibility/Requirements::.[/size][/b][/u]\r\nReq: [url=http://skyrim.nexusmods.com/mods/19733]Immersive Armors[/url] by hothtrooper44\r\nWithout the Above Mention mod your guards will be naked as naked as can be at least on their torso hands and feet including their head in some places.\r\nReq: Dawnguard- Game CTDs on start with out it.\r\n\r\nCompatable with:\r\nCloaks of Skyrim\r\n\r\n\r\nThis mod may be incompatible with other mods that edit [i]specifically[/i] the [u]default guard armor lists[/u] [/center]\r\n\r\n\r\n[u]Issues I\\'ve Noted aside from dawnguard[/u]\r\n\r\n[u]1.[/u] Entering a gated city under vampire attack sometimes casued a crash. I have no idea why this was And it hasn\\'t been tested yet with the new version. Previously i\\'ve only experienced this issue with windhelm i\\'m not sure if it would extend to other random encounters such as dragon attacks in gated cities or what or even if it extends to other gated cities. If anyone has anymore information regarding crashes of this type Please Contact Me with information. This is easily Fixable Simply Reload to a point outside the city (so i\\'d recommend a quicksave just before entering a city) And reload the game to that point and re-enter the city. This should reset the chance of the vampire attack or put you outside the time of such an occurrence.",
  "categoryId": "33",
  "version": "0.1.3",
  "author": "Darth_Lopez",
  "createdUnix": "1354159798",
  "updatedUnix": "1370974604",
  "containsAdultContent": false,
  "uploadedBy": "lopez125",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033830",
      "name": "HSA 1_3 Cloaks",
      "version": "1.3 with Cloaks support",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "HSA 1_3 Cloaks-27548-.rar",
      "uploadedUnix": "1370974281",
      "modVersion": "1.3 with Cloaks support",
      "virusScanUrl": "https://www.virustotal.com/file/0b2e6b12f8aef3e4be962ca29a1eb76263b6a212076977817aad209c213df132/analysis/1407600433/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HSA%201_3%20Cloaks-27548-.rar?fid=1000033830&ttl=1535800358&ri=8192&rs=8192&setec=63c13a16678fc107d423aa1e98a41811"
    },
    {
      "fileId": "1000033831",
      "name": "HSA 1_3 No Cloaks",
      "version": "1.3 No Cloaks",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "HSA 1_3 No Cloaks-27548-1-3.rar",
      "uploadedUnix": "1370974604",
      "modVersion": "1.3 No Cloaks",
      "virusScanUrl": "https://www.virustotal.com/file/e6acb829f150c7e7f69abb35b1ea5c950135966b99c09dc7e4a8329acc9c6a78/analysis/1407600434/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HSA%201_3%20No%20Cloaks-27548-1-3.rar?fid=1000033831&ttl=1535800359&ri=8192&rs=8192&setec=535fd08e23749c94a142ffc1b7aac0a2"
    }
  ]
}