{
  "modId": 27554.0,
  "modName": "Shout-Tastic - NO COOLDOWNS Edition",
  "summary": "This is a \\\"NO COOLDOWNS\\\" version of Shout-Tastic. The goal of this mod is to enhance the fun and usefulness of some of the less popular dragon shouts. The damage dealt by Fire Breath and Frost Breath has been significantly increased, and many of the shouts have been tweaked. Now you can engage in a battle of the Thu\\'um with the deadliest dragons",
  "descriptionHtml": "[center][img]http://i.imgur.com/4Vm4F.png[/img][/center]\r\n\r\n==========================\r\nUPDATE v1.21 Dec 26, 2012\r\n\r\nMinor fix applied to the Dismay shout, some users previously reported this shout still included a cooldown.\r\n\r\nBe sure to download the updated version 1.21 to get the Dismay shout with no cooldown.\r\n========================== \r\n\r\nThis is a \\\"NO COOLDOWNS\\\" version of Shout-Tastic. If you would like to try the normal version with cooldowns, here is the link: [url=http://skyrim.nexusmods.com/mods/23137]http://skyrim.nexusmods.com/mods/23137[/url]\r\n\r\nThe goal of this mod is to enhance the fun and usefulness of some of the less popular dragon shouts. The damage dealt by Fire Breath and Frost Breath has been significantly increased, and many of the shouts have been tweaked. Now you can engage in a battle of the Thu\\'um with the deadliest dragons of Skyrim.\r\n\r\nIn particular it seemed if the player goes through the effort to find and unlock the third word of any dragon shout, it should be both fun and useful. Accordingly, the third words of several shouts have new secondary effects.\r\n\r\nTwo new quests added, A Trace of Aetherium and Synearil\\'s Legacy, which make it possible to craft the Dovah Mir, a magical talisman you can give to your follower to protect them from friendly fire damage by player shouts. \r\n\r\nIn order to begin A Trace of Aetherium: [spoiler]you must be at least level 10 and have already killed Sahloknir [/spoiler]\r\n\r\nIn order to begin Synearil\\'s Legacy: [spoiler]after completing A Trace of Aetherium, you must return to Synearil\\'s Shrine and pray to Talos[/spoiler]\r\n\r\n\r\nBeside the no cooldowns, other changes to the shouts include:\r\n\r\n- Third word of Ice Form enhanced with an AoE Ice Form Blast\r\n- Unrelenting Force damage is same as vanilla but force is more powerful \r\n- Third word Dismay has new visual effect, and affects undead\r\n- Third word Throw Voice summons a decoy at the target area and allows player to remain undetected\r\n- Third word of Animal Allegiance summons mighty beasts of the forest to aid the Dovahkiin\r\n- Third word of Aura Whisper adds temporary boost to Sneak and Pickpocket\r\n- Third word of Disarm affects higher level enemies\r\n- Third word of Kyne\\'s Peace affects people as well as animals\r\n\r\n\r\nMany thanks to B1gBadDaddy, Herko_ter_Horst, hellay-fr, Irfeir and Black RL for all your help! Special thanks to Chesko, who suggested the idea of the Dovah Mir talisman, and to Mizzou who suggested some tweaks for A Trace of Aetherium.\r\n\r\nPlease let me know if you have any feedback or suggestions for improvement below!\r\n\r\nThis mod is also available on Steam Workshop: [url=http://steamcommunity.com/sharedfiles/filedetails/?id=110672879]http://steamcommunity.com/sharedfiles/filedetails/?id=110672879[/url]\r\n\r\nINSTALLATION:\r\nSimply unpack and drop Shout-Tastic_no CD.esp and Shout-Tastic_no CD.bsa into your Skyrim Data folder.\r\n\r\nCOMPATIBILITY:\r\nThis mod is not compatible with the normal version of Shout-Tastic, and it is most likely not compatible with any mod which changes shouts or HighHrothgarExterior01\r\n\r\nIt is compatible with Dawnguard and Hearthfire, but does not require either",
  "categoryId": "40",
  "version": "1.21",
  "author": "IcyDeadPe0ple",
  "createdUnix": "1354174911",
  "updatedUnix": "1356556866",
  "containsAdultContent": false,
  "uploadedBy": "IcyDeadPe0ple",
  "primaryFile": null,
  "files": [
    {
      "fileId": "102195",
      "name": "Shout-Tastic NO COOLDOWNS",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "43",
      "fileName": "Shout-Tastic NO COOLDOWNS-27554-1-2.rar",
      "uploadedUnix": "1354175248",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/7575cc9e57f4ec9d95ac01ba271dea404f2e67625be3d50602f159ef5834297a/analysis/1407284103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shout-Tastic%20NO%20COOLDOWNS-27554-1-2.rar?fid=102195&ttl=1535800369&ri=8192&rs=8192&setec=98b31a4da71f7cea885b08bb59fe4c44"
    },
    {
      "fileId": "107723",
      "name": "Shout-Tastic NO COOLDOWNS ",
      "version": "1.21",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "43",
      "fileName": "Shout-Tastic NO COOLDOWNS -27554-1-21.rar",
      "uploadedUnix": "1356556866",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/3a6d6613a1aff596e53eec181ba88fed33987f3457880ea18e8912c0b48f1f4f/analysis/1407323559/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shout-Tastic%20NO%20COOLDOWNS%20-27554-1-21.rar?fid=107723&ttl=1535800370&ri=8192&rs=8192&setec=ba1835ce6bc3a5c58059110d1c7c5563"
    }
  ]
}