{
  "modId": 27567.0,
  "modName": "Ebony Inpregnated Dragon Bone Armor",
  "summary": "Work in progress\r\n\r\nConceptually, this armor is meant to adhere the rarest metals in Skyrim to Dragon bone. Thereby coating and reinforcing the Dragon bone by eliminating its porous nature. ",
  "descriptionHtml": "Work in progress\r\n\r\nYou\\'ve merged skyforge steel and ebony into something...else. And this ebony/steel coated dragonplate adds strength by eliminating the pourous nature of the dragon bone, making it much harder whilst also retaining its toughness.\r\nYour mastery of smithing and jewelcrafting has alotted you embelishments not found in your past accomplishments. Accompanied by the rarest, strongest materials, and\r\nyour unrivaled smithing ability, the world has never known an armor like this. There is only one forge in Skyrim whose flames are capable of marrying this kind of metal to bone, and only one person who can tame them.\r\n\r\nWear it well, Dragonborn.\r\n\r\nReason:\r\n\r\nIt didn\\'t sit well with me that many of the heavy armors lacked flexibility in the joints, and where rather poor by design. Now, that\\'s not to say this armor is realistic.\r\nIt most certainly is not, but it would at least allow for more articulation of the joints, and a more powerful swing of a sword (your sword arm should not be encumbered).\r\nBut I also had rationale behind making its armor rating higher, read above.\r\n\r\nI also wanted an armor that made good sense to wear as both a Mage, Warrior, and Archer. But with the upcoming DLC, I thought it should also look like someone who rides\r\na dragon into battle and who may just wield a spear.\r\n\r\nOh, and I wanted to look like a total badass. Regardless, I hope you enjoy it and good hunting.\r\n\r\nCompatibility:\r\n\r\nDoesn\\'t look so good with Bandolier. Reason being the Chest Plate extrudes out further than most. That said, if you dont use that part of bandolier, it should look\r\njust fine.\r\n\r\nOtherwise, the mod uses almost all existing skyrim geometry and bone weights. So it should work with any other mods.",
  "categoryId": "54",
  "version": "1.0",
  "author": "hass21",
  "createdUnix": "1354218816",
  "updatedUnix": "1354219005",
  "containsAdultContent": false,
  "uploadedBy": "hass21",
  "primaryFile": null,
  "files": [
    {
      "fileId": "102253",
      "name": "New Armor MAX files",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1594",
      "fileName": "New Armor MAX files-27567-1-0.zip",
      "uploadedUnix": "1354219005",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/49e585e962a89189554ab49f32226d59dc9b51c8429855a371cbcb23f7af4f6a/analysis/1407284588/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Armor%20MAX%20files-27567-1-0.zip?fid=102253&ttl=1535800386&ri=8192&rs=8192&setec=a63507f2508e6698e09051eac72b2801"
    }
  ]
}