{
  "modId": 27613.0,
  "modName": "Inhabitants of Skyrim - NPC Overhaul - Traduzione Italiana",
  "summary": "This is only a translation into Italian of the original mod.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/mods/23755] \t\r\nInhabitants of Skyrim - NPC Overhaul[/url].\r\nThe original mod aims to improve the facial morphology of most named NPCs and adds Apachii Hair to most of them. It also removes some dirt and some wrinkles. There is 2 versions to choose from, 1 with apachii hair and the other one without. \r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size][/center]\r\n\r\nQuesta interessante mod cambia l\\'aspetto di molti NPC del gioco! Esistono sono 2 versioni tra cui scegliere, na che richiede la mod Apachii Hair, e l\\'altra senza!\r\nIncluso anche l\\'addon per i followers!\r\n[color=RED]ATTENZIONE: ricordatevi, che per la versione 1 dovrete installare anche i seguenti mod, o il gioco crasherà:\r\n- ApachiiSkyHair_v_1_4_Full (Main file, full 1.4 version)\r\n- ApachiiSkyHairFemale_v_1_0 (Female Addon)\r\n- ApachiiSkyHairMale_v_1_0 (Male Addon)\r\n\r\nLi troverete [url=http://skyrim.nexusmods.com/mods/10168]qui[/url].[/color]\r\n\r\n[color=GREEN][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=GREEN][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "29",
  "version": "1.2",
  "author": "Andre7890",
  "createdUnix": "1354321246",
  "updatedUnix": "1354321246",
  "containsAdultContent": false,
  "uploadedBy": "Andre7890",
  "primaryFile": null,
  "files": []
}