{
  "modId": 27612.0,
  "modName": "DMRAFT Double Melons Round Ass Fine Tuned Body Replacer",
  "summary": "Finally the Double Melons Round Ass Fine Tuned Body Replacer comes to Skyrim!\r\n~~WORK IN PROGRESS~~",
  "descriptionHtml": "WARNING: ADULT CONTENT  -NUDITY-  \r\nDO NOT USE THIS MOD IF UNDER 18 YEARS OF AGE\r\n\r\nDISCLIAMER: \r\nnabernas and other modders who have participated in the making of this mod are not responsible for any file damage or corruption or reconfiguration of oblivion or other such undesirable changes to the downloader\\'s computer.  Backup your Oblivion/Data Meshes and Textures files first before installing the files from this mod.  You have been warned.\r\nNow that that is over with nabernas (and possibly others) are still willing to help if there are problems or you are unable to get the mod to work correctly, just realize: \r\nYOU ARE TAKING RESPONSIBILITY FOR YOUR COMPUTER AND THE DOWNLOADED FILES\\' INTERACTION WITH YOUR COMPUTER ONCE YOU DOWNLOAD THEM.\r\n\r\nThis is a Skyrim adaptation of the Nabernas modification to the DMRA Attempt 2 by coronerra.  Coronerra gave permission to us to use and edit DMRA Attempt 2.\r\nIt also includes the Coronerras Maximum Compatibility Skeletons and the Blemish Free Textures.  Only the main body texture was changed (footfemale.dds I believe) to be blemish free.\r\n\r\nV0.1.2\r\nSkyrim Alpha Phase version of DMRAFT still in delevopment.\r\n\r\nV1.2\r\nBBB Skeleton included FOR FIRST PERSON WOOHOO!  When re-installing my mods I realized I had this weird bood stretching problem where in first person view the left boob would poke out and then after typing tfc in the console and going into freecam, the left boob would litterally stretch out about 15 feet until it hit the floor or came right infront of the freecam and would move along with the freecam view.  I promptly decided to add the Maximum Compatibility Skeleton I had used in the the past (for the first person veiw) to the \\\"_1stperson\\\" folder and to the DMRA Fine Tune data folder, thus upgrading it slightly to version 1.2.  Sorry it took me that long to realize this was necessary:)\r\n\r\nV1.1\r\nIn version 1.1 the nipple glare that was in version 1.0 was removed thanks to the help of a commenter.\r\nThis current version only replaces the human female body \r\n(placing it in the imperial folder).\r\n\r\nThis is a slightly improved version of the DMRA upperbody and the DM body texture for the female DMRA body replacer.\r\n\r\nThere are five files, one to upgrade from DMRA attempt 2 to DMRA Fine Tuned Version 1.0, one to upgrade from DMRA Attempt 2 or DMRA Fine Tuned Version 1.0 to DMRA Fine Tuned Version 1.1, one that is a full install for DMRA Fine Tuned Version 1.0 (in case you have a different body mod or no body mod), one to fully install DMRA Fine Tuned Version 1.1 (in case you have a different body mod or no body mod), and one to fully install DMRA Fine Tuned Version 1.2. \r\n\r\n\r\n-nabernas\r\n",
  "categoryId": "29",
  "version": "0.1.2",
  "author": "Nabernas",
  "createdUnix": "1354320089",
  "updatedUnix": "1354320089",
  "containsAdultContent": true,
  "uploadedBy": "nabernas",
  "primaryFile": null,
  "files": []
}