{
  "modId": 27636.0,
  "modName": "Seasons of Skyrim - Springtime Overhaul",
  "summary": "Winter got you down? Sick of snow? Can&#39;t wait for spring? With SoS - Springtime Overhaul, you won&#39;t have to&#33; Changes landscape drastically and adds springtime weather system, new flowers, new grasses, new ingredients, 1000 bunnies in 4 lovely colours and a black goat.",
  "descriptionHtml": "Winter got you down? Sick of snow? Can&#39;t wait for spring? With SoS - Springtime Overhaul, you won&#39;t have to&#33; When springtime comes, life in normally-cold Skyrim bursts forth in a massive orgy of colour and activity to capitalise on the brief period of warmth and increased rains - reflected in greatly increased amounts of wildlife and harvestable ingredients and a lush green world with tons of flowers. Roads are overgrown with grass, and even the chilly swamps of Morthal warm up and come alive.  So what changes?\r<br />\r<br />[color=yellow][b](mostly) complete list of changes (I mean I may have forgot to mention some - these are all done):[/b][/color]\r<br />NOTE these changes will be active for as long as the mod is active\r<br />\r<br />- retextures the land and adds region-appropriate flowers and grasses (by which I mean I think they look nice in that area, not that they&#39;re biologically sound choices)\r<br />- adds springtime weather system (no snow or snow storms, more sunny days, more rain, even more rain, and heavy rain storms). I left the imagespace settings for the weather mostly alone (just added some more saturation to the snowy ones because they were awfully bleak) since I figured you peeps will either be running ENBs or imaginator and I didn&#39;t want to screw up your carefully arranged settings.\r<br />- longer days\r<br />- gets rid of the snow shaders\r<br />- gets rid of ice floes\r<br />- gets rid of all the snow blowing effects\r<br />- gets rid of the snow drifts and icebergs\r<br />- regenerates the Tamriel LOD textures to reflect all these changes\r<br />- changes the trees to be green (no more snowy pines, brown aspen trees, or barren reach trees) - and comes with appropriate tree LOD\r<br />- changes glaciers into rock (because they looked really odd in the green world)\r<br />- changes all thickets and deadshrubs into ferns except where not appropriate (volcanic tundra, the coast, and interiors) because I hated the look of them.\r<br />- adds 1000 rabbits in 4 colours (it&#39;s a rabbit plague&#33;), about 200 goats including a new black one, about 250 deer/elk, horses, cows, tons of bird&#39;s nests (the elusive rock warblers who build their nests on the coastal rocks, then disappear forever), mountain flowers and other flora, critter spawners, and other harvestable stuff where they should be (region-based)\r<br />- speaking of animals, they&#39;re wearing their summer coats already\r<br />- adds several new ingredients from the Harvestables modder&#39;s resource (see credits), including some invasive species near the areas bordering on Morrowind.\r<br />- does NOT touch interiors (but given the retex, some things may look odd)\r<br />- Does NOT touch city worldspaces other than Windhelm to remain compatible with city overhauls (other than minor colour retextures  - brown leaves and trees in Riften are now green, Whiterun&#39;s ugly brown grass is green). Windhelm had tons of snow drifts and icicles everywhere. Those are gone.\r<br />- Does NOT delete anything except for the snow shaders, all removed items are disabled and moved to below the ocean floor instead (Z coord -30000). This mod is as clean as it is possible for such a massive overhaul to be. You will see many changed records in tes5edit but this is because I removed the snow shader, which affected the statics using them, which affected the cells in which they were in. The changes you see in interior cells are me changing the thicket/fern meshes back to thickets and dead shrubs, because dusty nordic ruins with lush green ferns looked odd.\r<br />\r<br />[color=yellow][b]Known oddities/weirdness:[/b][/color]\r<br />\r<br />- Japhet&#39;s Folly and Septimus Signus&#39; outpost look really strange now. I recommend you install this mod AFTER you have visited them both, unless you don&#39;t mind a floating rock world. I did make sure both are still accessible, they just look odd.\r<br />-Since I got rid of the ugly thickets and dead shrubs by swapping the mesh with the ferncluster mesh, some of the ferns may appear to be stuck in the ground or floating. I changed some of the worst offenders, but Skyrim is BIG.\r<br />- Removing the snow drifts caused some floating items and weird landscape. But it looked even weirder with them still around, or retextured. I&#39;ve fixed up things as best as I could.\r<br />- I&#39;ve tried to keep interiors and non-tamriel worldspaces intact - but where I had to make a choice between making Tamriel look good and keeping the interior, I went with the outside. So yeah, some interiors may have odd-looking bits, especially worldspaces (as opposed to fully interior cells)\r<br />- there&#39;s more grass EVERYWHERE. So it may clip with other stuff in places. Not much I can do about that.\r<br />- I&#39;ve not spent a lot of time testing the alchemical properties of the new ingredients. I&#39;ve copied from existing ones, hopefully staying within sane ranges, but it may be off somewhat. Let me know.\r<br />- did not touch any NPC comments, so they&#39;ll probably still moan about the snow and winter. Not going to touch them either.\r<br />\r<br />[color=yellow][b]Unknown oddities/weirdness:[/b][/color]\r<br />Skyrim is a big place. I may well have overlooked something. I&#39;ve spent almost as much time endlessly playtesting and roaming as I&#39;ve spent modding to make sure the springtime look is somewhat consistent. But if you find something odd, let me know. I&#39;m also not running Dawnguard and Hearthfires, so I have no idea what it&#39;ll do to them. Again, let me know.\r<br />\r<br />[color=yellow][b]Install/Uninstall:[/b][/color]\r<br />\r<br />I packed everything you need in a massive BSA for easy install. So just drop the BSA and ESP in your data folder (or use your favorite mod manager), enable, and you&#39;re good to go. Uninstallation is the reverse, so no going though texture and mesh folders to see what you should remove. EASY&#33; I do recommend you go into an interior cell before uninstalling. Just in case. For maximum compatibility, this mod should be loaded as one of the last things in your load order. Alternatively, if you want some other mod to overwrite the changes made here, load it afterwards. Load SkyTEST (if you use it) after you load my mod.\r<br />\r<br />[color=yellow][b]FAQ:[/b][/color]\r<br />\r<br />Q - Do I really need both files?\r<br />A - YES\r<br />\r<br />Q - Can you post a loose file versions?\r<br />A - just extract the BSA with any BSA file extractor like [url=http://skyrim.nexusmods.com/mods/1395]this one[/url]. My internet upload cap is crappy enough for me to not attempt a second massive upload when you can just get the BSA and extract what you need.\r<br />\r<br />Q - Are these dynamic changes?\r<br />A - sure: activate mod, it&#39;s spring. deactivate mod, it&#39;s the usual mess. Dynamic. I know Beth once demo&#39;d a dynamic season thing for Skyrim, but that very likely required some core game engine hacking. It&#39;s obviously not undoable, but it&#39;s unlikely to happen.\r<br />\r<br />Q - why is the 2nd file so large?\r<br />A - textures, meshes, including custom LODs for all of Tamriel. It&#39;s a lot of data. Be happy it&#39;s all contained in a BSA instead of endless loose files.\r<br />\r<br />Q - why are the two files separate if they belong together?\r<br />A - so I can update one or the other without requiring you to download the whole thing while keeping to the nexus version system.\r<br />\r<br />Q - won&#39;t all that wildlife slow down my game?\r<br />A - I haven&#39;t seen this in my testing, but I have a decent rig. I even run SkyTEST and Real Wildlife in tandem to add even MORE life (and a gazillion other mods besides). But it&#39;s certainly possible *shrugs*. It&#39;s really only a bunny or two in select cells. And a few goats. Of course, the more cells you load... In addition the mod adds a LOT of grass and flower textures. So yeah, you might need a beefy PC to run this well. You can alter the grass settings in your skyrim/skyrimprefs.ini if you need to but I think this will gain you at best a couple of FPS.\r<br />\r<br />[color=yellow][b]Conflicts:[/b][/color]\r<br />\r<br />The only one I can think of are weather mods - since SoS Springtime comes with its own weather system which removes snow and snow storms, adds more sunny days, more rain and new rain types (light drizzle and heavy rainstorm). I won&#39;t pretend my weather system is better than Climates of Tamriel - in fact mine doesn&#39;t change things around all that much, but try it - disable your weather mod for a bit.\r<br />\r<br />[color=yellow][b]Recommended other mods for an even better springtime experience:[/b][/color]\r<br />\r<br />- [url=http://skyrim.nexusmods.com/mods/25666]Rainbows[/url] (because more rain means more chance of seeing a rainbow OMG)\r<br />- [url=http://skyrim.nexusmods.com/mods/10175]SkyTEST[/url] (because it adds even MORE animals and young ones too&#33;)\r<br />- [url=http://skyrim.nexusmods.com/mods/23771]SkyBirds[/url] (gotta have birds )(put before this mod in load order if you want extra bird spawners)\r<br />- [url=http://skyrim.nexusmods.com/mods/17723]Birds of Skyrim[/url] (and more birds )\r<br />- [url=http://skyrim.nexusmods.com/mods/11555]Birds and Flocks[/url] (and more birds )\r<br />- [url=http://skyrim.nexusmods.com/mods/4955]101 bugs[/url] (more insects&#33;)\r<br />- [url=http://skyrim.nexusmods.com/mods/28583/]Fantasy Music Overhaul Redone[/url] (and new music&#33;)\r<br />- city overhaul mods since this mod doesn&#39;t change them (aside from the minor edits as mentioned). I like the Towns and Villages Enhanced series by [url=http://skyrim.nexusmods.com/users/3562725]aplestormy[/url] (even though this may cause some oddities like brown trees in Riften and other things in Windhelm)\r<br />\r<br />[color=yellow][b]Credits/thanks:[/b][/color]\r<br />\r<br />Inspired by a Nexus conversation with Jennifur68. Makes grateful use of mod resources: [url=http://skyrim.nexusmods.com/mods/24735]Hoddminir Grasses[/url], [url=http://skyrim.nexusmods.com/mods/19066]ground textures[/url], and [url=http://skyrim.nexusmods.com/mods/14567]flowers by Elinen[/url], [url=http://skyrim.nexusmods.com/mods/15108]Harvestables[/url] by ChickenDownUnder, and the ever-popular [url=http://skyrim.nexusmods.com/mods/19268]GKB green trees[/url] by Ga-Knomboe Boy. Thank you all so much for sharing.",
  "categoryId": "58",
  "version": "1.0",
  "author": "Acid Zebra",
  "createdUnix": "1354356353",
  "updatedUnix": "1354364006",
  "containsAdultContent": false,
  "uploadedBy": "acidzebra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "102530",
      "name": "Springtime for skyrim BSA - NOT AN OPTIONAL DOWNLOAD",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "274885",
      "fileName": "Springtime for skyrim BSA - NOT AN OPTIONAL DOWNLOAD-27636-1-0.rar",
      "uploadedUnix": "1354363821",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Springtime%20for%20skyrim%20BSA%20-%20NOT%20AN%20OPTIONAL%20DOWNLOAD-27636-1-0.rar?fid=102530&ttl=1535800506&ri=8192&rs=8192&setec=0e82b55b22ce6f2c9fdd78146b5b67c9"
    },
    {
      "fileId": "102532",
      "name": "Springtime for Skyrim ESP - the main file",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2120",
      "fileName": "Springtime for Skyrim ESP - the main file-27636-1-0.rar",
      "uploadedUnix": "1354364006",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3eb973443ff0f084975f27417cb9003d8df33fe460293c777798db323b14190e/analysis/1407286745/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Springtime%20for%20Skyrim%20ESP%20-%20the%20main%20file-27636-1-0.rar?fid=102532&ttl=1535800506&ri=8192&rs=8192&setec=73012fc6e2fc494b4975f27f4704132f"
    }
  ]
}