{
  "modId": 27642.0,
  "modName": "Fishing in Skyrim - French",
  "summary": "Ajoute des cannes a peche, des filets de peche, des explosifs Dwemer,\r\net tout un tas d\\'objets sur le theme de la peche.",
  "descriptionHtml": "[center][color=#ffd700][size=6][b]Fishing In Skyrim - Pêcher en Bordeciel\r\nFrench translation[/b][/size][/color][/center]\r\n\r\n[b]Version :[/b] 0.92\r\n[b]Auteur / Author :[/b] [url=http://skyrim.nexusmods.com/users/505917]Arodicus[/url]\r\n[b]Lien original du mod / Link to original mod:[/b] [url=http://skyrim.nexusmods.com/mods/16139]Fishing In Skyrim[/url]\r\n\r\n[color=#ffd700][size=4][u][b]Prérequis[/b][/u][/size][/color]\r\n- Skyrim à jour en 1.7+\r\n- Skyrim Script Extender (SKSE)\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Description du mod[/b][/u][/size][/color]\r\nAjoute des cannes à pêche, des filets de pêche, des explosifs Dwemer,\r\net tout un tas d\\'objets sur le thème de la pêche.\r\n\r\nIl est possible d\\'obtenir votre première canne à pêche et votre premier filet dans un canot situé dans le canal de Faillaise, ou d\\'en acheter, de façon plus ou moins aléatoire, à certains vendeurs généralistes. Ils proposent parfois des équipements de pêche (comme des explosifs, des cannes ou autres) dans leur catégorie éléments divers.\r\n\r\nIl est enfin possible de fabriquer les objets de ce mods :\r\n- Filet de pêche : 3 options de fabrication, atelier de tannage\r\n- Canne à pêche : 3 qualités de fabrication, forge section divers\r\n- Explosifs Dwemer : 2 types, forge section divers\r\n- Pâte explosive Dwemer : réchaud de cuisine\r\n\r\n[youtube]uhvBXpyAwEk[/youtube]\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Fonctionnement des cannes à pêche[/b][/u][/size][/color]\r\nLe mod intègre trois cannes à pêche, dont leur efficacité est indiquée par leur qualité (Simple, raffinée ou luxueuse). Ces cannes peuvent être fabriquées à une forge, achetées auprès des vendeurs dans la section divers de façon occasionnelle, ou trouvées (Vous en avez une dans un canot sur le canal dans la ville de Faillaise). Leur qualité va déterminer la distance à laquelle vous pouvez lancer la ligne, et la rapidité avec laquelle le poisson va mordre.\r\n\r\nRendez-vous dans le menu Magie puis utilisez le pouvoir \\\"Pêche - Utiliser canne\\\", afin de déposer la canne à pêche devant vous. Si la zone d\\'effet de la canne se trouve dans une zone où se trouve du poisson, elle se plante alors dans le sol, dans le cas contraire, un message indique qu\\'aucun poisson n\\'est à porté et la canne retourne dans l\\'inventaire. \r\n\r\nUne fois la canne posée au sol, vous devez l\\'utiliser pour afficher un menu, qui permet d\\'accrocher à l\\'hameçon un appât. L\\'hameçon peut être utilisé avec la majeur partie des objets de type viande, insectes et poissons.\r\n\r\nLes poissons sont attirés par différents types d\\'appâts, il faudra donc mener des expériences et voir ce que vous arriverez à pêcher, afin de trouver la meilleure solution d\\'appât pour la zone où vous êtes. Si vous avez le bon appât, pour la bonne région, il y a à peu près 60% de chance d\\'attraper les meilleurs poissons.\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Pêche par région[/b][/u][/size][/color]\r\nChaque région attire des poissons spécifiques, à vous de découvrir quels sont les poissons qui nagent dans ces différentes régions et d\\'en prendre note afin d\\'optimiser le gain des ingrédients que vous désirez.\r\n\r\nNotez également que certains animaux marin rares ne se trouve que dans des zones bien spécifiques, comme le poisson-chat de Griffenoire dont le nom devrait vous aider à le localiser, ou la Méduse fongique, qui aime les eaux glaciales et se laisse souvent prendre dans les filets de pêche.\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Fonctionnement des filets de pêche[/b][/u][/size][/color]\r\nLes filets peuvent être achetés, tout comme les cannes à pêche, auprès de certains vendeurs, de façon occasionnel, ou bien fabriqué sur un atelier de tannage. Il est possible de lancer plusieurs filets pour couvrir une large zone de pêche et ainsi optimiser la récolte d\\'ingrédients.\r\n\r\nIl est également bon de noter qu\\'une zone de pêche qui a été complètement vidée de ses habitants met entre 24 et 36 heures (en jeu) à se régénérer.\r\n\r\nVous pouvez lancer votre filet en utilisant le menu Magie, puis en sélectionnant \\\"Pêche - Lancer filet\\\", tout en visant la zone où placer l\\'objet. Le filet va ensuite être lancé sur une courte distance, puis après un temps, afficher son contenu. Il est alors possible de récupérer ce que l\\'on souhaite, avant de fermer son contenu et récupérer de façon automatique le filet dans l\\'inventaire.\r\n\r\nLes filets de pêche attirent les poissons carnassiers, et peuvent être endommagés par ces derniers, si cela venait à se produire, il est possible de réparer le filet à un atelier de tannage, en échange de certaines ressources.\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Fonctionnement des explosifs[/b][/u][/size][/color]\r\nL\\'utilisation d\\'explosifs aquatique à, normalement, pour but d’assommer, sur une certaine zone, tout être vivant, autant les poissons que les insectes ou les nageurs alentours imprudents.\r\n\r\nQue vous utilisiez le Bâtonnet explosif ou la Charge aquatique, une large explosion se produit ayant différent effets. Dans un premier temps, un effet magique de type feu se produits au centre de l\\'explosion, puis avec sa dilatation arrive une zone plus large infligeant également des dégâts de feu de moindre importance, puis viens l\\'effet de déflagration, représenté comme un cri de la voix, et ayant les même effets, à savoir déstabilisation. Soyez donc prudent et écartez vous rapidement de l\\'objet explosif après l\\'avoir lancé.\r\n\r\nPour l\\'utilisation, rendez-vous dans le menu Magie et sélectionnez \\\"Pêche - Bâtonnet explosif\\\" ou \\\"Pêche - Charge aquatique\\\", la seconde option étant un objet donc l\\'effet est plus dévastateur que le bâtonnet. La Charge aquatique peut aussi être utilisée sur la terre ferme, mais va rouler en fonction du terrain, attention.\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Vendeur d\\'articles de pêche[/b][/u][/size][/color]\r\nLe mod ajoute un nouveau PNJ, Rybek Kupiecski, un talentueux fabriquant de cannes à pêche et de filets, qui propose de vendre certaines de ses fabrications ainsi que divers objets de sa pêche. Il peut être trouvé à l\\'extérieur de Solitude, près de la scierie.\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Sorts de pêche[/b][/u][/size][/color]\r\nIl existe un sort de type illusion nommé \\\"Détecter zone de pêche\\\", qui peut être appris si toute fois vous êtes assez chanceux pour trouver le livre \\\"Le vieil Orc et la Mer\\\". Une fois utilisé, ce sort illumine la zone d\\'eau la plus proche contenant des poissons.\r\n\r\nVous pouvez tenter de voir avec Rybek Kupiecski s\\'il dispose d\\'une copie de l\\'ouvrage, ou dans les librairies, sait-on jamais.\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Divers[/b][/u][/size][/color]\r\nUn certain nombre de \\\"Reliques perdues\\\" et autres trésors peuvent être récupérés lors de la pêche, particulièrement lors de l\\'utilisation d\\'un filet de pêche dans des eaux \\\"polluées\\\", vous n\\'attraperez pas beaucoup de poissons dans ces zones, principalement des déchets, mais il se pourrait que vous tombiez sur une bonne surprise.\r\n\r\nLes jeunes Dwemer jouaient avec ce qu\\'on appel un \\\"Poisson-volant Dwemer\\\", petit appareil mécanisé qui bat des ailes, comme un vrai poisson-voilant, mais complètement incompatible avec l\\'eau. Cependant, les enfants Dwemer ne résistaient pas toujours à la tentation de plonger leur jouet dans l\\'eau, et il se raconte que certains de ces jouets se trouvent encore au fond de certains lacs et rivières de Bordeciel.\r\n\r\nUne autre rumeur raconte l\\'histoire d\\'un pêcheur qui se trouvait être plus chanceux que tout ses homologue, ce dernier disait que sa chance lui venait du chapeau qu\\'il portait, mais personne ne croyait les dires du pêcheur. Cependant, il semble qu\\'encore de nos jours, certains pêcheurs aient de meilleurs résultats que d\\'autres, et que ça ne tiendrait pas de l\\'équipement standard dont disposent la majeur partie des pêcheurs. Il serait donc peut être judicieux de trouver ces pêcheurs chanceux afin de vérifier si l\\'histoire est vraie, et pourquoi pas commencer par arpenter le bord des rivières à leur recherche?\r\n\r\nPour finir, il existe un livre de triche, qui permet d\\'acquérir les objets du mod ainsi que divers autres options. C\\'est un exemplaire unique, se trouvant quelque-part dans la pêcherie de Faillaise.. Mais honte à vous si vous décidez de l\\'utiliser.\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Compatibilité et mods recommandés[/b][/u][/size][/color]\r\nImproved Fish by Blitz54 :\r\nhttp://skyrim.nexusmods.com/mods/14320\r\n\r\nDriveable Boats by Predalien :\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=88580670\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Homage et avertissement aux joueurs[/b][/u][/size][/color]\r\nCe mod est un hommage à la fiancée de l\\'auteur, Kiersten, qui est partie en Avril 2012, seulement une semaine avant son 22ème anniversaire. Elle aimait Skyrim et les sushi, c\\'est pour cette raison, et en tant que cadeau d\\'anniversaire commémoratif, que l\\'auteur a décidé de combiner ces deux éléments dans ce mod.\r\n\r\nLes nouvelles espèces de poissons du mod sont nommées en rapport avec les choses qu\\'elle aimait, l\\'auteur travail également sur de nouveaux ajouts afin d\\'élargir les objets en sa mémoire, afin qu\\'elle puisse continuer à vivre dans ce monde qu\\'elle aimait tant. Un livre sera également ajouté par la suite, afin d\\'expliquer tout le symbolisme de ces différents objets pour ceux souhaitant en savoir davantage.\r\n\r\nKiersten est décédée d\\'une embolie pulmonaire due à une Thrombose veineuse profonde, qui provoque un caillot de sang dans le réseau veineux des membres inférieurs et peut se déclencher suite à une position assise, ou similaire, pendant une durée prolongée, empêchant le sang de circuler correctement. Kiersten fût touchée par cette embolie suite à 11 heures de jeu d\\'affilé sur MW3 (Call of Duty - Modern Warfare 3). Les joueurs présentent un grand risque de contracter ce type de maladie si leur temps de jeu est important et qu\\'ils ne bougent pas beaucoup. Le seul signe que Kiersten a eu fût une crampe dans la jambe, 2 heures plus tard, elle était décédée.\r\n\r\nLe meilleur moyen pour limiter les risques d\\'embolie sont simples :\r\nSauvegardez votre jeu, levez vous et marchez un peu, 2 ou 3 minutes par tranche de 3/4 heures peuvent suffire. Allez aux toilettes et profitez-en ensuite pour prendre quelque chose à grignoter, et pendant ce temps restez debout ou déplacez vous. Cette démarche toute simple aurait sauvé la vie de Kiersten, elle peut sauver la votre.\r\n\r\nSoyez donc attentif aux effets qui peuvent précéder :\r\n• Gonflement de la jambe, de la cheville et / ou du pied.\r\n• Douleur dans la jambe, la cheville et / ou le pied. Il arrive souvent que des crampes apparaissent dans le mollet.\r\n• Sensation de chaleur dans la jambe, la cheville et / ou le pied.\r\n• Changement de couleur de la peau, blanc, bleue ou rougeurs.\r\n\r\nSi vous constatez l\\'un de ces symptômes, n\\'hésitez pas à consulter un médecin.\r\n\r\n\r\nSi lors de vos voyages en Bordeciel vous rencontrez une Khajit nommée Lillani, sachez que vous venez de croiser l\\'esprit d\\'une personne fantastique.\r\n\r\n[size=\\\"2\\\"][u][b]Arodicus Snaux :[/b][/u][/size] \\\"She will be missed.\\\"\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Installation du mod[/b][/u][/size][/color]\r\nDécompressez l\\'archive et déplacez les fichiers suivants dans le répertoire Data du jeu :\r\nFishingInSkyrim.bsa\r\nFishingInSkyrim.esp\r\n\r\n\r\nActivez ensuite le plugin FishingInSkyrim.esp via le SkyrimLauncher.\r\n\r\n\r\nIl est également possible de charger directement l\\'archive du mod dans Nexus Mod Manager pour faciliter son installation et sa désinstallation.\r\n\r\nUn tutoriel entièrement en français est disponible ici:\r\nhttp://www.confrerie-des-traducteurs.fr/forum/viewtopic.php?f=183&t=10216\r\n\r\n\r\n[color=#ffd700][size=4][u][b]Désinstallation du mod[/b][/u][/size][/color]\r\nDésactivez le mod via le SkyrimLauncher.\r\nSupprimez manuellement les deux fichiers dans le répertoire Data.\r\n\r\nOu désinstallez le depuis le Nexus Mod Manager.\r\n\r\n[center][img]http://www.confrerie-des-traducteurs.fr/forum/images/conf.png[/img]\r\n[url=http://www.confrerie-des-traducteurs.fr/skyrim/index.php]Site Skyrim[/url]\r\n[url=http://www.confrerie-des-traducteurs.fr/forum/index.php]Forum[/url][/center]",
  "categoryId": "24",
  "version": "0.92",
  "author": "Arodicus Snaux",
  "createdUnix": "1354373473",
  "updatedUnix": "1354373794",
  "containsAdultContent": false,
  "uploadedBy": "antiseptique",
  "primaryFile": null,
  "files": [
    {
      "fileId": "102562",
      "name": "Peche en Bordeciel",
      "version": "0.92",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2525",
      "fileName": "Peche en Bordeciel-27642-0-92.7z",
      "uploadedUnix": "1354373794",
      "modVersion": "0.92",
      "virusScanUrl": "https://www.virustotal.com/file/cb54e0653a647089e5533f110cb562a115b02c2e0cc01c2e4a58c8e2072129c4/analysis/1407286950/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Peche%20en%20Bordeciel-27642-0-92.7z?fid=102562&ttl=1535800515&ri=8192&rs=8192&setec=a98991a72809ecfb64064c35abb11081"
    }
  ]
}