{
  "modId": 27657.0,
  "modName": "Banditry - Fur Armor",
  "summary": "Craftable fur armor in multiple smithing tiers",
  "descriptionHtml": "&#34;You picked a bad time to get lost, friend&#34; - Bandit tour guide\r<br />\r<br />The height of fashion for bandits and ruffians throughout the holds, fur armor is now available for crafting. Recipes are available for both standard fur armor, and four tiers of higher grade outfits. Circlets are provided as an alternative to helmets. The armor set counts as matched for the Matching Set perk.\r<br />\r<br />Multiple tiers means you can keep the same outfit appearance from hide quality all the way to dragon quality. There are other mods that allow the crafting of fur armor, but this is the only one I know of that lets you craft higher quality fur armor.\r<br />\r<br />Fur Armor (Hide)\r<br />Wolf Fur Armor (Elven)\r<br />Sabre Cat Fur Armor (Scaled)\r<br />Bear Fur Armor (Glass)\r<br />Snow Bear Fur Armor (Dragonscale)\r<br />\r<br />Notes\r<br />\r<br />There are Stormcloak items in the game named &#34;fur boots&#34; and &#34;fur gauntlets&#34;. These are not the same armor and do not count for a matching set.\r<br />\r<br />The basic fur armor is the same armor that is found in the game worn by most bandits, but it is now craftable and counts as a matching set. It ranges between hide and leather in quality. Crafting does not require a perk and uses only leather.\r<br />\r<br />The four higher tier sets all require the appropriate perks and furs for crafting. Wolf Fur Armor requires wolf pelts, Sabre Cat Fur Armor requires sabre cat furs, etc. So collect your furs as you level up, you will need them for crafting and tempering. Please note that the recipes are particular about which furs you use. Wolf Fur Armor needs wolf pelts and NOT ice wolf pelts. The Snow Bear Fur Armor is dragonscale quality, but needs snow bear pelts and not dragon scales.\r<br />\r<br />Changes 1.1\r<br />- Added boots as alternative to shoes (modeled from hide boots)\r<br />\r<br />Changes 1.2\r<br />- Added cloth variant",
  "categoryId": "54",
  "version": "1.2",
  "author": "Brandybuck",
  "createdUnix": "1354396432",
  "updatedUnix": "1357863657",
  "containsAdultContent": false,
  "uploadedBy": "Brandybuck",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001510",
      "name": "furarmor_1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "furarmor_1_2-27657-1-2.zip",
      "uploadedUnix": "1357863657",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/3e1ee637ba3e1654955d015e4b8037b4e755457fd56b4094fc7e07c282988991/analysis/1407347281/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/furarmor_1_2-27657-1-2.zip?fid=1000001510&ttl=1535800536&ri=8192&rs=8192&setec=3934a56595a8acda6a8f3de7c39e66d3"
    }
  ]
}