{
  "modId": 27661.0,
  "modName": "A Bit Better Breezehome- Hearthfire",
  "summary": "A Breezehome that&#39;s slightly more worthy of a Thane&#33; Enchantment and Alchemy table independent of the kiddies&#39; room&#33; Yay&#33;",
  "descriptionHtml": "[b]Requires Hearthfire&#33;[/b] (And probably Skyrim version 1.8) Now cleaned with TES5Edit&#33; Navmesh shows as dirty, but it&#39;s fine. Honest.\r<br />\r<br />[i](Scroll down to skip my lame attempt at humor...)[/i]\r<br />\r<br />&#34;Yes? What is it now, Proventus?&#34;\r<br />\r<br />&#34;My Jarl, the Dragonborn Thane has finally purchased a home in the city...&#34;\r<br />\r<br />&#34;Excellent&#33; It&#39;ll be good to have such a hero on hand to help defend Whiterun.&#34;\r<br />\r<br />&#34;...It&#39;s Breezehome.&#34;\r<br />\r<br />&#34;WHAAAT?&#33;&#34;\r<br />\r<br />&#34;&lt;whines&gt; It was the only house available&#33;&#34;\r<br />\r<br />&#34;...Okay... Okay, we can fix this. We can... IRILETH&#33;&#34;\r<br />\r<br />&#34;&lt;was standing right there, thank you&gt; Yes, my Jarl?&#34;\r<br />\r<br />&#34;Has the Thane left for High Hrothgar?&#34;\r<br />\r<br />&#34;Just this morning, along with Lydia and that blonde that dances on tables.&#34;\r<br />\r<br />&#34;We have time, then. Round up all the good furniture we aren&#39;t using&#33; And the furniture we ARE using but don&#39;t need&#33; And see if the citizens of Whiterun are willing to help out with this. Last thing we want is for the Dragonborn Thane to have to sleep on a hay bale&#33;&#34;\r<br />\r<br />&#34;And the housecarl&#39;s room?&#34;\r<br />\r<br />&#34;Yes, yes. Lydia&#39;s moody enough, as it is.&#34;\r<br />\r<br />&#34;There&#39;s a rumor that the Thane is thinking of adopting-&#34;\r<br />\r<br />&#34;Oh, FOR THE LOVE OF TALOS. Just get the good furniture ready&#33; We don&#39;t have time to worry about cramming nice beds in a study for a couple of waifs&#33; They&#39;d be lucky not to be sleeping in the street&#33;&#34;\r<br />\r<br />...\r<br />\r<br />Ahem. Sorry, had to get that out of my system. Anyway, this mod, built with and requiring Hearthfire, upgrades most of the furniture in Breezehome. Something a little more worthy of a Dragonborn thane, without going overboard. No basement, no forge or smelter or whatever. After all, Warmaiden&#39;s is right next door, and I hear that Adrianne likes to steal admiring glaces at you while you&#39;re working. You&#39;re someone who can get things done&#33; She likes that&#33; \r<br />\r<br />What DID I change? I knocked out the back wall of the loft and extended it the length of the building. The Alchemy lab and the new Enchantment table are now in the bedroom (with a safe under the table), and the old alchemy room is a study/library if you don&#39;t put in a kids&#39; room. So yes, you can brew potions AND have orphans to test them on&#33; (Kidding&#33; Mostly.) The kids still have crappy beds, because the darn things are quest items, and I dun wanna mess with that. I&#39;m also not going to mess with the bookcase next to the firepit. When I tried that, someone stuck a Skyforge dagger in it. I&#39;m not stupid&#33;\r<br />\r<br />There are three new storage chests in the house: one in the living room, one in the Loft hall, and another one in the master bedroom.\r<br />\r<br />Also, you still have to buy the upgrades. The Enchantment table and Alchemy lab are now attached to the bedroom package, which now costs 800g. (I think Farengar and Arcadia are planning a getaway to Elswyr, and wagons aren&#39;t cheap&#33;) The Study can be bought for 250g, same as the kiddie beds.\r<br />\r<br />Obviously, this won&#39;t be compatible with any mod that changes the WhiterunBreezehome cell alot. Trap doors that lead to basements should be okay, so long as they&#39;re friendly with Hearthfire&#39;s object placements.\r<br />\r<br />WARNING: You may want to install this BEFORE you buy Breezehome in-game. Otherwise, you could end up with stuff all over the place. \r<br />\r<br />However, if you want to give it a go with an existing game with a pre-owned Breezehome, you can try these steps:\r<br />\r<br />1. BEFORE INSTALLING, get all the stuff you want to keep out of your containers in Breezehome. Make sure you don&#39;t have any NPCs in there, either. If Lydia gets pissy, shove a sweet roll in her mouth.\r<br />\r<br />2. Waddle your way to the Drunken Huntsman or Warmaiden&#39;s or some interior cell.\r<br />\r<br />3. Save game, exit game. Deactivate any previous Breezehome mods.\r<br />\r<br />4. Load up your last save. Save again&#33; Exit game.\r<br />\r<br />5. Activate &#39;A Thane-Worthy Breezehome.esp&#39;.\r<br />\r<br />6. Load up last save. You should still be inside a building. (optional: Steal Lydia&#39;s clothes)\r<br />\r<br />7. Open up the console. Type in [b]pcb[/b], which stands for [b]purge cell buffer[/b].\r<br />\r<br />8. Next, in the console, type in [b]resetinterior WhiterunBreezehome[/b].\r<br />\r<br />9. Save game again&#33;\r<br />\r<br />10. Waddle your way back to Breezehome, dump all your crap in one of the new chests, and sleep in a nice bed&#33; (optional: Give Lydia back her clothes)\r<br />\r<br />If you run into any bugs, lemme know&#33;\r<br />\r<br />(Also, if enough people are afraid of a little exercise (or just load screens), I could easily be persuaded to hide a non-respawning container around the back of Warmaiden&#39;s. Y&#39;know, for ores and ingots and stuff. Hopefully, no one will notice...)",
  "categoryId": "67",
  "version": "1.1",
  "author": "TwilightStar",
  "createdUnix": "1354400143",
  "updatedUnix": "1402679793",
  "containsAdultContent": false,
  "uploadedBy": "TwilightStar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "102644",
      "name": "A Thane-Worthy Breezehome",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16",
      "fileName": "A Thane-Worthy Breezehome-27661-1-0.rar",
      "uploadedUnix": "1354400926",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e9f87e51378f665e3c21316bbc72374385114109c92c94a5864c2097385dee5d/analysis/1407287479/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Thane-Worthy%20Breezehome-27661-1-0.rar?fid=102644&ttl=1535800542&ri=8192&rs=8192&setec=98532d097518e9384097db296eb96817"
    },
    {
      "fileId": "1000112862",
      "name": "Bit Better Breezehome - Hearthfire",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Bit Better Breezehome - Hearthfire-27661-1-1.rar",
      "uploadedUnix": "1402679793",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1f07fc01631573dd53a31139cc14037d573b667404a7580ccfef0e3659ea0855/analysis/1408124659/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bit%20Better%20Breezehome%20-%20Hearthfire-27661-1-1.rar?fid=1000112862&ttl=1535800543&ri=8192&rs=8192&setec=c52074753ac195c205348b494196afb5"
    }
  ]
}