{
  "modId": 27674.0,
  "modName": "Whiterun Player Home---less",
  "summary": "Adds safe barrels, an alchemy table, an enchanting table, and a player owned bedroll near Adrianna\\'s home. Also increases Adrianna\\'s gold.",
  "descriptionHtml": "[b][color=red]What:[/color][/b]\r\nThis mod adds some player home amenities just outside Warmaiden\\'s, so you have a nice convenient place to store and make stuff. It\\'s easy to fast travel there, and you avoid an extra loading screen.\r\n\r\nThis is a beta, but I\\'ve used this mod for a while without any adverse affects. The only exception is that I just barely got the bedroll to work as player-owned, so I haven\\'t had a lot of time to notice side effects of that change. More on that below.\r\n\r\nThis is my first mod so be nice. :-)\r\n\r\n[b][color=red]Elaboration:[/color][/b]\r\nThis mod adds the following right by Warmaiden\\'s:\r\n[list=1]\r\n[*]A barrel between the tanning rack and the workbench\r\n[*]An arcane enchanter by the NW corner of the shop\r\n[*]An alchemy lab by the arcane enchanter\r\n[*]A player-owned bedroll on the N face of the shop\r\n[*]An extra barrel by the bedroll\r\n[*]Extra gold to Warmaiden\\'s so they can buy all your crud\r\n[/list]\r\n[b][color=red]Notes:[/color][/b]\r\nThe barrels are safe. I\\'ve used them a lot while installing and uninstalling lots of other mods. Of course, if you uninstall this mod, then you\\'ll obviously lose the contents of those two barrels when they disappear. The other Whiterun barrels will be unaffected.\r\n\r\nTo make the bedroll player-owned and therefore give you +10% to skill learning, I had to make the whole location of Whiterun a \\\"player dwelling.\\\" Let me know if there are any side affects I haven\\'t noticed... No support for spouses, but Breezehome is just next door.\r\n\r\n[b][color=red]Compatibility:[/color][/b]\r\nI\\'ve using this and many other mods for a while and haven\\'t found any to be incompatible. The only possible exceptions I can think of are:\r\n[list=1]\r\n[*]If you have an Adrianna mod or a merchant mod. I didn\\'t actually mod Adrianna - I modified her chest - no not that one, the one where she keeps her goods - no not those goods - nevermind... get your mind out of the gutter already...\r\n[*]If making Whiterun a player dwelling does something funky... You tell me...\r\n[/list]\r\n[b][color=red]Lore:[/color][/b]\r\nDoesn\\'t seem very lore friendly to me... What\\'s a homeless person gonna do with an alchemy lab? Also, where did Warmaiden\\'s get all that cash? How well rested can you get in a sleeping bag? No, this is just for convenience. Your choice. :-)\r\n\r\n[b][color=red]Future Plans:[/color][/b]\r\nI plan to keep it simple. If I can add something easily that fits with the mod, I wouldn\\'t mind posting an update. Otherwise it probably won\\'t change much if at all.\r\n\r\n[b][color=red]Thanks:[/color][/b]\r\nTo everyone and no one in particular. You\\'re all cool.",
  "categoryId": "67",
  "version": "0.1",
  "author": "yeoldeusrename",
  "createdUnix": "1354412812",
  "updatedUnix": "1354413006",
  "containsAdultContent": false,
  "uploadedBy": "yeoldeusrename",
  "primaryFile": null,
  "files": [
    {
      "fileId": "102677",
      "name": "Whiterun Player Home-less",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Whiterun Player Home-less-27674-0-1.zip",
      "uploadedUnix": "1354413006",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/6285da400f474fb05dce5ce787ebe444cede13a9ffaa9f9315523f7295876a07/analysis/1407287767/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whiterun%20Player%20Home-less-27674-0-1.zip?fid=102677&ttl=1535800564&ri=8192&rs=8192&setec=6a3332d97c7e9f7cfef6ee5256ca8304"
    }
  ]
}