{
  "modId": 27684.0,
  "modName": "Neotorus Skyrim",
  "summary": "A mod that adds and edits so many different things all over Skyrim, from weapons to quests to cows to campsites. Everything! Also available on the Steam Workshop.",
  "descriptionHtml": "==============================================================================\r\nREAD DESCRIPTION BEFORE DOWNLOADING, CHECK REGULARLY FOR UPDATES, FEEDBACK IS APPRECIATED. LIST OF MOD CONTENTS FURTHER DOWN.\r\n==============================================================================\r\n\r\nWARNING: Some of the items, weapons, armour and potions and a few other things in this mod are quite overpowered, but you can still download Neotorus Skyrim and just not use the OP things.\r\n\r\nThis mod does NOT require Dawnguard, but works perfectly fine with it.\r\n\r\n<<CHECK OUT>>\r\n-My YouTube Channel at http://www.youtube.com/user/Neotorus?feature=guide\r\nFeatures gameplay, tutorials and montages!\r\n\r\n<<ALSO AVAILABLE ON THE STEAM WORKSHOP>>\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=86366345\r\n\r\n==============================================================================\r\nVERSIONS OF NEOTORUS SKYRIM\r\n==============================================================================\r\n\r\n-1.0 (31/07/12)\r\n-1.1 (04/08/12)\r\n-1.2 (07/08/12)\r\n-1.3 (12/08/12)\r\n-1.4 (22/08/12)\r\n-1.5 (13/09/12)\r\n-1.6 (26/09/12)\r\n-1.7 (18/10/12)\r\n\r\nAll Updates not only added heaps more stuff onto the original release, but also fixed multiple bugs. Any further Versions/Updates will be noted under this list, with detailed information on the alterations/changes under the \\\"News\\\" section below. \r\n\r\n==============================================================================\r\nNEWS\r\n==============================================================================\r\n\r\n(12/11/12)\r\n-NEXTRACT 1 & 2 RELEASED: Nextracts - or [NX]s - are little parts of Neotorus Skyrim brought away from the big mod into one small mod each. They\\'ll be many more to come, eventually one mod for each little part of Neotorus Skyrim. Number 1 is ODDNUT COWS and Number 2 is PLAYABLE GIANT CLUBS. A lot more on the way!\r\n\r\n(18/10/12)\r\n-New Update 1.7 released for Neotorus Skyrim. ALTERATIONS: Adds a new camp called Snowcrest Campsite near Dawnstar. Map Marker provided.\r\n\r\n(26/09/12)\r\n-New Update 1.6 released for Neotorus Skyrim. ALTERATIONS: A new Giant Camp called Bonecrush Camp has been added, outside of Riverwood (don\\'t worry, a Map Marker was placed) and a few more dragons have been put around Skyrim, mainly around the towns. I plan to add a lot more dragons around the map in the next update.\r\n\r\n(13/09/12)\r\n-New Update 1.5 released for Neotorus Skyrim. ALTERATIONS: Oddnuts removed from Whiterun on request, along with the corresponding Map Marker. If you want them, they\\'ll still be waiting in Riverwood!!!\r\n\r\n(11/09/12)\r\n-First NEP (Neotorus Expansion Pack) just released! HEATHERWORTH HOME is available for download through my Workshop files, or when you search the mod title. Enjoy!\r\n\r\n(08/09/12) \r\n-GET PUMPED: I’m currently working on THREE EXPANSION PACKS for Neotorus Skyrim. The Expansion Packs are HEATHERWORTH HOME, MERCHANTS OF SKYRIM and ELEMENTOR\\'S FURY. COMING SOON!!!\r\n\r\n==============================================================================\r\nCONTENTS / INFORMATION\r\n==============================================================================\r\n\r\nSo, here\\'s a full list of what this mod does, in fact, contain. Be sure to read through it all, PLEASE, because it does tell you very important information.\r\n\r\n<<SPELLS>>\r\n-Mass Zombification (quite giltchy, have no idea how to fix it, kind of an experiment)\r\n-Explosive Restoration (Restores Health and Stamina 1000 points)\r\n-Trap of the Omega (FUN)\r\n-Insanity (Virtually Frenzy, with a little extra kick)\r\n-Explosive Paralysis (You can guess)\r\n-Shockblast (Lightning)\r\n-Stormrend (More Lightning)\r\n-Cloak of Elements (Pretty damn epic, just don\\'t go into a city while you\\'ve got it on :P)\r\n-Extended Invisibility (Lasts a while)\r\n-Cinderblast (The power of the Thu\\'um in your hands)\r\n-Freezetongue (Again, the Voice captured within your palms)\r\n\r\nAll Spell Tomes are located in the Spell Tome Barrel inside the Riverwood Campsite tent. You\\'ll have to look for Shadowake the Argonian on the ground outside to get the key to the Miscellaneous Chest inside the tent, which has the key for the Spell Tome Barrel. A little annoying, I know, but the Spells are well worth it.\r\n\r\n<<CAMPSITES>>\r\n-The main one with a lot of the stuff is across the bridge of Riverwood and left. It\\'s here that I really suggest you start exploring the world of Neotorus Skyrim. This camp also has a herd of cows that are insanely fast and fun to kill, and an archery range. All three locations have Map Markers.\r\n-Another one is just outside of Falkreath and up on a little hill or outcrop or whatever. This one also has a Map Marker. \r\n-The third main human one so far is Snowcrest Campsite, near Dawnstar, with a Map Marker also. An interesting story, even though it\\'s not a Quest. Enjoy!\r\n-So far there are 2 Giant Camps around Skyrim (one southeast of Rorikstead, one outside of Riverwood) and they\\'re both Map Marked.\r\n-I’m planning on making a lot of bandit camps dotted around Skyrim, so watch out for that!\r\n\r\n<<QUESTS>>\r\n-Two so far, and another one on the way. The first can be started in the Riverwood campsite, and is the better of the two.\r\n-The second is buggy, and I\\'m trying to work on that. This one can be started at the Falkreath Campsite. \r\n-Unfortunately, for some ungodly, hellish reason, neither the objective arrows nor the journal entries appear. I honestly think I can\\'t fix this, but PLEASE if you have any suggestions, I would really, really love to hear them.\r\n\r\n<<NPCs>>\r\n-People: Most NPC people of mine are dead and part of a quest, but there are also two followers in the Sleeping Giant Inn, along with a normal, random NPC and a merchant. They only have default voice files, so don’t get excited. Yet.\r\n-Animals: There are Massive Mudcrabs (and I mean MASSIVE), Colossal Chickens, Flying Cows (MY FAVOURITE!!!), Nice Giants and much more. Don’t kill the giants at Bleak Falls Barrow. If you already have, it shouldn’t be that bad. I made them nice for a reason, you know!\r\n-Horses: A horse named Darkshadow is waiting for you at the Whiterun Stables. Her speed is 200 in the Creation Kit, so you’ll get places nice and quickly.\r\n-Dogs: I’ve placed a follower dog named Zaro in Breezehome. I hope he doesn’t run away.\r\n-Dragons: I\\'ve placed a few dragons of my own around Skyrim, such as the Drunk Dragon, for example, but unfortunately the lack of soul-absorption is still imminent, so it\\'s really just killing for the experience.\r\n\r\n<<LOAD SCREENS>>\r\n-I have also added a fair few load screens into the game. They’re all lore-related, though most of it is completely new, so has not much to do with the lore about Tamriel. But still, they’re interesting.\r\n\r\n<<ARMOUR, WEAPONS and POTIONS>>\r\n-Not only have I improved a lot of the armour already in Skyrim, I’ve made my own set that is awesome if you’re a Vampire – it makes your Health, Stamina and Magicka regenerate and increase a hell of a lot.\r\n-I’ve made a nice amount of new weapons (no new textures, though), with two or three being part  of quests. A few of them are: Knife of Omega, Battlesmash, Sword of Ages, Shadowdancer, Blade of Darkness, etc.\r\n-Playable Giant club with increased attack and reach, and reduced weight.\r\n-A few insanely powerful potions are lurking in a chest in the Riverwood campsite, but be warned: They are not for the faint hearted - they do last a long time. Enjoy!\r\n\r\n<<MAP MARKERS>>\r\n-Riverwood Campsite\r\n-Riverwood Archery Range\r\n-Herd of Oddnuts (In Riverwood)\r\n-Falkreath Campsite\r\n-Snowcrest Campsite (Near Dawnstar)\r\n-Bonecrush Camp (Near Riverwood)\r\n-Stormstike Camp (Near Rorikstead)\r\n\r\n<<OTHER>>\r\n-More trees in the actual town part of Riverwood",
  "categoryId": "85",
  "version": "1.7",
  "author": "Neotorus",
  "createdUnix": "1354424908",
  "updatedUnix": "1354424908",
  "containsAdultContent": false,
  "uploadedBy": "Neotorus",
  "primaryFile": null,
  "files": []
}