{
  "modId": 27691.0,
  "modName": "Shadowtroops Projects",
  "summary": "A collection of my unreleased projects. About 7 sets of armor. mainly a modders resource, but there are some goodies.",
  "descriptionHtml": "I am releasing these files because i have not been able to work on mods for quite a while now. i have been working hard at my new job, and frankly i cant get myself interest to get back into it. All of these should run stable, but i recommend using my other mods due to the fact that some of these use placeholder textures and might end up purple. I felt it was a appropriate to release these mods in the case that someone wants to use them as is or work on them. Included in this set is;\r\n\r\nJarvan IV Armor, A set of armor based off of the character from League of Legends (Male)\r\nAbandoned due to difficulty in texturing\r\n\r\nLeblanc Armor, A set of armor based off of the character from League of Legends (Female)\r\nAbandoned due to issues clipping\r\n\r\nLeona Armor, A set of armor based off of the character from League of Legends (Female)\r\nAbandoned due to skirt skinning problems\r\n\r\nBrand Armor, A set of armor based off of the character from League of Legends (Male)\r\nAbandoned due to looking like it fit fallout more than it did skyrim\r\n\r\nClaymore Armor, An armor set based of the anime Claymore. (Female)\r\nAbandoned due to skinning of the cape difficulties\r\n\r\nRed Vixen Armor, A set of armor that was meant to be mix and match (Female)\r\nAbandoned due to unsatisfied with textures\r\n\r\nLeatherBound Assassin, A spinoff of my Huntress armor set more stealthy (Female)\r\nAbandoned due to not enought free time\r\n\r\nCorset Armor, A set of armor that was part clothing part leather armor (Female)\r\nAbandoned due to texturing difficulties\r\n\r\nMost of these are craftable except for Jarvan, Vixen, and Claymore. i have left pictures with locatons. \r\n\r\nYou have my permission to do what you like with these, so long as i get some credit. please message me if worked on one of these and ended up releasing. I would love to see it!\r\n\r\nPS: i do have PSD files for most of these textures, message me if you would like them.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Shadowtroop",
  "createdUnix": "1354437754",
  "updatedUnix": "1354501662",
  "containsAdultContent": false,
  "uploadedBy": "Shadowtroop",
  "primaryFile": null,
  "files": [
    {
      "fileId": "102733",
      "name": "My Projects",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "52251",
      "fileName": "My Projects-27691-1-0.7z",
      "uploadedUnix": "1354438254",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f7f628a420e2ef5ccb5504721b1d5b751890f98fe9559fbe04eab706401f6a9e/analysis/1407288321/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20Projects-27691-1-0.7z?fid=102733&ttl=1535800594&ri=8192&rs=8192&setec=462ac839e5770f9d71c33bee8c8e97ac"
    },
    {
      "fileId": "102905",
      "name": "PSD files",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "310141",
      "fileName": "PSD files-27691-1-0.7z",
      "uploadedUnix": "1354501662",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PSD%20files-27691-1-0.7z?fid=102905&ttl=1535800595&ri=8192&rs=8192&setec=05a252e58594492fdd17439755b495cb"
    }
  ]
}