{
  "modId": 27759.0,
  "modName": "True Player Idling",
  "summary": "Makes the player idle like an NPC after 90 seconds of inactivity (configurable timer + hotkey). Will use idle markers, furniture (but not crafting furniture or beds) and wander around until a key is pressed. Requires SKSE.",
  "descriptionHtml": "[color=red][b]REQUIRES A WORKING SKSE INSTALLATION OF AT LEAST V1.06.00 OR BETTER[/b][/color]\r<br />\r<br />[color=yellow][b]WHAT IT IS:[/b][/color]\r<br />Based on what I&#39;ve learned from making [url=http://skyrim.nexusmods.com/mods/27738]this mod exploring AI-driven player travel[/url], this a a very simple mod which enables idling mode for the player character after 90 seconds of inactivity (this can be configured), causing your character to wander around in the current area and use furniture and idle markers until a key is pressed. There is also an optional hotkey setting for instant idle mode. I&#39;ve done earlier experiments with this but the codebase is vastly simplified and now uses states and registerforsingleupdate switches to be as safe and non-savegame bloat causing as possible. I&#39;ve included the script source code in the hope that other people will take this and build on it, and because I believe sharing strengthens the community and allows us all to build better and more awesome mods.\r<br />\r<br />There are some limitations:\r<br />- requires SKSE to monitor for a keypress\r<br />- you can&#39;t interrupt the player character when he&#39;s moving towards an idle marker (but at any other time a keypress will exit idle mode)\r<br />- Player can&#39;t use special/crafting furniture while idling (as this invariably brings up a menu)\r<br />- Player can&#39;t use beds while idling (but those would not give you a resting bonus anyway since you&#39;re idling, not sleeping)\r<br />- Forced third person perspective since many idles (drinking, eating, gardening) do not have first person meshes defined.\r<br />\r<br />[color=yellow][b]HOW IT WORKS:[/b][/color]\r<br />The basic structure is hidden quest &gt; adds AI package and script to player alias. Script registers for single update every 10 seconds and checks player position in the world. If not changed, increments counter variable. If counter reaches 9, assumes idle and changes state to AIdriven, package starts to run, and script starts monitoring keyboard presses every 0.1 seconds. Returns to initial state after keypress. The quest itself is never updated or touched again, it&#39;s just used for adding a script and AI package to the player on the fly.\r<br />\r<br />I believe this esp and script to be safe, but please use with caution (make a savegame beforehand so you have something to fall back on) and report any bugs/issues.\r<br />\r<br />[color=yellow][b]INSTALLATION:[/b][/color]\r<br />unrar archive in your data folder or use a mod manager. Activate mod. Start Game. Head to the Drunken Huntsman in Whiterun and pick up the spellbook from a table. Read the spellbook. Cast the spell Player Idle Config (under lesser powers). Enable the idle system (enable/reset option) and set your desired config options (see &#34;usage&#34; below).\r<br />\r<br />[color=yellow][b]UPGRADE/UNINSTALL[/b][/color]\r<br />Open the mod config menu and stop the idling system. Save. Exit. Upgrade or remove mod. If upgrading open the mod config menu again after starting Skyrim and re-enable the idle system. Ready to roll.\r<br />\r<br />[color=yellow][b]USAGE:[/b][/color]\r<br />Head to the Drunken Huntsman in Whiterun and pick up the spellbook from a table. Read the spellbook. Cast the spell Player Idle Config in the illusion school. This will open the config menu. NOTE you will have to enable/reset the system on first use/upgrade. You have the following options:\r<br />\r<br />[color=yellow][b]1. Idle timer settings[/b][/color]\r<br />From the same spell-based menu system, you can set the idle timer for 30-60-90-120-360-infinity seconds.\r<br />\r<br />[color=yellow][b]2. Hotkeys[/b][/color] (this feature may currently be out of order)\r<br />You can set keys L,O, and K as hotkeys for insta-idle (until someone explains how I use GetNthKeyPressed(Int n) in a menu or I figure it out myself). The assigned hotkey is a toggle - once pressed you will immediately go to idle mode and the script will ignore keyboard input completely. Press the key again to toggle it off, then press any key/move around to exit idle mode. By default no hotkey is configured - you will have to get the spellbook and learn the spell, it is waiting for you in the Drunken Huntsman in Whiterun.\r<br />\r<br />[color=yellow][b]3. IdleTypes[/b][/color]\r<br />Not implemented in this version\r<br />\r<br />[color=yellow][b]4. Enable/Reset Idling system[/b][/color]\r<br />This stops and starts the quest, hopefully resetting any glitching you may experience (haven&#39;t seen glitches yet). Don&#39;t spam this option - at least 15 seconds between using this.\r<br />\r<br />[color=yellow][b]4. Disable Idling System[/b][/color]\r<br />Disables the quest, removing the script and AI package from the player - use this if you&#39;re going to uninstall or upgrade.\r<br />\r<br />[color=yellow][b]TROUBLESHOOTING[/b][/color]\r<br />If you&#39;re unable to exit idle mode, make sure your SKSE is actually working. Sometimes drawing your weapon will help if nothing else will (and remember, during the time between the AI targeting an idle marker and getting there/using it you can&#39;t interrupt so wait a sec and press a key again). You can also open the console and type &#34;stopquest DIMplayeridlequest&#34; to completely stop the effect or access the same functionality from the supplied spell-based menu (disable idling system option). Remember that if you&#39;re using insta-idle from hotkey the keyboard is disable until you toggle the mode off (same hotkey) and then press some keys/move around.\r<br />\r<br />[color=yellow][b]ADVANCED/CONSOLE USAGE[/b][/color]\r<br />You can set the variable dimidletimer to manually control the idle timer. It works in multiples of 10 seconds + 10 seconds minimum, so setting it to 1 will set a timer of 20 seconds, 2 will set a timer of 30, 3 will set a timer of 40, and so on.\r<br />\r<br />startquest/stopquest/sqv DIMplayeridlequest to manipulate the running quest.\r<br />\r<br />The variable dimhotkey can be used to configure the dxscancode for the hotkey; you need to restart the quest if you change it.\r<br />\r<br />[color=yellow][b]FUTURE PLANS[/b][/color]\r<br />- adding more idle markers to the world (in a separate mod)\r<br />- trying to get special/crafting furniture working (without bringing up the menu)",
  "categoryId": "78",
  "version": "0.4",
  "author": "Acid Zebra",
  "createdUnix": "1354531082",
  "updatedUnix": "1355140371",
  "containsAdultContent": false,
  "uploadedBy": "acidzebra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "102967",
      "name": "Main esp and script",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Main esp and script-27759-0-1.rar",
      "uploadedUnix": "1354533539",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/0be3171563590d26d416caf19184cdc224f78f0a3bde4d61e8c8a664c1e231ea/analysis/1407289863/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20esp%20and%20script-27759-0-1.rar?fid=102967&ttl=1535800708&ri=8192&rs=8192&setec=28ce2129722ce48f8ef3427f7aa6ec1a"
    },
    {
      "fileId": "102968",
      "name": "main file and script",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "main file and script-27759-0-2.rar",
      "uploadedUnix": "1354534973",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/c40e48e658af84c3f3bfa7329cd097be3358bc5f590e28a335d5fa71625f2439/analysis/1407289863/",
      "changelogHtml": " Fixed embarrassing mistake causing you to not being able to use special furniture (forgot to set condition on package) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/main%20file%20and%20script-27759-0-2.rar?fid=102968&ttl=1535800708&ri=8192&rs=8192&setec=c8de8db03d797c1d0ce98cd10bde9da9"
    },
    {
      "fileId": "103019",
      "name": "Main esp and script",
      "version": "0.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Main esp and script-27759-0-3.rar",
      "uploadedUnix": "1354558378",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/28b4bddc627c5a6fadede58c6d2ce7a4feef15f1b2b6bfdc9b020b1beedbd4fd/analysis/1407290106/",
      "changelogHtml": " Adds magic spell menu (found in the Drunken Huntsman in Whiterun) to config idle timers and hotkey <br/> \n Hotkey toggles insta-idle mode, you need to toggle it again to exit - then move around  <br/> \n Default timer set to 90 seconds, 30-60-120-360 options available <br/> \n See mod description for upgrade instructions and usage <br/> \n See the screenshot for the exact location of the spellbook. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20esp%20and%20script-27759-0-3.rar?fid=103019&ttl=1535800709&ri=8192&rs=8192&setec=a6aacd5512e4fd8c60a5d1e38be0ac40"
    },
    {
      "fileId": "104362",
      "name": "TruePlayerIdlingMod",
      "version": "0.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "TruePlayerIdlingMod-27759-0-4.rar",
      "uploadedUnix": "1355140371",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/e1b1080b5e8683267c675d64fab9b1d4ac7550d60e82092f01a464905a59adf2/analysis/1407298389/",
      "changelogHtml": " Spell moved from illusion school to lesser powers <br/> \n add checks to prevent idling mode in dialogue and crafting <br/> \n add \"infinity\" idle timer option (not true infinity, just a large number) <br/> \n this update may have broken the insta-idle key (or my SKSE is borked) but I figure the above features were worth it <br/> \n minor code cleanup <br/> \n mod now starts in disable mode and will only be enabled after finding the spell book and activating the idling system <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TruePlayerIdlingMod-27759-0-4.rar?fid=104362&ttl=1535800709&ri=8192&rs=8192&setec=169a82348a12db42c77ee36c3ed61c8a"
    }
  ]
}