{
  "modId": 27764.0,
  "modName": "SoulMasters Chest",
  "summary": "This Mod is a collection of some of my previous mods plus a couple of new items all together in one chest!\r\n",
  "descriptionHtml": "Hi,\r\n\r\nThank you for downloading and trying my mod - SoulMasters Chest.\r\n\r\nThis Mod is a collection of some of my previous mods plus a couple of new items all together in one chest!\r\n\r\nIncluded are:\r\n\r\nSoulMaster\\'s Doom Bow - A very powerful Enchanted Bow\r\n\r\nSoul Arrows - Explosive Enchanted Arrows craftable at any Forge (new recipe)\r\n\r\n!New! Summon Soul Arrows Spell - Save all that tedious crafting! Now you can Summon 25 Soul Arrows at a time!\r\n\r\nGather Wood Spell - A handy spell to save you carrying round a heavy Woodcutters Axe. Casting the spell creates 2 Firewood in your Inventory.\r\n\r\nSummon Lockpick Spell - Very useful if you find yourself stuck in jail! Casting the spell adds a Lockpick to your inventory.\r\n\r\n!New! SoulMaster\\'s Legacy - A Godly Amulet that increases Magicka, Health and Stamina and Fortifies all Magic Categories.\r\n\r\n!New! SoulMaster\\'s Craft - A Godly Ring. Increases Archery, Smithing, Enchanting, Sneak, Pickpocket, Lockpicking, Carryweight and Resist Disease.\r\n\r\nIf you find the Enchanted Jewelery too overpowered (They will make you pretty much invincible!) Then you can always sell them for huge profit!\r\n\r\nTo obtain SoulMaster\\'s Chest:\r\n\r\nHead to Whiterun, as you enter the gate, Warmaiden\\'s is on the right and a small bridge leads over some water. Look under the bridge and you will find the chest.\r\n\r\nInstallation:\r\nFor best results, Install using Nexus Mod manager.\r\nIf installing manually then install the .esp to your Skyrim\\\\Data folder add the Script Directory to the Same Directory in Data.\r\n\r\nI hope you find the mod fun and useful!\r\n\r\nPlease feel free to leave any comments, feedback or bug reports.\r\n\r\nI would really like to see some screenshots you might take using The Bow especially! Feel free to upload some!\r\n\r\n[color=#00FFFF]Please take note: If you are using a pirated (ie non Steam enabled) version of the game, please do not leave comments about how this part of my mod or that is not working on your game! I am not prepared to waste my time trying to help you out with your illegal software! I\\'m unemployed, but still manage to pay for my games (they are what keep me sane) so if I can, you should be able to as well![/color]\r\n\r\nSoulMasterII\r\n\r\n[IMG]http://i1154.photobucket.com/albums/p535/mike_patrick1/sm0g9rv24znf_zps9d795d9a.gif[/IMG]\r\n\r\n[color=#FFFF00]Please, DO NOT upload any part of my mods anywhere else![/color]\r\n\r\n",
  "categoryId": "40",
  "version": "1.0",
  "author": "SoulMasterII",
  "createdUnix": "1354546685",
  "updatedUnix": "1354546733",
  "containsAdultContent": false,
  "uploadedBy": "SoulMasterII",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103000",
      "name": "SoulMasters Chest",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "74",
      "fileName": "SoulMasters Chest-27764-1-0.7z",
      "uploadedUnix": "1354546733",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dd5330e60859e29c5f7eb799516af1f377d894c89769e71ae0ad2e52f28bac3b/analysis/1407290046/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SoulMasters%20Chest-27764-1-0.7z?fid=103000&ttl=1535800713&ri=8192&rs=8192&setec=0130ea7fd073d17595b604bbf4d3ab8b"
    }
  ]
}