{
  "modId": 27775.0,
  "modName": "Franka The Battle Goat",
  "summary": "a very unusual mod that adds a cuirrased and completely custom mountable battle goat to the game, you can find her in riverwood near the wood factory.",
  "descriptionHtml": "my 6th mod is a very silly mod :D i&#39;ve made this for fun, but since so much people asked me to release the girl i&#39;ve decided to upload her on the nexus.\r<br />\r<br />\r<br />DESCRIPTION\r<br />this mod adds a new custom cuirrased battle goat named Franka to the game, you can mount Franka, she is unique and essential so can&#39;t be killed, she is 1.7 times bigger than the normal goats and she is also 1.2 times more agile and faster than the normal goats.\r<br />you can find Franka in riverwood, near the wood factory ( look at the image in the image section to see the exact position) and only you, the dragonborn can ride her but she is not yours&#33; she is not like those stupid horses that follow their owenrs....she is indipendent&#33; and does not have any owner; as soon as you dismount her, she will head back to riverwood to enjoy the fresh grass near the river.\r<br />(NOTE: you must have skyrim 1.8 version to load the esp)\r<br />\r<br />LORE\r<br />Franka was born in the province of cyrodill as one of the creation of sheogorath daedra prince of madness, she always was despised by his own kind for the incredible sizes and years ago she began to travel across tamriel searching for new friends offering his services to the ones she believe were deserving of riding her mighty muscles :D.\r<br />She travelled far north to the province of skyrim to give her contribute to the defeat of the dragons menace and to put an end to the civil war that is throwing the mother land of humans in the chaos.\r<br />\r<br />VIDEOS\r<br />thank you brodual :)\r<br />[youtube]QQ0D7nqR8Bk[/youtube] \r<br />\r<br />INSTALLATION\r<br />\r<br />to install this manually just extract the rar content into your skyrim data folder and be sure to check the battlegoat.esp in the data files when you start the game\r<br />\r<br />i also suggest you to put this lines into your skyrim ini, located in :documents/mygames/skyrim\r<br />[Camera]\r<br />fVanityModeMaxDist=2000.0000\r<br />fVanityModeMinDist=10.0000\r<br />fMouseWheelZoomMinDelta=0.0050\r<br />fMouseWheelZoomSpeed=0.8000\r<br />fMouseWheelZoomIncrement=0.01\r<br />fMinCurrentZoom=0.001\r<br />\r<br />\r<br />these lines allow you to adjust the view with every type of mount and i found them very very useful also for the actual gameplay as you can personalize the view of the character way more than the vanilla game.\r<br />\r<br />CREDITS and SPECIAL THANKS\r<br />-Credits goes to bethesda softworks for any skyrim and creation kit assets\r<br />-I want to give a big thanks to [url=http://skyrim.nexusmods.com/users/4899950]gg77[/url] for his ini lines and helping me solving the problems with the camera displacement on the mount; be sure to check is incredible mount mod with tons of new mountable creatures, from sabrecats to mammoths and even nice puppies: http://skyrim.nexusmods.com/mods/20351\r<br />-i wanna thank all the beta testers that helped me testing this mod (thank you guys you are wonderful):\r<br />[url=http://skyrim.nexusmods.com/users/4243482]Schmoops9[/url]\r<br />[url=http://skyrim.nexusmods.com/users/572828]Kaldaar[/url]\r<br />[url=http://skyrim.nexusmods.com/users/571605]CaBaL120[/url]\r<br />[url=http://skyrim.nexusmods.com/users/351527]TomAraya[/url]\r<br />[url=http://skyrim.nexusmods.com/users/3686980]Isinsocial[/url]\r<br />[url=http://skyrim.nexusmods.com/users/5095661]alexsilvestre[/url]\r<br />[url=http://skyrim.nexusmods.com/users/3678762]Jopineapples68[/url]\r<br />(deeply sorry if i forgot someone and just let me know if i did)\r<br />\r<br />PERMISSION\r<br />translation permission is not needed, if you want to use these assets in your mod just PM me and i&#39;ll gladly give you the permission, i&#39;m just curious to see in what my work is being used :D",
  "categoryId": "83",
  "version": "1.0",
  "author": "FrankDema",
  "createdUnix": "1354562791",
  "updatedUnix": "1354563203",
  "containsAdultContent": false,
  "uploadedBy": "frankdema",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103035",
      "name": "Franka The Battle Goat",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "918",
      "fileName": "Franka The Battle Goat-27775-1-0.rar",
      "uploadedUnix": "1354563203",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ff9506119265ae7c9540ba75ce373fca53bc431c2adae80de69dac3cee970c50/analysis/1407290166/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Franka%20The%20Battle%20Goat-27775-1-0.rar?fid=103035&ttl=1535800734&ri=8192&rs=8192&setec=2e627ed50e139c30b103e373670a3a7e"
    }
  ]
}