{
  "modId": 27781.0,
  "modName": "Tyrynariele",
  "summary": "This mod is still very much WIP anyone is welcome to download but as of yet you will nothing but a large empty space :)",
  "descriptionHtml": "Requires Racial Compatibilty: http://skyrim.nexusmods.com/mods/24168\r\n& Skyrim Update 1.8\r\n\r\n[u][size=10][color=ff0000]Anyone interested with the races that are being added to this mod can find finished and working versions of the wild elves, snow elves, blood orcs and dwemer [url=\\\"http://skyrim.nexusmods.com/mods/30042\\\"]Here[/url]\r\n\r\nThis was uploaded so users wouldn\\'t have to wait until the world space was finished before playing the races (though the finished worldspace may have different features for the races), please check it out and if youy like it an endorsement would be nice[/color][/size][/u]\r\n\r\nOk Guys, I finally have something a bit more substantial to offer you just in time for christmas and I am glad to announce that I have managed to overcome various problems to reach a point where I am ready to show my next step in this crazy challenge I\\'ve set myself :) please be mindful that I am still very new to modding though I have some game development knowledge from my time in college and that being said almost everything in this mod is made through constantly not knowing what I am doing until things stop crashing so any slaggin off of my work is allowed but I would like that you all remember how it was when you started modding. That said, have fun exploring and Happy Holidays to you all :)\r\n\r\n\r\n\r\nBasically, me and a friend have been playing with ideas for a worldspace mod and after much heightmap editing in photoshop I have uploaded this pre-beta version for him to take a look at so we can better decide smaller details like town placement quest location etc...\r\n\r\nAnyone is free to download and look at themselves and any ideas they have fully welcomed, just pm me and I\\\\\\'ll get back to you pretty quickly\r\n\r\n==========\r\nInstallation\r\n==========\r\nExtract the zip files and place the master, plugins and bsa\\'s into your data folder then run skyrim launcher and make sure the Tyrynarielé - World is at the bottom of the masters in the loadlist and the two plugins are at the bottom of the plugins in the loadlist (Data then Warp).\r\nThis should stop ctds for players using unique Hair or Eye mods.\r\nNote: SKSE Users should start this mod through the Launcher for the first time as I have sometimes noticed a glitch where the content doesn\\'t appear in game when using SKSE but using the launcher, starting the game with the mods installed, then saving and quitting to restart through SKSE seems to fix this.\r\n\r\n==================\r\nChangelog Ver 0.02\r\n==================\r\nWhat you get: 2 BSA Files \\\"Tyrynarielé - World\\\" & \\\"Tyrynarielé - Data\\\", Tyrynariele - World.esm, Tyrynariele - Data.esp, Warp Mechanic.esp and Readme.\r\n\r\nTyrynariele World: After Having Lots of Issues trying to build on such an uneven terrain which would tear horribly when ever I flattened a portion I decided to scrap that Heighmap and make a softer one meaning Tyrynarielé is now comprised of gently sloping hills and many smaller islands in place of one huge, mountainous, continent. I have begun building some Ayleid structures too available for veiwing at -3,17 which is a giant bridge connecting two islands together and at 28,-27, a small entrace into the side of a hill \\\"Tearofrail Sanctuary\\\", make sure to keep a note of where you are on the map as I have not added map markers and it is easy to get lost. World is full terrain LOD, no static or tress provided.\r\n\r\nTyrynarielé Data: Tyrynarielé data adds;\r\n4 Races that will be used in the world space, all are playable though none seem very unique at the moment, they are; Wild Elves, Deep Elves, Snow Elves and Amazons.\r\n1 New perk \\\"Tyrynese Smithing\\\" to craft Weapons and Armors related to the World.\r\nMoved studded Armor into Hide armor slot and converted Studded Slot into \\\"Tyrynese\\\" instead of using an empty slot, this allows the mod to be compatible Immersive Armors.\r\nAdded Red Wolf Cuirass (Only craftable at the \\\"Wolf Forge\\\" in Tearofrail and Tyrynese Sword (which at this stage is just an Ebony sword Duplicate. New Ore and Ingot \\\"Bloodstone\\\" required to craft Red wolf armor (Available in the chest inside Tearofrail Sanctuary along with a unique perk book (adds Tyrynese smithing, for those who have no new perk points available.)\r\n\r\nWarp Mechanic: Adds a door in Riverwood Sleeping Giant inn that Teleports you to the huge bridge in Tyrynarielé and a second door paralel to the first to allow easy transportation to Tearofrail region of the worldmap and back again - This is just meant as an aid for the player to visit the only notable landmarks and will not be needed when the final version is released -\r\n\r\n========\r\nVer 0.01\r\n========\r\nThis mod also adds 2 and a half playable races that are also still in beta but many more will be added by the next version and a circlet called \\\\\\\"Battle-Thief Circlet\\\\\\\" that has an enchantment to boost relavent stealth and cambat skills but is a bit overpowered and doesn\\\\\\'t show in the menu for some reason (current races are Wild Elves, called Aylemer and descended from Ayleids, Deep Elves/Dwarves/Dwemer - still a little buggy and in need of tuning and lastly Amazons whom I will be surprised if they are even playable yet as I only started work on them 5 minutes ago)\r\n\r\nTo get to Tyrynarielé (the empty worldspace) you must type \\\"cow Tyrynariele 0,0\\\" into your console as I haven\\'t set up a portal system yet\r\n\r\n====\r\nBugs\r\n====\r\nSome users may notice that Eye colors may not be available or that the game will CTD when choosing hairstyle or Eye color in character creation, as far as I am aware these are a little rare and only happen at the beginning of your game (try making sure any custom hair or eye mods are above this on the load order) if the problems persists then don\\'t choose hair or eyes straighaway and leave it with the defaults the open up the console and type Showracemenu to edit the appearance.\r\nInvisible Bridge in Tyrynariele - Bridge has no lod even when standing on it causing it to be invisible from almost every angle, fixed in the Tyrynarielé - data.esp (if the problem persists even when using Data.esp too then you will have to open the creation kit set Tyrynarielé - Data.esp as the active file then navigate to the worldspace and find the bridge at or around coordinates -3,17, then double click each section of the bridge and check the box \\\"Is Full LOD\\\" -or something similar- now save and restart the game and it should be fine).\r\nPlease report any other bugs to me along with the conditions that you encountered them in and I will try to solve them.\r\nPlease note: I have just discovered that the warp system is broken (meaning you can take the door to Tyrynarielé but it is a one way journey, to return home you will need to open the console and type coc whiterun -or wherever you intend to go- and the door at the bridge leading to Tearofrail sanctuary is also inactive meaning you can only travel from Tearofrail to the bridge but not vice versa (the tearofrail sanctuary is kind of easy to find just head south east from the bridge)\r\n\r\n============\r\nComing Soon\r\n============\r\nFully finished Worldspace.esm with completed cities, holds, dungeons etc plus full LOD\r\nMore Weapons, Armors, Races, Perks, Perk Books and Crafting Materials along with npcs and any other fun things I can think of to be added to Data.esp\r\nUnique Monsters, levelled lists and encounter zones to be added to the worldspace\r\nNew Storyline and quests Relative to Tyrynarielé and it\\'s back story\r\n\r\n=======\r\nCredits:\r\n=======\r\nShoneah Tokala & The Jewpacabro - Authors\r\nVarlaisaran - For their awesome Ayleid Building Resources (Available Here: http://skyrim.nexusmods.com/mods/23828 )\r\nexpired6978 - For the creation of the original Generic race controller Script and Race Compatibility Mod, along with the awesome tutorial on creating playable races. All Availble here: http://skyrim.nexusmods.com/mods/10165\r\n6Domino6 - For allowing me to use the source from the perk books mod, Try it here: http://skyrim.nexusmods.com/mods/13501\r\nAnd Finally Hothtrooper44 - For digging me out of the many ditches i crawled into while creating a simple piece of armor, Check out his Awesome and Innovative Mods at: http://skyrim.nexusmods.com/users/3656551/",
  "categoryId": "30",
  "version": "0.02",
  "author": "Shoneah0Tokala and TheJewpacabro",
  "createdUnix": "1354570461",
  "updatedUnix": "1356233274",
  "containsAdultContent": false,
  "uploadedBy": "Shoneah0Tokala",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103068",
      "name": "Tyrynariele",
      "version": "0.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "33961",
      "fileName": "Tyrynariele-27781-0-01.zip",
      "uploadedUnix": "1354572072",
      "modVersion": "0.01",
      "virusScanUrl": "https://www.virustotal.com/file/a15d8eadcfbc096dde1dc7bff19a836a501a584182f298975a1a30435525422c/analysis/1407290417/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tyrynariele-27781-0-01.zip?fid=103068&ttl=1535800751&ri=8192&rs=8192&setec=a2e6593df3f6233ac5ee2ea95afdcff7"
    },
    {
      "fileId": "106975",
      "name": "Tyrynariele",
      "version": "0.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "231414",
      "fileName": "Tyrynariele-27781-0-02.zip",
      "uploadedUnix": "1356233274",
      "modVersion": "0.02",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tyrynariele-27781-0-02.zip?fid=106975&ttl=1535800752&ri=8192&rs=8192&setec=3ab4e6a67612765cbefaec2ffc5b78dc"
    }
  ]
}