{
  "modId": 27795.0,
  "modName": "DarTsavi the Swift-Khajiit Lydia Replacer",
  "summary": "Turns Lydia in to a Khajiit named Dar\\'Tsavi the Swift.",
  "descriptionHtml": "WARNING:  Once in a great while this mod seems to not work on a particular savegame.  We have not been able to figure out why, but it is pretty rare.  It has always worked on new saves.\r\n\r\nNote:  She comes with the sword and outfit pictured, but not the circlet.  Due to her lack of hair (which I thought went well with her look) circlets show up strange like in the picture, but I still like them.\r\n\r\nI thought I was being original when I first made this and was so happy I had figured out a way to make myself a Khajiit follower who I could marry...Turns out when I was searching for Khajiit stuff here at the nexus, I was spelling it wrong, which is why I never found anything.  Anyway, I still like the way she turned out (she is based off an old savegame I uploaded here back before the creation kit was even out) and decided to share her with the world.  Naturally, she still has Lydias voice...which I know is odd for a Khajiit...but I don\\'t have recording hardware and anyway my voice acting sucks...and even if none of that was true, I\\'m still a noob with the creation kit so....bite me.  Also the Jarl of Whiterun (and anyone else who may know her name somehow) will still refer to her as Lydia.  Anyway...enjoy, and let me know what you think!",
  "categoryId": "66",
  "version": "1.0",
  "author": "RenoLibertine",
  "createdUnix": "1354600745",
  "updatedUnix": "1354600846",
  "containsAdultContent": false,
  "uploadedBy": "RenoLibertine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103115",
      "name": "LydiatheKhajiit",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8281",
      "fileName": "LydiatheKhajiit-27795-1-0.rar",
      "uploadedUnix": "1354600846",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9de0d134fa71f1263c825b4d04d99badd858be8da1f1ed6cc3e44c3f184a330d/analysis/1407290931/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LydiatheKhajiit-27795-1-0.rar?fid=103115&ttl=1535800777&ri=8192&rs=8192&setec=311ab40f9f198bab5d24ac7d18323ab2"
    }
  ]
}