{
  "modId": 27791.0,
  "modName": "Bottom of the Well",
  "summary": "Bottom of the Well - Beginner Player Housing in Whiterun.\r\n \r\n\r\nHello everyone! This is my first mod, I hope you all enjoy it. ",
  "descriptionHtml": "[youtube]-6gu-xWJnjY[/youtube]\r\n\r\n****IMPORTANT PLEASE READ****\r\nIf you are updating to this mod from the Steam version, please be sure to remove all stored items out of the Well BEFORE uninstalling the old mod, and save your game outside of the well. Please do not try and run this version with the one on steam, only one can be active at a time. Thanks! (This also applies to switching from 1.0 to 1.1)\r\n\r\nPlease be sure to only run 1 verison of \\\"bottom of the well\\\"\r\n\r\n*******ATTENTION*******I have just uploaded a \\\"nerfed\\\" version of this mod, the \\\"new character edition\\\" was brought more in line with an encounter of a lower level enemy, and only affects the difficulty of the Argonian NPC. While he was meant to be difficult, he is a little tougher than I thought and it kinds of ruins the point of it being a \\\"beginner\\\" player home. I recommend this version for anyone planning to start new characters and use this mod. DO NOT TRY TO SWITCH from 1.0 to 1.1 WITHOUT REMOVING ITEMS FIRST!!! Your stuff will dissapear!\r\n\r\n\r\nBottom of the Well - Beginner Player Housing in Whiterun.\r\n \r\n\r\nHello everyone! This is my first mod, I hope you all enjoy it. \r\n\r\nFeatures: Safe storage x4, Bed Roll, Torchbug in a Jar, Gold Coins courtesy of the wishful denizens of Whiterun.\r\nThis complete version has a few more features than the one on Steam, Such as: More detail, Working lock and key, Removable Torch Sconce, Miniature Well Companions(optional by pullchain)\r\nAnd my Argonian character, the one who inspired me to make this mod, is currently living in the Well. (Not friendly, save first)(No respawn)\r\n \r\nThis is locked at all times and requires key, which you can find sitting just on the ledge of the well above the trap door. (If key is missing just reload your game, it should be there)\r\n \r\nAll containers are safe storage - EXCEPT the 3 respawning Grocery Sacks all next to each other.\r\n \r\n*Bugs: Due to the small space and design of the Well shaft, if you\\'re in third person alot you may want to zoom in closer to your character as panning the camera bounces off the beams on the side, which I found slightly annoying. \r\n*The Gold Coins were intended to respawn but right now I can\\'t figure it out, so if you like them leave them laying about.\r\n*This mod will likely conflict with any mods changing the layout of Whiterun, such as \\'Better Whiterun\\'\r\n*J\\'Ram-Ku\\'s Corpse should clear eventually, I found that easiest was to wait 3 days outside the Well, then fast travel to Windhelm and back.. Or you can simply just use the console/disable on him, since he doesn\\'t respawn. (Use console commands at your own discretion, they can bug your game!!)\r\n*The pathing of the companions may seem a little buggy, but it was the best I could do to keep them and the navmesh working.\r\n*Occasionally the resident may fail to spawn, restarting the game fixes this.\r\n*If the Argonian fails to spawn initially, he will likely be there when you restart Skyrim again, this can create a \\\"i\\'m holding your stored items hostage\\\" scenario and depending on the version he is *not* easy to kill!\r\n \r\nYou may edit(for personal use) but not publish this mod as your own.\r\n \r\nPlease let me know if there are any problems as well as suggestions.\r\n \r\nEnjoy!\r\n \r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "InfiniteUltima",
  "createdUnix": "1354594109",
  "updatedUnix": "1354754903",
  "containsAdultContent": false,
  "uploadedBy": "InfiniteUltima",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103112",
      "name": "Bottom of the Well - Brutal Argonian",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Bottom of the Well-27791-1-0.zip",
      "uploadedUnix": "1354594265",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c2243b33889ba51f091776c085616801241cf5bd6f94005395d5ff93ba3d545b/analysis/1407290831/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bottom%20of%20the%20Well-27791-1-0.zip?fid=103112&ttl=1535800772&ri=8192&rs=8192&setec=5a9e0688087cbb4a128df83a5d5beebb"
    },
    {
      "fileId": "103416",
      "name": "Bottom of the Well - New character edition Argonian",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Bottom of the Well Updated - download this new version instead-27791-1-1.zip",
      "uploadedUnix": "1354754903",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d9e21b6c8d77a3d9580d41c056317e5448893a9cf3795b28481adab440a34c4e/analysis/1407292649/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bottom%20of%20the%20Well%20Updated%20-%20download%20this%20new%20version%20instead-27791-1-1.zip?fid=103416&ttl=1535800772&ri=8192&rs=8192&setec=fea3d5a581a46664dd51b895b4fcb169"
    }
  ]
}