{
  "modId": 27807.0,
  "modName": "Millview - A Lovingly Crafted Player House",
  "summary": "Yep, another player house mod. But hang on a second! This one is different!",
  "descriptionHtml": "[center][url=http://www.youtube.com/user/Demidekidasu][IMG]http://www.massey.ac.nz/massey/fms/Massey%20News/site-images/icons/social-media/youtube-icon.png[/IMG][/url][url=https://twitter.com/Demidekidasu][IMG]http://www.kellilampkin.com/wp-content/plugins/wp-greet-box/images/twitter_icon.png[/IMG][/url]\r\n\r\n[color=yellow]Released 1.1 update. Download main file then overwrite with the new one. MAKE SURE YOU UPDATE ON A SAVE [u]OUTSIDE[/u] THE HOUSE.\r\n\r\nA conflict with CLARALUX has been brought to my attention. To avoid this, you will need to disable the \\\"CLARALUX Headquarters, Carts and Engineers\\\" feature of CLARALUX.[/color][/center]\r\n\r\n\r\n[center][b]A really big thanks to [url=http://www.youtube.com/MrBiggenGaming]MrBiggenGaming[/url] and [url=http://www.youtube.com/Chayification]Chayification[/url] for the following videos![/b]\r\n[youtube]kyjgvrFxcyU[/youtube]  [youtube]Xo47dgxj9pk[/youtube][/center]\r\n\r\n\r\n[u][b]Changelog[/b][/u]\r\n[b]VERSION 1.1[/b]\r\n[i]Replaced many decorative objects with static equivalents to prevent stuff flying around when entering the house. MAKE SURE YOU UPDATE ON A SAVE [u]OUTSIDE[/u] THE HOUSE.\r\n- Replaced flower pots in the dining room.\r\n- Replaced alchemy lab decorative objects.\r\n- Replaced Scrolls in the bedroom and Mage\\'s Study.\r\n- Reshaped container activators to better fit the new statics.\r\n- Removed several colision boxes that were no longer needed.[/i]\r\n\r\n[b]VERSION 1.0[/b]\r\n[i]Initial release.[/i]\r\n\r\n\r\n[u][b]About Millview[/b][/u]\r\nYep, another player house mod. But hang on a second! This one is different!\r\n\r\nI decided to build a house for my character. I thought the project would only take a couple of days but, as with everything I start working on, I got a bit carried away...\r\n\r\nAnyway, this house has been made in the style of a Tudor mansion, it\\'s quite detailed but it\\'s not over-the-top which is something I seriously wanted to avoid. It has also been lovingly and painstakingly put together!\r\n\r\nPlease bear in mind that I initially made this house for myself, so there may be stuff that you personally don\\'t like about it. And because I made it for myself, I don\\'t plan to do any drastic changes to suit other people\\'s tastes, although I will undoubtedly release updates now and then if I discover bugs and other problems whilst playing. Or I may just decide to change/add things if I get bored :P\r\n\r\n\r\n[b][u]Recurring comments/complaints:[/u][/b]\r\n- I didn\\'t get the key!\r\n[i]Read the deed you bought and it should automatically give it to you. If this does not work for whatever reason (Skyrim is like that), just give yourself the key via the command console.[/i]\r\n\r\n- The bookshelves don\\'t work in the dining room!\r\n[i]I don\\'t want them to be interactive bookshelves, I want to be able to put whatever I want on them. There are interactive bookshelves in the hall and in the bedroom for your book storage needs. If I find myself running out of room to store books in the future, I might add more.[/i]\r\n\r\n- The \\\"Home\\\" music folder is not there!\r\n[i]This appears to be an issue with NMM not installing it, presumably because it is an empty folder. Whether it\\'s a bug or by design I do not know. If this happens to you, simply create the folder yourself. You may need to create the \\\"Music\\\" parent folder too. It\\'s filepath should be like this:\r\n\\\"[DRIVE LETTER]:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\Music\\\\Home\\\"[/i]\r\n\r\n\r\n[b][u]Some features that make it stand out from other houses:[/u][/b]\r\n- Custom music system.\r\n[i]By default it plays a selection of tracks from the vanilla game, but you can put your own music into the empty folder I provided (...Data/Music/Home) and it will play those instead. Full instructions are further down the page.[/i]\r\n\r\n- A fully functional bed.\r\n[i]This is an important one. When you sleep in the bed, it gives you a \\\"well rested\\\" bonus.[/i]\r\n\r\n- Custom storage solutions.\r\n[i]From ingredients to soul gems, there is a custom container for most things you can think of.[/i]\r\n\r\n- Working Navmesh, inside and outside, with lots of idle markers.\r\n[i]Completely follower-friendly, in other words![/i]\r\n\r\n- Purchase requirement.\r\n[i]You need to actually buy the house, an important feature for myself as I don\\'t like cheating in my game. Details of this are found in a \\\"for sale\\\" note on the front door. Of course, if you really want to cheat, just use the command console to give yourself the key! The price will vary depending on your character\\'s speechcraft skill. The base cost is 15k gold, which will equate to it costing somewhere between 30k and 40k for most mid-level characters (pure guesstimate).[/i]\r\n\r\n- Lovely location.\r\n[i]Located just to the south of Half-Moon Mill, Millview sits in the beautiful Falkreath hold with a view of Lake Ilinalta in the middle distance and scenic forest surrounding.[/i]\r\n\r\n- No DLC or other mod requirements.\r\n[i]Only uses assets that originate from the base game. And it should of course be fully compatible with the DLCs. I assume...[/i]\r\n\r\nThere are even more features than this, and it would be easier if I describe all the different parts of the house for you!\r\n\r\n\r\n[b]The Hall.[/b]\r\n[i]Upon entering Millview, you will find yourself in the main hall. There are potion and posion storage on the cabinet to your left, 3 mannequins (fully working!) to your right, and 3 weapon plaques on the wall ahead of you. There is also a fully-functional book shelf here.\r\n[/i]\r\n[b]The Dining Room.[/b]\r\n[i]Grand, but not rediculous, the dining room has a warm, cosy feel to it - and a lot of storage and display space!\r\n[/i]\r\n[b]The Attic.[/b]\r\n[i]A ladder in the corner of the dining room connects you to the attic above, which has plenty of general storage space for you, complete with cobwebs and some lingering smoke from the chimney. I pusposely left this area out when Navmeshing, because the AI will most likely turn your attic visit into an annoying cluster fuddle!\r\n[/i]\r\n[b]The Bedroom.[/b]\r\n[i]Complete with a fireplace, bookshelf and fully functional player bed.\r\n[/i]\r\n[b]The Kitchen.[/b]\r\n[i]Here you can find your ingdredient and food storage, your cooking spit and your alchemy lab - which features some decoration.\r\n[/i]\r\n[b]The Cellar.[/b]\r\n[i]Even more storage space!\r\n[/i]\r\n[b]The Caldarium.[/b]\r\n[i]This is the most feature-laden part of the house. There is a steam room here, and you and your followers can sit down and relax in the pool of hot water (yes, I found a way to make invisible furniture work on the player). When you feel sufficiently invigorated, use the nearby showers to complete your bathing experience. And yes, the showers work too :)\r\n[/i]\r\n[b]The Mage\\'s Study.[/b]\r\n[i]Dangling above the room is a cage with a trapped magic source casting dramatic shadows. Here you will also find your arcane enchanter (with custom added decorations of course). Be sure to look around the room at all the other little details and custom storage I have put in here!\r\n[/i]\r\n[b]The Cavern.[/b]\r\n[i]When the builders of Millview were digging out the cellar, they accidentaly dug into an underground cavern where an ancient temple of Dibella has collapsed into a geothermic vent. This place screams of beauty, with a deep pool of crystal-clear water illuminated by the sun from above. The perfect place to relax and forget about the troubles of the world.\r\n[/i]\r\n\r\n[b][u]How To Use Custom Music.[/u][/b]\r\nFirst, you need to convert your tracks into .wav (Wave) format. There are many ways you can do this, none of which include simply renaming the file extension!\r\n\r\nThen name them numerically between 01 and 12, e.g. \\\"01.wav\\\" \\\"02.wav\\\" and so on.\r\n\r\nPlace your tracks into the empty folder I provided (...Data/Music/Home), and they will play in your house.\r\n\r\n\r\n[u][b]SOME OF MY OTHER MODS[/b][/u]\r\n- [URL=http://skyrim.nexusmods.com/mods/19841]LIAT - Lively Inns and Taverns[/url]\r\n- [URL=http://skyrim.nexusmods.com/mods/23216]Bard\\'s Lute[/url]\r\n- [URL=http://skyrim.nexusmods.com/mods/26478]Erys[/url]\r\n- [URL=http://skyrim.nexusmods.com/mods/27975/]Custom Music In Your House[/url]\r\n- [URL=http://skyrim.nexusmods.com/mods/26589]Passtime[/url] (alpha test)\r\n- [URL=http://forums.nexusmods.com/index.php?showtopic=832425]LTC - Lively Towns and Cities[/url] (coming soon!)",
  "categoryId": "67",
  "version": "1.1",
  "author": "Demidekidasu",
  "createdUnix": "1354641484",
  "updatedUnix": "1354793668",
  "containsAdultContent": false,
  "uploadedBy": "demidekidasu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103197",
      "name": "Millview v10",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "110962",
      "fileName": "Millview-27807-1-0.zip",
      "uploadedUnix": "1354643239",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5e6b2e18a190c4489235bc064c2d1da39de2777e4d276251be986d341f50d105/analysis/1407291425/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Millview-27807-1-0.zip?fid=103197&ttl=1535800791&ri=8192&rs=8192&setec=5fcaeb2a8358503b70456731aa022068"
    },
    {
      "fileId": "103478",
      "name": "Update v11",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "267",
      "fileName": "Update v11-27807-1-1.zip",
      "uploadedUnix": "1354793668",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/98cf840ac605e94c44015f43100714c45445685fc8cc3cd6392051fa104849a0/analysis/1407293044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20v11-27807-1-1.zip?fid=103478&ttl=1535800792&ri=8192&rs=8192&setec=70653abca855a09089ba13020ed6fc89"
    }
  ]
}