{
  "modId": 27801.0,
  "modName": "Armored Skeletons and The Walking Dead - Traduzione Italiana",
  "summary": "This is only a translation into Italian of the original mod.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/mods/26706] \t\r\nArmored Skeletons and The Walking Dead[/url].\r\nThe original mod adds several new Skeleton & Undead types into the world of Skyrim. The Skeletons wear now iron, steal or leather armor and make use of weapons according to this armor types. In addition to that they are stronger than the vanilla ones. Also a new iron armored draugr type is added and some Lich variants. The Lich is a fairly strong creature. He summons other Undeads for help and only appears at higher levels.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size][/center]\r\n\r\nQuesta interessante mod aggiunge al gioco diversi tipi di non-morti e scheletri, che finalmente indosseranno un\\'armatura e saranno più forti di quelli originali. Aggiunge anche un nuovo tipo di draugr in armatura e delle varianti del Lich: una potente creatura che può evocare altri non-morti in suo aiuto!\r\n\r\n[color=GREEN][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=GREEN][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "83",
  "version": "v3",
  "author": "Andre7890",
  "createdUnix": "1354629114",
  "updatedUnix": "1354629114",
  "containsAdultContent": false,
  "uploadedBy": "Andre7890",
  "primaryFile": null,
  "files": []
}