{
  "modId": 27821.0,
  "modName": "Rejuvenation of the Old - WIP",
  "summary": "Fairly simple mod that makes life easier in combat.",
  "descriptionHtml": "[center][IMG]http://i208.photobucket.com/albums/bb280/Shadow_SoD_/Skyrim%20Shots/RejuvenationoftheOld.png[/IMG][/center]\r\n\r\n\r\nEver missed the Rejuvenation potions from the good old RPG\\'s, where it was the best potion you could find that could change the outcome of a battle when you were fighting against debuffing enemies? Well look no further.\r\n\r\nHistorians all over the world gathered and were finally able to decipher the lost tome of the Old Ones and uncovered something that will help mankind in their struggle to survive in these harsh times.\r\n\r\nYou are invited to the Temple of The Divines located in Solitude, to be one of the first to test this new medicine that arrived to Skyrim. Look for Lady Andromeda. \r\n\r\n\r\n[color=darkorange]Requirements:[/color]\r\n- Skyrim 1.8\r\n- Dawnguard\r\n\r\n[color=red]Features:[/color]\r\n- 6 new potions added that restore health, magicka and stamina in one drink (those familiar to rejuvenation potions from other games already know). Higher levels -> higher level valued potions.\r\n- A new Potions Merchant that has arrived in Solitude and made her stay at the Temple of The Divines, she\\'ll be selling the new potions + the regular ones (health, magicka and stamina), her wares are randomly generated, sometimes you may not find the exact number/type of potions you\\'ve seen before\r\n- The potions level with your character, so you won\\'t be finding potions that fully restore your pools at level 1\r\n- If she doesn\\'t have the new potions right away when you first talk to her, wait a few days or level up more.\r\n- The aim of the mod was to make life a little easier when fighting enemies that not only damage your health but at the same time your magicka and stamina and it can become quite troublesome when you have to drink potion after potion for each one of them.\r\n\r\n[color=darkorange]Installation/Uninstallation:[/color]\r\n\r\n- Use NMM to install/uninstall the mod, or extract and copy the file to \\\"C:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\\\\" or where your Skyrim installation (remember to check if it\\'s activated).\r\n\r\n[color=darkorange]Future Updates:[/color]\r\n- Non-Dawnguard version\r\n- A quest for the merchant\r\n- A spell/power with the same effect of the potion\r\n\r\n[color=red]Incompatibilities:[/color]\r\n- Mods that change the interior of The Temple of The Divines\r\n- Not sure if it will work with older versions of Skyrim, since with the latest update there were changes made to CK as well. If it doesn\\'t, sorry there\\'s nothing I can do.\r\n\r\n[color=red]Bugs:[/color]\r\n- None reported yet\r\n\r\n[center][youtube]jAqLpx9Z3qA[/youtube][/center]\r\n\r\n\r\nHave fun and enjoy. If any problems occur, please let me know and I\\'ll do my best to repair them.",
  "categoryId": "94",
  "version": "1.0",
  "author": "eSoDian",
  "createdUnix": "1354662403",
  "updatedUnix": "1354668308",
  "containsAdultContent": false,
  "uploadedBy": "eSoDian",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103248",
      "name": "Rejuvenation of the Old",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Rejuvenation of the Old-27821-1-0.7z",
      "uploadedUnix": "1354668308",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e84ac96b2860953a5ef717f205de4fa7c32d7f903326e2c4462e7de145adaec8/analysis/1407291707/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rejuvenation%20of%20the%20Old-27821-1-0.7z?fid=103248&ttl=1535800810&ri=8192&rs=8192&setec=2611943e4ab7c3f81c818eb6133ae1c2"
    }
  ]
}