{
  "modId": 27825.0,
  "modName": "deleteIstolds Tomb in Solitude Blue Palace ALPHA",
  "summary": "Istold\\'s Tomb is the tomb of Istold that have been forgotten long ago by most folks, so nobody really knows about it. Torygg was the only one left who knew about the tomb but now as Ulfric killed Torygg, there is no one left who knows about the tomb.",
  "descriptionHtml": "*Personal note from me, please if you like the idea of this mod - please share in the comment field so I will know, got few mod projects and not sure which to spend time on! Thanks.\r\n\r\n\r\nWHAT IS \\'ISTOLDS TOMB\\' ABOUT?\r\nIstold\\'s Tomb is the tomb of Istold that have been forgotten long ago by most folks, so nobody really knows about it. Torygg was the only one left who knew about the tomb but now as Ulfric killed Torygg, there is no one left who knows about the tomb.\r\n\r\nTorygg had sealed the door for reasons unknown (so far), the key? vanished.\r\nBut in a very old journal of someone was found recently with words about Istold and deadric worship. Perhaps that is why Torygg did never speak of this tomb and sealed the room off from everyone?\r\n\r\nWhat is down there that Torygg didn\\'t want the world or anyone close to him know about?\r\n\r\n\r\n\r\nWHO IS \\'ISTOLD\\'?\r\nIstold was the father of Torygg that was the High King of Skyrim before he was killed by Ulfric Stormcloak. Istold was High King for nearly 25 years.\r\n\r\n\r\n\r\nWHERE DO I FIND THE \\'KEY\\' FOR THE \\'SEALED ROOM\\'?\r\n- Search in Solitude Catacombs, look on the right side.\r\n- Some unknown dead person ate the key for some unknown reason. Perhaps that killed him?\r\n\r\n\r\n\r\nv0.1\r\n- Added the Sealed Room inside the Blue Palace in Solitude.\r\n- Added cellar door to the Blue Palace that will take you down to Istold\\'s Tomb.\r\n- Built the beginning of Istold\\'s Tomb, deadric thing, torches.\r\n- Added the key to the Sealed Room in the Solitude Catacombs, in the bones of a dead man. He probably ate it and that killed him.",
  "categoryId": "67",
  "version": "0.1",
  "author": "ValenwoodElf aka Sparrow",
  "createdUnix": "1354672028",
  "updatedUnix": "1354672028",
  "containsAdultContent": false,
  "uploadedBy": "ValenwoodElf",
  "primaryFile": null,
  "files": []
}