{
  "modId": 27827.0,
  "modName": "Lunar Armor - Quest and Armor Set",
  "summary": "REQUIRES DAWNGUARD - Adds a Quest and a set of Lunar Armor (HEAVY) which has special conditions while the moons are out.",
  "descriptionHtml": "[size=5]10-14-2016\r<br />\r<br />[/size]I made an attempt to polish this mod up and fix a few things that were kind of frustrating, make it more straightforward and ended up messing with a lot of different variables that I cant seem to fix.  This mod works as is, it only requires you to have beaten Dawnguard and also to have the paragon stones.  I&#39;m leaving it as it is and hope some of you enjoyed it.\r<br />\r<br />-----\r<br />\r<br />\r<br />\r<br />\r<br />I was inspired by Gaijune&#39;s mod &#34;Kynesguard and Daedra Hunter&#34; to make a quest and armor mod, as I really enjoyed his work.  \r<br />\r<br />http://skyrim.nexusmods.com/mods/20305\r<br />\r<br />\r<br />DAWNGUARD IS REQUIRED&#33;&#33;&#33;\r<br />\r<br />If you have not bought the dawnguard DLC yet, DO IT NOW&#33;&#33;&#33; I was really amazed with how much detail was put into the mod.  The creators gave you the freedom to explore and discover rather than pointing you towards the next objective all the time.\r<br />\r<br />I created this mod to bring you back to many of the beautiful DLC content in dawnguard that you may have missed out on.  I had beaten the main quest and returned to the forgotten vale to find that I had much more to do.  I really loved that the creators gave us the freedom to explore and discover so I am trying to bring that back into the game with this MOD.\r<br />\r<br />What this mod does is add 5 pieces of Lunar Armor to discover.  It is HEAVY ARMOR and I don&#39;t have any current plans to create a light armor set.  It uses current ingame textures from the Dawnguard DLC.\r<br />\r<br />The quest begins upon loading your game, and requires some exploration to find the items.\r<br />\r<br />Unlike my previous mod, this one does add some minor scripts to the game.  I have spent the last week testing this mod repeatedly (over 40 hours of testing).  I recommend a new save file, as upon uninstallation there may be some problems.\r<br />\r<br />The mod will bring you back to the Ancestor&#39;s Glade, Forgotten Vale, and to other locations you may have already been to.  If you haven&#39;t downloaded DAWNGUARD yet, DO IT NOW&#33;&#33;&#33; And install this mod as it will take you to some of the less obvious places within the world.\r<br />\r<br />Some of the effects of the added armor:\r<br />\r<br />- Ability to temper, and forge into Masser Mail.\r<br />- While the moons are out, increased regeneration, sprint speed, a new Shout ability\r<br />- While blocking, a cloaking effect (even with 2 hand weapons)\r<br />- Other hidden bonuses while the moons are out\r<br />\r<br />This mod also adds a new small area (Lunar Caverns) and also added FX to existing areas.\r<br />\r<br />I hope you enjoy it, this is my first OFFICIAL big release mod and I&#39;ve put alot of hours into testing it.\r<br />\r<br />My other mod released was the &#34;Kyne&#39;s Peace Healing Shout&#34; mod, and previously the &#34;Lunar Armor&#34; which I removed as it had not been tested as extensively as this version, and many conditions and touchups have been re-done on the armor set.\r<br />\r<br />Please comment if you have any problems with this mod, I don&#39;t consider it a WIP but an official release so far as I have spent so many hours testing it, but it may have compatibility with other mods so MAKE A NEW SAVE&#33;&#33;&#33;\r<br />\r<br />And if you enjoy this mod please endorse and I will begin work on similar mods&#33;\r<br />\r<br />Also if any modders would like to know how any part of this mod was done, please ask as it was quite the learning experience for myself, I&#39;d be happy to share what I&#39;ve learned.\r<br />\r<br />\r<br />INSTALLATION - Extract the ESP file into your skyrim/data folder, then enable.\r<br />\r<br />If you would like to skip the whole quest and go right to the armor, I&#39;ve added a chest to the Septimus Signus outpost containing the items although that wouldn&#39;t be very much fun, would it?\r<br />\r<br />You can also add the items via console using the &#34;help lunar&#34; command, then by using the &#34;player.additem ####### 1&#34; command to add the items to your inventory.\r<br />\r<br />BUGS:\r<br />\r<br />- Lunar Gauntlets and Shield cause NPC to think you have a magic spell ready.  It appears to be due to the cloak effect, it also appears when using the Dawnguard Rune Shield so it must be a bug in the game itself to do with cloak enchantments and not the mod itself.\r<br />\r<br />-  Speed enhancement only works when you let go of and quickly re-hit the sprint key.  This is also another bug with the game itself and not due to the mod.  There isn&#39;t a way to immediately increase speed it seems you have to re-sprint in order for it to take effect.\r<br />\r<br />Bugfixes:\r<br />\r<br />- Fixed issue where loading the game would cause you to constantly hear the &#34;healing&#34; effect noise of the lunar plate",
  "categoryId": "54",
  "version": "1.01",
  "author": "Dirtfoot84",
  "createdUnix": "1354678409",
  "updatedUnix": "1355407472",
  "containsAdultContent": false,
  "uploadedBy": "dirtfoot84",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103287",
      "name": "Lunar Armor Quest - Requires Dawnguard",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58",
      "fileName": "Lunar Armor Quest - Requires Dawnguard-27827-1-00.rar",
      "uploadedUnix": "1354680525",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/fda2d412378e3eae33984c5c1a5d43a8217a5091b8f63781ef87ebdb4e368283/analysis/1407291843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lunar%20Armor%20Quest%20-%20Requires%20Dawnguard-27827-1-00.rar?fid=103287&ttl=1535800817&ri=8192&rs=8192&setec=40f3f0bf199e1c3ce6dfd21668251985"
    },
    {
      "fileId": "104978",
      "name": "Requires Dawnguard - Lunar Armor - Quest and Armor set",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57",
      "fileName": "Requires Dawnguard - Lunar Armor - Quest and Armor set-27827-1-01.rar",
      "uploadedUnix": "1355407472",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/c580fc328aaea849157a168c934fdcee043839eb6ba3406b34d178808ffea691/analysis/1407302892/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requires%20Dawnguard%20-%20Lunar%20Armor%20-%20Quest%20and%20Armor%20set-27827-1-01.rar?fid=104978&ttl=1535800817&ri=8192&rs=8192&setec=d5ececf4fe9a26acca4929879e4a5725"
    }
  ]
}