{
  "modId": 27858.0,
  "modName": "Conjure Soul Gems spell",
  "summary": "conjure soul gems. pretty self explanatory really.",
  "descriptionHtml": "There aren\\'t that many ways to get hold of soul gems in skyrim. Sure there are random finds in treasure chests, NPC\\'s and the like, the soul cairn (or however it\\'s spelled) , mining under blackreach and buying them from merchants <i>when</i> they have them in stock and for quite ridiculous prices.\r\n\r\nWell, now there\\'s a much more reliable means of acquisition available to you.\r\nBy finding Falion in Morthal, you can buy (or otherwise acquire) a spell tome a spell which will allow you to magicly create your own soul gems.\r\n\r\nThe soul gem that is created by the spell is entirely dependant on your characters conjuration skill level. the higher the level, the better the soul gem.\r\n\r\nThis spell is somewhat unique in that it does not have a specific magicka cost.\r\nit quite simply requires your magicka bar to be full then completely drains it upon casting.\r\n\r\n\r\nNote:\r\n\r\nApparently,  this mod should be able to be installed with the mod manager so I\\'m enabling the download with manager button.\r\n\r\nIgnore all this:\r\nThis is my first time releasing a mod that uses any form of script and as such have disabled the download with managed button as I can\\'t be sure if it would install successfully. installation instructions are included in the read me file. ",
  "categoryId": "75",
  "version": "1",
  "author": "AMKitsune",
  "createdUnix": "1354741376",
  "updatedUnix": "1354741452",
  "containsAdultContent": false,
  "uploadedBy": "AMKitsune",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103394",
      "name": "Conjure Soul Gem spell",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Conjure Soul Gem spell-27858-1.zip",
      "uploadedUnix": "1354741452",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/030b894d7d9bf103cf1e03cf7ff85fde32c7479b4aef06b127a21980d82c2c23/analysis/1407292509/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Conjure%20Soul%20Gem%20spell-27858-1.zip?fid=103394&ttl=1535800867&ri=8192&rs=8192&setec=17ec86935e410e6ef0f31c1df4b04851"
    }
  ]
}