{
  "modId": 27867.0,
  "modName": "True Skyrim",
  "summary": "The wait is finally over! The well-known mod on Steam Workshop and is finally here for you to enjoy! Tens of thousands of players have used my mod on the Workshop, are you next?",
  "descriptionHtml": "The must-have mod adds necessary detail to the world so you actually feel immersed in gameplay. Wilderness areas have real, hand-crafted forests. Roads have streetlights that guide you through the night. Outskirts of towns are more detailed, with more scenery such as more patrolling guards, more animals, objects, etc. Bandit camps are more detailed and filled with more foes. Forests are actually dense and filled with wildlife and sounds. \r\n\r\nNowhere in this game does it say Skyrim is a tundra. \r\n\r\nPeople on Nexus and Workshop are feeding this to you and it needs to stop. This is a fantasy game; it can be whatever you want it to be. I made this mod to make it more interesting. Tundras are empty and boring and I don\\'t care if it\\'s not longer a tundra, at least now it\\'s fun. You\\'re welcome :)\r\n \r\nNOTE: Pictures are of Whiterun and nearby areas because those are the most visited and well known places in Skyrim. I want them to stand out and be amazing. Nothing I submit is ever finished, I will constantly fix things. If you want to see more pictures, then wait patiently until I can work on this more. Or you could install it, try it and see how it goes. ",
  "categoryId": "78",
  "version": "V1.0",
  "author": "Scyrka ",
  "createdUnix": "1354759613",
  "updatedUnix": "1354760569",
  "containsAdultContent": false,
  "uploadedBy": "Scyrka",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103421",
      "name": "TrueSkyrim",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "537",
      "fileName": "TrueSkyrim-27867-V1-0.rar",
      "uploadedUnix": "1354760569",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/01d459832a46cb3821b2ddbda05b13e076602d395cdd2252e8646d35155bf957/analysis/1407292749/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TrueSkyrim-27867-V1-0.rar?fid=103421&ttl=1535800884&ri=8192&rs=8192&setec=ea86b4d780fba5d9d6de2555a7ecebdc"
    }
  ]
}