{
  "modId": 27865.0,
  "modName": "Tutorial - Create anything into standalone and craftable",
  "summary": "Read the Description!",
  "descriptionHtml": "Its just a guide for people who want to learn easy with exactly steps.\n<br />\n<br />***I deleted the first uploaded file because i forgot to remove some wrong steps in the first part which was saying something to do like in video. \n<br />When i decided not to make a video tutorial but only a writen, i forgot to correct those steps.\n<br />Now the corrected file is up, those who have the previous file, please delete it and download the new one, i'm really sorry for my mistake, happy moding.***\n<br />\n<br />Sorry no video tutorial, my antivirus thinks that the program Fraps has a virus and it blocked the exe file, which this program can record anything and make screenshots.\n<br />\n<br />About the retexturing part of the guide, in case you don't know how to use Photoshop or Gimp to retexture a texture \"dds file\", sorry but i can't explain the whole Photoshop or Gimp program, you have to find a fine tutorial about those programs, writen or recored.\n<br />\n<br />About the Photoshop dds Plugins, if you already have installed photoshop, download and install this:\n<br />https://developer.nv...adobe-photoshop\n<br />If you have 32bit pc/windows then download then click on 32-bit, if you have 64bit then click on 64-bit, this will add the dds plugins to photoshop and then can open the textures.\n<br />\n<br />Good luck and have fun! ^^\n<br />\n<br />Permmisions:\n<br />1) Users are not allowed to edit and upload my file to other sites since i spent hours to use the programs carefully and write the steps of the tutorial!\n<br />2) Translations are allowed, no need to ask me. \n<br />[b][i][u]3) Users/Modders are not allowed to upload my mods on Steam Workshop as their own to obtain money, my mods will always stay on nexus for free!\n<br />[/u][/i][/b]\n<br />Credits:\n<br />Made by haldir307",
  "categoryId": "28",
  "version": "1.0",
  "author": "haldir307",
  "createdUnix": "1354753017",
  "updatedUnix": "1354885613",
  "containsAdultContent": false,
  "uploadedBy": "haldir307",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103641",
      "name": "Tutorial of haldir307",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "3",
      "fileName": "Tutorial of haldir307-27865-.rar",
      "uploadedUnix": "1354885613",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/18bf704b460b79403b35561c64de6b3f00ff69eb6ce4961eb872263c1188d03a/analysis/1407294072/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tutorial%20of%20haldir307-27865-.rar?fid=103641&ttl=1535800873&ri=8192&rs=8192&setec=7dcbe6423d757095a7161ff775c51a75"
    }
  ]
}