{
  "modId": 27928.0,
  "modName": "NoQuestRim",
  "summary": "Removes all quests in Skyrim, creating a blank slate for you to play with!\r\n  ---  Open for sale! Anyone want to take up or over this idea? Feel free. No need to give me credit. I want to play this mod",
  "descriptionHtml": "Update:\r\n\r\n  ---  Open for sale! Anyone want to take up or over this idea? Feel free. No need to give me credit. I want to play this mod\r\n\r\nI\\'ve been busy with study and work, and right now don\\'t see myself having the time to learn the scripting necessary to do all I want to do.\r\n\r\nI would have loved to, but can\\'t.\r\n\r\nSo someone, anyone, please take over!\r\n\r\n\r\n\r\n\r\nUpdate:\r\n\r\nSo basically, I know nothing about scripting. If there\\'s anyone familiar with papyrus who can do some (I assume simple) changes to enable dragons to both spawn, and to appear at Dragon Points, that would be wonderful.\r\n\r\nMore ideally, if you know how to create word walls in-game that could bestow the quest-related shouts.\r\n\r\nI\\'m currently working on going through all world spaces and doing some very simple modifications: Unlocking doors, or removing obstructions. At this point, I\\'m going to be focusing on areas with Word Walls ahead of anything else.\r\n\r\n\r\nOn that point:\r\n\r\nLISTS!\r\n\r\nUntested Cleared areas - \r\n\r\nDust Cairn\r\n\r\n\r\nUncleared Areas: Everything else.\r\n\r\n\r\nI\\'m trying to use Wikis to find as many quest cells as possible, to try and unlock doors. The list for main areas and guilds should be fine - but if you know of any isolated-quest areas that have barriers, let me know!\r\n\r\n---\r\n\r\n\r\n\r\n\r\nWhat is NoQuestRIm?\r\n\r\nA very simple mod. It removes all vanilla quests and subquests and minor quests in the game.\r\n\r\nAll random world events remain, as do all quest-related items and areas. All dragon walls are useable. You may get quest-related dialogue (such as through rumours at inns) but ideally no quests will actually trigger.\r\n\r\n---\r\n\r\nCurrent Progress:\r\n\r\nCurrently at an alpha stage.\r\n\r\nThe game is perfectly stable, but many (Not that many...) areas are unaccessible and items are unobtainable. I haven\\'t played with the creation kit all that much since my first two overtly simplistic mods, so it may take me some time to get this in a refined state.\r\n\r\nSO, if you want to help, simply let me know!\r\n\r\n\r\n----\r\n\r\nKnown bugs:\r\n\r\n* Many areas are unaccessible, while quest-related items (such as the thieves guild armor) are unobtainable\r\n\r\n*Some Vanilla followers are unaccessible for previous reasons\r\n\r\n*Some word walls are unaccessible, because the areas are unaccessible\r\n\r\n*Just Fus. No Roh or Dah. I would like to fix this. Also missing one word of Whirlwind Sprint.\r\n\r\n\r\n---\r\n\r\n\r\nUntested Bug Fixes:\r\n\r\n* The Golden Claw starts when you go near Mr. Webstruck in Bleak Falls Barrow. It doesn\\'t start at any other point.\r\n\r\nShould no longer trigger when you get close to him.\r\n\r\n---\r\n\r\nPlans:\r\n\r\nFirstly, enable access to all word walls, dragon points, and randomly spawning dragons.\r\n\r\nEnable access to all available areas\r\n\r\nFigure out what items are sufficiently unique to enable in-game somehow, and remove any loose quest triggers.\r\n\r\nEnable all vanilla followers without the need for questing\r\n\r\nRemove all essential markers from all relevant characters\r\n\r\n\r\n----\r\n\r\n\r\nUse Advice:\r\n\r\nUse an alternative start mod. I can only assume my mass deletion of quests has affected unbound.\r\n\r\nIf you want dragons in-game, you will need to get an enabler. I am looking in to enabling dragons myself here, but for now:\r\n\r\nhttp://skyrim.nexusmods.com/mods/9621\r\n\r\n\r\n---\r\n\r\n\r\nWhere do I want to be?\r\n\r\nIn a nut shell, I\\'d like a fully functional world without a single quest - why? Well, primarily because it would allow you to create your own Skyrim world through quest mods. It would also allow other modders to mess with the world freely though apocalypse mods, or create their own epic quests utilising the entire world (and cast) without fear of hindering the Skyrim experience.\r\n\r\nI made this primarily to have a workable \\'sandbox\\' Skyrim using basic needs and a timescale of 1.",
  "categoryId": "35",
  "version": "0.02",
  "author": "johnwalker60",
  "createdUnix": "1354883711",
  "updatedUnix": "1354933709",
  "containsAdultContent": false,
  "uploadedBy": "johnwalker60",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103638",
      "name": "NoQuestRim - Alpha of an Alpha",
      "version": "0.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1209",
      "fileName": "NoQuestRim - Alpha of an Alpha-27928-0-01.rar",
      "uploadedUnix": "1354883792",
      "modVersion": "0.01",
      "virusScanUrl": "https://www.virustotal.com/file/05f5ded39dc320a83f91e18a26ff0004456b2cf2f6cafa1f00c1b9fc475b009d/analysis/1407294067/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NoQuestRim%20-%20Alpha%20of%20an%20Alpha-27928-0-01.rar?fid=103638&ttl=1535800960&ri=8192&rs=8192&setec=ada93e2c4263ff3eca0fc57ee6712ff9"
    },
    {
      "fileId": "103745",
      "name": "NoQuestRim v002",
      "version": "v0.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1221",
      "fileName": "NoQuestRim v002-27928-v0-02.rar",
      "uploadedUnix": "1354933709",
      "modVersion": "v0.02",
      "virusScanUrl": "https://www.virustotal.com/file/9d69acc6f31a9e34f83724592735b8afddfae3b5a400a0d0138912e6efc9ba89/analysis/1407294488/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NoQuestRim%20v002-27928-v0-02.rar?fid=103745&ttl=1535800961&ri=8192&rs=8192&setec=dbe2a49a740a7a2da2273d84a9864366"
    }
  ]
}