{
  "modId": 27932.0,
  "modName": "Derkeethus Retex and Combat Enhancement",
  "summary": "Retexture of the Derkeethus Follower that is found in game. With also over 159 different ways to make derkeethus into what you would like him to be and while having his combat be more responsive. New Combat style versions as well including Light Armor, Heavy Armor and 2 New Dawnguard versions with a all in one NMM installer.",
  "descriptionHtml": "Author: Wolfk1n\r\nCurrent Version: 1.9\r\n\r\n--> Introduction:\r\nAfter playing skyrim for alittle and finally getting what seems to be the only vanilla Argonian Follower in skyrim. The way he looked and his combat AI seemed alittle bleh, for after what you have to go through to find him at level 5 lol. So i looked around for some enhancements on him but didn\\'t find any i liked so i figured to fix um myself and this is what i came up with =D.\r\n\r\n--> Update Notes version 1.9:\r\nFor this update instead of comming out with another combat style i decided to take a look back at the combat styles that are already out there and did some further fixing to better improve them from what they were before and also added alot more different ways to pick and choose what you want Derkeethus to really be. Removed the Bullseye perk from all combat styles for reasons being when it would trigger on a enemy it would paralyze them yes but then with them being paralyzed Derkeethus would go through a period where he would miss every shot untill the enemy got back up and when the enemy he was shooting at would be the last one it could be alittle frustrating to watch him miss every shot. Made slight changes to all the combat styles as well to reflect more so on the players health and stamina as best as possible such as if a player would follower the guide on stat distribution, and with this being said the combat styles now have less health so that they are made more fragile so that know instead of them just rushing in and never losing so much health all the time, now they actually have to try harder to stay alive. Changed his default outfit to the #1 version of the mining clothes cause the other version he did have had the wrong retexture on the clothes he was wearing and considering this is a retex and combat of derkeethus and not a problem fixing mod like unofficial Skyrim patch i decided to just change the outfit rather than change a texture for a slight color change. Changed his Disposition from 0 to 35 as well considering when i looked at all the other follower npcs there disposition was 35 or higher so i decided to give him some too since it seemed he didn\\'t have any like all the others. Also changed Derkeethus from being Essential till marriage by editting DarkwatercrossingDerkeethusquest and deselecting the option for him to be essential. Changed the Hunting Bow and Iron Arrow fix by editting the DialogueFollower Quest instead of setting the FollowerHuntingBow and FollowerIronArrow to playable. Added a New Dawnguard Edition for all the combat styles so know they use some of the spells that come from dawnguard and just so everyone that don\\'t know or is new to modding, if you don\\'t have dawnguard you can\\'t have the dawnguard version of these combat styles if you do try and play the game with them the game will crash on start up. Also for even more diversity i added a heavy armor version of the combat styles along with a non retexture version as well for thoughs of you that would like to add your on retextures instead of having mine but would like the combat style enhancement instead. Changed the Night Blade combat style majorly and before i even say any more i\\'m sorry about the poor release on him i must of been tired or out of it that night but no worrys did major fix\\'s to all his perks and leveling up balancing so know he\\'s just not thrown together anymore and just had perks thrown on him that did nothing at all for him. Finally i added a New all in one installer for the NMM so it will make it so much easier for thoughs downloading this mod to better choose what they want him to be in a personal client so there\\'s no more clutter on the files screen with there being 4 different all in one versions to choose from, Also with this new update without blowing up the mod there\\'s a total of about 159 different ways now that you can haver derkeethus with there lots more to come when the dragonborn DLC comes out. These fix\\'s for the current combat styles are final i won\\'t be looking back at them only looking to add to them if anyone has any problems with the versions please let me know and plz tell me what retex and combat version your using cause with having over 159 different .esp\\'s it\\'ll take alittle for me to go through them all so for quicker fix\\'s please be as specific as possible and also if anyone wants to make a video of all the combat styles with what they do and act please just let me know i\\'ll be more than will to help ya out, like i said before though i lack the proper stuff to make my own vids so any help in this section is well appreciated and thats it for the updates. For the steam users as you can see there\\'s alot of different retex\\'s for this guy if you would like one of the retextures put up on Steam please just ask for i will not be putting anymore combat styles up on steam without a request except for the new versions that will be coming out. I hope you all enjoy the new update and keep a eye out for the other combat styles they\\'ll be added in the next few days for version 1.9.5\r\n\r\n--> Description:\r\nBefore i get started on what these combat styles are like i\\'d just like everyone to know that all testing has been done in Master Difficulty and the perks version has been implemented mainly for the use of the follower in the Master Difficulty setting. it has also, always bothered me as to why the followers never leveled up in perks like some of the other npcs, and why they didn\\'t fight more like there part of a 2 or ( please add number ) person team. These Combat Styles are tested against large scale and small scale situations to see how well he does, not only on his own but if thier able to handle themselves so you can worry more on yourself in combat and not on them. Each individual combat style is unique in its own way for the AI tweaks and styles are made so they are more befitting of there class / build rather than just, ok i make 2 hander dominite and thats it...no, believe me when i say this i\\'ve spent many hours on my days off so far testing these things in back to back simulations making sure that every part of there combat was as perfect as i can get it, if not better. These combat styles not only hide to protect themselves from ranged hazards on the combat field, they also fight like thier said classes would be imagined to work like instead of them just being a form of a distraction to take some of the heat off. There\\'s really so much i can explain as to what was changed and how these combat styles are now acting like, i wish i could make a video to show them but currently atm i cannot for i lack the proper stuff to do so sadly. A more detailed overlook of the classes and thier stats are in the readme\\'s of the combat styles thats put inside the data folder automatically if using NMM install and are in each folder if using Manual installation.\r\n\r\n--> Soon to come:\r\nWitch Doctor\r\n\r\n--> Side note:\r\nPlease remember a clean install is needed for these changes to take affect, don\\'t wanna see fellow modders out there running into probs. =D\r\n\r\n--> NMM Installation:\r\nJust push the green NMM install button and the mod will be installed or you can manually install it which will work either way =D.\r\n\r\n--> Manual Installation:\r\nPush download manually link. Unzip the folder and follow the readme instructions\r\n\r\n--> Lastest Versions:\r\nVersion 1.0 ( release version )\r\nVersion 1.1 Fixed Hunting bow prob ( thank you Eddiember ), invisable arrows prob, and added armor for him that you see in the pic\\'s\r\nVersion 1.2 Fixed the head textures and mesh\\'s to match up with body textures\r\nVersion 1.3 added default outfit, final texture and mesh adjustment, added perks to his fighting style.\r\nVersion 1.4 Added a increase in the fighting style, readme.txt, all in one manual installation, and new combat style\r\nVersion 1.5 Added some new perks and took some away, added spells, and tweaked combat performance, editted readme.txt as well, follower attributes and lvl up balanced\r\nVersion 1.6 Fixed spelling errors in readme.txt, tweaked combat performance ( Final Version ), Included in readme.txt of what files were changed, Added Barbarian Combat Style\r\nVersion 1.7 Fixed lvling up prob with 2 Hander build of derkeethus, Fixed 2hander readme.txt spelling errors, Added Hunter build, Final Combat AI update for all versions, Added missing perk to Dual Wield style, Added missing perk to Warrior style\r\nVersion 1.8 Added Night Blade Combat Style and War Monk Fighting Style\r\nVersion 1.9 Changed Hunting Bow and Iron Arrow fix, added all in one NMM installer, fixed all combat styles with perk placement and leveling up balancing, added a new heavy armor version, added Dawnguard versions, and changed default outfit\r\n\r\n--> Other Versions of Derkeethus\\'s Retex & Combat Enhancement:\r\nJust a heads up to everyone downloading the different versions. Only 1 can be active at a time, you can have them all downloaded at the same time just not active or there will be clashing until i can figure out how to make a official All in one install. sorry if this causes any inconvenience. Also to check which mods you have active can be done in the Data Files section when you go to enter skyrim. ( thank you gggg336 )\r\n\r\nSteam - Derkeethus Retex & Combat - All in one - Mod Collection v1.9 ( with & without perks ) \r\nhttp://steamcommunity.com/workshop/filedetails/?id=115382704\r\n\r\nSteam - DRC Light Armored Warrior v1.9 ( with perks ) -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=115339152\r\n\r\nSteam - DRC Light Armored Warrior v1.9 ( without perks ) -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=115346138\r\n\r\nSteam - DRC Light Armored Assassin v1.9 ( with perks ) -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=115380495\r\n\r\nSteam - DRC Light Armored Assassin v1.9 ( without perks ) -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=115384695\r\n\r\nSteam - DRC Light Armored Barbarian v1.9 ( with perks ) -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=115429571\r\n\r\nSteam - DRC Light Armored Barbarian v1.9 ( without perks ) -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=115434281\r\n\r\nSteam - DRC War Monk v1.9 ( with perks ) -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=116690320\r\n\r\nSteam - DRC War Monk v1.9 ( without perks ) -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=116692062\r\n\r\nSteam - Derkeethus Retex Only v1.9 -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=115352576\r\n\r\nSteam - DRC Light Armored Lightning Night Blade v1.9 ( with perks ) -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=116694899\r\n\r\nSteam - DRC Light Armored Hunter v1.9 ( with perks ) -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=116117763\r\n\r\nSteam - DRC Light Armored Hunter v1.9 ( without perks ) -\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=116120136\r\n\r\n--> Author Rights:\r\n\r\nThis mod can\\'t be used / published without my permission.\r\n\r\nIf you want to make an add-on relating to or using this mod, please let me know.",
  "categoryId": "66",
  "version": "1.9",
  "author": "Wolfk1n",
  "createdUnix": "1354895437",
  "updatedUnix": "1357850433",
  "containsAdultContent": false,
  "uploadedBy": "Wolfk1n",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001461",
      "name": "Derkeethus - All in one - Light Armor v1_9",
      "version": "1.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7366",
      "fileName": "Derkeethus - All in one - Light Armor v1_9-27932-1-9.zip",
      "uploadedUnix": "1357849252",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/ddbf816f0ba3d2ce74257105680832d0766dbdd2c12b4d316ae6bc09a66fab7b/analysis/1407346919/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Derkeethus%20-%20All%20in%20one%20-%20Light%20Armor%20v1_9-27932-1-9.zip?fid=1000001461&ttl=1535800966&ri=8192&rs=8192&setec=16e29b8ef275f9cb4aa6f6d70307961e"
    },
    {
      "fileId": "1000001465",
      "name": "Derkeethus - All in one - Heavy Armor v1_9",
      "version": "1.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6591",
      "fileName": "Derkeethus - All in one - Heavy Armor v1_9-27932-1-9.zip",
      "uploadedUnix": "1357849907",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/30dab83dfc83d68c73f151dd48c5f1be0f88bcb310e5ed7af9e9f2abf858dfd5/analysis/1407346930/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Derkeethus%20-%20All%20in%20one%20-%20Heavy%20Armor%20v1_9-27932-1-9.zip?fid=1000001465&ttl=1535800967&ri=8192&rs=8192&setec=145e0914b0284c415a9beab88faf1c11"
    },
    {
      "fileId": "1000001467",
      "name": "Derkeethus - All in one - Light Armor Dawnguard Edition v1_9",
      "version": "1.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3499",
      "fileName": "Derkeethus - All in one - Light Armor Dawnguard Edition v1_9-27932-1-9.zip",
      "uploadedUnix": "1357850213",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/c76e7441d1d8fd26ad6c39172c63e6b0f0ad6b1252b4aa364c9e43df7ee87a83/analysis/1407346932/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Derkeethus%20-%20All%20in%20one%20-%20Light%20Armor%20Dawnguard%20Edition%20v1_9-27932-1-9.zip?fid=1000001467&ttl=1535800967&ri=8192&rs=8192&setec=45e2c1c9bc5030380774216b24c8b7da"
    },
    {
      "fileId": "1000001469",
      "name": "Derkeethus - All in one - Heavy Armor Dawnguard Edition v1_9",
      "version": "1.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3271",
      "fileName": "Derkeethus - All in one - Heavy Armor Dawnguard Edition v1_9-27932-1-9.zip",
      "uploadedUnix": "1357850433",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/3d6d6056b4fb15703e43208adad70b0e2b74c0ea27bddd20baed4c6d44593898/analysis/1407346938/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Derkeethus%20-%20All%20in%20one%20-%20Heavy%20Armor%20Dawnguard%20Edition%20v1_9-27932-1-9.zip?fid=1000001469&ttl=1535800967&ri=8192&rs=8192&setec=45b770a0b4b82d567fe5e3d3166a3c6e"
    }
  ]
}