{
  "modId": 27942.0,
  "modName": "Sellswords Mode - An Entirely New Game",
  "summary": "This adds an entirely new game mode for players who want a challenge.",
  "descriptionHtml": "Skyrim: Sellswords Mode\r\nby Alex Ducey\r\n\r\nThis mod creates an entirely new game mode that is wholly separate from the Skyrim campaign, and in no way\r\ninterferes with the Tamriel of Bethesda\\'s creation. This mode is meant to simulate Mercenaries mode from\r\nResident Evil, but knowledge of those games is not an advantage. It is not a huge expansive world, or a game on nearly the same scale as Skyrim itself. Think of it more as a really fun game you might find online, but with much better graphics and interface. (Thanks Bethesda!)\r\n\r\nThat\\'s not to say you won\\'t get hours of entertainment out of it. I\\'d expect you\\'ll get at least 10-15 hours of play, which is more than most mods boast.\r\n\r\nThis guide will be pretty long, so I had better make a table of contents, haven\\'t I?\r\n\r\n1. How it works: Getting Started and Understanding the Game Mechanics\r\n2. Items and skill/attribute buffs\r\n3. Enemies\r\n4. Acknowledgements \r\n5. Coming features\r\n\r\n\r\n1. HOW IT WORKS: GETTING STARTED AND UNDERSTANDING THE GAME MECHANICS:\r\n\r\nGetting started could not be simpler. Simply start a New Game from the Skyrim main menu.\r\nAfter a moment it will ask you whether you would like to play the vanilla Skyrim campaign\r\nor Sellswords mode. Choose sellswords and it will bring you to a small room with several doors\r\nand a Merchant. You will then choose your race and appearance.\r\nThe merchant we will discuss momentarily, for now you need only concern yourself with the chest\r\nimmediately to your front. That is where you will find your starting equipment.\r\nTake it and head through the DWEMER DOORS. The other doors are for later installments and will be\r\nmeant for high level characters.\r\n\r\nEnemies will now begin spawning. KILL THEM.\r\n\r\nWhen you do, you will begin to accrue a combo score. These combo scores are redeemable at the end of the stage\r\n(or when you die or run out of time) for Gold. Gold is used (shocker here) to buy things that will improve\r\nyour character from the Merchant.\r\nCombo scores rack up for 15 seconds following the last time you killed someone (as in, every time you get a kill\r\nthe timer resets and you now have fifteen seconds once again to kill another enemy). Every kill improves your multiplier\r\nby an addition of .10. Therefore if you kill twenty enemies worth ten points each you will have earned\r\n(10 * 20) * (1 + (20 * .10)), or 600 points.\r\nYou will also get 1/20 of your combo score in additional time. The time limit begins at five minutes, but by consistently\r\ngetting good combos you could keep going for a full twenty or so. This is (not) coincidentally about the amount of time\r\nthe level takes.\r\n\r\nThat is the gist of the core mechanics. Onwards to items.\\\\\r\n\r\nOH! Almost forgot. Forget about levelling up or gaining experience. If you want to be better, you have to buy\r\nthe improvements from the Merchant. (Also, no Magicka for you. This is Sellswords, not Spellswords.)\r\n2. ITEMS: DUDE, GREEN HERBS ARE GOOD FOR YOU\r\n\r\nThere\\'s a lot of information here, so feel free to skip and instead read the item descriptions in-game \r\nor just explore for yourself.\r\n\r\n2a) Bows\r\nBows are the primary weapon of the Sellsword. They come in five tiers, and two types. There are light bows, which fire \r\nvery quickly, and Heavy bows, which are more powerful. For example you will start with a Long Bow (light) and \r\nHunting Bow (heavy). Choose whichever suits your playstyle. Some enemies will be easier with one, others with the other.\r\n\r\n2b) Daggers\r\nDaggers are quite powerful, but obviously one needs to be right on top of an enemy to use them. \r\nPower attacking has a knockback effect. That\\'s about all you need know.\r\n\r\n2c) Arrows\r\nFor now there are only standard arrows, but more types will be added in later versions. (Maybe)\r\n\r\n2d) Grenades\r\nThey come in two flavors. Incendiary and flashbang/stun. The effects of which are as intuitive as they are \r\ndevastating. There seems to be some issue with their explosive radii. I\\'m looking into it.\r\n\r\n2e)Armors and Shields\r\nHere\\'s a tricky one. Armor no longer gives you armor rating, oddly enough. Instead, they grant a % chance\r\nto avoid a hit entirely, but in no way lessen damage received if you are hit. There are five tiers of armor, \r\nbeginning with a 10% chance of avoiding damage and ending at a full 50%.\r\nShields work in much the same manner, but only work while blocking. They begin with a 25% chance and end with 50%\r\n(Obviously, having the best of both armor and shield would be quite nice.)\r\n\r\n2f) Skills and Attributes\r\nThere are books which will improve your skills to a given level. Now, while in vanilla skyrim the difference in damage\r\nbetween a bow fired from someone with 50 Marksman and 100 was about 6%. In this it is a full 100%. Therefore buying\r\nthe tome for Marksman 100 makes your bows pack twice the punch. Handy.\r\nHealth and stamina may also be purchased up to a total of 300 additional of a given attribute.\r\n\r\n2g) Boots and Gloves\r\nGloves improve your dagger or bow skill, in increments of 10%.\r\nBoots can improve your stamina (allowing for more knockback power attacks) or your movement speed (in increments of 3%).\r\nThere are five tiers of each.\r\n\r\n2h) Nirnroots\r\nNirnroots serve as potions. A Green Nirnroot will heal you 10 pts. A red nirnroot will not heal you at all, but eating\r\ngreen nirnroots soon after a red will heal you 60 pts.\r\n\r\n3) Enemies:\r\n\r\nI Draugr\r\nHP: 20\r\nDamage: 10 (30 with Hammer)\r\n\r\nNotes: Draugr spawn with hammers 25% of the time. Those with hammers are 35% slower.\r\nII Black Dogs\r\nHP: 6\r\nDamage: 15\r\n\r\nNotes: While fast, dogs low health means that even the weakest of bows need not be fully drawn to kill them.\r\n\r\nIII Falmer\r\nHP: 50\r\nDamage: 20 with bow, 25 with sword\r\n\r\nIV Chaurus\r\nHP: 100\r\nDamage: 30 with any attack\r\n\r\nV Sphere Centurions\r\nHP 150:\r\nDamage: 40\r\n\r\nVI Steam Centurions\r\nHP: 200\r\nDamage: 50\r\n\r\nVII Boss - The Great and Terrible\r\nLet you find out for yourselves. Suffice it to say, you\\'ve never fought anything like it in Skyrim.\r\n\r\n4. Acknowledgements\r\n\r\nThe only one I can think of at the moment is Verteiron, who helped considerably building the final boss.\r\nWhile I cannot add people to the list who donate (against site rules) know that I deeply appreciate it.\r\nNot only does it make my work feel important, I am trying to go back to school for game design\r\nand every penny helps enormously. If everyone donated just 1 dollar I could have my tuition very\r\nquickly.\r\n\r\n5. Coming features:\r\n\r\nHelms - Detect Life and Improve Bow Zoom\r\nPerks - Thinks like Eagle Eye, Shield Runner, etc.\r\nShouts - More of them\r\nNew levels\r\nNew enemies\r\nNew bosses\r\nNew grenades (maybe)\r\netc.\r\n\r\nKnown Issues and Incompatibilities:\r\nThe nature of Arthmoor\\'s Live Another Life makes it totally incompatible with this mod. Luckily, as the only reason to use his mod is to play a normal game of Skyrim, and the only reason to use mine is not, you should never feel the need to have both of them ticked in your load order simultaneously.",
  "categoryId": "79",
  "version": "v1.0",
  "author": "Alex Ducey",
  "createdUnix": "1354916370",
  "updatedUnix": "1354926054",
  "containsAdultContent": false,
  "uploadedBy": "atducey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103714",
      "name": "SellSwords v1",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "252",
      "fileName": "SellSwords v1-27942-v1-0.zip",
      "uploadedUnix": "1354926054",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b7f0e992cc76640273cb8cf96013c95f24146f29c8732c40893b98fe86cfeb2a/analysis/1407294305/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SellSwords%20v1-27942-v1-0.zip?fid=103714&ttl=1535800981&ri=8192&rs=8192&setec=6ea700d5b30abbe3d03a74035d5e8068"
    }
  ]
}