{
  "modId": 27960.0,
  "modName": "Blackout - Simply Darker Dungeons",
  "summary": "ENB user? Ever notice that some dungeons and caves are way too bright, even at night? Blackout might just be the cure.",
  "descriptionHtml": "ENB user? Ever notice that some dungeons and caves are way too bright, even at night? I sure did. This mod was built to accompany [url=http://skyrim.nexusmods.com/mods/23029/]my ENB configuration[/url], but might be useful for anyone else who\\'s found themselves dealing with overly bright, overexposed dungeons and caves. It\\'s a simple, lightweight alternative or complement to the other \\\"darker dungeons\\\" mods on the Nexus.\r\n\r\n[b]1.0 What does this mod do?[/b]\r\n\r\n[url=http://farm9.staticflickr.com/8206/8254261122_acfc238fd2_o.jpg][img]http://farm9.staticflickr.com/8206/8254261122_aa632a1754_z.jpg[/img][/url]\r\n\r\n[b]1.1 Care to elaborate?[/b]\r\nOK, the mod  simply changes one flag in the cell description of certain interior locations: it unchecks the \\\"show sky\\\" flag. This allows the interior to be rendered using the correct interior lighting settings of the ENB instead of potentially being rendered with daytime settings. It doesn\\'t actually modify any light or lighting templates at all - just that one flag. \r\n\r\nAs of version 2.0 it also affects larger \\\"world Space\\\" interiors such as the Eldergleam Sanctuary, Labyrinthian Chasm, Shadowgreen Cave, Broken Oar Grotto, etc.\r\n\r\n[b]1.1.1 Wha?[/b] \r\nWhen I was working on my ENB configuration [url=http://skyrim.nexusmods.com/mods/23029/](The Goddess)[/url], I knew that I wanted my nights and interiors to be dark and moodily lit - and for the most part they were. There were some locations though, where no matter what I did they were still way too bright. I tried some of the different \\\"darker dungeons\\\" style mods here on the Nexus, and they all either did  too little, leaving those pesky caves and dungeons looking over-exposed, or they did too much, removing too many lights and spoiling the ambiance of many locations. \r\n\r\nSo when I started putting together the newest version of the configuration I figured I\\'d take a swing at solving that problem once and for all. I did some dungeon hopping and made note of which locations displayed the overly-bright lighting conditions, and eventually a pattern emerged, one thing that they all had in common: openings to the outside that showed sky. Choosing one location as a test, I opened up the CK and looked at that cell record, found the \\\"show sky\\\" flag, and disabled it. Popped back in the game and voila: that location was now perfectly lit.\r\n\r\nI\\'d always assumed that Interiors would use the \\\"Interior\\\" lighting settings in the ENB configuration files. Seemed logical, right? But what was happening in those locations with the \\\"show sky\\\" flag set was that the day/night detector settings in the ENB config were being tricked into using my daytime settings instead, and the level ended up looking overly bright, washed out and over-exposed. Disabling that flag allows the ENB configuration to render the interior using the interior settings, as it should have all along. \r\n\r\nAnd yes, I did try just adjusting the detector settings in the ENB config, but any setting that would cause e.g. Graywinter Watch to render using my night or interior setting also caused my daytime exteriors to be rendered using my nighttime settings. Not ideal.\r\n\r\n[b]2.0 Installation[/b]\r\nThere are two plugins: Blackout_Skyrim and Blackout_Dawnguard. The former modifies all vanilla Skyrim locations while the latter makes the correction to Dawnguard locations - so if you want both vanilla and Dawnguard locations to be covered you\\'ll need both plugins. I recommend installing using the Nexus Mod Manager or Skyrim Mod Organizer for convenience sake, otherwise just drop the ESP(s) in your data folder and enable in the launcher.\r\n\r\n[b]3.0 Compatibility and side effects[/b]\r\nSince the mods don\\'t change any lights or lighting templates they shouldn\\'t truly conflict with anything. The only conflict in my very busy data folder is with the Director\\'s Tools Fog Unlocker, which just sets different color values for the fog in some locations. I suggest you set the Blackout plugins high in your load order so that any other mods that also edit these locations (like Relighting Skyrim) don\\'t override them.\r\n\r\nI would not suggest using this mod along with Creepy Dungeons. Creepy Dungeons does an amazing job of making dungeons genuinely dark (and creepy), but in conjunction with this mod it might be a little too dark down there.\r\n\r\nBlackout was intended for use with The Goddess ENB configuration, but should work with any ENB configuration.  Given how it works, it\\'s somewhat dependent on the ENB settings, especially the Detector settings and the various settings that effect lighting. Basically, if you find that there are many interior locations that look a lot brighter than they should, odds are that this will fix them. If all of your dungeons already look dark, you don\\'t need it and it might make them even darker. It probably won\\'t have any effect if you don\\'t use any ENB.\r\n\r\nThe only side effect that I\\'ve seen is that you will no longer see the sky, clouds and stars when you look out through those little skylights in caves, or the holes in the walls of Bleak Falls Barrows. I have a before and after shot of that location in particular as it\\'s the worst-case scenario as far as a missing skybox goes. Worth noting that the two BFB shots were taken at around midnight - that\\'s one bright moonbeam I guess. I\\'ve omitted those areas where the loss of the sky seemed like it would be excessively obtrusive, or where the lighting was already decent.",
  "categoryId": "62",
  "version": "2.0",
  "author": "Anaphiel",
  "createdUnix": "1354937792",
  "updatedUnix": "1355710699",
  "containsAdultContent": false,
  "uploadedBy": "anaphiel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103758",
      "name": "Blackout - Simply Darker Dungeons Skyrim",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Blackout - Simply Darker Dungeons Skyrim-27960-1-0.7z",
      "uploadedUnix": "1354937932",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a77b9505d5c6bdba42f4df457fbb1a82916e29587246c092143be4da557b581f/analysis/1407294605/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blackout%20-%20Simply%20Darker%20Dungeons%20Skyrim-27960-1-0.7z?fid=103758&ttl=1535801011&ri=8192&rs=8192&setec=5f7d7e10cb8b022f8847f72a53a35c45"
    },
    {
      "fileId": "103759",
      "name": "Blackout - Simply Darker Dungeons Dawnguard",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Blackout - Simply Darker Dungeons Dawnguard-27960-1-0.7z",
      "uploadedUnix": "1354937998",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/059cf1479938ad6573235f45f80e6633b221d1de6386ca69e523828df4f8898f/analysis/1407294605/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blackout%20-%20Simply%20Darker%20Dungeons%20Dawnguard-27960-1-0.7z?fid=103759&ttl=1535801012&ri=8192&rs=8192&setec=43ddba738bfd67a2f982551e466bf20e"
    },
    {
      "fileId": "105668",
      "name": "Blackout - Simply Darker Dungeons Skyrim",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Blackout - Simply Darker Dungeons Skyrim-27960-2-0.7z",
      "uploadedUnix": "1355710634",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/6e6b3b61cc6d3fb4e31ddd85310b7587a484a4627fd1c17e8d1bbbaa6a12d15d/analysis/1407308163/",
      "changelogHtml": " Added all \"interior\" World Space locations <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blackout%20-%20Simply%20Darker%20Dungeons%20Skyrim-27960-2-0.7z?fid=105668&ttl=1535801012&ri=8192&rs=8192&setec=5e7b213d3d6b1736f106dd0220c813df"
    },
    {
      "fileId": "105669",
      "name": "Blackout - Simply Darker Dungeons Dawnguard",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Blackout - Simply Darker Dungeons Dawnguard-27960-2-0.7z",
      "uploadedUnix": "1355710699",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/13198e741b404b1598db5e9e5bd7fe51d208b4e4e582b4caba03e25c350c216d/analysis/1407308163/",
      "changelogHtml": " Added all \"interior\" World Space locations <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blackout%20-%20Simply%20Darker%20Dungeons%20Dawnguard-27960-2-0.7z?fid=105669&ttl=1535801012&ri=8192&rs=8192&setec=798ffaaaf54117313dd36d0f63b63a2c"
    }
  ]
}