{
  "modId": 27963.0,
  "modName": "Most shouts",
  "summary": "Just a simple Bat file that will add most of the shouts without breaking your game. I would also appreciate if someone could get this to work on consoles as well. I have the game for PS4 and Xbox One but for some reason, I cannot use the creation kit when using Bethesda launcher. I also left Soul Tear and Drain Vitality locked just to be safe. Howe",
  "descriptionHtml": "Just drop the Bat file in your Skyrim data folder load up a game and press the tilde key and type Bat shouts and they will be there for you to enjoy. I left out the shouts that are quest related so you will not break your game or duplicate dev related shouts when loading the bat file. Soul Tear and Drain Vitality is unlocked but not learned just in case. However, for me it works great when adding dragon souls but just to be safe I left them unlearned but if you want them just use the console or slay a few dragons to get the souls to unlock them. Also, If someone could port the mod over to consoles that would be great too. I cannot get the creation kit to work for me. ",
  "categoryId": "40",
  "version": "1.0",
  "author": "MatthewAR2012",
  "createdUnix": "1354941168",
  "updatedUnix": "1502520758",
  "containsAdultContent": false,
  "uploadedBy": "MatthewAR2012",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000251667",
      "name": "shouts BAT file",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "shouts BAT file-27963-1-0.zip",
      "uploadedUnix": "1502520758",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3e3e41a6c9ccc0a130073ebed3531669b5290c53f83ab0e1ad2394aa2e903c1f/analysis/1502520902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/shouts%20BAT%20file-27963-1-0.zip?fid=1000251667&ttl=1535801016&ri=8192&rs=8192&setec=c1ff9e28f3dd3f0e3fc9000a6e223d0d"
    }
  ]
}