{
  "modId": 27979.0,
  "modName": "Balanced Magic - Updated",
  "summary": "Updates [url=2275]Balanced Magic by mysty[/url] to be compatible with the newest version of Skyrim. Remade from the ground up to fix structural errors inherent in the original mod.\r\n\r\nFrom the original mod: \\\"Magic system overhaul - Spells become more powerful as your skill increases. Changed how mage armor and wards work. New spells. Better magick",
  "descriptionHtml": "[b][u][size=4]Description:[/size][/u][/b]\r\nUpdates Balanced Magic by mysty to be compatible with the newest version of Skyrim. Remade from the ground up to fix structural errors inherent in the original mod.\r\n\r\n[b][u][size=4]Installation:[/size][/u][/b]\r\n[color=#FF0000]Manual Only![/color]\r\n[b][u][size=2]Step 1:[/size][/u][/b]\r\nMerged:\r\nExtract one of the plugins from the \\\\Merged\\\\ folder of the download and place it in your \\\\Skyrim\\\\Data\\\\ directory.\r\n\r\nModular:\r\nExtract whichever plugins you desire to run from the \\\\Modular\\\\ folder of the download and place them in the \\\\Skyrim\\\\Data\\\\ directory.\r\n\r\n[color=#FFFF00]Only run [b][u]one[/u][/b] difficulty plugin. (included in the Merged versions)[/color]\r\n\r\nNovice - 75% combat magicka regen, 3x dual cast damage, 2.2x dual cast cost, -55% spell cost at skill level 100\r\nAdept.esp - 60% combat magicka regen, 2.6x dual cast damage, 2.4x dual cast cost, -51% spell cost at skill level 100\r\nMaster.esp - 45% combat magicka regen, 2.2x dual cast damage, 2.6x dual cast cost, -46% spell cost at skill level 100\r\nVanilla Settings (for comparison) - 33% combat regen, 2.2x dual cast damage, 2.8x dual cast cost, -40% spell cost at skill level 100\r\n\r\n[b][u][size=2]Step 2:[/size][/u][/b]\r\nActivate your plugin(s) via a Mod Manager of your choice\r\n\r\n[b][u][size=4]Purpose:[/size][/u][/b]\r\nThis mod is intended to make pure mages a force to be reckoned with in battle. While melee fighters get increased damage as they improve their primary offensive skill, mages simply get reduced casting cost. When you consider the options to improve weapons via smithing, enchanting, and poisons - heavily armored warriors are far outclassing squishy mages in damage. Dual wielding melee fighters with power attacks and rogues with sneak attacks have a major offensive advantage. Additionally, pure mages must use their magicka for both offensive and defensive skills, meaning that many of the master level spells can be prohibitively expensive without enchanting all gear for reduced magicka cost. Since pure mages don\\'t have enchantable weapons, there is less gear to enchant, and I believe the player should be able to diversify their enchantments without losing the ability to deal reasonable high end damage.\r\n\r\nThis mod attempts to address these issues without making Mages overpowered; magical damage already ignores armor, and offers area of effect damage, and damage over time that stacks with other damage - even at maximum level, the best spells should not necessarily do as much damage as well smithed, enchanted, and poisoned weapons would. If you want to be incredibly overpowered, this may not be the mod for you!\r\n\r\n[b][u][size=4]Credits:[/size][/u][/b]\r\nmysty for creating the original mod.\r\nSharlikan and Zilav for their work on TES5Edit.\r\nMessyMetty for his save.",
  "categoryId": "93",
  "version": "1.31",
  "author": "mysty",
  "createdUnix": "1354982440",
  "updatedUnix": "1354982646",
  "containsAdultContent": false,
  "uploadedBy": "MShoap13",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103872",
      "name": "Balanced Magic v1_31",
      "version": "1.31",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Balanced Magic v1_31-27979-1-31.7z",
      "uploadedUnix": "1354982646",
      "modVersion": "1.31",
      "virusScanUrl": "https://www.virustotal.com/file/6d1594b1668f8ede795ee968e881e5301edf5f39ecbe1484b54d32a441ea2848/analysis/1407295213/",
      "changelogHtml": " Initial Release; Manually rebuilt all plugins from the ground up to get rid of structural issues; cleaned ITM records. <br/> \n Fixed multiple issues with missing or improper data in all plugins. <br/> \n Fixed an issue with Dragonhide not displaying a value in it&#39;s description. <br/> \n Fixed an issue with Dragonhide not using it&#39;s original visual effects when cast. <br/> \n Added Merged plugins. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balanced%20Magic%20v1_31-27979-1-31.7z?fid=103872&ttl=1535801035&ri=8192&rs=8192&setec=2a1a0e80c9318ac52381bf364e95cb6c"
    }
  ]
}