{
  "modId": 2800.0,
  "modName": "Archetypes- Elghinn_The Dunmer Necromancer",
  "summary": "Elghinn, The Tormented\r\nIncluding level 1 and 5 saves.  The level 5 option includes many \\\"flavor\\\" items, completely balanced and appropriate for the level.  A great starter character, enjoy.",
  "descriptionHtml": "Elghinn, The Tormented\r\nIncluding level 1 and 5 saves.  The level 5 option includes many \\\"flavor\\\" items, completely balanced and appropriate for the level.  A great starter character, enjoy.\r\n\r\nIf you like this save, try my others.  Just type \\\"Archetypes\\\" in the search field. \r\n\r\nPlease leave a comment and/or endorse.  If you have requests, I\\'d love to hear them.  Also, tell me your preferences for level ranges.  I personally like 1-10, maybe 15, since it gives a good starting feel without ruining the level-up/build experience.\r\n\r\n------------------------------------------------------------------------------------------------------------------------------\r\nBackground- \r\n\r\n\r\n...an excerpt from some blood-scrawled journal:\r\n\r\nI was stricken in my sleep:  Huddled on my pitiful pallet atop frozen soil, exposed to the night sky. I jerked upright with terror and then breathed deep, attempting to quell my fear.\r\n\r\nJust a nightmare, just a dream.\r\n\r\nBut no sooner did I bend my back to the cold ground, a vision appeared before me-- set vivid against the scattered stars.  It was the face of some ancient ancestor, contorted in what seemed to be a mixture of anger and pain.  My heart thrummed rapidly as I summoned the courage to speak.  Yet I made no sound.\r\n\r\nInstead, the spirit spoke through me... his otherworldy lips stood still, while mine, pale and trembling, uttered his words, \\\"You are of house Indoril, yet you wallow in the countryside like some mongrel man-beast.  All the while; your ancestors toil in pain.\\\"\r\n\r\nI tried to regain my voice but it was no use, and he continued, \\\"Necrom is twice buried in ash, once from the Red Mountain, and again at the sacking of our tombs.\\\"\r\n\r\nAnd then my sight was washed in vision.  The Skyrim night was transformed into a mirage of Morrowind.  I saw, first, the marauding Argonians.  I then saw bands of looters picking through the mausoleums.  I saw sorcerers raising the dead-- my own ancient clansmen animated as thralls, tormented by the ever-waking yoke of corporeal slavery... shambling, helplessly, behind their new masters.  \r\n\r\nIt was then that my sight returned, clouded by tears.  I knew this price.  I knew it when I fled all those years ago.  Yet more than a century had passed and I had done naught but run.  I ran from the disaster.  I ran from my houses downfall, and now I run from my own prosperity, choosing instead to live as a vagabond, exposed to the cold northern clime.  Yes, I knew this price, but I had never seen it.\r\n\r\n\\\"NO MORE!\\\" I yelled in my own voice.  And the spirit returned.\r\n\r\n\\\"Yeeeesss\\\" his words slithered from me.  \\\"They deserve no mercy, no justice.  Even their dead... especially their dead, should be made to suffer as we have.\\\"\r\n\r\nAt that moment I was enveloped in what seemed to be an invisible fire.  My skin felt as though it would melt, but as I scratched away my ragged clothes, I found no flame.\r\n\r\nHis laugh, through me, was maniacal, \\\"And YOU shall suffer as we have.  The covenant between living and dead as been broken!\\\" Again I could not speak with my own voice.  He continued, \\\"You shall know no joy, shall feel no contentment until the toll has been repaid:  A host of mortal souls consumed and before our eyes arrayed.\\\" With these final words I felt his spirit leave me.\r\n\r\n------------------------------------------------------------------------------------------------------------------------------\r\nCharacter traits:\r\n\r\nElghinn is old even by the standards of mer.  Having seen all that he has seen, he has no love for the the Argonians.  He considers the lizardmen to be slaves in open revolt. In fact, it is a point of necessity that he make them suffer as he does.  Also, he has witnessed the prejudices of the Nords, as hypocritical as that may sound for a Dunmer.  For this reason, he will likely support the Empire in the rebellion.\r\n\r\nHe can often be found in Nordic tombs, desecrating their dead.  This is contrary to Dunmer tradition, but the world has changed.",
  "categoryId": "43",
  "version": "",
  "author": "Beld",
  "createdUnix": "1323139095",
  "updatedUnix": "1323139222",
  "containsAdultContent": false,
  "uploadedBy": "Beld",
  "primaryFile": null,
  "files": [
    {
      "fileId": "7480",
      "name": "Elghinn_Level 1",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1213",
      "fileName": "Elghinn_Level 1-2800-1.zip",
      "uploadedUnix": "1323139183",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/af65d5c84e29d8098402c26692c45019b482f3512ce3288e990f12737f090ec0/analysis/1406484604/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elghinn_Level%201-2800-1.zip?fid=7480&ttl=1535757298&ri=8192&rs=8192&setec=dac013d8328a1e58f9572103de1e0eae"
    },
    {
      "fileId": "7482",
      "name": "Elghinn_Level 5",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1427",
      "fileName": "Elghinn_Level 5-2800-1.zip",
      "uploadedUnix": "1323139222",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c389ff3ad205011c3911fa745f33510d77d450865ff143f764fde4b3fc995709/analysis/1406484612/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elghinn_Level%205-2800-1.zip?fid=7482&ttl=1535757298&ri=8192&rs=8192&setec=2623fa7abf869386097dde0d7936ccf8"
    }
  ]
}