{
  "modId": 28007.0,
  "modName": "Mage Swordsman",
  "summary": "Expert-level Restoration spell. Boosts one-handed damage output by 200% for two minutes.",
  "descriptionHtml": "[[url=https://www.nexusmods.com/skyrim/articles/51469]There will be no SE port of this mod. Read here for more information[/url]]\n<br />\n<br />MAGE SWORDSMAN\n<br />\n<br />Adds a spell and associated tome that temporarily increases one-handed damage output by 200%, as if you had maxed out the one-handed skill and taken all five Armsman perks. The spell is an Expert-level Restoration spell. The Expert Restoration perk reduces magicka requirements.\n<br />\n<br />The purpose of the spell is to let a mage character use a weapon skillfully for a short time, without the necessity of leveling up the skill first or spending perks on a little-used skill tree. This would be useful for filling empty soul gems with an enchanted weapon or allowing a stealthy mage to get in a decent sneak attack. A conjurer/necromancer character could combine this spell very effectively with Bound Sword.\n<br />\n<br />Can a non-mage warrior use the spell to make his one-handed attacks uberpowerful? Sure. If you want to do that, go ahead. But to cut down on the temptation, I've made it an expensive, magicka-hogging, expert-level spell that's only accessible near the end of the Winterhold College quest line, or by leveling the Restoration skill up to expert level.\n<br />\n<br />A spell tome will be located in Labyrinthian, on the same table as the Equlibrium spell tome, in the room with an Arcane Enchanter. Even if you have already completed that particular quest, the book will still be there on the table.\n<br />\n<br />It is also added to the expert Restoration spell tome lists, so Colette Marence at the College of Winterhold *should* sell it alongside other expert spells, but her vendor list has always been bugged me for me, so I didn't test this.\n<br />\n<br />The spell will be listed under Restoration as 'Mage Swordsman'. The spell tome is called 'Spell Tome: Mage Blade'.",
  "categoryId": "75",
  "version": "1.0",
  "author": "Rooker",
  "createdUnix": "1355018684",
  "updatedUnix": "1355018837",
  "containsAdultContent": false,
  "uploadedBy": "Rooker75",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103960",
      "name": "Mage Swordsman Main",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Mage Swordsman Main-28007-1-0.zip",
      "uploadedUnix": "1355018837",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/add30478283efc2392f443eab3e54f9d53c992fc583e1e2adc0f1bda07269930/analysis/1407295863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mage%20Swordsman%20Main-28007-1-0.zip?fid=103960&ttl=1535801082&ri=8192&rs=8192&setec=4ccbdfd87987824a5fe53fe7a5caac2b"
    }
  ]
}