{
  "modId": 28027.0,
  "modName": "WARR - Weapon and Armor Recipes Rebalanced",
  "summary": "Completely rebalances the recipe list of all vanilla weapons and armor.\r\nFor example, the Iron Shield clearly has a wooden frame yet doesn\\'t require wood to craft. Well it does now...",
  "descriptionHtml": "[color=red][center][b]WARR - Weapon and Armor Recipes Rebalanced[/b][/center][/color]\r\n[center]by acdcdave1387[/center]\r\n[center]Nexus exclusive, please let me know if you see my mods elsewhere[/center]\r\n[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/sSbds.png[/img][/url][/center]\r\n[color=yellow]\\\"Why? What do you mean by rebalance?\\\"[/color]\r\nWell, I noticed how some of the weapons have wooden handles as well as some shields having a wooden frame and yet no recipes in game require wood. It is almost pointless to chop firewood in the game, so why add woodcutting in the first place?\r\n\r\nThis mod changes ALL default recipes in game for crafting Armor and Weapons to make more sense \\\"realistically.\\\" The Ingots and Leather pieces are quite small so the Armors require a lot more materials to craft, however to balance that out, the smaller pieces (ie, Helmet and Boots etc) cost a lot less. Many armor pieces have animal furs in them. The proper pelts/hides will be required for those. To make it easier, all smaller armor pieces (boots, helmet and gauntlets/bracers) use either Fox pelts or Wolf Pelts. Only the armors themselves use larger pelts such as Elk hide/ Sabrecat pelts/bear pelts.\r\n\r\nAs for the weapons, the vast majority of weapons cost less materials to craft themselves, but some have a few strange additions because you need to craft the Sheathes as well. Everything is based on the vanilla Visual representation so that weapons with an obvious wooden handle will require wood, and a sword with a leather scabbard will require leather. This means that weapons without a scabbard/sheathe (ie, two handed weapons) are easier to craft than ever.\r\n\r\nI should note that for all Armors, the \\\"Visual Representaion\\\" used to configure \\\"realistic\\\" recipes was a Male Nord. Race shouldn\\'t matter, but for female player characters the recipes might not make as much sense...ESPECIALLY if you are using a skimpy armor replacer.\r\n\r\n~~Changelog~~\r\nv1.0 - All vanilla weapon and armor recipes rebalanced from the following categories (Hide, Leather, Iron, Steel and Imperial)\r\n[s]v1.01 - Temporarily removed the optional version (imperial allegiance)[/s]\r\nv1.02 - Put the fixed optional version back in. Imperial armor un-craftable until joining the legion\r\nv1.1 - Completed weapon and armor recipes for Dwarven and Elven (also fixed small issue with Optional version)\r\nv1.2 - Completed Orcish and Glass (added new optional file for easier ingot crafting)\r\nv1.3 - New Easyleather option, Completed Steelplate, Scaled, Dragonplate and Dragonscale\r\nAlso revamped all previous additions. Proper items now require the necessary Pelts to craft.\r\n[color=yellow]ps. There are two Deer Hides in the game, I changed the name of the one that comes from Elk to Elk Hide[/color]\r\nv1.4 - Completed Ebony and Daedric armor and weapon sets and the Ancient Nord armor set.\r\nAlso made small change to the Orcish boots recipe (I missed some Leather Strips on the backside of the Boots)\r\n\r\n~~Compatibility~~\r\nThis mod was made with the Creation Kit alone, and only changes vanilla recipes, so should be compatible with just about anything.\r\nAs for crafting overhauls, which I am sure many of you use, this should work with them because my mod only changes current recipes where most crafting mods add new recipes in.\r\n\r\nIf you\\'re not using a crafting overhaul mod then I recommend you check out my other mod [url=http://skyrim.nexusmods.com/mods/28040/]CIA - Craftable Imperial Armory[/url]. It adds all the missing Imperial armor and weapons as well as the Stormcloak gear depending on which side you choose in the civil war. If you want to use both of my mods, check your load order.\r\n[list]\r\n[*]WARR.esp\r\n[*]CIA.esp\r\n[/list]Always load CIA after WARR so that you get the proper effect\r\n\r\n~~Installing~~ (Manual Installers only need the Manual install Archive)\r\n(NMM installers need to download each option as an individual extra, sorry but I don\\'t know how to write a script for NMM)\r\nThis is a very simple plugin mod.\r\nOnly thing you need to do is drop the Data folder into your Skyrim folder.\r\nDefault location for Skyrim folder in a 64-bit installation is as follows.\r\nC:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\Skyrim\r\n\r\n~~Uninstalling~~\r\nSince this mod is so simple, you merely need to delete WARR.esp or uncheck it from your load order. (Same with all options)\r\n\r\n~~Optionals~~ (See the ReadMe in the optionals folder for more details.)\r\nThere is an optional [color=yellow]Imperial Allegiance version[/color] which replaces the main WARR.esp with a new one. This version makes the Imperial Heavy Armor require allegiance with the Imperial Legion as well as the Steel Smithing perk in order to be crafted. (not necessary if using my other mod - CIA)\r\n\r\nIf you have difficulty finding enough Corundum for steel smithing I have included an optional plugin which changes the Steel Ingot recipe so that it requires Charcoal instead of Corundum Ore. Charcoal can also be smelted from Firewood to ease the burden of finding Charcoal.\r\nThere are two kinds of Charcoal in the game, one is the regular Charcoal commonly used by mods for crafting recipes such as this mod, and the other is a lump Coal that was incorrectly named Charcoal by Bethesda. I renamed this version of Charcoal as \\\"Coal\\\" to ease the confusion.\r\n\r\nEasy Ingots is an option to turn each Ingot into a 1 to 1 ratio such as the Iron ingots. In other words, you only need 1 Ore to make 1 Ingot.\r\n\r\nEasy leather doubles leather from each pelt and also doubles strips from each piece of leather.\r\n\r\nSome of the recipes can be quite large and require a lot of resources, so you will not be crafting as many items as usual. To compensate for this you might want to gain [color=yellow]Smithing XP from Tanning Racks and Smelters[/color] by trying [url=http://skyrim.nexusmods.com/mods/24116]This mod[/url] from AnkhAscendant. If you would like to get Smithing XP as mentioned above AND also get Alchemy XP from Cooking then check out my other mod [url=http://skyrim.nexusmods.com/mods/28030]Cooking for Alchemy[/url] which does both in one .esp\r\n\r\n~~FINAL NOTES~~\r\nAll armor sets have been completed as well as ALL* weapon sets in the Vanilla game. Why an asterisk on All weapons? Well, I left out the recipes for the Nord Hero weapons as you are essentially \\\"upgrading\\\" the default Draugr weapons for stronger ones. I think that is a kind of cool idea but if anyone requests it, I will add in the Nord Hero weapons or perhaps make it an optional extra.\r\n\r\n~~Recipe List~~\r\nHide Armor - 5 Leather, 4 Leather Strips, 1 Iron Ingot, 1 Elk Hide and 1 Wolf Pelt\r\nStudded Armor - 7 Leather, 4 Leather Strips, 3 Iron Ingot, 1 Elk Hide and 1 Sabrecat Hide\r\nHide Boots - 2 Leather, 2 Leather Strips and 1 Fox Pelt\r\nHide Bracers - 1 Leather and 1 Iron Ingot\r\nHide Helmet - 1 Leather and 1 Iron Ingot\r\nHide Shield - 4 Leather, 1 Leather Strips and 2 Iron Ingot\r\n\r\nLeather Armor - 8 Leather, 7 Leather Strips, 2 Iron Ingot and 1 Wolf Pelt\r\nLeather Boots - 2 Leather, 2 Leather Strips, 1 Iron Ingot and 1 Wolf Pelt\r\nLeather Bracers - 1 Leather, 2 Leather Strips and 1 Wolf Pelt\r\nLeather Helmet - 1 Leather, 1 Leather Strips and 1 Iron Ingot\r\n\r\nIron Armor - 6 Leather, 4 Leather Strips, 6 Iron Ingot and 1 Elk hide\r\nBanded Iron Armor - 6 Leather, 6 Leather Strips, 8 Iron Ingot, 4 Corundum Ingot and 1 Elk Hide\r\nIron Boots - 2 Leather, 2 Leather Strips, 1 Iron Ingot and 1 Fox Pelt\r\nIron Gauntlets - 1 Leather, 2 Leather Strips, 1 Iron Ingot and 1 Fox Pelt\r\nIron Helmet - 1 Leather, 1 Iron Ingot and 1 Large Antlers\r\nIron Shield - 4 Iron Ingot and 3 Firewood\r\nBanded Iron Shield - 1 Leather Strips, 5 Iron Ingot and 3 Corundum Ingot\r\nIron Dagger - 1 Leather, 1 Leather Strips and 1 Iron Ingot\r\nIron Sword - 1 Leather and 2 Iron Ingot\r\nIron Greatsword - 1 Leather Strips and 3 Iron Ingot\r\nIron War Axe - 1 Leather, 1 Leather Strips, 1 Iron Ingot and 1 Firewood\r\nIron Battleaxe - 2 Leather Strips, 2 Iron Ingot and 2 Firewood\r\nIron Mace - 1 Leather Strips, 1 Iron Ingot and 1 Firewood\r\nIron Warhammer - 2 Iron Ingot and 2 Firewood\r\n\r\nImperial Armor - 5 Leather, 2 Leather Strips and 8 Steel Ingot\r\nImperial Boots - 2 Leather, 2 Leather Strips, 2 Steel Ingot and 1 Wolf Pelt\r\nImperial Bracers - (Remained Unchanged) 1 Leather, 2 Leather Strips and 2 Steel Ingot\r\nImperial Helmet - 1 Leather and 2 Steel Ingot\r\nImperial Shield - 1 Leather Strips, 6 Steel Ingot and 3 Firewood\r\n\r\n(Light) Steel Armor - 4 Leather, 4 Leather Strips, 8 Steel Ingot and 1 Elk Hide\r\n(Heavy) Steel Armor - 4 Leather, 4 Leather Strips, 10 Steel Ingot and 1 Elk Hide\r\nSteel Cuffed Boots - 2 Leather, 2 Leather Strips, 2 Steel Ingot and 1 Fox Pelt\r\nSteel Shin Boots - 2 Leather, 2 Leather Strips, 2 Steel Ingot and 1 Wolf Pelt\r\nSteel Nordic Gauntlets - 2 Leather, 2 Leather Strips, 2 Steel Ingot and 1 Fox Pelt\r\nSteel Imperial Gauntlets - 1 Leather, 2 Leather Strips and 2 Steel Ingot\r\nSteel Helmet - 2 Steel Ingot\r\nSteel Horned Helmet - 2 Steel Ingot and 1 Small Antlers\r\nSteel Shield - 1 Leather Strips, 5 Steel Ingot and 3 Firewood\r\nSteel Dagger - 1 Leather, 1 Leather Strips and 1 Steel Ingot\r\nSteel Sword - 1 Leather, 1 Leather Strips and 2 Steel Ingot\r\nSteel Greatsword - 1 Leather, 1 Leather Strips and 3 Steel Ingot\r\nSteel War Axe - 3 Leather Strips, 1 Steel Ingot and 1 Firewood\r\nSteel Battleaxe - 2 Leather Strips, 2 Steel Ingot and 2 Firewood\r\nSteel Mace - 2 Leather Strips, 1 Steel Ingot and 1 Firewood\r\nSteel Warhammer - 2 Leather Strips, 2 Steel Ingot and 2 Firewood\r\n\r\nDwarven Armor - 9 Leather, 1 Leather Strips and 12 Dwarven Metal Ingot\r\nDwarven Boots - 1 Leather and 3 Dwarven Metal Ingot\r\nDwarven Gauntlets - 1 Leather and 2 Dwarven Metal Ingot\r\nDwarven Helmet - 1 Leather and 3 Dwarven Metal Ingot\r\nDwarven Shield - 1 Leather Strips and 6 Dwarven Metal Ingot\r\nDwarven Dagger - 1 Leather Strips and 2 Dwarven Metal Ingot\r\nDwarven Sword - 1 Leather Strips and 4 Dwarven Metal Ingot\r\nDwarven Greatsword - 1 Leather Strips and 3 Dwarven Metal Ingot\r\nDwarven War Axe - 1 Firewood and 2 Dwarven Metal Ingot\r\nDwarven Battleaxe - 2 Firewood and 3 Dwarven Metal Ingot\r\nDwarven Mace - 1 Leather Strips, 1 Firewood and 2 Dwarven Metal Ingot\r\nDwarven Warhammer - 2 Firewood and 3 Dwarven Metal Ingot\r\nDwarven Bow - 1 Leather Strips, 1 Firewood and 2 Dwarven Metal Ingot\r\n\r\nElven Armor - 8 Leather, 5 Leather Strips and 8 Refined Moonstone\r\nElven Gilded Armor - 8 Leather, 5 Leather Strips, 8 Refined Moonstone and 4 Quicksilver Ingot\r\nElven Boots - 1 Leather and 3  Refined Moonstone\r\nElven Gauntlets - 1 Leather and 2 Refined Moonstone\r\nElven Helmet - 2 Refined Moonstone\r\nElven Shield - 1 Leather, 1 Leather Strips and 4 Refined Moonstone\r\nElven Dagger - 1 Leather, 1 Leather Strips, 1 Refined Moonstone and 1 Quicksilver Ingot\r\nElven Sword - 1 Leather, 1 Leather Strips, 2 Refined Moonstone and 1 Quicksilver Ingot\r\nElven Greatsword - 1 Leather Strips, 2 Refined Moonstone and 2 Quicksilver Ingot\r\nElven War Axe - 2 Leather Strips, 2 Refined Moonstone and 1 Quicksilver Ingot\r\nElven Battleaxe - 2 Leather Strips, 3 Refined Moonstone and 1 Quicksilver Ingot\r\nElven Mace - 2 Leather Strips, 2 Refined Moonstone and 1 Quicksilver Ingot\r\nElven Warhammer - 2 Leather Strips, 3 Refined Moonstone and 1 Quicksilver Ingot\r\nElven Bow - 2 Leather Strips and 2 Refined Moonstone\r\n\r\nOrcish Armor - 6 Leather, 4 Leather Strips, 8 Orichalcum Ingot, 1 Iron Ingot and 1 Wolf Pelt\r\nOrcish Boots - 2 Leather Strips, 3 Orichalcum Ingot and 1 Wolf Pelt\r\nOrcish Gauntlets - 1 Leather, 2 Leather Strips, 1 Orichalcum Ingot and 1 Wolf Pelt\r\nOrcish Helmet - 1 Leather, 1 Leather Strips and 2 Orichalcum Ingot\r\nOrcish Shield - 1 Leather and 5 Orichalcum Ingot\r\nOrcish Dagger - 1 Leather, 1 Leather Strips and 1 Orichalcum Ingot\r\nOrcish Sword - 2 Leather Strips and 3 Orichalcum Ingot\r\nOrcish Greatsword - 1 Leather Strips and 3 Orichalcum Ingot\r\nOrcish War Axe - 2 Leather Strips and 2 Orichalcum Ingot\r\nOrcish Battleaxe - 2 leather Strips, 2 Orichalcum Ingot and 2 Firewood\r\nOrcish Mace - 2 Leather Strips and 2 Orichalcum Ingot\r\nOrcish Warhammer - 2 Leather Strips, 2 Orichalcum Ingot and 2 Firewood\r\nOrcish Bow - 2 Leather Strips and 2 Orichalcum Ingot\r\n\r\nGlass Armor - 4 Leather, 2 Leather Strips, 3 Steel Ingot, 4 Refined Malachite and 6 Refined Moonstone\r\nGlass Boots - 1 Refined Malachite and 2 Refined Moonstone\r\nGlass Gauntlets - 1 Leather, 1 Refined Malachite and 2 Refined Moonstone\r\nGlass Helmet - 1 Refined Malachite and 1 Refined Moonstone\r\nGlass Shield - 5 Refined Malachite and 3 Refined Moonstone\r\nGlass Dagger - 1 Leather Strips, 1 Refined Malachite and 1 Refined Moonstone\r\nGlass Sword - 1 Leather Strips, 2 Refined Malachite and 1 Refined Moonstone\r\nGlass Greatsword - 2 Refined Malachite and 1 Refined Moonstone\r\nGlass War Axe - 1 Leather Strips, 2 Refined Malachite and 2 Refined Moonstone\r\nGlass Battleaxe - 2 Refined Malachite and 3 Refined Moonstone\r\nGlass Mace - 1 Leather Strips, 2 Refined Malachite and 2 Refined Moonstone\r\nGlass Warhammer - 1 Refined Malachite and 3 Refined Moonstone\r\nGlass Bow - 1 Leather Strips, 1 Refined Malachite and 2 Refined Moonstone\r\n\r\nScaled Armor - 7 Leather, 4 Leather Strips, 2 Steel Ingot, 1 Corundum Ingot and 1 Sabrecat Pelt\r\nScaled Boots - 2 Leather, 2 Leather Strips, 1 Steel Ingot, 1 Corundum Ingot and 1 Fox Pelt\r\nScaled Bracers - 1 Leather, 1 Steel Ingot, 1 Corundum Ingot and 1 Fox Pelt\r\nScaled Helmet - 1 Leather, 1 Steel Ingot, 1 Corundum Ingot and 1 Large Antlers\r\n\r\nSteelplate Armor - 7 Leather, 6 Leather Strips, 10 Steel Ingot, 5 Corundum Ingot and 1 Bear Pelt\r\nSteelplate Boots - 1 Leather Strips, 4 Steel Ingot, 2 Corundum Ingot and 1 Fox Pelt\r\nSteelplate Gauntlets - 1 Leather, 2 Leather Strips, 2 Steel Ingot, 1 Corundum Ingot and 1 Fox Pelt\r\nSteelplate Helmet - 1 Leather, 2 Steel Ingot and 1 Corundum Ingot\r\n\r\nDragonplate Armor - 2 Dragon Bone, 3 Dragon Scale, 1 Iron Ingot and 1 Elk Hide\r\nDragonplate Boots - 2 Leather Strips, 1 Dragon Bone, 3 Dragon Scale, 1 Iron Ingot and 1 Fox Pelt\r\nDragonplate Gauntlets - 1 Dragon Bone, 2 Dragon Scale, 1 Iron Ingot and 1 Fox Pelt\r\nDragonplate Helmet - 1 Dragon Bone, 2 Dragon Scale and 1 Iron Ingot\r\nDragonplate Shield - 1 Dragon Bone, 3 Dragon Scale and 1 Iron Ingot\r\n\r\nDragonscale Armor - 4 Dragon Scale and 2 Iron Ingot\r\nDragonscale Boots - 2 Leather Strips, 2 Dragon Scale and 1 Iron Ingot\r\nDragonscale Gauntlets - 2 Leather Strips, 2 Dragon Scale and 1 Iron Ingot\r\nDragonscale Helmet - 2 Dragon Scale and 1 Iron Ingot\r\nDragonscale Shield - 1 Leather, 4 Dragon Scale and 2 Iron Ingot\r\n\r\nEbony Armor - 8 Leather, 2 Leather Strips and 9 Ebony Ingot\r\nEbony Boots - 3 Ebony Ingot\r\nEbony Gauntlets - 1 Leather and 2 Ebony Ingot\r\nEbony Helmet - 1 Leather and 2 Ebony Ingot\r\nEbony Shield - 5 Ebony Ingot\r\nEbony Dagger - 1 Leather and 1 Ebony Ingot\r\nEbony Sword - 1 Leather and 2 Ebony Ingot\r\nEbony Greatsword - 3 Ebony Ingot\r\nEbony War Axe - 2 Leather Strips, 1 Firewood and 1 Ebony Ingot\r\nEbony Battleaxe - 1 Leather Strips, 2 Firewood and 2 Ebony Ingot\r\nEbony Mace - 2 Leather Strips, 1 Firewood and 1 Ebony Ingot\r\nEbony Warhammer - 2 Leather Strips, 2 Firewood and 1 Ebony Ingot\r\nEbony Bow - 2 Leather Strips, 1 Firewood and 2 Ebony Ingot\r\n\r\nDaedric Armor - 8 Leather, 1 Iron Ingot, 7 Ebony Ingot and 1 Daedra Heart\r\nDaedric Boots - 1 Leather, 1 Leather Strips, 3 Ebony Ingot and 1 Daedra Heart\r\nDaedric Gauntlets - 2 Ebony Ingot and 1 Daedra Heart\r\nDaedric Helmet - 1 Leather, 1 Iron Ingot, 2 Ebony Ingot and 1 Daedra Heart\r\nDaedric Shield - 2 Iron Ingot, 4 Ebony Ingot and 1 Daedra Heart\r\nDaedric Dagger - 2 Leather Strips, 1 Iron Ingot, 1 Ebony Ingot and 1 Daedra Heart\r\nDaedric Sword - 2 Leather Strips, 2 Iron Ingot, 1 Ebony Ingot and 1 Daedra Heart\r\nDaedric Greatsword - 1 Leather Strips, 3 Iron Ingot, 1 Ebony Ingot and 1 Daedra Heart\r\nDaedric War Axe - 2 Leather Strips, 1 Iron Ingot, 1 Ebony Ingot, 1 Firewood and 1 Daedra Heart\r\nDaedric Battleaxe - 2 Leather Strips, 2 Iron Ingot, 1 Ebony Ingot, 2 Firewood and 1 Daedra Heart\r\nDaedric Mace - 2 Leather Strips, 1 Iron Ingot, 1 Ebony Ingot, 1 Firewood and 1 Daedra Heart\r\nDaedric Warhammer - 2 Leather Strips, 1 Iron Ingot, 2 Ebony Ingot, 2 Firewood and 1 Daedra Heart\r\nDaedric Bow - 2 Leather Strips, 1 Iron Ingot, 2 Ebony Ingot and 1 Daedra Heart\r\n\r\nAncient Nord Armor - 2 Leather, 3 Leather Strips, 4 Iron Ingot and 1 Elk Hide\r\nAncient Nord Boots - 1 Leather, 2 Leather Strips, 2 Iron Ingot and 1 Fox Pelt\r\nAncient Nord Gauntlets - 1 Leather, 2 Leather Strips and 1 Iron Ingot\r\nAncient Nord Helmet - 2 Iron Ingot and 1 Large Antlers",
  "categoryId": "79",
  "version": "v1.4",
  "author": "acdcdave1387",
  "createdUnix": "1355053487",
  "updatedUnix": "1355591714",
  "containsAdultContent": false,
  "uploadedBy": "acdcdave1387",
  "primaryFile": null,
  "files": [
    {
      "fileId": "104761",
      "name": "EasyIngotNMM",
      "version": "v1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "EasyIngotNMM-28027-v1-0.7z",
      "uploadedUnix": "1355306146",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f9866d3cbc7052c7ef5b00dbc5407e0c8e64480b55d346332d92b02ebc3caf74/analysis/1407301178/",
      "changelogHtml": " Completed Sections: Hide, Leather, Iron, Steel, Imperial <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EasyIngotNMM-28027-v1-0.7z?fid=104761&ttl=1535801129&ri=8192&rs=8192&setec=0e91ea2b8e49bbbb1cb2d18f8fc78c32"
    },
    {
      "fileId": "104762",
      "name": "EasyLeatherNMM",
      "version": "v1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "EasyLeatherNMM-28027-v1-0.7z",
      "uploadedUnix": "1355306175",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/da6926c0a5b21da67b8e7ee2bc8d4b628d767891df1768f58464fea7ef35c56b/analysis/1407301179/",
      "changelogHtml": " Completed Sections: Hide, Leather, Iron, Steel, Imperial <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EasyLeatherNMM-28027-v1-0.7z?fid=104762&ttl=1535801130&ri=8192&rs=8192&setec=939a4f1912cbd3d6d5aa8a873a145e34"
    },
    {
      "fileId": "104763",
      "name": "SteelCharcoalNMM",
      "version": "v1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "SteelCharcoalNMM-28027-v1-0.7z",
      "uploadedUnix": "1355306217",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/318e8d55b7f2b61e9c85cf1e0f091a0eec9d43695df92ab0c19963aff9bef167/analysis/1407301180/",
      "changelogHtml": " Completed Sections: Hide, Leather, Iron, Steel, Imperial <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SteelCharcoalNMM-28027-v1-0.7z?fid=104763&ttl=1535801130&ri=8192&rs=8192&setec=929cf50ed6154331c22aae317e84205c"
    },
    {
      "fileId": "105370",
      "name": "WARR",
      "version": "v1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "WARR-28027-v1-4.7z",
      "uploadedUnix": "1355591622",
      "modVersion": "v1.4",
      "virusScanUrl": "https://www.virustotal.com/file/a6f3d35fa8501e02770ad79afa57e621bcd94f30d88429e7b939ed9150e76ec6/analysis/1407305883/",
      "changelogHtml": " Completed Daedric, Ebony and Ancient Nord sets (minus nord hero weapons) <br/> \n Small change to Orcish boots <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WARR-28027-v1-4.7z?fid=105370&ttl=1535801131&ri=8192&rs=8192&setec=d11e60baf0f03a3db95a249f35f91c0b"
    },
    {
      "fileId": "105372",
      "name": "WARR-NMM",
      "version": "v1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "WARR-NMM-28027-v1-4.7z",
      "uploadedUnix": "1355591664",
      "modVersion": "v1.4",
      "virusScanUrl": "https://www.virustotal.com/file/1628c9b0b14e2deaee5ba805d334995f5adeedc4946a7000de3a39e88653036b/analysis/1407305888/",
      "changelogHtml": " Completed Daedric, Ebony and Ancient Nord sets (minus nord hero weapons) <br/> \n Small change to Orcish boots <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WARR-NMM-28027-v1-4.7z?fid=105372&ttl=1535801131&ri=8192&rs=8192&setec=0f6eface1cf1304a25909cf778fbc34a"
    },
    {
      "fileId": "105373",
      "name": "WARR OptVer-NMM",
      "version": "v1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "WARR OptVer-NMM-28027-v1-4.7z",
      "uploadedUnix": "1355591714",
      "modVersion": "v1.4",
      "virusScanUrl": "https://www.virustotal.com/file/1ead62e9240c5cb7f042a638ab1443fc7c488958892338aa140f847aff0b5056/analysis/1407305889/",
      "changelogHtml": " Completed Daedric, Ebony and Ancient Nord sets (minus nord hero weapons) <br/> \n Small change to Orcish boots <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WARR%20OptVer-NMM-28027-v1-4.7z?fid=105373&ttl=1535801132&ri=8192&rs=8192&setec=0e236fa28c48e82da605ca44e5541350"
    }
  ]
}