{
  "modId": 28040.0,
  "modName": "CIA - Craftable Imperial Armory",
  "summary": "Makes Imperial weapons and armor craftable after joining with the legion...OR makes Stormcloak gear craftable after siding with the Sons of Skyrim.\r\nOptional version makes them both craftable.",
  "descriptionHtml": "[color=red][center][b]CIA - Craftable Imperial Armory[/b][/center][/color]\r\n[center]by acdcdave1387[/center]\r\n[center]Nexus exclusive, please let me know if you see my mods elsewhere[/center]\r\n\r\nThis mod makes all of the Imperial weapons and armor craftable after joining the Imperial Legion. The recipes used to make all of the Imperial weapons and armor follow the same \\\"realistic\\\" approach found in my other mod [url=http://skyrim.nexusmods.com/mods/28027]WARR - Weapon and Armor Recipes Rebalanced.[/url]\r\nThus the ingredients required are based on the visual representation of the items in game.\r\nWhat do I mean? Well the Imperial Shields both have a wooden frame, thus they both require wood to craft.\r\nAll Imperial related armor pieces show up under the Imperial category at the forge.\r\nThe bow, sword and all heavy armor require the Steel Smithing perk to craft regardless of faction relation.\r\n\r\nI also added craftable Stormcloak gear (Stormcloak armor and helmet plus Fur boots and gauntlets) if the player joins the Stormcloaks instead.\r\nAll Stormcloak gear will be under the Leather category\r\n\r\n~~Changelog~~\r\nv1.0 Initial release (all Imperial or Stormcloak gear requires proper allegiance)\r\nv1.1 Added allegiance requirement to Steel Shin Boots and Steel Imperial Gauntlets because they are both a straight up copy of the Heavy Imperial Armor\r\nv1.2 Moved the Imperial Sword to Imperial category at the forge\r\n\r\n~~Compatibility~~\r\nThis mod is made entirely with the Creation Kit and shouldn\\'t conflict with anything other than mods which add these items to the game. So if you use a crafting overhaul you will end up with more than one recipe. In other words, there will be two entries in the forge menu for all of the Light armor and both Imperial weapons as well as the missing helmets.\r\nAs long as you don\\'t mind double entries, go ahead and use my mod with any crafting overhaul you like.\r\n\r\nI strongly recommend you check out WARR and see the optionals included with it.\r\nIf you decide to use WARR with this mod, LOAD ORDER MATTERS.\r\n[list]\r\n[*]WARR.esp\r\n[*]CIA.esp\r\n[/list]As you can see here, CIA must load AFTER WARR\r\n\r\n~~Installing~~\r\nThis is a very simple plugin mod.\r\nOnly thing you need to do is drop the Data folder into your Skyrim folder.\r\nDefault location for Skyrim folder in a 64-bit installation is as follows.\r\nC:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\Skyrim\r\n\r\n~~Uninstalling~~\r\nSince this mod is so simple, you merely need to delete CIA.esp or uncheck it from your load order.\r\n\r\n~~Optional Version~~\r\nThe optional version removes the requirement of having to join the legion in order to craft the Imperial weapons and armor. So with this version you should be able to craft all Imperial Light armor pieces as well as the Studded armor at the start of the game. Once you gain the Steel Smithing perk, you can smith the heavy armor variants as well as the bow and sword.\r\nAll Stormcloak gear will be available at the start of the game.\r\n\r\n~~Final Note~~\r\nI chose, for now, not to include the Penitus Oculatus armor set as the player doesn\\'t actually join up with that faction. They are a sort of \\\"Secret Service\\\" meaning that they provide bodyguard services for the Imperial leader. However, if people demand I add it in, I will do so.",
  "categoryId": "24",
  "version": "v1.2",
  "author": "acdcdave1387",
  "createdUnix": "1355073856",
  "updatedUnix": "1355320778",
  "containsAdultContent": false,
  "uploadedBy": "acdcdave1387",
  "primaryFile": null,
  "files": [
    {
      "fileId": "104787",
      "name": "CIA",
      "version": "v1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "CIA-28040-v1-2.7z",
      "uploadedUnix": "1355320721",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e33a645cfe15985a517494e2504e46e8ed27dd2fe0a25cc5789326f076ed56c5/analysis/1407301445/",
      "changelogHtml": " Moved the Imperial Sword to the Imperial category at the forge <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CIA-28040-v1-2.7z?fid=104787&ttl=1535801151&ri=8192&rs=8192&setec=212f3f40ba142ee6a0e8d1c085ba1987"
    },
    {
      "fileId": "104788",
      "name": "CIA-NMM",
      "version": "v1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "CIA-NMM-28040-v1-2.7z",
      "uploadedUnix": "1355320750",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d9a2dbf700b3da434b085c046e3d0c49b41bab878deff16d3712408bdc1d1fd9/analysis/1407301505/",
      "changelogHtml": " Moved the Imperial Sword to the Imperial category at the forge <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CIA-NMM-28040-v1-2.7z?fid=104788&ttl=1535801152&ri=8192&rs=8192&setec=cc03ae9124fee8614e501653ab186657"
    },
    {
      "fileId": "104789",
      "name": "CIA-optver-NMM",
      "version": "v1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "CIA-optver-NMM-28040-v1-2.7z",
      "uploadedUnix": "1355320778",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/99c42bfdc27482faafed92bfa77c7140a2e17658bd97ad9130ef3731beb52a42/analysis/1407301505/",
      "changelogHtml": " Moved the Imperial Sword to the Imperial category at the forge <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CIA-optver-NMM-28040-v1-2.7z?fid=104789&ttl=1535801152&ri=8192&rs=8192&setec=dc78f2dab5e4f6c608404592e63859e1"
    }
  ]
}