{
  "modId": 28041.0,
  "modName": "Tiberius Imperial Faithfull or True Son of Skyrim",
  "summary": "Tiberius is a Nord that had is life saved in a young age by an Imperial commander; and has been in the service of the imperial army since then; but he never forgot is nordic roots and with the recent turn of events in skyrim he starts to doubt in what side he should be fighting.\r\n",
  "descriptionHtml": "MOD: Captain Tiberius Imperial Faithfull or True Son of Skyrim?\r\n\r\nINTRODUCTION:\r\n\r\nTiberius is a custom voiced follower that is fearsome in battle \r\nwhen wielding War Axes in his hands.\r\n\r\nDescription:\r\n\r\nTiberius is a Nord that had is life saved when he was young boy by a commander\r\nof the imperial army while is village was attacked by the thalmor during \r\nthe war with the Elves.\r\nBoth is mother and father were killed in that attacked; so the boy was\r\nraised from that day forward by the commander that rescued i\\'m.\r\nEducated in the arts of war from a young age; tiberius has grown up to \r\nbe great soldier; but he also never forgot is nordic roots.\r\nBut with the rebelion of the stormcloaks, the civil war and the prohibition\r\nof the worship of Talos; Tiberius starts to doubt in which side he should be\r\nfighting on.\r\nMaybe with the help of the Dovahkiin he shall choose the right side to fight for.\r\n\r\nTiberius is essential and has perks that enhance the dual wielding of weapons;\r\nspecialy war axes.\r\nHe carrys with i\\'m a diary where he tells is story from his youth until now.\r\nYou can find him at the Four Shields Tavern in Dragon Bridge.\r\n\r\nInstallation:\r\n\r\nJust place the Data folder in your skyrim folder and check if the Tiberius.esp \r\nis activated.\r\n\r\nUninstalling:\r\n\r\nDeactivate the Tiberius.esp file or delete it and the files that come with it.\r\n\r\nPS: Don\\'t forget to comment about the mod and tell me what you think; and if \r\nyou really liked it don\\'t forget to endorse it. Thanks; and Talos be with you!\r\n ",
  "categoryId": "66",
  "version": "",
  "author": "Sergeynest",
  "createdUnix": "1355074377",
  "updatedUnix": "1355075461",
  "containsAdultContent": false,
  "uploadedBy": "Sergeynest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "104110",
      "name": "Tiberius Imperial Faithfull or True Son of Skyrim You choose",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4970",
      "fileName": "Tiberius Imperial Faithfull or True Son of Skyrim You choose-28041-.rar",
      "uploadedUnix": "1355075461",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2cef4f7b2f884551405625e1067d162478fad033a77afeeb96885b3eae237fff/analysis/1407296829/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tiberius%20Imperial%20Faithfull%20or%20True%20Son%20of%20Skyrim%20You%20choose-28041-.rar?fid=104110&ttl=1535801154&ri=8192&rs=8192&setec=922390204294b6d743d0e6c08fbd2865"
    }
  ]
}