{
  "modId": 28063.0,
  "modName": "Magic Maker",
  "summary": "Gain magic spells and items through crafting, I hate how Skyrim doesn\\'t have the spell crafting system Oblivion did so here is my solution.  Input welcome for improvements and additions :)",
  "descriptionHtml": "[center][img]http://img689.imageshack.us/img689/1011/magicmaker.png[/img][/center]\r\n\r\n\r\n[color=cyan][size=6][font=\\\"Palatino Linotype\\\"]Description[/font][/size][/color]\r\n\r\nAllows the player to craft spells tomes, magic staffs, and scrolls.  I found the vanilla game needed more opportunities to gain spells and magic which is why I made this.\r\nEach item will be available to craft when the player has reached the appropriate magic school level, for example adept level conjuration tomes will only appear for crafting when the player is at conjuration 50.\r\nI haven\\'t added lots of new spells and equipment I just made aquisition a bit more varied, plus I miss the TES4 spell making abilities.\r\n\r\n- Tomes are craftable at tanning racks requiring a blank book, ink, quill, soul gem, plus relevant materials\r\n- Staffs are craftable at forges requiring wooden staffs, soul gems, plus relevant materials\r\n- Scrolls are craftable at tanning racks requiring paper rolls, ink, quill, plus relevant materials\r\n- Seeing as paper rolls, ink, quills, and the new blank books are limited I have added the ability to craft them too (no conditions applied).\r\n- New items include Blank Book for tomes, and Wooden Staff for...staffs (The staff is a misc item and can\\'t be equipped).\r\n\r\nI know there are options to craft magic atronach-based items at the Atronach Forge and I haven\\'t touched those, this is all down to personal preference and I don\\'t tend to use it.  Personally I don\\'t like it - it\\'s out of the way, inconsistant, and the recipes don\\'t make sense.\r\n\r\nI am pretty sure there are other mods that do the same thing so it\\'s up to you which to use, FYI I have no interest in making further compatibility with other mods so don\\'t ask.\r\n\r\n\r\n[color=cyan][size=6][font=\\\"Palatino Linotype\\\"]Compatibility[/font][/size][/color]\r\n\r\nThe new crafting items have been added through the book and misc levelled lists.  Seeing as very few mods do this it will allow for good compatibility.\r\n\r\n[color=cyan][size=6][font=\\\"Palatino Linotype\\\"]Installation[/font][/size][/color]\r\n\r\nPlace the esp in your data folder, check it in the launcher data files.\r\n\r\n\r\n[color=cyan][size=6][font=\\\"Palatino Linotype\\\"]Feedback[/font][/size][/color]\r\n\r\nI am happy to make any improvements and additions if the feedback is given in the comments, also let me know what you think was originally missing from the magic system and I will have a go at making it.\r\nLet me know if you find bugs and I will sort them out.\r\n\r\n\r\n[color=cyan][size=6][font=\\\"Palatino Linotype\\\"]Credits[/font][/size][/color]\r\n\r\n- JZBai for Quarterstaff - http://skyrim.nexusmods.com/mods/25431",
  "categoryId": "75",
  "version": "1",
  "author": "Ironman5000",
  "createdUnix": "1355089945",
  "updatedUnix": "1355089991",
  "containsAdultContent": false,
  "uploadedBy": "Ironman5000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "104212",
      "name": "Magic Maker",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1712",
      "fileName": "Magic Maker-28063-1.7z",
      "uploadedUnix": "1355089991",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/628be57329216e5ad209f7e4f02b1d7977a160c0f2b2bba41bdee6abd8b20fdc/analysis/1407297699/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Magic%20Maker-28063-1.7z?fid=104212&ttl=1535801220&ri=8192&rs=8192&setec=142f9db3d5e536b2473ccd4ea2c89f40"
    }
  ]
}