{
  "modId": 28089.0,
  "modName": "Block Skill Tree",
  "summary": "A redone Block skill perk tree that hopefully adds a bit more flavor to Block. Featuring some brand new perks and differentiation between using shields and weapons to block.",
  "descriptionHtml": "*Important* This mod is no longer a work in progress- it has progressed to the point that I have reached a minimum level of satisfaction with it. As such, all permissions to complete my work and claim it as your own are now revoked.\r\n\r\nInstallation:\r\nManual - Download the file, and extract the .esp file from the archive into your Data folder.\r\n(Most commonly found at OS:C>Program Files (x86)>Steam>steamapps>common>skyrim>Data)\r\nUsing the game\\'s default launcher, make sure DiabolusUrsusBlockPerks.esp is checked.\r\n\r\nIncompatibilities:\r\nI tried to keep modification of vanilla aspects to a minimum, but any mod that modifies the perks in the Block perk tree or the TorchBashPerk will be incompatible. Whichever mod is loaded lower in the load order will take priority. \r\n\r\nChanges to the Block Skill:\r\n\r\n[b]Parry[/b] (Shield Wall): Five levels, at 0, 20, 40, 60 and 80 block. \r\nBlocking with a shield or weapon is 10, 20, 30, 40 and 50% more effective.\r\n\r\nShield Branch (These perks require a shield to be equipped to function.)\r\n\r\n[b]Elemental Protection[/b]: Two levels, at 25 and 50 block (Requires at least one level of Parry.). \r\nLevel 1 reduces incoming fire, frost and shock damage by 25% while blocking and level 2 reduces them by 50%. \r\n\r\n[b]Deflect Arrows[/b]: One level, at 30 block (Requires at least one level of Elemental Protection). \r\nThe vanilla Deflect Arrows perk. If someone lends a hand in the future with scripting or shows me what needs to be done, this is subject to change and improvement.\r\n\r\n[b]Deadly Bash[/b]: One level, at 50 block (Requires Deflect Arrows). Bashing does 5 times more damage. \r\n\r\nWeapon Branch (These perks require a shield NOT to be equipped to function.)\r\n\r\n[b]Counter Stroke[/b]: Two levels, at 25 and 50 block (Requires at least one level of Parry.)\r\nLevel 1 provides a 10% chance to deal ten times incoming damage to an attacking enemy while blocking with a weapon. Level 2 provides a 15% chance.\r\n\r\n[b]Disarming Impact[/b]: Two levels, at 30 and 60 block (Requires at least one level of Counter Stroke.) \r\nLevel 1 provides a 20% chance to disarm an opponent of any level when bashing with a weapon and level 2 provides 40%.\r\n\r\n[b]Quick Reflexes[/b]: One level, at 50 block (Requires at least one level of Disarming Impact.) Slows time for 2 seconds when an enemy power-attacks. This should be the same as the vanilla perk, though if it could be made a bit less buggy that would be ideal. (No infinite time-slow, etc.) \r\n\r\nUtility Branch (These perks work regardless of whether or not a shield is equipped.)\r\n\r\n[b]Defensive Alacrity[/b]: One level, at 30 block. \r\nThe vanilla Block Runner perk. If someone can show me how to create different movement speeds depending on whether or not a shield is equipped, that would be very appreciated.\r\n\r\n[b]Power Bash[/b]: One level, at 60 block (Requires Defensive Alacrity.) \r\nThe vanilla Power Bash perk. It won\\'t work when implemented otherwise, for reasons unknown. At this time it serves as a means of getting both the Violent Impact and Disarming Impact perks to work properly at the same time. \r\n\r\n[b]Violent Impact[/b]: One level, at 100 block (Requires Power Bash.) \r\nPower Bashing with a shield or weapon has a 20% chance of knocking most opponents down. This is accomplished by a 1 second Paralysis effect, so enemies immune to Paralysis will be impossible to knock down. \r\n\r\nTorch Specific Perks\r\n[b]Warding Flames[/b]: \r\nBashing with a torch now applies a 1 second fear effect to all living enemies. \r\nThis was originally intended to be a purchased perk with a longer duration, but the vanilla TorchBashPerk overrides all custom ones for reasons unknown. \r\n",
  "categoryId": "24",
  "version": "1.0",
  "author": "DiabolusUrsus",
  "createdUnix": "1355127380",
  "updatedUnix": "1357776801",
  "containsAdultContent": false,
  "uploadedBy": "DiabolusUrsus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "104341",
      "name": "Block Skill Tree ver 0_1",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Block Skill Tree ver 0_1-28089-0-1.zip",
      "uploadedUnix": "1355127710",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/936e340ac3e15f05ab6ca0cb8b8f237028555daa339a48e27d9c6cb2c30794ea/analysis/1407298271/",
      "changelogHtml": " Initial release, still mostly a work in progress.  <br/> \n Shield Wall, Deflect Arrows, Elemental Protection, Block Runner, Deadly Bash and Quick Reflexes perk requirements changed. <br/> \n Warding Flames perk added. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Block%20Skill%20Tree%20ver%200_1-28089-0-1.zip?fid=104341&ttl=1535801251&ri=8192&rs=8192&setec=1bc54ee6f2996492a33e1f3b0be39aea"
    },
    {
      "fileId": "109567",
      "name": "Block Skill Tree ver 0_2",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Block Skill Tree ver 0_2-28089-0-2.zip",
      "uploadedUnix": "1357336361",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/d0ac2d8ef3394af8b9beb1ad917386da53ece8bb497ca374a14bf37b2e8684e6/analysis/1407336972/",
      "changelogHtml": " Block skill tree is now comprised of entirely custom perks. They can be found in the Creation Kit with the prefix DBUR. <br/> \n Torch Bash perk temporarily removed due to lack of functionality, it will return when it works. <br/> \n Counter Blow is currently an empty perk- it does nothing but has been included for structural purposes. This should hopefully be fixed by the next release, or at least filled with a placeholder effect. <br/> \n Deflect Arrows, Defensive Alacrity (Block Runner), Power Bash and Violent Impact (Shield Charge) still function like their vanilla perks. <br/> \n Parry, Elemental Protection, Deadly Bash, Disarming Impact and Quick Reflexes should function as intended (Weapon or Shield specific.) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Block%20Skill%20Tree%20ver%200_2-28089-0-2.zip?fid=109567&ttl=1535801251&ri=8192&rs=8192&setec=4e38e0fc347a896660aa0c7fe4546dbb"
    },
    {
      "fileId": "1000001289",
      "name": "Block Skill Tree ver 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Block Skill Tree ver 1_0-28089-1-0.zip",
      "uploadedUnix": "1357776801",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/788612b40753830212148447775578e847766be2f2417e3db5900ce761c8e44c/analysis/1407345782/",
      "changelogHtml": " First complete release, all perks are functional, though some functions may be modified in the future. <br/> \n Counter Blow changed to Counter Stroke, with a percent chance to deal ten times incoming damage to an attacker while blocking with a weapon. <br/> \n Violent Impact now only works when power bashing, with a 20% chance to knock over most enemies.  <br/> \n Warding Flames is now functional, but is an inherent rather than purchased perk, with a shorter fear duration. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Block%20Skill%20Tree%20ver%201_0-28089-1-0.zip?fid=1000001289&ttl=1535801251&ri=8192&rs=8192&setec=f00249c9839f482be7013313b0e899cf"
    }
  ]
}