{
  "modId": 28097.0,
  "modName": "Armors of Nocturnal and Quest for ROE",
  "summary": "Channel your inner strength and challenge your brain in this quest for the Armors of Nocturnal. This mod includes a lengthy new quest, expansive and incredibly detailed new environments, riddles, scavenger hunts, and incredible rewards. Learn the legend, unlock the secrets, and reap the rewards.",
  "descriptionHtml": "[center][url=http://kaminazo.files.wordpress.com/2012/11/roeheader.png][img]http://kaminazo.files.wordpress.com/2012/11/roeheader.png[/img][/url][/center]\r\n[center][b][color=white][url=http://kaminazo.wordpress.com]My Blog: kaminazo.wordpress.com [/url][/color][/b][/center]\r\n\r\n[center][b][color=red]1.0 Release![/color][/b][/center]\r\n\r\n[center][color=skyblue][b]Artist\\'s Blurp[/b][/color]\r\n[color=white]The concept started as a player home project based on the Room of Requirement from Harry Potter. It quickly grew into a more Skyrim lore-friendly experience. And from there it continued to grow. This is by far the most ambitious thing I\\'ve ever done for a game. In the beginning stages, it focused more on sculpture than playability. Endlessly arranging piles of junk took the better part of two months. I always try to create beautifully hand-crafted spaces with dynamic lighting. I want my work to be an awe-inspiring and heavily immersive piece of art to lose yourself within. After countless hours of environment building, story writing, puzzle creation, quest planning, and weapon/armor/spell drafting and scripting, I can definitely say that this is a challenging experience. I have learned millions of little tricks in the Creation Kit along the way. If you see something you love and want to know how it was done, email me! I apologize for my ambiguity, but I don\\'t want to spoil any of the surprises! Finally, please comment and endorse after playing, and I hope you enjoy my Room of Encumbrance![/color][/center] \r\n\r\n[center][color=skyblue][b]System/Application Requirements[/b][/color]\r\n[color=white]This mod WILL NOT work without Dawnguard. You must have Dawguard installed to play ROE because it relies on many of its assets.\r\nAlso, this mod WILL NOT work properly without the Skyrim Script Extender (SKSE). Hundreds of the new scripts I wrote rely on this application to function properly. It is free and downloadable [b][url=http://skse.silverlock.org/] here[/url][/b]. It is very easy to install if you follow the readme included with the download. SKSE is updated regularly with new version updates of Skyrim.\r\nI highly recommend using the Unlimited Bookshelves mod along with ROE. It is very easy to install and the ROE is integrated with it. If you don\\'t already have it installed, you can get it [b][url=http://skyrim.nexusmods.com/mods/10891] here[/url][/b].\r\nParts of this mod can be a bit of a drain on a weak system. If you must run your Skyrim game on the lowest video settings for it to function, you will experience a lot of lag inside the Room, itself. You are free to try out the ROE, but don\\'t expect it to run smoothly on every computer.[/color][/center] \r\n\r\n[center][color=skyblue][b]Installation[/b][/color]\r\n[color=white]If you haven\\'t yet, install Dawnguard.\r\nIf you haven\\'t installed SKSE, install SKSE. [b][url=http://skse.silverlock.org/] Download SKSE[/url][/b]\r\nIf you don\\'t have Unlimited Bookshelves, install it. [b][url=http://skyrim.nexusmods.com/mods/10891] Download U.B.[/url][/b].\r\nDownload ROE and extract it to your Skyrim/Data folder just like every other mod. Make sure “ROEBETA” is checked on in your Data section. Then play![/color][/center] \r\n\r\n[center][color=skyblue][b]Starting the Quest[/b][/color]\r\n[color=white]The ROE quest has no real prerequisites or requirements to start. You just need to have access to the Thieve\\'s Guild (Ragged Flagon – Cistern). You can treat it as a special side-quest of the Thieve\\'s Guild questline, also closely tied to the Nightingales and Nocturnal. It starts immediately after reading a note left behind on the guildmaster\\'s desk. I don\\'t want to give anything else away, but feel free to email me on Nexus if you have any problems getting started![/color][/center] \r\n\r\n[center][color=skyblue][b]Finishing the Quest[/b][/color]\r\n[color=white]Parts of this quest are very difficult and are meant to confuse and challenge your brain. If you get hung up, please email me rather than posting spoilers in the comments section. The very end of the quest can be very frustrating, as well, so make sure to save your progress often. I promise, the rewards at the end are fun and awesomely awesome, so the struggle is worth it.[/color][/center] \r\n\r\n[center][color=skyblue][b]Easter Eggs[/b][/color]\r\n[color=white]There is a hidden entrance to the ROE, see if you can find it![/color][/center] \r\n\r\n[center][color=skyblue][b]Known Issues[/b][/color]\r\n[color=white]As of right now, not many people can get the quest to strt by reading Marna\\'s Plea on the guildmaster\\'s desk. I\\'m still trying to figure it out, but I could use some help. If any anyone out there could lend a hand in getting the quest to trigger properly, please email me!\r\nI\\'m only one person, so there is no way I could anticipate or experience every glitch, incompatibility or problem. If you do find any issues, please let me know so I can do my best to fix it quickly!\r\nAs of now, I don\\'t know of any conflicts with other mods. There is one spell that might not work with Open Cities, but it\\'s not a huge issue. \r\nI have run and cleaned up the mod considerably using TES5Edit.\r\nIf you use other lighting mods like Realistic Lighting, my environments may seem really dark. Make sure your brightness setting under display is cranked up. My recommendation: use the candlelight spell and/or carry lots of torches. This adds to the realism and difficulty of the game anyway, so I kind of enjoy it.\r\nThe lighting in the actual ROE worldspace is flakey. For some reason, the Creation Kit hates large spaces with lots of nooks and crannies that need to be lit. I did my best to remove these glitches, but they keep cropping up.\r\nMonsters sometimes behave strangely on their navmesh pathways. I suspect companions will do the same, so don\\'t take ten of them with you on this quest.\r\nThere is a possibility of doing the quest stages out of order, though it is unlikely. If you do it will break the questline. Just save often in case this happens to you. Or if you are familiar with the console, you can try resetting \\'ROEQ01\\'.[/color][/center] \r\n\r\n[center][color=skyblue][b]Future Plans[/b][/color]\r\n[color=red][s]Integrate ROE with Unlimited Bookshelves.[/s] Added in 1.0![/color][color=white] \r\nIntegrate ROE with Open Cities.\r\nFix lighting issue.\r\nExpand the room with a new quest.\r\nAdd more clutter.[/color][/center] \r\n\r\n[center][color=skyblue][b]Permissions[/b][/color]\r\n[color=white]If you like my mod and want to improve it, thank you and please do. I have no problem with anyone tinkering with this mod as long as you give credit where credit is due.[/color][/center] \r\n\r\n[center][color=skyblue][b]Credits[/b][/color]\r\n[color=white]Thank you to my wife again for looking at my back every night for the last four months while I put this mod together. Also, for helping me BETA test, and with making other design and gameplay decisions.\r\nThank you to J.K. Rowling for the Room of Requirement concept. Also to the artists and set designers of the Harry Potter movies that made her concept visible.\r\nThank you to Da5id2701 for the Unlimited Bookshelves scripts and allowing other modders to integrate his work with our own.\r\nThank you to Skyrim Nexus and the Nexus forums for all the inspiration and advice on various Creation Kit issues.\r\nThank you to all the users who downloaded the BETA of ROE and helped me streamline it.\r\nThank you to Bethesda for making the game and the editor for us to play with.\r\nThank you to all the Youtube\\'rs that posted help videos and tutorials on the Creation Kit.\r\nThank you to the Creation Kit wiki, without it I never would have learned how to script in Papyrus.\r\nThanks in advance to all the people who download and play ROE.[/color][/center] ",
  "categoryId": "92",
  "version": "BETA1.0",
  "author": "Kaminazo",
  "createdUnix": "1355145860",
  "updatedUnix": "1355146000",
  "containsAdultContent": false,
  "uploadedBy": "davidagladish",
  "primaryFile": null,
  "files": [
    {
      "fileId": "104373",
      "name": "ROE BETA1",
      "version": "BETA1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "415",
      "fileName": "ROE v1-28097-1-0.rar",
      "uploadedUnix": "1355146000",
      "modVersion": "BETA1.0",
      "virusScanUrl": "https://www.virustotal.com/file/733907c532cd0403360939cf610532376714d8e3701d7ec2043a6a42136a4c3f/analysis/1407298460/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ROE%20v1-28097-1-0.rar?fid=104373&ttl=1535801265&ri=8192&rs=8192&setec=3021dc6f67937e266933f6d0115d798e"
    }
  ]
}