{
  "modId": 28090.0,
  "modName": "Dragonborns Perch",
  "summary": "\r\nThis is a simple mod that adds a custom built, outdoor shack perch to the High Hrothgar ledge. \r\nThis mod is a completed, openworld player home with even more to come so keep your eyes open! ",
  "descriptionHtml": "Download only thru Steam at this time:\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=111617318&searchtext=\r\nWhen I get this is a 7Zip file it will be uploaded ASAP!\r\n\r\nThis is a simple mod that adds a custom built, outdoor shack perch to the High Hrothgar ledge. \r\nThis mod is a completed, openworld player home with even more to come so keep your eyes open! \r\n\r\nAt first i was making this for myself, but decided I\\'ll share it as my creativity led me to expand on this simple mod, into the mod it is now.\r\n\r\n--This home adds weapons and armor but nothing too high of a level, so it fits everyone.\r\n\r\nMy only hope is that someone out there will make this their home away from home in Skyrim. You may not spend all your time here gazing from the most beautiful area in Skyrim, but its a tiny mod (in terms of file size) that will be there when you want to run away from the problems of Skyrim, and join the Greybeards to pray to the sky.\r\n\r\nThis is my first mod, criticism is welcome. RATE :) Let me know if there\\'s too much of something, or too little, or anything. Your criticism will help me become better.\r\n\r\nThanks-\r\n\r\nI use IMAGINATOR - Visual Control Device for any visual effects seen in the screenshots.\r\nI also suggest Dynamic Snow mod.\r\n\r\nATTENTION: I have a low-end computer and play in a low resolution so these screenshots are in a lower resolution than the average Skyrim player.\r\n\r\nUpdates\r\nComing soon: Weapon Racks/cases, proper navmesh for followers, and more!\r\n\r\n-Optimized with TES5Edit\r\n-Added new armor-Dragonborn\\'s armor from Trailer. It is stronger than its original copies\r\n-Added a lower-lower storage scaffold beneath the main house and a mountainside staircase to get to it. Don\\'t slip :D\r\n-Minor tweaks to allow easy access to partially hidden enchanting/alchemy area.\r\n-Added Merchant!\r\n-Added ore veins.\r\n_______________________________\r\n-Added Map Marker\r\n-Added more statics and support\r\n-Added non-resetting chests with specific names for item sorting.\r\n-Added working leatherworking station, anvil for smithing, enchanting table, alchemy table, cooking spit\r\n_______________________________\r\n-Added rock pathway\r\n-Added an underscaffold balcony\r\n-Numerous static items changed/added\r\n-Added \\\"Dragonborn\\'s Fear\\\" - A glass bow slightly stronger and faster than regular, and has high level fear enchantment.\r\n\r\nThe Navmesh is not yet completed on this mod. Followers will have a hard time following you. I am currently in the process of making the Navmech, however it is tedious and annoying as hell haha :)\r\n\r\nThanks for all the support for this mod!\r\n\r\nDo not use without permission from me.",
  "categoryId": "67",
  "version": "",
  "author": "Redrumi135",
  "createdUnix": "1355129901",
  "updatedUnix": "1355129901",
  "containsAdultContent": false,
  "uploadedBy": "redrumi135",
  "primaryFile": null,
  "files": []
}