{
  "modId": 28111.0,
  "modName": "Tomb of Lord ALREKR",
  "summary": "In a dark and gloomy dungeon rest a beast waiting to be awakened.  Do you dare accept his challenge and enter the tomb alone?  If you fail he will be free to roam all of Tamriel enslaving us all.  Please Dragonborn, do not let us down.  Search the tomb for the letter of challenge and key to enter the tomb of Lord Alrekr.",
  "descriptionHtml": "ALREKR: From the Norse form of Visigothic Alaric, meaning \\\"all-powerful; ruler of all\\\". In a dark and gloomy dungeon rest a beast waiting to be awakened.  Do you dare accept his challenge and enter the tomb alone?  If you fail he will be free to roam all of Tamriel enslaving us all.  Please Dragonborn, do not let us down.  Search the tomb for the letter of challenge and key to enter the Tomb of Lord Alrekr. \r\n\r\nTo find the Tomb you can fast travel to Sunderstone Gorge.  From there the Tomb is SouthWest.  Just outside the Tomb is a Hunter sitting by a campfire that will sell you pelts.  Just behind her is the Tomb.  If you still cannot find it (possibly because of the big tree mod) and it can be hard, Open console command \\\"~\\\" button and type \\\"cow tamriel -17,-11\\\" without the quotation marks and you\\'ll arrive on the doorstep.  \r\n\r\nThis is my very first mod.  Ever..  My first post on this site for that matter.   The mod should be clean as a stand alone mod and should not interfere with any other mods as I use a lot of them myself.  I made this from the ground up and tested it myself.  I have Navmeshed the entire tomb inside and out so followers will enter.  I have three at all times that follow me and I never ran into problems.  \r\n\r\n\r\nThe enemies on this level are PRETTY STRONG. Lord Alrekr alone can kill you with ease if you\\'re level 30. I recommend you at least be level 35-40 to successfully survive if you\\'re alone.  I would also recommend a follower or two unless you have godly weapons or modified weapons to conflict extra damage. \r\n\r\n\r\n                                                                    -INSTALL-\r\nDownload manually:  Extract the esp file and place it into your data folder of your game.  I\\\\\\'m sure many of you by now know where that is if you\\\\\\'re downloading manually.\r\n\r\nDownload via Nexus Mod Manager (NMM):  Download and add file to NMM and install.\r\n\r\n\r\n                                                                   -UNINSTALL-\r\nManually:  Delete Toms Tomb.esp from your games data folder\r\n\r\nNMM:  Click uninstall on the mod in your mod section of NMM\r\n\r\n\r\nPlease let me know if you have any problems so I can fix them.  Like I said this is my first mod EVER.  On anything.. Please be nice and helpful not mean and hurtful.  \r\n\r\nI plan on continuing this dungeon as I learn how to mod better.  I know it\\'s bare at the moment. \r\n\r\n*known issues*  \r\nNone yet that I have noticed.  I still don\\\\\\'t know how to integrate custom music for the dungeon yet.  I\\'m still learning how to mod.  Please feel free to let me know if you have any issues.  I have TES5EDIT and cleaned up the mod already before posting it on here so it should be clean.  \r\n\r\nYOU DO NOT HAVE MY PERMISSION TO USE THIS MOD UNLESS I SAY SO.  If you ask I\\'m sure I would work with you.\r\n\r\nMods I\\'m using in screenshots:\r\nAQualityWorldMap\r\nApachiiSkyHair - ApachiiSkyHair_v_1_4_Full\r\nApachiiSkyHair NPC Overhaul - ApachiiHairStylesOnNPCs 2_20\r\nBetter males - Beautiful nudes and faces - New hairstyles\r\nBody Imperfect\r\nCalientes Female Body Mod Big Bottom Edition -CBBE-\r\nDen987 Smooth Female Face REPLACER SFFR - Face REPLACER\r\nHigh elf Eye replacement textures\r\nHigh Quality Eyes - High_Quality_Eyes_DD-1_20\r\nMale Cleric Armor - MaleClericArmor_v23\r\nmultFollowers.0.4b\r\nNeo Slave Leia for Skyrim - CBBE - Neo Slave Leia for Skyrim\r\nSkyHeels v 2_5 - Full SkyHeels V2-4 Beta for CBBE Users Only\r\nSkyrim Bigger Trees\r\nSporty Sexy Map - Athletic muscle mod CBBE UNP ADEC - 2 - Sporty CBBE - Athletic muscle map\r\nVictorias High Heel walk Animation plus BBP",
  "categoryId": "88",
  "version": "1.0",
  "author": "tschnepper",
  "createdUnix": "1355162023",
  "updatedUnix": "1355162023",
  "containsAdultContent": false,
  "uploadedBy": "tschnepper",
  "primaryFile": null,
  "files": []
}