{
  "modId": 2815.0,
  "modName": "Elder Scrolls Series Fan Tribute to Bethesda and Jeremy Soul",
  "summary": "Elder Scrolls Series\r\nFan Tribute to Bethesda and Jeremy Soule\r\nSecond Compilation\r\n",
  "descriptionHtml": "Elder Scrolls Series\r\nFan Tribute to Bethesda and Jeremy Soule\r\nSecond Compilation\r\nThe second collection of songs created by the many fans of Bethesda\\'s great series, The Elder Scrolls.\r\n\r\nLink to first compilation\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2366\r\n\r\nBethesda has made some great games over the years and this can be easily seen by the millions of people who have purchased Skyrim already and the thousands logged onto steam every day, playing the game religiously.\r\nWe all listen to the in-game music as it is probably some of the most epic scores you will ever hear. Hat\\'s off to Jeremy Soule and his masterpiece.\r\nMost PC users are accustomed to using mods for Elder Scroll games; however one might not always venture to YouTube to find some absolutely magical musical gems all devoted to Bethesda\\'s creation, Skyrim. These are mods too; they modify the music of Skyrim to give us a unique listening experience.\r\nAn already wonderful score has been re-created by many fans making their own rendition of the wonderful Jeremy Soule music.\r\nAll of these files require permission to be used...\r\nPlease note ALL these files are the property of Bethesda, regardless of who has created the version.\r\nWe suggest that all of you log on to YouTube and search for some of these talented artists and comment on their pages. The song names and usernames should match that on YouTube\r\nThe files are supplied \\\"as is\\\", which means the way the files were created. I have not edited their files; I have not \\\"mastered\\\" anything, they might all be different sample rates. Some files were converted from YouTube to mp3 or video due to the owner no longer having the original files.\r\nElder Scrolls games have amassed a great community and each person is capable of adding something special to the game. These people are true to life Bards!\r\n\r\nI would like to add that I have not performed any of these tracks; I was merely persistent enough to dredge through thousands of songs created by fans and pick the best ones. It has taken me nearly a week of listening to songs all day to come with a decent selection for everyone to hear.\r\nThey are all the variation of similar songs, so you might get sick of the Skyrim Main theme by the end of it!\r\nAnyhow, the people who you will be listening to in this tribute were kind enough to allow their work to be heard for free, as it should be, by allowing me permission to use their files.\r\nPlease follow the links provided to go to their YouTube page and leave them a comment on their page or leave a comment on my download page.\r\nThis second compilation adds more comedy, many parodies as well as a few great videos to watch!\r\n&#8195;\r\nTrack Listings\r\n\r\n**** Please note I have asked permission for EVERY file in this compilation, regardless if it was freely available as an upload. ****\r\nDo not use any of these files without permission\r\n•\tBilly Nat Skyrim Main Theme\r\nhttp://www.youtube.com/user/BillieNat\r\n•\tTGN Skyrim - Official Trailer Parody, ft. Yong! - WAY \r\n\r\nPermission was granted by both the user and TGN using this file without permission is a breach of copyright law.\r\nTGN: http://www.youtube.com/user/TGN\r\nTGN Website: http://tgn.tv/\r\n•\tRazgrizFX9  Dragons of Skyrim (Midi)\r\nhttp://www.youtube.com/user/RazgrizFX9\r\n•\tSuck My D (Skyrim Theme Parody) -- MaximusBlack\r\nhttp://www.youtube.com/user/MaximusBlack\r\n•\tSkyrim - Main theme Full Version 2 Taioo\r\n•\tSkyrim - Main theme Version 1 Taioo\r\n•\tFrom Arena to Skyrim - All Elder Scrolls themes Taioo\r\n•\tMorrowind - Main theme (Call of Magic) Taioo\r\n•\tOblivion - Main theme (Reign of the Septims) Taioo\r\n•\tSkyrim - Dragon Fight themes Taioo\r\n•\tFallout_ New Vegas - Main theme (BONUS!) Taioo\r\n•\tFallout_ New Vegas - Radio piano medley (BONUS 2!) Taioo\r\n\r\nhttp://www.youtube.com/user/Taioo\r\n\r\n•\tStephen Walking - The Elder Scrolls Dubstep Re-Orchestration\r\n\r\nhttp://www.youtube.com/user/StephenWalking\r\n\r\n•\tVandGmelodies ~Ode To Tamriel~\r\nhttp://www.youtube.com/user/VandGmelodies\r\n•\tSkyrim Parody(Chipmunk) therangerjoe526\r\n\r\nhttp://www.youtube.com/user/therangerjoe526\r\n•\t Skyrim Theme - 8bit DerChaot28\r\n\r\nhttp://www.youtube.com/user/DerChaot28\r\n\r\n•\tSheogorath does the \\\"Cheesespin\\\" (leekspin) \r\nhttp://www.youtube.com/user/leadlegirl\r\n•\tMorrowind Theme Song ~ Vocal Cover Seadryad\r\nhttp://www.youtube.com/user/seadryad\r\n\r\n•\tMorrowind Theme - Mario Paint  MickeRamone\r\n\r\nhttp://www.youtube.com/user/MickeRamone\r\n\r\n•\tMorrowind Call of Magic MrKenor Acoustic\r\n\r\nhttp://www.youtube.com/user/MrKenor\r\n\r\n•\tElder Scrolls V_ Skyrim - Curse of the Necromancer cyotecody5 + Pavel Zuk\r\n•\tCurse_of_the_Necromancer (Instrumental) Pavel Zuk\r\n\r\nhttp://www.youtube.com/user/pavelzuk\r\nhttp://www.youtube.com/user/cyotecody5\r\n\r\n•\tThe Elder Scrolls Arena Original Soundtrack - Track 14\r\n•\tElder Scrolls Daggerfall II Main Theme \r\n\r\n\r\nThese games are now free to download from Bethesda. (I have used the songs from those games)\r\n\r\n&#8195;\r\n•\tTales From Skyrim_ Throthgar The Dragonborn Part 1 (Video)\r\n•\tTales From Skyrim_ Throthgar The Dragonborn Part 2 (Video)\r\nThis hilarious series comes from http://www.youtube.com/user/Tyrannicon\r\n•\tThe Silly Adventures of Mr. Mochi (an Oblivion Machinima) (Video)\r\nhttp://www.youtube.com/user/theninjacowboy\r\n\r\n•\tI Have A Feeling (Fargoth\\'s Song) Wobblescoff\r\n•\tMorrowind Nord Song (How Does it Feel?) Wobblescoff\r\nhttp://www.youtube.com/user/WobbleScoff\r\n•\tThe Elder Scrolls VI_ Equestria MrYaridovich (Video)\r\nhttp://www.youtube.com/user/MrYaridovich\r\n\r\nI hope you enjoy the music!\r\nPlease note this is not a mod that adds music to your game, it\\'s just a set of music that you can listen to, carry on an mp3 player or what not.\r\nIt may be difficult to make a third compilation, however I am still waiting for over two dozen people to get back to me, so it depends if people submit their work or link me to other songs.\r\n\r\nHope you enjoy,\r\nRegards,\r\nTony Colella\r\n(Sydney666)\r\n",
  "categoryId": "61",
  "version": "2.0",
  "author": "Sydney666 aka Tony Colella and various artists",
  "createdUnix": "1323165172",
  "updatedUnix": "1323168847",
  "containsAdultContent": false,
  "uploadedBy": "sydney666",
  "primaryFile": null,
  "files": [
    {
      "fileId": "7565",
      "name": "Elder Scrolls Series Fan Tribute to Bethesda and Jeremy Soule",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "183985",
      "fileName": "Elder Scrolls Series Fan Tribute to Bethesda and Jeremy Soule-2815.7z",
      "uploadedUnix": "1323168847",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/2e0a9cb1648466d6cd326dcc5dd242d76acd88fdd7ff789adc44ee363b05b8a3/analysis/1406485736/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elder%20Scrolls%20Series%20Fan%20Tribute%20to%20Bethesda%20and%20Jeremy%20Soule-2815.7z?fid=7565&ttl=1535757323&ri=8192&rs=8192&setec=7712295e00e9b0597c6464b09669a246"
    }
  ]
}