{
  "modId": 28173.0,
  "modName": "Project Westeros - Game of Thrones Total Conversion for Skyrim",
  "summary": "A stand-alone total conversion for Skyrim, that plunges you into the gritty world of George R. R. Martin\\'s incredible creation, A Game of Thrones.  The whole of Westeros and it\\'s seven kingdoms at your feet, with accurate and faithful renditions that have been painstakingly recreated and lovingly crafted as a tribute to the fantastic works of thi",
  "descriptionHtml": "PLEASE NOTE:\r\nTHIS IS A WIP MOD.  We are pushing as hard as we can to get this made, but we need more Team members to come and join us,  so if you have modding experience, voice acting experience, CK experience, send us a message and come join the fun.\r\n\r\nWhat the above file actually adds:\r\nThis adds a book called Project Westeros, and it contains our links and some info about our mod.\r\n\r\nWhat we intend to add:\r\nThis will be a totally stand-alone single-player experience in a completely hand crafted Westeros.  We are starting off with The North emanating out from Winterfell.  We start at a similar time to Book 1 (A song of Ice and Fire) / HBO\\'s Game of Thrones Season 1.  Over time we shall add more and more to the world space so that in time you will be able to travel from the southern most tip of Westeros all the way to the wall and interact with NPCs and cities every step of the way.\r\n\r\nWe don\\'t deny that this is a colossal project, hence the release in stages, because to release everything in one go, well you\\'d be waiting a while to say the least.  But this mod deserves to get made, it\\'s scope will push what everyone thought could be done with Skyrim, and we\r\n\r\nWhere will the King\\'s Road take you?\r\n\r\n\r\nPlease note this is an unofficial mod made my fans for fans, we own no rights to the original material that belongs solely to George R. R. Martin and HBO, and this is purely an homage by fans of the books and show \r\n\r\n\r\n\r\n<iframe width=\\\"560\\\" height=\\\"315\\\" src=\\\"http://www.moddb.com/media/iframe/686062\\\" frameborder=\\\"0\\\" scrolling=\\\"no\\\" allowfullscreen></iframe><br /><a href=\\\"http://www.moddb.com/mods/the-westeros-project/videos/the-westeros-project-topography-scale-size\\\">The Westeros Project - Topography - Scale / Size - Mod DB</a>",
  "categoryId": "30",
  "version": "0.001a",
  "author": "Project Westeros Team",
  "createdUnix": "1355258586",
  "updatedUnix": "1355258586",
  "containsAdultContent": false,
  "uploadedBy": "LadyStark",
  "primaryFile": null,
  "files": []
}