{
  "modId": 28170.0,
  "modName": "Better MessageBox Controls",
  "summary": "Navigate all message boxes with the Left/Right and Activate (E) keys. Also fixes the clickable area of buttons so they are easier to select with the mouse.",
  "descriptionHtml": "[center][size=3]You may also like: [url=http://skyrim.nexusmods.com/mods/27371]Better Dialogue Controls[/url][/size][/center]\r<br />\r<br />\r<br />[size=3][color=#ffc000]In A Nutshell[/color][/size]\r<br />This mod lets you navigate the message boxes with the keyboard. Use Left/Right controls, and Activate to select options (typically A,D and E but it should work if you remapped those controls to other keys). Fixes the clickable area of buttons so they are easier to click.\r<br />\r<br />[center]\r<br />Reviewed by Brodual at [url=http://www.youtube.com/user/Brodual?feature=watch]Daily Skyrim Mod Spotlight[/url][color=#313131]________ ________[/color]Reviewed by olivierhacking at [url=http://www.youtube.com/user/olivierhacking?feature=watch]Skyrim Mod Reviews[/url]\r<br />\r<br />[youtube]8yj9TDTrB10[/youtube][color=#313131]......[/color][youtube]_1uLHwLkkKo[/youtube][/center]\r<br />\r<br />[size=3][color=#ffc000]Detailed Changes[/color][/size]\r<br />These are the changes made to the vanilla (original) Skyrim message boxes:\r<br />\r<br />[list][*]Enabled the gamepad style controls, which lets you navigate between options with the [color=#00b050]Left/Right keys[/color] (usually WASD), and select an option with the [color=#00b050]Activate key[/color] (usually E) and [color=#00b050]Return/Enter keys[/color]. Now you can dismiss simple “Ok” message boxes by pressing a single key instead of being forced to click a tiny text label.\r<br />[*]The [color=#00b050]TAB key[/color] cycles through &#34;Exit&#34; type buttons, where the label matches exactly &#34;Return&#34;, &#34;Exit&#34;, &#34;Done&#34;, &#34;Cancel&#34;, &#34;Back&#34; or &#34;No&#34;. This helps navigate custom menus from mods that have lots of options. While SkyUI3/MCM will alleviate this, there are still many instances where mods will continue to use message boxes (or mods that won’t update to use MCM).\r<br />[*][color=#f6b26b][i]With SKSE enabled[/i][/color] pressing [color=#00b050]ESCAPE[/color] picks the first “exit” button and selects it. Thus you can quickly exit out of most dialogs that provide an “exit” button. The recognized “exit” buttons are exactly as for the TAB key (see above). You can quickly exit out of Yes/No dialogs, and mod options. In multi level mod options usually the ESCAPE key will take you to the parent set of options, because it picks “Return”, “Back” or “Cancel”, etc. [color=#f6b26b][i]WITHOUT SKSE[/i][/color] the ESCAPE key behaves exactly as the TAB key (I’m sorry but it was not possible otherwise to distinguish the keys as crazy as it sounds&#33;).\r<br />[*]Fixed the width of the clickable area for the buttons to properly adapt to the entire length of the button label.\r<br />[*]Extended the clickable area also below the button labels, instead of only above. This makes them easier to pick with the mouse.\r<br />[*]Added a subtle highlight to the focused button.\r<br />[/list] \r<br />[size=3][color=#ffc000]For XBox Controller/Gamepad Users[/color][/size]\r<br />This mod may also be of interest to gamepad users: when you configure mods like Shooting Stars or Convenient Horses, instead of pressing Right multiple times to select &#34;Return&#34; or &#34;Exit&#34;, which gets tedious, you can simply press [color=#00b050][b]( B )[/b][/color] to jump to the next “exit” option (buttons labelled “Exit”, “Return”, “Cancel” and “Back”) and then press [color=#00b050][b]( A )[/b][/color] to select. Likewise when exiting out of a &#34;sub menu&#34; pressing [color=#00b050][b]( B ) &gt; ( A )[/b][/color] quickly goes back to the parent menu.\r<br />\r<br />[size=3][color=#ffc000]Further Thoughts[/color][/size]\r<br />On my computer there is a noticable lag on the mouse input in the menus despite FRAPS showing 60 FPS. This lag makes it awkward to accurately click on tiny areas. So improving the clickable area of buttons is a worthwhile usability fix as far as I’m concerned.\r<br />\r<br />Enabling Left/Right/Activate keyboard controls was pretty much flipping a switch in the code. The TAB key then would simply cycle through all buttons, duplicating what the “Right” key does. So I changed its behaviour as described above to make it a bit more interesting and useful.\r<br />\r<br />Lastly regarding the buggy clickable areas, to be fair it’s not much of an issue in vanilla Skyrim, because most button labels will be short like “Yes”, “No” or “Ok”. But with mods it is quite common for the button labels to become longer, exposing this bug.\r<br />\r<br />[size=3][color=#ffc000]Game & Mod Compatibility[/color][/size]\r<br />- Tested with Skyrim [color=#b6d7a8]v1.8[/color] (this mod should work on older versions but it has not been tested).\r<br />- This mod is purely a [color=#b6d7a8][i]user interface mod[/i][/color]. It’s essentially Flash (Scaleform) technology used by the game to display menus. It runs in a sandbox pretty much, and as such can not cause incompatibilities with [color=#b6d7a8][i]gameplay mods[/i][/color] that affect quests, items and such; even if you have hundreds of these mods active.\r<br />\r<br />[size=3][color=#ffc000]Install / Uninstall[/color][/size]\r<br />Activating or deactivating this interface mod does not affect your savegames at all. It does [u]not[/u] use SKSE. The load order should not matter either.\r<br />\r<br />[b]Installing[/b]\r<br />Use Wrye Bash, or Nexus Mod Manager. It’s just one file so you can also unzip the archive and place the file in your Skyrim/Data/Interface folder.\r<br />\r<br />[b]Uninstalling[/b]\r<br />Simply delete the file, or rename it to “_messagebox.swf” (for example) to disable it temporarily.\r<br />\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/hXQSy.png[/img][/url][/center]\r<br />\r<br />[size=3][color=#ffc000]Change Log[/color][/size]\r<br />[b][color=#b6d7a8]Version 1.2[/color][/b]\r<br />[list][*]Added the ESCAPE key functionality (see updated features list).\r<br />[*]Added &#34;Done&#34; to the list of exit buttons recognized by the TAB and ESCAPE keys, as in eg. Forgotten Mastery mod (thanks assterixxx).\r<br />[*]Includes a function necessary for compatiblity with future mod(s). This code is otherwise dormant and has no performance impact.\r<br />[/list][b][color=#b6d7a8]Version 1.1[/color][/b] - This update fixes an issue where the focus was not always shown on the first button (ie. Disenchant confirmation &#34;Ok&#34; button). This update has been tested with both keyboard and gamepad. Thanks to 3012 and assterixxx for reports.\r<br />[b][color=#b6d7a8]Version 1.0[/color][/b] - First release.\r<br />\r<br />[size=3][color=#ffc000]Other Interface Mods[/color][/size]\r<br />Check out my other interface mod [url=http://skyrim.nexusmods.com/mods/27371]Better Dialogue Controls[/url].\r<br />\r<br />[size=3][color=#ffc000]Credits[/color][/size]\r<br />This mod is possible thanks to the [url=https://github.com/Mardoxx/skyrimui]SkyUI team[/url]’s efforts to decompile and clean up the interface code, plus making it available on Github. Thank you&#33;\r<br />\r<br />[size=3][color=#ffc000]Copyright Notice (for Steam Workshop)[/color][/size]\r<br />© Copyright 2012-2015 Fabrice D. This item is not authorized for posting on Steam, except under the Steam account named [url=http://steamcommunity.com/id/ecirbaf]ecirbaf[/url].\r<br />[color=#888888]I do not claim authorship of anything else than this mod’s particular changes.[/color]",
  "categoryId": "42",
  "version": "1.2",
  "author": "ecirbaf",
  "createdUnix": "1355252618",
  "updatedUnix": "1355620315",
  "containsAdultContent": false,
  "uploadedBy": "ecirbaf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "104881",
      "name": "Better MessageBox Controls v1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17",
      "fileName": "Better MessageBox Controls v1_1-28170-1-1.zip",
      "uploadedUnix": "1355355689",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/52959ddea364222b19adeb2dfdd201cf214898bd6bf52ea063fc2636c0c8690d/analysis/1407302180/",
      "changelogHtml": " Fixes an issue where the focus was not always shown on the first button (ie. Disenchant confirmation \"Ok\" button). This update has been tested with both keyboard and gamepad. Thanks to 3012 and assterixxx for reports. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20MessageBox%20Controls%20v1_1-28170-1-1.zip?fid=104881&ttl=1535801398&ri=8192&rs=8192&setec=1b5470570f84201319e9db4aceb75b57"
    },
    {
      "fileId": "105432",
      "name": "Better MessageBox Controls v1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "Better MessageBox Controls v1_2-28170-1-2.zip",
      "uploadedUnix": "1355620315",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/2e4313f35540cb9018b1d987b3d9337e11808981426e033c3332ad6ca383c922/analysis/1407306463/",
      "changelogHtml": " Added the ESCAPE key functionality (if SKSE is enabled, see updated features list). <br/> \n Added \"Done\" to the list of exit buttons recognized by the TAB and ESCAPE keys, as in eg. Forgotten Mastery mod (thanks assterixxx). <br/> \n Includes a function necessary for compatiblity with future mod(s). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20MessageBox%20Controls%20v1_2-28170-1-2.zip?fid=105432&ttl=1535801399&ri=8192&rs=8192&setec=f94dd35b9b8b4ea4bd635f1be2f463b1"
    }
  ]
}