{
  "modId": 28196.0,
  "modName": "Arods Better Containers",
  "summary": "Instantly move [i]any[/i] items from your pack into [i]any[/i] container. Easily Move, Resize, Rename, or Unlock any container... even from other mods! Stow your gear or open a chest in your home from anywhere else. Craft your own containers to add permanent new storage to any location. \r\n ",
  "descriptionHtml": "Instantly move [i]any[/i] items from your pack into [i]any[/i] container. Easily Move, Rename, or Unlock any container... even from other mods! Stow your gear or open a chest in your home from anywhere else. Craft your own containers to add permanent new storage to any location. \r\n\r\nArod\\'s Storage Solutions will forever improve your Skyrim experience. It works on any chest, barrel, pouch, sack or other container, and with any item you can put in your backpack, even if they came from third party mods. Supports Dragonborn, Dawnguard, and Hearthfire DLCs as well. \r\nWorks with 100% pure vanilla Skyrim. SKSE or other third-party enhancement software is [i]NOT[/i] required.\r\n\r\n[img]http://i.imgur.com/m24Q6.png\\\"[/img]\r\n\r\nFrom Ka3m0n of [url=\\\"http://skyrimgems.com\\\"]GEMS[/url]:\r\n \\\"I now have several (too many?) mods that attempt to automate item storage but this has one of the most flexible approaches. Great mod! \\'Arods Inventory Control Spells\\' is now featured on [url=\\\"http://skyrimgems.com\\\"]GEMS[/url] under category 120 - UI - Timesavers.\r\n\r\n________________________\r\n [b]WHAT IT DOES:[/b]\r\n________________________\r\n [b]Smart Containers:[/b]\r\nStop clicking! Instantly transfer easily customizable sets of items from your pack into targeted containers. One click puts all your Smithing supplies in your smithing chest, your Ingredients into your Alchemy pack, and your extra food into the kitchem. Best of all, YOU decide which items go into which containers... even if the items or containers come from other mods! Choose from any of 50 Presets, or teach any chest specific items to stash.\r\n\r\n[b]Remote Opening:[/b]\r\nForget something at home, but you\\'re stuck in Sovengarde or Oblivion? Remotely open any of up to 6 chests from anywhere in the universe... they don\\'t even have to be owned by you!\r\n\r\n[b]Remote Stashing:[/b]\r\nOverencumbered, and miles from a town? Cast just one spell and all your excess items instantly sort themselves and teleport into your containers at home!\r\n\r\n[b]Rename Containers:[/b]\r\nRename that generic \\\"Barrel\\\" and \\\"Chest\\\" and \\\"Sack\\\" in your home to \\\"Fish Barrel\\\" and \\\"Toys\\\" and \\\"Filled Soulgems\\\". Over 60 options to choose from, with more added in each new release. \r\n\r\n[b]Craft Containers:[/b]\r\nMake your own Barrels, Chests, Safes, Strongboxes, and more! Install them in any house, anywhere you want! No limits and no restrictions: all the storage you could ever need, anywhere.\r\n\r\n[b]Move Containers:[/b]\r\nDon\\'t like that Barrel by the fireplace? Move it to the bedroom! Tired of walking all the way to the Guildmaster\\'s chest? Move it to the exit! Don\\'t feel like fighting the dragon? Summon his loot chest to your hiding spot while he\\'s sleeping! Best of all, since chests and barrels are heavy, you can use them as weapons, knocking over enemies.\r\n\r\n[b]Remote Unlock spells:[/b]\r\nWhat did your mother tell you... STOP PICKING! But this one\\'s a little different than your standard unlock spell, and a lot more fun to use... use telekinesis to guide a lockpick to the distant chest. If your Alteration and/or Lockpick skills are high enough, it opens automatically, or you can pick it yourself from a distance, and watch the items teleport into your pack.\r\n\r\n________________________\r\n[b]LESSER POWERS[/b]\r\n________________________\r\n\r\nLesser Powers are given to you automatically when you activate this mod, at startup. All are activated by selecting  the Power, then using the Voice key while pointing at a chest, barrel, or other container.\r\n\r\n[b]Container: Stash[/b]\r\nThe Soul of Storage Solutions: simply point at a chest, cast this Lesser Power, and suddenly all the items the chest  has previously \\\"learned\\\" (see [b]Container: Configure[/b]) will transfer from your backpack into the container. Up to 50 containers  may be taught differing sets of items to store.\r\n\r\n[b]Container: Stash All[/b]\r\nNo time to teach? This Stash variation is brute-force, no-frills, no setup: removes everything that you\\'re not  currently wearing, and dumps it in the targeted chest, instantly. Make sure you grab your arrows and lockpicks before going back out  again. If your gear is enchanted, you may need to take it off and put it back on again to get the chants to take effect again.\r\n\r\n[b]Container: Configure[/b]\r\nThis Lesser Power is the Mind behind Storage Solutions. When cast, a menu will appear allowing you to alter many  properties of the targeted container, including its location, name, the kinds of items that it \\\"Automagically\\\" stores for you, and  whether or not it can be used remotely.\r\n\r\nConfiguration - Teaching Containers What To Stash\r\n________________________\r\n\\\"Teach Items\\\" tells the container what type of items to accept when you cast \\\"Stash\\\" or \\\"Remote Stash\\\". You have two  options here: teach it to store items like those currently inside it, or teach it a \\\"Preset\\\" of common items such as \\\"Ingredients\\\"  or \\\"Magic Weapons\\\". Once taught, the container will automatically remove the items it has learned from your inventory when you cast  a \\\"Stash\\\" spell. Learning is cumulative: you can recast Teach as many times as you want on the container, and each time it will  learn more items to stash for you.\r\n\r\n\\\"Forget Items\\\" is the opposite of Teach: It tells the container to stop stashing the items that are currently inside it. For  example, you could Teach a chest to store All Ingredients, using a Preset, then place a Giant Toe inside the chest, and cast Forget.  The chest will now stash all ingredients except Giant Toes.\r\n\r\n\\\"Forget All\\\" wipes the containers memory completely: it will no longer stash any items for you until you Teach it something new.\r\n\r\nConfiguration - Moving Containers Around\r\n________________________\r\n\\\"Move\\\" is most effective inside your house, but can be useful elsewhere too. It allows you to move any container to a new position  in the same general location (house, dungeon, etc). The quickest method is to simply stand where you want the container to move to,  and select \\\"Move to Me\\\". The targeted container will float over to your position, permanently. You can then adjust the container to  a perfect position and rotation using the \\\"Nudge\\\" option. \\\"Speed\\\" controls how far the container moves/rotates with each \\\"nudge\\\". \r\n\r\n\r\nConfiguration - Renaming containers\r\n________________________\r\n\\\"Rename\\\" is pretty straightforward. Once selected, a menu similar to the Gift menu will appear, allowing you to  choose a new name for the targeted container. Once you are satisfied, close the menu by hitting the Tab key. Feel free to post your  suggestions for new names on this mods Nexus or Steam site.\r\n\r\n________________________\r\n[b]SPELLS:[/b]\r\n________________________\r\n\r\nThe mod also adds some powerful Alteration spells for the more magically inclined. You\\'ll need to find them first -  check the darker corners of the guilds. There are three copies of each spellbook floating about the world.\r\n\r\n[b]Container: Remote Stash[/b]\r\nDeep in a dungeon and overencumbered? Simply wave your hand and Stash unnecessary items into any number of selected  containers across the world.\r\n\r\n[b]Container: Remote Open[/b] \r\nDeep in a dungeon and out of supplies? Open any of 6 designated chests from anywhere in the world, just like you  were standing in front of them. Setup requires the one-time sacrifice of a unique, flawless gemstone which is used to identify which  chest to open when remote Open is cast (e.g. \\\"Open the \\'Diamond\\' Chest\\\").\r\n\r\n[b]Nightblade\\'s Grasp[/b]\r\nA powerful telekinetic spell for mages with sticky fingers, Nightblade\\'s Grasp quietly manifests a remote-controlled  lockpick, allowing the caster to pick a container\\'s lock from a great distance and loot the contents via telekinesis... hopefully while nobody is looking. If your combined  Alteration and Lockpick skills are high enough, the lock will even open automatically. Distance affects success as well.\r\n\r\n[b]Telekinetic Chest Mover[/b]\r\nNot concerned with stealth? Still want that chest waaay over there that\\'s guarded by a troll? Use telekinesis to pull the entire chest towards you, knocking him off a ledge in the process, then loot it just before it boomerangs back into place, knocking his buddies over that have shown up to investigate. \r\n\r\n________________________\r\n[b]CRAFTING:[/b]\r\n________________________\r\nYou\\'ll find patterns for Barrels, Chests, Strong Boxes, and Safes at any Smithy, under the \\\"Miscellaneous\\\" Tab.\r\n\r\nOnce crafted, you\\'ll gain a temporary Lesser Power that allows you to place the crafted container(s) anywhere you want, or you can  simply look at the spot you wish to place it, and drop one. You can only drop one of these containers at a time. Note that this is  not just dropping: you can actually toss the item a fair distance, where it will land upright, usually facing you.\r\n\r\nOnce dropped, a container may not be picked up again (at least in this version), but its position and rotation can be altered at any  time thereafter using the \\\"Container: Move\\\" spell described above.\r\n\r\nDropped containers are permanent and safe to put items into when dropped in a location owned by the Player, such as a your house.  They can be dropped in other locations but their permanence is not guaranteed, nor is the safety of items placed inside them. In  general, third-party housing mods and Heathfire housing are perfectly safe to add any number of new containers to.\r\n\r\nWarning: As with \\\"Move\\\", NPCs, in general, will not understand if a container is placed in a place they wish to walk, or blocks off  an item they wish to use, such as a door. This can be quest-breaking, so be careful about placement, unless you really are trying to  confuse them. Note that this confusion generally only occurs when the player is looking: if you turn away or leave the area they  will usually find their way again.\r\n\r\n_________________________________________\r\n\r\nMy other Mods:\r\n\r\nFishing In Skyrim - Working Fishing Poles, Nets, Detect Fish Spells, Boomfishing, Regional and Bait-Preferred Fishing, and More! \r\nhttp://skyrim.nexusmods.com/mods/16139\r\n \r\nArod\\'s Alchemical Analyzer - Lore friendly and balanced Ingredient learning. Works with 3rd party mods! \r\nhttp://skyrim.nexusmods.com/mods/27669/\r\n \r\nGuide to Crafting Bookset - Alchemy, Smithing, Enchanting made easy! Create mega-gear without cheating! \r\nhttp://skyrim.nexusmods.com/mods/16132\r\n \r\nLonger Duration Crafting Potions - As it says... longer times for slower typists. \r\nhttp://skyrim.nexusmods.com/mods/16140\r\n\r\n",
  "categoryId": "79",
  "version": "1.40",
  "author": "Arod Snaux",
  "createdUnix": "1355306733",
  "updatedUnix": "1366777737",
  "containsAdultContent": false,
  "uploadedBy": "Arodicus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014937",
      "name": "Hearthfire Support",
      "version": "1.01",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "Hearthfire Support-28196-1-00.7z",
      "uploadedUnix": "1362372103",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/1fb70d58427bd49380d84f965473cba6dd86ad3ac96a821a1c5d9a9b0216eb3b/analysis/1407452163/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfire%20Support-28196-1-00.7z?fid=1000014937&ttl=1535801435&ri=8192&rs=8192&setec=131f942536cb1b5130794d17dbe42a4e"
    },
    {
      "fileId": "1000016261",
      "name": "Dragonborn Support",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "Dragonborn Support-28196-1-0.7z",
      "uploadedUnix": "1362858282",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/999d9d58044a8addc3d98dda7babd1fdb2fd5b69bc92e8bd96866267618e737c/analysis/1407461312/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Support-28196-1-0.7z?fid=1000016261&ttl=1535801435&ri=8192&rs=8192&setec=838bc852771931f11ef98546bb847235"
    },
    {
      "fileId": "1000016663",
      "name": "Arods Better Containers LITE",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "72",
      "fileName": "Arods Better Containers-28196-1-03.7z",
      "uploadedUnix": "1362979007",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/371c949ad43f09af3d3fff415a0b63fa8eef0de1473715bec6ec698d2bbd8b84/analysis/1407464108/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arods%20Better%20Containers-28196-1-03.7z?fid=1000016663&ttl=1535801436&ri=8192&rs=8192&setec=5a011a4dbc06850e9e9e76eb672abcfb"
    },
    {
      "fileId": "1000024340",
      "name": "Arods Better Containers",
      "version": "1.30",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "684",
      "fileName": "Arods Better Containers-28196-1-30.7z",
      "uploadedUnix": "1365936222",
      "modVersion": "1.30",
      "virusScanUrl": "https://www.virustotal.com/file/c345f96fee855ec26a07d535691bfb4a47e1a956db9a8141bc2d244da58e9b53/analysis/1407521468/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arods%20Better%20Containers-28196-1-30.7z?fid=1000024340&ttl=1535801436&ri=8192&rs=8192&setec=8c41864f1ae01ede4d31a71a1502f7cf"
    },
    {
      "fileId": "1000024517",
      "name": "Dawnguard Support",
      "version": "1.01",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Dawnguard Support-28196-1-01.7z",
      "uploadedUnix": "1365993150",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/68fd274738fc518256d68fd852bfdc8dd45a2692dc4e3e82a5ca929dbd42ee8b/analysis/1407522786/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnguard%20Support-28196-1-01.7z?fid=1000024517&ttl=1535801436&ri=8192&rs=8192&setec=ede1d34761d3066a45b43b56a4d4ed34"
    },
    {
      "fileId": "1000024913",
      "name": "Arods Better Containers",
      "version": "1.33",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "684",
      "fileName": "Arods Better Containers-28196-1-33.7z",
      "uploadedUnix": "1366185834",
      "modVersion": "1.33",
      "virusScanUrl": "https://www.virustotal.com/file/bc7e4f141a776bbf9c93cf783c4cb84ccd9b7baa3a0aff99d70b23c6be6bfa3d/analysis/1407526567/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arods%20Better%20Containers-28196-1-33.7z?fid=1000024913&ttl=1535801437&ri=8192&rs=8192&setec=31027fba49231d16d86a0c7fdfc30e77"
    },
    {
      "fileId": "1000025384",
      "name": "Fishing In Skyrim Patch",
      "version": "1.03",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Fishing In Skyrim Patch-28196-1-03.7z",
      "uploadedUnix": "1366422364",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/1caaea6ec82f108043897edd16e3503fbbf6f65e225c2fd1a5a00ad6afc309d9/analysis/1407530402/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fishing%20In%20Skyrim%20Patch-28196-1-03.7z?fid=1000025384&ttl=1535801437&ri=8192&rs=8192&setec=664c71a4401d9cb8865d1ee1b47e0121"
    },
    {
      "fileId": "1000026147",
      "name": "Arods Better Containers",
      "version": "1.40",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "685",
      "fileName": "Arods Better Containers-28196-1-40.7z",
      "uploadedUnix": "1366777737",
      "modVersion": "1.40",
      "virusScanUrl": "https://www.virustotal.com/file/1ef0858c91256a9795d26e5044ad997b9d36f86728e22055807ffe08e59d213f/analysis/1407537251/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arods%20Better%20Containers-28196-1-40.7z?fid=1000026147&ttl=1535801438&ri=8192&rs=8192&setec=e1a4319df8efed137fa9ea78091d6899"
    }
  ]
}