{
  "modId": 28215.0,
  "modName": "Labyrinthian Restored",
  "summary": "This Is a huge WIP to restore Labyrinthian To Its Former Glory.\r\n-A Tundra Defence Building Space.",
  "descriptionHtml": "First Of All English Is not my mother language so go easy on my grammer stuff.\r\n\r\nI Made This to get rid of all that stupid junk over Labyrinthian To be able to use tundra defence with the place.\r\nThe place had Many many bugs winch kinda bugged me very very hard.\r\nSo i asked someone to do this and the guy just kinda crapped out so i decided to do it myself.\r\n\r\n=Features : \r\n\r\n-Minor Bug Fixes Inside Labyrinthian\r\n\r\n-Flattened Space For Buildings To Fit[Check Screenshots]\r\n\r\n-Future updates will Tottaly Alter The Weather - The next update will most likely bring a clear clean weather with no blizzards.\r\n\r\n-Will Include A Questline to bring a sonvagrde portal at Labyrinthian.\r\n\r\n-Will open trade routes to Labyrinthian- will probably let you request trade carts / supplies / mercenaries winch you might even stumble upon when traveling.\r\n\r\n-This Mod Is Fully Compatible With Tundra Defence Scripts.\r\n\r\n-Fully Navmeshed Area Thanks to bethesda.So it works even if you put the tundra defence boundries outside the Labyrinthian.the enemies will climb the stares and get to the well.[this can be done using the advanced building feature of tundra defence]\r\n\r\n---------------------------\r\n-I Highly Urge You To Check Out Tundra Defence Mod By Elderwind.It is Most \\'\\'AWSOME\\'\\'\r\n-Tell me if any bugs or something.\r\n-This Mod Is not complete and at very early stage so i advice you to think before bragging about what this does.[check the screenshots first]\r\n-I will not be updating this day-to-day so dont expect this to just flurish out of nowhere =D.\r\n-Keep in mind that all the buildings in the pictures exepct for the camp are from tundra defence and are not standalone within the mod.\r\n\r\n-Thanks to The comments i found out it was not lyberanthuin and it was \\'\\'Labyrinthian\\'\\' But what the hell lets just go with lyberanthuin =)).",
  "categoryId": "53",
  "version": "0.1",
  "author": "Kutsujutsu",
  "createdUnix": "1355344413",
  "updatedUnix": "1355344694",
  "containsAdultContent": false,
  "uploadedBy": "kutsujutsu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "104843",
      "name": "Lyberanthuin Restored",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Lyberanthuin Restored-28215-0-1.rar",
      "uploadedUnix": "1355344694",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/ffa9f3e42d813ea4464d431f7e398dcba3ea75581cfef3f804e73f712ba96839/analysis/1407301949/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lyberanthuin%20Restored-28215-0-1.rar?fid=104843&ttl=1535801460&ri=8192&rs=8192&setec=17e7c8ea877612c998c2d0627015778f"
    }
  ]
}