{
  "modId": 28220.0,
  "modName": "RaShiir the Khajiit Assassin",
  "summary": "My very first mod, and another companion!",
  "descriptionHtml": "[center][u][b][size=4]Ra'Shiir the Khajiit Assassin[/size][/b][/u][/center]\n<br />[size=3][i]Current issues:[/i]\n<br />[list][*]After marriage, Ra'Shiir's moving in dialogue fails to show up.  I'm currently trying to find a fix for this, until I find the cause, the only thing I can recommend is to talk to him a couple of times to try and trigger it that way.\n<br />[/*][*]His \"What have you got for sale?\" dialogue option doesn't work correctly so he won't sell you normal miscellaneous items like other Skyrim spouses.  Again, I'm currently trying to figure out a fix for this.\n<br />[/*][/list][/size]\n<br />I'd just like to take the time to apologise for any problems people may be having, I'm still a bit of a rookie when it comes to more advanced Creation Kit features.  Thanks to everyone for the endorsements! I never expected to get double digits with this little mod, I'm glad you're enjoying his company :D\n<br />\n<br />[center]~*~*~*~*~*~[/center][size=2][list]\n<br />[*][size=2][b]Update 03/03/2013: [/b]For people having Ra'Shiir disappear randomly in their game e.g. he's not in the Winking Skeever where he should be, it turns out that this is a common problem with custom made followers and a fix has been stickied in the comments section. [/size]\n<br />[*][size=2][b]Update 21/01/2013: [/b]Version 1.2 has been uploaded, for some reason my version of the .esp never had the recent changes, so this is essentially just a re-upload that (hopefully) contains working marriage and stealth meter changes. [/size]\n<br />[*][size=2][b]Update 18/01/2013: [/b]Changed around the files in the download section, the newer version of Ra'Shiir is at the top now.  Please make sure to uninstall the original \"Main File\" version before using this updated one, as it is now obsolete :)[/size]\n<br />[*][size=2][b]Update 05/01/2013: [/b]As of today, Ra'Shiir has now been updated to be a marriage option! I also took out a couple of items from his inventory and ticked his stealth meter box to benefit stealthy players. Have fun![/size]\n<br />[/list][/size]\n<br />[center]~*~*~*~*~*~[/center]\n<br />It's my very first mod, so please be gentle :P\n<br />\n<br />I noticed there are a few Khajiit companions/NPCs but they always seem to be the same colour, with not much variation.  So I decided to upload my own custom companion that I use in my own game :3\n<br />\n<br />His name is Ra'Shiir and he is my own Khajiit Dragonborn's half-brother.  He never saw eye-to-eye with his stepfather and walked out when he was in his early teens, where he travelled on his own and met a young Wood Elf who taught him the basics of wilderness survival and archery.  As the years went by he eventually reunited with his real father and honed his skills to become a deadly Assassin to make a living for himself.  His work took him all across Tamriel until he decided to take a brief break in Skyrim for personal reasons, it's in Solitude that his sister finally finds him again, and he decides to travel with her despite her resentment for all the years he left her alone.\n<br />\n<br />You can find him in the Winking Skeever in Solitude, just turn right as you go into the tavern.\n<br />\n<br />He specialises in dual wielding daggers and archery, also, being a Khajiit and an Assassin, he's very light-footed and will not affect your stealth meter or trigger any nasty traps.  He also levels with you.\n<br />\n<br />He starts out with Master Thieves Guild armour just because I didn't like how skin-tight the Dark Brotherhood armour was, but if you're using UFO (Ultimate Follower Overhaul) or EFF (Extended Follower Framework) then you can simply use the commands within to remove the base clothing and give him something else if you so wish.\n<br />\n<br />EDIT: I also forgot to mention that he holds a special unique item in his inventory: Ji'Dari's Amulet, which has a high Sneak enchantment.  I initially added this to him just so I could use it for my Dragonborn and I forgot to take it out before I uploaded him, but feel free to use it however you want xD\n<br />\n<br />[i]Armour mods I recommend for him are:\n<br />[/i]Zerofrost's [url=http://skyrim.nexusmods.com/mods/25476]Evil Mastermind Armor[/url] and\n<br />Maymay1588's [url=http://skyrim.nexusmods.com/mods/26953]Ire of the Shadows Armor[/url]\n<br />\n<br />[i]Appearance Mods I recommend using for him are: \n<br />[/i][url=http://skyrim.nexusmods.com/mods/5941]Coverkhajiits[/url] and [url=http://skyrim.nexusmods.com/mods/4869]Covereyes[/url] by mrLenski or\n<br />[url=http://skyrim.nexusmods.com/mods/25752]Iridum Eyes - Mer and Beast[/url] by Halendia\n<br />\n<br />He's compatible with everything as far as I know (I run a LOT of mods on my game) but if there is a problem, please highlight it in the comments and I'll do my best to try and help.  Let me know what he gets up to in your game as well, send me pictures, I'd love to see!\n<br />\n<br />If I get enough spare time and motivation, then I have plans to update him with a quest, but that will be some time away yet.\n<br />\n<br />To install you can extract the file manually into your Skyrim&gt;Data folder or you can simply use the NMM to install him that way.\n<br />\n<br />Thank you and enjoy!\n<br />\n<br />~Credits~\n<br />Bethesda for making such an amazing game!\n<br />The Nexus community for sparking my imagination\n<br />\n<br />Please don't redistribute without my permission, kthanx :3",
  "categoryId": "66",
  "version": "1.1",
  "author": "Dark_Rogue21",
  "createdUnix": "1355349533",
  "updatedUnix": "1358786973",
  "containsAdultContent": false,
  "uploadedBy": "Darkrogue21",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004010",
      "name": "RaShiir Main",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "138",
      "fileName": "RaShiir Main-28220-1-2.7z",
      "uploadedUnix": "1358786973",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/1d0fc24eaecac5cb402a3ede39885e80ec024ebb20591ce1a64482ee88244594/analysis/1407372129/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RaShiir%20Main-28220-1-2.7z?fid=1000004010&ttl=1535801467&ri=8192&rs=8192&setec=f063c5f53abe6a1e3721bab5da663a8d"
    }
  ]
}