{
  "modId": 28231.0,
  "modName": "Dragonheart Sanctuary Ver_1",
  "summary": "Welcome to a Sanctuary in a world apart, somewhere between Skyrim and Sovngarde. Built for the first Dragonborn Emperor Tiber Septim. And bequeathed to the heirs of the Dragonblood...\r\n\r\nSome house mods SAY they have it all, this one really does. ~300 weapon storage plaques ~50 Shield plaques ~50 Mannequins. Individual rooms can be homes unto thems",
  "descriptionHtml": "(Note: After a certain point I stopped counting how many of the individual features I actually included. There\\'s more than this Description will list.)\r\n\r\nWelcome back to the Night Land of Skyrim - Sovngarde. Emperor Tiber Septim commissioned a stonemason to build him a Sanctuary in a world somewhere between Sovngarde and Skyrim. At the end of the Path Through the Stars, starting from the top of the highest peak of the tallest mountain in Skyrim, the portal to Dragonheart Sanctuary awaits. Tiber Septim has indeed moved on to the eternal home of the Gods, and he has bequeathed his Sanctuary and his hopes for the Empire, to you. \r\n\r\nThe builders asked, \\\"In a word where it never rains, who needs a ceiling?\\\" Their answer? No one. The result was absolutely magnificent. Every room is walled in by mountain peaks, and limited only by how tall the Stonemason dared to build.\r\n\r\nThis is a home designed for the Adventurer to showcase their souvenirs and trophies and to store anything and everything they could possibly imagine. Not only that, they can revisit relics from many of their most memorable adventures.\r\n\r\nWe daresay that almost every room in this Sanctuary can be a home unto itself depending on your specialty.\r\n\r\nHere\\'s a list of House amenities:\r\n\r\nNote: These numbers will likely go up as I add new spaces.\r\n\r\n- 2 Horses to help you get around the Sanctuary (complete with a stable).\r\n- 54 general-purpose Mannequins\r\n- 2 Mannequins for displaying Daedric Artifacts\r\n- 10 Mannequins to display Dragon Priest Masks\r\n- 9 Mannequins to display Guard Armour with 2 Weapon Plaques nearby for each\r\n- 10 pillars meant as places for Advanced Mannequins (requires an awesome, separate mod)\r\n- 98 Bow Plaques (mounted perpendicular on the walls of the Armoury)\r\n- 18 Staff Plaques\r\n- 80 Weapon Plaques\r\n- 76 Shield & Weapon Plaques - which means storage for 76 Shields and 152 Weapons\r\n- 48 Storage Chests\r\n- 7 Lockboxes (minimum)\r\n- 1 Skyforge\r\n- 1 Smelter\r\n- 6 Alchemy Tables, each with a Recipe Chest and 2 or 3 Ingredient Satchels\r\n- 6 Enchanting Tables, each with 2 Soul Gem Satchels and storage for Weapons, Armour and, depending upon the room, Books as well\r\n- 1 Throne \\'Room\\'\r\n- 1 Dining Area\r\n- 4 Cooking Pots & Fires\r\n- Cave Garden with mushrooms, glowing mushrooms, salmon, chaurus eggs, spider eggs and some blue Blackreach mushrooms for good measure\r\n- 3 Bodies of Water\r\n- 3 Waterfalls (one indoors & underground)\r\n- 22 display cases (located in the library and meant for modder-placed artifacts only – store stuff in them at your own risk) \r\n- 188 bookcases (ridiculous, I know)\r\n- 4 Special Collection Bookcases on the top floor of the Library (avoid using these for storage. I will use these to add content and this may cause inventory loss)\r\n- 6 Shrines to Julianos in the Library\r\n- 1 Shrine to Nocturnal in the Library by the Waterfall\r\n- 6 (?) Geode Veins in the Cave Garden\r\n- A Path Through the Stars to reach the Sanctuary (just follow the stars)\r\n- Save before trying to scale the path. It can, and if you\\'re not careful, WILL kill you. This means Hellion Arrows are no longer needed to get in, but they will still be necessary to access the highest floors in the Armoury and Library.\r\n- A temple in the Living Quarters where you can pray to a god or meditate on the teachings of one as is appropriate for the area of life they govern\r\n- 1 Bed\r\n- 2 study areas (One in the Library, the other in the Living Quarters)\r\n- Lots of places to grab both kinds of Nirnroot\r\n- Barnacles and Clams in the pool in the Forge\r\n- Lots of Hanging Moss in the Library and Atrium\r\n- Also Tundra Cotton and Giant Lichen in the Library\r\n\r\n- A book explaining the ins and outs of each room\r\n- A readily available Skyrim Map Marker (Dragonheart Sanctuary) at the top of the Throat of the World (so you can teleport directly there without disturbing your nearby neighbour, Paarthurnax, and any quests he may be related to. Just be careful on the way down...)\r\n- A second unpredictable Map Marker (Dragonheart Sanctuary Island) on the floating island (it’s now a lot higher up than it used to be – further explanation in the book at the top of the mountain)\r\n- The ability to Fast Travel between rooms using a map that looks disturbingly like Skyrim... XD\r\n- >10 (I\\'m too lazy to count right now) completely new Skill Books\r\n- Approx. 5 other books already found in-world have been tweaked to teach you a skill. They can all be found on the fourth floor of the Library in display cases on the centre dais\r\n- The skills I made them teach are ones I don\\'t use often. \r\n- A book with a short list of item codes for console spawning of regularly needed smithing materials. Also contains codes for most of the stuff you\\'ll need for Hellion Arrows :D\r\n- 2 copies of a book containing all the Treasure Maps I could find for the game called ‘Secrets of Skyrim’, also found on the top floor of the Library in one of the end display cases.\r\n- Books with handy information for your travels around Skyrim (like which kinds of dwemer metal can be melted down and which can\\'t)\r\n- Recipe Book with extremely potent potions I\\'ve discovered and used to boost my Alchemy skill to 100\r\n- 2nd ed. of \\'Nature of Nirn\\' with console spawning codes for all alchemical ingredients, even some that are supposed to be coming in Dawnguard! *dies of anticipation* *is resurrected* ;p\r\n\r\nUpcoming:\r\n\r\n- Full, handmade navmesh\r\n- Hopefully, followers will keep following you\r\n\r\nPlease Note:\r\n\r\n- Another mod is an absolute necessity to teleport up to higher floors of the Armoury, Library & Living Quarters. \r\n\r\n- If anyone knows of a walkthrough for creating dynamic bookshelves, point me that way. That was my original hope for the Library.\r\n\r\n- Leaving your follower or spouse at another safe location before visiting the top of the world is recommended, to avoid random disappearance and untimely deaths. (This applies less now as you can simply tell your follower to wait by either of the map markers, but there could still be glitch risks, so officially, the advice stands.)\r\n\r\n- This mod isn\\'t follower friendly yet. If anyone wants to point me toward a way to solve this problem, I\\'d be delighted to fix it. I want my followers with me as much as you do. \r\n\r\n- The Armoury is so full of visible display plaques and mannequins you\\'ll likely experience some some jitter when moving around. I\\'ve uploaded a picture of my Advanced>View Distance settings. \r\n\r\n- The Horse in the screen shots belongs to the Ethereal Horses mod and this is an excellent mod also. This mod elegantly solves the problem of regularly dying/disappearing horses!\r\n\r\n- This is a WIP (work-in-progress). I will never add a new room that is only half functional. I may go back in later and add more greenery and rocks just to make it look more like a fertile mountain valley, but I won\\'t add, move or delete storage unless a mod-breaking problem is encountered (Library excepted but I believe I’ve made it sufficiently clear which cases shouldn’t be used to store your own items).\r\n\r\n- I\\'m always open to suggestions for improvements, and I definitely want to know if something has gone wrong. Feel free to leave your comments with me and I\\'ll try to fix anything I can. Some things are beyond me, though. This is my first mod ever. \r\n\r\nLastly, I always thought it was a crying shame a place as beautiful as Sovngarde was only ever seen once for a short time. Now you can visit any time you wish! Enjoy!\r\n\r\nv0.0 - First WIP Release.\r\n\r\nv0.1 – Second WIP Release\r\n- Library added\r\n- Armoury tower floor gaps fixed\r\n- Now with two Skyrim map markers – ‘Dragonheart Sanctuary’ and ‘Dragonheart Sanctuary Island’ (This marker literally ‘floats’ all over the place)\r\n- Forge rock cliff gap fixed\r\n- DhS v1 book updated\r\n- DhS v5 & 6 added (Both teach skills)\r\n\r\nP.S. If you believe this to be worth spreading around and sharing, don\\'t forget to rate the mod so more poeple can find it!",
  "categoryId": "67",
  "version": "",
  "author": "Shorya Dragonheart",
  "createdUnix": "1355357491",
  "updatedUnix": "1355357716",
  "containsAdultContent": false,
  "uploadedBy": "Shorya",
  "primaryFile": null,
  "files": [
    {
      "fileId": "104888",
      "name": "DragonheartSanctuaryWIP",
      "version": "WIP",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1043",
      "fileName": "DragonheartSanctuaryWIP-28231-WIP.zip",
      "uploadedUnix": "1355357716",
      "modVersion": "WIP",
      "virusScanUrl": "https://www.virustotal.com/file/dbb856b20cd11978d402eecd693a3e998fd560020de6296e8e496ca14c72aec8/analysis/1407302225/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DragonheartSanctuaryWIP-28231-WIP.zip?fid=104888&ttl=1535801481&ri=8192&rs=8192&setec=9f23d47b8fbaaee49b0622d9cca6132d"
    }
  ]
}