{
  "modId": 28274.0,
  "modName": "ENB Improved Tonemapping",
  "summary": "Improved post processing for ENB, written from scratch, with variable day/night/interior settings, better control over saturation (no more gray skies or pea soup fog), and a focus on playability and beauty without the need to tweak environment variables ad nauseum.",
  "descriptionHtml": "Woo~ 200 Unique Downloads! Feels good. (Please don\\'t forget to endorse).\r\n\r\nAny requests for features in the next version? Day/Night/Interior color palettes? Built in test patterns for color/gamma tweaking? Dusk/Dawn specific settings? Leave a comment with what you\\'d like to see and I\\'ll see what I can do.\r\n\r\n[size=+2][b]ENB Improved Tonemapping[/b][/size]\r\nAfter a week or two of (repeatedly) tweaking my enb settings for Skyrim whenever one lighting condition or another just didn\\'t look right, juggling a handful of lighting mods, and installing one alternate enb effect preset after another, I just couldn\\'t find anything that felt right...\r\n\r\nAlmost all the presets I tried [i]could[/i] look absolutely incredible with the right settings, at least for a specific lighting condition, but they required so many tweaks to the environment variables and sky settings that they usually mangled the built in weather conditions/lighting effects, and had to be tweaked repeatedly every time I moved from one environment to another (at least, if I wanted them to look as nice as possible). What looked wonderful under one set of conditions (daylight, outside) would be blinding white, pitch black, or dull and unsaturated in other conditions (say, in snow covered areas, or underground). \r\n\r\nMost presets/effects I tried were wonderful for screenshots, but not so great when it came to playability (at least on my ageing computer/monitor), so I decided to write my own...\r\n\r\n\r\n[size=+1][b]What does it add?[/b][/size]\r\n-- Tonemapping and Saturation controls that don\\'t dim bright colors/white pixels or add too much brightness to darker colors. No more flat washed out shadows or dim gray skies.\r\n\r\n-- Post processing that works well with the vanilla color correction, but doesn\\'t turn everything more than 10 ft. from your face into pea soup if you turn the vanilla color correction off.\r\n\r\n-- Day/Night/Interior settings for the new effects, so you can have the darker (or brighter) nights you want without turning everything into a gray wash during the day, and without touching any of the lighting options in enbsettings.ini (which also means the default weather conditions come out looking just about right, at least most of the time).\r\n\r\n\r\n[size=+1][b]What doesn\\'t it add?[/b][/size]\r\n-- A ton of overhead. On my system (which admittedly is not exactly top of the line), I lost no more framerate using the improved post processing than I did using the default ENB postprocessing (1-4 fps).\r\n\r\n-- Any really flashy, eye catching effects (other than a bit better control over color saturation and lighting). Of course, there\\'s nothing stopping someone from using it with other mods that do add a bit of eye candy though (as can be seen in the screenshots).\r\n\r\n[b][color=#FF4040]Just to reiterate, the eyecandy effects shown in the screenshots for this mod (depth of field, bokeh effects, higher resolution textures, etc.) are not part of the mod. This mod only improves the saturation and tonemapping effects and gives you more control over each (however, that\\'s still quite a nice improvement, in my opinion at least).[/COLOR][/b]\r\n\r\n[size=+1][b]What\\'s new in the latest version (v1.1)?[/b][/size]\r\n -- Fixed a luminosity bug, no more color artifacts in very bright or very dark conditions.\r\n -- Added a \\\"brightness\\\" curve setting. This should make it easier to replicate certain effects the default ENB postprocessing can provide (particularly the luminous/soft lighting on skin effect).\r\n-- Renamed some settings to make it more clear what they effect.\r\n\r\n[size=+1][b]Installation[/b][/size]\r\nYou will need a copy of ENB for this to do anything, which you can get at enbdev.com. The screenshots I uploaded were taken using v.121212.\r\nOnce you have ENB, download and unzip the Improved Tonemapping file, then drop the two files inside (enbeffect.fx and (optionally) enbseries.ini) into your skyrim directory. Done and done. (If you choose not to use the included enbseries.ini, I would suggest at least copying the [ENVIRONMENT] settings into whatever ini file you do use.)\r\n\r\n\r\n[size=+1][b]Configuration[/b][/size]\r\nThere are three sets of variables (one set each for day, night, and interior) in the enbeffects.fx file (which you can edit with any text editor of your choice) that control the new tonemapping and saturation. When you\\'re outside, the value actually used for the post processing slides smoothly between the day and night values depending on the time of day, so you shouldn\\'t see any abrupt changes at dusk and dawn. When you\\'re inside a building, the day and night settings are ignored and the interior settings are used instead.\r\n\r\nEMinSaturationPower -> The minimum saturation power to use when applying adjustments for lighting. Lower values help skin and cloth look more \\\"luminous\\\" (by lowering their saturation slightly), higher values make colors more vivid in darker lighting conditions. I generally would not suggest raising this above 1.0 unless you are intentionally going for a vivid/oversaturated effect.\r\n\r\nEMaxSaturationPower -> The maximum saturation power to use when applying adjustments for lighting. Higher values help keep very bright colors (like the blue of the sky) bright, and create deeper shadows, but can lead to some oversaturation. I would not suggest lowering this below 1.0 unless you want to desaturate everything on purpose.\r\n\r\nEBrightCurve -> Applies a (fairly strong) curve to luminosity. Values above 1.0 will make everything look softly lit and luminous. Values below 1.0 will make everything look dim and subdued. Either effect will slightly diminish saturation for some colors, but the effect is very small.\r\n\r\nEContrastCurve -> Values above 1.0 will push pixels above the contrast threshold towards white, and those below the threshold towards black. This creates harder shadows, so by default only interior areas have this set above 1.0. Values between 1.0 and 0.0 will move pixels above or below the contrast threshold towards a midtone, decreasing contrast (the exact grey depends on what the threshold is set to). I would not suggest setting this higher than 2.0 or below 0.5, or the effect will become fairly overwhelming. Setting this to exactly 1.0 will disable the contrast effect.\r\n\r\nEContrastThreshold -> The luminosity at which the contrast curve changes over from a positive value to a negative value (or vice versa, depending on the EContrastCurve setting). 0.0 == 0% luminosity, 1.0 == 100% luminosity. (Finding the right value for this setting can be a bit tricky, you may want to leave it as is).",
  "categoryId": "62",
  "version": "v1.1",
  "author": "Brodiggan Gale",
  "createdUnix": "1355430261",
  "updatedUnix": "1355694376",
  "containsAdultContent": false,
  "uploadedBy": "Brodiggan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105617",
      "name": "ENB Improved Tonemapping",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "ENB Improved Tonemapping-28274-v1-1.zip",
      "uploadedUnix": "1355694376",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/298c23c2a22530483def4d59092b3fca322de327943ec2389dfdfc2f87d9fc72/analysis/1407307806/",
      "changelogHtml": " Fixed a luminosity bug, no more color artifacts in very bright or very dark conditions. <br/> \n Added a \"brightness\" curve setting.  <br/> \n Renamed some settings to make it more clear what they effect. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20Improved%20Tonemapping-28274-v1-1.zip?fid=105617&ttl=1535801555&ri=8192&rs=8192&setec=7dc7185c26721504796ffc119f4e5ae0"
    }
  ]
}