{
  "modId": 28270.0,
  "modName": "Camping Kit of the Northern Ranger - French Translation",
  "summary": "French Translation of Camping Kit of the Northen Ranger by tek_7. \r\nTraduction francaise du mod Kit de Camping du Ranger du Nord par tek_7.\r\n\r\nUn mod qui ajoute un kit pour camper où vous voulez dans la nature. Vous pouvez aussi poser des pièges pour attraper du gibier pendant votre nuit.",
  "descriptionHtml": "[img]http://www.clan-tkcfiles.com/images/ckmod.png[/img]\r\n\r\n\r\n[center][color=yellow]Si vous aimez ce mod et cette traduction, n\\'oubliez pas les endorsements! Ca ne prend qu\\'un clic et ça fait toujours plaisir![/color][/center]\r\n\r\n[center][url=http://skyrim.nexusmods.com/mods/35320][img]http://www.ushareimg.com/images/286T3R.png[/img][/url][/center]\r\n\r\n\r\nCe mod est la traduction française du mod [url=http://skyrim.nexusmods.com/mods/10573]Camping Kit of the Northen[/url] de tek_7. \r\n\r\nRetrouvez d\\'autres mods sur le [url=http://skyrim.nexusmods.com/mods/28680]répertoire.[/url]\r\n\r\nPour suivre mon actualité de traduction de mods: [url=http://www.facebook.com/pages/Traduction-de-mods-Par-Raphou112/455702141160610?]ICI[/url]\r\n\r\n\r\n\r\n[center][i]Vous recherchez du matériel de camping qui n\\'est pas sur-cheaté et qui reste dans l\\'esprit de l\\'univers de Tamriel? Vous voulez que le jeu chasse pour vous pendant que vous dormez? Vous voulez placer votre camp où vous voulez au cours de votre route? Si vous répondez oui à chacune de ces questions, alors ne cherchez pas plus loin !\r\nCe mod est constitué de deux kits de matériel de camping dédiés aux voyageurs et à ceux qui veulent dormir dans la nature. Vous pouvez placer chaque élément de votre camp (tente, sac de couchage, feu…) exactement où vous voulez grâce aux marqueurs et les activer pour monter votre matériel.\r\nIl y a aussi un système de piège qui vous permet de vivre de la nature. Mettez simplement un appât dans votre piège et revenez quelques heures plus tard, pour espérer attraper quelque chose.\r\nAvec la version 1.4, vous pouvez entrer dans votre tente. Vous ne dormirez plus sous la pluie et la neige, mais resterez en sécurité et au chaud dans votre tente et dormirez comme un bébé.[/i][/center]\r\n\r\n[img]http://www.clan-tkcfiles.com/images/header000.png[/img]\r\n\r\n\r\n[b][size=3][color=Darkolivegreen]Que contiennent ces kits?[/color][/b][/size]\r\n\r\n[color=Darkolivegreen]Le kit standard comprend :[/color]\r\n1) Deux sacs de couchage (un pour vous et un optionnel)\r\n2) Une tente\r\n3) Un feu de camp (avec divers animations pour le rôle play)\r\n4) Une marmite\r\n5) Trois chaises de camping\r\n6) Quatre paravents en cuir\r\n7) Un tapis en peau\r\n8) La capacité de créer, appâter et amorcer des pièges pour obtenir des peaux et de la viande\r\n9) La possibilité d’entrer dans votre tente\r\na) La possibilité de configurer l’intérieur de la tente (cliquer sur un tonneau dans la tente pour ouvrir le menu)\r\n\r\n[color=Darkolivegreen]Le kit impérial comprend :[/color]\r\n1) Deux sacs de couchage\r\n2) Une petite tente\r\n3) Un feu de camp\r\n4) Une petite marmite\r\n5) Deux chaises\r\n6) Trois paravents en cuir\r\n\r\n[b][size=3][color=Darkolivegreen]Où trouver les kits? Pourquoi trois versions ?[/color][/b][/size]\r\n\r\nCela dépend de la version que vous utilisez.\r\nSi vous utilisez la version complète (conseillée), rendez-vous au magasin « Ambrebois – Magasin de Camping », près du croisement entre le pont de Rivebois, la route de Blancherive et la route vers le Sanctuaire des Chutes Tourmentées. Parlez à Shamino pour acheter le kit. Avec cette version, vous pourrez également lire trois livres sur la vie de Shamino, sur le camping et sur les pièges.\r\nSi vous utilisez la version alternative, vous devrez acheter les kits de camping à Lucan, au marché de Rivebois.\r\nEnfin, il existe une autre version qui propose juste les kits à ramasser sous l’escalier du Marché de Rivebois.\r\n\r\n[b][size=3][color=Darkolivegreen]Comment utiliser ce mod ?[/color][/b][/size]\r\n\r\nAprès avoir acheté le kit, vous devez cliquer dessus depuis votre inventaire. Un coffre va se mettre au sol. Cliquez dessus et vous verrez que des affaires vont sortir. Ce sont des marqueurs d’objets. Maintenez E (touche action) et placez le marqueur où vous voulez. Quand l’emplacement vous satisfait, appuyer sur E pour positionner le vrai objet. Faîtes cette méthode pour chaque élément de ce kit. Ensuite, avant d’utiliser un objet (une chaise par exemple), il faudra souvent cliquer dessus et sélectionner confirmer la position. Vous devrez également souvent régler la hauteur et l’angle de l’objet. Si vous cliquez sur la tente (standard), une option va apparaître pour entrer dedans. A l’intérieur, vous pourrez personnaliser l’aménagement en cliquant sur le tonneau. Dehors, si vous cliquez sur le coffre, vous pourrez placer des objets supplémentaires ou tout ranger.\r\n\r\n[img]http://www.clan-tkcfiles.com/images/header001.png[/img]\r\n\r\nChoisissez une des trois versions.\r\nCopiez le contenu du dossier data, là où votre jeu est installé (là où vous avez mis Steam).\r\nSoit: ...\\\\Steam\\\\SteamApps\\\\common\\\\skyrim.\r\nActiver les plugins via le mod manager.\r\n\r\nJe vous conseille d\\'utiliser Nexus Mod Manager pour faciliter l\\'installation/désinstallation des mods.\r\nUn tutoriel entièrement en français est disponible ici:\r\nhttp://www.confrerie-des-traducteurs.fr/forum/viewtopic.php?f=183&t=10216\r\n\r\n[center][b][size=7][color=Darkolivegreen]COMPATIBILITE[/center][/color][/b][/size]\r\nCompatible avec Frostfall. Le seul problème est que l’intérieur de la tente ne vous réchauffera pas, sauf si vous mettez un feu dedans.\r\n\r\n[b][size=7][color=Darkolivegreen][center]CREDITS[/center][/color][/b][/size]\r\n\r\nTek_7 pour son super mod et pour m\\'avoir permi de le traduire et de le partager.\r\nBethesda pour ce jeu ainsi que l\\'univers \\\"The Elder Scrolls\\\".",
  "categoryId": "78",
  "version": "1.6",
  "author": "tek_7 Translated by Raphou112",
  "createdUnix": "1355427506",
  "updatedUnix": "1367251175",
  "containsAdultContent": false,
  "uploadedBy": "raphou112",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105034",
      "name": "Camping Kit of the Northern Ranger FR",
      "version": "1.4.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "89",
      "fileName": "Camping Kit of the Northern Ranger FR-28270-1-4-4.rar",
      "uploadedUnix": "1355430790",
      "modVersion": "1.4.4",
      "virusScanUrl": "https://www.virustotal.com/file/0ebdaa1c93c559d5a936d96bca504dcbd4e057e3f2ea986fdaea550c130cb798/analysis/1407303303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Camping%20Kit%20of%20the%20Northern%20Ranger%20FR-28270-1-4-4.rar?fid=105034&ttl=1535801549&ri=8192&rs=8192&setec=fe370155fabf8691b737fa1f423b70c3"
    },
    {
      "fileId": "1000027094",
      "name": "Camping Kit of the Northern Ranger FR",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2695",
      "fileName": "Camping Kit of the Northern Ranger FR-28270-1-6.7z",
      "uploadedUnix": "1367251175",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/eb5867c50678622cb5e83275e5d98e605745f413376315dc6471037a73fba1a9/analysis/1407547106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Camping%20Kit%20of%20the%20Northern%20Ranger%20FR-28270-1-6.7z?fid=1000027094&ttl=1535801550&ri=8192&rs=8192&setec=e0f68c243f2ad82a092eebb743b37dab"
    }
  ]
}