{
  "modId": 28280.0,
  "modName": "Cast on self staff proof",
  "summary": "I was wondering if we could bring back the enchantments where you had to cast them as apposed to just having constant effect enchantments which are nice but they really leave much to be desired in the realm of enchanting.",
  "descriptionHtml": "I was wondering if we could bring back the enchantments where you had to cast them as apposed to just having constant effect enchantments which are nice but they really leave much to be desired in the realm of enchanting. Once you cast with the staff, which is a cast on self enchantment, it completely forgets it\\'s a staff and casts like a regular cast on self spell animation wise. I couldn\\'t have hoped for better results. The idea, which I can\\'t implement as I don\\'t know how to script, is that you would have a item Clothing, jewelry, armor, hell even a weapon and once you picked it up it would add a staff into your inventory with a spell attached to it that was it\\'s enchantment. The staff added doesn\\'t have as model attached to it and by equipping the staff it auto equips it\\'s respective item and vise versa. I had one more thought to add but I kind of lost it.",
  "categoryId": "75",
  "version": "1",
  "author": "Deadman",
  "createdUnix": "1355438334",
  "updatedUnix": "1355438434",
  "containsAdultContent": false,
  "uploadedBy": "mxzero",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105048",
      "name": "Smokestick",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Smokestick-28280-1.rar",
      "uploadedUnix": "1355438434",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/36eeb96249b07a8ba38d510b7b1b7e54ae2f2e6ac43b17360ac025292e8335e1/analysis/1407303367/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Smokestick-28280-1.rar?fid=105048&ttl=1535801569&ri=8192&rs=8192&setec=6dcb322617c71570b31ab01c3a8f2355"
    }
  ]
}