{
  "modId": 28295.0,
  "modName": "Thunril",
  "summary": "A small mod that elaborates on a vanilla quest and in the process gives you a new sword to slash and stab the Thalmor with.",
  "descriptionHtml": "EDIT: 1-18-13   if you had issues with not having a model for the sword, and it didn\\'t show up it was not your fault. I forgot to include the mesh and textures with the  old file. Please re download and try again. \r\n\r\nStats for the sword: base dmg is 40, weight is 10, and value is 700.\r\n-\r\ncan not be forged, as a unique sword should not be able to be replicated. (if you have to have several copies, open the console type in help thunril 4 and use the command player.additem [insert code here]\r\n\r\nThis mod adds a lore-friendly additon to the quest, Missing in Action. The quest itself (the stages and whatnot) has not been touched, so no bugs ro conflicts etc.\r\n\r\nTo start the quest Missing in Action you\\'ll have to talk to Mrs. Gray-Mane in the Whiterun market.\r\n\r\nWhat this plugin does is add a bit more story to the Missing in Action quest by telling it from the viewpoint of Whiterun\\'s former Thane. \r\n\r\nA letter to Jarl Balgruuf from Throngar is on the round table with two chairs in Dragonsreach. To find Throngar himself, and the legendary blade called Thunril you must travel to Northwatch Keep. \r\n\r\nThis is recommended to be done while going thru the Missing in Action quest.\r\n\r\nany personal screenshots are welcome ;) \r\n\r\nPermissions:\r\n\r\n- Anyone can tweak this for there own use, or to make things meet if you have some Dragonsreach changes.\r\n\r\n- No uploading to Steam Workshop\r\n\r\nCredits:\r\n\r\n- Bethesda for Skyrim & the creation kit\r\n\r\n- Urwy for the model and textures that allows Thunril a unique look, from his resource pack http://skyrim.nexusmods.com/mods/12087\r\n",
  "categoryId": "55",
  "version": "0.2",
  "author": "modder3434",
  "createdUnix": "1355477094",
  "updatedUnix": "1355537619",
  "containsAdultContent": false,
  "uploadedBy": "modder3434",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105244",
      "name": "Thunril2",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31310",
      "fileName": "Thunril2-28295-0-2.7z",
      "uploadedUnix": "1355537619",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/7c8d5f4ce027d844d615efa6e1eba0cebc90c5f70d9032e092286a210b6f795b/analysis/1407304657/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thunril2-28295-0-2.7z?fid=105244&ttl=1535801587&ri=8192&rs=8192&setec=b54e128953e0ae595955313bd3e84f61"
    }
  ]
}