{
  "modId": 283.0,
  "modName": "INSS Improved New Skyrim Shadows for Medium-Range PC",
  "summary": "This set of tweaks will improve the quality of Skyrim shadows, making them look more acceptable and overall better. Also, here you can find some additional and useful information about tweaking Skyrim shadows in general.",
  "descriptionHtml": "Hey everyone!\r\n\r\nHere you have my new SkyrimPrefs.ini settings for making your high resolution (2048 resolution) shadows look more acceptable.\r\n\r\nI was trying to find a good solution for Skyrim shadows problem, and most of them are based on 4096 shadow map resolutions, which makes my Skyrim get a huge lag in interiors. So, I was focusing on tweaking 2048 shadow map resolutions and make them look and behave better. After a long time tweaking, involving some good old trial and error, I\\'ve finally done it. Result is that you can get fixed, great quality shadows, without using 4096 shadow map resolutions and without hurting your performance.\r\nThe downloadable file isn\\'t necessary, all the information will be posted in this description. This file was made from users request to be able to endorse this tweak.\r\n\r\n====================================================================================\r\nLINKS:\r\n\r\nHere\\'s a link to a video presentationn: http://www.youtube.com/watch?v=9yoxkAhkCao\r\n\r\nHere\\'s a link to my Ultra settings tweak: http://skyrim.nexusmods.com/mods/7638\r\n\r\nHere\\'s a link to my Low and Medium settings tweak: http://skyrim.nexusmods.com/mods/19632\r\n\r\nYou can use a great tool called Skyrim configurator to change and manage your tweaks (with small variations in shadow blurring and shadow filtering, end results will be very simmilar as in my tweaks). Here\\'s a link:\r\nhttp://skyrim.nexusmods.com/mods/814\r\n\r\n====================================================================================\r\nTWEAKS:\r\n\r\nAs usual, change this values in your SkyrimPrefs.ini file (it can be found in C:\\\\Users\\\\*USERNAME*\\\\Documents\\\\My Games\\\\Skyrim\\\\ directory).\r\n\r\nNote 1) If you didn\\'t notice any changes after adding my tweak, try setting your SkyrimPrefs.ini file to read-only after adding my tweak and see if it works.\r\nNote 2) If you don\\'t have iShadowMapResolutionSecondary and iShadowMapResolutionPrimary in your SkyrimPrefs.ini, you can skip those.\r\n\r\nLOW SHADOW DRAW DISTANCE\\\\HIGH SHARPNESS, MAX FOV UP TO 98 (by defosh369):\r\niBlurDeferredShadowMask=20\r\nfInteriorShadowDistance=2000.0000\r\nfShadowDistance=2000.0000\r\niShadowMapResolutionSecondary=2048\r\niShadowMapResolutionPrimary=2048\r\nfShadowLODStartFade=200.0000\r\niShadowMode=4\r\nbTreesReceiveShadows=1\r\nbDrawLandShadows=0\r\nbShadowMaskZPrepass=1\r\niShadowMapResolution=2048\r\nfShadowBiasScale=0.2400\r\niShadowMaskQuarter=4\r\niShadowFilter=4\r\n\r\nMEDIUM SHADOW DRAW DISTANCE\\\\MEDIUM SHARPNESS, MAX FOV UP TO 80 (by defosh369):\r\niBlurDeferredShadowMask=10\r\nfInteriorShadowDistance=2800.0000\r\nfShadowDistance=2800.0000\r\niShadowMapResolutionSecondary=2048\r\niShadowMapResolutionPrimary=2048\r\niShadowSplitCount=3\r\nfShadowLODStartFade=200.0000\r\niShadowMode=3\r\nbTreesReceiveShadows=1\r\nbDrawLandShadows=0\r\nbShadowMaskZPrepass=1\r\niShadowMapResolution=2048\r\nfShadowBiasScale=0.3500\r\niShadowMaskQuarter=4\r\niShadowFilter=4\r\n\r\nMEDIUM SHADOW DRAW DISTANCE\\\\MEDIUM SHARPNESS, MAX FOV UP TO 75 (by defosh369, recommended setting when you didn\\'t change game field of view):\r\niBlurDeferredShadowMask=10\r\nfInteriorShadowDistance=3000.0000\r\nfShadowDistance=3000.0000\r\niShadowMapResolutionSecondary=2048\r\niShadowMapResolutionPrimary=2048\r\niShadowSplitCount=3\r\nfShadowLODStartFade=200.0000\r\niShadowMode=3\r\nbTreesReceiveShadows=1\r\nbDrawLandShadows=0\r\nbShadowMaskZPrepass=1\r\niShadowMapResolution=2048\r\nfShadowBiasScale=0.3500\r\niShadowMaskQuarter=4\r\niShadowFilter=4\r\n\r\n====================================================================================\r\nADDITIONAL BUGFIXES FOR SHADOWS:\r\n\r\nIf you wat to fix flickering shadows:\r\nShadow flickering is caused by game updating position of shadows for the current in-game time. Normally, when those updates are performed, shadows move around causing visible shadow flickering. This workaround is making this shadow update almost instant and takes care of any visible shadow flickering. To change shadows movements from those updates to almost instant, edit your Skyrim.ini file (it can be found in C:\\\\Users\\\\*USERNAME*\\\\Documents\\\\My Games\\\\Skyrim\\\\ directory) and add this two lines at the bottom of:\r\n[DISPLAY]\r\nfSunShadowUpdateTime=0.10\r\nfSunUpdateThreshold=2.0\r\nNote, that you can change fSunUpdateThreshold to your own liking (higher values like 2.0 equals less frequent shadow movement, lower values like 0.2 or 0.0 equals more frequent shadow movement). Best stick with 1.0 or 2.0. You can also change fSunShadowUpdateTime to your own preference (setting this value to 0 makes change instant, but if you want to shadows move when update, you can use setting provided you by user Salah-ad Din and set it to 0.25, this will make shadows move when update, but it will be faster that in vanilla setting, minimizing visible flickering).\r\n\r\nIf you want to minimize the shadows \\\"aura\\\" effect:\r\nIt helped for my settings, I\\'m using medium shadow draw distance/medium shadow sharpness version of my tweak. Still, auras will be visible in certain points, but aura itself will be smaller. So, If you want make aura shadows less visible, you can change this value:\r\niShadowMaskQuarter=6\r\nNote, that setting this value above highest game setting, will help with \\\"aura\\\" shadows in most situations and configurations, but it can cost you some performance. This performance loss depends on your system, but it should be at about -2FPS to -4FPS.\r\n\r\nIf you want to fix shadows \\\"pop up\\\":\r\nIf you have a problem with shadows pop up in close range of the player, visible at this video, provided by user named Siegfriedm:\r\nhttp://www.youtube.com/watch?v=7eFdxiGEHe8 \r\nYou can fix this by increasing shadow bias scale, to do that change this value:\r\nfShadowBiasScale=1.5000 (set to 1.5000 to completley remove the issue, but wwith detached shadows) \r\nfShadowBiasScale=1.0000 (set to 1.0000 for a good balance between fixing this issue and avoiding detached shadows)\r\nHowever, increasing shadow bias scale can make character shadows a bit innacurate and slightly detached in in-game sunrise or sundown. It\\'s not very noticeable and applies only in exterior, in interiors, changing shadow bias scale don\\'t take any effect.\r\n\r\nFor additional fixes, please visit miscellaneous section of the download page.\r\n\r\n====================================================================================\r\nADDITIONAL PERFORMANCE FOR SHADOWS:\r\n\r\nShadow blurring (+2FPS on 7, +3FPS on 5):\r\nIf you want some additional performance, or just don\\'t like high shadow blurring, you can lower the level of shadow blurring. Lowering shadow blurring will probably make shadow flickering more noticeable, so I strongly suggest adding flickering shadows fix that can be found at top of additional bugfixes for shadows section. Huge thanks goes to user named kodiak123 for testing and benchmarking this out.\r\niBlurDeferredShadowMask=5\r\nNote, that lower values than in my tweaks (like 15, 7,  5, 3 or 1) equals more performance in cost of lower shadow quality and overall blurring. Though, best value as kodiak123 pointed out, in case of performance and quality is 5.\r\n\r\nShadow filtering (+2FPS):\r\nif you want more performance, without any significant shadow quality loss, change this values:\r\niShadowFilter=3\r\niShadowMaskQuarter=3\r\n\r\nSubtle tree and land shadows (+2FPS):\r\nIf you want even more performance, you can disable land shadowing and tree shadowing, to do that, change values below:\r\nbTreesReceiveShadows=0\r\nbDrawLandShadows=0\r\n\r\n====================================================================================\r\nVERSION CHANGES:\r\n\r\nVersion 2.2 changes:\r\niShadowMaskQuarter=3\r\nHopefully, this will minimalize the problem of seeing a small light glow around bodies when they stand between a light source and their shadow, without showing up any exterior shadow flickering. This setting can also slightly increase shadow quality. Thanks goes to blattgeist to showing the problem.\r\nIf you like older version shadowing method, you can always stick with value of 2.\r\n\r\nVersion 2.4 changes:\r\nfInteriorShadowDistance=2200.0000\r\nSlightly lowered interior shadow distances for getting less pixelated interior shadows. This is a small change, but it helps a little in getting rid of those blocks. The change in draw distance isn\\'t that noticable, but the change in shadows actually is. After all, the\\'re still a bit too blocky.\r\nIt\\'s a cosmetic change, if where fine with previous interior shadows, you can stick to my older value of 2400.000.\r\n\r\nVersion 2.6 changes:\r\nReorganized the file description, added different description sections to make everything look more clear. Added some bugfixes in additional performance and bugfixes section, including some insignificant changes here and there. This time, I didn\\'t make any changes in main tweak values.\r\n\r\nVersion 2.8 changes:\r\nAdded \\\"If you wat to fix flickering shadows\\\" section in my description, that contains a different method to completley take care of visible shadow flickering problem. No changes to main tweaks were made.\r\n\r\nVersion 3.0 changes:\r\nfShadowLODStartFade=200.0000\r\nbFloatPointRenderTarget=0 (Huge thanks goes to FirstMateFilch for this)\r\niShadowMode=4 (Changed from 3. Makes shadows less \\\"fuzzy\\\" at distance, best used with static shadow movement method)\r\niShadowMaskQuarter=4 (Changed from 3. Makes shadows less \\\"fuzzy\\\" at distance, best used with static shadow movement method)\r\nAdded Low/Meduim/High shadow draw distance tweaks and made some small changes here and there. Changed fShadowLODStartFade and tbFloatPointRenderTarget to game default values, to avoid performance loss on some systems.\r\n\r\nVersion 3.2 changes:\r\nReorganized my description, did some small changes here and there, added a value to help with aura shadows in \\\"additional performance and bugfixes\\\" section of my description. No changes to main tweaks were made.\r\n\r\nVersion 3.5FINAL changes:\r\nI did some \\\"fine tuning\\\" of my tweaks, so I\\'ve changed a lot of different values, for instance, I\\'ve increased shadow draw distance a bit and corrected bias scale for new set of draw distances. Also added an optional bShadowMaskZPrepass=1 line to my tweaks.\r\n\r\nVersion 3.6FINAL changes:\r\nFrom my Ultra tweaking expierience, I\\'ve noticed that lower bias scale can provide a \\\"ground self-shadowing\\\" bug, so after testing this with my and thenannymoh tweaks, I\\'ve set bDrawLandShadows to 0 to avoid any visible \\\"ground self-shadowing\\\" that can be caused by low bias scale. Changed shadow mask quarter to 4 in thenannymoh tweak, to make shadow less \\\"fuzzy\\\" at distance.\r\n\r\nVersion 3.6FINAL additional changes:\r\nSince after the latest patches \\\"ground self-shadowing\\\" bug seems to be fixed, I\\'ve turned back on ground shadowing, bDrawLandShadows=1 in all tweaks. Did some editing of \\'additional performance for shadows\\\" section of my tweak description.\r\n\r\nVersion 3.8FINAL changes (24-08-2012):\r\nI\\'ve created my own high shadow draw distance settings and added it instead of thenannymoh\\'s settings (sorry, I\\'ll still keep a backup of this settings just in case). In this tweak, I\\'ve greatly increased shadow draw distance and add a huge amount of blurring, that is required to \\\"hide\\\" a portion of undetailed on-character shadows (shadows from very small objects, like armor pieces or belts). Overall effect is quite nice in motion and increased shadow draw distance will definitely stop any obvious shadow pop up.\r\n\r\nVersion 3.8FINAL additional changes (18-12-2012):\r\nAdded an information about a great tool called Skyrim Configurator. Changed shadow bias scale for medium sharpness/medium draw distance version of my tweak, to make transition in transparent shadows a bit smoother.\r\nfrom fShadowBiasScale=0.1800\r\nto fShadowBiasScale=0.2500\r\n\r\nVersion 4.0FINAL changes (27-12-2012):\r\nCleared up some information in the description and deleted high shadow draw distance/low sharpness verion of my tweak. Added a new version of medium shadow draw distance/medium sharpness which fixes some of the issues in older version of medium shadow draw distance/medium sharpness verion, especially helps with transparent shadows and in shadow LOD switching issue. \r\nThis is how the issue looks and behaves:\r\nhttp://www.youtube.com/watch?v=xIXeyYk7Ag0\r\nAnd how it was fixed:\r\nhttp://www.youtube.com/watch?v=o6DT9J9tx58\r\nLowering shadow draw distance may be considered as a tradeoff, but, with this new, lowered shadow draw distance, LOD switching issue was eliminated completley and on-character shadows increased in quality.\r\n\r\nVersion 4.2FINAL changes (01-03-2013)\r\nDisabled land shadows in all of my tweaks (after newest patches, it may result in shadow glitches on ground). More importantly, I\\'ve discovered that field of view setting (FOV) may cause a significant shadow quality loss, so I\\'ve changed the tweak descriptions and added small information about which is the max FOV for what setting, to avoid this king of shadow quality loses. For more information, I\\'ve made a video where I talk about this issue a bit more, here\\'s a link:\r\nwww.youtube.com/watch?v=dc2FLhRnTLY\r\n\r\nVersion 4.4FINAL changes (01-09-2013)\r\nChanged interior draw distances after researching interior shadowing in Skyrim, with awesome help of Skyrim Nexus user named Valorien. Cleared things up a bit and updated the credits section.\r\n\r\n====================================================================================\r\nFROM ME:\r\n\r\nPlease remember, it\\'s not a permanent and best solution for Skyrim shadows problem, but definitely worth checking out. For a permanent fix of this issue, we all must wait for Bethesda to take action with a patch or something.\r\nPlease tell me if you have any problems or if you like it or hate it. You can also share and use for you own tweaking as a good starting point.\r\n\r\n====================================================================================\r\nCREDITS:\r\n\r\nAuthor:\r\ndefosh369  (http://www.skyrimnexus.com/modules/members/index.php?id=3108981)\r\n\r\nWith help of:\r\nLevel of detail issue possible fix: Nearox (http://skyrim.nexusmods.com/users/3618360)\r\nInterior shadowing help: Valorien (http://skyrim.nexusmods.com/users/2093220)\r\nGeneral help and shadow blurring testing with banchmarking: kodiak123 (http://www.skyrimnexus.com/modules/members/index.php?id=3414367)\r\nVery useful shadow pop up video: Siegfriedm  (http://www.skyrimnexus.com/modules/members/index.php?id=1928177)\r\nGeneral help and high draw distance tweak: thenannymoh  (http://www.skyrimnexus.com/modules/members/index.php?id=1645524)\r\nInformation about bFloatPointRenderTarget line: FirstMateFilch (http://www.skyrimnexus.com/modules/members/index.php?id=3083616)\r\nFeedback on aura shadows issue: blattgeist  (http://www.skyrimnexus.com/modules/members/index.php?id=300938)\r\nGeneral help and showcasing additional tweaks for shadows: runicNomad  (http://www.skyrimnexus.com/modules/members/index.php?id=92419)\r\nFeedback on issue caused by bFloatPointRenderTarget line: craxim2  (http://www.skyrimnexus.com/modules/members/index.php?id=2658706)\r\nFeedback on interior shadow quality: Vortaka  (http://www.skyrimnexus.com/modules/members/index.php?id=182044)\r\nOptimized values for flickering shadows fix: Salah-ad Din  (http://www.skyrimnexus.com/modules/members/index.php?id=124039)\r\nHelping me realize that I\\'ve should add a file so people can endorse it: faggoat  (http://www.skyrimnexus.com/modules/members/index.php?id=1783958)",
  "categoryId": "62",
  "version": "4.4FINAL",
  "author": "defosh369",
  "createdUnix": "1321410184",
  "updatedUnix": "1383434109",
  "containsAdultContent": false,
  "uploadedBy": "defosh369",
  "primaryFile": null,
  "files": [
    {
      "fileId": "7690",
      "name": "Comparison images",
      "version": "3.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "5203",
      "fileName": "Comparison images for tweak V30 and above-283.rar",
      "uploadedUnix": "1323204679",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/4db685eaadf4a9f5c5eb1672d7ff5494ea3bc09676344a878ed162ff94aafa0b/analysis/1406487306/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Comparison%20images%20for%20tweak%20V30%20and%20above-283.rar?fid=7690&ttl=1535753020&ri=8192&rs=8192&setec=4829d2d9559d38d2fc3062d8b8df7611"
    },
    {
      "fileId": "1000014117",
      "name": "INSS Improved New Skyrim Shadows for Medium-Range PC V42FINAL",
      "version": "4.2FINAL",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "INSS Improved New Skyrim Shadows for Medium-Range PC V42FINAL-283-4-2FINAL.7z",
      "uploadedUnix": "1362139670",
      "modVersion": "4.2FINAL",
      "virusScanUrl": "https://www.virustotal.com/file/6bd187678b31105129b54b543cddcb5c76bc1a4ccabcc1afd40a3caeef3f4bf3/analysis/1407445746/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/INSS%20Improved%20New%20Skyrim%20Shadows%20for%20Medium-Range%20PC%20V42FINAL-283-4-2FINAL.7z?fid=1000014117&ttl=1535753021&ri=8192&rs=8192&setec=0e9bda8f4c4438beba60f520f25b155a"
    },
    {
      "fileId": "1000074259",
      "name": "Skyrim shadow tweaking guide - Full and updated version",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "97528",
      "fileName": "Skyrim shadow tweaking guide - Full and updated version-283-1-0.7z",
      "uploadedUnix": "1383434109",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/14f4c27e95a54f95e65ef04a87bcfbcd0ab3b04da4b0bf4fc0adb09277c5721e/analysis/1407778953/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20shadow%20tweaking%20guide%20-%20Full%20and%20updated%20version-283-1-0.7z?fid=1000074259&ttl=1535753021&ri=8192&rs=8192&setec=fce7728171a8177cf401c0202a6f33be"
    }
  ]
}