{
  "modId": 28336.0,
  "modName": "Moving Target Practice",
  "summary": "Target dummies are scripted to move, and give better skill improvement for hits landed from further away.  Time and Points records are permanently kept, and are displayed on walls (scoreboard-style).  Designed primarily for Archers.. Magic and Melee may also be improved using Moving Target Practice.",
  "descriptionHtml": "**********\r\nI, SLuckyD, am no longer developing or supporting this mod.\r\n**********\r\n\r\n\r\nMoving Target Practice v1.0\r\n- a Player-Training mod by SLuckyD\r\n\r\n\r\n[SUMMARY]\r\nIntended to be an addon for my Player-Home (Overlook Tower), this stand-alone mod includes an interior room which is used for MOVING target practice.  Target dummies are scripted to move, and give better skill improvement for hits landed from further away.  Time and Points records are permanently kept, and are displayed on walls (scoreboard-style).  Designed primarily for Archers.. Magic and Melee may also be improved using Moving Target Practice.\r\n\r\n\r\n[REQUIRED]\r\n= Latest Skyrim Update/Patch (v1.8 or higher).  \r\n- \\\"Target Practice BASEv1.esm\\\": installed and enabled\r\n- \\\"Target Practice MAINvXX.esp\\\": installed and enabled (\\\"XX\\\" = newest version, MAINv1.0)\r\n- All the contents of both of the above downloads, placed in their appropriate folders.\r\n= BOTH of the above need to be installed and enabled for this mod to work.\r\n- If upgrading from an OLD version:\r\nDISABLE any PREVIOUS versions of \\\"Target Practice MAINvXX.esp\\\"!\r\n- DO NOT disable or rename the \\\"Target Practice - BASEv1.esm\\\"!!! (unless a future version specifically tells you otherwise)\r\n\r\n\r\n[UPGRADING FROM A PREVIOUS VERSION]\r\n*** AS WITH ANY MOD; before installing, enabling, and/or playing a new version you SHOULD:\r\n- load your newest saveGame with the OLD version still loaded\r\n- fast-travel your Player AWAY FROM ANYWHERE the mod changes or places something\r\n- save a NEW saveGame, exit Skyrim\r\n- uninstall the OLD version, install the NEW version\r\n- load the NEW saveGame, play\r\n*** This ensures you have a relatively CLEAN saveGame to bridge versions (and a backup of your original saveGame).  If you do NOT do this, and saved your game in the same area a mod alters, STRANGE THINGS may happen - potentially DAMAGING your future saveGames\\' data.\r\n\r\n\r\n[FRESH INSTALLATION]\r\n- copy this mod\\'s DATA folder to your game\\'s installation folder\r\n- be sure to have a copy of the \\\"Target Practice BASEv1\\\" package properly installed in your game\\'s DATA folder (ESM file; Scripts, Meshes & Textures folders and their contents)\r\n- run the game; and in the Skyrim Launcher, click \\\"Data Files\\\"\r\n- make sure the box next to \\\"Target Practice MAINv1.0.esp\\\" is CHECKED\r\n- make sure the box next to \\\"Target Practice BASEv1.esm\\\" is CHECKED\r\n- make sure the above ESM is moved up in the load order to before the above ESP\r\n- click \\\"OK\\\" then click \\\"Play\\\"\r\n= Load Order regarding other mods shouldn\\'t make a difference, nothing should conflict as I don\\'t change anything Vanilla (only added a single door outside the main gate of Whiterun, and re-finalized that navMesh)\r\n\r\n\r\n[FEATURES]\r\n- Dwemer Hallway with 7 targets\r\n- Closed environment for easy retrieval of arrows and loot\r\n- 3 Difficulty Levels, 3 Speeds\r\n- Player is given FIVE MINUTES to successfully hit ALL SEVEN TARGETS\r\n- May be used as many times as the Player has gold, and as frequently as back-to-back\r\n- In-game cash prizes for breaking records\r\n- Archery, Magic, and/or Melee may be trained-up using Target Practice\r\n- Amount of skill improvement increases the further Player is from the target when hit\r\n\r\n\r\n[HOW TO PLAY & WHERE TO FIND IT]\r\n(from the console: \\\"coc aaSLuckTP1\\\")\r\n= There is a tiny little Eye of Magnus outside and near the Main Gate of Whiterun.. it is a door (which followers or other NPCs may follow through).  SEE THE IMAGES SECTION FOR A SCREENSHOT OF THE EXACT LOCATION.\r\n- FIRST set the desired SPEED and DIFFICULTY settings, using the Start Button closer to the entrance.  The defaults are Easy/Slow.\r\n- Equip and READY your desired form of attack (bow, magic, etc)\r\n- Ensure you have enough gold to pay the Fee (as calculated above)\r\n- ACTIVATE the Start Button closer to the large room to begin\r\n- ATTACK the Target Dummies until ALL SEVEN have been hit\r\n- Target Practice will automatically END when completed or FIVE MINUTES have past (whichever comes first)\r\n= To RESET THE RECORDS: Activate WHILE SNEAKING the Start Button for Speed/Difficulty \r\n\r\n\r\n[DETAILS]\r\nFEE/COST TO PLAYER\r\n- The Fee is calculated based on your Difficulty and Speed Settings; each level counting as 1x, 2x, or 3x.\r\n- The Difficulty and Speed multipliers are added together to get the final multiplier.  This ranges from 2x (1x + 1x) to 6x (3x + 3x).\r\n- The Fee Per Level is calculated as 250 Gold times the final multiplier.\r\n- For each level the Player already has, the amount of gold needed to use Target Practice is multiplied by the Fee Per Level.\r\n= eg: a level 48 Player playing Normal Speed with Hard Difficulty would need 60,000 Gold (or 1250 Gold per level = 2x+3x*250, then *48=60000)\r\n\r\nRECORD KEEPING\r\n- Automatic updating of records; displayed on walls in real-time\r\n- Perpetual record-keeping for 3 Time records and 3 Points records\r\n- Also stores the Difficulty and Speed levels used when those records were set\r\n- Each record shows which numbered attempt at the course it was set by\r\n= Records may be reset by Activate-while-Sneaking the Difficulty/Speed Start Button\r\n\r\nSKILL IMPROVEMENT\r\n- Magic, Archery, and Melee are all able to be improved.. whichever is used to hit each target is automatically and immediately adjusted\r\n- Amount of improvement for each hit depends on PLAYER\\'S DISTANCE FROM THE TARGET\r\n(ie- MORE points for more distance)\r\n- Amount of improvement is also multiplied by Difficulty and Speed Levels (see below)\r\n- Average improvement per course-completion is about 1 skill level on Easy/Slow, about 2 skill levels on Hard/Fast\r\n- Maximum possible improvement depends on your skill, and may exceed 3 skill levels\r\n= Actual method for calculating Skill Improvement:\r\n((arbitrary value set to 0.01 * distance to target) * Difficulty setting) * Speed setting)\r\nThis number is then multiplied by (player\\'s number of levels / 9), where the multiplier is always set to at least 1.\r\n= The ACTUAL amount Player is improved is displayed immediately after a dummy is hit.\r\n\r\nDIFFICULTY AND SPEED\r\n= Starting points are randomly chosen at the beginning\r\n- EASY has the dummies moving from side to side, at Player\\'s level\r\n- NORMAL has them moving between two points, randomly chosen from four at the start\r\n- HARD has them moving between FOUR points, randomly chosen after each turn\r\n= Target Movement Speed is doubled when NORMAL is set, tripled when FAST\r\n= Skill Improvement is 1x for EASY/SLOW, 2x for NORMAL, 3x for HARD/FAST, and is compounding.\r\n(eg- EASY/SLOW = 1x/1x = 1x, NORM/NORM = 2x/2x = 4x, HARD/FAST = 3x/3x = 9x, HARD/SLOW = 3x/1x = 3x, EASY/NORM = 1x/2x = 2x)\r\n\r\nPRIZES FOR SETTING RECORDS\r\n= 10000x the Player\\'s Level in Gold for \\'Breaking the Bank\\'... getting over 9999.99 Points\r\n(eg- if Player is level 38, \\'Breaking the Bank\\' would award 380,000 gold)\r\n- 3rd Place record awards 150 Gold per Player-Level\r\n- 2nd Place record awards 300 Gold per Player-Level\r\n- 1st Place record awards 500 Gold per Player-Level\r\n= All Prizes are cumulative.  eg- 1st Place in BOTH Time and Points awards 1000 Gold per Player-Level, PLUS the 10000 Gold per level bonus for Breaking the Bank (if applicable).\r\n\r\n\r\n\r\n[TROUBLE SHOOTING & FAQ]\r\n\\\"Can\\'t find it\\\"\r\n\\\"Not working\\\"\r\n\\\"How do I...\\\"\r\n- make sure the folder \\\"DATA/Meshes/SLuckyD/Tiles/\\\" exists and contains 3 files (\\\"recordsTime.nif\\\", \\\"tileBlank.nif\\\", and \\\"practicedummy01.nif\\\")\r\n- make sure the folder \\\"DATA/Textures/SLuckyD/Tiles\\\" exists and contains 38 files\r\n- ensure the 5 script files are placed in the DATA/Scripts/\\\" folder (\\\"aaSLucktargStart1.pex\\\", \\\"aaSLucktargRecords.pex\\\", \\\"aaSLucktarget1.pex\\\", \\\"aaSLucktargCust.pex\\\", and \\\"QF_aaSLucktargQuest1_0256A63C.pex\\\")\r\n- place \\\"Target Practice BASEv1.esm\\\" in the folder \\\"DATA/\\\"\r\n- place \\\"Target Practice MAINvXX.esp\\\" in the folder \\\"DATA/\\\" (\\\"XX\\\" is a version #)\r\n- in the Skyrim Launcher, click \\\"Data Files\\\" then check-mark the boxes next to the above files, and move the ESM so it is loaded before the ESP\r\n- click \\\"OK\\\" then click \\\"Play\\\"\r\n\r\n** If you are experiencing problems with installation, and use \\\"mod manager\\\" software, I can\\'t help as I know nothing of those programs.  I suggest either posting to the Comment Area for this mod (hoping that someone else can answer), or reviewing the modman\\'s documentation and forum threads.\r\n\r\n*** If you have DLC and experience problems, I cannot help with that either - I don\\'t have any DLC and have no plans to get any.  Again, post to the Comment Section and others may be able to help.\r\n\r\n\r\n[POTENTIAL CONFLICTS]\r\n- Any other mod which alters the area I have placed the entrance door.\r\n- Any other mod, INI setting, or software which fundamentally alters the game of Skyrim\r\n- NMM or other modman software may not install the mod correctly; if you have problems, use the above directions for a manual installation.  It\\'s usually because my Data/ folder wasn\\'t properly extracted.\r\n\r\n* For specific conflicts and how to resolve them, see the Comment Area thread for this download; there may be solutions to common problems, while some problems may require special attention.  Post if you get stuck!\r\n\r\n\r\n[VERSION HISTORY]\r\nv1.0\r\n- Dwemer Hallway with 7 targets\r\n- 3 Difficulty levels, 3 Speeds\r\n- Perpetual record-keeping for 3 Time records and 3 Points records\r\n- Stores the Difficulty and Speed levels used when those records were set\r\n- Stores the Course Attempt Number for each record\r\n- Variable Fee, set awards\r\n\r\n\r\n\r\n[CREDIT]\r\n- I altered the Vanilla target dummy\\'s mesh.. to be able to have collision while it moves.\r\n\r\n\r\n[LEGAL]\r\nBethesda (or \\\"Licensor\\\" as defined in the Skyrim EULA) is not the author of the \\\"Customized Game Materials\\\" included in this package.\r\n“THIS MATERIAL IS NOT MADE, GUARANTEED OR SUPPORTED BY THE PUBLISHER OF THE SOFTWARE OR ITS AFFILIATES.”\r\n\r\nSLuckyD is not responsible for any damage these materials may cause, and/or failure to successfully deliver any stated products or services.\r\n\r\n\r\n\r\n[OTHER SLuckyD RELEASES]\r\n\r\n- TESvSnip v4.3.1s2 and RecordStructure.XML File v1.6\r\nhttp://skyrim.nexusmods.com/mods/21202\r\n\r\n- CK Loading Errors Fix\r\nhttp://skyrim.nexusmods.com/mods/21207\r\n\r\n- Gokstad Sailable Viking Ship & Portable Player Home\r\nhttp://skyrim.nexusmods.com/mods/5432\r\n(this was the first Skyrim mod to implement real-time sailing/flying using multiple objects)\r\n\r\n- Overlook Tower Player-Home\r\nhttp://skyrim.nexusmods.com/mods/4514\r\n(this was the first Skyrim mod to offer a non-Vanilla Player-home)\r\n\r\n- Portable On-demand Disposable Unlimited Mannequins (SPODUM)\r\nhttp://skyrim.nexusmods.com/mods/10578\r\n\r\n- Vanilla Mannequin Script Fix\r\nhttp://skyrim.nexusmods.com/mods/10652\r\n\r\n- Ring of Fortify Carry Weight plus 10000\r\nhttp://skyrim.nexusmods.com/mods/8520\r\n\r\n- Faster Woodland Creatures\r\nhttp://skyrim.nexusmods.com/mods/4799\r\n\r\n- Wounded Knee Gulch\r\nhttp://skyrim.nexusmods.com/mods/3787\r\n(this was the first Skyrim mod to offer a new dungeon)\r\n(availability is limited until I can update this to a 100% compatible, Skyrim Creation Kit version)\r\n\r\n- Bullseye\r\nhttp://skyrim.nexusmods.com/mods/2945\r\n(this was the first Skyrim mod to offer a new worldSpace, as well as several other \\'preCK firsts\\')\r\n(availability is limited until I can update this to a 100% compatible, Skyrim Creation Kit version)\r\n\r\n\r\n\r\n[OTHER PROJECTS I\\'VE ACTIVELY CONTRIBUTED TO]\r\n\r\n- Flyable Dragon Race Revamped\r\nhttp://skyrim.nexusmods.com/mods/17178\r\n(I did the ground-detection, which auto-switches the dragon to walking mode)\r\n",
  "categoryId": "73",
  "version": "1.0",
  "author": "SLuckyD",
  "createdUnix": "1355550816",
  "updatedUnix": "1355550929",
  "containsAdultContent": false,
  "uploadedBy": "SLuckyD",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105263",
      "name": "Moving Target Practice v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6283",
      "fileName": "Moving Target Practice v1_0-28336-1-0.rar",
      "uploadedUnix": "1355550929",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b23ef5ed1c62a215fdba137d3947351fb4abb2823f6a880128cd771170b3d184/analysis/1407304870/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moving%20Target%20Practice%20v1_0-28336-1-0.rar?fid=105263&ttl=1535801662&ri=8192&rs=8192&setec=aef8d10dc16ec35084b12a8fcb93d969"
    }
  ]
}