{
  "modId": 28352.0,
  "modName": "TheWinterhawks Romantic Hut - Lunds Hut Overhaul",
  "summary": "This is a complete overhaul of Lund\\'s Hut interior as well as exterior. I always found the spot beautiful, but of course, since Lund died there were only rats, rubbish and refuse. „What a pity!“, I thought, and decided to make it one of the most beautiful spots in the whole of Skyrim. Lund\\'s Hut now is TheWinterhawk\\'s Romantic Hut. Enjoy!",
  "descriptionHtml": "[color=orange][b]Optional Update v1.2 Dec. 20th, 2012: Besides the added chests from optional update 1.1 you can now find crafting furniture at the Frostfruit Inn exterior and interior.[/b][/color]\r\n[b]Optional Update v1.1 Dec. 16th, 2012: Added 1 chest container to the exterior, 1 jewelry box and two kettle containers to the interior.[/b]\r\n[b]Initial Release: Dec. 15th, 2012, v1.0[/b]\r\n\r\n[b]Function:[/b] Lore-friendly small player house\r\n\r\n[b]Required DLC:[/b] None, only vanilla Skyrim 1.8\r\n\r\n[b]Compatibility with DLCs:[/b] should be compatible with all DLCs, as long as they don\\'t implement quests or additional stuff for Lund\\'s Hut or Lund himself. Awaiting confirmation from players.\r\n\r\n[b]Mod Compatibility:[/b] Should be compatible with any mod, as long as it doesn\\'t change the Lund\\'s Hut area on exterior and/or interior. Mods, that change this area [color=red]CAN[/color] give you trouble, if they try to handle the same objects. [color=lightblue]Cloaks of Skyrim[/color] compatibility has been confirmed by LuDux. CoS places a cloak in the hut. I have not changed position of that vanilla shelf where the cloak is placed in respect of the Cloaks of Skyrim mod. Huge thanks to LuDux for confirming compatibility!\r\n\r\nAs reported by TheOTHERmaninblack, when using \\\"Interesting NPCs\\\" mod, you\\'ll find a guy named Leifan in the hut. If you don\\'t need him, you can disable him via console. If you want to keep him, try to place him beside you via console while being somewhere outdoors. Or... if he\\'s a follower... and you have \\\"My Home Is Your Home\\\" mod, let him live somewhere else. If you\\'re familiar with the CK, simply place him somewhere else or disable him there.\r\n\r\nThanks a lot again to TheOTHERmaninblack for reporting the Leifan issue!\r\n\r\n[color=orange][b]______________________________________________________________[/b][/color]\r\n\r\n[img]http://www.rabenwald.de/RomanticHutHeader_smaller.jpg[/img]\r\n\r\n[color=orange][b]______________________________________________________________[/b][/color]\r\n\r\n\r\n[color=orange][b]Description:[/b][/color]\r\n\r\nTheWinterhawk\\'s Romantic Hut is a complete overhaul of Lund\\'s Hut, which is situated to the Northwest of Rorikstead. It comes with a very romatic flair, both on the exterior and the interior.\r\n\r\nOutside you\\'ll find one of the most beautiful spots in the whole of Skyrim. No more rubbish, rats and refuse, but instead a wonderful little wild flower garden, overgrown with jazbay grapes, juniper, mountain flowers, tundra cotton and lavender. You can sit under a huge pine tree, near a memorial area with candles and sacrificial offerings. A shrine of Arkay sits in front of the memorial cairn. A fish pond and a beautiful romantic tree will give you comfort, when you feel lonely.\r\n\r\nDo you want to have a romantic outdoor dinner with your love? You will have an extinguishable fire and can set up a barbecue, if you wish. From the fresh water well, which looks as if enchanted by pixies, you can get a water filled bucket to make waterskins from the tanning rack.\r\n\r\nSomewhere there\\'s a secret hidey-hole... maybe someone has left a note for their lovers there? =)\r\n\r\nOn the interior you\\'ll find everything necessary to get into a romantic mood: A double bed, a well arranged kitchen area and a well-laid table, ready for dinner for you and your sweetheart. After eating you both might want to sit close to the fire and listen to the crackling flames, while drinking a good wine. And if you\\'re rather in the mood to sit outside on the porch under the stars, there are a table and two seats ready for you.\r\n\r\nYou\\'ll get the chance to see wonderful sunrises, as well as sunsets for the spot is perfectly situated. You\\'ll have a good view on the moons Masser and Secunda and auroras will be even more stunning, when watched from this tiny, romantic beauty spot.\r\n\r\nThis time I did not include a quest to obtain the hut, but, yet, it has a background story. You may have visited this spot in the past a few times and found nothing special about it. The old Lund had died and his hut looked all weathered. But one day you decided to take a closer look and found a romantic note in a secret hidey-hole. It seems this place used to be the haunt of two lovers. No one knows what ever became of them. But you have a romantic vision of this spot and decide to surprise your love. In many weeks of hard work you turn the weathered hut into a beautiful love nest. Maybe it\\'s about time to ask your sweetheart to marry you? Let\\'s imagine the added trees have always been there. ;)\r\n\r\n[color=orange][b]______________________________________________________________[/b][/color]\r\n\r\n\r\n[color=orange][b]On the Technical Side:[/b][/color]\r\n\r\nOn the exterior no objects where deleted from the scenery, but drawn under the surface, disabled and not allowed to havok, so some clutter items won\\'t come up to the surface again. Inside the house I DID delete some furniture, the cob webs and all clutter objects lying around, because they were really many! So, IF you have taken anything from vanilla Lund\\'s Hut BEFORE you installed the mod, please also put it back there BEFORE you install this mod! Otherwise you might get crashes!!! I\\'m not going to TES-edit this out, because the objects were removed on purpose! I run about 200 mods with no issues, so there\\'s only a little chance that this will give you trouble.\r\n\r\nTwo vanilla rocks on the exterior environment were fixed by raising the ground a little. No more open gaps.\r\n\r\nLund himself and the two skeevers inside the hut were drawn under the surface, disabled and fixed there. The 4 skeevers on the exterior were moved to a nearby cell, but far away enough to not bother you when they respawn. If any mod should use those skeevers or Lund, you might have trouble, but you can enable them all in the CK when necessary.\r\n\r\nThe map marker\\'s name was only changed from \\\"Lund\\'s Hut\\\" to \\\"Romantic Hut\\\". Nothing more.\r\nExterior COC marker and Xmarker headings were moved a bit to adjust them to the new exterior arrangement.\r\n\r\nThe interior Navmeshes were not deleted, but adjusted very carefully, some triangles added. When ckecked, it gave me one warning, so I had to delete one single triangle and replace it. I hope this is not giving stupid NPC reactions.\r\n\r\nOn the exterior I didn\\'t adjust the Navmeshes at all, because they are too sensitive. In my tests, the NPCs didn\\'t get stuck too badly. Some of you modding guys know how sentitive exterior Navmeshes are, so it\\'s better NPCs run against a tree for three times, instead of refusing to work completely, right? There we go! Give them a little time or navigate them around objects (especially the water well) if necessary. You can also try bumping into them, when they get a little stuck. ;)\r\n\r\nThe Lighting was designed for Climates of Tamriel - warm interiors and tested with SkyRealism ENB Evolved, warm version without Ambient Lighting. The DirectLightingIntensityInterior was set to 1.1. In your game version, the lighting can be brighter or darker from what you see on the screen shots.\r\n\r\n[color=orange][b]______________________________________________________________[/b][/color]\r\n\r\n\r\n[color=orange][b]Features:[/b][/color]\r\n\r\nThe Hut is small and when you enter it, you see only one single chest. But don\\'t be fooled! There\\'s a lot of space where you can put your items. The containers only don\\'t look like chests anymore for I have given them a disguise to make them look nicer. ;)\r\n\r\n[color=red][b]ALL CONTAINERS, INTERIOR AND EXTERIOR, ARE RESPAWN SAFE!!![/b][/color] That means you can safely store your items in them, those containers will never respawn, when the cell itself respawns. \r\n\r\n[b]Features on the interior:[/b]\r\n-----------------------------\r\n\r\n1 chest container\r\n18 disguised Containers\r\n3 furniture containers\r\n2 barrels\r\n5 sacks\r\n\r\n1 cooking pot\r\n\r\n- Navmeshed for followers\r\n- Some idle markers\r\n\r\n[b]Features on the exterior:[/b]\r\n-----------------------------\r\n\r\n3 disguised containers (Look out for them, test every object! I don\\'t want to spoil you too much.)  ;)\r\n\r\n1 tanning rack\r\n1 woodchopping block\r\n1 functional fire (self-explanatory ingame)\r\n1 water well (read following passages)\r\n\r\n- Vanilla navmeshed for followers\r\n- Lots of idle markers and invisible furniture for sandbox AI (means your npc companions will sit down and such stuff, if you let them relax with \\\"UFO\\\" mod or make the area their new home, e.g. with \\\"My Home is Your Home\\\" mod.)\r\n\r\n\r\n[color=red][b]--> Exterior + interior containers = 32 respawn safe containers in total![/b][/color]\r\n\r\n\r\n[b]Consumable Waterskins:[/b]\r\n-----------------------------\r\n\r\nTheWinterhawk\\'s Romantic Hut will offer you consumable waterskins for game immersion. If you already use a food mod, you might not be in need of it. But if you don\\'t want a food mod, and yet want some role playing feeling and always wondered why Bethesda didn\\'t implement waterskins in the vanilla version, but glass bottles instead, well, then this feature may be for you. ;)\r\n\r\nTo make waterskins for your journeys you have to go to the fresh water well and get a water filled bucket. (Sorry, at the moment it\\'s not really filled with water, because I couldn\\'t get the shader to work properly in NifScope. If I work it out, I\\'m adding it.) With the water filled bucket, 4 leathers and 4 leather strips you go to the tanning rack and look into the food section to make 4 waterskins. That\\'s it. They will give you a tiny refreshment boost.\r\n\r\n[b]Please, be aware:[/b] You cannot get like 10 water filled buckets from the well in a single run. You will have to get one by one and get rid of it by crafting waterskins. The max amount of water filled buckets you can have at one time is 2. You cannot throw them on the ground to get more buckets. ;) \r\n\r\n\r\n[b]NO Workbench Tables and Showcase Furniture:[/b]\r\n----------------------------------------------------------\r\n\r\n[color=red][b]Please, take note:[/b][/color]\r\n\r\nYou will [b]NOT[/b] find an alchemy table, an enchanting table, a forge and such stuff. No weapon racks, no mannequins, etc.! Why?\r\nWell, it\\'s only a tiny hut in the wild. It\\'s a romantic hut, not a work station! The purpose of this \r\nhut is rather \\\"relaxing in an immersive game atmosphere with your spouse or romance\\\". ;)\r\n\r\nIf you miss any of that stuff, either go to the CK, built a basement to your needs or have a second house mod, which serves you with all that. (Maybe you want to take a look at my \\\"Black Wolf Lodge\\\" mod. It has all the other stuff.) The romantic hut will definitely [b]NOT[/b] see any of these furnitures in any update!\r\nIf you want to practice alchemy in the hut, yet, check out the \\\"Field Alchemy\\\" mod by MrJack:\r\n--> http://skyrim.nexusmods.com/mods/27153  (requires SKSE!)\r\n\r\n\r\n[color=orange][b]Update Info:[/b] I have made an optional update which adds some crafting furniture to the Frostfruit Inn exterior and interior. Please read the readme.txt, which you have downloaded from the UPDATE FILE, not the main readme.txt![/color]\r\n\r\n[color=orange][b]______________________________________________________________[/b][/color]\r\n\r\n[color=orange][b]Known Issues:[/b][/color]\r\n\r\n- Some people seem to have a second floor texture in one part of the hut, giving artifacts. I have no clue where it\\'s coming from, since in the CK, there\\'s definitely only ONE building part on that spot, and thus only ONE texture. I assume it\\'s a cell buffer issue somehow, yet, purging cell buffers via console command (\\\"pcb\\\") weren\\'t successful for all people trying it at all times. If \\\"pcb\\\" doesn\\'t help, try to disable the floor part by clicking on it and type \\\"disable\\\" in your console. Please, write down the ID of the floor part (the number that appears, when clicking on the floor), just in case, when your cell loads properly one day and you find a huge gap in the floor, you can enable it again.\r\n\r\n[color=orange][b]______________________________________________________________[/b][/color]\r\n\r\n[color=orange][b]Installation/De-Installation:[/b][/color]\r\n\r\nTo install download the .rar, unpack it and put your LundsHut.bsa and LundsHut.esp files into your Skyrim\\\\Data folder.\r\nFor loose files put the LundsHut.esp and the folders \\\"meshes\\\", \\\"textures\\\" and \\\"scripts\\\" into your Skyrim\\\\Data folder.\r\n\r\nTo deinstall simply delete the LundsHut.bsa and LundsHut.esp from your Skyrim\\\\Data folder.\r\nFor loose files delete the LundsHut.esp from your Skyrim\\\\Data folder and search in the folders \\\"meshes\\\" and \\\"textures\\\" for TheWinterhawk\\\\LundsHut folders. Delete the LundsHut folders and all their contents. Finally go to the scripts folder and delete these two files:\r\n\r\naa_getfilledbucket.pex\r\naa_ManageCampfireHutScript.pex\r\n\r\n[color=orange][b]______________________________________________________________[/b][/color]\r\n\r\n\r\n[color=orange][b]Recommendations:[/b][/color]\r\n\r\nI want to mention some mods, which can make your romantic hut look better than \\\"vanilla\\\". Of course, the following mods are not required and it\\'s totally up to you, if you use them or not. ;)\r\n\r\n[color=lightblue][b]- CoT - Climates of Tamriel by jjc71[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/17802\r\n--> A wonderful weather enhancement and overhaul for immersion and romantic moods.\r\n\r\n[color=lightblue][b]- Alternative Rock Textures by ewi65[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/27926\r\n--> Makes your rocks look more vivid and yet blends perfectly into the scenery. Gives a warmer mood to the game. The tundra will look breathtaking! ;)  [color=red](Not to be seen on most of the Romantic Hut mod page screens! I\\'ve included one shot, though. The screenshot session for my mod was taken, before I installed the rock textures, that\\'s why you don\\'t see it on the other screens.)[/color]\r\n\r\n[color=lightblue][b]- aMidianBorn Fur Armor by CaBaL120[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/27810\r\n--> Gives the waterskin a nice retex, too. I highly recommend to use it for the waterskin at least! If you don\\'t want the texture on your fur armor, but on the waterskin, you can make a standalone path in NifScope. Just PM me and I\\'ll help you, if you don\\'t know how to do it.\r\n\r\n[color=lightblue][b]- Washed Skyrim - Dresser by ri4[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/7540\r\n--> Makes your interior hut furniture (and the rest of the same common furniture objects in the game) look a little nicer. In the screens you see the Dark Walnut version. (The noble bed in the hut is a standalone model made by me to better fit into the walnut look of the rest of the furniture. Its texture does not belong to the dresser mod, but was freshly created by me. It doesn\\'t replace any other noble furniture textures!)\r\n\r\n[color=orange][b]______________________________________________________________[/b][/color]\r\n\r\n\r\n[color=orange][b]Credits: (In alphabetical order)[/b][/color]\r\n\r\n[color=lightblue][b]- PAINTINGS AND FRAMES mod created by Artisanix[/b][/color]\r\n--> http://skyrim.nexusmods.com/mods/17423\r\nThanks for providing the community with your awesome work freely, Artisanix! It\\'s people like you who make the mod work flourish! I used some of Artisanix paintings and frames for the mod.\r\n\r\n[color=orange][b]______________[/b][/color]\r\n\r\n[color=orange][b]I also would like to give huge thanks to 5 people, who have helped me out, tried to find solutions with me and were true friends throughout my work for this mod. Without you guys I would have been blown! Even, if you finally didn\\'t necessarily bring up the solutions I needed, all of you have deserved to be named for your unstintingly efforts to help a fellow modder. You guys are the epitome of the true community spirit. I want to say it with AC/DC: Ride On! Those 5 people are as follows:[/b][/color]\r\n\r\n[color=lightblue][b]FrankDema:[/b][/color]\r\nYou are incredible! I know I told you this before, but I want the community to know it, too! Without blinking an eye you offered your help immediately at the speed of light. When I was down and close to drop a thought, you cheered me up again. You were my emotional support, thank you so much! Also, thank you so much again for trying on the obj. and .nif files! (You know what... ^^)\r\nWhy don\\'t you people check out Frank\\'s wonderful \\\"Franka The Battle Goat\\\" mod. Well, she has nothing to do with my mod, but she\\'s simply hilarious!\r\n--> http://skyrim.nexusmods.com/mods/27775\r\n\r\n[color=lightblue][b]Laup26:[/b][/color]\r\nYou replied almost as fast as Frank to my question. (But he just had his Battle Goat Franka released, so I think, that\\'s the reason why he was a bit faster. Ridin\\' like hell... haha.) But without you I would not have met Frank, and so I want to say thank you! You also offered a lot of ideas on why my problem with the meshes, we talked about, subsisted. Thanks for all the information and the hot advice to ask FrankDema. =)\r\nTo the community I recommend Laup\\'s \\\"More Saddles\\\" mod.\r\n--> http://skyrim.nexusmods.com/mods/19936\r\n\r\n[color=lightblue][b]Nightasy:[/b][/color]\r\nI can\\'t thank you enough for your tutorial series \\\"Creating Custom Armors Step By Step\\\".\r\n--> http://skyrim.nexusmods.com/mods/19249\r\nFinally in video 47 I found the solution to my .nif file problem. Also thanks a lot for preparing a downloadable grounditem.nif. It worked like a charm! Keep up the good work!\r\n\r\n[color=lightblue][b]Tek_7:[/b][/color]\r\nTek, you said I couldn\\'t credit you for my own good sense of scripting. And I said: then let me credit you for being a precious and inspirational member of this community. And so I do it! Without hestitating you came up with ideas on how to solve my scripting problems. You offered several potential solutions and shared your knowledge freely. Thanks so much for being a scripting inspiration to me!\r\nIf you people do not know Tek\\'s \\\"Camping Kit of the Northern Ranger\\\" mod, yet, well... then it\\'s about time you check it out! ;)\r\n--> http://skyrim.nexusmods.com/mods/10573 \r\n\r\n[color=lightblue][b]WilliamSea:[/b][/color]\r\nLast, but not least, good old WillieSea. Whenever I have a scripting question and I post it on the TES Allegiance, I can be sure, WillieSea/WilliamSea will give me valuable information, hints and tips. Thank you Willie for never getting tired of dealing with other people\\'s scripting questions.\r\nIf you people would like to see some of WillieSea\\'s work, check out his \\\"Levelers Tower\\\".\r\n--> http://skyrim.nexusmods.com/mods/14152\r\n\r\n\r\n[color=orange][b]Thank you all and merry Christmas to you and your families! I\\'ll never forget, what you\\'ve done for me. =)[/b][/color]\r\n\r\n[color=orange][b]______________________________________________________________[/b][/color]\r\n\r\n\r\n[color=orange][b]My Other Mods:[/b][/color]\r\n\r\nIf you\\'re interested in my other works, I\\'d be glad to see/read you on one of the following pages:\r\n\r\n[color=lightblue][b]- TheWinterhawks Black Wolf Lodge[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/14660\r\n--> An upper class/noble playerhouse with horse stables, dogs and a farm maiden npc\r\n\r\n[color=lightblue][b]- TheWinterhawks Hunter Saddle With Variants[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/22755\r\n--> 3 hunter saddle variants\r\n\r\n[color=lightblue][b]- No More Stupid Dog Comments[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/21225\r\n--> Stops NPCs from saying: \\\"Stupid Dog!\\\"\r\n\r\n[color=lightblue][b]- TheWinterhawks Hunting Dog Retex[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/21293\r\n--> 4 similar variants to choose from (replacer only)\r\n\r\n[color=lightblue][b]- TheWinterhawks Dog Retex - Spots[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/26360\r\n--> A white dog puppy with black spots (available as retex and standalone)\r\n\r\n[color=lightblue][b]- Ice Floes - Travel the Polar Sea Dry-Shod[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/26194\r\n--> No more swimming in half frozen water to get to several locations, incl. Serpent\\'s Stone\r\n\r\n[color=lightblue][b]- TheWinterhawks Romantic Hut - Lunds Hut Overhaul[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/28352\r\n--> Small lore-friendly player house for Dovahkiin and his love\r\n\r\n[color=lightblue][b]- TheWinterhawks Decently Recolored Whiterun - Retexture[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/28599/\r\n--> Gives Whiterun a warmer, more cultivated look\r\n\r\n[color=orange][b]______________________________________________________________[/b][/color]\r\n\r\n\r\nHave fun and a romantic Christmas time, everyone!\r\n\r\nMERRY CHRISTMAS AND A HAPPY NEW YEAR 2013! Good Luck with lucky 13!\r\n\r\nDon\\'t drink too much, and if... only a good mead. ;)\r\n\r\nAnd let Rock and Metal rule... ^^\r\n\r\n\r\nRIDE ON, GUYS!\r\n\r\nTheWinterhawk =)\r\n\r\n\r\n\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "TheWinterhawk",
  "createdUnix": "1355573360",
  "updatedUnix": "1355966966",
  "containsAdultContent": false,
  "uploadedBy": "TheWinterhawk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105306",
      "name": "TheWinterhawks Romantic Hut in BSA archive",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3289",
      "fileName": "TheWinterhawks Romantic Hut in BSA archive-28352-v1-0.rar",
      "uploadedUnix": "1355573983",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2959c1b841d209b8525bce5de8b605c2b2ebbead4c8699d89029ce41c39cdec3/analysis/1407305286/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheWinterhawks%20Romantic%20Hut%20in%20BSA%20archive-28352-v1-0.rar?fid=105306&ttl=1535801689&ri=8192&rs=8192&setec=d0673d72ac41978a2b1cb54a18ebc215"
    },
    {
      "fileId": "105308",
      "name": "TheWinterhawks Romantic Hut Loose Files",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3050",
      "fileName": "TheWinterhawks Romantic Hut Loose Files-28352-v1-0.rar",
      "uploadedUnix": "1355574128",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/efaaaa661a16f12b60a5c35e2243ceadc769023188923d69bbe328cf590d3d77/analysis/1407305289/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheWinterhawks%20Romantic%20Hut%20Loose%20Files-28352-v1-0.rar?fid=105308&ttl=1535801689&ri=8192&rs=8192&setec=d20ffcdac284971eec1195a464485008"
    },
    {
      "fileId": "105538",
      "name": "OPTIONAL UPDATE v1_1",
      "version": "v1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "105",
      "fileName": "OPTIONAL UPDATE v1_1-28352-v1-1.rar",
      "uploadedUnix": "1355672209",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c5285857e9940679efc3ba4dd4471a7eaf4a427282ff4a206d339a13d6d35691/analysis/1407307292/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OPTIONAL%20UPDATE%20v1_1-28352-v1-1.rar?fid=105538&ttl=1535801690&ri=8192&rs=8192&setec=bde0a09490016b756a3317fe75f3a317"
    },
    {
      "fileId": "106289",
      "name": "OPTIONAL UPDATE v1_2",
      "version": "v1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "107",
      "fileName": "OPTIONAL UPDATE v1_2-28352-v1-2.rar",
      "uploadedUnix": "1355966966",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/29d6223e75d0bb892868bf1d62dd24a67ac098fae176f29e46f3a39fc5ee7203/analysis/1407312782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OPTIONAL%20UPDATE%20v1_2-28352-v1-2.rar?fid=106289&ttl=1535801690&ri=8192&rs=8192&setec=3f7803a5788356adba0291561e3aa758"
    }
  ]
}