{
  "modId": 28358.0,
  "modName": "Breezehome for Power Users",
  "summary": "(Retained for archival purposes only) This mod aims to provide Breezehome owners an extensive underground lair for which to create potions, enchant items, craft weapons and armors, as well as enjoying the simple pleasures of reading books, cooking food, or swimming in the heated pool. Empty version also available for CarlZilla&#39;s HCAD users.",
  "descriptionHtml": "[b]Notice to Users/Players:[/b] Due to some navmesh and CTD-related problems with this mod, especially as far as Hearthfire compatibility, game stability and &#34;cleanliness&#34; are concerned, I have decided that for the time being this mod is now effectively designated for archival purposes, and that [i]further future development of this mod will be halted[/i].\r<br />\r<br />Also note that this mod is NOT compatible with Breezehome Fully Upgradable, and therefore I do not recommend combining this mod with his, due to that 1.7.6. has made significant changes to Breezehome. Instead, you may place requests to Sku11m0nkey to possibly include follower quarters and an indoor pool/bath in future editions of his fine mod.\r<br />\r<br />I apologize and thank you for your understanding.\r<br />\r<br />[IMG]http://i34.photobucket.com/albums/d135/soulassassin547/skyrim/BPU_banner.jpg[/IMG]\r<br />[b][color=red]IMPORTANT: READ CLOSELY BEFORE INSTALLING OR UNINSTALLING[/color]\r<br />[color=yellow]WARNING: Requires Skyrim Update 1.8.151.0+ -- mod [i]can&#39;t[/i] be used with older versions of Skyrim&#33; \r<br />This mod also works best if your Skyrim is a legal Steam-enabled copy.[/color]\r<br />[color=yellow]Nexus Exclusive Mod -- Do NOT upload this file to other sites without my consent.[/color]\r<br />Compatible with Dawnguard and Hearthfire\r<br />Also, as this is a beta release (hence the &#34;b&#34; besides the version number) and thus a WIP, meaning to say I&#39;m still conducting compatibility testing and debugging, there will be some possible imperfections or odd bugs, especially in combination with other mods. \r<br />\r<br />Anything you see missing or something that doesn&#39;t look right, just leave a detailed comment (if English isn&#39;t your native language, use Google Translate before posting your comment). Thank you.\r<br />\r<br />DRAGONBORN USERS: If you experience any compatibility problems with this mod and the DLC, please leave a message and a detailed description of the bug. Again, thanks.[/b]\r<br />\r<br />[color=orange][b]What is it?[/b][/color]\r<br />This mod aims to provide Breezehome owners an extensive underground lair for which to create potions, enchant items, craft weapons and armors, as well as enjoying the simple pleasures of reading books, cooking food, or swimming in the heated pool (thanks to the experimental heating and water delivery system built out of Dwarven scraps, odds and ends).\r<br />\r<br />Oh yes, there is, of course, a simple bucket latrine tucked away in a small cubicle, a facility seen in a few places in the game world.\r<br />\r<br />And, um... a little surprise in the pump room.\r<br />\r<br />Finally, should you enter the basement, on the low table there&#39;s a notice from the previous Imperial owner of the secret hooch.\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/28358-1-1355822162.jpg[/img]\r<br />[color=orange][b]Features:[/b][/color]\r<br />[b]* Follower-friendly[/b] -- with an included navmesh, it means followers, spouses and children (in Hearthfire) can go anywhere and use any equipment inside the lair. Heck, even Lydia prefers to sleep in the workshop than at her own bedroom&#33;\r<br />[b]* Self-Contained[/b] -- the mod is highly separate and does not mess up with the vanilla home&#39;s layout, settings, or programming. Thus you can buy the alchemy set or the children&#39;s room without running into problems&#33;\r<br />[b]* Full Access[/b] -- even if you just bought the house but no plans to buy furniture, you can still have full access to the lair at no extra cost.\r<br />[b]* Study and laboratory room [/b]-- includes alchemy and enchanting tables, library, bookshelves, chests and strongboxes.\r<br />[b]* Workshop[/b] -- includes all the equipment needed to manufacture or upgrade armors, weapons or gear, plus a bed (blacksmithing can be very exhausting), more book, raw material and loot storage, and only a couple of single weapon plaques (sorry&#33;). There&#39;s some sufficient supply of ingots and leather on hand.\r<br />[b]* Hallway[/b] -- has wardrobe closets, bookshelves, and a 6-weapon rack.\r<br />[b]* Kitchenette and Pool[/b] -- has cooking spit, food barrels, wardrobe storage, bookshelves, Dwarven stone beds for you and two more followers, a basic latrine, and a heated pool, either to swim in or just relax.\r<br />\r<br />[color=orange][b]For CarlZilla&#39;s Home Construction and Decoration (HCAD) Users:[/b][/color]\r<br />I have also provided an 80%-empty version of this mod so that you can use HCAD (the next best thing since House Beautiful :P) to freely build and install furniture, crafting equipment, lighting fixtures, and other doodads, all the while there are [i]more[/i] weapon racks and bookshelves to peruse, plus much of the pool area has been kept intact, except for open areas for which you can do some extra interior design.\r<br />\r<br />[color=orange][b]Compatibility:[/b][/color]\r<br />I suppose that since I&#39;m using 1.8.151.0 of Skyrim, it means that it&#39;s possible that some of the content I used in the making of the mod may require you to update Skyrim to this version (if you&#39;re using an earlier version of the game, do tell me if there are any issues with this mod).\r<br />\r<br />Although I created the mod with Breezehome Fully Upgradable (BFUG) and HCAD compatibility in mind, in addition to normal usage of the vanilla home, some other Breeze mods (especially those that completely rewrite the house or its scripting) may or may not work with this mod; your mileage may vary.\r<br />\r<br />[color=red][b]Dawnguard and Hearthfire (Confirmed Working):[/b][/color] The trapdoor is sited away from the alchemy/children&#39;s room, and the mod is completely independent of the vanilla home&#39;s functionality (doesn&#39;t mess up with what furnishings you bought). Also, your adopted child can go downstairs and skulk around.\r<br />\r<br />For any issues, please leave a message (if it&#39;s a glitch, describe it in full) at the comments section or PM me; I&#39;ll try to resolve them as much as possible.\r<br />\r<br />[color=orange][b]Troubleshooting:[/b][/color]\r<br />If you experience an unusual glitch in which the water is still as a mirror, and if you swim in it then leave the pool with the underwater sound remaining, [b]the best solution is to be out of Breezehome for a couple of in-game weeks[/b], in order for the cell to completely recharge itself.\r<br />\r<br />[color=orange][b]Backstory:[/b][/color]\r<br />I originally came up with this idea while perusing several Breezehome mods (after my first favorite -- Breezehome Renovation with Bathroom -- became buggy with Dawnguard installed), picked Breezehome Fully Upgradable (BFUG) for more recent compatibility, but missed that big nice bathroom.\r<br />\r<br />Took me about three (or was it four?) nights to build the mod, then tested it, checked every nook and cranny, those (rather hard to build, but thank goodness for prefabs&#33;) activators, and fixed any bugs I could find. \r<br />\r<br />As for the design and layout, I didn&#39;t want to go overboard by adding too much clutter and plaques, but in keeping with the mod&#39;s lore, I imagine the former owner -- an Imperial technology research engineer who also moonlights as a practicing alchemist -- has the whole place equipped only for what he needs on a day-to-day basis.\r<br />\r<br />Although it&#39;s not new (there are other Breeze mods that almost have the same functionality as this), the result is just an all-in-one package, anything you simply need to improve your career in Skyrim.\r<br />\r<br />[color=orange][b]Installation:[/b][/color]\r<br />[b]* Nexus Mod Manager:[/b] After downloading, find the mod and activate it to install. If you have BFUG or HCAD, this mod has to be loaded _AFTER_ them.\r<br />[b]* Manual:[/b] open the 7zip folder, pick which mod to use, then drag and drop the .ESP file into Skyrim&#39;s Data folder. \r<br />\r<br />[color=orange][b]Uninstallation:[/b][/color]\r<br />Before uninstalling the mod, (1) open the console (tilde key or ~) and type the command \r<br />\r<br />[i]player.modav carryweight #[/i]\r<br />\r<br />where # is the maximum carryweight you can use to contain all of your possessions. In this case I recommend 9000 to 10000 (but you could try a bigger figure to fit everything in). Then press Enter and use tilde again to exit the console.\r<br />\r<br />Another better way (thanks to Saliand) to ease the load:\r<br />[quote]Little tip for uninstallation part.\r<br />Instead of increasing carryweight, you can also toggle god mod on. (tgm)\r<br />This is easier, faster and togglable, so you dont have to remember what was your carryweight.[/quote]\r<br />(2) go down to the basement, take anything you own and store from containers (drawers, closets, chests, strongboxes, safes), bookshelves, and weapon racks... \r<br />\r<br />And then (3) walk out of Breezehome, save the game (use New Save; all your stuff should be with you by then, but it&#39;s gonna be hard to walk back in later), and exit Skyrim. \r<br />\r<br />Now you can deactivate (from NMM) or delete the mod (the filename is Breezehome_for_Powerusers.esp or Breezehome_for_Powerusers_HCAD.esp).\r<br />\r<br />[color=orange][b]Upgrade (if it happens):[/b][/color]\r<br />Almost the same as uninstallation, except you first have to grab everything from the basement, exit Breezehome, save to a new gamefile, exit Skyrim.\r<br />\r<br />* In NMM, activate the new version and it&#39;ll ask you to overwrite; select Yes.\r<br />* For manual upgrading, open the 7zip file, click and drag over the .esp files to the data folder and overwrite the old .esps.\r<br />\r<br />[color=orange][b]Notices:[/b][/color]\r<br />Any planned changes to this mod will require my express permission, but redistribution or uploading of this mod to sites other than Nexus and without my authorization is prohibited.\r<br />\r<br />[color=orange][b]Acknowledgements/Shoutouts[/b][/color]\r<br />Breezehome Renovation with Bathroom (now defunct) -- LordY\r<br />Breezehome FullyUpgradable -- Sku11M0nkey\r<br />Home Construction and Decoration -- CarlZilla\r<br />Osare UNP armor mods -- anano\r<br />SkyRealism-ENB Evolved -- IndigoNeko\r<br />Activator Prefabs (best time-saver, bar none) -- ElDiabs \r<br />\r<br />Bethesda & Skyrim Nexus for the game and mod community.\r<br />\r<br />And my peeps at Animesuki.",
  "categoryId": "67",
  "version": "1.3Final",
  "author": "sa547",
  "createdUnix": "1355579020",
  "updatedUnix": "1358772635",
  "containsAdultContent": false,
  "uploadedBy": "sa547",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105330",
      "name": "Breezehome for Power Users",
      "version": "1.0b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28",
      "fileName": "Breezehome for Power Users-28358-1-0b.7z",
      "uploadedUnix": "1355579124",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/f37b08603ef1887a978daf78216a13ff983ee680c14c7282c38550cb96ab7937/analysis/1407305583/",
      "changelogHtml": " Initial public beta release. Includes lab (alchemy and enchanting) and study room; workshop (all equipment needed to manufacture or upgrade armor, weapons and other gear), kitchenette and pool. <br/> \n HCAD (blank) version also available; pool area left intact, with 80% of area clear for freestyle furniture arrangement. <br/> \n Mod cannot be used with older versions of Skyrim; requires 1.8.151.0 or later. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20for%20Power%20Users-28358-1-0b.7z?fid=105330&ttl=1535801700&ri=8192&rs=8192&setec=2e31f5c20392c6e8e3e79c3a026d4166"
    },
    {
      "fileId": "106373",
      "name": "Breezehome for Power Users",
      "version": "1.1b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24",
      "fileName": "Breezehome for Power Users-28358-1-1b.7z",
      "uploadedUnix": "1355992156",
      "modVersion": "1.1b",
      "virusScanUrl": "https://www.virustotal.com/file/ac957281dcf679ca05bb34eacbb95fafc70c8b215d92b936f6fe81b20b640534/analysis/1407313396/",
      "changelogHtml": " New release no longer includes HCAD version, which is now a separate mod <br/> \n For realism reasons, forge has been replaced with anvil and a fireplace.  <br/> \n Optimized lighting to increase performance <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20for%20Power%20Users-28358-1-1b.7z?fid=106373&ttl=1535801700&ri=8192&rs=8192&setec=54fa38799519cbc69d6bde0a8b36deaf"
    },
    {
      "fileId": "106375",
      "name": "Breezehome for Power Users HCAD version",
      "version": "1.0b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "Breezehome for Power Users HCAD version-28358-1-0b.7z",
      "uploadedUnix": "1355992218",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/f4057280ee05849105d868b608fc4ccb9bfacb8709c8c7884f6caa70dbdf2f93/analysis/1407313399/",
      "changelogHtml": " Initial public beta release. Includes lab (alchemy and enchanting) and study room; workshop (all equipment needed to manufacture or upgrade armor, weapons and other gear), kitchenette and pool. <br/> \n HCAD (blank) version also available; pool area left intact, with 80% of area clear for freestyle furniture arrangement. <br/> \n Mod cannot be used with older versions of Skyrim; requires 1.8.151.0 or later. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20for%20Power%20Users%20HCAD%20version-28358-1-0b.7z?fid=106375&ttl=1535801701&ri=8192&rs=8192&setec=9dddc47f1a0303f222aa2e25015b873f"
    },
    {
      "fileId": "1000003987",
      "name": "Breezehome for Power Users",
      "version": "1.3Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "Breezehome for Power Users-28358-1-3.7z",
      "uploadedUnix": "1358772635",
      "modVersion": "1.3Final",
      "virusScanUrl": "https://www.virustotal.com/file/6c3c9b76c96abcedb7a0e99729998d837f383f5f031bdda44ea7738ff010786d/analysis/1407372004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20for%20Power%20Users-28358-1-3.7z?fid=1000003987&ttl=1535801701&ri=8192&rs=8192&setec=46c2b66ef21ec081fd69d98003db456a"
    }
  ]
}