{
  "modId": 28404.0,
  "modName": "PENITUS OCULATUS - RED - OUTFIT",
  "summary": "Praetorian Guard better Armory Outfit for male and female Imperial Penitus Oculatus (RED Color Version)",
  "descriptionHtml": "Salve Praetorians. This is the Red Color Version. Some users wished to have red instead of Purpur color. Here it is.\r\n\r\nThis is mainly a texture improvement and has no influence on the standard configuration but only with the details on the imperial special secret service guard (praetorians) called PENITUS OCULATUS.\r\n.No need to replace any Meshes in this version.\r\nBefore copying the files I recommend you to \\\\\\\\\\\\\\\"backup\\\\\\\\\\\\\\\" the same named files on your extra data-backup folder in case that you perefer to go back to the standard vanilla design textures later on.\r\n\r\nResult items improved:\r\n- Armor outfit more roman and more detailed\r\n- Helmet with a dragon engraved (like an original roman cavalry embossing reference)\r\n\r\nEasy Installation:\r\n\r\n- Replace the single files manually in the named folder structure\r\n- If you do not have a \\\\\\\\\\\\\\\"generaltulius\\\\\\\\\\\\\\\" folder already the copy the complete folder\r\n- If you want an extra buckler with scorpio design active ingame them copy also the buckler and the esp filer\r\n- restart the game\r\n\r\nCredits:\r\nThanks to our cool roman expert and french friend which ESP file I may use.\r\n\r\nRisks:\r\nAll modding changes are used at own risk. But texture changes in general do not have a big risk/effect on the game at all.\r\nHave fun with this addition for a excellent reputation ingame. Feel free to use the Penitus Oculatus stuff for your own avatar.\r\n\r\nIn various missions you can find the armor, but its to sneak around and to be sassy and take it before someone discover your intensions :-)\r\nIf you cannot find the armor ingame its easy to add some via console (cheating)\r\n- Penitus Oculatus Armor ID player.aditem 000D3EA0 1\r\n- Penitus Oculatus Helmet ID player.aditem 000D3EAA 1\r\n\r\nThank you for sharing this and have fun.\r\nVeryFluffy4 for Skyrim Nexus\r\n",
  "categoryId": "60",
  "version": "1.0",
  "author": "VeryFluffy4",
  "createdUnix": "1355657245",
  "updatedUnix": "1355657618",
  "containsAdultContent": false,
  "uploadedBy": "Veryfluffy4",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105500",
      "name": "PENITUS_OCULATUS_RED",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15969",
      "fileName": "PENITUS_OCULATUS_RED-28404-1-0.zip",
      "uploadedUnix": "1355657618",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c6bb8ceafc2d23625723bfa7962501e8662defe532fd66c235834c8f87556a89/analysis/1407306972/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PENITUS_OCULATUS_RED-28404-1-0.zip?fid=105500&ttl=1535801768&ri=8192&rs=8192&setec=0f2cfa16ec703ed5a6ebfbd95c4591d1"
    }
  ]
}