{
  "modId": 28413.0,
  "modName": "Arctic khajiit Race",
  "summary": "Adds a new Arctic khajiit race.\r\nA khajiit race that has adapted to the climates of skyrim, with it\\'s skills. \r\nHas 75% resistance to frost from thick fur.\r\nLower sneak bonus than a Khajiit, better light armor skill, better one handed and block skill. Much higher speech skill. And different camouflage to suit the landscape of skyrim(obviously diff",
  "descriptionHtml": "Adds a new Arctic khajiit race.\r\nA khajiit race that has adapted to the climates of skyrim, with it\\'s skills. \r\nHas 75% resistance to frost from thick fur.\r\nLower sneak bonus than a Khajiit, better light armor skill, better one handed and block skill. Much higher speech skill. And different camouflage to suit the landscape of skyrim(obviously different to elsweyr)\r\n\r\nSuper tough: fast stamina regen, though not much stamina. Nearly no magicka and the same Health as a khajiit.\r\n\r\nBackground as requested \r\n\r\nThe Arctic Khajiit, are descended from the first Khajiit traders to explore Skyrim. When they first came to Skyrim they use to collect food and resources during the summer, store them in a cave and hibernate through the winter. They couldn\\'t simply sleep through this faux hibernation period, so they would be conscious all through winter, unfortunately this huge group of Khajiit would run out of food every winter and starve. Rockjoint would develop every winter and another member would be eaten. Usually the least fit with little combat skills. This continued every year until out of the dozen that had come, only several were left these were the strongest of the Khajiit that had migrated, the eight loyal brothers that would never betray one another. Though paranoid of each other they lived on ever cautious after seeing what they were all willing to do to survive. The next winter they stayed out and decided to migrate to a different cave each night, hunting deer and drinking from the lakes. By the next winter 4 had died from the cold, 2 had died from hunger due to little hunting experience the second last died from heavy footedness, scaring away the deer before he could even see them for himself. The last of the brothers returned to Elsweyr with a story to tell. His tales impressed many potential mates, he lived in the company of women always. He had many children he called them his Arctic sons, he told them tales of Skyrim and the beauty of the mountains, the white powder that falls from the sky and covers the earth. The Khajiit brother finally grew old and fell ill. In his passing his sons decided one day to see this Skyrim for their own eyes, so they took a group of females and travelled to the land of white powder. They stumbled upon what their father had not, a Nordic settlement, they made some fast money introducing skooma to the locals and bought a house. They soon decided to move and get themselves a cave instead; they lived like their father, produced many children and lived well. Every so often one would migrate into nord society, these are the Arctic khajiit.\r\n\r\n\r\nBig thanks to [SA] Orpheus for help with Lore and testing",
  "categoryId": "34",
  "version": "",
  "author": "Jamface12",
  "createdUnix": "1355666734",
  "updatedUnix": "1355667070",
  "containsAdultContent": false,
  "uploadedBy": "Jamface12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105526",
      "name": "Arctic_Khajiit",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Arctic_Khajiit-28413-2.rar",
      "uploadedUnix": "1355667070",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/ba5d8343ba0abdebd3bc64dc34a3e05be7d74e03d888061e17cf36a3e7e94874/analysis/1407307203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arctic_Khajiit-28413-2.rar?fid=105526&ttl=1535801779&ri=8192&rs=8192&setec=63551e370c3ece107ed0e76a2671873f"
    }
  ]
}