{
  "modId": 28421.0,
  "modName": "DUT - Essence Enchanting",
  "summary": "An alternative to the vanilla enchanting system, designed to give blacksmithing characters a different path towards enchanted armor.",
  "descriptionHtml": "[CENTER][SIZE=6][B]Dark Uncle\\'s Tweaks -- Essence Enchanting[/B][/SIZE][/CENTER]\r\n\r\nGo [URL=http://forums.bethsoft.com/topic/1428993-wipz-dut-essence-enchanting-an-alternative-to-vanilla-enchanting/]here[/URL] for the discussion thread on Bethesda Forums\r\n \r\n[SIZE=4][COLOR=#ff0000][B]What this mod is:[/B][/COLOR][/SIZE]\r\nThis mod is an alternative (not a replacement) to the vanilla enchanting system, focused on allowing smithing characters to have some limited ability to melt down enchanted rings and necklaces, and incorporate the results into crafted armor... managing to maintain a limited amount of said enchantment in the process.\r\n \r\nFrom an RP standpoint, I wanted to create this mod for characters that I have who want to have more control over their magic gear than just using whatever random hodge-podge they hapen to find from vanilla loot tables... yet for whom learning and employing the mystical methods of enchanting just made no sense.\r\n \r\n[SIZE=4][COLOR=#ff0000][B]Mod requirements:[/B][/COLOR][/SIZE]\r\nNo other mods are required. However, since the crafting recipes are all hidden from view unless you have the required materials on hand, it is strongly suggested that you read through the information below on how this mod works so that you are at least aware of what possibilities are included.\r\n \r\n[SIZE=4][COLOR=#ff0000][B]How it works:[/B][/COLOR][/SIZE]\r\nIn short, in goes like this:\r\n \r\n1) Use a smelter to melt down enchanted rings and amulets into \\\\\\\"essensces\\\\\\\" that hold the power of that particular enchantment\r\n2) Use a forge to combine a piece of armor with a number of essences to give that piece of armor a lesser form of the same type of enchantment\r\n3) If you have more of the same type of essence, combine the enchanted armor with additional essences to increase the power of the armor\\\\\\'s enchantment\r\n \r\nA few additional points:\r\n[LIST]\r\n[*]Only certain enchants, and certain items to be enchanted, are viable options with this system. See below.\r\n[*]All related recipes for both the smelter and forge are \\\\\\\"hidden\\\\\\\" unless you have the appropriate materials on hand. This helps avoid the clutter of what would otherwise be over a thousand recipes showing up.\r\n[*]The strength of the resulting enchantment is reliant only on the materials put in, not your skill level or perks. However, certain skill level (and a single perk) is required to imbue the armor with any given enchantment in the first place.\r\n[*]All possible enchants in this mod are the same vanilla enchants that already exist on other items in game - although there are some combinations of enchants and armor slots that are not otherwise \\\\\\\"allowed\\\\\\\" by the vanilla enchanting system.\r\n[*]This mod creates several hundred armor records (each combination of armor piece and enchant level that didn\\\\\\'t already exist in the vanilla game), but does not add them to loot or vendor lists - nor do I intend to. I don\\\\\\'t want to \\\\\\\"dilute\\\\\\\" the loot tables, so I\\\\\\'m leaving them as they are and/or for other mods to play around with. The new armor items here are only available via crafting.[/LIST]\r\n \r\n[SIZE=4][COLOR=#ff0000][B]A working example:[/B][/COLOR][/SIZE]\r\n1) At a smelter, melt down a \\\\\\\"Ring of Extreme Health\\\\\\\" (+60 health, 5th level enchantment) - this results in five \\\\\\\"Essence of Health\\\\\\\"\r\n2) At a forge, combine two \\\\\\\"Essence of Health\\\\\\\" with your \\\\\\\"Iron Armor\\\\\\\" - this results in \\\\\\\"Iron Armor of Minor Health\\\\\\\" (+20 health, 1st level enchantment)\r\n3) Again at a forge, combine two more \\\\\\\"Essence of Health\\\\\\\" with your \\\\\\\"Iron Armor of Minor Health\\\\\\\" - this results in \\\\\\\"Iron Armor of Health\\\\\\\" (+30 health, 2nd level enchantment)\r\n4) At this point you\\\\\\'d still have a single \\\\\\\"Essence of Health\\\\\\\" remaining for use later on. If you had more from other melted down jewelry, you could use three to increase your armor to \\\\\\\"Iron Armor of Major Health\\\\\\\" (+40 health, 3rd level enchantment) and so on.\r\n \r\n[SIZE=4][COLOR=#ff0000][B]Specific details:[/B][/COLOR][/SIZE]\r\nOnly the following enchants are available via essense enchanting (other more \\\\\\\"complex\\\\\\\" enchants break down and cannot survive the smelting process):\r\n \r\n[CENTER]Fortify Health / Fortify Magicka / Fortify Stamina / Resist Fire / Resist Frost / Resist Shock / Resist Magic[/CENTER]\r\n \r\nOnly vanilla enchanted rings and necklaces can be melted down into the essense of their enchantment (only the smaller amount of metal result in concentrated enough \\\\\\\"essence\\\\\\\" for combining with armor). Melting down enchanted jewelry with the right enchant, results in a number of the following:\r\n \r\n[CENTER]Essense of Health / Essence of Magicka / Essence of Stamina\r\nEssence of Firewalking / Essence of Warmth / Essence of Grounding / Essence of Nullification[/CENTER]\r\n \r\nNote that only certain essense types can be combined with certain armor items/slots. Specifically:\r\n[LIST]\r\n[*]Helmets/Head: Fortify Health, Resist Frost\r\n[*]Curiass/Body: Fortify Health, Fortify Magicka, Fortify Stamina, Resist Magic\r\n[*]Gauntlets/Hands: Fortify Magicka, Resist Shock\r\n[*]Boots/Feet: Fortify Stamina, Resist Fire\r\n[*]Shield: Resist Fire, Resist Frost, Resist Shock, Resist Magic[/LIST]\r\nEach enchantment has six levels - this is true both of the vanilla enchanted items, and of items enchanted with this mod. For example, there are six different levels of health granting necklaces - starting with the \\\\\\\"Necklace of Minor Health\\\\\\\" (+20) moving all the way up to the \\\\\\\"Necklace of Peerless Health\\\\\\\" (+70). When melting down an enchanted ring or necklace, you create one essence per \\\\\\\"level\\\\\\\" of the enchantment. However the enchantemnt loses some of its potency in the process - thus imbuing armor with the enchantment takes two essences for each of the first two levels, three each for the third and fourth levels, and four each for the fifth and sixth levels. Note that these numbers are designed to provide a bit of balance, while also not forcing players to \\\\\\\"hoard\\\\\\\" essences and ONLY use them with end-game armor.\r\n \r\nIn addition to having the needed materials on hand, there are also smithing requirements to use essences / apply enchants, as follows:\r\n[LIST]\r\n[*]All enchants require the Arcane Smithing perk\r\n[*]1st level enchants require 60 Smithing (already required to take the perk)\r\n[*]2nd level enchants require 70 Smithing\r\n[*]3rd level enchants require 80 Smithing\r\n[*]4th level enchants require 90 Smithing\r\n[*]5th and 6th level enchants require 100 Smithing[/LIST]\r\n \r\n[SIZE=4][COLOR=#ff0000][B]Current development progress:[/B][/COLOR][/SIZE]\r\nIron Armor: [COLOR=#92d050]complete[/COLOR]\r\nBanded Iron Armor: [COLOR=#92d050]complete[/COLOR]\r\nSteel Armor: [COLOR=#92d050]complete[/COLOR]\r\nDwarven Armor: [COLOR=#92d050]complete[/COLOR]\r\nSteel Plate Armor: [COLOR=#92d050]complete[/COLOR]\r\nOrcish Armor: [COLOR=#92d050]complete[/COLOR]\r\nEbony Armor: [COLOR=#92d050]complete[/COLOR]\r\nDragonplate Armor: [COLOR=#92d050]complete[/COLOR]\r\nDaedric Armor: [COLOR=#92d050]complete[/COLOR]\r\nStudded Armor: [COLOR=#ff0000]not yet implemented[/COLOR]\r\nLeather Armor: [COLOR=#ff0000]not yet implemented[/COLOR]\r\nElven Armor: [COLOR=#ff0000]not yet implemented[/COLOR]\r\nScaled Armor: [COLOR=#ff0000]not yet implemented[/COLOR]\r\nElven Gilded Armor: [COLOR=#ff0000]not yet implemented[/COLOR]\r\nGlass Armor: [COLOR=#ff0000]not yet implemented[/COLOR]\r\nDragonscale Armor: [COLOR=#ff0000]not yet implemented[/COLOR]\r\n \r\nNote: I do not plan to implement this mod for Fur or Hide armor. From a lore standpoint, those armors don\\\\\\'t have enough metal bits to combine the essences with. However, while they are not listed above yet, I do plan to address several of the other armor sets like Wolf, Blades, Ancient Nord, etc.\r\n \r\n \r\n[SIZE=4][COLOR=#ff0000][B]Additional future plans:[/B][/COLOR][/SIZE]\r\nEventually I plan to create patches to support/include other armor mods. How many and which ones may depend on how much demand there is for such a thing... but when making requests please do keep in mind that for a single custom armor set, a minimum of 168 new records must be created to support it (or 120 if there is no shield).\r\n\r\n\r\n[SIZE=3][COLOR=#ff0000][B]Version info:[/B][/COLOR][/SIZE]\r\n[LIST]\r\n[*]v 0.1 - initial release[/LIST]\r\n",
  "categoryId": "24",
  "version": "0.1",
  "author": "DarkUncleBoh",
  "createdUnix": "1355675593",
  "updatedUnix": "1355675703",
  "containsAdultContent": false,
  "uploadedBy": "DarkUncleBoh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105548",
      "name": "DUT-EssenceEnchanting",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18",
      "fileName": "DUT-EssenceEnchanting-28421-0-1.7z",
      "uploadedUnix": "1355675703",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/436d0905fe6a76e16ee5cdf8e2cae74190f916dce4c3d571697127710109b836/analysis/1407307384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DUT-EssenceEnchanting-28421-0-1.7z?fid=105548&ttl=1535801794&ri=8192&rs=8192&setec=521349d16552f39ecb18cd73b7130a14"
    }
  ]
}