{
  "modId": 28436.0,
  "modName": "Lakeview Manor Underhall",
  "summary": "This adds the Underhall with a secret entrance under your Hearthfire DLC Lakeview Manor player home. It adds a tower on top of the peaks overlooking your home accessed from inside the mountain via the Underhall. It adds a new NPC follower named Tasvius, an elderly magic user.\r\n",
  "descriptionHtml": "[center][IMG]http://i599.photobucket.com/albums/tt73/SoderPWI/Skyrim/LakeviewText1_zps5d80fc07.png[/IMG][/center]\r\nUnbeknownst to you, the site of your Lakeview Manor home was once the site of a secret society of warriors. When you built your manor there was a burned out basement that just needed excavating and repair.... Now you notice a key in your new home\\'s basement.... \r\n\r\nThe Underhall has access via your Hearthfire Lakeview Manor basement (you will find a key in the basement). There is also a secret door outside (down the hill toward the lake).  You may be able to use the mod without the Hearthfire DLC, I\\'m not sure. You may just use the secret entrance and the trapdoor to the Manor basement will always be locked since you can\\'t get the key... Not sure, since I have the DLC and did not test without it.\r\n\r\nThe magic using follower, Tasvius, is still in the Underhall keeping it maintained for all these years. He will level with you up to 100. He is the last survivor of the secret society... or is he?\r\n[IMG]http://i599.photobucket.com/albums/tt73/SoderPWI/Skyrim/Tasvius01_zpse08e88d7.jpg[/IMG]\r\n\r\nIt adds a tower on top of the peaks overlooking your home accessed from inside the mountain via the underhall. A nice view from up on the peak!\r\n\r\nThis is version 1.0 so if you notice any glitches... constructive criticism and comments welcome.\r\n\r\n[b]Installation:[/b]\r\nInstall with NMM \r\nor\r\nManual install by extracting the archive file and placing the folders and file in your data structure.\r\nExample:(C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\Skyrim\\\\Data)\r\n\r\nRequest permission to modify my file; including releasing bug fixes or improving on the features my file adds to the game. Request permission to use assets contained in my files.\r\n\r\n[b]Uninstall:[/b]\r\nRemove the key from your inventory prior to uninstall.\r\n\r\n[b]Requirements:[/b]\r\nSkyrim patch 1.8.151.0.7 or greater.\r\nHearthfire DLC required.",
  "categoryId": "67",
  "version": "1.0",
  "author": "DigitalSky",
  "createdUnix": "1355691138",
  "updatedUnix": "1355876602",
  "containsAdultContent": false,
  "uploadedBy": "DigitalSky",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106081",
      "name": "DSLakeviewUnderhall",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "539",
      "fileName": "DSLakeviewUnderhall-28436-1-0.7z",
      "uploadedUnix": "1355876602",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1c017a21cb8e23a68b495093e197be693038dd1c7a5ee74f45e2aeb9c3bddfc/analysis/1407311231/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DSLakeviewUnderhall-28436-1-0.7z?fid=106081&ttl=1535801817&ri=8192&rs=8192&setec=fa538d28c9780060026628145aa89cf9"
    }
  ]
}