{
  "modId": 28448.0,
  "modName": "Skyvoice",
  "summary": "Voice control for skyrim",
  "descriptionHtml": "Now featured on:\r<br />[url=http://skyrimgems.com/][img]http://www.skyrimgems.com/images/badge_featured_500.png[/img][/url]\r<br />\r<br />============================IMPORTANT=====================================\r<br />You need to sign the macro file by right clicking it and selecting &#34;sign speech macros&#34;\r<br />\r<br />If you don&#39;t know what this is about, read the instructions.\r<br />==========================================================================\r<br />[line]\r<br />[heading][color=Darkgoldenrod]Description[/color][/heading]\r<br />Welcome to SkyVoice, a tool that allow you to shout at your screen and see the results in-game&#33;\r<br />\r<br />See the compatibility section for the keys you need to keep unbound.\r<br />Found a problem? [url=https://bitbucket.org/Asmodae/skyvoice/issues]Report a bug[/url]\r<br />[heading][color=Darkgoldenrod]Testimonials[/color][/heading]\r<br />Tarvaln says:\r<br />[quote]I just want to thank you again for this mod. It has been a blast using it. I rarely used shouts before and now I&#39;m running around trying to get all the words. It makes me feel like I have to really learn the shouts instead of just hitting some buttons and &#34;knowing&#34; them. Here&#39;s a funny true story for you:\r<br />I was fighting a dragon priest and trying to shout at him. However, in panic, I kept mispronouncing the words. I was getting my ass handed to me. I was out of mana and potions and out of desperation after misspeaking shouts 20 times I cried out &#34;By the power of Greyskull&#33;&#34; I then promptly died.\r<br />Even though I died it was one of the best experiences I&#39;ve had with the game. So, thank you.[/quote]\r<br />\r<br />[heading][color=Darkgoldenrod]Change Log[/color][/heading]\r<br />[b]1.3[/b]\r<br />[list][*]Added Thunderchild Support.  Thunderchild shouts are all prefixed with the dova word Aav, so you need to say for Thunderchild&#39;s Earthquake shout:   &#34;aavfus&#34;        - level one  &#34;aavfus klo&#34;    - level two  &#34;aavfus klu ul&#34; - level threeSee the macro file for all the shouts and names, you need to update the macros as well.[/list]\r<br />[b]1.2[/b]\r<br />[list][*]Changed Keys Again. Due to how windows macros handles AZERTY keyboard, my previous key selections weren&#39;t a good idea. Changed back to using function keys, but now they&#39;re F7 F8 F10 F11. NOTE: You MUST do a clean save for the new keys to register properly.  Many thanks to users that submitted the bug and helped troubleshoot it&#33;  Hopefully this version works better for you[*]Also fixed the MCM display bug, option changes should stick and display correctly[/list]\r<br />[b]1.1[/b]\r<br />[list][*]removed an extra old Way of the Voice reference, shouldn&#39;t cause any problems, but just in case[/list]\r<br />[b]1.0[/b] - At Long Last, no more Beta\r<br />[list][*]Changed the keys used by the mod, they are now ;&#39;[]  This resolved conflicts with other mods (notably ENBoost), and the occasional auto-close for users who ran (hold Alt) and used a shout with F4 in it. (alt-F4 closes the top window, bad mix-up)[*]Changed the name of all script and mod files to SkyVoice.  I debated this for a while, but weird named files in your folders are just annoying.  I hope to get to the optional files soon.  Many apologies to the BOSS maintainers, hopefully it won&#39;t be too much trouble.[*]Added Equip Only option[*]Updated MCM to new SkyUI version (no functional change here, but it did need some script changes[*]Potential fix for keybinding issue if you rebound your shoutkey to something other than z AND use a gamepad (I don&#39;t have a gamepad so please report if this doesn&#39;t work for you)[*]Added Falskaar support (untested at this time), the macro file may need some tweaking but the code is in the script now, let me know if this works for Falskaar users[/list]\r<br />[b]BETA5[/b]\r<br />[list][*]Added Sky UI MCM Support, currently only two options - turning off shout notification and disabling voice power re-equip.[*]Changed how the mod loads, now loads all needed shout information every save game load.  This requires a clean-save when upgrading from previous versions.  New installs should be good to go to just add.[*]With the Beta5 main file and macro file we should be dragonborn ready&#33; Have fun&#33;[/list]\r<br />[b]BETA4.1[/b]\r<br />SCRIPT \r<br />[list][*]Rebinding shout keys mid game should now work properly (even with an xbox controller provided you&#39;re using the controller add-on)[*]Should be much less susceptible to being in an unkown state and missing the correct shout commands.  Note: in testing this still sometimes happens, but it&#39;s much less common now. [*]Dawnguard support now built into one file.  No more need for separate mods to download/maintain[*]Added single line of feedback in skyrim to say what shout was detected.  This will work even if you don&#39;t currently KNOW the shout, as the voice system doesn&#39;t care. Skyrim will only cast shouts you know however.[*]Split out word of power renaming (adds readability/usability) into separate mod files. These will rarely (if ever) need to change.[/list]\r<br />MACROS\r<br />[list][*]Made first word optional for all shouts.  This means you can get &#34;FUS RO DA&#34; with just RO DA.  In a tense fight this is precious seconds of time.  It is completely optional, use it or don&#39;t.  This also means if you only know the &#34;FUS&#34; you can say &#34;RO&#34; and get just &#34;FUS&#34;.  The script will always cast the highest matching shout level you know.[/list]\r<br />[b]Beta4[/b]\r<br />[list][*]Fixed bugs in code, should be more reliable.[*]The macros will now pick way less background noise.[/list]\r<br />\r<br />[heading][color=Darkgoldenrod]Installation Details[/color][/heading]\r<br />What do I need?\r<br />[list][*]The latest version of Skyrim[*]The latest version of SKSE[*]A microphone[*]Windows Vista/7/8 (sorry XP users :( ) in a language that support Speech recognition.[*]Windows Speech Recognition Macro (get it here: [url=http://www.microsoft.com/en-us/download/details.aspx?id=13045]http://www.microsoft.com/en-us/download/details.aspx?id=13045[/url]  IMPORTANT - Microsoft requires you to use Internet Explorer to authenticate the download.[/list]\r<br />[line]\r<br />[color=Darkgoldenrod][b]How do I get started?[/b][/color]\r<br />\r<br />[color=Darkgoldenrod]------------- [b]Setup Windows Speech Recognition (WSR)[/b] ---------------------[/color]\r<br />First, you need to set Windows Speech Recognition, following these instructions: [url=http://windows.microsoft.com/en-US/windows7/Set-up-Speech-Recognition]http://windows.microsoft.com/en-US/windows7/Set-up-Speech-Recognition[/url]\r<br />\r<br />[color=Darkgoldenrod]------------- [b]Install WSR Macros[/b] ---------------------[/color]\r<br />This is a separate tool that allows setting up custom macros for WSR. We use this for sending keystrokes to SKSE-Skyrim for the various shouts. To get it setup you Install Windows Speech Recognition Macro executable, that you downloaded from the link above. You must use Internet Explorer for the download, &#39;cause Microsoft.  (Note: although on the WSR Macro page it says it only supports English, it will work for any language supported by Speech recognition)\r<br />\r<br />[color=Darkgoldenrod]------------- [b]Install Way of the Voice MACRO File[/b] ---------------------[/color]\r<br />[list=1]\r<br />[*]Download the WotV - Macros Pack from this Nexus page. This is the manual download file, it cannot be installed with a mod manager as it doesn&#39;t go in the Skyrim directory. Extract it to the Speech Macros folder (default is c:/Users/[YourName]/My Documents/Speech Macros) ... (Or you can navigate from the start menu: start-&gt;Documents-&gt;Speech Macros)\r<br />[*]Right click the WayoftheVoice.WSRMacro file, and select &#34;sign speech macro&#34;.\r<br />[*]Start WSR Macro. It automatically starts Speech recognition if it isn&#39;t already running.\r<br />[/list]\r<br />NOTE: If the Macro stuff is unclear to you, I (Asmodae) made a video (see below) to hopefully make things a bit easier. It&#39;s not a very good video (first one ever&#33;) though so if anyone wants to contribute something more polished, please do&#33;&#33;\r<br />\r<br />[color=Darkgoldenrod]------------- [b]Install ESP File[/b] ---------------------[/color]\r<br />There is one main file, download it and activated it with your favorite mod manager (or by hand).  \r<br />THere are TWO optional files that change the name of the words of power in the GUI.  These just show you English version of the words so you can know what each shouts vocalizations sound like.  These are completely optional for convenience so you don&#39;t have to tab out of Skyrim to remember what shout was which words. There are some other mods out there on the nexus that do similar types of renaming, check out &#34;Shouts in the Dragon Tongue&#34;.\r<br />\r<br />In the future we might be able to do something via script that allows us to merge all these into one file, but since the word renaming changes game records, and those records have masters, there needs to be separate vanilla and Dawnguard versions.\r<br />\r<br />[color=Darkgoldenrod]------------- [b]Time to get it all running[/b] ---------------------[/color]\r<br />Now that you have everything you need in place we need to start the WSR Macro tool. It will be in your installed programs list. Make sure Speech Recognition and WSR Macro are running. WSR is that microphone/text doodad attached to your screen and WSR Macro is an icon in your system tray. When they&#39;re both running start Skyrim. You can now use your voice to Shout&#33;\r<br />\r<br />Be sure to check the readme with the mod. It contains some pronunciation guidelines for the different shouts.\r<br />\r<br />All done&#33;\r<br />\r<br />[b]Additional Optional Files[/b]\r<br />\r<br />User CommanderNeph has created a couple of the additional optional files for the DLCs, kudos and thanks&#33;&#33;&#33;&#33; \r<br />[url=http://skyrim.nexusmods.com/mods/34012/?]Words of power renamed for DragonBorn.[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/34163/?]Silent shout files, if you want silent shouts for the DLCs go here.[/url]\r<br />\r<br />[heading][color=Darkgoldenrod]NOTE - When Upgrading to Beta4.1[/color][/heading]\r<br />It is important to do a clean save.  De-activate the mod, load your game, save, quit skyrim, activate the new version of the mod, load.  SHOUT&#33;\r<br />\r<br />\r<br />[b]Uninstall[/b]\r<br />=========\r<br />1) De-activate the mods\r<br />2) Uninstall WSR Macros\r<br />3) Delete macro files\r<br />\r<br />[color=Darkgoldenrod][heading]Tips and Tricks[/color][/heading]\r<br />[color=Darkgoldenrod]Where&#39;s the safety switch?[/color] - There currently is no thuumic like safety mechanism for towns, etc.\r<br />But it may not be necessary.  Through the MACRO file, we are using Windows speech recognition system directly.  One handy aspect of that is that you can toggle it on and off from any application by hitting Ctrl-Windows keys together (provided your keyboard has a Windows key).\r<br />\r<br />[color=Darkgoldenrod]WSR is not recognizing your shouts: [/color]\r<br />Above all else, we&#39;ve tried to keep the shout pronunciation as it is done in game.  However for some shouts they sound close, and others Windows Speech just fights tooth and nail to NOT hear it the way it is in game.  So in those cases it might be useful to try this alternate pronunciation guide:\r<br />\r<br />[color=Sandybrown]Raan:[/color] &#34;Ran&#34; or &#34;Rah-an&#34; or something similar will work fine.\r<br />[color=Sandybrown]Laas:[/color] &#34;Laas&#34; or &#34;Laaz&#34; should be good, say clearly the s or z at the end, like &#34;laass&#34;.\r<br />[color=Sandybrown]Feim:[/color] Hard one, if you have trouble, try to say &#34;Fame&#34; or &#34;Fime&#34;.\r<br />[color=Sandybrown]Od:[/color] Just don&#39;t forget the &#34;d&#34;.\r<br />[color=Sandybrown]Hun[/color]: try &#34;Hoon&#34; if you have trouble.\r<br />[color=Sandybrown]Lok:[/color] You need a very hard &#34;k&#34; at the end. Try saying &#34;Luck&#34; if you have trouble.\r<br />[color=Sandybrown]Zun:[/color] Very hard to differentiate from &#34;Zul&#34;. Try saying &#34;Zun&#34; as &#34;Zoon&#34; and &#34;Zul&#34; as &#34;Zoole&#34;.\r<br />[color=Sandybrown]Faas:[/color] &#34;Fah-as&#34; is pretty much the way to go.\r<br />[color=Sandybrown]Joor:[/color] Say it as &#34;Joor&#34;, should be good.\r<br />[color=Sandybrown]Su:[/color] Try saying it as &#34;Soo&#34; if you have trouble.\r<br />[color=Sandybrown]Yol:[/color] Prety easy, try &#34;Yole&#34; if it gives you trouble.\r<br />[color=Sandybrown]Fo:[/color] As it sound, should not have problems with this one.\r<br />[color=Sandybrown]Iiz:[/color] Try the very fitting &#34;Ice&#34;.\r<br />[color=Sandybrown]Kaan:[/color] Insist on the &#34;K&#34; to differentiate it from &#34;Raan&#34;\r<br />[color=Sandybrown]Krii:[/color] Hard one, try &#34;Kre-e&#34; if you can&#39;t get it to work.\r<br />[color=Sandybrown]Tiid:[/color] &#34;Ti-id&#34; or &#34;Tee-eed&#34; if you have trouble\r<br />[color=Sandybrown]Strun:[/color] &#34;Stroon&#34; if you have trouble, but it is a reliable one.\r<br />[color=Sandybrown]Zul:[/color] See Zun.\r<br />[color=Sandybrown]Fus:[/color] Try &#34;Foos&#34; if you can get it to work\r<br />[color=Sandybrown]Wuld:[/color] As &#34;Would&#34;\r<br />[color=Sandybrown]Gaan:[/color] As most double letters, try &#34;Ga-an&#34;\r<br />[color=Sandybrown]Rii:[/color] Say it reee or with two &#34;i&#34;s , and you should be good\r<br />[color=Sandybrown]Dur:[/color] Whathever, no one uses the single word version of this shout.\r<br />\r<br />\r<br />Now, depending of the way you actually say the shouts, some may not work. No problem&#33;\r<br />Let&#39;s say the word &#34;FUS&#34; wont work for you:\r<br />\r<br />First, start a text editor, such as Notepad.\r<br />\r<br />Next, say &#34;FUS&#34;, while looking at the Speech Recognition bar (with the microphone on it)\r<br />\r<br />Two things can happen: either words will appear on the text editor (like, for example, &#34;Face&#34;) or you&#39;ll see another set of Word of Power in the Speech Recognition bar. If it is the later, try again with a slight variation in your pronunciation until either it detects the right word, or write a word down.\r<br />\r<br />Once you have your word, go in your Speech Macros folder, and open WayoftheVoice.WSRMacro with a text editor. Go to the right section for your shout, such as &#34;Unrelenting Force&#34;, and change the word the program listen (like &#34;Fus&#34;) to to what you want. Also replace the word in the larger words (Fus Ro.WSRMacro and Fus Ro Dah.WSRMacro) if they dont work.\r<br />\r<br />Save and, finally, VERY IMPORTANT: Right click your newly modified macro and select &#34;Sign speech macro&#34;\r<br />\r<br />[color=Darkgoldenrod]Notes About Shout LAG - [/color]\r<br />There is some delay between when you stop stop talking and WSR detects what you said.  This is most noticeable for single word shouts where the delay is about three seconds on my pc.  The delay is much shorter for multi-word shouts (e.g. for &#34;Fus Ro&#34; instead of just &#34;Fus&#34;) because WSR latches onto it faster.  The time from the detection in WSR to your character shouting in game is very short, meaning 98% of the time is just speech recognition.  Also remember that the shout detection doesn&#39;t happen until you FINISH saying it.  The longer you take to say it, the longer it will take to get into the game.  We&#39;ve added an optional &#34;skip the first word&#34; method into all the shouts as of BETA4.1 so you can say (Ro Da) and get Fus Ro Da.  This is much quicker to say, and for WSR to detect.  It is not necessary, but it might make game-play go a little smoother for some people who want more responsiveness in their shouting.\r<br />\r<br />[heading][color=Darkgoldenrod]Compatibility[/color][/heading]\r<br />Mostly everything, this mod only adds things to the game unless you use the optional renaming files.  If you use the optional word renaming files, they will conflict with anything that alters the words of power.  New words of power or new shouts will not work with this mod directly.  \r<br />\r<br />One possible conflict are hot-key mods. If you use SkyVoice, it reserves the following keys:\r<br />;&#39;[] (semi-colon, single-quote, left-bracket, right-bracket)\r<br />\r<br />If you use these keys for something else, you will encounter strange behavior\r<br />\r<br />[heading][color=Darkgoldenrod]FAQ[/color][/heading]\r<br />Q: Everything looks fine, I see the shout name, but nothing happens.  \r<br />A: Double check you do not have a mouse-key bound to shouts.  This is intended to work, but some users (thanks [url=http://www.nexusmods.com/skyrim/users/1181507]LordBishek[/url]) have reported this as a bug and resolved it by not using a mouse key as the shout key.\r<br />\r<br />Q: Help&#33;  I can&#39;t download WSR Macros I&#39;m getting some funky error.\r<br />A: Due to Microsoft being Microsoft you have to download WSR Macros (and do the WGA validation) with Internet Explorer.\r<br />\r<br />Q: I can&#39;t sign the macro file anymore, what gives?  \r<br />A: When you first install WSR Macros you create a signing certificate to sign the file with.  This is only good for one year then you have to recreate it which is pretty easy.  Right-click on the Windows Speech Macros icon in the lower right corner of your screen (system tray) and select &#39;security-&gt;create signing certificate&#39;, then set the default signing certificate to the new one and you&#39;re golden.\r<br />\r<br />Q: I use a 360 controller, is it compatible?\r<br />A: Yes, but you need to download this mod: http://skyrim.nexusmods.com/mods/310\r<br />You need the &#34;Hotkeys and Shout&#34; version.\r<br />\r<br />Q: Help I&#39;ve done everything right, Windows Speech recognition even shows me what shouts I&#39;m saying but it doesn&#39;t show up in game&#33;?  WHY&#33; \r<br />A: We&#39;ve had several instances of something similar to this, and in most reported cases, reinstalling SKSE resolved the issue.\r<br />\r<br />Q: What about Thuumic?\r<br />A: Thuumic was an awesome mod, and our favorites. Jeanlou contributed a bit in the early days, but now the mod seems abandoned, and does not really support languages other than English. So Jeanlou made this mod using a very different approach, because unlike them we have access to the Creation Kit. \r<br />\r<br />[line]\r<br />\r<br />[heading][color=Darkgoldenrod]WSR MACRO Executable and WotV Macro File install video[/color][/heading]\r<br />\r<br />[youtube][/youtube]\r<br />[line]\r<br />[heading][color=Darkgoldenrod]Other videos:[/color][/heading]\r<br />One of our dedicated users has created this video showing how he added some options to the MACRO file in combination with the More Hotkeys mod (THANKS Kaylo&#33;)\r<br />[youtube][/youtube]",
  "categoryId": "24",
  "version": "1.3",
  "author": "Asmodae and Jeanlou",
  "createdUnix": "1355701927",
  "updatedUnix": "1400047364",
  "containsAdultContent": false,
  "uploadedBy": "jeanlou",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107173",
      "name": "Way of the Voice - Optional - Silent Shouts",
      "version": "BETA4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "27",
      "fileName": "Way of the Voice - Optional - Silent Shouts-28448-BETA4.7z",
      "uploadedUnix": "1356322196",
      "modVersion": "BETA4",
      "virusScanUrl": "https://www.virustotal.com/file/4a668024f6f5d8e861126b58e52ab1f2727e59cbdf5132913a050c236bd5f930/analysis/1407319927/",
      "changelogHtml": " Fixed bugs in code, should be more reliable. <br/> \n The macros will now pick way less background noise. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Way%20of%20the%20Voice%20-%20Optional%20-%20Silent%20Shouts-28448-BETA4.7z?fid=107173&ttl=1535801832&ri=8192&rs=8192&setec=6d3dc78218131a33687cb13618a6aa99"
    },
    {
      "fileId": "108948",
      "name": "Way of the Voice - Words of Power Renamed",
      "version": "BETA4.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Way of the Voice - Words of Power Renamed-28448-BETA4-1.7z",
      "uploadedUnix": "1357076645",
      "modVersion": "BETA4.1",
      "virusScanUrl": "https://www.virustotal.com/file/0b7f6feff21d1cddf45ecec685fc14086dab12c6adb49aa64337d8418dda4101/analysis/1407332526/",
      "changelogHtml": " Rebinding shout keys mid game should now work properly (even with an xbox controller provided you&#39;re using the controller add-on) <br/> \n Added single line of feedback in skyrim to say what shout was detected. This will work even if you don&#39;t currently KNOW the shout, as the voice system doesn&#39;t care. Skyrim will only cast shouts you know however. <br/> \n Should be much less susceptible to being in an unkown state and missing the correct shout commands. Note: in testing this still sometimes happens, but it&#39;s much less common now.  <br/> \n Dawnguard support now built into one file. No more need for seperate mods to download/maintain <br/> \n Split out word of power renaming (adds readability/usability) into seperate mod files.  These will rarely (if ever) need to change. <br/> \n MACRO:Made first word optional for all shouts. This means you can get \"FUS RO DA\" with just RO DA. In a tense fight this is precious seconds of time. It is completely optional, use it or don&#39;t.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Way%20of%20the%20Voice%20-%20Words%20of%20Power%20Renamed-28448-BETA4-1.7z?fid=108948&ttl=1535801832&ri=8192&rs=8192&setec=9f9cdeb7e56b16b15b8b3a69b3f2a466"
    },
    {
      "fileId": "108949",
      "name": "Way of the Voice - Words of Power Renamed - Dawnguard",
      "version": "BETA4.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Way of the Voice - Words of Power Renamed - Dawnguard-28448-BETA4-1.7z",
      "uploadedUnix": "1357077029",
      "modVersion": "BETA4.1",
      "virusScanUrl": "https://www.virustotal.com/file/c4176adb26172b676795371e11b77b0fe4cef9dc55ad9cd60f3b7e5d98491157/analysis/1407332526/",
      "changelogHtml": " Rebinding shout keys mid game should now work properly (even with an xbox controller provided you&#39;re using the controller add-on) <br/> \n Added single line of feedback in skyrim to say what shout was detected. This will work even if you don&#39;t currently KNOW the shout, as the voice system doesn&#39;t care. Skyrim will only cast shouts you know however. <br/> \n Should be much less susceptible to being in an unkown state and missing the correct shout commands. Note: in testing this still sometimes happens, but it&#39;s much less common now.  <br/> \n Dawnguard support now built into one file. No more need for seperate mods to download/maintain <br/> \n Split out word of power renaming (adds readability/usability) into seperate mod files.  These will rarely (if ever) need to change. <br/> \n MACRO:Made first word optional for all shouts. This means you can get \"FUS RO DA\" with just RO DA. In a tense fight this is precious seconds of time. It is completely optional, use it or don&#39;t.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Way%20of%20the%20Voice%20-%20Words%20of%20Power%20Renamed%20-%20Dawnguard-28448-BETA4-1.7z?fid=108949&ttl=1535801832&ri=8192&rs=8192&setec=46c369b5e3b5b2fd95cf5a07fad7913f"
    },
    {
      "fileId": "1000050761",
      "name": "SkyVoice Main",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "SkyVoice Main-28448-1-2.7z",
      "uploadedUnix": "1377848938",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/a2dcfe85bb173fb162914e9a1374c7075875b80140c44c4e34d985fa125beca8/analysis/1407701987/",
      "changelogHtml": " - Changed Keys Again. Due to how windows macros handles AZERTY keyboard, my previous key selections weren&#39;t a good idea. Changed back to using function keys, but now they&#39;re F7 F8 F10 F11. NOTE: You MUST do a clean save for the new keys to register properly.\r<br />\r<br />- Also fixed the MCM display bug, option changes should stick and display correctl <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyVoice%20Main-28448-1-2.7z?fid=1000050761&ttl=1535801833&ri=8192&rs=8192&setec=3cf29782c4e4ef0c55f013e8e4d7ab40"
    },
    {
      "fileId": "1000050763",
      "name": "SkyVoice Macro Files",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "SkyVoice Macro Files-28448-1-2.zip",
      "uploadedUnix": "1377849272",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6972f9a83e3cb4b695dfab38f2e9570b17548866d612a427c39f641d3c046ba4/analysis/1407701988/",
      "changelogHtml": " - Changed Keys Again. Due to how windows macros handles AZERTY keyboard, my previous key selections weren&#39;t a good idea. Changed back to using function keys, but now they&#39;re F7 F8 F10 F11. NOTE: You MUST do a clean save for the new keys to register properly.\r<br />\r<br />- Also fixed the MCM display bug, option changes should stick and display correctl <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyVoice%20Macro%20Files-28448-1-2.zip?fid=1000050763&ttl=1535801833&ri=8192&rs=8192&setec=98010db9ff4b2593706f0b2da8d5e4cc"
    },
    {
      "fileId": "1000052153",
      "name": "SkyVoice plus More Hotkeys Tutorial",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "693",
      "fileName": "SkyVoice plus More Hotkeys Tutorial-28448-1-0.zip",
      "uploadedUnix": "1378276824",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/27bc12dea7ac151954a52f8ec5f9eb3265c2c7779b9901bdf91db964e650563b/analysis/1407708326/",
      "changelogHtml": "  - At Long Last, no more Beta\r<br /> - Changed the keys used by the mod, they are now ;&#39;[]  This resolved conflicts with other mods (notably ENBoost), and the occasional auto-close for users who ran (hold Alt) and used a shout with F4 in it. (alt-F4 closes the top window, bad mix-up)\r<br /> - Changed the name of all script and mod files to SkyVoice.  I debated this for a while, but weird named files in your folders are just annoying.  I hope to get to the optional files soon.  \r<br /> - Added Equip Only option\r<br /> - Updated MCM to new SkyUI version (no functional change here, but it did need some script changes\r<br /> - Potential fix for keybinding issue if you rebound your shoutkey to something other than z AND use a gamepad (I don&#39;t have a gamepad so please report if this doesn&#39;t work for you)\r<br /> - Added Falskaar support (untested at this time), the macro file may need some tweaking but the code is in the script now, let me know if this works for Falskaar users <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyVoice%20plus%20More%20Hotkeys%20Tutorial-28448-1-0.zip?fid=1000052153&ttl=1535801834&ri=8192&rs=8192&setec=d27d10b069cb5b912e4dc28292a952ff"
    },
    {
      "fileId": "1000109041",
      "name": "SkyVoice Main",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "SkyVoice Main-28448-1-3.7z",
      "uploadedUnix": "1400047275",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/e4927f1c63f3ff987d11e221127bbe8ca3f284509a91ba33c1c2ee85e19c9d08/analysis/1408076356/",
      "changelogHtml": " - Added Thunderchild Support.  Thunderchild shouts are all prefixed with the dova word Aav, so you need to say for Thunderchild&#39;s Earthquake shout: \r<br />  &#34;aavfus&#34;        - level one\r<br />  &#34;aavfus klo&#34;    - level two\r<br />  &#34;aavfus klu ul&#34; - level three\r<br />See the macro file for all the shouts and names, you need to update the macros as well. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyVoice%20Main-28448-1-3.7z?fid=1000109041&ttl=1535801834&ri=8192&rs=8192&setec=94773901a501c0de737023eee38edd9c"
    },
    {
      "fileId": "1000109042",
      "name": "SkyVoice Macro Files",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "SkyVoice Macro Files-28448-1-3.zip",
      "uploadedUnix": "1400047364",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/b30585faed760681fe312bf4c11725f9c260228b537e0a6eade92c540c064529/analysis/1408076357/",
      "changelogHtml": " - Added Thunderchild Support.  Thunderchild shouts are all prefixed with the dova word Aav, so you need to say for Thunderchild&#39;s Earthquake shout: \r<br />  &#34;aavfus&#34;        - level one\r<br />  &#34;aavfus klo&#34;    - level two\r<br />  &#34;aavfus klu ul&#34; - level three\r<br />See the macro file for all the shouts and names, you need to update the macros as well. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyVoice%20Macro%20Files-28448-1-3.zip?fid=1000109042&ttl=1535801835&ri=8192&rs=8192&setec=36f0464015b231746e5e82df2b150210"
    }
  ]
}