{
  "modId": 28446.0,
  "modName": "Erahnia - A home on the water",
  "summary": "A boat? A home? Nah... Both!",
  "descriptionHtml": "Want to live in Solitude? But to poor too by a house? Or just never felt home on land?\r\nWell then this is the home for you. By the docks of lovely Solitude we got Erahnia! A big boat filled for your basic needs! Has a bar for you and your companions, and if you\\'re sleepy? Three beds for your friends, and one master one just for you.\r\n\r\n============\r\nDESCRIPTION\r\n============\r\n\r\nErahnia is a player home in the docks of Solitude. It has everything a normal home should, and usually have, including kitchen, master bedroom, a small bedroom with three beds, a bar, a small armory, alchemy table and enchanting table. It\\'s fully Navmeshed and should work fine with any companions you have. Has a \\\"ready to travel to\\\" map marker so no need to discover the docks. \r\n\r\n=============\r\nINSTALLATION\r\n=============\r\n\r\nJust simply drop the \\\"Ship home.esp\\\" in your datafolder and check the box in data files in your game launcher.\r\n\r\n======================\r\nPOSSIBLE FUTURE PLANS\r\n======================\r\n\r\nMight add NPC:s such as a bartender, a chef, a bard and perhaps a few sailors, of course in an optional file.\r\n[B]UPDATE[/B]\r\nMy NPC update will take time, because CK crash when trying to review my NPC.\r\n\r\n===============================\r\nCOMPATIBILITY & REQUIREMENTS\r\n===============================\r\n\r\nShould be compatible with any mod that doesn\\'t alter with the same area as the boat. \r\n\r\nThis mod does only require Skyrim base game and update.esm\r\nDoes work with Dawnguard and Hearthfire, but they are not required.\r\n\r\n======\r\nOTHER\r\n======\r\n\r\nThe name Erahnia comes from my friend and ex girlfriend, who made it up or something. And you know, she kinda looks like a boat so why not use that name?\r\n\r\nAlso, this is my second mod ever made, so please don\\'t be too hard on me, but constructive criticism is always welcome.\r\n\r\nPlease endorse if you like the house, it would encourage me too do more. \r\nAlso, now I know why boat homes are rare here on the Nexus... It\\'s a really enoying process doing those...\r\n\r\nAnd for any grammatical errors, I\\'m sorry, I\\'m Swedish so english is not my native language.\r\n\r\nPlease report any problems or bugs, and I will try fix this as fast as possible.\r\n\r\n[youtube]YgKNJS2BEKQ[/youtube]",
  "categoryId": "67",
  "version": "1.0",
  "author": "Andiders",
  "createdUnix": "1355700029",
  "updatedUnix": "1355700102",
  "containsAdultContent": false,
  "uploadedBy": "andiders",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105632",
      "name": "Erahnia - House on water",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "87",
      "fileName": "Erahnia - House on water-28446-1-0.rar",
      "uploadedUnix": "1355700102",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c55ecb3c253f0322884d855cc6d2acd6c8f0260caaaa2eb24210cbc64e8b3776/analysis/1407307982/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Erahnia%20-%20House%20on%20water-28446-1-0.rar?fid=105632&ttl=1535801830&ri=8192&rs=8192&setec=ebb3e8efc3ee82b3724e86f1fb5eb827"
    }
  ]
}