{
  "modId": 28507.0,
  "modName": "Gersonia",
  "summary": "Gersonia does not require Dawnguard.\r\nYou can find Gersonia at the newly placed Excavation site to the right of Riften, near the edge of the map.\r\n\r\nGersonia is a Sci-Fi dungeon that is full of surprises. Takes around 3-4 hours to complete. This dungeon contains 7 Chambers that are massive and full of action.",
  "descriptionHtml": "Here is the order of the chambers and their descriptions:\r\n\r\nGersonia- \r\nFirst part of the dungeon was a Dwemer ruin converted into a power plant made by Time Travelers. This area contains the secondary geothermal power source from pools of magma scattered throughout the chamber. There are traps and enemies lurking everywhere.\r\n\r\n\r\nMagma Chamber-\r\nThis Chamber is simply \\\"BREATH TAKING\\\" one of the largest chambers in Skyrim. A huge chamber in the center that has a magma energy harvestor that you have to climb. It is full of moving parts that can kill you. Once you make it past, there will be stairs that lead you to part of an underground city that is full of evil wizards. Finally, you will make your way to the top of the chamber where you will fight a few bosses.\r\n\r\n\r\nCooling chamber-\r\nOne of the most unique chambers in Gersonia, this chamber is used to cool down the machinery in the lower level. This area contains Explosive gas chambers, Spinning fans of death in cooling tunnels, and much more.\r\n\r\nAndronen Chamber-\r\nThis is when things get really difficult; Kill or be killed! Fight your way up the underground stream against the force of the water and kill enemies along the way. You will approch a number of waterfalls.\r\n\r\nAndronen entrance-\r\nOne of the other largest chambers in Gersonia. This chamber contains an enormous underground lake full of ships and docking platforms. On the other side of the lake (which you started from) is the massive Andronen entrance leading to the stairs.\r\n\r\nStairs-\r\nAscending to the cliff side. This chamber has ghosts, more modified traps, mine cart rail tracks, and more.\r\n\r\nCliff side-\r\nThe final part of Gersonia, you finally emerge from underground only to be surrounded by dozens of bandits where there is almost no chance to win, unless you use the cliff to your advantage. Make it past the cliff, then you will approach a war zone. Quickly find the space ship by the cliff and fight the final boss inside.\r\n\r\nUpdate 1\r\n- Fixed outpost door\r\n- Fixed loop holes in nav mesh\r\n- Reduced lag in a few chambers\r\n- fixed a few glitches\r\n\r\nUpdate 2.\r\n- The Lag at the beginning of the Magma chamber that caused computers to crash is no more!\r\n- At the beginning of the Andronen chamber, I fixed the rock climbing issue. \r\n- Lag reduced in a few chambers.\r\n- Made the water toxic in the Lake; that is part of the Andronen entrance chamber (you can’t swim under the bandits without fighting.\r\n\r\nUpdate 3 \r\n- I optimized a majority of the chambers to the best of my ability\r\n- I patched some glitches.\r\n- Added a little more detail to the chambers.\r\n\r\nUpdate 4\r\n- fixed spelling errors in the dungeons, I was a bit too eager to publish and update this dungeon; I should have checked for spelling errors.\r\n- filled in some gaps in the magma chamber.\r\n\r\nUpdate 5\r\n- Added hidden treasure spots in a few of the chambers.\r\n- Fixed more glitches.\r\n\r\nUpdate 6\r\n- Fixed the gaps under water in the Andronen Entrance.\r\n- Got rid of the boulders Protruding from wall. \r\n\r\nUpdate 7\r\n- Polished the last chambers up a bit.\r\n\r\nGersonia does not require Dawnguard.\r\n\r\n\r\nPlease let me know if you have any questions about this map, I will try to fix any problems that you guys mention. \r\n\r\n\r\nThe name for the next map series is \\\"Into the Deep.\\\"   This mod will feature a completely different environment then what i have seen in Skyrim thus far. I have now committed myself to work on it\r\n\r\nI\\'m a little busy on the weekdays, sorry if i was delayed for any questions.\r\n\r\nThanks for all the input.\r\n\r\nContinue to Rate well, you guys inspire me!",
  "categoryId": "88",
  "version": "1",
  "author": "David Montecalvo",
  "createdUnix": "1355804019",
  "updatedUnix": "1355805521",
  "containsAdultContent": false,
  "uploadedBy": "djmonte",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105878",
      "name": "Gersonia",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "227",
      "fileName": "Gersonia-28507-1.rar",
      "uploadedUnix": "1355805521",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/c1f23bf0dc745ca07613f22fec000e084c47a1ce91fdc3253397d7118115e4f1/analysis/1407309846/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gersonia-28507-1.rar?fid=105878&ttl=1535801928&ri=8192&rs=8192&setec=672229c6945cf601c0a303f57a278ddc"
    }
  ]
}