{
  "modId": 28514.0,
  "modName": "UW - Unique Workshop - DELETED",
  "summary": "Allows you to use a unique skeleton, and body texture/mesh for Bretons, Darkelves, Highelves, Imperials, Nords, Orcs, Redguards,  Woodelves, for Males & Females.\r\n\r\nAllows you to assign unique vanilla armor meshes made by Caliente\\'s BodySlide to each female race above. \r\n\r\n\r\n",
  "descriptionHtml": "THIS MOD WILL ALWAYS BE A BETA, please report any bugs or problems in the comments.\r\n\r\nThis is a personal mod I use for myself. Made to compliment CBBE and Better Males. And make the game more immerse in allowing me to give each race a unique look.\r\n\r\nWhat does it do?\r\n\r\nUW - Humanoid Bodies\r\n\r\n-Allows you to use a unique skeleton, and body texture/mesh for Bretons, Darkelves, Highelves, Imperials, Nords, Orcs, Redguards,  Woodelves, for Males & Females.\r\n\r\nUW - CBBE Armor Meshes (coming soon)\r\n\r\n-Allows you to assign unique vanilla armor meshes made by Caliente\\'s BodySlide to each female race above. \r\n\r\nThis mod will only support vanilla meshes that can be made with BodySlide and will updated with every release of Caliente\\'s Armor packs. UNP is compatible, and has more armors ready, but I made a choice and decided to stick with CBBE, not to knock on UNP, it\\'s a great mod.\r\n\r\n\\\"And if bodyslides presets are developed for males, and a significant amount of vanilla armors are supported. Then they\\'ll be added.\\\"\r\n\r\nUW - Unique Behaviors (In Development)\r\n\r\n-Allows you to assigned a unique behavior per race, and certain animations. Will require use of FNIS. All races.\r\n\r\nQ&A\r\n\r\n-Why no head meshes or textures?\r\n\r\nFacially the vanilla game races are diverse. That didn\\'t bother me, but everyone had the same damn body. That bothered me, good female diversity can be made by using BodySlide, different muscle maps and skin textures. Males are limited but can be done with skin and skeletons.\r\n\r\nI suggest using CBBE bodies, Better Males, and compatible Facepacks, body textures/meshes, and skeletons.\r\n\r\n-Why no beastly love?\r\n\r\nI use UBR - Unique Beast Races, which satisfies my tastes. This a personal mod I released to the public. That is all.\r\n\r\n-Taking suggestions?\r\n\r\nNot really, apart from bugs, I know what I want to do with this mod. Either you like or you don\\'t. I\\'m not making it to appease the masses.\r\n\r\n-Do you have all ready made texture/meshes?\r\n\r\nMod come\\'s with default game dds and nif files.\r\n\r\nI\\'ll be releasing a all ready to go meshes and texture pack (my personal), once I finish procuring permissions from mod authors. A drag and drop asset mod, UW - Starter Assets.\r\n\r\nCredits: \r\n\r\nThis mod was made from scratch by own hands, out of all the similar mods like this:\r\n\r\nIsh\\'s Unique Races is the only mod I\\'ll say greatly influenced this (by far the most organized), but still wasn\\'t what I wanted.\r\n\r\nCaliente for CBBE which this mod is made to compliment his/her work.\r\n\r\nSo give them endorsements. \r\n\r\nAnd of course, Bethesda for this god awful addiction to Skyrim and Fallout 3/NV.\r\n\r\nPermissions:\r\n\r\nYou got something going on, just ask me...\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "29",
  "version": "0.2",
  "author": "ENBarcelo",
  "createdUnix": "1355817528",
  "updatedUnix": "1355817737",
  "containsAdultContent": false,
  "uploadedBy": "ENBarcelo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105937",
      "name": "UW - Unique Skeletons",
      "version": ".1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "33",
      "fileName": "UW - Unique Skeletons-28514--1.7z",
      "uploadedUnix": "1355817737",
      "modVersion": ".1",
      "virusScanUrl": "https://www.virustotal.com/file/90b6c311e9fef4d6554f14d6a9ea1a93ba84e687d0b85147782f1e1fcefe2fcc/analysis/1407310323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UW%20-%20Unique%20Skeletons-28514--1.7z?fid=105937&ttl=1535801940&ri=8192&rs=8192&setec=f88c5585fe1278388bb2edc161da0212"
    }
  ]
}