{
  "modId": 28536.0,
  "modName": "MAD Torchlight",
  "summary": "This mod adds a new Apprentice level Alteration spell called Torchlight. Torhclight uses the exact same light color and radious as an ingame torch without the need to tie up a hand. The spell cost is between that of Candlelight and Magelight, with the same skill rate multiplier as Magelight.\r\n",
  "descriptionHtml": "Ever get tired of the fact that Candlelight uses a rather harsh light blue light, or the fact that a torch has superior ability to light a room compared to Candlelight? Well, no more! This mod adds a new Apprentice level Alteration spell called Torchlight. Torhclight uses the exact same light color(RGB:250 190 131) and radious(512) as an ingame torch without the need to tie up a hand. The spell cost is between that of Candlelight and Magelight, with the same skill rate multiplier as Magelight. This mod is best used in first-person view mode, as the mesh for the light spell effect contains a large bluish aura that is visible in third person view.  This is why Candlelight appears to tint distant objects beyond the light\\'s radious blue when in third-person, but not first-person view. This also is why the light orb itself has whitish blue color and a sort of rainbow effect no matter the light color being emitted. This is all part of animated mesh used for the visual effect and it is not possible to change without altering the mesh.  The spell can be learned from the associated spell tome, found in all the same possible locations as other Apprentice level Alteration spell tomes. The easiest means of acquiring it is to visit your favorite hold\\'s court mage.\r\n\r\nThis mod alters the two leveled lists:\r\n\r\nLItemSpellTomes25Alteration\r\nLItemSpellTomes25AllAlteration\r\n\r\nIt will be incompatible with any mod that alters these lists unless you use Wrye Bash\\'s Bashed Patch feature.",
  "categoryId": "75",
  "version": "1.0",
  "author": "MAD",
  "createdUnix": "1355845809",
  "updatedUnix": "1355850948",
  "containsAdultContent": false,
  "uploadedBy": "SirMAD",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106026",
      "name": "MAD Torchlight v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "MAD Torchlight v1_0-28536-1-0.7z",
      "uploadedUnix": "1355850948",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/eee9a3b0bd56cbdeb54d7af0b3e49b0c01d331b362810dca10c67b0e49b4f3b6/analysis/1407310874/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MAD%20Torchlight%20v1_0-28536-1-0.7z?fid=106026&ttl=1535801967&ri=8192&rs=8192&setec=46c9632ff1f9cea46805838ffbeb2b9e"
    }
  ]
}