{
  "modId": 28540.0,
  "modName": "Immersive Combat Music",
  "summary": "Immerse yourself into exploring the vast world of Skyrim without the alerting combat music themes everytime a bear spots you!\r\nCombat music is replaced with handpicked calm vanilla melodies so that it will blend nicely with the exploration atmosphere. 2 versions to choose from!",
  "descriptionHtml": "Upon request, I added some videos for some of the tracks that I used so that you can hear them before downloading =)\r\n\r\nThe videos display the full-length songs. The vanilla tracks may differ slightly and be parts of the original songs. These songs are copyrighted. If you want to obtain these songs please purchase the [b]Skyrim OST CD Set[/b] =)\r\n\r\n[b][size=4]Compatible with all the official DLC - No requirements, even v1.1 of Skyrim is compatible![/size][/b]\r\n__________________________________________________________________________________________________________________________________________________________\r\n[i]Have you ever been exploring with a calm music on the background and the very next moment a symphonic orchestra plays so loud only to announce that a... troll has spotted you??[/i]\r\n\r\nAfter some time playing Skyrim the combat music becomes so familiar to your ears that  even your alarm clock (or worse your car alarm :P) sounds like an -almost- pleasant tune.\r\nDoes that annoy the hell out of you?\r\nWell it annoys me at least so I sat down and made a (handy in my humble opinion) workaround!\r\nBefore you read any further I must point out that this is [b]NOT[/b] an addition of new content, music etc. It only uses vanilla music tracks but distributes them in another way during your Skyrim gameplay. Every track is handpicked by me after listening to all the involved vanilla tracks and choosing the ones that I thought were better suited for the job. The combinations this method can produce are infinite and are always subject to personal taste. \r\n\r\n[b][size=5]Features[/size][/b]\r\n[b]1.[/b] No more combat music of any kind be it trolls, dragons (if you use the first version), or bandit ambushes. Different vanilla tracks will play on your future battles. I used calm and slow tracks so that they blend with the exploration music.\r\n[b]2.[/b] If you want your game to be as immersive as possible, you have probably downloaded a ton of immersion mods and dropped the in-game Music volume to zero. But why sacrifice the soothing and varied exploration, town and tavern melodies just for 5-6 extremely loud and repetitive themes? Use the folder I provide and allow the enemies to ambush you without being alerted by the music! I know it sounds a bit unconventional, but it is better to use your instincts and cunning in order to survive the in-game world rather than hearing Akatosh-sent melodies!\r\n\r\n[b][size=5]2 Versions to choose from![/size][/b]\r\nThe first version (Immersive Combat Music) replaces all combat music with handpicked calm melodies. [u]Dragon encounters and fights will also have their music replaced with unique soothing melodies.[/u] The second version (Immersive Combat Music - Vanilla Dragon Music) will replace regular combat music in the same way as the first but with a twist. [u]Music during dragon encounters and fights will remain unchanged.[/u]\r\nChoose only [b]one[/b]! \r\n\r\n[b][size=5]Miscellaneous[/size][/b]\r\nThe other download has nothing to do with the actual purpose of the mod. And thus it is moved to the miscellaneous category. This file is [b]standalone[/b], does not require any of the main files and can [b]overwrite[/b] them both so that you can use them together! It is just an alternate music for dragon fights. I used (my favorite) vanilla track which is very rare and only plays at a certain event during the course of the main quest line. This is [b]NOT[/b] the music that plays during the main quest ending -  the ending music is meant to be unique. The track I chose almost always goes unnoticed and it\\'s  a shame. Since I replaced all dragon music with this track, I recommend that you use it in tandem with a mod that makes dragons more rare and more powerful so that battles last longer and when a dragon encounter takes place it does really matter!\r\n\r\n[b][size=5]Technical Notes[/size][/b]\r\nAll the content comes in the form of loose files (no scripts, plugins or .bsa files) for easy manual installation and uninstalation. [b]Detailed Read Me inside[/b] (see what I did there?)\r\nThe files are bug free, and require neither Dawnguard nor Hearthfire to work. Anyway it doesn\\'t hurt to keep your game updated to the latest patch even if you own none of the official DLCs. I browsed through the update files and didn\\'t find any combat music related content (both in Dawnguard and Hearthfire). That being said, even version 1.1 of Skyrim should be compatible. I made the mod while on version 1.8\r\nIt should be compatible with any kind of mod out there except mods that replace vanilla with custom music (music overhauls and collections). You can always use custom music mods along mine - the only folder that will be overwritten is the Music\\\\Combat folder. You won\\'t have a crash or a nuclear winter, you will simply hear calm vanilla music when in combat instead of the x mod\\'s combat music of choice :) \r\n\r\nAnyway the tools I used are:\r\n[url=http://skyrim.nexusmods.com/mods/247][b]BSAopt[/b][/url]\r\n[url=http://skyrim.nexusmods.com/mods/3159][b]MultiXWM[/b][/url]\r\n[b]VLC Media Player[/b] (VLC can play .xwm files - check UESPWiki for more info regarding Skyrim music) \r\n",
  "categoryId": "61",
  "version": "1",
  "author": "me",
  "createdUnix": "1355850570",
  "updatedUnix": "1355851174",
  "containsAdultContent": false,
  "uploadedBy": "theLittleGnome",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106024",
      "name": "Immersive Combat Music",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16247",
      "fileName": "Immersive Combat Music-28540-1.7z",
      "uploadedUnix": "1355850832",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e03f4f9f6269013c13248a2de37bff90a8f565782413531972828612ad5fb235/analysis/1407310874/",
      "changelogHtml": " Initial Release - 2 mod variations & 1 miscellaneous download <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Combat%20Music-28540-1.7z?fid=106024&ttl=1535801971&ri=8192&rs=8192&setec=8780d69a90b9c7157aaf5eb72a22dda9"
    },
    {
      "fileId": "106027",
      "name": "Immersive Combat Music - Vanilla Dragon Music",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7690",
      "fileName": "Immersive Combat Music - Vanilla Dragon Music-28540-1.7z",
      "uploadedUnix": "1355851028",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d0e2ec211ff3d4214cff21dd8c238e846e8dc8eb8a6bdcaff7d907bfb5ae553b/analysis/1407310877/",
      "changelogHtml": " Initial Release - 2 mod variations & 1 miscellaneous download <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Combat%20Music%20-%20Vanilla%20Dragon%20Music-28540-1.7z?fid=106027&ttl=1535801971&ri=8192&rs=8192&setec=3d2c1a0aab2514c5bfed67408399923f"
    },
    {
      "fileId": "106028",
      "name": "Alternative Dragon Fight Music",
      "version": "1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2451",
      "fileName": "Alternative Dragon Fight Music-28540-1.7z",
      "uploadedUnix": "1355851174",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/7863f0adf0a3c0f4911f162413e6ac995989d6afe0e4cf0080046f80bc7eb389/analysis/1407310880/",
      "changelogHtml": " Initial Release - 2 mod variations & 1 miscellaneous download <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternative%20Dragon%20Fight%20Music-28540-1.7z?fid=106028&ttl=1535801972&ri=8192&rs=8192&setec=d291e0f9aa5a8fe3d223c9695771d106"
    }
  ]
}