{
  "modId": 28557.0,
  "modName": "The Mer Sisters",
  "summary": "A trio of elven followers based on Ethereal Elven Overhaul.",
  "descriptionHtml": "Since I was asked, I put my elf from [url=http://skyrim.nexusmods.com/mods/28454]my mod here[/url] into a marriageable follower. Once I got started though, I got the idea to make triplets, one for each race! They all share the same head parts and slider values, so what you see is the difference between each races morphs. \r\n\r\nNaphaela (nah-FEE-la) is a no-nonsense, high elf, ex-thalmor mage. She was a very studious and obedient child growing up and law enforcement was a natural career choice. She left the Thalmor after repeated abuses of power went unpunished.\r\n\r\nKai was raised by her absent, but loving single father. Providing for his daughter took all of his time, and though he loved her dearly, they grew apart as she got older. Kai is rebellious at heart and suffers from Robin Hood delusions. She is often found to be in possession of other people\\'s things.\r\n\r\nIriya never knew her parents, she was brought up in the Riften Orphan\\'s Home until she ran away as a preteen elf. Her silent feet, nimble fingers and keen sense of where to place a blade in a man\\'s back have served her well these last few years.\r\n\r\nAll of them just want to see the world and right wrongs, or steal from the rich to give to the poor, or find new bodies to pile up! Take your pick!\r\n\r\nNaphaela hangs out in the Bannered Mare, attempting to pick up any gossip about the downtrodden being oppressed.\r\nKai hangs out in the Drunken Huntsman, hoping to hear some drunken wealthy slob describe his fortune in far too much detail.\r\nIriya spends her time meditating in the Whiterun Hall of the Dead. The stillness of death in the air calms her angry spirit.\r\n\r\nSo, now that we\\'ve gotten that all out of the way, a few details!\r\n\r\nREQUIRED MODS\r\n[url=http://skyrim.nexusmods.com/mods/24273]Ethereal Elven Overhaul[/url] - The girls will look NOTHING like my screens without this. I also use the high res skins and the UNP Freckle texture.\r\n[url=http://skyrim.nexusmods.com/mods/6709]Dimonized UNP Body[/url] - I use UNP, so if you use CBBE or any other body, you will probably get neck seams. I also use the high res uncompressed normal available there and the HD skin texture v 1.51\r\n[url=http://skyrim.nexusmods.com/mods/10168]ApachiiSkyHair[/url] - The hairs used are from this package. Make sure you also download the optional 23 standalone hair pack, it contains hairs that are not in the main download.\r\n[url=http://skyrim.nexusmods.com/mods/3589]Natural Eyes[/url] - I used the Blind Dark Elf eye texture from this pack. This one is the least necessary as it will just display whatever eyes you have installed without a problem.\r\n\r\nMODS IN SCREENSHOTS\r\n[url=http://skyrim.nexusmods.com/mods/23029]Goddess ENB Configuration[/url] - I use a personally modified version of this that has been adapted to Realistic Lighting.\r\n[url=http://skyrim.nexusmods.com/mods/7654]Realistic Lighting With Customization[/url] - I use the default hardcore version with no customizations.\r\n[url=http://skyrim.nexusmods.com/mods/27043]Enhanced Lights and FX[/url] - This mod is pretty neat and it\\'s only going to get better as they work on it.\r\n[url=http://skyrim.nexusmods.com/mods/28454]Replacement Crowns[/url] - Naphaela is wearing the elven crown from my replacer version of pnkrd\\'s mod.\r\n[url=http://skyrim.nexusmods.com/mods/19772]Remodeled Armor for UNP[/url] - I use this armor replacer a lot for stock armors, it shows a LOT of skin, but the designs are aesthetically well done also. It uses whatever textures you already have downloaded, this only changes the meshes.\r\n\r\nBONUS\r\nI have included an .esp to add a preset to each female elven race to match the faces of the followers in case you would rather look like them instead of having them follow you around :D For some reason though, the presets fuss about applying the Apachii hairs at first, but you can just change them like normal without issue when making your character.",
  "categoryId": "33",
  "version": "1.0",
  "author": "jezamarie",
  "createdUnix": "1355876725",
  "updatedUnix": "1355876853",
  "containsAdultContent": false,
  "uploadedBy": "jezamarie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106083",
      "name": "The Mer Sisters",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "861",
      "fileName": "The Mer Sisters-28557-1-0.7z",
      "uploadedUnix": "1355876790",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/43b8b7837dfe918dd2b563cf6c467ff1b4da7e3dc653cd0fd3c03babdffec18b/analysis/1407311283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Mer%20Sisters-28557-1-0.7z?fid=106083&ttl=1535802001&ri=8192&rs=8192&setec=c5038b4f6f2a0ce2855ef7a3b963ee0d"
    },
    {
      "fileId": "106084",
      "name": "Mer Sister Character Presets",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "9",
      "fileName": "Mer Sister Character Presets-28557-1-0.7z",
      "uploadedUnix": "1355876853",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/aa852208ba5c1375987e6f7ea3dd126a0902f91f0db2b5141b0401c4e973b197/analysis/1407311284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mer%20Sister%20Character%20Presets-28557-1-0.7z?fid=106084&ttl=1535802001&ri=8192&rs=8192&setec=03d940f3424dcaf29a842838542b9991"
    }
  ]
}