{
  "modId": 28562.0,
  "modName": "Mouth of the World",
  "summary": "Adds the domain of the lost magician Curu.",
  "descriptionHtml": "BETA\r\n\r\nEver thought about how much potential Skyrim\\'s biggest and most tale told mountain has? What kind of secrets could that big legendary mountain hold.\r\nLocated at the top of The Throat of the World, you will find the Mouth of the World, wich leads to the Belly of the World, and abbandoned residence, owned by a mage named Curu, who no one know the whereabouts of. \r\nHere you will find his magical den of secrets, knowledge, magic and study.\r\n\r\nYou need to have completed parts of the MQ in order to access it. It\\'s located on top of The Throat of the World, on a little path leading from Parthurnax. There you will find the Mage stone, wich will teleport you to the Mouth of the World. So far, your follower cannot follow you there, and this is no bug.\r\n\r\nFully navemeshed.\r\n\r\nThis is currently a beta, and is an active project of mine, wich means updates will be frequent. The dungeon gives you access to his mountain home to take as your own + some extras.\r\n\r\nHope you\\'ll like it!\r\n\r\nEdit*\r\nIf you want to edit this mod as your own, for your own purpose, feel free to do so. But if you are uploading a mod, based on mine, I want to be contacted first and given creds for my work. I will not be happy if I find a mod that is a copy of mine but under another author.\r\n\r\nThe mod is also avaliable on the Steam Workshop for easy access and more frequent updates.",
  "categoryId": "70",
  "version": "1.0",
  "author": "Wylda",
  "createdUnix": "1355883662",
  "updatedUnix": "1355883728",
  "containsAdultContent": false,
  "uploadedBy": "Wylda",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106092",
      "name": "Mouth of the World",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "386",
      "fileName": "Mouth of the World-28562-1-0.rar",
      "uploadedUnix": "1355883728",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8636cd99ad37a91c9faaecb31d5c62bae13931e0847666a3bb9eee39aab9ba00/analysis/1407311344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mouth%20of%20the%20World-28562-1-0.rar?fid=106092&ttl=1535802012&ri=8192&rs=8192&setec=483f5e86ac04752ee0e477c0d1031285"
    }
  ]
}