{
  "modId": 28568.0,
  "modName": "Enchanting Basin by Natterforme",
  "summary": "This is a Nexus Exclusive. This adds an extra way to enchant weapons and armor to the CK. ",
  "descriptionHtml": "\r\n\r\n\r\nName: Enchanting Basin by Natterforme\r\n Version: 1.0\r\n Date: 12/18/2012\r\n Category: Crafting and Modders Resource\r\n Recommended: Skyrim Mod Manager\r\n Author(s): Natterforme\r\n Source: \r\n \r\nDescription\r\n ===========\r\n This is a Nexus Exclusive. This adds an extra way to enchant weapons and armor to the CK. \r\n \r\nLocation\r\n ========\r\n \r\nDetails\r\n =======\r\n THIS IS A NEXUS EXCLUSIVE! NO STEAM SUPPORT WILL BE OFFERED AT THIS TIME! IF I FIND THAT THIS HAS BEEN UPLOADED TO STEAM WITHOUT MY PERMISSION I WILL NOT BE LENIENT TOWARDS THE UPLOADER(S). YOU HAVE BEEN WARNED!!! \r\n \r\n This adds an extra crafting table to enchant weapons and armor to the CK. While I was modding in the CK I found this little gem. The Creation Kit had a crafting unit called DisenchantmentFont01 with full meshes and textures in the vanilla folders. It had no use and was not placed in the world anywhere. I had never seen it before and to my knowledge it is not a recent addition from an update. My guess is that enchanting and disenchanting were originally intended to be seperate crafting functions and that at some point during development they were combined into the single unit that we currently use. I looked on the Nexus and I didnt see any mods that used or added this item so I decided to do something with it. This mod now adds the CraftingEnchantingBasin to the CK. It performs exactly like a normal arcane enchanting table but without an animation. Activating it will bring you directly into the enchanting menu without having a break for your character to do an animation. I am sure that there is a way to link another animation to use with this table but I havent yet figured out how to do that. It will also not hunch the camera over the basin but will instead leave it where ever it is when you activate the basin. You can actually enchant items while looking over your character\\'s shoulder in third person. I actually prefer this method, as it feels a little bit less constricted than using the arcane enchanting table, which obsures your view by looking at the tables surface. It is also faster, as it has no animation to play through and you can hop in and out of the enchanting menu really quickly. Considering how often I accidentally exit out of the enchanting menu, its nice not having to sit through the animation and just get back to enchanting my gear. This of course is entirely personal preference and if enough people want an animation, I will see if a reasonable preexsting one can be added.\r\n \r\n An example of the basin can be found in Dragonsreach to the right of the Arcane Enchanting table.\r\n \r\n Future plans include adding the basin to reasonable places around the worldspace. I might also add a preexisting animation if I can get one to link up though the current lack of an animation is more than a little refreshing and is a nice change.\r\n \r\n Feel free to use this enchanting basin as a resource for your projects, all I ask for is proper credit. I would also like to know when you release a mod that incorporates this mod( i.e. player home, castle, NPC residence, dungeon, etc.) as I like to see how others use it!^^\r\n\r\n\r\n\r\nInstall\r\n =======\r\n You can either download this mod with the Nexus mod manager or download the files and extract into the Skyrim data folder. Be sure to check the tick box in your data files section on the Skyrim launcher.\r\n \r\n\r\nUninstall\r\n =========\r\n Either use Nexus Mod Manager to remove the files or manually remove them from you Skyrim/Data folder. \r\n\r\nUpgrade\r\n =======\r\n I plan to upgrade and improve this mod over time as I fix bugs, think of new ideas, become more adapted to the CK, and so on. Be sure to check back in once and awhile for updates. Be sure to completely uninstall any previous versions of this mod before upgrading though.\r\n \r\nI will not take responsibility for corrupted save games or lost save games. Get into the habit of backing up your saves to protect your game data. Ignore at your own risk!\r\n\r\nIncompatibility\r\n ===============\r\n I do not see why this mod would be incompatible with other mods but it is always a possibility. \r\n \r\nKnown Issues or Bugs\r\n ====================\r\n \r\n -This basin has no animation\r\n\r\nHistory\r\n =======\r\n \r\n12/18/2012- Version 1.0 Initial Release\r\n \r\nContact\r\n =======\r\n You can find me on the Nexus Forums here as Natterforme.\r\n \r\nCredits\r\n =======\r\n \r\n -Thanks to Bethesda for creating Skyrim.\r\n -Thanks to SkyrimNexus.com for the a one-stop-shop resource for authors and players.\r\n -Thanks to LHammonds for the Readme Generator this file was based on.\r\n -Thanks to all of you who have encouraged me and have supported this armor mod since I first put up screenshots of it back in December 2011 and January 2012.\r\n -I thank you all for your patience with me^^.\r\n -Thanks to God for creating us all. Amen.\r\n \r\nTools Used\r\n==========\r\n7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r\nBlender - http://www.tesnexus.com/downloads/file.php?id=12248\r\nNIFSkope - http://niftools.sourceforge.net/wiki/NifSkope\r\nOblivion Mod Manager - http://www.tesnexus.com/downloads/file.php?id=2097\r\nPaint.NET - http://www.tesnexus.com/downloads/file.php?id=11909\r\nPhotoshop - http://www.adobe.com/products/photoshop/\r\nReadme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r\n\r\n Licensing/Legal\r\n ===============\r\n This is a Skyrim Nexus Exclusive.\r\n\r\n You MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. I will NOT be providing Steam Workshop support at this time. I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW! I will not support any version of this mod found on Steam. I will not accept any childish excuse about \\\"sharing\\\" with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r\n\r\n -Natterforme\r\n \r\n\r\n",
  "categoryId": "28",
  "version": "1.0",
  "author": "Natterforme",
  "createdUnix": "1355894383",
  "updatedUnix": "1355894504",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106111",
      "name": "Enchanting Basin Official Release Ver1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Enchanting Basin Official Release Ver1_0-28568-1-0.zip",
      "uploadedUnix": "1355894504",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/10305f46f38b89f61f37fe8c965e8a1607786e07329dcabec2313d95317f0a90/analysis/1407311463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Basin%20Official%20Release%20Ver1_0-28568-1-0.zip?fid=106111&ttl=1535802016&ri=8192&rs=8192&setec=7a55941a68f359a259d1a494c35a38c3"
    }
  ]
}