{
  "modId": 28607.0,
  "modName": "Reduced Dragon Bone and Scale Weight",
  "summary": "Makes Dragon Bones weigh 5 and Dragon Scales weigh 2.5 lbs. Fighting dragons should be fun, not a chore that leaves you constantly over-encumbered.",
  "descriptionHtml": "REDUCED DRAGON BONE AND SCALE WEIGHT - BY URGE\r\n\r\nThis mod reduces the weight of Dragon bones and scales. Bones now weigh 5lbs and Scales weigh 2.5lbs.\r\n\r\nI understand why they weigh as much as they do in the vanilla game and this mod is by no means lore friendly, but being constantly over-encumbered without wearing tons of bandoliers or enchanting everything with Fortify Carry Weight made fighting Dragons feel like a chore. I try not to fast travel and whenever I encounter a dragon I think \\\"Oh great, now I have to ride back to Breezehome and dump a ton of bones...\\\" This mod fixes that frustration in a very simple, straight forward way.\r\n\r\nThis mod should be compatible with anything, except other mods that change the weight value of Dragon bones and scales.\r\n\r\n---\r\n\r\nINSTALL/UNINSTALL:\r\n\r\nDownload and install with NMM. If installing manually, simply drop the included esp. file into your Data folder.\r\n\r\nTo uninstall, either do it through NMM, or disable and delete the esp. file.\r\n\r\nCREDITS:\r\n\r\nBethesda Game Studios - For Skyrim and the Creation Kit.\r\n\r\n---\r\n\r\nThis mod was created by Urge, you can use this for anything you want (Though I\\'m not sure why you would) as long as you give credit.\r\n\r\nPlease do not upload this mod anywhere else without asking me and getting my permission.\r\n",
  "categoryId": "24",
  "version": "0.1",
  "author": "Urge",
  "createdUnix": "1355957448",
  "updatedUnix": "1355957499",
  "containsAdultContent": false,
  "uploadedBy": "UrgeNexus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106259",
      "name": "Urge Lighter Dragon Bones and Scales",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Urge Lighter Dragon Bones and Scales-28607-0-1.rar",
      "uploadedUnix": "1355957499",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/2f1fe2b690d16d6df18de4b2da10b25b366bde895f78fe094d19a2a923eb9157/analysis/1407312589/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Urge%20Lighter%20Dragon%20Bones%20and%20Scales-28607-0-1.rar?fid=106259&ttl=1535802074&ri=8192&rs=8192&setec=42fa3a38e2145f4e113561cbc9d61dae"
    }
  ]
}