{
  "modId": 2864.0,
  "modName": "Save Game - Vicente Valtieri",
  "summary": "Lets you play as everyone\\'s favorite vampire assassin from Oblivion.",
  "descriptionHtml": "What if the Dark Brotherhood questline in Oblivion never went out as planned, and Vicente Valtieri somehow escaped the Purification? He wandered through Tamriel for another two centuries, a Brother without a Family... and finally, another settling dusk brought him north to the land of Skyrim, where destiny unfurled.\r\n\r\nOriginally, I made this for myself, but I thought, \\'Hey, I can\\'t be the only Vicente fan out there.\\' So if you want to play as him, here you go!\r\n\r\nThere are a few visual issues with this. It\\'s not perfect - Skyrim has a much different character build than Oblivion does - but I did manage to take a ponytail from the female models to put on him. For some reason, vampirism turned his skin brownish, while he was quite pale before. Does anyone know any replacers and fixers for this? For now, you might want to use them if you use this file. As such, there\\'s a warpaint effect on his face that\\'s rather noticeable. With his original skintone, it was nigh invisible, and served to make his cheeks look slightly more concave.\r\n\r\nIn downloading, I have the ponytail hair file too to replace one of the Breton male hairstyles. This goes in meshes, for the record.\r\n\r\nFor the eyes, I recommend downloading [url=http://www.skyrimnexus.com/downloads/file.php?id=112]these[/url] to replace whatever weird eyes Skyrim has for vampires.\r\n\r\nDespite being level 14, this file has done practically nothing. It\\'s explored a bit (and contracted vampirism), but hasn\\'t done any quests whatsoever beyond telling Jarl Balgruuf that Helgen got trogdor\\'d. The level really came from me getting jumped by four(!) frost trolls back when I was just level 3, and, well, I hadn\\'t saved in a really long time, so I turned on immortal mode. As a result, the armor skills are rather disproportionately high... but ah well, it won\\'t kill you.",
  "categoryId": "43",
  "version": "1",
  "author": "Diana",
  "createdUnix": "1323214424",
  "updatedUnix": "1323214742",
  "containsAdultContent": false,
  "uploadedBy": "dianacat777",
  "primaryFile": null,
  "files": [
    {
      "fileId": "7748",
      "name": "Vicente Valtieri save",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1637",
      "fileName": "Vicente Valtieri save-2864-1.zip",
      "uploadedUnix": "1323214742",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/3653c32aac9f83e33212c5f95548b6541adfdf4e7cb3fcae1808dfe333abfa7c/analysis/1406487963/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vicente%20Valtieri%20save-2864-1.zip?fid=7748&ttl=1535757439&ri=8192&rs=8192&setec=d80dfba8201edefcb6f0508c925ab2f4"
    }
  ]
}