{
  "modId": 28654.0,
  "modName": "No Alikr Accusation",
  "summary": "Removes the Alik\\'r Accusation wilderness event",
  "descriptionHtml": "Hello fellow Skyrim travelers, this mod removes the Alik\\'r Accusation wilderness encounter from the list of things you might run into while traveling the roads.  This does not break the quest in Whiterun (no spoilers there).\r\n\r\n[i]What it does:[/i] This mod removes the \\\"Alik\\'r Accusation\\\" event from the set of wilderness encounters that the player can happen upon while traveling along the roads of Skyrim.  It does this by removing the quest from the list of wilderness encounters initiated by the Story Manager, and then goes a little further by making the quest never start to begin with.  Other wilderness encounters still happen normally.\r\n\r\n[i]What and why?[/i]  When you are traveling in the outdoors and you come upon two Alik\\'r Warriors harassing a Redguard woman, and then one of them says something about her not having an identifying scar, and they sort of leaver her alone and she begins to complain about being harassed, this is the little vignette called \\\"Alik\\'r Accusation\\\".  It is meant to be linked to the quest in Whiterun regarding another Redguard woman being sought by the Alik\\'r.  I wanted to remove this encounter because it was happening in the most ridiculous of places (in the freezing snow outside Windhelm) and happening too often.  Simply put, once you\\'ve heard this exchange once or twice you know how it goes, and I did not want it happening in my game anymore, especially for such an insignificant quest.  If you feel the same, please download and enjoy.\r\n\r\n[b]Version History:[/b]\r\n\r\n[u]0.9[/u]\r\nFirst release.  The mod is very simple so I do not expect conflicts or problems, but please report any issues.",
  "categoryId": "28",
  "version": "0.9",
  "author": "Delaric",
  "createdUnix": "1356072229",
  "updatedUnix": "1356072328",
  "containsAdultContent": false,
  "uploadedBy": "Delaric",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106543",
      "name": "No Alikr Accusation",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "No Alikr Accusation-28654-0-9.zip",
      "uploadedUnix": "1356072328",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/eec162e57e879a926ddc9e0e77c3988f7f29f2762be8d4045ab4ff4b4cc4dd7d/analysis/1407314768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Alikr%20Accusation-28654-0-9.zip?fid=106543&ttl=1535802159&ri=8192&rs=8192&setec=282e8c340fd1734825a9c11efca63f2d"
    }
  ]
}