{
  "modId": 2865.0,
  "modName": "Armdudes Alternative Guards",
  "summary": "This is a wip release so this ain\\'t gunna cover every last guard. As of now all male plate mail wearing guards + boots, gloves and a few helmets have been reskinned or recolored using bits and pieces from different textures already present in game. I felt this gave the town guard a more nordic look. This version is about 1/2 finished.",
  "descriptionHtml": "Arm\\'s alt Guards - initial wip release 0.5 - readmeh\r\n------------------------------------------------\r\n\r\nFancy Description:\r\n\r\nAre you fed up with your dull, average, boring arrow to the knee taking town guard? Why not spice things up a bit with fur! Thats right! Fur, that you and your fellow ex-adventureres can wear over your cold frigid in need of warming nordic skin. Where exactly can I wear this wearable fur you might ask? Well, it just tucks in nicely right under that brand new set of fancy looking chainmail. You heard correct, CHAINNNN-MAILLLL!!! Now lets be honest here, yes plate mail is probably just as good as chainmail in terms of how much blunt force and slicey dicey sword swinging it can take but who\\'d actually prefer the frilly plating over the classic look and feel of good ol fashioned chainmail? Not me I tell ya. Besides aren\\'t plates those things that rich people eat off of in their sissified banquet halls under those cowardly stone structures they call walls? You darn toot\\'n thats what they are and I\\'ll be damned if I\\'m to go another minute wearing these wretched things. Its time to alternate, change your boring plate wearing guards to chainmail and fur wearing, but just as generic, semi more nordic looking guards with Arm\\'s Alternative Guards!\r\n\r\n------------------------------------------------\r\n\r\nReal Description:\r\n\r\nThis is a wip release so this ain\\'t gunna cover every last guard. As of now all male plate mail wearing guards + boots, gloves and a few helmets have been reskinned or recolored using bits and pieces from different textures already present in game. I felt this gave the town guard a more nordic look. This version is about 1/2 finished.\r\n\r\n------------------------------------------------\r\n\r\nThings to Do:\r\n\r\n-Replace padded armor guards\r\n-Finish female plate armor guards\r\n-Improve half assed normals\r\n-Improve existing skins based on user feedback\r\n-Add more screenshots, before afters\r\n-Edit shields, flags and other guardy symbols?\r\n-Actually finish said things without forgetting or being lazy\r\n\r\n------------------------------------------------\r\n\r\nInstallations:\r\n\r\nDrag and drop or simply extract data folder to your skyrim folder.\r\n\r\nFor Steam users it should be \r\n\r\nC:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\USERNAME\\\\The Elder Scrolls V Skyrim\\\\\r\nor for 32 bit users\r\nC:\\\\Program Files\\\\Steam\\\\steamapps\\\\USERNAME\\\\The Elder Scrolls V Skyrim\\\\\r\n\r\n\r\nFor non steam users it should be\r\n\r\nC:\\\\Program Files (x86)\\\\The Elder Scrolls V Skyrim\\\\\r\nor for 32 bit users\r\nC:\\\\Program Files\\\\The Elder Scrolls V Skyrim\\\\\r\n\r\nTo Uninstall simply browse to \\\\Skyrim\\\\data\\\\textures\\\\armor\\\\ and delete or move the stormcloaks folder.\r\n\r\n------------------------------------------------\r\n\r\nOther notes, credits and stuff:\r\n\r\nWhen providing feedback, please be helpful as well as critique, I\\'m terrible with my normals and I am using very outdated software which is lacking in tools, filters and other features which should be pretty common by today\\'s standards. I\\'m serious though, help me with normals if you can. Endorsements and all are nice aswell vote for me too if you like these skins.\r\n\r\nIf you plan on using these for any mods or anything, email or pm me first and I\\'ll more than likely give you permission so long as you leave me with proper credit.\r\n\r\narmdude101 AT gmail DOT com \r\n------------------------------------------------\r\n\r\nThanks and have fun\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "33",
  "version": "0.5",
  "author": "armdude",
  "createdUnix": "1323214510",
  "updatedUnix": "1323214685",
  "containsAdultContent": false,
  "uploadedBy": "armdude",
  "primaryFile": null,
  "files": [
    {
      "fileId": "7747",
      "name": "arms alt guards",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12688",
      "fileName": "arms alt guards-2865-0-5.zip",
      "uploadedUnix": "1323214685",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/87e1e3bd763291f3e856dc40db03ecdb7a198a6ebfdc91dd944a44421a259af1/analysis/1406487916/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/arms%20alt%20guards-2865-0-5.zip?fid=7747&ttl=1535757441&ri=8192&rs=8192&setec=4805aaed5a8fd90754908d92ad6134de"
    }
  ]
}