{
  "modId": 28677.0,
  "modName": "Bloodlust Bow",
  "summary": "An Armory made of Blood and Bones! ",
  "descriptionHtml": "Every now and then the Deadric Princes roam Tamerial for bloodsport, slaughtering all mortals in their path. One such prince use the parts of the mortals he slew to fashion new weapons and Armor...When he decended back to the planes of hell....something remained....The Bloodlust set!\r\n\r\nUPDATE - NOW INCLUDING - Hammer Version 2 and The Bloodlust Quiver! At the moment the whole mod is just in beta so please not complaints about it being to easy to get/make it craftable etc etc - All that will come!\r\n\r\nAll items can be found in a chest located right behind the Riverwood Trader for now - this is just to make it easy to test while in Beta. - Please give me all your feedback on how to improve this mod :) \r\n\r\n[youtube]sN_SgWCfY04[/youtube] \r\n\r\nThanks to JJStudio for making the video! \r\n\r\n\r\n\r\nStats - Same as the standard Deadric Bow\r\n\r\nLocation: Riverwood Trader, upstairs table or Behind the trader in a chest attached to the back wall. \r\n\r\nTo install just copy the file and folder from the .rar into your Skyrim data file. If you cant open the file grab Winrar (google it)\r\n\r\nI\\'m not very good at providing support for my mods as I tend to pick Skyrim up every couple of months, but if you spot a problem let me know and you might get an answer. ",
  "categoryId": "55",
  "version": "3.0",
  "author": "Silverfeet",
  "createdUnix": "1356110296",
  "updatedUnix": "1356362133",
  "containsAdultContent": false,
  "uploadedBy": "SilverfeetStudio",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107295",
      "name": "BloodLust Set",
      "version": "v3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1343",
      "fileName": "BloodLust Set-28677-v3.rar",
      "uploadedUnix": "1356362133",
      "modVersion": "v3",
      "virusScanUrl": "https://www.virustotal.com/file/daacf57c111908410b051c95f5a2ef2a2d82d1381ce85f8adef2821faba412b1/analysis/1407320765/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BloodLust%20Set-28677-v3.rar?fid=107295&ttl=1535802190&ri=8192&rs=8192&setec=28bfc7d277536f9d17842843a86d886b"
    }
  ]
}