{
  "modId": 28747.0,
  "modName": "Mein Starter Savegame with Nord lvl 1",
  "summary": "Spare Zeit am Anfang\r\nSave Time at beginning",
  "descriptionHtml": "DEUTSCH - GERMAN (English scroll down)\r\n\r\nMan erstellt einen neuen Charakter und freut sich so richtig, auf Abenteuer zu gehen. \r\n!!!ABER STOP!!!\r\nErstmal aus Helgen raus, durch Flusswald nach Weißlauf, dann ins Ödsturzhügelgrab, wieder nach Fluswald und Weißlauf, einen Drachen töten, nach Hoch Hrotgar, nach Ustengrav, wieder nach Hoch Hrodgar und wieder den Berg runter nach Weißlauf.... PUUUUH das kostet einen schon mal mehrere Stunden. Und das für jeden Charakter nochmal...\r\n\r\nMich nervte es jetzt und ich habe mir ein besonderes Savegame erstellt.\r\nDie Besonderheiten kurz angerissen:\r\n- Charakter auf LVL 1!!! Alles ist noch offen!!! (Fähigkeitenmenu öffnen -> man wird LVL 8!!!)\r\n- Aus Helgen mit Ralof, da man dann die Kaiserliche erschlagen kann, die einen zum Block schickt. Zudem kann man am Anfang mehr Kaiserliche Rüstungen sammeln und verkaufen.\r\n- 2 Begleiter Lydia und Meeko (Hund)\r\n- Einfach mit \\\"showracemenu\\\" die Rasse, Geschlecht und Aussehen ändern, neuen Namen und fertig.\r\n- Briesenheim ist noch nicht gekauft\r\n- Char ist überladen mit Waffen, Rüstungen, Zaubertränken, Essen, Zutaten uvm was ich unterwegs alles gefunden habe.\r\n\r\nInstallation:\r\nKopiert die Quicksave Dateien in euer Save verzeichnis und ladet es. Es wird eine Meldung kommen, dass Inhalte nicht mehr verfügbar sind. Klickt einfach JA. öffnet dann die Console und gebt showracemenu ein, Konsole zu und macht Eure Änderungen. Bei mir funzt alles problemlos. Der Char ist eigentlich auf LVL 8. Ich habe bisher das fertigkeitenmenu nicht aufgerufen. Macht dies, und ihr könnt 7x Magicka, Gesundheit und/oder Ausdauer auswählen.\r\n\r\nIch hoffe es gefällt Euch.\r\n\r\nENGLISH\r\n\r\nYou Make a new Char and you looking forward to do some adventures.\r\n!!!BUT STOP!!!\r\nFirst you have to do some boring stuff. Get out of Helgen, pass Riverwood and reach Whiterun,\r\nthen collect the Dragonstone, to Riverwood and Whiterun again, Kill a dragon, then go to High Rhotgar, take the horn and again to High Rhotgar and then down the hill.\r\nPUUUUH that cost you 2 hours or more before you can start your interesting adventures. And that for each charakter again...\r\n\r\nI was bored about that and made me a special Savegame.\r\nThe Specials:\r\n- Char is lvl 1!!! All is open for different play directions. Open Perk Menu and you become LVL 8!!!\r\n- I went with Ralof, cause i can kill the imperial Bitch who wanted rip off my head...\r\nanother reason is, the armors of imperial enemies are more expensive when selling.\r\n- 2 companions Lydia und Meeko (dog)\r\n- Simply use \\\"showracemenu\\\" for changing gender, race and appearance, new Name and ready for action.\r\n- Breezehome isn\\'t bought till now,\r\n- The char is overloaded with all stuff i found on my way with armors, weapons, potions, foods, incrediences and many more\r\n\r\nInstallation:\r\nJust copy the quicksave datas to your save directory and load it. Open the Console and type in showracemenu. Close Console and do your changes in gender, race and appearance.\r\nIn my games it runs perfectly. After you have done your char, go to Perk Menu and you will become LVL 8. When loading the game will tell you, there is missing content, will you really load it click YES. \r\n\r\nHope you will like it.",
  "categoryId": "43",
  "version": "",
  "author": "TobiasRieperGER",
  "createdUnix": "1356197929",
  "updatedUnix": "1356198249",
  "containsAdultContent": false,
  "uploadedBy": "TobiasRieperGER",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106862",
      "name": "Nord LVL 1 Savegame",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3793",
      "fileName": "Nord LVL 1 Savegame-28747-.rar",
      "uploadedUnix": "1356198249",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a815da747e69298122dd91068ea5f325d9a12c31b803376e5847a767123dae40/analysis/1407317599/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nord%20LVL%201%20Savegame-28747-.rar?fid=106862&ttl=1535802306&ri=8192&rs=8192&setec=18ccac0e7e54f94998495ba47fbfa3bf"
    }
  ]
}