{
  "modId": 28786.0,
  "modName": "AC Proudspire Manor",
  "summary": "Architecturally Corrected proudspire manor mod. Made the inside of the house look more like the outside. Totally redecorated interior so the best house in the game looks like it should within reason of course:-) NOW HEARTHFIRE COMPATIBLE&#33;",
  "descriptionHtml": "UPDATE 8/3/2015\r<br />I wonder what those not loaded fragments are in the CK? oh those are the fragments I should have sorted out LAST TIME&#33;&#33;&#33;&#33; \r<br />Ugh... well I fixed the hearthfire problems finally I hope. I first \r<br />noticed the problems when I tried using my solitude home for kids \r<br />adoption and the house wasn&#39;t on the list nor any of my other house mods\r<br /> only the default HF homes so I found that the code not loaded fragments\r<br /> were the places where the calls to the hearthfire scripting should go \r<br />if it wasn&#39;t there already by default or where my code should go to \r<br />enable/disable things. So that is now sorted and things should work \r<br />properly now finally:-)\r<br />\r<br />\r<br />\r<br />Architecturally Corrected proudspire manor mod. Made the inside of the house look more like the outside. Totally redecorated interior so the best house in the game looks like it should within reason of course:-)\r<br />\r<br />This mod has been cleaned properly with TES5EDIT and this mod now REQUIRES the unofficial skyrim patch and the unofficial hearthfire patch or it won&#39;t work. I had to do this in order to get the bugs in this house fixed and to get this house to be compatible with those unofficial patches.\r<br />\r<br />I ran this mod through the latest version of TES5EDIT and removed the housepurchase stuff and started over with it. Now everything is simple and there are some limits to keep in mind when buying things for this house. The default way this house is programmed in the housepurchase quest has the child room as buyable and thats it no way to remove it. My previous version of this mod tried to fix this by adding a remodel option but that doesn&#39;t work and screws up the hearthfire scripts. So this time I just kept it simple just like default programming. When you buy the child room it disables a portion of stuff in the player bedroom to make room for the child room, then adds in some walls and doors to separate the child room from the player bedroom area.\r<br />\r<br />Once you buy the child room there is no going back to the bachelor life in this house&#33; so keep that in mind when you are talking to the steward in the blue palace. Buy the bedroom, the living room and so on but don&#39;t buy the kids room unless you really want to.\r<br />\r<br />I added roombounds&#33; finally some roombounds in proudspire manor&#33; so rendering should be easier on your pc since each floor has a roombound now. I fixed the shadow casting light in the clothes washing area down stairs to get rid of shadow striping. I removed the custom bed with TES5EDIT so the default fancy bed is back and I linked it to the house central xmarker with the spousebed keyword so the spouse should sleep in the correct bed now.\r<br />\r<br />\r<br />\r<br />I always couldn&#39;t stand how the inside of the house had areas sticking out past what should be the courtyard of the bards college and those stairs&#33; There is no external shape on the outside to match those stairs on the inside. So I threw those stairs away and fixed everything&#33;\r<br />\r<br />This mod changes just about everything for proudspire manor, I took a look at the outside and then matched up the inside by the placement of the windows. Obviously the scale of the outside is not the same scale as the inside. I have no idea why bethesda made exteriors look so cartoony but they did. So what I did was I used the individual floor sections as generic measurement devices. The default house was two floor sections wide but it had an extra section wide for the main door area. This mod makes the house three floor sections wide even though it already was I just filled it out. The stairs have been replaced by internal stairs I crammed in there&#33; Had to modify some other stairs found in the game files to fit the mod. \r<br />\r<br />There are four floors in this house, the master bedroom on the top floor yep that is right the whole floor is the bedroom not just one half like default. The living room, kitchen, and dining room are all on the second floor and the commons area with guest bedrooms, housecarl room, alchemy lab, and laundry area are on the first floor. Then finally the basement has storage areas and a cellar fully stocked and the armory with enchanter is down there too.\r<br />\r<br />I updated the decorating guide book to better illustrate this mod too&#33;\r<br />\r<br />Master Bedroom\r<br />\r<br />Noble double bed, standing weapon rack for two weapons just like default. Table for two near the main windows, small table for personal business with strong box. There is a noble storage trunk at the end of the bed and a safe and house storage box to the side along with two noble wardrobe cases. Two bookshelf setups with reading area.\r<br />\r<br />Living Room\r<br />\r<br />Table for four with guest area near the front door. Reading area with one bookshelf, fancy storage area and two barrels behind the stairs where nobody can see that came in from the front door. \r<br />\r<br />Kitchen\r<br />\r<br />Totally filled out the kitchen with food and ingredients&#33; Three hanging rings for hanging things, sectioned off the kitchen slightly from the rest of the floor so it looks more like a kitchen space and put the fireplace in there with the cooking spit. This fireplace goes to the little chimney on the outside on the back of the house. \r<br />\r<br />First Floor\r<br />\r<br />Commons area, place for guests that are not as rich or highly valued to hang out. Main area for house functions like laundry and other daily tasks sort of thing. Two guest rooms down there but they are small. Housecarl finally has a bed she owns&#33; Now when I enter the house she doesn&#39;t say bad things to me just hello thane and other thane worded greetings:-) Her original room was four floor sections square sized, so I chopped it in half and moved it to the opposite side of the house where it fits now because the house is three floor sections wide instead of two.\r<br />\r<br />There is a big water storage or beer storage down there depending on how you think:-) Alchemy lab near the only window on first floor has additional shelf storage space and a storage box for alchemy lab. Laundry area uses that second chimney fireplace has a pipe going through the roof which is actually just under the stairs for the backdoor outside. \r<br />\r<br />Basement\r<br />\r<br />Plenty of storage space down there and I used all the barrels in the default house and set them as always there so you don&#39;t lose any barrel space from default. Storage bags were divided between always there and basement upgrades. There is a cellar down there fully stocked with all kinds of wine and mead. The armory/enchanter room is fully loaded with FOUR mannequins instead of two and FOUR shield racks instead of two plus nine weapon plaques and that five space standing weapon rack is there too. Put a master library on the side of that room which has four noble book cases like the cases used in winterhold college so put as many books as you want there, store your master collection of books there between four cases.\r<br />\r<br />\r<br />Decor\r<br />\r<br />I decked out this house&#33; Curtains for windows on the second floor and top floor with fancy curtains on the walls in the master bedroom. No curtains or fancy stuff for first floor since it is for commoners lol. The armory enchanter area is decked out too since it should be, this is the most expensive house in the game and so it should look like what it cost.\r<br />\r<br />Installation\r<br />\r<br />Copy the meshes and scripts folder and ACProudSpireManor.esp files to your data folder or use nexus mod manager it should work with that. \r<br />\r<br />The xmarkers were all decorate markers only with opposite state change options. So I changed that and made start markers for the cobwebs and crap then put the stuff on the decorate markers and got rid of the opposite state change settings. The only marker I did not mess with was the porch marker but it works just fine. Changed the scripts in house purchase to use the new markers and clear them out when you buy the decorate markers aka upgrades. \r<br />\r<br />Two default markers were not used in the default home, the guest bedroom marker aka hosuecarl and another marker called floors. I made use of both of them and when you buy the decorate floors and walls upgrade from the steward, that upgrades the first floor and basement. The upgrade will be there at the steward for people running savegames because it exists in the master files of the game, it was always there so it shows up when tested with save games. No need to run console to get it if you have bought the home already.\r<br />\r<br />Bugs\r<br />\r<br />Since the original home was full of bugs, any fixes you used on it will need to be removed before using this mod. Also for you save game people you will have to run console to get rid of the cobwebs even though they shouldn&#39;t be there since all that stuff was moved to start markers. Just use the prid command and disable enable commands to clear out the cobwebs should you see any.\r<br />\r<br />For example you want to disable a marker you type prid 00000000 press enter then type disable and press enter. Then exit console and wait a few seconds it should be gone instantly though. the zeros above are an example just put the marker code there to make it work. Depending on how many mods you have loaded you will have to change the second digit of the code numbers to get them to work. So I have five mods loaded so the number will be 050134f7 instead of 020134f7. you have to keep trying next number for second digit until you get it working.\r<br />\r<br />Here are the prid commands for start and decorate markers in this mod.\r<br />\r<br />START MARKERS\r<br />\r<br />Alchemy: 050134F7\r<br />Bedroom: 05004901\r<br />Enchanter: 05013A61\r<br />Floors: 0500B15C\r<br />Guest tbedroom/housecarl room: 0500D776\r<br />Kitchen: 050095BE\r<br />Livingroom: 050095BD\r<br />Living room supplemental disable 0200418B\r<br />Decorate child disable 0200418A\r<br />\r<br />DECORATE MARKERS\r<br />\r<br />Alchemy: 000E25D3\r<br />Bedroom: 000E25D5\r<br />Enchanter: 000E25D2\r<br />Floors: 000E25D7\r<br />Guest bedroom/housecarl room: 000E25D4\r<br />Kitchen: 000E25D1\r<br />Livingroom: 000E25D0\r<br />Living room supplemental 0200418C\r<br />Porch: 000E25CF\r<br />Decorate child room 02004189\r<br />\r<br />\r<br />For save game users, you are most likely SOL because this house is changed so much best thing is to save it for later when you start a new game.\r<br />\r<br />Find any bugs? Post them in the comments section so I can fix them:-)",
  "categoryId": "67",
  "version": "v1.3",
  "author": "Dragonslayer2k12",
  "createdUnix": "1356240093",
  "updatedUnix": "1438578048",
  "containsAdultContent": false,
  "uploadedBy": "dragonslayer2k12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106993",
      "name": "ACProudSpireManor",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "126",
      "fileName": "ACProudSpireManor-28786-v1-0.rar",
      "uploadedUnix": "1356240161",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9d724a46d33dcf0fcbd3e930ac3600df338812d8eae2a807958246d2200c51b8/analysis/1407318434/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ACProudSpireManor-28786-v1-0.rar?fid=106993&ttl=1535802363&ri=8192&rs=8192&setec=049fd9013439216717e3b55da49043b2"
    },
    {
      "fileId": "1000170362",
      "name": "ACProudspireManorHF",
      "version": "v1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "223",
      "fileName": "ACProudspireManorHF-28786-v1-3.rar",
      "uploadedUnix": "1438578048",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/74da2c3a3625ff0eafc0701bc0a6f87f8dd06cd1dd7dd69e3e978bf86a3080e5/analysis/1438578063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ACProudspireManorHF-28786-v1-3.rar?fid=1000170362&ttl=1535802364&ri=8192&rs=8192&setec=2aeb0272546afe1ade8025b52dc2beb3"
    }
  ]
}