{
  "modId": 28798.0,
  "modName": "My little perk dispenser",
  "summary": "Vanilla perks to almost everyone.",
  "descriptionHtml": "Trying to make my game harder. Everyone knows that perk system in Skyrim is implemented mostly to player. Some of the opponents have some perks but only on high level at first and only offensive perks at second. Again it\\'s disbalanced, as always in Beth games.\r\n\r\nI decided to change this. Why? Because ASIS and some similar mods simply doesn\\'t work on my system. Dunno why and don\\'t want to know. All this scripting and Java and whatever else things, i don\\'t trust \\'em.\r\n\r\nThis mod is built only with Creation Kit for Skyrim 1.8. Simple and effective (i suppose). Didn\\'t playtested it all at the moment.\r\n\r\nSo.\r\nAll Bandits, Draugh, Falmer, Forsworn, Thalmor, Soldiers, Guards, even Afflicted gained some weapon, magic and especially armor perks that was missing by some miracle, easening my gameplay and making perks like Bone Breaker and Skullcrusher useless. Maces are only for stagger, yeah, like hell.\r\n\r\nList of perks added to almost anyone:\r\n\r\nSkullcrusher\\\\Limbsplitter\\\\Deep Wounds and similar perks from one-handed tree (bleeding, crit and ignoring armor), Armsman, Barbarian - different ranks depending on level. Prepare your armors carefully. Mace welders shoud cut it like a paper. Swordsmen will crit. As for axes, i suggest you to search Nexus for some mods that fixes bleeding damage. Dual weild settings stays untouched.\r\n\r\nDevastating Blow and analogue from One-handed. This perk boosts up standing power attack, but it can be evaded. Move in battle.\r\n\r\nPower bash, Block Runner, Shield Wall, Elemental Protection(!) ,Deflect Arrows(!) for EVERY one of those opponents (in case if some one will spawn with a shield). Now You will have to aim carefully with a bow and spells cause raised shield should absorb all the damage. It may be a little harsh desicion, but in vanilla shielded enemy dies as easily as one without a shield. Lame. Heavy armor will be more useful now cause they WILL stagger you often.\r\n\r\nMatching set (both), Well fitted, Tower of Strength, Conditioning, Unhindered, Custom Fit, Agile Defender, Juggernaut (different ranks) to almost everyone. They got an armor rating different than some 7,7459%! Finnaly! Prepare your maces and crossbows. Much higher armor rating, less stagger, faster movement speed in any armor type. The Bandits and Thalmor should be moderately or even much harder to kill after this. And it supposed to be that way. Conditioning & Unhindered will be encountered by you approx. after 20 level. And not every bandit in the game has matching set of armor.\r\n\r\nAugmented shock\\\\frost\\\\flames to spellcasters - where they were missing. Strangely enough, spellcasters in Skyrim already got a pack of combat perks and ones like Regeneration or even spell absorb from alteration school. \r\nDeep Freeze was added to ice mages and draugh. With this perk you will be frozen solid by ice spells if you health is below 20%. Beware. Why only this? Intense Flames won\\'t work on player and Disintegrate is too harsh in my opinion.\r\nWatch for draugh and falmer after this, lots of them gained these perks too, as well as Armsman and other perks from one-handed tree, so they gonna be a way better spellswords than before. Imagine this, he freezes you and kills with a sword crit. xD\r\n\r\nLots of archers gained proper perks too. Damage, faster drawing, faster movement, stagger and all that.\r\n\r\nNO Paralyze or high end perks has been added to archers or melee combatants.\r\n\r\nAll bonuses are heavily dependant on level. No 1st level bandits with all armor rating perks at maxed rank. God bless the templates.\r\n\r\nAll draugh and falmer without exception have gained Skullcrusher\\\\Limbsplitter\\\\Deep Wounds and analogues at maxed rank (75% of your armor will be ignored and 20% crit on you) and all shield perks cause they have no armor at first and are mostly weak opponents at second.\r\nI\\'m aware that there are no ancient nordic and falmer maces but there are a lot of other mods with these weapons. U dig bro?\r\n\r\nAlso, i strongly recommend to install Enemy AI and Enemy Scaling modules from Skyrim Redone (SkyRe). Thanks to author, it\\'s modular. But any similar AI improving mod should do the trick. Should work with my mod with no problems. Load it after.\r\n\r\nAnd make a new savegame before installing this mod, just in case.\r\nI\\'m ready for any suggestions.",
  "categoryId": "77",
  "version": "1.0",
  "author": "Me",
  "createdUnix": "1356269064",
  "updatedUnix": "1356269160",
  "containsAdultContent": false,
  "uploadedBy": "Poi3on",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107034",
      "name": "This one",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "59",
      "fileName": "This one-28798-1-0.rar",
      "uploadedUnix": "1356269160",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c8a3348755595aa65fe4eda9af3c47b5795f6d537f2bc0ec63435b6e250da5c4/analysis/1407318806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/This%20one-28798-1-0.rar?fid=107034&ttl=1535802383&ri=8192&rs=8192&setec=ac10ba5bffcc185c744dad4e92e4f43f"
    }
  ]
}