{
  "modId": 28800.0,
  "modName": "Economics of Skyrim - Economies de Bordeciel - French Translation",
  "summary": "French Translation of Economics of Skyrim by Thomas Kaira.",
  "descriptionHtml": "[center][img]http://i.imgur.com/fqaP1.png[/img][/center]\r\n[url=http://skyrim.nexusmods.com/mods/35320]\r\n[center][color=yellow]Si vous aimez ce mod et cette traduction, n\\'oubliez pas les endorsements! Ca ne prend qu\\'un clic et ça fait toujours plaisir![/color][/center]\r\n\r\n[center][img]http://www.ushareimg.com/images/286T3R.png[/img][/url][/center]\r\n\r\n\r\nCe mod est la traduction française du mod [url=http://skyrim.nexusmods.com/mods/11919]Econonomics of Skyrim[/url] de Thomas Kaira. Veuillez d\\'abord télécharger et installer le mod original avant d\\'installer cette traduction.\r\n\r\n[color=red]ATTENTION: le mod n\\'est plus disponible sur le nexus alors que vous devez avoir ses ressources pour faire fonctionner la traduction. Vous trouverez la traduction française et complète [size=5][url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/economies_de_bordeciel.php]ici[/url][/size], et uniquement ici. Téléchargez depuis cette page nexus est donc totalement inutile.[/color]\r\n\r\nRetrouvez d\\'autres mods sur le [url=http://skyrim.nexusmods.com/mods/28680]répertoire.[/url]\r\n\r\nPour suivre mon actualité de traduction de mods: [url=http://www.facebook.com/pages/Traduction-de-mods-Par-Raphou112/455702141160610?]ICI[/url]\r\n\r\n[size=5]Lien Mirror[/size]: [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/economies_de_bordeciel.php]La confrérie des traducteur[/url]. Le mod contient les ressources sur ce site, ce qui n\\'est pas le cas sur cette page. (Attention: il se peut que la version soit un peu en retard, étant donné que ce n\\'est pas moi uppload sur ce site.)\r\n\r\n[size=7][color=gold][center][b][font=mv boli]PREREQUIS[/font][/b][/center][/color][/size]\r\n\r\n\r\n- [b]Skyrim 1.8+[/b] : vous aurez des bugs sinon\r\n- [b]Skyrim Script Extender [/b]: vos scripts ne marcheront pas\r\n\r\n\r\n[size=7][color=gold][center][b][font=mv boli]DESCRIPTION[/font][/b][/center][/color][/size]\r\n\r\n\r\nVous êtes arrivez à votre forge locale et vous commencez à acheter des nouveaux jouets, armes armures, ce que vous voulez. Mais n’avez-vous jamais remarqué quelque chose de bizarre ? Comme si tous les forgerons avez exactement le même stock ?\r\n\r\nTous les marchands dans ce jeu a on leurs stocks déterminés par des leveled list qui les rendent aléatoires et adaptés à votre niveau. Cela marche mais c’est inégalant et peut vous rendre perplexe quand un marchant n’a qu’un stock d’armes en acier et qu’un autre jour il soudainement un stock d’armes en ébonite.\r\n\r\nCela n’aurait-il pas de plus de sens que les marchands aient leurs stocks basés sur les ressources de leur région ?  Ce n’est pas les temps modernes, les marchands n’achètent pas leur stock pour les revendre mais les fabriquent eux même avec ce qu’ils trouvent. L’auteur pense que l’économie devrait refléter cela. C’est pour ça qu’il a fait ce mod.\r\n\r\n\r\n[size=7][color=gold][center][b][font=mv boli]COMPATIBILITE[/font][/b][/center][/color][/size]\r\n\r\n\r\nTéléchargez le patch Dawnguard si vous souhaitez que ce mod amrche pour cette extension. NB : N’ayant pas Dawnguard, je n’ai pas pu tester ma traduction, donc dites-moi si il y a des probèmes. (dîtes le moi aussi pour le mod de base :D)\r\n\r\nCe mod est incompatible avec tout mod qui modifie les marchands. En même temps pourquoi prendre un mod vu toutes les possibilités offertes par ce mod ?\r\n\r\n[color=red]Par ailleurs, et c’est très important.[/color]\r\n\r\nSi vous avez des mods qui modifient les listes des marchands (càd qui ajoutent des armes etc, comme Immersive Weapons), alors il y aura des problèmes.\r\n\r\n[color=red]Vous devez donc suivre ma procédure, très simple. [/color](bien sûr à faire après l’installation du mod).\r\nTéléchargez Wrye Bash.\r\nInstallez-le, lancez-le. Vous verrez la liste de tous vos mods.\r\nClic droit sur la colonne file > file > new bashed patch. Un fichier va se mettre à la fin de votre liste. Il ne devra jamais être ailleurs. (faites attention si vous utilisez BOSS, il vous le mettra avant les fichiers non reconnus, mettez-le alors simplement en bas).\r\nClic droit sur ce fichier > rebuild patch > build patch. Verifiez avant que leveled list soit coché  (vous y verrez tous vos mods qui modifient les inventaires).\r\nPuis activez ce fichier.\r\nPour refaire le patch, vous devez d’abord supprimer le patch puis refaire cette manip.\r\nJe vous conseille de faire ça, même si vous n’installez pas ce mod, [b]ça ne peut que faire du bien à votre jeu ![/b]\r\n\r\n\r\n[size=7][color=gold][center][b][font=mv boli]CARACTERISTIQUES[/font][/b][/center][/color][/size]\r\n\r\n\r\n[color=gold][b]• Economie Régionale •[/b][/color]\r\n\r\n[b]Généralement :[/b]\r\n\r\n- Les marchands généraux ne seront plus le seul arrêt pour tous vos besoins. Ils vendront en revanche en mesure de vous vendre nourriture, vêtements, bijoux, livres et bric-à-brac.\r\n- Les alchimistes vendront en plus grosses quantités. Ils auront à profusion des plantes régionales, mais importeront les autres ingrédients : leur stock ne sera pas garantit. Les ingrédients rares ont une faible chance d’être en stock.\r\n- Les forgerons vendent des armes et armures en fonction de ce qui est disponible dans leur région. Il y a une rare chance que des items rares soient dans leur stock.\r\n - Les aubergistes proposent maintenant des menus locaux. Ils n’auront que très peu de nourriture étrangère. Ces produits seront moins chers. De plus, vous trouverez des produits plus raffinés en ville que dans une auberge perdue, qui proposera des aliments très rustiques.\r\n- Les marchands ne sont plus levélés, càd que leur stock n’est plus en fonction de votre niveau. Si vous avez l’or, vous achetez. Cependant, vous ne pourrez pas acheter tout n’importe où. Faillaise et Blancherive ont par exemple une vaste gamme de produit.\r\n- Les marchands généraux vendront beaucoup moins de sorts, car les nordiques sont suspicieux envers la magie. Si vous recherchez des sorts ou des gemmes, allez voir le mage de la cour ou allez à Fordhiver ou Solitude.\r\n- Vous paierez plus cher les produits non locaux, pour compenser le prix du transport.\r\n- Si vous cherchez des produits pas très légaux ou des crochets, allez voir les caravanes khajit. \r\n- Le matériel orc sera très abordable dans les forteresses orques\r\n\r\n\r\n[b]Blancherive : Cuir, Fer, Corindon, Viande, Gibier[/b]\r\n\r\n- De part sa situation, il y a plus de chance de trouver quelque chose que dans les autres villes, mais les stocks dépondront fortement de la toundra : peaux, gibier, fer…\r\n- Les alchimistes auront plein d ‘ingrédients de la toundra, mais aussi pas mal d’ingrédients importés.\r\n- Les marchands sont équipés pour vendre de la viande, des légumes, des vêtements pour ouvriers. Il y a aussi des marchandises les classes moyennes.\r\n- Les forgerons vendent beaucoup d’objets en peau, acier et fer. Il y a aussi pas mal de produits importés comme Dwemer et Elfique. Il y a énormément de fer et de corindon. \r\n- Le Chasseur Ivre se spécialise dans le matériel de chasse de qualité. Vous ne trouverez pas d’arcs supérieurs à chasse, car ils ne sont pas dans le buisines des arcs.\r\n- Eorlund Grisetoison ne vend plus que des armes de la Forgeciel et des armes spéciales pour les Compagnons.\r\n- Au marché, vous trouverez légumes, viande et bijoux en argent.\r\n- Les aubergistes vendront viande, légumes, parfois du mammouth. \r\n- En clair, Blancherive est une cité excellente pour les nouveaux personnages, car en tant que cité centrale, vous trouverez un peu de tout.\r\n\r\n[b]Markarth : Métal Dwemer, Argent ,Or[/b]\r\n\r\n- Comme Markarth est sur ancienne cité Dwemer, on y trouve énormément de métal et d’objets dwemers. Il y a aussi beaucoup d’or et d’argent, mais pas beaucoup de peaux animales.\r\n- Les alchimistes vendent des produits locaux comme le genévrier, et aussi des ingrédients des ruines dwemers (falmers, chaurus…)\r\n- Les marchands généraux vendent des ustensiles dwemers, et de la nourriture des régions rocailleuses. Les vêtements sont plutôt destinés aux mineurs, mais il a par ci par là des vêtements raffinés. C’est aussi la seule cité où vous trouverez des gemmes en vente. \r\n- Les forgerons vendent essentiellement des produits dwemers ou argent. Vous trouverez du minerai d’or, de fer, dwemer.\r\n- Les aubergistes vendent des ragouts, un peu de chèvre. Il n’y a pas beaucoup de nourriture car la région ne s’y prête vraiment pas.\r\n\r\n[b]Faillaise : Ebonite, Malachite, bois, légumes[/b]\r\n\r\n- Etant proche de Morrowind il est plus facile de trouver de l’ébonite et du verre ici. Vous trouverez cependant plus d’ébonite que de verre.\r\n- Les alchimistes ont des ingrédients locaux. Champignons, œufs, et même poisson avec les lacs.\r\n- Malgré la forêt, on a nettoyé des zones pour planter grâce à la fertilité de la terre. Il y a donc beaucoup de fruits frais.\r\n- Les marchands vendent beaucoup de produits en bois, mais rarement de produits de valeurs à cause de la guilde des voleurs.\r\n- Les forgerons vendent des armes et armures en ébonite et verre, ainsi que des lingots. Mais en assez faible quantité et chère.\r\n- Les aubergistes favorisent l’hydromel Roncenoire, et il y a beaucoup de potages à cause de l’altitude de Faillaise.\r\n\r\n\r\n[b]Solitude : Pierre de Lune, Argent, Poisson[/b]\r\n\r\n- En tant que Capitale Impériale, Solitude est fortement sous influence Thalmor. Vous y trouverez facilement des armes et armures elfiques.\r\n- En tant que cité riche, vous y trouverez beaucoup de vêtements raffinés.\r\n- Il y a beaucoup de poisson en tant que cité portuaire, mais pas beaucoup de gibier et de légumes à cause du froid et des montagnes. \r\n- Les alchimistes se spécialisent en plantes robustes du nord. Avec les thalmors vous trouverez plus souvent des ingrédients rares.\r\n- Vous trouverez beaucoup de pierre de lune, d’argent et d’équipement elfique chez les forgerons. Vous ne trouverez pas du tout de fer et d’acier car la légion en a besoin.\r\n- Vous trouverez de bons arcs dans cette cité grâce à la présence militaire.\r\n\r\n[b]Vendeaume: Malachite, Ebonite, poisson, cuir[/b]\r\n\r\n- Le poisson est la principale protéine à Vendeaume. Il y a peu de légumes à cause de la région volcanique et le manque de terres fertiles.\r\n- Les alchimistes vendent des ingrédients locaux. Vous trouverez souvent des orteils de géants, des Dents de Spectres des Glaces, grâce à la culture nordique.\r\n- Les forgerons vendent beaucoup d’armures légères. Avec sa proximité avec Morrowind, il y a plus de chance de trouver du verre et de l’ébonite. Il y a plus de verre grâce à la mine du Bosquet de Kyne. Trouvez des armes est un peu plus dure à cause de guerre.\r\n\r\n[b]Petites châtelleries :[/b]\r\n\r\n- Epervine : Plein de bois, de flèches et d’oiseaux\r\n- Morthal : Plein d’ingrédients des marais, mais très faibles ressources à cause de son environnement.\r\n- Aubétoile : une petite cité commerçante. Vous trouvez une vaste gamme de produits dans cette ville.\r\n- Fordhiver : La cité pour les mages. Vous trouverez des sorts et robes à bon prix.\r\n\r\n\r\n[color=gold][b]• Sets d’Armure •[/b][/color]\r\n\r\n- Il est désormais possible d’acheter un set d’armure complet. Si vous en achetez un, utilisez le une foi, il va se détruire et chaque pièce va s’ajouter à l’inventaire.\r\n- Acheter un set en une fois coûte moins cher que d’acheter chaque pièce séparément. C’est aussi un moyen sûr d’acheter une armure si le matériel est rare dans la région.\r\n\r\n[color=gold][b]• Valeurs Régionales •[/b][/color]\r\n\r\nIl n’y a pas seulement les stocks qui varient par régions, mais aussi les prix. En voyageant vous verrez un message qui vous indique les fluctuations des prix. Les prix vont changer en fonction de là où vous êtes. Ainsi, acheter un bijou en argent à Markarth sera moins coûteux qu’à Blancherive.\r\n\r\n[color=gold][b]• Réserves d’or •[/b][/color]\r\n \r\nDans ce jeu, les marchands ont très peu d’or, ce qui rend catastrophique la vente quand vous avez beaucoup de matériel cher. Maintenant, vous pouvez configurer la réserve d’or des marchands.\r\n1.\t500 vanilla\r\n2.\tPlus (+500)\r\n3.\tBeaucoup plus (+1000)\r\n4.\tRiches (+2000)\r\n5.\tCassez la bank ! (+5000)\r\n\r\nVous pouvez changer cette option n’importe quand mais sachez que si vous avez visité un marchand auparavant, il faudra attendre que son stock se régénère pour que ça prenne effet.\r\n\r\n\r\n[color=gold][b]• Services de Forgeage •[/b][/color]\r\n\r\nLes forgerons doivent être plus que des simples vendeurs. Maintenant les forgerons seront aussi des artisans. Cette option vous permet d’avoir des bonnes armes sans pour autant utiliser la compétence forgeage. Il vous faut juste de l’argent.\r\n\r\n1. Renforcement : Les forgerons peuvent maintenant améliorer vos armes si vous ne voulez pas le faire vous-même. Un nouveau dialogue est disponible « pouvez-vous améliorez mon équipement », sélectionner l’arme à améliorer puis la qualité (en fonction du niveau du forgeron). Et pour un prix.\r\n\r\n2. Commande : Un forgeron n’a pas le casque dwemer qu’il vous manque ? Pourquoi ne pas lui demander de vous le fabriquer ? De même, sélectionnez le dialogue « puis-je commander qqchose » et suivez les dialogues. Il faut une bonne journée avant que l’objet soit prêt. Note : vous ne pouvez pas avoir plus de 10 commandes à la fois.\r\n\r\n3. Ces options sont compatibles avec tout mod qui ajoute un forgeron.\r\n\r\n[color=gold][b]• Services d’enchantement •[/b][/color]\r\n\r\nLes mages des cours peuvent maintenant vous offrir des services d’enchantement. Cela permet d’avoir des objets enchantés sans utiliser l’arbre de d’enchantement.\r\n \r\n1. Allez vois votre mage local. Demandez-lui d’enchanter quelque chose, sélectionnez alors la charge d’enchantement, qui bien sûr sera plus chère plus l’enchantement est fort.\r\n2. S’ouvre alors un menu d’enchantement, exactement le même que celui pour enchanter soi-même. Faîtes votre enchantement et le prix sera déduit.\r\n3. CEPENDANT : il faut connaître l’enchantement pour pouvoir le faire. Heureusement, les mages vous proposeront des désenchantements gratuitement et vous pourrez apprendre les pouvoirs.\r\n4. Comme pour la forge, cette option est compatible avec tout mod.\r\n\r\n[color=gold][b]• Location de postes de travail •[/b][/color]\r\n\r\nMaintenant, vous devrez payer 100 pièces d’or pour pouvoir utiliser la forge, le laboratoire d’alchimie ou la table d’enchantement. Vous pourrez les utiliser pendant 24 heures.\r\nCette n’option n’est pour le moment pas compatible avec Dawnguard.\r\nSi elle ne vous plait pas, vous pouvez la désactiver via les options.\r\n\r\n\r\n[size=7][color=gold][center][b][font=mv boli]CONFIGURATION[/font][/b][/center][/color][/size]\r\n\r\nCe mod est totalement configurable ingame grâce à +Economies de Bordeciel+ dans votre inventaire. Cela apparaîtra après les séquences d\\\\\\'intro d’Helgen ou après la création de personnage dans des mods de départs alternatifs.\r\nGrâce à cela, vous pourrez choisir les options que vous voulez, en désactiver etc.\r\n\r\n\r\n[size=7][color=gold][center][b][font=mv boli]INSTALLATION[/font][/b][/center][/color][/size]\r\n\r\n\r\nIl est recommandé de sauvegarder votre partie loin des marchands. Installez SKSE.\r\n\r\nTéléchargez le mod original [url=http://skyrim.nexusmods.com/mods/11919]Ici[/url]: \r\nDécompressez l’archive et placez les fichiers et dossiers suivants dans le répertoire data du jeu.\r\neconomics of skyrim.bsa\r\neconomics of skyrim.bsl\r\neconomics of skyrim.esp\r\n\r\nEnsuite téléchargez le mod traduit décompressez l’archive et placez les fichiers suivants dans le répertoire data du jeu:\r\neconomics of skyrim.esp\r\nCliquez sur remplacer.\r\n\r\nPuis activez economics of skyrim.esp via le Skyrim Launcher.\r\n\r\nPour installez le patch de compatibilité  Dawnguard:\r\n\r\nTéléchargez simplement le fichier sur cette page. Décompressez l’archive et placez le fichier suivants dans le répertoire data du jeu:\r\nEconomics of Skyrim - Dawnguard.esp\r\nCliquez sur remplacer.\r\n\r\nPuis activez Economics of Skyrim - Dawnguard.esp via le Skyrim Launcher.\r\n\r\nVous pouvez utiliser Wrye Bash ou le NMM.\r\n\r\n\r\n[size=7][color=gold][center][b][font=mv boli]DESINSTALLATION[/font][/b][/center][/color][/size]\r\n\r\n\r\nDésactivez d’abord la location de postes de travail, puis quittez les zones avec marchands.\r\nVous pouvez maintenant désinstaller le mod.\r\nPuis attendez deux jours le temps que tout se remette en place.\r\n\r\n\r\n[size=7][color=gold][center][b][font=mv boli]CREDITS[/font][/b][/center][/color][/size]\r\n\r\n\r\n[b][center]Thomas Kaira[/center][/b]",
  "categoryId": "69",
  "version": "1.4.1",
  "author": "Raphou112",
  "createdUnix": "1356271558",
  "updatedUnix": "1359581195",
  "containsAdultContent": false,
  "uploadedBy": "raphou112",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107045",
      "name": "Economics of Skyrim - FR",
      "version": "1.4.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "95",
      "fileName": "Economics of Skyrim - FR-28800-1-4-1.rar",
      "uploadedUnix": "1356274658",
      "modVersion": "1.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/09a7155dd65bd23171054e385566a977490511b62409ddccabd23482f895bedc/analysis/1407318870/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economics%20of%20Skyrim%20-%20FR-28800-1-4-1.rar?fid=107045&ttl=1535802385&ri=8192&rs=8192&setec=3331c5519cfe721d5e8a7e6918a76ba0"
    },
    {
      "fileId": "107046",
      "name": "Economics of Skyrim - Dawnguard -FR",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "13",
      "fileName": "Economics of Skyrim - Dawnguard -FR-28800-1-0.rar",
      "uploadedUnix": "1356274711",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fcc792c39d694d3846aa5a4bda4d4c0bf374cd9fffb813cd42c34278b52c8a95/analysis/1407318871/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economics%20of%20Skyrim%20-%20Dawnguard%20-FR-28800-1-0.rar?fid=107046&ttl=1535802386&ri=8192&rs=8192&setec=0aafb10553ee5ea3ee3df711be9bb4cf"
    },
    {
      "fileId": "109495",
      "name": "Economics of Skyrim - FRv2",
      "version": "1.4.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "95",
      "fileName": "Economics of Skyrim - FRv2-28800-1-4-1.rar",
      "uploadedUnix": "1357310738",
      "modVersion": "1.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/a7f5a03414506b02e295878a543d564225d4d914ca499b6bb8955aa942b986df/analysis/1407336304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economics%20of%20Skyrim%20-%20FRv2-28800-1-4-1.rar?fid=109495&ttl=1535802386&ri=8192&rs=8192&setec=1ca91532b557607160c8d145058deeed"
    },
    {
      "fileId": "1000005979",
      "name": "Economics of Skyrim - FRv3",
      "version": "1.4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "94",
      "fileName": "Economics of Skyrim - FRv3-28800-1-4-1.rar",
      "uploadedUnix": "1359581195",
      "modVersion": "1.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/07f8204fe4cf42b8a997a455891e503b0df80263a861741a5d61ce0def523e7c/analysis/1407387916/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economics%20of%20Skyrim%20-%20FRv3-28800-1-4-1.rar?fid=1000005979&ttl=1535802386&ri=8192&rs=8192&setec=bb37140bae778a6552f3a9c68edc2834"
    }
  ]
}