{
  "modId": 2881.0,
  "modName": "ANB - Dragonbone Weapons",
  "summary": "New set of weapons made from Dragon Bones and a few other misc items. New textures, weapons, smithing recipes and upgrade recipes. See the Long description for more details.",
  "descriptionHtml": "========================================\r\nANB - Dragonbone Weapons\r\n========================================\r\n\r\nMy own take on Dragonbone Weapons. Made for my own personal use and inspired\r\nby AeonVita\\'s version. Adds a whole new set of weapons made from Dragon Bones\r\nand a few other misc items. No arrows included because I think its impractical\r\nto try to make arrows from bones. Arrowheads and nocks maybe... not shafts.\r\nI did retex the quiver and arrows when I made the bow tho...\r\n\r\nMaybe once the CS is out Ill expand on this mod and make it more of a crafting\r\naddition than a weapon mod.\r\n\r\nThe mod includes 9 new weapons each with its own crafting recipe and upgrade\r\nrecipe.\r\n\r\nCrafting requires the Dragon Armor smithing perk.\r\nUpgrading requires Arcane Blacksmith smithing perk.\r\n\r\nEach weapon is slightly (+3 base damage) more powerful than the Daedric version\r\nWeight and Value are based on how many bones or parts of bones I feel itd take\r\nto make each weapon.\r\n\r\nUpgrades take Dragon Scales. 1 for smaller weapons 2 for large ones.\r\nUpgrades are done at a grind stone (kinda obvious but Im sure someone will ask)\r\n\r\nWeapons Included:\r\n\r\nDragonbone Battleaxe\r\nDragonbone Bow\r\nDragonbone Dagger\r\nDragonbone Greatsword\r\nDragonbone Mace\r\nDragonbone Scimitar\r\nDragonbone Sword\r\nDragonbone War Axe\r\nDragonbone Warhammer\r\n\r\nThis mod does NOT replace any vanilla objects. Each weapon has its own meshes\r\nand textures.\r\n\r\nAll the meshes are the default Orcish weapons except for the scimitar.\r\nIts the normal scimitar the redguards carry.\r\n\r\nAll the textures were made by me based on the original orcish textures. They\r\nwere designed to look like blood stained bone. In a future version I might\r\nmake new normals and speculars so it looks less like steel and more like bone.\r\n\r\nOf course the recipes can be seen ingame (if you have the skills required) but\r\njust as a word of warning so as to not destroy your dreams of making them:\r\n\r\nBe SURE you have some Linen Wraps!\r\n\r\nA few (2) of the weapons require linen in addition to leather/strips.\r\nNamely the Dagger and Bow.\r\n\r\nAs for the requirements of the recipes I looked at the items and thought...\r\n\\\"this would require this and this... and a few of these\\\" and thats where the\r\nmaterials came from. For instance... Daggers and Bows take linen cloth because\r\nits makes sense that the handles might be wrapped with something a little less\r\ncoarse than the other weapons. Scimitars require an iron ingot because most of\r\nthe hilt and handle are metal not bone. That sort of thing.\r\n\r\nAs always questions and comments are welcome. If you want to use any part of\r\nthis in your own mod(s) or somethin please ask me first. I cant stop ya but its\r\nthe nice thing to do.\r\n\r\nThanks to AeonVita for answerin a few questions I had about the dirty details\r\nof such a mod bein made without a CS. Hope he doesnt get too mad at me for\r\nmakin a mod like his =D",
  "categoryId": "55",
  "version": "v1.0",
  "author": "Aridale Noblebrook Belmont",
  "createdUnix": "1323226508",
  "updatedUnix": "1323226565",
  "containsAdultContent": false,
  "uploadedBy": "aridale",
  "primaryFile": null,
  "files": [
    {
      "fileId": "7794",
      "name": "ANB - Dragonbone Weapons",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2262",
      "fileName": "ANB - Dragonbone Weapons-2881-1-0.zip",
      "uploadedUnix": "1323226565",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fa73d99c966a7e6965fa67a149e3759d0942e8d83d74e04f41452af8af7e214e/analysis/1406488803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ANB%20-%20Dragonbone%20Weapons-2881-1-0.zip?fid=7794&ttl=1535757467&ri=8192&rs=8192&setec=31363abf2cec9a49143542d69f91e092"
    }
  ]
}