{
  "modId": 28811.0,
  "modName": "Project Skyrim - Skill Module - Smithing",
  "summary": "A mod that gives an overhaul to the smithing perk tree and how gear is crafted.",
  "descriptionHtml": "[center][color=#2E8B57][size=7][b]PROJECT SKYRIM - SKILL MODULE - SMITHING[/b][/size][/color][/center]\r\n\r\n[color=#FFA500][size=4]Table of Contents[/size][/color]\r\n[color=#808080][list][size=3][*]Important Notes\r\n[*]Description\r\n[*]Version Change Log\r\n[*]Upcoming Changes\r\n[*]Known Bug List[/size][/list][/color]\r\n\r\n[color=#FFA500][size=4][b]Important Notes[/b][/size][/color]\r\n[list]\r\n[*]The first official release is live!  Thanks to everyone who helped in identifying bugs to make this as clean of a release as possible.\r\n[*]There will be bugs!  If you find a bug, please message me and describe what the bug is in as much detail as possible so that I can document and fix it.\r\n[*]REQUIRES SKSE TO RUN PROPERLY - You will need the latest version of SKSE to run this mod properly.  You can download SKSE [color=#808080] [url=http://skse.silverlock.org/]here[/url][/color].\r\n[*]REQUIRES DAWNGUARD TO RUN PROPERLY - Attempting to use this mod without Dawnguard installed will cause the client to crash.[/list]\r\n\r\n[color=#FFA500][b][size=4]Description[/size][/b][/color]\r\nProject Skyrim\\'s Smithing Module looks to give the player a more meaningful experience when crafting weapons and armor. The following high level changes have been made in this module:\r\n\r\n[list]\r\n[*]Smithing perks are no longer required to craft weapons and armor; instead a player can learn how to craft gear by purchasing and reading a smithing plan book at the appropriate skill level.\r\n[*]The smithing perk tree is completely redone - instead of being a tree that gives you the ability to craft gear and improve tempering, the tree now focuses on two things: improving your tempering expertise and unique benefits that only impact the gear you craft.\r\n[/list]\r\nThe goal of this mod is to make the smithing tree fun and interesting, giving the player options based on how you wish develop your character. The tree can be roughly categorized into two subset: an armor focus and a weapon focus. Perks in each respective category look to improve the gear you craft in unique ways. For example, the Insulated Armor perk provides your character with a passive resistance bonus to armor you craft depending on its material; the Alloyed Metals perk provides combat bonuses to one handed weaponry you craft.\r\n\r\nThe biggest change this mod provides is the decoupling of crafting from the smithing tree - you no longer need to spend perks in order to create weapons and armor. Plan books can be acquired by finding them througout the world of SKyrim or purchasing them from blacksmiths - the rarest plan books available can only be found.  When read at the appropriate level, these books will allow the player to craft the weapons and/or armor described in the book.\r\n\r\nThese changes help set the smithing tree to be in line with other perk trees in their design: to allow you, the player, to customize your character\\'s experience.  In its initial state, the smithing tree is a stale requirement for basic crafting.\r\n\r\n[color=#FFA500][size=4][b]Version Change Log[/b][/size][/color]\r\n[color=#808080][size=3][b]Release 1.0.01[/b][/size][/color]\r\n[list]\r\n[*]Changed the Smithing perk tree structure so perks with similar level requirements were consistent with one another, making the tree look cleaner.[/list]\r\n\r\n[color=#808080][size=3][b]Release 1.0.00[/b][/size][/color]\r\n[list]\r\n[*]Perk Respecialization has been added to the game to assist with the transition from the vanilla perk tree.  When a character is loaded for the first time after the mod is activated, any perk points they spent in the vanilla tree are reimbursed to be used in the new perk tree.\r\n[*]All plan books are now found in lore friendly locations as opposed to being sold by every blacksmith.  Books for basic armor can still be found at just about any blacksmith, but the more exotic the armor is the harder it will be to find a plan book for it.  Please see the readme file packaged in with this release for more information on plan book location.\r\n[*]Fixed a bug where players who invested into the vanilla smithing perk tree were experiencing inflated tempering values for weapons and armor.[/list]\r\n\r\n[color=#808080][size=3][b]Beta.1.0.4[/b][/size][/color]\r\n[list]\r\n[*]All plan books are now accessible by all blacksmiths.  This is in to assist with playtesting and work any kinks out of the plan book implementation itself; plan books will ultimately be found in more lore friendly locations, and not all plan books will be able to be purchased.\r\n[*]New Plan Book: Imperial Arms and Armor\r\n[*]New Plan Book: Stormcloak Armor\r\n[*]New Plan Book: Companions Armor\r\n[*]New Plan Book: Thieves Guild Armor\r\n[*]New Plan Book: Blades Arms and Armor\r\n[*]New Plan Book: Dark Brotherhood Armor\r\n[*]New Plan Book: Nightingale Arms and Armor\r\n[*]Several scripts have been renamed to follow a more consistent naming convention that doesn\\'t clash with the character limit.  As a result, please uninstall version 1.0.3 and perform a clean install on 1.0.4 to ensure all renamed scripts are removed.  While this isn\\'t necessary it will ensure that you have a clean script folder.[/list]\r\n\r\n[color=#808080][size=3][b]Beta.1.0.3[/b][/size][/color]\r\n[list]\r\n[*]The Legendary Blacksmith perk has been removed.\r\n[*]New Perk: Eldritch Knowledge - replaces Legendary Blacksmith.  You learn how to unlock the true potential of daedric and dragonbone material in your weaponry.  Daedric weaponry will paralyze and deal additional shock damage; dragonbone weaponry will deal additional frostfire damage.\r\n[*]New Perk: Arcane Infusion - You\\'ve learned how to infuse raw magic into your craft.  Glass, ebony, daedric and dragonbone armor you craft have a 5% chance to absorb hostile spells, capping at 20%.\r\n[*]Updated Perk: Craftsmanship - The perk now gives 2.5% crit reduction per piece of crafted armor worn, capped at 10%.  In addition, the perk grants 5% improved critical strike chance when wielding a crafted weapon.\r\n[*]New Plan Book: Silver Weapon Smithing - this plan book allows the player to craft silver swords and greatswords.  These recipes can be found in the MISC section of the forge.\r\n[*]Silver weapons can now be tempered; the tempering requires a silver ingot.\r\n[*]The benefits of the Craftsmanship perk now appear in the player\\'s spell effects section of their UI.\r\n[*]Several perk spell effect icons have been updated.[/list]\r\n\r\n[color=#808080][size=3][b]Beta.1.0.2[/b][/size][/color]\r\n[list]\r\n[*]Updated all crafted arrow recipes to use crafted arrows instead of baseline arrows.  This will now allow the Serrated Arrowheads perk to work properly.\r\n[*]Updated the tutorial blacksmithing quest to look for the correct items when advancing the quest and to provide the player with the requisite plan books necessary for crafting the tutorial items.\r\n[*]Removed the Steel Shin Boots and Imperial Steel Gauntlets items from the list of armor you can create from the Steel Smithing.  They will be reintroduced in the Imperial Smithing plan book.[/list]\r\n\r\n[color=#808080][size=3][b]Beta.1.0.1[/b][/size][/color]\r\n[list]\r\n[*]Updated esp file mod name to conform with future naming conventions to be used with additional modules. NOTE: If you downloaded beta 1.0, please uninstall the mod prior to installing 1.0.1 to ensure the old .esp file is removed. If you installed this mod manually, simply delete the SPP_Smithing.esp file from your Skyrim Data folder.\r\n[*]Updated all crafted items to contain Crafted in their name so as to differentiate themselves from their non-crafted counterparts.\r\n[*]Fixed a small display bug with the Craftsmanship tool tip to show the values associated with the perk.\r\n[*]Updated the plan books to include the skill required to use the book in the book\\'s text.\r\n[/list]\r\n\r\n[color=#FFA500][b][size=4]Upcoming Changes[/size][/b][/color]\r\nIn no particular order, below are potential features that will be implemented in this mod:\r\n\r\n[color=#808080][size=3][b]Perks[/b][/size][/color]\r\n[list]\r\n[*]There will be a high level perk that will allow you to reforge daedric artifacts and other powerful, unique items to have them inherit your smithing bonuses.[/list]\r\n\r\n[color=#808080][size=3][b]Plan Books[/b][/size][/color]\r\n[list]\r\n[*]Dawnguard content will be assimilated into the mod\\'s plan book and perk system.[/list]\r\n\r\n[color=#808080][size=3][b]Weapons and Armor Mod Compatibility[/b][/size][/color]\r\n[list]\r\n[*]Will incorporate plan books for popular mods that add additional weapon and armor options into the game (example: [url=http://skyrim.nexusmods.com/mods/19733]Immersive Armor[/url])\r\n[/list]\r\n\r\n[color=#FFA500][b][size=4]Known Bug List[/size][/b][/color]\r\nBelow are a current list of known bugs that are being investigated:\r\n\r\n[list]\r\n[*]When loading a save, crafted weapons and armor will retain vanilla baseline values until you go into your inventory and equip a new item or remove an equipped piece of gear; equipped crafted gear will then correctly leverage properties of their base equivalent. This bug has no impact on your game if you are not utilizing mods that overhaul baseline weapon and armor values.\r\n[/list]",
  "categoryId": "73",
  "version": "1.0.01",
  "author": "Koppartikus",
  "createdUnix": "1356293784",
  "updatedUnix": "1364183954",
  "containsAdultContent": false,
  "uploadedBy": "SabinXL",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107122",
      "name": "PS_SkillModule_Smithing_Beta101",
      "version": "Beta.1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "105",
      "fileName": "PS_SkillModule_Smithing_Beta101-28811-Beta-1-0-1.rar",
      "uploadedUnix": "1356299515",
      "modVersion": "Beta.1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/416523baec20c1e10f166ab123ee0673aa5306a730db6b74e3cd1cadf8e3a6d3/analysis/1407319509/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PS_SkillModule_Smithing_Beta101-28811-Beta-1-0-1.rar?fid=107122&ttl=1535802406&ri=8192&rs=8192&setec=14a940899f7a37eb49e1e8b14edf5006"
    },
    {
      "fileId": "107894",
      "name": "PS_SkillModule_Smithing_Beta102",
      "version": "Beta.1.0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "110",
      "fileName": "PS_SkillModule_Smithing_Beta102-28811-Beta-1-0-2.rar",
      "uploadedUnix": "1356631698",
      "modVersion": "Beta.1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/5b1a16c6fd6a949377af4797f56410585277a92c9376f0bb07c805e276dcbc46/analysis/1407324679/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PS_SkillModule_Smithing_Beta102-28811-Beta-1-0-2.rar?fid=107894&ttl=1535802406&ri=8192&rs=8192&setec=54ca7002b84c3907ec343ff96743f79b"
    },
    {
      "fileId": "108085",
      "name": "PS_SkillModule_Smithing_Beta103",
      "version": "Beta.1.0.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "120",
      "fileName": "PS_SkillModule_Smithing_Beta103-28811-Beta-1-0-3.rar",
      "uploadedUnix": "1356711125",
      "modVersion": "Beta.1.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/7d86d374d625e1e45114155cff154cd834ed34c6105ef18af47f697115d7f2a4/analysis/1407326043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PS_SkillModule_Smithing_Beta103-28811-Beta-1-0-3.rar?fid=108085&ttl=1535802407&ri=8192&rs=8192&setec=a713235c3c144ac1602223f620c4074a"
    },
    {
      "fileId": "1000001054",
      "name": "PS_SkillModule_Smithing_Beta104",
      "version": "Beta.1.0.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "157",
      "fileName": "PS_SkillModule_Smithing_Beta104-28811-Beta-1-0-4.rar",
      "uploadedUnix": "1357688310",
      "modVersion": "Beta.1.0.4",
      "virusScanUrl": "https://www.virustotal.com/file/8c556536a0e7ab2647b84b7e6436f07f2699919188a2aacaf5cd726bfe2efbf4/analysis/1407344413/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PS_SkillModule_Smithing_Beta104-28811-Beta-1-0-4.rar?fid=1000001054&ttl=1535802407&ri=8192&rs=8192&setec=9f6fb3f2531fa22b4c9257b16a6f5493"
    },
    {
      "fileId": "1000019976",
      "name": "PS_SkillModule_Smithing_Release1000",
      "version": "1.0.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "171",
      "fileName": "PS_SkillModule_Smithing_Release1000-28811-1-0-00.rar",
      "uploadedUnix": "1364142675",
      "modVersion": "1.0.00",
      "virusScanUrl": "https://www.virustotal.com/file/bc593178c41e1336ff62f2092e8efa29d032711580bad0da55b63bee80ce3c3b/analysis/1407486362/",
      "changelogHtml": " Perk Respecialization has been added to the game.  When a character is loaded for the first time after the mod is activated, any perk points they spent in the vanilla tree are reimbursed to be used in the new perk tree. <br/> \n Plan books are now found in lore friendly locations.  For specific details, please see the ReadMe packaged with the release. <br/> \n Fixed a bug where players who invested into the vanilla smithing perk tree were experiencing inflated tempering values for weapons and armor. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PS_SkillModule_Smithing_Release1000-28811-1-0-00.rar?fid=1000019976&ttl=1535802408&ri=8192&rs=8192&setec=cc01afaf4e30a46841097a3877d11355"
    },
    {
      "fileId": "1000020084",
      "name": "PS_SkillModule_Smithing_Release1001",
      "version": "1.0.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "171",
      "fileName": "PS_SkillModule_Smithing_Release1001-28811-1-0-01.rar",
      "uploadedUnix": "1364183954",
      "modVersion": "1.0.01",
      "virusScanUrl": "https://www.virustotal.com/file/4f065b3bf2c83e7b71bf4c529f1929b8f00b7c1f90e8eee4369d342f33cab387/analysis/1407487395/",
      "changelogHtml": " Changed the Smithing perk tree structure so perks with similar level requirements were consistent with one another, making the tree look cleaner. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PS_SkillModule_Smithing_Release1001-28811-1-0-01.rar?fid=1000020084&ttl=1535802408&ri=8192&rs=8192&setec=11bd09c5025325271c313eae8100c763"
    }
  ]
}