{
  "modId": 28816.0,
  "modName": "Aghemmor-Nakh - Dwemer Architecture in Aetherius",
  "summary": "This is something of a personal challenge and a proof-of-concept, all because of one mod - an incredibly simple yet perfectly executed idea that hit me like a brick - &#39;Why hadn&#39;t I thought of that?&#39;: [url=http://skyrim.nexusmods.com/mods/25002] The Mayan Pyramid - by 514Y32, and a tiny comment made by ZSTestament - &#34;Angkor Wat would",
  "descriptionHtml": "[size=+3][color=#5ea2e5][b][u]This version has been discontinued[/u][/b][/color][/size]\r<br />\r<br />[size=+1][color=#5ea2e5][b]Please go [url=http://www.nexusmods.com/skyrim/mods/49432]HERE[/url] for the updated version[/b][/color][/size]\r<br />\r<br />[IMG]http://i.imgur.com/9e7vF.png[/IMG]\r<br />\r<br />[size=+1][color=#5ea2e5][b]Aghemmor-Nakh - Architecture in Aetherius[/b][/color][/size]\r<br />\r<br />[color=#5ea2e5][b]Please Endorse if you like this mod&#33;[/b][/color]\r<br />\r<br />[b][Lore Premise][/b]\r<br />\r<br />When Kagrenac used his tools on Lorkan&#39;s heart, the Dwemer were indeed transferred from the mortal plane of Mundus to the higher plane of Aetherius, shedding their corporeal form for one of pure energy. In Aetherius, the unbounded possibilities of the plane with it&#39;s flow of pure magic energy and the ability to create therein anything that combined minds can conceive of give rise to fantastical creations from the essence of the Aether. Hence, this megastructure was born out of the energies by the joined minds of some of their greatest [Tonal] Architects.\r<br />\r<br />The temple itself is dedicated to a long forgotten battle called [b]&#34;The Battle Of The TwentyFour&#34;[/b], between the Dwemer and some unknown force(s). On the South Wall is to be found a memorial to those Brave Few fought and surmounted against all odds a force much greater than theirs. On the other walls are: East - the Support Forces ready at the Dawn of the Battle, North - Those Who Gave Succour to the damaged automatons, and West - the Forces at rest, ready to fight another day. At the end of each wall are tablets recording important events that led up to the battle.  Empty coffins that represent the Brave TwentyFour are located within the temple itself. The main Snow Elf (Falmer) idol seems to be in acknowledgement of their assistance in the Battle, almost as if the Dwemeri felt regret, if it was possible.\r<br />\r<br />Aurora flow constantly overhead. The air is filled with the fog of Dreaming. The fog gives way as structure fades into view on approaching far walls. Silent Dwemer perform an eternal circumambulation of the temple. Monks meditate upon Higher Energies. Fountains come to life as you approach them. Behind the idol in the main sanctum is a teleportation stone to a view from the top of the central spire.\r<br />\r<br />Within the walls of each of the four Cardinal Directions is a Hall dedicated to each of the Four Elements: South is the Entrance Hall, where in lies the Temple of the Blue Flame, East is the Gardens and Preserve, North is the Aquatorium, with it&#39;s many water displays, and West is the Oratory Hall, where the Dwemer meet to discuss things Dwemeri.\r<br />\r<br />To travel there, I have made available &#39;Deep Folk Crossing&#39;, at the top of the hill is a teleportation stone to be found. It does not interfere with Dawnguard.\r<br />\r<br />[IMG]http://i.imgur.com/dRinh.jpg[/IMG]\r<br />\r<br />[b][Installation Notes][/b]\r<br />\r<br />This mod is dependant only on Skyrim itself, and does not require any DLC to be installed.\r<br />\r<br />For proper display of the Complex, without which there are issues on my system with LOD, I have found it necessary to add to Skyrim.ini at the beginning under [General] the following:\r<br />\r<br />[color=#5ea2e5][b]uExterior Cell Buffer=64\r<br />uGridsToLoad=7[/b][/color]\r<br />\r<br />Caution: In case you haven&#39;t already done a similar modification, this addition enhances the overall appearance of Skyrim itself as it increases the amount of distant items drawn on screen, however at the cost of a few FPS. This modification will become embedded in any saves, so if you find that it makes your installation unstable, you will have to revert to a save file made before the addition of the lines. Easy-breezy, if you have that earlier save.\r<br />\r<br />Update 12/30: Check out the guide that Caassapaba made at: [url=http://skyrim.nexusmods.com/mods/29119]My Guide to uGridsToLoad[/url] to help answer any questions about uGridsToLoad...\r<br />\r<br />EDIT: I don&#39;t intend to frighten anyone about the graphics tweak... It is that without it, when standing in one corner, the next corner does not draw. I just can&#39;t imagine why, but the [i]fantastic[/i] (hmmph...) LOD generator will generate object LOD files for the structure, but the game just laughed when I tried to load them... I will persevere to get the LOD somehow...\r<br />\r<br />As to the Skyrim display options: I use AA & AF @ 2X, Fades @ 11, Light Fade @ 28, Grass Fade N/A, Object Detail Fade unchecked. The screenshots were taken using a FOV of 90°, giving a distortion at the edges of the captures. This was necessary to capture as much as possible only for the screenshots.\r<br />\r<br />I have made every effort to ensure that all necessary files are included in the archive, and it has passed the test on my system with the .bsa. PLEASE inform me of any missing items&#33;\r<br />\r<br />Just install to your Skyrim directory and activate the mod in your launcher. There should be absolutely no conflicts, as everything was &#39;made to order&#39; and nothing was copied. Please advise me if you encounter conflicts.\r<br />\r<br />[IMG]http://i.imgur.com/74f0oOX.jpg[/IMG]\r<br />\r<br />[b][Mod Notes][/b]\r<br />\r<br />This is the second installation to what I plan on to ba a large undertaking. I have scoured the Nexus, and I could not find any other &#39;megastructures&#39;, so I think that this is the first of its kind...\r<br />\r<br />The temple is 5 X 5 outdoor quads - Solitude would fit comfortably within the walls. I have yet to navmesh the entire complex, as for now I feel it is appropriate to spend time alone reflecting on one&#39;s adventures.\r<br />\r<br />This is something of a personal challenge and a proof-of-concept, all because of one mod - an incredibly simple yet perfectly executed idea that hit me like a brick - &#39;Why hadn&#39;t I thought of that?&#39;: [url=http://skyrim.nexusmods.com/mods/25002] The Mayan Pyramid - by 514Y32[/url], and a tiny comment made by ZSTestament - [b]&#34;Angkor Wat would be an awesome addition.&#34;[/b] That was all that it took, and now after spending 12 weeks of my spare time on nothing other than this - two weeks of desperately trying to figure out how the original structure that it is modelled after is layed out (There used to be an online &#39;virtual tour&#39; from a company that one could stream down from the web in a browser that coincidentally used the Gamebryo engine), eight in its creation, this is what I have created. The center of the temple is just a guess at what is in the real temple, as I found 0 photographs and no description of what the center of Angkor held...\r<br />\r<br />I am relatively sure that a beefier system is required to use this new worldspace. On my system (i7, nVidia 460GTX w/ 768 Mb VRAM, 8 Gig RAM), I get *nearly* the same framerate that I do while in Skyrim itself. HOWEVER, as you will find if you decide to try my &#39;little&#39; mod, that as one gazes at the main structure itself, &#39;Time itself seems to slow down&#39; - read: major framerate hit. I do not know if I have been pushing the limit of my video card, or if I have found the upper limit of the Gamebryo engine itself, as there are over 4,500 pieces to this structure. I would greatly appreciate feedback from anyone willing to give it...\r<br />\r<br />This can compliment my other mod:\r<br />\r<br />[size=+1][url=http://skyrim.nexusmods.com/mods/24451]Uguz[/url][/size]\r<br />\r<br />[b][ToDo][/b]\r<br />\r<br />I plan on continuing this if for no other reason than my own personal satisfaction. My knowledge of the Creation Kit has been expanded exponentially during the creation of this worldspace.\r<br />\r<br />[list]\r<br />[*] One more static automaton needs to be mirrored. (I just couldn&#39;t cope with getting this together for release and yet another foray into .nif files...)\r<br />[*] More Dwemer Dravidian style structures to the world. (See attached photos) \r<br />[*] Fine-tune the some 975 roof pieces to eliminate texture blinking. \r<br />[*] Navmesh the world and it&#39;s objects for followers?\r<br />[*] Refine Lore and Naming.\r<br />[*] Optimize everything possible.\r<br />[*] Create quests for worldspace(s).\r<br />[*] Create a Living City.\r<br />[*] Finish the accompanying music tracks I am creating for this world.\r<br />[*] Create an Institution of Knowledge relating to things Dwemer.\r<br />[*] Create unique spells tought by Dwemer Master Gurus.\r<br />[*] Craft a proper AI routine for the Dwemeri.\r<br />[/list]\r<br />\r<br />[b][Known Issues][/b]\r<br />\r<br />[list]\r<br />[*] Spots of blinking textures. \r<br />[*] I have discovered that on my system, using a &#39;High&#39; shadow setting caused very weird flashing shadows when viewed at a certain angle..?\r<br />[*] Framerate issues (Again, unsure if from the memory needed for the mod, or from the game engine nor being built to handle 4500+ models in such a fashion.)\r<br />[/list]\r<br />\r<br />[size=+1][color=#5ea2e5][b]Happy Travelling&#33;[/b][/color][/size]",
  "categoryId": "30",
  "version": "0.6",
  "author": "minimonster",
  "createdUnix": "1356298114",
  "updatedUnix": "1359926211",
  "containsAdultContent": false,
  "uploadedBy": "minimonster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000006866",
      "name": "Aghemmor-Nakh - Architecture in Aetherius",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "44703",
      "fileName": "Aghemmor-Nakh - Architecture in Aetherius-28816-0-6.zip",
      "uploadedUnix": "1359926211",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/f3be1c4c566ba163a0931c5d34b74c6c5fdf5c3d825579c325fa3aa0ad15bec1/analysis/1407395496/",
      "changelogHtml": " Added four chambers: Entrance Hall, Oratory, Auqatorium, Gardens <br/> \n Populated chambers (except for Entrance Hall) with Dwemer <br/> \n Added more navmesh to Temple <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aghemmor-Nakh%20-%20Architecture%20in%20Aetherius-28816-0-6.zip?fid=1000006866&ttl=1535802415&ri=8192&rs=8192&setec=a06347f7a610caee08191859d37221e8"
    }
  ]
}