{
  "modId": 28810.0,
  "modName": "Unterschlupf der Grauen Adler",
  "summary": "Hausmod mit Schmiede, Gerbgestell, arkanem Verzauberer, Alchemietisch, Altar, Bibliothek, Ausstellungsräumen und Trophäenräumen.",
  "descriptionHtml": "Unterschlupf der \\\"Grauen Adler\\\"\r\n\r\n\r\n\r\n****************************************\r\nHinweise zum Update am Ende beachten !!!\r\n****************************************\r\n\r\n\r\n\r\nVersion:\r\nv1.20\r\n\r\n\r\n\r\nVoraussetzungen:\r\n- Skyrim mit Dawnguard v1.8.151.0.7\r\n\r\n\r\n\r\nStandort:\r\nDas Anwesen befindet sich östlich der Valtheimer Türme und ist über Schnellreise erreichbar.\r\n\r\n\r\n\r\nInfos:\r\nDie komplette Anlage ist im Stil der Dwemer gehalten, was zur Folge hat, dass man im Haus einige technische Annehmlichkeiten finden kann. Über eine seltsame Maschine an der Haustür kann man die Schlüssel für das Anwesen erwerben.\r\n\r\nDer Unterschlupf ist in drei Bereiche unterteilt:\r\n\r\nBereich 1, Erdgeschoß (3000 Gold):\r\nIn der Wohnung gibt es eine große Kochstelle mit Lagerbereich für Lebensmittel und angrenzendem Essbereich. Des weiteren sind eine Schlafecke und einige Truhen zum Unterbringen von Ausrüstung, Waffen, etc. vorhanden.\r\n\r\nBereich 2, Keller (3000 Gold):\r\n- Lagerbereich für Ausrüstung, komplett ausgestattete Schmiede und Gerbgestell\r\n- Arkaner Verzauberer, Alchemielabor und Altar\r\n- Schlafraum mit Bibliothek und Badezimmer (über die Karte hier kann man über Schnellreise in die Hauptstädte gelangen)\r\n- Ausstellungsraum für Daedra-Artefakte und Drachenmasken, -klauen und -waffen (einschliesslich 4 Mannequins)\r\n\r\nBereich 3, Keller (3000 Gold):\r\n- Zugang zur Ruine (ehemalige Wohnanlage und Gruft)\r\n- Vier Ausstellungsräume mit je 24 Mannequins, 84 Waffenhaltern, 24 Schildhaltern und 8 Schaukästen\r\n- Trophäenräume (war für die erweiterte Version der \\\"Villa Talblick\\\" in Oblivion schon geplant und wurde jetzt endlich umgesetzt, auch wenns in Hearthfire in ähnlicher Form schon existiert)\r\n\r\nEtwas östlich vom Anwesen hat sich eine Händlerin niedergelassen, die Pfeile verkauft und Hehlerware ankauft.\r\n\r\n\r\n\r\nAnmerkungen:\r\n- Alle Kisten/Truhen mit gleichem Namen sind mit einer Masterkiste verlinkt und man kann von den verschiedenen Etagen auf den Inhalt zugreifen. Bei den Kisten wird \\\"leer\\\" angezeigt, da der Inhalt erst \\\"erstellt\\\" wird, wenn man die Kiste öffnet. Auf eine automatische Einsortierfunktion habe ich bewusst verzichtet.\r\n- Die Ausstellungsräume sind absichtlich so hell gehalten, damit man die Rüstungen und Waffen besser erkennt (auch wenn darunter die (Licht-/Spiel-)Atmosphäre etwas leidet).\r\n- Die Ausstellungsstücke für die Daedra-Artefakte und Drachen-\\\"Artefakte\\\" sind Statics und werden eingeblendet, wenn man eins davon im Inventar hat. Grund ist folgender: manche Dinge muss man ja im Laufe einer Quest wieder abgeben und so besteht die Möglichkeit die Dinge trotzdem gesammelt darzustellen. Bei den Drachenwaffen funktioniert das nur für die unverzauberten Teile. Die vier Mannequins in dem Raum sind für die beiden Drachenrüstungen, Ebenerzharnisch und \\\"Haut des Erretters\\\" gedacht, können aber natürlich auch für andere Rüstungen verwendet werden.\r\n- Meine ganze \\\"Geschichte\\\" ist jetzt in den Büchern niedergeschrieben.\r\n- Die Bücherregale und die Buchständer sind mit dem Skript aus \\\"Unlimited Bookshelves\\\" versehen und funktionieren bei mir ohne Probleme.\r\n- Die Mannequins sind mit dem Skript aus dem \\\"Vanilla Mannequin Fix v2.0\\\" versehen und haben noch ein paar Sonderfunktionen. Gelegentlich zeigen sie aber immer noch ein leicht seltsames Verhalten (Skyrim ist halt in mancher Hinsicht seltsam), das sich mit \\\"manuellen Umstellen der Posen\\\" aber wieder geraderücken lässt.\r\n- Die Verteidigungsplattform hat auch dekorativen Charakter. \r\n- Die Beleuchtung am Haus und Stall sind zeitabhängig.\r\n\r\n\r\n\r\nBekannte Bugs/Schönheitsfehler:\r\n- Die Schildständer in den Ausstellungsräumen funktionieren bei mir nur sporadisch. Entweder garnicht oder nur einmal. Ich habe schon verschiedene Lösungsansätze ausprobiert (Rotieren, neu erstellen, kopieren, ...), was aber immer zu dem gleichen (nicht befriedigenden) Ergebnis führt (siehe Anmerkung zu den Mannequins) ... damit kann ich aber leben. Dafür funktionieren die Waffenständer und Schaukästen problemlos.\r\n- Beim Teleporten von der Plattform vor die Haustür bleibt mein Begleiter manchmal zur Hälfte im Boden stecken, obwohl das Navmesh da eigentlich ok ist und der Marker auch oberhalb der Erde ist.\r\n- Obwohl das Skript meiner Meinung nach korrekt ist, bewegt sich das Unterteil der Armbrusthalterung auf der Plattform beim Drehen nicht mit.\r\n- Die verschlossenen Kisten im Erdgeschoss funktionieren nicht mit der Verlinkung.\r\n\r\n\r\n\r\nKuriositäten:\r\n- Einmal lag auf der Plattform ein toter Priester und eine tote Kuh :P\r\n    \r\n\t\r\n\r\nBekannte Inkompatibilitäten:\r\n- Keine bekannt.\r\n- Evtl. Probleme mit Mods, die die Zellen 19,-1 und 20,-1 ebenfalls verändern.\r\n\r\n\r\n\r\nInstallation (manuell):\r\n- Alle Dateien in den Skyrim-Data-Ordner kopieren.\r\n- Die ESP-Datei im Skyrim-Launcher aktivieren.\r\n\r\n\r\n\r\nDeinstallation (manuell):\r\n- Die ESP-Datei im Skyrim-Launcher deaktivieren.\r\n- [mde]_Unterschlupf_der_Grauen_Adler.esp, den Unterordner mde im Meshes- und Textures-Ordner entfernen. Im Scripts- und Scripts/Source-Ordner alle Skripte entfernen, die mit mdeGH_ beginnen.\r\n\r\n\r\nUpdate von älteren Versionen: WICHTIG !!!\r\n- Um evtl. Gegenstandsverluste zu vermeiden, sollte man folgendermassen vorgehen:\r\n  - ALLE Kisten leerräumen\r\n  - alle Rüstungspuppen leeren\r\n  - Haus verlassen\r\n  - Spielstand speichern\r\n  - die ESP deaktivieren\r\n  - Spiel starten und speichern\r\n  - die alte ESP mit der neuen überschreiben\r\n  - Spiel starten (mit player.additem 2900a28d 1 erhält man den Wohnungsschlüssel wieder, 2900a28e für den Keller und 29001f61 für den Wandschrank)\r\n- Wagemutige können einfach die alte ESP überschreiben - für evtl. Verluste bin ich dann aber nicht verantwortlich\r\n\r\n\r\n\r\nChangelog:\r\n- v1.20 (05.01.2013)\r\n  - Exterior-Navmesh überarbeitet\r\n- v1.10 (26.12.2012)\r\n  - zusätzliche Kollisions\\\"wände\\\" im Keller, da einige Apparate durch die Wand zu bedienen waren\r\n  - Händler gefixt (lag zum Teil im Wasser, da aus Testzwecken noch ein \\\"Lay-Marker\\\" im Wasser vorhanden war)\r\n  - Lagerkisten neu verlinkt, 4 Kisten im Erdgeschoss sind z.Zt. verschlossen, da die Verlinkung bei diesen seltsamerweise nicht funktioniert)\r\n- v1.00 (23.12.2012) - Start\r\n\r\n\r\n\r\nHinweise:\r\n- Modifikationen können grundsätzlich zu Abstürzen, Datenverlusten, Inkompatibilitäten, ... führen. Aus diesem Grund übernehme ich für solche Fälle keine Haftung.\r\n\r\nDanksagungen:\r\n- Bethesda für ein tolles Spiel\r\n- nhskill aus dem scharesoft-Forum: Beta-Test\r\n- Blary: Resourcen (\\\"Booksets Resource\\\", \\\"Food Container Resource\\\", \\\"Open Books Resource\\\" und \\\"Potion Shelf Resource\\\")\r\n- Oaristys, Tony67: Resourcen (\\\"Modder\\'s Resource Pack\\\")\r\n- Tony67: Resourcen (\\\"Leather Rack\\\" und \\\"DisplayCase Noble\\\")\r\n- da5id2701: Skript (\\\"Unlimited Bookshelves\\\")\r\n- Daemonjax & SLuckyD: Skript (\\\"Vanilla Mannequin Script Fix (Alternative Version) v2.0\\\")",
  "categoryId": "67",
  "version": "v1.20",
  "author": "mde",
  "createdUnix": "1356292680",
  "updatedUnix": "1357387934",
  "containsAdultContent": false,
  "uploadedBy": "mde0815",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000107",
      "name": "mde-Unterschlupf-der-Grauen-Adler-v120",
      "version": "v1.20",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6984",
      "fileName": "mde-Unterschlupf-der-Grauen-Adler-v120-28810-v1-20.7z",
      "uploadedUnix": "1357387934",
      "modVersion": "v1.20",
      "virusScanUrl": "https://www.virustotal.com/file/d19c9de27791a18a1def8d6bbb72036dc591feff3658758b158f4f442e077265/analysis/1407338110/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mde-Unterschlupf-der-Grauen-Adler-v120-28810-v1-20.7z?fid=1000000107&ttl=1535802404&ri=8192&rs=8192&setec=dbbe046e1d13fb6465a76418f4f6fe05"
    }
  ]
}