{
  "modId": 28812.0,
  "modName": "The Undercity - by Borjoyzee - La Fossoyeuse",
  "summary": "Ceci est la traduction française du mod : [url=http://skyrim.nexusmods.com/mods/15659]The Undercity[/url] par Borjoyzee.\r<br />\r<br />This is the French translation of the mod : [url=http://skyrim.nexusmods.com/mods/15659]The Undercity[/url] by Borjoyzee.",
  "descriptionHtml": "Ceci est la traduction française du mod : [url=http://skyrim.nexusmods.com/mods/15659]The Undercity[/url] par Borjoyzee.\r<br />\r<br />This is the French translation of the mod : [url=http://skyrim.nexusmods.com/mods/15659]The Undercity[/url] par Borjoyzee.\r<br />\r<br />Si son travail vous plait, allez lui donner un petit &#34;Endorsement&#34; pour l&#39;encourager à continuer.\r<br />\r<br />\r<br />                 [size=200][color=#FFFF00]~ Description ~[/color][/size]\r<br />\r<br />\r<br />Bienvenue à la Fossoyeuse, une nouvelle ville , entièrement située sous terre. À force de voyager de ville en ville à la recherche des choses dont Borjoyzee avait besoin, sa lassitude grandi. L&#39;objectif principal de ce mod est les marchands qui ont plus de fournitures que ceux de vos villes habituelles. Il y a bien sûr plus à dire, mais l&#39;auteur donnera les détails ultérieurement (le mod n&#39;est pas encore terminé). Il y a aussi des PNJ qui circulent, pour l&#39;instant, ces personnes ne sont là que pour étoffer la ville et lui donner un petit côté vivant, Borjoyzee a l&#39;intention de leur donner des quêtes simples dans des versions ultérieures. Dans l&#39;ensemble, il y a environ 32 nouvelles cellules et encore plus de PNJ. L&#39;entrée de la ville est située à l&#39;ouest de Blancherive, vous serez en mesure de voir le marqueur de carte, mais pas en mesure de voyager rapidement à elle, elle est située sur une petite montagne (Voir les screenshots pour l&#39;emplacement).\r<br />\r<br />Vous pourrez acheter une maison. Elle coûte un peu cher (40000 pièces d&#39;or), mais compte tenu des fonctionnalités dont elle dispose, elle vaut le coup. Et soyons honnêtes, l&#39;argent n&#39;est pas difficile à obtenir. \r<br />\r<br />-Il y a des trieurs automatiques pour la plupart des objets , excepté les armes et armures.\r<br />\r<br />-Une bibliothèque complète (10 bibliothèques). Toutes les commodités d&#39;artisanat. Une modeste salle d&#39;exposition.\r<br />\r<br />-Deux chambres, un pour vous et l&#39;autre pour quelqu&#39;un d&#39;autre.\r<br />\r<br />-Un livre de sorts qui vous enseigne un sort qui peut vous téléporter à la maison et un moyen de revenir à l&#39;endroit où vous avez lancé le sort pour la dernière fois et quelques petites surprises.\r<br />\r<br />-Pour acheter la maison, il y a un drapeau bleu près de l&#39;entrée. Cliquez dessus et si vous avez assez de pièces d&#39;or, vous aurez une option d&#39;achat. Vous obtenez la clé immédiatement  et le drapeau disparaît.\r<br />\r<br />-Oh, et pour que les conjoints puissent y vivre, eh bien, le mod &#34;Spouses Can Live Everywhere&#34; devrait vous être utile.\r<br />\r<br />\r<br />                  [size=200][color=#FFFF00]Les marchands[/color][/size]\r<br />\r<br /> Il y a des commerçants pour à peu près tout et tous travaillent à huit heures le matin jusqu&#39;à six heures du soir : \r<br />\r<br />-[color=#FFFF00]La librairie de Garr[/color]\r<br />Vend une vaste gamme de livres. (L&#39;auteur n&#39;a jamais pu trouver les ensembles complets du genre de la danse du feu.)\r<br />\r<br />-[color=#FFFF00]Forgeron[/color]\r<br />Ne vend que des minerais, des lingots et des peaux d&#39;animaux, toutes les choses pour l&#39;artisanat.\r<br />\r<br />-[color=#FFFF00]Hailey l&#39;apothicaire[/color]\r<br />Propose des potions et des ingrédients. Vend également des potions pour augmenter vos attributs (Santé, Magie, Vigueur et de poids) de 10. Elles sont coûteuses et elle n&#39;en vend pas beaucoup. Vous y trouverais aussi un combineur de potions.\r<br />\r<br />-[color=#FFFF00]Une Coupe au-dessus[/color]\r<br />La boutique vend des vêtements, tous les vêtements du jeu même. En outre, elle a en stocke certains vêtements non-jouables qui le sont devenus grâce aux nouvelles ID. Ils n&#39;entreront pas en conflit avec quoi que ce soit\r<br />\r<br />-[color=#FFFF00]Outils de guerre[/color]\r<br />Marchand d&#39;armes et d&#39;armures en tous genre. Vend des versions non enchantées d&#39;armes et d&#39;articles daedra et d&#39;autres choses qui ne sont généralement pas jouables.\r<br />\r<br />-[color=#FFFF00]Brasserie Fayre[/color]\r<br />Une taverne, qui vend toutes les boissons, la serveuse vend de la nourriture. Certains PNJ y vont à certains moments de la journée. Frank le barde jouera de la musique et sur requête. Louez également une chambre en parlant à Mallory.\r<br />\r<br /> -[color=#FFFF00]Techniques sournoises[/color]\r<br />Un ex membre de la confrérie noire qui vend les choses que l&#39;on peut s&#39;attendre à voir chez un assassin. Des dagues et des poisons. En parlant de poison, il a rapporté l&#39;idée des pommes empoisonnée de Cyrodiil ainsi que le vin de langueur. Qui sait combien? Ces deux objets font la même chose que dans Oblivion. Il ne faut pas les consommer, mais ils ne sont pas aussi puissants que vous pourriez l&#39;imaginer. Vous pourriez survivre à ces poisons avec assez d&#39;objets et de magie de guérison. Ils sont considérés comme des produits alimentaires, de cette façon, les NPC peuvent être enclins à les consommer.\r<br />\r<br />-[color=#FFFF00]Gadgets essentielles[/color]\r<br />Principalement des choses pour la décoration de la maison et aussi une liste très complète de bibelots bizarre. Encore une fois, tous les objets ont un nouvel ID donc une nouvelle identité c&#39;est-à-dire pas de conflit avec quoi que ce soit. Le propriétaire a récemment fait l&#39;acquisition d&#39;un livre rare et interdit, mieux vaut ne pas savoir comment. Il se trouve quelque part dans son magasin. Ce livre vous apprendra un nouveau sort qui invoquera un marchand fantôme avec un inventaire qui se réinitialise à chaque fois que vous ferez appel à lui. Pour l&#39;instant, ne l&#39;invoquez pas alors qu&#39;il est déjà invoqué, attendez simplement qu&#39;il disparaisse avant de l&#39;invoquer de nouveau. Ce sera réglé dans la prochaine version.\r<br />\r<br />-[color=#FFFF00]Maison vacante[/color]\r<br />Là bas, se trouve un voleur qui pourra acheter vos objets volés.\r<br />\r<br />-[color=#FFFF00]Le paradis des archers[/color]\r<br />Un archer, qui vend des choses que vous êtes en droit d&#39;attendre d&#39;un manieur d&#39;arc. Pas d&#39;arcs enchantés, mais il vend tous les autres. De la flèche la plus puissante, à la plus faible, il les vend &#33; Il vend également des armures et des babioles propres à un archer, pour ne pas mentionner les potions et poisons. Enfin, il vend aussi des flèches de feu, de gel, de choc, de peur, de désarmement, de paralysie, de force (elle repousse les ennemis), tombeau de glace (enveloppe l&#39;ennemi dans la glace) et d&#39;absorption de santé. \r<br />\r<br /> -[color=#FFFF00]Magie de la Fossoyeuse[/color]\r<br />Trois mages qui vendent de tout, sauf les sorts les plus puissants, ceux qui doivent être obtenues ailleurs. Ils vendent également des gemmes spirituelles. Là-bas, il y a également un dispositif connu sous le nom &#34;Transmuteur temporel&#34;, utilisez le et vous serez en mesure de changer le rythme d&#39;écoulement du temps, (À quelle vitesse passe le jour et la nuit dans le jeu) et il y a quatre paramètres à choisir. Il existe enfin une Nirnroot à croissance permanente là-bas, entretenue par la magie, une fois cueillie elle restera et vous obtenez une Nirnroot, mais il vous sera impossible d&#39;en reprendre à nouveau pendant un jour ou deux, alors revenez plus tard. Il y a également l&#39;un des mages qui vend les livres de sorts Marque & rappel, faiblesse à la magie, reflet des dégâts et de conjuration de squelettes, il y a trois différents types de squelettes, un guerrier, un archer et un mage.\r<br />\r<br /> -[color=#FFFF00]Sammuels le lapidaire[/color]\r<br />Un commerçant récemment installé, vendant tous types de bijoux, pierres précieuses et minerai d&#39;or et d&#39;argent. Il possède également une mine d&#39;or et d&#39;argent.\r<br />\r<br />-[color=#FFFF00]Animalerie de la Fossoyeuse[/color]\r<br />Pour l&#39;instant, il y a trois animaux à acheter (1000 chacun), un ours, un smilodon et un loup, mais il reste encore deux cages de vides pour le futur. Pour en acheter un, approchez-vous et appuyez simplement sur le bouton. Parlez leur pour qu&#39;il vous suive puis de nouveau pour faire apparaître les commandes, qui sont tout simplement, suivre, attendre et renvoyer. Lorsque vous les renverrais, ils retourneront à l&#39;animalerie. Le propriétaire vend également quelques livres de sorts liés aux animaux, le livres de sort de commandement des animaux et elle vend quatre livres de conjuration d&#39;animaux, un loup noir, un ours noir, un smilodon et un autre qui invoque quatre rats criblés de maladies.\r<br />\r<br />-Chaque commerçant a plus d&#39;or que votre marchand habituel, mais pas de trop. Certains PNJ peuvent avoir un objet unique caché dans leurs foyers... à vous de les trouver. \r<br />\r<br />[color=#FFFF00]Autres choses: [/color]\r<br />==============\r<br />\r<br /> Certains marchands vendent des objets d&#39;artisanat portable. Pour les utiliser, il faut les mettre en favoris, leur attribuer un numéro de raccourci et de n&#39;utiliser que ceux-ci UNIQUEMENT. Techniquement ce sont des pièces d&#39;armure, ce qui était la seule façon pour Borjoyzee de créer des outils d&#39;artisanat portable.\r<br /> Mais ils ne prennent aucun slots, ils peuvent donc être utilisés avec n&#39;importe quelle armure. Borjoyzee a essayé de les placer chez les commerçants  qui logiquement devrait les vendre. Par exemple, les mages vendent une gemme spirituelle portable pour enchanteur, qui vous permettra d&#39;enchanter vos objets sans table d&#39;enchantement.\r<br />\r<br />Il y a une bibliothèque coupée en deux salles, chaque salle possèdent huit bibliothèques et chaque bibliothèques peut contenir 18 livres. Au total vous pourrez donc stocker 288 livres.\r<br />\r<br />Les gardes font des rondes et la Fossoyeuse possède sa propre justice. Alors si vous vous faites attraper, vous serez jeté à la prison souterraine de la Fossoyeuse &#33; Vous pouvez tout simplement passer votre temps, mais si vous êtes à la hauteur, il peut y avoir un moyen de vous échapper ...\r<br />\r<br />Tous les autres NPC ont leur propre demeure dans les Bas-fonds, mais comme Borjoyzee l&#39;a dit, ils ne sont ici que pour donner au lieu un peu de vie. Ils comblent juste l&#39;espace, ils ne font que se réveiller, s&#39;assoire, boire, manger, dormir, etc. Dans les versions ultérieures l&#39;auteur a l&#39;intention de donner des quêtes à certains d&#39;entre eux, mais ce sera pour plus tard.\r<br />\r<br />Il y a 3 compagnons possibles à prendre avec vous.\r<br />\r<br />- Le premier est un guerrier pur et simple, un ancien Oculatus qui brandis une grande hache de bourreau.\r<br />\r<br />- Le second est un pur archer, mais qui possède aussi une certaine habileté avec les lames.\r<br />\r<br />- Le dernier est un nécromancien, qui ranime et  manipule les morts, invoque un Atronach de glace, utilise la magie du gel et dispose aussi de quelques sorts de soins.\r<br />\r<br />-Besoin d&#39;entraînement? Dans les Bas-fonds il y a deux salles pour. La première est la salle de formation au crochetage, avec cinq conteneurs re-verrouillables, un pour chaque niveau de compétence. Il y a un coffre qui respawn les crochets, mais en nombre limité. \r<br />\r<br />Si vous avez envie d&#39;un défi, entrez dans le parcours du combattant &#33; Ces salles sont débordantes de danger : des pièges, des ennemis, des embûches. Enregistrez avant de commencer parce que vous serez mal en point à la fin. Pour cette raison je vous conseille les articles et la magie de guérison qui vous seront indispensables. Il y a une récompense qui attend ceux qui sont suffisamment expérimenté pour pouvoir terminer le parcours &#33;\r<br />\r<br />\r<br />\r<br />[color=#FFFF00]Installation:[/color]\r<br />=============\r<br />\r<br />Copiez le contenu du dossier &#34;Data&#34; du mod dans le dossier &#34;Data&#34; de Skyrim où votre jeu est installé (là où vous avez mis Steam).\r<br />Soit: ...SteamSteamAppscommonskyrimData.\r<br />\r<br />[color=#FFFF00]Désinstallation:[/color]\r<br />================\r<br />1. Désactivez le mod dans le mod manager.\r<br />2. Supprimez manuellement les fichiers dans data.\r<br />\r<br />==========================\r<br />\r<br />La Confrérie des Traducteurs:\r<br />Site Skyrim: http://www.confrerie-des-traducteurs.fr/skyrim/index.php\r<br />Forum: http://www.confrerie-des-traducteurs.fr/forum/index.php\r<br />\r<br />==========================\r<br />\r<br />\r<br />\r<br />[color=#FFFF00]Remerciements:[/color]\r<br />=============\r<br />Merci à Borjoyzee pour ce mod ainsi que pour son autorisation à le traduire.\r<br />Merci à Bethesda pour ce jeu ainsi que l&#39;univers &#34;The Elder Scrolls&#34;.\r<br />Merci aussi à Malhuin pour ses corrections.\r<br />Merci à Doezer pour son doublage de Morfran.\r<br />Merci à la Grande Bibliothèque de Tamriel pour ses traductions de livres.\r<br />==========================",
  "categoryId": "53",
  "version": "1.5.1.1",
  "author": "Borjoyzee",
  "createdUnix": "1356294998",
  "updatedUnix": "1397901859",
  "containsAdultContent": false,
  "uploadedBy": "bombeyte",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105537",
      "name": "The Undercity - By Borjoyzee - La Fossoyeuse",
      "version": "1.5.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18236",
      "fileName": "The Undercity - By Borjoyzee - La Fossoyeuse-28812-1-5-1-1.7z",
      "uploadedUnix": "1397901859",
      "modVersion": "1.5.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1e70b62a4c1b16ed1a2db6f75ca89910a6de92fe36245f09b5816bfd0fd2c783/analysis/1408029069/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Undercity%20-%20By%20Borjoyzee%20-%20La%20Fossoyeuse-28812-1-5-1-1.7z?fid=1000105537&ttl=1535802410&ri=8192&rs=8192&setec=3eb22559284676754acdf29c579bd108"
    }
  ]
}