{
  "modId": 28839.0,
  "modName": "Skyhammer Hold - Enter the Barbarian",
  "summary": "Tired of looking and smelling like a barbarian but don&#39;t live like a barbarian? Search no longer, for Skyhammer Hold awaits&#33; This is a Nexus Exclusive. Hearthfire Edition is now live&#33; Adoption & Spouse friendly via TMPhoenix&#39;s Hearthfire multiple adoptions mod.",
  "descriptionHtml": "[center][img]http://static-3.nexusmods.com/15/mods/110/images/28839-1-1392626875.jpg[/img][/center]\r<br />Screenshot by [url=http://www.nexusmods.com/skyrim/images/382622/?]etaineleanor[/url]\r<br />\r<br />Thank you for taking a look at my mod&#33; It&#39;s been quite the fun project and I hope you enjoy your experience with Skyhammer Hold&#33; [color=red]Please read the Changes Tab (above) and Notes section&#33; (below)[/color]\r<br />\r<br />This mod is no longer being developed and will remain as is. If anyone decides that they might want to create additional content for this mod or utilize any resources I am willing to hand over the torch so long as the folks mentioned below in the credits are asked for their permission to use the content they&#39;ve been credited for.  \r<br />\r<br />[color=green][b]Version 1.6c Requirements:[/b][/color] \r<br />- [url=http://www.nexusmods.com/skyrim/mods/29249/?]Hearthfire multiple adoptions[/url]\r<br />- Hearthfire DLC \r<br />\r<br />I advise removing version 1.5 via NMM before installing version 1.6 and starting it with a game that hasn&#39;t had Skyhammer Hold in it or a new game. If you are upgrading from 1.6b to 1.6c, please read the sticky in the comments before doing so. I would also advise when adopting children to do it one at a time and wait for each to arrive at the inside.\r<br />\r<br />If you move in an existing family, I want to know how that goes...I haven&#39;t been able to get around to testing that bit heavily. Also when you tell the kids to go play outside, they&#39;ll sometimes play around the Western Scout Tower if you can&#39;t seem to find them.\r<br />\r<br />I&#39;ve absorbed features that are already done into the Features section and the Changes Tab will list all changes made in 1.6 specifically.\r<br />\r<br />[color=green]Mods I Recommend that Compliment this Mod:[/color]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/22330/?]Tundra Defense[/url]  - add some excitement with the raid feature and place some buildings in the flat (more or less) area on the west side of the hold. This mod is fantastic and adds a ton of customization to fill the area around the hold with your own constructions. (Careful with placement on this one if you&#39;ve bought livestock, it is possible that you could place a structure on top of their sandbox area and have issues.)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/18045/?]My Home Is Your Home[/url] - Give your followers a home and put them to work for you&#33; This is a really excellent mod that breathes some life into your followers and is quite easy to use.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/40914/?]CONAN Hyborian Age[/url] - This is a well put together and ultimately awesome adventure mod with some swanky barbarian armors and weapons. Go check it out&#33;\r<br />\r<br />[color=yellow]Anything[/color] (else) that looks, smells or feels barbaric. Outfits, NPCs, Weapons, you name it&#33; \r<br /> \r<br />\r<br />[color=green][center][size=5][b]Features:[/b][/size][/center][/color]\r<br />\r<br />[color=green][b]A Highly Detailed Home Fit for a Chieftain[/b][/color] in the Whiterun tundra just North of Swindler&#39;s Den with a unique scheme that is all about weapons and bones. There are enough beds for up to twelve followers (if you include bedrolls) and plenty of idle markers and special furniture for them to interact with. There is also a small stable for your player horse and outdoor crafting areas.\r<br />\r<br />[color=green][b]A Garden[/b][/color] to grow up to 21 plants near the stable area and keep your food/alchemy supplies stocked. \r<br />\r<br />[color=green][b]Livestock[/b][/color] in the form of six cows that free range around the hold and six chickens that inhabit the garden and stable area with nests tucked in by the stairs for gathering eggs.\r<br />\r<br />[color=green][b]A Short History Book with Custom Art[/b][/color] written by myself, with fantastic artwork by Scorch621. It is a small history of the origins of Skyhammer Hold, set in the days when Ysgramor first landed in Tamriel and tells the tale of a ship and her crew.\r<br />\r<br />[color=green][b]An Adventurer&#39;s Journal[/b][/color] also written by myself, it follows an adventurer named Dain the Bold. It is a more recent history of Skyhammer Hold and ties it into the current timeline and events. Refer to the Notes section for the location of all three journals.\r<br />\r<br />[color=green][b]A Mighty Dragon[/b][/color] by the name of Loktu&#39;Vokun that you must defeat to gain the keys. He&#39;s pretty tough, so be ready to earn your home the barbarian way&#33;\r<br />\r<br />[color=green][b]A Barbaric Shrine[/b][/color] that features dragon priest busts to display masks, and three meditate markers for the player and followers to use. The shrine activator is located at the decorative shield and swords at the front of the shrine. It will give the player a 50% boost to health, magicka and stamina regeneration for 24 hours and cleanse diseases on activation. Does not override vanilla shrines.\r<br />\r<br />[color=green][b]Three New Followers[/b][/color] from the journal, Dain, Gunnhilde and Brundin. They have been placed at an Adventurer&#39;s Camp directly south of the hold on the western edge of Lake Ilinalta. They are generic followers and facegen files have been included. Dain is a merchant that supplies the player with notes to configure certain options from decor and displays to guards and livestock. Gunnhilde sells Alchemy supplies, Brundin sells Smithing supplies along with bows and arrows.\r<br />\r<br />[color=green][b]A Shaman[/b][/color] by the name of Torgul who will sell you enchanting supplies, spells and staves. He has some strange hours, so expect to see him when everyone else is taking a nap.\r<br />\r<br />[color=green][b]A Choice of Two Bards[/b][/color] by the name of Sigrid or Ulfstan. They should play in the hall during the morning and evening. In between they should cook and clean and will also sell food and drinks. In my testing they haven&#39;t always been diligent, but if you&#39;ve got a bard mod that allows you to tell them to take a break any time they ought to stop playing and go about their routine. These guys are a bit of a mystery when it comes to song choice as well. I am inclined to think it has something to do with the Civil War questline as I&#39;ve tried all available voice types and not seen a change according to that.\r<br />\r<br />[color=green][b]Unique Crafting Auto-Storage[/b][/color] that goes with the type of crafting. For enchanting - static soul gems, for alchemy - static potions, cooking - mouse over the baskets  to activate the food container and mead/wine to activate drinks container. Smithing is the generic pile of chests and sacks. See the images section for hints on container/activator placement and auto-storage button location.\r<br />\r<br />[color=green][b]Mannequins, Racks, Display Cases and Plaques[/b][/color] to display your spoils of war. You will have options to place mannequins and display cases, and change the color scheme of the plaques, banners and rugs in the form of Work Orders provided by Dain.\r<br />\r<br />[color=green][b]A Unique Throne[/b][/color] of your own to let your horde know who&#39;s boss&#33; \r<br />\r<br />[color=green][b]A Fortified Master Bedroom/Study[/b][/color] featuring a large gate to keep people out, or in&#33; Also features several bookcases with fancy decorations, and a secret door to an escape tunnel for quickly retreating from your in-laws&#33; The tunnel has seating for two and two bedrolls with a ton of crates and sacks to store emergency supplies and other random junk you just can&#39;t find a place for. \r<br />\r<br />[color=green][b]Two Upstairs Guest Rooms[/b][/color] with a small bookshelf area, seating for two, a few places to display more weapons and a single bed in each room. The left guest room is now a space for the Bard to sleep and the right guest room is a space for Torgul to sleep.\r<br />\r<br />[color=green][b]A Downstairs Barracks[/b][/color] to house eight of your rowdy revellers and a chest and wardrobe to stow each of their belongings&#33; Also features a hot tub area with ancient nordic carvings with seating for eight and a spot in the center for you to lay down on and enjoy a good steaming with your favorite partner. The kitchen has two cooking stations, seating for four and some random containers for extra storage. Down the hall you&#39;ll find the alchemy/enchanting room where you can do your mystical works in a safe and quiet environment&#33;\r<br />\r<br />[color=green][b]A Children&#39;s Barracks[/b][/color] with space for a maximum of six children. This is Hearthfire multiple adoptions specific, it won&#39;t work as intended without TMPhoenix&#39;s mod.\r<br />\r<br />[color=green][b]Seven Defensive Towers[/b][/color] in two flavors. Four of them are basic wooden towers with stairs for access. Three of them are scouting towers with ladders and a wood beam acting as doors for access. See the change log for the placement of the towers and the Notes section for advice on using the scouting towers.\r<br />\r<br />[color=green][b]Stormcloak or Imperial Banners[/b][/color] to show your allegiance to either side of the civil war. These are exterior only as they are movable statics and just don&#39;t make sense indoors. \r<br />\r<br />[color=green][b]Eight Guards[/b][/color] to man the four large towers day and night. They will respawn should they die and will sleep in rooms placed at the bottom of each tower. At the end of their shift, they&#39;ll hit the archery range and then grab something to eat on the back porch before heading to bed. \r<br />\r<br />[color=green][b]An Archery Range[/b][/color] That the guards will use to practice their skills with a grain mill nearby for the player to grind wheat and work on their physique Conan-style. \r<br />\r<br />\r<br />[color=green][center][size=4]Notes:[/size][/center][/color]\r<br />\r<br />Configuration is done via a simple script attached to notes supplied by Dain. Reading them once will enable or disable the objects or NPCs they correspond to. You can read all of these notes as many times as you like if you change your mind and want to use (for example) mannequins instead of display cases. It is possible with some options to have both enabled, check the Changes Tab under Version 1.5 to see what options conflict with each other.\r<br />\r<br />For Version 1.4 scouting towers: when you are on top of the platform facing the ladder, clicking in the middle of the wood beam on the floor to leave can sometimes activate the ladder again putting you back up top. To prevent this, click on either left or right of the wood beam on the open edge of the platform to reliably get down. \r<br />\r<br />You may have an instance where a Stormcloak Courier zips through the hold, I have no idea how they are getting in or where they are coming from. I see nothing that suggests a spawn marker so I&#39;m not sure what to do about it. \r<br />\r<br />The barracks can have some visual glitches where I&#39;ve put Roombounds to help with performance issues, but they should be very minimal and brief. I&#39;ve toyed with those to no avail, Roombounds do not like me.  \r<br />\r<br />You can find the history book on the table in the main hall on the end nearest to the front entrance. The second journal can be found in the Tunnel on top of the table in there. The third journal will be in Dain&#39;s inventory so you can grab it when you pick him up as a follower.\r<br />\r<br />The gate to the master bedroom opens by a pullbar located to the right on the ground. You can close it from the inside by a similarly placed pullbar.\r<br />\r<br />The throne and the hot tub lay down markers do some funny things to your characters position if you look around in first person, it&#39;s best to either enter in 3rd person or zoom out to third person before you look around.\r<br />\r<br />The outdoor storage on the alchemy and enchanting benches should now be much easier to target. If you have any other storage suggestions let me know. I&#39;ve provided screenshots to help people with the storage scheme, they are only for indoors but the same scheme is used for outdoor storage.\r<br />\r<br />I hope you like it, and look forward to your comments. :o)\r<br />\r<br />\r<br />[color=green]Compatibility Issues:[/color] \r<br />\r<br />- Not compatible with Hunting in Skyrim.\r<br />\r<br />[color=green]Special Thanks To:[/color] \r<br />\r<br />[color=cyan]Aereus[/color], [color=cyan]Scorch621[/color], [color=cyan]MrKappa[/color], [color=cyan]Outkast[/color], [color=cyan]Tardin[/color], [color=cyan]schattentraum[/color], [color=cyan]Khrill[/color], [color=cyan]mattmesser[/color], [color=cyan]Macman253[/color] and [color=cyan]greyroyce[/color] for providing valuable input to help me make this house mod better. That&#39;s exactly the kind of feedback I need&#33;\r<br />\r<br />[color=cyan]etaineleanor[/color] for her outstanding screenshots in the images section, they are a wonderful showcase of this mod. Thank you&#33;\r<br />\r<br />[color=cyan]gianid[/color] for including my mod in his video review&#33;\r<br />\r<br />Everyone who bothered to comment and endorse this mod, thank you&#33; :o)\r<br />\r<br />[color=green]Credits:[/color]\r<br />\r<br />[color=cyan]TMPhoenix[/color] for the Hearthfire multiple adoptions mod and the tutorial that allowed me to configure my mod to work with it. \r<br />\r<br />[color=cyan]raiserfx[/color] for permission to use his Jorrvaskr rug from his Detailed Rugs mod for my blue and gray variant, thank you&#33;\r<br />\r<br />[color=cyan]Ghaunadaur[/color] for the dragon priest bust scripting.\r<br />\r<br />[color=cyan]IsharaMeradin[/color] for the auto-sorting and remote access scripting. \r<br />\r<br />[color=cyan]flobalob[/color] for alternate methods and advice. \r<br />\r<br />[color=cyan]Scorch621[/color] for the awesome sketches for the history book, they look fantastic&#33;\r<br />\r<br />Likely other people as well that have answered my questions in the forums. \r<br />\r<br />Bethesda for the CK and Skyrim\r<br />\r<br />Photoshop \r<br />\r<br />Google\r<br />\r<br />\r<br />",
  "categoryId": "67",
  "version": "1.6c",
  "author": "TheGreenLion",
  "createdUnix": "1356335601",
  "updatedUnix": "1393786293",
  "containsAdultContent": false,
  "uploadedBy": "TheGreenLion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000051882",
      "name": "Skyhammer Hold",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10070",
      "fileName": "Skyhammer Hold-28839-1-5.rar",
      "uploadedUnix": "1378174394",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/99086cd7f31532097120fae077d6175731a651fee4302b355c3e4be5bfe364e2/analysis/1407707060/",
      "changelogHtml": " Version 1.5 -\r<br />Due to the changes I&#39;ve made to the hold and to Dain, 1.5 may not play nicely with 1.41. I would recommend that if you upgrade to 1.5 that you start a new game or use a save that Skyhammer Hold hasn&#39;t been used on. This update combines the previous versions into one, with the exception of the Optional Files folder. Now you can change things in game for the most part, yay&#33; Be sure to read the following information carefully&#33;\r<br />\r<br />Created Work Orders that Dain will sell to the player to customize the interior partly. You MUST READ these Orders for them to take effect as the script fires when you read it. I&#39;ve also provided a set of Removal Orders in case you change your mind or if you&#39;ve made a mistake. More on that below.\r<br />\r<br />Work Orders:\r<br />\r<br />Blue Decor - Changes the now default Red scheme to Blue. I&#39;ve gotten permission from raiserfx to use his Jorrvaskr Rug and have recolored them to blue and grey to match this scheme.\r<br />\r<br />Mannequins - Adds Mannequins to the Main Hall or the Barracks, these are not compatible with the Extra Display Cases or the Barracks Display Cases.\r<br />\r<br />Display Cases - Main Hall Display Cases are compatible with any option, Extra Main Hall Display Cases as mentioned above aren&#39;t compatible with Main Hall Mannequins, Barracks Display Cases are not compatible with Barracks Mannequins. \r<br />\r<br />Removal Orders:\r<br />\r<br />These are MUCH lower in price and allow the player to reverse any changes made by the Work Orders if you change your mind or want to try the other options. I would recommend going outside or into the Tunnel before making changes. \r<br />\r<br />You are not limited to reading these Orders once, read them as many times as you like to make changes. Be sure that you remove any items from mannequins or display cases before you read any of the Removal Orders that disable them&#33; As a precaution, do not read Work Orders again after you&#39;ve placed items on the Mannequins or Display Cases if those Orders affect the ones you are using.\r<br />\r<br />I have provided a folder called Skyhammer Hold - Optional Files containing the Dark Throne option and a texture file to change the banding on the lower part of the throne to blue if you would like to use the blue scheme. There&#39;s a Readme inside just in case. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyhammer%20Hold-28839-1-5.rar?fid=1000051882&ttl=1535802454&ri=8192&rs=8192&setec=03b35f91e7500d88a85c375c49dfd9c6"
    },
    {
      "fileId": "1000098296",
      "name": "Skyhammer Hold - Hearthfire Edition",
      "version": "1.6b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13161",
      "fileName": "Skyhammer Hold - Hearthfire Edition-28839-1-6b.rar",
      "uploadedUnix": "1393102988",
      "modVersion": "1.6b",
      "virusScanUrl": "https://www.virustotal.com/file/f74f63930a21ed0c471cb61f348fa25858daf11f5d378d4c4a43f99cc38a0c75/analysis/1407945619/",
      "changelogHtml": " Hearthfire content and Hearthfire multiple adoptions content has been added. You cannot simply &#39;upgrade&#39; from 1.5 to 1.6 so starting a new game (or using a game that hasn&#39;t had Skyhammer Hold in it) will be necessary. New stuff includes the HF planter soil objects to grow your own plants, a butter churn for the outdoor kitchen, an oven in the indoor kitchen, a children&#39;s &#39;barracks&#39; next to the indoor kitchen and consumable items added to the Auto-Storage lists. Firewood has been added as well and will be found in the Ingots chest.\r<br />\r<br />Dain has more stuff to buy&#33; As before these will activate once you read the note and all additions will have a removal option. You can now buy guards, chickens (with nests), cows that range around the hold, a bard for your hall and banners to support either the Empire or Stormcloaks.\r<br />\r<br />All notes and books have the prefix &#39; TGL - &#39; to better sort them in your inventory. I added the dash so if you happen to get them via console (for testing, right?) you don&#39;t end up getting results for Thieves Guild stuff. In other words, don&#39;t forget the dash&#33;\r<br />\r<br />Placed a light on the campfire at the Adventurer&#39;s Camp that I somehow missed for so long being focused on the main hold. \r<br />\r<br />Squashed a script error where an old script was stuck to the Auto-Storage button.\r<br />\r<br />Modified the large towers with a room at the bottom for the guards, or for followers if you&#39;d rather they stay there instead. Might have some grass poking up out of the floor if you use SFO or anything that modifies the grass to cover more space.\r<br />\r<br />If I missed anything I&#39;ll add it here. :oP <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyhammer%20Hold%20-%20Hearthfire%20Edition-28839-1-6b.rar?fid=1000098296&ttl=1535802454&ri=8192&rs=8192&setec=53a0258e853d04265840d3c3efdc4ebc"
    },
    {
      "fileId": "1000099495",
      "name": "Skyhammer Hold - Hearthfire Edition",
      "version": "1.6c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13163",
      "fileName": "Skyhammer Hold - Hearthfire Edition-28839-1-6c.rar",
      "uploadedUnix": "1393786293",
      "modVersion": "1.6c",
      "virusScanUrl": "https://www.virustotal.com/file/50ca411b3c6e686328031082c1d3dc96647474a19ba23124c303060f471c85ce/analysis/1407957134/",
      "changelogHtml": " Version 1.6c:\r<br />\r<br />- Placed a grain mill by the archery range for the player to grind wheat and work on their physique.\r<br />\r<br />- Dain now sells some random adventuring stuff like lockpicks, torches, pickaxes and wood axes.\r<br />\r<br />- Gunnhilde now sells alchemy supplies.\r<br />\r<br />- Brundin now sells bows, arrows, ingots, ore and leather.\r<br />\r<br />- Sigrid and Ulfstan now sell food and drinks.\r<br />\r<br />- Torgul sells enchanting supplies, jewelry, staves, spell books and scrolls. You can hire him via Dain as with all other options.\r<br />\r<br />- All of them have had their buying gold increased to 5,000 from 1,000. Their inventories will also respawn, this means that the notes from Dain will respawn but you don&#39;t need to buy them again. I suppose it could be handy if you lose any of them.\r<br />\r<br />- Torgul will sleep in the right upstairs guest room opposite the bards and sandbox in the barracks enchanting/alchemy room and also on the back porch. He has some strange hours, he&#39;ll sleep from 12pm to 6pm.\r<br />\r<br />- Added some dragon perches on the roof areas of the main hold and a crash marker in between the two northmost towers to make the dragon fight a little bit more interesting. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyhammer%20Hold%20-%20Hearthfire%20Edition-28839-1-6c.rar?fid=1000099495&ttl=1535802454&ri=8192&rs=8192&setec=b4dead456fcb492b52a3c7ae949b6598"
    }
  ]
}