{
  "modId": 28846.0,
  "modName": "Phinix SkyBuilder",
  "summary": "A program to allow you to completely customize your character, including level, re-spec option with full talent tree functionality, skills and attributes, weapons, armor, and other items, Stone Sign, Blessing, etc.",
  "descriptionHtml": "[size=4]Phinix SkyBuilder v1.0[/size]\r<br />\r<br />[b][u]UPDATE: [/u][/b]I HIGHLY recommend you use this with [url=http://www.nexusmods.com/skyrim/mods/29624/]RaceMenu by Expired[/url] and especially [url=http://www.nexusmods.com/skyrim/mods/25404/]Random Alternate Start by Syclonix[/url], which will allow you to skip the intro sequence and start your adventure in a random location in the world.\r<br />\r<br />In the spirit of new beginnings I have created this simple yet powerful application, to aid you in creating your next Skyrim character (or in reshaping existing ones). Whether you are preparing for Dragonborn or simply wish to try something new, SkyBuilder lets you completely customize your characters as you see fit.\r<br />\r<br />Options in the current version enable you to completely re-spec a character, with a simulation of all standard talent trees, attributes sliders, Stone Signs, and Blessings. You can also add items including all default (and many additional) weapons, armor, ammunition, soul gems, and alchemy ingredients. For more information please see the main readme file, which is also available through the help menu in the application itself.\r<br />\r<br />Future options I plan to add include more items (ore and ingots, hides and building materials, etc.) I also plan to add additional talent trees for Vampire Lord and Werewolf specs, and the ability to load created profiles to make changes. Lastly, full coverage of all Dragonborn content is also planned. Feel free to register to post questions or comments on the forums or leave them here.\r<br />\r<br />I hope you enjoy the application&#33;\r<br />\r<br />[center][img]http://i.imgur.com/Qc2sELm.jpg[/img][/center]",
  "categoryId": "39",
  "version": "1.0",
  "author": "Phinix",
  "createdUnix": "1356348821",
  "updatedUnix": "1356618966",
  "containsAdultContent": false,
  "uploadedBy": "phinix",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107846",
      "name": "Phinix SkyBuilder",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10683",
      "fileName": "Phinix SkyBuilder-28846-1-01.rar",
      "uploadedUnix": "1356618966",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/f90e54052798dcafed97bda4b3b853e8566e09e85c15c1f0e056b7ab527baa3d/analysis/1407324436/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phinix%20SkyBuilder-28846-1-01.rar?fid=107846&ttl=1535802468&ri=8192&rs=8192&setec=5f8e52a4f915a499ce579ecea3730c34"
    }
  ]
}