{
  "modId": 28862.0,
  "modName": "Azalea Follower by CrimsonFairy",
  "summary": "My first standalone follower&#33; :D Azalea is my first female follower to be released so I hope you all like her. Azalea is a female Breton noble who ran away from her family in High Rock to become an adventurer in Skyrim. She&#39;s looking for any adventure that comes along so she&#39;ll follow you around for free&#33; Since I don&#39;t know how ",
  "descriptionHtml": "                                                          Azalea by CrimsonFairy\r<br />\r<br />[url=http://minus.com/lRP0QiJZKi9Nc][img]http://i.minus.com/jRP0QiJZKi9Nc.jpg[/img][/url]\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Description\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Version 1.2 is now available&#33; Please see the changelog for update info. :)\r<br />\r<br />My first standalone follower&#33; :D Azalea is my first female follower to be released so I hope you all like her. Azalea is a female Breton noble who ran away from her family in High Rock to become an adventurer in Skyrim. She&#39;s looking for any adventure that comes along so she&#39;ll follow you around for free&#33; Since I don&#39;t know how to write dialog or anything I decided to write a back story for her(See below) so you know who she really is and I just wanted to give her a personality so she doesn&#39;t seem like someone who is just following you around. Now you can picture what she&#39;d actually do in certain situations.\r<br />\r<br />Azalea is essential and marriageable and you can find her in Solitude at the Winking Skeever. She does not replace any existing NPCs and is standalone except for a few requirements as listed below. Her default armor is steel plated and her weapons are two duel-wielding silver swords, my trademark for my standalone followers. She is very skilled at archery too, but I forgot to add a bow and some arrows, I&#39;ll probably add those in an update.\r<br />\r<br />Azalea is brave, honorable, loyal, kind, charismatic, wise, warm-hearted and will follow you to the end of the world. Enjoy&#33;\r<br />\r<br />Images are welcome but I have to verify them first because I do not allow adult images or content on my files because then I&#39;d have to make the file adult only and I want everyone to be able to use my mod.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Background\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />This isn&#39;t the full version of the story, its just a shortened version, I just didn&#39;t want to bloat up the description page. If you want to read the full, long, and fully detailed version of Azalea&#39;s story then please go [url=http://skyrim.nexusmods.com/images/178229]here[/url].\r<br />\r<br />Azalea was born a Breton noble but was always fascinated by the art of sword-wielding and archery. Rebelling against her parents wishes to become a priestess, Azalea secretly trained with a war veteran named Lucius who had fought in the Great War and they met to train every evening. Training went as planned until they were ambushed by bandits in the forest where they trained. They quickly dispatched the bandits, but they were unaware of the bandit chief that lurked inside the gloom of the forest. As the dark figure emerged from the forest gloom, the glint of its sword in the moonlight, Azalea watched in horror as the bandit chief, laughing, plunged its sword into Lucius&#39; back.\r<br />\r<br />Angry, Azalea then fought the woman, who slashed her sword across Azalea&#39;s chin and nearly killed her with her swinging sword before Azalea remembered something Lucius had said, &#34;If you let yourself be fueled by anger then it will be your undoing. Instead, let your strength be fueled by that which you love, which you wish to protect. That, Azalea, will give you the peace of mind and the calmness you need to overcome any great obstacles.&#34; This gave Azalea what she needed to defeat the bandit chief, and Azalea ran up a nearby rock and launched herself off of it and swung her sword in a sideways ark and sliced the woman&#39;s head clean off.\r<br />\r<br />Azalea then ran to her teacher who lay on the ground. She tried healing him but it didn&#39;t work. Lucius looked at her and whispered, &#34;You are a great warrior, Azalea. I know you are. And soon so will everyone.&#34; And then Lucius closed his eyes and Azalea knew he was dead.\r<br />\r<br />Azalea then went back home. Her parents exclaimed in horror when they saw her bloodied up, and wielding a bloody sword. She told them everything. They took her armor and sword and told her she could never fight or leave the town again. Her mother gasped in horror at the bloody cut on her chin and told her to go wash up. But as she was in the bathroom she overheard her parents talking, &#34;But Clark&#39;s son will never marry Azalea now, what if that cut turns into a scar?&#34; Clark&#39;s son Finn? He was a stuck-up noble boy. They had arranged a marriage with him without telling her? That was it. No more. \r<br />\r<br />Later that night when everyone else was asleep, Azalea crept out into the living room, a bag filled with her belongings slung over her shoulder. She then took the family&#39;s silver dual swords from above the fireplace. She realized she had no armor anymore so she went back into the forest to where the battle had happened and she took the bandit chief&#39;s fancy steel plated armor. She then took a horse from her family stables and rode as fast as she could until she reached High Rock&#39;s border. She planned to go to Skyrim to become the adventurer she had always wanted to be, and hoped to find a friend to share her adventures with. But she would never forget Lucius or the things he had taught her and the wise words he had shared.\r<br />\r<br />Despite the fact that Azalea resented the Restoration training she had to do to become a priestess, she still uses healing spells to heal her battle wounds.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Requirements/Recommended\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />The female standalone version of [url=http://skyrim.nexusmods.com/mods/10168]ApachiiSkyHair[/url]. It looks like this ApachiiSkyHairFemale_v_1_1_a.\r<br />\r<br />Also, you might want to download the hair fix or else Azalea&#39;s hair will show through helmets and hoods. Its on the same page as linked above but looks like this: ApachiiSkyHairFemale_fix_hair_13_non_clip_hoods_v_1_1. It&#39;ll have an image of the hair below it.\r<br />\r<br />The latest Skyrim patch 1.8. Probably won&#39;t work without it.\r<br />\r<br />The mods I list below are the ones you&#39;ll want if you want the look in the screens. The first section of mods I list are the ones I used, the second are the ones MissMorose used in her shots and the third are the ones TairenSoul used.\r<br />\r<br />Recommended:\r<br />[url=http://skyrim.nexusmods.com/mods/3563]Coverwomen[/url] look 4 no make up version.\r<br />[url=http://skyrim.nexusmods.com/mods/498]High Quality Eyes by Xenius[/url].\r<br />[url=http://skyrim.nexusmods.com/mods/4784]High Resolution Scars by Xenius[/url].\r<br />[url=http://skyrim.nexusmods.com/mods/20483]Women of Skyrim-Enhanced female normalmaps[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/28645]Nuska Real Skin for Women[/url].\r<br />\r<br />MissMorose used:\r<br />[url=http://skyrim.nexusmods.com/mods/13722]The Eyes of Beauty[/url].\r<br />[url=http://skyrim.nexusmods.com/mods/2356]XCE[/url].\r<br />[url=http://skyrim.nexusmods.com/mods/20483]Women of Skyrim-Enhanced female normalmaps[/url]\r<br />\r<br />TairenSoul used:\r<br />Urshi Female Face Textures WIP(not out yet).\r<br />[url=http://skyrim.nexusmods.com/mods/13722]And Eyes of Beauty[/url].\r<br />\r<br />NOTE: If you use The Eyes Of Beauty then Azalea&#39;s eyes will be yellow when they are supposed to be grey.\r<br />\r<br />You might want to try out TairenSoul&#39;s [url=http://skyrim.nexusmods.com/mods/25211]Female Face Tattoo Warpaint[/url]. The mod isn&#39;t required but its a great mod to have. :)\r<br />\r<br />If you want Azalea to start out with an awesome armor then I recommend downloading [url=http://skyrim.nexusmods.com/mods/20792]CaBal&#39;s aMidianBorn Steel Plate Armor re-texture[/url]. It&#39;s what&#39;s shown in most of the pics.\r<br />\r<br />I also used [url=http://skyrim.nexusmods.com/mods/19826]Elaborate Textiles[/url] in some of the images.\r<br />\r<br />I&#39;ve used [url=http://skyrim.nexusmods.com/mods/29801]Exquisite Modern Outrageous - EMO HAIR[/url] in some shots, it has a retexture that gives the hairstyle Azalea uses purple streaks. :)\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Install/Uninstall\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Extract files from archive into Skryim data folder. Shouldn&#39;t ask you to overwrite anything. And that&#39;s it&#33; If you use UFO then I think you&#39;re supposed to load follower mods under the UFO.esp in order for UFO changes to affect them.\r<br />\r<br />To uninstall, go into the Skyrim Data folder and delete Azalea by CrimsonFairy.esp and Azalea by CrimsonFairy.bsa.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Credits\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />I&#39;m going to try to give everyone a nice little space of credits&#33;\r<br />\r<br />Bethesda for making Skyrim and the Creation Kit.\r<br />\r<br />TairenSoul for testing, taking awesome screenshots, and for letting me use her beautiful female warpaint. :) Thanks, TairenSoul, Azalea wouldn&#39;t be the same without it&#33;\r<br />\r<br />Apachii for letting me use one of her amazing hair styles. Your work is amazing, Apachii&#33; :)\r<br />\r<br />Greyblood for testing. And for taking images of Julien even though that&#39;s got nothing to do with this mod. :D\r<br />\r<br />MissMorose for testing and putting up with me when I forgot to tell her where Azalea was. O.O Oh, and for taking some amazing screenshots&#33; :D We can just forget about that other little incident, can&#39;t we?\r<br />\r<br />Foretrenty for making the Skyrim NPC Editor, because I can&#39;t stand the Creation Kit. &gt;:(\r<br />\r<br />BravoOskar for making his Easy NPC creation tutorial which really helped me get started with making NPCs. Seriously, without this guy Azalea and all my other NPCs wouldn&#39;t have been made, so a BIG thanks to this guy. :D\r<br />\r<br />I&#39;d like to thank Netherwalk for teaching me how to add custom warpaint to followers. Thanks for helping me with it&#33; ^_^\r<br />\r<br />A big thanks to Urshi for helping me remake Azalea in the Creation Kit and for a bunch of other stuff. Thank you&#33; :D\r<br />\r<br />And the Nexus creators and staff for their awesome work and website.\r<br />\r<br />Please let me know if I forgot someone&#33; I&#39;m pretty sure I got them all though.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Usage/Permission\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />If you want to do something with my mod (as in, translating or uploading it somewhere) then you&#39;ll have to get permission from me first. If I give you my permission then you&#39;ll be directed to a couple other people you&#39;ll have to get permission from as well.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Bugs/Incompatibilities\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />None that I know of. The only thing I can think of is she might not be compatible with any mods that include a follower of the same name. Please let me know if you find any though&#33;\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Other follower mods by me:\r<br />[url=http://skyrim.nexusmods.com/mods/27620]My Onmund replacer[/url].\r<br />[url=http://skyrim.nexusmods.com/mods/30894]Belrand Remake[/url].\r<br />[url=http://skyrim.nexusmods.com/mods/32564]Talvas Fathryon Remake[/url].\r<br />\r<br />\r<br />[url=http://minus.com/lbsroO5JfULjGJ][img]http://i.minus.com/jbsroO5JfULjGJ.jpg[/img][/url]\r<br />\r<br />              Thanks for reading, downloading, commenting and endorsing&#33; :)",
  "categoryId": "66",
  "version": "1.0",
  "author": "CrimsonFairy",
  "createdUnix": "1356379524",
  "updatedUnix": "1360456127",
  "containsAdultContent": false,
  "uploadedBy": "CrimsonFairy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107337",
      "name": "Azalea by CrimsonFairy V1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2264",
      "fileName": "Azalea By CrimsonFairy-28862-1-0.rar",
      "uploadedUnix": "1356379812",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1b663062b2ec8bc48b639e3b33184524161368c655029fa72d9d021c067aeac2/analysis/1407321124/",
      "changelogHtml": " Old. Don&#39;t use. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Azalea%20By%20CrimsonFairy-28862-1-0.rar?fid=107337&ttl=1535802503&ri=8192&rs=8192&setec=7e870ee63ab17049565ec7bfce3c118c"
    },
    {
      "fileId": "107349",
      "name": "Azalea by CrimsonFairy V1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2264",
      "fileName": "Azalea by CrimsonFairy-28862-1-1.rar",
      "uploadedUnix": "1356383675",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d2eeb1d0fffa3b1f88ce0c7dcd9e4e9ab787320e3ec2b15484b4fe3e70788fda/analysis/1407321256/",
      "changelogHtml": " This version just has an updated readme from version 1.0. It&#39;s highly recommended that you just use version 1.2 unless you didn&#39;t have problems with this one and prefer her hair color in this more. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Azalea%20by%20CrimsonFairy-28862-1-1.rar?fid=107349&ttl=1535802504&ri=8192&rs=8192&setec=7448c8ef1fa25c3ecefca9dd8e22dcb4"
    },
    {
      "fileId": "1000008551",
      "name": "Azalea by CrimsonFairy V1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1015",
      "fileName": "Azalea by CrimsonFairy 1_2-28862-1-2.rar",
      "uploadedUnix": "1360456127",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/a6868a02fbb7bc6779a0e6ed52243a1da3a3f0b9f4db14db9cc36d89427da81b/analysis/1407408433/",
      "changelogHtml": " I completely remade Azalea in the CK because I was having a few problems with the other version, and so were some other people. This version should fix everything though, including her level, any hair misfunction, and any other possible problems that <br/> \n the other file might have had. I think her hair is a little darker in 1.2, but it&#39;s only because I don&#39;t know how to create custom hair colors in the Creation Kit. I&#39;ll try to figure it out though. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Azalea%20by%20CrimsonFairy%201_2-28862-1-2.rar?fid=1000008551&ttl=1535802504&ri=8192&rs=8192&setec=12c507714c21ab1859813c0242e5eb5b"
    }
  ]
}