{
  "modId": 28863.0,
  "modName": "Nordic Tower Conversion",
  "summary": "This is a small mod which removes the respawning of some of the Nordic towers and watchtowers, allowing the player to store their items in the main (boss) chest and not worry about enemies.",
  "descriptionHtml": "[b][i]Announcements:[/i][/b]\r\n\r\nHi all, just a quick mod by request to add some player owned functionality to existing towers around Skyrim. Nothing fancy, just a few ownership and respawning changes.\r\n\r\n[b]If you like this mod, and would like me to expand it to other towers, please let me know. Thanks! :D[/b]\r\n\r\n[b][i]Description:[/i][/b]\r\n\r\nEffectively, you can rampage these towers, then store your items in the boss chest at the top and it\\'ll stay there. Also, the enemies that you kill won\\'t return. I\\'ve not added anything, nor moved anything around. Everything appears exactly as it did before.\r\n\r\n[b][i]Changed Towers:[/i][/b]\r\n\r\nI\\'ve modified all of the towers south of the White River, which is the river which runs from Windhelm to Lake Illinata, with two exceptions:\r\n\r\n - Falkreath Watchtower\r\n - Bannermist Tower\r\n - Peaks Shade Tower\r\n - South Skybound Watch (Exterior Only)\r\n - Nilheim\r\n - Rift Watchtower\r\n - Stendars Beacon\r\n - Refugees Rest\r\n\r\n   [i]Exceptions:[/i]\r\n\r\n - Abandoned Prison - Mostly interior, I don\\'t want to edit any interiors in this mod. However, the chest on the top of the tower outside is safe to store items.\r\n - Valteim Towers - A radiant quest location. To prevent any issues, I left the bandits alone, but changed the boss level chest to be non respawning. However, I believe the bandits won\\'t respawn unless you initiate a radiant quest which uses them.\r\n\r\n[b][i]Notes:[/i][/b]\r\n\r\n - No changes made to NPC\\'s at Stendars Beacon, as the only NPC\\'s there are friendly. The chest there is safe for storage, however.#\r\n\r\n[b][i]Installation:[/i][/b]\r\n\r\nDrop the .esp file into your Skyrim directory, [i]Skyrim Directory\\\\data\\\\[/i], and enable it in \\\"Data Files\\\" in the launcher. Or download with Nexus Mod Manager.\r\n\r\n[b][i]Uninstallation:[/i][/b]\r\n\r\n1 - Remove anything from the chests you want to keep, head to an interior and save.\r\n\r\n2 - Delete the .esp file from your Skyrim Directory; [i]Skyrim Directory\\\\data\\\\[/i].\r\n\r\n[b][i]Issues:[/i][/b]\r\n\r\nNone as far as I know. If you have any problems or requests, leave them in the comments and I\\'ll review them.\r\n\r\nI\\'ve only done a small number of towers for two reasons:\r\n\r\n 1 - If there\\'s any problems, it won\\'t take too long to fix, and\r\n 2 - I don\\'t want to waste my time creating this if noone wants to use it (I probably won\\'t use this, but I hope others will :P ).\r\n\r\n[b][i]Permissions:[/i][/b]\r\n\r\nIf you to add this to your own mod, or you want to tailor it to fit yours, drop me a PM before uploading your mod, just so I know what you\\'re planning on doing.\r\n\r\nPlease don\\'t reupload anywhere else, I only support the Nexus.\r\n\r\nFeel free to translate (though I don\\'t think that needs doing, unless you want to translate the description), just drop me a PM with your intentions.\r\n\r\nAnything else, just message me. I check the Nexus a few times per day, so I\\'ll get back to you quite quickly",
  "categoryId": "70",
  "version": "1.0",
  "author": "FinalEntity",
  "createdUnix": "1356380541",
  "updatedUnix": "1356380618",
  "containsAdultContent": false,
  "uploadedBy": "FinalEntity",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107340",
      "name": "FinalEntitys Nordic Tower Conversion",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "FinalEntitys Nordic Tower Conversion-28863-1-0.rar",
      "uploadedUnix": "1356380618",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f434a2b78a2991278787b416c9733c99262c29c94315a3d96eba9136bf1ed2e/analysis/1407321126/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FinalEntitys%20Nordic%20Tower%20Conversion-28863-1-0.rar?fid=107340&ttl=1535802506&ri=8192&rs=8192&setec=6f269027f33fc40f8de52851433e77b9"
    }
  ]
}