{
  "modId": 28861.0,
  "modName": "FinalEntitys Abandoned Stormcloak Outpost",
  "summary": "An update to my Imperial Outpost, changing it to a Stormcloak Outpost. Lore friendly, low level player home, with the basics.",
  "descriptionHtml": "Purpose\r\n\r\nThis mod aims to add something that seems to be lacking in Skyrim and the mod community:\r\nA small, simple, lore friendly starter home. I see many castles and estates, which is great if you\\'re rich and high level. But when you just start, you simply want a safe chest to store those weapons and armor that you\\'re planning\r\non selling later, right?\r\n\r\nAs a low level, you don\\'t need immediate access to smithing/alchemic/enchanting equipment. If that\\'s the sort of thing you want to do, you go elsewhere and find it. It\\'s a bit of a cheat to start the game with those things.\r\n\r\nDescription\r\n\r\nSo, this is a small, abandoned Stormcloak outpost in Falkreath Hold, next to the border crossing to Cyrodil, a short walk from Halldir\\'s Cairn. You\\'ll find a note inside the cabin, explaining why it\\'s abandoned. There will be a key hung up next to the door so that you can enter the basement.Inside the basement you\\'ll find a bed, chest, dresser, double weapon rack with two weapons, a table and a desk.\r\n\r\nThe basement is safe to store items. Some may notice this is a carbon copy of my Imperial Outpost, but I don\\'t see the point in a complete new mod when this fits the bill perfectly. So, if anyone has my old Imperial Outpost, this is the same, just a Stormcloak version. Oh, and because it\\'s the same, they are incompatible with each other, so don\\'t install both.\r\n\r\nUpdate History\r\n\r\n1.0 - Released\r\n\r\nRequirements\r\n\r\nCreated using the latest (1.8.151.0.7) update, so I strongly recommend you have this installed.\r\n\r\nUpdating\r\n\r\nIf you\\'re upgrading to a newer version of the mod:\r\n\r\n1 - Follow the uninstallation instructions below\r\n\r\n2 - Follow the installation instructions using the updated file\r\n\r\nInstall\r\n\r\n1 - Extract the .esp file from the downloaded archive and copy it into the ../Data/ folder in your Skyrim \r\n\r\ninstallation directory.\r\n\r\n2 - Once the file is in place, open your Skyrim launcher, go to \\\"Data Files\\\" and check the box next to \\\"FinalEntitys Abandoned Stormcloak Outpost.esp\\\"\r\n\r\nOR\r\n\r\nIf you\\'re using Nexus Mod Manager, click the \\\"Download with Manager\\\" button on the files page. Once it\\'s downloaded, double click the mod under the \\\"Mods\\\" tab. Then, open the \\\"Plugins\\\" tab and check that the box next to \\\"FinalEntitys Abandoned Stormcloak Outpost.esp\\\" is ticked.\r\n\r\nUninstall\r\n\r\n1 - Remove any items from the outpost that you want to keep, as removing the mod will remove those items.\r\n2 - Enter an indoor cell elsewhere (a tavern or another home, for example) and save your game.\r\n3 - Uncheck the \\\"FinalEntitys Abandoned Stormcloak Outpost.esp\\\" box in NMM or the launcher.\r\n4 - Delete the \\\"FinalEntitys Abandoned Stormcloak Outpost.esp\\\" file from the ../data/ folder in your Skyrim installation directory.\r\n\r\nBugs\r\n- You may find when you enter the basement that the weapons are on the floor, not the racks. If this is the case, leave the basement then enter again.\r\n\r\n- The bed DOES NOT give the player a \\\"Well Rested\\\" bonus, only a \\\"Rested\\\" bonus. As of current, I don\\'t know how to fix this issue. If anyone knows, please let me know, thanks :)\r\n\r\nDisclaimer\r\n\r\nYou use this mod at your own risk. I do not accept responsibility for any game or system malfunctions or breakages caused by this mod, directly or indirectly.\r\n\r\nPermissions\r\n\r\nYou\\'re free to picture my mod in any screenshots of yours, but please give credit.\r\n\r\nIf you would like to add my mod as part of your own, just ask for permission first.\r\n\r\nHowever, you cannot re-upload this mod and claim it as your own. ",
  "categoryId": "67",
  "version": "1.0",
  "author": "FinalEntity",
  "createdUnix": "1356375605",
  "updatedUnix": "1356375668",
  "containsAdultContent": false,
  "uploadedBy": "FinalEntity",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107327",
      "name": "FinalEntitys Abandoned Stormcloak Outpost",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "FinalEntitys Abandoned Stormcloak Outpost-28861-1-0.rar",
      "uploadedUnix": "1356375668",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f4be43c6fb09470a6d4052aba904d0d0985a6ae0577905fb4b3df657b4e42e7d/analysis/1407321003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FinalEntitys%20Abandoned%20Stormcloak%20Outpost-28861-1-0.rar?fid=107327&ttl=1535802502&ri=8192&rs=8192&setec=48250e775b52094194e68e7cf9e92bc5"
    }
  ]
}