{
  "modId": 28944.0,
  "modName": "Tame The Beasts of Skyrim",
  "summary": "Tame The Beasts of Skyrim gives you the ability to tame any beast in the world of skyrim and making them your follower, feed them, name them, love them.\r<br />",
  "descriptionHtml": "[line]\r<br />[line]\r<br />\r<br />[center][size=3][b][Color=yellow]&#33;&#33;&#33;[/color] [color=Orange]Tame[/color] [color=orangered]the[/color] [color=crimson]Beasts[/color] [color=mediumvioletred]of[/color] [color=slateblue]Skyrim[/color] [color=royalblue]II[/color] [color=darkcyan]has[/color] [color=darkgreen]been[/color] [color=green]finally[/color] [color=lawngreen]released[/color] [color=yellow]&#33;&#33;&#33;[/color][/b][/size]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50698/?] &gt;&gt; Get it here &lt;&lt; [/url]\r<br />\r<br />Please update to the [url=http://www.nexusmods.com/skyrim/mods/50698/?]new version[/url]. We don´t support Tame the Beasts of Skyrim any longer.\r<br />If you have any problems or questions do not hesitate to contact us.\r<br />\r<br />- [i]hfiani, TheSkoomaKing and myriliam[/i]  \r<br />[/center]\r<br />[line]\r<br />[line]\r<br />\r<br />...But please use the comment section of Tame the Beasts of Skyrim II. I only come here to re-direct people. As said... this mod is no longer supported since the new one has been released. \r<br />\r<br />Really.\r<br />\r<br />Yeah, I´m serious :P\r<br />\r<br />If you haven´t noticed yet... don´t download this mod. Get [url=http://www.nexusmods.com/skyrim/mods/50698/?] this one [/url] instead.\r<br />\r<br />[i]- myriliam[/i]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center][img] http://www.fildirekt.se/dl/1356645968.png [/img][/center]\r<br />MADE BY: TheSkoomaKing & hfiani\r<br />Requires newest version of SKSE to work:\r<br />http://skse.silverlock.org/\r<br />Latest Version 2.4.3\r<br />\r<br />Remember to like us on [url=http://www.facebook.com/pages/Theskoomaking-Productions/510725382328603?skip_nax_wizard=true]Facebook&#33;[/url]\r<br />\r<br />Please read the description before commenting&#33; Thank you&#33;\r<br />\r<br />[color=red]TO ANYONE UPDATING FROM 1.3 or lower up to 2.0 and up. BEFORE you install all the new material, you must abandon your beast, and then type the following lines in the console:\r<br />\r<br />stopquest tamebeastfollowerquest\r<br />\r<br />and then do a clean save without the mod, THEN download and play&#33;\r<br />[/color]\r<br />\r<br />[color=green]Upgrading from V2.0 and above,  DOES NOT require any uninstallation or clean save.[/color]\r<br />\r<br />[color=green] Thank you for endorsing&#33;\r<br />Don&#39;t forget to vote for mod of the month&#33;\r<br />\r<br />Please feel free to add your own images of you and your tamed Beast&#33;\r<br /> [/color] \r<br />\r<br />[youtube]tG1xt1RV3qE[/youtube]\r<br />Thank you Magic32 for reviewing our newest update in Skyrim Mod Rates. Awesome video&#33;&#33;\r<br />\r<br />[youtube]R_pxdr0SZkc[/youtube]\r<br />Thank you Brodual for reviewing my mod in Skyrim Mod Spotlights&#33; :)\r<br />\r<br />Unfortunately the features in this video is outdated, so anyone who wants to do a review of the mod with the new features is very welcome to do so&#33; :)\r<br />\r<br />[color=#6699FF]===========================================================================================================[/color]\r<br />[img]http://www.fildirekt.se/dl/1356617107.png[/img]\r<br />\r<br />This mod will give you the ability to tame any beast you want in the game. And with the newest update and thanks to hfiani you can now tame ANY beast from ANY mod or DLC you want. \r<br />\r<br />First, you will find the Taming Books, at the Drunken Huntsman in Whiterun, take the books and learn them.\r<br />\r<br />You need to damage the creature you want to tame considering their HP and level. This goes for all beasts. so you will need to check with the beast information spell, you will know how much stamina it will take, and if the stamina is not enough, how much you must damage the beast;s health in order to tame it.\r<br />\r<br />The mod has been reworked quite a bit and for now there is no Feed spell, but however, here is what is new in the newest update:\r<br />\r<br />- Tame any beast, from any mod or dlc.\r<br />\r<br />- Dismiss and a call spell which will let you tame up to a maximum of 10 beasts&#33; but you can only use one at a time&#33;\r<br />\r<br />- Set your beasts home, and when you use your dismiss spell he/she will be teleported there safe and easy&#33; \r<br />\r<br />- custom naming&#33; You can now name your beast ANYTHING you want&#33; \r<br />\r<br />- now you can tame Horses, ever wanted to take a wild horse back home, you can tame him now, and he goes back to the whiterun stables (near it actually) unless you specify otherwise.\r<br />\r<br />- any horse can be renamed whatever you want (even untamed)\r<br />\r<br />- named horses + tamed ones = 10 max. (tamed-named horses are considered as 1)\r<br />\r<br />- some horses are unique, but if you want to release them back into the wild WITHOUT losing them, release horse was done to avoid conflict, so it deletes the current tamed horse and creates a new instance, a clean one.\r<br />\r<br />- best part is, that it has been done to fit vanilla scripting, if you tame a horse he will walk away to the home you set for him UNLESS he is the last ridden horse. just like vanilla.\r<br />\r<br />- feeding pet reworked re-added\r<br />\r<br />- tame beast configuration and information\r<br />\r<br />- added a spell: command attack, you can let your pet start the ambush if you were a ranged hunter, so he can tank, and you attack.\r<br />\r<br />- tracking active pet\r<br />\r<br />For a full description please continue to to read down below.\r<br />\r<br />[color=#6699FF]===========================================================================================================[/color]\r<br />\r<br />[color=#FFFF00] NAMING YOUR BEAST: [/color]\r<br />\r<br />A name is a essential thing that will make YOUR beast unique. only your imagination sets the limit&#33; \r<br />\r<br />Once you use the spell called &#34; Choose Name &#34;, which you will get as soon as you tamed your first beast, you will then have to cast it on your tamed beast, then the console opens AND then you type in what kind of name you want it to have&#33; Once you have written your beasts name you simply press &#34; Enter &#34; and your beast will have its own unique name&#33;\r<br />\r<br />\r<br />[color=#6699FF]===========================================================================================================[/color]\r<br />[color=#FFFF00] Beasts of Skyrim all around the world&#33; [/color]\r<br />\r<br />Some NPC´s in the world will be accompanied by Tamed Beasts of Skyrim&#33; They will follow them arround and aid them in combat, some of the vanilla followers have a beast aswell&#33; Note that this is a work in progress and MUCH more NPC´s will be added to the list.\r<br />\r<br />[color=#FFFF00]Tame The Beasts of Skyrim Addons&#33;[/color] \r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/33688] Wild Horses&#33;[/url]\r<br />- This mod adds wild horses all around skyrim&#33; with more than 250+ respawning handplaced horses for you to tame&#33;\r<br />- Adds TWO new stand alone horse types which are also scattered across the world for you to tame&#33;\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/34843] Predators&#33;[/url]\r<br />- This mod adds wild animals all around skyrim&#33; a lot of ferocious beasts for you to tame\r<br />\r<br />\r<br />[color=#FFFF00]Recommended Mods[/color] \r<br />\r<br />This is a list of some of our favorite animal mods. all these beasts are able to tame&#33; \r<br />\r<br />\r<br />Moonpath to elsweyr&#33; which adds a large amount of new creatures for you to tame&#33;\r<br />[url=http://skyrim.nexusmods.com/mods/9782] Moonpath to Elsweyr&#33;[/url]\r<br />\r<br />\r<br />Prides of Skyrim&#33; Which adds Lions,Lioness and Panthers to the game for you to tame&#33;\r<br />[url=http://skyrim.nexusmods.com/mods/12647] Prides of Skyrim&#33;[/url]\r<br />\r<br />\r<br />Pets of skyrim&#33; which adds cute dogs and cats to the game for you to tame&#33;\r<br />[url=http://skyrim.nexusmods.com/mods/17424] Pets of Skyrim&#33;[/url]\r<br />\r<br />\r<br />Tropical Skyrim -- A Climate Overhaul which adds alot of new beasts for you to tame&#33;\r<br />[url=http://skyrim.nexusmods.com/mods/33017/] Tropical Skyrim [/url]\r<br />\r<br />SkyTEST - Realistic Animals and Predators&#33; a huge and very awesome overhaul for animals, and even adds baby pets for you to tame&#33;&#33;\r<br />[url=http://skyrim.nexusmods.com/mods/10175] SkyTEST - Realistic Animals and Predators[/url]\r<br />\r<br />[color=red] NOTE:[/color] remember that you can tame any beast, not just from mods listed above. And to modders, if you want to be able to tame YOUR own created beast, all you need to do is simply place a keyword in the race, called &#34; ActorTypeAnimal&#34;  or &#34;MagicNoInvisibility&#34; or &#34;MagicNoReanimate&#34; or &#34;MagicNoDistintegrate&#34; :)\r<br />\r<br />[color=#6699FF]===========================================================================================================[/color]\r<br />\r<br />[color=#FFFF00] RARE BEASTS: [/color]\r<br />\r<br />\r<br />The First rare beast has been sighted in Skyrim&#33; The Sabrecat Ravarii. He is hard to find and very strong so be carefull if your trying to tame him. \r<br />\r<br />When it comes to rare beasts, the only help to find them will be a book with a possible location on where the rare beasts might be. Ravarii is but the first rare beasts,and more are incoming&#33;\r<br />\r<br />The rare beasts are under construction and a huge amount of them will be added in the nearest future&#33;\r<br />\r<br />[color=#6699FF]===========================================================================================================[/color]\r<br />\r<br />[color=yellow]Multiple Beast System[/color]\r<br />\r<br />since there is so many beasts out there, it should be considered a crime only to be able to tame one at a time&#33; therefore, you can now have a total of 10 beasts&#33; however you can only use one at a time, and the rest must be dismissed using the dismiss spell, whenever you want to use another one of your tamed beast you simply use the &#34; Take Beast &#34; spell.\r<br />\r<br />[color=#6699FF]===========================================================================================================[/color]\r<br />\r<br />[color=yellow]Feeding and Happiness Systems + Petstore[/color]\r<br />\r<br />now you can find a new petstore near the stables, you enter there. you can either buy treats to feed your pets, or sell your current pet. one you have bought some treats (considering what i will right later) you can feed your beasts. so your beasts will be happy if you feed them, this is where the happiness comes. with happiness comes energy and with energy comes speed. you can check the tamed beast&#39;s information using the information spell. it will show you how much he is fed and how much is his max feeding and his current happiness. beware a 50% happiness means nothing changes less than that will slow him down, more will speed him up.\r<br />\r<br />treats are distributed like that: large = 500 feeding points, medium = 150 feeding points, small = 10 feeding points.\r<br />max feeding meter = max health (yeah that simple) \r<br />current feeding meter has nothing to do with current health.\r<br />but you cannot over feed your pet, it means that a chicken having 20 health cannot be fed with medium treats. sightly overfeeding is ok.\r<br />each 24 hours the feed meter drops by 1/5 from the max feeding. but we made it so it updates every few moments considering what you do (if you stand still it  won&#39;t do anything) so it is not realtime\r<br />\r<br />the petstore lady holds two conversation lines, you can have the configuration spell if missing, and you can start the beast tracking system.\r<br />\r<br />[color=#6699FF]===========================================================================================================[/color]\r<br />\r<br />[color=yellow]Spells[/color]\r<br />\r<br />Currently there is 3 sets of spells: Beast spells, Horse spells and Misc spells.\r<br />\r<br />Beast Spells: Tame beasts (this one will allow you to tame any beast of skyrim and/or any magical creature), Dismiss beast (as it says you send your pet to his home point), Take Beast (you tell him to leave his home point and come with you), Abandon Beast (this will forever remove the pet from both you pet team and the game,so be careful), Command Attack (this will make your active pet start the combat with the actor you shot the spell at), Set Beast Home (you set the beast home point to your current location)\r<br />\r<br />Horse Spells: Tame Horse (this one will allow you to tame any horse of skyrim better not use it on vanilla stable horses), Release Horse (this will remove the horse from your team, and return its name to his default), Set Horse Home (you set the horse home point to your current location, this is where they go when not being the last ridden)\r<br />\r<br />Misc Spells: Tame Beast Information (this will give you information about the beast, if untamed, it tells you how much you need stamina and how much you need to damage his health to tame him, if tamed, you will see instead the feeding and happiness meters), Tame Beast Configuration (a lesser power, used to set essential pets as on/off, npc pets as on/off, and refresh system where it refreshes everything in tame beast, including readding the missing spells.and returning all in order again), Choose name (well who doesn&#39;t like to name his pet, well here you go, afully customized naming procedure, you can now name him whatever you want. PS: naming a horse without taming it is possible but it takes a slot in the taming horse capacity)\r<br />\r<br />[color=#6699FF]===========================================================================================================[/color]\r<br />\r<br />VERSION HISTORY&#33;\r<br />V2.4.3\r<br />\r<br />- Added tracking arrow, now you can talk to the lady in the petshop and ask from her to track your pet, then you will have a quest started called. (still a beta and not fully tested)\r<br />- fixed the configuration menu loop\r<br />- changed the price of the treats by 10 times lower.\r<br />\r<br />V2.4.2\r<br />\r<br />- Added Refresh button, whenever you have something wrong use configuration spell and refresh. if this does not work for you fast, and rather very slow, it means your save is bloated.\r<br />- Talk to the petshop lady so you can get the configuration spell if it is missing, from there, use it and click refresh. you will get the information spell and command attack. and if it will update the pet&#39;s location.\r<br />- bug fixes\r<br />\r<br />V2.4.1\r<br />\r<br />- bug fixes of the abandon/selling beast.\r<br />- fixed something in feeding spell\r<br />- added more conditions so that pet follows yuo more into dungeons.\r<br />\r<br />V 2.4\r<br />\r<br />- Feeding spell readded, reworke\r<br />- Choose Name spell reworked, optimized\r<br />- bugfixes\r<br />\r<br />V 2.3.2\r<br />\r<br />- Compatibility added to Real Wildlife of Skyrim\r<br />- Added an ESP file patched for Real Wildlife of Skyrim. (no worries i got permission)\r<br />- if you have already tamed beasts not having a name, now this update is supposed to be able to make your pet have the &#34;talk&#34; again without re-taming.\r<br />\r<br />V 2.3.1\r<br />\r<br />- Fixed the Naming tag bug. now you can see the name again.\r<br />\r<br />V 2.3\r<br />\r<br />- Taming beast reworked to fit a little of reality, now you tame of what you have of stamina. the stamina is calculated considering both level and health of the beast AND yours as well. the more his level and health are, the more stamina you need, when the needed stamina is higher than what you currently have, the beast is too powerful for you. also when your health is low, it means naturally that you will need even more stamina to tame the beast. common sense no?\r<br />- New configuration menu (and no not MCM) to set pets essential on/off, and to turn NPC pets on and off. PS: sometimes you see NPC pets set as off, but they  are always there, just turn it on, wait for them to spawn near their masters, then turn it off again.\r<br />- New Information spell, it gives you the information needed on any beast, tamed or not, mainly used to know if a certain beast is good for taming and how much stamina it needs and if you cannot tame it at the current state, how much maximum health the beast must have in order for it to be tamed.\r<br />- Bug fixes like invisible wolf, naming spell reworked slightly. i tested it myself now while naming not even 1 fps was dropped.\r<br />- The cave of Ravarii is moved a little bit to make the Ebony warrior appear properly in last vigil.\r<br />- NEW FEATURE: magical creature now tamable\r<br />\r<br />[color=red]PS: i noticed that summoned creature can be tamed, so until i find something to fix that, please do not tame summoned creatures.[/color]\r<br />\r<br />V 2.2.1\r<br />\r<br />- NO MORE DAWNGUARD REQUIREMENT\r<br />- Petstores completely removed from cities\r<br />- removed all mistakenly modified things. in order to make things most compatible\r<br />- horse naming procedure fixed. now those having their horses named: pet, after the exit and start of the game, now without renaming again, it will rename them the old names you gave them\r<br />- many bug fixes.\r<br />\r<br />V 2.2\r<br />\r<br />- new spells called &#34; Tame Horse &#34;, Set Horse Home &#34;, &#34; Release Horse &#34;.\r<br />- 100% compatible with convenient horses\r<br />- Name bug fix from 2.1\r<br />- increase a little bit the minimum distance from you to avoid pushing.\r<br />\r<br />V 2.1\r<br />\r<br />- this fixed the bug of the pet following you into dungeons. \r<br />- removes the mammoth and the wolf which are meant for beta testing.\r<br />- this make a maximum compatibility with UFO, AFT or any mod that modifies Dialoguefollower \r<br />- other minor fixes\r<br />\r<br />\r<br />V 2.0 \r<br />- Tame the beasts of Skyrim Completely REDONE\r<br />- Custom naming\r<br />- Dismiss and multiple beast system&#33;\r<br />- tame any animal or creature from any mods or any dlc&#33;\r<br />\r<br />V 1.3 \r<br />Includes the Following:\r<br />- Dragons&#33;\r<br />- Prides of Skyrim made Compatible with Tame the Beasts of Skyrim&#33;\r<br />- Tame Beast Spell Redone\r<br />- The annoying wolf bug has finally been fixed&#33; You can now tame any wolf without it being turned to a icewolf.\r<br />- Beasts of Skyrim all around the world&#33;\r<br />- Once you tame a beast there is a random chance that its male or female. ( released but not yet finshed)\r<br />\r<br />V 1.2\r<br />Including the Following\r<br />- Petstores of Skyrim\r<br />- Several bugfixes, including the one where you could actually get ALL the best friend perks by only having one beast.\r<br />\r<br />V 1.1\r<br />Including the Following:\r<br />- every Dawnguard creature added to the list of tameable beasts.\r<br />- Several bugfixes\r<br />- The Bug with the foxes vanishing has been fixed and foxes are now available for taming once more&#33;\r<br />- You can now change names on Sabre cats aswell ( forgot to list them in the script )\r<br />- Rabbits now gives you an unique spell&#33;\r<br />- Chickens and Magic Anomaly has been added to the list of tamable beasts. \r<br />- Introducing the first Rare Beast.\r<br />\r<br />\r<br />\r<br />[color=#6699FF]===========================================================================================================[/color]\r<br />\r<br />\r<br />\r<br />[img]http://www.fildirekt.se/dl/1356571710.png[/img]\r<br />\r<br />- Leveling system. the ultimate and most likely final step of this mod&#33;\r<br />\r<br />- Feeding spell optimized. and happiness expanded.\r<br />\r<br />- Selling Tamed Beasts. A new way of making money&#33; - [color=green] DONE&#33;&#33;&#33; [/COLOR]\r<br />\r<br />- Petshops of skyrim Revisted&#33; - [color=Yellow] Partially DONE&#33; [/COLOR]\r<br />\r<br />- Feeding Your beast Revisted&#33; - [color=green] DONE&#33;&#33;&#33; [/COLOR]\r<br />\r<br />- More Rare Beasts. one of each race who will be spread across Skyrim for you to find and tame.\r<br />\r<br />- LEVELING SYSTEM&#33;&#33; [color=red]Coming soon[/color]\r<br />\r<br />- Beast Breeding&#33;&#33; [color=red]Coming soon[/color]\r<br />\r<br />- bugfixes\r<br />\r<br />We are open for suggestions, so if you feel like there is something you want to see in this mod, please write in the comment section or PM me for a quicker reply ^^\r<br />\r<br />[color=#6699FF]===========================================================================================================[/color]\r<br />\r<br />[img]http://www.fildirekt.se/dl/1356577658.png[/img]\r<br />\r<br />This mod would be dead if it weren&#39;t for hfiani, a really great modder&#33; he made the custom naming system, and pretty much everything you see in update 2.0&#33; i  cannot thank him enough for what he did :) therefore he is now also mod author of this mod, so you can go ahead and ask him questions aswell :)\r<br />\r<br />\r<br />- I would like to give a special thanks to Steve40 & Eckss at the Nexus forums for helping me with some of the Scripting.\r<br />\r<br />- Bethesda Softwork for creating this wonderful game and the creationkit.\r<br />\r<br />- towawot for giving us permission to use the main idea of his renaming mod\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/35914/] Typing rename spell for Object [/url]\r<br />\r<br />- Myself.. for being so creative xD",
  "categoryId": "65",
  "version": "3.0",
  "author": "TheSkoomaKing and Hfiani",
  "createdUnix": "1356550300",
  "updatedUnix": "1393279377",
  "containsAdultContent": false,
  "uploadedBy": "TheSkoomaKing",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107703",
      "name": "TameBeastsV1dot0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2918",
      "fileName": "TameBeastsV1dot0-28944-1-0.rar",
      "uploadedUnix": "1356550470",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e05a016b010404b2d11c992086e0c616afda9ab14207b2b33ab6894113d37164/analysis/1407323405/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TameBeastsV1dot0-28944-1-0.rar?fid=107703&ttl=1535802669&ri=8192&rs=8192&setec=d45f8a5a37c8cd7983be9fd57eaa59ff"
    },
    {
      "fileId": "107849",
      "name": "Version 1dot1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "21334",
      "fileName": "Version 1dot1-28944-1-1.rar",
      "uploadedUnix": "1356619624",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/aeaec846561991ec56d48d1d7dadcb954b8e26dc7c0b5d1e579103fd2d82dbbd/analysis/1407324493/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%201dot1-28944-1-1.rar?fid=107849&ttl=1535802670&ri=8192&rs=8192&setec=adfcc6a4704a92036b5122f8e481bba8"
    },
    {
      "fileId": "108184",
      "name": "TTBOSV1dot2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28534",
      "fileName": "TTBOSV1dot2-28944-1-2.rar",
      "uploadedUnix": "1356755624",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/378b682b28b8d6a0313fffb9d4bf57bbb230cf231aefd691136b88d2b1f8682e/analysis/1407326842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TTBOSV1dot2-28944-1-2.rar?fid=108184&ttl=1535802671&ri=8192&rs=8192&setec=a1e74b55cbeb79d79e0e9bcbf1af9d52"
    },
    {
      "fileId": "109199",
      "name": "Version 1dot3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14389",
      "fileName": "Version 1dot3-28944-1-3.rar",
      "uploadedUnix": "1357181655",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/97ba0ed1dfe66a1745ad928add1fcbd5fdf457e6e1daafab269df5454af63850/analysis/1407334394/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%201dot3-28944-1-3.rar?fid=109199&ttl=1535802671&ri=8192&rs=8192&setec=698a9a0c254714c794b1460164ee9270"
    },
    {
      "fileId": "109435",
      "name": "Version 1dot3 NO petstores",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14389",
      "fileName": "Version 1dot3 NO petstores-28944-1-3.rar",
      "uploadedUnix": "1357275680",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/988ad3d016c498f4db003dfe0cc369aeef91b8fe7f633982849745e504fdd4d1/analysis/1407335899/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%201dot3%20NO%20petstores-28944-1-3.rar?fid=109435&ttl=1535802671&ri=8192&rs=8192&setec=11552fe0dc4f65d8f8edb9e209ecef86"
    },
    {
      "fileId": "1000017262",
      "name": "Tame The Beasts of Skyrim 2",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14053",
      "fileName": "Tame The Beasts of Skyrim 2-28944-2-0.rar",
      "uploadedUnix": "1363213525",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/b8d1ff21302d6a8888031bdf8f9a0746ffe4acfcd6a1d16981d23b01943d8b0a/analysis/1407468399/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tame%20The%20Beasts%20of%20Skyrim%202-28944-2-0.rar?fid=1000017262&ttl=1535802672&ri=8192&rs=8192&setec=22ad3bd13915c28073fc40ca7c01a338"
    },
    {
      "fileId": "1000018277",
      "name": "Tame The Beasts of Skyrim 2dot1",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14054",
      "fileName": "Tame The Beasts of Skyrim 2dot1-28944-2-1.rar",
      "uploadedUnix": "1363548241",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/c10567ba80f42359dd0dde9defb7ce4669f20c86dc1316f79d0855df16786736/analysis/1407474516/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tame%20The%20Beasts%20of%20Skyrim%202dot1-28944-2-1.rar?fid=1000018277&ttl=1535802673&ri=8192&rs=8192&setec=d594259302bb98372f07abfc1c09050a"
    },
    {
      "fileId": "1000019047",
      "name": "Tame The Beasts of Skyrim 2dot2",
      "version": "2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14037",
      "fileName": "Tame The Beasts of Skyrim 2dot2-28944-2-2.rar",
      "uploadedUnix": "1363827196",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/9beb88d4d10c11eca83f5f9e793e28ae4dddb32ac15780ef7d07ad842f223b17/analysis/1407479840/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tame%20The%20Beasts%20of%20Skyrim%202dot2-28944-2-2.rar?fid=1000019047&ttl=1535802673&ri=8192&rs=8192&setec=6b5069cdb897d8e77994dec62863e327"
    },
    {
      "fileId": "1000021626",
      "name": "Tame Beasts Of Skyrim 2_2_1",
      "version": "2.2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "33479",
      "fileName": "Tame Beasts Of Skyrim 2_2_1-28944-2-2-1.rar",
      "uploadedUnix": "1364804643",
      "modVersion": "2.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/b9e4407d7707e28e7960c7dab19d5e0a70561fdf84f8462b07d330b99d57ab53/analysis/1407499240/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tame%20Beasts%20Of%20Skyrim%202_2_1-28944-2-2-1.rar?fid=1000021626&ttl=1535802674&ri=8192&rs=8192&setec=8f24af307b31c553f20a7159b583d875"
    },
    {
      "fileId": "1000024638",
      "name": "Tame Beasts Of Skyrim 2_3",
      "version": "2.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "39237",
      "fileName": "Tame Beasts Of Skyrim 2_3-28944-2-3.rar",
      "uploadedUnix": "1366052428",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/892fec0699ccf0cd0157b665e7ad6302e4b9b18e15323c992e896d04b45a2cbe/analysis/1407524015/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tame%20Beasts%20Of%20Skyrim%202_3-28944-2-3.rar?fid=1000024638&ttl=1535802675&ri=8192&rs=8192&setec=0e20fe3fe4e5a4581d05aae5d157f683"
    },
    {
      "fileId": "1000025248",
      "name": "Real Wildlife of Skyrim",
      "version": "x",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "635",
      "fileName": "Real Wildlife of Skyrim-28944-x.rar",
      "uploadedUnix": "1366361990",
      "modVersion": "x",
      "virusScanUrl": "https://www.virustotal.com/file/f0900f41e323acddb143a5d7ba872bc867a7ede150094624fc5fa7df6712901e/analysis/1407529408/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Real%20Wildlife%20of%20Skyrim-28944-x.rar?fid=1000025248&ttl=1535802676&ri=8192&rs=8192&setec=1d3ef05488305a9b757b33d728f8da61"
    },
    {
      "fileId": "1000025249",
      "name": "Tame Beasts 2-3-2",
      "version": "2.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "155",
      "fileName": "Tame Beasts 2-3-2-28944-2-3-2.rar",
      "uploadedUnix": "1366362294",
      "modVersion": "2.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/e6765e823c3415c5843137df22d56590bd0ddac5528cc813cb891301d98fcf2e/analysis/1407529409/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tame%20Beasts%202-3-2-28944-2-3-2.rar?fid=1000025249&ttl=1535802676&ri=8192&rs=8192&setec=f7359300192cfd2d2fa7d4ef7ff4be27"
    },
    {
      "fileId": "1000030828",
      "name": "Tame Beasts Of Skyrim 2_4",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "43115",
      "fileName": "Tame Beasts Of Skyrim 2_4-28944-2-4.rar",
      "uploadedUnix": "1369159962",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/f6eed6342dce47f7479fab630a4a7c1d8970e44c803fed7cfc4c0cdaa692c467/analysis/1407577042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tame%20Beasts%20Of%20Skyrim%202_4-28944-2-4.rar?fid=1000030828&ttl=1535802677&ri=8192&rs=8192&setec=4ba260e2564cf744c33e872b468065a2"
    },
    {
      "fileId": "1000031883",
      "name": "Tame Beasts Of Skyrim 2_4_1",
      "version": "2.4.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "148",
      "fileName": "Tame Beasts Of Skyrim 2_4_1-28944-2-4-1.rar",
      "uploadedUnix": "1369777556",
      "modVersion": "2.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/68420ae84f10da1ceb52b7ac8f9526aa01442ca094396014d2a2f1abae361f6f/analysis/1407584831/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tame%20Beasts%20Of%20Skyrim%202_4_1-28944-2-4-1.rar?fid=1000031883&ttl=1535802677&ri=8192&rs=8192&setec=0b154f0ecd687bb238432f3a02baf79e"
    },
    {
      "fileId": "1000033847",
      "name": "Tame The Beasts of Skyrim version 2dot4dot2",
      "version": "2.4.2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "165",
      "fileName": "Tame The Beasts of Skyrim version 2dot4dot2-28944-2-4-2.rar",
      "uploadedUnix": "1370983381",
      "modVersion": "2.4.2",
      "virusScanUrl": "https://www.virustotal.com/file/6d0ba6b887cefacc8eb9accbf7c3621217f3615fb2179b2c6e85bf9bf4213ab5/analysis/1407600545/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tame%20The%20Beasts%20of%20Skyrim%20version%202dot4dot2-28944-2-4-2.rar?fid=1000033847&ttl=1535802677&ri=8192&rs=8192&setec=18bb73c418b3c26f264382f39220f57d"
    },
    {
      "fileId": "1000034776",
      "name": "Tame Beasts 2-4-3",
      "version": "2.4.3",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "169",
      "fileName": "Tame Beasts 2-4-3-28944-2-4-3.rar",
      "uploadedUnix": "1371563654",
      "modVersion": "2.4.3",
      "virusScanUrl": "https://www.virustotal.com/file/dae2deae710b6a0dbd29e4cbd17f9e8c990a9f7178ff64e06a34a965efe61fbf/analysis/1407608291/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tame%20Beasts%202-4-3-28944-2-4-3.rar?fid=1000034776&ttl=1535802678&ri=8192&rs=8192&setec=7109f8085fc97df902911dcb798c42f1"
    },
    {
      "fileId": "1000098617",
      "name": "Tame the Beasts of Skyrim II is released",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Tame the Beasts of Skyrim II is released-28944-3-0.zip",
      "uploadedUnix": "1393279377",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/f8ef81f216c91e8536b17b1ee68bcf8251faa5a1a3062bac01effac3cbb9a31b/analysis/1407948804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tame%20the%20Beasts%20of%20Skyrim%20II%20is%20released-28944-3-0.zip?fid=1000098617&ttl=1535802678&ri=8192&rs=8192&setec=762633d59ffa928f3558ae8b20b65ba2"
    }
  ]
}