{
  "modId": 28960.0,
  "modName": "Whiterun House-With Everything for Everyone",
  "summary": "The mod adds a player home outside Whiterun with a beautiful exterior and wonderfully designed interior. It has a flower garden, a food garden, a cow and two chickens, a desk with alchemy and enchanting capabilities, a forge and so much more...",
  "descriptionHtml": "NOTICENOTICENOTICENOTICE\r<br />I can&#39;t believe I made the first version when I was 12. Looks like I might be coming back to this one, &#39;cause I have the summer and a can-do attitude :)\r<br />If I come up with an update it will be on another page and this one will be officially retired. Download and tell me what I should do; I&#39;ll keep it in mind when I&#39;m working on it&#33;\r<br />\r<br />Thanks,\r<br />~Alanna\r<br />\r<br />.........::::::The Whiterun House-With Everything for Everyone::::::..........\r<br />\r<br />Thank you for coming to look at my first nexus mod, please endorse and download if you like it&#33;\r<br />Comment with your opinion&#33;\r<br />\r<br />.....:::Summary:::.....\r<br />\r<br />This mod will add a player home outside Whiterun. The main idea of this mod is that it has everything you could need in a home; every species of plant, mushroom and farm animal. It also had every misc. plant/harvestable item, like clams, slaughterfish egg sacs, bird nests and special algae, so you don&#39;t need to forage in the wild unless you want to go hunting for elk or other wild animals. It has helpful storage for every type of item without getting too OCD. It also has every crafting zone covered, like alchemy, enchanting, cooking, and an entire forge.\r<br />\r<br />However, it is not very big at all, considering it is jam-packed with features. I tried to make the home... Homey. And not the size of a monstrous castle with three armories and seven libraries.\r<br />\r<br />.....:::Recommendations:::.....\r<br />\r<br />-http://skyrim.nexusmods.com/mods/24043  -Download  CaptainLhurgoyf&#39;s CL Cities Whiterun Exterior Improvement mod. It&#39;s fully compatible with my mod.  \r<br />-http://skyrim.nexusmods.com/mods/23249  -Download CaptainLhurgoyf&#39;s CL Cities Whiterun Interior Improvement mod. It&#39;s nice to have the interior and exterior of Whiterun be matching, and of course this mod is compatible with my mod and the exterior mod as well.\r<br />\r<br />.....:::Important Information:::.....\r<br />\r<br />There is a section below dealing with all known issues/bugs, so check it out if you want to know how close I am to being done with updating this mod. If you think I don&#39;t know about an issue in my mod or my mod page on this site, tell me about it in the comments section, even if it is just a grammar or spelling mistake. I&#39;ll try to get on it as soon as possible.\r<br />\r<br />Notice: The house key is situated in front of the front door. You already own this home, and do not have to buy it from the Jarl&#39;s Assistant like you would for the  Breezehome.\r<br />\r<br />.....:::Description:::.....\r<br />\r<br />This mod will add a player home outside Whiterun whose features include:\r<br />-A flower garden with two of every species of flowers (not as many as you might think)\r<br />-A joined mushroom garden with one of every species of mushrooms (again, not as many as you might think)\r<br />-An open animal pen with two cows and four chickens\r<br />-An empty stable for two horses\r<br />-A woodchopper&#39;s block (if you need firewood)\r<br />-A food garden with eight of every food-like plant (leek, cabbage, gourd, potato, and wheat)\r<br />-A beautiful tree in the front of the house\r<br />-A sap spigot in that tree\r<br />-Two harvest-able bird nests\r<br />-Two (static) beehives with honey (if you want to harvest honey from a beehive there is one in a nearby tree)\r<br />-A pond with all species of fish\r<br />-All species of insects\r<br />-A windmill\r<br />-Locked doors that can only be opened with the key to the home (so no one can get in, of course)\r<br />-A perfect sized house with enough room for everything you need and nothing more\r<br />-A kitchen with a cooking spit and a hanging rack for all hanging rack items\r<br />-Lots of seating around the house\r<br />-One half full display-type bookcase (and you can empty it if you want)\r<br />-Three display-type shelves\r<br />-Three large noble display cases (T67&#39;s, check them out: http://skyrim.nexusmods.com/mods/15997)\r<br />-A dining room, already set up for dinner (with real life cutlery and dish arrangement)\r<br />-A beautiful faux balcony over-looking the dining room\r<br />-Two entrances (one in the front and another in the back)\r<br />-A desk with both crafting tabletops (alchemy and enchanting)\r<br />-Separate storage containers for armor, clothing, other apparel (like shoes and hats), jewellery, weapons, ammunition, fish and meat ingredients, fruits and vegetable ingredients, drinks, cooked food, other ingredients (like salt), alchemy ingredients, and potions (basically there is a spot for everything in the house)\r<br />-A bed\r<br />-High ceilings\r<br />-All noble furniture and noble dishes (but with dwemer forks, knives and spoons, because there are no noble sets of cutlery) so the whole house looks put together and elegant\r<br />-A basement containing a small armor and weapons section and two beds for companions\r<br />\r<br />.....:::How to Install for the First Time:::.....\r<br />\r<br />If you are installing for the first time, these are the steps you should follow:\r<br />1. Download the most updated main file (manually)\r<br />2. Verify that you have a program to extract the mod file, because it is compressed in a .rar format (If you have a program to extract the file, skip to step 4, if you don&#39;t, continue reading)\r<br />3. I like to use the trial version of winrar, a free program you can download on the winrar website: http://www.rarlab.com/download.htm, but you can get any program you want\r<br />4. Now that you have everything required to set this up, open your \\Data folder in your installed directory with windows explorer\r<br />5. Open up another windows explorer but this time in the folder containing my mod (usually it is under the user&#39;s downloads)\r<br />6. Right-click on my file and say extract to /My Home.rar (this will put the file in a folder of the same name)\r<br />7.  Click and drag the extracted Bethesda Plugin Data File into the /Data folder (if it asks for administrative permission, or permission to overwrite, say yes)\r<br />8. If there are meshes and textures in this version, enter the data folder in my mod and select both the meshes and textures folders\r<br />9. Then, click and drag them into the /Data folder of your installed directory (if it asks for administrative permission, or permission to overwrite, say yes)\r<br />10. Run the Skyrim launcher and click Data Files, then select my mod\r<br />11. Click &#34;Ok&#34; and then &#34;Play&#34;\r<br />12. Have fun in your new home&#33;&#33;&#33;\r<br />\r<br />.....:::How to Update the Mod:::.....\r<br />\r<br />If you are trying to update my mod to a newer version, these are the steps you should follow:\r<br />1. Download the most updated main file (manually)\r<br />2. Verify that you have a program to extract the mod file, because it is compressed in a .rar format (If you have a program to extract the file, skip to step 4, if you don&#39;t, continue reading)\r<br />3. I like to use the trial version of winrar, a free program you can download on the winrar website: http://www.rarlab.com/download.htm, but you can get any program you want\r<br />4. Now that you have everything required to set this up, open your \\Data folder in your installed directory with windows explorer\r<br />5. Open up another windows explorer but this time in the folder containing the updated mod (usually it is under the user&#39;s downloads)\r<br />6. Right-click on my file and say extract to /My Home.rar (this will put the file in a folder of the same name)\r<br />7.  Click and drag the extracted Bethesda Plugin Data File into the /Data folder (if it asks for administrative permission, or permission to overwrite, say yes)\r<br />8. If there are meshes and textures in this version, enter the data folder in my mod and select both the meshes and textures folders\r<br />9. Then, click and drag them into the /Data folder of your installed directory (if it asks for administrative permission, or permission to overwrite, say yes)\r<br />10. Run the Skyrim launcher and click Data Files, then select my mod\r<br />11. Click &#34;Ok&#34; and then &#34;Play&#34;\r<br />12. Have fun in your new home&#33;&#33;&#33;\r<br />\r<br />.....:::How to Uninstall:::.....\r<br />\r<br />If you are trying to uninstall any version(s) of my mod these are the instructions you need to follow:\r<br />1.  Locate my Bethesda Plugin Data File in your installed directory under /Data\r<br />2. Select the data file(s) you want to uninstall\r<br />3. Right-click while selected and click delete\r<br />4. If there were any meshes or textures with that version, locate them and delete them\r<br />5. Have fun&#33;&#33;&#33;\r<br />\r<br />P.S. Don&#39;t leave any of your items in the house or in any storage container, they will be permanently deleted.\r<br />\r<br />.....:::Known Issues/Bugs:::.....\r<br />\r<br />There&#39;s an issue with the grass floating, but it&#39;s incredibly easy to fix. It&#39;s essentially a problem with your settings being set to not load grass properly :) here&#39;s a link to a solution : http://www.creationkit.com/Floating_Grass_Fix\r<br />\r<br />There&#39;s also an issue with the Navmesh not allowing followers to walk properly. No fix for this, because I didn&#39;t finish it :)\r<br />\r<br />To-Do List\r<br />-Fix the Installation Guide\r<br />-Finish Navmesh\r<br />\r<br />More Ideas (for the future):\r<br />-Make windmill make flour\r<br />-Make beehives harvest honey\r<br />-Add an area with people sleeping (for vampires and werewolves)\r<br />-Add a shrine (of Mara?)\r<br />-Add an NPC vendor to live in basement.\r<br />\r<br />.....:::Version History:::.....\r<br />\r<br />Version 1.0: \r<br />-I Added the first version of my mod and waited for feedback\r<br />\r<br />Version 1.5:\r<br />-Removed stream heading to pond and moved pond to underneath the waterfall\r<br />-Moved windmill to a better spot (the entrance wasn&#39;t facing the front of the house and if it did it would be blocked by the house)\r<br />-Expanded the animal pen and flower garden into the space left by the windmill\r<br />-Removed the horse (his AI package data was just not mixing with the stable, causing him to jump on the roof and get the front half of his body through various walls)\r<br />-Added a more noticeable and convenient path from the Whiterun main gate to front door\r<br />-Added paths around the house leading to main areas like doors, gardens, the forge and the stable\r<br />-Removed two stable doors\r<br />-Expanded the animal pen even more, out into area previously unclaimed from the house and verified that they are not near any buildings to jump on\r<br />-Added two chickens and a cow (but only after all expanding was done, because there was no room, otherwise)\r<br />-Made sure that there was fencing all around the house to keep out wandering bandits (yes, that did happen&#33;)\r<br />-Lowered fish spawners (they used to show fish swimming around in the air above the pond)\r<br />-Added mist to the flower garden and more to the pond for aesthetic purposes\r<br />\r<br />Version 1.6:\r<br />-Fixed areas of extremely bright lights in house (now looks more somber)\r<br />-Removed the pet fox (he didn&#39;t act enough like a pet and it was also weird because he didn&#39;t have a food dish or a bed)\r<br />-Removed stray column\r<br />\r<br />Version 2.0:\r<br />-Added lanterns to the large pink tree\r<br />-Added lanterns to the stables\r<br />-Fixed pond kelp\r<br />-Fixed floating flowers\r<br />-Added more grass, flowers and trees to improve outdoor experience and privacy\r<br />-Fixed smelter problem\r<br />-Added a chest in the forge for materials\r<br />-Added forge clutter\r<br />-Added woodcutting clutter\r<br />-Added farm clutter\r<br />-Added three display cases (T67&#39;s, check them out: http://skyrim.nexusmods.com/mods/15997)\r<br />-Added three shelves\r<br />-Removed a bookcase\r<br />-Fixed bookcases and three shelves&#39; clutter\r<br />-Added container for soul gems on enchanting table\r<br />\r<br />Version 2.1:\r<br />-Fixed floating straw glitch\r<br />-Fixed broken bookcase glitch\r<br />\r<br />Version 2.5:\r<br />-Added navmesh\r<br />-Added brighter/more lanterns to exterior tree\r<br />-Fixed interior tree optical illusion\r<br />-Added woodcutter&#39;s axe to stable area\r<br />-Fixed windmill entrance\r<br />-Fixed floating staircase\r<br />-Fixed boundary terraforming\r<br />-Added clutter to office\r<br />-Made a fast travel button\r<br />-Added small armory and a few beds to make a basement\r<br />\r<br />Version 3:\r<br />-Added mine with all ores\r<br />-Fixed most of navmesh\r<br />-Fixed basement ladder problem\r<br />-Moved forge for mine entrance\r<br />-Added a small keypouch at main entrance (contains keys)",
  "categoryId": "67",
  "version": "3.0",
  "author": "a1anna",
  "createdUnix": "1356571744",
  "updatedUnix": "1356654255",
  "containsAdultContent": false,
  "uploadedBy": "a1anna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107762",
      "name": "MyHome",
      "version": "2.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "239",
      "fileName": "MyHome-28960-2-5.rar",
      "uploadedUnix": "1356572047",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/579738884aa16b5e90888c5bb0b3cd3323ca5c227f5d4306b70d4bce1cece8da/analysis/1407323824/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MyHome-28960-2-5.rar?fid=107762&ttl=1535802709&ri=8192&rs=8192&setec=d6bfbdb2de5fe4d226aef29106f54abc"
    },
    {
      "fileId": "107961",
      "name": "My Home",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "252",
      "fileName": "My Home-28960-3-0.rar",
      "uploadedUnix": "1356654255",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/4639f5d245d03ae555c35bcc6693cc42344db735e4b296d5c6b1f617d52d8ae5/analysis/1407325264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20Home-28960-3-0.rar?fid=107961&ttl=1535802710&ri=8192&rs=8192&setec=3d3ebb6d2eba3bd6cb21bb5fea5cf469"
    }
  ]
}