{
  "modId": 2897.0,
  "modName": "Joruuna - super hot Nord",
  "summary": "I\\'ve never fallen in love with pixels, but my girlfriend is jealous of this one.",
  "descriptionHtml": "Dark skinned, dark haired Nord girl, with a modified Old Norse name (only altered the spelling). Starts at lvl 1 just outside the tutorial cave.\r\n\r\nFace Mods used:\r\nBetter Females by Bella (http://www.skyrimnexus.com/downloads/file.php?id=2812)\r\n\r\nBody/Clothing:\r\nCalientes Female Body Big Bottom Edition (http://www.skyrimnexus.com/downloads/file.php?id=2666)\r\n\r\nTransparent short Nocturnal for Calientes CBBE (http://www.skyrimnexus.com/downloads/file.php?id=2766)\r\n\r\nEnjoy!\r\n\r\n-+= For all the roleplayers =+-\r\n   Hrafn was a Nord of a different breed. He enjoyed studying the arcane arts as well as trying to decode the puzzles of the long lost Dwemer and Aleid ruins. After serving a number of years as the court wizard in Markarth, he yearned for something more in life -and also wished to see the flora and fauna of more comfortable, and peaceful climes. And so, Twenty-seven years into the tired and bloody conflict of the 30 year war, he set out on a \\\"pilgrimage\\\", if you will, to seek the knowledge of wisemen in more distant provinces of Tamriel. After journeying to High Rock and finding himself a bit unwelcome, he travelled on toward Cyrodill to learn of the (now known as the \\\"Oblivion Crisis\\\") invasion of the Daedric and manifestation of Mehrunes Dagon into the plane of mortals. He learned much from the Mages Guild, and historians, of the life of Martin Septim- a common farmer, Unknown son of Uriel Septim and last born of Dragonblood- and the Champion of Cyrodill, who was pivotal in the closing of the Oblivion Gates and personally escorted Martin to the final battle with the \\\"King\\\" of Oblivion. He went on to travel to the distant land of Black Marsh, and found its denizens to be a proud and respectable people that are all too often misunderstood. After studying the various toxins and insects that could be found within the bogs, he set out yet again, in search of other great horizons. \r\n\r\n      His journeys took him through Elsweyr, where he learned that no lock, or pocket is safe from even the most mediocre of the Khajiit thieves and street urchins. He travelled on west through Valenwood and set sail on a merchant ship to the Elven isle of Summerset, where he befriended a wise, old High Elf named Alvanni, who taught him many great lessons in the art of Altmer magick and riddles. He learned the way of Alteration, the art of manipulating the physical world to suit his needs, and bit in the realm of Destruction magick. Soon after, his Wanderlust soon took hold again and he set sail from the northern tip of Summerset to the province of Hammerfell, where in the town of Hegathe he settled for a time to begin education into the survival and way of life of desert dwellers.\r\n\r\n     Through the tales of the elder nomads and written lore, he travelled across the sandy dunes to study various ancient ruins and tombs of long forgotten pharohs. He settled for a while in the dusty town of Taneth, where he met a lovely Redguard named Maliik. After courting for some time, they fell deeply in love, and Hrafn, on the anniversity of thier meeting proposed marriage. She accepted, but only after revealing that she was, in fact, one of the most respected members of an elite family of assassins- the Hashashim. Even after learning this, Hrafn was undeterred- he loved this woman deeply, no matter what. And so they left Hammerfell, to return to the homeland of Hrafn The Learned, for the Great War was now over, and they could settle in a small village, untouched by the troubles of the times. Two years after the fragile \\\"peace\\\" began, a girl was born to Hrafn and Maliik, and they named her Joruuna, a proud Nordic name for the first born to such an honorable man as Hrafn. They lived a fairly normal life near Rorikstead until a terrible disease swept it\\'s way through the village, killing most of the population unexpectedly. Maliik succumbed to the foul contagion merely a few days before Hrafn sent the seemingly healthy adolescent Joruuna to travel across Skyrim to the legendary town of Winterhold, where there would be open arms for the offspring of such a well respected Son of Skyrim. She travelled for several years, settling in every hold along the way, to follow in her fathers footsteps and learn everything she could about everything she could. Falling for the charm of a master illusionist in Falkreath, she found herself engaged to be wed to a deceptive and malicious Dunmer named Teraneth, who was known to have enslaved many young women who ventured too close. The will of her father and wit of her mother shined brightly in young Joruuna, for she saw through his facade and became enraged by what she learned of his mistreatment of females (of any race). One eve, while Teraneth lie asleep, she buried a posioned dagger in one of his eyes and ran as quickly as she could to Whiterun.\r\n       No sooner than she stepped into the gates of Whiterun, she was quickly arrested by guards (word had not yet reached the city of a brutal murder) for simply being dark haired and skinned as a Redguard. They quickly framed her in a number of crimes and sent her by wagon to Helgen for execution by way of beheading. She rode into the Gallowtown in a cart shared by the infamous and passionate Ulfric Stormcloak, as well as one of his most trusted officers, Ralof. She had just lain her head upon the executioner\\'s block when a colossal dragon appeared in the sky and descended upon the the public spectacle with a fury no living person has ever seen. She saw this as her chance to escape and followed Ralof through the Keep of Helgen and through the underground passages that led to her freedom.\r\n\r\n_-= Please feel free to correct me if I have any of the history/lore wrong, I would be happy to fix it. =-_\r\n",
  "categoryId": "43",
  "version": "1",
  "author": "Me",
  "createdUnix": "1323235517",
  "updatedUnix": "1323236005",
  "containsAdultContent": true,
  "uploadedBy": "Jethu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "7837",
      "name": "Joruuna",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1739",
      "fileName": "Joruuna-2897-1.7z",
      "uploadedUnix": "1323236005",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f78159972311be54723387645c5f080c8c30495cd55f7747fb936cca56d36d00/analysis/1406489284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Joruuna-2897-1.7z?fid=7837&ttl=1535757503&ri=8192&rs=8192&setec=087541fc6332e77dee28e718a11f1501"
    }
  ]
}