{
  "modId": 29017.0,
  "modName": "Unenchanted Items",
  "summary": "Un-enchanted versions of unique items are now craft-able, improvable, and enchant-able.",
  "descriptionHtml": "[size=+2][b][center][color=red]UnEnchanted Items[/color][/b][/size]\r\n\r\nI wanted some of the unique items in the game to be craftable, properly upgradable (affected by perks at a sharpening wheel/workbench), and enchantable, and didn\\'t see a mod that fit  the bill, so I made my own. All items can be forged with either their associated material perk (steel, glass, ebony, Daedric, etc) or the arcane blacksmith perk. Improvements can be made on all items, but  for the max benefit you will still need the perk for their associated material (Mehrunes\\' dagger is now affected by the Daedric Smithing perk, Keening is Dwarven, Nightingale is Daedric, etc). Daedric quest items have had the keywords changed to resemble  a normal Daedric item, which makes it easier to sell botched enchantments and will not interfere with achievements.\r\n\r\nBecause these unique items require higher temperatures to forge properly, they require fire salts in addition to their usual materials.[/center]\r\n\r\n[size=+2][b]Weapons Added:[/size]\r\n\r\n[size=+1]Daggers:[/size]\r\nBlade of Sacrifice\r\nBlade Of Woe[/b] - Switched perk for maximum damage at sharpening wheels to Daedric and made ingredients hard to get due to it\\'s very high vanilla power.\r\n[b]Dragon Priest Dagger\r\nKeening\r\nMehrunes\\' Razor\r\nShiv\r\n\r\n[size=+1]One Handed:[/size]\r\nBlade\\'s Sword AKA Akaviri Katana[/b] - Base steel version\r\n[b]Chillrend[/b] - Max base damage version, Increased materials needed for balance reasons, frost salts also needed to forge blade\r\n[b]Dawnbraker[/b] - Original had lowered base damage due to it\\'s very powerful enchantment - Upped damage to Ebony to balance, left low weight\r\n[b]Dragonbane[/b] - Max base damage version, upped from Steel to Ebony smithing for balance reasons\r\n[b]Mace of Molag Bal\r\nNightingale Blade[/b] - Max user-attainable version\r\n[b]Scimitar[/b] - Same as vanilla, attainable very early, made crafting materials high to balance\r\n\r\n[b][size=+1]Two Handed:[/size]\r\nEbony Blade[/b] - Original had lowered base damage due to it\\'s very powerful enchantment - Upped damage near Daedric Greatsword to balance. Fixed one hand, two hand bug. Properly levels two-handed  skill and is affected by two handed perks. It\\'s base damage is slightly lower than the regular Daedric greatsword because of it\\'s lower weight and faster swing, but since it can\\'t be dual-wielded it needed a significant damage boost from it\\'s vanilla counter-part.\r\n[b]Headman\\'s Axe[/b] - Uses wood as well as other materials due to its handle. Properly levels two-handed skill and is affected by two handed perks.\r\n[b]The Longhammer[/b] - Swings faster than almost all two-handed weapons.\r\n[b]Rueful Axe[/b] - Being one of the sickest looking weapons in the game, I gave this one a little extra attention. It needed a serious re-balance due to it\\'s very slow swing speed and low damage. Now swings as fast and does as much damage as a regular Daedric Battleaxe.\r\n[b]Volendrung[/b] - Left slightly lower base damage as it was due to it\\'s faster swing speed.\r\n[b]Wuuthrad[/b] - Left damage the same, lower weight than Daedric.\r\n\r\n[b][size=+1]Bows:[/size]\r\nNightingale Bow[/b] - Highest user attainable version\r\n[b]Karliah\\'s Bow[/b] - Nightingale Bow carried by Karliah, does not drop and is not normally attainable in game without console code. Has higher base damage, lower weight, and increased speed. Made  crafting require both Arcane Blacksmith and Daedric perks as well as the materials needed harder to attain because of this bows damage and speed. It\\'s base damage is slightly higher than Daedric,  and it draws slightly faster.\r\n\r\n[size=+2][b]Armor Added:[/size]\r\n\r\nBlades Armor[/b] - Boots, cuirass, gauntlets, helmet, & shield.\r\n[b]Bone Crown\r\nCompanions\\' Armor[/b] - Boots, cuirass, gauntlets, & helmet.\r\n[b]Dark Brotherhood Armor[/b] - Requested by [i]tengriL[/i]. Ancient Shrouded variant. Boots, cuirass, gauntlets, & helmet.\r\n[b]Dragon Priest Masks (All)[/b] - Bronze, Corundrum, Ebony, Iron, Marble, Moonstone, Orichalum, Steel, Gold, and Wood.\r\n[b]Thieves Guild Leader Armor[/b] - Boots, cuirass, gauntlets, & helmet.\r\n[b]Mask of Clavicus Vile\r\nSpellbreaker Shield\r\nEbony Mail[/b] - Increased armor rating to Daedric since it\\'s no longer enchanted.\r\n[b]Yngol\\'s Helm[/b] - Requires Advanced Armors perk because it\\'s steel plate.\r\n[b]Nightingale Armor[/b] - Boots, cuirass, gauntlets, helmet, & shield.\r\n\r\n[size=+2][b]Clothing Added:[/size]\r\n\r\nArchmage[/b] - Boots & robes.\r\n[b]Psiijic[/b] - Boots, gloves, hood, & robes.\r\n[b]Thalmor[/b] - Requested by [i]tyfe1994[/i]. Boots, gloves, robes, & hooded robes.\r\n[b]Cicero / Jester[/b] - Boots, robes, gloves, & hat.\r\n[b]Focusing / Mystic Tuning Gloves\r\n\r\n[size=+2]Jewelry Added:[/size]\r\n\r\nHircine\\'s Ring[/b] - With no werewolf effects.\r\n[b]Necromancer\\'s Amulet\r\nReligious Amulets[/b] - Akatosh, Arkay, Dibella, Julianos, Kynareth, Mara, Stendarr, Talos, & Zenithar.\r\n[b]Ring of Namira[/b] - Requested by [i]shaderlucker[/i]\r\n\r\n\r\nFor maximum compatibility I did not edit any base in-game items, and created new duplicates instead. This means that this mod should be compatible with any other mod available for the game. If  your running a mod that changes the base stats of any of the items I duplicated, it will not show the affects of that other mod with the items in this mod; it also will not cause a conflict. This  mod uses the same models for the weapons, so it should be compatible with any texture packs installed. Also, this mod only addresses un-craftable semi-unique and unique items. Some were left out  for a reason, like the Grimsever, because they used the same item model as the original item they were made from. If you have a comment about balancing a specific item, or any bugs, let me know  and I\\'ll do my best to address it. Thank you and enjoy!\r\n\r\nUpcoming Changes in upcoming future versions:\r\nGhost Weapons\r\nMore Armor and Apparel\r\n\r\nPlease report any issues or problems directly, and they will be resolved ASAP. Thank you.\r\n\r\nCHANGELOG:\r\n1.6 - Added Ancient Shrouded DB Armor + tempering and fixed minor bug with the Rueful Axe.\r\n1.5 - Added Nightingale Armor + tempering and the Ring of Namira.\r\n1.4 - Added Spellbreaker shield and added tempering for all armors.\r\n1.3 - Added 33 new items including armor, clothing, and jewelry. Tempering coming soon...\r\n1.2 - Added 20 new pieces of armor. Tempering coming soon. 33 more items on the way...\r\n1.1 - Removed previous enchantment description from Nightingale Blade.\r\n1.0 - Initial release, 21 weapons, all able to be sharpened.\r\n\r\n[size=+1][url=http://skyrim.nexusmods.com/mods/29059]Now that you have all these amazing items, they need to be enchanted, right? So check out my other mod that unlocks the unique in-game enchantments. http://skyrim.nexusmods.com/mods/29059[/url][/size]",
  "categoryId": "36",
  "version": "1.6",
  "author": "Blazie151",
  "createdUnix": "1356653570",
  "updatedUnix": "1361580741",
  "containsAdultContent": false,
  "uploadedBy": "blazie151",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012272",
      "name": "UnenchantedItems1_6",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "UnenchantedItems1_6-29017-1-6.zip",
      "uploadedUnix": "1361580741",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/41474e50dc4aceb513d230ce305da814f60733d0029768a53afdef52fdb3d578/analysis/1407434021/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UnenchantedItems1_6-29017-1-6.zip?fid=1000012272&ttl=1535802807&ri=8192&rs=8192&setec=853f9e231c662cdd1736feb69440329f"
    }
  ]
}