{
  "modId": 29013.0,
  "modName": "Unofficial Skyrim Patch - Polish Translation - Polska wersja",
  "summary": "Wszechstronny i latwy w uzywaniu mod, naprawiajacy bugi z The Elder Scrolls V: Skyrim, ktore nie zostaly naprawione przez tworcow gry.",
  "descriptionHtml": "Wszechstronny i łatwy w używaniu mod, naprawiający bugi z The Elder Scrolls V: Skyrim, które nie zostały naprawione przez twórców gry, a które można skorygować za pomocą edytora Creation Kit oraz narzędzi stworzonych przez Społeczność TES. \r<br />\r<br />Oryginalna wersja moda (jęz. angielski):\r<br />[url=http://skyrim.nexusmods.com/mods/19]http://skyrim.nexusmods.com/mods/19[/url]\r<br />\r<br />Jedyne o czym trzeba pamiętać, to:\r<br />[list][*]Mod wymaga gry Skyrim z patchem 1.9.32.0.8 lub nowszym. Unofficial Skyrim Patch nie będzie działać na wcześniejszych wersjach gry&#33;&#33;&#33;\r<br />[*]W Plikach Danych w menu startowym Skyrim, zanim uruchomisz grę, aktywuj plik ESP oraz przesuń go w kolejności nad wszystkie inne mody z plików, ale nie wyżej niż pliki ESM.[/list]\r<br />Dzięki temu ostatniemu mod &#34;Unofficial Skyrim Patch&#34; będzie wczytywany przez grę jako pierwszy i wszystkie inne wczytywane po nim mody będą go nadpisywać.\r<br />\r<br />\r<br />[color=#ffff00][size=4]Moje uwagi do oficjalnego spolszczenia gry Skyrim i patcha[/size][/color]\r<br />Są to uwagi, które prawdopodobnie trzeba jeszcze uwzględnić przy poprawianiu tekstów z gry w przyszłości (choć większość już powinna być):\r<br />[list][*]nazwy miesięcy - raz małą literą, raz dużą (wg mnie powinny być z dużej, np. &#34;pierwsze mrozy&#34; (Frostfall) jako nazwa miesiąca to nie jakieś tam pierwsze mrozy, a miesiąc Pierwsze Mrozy)\r<br />[*]czary a zaklęcia - to dwie różne rzeczy: czary Spells rzuca się za pomocą menu magii, a zaklęcia Enchantments nakłada się na przedmioty. W oficjalnym spolszczeniu często zdarza się, że w stosunku do czarów używa się słowa &#34;zaklęcie&#34;.\r<br />[*]Dynamo czy rdzeń energetyczny centuriona - to też jest pomieszane, raz &#34;dynamo&#34;, a raz &#34;rdzeń energetyczny&#34;.\r<br />[*]magia czy mana - w oficjalnym spolszczeniu nie ma czegoś takiego jak &#34;poziom many&#34;, jest &#34;poziom magii&#34;. Wg mnie chyba lepiej słowo Magicka tłumaczyć jako &#34;mana&#34; (tak jak w Oblivionie).\r<br />[*]format tekstu w książkach - pomieszany w przypadku tekstów wypowiedzi, raz są w cudzysłowach (nieprawidłowo), raz po myślnikach (prawidłowo)[/list]\r<br />\r<br />\r<br />[color=#ffff00][size=4]Pliki ze spolszczeniem Unofficial Skyrim Patch[/size][/color]\r<br />są dwa:\r<br />- [b]Unofficial Skyrim Patch PL 1 3 1 plugin[/b] - wymagany, główny plik spolszczenia\r<br />- [b]Unofficial Skyrim Patch PL 1 3 1 zasoby bsa[/b] - pobierz tylko jeśli korzystasz z pełnego spolszczenia gry, tzn. z polskimi głosami. W przeciwnym razie używaj pliku &#34;Unofficial Skyrim Patch.bsa&#34; z angielskiej wersji moda Unofficial Skyrim Patch, ponieważ to on zawiera głosy z angielskiej wersji gry.\r<br />\r<br />\r<br />[color=#ffff00][size=4]Co to jest Unofficial Skyrim Patch?[/size][/color] Tak ogólnie:\r<br />[list][*]Naprawia setki bugów i błędów związanych z rozgrywką, questami, NPC-ami, obiektami, przedmiotami, tekstami pojawiającymi się w grze\r<br />[*]Został stworzony przez twórców Unofficial Oblivion Patch\r<br />[*]Nie zawiera żadnych niebezpiecznych zmian (tj. usunięcie ważnych przedmiotów)\r<br />[*]Jest zaprojektowany tak, aby być kompatybilnym z możliwie największą liczbą innych modów\r<br />[*]Jest nieustannie testowany, pobrało go już dziesiątki tysięcy użytkowników[/list]\r<br />\r<br />Więcej informacji na temat moda (w języku angielskim) znajdziesz na oficjalnym forum:\r<br />[url=http://forums.bethsoft.com/topic/1450753-relzwipz-unofficial-skyrim-patch-thread-30]http://forums.bethsoft.com/topic/1450753-relzwipz-unofficial-skyrim-patch-thread-30[/url]\r<br />Temat ten na forum może zostać zamknięty z uwagi limit 200 postów, ale na pewno jest wtedy otwarty i aktywny nowy temat o podobnej nazwie.\r<br />\r<br />Kompletne zestawienie zmian w grze (w tym literówek z angielskiej wersji gry) znajdziesz tutaj:\r<br />[url=http://www.iguanadons.net/Unofficial%20Skyrim%20Patch%20Version%20History.html]http://www.iguanadons.net/Unofficial%20Skyrim%20Patch%20Version%20History.html[/url]\r<br />\r<br />\r<br />[color=#ffff00][size=4]Jak usunąć mod i spolszczenie[/size][/color]\r<br />Z katalogu [b]SkyrimData[/b] usuń pliki:\r<br />Unofficial Skyrim Patch.bsa\r<br />Unofficial Skyrim Patch.bsl\r<br />Unofficial Skyrim Patch.esp\r<br />\r<br />\r<br />[color=#ffff00][size=4]Częste pytania[/size][/color]\r<br />[b]Czy poza spolszczeniem muszę pobrać coś jeszcze?[/b]\r<br />Jeśli pobierzesz &#34;plugin&#34; oraz &#34;zasoby&#34;, to nic więcej nie trzeba.\r<br />plugin to plik: Unofficial Skyrim Patch.esp\r<br />zasoby to plik: Unofficial Skyrim Patch.bsa\r<br />Jeśli chcesz mieć polskie głosy postaci w grze, pobierz plik zasobów bsa stąd, ze spolszczenia. Jeśli natomiast w grze masz wszędzie angielskie głosy postaci, to używaj pliku zasobów bsa z angielskiej wersji Unofficial Skyrim Patch.\r<br />\r<br />[b]Czy spolszczenie jest pełne?[/b]\r<br />Wszystkie teksty z gry powinny być przetłumaczone.\r<br />\r<br />[b]Co z literówkami i błędami z polskiej wersji językowej?[/b]\r<br />Na razie niewiele. Skupiłem się, aby przede wszystkim przetłumaczyć to, co zawiera mod  Unofficial Skyrim Patch. Tłumaczenie Cenegi jest całkiem niezłe w tym względzie, iż często nie powielali literówek z angielskiej wersji gry, wyłapanych przez twórców moda Unofficial Skyrim Patch (choć nie zawsze, np. &#34;Morang Tong&#34; zamiast &#34;Morag Tong&#34;). Na razie jedyne co w pełni świadomie zmieniłem to jest &#34;Ulfrik Gromowładny&#34; zamiast &#34;Ulfric Gromowładny&#34; (ale tylko w tekstach z moda, tak więc w grze na pewno spotkasz jeszcze nazwy &#34;Ulfric&#34;). Jeśli chcesz, możesz zgłosić błędy z oficjalnego spolszczenia (np. w komentarzach lub na forum skyrim.pl). Moje uwagi do spolszczenia są też gdzieś tutaj opisane - patrz wyżej.\r<br />\r<br />[b]Wyszła nowa angielska wersja moda - kiedy będzie aktualizacja spolszczenia?[/b]\r<br />Postaram się, żeby była możliwie najszybciej.\r<br />\r<br />[b]Co jeśli Bethesda wyda patch do czegoś, co naprawia Unofficial Skyrim Patch?[/b]\r<br />Jeśli tak się stanie, to w następnej wersji moda usunięte zostaną modyfikacje dotyczące danego obiektu lub rekordu. Dotyczy to tylko tej części modyfikacji, która nie będzie już potrzebna.\r<br />\r<br />[b]Czy ten mod był &#34;czyszczony&#34;?[/b]\r<br />Tak, za pomocą najbardziej aktualnej wersji aplikacji TES5Edit. Nie trzeba samemu &#34;czyścić&#34; tego moda.\r<br />\r<br />[b]Czy jeśli aktualizuję u siebie wersję moda, to muszę wykonać czysty zapis gry?[/b]\r<br />Nie&#33; Jeśli wyjdzie nowa wersja moda, wystarczy że nadpiszesz ją nad starą. NIGDY nie trzeba będzie robić żadnych dodatkowych czynności, takich jak wykonanie czystego zapisu stanu gry (w Skyrim nawet nie ma czegoś takiego, to nie działa).\r<br />\r<br />[b]Czy bezpiecznie jest usunąć mod, zapis stanu gry się nie zepsuje?[/b]\r<br />Usunięcie moda jest w pełni bezpieczne. Mod możesz zainstalować albo usunąć w dowolnym momencie gry, ponieważ zawiera skrypty, które czuwają nad bezpieczeństwem.\r<br />\r<br />[b]Czy ten mod będzie kiedyś w wersji ESM?[/b]\r<br />Nie i zapewne jeszcze długo nie. Mod jest w pliku ESP (&#34;Unofficial Skyrim Patch.esp&#34;). Jeśli znajdziesz gdzieś mod w pliku ESM (znamy takie dwa przypadki), to zapewne będzie to mod psujący zapisy stanu gry, nie zalecamy go używać w grze.\r<br />\r<br />[b]Po co jest plik .bsl?[/b]\r<br />Plik .bsl jest używany przez program archive.exe do rozkodowania zawartości archiwum z pliku .bsa. Jest wymagany, bez niego całe archiwum (czyli plik Unofficial Skyrim Patch.bsa) byłoby bezużyteczne.\r<br />\r<br />[b]Czy pełna wersja moda zawiera kod źródłowy skryptów?[/b]\r<br />Tak. Wszystkie kody są w archiwum moda, w pliku &#34;Unofficial Skyrim Patch.bsa&#34;. Musisz rozpakować ten plik, aby móc dostać się do tych skryptów.\r<br />\r<br />[b]Czy mogę wykorzystać we własnym modzie coś z Unofficial Skyrim Patch?[/b]\r<br />Tak. Możesz używać praktycznie wszystkiego, co zawiera ten mod: skryptów, modeli, tekstur itd. Nie musisz nawet pytać o zgodę autorów. Jedyne czego chcemy zabronić, to aby wprowadzać własne zmiany w modzie i dawać go innym graczom pod niezmienioną nazwą &#34;Unofficial Skyrim Patch&#34;.\r<br />\r<br />\r<br />[color=#ffff00][size=4]Narzędzia, których używam do tworzenia spolszczeń[/size][/color]\r<br />[list][*][url=http://skyrim.nexusmods.com/mods/25859]TES5Edit[/url] używałem tylko do konwersji pluginu i wygenerowania plików String (nie używałem automatycznego Translatora, bo coś dziwnie na razie działa) - obecnie używam tylko do sprawdzania zmian wprowadzanych przez pluginy ESP/ESM, plików string nie generuję\r<br />[*][url=http://skyrim.nexusmods.com/mods/29148]Skyrim String Translator (TES V Translator)[/url] - główne narzędzie do przygotowania spolszczenia - obecnie ten program właściwie mi wystarcza\r<br />[*][url=http://skyrim.nexusmods.com/mods/13024]StringsEdit[/url] do exportu/importu między plikami String a XML (używałem do ogólnego sprawdzenia poprawności tekstów)\r<br />[*]Notepad++ do podglądania i czasami edytowania plików XML\r<br />[*]MS Excel do wyszukiwania tekstów, których nie trzeba tłumaczyć ręcznie, oraz innych zadań, zależnie od potrzeb\r<br />[*]MS Word do ogólnego sprawdzenia ortografii\r<br />[*]OO Writer (z włączoną funkcją uzupełniania wyrazów) do pisania dłuższych tekstów[/list]\r<br />\r<br />",
  "categoryId": "84",
  "version": "1.3.1a",
  "author": "TomBrightblade",
  "createdUnix": "1356652022",
  "updatedUnix": "1364027463",
  "containsAdultContent": false,
  "uploadedBy": "TomBrightblade",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000019547",
      "name": "Unofficial Skyrim Patch PL 1 3 1a plugin",
      "version": "1.3.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2331",
      "fileName": "Unofficial Skyrim Patch PL 1 3 1a plugin-29013-1-3-1a.zip",
      "uploadedUnix": "1363996444",
      "modVersion": "1.3.1a",
      "virusScanUrl": "https://www.virustotal.com/file/7d3bcadcd7a9069860bba5b46f0e057287874ea90aedaf40a0896c6b6488cc23/analysis/1407483547/",
      "changelogHtml": " Aktualizacja do najnowszej wersji moda - 1.3.1a oraz do Skyrim w wersji 1.9 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unofficial%20Skyrim%20Patch%20PL%201%203%201a%20plugin-29013-1-3-1a.zip?fid=1000019547&ttl=1535802800&ri=8192&rs=8192&setec=964114b89167fce0d10f3bde8c2ca8cb"
    },
    {
      "fileId": "1000019642",
      "name": "Skyrim Unofficial Patch PL 1 3 1a zasoby",
      "version": "1.3.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "86448",
      "fileName": "Skyrim Unofficial Patch PL 1 3 1a zasoby-29013-1-3-1a.zip",
      "uploadedUnix": "1364027463",
      "modVersion": "1.3.1a",
      "virusScanUrl": "https://www.virustotal.com/file/9deca9c2b927b1778bb4333ba4744a91671d9afe535d3e98bd2ce88bc3263ef6/analysis/1407484224/",
      "changelogHtml": " Aktualizacja do najnowszej wersji moda - 1.3.1a oraz do Skyrim w wersji 1.9 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Unofficial%20Patch%20PL%201%203%201a%20zasoby-29013-1-3-1a.zip?fid=1000019642&ttl=1535802801&ri=8192&rs=8192&setec=2c66b579d30b27889554b03bffb730b9"
    }
  ]
}