{
  "modId": 29024.0,
  "modName": "mr blade and the giant club",
  "summary": "Do not make him mad if you value your life.",
  "descriptionHtml": "This mod adds a tall Argonian with blade armor and a giant club that is weak.\r\n\r\nThe story of blade.\r\nThe Argonian only know as Blade is a weird being. He was a baby when his story began. Blade was born to a loving adventuring father and a caring mother. When his father was on a adventure he was framed for the murder of a man in charged of the empires gold he had to leave not just the empire but Tamriel itself he, his wife and baby blade left tamriel on a ship his father \\\"hired\\\" and they knew that they could not live at sea so they went east after months at sea the father saw land. The mother the father and the little baby blade went a shore. They made camp and lived there for a few days then they saw fire near by they ran. After the fire was over the came out of a cave and they saw weird snake men searching the ashes. The parents knew where they were. They were in Akavir the argonians lived in hiding for years until Blade was the argonian version of a teenager the tsaesci finally found the cave the parents where in the cave but Blade was not the tsaesci killed them. Blade come back and killed one as he was leaving and stole the armor and katana. blade ran to the land of the ka\\'po\\'tun here he lived with the cat people of this land. here he learnt of magic he learnt how to breath fire of the dragon and to shoot it from his hands. he went back to the land of snakes and led a war between the other nations of akavir and the tsaesci it was over years later but there was no winner. the reason why the war ended was because the dragons had returned the ka\\'po\\'tun worship it at first but they attacked the dragons soon after they learnt of the torture they would get. They lost and are now in hiding so Blade stole a ship from the tsaesci and went back to tamriel he got lost and found his way to skyrim. There he learnt of dragonborn he sensed that the sleepin giant inn was a good place to start on the way he killed a giant and took his club and dropped it on the floor of the sleeping giant in as well as some dragon bone armor and weapons.\r\n\r\nThis needs dawnguard to work any way this is to long as it is so yeah a club dragon weapons and armor with a new companion. if some one knows how to make new models and textures i would love you because i would like to make a quest so if some one knows how to make quests new areas and creatures i would love it if you could send the reasoces thank you bye for now.",
  "categoryId": "66",
  "version": "0.1alpha",
  "author": "bhark2",
  "createdUnix": "1356656817",
  "updatedUnix": "1356656961",
  "containsAdultContent": false,
  "uploadedBy": "bhark2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "107975",
      "name": "alpha1",
      "version": "0.1alpha",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "alpha1-29024-0-1alpha.zip",
      "uploadedUnix": "1356656961",
      "modVersion": "0.1alpha",
      "virusScanUrl": "https://www.virustotal.com/file/8620bb70bcbf360fc3fdbb0eeb8b51e1d1d32f145c26bf43b40c15c5e6132d26/analysis/1407325445/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/alpha1-29024-0-1alpha.zip?fid=107975&ttl=1535802821&ri=8192&rs=8192&setec=93ff0e7e2ae6e298437e03fd718eebcd"
    }
  ]
}