{
  "modId": 29033.0,
  "modName": "Northlands",
  "summary": "A fully-voiced Skyrim machinima featuring an original story & characters.",
  "descriptionHtml": "Northlands is a fully-voiced Skyrim machinima featuring an original story & characters.\r\n\r\nThe backstory:\r\n\r\nNearly a thousand years ago, the Unification War brought peace to the warring nomadic peoples of the northern territories, uniting them in an alliance under the rule of Andrasha, the warrior queen of the Nanziegan people. Under her rule, the nations of Nanzieger, Keltifan, Noardal and Betait were formed in the north, and began to prosper. Opinion of Andrasha and her deeds were divided, though. Some called her a savior and an honorable leader; others, a tyrant and a murderer. Rumors and conspiracy theories began to crop up among the dissenters- theories that she was a rare sorceress, having used dark magic in her conquest of the north; that the sword she wielded in battle was imbued with dark magic as well, corrupting and killing any it deemed an unworthy wielder, and striking down foes with strange blue-white fire.\r\n\r\nEventually, an assassination plot was formed by a splinter group of extremists within the ranks of the dissenters, and carried out. The Nanziegan palace was raided, and Andrasha publicly executed in front of her subjects: beheaded, and her body burned in the public square of the capitol city. Following the murder of the queen, the court was plundered, its treasures and knowledge scattered, stolen or destroyed by the raiders, including Andrasha\\'s sword, the Witchlight. Nanzieger and the other northern countries became a battleground once more, invaded and fought over time, and time again; no unifying force to keep them in check or to repel the armies of the countries to the south.\r\n\r\nNow, an uneasy peace among the countries of the north that has lasted almost two hundred years is about to be broken once again. This time, though, there are rumors spreading throughout Nanzieger and the rest of the Northlands; rumors that the Witchlight has finally resurfaced, that a warrior who could wield it could lead the Nanziegan people to victory once more, and unify the four nations once again, ushering in a new age of peace and prosperity.\r\n\r\nThe question is: Who could wield such a weapon- one supposed to be cursed, answering only to those it deems worthy? Can it even be found, after being lost for nearly a millennium? Will it and it\\'s chosen wielder even be able to make a difference; and if they can, can all this be done before Nanzieger falls to the invading enemy?",
  "categoryId": "45",
  "version": "0.1",
  "author": "Connor Saxe",
  "createdUnix": "1356673185",
  "updatedUnix": "1356673185",
  "containsAdultContent": false,
  "uploadedBy": "Xenon32",
  "primaryFile": null,
  "files": []
}