{
  "modId": 29032.0,
  "modName": "Reveal Vampire Spell for Hide and Seek Quest",
  "summary": "For the Hide and Seek quest",
  "descriptionHtml": "When I play Skyrim, I have one rule: absolutely NO MURDER&#33;&#33;  So you can imagine that it reeeeeeeeaaaaaaaaaaaaaaaaally urked me that killing a vampire who was disguised as a common citizen, no matter what I did, still counted as a murder.  Fortunately, the UESP Wiki mentioned a workaround, but if you were too far along in the game, any Frenzy spell that you cast on him would be ineffective, so I made this.\r<br />\r<br />The Reveal Vampire Spell&#33;&#33;&#33;\r<br />\r<br />Basically, this spell is an extremely powerful and irresistable version of the Frenzy spell, only made specifically for vampires in general... and the disguised vampires in particular.\r<br />\r<br />It works relatively simple, you scope your vampire target, cast the spell on him, and then...\r<br />\r<br />... watch as everyone around you KILLS THE VAMPIRE FOR YOU&#33;&#33;&#33;\r<br />\r<br />Now, it&#39;s best that you cast the spell while hidden, so that any guards or witnesses don&#39;t catch you casting it.  If you are caught, then you can get a bounty and get confronted by a guard.  Should that happen, YIELD IMMEDIATELY.  Then you can either inform him that you are a Thane, or pay your fine.  Either way, your vampire target is dead and you avoid getting a murder on your record.\r<br />\r<br />On occasion, you might get one that&#39;s in a remote area like outside the Old Hroldan Inn.  If you get that, then cast the spell on him and let him chase you to a more populated area, or bring a follower and let your follower kill him... or, better yet, call one of your dragon friends to kill him.  (Although, I admit, I haven&#39;t tested the second and third suggestions yet.)\r<br />\r<br />As for obtaining the spell, you can only get it by buying it from Florentius Baenius after you rescue him.\r<br />\r<br />BTW, this mod requires Dawnguard, of course.\r<br />\r<br />UPDATE:  Made the spell non-hostile, so now you can cast it around guards all you want and not get a bounty.\r<br />\r<br />Enjoy.\r<br />\r<br />NOW AVAILABLE FOR SSE&#33;&#33;&#33;",
  "categoryId": "75",
  "version": "1.1",
  "author": "CaptainRC",
  "createdUnix": "1356672028",
  "updatedUnix": "1356756511",
  "containsAdultContent": false,
  "uploadedBy": "CaptainRC",
  "primaryFile": null,
  "files": [
    {
      "fileId": "108187",
      "name": "Reveal Vampire Spell",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Reveal Vampire Spell-29032-1-1.rar",
      "uploadedUnix": "1356756511",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9172204556b9af905cf7a2e37b467998d2037f69f7ef736a35a0aa30a00729c1/analysis/1407326843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Reveal%20Vampire%20Spell-29032-1-1.rar?fid=108187&ttl=1535802840&ri=8192&rs=8192&setec=02a5035d09980baed45d243b21945dcd"
    }
  ]
}