{
  "modId": 29045.0,
  "modName": "155 Robes With Magnitude plus Mage craftables",
  "summary": "Adds 155 new (disenchantable) robes with Increase magic school magnitude enchantments to the vanilla 155 magic school robes. It also adds 13 craftable robes, 4 craftable mage hoods and 6 craftable staffs.",
  "descriptionHtml": "A total whopping 155 (disenchanteable) robes of increase <magic school> magnitude have been added to shops and random loot. This enchantment causes Destruction, Restoration and Illusion spells to be stronger and Alteration and Conjuration effects to last longer.\r\nyou will have 50% chance that a robe contains the Cost less magicka enchantment and 50% that it will contain the increased magnitude enchantment, Giving a bit more variation early game and giving a way to increase your spell strength without having to clog down a potion late game.\r\n\r\nHow to get these Robes: Go inside an unvisited dungeon and kill some mages or buy those robes from either an unvisited merchant or after restock.\r\n\r\nYou\\'re also able to craft 13 different robes, 4 different mage hoods and 6 different staffs.\r\n\r\nHow to craft robes: First you\\'ll need to get a ragged robe. You can make one from 10 leather straps or steal one from a beggar. After that you\\'ll require 1 refined moonstones + Extra moonstones, gems or charcoal. Use this to paint your robe and you\\'re done!\r\n\r\nHow to craft a hood: 3 leather straps + refined moonstone (number is dependant of hoodtype) or charcoal + 3 leather straps for the (in vanilla unplayable) black mage hood.\r\n\r\nHow to craft a staff: you\\'ll need 1 firewood, 1 common soulgem and 1 refined moonstone.\r\n\r\nFor those who are interested in what robes are added:\r\n25 Mage College Robes.\r\n30 Necromancer Robes.\r\n30 Hooded Necromancer Robes.\r\n30 Warlock Robes.\r\n30 Hooded Warlock Robes.\r\n\r\nFor manual installation: Just drop it in the data folder.\r\n\r\nShould not clash with any mods at all but do contact me if it does for you.\r\n\r\n\r\nEndorse/Comment if you like this mod.\r\n\r\n\r\nChancelog:\r\n1.0 Added 25 College magnitude robes.   [28dec12]\r\n1.1 Added 120 other magnitude robes.   [28dec12]\r\n1.1.1 Fixed some typos.   [28dec12]\r\n1.2 Added 13 crafteable robes, 6 crafteable mage hoods and 6 crafteable staffs.   [29dec12]\r\n1.2.1 Removed 2 mage hood recipe\\'s since bethesda didn\\'t make the master and expert hoods and made it so staffs require refined moonstone.   [29dec12]",
  "categoryId": "75",
  "version": "1.2.1",
  "author": "Naxaras",
  "createdUnix": "1356702646",
  "updatedUnix": "1356740419",
  "containsAdultContent": false,
  "uploadedBy": "naxaras",
  "primaryFile": null,
  "files": [
    {
      "fileId": "108147",
      "name": "Robeswithmagnitude",
      "version": "1.2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Robeswithmagnitude-29045-1-2-1.7z",
      "uploadedUnix": "1356740419",
      "modVersion": "1.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/d3cbe5eb7a68334d13840bb93ef568af94e329379a596bdc7a205e028ebe176d/analysis/1407326477/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Robeswithmagnitude-29045-1-2-1.7z?fid=108147&ttl=1535802864&ri=8192&rs=8192&setec=f92ede58ada70d95779d1c66c0f64216"
    }
  ]
}