{
  "modId": 2905.0,
  "modName": "Deadly Traps and Sickly Diseases",
  "summary": "Making traps deadly and diseases painful and debilitating.  ",
  "descriptionHtml": "You, like me, probably found most traps to be at best a minor nuisance and for the most part you could just ignore them.  Now, with extra damage, intense poisons and powerful magic traps you will cower and be careful around every corner so as not to set off one of these monsters.   Many may kill you out right quickly, others give a lingering and fatal result.  \r\n\r\nOnly static traps have been changed so they can effect your enemies just as harshly as yourself, opening up new possibilities in strategy.  Magical runes are not touched so as to leave them in the magical realm.  \r\n\r\nMagical \\'soul gem\\' effects are tweaked as are darts, poison gas, pillar flames, explosive gas, lamp pots, flammable liquid, Ballista and things that use   \r\n\r\nInstallation, well I use NMM, otherwise just dump them in the Data folder.  There is an .esp for traps and one for diseases so you can turn on one or both. \r\n\r\nTo do:\r\nBear traps, swinging bed, rockfalls, flamethrower etc.  Got a few ideas, will need to do a bunch of testing, so might see an update real soon in this regard.  Diseases will be expanded upon and made progressive when the CK comes out. \r\n\r\nRecommended mod, Subliminal Traps, give the pressure-plate stone a blank effect\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2653\r\n\r\nUpdates: \r\n1.2 \r\n====\r\nFixed poisons not being curable, should be able to use a cure poison potion to save yourself. \r\n1.1\r\n====\r\nFixed some minor naming issues, made durations of poisons 60 seconds or less, but with a much higher rate of damage.... ie more deadly :)   Still trying to figure out the other traps, but looks like it might have to wait till CK.  \r\n\r\nSpoiler alert: Detailed damages are in the info file.\r\n- Big thanks to Xylozi for the first trap mod and thereby the inspiration\r\n- All done with TESSNIP and yes, this is my first mod. \r\n- I encourage all ideas, bug reports etc, \r\n==================================================\r\n* Watch this space, now working in collaboration for a combined Uber Traps mod. *\r\n\r\n[b]My mods[/b]\r\n[url=\\\"http://www.skyrimnexus.com/downloads/file.php?id=2905\\\"]Deadly Traps and Sickly Diseases[/url]\r\n[url=\\\"http://www.skyrimnexus.com/downloads/file.php?id=3135\\\"]Filling Food and Restful Sleep[/url]\r\n[url=\\\"http://www.skyrimnexus.com/downloads/file.php?id=3229\\\"]Nexus Forum Mod Requests[/url]",
  "categoryId": "24",
  "version": "1.2",
  "author": "Punxdog",
  "createdUnix": "1323247056",
  "updatedUnix": "1323536982",
  "containsAdultContent": false,
  "uploadedBy": "punxdog",
  "primaryFile": null,
  "files": [
    {
      "fileId": "8952",
      "name": "Deadly Traps and Sickly Diseases",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Deadly Traps and Sickly Diseases-2905-1-2.rar",
      "uploadedUnix": "1323536982",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6a19ddd4f0c48aecb6ca386596b6e3db7913b36dc3084de31060995db9278e2a/analysis/1406502197/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deadly%20Traps%20and%20Sickly%20Diseases-2905-1-2.rar?fid=8952&ttl=1535757542&ri=8192&rs=8192&setec=44d025da605b7934ba8db8eb982f1e12"
    }
  ]
}