{
  "modId": 29059.0,
  "modName": "Unlock Unique Enchantments",
  "summary": "Unlock unique item enchantments - Balanced for gameplay.\r\nThis mod adds many in-game enchantments that aren\\'t obtainable, as well as several completely new ones. A quest line to find artifacts enchanted with these new effects based on quest requirements helps balance everything.",
  "descriptionHtml": "[center][size=+2][color=red][b]Unlock Unique Enchantments[/b][/color][/size]\r\n\r\nThis mod adds a quest to find many in-game unique enchantments that not normally user-attainable, as well as some completely new, balanced, and lore-friendly ones. All of these can be disenchanted to learn their unique effects. Many of these enchantments needed to be balanced and sometimes even totally re-done to make them function as intended. Digging around in the creation kit shows why; a lot of these unique item enchantments would be overpowered or simply not work if they were player enchanted. This mod does not change the base items or effects in game, and instead creates new IDs for every effect changed. What this means is that it will not interfere with the vanilla items in the game, nor will it interfere with any other mod. All the enchantments will also be un-learned if this mod is deleted. This mod has also been cleaned with TES5EDIT, and does not contain and dirty or wild edits.[/center]\r\n\r\n[size=+1][b]Weapon Enchantments Added:[/b][/size]\r\n\r\n[b]Bloodthorn[/b] - Soul trap + absorb health. Original didn\\'t have a correct description, this one does.\r\n\r\n[b]Briarheart Geis[/b] - Additional damage to Nords.\r\n\r\n[b]Chillrend[/b] - Frost damage and paralyze.\r\n\r\n[b]Dawnbreaker[/b] - Fire damage and a chance for an explosion when fighting undead that can destroy and/or turn other nearby undead. Very balanced effect, did not need any editing. Honestly I do not know why this was not previously in the game.\r\n\r\n[b]Dragonbane[/b] - Additional damage to dragons, 10 shock damage to others.\r\n\r\n[b]Harkon\\'s Sword (DOES NOT REQUIRE DLC)[/b] - Requested by [i]Daevonport[/i]. Absorb health, magicka, and stamina if wielded by a vampire. I had to write new magic effects to get this to work right and I reduced the weapon charge usage by 25% due to how high it was. It works with the regular game vampirism as well as Dawnguard vampirism.\r\n\r\n[b]Keening[/b] - Absorb health, magicka, and stamina. Original weapon had broken effect, it only worked once and could not be recharged. This one works correctly though. Its usage is higher and its power lower than the vampire only version above.\r\n\r\n[b]Mace of Molag Bal[/b] - Damages stamina, magicka, and casts soul trap on the enemy.\r\n\r\n[b]Magicka Arrows[/b] - COMPATIBLE WITH AUA (Auto Unequip Ammo) - Does not require DLC for crossbow bolts. This weapon enchantment fires arrows/bolts made from the wielder\\'s own Magic. These conjured arrows are also affected by the perks Mystic Binding, Oblivion Binding, and Soul Stealer. If the user chooses to use different arrows/bolts, magic arrows are automatically selected again when the weapon is re-equipped. If the user runs out of magic while using these, other arrows/bolts will be used automatically, and the user will begin using these arrows/bolts again automatically once they have at least 50 magic.\r\n\r\n[b]Mehrunes\\' Razor[/b] - Small chance to instantly kill any non-immune enemy. I added a notification message that will pop up whenever this effect kills the target so the user knows. Original version used 0 weapon charge, and contained a script that checked the user inventory for the original Mehrunes\\' Razor ID in order to apply it\\'s effect. Because of this I obviously had to write a new script to make this work. You cannot kill those immune to Mehrunes\\' Razor, nor essential characters or your current horse. Note on this one; I\\'ve looked at a couple other mods that claim that they have this effect working while their enchantments use the original script or no script at all, which is impossible. Recent re-balance; this effect\\'s chance is now based on the player\\'s enchanting skill, and is now up to 3% (the original was 1%).\r\n\r\n[b]Nightingale Bow[/b] - Frost damage, shock damage, and slow.\r\n\r\n[b]Nightingale Sword[/b] - Absorb health and stamina.\r\n\r\n[b]Red Eagle\\'s Bane[/b] - Undead are set on fire and flee.\r\n\r\n[b]Reanimate[/b] - chance to automatically reanimate an enemy killed with this weapon enchantment. The chance is based on the player\\'s enchanting skill, and tops out at 33%.\r\n\r\n[b]Silence[/b] - Similar to Final Fantasy - High chance (75%) to silence the target, causing them to be unable to cast spells while affected.\r\n\r\n[b]Silver Sword AKA imbue with silver[/b] - Additional damage to undead and werewolves. Original version used a script to apply a small fixed amount of damage and would not have worked on custom enchanted items. This version works and scales with enchanting properly.\r\n\r\n[b]Trolls Bane[/b] - Burns trolls for additional damage.\r\n\r\n[b]Vaklr\\'s Luck[/b] - Increased chance of a critical hit. Note, this enchantment does not stack. In other words, applying this on two one-handed weapons and then dual-wielding will not increase the users critical hit chance twice. This one was really hard to get working right. The original works because the player has an invisible perk that looks for a specific keyword on the weapon equipped before applying the stat bonus. There wasn\\'t an enchantment in the game at all that had this effect, so I had to create one from scratch. Problem is, the game doesn\\'t allow a player stat bonus on a weapon. It\\'s basically a weapon enchantment that affects the player with a stat bonus, which isn\\'t meant to go on a weapon. I didn\\'t want to give up on this one and make it an apparel enchantment like others have because it\\'s not what the original result in the game was, and because it makes the effect way overpowered when you can switch between any weapon and keep the effect plus their own enchantments. Finally, in order to get this working, it took a perk, an ability, two magic effects, and an enchantment, and it works great.\r\n\r\n[b]Wabbajack[/b] - Chance to change the target into another creature (and sometimes a sweetroll). This one needed a re-balance. The original enchantment was for staves (staffs), had the ability to take away a lot of health, was used with a projectile, was considered non-hostile, and used a ridiculous charge (it would have only gotten 20 swings on a weapon enchanted with no other effect using a grand soul gem). I lowered the weapon charge usage and removed the health damage. This enchantment still uses a substantial charge because of it\\'s extremely powerful, though unpredictable, effect. More hilarious than useful; I swung away at a wolf with a dagger and watched it turn into a goat, rabbit, and finally a chicken before dying. I was also testing this with a cave bear and it turned into a Dremora Valynaz. This effect has recently been slightly adjusted for re-balancing, and now has a 25% chance for the effect to be applied.\r\n\r\n[b]Windshear[/b] - Requested by [i]ThissiusD[/i]. Attacks have a chance to stagger the opponent. The chance is based on the player\\'s enchanting skill, and tops out at 60%.\r\n\r\n[b]Wuuthrad[/b] - Especially deadly to elves. I had to pretty much re-write this one from scratch. The original \\\"enchantment\\\" used a script to apply an invisible perk to the player that increased their base damage to most elven races by a fixed 20%. If the player were to cast a spell or apply any other form of damage while this perk was in effect, the damage would be affected as well. This enchantment works correctly, scales with enchanting, and does additional damage to all elven races (including Orsimer and vampire elves, which weren\\'t affected by the original for some reason).\r\n\r\n[size=+1][b]Armor and Apparel Enchantments Added:[/b][/size]\r\n\r\n[b]Archmage Blessing[/b] - Increases all magic related stats. In my opinion, this effect is overpowered if applied to more than one item.\r\n\r\n[b]Backstab[/b] - Requested by [i]malevolentsparkle[/i]. Double sneak attack damage with one handed weapons. Note, this enchantment does not stack. In other words, applying this on multiple equipped items will not increase the damage further. This one is definitely one of my favorites.\r\n\r\n[b]Chameleon[/b] - Be warned! Your enemies have seen and been using this effect since the first era, and have learned how to detect those who which to abuse it\\'s effects! This effect works the way I feel it should have in Oblivion; each item enchanted increases the effect by 25%, 99% is the maximum amount actually applied to the wearer so it never truly replaces invisibility, it only works while sneaking, and the player can still be detected by casting light, torch light, sound, and contact. This effect was quite tricky to get working the way I wanted, and even though it has been tested pretty thoroughly, any bugs noticed should be reported immediately. There is a known issue/exploit; there\\'s no way for me to detect which NPC is a follower, multiple followers, or attach a var to an individual NPC, so if you use this enchantment on your NPCs and followers, the effect will stack (2 pieces each on 2 different NPCs will result in both of them being at 99% while sneaking). This is not a bug, but rather a scripting limitation.\r\n\r\n[b]Grey Cowl of Nocturnal / Mask of Nocturnal[/b] - Wearer becomes the Grey Fox, and all crimes committed while wearing the mask are attributed to the Grey Fox. Once the mask is removed, the wearer re-assumes their original identify and bounties. This one was tricky to get working right, and took a lot of cautious scripting and testing to keep the effect from glitching on the player. Warning: This effect WILL increase your total lifetime crime gold, so purists stay away.\r\n\r\n[b]Kyne\\'s Blessing[/b] - Reduces damage taken from animals and fortifies archery.\r\n\r\n[b]Nightweaver\\'s Band[/b] - Fortify sneak and destruction.\r\n\r\n[b]Spellbreaker[/b] - Requested by [i]roh234[/i]. This enchantment does not stack. Blocking creates a ward that blocks up to 50 points of magic damage. Can only be enchanted on a shield.\r\n\r\n[b]Weapon Projectiles[/b] - Fires leveled fireballs (based on the weilder\\'s destruction skill) made of the weilder\\'s magicka from the equipped weapon(s) when swinging (or bashing with a bow) AND the weilder has at least 75% health and 50% magicka.\r\n\r\n[center][b]New with v3.0[/b] - There is a radiant quest line introduced with this mod to find and collect rare atifacts enchanted with these unique enchantments. A courier will deliver you a message whenever the player has completed the quest requirements for a specific item, which are based on when you\\'d be able to receive these enchantments in-game. New enchantments are based on relevant quest lines (Grey Cowl of Noctrnal is Theives Guild, Magicka Arrows is College of Winterhold, etc). This message will contain the location of the item, and send you on a quest to go find it. Once obtained, the item can be used, tempered, disenchanted, etc. This radiant quest line includes mod conflict detection, which will trigger if another mod has altered a resource required for the artifact item to be properly placed. If this happens, that particular artifact item is given to the player as if they found it, clearing out the quest and progressing it to the next item, preventing any issues.\r\n\r\nIf you still want the older nerfed items via the old method of crafting, open the console and type \\\"help UUE\\\". You will see a form ID and a perk called \\\"UUE Cheater Perk\\\", so now type \\\"player.addperk \\\" followed by the form ID number (it will be xx0233F2 where the first 2 digits are from your load order). Once the player has this perk the radiant quest line will no longer trigger, and the items will be available to create for no cost at the forge, like in previous versions.\r\n\r\n[b]Prior to v3.0[/b] - All enchantments must still be learned by disenchanting an item. Because of this, I made a set of weapons and jewelry able to be forged for no-cost in order to learn these enchantments (they are in the misc category). The items have been completely nerfed so their only usefulness is disenchanting them. They also cannot be sold to merchants. I was considering replacing a chest\\'s contents, or adding a chest somewhere and putting a set in there, but it increased the potential of this mod interfering with another so I stuck with crafting instead.\r\n\r\n[size=+1][b]Installation Instructions:[/b][/size]\r\nSimply download and install with NMM or your mod manager of choice. For manual installation simply unzip and place the 2 files in your Data folder. Make sure you have the mod enabled in whichever launcher your using. Mod load order doesn\\'t matter; this mod does not have any known conflicts.\r\n\r\n[size=+1][b]Uninstallation Instructions:[/b][/size]\r\nRemove any items that use these enchantments from your character or any NPCs (followers, etc) before disabling or removing this mod. I recommend selling it all to a merchant and then waiting a couple days so their inventory refreshes and the items are truly gone before disabling or removing this mod.[/center]\r\n\r\nFuture Versions:\r\nChameleon effect shading to allow the user to see themselves easier in third-person.\r\nAdditional weapon and apparel unique enchantments, with user requested priority.\r\n\r\nThis mod has been properly cleaned with TES5EDIT, and does not contain any dirty or wild edits. Please contact me if you find a bug.\r\n\r\nChange log:\r\n3.3Beta - Coded a 1 instead of a 0 in the wrong place + fix for anyone affected by it.\r\n3.2Beta - Major quest line overhaul. All locations are now random and should progress properly. Added mod version tracking and fixes for previous versions.\r\n3.1 - Quest bug fixes, updated Magicka Arrows to use Mystic Binding and work with crossbows\r\n3.0 - Public release version - Added tempering for all new UUE Armor and Weapons, re-balance for Weapon Projectiles\r\n2.9 - Re-wrote Grey Cowl script fixing all known issues. Fixed minor bug with radiant quest, added mod conflict detection\r\n2.8 - Bug fixes for Grey Cowl, completely re-did radiant quest & script, fixed bugs, improved script efficiency\r\n2.7 - Added Grey Cowl of Nocturnal, bug fixes for radiant quest\r\n2.6 - Added Weapon Projectiles, added radiant quest\r\n2.5 - Public release version - Many bug fixes for Chameleon enchantment, re-balance of several effects, many chance-based effects now have the chance % altered by the player\\'s enchanting skill. New effects since the last major release include Chameleon, Magicka Arrows, Reanimate, and Silence.\r\n2.4 - Added Chameleon enchantment, bug fixes for Magicka Arrows and Reanimate, re-balance for Reanimate and Silence. Added more chance-based effects to scale with the player\\'s enchanting skill.\r\n2.3 - Added Magicka Arrows, bug fixes for Reanimate and Silence, started altering chance-based effects to scale with the player\\'s enchanting skill.\r\n2.2 - Added Reanimate and Silence enchantments\r\n2.1 - Fixed issue with Spellbreaker enchantment remaining active.\r\n2.0 - Major overhaul. Added many new enchantments, fixing dozens of issues and re-balancing several effects along the way. Enchantments added - Valdr\\'s Luck, Backstab, Archmage Blessing, Trolls Bane, Red Eagles Bane, Bloodthorn, Mace of Molag Bal, Kyne\\'s Blessing, Nightingale Sword, Nightingale Bow, Chillrend, Nightweaver Band, Briarheart Geis, and Spellbreaker.\r\n1.0 - Added Silver Sword, Harkon\\'s Sword, Keening, & Windshear. Fixed broken effect on Mehrunes\\' Razor and added insta-killed message when effect is applied. Added shock damage to non-dragons on dragon bane and changed description. Added elf-vampires to Wuuthrad.\r\n0.9 - initial release / release candidate\r\n\r\n[size=+1][b][url=http://skyrim.nexusmods.com/mods/29017]If you want the unique items some of these enchantments came from to be craftable, upgradable, and enchantable, check out my other mod. http://skyrim.nexusmods.com/mods/29017[/url][/b][/size]",
  "categoryId": "75",
  "version": "3.3BETA",
  "author": "Blazie151",
  "createdUnix": "1356732630",
  "updatedUnix": "1375142396",
  "containsAdultContent": false,
  "uploadedBy": "blazie151",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014876",
      "name": "UnlockUniqueEnchantments3_1",
      "version": "3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "UnlockUniqueEnchantments3_1-29059-3-1.zip",
      "uploadedUnix": "1362353897",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/f5ed75ec0ce8e47191dba2f601f9658bb586c61c4bb40b6f9dee8dfd19a42e5e/analysis/1407451503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UnlockUniqueEnchantments3_1-29059-3-1.zip?fid=1000014876&ttl=1535802906&ri=8192&rs=8192&setec=d2e6f4dd07a6cba918692c4ebebfba4d"
    },
    {
      "fileId": "1000042225",
      "name": "UnlockUniqueEnchantments3_3BETA",
      "version": "3.3BETA",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "21",
      "fileName": "UnlockUniqueEnchantments3_3BETA-29059-3-3BETA.7z",
      "uploadedUnix": "1375142396",
      "modVersion": "3.3BETA",
      "virusScanUrl": "https://www.virustotal.com/file/b903f927a1c333295341f60e8a5ce0c53b6630db9433ad7770ef3c5a0e17caf5/analysis/1407660625/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UnlockUniqueEnchantments3_3BETA-29059-3-3BETA.7z?fid=1000042225&ttl=1535802907&ri=8192&rs=8192&setec=63647cd234d74011d939ee640f6d61bd"
    }
  ]
}