{
  "modId": 29061.0,
  "modName": "SkyRealism - Perk Trees",
  "summary": "Rebalanced Perk Trees for Skyrim.",
  "descriptionHtml": "[img=center]http://static-2.nexusmods.com/15/mods/110/images/29061-1-1363659083.png[/img]\r<br />[center][i]Rebalanced Perk Trees for Skyrim[/i][/center][center][color=black][i]by MTichenor[/i][/color][/center]\r<br />\r<br />[color=yellow][b]NOTICE: [/b][/color]If you find a bug, please report it&#33; I can&#39;t fix it if I don&#39;t know about it. Also, send me a PM to get ahold of me faster if you have problems.\r<br />\r<br />[color=yellow][b]NOTICE: [/b][/color]If you have recommendations regarding new perks, perk balancing, or changes to perks, please let me know&#33; I may not implement the changes, but I&#39;ll always consider them&#33;\r<br />\r<br />[heading]Overview[/heading]Have you ever wondered why the Skyrim Perk Trees don&#39;t actually match their images? Why the perks you need are worthless by the time you meet the requirements? Why the prerequisites for a perk rarely have anything to do with it?\r<br />\r<br />I do.\r<br />\r<br />This is why I&#39;ve changed all the perk trees to match their pictures, and converted many of them to be radially oriented, granting a far greater degree of freedom in perk choices. Many of the perk trees have been heavily rebalanced based on suggestions from many other players.\r<br />\r<br />In addition, many perk requirements have been changed, though skill requirements for each perk are usually the same. Several new perks have been added to the Light Armor, Heavy Armor, and Sneak perk trees. \r<br />\r<br />[heading]Alchemy[/heading]Alchemy Tree is now radial, with 3 paths: Physician, Poisoner, and Experimentor.\r<br />\r<br />[list][*]Alchemist (0/5): Potions and poisons you make are 20% stronger. \r<br />[*]Poisoner: Poisons you mix are 25% more effective. Requirements: Alchemy 20, Alchemist.\r<br />[*]Concentrated Poison: Poisons applied to weapons last for twice as many hits. Requirements: Alchemy 40, Poisoner.\r<br />[*]Experimenter (0/3): Eating an ingredient reveals first 2/3/4 effects. Requirements: Alchemy 20, Alchemist.\r<br />[*]Green Thumb: Two ingredients are gathered from plants. Requirements: Alchemy 50, Experimenter.\r<br />[*]Physician: Potions you mix that restore Health, Magicka or Stamina are 25% more powerful. Requirements: Alchemy 20, Alchemist.\r<br />[*]Benefactor: Potions you mix with beneficial effects have an additional 25% greater magnitude. Requirements: Alchemy 40, Physician.\r<br />[*]Snakeblood: 50% resistance to all poisons. Requirements: Alchemy 70, Green Thumb, Benefactor, or Concentrated Poison.\r<br />[*]Purity: All negative effects are removed from created potions, and all positive effects are removed from created poisons. Requirements: Alchemy 100, Snakeblood.[/list]\r<br />[heading]Alteration[/heading]Alteration Tree is now radial, with 4 paths: Magic Defense, Physical Defense, Duration, and Mastery.\r<br />\r<br />[list][*]Novice Alteration: Cast Novice level Alteration spells for half magicka.\r<br />[*]Apprentice Alteration: Cast Apprentice level Alteration spells for half magicka. Requirements: Alteration 25, Novice Alteration.\r<br />[*]Adept Alteration: Cast Adept level Alteration spells for half magicka. Requirements: Alteration 50, Apprentice Alteration.\r<br />[*]Expert Alteration: Cast Expert level Alteration spells for half magicka. Requirements: Alteration 75, Adept Alteration.\r<br />[*]Master Alteration: Cast Master level Alteration spells for half magicka. Requirements: Alteration 100, Expert Alteration.\r<br />[*]Alteration Dual Casting: Dual casting an Alteration spell overcharges the effects into an even more powerful version. Requirements: Alteration 20, Novice Alteration.\r<br />[*]Stability: Alteration spells have greater duration. Requirements: Alteration 70, Alteration Dual Casting.\r<br />[*]Magic Resistance (0/3): Blocks 10% of a spell&#39;s effects. Requirements: Alteration 30, Novice Alteration.\r<br />[*]Mage Armor (0/3): Protection spells like Stoneflesh are twice as strong if not wearing armor. Alteration 30, Novice Alteration.\r<br />[*]Atronach: Absorb 30% of the magicka of any spells that hit you. Requirements: Alteration 100, Mage Armor, Magic Resistance.[/list]\r<br />[heading]Archery[/heading]Archery Tree is now bisected, with 3 paths: Accuracy, Power, and Speed.\r<br />\r<br />[list][*]Hunter&#39;s Discipline: Recover twice as many arrows from dead bodies.\r<br />[*]Critical Shot (0/3): 10% chance of a critical hit that does extra damage. Requirements: Archery 30, Hunter&#39;s Discipline.\r<br />[*]Bullseye: 15% chance of paralyzing the target for a few seconds. Requirements: Archery 100, Critical Shot.\r<br />[*]Overdraw (0/5): Bows do 20% more damage.\r<br />[*]Ranger: Able to move faster with a drawn bow. Requirements: Archery 30, Overdraw.\r<br />[*]Quick Shot: Can draw a bow 30% faster. Requirements: Archery 50, Ranger.\r<br />[*]Eagle Eye: Pressing Block while aiming will zoom in your view. Requirements: Archery 30, Overdraw.\r<br />[*]Steady Hand (0/2): Zooming in with a bow slows time by 25%. Requirements: Archery 50, Eagle Eye.\r<br />[*]Power Shot: Arrows stagger all but the largest opponents 50% of the time. Requirements: Archery 70, Quick Shot or Steady Hand.[/list]\r<br />[heading]Block[/heading]Block Tree is now radial, with 4 paths: Bashing, Moving, Deflection, and Reaction.\r<br />\r<br />[list][*]Shield Wall (0/5): Blocking is 20% more effective.\r<br />[*]Power Bash: Able to do a power bash. Requirements: Block 30, Shield Wall.\r<br />[*]Deadly Bash: Bashing does five times more damage. Requirements: Block 50, Power Bash.\r<br />[*]Disarming Bash: Chance to disarm when power bashing. Requirements: Block 70, Power Bash or Quick Reflexes.\r<br />[*]Quick Reflexes: Time slows down if you are blocking during an enemy&#39;s power attack. Requirements: Block 30, Shield Wall.\r<br />[*]Deflect Arrows: Arrows that hit the shield do no damage. Requirements: Block 30, Shield Wall.\r<br />[*]Elemental Protection: Blocking with a shield reduces incoming fire, frost, and shock damage by 50%. Requirements: Block 60, Quick Reflexes and Deflect Arrows.\r<br />[*]Block Runner: Able to move faster with a shield raised. Requirements: Block 50, Shield Wall.\r<br />[*]Shield Charge: Sprinting with a shield raised knocks down most targets. Requirements: Block 100, Block Runner.[/list]\r<br />[heading]Conjuration[/heading]Conjuration Tree is now radial, with 5 paths: Mastery, Necromancy, Atromancy, Binding, and Summoning. Adds 1 rank of Mystic Binding, which allows bound weapon damage to scale with Conjuration skill.\r<br />\r<br />[list][*]Novice Conjuration: Cast Novice level Conjuration spells for half magicka.\r<br />[*]Apprentice Conjuration: Cast Apprentice level Conjuration spells for half magicka. Requirements: Conjuration 25, Novice Conjuration.\r<br />[*]Adept Conjuration: Cast Adept level Conjuration spells for half magicka. Requirements: Conjuration 50, Apprentice Conjuration.\r<br />[*]Expert Conjuration: Cast Expert level Conjuration spells for half magicka. Requirements: Conjuration 75, Adept Conjuration.\r<br />[*]Master Conjuration: Cast Master level Conjuration spells for half magicka. Requirements: Conjuration 100, Expert Conjuration.\r<br />[*]Atromancy: Double duration for conjured Atronachs. Requirements: Conjuration 40, Novice Conjuration.\r<br />[*]Elemental Potency: Conjured Atronachs are 50% more powerful. Requirements: Conjuration 80, Atromancy.\r<br />[*]Necromancy: Greater duration for reanimated undead. Requirements: Conjuration 40, Novice Conjuration.\r<br />[*]Dark Souls: Reanimated undead have 100 points more health. Requirements: Conjuration 70, Necromancy.\r<br />[*]Mystic Binding (0/2): Bound weapons do more damage. Requirements: Conjuration 20, Novice Conjuration.\r<br />[*]Soul Stealer: Bound weapons cast Soul Trap on targets. Requirements: Conjuration 40, Mystic Binding.\r<br />[*]Oblivion Binding: Bound weapons will banish summoned creatures and turn raised ones. Requirements: Conjuration 60, Soul Stealer.\r<br />[*]Conjuration Dual Casting: Dual casting a Conjuration spell overcharges the spell, allowing it to last longer. Requirements: Conjuration 20, Novice Conjuration.\r<br />[*]Summoner (0/2): Can summon atronachs or raise undead twice as far away. Requirements: Conjuration 50, Conjuration Dual Casting.\r<br />[*]Twin Souls: You can have two atronachs or reanimated zombies. Requirements: Conjuration 100, Summoner.[/list]\r<br />[heading]Destruction[/heading]Destruction Tree has had 2 additional ranks added to each elemental specialization.\r<br />\r<br />[list][*]Novice Destruction: Cast Novice level Destruction spells for half magicka.\r<br />[*]Apprentice Destruction: Cast Apprentice level Destruction spells for half magicka. Requirements: Destruction 25, Novice Destruction.\r<br />[*]Adept Destruction: Cast Adept level Destruction spells for half magicka. Requirements: Destruction 50, Apprentice Destruction.\r<br />[*]Expert Destruction: Cast Expert level Destruction spells for half magicka. Requirements: Destruction 75, Adept Destruction.\r<br />[*]Master Destruction: Cast Master level Destruction spells for half magicka. Requirements: Destruction 100, Expert Destruction.\r<br />[*]Destruction Dual Casting: Dual casting a Destruction spell overcharges the effects into an even more powerful version. Requirements: Destruction 20, Novice Destruction.\r<br />[*]Impact: Most destruction spells will stagger an opponent when dual cast. Requirements: Destruction 40, Destruction Dual Casting.\r<br />[*]Rune Master: Can place runes five times farther away. Requirements: Destruction 40,  Apprentice Destruction.\r<br />[*]Augmented Shock (0/4): Shock spells do 25% more damage. Requirements: Destruction 25, Novice Destruction.\r<br />[*]Disintegrate: Shock damage disintegrates targets if their health is low. Requirements: Destruction 70, Augmented Shock.\r<br />[*]Augmented Frost (0/4): Frost spells do 25% more damage. Requirements: Destruction 25, Novice Destruction.\r<br />[*]Deep Freeze: Frost damage paralyzes targets if their health is low. Requirements: Destruction 60, Augmented Frost.\r<br />[*]Augmented Fire (0/4): Fire spells do 25% more damage. Requirements: Destruction 25, Novice Destruction.\r<br />[*]Intense Flames: Fire damage causes targets to flee if their health is low. Requirements: Destruction 50, Augmented Flames.[/list]\r<br />[heading]Enchanting[/heading]Enchanting Tree is now radial, with 4 forking paths: Elemental Enchanter, Soul Thief, Twin Secrets, and Corpus Enchanter. The Enchanter perk is now half as effective.\r<br />\r<br />[list][*]Soul Thief: All attacks with weapons automatically trap the victims soul. Requirements: Enchanting 25.\r<br />[*]Soul Squeezer: Soul gems provide double magicka for recharging. Requirements: Enchanting 50, Soul Thief.\r<br />[*]Soul Siphon: Death blows to creatures, but not people, trap 5% of the victim&#39;s soul, recharging the weapon. Requirements: Enchanting 50, Soul Thief.\r<br />[*]Corpus Enchanter: Health, magicka, and stamina enchantments on armor are 25% stronger. Requirements: Enchanting 30.\r<br />[*]Enervating Enchanter: Health, magicka, and stamina enchantments on weapons are 25% stronger. Requirements: Enchanting 60, Corpus Enchanter.\r<br />[*]Insightful Enchanter: Skill enchantments on armor are 25% stronger. Requirements: Enchanting 60, Corpus Enchanter.\r<br />[*]Enchanter (0/5): Fire, Frost, and Shock enchantments on weapons and armor are 10% stronger.\r<br />[*]Twin Secrets (0/2): Can put two enchantments on the same item, but all enchantments are half as powerful. Requirements: Enchanting 50, Enchanter.\r<br />[*]Elemental Enchanter: Fire, Frost, and Shock enchantments on weapons and armor are 10% stronger. Requirements: Enchanting 25, Enchanter.\r<br />[*]Frost Enchanter: Frost enchantments on weapons and armor are 25% stronger. Requirements: Enchanting 50, Elemental Enchanter.\r<br />[*]Fire Enchanter: Fire enchantments on weapons and armor are 25% stronger. Requirements: Enchanting 50, Elemental Enchanter.\r<br />[*]Shock Enchanter: Shock enchantments on weapons and armor are 25% stronger. Requirements: Enchanting 50, Elemental Enchanter.[/list]\r<br />[heading]Heavy Armor[/heading]Heavy Armor Tree is now radial with 2 forking paths: Offense and Defense. Several new perks have been added, and skill requirements changed.\r<br />\r<br />[list][*]Juggernaut (0/5): Increases armor rating for Heavy Armor by 20%.\r<br />[*]Cushioned: Half damage from falling if wearing all Heavy Armor: head, chest, hands, feet. Requirements: Heavy Armor 50, Juggernaut.\r<br />[*]Well Fitted: 25% Armor bonus if wearing all Heavy Armor: head, chest, hands, feet. Requirements: Heavy Armor 30, Juggernaut.\r<br />[*]Colossus: You receive 50% less stagger when wearing only Heavy Armor. Requirements: Heavy Armor 60, Well Fitted.\r<br />[*]Matching Set: Additional 20% Armor bonus if wearing a matched set of Heavy Armor. Requirements: Heavy Armor 60, Well Fitted.\r<br />[*]Elemental Protection: Reduces fire, frost, and shock damage by 50% if wearing a matched set of Heavy Armor. Requirements: Heavy Armor 100, Matching Set, and Cushioned.\r<br />[*]Fists of Steel: Unarmed attacks with Heavy Armor gauntlets do extra damage. Requirements: Heavy Armor 30, Juggernaut.\r<br />[*]Titan: You deal 50% more stagger when wearing only Heavy Armor. Requirements: Heavy Armor  60, Fists of Steel.\r<br />[*]Conditioning: Heavy Armor weighs nothing and doesn&#39;t slow you down when worn. Requirements: Heavy Armor 60, Fists of Steel.\r<br />[*]Reflect Blows: 10% chance to reflect melee damage back to the enemy while wearing all Heavy Armor: head, chest, hands, feet. Requirements: Heavy Armor 80, Conditioning.[/list]\r<br />[heading]Illusion[/heading]Illusion Tree is now radial, with 3 paths: Mastery, Internal, and External.\r<br />\r<br />[list][*]Novice Illusion: Cast Novice level Illusion spells for half magicka.\r<br />[*]Apprentice Illusion: Cast Apprentice level Illusion spells for half magicka. Requirements: Illusion 25, Novice Illusion.\r<br />[*]Adept Illusion: Cast Adept level Illusion spells for half magicka. Requirements: Illusion 50, Apprentice Illusion.\r<br />[*]Expert Illusion: Cast Expert level Illusion spells for half magicka. Requirements: Illusion 75, Adept Illusion.\r<br />[*]Master Illusion: Cast Master level Illusion spells for half magicka. Requirements: Illusion 100, Expert Illusion.\r<br />[*]Illusion Dual Casting: Dual casting an Illusion spell overcharges the effects into an even more powerful version. Requirements: Illusion 20, Novice Illusion.\r<br />[*]Animage: Illusion spells now work on higher level animals. Requirements: Illusion 30, Illusion Dual Casting.\r<br />[*]Kindred Mage: All Illusion spells work on higher level people. Requirements: Illusion 50, Animage.\r<br />[*]Master of the Mind: Illusion spells work on undead, daedra and automatons. Requirements: Illusion 70, Kindred Mage.\r<br />[*]Quiet Casting: All spells you cast from any school of magic are silent to others. Requirements: Illusion 30, Novice Illusion.\r<br />[*]Hypnotic Gaze: Calm spells now work on higher level opponents. Cumulative with Kindred Mage and Animage. Requirements: Illusion 40, Quiet Casting.\r<br />[*]Aspect of Terror: Fear spells work on higher level opponents. Cumulative with Kindred Mage and Animage. Requirements: Illusion 50, Hypnotic Gaze.\r<br />[*]Rage: Frenzy spells work on higher level opponents. Cumulative with Kindred Mage and Animage. Requirements: Illusion 70, Aspect of Terror.[/list]\r<br />[heading]Light Armor[/heading]Light Armor Tree is now radial, with 4 paths: Offense, Recovery, Utility, and Defense. Several new perks have been added, and many skill requirements changed.\r<br />\r<br />[list][*]Agile Defender (0/5): Increase armor rating for Light armor by 20%.\r<br />[*]Fists of Lightning: Unarmed attacks are 50% faster while wearing Light Armor gauntlets, clothing, or bare fists. Requirements: Light Armor 30, Agile Defender.\r<br />[*]Wind Walker: Stamina regenerates 50% faster in all Light Armor: head, chest, hands, feet. Requirements: Light Armor 50, Agile Defender.\r<br />[*]Whirlwind: Move 20% faster when wearing only Light Armor or clothing. Requirements: Light Armor 80, Fists of Lightning, and Wind Walker.\r<br />[*]Unhindered: Light Armor weighs nothing and doesn&#39;t slow you down when worn. Requirements: Light Armor 40, Agile Defender.\r<br />[*]Cloud Dancer: Half damage from falling if wearing only Light Armor or clothing. Requirements: Light Armor 70, Unhindered, and Wind Walker.\r<br />[*]Custom Fit: 25% Armor bonus if wearing all Light Armor: head, chest, hands, feet. Requirements: Light Armor 30, Agile Defender.\r<br />[*]Deft Movement: 10% chance of avoiding all damage from a melee attack while wearing all Light Armor: head, chest, hands, feet. Requirements: Light Armor 70, Custom Fit, and Unhindered.\r<br />[*]Matching Set: Additional 20% Armor bonus if wearing a matched set of Light Armor. Requirements: Light Armor 60, Custom Fit.\r<br />[*]Elemental Protection: Reduces fire, frost, and shock damage by 50% if wearing a matched set of Light Armor. Requirements: Light Armor 100, Matching Set, Deft Movement.[/list]\r<br />[heading]One-Handed[/heading]One-Handed Tree is now radial with 3 forking paths: Tactics, Maneuvers, and Dual-Wielding. Weapon type prerequisites have been removed from Bone Breaker, Bladesman (Finesse), and Hack and Slash.\r<br />\r<br />[list][*]Armsman: One-Handed weapons do 20% more damage.\r<br />[*]Fighting Stance: Power attacks with one-handed weapons cost 25% less stamina. Requirements: One-Handed 20,  Armsman.\r<br />[*]Critical Charge: Can do a one-handed power attack while sprinting that does double critical damage. Requirements: One-Handed 50, Fighting Stance.\r<br />[*]Paralyzing Strike: Backwards power attack has a 25% chance to paralyze the target. Requirements: One-Handed 100, Critical Charge.\r<br />[*]Dual Flurry (0/2): Dual wielding attacks are 20% faster. Requirements: One-Handed 30, Armsman.\r<br />[*]Dual Savagery (0/2): Standing power attacks hit all enemies in front of you while dual wielding. Requirements: One-Handed 50, Dual Flurry.\r<br />[*]Finesse (0/3): Attacks with one-handed weapons have a 10% chance of doing critical damage. Requirements: One-Handed 30, Armsman.\r<br />[*]Bone Breaker (0/3): Attacks with one-handed weapons ignore 25% of armor. Requirements: One-Handed 30, Armsman.\r<br />[*]Hack and Slash (0/3): Attacks with one-handed weapons cause extra bleeding damage. Requirements: One-Handed 30, Armsman.\r<br />[*]Savage Strike: Standing power attacks do 25% bonus damage with a chance to decapitate your enemies. Requirements: One-Handed 50, Finesse, Bone Breaker, or Hack and Slash.[/list]\r<br />[heading]Pickpocket[/heading]Pickpocket Tree is now radial, with 2 forking paths: Utility and Acquisition.\r<br />\r<br />[list][*]Light Fingers (0/5): Pickpocketing bonus of 20%. Item weight and value reduce pickpocketing odds.\r<br />[*]Night Thief: +25% chance to pickpocket if the target is asleep. Requirements: Pickpocket 30, Light Fingers.\r<br />[*]Poisoned: Silently harm enemies by placing poisons in their pockets. Requirements: Pickpocket 40, Night Thief.\r<br />[*]Extra Pockets: Carrying capacity is increased by 100. Requirements: Pickpocket 50, Night Thief.\r<br />[*]Cutpurse: Pickpocketing gold is 50% easier. Requirements: Pickpocket 30, Light Fingers.\r<br />[*]Keymaster: Pickpocketing keys almost always works. Requirements: Pickpocket 40, Light Fingers.\r<br />[*]Misdirection: Can pickpocket equipped weapons. Requirements: Pickpocket 70, Cutpurse.\r<br />[*]Perfect Touch: Can pickpocket equipped items. Requirements: Pickpocket 100, Cutpurse, and Keymaster.[/list]\r<br />[heading]Restoration[/heading]Restoration Tree is now radial, with one perk for each feather and a Mastery path for the head.\r<br />\r<br />[list][*]Novice Restoration: Cast Novice level Restoration spells for half magicka.\r<br />[*]Apprentice Restoration: Cast Apprentice level Restoration spells for half magicka. Requirements: Restoration 25, Notice Restoration.\r<br />[*]Adept Restoration: Cast Adept level Restoration spells for half magicka. Requirements: Restoration 50, Apprentice Restoration.\r<br />[*]Expert Restoration: Cast Expert level Restoration spells for half magicka. Requirements: Restoration 75, Adept Restoration.\r<br />[*]Master Restoration: Cast Master level Restoration spells for half magicka. Requirements: Restoration 100, Expert Restoration.\r<br />[*]Recovery (0/2): Magicka regenerates 25% faster. Requirements: Restoration 30, Novice Restoration.\r<br />[*]Avoid Death: Once a day, heals 250 points automatically if you fall below 10% health. Requirements: Restoration 50, Novice Restoration.\r<br />[*]Necromage: All spells are more effective against undead. Requirements: Restoration 70, Novice Restoration.\r<br />[*]Restoration Dual Casting: Dual casting a Restoration spell overcharges the effects into an even more powerful version. Requirements: Restoration 20, Novice Restoration.\r<br />[*]Ward Absorb: Wards recharge your magicka when hit with spells. Requirements: Restoration 60, Novice Restoration.\r<br />[*]Respite: Healing spells also restore Stamina. Requirements: Restoration 40, Novice Restoration.\r<br />[*]Regeneration: Healing spells cure 50% more. Requirements: Restoration 20, Novice Restoration.[/list]\r<br />[heading]Sneak[/heading]Sneak Tree is now radial, with 3 paths: Sight, Sound, and Tactics. Two new perks have been added, and the Stealth perk has been rebalanced.\r<br />\r<br />[list][*]Stealth (0/5): Increases your effective stealth skill by 10.\r<br />[*]Light Food: You won&#39;t trigger pressure plates. Requirements: Sneak 30, Stealth.\r<br />[*]Muffled Movement: Noise from armor is reduced 50%. Requirements: Sneak 30, Stealth.\r<br />[*]Silent Roll: Sprinting while sneaking executes a silent forward roll. Requirements: Sneak 50, Light Foot, or Silence.\r<br />[*]Silence: Walking and running does not affect detection. Requirements: Sneak 70, Muffled Movement, or Silent Roll.\r<br />[*]Shadow Walker (0/2): Increases the amount of light required to detect you by 25%. Requirements: Sneak 25, Stealth.\r<br />[*]Cloak of Shadows: While hiding in shadows and out of combat, you become completely invisible. Requirements: Sneak 75, Shadow Walker.\r<br />[*]Shadow Warrior: Crouching stops combat for a moment and forces distant opponents to search for a target. Requirements: Sneak 100, Cloak of Shadows.\r<br />[*]Backstab: Sneak attacks with one-handed weapons now do six times damage. Requirements: Sneak 30, Stealth.\r<br />[*]Deadly Aim: Sneak attacks with bows now do three times damage. Requirements: Sneak 40, Backstab.\r<br />[*]Assassin&#39;s Blade: Sneak attacks with daggers now do a total of twelve times normal damage. Requirements: Sneak 50, Deadly Aim.[/list]\r<br />[heading]Speech[/heading]Speech Tree is now bisected, with 4 paths: Trading, Fencing, Bribery, and Intimidation. One new perk has been added and some skill requirements changed. Haggling has been improved.\r<br />\r<br />[list][*]Haggling (0/5): Buying and selling prices are 10% better.\r<br />[*]Investor: Can invest 500 gold with a shopkeeper to increase his available gold permanently. Requirements: Speech 30, Haggling.\r<br />[*]Fence: Can barter stolen goods with any merchant you have invested in. Requirements: Speech 60, Investor.\r<br />[*]Merchant: Can sell any type of item to any kind of merchant. Requirements: Speech 50, Haggling.\r<br />[*]Master Trader: Every merchant in the world gains 1000 gold for bartering. Requirements: Speech 100, Merchant.\r<br />[*]Persuasion: Persuasion attempts are 30% easier.\r<br />[*]Allure: 10% better prices with the opposite sex. Requirements: Speech 40, Persuasion.\r<br />[*]Bribery: Can bribe guards to ignore crimes. Requirements: Speech 60, Allure.\r<br />[*]Intimidation: Intimidation is twice as successful. Requirements: Speech 30, Persuasion.\r<br />[*]Argumentative: Reduces the cooldown on Shouts by 30%. Requirements: Speech 60, Intimidation.[/list]\r<br />[heading]Smithing[/heading]Smithing Tree is now radial, with 5 paths: Arcane, Dwarven, Orcish, Elven, and Advanced. All smithing specializations now have 3 ranks.\r<br />\r<br />[list][*]Steel Smithing (0/3): Can create Steel armor and weapons at forges.\r<br />[*]Dwarven Smithing (0/3): Can create Dwarven armor and weapons at forges. Requirements: Smithing 30, Steel Smithing.\r<br />[*]Orcish Smithing (0/3): Can create Orcish armor and weapons at forges. Requirements: Smithing 40, Steel Smithing.\r<br />[*]Elven Smithing (0/3): Can create Elven armor and weapons at forges. Requirements: Smithing 30, Steel Smithing.\r<br />[*]Glass Smithing (0/3): Can create Glass armor and weapons at forges. Requirements: Smithing 65, Elven Smithing.\r<br />[*]Arcane Blacksmith: You can improve magical weapons and armor. Requirements: Smithing 40, Steel Smithing.\r<br />[*]Advanced Armors (0/3): Can create Scaled and Plate armor at forges. Requirements: Smithing 40, Steel Smithing.\r<br />[*]Ebony Smithing (0/3): Can create Ebony armor and weapons at forges. Requirements: Smithing 65, Advanced Armors.\r<br />[*]Dragon Armor (0/3): Can create Dragon armor and Dragonbone weapons at forges. Requirements: Smithing 100, Ebony Smithing.\r<br />[*]Daedric Smithing (0/3): Can create Daedric armor and weapons at forges. Requirements: Smithing 100, Arcane Blacksmith, Ebony Smithing.[/list]\r<br />[heading]Two-Handed[/heading]Two-Handed Tree is now radial, with 2 forking paths: Tactics and Maneuvers. Weapon type prerequisites have been removed from Deep Wounds, Limbsplitter, and Skullcrusher.\r<br />\r<br />[list][*]Barbarian (0/5): Two-Handed weapons do 20% more damage.\r<br />[*]Champion&#39;s Stance: Power attacks with two-handed weapons cost 25% less stamina. Requirements: Two-Handed 20, Barbarian.\r<br />[*]Great Critical Charge: Can do a two-handed power attack while sprinting that does double critical damage. Requirements: Two-Handed 50, Champion&#39;s Stance.\r<br />[*]Sweep: Sideways power attacks with two-handed weapons hit all targets in front of you. Requirements: Two-Handed 60, Champion&#39;s Stance.\r<br />[*]Warmaster: Backwards power attack has a 25% chance to paralyze the target. Requirements: Two-Handed 100, Sweep.\r<br />[*]Limbsplitter (0/3): Attacks with two-handed weapons cause extra bleeding damage. Requirements: Two-Handed 30, Barbarian.\r<br />[*]Skullcrusher (0/3): Attacks with two-handed weapons ignore 25% of armor. Requirements: Two-Handed 30, Barbarian.\r<br />[*]Deep Wounds (0/3): Attacks with two-handed weapons have a 10% chance of doing critical damage. Requirements: Two-Handed 30, Barbarian.\r<br />[*]Devastating Blow: Standing power attacks do 25% bonus damage with a chance to decapitate your enemies. Requirements Two-Handed 50, Limbsplitter, Skullcrusher, or Deep Wounds.[/list]\r<br />[heading]Installation, Requirements, and Load Order[/heading]This mod requires Dawnguard.\r<br />\r<br />[heading]Compatibility, Issues, and Troubleshooting[/heading]This mod will not work well with existing games. It is recommended that you start a new game.\r<br />\r<br />[heading]Change Log[/heading][b]v1.0d[/b]\r<br />Added second rank to Dual Savagery. Changed 1st rank to provide Sweep Attack.\r<br />\r<br />[b]v1.0c[/b]\r<br />Fixed Elemental Protection (Light Armor) perk requirements.\r<br />Fixed Wind Walker perk requirements.\r<br />Fixed Titan perk restrictions.\r<br />Changed Reflect Blows perk requirements.\r<br />\r<br />[b]v1.0b[/b]\r<br />Fixed Quiet Casting perk requirements.\r<br />Fixed Soul Thief perk benefits.\r<br />Added Mystic Binding rank 2.\r<br />\r<br />[b]v1.0a[/b]\r<br />Initial Release.",
  "categoryId": "24",
  "version": "1.0",
  "author": "MTichenor",
  "createdUnix": "1356737326",
  "updatedUnix": "1357043205",
  "containsAdultContent": false,
  "uploadedBy": "MTichenor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "108867",
      "name": "SkyRealism - Unbalanced Perk Trees",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "SkyRealism - Unbalanced Perk Trees-29061-1-0.7z",
      "uploadedUnix": "1357043176",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f07a037d827aeed87f45ab8be77f6763914b9ea0ea80a5b57bdb7fde6b4841c6/analysis/1407332163/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Unbalanced%20Perk%20Trees-29061-1-0.7z?fid=108867&ttl=1535802909&ri=8192&rs=8192&setec=867b7eac175f92c854dd9eb2c0f8ac2d"
    },
    {
      "fileId": "108868",
      "name": "SkyRealism - Balanced Perk Trees",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18",
      "fileName": "SkyRealism - Balanced Perk Trees-29061-1-0.7z",
      "uploadedUnix": "1357043205",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8f38d5b7edcb772bc9bc3fc6a96278d1780920435eeb5ffd527d8a7642dbb50e/analysis/1407332163/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Balanced%20Perk%20Trees-29061-1-0.7z?fid=108868&ttl=1535802910&ri=8192&rs=8192&setec=6264bc2a029d352abc0123881f8803b0"
    }
  ]
}