{
  "modId": 29103.0,
  "modName": "Protect My Citizens -German- -Deutsch-",
  "summary": "Vampirangriff! Banditenüberfall! Wilde Tiere außer Kontrolle! So sterben jedesmal einige der liebsten Dorfbewohner einen grausamen Tod. Das muss nicht sein! Nun werden die Dorfbewohner sogar mit der Unsterblichkeit gesegnet! So können diese mit Hilfe des Drachenblutes genüsslich die Angreifer vernichten ohne ihr eigenes Leben zu riskieren.",
  "descriptionHtml": "[i]\\\"Wollt Ihr Euch schützen oder Schaden austeilen?\\\" - Alvor[/i]\r\n\r\n[b]Beschreibung:[/b]\r\nVampirangriff! Banditenüberfall! Wilde Tiere außer Kontrolle! Die Bewohner fürchten um ihr Leben. Jedoch versuchen sie sich lieber selbst von der Bedrohung zu entledigen, anstatt die in einer großen Überzahl vorhandenen Wachen oder das Drachenblut kurz das ganze regeln zu lassen. So sterben jedesmal einige der liebsten Dorfbewohner einen grausamen Tod. Das muss nicht sein! Nun werden die Dorfbewohner sogar mit der Unsterblichkeit gesegnet! So können  diese mit Hilfe des Drachenblutes genüsslich die Angreifer vernichten ohne ihr eigenes Leben zu riskieren. Welch ein Luxus.\r\nJedoch hat das Drachenblut nach wie vor die Möglichkeit ihnen das Leben zu nehmen. \r\n\r\nKurz gesagt: In den von Angriffen am meisten geplagten Angriffen können die Dorfbewohner nicht mehr von anderen NPCs getötet werden. Jedoch hat der Spieler immmernoch die Möglichkeit sie zu töten, da ihnen lediglich der Flag \\\"Protected\\\" hinzugefügt wurde.\r\n\r\n[b]Aktuell enthaltene Städte:[/b] [i]Weißlauf, Flusswald, Mor Khazgur, Dushnikh Yal, Largashbur, Narzulbur[/i]\r\n\r\n[b]Scharesoft.de Thread:[/b] [i][url=http://forum.scharesoft.de/showthread.php?46252]http://forum.scharesoft.de/showthread.php?46252[/url][/i]",
  "categoryId": "33",
  "version": "1.1.0",
  "author": "littlepsycho",
  "createdUnix": "1356807281",
  "updatedUnix": "1356807697",
  "containsAdultContent": false,
  "uploadedBy": "littlepsycho11",
  "primaryFile": null,
  "files": [
    {
      "fileId": "108289",
      "name": "ProtectMyCitizens Main",
      "version": "1.1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "52",
      "fileName": "ProtectMyCitizens Main-29103-1-1-0.zip",
      "uploadedUnix": "1356807697",
      "modVersion": "1.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4af3e2d3bfb77fdafe64fbd0de672f1fd3c2c982dfa06e653b07804c2ecced65/analysis/1407327783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ProtectMyCitizens%20Main-29103-1-1-0.zip?fid=108289&ttl=1535802979&ri=8192&rs=8192&setec=8eb77495c0085b2bd98fabc21a331aab"
    }
  ]
}