{
  "modId": 29105.0,
  "modName": "Better Hearthfire Pets",
  "summary": "Changes the types of creatures can children can bring home as pets, and makes the two death hounds in Castle Volkihar adoptable, as well making some changes to Meeko.",
  "descriptionHtml": "I would like to start off saying that this is the first mod I\\'m uploading here on nexus, and thought it\\'d be something I could share.  I personally didn\\'t like the types of creatures that the children could bring home and did not see another mod that did something like this yet, so I decided to make it so that they could bring home and ask to keep some more interesting ones.  \r\n\r\nBOTH DAWNGUARD AND HEARTHFIRE DLC ARE REQUIRED!!!  MOST RECENT VERSION OF SKYRIM RECOMMENDED\r\n\r\n\r\n=========================================================================================\r\nWHAT THIS MOD DOES: \r\n\r\nIt simply changes the creature race of what ever critter the child decides to bring home, it does not affect AI at all and the change will take place on existing save as far as I can tell.  I\\'d also like to note that on the new save I\\'m using this on, the child hasn\\'t brought home a pet yet to confirm there is no conflict with bringing one home.  On an older save, installed after the child already brought one home, there was no issue with the pet changing races.   This mod also makes the two Death hounds, Garmr and CuSith, adoptable for those who side with vampires in Dawnguard, changes Meeko into an unarmored Husky who can also be adopted, and adds several other adoptable animal followers.   \r\n\r\n\r\n(v1.4) >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<\r\nNOW FINALLY COMPLETE!\r\n\r\n-adds a bunch of creatures that the player can have as animal followers and have a child ask to keep as a pet.  These new pets can be found in a stone pen right next to Battleborn Farm. The pen includes the following: \r\n\r\n-regular, snow, and vale sabrecat follower\r\n-brown, black, and snow bear follower\r\n-spriggan earth mother follower\r\n-wisp mother follower\r\n-werewolf follower (let\\'s just say hes a permanent werewolf... )\r\n-deathhound follower (for those who sided with dawnguard but would like a pet deathhound)\r\n-flamewolf follower\r\n-spectral warhound follower\r\n\r\n-- these followers are classed as animal followers, so you can still have a human follower in addition to the followers listed above.  Each one has been tested and is adoptable.\r\n\r\n-all of the new pets, as well Garmr, CuSith, Sceolang, Bran, and Meeko are set to level with the player up to lv300 (as you are able to legendary skills now) and do not affect stealth meter.  They also have an ability that gives them a high health regeneration in combat (just like shadowmere).  While they have the combat regen, they are set to Protected Status and are still killable by the player (especially with sneak attacks).  They are also set to respawn should they die (and you don\\'t wish to use console commands). Waiting 10 days inside a walled city/interior should do the trick.\r\n\r\nPlease note that Vigilance, the war dog you can hire in Markarth stables has not yet been modified in anyway (no regen ability), not quite sure yet what I plan to do with him.\r\n\r\nPLEASE take a look at the Known Issues section, as there are couple note worthy issues, nothing game-breaking though.\r\n\r\nI DO NOT yet have a version of v1.4 that does not modify the vanilla critters that the children bring home and instead only modifies/adds pets.  I\\'ll try to get this out when I\\'m not busy with work.\r\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<\r\n CHANGE LOG:\r\n\r\n(v1.3)\r\n-fixes issue where Meeko would not follow player into interior cells due to not being able to open doors.\r\n\r\n*UPDATE!*  As requested, there is now an optional version of v1.3 that only changes the deathhounds and meeko, the children\\'s pets are reverted back to vanilla.  \r\n\r\n(v1.2)\r\n-fixes bug where Meeko could not be interacted with after getting him to follow you\r\n\r\n-set the Bran, Sceolang, Garmr, CuSith, and Meeko to level all the way to lv81 with the player.\r\n\r\n(v1.1)\r\nWas able to find an old save that already had a children\\'s pet to try out some of the creatures that I didn\\'t get a chance to try yet *cough cough the slaughterfish cough*. While the slaughterfish did work, it didn\\'t seem to move very well, and so I swapped it for a different creature. \r\n\r\n-Changes which pets are swapped with the vanilla creatures, to make more sense which pets are brought home by a male (skeever/mudcrab) or female (fox/arctic fox/rabbit) child:\r\n\r\n-pet fox is now changed to Bubba the Bear \r\n-pet rabbit is now Gaia the Spriggan Matron\r\n-pet mudcrab is now Venom the Chaurus Reaper\r\n\r\nI would like to try and figure out a way to disable the sound effects for those crazy bees the spriggan has, and may try to make the bear a little quieter too.  But all of these don\\'t seem to have any issue moving around the house or following the child.\r\n\r\n\r\n(v1.0)\r\n-pet  skeever is changed into Goliath the Gargoyle\r\n-pet fox is changed into Snapper the Slaughterfish\r\n-pet arctic fox is changed into Snowfang the Snow Sabercat (using slof\\'s sabrecats retextures)\r\n-pet mudcrab is changed into Gaia the Spriggan Matron\r\n-pet rabbit is changed into Bubba the Bear\r\n\r\n-The Death Hounds Garmr and CuSith are now adoptable for vampires.  They are also set to level with the player and respawn should they die.  Lvling with player seems to be working fine, spawned 5 dawnguards at lv60 with Garmr and he was able to survive. Respawn still needs testing.\r\n\r\n*note* I did not make Garmr and CuSith essential because I didn\\'t want to make them unkillable for those who sided with the Dawnguard (haven\\'t played dawnguard side yet and wasn\\'t sure if that would be an issue)\r\n\r\n-the abandoned dog, Meeko, is now an unarmored husky, and is set to protected status as well as to respawn should he die (for those who sided with the vampires but would like to have a pet husky, and respawn also needs testing)\r\n=========================================================================================\r\nINSTALLATION\r\nShould be as simple as either downloading it with NMM or dropping the extracted .esp into Skyrim\\'s Data folder.\r\n\r\nFor v1.4 Manual install-  drop the .esp into the Data folder, all of the .pex files into Scripts, and .psc into source (.psc are optional and not really necessary for the mod to work)\r\n\r\nTO UPDATE\r\nDelete the old .esp and activate the new one for NMM, or drop it into the Data folder for manual. (for v1.4) Delete the old .esp and replace with the new one, add in the .pex files to skyrim/data/scripts\r\n\r\n TO UNINSTALL\r\nEither deactivate/delete the mod through NMM or just delete the \\'Better Hearthfire Pets.esp\\' from Skyrim\\'s Data folder, and all of the associated .pex from Skyrim/Data/Scripts.\r\n=========================================================================================\r\nBUGS/KNOWN ISSUES\r\n\r\n-(v1.4) \r\n-Sometimes animal followers will become bugged after combat.  You can initiate dialogue but cannot select any of the commands (wait, follow, go home).  Casting Courage, Pacify or some other similar spell on them usually fixes the problem, if that does not work try using Unrelenting Force shout on them. This issue is something I still have no idea how to fix, and may be an issue with followers in general. \r\n\r\n-SABER CATS.  They are extremely lazy.   Their animation for laying down and standing back up can take them a little while, so they are prone to not following you right away.  Can either try fast traveling or standing a decent distance away and they will follow. Eventually lol.\r\n\r\n-Sometimes a child may not ask to adopt an animal.  It seems random as to whether or not they ask, though more often than not they usually asked me to keep an animal.  If a child does not approach you about the animal, initiate dialogue with them.  If they do not give the dialogue to keep the animal try fast traveling to another location and then try again.  I have been able to successfully adopt all of the new animals so there shouldn\\'t be any issues.\r\n\r\n-When you adopt an animal and dismiss it outside of your house, it may start walking back to its original location near Battleborn Farm.  Not sure why it does this, but make the pet your follower again and dismiss it inside the house to fix it.\r\n\r\n-sometimes the animals in the pen near Battleborn Farm will get stuck in or outside the walls of the pen.  Dunno why this happens either.  I arranged them all nice and neatly in the creation kit, and they will usually spawn all over the place during actual gameplay.  So if you do not see all of them inside the pen, check around the outside of it, and if they\\'re stuck inside make them your follower as they will eventually teleport to you.  If you can\\'t initiate dialogue because they\\'re too far in, open the console (`) and type \\\"tcl\\\" to toggle off your collision to run through walls (make sure there are no targets selected, aka numbers in the top middle of the console window), get them to follow you and they\\'ll eventually pop out.  To enable collision again, simply enter tcl in again.  Fast traveling to another location and back may also fix the issue or pulling an enemy near the pen(they should aggro and teleport in an attempt to attack the enemy), but I have not personally tried it that way yet.\r\n\r\n-(v1.0 and v1.1) \r\n-Meeko will not follow player into their house or other interior cells, and cannot be interacted with after getting him to follow you.  Thanks to  tadest1  for pointing this out.  These issues have been fixed in newer versions, details listed under \\'What this mod does\\' section.\r\n\r\n I\\'d like to note that on the new save I\\'m using this on, the child hasn\\'t brought home a pet yet to confirm there is no conflict with bringing one home.  On an older save, installed after the child already brought one home, there was no issue with the pet changing races. \r\n\r\n\r\n-[General Issue] \r\nThe type of critter/pet stated in the dialog won\\'t match the creature that a child brings home.  This should be only cosmetic, and should not effect being able to keep the creature.  This is purely a cosmetic issue, and something I will not be fixing.\r\n\r\nThis mod has not undergone thorough testing.  The only thing I think that would conflict with this mod is anything that might alter the DialogueFollowerQuest, the HireableDogs Quest, the factions that the pets belong to, anything that modifies actors Garmr, Cusith, Sceolang, Bran, and Meeko, or the formlists that determine which creatures are able to initiate the children dialogue to adopt a pet.  If anyone finds any issues with the mod, feel free let me know and I\\'ll do what I can to fix the issue.\r\n\r\n\r\n=========================================================================================\r\nFUTURE PLANS\r\n\r\n- would like to eventually make more creatures that could be brought home by the children, so there that would be more than just 5 different potential creatures.\r\n\r\n-would like to make a mini dragon as either a main or children\\'s pet, which I can set it to dragonrace just fine, but.. the dragon\\'s collision box inside the house is.... less than friendly (gets stuck in the roof and sends items flying everywhere).. I\\'m not quite sure how to get it to be a mini size other than console commands in-game (which doesn\\'t fix the collision issue), i tried changing the scale value in the CK but it didn\\'t have any effect. if anyone knows how to fix the collision box and size issue that would be great if they could let me know.\r\n\r\nI am open to suggestions for new pets (for creatures currently existing in game that is)\r\nIf someone wants it done with any custom-made creatures I could give it a shot.\r\n=========================================================================================\r\nCREDITS\r\n- to Bethesda for creating the game and its DLC and giving me a reason to create this mod",
  "categoryId": "65",
  "version": "v1.4",
  "author": "aharttsx",
  "createdUnix": "1356813642",
  "updatedUnix": "1377754047",
  "containsAdultContent": false,
  "uploadedBy": "aharttsx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "108311",
      "name": "Better Hearthfire Pets ",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Better Hearthfire Pets -29105-v1-0.rar",
      "uploadedUnix": "1356813812",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/682cbb3463f7f97966665933b7a59c3804fb0e6205c2f444a725c93acedaac9f/analysis/1407327962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Hearthfire%20Pets%20-29105-v1-0.rar?fid=108311&ttl=1535802981&ri=8192&rs=8192&setec=e2878289b64eddf5f802c2ad2254675b"
    },
    {
      "fileId": "108373",
      "name": "Better Hearthfire Pets v1-1",
      "version": "v1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Better Hearthfire Pets v1-1-29105-v1-1.rar",
      "uploadedUnix": "1356838343",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f9e653524c7aeda37a3aa3eb1ba0dc52dadcba84ca110d12b68af6e3e57fc37f/analysis/1407328448/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Hearthfire%20Pets%20v1-1-29105-v1-1.rar?fid=108373&ttl=1535802981&ri=8192&rs=8192&setec=b364cda357b1c48df7d907822629ad2a"
    },
    {
      "fileId": "108804",
      "name": "Better Hearthfire Pets v1-2",
      "version": "v1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Better_Hearthfire_Pets_v1-2-29105-v1-2.rar",
      "uploadedUnix": "1357002949",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/5ea318764b7e166063524a5e1e196b9ad53b93912c399f10184850293903b088/analysis/1407331639/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better_Hearthfire_Pets_v1-2-29105-v1-2.rar?fid=108804&ttl=1535802982&ri=8192&rs=8192&setec=e7fc03c3b27d6cc9febb91badad0c94f"
    },
    {
      "fileId": "1000000852",
      "name": "Better Hearthfire Pets v1-3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Better_Hearthfire_Pets_v1-3-29105-1-3.rar",
      "uploadedUnix": "1357611539",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/a551f89f7ff72b549337ffd8b7bbb11f343630e72823b3277559e8304d902f11/analysis/1407342909/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better_Hearthfire_Pets_v1-3-29105-1-3.rar?fid=1000000852&ttl=1535802982&ri=8192&rs=8192&setec=66d36d30f6e8760af1707aaec2f5b81a"
    },
    {
      "fileId": "1000020480",
      "name": "Better Hearthfire Pets Main Pets Only",
      "version": "v1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Better Hearthfire Pets Main Pets Only-29105-v1-3.rar",
      "uploadedUnix": "1364349358",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/70c25a1161f4dd315a9d993abcf494e2936f3115d8fe4d89c201c8128fa22224/analysis/1407490382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Hearthfire%20Pets%20Main%20Pets%20Only-29105-v1-3.rar?fid=1000020480&ttl=1535802982&ri=8192&rs=8192&setec=da3bc20570e7d3f33935c14a3e92f857"
    },
    {
      "fileId": "1000050554",
      "name": "Better Hearthfire Pets v1-4",
      "version": "v1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50",
      "fileName": "Better Hearthfire Pets v1-4-29105-v1-4.rar",
      "uploadedUnix": "1377754047",
      "modVersion": "v1.4",
      "virusScanUrl": "https://www.virustotal.com/file/ab305328b536a9d8367043f6be9688aa2a7e2956d00be58400e7edd24a54ccf5/analysis/1407700582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Hearthfire%20Pets%20v1-4-29105-v1-4.rar?fid=1000050554&ttl=1535802983&ri=8192&rs=8192&setec=e87db4124701bc799ef7a6deb4fb8e57"
    }
  ]
}