{
  "modId": 29166.0,
  "modName": "Racest - Reasonable and Immersive Racials",
  "summary": "Alters the racials to be more in light with what a racial trait should be by balancing, removing powers, adding flavor, while not gimping a particular playstyle for a particular race. ",
  "descriptionHtml": "This mod seeks to redo the racial abilities of the playable races. I had several issues with them, mainly in terms of flavor and reasonable-ness. Powers were a main concern, in that it didn\\'t really make sense that all members of a race had access to an identical ability (Why would nord mages warcry, and why can an orc not?). Furthermore, there were already many options for the power slot, and racials simply weren\\'t a good one compared to most shouts. Thus powers were replaced by abilities that make sense and add flavor.\r\n      The driving philosophy behind these is that they should be immersive in representing the racial differences, but not make one feel like a certain race absolutely must be chosen for a certain playstyle. Thus, effects were given that would be more significant at lower levels (i.e. added magicka) that explain why most members of a race tend towards a certain path, but become less significant at higher levels. This is to not punish you for making an orc mage in the long run by making him weaker, but allowing for traits to overcome early on. Other abilities remain constant, such as added melee damage or increased magicka regeneration, so as to not make racial differences seem insignificant, but are again small enough to not gimp a particular playstyle. \r\n     There are several changes I would like to add and will continue to work on once I understand the CK better, and will continue to balance this. Let me know your thoughts or suggestions. \r\n\r\nThe abilities are as follows:\r\nMer: All Mer (excluding orcs) have \\\"Elven Blood\\\" - The blood of the Aldmer grants 75% disease resistance and a bonus 25 magicka.\r\nHigh Elf: \\\"Highborn\\\" -The high elves receive a further boost of 50 to their magicka, and regenerate it 25% more quickly.\r\nWood Elf: \\\"Sylvan\\\" - Bosmer have an innate 25% poison resistance, and take 25% less damage from animals.\r\nDark Elf: \\\"Ashborn\\\" - Tempered in the fires of Morrowind, the Dunmer have a 25% resistance to fire.\r\nOrcs:  instead of elven blood, orcs posses \\\"Cursed Heritage\\\" -Orcs possess 15% magic resistance. \r\n   \\\"Bestial Might\\\": The inhuman strength of the Orcs bestows 10% increased melee damage, and 50 bonus health. \r\n\r\nAll Men possess \\\"Ardor\\\" - The human spirit is indomitable and tenacious, granting a bonus of 15 to both health and stamina.\r\nImperials: \r\n   \\\"Imperial Luck\\\" - unchanged\r\n   \\\"Voice of the Emperor\\\" - Imperials have 10% shorter shout cooldowns, and tend to receive 10% better prices at merchants.\r\nBretons: \r\n   \\\"Dragonskin\\\" -Bretons have an innate connection with magic, granting 25% magic resistance.\r\n   \\\"Dual Ancestry\\\" - The blood of mer flows through Bretons, granting 25% resistance to disease, and 25 bonus Magicka.\r\nNords:\r\n  \\\"Atmoran Valor\\\" - The Nords are hardy and proud, dealing 5% increased damage in melee, and receiving a bonus 25 to health.\r\n   \\\"Blood of the North\\\" - The Nords of Skyrim have a 25% resistance to Frost.\r\nRedguard:\r\n   \\\"Yokudan Fortitude: -The Redguards have been tempered by sea and desert, receiving a bonus 25 stamina and a 25% increase to stamina regeneration. \r\n\r\nBeastfolk: Khajit and Argonians are unique, and playing them should feel unique. Their bonuses differ in that they focus on interesting bonuses that tweak playstyle, while again, not pigeonholing into a certain class or archetype. \r\nKhajit:\r\nNighteye power unchanged\r\n\\\"Claws\\\" - Unchanged\r\n\\\"Feline Grace\\\" - Khajiit move 25% more quietly, recover stamina 25% more quickly, and take half falling damage.\r\n\r\nArgonians:\r\n   \\\"Histskin\\\" - The physiology of the Argonians allows them to regenerate twice quickly from wounds.\r\n   \\\"Blood of the Black Marsh\\\" - Argonian blood is 50% resistant to disease and poison.\r\n   \\\"Lizardkin\\\" - Argonian scales provide 15 points of damage resistance and they can breathe underwater, but also suffer a 25% weakness to frost.\r\n   \r\nChangelog:\r\n1.1 - edited descriptions according to suggestions. quick fix to bretons.\r\n\r\n\\\"",
  "categoryId": "24",
  "version": "1.1",
  "author": "avocadoninja",
  "createdUnix": "1356934817",
  "updatedUnix": "1357088937",
  "containsAdultContent": false,
  "uploadedBy": "avocadoninja",
  "primaryFile": null,
  "files": [
    {
      "fileId": "108984",
      "name": "Racest Improvements",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "96",
      "fileName": "Racest Improvements-29166-1-1.zip",
      "uploadedUnix": "1357088937",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b4d14e268ff6c692e90c5b1fd60215dff1e0c92aba4a9ec2f0a69253645d07ac/analysis/1407332884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Racest%20Improvements-29166-1-1.zip?fid=108984&ttl=1535803065&ri=8192&rs=8192&setec=6965813da992d11cc275caaba5f1c90c"
    }
  ]
}