{
  "modId": 29258.0,
  "modName": "Dodge Mod",
  "summary": "Allows the player to dodge sideways and backwards using a configurable Dodge Key (by default the Sprint key will be used). Requires SKSE. Features a user-friendly in-game menu if SkyUI 3.0+ is installed.",
  "descriptionHtml": "[color=orange][i][size=14]Dodge Mod for The Elder Scrolls V: Skyrim[/size][/i][/color]\r<br />Download Link: http://www.skyrim.nexusmods.com/mods/29258 \r<br />Forum Thread: http://forums.bethsoft.com/topic/1434452-relz-dodge-mod/\r<br />Version 1.22\r<br />28 January 2013\r<br />Borgut1337\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=#ff7700]NOTE on Skyrim Special Edition versions of my mods:\r<br />[/color]I do not plan to update my mods to work with Skyrim Special Edition (SSE) any time soon myself, because I do not expect to have the time for that (just like I haven&#39;t had the time or interest to read comments and update any mods for the past few years already).\r<br />\r<br />I do, [i]under the following conditions[/i], give others permission to update my mods to work with any SSE version (PC and/or consoles):\r<br />\r<br />- Please send me a PM on the nexus forums first, describing which of my mods you are planning to upgrade, for which versions of SSE, and await my response before uploading. If you have done any Skyrim modding that involves scripts before, please also include links to that. In case there are multiple people interested in upgrading the same mod, I&#39;d prefer the most qualified (in terms of experience) person to do so, instead of having multiple people racing to be the first to upload the same mod.\r<br />- You must clearly mention my name in order to give me credit for the work I have done developing the original version of the mod\r<br />- You must clearly mention that I am not responsible for supporting, updating, or otherwise commenting on the SSE version of the mod. I will not have time to do that in an adequate manner.\r<br />- If I ever do find the free time and the interest to actively start working with these mods again, I reserve the right to upload my own versions of these mods using the same (or similar) names. It would also be nice if you give me access to the files of your version of the mod, and/or the page where you uploaded it.\r<br />\r<br />- [b]In the case of the [color=#ff7700]Deadly Combat[color=#ffffff] mod: [/color][/color][/b][color=#ff7700][color=#ffffff]Please make sure to immediately deal with the issues described in this thread of comments (in particular, Nazenn and EnaiSiaion&#39;s comments): https://www.reddit.com/r/skyrimmods/comments/3yvez8/about_script_heaviness_also_a_dangerous_mods_list/cyh79mv/[/color][/color]\r<br />[color=#ff7700][color=#ffffff]---------------------------------------------------------------------------------------[/color][/color]\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/hXQSy.png[/img][/url][/center]\r<br />\r<br />Reviewed by Saiodin in Skyrim Mods Series #115:\r<br />[youtube]Y0RA83wv0_g[/youtube]\r<br />\r<br />Spotlight made by CaptainShack (nexus)/TheXPGamers (youtube):\r<br />[youtube]BAS37H3wMlg[/youtube]\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]1. Index[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />1. Index\r<br />2. Requirements\r<br />3. Recommended Mods\r<br />4. Mod Description\r<br />5. Upgrading From A Previous Version\r<br />6. Installation\r<br />7. Uninstallation\r<br />8. Incompatibilities\r<br />9. Known Issues/Bugs\r<br />10. F.A.Q.\r<br />11. How To Give Feedback\r<br />12. Alternative/Similar Mods\r<br />13. Version History\r<br />14. Permissions & Disclaimer\r<br />15. Contact Information\r<br />16. Tools Used\r<br />17. Credits\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]2. Requirements[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />- A working, official copy of The Elder Scrolls V: Skyrim, updated to version 1.8.151.0 or higher.\r<br />- Skyrim Script Extender (SKSE) version 1.6.6 or higher, available here: http://skse.silverlock.org/\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]3. Recommended Mods[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />- SkyUI 3.0 or higher: http://skyrim.nexusmods.com/mods/3863 \r<br />Without this, there will be no in-game configuration menu to configure Dodge Mod.\r<br />- Deadly Combat: http://skyrim.nexusmods.com/mods/5485\r<br />- Dual Wield Parrying: http://skyrim.nexusmods.com/downloads/file.php?id=9247 \r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]4. Mod Description[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />This mod allows the player to make short, quick movements to dodge the attacks of opponents.\r<br />\r<br />[u]Controls[/u]\r<br />By default, the mod will automatically detect which key you use for sprinting, and pressing this key whilst moving sideways or backwards will make you dodge in the appropriate direction.\r<br />\r<br />If SkyUI version 3.0 or higher is installed, the player will also be able to change the key used for dodging to any other key he likes using a user-friendly menu available in SkyUI’s Mod Configuration Menu.\r<br />\r<br />[u]Dodging[/u]\r<br />A player’s dodge consists of 2 parts. Immediately when the dodge key is pressed, the player will gain a large increase in movement speed, meaning that the player can continue movement at an increased speed in the chosen direction for a very short amount of time. \r<br />\r<br />This increased movement is quickly followed by a dodge animation, where the player makes one more quick step in the chosen direction and then regains his footing and normal control of the character.\r<br />\r<br />The overall distance covered and speed at which the character moves is a multiplication of the player’s normal movement speed. This means that, especially with mods installed which increase the negative effects wearing Heavy Armor has on your movement speed (for example Deadly Combat has such a feature), but also to a lesser extent in vanilla Skyrim, dodging will be more effective when wearing Light Armor than it is when wearing Heavy Armor.\r<br />\r<br />If you have a staff or spells equipped, only the speed up part of the dodge will work but the extra animation won’t.\r<br />\r<br />Dodging also costs Stamina.\r<br />\r<br />[u]Configuration[/u]\r<br />If SkyUI 3.0 or higher is installed, there will be a Dodge Mod menu in SkyUI’s Mod Configuration Menu with various options. Apart from the ability to change the dodge key as described above, and the ability to deactivate the mod entirely to ensure a clean uninstallation (further details about this in the Uninstallation section) there is an option to switch between 3 different modes in which the mod can run.\r<br />\r<br />This should be considered as an advanced option and for most users there should be no need to really look at this too much, generally it can be left at it’s default.\r<br />\r<br />1. Keyboard (Normal) mode: This mode is recommended for keyboard users. Keyboard input should generally be recognized correctly and everything should work as expected. When the mod loads the first time, if the mod detects that you are using a keyboard this option will be selected by default.\r<br />\r<br />2. Keyboard (Accurate) mode: This mode is only recommended for keyboard users with a powerful rig. It will do more work to accurately recognize and interpret all of your keyboard input. The only situation in which this will make a difference when compared to the previous mode is when having moving backwards diagonally (so the backwards key and either the left or the right key are held at the same time). The previous mode will in such a case automatically default to dodging backwards, whereas this mode will recognize which of the two keys you pressed last and dodge in that direction.\r<br />\r<br />So, in the normal mode it will not matter if you press the A key first and then the D key and then the dodge key, or first D, then A, then dodge; you will always dodge backwards. In the accurate mode, if you press A first, then D, then dodge, you will dodge backwards, but if you \r<br />press D first, then A, then dodge, you will dodge to the left.\r<br />\r<br />The drawback is that this mode requires a lot more work, so if you have a lower-end PC or are running a large amount of (scripted) mods, it may react too slow for the dodges to be worth using.\r<br />\r<br />3. Gamepad (mode): This mode is the only mode which actually works with a gamepad/Xbox controller. It will by default be selected when the mod loads for the first time if it recognizes that you are using a gamepad.\r<br />\r<br />This mode also does generally work with a keyboard, and theoretically it should be slightly faster than even the normal keyboard mode, so if the mod is reacting too slow for your taste even when running in the normal keyboard mode, you could try gamepad mode regardless of whether you are using a gamepad or not. If you do so though, it may in some rare cases have you dodge in an unexpected direction.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]5. Upgrading From A Previous Version[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />When upgrading from a previous version of the mod, please make a clean save BEFORE installing the new version. This means:\r<br />- Deactivate Dodge Mod.esp in the game’s launcher.\r<br />- Load your saved game with which you wish to continue playing, where a previous version of the mod was active. Press ‘’Yes’’ when a pop-up appears about unavailable content.\r<br />- Save the game again (this is your clean save)\r<br />- Now install the new version and continue as you would normally with your clean save.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]6. Installation[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />You can choose to either install the mod using the Nexus Mod Manager or to install manually.\r<br />\r<br />[u]1. Nexus Mod Manager Installation[/u]\r<br />Simply press the ‘’Download With Manager’’ button and let NMM do all the installing work for you as you would with any other mod.\r<br />\r<br />[u]2. Manual Installation[/u]\r<br />- Unpack the downloaded package in a temporary location.\r<br />- Copy the Data folder in the unpacked folder.\r<br />- Paste the Data folder in your Skyrim folder. This can be found at \r<br />&lt;Steam Installation Directory&gt;SteamSteamAppsCommonSkyrim. This folder will also contain files such as ‘’TESV.exe’’.\r<br />- When you launch the game, make sure to enable the mod’s .esp file (named ‘’Dodge Mod.esp’’) in the launcher’s Data Files tab.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]7. Uninstallation[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />Uninstallation works differently depending on whether you installed the mod using the Nexus Mod Manager or manual installation.\r<br />\r<br />[u]1. Nexus Mod Manager Uninstallation[/u]\r<br />If you previously installed the mod using NMM, you can simply let NMM uninstall the mod for you as well.\r<br />\r<br />[u]2. Manual Uninstallation[/u]\r<br />If you manually installed the mod, you also need to manually remove the mod’s files to completely uninstall it. To do so, follow these steps:\r<br />- Find Skyrim’s Data folder. This will be at \r<br />&lt;Steam Installation Directory&gt;SteamSteamAppsCommonSkyrimData.\r<br />- In this Data folder, delete the files named ‘’Dodge Mod.esp’’ and ‘’Dodge Mod.bsa’’.\r<br />\r<br />If SkyUI version 3.0 or higher is installed, you can also use the in-game Mod Configuration Menu first to deactivate the mod in-game before deleting it. If you forget to do this first it will generally not be an issue, but theoretically the mod might leave some small traces inside \r<br />your saved game even after uninstallation if this step is neglected. Realistically the negative effects of this would only become noticeable after uninstalling and reinstalling the mod thousands of times without performing this extra step, but the option is still there in case you \r<br />want to be absolutely sure that everything is removed correctly.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]8. Incompatibilities[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />There are no known incompatibilities at this time.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]9. Known Issues/Bugs[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />- As described in the Mod Description, dodges do not work when the player has Staves or Spells equipped. If I could fix this I would, but currently I wouldn’t know how to do so.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]10. F.A.Q. [/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />[i]Q: I see no configuration menu in-game&#33;[/i]\r<br />A: Make sure you installed a proper version of SkyUI which includes MCM functionality and installed it correctly.\r<br />\r<br />[i]Q: The mod doesn’t work&#33;[/i]\r<br />A: Make sure you installed SKSE correctly. Make sure you installed all parts of this mod correctly. Make sure the mod’s .esp file is activated in the game’s launcher.\r<br />If you’re using an Xbox controller, make sure that the mod is correctly running in gamepad mode (you need SkyUI 3.0 to check this).\r<br />If it still doesn’t work now, try downloading the optional ‘’Loose files’’ version of the mod instead.\r<br />If it still doesn&#39;t work, try moving Dodge mod all the way to the top of your load order (so right after all of your .esm files).\r<br />Also, someone reported that it simply took a few minutes of real time until the mod started working for him, so if it still doesn&#39;t work you may want to try that.\r<br />\r<br />[i]Q: Why doesn’t dodging work with staves/spells?[/i]\r<br />A: It is not an intentional design by me; it is an issue with the dodge animations I use (they came with vanilla Skyrim, they just weren’t used by the base game.. so I did not make them myself). I probably will not be able to fix this either, but I am looking into other ways to solve the problem (maybe I can find another good animation for example).\r<br />\r<br />[i]Q: Does it work with an Xbox 360 Controller?[/i]\r<br />A: Yes.\r<br />\r<br />[i]Q: Does it work in first person mode?[/i]\r<br />A: Yes.\r<br />\r<br />[i]Q: Can I use double-tapping instead of sprint button?[/i]\r<br />A: Not yet. Hopefully I&#39;ll get to that some time.\r<br />\r<br />[i]Q: The mod is reacting too slow&#33;[/i]\r<br />A: If you are using a keyboard and are running the mod in accurate keyboard mode, try changing it to normal keyboard mode. If it’s still slow, or you were already running in normal keyboard mode, try gamepad mode (yes, even if you are using a keyboard).\r<br />If it’s still too slow in gamepad mode, you’ll either have to upgrade your PC, uninstall some other scripted mods, or try the Script Dragon version available in tktk1’s TK Dodge mod (see Alternative/Similar Mods section) instead.\r<br />\r<br />[i]Q: Why did you make this mod when tktk1 already released his TK Dodge mod long ago? How is this mod different?[/i]\r<br />A: As a modder, I like to be fully in control of mods which I think to be very important for my gameplay, because that means I can make them precisely the way I personally like. For example, the extra speed increase which I added before the dodge animations play is something I personally think is necessary to make the dodges useful, and this feature is not in TK Dodge.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]11. How To Give Feedback[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />When giving feedback on specific parts of the dodging feature (like stamina cost, speed, distance covered), and some of the values used seem wrong, please provide the following information:\r<br />- Which dodge are we talking about? Left? Right? Back? All of them?\r<br />- Which mods are you using? Especially combat mods and other mods which affect stamina or movement speed are important.\r<br />- Are you using a keyboard or a gamepad? And in which of the three modes available are you running the mod (keyboard normal, keyboard accurate, gamepad)?\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]12. Alternative/Similar Mods[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />TK Dodge by the author tktk1 is similar to this mod. If you’re looking for something similar but there are particular things you don’t like about this mod, you can give TK Dodge a try here: http://skyrim.nexusmods.com/mods/20923/ \r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]13. Version History[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />1.22 (28 January 2013)\r<br />- The mod should now hopefully continue to work correctly after loading a saved game even for those users for which this did not work correctly in previous versions.\r<br />\r<br />1.21 (6 January 2013)\r<br />- For some users the mod would no longer work after loading a saved game. This was a rare case, but even for these users it should continue to work correctly now.\r<br />\r<br />1.20 (5 January 2013)\r<br />- Fixed the animations in third person mode. They should now always play correctly. Many thanks to tktk1 for helping me fix this issue&#33;\r<br />- Fixed a bug where sprinting forwards would get interrupted with the mod installed.\r<br />- Now there is a bigger area of possible directions in which the player can run without dodging. Previously if a player was not running 100% straight and pressed the sprint button, he would dodge. For keyboard users, this was not noticeable since keyboard users can only run either perfectly straight or perfectly diagonally, but Xbox controller users with a stick not perfectly straight forwards but slightly tilted to the left or right will notice this change.\r<br />- The mod can now run in 3 different modes, which can be configured using SkyUI’s Mod Configuration Menu. The available modes are Keyboard (Normal), Keyboard (Accurate) and Gamepad. See the Mod Description for more details.\r<br />- Recompiled all scripts using SkyUI3.0 SDK, instead of SkyUI3.03-beta.\r<br />\r<br />1.10 (2 January 2013)\r<br />- Changed the way the mod detects which direction you are running in. This should hopefully allow players who use Xbox 360 controllers to also make use of the mod.\r<br />- Added some clarifications to the readme and extra questions and answers to the F.A.Q.\r<br />- Added an optional ‘’Loose files’’ version which has the files packaged loosely instead of in a .bsa file, for those people who have issues running mods which use .bsa files.\r<br />\r<br />1.01 (1 January 2013)\r<br />- Fixed an issue where dodging often could gradually decrease the player&#39;s speed if the player was slowed when dodging\r<br />\r<br />1.00 (1 January 2013)\r<br />- Initial release.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]14. Permissions & Disclaimer[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />- ALL FILES IN THE DOWNLOAD ARE PROVIDED &#39;&#39;AS IS&#39;&#39; WITHOUT ANY WARRANTY OR GUARANTEE OF ANY KIND. IN NO EVENT CAN THE AUTHOR BE HELD RESPONSIBLE FOR ANY CLAIMS, WHETHER OR NOT THEY ARE RELATED TO THE DOWNLOAD.\r<br />\r<br />- In unedited form, this mod may only be redistributed on sites other than www.skyrimnexus.com. If you redistribute the same mod on other sites, you MUST inform your users that the original author will not look for feedback or assist in troubleshooting on any site other than www.skyrimnexus.com or forums.bethsoft.com.\r<br />- If edited, changed or improved upon, this mod may also be redistributed on www.skyrimnexus.com.\r<br />- IN BOTH OF THE ABOVE CASES, the original author must be credited for his work, and the original readme must be included.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]15. Contact Information[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />The author can be contacted through private messages on the nexus sites and on the official bethesda softworks forums, in both cases under the name &#39;&#39;Borgut1337&#39;&#39;. The author will also read the comments section of his mod on www.skyrimnexus.com regularly.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]16. Tools Used[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />- The Creation Kit\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]17. Credits[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />Thanks to:\r<br />\r<br />- Bethesda Game Studios: For making the awesome game Skyrim\r<br />- All contributors to the Creation Kit wiki\r<br />- tktk1, the author of the TK Dodge mod, who has helped me solve some issues he had already previously fixed in his own mod.",
  "categoryId": "77",
  "version": "1.22",
  "author": "Borgut1337",
  "createdUnix": "1357064517",
  "updatedUnix": "1359370395",
  "containsAdultContent": false,
  "uploadedBy": "Borgut1337",
  "primaryFile": null,
  "files": [
    {
      "fileId": "108917",
      "name": "Dodge Mod Version 1_00",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "98",
      "fileName": "Dodge Mod Version 1_00-29258-1-00.zip",
      "uploadedUnix": "1357064558",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/3fe26f31713f4474a01dafc8439ec7ae06e921a359e1317b67239c520def8399/analysis/1407332345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dodge%20Mod%20Version%201_00-29258-1-00.zip?fid=108917&ttl=1535803205&ri=8192&rs=8192&setec=82abcfe5b195242ee39c20d693941e5c"
    },
    {
      "fileId": "108933",
      "name": "Dodge Mod Version 1_01",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "98",
      "fileName": "Dodge Mod Version 1_01-29258-1-01.zip",
      "uploadedUnix": "1357072696",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/9c55d32155ba58db5617c0c4b666b3c340395f5d3c1077faf9eb63c14452c088/analysis/1407332421/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dodge%20Mod%20Version%201_01-29258-1-01.zip?fid=108933&ttl=1535803205&ri=8192&rs=8192&setec=ba1933626b3cef77770a39d86094db1b"
    },
    {
      "fileId": "109078",
      "name": "Dodge Mod Version 1_10",
      "version": "1.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "108",
      "fileName": "Dodge Mod Version 1_10-29258-1-10.zip",
      "uploadedUnix": "1357141660",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/e2d570f866efdb18c5fdac06f340d09a50fe5eea5aed68349ffb80015149ab45/analysis/1407333631/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dodge%20Mod%20Version%201_10-29258-1-10.zip?fid=109078&ttl=1535803206&ri=8192&rs=8192&setec=8036932896ff2f8bce3d77880471d252"
    },
    {
      "fileId": "109079",
      "name": "Dodge Mod Version 1_10 LOOSE FILES",
      "version": "1.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "107",
      "fileName": "Dodge Mod Version 1_10 LOOSE FILES-29258-1-10.zip",
      "uploadedUnix": "1357141699",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/9630f1f8ed71364c1d5b375bc75d83d710d2319cdb0f059d02bcbefbdb0d4869/analysis/1407333663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dodge%20Mod%20Version%201_10%20LOOSE%20FILES-29258-1-10.zip?fid=109079&ttl=1535803206&ri=8192&rs=8192&setec=6547db20c8797cecdcbbe59d8ac7f3bd"
    },
    {
      "fileId": "1000000143",
      "name": "Dodge Mod Version 1_20",
      "version": "1.20",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "119",
      "fileName": "Dodge Mod Version 1_20-29258-1-20.zip",
      "uploadedUnix": "1357401061",
      "modVersion": "1.20",
      "virusScanUrl": "https://www.virustotal.com/file/81aa03ad358deb2803d0960bd913547c9d806c557ea83c5295f25f89ce119198/analysis/1407338426/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dodge%20Mod%20Version%201_20-29258-1-20.zip?fid=1000000143&ttl=1535803206&ri=8192&rs=8192&setec=45cd76931ded46a8098e62b1d1ddd745"
    },
    {
      "fileId": "1000000144",
      "name": "Dodge Mod Version 1_20 LOOSE FILES",
      "version": "1.20",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "117",
      "fileName": "Dodge Mod Version 1_20 LOOSE FILES-29258-1-20.zip",
      "uploadedUnix": "1357401093",
      "modVersion": "1.20",
      "virusScanUrl": "https://www.virustotal.com/file/76f7ceca2a2e8ea0b2dfe6c96c19d22ce877279cc7c2f9fe18cea1b53ea56923/analysis/1407338427/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dodge%20Mod%20Version%201_20%20LOOSE%20FILES-29258-1-20.zip?fid=1000000144&ttl=1535803207&ri=8192&rs=8192&setec=a951f465a79178a9837809143e2691e0"
    },
    {
      "fileId": "1000000504",
      "name": "Dodge Mod Version 1_21",
      "version": "1.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "120",
      "fileName": "Dodge Mod Version 1_21-29258-1-21.zip",
      "uploadedUnix": "1357498943",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/7fdaeac9123e8847c562fae19a143ab1526fe832ec443cb5046da27b1ad7dad5/analysis/1407340700/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dodge%20Mod%20Version%201_21-29258-1-21.zip?fid=1000000504&ttl=1535803208&ri=8192&rs=8192&setec=0ad3c4c1ed8c23719e857f2e4e84dc95"
    },
    {
      "fileId": "1000000506",
      "name": "Dodge Mod Version 1_21 LOOSE FILES",
      "version": "1.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "118",
      "fileName": "Dodge Mod Version 1_21 LOOSE FILES-29258-1-21.zip",
      "uploadedUnix": "1357498983",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/fbe853d0385fc2b8030b01ae426bff34f85d538630991a2282637d3ca6c4ff34/analysis/1407340761/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dodge%20Mod%20Version%201_21%20LOOSE%20FILES-29258-1-21.zip?fid=1000000506&ttl=1535803208&ri=8192&rs=8192&setec=30295a008cb07812fb017194cdd4dd51"
    },
    {
      "fileId": "1000005459",
      "name": "Dodge Mod Version 1_22",
      "version": "1.22",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "125",
      "fileName": "Dodge Mod Version 1_22-29258-1-22.zip",
      "uploadedUnix": "1359370352",
      "modVersion": "1.22",
      "virusScanUrl": "https://www.virustotal.com/file/539d7b2221b325f84929bd8a9c32d92b146072be4084926e4b3bd7d6c7633be1/analysis/1407383586/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dodge%20Mod%20Version%201_22-29258-1-22.zip?fid=1000005459&ttl=1535803208&ri=8192&rs=8192&setec=40b0847d99c3da33aadcf261d35b0b2b"
    },
    {
      "fileId": "1000005461",
      "name": "Dodge Mod Version 1_22 LOOSE FILES",
      "version": "1.22",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "123",
      "fileName": "Dodge Mod Version 1_22 LOOSE FILES-29258-1-22.zip",
      "uploadedUnix": "1359370395",
      "modVersion": "1.22",
      "virusScanUrl": "https://www.virustotal.com/file/72b680bed6c01650671bd41c8eff4051b6bf73d78c5c9f50049dc254c3315a40/analysis/1407383588/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dodge%20Mod%20Version%201_22%20LOOSE%20FILES-29258-1-22.zip?fid=1000005461&ttl=1535803209&ri=8192&rs=8192&setec=7e431e046a0eaf5b78badf1199cfc087"
    }
  ]
}