{
  "modId": 2926.0,
  "modName": "Ring of ethereal ghostveil and atronach",
  "summary": "adds 8 rings to the game with unique effects, for example summoning 20 Dremora Lords to fight for you!!!",
  "descriptionHtml": "This mod adds 8 rings to the game that have unique effects listed as follows:\r\n\r\n1) Ring of Ethereal- Turns the user into ethereal form similar to when using the ethereal shout. note: when using you are completely invulnerable but should you attack anyone the ring will automatically end its effect after which simply re-equip it to become ethereal again.\r\n2) Ring of Ghostveil- The user is converted to spectral form. Note: despite the description the effect is permanent, the ring also includes the masque of clavicius viles enchantment merely for immersion purposes(im pretty sure the people of skyrim arent fond of speaking to ghosts, i mean they get mad after casting candlelight)\r\n3)Ring of Atronach- This ring conjures a flaming atronach for the user permanently until the bloody thing dies, after which simply re-equip the ring for a new atronach.\r\n4) Rign of Nighteye- Gives the user perma nighteye despite its description. (as requested by macsterman)\r\n5)Ring of Invisibility- Permanent invisibility despite description. note: it brakes when u perform any action that regularly break the spell version. (As requested by Awec)\r\n6) Ring of Candlelight-Permanent Candlelight despite description.( As requested by asc_kel)\r\n7) Ring of Aura- casts semi permanent clairvoyance. Note: the ring must be re-equipped everytime u enter a new cell so hotkey it if ur using it, and ill do my best to change this soon.\r\n8)Ring of Lord Dagon- Conjures 20 Dremora Lords who will fight until the bitter end for you or until you take of the ring off, whichever comes first.Note: this ring cross refs the twin souls perk which with out im pretty sure u only get 1 dremora lord so for the ring to work effectively you must get 100 conjuration and the twin souls perk which i included to allow for twenty summonings(i know it says ten but bite me im lazy) the ring is completely optional for those of you concerned about play value. (As requested by Loverbr)\r\n\r\n\r\nNote: all of the rings provide permanent enchantments unless you brake the effect by x means after-which simply re-equip said ring to regain the effect this includes wen reloading a save where u have most of the rings equipped simply un equip and re equip them and you\\'ll be fine nd dont freak out or think its glitched \r\n\r\nAcquire(thnk yondu22 for reminding me i needed to add this. lol.)\r\nlmao crap sorry, to get the rings go to the forge and look in the jewelery tab they cost a filled black soulgem to create and give nice smithing xp. the rings also don\\'t occupy any body slots but i don\\'t suggest equipping all of them at once.\r\n\r\n\r\nps. if u have any requests post them and ill see if it can be done. right now im working on a ring that conjures the spectral horse to go with the ghostveil ring so don\\'t ask for the horse.\r\nim also working on a dragon mount mod but cant promise its release until bethesda releases its ck in Jan, so sorry but look forward to it and the giant quests and features i plan to include with it.\r\n\r\nInstallation\r\n1)download\r\n2)extract to Program Files\\\\Bethesda Softworks/skyrim/data ( steam users: Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data)\r\n3)launch skyrim go to the files folder and look for the check mark next to ring esp\r\nUninstall \r\n1) Remove check mark from data files screen after skyrim launch\r\nor\r\n2) go to ur data folder and delete the mod (rings.esp)\r\n\r\nps. if you don\\'t know any of this by now chances are you shouldn\\'t be using mods\r\nbtw krazyguy126 and Rubio D Vega are the same person dont freak out\r\n\r\nBased on Mtsaint\\'s Unlimited Rings Mod (http://www.skyrimnexus.com/downloads/file.php?id=1952) \r\nand Gawl40\\'s Rings of Power Mod (http://www.skyrimnexus.com/downloads/file.php?id=2026)",
  "categoryId": "75",
  "version": "1.0",
  "author": "RubioDVega",
  "createdUnix": "1323273446",
  "updatedUnix": "1323364958",
  "containsAdultContent": false,
  "uploadedBy": "krazyguy126",
  "primaryFile": null,
  "files": [
    {
      "fileId": "7942",
      "name": "Ringsv03",
      "version": ".03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Ringsv03-2926.rar",
      "uploadedUnix": "1323277844",
      "modVersion": ".03",
      "virusScanUrl": "https://www.virustotal.com/file/c703f0b58ac3dbd0d87dcef601ed1373f890de06a8f0b55028842cef4e252f17/analysis/1406490303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ringsv03-2926.rar?fid=7942&ttl=1535757574&ri=8192&rs=8192&setec=9974c9ce608533d362b35545f048b438"
    },
    {
      "fileId": "8250",
      "name": "rings v04",
      "version": ".04",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "rings v04-2926--04.rar",
      "uploadedUnix": "1323362721",
      "modVersion": ".04",
      "virusScanUrl": "https://www.virustotal.com/file/a309d5c81363938c3d563901b8db50a5a342b203ebcf19669092e70819182532/analysis/1406493964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/rings%20v04-2926--04.rar?fid=8250&ttl=1535757575&ri=8192&rs=8192&setec=895e0716fc5997f94f44e04bb53717dd"
    },
    {
      "fileId": "8260",
      "name": "Rings2",
      "version": ".04a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Rings2-2926--04a.rar",
      "uploadedUnix": "1323364958",
      "modVersion": ".04a",
      "virusScanUrl": "https://www.virustotal.com/file/e454a9dd97267cc8410ef8b5a9a6f65247996e9edbcd955ca35935b8b575562a/analysis/1406494034/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rings2-2926--04a.rar?fid=8260&ttl=1535757575&ri=8192&rs=8192&setec=9e2122ce236314c32d0e7e42da0fc2b1"
    }
  ]
}