{
  "modId": 29275.0,
  "modName": "Homestead - Make Anywhere a Player Home",
  "summary": "This makes it possible for the player to declare any cleared dungeon their new player home.",
  "descriptionHtml": "SKSE Required - http://skse.silverlock.org/\r<br />Simply put, this mod aims to make it possible to turn anywhere into your new player home. Like Fort Amol? Wish you could live there, but every 10 days the enemies keep respawning and your items get removed from containers? This fixes all that.\r<br />\r<br />It does so with one simple spell, which costs no mana, but only does anything within a cleared interior. The spell is found on Farengar&#39;s (the court wizard of whiterun) desk.\r<br />What it does is summon a chest. A very special chest. You see, this magic special chest has magic special scripts attached to it that prevent enemies from respawning. It also keeps all of your stuff inside it safe and sound, even when the dungeon &#34;resets&#34; after 10 days or so.\r<br />This chest also makes it so that if you were to, say, claim the first floor of a dungeon as your new player home, any OTHER floors in the dungeon, as well as the immediate environs in Skyrim around the dungeon will also no longer respawn enemies. (Well, to be more accurate, they WILL spawn, and then immediately disappear never to return).\r<br />\r<br />What this mod does NOT do is allow you to put furniture in your new home, move it around, and in general make the place feel like home. The reason I didn&#39;t make these features is fortunately because people already have. Here is a list of recommended mods to make even the most modest cave into a brand spanking new player home.\r<br />\r<br />I should also mention that you can move your home anywhere. By casting the Stake Your Claim spell in a new cleared area, you move the magic chest to where you currently are. The gear comes with it, and so do the scripts. The old area will no longer be your home, but you have a new, better one, right?\r<br />\r<br />Home Construction and Decoration by Carlzilla\r<br />http://skyrim.nexusmods.com/mods/22791\r<br />\r<br />Placeable Statics - Move Anything by Iceburg\r<br />http://skyrim.nexusmods.com/mods/25068\r<br />\r<br />Decorator Assistant - SKSE and Vanilla Versions by fg109 \r<br />http://skyrim.nexusmods.com/mods/13586\r<br />\r<br />Please don&#39;t be shy bringing problems to my attention, but I&#39;m working on a large-scale projects so updates may be...less than forthcoming.",
  "categoryId": "67",
  "version": "v1.0",
  "author": "Alex Ducey",
  "createdUnix": "1357092329",
  "updatedUnix": "1357092388",
  "containsAdultContent": false,
  "uploadedBy": "atducey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "108989",
      "name": "The Main File",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "The Main File-29275-v1-0.rar",
      "uploadedUnix": "1357092388",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6fdcac08d465f178ae3a90577c4187e98c5046be69035e3b1d0f295254b06758/analysis/1407332951/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Main%20File-29275-v1-0.rar?fid=108989&ttl=1535803238&ri=8192&rs=8192&setec=5c621adb6cdb390a8f4176e9b7e16602"
    }
  ]
}