{
  "modId": 29276.0,
  "modName": "Magic Overhaul",
  "summary": "The goal of this mod is to completely revitalize the Magic Perks in Skyrim. Changes are being made to the Perk trees as well as some of the underpinnings of the spell system in Vanilla Skyrim in order to improve the quality of your wizarding experience!",
  "descriptionHtml": "* Magic Perks have been redisgned!\r\n* Followers are immune to hostile spells cast by the player!\r\n* Does not require any other DLC or mod to work!\r\n* Any mod that adds new spells should work with Magic Overhaul!\r\n\r\n\r\n\r\n\r\nThis mod is designed the rebalance the way mages approach the game. A number of perks have been changed to provide additional reductions to spell costs. This should make players less dependant on grinding Enchanting levels in order to reduce spell costs to a reasonable level. Perks have also been added to increase the power of the players spells as the player levels. This should help players deal with enemies which increase in level with the player. A number of new perks have also been added which add new effects and bonuses to the player in order to keep magic varried and interesting.\r\n\r\nBellow is a list of changes this mod currently provides. This mod is a work-in-progress so you can expect further changes, improvements, additions, and bug fixes with future updates!\r\n\r\n\r\n==================================================\r\nGeneral\r\n==================================================\r\n* Novice, Apprentice, Adept, Expert, and Master Perks in each magic tree grant a 10% Spell Cost Reduction in addition to reducing the base cost of spells.\r\n\r\n* Followers should be immune to any hostile spell cast by the player.\r\n\r\n==================================================\r\nDestruction\r\n==================================================\r\n* Augmented Flames, Augmented Frost, and Augmented Shock have been merged into a single Perk called Destructive Aptitude.\r\n\r\n* Destructive Aptitude\r\n** 1 rank which requires level 15 Destruction and the Novice Destruction Perk.\r\n*** Destructive Aptitude increases the damage of all destruction spells based on the players Destruction level.\r\n\r\n* Intense Flames, Deep Freeze, and Disintigrate have been merged into a single perk called Scholars Force.\r\n\r\n* Scholars Force\r\n** 1 rank which requires level 40 destruction and the Destructive Aptitude Perk.\r\n*** Fire damage causes targets to flee if their health is low. Shock damage disintegrates targets if their health is low. Frost damage paralyzes targets if their health is low.\r\n\r\n* Elemental Barrage\r\n** 1 rank which requires level 25 Destruction and the Novice Destruction Perk.\r\n*** Reduces the power cost of all Elemental Cloak spells to 0.\r\n*** Casts random Elemental Cloak spells on the player when the players health drops bellow 70%.\r\n*** Has a chance to cast an additional, random, Elemental Bolt spell whenever the player casts a spell. The chance to cast the additional bolt increases as the players health drops.\r\n\r\n* Elemental Cyclone\r\n** 1 rank which requires level 50 Destruction and the Elemental Barrage Perk.\r\n*** Increases the damage of all Elemental Cloak spells by 30%.\r\n*** Increases the range of all Elemental Cloak spells to 25m.\r\n\r\n* Wild Magic\r\n** 1 rank which requires level 35 Destruction and the Novice Destruction Perk.\r\n*** Randomly changes the duration, spell cost, and magnitude of all spells. These fluctuations are usually, but not always, beneficial to the player.\r\n*** Has a very rare chance of greater improving the duration, spell cost, and magnitude of all spells. These changes are always beneficial to the player.\r\n\r\n* Anomaly\r\n** 1 rank which requires level 60 Destruction and the Wild Magic Perk.\r\n*** Any spell cast by the player has a chance to cast an addition, randomly selected, spell which is beneficial to the player.\r\n\r\n==================================================\r\nConjuration\r\n==================================================\r\n* Undead Horde\r\n** 2 ranks which require level 30 and level 60 Conjuration and the Novice Conjuration Perk.\r\n*** Each rank enables the player to control an additional undead servant.\r\n\r\n* The Necromancy Perk will also allow Reanimation spells to be cast on higher level targets.\r\n\r\n==================================================\r\nRestoration\r\n==================================================\r\n* The effectiveness of the Recovery Perk has been doubled.",
  "categoryId": "93",
  "version": "0.1.1a",
  "author": "Austin Barnes",
  "createdUnix": "1357092335",
  "updatedUnix": "1357251629",
  "containsAdultContent": false,
  "uploadedBy": "AustinBarnes",
  "primaryFile": null,
  "files": [
    {
      "fileId": "109396",
      "name": "Magic Overhaul",
      "version": "0.1.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Magic Overhaul-29276-0-1-1a.zip",
      "uploadedUnix": "1357251629",
      "modVersion": "0.1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/dac115a68f74d5e87e59059d5e52776a26430e57e688a8f8d4aa34d5758161d8/analysis/1407335551/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Magic%20Overhaul-29276-0-1-1a.zip?fid=109396&ttl=1535803240&ri=8192&rs=8192&setec=71a1f2b6b3724e51b71bb0d70e600cbb"
    }
  ]
}