{
  "modId": 29286.0,
  "modName": "Skyrim Perk Enhancements and Rebalanced Gameplay - French Translation",
  "summary": "French Translation of Skyrim Perk Enhancements and Rebalanced Gameplay by seorin.",
  "descriptionHtml": "[center][img]http://i.imgur.com/hXQSy.png[/img]\r\n\r\n\r\n[color=yellow]Si vous aimez ce mod et cette traduction, n\\'oubliez pas les endorsements! Ca ne prend qu\\'un clic et ça fait toujours plaisir![/color]\r\n\r\n[color=yellow]Une nouvelle version à jour est disponible ic: http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/atouts_et_gameplay_ameliores.php. Je mettrais à jour sur le Nexus quand j\\'en aurais le temps![/color]\r\n\r\n\r\n[url=http://skyrim.nexusmods.com/mods/35320][img]http://www.ushareimg.com/images/286T3R.png[/img][/url][/center]\r\n\r\n\r\nCe mod est la traduction française du mod [url=http://skyrim.nexusmods.com/mods/24445/]Skyrim Perk Enhancements and Rebalanced Gameplay[/url] de seorin. Vous devez d\\'abord télécharger le mod original.\r\n\r\nRetrouvez d\\'autres mods sur le [url=http://skyrim.nexusmods.com/mods/28680]répertoire.[/url]\r\n\r\nPour suivre mon actualité de traduction de mods: [url=http://www.facebook.com/pages/Traduction-de-mods-Par-Raphou112/455702141160610?]ICI[/url]\r\n\r\n[color=green]20/04/13: Mise à jour de la traduction (correction de fautes, meilleur support via pdf)\r\nUn patch non officiel a été réalisé pour régler un problème de forgeage avec Dragonborn: http://skyrim.nexusmods.com/mods/32495/\r\n[/color]\r\n\r\nLe système de d\\'Atouts de SKyrim est fouilli, avec des atouts ennuyeux et sans intéret. Vous devez dépenser la majorité de vos points simplement pour avoir une hausse de dégats, et, quand vous achetez un des perks les plus interessants, vous découvrez qu\\'ils ne servent pratiquement à rien. Ce mod a pour but de corriger tout cela.\r\n\r\n[color=red]AVANT L\\'INSTALLATION: Il est hautement recommander d\\'avoir SKSE et [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/skyrim_community_uncapper.php]Skyrim Community Uncapper[/url]. Aucun n\\'est strictement requis, mais chacun a un rôle important pour que le mod marche correctement. Vous n\\'avez absolument pas besoin de l\\'Uncapper, mais il peut vous servir à limiter vos points d\\'atouts, pour ne pas avoir un personnage cheaté.[/color]\r\n\r\n\r\n\r\n[b]Skyrim Perk Enhancements and Rebalanced Gameplay[/b]\r\n______________________________________________________________________________________\r\n\r\n[b][color=orange]Conseil personnel[/color][/b]\r\n\r\nCe mod peut vite devenir cheaté car les atouts sont très interessants et combinés sont plus qu\\'intéressants. Je vous conseille donc fortement d\\'être raisonnable. L\\'auteur conseille d\\'utiliser le Skyrim Communuty Uncapper pour avoir un perk tous les deux niveaux (voire 3!). Vous pouvez également y régler la vitesse de progression des compétences. N\\'oubliez que vous n\\'êtes pas obligés d\\'utiliser les 80 atouts possibles, cela gachera votre expérience de jeu. De plus, vous ne devriez pas vous éparillier dans toutes les compétences.\r\n\r\n[b][color=orange]Pourquoi installer ce mod?[/color][/b]\r\n\r\n\r\n[b][color=Lightskyblue]- Importer votre personnage existant[/color][/b] [color=yellow](Requiert SKSE)[/color]\r\nBien qu\\'il soit destiné à un nouveau personnage, il y a une fonction pour importer son personnage déjà existant. Faîtes une sauvegarde et essayez.\r\n\r\n[b][color=Lightskyblue]- Plus de styles de jeu[/color][/b]\r\nFaîtes le personnage que vous voulez sans vous demander si il sera viable en combat. Les mages qui ne sont pas de destruction ou les rogues à deux dagues seront plus viables avec ce mod.\r\n\r\n[b][color=Lightskyblue]- Un module construit pour éviter les complications[/color][/b]\r\nVous pouvez choisir les améliorations de gameplay que vous voulez et en évitez d\\'autres à partir du jeu. Pas d\\'inquiètude sur l\\'installation des fichiers ou sur les tweaks à effectuer avant de jouer. Installez et jouez.\r\n\r\n[b][color=Lightskyblue]- Intégration Homogène au Jeu[/color][/b]\r\nTout ce que ce mod ajoute pourrait faire partie du jeu si vous ne l\\'aviez jamais vu. Faire en sorte qu\\'un nouveau joueur ne se rende pas compte qu\\'il utilise ce mod est une des priorités du mod.\r\n\r\n[b][color=Lightskyblue]- Plus de Varieté[/color][/b]\r\nTrop de personnages dans skyrim finissent par jouer de la même façon. Avec des atouts plus variés et plus de capacités, chaque personnage a un aspect unique, rendant le jeu plus agréable, et créant un outil de role play plus intéressant. Vous voulez faire un chasseur qui vit en paix avec la nature? Maintenant vous le pouvez.\r\n\r\n[b][color=Lightskyblue]- Rapporter le fun au leveling[/color][/b]\r\nAvec plus d\\'Atouts, vous aurez hâte d\\'avoir plus de capacités et vous sentez vraiment que votre personnage progresse et vous n\\'avez pas l\\'impression que la seule chose qui évolue, c\\'est le rang des armes. La façon dont votre personnage joue dépend de comment il ou elle grandit.\r\n\r\n[b][color=Lightskyblue]- Miticuleusement équilibré[/color][/b]\r\nBien qu\\'il y ait toujours place à l\\'amélioration, l\\'auteur a fait beaucoup d\\'efforts pour s\\'assurer que ces changements soient équilibrés. La puissance générale est plus forte que dans le jeu original à cause de perks meilleurs, mais il n\\'y a pas d\\'atouts ou d\\'arbres cheatés. Quand cela a été nécessaire, il a même recalculé les dégats pour être sûr qu\\'ils soient en accord avec le mod.\r\n\r\n[b][color=Lightskyblue]- Synergie des Capacités[/color][/b]\r\nLes vieux arbres de compétences et donnaient que des avantages à leurs propres compétences, ce qui donnait une impression de déconnexion et d\\'inutilité. Les nouveaux arbres de compétences donnent aussi des avantages aux autres arbres, augmentant la complexité des builds et rendant même les perks inutiles interessants.\r\n\r\n[b][color=Lightskyblue]- Complétement configurable pour des conflits minimaux[/color][/b]\r\nVous pouvez activer et désactiver le mod ingame. De plus, tout a été construit pour avoir le moins de conflits possibles avec d\\'autres mods. Cela évite, contrairement aux autres mods, d\\'avoir 6 esp et un tas de patchs.\r\n\r\n\r\n[b][color=orange]Que fait exactement ce mod?[/color][/b]\r\n\r\n\r\n[b][color=Lightskyblue]- Atouts Automatiques[/color][/b]\r\nLes atous ennuyeux, mais vitaux (les 5 atouts principaux) sont maintenant accordés automatiquement selon votre niveau. Le but est de retrouver le système à la Oblivion. Cela augmente beaucoup votre puissance, mais laisse aussi du fun pour les atouts interessants.\r\n\r\n[b][color=Lightskyblue]- Nouveaux arbres[/color][/b]\r\nCela va sans dire, mais les arbres de compétences ont été totalement refaits. Rien n\\'a été supprimé, mais tout a été combiné, modifié, rendu automatique ou ajouté.\r\n\r\n[b][color=Lightskyblue]- Moins d\\'Augmentation[/color][/b][color=yellow] (Requiert SKSE)[/color]\r\nAvec le [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/skyrim_community_uncapper.php]Skyrim Community Uncapper[/url], vous pourrez modifier la vitesse d\\'augmentation des compétences.Le but est d\\'équilibrer le système de progression mais sans changer l\\'aspect du jeu. Vous pouvez donc changer ses valeurs si elles ne vous plaisent pas.\r\n\r\n[b][color=Lightskyblue]- Fonte de lingots[/color][/b]\r\nVous pouvez fondre vos armes en lingots, afin d\\'éviter le temps de respawn des mines. Bien sûr, vous pouvez activer ou désactiver cette option, si vous ne l\\'aimez pas ou si un mod fait la même chose.\r\n\r\n[b][color=Lightskyblue]- Récompenses de quêtes[/color][/b]\r\nCe mod accorde gratuitement, semi aléatoirement un atout quand vous accomplissez une quête majeure. Cela vous encourage à monter vos atouts en jouant et non pas en augmentant de niveau (NDT: jouez soi d\\'une manière, soi de l\\'autre, sinon c\\'est surcheaté). Vous pouvez le désactiver.\r\n\r\n[b][color=Lightskyblue]- Reset des atouts[/color][/b][color=yellow] (Requiert SKSE)[/color]\r\nVous pouvez reset tous vos perks quand vous voulez. Cela vous coûtera cependant une partie de votre vie, magie, vigueur pendant plusieurs jours. Les joueurs intéressés doivent enquêter dans les dortoirs de l\\'académie des mages. (NDT: ou m\\'envoyer un mp si vous voulez être spoilé).\r\n\r\n[b][color=Lightskyblue]- Mains Nues[/color][/b]\r\nLe combat à mains nues est désormais totalement viable. Il est intégré dans l\\'arbre de vol à la tire. (NDT: si vous jouez khajiit, je vous oblige à le faire jouer à mains nues!)\r\n\r\n[b][color=Lightskyblue]- Gradation des sorts[/color][/b]\r\nLes sorts augmentent selon votre niveau dans les écoles de magies. Les sorts de destruction feront plus de dégats, de soin soigneront mieux, les autres dureront plus longtemps etc. Ainsi, au niveau 100, vous ferez deux fois plus dégats. Il y a toujours les atouts pour diviser par deux le coût des sorts.\r\n\r\n[b][color=Lightskyblue]- Bâton de mage[/color][/b]\r\nJouer un mage peut-être dur a bas niveau, mais maintenant, les bâtons peuvent vraiment vous êtres utiles et vous faire monter de niveau comme ils devraient l\\'être.\r\n\r\n\r\n[b][color=orange]Configuration[/color][/b]\r\n\r\n\r\nCe mod est complètement configurable en fonction de vos souhaits, grâce à la console command. Pour l\\'utiliser, appuyez sur \\\"²\\\". Tapez sans guillemets \\\"set <NomDeLaVariable> to 0\\\" pour désactiver ou \\\"set <NomDeLaVariable> to 1\\\" pour activer. Remplacer NomDeLaVariable par la variable que vous voulez:\r\nNom des variables:\r\nAutoPerk: désactiver la pour plus de difficultés. SI vous la désactiver les atouts déjà distribués resteront. A faire donc plutot en début de partie.\r\nAutoPerk<Skill>: désactive les atouts automatiques pour un arbe précis\r\nRefundAutoPerks : A utiliser si vous avez reset vos perk. Mettez sur 1 si vous voulez recevoir un point d\\'atout pour chaque atout automatique supprimé.\r\nSPEAuras: si vous avez un problème durant les bagarres, mettez sur 0\r\nSPEMelting: Active ou désactive la fonte d\\'arme\r\nSPEQuestRewards: active ou désactive les récompense de quêtes\r\nSPEUnarmed : Acive ou désactive les mains nues (peut causer des bugs avec les mods qui modifient les mains nue ou pendant les bagarres)\r\nSPEUnarmedDamage: active ou désactive les bonus de dégats à mains nues pour la compatibilité avec certains mods.\r\n\r\n\r\n[b][color=orange]Prérequis/Mods Recommandés[/color][/b]\r\n\r\n\r\n• Skyrim 1.8+ - Requis\r\n• [url=http://skse.silverlock.org/]Skyrim Script Extender[/url] - Hautement Recommandé et obligatoire pour certaines options.\r\n• [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/skyrim_community_uncapper.php]Skyrim Community Uncapper[/url] - Hautement recommandé pour éviter des persos surpuissants. Un perk tous les deux niveaux est conseillé. (la configuration est expliqué sur la confrerie)\r\n• [url=http://skyrim.nexusmods.com/mods/21587]Character Creation Overhaul[/url] En Anglais - Un mod qui ajoute les classes d\\'Oblivion et qui vous oblige à vous spécialiser.\r\n\r\n\r\n[b][color=orange]Installation[/color][/b]\r\n\r\n\r\nTéléchargez le mod original (version 3.0) [url=http://skyrim.nexusmods.com/mods/24445/]Ici[/url] :\r\nDécompressez l’archive et placez les fichiers et dosssiers suivants dans le répertoire data du jeu.\r\nSkyrim Perk Enhancements.bsa\r\nSkyrim Perk Enhancements.esp\r\nSPERG Dawnguard Patch.esp (si vous avez dawnguard)\r\n\r\nEnsuite téléchargez le mod traduit décompressez l’archive et placez le fichier suivant dans le répertoire data du jeu:\r\nSkyrim Perk Enhancements.esp\r\nCliquez sur remplacer.\r\n\r\nActivez Skyrim Perk Enhancements.esp via le SKyrim Launcher.\r\n\r\n\r\n[b][color=orange]Crédit[/color][/b]\r\n\r\nseorin\r\n\r\n\r\nNouveaux Arbres d\\'Atouts\r\n_______________________________________________\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=444Archerie.png][img]http://www.ushareimg.com/images/444Archerie.png[/img][/URL]\r\n\r\n[color=red][b]Archerie[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=red][i]Découvert(Novice) [/i][/color]- Les arcs infligent 20 % de dégâts supplémentaires.\r\n• [color=red][i]Tir critique (Apprenti) [/i][/color]- Les arcs ont 40% de dégats supplémentaires et ont 10% de chances de porter un coup critique.\r\n• [color=red][i]Chasseur économe (Adepte)[/i][/color] - 80% de chance de retrouver les flèches sur les corps. Les arcs font 60% de dégats supplémentaires et ont 15% de faire un coup critique.\r\n• [color=red][i]Ranger (Expert)[/i][/color] - Vous vous déplacez plus vite avec un arc bandé. Les arcs font 80% de dégats supplémentaires et ont 20% de chance de faire un coup critique.\r\n• [color=red][i]Tir Rapide (Maître) [/i][/color]- Vous pouver bander un arc 30% plus rapidement. Les arcs font 2 fois plus de dégats et ont 25% de chance de faire un coup critique.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=red][i]Flèches Ethérées[/i][/color] - Tirer avec un arc sans flèches équipées tirera une flèche éthérée contre votre magie.\r\n• [color=red][i]Eagle Eye [/i][/color]- Appuyer sur Parade en cours de visée permet d\\'effectuer un zoom.\r\n• [color=red][i]Stabilité [/i][/color]- Zoomer avec un arc ne consomme pas de vigueur et ralentit le temps de 50 %\r\n• [color=red][i]Survivaliste [/i][/color]- La plupart des animaux ne vous attaquent pas si vous ne les attaquez pas. Vous obtenez le pouvoir de la Vue du Chasseur.\r\n• [color=red][i]K-O[/i][/color] - Donner un coup à l\\'arc renverse brièvement l\\'adversaire. Cette capacité peut être utilisé une fois chaque 15 secondes.\r\n• [color=red][i]Flèche déstabilisante[/i][/color] - Les flèches destabilisent tous les adversaires, sauf les plus gros (50%). Les coups critiques font 50% de dommages supplémentaires.\r\n• [color=red][i]Sniper[/i] [/color]- Les attaques à l\\'arc guarantissent un coup critique en dehors du combat.\r\n• [color=red][i]Tir en plein tête [/i][/color]- Les coups critiques à l\\'arc ont 10% de chance d\\'infliger des dégats léthaux. Toutes les armes ont 5% d\\'en infliger.\r\n• [color=red][i]Tir au genou[/i][/color] - Les attaques à l\\'arc ont 15% de chance d\\'estropier  l\\'adversaire pour 12 secondes. Les cibles sans genou vulnérable seront en revanche paralysées.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=125Parade.png][img]http://www.ushareimg.com/images/125Parade.png[/img][/URL]\r\n\r\n[color=red][b]Parade[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=red][i]Défense Impénétrable [/i][/color]- La parade est plus efficace de 20, 25, 30, 35, 40%.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=red][i]Frappe puissante[/i][/color] - Permet d\\'infliger une Frappe puissante.\r\n• [color=red][i]Réflexes [/i][/color]- Lorsque vous parez une attaque puissante ennemie, le temps ralentit.\r\n• [color=red][i]Déviation [/i][/color]- Les flèches qui touchent le bouclier ne font pas de dégats. Parer avec un bouclier réduit les dégats de feu, glace, foudre de 50%.\r\n• [color=red][i]Frappe de désarmement [/i][/color]- 30% de chance de désarmer l\\'adversaire avec une frappe puissante avec bouclier. Les frappes font cinq fois plus de dégats.\r\n• [color=red][i]Posture Défensive[/i][/color] - Vous prenez 20% de dégats en moins, même sans utiliser de bouclier. Parer avec un bouclier a 50% de chance de renvoyer tous les dégats à l\\'adversaire.\r\n• [color=red][i]Charge Couverte[/i][/color] - Les boucliers brandits ne pèsent rien et vous êtes capables de vous déplacez plus rapidement en parant. Sprinter avec en parant projetera la plupart des adversaires au so\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=860Armure_Lourde.png][img]http://www.ushareimg.com/images/860Armure_Lourde.png[/img][/URL]\r\n\r\n[color=red][b]Armure Lourde[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=red][i]Poids lourd (Novice) [/i][/color]- Augmente la valeur d\\'armure des armures lourdes de 20 %.\r\n• [color=red][i]Panoplie lourde(Apprenti) [/i][/color]- Porter seulement une armure lourde offre un bonus de 25%. La valeur des armures lourdes augmente de 40%.\r\n• [color=red][i]Conditionnement (Adepte)[/i][/color] - Les Amures Lourdes ne pèsent rien et ne vous ralentissent plus quand vous les portez. Augmente la valeur d\\'armure de 60%.\r\n• [color=red][i]Inébranlable (Expert)[/i][/color] - 50% de chancelement en moins si vous porter seulement une armure lourde. La valeur d\\'armure lourde augmente de 80%.\r\n• [color=red][i]Tenue Assortie (Maître) [/i][/color]- Bonus d\\'Armure supplémentaire de 25% si vous portez au moins 3 pièces d\\'Armure Légère. La valeur d\\'armure double pour les armures légères.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=red][i]Poings d\\'Acier[/i][/color] - Les gantelets d\\'armure lourde augmentent les dégats au corps à corps et réduisent le coût en vigueur des attaques de mélée. Les gantelets en matériaux de meilleur qualité ont un meilleur effet (max 30%)\r\n• [color=red][i]Rembourage Epais[/i][/color]- Quand vous portez une armure lourde presque complète, les dégats des flèches est réduit de moitié et la résistance à la glace augmente de 20%.\r\n• [color=red][i]Chevalier Monté [/i][/color]- Les attaques à cheval font deux fois plus de dégats.\r\n• [color=red][i]Mur de Fer [/i][/color]- En portant la plupart des armures lourdes, les ennemis qui vous frappent au corps à corps chancelleront parfois.\r\n• [color=red][i]Mur de Plate[/i][/color] - Pour chaque pièce d\\'armure lourde équipée, il y a 5% de chance que les sorts de feu, foudre, glace ne vous fassent aucun dommage. (max 20%)\r\n• [color=red][i]Volonté de Fer[/i][/color] - Accorde une immunité à la paralysie et aux cris de Déferlement.\r\n• [color=red][i]Ignorer la Douleur[/i] [/color]- 20% de chance d\\\"ignorer tous les dégats d\\'une attaque de mélée.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=767Une_Main.png][img]http://www.ushareimg.com/images/767Une_Main.png[/img][/URL]\r\n\r\n[color=red][b]Une Main[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=red][i]Homme d\\'armes [/i][/color]- Les armes à une main font 20, 40, 60, 80, 100% de dégats en plus et les attaques puissantes coûtent 5, 10, 15, 20, 25% de vigueur en moins.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=red][i]Brise-Os[/i][/color] - Les attaques à la masse ont 5% de chances de renverser l\\'adversaire. Les attaques de mélée ignore 50% de l\\'armure.\r\n• [color=red][i]Hache sanglante[/i][/color]- Les attaques à la hache de guerre font 50% de dommage critiques en plus. Les attaques avec les autres armes font 5% de dégats critiques en plus.\r\n• [color=red][i]Fine lame [/i][/color]- Les attaques à une main sont 30% plus rapides. Les attaques avec d\\'autres armes sont 15% plus rapides.\r\n• [color=red][i]Position de combat [/i][/color]- Toutes les armes frapperont 15% plus rapidement et leur dégats critiques augmentront de 50%, en maniant une ou plusieurs armes à une main.\r\n• [color=red][i]Maître d\\'Arme[/i][/color] - Les attaques au corps à corps gagnent des bonus selon le type d\\'arme. Ces bonus sont listés dans les effets actifs.\r\n• [color=red][i]Charge critique[/i][/color] - Vous pouvez faire une attaque puissante en sprintant qui double les dégats critiques. Les attaques puissantes à une main ont 20% de chances de porter un coup critique infligeant davantage de dégâts supplémentaires.\r\n• [color=red][i]Attaque sauvage[/i] [/color]- Les attaques puissantes latérales avec une arme à une main ont une chance de tuer les cilbes avec une vie basse. Si l\\'attaque est réussie, la vigueur se régènère de 100 points pendant 5 seondes.\r\n• [color=red][i]Coups sauvages à deux armes [/i][/color]- Les attaques puissantes à deux armes font 50% de dégats supplémentaires. Les attaques à deux armes sont 30% plus rapides.\r\n• [color=red][i]Rafale Paralysante[/i][/color] - Pendant les 6 secondes suivant une attaque puissante reculée avec une arme à une main, toute attaque paralyse la cible. Cela ne peut se faire qu\\'une fois toutes les 20 secondes.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=323Forgeage.png][img]http://www.ushareimg.com/images/323Forgeage.png[/img][/URL]\r\n\r\n[color=red][b]Forgeage[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=red][i]Forge de (matériel)[/i][/color]- Vous pouvez créer les armres et armures de (matériel) à la forge.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=red][i]Armure draconique[/i][/color] - Vous pouvez créer l\\'Armure Draconique à la Forge.\r\n• [color=red][i]Armurier Léger[/i][/color]- Vous pouvez doubler la valeur des Armures Légères.\r\n• [color=red][i]Armurier Lourd [/i][/color]- Vous pouvez doubler la valeur des Armures Lourdes.\r\n• [color=red][i]Armurier [/i][/color]- Vous pouvez doubler la vameur des Armes et Boucliers.\r\n• [color=red][i]Forge Arcanique[/i][/color] - Vous pouvez améliorer les armes et armures enchantées. Les enchantements lancés seront 10% plus puissants.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=266Deux_mains.png][img]http://www.ushareimg.com/images/266Deux_mains.png[/img][/URL]\r\n\r\n[color=red][b]Deux Mains[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=red][i]Barbare[/i][/color]- Les armes à deux mains font 20, 40, 60, 80, 100% de dégats en plus et les attaques puissantes coûtent 5, 10, 15, 20, 25% de vigueur en moins.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=red][i]Brise-crâne[/i][/color] - Les attaques sans déplacement au marteau de guerre ont 30% de chance de renverser la cible. Les attaques au corps à corps ignorent 50% de l\\'armure.\r\n• [color=red][i]Broyeuse[/i][/color]- LLes attaques à la grande hache font 50% de coups critiques supplémentaires. Les attaques de puissance avec les autres armes font 20% de coups critiques supplémentaires.\r\n• [color=red][i]Grand Swing [/i][/color]- LLes attaques avec les grandes épes sont plus rapide de 30%. Les attaques avec les autres armes de 15%.\r\n• [color=red][i]Position du champion [/i][/color]- Les attaques à deux mains ont 10% de chance de renevrser la cible. Les attaques à mains nues ont 5% de chance supplémentaire d\\'infliger des coups critiques.\r\n• [color=red][i]Grande charge critique[/i][/color] - Vous pouvez faire une attaque puissante en sprintant à deux mains qui double les dégats critiques. Les attaques puissantes à deux mains ont 20% de chances de porter un coup critique infligeant davantage de dégâts supplémentaires.\r\n• [color=red][i]Coup dévastateur[/i][/color] - Les attaques puissantes sans déplacement avec une arme à deux mains font 25% de dégats supplémentaires avec une chance de décapiter vos ennemis. Les attaques de melée avec une arme à deux mains inflige 10% de dommages supplémentaires.\r\n• [color=red][i]Armure Fragmentée[/i] [/color]- Les attaques puissantes en avant à deux mains détruisent le bouclier de la cible si elle pare. Si elle ne pare pas, il y a 30% de chance qu\\'une pièce d\\'armure soit détruite.\r\n• [color=red][i]Balayage [/i][/color]-Les attaques latérales à deux mains blessent toutes les cibles autour de vous. Les dégats au corps à corps augmentent de 20% pendant 6 secondes après chaque attaque latérale.\r\n• [color=red][i]Maître de guerre[/i][/color] - Les attaques de puissance à deux mains ont 10% de chance de faire des dégats létaux.\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=787Alchimie.png][img]http://www.ushareimg.com/images/787Alchimie.png[/img][/URL]\r\n\r\n[color=Darkgreen][b]Alchimie[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Darkgreen][i]Alchimiste Débutant(Novice) [/i][/color]- Les Potions et Poisons que vous faîtes sont 25% plus puissants. Les potions qui restaurent vie, magie ou vigueur sont 25% plus puissantes.\r\n• [color=Darkgreen][i]Apprenti Alchimiste (Apprenti) [/i][/color]- Les Potions et Poisons que vous faîtes sont 50% plus puissants. Manger un ingrédient en révèlera les deux premiers effets.\r\n• [color=Darkgreen][i]Alchimiste Adepte (Adepte)[/i][/color] - Les Potions et Poisons que vous faîtes sont 75% plus forts. Manger un ingrédient en relève les trois premiers effets.\r\n• [color=Darkgreen][i]Alchimiste Expert (Expert)[/i][/color] - Les Potions et Poisons que vous faîtes sont 100% plus forts. Manger un ingrédient en relève tous les effets.\r\n• [color=Darkgreen][i]Maître Alchimiste (Maître) [/i][/color]- Les Potions et Poisons que vous faîtes sont 125% plus forts. Deux ingrédients sont récoltés sur les plantes.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Darkgreen][i]Sang de Troll[/i][/color] - La santé se regénère 50% plus vite.\r\n• [color=Darkgreen][i]Poison Concentré [/i][/color]- Les poisons que vous faîtes sont 50% plus forts et ceux appliqués aux armes servent quatre fois.\r\n• [color=Darkgreen][i]Chercheur de Savoir[/i][/color]- Vous autorise à créer la Pierre du Philosophe, qui débloque la capacité de transmuter les lingots de fer. Accorde aussi une résistance de 50% à tous les poisons.\r\n• [color=Darkgreen][i]Pureté[/i][/color]- Tous les effets négatifs disparaissent des potions créées, tout comme les effets positifs dans les poisons créés.\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=903Armure_L_g_re.png][img]http://www.ushareimg.com/images/903Armure_L_g_re.png[/img][/URL]\r\n\r\n[color=Darkgreen][b]Armure Légère[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Darkgreen][i]Défense de plume (Novice) [/i][/color]- Augmente la valeur d\\'armure des armures légères de 20 %.\r\n• [color=Darkgreen][i]Tenue légère (Apprenti) [/i][/color]- Porter une armure légère seule offre un bonus d\\'armure de 25%. Augmente la valeur d\\'armure de 40%.\r\n• [color=Darkgreen][i]Liberté de mouvement (Adepte)[/i][/color] - Les Armures Légère ne pèsenr rien et ne vous ralentissent plus quand vous les portez. La valeur d\\'armure légère augmente de 60%.\r\n• [color=Darkgreen][i]Agilité (Expert)[/i][/color] - Les dégats de chute sont réduits de moitié. Augmente la valeur d\\'armure légère de 80%.\r\n• [color=Darkgreen][i]Tenue légère (Maître) [/i][/color]- Porter une armure légère seule offre un bonus d\\'armure de 25%. Augmente la valeur d\\'armure de 40%.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Darkgreen][i]Fardeau Léger[/i][/color] - Les chevaux sont 50% plus rapide.\r\n• [color=Darkgreen][i]Marchevent [/i][/color]- La vigueur se regénère 50% plus rapidement.\r\n• [color=Darkgreen][i]Rage du Berserker[/i][/color]- Quand vous frappez avec une attaque puissante, vous obtenez une regénération de vigueur et une augmentation de dégats de 25% pendant 6 secondes.\r\n• [color=Darkgreen][i]Isolation [/i][/color]- Pour chaque pièce d\\'armure légère équipée, les potions et sorts d\\'armure durent 10% plus longtemps.\r\n• [color=Darkgreen][i]Retraite Stratégique[/i][/color] - Quand votre vie passe sous les 20%, vous avez une explosion de vitesse pour 10 secondes. Cet effet ne peux s\\'utiliser qu\\'une fois toutes les 30 secondes.\r\n• [color=Darkgreen][i]Flèche déstabilisante[/i][/color] - Les flèches destabilisent tous les adversaires, sauf les plus gros (50%). Les coups critiques font 50% de dommages supplémentaires.\r\n• [color=Darkgreen][i]Tactiques d\\'Escarmouche[/i] [/color]- Les atouts qui affectent les attaques puissantes ont une légère influence sur les attaques normales.\r\n• [color=Darkgreen][i]Riposte[/i][/color]- 40% de chance de renvoyer les dégats à l\\'ennemi.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=853Crochetage.png][img]http://www.ushareimg.com/images/853Crochetage.png[/img][/URL]\r\n\r\n[color=Darkgreen][b]Crochetage[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Darkgreen][i]Verrou de Novice (Novice) [/i][/color]- Les serrures de niveau Novice sont beaucoup plus faciles à crocheter.\r\n• [color=Darkgreen][i]Verrou d\\'Apprenti (Apprenti) [/i][/color]- Les serrures de niveau apprenti sont beaucoup plus faciles à crocheter.\r\n• [color=Darkgreen][i]Verrou d\\'Adepte (Adepte)[/i][/color] - Les serrures de niveau Adepte sont beaucoup plus faciles à crocheter.\r\n• [color=Darkgreen][i]Verrou d\\'Expert (Expert)[/i][/color] - Les serrures de niveau Expert sont beaucoup plus faciles à crocheter.\r\n• [color=Darkgreen][i]Verrou de Maître (Maître) [/i][/color]- Les serrures de niveau Maître sont beaucoup plus faciles à crocheter.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Darkgreen][i]L\\'Homme de l\\'Intérieur[/i][/color] - Vous autorise à accéder à des coffre dissimulés en dehors des prisons. Ils sont utilisés pour le blanchiment de biens volés et pour payer des amendes réduites.\r\n• [color=Darkgreen][i]Coup Aveuglant[/i][/color]- Frapper votre adversaire avec une torche a 30% de chance que ses attaques deviennent des coups obliques (10% de dégats) pendant 8 secondes.\r\n• [color=Darkgreen][i]Kleptomane[/i][/color]- Vous pouvez prendre des crochets sans être remarqué. La capacité de port est augmenté de 100 points.\r\n• [color=Darkgreen][i]Chasseur de trésors [/i][/color]- 50% de chance supplémentaire de trouver des objets spéciaux et plus d\\'or dans les coffres.\r\n• [color=Darkgreen][i]Fouilleur de Donjons[/i][/color] - Les chaurus, ragnards et araignées ne vous attaquent pas si vous ne les attaquez pas. Vous obtenez le pouvoir Sens du Donjon.\r\n• [color=Darkgreen][i]Coup Enflammé[/i][/color] - Les dégats de feu causé par un coup avec la torche augmentent et peuvent faire fuir votre adversaire dans la peur.\r\n• [color=Darkgreen][i]Ingénieur Dwemer[/i] [/color]- Les automates dwemers ne vous attaquent pas si vous ne les attaquez pas. Cela vous accorde 30% de résistance à la foudre et augmente la variété de bouts de métaux dwemer que vous pouvez fondre en lingot.\r\n• [color=Darkgreen][i]Serrurier[/i][/color]- Les crochets ne se cassent jamais, le début du crochetage commence près de la position d\\'ouverture et un crochetage réussi offre une copie de la clé.\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=128Vol_la_tire.png][img]http://www.ushareimg.com/images/128Vol_la_tire.png[/img][/URL]\r\n\r\n[color=Darkgreen][b]Vol à la Tire[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Darkgreen][i]Main leste (Novice) [/i][/color]- Le vol à la tire augmente de 20%. Le poids de l\\'objet et sa valeur influent sur les chances de réussite.\r\n• [color=Darkgreen][i]Voleur nocturne (Apprenti) [/i][/color]- Le vol à la tire augmente de 25% si la cible est endormie. Le vol à la tire augmente de 40% ct les dégats à mains-nues sont aussi augmentés.\r\n• [color=Darkgreen][i]Argent facile (Adepte)[/i][/color] - Voler de l\\'or est 50% plus facile. Le vol à la tire augmente de 60% et les dégats à mains-nues sont aussi augmentés.\r\n• [color=Darkgreen][i]Maître des clés (Expert)[/i][/color] - Voler une clé réussira presque toujours. Le vol à la tire augmente de 80% et les dégats à mains-nues sont aussi augmentés.\r\n• [color=Darkgreen][i]Subtilisation (Maître) [/i][/color]- Le vol à la tire et d\\'or augmentent de 100% et les dégats à mains-nues sont aussi augmentés.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Darkgreen][i]Empoisonné[/i][/color] - Atteignez vos ennemis en silence en ajoutant des poisons dans leur inventaire.\r\n• [color=Darkgreen][i]Grandes poches[/i][/color]- La capacité de port est augmenté de 100 points et la vigueur de 50 points.\r\n• [color=Darkgreen][i]Infusion du Brigand[/i][/color]- Consommer de l\\'alcool augmente vos dégats au corps à corps de 30% pendant 15 secondes.\r\n• [color=Darkgreen][i]Eclaboussement Acide[/i][/color]- Tant qu\\'au moins une main est libre, les attaques de mélée infligent 50% de dommages critiques supplémentaires et ont 20% de chance de faire des dommages de poison pendant 3 secondes.\r\n• [color=Darkgreen][i]Voleur à l\\'Arrachée[/i][/color] - Augmente la vitesse de course de 30%.\r\n• [color=Darkgreen][i]Attrapeur de Lame[/i][/color] - Tant qu\\'une main est libre, les attaques au corps à corps font 20% de dégats en plus et vous avez 10% de chance de désarmer l\\'adversaire qui vous attaque au corps à corps.\r\n• [color=Darkgreen][i]Rage d\\'Ivresse[/i] [/color]- Consommer de l\\'alcool a une chance de vous donner une rage d\\'ivresse, augmentant les dégats au corps à corps et réduisant les dommages pris de 50% chacun.\r\n• [color=Darkgreen][i]Grand escamoteur[/i][/color]- Permet de voler des objets équipés.\r\n• [color=Darkgreen][i]Coup Mesquin[/i][/color]- Tant qu\\'une main est libre, les attaques de puissance ont 25% de chance de paralyser l\\'adversaire. Les attaques à mians nues, ont 5% de chance supplémentaire d\\'infliger des coups critiques.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=179Discretion.png][img]http://www.ushareimg.com/images/179Discretion.png[/img][/URL]\r\n\r\n[color=Darkgreen][b]Discretion[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Darkgreen][i]Discrétion assurée (Novice) [/i][/color] - Vous êtes 20 % plus difficile à détecter en furtivité.\r\n• [color=Darkgreen][i]Pas de loup (Apprenti) [/i][/color] - Le bruit causé par l\\'armure est réduit de 50%. Vous êtes 25% plus diffciles à détecter.\r\n• [color=Darkgreen][i]Silence (Adepte)[/i][/color] - Marcher ou courir n\\'affecte pas la détection. Vous êtes 30% plus difficile à détecter.\r\n• [color=Darkgreen][i]Roulade silencieuse (Expert)[/i][/color] - Sprinter en mode discrétion vous fera executer une roulade silencieuse. Vous êtes 35% plus difficile à détecter.\r\n• [color=Darkgreen][i]Lame d\\'assassin (Maître) [/i][/color] - Les attaquent avec des dagues font 50% de dégats en plus. Vous êtes 40% plus difficiles à détecter en mode discrétion.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Darkgreen][i]Attaque Discrète[/i][/color] - Les attaques discrètes infligent trois fois plus de dégats à l\\'arc, six fois plus avec les armes à une main, quinze fois plus avec une dague.\r\n• [color=Darkgreen][i]Oeil Vif[/i][/color] - Les attaques à la dague en dehors du combat infligent un coup critique.\r\n• [color=Darkgreen][i]Pied léger[/i][/color] - Vous ne déclenchez pas les pièges au sol et vous chancelez moins de 20% quand vous êtes frappés.\r\n• [color=Darkgreen][i]Réflexes d\\'Assassin[/i][/color] - Accorde le pouvoir des Réflexes d\\'Assassin, qui ralentit le temps contre de la vigueur, mais seulement en mode discrétion.\r\n• [color=Darkgreen][i]Chercheur de Coeur[/i][/color] - Les attaques discrètes ont 10% de chance d\\'infliger des dégats létaux.\r\n• [color=Darkgreen][i]Guerrier de l\\'ombre[/i][/color] - S\\'accroupir vous fait quitter le combat pendant un court moment et force les adversaires distants à chercher une cible.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=327Eloquence.png][img]http://www.ushareimg.com/images/327Eloquence.png[/img][/URL]\r\n[color=Darkgreen][b]Eloquence[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Darkgreen][i]Négociation (Novice) [/i][/color]- Les prix d\\'achats et de vente sont plus intéressants de 10 %.\r\n• [color=Darkgreen][i]Vendeur (Apprenti) [/i][/color]- Vous pouvez vendre n\\'importe quel type de marchandise à n\\'importe quel type de marchand.\r\n• [color=Darkgreen][i]Investissement (Adepte)[/i][/color] - Vous pouvez investir 500 pièces d\\'or chez un marchand pour augmenter sa quantité d\\'or disponible. Les prix de vente est d\\'achat sont 20% plus intéressants.\r\n• [color=Darkgreen][i]Refourgue (Expert)[/i][/color] - Vous pouvez vendre des marchandises volées à tous les marchands. Les prix de vente et d\\'achat sont 25% plus interessants.\r\n• [color=Darkgreen][i]Maître commerçant (Maître) [/i][/color]- Chaque marchand a 1000 pièces d\\'or pour troquer. Les prix de vente et d\\'achat sont 30% plus interessants.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Darkgreen][i]Persuasion[/i][/color] - Vous pouvez soudoyer les gardes pour ignorer vos crimes. Les tentatives de persuasion sont 30% plus faciles et les intimidations sont deux fois plus faciles.\r\n• [color=Darkgreen][i]Entrainement de la Voix[/i][/color]- Les Cris sont 50% plus puissants et durent 30% plus longtemps.\r\n• [color=Darkgreen][i]Charme[/i][/color]- Les prix sont 30% plus intéressants avec le sexe opposé.\r\n• [color=Darkgreen][i]Skald Légendaire[/i][/color]- Le temps entre les cris est réduit de 50%.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=641Atronach.png][img]http://www.ushareimg.com/images/641Atronach.png[/img][/URL]\r\n\r\n[color=Lightskyblue[b]Altération[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Lightskyblue][i]Altération de (rang)[/i][/color] - Les sorts de (rang) consomment deux fois moins de magie.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Lightskyblue][i]Réveil Ancestral[/i][/color] - Vos capacités raciales passives sont deux fois plus fortes, et vous recevez une seconde version de votre pouvoir racial qui peut être utlisé toutes les 6 heures.\r\n• [color=Lightskyblue][i]Charge de Sort[/i][/color] - Les sorts sont 15% plus puissant pour chaque seconde passée à les charger. (max 45%]\r\n• [color=Lightskyblue][i]Protection magique[/i][/color] - Les sorts d\\'armure magique n\\'ont pas besoin d\\'être relancé. Ils sont quatre fois plus résistant si vous ne portez pas d\\'armure.\r\n• [color=Lightskyblue][i]Transmutation Mystique[/i][/color] - Vous autorise à forger un Convertisseur des Arcanes, qui transforme votre magie en âme pour des enchantement plus puissants. Un niveau élevé vous autorise à créer plus d\\'énergie.\r\n• [color=Lightskyblue][i]Expert en Efficacité[/i][/color] - Chaque rang d\\'une école de réduit le coût de tous les sorts de cette école de 10% et augmente la durée des sorts de 20%.\r\n• [color=Lightskyblue][i]Résistance magique[/i][/color] - Pare 30% des effets d\\'un sort.\r\n• [color=Lightskyblue][i]Echo Spirituel[/i] [/color] - 10% de chances d\\'invocquer un Echo Spirituel en combat, qui puise la santé, magie, vigueur des ennemis vers vous.\r\n• [color=Lightskyblue][i]Chaîne de Lancés[/i][/color] - Les sorts de destruction se recharge à chaque sort lancé. A la charge maximale, lancer deux sorts vous autorise à faire des doubles dégats sans coùt en magie pour 5 secondes, mais après, la charge sera remise à zéro.\r\n• [color=Lightskyblue][i]Atronach [/i][/color] - Absorbe 30% de la magie de tous les sorts dont vous êtes victime.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=175Conjuration.png][img]http://www.ushareimg.com/images/175Conjuration.png[/img][/URL]\r\n\r\n[color=Lightskyblue[b]Conjuration[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Lightskyblue][i]Conjuration de (rang)[/i][/color] - Les sorts de (rang) consomment deux fois moins de magie.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Lightskyblue][i]Invocation d\\'Esprits[/i][/color] - Les armes liées font plus de dégats et capture les âmes des cibles.\r\n• [color=Lightskyblue][i]Liaison mystique[/i][/color] - Les armes liées font plus de dégats, bannissent les créatures invoquées.\r\n• [color=Lightskyblue][i]Lien condamnatoire[/i][/color] - Les armes invoqués font plus de dégats et obtiennent des enchantement élémentaux.\r\n• [color=Lightskyblue][i]Invocateur[/i][/color]- Permet d\\'invoquer des atronachs ou des morts-vivants de trois fois plus loin.\r\n• [color=Lightskyblue][i]Âmes enténébrées[/i][/color] - Les Morts-Vivants ranimés ont 100 points de santé supplémentaires et restent réanimés deux fois plus longtemps.\r\n• [color=Lightskyblue][i]Énergie élémentale[/i][/color] - Les Atronachs sont 50% plus forts et restent invoqués deux fois plus longtemps.\r\n• [color=Lightskyblue][i]Âmes jumelles[/i][/color] - Vous pouvez invoquer deux atronachs ou zombies ranimés à vos côtés.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=443Destruction.png][img]http://www.ushareimg.com/images/443Destruction.png[/img][/URL]\r\n\r\n[color=Lightskyblue][b]Destruction[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Lightskyblue][i]Destruction de (rang)[/i][/color] - Les sorts de (rang) consomment deux fois moins de magie.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Lightskyblue][i]Double Sort[/i][/color] - Activer le double lancé de sort pour toutes les écoles de magie. Cela permet d\\'obtenir des effets enore plus puissants.\r\n• [color=Lightskyblue][i]Impact[/i][/color] - La plupart des sorts de destruction destabilisent l\\'adversaire en cas de double lancement.\r\n• [color=Lightskyblue][i]Maître des runes[/i][/color] - Vous pouvez placer des runes cinq fois plus loin et elles feront deux fois plus de dégats.\r\n• [color=Lightskyblue][i]Affinité avec les Flammes[/i][/color] - Les attaques avec les armes ont 20% de chance de faire subir à la cible des dégats triplé avec le feu pendant 4 secondes. Les améliorations de forge sont 20% plus efficace.\r\n• [color=Lightskyblue][i]Armure de Gel[/i][/color] - Augmente l\\'armure et la résistance à la glace de 20% et ralentit les ennemis qui vous attaquent au corps à corps de 50% pendant 10 secondes.\r\n• [color=Lightskyblue][i]Courant Gracieux[/i][/color] - Les sorts de Foudre infligent 50% de dégats en plus. Tous les sorts coûtent 20% de magie en moins.\r\n• [color=Lightskyblue][i]Flammes intenses[/i] [/color]- Les dégats de feu font fuir l\\'adversaire si sa santé est sous les 30%. Il y a 20% de chance qu\\'en lançant un sort de feu, un deuxième se lance automatiquement sans consommation de magie.\r\n• [color=Lightskyblue][i]Profonde congélation[/i][/color] - Les dégats de froid paralysent les cibles qui ont moins de 20% de vie. Il y a 20% de chance qu\\'en lançant un sort de froid, un deuxième se lance automatiquement sans consommation de magie.\r\n• [color=Lightskyblue][i]Désintégration[/i][/color] - Les dégats de foudre désintègrent l\\'adversaire si sa santé est sous les 10%. Il y a 20% de chance qu\\'en lançant un sort de foudre, un deuxième se lance automatiquement sans consommation de magie.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=481Enchantement.png][img]http://www.ushareimg.com/images/481Enchantement.png[/img][/URL]\r\n\r\n[color=Lightskyblue][b]Enchantement[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Lightskyblue][i]Enchanteur[/i][/color] - Les nouveaux enchantements sont 20, 40, 60, 80, 100% plus forts.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Lightskyblue][i]Pilleur d\\'Ame[/i][/color] - Les gemmes spirituelles disposent d\\'un peu de magie supplémentaire pour recharger. Les coups de grâce aux créatures, mais pas aux humains, capturent 5 % de l\\'âme de la victime.\r\n• [color=Lightskyblue][i]Poussière Magique[/i][/color] - Double la durée des potions. Les potions qui fortifient une compétence d\\'artisana durent 10 fois plus longtemps.\r\n• [color=Lightskyblue][i]Enchantement Elémental[/i][/color] - Les enchantements élémentaux sur les armes et armures sont 25% plus forts.\r\n• [color=Lightskyblue][i]Enchantements essentiels[/i][/color] - Les enchantements de santé, magie, vigueur, compétence sur les armures sont 25% plus forts.\r\n• [color=Lightskyblue][i]Potion Imprégnée[/i][/color] - Toutes les Potions sont 50% plus efficaces.\r\n• [color=Lightskyblue][i]Effet supplémentaire[/i][/color] - Vous pouvez enchanter deux fois un même objet.\r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=497Illusion.png][img]http://www.ushareimg.com/images/497Illusion.png[/img][/URL]\r\n\r\n[color=Lightskyblue][b]Illusion[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Lightskyblue][i]Illusion de (rang)[/i][/color] - Les sorts de (rang) consomment deux fois moins de magie.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Lightskyblue][i]Présence Mobilisatrice[/i][/color] - Pendant les combats, les alliés proches (incluant les créatures) infligent plus de dégats, gagnent 25 points de vie, magie et vigueur, et ne fuient jamais.\r\n• [color=Lightskyblue][i]Sorts discrets[/i][/color] - Les autres n\\'entendent pas les sorts que vous lancez, quelle que soit l\\'école de magie.\r\n• [color=Lightskyblue][i]Bête Fantôme[/i][/color] - Une créature qui vient combattre à vos côtés durant les combats. Parfois, elle fait fuir vos adversaires. Si la bête meurt, elle ne reviendra pas pendant 3 heures.\r\n• [color=Lightskyblue][i]Mur Spectral[/i][/color] - A chaque 70 points gagnés par une armure portée, vous gagnez aussi 5% de résistance à la magie. (max 40%)\r\n• [color=Lightskyblue][i]Guerrier Spectral[/i][/color] - 5% de chance d\\'entrer dans une forme spectrale pour 8 secondes quand vous frappez. Sous cette forme, vous ne prenez pas de dégats vous faîtes 50% de dégats en plus et les sorts d\\'illusion ne coûtent rien.\r\n• [color=Lightskyblue][i]Présence Calmante[/i][/color] - Les géants, mammouths, spectres des glaces et trolls ne vous attaquent pas si vous ne les attaquez pas. Vous obtenez l\\'usage du pouvoir Tranquilité.\r\n• [color=Lightskyblue][i]Maître de l\\'illusion[/i][/color] - Les sorts d\\'illusion affectent les morts-vivants, les daedras et les automates.\r\n• [color=Lightskyblue][i]Marche Fantôme[/i][/color] - Les effets d\\'invisilbilié durent deux fois plus longtemps. Pendant l\\'invisibilité, votre mouvement est silencieux et les attaques et sorts passent à travers vous.\r\n• [color=Lightskyblue][i]Arsenal Fantôme[/i][/color] - Des armes fantômes invulnérables qui vont aideront pendant les combats. \r\n\r\n\r\n[URL=http://www.ushareimg.com/view.php?filename=646Gu_rison.png][img]http://www.ushareimg.com/images/646Gu_rison.png[/img][/URL]\r\n\r\n[color=Lightskyblue][b]Guérison[/b][/color]\r\n\r\n[b]Atouts Automatiques[/b]\r\n• [color=Lightskyblue][i]Guérison de (rang)[/i][/color] - Les sorts de (rang) consomment deux fois moins de magie.\r\n\r\n[b]Atouts de Spécialité[/b]\r\n• [color=Lightskyblue][i]Répit[/i][/color] - Les sorts de guérison redonnent également de la vigueur.\r\n• [color=Lightskyblue][i]Regain[/i][/color] - La magie se régénère 50 % plus vite.\r\n• [color=Lightskyblue][i]Absorption de protection[/i][/color] - Les sorts de protection rechargent votre magie quand vous êtes touchés. Absorbe 10% de la magie de tous les sorts qui vous touchent.\r\n• [color=Lightskyblue][i]Concentration[/i][/color] - La magie se regénère à son maximum, même en combat.\r\n• [color=Lightskyblue][i]Nécromage[/i][/color] - Tous les sorts sont plus efficaces contre les morts-vivants.\r\n• [color=Lightskyblue][i]Trompe-la-mort[/i][/color] - Une fois par jour, vous êtes automatiquement soigné si votre vie tombe sous les 10%.",
  "categoryId": "24",
  "version": "4.0",
  "author": "Raphou112",
  "createdUnix": "1357123780",
  "updatedUnix": "1381569499",
  "containsAdultContent": false,
  "uploadedBy": "raphou112",
  "primaryFile": null,
  "files": [
    {
      "fileId": "109047",
      "name": "Skyrim Perk Enhancements and Rebalanced Gameplay - FR",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7366",
      "fileName": "Skyrim Perk Enhancements and Rebalanced Gameplay - FR-29286-3-0.rar",
      "uploadedUnix": "1357124340",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/dbda8429c8336828d3a5a044c32111cc9bff558b420fd669fe61c773ccac7c70/analysis/1407333430/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Perk%20Enhancements%20and%20Rebalanced%20Gameplay%20-%20FR-29286-3-0.rar?fid=109047&ttl=1535803255&ri=8192&rs=8192&setec=a1795e3105c7c7dd198e5e913ce8fc45"
    },
    {
      "fileId": "1000025641",
      "name": "Atouts et Gameplay Ameliores",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2555",
      "fileName": "Atouts et Gameplay Ameliores-29286-3-0.7z",
      "uploadedUnix": "1366534219",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/d202f2516700cbd4dcda58f0ab12ea271cb99a5f1f0da09781883f40b81374f9/analysis/1407532452/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Atouts%20et%20Gameplay%20Ameliores-29286-3-0.7z?fid=1000025641&ttl=1535803255&ri=8192&rs=8192&setec=b3e59ed2dad936f55c7447ab9bd1e356"
    },
    {
      "fileId": "1000064697",
      "name": "Atouts et Gameplay Ameliores",
      "version": "4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3165",
      "fileName": "Atouts et Gameplay Ameliores-29286-4-0.7z",
      "uploadedUnix": "1381569499",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/8e2854d09b6087ba03022888432e71b0c9c450a368b3da4912d4acc692f6d0c4/analysis/1407753149/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Atouts%20et%20Gameplay%20Ameliores-29286-4-0.7z?fid=1000064697&ttl=1535803255&ri=8192&rs=8192&setec=06fa3187f883980073bf2a6bad947948"
    }
  ]
}