{
  "modId": 2928.0,
  "modName": "Black Hand Robes",
  "summary": "Adds Black Hand Robes as a reward for the Dark Brotherhood quest line completion",
  "descriptionHtml": "\r\n\r\n[img]http://s16.postimage.org/z3y108tdf/GSETr_T2.gif[/img]\r\n\r\n\r\nGuardian Stones Expanded, or GSE, adds 14 new Guardian Stones to the existing 3 available. They work and function exactly like the existing Thief, Warrior, and Mage stones, but all have a different variety of skills set to level 20% faster, mimicking class systems of previous Elder Scrolls games.\r\n\r\nAll the new guardian stones are along side the existing Thief, Warrior, and Mage stone at the same Guardian Stones location. Each stone will list a brief description of the class type, and it\\'s skill set. Also added are brief descriptions for the exists 3 stones. \r\n\r\nA list of the stones, their descriptions and skill sets are as follows.\r\n\r\n\r\n\r\n\r\n\r\n\r\n[size=15]Agent[/size]\r\n\r\n\r\nThose under the sign of the Agent are charming when they can be seen, and nearly invisible when in shadow.\r\n\r\nSneak, Illusion, Marksman, Speechcraft and Lockpicking skills increase 20% faster.\r\n\r\n\r\n[size=15]Archer[/size]\r\n\r\n\r\nThose under the sign of the Archer are marksman, adept at combat at great distances. Able to take down most foes before they have a chance to draw sword.\r\n\r\nSneak, Smithing, Marksman, One-Handed and Light Armor skills increase 20%% faster.\r\n\r\n\r\n[size=15]Assassin[/size]\r\n\r\n\r\nThose under the sign of the Assassin are nimble and quiet, they move in darkness to strike at the unsuspecting. Locks hold no doors shut for them.\r\n\r\nSneak, Alchemy, Marksman, One-Handed and Lockpicking skills increase 20%% faster.\r\n\r\n\r\n[size=15]Barbarian[/size]\r\n\r\n\r\nThose under the sign of the Barbarian are fearsome brutes who inspire fear and dread in the hearts of their enemies. Like a storm, swift and powerful. Finding little use for heavy armor, they rely on smashing their foes into the ground.\r\n\r\nOne-Handed, Two-Handed, Light Armor, Smithing and Block skills increase 20% faster.\r\n\r\n\r\n[size=15]Bard[/size]\r\n\r\n\r\nThose under the sign of the Bard are intelligent and personable, they prefer to accomplish tasks with their words first, and sword second.\r\n\r\nAlchemy, Light Armor, One-Handed, Block and Speechcraft skills increase 20% faster\r\n\r\n\r\n[size=15]Battlemage[/size]\r\n\r\n\r\nThose under the sign of the Battlemage are able to resolve most conflicts with either spell or sword. They are a deadly mix of scholar and soldier.\r\n\r\nDestruction, One-Handed, Two-Handed, Heavy Armor and Conjuration skills increase 20% faster\r\n\r\n\r\n[size=15]Crusader[/size]\r\n\r\n\r\nThose under the sign of the Crusader are combatants who wield the power of brute strength and restorative knowledge. Cheating death after every fight, they rely on their keen knowledge of restoration to fight yet again.\r\n\r\nOne-Handed, Two-Handed, Light Armor, Restoration and Destruction skills increase 20% faster\r\n\r\n\r\n[size=15]Healer[/size]\r\n\r\n\r\nThose under the sign of the Healer are fighters of poison and illness. The ancient art of restoration is their ally, and the deadly art of destruction is their weapon.\r\n\r\nAlchemy, Restoration, Alteration, Destruction and Speechcraft skills increase 20% faster.\r\n\r\n\r\n[size=15]Knight[/size]\r\n\r\n\r\nThose under the sign of the Knight are the The most noble of all combatants. Strong in body and in character.\r\n\r\nOne-Handed, Two-Handed, Heavy Armor, Speechcraft and Block skills increase 20% faster.\r\n\r\n\r\n[size=15]Nightblade[/size]\r\n\r\n\r\nThose under the sign of The Nightblade are with spells and shadow as their friends. By darkness they move with haste, casting magic to benefit their circumstances.\r\n\r\nSneak, Destruction, Restoration, Light Armor and One-Handed skills learn 20% faster.\r\n\r\n\r\n[size=15]Paladin[/size]\r\n\r\n\r\nThose under the sign of the Paladin are holy knights, paragons of virtue and adversaries of the undead.\r\n\r\nOne-Handed, Two-Handed, Heavy Armor, Restoration and Block skills increase 20% faster.\r\n\r\n\r\n[size=15]Sorcerer[/size]\r\n\r\n\r\nThose under the sign of the Sorcerer best the most well-equipped fighters, they rely on the spells of the mystic arts. Unique to these mages is the bodily stamina to be armed with the thickest armor.\r\n\r\nDestruction, Restoration, Illusion, Conjuration and Heavy Armor skills increase 20% faster.\r\n\r\n\r\n[size=15]Spellsword[/size]\r\n\r\n\r\nThose under the sign of the Spellsword are more nimble and athletic than the sorcerer, and better suited for spell-casting than the knight, their attacks are unpredictable. Students of combat and magic.\r\n\r\nOne-Handed, Block, Heavy Armor, Restoration and Destruction skills increase 20% faster\r\n\r\n\r\n[size=15]Witchhunter[/size]\r\n\r\n\r\n Those under the sign of the Witchhunter are swift on foot, and clever with spells, they use distance as their ally. Slower adversaries are fodder for their arrows.\r\n\r\nAlchemy, Light Armor, Marksman, Alteration and Illusion skills increase 20% faster.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nMost of the class inspiring for GSE came from Oblivion\\'s Classes, and I used http://www.uesp.net/wiki/Oblivion:Classes as a refrence during creation.\r\n\r\n\r\n\r\n\r\n_____________________\r\n\r\nChange Log\r\n\r\n_____________________\r\n\r\n\r\nV 1 - Original Upload.\r\n\r\n\r\n_____________________\r\n\r\nKnown Bugs or Conflicts\r\n\r\n_____________________\r\n\r\n\r\nNone so far.\r\n\r\n\r\n______________________\r\n\r\nMisc. Information.\r\n\r\n______________________\r\n\r\n\r\nPlease report all bugs found to be remedied. \r\n\r\n\t\r\nBefore commenting, please keep in mind that it\\'s impossible for this mod and this mod alone to break your game, corrupt your save or any other common misconceived complaint. Any information that may lead to crashes or changes in gameplay with this mod and suspected others is appreciated, and I\\'ll gladly make note or look into any possible conflicts.",
  "categoryId": "54",
  "version": "1.1",
  "author": "BartokTB",
  "createdUnix": "1323275157",
  "updatedUnix": "1323449748",
  "containsAdultContent": false,
  "uploadedBy": "BartokTB",
  "primaryFile": null,
  "files": [
    {
      "fileId": "8585",
      "name": "Black Hand Robes",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4852",
      "fileName": "Black Hand Robes-2928-1-1.zip",
      "uploadedUnix": "1323449548",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/973c8ccae106edc07f0edf22e01a530e4ada0a267ad11b05728e72658dddab6a/analysis/1406497569/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Hand%20Robes-2928-1-1.zip?fid=8585&ttl=1535757578&ri=8192&rs=8192&setec=f5390b6b1af63f90f09fb5b3d456410c"
    },
    {
      "fileId": "8586",
      "name": "Craftable Black Hand Robes",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Craftable Black Hand Robes-2928-1-1.zip",
      "uploadedUnix": "1323449632",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/174f691412cf2916b92708cdf7c8048c08fbc881a0b617e4c9f367db258f887f/analysis/1406497623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20Black%20Hand%20Robes-2928-1-1.zip?fid=8586&ttl=1535757578&ri=8192&rs=8192&setec=416c40eba740b7be54d2273ebffc3376"
    },
    {
      "fileId": "8587",
      "name": "Weaker Enchantment version with crafting",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Weaker Enchantment version with crafting-2928-1-1.zip",
      "uploadedUnix": "1323449671",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/43b96da48025277f1b96aeb0839af6bb85f30241c40bdc6491f397dcc3de064c/analysis/1406497623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weaker%20Enchantment%20version%20with%20crafting-2928-1-1.zip?fid=8587&ttl=1535757579&ri=8192&rs=8192&setec=7ad6b7eaccf944d8758f0d44affbaa83"
    },
    {
      "fileId": "8588",
      "name": "Weaker Enchantment version without crafting",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Weaker Enchantment version without crafting-2928.zip",
      "uploadedUnix": "1323449748",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e23941f23412a5f53e553c676c71b8abb82a649683e24a589660736188e560fc/analysis/1406497624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weaker%20Enchantment%20version%20without%20crafting-2928.zip?fid=8588&ttl=1535757579&ri=8192&rs=8192&setec=701db19ed55d2b9036fb90fea5579364"
    }
  ]
}