{
  "modId": 29326.0,
  "modName": "Trybesman",
  "summary": "A new playable race, that with a recharge spell you can transform into a tattooed version of your character. You will recieve a faster regeneration in health, stamina, and magic. Pus more unarmed stregnth.",
  "descriptionHtml": "PLEASE READ: Thank You, for viewing. And endorse even if you do not wish to use this character.\r\n\r\nESP. and Esm. used.\r\nDawnguard,\r\nDragonborn\r\nApachii Skyhair, and Apachii Human hair by Apahii\r\nBathing Beuty Luxury Suite. by Migal130\r\n65 Additional Warpaint by REGN ( however that Mod is no longer on here)\r\n\r\nAlso possible contains nudity, Must have Dawnguard, and Dragonborn. Dont know if you need the others or not, but Im sure you do, except the warpaint.\r\n\r\nThis will be a new race, that was sent down, to save Tamriel. He/ She will be normal at first like any other character, but with a Recharge spell, his health, stamina, and magic will regenerate faster, and he will have a stronger unarmed attack.\r\n\r\nPlus as a bonus, a cool tattoo texture, curtousy of xXBabydreXx, who i recomend for his Native tattoo texture, which is also on this site.\r\n\r\nFollowers added: Alayna and Lizzana are in the Sleeping Giant inn in Riverwood. Both have AI packages that let them stay where they are, when you dismiss them, and use stuff aswell. Alayna is a barbarian type, while Lizzana is a Ranger.\r\n\r\nThere are three presets for both Male and Female.\r\nChangelog:\r\n4.0\r\nScrewed up a couples things, but got it. The presets werent set for the recharge race, and had an overlay screw up with hair on the morphing. All fixed now.\r\n\r\n3.1\r\nAdded So the recharge can be playable, you will see Trybesman, and Trybesman Recharge in race menu. The recharge is tattooed.\r\n\r\n3.\r\nChanged the presets., added a book that is in Bromjunaar Sancuary, or the dragon priest mask location, if you don\\'t know the name. Also have My Alayna and Lizzana Characters in Sleeping Giant Inn. Alayna will be a Trybesman recharge, which she will not change but has the tattoo. Lizzana is an Imperial. Added more powerful lightning spells. Still are Sparks and Thunderbolt, just a powerful version, did not alter the original.\r\n\r\n2.5\r\nadded a better duration, 10 hours. For every 4 hours, of wait travel and sleep, 1 hour of depletion is taken for the duration. This is my default set up, as I want it to be just below 2 full days. Its best to use with a timescale of 4.\r\n\r\n2.\r\nFinally added a working file. Create your Trybesman Race, and use the power Dibellian Recharge to transform into a new warrior. Right now there is a small bug, in which the duration does not work with wait, sleep or fast travel. Working on that atm. However the duration is 36 hours, I will update an optional file if some would like a lower duration.\r\n\r\n 1.5\r\nOptional file added, making the tattoed version playable, with everything except the transformation spell.\r\n\r\nBUGS:\r\nThe timing is off so the best way is using a timescale of 4-6. Can\\'t seem to fix that.\r\n\r\nWhen using the scrolls, or going to jail, you will change back, and if you just recently recharged, powers can only be used once a day, sorry.\r\n\r\nAnd the annoying black skin, that the tattoo is not registering, see below for possible fixes.\r\n\r\n\r\nbut for now...\r\nYour normal character will have the love stone ability, which also instead of 15% its 35%.\r\nYour bonus skills are classified as...and Imperial race ability, which is finding more gold. \r\narchery 15\r\nsneak 10\r\none handed 15\r\ndestruction 10\r\nblock 10\r\nlight armor 5\r\nSmithing 25\r\n\r\nWith the recharge spell your character will achieve sparks, lightning bolt, and healing hand. With the tattoos to give off some type of armor, you will see a faster regeneration in health magic and stamina.\r\nDefault regeneration\r\nhealth 0.7\r\nMagicka 3\r\nStamina 5\r\n\r\nWith the recharge spell\r\nHealth 10.7\r\nMagicka 15\r\nStamina 20\r\n\r\nthis may not be for immersive players or who like hard challenges. But this is what i\\'m uploading, more for learning about game design, than actual playing.\r\n\r\nBugs: \r\nI have this sometimes, if your character comes up with black skin, its the tattoo not registering right.\r\nThe only fixes, is save your file,\r\nbring up consol, and type showracemenu.\r\npick a diff race, wait for it to load, then back to your race, BUT DO NOT create. Your skin should be back, then just hit start and LOAD your save.\r\n\r\nIf you still continue having the black skin, you might have to work at that, as well as quiting out entirely and reloading, or possibly even changing the plugin load order.\r\n\r\n\r\nThis Mod is almost similar to TheSkoomaKing\\'s  \\\"Demon Form\\\" mod.\r\n\r\nMajor credits go to xXBabydreXx for allowing me to use his tattoo texture. They are nice plus you can download them your self, Native Tattoos.\r\nAlso very big help from TheSkoomaKing, whom without his scripting, this would not be possible. Thankm you again, it was great working with you.\r\nGive credit to the authors or Apachii Sky hair, and Bathing Beuties Luxury Suite.\r\nApachii and Migal130 you do very awsome work.",
  "categoryId": "34",
  "version": "4.0",
  "author": "Jrew",
  "createdUnix": "1357170542",
  "updatedUnix": "1365825725",
  "containsAdultContent": true,
  "uploadedBy": "Jrew",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024039",
      "name": "Trybesman",
      "version": "3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "25",
      "fileName": "Trybesman-29326-3.rar",
      "uploadedUnix": "1365819850",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/9c1f56c46d776b8b8c7028744da1e9d32395d4e70f8227e66e0b810659fbec7c/analysis/1407518979/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Trybesman-29326-3.rar?fid=1000024039&ttl=1535803329&ri=8192&rs=8192&setec=c0ea5b2508d99f405f53b2cf90c2b480"
    },
    {
      "fileId": "1000024043",
      "name": "Trybesman Recharge Playable",
      "version": "3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "25",
      "fileName": "Trybesman Recharge Playable-29326-3-1.rar",
      "uploadedUnix": "1365820968",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/21d2e64a5fd5787ce174f90f6a670dac17fd0a046ac075c1516f25d2622ffee2/analysis/1407519132/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Trybesman%20Recharge%20Playable-29326-3-1.rar?fid=1000024043&ttl=1535803329&ri=8192&rs=8192&setec=388d32eee14eb14d0e38eb3cb605a09c"
    },
    {
      "fileId": "1000024063",
      "name": "Trybesman Recharge",
      "version": "4.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "25",
      "fileName": "Trybesman Recharge-29326-4-0.rar",
      "uploadedUnix": "1365825638",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/df1f057fd16a5b1534394439e9da53bf66f2b9a4f1fc62e9367e59aa59756c7b/analysis/1407519318/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Trybesman%20Recharge-29326-4-0.rar?fid=1000024063&ttl=1535803330&ri=8192&rs=8192&setec=7f9e0547e6d9007ffce5e369c54b44ff"
    },
    {
      "fileId": "1000024064",
      "name": "Trybesman",
      "version": "4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "Trybesman-29326-4-0.rar",
      "uploadedUnix": "1365825725",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/31ff171bb46407500d45e83a1f96a295f70cdb8784f6f05b15a7bb10e7c73c7f/analysis/1407519302/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Trybesman-29326-4-0.rar?fid=1000024064&ttl=1535803330&ri=8192&rs=8192&setec=e55dbff8fc3b3d26ac0035c280fb693d"
    }
  ]
}