{
  "modId": 29320.0,
  "modName": "Spectral Bound Weapons",
  "summary": "Adds 6 Expert level Bound Weapons and associated spell tomes.",
  "descriptionHtml": "I found that at higher levels, even my enhanced bound weapons don\\'t stack up against master crafted adn enchanted ones sooo...\r\n\r\nAdds 6 Expert level Bound Weapons and associated spell tomes.\r\n\r\nSpells are purchased from the usual Conjuration sellers. Details below:\r\n\r\nSpectral Weapon - Air\r\nOne-handed sword, enchanted with shock damage, absorb magika and chance to cause knockdown. Adds an enhanced Lightning Cloak to the user while equiped.\r\n\r\nSpectral Weapon - Fire\r\nTwo-handed sword, enchanted with fire damage, absorb health and Banish. Adds an enhanced Flame Cloak to the user while equiped.\r\n\r\nSpectral Weapon - Water\r\nOne-handed mace, enchanted with frost damage, slow and chance to paralyze. Adds an enhanced Frost Cloak to the user while equiped.\r\n\r\nSpectral Weapon - Earth\r\nTwo-handed staff (weapon not casting staff), enchanted with poison damage, absorb stamina and chance to paralyze. Adds an enhanced Poison Cloak to the user while equiped.\r\n\r\nSpectral Weapon - Spirit\r\nOne-handed dagger, enchanted with soul trap, slow, absorb health, stamina and magika. Adds Spectral Form (50% damage resistance and muffle) to the user while equiped.\r\n\r\nSpectral Weapon - Life\r\nOne-handed axe, enchanted with absorb health, stamina damage, fear and chance to paralyze. Adds Blood Cloak (40% weakening of enemy armour and damage) to the user while equiped.\r\n\r\n*** Updates ***\r\nv1.1 - fixed a bug that prevented the weapons summoning correctly if you had just the wrong combination of perks. Also tweeked the stats of the weapons themselves to better match fully tempered weapons.\r\nv1.2 - 5th weapon added. Minor bug fixes\r\nv1.3 - 6th weapon added. Changed hand effects for all weapons to better fit the element",
  "categoryId": "75",
  "version": "1.3",
  "author": "Aetherius",
  "createdUnix": "1357162811",
  "updatedUnix": "1357163067",
  "containsAdultContent": false,
  "uploadedBy": "warden01",
  "primaryFile": null,
  "files": [
    {
      "fileId": "109143",
      "name": "Spectral Bound Weapons",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27351",
      "fileName": "Spectral Bound Weapons-29320-1-3.rar",
      "uploadedUnix": "1357163067",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/e2ddb9c3111f2b94dc1db26373f23841ba3c94333c16ced311ac9535b1d8b207/analysis/1407334094/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spectral%20Bound%20Weapons-29320-1-3.rar?fid=109143&ttl=1535803324&ri=8192&rs=8192&setec=50dbdbbbbbc7b055293669690f5da019"
    }
  ]
}