{
  "modId": 29322.0,
  "modName": "Automatic Translator not only for strings _ translating is easy with excel",
  "summary": "This excel with translation dictionaries and macro speeds up a translation process, especially if there are a lot of texts to be translated. You can use it not only to translate mods for Skyrim, but but also any other texts.",
  "descriptionHtml": "This excel file is only for demo purposes for now, if I feel there is a need to make it bigger, I will. [b]But it is fully functional and I make my translations with it, [color=#ff88fb]any translations, in any language[/color][/b]. It speeds up the translation process, especially if there are a lot of texts to be translated. You can use it not only to translate mods for Skyrim, but also any other texts.\r\n\r\nIt is a tool, but it is also a [size=4]method[/size]. You can have some tool and translate any mod you want. But if you do not have a method, you will not go too far. With currently available tools one can easily translate a mod like \\\"Skyrim Unofficial Patch\\\", a method is not needed for doing this.\r\n\r\n-----------------------------------------------------------------------------------------------------\r\nNote\r\n[b]If you are translating mods, \r\nyou should really give [url=http://skyrim.nexusmods.com/mods/29148]Skyrim String Translator[/url] a try \r\n- I think it is the best complete tool.[/b]\r\n-----------------------------------------------------------------------------------------------------\r\n \r\nIn Elder Scrolls there is a limited space for names, I mean there are specific weapons, armors, cities, places, people, resources, (eg. Ebony things) - it is all common in many mods out there. Now let\\'s say we make a translation of a small mod which has 100 lines of dialogues, each line is different from those in Skyrim.strings, so you cannot use current tools to make automatic translation. Let\\'s say that in these 100 lines a name of \\\"Winterhold\\\" appears 7 times in different places, and let’s assume we are not sure how this word was translated in our language. I can imagine there are a lot possibilities to translate a word of \\\"Winterhold\\\" even in English into English: Winter Stronghold, Winterkeep? Snowy Stronghold? The Stronghold in a snow? Well, [b]if you do not have a dictionary that you can use to easily and automatically and quickly \\\"search and replace\\\" that kind of words, you will have to manually search for it each time you make a translation[/b], each time you will have to start from the beginning!\r\n\r\nBuilding a good dictionary takes some time and needs some experience. For the beginning: I do not recommend adding to the dictionary words nor sentences that have less than 5 characters. For instance: [b]all[/b] - this combination of characters A-L-L is very common, and you do not want to accidentally translate a word \\\"[b]actu[color=#ffff00]all[/color]y[/b]\\\" or \\\"[b]h[color=#ffff00]all[/color]s[/b]\\\" by using dictionary with a word \\\"all\\\". But if you want to add it to your dictionary in a statement and a combination with other words, like \\\"This is all for now\\\", then yes, it makes sense.\r\n\r\nBut, let\\'s take another example: some mod that changes perks. Perks often have a very similar description, for instance: \\\"(these weapons) do 40% more damage to the (someone)\\\" or \\\"(this armor) is more effective when also wearing a (something)\\\", and some of these perks also have 3-5 levels. Why to translate each of that lines manually and separately? You can put a \\\"more damage to the\\\" and \\\"is more effective when also wearing a\\\" to your dictionary and perform automatic translation. You can achieve it by using the spreadsheet and macro that I provide here, or by using a translator which has a similar function or option.\r\n\r\n\r\n~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=\r\nWhy it is needed? Because I haven\\'t found any translator that translates using \\\"search and replace\\\" inside translated texts. Why in Excel? Because it works on cells and they are easy to compare, check, format, see what is translated and what is not, apply filters and anything you want. Let me show you what I mean by that. There is a very simple example in the spreadsheet (download from the Download section).\r\n\r\n\r\n~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=\r\nExample plugin: modName\r\nSimple dictionary build only to translate a \\\"Winterhold\\\" (plus inflexion).\r\n\r\nHere is how it goes:\r\n\r\n[size=5]1.[/size] I use [url=http://skyrim.nexusmods.com/mods/25859]TES5Edit[/url] to make strings and string version of a plugin for Skyrim. Do not use the Translate option in TES5Edit.\r\n\r\n[size=5]2.[/size] Then I use [url=http://skyrim.nexusmods.com/mods/13024]StringsEdit[/url] to convert String files into XML. Open XML - I use Notepad++. Copy everything to excel.\r\nPic showing real life example (Live Another Life mod by Arthmoor):\r\n[url=http://skyrim.nexusmods.com/mods/images/29322-1-1357165300.png]http://skyrim.nexusmods.com/mods/images/29322-1-1357165300.png[/url]\r\nbut it is not our example for this article. I only wanted to show how it looks.\r\n\r\n[size=5]3.[/size] Copy it and paste into first column of \\\"WORK\\\" tab in excel. It has to be in single column A.\r\n\r\n[size=5]4.[/size] Then use \\\"Text to columns\\\" option from the Data menu. The basic idea is to separate String IDs from texts to be translated. After a while here is what I have:\r\n[url=http://skyrim.nexusmods.com/mods/images/29322-2-1357165300.png]http://skyrim.nexusmods.com/mods/images/29322-2-1357165300.png[/url]\r\n\r\n[size=5]5.[/size] Then copy the texts to column D.\r\n[url=http://skyrim.nexusmods.com/mods/images/29322-3-1357165301.png]http://skyrim.nexusmods.com/mods/images/29322-3-1357165301.png[/url]\r\n\r\n[size=5]6.[/size] Switch to the \\\"DIC\\\" tab - Dictionary:\r\n[url=http://skyrim.nexusmods.com/mods/images/29322-4-1357165301.png]http://skyrim.nexusmods.com/mods/images/29322-4-1357165301.png[/url]\r\n\r\nThis is a very tiny dictionary. Actually I have tons of texts here in English and translated into Polish. You can modify it, paste all texts from Skyrim.strings, it\\'s all up to you what you put here. But the are some rules:\r\n[list][*] translated texts must start from the second row\r\n[*] you can expand dictionary down, in columns A and B, but do not leave any empty cells.\r\n[*] you can expand dictionary to the right, but between two \\\"English\\\" columns there must be four columns, no more, no less. So English must start in A, then you can use F column (start in 2nd row), then in K... If you look in the file I provided, you should get the idea.[/list]\r\n\r\n[size=5]7.[/size] In column C there is a function for counting the characters in English texts on the left. After making a dictionary, I count the chars in each cell, then I use \\\"sort Z-A\\\":\r\n[url=http://skyrim.nexusmods.com/mods/images/29322-5-1357165302.png]http://skyrim.nexusmods.com/mods/images/29322-5-1357165302.png[/url]\r\n\r\nBy doing this I have the longest texts on the top. The Translation function will \\\"search and replace\\\" from top to the bottom (and then it will go to column F), and it will try to find FIRST exact mach. So if in the DIC the order looks like this:\r\n[list][*](English - Polish)\r\n[*][b]Winterhold - Zimowa Twierdza[/b]\r\n[*][b]College of Winterhold - Akademia w Zimowej Twierdzy[/b][/list]\r\nit can lead to a wrong (or unwanted) translation, eg. text to be translated: \r\n[list][*][b][color=#ffff00]\\\"College of Winterhold is a great place.\\\"[/color][/b][/list]\r\ntranslator will take first that matches, and will do it like this: \r\n[list][*][b]\\\"College of [color=#ffff00]Zimowa Twierdza[/color] is a great place.\\\"[/b][/list]\r\nwhich is not correct in Polish and only make additional problems, \r\nthe DIC should be like this:\r\n[list][*](English - Polish)\r\n[*][b]College of Winterhold - Akademia w Zimowej Twierdzy[/b]\r\n[*][b]Winterhold - Zimowa Twierdza[/b][/list]\r\nand the translation will be correct:\r\n[list][*][b]\\\"[color=#ffff00]Akademia w Zimowej Twierdzy[/color] is a great place.\\\"[/b][/list]\r\n\r\n\r\n[size=5]8.[/size] OK, run the [b]\\\"PerformTranslation\\\"[/b] macro. In old excel the \\\"macro menu\\\" option is in the Tools menu (sorry, I do not want to add any special buttons here in this spreadsheet to run the macro).\r\n[url=http://skyrim.nexusmods.com/mods/images/29322-1-1357165340.png]http://skyrim.nexusmods.com/mods/images/29322-1-1357165340.png[/url]\r\n\r\nThe macro will search in DIC tab and replace in column D of WORK tab, but also it will mark changed cells with blue and bold format.\r\n[url=http://skyrim.nexusmods.com/mods/images/29322-2-1357165340.png]http://skyrim.nexusmods.com/mods/images/29322-2-1357165340.png[/url]\r\n\r\nYou can see that only [i]\\\"My flower is beautiful.\\\"[/i] was not changed.\r\n\r\n[list][*]In column E there is a function that will put together \\\"string ID\\\" + \\\"text\\\" + \\\"string end\\\" tag\r\n[*]In column F there is a function that will compare C and D columns and give True or False as a result.\r\n[*]You can use the READY tab to move there the \\\"translated\\\" rows from the \\\"WORK\\\" tab.[/list]\r\n\r\n[size=5]9.[/size] Copy from column E and paste back into XML file. Open StringsEdit and convert XML back to a string file, and you are ready to go.\r\n\r\n\r\n~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=\r\nFor me it speeds up a process of translation (not only of mods). The only problem is with book texts from mods, they require some more attention to spread the texts and then put it all together at the end.\r\n\r\nI hope some tool will allow to use that kind of automatic \\\"search & replace\\\" function, and not only for whole sentences or manually, but also automatic. [url=http://skyrim.nexusmods.com/mods/29148]SkyrimStringTranslator[/url] by McGuffin allows to use custom dictionaries, and this is really great for me, but in version 0.13 it is possible to search for a text or phrase in whole dictionaries only manually - and then manually put it as a translated text (ie. you can open edit window and use search field, it will perform searching in loaded dictionaries). But there is also a very good option / [b]method[/b]: heuristic translation and validate translation. If you use heurictic, use validate too. Then Perform \\\"Save User Cache\\\" and heuristic translation again - it will use validated translations and more and more texts will be translated correctly. It is a very nice combo.\r\n\r\n\r\n~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=~=\r\nPlease note I am releasing it \\\"as is\\\"\r\nuse it at your own risk.",
  "categoryId": "39",
  "version": "0.9",
  "author": "TomBrightblade",
  "createdUnix": "1357165189",
  "updatedUnix": "1357171986",
  "containsAdultContent": false,
  "uploadedBy": "TomBrightblade",
  "primaryFile": null,
  "files": [
    {
      "fileId": "109173",
      "name": "translator in excel",
      "version": "0.90",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "translator in excel-29322-0-90.zip",
      "uploadedUnix": "1357171986",
      "modVersion": "0.90",
      "virusScanUrl": "https://www.virustotal.com/file/b7aae369c57cda054a2248eec4d7bc51bdd1a35266a72d55a57c70def6eae26c/analysis/1407334204/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/translator%20in%20excel-29322-0-90.zip?fid=109173&ttl=1535803326&ri=8192&rs=8192&setec=4414bbca9b960b8e8e7499fdb9fb4b3a"
    }
  ]
}