{
  "modId": 29340.0,
  "modName": "Aeriana-level one playable character save-game",
  "summary": "Aeriana is a level one character save outside riverwood (skips helgen entirely). Probably my fav. girl I have made so far, pretty but not without character. Inventory is just how I had it on an original file I use now to make characters- it has most of what I could carry from Helgen and things I picked up on the way to Riverwood.",
  "descriptionHtml": "Aeriana is a level one character (Breton not Nord like my other girls) save outside riverwood (skips helgen entirely).Probably my fav. girl I have made so far, pretty but not without character . Inventory is just how I had it on an original file I use now to make characters- it has most of what I could carry from Helgen and things I picked up on the way to Riverwood.\r\n\r\nFeel free to make any changes to her! For instance if you don\\'t like the scar all you have to do is load the save, go into a small cell like the riverwood trader to prevent freezing, pull up your console using \\\" ~ \\\" (the tilde mark), and type in \\'showracemenu\\' (no quotes) . This command will bring up the character creation menu and you can change anything about your character from there! \r\n\r\nIn order for her to appear as in the screenshots you will need the following mods: \r\n*They are listed in the order in which I installed them via NMM\r\n\r\nApachiiSkyHair by Apachii v 1.5 full\r\nhttp://skyrim.nexusmods.com/mods/10168\r\n\r\nUNP Replacer Configuration Package by sillumlt- the options I used were the UNP base body with the navetsea skin and fitness body less abs & shaved \r\nhttp://skyrim.nexusmods.com/mods/20884\r\n\r\nUNP BLESSED BODY UNPB - With Optional BBP Breast Physics by calyps - xp32 - mrtroublemaker -dimon99 original creator of UNP- v2-2x fixed\r\nhttp://skyrim.nexusmods.com/mods/14899\r\nI installed this on top of the UNP congfig after trying several BBP options because I like the effect this process renders- feel free to do it your own way\r\n\r\nThe Eyes Of Beauty by Gabriel Mailhot\r\nhttp://skyrim.nexusmods.com/mods/13722\r\n\r\nNo More Blocky Faces by Xenius\r\nhttp://skyrim.nexusmods.com/mods/30\r\n\r\nLiFE - Lith Face Enhancement -CBBE-UNP-UNPB by LithiumFlower- install last, overwrite if necessary, I love this skin! \r\nhttp://skyrim.nexusmods.com/mods/26354\r\n\r\nBetter Females by Bella - Eyebrows only option found under misc files\r\nhttp://skyrim.nexusmods.com/mods/2812#content\r\n\r\nAll credits go to the above mod authors- Thanks!\r\n\r\nInstallation:\r\nExtract file using 7zip or related program, place the .ess file in your save game folder (usually found in documents/my games/skyrim/saves) ***You may download with the manager and open the NMM folder for mods if it is easier for you but NMM WILL NOT INSTALL THE SAVE FOR YOU. You must place the save yourself into your save game folder, I promise it isn\\'t hard!\r\n\r\n\r\n*please note that I am using Skyrim HD texture lite mod in the screenshots (an amazing mod!)\r\nhttp://skyrim.nexusmods.com/mods/607\r\nand Boris\\' enb kage version \r\nhttp://www.enbdev.com/mod_tesskyrim_v0112.htm\r\n with\r\n stakado vers B cinematic enb settings (http://skyrim.nexusmods.com/mods/12180)\r\n\r\nThe armor pictured is from asianboy345\\'s Remodeled Armors for UNP (my fav armor replacer!)\r\nhttp://skyrim.nexusmods.com/mods/19772",
  "categoryId": "43",
  "version": "1",
  "author": "tbowers",
  "createdUnix": "1357191339",
  "updatedUnix": "1357191490",
  "containsAdultContent": true,
  "uploadedBy": "tbowers1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "109237",
      "name": "Aerianna- Level 1 Save",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1176",
      "fileName": "Aerianna- Level 1 Save-29340-1.7z",
      "uploadedUnix": "1357191490",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/87847e961a1892fa2314aed0d54a5aa80f062fd9f91a7c3a415b2e03cafea4e6/analysis/1407334629/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aerianna-%20Level%201%20Save-29340-1.7z?fid=109237&ttl=1535803362&ri=8192&rs=8192&setec=5e17c608aba60d71234a833c9034e5ee"
    }
  ]
}