{
  "modId": 29393.0,
  "modName": "Chillrend Set",
  "summary": "Chillrend set is an armor with similar enchantements from the original chillrend sword. The chillrend sword now has is own unique armor with it.",
  "descriptionHtml": "hello there im looking for modders that can help me finish my mod. so far only the values and stats are done. now i need someone that is good with textures , good enough to put the same ice mist effect from the chillrend sword to my my armor and make the armor upgradable. right now you can download this mod if you like but its simply a glass armor with the enchanted only. for the modders that are willing to volunteer post a comment or send me a message so that i can give you the details what to do exactly. when it will be done we will let players fully test this armor set.\r\n\r\n//RIGHT NOW THE ARMOR CAN BE FOUND IN THE CHEST IN THE BACK OF THE WARMAIDENS IN WHITERUN//\r\n\r\nif alot of people loves this mod we can go a little further with it. we can make quests. like actually try to find each items in different places. well for now this is all i can think of for what we can do with the mod. if you all have ideas we can talk on a chat or something we can discuss your ideas. i hope everyone would like to see this mod happend. \r\n\r\nThank You For Visiting\r\n",
  "categoryId": "54",
  "version": "0.3",
  "author": "Skycreate",
  "createdUnix": "1357267958",
  "updatedUnix": "1357780542",
  "containsAdultContent": false,
  "uploadedBy": "skycreate",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001302",
      "name": "Chillrend Set",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Chillrend Set-29393-0-3.rar",
      "uploadedUnix": "1357780542",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/db9f91e442477531dab61342b2a5567a14834fd6788838d196ff05f7fb86bf03/analysis/1407345902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chillrend%20Set-29393-0-3.rar?fid=1000001302&ttl=1535803470&ri=8192&rs=8192&setec=58dd9e67b23ae3627caf03b8a0ce8f4a"
    }
  ]
}