{
  "modId": 29392.0,
  "modName": "Real Damascus Steel Armor and Weapons",
  "summary": "Heavy and light armor mod for every body type\r\nfor males and females,\r\nit includes also one shield and one long sword.",
  "descriptionHtml": "Welcome again to my new mod\r\nand sorry for my bad english if i make any spelling mistakes\r\n\r\nPlease read the instructions carefuly\r\n\r\nThis is a heavy and light armor mod for every body type\r\nfor males and females,\r\nit includes also one shield and one long sword.\r\n\r\n\r\n\r\nThe material of this armor is the legendary Damascus Steel from the middle and ancient ages.\r\nThat was the hardest steel made of many hamered steel layers and other materials,\r\nbut the real recipe was always a big secret\r\nand is lost and forgoten now.\r\nToday nobody really knows how did they made this kind of steel in the past.\r\n\r\nBut now that´s enough with the science :-)\r\nLets talk about this mod\r\n\r\nAt first you need Damascus steel ingots\r\nto produce them in the smelter you need normal steel ingots and iron ingots.\r\n\r\nyou must have the ebony smithing perk for the heavy version\r\nand the dragon smithing perk for the light version\r\n\r\nif you don´t have one of this smithing perks\r\nthen the armor will not going to be visible on the smithing menu.\r\n\r\nThe rating of the heavy version is a little bit better then the ebony armor\r\nand the light version a litle bit better then the dragonscale\r\n\r\nYou can install manually or with NMM\r\n\r\nThis Armor is not a replacer \r\nit´s a stand alone mod\r\n\r\nEnjoy the mod and\r\nPLEASE PLEASE endorse if you like it\r\n\r\nand post your own pictures\r\n\r\n\r\nthanks to:\r\n\r\nBethesda for this great game\r\n\r\n\r\nAbout Damascus Steel\r\n_______________________\r\nWikipedia says:\r\nDamascus steel was a type of steel used in Middle Eastern swordmaking. Damascus steel was created from wootz steel, a steel developed in India around 300 BC, which was further refined by Middle Eastern swordsmiths.[1] These swords are characterized by distinctive patterns of banding and mottling reminiscent of flowing water. Such blades were reputed to be not only tough and resistant to shattering, but capable of being honed to a sharp and resilient edge.[2]\r\n\r\nThe original method of producing Damascus steel is not known. Because of differences in raw materials and manufacturing techniques, modern attempts to duplicate the metal have not been entirely successful. Despite this, several individuals in modern times have claimed that they have rediscovered the methods in which the original Damascus steel was produced.[3][4]\r\n\r\nThe reputation and history of Damascus steel has given rise to many legends, such as the ability to cut through a rifle barrel or to cut a hair falling across the blade,[5] but no evidence exists to support such claims. A research team in Germany published a report in 2006 revealing nanowires and carbon nanotubes in a blade forged from Damascus steel.[6] This finding was covered by National Geographic[7] and the New York Times.[8] Although modern steel outperforms these swords, microscopic chemical reactions in the production process may have made the blades extraordinary for their time. Woody biomass and leaves are known to have been used to carbonize the Wootz ingots used in Damascus steel, and research now shows that carbon nanotubes can be derived from plant fibers,[9] suggesting how the nanotubes were formed in the steel. Some experts expect to discover such nanotubes in more relics as they are analyzed more closely. ",
  "categoryId": "54",
  "version": "1.0",
  "author": "ILIAS",
  "createdUnix": "1357267607",
  "updatedUnix": "1357268310",
  "containsAdultContent": false,
  "uploadedBy": "saili",
  "primaryFile": null,
  "files": [
    {
      "fileId": "109427",
      "name": "Real Damascus Steel Armor and Weapons",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "44338",
      "fileName": "Real Damascus Steel Armor and Weapons-29392-1-0.zip",
      "uploadedUnix": "1357268310",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5dda8371f0d9b303c3e5b3cdba2842a084fffd8c201d6e6e01bc1f7ffdfcf9fe/analysis/1407335837/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Real%20Damascus%20Steel%20Armor%20and%20Weapons-29392-1-0.zip?fid=109427&ttl=1535803468&ri=8192&rs=8192&setec=f78c17a16e06036f8915326c82f6185b"
    }
  ]
}