{
  "modId": 29417.0,
  "modName": "Rivercrag Overlook",
  "summary": "A Lore-friendly little fort just out the back of bleak falls barrow, complete with mine and current occupants that need evicting :D",
  "descriptionHtml": "This mod adds a small fort southwest of riverwood, where you exit Bleak Falls Barrow after fetching the dragonstone for Farengar.\r\n\r\nI like a lore friendly playthough of skyrim, but i couldn\\'t find a rough and ready house mod that was suitable for the rugged characters I like to play. I also wanted somewhere i could gather my followers (using the the \\'my home is your home\\' mod- I advise getting that too). So, i decided to have a foray into the technical side of modding and make my own house. there\\'s everything you need for forging steel armour, but not just lying around- that\\'s what the mine\\'s for! the fort\\'s current inhabitants are levelled, so evicting them should be fun at pretty much any level, and the mead hall is cosy and well stocked.\r\n\r\nThis mod requires an up to date version of skyrim or apparently it will not appear. it does not require dawnguard, hearthfire, or any mods to run, although certain  mods will enhance it.\r\n\r\nthis is the first mod i\\'ve shared, and i don\\'t mind having some constructive criticism sent my way ( that reminds me, don\\'t go in the chicken coop, just wait for them to respawn and consider it purely aesthetical)\r\n\r\nKnown Bugs:\r\n-The bandits defy logic and respawn even though i asked them nicely not to.\r\n-There are a few items that will be marked with the \\'steal\\' option, not \\'take\\'\r\n-Oh god the chicken shed\r\n-The weapon racks may be unwilling to yield any weapons you put on them (temporary fix: use TCL and retreive your weapon from behind, if it\\'s an emergency/rare wep you want back)\r\n\r\nPlanned updates (besides bugfixes)\r\n-extending the mine and adding a bandit boss\r\n-adding many more idle markers/updating navmesh\r\n-adding a basement to the mead hall\r\n-Adding a mini-quest to remove the boss and gain a follower or two\r\n\r\nhope you guys enjoy it, if you did, please endorse!",
  "categoryId": "67",
  "version": "1.0",
  "author": "Spamhammer",
  "createdUnix": "1357321181",
  "updatedUnix": "1357321312",
  "containsAdultContent": false,
  "uploadedBy": "spamhammer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "109522",
      "name": "RiverCragOverlookV1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "240",
      "fileName": "RiverCragOverlookV1-29417-1-0.rar",
      "uploadedUnix": "1357321312",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d1baef6036239322be88b9cef9e6012528376d3556731d84debb71bef80f0a45/analysis/1407336619/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RiverCragOverlookV1-29417-1-0.rar?fid=109522&ttl=1535803510&ri=8192&rs=8192&setec=ea606964da2363d4c05f5755e2951d43"
    }
  ]
}