{
  "modId": 29442.0,
  "modName": "Archery Perks - Quick Shot and Power Shot Switched",
  "summary": "Switches Quick Shot and Power Shot in perk progression order, for those who don\\'t want to overpower Archery with Power Shot, but DO want fast firing with Quick Shot.",
  "descriptionHtml": "This mod switches Quick Shot and Power Shot in perk progression order.\r\n\r\nIt came about because every time I take Power Shot, archery becomes boring. I use fast bows like the Nord Hero Bow and Zephyr, and I can get two or three shots in before the enemy even gets moving again... then, take Quick Shot on top of that (which, without this mod, requires that you take Power Shot first), and it\\'s like shooting slaughterfish in a barrel.\r\n\r\nThis mod puts Quick Shot first, so that you can become a veritable human machine gun and still use your skill; you can try all those awesome leading shots, and you can watch enemies barrel over parapets because they actually have some freakin\\' momentum, and they\\'re not just staggering and falling over every couple seconds.\r\n\r\nI may release a version which also gimps Power Shot (something like 20% stagger chance, instead of 50%?) for those who like the idea of this mod, but still want to take the left path to Bullseye. Personally, I don\\'t ever take Bullseye, because I provide my own paralysis poison (and anyway, I take the righthand route in order to get Ranger, speed freak as I apparently am). So if there\\'s enough demand... even one person... let me know and I\\'ll release a version with Power Shot gimped.\r\n\r\nCOMPATIBILITY: Any mod which changes the Archery perk tree will conflict with this one. If you\\'re a developer on an larger Archery overhaul, though, feel free to include this idea, as it\\'s super easy to implement.",
  "categoryId": "73",
  "version": "1.0",
  "author": "rcavanah",
  "createdUnix": "1357350869",
  "updatedUnix": "1357350949",
  "containsAdultContent": false,
  "uploadedBy": "rcavanah",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000014",
      "name": "Archery Perks - Quick Shot and Power Shot Switched",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Archery Perks - Quick Shot and Power Shot Switched-29442-1-0.zip",
      "uploadedUnix": "1357350949",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a5d1536af42ea9e146329e0fb7469334545d207dc28c4c5acd54e1e7fed00f9c/analysis/1407337343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Archery%20Perks%20-%20Quick%20Shot%20and%20Power%20Shot%20Switched-29442-1-0.zip?fid=1000000014&ttl=1535803547&ri=8192&rs=8192&setec=0e19dc4fe437a843a476278156ab89d0"
    }
  ]
}