{
  "modId": 29455.0,
  "modName": "Billy and Mandy",
  "summary": "Summon an angry little girl or an annoying little boy to aid you in battle.\r\nTheir tomes can be found under the bridge  inside of Whiterun at the front gate",
  "descriptionHtml": "Billy and Mandy were two regular friends with a sick pet skeever named Barf. One day Barf grew very ill and as he laid dying Billy and Mandy prayed to the gods to save him. A dremora heard their pleas and promised he could help the skeever and be their servant if the two of them could beat him at a game of their choosing but, if he won he would get all three of their souls. The two friends choose limbo. The game was over as soon as it begun. The dramora tripped and hit the pole losing to two kids at his best game. As promised he saved the skeever and became their servant. In time he befriended the kids then tricked the two into trading their freedom for immense power, and so became the two spell tomes found under the bridge at the front gate in Whiterun. \r\n\r\nThe two come equip with a frost and flame spell, protection spell, and the ability to summon each other again and again... ",
  "categoryId": "75",
  "version": "",
  "author": "Sam B",
  "createdUnix": "1357370624",
  "updatedUnix": "1357370733",
  "containsAdultContent": false,
  "uploadedBy": "MrCrzy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000071",
      "name": "Billy and Mandy",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Billy and Mandy-29455-.7z",
      "uploadedUnix": "1357370733",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/98318d266fb1198abcb09be315d80a371cd2033495c9b7e6184bb262d845b277/analysis/1407337863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Billy%20and%20Mandy-29455-.7z?fid=1000000071&ttl=1535803577&ri=8192&rs=8192&setec=8f05116623003cc2977ca05799e067ee"
    }
  ]
}