{
  "modId": 29453.0,
  "modName": "Hand to Hand - A True Unarmed Combat Skill",
  "summary": "This mod adds a new skill to the game, Unarmed. It has its own perk tree and levels the character as would any other skill. SKSE Required.",
  "descriptionHtml": "SKSE Required - http://skse.silverlock.org/\r\n\r\nIf you are familiar with my mod Unhindered, this works somewhat similarly to the compatibility version. Merely by hitting people while Unarmed, you will gain experience towards the next rank equal to what it would be in One-Handed. The formula for how much experience is required per level is also the same as One-Handed.\r\nThe formula for unarmed damage is (((0.3 * Skill rank) + Gauntlet Base Armor Rating +Bonuses to Unarmed Damage from Enchantments) * (0.20 * Pugilism Rank)) + Weapon Enchantments . Khajiit and Argonians no longer have a racial advantage in Unarmed outside of the Khajiit\\'s 10 rank initial bonus to the Unarmed skill. Note that I in no way edited the races, this is still 100% compatible with race altering mods.\r\n\r\nKhajiit do however begin with a rank of 25 in Unarmed, The other \\'warrior\\' races (Redguard, Orc, Imperial, Nord) have a starting rank of 20. All other races begin at 15.\r\n\r\nHERE IS A VERY IMPORTANT NOTE: You will get at the beginning of the game or when you load the mod 300 copies of a weightless weapon called Unarmed. (You can store some copies for later use in a chest somewhere, or keep them on you) Many perks simply cannot work properly unless you have this weapon equipped, including the one allowing you to gain experience in Hand to Hand. This is due to a weakness of the game engine, wherein truly Unarmed strikes do not trigger various scripted events and perks as normal weapons do. For this reason I have made Unarmed, an invisible weightless weapon that uses your Unarmed damage as its damage and in no way alters the appearance of your fists.\r\n\r\nIf you do not get your copies of this weapon, type:\r\n-help unarmed\r\ninto the console. It will bring up one weapon form, should be something ending in 1899. Now type in\r\nplayer.additem TheFormNumberEndingIn1899 X\r\nwhere x is the number of copies you want.\r\n\r\nThe other HUGE advantage of having these is that your fists are now perfectly enchantable. Also, you can add it to your quick items list making it easier to switch to Unarmed combat.\r\n\r\nBy using a 0 mana spell you will start the game with called Check Unarmed Stats, you can do just that and it will tell you your current rank and how far you are towards your next rank.\r\n\r\nThere is also a spell that summons a big ball of light that if talked to will grant you perks (should you have perk points to spend, otherwise the spell does nothing) according to the following tree:\r\n\r\n\r\nPugilist: 5 ranks, each granting a 20% bonus to unarmed damage leads to the following two perks\r\n(Skill rank 15, 20, 40, 60, 80 required)\r\nBrawler - Unarmed power attacks deal 25% more damage per rank (2 ranks) (Skill Rank 30, 50 required)\r\nPressure Points - Unarmed attacks ignore 20% of armor per rank (2 ranks)  (Skill Rank 30, 50 required)\r\n\r\nBrawler leads to Float Like A Butterfly - 3 ranks of 20% reduction in Unarmed power attack stamina cost (Skill Rank 45, 65, 75 required)\r\nButterfly leads to:\r\nParalyzing Palm: Unarmed Power attacks have a 10% chance of paralyzing the target for 5 seconds (Skill Rank 80 required)\r\nImmobilize - Unarmed Power attacks have a 30% chance of slowing targets down by 35% for 5 seconds (Skill Rank 80 required)\r\nInternal Wounds: Unarmed Power attacks cause 3 damage/sec for 6 seconds (Skill Rank 80 required)\r\n\r\nPressure Points lead to:\r\nSting Like a Bee - Unarmed strikes have a 1% chance to kill per rank a target under 50% health (3 ranks) Skill Rank 45, 65, 75 required\r\nwhich leads to:\r\nTake the Wind: Unarmed strikes deal 20 stamina damage\r\nConcuss: Unarmed strikes deal 20 magicka damage at skill rank 80\r\nDisarming Strike: Unarmed strikes have a 5% chance of disarming the target at rank 80\r\n\r\nOh yeah, and your gauntlets armor rating is automatically added onto your unarmed damage. It is the base value and does not include your armor skill bonus or smithing bonuses. (That is possible, but would be extremely unbalanced.)\r\n\r\nI recommend the version without Claws if you play Khajiit, as Claws upsets the delicate numerical balancing act I\\'ve done with this mod. However, it is possible that it would be incompatible with another mod (although EXTREMELY unlikely, as Claws is a rarely edited thing) so I\\'ve made the other version available. Also for people who like easy gameplay, or are using mods that make the game significantly harder to the point of requiring a bit more oomph behind their punches.\r\n\r\nCHANGELOG:\r\n\r\nBase Unarmed damage is now equal to .30 * Unarmed Rank, racial features are ignored. This means that Khajiit\\'s only advantage in Unarmed is their high starting rank, similar to other skills. It also means damage is MUCH more balanced.\r\nAt 20 skill rank you are dealing six damage without gauntlets, and about 16 with iron gauntlets. This is reasonably high damage for beginning of the game.\r\nHowever, while with Dragonbone daggers, full one handed skill and appropriate perks and smithing you will stack up about 88 DPS, with unarmed at 100 and full Pugilist ranks and daedric gauntlets you will be at 96. This makes the slightly stronger to compensate for a) the lack of enchantability and b) the only enchantment that adds to your Unarmed Damage is a linear adjustment rather than a % increase.\r\n\r\nExperience now scales with your current base Unarmed damage, just as One Handed scales with your weapon\\'s base damage rather than total damage. This should make leveling take longer than it has in previous versions, which is a good thing I think. It was pretty easy to level Unarmed in previous versions.\r\n\r\nThe perk ball which wasn\\'t showing up for long enough for many users should finally stick around long enough to use it. Let me know if there are still issues.\r\n\r\nAlso, I got rid of the brawl bug.\r\n\r\nThere is one VERY significant change, the Unarmed weapon was added. Details above.\r\n\r\nSmall change - You gain the appropriate amount of experience towards your next character level with each rank gained of Unarmed. Well, at least very close to it. You see, you gain the amount of experience towards a character level equal to the gained rank of the skill. Unfortunately, as Unarmed is a simulated skill, I can\\'t very well have it do that as there are no script functions for adding level experience. So, I did a very close estimate instead. Now if you gain your 100th rank of Unarmed and you only have 20 ranks of One-Handed, instead of gaining 1 rank of One-Handed before the reset back to 20, you\\'ll gain 5 ranks. This means you\\'ll get 100 character experience just as if you had gained the 100th rank of a real skill. While this is slightly inexact, it mathematically averages out over the course of your full progression to be almost exactly the amount of experience you would have gained if it were a real skill. (Sigma 15-->100 for you math nerds)\r\n\r\nI\\'ve added a new perk that you get automatically, that increases your sneak attack multiplier by a power of two (just like Backstab) but you only get the bonus if you take the perk backstab. I did it this way to prevent conflicts with other mods that edit perks.\r\n\r\nI also (finally, I think) fixed the perk ball so it goes away and stays when it is supposed to.\r\n\r\n",
  "categoryId": "73",
  "version": "v1.7x",
  "author": "Alex Ducey",
  "createdUnix": "1357359869",
  "updatedUnix": "1358034736",
  "containsAdultContent": false,
  "uploadedBy": "atducey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000060",
      "name": "Hand to Hand - True Unarmed Skill",
      "version": "v1.0c",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "456",
      "fileName": "Hand to Hand - True Unarmed Skill-29453-v1-0c.rar",
      "uploadedUnix": "1357359966",
      "modVersion": "v1.0c",
      "virusScanUrl": "https://www.virustotal.com/file/858e4c5a7192815da38c5a9b5723044261486c66e3976e1473a0631f91552ab0/analysis/1407337700/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hand%20to%20Hand%20-%20True%20Unarmed%20Skill-29453-v1-0c.rar?fid=1000000060&ttl=1535803571&ri=8192&rs=8192&setec=ee669e2cd328085558bbe7269068e144"
    },
    {
      "fileId": "1000000269",
      "name": "Hand to Hand - fix with Khajiit Claws ability",
      "version": "v1.2c",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "457",
      "fileName": "Hand to Hand - fix with Khajiit Claws ability-29453-v1-2c.rar",
      "uploadedUnix": "1357424397",
      "modVersion": "v1.2c",
      "virusScanUrl": "https://www.virustotal.com/file/74bb5bb64439f041c423955484cb36f6136e1f550e7a768809be7e84d94f3588/analysis/1407339071/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hand%20to%20Hand%20-%20fix%20with%20Khajiit%20Claws%20ability-29453-v1-2c.rar?fid=1000000269&ttl=1535803572&ri=8192&rs=8192&setec=7dcf148e071edfb1b534c3080756238c"
    },
    {
      "fileId": "1000000276",
      "name": "Hand to Hand - fix without Khajiit Claws ability",
      "version": "v1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "460",
      "fileName": "Hand to Hand - fix without Khajiit Claws ability-29453-v1-2.rar",
      "uploadedUnix": "1357424822",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/ec8f20a748a0e0495d4c7397ae17da881fceda71e40fca70267dc017a20fdbf2/analysis/1407339132/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hand%20to%20Hand%20-%20fix%20without%20Khajiit%20Claws%20ability-29453-v1-2.rar?fid=1000000276&ttl=1535803572&ri=8192&rs=8192&setec=a2f67612f9c4fb67740e4157157bfb91"
    },
    {
      "fileId": "1000000351",
      "name": "Hand to Hand - Perk Fix",
      "version": "v1.4x",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "461",
      "fileName": "Hand to Hand - Perk Fix-29453-v1-4x.rar",
      "uploadedUnix": "1357448534",
      "modVersion": "v1.4x",
      "virusScanUrl": "https://www.virustotal.com/file/15de4093a672cbe622214127fe60029124dd23697dcb6d1d3addd501026a9cf6/analysis/1407339603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hand%20to%20Hand%20-%20Perk%20Fix-29453-v1-4x.rar?fid=1000000351&ttl=1535803573&ri=8192&rs=8192&setec=5702626c731f7c59fea3e65628be3b63"
    },
    {
      "fileId": "1000000370",
      "name": "Hand to Hand - Leveling Fix",
      "version": "v1.5x",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "461",
      "fileName": "Hand to Hand - Leveling Fix-29453-v1-5x.rar",
      "uploadedUnix": "1357451627",
      "modVersion": "v1.5x",
      "virusScanUrl": "https://www.virustotal.com/file/9ede594b86ba28180d621da406ffbce2daccfbc2447ca187231c2899094809d5/analysis/1407339666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hand%20to%20Hand%20-%20Leveling%20Fix-29453-v1-5x.rar?fid=1000000370&ttl=1535803573&ri=8192&rs=8192&setec=77590ba9d29ba58b08866c2d889974d7"
    },
    {
      "fileId": "1000000429",
      "name": "Hand to Hand - Necksnap",
      "version": "v1.6x",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "461",
      "fileName": "Hand to Hand - Necksnap-29453-v1-6x.rar",
      "uploadedUnix": "1357482080",
      "modVersion": "v1.6x",
      "virusScanUrl": "https://www.virustotal.com/file/8c1994bd98308b3ae7968df57d73050e43a655893a524bb051c4b94b985b7556/analysis/1407340130/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hand%20to%20Hand%20-%20Necksnap-29453-v1-6x.rar?fid=1000000429&ttl=1535803574&ri=8192&rs=8192&setec=f2c1ac1521641af7e084981ba1b2a9a9"
    },
    {
      "fileId": "1000000950",
      "name": "Hand to Hand - no visible gloves following you",
      "version": "v1.7x",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "461",
      "fileName": "Hand to Hand - no visible gloves following you-29453-v1-7x.rar",
      "uploadedUnix": "1357658704",
      "modVersion": "v1.7x",
      "virusScanUrl": "https://www.virustotal.com/file/690a4c92f5cadcbdf309448109f34f06aeb8b96af34cf11eb9caf6f8ee8a6de1/analysis/1407343630/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hand%20to%20Hand%20-%20no%20visible%20gloves%20following%20you-29453-v1-7x.rar?fid=1000000950&ttl=1535803574&ri=8192&rs=8192&setec=3a78d02de7ce298e09a5f50e41fb6b85"
    },
    {
      "fileId": "1000001958",
      "name": "Hand to Hand - Dushelov Fix",
      "version": "vDushelov",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "782",
      "fileName": "Hand to Hand - Dushelov Fix-29453-vDushelov.rar",
      "uploadedUnix": "1358034736",
      "modVersion": "vDushelov",
      "virusScanUrl": "https://www.virustotal.com/file/850d2779d618ca458f2431e49baab8bc8d426d2202003c27bd995f8c0551e48d/analysis/1407350480/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hand%20to%20Hand%20-%20Dushelov%20Fix-29453-vDushelov.rar?fid=1000001958&ttl=1535803574&ri=8192&rs=8192&setec=66b62f50b8a65d12efc5f9a140591e98"
    }
  ]
}