{
  "modId": 29469.0,
  "modName": "The Well Dressed Mage",
  "summary": "New robe designs for all College of Winterhold Robes, including the Archmage Robe. New meshes based on vanilla assets, non-replacer version only.",
  "descriptionHtml": "[center][img]http://static.skyrim.nexusmods.com/mods/images/29469-1-1357408339.jpg[/img][/center]\r\n\r\n\r\n\r\n[size=4][center][b]What this mod adds:[/b][/center][/size]\r\nThis mod adds alternative versions of the five ranks of the College of Winterhold robes as well as an alternative for the Archmage robe and a matching set of accessories to go with it. The list of items added is as follows;\r\n[list]\r\n[*]Novice Mantle, Novice Robe, Novice Cowl\r\n[*]Apprentice Mantle, Apprentice Robe, Apprentice Cowl\r\n[*]Adept Mantle, Adept Robe, Adept Cowl\r\n[*]Expert Mantle, Expert Robe, Expert Cowl\r\n[*]Master Mantle, Master Robe, Master Cowl\r\n[*]Archmage Greatcoat, Archmage Fur Shawl, Archmage Armbands, Archmage Gloves, Archmage Boots, Archmage Hood\r\n[/list]\r\nThe robes were divided into mantles and robes. Each mantle uses slot 57, previously unused save by other mods, and each robe remains a chest slot item. They are flagged as chest items, however, and can be enchanted with the default chest item enchantments. The varying magic school based enchantments are now placed on the mantles, not the robes, giving mage players a blank enchantment slot for chest pieces. \r\nThe aesthetic of these robes is that of an adventuring mage, more barbaric and functional. Exposed torsos are already present in fur and hide armors so the precedent is already set in the vanilla game. The style I aimed for is the same one that was used when developing the original robes, namely the emphasis on triangles, representing (assumedly) the three elements of destruction magic. All the models are based on vanilla meshes, altered and reconfigured according to the original notions of how the College robes should look melded with my own style and goals in making the adjustments. These robes are meant to be sexy and revealing, but also believable and somewhat practical looking. \r\nThere will never be a female version of these robes. I repeat, never.\r\nThere is already an absurd abundance of female clothing, armor and robe mods available, and I have no interest in adding to that number. Comments asking for female versions will be ignored.\r\n\r\nThe mantles all come with the same scaled enchantments as the vanilla robes. Hence Novice’s Mantle of Alteration has the same enchantment as the Novice’s Robe of Alteration etc. The cowls function the same way; Novice’s Cowl has the same enchantment as Novice’s Hood. There are also “blank” versions of each rank’s mantle, robe and cowl available for custom enchantments.\r\nThese mantles and robes are designed to be mix and match capable. Obviously there aren’t a lot of options, but every mantle is compatible with every robe. The cowls are designed to fit certain mantles, however, and clipping will occur if you mix and match them. The Apprentice/Adept cowls are the most versatile of the cowls and go with pretty much anything; however the novice cowl and the expert/master cowls are only really meant to go with their respective mantles. \r\nThe Archmage robe was the first thing I tackled on this project and actually launched me into the notion of re-imagining every college robe. There are six pieces to the new Archmage set. The Greatcoat (which uses the body slot and is in all essentials a more normal robe replacer.) a Fur Shawl, Armbands, gloves, boots and a hood. The fur shawl uses slot 57, the same slot as the mantles for the previous ranks. It is flagged as a head item, however, and can be enchanted with the same enchants as any head item. You can wear the mantles from the previous ranks with the Archmage coat however this is not the intended look and there is a massive amount of clipping and overall it looks quite stupid. \r\nThe Armbands use slot 44, and so are compatible with all the previous ranks’ mantles. They are flagged as a glove item and as such can be enchanted with the same enchantments as a glove item. There is some minor clipping with the robes of the previous ranks. While wearing the armbands with any of the other robes of this mod is not strictly against my intentions for how these can be worn, I have no intention of changing the armbands to minimize clipping with the novice through master robes. The Archmage set was intended to be worn as a set and as such does not mix and match well. \r\n\r\nThe modularity of these robes extends into the structure of the meshes themselves. I kept the various pieces and parts of each mesh as standalone and functional as possible without the other pieces. There are exceptions of course, especially regarding fur (which is usually covering a sharp edge or an awkward seam) however the three cuirass meshes (novice, expert and archmage) are very versatile. Play around with them and feel free to make alterations to the meshes for YOUR OWN PERSONAL USE, of course, but I kept them all separated as much as I could to allow folks to customize the robes further if they wanted to.\r\n\r\n\r\n\r\n[size=4][center][b]Where to find:[/b][/center][/size]\r\nEvery enchanted piece is included in the leveled inventories of court wizards around Skyrim. \r\n[list]\r\n[*]Wuunferth the Unliving\r\n[*]Sybille Stentor\r\n[*]Madena\r\n[*]Wylandriah\r\n[*]Farengar Secret-Fire\r\n[*]Falion of Morthal\r\n[/list]\r\nThe court wizard of Markarth, Calcelmo, is not included in the list. A much easier way to get both the enchanted or un-enchanted versions of the mantles robes and cowls is to head to the College of Winterhold. \r\n[list]\r\n[*]Faralda sells leveled destruction mantles, leveled magicka regeneration mantles and leveled enchanted cowls\r\n[*]Phinis Gestor sells leveled conjuration mantles, leveled magicka regeneration mantles and leveled enchanted cowls\r\n[*]Colette Marence sells leveled restoration mantles, leveled magicka regeneration mantles and leveled enchanted cowls\r\n[*]Drevis Neloren sells leveled illusion mantles, leveled magicka regeneration mantles and leveled enchanted cowls\r\n[*]Tolfdir sells leveled alteration mantles, leveled magicka regeneration mantles and leveled enchanted cowls\r\n[*]Enthir sells leveled enchanted cowls, all un-enchanted cowls, leveled magicka regeneration mantles, all un-enchanted mantles and all un-enchanted robes. \r\n[/list]\r\nThe reason Enthir will always have all ranks of un-enchanted mantles and robes is that the robes, being un-enchanted, are just clothing and mainly intended to match the various mantles, which differ from rank to rank. During play testing, I found it overly tedious to ensure he had the proper blank robe I needed when I was upgrading my mantle. \r\nThe Archmage Set is only creatable once you have completed the College of Winterhold main quest. To reiterate, you must complete The Eye of Magnus in order to craft the new Archmage set. Once you have completed this quest, recipes will appear under the Daedric category on any forge allowing you to craft the set. They do not require anything too spectacular either in quantity or rarity. Daedra Hearts, ebony ingots, lots of leather and leather strips mainly. There are two versions of the hood and coat. The coat comes either with the hoodless Archmage robe enchantment or it comes un-enchanted. So there is no confusion, the enchanted version of the coat does not have the +50 magicka found on the hooded version of the robe given to you upon completing The Eye of Magnus. The enchanted hood you can make at the forge however comes with +70 magicka, or you can craft an un-enchanted version of the hood as well.  \r\n\r\n\r\n[size=4][center][b]Videos:[/b][/center][/size]\r\n[center][youtube]Qq-SG7BMrEo[/youtube][/center]\r\nthanks to CaptainShack for making this video of the robes in action!\r\n\r\n\r\n[size=4][center][b]Alternate Textures:[/b][/center][/size]\r\nStealthic Khaos has worked incredibly hard to help me include some alternate textures with this mod for your use. Altering the meshes as I have, certain unfortunate aspects of the vanilla textures came to the fore. Certain parts of the texture fading to black, for instance, or painted on shadows of parts of the mesh that are no longer present or in their vanilla positions. Stealthic created alternate textures that eliminate most of these inconsistencies, however you must manually replace the default meshes (that use vanilla textures) with the appropriate alternate meshes found in the OPTIONAL folder of each robe.\r\nIt is important to remember that if you use a texture replacer such as Kobayashi’s NRHD clothing or Miss Obsidienne’s Elaborate textiles, you will want to use the meshes that install by default so the textures remain replaced. \r\n\r\nStealthics textures are optional, again you must manually replace the default meshes with those found in the OPTIONAL sub folder of the Novice, Apprentice or Adept robes. \r\n\r\n\r\n\r\n[size=4][center][b]What I am working on:[/b][/center][/size]\r\nSee the Sticky in the Comments section\r\n\r\n\r\n[size=4][center][b]Bugs/Disclaimers:[/b][/center][/size]\r\nThese robes are not meant to be put on female characters. I tried to make them a little bit sensible but for the most part you will end up with a hot mess if you try and wear these or put them on a female character. I take no responsibility for any issues that may arise because of this. Just in case you missed it before, I will never make a female version of these robes.\r\nThere remain a few minor weighting issues I was unable to sort out; however my beta testers assure me that they are none of them noticeable to anyone but me. Obviously if you find a more serious problem that was somehow overlooked, please PM me with a picture and a description of what mods you are using that affect the animations of your character if the bug has to do with stretching, exploding, deforming etc.\r\nThe body mesh I used in the robes is Robert’s Skyrim body, occasionally available on the TES Adventures forums. All credit to him for making one of (in my opinion) best body meshes for Skyrim. As such, if you use Vanilla, Sundracon or Favoredsoul (or any other) body meshes, there will be slight changes to the body mesh of your character HOWEVER the body texture you use will map perfectly onto Roberts mesh, and the changes will be very minimal. \r\n\r\nA Final Disclaimer: There are two things I will never do with this mod, and comments referring to either of them will be ignored;\r\n[list]\r\n[*] I will never make a female version of this\r\n[*] I will never add shirts or any sort of chest covering nor will I consent to people offering to do it for me, it defeats my entire aesthetic and purpose in making the mod. Look at hide and fur armors if you want a precedent for the exposed torso.\r\n[/list]\r\n\r\n[size=4][center][b]Translations:[/b][/center][/size]\r\n[url=http://anvilbay.ru/files/well-dressed-mage/]Russian Translation by Larite[/url]\r\n\r\n[size=4][center][b]Compatibility:[/b][/center][/size]\r\nI have not tested this mod’s compatibility with other mods. I realize this is somewhat of an oversight however between me, Stealthic Khaos, Urshi and Greyblood it has been run alongside a very wide variety of mods with no apparent issues. The only mods that may conflict are mods that alter the merchant inventories of the above mentioned mages that sell the new robes, mantles and cowls. As long as this mod is loaded after any other mods that alter those NPC’s wares, you shouldn’t run into any problems. \r\nObviously any mod that uses slots 57 or 44 will not be compatible with the mantles for all the ranks or the Archmage Armbands. This was intentional. I dislike the notion of creating overpowered characters via new enchantment slots, so I went through the popular mods and chose slots that are used by some of them. I do not plan on changing this, as it was intentional from the beginning. \r\nMajor incompatibilities with “overhaul” mods will not be addressed by me personally. If you want to put together a compatibility patch for one of these mods, please PM me and we can work something out.\r\n\r\n\r\n\r\n[size=4][center][b]Installation:[/b][/center][/size]\r\n[b]NO VANILLA ASSETS WERE ALTERED WITH THIS MOD[/b]\r\nI dislike using all capital letters but there it is, just wanted to be absolutely clear. Installation is a breeze, simply drag and drop the meshes and textures folders in your TWDM.rar as well as the .esp and readme of course and put them in your data folder. You should now have a folder called Earrindo in your meshes and your textures folders. These are all the folders and subfolders you should have and where they should be. \r\nMeshes: Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\Earrindo\r\n\tSteam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\Earrindo\\\\Novice Robe\r\n\tSteam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\Earrindo\\\\Apprentice Robe\r\n\tSteam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\Earrindo\\\\Adept Robe\r\n\tSteam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\Earrindo\\\\Expert Robe\r\n\tSteam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\Earrindo\\\\Master Robe\r\n\tSteam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\Earrindo\\\\Archmage Coat\r\nTextures: Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\textures\\\\Earrindo\r\n\tSteam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\textures\\\\Earrindo\\\\The Well Dressed Mage\r\n\r\nI am not clever with programming and anyways I encourage manual installation of mods, so there will not be a NMM version of this file with installation options for textures or anything like that. If someone wants to do something like that for me, please PM me and we can work something out, but it is not something I will do on my own. Because no vanilla assets were altered, there will be no “Do you want to replace x with y” windows, really a very simple operation.\r\n\r\n\r\n\r\n[size=4][center][b]Usage:[/b][/center][/size]\r\nThese assets may not be used without my express permission.\r\nIn the past I have been very lenient with letting other people make use of my work, however being older and somewhat wiser now; these assets cannot be used without my permission. If I am unable to be contacted by anyone for six months, these assets may be used as long as I am given full credit and a link is provided back to the original mod page. This is my explicit wish and I hope that it will be respected. \r\nThis is a Nexus exclusive mod. I dislike the way the Steam workshop functions and I do not want this mod to be available on the workshop in any form.\r\nI realize this is all a bit firm sounding, however if I am asked for permission to do a translation or a compatibility patch I am almost guaranteed to consent. I don’t want any part of this mod to be used without my consent though. \r\n\r\n\r\n\r\n[size=4][center][b]Credits:[/b][/center][/size]\r\nThere are many people I would like to thank. \r\nBethesda, of course, for providing us with Skyrim and all the wonderful things we are able to do with it as modders.\r\nNightasy for creating (and continuing to create) some of the best tutorials I have ever seen with regards to 3ds max. Without his videos, I could never have made this mod.\r\nStealthic Khaos, who was not only a beta tester but did an amazing job with the texture requests I put to him and worked many, many long hours to help me finish the mod up to my own high standards.\r\nUrshi and Greyblood for being awesome beta testers and taking some phenomenal screenshots of their lovely characters in my robes.\r\nRobert for creating and making available his wonderful male body mesh for Skyrim.\r\nThe Nexus Network, for hosting all these amazing mods and for being one of the only places I hang out anymore. Since my days in Morrowind, the official forums have become a hostile and unpleasant place, but I find myself in good company on the Nexus and they deserve our unabashed thanks for providing and maintaining such an awesome place for gamers to share their creativity. \r\n\r\n\r\n\r\nOne final note of thanks to Stealthic Khaos for formatting the mod description page and getting everything on it ship shape and lovely and to Urshi, Greyblood and Stealthic Khaos for taking the lovely images for me to use! \r\nIn many of the images, the mod [url=http://skyrim.nexusmods.com/mods/19826]Elaborate Textiles by MissObsidienne[/url] was used, I heartily encourage you to download it not just for her robe textures but all the textures!\r\n\r\n[center][img]http://static.skyrim.nexusmods.com/mods/images/29469-2-1357408391.gif[/img][/center]",
  "categoryId": "60",
  "version": "1.0a",
  "author": "Earrindo",
  "createdUnix": "1357395045",
  "updatedUnix": "1369230794",
  "containsAdultContent": false,
  "uploadedBy": "Earrindo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000124",
      "name": "The Well Dressed Mage",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11423",
      "fileName": "The Well Dressed Mage-29469-0-1.rar",
      "uploadedUnix": "1357395200",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/5d2ccf5379f3497c6f27a74fe5d5986dfb17f46df2c35906b7f24eccb6dad393/analysis/1407338298/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Well%20Dressed%20Mage-29469-0-1.rar?fid=1000000124&ttl=1535803634&ri=8192&rs=8192&setec=f9453300728c3efb3ff363c29f26782e"
    },
    {
      "fileId": "1000000166",
      "name": "The Well Dressed Mage",
      "version": "0.1b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11473",
      "fileName": "The Well Dressed Mage-29469-0-1b.rar",
      "uploadedUnix": "1357410545",
      "modVersion": "0.1b",
      "virusScanUrl": "https://www.virustotal.com/file/09902a600d012b0f6a0646ea0afcc740c4b0f92e2de3205855561fc832c89fb6/analysis/1407338600/",
      "changelogHtml": " Added missing textures for Expert and Master hoods <br/> \n Updated the esp to use the proper textures for the expert and master hoods <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Well%20Dressed%20Mage-29469-0-1b.rar?fid=1000000166&ttl=1535803634&ri=8192&rs=8192&setec=e1d99e01294bfbc27a6aea4a2064dbe9"
    },
    {
      "fileId": "1000022645",
      "name": "The Well Dressed Mage",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22045",
      "fileName": "The Well Dressed Mage-29469-1-0.rar",
      "uploadedUnix": "1365202323",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cfb05134eb053c4ecf4016f4082533311956ac3e41742e9103d468fd4da6e92c/analysis/1407508336/",
      "changelogHtml": " Added fur trim to the novice, apprentice, adept, expert and master robe skirts <br/> \n fixed some AA priorities with the robes <br/> \n added Savior&#39;s Hide alternate robe mesh <br/> \n added Thieves Guild and Guild Master&#39;s robes <br/> \n cleaned with TES5 Edit <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Well%20Dressed%20Mage-29469-1-0.rar?fid=1000022645&ttl=1535803634&ri=8192&rs=8192&setec=8dca99e044a3f6a2e56e4e2987da539f"
    },
    {
      "fileId": "1000030921",
      "name": "The Well Dressed Mage",
      "version": "1.0a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "7",
      "fileName": "The Well Dressed Mage-29469-1-0a.7z",
      "uploadedUnix": "1369230794",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/5d7ba159479765f1bcce7fd40b8619b04a84aa29f78753f7dc150ce61d4a0b26/analysis/1407577686/",
      "changelogHtml": " added beast race support to Archmage&#39;s Fur Shawl <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Well%20Dressed%20Mage-29469-1-0a.7z?fid=1000030921&ttl=1535803635&ri=8192&rs=8192&setec=8a2abaa6b92bfe4b6df5cf941b86c4a9"
    }
  ]
}