{
  "modId": 29497.0,
  "modName": "The Tome",
  "summary": "An epic treasure hunt fit for the Gods, can you complete it?",
  "descriptionHtml": "Step back and follow the lost notes of Valas Grey, begin your journey in Markarth at the Silver-Blood inn to discover the lost Tome she searched for.\r\n\r\n[WIP]\r\n\r\n---------------------------------\r\nFeatures\r\n---------------------------------\r\n-Several Caves with various enemies and bosses each boss has a ring needed to cause The Tome to do different spell variations so far its  conjuration 1 of the planned 5 or so cave systems is close to done.\r\n\r\n-A Tome teaching you a spell that differs depending on the ring you have acquired through the caves you complete over 10 different variations and growing il be adding all the creatures in skyrim to the list of conjurables as i go along\r\n\r\n-Custom creatures (my modeling skills arent great yet so mostly textures for now)\r\n--New mudcrab called a Seacrab you can see it in one of the preview photos above.\r\n\r\n- A small player home equipped with an Alchemy table and ingrediants (you can use it after you defeat the boss who currently lives inside)\r\n\r\n---------------------------------\r\nBugs\r\n---------------------------------\r\n-there is an occasional bug not sure if its just me or something didnt work right when i made it, but sometimes the dead npcs will spawn with the gear i set unequipped.\r\n-occasionally npcs will not load at all in the dungeon, again i have no idea why and its entirely random for me not sure if this will happen to you or not but its just a warning. Usually restarting the game or reloading the save fixes it.\r\n---------------------------------\r\nUpdate\r\n---------------------------------\r\n\r\n-Dungeon Expanded (a whole new section added on with more enemies and more scenery!)\r\n-second boss added! and his own little grove!\r\n\r\n-Third Boss added along with a player home you may use after killing him!\r\n\r\n\r\n-the spell summons a creature based on the ring you are wearing, all the rings are inside the chest with the tome! \r\nOnly one at a time :) they will be distributed to other dungeons i make as i go so dont get comfy with them there :P\r\n\r\n---------------------\r\nSpoiler\r\n---------------------\r\n\r\n-all the rings can be found in a chest now inside the main Lost Mine under the water after you get the key from the second boss, if you dont want to cheat however leave them there till i plac them around the map intheir own caves :)",
  "categoryId": "35",
  "version": "10",
  "author": "Bamboostew",
  "createdUnix": "1357423757",
  "updatedUnix": "1357845726",
  "containsAdultContent": false,
  "uploadedBy": "bamboostew",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001443",
      "name": "The Tome",
      "version": "10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1097",
      "fileName": "The Tome-29497-10.rar",
      "uploadedUnix": "1357845726",
      "modVersion": "10",
      "virusScanUrl": "https://www.virustotal.com/file/c03fbb2f701df96f2e807a2f302a6b856fa3d37d496873960f8c17c721fedcee/analysis/1407346805/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Tome-29497-10.rar?fid=1000001443&ttl=1535803675&ri=8192&rs=8192&setec=984b52ffd44765c0ade3f19c7a1953a7"
    }
  ]
}