{
  "modId": 29514.0,
  "modName": "Poison Dart Launcher",
  "summary": "A special crossbow for slyly administering poisons, without dealing any physical damage. Pair with my Improved Special Poisons mod, and you can finally have fun poisoning people!",
  "descriptionHtml": "[youtube]GA01l2Dpeyo[/youtube]\r\n\r\nREQUIRES DAWNGUARD.\r\n\r\nThe Poison Dart Launcher can be crafted under the \\\"Iron\\\" category at any forge (1 Iron Ingot, 3 Leather Strips). Poison Darts can be crafted as well (1 Firewood and 1 Frostbite Venom will net you 10 darts, just like any other bolt recipe).\r\n\r\nThe darts themselves aren\\'t poisonous; you\\'ll still have to apply the poison yourself, which allows greater versatility. Instead, the purpose of the launcher and darts is that they deal the least possible physical damage (two, to be precise), so as to administer the poison on a healthy foe. Tired of your high-level archers getting one-shot kills while you\\'re trying to have some fun with Frenzy, Fear, or Paralyze poisons? This weapon will fix your problem. It\\'ll even level your Alchemy skill (call it \\\"field work\\\"  :D).\r\n\r\nOn that note, if you\\'re as disappointed as I was with the strength of those mind-altering poisons, you might want to check out my [url=http://skyrim.nexusmods.com/mods/29456]Improved Special Poisons[/url] mod. Boosts those effects, and adds two optional new ones for poisoning versatility.\r\n\r\nIt\\'s particularly convenient for bow users; since it\\'s a crossbow, you can hotkey it separate from your main bow, allowing you to pull it out without having to switch ammo every time.\r\n\r\nCONFLICTS: None that I know of.\r\n\r\nMORE EXPERIENCED MODDERS: If you\\'d like to make a new model for this, possibly something smaller and sleeker, please get in touch! Or, if you\\'re really ambitious, turn it into a one-handed blowgun... I\\'m thinking the flute could be the key model, if you can whip up some new animations. Anyway, I\\'m rambling now...\r\n\r\nEnjoy!",
  "categoryId": "55",
  "version": "1.0",
  "author": "rcavanah",
  "createdUnix": "1357440556",
  "updatedUnix": "1357440613",
  "containsAdultContent": false,
  "uploadedBy": "rcavanah",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000324",
      "name": "Poison Dart Launcher",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Poison Dart Launcher-29514-1-0.zip",
      "uploadedUnix": "1357440613",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/473d36043207782edcef7166fd554e2383d2b9da58471a84d1e77ae377d75cac/analysis/1407339488/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Poison%20Dart%20Launcher-29514-1-0.zip?fid=1000000324&ttl=1535803701&ri=8192&rs=8192&setec=c76d36072c80be95dd3356876d17c56c"
    }
  ]
}