{
  "modId": 29513.0,
  "modName": "Deranked Perk Trees",
  "summary": "This mod transforms almost all multi-ranked perks into single-ranked perks. These single ranked-perks contain all the benefits that the old multi-ranked perk used to have...and automatically grant them to the player when his skills are high enough. Update: optional file that tweaks and adds several perks now available. ",
  "descriptionHtml": "Deranked Perk Trees\r\nby Tiny Lampe\r\nversion: 2.2\r\nRequirements: Skyrim version 1.8.151.0.7 or higher \r\nLink: http://skyrim.nexusmods.com/mods/29513/\r\n**************************************************************\r\nINDEX:\r\n_______\r\n\r\n1. Overview\r\n2. The Details\r\n3. Installation and Uninstallation\r\n4. Updating\r\n5. Compatibility\r\n6. Credits\r\n7. Legal\r\n\r\n1. Overview \r\n****************\r\n\r\nThis mod features: \r\n\r\nA. De-ranked Perk Trees: this mod transforms almost all multi-ranked perks into single-ranked perks. These single ranked-perks are special because they contain all the benefits that the old multi-ranked perk used to have...and automatically grant them to the player when his skills are high enough. Some of the changed perk feature smooth scaling, others don\\'t. \r\n\r\nB. Minimalistic changes to several existing perks and the addition of a few brand new perks (specially in Destruction, Restoration, and Two Handed). The purpose of the changes is not to deviate from the vanilla game but to add improvements that \\'could have been there by default\\'). \r\n \r\n2. The Details \r\n******************\r\n\r\nDE-RANKED PERK TREES:\r\n_____________________\r\n\r\nExample of non-smooth scaling: Shield Wall \r\n.....................................................\r\nIn vanilla Skyrim this perk has 5 ranks and each rank has a single benefit: increasing block effectiveness by 10%. Instead of 5 ranks with only 1 benefit, my mod provides 1 rank with 5 benefits. Importantly, these benefits are automatically unlocked only when your skill is high enough. This means that you can spend a single perk point in Shield wall and then see how your block effectiveness automatically increases as your block skill reaches certain milestones. No need to spend more perk points in the 2nd rank, in the 3rd rank...those are granted to you automatically as soon as you qualify for them! This creates the illusion that your skills are more important. \r\n\r\nPerks affected: Critical Shot, Shield Wall, Bone Breaker, Bladesman, Deep Wounds, Skull Crusher, Mage Armor, Magic Resistance, Summoner, Recovery, Experimenter, Stealth and Haggling. \r\n\r\nExample of smooth scaling: Barbarian\r\n..............................................\r\nIn vanilla Skyrim this perk has 5 ranks and each rank has a single benefit: increasing 2H weapon damage by 20%. In my mod there is only 1 rank and it allows damage to smoothly scale with skill: every single skill increase raises damage by 1%. This means that when your 2H skill is level 39 you deal 39% more damage with 2H weapons. When your 2H skill is level 76 you deal 76% more damage, and so on. Every skill increase counts. \r\n\r\nPerks affected by smooth level scaling: Overdraw, Juggernaut, Armsman, Barbarian, Enchanter, Alchemist, Agile Defender, Augmented Flames (Now Flame Affinity), Augmented Frost (Now Frost Affinity), Augmented Shock, and Light Fingers. \r\n\r\nExcluded Perks\r\n...................\r\nThere are 4 perks that have ranks but I decided to exclude from this mod. This perks are: steady hand, dual flurry, limbsplitter and hack and slash. Reasons: steady hand and dual flurry are perks where you can like the first rank but dislike the second one. Limbsplitter and Hack and Slash are very messy perks and \\'deranking\\' them would be quite time consuming and probably not worth the effort. \r\n\r\nLIST OF PERK CHANGES AND PERK ADDITIONS\t\r\n_______________________________________\r\n\r\nDestruction changes: \r\n--------------------------\r\nNovice Destruction: Novice spells also inflict 25% elemental weakness. \r\nAdept Destruction: Cloaks provide 50% elemental resistance \r\nExpert Destruction: Wall spells make most opponents who try to cross them flee for 5 seconds.\r\nImpact: SINGLE-casted missile spells can stagger at random (fire), when opponents are preparing or recovering from a swing (ice), or when they are casting (shock). \r\nAugmented Flames (renamed to Fire Affinity): Fire spells are 15% cheaper and scale with destruction skill. Precludes taking Frost Affinity.  \r\nIntense Flames (renamed Twin Flames): When casting a projectile fire spell, you have a 20% chance to instantly cast it a second time for no magicka. \r\nAugmented Frost (renamed to Frost Affinity): Frost spells are 15% cheaper and scale with destruction skill. Precludes taking Fire Affinity.\r\nDeep Freeze: Targets who have less than 50% health and less than 20% stamina are frozen solid by ice spells\r\nAugmented Shock: Shock spells scale with destruction skill.\r\nDisharge (new perk): Shock spells deal increased damage to magicka\r\nDisintegrate: Projectile shock spells will distintegrate targets who have less than 50% health and less than 15% magicka. \r\nRune Master: also allows having 2 active runes at the same time. \r\nHazards from Wall spells cause lingering damage by default \r\n\r\nRestoration changes: \r\n-------------------------\r\nVulnerability (new perk): Spells do 50% more damage to fleeing undead\r\nWarded Defense: You are automatically protected by a ward when blocking. The ward is too weak to resist most spells but will block non-elemental shouts with ease. \r\nWard Stability: Wards cost nothing to maintain but drain your magicka when hit by a spell.\r\nImperfect Shalidor Mirror (new perk): when hit by a spell, wards have a 10% to unleash a staggering shockwave.   \r\nWards: they are 25% more powerful by default (magnitudes of 50, 75 and 100 from 40, 60 and 80).\r\n\r\nAlteration changes:\r\n------------------------\r\nAlteration dual casting (renamed Overcharge): unlocks dual casting for all schools of magic. Perks that did a similar thing in the other perk trees have been removed.\r\n\r\nTwo Handed changes: \r\n--------------------------\r\nChampion stance: Two Handed weapons attack 10% faster and block 10% more effectively. At 75 skill both bonuses are doubled. \r\nSweep: now has a 2nd rank that allows normal attacks to also hit all targets in front of you. \r\nDevastating Blow: allows all power attacks to do additional damage based on your stamina. \r\n\r\nOne Handed changes:\r\n--------------------------\r\nDual Flurry (renamed Flurry): You can swing 20%/35% faster with either hand when you don\\'t have a shield equipped. Those using only 1 weapon also benefit. \r\n\r\nBlock Changes: \r\n------------------\r\nQuick reflexes (renamed Focus): time slows down if you block and stand still during an enemy\\'s power attack. \r\n\r\nEnchantment changes: \r\n---------------------------\r\nPerks fire, frost and shock enchanter removed and replaced by a single one: elemental enchanter.\r\nGrand Infusion (new perk): due to its bigger size, enchantments placed on 2H weapons are 50% stronger. \r\n\r\nSneak Changes: \r\n-------------------\r\nDeadly Aim no longer requires backstab. \r\nAssassin\\'s Blade no longer requires Deadly Aim (but still requires Backstab).\r\n\r\nHeavy Armor changes: \r\n---------------------------\r\nCushioned: also reduces incoming damage from daggers, swords and arros by 50%.\r\nConditioning: weight of heavy armor is cut in half (instead of becoming 0). \r\n\r\n3. Installation and Uninstallation:\r\n*****************************************\r\nIMPORTANT: since this mod creates new perk entries instead of editing existing vanilla perks YOU SHOULD USE A PERK RESET MOD BEFORE INSTALLING MY MOD.\r\nYou can use this one: http://skyrim.nexusmods.com/mods/19944\r\n\r\nThis mod consists of an .esp file called DerankedPerks_withTweaks.esp and a folder called \\'Scripts\\'\r\nTo install, place both inside the data folder and then check the .esp file\r\nTo uninstall remove both from your data folder. \r\n\r\n4. Updating:\r\n****************\r\nTo update to version 2.2 replace the old .esp file and the old script folder with the new ones. There is a new script in the script folder so replacing the old one is necessary. The old script has not been modified in any way so a clean save is NOT necessary. \r\n\r\nTo update to version 2.1 simply replace the old .esp file by the new one. The script folder provided in version 2.1 contains the exact same information as in version 2.0 so replacing it is not necessary. \r\n\r\n5. Compatibility\r\n*******************\r\nThis mod doesn\\'t remove any vanilla entry.\r\nThis mod several perks and some destruction, restoration and alteration spells. \r\nIn general, this mod will not be compatible with other perk and magic mods. \r\n\r\n6. Credits\r\n************\r\nrenketsu0 for his Better Wards mod (http://skyrim.nexusmods.com/mods/22057). I took the new ward magnitudes from it.\r\n\r\nSeorin for his \\'Syrim Perk Enhancements and Rebalanced Gameplay\\' mod (http://skyrim.nexusmods.com/mods/24445). I took the idea of the perk \\'twin flames\\' from him. \r\n\r\nWTFus for patiently answering my questions regarding scripting. Also for brainstorming with me some of the ideas that ended up appearing in this mod. Check his fantastic \\'Combat Remastered\\' here: http://skyrim.nexusmods.com/mods/24377\r\n\r\n7. Legal:\r\n***********\r\nThis mod is a nexus-exclusive release. Please respect my decision and do not upload this file to other sites. \r\nYou must get permission from me before you are allowed to modify my files or use them in your project. If you send me an e-mail and I don\\'t reply in 15 days, then you\\'re free to modify and/or use my files however you see fit.  ",
  "categoryId": "24",
  "version": "2.2",
  "author": "Tiny Lampe",
  "createdUnix": "1357436473",
  "updatedUnix": "1359334868",
  "containsAdultContent": false,
  "uploadedBy": "tiny lampe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000318",
      "name": "DerankedPerkTrees",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "DerankedPerkTrees-29513-1-0.7z",
      "uploadedUnix": "1357436700",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/327cef4331e5d8e08ae3307d2ebf79432a610e9df2d6a0e013ae3efd7a89adb7/analysis/1407339363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DerankedPerkTrees-29513-1-0.7z?fid=1000000318&ttl=1535803698&ri=8192&rs=8192&setec=d87c8cd6844f7e6a98a377f9a9aaaaa6"
    },
    {
      "fileId": "1000002752",
      "name": "DerankedPerks_withTweaks_v2-1",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17",
      "fileName": "DerankedPerks_withTweaks_v2-1-29513-2-1.7z",
      "uploadedUnix": "1358353085",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/90644828513bc6e767b2734b265b5e66f165570d91b337ce7356c8bd7bf2afe9/analysis/1407356475/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DerankedPerks_withTweaks_v2-1-29513-2-1.7z?fid=1000002752&ttl=1535803699&ri=8192&rs=8192&setec=7a03cf9f8be7ca7b0f946f29605a1ffb"
    },
    {
      "fileId": "1000005368",
      "name": "DerankedPerks_withTweaks_v2-2",
      "version": "2.2b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "DerankedPerks_withTweaks_v2-2b-29513-2-2b.7z",
      "uploadedUnix": "1359334868",
      "modVersion": "2.2b",
      "virusScanUrl": "https://www.virustotal.com/file/4ae2dfd4e76984a1495dce6502174f50d741a42494336e7b34571d0041098667/analysis/1407382941/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DerankedPerks_withTweaks_v2-2b-29513-2-2b.7z?fid=1000005368&ttl=1535803699&ri=8192&rs=8192&setec=5f934fbfc936addc49d44791bc562b68"
    }
  ]
}