{
  "modId": 29525.0,
  "modName": "SPANISH - Weapons of the Third Era MoS edition Spanish Translation",
  "summary": " Esta la traducción actualizada del Mod Weapons of the Third Era MoS edition al español. Si conoces y tienes el mod, pues aquí lo tienes traducido a la última versión. Si no lo conoces, te recomiendo que lo pruebes.",
  "descriptionHtml": "  Traducción del mod :\r\n   Weapons of the Third Era\r\n   MoS Edition (Armas de la Tercera Era)\r\n======================================================================================\r\n\r\n La Traducción del Mod creado por 747823, y continuado por masterofshadows, desde la versión 1.3 hasta la versión 1.51, todos los créditos van hacia ellos por los modelos y las texturas, y todo el esfuerzo, yo nada más lo traduje. Si tienes el mod, aquí ya lo tienes traducido en la versión actual. Si no, pues te recomiendo que lo pruebes si te gustan las armas nuevas. \r\n\r\nTodos los créditos van para el fabuloso 747823, y más todavía a masterofshadows que tomo el mod y siguió adelante con él.\r\n\r\n All credits go to the great 747823, and even more to masterofshadows, who picked up the mod and carried on with it.\r\n\r\n Link to the original mod: http://skyrim.nexusmods.com/mods/12892\r\n\r\n=====================================================================================\r\n\r\nEste archivo contiene el plugin de lvl list traducido. Una lvl list es un plugin que, básicamente,\r\ndefine que e te aparece en dónde y en qué nivel. Hay muchas, y sirve para definir que consigues como recompensa al matar a un enemigo, abrir un cofre, o simplemente tirado, dependiendo de tu nivel. Debido a que masterofshadows solo permite tratar los esp que dependan de los archivos bsa (modelos y texturas) y el esm (master file, que contiene todo), este es el que traducí y traduce todo perfectamente.\r\n\r\nPara Notar: En la sección optional del mod original hay unos archivos que tal vez \r\n te interesen:\r\n      3rdEraWeapMoS-rareCraft_esp 1\r\nOptional crafting recipes for all rare weapons - NOT needed for tempering!\r\n    Esta te permite forjar armas raras que de otra forma solo encontrarías como recompensa o comprando, si tienes suerte.\r\n_______________________________________________________________________________----\r\n Replacer - Green Glass \r\nReplaces vanilla sword models with 3E weapon models, glass armor and weapons use 3E green glass.\r\n         Reemplaza los modelos y texturas de las armas del juego original con las del mod, y las armas de Cristal se combierten en las de Cristal oriental (las verdes).\r\n_______________________________________________________________________________----\r\n\r\nReplacer - vanilla glass\r\nReplaces vanilla sword models with 3E weapon models, glass armor and weapons remain vanilla teal.\r\n  Lo mismo que el de arriba, pero las armas de cristal se quedan igual C:\r\n\r\n\r\nMis otras Traducciónes \r\n\r\n[url=http://skyrim.nexusmods.com/mods/11811//?]Fores New Idles in Skyrim[/url] (me encargué de traducir el instalador al español)\r\n\r\n[url=http://skyrim.nexusmods.com/mods/36945/?]Isilmeriel LOTR Weapons Collection[/url] (Agrega las armas del Señor de los Anillos a Skyrim)",
  "categoryId": "36",
  "version": "1.51",
  "author": "masterofshadows y 747823 originalmente",
  "createdUnix": "1357455073",
  "updatedUnix": "1357455277",
  "containsAdultContent": false,
  "uploadedBy": "Zimitry",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000374",
      "name": "3rdEraWeaponsMoS_v1_51 - Spanish",
      "version": "1.51",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "3rdEraWeaponsMoS_v1_51 - Spanish-29525-1-51.rar",
      "uploadedUnix": "1357455277",
      "modVersion": "1.51",
      "virusScanUrl": "https://www.virustotal.com/file/7a3afc4fa04b282f09ab40190530478f7b5ed2abf8a4e2ddae216202df6c0fd2/analysis/1407339754/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/3rdEraWeaponsMoS_v1_51%20-%20Spanish-29525-1-51.rar?fid=1000000374&ttl=1535803714&ri=8192&rs=8192&setec=002bd4495f11113f8490bdaa8b61a079"
    }
  ]
}