{
  "modId": 29526.0,
  "modName": "Pilotable Rowboat BETA",
  "summary": "This is a pilotable Rowboat just betta now and although it works I still need HELP with a few things like the nif\\'s, my NifSkope kung fu sucks! Also I need a little help making it sumonable. \r\nAlso need some help with followers, followers will ride in the boat now but I need to make it better. Need to re-position player and sit idle. Need to re-po",
  "descriptionHtml": "[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/sSbds.png[/img][/url][/center]\r\n\r\nDescription\r\n===========\r\nThis is a Pilotable Rowboat and although it works I still need help with a few things like the nif\\'s, my NifSkope kung fu sucks! Also I need a little help making it sumonable. \r\nAlso need some help with followers, followers will ride in the boat now but I need to make it better.  Need to re-position player and sit idle. Need to re-position the rowboat a little higher. And a few other things that should become apparent.\r\nI would really love some help with this please, thank you hope you enjoy it.\r\n\r\nLocation\r\n=======\r\nThe Rowboat is located in Riften at the dock\\'s. Better to go there from the outside at first.\r\n \r\nBugs\r\n====\r\nThere will be an update soon!\r\nThere are a few bugs to be aware of... Nothing game breaking but bugs nonetheless..... When going over rapids the boat will sometimes sink, to fix this move camera to the bottom of the boat underwater and move forward. It\\'s a little difficult to get your companions into the boat for now but it can be done. This will be fixed soon. I tried to get the sounds to work but haven\\'t as of yet sorry, this too will be fixed soon. The build a boat summon spell does not function yet, this to will be fixed soon. Sorry for all of this but I released it before it was done in hopes of getting some help.\r\nDetails\r\n=======\r\n\r\n1.  Build or summon your own rowboat that works!\r\n2.  Take your companions with you!\r\n3.  \r\n4.  INCOMPLETE!\r\n5.  \r\n6.  \r\n\r\n\r\n\r\nInstall\r\n=======\r\n1. This should work fine with NMM.\r\n2. Manual download- Extract the files to a temporary location. Copy the files to \\\\Skyrim\\\\Data\\\\ or steam steamapps\\\\common\\\\skyrim\\\\Data\r\n\r\nUninstall\r\n=========\r\n1. In data files, Uncheck and delete.\r\nIf you need to delete everything that came with this mod then do this.... examine the contents of the whole mod folder and delete all\r\nthe corresponding files.\r\n2. Or use Nexusmodmanager\r\n\r\n\r\n\r\nNotes\r\n=====\r\n1. This is the BETA, I hope to get some help with this mod as I am stuck and my NifSkope kung fu not good!\r\n\r\n2. Until it\\'s finished it\\'s going to be a little hard to get your followers in the boat but once their in, then you should be able to take them with you.\r\n\r\n3. \r\n\r\nContact\r\n=======\r\nKnightRangersGuild on Skyrimnexus or KnightRangersGuild@yahoo.com\r\n\r\nCredits\r\n=======\r\nThanks to Bethesda for creating Skyrim and the Creation Kit.\r\n\r\n\r\nTools Used\r\n==========\r\nSkyrim Creation Kit, lot\\'s of coffee and my brilliant imagination.\r\n\r\nPermissions\r\n===============\r\nI released this mod early in hopes that someone would help me with it. I still would like to be the first one to release it when it\\'s finished please, thank you.",
  "categoryId": "78",
  "version": "1",
  "author": "KnightRangersGuild",
  "createdUnix": "1357455485",
  "updatedUnix": "1357455963",
  "containsAdultContent": false,
  "uploadedBy": "KnightRangersGuild",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000375",
      "name": "Pilotable Rowboat BETA",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "233",
      "fileName": "Pilotable Rowboat BETA-29526-1.7z",
      "uploadedUnix": "1357455963",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/93cb3c6c88562855891c9a96dda69baa0f196300023ae26cd137be97bbb1d8de/analysis/1407339755/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pilotable%20Rowboat%20BETA-29526-1.7z?fid=1000000375&ttl=1535803716&ri=8192&rs=8192&setec=da65b57164bfe6c82a1436d1c4ff2b80"
    }
  ]
}