{
  "modId": 29527.0,
  "modName": "Level 20 with over 300 Locations and MQ not started",
  "summary": "Level 20 Orc, MQ not started, 300 locations discovered, artifact user, 17 words of power. \r\nRead long description for full understanding of this unique character. ^.^ \r\n",
  "descriptionHtml": "Looking for a new way to play Skyrim I decided to ignore the main quest and try to spend as much time exploring as possible. I also wanted to try a game that absolutely ignored magic and trade skills as much as possible. Therefore this guy is solidly built in one-handed weapons, archery and light armor and has discovered over 300 locations. On the other hand, he has yet to even report to the Jarl that the dragons are coming and because of this, there are no dragons to be found. (ironic!). He has acquired several artifacts and his main weapon, shield and body armor are all Daedric gifts (these are actually useful in a non-trade-skill based game!). Lastly he has discovered 17 words of power but has yet to absorb even a single dragon soul! \r\n\r\n(The saved game has some extended content installed but will not affect loading it in a vanilla game, just load it with whatever content you have available.)\r\n",
  "categoryId": "43",
  "version": "20",
  "author": "Me",
  "createdUnix": "1357457082",
  "updatedUnix": "1357457371",
  "containsAdultContent": false,
  "uploadedBy": "dragonalumni",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000379",
      "name": "Saved Game",
      "version": "20",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3756",
      "fileName": "Saved Game-29527-20.zip",
      "uploadedUnix": "1357457371",
      "modVersion": "20",
      "virusScanUrl": "https://www.virustotal.com/file/f8fcb69be68331c5421fb346c45eff8d0792368462e94bd5be7a7781e9c9bb8d/analysis/1407339789/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saved%20Game-29527-20.zip?fid=1000000379&ttl=1535803718&ri=8192&rs=8192&setec=6ec7abc6256319ec005c0c17ebb62a72"
    }
  ]
}