{
  "modId": 29536.0,
  "modName": "Talgos Blade beta",
  "summary": "Adds an craftable sword with incredible powers, if you have the skills and materials for it.",
  "descriptionHtml": "****This mod requires Dawnguard****\r\n-------Lore overview-------\r\nFor generations, for every era that passed, smiths have tried to craft their strongest weapon\r\nthey could ever make that their ability allows them. Many incredible blades and weapons\r\nwhere made durning each era, but there was one blade, that was crafted by an unknown\r\nblacksmith, who knew every art in smithing. He crafted an incredible sword that\r\ncould cut armor as if it was just butter.\r\n\r\nHowever, this blade was never found, and it was forgotten. After some years when the\r\n4th era began, the same smith, wrote a book before he died. Acording to the book, it says\r\nthat the blade itself will forever exist as long as there are veteran blacksmiths in\r\ntamriel. The key to create this weapon does not covers in blueprints, but in the art\r\nitself. To create this incredible weapon, you need a sword made from each material, wich\r\nare listed below\r\n\r\nIron\r\nSteel\r\nEbony\r\nOrichalcum\r\nMalachite (glass)\r\nDwemer Metal\r\nElven (Moonstone)\r\nDaedric\r\nDragonBone\r\nSilver\r\n\r\nWith these combines, a master smith can create the incredible blade.\r\nPlease do note that the requirement for the blade is a difficult task, and only\r\nveterans will ever hope to use it.\r\n-----Mod Overview----\r\n\r\nThis mod adds an Ebony type sword that has an incredible damage output.\r\nIt has an glowing effect on the blade. For you who thinks the damage is far to\r\nOP and high, thats because you are far to low leveled, since this mod is only for\r\nveteran players who plays Skyrim with their high leveled characters (such\r\nas level 60 and higher). The blade is OP on very low levels, as it was not\r\ndesigned for low level characters, only veterans.\r\n\r\nTo craft the weapon, you need a sword from each perk can give you (as stated above).\r\nYou can awlays check the requirement field in the smithing menu if you want to know\r\nthe ingredients.\r\n\r\nIn this version, no perk is needed, but you still need all swords from each material\r\ngroup. Again, this mod is not for low leveled characters, so only use this weapon\r\non high level (Level 50 is a minimum as my recommendation). \r\n-----Installation-----\r\n\r\nJust place the files into the data folder and run skyrim. The game sould\r\nactivate the mod by itself, and no, this mod wont work on pirated versions,\r\nno mather how hard you try.\r\n\r\nThe mod works best with The ENB Series with nice bloom settings.\r\n\r\n-------Updates------\r\n\r\n0.5: Initial Release\r\n\r\n----------\r\nCredits goes to bethesda for creating skyrim and the base stuff, like\r\nthe 3d model. The glow effect and the sound effects and the mod itself\r\nwas made by me.",
  "categoryId": "55",
  "version": "0.5",
  "author": "cebius",
  "createdUnix": "1357474581",
  "updatedUnix": "1357474724",
  "containsAdultContent": false,
  "uploadedBy": "cebius2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000415",
      "name": "Mainfile",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3619",
      "fileName": "Mainfile-29536-0-5.rar",
      "uploadedUnix": "1357474646",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/a88bafedaa9e1cc7677fd1b9f4530db1f4ac4d3a26fe185aee1ba02fd5768a95/analysis/1407340029/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mainfile-29536-0-5.rar?fid=1000000415&ttl=1535803726&ri=8192&rs=8192&setec=b0ee806f689349c113f80ee22d47dceb"
    },
    {
      "fileId": "1000000416",
      "name": "Readme",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Readme-29536-1.rar",
      "uploadedUnix": "1357474724",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1005cd33c4545275d3f191154a267eaaa7097664c501c41f52deba8c7860af40/analysis/1407340030/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Readme-29536-1.rar?fid=1000000416&ttl=1535803727&ri=8192&rs=8192&setec=0d4466c86cbfdc8893e5422fcc49ca29"
    }
  ]
}