{
  "modId": 29562.0,
  "modName": "Armor Customization START",
  "summary": "Grants the ability to change the color of your armor, with crafting!\r\nYOU MUST DOWNLOAD THE MOD AND THE TEXTURES YOU WANT",
  "descriptionHtml": "COMING SOON // THIS MOD IS BEING REDONE AND RECREATED FOR BEAUTIFICATION PURPOSES\r\n\r\n_-_-_YOU MUST DOWNLOAD THE MOD AND WHATEVER TEXTURES YOU WANT TO HAVE, THERE NOT INCLUDED IN THE MOD FILE!!_-_-_\r\n_-_-_IF YOU WANT PICTURES OR MORE INFO BEFORE IT IS HERE, COME AT ME @SpiderSilkzMods_-_-_\r\n_-_-_THE NEXT PATCH I PUT OUT WILL CONSIST OF ALL!! WEAPONS AND ARMOR CUSTOMIZABLE SO BE PATIENT_-_-_\r\n\r\n~*________~*~________*~\r\n_-Armor Customization-_\r\n__--If you have any comments or questions please post and i will be happy to respond. Contact me with messages, email, comments or tweet me @SpiderSilkzMods!! :)--__\r\n___---PLEASE tell me what armors you want me to do, I know no one wants iron armor, so tell me and I will do it, I WANT TO MAKE YOU HAPPY!!!!!___---\r\n**********************************\r\n~*________~*~________*~\r\n_-      Explanation      -_\r\n__--This Mod will enable the creation of different colored armor by using the Tanning Rack and crafting colors onto your armor with different colored mountain flowers. At the moment the mod is not complete. The file is BIG and this is just the beginning, so make sure you HAVE SPACE :)--__\r\n**********************************\r\n~*________~*~________*~\r\n_- Currently-Available  -_\r\n__--Iron; Purple, Red--__\r\n**********************************\r\n~*________~*~________*~\r\n_-         *Excuse         -_\r\n__--It is very time consuming and a long mod to make. It is necessary to go in and make new textures for each armor, for each color. I am very sorry for delays and i will add at least one color or one armor set a week, I would do more but i am not a very free person.\r\nI will keep adding updates with new armor and new colors, and if i get enough endorsements i will add a color booth specifically designed for color changing. I am sorry for the time, i will try my hardest to make things fast. Thanks!!--__\r\n**********************************\r\n~*________~*~________*~\r\n_-          Goals           -_\r\n__--I plan to get at least one set of armor, or one color of armor, done a week, hopefully a lot more.--__\r\n___---Future; I plan to have full sets of armor done, Complete the mod. Ie light and dark versions of each color and a amped mod that has all the data but is a third ish of the space (Possible).---___\r\n____----Future-er; I plan to add a color wheel----____\r\n_____-----Future-er-er; This mod will have its own \\\"Booth\\\" like a blacksmiths forge!-----_____\r\n**********************************\r\n~*________~*~________*~\r\n_-         Update         -_\r\n__--The same colors are done, i am working on a mass weapon pack, i just added a new table just for color design, they are located in Riverwood, Whiterun, Windhelm, Markarth, and Riften. More armors and updates will be out soon. Thanks, please keep up the wonderful support :)--__\r\n**********************************\r\n~*________~*~________*~\r\n_-           Help           -_\r\n__--If there is anything I can do to help please let me know. You can send me a message or comment in the comment section. Glitches and bugs would be best. Second to that if you guys have a set of armor you want me to do send me a message, DON\\'T COMMENT ABOUT CERTAIN ARMOR TYPE FOR NEXT UPDATE!! I wont do what each person wants, so if you send me a message, which ever armor type has the most message in my inbox will be made colorfulitious (Colorful and Customizable)--__\r\n**********************************\r\n~*________~*~________*~\r\n_-         Thanks         -_\r\n__--Thanks to all the people that have commented or supported me, Please feel free to Rate or Endorse. Thanks to Everyone, you guys are great and awesome! Thanks to all who Donate their time and ideas. :)--__\r\n**********************************",
  "categoryId": "60",
  "version": "1.1",
  "author": "SpiderSilkz",
  "createdUnix": "1357517385",
  "updatedUnix": "1357517385",
  "containsAdultContent": false,
  "uploadedBy": "SpiderSilkz",
  "primaryFile": null,
  "files": []
}