{
  "modId": 29580.0,
  "modName": "Balanced Civil War Armor",
  "summary": "Simple mod that modifies that stats for the imperial and stormcloak armor to match steel and leather armor, respectively.",
  "descriptionHtml": "I always thought it annoying that the imperial and Stormcloak armors were much worse than the steel and leather armor.  When doing the civil war questlines, I wanted to wear my uniform, but my steel armor was so much better.  The images above show some examples of the discrepancies between the soldier and regular armors.\r\n\r\nSo, I changed the heavy and light imperial and stormcloak armors to match the steel and leather armor that you might normally want to wear.  (unless you waited until full daedric armor to begin the questline)\r\n\r\nAlso, there is a known bug with the Stormcloak officer armor (the bear looking armor) that classified the bear boots as heavy armor, preventing the light armor set perk from activating when wearing the full officer set.  I fixed that too.  I might just upload a separate bug fix if people don\\'t want their armor stats mucked up.  But you gotta tell me.\r\n\r\nINSTALLATION:\r\nJust throw it into the skyrim data folder, probably located in Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\r\n\r\nUNINSTALLATION:\r\nJust delete it.  Whatever.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Dementis",
  "createdUnix": "1357538556",
  "updatedUnix": "1357538789",
  "containsAdultContent": false,
  "uploadedBy": "ildementis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000653",
      "name": "Balanced Civil War Armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Balanced Civil War Armor-29580-1-0.zip",
      "uploadedUnix": "1357538789",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7cd4f0d67e5816d4de68caeb38d37cc2784d970ce08fe8c0173a9e48e0a109a0/analysis/1407341769/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balanced%20Civil%20War%20Armor-29580-1-0.zip?fid=1000000653&ttl=1535803803&ri=8192&rs=8192&setec=95af21681fc83866c5240c122b7da26c"
    }
  ]
}