{
  "modId": 29582.0,
  "modName": "Scary Stories for Skyrim",
  "summary": "Adds more \\\"horror themed\\\" books to Skyrim. ",
  "descriptionHtml": "Ever wanted more books like \\\"The Cabin in the Woods\\\", \\\"The Woodcutter\\'s Wife\\\", and the \\\"Horror of Castle Xyr\\\"?\r\n\r\nWell (hopefully) this is the mod for you as I shared that desire. I always felt that the \\\"horror\\\" themed books were some of the best, and I wanted to expand on the available number. \r\n\r\nAs of now. This mod adds 12 new scary books to Skyrim. 7 of them are story excerpts from the acclaimed \\\"Scary Stories to Tell in the Dark\\\" series by Alvin Schwartz. Which have been changed by myself where I felt necessary (and appropriate) to better fit the lore of the Elder Scrolls Universe and so as not to break immersion. \r\n\r\nThe other 5 are original stories written by myself with the Elder Scrolls series completely in mind.  I don\\'t claim to be a great writer, but I like to think they retain the spirit of books like \\\"The Woodcutter\\'s Wife.\\\"\r\n\r\nCurrent List of Stories:\r\n\r\n(Adapted Schwartz)\r\n-The Bride\r\n-The Wendigo\r\n-Sounds\r\n-A Man Who Lived in Leeds\r\n-Harold\r\n-The Dead Hand\r\n-Its Him!\r\n\r\n(Original Stories)\r\n-The Horror of Dive Rock\r\n-The Headless Horseman of Skyrim\r\n-A Tale From Elswyr\r\n-Dark Descent: A Necromancer\\'s Journal\r\n-The Cursed House\r\n\r\nAll stories have been added to leveled book lists. So they SHOULD have a chance at appearing in any vendor\\'s inventory which sells non-spell tome books (although without mods that add book vendors or the like I believe the only one who sells books regularly is the Librarian in the college of Winterhold). As well as in leveled loot. Each of the books has also been added in the game world at select places.\r\n\r\nBarring that however, and if you do not wish to simply find them on your travels. I have added a bookseller to the \\\"Silver Blood Inn\\\" in Markarth who sells each one of the books. He is the high-elf in black robes. \r\n\r\nTo install, just put the .esp in your data folder and check it on the data list. \r\n\r\nNOTE: I have done my best to proofread these books, but no doubt grammatical errors remain. Please forgive them if you come upon them. \r\n\r\nLet me know of any glaring grammatical mistakes or problems with the mod. I hope to add more stories in the future as well. \r\n\r\nUpdates: \r\n\r\nv1.1\r\n-Fixed several grammatical errors and unnecessary edits for the mod. \r\n\r\nv1.12\r\n-Toned down the number of books in the leveled lists to make them a bit more \\\"rare\\\" and not overly saturated. \r\n\r\n",
  "categoryId": "85",
  "version": "1.12",
  "author": "Andronicus",
  "createdUnix": "1357539343",
  "updatedUnix": "1357636240",
  "containsAdultContent": false,
  "uploadedBy": "Andronicus23",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000901",
      "name": "Scary Stories for Skyrim v1-12",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29",
      "fileName": "Scary Stories for Skyrim v1-1-29582-.zip",
      "uploadedUnix": "1357636240",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f18be3372c73aed3b0a9fbb235b67687a83ecddddcf94dd7af960d4a224254af/analysis/1407343323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scary%20Stories%20for%20Skyrim%20v1-1-29582-.zip?fid=1000000901&ttl=1535803805&ri=8192&rs=8192&setec=90324f11871d78309045e67e595b411b"
    }
  ]
}