{
  "modId": 29592.0,
  "modName": "ASTOLYNE MANOR",
  "summary": "A paladin House, with real empthy library (8 bookcases) 15 big weapondisplay, 12 small weapondisplay, 10 mannequins, crafting (alchemy, smithing, enchant).\r\nA lore-friendly manor without big empty spaces and (i hope) pleasant athmosphere around the foundain.\r\nNEAR SOLITUDE.\r\n1.1 Bathroom!",
  "descriptionHtml": "[font=verdana][size=15][center][color=gold]MANOIR ASTOLYNE[/color][/center] [/size][/font]\r\n[size=5][color=gold][right]A lorefriendly Paladin House[/size][/color][/right]\r\n[size=5][i][color=silver]by MissRedpaln[/size][/i][/color]\r\n[center][size=4][color=silver]1.2 IN PROGRESS[/size][/color]\r\nWork on the   weapon display-cases  \r\nadd like a \\'dragon priest mask wall :)\r\nadd some weapon racks\r\n[b]i dont have much time in this moment i ll do my best[/b]\r\n\r\n\r\n[size=4][color=silver]Long Term Development[/size][/color]\r\n-work on a Rp manner on how to become the owner of the manor [/i]\r\n\r\n[img]http://static.skyrim.nexusmods.com/mods/images/29592-5-1357687493.jpg[/img][/center]\r\n\r\n[center][size=4][color=silver]NEW!! 1.1 Version is here![/color]\r\n -navmeshes inside and outside the house \r\n-New Bathroom\r\nI Hope you\\'ll enjoy it! Please endorse if you like!![/size]\r\n[img]http://static.skyrim.nexusmods.com/mods/images/29592-1-1357851845.jpg[/img][/center]\r\n\r\n\r\n\r\n\r\n\r\n[b][english version, for the french read me see below][/b]\r\n\r\n\r\nreadme 7/01/2012\r\n\r\nFIRST I APOLOGIZE FOR MY ENGLISH, I M FRENCH AND I M GONNA DO MY BEST :)\r\n\r\n------------------------------\r\nInstallation\r\n\r\nPaste the esp in data repertoir.\r\n\r\n\r\n------------------------------\r\nLOCALISATION\r\nThe Manor is just near Solitude. Take the road to the stables, continue throw the docks, the gate under Solitude, and the manor will be just on your right.\r\n\r\n--------------------------------\r\nDESCRIPTION\r\n\r\nFirst, thank you to have DL my mod. This is my first mod for Skyrim, so please leave me comments and tell me what do you think about my house :)\r\n\r\n\r\nThis manor was made for my Paladin named Lizbeth Astolyne. I was looking for a house with a empty and big library, in a charming house. I dont like very big \r\nhouse with full of empty spaces... I find the \\\"DRAGON FALL MANOR\\\" fantastic, but the library was missing... so i decided to build my own one.\r\n\r\nMy goal in this mod was to make a not-to-big house, welcomming and usefull manor. I hope it\\'s done :)\r\n\r\n\r\nEntrance\r\nFOUNTAIN/PATIO/AUTELS/WEAPONRACK\r\nWhy Mara under the fountain?  I choose her because for me, she represent the compassion and empathy, importants values for a paladin. \r\nAll around you will find weaponracks for every \\\"region\\\" (chatelleries in french, i dont known the term in english), so you ll have a place to display your\r\nthane\\'s weapon!\r\nI have choose three gods, i think place all the gods shrine in a house is not very Rp ^^\r\nSo, there is Mara (same reasons ^^ ) Akatosh because He is the first, father of the other gods, represents strong and defender of the world, and Stendarr, \r\ngod of mercy, perfect for a paladin :)\r\n\r\n\r\nLibrary\r\n8 empty bookcases/ 2 scrollcontainers\r\n\r\n\r\n\r\nENCHANT WORKSHOP\r\n/2 chests /soulsgems/ enchantpotions / enchantbooks\r\n\r\n\r\nKITCHEN\r\na normal kitchen, why a place to cook.\r\n\r\n2nd FLOOR\r\nAll this floor is a \\\"big\\\" galery with 10 mannequins, 15 big displaycases, 12 smalls displaycases\r\n\r\n\r\nROOM\r\nA lite room to rest. Letter on the bed.\r\n\r\nTHERE IS NO BASEMENT. For me, placing a smithy or a fondry there is not Rp... to hot!\r\n\r\nOUTSIDE\r\nStables\r\nA place for your horse.\r\n\r\n\r\nSmithyplace\r\nAll you need is there! (with 2 chest and 3 barrels)\r\n\r\nAlchemy place\r\nWith a garden, and three bags (one big and two on the alchemy table) During the night, it is nicer!\r\n\r\n\r\n\r\n\r\n---------------------------------------\r\nBUGS KNOWNS\r\n\r\nThe silver plate on the table (entrance) seems to have its own life. Sometimes it s on the bench, sometimes on the floor, sometimes under the table...\r\nI dont know why....i somebody know....\r\n\r\nThe mannequins may move (but stay in place) just activate their and they gonna be statics.\r\n\r\n\r\nSometimes your compagnions cant enter in the house. I dont know why. If someone can explain me.....\r\n\r\n\r\n---------------------------------------\r\n\r\nFEATURES\r\nLet me know what you want me to do!\r\n\r\n---------------------------------------\r\nPLEASE NOtICE\r\nIt s forbiden to copy or re use this mod without my permission, and without mentions of the autor.\r\nPlease dont hesitate to contact me here!\r\npauline.astolfi@gmail.com\r\n\r\n\r\nThanks a lot! My english is not very good, isnt it? :)\r\n\r\n\r\n\r\n\r\nMissRedPaln\r\n\r\n\r\n\r\n\r\n-_-_-_-_-_-_-_-_-\r\nMods I recommend:\r\nConvenient Horses\r\nhttp://skyrim.nexusmods.com/mods/14950\r\n\r\nUnlimited Bookshelves\r\nhttp://skyrim.nexusmods.com/mods/10891\r\n------------------------------------------------------------------------------------------------------------\r\n\r\n[size=8]VERSION FRANCAISE:[/size]\r\n\r\n[font=verdana][size=15][center][color=gold]MANOIR ASTOLYNE[/color][/center] [/size][/font]\r\n[size=5][color=gold][right]A lorefriendly Paladin House[/size][/color][/right]\r\n[size=5][i][color=silver]by MissRedpaln[/size][/i][/color]\r\n\r\n\r\nlisez moi du 7/01/2012\r\n\r\n\r\n------------------------------\r\nInstallation\r\n\r\nPlacez le fichier ESP dans le dossier data du répértoire Skyrim.\r\nCochez le dans \\\"fichier donnés\\\" sur le lanceur Skyrim\r\n\r\n\r\n------------------------------\r\nLOCALISATION\r\nLe manoir se situe à la sortie de solitude. Prenez la route vers la ferme, puis descendez vers la compagnie et son port. Ensuite, passez le pont (sous la\r\ncité de Solitude) le manoir se situe a votre droite juste aprés :)\r\n\r\n--------------------------------\r\nDESCRIPTION\r\n\r\nTout d\\'abord merci d\\'avoir choisi mon manoir, n\\'hésitez pas a me mettre un petit commentaire sur vos impressions, c\\'est mon premier mod et j\\'y ai passé\r\nénormement de temps, donc ça serait comme une sorte de petite récompense ^^\r\n\r\nCe mod rajoute un manoir créé à la base pour mon personnage Lizbeth Astolyne, ma paladine. J\\'ai cherché longtemps une maison qui puisse me convenir, mais\r\nsoit j\\'en trouvais des trés cosy mais qui ne convenaient pas au \\\"standing\\\" d\\'une paladine (je pense a la maison de Grili, à rivebois, qui est juste superbe).\r\nJ\\'ai adoré le Dragon fall manor, qui représentait vraiment ce que je voulais, mais.....à chaque fois, il me manquait une bibliothéque, une vraie, une vie.\r\n\r\nCe mod est donc le résultat de plusieurs \\\"impératifs\\\" à savoir; une bibliothéque grande et \\\"a part\\\", un type de construction genre Solitude, et un style\r\ncosy-chaleureux.\r\nJe ne voulais pas d\\'un grand manoir avec beaucoup d\\'espaces vides, j\\'ai donc essayé de faire quelque chose de cohérent et d\\'agréable à regarder... j\\'espere\r\nque vous partagerez cet avis!\r\n\r\nEntrée:\r\nFONTAINE/PATIO/AUTELS/RACK D\\'ARME\r\nContient un patio, et une fontaine centrale sous une statue de Mara. Pourquoi Mara? Déja, les statues dans le jeu, y en a pas beaucoup :D J\\'ai choisi Mara\r\ndans le sens de la piété, de la compassion, et de l\\'empathie que doit suivre tout bon paladin. \r\nTout autour, vous trouverez un rack d\\'arme pour chaque chatellerie. En fait, je voulais un véritable espace pour pouvoir exposer mes armes de Thane, ainsi \r\nvous pouvez savoir celles qui vous manquent, et faire la collection. Aprés tout, ce ne sont pas des armes comme les autres!\r\nJ\\'ai choisi trois Autels, toujours par rapport au Rp du paladin (selon moi ^^ ). Je n\\'ai pas voulu aligner touts les autels, le but n\\'est pas de faire une\r\nmaison de grosbill ^^\r\nJ\\'ai choisi donc Mara pour les même raisons que la statue, Akatosh, parce que c\\'est le dieu \\\"ultime\\\", le temps, l\\'endurance la force, le premier et le plus \r\nimportant chez les impériaux (ma paladine est nordique de race mais pour la réunification impériale) et Stendarr, le dieu de la miséricorde, de la compassion\r\nle défenseur des hommes. Rp!\r\n\r\nBibliothéque\r\n8BIBLIOTHEQUES VIDES/ 2 CONTENEURS A PARCHEMINS\r\n\r\nLes parchemins prés du bureaux se positionnent de manière aléatoire, donc parfois (souvent) renversent l\\'encrier... je n\\'ai pas réussi a faire que ca n\\'arrive\r\npas. Au pire, un bon chiffon, et tout revient dans l\\'ordre. Les conteneurs a parchemins sont bien évidement safe.\r\n\r\n\r\nATELIER D ENCHANT\r\nposte d\\'enchantement/2 coffres /gemmes/ potions d\\'enchantement / livres d\\'enchantement\r\nJe vous avoue que l\\'ambiance de ce petit recoin est ma préferée ^^ containers safes :)\r\n\r\nCUISINE\r\nUne cuisine tout ce qu\\'il y a de plus normal. Les container sont safes. Un point de craft cuisine pres de la cheminée.\r\n\r\nETAGE\r\nTout létage est une mezzanine sur la fontaine avec vitrines [une 15aine de grandes pour toutes armes, une 10aines de petites a dagues] ainsi que 10 mannequins.\r\n\r\nChambre\r\nUne belle petite chambre cosy. Container safes. Un petit mot sur le lit ^^\r\n\r\nIl n\\'y a PAS de sous sol. Je ne suis pas du tout emballée par les forges ou les fonderies au sous sols, qui ne me semblent absoluments pas réalistes. Tout cela \r\nse passe donc dehors.\r\n\r\nEXTERIEUR\r\nEcuries\r\nEnfin un endroit pour poser votre cheval en étant sur qu\\'il restera dans le coin!\r\n\r\nAtelier de forge\r\nTout le necessaire, ainsi que deux coffres et quelques tonneaux (safes) \r\n\r\nAtelier alchimique\r\nJe n\\'étais pas partie à la base pour faire un atelier alchimique, ma paladine ne la pratiquant pas, mais j\\'ai pensé à vous ( et puis en plus c\\'est joooooli). \r\nRevenez la nuit, c\\'est encore plus chouette :)\r\nCOntient un jardin, avec des papillons! Un grand sacs et deux petites pochettes accrochées à l\\'atelier.\r\n\r\n\r\n\r\n---------------------------------------\r\nBUGS CONNUS\r\n\r\nLe plateau a fruit et fromage à l\\'entrée a droite semble avoir une vie propre, et se balader sur la table pour une raison inconnue. Parfois sur le banc, parfois \r\nretourné sur la table. Si quelqu\\'un peut m\\'expliquer...\r\n\r\nParfois les mannequins bougent (mais restent au même endroit) il suffit de les activer pour qu\\'ils redevienent statiques.\r\n\r\nIl semblerai que parfois vos acolytes ne vous suivent pas dans la maison... je n\\'ai aucune idée du pourquoi de ce problème, si quelqu\\'un peut m\\'éclairer....\r\n\r\n\r\n---------------------------------------\r\n\r\nProchaines idées:\r\nRajouter un NPC Lizbeth Astolyne qui pourrait vendre la maison; pourquoi pas rajouter un cuistot ou un garde. Je suis ouverte à toutes les propositions pour\r\naméliorer cette maison!\r\n\r\n\r\n---------------------------------------\r\nDroit d\\'auteur:\r\nIl est interdit de reprendre cette maison telle quelle ou juste en changeant quelques petites choses, surtout sans me demander, sauf évidement pour utilisation\r\nperso.\r\nPour me contacter:\r\npauline.astolfi@gmail.com\r\n\r\nMerci encore pour votre téléchargement!!",
  "categoryId": "67",
  "version": "1.1",
  "author": "MissRedpaln",
  "createdUnix": "1357564881",
  "updatedUnix": "1357850298",
  "containsAdultContent": false,
  "uploadedBy": "missRedpaln",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000699",
      "name": "ASTOLYNE MANOR",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "191",
      "fileName": "ASTOLYNE MANOR-29592-1-0.zip",
      "uploadedUnix": "1357565095",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6b4f6771a31772ea2a9098f837853d3d8b2ad7f5b0e1b2e8f2e005df52ee4296/analysis/1407342068/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ASTOLYNE%20MANOR-29592-1-0.zip?fid=1000000699&ttl=1535803816&ri=8192&rs=8192&setec=38617373ad0a0c03b99aa7961da409f5"
    },
    {
      "fileId": "1000001468",
      "name": "ASTOLYNE MANOR 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "260",
      "fileName": "ASTOLYNE MANOR 1_1-29592-1-1.zip",
      "uploadedUnix": "1357850298",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2b3a9a99df92e4287ed3d9b64479c11747111d5ab2a5c830a6119add809b51b3/analysis/1407346933/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ASTOLYNE%20MANOR%201_1-29592-1-1.zip?fid=1000001468&ttl=1535803816&ri=8192&rs=8192&setec=43e5043e0b8ef136070e4478beac5af7"
    }
  ]
}