{
  "modId": 29609.0,
  "modName": "The Fate of Thorin Oakenshield",
  "summary": "One of my first personal mods.I chose to upload this one just in case someone needs something like this ;)",
  "descriptionHtml": "Description:\r\nRecently I watched \\'\\'The Hobbit\\'\\' and was inspired to add Thorin as a DEAD free loot NPC.I noticed that some people don\\'t like to raise smithing up to 100 in order to make dragonbone weapons, so i\\'ve also included a Dragonbone Greatsword and Dragonbone Sword, as well as a set of ebony armor exluding the helmet just for immersion. His Corpse is located south of Riverwood in a hollow tree stump. It obviously requires Dawnguard if anyone wants the swords ;) This is my first upload and i know that anyone can do something as simple as this with the Creation Kit... so i hope that i have helped some gamers in a way. I am open for suggestions and i would gladdly read your comments. Also you can do anything you want with the file. Enjoy !!!\r\n\r\nNews:\r\nVersion 2.0 update changes:\r\nnpc\\'s facial appearance has been edited as i thought that it would be better to enhance his appearance in order to make him look more like Thorin from the movie.\r\nAlso a sword has been added to represent the blade that he wielded in the early parts of his adventure.\r\nA note was added to show how he ended up in Skyrim (people familiar with elder scrolls lore should recognise why would something like this be able to happen)-thanks to MurderWrath for the idea :)\r\nAnd the book was added featuring the lyrics of the song \\'\\'The Misty Mountains\\' Cold\\'\\' that the dwarves sang during a part of the movie.\r\n\r\n\r\nQuestions that COULD be asked:\r\n- Why would you make a mod like this ?\r\n- It is clear that i wanted to make an npc (well dead npc) representing a hero from the movie make an appearance in Skyrim\r\n\r\n- Why isn\\'t the character or the stuff appearing in the game ?\r\n- Make sure  you are in the right place (it\\'s not really hard to find) and there may be a possibility that you don\\'t have your game patched into version 1.8 (currently latest) although i\\'m   not sure if it conflicts with previous versions as i haven\\'t tested it\r\n\r\n- Why would you add high level items as loot into a very early location of the game?\r\n- The current location made me feel like it matches correctly and after all, if you consider this mod cheating, then simply don\\'t take the loot or even download \r\n\r\nBugs/Glitches:\r\nNone Known but should anyone find any please write about the problem in the comment section- i\\'m always happy to read your comments and help in any way i can",
  "categoryId": "33",
  "version": "2.0",
  "author": "Kotaidakos",
  "createdUnix": "1357587523",
  "updatedUnix": "1357654409",
  "containsAdultContent": false,
  "uploadedBy": "Kotaidakos",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000942",
      "name": "Thorin Oakenshield v2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "Thorin Oakenshield v2-29609-2-0.rar",
      "uploadedUnix": "1357654409",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/b9383eb67e01688c1e20cab6016b2952048dc28ba6cddd7b0911e1779f77e256/analysis/1407343570/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thorin%20Oakenshield%20v2-29609-2-0.rar?fid=1000000942&ttl=1535803846&ri=8192&rs=8192&setec=e6f8bcfc3a4cf5b274fb7712da1e2590"
    }
  ]
}