{
  "modId": 29631.0,
  "modName": "Bellyaches HD Dragon Replacer Pack",
  "summary": "Remastered high-definition textures for the ten dragon types of vanilla Skyrim, Dragonborn, and Dawnguard.",
  "descriptionHtml": "[youtube]WRf5MqhOgg0[/youtube] \r<br />*Not my ENB. Primary screenshots taken with vanilla lighting*\r<br />\r<br />\r<br />[size=3][color=orange][b]**Screenshots are welcome&#33;**[/b][/color][/size]\r<br />\r<br />Bethesda&#39;s HD DLC made most dragons look [i]better[/i], but by no means great. Skyrim uses the same size textures for its massive dragon models as it does for suits of armor. Besides that, there are a [i]LOT[/i] of minor issues with the textures and the meshes themselves... Mis-matched horn colors, awful eye textures, desaturated coloring, bland details, low-resolution translucent files, seam issues galore, and a very strange &#34;grease-like&#34; look applied to several of the dragon meshes. \r<br />\r<br />What does this all mean? Dragons look fine from a distance, but fairly awful up close.,, Well no more&#33; What started as a re-work of Odahviing turned into a full pass on each of the ten dragons in Skyrim and it&#39;s DLC&#39;s. The amount of changes on each dragon type varies, with some needing more work than others. Regardless, Bellyache & I visually inspected each texture/mesh with a microscope to correct as much as humanly possible within a timely manner. At least without completely reworking Bethesdas work from scratch.\r<br />\r<br />[size=3][color=orange][b][u]Improvements over the official High-Definition Texture-Pack:[/u][/b][/color][/size]\r<br />\r<br />*Coloring looks more natural and less desaturated and washed out than before. Many horns/spines were poorly colored or completely the wrong color.\r<br />*Fixed/Reduced as many bad texture & mesh seams as possible.\r<br />*Removed or significantly reduced the &#39;Grease-like&#39; look on some dragon models, which exacerbated seam issues further.\r<br />*Odahviing&#39;s gotten a facelift. He was completely missing an eye texture, coloring was terrible (he was pink), and corrected several seams.\r<br />*Blood Dragon was just plain ugly. Fixed the Alpha-channel, gave it eyes that [i]don&#39;t[/i] look like a frog, and introduced some yellow coloring in the wings and membranes for added contrast & detail.\r<br />*Alduin is slightly darker and completely grey-scale, enhancing his stylized theme that is inspired from volcanic rock & glass.\r<br />*Completely new eye texture for most dragon types.\r<br />*The Ancient Dragon never had a high-resolution texture, it does now. \r<br />*Increased resolution of the translucent file for the various dragon wings, creating [i]exponentially[/i] higher detail within the wing membranes.\r<br />*Changed the color of the mouth/gums from a strange purple to a more natural pink, filled in some ugly holes where teeth apparently used to be.\r<br />*We tried to fix up the Revered, Serpentine, and Legendary Dragons from DLC&#39;s... But they&#39;re [i]bad[/i], even after the final HD DLC update, it didn&#39;t help very much.\r<br />\r<br />[size=3][color=orange][u][b]****Installation****[/b][/u][/color][/size]\r<br />\r<br />[b]Nexus Mod Manager -[/b] Download and &#34;activate&#34;, click &#34;Yes&#34; when prompted to overwrite any files if asked.\r<br />\r<br />[b]Manual Method -[/b] Drag & drop the &#34;textures&#34; and &#34;meshes&#34; folders that are zipped inside this archive into your &#34;Data&#34; folder of your Skyrim Directory. Overwrite any/all files when asked. Keep the main archive so you may reference it to see what files there are to uninstall if necessary.\r<br />\r<br />[size=3][color=orange][u][b]FAQ & Information[/b][/u][/color][/size]\r<br />\r<br />[u][b]Q:[/b][/u] What resolution are these? Is there a performance hit?\r<br />[u][b]A:[/b][/u] Texture sizes are identical to the HD DLC (2048 x 2048). There will be no performance drop as long as you do not exceed your video-cards VRAM buffer. Anyone with a 1GB video card should be able to use these perfectly fine.\r<br />\r<br />[u][b]Q:[/b][/u] Are these compatible with &#34;XXX&#34; mod?\r<br />[u][b]A:[/b][/u] This is a texture mod in loose-file format. If you install this mod over another mod that also has loose files, this mod will work. Most mods (Like Deadly Dragons) are in .esp/.bsa format, and loose files take priority over .bsa archives. So again, it will work.\r<br />\r<br />[u][b]Q:[/b][/u] Will you upload 4096, 1024, or 512 resolutions?\r<br />[u][b]A:[/b][/u] No. These are edits directly from the HD DLC. There are no &#34;other versions&#34;. If your system can&#39;t handle one or two 2048 resolution textures at once, you have other more serious problems. Up-scaling these to 4096 resolution and simply saving them is a waste of system resources and wouldn&#39;t look any better.\r<br />\r<br />[u][b]Q:[/b][/u] Do I need the [url=http://skyrim.nexusmods.com/mods/31255/]Unofficial high Resolution Patch[/url] with this? What about Bethesda&#39;s official Hi-Res DLC?\r<br />[u][b]A:[/b][/u] This mod is a standalone package, you don&#39;t need anything else to make it work.  If you use the HD DLC, always use that patch. These files will take priority over the .bsa archive in it and will work properly.\r<br />\r<br />[u][b]Q:[/b][/u] Will you also work on a Automatic variants package or other color variations?\r<br />[u][b]A:[/b][/u] Bellyache is on hiatus from modding at this current time. An AV package might [i]someday[/i] be on the table, but there are no plans to to do one at this time. Color variations or alterations are not going to happen. That&#39;s not what this mod is for.\r<br />\r<br />[u][b]Q:[/b][/u] Why isn&#39;t Durnehviir included?\r<br />[u][b]A:[/b][/u] Durnehviir is literally a flying carcass, one that&#39;s covered in green goo. Any real &#34;work&#34; done to old Durni would just be covered up by that effect. Furthermore, I&#39;ve no idea what to do to the old boy in the first place... He&#39;s undead and he looks the part. It&#39;s not worth the effort to try and &#34;fix&#34; him (whatever that means) when it&#39;ll just be covered up by the green goo-slime anyways. So he&#39;s being left out.\r<br />\r<br />[u][b]Q:[/b][/u] The archive contains more than just texture files, what gives?\r<br />[u][b]A:[/b][/u] Yes, the archive contains some altered meshes, eye textures, a few translucent files for the wings, modified dragon LOD&#39;s, and the textures themselves. \r<br />\r<br />[u][b]Q:[/b][/u] I don&#39;t see a (big) difference from the HD DLC?\r<br />[u][b]A:[/b][/u] This is a fix/enhancement mod, not an overhaul or re-work. Some of what has been changed is difficult to notice unless you take a very close look at a stationary dragon - from up close. That&#39;s not something that happens in the game very much.The purpose of this is to &#34;fix&#34; or enhanceSkyrim&#39;s featured creature. To de-uglify them without turning them into something they weren&#39;t intended to be. Nothing more and nothing less.\r<br />\r<br />[u][b]Q:[/b][/u] I still see some stretching and seam issues, do explain?\r<br />[u][b]A:[/b][/u] Did the best we could, some of these meshes are set up fairly poorly and some textures are downright terrible. The frost dragon&#39;s spines are particularly bothersome and the DLC dragons are terrible in general. Some of the neck/tail seams are still there, but not nearly as pronounced as before.\r<br />\r<br />[u][b]Q:[/b][/u] Is this the same file that&#39;s package that was at one time available on the Deadly Dragons page?\r<br />[u][b]A:[/b][/u] Yes, but now it also has Dawnguard & Dragonborn dragons. It&#39;s on it&#39;s own page now though, for a variety of reasons.\r<br />\r<br />[u][b]Q:[/b][/u] I don&#39;t like &#34;XXX&#34;, please change/remove it?\r<br />[u][b]A:[/b][/u] No. If you don&#39;t like it, don&#39;t use it. If you don&#39;t want a certain texture or disagree with a certain change, delete that texture from your game folder. I&#39;m not cluttering the download page because you want X and not Y. Either don&#39;t use it or grab a copy of Photoshop and deal with it yourself.\r<br /> \r<br />[u][b]Q:[/b][/u] Why do your screenshots look so bad?\r<br />[u][b]A:[/b][/u] Completely vanilla Skyrim on Ultra, but mostly because I suck at it. Please take some quality screenshots and submit them&#33;\r<br />\r<br />\r<br />[u][b]Bellyaches other work:[/b][/u]\r<br />[url=http://skyrim.nexusmods.com/mods/3621]Bellyaches Animal and Creature Pack[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/20889]Bellyaches New Dragon Species and Ohdaviing Replacer[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/6377]Bellyaches Fur and Quilted Saddles[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/1724]Make dog companions into Wolfs[/url]",
  "categoryId": "29",
  "version": "1.3",
  "author": "Wrig675",
  "createdUnix": "1357622016",
  "updatedUnix": "1369669411",
  "containsAdultContent": false,
  "uploadedBy": "I2edShift",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031681",
      "name": "Bellyache HD Dragon Replacer Final",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "47182",
      "fileName": "Bellyache HD Dragon Replacer Final-29631-1-3.7z",
      "uploadedUnix": "1369669411",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/81818ee4af07d7adebcdceca5c4a9a46671b830fd8cce37154cc6f380dae8e43/analysis/1407583431/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bellyache%20HD%20Dragon%20Replacer%20Final-29631-1-3.7z?fid=1000031681&ttl=1535803879&ri=8192&rs=8192&setec=bd428261e94ac312f6b3f9f7fbf29552"
    }
  ]
}