{
  "modId": 29644.0,
  "modName": "VIP - Smithing Perk Tree",
  "summary": "Vanilla Improvement Project - Modifies the Smithing perk tree, combining light/heavy armor types in a way that will preserve any Smithing perks you&#39;ve already selected and retains compatibility with vanilla crafting material types.",
  "descriptionHtml": "Please note: There will be no future updates. I have discontinued my support for this mod and ceased my involvement in modding. But if there&#39;s a bug or issue you would like to fix, or if you just want to improve it, feel free to edit the mod using the Creation Kit. Also in the discussion you are allowed to advertise mods based on the file, or better mods than these.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />[color=#61A2E5][b]ABOUT THE MOD[/b][/color]\r<br />\r<br />  [b]This mod changes the Smithing perks in a very balanced and careful way. It applies the new perks retroactively, meaning that if you&#39;ve already chosen Glass Smithing, then you will be automatically granted the new perk that provides both Glass and Ebony Smithing.[/b]\r<br />\r<br />  It makes it so multiple perks get combined into one, but the vanilla perks are still displayed for peace of mind. The new perks enable the vanilla perks, and because of that it will still be compatible with all the vanilla crafting materials. \r<br />\r<br />  Concept: The concept behind this mod is that as you improve your skill in smithing, and become skilled in working with different materials, you can improve items based upon what you have learned and also reinforcing them with better materials. Improving still requires the normal materials, so that doesn&#39;t change, but I hope you understand the concept.\r<br />\r<br />  Effect upon gameplay: Main thing is that it will potentially increase the difficulty of the game when your smithing skill is low. That is because the improvement bonuses will be less than vanilla - so if you want to achieve those same vanilla perk/skill improvement bonuses you&#39;ll have to wait &#39;til your smithing skill has improved significantly and you&#39;ve invested in more perks.\r<br />\r<br />\r<br />[color=#61A2E5][b]UPDATES[/b][/color]\r<br />\r<br />Version 2 - [s]Should now be compatible with default/vanilla Skyrim or Dawnguard.[/s] (This was only fixed in version 2c). \r<br />- The Smithing Mastery perk has been split into Dragon and Daedric Smithing. More info in the &#39;What Happened to Smithing Mastery?&#39; section below.\r<br />\r<br />Version 2b - Just changed some perk&#39;s text description errors.\r<br />\r<br />Version 2c - Version 2 and 2b did not have Dawnguard.esm and Update.esm removed from the parent master dependencies, so I fixed that for version 2c - what that means is that Dawnguard is no longer required.\r<br />\r<br />\r<br />[color=#61A2E5][b]NEW PERKS:[/b][/color]\r<br />\r<br />1. Steel Smithing\r<br />Can create Steel armor and weapons at forges. You can improve all armor and weapons 20% more.\r<br />Requires 20 smithing.\r<br />\r<br />2. Mer Smithing\r<br />Can create Elven, Dwarven and Orcish armor and weapons at forges. You can improve all armor and weapons 20% more.\r<br />Requires 40 smithing.\r<br />\r<br />3A. Advanced Armors\r<br />Can create Scaled and Plate armors at forges. You can improve all armor and weapons 10% more.\r<br />Requires 60 smithing.\r<br />\r<br />3B. Arcane Smithing\r<br />You can improve magical armor and weapons. You can improve all armor and weapons 10% more.\r<br />Requires 60 smithing.\r<br />\r<br />4. Crystal Smithing\r<br />Can create Glass and Ebony armor and weapons at forges. You can improve all armor and weapons 20% more.\r<br />Requires 80 smithing.\r<br />\r<br />[s]5. Smithing Mastery\r<br />Can create Daedric and Dragon armor and weapons at forges. You can improve all armor and weapons 20% more.\r<br />Requires 100 smithing.[/s]\r<br />\r<br />5A. Daedric Smithing\r<br />Can create Daedric armor and weapons at forges. Can improve all armor and weapons 10% more.\r<br />Requires 90 smithing.\r<br />\r<br />5B. Dragon Smithing\r<br />Can create items from Dragon bones and scales at forges. Can improve all armor and weapons 10% more.\r<br />Requires 100 smithing.\r<br />\r<br />\r<br />[color=#61A2E5][b]READ THIS BEFORE INSTALLATION/USAGE[/b][/color]\r<br />\r<br />  The new perks add the vanilla perks automatically, but after selecting one of the new perks the old ones will not light up as selected straight away. You will need to exit the Skills/Level Up menu before the vanilla perks will appear as having been added.\r<br />\r<br />  If you&#39;ve already chosen smithing perks they will be converted into the new perks. You will only lose perk points you&#39;ve already spent if you&#39;ve spent them in both sides of the vanilla tree. If you&#39;ve chosen only the heavy armor and weapons side of the tree, you will get all of the new perks for the same perk point cost as this mod. \r<br />\r<br />- Perk points spent to progress through heavy side of tree all the way to Dragon smithing in vanilla = 6\r<br />- Perk points spent to get the equivalent with this mod = 6\r<br />\r<br />\r<br />[color=#61A2E5][b]FURTHER EXPLANATION[/b][/color]\r<br />\r<br />  If you already chose Heavy Materials + Dragon + Arcane Blacksmith, then you spent 7 perk points - after applying this mod all those perks you chose will be preserved. The only perk you will be missing is Advanced Armors, which is optional but provides +10% improvement. If you didn&#39;t choose Advanced Armors or Arcane, it won&#39;t matter either, the mod will still apply all the perks you already have from before.\r<br />\r<br />\r<br />[color=#61A2E5][b]WHAT HAPPENED TO SMITHING MASTERY?[/b][/color]\r<br />\r<br />  Version 2 removed it (you can still download the old version). Splitting Daedric and Dragon smithing is a much better idea than including them both in one perk. Reasons for this are:\r<br />- It means the perks you spent already in the vanilla/default tree will better match up with the new tree.\r<br />- It also means that you probably won&#39;t get Daedric smithing for free if you chose the light materials side originally.\r<br />- And Daedric can be chosen with 90 smithing skill instead of 100.\r<br />- Completing the entire perk tree now costs 7 perk points. Heavy armor smiths usually spend 7 perk points total so its more like vanilla in regards to the perk points spent. People who prefer light armor smithing still only need to spend 6 points, but can spend one more point and get 100% improvement and the ability to craft Daedric weapons (which are the best without Dawnguard&#39;s Dragonbone weapons).\r<br />\r<br />\r<br />[color=#61A2E5][b]CREDITS[/b][/color]\r<br />\r<br />  Thanks to other mod authors like SushiSquid who helped in the inspiration process and who&#39;s mods helped me learn and develop mine as I tried to figure out what they did.",
  "categoryId": "73",
  "version": "2c",
  "author": "zyg0tic",
  "createdUnix": "1357650818",
  "updatedUnix": "1357709394",
  "containsAdultContent": false,
  "uploadedBy": "zyg0tic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000934",
      "name": "VIP - Smithing Perk Tree",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "VIP - Smithing Perk Tree-29644-1.zip",
      "uploadedUnix": "1357650914",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/c26d6c938b062fc41811fb7a7189f978df1c993e3cf026531c9b5eabe958f5e0/analysis/1407343567/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VIP%20-%20Smithing%20Perk%20Tree-29644-1.zip?fid=1000000934&ttl=1535803900&ri=8192&rs=8192&setec=cffb076c2b0c0524c668a4e35cb46231"
    },
    {
      "fileId": "1000001113",
      "name": "VIP - Smithing Perk Tree v2c",
      "version": "2c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "VIP - Smithing Perk Tree v2c-29644-2c.zip",
      "uploadedUnix": "1357709394",
      "modVersion": "2c",
      "virusScanUrl": "https://www.virustotal.com/file/4490a6294d0b86b15e9e5c91f7b13482c2adc246fc574528de783bd5adfbcb61/analysis/1407344828/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VIP%20-%20Smithing%20Perk%20Tree%20v2c-29644-2c.zip?fid=1000001113&ttl=1535803901&ri=8192&rs=8192&setec=7467c89920d81d3bbd7fb7bcb692d5eb"
    }
  ]
}