{
  "modId": 29668.0,
  "modName": "Draco-Samurai Dwarven Armor HD Retexture And Katanas",
  "summary": "NOW WITH KATANAS! New HD retexture for the four pieces of the dwarven armor (cuirass, boots, gauntlets and helmet). It adds a dragon-like texture with typical samurai details. Completely made by myself to you to enjoy it!",
  "descriptionHtml": "This mod contains two esential parts:\r\n\r\n-Replacer: Draco-Samurai Dwarven Armor HD Retexture by Bulinguillo.\r\n-Standalone: Katana Crafting At Skyrim by lautasantenni.\r\n\r\nDRACO-SAMURAI ARMOR:\r\nDescription:\r\n\r\nWohoo, my second mod uploaded to this page, it has taken me a lot of time doing this but I really enjoyed it. It\\'s my first try doing serious HD retextures so I expect that you\\'re going to be comprehensive.\r\nThe mod includes a black and red dragonskin-based texture for almost the whole armor set and complimented with some other details that make it look like an ornate samurai armor like chainmail, black and brown leather, blue silk and gold textures, all of them in HD of course.\r\n\r\nInstallation:\r\n\r\nSimply and clever.\r\nOption A: Use NMM to install it in your Skyrim.\r\n\r\nOption B: \r\n1- Download the RAR file manually.\r\n2-Extract the Data folder inside the RAR into you Skyrim directory, usually located at C:/Program Files/The Elder Scrolls V Skyrim.\r\n3- Say yes to overwrite.\r\n4- Start playing and have fun!\r\n\r\nKATANA CRAFTING:\r\nUPDATED!\r\nNow you can sharpen the weapons at the grindwheel.\r\n\r\nAlso, if you have the problem where ebony sword is replaced with ebony katana, do this: go to your: .../Skyrim/Data/Meshes/Weapons/Ebony/ -and delete the \\\"ebonysword.nif\\\" file. \r\n\r\nThis Mod allows crafting Katana, Dai-Katana, Wakizashi and Tanto from materials; Steel, Ebony and Daedric. Katanas are more expensive to craft but are also more agile, same goes for Dai-Katana, wakizashi and Tanto.\r\n\r\nINSTALLATION:\r\nJust extract the contents of the zip to your: Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data so that the data -folder in the zip \\\"overwrites\\\" the data folder in your skyrim folder. Then enable the mod from your Skyrim launcher under Data Files.\r\n\r\nCredits:\r\n\r\n-Special thanks to lautasantenni for giving me permission for setting his katana mod with my draco armor ;)\r\n\r\n- Today I want to say special thanks to my Nexus friends and to the commenters that have helped me a lot by trying to make me improve all my modding works ( For example saynothing has sent me the latest screenshots of the armor, thanks!)\r\n\r\n-Of course thanks to Adobe Photoshop, NifSkope, DDS-BMP Converters for making so nice modding programs.\r\n\r\n-An obviously but not less important thanks to Bethesda for making so nice games and to Skyrim Nexus for its completely awesome web for uploading and downloading every mod that can cover your imagination.              ",
  "categoryId": "54",
  "version": "1.0",
  "author": "Bulinguillo",
  "createdUnix": "1357675422",
  "updatedUnix": "1357749899",
  "containsAdultContent": false,
  "uploadedBy": "Bulinguillo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001015",
      "name": "Draco-Samurai Armor",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "714",
      "fileName": "Draco-Samurai Armor-29668-1-0.rar",
      "uploadedUnix": "1357675470",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f7c6cd908b3fc6334a86d54a8261c01dae712ea2a11ffac458a8c405b68a1578/analysis/1407344113/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Draco-Samurai%20Armor-29668-1-0.rar?fid=1000001015&ttl=1535803944&ri=8192&rs=8192&setec=f74ef4e477b25f6c83ad5d0ef8fa2315"
    },
    {
      "fileId": "1000001194",
      "name": "Armor and Katanas",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8718",
      "fileName": "Armor and Katanas-29668-1-1.rar",
      "uploadedUnix": "1357749899",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/10e80ebe636d1dfe3dd22f71e70fe79c010e3c7e7b79c49570275c491d25761e/analysis/1407345251/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Armor%20and%20Katanas-29668-1-1.rar?fid=1000001194&ttl=1535803945&ri=8192&rs=8192&setec=19d6b1c188b2bb2994da611da0de406e"
    }
  ]
}