{
  "modId": 29664.0,
  "modName": "Nicks Skyrim Improvement Guide SFW Version",
  "summary": "The way I play Skyrim -- which mods and softwares I use to make the game better. This version is SFW (safe for work) and doesn\\'t include links to mods with \\\"adult-only\\\" content (nudity, swearing and graphic violence).",
  "descriptionHtml": "Nick\\'s Skyrim Improvement Guide\r\nSafe For Work Version*\r\nBy\r\nNicholas van der Waard\r\n\r\n*This version simply contains none of the “adult content” mods (anything with nudity, graphic violence or vulgar language). I have removed all and any links linking to them.\r\n\r\n[i]Note: Thanks to a faux pas on my part, this page has none of the hyperlinks. If you want the hyperlinks, download the PDF. In the meantime, treat the text on this page as a preview to the actual guide. There\\'s only some much text the Nexus will allow me to post, so it might cut off, towards the end. To see the guide in its entirety, download the PDF.\r\n\r\nI will continue adding new mods to the top of this page. When I have enough of them, I will incorporate them into the PDF. I will not update the PDF every time I add a new mod, so check back here if you\\'re interested in updates. [/i]\r\n\r\nNew Mods: [url=http://skyrim.nexusmods.com/mods/29979]Lock Overhaul[/url]: A overhaul to the lockpicking in Skyrim that\\'s specially designed to work alongside SkyRe! Better yet, it comes with MCM (Mod Configuration Menu) support, as seen in SkyUI 3.0!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/30947]Dead Body Collision Fix[/url]: Make dead bodies behave like physical objects, which your character, or NPCs, can stand on or otherwise interact with, in-game, instead of walking through like smoke.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/30026/]Windmills resized[/url]: Make the woefully inadequate windmills of Skyrim a more appropriate size.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/29935]Realistic Mushrooms[/url]: Make your mushroom textures not only look better, but more realistic!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/30408]Kace Auto Loot - MCM Configureable[/url]: Add an auto loot function that you can modify in-game with the MCM menu that comes with SkyUI 3.0. Very handy.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/30411]Brows[/url]: Improve the textures of vanilla brows, as well as add new ones to the game. \r\n\r\n[url=http://skyrim.nexusmods.com/mods/29782]HD Enhanced Terrain[/url]: Make your distant terrain look grassier and more texture than vanilla. Other mods that alter distant terrain exist, but I like this one the best.\r\n\r\nGreetings, fellow Skyrim users! I made this guide with the intention of educating people who like to use mods; in other words, it isn\\'t in any shape or form a guide on how to make mods. Before I begin, I just wanted to say thanks to all of the people, the creators of these mods, software, and guides. Skyrim is a much better game for me thanks to you! : )\r\n\r\nDisclaimer: I am not a modder — i.e., someone that creates mods. I merely use them. I have spent many sleepless nights trying to get this damn game to work correctly with all of the mods on this list. Now that I finally have, I present to you a list of all the mods that I use (and a few handy tips) to deliver to you a version of Skyrim I consider to be far superior to the original, vanilla one. \r\n\r\nAgain, this is simply the way I play Skyrim. I downloaded all the mods in this guide off of the Nexus and recommend that you do the same. These people work hard on these, so make sure you respect their wishes. Don\\'t be shy about dropping by and endorsing their hard work! This includes my guide. If you like it, endorse it. : ) \r\n\r\nTable of Contents\r\n\r\nIa. Introduction \r\nIb. “ – NMM \r\nIc. “ – SKSE\r\nId. “ – Screenshots/Graphics\r\nIe. “ – Videos \r\nIf. “ – BOSS\r\nIg. “ – My Top Ten\r\nIIa. Gamplay Mods – SkyRe\r\nIIb. “ – Aside from SkyRe\r\nIIIa. Visual Mods — Weapons, Places, and Armor\r\nIIIb. “ – Weather Mods\r\nIIIc. “ – Character Makeover\r\nIV. Sound Mods\r\nV. Animation Mods\r\nVI. Follower Mods\r\nVII. Optional/Non-NMM (SkyProc) Mods\r\nVIII. Other Stuff\r\nIXa. Troubleshooting – CTDs and Instability\r\nIXb. “ – Additional Tips\r\nIXc. “ – Reinstalling Skyrim\r\nIa. Introduction\r\n\r\nThe reason this guide exists is because I was unhappy with vanilla Skyrim. \r\n\r\nPlease understand, the honeymoon was great; I played the game and fell in love with it. However, after my first couple of play-throughs, I started to notice things — how the game was very fairly ugly, how the combat didn’t have much depth, how many perks simply weren’t fun, imaginative, or balanced, or were just plain useless. It didn’t help that Bethesda was slow to release their patches and that these left much to be desired. \r\n\r\nIn a nutshell, the mods listed here make the game fun to play and to look at, and they all work together (with one or two exceptions). I will try to explain everything as comprehensively as possible, as to avoid turning this into a chore.\r\n\r\nImportant: I strongly recommend that any link you click on, you read that modder\\'s page very closely. He knows his mod better than I do and his page will contain important information in regards to installation/compatibility.\r\n\r\nIb. Introduction – NMM\r\n\r\nThese mods are, for the most part, all very easy to install*. Simply patch the game through Steam (my version is 1.8.151.0) and install Nexus Mod Manager (NMM). To do that, you have to register through the main site, here. It\\'s free and it takes two seconds. All you need is an e-mail and a password. Once you’ve accomplished that, download and install NMM. \r\n\r\n*For the ones that aren’t, I will try to include tips on how to install them.\r\n\r\nNext, go to the mod(s) you want on this guide, click on the hyperlink, and choose the “install with Nexus Mod Manager” option in the download options found on that mod’s page, on the Nexus.\r\n\r\nIc. Introduction – SKSE\r\n\r\nAlso before we get started, make sure that you install Skyrim Script Extender (SKSE — Google it). Why? Because many of these mods depend on it to work! Download, unzip, and place SKSE’s contents into your Skyrim Data directory (C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim). \r\n\r\nNote: Each time you want to play Skyrim, click on “skse_loader.exe” to launch the game through SKSE. A notification will pop up in-game to remind you, in case you forget. Important: You must do this every time you play or a lot of these mods won\\'t work!\r\n\r\nId. Introduction – Screenshots\r\n\r\nFor those of you who have seen the screenshots and are curious which graphics mods I use, the main ones include: Project ENB(full ENB) + More Rain +\r\nRealistic Lighting With Customization + More Snow + \r\n+ Supreme and Volumetric Fog + Enhanced Lights and FX. \r\n\r\nAlso, I have FOV (field of vision) set at 90*.\r\n\r\n*To change your FOV, go to console (hit `) and type (sans quotes) “fov X”, X being the number you want. \r\n\r\nMy system specs are: Vista, AMD athlon(tm) 64 X2 Dual-core Processor 6400+ 3.20 GHz, 4gb RAM, and a GeForce GTX 560. My nVidia drives are 306.97 WHQL. The game runs like a champ. Load times are quick. \r\n\r\nIe. Introduction – Videos \r\n\r\nHere are some videos demonstrating various mods from this guide used together in-game. I will add videos only for mods in which I feel screenshots don’t do proper justice.\r\n\r\nThis [url=http://www.youtube.com/watch?v=As0nCuEpaXE]one[/url] shows the character creation process using the mods CCC(Character Creation Overhaul), Live Another Life and SkyRe.\r\n\r\nThis [url=http://www.youtube.com/watch?v=Z1jSSPzEgTE]video[/url] demonstrates Ultimate HD Fire Spells* \r\n\r\n*Used with Project ENB, Realistic Lighting With Customization, New Animation for Magic Casting, Deadly Spell Impacts, Burn Freeze Shock Effects, and Dance of Death.\r\n\r\nIf. Introduction – BOSS\r\n\r\nBOSS determines the best way to configure your load order — the way that your mods are loaded in NMM. This is very important; if the mods aren’t loaded in the correct order, they won’t work, or worse, they can corrupt your save, which can cause CTDs (crashes to desktop).\r\n\r\nIf. Introduction – My Top Ten\r\n\r\nThere are a lot of mods in this guide, so I’ve decided to list the ten which I consider most essential. Each one improves a particular aspect of Skyrim.\r\n\r\n1. SkyRe – Improves, well, almost everything (except vampires, dragons, werewolves, followers, and horses)! : )\r\n\r\n2. Another Life – Lets you skip the Helgen sequence/start you character elsewhere.\r\n\r\n3. UFO – This mod changes followers from the ground up. Adds dialogue options, improves AI, and increases the number that you can have up to 15.\r\n\r\n4. RaceMenu: In the past, changing your character\\'s height, and introducing different hair colors and meshes into the game, would sometimes conflict with custom races. This mod eliminates the need to use a lot of other mods, works with SkyRe (and all the other mods on this list), and uses the current SkyUI format (3.0).\r\n\r\n5. Creation Overhaul – This mod makes awesome changes to character creation, including reintroducing Morrowind’s racial stats and birthsigns.\r\n\r\n6. Dragons Diversified – Improves dragons. Introduces new species, each unique.\r\n\r\n7. Personalized Music – Skyrim’s vanilla music isn’t bad, but this mod lets you add your own. With all the add-ons, you can add 900 tracks to your game that, should you choose, will play alongside Skyrim’s regular score!\r\n\r\n8. SkyUI – This mod makes many much-needed graphical improvements to your character’s item, vendor, and spell inventories.\r\n\r\n9. Categorized Favorites Menu – This mod improves the favorites menu, making it practical to use. \r\n\r\n10. Interesting NPCs – INPC introduces over a hundred NPCs throughout Skyrim, each with a unique story to tell the Dragonborn. Some have quests; some are followers; most have actual voice-recorded dialogue, and since the author is an audiophile, the quality of these recordings is superb. The writing is equally sublime (and at times intentionally hilarious). You care for these individuals. \r\nIIa. Gameplay Mods – SkyRe\r\n\r\nBefore I go over anything else, I simply have to cover SkyRe. This mod, for all the wonderful changes it makes, doesn’t touch horseback riding, dragons, followers, werewolves, or vampires. However, I have included many mods in this guide that do which are also compatible with SkyRe.\r\n\r\nSkyRe: This is hands down my favorite Skyrim mod, ever. Why? Some mods affect the weather; give the men cool-looking swords, and the women bigger boobs. One even turns the moon into the Death Star. This mod, however, ignores fashion in favor of function; it takes the most important part of Skyrim — the gameplay — and improves it beyond recognition. Plus, it\\'s modular, so if you want to install only part, you can. \r\n\r\nThere\\'re more changes than I can easily list. To find out more, simply click on the link and check out his page.\r\n\r\nNote: Along with this mod, I recommend Skyrim -Community- Uncapper. If you use it, replace the “skse_elys_uncapper.ini” that comes with it with the modified one from “Uncapper Config” on the SkyRe downloads page; doing so will make the game more of a challenge.\r\n\r\nImportant: Certain portions of this mod require a new save game to work correctly! There\\'s really no way around this. To make full use of this mod, start a new character. \r\n\r\nIIb. Gameplay Mods – The List\r\n\r\nThese mods affect the gameplay (user interface, new races, character creation, and new items/quests) and ultimately make Skyrim more fun. \r\n\r\nA Quality World Map: This mod makes the world map look much better, adding much-needed details, most importantly roads (a lot of them). \r\n\r\nAnother Life: Let\\'s you skip the Helgen intro sequence, but also lets you choose where you want your character to start. You can start out as vampire or a Forsaken, start in a Guild, own a house, and so on... \r\n\r\nAuto Unequip Arrow: Makes you character and NPCs automatically unequip their quivers when not wielding a bow. \r\n\r\nBelua Sanguinare: A very cool, in-depth mod that makes sweeping changes to vampirism, but stays consistent in its delivery. \r\n\r\nNote: It comes with a potion that you can drink to turn yourself into a vampire. \r\n\r\nImportant: Do not try to use this mod with a pre-existing vampire character.\r\n\r\nBetter MessageBox Controls: Make the entire message box clickable! Use the arrow keys to navigate, as well as the Y and N keys to answer yes or no questions!\r\n\r\nBetter Quest Objectives: This mod makes the quest objectives more comprehensive — handy for newer players.\r\n\r\nBring Out Your Dead: Add missing cemeteries to Skyrim. Various unique NPCs will be interred at these final resting places when their time comes. \r\n\r\nBromjunaar and the Wooden Mask: With this mod installed, you can use the wooden mask to teleport to the Bromjunaar Sanctuary from anywhere in the world, even from a dungeon. It makes the mask more useful, in general, but also negates the need to own a house.\r\n\r\nCart in Every Big Town: Once installed, a cart will be placed in all of the big towns. However, it also enables you to ride to the hamlets, like Dragon’s Bridge and Riverwood. \r\n\r\nCartographer Map Markers: Add 180 map markers to the game. Very handy for those of you who always wanted to fast travel to all those little niches that vanilla Skyrim didn\\'t bother to include on the world map, like shrines.\r\n\r\nCategorized Favorites Menu: In all fairness, SkyUI is great, but it doesn\\'t do squat to improve the favorites menu. \r\n\r\nNote: If using SkyRe (which you should — it\\'s awesome), make sure to download the compatibility version of this mod.\r\n\r\nCreation Overhaul:  By bringing back birthsigns*, classes, specializations, favored attributes, and major/minor skills to Skyrim, choice matters again. \r\n\r\nNote: It is compatible with the racial module of SkyRe, as well as Live Another Life.\r\n\r\nImportant: As far as I can tell, this mod will not work with old characters. Remember to open the book and “write” your character\\'s history when you first make him, or the mod won\\'t go into effect! \r\n\r\n*For even more fun, use the “permanent birthsign” option. It makes the sign you pick at the start the one that you keep; you won\\'t be able to access the standing stones to change it! \r\n\r\nConvenient Horses: The most complete horse mod out there! \r\n\r\nCraftable and Placeable Havok-enable Bedrolls: Imagine having bedrolls that you can make, drop on the ground anywhere you like, and sleep on. This mod gives you those. \r\n\r\nThe Dark Brotherhood Resurrection, part 1: Ambitious mod that adds a 4-hour long campaign after the Dark Brotherhood questline. Includes 2 new followers and oodles of voice-acted dialogue!\r\n\r\nDiverse Guards Skyrim: Equal opportunity employers have arrived in the holds! As a result, the cities and villages will now be guarded by more women.\r\n\r\nDragons Diversified: Vanilla dragon fights were boring. All the dragons fought the same way and the tougher ones simply had more health and did more damage. This mod makes dragon fights dynamic and interesting with 13 new breeds. Each is randomly selected, and feels unique and puzzling to defeat. \r\n\r\nDrow Race: A custom race that’s basically a dark elf, except cooler-looking (silver tattoos). \r\n\r\nNote: It also comes with a child version (though oddly sexually mature for a child).\r\n\r\nGildergreen Regrown: With this installed, the sapling received for following the path of renewal in the Blessings of Nature questline will actually grow into a tree! Granted, it takes 6 months…\r\n\r\nHigher Bounties for Crimes: A mod that makes the punishment for crimes in Skyrim much more expensive. For example, to pay off a murder now costs between 10,000 and 15,000 gold (!). \r\n\r\nNote: Comes with a static version, where the bounties between the holds are all the same, and a version where each hold has custom bounties. \r\n\r\nImmersive Armors: This mod not only introduces a ton of brand-new armor sets to Skyrim, but has a compatibility patch for SkyRe. \r\n\r\nImmersive HUD: Appreciate the graphics of your game a lot more! This mod makes the crosshair reactive, disables your health, magicka, and stamina bars while each is full, and adds a toggle to the compass. \r\n\r\nImportant: No matter what, make sure to update SKSE before installing this. Otherwise, the mod won\\'t work.\r\n\r\nImmersive Patrols: This mod adds spawnable, scalable patrolling mobs to Skyrim\\'s outdoors environments. In vanilla, you never saw the Stormcloak rebels tussling with the Imperials. Now that you do, it makes it feel like there’s actually a rebellion going on.\r\n\r\nNote: No scripts, meaning it\\'s really easy to install and safe to uninstall, and is compatible with practically all other mods. \r\n\r\nIncreased Bounty and Guild Rewards: The only mod I could find that actually increased the amount of gold you receive from quests (as far as I know, even SkyRe doesn\\'t do this). \r\n\r\nInteresting NPCs: Add dozens of new NPCs to the game, with new quests and voice-actors (!). The quality of the voice-acting is very good, as is the writing. The vanilla characters pale in comparison.\r\n\r\nUpdate: Unfinished, so some of the NPCs don\\'t have voices, yet. If you want to help, the modder is currently looking for voice-actors to complete unrecorded roles.\r\n\r\nKhajiit Speak: A mod for all you cat-lovers out there, this changes all of the PC dialogue to sound more like how khajiits actually talk. \r\n\r\nNote: This is not race-sensitive and will affect your Nord or Breton, too, so only install it when playing a khajiit, unless you like sounding like a cat all the time. \r\n\r\nLong-Lost Smelters of Skyrim: Put a smelter in all of the big cities, and some of the hamlets, including Riverwood. \r\n\r\nMighty Dragons: Make dragons and/or dragon priests stronger in a variety of ways, including increased health, resistances and regeneration. \r\n\r\nNote: Script-free, meaning it’s totally safe to install/uninstall whenever you want. Also, it works fine with SkyRe, which doesn\\'t affect dragons/dragon priests.\r\n\r\nImportant: If using Dragons Diversified with this mod, don\\'t forget to install the compatibility patch!\r\n\r\nModern Day Calendar Names: Change the names of the months and days in Skyrim with the ones we use, here on Planet Earth. \r\n\r\nNew Severus Collection Jewelry: Let the Dragonborn craft a ton of really cool-looking jewelry. It\\'s mostly aimed at women, but men do get 4 items. \r\n\r\nNote: Use Severus Jewelry Collection Merchant if you don\\'t feel like going through the trouble of crafting the jewelry, but don\\'t want to use the console to cheat. It places Svetlana, a merchant, at the Winking Skeever tavern, in Solitude.\r\n\r\nNo Boring Sleep-Wait Menu: Improve the look of the wait menu, but also enable yourself to wait 744 hours (31 days) instead of the vanilla 24-hour limit. \r\n\r\nNon-Essential Killable Children: Anyone else annoyed by the fact that you couldn\\'t kill these annoying little bastards, but little old ladies were fair game? This mod fixes that. Now you can kill little kids and old ladies! \r\n\r\nOwned: Makes it so that the taking of owned items will not be considered stealing after that person is dead. The same applies for owned beds, which conveniently become available to the public once the owner is six feet under.\r\n\r\nOre and Ingots Merchant: This mod places a merchant right next to the stables outside of Whiterun that will sell you every type of ingot, ore and soul gem. \r\n\r\nPerk Reset - SkyRe Compatible: Place a special shrine near the 3 Guardian Stones to the south of Riverwood, which you can use to reset your perks. It\\'s not instant, and requires dragon souls to use. \r\n\r\nNote: Keep in mind, this mod resets your perks, not your stat points (magicka, health, and stamina) or race. \r\n\r\nImportant: When installing this mod, change the extension of “PerkReset” from .esp to .esm. Then, install the Skyre compatibility patch. \r\n\r\nUpdate: The latest version of SkyRe will give your character a “respect potion,” which you can drink to reset your character’s perk points. However, I’ve kept this mod on this list for those who don’t like to cheat/want to have a different use for their dragon souls.\r\n\r\nPlayer Headtracking: Ever wonder why NPCs follow you with their gazes, but not the other way around? This mod remedies that. \r\n\r\nPossessive Corpses: Vanilla Skyrim has several in-game issues that can lead to a bloated save, which means longer load times! This mod attacks the “root” of the problem.\r\n\r\nPredator Vision - Vampire and Werewolf: Add night/thermal vision to your vampire/werewolf characters. This mod will grant lycanthropes night vision when in human form (not thermal vision, however).\r\n\r\nImportant: Requires SKSE. Also, if you\\'re a werewolf, your thermal vision can only be used in your beast form. The default keys are \\'b\\' for thermal and \\'n\\' for night vision. If you use Tales of Lycanthropy, whose default key to cycle between shouts is \\'b\\', you\\'ll need to change the default thermal vision key to something else. \r\n\r\nPuppet Master: Imagine having total control over NPCs, being able to dictate their actions, stances, behaviors, facial expressions — even override their AI... \r\n\r\nRaceMenu: In the past, changing your character\\'s height, and introducing different hair colors and meshes into the game, would sometimes conflict with custom races. This mod eliminates the need to use a lot of other mods, works with SkyRe (and all the other mods on this list), and uses the current SkyUI format (3.0).\r\n\r\nRealistic Crime Radius: For those of you who like to commit crimes, this mod is for you! : ) \r\n\r\nRun For Your Lives: This mod adds scripts that make it so that villagers take shelter during a dragon attack, instead of standing out in the open and getting killed. \r\n\r\nSkyforge Shields: This mod introduces a bunch of really sweet-looking shields that the player can make at the Skyforge.\r\n\r\nSkyTest, Realistic Animals and Predators: Ask yourself, what if animals actually behaved like animals? With this mod, they do. \r\n\r\nSkyUI: Hate the vanilla user interface? So do I. The SkyUI version is much more attractive and functional. \r\n\r\nUpdate: SkyUI version 3.0 is out! It comes with a slew of new features, including in-game mod configuration, enabling you to configure mods such as Predator Vision and Wet and Cold in-game!\r\n\r\nSkyrim Grammar Hammer: Here\\'s a mod that grammar enthusiasts can get into! It fixes all of the many grammatical errors found in Skyrim\\'s vanilla load screen messages.\r\n\r\nTales of Lycanthropy: I always thought that werewolves got the poop end of the stick in vanilla Skyrim. This very cool mod makes a bunch of innovative changes that helps improve our furry friends. My favorite is that it adds a lunar cycle. \r\n\r\nImportant: This mod requires Script Dragon.\r\n\r\nThe Paathurnax Dilemma: Grant yourself the option to tell the Blades to spare Paarthurnax\\' life, instead of killing him, at the end of the game’s main quest. \r\n\r\nNote: Paathurnax thanks you for using this mod.\r\n\r\nTK Dodge: Remember in Castlevania: SOTN how Alucard could dash backwards? This mod gives you something similar. Be warned, it consumes stamina.\r\n\r\nImportant: Requires the latest versions of SKSE and Script Dragon to work.\r\n\r\nTraining per Level: I love this mod, because it lets you change the number of times you can train per level, all the way up to 50.\r\n\r\nTribunal Robes Set: Introduces high-quality tribunal robes to the game, for both genders, in different colors, as well as many very cool-looking masks!\r\n\r\nUnread Books Glow: Books you haven\\'t read will glow. It can be adjusted in-game to influence skill books exclusively. \r\n\r\nWearable Lanterns: Add an item slot that you can use to equip lanterns with, including the nifty torchbug lantern (which works underwater!). \r\n\r\nNote: Wearable Lanterns is compatible with UFO and lets you give said lanterns to your followers, who you can tell how and when to use them. \r\n\r\nWerewolf Perks Expanded - Dawnguard: Add more perks to your werewolf tree. \r\n\r\nWerewolf Followers: Always wanted a werewolf friend to chew faces with? Give your followers the “gift.”\r\n\r\nWhen Vampires Attack: Done by the same modder who did Run For Your Lives, this mod affects vampires instead of dragons. \r\n\r\nYet Another Werewolf Improvement: Make your werewolf recover to full health and experience invulnerability when transforming! Enjoy boosted health regeneration! With this mod, the ability Beast Form is suddenly much more viable to use in mid-combat. \r\n\r\nIIIa. Visual Mods – Weapons, Places, and Armor \r\n\r\nThese mods make the game look better. \r\n\r\nNote: A nifty feature of NMM is being able to combine texture and mesh mods, thus enabling you to install them all at once. To do this, download all of the mods you want to combine, extract and place them into one Data folder. Zip it, rename it to whatever you want, and place it into your NMM “mods” folder. Activate your new “mod,” and all of the texture and/or mesh mods should be installed in one click.\r\n\r\nA Complete re-texture for Studded Armor: This mod re-textures studded and hide armor and both look excellent.\r\n\r\nUpdate: Cabal, the author of many great texture mods, has released a hide/studded retexture of his own.\r\n\r\nA highres 2048x Glass armor and weapons: Made because he “hates green,” this author’s mod features high-res textures for the glass armor and weapon set. \r\n\r\nNote: I recommend the “Dark and cyan” and “Dark and Cyan Weapons and Shield”\r\n\r\nAdvanced Alloys - Dwarven Bow and Quiver: Here, we have an excellent retexture mod for the dwarven bow (still the best one on the Nexus, in my opinion).\r\n\r\naMidianBorn Textures For Immersive Armors: Grant your Immersive armors the textures used from Book of Silence!\r\n\r\nApophysis Dragon Priest Maks WiP: The mod, Psychosteves DragonPriest Masks, retextures all of the dragon priest masks without straying too far from the vanilla look. This mod, on the other hand, is much more ornate and highly-detailed.\r\n\r\nArmored Odahviing: Deck out your summoned dragon in daedric armor! \r\n\r\nNote: The author and I both recommend using Daedric Armor and Weapon Improvement. \r\n\r\nBetter Circlets HQ: Now here\\'s what circlets should look like! \r\n\r\nBellyaches Animal and Creature Pack: This high-quality retexture mod is for many of Skyrim\\'s animals, including werewolves. \r\n\r\nNote: Use with NMM to access the FOMOD installer. \r\n\r\nBirds and Flocks: A simple mod that adds a very cool effect to the game: flocks of birds (and bats for dungeons). This did exist in vanilla, but it was very rare.\r\n\r\nBlacksmith Forge Water Fix: A successful fix to an old problem: static water in the smithy troughs. This will replace them with actual water (which dropped items will sink into). It affects all big cities, hamlets and the Skyforge. Handy mod, as this is not yet included in W.A.T.E.R..\r\n\r\nUpdate: As of this moment, this is still not included with W.A.T.E.R.. : )\r\n\r\nCabal’s Book of Silence: A collection of texture mods from one of the best texture modders on the Nexus. \r\n\r\nUpdate: Unfinished, but as of this moment, Cabal is in the process of introducing new armors. Stay tuned.\r\n\r\nCartoon Nightingale Armor HQ: Personally, I always liked this retexture of the Nightingale armor the best.\r\n\r\nCloaks of Skyrim: Add cloaks to the game, equipping NPCs with them, but also placing special cloaks throughout the world for you to collect. It\\'s not just cosmetic; some of the cloaks have special stats, such as magic resist.\r\n\r\nUpdate: With the introduction of XP32 Maximum Skeleton - XPMS, cloaks will now animate!\r\n\r\nDark Nemesis Armor: With this mod installed, ebony armor will look badass. No other mod comes close.\r\n\r\nDeadly Spell Impacts: Makes spell impacts look different, depending on which spell-type you use.\r\n\r\nDaedric Armor and Weapon Improvement: This great mod affects the daedric weapons/armor set. Also comes with multiple options. \r\n\r\nElegant Nocturnal HQ 4096: A sweet, sweet high-res texture for the nocturnal robes. \r\n\r\nEgyptian Elven Retexture Pack Complete: An oldie but a goodie! Give it a shot!\r\n\r\nEquipment Of Eternal Shine - Elven Overhaul: This mod, done by the same modder who did Dark Nemesis Armor, makes the elven armor and weapons sets silvery and adds a distinct blue glow. \r\n\r\nElven Armor Retexture Mod: Another unsung hero of the texture mod world, this time for elven armor. \r\n\r\nEzEs – Colored Map Markers: Color your map markers! \r\n\r\nFtoppka Realistic Smelter: This mod makes the smelters look like actual smelters instead of the bread ovens we got in vanilla Skyrim. \r\n\r\nGlowing Ore Veins 300: Make it so you can actually see the ore veins scattered throughout Skyrim. \r\n\r\nGreatsword Sheathes and Scabbards: Swords are made to be sheathed. This mod adds scabbards and sheathes to all of your 2-handed swords. \r\n\r\nGrey Orcish Weapons and Armor: Even now, almost a year after its release, there aren\\'t too many mods that make vanilla orcish textures look better. This mod succeeds. \r\n\r\nNote: The optional file “Grey armor with chainmail” also changes the quilted sleeves and leggings into chain mail. As a result, the armor looks a lot more protective.\r\n\r\nHvergelmirs Steel Armory: For those of you looking for an alternative to Cabal120\\'s Book of Silence armor retexture mod, or Millenia\\'s ostensibly discontinued Weapon Retexture Project, look no further. \r\n\r\nHQ Beards: Here’s a nice little mod that makes the beards of Skyrim males high-res. \r\n\r\nHQ Ingots: Replace the crappy vanilla ingots and ore textures with excellent, made-from-scratch, high-quality ones. \r\n\r\nNote: Super Realistic Ore Textures has more endorsements, but I prefer the ore textures in this one, plus you get the sweet-looking ingot textures.\r\n\r\nImproved NPC Clothing - High Res: Drastically improve many of the clothing outfits in the game.\r\n\r\nInsanitys Pale Blade: A very cool re-envisioning of the Pale Blade. Check out all his mods!\r\n\r\nLa Femme Lycana Female Werewolf Body: Makes the female werewolf body look distinctly feminine (“sexually dimorphic,” in the modder\\'s own words) without making it overly sexualized (no nipples or bush). \r\n\r\nKenMOD Time on Loading Screen: Adds a clock to the loading screen.\r\n\r\nMain Menu Spinning Emblem: Replaces the static dragon emblem in the main menu with a 3D spinning one. \r\n\r\nMore Saddles: Adds a bunch of really cool-looking saddles to Skyrim. \r\n\r\nNavi Cursor Mod: Hey, listen! Replace the cursor with Navi the fairy from The Legend of Zelda: Ocarina of Time. She animates and sparkles! \r\n\r\nNPCs of Dibella: A new version of the mod Dibella\\'s Beauty - NPC Overhaul, the main change being that it makes the changes to hair NPC-only so it won\\'t crash the character creation menu by loading too many hairs at once.\r\n\r\nNo Menu and Loading Smoke: Removes the white fog from the main menu screen and load screens. This is particularly handy when using ENB mods, which, for some reason, make the smoke look awful.\r\n\r\nOpen faced Helmets: Make several helmets open-faced, including the guards’. \r\n\r\nPsychosteves Dragon Priest Retex Mod: This mod improves the look of the dragon priest masks, without making them look ostentatious.\r\n\r\nRealistic Ragdoll: Makes the ragdoll effect much better. You and others will flop like a fish when you die.\r\n\r\nUpdate: The skeleton from XP32 – Maximum Skeleton works with this mod.\r\n\r\nSkyforge Shields: This mod introduces a bunch of really sweet-looking shields that the player can make at the Skyforge.\r\n\r\nSkyrim Weapon De-LARP-ification: Make many of the sword and axe blades much thinner. The author thought that the ones we got in vanilla were a tad too thick to be considered realistic. \r\n\r\nSpells Will Give Off Light: Grant your spells (and others\\') the ability to generate light. Since your spells are given their own light sources, their light will generate real-time shadows*!\r\n\r\n*Warning: This can be rather demanding on weaker systems.\r\n\r\nSoul Gems Differ: Make soul gems look different depending on if they have soul gems in them or not. \r\n\r\nImportant: This mod must be installed through NMM! \r\n\r\nStatic Mesh Improvement Mod: Improve the horrid meshes used in vanilla Skyrim without taking it out on your system. Again, zero performance loss. \r\n\r\nUltimate HD Fire Spells: Unlike Cinematic Fire Effects, which merely makes the vanilla textures high-def, this mod changes the fire textures, making them look much different. It affects all fire in the game, including spells, campfires, and torches! \r\n\r\nUnique High Definition Textures - UHDT: This mod includes HD textures for every vanilla weapon in the game, with an add-on for Dawnguard. There are plenty of texture mods that I use, already, but many weapons have still been neglected, and that\\'s where this mod comes in. The textures are quite good, if slightly plain, and they don\\'t stray too far from the vanilla aesthetic. \r\n\r\nVisible Windows: Makes the windows look better. \r\n\r\nImportant: This mod must be installed through NMM!\r\n\r\nW.A.T.E.R.: Improve the water of Skyrim beyond recognition.\r\n\r\nImportant: This mod must be installed through NMM!\r\n\r\nWolf Armor Remix Male and Female: Upgrade the wolf armor worn by the Companions. \r\n\r\nYuril Rings HQ: “One Ring to rule them all…” This one aims to improve all of the rings in Skyrim. \r\n\r\nIIIb. Visual Mods – Weather and Lighting\r\n\r\nThese mods change the look and behavior of Skyrim’s rainstorms, snowstorms, fog, interior and exterior lighting.\r\n\r\nClaralux\\' More and Brighter Lights: A mod that adds to the number of light sources in the world, including torches, campfires, and lamp posts.\r\n\r\nNote: Customizable in-game. \r\n\r\nCity Relighting : A script that makes it so that the torches in the bigger cities extinguish during the day and relight themselves at night.\r\n\r\nNote: Pays no attention to rainy weather.\r\n\r\nEDWS - Enhanced Dynamic Weather System: “It can\\'t rain all the time...” Increase the likelihood that snow or rain will fall, but also make it less likely that it will be cloudy or sunny. \r\n\r\nNote: All options are compatible with the other mods in this section. Doesn’t work with Climates of Tamriel.\r\n\r\nImportant: This mod must be installed through NMM!  \r\n\r\nEnhanced Lights and FX: Many of the lights in vanilla Skyrim did not behave like lights. Mainly, they wouldn’t generate shadows. Now, they do. Moreover, he’s introduced smoke, volumetric lights, and other effects to really transform your interiors. \r\n\r\nNote: Use this with Realistic Lighting With Customization (and an ENB mod of your choice) for maximum effect.\r\n\r\nFootprints: A game filled with snow and no footprints? This mod fixes that. \r\n\r\nGet Snowy: Make your character get covered lightly in snowflakes when it snows.\r\n\r\nImmersive Thunder: This mod affects the thunderclaps that you hear during a thunderstorm, making them much more random and varied.\r\n\r\nNote: Not compatible with Climates of Tamriel.\r\n\r\nImproved Weapon Impact EFFECTS Correct Metal: Instead of having it be dust when you miss your target and strike that stone wall, you will get sparks (complete with their own light source!).\r\n\r\nINSS New Skyrim Shadows: This isn\\'t a mod, but a tweak to your SkyrimPrefs.ini* file that focuses on shadows, more specifically their distance draw and sharpness.\r\n\r\n*When you launch the game for the first time, the Skyrim launcher will create a “SkyrimPrefs.ini” file in the directory “C:\\\\Users\\\\User\\\\Documents\\\\my games\\\\skyrim”. Modifying this file will make the game look different, but you need to be careful, or you can make Skyrim unstable. If you ever feel like you’ve made a mistake and wish to start anew, simply delete “SkyrimPrefs.ini” and restart the launcher to create a fresh version of “SkyrimPrefs.ini” using the launcher’s base settings. \r\n\r\nLightning During Thunderstorms: This mod, which can be used with or without Climates of Tamriel*, makes lightning visible; lightning bolts streak across the sky and light up the ground! Also, even cooler, if you’re indoors and a storm is going on outside, the cave entrance/windows will light up periodically!\r\n\r\n*It requires a compatibility patch, if you do.\r\n\r\nMore Rain*: Make the rain fall harder, the wind gust fiercer, and the visibility decrease radically! \r\n\r\nMore Snow*: Works just like More Rain, except it modifies snow. \r\n\r\n*Use with Realistic Lighting With Customization and/or an ENB mod of your choice to achieve optimal results. These mods must be installed through NMM! Neither is compatible with Climates of Tamriel. \r\n\r\nRainbows: “Somewhere over the rainbow…” : ) Introduce rainbows (and double rainbows) to Skyrim, which appear after any rainstorm. \r\n\r\nReal Rain: Retexture the rain drops.\r\n\r\nRealistic Lighting With Customization: A non-ENB graphics mod that affects lighting in-game, RLwC stays within the confines of the game\\'s graphics engine, which means little or no drop in performance. \r\n\r\nShooting Stars: Watch the skies! Add shooting stars to Skyrim\\'s skyline, which appear at specific dates. \r\n\r\nSupreme and Volumetric Fog: Make the fog in-game look less like vanilla and more like Silent Hill. Spooky!\r\n\r\nWarning: This mod can make it hard to see anything during foggy weather.\r\n\r\nVibrant Auroras: Like the title says. \r\n\r\nWet and Cold: Add a number of cool weather effects to Skyrim, including steamy breath, NPCs taking shelter from the rain, and much more!\r\n\r\nIIIc. Visual Mods – Character Makeover \r\n\r\nThese are mods that boost the look of the Dragonborn and the NPCs’ general appearance. \r\n\r\n\r\n\r\nApachiiSkyHair: In my humble opinion, the hair in vanilla Skyrim looked like poop. This mod remedies that — with a vengeance!\r\n\r\nNote: Don’t be afraid to use this with Skyrim NPC Editor.\r\n\r\nArgonian Improvements - Horns: For all you horny lizards, this little mod makes your horns look that much better! : )\r\n\r\nBetter FaceGen: If only your character’s face, mouth and nose appeared smoother and less blocky! They can with this mod!  \r\n\r\nCoverKhajiits: Makes the cats prettier (their faces only). \r\n\r\nEyebrows Match Hair: Tired of having a blonde character with black eyebrows, or a redhead with blonde ones? This mod resolves that issue.\r\n\r\nFemale Vampires Have Fangs: I always thought it odd for female vampires in vanilla Dawnguard not to have fangs. Give your ladies’ bites some teeth. \r\n\r\nGrimoas Plantigrade Feet for Beast Races: Are you a fan of the beast races, but disappointed that both got stuck with normal, boring human feet? Fret no more! Argonians get 3-toed feet with huge, thick claws. The khajiit get 4-toed paws, with the claws extended.\r\n\r\nunivision Face: The faces mod that I use. Try it, or perhaps Better Females by Bella. Both are fine.\r\n\r\nIV. Sound Mods.\r\n\r\nThese make the game sound better, be it the music, spells, or voices. \r\n\r\nBetter Horse Pain Sounds: Make it so that your horses don\\'t scream loudly when injured, scaring the poop out of you while you\\'re riding.\r\n\r\nBrave Female Voice Replacer: Replace the vanilla sounds of the PC female Nord, Breton, Imperial and Redguard voices, making them sound feminine-yet-tough (there\\'s a sample of it, here). \r\n\r\nCharming Female Voice: Same idea as Brave Female Voice Replacer, except it replaces the vanilla elf voices, making them sound cuter.\r\n\r\nClanking Armor: Your footsteps will make a clanking sound if you’re wearing heavy armor. \r\n\r\nDagger Remastered: A collection of remastered Daggerfall tunes. I for one love these and think that they really add to the game’s atmosphere.\r\n\r\nNote: These are already in .xwm format and will work with Personalized Music. They just have to be renamed and placed in the proper folders.\r\n\r\nGuard Dialogue Overhaul: Remove sarcastic guard responses in place of more “reactive” observations. Sentries will respond to the feats of your character as opposed to saying irrelevant or rude things.\r\n\r\nImproved Combat Sounds : Make Skyrim’s lackluster combat sound f/x sound very meaty.\r\n\r\nLevel-Up Sound Everquest DING: DING! Hey, gratz! Thnx! Replace the vanilla Skyrim level-up sound with the classic “ding!” sound from the old school MMORPG, Everquest. \r\n\r\nMain Menu Music Replacer - Malukah: Want to replace the vanilla Skyrim chant heard in the main menu with Malukah\\'s awesome recording? Now you can.\r\n\r\nMerchants Only Reply With “Take a look.” : The phrase “Some call this junk, I call it treasures” really, really started to get old after the hundredth listening…\r\n\r\nMimi Page Dovahkiin Female Victory Chant: This excellent-sounding mod enhances the sounds and music that play after you kill a dragon. Audiophiles, take heed, the audio quality is superb. \r\n\r\nMimi Page Dovahkiin, Secunda: Here we have a re-recording of one of the exploration themes, Secunda. Everything is recorded live and sounds lovely.\r\n\r\nPersonalized Music: This very awesome mod places folders in your music directory which you can fill with.wav or .xwm files. \r\n\r\nNote: You can still override music manually if you want, but this mod allows you to play your music alongside the game’s (the override method was fairly limited, seeing as you could only replace the music). \r\n\r\nPhendrix Magic Sounds: Silence is golden! I found the vanilla sound effects left much to be desired. This mod softens and deepens many of the more obnoxiously high-pitched spell noises. Some are silenced completely.\r\n\r\nRealistic Werewolves : The only decent mod I could find that modifies a werewolf\\'s howl and actually succeeds in making it sound bad-ass. \r\n\r\nNote: This mod also increases werewolf speed. If it gives you trouble, simply download the “sound-only” version, instead. \r\n\r\nSkyrim Player Revoiced - Elven Races Complete - Male: Makes the PC elf males sound less manly and more like Link from The Legend of Zelda games. \r\n\r\nSounds of Nature Redux: Seeing as Sounds of Skyrim is currently hidden, this is the mod that I use, instead. \r\n\r\nThundering Shouts: Fus-Ro-Dah! : ) Make shouts sound deeper and thunderous.\r\n\r\nV. Animation Mods\r\n\r\nThese mods make the game’s characters, PC or NPC, animate better. \r\n\r\nBowlegged Jump Animation Fix: Make your PC jump less oddly that he/she would in vanilla.\r\n\r\nDSAMG - Dragon Soul Absorb More Glorious: A mod that has the potential to change the music you hear when your character absorbs a dragon soul, as well as the animation. \r\n\r\nNote: I already use Mimi Page Dovahkiin Female Victory Cry, so I merely use the script from this mod that changes the animation; there are 5 to choose from, and I use “IV - Script - Ascension Animation”.\r\n\r\nFemale City Guards feminine walk: Lend the female guards a girlier gait.\r\n\r\nNote: Lots of fun when combined with Diverse Guards Skyrim and Catwalk.\r\n\r\nFeminine Running Dash Animation*: Makes the female dash animation more sprint-like.\r\n\r\nImportant: Must be installed through NMM! \r\n\r\nMartial Arts: Add cool martial arts animations to your jumps/unarmed power attacks! Feel like a tough-guy as your character pulls off fancy-yet-devastating spin hook kicks, jump-spin crescent kicks, and more!\r\n\r\nMomo Acrobatic Jump*: With this installed, your character will leap forward and flip backward. \r\n\r\nNew Animation For Get Up*: Instead of taking ages to get up, your character will do a kick-up, getting to his or her feet much faster, and with style. I love this mod; seeing as I use SkyRe, it has saved my life more than few times (2-handed-wielding enemies can knock you to the ground with a power attack).\r\n\r\nNew Animation For 1-handed Weapon*: Kill several birds with one stone! \r\n\r\nNote: Affects the one 1-handed weapon and a shield, a 1-handed weapon and one casting hand, and dual spells animations. \r\n\r\nNew Animation for Running with Bows*: With this mod installed, your female character will hold her bow a little more gracefully.\r\n\r\nNew Animation for Magic Casting: This as-of-yet-incomplete mod features various casting animations.\r\n\r\nNo Spinning Death Animation: Make it so your character ragdolls hilariously when he/she dies.\r\nRR Motion Replacer: Use this animation mod to change the way your character holds her 2-handed sword. \r\n\r\nNote: Changes the 2-handed sword idle animation. Doesn\\'t affect the 2-handed animation for hammers or axes. If you don\\'t want to add the other animations that come with, install the mod manually.\r\n\r\nXP32 Maximum Skeleton - XPMS*: A powerful update to the skeleton model, aiming to eliminate incompatibilities with different animation mods. Here, we have a very versatile skeleton, which supports all of the animation mods on this list. \r\n\r\nNote: It works with all of the author\\'s mods, and comes with DSpSoB - Dual Sheath plus Shields on Back**.\r\n\r\n*Made by xp32. For those of you who like his mods, he has all of them installed into one package: New Animation Pack***. \r\n\r\n**DSpSoB will not work with any mod that modifies races. Seeing as SkyRe modifies races, they are considered custom, and DSpSoB needs to be modified in order to work with them.\r\n\r\n***Important: Requires FNIS!\r\n\r\nYY Anim Replacer - Zweihander: Hold your 2-handed hammer/sword much like Cloud did his Buster sword from FF7, among other things. \r\n\r\nNote: Affects Idle, Equip, Block, Turn, Walk, Run and Sprint animations.\r\n\r\nVI. Follower Mods\r\n\r\nThese are mods that affect followers or add new followers to the game.\r\n\r\nCerwiden - SMART Healer - AI Config Companion: Cerwiden is a one-of-a-kind companion who you can customize through dialogue, much like UFO, but even more so.  \r\n\r\nOdvar the Afflicted: Meet Odvar, an afflicted. He is “quest-aware,” meaning he knows what part of the main quest you\\'re on. His custom-recorded dialogue will reflect this. He also barfs on people.\r\n\r\nUnique Female Followers*: Another mod similar to Fabulous Followers* that grants the user more unique followers in-game — no prerequisites needed! Simply download through NMM, activate, and play! \r\n\r\nUltimate Follower Overhaul (UFO): Have up to fifteen followers 15 at once! Better yet, you can configure each one individually through dialogue options. I honestly think that this is the best follower mod on the planet. \r\n\r\nVilja in Skyrim: A companion mod that, as far as I can tell, seems very similar to the Cerwiden mod; Vilja comes with custom dialogue (4000 lines!), quests, and customizable AI, and she can interact with vanilla followers and other NPCs. Obviously, a lot of work went into this mod, and the amount that you can do with this character goes far beyond the pale. \r\n\r\n*Bear in mind that anytime you install unique follower mods like these they come with a whole bunch of unique textures, as well. After you install them, don\\'t forget to use Optimizer Textures to keep your computer happy. This is especially important if you use UFO and have multiple followers onscreen.\r\n\r\nVII. Optional/Non-NMM (SkyProc) Mods \r\n\r\nMods that I consider worthwhile, but take just a little bit more effort to install than the ones mentioned above. These include SkyProc mods.\r\n\r\nAcquisitive Soul Gems: A plug-in that makes it so that a soul gem will not accept a smaller soul. \r\n\r\nNote: Doesn\\'t install through NMM. Simply drop the plug-in in the SKSE plugins folder and it should work. To uninstall, remove the file.\r\n\r\nAutomatic Variants: Once installed, you will get different textures for the same monsters, instead of encountering the same-looking ones over and over. \r\n\r\nImportant: Run the patcher every time you install new textures that affect creatures, or Skyrim will crash at the main menu.\r\n\r\nDual Wield Parrying: This very cool mod that makes it so that you can parry while dual-wielding. \r\n\r\nNote: Requires a program called Script Dragon to work. \r\n\r\nImportant: If using this mod, don\\'t forget to download and install Dual Wield Blocking Animations, too!\r\n\r\nReProccer - Automated SkyRe patch generator: This mod enables you to add the values of items made independently from SkyRe to work with SkyRe. If you use SkyRe and a lot of item mods, this li’l beauty will make your life a lot easier.\r\n\r\nTexture Pack Combiner : Roll the best textures from the Nexus into one package.\r\n\r\nWTF - Random Encounter Zones: This mod is designed to make the encounter zone levels completely random. \r\n\r\nNote: Its .esp functions identically to SkyRe\\'s \\\"Encounter Zones\\\" module, except randomly instead of statically. \r\n\r\nVIII. Other Stuff \r\n\r\nThese are programs and tools other than NMM that will come in handy when playing or modding Skyrim.\r\n\r\nATTK Power Loader: Make better use of your RAM for a smoother Skyrim play experience! ATTK comes with many features (although I don\\'t recommend using the more extreme ones unless you know what you\\'re doing, as they can damage your computer and/or its software).\r\n\r\nFNIS(Fore\\'s New Idles in Skyrim): This mod is needed for many animation mods. \r\n\r\nScript Dragon : Script Dragon is a program required by some mods*. \r\n\r\n*There are currently only three on this list, TK Dodge, Tales of Lycanthropy and Dual-Wield Parrying. \r\n\r\nSkyrim NPC Editor: This program allows you to modify NPCs. \r\n\r\nNote: Make sure to add Apachii Hairs as a plug-in with NPC Editor so you can use that mod’s great-looking hair with you NPCs. \r\n\r\nTexture Optimizer: I consider this program essential if you download any texture mods. Among other things, it resizes them, making them smaller, and thus, quicker to load.\r\n\r\nIXa. Troubleshooting – CTDs and Instability\r\n\r\nThis section is dedicated to our friend, Crashes-to-Desktop.\r\n\r\nFor those of you experiencing problems with Skyrim instability, take heed: \r\n\r\nInstability can result from...\r\n\r\n1. Incorrectly installed mods/using outdated versions of mods/software. \r\n\r\nIf I were experiencing crashes while playing, the first questions I would ask myself are, “Are my mods up to date? Am I using the most current version of SKSE and Script Dragon*?” If the answer is no to either of these questions then you need to update. \r\n\r\n*Script Dragon becomes outdated the moment Bethesda patches Skyrim, so make sure you\\'re using the most up-to-date version, or the game won\\'t even launch! \r\n\r\n2. A hardware problem or lack of computer muscle. \r\n\r\nA lack of RAM or an overtaxed GPU make for common CTD culprits. Make sure to use Texture Optimizer to optimize your textures!\r\n\r\n3. Result from compatibility patches that you don\\'t need. \r\n\r\nIf you can\\'t even start Skyrim because it crashes as soon as the main menu tries to load, keep in mind that many mods will come with compatibility .esp files for Dawnguard and/or Hearthfire that will give you a CTD if you have them checked in your load order but don\\'t have Dawnguard or Hearthfire installed. \r\n\r\n4. Result from improperly-installed ENB graphics mods. \r\n\r\nENB mods require a special file, d3d9.dll, in order to run. Make sure you have the right one in your Skyrim directory or the game won\\'t launch.\r\n\r\n5. Result from Bethesda patches. \r\n\r\nSorry, but it’s true! Anytime you download and install a Bethesda patch, you’re taking a pretty big risk; it will certainly conflict with your mods, which will all have to be updated, as will Script Dragon and SKSE. Also, remember the backwards-flying dragons? Bethesda patches may also introduce new bugs. \r\n\r\nIf you don’t want to deal with this very annoying problem, disable automatic updating in your Steam options. Keep in mind, most modders will update their mods to the latest version of Skyrim, so if you use a lot of mods and want to keep them updated, you’ll eventually have to patch the game to the latest version. \r\n\r\nIXb. Troubleshooting - Additional Tips\r\n\r\nHere are some common-sense tips to follow in order to avoid corrupting your save or other undesirable results (faulty textures, low FPS, etc.).\r\n\r\n1. Back up your saves. You’d be surprised how easy it is to corrupt a save, and once it’s been done, there’s no undoing it.\r\n\r\n2. Use Optimizer Texture. \r\n\r\n3. Follow the uninstall instructions to any mod very closely. \r\n\r\n4. Know your mods. Many mods aren’t compatible and will cause your game to crash if you try and use them together. \r\n\r\n5. Use BOSS! Load order is important, and this program will ensure that you have the correct one, thus ensuring that you keep yourself from corrupting your save. \r\n\r\nIXc. Troubleshooting - Reinstalling Skyrim\r\n\r\nIf you can’t get the game to work (which can happen if you’re careless installing mods), do a vanilla install:\r\n\r\n1. Go to your Skyrim Data directory and delete everything inside except the “Skyrim - xxx.bsa” files (this will save a lot time when you have to reinstall through Steam). \r\n\r\n2. Open Steam, right-click “Skyrim,” click on “Properties,” and then on “Local Files.” \r\n\r\n3. Click on “verify integrity of game cache.” It should recognize that key files are missing and install the vanilla game. \r\n",
  "categoryId": "82",
  "version": "1.0",
  "author": "Nick",
  "createdUnix": "1357673943",
  "updatedUnix": "1357673994",
  "containsAdultContent": false,
  "uploadedBy": "InnkeeperX86",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001000",
      "name": "Nicks Skyrim Improvement Guide SFW Version PDF",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "413",
      "fileName": "Nicks Skyrim Improvement Guide SFW Version PDF-29664-1.zip",
      "uploadedUnix": "1357673994",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/3dad2aaf3691772e7687d8bf41bdf07f78a16f699b3483024b5630fadf50788c/analysis/1407344000/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nicks%20Skyrim%20Improvement%20Guide%20SFW%20Version%20PDF-29664-1.zip?fid=1000001000&ttl=1535803936&ri=8192&rs=8192&setec=279a37aee94426a237e8d27ee788961a"
    }
  ]
}