{
  "modId": 29665.0,
  "modName": "Remos Display Spells",
  "summary": "Remo\\'s Display Spells\r\nA collection of spells for making your player house a home!",
  "descriptionHtml": "Tired of spending hours setting up displays in your house just for everything to end up on the floor every time you walk past?\r\nWant to display the goodies you collect throughout the game but just can\\'t get them to sit right?\r\n\r\nWell, no more!!!\r\nI present to you - Remo\\'s Display Spells.\r\n\r\nA collection of spells aimed specifically at making your house a home.\r\nDisplay what you want, where you want!\r\n\r\nOver time I will be adding more spells for you to get your home looking just right!\r\n----------------------------------------------------------------------------------------------------------------------------------\r\nOther Mods By Me!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/15801]Berts Breezehome Cellar[/url]\r\nAdds an open (no loadscreen) cellar to Breezehome with a full set of crafting and smithing tools plus displays for armour, weapons, dragon masks and dragon claws!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/8922]Berts Breezehome Remodeled[/url]\r\nA full remodel of Breezehome including interior, exterior and cellar & so much more!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/15806]Berts Breezehome Garden[/url]\r\nA new garden grotto added to Whiterun available as a standalone or connected to the vanilla Breezehome & is also pre-packed with my Cellar & Remodeled mods.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/25239/#]Berts Hearthfire Dairy Resources For Modders[/url]\r\nA resource for modders to add fully animated milkable cows, working milk churns and scripts for maturing/ageing cheeses.\r\n\r\n----------------------------------------------------------------------------------------------------------------------------------\r\n[u]Contents[/u]\r\n\r\nAvailable Spells\r\nDescriptions/ReadMe\r\n\r\n----------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[u]Available Spells:[/u]\r\n\r\nRemo\\'s Potions Displays\r\nTwo spells for setting out potions on any surface you want!\r\n\r\nMore to come soon!\r\n\r\n----------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[u]Descriptions/ReadMe[/u]\r\n\r\nRemo\\'s Potions Displays\r\n\r\nThis mod adds 2 new spells:\r\nRemo\\'s Potion Cluster: Displays up to 5 potions\r\n&\r\nRemo\\'s Potion Shelf: Displays up to 11 potions\r\n\r\nBoth Spell-Tomes can be bought from Belathor\\'s shop in Whiterun (at an extortionate mark-up!!).\r\n\r\nBoth spells allow you to cast a phantom display on any surface, once activated the game will open a bookshelf-type interface in which you can place potions for display.\r\nFor perfect placement aim about 3 inches to the right of where you want the display to be centered (the game-engine\\'s aim is well off!!).\r\nIf the display is at an odd angle position yourself directly in front of the display in the direction you wish it to face, crouch, and activate the display, this will turn the display to face you, you can do this as many times as you like.\r\nIf the display is not centered as precisely as you\\'d like simply activate the display and exit without adding any potions then activate again and it will disappear.\r\nOnce your display is in the desired position, activate it and add the potions you wish displayed (after adding each potion it will then be returned to you and you will be notified how many more can be added) then when you have added your potions exit the interface and re-activate the display, your potions will be removed from your inventory and placed in position and fixed and the phantom display will disappear, no more will potions end up on the floor just because you walked past a bit too close! They connot be knocked, kicked, bashed or blasted!!\r\nYou do not have to completely fill the display if you do not wish!\r\nYou can only add 1 of each type of potion, if you add more than 1 the spell will ignore the duplicates and you will end up with less potions being displayed!\r\nIf you place the spell badly and any of the phantom potions are outside a wall/inside furniture such as a cupboard etc, the potions will be placed in areas that you cannot reach and therefore probably lost!!!\r\n\r\n\r\nberticus0001 ;-)\r\n",
  "categoryId": "75",
  "version": "",
  "author": "berticus0001",
  "createdUnix": "1357673983",
  "updatedUnix": "1357674200",
  "containsAdultContent": false,
  "uploadedBy": "berticus0001",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001001",
      "name": "Remos Potions Displays",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "210",
      "fileName": "Remos Potions Displays-29665-1-0.7z",
      "uploadedUnix": "1357674200",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c86cd0355b2c40db16db816cff9b5b62441f33ad8273320ceeec59a02f0a414c/analysis/1407344001/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Remos%20Potions%20Displays-29665-1-0.7z?fid=1000001001&ttl=1535803937&ri=8192&rs=8192&setec=11023c38ce4448a6f693bbbc4f301f65"
    }
  ]
}