{
  "modId": 29670.0,
  "modName": "Call of the North Revisited - Leveled",
  "summary": "Includes Call of the North new helmets into the leveled lists so now you can find the stuff all over the world and not only craftable.",
  "descriptionHtml": "==============\r\n[SIZE=5][B] Note [/B] [/SIZE] \r\n==============\r\n\r\n[SIZE=4][color=yellow]Hi everydody!\r\n\r\nI am now working with foxia merging together her mod and this with the leveled lists, so now both are merged together and you can now enjoy all the Call of The North stuff ingame using just one single .esp. without separate downloads. So [u]THIS PATCH IS OUTDATED, NOW [/u] if you are using TheCallofTheNorth.esp now everything is integrated there! (After all it was the best thing to do for your enjoyement)\r\n\r\nThis will remain here for a while, just for information purposes!!\r\nGo there download and enjoy!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/29040/]http://skyrim.nexusmods.com/mods/29040[/url]\r\n\r\n[/color] [/SIZE] \r\n==============\r\n[SIZE=5][B] DESCRIPTION [/B] [/SIZE] \r\n==============\r\n\r\n\r\nThis is a Patch that adds some wonderful and lore-friendly helmets to bandits, loot, merchants and stormcloaks through leveled lists, the helmets are coming from\r\n\r\nCALL OF THE NORTH\r\n\r\n[url=http://skyrim.nexusmods.com/mods/29040/]http://skyrim.nexusmods.com/mods/29040[/url]\r\n\r\nYou will need the resources of this mod in order to use this patch.\r\n(I know guys is a bit annoying, but isn´t my work and we need to show some respect to others people work, after all they are doing a great job for free for you…)\r\n\r\nCOMPATIBLE SKYRE: Can be used along with SkyRe using Reproccer.\r\n\r\n\r\n==============\r\n[SIZE=5][B] CONTENT [/B] [/SIZE] \r\n==============\r\n\r\n\r\nMost of the items can be found with forsworn, bandits, some vendors (smiths) and as part of the stormcloak army, some of them (heavy bear helmet), have been added to the stormcloak officer outfit as specially requested by guardian300 (original creator of the mod).\r\n\r\nThe commonness of the items it will depend of the amount of mods adding items you already have (see below).\r\n\r\n\r\n==============\r\n[SIZE=5][B] ABOUT COMMONESS OF THE ITEMS AND LEVELED LISTS [/B] [/SIZE] \r\n==============\r\n\r\n\r\nIf you are a experienced modder, read it, you will understand why a little bit later. If you are not…well, better read it twice, it is always better if you have some idea about what you are doing.\r\n\r\nIf you don´t know what is a leveled list is, a Leveled list is a way to add some randomness to the game.\r\nIn a simple way, instead adding items straight to NPC inventory (with somehow boring results, because all the loot will be the same and you will get the same, never would change, will be looting the same things over and over again), Bethesda instead added all the possible loot items into an items list, this list contains all the items you want to be loot, but it adds some randomness, ¿How?, assigning chance. Every time I need and item, I will get one randomly from that list. \r\n\r\nLet’s say I fill it with 10 items, and them every time I kill the NPC and loot him, one item will be randomly chosen from the ones within the list. If I have got 10 items within the list the possibilities of getting one specific item from that list is 10%.\r\n\r\nThat´s fine and this is what we have done in this mod, this is important because…some mods will add and increase the amount of items into that lists, this is the best way to get new mod items in game “naturally”, from loot, or finding them being wear for some bandits, etc…but keep in mind that the more items you add to the list, the more it falls the chance percentage to get one specifically.\r\n(No worries, there are ways to improve this, but must be balanced carefully) \r\n\r\nHOWEVER, keep in mind that THE MORE MODS you are using that adds contents, more items will add to the same lists, and its content will increase accordingly (to 20, 30 40 or even more items per list), SO the chance to get one specific items from the list will drop.\r\n\r\nFor example:  If the content of the list of the last example with 10 items increases to, let´s say 25 items, the possibility of getting one single specific items in a loot drop, fall from 10 % in the first to a 4% chance within the new.\r\n\r\n[color=red]I HAVE NO CONTROL OVER THE AMOUNT OF MODS YOU HAVE THAT ADDS CONTENT, that means that I have also little control about the commonness of some items IN YOUR GAME.[/color]\r\n\r\nSo please, do not blame me or this patch if are not able to find the new items as common as you would like to.\r\n\r\nKeep that in mind\r\n\r\nSome of the mods that increases dramatically the content within leveled lists are\r\n[B]SkyRedone: [/B]\r\n[url=http://skyrim.nexusmods.com/mods/9286/]http://skyrim.nexusmods.com/mods/9286[/url]  \r\n[B]Immersive Armors: [/B] \r\n[url=http://skyrim.nexusmods.com/mods/19733/]http://skyrim.nexusmods.com/mods/19733[/url]\r\n[B]Cloaks of Skyrim: [/B]\r\n[url=http://skyrim.nexusmods.com/mods/12092/]http://skyrim.nexusmods.com/mods/12092[/url]\r\n\r\n\r\n==============\r\n[SIZE=5][B] WRYE BASH[/B] [/SIZE] \r\n==============\r\n\r\n\r\nAnother problem is that If you have two or more mods that adds items to the same lists, only the last one in your load order will add its items, because its overwrite everything else before it. That means that it does not matter how many mods you have and how many items you want to add, you will see in game only the ones from that last position specific mod, because overwrites everything else before it.\r\n\r\nUNLESS you use some wonderful tools like Wry Bash, it helps to patch everything, importing items from every single mod into a final big single list, including ALL the items, You will not find your new items. Wrye Bash instead means no overwriting anymore. This is wonderful, now you have all the content from your mods included in game, but the, you will need to use a second .esp that I provided increasing the chance of finding the helmets.\r\n\r\nTHIS .ESP IS MADE MERGEABLE, so you should not have any problems adding it.\r\n\r\nFurther questions: scroll down and CHECK the FAQ\r\n\r\n\r\n==============\r\n [SIZE=5][B] BET [/B][/SIZE] \r\n==============\r\n\r\n\r\nAfter all this explanation, I still bet you 100 of my endorsements that somebody will come out with one or two of this questions in the comments section. \r\nYou know I will win…\r\n\r\n\r\n==============\r\n [SIZE=5][B] REQUIREMENTS [/B][/SIZE] \r\n==============\r\n\r\n\r\nFIRST: THE ORIGINAL MOD\r\n\r\n[url=http://skyrim.nexusmods.com/mods/29040/]http://skyrim.nexusmods.com/mods/29040[/url]\r\nThis patch does not contain any meshes or textures, download the mod is mandatory or you will see nothing ingame. \r\nSorry guys but it is not my work and I have to show some respect to other people work.\r\n\r\nSECOND: RECOMENDATIONS\r\n\r\nUse Wrye Bash to merge leveled lists with all the other mods you are using. Not mandatory but recommended.\r\n[url=http://skyrim.nexusmods.com/mods/12092/]http://skyrim.nexusmods.com/mods/12092[/url]\r\n\r\n==============\r\n [SIZE=5][B] COMPATIBILITY [/B][/SIZE] \r\n==============\r\n\r\nAs far as you use Wrye Bash, no prob\r\n\r\nBut check a little bit down into the FAQ section about commonness of the items.\r\n\r\n\r\n==============\r\n [SIZE=5][B] INSTALLATION [/B][/SIZE] \r\n==============\r\n\r\n\r\n1-Download ALL Textures and Meshes and the TheCallOfTheNorth.esp\r\n, ¡you will need then all! , you can install the mods manually or using your favorite installation mod manager (Wrye, NMM, MO,…)\r\nTHIS PATCH DOES NOT CONTAIN ANY MESHES OR TEXTURES.\r\n\r\nIFYOU DO NOT INSTALL FULL (MESHES, TEXTURES) OR YOU FORGET TheCallOfTheNorth.esp YOUR GAME WILL CRASH!\r\n\r\nPlease, remember to endorse the really great work of those guys, they worked for free for you, your endorsements are your way to say “thank you”. It is free, take less than a five seconds and it says a lot about you. AFTER downloading and installing the original mod, REMENBER there is no MESHES or TEXTURES here, you need to download then from the original mod.\r\n\r\n2-Just select and download only ONE of the two options:\r\n \r\n[B]Keep in mind WHY I build TWO options,[/B]\r\n\r\nA- The first one [STANDARD CHANCE] is mean to be for vanilla game, it makes CalloftheNorth items from common to rare. You can find them mostly as loot or being wear by bandits, forsworn and stormcloaks.\r\n\r\nB- The second one [HIGHER CHANCE] is mean to be used for those crowded with mods that add plenty of items to leveled lists, but still want to see the helmets sometimes. It balances the chance to get CalloftheNorth items if you have lot of extra items added by other mods.\r\nI do not recommend use the second one with vanilla game, it does not do any harm, but your NPC would be wearing the bear and wolf helmets almost exclusively.  \r\n\r\n3-Make sure you installed your selected .esp/meshs/textures into your Data folder found in Program Files/Steam/steamapps/common/skyrim/Data/\r\nAnd you DID NOT FORGET ANYTHING (or the items won´t show in game).\r\n\r\n4-Organize your load order , and put the patch AFTER TheCallOfTheNorth.esp, \r\nto be something like:\r\n\r\n….\r\n…\r\nTheCallOfTheNorth.esp\r\nCALLOFTHENORTH_COMPLEMENT.esp\r\n…..\r\n…..\r\n\r\n==============\r\n [SIZE=5][B] UNINSTALLATION [/B][/SIZE] \r\n==============\r\n\r\nDrop your items into any container of the game out of your home, quit the game, delete everything, destroy your computer, burn your house,…your choice.\r\nThis mods does not change anything beyond some leveled lists, it is safe delete and uninstall. Just make sure you drop any items before. Once your NPC respawns no leftover of this mod will remain.\r\n\r\n============== \r\n[SIZE=5][B] QUESTIONS OR FAQ [/B][/SIZE]\r\n==============\r\n\r\nQ-How long it will take see all the stuff in game?\r\nA-As soon as the NPC and vendors list reset and NPC re-spawn, that is around a week ingame time, depending of the area. Areas that you have not explored yet should be fine\r\n\r\nQ-Was it tested?\r\nA- Yes, it was with no problems so far. \r\n\r\nQ-It is multilingual .esp?\r\nA-Does not modify any Item, so any item will keep the name in its original language (so far, english).\r\n\r\nQ- What of your two version should I use? I am already user of immersive armors/SkyRE/Cloaks …What do I need? What have to do all of this with the commonness of the items?\r\nA-Let me tell you with one real example and you will understand very quickly:\r\n\r\nThis list - LItemBanditHeavyHelmet [LVLI:00015BE0] is the one that provides helmets to bandits, it contains\r\n\r\nIn Vanilla game - 16 Items\r\nIn Vanilla+WIC - 20 Items (the mod adds an extra 4)\r\nIn Vanilla+Immersive Armors – 39 Items (adds an extra 19)\r\nIn Vanilla+CallOfTheNorth [STANDARD CHANCE]-20 Items (adds an extra 4)\r\n.\r\n.\r\nEverything Merged with Wrye Bash – 47 Items (added a final amount of 27 extra items over vanilla game)\r\n\r\n- If I am playing vanilla game with CallOfTheNorth I only added 4 items into this list, so if I am  playing vanilla game I have a chance of:\r\n\r\n4 Helmets/20 Items = 20% of get a bandit wearing one of the Bear or Wolf Helmets\r\n\r\n- But if I am playing with everything merged, then I have:\r\n\r\n 4 Helmets/47 Items = 8.51% of get a bandit wearing one of the Bear or Wolf Helmets\r\nHelmets are there, but you´ll find them less often.\r\n\r\nSo, look at your mods, and  if you are using any of the mods that adds content to the game, better if you use HIGHER CHANCE, but it’s up to you.\r\n\r\n==============\r\n [SIZE=5][B] FEEDBACK [/B][/SIZE] \r\n==============\r\n\r\nI need your feedback for future development.\r\nLet me know what you think, suggestions and constructive criticism are always welcome. \r\n\r\n==============\r\n [SIZE=5][B] FUTURE PLANS [/B][/SIZE] \r\n==============\r\n\r\nExpect some updates \r\nThis version is a first test, once balanced the future plans are combine this content with \r\n\r\n[url=http://skyrim.nexusmods.com/mods/24596/] Patch for Winter Is Coming – Cloaks of Skyrim - Fur Hoods[/url]\r\n\r\nAnd keep expanding lore friendly content\r\n\r\n==============\r\n [SIZE=5][B] CREDITS [/B][/SIZE] \r\n==============\r\n\r\nThis people was working for free for your enjoyment, leave then some endorsements helps the community and keep the mods pouring, It takes two minutes and it says a lot about you.\r\n\r\n[B]Guardian300 for idea and most of the work, great job!\r\n\r\nFoxia for the fixes to the helms and continues development, please go on!\r\n\r\nDefunkt for giving permission to use his argonian and khajiit iron helm meshes from his Helmet Variants mod.\r\n\r\nFhaarkas: For his softer fur wolf normal map textures.\r\n\r\nMAK07: For his remodeled female Wolf Gauntlets and Boots look much nicer.\r\n\r\nExeter: For his UNP Female Wolf Armor. \r\n\r\nAll the players[/B]\r\n",
  "categoryId": "54",
  "version": "3.0",
  "author": "Guardian300-foxia-khamuy",
  "createdUnix": "1357678435",
  "updatedUnix": "1358958973",
  "containsAdultContent": false,
  "uploadedBy": "khamuy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001026",
      "name": "Call of the North - Standard Chance",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Call of the North - Standard Chance-29670-1-0.rar",
      "uploadedUnix": "1357678707",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/85ca3a1fe0fe1b777f0b401fb472b0c3dfaaa72342cf3e53557373a36b274f98/analysis/1407344224/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20the%20North%20-%20Standard%20Chance-29670-1-0.rar?fid=1000001026&ttl=1535803946&ri=8192&rs=8192&setec=0eb8f25f6f57d64c9a35877286da951c"
    },
    {
      "fileId": "1000001027",
      "name": "Call of the North - Higher Chance",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Call of the North - Higher Chance-29670-1-0.rar",
      "uploadedUnix": "1357678758",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2f2de070f0654b21f564ed5702732ce5bfb28c56dff54bf4a1a6a9f633a30932/analysis/1407344224/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20the%20North%20-%20Higher%20Chance-29670-1-0.rar?fid=1000001027&ttl=1535803947&ri=8192&rs=8192&setec=a52e4eab91f52cec7455a1d8cc9b2372"
    },
    {
      "fileId": "1000004167",
      "name": "Do not download Test version Full_V1_2 forsworn",
      "version": "1.2",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "18",
      "fileName": "Do not download Test version Full_V1_2 forsworn-29670-1-2.rar",
      "uploadedUnix": "1358854914",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/7f76cc40316d0d73dead5038cedb830a9c60a22080dc8d44bcd7485bcddbf9ea/analysis/1407373386/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Do%20not%20download%20Test%20version%20Full_V1_2%20forsworn-29670-1-2.rar?fid=1000004167&ttl=1535803947&ri=8192&rs=8192&setec=91615a54584bf222d3745aed402ea8e0"
    },
    {
      "fileId": "1000004374",
      "name": "Version 3_5",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "22",
      "fileName": "3_5-29670-.rar",
      "uploadedUnix": "1358958973",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c1bbaade3213314a7b5700bac0acf2238b4e479c40bc72c8764458a92cf748a5/analysis/1407374964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/3_5-29670-.rar?fid=1000004374&ttl=1535803948&ri=8192&rs=8192&setec=af39edb45acc5b9c1b889e8353f77e34"
    }
  ]
}