{
  "modId": 29676.0,
  "modName": "HearthFire Enhanced",
  "summary": "This mod will provide various feature modifications and additions to HearthFire. Some of them will make the life easier for the player but some of them may complicate things to make them more realistic.",
  "descriptionHtml": "Requires HearthFire, obviously&#33;\r<br />IMPORTANT: \r<br />Latest versions make my &#34;Hire Your Own Housecarl&#34; obsolete, this mod implements now that feature and, on the first run with the update, will get the housecarls you assigned with the other mod. DO NOT INSTALL THE OTHER MOD AFTER UPDATING TO 1.22\r<br />Not yet but this mod will require SKSE in the near future (not yet mandatory but optional for some features). All STEAM subscribers not using SKSE are advised to unsubscribe and use the nexus version that with will be marked, when the time comes, with &#34;Last NON SKSE&#34; in the file short description, till then you can still use steam or update on nexus. A message will be also shown in game when you first load with the new version if using STEAM subscribe. \r<br />For important troubleshoot information see the sticky topic on nexus mod&#39;s comments.\r<br />\r<br />This mod will provide various feature modifications and additions to HearthFire. Some of them will make the life easier for the player but some of them may complicate things to make them more realistic (eg: no more instant resources from the steward)\r<br />All I plan to add will include minimum to none cell editing in CK and, if it will be needed, runtime changes (using placeAtMe, disable/enable) will be always preferred vs cell editing in CK.\r<br />Will try to not touch vanilla scripts but will relay on them to work as intended by Beth (will call their functions, access their variables, etc)\r<br />The mod will be updated as features will be added and at some point may include individual feature enable/disable via MCM.\r<br />I&#39;m open to suggestions as long they won&#39;t involve cell editing as I sayed (for compatibility reasons and cause I&#39;m not skilled at that)\r<br />\r<br />Features:\r<br />- Steward, Housecarl and/or hireable miner will mine clay and stone instead of instant purchase from steward\r<br />You can ask our Steward and/or Housecarl to mine clay and stone. Also you could hire a miner for the job that is in the vanilla faction &#34;JobMinerFaction&#34; (see wikis about how&#39;s in it, modded NPC placed in that faction would work too, adding a NPC to that faction from console should also work). They will work on a nearby deposit starting early next morning and at noon the resources will be added. You can ask for a single mining cycle and instant pay for it or you can ask them to take from the money left in the resources chest outside near the benches till it runs out or you tell them to stop. From console you can enable (or disable) the mine and instant buy dialogue using &#34;set HFEMaterialsMine to 1&#34; (or 0) and &#34;set HFEMaterialsBuy to 1&#34; (or 0) both can be enabled or disabled at once, also you can adjust if you wish the vanilla parameters for amount and cost using &#34;set XXX to X&#34; where XXX can be BYOHHPAmountClay, BYOHHPAmountStone, BYOHHPCostClay, BYOHHPCostStone and X the desired value. By default only mining is enabled, not buying, and the other parameters left as in vanilla. After their working shift the hired miners will sandbox outside but they can get a bed inside assigned via explicit bed assignment feature.\r<br />Also note about hired miners: If they have uncompleted quests or something is up to you if you hire them. I simply allowed them to work for you regardless their possible quests as that may bring a nice variation to the quest but if there are issues with that please bring particular cases to my attention. Also they will be &#34;protected&#34; (only player may kill them more or less) while traveling to your house but on their way back when finishing job they are on their own.\r<br />\r<br />- Deliver resources quest\r<br />After a civil war city battle you can talk to the town&#39;s steward and they&#39;ll request resources for rebuilding the city...follow the quest objectives afterwards. The quest can be restarted after using the NPC mining feature for about 20 days in total: it will be 20 for a single miner, it can be 10 if you mine both clay and stone at the same time and even less if you mine at multiple houses. The payment will be about 130% the price you pay for the resources (miner payment per day). Note: don&#39;t ask to actually see Whiterun rebuilt, that&#39;s far beyond the purpose of this mod.\r<br />\r<br />- Dismiss and assign new housecarls\r<br />  This implements the dismiss and hire of other housecarls that was previously in my &#34;Hire Your Own Housecarl&#34; mod, including for non HF vanilla houses. I did this because future plans require better collaboration between all the NPCs around HF houses and that would have been hard to make with two mods. Upon first load with version &gt;1.22 it will recover the housecarls from the other mod and stop that one&#39;s managing quest if you used it previously. DO NOT UNINSTALL THE OTHER MOD BEFORE UPDATE AND DO NOT INSTALL IT AFTERWARDS.\r<br />  You can assign as housecarl various vanilla followers like the hirelings from inns, most orc followers, a handful of other followers with simple/no quest or after completing their quests including Uthgerd, Trovar, Ria, Eola, Addelaisa, Mjoll and others. Some of them will be voiced for housecarl dialogues if that was recorded in vanilla game, test for yourself if you want to choose only those.\r<br />  You can make other NPCs including modded ones potential followers from console. Type: &#34;help assignablehousecarls&#34;; &#34;addtofaction XX011b25 1&#34; where XX is from the result of help command; &#34;getrelationshiprank player&#34;; if the rank is &lt;1 also do &#34;setrelationshiprank player 1&#34; but if is already &gt;1 it will only reduce the rank of a better friend so don&#39;t do it. This seems to work if the NPCs already have at last one line of possible dialogue and WON&#39;T make them followers but only housecarls without follow feature.\r<br />\r<br />- Dismiss default horse and park your own\r<br />  Get rid of the horse the steward got you via dialogue so you can park your own without killing it.\r<br />  Tell the steward to take care of your own horse at the house. Riding the parked horse again will stop the parked behavior.\r<br />  It will park the last horse you rode before reaching the house, if you jump on another horse that was at location it will still work for the last one you approached with in order to make swapping the parked horse possible.\r<br />(Compatible with horse mods like Convenient Horses - the horse won&#39;t follow even on FT but the horn can still get it to you) \r<br />\r<br />- Replace Bards\r<br />  You can get the College Students (Aia Arria, Ataf, Illdi, Jorn) to sing at your place after finishing the College&#39;s quest line. Voices and song request working.\r<br />  Includes fix for default bard dismiss.\r<br />\r<br />- Explicit bed assignment \r<br />  There is a new dialogue option added to the Wife/Husband, Steward, Housecarl and other people you hire on houses that will allow you to specify a specific bed where they should sleep. \r<br />  The mechanism is similar to commanding followers and clicking on bed will show a dialogue, clicking on doors will open them, on anything else to cancel. Since not all those people are followers you can get them inside the house while in this command mode but only trough the main door. \r<br />  TODO: names for the beds to reflect the owner once new SKSE will be out, partially implemented a mechanism that will allow to define 10 other beds to work with this beside the ones in HF houses and to add other NPC to the mechanism too. \r<br />\r<br />- Trophy removal and replace\r<br />  To enable the feature (perk) activate a trophy base you can build upon; if non available go in front of one open console select it and type &#34;setdestroyed 0&#34;\r<br />  To remove a trophy click on the base which already has a trophy built, if you used console before to rebuild trophy (disable) you&#39;ll be notified to remove again\r<br />  Small issue: no text is shown on mouse over the base with trophy to remove, but click it and it will work\r<br />\r<br />- Additional trophies: Snow Sabre Cat, Foxes, Atronachs, Wispmother, IceWraith, SprigganMatron\r<br />Optionally added Vale Saber Cat, Vale Deer, Chaurus Hunter if DG is present (optional not required) which require SKSE for proper building materials\r<br />Also added Mannequin for the small trophy base. Activate the base (as for removal) to equip. Compatible with custom mannequin scripts that doesn&#39;t change the vanilla script name and its properties.\r<br />  I will make them the way mannequins are made, looking for modders who wish to contribute with models and textures the way HF implemented trophies.\r<br />  They are added without changing the form lists from the addon so other mods won&#39;t override the change, but by what I saw even bashed patches can&#39;t help with those lists if two mods try to change them\r<br />\r<br />- Steward dismiss and replace \r<br />  Seems working fine but I recommend to save before dismiss and checking the dialogues on both the dismissed and the new steward before loosing that save\r<br />\r<br />- Lumber, Stone, Clay resources for each house \r<br />  Lumber pile quantity is now per house and stone and clay work the same way, no longer carried in your inventory. \r<br />  Clicking on the log pile will open a message showing how much of those three resources you have at that particular house. \r<br />  When buying logs from mills you can tell where they should be sent. \r<br />  When gathering resources at a location which is not a house location those will appear at the next house you visit. I would like to improve this to be more realistic yet practical, suggestions are welcome.\r<br />\r<br />- Stewards can take care of pets\r<br />  If you bring home a pet you can tell the steward to take care of it making the house the new pet&#39;s home, he also has the dialog to let the pet go. You need to dismiss the pet yourself after assigning it so it stops follow.\r<br />  If a child sees you with such pet he will comment that he wants a pet too and won&#39;t ask to have your pet for the same ammount of time it takes when you reject that, even if you bring another pet.\r<br />\r<br />Planned (not in this order):\r<br />- More plants to plant. OK, I got that you want this yet it won&#39;t be a priority, please stop asking. \r<br />- Hirelings replace or choose race/sex (eg: bard) or add (eg: cook)\r<br />- Monthly wage for hirelings\r<br />- Adoption system enhancements (more, relocate, follow, etc)\r<br />- Add the HF basement to the vanilla player houses in the cities (if the cell will prove easy to duplicate without much manual redoing)\r<br />- Build again the small house near the main one after the conversion to entry (when I&#39;ll accumulate experience and if the interior can be reused after the conversion)\r<br />- Winterhold house HF style (it may never happen but when I&#39;ll really get full understanding of HF mechanics I may try it with the condition that I can reuse/extend scripts, easy duplicate interiors)\r<br />- anything else I will come up with or from suggestions\r<br />\r<br />Looking for help from other modders for:\r<br />- model and textures for &#34;huge trophy base&#34; should be similar with existing ones but with wider surface and not that tall\r<br />- models and textures for other trophies in interesting poses so I can add them HF style\r<br />- models and textures for stone/clay pile to make a functionality similar to the wood pile\r<br />- personal request: Dunmer children, any adoption changes may happend only when such becomes available so I can happily involve it in my game play and test.\r<br />Thanks\r<br />\r<br />Open for suggestions for features.\r<br />If you made some mod adding feature(s) with the same spirit as the ones I plan and you wish me to add it to this mod (for compatibility or whatever reason) please contact me and full credit will be provided if I do that. No major cell editing is still a rule, only original authors for this please, players don&#39;t contact me for a mod you just use or know about (yet I may consider independently implement similar feature).",
  "categoryId": "67",
  "version": "1.27",
  "author": "LukeH",
  "createdUnix": "1357687358",
  "updatedUnix": "1410036843",
  "containsAdultContent": false,
  "uploadedBy": "LukeH",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001049",
      "name": "HearthFiresEnhanced_100",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "HearthFiresEnhanced-29676-1-0.zip",
      "uploadedUnix": "1357687560",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/095d7ded3482c9037065b29f51c8a336798135ad4aa56b3c88148f76314015f9/analysis/1407344403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFiresEnhanced-29676-1-0.zip?fid=1000001049&ttl=1535803960&ri=8192&rs=8192&setec=6e7c756139211faeb73ee9ed0db2ff08"
    },
    {
      "fileId": "1000001497",
      "name": "HearthFiresEnhanced_105",
      "version": "1.05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "HearthFiresEnhanced-29676-1-05.zip",
      "uploadedUnix": "1357857426",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/7b0c1089f16d336630da5c3fe19f8ffc149a0851486b919a5d18e6c0ff43f586/analysis/1407347059/",
      "changelogHtml": " dismiss steward option <br/> \n some more additional trophies <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFiresEnhanced-29676-1-05.zip?fid=1000001497&ttl=1535803961&ri=8192&rs=8192&setec=993b457d84063284b830f2e483c6b581"
    },
    {
      "fileId": "1000009622",
      "name": "HearthFiresEnhanced_111",
      "version": "1.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20",
      "fileName": "HearthFiresEnhanced-29676-1-11.zip",
      "uploadedUnix": "1360795368",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/1479e4c4b6419484edcebf0789339c1230db699209e616834d30fc4c81992f61/analysis/1407416163/",
      "changelogHtml": " fix for 1.10 issue when mod is installed before buying all houses <br/> \n wip for pets for stewards not fully tested <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFiresEnhanced-29676-1-11.zip?fid=1000009622&ttl=1535803961&ri=8192&rs=8192&setec=2b13e755b5787f7f4539b9b78d4c997c"
    },
    {
      "fileId": "1000009719",
      "name": "Script",
      "version": "1.10",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2",
      "fileName": "Script-29676-1-10.zip",
      "uploadedUnix": "1360829369",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/0d0ca8281699c8ed2fbc9c9c9ed97cc69bdb508b7966ab8f1913a67f22b92cfb/analysis/1407416619/",
      "changelogHtml": " REMOVED DUE TO A BUG WHEN MOD IS INSTALLED BEFORE HAVING ALL HOUSES <br/> \n log count independent per house <br/> \n clay and stone works the same way as logs <br/> \n more additional trophies <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Script-29676-1-10.zip?fid=1000009719&ttl=1535803962&ri=8192&rs=8192&setec=3255efbef81c3e0d9a6b65b1bbd4c7ea"
    },
    {
      "fileId": "1000013483",
      "name": "HearthFiresEnhanced_112",
      "version": "1.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "21",
      "fileName": "HearthFiresEnhanced-29676-1-12.zip",
      "uploadedUnix": "1361922064",
      "modVersion": "1.12",
      "virusScanUrl": "https://www.virustotal.com/file/4e852d2ac9ba1c7686b051b2a62af650c98e5027f71968399bc4918c2fa49416/analysis/1407441460/",
      "changelogHtml": " Stwards takeing care of pets usable <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFiresEnhanced-29676-1-12.zip?fid=1000013483&ttl=1535803962&ri=8192&rs=8192&setec=4a87a828feb138a1466c32bb367c473c"
    },
    {
      "fileId": "1000092089",
      "name": "HearthFiresEnhanced_115",
      "version": "1.15",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29",
      "fileName": "HearthFiresEnhanced-29676-1-15.zip",
      "uploadedUnix": "1390081407",
      "modVersion": "1.15",
      "virusScanUrl": "https://www.virustotal.com/file/1cf9b4bbf903dce4dbc3983bc86c69efb6e9f09584342d60fa928cc5e093dc69/analysis/1407891673/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFiresEnhanced-29676-1-15.zip?fid=1000092089&ttl=1535803963&ri=8192&rs=8192&setec=c5ea1def00a388bfb2223ae3095d52ab"
    },
    {
      "fileId": "1000094605",
      "name": "HearthFiresEnhanced_120",
      "version": "1.20",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32",
      "fileName": "HearthFiresEnhanced-29676-1-20.zip",
      "uploadedUnix": "1391263361",
      "modVersion": "1.20",
      "virusScanUrl": "https://www.virustotal.com/file/acfa30a71d7acd0cba784cd9a65da40e8188a4d1f33089644eff8e3e1698a238/analysis/1407912466/",
      "changelogHtml": " Fix for bard dismiss compatible with USKP <br/> \n Get Bards College students as House Bards after completing the College&#39;s quest <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFiresEnhanced-29676-1-20.zip?fid=1000094605&ttl=1535803963&ri=8192&rs=8192&setec=e7be4625d7ef482f2ab1a5f245597114"
    },
    {
      "fileId": "1000095682",
      "name": "HearthFiresEnhanced_121",
      "version": "1.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "HearthFiresEnhanced-29676-1-21.zip",
      "uploadedUnix": "1391729025",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/78c34e25786ace64f46f281f055cf040467a54e2d0a5b428074e98ad7bed8898/analysis/1407921939/",
      "changelogHtml": " Dismiss the horse the steward got for you <br/> \n Park your own last ridden horse via steward dialogue <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFiresEnhanced-29676-1-21.zip?fid=1000095682&ttl=1535803964&ri=8192&rs=8192&setec=230508170be7ac188e7b82c80175b180"
    },
    {
      "fileId": "1000096390",
      "name": "HearthFiresEnhanced_122",
      "version": "1.22",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "46",
      "fileName": "HearthFiresEnhanced-29676-1-22.zip",
      "uploadedUnix": "1392069823",
      "modVersion": "1.22",
      "virusScanUrl": "https://www.virustotal.com/file/1245c4e90adf580d92d8cd4052384222a097cd49f588b1b756a73ac698fa4d1c/analysis/1407928384/",
      "changelogHtml": " Housecarl dismiss and possiblility to assing different NPCs to the job <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFiresEnhanced-29676-1-22.zip?fid=1000096390&ttl=1535803964&ri=8192&rs=8192&setec=a5b0188cb7b74afae9cdf1fdccc9c4c1"
    },
    {
      "fileId": "1000124330",
      "name": "HearthFiresEnhanced_125",
      "version": "1.25",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "95",
      "fileName": "HearthFiresEnhanced-29676-1-25.zip",
      "uploadedUnix": "1409256993",
      "modVersion": "1.25",
      "virusScanUrl": "https://www.virustotal.com/file/60b32bf0abfa0b6a4a6985ae62c4aec3f7ddcd90365740e435e82d1591b5fe39/analysis/1409257082/",
      "changelogHtml": " Added explicit bed assignment support for hired miners <br/> \n Added a deliver resources quest to cities where a civil war battle took place <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFiresEnhanced-29676-1-25.zip?fid=1000124330&ttl=1535803964&ri=8192&rs=8192&setec=db3e933ff87b08e364b3e36820d51a5f"
    },
    {
      "fileId": "1000125342",
      "name": "HearthFiresEnhanced_126",
      "version": "1.26",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "101",
      "fileName": "HearthFiresEnhanced-29676-1-26.zip",
      "uploadedUnix": "1409865995",
      "modVersion": "1.26",
      "virusScanUrl": "https://www.virustotal.com/file/5e199502022c47271fcfcec4fb975760564b8d40062b6554d2cfdbc238e80644/analysis/1409866082/",
      "changelogHtml": " Added Chaurus Hunter, Vale Deer and Vale Saber Cat as large trophies is DG is present. SKSE required for proper materials to show up <br/> \n Added Mannequin as small trophy. Activate base to equip. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFiresEnhanced-29676-1-26.zip?fid=1000125342&ttl=1535803965&ri=8192&rs=8192&setec=4a4c93c075175baba605e435a3aa4967"
    },
    {
      "fileId": "1000125674",
      "name": "HearthFiresEnhanced",
      "version": "1.27",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "101",
      "fileName": "HearthFiresEnhanced-29676-1-27.zip",
      "uploadedUnix": "1410036843",
      "modVersion": "1.27",
      "virusScanUrl": "https://www.virustotal.com/file/f76ce9f37c172f2b8c3df0d28e494a182ad635c40e5c038c8d67ce05d24c1a8e/analysis/1410036963/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFiresEnhanced-29676-1-27.zip?fid=1000125674&ttl=1535803965&ri=8192&rs=8192&setec=f1717ba086627c3a826119aa1fd5e833"
    }
  ]
}