{
  "modId": 29686.0,
  "modName": "North Keep Player Town",
  "summary": "A player town mod by Kyman3\r\nNorth keep adds new elements to home improvement by giving you an entire village to build upon and foster as your own.",
  "descriptionHtml": "\t\t\t                NORTH KEEP\r\n\r\n\r\nA player Town mod by Kyman 3\r\n\r\nDescription: \r\nAn old castle, North keep has seen its fair share of battle, and was even sacked by the Dremora during the Oblivion Crisis. The old Theign of the keep was arrested by the Thalmor at the outset of the Stormcloak rebellion under shoddy suspicion, and with Sidgier in the Throne of Falkreath, there seems little chance it will return to its former proprietor. However, the Jarl of Falkreath seems to welcome the chance for others to do the hard ruling for him...\r\n\r\nNorth Keep is an upgradeable player abode/player Town, located just north of Half Moon Mill and Moss Mother Cavern. It includes an upgradeable village, a local Trader, a four story manor with guards and a courtyard, an audience hall with a council chamber, a Falmer infested mine, and a barracks which includes 3 Guard Followers (killable) as well as a Guard Captain follower (essential). The newly added Library and its accompanying small dungeon are accessible through the ladder in the Barracks.\r\n\r\n\r\nStorage and Utilities: \r\nThe keep currently includes 5 book cases, 3 manequins, 12 weapon racks, 5 display cases, a fully furnished Theigns quarters, Alchemy and Enchanting Labs, a shrine to Mara, and a small courtyard.\r\n\r\nThe Library, accessible through the Barracks, contains space for 90 books, four additional mannequins, and four additional weapon plaques, as well as plenty of shelving space for clutter.\r\n\r\nGaining the Keep:\r\n In order to gain the keep, you must first help Jarl Sidgier deal with an invading Orc chieftain and his warriors, keen on staking a claim on Helgen. The Orcs can be found on a hill at the Northeast gate of Helgen upon starting the quest. Note there is intentionally no map marker for the orcs, though they are very close to the gates.\r\n\r\nUpgrading the Village: \r\nTo purchase Upgrades for the Village you will need to talk to Almoth the Steward in the Audience Hall, and have a requisite amount of gold. As for now the Upgrades are as follows:\r\n-Docks: adds a Port to The village as well as a fish vendor. Adds a new tariffs box to the council chamber. (10,000 g)\r\n-Stable: For gods sakes think of your poor horse man! (2000 g)\r\n-Village Expansion: Adds an upper section to the village proper, including an alchemy shop, and a new rents box to the council chamber. (7000 g)\r\n\r\nUnder Construction: (in order of priority)\r\n\r\n-Improvements to existing Upgrades\r\n-Additional Upgrades (Merchants Guild, Town Expansion #2)\r\n\r\nWARNING When Updating:\r\nRemember to empty all personal chests, bookshelves, and mannequins before updating. This is a common issue with many House mods. I am not responsible for lost equipment.\r\n\r\n\r\nVersion Change Log:\r\n(version 1.0 and 1.1 are from an obsolete version of this file)\r\n\r\n1.3\r\n-Completed the Library (comes with a small dungeon)\r\n-Added 3 killable followers.\r\n-Minor bug fixes. (Tariffs Box Respawn for base tax now works properly, Follower Friendly Trader. NPC patrol grids)\r\n\r\n\r\nKnown Bugs/Issues:\r\n-If dialogue options for Sidgier do not appear, try reloading your last autosave\r\n-3 of the ore nodes in the mine are harvested simultaneously upon activation of one of the nodes. You still get the proper amount of ore however.\r\n-If you have finished the civil war quest on the stormcloak side, Sidgier can be found in the blue palace.",
  "categoryId": "53",
  "version": "1.3",
  "author": "Kyman3",
  "createdUnix": "1357701199",
  "updatedUnix": "1361815442",
  "containsAdultContent": false,
  "uploadedBy": "Kyman3",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001090",
      "name": "NorthKeep_v_1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "363",
      "fileName": "NorthKeep_v_1_2-29686-1-2.rar",
      "uploadedUnix": "1357701252",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b94a0bdfaa54f760e44820b0637c0012c4a3dc1c6e2d759f76c3ffba66b7c86a/analysis/1407344650/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NorthKeep_v_1_2-29686-1-2.rar?fid=1000001090&ttl=1535803988&ri=8192&rs=8192&setec=9174d167a5435ec7830135cb716e9eac"
    },
    {
      "fileId": "1000013174",
      "name": "NorthKeepV_1_3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "431",
      "fileName": "NorthKeepV_1_3-29686-1-3.rar",
      "uploadedUnix": "1361815442",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/d0c073bbf96b39e9928f668d1b1300965382544d3419cc0d88ac61898bd94bf8/analysis/1407439226/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NorthKeepV_1_3-29686-1-3.rar?fid=1000013174&ttl=1535803989&ri=8192&rs=8192&setec=ff0767cb0bdb98c9ff83a871668b1323"
    }
  ]
}