{
  "modId": 29682.0,
  "modName": "The Tiber Estate",
  "summary": "Up in the Jerall mountains is an estate known as The Tiber Estate. Snowy and windy weather, but still a good place to call home.",
  "descriptionHtml": "So, this is my first mod added to Skyrim Nexus. I\\'ve been working on it for about a month, and i thought some others might appreciate it being uploaded to the Nexus.\r\n\r\nUp in the Jerall mountains, is an estate known as The Tiber Estate. It is a fiar plot of land, most of which had a strong wind breezing through. Other than the Tavern, The Tiber Hearth Tavern, or the Estate manor, there is not much to be done around the estate. Inside the Tiber Manor there is two wings, one being the kitchen, and the other being a display room. \r\nIn the kitchen you will find a Redguard Chef named Savannah. You can but meals from her or make your own using the kitchens vast supplys.\r\nIn the display room, you will find a Dark Elf Jorla Vyrth, who reads alot. From Jorla you can buy spell tomes, mage robes, soul gems, skill books and other wizardly essentials.\r\nThe tables in the main hall are handsomely served with food and mead.\r\nAfter exploring the manor to an extent, you should find a door, which should lead you to the second floor of the Manor. There is little to do on the second floor, save for storing your items in the wardrobes, admiring the small view or sleeping in your bed.\r\n\r\nA quick and informative description if there ever was one.\r\n\r\nI have used some of Oaristys modders resources, so i would like to thank him/her for that.\r\n\r\nThe carriage to The Tiber Estate can be found roughly south of Helgen.\r\n\r\nI appreciate feedback, so if you encounter any bugs, or have any bright ideas concerning the Tiber Estate, i would like to know.",
  "categoryId": "67",
  "version": "1.0",
  "author": "M3HRUNE",
  "createdUnix": "1357694886",
  "updatedUnix": "1357942996",
  "containsAdultContent": false,
  "uploadedBy": "M3HRUNE",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001722",
      "name": "Download",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25450",
      "fileName": "Download-29682-1-0.rar",
      "uploadedUnix": "1357942996",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/76039e2f9ce9e19b8fc516b6d23723b0b0fc1a2bbaf21315cb8130a983e18180/analysis/1407348553/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Download-29682-1-0.rar?fid=1000001722&ttl=1535803984&ri=8192&rs=8192&setec=c0a52754f573ea8c72d50e72320cd125"
    }
  ]
}