{
  "modId": 29708.0,
  "modName": "Sepredia",
  "summary": "Sepredia - an interactive playerhome at Lake Ilinalta",
  "descriptionHtml": "[center][color=#ff0000][size=3][b]\r<br />[/b][/size][/color][/center][center][color=#ff0000][size=3][b][img]http://static-1.nexusmods.com/15/mods/110/images/65163-1-1430164237.png[/img] \r<br />[/b][/size][/color][color=#ff0000][size=3][b]This mod and it&#39;s resources may not be used in paid mods[/b][/size][/color][/center]\r<br />\r<br />[center][size=6][b]Sepredia [/b][/size][/center]\r<br />\r<br />[b][size=4]an interactive playerhome[/size][/b]\r<br />\r<br />[size=4][b]by  Tamira[/b][/size]\r<br />\r<br />Version 1.2\r<br />\r<br />For a diashow go to  https://picasaweb.google.com/Cahadil/Sepredia02\r<br />and click on &#34;Diashow&#34;\r<br />\r<br />Thanks to:  twallace267, hodilton, Brodual for their videos:\r<br />\r<br />[youtube]2bFm6JQnrKI[/youtube]          [youtube]U77q8IE8Fz4[/youtube]\r<br />\r<br />[youtube]fmOGGK7-mE4[/youtube]          \r<br />\r<br />Sepredia is an Ayleid word and means Peace. The previous owner of the house heard this word during one of his many travels to Cyrodiil and named his house after it. Longing for the warmer climate he definitely has emigrated to Cyrodiil and leaves back his house for anyone who wants to live in a placid and homely house.\r<br />\r<br />The house is located at the waterfront of Lake Ilinalta east of the Half-Moon Mill. You can get there from the beginning with fast travel. \r<br />\r<br />The house offers all what the player needs: A chopping block and a little smithy with a (not smoking) smelter behind the house. There is a bee-hive, two chicken and some vegetables in planters, a tanning rack. Inside there are cooking station, enchanter, alchemy station, weapon racks, book shelf, mannequins. \r<br />\r<br />The lights (lantern, torch and candles) outside will be off during daytime. \r<br />\r<br />Inside you will find lots of named containers for assorted storage. Some of them don&#39;t look like containers, for instance a basket with vegetables for the storage of cooking ingredients, a planter with mushrooms for the storage of alchemy ingredients or a static shield for the storage of your looted shields. \r<br />All containers are safe, i. e. they do not respawn. Exception: The bee hive where you can get new honey every now and then and a waste barrel outside where you can get rid of your needless things, which will vanish after some time. \r<br />\r<br />I did not fill all available corners with clutter, I personally do not like those overly cluttered playerhouses. So you have enough free space for your own things. \r<br />\r<br />The special feature of Sepredia is the possibility of interaction. I have added markers at several spots inside and outside of the house that let your avatar perform special animations when you click on them. They all can be found on the ground and have the command &#34;use&#34; (in the pictures it reads &#34;Benutzen&#34; instead of use because I have the German version of the game). You can get out of all animations by simply going forward.\r<br />Important: you have to switch to 3rd-person view before you activate them so you can watch yourself performing the animation and to \r<br />prevent getting stuck there (forward button not always works in 1st person view).\r<br />You can see in the pictures and in the diashow where these animations can be found. I like especially the kneeling animations in front of the shrines as you can activate the shrines while kneeling.\r<br />A remark on the carry-wood-animation: Next to the chopping block behind the house there is a pile of chopped wood &#34;Pick up wood&#34; that you can activate. You can watch your avatar taking wood and carrying it on the arms, now you can walk inside the house to the wood pile &#34;Drop wood&#34; at the fireplace  and watch yourself deposit the wood there. These markers work the other way round too, but it would not make much sense if you did. You can also deposit your chopped wood at the &#34;Pick up wood&#34; pile and so get rid of it.\r<br />\r<br />I had liked to integrate more of these animation markers but all others, like sweeping, warming hands at the fire or leaning at the rail or wall, did not work with my method. There are player animation mods available for this purpose. And followers will not use all of the markers as I found out that they might get stuck with some of these. \r<br />\r<br />In addition I have built in some invisible seats in the exterior: In the rowboat, on a rock at the waterside, several nearby the campfire and at the ledge there. \r<br />\r<br />The house is fully navmeshed so your companions will follow you everywhere. \r<br />\r<br />The official DLC Dawnguard and Hearthfire should be compatible with this mod. \r<br />\r<br />Die deutsche Version ist erhältlich bei (German version available at): \r<br />http://www.worldofelderscrolls.de/?go=dlfile&id=374\r<br />\r<br />Version 1.2:\r<br />==========\r<br />Minor update. Added the meshes for the exterior off-lantern and off-candles (during day time) that I forgot to include. \r<br />Changed the fishing rods to statics. Added a light to the camp fire. \r<br />\r<br />Installation: \r<br />=============\r<br />\r<br />Use the NMM to install/uninstall\r<br />\r<br />or:\r<br />\r<br />Manual installation: copy the Sepredia.esp and the folders meshes, textures and scripts to your Skyrim Data folder and allow to overwrite.\r<br />Manual deinstallation: In your Skyrim Data folder delete: \r<br />Sepredia.esp \r<br />and the subfolders \r<br />Meshes/Tamira/Sepredia\r<br />Textures/Tamira/Sepredia\r<br />\r<br />In the folder Scripts:\r<br />aaCreatureSpawnDisabled.pex \r<br />aaLightsEnableDisable.pex\r<br />\r<br />and in the subfolder Scripts/Source:\r<br />aaCreatureSpawnDisabled.psc\r<br />aaLightsEnableDisable.psc\r<br />\r<br />This mod has been cleaned with TES5Edit.\r<br />\r<br />This mod has been created with the Creation Kit patch 1.8.151.0 and needs the game patch 1.8.151.7 or higher installed for your game to run. \r<br />\r<br />\r<br />Permissions:\r<br />=================\r<br />\r<br />Do not upload this mod anywhere else without my permission. \r<br />\r<br />All resources used were made by myself respectively converted by myself from free 3D files or from Stroti&#39;s stuff for Oblivion.\r<br />\r<br />You may use all these resources for your own mods as long as you mention me as author and in case of conversions the original author of the models. And please add a link where the original resources can be found.\r<br />\r<br />The respective Downloadlinks are:\r<br />\r<br />Conversions of Stroti&#39;s resources from Oblivion to Skyrim:\r<br />Rustic furniture (shelf, table, chair, bench, chest, birdfeeder): http://skyrim.nexusmods.com/mods/24450\r<br />Spinningwheel: http://skyrim.nexusmods.com/mods/25279\r<br />\r<br />Flowering bushes and tropical plant: New Plants http://skyrim.nexusmods.com/mods/22018/\r<br />\r<br />Teddybears: http://skyrim.nexusmods.com/mods/16625/\r<br />\r<br />Antique statue: http://skyrim.nexusmods.com/mods/28732\r<br />\r<br />Pumpkins (Halloween pumpkins) and Static birds:\r<br />TESA Resource Kit http://tesalliance.org/forums/index.php?/files/file/1330-the-tesa-skyrim-resource-kit-project/\r<br />\r<br />All other custom objects I have created myself in Nifskope or/and retextured with Gimp.\r<br />\r<br />\r<br />Credits:\r<br />========\r<br />\r<br />My thanks go to:\r<br />\r<br />Stroti for the wunderful models he created for Oblivion\r<br />Yughues, 3dregenerator, Abitor, Umar6419 for their free 3D models\r<br />Rocket and Bootysweat from the Bethesda Forums for their help with scripts\r<br />\r<br />Forgive me any mistakes I made in this readme or with naming the custom objects in the mod. English is not my native language. Any suggestions for improvements are welcome. \r<br />\r<br />=================\r<br />\r<br />What the Forever Free symbol means:\r<br />http://www.nexusmods.com/skyrim/mods/65163/?",
  "categoryId": "67",
  "version": "1.2",
  "author": "Tamira",
  "createdUnix": "1357754808",
  "updatedUnix": "1358242915",
  "containsAdultContent": false,
  "uploadedBy": "Tamira",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001209",
      "name": "Sepredia - Old version",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9950",
      "fileName": "Sepredia-29708-1-1.7z",
      "uploadedUnix": "1357755242",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0a388a67f6330d036efe3fc6b11a73c71838522f45db2fae095354b9645c8779/analysis/1407345391/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sepredia-29708-1-1.7z?fid=1000001209&ttl=1535804033&ri=8192&rs=8192&setec=63718eb78d569799bc59b7099e63ffd5"
    },
    {
      "fileId": "1000002494",
      "name": "Sepredia",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9992",
      "fileName": "Sepredia-29708-1-2.7z",
      "uploadedUnix": "1358242915",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6e5cc0b243dcc3454d6fd1a4cd98faec7ec12058cdbdda41e55a558d420cdf34/analysis/1407354278/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sepredia-29708-1-2.7z?fid=1000002494&ttl=1535804034&ri=8192&rs=8192&setec=fd4bb0d4a5403577504e240474ff9bb1"
    }
  ]
}