{
  "modId": 2971.0,
  "modName": "Extreme HDR graphic enhancement ENBSeries",
  "summary": "FX: SSAO, Bloom, Lenz fx, true HDR, tonemapping, eye adaptation, customized lighting, depth of field, programmable post processing effects (available separately, f.e. sharpening).",
  "descriptionHtml": "[size=16][b]This is the only one true HDR mod for TES Skyrim, all other are fake. It uses 12 passes for computation of HDR and have other effects not used at any games yet, implemented first at this mod. Some of effects exist only in DirectX11 of Unreal Engine. The main feature is that player may customize everything and make own look of the game, it\\'s a high-end tool for elite, not just a mod for lazy or fool gamers.[/b][/size]\r\n\r\n[color=red]New version is in development, previous were too much slow or buggy. Thanks for patience.[/color]\r\n\r\n[b]Gallery of the mod is here:[/b] [url=http://enbseries.enbdev.com/forum/viewtopic.php?f=14&t=17]http://enbseries.enbdev.com/forum/viewtopic.php?f=14&t=17[/url]\r\n\r\nUpdated: 9 feb 2012\r\nAdded v0.105. It\\'s same as 0.103, but SSAO is disabled and optimized at full. Also it support laptops, some incompatible software and Steam.\r\n\r\n[b]Depth of field effect is implemented by other users, find it on skyrimnexus. Also don\\'t forget to download user made presets as they are better than default.[/b]\r\n\r\nOfficial site of ENBSeries with updates and other mods [url=http://enbdev.com]http://enbdev.com[/url]\r\nMy own and users presets will be posted on the forum there.\r\nDocumentation to it i\\'ll publish later on the site.\r\n\r\n[color=yellow][b]This mod allow to customize game on your own taste. If you don\\'t like how it look or how did i, no problem, tweak a lot of parameters[/b][/color]\r\n\r\nAdded another preset on my site, tried to restore in it how game looks like on old screenshots. You can change everything at any moment yourself.\r\n\r\nThis shader may be useful [url=http://enbdev.com/effect_blursharpshift.zip]http://enbdev.com/effect_blursharpshift.zip[/url] extract effect.txt to game folder (but first have a look without it, to compare).\r\nIn future i\\'ll publish more presets separately.\r\n\r\n\r\n[b]LATEST CHANGES:[/b]\r\nV0.105: SSAO disabled, performance optimized at maximal possible level.\r\n\r\nV0.103: Implemented injector for fixing some compability with Optimus laptops.\r\n\r\nV0.102: Optimized performance partially, fixed few bugs.\r\n\r\nV0.101: Fixed bugs of previous version (at least what is see). Added code of programmable\r\nexternal depth of field effect (only added, but \\\"todo\\\"). With ne enbeffectprepass.fx shader file you can make more than just depth of field, it\\'s executed before enbeffect.fx and working with hdr values in multipass mode (up to 8 passes). Changed standart of external shaders, removed ScreenScaleY and ScreenSize replaced by vector of 4 values. Most of old effects will not work, replace in them ScreenScaleY with ScreenSize.z and float ScreenSize; with float4 ScreenSize;. Increased quality of bloom and removed parameters of radius 1 and 2 for it.\r\n\r\nV0.100: Removed parameter CyclicConfigReading (it read configuration file every 5 seconds), from now this will be handled by pressing a button BACK (can be changed KeyReadConfig). Added almost all code from my patch AntiFREEZE TES Skyrim 0.096, including most of it parameters. FPS limiter implemented, fps counter. Screenshot capturing is back, but different key assigned. SSAO effect now have additional \\\"lite\\\" version. To switch it setup parameter UseIndirectLighting=false in enbseries.ini file and restart the game. SSAO work with antialiasing now. Added values to control SSAO distance relative to fog distance. Night and day time are separated. Properties for adaptation in enbseries.ini are finished, but they are partially clamped by limits in enbeffect.fx, so if you wish to control by enbeffect.ini only, remove limit code in shader (or wait when i\\'ll post new shader). Added parameters for SubSurfaceScattering to reduce lighting in shadows for characters and ugly thin line on them (game bug). Added parameter for control of lights from windows, but it affect some fx, for example freeze spell. Added ShadowObjectsFix to apply\r\nshadows from mountains properly. Various bug fixes. \r\n\r\nV0.099: Fixed crash in the evening. Added palette texture support (enbpalette.bmp, tga, png files). Now you may turn on/off the mod by keys SHIFT+F12. Removed screenshot capturing. New enbeffect.fx file included. Presets not configured, do this for own taste. SSAO disabled by default in enbseries.ini.\r\n\r\nV0.098: Improved stability by implementing game bugfixes from AntiFREEZE patch. Official game 1.3 patch still has same problems as before (((.\r\n\r\n\r\n[b]!!!WARNING!!![/b]\r\nThis is third release of the mod, i decided to publish it at the current state, because game patches appear too much frequently and i can\\'t now fix all the bugs in the game, so don\\'t expect high performance from this version or good compability.\r\n\r\n\r\n[b]WHAT IS IT:[/b]\r\nIt\\'s graphic enhancement with big amount of controls for users, you may tweak how game looks like by yourself, add post processing shader effects to it.\r\n\r\n\r\n[b]WHAT IT CAN:[/b]\r\nModify brightess in HDR for clouds, stars, aurora, sun, moons (sun and moons textures must be unchanged at first pixel color on them, gray and black accordinly), sun corona, sun light, ambient light, textures gamma. SSAO gives high quality look of character\\'s skin (and not only). Eye adaptation is not annoying as in vanilla game and could be modified (in enbseries.fx shader file in beta). Additional post processing fx can be found on my web site or in the i-net (i can do some by request).\r\n\r\n\r\n[b]VIDEOS:[/b]\r\nThese are old videos with this mod (but different configs, you must tweak by yourself now).\r\n[url=http://www.youtube.com/watch?v=JhIfBNKZKyQ]http://www.youtube.com/watch?v=JhIfBNKZKyQ[/url]\r\n[url=http://www.youtube.com/watch?v=-L-HT2YmqUY]http://www.youtube.com/watch?v=JhIfBNKZKyQ[/url]\r\n\r\n\r\n[b]PERFORMANCE:[/b]\r\nThis mod use very complex SSAO method (my own) and by default it\\'s turned on, so if you play at high resolution, performance hit will be very noticable. To make game much faster, set EnableAmbientOcclusion=false in the enbseries.ini file or configure quality of SSAO under category [SSAO_SSIL]. Descriprion to some parameters is on my site in the documentation section and in readme_en.txt of mods for GTA4 or Deus Ex HR.\r\n\r\n[b]BUGS OR KNOWN PROBLEMS:[/b]\r\nEffects are turning on or off after few seconds when pressed SHIFT+F12 keys. This is not a bug, set CyclicConfigReading=false in the enbseries.ini file.\r\nIn SkyrimPrefs.ini parameter bFloatPointRenderTarget must be 1.\r\nFog is too bright, this can be fixed by reducing FogColorMultiplier or increasing all lights intensity together.\r\nMod may not work correctly with other d3d9.dll\r\nXFire, Afterburn, Mumba, EVGA and some other overlay software not supported, close them.\r\n\r\n\r\nIf you like it, support development by donation or good words.\r\n\r\nThanks!",
  "categoryId": "62",
  "version": "106",
  "author": "Boris Vorontsov",
  "createdUnix": "1323307541",
  "updatedUnix": "1331724450",
  "containsAdultContent": false,
  "uploadedBy": "BorisVorontsov",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43222",
      "name": "Read info",
      "version": "106",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Read info-2971-106.zip",
      "uploadedUnix": "1331724450",
      "modVersion": "106",
      "virusScanUrl": "https://www.virustotal.com/file/0c7e7053696822061e19508406248a70daf43974a7b9d6b78bc9e79fdea5b107/analysis/1406748582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Read%20info-2971-106.zip?fid=43222&ttl=1535757657&ri=8192&rs=8192&setec=0217feaca12df727119cbaff8fff5835"
    }
  ]
}