{
  "modId": 29728.0,
  "modName": "Cultist Regalia",
  "summary": "Delve into the resting place of an ancient Dragon Cultist warlord and uncover his greatest treasure.",
  "descriptionHtml": "[IMG]https://imagizer.imageshack.us/v2/800x400q90/801/cultistregalia.png[/IMG]\r<br />\r<br />\r<br />\r<br />   Version 2 is finalized and available for download. Should have no CTD issues, as i have moved the entrance to Gravuunheim  to southern Falkreath, near the Hammerfel border.  I have also expanded the dungeon to include a cut-off portion of the old catacomb and cave.   \r<br />\r<br />Due to continuing personal adversity, I&#39;be been on a modding hiatus since the last update, both for this mod and my other mod, Nordic Spellweaver Armor, So for now no more updates are planned. This may change soon, or may not. I&#39;m definitely not abandoning the mod, and do have updates in mind. But for now my mods are &#34;As Is&#34;. Thank you all for your support and endorsements.                     \r<br />\r<br />\r<br />  [color=blue]Brodual, everybody&#33;[/color]\r<br />\r<br />                                    [youtube]bh283E1xyT0[/youtube]\r<br />\r<br />\r<br />\r<br />&#34;In days of old, when dragons ruled the earth, there lived mortal men who worshiped the beasts as gods. These Dragon Priests are long since dead... but something has awoken them from their ancient slumber...&#34;\r<br />\r<br />\r<br />\r<br />\r<br />[IMG]http://imageshack.us/a/img233/4134/descriptiono.png[/IMG]\r<br />\r<br /> Delve into and ancient temple to recover the armor of a cultist warlord.\r<br />\r<br />Cultist Regalia adds two new dungeons to Skyrim: Hahnuheim and Gravuunheim, And the opportunity to lock blades with an ancient master of arms and uncover his armor.\r<br />\r<br />Also a lot of undeadies. \r<br />\r<br />\r<br />Headdress - 21 Armor\r<br />Hauberk-  43 Armor\r<br />Greaves-  16 Armor\r<br />Gauntlets- 16 Armor\r<br />\r<br />Same as Ebony. If you feel that&#39;s too much, open your CK. If there&#39;s a consensus that it&#39;s too high, ill lower it to Dwarven. Or leather. Or the freakin&#39; Thalmor robes. the hooded variety.\r<br />\r<br />Light version soon. Or not. Don&#39;t know.\r<br />\r<br />Known issues? First person can be sketchy. Missing arms i believe. \r<br />\r<br />\r<br />Be not afraid to wear the helmet as a beast race. I&#39;m sure the smithy can work the metal to fit your ugly head.\r<br />\r<br />The dungeons are fairly straight forward. The first one, Gravuunheim, was my first cell i&#39;d ever created, so its very small. But the mountain in which it sits is prone to seismic activity, and the ruins are very, very old. They have given way to an ancient part of the temple sealed off millenia ago. To enter, Travel to Cracked Tusk Keep, southwest of Falkreath, and head west. The exit is technically out of bounds on the Tamriel worldspace (It had to be for practical aesthetic purposes, though only slightly) So upon exiting, you will be teleported a short distance away near the border.\r<br />\r<br />It was a catacomb for the Dragon Cult warlord Ardmul&#39;s legion. Thousands of ancient nords were burried there upon Alduins defeat, that one day they may rise again to serve him. Many of the old halls have collapsed throught the centuries, and the once-mighty Autumnforge(in the modern tounge) has been reduced to a handful of chambers and halls. But it is within its crumbling walls lies the key to Hahnuheim, Ardmul&#39;s resting place.\r<br />\r<br />\r<br />In ancient days, when the Nordic people were enslaved to the dragons and their mortal thralls,\r<br />They built sprawling underground cities and catacombs to both live and worship their deities, the Dragons. Hahnuheim was one such city carved into the mountains just west of Ironbind Barrow. Phumb its secrets and deafeat the dark warlord Ardmul, or join the dead who walk its halls.\r<br />\r<br />[IMG]http://imageshack.us/a/img254/9805/creditsb.png[/IMG]\r<br />-Again, a large portion of the credit for this mod goes to Nightasy of Nightasy.com for teaching me how to create armor for Skyrim.\r<br />-83Willow, for taking some kick-ass screens of my armor and promoting it. You rock&#33;\r<br />-Bethesda, For inspiring me to create and share my dungeons, and for giving us all the power to edit the game as we see fit.\r<br />-You, the user, for taking the time to view the mod, download and even endorse. It keeps me motivated and willing to keep creating and sharing. Thanks guys&#33;\r<br />[IMG]http://imageshack.us/a/img15/1326/permissionse.png[/IMG]\r<br />You are permitted to install, and use this mod as intended by the mod author.\r<br />You are permitted to make changes to this mod in whatever way you see fit once it is on your hard drive.\r<br />You are permitted to upload this mod as a translation with the permission of the mod author.\r<br />\r<br />You are not permitted to re upload this mod in any form, including its parts, without permission from the mod author.\r<br />You are not permitted to upload this file to any domain other than the Nexus family of sites.\r<br />\r<br />\r<br />\r<br />Thank you,\r<br />Peter Keller\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br /> \r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />",
  "categoryId": "54",
  "version": "2.0",
  "author": "Peterkeller",
  "createdUnix": "1357803028",
  "updatedUnix": "1359175959",
  "containsAdultContent": false,
  "uploadedBy": "peterkeller",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001345",
      "name": "Cultist Regalia",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7810",
      "fileName": "Cultist Regalia-29728-1.rar",
      "uploadedUnix": "1357803225",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/bcd1a750ece2f415ef928550e6ee3fe08b54301466368fc90de7cb5c7955181c/analysis/1407346164/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cultist%20Regalia-29728-1.rar?fid=1000001345&ttl=1535804063&ri=8192&rs=8192&setec=ef911b46b4472b6095a01b6919295c5d"
    },
    {
      "fileId": "1000004898",
      "name": "Cultist Regalia V2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7692",
      "fileName": "Cultist Regalia V2-29728-2-0.rar",
      "uploadedUnix": "1359175959",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a91e1930778c9e8393c1b1e900f81b31692f33a7c14ef924e360b03ccd5b78b0/analysis/1407378959/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cultist%20Regalia%20V2-29728-2-0.rar?fid=1000004898&ttl=1535804063&ri=8192&rs=8192&setec=45ae4c401ed276dfbb55726f60b6e3f9"
    }
  ]
}