{
  "modId": 2973.0,
  "modName": "The REAL Fus Ro Dah -Unrelenting Force Shout from Trailer-",
  "summary": "Replaces the original Unrelenting Force shout with the epic one from the Skyrim Official Gameplay Trailer. Includes a no-chant version and chanting version. Also includes female shouts as well!",
  "descriptionHtml": "\r\n[center][b]This mod is now available on the Steam Workshop!\r\n[url=http://steamcommunity.com/sharedfiles/filedetails/?id=19060]Shout Only[/url]\r\n[url=http://steamcommunity.com/sharedfiles/filedetails/?id=21587]Shout with Chant[/url][/b][/center]\r\n\r\n[size=4][color=#66CCFF]Description:[/color][/size]\r\n\r\nThis mod replaces that boring old \\\"Fus....roDah!\\\" of the Unrelenting Force shout with the epic shout from the [url=http://www.youtube.com/watch?v=PjqsYzBrP-M&feature=player_detailpage#t=66s]Skyrim Trailer![/url] Both versions of the shout apply to males and females of all races, while females have their own special version for each shout.\r\n\r\n\r\n\r\n\r\n[color=#33FFFF][center][size=3]The first version is the \\\"[b]Shout Only[/b]\\\" version. This version has been hand-edited to remove all extra background noise, chanting, and orchestra.\r\n\r\nThe second version is the \\\"[b]Shout with Chant[/b]\\\" version. This includes the shout and about five seconds of chanting after the shout, which then dissolves into a smooth fade out.[/size][/color]\r\n\r\n\r\n\r\n\r\n[color=lightblue]This video features both versions of this mod. Note that the muted-thunder sound effect option is also installed, which makes the shout sound much better in my opinion![/color]\r\n\r\n[youtube]09G_Nt36Zvg[/youtube][/center]\r\n\r\n\r\n\r\n\r\n[size=4][color=#66CCFF]Installation:[/color][/size]\r\n\r\n[b][color=#66FF33]NMM Users:[/color][/b] If you\\'re new to Skyrim modding, I recommend downloading the [url=http://skyrim.nexusmods.com/content/modmanager]Nexus Mod Manager[/url]. Once it\\'s installed on your computer, simply click the \\\"Download With Manager\\\" button on this page and activate the mod in NMM. The installer will provide various options for you to choose from.\r\n\r\n[b][color=yellow]Wrye Bash Users:[/color][/b] The archive is in a BAIN-ready format - just drag \\'n\\' drop into your Bash Installers folder, check off the sub-packages that you want to use in BAIN, and install.\r\n\r\n[b][color=gray]Manual (Not recommended):[/color][/b] Choose which files you want to use, and extract the archive into your Skyrim \\'Data\\' directory. By default, it should be in:\r\nC:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\Skyrim\\\\Data\r\n\r\n\r\n\r\n\r\n[size=4][color=#66CCFF]Un-installation:[/color][/size]\r\n\r\nSimply deactivate the mod with whichever mod managing utility you used to install it, or delete the files that you installed if you did it manually.\r\n\r\n\r\n\r\n\r\n[size=4][color=#66CCFF]Known Issues/Bugs:[/color][/size]\r\n\r\nThis isn\\'t really a bug, but rather an intended side effect. In order to get the full \\\"Fus Ro DAH\\\" sound to be on sync with the shout blast, I had to make some tweaks to the other Fus Ro Dah sound files. I was able to leave \\\"Fus!\\\" untouched, so it will sound the same as the original. However, I had to modify \\\"Fus Ro\\\" so that you will shout the full \\\"Fus Ro Dah\\\"... Here\\'s the explanation why:\r\n\r\nThe game has a weird way of handling shouts. For every shout, there are a total of four sound files associated with the full shout: \r\n\r\n[b]1.[/b] The 1st word (\\\"Fus!\\\") \r\n[b]2.[/b] The 1st word leading into the 2nd/3rd word (\\\"fuuus...\\\") \r\n[b]3.[/b] The 2nd word (\\\"Ro!\\\") \r\n[b]4.[/b] The 2nd AND 3rd word combined (\\\"RoDah!\\\") \r\n\r\nFor example, if you were to shout \\\"Fus!\\\", that will only play the 1st sound file; shout \\\"Fus...Ro!\\\", and it will play the 2nd followed by the 3rd file; shout \\\"Fus...RoDah!\\\" and it will play the 2nd file followed by the 4th sound file. As you can see, the game by DEFAULT combines the two words in the last sound file, which makes it really difficult, if not impossible, to separate the two words and still maintain a sound and visual effect that are on sync with each other. If I were to alter the shout where you can still say \\\"Fus Ro,\\\" you would at least hear the \\\"Ro!\\\" and see the shout blast at the same time. However, if you were to shout \\\"Fus Ro Dah,\\\" you would still see the shout blast on \\\"Ro\\\" instead of \\\"Dah!\\\" (just like it is originally), leading to an annoying off-synced shout that most people would probably not want to use at all. I tried countless times looking for a workaround for this problem, but due to the game\\'s shout mechanics, my only option was just to replace \\\"Fus Ro\\\" and \\\"Fus Ro Dah\\\" with the full \\\"Fus Ro Dah\\\" sound.\r\n\r\n\r\n\r\n\r\n[size=4][color=#66CCFF]Changelog:[/color][/size]\r\n[list]\r\n[color=yellow][b]0.5[/b][/color]\r\n[*]Created an All-in-One installer for NMM and BAIN users\r\n[*]Made small improvements to some sound files\r\n\r\n[color=orange]v0.4.1[/color]\r\n[*]Added a higher-pitched female version, by request\r\n\r\n[color=orange]v0.4[/color]\r\n[*]Created exclusive female shouts for the \\\"Shout-Only\\\" and \\\"Shout-with-Chant\\\" versions\r\n[*]Improved every version by amplifying and adding precise bass boosts to certain sections of each sound file\r\n[*]Cleaned up the original Chanting version - there is no longer a \\\"crack\\\" sound at the very beginning of the shout\r\n[*]Also cleaned up the Shout-Only version by removing that tiny fuzz noise at the very beginning\r\n[*]Synced up the sound and visual effect on every version\r\n[*]Made the muted-thunder sound effect an optional download. (Still recommended!)\r\n\r\n[color=orange]v0.3[/color]\r\n[*]Completely removed all background noise from the shout. Added female version for shout-only.\r\n[color=orange]v0.2[/color]\r\n[*]Added fade-out effect in the no-chant version\r\n[color=orange]v0.1[/color]\r\n[*]Initial Release\r\n[/list]\r\n\r\n\r\n\r\n[size=4][color=#66CCFF]My Other Mods:[/color][/size]\r\n[list]\r\n[*][url=http://www.skyrimnexus.com/downloads/file.php?id=5794]Super Mario Death Sound[/url]\r\n\r\n[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=11108]CF - True Realistic Lighting[/url]\r\n[/list]\r\n\r\n\r\n\r\n\r\n[size=4][color=#66CCFF]Tools Used/Credits:[/color][/size]\r\n[list]\r\n[*]Audacity\r\n[*]Agnahim\\'s [url=http://skyrimnexus.com/downloads/file.php?id=950]Voice file extractor[/url]\r\n[*]FOMM\\'S BSA Browser\r\n[*]DirectX SDK (June 2010)\r\n[/list]",
  "categoryId": "61",
  "version": "0.5",
  "author": "xchargerfanx AKA RoidRage9000",
  "createdUnix": "1323311095",
  "updatedUnix": "1330594576",
  "containsAdultContent": false,
  "uploadedBy": "xchargerfanx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "38773",
      "name": "The REAL Fus Ro Dah",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "455",
      "fileName": "The REAL Fus Ro Dah-2973.7z",
      "uploadedUnix": "1330594576",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/9b7d9dd3fe6c5ac5ccec1b853cccd336487495c02df933a56643d2ac77c8e547/analysis/1406722892/",
      "changelogHtml": " Added an All-in-One installer for NMM and BAIN users <br/> \n Slightly improved the quality of some sound files <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20REAL%20Fus%20Ro%20Dah-2973.7z?fid=38773&ttl=1535757662&ri=8192&rs=8192&setec=bf1b4a3b8ffdc73fdd3e5e8a6befbfeb"
    }
  ]
}