{
  "modId": 29740.0,
  "modName": "Intensive Dungeons WIP",
  "summary": "This is a Work in Progess Dungeons featuring many encounters and treasures.",
  "descriptionHtml": "English:\r\n\r\nThis is a Work in Progess New Dungeons featuring many encounters and treasures through leveled lists.  The scope of this mod is adding a more challeging dungeons were you can go and fight, kill or whatever you want.\r\n\r\nThe first dungeon is currently a beta, tested a few times to ensure it´s work correctly.\r\n\r\nDungeons:\r\n\r\nLars´s Tomb-> near Riverwood (See Screens).\r\n\r\nCompatibility:\r\n\r\nMods changing the respawns, treasures, weapons, etc.\r\n\r\nIncompatibility:\r\n\r\nOnly the mods modifing the exterior cell where this first dungeon is located.\r\n\r\nOther Stuff:\r\n\r\nI planned to add more and more dungeons, they are not going to be \\\"inmersive\\\" or quested, but i don´t want the break the lore-friendly gaming. The difficult of the dungeons are going to be progressive, but the dungeons located near \\\"easy\\\" locations are going to be easy. Those in far places maybe are going to be more difficult. All Intensive Dungeons are marked as \\\"ID-\\\".\r\n\r\n\r\n\r\nEspañol:\r\n\r\nEste mod incluirá una serie de mazmorras repartidas por Skyrim, con buena cantidad de criaturas a las que vapulear y tesoros que saquear.\r\n\r\nEl primer dungeon es una beta testeada lo suficiente para saber que no dará fallos graves al juego, como salidas al escritorio o partidas guardadas corruptas.\r\n\r\nEn principio todo será creado en ingles, pero no tardaré en sacar un parche en español cuando tenga un grupo mas nutrido de mazmorras.\r\n\r\nMazmorras:\r\n\r\nLars´s Tomb (Tumba de Lars)-> Cerca de Cauce Boscoso (mirar las imagenes)\r\n\r\nCompatibilidades:\r\n\r\nEl mod es compatible con cualquier que modifique los respawns, tesoros y demás. Podeis usarlo con Inmersive Weapons, Inmversive Armors, Deadly Dragons y un largo etceterá.\r\n\r\nIncompatibilidades:\r\n\r\nNinguna, salvo que tengas un mod que ya modifique la celda en la que esta situada mi mazmorra en el exterior.\r\n\r\nOtras Cosas:\r\n\r\nTengo planeado ir ampliando este mod poco a poco, añadiendo mas mazmorras cada vez mas dificiles, en principio, aquellas que aparezcan en zonas faciles seran mas o menos faciles, y al final habrá mazmorras escondidas con criaturas dificiles a las que enfrentarse. Las mazmorras no serán del todo inmersivas, por que carecerán de quests ligadas a ellas, pero quiero mantener el lore del juego. No encontrareis vampiros y licantropos juntos por ejemplo. Todas las mazmorras seran marcadas con \\\"ID-\\\" para indicar que pertecen a Intensive Dungeons de manera que sabreis si os estais metiendo en una mazmorra del juego normal o en una de este mod.",
  "categoryId": "88",
  "version": "0.8",
  "author": "Ertos",
  "createdUnix": "1357827550",
  "updatedUnix": "1357827550",
  "containsAdultContent": false,
  "uploadedBy": "Ertos",
  "primaryFile": null,
  "files": []
}