{
  "modId": 29746.0,
  "modName": "Amulet of Power",
  "summary": "Original name, right?  The Amulet of Power adds a unique amulet across the river west of Riverwood, along with a chest, enchanting table, hostile NPC, and extra loot.  This is my first mod (well the first one that works) so be gentle.",
  "descriptionHtml": "[color=#58FAF4][img]http://fc05.deviantart.net/fs71/f/2013/010/7/7/1_by_stickyninjaz-d5r1fuq.png[/img]\r\nOriginal name, right?  The Amulet of Power adds a unique amulet across the river west of Riverwood, along with a chest, enchanting table, hostile NPC, and extra loot.  This is my first mod (well the first one that works) so be gentle.\r\n\r\n[u][b]Requires[/b][/u]\r\nSkyrim, latest update.\r\n[u][b]Install[/b][/u]\r\nDrop AmuletOfPower.esp and AmuletOfPower.bsa into your Skyrim\\\\Data folder.\r\n[u][b]Uninstall[/b][/u]\r\nDelete AmuletOfPower.esp and AmuletOfPower.bsa \r\n\r\n[img]http://fc09.deviantart.net/fs71/f/2013/010/3/6/2_by_stickyninjaz-d5r1fuk.png[/img]\r\nThe Amulet is a retexture of the Necromancer Amulet, with a unique enchantment.  The in-game description is a little vague, that\\'s because I prefer short descriptions to lengthy ones, check your active effects or read on.  I\\'ve grown tired of equipping crafting gear every time I need to sharpen a sword or brew a few potions, this amulet remedies that by providing enchantments useful for combat and crafting.\r\n\r\n[list] [*]Time Between Shouts Is Reduced %20\r\n[*]Fortify Alchemy %50\r\n[*]Fortify Smithing %50\r\n[*]Fortify Enchanting %30\r\n[/list]\r\nThe aim is to buff crafting enough that a separate set of crafting gear (plus enchanting potions) isn\\'t needed, without making late-game crafting too overpowered.  The shout cooldown is pretty universal, any Dovahkiin can benefit from it regardless of their specialty.\r\n\r\n[img]http://fc09.deviantart.net/fs71/f/2013/010/2/0/3_by_stickyninjaz-d5r1fu9.png[/img]\r\nA powerful artifact cannot be unguarded, so the Smuggler protects his treasure and is ready for a fight.  He is Bandit Boss level, hopefully this provides enough challenge that low level players will have to use caution.  He occasionally wanders off to hunt wildlife but he shouldn\\'t bother the residents of Riverwood, and he always returns to his treasure.\r\n\r\n[img]http://fc09.deviantart.net/fs70/f/2013/010/6/9/4_by_stickyninjaz-d5r1fu1.png[/img]\r\nThis project started out as the \\\"Enchanting Starter Kit\\\" and as such the chest contains 10-20 filled soul gems and a few uncommon enchantments.  I\\'ve always thought it was unfair that a new player could get started on smithing and alchemy when they reach Riverwood, but not enchanting, actually low-level enchanting altogether is pretty limited.  My intent was to remedy this without unbalancing the game, so you won\\'t find ultra-rare or high-level enchantments in the chest, just some less common ones and soul gems to give new players a little help.\r\n\r\n[img]http://fc04.deviantart.net/fs70/f/2013/010/3/c/5_by_stickyninjaz-d5r1ftv.png[/img]\r\nThere is a story to the amulet, the smuggler and the treasure, anyone willing to do a little investigating can find out the truth.  Clues scatter the area, keep your eyes open.  There is no quest to solve the mystery or reward for doing so, it\\'s just there for lore and roleplay.\r\n\r\n[u][b]Balance[/b][/u]\r\nEverything was designed to my tastes and my idea of fair gameplay, I am eager to hear your opinions and suggestions.  Remember this is my first mod, some things may conflict or be broken, please report problems so that I may correct them.\r\n\r\n[u][b]Credits[/b][/u]\r\nBethesda for Skyrim and the Creation Kit\r\nThe Nexus community for inspiration\r\nGimp, Nifskope, TES5Edit\r\nGoogle, every step of the project I had to search for something.\r\n\r\n[u][b]Permission[/b][/u]\r\nThis is a Nexus exclusive, do not upload any part of it elsewhere.  Please speak to me regarding additional permissions.\r\n\r\nCheck out my other mods: [url=http://skyrim.nexusmods.com/mods/30361]Summon NecroShade[/url] and [url=http://skyrim.nexusmods.com/mods/30891]Randomized and Respawning Followers[/url].\r\n[/color]",
  "categoryId": "92",
  "version": "1.0",
  "author": "Mateodon",
  "createdUnix": "1357838360",
  "updatedUnix": "1357838467",
  "containsAdultContent": false,
  "uploadedBy": "Mateodon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001423",
      "name": "AmuletOfPower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "107",
      "fileName": "AmuletOfPower-29746-1-0.7z",
      "uploadedUnix": "1357838467",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cff4e002b70251de600998968c999a133505606e51f6c62becad605864cee0d6/analysis/1407346652/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AmuletOfPower-29746-1-0.7z?fid=1000001423&ttl=1535804105&ri=8192&rs=8192&setec=18c1e8a7a0ed847bbfd04e0534ab152c"
    }
  ]
}