{
  "modId": 29760.0,
  "modName": "Frightening Vampires Power of the Grave",
  "summary": "Tweaks to the Vampire effects and spells to make Vampires truly more powerful and something to be feared. Requires Dawnguard. NOT SUPPORTED&#33;",
  "descriptionHtml": "[center][u][b]Frightening Vampires: Power of the Grave[/b][/u]\r<br />***Requires Dawnguard***\r<br />[b]Mod is no longer supported&#33; Use at your own risk&#33;\r<br />This mod is now a modders resource, but if you wish to use it in your own file, you must ask permission first. Using it without permission will be considered theft.[/b] [b]And, with the rise of paid mods on Steam, this mod is Nexus only. I made this for free. Why should you profit from my work?[/b]\r<br />\r<br />[b][i]Description:[/i][/b]\r<br />Frightening Vampires: Power of the Grave is a mod designed to increase the power and weaknesses of the Vampires found within Skyrim. Personally, I&#39;ve always found vanilla Vampires to be weaker than the should be; I expected them to be strong, something that should be feared. They weren&#39;t. \r<br />\r<br />Even playing as a Vampire, I found the spells that we gained were a little too weak. Vampiric Drain was almost rendered obsolete on Master difficulty. Vampire&#39;s Seduction wasn&#39;t strong enough to serve any purpose. The one thing I thought was perfectly fine was the weaknesses and bonuses: 100% weakness to Fire and 100% resistance to Frost at Stage 4 with the default Vampiric 100% resistance to disease and poison. Of course, Dawnguard came along and changed all of that. \r<br />\r<br />I took it upon myself, mostly because of boredom, to change that.\r<br />This mod significantly increases the might of both PC and NPC Vampires. You&#39;ll find your Vampiric Drain does significantly more damage (maxing out at 25 points per second at Stage 4 for the Player and double that for NPC vampires), and the Dawnguard weaknesses and resistances have been returned to their pre-Dawnguard levels. You&#39;ll also find that the weaknesses for Vampire Lords in daylight have been increased. They should no longer regenerate health, stamina, and magicka in daylight; or, if they do, it should be at extremely reduced levels. This provides a reason to use Auriel&#39;s Bow. Along with that, Vampire Lords should now have a 100% weakness to fire. \r<br />\r<br />Also included in the mod is a novice level Illusion spell which will instantly turn the player into a Vampire. It is known as Vampire&#39;s Thirst and can be found in random loot, and is sold by merchants. \r<br />\r<br />[b]WARNING:[/b] this mod is not intended for lower-leveled or &#34;weak&#34; characters. It was technically designed to compliment my preference for using overpowered characters and, as such, will not suit everybody&#39;s desires. I certainly don&#39;t plan upon reducing the damage done by NPC Vampires. If you want to survive their attacks, it is recommended that you have a very high spell absorption or a very high resistance to magic. Otherwise... You&#39;ll be a snack for the Vampires. \r<br />\r<br />To install, simply drag and drop the .esp file into your Data folder. Make sure you have Dawnguard and the latest Skyrim patch before using it.\r<br />\r<br />Yes, this does affect ALL NPC Vampires and the player. The Vampiric Drain attacks of Serana, Valerica, Harkon, and the others should be significantly stronger. Assuming I got it right. \r<br />\r<br />[b][i]Compatibility:[/i][/b]\r<br />This mod is, by nature, incompatible with any mod that alters Vampires and their strengths and weaknesses.\r<br />You&#39;d be best using this with no other Vampire altering mods.\r<br />\r<br />[b][i]Recommended Mods:[/i][/b]\r<br />Because this mod alters the damage done by Vampiric Drain spells, it is recommended that you install [url=http://skyrim.nexusmods.com/mods/28235]When Vampires Attack[/url] by Arthmoor. It should help reduce the number of NPC casualties when any Vampires attack. PC casualties? Well, that&#39;s up to the player. \r<br />\r<br />Have fun, and don&#39;t forget the healing potions.[/center]\r<br />\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/xLdZTNC.png[/img][/url][/center]",
  "categoryId": "75",
  "version": "1.0",
  "author": "CaptainMauin",
  "createdUnix": "1357861740",
  "updatedUnix": "1385160233",
  "containsAdultContent": false,
  "uploadedBy": "CaptainMauin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001506",
      "name": "Frightening Vampires V1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Frightening Vampires V1-29760-1-0.zip",
      "uploadedUnix": "1357861777",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f6646d34230b00308322907012c2742cf759f82359bc0cc13ee6e9a352347c1/analysis/1407347066/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Frightening%20Vampires%20V1-29760-1-0.zip?fid=1000001506&ttl=1535804119&ri=8192&rs=8192&setec=9953b7776698602724082517f82e8d47"
    },
    {
      "fileId": "1000081885",
      "name": "Frightening Vampires II",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Frightening Vampires II-29760-2-0.7z",
      "uploadedUnix": "1385160233",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/b52475df0dbc1d70e7a440e47a9b1060a679b227acb179437f28b3d7f531fa33/analysis/1407803782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Frightening%20Vampires%20II-29760-2-0.7z?fid=1000081885&ttl=1535804120&ri=8192&rs=8192&setec=d1adbe561a4df326a4ebea5911cccadc"
    }
  ]
}