{
  "modId": 29768.0,
  "modName": "Lydia Change Your Damn Armour",
  "summary": "Makes every followers armor change-able.",
  "descriptionHtml": "[FONT=Century Gothic][img]http://i.imgur.com/aXi3g.png[/img]\r\nThis mod makes all the Skyrim followers armor change-able. Before, if you were to trade with your follower they wouldn\\'t actually have what they were wearing. The only way you could change it is to give them apparel with a higher Armor Rating. Which is generally fine and dandy, but what if you want to give Lydia some sexy clothes, or give your brute follower some sneaky gear for those times of need? You couldn\\'t. Now, you can. This mod is fully compatible with UFO, don\\'t worry about incompatibilities. And if by some extremely weird occurrence you do find something that alters what this mod alters, just put my mod before theirs in load order. (Also, post in the comment section so I can try and fix it). But again, that\\'s not going to ever happen.\r\n[img]http://i.imgur.com/8I2Gr.png[/img]\r\nYes, I know this mod isn\\'t exactly up to the standards of my other mods, but I originally was going to make this mod for personal use, just making Lydia\\'s armor interchangeable, because the mod [url=http://skyrim.nexusmods.com/mods/2329]Exchangeable Armor[/url]\\'s download wasn\\'t working. But after I changed Lydia, I realized the usefulness of every follower getting this change, and how much people would want it. So, I made it.\r\n\r\nYES, I know there are other mods that make followers armor change-able, but they all include other things which you may not want. ALL this does is change that, no other fluff or nonsense.\r\n\r\nIf you\\'re using this mod for a follower you already have, a new set of armor will be added to their inventory. (The armor they would normally have). This isn\\'t a big deal, followers don\\'t generally have good gear, so don\\'t worry about cheating. Just take it out of their inventory and drop it. No other side effects. If you\\'re really butt-hurt about it, click on them, open the console, and type \\'resurrect\\'.\r\n\r\n[size=1]Armour, armor. Tomato, Toe-mot-oh.[/size]\r\n[/FONT]",
  "categoryId": "66",
  "version": "1.0",
  "author": "Zuhon",
  "createdUnix": "1357888362",
  "updatedUnix": "1357888449",
  "containsAdultContent": false,
  "uploadedBy": "Zuhon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001564",
      "name": "Core",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28",
      "fileName": "Core-29768-1-0.zip",
      "uploadedUnix": "1357888449",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/12f31b27798de6609e7fb8f7967de36a9c537697119e5a94842726ade49a83b2/analysis/1407347545/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Core-29768-1-0.zip?fid=1000001564&ttl=1535804137&ri=8192&rs=8192&setec=0cb91a87cb3b07b917af287d7645ca85"
    }
  ]
}