{
  "modId": 29775.0,
  "modName": "Kalicolas Enhanced Graphics ENB",
  "summary": "ENB config. Colorful, Immersive, and Cinematic",
  "descriptionHtml": "[img]http://farm9.staticflickr.com/8542/8636692987_d58546d08d_c.jpg[/img]\r\n\r\nWho am I and what do I do?\r\n\r\nMy name is Ronnie Ree. I call my self Kalicola on the web. I am 33 years old and work as an animator at IO-Interactive in Denmark, and have just finished my work on Hitman Absolution. I have a girlfriend and two kids, meaning that I have NO freetime at all.\r\n\r\nMod Discription:\r\n\r\nThis is my ENB config, that I have been working one since the day the ENB mod was released. The goal is to make a more apealing skyrim, with better colors, brighter light, darker shadows, better contrast, better shadows, intense fire and magic effects, scary dungeons, movie style depth of field, better sharpening and anti aliasing. \r\n\r\nMy aim for the look is more \\\"The Hobbit\\\" and less \\\"Lord of the rings\\\" Meaning, brighter lights and colors and less gray and flat, with a little bit of Michael Bay in there too :)\r\n\r\nThanks to the hard worker Hodilton for making this graceful video\r\n[youtube]kaB2G2jTE9g[/youtube]\r\n\r\n[img]http://farm9.staticflickr.com/8228/8378912971_b3f6c5c9b3_c.jpg[/img]\r\n\r\nVery Important:\r\n\r\nEnable this in SkyrimPrefs.ini:\r\n\r\nbTreesReceiveShadows=1\r\nbDrawLandShadows=1\r\nbShadowsOnGrass=1\r\nbFloatPointRenderTarget=1\r\n\r\nDisable any Anti Aliasing you may be running, this config has build in AA via sweetfx\r\n\r\n[img]http://farm9.staticflickr.com/8358/8369033853_7821281039_c.jpg[/img]\r\n\r\nCompatability:\r\n\r\nDisable all mods that changes the lighting of the world, like realistic lighting, URWL, climates of tamriel and mods like that. This enb does not work with those mods: Mods that changes sunlight and shadows does NOT work with this m\\'kay.\r\n\r\nWhat DOES work and that I use myself is these mods (or simular mods) that changes pointlights (lanterns, tourches, fireplaces and so on).\r\n\r\nImmersive Content - Exterior Lighting Enhancement (Awesome mod, that changes the exterior lights like lanterns and firebowls in cities, and turns them off during daytime).\r\n\r\nOr\r\n\r\nRelighting Skyrim (great mod that changes the interior and exterior lighting, and makes the lighting emit from the actual light source. My homeboy JawZ has made some add ons for it, so read the instructions before installing).\r\n\r\nI play with the two mods above on my game, but they are not needed for this enb to work. Use them or don\\'t use them, it\\'s up to you.\r\n\r\n[img]http://farm9.staticflickr.com/8224/8366644555_dd00bd0394_c.jpg[/img]\r\n\r\nHow to install:\r\n\r\nThis Enb is optimised using the ENB binary version 0.157\r\n\r\n1. Download the d3d9.dll from here: http://enbdev.com/mod_tesskyrim_v0157.htm\r\n\r\n2. Copy the d3d9.dll file to your skyrim folder. Don\\'t copy the other files over, only d3d9.dll\r\n\r\n3. Download my files and copy them over to the same skyrim folder\r\n\r\nThat\\'s it.\r\n\r\nTo uninstall just delete all those files again\r\n\r\nMod manager does not work for installing this\r\n\r\n[img]http://farm9.staticflickr.com/8231/8360595767_d0af93771b_c.jpg[/img]\r\n\r\nNotes about the ENB\r\n\r\nIt has been optimized for 1080p resolution, so stay in that resolution if you can :)\r\n\r\nThis ENB has reflections turned OFF, cause I don\\'t think the quality of the reflections is good enough yet.\r\n\r\nThe depth of field is blurring the character in character creation, so use Shift-F12 to turn ENB OFF when creating your character.\r\n\r\nI have created my own Sun texture, it was the only way I could get a bright Sun that didn\\'t blow out the whole sky. If you don\\'t use my sun texture the you will get a extremely bright blown out Sun.\r\n\r\nI have disabled the sun corona, cause I hate to see that texture scale up and down everytime something gets infront of it, looks really bad.\r\n\r\nI have also disabled the sun lens flare, cause I don\\'t like the look of it.\r\n\r\n[img]http://farm9.staticflickr.com/8470/8361657758_e55fe67a65_c.jpg[/img]\r\n\r\nTo do list\r\n\r\nIt\\'s a fairly heavy ENB config this, so I hope to get time to make a light version of this, but I won\\'t promise anything, I\\'m a busy guy, sorry\r\n\r\nMake a new sweet trailer. Here you can watch my old outdated trailer I did during work in progress.\r\nhttp://www.youtube.com/watch?v=FjhYMCFi8sg\r\n\r\nI will still improve on this config even after release, I still have alot of thing that can be improved, and boris is still working on the binary on stuff like motionblur and performance improvements as far as I know.. And I will properbly work on this ENB forever, that\\'s why I release it now, so people can just try it out. And let me know what you think of it, what you like and what you don\\'t like. It\\'s all good to me, and helps me make this ENB better. Thanks! \r\n\r\n[img]http://farm9.staticflickr.com/8365/8361018358_87a4485cbc_c.jpg[/img]\r\n\r\nHere\\'s a link to my other mod I did:\r\n\r\nKalicolas Live Action Intro HD\r\nhttp://skyrim.nexusmods.com/mods/24618\r\n\r\nCredits:\r\n\r\n- Boris Vorontsov, autor of ENBseries\r\n- CeeJay, autor of SweetFX\r\n- And basicaly all the guys at the enb.dev forum for inspiration and helping me out when I ran into problems.\r\n\r\nSpecial thanks to:\r\n\r\n- IndigoNeko (SkyRealism - ENB Evolved) for letting me use his ENB config as a starting base.\r\n- Opethfeldt (Opethfeldt6 ENB) for letting me use his enbeffect.ini file to edit to fit my ENB\r\n- bronze316 (Sasons of Skyrim ENB True HDR) for letting me use his enbeffectprepass.fx file and tweak to fit my taste.",
  "categoryId": "62",
  "version": "1.02",
  "author": "Kalicola",
  "createdUnix": "1357912565",
  "updatedUnix": "1368475801",
  "containsAdultContent": false,
  "uploadedBy": "kalicola",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029735",
      "name": "Kalicolas Enhanced Graphics ENB",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "273",
      "fileName": "Kalicolas Enhanced Graphics ENB-29775-1-02.rar",
      "uploadedUnix": "1368475801",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/3fdb29c0ee6626700be23bd0966f83d0866286bc8df19e253a0c65ab4f4383a3/analysis/1407568335/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kalicolas%20Enhanced%20Graphics%20ENB-29775-1-02.rar?fid=1000029735&ttl=1535804148&ri=8192&rs=8192&setec=8027c381c45ca0041c89087929075fce"
    }
  ]
}