{
  "modId": 29804.0,
  "modName": "Vivae",
  "summary": "A beta, WIP mod that eventually plans to add up to 10 Inns/Taverns, new shops for Major cities and expansions of prior smaller settlements.",
  "descriptionHtml": "Struggling along the path, the cold begins to sap at your strength, slowly, you watch your vision as it recedes and feel the energy flowing from your limbs into the bitter cold surrounding. Ahead, a light shines, an inn, perhaps? You take a last few, forlorn steps, crashing to the ground as darkness engulfs your feeble mind. No inn, not here in Skyrim.\r\n\r\nAfter reviewing my goals and options, I have decided to\r\nA) Take this mod out the Beta stage, please download, it is user friendly!\r\nand\r\nB) Reassign a new life time goal for this mod.\r\nUpon realizing that the creation of new areas isn\\'t actually as hard as I had previously thought, I have decided to rename this mod to;\r\nThe TEoSV Project\r\nYou may notice this shares the same initials as TESV (The Elder Scrolls: V)\r\nTESoV stands for Total Expasion of Settlements/Villages.\r\nThus far I have expanded the Whiterun City exterior and added a mid size market which I have about 65% finished. It features a plethora of stalls, an Inn and a Seperate Tavern that NPCs who visit the market reside at. The market NPC\\'s all go to the tavern at set times after finishing up and some go to the inn where several permenate NPCs live. Both the Inn and Tavern have Perm NPCs or PerMCs as I like to call them whilst they are both visited by a number of Dynamic NPCs, or DynaPCs.\r\nAdditionally, there is large Inn near Mix Water Mill with many, many more to be added soon.\r\n\r\nHere is a checklist of upcoming features\r\nInns and Taverns= 7% complete\r\nWhiterun=60% Complete\r\n\r\nNpcs=1% Complete\r\nWhiterun=23%complete\r\n\r\nVillage and City Expansion=1% Complete\r\nWhiterun=12% Complete\r\n\r\nFeatures to be added\r\n-Upgrade the interior and exterior of all major and minor settlements\r\n-Add workers to all Mills, Farms, Docks etc with own houses\r\n-Increase overall NPC presence in Cities, villages and Settlements\r\n-Build new settlement\r\n-Any requested content based on all above mentioned content\r\n\r\nAlso, if you want any specific features, added NPCs or else, PM or comment me and i\\'dd add them next update!!\r\n\r\nNEW NON BETA MOD\r\nhttp://skyrim.nexusmods.com/mods/29880\r\n\r\n~SD\r\n\r\n\r\nFile History\r\nV1.1 Uploaded\r\nIncludes a content addition. A new Inn/Tavern near Mix Watermill.\r\n-Integrated Inn Rental System. Thanks Noobo!\r\n-Fixed the INTERIOR navMesh for Black Night Inn so NPC\\'s can move to their Idle positions much more easy now. Bartender still has no hands :/\r\n-Easter egg of kinds added to Black Night Inn and included one in The New Inn\r\n-New Inn is called The Seeded Sweet roll and has about 6 new NPCs, three vendors, Rental system. Also now has decor exterior of the Inn.\r\n- Black Night Tavern has some minor changes, irrelevant really.\r\n\r\nV1.2 Uploaded\r\n**BIG UPDATE**\r\nOverall goal of mod has been changed\r\n-Added skeleton of Whiterun Market, added new NPCs that shop there and several merchants plus a new Inn close to Whiterun.\r\n-NPCs will eat a the Tavern and then walk to the Inn and sleep until the morning where they rise and go to the market.\r\n-Bug fixes. Fixed the Bar Keeper with no hands!\r\n-Fixed some NPCs AI issues\r\n-Mastered the NavMesh issue, folllowers should now be able to enter the Black Night Tavern and new Inn. WIP on the Seeded Sweetroll.\r\n\r\nEnjoy!\r\n",
  "categoryId": "53",
  "version": "V1.2",
  "author": "Screendrop",
  "createdUnix": "1357960639",
  "updatedUnix": "1358045214",
  "containsAdultContent": false,
  "uploadedBy": "screendrop",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001768",
      "name": "Vivae",
      "version": "BetaV1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "Vivae-29804-BetaV1.rar",
      "uploadedUnix": "1357960697",
      "modVersion": "BetaV1",
      "virusScanUrl": "https://www.virustotal.com/file/208df2a1260378c188febcd524c73b8182f1f65bada45b2a1423b2575259f883/analysis/1407348871/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vivae-29804-BetaV1.rar?fid=1000001768&ttl=1535804208&ri=8192&rs=8192&setec=5d2772f34b81e92773b7456f71089ff3"
    },
    {
      "fileId": "1000001972",
      "name": "Vivae-NewV1_1",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "56",
      "fileName": "Vivae-NewV1_1-29804-1-1.rar",
      "uploadedUnix": "1358045214",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d47a582eb916c7ac31d6c77146912be515f4f98b91b7aff328c57329e4bde180/analysis/1407350601/",
      "changelogHtml": " V1.1 Uploaded Includes a content addition. A new Inn/Tavern near Mix Watermill. -Integrated Inn Rental System. Thanks Noobo&#33; -Fixed the INTERIOR navMesh for Black Night Inn so NPC&#39;s can move to their Idle positions much more easy now. Bartender st <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vivae-NewV1_1-29804-1-1.rar?fid=1000001972&ttl=1535804208&ri=8192&rs=8192&setec=fc491b4abb084741758502006f323116"
    }
  ]
}