{
  "modId": 29844.0,
  "modName": "Capture Enemies - Dwemer Slaver Spheres",
  "summary": "Allows you to capture weakened enemies to make them fight alongside you.",
  "descriptionHtml": "Dwemer Slaver Speheres:\r\n\r\nInstallation:\r\nCouldn\\'t be simpler, just extract the files into your Data folder and it should be good to go.\r\n\r\nConcept:\r\nDwemer slaver spheres capture the bodies and minds of your enemies rather than their souls. This can only be done on enemies\r\nin a weakened state (less than 15% health). It also cannot be done on enemies with a strong will to live (Essential characters)\r\nDragons however, are not immune.\r\n\r\nHow it works:\r\nUpon installation you will receive five dwemer slaver spheres and three spells in Conjuration. The first spell called Enslave captures weakened enemies within\r\nthe sphere. By dropping the sphere with a capture enemy inside it you will release the enemy, but as your brand new friend! Well, slave. Anyway, the point is it will fight for you as if it were a follower. It will not however attack people that it was formerly \r\nallied with. So, for example you can\\'t capture a Whiterun guard and then make it fight other Whiterun guards. It won\\'t fight against you when you hit\r\nanother guard, but it won\\'t fight for you either.\r\nTo release an enslaved creature (so you can fill that ball with a cooler slave, presumably) you can fire the spell Release Enslaved on the sphere with the enslaved creature in it\r\nafter dropping the sphere. The enslaved creature will resume their normal behaviour as if nothing had ever happened. (WARNING: This may mean trying to kill you immediately.)\r\nThe third spell is a practical spell. It is very easy to lose track of your slaver spheres after dropping them. The spell summon Slaver Spheres immediately returns them to your inventory.\r\nThis will unsummon any creatures you have summoned from the spheres, as well as returning your spheres from wherever they may be.\r\n\r\nThat\\'s about it.\r\nHave fun!",
  "categoryId": "75",
  "version": "v1.0",
  "author": "Alex Ducey",
  "createdUnix": "1358028063",
  "updatedUnix": "1358028110",
  "containsAdultContent": false,
  "uploadedBy": "atducey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001944",
      "name": "Dwemer Spheres Main File",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Dwemer Spheres Main File-29844-v1-0.rar",
      "uploadedUnix": "1358028110",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c60480dfc7c11fc6d99c3acdd5a0d5b467ba1bc7170de075f37d7b0c85c2a8c4/analysis/1407350359/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer%20Spheres%20Main%20File-29844-v1-0.rar?fid=1000001944&ttl=1535804293&ri=8192&rs=8192&setec=35072aab60c9c8fc89f0f5949fba33e4"
    }
  ]
}