{
  "modId": 29855.0,
  "modName": "Thorundir -  male companion",
  "summary": "Companion made to look like the movie version of Thor, in-game his name is Thorundir to make an attempt at being lore friendly.  Player can also marry him.",
  "descriptionHtml": "It\\'s hard to think of Nordic culture without thinking about the Scandinavian god Thor.  He is appropriate for the theme of Skyrim, and the job Marvel did with the movie character was fantastic, so I attempted to create a companion that looks like him (rejoice ladies, you can marry him too!)\r\n\r\nThe Thor inspired companion is named Thorundir in-game to be lore friendly.  His primary skills are two-hand, block, archery, light armor, and sneak.  He also has the perk of Light Foot so he will not step on trap triggers.  He is set to level with the player, and he is balanced so he is like the other companions in-game and will not ruin the difficulites of fighting by overpowering everything.  He is essential so he will not die, he will only go down on one knee when his health is down to 10% and recover.  He can be changed to using heavy armor for those who are saavy with the Creation Kit, but light armor was chosen for two reasons, the movie character doesn\\'t look like he\\'s in a hulking tank suit, and I tend to use sneak heavily in my games and I didn\\'t want a loud fumbling companion to give away my location.  He comes with vanilla farm clothes, hide bracers and boots, a steel warhammer, and a hunter\\'s bow.  He will wear anything higher quality than those.\r\n\r\nA word of caution to those who don\\'t like texture mods:  Thor uses texture replacers for his face, and yes these will also change the other NPCs in-game.  I chose to use a facial texture replacer made by the modder Genox because the textures Genox makes really do make the NPCs look so much better!  I\\'m usually hesitant about adding too many mods to keep my game as close to vanilla as possible, but lets face it, Bethesda just can\\'t make pretty people.  I\\'ve been adding texture replacements for NPCs since Morrowind.  I think you will find it an amazing improvement, and I\\'m confident you will be pleased.  Nothing else is affected except for the humanoid NPCs.  If you don\\'t want the texture replacers, then just go into the Data folder before installing the mod and use only the file Thor.esp and nothing else.  However, he will not look like Thor if you don\\'t use the textures, and honestly I\\'m not sure what he will look like at all, most likely unattractive.\r\n\r\n\t*note* I did find some low resolution files for the Geonox face textures and they are included in the optional files folder.  If you have trouble with the default textures or suffer from a framerate drop, you can copy and paste one of these options into the textures folder in your Skyrim directory to replace the default one I\\'m using.  The default one is the highest resolution, and the optional textures decrease resolution in increments, so try the next highest and only go down more if the problems are still prominent. \r\n\r\nInstallation - go to your Steam directory on your C drive (usually inside Program Files 86x), next click on Steamapps, then Common, Finally Skyrim.  Copy the Data folder to the Data folder inside your Skyrim directory and that is all you will need, the files will go where they need to go from there.  Finally when you load Skyrim, before loading a saved game, go into Data Files on the game menu and make sure Thor is checked so you can find him in-game.  If you wish to use one of the optional files, they will be located in a folder called \\\"Optional Files Geonox Faces\\\".  Just copy and paste the desired textures to the textures folder inside Data, and set any messages to copy and replace.  \r\n\r\nThorundir will be chopping wood at the lumber yard in Riverwood.  He\\'s a pretty diligent worker (you will find him chopping wood day and night, I haven\\'t delved into heavy scripting so his AI is very basic) and he is more than happy to just leave that endless job and follow you.  As a companion he is very competent and I\\'ve had no bugs in my play-testing with him. I don\\'t mind if others use him in their mods, just credit my name in there somewhere as I took great care with shaping that face.  \r\n\r\nHave fun!  - Last Ayleid",
  "categoryId": "66",
  "version": "1.0",
  "author": "Last Ayleid",
  "createdUnix": "1358046450",
  "updatedUnix": "1358047365",
  "containsAdultContent": false,
  "uploadedBy": "Last Ayleid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001980",
      "name": "Thor Companion",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "184380",
      "fileName": "Thor Companion-29855-1-0.rar",
      "uploadedUnix": "1358047365",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/90d05d016d1ba3055728b4272a0c708cd74b2f914adeab6bdfc29516112b5936/analysis/1407350757/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thor%20Companion-29855-1-0.rar?fid=1000001980&ttl=1535804304&ri=8192&rs=8192&setec=1ab265f134b51a5c6d077e433da295ae"
    }
  ]
}