{
  "modId": 29876.0,
  "modName": "TaRuk the Unseen-Follower and Possible Marriage",
  "summary": "TaRuk the Unseen is a khajiit ranger style follower with a unique attribute.",
  "descriptionHtml": "TaRuk was born the runt of the litter in Elsweyr. However, he was particularly gifted in the arts of stealth and was hence trained from a young age by the tribe leader to be his deputy. However, after years of training had made him respected and well liked as deputy, a large group of bandits had attacked his home and killed everyone while he was out hunting. His entire family, his friend and mentor, and the village he had known and loved since he was a kit, all lost to bandits. TaRuk went into a rage and managed to kill half the group, but they chased him across the border into Cyrodiil. He then decided he had to get as far away as possible, so he went north to Skyrim.\r\n\r\nTaRuk the unseen is a short Ranger type follower who is also eligible for marriage. He will level with you like any other follower and this mod is compatible with Ultimate Follower Overhaul, which I do recomend downloading as it does a lot more than just increase the allotted number of followers and is very useful. He is found in the Bannered Mare in Whiterun.",
  "categoryId": "66",
  "version": "1",
  "author": "TheLethalViper",
  "createdUnix": "1358074466",
  "updatedUnix": "1358074948",
  "containsAdultContent": false,
  "uploadedBy": "TheLethalViper",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000002040",
      "name": "TaRuktheUnseen",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "TaRuktheUnseen-29876-1.zip",
      "uploadedUnix": "1358074948",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/35f069fd32f031140b1b29ddaf7193fc2e4c1bbb631b84eeda19e9f6eebe97bc/analysis/1407351123/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TaRuktheUnseen-29876-1.zip?fid=1000002040&ttl=1535804336&ri=8192&rs=8192&setec=378eee2ada6a7fc384ead069c9059c13"
    }
  ]
}