{
  "modId": 29885.0,
  "modName": "Grow as you get old",
  "summary": "The name is self explanatory. This mod makes you grow as you get old!",
  "descriptionHtml": "[Color=yellow]Introduction[/color]\r\nI\\'ve always been bothered by the fact that Skyrim doesn\\'t let you chose if you will be a fully-grown adult or a still-growing person. This mod allows you to be the last one.\r\n\r\n[color=yellow]Description[/color]\r\nGrow as you get old is pretty self-explanatory. It allows your character to grow as you get older (more precisely as you level up).\r\nAt the moment you cannot customize any value but it will come in a future update.\r\nFor the moment you will start with a scale of 0.97 to look like a teenager or a little person, and after growing completely your scale should be 1.1 to look like a tall and strong warrior, or simply a tall person. \r\nTo become fully-grown, it takes nearly 81 levels.\r\nBut as I said previously, all of the values will be customizable in a future update.\r\n\r\nThe new scale is calculated with your current level, which means that if your level is high you may grow a lot at once. If your level is low you may shrink a bit at the beginning. It will be modified in a future update.\r\n\r\nYour character does not look older, he is simply taller. I\\'ll try to add this feature in a future update.\r\n\r\nThis mod works great with Gopher\\'s [url=http://skyrim.nexusmods.com/mods/29476] Pumping Iron [/url]\r\n\r\n[color=red][b]Important[/b][/color]\r\nYou need SKSE version 1.6.6 or newer for this mod to work.\r\n\r\n[color=yellow]Installation[/color]\r\nUse the Nexus Mod Manager. Simply download and activate.\r\nIf you want to install the mod manually simply extract the data folder of the archive to your Skyrim directory.\r\n\r\n[color=yellow]Uninstallation[/color]\r\nIf you installed with NMM, simply deactivate the mod.\r\nIf you installed manually, delete GrowingMod.esp located in your data folder.\r\n\r\n[color=yellow]Compatibility[/color]\r\nIt should be compatible with any mod as it doesn\\'t modify any vanilla game file.\r\n\r\n[color=yellow]Future developpements[/color]\r\nAdd customization via SkyUI MCM.\r\nCharacter getting old.\r\nCharacter starting as a pre-adult.\r\n\r\n[color=yellow]FAQ[/color]\r\nQ: Does this work with both males and females?\r\nA: Yes.\r\n\r\nQ: Can you make it so the growth is not linear?\r\nA: Leveling up becomes slower as you level increases, which means that the growth is not linear. You\\'ll grow fast at the beginning and slow at the end. A bit like in real life.\r\n\r\nQ: Does it affect NPC\\'s? \r\nA: No.\r\n\r\n[color=yellow]Thanks to[/color]\r\nBethesda for the game and the creation kit\r\nGopher for the help and the inspiration",
  "categoryId": "78",
  "version": "0.1",
  "author": "Badorio",
  "createdUnix": "1358096255",
  "updatedUnix": "1358096313",
  "containsAdultContent": false,
  "uploadedBy": "Badorio",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000002078",
      "name": "MORRA BUF - MORe ReadAble Bigger UI Fonts",
      "version": "0.1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Grow as you get old-29885-0-1.7z",
      "uploadedUnix": "1358096313",
      "modVersion": "0.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/813d3edd73240daed200b24a7f2ef9e7787caedf46a2a9904b0ca91fafbc6351/analysis/1407351368/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grow%20as%20you%20get%20old-29885-0-1.7z?fid=1000002078&ttl=1535804350&ri=8192&rs=8192&setec=c8894399f0744c7f6bf9aee372f2d38a"
    }
  ]
}