{
  "modId": 29901.0,
  "modName": "Vilja in Skyrim - German",
  "summary": "German Translation of Vilja in Skyrim\r<br />\r<br />Das junge Solstheimer Mädl Vilja ist schon seit geraumer Zeit in Himmelsrand und sucht nach dem einzigen Ort, wo man das Geheimnis ihrer mysteriösen Flasche, die ihre Ururgrossmutter (Oblivion Vilja) aus Cyrodiil mitgebracht hat, lüften kann.",
  "descriptionHtml": "[color=yellow]Vilja in Skyrim von Emma, Amgepo und Lycanthrops[/color]\r<br />\r<br />This is only a German translation&#33;\r<br />The original mod can be found here: [size=4][url=http://www.nexusmods.com/skyrim/mods/26393/?]Vilja in Skyrim[/url][/size]\r<br />\r<br />[center][size=4][color=blue]Nach dem Erfolg ihrer Ururgroßmutter in Oblivion ist nun die Ururenkelin bereit auf Skyrim zu treffen&#33;[/color][/size][/center]\r<br />\r<br />[center][size=5][color=Orange]Vilja in Himmelsrand[/color][/size][/center]\r<br />Das junge Solstheimer Mädl Vilja ist schon seit geraumer Zeit in Himmelsrand und sucht nach dem einzigen Ort, wo man das Geheimnis ihrer mysteriösen Flasche, die ihre Ururgroßmutter (Oblivion Vilja) aus Cyrodiil mitgebracht hat, lüften kann. Aber sie wird Hilfe brauchen...eure Hilfe&#33;\r<br />Wenn ihr Vilja helfen wollt, könnt ihr sie in der &#34;Beflaggten Mähre&#34; in Weißlauf finden.\r<br />\r<br />Vilja wird mit Sicherheit euer einsames Leben in Himmelsrand völlig auf den Kopf stellen, da sie sehr redselig, neugierig und spontan ist.\r<br />\r<br />[center][size=5][color=Orange]Vilja in Solstheim[/color][/size][/center]\r<br />Jetzt könnt ihr gemeinsam mit Vilja ihre Heimat Solstheim besuchen&#33;\r<br />Diese Erweiterung umfasst mehr als 150 neue Kommentare über Leute, Missionen und Ereignisse in Solstheim.\r<br />[line]\r<br />[color=yellow]Kurzübersicht:[/color]\r<br />Ihre Funktionen OHNE zusätzliche Mods wie UFO, AFT, Convenient Horses usw. Achtet darauf, dass sie NACH solchen Begleiteroverhauls geladen wird.\r<br />\r<br />Status: WIP (Wird fortgesetzt)\r<br />Sprachausgabe: Ja (Englisch) (Vilja wird von Emma gesprochen)\r<br />Zusätzlicher Begleiter: Ja (kann man zusätzlich zu Standardbegleitern wie Lydia mitnehmen)\r<br />Eigene Dialoge: Ja\r<br />Eigene Missionen: Ja\r<br />Zusätzliche/ Einstellbare Verhaltensfunktionen: Ja (Kommentare ein/aus, Kleidungs-Management, u.v.m.)\r<br />Zusätzliche/ Einstellbare Kampffunktionen: Ja\r<br />Interagiert mit anderen Standardbegleitern: Ja\r<br />Interagiert mit Umgebung: Ja (setzt sich, benutzt Gegenstände, usw.)\r<br />Situationsbewusst: Ja (weiß, wo sie sich befindet, gegen welche Gegner sie kämpft, usw.)\r<br />Freundschaft möglich/erforderlich: Ja\r<br />Zuhause zuweisbar: Ja\r<br />Heiraten: Ja (Geschlecht und Rasse des Spielcharakters egal)\r<br />Kann reiten: Ja (hat ihr eigenes Pferd Bruse)\r<br />Unsterblich: Einstellbar\r<br />MCM: Nein\r<br />[line]\r<br />[color=yellow]Hinweise:[/color]\r<br />1. Ich habe nur die Texte übersetzt. Die Sprachausgabe ist unverändert in Englisch. Das gilt natürlich auch für die neuen Dialoge der NPCs, mit denen Vilja interagiert.\r<br />\r<br />2. Die &#34;Folgt Vilja&#34; Funktion sollte nur für Standard Begleiter aus dem Spiel, oder Modbegleiter, die keine weiteren Funktionen haben, verwendet werden. &#34;Intelligente&#34; Begleiter wie z.B. Cerwiden  würden einige ihrer Funktionen verlieren.\r<br />\r<br />3. Es gibt für Viljas Aussehen eine Unmenge an Mods auf der englischen Seite. Seht sie euch auf jeden Fall an&#33;\r<br />\r<br />4. Vilja Add-on\r<br />[url=http://www.nexusmods.com/skyrim/mods/61947/?]Vilja Hotkeys von Elephant42[/url]\r<br />\r<br />5. Falls ihr keine Untertitel habt, seht nach, ob die Untertitel unter Einstellungen/Anzeige eingeschaltet sind.\r<br />[line]\r<br />[color=yellow]Benötigt:[/color]\r<br />Skyrim V 1.9 oder höher\r<br />[url=http://www.nexusmods.com/skyrim/mods/26393/?]Die Original Mod ViljainSkyrimVer4_2[/url]\r<br />\r<br />[color=yellow]Installation:[/color]\r<br />Kopiert den Data Ordner der Original Mod in euren Skyrim Spielordner. (Steam/SteamApps/Common/Skyrim)\r<br />\r<br />Danach kopiert ihr von meiner Übersetzung, je nachdem ob ihr einen männlichen oder weiblichen Spielcharakter habt, die ESP aus dem entsprechenden Ordner UND den Scripts-Ordner in euren Skyrim/Data Ordner (der Unterschied der beiden ESP&#39;s ist nur die Anrede, also ob Vilja euren Spielcharakter z.B. als Freund oder Freundin bezeichnet)\r<br />[line]\r<br />[size=4][color=yellow]Neu in V 4.2[/color][/size]\r<br />\r<br />- Ihr könnt nun nebeneinander gehen.\r<br />- Ihr könnt Vilja nun anweisen, wegzubleiben und in Deckung zu gehen.\r<br />- Eine neue Methode eingeführt, durch die man sich über die Schnelltasten mit Vilja unterhalten kann. Diese Methode ermöglicht es euch, ihr zu zeigen, welchen Feind sie angreifen soll, sie schweigen zu lassen, ihre Dialogoptionen nach Belieben zu gestalten und mit ihr zu sprechen, ohne erst stehen zu bleiben und sie mit der E-Taste (Standard) &#34;aktivieren&#34; zu müssen.\r<br />- Volle Interaktion und viele Szenen mit dem Gefährten Inigo von SmartBlueCat.\r<br />- Eine neue Missionsreihe, bei der ihr einen neuen, möglichen, Begleiter und ein komplettes Rüstungsset inklusive Waffen erhalten könnt. Diese Mission ist erst verfügbar, wenn euer Spielcharakter mit Vilja verheiratet ist.\r<br />- Es ist jetzt möglich, Viljas &#34;Plapperhäufigkeit&#34; bis auf alle 10 Minuten zu reduzieren.\r<br />- Vilja kann sich jetzt auf den Schoß eures Spielcharakters setzen.\r<br />- Ihr könnt jetzt Vilja bitten, zur Seite zu gehen, wenn sie im Weg steht.\r<br />- Sobald ihr mit Vilja verheiratet seid, könnt ihr einen Kosenamen wählen, mit dem sie euren Spielcharakter ansprechen soll.\r<br />- Mehr Auswahlmöglichkeiten, wenn Vilja euren Spielcharakter heilt.\r<br />- Ihr könnt nun bestimmen, wo Vilja ihr Pferd Bruse unterbringen soll.\r<br />- Ihr könnt jetzt Leifur jeden Charakter folgen lassen, und er kann auf euren Befehl hin Wild jagen.\r<br />- Mehr Dialoge, wenn Vilja betrunken ist und neues Geplapper (einschließlich über die Diebesgilde-Missionen).[line]\r<br />[color=yellow][size=4]Kurze Übersicht[/size][/color] (in der Anleitung im Download findet ihr eine genauere Beschreibung)\r<br />\r<br />Rund 9000 Dialoge in englischer Sprache und deutschen Untertiteln.\r<br />\r<br />Verbessertes Folge-Verhalten: Vilja wird sich zu euch &#34;teleportieren&#34; falls sie irgendwo nicht weiterkommt. Sie kann auch NEBEN euch gehen oder vorauslaufen. Außerdem könnt ihr sie jederzeit rufen, wenn ihr sie braucht.\r<br />\r<br />Einstellung: Ihre Einstellung zu euch wird sich im Laufe der Zeit ändern und hängt von eurem Verhalten ihr gegenüber, und eurem allgemeinen Verhalten ab. Vilja verfügt außerdem über ein &#34;Langzeitgedächtnis&#34; und wird sich manche Dinge, die ihr sagt oder tut, merken.\r<br />\r<br />Neues Garderobensystem mit verschiedenen Möglichkeiten: \r<br />   a)   Entscheidet genau, was Vilja tragen soll\r<br />   b)   Bestimmt vorher, was sie in bestimmten Situationen tragen soll (Abenteuer, Stadt, zu Hause usw.)\r<br />   c)   Lasst sie selbst entscheiden, was sie tragen will\r<br />\r<br />Detaillierte Kampfanweisungen: Ihr könnt Vilja sagen, ob sie sich an Kämpfen beteiligen oder heraushalten soll. Ihr könnt ihr auch sagen, ob ihr Kampfstil Nahkampf oder Fernkampf sein soll, und wen sie angreifen soll. Später wird sie verschiedene Zauber und Bardengesänge lernen, und ihr könnt ihr sagen, welche davon sie anwenden soll und welche nicht.\r<br />\r<br />Einstellbare Funktionen: Ihr könnt verschiedene Dinge bezüglich ihres Verhaltens, ihrer Garderobe, ihrem Geplauder, wichtig/geschützt (unsterblich/sterblich), usw. einstellen. Ihr könnt auch einige ihrer Angewohnheiten ändern.\r<br />\r<br />Heilung: Am Anfang kann Vilja nur sich selbst während eines Kampfes heilen, aber später wird sie auch in der Lage sein, euch zu heilen.\r<br />\r<br />Kampftraining: Ihr könnt eure Kampffertigkeiten zusammen mit ihr und euren Huscarls in einem Wettkampf trainieren.\r<br />\r<br />Handwerk: Anders als Standard Begleiter kann Vilja sogar folgende Handwerks-Stationen benutzen:\r<br />- Kochtopf: Vilja kann verschiedene Mahlzeiten für euch kochen.\r<br />- Alchemielabor: Vilja kann verschiedene Tränke brauen.\r<br />- Schmiede: Vilja kann die Schmiede benutzen um Dietriche für euch zu machen.\r<br />- Werkbank: Vilja kann die Werkbank benutzen um Pfeile zu befiedern.\r<br />- Gerbgestell: Vilja kann Pelze zu Leder verarbeiten, und Leder in Lederstreifen schneiden.\r<br />- Schmelzhütte: Vilja kann die Schmelzhütte genauso benutzen wie ihr.\r<br />- Hackklotz: Vilja kann, genau wie andere Begleiter, Holz hacken.\r<br />- Minenarbeiten: Wenn Vilja eine Spitzhacke hat, kann sie euch beim Abbau von Erzen helfen.\r<br />\r<br />Vilja kann auch unterwegs einfache Tränke machen, kochen, und Fackeln machen, ohne Handwerks-Stationen dafür zu benötigen.\r<br />Sie kann auch lernen, wie man neue Tränke macht, wenn ihr ihr Rezepte gebt.\r<br />\r<br />Kochen: Wenn Vilja passende Zutaten in ihrem Gepäck hat, kann sie unterwegs eine Mahlzeit für euch kochen. Sobald ihr verheiratet seid, wird sie euch nicht nur die &#34;selbstgekochte Mahlzeit&#34; anbieten, sondern auch eine ganz besondere Speise, die es sonst in Himmelsrand nicht gibt.\r<br />\r<br />Reiten und Berittener Kampf: Vilja hat ihr eigenes Pferd, das sie rufen und reiten wird, wann immer ihr reitet. Ihr könnt ihr aber auch sagen, dass sie reiten soll, wenn ihr selbst nicht gerade reitet. Sie kann auch auf ihrem Pferd Bruse kämpfen.\r<br />\r<br />Anführerin: Vilja muss nicht immer euch folgen. Ihr könnt auch IHR Begleiter sein&#33; Und ihr könnt auch eure anderen Begleiter anweisen, Vilja, anstatt euch zu folgen. \r<br />\r<br />Missionsbezogenes Gerede: Vilja weiß, was um sie herum passiert und wird euch gelegentlich ihre Meinung dazu sagen.\r<br />\r<br />Ortsbezogenes Gerede: Vilja hat ihre eigenen Ansichten über die Orte, die ihr besucht.\r<br />\r<br />Vilja interagiert mit zahlreichen Original-Begleitern auf verschiedene Weise. Über manche wird sie lediglich gelegentlich ein Kommentar abgeben, während sie mit anderen lange und unterhaltsame Diskussionen führt. Sie hat auch eine einfache Interaktion mit der Mod-Begleiterin Cerwiden (sie spricht über und zu ihr, allerdings ohne dass Ceri antwortet) und eine vollwertige Interaktion mit Inigo&#33;\r<br />\r<br />Ein Zuhause: Ihr könnt Vilja sagen, wo sie leben soll, und sie wird dort kochen, putzen, Musik machen, Bücher lesen, mit anderen Begleitern plaudern, und vieles mehr.\r<br />\r<br />Zeltplatz: Vilja hat ihr eigenes Zelt und kann auch ein Lagerfeuer machen.\r<br />\r<br />Bücher vorlesen: Vilja wird euch gerne aus Büchern vorlesen. Am Anfang hat sie nur ein Buch, aus dem sie vorlesen kann, aber sobald sie andere Bücher hat, aus denen sie vorlesen kann, wird sie es euch sagen.\r<br />\r<br />Sammeln und Saubermachen: Vilja kann euch helfen, verschiedene Dinge einzusammeln wie Pfeile, Waffen und natürlich Zutaten. Ihr könnt ihr auch sagen &#34;Mach hier bitte sauber&#34;, und sie wird den Boden fegen.\r<br />\r<br />Zauber wirken: Anfangs hat Vilja nur einige einfache Zauber für Heilung und Teleportation. Aber im Laufe ihrer Missionen wird sie noch eine Reihe anderer Zauber lernen. Später kann sie noch weitere Zauber lernen, wenn ihr ihr Schriftrollen gebt (sehr zu ihrem Leidwesen immer noch keine Feuerbälle...).\r<br />\r<br />Gesänge: Sobald Vilja eine &#34;echte Bardin&#34; geworden ist, ist sie in der Lage, völlig neue Bardengesänge zu benutzen, die eure Feinde oder euch beeinflussen können, und euch die Möglichkeit geben, eure Kampftaktik zu verbessern.\r<br />\r<br />Shoppen: Ihr könnt Vilja sagen, dass sie für euch einkaufen gehen soll. Sie kann auch Dinge für euch verkaufen, und wird auch manchmal spontan von selbst shoppen gehen.\r<br />\r<br />Fertigkeiten-Bericht: Ihr könnt Vilja nach ihren aktuellen Fertigkeiten fragen. Dabei seht ihr auch wie sehr, oder wie wenig, sie euch derzeit mag.\r<br />\r<br />Spiele spielen: Vilja ist ein bisschen kindisch und liebt es zu spielen. Ihr könnt mit ihr einen Wettlauf zu verschiedenen Zielen machen, ihr könnt Schere, Stein, Papier spielen, oder mit ihr einen Wettkampf/Kampftraining machen.\r<br />\r<br />Musik spielen: Vilja ist eine &#34;Möchtegern&#34; Bardin, und wird immer gerne für euch spielen. Anfangs kann sie nur die Trommel spielen, aber später lernt sie auch die Flöte und die Laute zu spielen und kann für euch singen.\r<br />\r<br />Vor Publikum spielen: Sobald ihr einige von Viljas Missionen erfüllt habt, ist sie in der Lage, in einigen der Gasthäuser das Publikum zu unterhalten und damit sogar etwas Geld zu verdienen&#33; Ihr könnt auch zusammen mit Vilja Musik machen.\r<br />\r<br />Rollenspielelemente: Ihr könnt ihr z.B. Drinks spendieren, euch für ihre Hilfe bedanken, ihr Geschenke und Komplimente machen. Sie wird euch auch manchmal nach eurer Meinung über absolut bedeutende und wichtige Angelegenheiten fragen...\r<br />Ihr könnt auch sie nach ihrer Meinung fragen, und euch mit ihr mit Hilfe von &#34;Sprachhörnern&#34; unterhalten, ohne erst stehen zu bleiben und sie wie üblich &#34;aktivieren&#34; zu müssen.\r<br />\r<br />Einführung einer berühmt-berüchtigten Solstheimer Tradition...\r<br />\r<br />Romantik und Ehe: Wenn ihr mit ihr eine Romanze anfangen wollt, könnt ihr das, möglicherweise, tun, aber erst, wenn ihr euch besser kennengelernt habt und ihre Hauptmission in Himmelsrand abgeschlossen ist. Die Romanze wird schließlich zur Hochzeit und Hochzeitsfeier führen, an der auch Viljas Familie und Freunde teilnehmen werden.\r<br />\r<br />Oblivion Vilja. Am Ende des ersten Teils ihrer Mission könnt ihr in einem Gespräch mit ihr entscheiden, ob sie eure längst verloren geglaubte Freundin oder Geliebte aus Cyrodiil ist, oder nicht.\r<br />[line]\r<br />Wenn euch Vilja gefällt, vergesst nicht, [color=yellow]die Original Mod zu bewerten[/color]. (mich nur, wenn ihr mit der Übersetzung zufrieden seid)\r<br />\r<br />Bei Übersetzungsfehlern oder Fragen könnt ihr gern mit mir Kontakt aufnehmen.\r<br />Und über Screenshots freue ich mich auch immer :)[color=yellow]\r<br />\r<br />Credits:[/color]\r<br />Danke an Emma für ihre Erlaubnis, eine deutsche Version ihrer Mod zum Download bereitzustellen.\r<br />Danke auch an alle anderen, die an dieser großartigen Mod beteiligt sind. Eine genaue Aufzählung findet ihr in den Credits im Download.                              \r<br />\r<br />Und Danke an Gismoso, der Emma vorgeschlagen hat, einige der häufigsten Dialoge auf Deutsch zu sprechen.\r<br />\r<br />Viel Spaß&#33;\r<br />Merkur\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/1391109/?tb=mods&pUp=1]Übersetzungen für Skyrim[/url]\r<br />\r<br />[url=http://www.nexusmods.com/oblivion/users/1391109/?tb=mods&pUp=1]Übersetzungen für Oblivion[/url]\r<br />\r<br />[url=http://www.nexusmods.com/newvegas/users/1391109/?tb=mods&pUp=1]Übersetzungen für Fallout New Vegas[/url]\r<br />\r<br />[url=http://www.nexusmods.com/fallout3/users/1391109/?tb=mods&pUp=1]Übersetzungen für Fallout 3[/url]\r<br />[line]\r<br />[center][size=4][color=blue]Kennt ihr schon Viljas Ururgroßmutter?[/color][/size][/center]\r<br />[center][img]http://img2.picload.org/image/rgrdagoi/oblivion.jpg[/img][/center]\r<br />[center]Hier geht es zur [url=http://oblivion.nexusmods.com/mods/39897]deutschen Version von Vilja in Oblivion[/url][/center]",
  "categoryId": "66",
  "version": "4.2",
  "author": "Emma",
  "createdUnix": "1358127831",
  "updatedUnix": "1477035918",
  "containsAdultContent": false,
  "uploadedBy": "Merkur67",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020631",
      "name": "ViljaInSkyrim V 1_4_1_1",
      "version": "1.4.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1200",
      "fileName": "ViljaInSkyrim V 1_4_1_1-29901-1-4-1-1.rar",
      "uploadedUnix": "1364427855",
      "modVersion": "1.4.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f70e3f13ed526826455dc387304737a64e67c56cbb471b3733d54d167e8c7267/analysis/1407491591/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ViljaInSkyrim%20V%201_4_1_1-29901-1-4-1-1.rar?fid=1000020631&ttl=1535804372&ri=8192&rs=8192&setec=aac23e8919d97edbcf2c5dc1b67b5e11"
    },
    {
      "fileId": "1000022983",
      "name": "ViljaInSolstheim V 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29",
      "fileName": "ViljaInSolstheim V 1_0-29901-1-0.rar",
      "uploadedUnix": "1365315549",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/94b322fc359d191f208239c4d1a635acc4fba776b1a4d003e9da79c5f5cd66f4/analysis/1407510786/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ViljaInSolstheim%20V%201_0-29901-1-0.rar?fid=1000022983&ttl=1535804372&ri=8192&rs=8192&setec=1c7e5f24ce67ec6e7ba9a465eaf00fa1"
    },
    {
      "fileId": "1000027254",
      "name": "ViljaInSolstheim V 1_0_1",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28",
      "fileName": "ViljaInSolstheim V 1_0_1-29901-1-0-1.rar",
      "uploadedUnix": "1367328046",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/26c59e7848b02f552f85036fed3db9078b170df50e19dc44d1d7b72ce178a4f0/analysis/1407548322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ViljaInSolstheim%20V%201_0_1-29901-1-0-1.rar?fid=1000027254&ttl=1535804372&ri=8192&rs=8192&setec=7a2e05c0bc0f1fa587179ce22067243c"
    },
    {
      "fileId": "1000028152",
      "name": "ViljaInSkyrim V 1_5b",
      "version": "1.5b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1218",
      "fileName": "ViljaInSkyrim V 1_5b-29901-1-5b.rar",
      "uploadedUnix": "1367714432",
      "modVersion": "1.5b",
      "virusScanUrl": "https://www.virustotal.com/file/8e992e05bfd809ffca2b372ec12730f4095a9f7eb0c68e10904887412bd86375/analysis/1407555254/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ViljaInSkyrim%20V%201_5b-29901-1-5b.rar?fid=1000028152&ttl=1535804373&ri=8192&rs=8192&setec=5e08318067b12cefaef3d2120c0cb0ca"
    },
    {
      "fileId": "1000087815",
      "name": "ViljaInSolstheim V 2_0",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "53",
      "fileName": "ViljaInSolstheim V 2_0-29901-2-0.rar",
      "uploadedUnix": "1387693976",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/2a69830672fd0c7da6ec9075728cd86d68977008ab5e1219012711462d4929dc/analysis/1407852543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ViljaInSolstheim%20V%202_0-29901-2-0.rar?fid=1000087815&ttl=1535804373&ri=8192&rs=8192&setec=de45c320e7f56215984ec1dcc306d83a"
    },
    {
      "fileId": "1000087851",
      "name": "Anleitung fuer eilige Freier",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "4",
      "fileName": "Anleitung fuer eilige Freier-29901-.rar",
      "uploadedUnix": "1387715256",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/914df62ba489703f31b2591b018cca967be0c41c11e292b54f817099f2f9df96/analysis/1407852852/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Anleitung%20fuer%20eilige%20Freier-29901-.rar?fid=1000087851&ttl=1535804374&ri=8192&rs=8192&setec=e2d61434db096221fa3bdb2703915586"
    },
    {
      "fileId": "1000088681",
      "name": "ViljaTinyChristmasAddonNew V 1_0",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "ViljaTinyChristmasAddonNew V 1_0-29901-1-0.rar",
      "uploadedUnix": "1388228883",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d382720de0bc2af31ba7b4fab1911edf5033cf68f9a1989731a7a4adf590926b/analysis/1407861965/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ViljaTinyChristmasAddonNew%20V%201_0-29901-1-0.rar?fid=1000088681&ttl=1535804374&ri=8192&rs=8192&setec=081a5d198fc6283a1525bd00af874a8a"
    },
    {
      "fileId": "1000088714",
      "name": "ViljaInSkyrim V 2_03 Neu",
      "version": "2.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1741",
      "fileName": "ViljaInSkyrim V 2_03 Neu-29901-2-03.rar",
      "uploadedUnix": "1388250413",
      "modVersion": "2.03",
      "virusScanUrl": "https://www.virustotal.com/file/5f1560e294d1d35448fa33ee2268f08764a0ec2de101fca89d5d1ca1431ca394/analysis/1407862269/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ViljaInSkyrim%20V%202_03%20Neu-29901-2-03.rar?fid=1000088714&ttl=1535804375&ri=8192&rs=8192&setec=bc5ed796c27535c90f962f692d17b120"
    },
    {
      "fileId": "1000114351",
      "name": "ViljaInSkyrim V 3_02",
      "version": "3.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2266",
      "fileName": "ViljaInSkyrim V 3_02-29901-3-02.rar",
      "uploadedUnix": "1403597690",
      "modVersion": "3.02",
      "virusScanUrl": "https://www.virustotal.com/file/9ab248ab68dbdf624965efa78622bbef154636dd8906061553e4d05a30aaf4f2/analysis/1408140507/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ViljaInSkyrim%20V%203_02-29901-3-02.rar?fid=1000114351&ttl=1535804375&ri=8192&rs=8192&setec=43d35bb793c457ed2756709e77703db8"
    },
    {
      "fileId": "1000114356",
      "name": "Vilja spricht Deutsch",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6896",
      "fileName": "Vilja spricht Deutsch-29901-.rar",
      "uploadedUnix": "1403598768",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/651158f3c050a873c831297987044a4d948f668e59192f98f71ae2aa08de76a4/analysis/1408140551/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vilja%20spricht%20Deutsch-29901-.rar?fid=1000114356&ttl=1535804375&ri=8192&rs=8192&setec=554795687eb476bf213001863cb4e97e"
    },
    {
      "fileId": "1000114357",
      "name": "HearthfireKidsMovingFix",
      "version": "0.9",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "72",
      "fileName": "HearthfireKidsMovingFix-29901-0-9.rar",
      "uploadedUnix": "1403599081",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/0f8e990764a7445c948ff4059a6a50a5ecb196644d3feb44e17889ba1f411c90/analysis/1408140552/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthfireKidsMovingFix-29901-0-9.rar?fid=1000114357&ttl=1535804376&ri=8192&rs=8192&setec=07947af8bfad60b137cb164e412c0387"
    },
    {
      "fileId": "1000114358",
      "name": "MoonlightTalesPatch",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "MoonlightTalesPatch-29901-.rar",
      "uploadedUnix": "1403599274",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/44f09fdd6528c776a45d69de5ee5e6764191d76e12f27bf7cf97b78930226099/analysis/1408140552/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MoonlightTalesPatch-29901-.rar?fid=1000114358&ttl=1535804376&ri=8192&rs=8192&setec=ab4fde07d75964a18010d7fac06c884b"
    },
    {
      "fileId": "1000225007",
      "name": "ViljaInSkyrim V 4_2_Deutsch",
      "version": "4.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2506",
      "fileName": "ViljaInSkyrim V 4_2_Deutsch-29901-4-2.rar",
      "uploadedUnix": "1477035918",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/14e4082fd702f40a0ea6058209cc05776b83eb514784de8577a84364368a8f98/analysis/1477035963/",
      "changelogHtml": " Änderungen V 4.2:\r<br />=================\r<br />- Nebeneinander gehen: Entwickelt nach dem System der Followers as Companions Mod von Ishara Meradin.\r<br />- Verbessertes Schnelltasten-Angriffssystem: Vilja sollte nun genauer ihr Ziel treffen.\r<br />- Verbessertes Schleich-Verhalten: Ihr könnt Vilja nun anweisen wegzubleiben und in Deckung zu gehen.\r<br />- Neue Flötenmusik: Vier neue Melodien für Vilja - von Bosa123.\r<br />- Verbesserung des Bogenschützen-Verhaltens: Vilja sollte im Kampf nicht mehr Stahl-Pfeile bevorzugen, sondern die bestmöglichen Pfeile aus ihrem Gepäck verwenden.\r<br />- Kleinere Verbesserungen und Korrekturen.\r<br />\r<br />\r<br />Änderungen V 4.01:\r<br />==================\r<br />- Eine fehlerhafte Dialog-Bedingung repariert, die bei der Aktivierung sprechender Aktivatoren einen Fehler verursachte (Live Another Life).\r<br />- Einen Dialog-Filter für bestimmte Szenen mit Inigo geändert, die nur in Außenbereichen gezeigt werden sollen.\r<br />\r<br />\r<br />Änderungen V 4:\r<br />===============\r<br />- Eine neue Methode eingeführt, durch die man sich über die Schnelltasten mit Vilja unterhalten kann. Diese Methode ermöglicht euch:\r<br /> a) Ihr zu zeigen, welchen Feind sie angreifen soll. Das funktioniert auch bei Schleichangriffen.\r<br /> b) Ihre Dialogoptionen nach Belieben zu gestalten und mit ihr zu sprechen, ohne sie erst wie üblich mit der E-Taste (Standard) &#34;aktivieren&#34; zu müssen.\r<br /> c) Sie, wenn nötig, schweigen zu lassen.\r<br /> d) Mit ihr zu plaudern, ohne stehen zu bleiben, oder sie erst wie üblich mit der E-Taste (Standard) &#34;aktivieren&#34; zu müssen (für Rollenspieler).\r<br />- Volle Interaktion und viele Szenen mit dem Gefährten Inigo von SmartBlueCat (http://www.nexusmods.com/skyrim/mods/40960/?).\r<br />Inigo ist eine hervorragende Mod, die von den Vilja-Autoren sehr empfohlen wird.\r<br />- Eine neue Missionsreihe, bei der ihr einen neuen, möglichen, Begleiter und ein komplettes Rüstungsset inklusive Waffen erhalten könnt. Diese Mission ist erst verfügbar, wenn euer Spielcharakter mit Vilja verheiratet ist.\r<br />- Viljas Plapper-Einstellungen wurden überarbeitet und es ist jetzt möglich, die &#34;Plapperhäufigkeit&#34; bis auf alle 10 Minuten zu reduzieren (ihre Kommentare zu Missionen und Ereignissen sind nicht davon betroffen).\r<br />- Vilja kann sich jetzt auf den Schoß eures Spielcharakters setzen.\r<br />- Ihr könnt jetzt Vilja bitten, zur Seite zu gehen, wenn sie im Weg steht.\r<br />- Sobald ihr mit Vilja verheiratet seid, könnt ihr einen Kosenamen wählen, mit dem sie euren Spielcharakter ansprechen soll.\r<br />- Mehr Auswahlmöglichkeiten, wenn Vilja euren Spielcharakter heilt. Ihr könnt nun bestimmen, wie stark ihre Heilkräfte sein sollen.\r<br />- Ihr könnt nun bestimmen, wo Vilja ihr Pferd Bruse unterbringen soll und sie bitten, ihn dorthin zurückzuschicken. Das funktioniert auch, wenn euch Bruse irgendwohin folgt, wo er sich nicht aufhalten soll.\r<br />- Neue Funktionen für Leifur. Ihr könnt ihn jetzt jeden Charakter folgen lassen, und er kann auf euren Befehl hin Wild jagen.\r<br />(Anmerkung: Auf der englischen Seite könnt ihr unter &#34;Miscellaneous&#34; (Sonstiges) die &#34;Barking Dogs Cure&#34; Datei finden (Original-Mod Hush Doggy von Luthrael), die Leifur daran hindert, so häufig zu bellen. Da diese Mod ALLE Hunde im Spiel beeinflusst, ist sie nicht in der Haupt-Mod enthalten.\r<br />- Mehr Dialoge, wenn Vilja betrunken ist und neues Geplapper (einschließlich mehr Kommentare über die Diebesgilde-Missionen).\r<br />- Weitere +500 Sprachaufnahmen mit geringerer Qualität überarbeitet oder mit einem professionellen Mikrofon erneut aufgenommen. Da schon zuvor bereits ungefähr 800 Sprachaufnahmen neu aufgenommen worden sind, müssen nur noch weniger als 2.000 überarbeitet werden. (Bitte beachtet, dass die meisten Sprachaufnahmen mit schlechterer Qualität in Viljas ersten Missionen auftauchen. Daher wird sich die Qualität im Laufe der Zeit verbessern.)\r<br />- Verschiedene Fehlerbehebungen, Änderungen und Verbesserungen, wie zum Beispiel:\r<br />- - Das Reiten, sowie das Kämpfen vom Pferd aus, sollte nun stabiler sein.\r<br />- - Das Faustkampfverhalten sollte nun verbessert sein.\r<br />- - Dank der in der Mod enthaltenen Dateien von Fore (Autor von FNIS) sollte nun der Umarmungs-Tötungs-Bug endgültig behoben sein. Diese Lösung ist vollständig kompatibel mit FNIS.\r<br />- - Vilja begleitet nun euren Spielcharakter ins Gefängnis.\r<br />- - Zufallsmissionen sollten nun nicht mehr Missionsziele in Gebieten haben, die von Mods angefügt wurden und daher möglicherweise nicht erreichbar sind. (Mod-Orte in Himmelsrand sind weiterhin möglich, aber es sollte keine Missionsziele mehr in Ländern wie Solstheim oder Falskaar geben.)\r<br />- - Die Wolfsruf-Helme passen jetzt auch den Khajiit und Argoniern.\r<br />- - Bestimmte Missionsprobleme ausgebessert. Es sollte nun nicht mehr nötig sein, das Gespräch mit Wilbert durch die TAB-Taste abzubrechen, und Magda sollte dort zu finden sein, wo sie sein sollte.\r<br />- - Die Wächter von Stendarr sollten sich nicht mehr feindlich verhalten, wenn Vilja im &#34;Freilauf-Modus&#34; ist.\r<br />- - Vilja sollte nach Szenen mit anderen Charakteren automatisch wieder euren Spielcharakter ansehen.\r<br />- - Vilja wird die Anzahl von Fackeln in ihrem Gepäck nicht mehr verdoppeln, nachdem sie ein Instrument gespielt hat.\r<br />- - Es sollte nun sicher sein, Viljas Aussehen zu verändern (mit einem der zusätzlichen Add-ons mit ESP auf der englischen Seite) bevor ihr ihre Mission beginnt (in den früheren Versionen hat das dazu geführt, dass Viljas Gepäck nicht mehr geöffnet werden konnte).\r<br />- - Verbesserte Kompatibilität mit SPERG und NPC Knockout Overhaul.\r<br />\r<br />\r<br />Änderungen V 3.02:\r<br />==================\r<br />- Ein neues Skript hinzugefügt, das in der früheren BSA fehlte. Dadurch wurde verursacht, dass Vilja euch nicht folgt, und andere Gefolgsleute sich merkwürdig verhalten. \r<br />- Die Einstellungen für Viljas Robustheit/Verwundbarkeit werden nun korrekt angezeigt.\r<br />- Kleine optische Änderungen; ein Nachrichten-&#34;zucken&#34; entfernt, das gelegentlich im Spiel auftauchte, einige Dialog-Filter geändert (unter anderem ein paar Kampfrufe, bei denen Vilja einen männlichen Spielcharakter mit einem weiblichen verwechselte).\r<br />\r<br />\r<br />Änderungen V 3.01:\r<br />==================\r<br />- Änderungen an zwei Skripts vorgenommen, um sicherzustellen, dass Vilja euch am Anfang eines neuen Spiels folgt.\r<br />\r<br />\r<br />Änderungen V 3:\r<br />===============\r<br />- Ein neues System, mit dem ihr den Schaden, den sie im Kampf austeilt und einsteckt, einstellen könnt, um sie eurem eigenen Spielstil und den Mods, die ihr verwendet, anzupassen (bisher war sie manchen Spielern zu stark und anderen zu schwach). \r<br />- Ein neues &#34;Folgeverhalten&#34; für Vilja, das sie lebendiger und unabhängiger macht. Kann ein/ausgeschaltet werden.\r<br />- Volle Interaktion, Szenen und andere Funktionen mit euren Adoptivkindern aus HearthFires. Wenn ihr HearthFires nicht habt, könnt ihr trotzdem Kinder adoptieren. Sprecht mit den Kindern im Waisenhaus Rifton, und ihr könnt einen oder zwei von ihnen mit nach Hause nehmen. Allerdings haben diese Kinder nicht alle Funktionen und Dialogthemen aus HearthFires.\r<br />- Ihr könnt zusammen mit Vilja Musik spielen. Mit einer Reihe von neuen Liedern, die nicht in der &#34;Become a Bard&#34;-Mod enthalten sind (&#34;Become a Bard&#34; wird aber empfohlen, da ihr damit eine noch größere Auswahl habt).\r<br />- Eine neue Questreihe mit Auftritten für die Bardenakademie. Das ist für Rollenspieler gedacht, erwartet also keine Kampfmissionen&#33;\r<br />- Eine neue, mögliche, Begleiterin - das Bardenmädchen Sindra aus Viljas Lautenmission - ermöglicht es euch Musik zu spielen, für die mehr als zwei Instrumente erforderlich sind. Sie kann auch Babysitterin für eure Kinder sein und hat volle Interaktion mit ihnen&#33; Ihr könnt sie mitnehmen, kurz nachdem ihr begonnen habt, Auftritte für die Bardenakademie zu erledigen.\r<br />- Ihr werdet mindestens drei Mitglieder aus Viljas Familie wiedersehen; eine von ihnen kann, wenn ihr wollt, für eine Weile bei euch bleiben, und eine andere hat eine Mission für euch. Ihr werdet sie auch dann treffen, wenn ihr keine Romanze mit Vilja habt.\r<br />- Szenen und Interaktion mit Gefolgsleuten mit der Stimme Male Young Eager, zum Beispiel Erik der Töter, Sven, Onmund (Akademie von Winterfeste) und auch jeder Mod-Begleiter mit dieser Stimme.\r<br />- Einige neue Funktionen, darunter zusammen mit dem Spieler auf dem Boden zu sitzen.\r<br />- Ihr &#34;Woran denkst du?&#34; Dialog wurde aufgeteilt, so dass ihr sie nach bestimmten Themen fragen könnt, und nicht nur hört, was ihr gerade durch den Kopf geht.\r<br />- Einige neue Angewohnheiten...zum Beispiel wird sie jetzt betrunken, wenn ihr ihr zu viele Drinks spendiert. Sie wird sich auch an einige der Dinge, die ihr gesagt und getan habt, erinnern...\r<br />- Ihr könnt ihr nun eure &#34;Lieblingsplätze&#34; zeigen. Sie wird sie sich merken und kann euch jederzeit dorthin zurückführen.\r<br />- Ein neues Lied, mit Vilja am Mikrofon ;) und Kindainappropriate an der Laute.\r<br />- Die &#34;Kampf-Alarmruf&#34;-Kommentare in Ordnung gebracht, und bessere Einstellungen, damit sie die richtigen Dinge zur richtigen Zeit sagt.\r<br />- Ein alternativer &#34;Höhlenforschungsweg&#34;, um die Eselschwanz-Mission zu erfüllen.\r<br />- Sie kann jetzt auch in kleineren Orten wie Flusswald, Falkenring, Winterfeste shoppen gehen (das heißt, an allen Orten, die Gemischtwarenhändler haben).\r<br />- Sie kann jetzt das Pferd des Spielers rufen.\r<br />- Besseres Zelt, mit Kochtopf und persönlicher Truhe.\r<br />- Vilja erkennt nun (nachdem ihr sie ihr vorgestellt habt) einige Mod-Begleiter und Gefolgsleute aus DLCs wie Cerwiden, Serana, Inigo, Rayya. Das ist erst eine Basisfunktion; derzeit kann Vilja zu und über Cerwiden und Serana sprechen, aber sie sind nicht in der Lage zu antworten. Die anderen werden in dieser Version nur von ihr erkannt.\r<br />- Besser aussehende Verlobungsringe (von Gamwich)\r<br />- Viele kleinere Änderungen, Fehlerbehebungen und Verbesserungen, einschließlich weiterer ca. 80 Sprachaufnahmen, die mit dem alten Mikrofon gemacht wurden, neu aufgenommen.\r<br />\r<br />\r<br />Änderungen V 2.03:\r<br />==================\r<br />- Die Barden-Zufallsmissionen wurden vollständig überarbeitet und es sollten nun keine Missionsgegenstände mehr vorzeitig auftauchen. (Hinweis&#33; Wenn ihr von V 2.0-2.02 aktualisiert und ihr bereits Zufallsmissionen für die Akademie gemacht habt, werden die alten Missionen eine Zeitlang mit den neuen parallel weiterlaufen&#33;) Der Grund dafür ist, dass die bereits aufgetauchten Missionsgegenstände nicht wieder entfernt werden können. Es ist besser, wenn ihr erst mit den alten Missionen weitermacht. Ab einem bestimmten Punkt werden die alten beendet, und ihr könnt mit den neuen Missionen weitermachen. Wenn ihr mit Wilbert sprecht, könnt ihr sehen ob ihr noch die alten oder bereits die neuen Missionen macht. Bei den alten lautet der Dialog &#34;Hat die Akademie eine Aufgabe für mich?&#34;, und bei den neuen &#34;Hat die Akademie noch weitere Aufgaben für mich?&#34;. (Zusammengefasst, der Unterschied zwischen den Missionen ist, dass bei den neuen keine Missionsgegenstände vorzeitig platziert werden und ihr notfalls das Missionsziel ändern könnt.)\r<br />- Weitere 65 Sprachausgaben niedriger Qualität für Vilja neu aufgenommen.\r<br />- Die Gesänge der Stille und der Geschwindigkeit funktionieren nun richtig.\r<br />- Viljas Erneuerungszauber funktioniert nun bei allen NPCs der Mod. Bei den anderen werden einfache Dinge durchgeführt wie Animationen zurückzusetzen, und vor allem wird der Fehler behoben, der früher durch den Gesang der Stille verursacht wurde.\r<br />- Trotz aller Bemühungen Emmas und ihres Teams scheinen einige immer noch ein Problem mit dem berüchtigten Umarmungs-Tötungs-Bug zu haben. Wenn das bei euch der Fall ist, und euer Charakter bei einer Umarmung stirbt, sollte er/sie jetzt automatisch wiederbelebt werden. Als Nebeneffekt wird er/sie eine Schnellreise machen um &#34;seine Knochen zurückzuholen&#34;, und die Augen bleiben geschlossen, bis ihr das Spiel neu startet.\r<br />- Weitere Verbesserungen und Korrekturen des Garderobe-Systems.\r<br />\r<br />\r<br />Änderungen V 2.02:\r<br />==================\r<br />- Korrekturen des Garderobe-Systems.\r<br />\r<br />\r<br />Änderungen V 2.01:\r<br />==================\r<br />- Tindras Verhalten korrigiert, so dass es keine Probleme mehr mit der Hochzeitszeremonie gibt.\r<br />- Eine &#34;Notfall-Sicherung&#34; für die Hochzeitszeremonie hinzugefügt: Sollte sie nicht funktionieren, könnt ihr sie neu beginnen indem ihr mit Keerava sprecht.\r<br />- Die Gegenstände von Viljas kleinen Zufallsmissionen werden nicht mehr in den Dungeons auftauchen, bevor ihr die entsprechende Mission bekommt. (Hinweis: Wenn ihr schon mit V 2.0 begonnen habt, sind diese Dinge bereits platziert, sollten aber keine Probleme machen.)\r<br />- Für die Barden-Zufallsmissionen könnt ihr jetzt den Missionszielort verändern. Es kann nicht vollständig verhindert werden, dass sich das Missionsziel in Gebieten aus Mods oder DLCs befindet. Aber wenn sich das Ziel an einem Ort befindet, der für euch ein Problem darstellt, könnt ihr mit Wilbert sprechen und er wird euch einen neuen Missionszielort geben (ausgenommen bei der ersten Mission).\r<br />- Wenn die Zufallsmissionen für die Bardenakademie nicht anfangen, könnt ihr mit Wilbert sprechen und die Mission neu starten (erst nach der ersten Missionsreihe mit den vier Gesangsbüchern verfügbar).\r<br />- Einen Fehler bei Beata korrigiert, durch den ihr den Komfort der Liebenden Bonus nicht bekommt, wenn ihr Beata sagt, dass ihr mit Vilja verheiratet seid. (Beata ist dazu da, dass ihr die einzelnen Missionsabschnitte überspringen könnt.)\r<br />- Wenn ihr bei der Hochzeitszeremonie zu Vilja &#34;Nein&#34; sagt, wird sie jetzt wie jede normale Frau darauf reagieren (nein, sie wird euch nicht killen ;) und die Hochzeitsgäste werden den Tempel verlassen, sobald ihr (außerhalb des Tempels) mit Vilja sprecht.\r<br />- Verbessertes Schleichverhalten.\r<br />- Verbesserungen des Garderobesystems (Winter-Garderobe, Clipping-Probleme usw.)\r<br />- Bessere Kontrolle von Viljas Nah/Fernkampfverhalten.\r<br />- Verbesserte Meshes und Texturen für die Wolfstränen-Rüstung.\r<br />\r<br />\r<br />Änderungen V 2:\r<br />===============\r<br />- Romanze-Handlung einschließlich Hochzeit und Hochzeitsfeier mit Viljas Familie&#33;&#33;&#33; (wenn ihr wollt)\r<br />- Neue Missionsreihe durch die Vilja eine &#34;echte Bardin&#34; werden kann.\r<br />- Sobald sie eine &#34;echte Bardin&#34; ist, erhält Vilja einzigartige Bardengesänge, die sie im Kampf anwenden kann.\r<br />- Unendlich viele Zufallsmissionen für die Bardenakademie, sobald Vilja eine &#34;echte Bardin&#34; ist.\r<br />- Gelegentliche Zufallsmissionen, die ihr von Vilja bekommt.\r<br />- Neues Garderobensystem mit verschiedenen Möglichkeiten: \r<br />Entscheidet genau, was Vilja tragen soll\r<br />Bestimmt vorher, was sie in bestimmten Situationen tragen soll (Abenteuer, Stadt, zu Hause usw.)\r<br />Lasst sie selbst entscheiden, was sie tragen will (wie in V 1.5)\r<br />- Gespräche mit anderen NPCs im Oblivion-Stil wenn Vilja herumwandert (euch nicht folgt).\r<br />- Szenen mit Gefolgsleuten mit anderen Stimmen: Female Young Eager (z.B. Brelyna, Jordis) und Male Eventoned (z.B. Marcurio und Faendal).\r<br />- Insgesamt 50 neue Szenen mit Gefolgsleuten, mit denen sie bereits Szenen hat.\r<br />- Sie wird bei euren &#34;Höhlenforschungen&#34; manchmal selbst Beute finden und einstecken.\r<br />- Mehr Rollenspielfunktionen (ihr könnt z.B. auf das, was sie zuletzt gesagt hat, &#34;antworten&#34;).\r<br />- Sie wird nicht mehr gegen ihre Freunde kämpfen - besser gesagt, werden solche Kämpfe fast sofort gestoppt.\r<br />- Verschiedene kleinere Probleme korrigiert, wie die Darstellung des Nachthemds, Bruses Geschwindigkeit, und ihre Kommentare, wenn ihr sie während des Schleichens zufällig anrempelt.\r<br />- KI-Verbesserungen, mehr Kommentare, mehr Dinge die sie weiß und tun kann (zu viele um sie hier aufzulisten, außerdem sind einige Überraschungen dabei, die Emma nicht verraten will :)\r<br />- Bessere Methode durch die sie erkennt, wenn ihr ein Vampir seid.\r<br />- Das beliebte &#34;Romantische Abendessen&#34; aus Oblivion wieder eingeführt, allerdings könnt ihr sie erst nach Beendigung ihrer Hauptmission einladen.\r<br />- Ihr könnt ihr sagen, ob sie sich zu euch teleportieren soll oder nicht, wenn sie zu weit zurückfällt. (Hilfreich für Dragonborn Spieler, die nicht wollen, dass sie ihnen folgt, wenn sie diese Bücher lesen)\r<br />- Viele Tippfehler ausgebessert.\r<br />- Mehr als 200 der ältesten Sprachaufnahmen (mit dem alten Mikrophon) neu aufgenommen.\r<br />\r<br />\r<br />Änderungen V 1.5:\r<br />=================\r<br />- Vilja unterhält sich nun nicht mehr nur mit bestimmten Begleitern, sondern mit ALLEN Begleitern (einschließlich aus Begleiter-Mods) und Ehepartnern, die eine bestimmte (Original-) Stimme haben. Derzeit wären das Female Commander (z.B. Aela), Female DarkElf (z.B. Jenassa), Female Eventoned (z.B. Lydia), Male Brute (z.B. Farkas), Male Khajiit (z.B. J&#39;zargo). Weitere sind in Arbeit.\r<br />- Rund 10 neue Szenen (mehrere für jede Stimmart).\r<br />- Mehr als 60 neue Dialoge für Vilja.\r<br />- Vilja kann nun den &#34;unequipall&#34; Befehl korrekt benutzen, das bedeutet, dass sie sich z.B. automatisch ausziehen wird, wenn sie die Badeeinrichtungen von der Luxury Suite Mod benutzt.\r<br />- Der Bug von V 1.4, dass Bruse in eurem Haus auftaucht (wenn Vilja das Haus betritt, ohne vorher abzusteigen) sollte nun beseitigt sein.\r<br />- Verbesserte Meshes für Viljas grünes und blaues Kleid.\r<br />- Rund fünf Stimmdateien neu aufgenommen und hinzugefügt, die in V 1.4-1.4.1 nicht richtig funktioniert haben.\r<br />- Ihr könnt nun entscheiden, ob euch Vilja spontan knuddeln soll oder nicht (erst nachdem sie es das erste Mal gemacht hat). Außerdem wird euch Vilja nicht mehr umarmen, wenn ihr die Waffe gezogen habt.\r<br />- Kleinere Optimierungen, Anpassungen und Korrekturen.\r<br />\r<br />\r<br />Änderungen V 1.4.1:\r<br />===================\r<br />- Fehler in den Versionen 1.4-1.4.01 behoben, wodurch Bruse manchmal Innenräume betreten hat.\r<br />- Viljas Verhalten verbessert, wenn sie Bruse besteigt.\r<br />- 15 Sprachdateien repariert, die in den Versionen 1.4-1.4.01 nicht richtig funktioniert haben.\r<br />- Problem behoben, wodurch vier bestimmte NPCs nicht an dem Ort auftauchten, wo sie sollten. (Teil von Viljas Mission)\r<br />- Vilja kann jetzt ihr Lagerfeuer wieder entfernen.\r<br />- Die Eselschwanz-Mission wird nun beendet, wenn ihr Vilja endgültig wegschickt. Auch der &#34;Warum leistest du nicht Vilja Gesellschaft?&#34;-Dialog wird entfernt, wenn Vilja für immer geht.\r<br />\r<br />\r<br />Änderungen V 1.4:\r<br />=================\r<br />- Berittener Kampf (wird voraussichtlich in der nächsten Version noch verbessert).\r<br />- Vilja kann Mäntel, Beutel, Schmuck auch zusammen mit einer Rüstung tragen. Ihr könnt außerdem ihr Verhalten einstellen, z.B. könnt ihr ihr sagen, dass sie in der Stadt (in Innenräumen) keinen Helm tragen soll.\r<br />- Ihr könnt Vilja mit Hilfe von Schriftrollen neue Zauber beibringen (sobald sie ihre ersten Zauber vom &#34;grünhaarigen, rotäugigen Winzling aus den geheimnisvollen Tiefen der Unterwelt&#34; gelernt hat). Aber natürlich könnt ihr ihr weiterhin keine Feuerbälle beibringen, sonst könnte sie sich ja nicht mehr deswegen beklagen. ;)\r<br />- Ihr könnt ihr mit allen InGame Rezepten beibringen, neue Tränke zu brauen.\r<br />- Sie wird &#34;Einmal Kommentare&#34; nur noch einmal sagen (Skyrim V 1.7 Bug, wodurch NPCs jedes Mal, wenn man das Spiel lädt, &#34;Einmal Kommentare&#34; wiederholt haben).\r<br />- Mehr Interaktion mit Standard-Begleitern. Sie unterhält sich jetzt auch mit J&#39;zargo, Kharjo, Jenassa, Aranea und Rayya (Hearthfire Huscarl). \r<br />Außerdem hat sie auch neue Gesprächsthemen mit Begleitern, mit den Stimmen von Farkas - Aela - Lydia (also die Begleiter, mit denen sie sich bereits früher unterhalten hat).\r<br />- Vilja hat jetzt ihr eigenes Zelt (mit zwei Schlafplätzen), und kann ein Lagerfeuer machen. Beides ist mit Frostfall kompatibel.\r<br />- Im Hauptthema &#34;Würdest du mir bitte einen Gefallen tun?&#34; findet ihr das Thema &#34;Mach bitte etwas Licht&#34;. Vilja wird dann ein magisches Licht herbeizaubern. Wenn es wieder ausgeht, wird sie es von selbst solange neu herbeizaubern, bis ihr ihr sagt, dass sie aufhören soll.\r<br />- Viljas Dialogstruktur wurde überarbeitet. Ihr findet jetzt z.B. im Hauptthema &#34;Es geht um unsere Reise...&#34; eine Übersicht über die Entscheidungen, die ihr getroffen habt (z.B. Kampfstil, unsterblich/sterblich, ob sie angezogen oder nackt schwimmen soll, usw.).\r<br />- Wenn ihr einige ihrer Angewohnheiten zu nervig findet, könnt ihr sie abschalten (aber erst, wenn ihr euch etwas besser kennt), z.B. damit sie euch nicht mehr fragt, ob sie die Führung übernehmen kann, oder in den Städten von selbst ins nächste Gasthaus marschiert.\r<br />- Neues System für Viljas Durst. Gebt ihr einfach ein paar Getränke ins Gepäck, und sie wird erst diese trinken, anstatt euch zu fragen. Erst wenn sie nichts mehr hat, wird sie euch wieder so lange nerven, bis ihr ihr neue Getränke ins Gepäck gebt.\r<br />- Ihr könnt auswählen ob Vilja dicht hinter euch gehen soll, oder ob sie etwas Abstand halten soll.\r<br />- Vilja hat jetzt eine neue Methode ihr Pferd Bruse zu rufen.\r<br />- Bruse sollte jetzt immer mit dem Spielerpferd mithalten können (aber ihr müsst euer Pferd mindestens einmal reiten, nachdem ihr Vilja installiert habt, bevor das funktioniert&#33;).\r<br />- Bruse und Leifur haben ein neues Aussehen (von Lycanthrops).\r<br />- Vilja wird jetzt etwas dazu sagen, wenn ein anderer Begleiter stirbt. Gelegentlich wird sie auch noch später darüber sprechen, z.B. falls Lydia stirbt und ihr im Brisenheim seid, ist es möglich, dass Vilja sagt, wie leer Brisenheim ohne Lydia ist.\r<br />- Mehr Geplauder mit diversen NPCs, die Akademie von Winterfeste (über den Ort, Personen und Missionen) und Orkfestungen.\r<br />- Viljas Tagesablauf für zu Hause wurde erweitert. Unter anderem wird sie Abends gelegentlich ins Gasthaus gehen. Und falls ihr angeordnet habt, dass andere Begleiter ihr folgen sollen, werden diese natürlich mitgehen.\r<br />- Ihre Lebensgeschichte wurde dem neuen Solstheim der Drachenblut-Erweiterung angepasst.\r<br />- Vilja wird nicht mehr von selbst einkaufen gehen, wenn die originalen Händler tot sind. Wenn ihr sie trotzdem einkaufen schickt, wird sie zu alternativen Händlern gehen. Falls diese auch sterben sollten, wird Vilja euch fragen, wohin sie gehen soll.\r<br />- Einige Bugs beseitigt, darunter den, durch den Vilja nie wieder gesprochen hat, wenn man ihr gesagt hat, dass sie ruhig sein soll.\r<br />- Weitere Verbesserungen ihres Dialog-Systems. Sie sollte nun in Dungeons nicht mehr über unwichtige Dinge sprechen. Und ihr solltet auch hoffentlich nicht mehr das Gefühl haben, dass sie ständig mit euch nörgelt...\r<br />\r<br />\r<br />Änderungen V 1.3:\r<br />=================\r<br />- Mehr Bewusstsein: Vilja weiß jetzt, wenn ihr ein Werwolf seid, sie weiß ungefähr wie viele Drachen ihr getötet habt, ob ihr gut in Alchemie, Taschendiebstahl usw. seid, und wird sich gelegentlich dazu äußern. Sie ist sich auch über bestimmte Gegnertypen mehr bewusst und wird gelegentlich darüber sprechen. Sie hat bereits immer gewusst, wenn ihr ein Vampir seid, und wird nun etwas öfter darüber sprechen.\r<br />- Mehr Geplapper und Gesang, sowie mehr Möglichkeiten für das Bücher-Vorlesen.\r<br />- Weitere Feinabstimmungen, damit sie sich nicht zu oft wiederholt. Das Problem bezüglich der &#34;Einmal-Kommentare&#34; gilt allerdings nach wie vor, so dass sie sich manchmal selbst wiederholt, wenn ihr das Spiel ladet.\r<br />- Weitere Feinabstimmungen bei den Dialog-Bedingungen. Z.B. sollte sie nicht länger mit einer deaktivierten Lydia sprechen, oder plappern, wenn ihr sie nach Sovngarde ruft.\r<br />- Kleines Problem behoben, wodurch sie während einer bestimmten Phase des Romantikanfangs immer und immer wieder denselben Gruß wiederholt hat.\r<br />- Der Umarmungs-Tötungs-Bug sollte nun endgültig verschwunden sein. Und ihr müsst nicht mehr eine Romanze mit ihr anfangen, um sie umarmen zu können - sobald ihr ihre Flaschenmission abgeschlossen habt, könnt ihr ihr auch eine freundschaftliche Umarmung geben.\r<br />- Ihr könnt nun einstellen, ob Vilja ruhig sein soll oder nicht, wenn ihr die Waffe gezogen habt (standardmäßig wird sie weiterhin ruhig sein).\r<br />- Verzauberte Rüstungen bekommen durch Viljas zunehmende magische Fähigkeiten nicht länger einen Extra-Bonus.\r<br />- Vilja wird nun Armbrüste richtig verwenden.\r<br />- Ein Problem beim Sparring behoben.\r<br />- Gefolgsleute die Vilja folgen, sollten nun nicht mehr nackt herumlaufen, und ihr Inventar sollte korrekt funktionieren. Bitte beachtet, dass AFT Benutzer Lydia NICHT befehlen können Vilja zu folgen, und dass ihr andere Begleiter erst entlassen müsst, bevor ihr ihnen anweisen könnt Vilja zu folgen, oder mit ihr oder euch zu trainieren.\r<br />- Aus Viljas Extrataschen sollten keine Rüstungen mehr verschwinden.\r<br />- UFO Befehle von Viljas Dialogen entfernt.\r<br />- Bruse wird nicht mehr durchsichtig.\r<br />- Einige Fraktionsbezogene Probleme behoben, die ihr Verhalten beeinflussen könnten.\r<br />- Vilja wird niemanden mehr angreifen, nur weil ihr euch mit ihm streitet.\r<br />- Viljas Einkaufsorte sollten nun vollständig mit Mods wie Open Cities kompatibel sein, auch wenn ihr diese Mods öfters deinstalliert und neu installiert.\r<br />- Der Vilja-Erneuerungszauber wurde erweitert, und wird nun unter anderem auch Lähmung und Bewusstlosigkeit entfernen, und Geschwindigkeit wiederherstellen. Falls sie stirbt und ihr sie per Cheat wiederbelebt, verwendet danach immer den Erneuerungszauber&#33; (Oder ihr macht sie per Dialog unsterblich.)\r<br />- Ein paar kleine Überraschungen. Emma will nichts verraten, außer das eine mit Drachen zu tun hat und die anderen mit Romantik.\r<br />\r<br />\r<br />Änderungen V 1.2:\r<br />=================\r<br />- Die Sprachdateien sollten nun bessere Qualität haben. (Danke an Xtudo&#33;)\r<br />- Besseres System für Viljas Plapper-Kontrolle. Ihr könnt nun bestimmen wie oft sie Kommentare abgeben soll. Standard ist nach wie vor häufiges Geplapper (sie kann allerdings, wenn ihr das Spiel ladet, trotzdem noch schnell ein paar Sätze sprechen.).\r<br />- Viljas Heilung des Spielcharakters sollte nun besser und zuverlässiger funktionieren.\r<br />- Vilja sollte nun immer ruhig sein, wenn ihr eine Waffe zieht oder einen Zauber vorbereitet.\r<br />- Vilja sollte nun während des Schleichens weniger sprechen und dabei (fast) immer flüstern.\r<br />- Romanze: Vilja kann euch nun eine Umarmung geben. Thema &#34;Unterhalten wir uns doch ein bisschen -&gt; Bekomme ich eine Umarmung?&#34;, und manchmal auch spontan von selbst.\r<br />- Kampftraining: Ihr und Vilja könnt nun mit euren Huscarls trainieren, und als Bonus können eure Huscarls auch untereinander trainieren. (Diese Funktion ist allerdings erst verfügbar, wenn Vilja ihre Flöte zurückbekommen hat)\r<br />- Andere Gefolgsleute können nun auch Vilja anstatt euch folgen. Nützlich um euch z.B. in einem Dungeon strategisch aufzuteilen...oder endlich einmal Lydia aus ihrem Stuhl herauszubekommen ;) Oder wenn ihr einfach Vilja und euren restlichen Gefolgsleuten einen schönen Abend in einem Gasthaus gönnen wollt. Das funktioniert mit bis zu 10 Gefolgsleuten. ACHTUNG: Verwendet diese Funktion nur für Standardbegleiter (vom Spiel oder aus Mods), Modbegleiter mit verbesserter KI (wie z.B. Cerwiden) könnten dadurch einen Großteil ihrer Funktionen verlieren.\r<br />- Wenn ihr schleicht, wird Vilja Kämpfe vermeiden, bis sie oder ihr entdeckt worden seid. Sie wird nicht einfach auf die Gegner zustürmen, auch wenn andere Gefolgsleute es tun.\r<br />- Viljas Zauber werden stärker, wenn sie in den erforderlichen Fertigkeiten Stufen gewinnt.\r<br />- Falls ihr Vilja aus irgendeinem Grund neu installieren müsst, könnt ihr jetzt ganz einfach wieder zur ungefähr selben Stelle ihres Missionsverlaufs zurückkehren, an dem ihr vorher wart. Sprecht mit Vilja über &#34;einige wichtige Dinge -&gt; Wir haben bereits (einige) deiner Missionen beendet&#34;, und ein neuer NPC, Beata, wird vorübergehend in der Beflaggten Mähre auftauchen. Sprecht mit ihr, um die Missionen zu überspringen, die ihr bereits gemacht habt. Hinweis: Viljas Missionen sind nicht linear, ihr werdet also vielleicht zwischen Beatas Dialogen ein paar Mal hin und herwechseln müssen, um alle ihre Missionen und andere Themen, wie die Romanze und ihre Hintergrundgeschichte zur Auswahl zu bekommen.\r<br />- Fehler behoben, durch den Vilja pausenlos quasselt, wenn sie sich während einer Szene setzt.\r<br />- Viljas &#34;Fertigkeit&#34; still zu sein, während ihr mit anderen NPCs sprecht, oder während einer Szene, wurde stark verbessert. (Aber sie darf nach wie vor in Tavernen fröhlich vor sich hin plappern&#33;)\r<br />- Dialoge weiter gefiltert, damit sie ihre Kommentare möglichst selten wiederholt (allerdings sagt sie manchmal noch einige Sätze schnell hintereinander, wenn ihr ein Spiel ladet).\r<br />- Ihr könnt nun Leifurs Bellen ein- und ausschalten. Er wird von selbst immer ruhig sein, wenn ihr schleicht, eine Waffe zieht oder einen Zauber vorbereitet.\r<br />- Leifur kann nun schleichen und Überraschungsangriffe durchführen (er wird manchmal während des Schleichens halbdurchsichtig, aber wenn ihr euch wieder normal bewegt, wird er wieder vollständig sichtbar).\r<br />- Bruse wird sich nicht länger an Kämpfen beteiligen, und wird nicht mehr aggressiv, falls er zufällig von einem Teammitglied getroffen wird.\r<br />- Keine Änderungen mehr an der Spielwelt. Dadurch gibt es keine Probleme mehr mit Mods, die die Spielwelt verändern, wie &#34;Open Cities&#34;.\r<br />- Wenn ihr Vilja nach Hause schickt, wird sie nicht mehr automatisch in den Folgemodus wechseln, wenn ihr später ebenfalls zurückkehrt und sie zu Hause ansprecht.\r<br />- Änderungen durchgeführt, um den Verlauf der Romanze etwas zu beschleunigen( sie kann nun vom Nachmittag bis in den Morgen über Romanze-Themen sprechen).\r<br />- Einige kleinere Konflikte mit Dawnguard und Hearthfire bereinigt (der größte war, dass man Minette nicht adoptieren konnte).\r<br />\r<br />\r<br />Änderungen V 1.1.1:\r<br />===================\r<br />- Vilja sollte sich nun während eurer Gespräche mit NPCs oder Szenen ruhig verhalten (Ausnahme: In Gasthäusern, da sich dort alle unterhalten können).\r<br />- Vilja sollte nun still sein, oder weniger sprechen, wenn ihr es ihr sagt (auch wenn sie manchmal noch einige Sätze schnell hintereinander sagt).\r<br />- Ihr Inventar korrigiert - anstatt unlimitiert, haben in ihren Taschen nun 600 Einheiten Platz.\r<br />- Korrigiert wie der Preis berechnet wird, wenn Vilja für euch Dinge verkauft.\r<br />- Bruses Geschwindigkeit wird nun nach der Geschwindigkeit des Spielerpferdes berechnet. Bruse sollte nun auch etwas weiter hinter dem Spielerpferd stehen bleiben. &#34;Sicherheitsverhalten&#34; hinzugefügt, so dass wenn Vilja nicht auf normalen Weg absteigen kann, sie trotzdem vom Pferd herunterkommt.\r<br />- Zusätzliche NPCs der Vilja Mod sollten nun entfernt sein, sobald ihre Missionen abgeschlossen sind.\r<br />- Wenn ihr Vilja sagt, dass sie endgültig gehen soll, werden ihre Zauber nun entfernt. (Vilja rufen, usw.)\r<br />\r<br />\r<br />Änderungen V 1.1:\r<br />=================\r<br />- Problem behoben, dass Vilja nach häufigen Shopping-Touren überlastet ist.\r<br />- Problem mit Viljas Gesicht-Texturen behoben. HINWEIS&#33; Ihr Original-Gesicht ist dem UNP und Standard-Körper angepasst. Wenn ihr eine andere Bodymod benutzt, benutzt bitte auch die entsprechende Gesichtstextur bei der Original-Mod unter Optional Files&#33;\r<br />- Konflikte mit Begleiter-Overhauls behoben, einschließlich UFO, Convenient Horses, AFF und AFT. Im Fall von Convenient Horses müssen diejenigen, die Probleme damit haben mit Weißlauf-Spielerpferden auf das Inventar zuzugreifen, das Pferd noch einmal besteigen, bevor das Problem behoben ist (und danach natürlich abspeichern).\r<br />- Vilja sollte sich nicht mehr zu euch teleportieren, wenn ihr sie angewiesen habt, in einem Gasthaus oder zu Hause zu warten. \r<br />- Vilja sollte nun schneller und zuverlässiger aufsteigen und nicht mehr weglaufen, wenn sie Bruse ruft. Außerdem wurde ihr schnelles Reiten korrigiert, wenn ihr während des Schleichens aufsteigt und wieder absteigt.\r<br />- Problem mit ihrem Verhalten im Falkenring Gasthaus behoben – nun solltet ihr ihr auch dort Drinks spendieren können.\r<br />- Ihr Kampfverhalten beim Schleichen verändert. Vilja sollte sich nun am Kampf beteiligen, sobald sie merkt, dass ihr angegriffen werdet (das heißt, sobald eure Gesundheit unter 98% fällt). Das wird in zukünftigen Versionen noch verbessert.\r<br />- Dialog geändert, so dass euch eine bestimmte Person erklären wird, warum ihr sie nicht an einen bestimmten Ort bringen könnt, solange ihr nicht einen bestimmten Teil von Viljas Mission abgeschlossen habt.\r<br />- Ein neues &#34;Notlösungsthema&#34; zu Viljas Dialogen hinzugefügt (Hauptthema: Es geht um unsere Reise... -&gt; Wir müssen uns über einige wichtige Dinge unterhalten.). Hier findet ihr Lösungen für Probleme die gemeldet wurden, aber nicht nachvollzogen werden konnten (insbesondere Szenen die nicht starten) und &#34;falsche&#34; Entscheidungen, die ihr vielleicht getroffen habt, und die nicht einfach mit einem Konsolenbefehl korrigiert werden können (Cyrodiil Vilja oder Skyrim Vilja). Bitte benutzt diese Themen mit Vorsicht. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ViljaInSkyrim%20V%204_2_Deutsch-29901-4-2.rar?fid=1000225007&ttl=1535804377&ri=8192&rs=8192&setec=24537d85562cb4eac0d9a062e7cff110"
    }
  ]
}