{
  "modId": 2990.0,
  "modName": "Kohdi Retextures Part 2 - True Orichalcum",
  "summary": "Recolors all orichalcum",
  "descriptionHtml": "Kohdi\\'s Retextures Part 2 - True Orichalcum\r\n\r\n-Info-\r\nJust a little while before Skyrim was released I finished reading the Aeneid of Virgil (a translation, but a good one), and near the end of the poem, the breastplate of Turnus was described as having parts of orichalcum. Being an inquisitive person I Wikipedia\\'d the word and found that orichalcum was a kind of alloy purportedly used by the Greeks (and apparently the Atlanteans) which shone like either gold, bronze, or brass depending on who you asked. \r\n\r\nSkip ahead a week or two and I began finding armor and weapons in Skyrim made of orichalcum (I beileve that\\'s called serendipity), however the Skyrim version was not bronze or gold but greenish gray. I can agree with the race that smiths the metal (Orcs, Orismer, orichalcum, kinda obvious), and I can even stoop to mining a metal alloy from the ground, but I could not accept the dingy green color. \r\n\r\nSo, after more work than I expected for less less reward than I\\'d like (I don\\'t even wear the armor), I have changed all instances of orichalcum in the game to a nice coppery-brass color which has a reddish spectral shine. This includes male and female armor, weapons, ingots, ore, and hopefully ore veins (I haven\\'t seen one yet to verify). Does this seem a bit out of place on the Orcs? Yes. Does it add one too many sets of gold-colored armaments to the game? Maybe. Does it set my sense of poetic justice at ease? You bet.\r\n\r\nAs per the usual, all you need to do is extract the archive to your Data folder. Note that a meshes folder is included and is necessary if you don\\'t want a slimy green shine on your gear. Apart from the textures and spectral properties nothing else has been edited, not texture size or armor weights or any other change. Yes, that\\'s right, I made a retexture that keeps the size of the originals. What\\'re you gonna do?\r\n\r\n(note on the pictures: I didn\\'t include any \\\"before\\\" shots out of the assumption that you can notice the difference without double-checking. If anyone wants to make one, feel free!)\r\n\r\n-Troubleshooting-\r\nQ: The textures aren\\'t different/The green shine is still there!\r\nA: Make sure the folder structure is accurate, the path should go Data -> Textures/Meshes -> Armor/Weapons -> Orcish\r\n\r\nQ: The armor/weapons look(s) blurry when I get real close!\r\nA: That\\'s how \\\"efficiency\\\" grade textures work, nothing I can do for ya.\r\n\r\nQ: This is ugly/unsatisfying/doesn\\'t run with the lore!\r\nA: Think about it. You\\'re playing a Dark Elf in a land populated by Vikings shouting dragons out of the sky onto the mammoth-trodden tundra, and you think your Orcish armor looks funny. Priorities.\r\n\r\n-Changelog-\r\n12/7/11 - v1.0 - Initial Release\r\n\r\n-Contact-\r\nPM me here or leave a comment, I\\'ll respond either way.",
  "categoryId": "54",
  "version": "v1.0",
  "author": "Kohdi",
  "createdUnix": "1323321627",
  "updatedUnix": "1323321795",
  "containsAdultContent": false,
  "uploadedBy": "Kohdi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "8115",
      "name": "True Orichalcum",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12358",
      "fileName": "True Orichalcum-2990-v1-0.rar",
      "uploadedUnix": "1323321795",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/921db75b5d81a540ee647b48171a9b040f972755dda4d8c2d1f54f7304a2eba0/analysis/1406492533/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Orichalcum-2990-v1-0.rar?fid=8115&ttl=1535757692&ri=8192&rs=8192&setec=25fa0f4bfeb926eb3ea9965ad9a0875a"
    }
  ]
}