{
  "modId": 29916.0,
  "modName": "WASP - Weapon and Armor Standardization Project",
  "summary": "Allows multiple armor/weapon/crafting mods to work together in harmony, adds more variety to weapon and armor crafting.  Requires Java Runtime Environment 7.",
  "descriptionHtml": "You&#39;ve downloaded several new mods with tons of new clothes, armor, and accessories.  You have painstakingly selected your body replacers.  Your new swords are waiting to carve that pesky dragon into worm food.  So why can&#39;t you wear a cloak along with a cosmetic breastplate?  And why is that new sword listed under &#34;Miscellaneous&#34; at the tanning rack?\r<br />\r<br />The Weapon and Armor Standardization Project (WASP for short) aims to fix these shortcomings and much more.  This mod aims to be compatible with other popular weapon, armor, and crafting overhauls such as Skyrim Redone, Complete Crafting Overhaul Reborn, and others.\r<br />\r<br />Here is what WASP can do for you...\r<br />\r<br />[right][size=4][b]Wear All The Things&#33;[/b][/size][/right]\r<br />\r<br />WASP takes your armor - including mod-added armor - and assigns body slots according to a set scheme.  Vanilla (and DLC) armors and any new armors that use the vanilla armor slots [b]won&#39;t be changed[/b]; this is by design.  Where you will see the most changes is in mods that add items that don&#39;t go in the vanilla slots, such as Cloaks of Skyrim, UNP Hmmm What to Wear, Art of Magicka, Frostfall, and others.\r<br />\r<br />These changes will also require modified meshes so they don&#39;t become invisible when you equip them or drop them to the ground.  As such, only certain mods will be able to utilize this function at first.  Modified mesh packs will be added on this page as I am able to modify them.  If you don&#39;t see your favorite armor mod working properly, let me know, and I&#39;ll see if a mesh pack is required.\r<br />\r<br />[right][size=4][b]That Sword Requires WHAT to Build It?[/b][/size][/right]\r<br />\r<br />Some of the recipes used to build mod-added gear are just ridiculous.  If you want to make crafting more realistic, you will need to modify the constructible object (COBJ) record for that item.  Of course, not everyone wants to go through a huge armor mod and modify hundreds of records to taste.  So let WASP do it for you&#33;\r<br />\r<br />WASP uses a standardized scheme for crafting recipes and will apply it across all recipes.  WASP will also add recipes so you can salvage your old gear for parts.  WASP will also place all crafting recipes where they belong.  That new sword you were searching for is now craftable at a forge and is sorted by the main material used to build it.\r<br />\r<br />WASP integrates support for Complete Crafting Overhaul Remade by kryptopyr. If you have Complete Crafting Overhaul Remade installed, WASP will use the crafting standards introduced there so all of you recipes use similar amounts of materials.\r<br />\r<br />[right][size=4][b]Expansion Potential?  Limitless.[/b][/size][/right]\r<br />\r<br />The Skyrim modding community expands every day with new modders and their creations, and WASP is designed to work with those new creations with little or no updating required.  Just install the new mods and run the WASP patcher.\r<br />\r<br />[right][size=4][b]Compatibility With Other Mods?  [color=green]Yes.[/color][/b][/size][/right]\r<br />\r<br />WASP aims to be compatible with just about every armor and weapon mod out there.  Here is a short list of mods that can integrate seamlessly with WASP.  Most mods require no additional effort on your part; exceptions are noted below.\r<br />\r<br />[list][*][url=http://www.nexusmods.com/skyrim/mods/49791/?]Complete Crafting Overhaul Remade[/url][/*]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/49791/?]Dual Sheath Redux[/url] [b](use slots 55 and 60 when you generate Dual Sheath Redux.esp to avoid unpleasant and sudden nakedness)[/b]\r<br />[/*]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/23390/?]Guard Dialogue Overhaul[/url][/*]\r<br />[*][b][/b]Perkus Maximus\r<br />[/*]\r<br />[*][b]Skyrim Redone[/b][/*]\r<br />[/list]\r<br />\r<br />[center][size=5][b]INSTRUCTIONS[/b][/size][/center]\r<br />\r<br />[b]Requirements:[/b] - If you don&#39;t have these, WASP will not function&#33;\r<br />[list][*]The latest version of [url=http://www.oracle.com/technetwork/java/javase/downloads/java-se-jre-7-download-432155.html]Java Runtime Environment 7[/url].[/*]\r<br />[*][url=http://loot.github.io/]LOOT[/url].  (If you aren&#39;t using LOOT... what are you doing modding Skyrim?  Seriously... get it, use it.  Your game will thank you.)[/*]\r<br />[*]Some armor and weapon mods&#33;[/*]\r<br />[/list]\r<br />\r<br />[b]Recommended Mods:[/b] - useful but not required\r<br />[list][*][url=http://www.nexusmods.com/skyrim/mods/29865/?]SUM[/url] - Skyproc Unified Manager[/*]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/49791/?]Complete Crafting Overhaul Remade[/url][url=http://www.nexusmods.com/skyrim/mods/23390/?][/url][/*]\r<br />[/list]\r<br />\r<br />[b]Installation:[/b]\r<br />[list][*]Download the WASP install archive.[/*]\r<br />[*]Install using your favorite mod manager software, such as Nexus Mod Manager or Mod Organizer.[/*]\r<br />[*]For a manual install, copy the SkyProc Patchers folder you find inside the downloaded archive to your Skyrim-Data folder.\r<br />[/*]\r<br />[*]If you already have SUM installed and working properly, skip to the last step&#33;  SUM will detect and utilize the WASP patcher like any other SkyProc patcher.  If you don&#39;t use SUM, follow the next two steps.[/*]\r<br />[*]Mod Organizer users: You can right-click the WASP.jar file inside the Skyproc Patchers-WASP folder and add it as an executable.[/*]\r<br />[*]Everyone Else: Navigate to (Your Skyrim Folder)-Data-Skyproc Patchers-WASP.  Right-click on the WASP.jar file there, click on Send To, and click on Desktop (create shortcut.)[/*]\r<br />[*]Download any armor mesh packs you may need under &#34;Optional Files.&#34;  You can install them using your favorite mod manager or manually by dropping them straight into your Skyrim-Data folder.[/*]\r<br />[/list]\r<br />\r<br />[b]Using the WASP Patcher:[/b]\r<br />All you have to do to create the WASP patch is run the WASP patcher (or use SUM if you have it installed already.)  Click on &#34;Cancel&#34; to exit the patcher or click &#34;Patch&#34; to generate a patch.  The file that gets generated will be called &#34;WASP.esp.&#34;  If you are using SUM and decide to create a single .esp file, the changes made by WASP.esp will be included in the SUM.esp file that it builds.\r<br />\r<br />Be sure to run the WASP patcher or SUM every time you add, update, or remove your mods.  [b]EVERY.  SINGLE.  TIME.  Strange things may happen otherwise.[/b]\r<br />\r<br />[b]Load Order:[/b]\r<br />Place the generated WASP.esp file towards the end of your load order.  It must be placed after your Bashed Patch and with any other SkyProc patcher generated files (Automatic Variants, ASIS, Reproccer, WTF, etc.)  Below is an easy guide to where you should put WASP.esp.\r<br />\r<br />If you use LOOT like I suggested earlier, all you have to do make sure it places WASP.esp at the end of your load order.  It will do that every time you run LOOT afterwards.\r<br />\r<br />[b]LOAD ORDER GUIDE[/b]\r<br />Skyrim.esm\r<br />*Official DLC&#39;s & Unofficial Patches*\r<br />...\r<br />*All Other Mods*\r<br />...\r<br />Bashed Patch, 0.esp\r<br />...\r<br />[i]WASP.esp[/i]\r<br />...\r<br />\r<br />[b]Uninstallation:[/b]\r<br />All you have to do when you uninstall is deactivate WASP.esp and WASP Hive.esp, and make sure you don&#39;t run the WASP patcher again.  If you prefer to completely uninstall WASP and not use it again, follow the manual uninstallation instructions below.\r<br />\r<br />[b]Manual Uninstallation:[/b]\r<br />[u]Only follow this process if you are absolutely sure you will not use WASP again&#33;[/u]\r<br />\r<br />Delete the SkyProc Patchers-WASP folder from your Skyrim Data folder.\r<br />Delete all of the folders in your Skyrim-Data-meshes-WASP Hive folder.\r<br />If you use Nexus Mod Manager or Mod Organizer, ensure the mods are completely uninstalled at this time.\r<br />Delete the WASP.esp file.\r<br />\r<br />[right][size=4][b]Questions?  Comments?  Bugs?[/b][/size][/right]\r<br />Leave your comments and questions here and I will answer them as soon as I am able.\r<br />\r<br />Send bug reports directly to me via PM.  Be sure to include as much detail as possible, including any error messages you received, any visual bugs you saw, what mods you were running, and your load order.  [b]Any bug reports that are missing the above information will be deleted without prejudice and ignored.[/b]",
  "categoryId": "84",
  "version": "0.1",
  "author": "sirrogue2",
  "createdUnix": "1358156897",
  "updatedUnix": "1358156897",
  "containsAdultContent": false,
  "uploadedBy": "sirrogue2",
  "primaryFile": null,
  "files": []
}