{
  "modId": 29946.0,
  "modName": "Following Mercer - A Thieves Guild Quest",
  "summary": "*TG SPOILERS* So, what did Mercer do with all the stuff he took from the vault? He stored it in his various hideouts all over Skyrim, of course. Now you get to track it all down&#33;",
  "descriptionHtml": "TG SPOILERS AHEAD&#33;\r<br />\r<br />So, what did Mercer do with all the stuff he took from the vault? I thought it&#39;d be fun to track it down, so I made this mod.\r<br />\r<br />DESCRIPTION\r<br />\r<br />Two new quests will lead you through 9 new dungeons; 5 large and 4 small in a variety of styles, containing enough loot to make up for those 25 years of profit that Mercer stole.\r<br />\r<br />The quests are started by reading a note (Old Note) on Mercer&#39;s desk in his hidden basement in Riftweald Manor. (By the Grey Fox bust and the plans to take the Eyes of the Falmer.) As it says in the quest journal, I recommend waiting until after you&#39;ve done your thing with Bryn and Karliah before checking out the new dungeon.\r<br />\r<br />I&#39;ve gotten a lot of questions about the adult content. The adult content warning is only because the rules state that &#34;a file that includes or expands upon the graphic violence in the game&#34; must be tagged as adult. There is no more adult content present than in vanilla Skyrim&#33; The file is ONLY tagged as adult because of the wording of the Nexus rules, NOT because I added anything adult. In other words, the adult rating is a carryover of the game&#39;s rating, not a rating of anything I created.\r<br />\r<br />Locations are:\r<br />     Irknthamz, the Reach, between Druadach Redoubt and Deep Folk Crossing.\r<br />     Bonestrewn Cave, Eastmarch, just under Bonestrewn Crest.\r<br />     Fort Blackmoor, Whiterun, between Silent Hills and Dustman&#39;s Cairn.\r<br />     Aalto Mine, the Rift, one entrance just north of Shor&#39;s Watchtower, and another on the south side of Northwind Summit.\r<br />     Barrow Cove, Haafingar, farthest NW corner, on the beach.\r<br />     Bullseye Cave, Falkreath, N of Twilight Sepulchre.\r<br />     Sunken Ruin, Morthal, N of the town, near Falion&#39;s night-time hangout.\r<br />     Duarknd Mine, the Pale, on the NW coast of an island just west of Yngvild.\r<br />     Ngalft, Winterhold, on the beach by the glaciers, E of Snow Veil Sanctum.\r<br />\r<br />INSTALLATION\r<br />\r<br />Just drop followingmercer.esp and followingmercer.bsa into your Skyrim/Data folder. Activate the .esp using the mod manager of your choice.\r<br />\r<br />A NOTE\r<br />\r<br />This is my first mod. I know very little about programming and the like, only what I recall from a 101 type course over a decade ago. I&#39;m teaching myself, basically. Any sort of constructive criticism or tips or whatever would be greatly appreciated.\r<br />\r<br />Thanks for checking out my little mod&#33; I love you guys&#33;\r<br />\r<br />HINTS & HELP\r<br />\r<br />Having trouble finding keys? Here are the locations (obviously, SPOILERS&#33;): \r<br />\r<br />In Irknthamz: \r<br />\r<br />Key to Deep Lab: on the middle dresser in the middle of the three identical suites. The door is unlocked. The dresser is lit up and has a gem next to the key, both sitting on a little mat on top of the metal dresser. \r<br />\r<br />Two Keys to progress through the lab: One is in the large room with spiders and chaurus. It&#39;s outside the pens on a table with a light, in the far corner by a chest. The other is in the room with the dwarven spiders and big stairs, behind a metal gate. It&#39;s on the desk in the far corner of the room, by some lockpicks, apples, a diamond, and other clutter, and has a light beam pointing at it roughly. \r<br />\r<br />Elevator key: On the lit-up pedestal just past the centurion, next to a sapphire. Another is by the candle on the right once you&#39;ve taken the elevator back up. \r<br />\r<br />Mercer&#39;s key (optional): on his remains. \r<br />\r<br />In Bonestrewn Ruins: behind the small portcullis in the pit and down a short hall, on a table by some gems, mead, and a strongbox in the room with the enchanting and alchemy tables. (Optional--unlocks master locked door.) \r<br />\r<br />In Fort Blackmoor: In the tower, on the table in the room with the throne, next to the bottle of mead, or on the barrel next to a bed in the basement. \r<br />\r<br />In Mercer&#39;s Cabin: on the table by the door upstairs, or on the bar downstairs by a coinpurse and a potion. \r<br />\r<br />In Ngalft: on the plans on top of the safe at the end. \r<br />\r<br />Quest stages:\r<br />\r<br />Recovering Assets: TGNQ\r<br />10: I found a note of Mercer&#39;s mentioning Irknthamz. I should investigate sometime after we go to Irkngthand.\r<br />30: At Irknthamz, I encountered the shade of Mercer Frey and killed it. I should search its remains.\r<br />40: I recovered the Guild Master&#39;s Ring and various other valuables from the ruins of Irknthamz. I&#39;ve also discovered another lead, and should go to the cave at Bonestrewn Crest.\r<br />70: While at Bonestrewn Cave, another ghostly apparition of Mercer Frey attacked me. I defeated it and should check its remains.\r<br />80: At Bonestrewn Cave, I recovered enchanted boots and other valuables from the ghost&#39;s remains, and a note directing me to Fort Blackmoor in Whiterun hold.\r<br />100: At Fort Blackmoor, I encountered another ghostly apparition of Mercer Frey and defeated it again. I should search its remains.\r<br />110: From Fort Blackmoor, I acquired new gloves and found another clue directing me to Aalto Mine, in the Rift.\r<br />130: In Aalto Mine, I found an entrance to Mercer&#39;s cabin. Inside was another shade, which I defeated. I should search its remains.\r<br />140: I found Mercer&#39;s hood and a clue leading me to Barrow Cove in Haafingar.\r<br />160: At Barrow Cove, I encountered and defeated another shade of Mercer. I should search its remains.\r<br />170: At Barrow Cove, I found Mercer&#39;s cuirass, completing the set of armor, and retrieved the rest of the Guild&#39;s stolen property.\r<br />\r<br />Collecting Plans: TGNQ2\r<br />5: Keep an eye out for the plans Brynjolf mentioned.\r<br />10: I found the Guild&#39;s book of plans for the Reach. I&#39;ll keep an eye out for the rest.\r<br />20: I found the Guild&#39;s books of plans for Eastmarch and the Reach. I&#39;ll have to keep an eye out for the rest.\r<br />30: I found the Guild&#39;s plans for Whiterun, Eastmarch, and the Reach. I&#39;ll have to keep an eye open for the rest.\r<br />40: I found the Guild&#39;s plans for the Rift, Whiterun, Eastmarch, and the Reach. I&#39;ll keep looking for the rest.\r<br />50: I found the Guild&#39;s plans for Haafingar, the Rift, Whiterun, Eastmarch, and the Reach, and directions to Bullseye Cave in Falkreath.\r<br />60: I found the Guild&#39;s plans for Falkreath, Haafingar, the Rift, Whiterun, Eastmarch, and the Reach, and directions to Sunken Ruin in Hjaalmarch.\r<br />70: I found the Guild&#39;s plans for Hjaalmarch, Falkreath, Haafingar, the Rift, Whiterun, Eastmarch, and the Reach, and directions to Duarknd Mine in the Pale.\r<br />80: I found the Guild&#39;s plans for the Pale, Hjaalmarch, Falkreath, Haafingar, the Rift, Whiterun, Eastmarch, and the Reach, and directions to Ngalft in Winterhold.\r<br />90: I recovered all of the Guild&#39;s plans and should return them.\r<br />100: I returned all the Guild&#39;s plans and received payment.\r<br />\r<br />Mod Special Items:\r<br />Guild Master&#39;s Ring: TGNQRing, XX003195\r<br />Mercer&#39;s Boots: TGNQBoots, XX00316F\r<br />Mercer&#39;s Gloves: TGNQGauntlets, XX00317E\r<br />Mercer&#39;s Hood: TGNQHelmet, XX00317F\r<br />Mercer&#39;s Armor: TGNQCuirass, XX003170\r<br />Icewind: TGNQScimitar, XX003196\r<br />(Replace the XX with the mod&#39;s load order place on your machine, 01-FF.)\r<br />\r<br />END SPOILERS ",
  "categoryId": "35",
  "version": "2.3b",
  "author": "rubypele",
  "createdUnix": "1358211100",
  "updatedUnix": "1404609015",
  "containsAdultContent": true,
  "uploadedBy": "rubypele",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027856",
      "name": "FollowingMercer 2-0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1864",
      "fileName": "FollowingMercer-29946-2-0.zip",
      "uploadedUnix": "1367613803",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1abecc3cb67cbb8d8898ad874566a702fbc35ab9432a85df4149c89344f3489/analysis/1407553001/",
      "changelogHtml": " Added four new dungeons. <br/> \n Added a second quest. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FollowingMercer-29946-2-0.zip?fid=1000027856&ttl=1535804435&ri=8192&rs=8192&setec=f39cb19f87efcd5a5ae0d4180ca98840"
    },
    {
      "fileId": "1000086748",
      "name": "Following Mercer 2-21",
      "version": "2.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1744",
      "fileName": "Following Mercer 2-21-29946-2-21.rar",
      "uploadedUnix": "1387040402",
      "modVersion": "2.21",
      "virusScanUrl": "https://www.virustotal.com/file/ba63ad99a297ef028ebe4e0be060fe589c29078ec4fd56ca5be208a7b4a0cd98/analysis/1407837101/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Following%20Mercer%202-21-29946-2-21.rar?fid=1000086748&ttl=1535804436&ri=8192&rs=8192&setec=50e279e5e3d2c3e2b392dafa1080cb81"
    },
    {
      "fileId": "1000116072",
      "name": "Following Mercer 2-3b",
      "version": "2.3b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1873",
      "fileName": "Following Mercer 2-3b-29946-2-3b.7z",
      "uploadedUnix": "1404609015",
      "modVersion": "2.3b",
      "virusScanUrl": "https://www.virustotal.com/file/fdfd5f4c20c36f10c97220302060111f20fac65d4cd370d67b2205b3b12f489a/analysis/1408162874/",
      "changelogHtml": " Fixed .bsa file. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Following%20Mercer%202-3b-29946-2-3b.7z?fid=1000116072&ttl=1535804436&ri=8192&rs=8192&setec=df0be94f2d22135f5f95272265237932"
    }
  ]
}