{
  "modId": 29956.0,
  "modName": "Way of the Dragonborn - Shout Skill - Perk Tree - Character Build",
  "summary": "This makes a new skill, perk tree, and character build based around Shouts. It remains balanced while strong, and does not interfere with vanilla assets. SKSE Required",
  "descriptionHtml": "Path of the Dragonborn - Shout Skill, Perk Tree, and Character Build\r<br />NOW FEATURING THE CREATIVE PERKS EDITION, NOT COMPATIBLE WITH OTHER EDITION.\r<br />SKSE Required for proper functioning - http://skse.silverlock.org/\r<br />\r<br />Shouts were the brand new thing that differentiated Skyrim from previous iterations of The Elder Scrolls. It was therefore dissapointing to many\r<br />that they played such a minor role in combat, and were seemingly useless for the most part. This mod aims to change that by offering Shouts as a complete Skill\r<br />complete with a perk tree, gear, a Doom Stone (like The Wizard, the Warrior, and the Thief stones) in order to make shouting fun and useful as a character build.\r<br />It does all this without editing vanilla records, and should therefore be compatible with all other mods.\r<br />Dawnguard shouts are not included, because I haven&#39;t bought it. Sorry&#33;\r<br />\r<br />Installation:\r<br />Simply extract the contents of the downloaded rar file directly into your Data folder (which can be found in the Skyrim directory).\r<br />\r<br />Starting Out:\r<br />Like all other skills, there is a racial bonus granted to the Shout Skill. It is a 10 rank bonus, and is granted to the Nord, as historically they are the race\r<br />of Ysmir and Talos, the race that first brought the Thu&#39;um to the races of man. Therefore they begin with 25 ranks, while other races begin with only 15.\r<br />There is nothing that must be done in order to activate the mod, and you will begin with several spells and abilities that are used throughout this mod.\r<br />For example, now with every five ranks of the Way of the Voice skill, you will gain 5% bonus duration or magnitude (depending on the type of shout it is) on all shouts, and 1%\r<br />faster shout recovery time. Therefore at level 100 you will have 20% reduction in cooldown, and will have fully doubled the efficacy of your shouts&#33; This is without taking any perks\r<br />within the tree, which will also lend considerable force to your Thu&#39;um.\r<br />There are three ways to gain ranks in Way of the Voice. One is to simply cast a shout at NPCs and creatures. Anything alive will do. Whirlwind Sprint however, which does not have a target,\r<br />will not give you experience. That would make levelling entirely too easy I feel.\r<br />The second way is to kill dragons. Slaying dragons gives you a full third of a skill rank, regardless of how high in the skill you are. I feel this is appropriate because by the time you are\r<br />in your 90s in Way of the Voice skill you will likely be facing Elder and Ancient Dragons anyhow.\r<br />The third way is to learn a word from a word wall. This gives a full rank, like a trainer would. This is to make up for the lack of trainers and books in a way that makes Lore sense for the skill.\r<br />Gaining experience can be done 20% faster by using the Statue of Talos next to the Guardian Stones (which I have placed) which will act just like the Warrior, Thief, or Mage stones, but for shouts.\r<br />\r<br />When ranks are gained, the User Interface will tell you that you have gained ranks in Destruction. You haven&#39;t, that is merely to trick the game engine into giving you experience towards the next Player Level.\r<br />\r<br />SMALL NOTE: Nothing in this mod effects the duration, magnitude, or anything about Slow Time. This is because I felt it was the one shout in the game that did not merit improvement. It is perfectly strong by itself,\r<br />so I didn&#39;t mess with it. If I get enough complaints I can easily release a version with Slow Time&#39;s duration lengthened. Oh, I suppose cooldown reductions from this mod will effect Slow Time, but that is all.\r<br />\r<br />Gear:\r<br />The only gear added in this mod are the robes and hood of the Greybeards, which can be found on the chest out front of High Hrothgar. The robes will give you 20% reduction in Shout cooldown\r<br />while the hood is there just to visually match the robe. You can enchant it with whatever you like. If you ever need another hood, type ~ and when the console opens up type -help &#34;greybeard&#39;s hood&#34; and it should\r<br />give the FormID. Type &#34;player.additem XXX Y&#34; where XXX is the FormID and Y is the number you want and you will have more hoods.\r<br />\r<br />Note that with the addition of these robes, one can achieve approximately 70% cooldown reduction early game by getting a) The blessing of Talos b) The amulet of Talos c)Greybeard&#39;s Robes and D) being a nord. With 100 skill\r<br />you can raise that to 80%, and with the final perk in the tree even 100% cooldown reduction (so long as you keep that blessing of talos active).\r<br />\r<br />The spells you will have gained are as follows:\r<br />Show Voice Stats - This will tell you your current skill rank in Way of the Voice as well as your current percentage towards the next rank. This is necessary because this skill \r<br />runs entirely on scripting so that it does not conflict with other mods or vanilla content. If I could have it display like other skills I would, but it is not possible.\r<br />\r<br />A hidden spell that basically makes it so that you gain experience from shouting at NPCs and creatures.\r<br />\r<br />Summon Way of the Voice - summons a ball of light if you have perk points to spend. This ball of light can be spoken to in order to gain perks. Sometimes the ball appears and disappears very quickly.\r<br />I am working on fixing that now, but in the meantime just press E rapidly while casting the spell and after a few tries you should begin a dialogue with it. It will not disappear while speaking to you.\r<br />\r<br />Toggle Brawl Mode - The hidden spell above mentioned causes something called the Brawl Bug. It is a common modding issue wherein dynamically attaching scripts causes vanilla brawl quests \r<br />(such as Vilkas&#39; fight to get into the Companions, or any fist fight that you aren&#39;t allowed to use weapons or magic in) to completely bug out. For this reason I have included Toggle Brawl Mode, which removes\r<br />the hidden spell such that you can accomplish a brawl, and then give yourself the hidden spell again afterwards to regain the ability to gain experience in the Way of the Voice. Handy, right?\r<br />\r<br />Now that we&#39;ve explained the Skill, its benefits, and its use, let&#39;s move on to the perks.\r<br />\r<br />Trained Voice - 5 ranks gained at 15,20,40,60,80\r<br />Each rank grants 10% increase in Shout Duration or Magnitude depending on the Shout (separated into categories below)\r<br />Leads to: Offensive Tone, Defensive Tone, Demanding Tone\r<br />\r<br />(Skill Rank 25 Perks)\r<br />Offensive Tone: 1 rank gained at 25\r<br />Grants a 15% increase in magnitude to the following shouts:\r<br />Fire Breath\r<br />Frost Breath\r<br />Marked for Death\r<br />Elemental Fury\r<br />Leads to: Fighting Words, Heated Words, Cold Words, Threatening Words\r<br />\r<br />Defensive Tone: 1 rank gained at 25\r<br />Grants a 15% increase in duration to the following shouts:\r<br />Ice Form, Become Ethereal\r<br />and a 15% increase in magnitude to the following shouts:\r<br />Unrelenting Force\r<br />Disarm\r<br />Dismay\r<br />Leads to: Evasion, Interjection\r<br />\r<br />Demanding Tone:\r<br />Grants a 25% increase in duration to the following shouts:\r<br />Call Dragon\r<br />Call Hero\r<br />Animal Allegiance\r<br />Kyne&#39;s Peace\r<br />Leads to: None\r<br />\r<br />(Skill Rank 50: Offensive Branch Perks)\r<br />Fighting Words:\r<br />Grants a 15% increase in magnitude to Elemental Fury\r<br />Leads to: Circular Breathing, Resonant ProjectionFighting Words:\r<br />\r<br />Heated Words:\r<br />Grants a 15% increase in magnitude to Fire Breath\r<br />Leads to: Circular Breathing, Resonant Projection\r<br />\r<br />Cold Words:\r<br />Grants a 15% increase in magnitude to Ice Breath\r<br />Leads to: Circular Breathing, Resonant Projection\r<br />\r<br />Threatening Words:\r<br />Grants a 15% increase in magnitude to Marked for Death\r<br />Leads to: Circular Breathing, Resonant Projection\r<br />\r<br />(Skill Rank 50: Defensive Branch)\r<br />Interjection:\r<br />Grants a 15% increase in magnitude or duration to Ice Form, Unrelenting Force, Disarm, Dismay\r<br />Leads to: Circular Breathing, Resonant Projection\r<br />\r<br />Evasion:\r<br />Grants a 15% increase in duration to Become Ethereal\r<br />Leads to: Circular Breathing, Resonant Projection\r<br />\r<br />(Skill Rank 75 Perks)\r<br />Resonant Projection:\r<br />Grants a 15% bonus magnitude on all magnitude based shouts\r<br /> - Magnitude Shouts - \r<br />  - Disarm\r<br />  - Dismaying Push\r<br />  - Unrelenting Force\r<br />  - Fire Breath\r<br />  - Frost Breath\r<br />  - Elemental Fury\r<br />  - Marked for Death\r<br />Leads to: Dragonborn\r<br />\r<br />Circular Breathing: \r<br />Grants a 15% bonus to duration of all duration based shouts\r<br /> - Duration Shouts - \r<br />  - Ice Form\r<br />  - Become Ethereal\r<br />  - Animal Alleigiance\r<br />  - Call of Valor\r<br />  - Call Dragon\r<br />  - Kyne&#39;s Peace\r<br /> Leads to: Dragonborn\r<br /> \r<br /> (Skill Rank 100 Perk)\r<br /> Dragonborn:\r<br /> 20% cooldown reduction on all shouts. Combined with an Amulet of Talos, Blessing of Talos, Greybeard&#39;s robes, and your 100 skill ranks you will be able to shout ad infinitum.\r<br /> \r<br /> SPECIAL PERK:\r<br /> Wyrmslayer:\r<br /> All shouts are 50% more effective against Dragons.\r<br /> Requirement: Kill Alduin.",
  "categoryId": "73",
  "version": "v1.2",
  "author": "Alex Ducey",
  "createdUnix": "1358227608",
  "updatedUnix": "1358834178",
  "containsAdultContent": false,
  "uploadedBy": "atducey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000002472",
      "name": "Way of the Dragonborn - Main file",
      "version": "v1.0c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "52",
      "fileName": "Way of the Dragonborn - Main file-29956-v1-0c.rar",
      "uploadedUnix": "1358227651",
      "modVersion": "v1.0c",
      "virusScanUrl": "https://www.virustotal.com/file/156f0dd6d59afdf93c3ddd76fa6797bba1399d2f22af55bc20beefe2e4c76816/analysis/1407354101/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Way%20of%20the%20Dragonborn%20-%20Main%20file-29956-v1-0c.rar?fid=1000002472&ttl=1535804450&ri=8192&rs=8192&setec=c03e2a9c47edcd33fe5ee4d8d4af9706"
    },
    {
      "fileId": "1000004151",
      "name": "Way of the Dragonborn - Creative Perks",
      "version": "v1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "73",
      "fileName": "Way of the Dragonborn - Creative Perks-29956-v1-2.rar",
      "uploadedUnix": "1358834178",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e7c44a3018cb6fc4bb7bcf65e132806b1a283049ec3eaf59d2c00ea2ecfe5ae5/analysis/1407373265/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Way%20of%20the%20Dragonborn%20-%20Creative%20Perks-29956-v1-2.rar?fid=1000004151&ttl=1535804451&ri=8192&rs=8192&setec=5735837c85191112270a682532bdc951"
    }
  ]
}