{
  "modId": 29953.0,
  "modName": "Julien Christophe - Priest of Mara - Male Breton Companion Follower",
  "summary": "Just a simple breton priest who only wants to help you make the world a better place. He&#39;ll follow you to Oblivion and back if he needed to.",
  "descriptionHtml": "######[url=http://skyrim.nexusmods.com/mods/10168]Apachii Skyhair- Male Standalone Pack[/url] required#######\r<br />You don&#39;t need the main file just the male standalone part.\r<br />Literally all you have to do is scroll down some in the Apachii Skyhair file tab and you will find it. It&#39;s past the main file and the female hair files. It&#39;s not all that hard to find. \r<br />\r<br />I love seeing any screenshot you all can give me :D It warms my heart seeing him on your adventures&#33;\r<br />\r<br />Also&#33;&#33; I&#39;m looking for anyone who would know how to get him healing the player. If anyone has any helpful information or has seen any good tutorials let me know ;)\r<br />==================================================\r<br />\r<br />======*Dossier*=======\r<br />\r<br />\r<br />Name: Julien Christophe\r<br />Race: Breton\r<br />Origin: High Rock Nobility\r<br />Family: A mother, a father and 3 sisters.\r<br />Age: Mid 20s - Early 30s\r<br />Height: 5&#39;10ish/177.6 cm\r<br />Appearance:  Pale skin, dark black hair, light bluish green (kind of an aqua color) eyes, rather muscular for the average priest. \r<br />Class: Priest/Cleric\r<br />Fighting Style: Mace and Buckler/Shield, Restoration Magic\r<br />Alignment: Lawful Good\r<br />Enjoys: Healing, Helping others, feeling safe, foraging for ingredients for potion crafting (though he&#39;s probably just picking flowers), and Spiced Wine and fancy cheeses.\r<br />Dislikes: Criminals, scary things and places (though he&#39;ll still follow you to them), and drinking too much.\r<br />\r<br />\r<br />====================\r<br />\r<br />Born and raised to a family of nobility in High Rock, Julien Christophe is a humble breton priest of the Divine Goddess of love Mara. He&#39;s a kind and gentle man who only wants to bring Mara&#39;s Benevolence to the people of Skyrim who are in the midst of a civil war. He may be slightly fearful but he is quite skilled with his mace and his restoration magic. \r<br />\r<br />\r<br />&#34;He&#39;s always ready to help even if he is not the bravest of sorts but his strong will more than makes up for that.&#34;\r<br />-quoted from [url=http://skyrim.nexusmods.com/users/209736]Kamikazekossori[/url]\r<br />\r<br />His skills include:\r<br />Close ranged mace combat\r<br />Good with a shield\r<br />Can heal himself with his magical spells (Can only heal himself, I&#39;d love to do an update so he can heal the player but I unfortunately don&#39;t know how)\r<br />Using what little he knows of Necromancy he can raise the dead to fight along side him\r<br />Send the Undead running in terror with his turning spells\r<br />\r<br />= Julien, Priest of Mara =\r<br />\r<br />The &#34;default version&#34; can be found in (where else) the Temple of Mara in Riften. Depending on the time of day he&#39;ll either be sitting in the pews, praying at the alters, eating or sleeping at nights through the morning. He&#39;s equipped with his beloved amulet of Mara, possibly tucked underneath his grey robes, and his trusty mace which he hates to use but will if he sees he must. Though he wears robes he is comfortable in heavy armor as well and should he be given a shield he will gladly hold it to protect you from certain danger. Though he cowers behind his shield his shield arm is strong and can take a pretty good beating. If his health falls too low he can revive himself using his restoration abilities. He is also particularly handy against undead as he knows a few spells to turn them away in fear. If he finds that an enemy (or anyone really) has fallen, he can use his knowledge of dark arts, Necromancy, to revive them and fight along side him and his leader. He&#39;ll be very happy to follow you however he knows he will be thrown into scary situations so you can see on his face that he may be a little scared or sad being in possibly dangerous places.\r<br />\r<br />=Julien the Wise=\r<br />\r<br />I recommend using this version with [url=http://skyrim.nexusmods.com/mods/14037]UFO[/url] as I didn&#39;t entirely specialize him well enough. Using that mod you can give him any spell if you have the proper spell tome (if you don&#39;t want to just add the spell using console command). He knows a few alteration, restoration, and conjuration spells and has a staff that I don&#39;t think he&#39;ll use. Not gonna lie, I hardly tested this one, he works but doesn&#39;t do everything he&#39;s supposed to. With UFO though he can be better if you kinda want to customize his spell craft abilities.  Julien would normally never cast a destructive spell but I&#39;ll let it slide for his version. He can be found wondering around Farengar Secret-Fire&#39;s office up in Whiterun&#39;s palace, Dragonsreach, possibly tinkering with enchantments or exploring his alchemy skills. He is very focused and it shows in his expression, hardly cracking a smile or showing signs of fear (even if he is a little scared).\r<br />\r<br />=Julien the Wild=\r<br />\r<br />A strange sort, he was a &#34;What If&#34; scenario I made a while back. Not really the fearful kindhearted priest people know him as. Julien (the Wild) was a scholar and a priest in High Rock, but when he came over to Skyrim, the harsh lands took a toll on the formerly pampered rich kid from High Rock. He learned to survive off the land, use a bow, sneak around and fight using anything he could get his hands on. He&#39;s forgotten some of his spells but may remember a few he can surprise you with should he feel necessary. He&#39;s been hardened by many long cold nights in Skyrim, he&#39;s taken some time off his camping/hunting schedule to have a couple drinks and swap stories in the Drunken Huntsman in Whiterun. If you hurry, you could catch him before the wilds call to him&#33; The rough outdoorsman life seems to have given him a permanent attitude, and it shows on his face. Give him a bow and some arrows and he&#39;s good to go.\r<br />\r<br />\r<br />-Recommended mods-\r<br />[url=http://skyrim.nexusmods.com/mods/27815]Fine Face Textures[/url] by Urshi for a younger looking face.\r<br />[url=http://skyrim.nexusmods.com/mods/2488]Better Males - Younger faces merged with Men[/url] by Geonox, edit by Chris57 + Coverkhajiits by mrLenski for another option (Mod page is not work safe)\r<br />Beard Options = [url=http://skyrim.nexusmods.com/mods/21620]HQ Beards[/url] and [url=http://skyrim.nexusmods.com/mods/28363]Beards[/url]\r<br />He prefers Bucklers to shields so if you want [url=http://skyrim.nexusmods.com/mods/5315] Bucklers[/url] will please his shield arm.\r<br />Something else that will make him happy is his best friend [url=http://skyrim.nexusmods.com/mods/24659]Stenvar[/url] you can keep them together using any follower mod that allows extra followers, I use UFO.\r<br />\r<br />\r<br />Thanks to my friends who inspired me to make him a follower\r<br />And special thanks to [url=http://skyrim.nexusmods.com/users/1311835]Rops1981[/url] for testing and taking screenshots. Check out his Inhabitants of Skyrim mods, [url=http://skyrim.nexusmods.com/mods/18820]Presets[/url], and [url=http://skyrim.nexusmods.com/mods/23755]NPC Overhaul[/url].\r<br />Thanks to everyone who submits images [url=http://skyrim.nexusmods.com/users/5531736]MissMorose[/url], [url=http://skyrim.nexusmods.com/users/1784046]Netherwalk[/url] (Check out nethers&#39; awesome follower mods too&#33;&#33;), [url=http://skyrim.nexusmods.com/users/2095337]Niire[/url], [url=http://skyrim.nexusmods.com/users/1260494]CrimsonFairy[/url] (and daily comments :P) and [url=http://skyrim.nexusmods.com/users/1801645]shadowtigers[/url] and [url=http://skyrim.nexusmods.com/users/2742381]Av1dPup1l[/url] I love screen shots and I truly appreciate them.",
  "categoryId": "66",
  "version": "V1",
  "author": "greyblood",
  "createdUnix": "1358222827",
  "updatedUnix": "1358223520",
  "containsAdultContent": false,
  "uploadedBy": "greyblood",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000002458",
      "name": "Julien Christophe - Priest of Mara Main",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "331",
      "fileName": "Julien Christophe - Priest of Mara Main-29953-1.rar",
      "uploadedUnix": "1358223364",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1bec7fd723dca8c3c07ab153246d6efc81eef9f2b0ccfa55730dd0e8ffa54862/analysis/1407353958/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Julien%20Christophe%20-%20Priest%20of%20Mara%20Main-29953-1.rar?fid=1000002458&ttl=1535804445&ri=8192&rs=8192&setec=4e6a1db347bd001175f175a4c294d10c"
    },
    {
      "fileId": "1000002459",
      "name": "Julien the Wild",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "556",
      "fileName": "Julien the Wild-29953-1.rar",
      "uploadedUnix": "1358223429",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b0d2a060ea0972c4acde7851357d9d20e8f354706bcb47b32c46a8286838f43f/analysis/1407354004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Julien%20the%20Wild-29953-1.rar?fid=1000002459&ttl=1535804446&ri=8192&rs=8192&setec=896ef471e3a5e26df1622d0016869fca"
    },
    {
      "fileId": "1000002461",
      "name": "Julien the Wise",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "421",
      "fileName": "Julien the Wise-29953-1.rar",
      "uploadedUnix": "1358223520",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d9cadae086e1015179511d15379925302bdaecae6b806f50d4448724b6b454f2/analysis/1407354023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Julien%20the%20Wise-29953-1.rar?fid=1000002461&ttl=1535804446&ri=8192&rs=8192&setec=bc61ac00249f64ddb55f787034cb04fb"
    }
  ]
}