{
  "modId": 29973.0,
  "modName": "Less predictable respawn",
  "summary": "Randomises the respawn rates of cells.",
  "descriptionHtml": "[center][size=9][color=#ff9900]Tekuromoto&#39;s Less predictable respawn[/color][/size][/center] \r<br />\r<br />[b]Version:[/b] 0.5 \r<br />\r<br />[b]Date:[/b] 16 January 2012 \r<br />\r<br />[b]Author:[/b] kuertee \r<br />\r<br />[b]Source:[/b] http://skyrim.nexusmods.com/mods/29973\r<br />\r<br />[b]Requirements:[/b] \r<br />\r<br />[list] [*]Skyrim 1.8 \r<br />[*]Skyrim Script Extender http://skse.silverlock.org/\r<br />[/list] \r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />[center][size=7][color=#ff9900]Short description[/color][/size][/center] \r<br />\r<br />Randomises the respawn rates of cells. \r<br />\r<br />[center][size=7][color=#ff9900]Gameplay changes[/color][/size][/center] \r<br />\r<br />Randomises these Game Settings whenever you move between cells:\r<br />\r<br />[list]\r<br />[*]iHoursToClearCorpses\r<br />[*]iHoursToRespawnCell\r<br />[*]iHoursToRespawnCellCleared\r<br />[/list]\r<br />\r<br />Why? I&#39;ll let Tekuromoto&#39;s read-me explain. I copy-and-paste this verbatim from his Oblivion mod&#39;s read-me:\r<br />\r<br />[quote]\r<br />\r<br />[size=5][color=#ff9900]How It Works[/color][/size]\r<br />\r<br />In order to understand what the mod will and will not do, it&#39;s important to understand how the Oblivion engine respawns (or resets) cells.\r<br />\r<br />First off, what do I mean by &#34;respawn&#34;? Well, don&#39;t think of it in a Diablo-esque sense. You cannot respawn monsters in the area for a hack-and-slash style horde of monsters that continually come at you from off screen. In Oblivion, every cell contains data about what&#39;s in it: NPCs and monsters, items (both placed by the designers and dropped by actors including the player), havoked items (like books and dishes), plants, food, and containers. When a cell is respawned, a number of things happen:\r<br />\r<br />[list]\r<br />[*]dead actors (and their inventories) are removed\r<br />[*]new actors are &#34;spawned&#34; if there are any spawn points in the cell\r<br />[*]havoked items that are still in the cell are returned to their original positions (books onto shelves, dishes onto tables, whatever)\r<br />[*]food that was initially in the cell (not dropped there by an actor) is replenished (this is a special case, and seems to have to do with NPCs being able to eat via the AI packages; other non-edible ingredients that have been removed do not replenish)\r<br />[*]items that were left in the cell are removed\r<br />[*]plants have their ingredients replenished so they are harvestable again\r<br />[*]containers that are not marked as &#34;non-respawning&#34; (ie, most containers other than those in player houses) have all their contents removed and discarded, and new contents are generated.\r<br />[/list]\r<br />\r<br />Everytime you enter a new cell, whether it&#39;s a shop, a dungeon, or a &#34;cell&#34; in the wilderness, that cell gets a timestamp indicating when it was last visited. The [b]next[/b] time you enter that cell, the timestamp is compared with the respawn timer and if enough time has elapsed then the cell is reset. This has a number of ramifications:\r<br />\r<br />[list=1]\r<br />\r<br />[*]A cell that is visited fairly frequently, say once every couple of days, will [b]never respawn[/b] with the default timer of 3 days. (EDIT: 10 days in Skyrim. END EDIT.)\r<br />\r<br />[*]A cell that is visited only once in the game still has all of it&#39;s data stored in the savegame file; it does not get reset (and garbage cleaned up, etc) until it is visited again.\r<br />\r<br />[*]The length of the respawn timer should not affect savegame size; only the number of cells visited (in addition to quest variables and all that) affects the amount of data in the savegame.\r<br />\r<br />[*]An inordinately long respawn timer (that never changes) will have the effect of making the world seem less dynamic, especially in cities and dungeons (see point 1).\r<br />\r<br />[/list]\r<br />\r<br />This means that every cell you enter is checked against the _current_ respawn timer value. So what this mod does is randomizes the respawn timer. Say it&#39;s been randomized to 36. If you&#39;ve been away from this cell for more than 36 hours, it&#39;ll reset, and the timestamp set to the current time.. At that time (when you&#39;ve entered your new cell) a new value is rolled; let&#39;s say it&#39;s 62. The _next_ cell you enter is checked against the _new current_ respawn timer of 62 hours. Again, if you&#39;ve been away from this cell for more than 62 hours, it&#39;ll reset and the timestamp gets reset and all that... BUT&#33; If you haven&#39;t been away from the cell long enough for it to get respawned, the timestamp STILL gets set to the current time. Hence the problem with revisiting a cell over and over within the respawn time limit: it&#39;ll never respawn.\r<br />\r<br />What this mod doesn&#39;t do is spawn new types of monsters, or affect the contents of non-respawning containers (such as in your house), or distribute new spawn points around the world (EDIT: [s](in an OOO/MMM overhaul type of sense)[/s] END EDIT.), or allow you to have certain types of cells respawn on a different schedule than the rest of the world.[/quote]\r<br />\r<br />[center][size=7][color=#ff9900]Details[/color][/size][/center]\r<br />\r<br />You can configure this mod with SkyUI&#39;s MCM or in the Console by typing &#34;SetPQV kuTLPRQ {mod data} {value}&#34;.Below are the various mod data that you can change, their default values and a short description of their effects. \r<br />\r<br />userMinIHoursToClearCorpses = 0 \r<br />\r<br />userMaxIHoursToClearCorpses = 0 \r<br />\r<br />By default, the mod does not change this setting. \r<br />\r<br />userMinIHoursToRespawnCell = 24 \r<br />\r<br />userMaxIHoursToRespawnCell = 72\r<br />\r<br />Randomises the respawn of cells from between 24 hours to 72 hours. \r<br />\r<br />userMinIHoursToRespawnCellCleared = 24 \r<br />\r<br />userMaxIHoursToRespawnCellCleared = 72 \r<br />\r<br />Randomises the respawn of cleared cells from between 24 hours to 72 hours. \r<br />\r<br />A configuration file (data&#92;ini&#92;kuerteeTekuromotosLessPredictableRespawn.ini) is provided with the relevant console commands. If you want to change any of the default values above, change them in the INI file then run the file by typing {bat &#34;ini&#92;kuerteeTekuromotosLessPredictableRespawn.ini&#34;} (without the brackets) in the console. You only need to do this when you want to change the values of the property. Your changes will be saved in your game. \r<br />\r<br />[center][size=7][color=#ff9900]Install[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]Use Wrye Bash (http://skyrim.nexusmods.com/downloads/file.php?id=1840) to install this mod. Just drag the package (which is a normal ZIP file) into Wrye Bash&#39;s Installers tab. However, the package is only a normal ZIP file, so if you know the game&#39;s mod file structure, install it manually. \r<br />\r<br />[*]Change your settings within the game in Sky UI&#39;s MCM or check the settings in &#34;Data&#92;Ini&#92;&#34;. If you change any of it, execute your changes by typing in the console {bat &#34;ini&#92;kuerteeTekuromotosLessPredictableRespawn.ini&#34;} without the brackets. \r<br />\r<br />[*]Activate the mod. \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Uninstall[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]In the console, type &#34;SetPQV kuTLPRQ uninstallNow True.&#34; Or with Sky UI&#39;s MCM, set the uninstallNow toggle to True then exit the menus. \r<br />\r<br />[*]Wait for a message confirming the uninstallation. Save the game. \r<br />\r<br />[*]Deactivate the mod with Wrye Bash. If you installed this manually, simply delete all the files you installed. (Wrye Bash keeps track of files used, so installing/uninstalling the mod with it is 100% simpler.) \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Troubleshooting[/color][/size][/center] \r<br />\r<br />[list] [*]You can reset the mod by typing {SetPQV kuTLPRQ resetNow True} (without the brackets) in the console. Or with Sky UI&#39;s MCM, set the resetNow toggle to True then exit the menus. \r<br />[*]When it resets it will ask you either reset all of its data or continue with the current data. Resetting all its data will remove all your configurations and set the mod as if you have first installed it. \r<br />[*]You can check all the mod&#39;s data by typing {SQV kuTLPRQ} in the console. You can check if your configurations were set in the mod properly with this. \r<br />[*]If you find that your changes (with the command SetPQV or from executing the INI) does not appear in the mod, check the command again for spelling errors. Then try again. \r<br />[*]If you find that resetting (with resetNow) and uninstalling (with uninstallNow) don&#39;t seem to work, the mod may have been suspended. It is best to simply start-over (i.e. reinstall the mod) after a &#34;clean&#34; save. \r<br />[*]Creating a clean save: \r<br />[list=1] \r<br />\r<br />[*]If you can uninstall the mod from the console with {SetPQV kuTLPRQ uninstallNow True}. \r<br />\r<br />[*]Wait for the mod to confirm the uninstallation. It may take a minute. If no confirmation appears, then simply continue to the next step. \r<br />\r<br />[*]Save the game manually from the console by typing {save uninstalledMod}. \r<br />\r<br />[*]Uninstall all the mod&#39;s files (*.ESP, *.PSC, *.PEX) from the game folders. Make sure that none of the mod&#39;s Scripts are left. A mod manager like Wrye is best used for this. \r<br />\r<br />[*]Load the &#34;uninstalledMod&#34; save. \r<br />\r<br />[*]Save the game manually again from the console by typing {save cleanSave}. Because all of the mod&#39;s files were removed, all of its data will be &#34;zeroed&#34; in this game. \r<br />\r<br />[*]Play from this game. \r<br />\r<br />[/list][/list] \r<br />\r<br /> \r<br />\r<br />[*]As a last resort, you can also enable script logging and investigate it and/or send it to me. Contact me first either on TESNexus or the official Bethesda forums. To enable script logging, read this thread from the official Bethesda Creation Kit Forum: http://forums.bethsoft.com/topic/1345130-having-papyrus-trouble-here-are-some-things-to-try/. \r<br />\r<br /> \r<br />\r<br />[center][size=7][color=#ff9900]History[/color][/size][/center] \r<br />\r<br />[list] [size=5][color=#ff9900]0.5, 16 January 2013:[/color][/size] [*]Initial release. \r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Credits[/color][/size][/center] \r<br />\r<br />Tekuromoto\r<br />\r<br />kuertee in http://www.bethsoft.com/bgsforums/ \r<br />\r<br />[center][size=7][color=#ff9900]Tools Used[/color][/size][/center] \r<br />\r<br />Creation kit - http://www.creationkit.com \r<br />\r<br />[center][size=7][color=#ff9900]Licensing/Legal[/color][/size][/center] \r<br />\r<br />You can do whatever you want with this mod but all I ask in return is that you give me credit. I would also like to be contacted when you \r<br />\r<br />include this mod in part or in full in a public release. ",
  "categoryId": "24",
  "version": "0.5",
  "author": "kuertee",
  "createdUnix": "1358259292",
  "updatedUnix": "1358259810",
  "containsAdultContent": false,
  "uploadedBy": "kuertee",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000002525",
      "name": "kuertee Tekuromotos Less predictable respawn 0p5",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "kuertee Tekuromotos Less predictable respawn 0p5-29973-0-5.zip",
      "uploadedUnix": "1358259442",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/836cdeaa54a61e84cf5e3c1bb17d8c0724b80ec36cc66aae736fd573a1567ca1/analysis/1407354534/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuertee%20Tekuromotos%20Less%20predictable%20respawn%200p5-29973-0-5.zip?fid=1000002525&ttl=1535804478&ri=8192&rs=8192&setec=5994ba904de86bf96b518386fcb4b3ee"
    },
    {
      "fileId": "1000002526",
      "name": "kuTLPR x MCM 0p5",
      "version": "0.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "kuTLPR x MCM 0p5-29973-0-5.zip",
      "uploadedUnix": "1358259810",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/318937e37e17fd0d2c0e98cfb6755c5eb1c3e872c740af0a233eda55e5486857/analysis/1407354612/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuTLPR%20x%20MCM%200p5-29973-0-5.zip?fid=1000002526&ttl=1535804478&ri=8192&rs=8192&setec=09adf7272eed6fe1176e25cc69667851"
    }
  ]
}