{
  "modId": 30028.0,
  "modName": "Killers Warrior Basement V2",
  "summary": "Well organised Basement storage mod",
  "descriptionHtml": "Version 3 Notes: \r\n\r\nPlayers with Dawnguard and Dragonborn use Version 3, Version 2 for players without this DLC, however both versions will run perfectly fine with or without any of the official DLC\\'s, only difference between the two versions is, labeling system of containers in version 3 includes unique storage places for Weapons and Armor sets that come as part of the Dawnguard and Dragonborn updates.\r\n\r\nVersion 2 Notes:\r\n\r\nAnyone previously who used version 1 and faced the problem of resetting containers resulting in loss of collected items , Version 2 is a complete fix of that discovered bug, the cause was discovered within the properties of the load area its self and since corrected, now nothing goes missing from any of the containers within this basement.\r\n\r\nVersion 1 Notes:\r\n\r\nVersion 1 has been complete removed from Nexus due to the bug found which caused some items to go missing from storage should you not return to the basement at least once every 6 game days, as an example serving game prison time was one way to trigger this effect, Version 2 identifies and corrects this problem, unsafe storage over any game length of time is now no longer an issue.\r\n\r\nMod Description: \r\n\r\nThis Stylish Basement is now complete with a clutter free easy to navigate storage system in place for all your Weapons and Armour and various other items, making this the perfect place to prepare for war.\r\n\r\nThis basement now has the added feature of been accessible from any of the 5 player owned houses within the game, making it easy to travel to the location where you want to be and keep all your belongings easy to find within a single well organised location. This may not be the most extravagant area to store all your items but it is the best organised area and has no know bugs after extensive play testing, even the Mannequins stay in there place.\r\n\r\nBasement includes complete Crafting Area, Enchantment Table, Weapons Racks, Display Cases, Working Mannequins, Complete set of Dragon Priest Mask Statues, Blessing of Talos Shrine, Alchemy, Enchanting and Cooking station, along with tons of storage completely labelled up to suit the needs of any player.\r\n\r\nSo much storage yet still has a very open stylish feel to this Clutter Free design to allow you to organise your items to perfection without breaking any laws of the game, so don\\'t run around all day trying to find your beat weapon to take on your next mission, let this warriors basement help keep you organised so you get get out there and kill some more dragons.",
  "categoryId": "67",
  "version": "3",
  "author": "Killer Shark",
  "createdUnix": "1358371055",
  "updatedUnix": "1361887422",
  "containsAdultContent": false,
  "uploadedBy": "KillerSkark1978",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000002800",
      "name": "KillersWarriorBasement",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "KillersWarriorBasement-30028-2.zip",
      "uploadedUnix": "1358371311",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/9a9aece98683c2e591694fefd4e35450292378dbcd7aae57b1af9c2dcc9fdf73/analysis/1407356984/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KillersWarriorBasement-30028-2.zip?fid=1000002800&ttl=1535804563&ri=8192&rs=8192&setec=e247e69477299d4a7f8d23742705fea2"
    },
    {
      "fileId": "1000013372",
      "name": "Warrior Basement With Dawnguard and Dragonborn enhancements",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "Warrior Basement With Dawnguard and Dragonborn enhancements-30028-3.zip",
      "uploadedUnix": "1361887422",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/ce6935985c75cafb46563cd3f9f78d4e98550bb5a61bf3d5e4739b890cfe1667/analysis/1407440670/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Warrior%20Basement%20With%20Dawnguard%20and%20Dragonborn%20enhancements-30028-3.zip?fid=1000013372&ttl=1535804564&ri=8192&rs=8192&setec=073026eea9cff9a2f30fc18c10c74531"
    }
  ]
}