{
  "modId": 3003.0,
  "modName": "Wild Elf - Heartland High Elf - Ayleid Race",
  "summary": "",
  "descriptionHtml": "This is in it\\'s essence a vanity mod but I do want to stay true to the lore as much as possible as well as not having it be a cheat race or super race. My lore knowledge of the Wild Elves can\\'t be called doctoral by any means but I did do a little research. With that said I accept any and all corrections critiques and opinions. :)\r\n\r\n[size=\\\"5\\\"][b]Spells:[/b][/size]\r\n[list]\r\n[*]Candlelight\r\n[*]Flames\r\n[*]Healing\r\n[*]Sparks\r\n[/list]\r\n\r\n[size=\\\"5\\\"][b]Powers/Greater Powers:[/b][/size]\r\nUndetermined - post your opinions\r\nI\\'m wanting something to do with starlight directly or a natural connection to the plane of Aetherius threw starlight.\r\n\r\n[size=\\\"5\\\"][b]Skill Bonuses:[/b][/size]\r\nAlchemy+5\r\nAlteration+10 (the lore I read suggest the Ayleids created the school of Alteration)\r\nDestruction+5\r\nEnchanting+5\r\nIllusion+5\r\nRestoration+5\r\n\r\n[size=\\\"5\\\"][b]Other Bonuses/Lesser Powers:[/b][/size]\r\n50% Resistance to Disease\r\n15% Resistance to Magicka\r\n\r\n[size=\\\"5\\\"][b]Appearance:[/b][/size]\r\n[b]Skin tones:[/b]\r\nWild Elves are said to have tan, bronze like skin and these are the ones I think would work, but due to only viewing them in certain lighting I\\'m not sure. I would like only the five best.\r\n4 of the High Elves \r\n3&4 of the Wood elves\r\n7, 8, & 10 of the Bretons\r\n7, 8, & 10 of the Imperials\r\n\r\n[b]Eyes: [/b]\r\nThe pure blue eyes of the Khajiit. I\\'m going for an exotic bright blue on tan skin look.\r\n\r\n[b]Hands:[/b] \r\nClaw hand models of the Khajiit and Argonians(no +15 claw damg) but textured to just look like claw like fingernails. \r\nUnarmed first person stance should be that of a khajiit or argonian running (not sprinting). It bothers me that they have a scratch/claw unarmed attack but their stance is that of someone ready to throw a punch with balled up fists.\r\n\r\n[b]Hair:[/b]\r\nInclude all hair styles and facial hair styles, if their are issues with a hairstyle and the high elf head the person using the mod can simply not choose that style or live with the issue.\r\n\r\n[size=\\\"5\\\"][b]Other[/b][/size]\r\nIn all other ways the race should be considered High Elf/Altmer and treated as such by NPCs. This is for ease and in light of the fact that all lore suggests Wild Elves looking extremely similar to Altmer in every respect except their skin, and that most people consider Wild Elves to not even exist as an independent race/society. So the natural intuition would be it\\'s a high elf. *throat clearing noise* plus I don\\'t like being short....",
  "categoryId": "34",
  "version": "0.00",
  "author": "Houston810",
  "createdUnix": "1323330850",
  "updatedUnix": "1323330850",
  "containsAdultContent": false,
  "uploadedBy": "Houston810",
  "primaryFile": null,
  "files": []
}