{
  "modId": 30032.0,
  "modName": "Thalmor Companion Guild",
  "summary": "Wanna side with the Thalmor, in a way you can with this.",
  "descriptionHtml": "Before you continue - this is NOT a mod that enables you to join the Thalmor and have set quests to root out talos worship but does enable you to recruit up to 7 unique comapnions with thier own independant companion system thus fully compatable with companion overhaul mods such as UFO - Ultimate Follower Overhaul.\r\n\r\nYou *can* add yourself to the Thalmor by use of console:\r\n\r\nplayer.addfac 39F26 - \r\n\r\n(Following only works for ElvenElfhaughty of both female and male types - namely Darkelves and High Elves. Works best with high Elf characters.)\r\n\r\nPerks of this is that you sound like a Thalmor when attacking e.eg you say \\\"behold the future! behold the Thalmor\\\" dialogue lines when attacking plus you have extended grunts when attacking.\r\n\r\nCons - Well your a Xenaphobic Elven supremist who has a huge chip on his/her sholder for a certain *Talos* Funny enough Stormcloaks will not attack you unless you provoke them or join a certain faction like Imperial Legion.\r\n\r\nAnyway, go to the Master Altmer found at his desk and speak to him about hiring the Thalmor officers.\r\nThese soldiers are all allied with the Thalmor and thus should sound like Thalmor forces when fighting.\r\n\r\nFind the Guild hall directly infront of the Thalmor Embassy north of Solitude.\r\n\r\nThis mod is completely compaterble with other follower overhaul mods.\r\n\r\nYou can hire all mercs at the same time, they don\\'t add to the normal follower count.\r\nOnce hired, they will follow you and help in battle. You can give the following orders:\r\n\r\n* Wait at the current position\r\n* Wait at the targeted location \r\n* Follow (if waiting)\r\n* Attack an enemy target\r\n* Trade (optional sharing script available)\r\n* Set home base to current location (works for each merc individually)\r\n* Dismiss to the previously marked home\r\n* Push (useful in narrow spaces)\r\n\r\nOriginal Riverwood Mercenary Guild (by Volek)\r\nhttp://skyrim.nexusmods.com/mods/12400\r\n\r\nBIG MAJOR thankyou to Volek for his fantastic Mercenary guild in which I was able to make the basis for ths mod\r\nand many other mods i have made.\r\n\r\nYou have enabled me to make an Army without breaking the vanilla companion system in which you have made a completely seperate one with no limit.\r\n",
  "categoryId": "66",
  "version": "1",
  "author": "volek - adapted by nofear88",
  "createdUnix": "1358377936",
  "updatedUnix": "1358378002",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000002831",
      "name": "Thalmor Guild",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2989",
      "fileName": "halmor Guild-30032-1.rar",
      "uploadedUnix": "1358378002",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/185469b4712a4d32f76c9e2531200e68cea50665b09be7ca0736e6b7e8e262ee/analysis/1407357190/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/halmor%20Guild-30032-1.rar?fid=1000002831&ttl=1535804568&ri=8192&rs=8192&setec=20dfff989e1d83d393f879f4941ff163"
    }
  ]
}