{
  "modId": 30042.0,
  "modName": "Races of Tyrynariele",
  "summary": "Updated, now with 5 races: Snow Elf, Wild Elf, Dwemer, Blood Orc and now Amazon\\'s",
  "descriptionHtml": "[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/Banner_zps8fc2ef37.jpg[/IMG]\r\n\r\n[size=5][b]Version 1.2 is finally out, to see the new features please refer to the changelog.[/b][/size]\r\n\r\nRequires:\r\n[url=\\\"http://skyrim.nexusmods.com/mods/24168\\\"]Racial Compatibilty[/url]\r\nDawnguard\r\nSkyrim update 1.8\r\n\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/AboutThisMod_zpsab0108d3.jpg[/IMG]\r\nTo begin With this mod was intended as a worldspace that would also add new races to the game but as any experienced modder will tell you, putting a worldspace mod together is a lot of work for one person so I took the races that were ready and made it into a standalone mod.\r\n\r\nIt was at this point I started to get ambitious, not being happy with the vanilla race powers I decided to make my own, it was here that I learned a few interesting tricks with scripts so I decided to take it one step further and allow the racial powers to \\\"evolve\\\" at certain levels to give the player a sense of acheivement for their hard work and hopefully make the game feel a little more immersive (I felt that starting the game with a power like \\\"Flame Cloak\\\" which almost any player can get their hands on anyway and then finishing the game with that same power even though you have basically become a 2 legged battle tank level 50+ and with a ton of perks was a little boring).\r\n\r\nWith this in mind I thought wouldn\\'t it be cool if my races powers had \\\"Stages\\\", An example of this would be the Dwemer Race; at level 1 - 26 they have the ability to construct a single Dwarven Spider to aid them in battle, then upon reaching Level 27 up to 53 they are able to build a Sphere instead (as you get higher in levels so do your racial abilties, in a sense) and finally for players level 54+ the can build a Centurion.\r\nC\\'mon, admit it, what good is an Automated Spider when you get that far into the game? :)\r\n\r\nThanks for reading and if you enjoy my mod please leave an endorsment or vote so I know I\\'m doing good work.\r\n\r\n\r\n\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/ChangeLog_zpsacaf2936.jpg[/IMG]\r\n================\r\nver 1.2\r\n================\r\n- Rebalanced powers, again. Now no power should be too strong early in the game.\r\n- Added Amazon race\r\n- Added more Snow ELf presets (Requested by user: GusBus1), I don\\'t actually use presets so never bothered to add any before and I find it a little pointlessly time consuming o there are only 3 males and 3 females (better than none right? :P\r\n- Changed the way racial powers are levelled; your racial power will now automatically update at levels 27 and 54 (means there are 3 stages to every power)\r\n- Done extensive bug fixing and general tidying\r\n\r\n===============\r\nver 1.1\r\n===============\r\n- scaled powers and skills down greatly to be more in tune with vanilla\r\n- changed \\\"Ice Form\\\" power to add spells instead of weapons (power is levelled, remains frost cloak until alterarion reaches lvl 30 then adds armor, at lvl 45 you get left hand ice spike and at lvl 60 you get wall of frost this is stop player being to powerful early on)\r\n- changed \\\"Shadow Skin\\\" power (fllows the same concept as ice form, basic fx + boost to one-handed and sneak until lvl 40 then you unlock a ranged spell and again at lvl 60 you unlock a sword)\r\n- levelled skeletal guard to level up at 1/3 the rate of the player and reach max lvl of 27\r\n- removed the 5 spider workers and replaced them with a single sphere which levels with the player\r\n\r\n\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/Races_zpse1b53a84.jpg[/IMG]\r\n\r\nWild Elves\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/WildElfMaleampFemale_zps95211771.jpg[/IMG]\r\n  Stats:\r\nArchery 5\r\nSneak 5\r\nOne-Handed 10\r\nBlock 5\r\nLight Armor 5\r\nLockpicking 5\r\n\r\nActive Power: Shadow Skin - Gather shadows to yourself with varying effects, from simply muffling your footsteps to transforming into a walking \\\"shadow Warrior, become the ultimate assassin!\r\nPassive Power: 75% Resistance to Poison and Disease, slower magicka regen and much less starting magicka with a -25% weakness to magic (seriously not for mage style players).\r\n\r\nReferring to themselves as \\\"Aylemer\\\". A peculiar hybrid of Ayleid and Bosmer. It is believed they have set up a kingdom in the mystic continent of Tyrynarielé. They are masters of stealth and also make excellent swordsman or archers, their exposure to harsh conditions has increased their resistance to poison and disease, they also can gain a high boost to their primary skills. Due to the unusual nature of their isolation their ability to use magic has greatly diminished.\r\n==============================\r\n\r\nSnow Elves\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/SnowElfMaleampFemale_zps26c3e160.jpg[/IMG]\r\n  Stats:\r\nAlteration 10\r\nDestruction 5\r\nIllusion 5\r\nArchery 5\r\nEnchanting 5\r\nConjuration 5\r\n\r\nActive Power: Ice Form, Coat yourself in ice for both protection and offense.\r\nPassive Power: 75% Frost Resistance -50% weakness to Fire \r\n\r\nAlso sometimes referred to as Falmer though they abhor the title as it serves a reminder for those they call the betrayed, these mer are much more comfortable in the colder regions of Nirn though some have been reported as living in the tropical land of Tyrynarielé. These elves are completely immune to the cold and therefore frost spells too, they can use their Ice Form power once per day to become an ice armored mage dealing damage to any who stand in their way.\r\n=============\r\n\r\nDwemer\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/DeepElfMaleampFemale_zpsd2fd5308.jpg[/IMG]\r\n  Stats:\r\nSmithing 10\r\nTwo-Handed 5\r\nConjuration 5\r\nDestruction 5\r\nHeavy Armor 5\r\nAlchemy 5\r\n\r\nActive Power: Rapidly construct Dwarven Automaton to aid you in combat\r\nPassive Power: Night Eye\r\n\r\nAlso known as \\\"Deep Elves\\\", \\\"Smart Elves\\\" or \\\"Dwarves\\\" the deep elves are the most technologically advanced of all the races though they also make formidable warriors. Thought to have vanished for good, recent sightings and rumors of active cities outside Tamriel have proved otherwise. Time spent underground has adjustted their eyes to the dark much better than other mer and they are able to rapidly construct a sphere to protect them when needed.\r\n===================\r\n\r\nBlood Orcs\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/BloodOrcMaleampFemale_zpsa6ef414a.jpg[/IMG]\r\n  Stats:\r\nConjuration 10\r\nDestruction 5\r\nAlteration 5\r\nAlchemy 5\r\nIllusion 5\r\nEnchanting 5\r\n\r\nActive Power: Summon Skeletal Guard to protect the player from and deal out a variety of attacks\r\nPassive Power: +30% Unarmed -20% Weakness to Poison\r\n\r\nA mutation of the Orsimer, these Orcs have taken on a reddish hue to their skin due to the constant act of cannibalizing the fallen, enemies and comrades, alike in the hope of gaining their power, though they are still Orcs at heart they have become outwardly more sinister and even hated and reviled by their own Orc brethren. They are naturally powerful warriors but Blood Orcs also make very dangerous necromancers.\r\n=========================\r\n\r\nAmazon\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/AmazonMaleampFemale_zps9f6b8b79.jpg[/IMG]\r\n  Stats:\r\nTwo-Handed 10\r\nArchery 5\r\nEnchanting 5\r\nConjuration 5\r\nAlchamy 5\r\nSneak 5\r\n\r\nActive Power: You can use your affinity with the \\\"Phoenix Mountain\\\" to damage enemies with fiery attacks\r\nPassive Power: +70% Resistance to Fire -20% Weakness to Frost\r\n\r\nNative to Tyrynarielé these humans have no true structure or society with each tribe being socially isolated from the next and all revering their chieftain as a king and worshipping the now dormant volcano to the south-west of their lands as a \\\"god\\\". They have a higher resistance to fire than most races and can use that to burn enemies that get to close.\r\n\r\n\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/ComingSoon_zpsc9b7e003.jpg[/IMG]\r\nJul Do Lok (Birdmen)\r\nYes I did change their name, it\\'s dragon language for men \\\"Men Of Sky\\\". I will give you the reason behind this chage when I release them and their supporting lore, no spoilers :)\r\n\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/Installation_zpsda339a56.jpg[/IMG]\r\nSimply download and install via your prefered method (NMM, Manual).\r\nMaking sure that both the esp and bsa are in the data folder and checked in the skyrim launcher.\r\n\r\nIf Updating from a previous version you will need to clean save due to the heavy amount of script changes carried out; here is a brief \\'tut\\' on clean saving for my mod (note: this method is focused on my mod and therefore will not necesarily be relevant to any other mods you have, please refer to individual mods for advice on clean saves).\r\n\r\n1. Enter your game.\r\n2. Open the console (` or ¬ key, next to the 1 button on most keypads) and type: \\\"coc whiterunbreezehome\\\" without quotations, doesn\\'t have to be breezehome just an empty, clutter free cell of your choosing.\r\n3. Open the console again and type \\\"Showracemenu\\\", again, no quotations.\r\n4. Set your race to any of the vanilla Skyrim races.\r\n5. Save your game and quit to desktop.\r\n6. Delete \\\"Tyrynarielé - Races\\\" (Both the .ESP and .BSA)\r\n7. Start Skyrim again and load your save, then save again and quit.\r\n8. You now have a save cleaned of my mod and it\\'s assets.\r\n9. Install Version 1.2 and enjoy :)\r\n\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/Bugs-Issues_zpse13cbe27.jpg[/IMG]\r\n- Hopefully all generic bugs should now be resolved but if you find any please report them, either in the coments or via a PM.\r\n\r\n- Note: When running ENB Injector, Skyrim HD Mod, better faces and FNIS at the same time (For the photoshoot) I had some problems in the race menu (CTD\\'s and freezing) I think that was entirely to do with over straining my system though but as a word to the wise it\\'s better to go to an empty cell to use the race menu (I usually use Breezehome as I never bothered to buy it.\r\n\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/SideNote_zpse5fa6dbf.jpg[/IMG]\r\nThere is the OP version available for download too (View readme for stats and powers)\r\nthese races are much tougher than the vanilla skyrim races, reccomendations; up the difficulty and try Unlevelled World\r\n\r\nPlease do not upload my mod onto steam as I\\'m not ok with their policy on ownership of created content, if you haven\\'t read the terms and conditions on steam yet then you shouldn\\'t be uploading things to them anyway :P\r\nMost other mod sites are fine just ask my permission first and make sure to credit me as the author.\r\n\r\nIf you wish to expand upon this mod or make changes of your own and upload it just check with me first, I\\'ll probably be ok with it. (of course changes for your own gameplay purposes do not matter to me) :)\r\n\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/ModsInScreens_zps51a60eef.jpg[/IMG]\r\n[url=\\\"http://skyrim.nexusmods.com/mods/2488\\\"]Favoured Souls Nude mesh and Younger Faces Merged with Geonox, no beard[/url] (Males)\r\n[url=\\\"http://skyrim.nexusmods.com/mods/2666\\\"]CBBEV2[/url] (For the Ladies)\r\nWarning, the above links contain adult content and are not advisable for younger viewers.\r\n[url=\\\"http://skyrim.nexusmods.com/mods/10168\\\"]ApachiSkyHair[/url]\r\n[url=\\\"http://skyrim.nexusmods.com/mods/607\\\"]Skyrim HD[/url] Lite version\r\nFor the armors and weapons you see in the screens that are not vanilla they came from the followers added by [url=\\\"http://skyrim.nexusmods.com/mods/24664\\\"]Mayatola\\'s Unique Female Followers[/url] and the armor for the male Dwemer is out of [url=\\\"http://skyrim.nexusmods.com/mods/19733\\\"]Immersive Armors[/url] most of the weapons are added by [url=\\\"http://skyrim.nexusmods.com/mods/27644\\\"]Immersive Weapons[/url] or part of the vanilla. All three are very great mods and you should definitely check them out if you haven\\'t already.\r\nAnd finally\r\n[url=\\\"http://skyrim.nexusmods.com/mods/30158\\\"]K ENB[/url]\r\n\r\n\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/Credits_zps54201d52.jpg[/IMG]\r\nMe :P\r\n&\r\nTheJewpacabro (my partner in crime, whom with the input of all his interesting ideas and knowledge of TES lore helped me to evolve this mod and the worldspace from being just ideas floating in my imagination) \r\n\r\n[IMG]http://i1283.photobucket.com/albums/a550/Shoneah_Tokala/SpecialThanks_zps36bdf243.jpg[/IMG]\r\nSjogga and Phenderix for all their help with the various scripts, without them this mod wouldn\\'t be what it is.\r\nExpired6978 for his tutorial on creating playable races.\r\nTMPPhoenix for the racial compatibility mod, without which none of this would be possible.\r\nBethesda for such a great game.\r\nand\r\nYou for being such a useful and friendly community.",
  "categoryId": "34",
  "version": "1.2",
  "author": "Shoneah0Tokala",
  "createdUnix": "1358395503",
  "updatedUnix": "1362192996",
  "containsAdultContent": true,
  "uploadedBy": "Shoneah0Tokala",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000002874",
      "name": "Races Of Tyrynariele",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "76",
      "fileName": "Races Of Tyrynariele-30042-1-0.rar",
      "uploadedUnix": "1358396108",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5fc8275631854bc7e8e2e40a36ff874fd746f1cd33737bb50a87d38c5d911969/analysis/1407357544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Races%20Of%20Tyrynariele-30042-1-0.rar?fid=1000002874&ttl=1535804585&ri=8192&rs=8192&setec=d50dc96f96c65655f72cd2253104ece0"
    },
    {
      "fileId": "1000003595",
      "name": "Races Of Tyrynariele 1-1a",
      "version": "1.1a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "118",
      "fileName": "Races Of Tyrynariele 1-1a-30042-1-1a.rar",
      "uploadedUnix": "1358652203",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/d641485c15db93cf5a19cc45876cb56e23041babe9696d9916248f64c1a9ea4a/analysis/1407362285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Races%20Of%20Tyrynariele%201-1a-30042-1-1a.rar?fid=1000003595&ttl=1535804586&ri=8192&rs=8192&setec=e1516a9aafe09bf31d7d0b1df436a059"
    },
    {
      "fileId": "1000005644",
      "name": "Races Of Tyrynariele 1-1b",
      "version": "1.1b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "121",
      "fileName": "Races Of Tyrynariele 1-1b-30042-1-1b.rar",
      "uploadedUnix": "1359429296",
      "modVersion": "1.1b",
      "virusScanUrl": "https://www.virustotal.com/file/5a06ed05862da067d799b458eeab18790787742e52d4186a4a8e567be66a42d7/analysis/1407384963/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Races%20Of%20Tyrynariele%201-1b-30042-1-1b.rar?fid=1000005644&ttl=1535804586&ri=8192&rs=8192&setec=759e57cc73781a0937bd5959312693d9"
    },
    {
      "fileId": "1000014305",
      "name": "Races Of Tyrynariele 1-2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1958",
      "fileName": "Races Of Tyrynariele 1-2-30042-1-2.rar",
      "uploadedUnix": "1362192996",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/a8ecb9b87afeddc5d4e4895d0418f146a46bebce95ab5677793bc2a77c54b3cb/analysis/1407447139/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Races%20Of%20Tyrynariele%201-2-30042-1-2.rar?fid=1000014305&ttl=1535804587&ri=8192&rs=8192&setec=241aa25ead241332d0f4dcadb5e76e40"
    }
  ]
}