{
  "modId": 30040.0,
  "modName": "Mystanic Castle BETA - DELETED",
  "summary": "Mystanic Castle is a mod that adds a new fully fledged player home to a new world. You can travel to an ancient portal on a mountaintop near Riften, which leads to an ancient castle surrounded by it’s town, cast adrift to the Plane of Oblivion by the gods, fearing it’s rising power from ancient times. Feel free to just reside in your new abando",
  "descriptionHtml": "[center][img]https://lh6.googleusercontent.com/-l3bUFFgkPWQ/UR7fQdAKa_I/AAAAAAAABGM/jdIf5T3LRyw/s500/SC11small.jpg[/img][/center]\r\n[line]\r\n[img] https://lh6.googleusercontent.com/-6Th84Uo0fuY/UPdw0K0ODnI/AAAAAAAAAxE/-EPp3XF7Uro/s850/BlackSwordDescriptionTitle.png [/img]\r\n[line]\r\nMystanic Castle is a mod that adds a new fully fledged player home to a new world. You can travel to an ancient portal on a mountaintop near Riften, which leads to an ancient castle surrounded by it’s town, cast adrift to the Plane of Oblivion by the gods, fearing it’s rising power from ancient times. Feel free to just reside in your new abandoned castle or explore the ancient city, or read up on tall tales of the ancient lore told by nords across Skyrim. If you would like to know more, be sure to read up on the lore books in the Castle Debate Hall.\r\n[line]\r\n[img]https://lh5.googleusercontent.com/-muuulUpCOO8/UPdwz-hi-KI/AAAAAAAAAxA/j4IckQhjvvs/s850/BlackSwordContentTitle.png [/img]\r\n[line]\r\n[b][i]Mystanic Castle[/i][/b] offers many new features. The city of Molsteim was built around the castle, adding many explorable structures. Need a tune-up? Head down to a lodge, or a castle hall to find a trainer. Need some good, Head down to one of the Farmers or smiths. Need a place to store your heavy goods? Check out the Castle Quarters. Feeling like Skyrim was a little light on their magic? Head into the library to find shelves and shelves of spell tomes created by the magnificent mages who once lived there, such as the new conjurable creatures tomes, like Summon Troll, Summon Draugr, Summon Mammoth, Summon Skeever, and a whole lot more. Hate having to travel to the portal and run to the castle just to store your goods? No problem, once in the spell section of the library, you’ll see teleportation spells, for all major cities and the Mystanic Castle, and once traveled to the Castle, you can head to the left side of the Debate Hall, and find Teleportation Stones leading to the different rooms in the Castle. Feel like there’s not enough action? Head to the Armory, from there, you find an old entrance to an underground dungeon. Once you fight your way through all of the traps and puzzles with your Kro Zin’s Bane Sword, you can finally reach the Kro Zin Forest, it’s mystery waiting to be revealed by you!\r\n\r\n[heading]AUTHOR NOTES:[/heading]\r\n[list]\r\n[*]The Sabre Cat Followers are all linked to one NPC, not separate, you can only have one following you. One will follow you, but you can access his inventory through any other Sabre Cat, but only the one you activated will continue to follow you until you tell him to leave, where he will return to the spot where you found him.\r\n[/list]\r\n[heading]INCOMPATIBILITY LIST:[/heading]\r\n[list]\r\n[*] None Yet.\r\n[/list]\r\n\r\n[heading]KNOWN BUGS:[/heading]\r\n[list]\r\n[*] Navmesh is only partially complete, your follower won’t follow you everywhere, don’t lose him/her!\r\n[*] (SHOWN ABOVE IN NOTES) The Sabre Cat Followers are all linked to one NPC, not separate, you can only have one following you. One will follow you, but you can access his inventory through any other Sabre Cat, but only the one you activated will continue to follow you until you tell him to leave, where he will return to the spot where you found him.\r\n[/list]\r\n\r\n[line]\r\n\r\nTo fast travel to a specific room, either use the teleport stones in the Main Hall, or enter the following codes into the command prompt depending on which room you want to go to.\r\n\r\nA Text Map of the Castle:\r\n- Mystanic Castle (Debate Hall) ‘coc AAAMystanicCastle01’\r\n-> Castle Quarters ‘coc AAACastleQuarters’\r\n-> Castle Library ‘coc AAACastleLibrary’\r\n--> Castle Throne Room ‘coc AAACastleThroneRoom\r\n--> Castle Dungeon ‘coc AAACastleJail’\r\n--> Castle Armory ‘coc AAACastleArmory’\r\n---> Kro Zin Antechamber ‘coc AAACastleDungeon01’\r\n----> Kro Zin Forest ‘coc KroZinForest’ (May or May Not Work.)\r\n[line]\r\n[img] https://lh6.googleusercontent.com/-EMNRS5kd0Fo/UPdw1IQ2PDI/AAAAAAAAAxU/UG-sRCiBc8M/s850/BlackSwordUpdateTitle.png [/img]\r\n[line]\r\n\r\n[heading][color=#FFD564]V.1 (Version 1.0) Includes:[i] Published February 10th, 2013 (02/10/2013) [/i][/color][/heading]\r\n[list]\r\n[*] Main Mod Features\r\n[/list]\r\n[line]\r\n[img] https://lh3.googleusercontent.com/-QvIk3F5zsiI/UPdw0N1bW7I/AAAAAAAAAxI/D1BsnVlpYKI/s850/BlackSwordCreditTitle.png [/img]\r\n[line]\r\n[list]\r\n[*] Thank You Bethesda for creating this wonderful game.\r\n[*] Thank You [url=http://www.youtube.com/user/DARKF0X127/featured] DarkFox127 [/url] for your amazing tutorials and help in navmeshing the mod. This wouldn’t exist without you.\r\n[*] Thank You [url=http://skyrim.nexusmods.com/users/1758072]Twallace267[/url]/[url=http://www.youtube.com/user/MrBiggenGaming/videos?view=0]MrBiggenGaming[/url] for massive input on design, BETA testing, and video reviews. This mod would be terrible without your help.\r\n[*] Thank You [url=http://skyrim.nexusmods.com/users/5990037] ninjastates [/url] for BETA Testing & input.\r\n[*] Thank You [url=http://steamcommunity.com/profiles/76561198024075207] Istronen [/url] from Steam for you BETA Testing & Input on design.\r\n[/list]\r\n\r\n[heading]Programs Used:[/heading]\r\n[list]\r\n[*] Creation Kit\r\n[*] Gimp 2.0\r\n[*] Nifskope\r\n[*] Misc: BSA Browser\r\n[/list]\r\n\r\n[line]\r\n[img] https://lh6.googleusercontent.com/-xcWIKxNIkH8/UPdw0iOcD6I/AAAAAAAAAxQ/nM8LBrm_qbQ/s850/BlackSwordRecommendedTitle.png [/img]\r\n[line]\r\n[list]\r\n[*] [url=http://skyrim.nexusmods.com/mods/7484] Sexy Winterhold College by horrorview (Highly Recommended)[/url]\r\n[*] [url=http://skyrim.nexusmods.com/mods/30084] Snowless College of Winterhold by DMCThunder999 (Me) [/url]\r\n[*] [url=http://skyrim.nexusmods.com/mods/30384/] Darker College of Winterhold by DMCThunder999 (Me)[/url]\r\n[/list]\r\n[line]\r\n[youtube]jlWlA-hN63s[/youtube]\r\n[line]\r\n[img]https://lh4.googleusercontent.com/-Wk1n9CqCdLA/UPdw0ebnQ5I/AAAAAAAAAxM/RwpgKQs9MtY/s850/BlackSwordMoreMeTitle.png[/img]\r\n[line]\r\n[center][url=http://skyrim.nexusmods.com/users/4673477][img]https://lh5.googleusercontent.com/-NiGSorXnocI/UNzeCRQLV5I/AAAAAAAAAno/C7Vkzv2vGdc/s250/DMC-O-Small-250px.png[/img][/url][/center]\r\n\r\n[line]\r\n\r\n[center][img]https://lh3.googleusercontent.com/-s2qNEDCn4mo/UNzj-pNYEAI/AAAAAAAAAo4/m34KKqctedk/s800/dmcline.png[/img][/center]\r\n",
  "categoryId": "67",
  "version": "BETA.V.1",
  "author": "dmcthunder999",
  "createdUnix": "1358386438",
  "updatedUnix": "1358386438",
  "containsAdultContent": false,
  "uploadedBy": "dmcthunder999",
  "primaryFile": null,
  "files": []
}