{
  "modId": 30062.0,
  "modName": "Dwemer Beards",
  "summary": "Fifteen 'Dwemer-style' beards made in Creation Kit/Nifskope.",
  "descriptionHtml": "[size=6]Description[/size]\n<br />[img]http://imageshack.us/a/img189/8901/dwemerbeardsdescription.png[/img]Being a fan of Dwemeri fashion, I've been keeping an eye on Dwemer race mods but I've always been disappointed with the lack of Dwemer-style beards. Sadly I didn't know how to actually model beards and my attempts to follow online tutorials for creating things in Blender often ended in utter failure. [s]So until such time as someone with the skills to do so decides to spend some time making Ancient Mesopotamian-style beards I've made these. It's basically a best fit compromise that uses 'Extra Parts' found in the HeadPart section of the Creation Kit. I've edited their positioning in NifSkope and put them together to create a number of Dwemer-themed beards.[/s]\n<br />\n<br />Sadly nobody took a hint and actually made new beards (that I know of) so I’m teaching myself how to make them instead and, with the help and advice of a few other kind modders along the way, started creating some new meshes in preparation for 1.0. Sincere thanks and homage shall go to all the people (that I remember off hand) mentioned in the \"special thanks\" section below, and to all others who have been an inspiration along the way. Particularly to all you loyal subscribers and followers and worshippers. To quote a certain Red King, “I do this for you, Red Legions, for I love you”. But I’d have loved you more if you were blue.\n<br />\n<br />[b]What's currently included: [/b]\n<br />15 New Beard Styles - See screenshots\n<br />\n<br />I've tried to find a balance between preventing the beards clipping with armour - specifically Dwarven Armor - and not having them look immensely stupid when only wearing light armour or clothing. They will clip very slightly with the armour when the character turns or talks but it's barely noticeable. Besides, even the default beards in game clip in places. I haven't checked the beards on NPCs, only the basic version so I can't be sure how they work. I await reports of any mischief.\n<br />\n<br />[img]http://imageshack.us/a/img856/8601/dwemerbeardsupdateshead.png[/img]\n<br />[size=6]Updates[/size]\n<br />Greetings and salutations.\n<br />\n<br />It’s been a while. Life has a way of crushing the soul, if you let it. I’m assuming since you’re here that you’re all interested in new beard meshes and updates for SSE so I’ll get right to what my plans are for the next update. There is no ETA. I’ve learned my lesson.\n<br />\n<br />To begin, I've received a LOT of requests for an update for [b]Skyrim Special Edition. [/b]This [b]will not[/b] be happening any time soon. I do plan to do it, but I've got so much other stuff on my plate that I can't find the time or the inclination to do so. When Vortex is released and SKSE64 is relatively stable, I'll likely find my interest in playing SSE will get a major boost. A whole load of other modders have asked permission to port it over and I've had mixed reports. More accurately, I've had reports of failure and no reports of success. If someone did manage it, good on them. I'll still attempt my own update though.\n<br />\n<br />If I do update, expect a major overhaul. I’m leaning towards uploading the next version in increments, one or more beards at a time, rather than all at once in a finished package. The reason for this is that a lot of work goes into making just one new facial hair when the creator is someone with limited experience in using Blender and the various other programs involved. The absolute worst issue is dealing with the tri-files as some of you may know. These need to be made for every race so that the beards fit the face. A new mesh might work well with a Nord but then mangle itself terribly with an Altmer. Since I tend to play as a High Elf, this is not acceptable.\n<br />\n<br />Please note, I will be scrapping the beards we have so far. These are basically just things I threw together for personal use and were always just placeholders until someone better came along and made proper beards. This means that if you download the update,  it will affect your current character's facial hair if you have one of the old beards and you are not starting a new game. \n<br />\n<br />That’s all for now, acolytes. Keep focusing on the Fixed Center and that tasty seed of stasis.\n<br />\n<br />[b]- Anuiel[/b]\n<br />\n<br />[img]http://imageshack.us/a/img812/8993/dwemerbeardscompatibili.png[/img]\n<br />[size=6]Compatibility[/size]\n<br />The beards should be compatible with pretty much everything. Yes, this does include beards by Hvergelmir, so please stop asking. I use that mod too. They will work with custom race mods but I cannot vouch for how they'll look since it depends on the race mod you use. I've only tried them on the Dwarven race from The True Dwemer (http://www.nexusmods.com/skyrim/mods/52491) mod. They will appear for use in the race menu for all races except Argonians or races they wouldn’t naturally belong to or fit on.\n<br />\n<br />[img]http://imageshack.us/a/img827/7031/dwemerbeardsinstallhead.png[/img]\n<br />[size=6]Installation[/size]\n<br />Please use a mod manager of your choice to install and uninstall this mod. I use and highly recommend [url=http://www.nexusmods.com/skyrim/mods/1334]Mod Organizer[/url] but I'm sure NMM and Wrye Bash will be fine.\n<br />\n<br />[b]~Instructions for manual installation~[/b]\n<br />\n<br />1. If you have an older version, remove the old meshes by deleting the 'Dwarven' folder found in Data/Meshes/Actor/Character/CharacterAssets/Beards.\n<br />\n<br />2. Copy everything from my mod into the Data folder as usual and overwrite Dwemer Beards.esp.\n<br />\n<br />[img]http://imageshack.us/a/img844/1810/dwemerbeardsuninstallhe.png[/img]\n<br />[size=6]Uninstalling[/size]\n<br />Either uninstall via your mod manager or delete both 'Dwemer Beards.esp' and the 'Dwarven' folder found in Data/Meshes/Actor/Character/CharacterAssets/Beards.\n<br />[size=6]\n<br />F.A.Q.[/size]\n<br />[b]What races do these beards work with?[/b]\n<br />Currently Breton, Nord, Imperial, Redguard, Orc, Bosmer, Altmer, Dunmer, Custom Races; in future, Khajiit.\n<br />\n<br />[b]Can you make \"X-style\" of beard?[/b]\n<br />Let me know and I’ll see if it’s possible but I promise NOTHING.\n<br />[b]\n<br />Can you make these beards playable for women?[/b]\n<br />I think this would require new tri-files to fit the female head mesh and it goes beyond my remit so unfortunately no. The fewer tri-files I deal with, the better.\n<br />[b]\n<br />These beards make my characters look too effeminate![/b]\n<br />Yes, this was a complaint from one strange person. If you don’t like effeminate men I hear there aren’t any on Mars. You might try it out sometime. Without an oxygen tank.\n<br />\n<br />[b]Why do you not respond to my messages?[/b]\n<br />Unfortunately, I don't get to check here very often. Rest assured, I am merely busy living life as a monk of Phynaster in the far, far hills of Aldmeris Found.\n<br />\n<br />[img]http://imageshack.us/a/img7/1564/dwemerbeardsrelatedhead.png[/img]\n<br />\n<br />[url=http://skyrim.nexusmods.com/mods/24913]Skyrim Immersive Creatures by lifestorock[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/29754]Dwarf Race - WARHAMMER by GPM26[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/32751]CotH Drizzt Wulfgar Catti-brie Bruenor Regis by Gamebryo and AverageJustin[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/34252]Dwarven Pride by Adolon[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/52491/]Deep Elf Race - The True Dwemer\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/63022/?]Dwemer Spectres\n<br />[/url]\n<br />\n<br />[b]Special Thanks\n<br />[/b]*to be added soon*",
  "categoryId": "26",
  "version": "0.8",
  "author": "Anuiel",
  "createdUnix": "1358442096",
  "updatedUnix": "1370198740",
  "containsAdultContent": false,
  "uploadedBy": "Anuiel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032534",
      "name": "Dwemer Beards",
      "version": "0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1316",
      "fileName": "Dwemer Beards-30062-0-8.zip",
      "uploadedUnix": "1370198740",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/4bf7002a2a9c1c8d277b62414f63cbffc3a566c1f982efabac2e7704d3fc17f9/analysis/1407589990/",
      "changelogHtml": " Improvements to Morrowind-style beards <br/> \n Added 7 new beards <br/> \n Removed old &#39;Full Beard&#39; left over from 0.1 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer%20Beards-30062-0-8.zip?fid=1000032534&ttl=1535804620&ri=8192&rs=8192&setec=15451e8aac0e10cc0244fa33977493e4"
    }
  ]
}