{
  "modId": 30073.0,
  "modName": "Immersive Potions",
  "summary": "Modifies all instant restoration potions to heal over time and makes them non-stackable. If a new potion with the same effect (heal, stamina or magicka restoration) is used, it will overwrite the current potion. There are a couple of mods with the same features, but this one is unique in several aspects. Totally script-free 7kb download.",
  "descriptionHtml": "[size=3][b][url=http://skyrimgems.com/][img]http://skyrimgems.com/images/badge_featured.png[/img][/url][size=4]\r<br />\r<br />[font=Arial]A spotlight covering the basics of Immersive Potions:[/font][/size][/b][/size]\r<br />\r<br />\r<br />[youtube]ULYnJgowQsE[/youtube]\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][b][u]QUICK OVERVIEW[/u][/b][/size]\r<br />\r<br />[size=3][b]1)[/b] All instant restoration potions (Health, Stamina and Magicka) now work over a five second duration with scaled magnitude (whether crafted, found or bought). Unlike most mods, this mod also modifies rare instant restoration potions like Thief guild potions or potions from quests.\r<br />\r<br />\r<br />[b]2)[/b] All similar duration based restoration effects now overwrites the current one in use. If you use more than one potion that will simply overwrite the current effect (no matter what magnitude). [i]This is not featured by any other alchemy mod&#33;[/i]\r<br />\r<br />\r<br />[b]3)[/b] Alchemy ingredients with instant restoration effects have been changed to match the new duration potions. This change is needed, otherwise alchemy would create instant restoration potions.\r<br />\r<br />\r<br />[b]4)[/b] Unlike other mods that apply duration effects to potions, this mod separates alcohol from potions and make them display the proper effects. [i]This is not featured by any other alchemy mod&#33;[/i]\r<br />\r<br />\r<br />[b]5)[/b] Additional bug fixes related to duration based restoration and ingredients, overlooked by all other similar mods. [i]Read below for details&#33;[/i]\r<br />\r<br />\r<br />[i]Note: This mod does not change the value, weight or anything else regarding potions, alcohol or food - for maximum compatibility. It will also work perfectly with alot of other alchemy overhauls if loaded after, and was partially designed for this purpose.[/i][/size]\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][b][u]INTRODUCTION[/u][/b][/size]\r<br />[size=3]\r<br />The purpose of this mod is to make potion usage more tactical and make Skyrim more challenging and immersive. It doesn&#39;t matter what difficulty you play on or how close you are to dying, if you can instantly heal yourself in any hard battle. Alas, no longer can you open up the menu near death and click a few times to be fully restored, all potions now have a duration and do not stack. The concept of this mod is not unique, however all other mods that I have been able to track down contain bugs, doesn&#39;t make changes to alchemy ingredients, doesn&#39;t overlap new potions to extend the duration etc. In fact most of them overlook a number of details.\r<br />\r<br />[u][b]This mod has no negative secondary effects like altering the value of potions would have on alchemy skill gain for example. Furthermore it uses no scripts, has no &#34;dirty&#34; edits, does not contain bugs. In fact it&#39;s quite perfect and simple. It will work with mods like Realistic Needs or Skyrim Unleashed (for example) or other mods which also changes food, alcohol and alchemy.[/b][/u]\r<br />\r<br />Immersive Potions does however have [i][b]several positive secondary effects[/b][/i]. Food is much more significant and useful now, since food is left unmodified it is now the only thing that gives you direct restoration (except magic), giving you a motivation not only to hunt, but to cook as well. This eliminates the need to use food overhauls, that tends to make food overpowered (but if you use one there will be no conflicts with Immersive Potions). Another positive effect is that Stamina potions can be put to some good use now (how many of you stocked up on Stamina potions when you could carry more Healing potions instead, which used to be much more effective?). Since Stamina recovers for 5 seconds, you can get two- maybe three extra power attacks even from a Minor potion if you do them fast. Effectively making them as powerful as the equivalent Healing or Magicka potions&#33;[/size]\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][b][u]DETAILED MODIFICATIONS[/u][/b][/size]\r<br />\r<br />[size=3][b]1)[/b] All restoration potions (Health, Stamina and Magicka) now work for 5 seconds with scaled magnitude. For example:\r<br />\r<br />Potion of Minor Healing restores 5 points of Health per second for 5 seconds.\r<br />Potion of Plentiful Stamina restores 15 points of Stamina per second for 5 seconds.\r<br />Potion of Extreme Magicka restores 30 points of Magicka per second for 5 seconds.\r<br />Potion of Ultimate Healing restores 100 points of Health per second for 5 seconds.\r<br />\r<br />[i]Note: I have also made changes to other instant restoration potions overlooked by most mods, for example all Thief guild potions and special quest potions are modified to display the correct values. Patches are availible to fix all potions and ingredients added by DLC&#39;s as well&#33;[/i]\r<br />\r<br />\r<br />[b]2)[/b] All similar duration based restoration effects now overwrites the current one in use. If you use several similar potions only one of them will have any effect. For example if you use one Healing potion and three seconds later use another Healing potion you will be restored for additionally five seconds (The new potion will overwrite the last one). So unlike most mods like this one you can now drink a potion in combat and drink another one after a few seconds just to be sure your restoration effect doesn&#39;t end suddenly. Very useful for stressful situations.\r<br />\r<br />[i]Note: You can have only 1 Heal-, 1 Stamina- and 1 Magicka restoration effect active from potions at the same time, the type of potion does not matter. Drinking 1 Ultimate Potion and 1 Minor Potion shortly thereafter will cancel the Ultimate effect and apply the Minor one. (This mod does not affect magic healing in any way).[/i]\r<br />\r<br />\r<br />[b]3)[/b] Alchemy crafting ingredients have been changed to match the new duration potions. All crafting materials that uses restoration effects have had their magnitude divided by 5, and a duration extended by 5. Very simple and alchemy scales exactly the same way as usual with perks and skill levels. The crafted restoration potions will be worth exactly as much as  the equivalent &#34;vanilla&#34; potions. For example at level 15 alchemy you can craft a Potion of Minor that restores 4 points per second for 5 seconds. At level 100 alchemy and all the perks you can craft a Potion of Plentiful which restores 15 points per second for 5 seconds.\r<br />\r<br />\r<br />[b]4)[/b] Alcohol beverages uses the same magic effect as normal restoration potions. This is why most of the mods out there which are similar to this one will show &#34;Wine: Restore 15 stamina points each second for 0 seconds&#34;. I have moved their magic effects away from alchemy to food (where they belong&#33;) so the duration effects does no longer apply to any other item than potions.\r<br />\r<br />[i]Note: Don&#39;t worry&#33; This will not cause compatibility issues with other mods that modifies alcohol because any mod that changes alcohol like Realistic Needs for example will overwrite my alcohol changes.[/i]\r<br />\r<br />\r<br />[b]5)[/b] This mod also applies changes to the magic effect used by food. It is no longer possible to stack the restoration effect over time from food. For example, without this mod you could eat 10 Vegetable Soups and be restored for 10 health every second for several minutes, clearly a bug&#33; Now if you eat more than one Vegetable Soup (or any other food that regenerates over time) the effect will be overwritten and the duration will start over again.\r<br />\r<br />[i]Note: Don&#39;t worry&#33; This will not cause compatibility issues because I have only changed the magic effect, not the food itself. So this will actually not conflict with any other mod. Food and potions do not affect each other, so it is possible to eat a Vegetable Soup - and use any potions just like usually.[/i]\r<br />\r<br />Another important aspect of altering ingredients is a &#34;vanilla&#34; bug related to vendorlists. In short many ingredients in &#34;vanilla&#34; Skyrim can&#39;t be purchased or sold to alchemy merchants - this bug was fixed by &#34;The Unofficial Skyrim Patch&#34; a long time ago. Other alchemy mods overwrite this bug fix however. I have integrated this fix alongside the other changes related to ingredients to eliminate this problem&#33; This mod also contains a number of other bug fixes so that it can safely overwrite USKP.[/size]\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][b][u]REQUIREMENTS[/u][/b][/size]\r<br />\r<br />[size=3]The current version of Immersive Potions covers Hearthfire, Dawnguard and Dragonborn. Currently it is only possible to use Immersive Potions if you have all the DLC&#39;s.[/size]\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][b][u]COMPATIBILITY[/u][/b][/size]\r<br />\r<br />[size=3]* You can obviously not load another alchemy mod that alters these restoration potions after this mod - but it is possible and recommended for those that use another more complex alchemy overhaul to overwrite that mod since this mod ONLY modifies instant restoration potions and ingredients - as well as fixes alot of other details overlooked by your average alchemy mod. However if you use custom perks related to restoration potions they might not work depending on how they are constructed - the Perk Benefactor had to be changed to match the new magical effects for example. Feel free to load other food or alcohol mods after this mod&#33;\r<br />\r<br />\r<br />* What about mods that adds ingredients? Well, if any of those ingredients have Restore Health, Restore Stamina or Restore Magicka effects - they will make &#34;Restore x points each second for 0 seconds&#34; potions = instant restoration. Additionally - if you combine these ingredients with &#34;vanilla&#34; ingredients - they will make, for example, a Minor Healing Potion that has the vanilla magnitude and Immersive Potion duration&#33; In other words the Minor Healing Potion will restore 25 health each second for 5 seconds. A total of 125 health&#33;\r<br />\r<br />\r<br />* All bug fixes related to potions, ingredients and alcohol that this mod alters has been fixed in line with USKP, so you can safely load this mod after USKP without overwriting any bug fixes.\r<br />\r<br />\r<br />* This mod will conflict with Better Sorting - however if you use that I bet you are used to conflicts.\r<br />\r<br />\r<br />* What about mods that alter the weight of potions and ingredients? Two things can happen; Scenario 1; if that mod is loaded before this mod some of the weight changes will be overwritten. Scenario 2; if a weight mod is loaded after it will most likely overwrite this mod (and render it useless).\r<br />\r<br />\r<br />* The modifications to the magic effect of duration based restorative food will not affect other food mods since it is a modification of a magic effect. So all food mods should be compatible.\r<br />\r<br />\r<br />\r<br />[b][u][size=5]RECOMMENDED TO USE WITH\r<br />\r<br />[/size][/u][/b][size=3][url=http://www.nexusmods.com/skyrim/mods/61922?][b]Realistic Movement Speed Reduction[/b][/url] - [/size]This mod aims to bring backwards- and sideways running movement speed closer together and reach more realistic levels. This mod slows the backwards movement speed by roughly 15 % - but the sideways and sidestepping movement speed is reduced by 33 %. It also reduces movement during combat to more realistic levels&#33;\r<br />\r<br />\r<br />\r<br />\r<br />[b][i]I hope that you will enjoy Immersive Potions&#33; Feel free to ask anything if you have any questions&#33;[/i][/b][/size]",
  "categoryId": "94",
  "version": "FINAL",
  "author": "Nastakanoth",
  "createdUnix": "1358457585",
  "updatedUnix": "1421171497",
  "containsAdultContent": false,
  "uploadedBy": "nastakanoth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000142684",
      "name": "Immersive Potions for all DLC&#39;s",
      "version": "FINAL",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Immersive Potions for all DLC's-30073-.rar",
      "uploadedUnix": "1421171497",
      "modVersion": "FINAL",
      "virusScanUrl": "https://www.virustotal.com/file/19cfb94df30e5cdbf5c9d55c84cf4c5e8e72e0566f701641025467ab73997e62/analysis/1421171522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Potions%20for%20all%20DLC%27s-30073-.rar?fid=1000142684&ttl=1535804638&ri=8192&rs=8192&setec=d1ef3c6ed239193487c19fb549d43a1a"
    }
  ]
}