{
  "modId": 30115.0,
  "modName": "Jarrin Root For Sale - Rarely",
  "summary": "Adds Jarrin Root as an item to apothecary inventories.  It will be rare and expensive.",
  "descriptionHtml": "Jarrin Root For Sale...Rarely\r\n-----------------------------------\r\n\r\nDescription:\r\nAdds Jarrin Root as an item to apothecary inventories.  It will be rare and expensive.  Now with an option to also increase the number and variety of standard ingredients for sale.\r\n\r\nReason for mod:\r\nI never really thought poisons were strong enough in vanilla Skyrim.  The strongest one you find or purchase does a whopping 65 points of damage, which is too weak when you\\'re a high enough level for it to spawn.  If you\\'re a master alchemist you should be able to whip up something that does massive damage, even if it is  exceedingly rare that you would have the ingredients to do so.  And doing so SHOULD be a rare occurrance.\r\n\r\nWith that in mind, I like the idea of characters having access to more than just the one Jarrin Root that is given to them during the Dark Brotherhood questline.  It is described in TES lore as being a rare plant unique to the island of Stros M\\'Kai off the southern coast of Hammerfell.  Other mods have made it appear in placed satchels, as harvestable plants, or in abundance in barrels/vendor stock but those seem like they go against the description of the plant.  It does, however, seem to me that samples could make it to Skyrim every once in a while and become available at an extremely high cost.  This mod makes that a reality.\r\n\r\nDetails:\r\nThere is a very slight (5%) chance that an apothecary will have a Jarrin Root for sale.  One in particular has an additional 5% chance to have a second one.  The apothecaries impacted are listed below.  Also, the value of the Jarrin Root has been increased to account for the rarity, so even if you see it in stock you might not be able to afford it...particularly in the early game.  The combination of high cost and rarity should cause any poisons created with it to be used sparingly and only under special, most likely dire, circumstances.\r\n\r\nVendors:\r\n * Angeline\\'s Aromatics\r\n * Arcadia\\'s Cauldron\r\n * Elgrim\\'s Elixirs\r\n * The Hag\\'s Cure\r\n * The White Phial\r\n * Grave Concoctions\r\n * Thaumaturgist\\'s Hut\r\n * The Mortar and Pestle\r\n * Atub (Largashbur) --- NOTE: Set as Apothecary vendor by Unofficial Skyrim Patch v.1.2.5 (not personally confirmed)\r\n * Bolar (Narzulbur)\r\n * Murbul (Dushnikh Yal)\r\n * Sharamph (Mor Khazgur)\r\n * Herluin Lothaire (The Ragged Flagon)\r\n * Heljarchen Apothecary --- NOTE: Not utilized in vanilla...possibly by Hearthfire?  I do not own it to check.\r\n * Babette (Dark Brotherhood)\r\n * Spouse Apothecary\r\n\r\n\r\nFiles:\r\nThe main file (Jarrin Root Only) contains only the addition of Jarrin Root as a very rare and expensive item in Apothecary inventories.\r\nThe optional file (Jarrin Root with Apothecary Inventory Rebuild) includes an additional overhaul to Apothecary inventories based on another of my mods (http://skyrim.nexusmods.com/mods/30483).  \r\n\r\nOptions:\r\n - If you want to use just the addition of Jarrin Root to Apothecary inventories, use only the MAIN file of this mod.\r\n - If you want to use both the addition of Jarrin Root to Apothecary inventories and the bigger overhaul included in Apothecary Inventory Rebuild, use EITHER the OPTIONAL file of this mod OR the OPTIONAL file of that mod.  Do not use files from both mods!\r\n - If you want to use just the bigger overhaul included in Apothecary Inventory Rebuild, use the MAIN file of that mod.\r\n\r\nInstall:\r\nExtract the .esp file to your Skyrim Data folder (typically C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\Skyrim\\\\Data) and enable it in a way appropriate for the mod manager of your choice.  I use NMM and that means I just have to check the box next to the file in the plugins tab.\r\n\r\nUninstall:\r\nDelete the .esp file.\r\n\r\nConflicts:\r\nThe main file of this mod changes the Jarrin Root in game and also the merchant stock of the above people/shops.  The optional file modifies the ingredient records listed on the mod page located here: http://skyrim.nexusmods.com/mods/30483.  If any other mod you have modifies the same records, then they will conflict and the one lower in your load order will be the one that is active.   A merge patch should resolve this issue for you and is very simple to make for yourself using TES5Edit.  If you let me know of any mods that do conflict I can try to make a merge patch available, assuming the other mod author gives me permission.\r\n\r\nUse:\r\nFor personal use, feel free to do anything you want with this.  If you are going to use a part or all of this in a mod of your own or repost it, please make me aware of it and provide credit as appropriate.\r\n\r\nParting Comments:\r\nThis simple mod is my first public one.  I have a master mod that I keep all my personal tweaks in but never really thought anyone would be interested in what I had done.  A buddy of mine asked me to package this specific piece of that master mod up for him so I figured I\\'d make it available to others, too.  Please keep that in mind.  Since this was designed just for myself, I may not have done things the way I should have so let me know if that is the case and I may change it.  I may incorporate more vendor stock changes in a future version of this mod.  Or I may do that as another standalone mod.  Or I may lose interest tomorrow.  One never knows...\r\n\r\nVersion 1.1a\r\n - Added optional file (Jarrin Root plus Apothecary Inventory Rebuild)\r\nVersion 1.1\r\n - Fixed issue with Orc Stronghold mix up\r\nVersion 1.0\r\n - Initial release",
  "categoryId": "94",
  "version": "1.1a",
  "author": "cxgdarch",
  "createdUnix": "1358540919",
  "updatedUnix": "1359169519",
  "containsAdultContent": false,
  "uploadedBy": "cxgdarch",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000003278",
      "name": "Jarrin Root For Sale - Rarely",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Jarrin Root For Sale - Rarely-30115-1-0.zip",
      "uploadedUnix": "1358541583",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/965b9d6cc09c41c80e8572cdeaad61d8486958bdfbedc683df30a93c4c55fd93/analysis/1407360142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jarrin%20Root%20For%20Sale%20-%20Rarely-30115-1-0.zip?fid=1000003278&ttl=1535804694&ri=8192&rs=8192&setec=cad1dfbb57d349344d15924b0edfab82"
    },
    {
      "fileId": "1000004492",
      "name": "Jarrin Root For Sale - Rarely - v_1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Jarrin Root For Sale - Rarely-30115-1-1.zip",
      "uploadedUnix": "1359000028",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e782441098445d9545ed72c5a402ce1fcd92a9c55d20c50ce6de4b9ad6839593/analysis/1407376088/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jarrin%20Root%20For%20Sale%20-%20Rarely-30115-1-1.zip?fid=1000004492&ttl=1535804695&ri=8192&rs=8192&setec=f4e18ceb01453a41822968047a836a9c"
    },
    {
      "fileId": "1000004884",
      "name": "Jarrin Root For Sale - Rarely - v_1_1_a",
      "version": "1.1a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10",
      "fileName": "Jarrin Root For Sale Rarely v_1_1_a-30115-1-1a.zip",
      "uploadedUnix": "1359169519",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/baa777f2acc429a785f513a7b0d6fbd333a22436203094c64c11580bc0cf1b5b/analysis/1407378902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jarrin%20Root%20For%20Sale%20Rarely%20v_1_1_a-30115-1-1a.zip?fid=1000004884&ttl=1535804695&ri=8192&rs=8192&setec=3a0883b746085c18e0a4af3a8a77b0c8"
    }
  ]
}