{
  "modId": 30137.0,
  "modName": "Ji s Npc Immersion New city and New armor New Npc s",
  "summary": "New city \\\"kould Kazad\\\" with a new armor. Bandit & wolf attacks on all the nine holds, Bards, adventurers, dragon hunters, Better guard outfits, Guards wife\\'s, Courier depot, more npc variation and much more.\r\n",
  "descriptionHtml": "Please any ideas will be appreciated. tell me what you think tell me if you\\'d like something done separately.\r\n\r\nI have decided to add another .esp separate to the main file of this. this is a mod i was creating earlier. it adds 2 towns to the north shore of skyrim. and one more centralized. they all resemble a viking longhouse along with other places. the towns have people shops and not just nords. have cleaned the .esp with tes5edit. i only have a couple of pics of it and i will upload.\r\nits all working for me. about 10 new interiors 3 new places.\r\n\r\nMy plans in the next 2 weeks for this. (Today Jan 30 2013 New Zealand time)\r\n1. Cows in the wild - set these to the friendly spawn points but make it low so they are not that common.\r\n2. Questing heros of all stripes seek after the fabled daedric artifacts for their potent combat and magical Benefits. - so ill make 2-3 new npc\\'s that will be found trying to find These artifacts.\r\n3. either create falmer trolls and re size them  (smaller) and have them guarding all major falmer areas. or make the falmer slaves different and stronger also have them working on the walls the blackreach.\r\n4. Blocking mages - i have already made this and its a new npc fighting style. Spell in right hand and shield in left. i have tested this and it gets annoying because when you get close they block your hits. makes for a much harder Battle.\r\n5. Upgrade bandit hideouts with a house or tavern that has a npc that will serve any one that goes in there but will not attack the dragon born. or have some rugged bandits living in them.\r\n6. Upgrade forts with taverns. just like Here: http://www.uesp.net/wiki/Skyrim:Fort_Dunstad \r\n7. daedric princes have worshipers that may attack towns - these will e variants like pale skinned people that have black-blood tattoos - to dark elfs - the afflicted ECT. Basically more daedra worshipers in your journey. \r\n8. More guild family\\'s.\r\n9. Maybe Chapels/churches i could evin make proper priory\\'s like the ones in oblivion Here: http://www.uesp.net/wiki/Oblivion:Weynon_Priory_(place)\r\n10. more variation (human) bandits, forsworn, hunters ECT. i might do guards. which means this Might be incomparable with. Diverse guards skyrim. http://skyrim.nexusmods.com/mods/8943\r\n11. fix a few names and make the armor for the guards a bit more hold friendly. (make it cleaner) \r\n\r\n\r\nPlease give me feedback and ideas. i really appreciate it. tell me if you would endorse.\r\nthis is only a base preview page so don\\'t endorse because when im done i will probably delete this page. because im going to be updating alot. (not every day.)\r\nCould some one help me come up with a name for this mod? something better than \\\"Ji s Npc Immersion New city and New armor New Npc s\\\"\r\n\r\nAt the moment im working on Variation. at the moment in the current release the bandits have about 15-20 new variants. im working on the forsworn now so far i have 14 new variants that are all in their respected leveled actor groups. (same goes with bandits) im not sure if i want to do Warlocks (witches, mages ECT) because there is about 40 different groups of mages and im araid that would keep me busy for 3 Full days. as it is through the mages and warlocks do have alot more variation that bandits and forsworn. \r\nAlso there is more Hunter variation i have made 7 new variants. (there usto only be about 5 variants. \r\n(this is people looks)\r\n\r\nim also looking at the face gen texture folder its already over 80MB..\r\n\r\nThe Green and Green and white hauberk is made by tex3hn and they will replace 3 of the armors from his mod Plain and Whiterun Hauberks the mod is Here: http://skyrim.nexusmods.com/mods/21721     (not required)\r\n\r\nGuards Armor\\'s The have been changed Eg. when the stormcloaks take over whiterun they \r\nwont be wearing the Blue windhelm Curaisis they will be wearing The yellow Whiterun \r\nGuard curaisis and their helmets wil be Randomized with the original guard helmet for \r\nthat Hold. same goes for The imperials for another city. But the armors wont change For \r\neither solitude or Windhelm.\r\n\r\nBandits: Groups of three bandits will attack the holds capital on a certain day of the \r\nweek. Called: Bandit Raiders.\r\n\r\nWolves There will be packs of either 4-5 That will roam and attack any town or Capital \r\n(due to sandbox Locations i made) This is randomised and you could run into 10 wolves \r\nattacking one location.\r\n\r\nDragon Hunters: there have been 8 aded to the game 1-2 will be arround the towns and \r\ncitys. the rest will sandbox and travel to the numerious mounds and Word walls in \r\nskyrim.\r\n\r\ni want to get dialogue for these Dragon hunters.\r\nEg: My family was killed by a dragon (sob) \r\nThose dragons will pay.\r\n\r\nThree adventurers that will travel to places of significant in skyrim. they are not \r\nreally that useful (i had made them weak)\r\n\r\nA few traveling Bards Im not sure if they will play as i use my other mod as a base ill \r\nhave a look at this.\r\n\r\nAt mehrunes Dagons shrine i added 2 low leveled worshipers.\r\n\r\nIn whiterun i had added added 2 Worshipers that sandbox in numerious places.\r\n\r\nIn the weekends about 5-6 jarls Have a personal shopper that visits whiterun (saturday \r\nand sunday)\r\n\r\nBlack Foot Couriers:\r\ni have added a courier building just outside the wall in solitude (near the Guard \r\ntower) there is a book merchant inside and a coupple of couriers. (they dont do \r\nmuch)one will go outside and sandbox during the day.\r\n\r\nPriorys:\r\nThese Building house the Wifes of the 3 main Holds Guards (solitude, windhelm and \r\nWhiterun) These wifes will visit the Guard Baracks and go into town during the day.\r\nIn solitude the building is just infront of the Lumbermill.\r\nIn windhelm the building is just outside Kynesgrove.\r\nIn whiterun its just accross from the Battleborn farm.\r\n\r\nMabye some unique dialogue Eg. (happy voice) my Husband, hes out protecting the Jarl.\r\nim so proud of my husband. ect.\r\n\r\nKould Kazad:\r\nThis is a city of resistance against the Thalmor. This City was founded when empror \r\nTitus mede I First Knew the Aldemer comming. So he sent some of his closest friends and \r\nA handfull of soldiers to scour one of the most hidden places in skyrim hide out and \r\nbuild up a force. Ulfric And general tullius Both know of this place and Have been \r\nhired to create a seen to hide the true front Of this so called civil war. When the \r\ncivil war began the bruteish force was sent out to cover the border between skyrim \r\ncyrodil. Word from then has been good every killing has been done in silent with no \r\nmess. Covering the major pass ways the Force Has a parchment containing words from the \r\nold king to join this rebelion. every thalmor agent has been killed and no word has \r\nbeen given to the thalmor. The only few thalmor that know of this place are captured \r\nand will never be a nucence. because they will be killed on sight if trying to escape.\r\n\r\nim planning on creating a main quest. that lets you rise up and become a commander of the Resistance. and you get sent out on crazy Quests killing Thalmor agents and army\\'s.\r\n\r\nGrey Quarter - windhelm \r\ni have added a new building with about 11 darkelf refugees these darkelfs will populate the grey quarter during the day.\r\n\r\ni would like to make a quest here where you find some lost treasure for these people so they can finally get out of the slum.\r\n\r\nI still have to add Familys of the Npc\\'s in the Guilds Like Onmund\\'s family. (Onmund is \r\nfrom the mages guild)\r\nCurrently i have made:\r\nAela\\'s family\r\nRia\\'s family.\r\n\r\nMaybe some quests for the family\\'s im not sure just small ones.\r\n\r\nPlease give me any Incompatabilitys with other mods as such so i can display them on \r\nhere.\r\n\r\nAll face gen is included.\r\n\r\nInstallation\r\nThis requires manual instillation (i think)\r\nfind your skyrim/data folder directory and drag the contents of the .Zip into there and make sure its activated in your Skyrim launcher.\r\nYou can try Nmm tell me how it works.\r\n\r\nRequired:\r\n My other mod Also included in download\r\n\r\nUninstillation:\r\ndelete what ever you added from the .Zip\r\n\r\nLet me know if you\\'d be interested in voice acting. im not sure how id do it (over the interweb) probly just give you the file with instructions to voice.\r\n\r\nChange Log:\r\nVersion V1.3\r\nThe solitude blacksmith. beirland actually has a assistant in the vanilla game but he just recides with the interior of the solitude blacksmith. i have made him a package that makes him go outside with his boss for about 5 hours. during the day.  \r\n3 new companions one is a bard. (they\\'re just called companions) 3 new mages at the college of winterhold. (just called College Mage)  \r\nn the marsh around morthal/ solitude area i have added about 12 argonians ( enemys ) but i might add a party of argonians that sell items later  \r\ni made an advanced ai package. this was very depressing because it would crash all the time. but this package allows 5 more npc\\'s to travel to various inns and exterior cells like the Whiterun market.  \r\nMore Bandit Variation. up to 20 (Ish) new Forms of a bandit (bandit boss, archer ect) \r\nfixed thions voice. (it was child female)\r\nfinished a house. in the new town/city\r\n \r\n\r\nVersion V1.2\r\ni have added 3 new buildings to the city (Only 2 interiors atm) More clutter at castle kazad.  \r\nfixed bandits not attacking at city gates. added enemy\\'s in citys/towns (lowlife, spy ect)  \r\nadded another talos worshiper.  \r\ni have managed to get the bards playing in exterior cells. (no longer requires my other mod still download it because its a nice edition)  and please endorse =) (link at bottom of page.)\r\n\r\nMY OTHER MOD\r\n[url=http://skyrim.nexusmods.com/mods/27510/]Nine Bards Of Skyrim[/url]\r\n\r\nFacebook Page:\r\n[url=http://www.facebook.com/pages/Jiubiizeekks-Skyrim-mods/146300595538178]JiubiIzeekk\\'s skyrim mods[/url]",
  "categoryId": "78",
  "version": "V1.3",
  "author": "JiubiIzeekk and tehx3n",
  "createdUnix": "1358578683",
  "updatedUnix": "1359796032",
  "containsAdultContent": false,
  "uploadedBy": "jiubiizeekk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000003368",
      "name": "Initial release",
      "version": "v1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18091",
      "fileName": "Initial release-30137-v1.rar",
      "uploadedUnix": "1358578963",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/479b606d15921b4a2e52f5015254ec16e3e696ab3e7e0f33790d7c5f41d9951a/analysis/1407360677/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Initial%20release-30137-v1.rar?fid=1000003368&ttl=1535804728&ri=8192&rs=8192&setec=fdcd6ae4370c53e82e31a1350aab4c29"
    },
    {
      "fileId": "1000003927",
      "name": "Second Release V1 2",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18535",
      "fileName": "Second Release V1 2-30137-.rar",
      "uploadedUnix": "1358737035",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/28c22b25d312691e3e86bc662847e9108998a10db0a558d1bcb9c7d3fe16ca29/analysis/1407371476/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Second%20Release%20V1%202-30137-.rar?fid=1000003927&ttl=1535804728&ri=8192&rs=8192&setec=5efa849bf31a162f5dddd80db2ac5ff1"
    },
    {
      "fileId": "1000004688",
      "name": "V1 3",
      "version": "V1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24131",
      "fileName": "V1 3-30137-V1-3.rar",
      "uploadedUnix": "1359091562",
      "modVersion": "V1.3",
      "virusScanUrl": "https://www.virustotal.com/file/1441e32e0d96bd60caaec4d312129cc8a3185163dabf979d306719f5ba1ff4d5/analysis/1407377570/",
      "changelogHtml": " More Bandit Variation. up to 20 (Ish) new Forms of a bandit (bandit boss ect)  <br/> \n i made an advanced ai package. this was very depressing because it would crash all the time. but this package allows 5 more npc&#39;s to travel to various inns and exterior cells like the Whiterun market. <br/> \n n the marsh around morthal/ solitude area i have added about 12 argonians ( enemys ) but i might add a party of argonians that sell  items later <br/> \n 3 new companions one is a bard. (they&#39;re just called companions)    3 new mages at the college of winterhold. (just called College Mage) <br/> \n The solitude blacksmith. beirland actually has a assistant in the vanilla game but he just recides with the interior of the solitude blacksmith. i have made him a package that makes him go outside with his boss for about 5 hours. during the day. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/V1%203-30137-V1-3.rar?fid=1000004688&ttl=1535804729&ri=8192&rs=8192&setec=cf523e1626621586a44f5985a3cc0c55"
    },
    {
      "fileId": "1000004806",
      "name": "V1 29 No Guard armor change for those users that already have a Mod for that ",
      "version": "V1.29",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "842",
      "fileName": "V1 29 No Guard armor change for those users that already have a Mod for that -30137-V1-29.rar",
      "uploadedUnix": "1359145661",
      "modVersion": "V1.29",
      "virusScanUrl": "https://www.virustotal.com/file/4afc7be0bdb19b2b26f60f752cd244f44a333db69bda13ca272297761e388f9c/analysis/1407378376/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/V1%2029%20No%20Guard%20armor%20change%20for%20those%20users%20that%20already%20have%20a%20Mod%20for%20that%20-30137-V1-29.rar?fid=1000004806&ttl=1535804729&ri=8192&rs=8192&setec=c7d5790a17252fd15c25ceeb0ba94464"
    },
    {
      "fileId": "1000006491",
      "name": "Viking towns",
      "version": "V1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6820",
      "fileName": "Viking towns-30137-V1-3.rar",
      "uploadedUnix": "1359796032",
      "modVersion": "V1.3",
      "virusScanUrl": "https://www.virustotal.com/file/3ddde3f6fbac1e6f4ab3700c7a8fd8b21d52da0b435be6e0bc05b3e39d1398a2/analysis/1407392212/",
      "changelogHtml": " More Bandit Variation. up to 20 (Ish) new Forms of a bandit (bandit boss ect)  <br/> \n i made an advanced ai package. this was very depressing because it would crash all the time. but this package allows 5 more npc&#39;s to travel to various inns and exterior cells like the Whiterun market. <br/> \n n the marsh around morthal/ solitude area i have added about 12 argonians ( enemys ) but i might add a party of argonians that sell  items later <br/> \n 3 new companions one is a bard. (they&#39;re just called companions)    3 new mages at the college of winterhold. (just called College Mage) <br/> \n The solitude blacksmith. beirland actually has a assistant in the vanilla game but he just recides with the interior of the solitude blacksmith. i have made him a package that makes him go outside with his boss for about 5 hours. during the day. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Viking%20towns-30137-V1-3.rar?fid=1000006491&ttl=1535804729&ri=8192&rs=8192&setec=bcedcaf1c60317ddb63293d3b3f20db7"
    }
  ]
}