{
  "modId": 30160.0,
  "modName": "Dragonplate Crown- A standalone Helmet for Dragonplate Armor",
  "summary": "Adds a standalone version of the Jagged crown that is compatible with dragon armor perks and works as an equivalent to the Dragonplate helmet. Can be crafted and can be found (with enchanted and unenchanted versions) in leveled lists.",
  "descriptionHtml": "[size=5]Introduction[/size]\r\n\r\nDragonplate armor was great, but the helm sucked. I didnt think it went well with the rest of the armor. However, the Jagged crown did go well Dragonplate armor, but it also had some problems:\r\n\r\n1. It was classed as Daedric, so it didn\\'t benefit from and \\'matching set\\' type perks when worn with Dragonplate armor. \r\n2. It couldn\\'t be tempered\r\n3. You had to give it back to Ulfric/ Tullius to continue with the civil war story. (although it was possible to get with a glitch)\r\n\r\nThis mod changes that.\r\n\r\n[size=5]Description[/size]\r\n\r\nWhat this mod adds, is a standalone, craftable and temperable version of the Jagged crown, that is classed as Dragonplate. The crown is completely standalone, so you can have this crown AND the jagged crown, meaning it will not interfere with the Civil War quests. You can also fully upgrade it to legendary status and wear it with Dragonplate armor and get all the bonuses. Best of all, like the Jagged Crown, it can be work with circlets and dragon priest masks! So you could in wear this and something like, say, the aetherial crown too and get all its bonuses!\r\n\r\n The recipe for crafting is the same as a Dragonplate helmet, and it also requires the \\'Dragon Armor\\' Perk. The stats have been changed so it is exactly the same as the original Dragonplate helm, so it doesn\\'t become too OP (the base crown had higher stats than dragon or daedric helmets). The crown can be fully tempered, but requires a dragon bone instead of a scale.\r\n\r\nThe crown can also be found in leveled lists, the same ones as the Dragonplate helmet, meaning it is usually found as loot on dragons and as random loot around level 40. I have also added enchanted versions of the crown to the lists, which can also be found at around the same level.\r\n\r\n[size=3] Have fun and please endorse if you appreciate this![/size]\r\n\r\n[size=5]Installation[/size]\r\n\r\nEasy peasy. Just put the .esp file in the data section of your skyrim directory and you\\'re ready to go.\r\n\r\n[size=5]Notes and Credits[/size] \r\n\r\nMy credits go to:\r\n-[b]bethesda[/b] for making skyrim and the creation kit, which made this possible\r\n-[b]WoodManGamer[/b] whose Wintertide ENB settings I used in the screenshots: http://skyrim.nexusmods.com/mods/28176\r\n\r\nI have no problem with anyone reuploading this in another language as it ison as it is on this site. I want this to remain Nexus exclusive.\r\n\r\n[size=5]Other mods[/size]\r\n\r\nFeel free to try my other mods:\r\n\r\n[b]Standalone light daedric armor:[/b] http://skyrim.nexusmods.com/mods/25399\r\n[b]Ancient Nord Armor Buff:[/b] http://skyrim.nexusmods.com/mods/25463\r\n[b]Magecraft- making crafting more useful for mages:[/b] http://skyrim.nexusmods.com/mods/25884\r\n",
  "categoryId": "54",
  "version": "1.0",
  "author": "Chimcharred",
  "createdUnix": "1358612488",
  "updatedUnix": "1358613122",
  "containsAdultContent": false,
  "uploadedBy": "Chimcharred",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000003465",
      "name": "Dragonplate crown 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Dragonplate crown 1_0-30160-1-0.zip",
      "uploadedUnix": "1358613122",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/43f943b4464a2140c2705b898615763347229c9c2b211631c0e46b150aa9e88a/analysis/1407361502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonplate%20crown%201_0-30160-1-0.zip?fid=1000003465&ttl=1535804762&ri=8192&rs=8192&setec=ac2872e0d2840b47c43e31ec4c375755"
    }
  ]
}