{
  "modId": 30198.0,
  "modName": "Niruins Business Plan - German",
  "summary": "This is a german translation from the original file from FreshFish:\r\n[url=http://skyrim.nexusmods.com/mods/18366]Niruins Business Plan[/url]",
  "descriptionHtml": "This is a german translation from the original file from FreshFish:\r\n[url=http://skyrim.nexusmods.com/mods/18366]Niruins Business Plan[/url]\r\n\r\nIf you want the english version, please go to his mod site. Big Thanks to FreshFish for allowing me to translate his mod und upload it here.\r\n\r\nThe following text will be for my german fellows.\r\n\r\n**********************************************************************************\r\n\r\nMit der Mod [url=http://skyrim.nexusmods.com/mods/18366]Niruins Business Plan[/url]\r\nhält das älteste Gewerbe der Welt Einzug in Himmelsrand. \r\nWenn ihr einen weiblichen Charakter oder eine weibliche Gefährtin habt werdet ihr ab 8 Uhr abends bis etwa 4 Uhr nachts eine neue Gesprächsoption verfügbar haben. Ausgangsort sind meistens die Tavernen in den Städten.\r\nIch halte das mal wie FreshFish und sage bis hier nicht mehr dazu, werde aber ganz unten weitere Features und Spoiler hinzufügen. \r\nAch ja...wer Probleme mit diesem Thema haben könnte, sollte die Mod auch nicht downloaden.\r\n\r\n[u]Voraussetzung:[/u]\r\nDiese Mod funktioniert nicht ohne [url=http://skyrim.nexusmods.com/mods/11811]Fores New Idles in Skyrim – FNIS (Behavior Files 3.x) [/url], da neue Animationen eingeführt werden.\r\n\r\n[u]Optionale Extras / Kompatibel:[/u]\r\nDamit die Frauen auch glücklich sind werden die Meshes von [url=http://skyrim.nexusmods.com/mods/12793]Calyps Adult Toys [/url] bei den Frau+Frau Animationen benutzt, wenn diese Mod installiert ist.\r\nDie genannte Mod ist jedoch schon eine Weile auf Nexus nicht mehr sichtbar.\r\nAlternativ gibt es die notwendigen Meshes und Texturen jedoch auch bei [url=http://skyrim.nexusmods.com/mods/24421]Adult Toys Merchant [/url]\r\nBei beiden muss die .esp Datei nicht aktiv sein, da nur auf die Ressourcen zurückgegriffen wird.\r\n[b][u]UPDATE:[/b][/u] Diese Mod gibt es jetzt auch von mir übersetzt: [url=http://skyrim.nexusmods.com/mods/30879]Adult Toys Merchant - German[/url]\r\n\r\nWenn installiert, wird auch auf die Mod [url=http://skyrim.nexusmods.com/mods/14294]Osare Underwear UNP[/url] zurückgegriffen. Aktive .esp ebenfalls nicht notwendig.\r\n\r\nDie Animationen sind auf männlicher Seite wohl auf den männlichen Body von [url=http://skyrim.nexusmods.com/mods/6667] 4uDIKs Real body -4RB [/url] ausgelegt.\r\nAuf weiblicher Seite gibt es wohl laut FreshFish keine Präferenzen. \r\nBestätigt sind auf jeden Fall mal der oben genannte männliche Body und [url=http://skyrim.nexusmods.com/mods/6709]DIMONIZED UNP female body [/url]\r\n\r\nEs gibt wohl ab Version 0.9u ein Easteregg für die Mod [url=http://skyrim.nexusmods.com/mods/11427]Luxury Suite[/url]. Das ist aber wieder optional und kein Muss. Fragt mich auch nicht wie man das Easteregg „triggert“ oder was es ist. Das weiß ich auch nicht.\r\n\r\nFollower Mods wie UFO und EFF sollten funktionieren. Es können dann bis zu zwei Begleiterinnen agieren. Jedoch sollte man hier immer eine außerhalb von Tavernen agieren lassen und eine innerhalb.\r\n\r\n[u]Nicht kompatibel:[/u]\r\nNicht kompatibel mit Amazing Follower Tweaks, wenn Ihr ein männlicher Spieler seid. Genaueres weiß ich nicht, aber als weiblicher Spieler könnt Ihr immerhin euch selbst anbieten, jedoch keinerlei Begleiter.\r\nEs gibt wohl ziemlich starkes clipping wenn Ihr die Mod Better males - Beautiful nudes and faces - New hairstyles für den männlichen Nude Body verwendet. Es funktioniert dann zwar, aber sieht nicht mehr gut aus. \r\n\r\n[u]Zur Übersetzung:[/u]\r\nMeine aktuelle Übersetzung ist für die Version 0.9u.\r\nIch habe weder einen männlichen Spielcharakter noch die Luxury Suite installiert. \r\nDaher kann die Übersetzung für diese Dialoge eventuell etwas unstimmig wirken. \r\nBei Verbesserungsvorschlägen oder Fehlern bitte melden.\r\n\r\n[u]Installation:[/u]\r\n1. Falls noch nicht vorhanden ladet euch [url=http://skyrim.nexusmods.com/mods/11811]Fores New Idles in Skyrim – FNIS (Behavior Files 3.x) [/url] und installiert dies.\r\n2. Ladet euch die Original Mod von FreshFish [url=http://skyrim.nexusmods.com/mods/18366]Niruins Business Plan – Version 0.9u[/url]\r\n3. Installiert diese mit dem NexusModmanager oder manuell durch entpacken in euer Data Verzeichnis.\r\n4. Ladet euch meine modifizierte .esp Datei und die String Dateien und überschreibt die Original .esp Datei damit und kopiert die Strings in den String Ordner. Alternativ alles mit dem ModManager installieren und überschreiben.\r\n5. Aktiviert die .esp Datei im ModManager oder Skyrim Launcher\r\n6. Führt die “GenerateFNISforUsers.exe” aus. Diese sollte sich im Skyrim Data Verzeichnis im Ordner „tools“ befinden. Dort im Ordner  “GenerateFNIS_for_Users”.\r\n7. Die neuen Dialoge haben keine Sprachausgabe. Um diese zu sehen müssen daher die Untertitel aktiviert werden.\r\n8. Let’s Play\r\n\r\n[u]Deinstallation:[/u]\r\n1. Speichert das Spiel wenn weder ihr noch eure Begleiterinnen  gerade mit einem NPC am Werk seid und euch außerhalb einer Taverne aufhaltet.\r\n2. Deinstalliert die Mod über den NexusModmanager oder manuell durch Löschen der .esp und .bsa Datei\r\n3. Führt wieder die “GenerateFNISforUsers.exe” aus.\r\n\r\n[u]Update / Mögliche Save Game Probleme:[/u]\r\nDiese Mod nutzt Quests, was zu Problemen bei Updates führen könnte. \r\nDie Quests sind jedoch nur kurz und so lange Ihr updated während ihr oder eure Begleiterinnen gerade nicht arbeitet und Ihr euch nicht in einer Taverne aufhaltet, sollte alles ok sein.\r\nFreshFish hatte jedoch wohl bisher keine großen Probleme.\r\n\r\n\r\n[u]Bugs / Probleme:[/u]\r\nManche NPC’s haben wohl manchmal kein Zuhause/Bett zu dem man gehen könnte, und somit endet das Gespräch damit, dass man nur rumsteht. Es gibt hier auch eine Gesprächsoption um alles abzubrechen, aber diese taucht bei mir manchmal nicht mehr auf. Manchmal hilft dann nur neu laden eventuell aber auch ein paar ingame Stunden warten oder versuchen den Ort zu wechseln.\r\nEine weitere Lösung kann sein, das Bett in der Taverne zu mieten. Oft (nicht immer!) wird dann dieses Bett bevorzugt benutzt.\r\nManche NPC’s scheinen die Haustür abzuschließen, sodass man nicht folgen kann ohne einzubrechen.\r\nManche Animationen sind nicht für den Spielcharakter verfügbar, wegen Kollisionsproblemen.\r\nBetten mit vier Eckpfosten können problematisch werden. Versucht diese zu meiden oder man könnte stecken bleiben.\r\nDie Dialoge laufen manchmal schneller ab als man lesen kann.\r\nWenn Ihr weitere Fehler findet bitte bei der Original Mod posten. \r\nFalls Ihr kein englisch könnt, auch hier in die Comments. Ab und an werde ich das vielleicht an FreshFish weiterleiten. Je nachdem wie es die Zeit erlaubt.\r\n\r\n\r\n[u]Credits:[/u]\r\nFreshFish for the Original Mod and all the great people he mentions in his Credits.\r\nMcGuffin for the [url=http://skyrim.nexusmods.com/mods/29148]SkyrimStringTranslator[/url]\r\nBethesda for TES\r\n\r\n\r\n[u]Meine anderen Übersetzungen:[/u]\r\n[url=http://skyrim.nexusmods.com/mods/30879]Adult Toys Merchant - NSFW - German[/url] / 18+\r\n[url=http://skyrim.nexusmods.com/mods/20242]Riverside Lodge with Sauna - German[/url]\r\n\r\nSpoilers und Features folgen:\r\n-\r\n-\r\n-\r\n-\r\n-\r\n-\r\n-\r\n-\r\n-\r\n-\r\n-\r\nEs gibt bisher 4 Animationen. 2 davon funktionieren nur für Begleiterinnen.\r\nEs gibt verschiedene Sounds für die verschiedenen Sprach Stile.\r\nIn den meisten Städten könnt Ihr eure Begleiter auch außerhalb von Tavernen arbeiten lassen.\r\nEure Begleiterinnen können euch sagen, wieviele Kunden sie schon hatten.\r\nDer Kunde muss mehr Ausdauer haben als Ihr oder eure Begleiterin, damit es zum Orgasmus kommt. Das wird somit in den höheren Stufen schwieriger.\r\nWenn es zum Orgasmus kommt erhält der Kunde einen Souvenir Schlüpfer.\r\nWenn euch eure Begleiterin dabei zusieht besteht die Chance, dass sie auch etwas erregt wird.\r\nWenn eure Begleiterin 10 Kunden hatte, beginnt sie selbst nach Kundschaft zu suchen und versucht auch ansässige Mädchen (wie z.B. Hroki) zu rekrutieren (nur in Tavernen). Das wird durch die Klamotten getriggert. Daher gilt dies für alle Frauen in Tavernen, die das gleiche Kleid wie Hroki tragen. Beispielsweise in Dämmerstern oder Falkenring.\r\nWenn eure Begleiterin ein paar Kunden mehr hatte als Ihr, wird sie versuchen euch beim nächsten Kunden eigenständig anzubieten. Dies geschieht solange bis ihr wieder einigermaßen im Gleichgewicht seid.\r\nVäter sind nicht begeistert, wenn Ihr Ihnen die eigenen Töchter anbietet.\r\nNeuer NPC namens Niamh im Zwinkernden Skeever. \r\nDiese kann von männlichen NPC’s wohl angeheuert werden und betrügt diese jedoch nach mehr als 20 Kunden. Begleiterinnen könnten dann auch abspringen und nicht mehr für euch arbeiten.",
  "categoryId": "25",
  "version": "0.9u",
  "author": "FreshFish and translated by TKone",
  "createdUnix": "1358675635",
  "updatedUnix": "1358675925",
  "containsAdultContent": true,
  "uploadedBy": "TKone",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000003646",
      "name": "Niruins Geschaeftsmodell",
      "version": "0.9u",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37",
      "fileName": "Niruins Geschaeftsmodell-30198-0-9u.7z",
      "uploadedUnix": "1358675925",
      "modVersion": "0.9u",
      "virusScanUrl": "https://www.virustotal.com/file/da40443f3b1397adc1ec79ed801f46637781d7c96730694f2cfea5efd2a36e33/analysis/1407362615/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Niruins%20Geschaeftsmodell-30198-0-9u.7z?fid=1000003646&ttl=1535804826&ri=8192&rs=8192&setec=ba94c95c2a6a6d05394c9e3c68272567"
    }
  ]
}