{
  "modId": 30209.0,
  "modName": "Skyrim Map Rollover Sound from the Demo",
  "summary": " It is just a file that was left into the game since it\\'s pre-release date. The sound that was heard from the map when you selected a marker just as it sounded in the demo.",
  "descriptionHtml": " Recently i watched the demo of skyrim once again in hopes that i would find an interesting difference between the Demo and Full version of Skyrim. So a difference that caught my eye was the rollover sound that was played each time you selected a map marker during the demo and then i said \\\"why would Bethesda want to disable such an immersive sound effect from the game ?\\\".Well, surely they must have had their reasons not to keep this effect in the full version, but since they left the file, why not give the pc players a chance to re-add the sound into their game once again ? A guy in steam workshop by the name of Machienzo.neo made the same mod for skyrim, and it is because of this guy that i was interested in searching in Skyrim\\'s sound files to find the current sound effect, so credits to him for having this mod on the nexus.It is very simple to add the file yourself but i understand that not many people actually want to bother searching for it in Skyrim\\'s files to find it. So that is made for all these people who want to have this effect back in Skyrim with no real difficulty at all :) \r\n\r\n\r\n INSTALLATION:\r\nJust place the file in the Skyrim Data folder and if asked to merge, click yes and you are done.\r\n\r\n\r\n\r\n                                                               !ENJOY!",
  "categoryId": "61",
  "version": "1.0",
  "author": "Kotaidakos",
  "createdUnix": "1358687874",
  "updatedUnix": "1358687987",
  "containsAdultContent": false,
  "uploadedBy": "Kotaidakos",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000003678",
      "name": "Skyrim Map Rollover Sound from the Demo",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "72",
      "fileName": "Skyrim Map Rollover Sound from the Demo-30209-1-0.rar",
      "uploadedUnix": "1358687987",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/28dcbab6128286d0f3a3d98da84145d1c15f55434834e11a32b1fd5075dc5378/analysis/1407366598/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Map%20Rollover%20Sound%20from%20the%20Demo-30209-1-0.rar?fid=1000003678&ttl=1535804844&ri=8192&rs=8192&setec=b62a37b813684cfdd435c05782c0e2b9"
    }
  ]
}