{
  "modId": 3021.0,
  "modName": "Fellowship Mod",
  "summary": "Allows two (2) followers.",
  "descriptionHtml": "Credit to kLAcK107 for finding the code in the papyrus script.\r\n\r\n==Download the text file Fellowship.txt and place it in your Skyrim folder.\r\nThen in-game, find the second follower you want to join your group, open the \r\n\r\nconsole with \\\"~\\\" key, click on the NPC and type:\r\n\r\nbat fellowship\r\n\r\nCode on screen will direct you what to type next.\r\nThe NPC will now be your second follower. \r\n\r\nIf you don\\'t want to download anything you can simply open console ingame, click on NPC you want as second follower, and type:\r\n\r\nssq 750ba\r\nforcerefintoalias animal\r\n\r\nI recommend master (maximum) game difficulty because the game is a lot easier with two followers. Also PISE (Pluto\\'s Improved Skyrim Experience) for increased difficulty of enemies and other ai tweaks. The game seems a lot more fun and unpredictable with an adventuring party of three.\r\n\r\nThere are a couple downsides:\r\n\r\n1. You cannot have an animal companion with this mod.\r\n\r\n2. Cannot open the second followers inventory. One way to make sure the second follower keeps up in skills and levels (if they haven\\'t been) is to open the console, click on the second follower, and type \\\"disable\\\" and then \\\"enable\\\". That will reset them to your level range and you can do it every 5 levels or so.\r\n\r\n2. Trying to dismiss the second follower through dialogue will dismiss the first follower. \r\n\r\nIf you want to dismiss the second follower, the only way is to take them out in the wilderness and beat the crap out of them until they decide your crazy and run as far away from you as they can get. You can then rehire them later if want. If they happen to die, you can open the console with \\\"~\\\" then click on their body and type:\r\nresurrect 1",
  "categoryId": "33",
  "version": "0.90",
  "author": "Blocky",
  "createdUnix": "1323347965",
  "updatedUnix": "1323423319",
  "containsAdultContent": false,
  "uploadedBy": "Blocky",
  "primaryFile": null,
  "files": [
    {
      "fileId": "8503",
      "name": "Fellowship Mod",
      "version": ".91",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Fellowship Mod-3021--91.zip",
      "uploadedUnix": "1323423319",
      "modVersion": ".91",
      "virusScanUrl": "https://www.virustotal.com/file/597b28a19ba81055f508b9e5f1d303a1415c96d6e6010f5a649e0a776261cbc1/analysis/1406496667/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fellowship%20Mod-3021--91.zip?fid=8503&ttl=1535757752&ri=8192&rs=8192&setec=84fd84d32765c1ea828ac0dbf93a271f"
    }
  ]
}