{
  "modId": 30221.0,
  "modName": "DawnGuard_GS",
  "summary": "Adds a full range of automated storage to both Ft. Dawnguard and Volkihar Keep.  The implementation is spotlessly clean and storage is tastefully integrated where logical and convenient.  DLC content is pre-sorted and as a bonus, each base has a [color=yellow][B]Custom Paragon Display Stand[/b][/color]. By the author of GeneralStores.",
  "descriptionHtml": "[heading][color=Springgreen]Question:[/color] [B][I][color=White] What makes a house a home?[/color][/i][/b]\r\n\r\n[color=Springgreen]Answer:[/color][B][I][color=White] Your stuff.[/color][/i][/b][/heading]\r\n\r\n[Center][Img]http://skyrim.nexusmods.com/mods/images/30221-1-1358706381.jpg[/img][/Center]\r\n\r\n[color=White][B]Now you can have easy, automated access to all your stuff from either Fort Dawnguard or the Volkihar Keep.  With vendors, workstations, followers, and access to all your precious gear, both locations make excellent bases of operation for playing through the Dawnguard quests.[/color][/b]\r\n\r\n[list][*] Dawnguard(GS) equips both holds with a comprehensive range of type-specific storage lockers featuring ultrafast bulk transfer menus; an incredible inventory management time-saver.  Cool enough on its own, but these lockers can also share inventory with a variety of currently available and future mods as well.[/list]\r\n[list][*] Dawnguard(GS) does not make substantial changes to the atmosphere and clutter of either hold, but rather adds convenient new containers in useful locations, displacing a few static objects in the process.  The new storage containers are attractive, lore-friendly, and instantly recognizable as to contents[/list]\r\n[list][*] Some storage activators are tied to event triggers so they appear when appropriate.  Other are available immediately.[/list]\r\n[list][*] Dawnguard(GS) adds instant identification for all the DLC content, so Dawnguard items from armor to ingredients will auto-store and sort properly without the need to \\\"learn\\\" them first.[/list]\r\n[list][*]For all other mods, Heuristic Learning Containers will adapt to new content.  Once stored, new items are recognized and supported for sorting and bulk transfers.[/list]\r\n[list][*] For the consummate (OCD) collector, there is a custom [color=Darkturquoise]Paragon Display Stand[/color] ready to proudly show off your collection of glowing egg thingies.[/list]\r\n[list][*] Fully compatible with [URL=http://skyrim.nexusmods.com/mods/25422]Craftable Cloud Storage[/URL] so your can expand your inventory access to anywhere you please.[/list]\r\n\r\nDawnguard(GS) is powered by [URL=http://skyrim.nexusmods.com/mods/18340]General Stores v2.3[/URL], a proven, reliable cloud storage resource that absolutely cannot lose your stuff.  You must download and install the runtime version of GeneralStores for this mod to work.\r\n\r\n[heading][color=Springgreen]12 Primary Lockers added to each hold:[/color] [B]most with menu-driven transfers and/or the ability to drill down to filtered views[/b][/heading]\r\n[list][*][color=Darkturquoise]Books & Papers Library[/color] \t: Store All, Store One Copy, Gather Spell Tomes, Browse Library, Exit\r\n[/list]\r\n[list][*][color=Darkturquoise]Crafting Stores[/color]       : Store All, Smithing, Smelting, Tanning, Gemstones, Exit\r\n[/list]\r\n[list][*][color=Darkturquoise]Food Stores[/color] \t        : Store All, Store Raw, Pantry, Cooked Foods, Raw Foods, Spices, Exit\r\n[/list]\r\n[list][*][color=Darkturquoise]Alchemy Stores[/color]  \t        : Store All, Keep one, Take Cooking Items, Inspect Stores, Exit \r\n[/list]\r\n[list][*][color=Darkturquoise]Scroll Stores[/color]  \t        : Store All, Keep One, Keep Three, Inspect Scrolls, Exit \r\n[/list]\r\n[list][*][color=Darkturquoise]Potion Stores[/color]\t\t: Store All, Buffs, Poisons, Restoratives, Distillation, Liquid Assets, Exit\r\n[/list]\r\n[list][*][color=Darkturquoise]Enchanting Stores[/color]\t\t: Stash Grand Souls, Stash Gems, Grab Empties, Soul Fusion, Check Stash, Exit\r\n[/list]\r\n[list][*][color=Darkturquoise]Armor Stores[/color]\t\t: All Armor, Heavy, Light, Unarmored, Shields, Unclassified, Exit \r\n[/list]\r\n[list][*][color=Darkturquoise]Weapon Stores[/color]\t\t : All Weapons, One-Hand, Two-Hand, Archery, Staffs, Unclassified, Exit\r\n[/list]\r\n[List][*][color=Darkturquoise]Stolen Goods[/color] \t\t        : (No Menu or Type restrictions)\r\n[/list]\r\n[list][*][color=Darkturquoise]Treasures[/color]\t\t: (No Menu or Type restrictions)\r\n[/list]\r\n[list][*][color=Darkturquoise]Follower\\'s Gear[/color]\t\t: (No Menu or Type restrictions)\r\n[/list]\r\n\r\n[heading][color=Springgreen]Tons of extra features are strewn about:[/color][/heading]\r\n[list][*]Lots of filtered [color=Darkturquoise]\\\"OCD containers\\\"[/color].  In the title pic of this mod, those racks are actually filtered weapon containers.  Can you tell at a glance what type of weapons each contains?  There are even crafting containers outside on the battlements specific to the crafting stations there.\r\n[/list]\r\n[list][*]An [B][color=Darkturquoise]Unburden Fountain[/color][/b], with one click, unloads and sorts all crafting material, alchemy ingredients, filled grand souls, books, and raw foods.\r\n[/list]\r\n[list][*]A custom [B][color=Darkturquoise]General Stores Master Chest[/color][/b] gives a single point of access to all lockers, offers full autosort capability, and allows direct storage of measured amounts of gold.  In the keep, there is one when you first enter the main hall.   In Ft.Dawnguard, one is tied to the player\\'s room trigger.\r\n[/list]\r\n[list][*]Each hold has a [B][color=Darkturquoise]Storage Cistern Trapdoor[/color][/b] leading to a fully configured storage area with all lockers conveniently arrayed.\r\n[/list]\r\n[list][*]Soul Fusion option in Enchanting stores allow you to combine 2 weaker captured souls into the next larger soulgem. Fusion options are tied to players enchanting skill\r\n[/list]\r\n[list][*]Potions Distillation allows you to combine lesser restoratives into more potent brews.  Distillation options scale with player level.  At level 50, players can combine 3 Extreme potions into a single Ultimate.\r\n[/list]\r\n[list][*]2 Unenchanted \\\"double\\\" rings not accessible to the vampire hunters provide a little extra bling to the otherwise dreary fort. :)  Look for them on the strategy table.\r\n[/list]\r\n[heading][color=Springgreen]Installation[/color][/heading]\r\n[Center][color=yellow][B]This mod requires [URL=http://skyrim.nexusmods.com/mods/18340]GeneralStores v2.3[/url][/color]  \r\nPlease download and install the runtime package before proceeding.[/b][/center]\r\n\r\nTo install, open the archive and copy [color=yellow]Dawnguard(GS).bsa[/color] and [color=yellow]Dawnguard(GS).esp[/color] to your \\\\data directory. Enable [color=yellow]Dawnguard(GS).esp[/color] in the launcher of your choice.  \r\n\r\nAn optional Hearthfire Compatibility Patch can be found the the like named folder.  This patches allow new content from both DLCs to to be instantly recognized.  If you use CCS, please use one of the CCS patches instead.  Only use ONE patch and load AFTER all other (GS) enabled mods.\r\n\r\n[heading][color=Springgreen]Compatibility[/color][/heading]\r\nDawnguard(GS) is a clean mod, but many dawnguard mods are not.  Any mods that makes deletions to the Dawnguard DLC content can potentially cause a crash when used with this mod.\r\n\r\nThe Winterhold style bookcases in the blood chalice alcove of Volkihar Keep are NOT safe for storage as this mod moves them outside the playable cell and disables them.  Remove all items stored in them before installing.  No other vanilla container are touched.\r\n\r\nThe GeneralStores.esm master has only a microscopic footprint, adding a small amount of new content walled off from the rest of the game.  By itself, it makes no changes to nor has any interaction whatsoever with anything in Skyrim.  All items stored during gameplay are held by the esm, NOT by esp applications.  \r\n\r\n[color=yellow][Center][B]So long as GeneralStores.esm remains active, it will continue to safeguard your valuable gear.[/b][/center] [/color]\r\n\r\n[heading][color=Springgreen]Release Notes[/color][/heading]\r\nI don\\'t play as a vamp so I am not as familiar with Volkihar Keep as I am with the Fort.  As such, the Fort probably has a better layout and has the dragonclaw and bugjar displays that the Keep lacks.  I\\'m open to suggestions on where to place a claw display in the keep but I can\\'t seem to wrap my head around a vision of vamps chasing butterflies.  Hard enough placing find an appropriate place for human food in that foul nest.  I am also open to layout and other suggestions (and SCREENSHOTS!) from vamps more familiar with the flow of life in the keep (vile creatures that you are).\r\n\r\n[heading][color=Springgreen]More Storage Options[/color][/heading]\r\nCheck out [URL=http://skyrim.nexusmods.com/mods/25154]Hearthfire Automated Storage[/url] to add construction specific storage automation completely compatible with this mod.  Use the optional patch if you enjoy both DLCs.\r\n\r\n[URL=http://skyrim.nexusmods.com/mods/25422]Craftable Cloud Storage[/URL] provides craftable, placeable, fully compatible storage activators.  Spawn a Master chest in your current digs and dump all your kit into the autosorter for instant transfer to the Dawnguard Keeps.  Beauty of the cloud layer is the same inventory remains accessible from your original home as well.\r\n\r\nDon\\'t forget to check out the real estate listing at [URL=http://skyrim.nexusmods.com/mods/18340]General Stores[/URL] for a variety of player built homes pre-equipped with compatible storage.  If you are a modder, pick up the full SDK release and go nuts.  Once you experience the incredible time savings of automated storage, you will want to put it in all your favorite places.\r\n\r\n[heading][color=Springgreen]Re-use[/color][/heading]\r\nThis mod is free for anyone to modify and re-release so long as \\\"based on\\\" credit is given and links to GeneralStores are maintained.\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "Harvey2112",
  "createdUnix": "1358706347",
  "updatedUnix": "1358706635",
  "containsAdultContent": false,
  "uploadedBy": "Harvey2112",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000003750",
      "name": "DawnGuard_GS",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "72",
      "fileName": "DawnGuard_GS-30221-1-0.7z",
      "uploadedUnix": "1358706635",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c63e394107ae83fd7a4b7ce470cb204c0346fc5ea7d975baf1ad5acba7fd903d/analysis/1407369789/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DawnGuard_GS-30221-1-0.7z?fid=1000003750&ttl=1535804873&ri=8192&rs=8192&setec=ecd1618adb496fcd90e2b91fe952c39c"
    }
  ]
}