{
  "modId": 30248.0,
  "modName": "Combat Brutality V4 - DELETED",
  "summary": "Improved Melee Combat system for Skyrim.  Uses Stamina and random rolls to create bleeding and knockdown effects in various degrees for 6 classes of weapons.  (all melee above daggers.)  the effects are available at all levels and are possessed by most npc\\'s and enemies in the game.",
  "descriptionHtml": "combat Brutality 4.0 Skyrim\r\n=====================================\r\n[youtube]ByTqBHQbmlg[/youtube]\r\n\r\nVideo is for Version 3, but many of the features are similar and improved for version 4.\r\nInstallation:\r\n\r\nAdd the .esp file to your Skyrim/data folder and activate via launcher menu/Wryebash or NMM.\r\n\r\nAdd the optional war parties mod if you want loads of bandits and draugr scumbags to spawn in the wilderness instead of a bunch of rabbits and foxes etc..  \r\nBe ready for lots of bandit fights and remember, the bandits and many other npc\\'s WILL have the combat perks as well so they can hammer you just as well.  \r\nPick you fights intellegently and don\\'t travel alone unless you are lvl 25+!\r\n\r\nMod Features:\r\n======================================\r\n\r\nSkyrim\\'s combat is, well, quite lame.  Compared to games with highly involved combat systems (I\\'ve played way too much Assassins Creed)  Skyrims melee combat\r\nis mostly unintesting button mashing.  This mod seeks to add some flavor and nastiness to the melee system in Skyrim.\r\n\r\nthe Mod uses the game\\'s perk system to apply a group of combat tweaks on a per weapon type basis.  There is a perk representing each of the weapon types ABOVE\r\ndaggers.  \r\n\r\nthe perks are applied upon startup which means you have them from lvl 1 so no playing for 30 levels to get some combat fun in.  Beware however that the same perks\r\nare applied to many of the default NPC template classes.  (the templates used to spawn many of the npcs in the game including bandits, guards, monsters etc..)\r\nThat means as of lvl 1, others can hit you with the same combat brutality as you can unleash on them.\r\n\r\nVersion 4 is a vastly improved, smaller more efficient format for the application of the perks and their usage throughout the game.  This means that more npc will attain\r\nthe effects, and fewer conflicts with other mods will occur due to the fact that many of the perk assignments are given to templates rather than individual npc records.\r\nThis should help maintain functionality with many other mods.  The only drawback is that since followers don\\'t spawn from the game\\'s npc template system, they do\r\nnot attain the combat perks.  I decided to keep it this way in this version due to the fact that most players use some form of followers mod like \\'Ultimate Follower Overhaul\\'\r\nand any mods to individual follower npc\\'s records would conflict and break anyway.  So no Brutality effects for followers.  This will keep your follower mods working.\r\n\r\nWhat the MOD does to the game\\'s Combat system:\r\n=================================================\r\n\r\nFirst and foremost, it makes the melee weapons much more brutal and effective.  I always hated how the pain of carrying a 90 pound, 2 handed warhammer gave no particular\r\nbenefit in the game\\'s combat.  I sought to have effects for each class of weapon that made their use more effective at \\'crowd control\\' but in different ways.\r\n\r\nThe main effects are on Power Attacks Only:  Stamina reduction, bleeding, and knockdown in various amounts depending on the size and weight of the weapon used.  There are individually \r\ndesigned perks for each class.  Swords have bleeding effect and a small chance of knockdown, 1 h Axes have bleeding and knockdown possibilities.  1h maces have stamina\r\nand knockdown capabilities and an increased capacity than swords and axes.  2H blades have bleeding and knockdown in increased amounts.  2h Axes have stamina/bleeding and knockdown\r\nin increased amounts and 2h warhammers have the highest chance to knockdown as they\\'re the heaviest weapon in the game and will knock opponents more often.  Shield bashing especially\r\nwith the bashing perks will aslo reduce enemy stamina and potentially knock them down if they become tired enough.\r\n\r\nAll the effects against your opponent are dependant on random checks against their stamina and sometimes health.  In the vanilla game stamina is virtually useless except to control whether or\r\nnot you can power attack.  With Combat Brutality, only power attacks can unleash it\\'s power and all random checks are done on opponents stamina and sometimes health.  SO stamina\r\nmanagement becomes VERY important in melee combat.  Manage your own, and wear down your opponent and you will tire him out, making brutal attacks and knockdowns/bleeding much more\r\nlikely.  There now become valid combat strategies like letting your enemy swing away tiring himself out, or using shield bash to weaken him before hacking him down are now possible\r\nwithin the games regular melee combat.\r\nBEWARE:  when YOUR stamina is low the perks\\' random checks from your enemy\\'s swings will effect YOU as well.  Stamina and Blocking are life.  Many of the Brutality effects only \r\napply to an opponent who is NOT blocking.  So keep your stamina up and block your enemy\\'s blows or you\\'ll find yourself on the ground.\r\n\r\nAll of the perks are silently and automatically applied.  You don\\'t have to buy them or qualify for them.  Some of them are positively affected by the existing combat perks in the trees for 1h \r\nand 2h combat.\r\n\r\nCombat Breakdown by weapon type:  All by power attack only.  Each class\\'s knockdown will have a specific sound effect and blook squirting effect so you\\'ll know when it happens in game.\r\n====================================================\r\n1h Swords: least chance for bleeding knockdown, but are faster and land more blows than other weapon types.\r\n1h Axes: slightly more chance than swords.  Bleedout perk for 1h axes modded to add 10, 15, and 20% damage increase with 1h axes, replacing the vanilla useless perk in that position.\r\n1h Maces: biggest knockdown chance for 1h weapons.\r\n\r\n2h Swords: Bleeding, but lowest knockdown chance of the 2h weapons.  Again it\\'s fast attack though.\r\n2h Axes: More than 2h swords, but less than 2h hammers.\r\n2h Hammers:  The biggest chance to knockdown.  Slowest swing however so choose your swings carefully.  Remember if you have the 2h perk \\\"Sweep\\\" you can side attack and possibly knock several enemies on their butts.\r\n\r\nEach type now offers increased potential to justify the increased weight/cost of the weapon.  Now big, heavy weapons have a purpose on the game\\'s combat system.\r\n\r\nShield bashing now has a knockdown and stamina reduction effect if you have the Shield Bash/Deadly Bash perks for blocking.  This makes blocking much more usefull than vanilla as well.\r\n\r\nALL critical hits now result in a knockdown including bow criticals (if you have the bow criticals perks)  This goes for all weapons.\r\n\r\nOther than modding the useless vanilla 1h and 2h axe bleedout perks all other perks are unaffected and work as normal. \r\n\r\nIn Conclusion:\r\n==========================================================\r\nOverall I\\'ve tried to make the combat more fun, have more strategy and be more nasty in the game.  I\\'ve been using this mod for months now in my own game and it is working great.  The game\\'s balance\r\nis mostly maintained.  It does not create balance issues as everything you can do to others can also be done to you.  You will have to pick your battles carefully at low level especially against enemies \r\nwith heavy weapons as they will send you flying.\r\n\r\nI would seriously recommend you install one of the \\\"faster stand up animation\\\" mods available as you will have many more knockdowns in the game.  These allow both you and enemies to get up much faster during combat.\r\nthe vanilla stand up is way too slow as the default game doesn\\'t implement much knockdown behaviour.  \r\nI have tried to keep the effect from happening too much and the balance is very good.  (much play testing with various values was done.)\r\n\r\nOPTIONAL: Wilderness War Parties Mod:\r\n=============================================\r\nThe \\\"wilderness war parties\\\" optional mod just adds a ton of bandit groups to the wilderness including draugr, argonian war parties, khajit war parties, orcs, and all manner of sometimes heavily armed bandits.\r\nThis will add much more potential for melee combat in your game.  Be careful though, as they sometimes can spawn in larger numbers and if they all have the combat perks, they will be tough.  Don\\'t travel without a\r\nfollower at anything under lvl 25 unless you\\'re very stealthy and can hide well.  They will stomp you.  The Wilderness War Parties addon DOES effect default wilderness spawns as well as creates new ones, so it may conflict\r\nwith other mods that alter the wilderness spawns.  (wars in skyrim or skyrim monster mod for example).  Use it if you like more bandits and less rabbits.\r\n\r\nI\\'ve had a lot of fun with this mod.  It makes the combat much more interesting.  Please be sure to endorse if you like it.\r\n\r\nCheers.\r\n",
  "categoryId": "77",
  "version": "4",
  "author": "Paul Black",
  "createdUnix": "1358746867",
  "updatedUnix": "1359072909",
  "containsAdultContent": false,
  "uploadedBy": "polspc",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000003950",
      "name": "Combat Brutality V4",
      "version": "4",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "436",
      "fileName": "Combat Brutality V4-30248-4.zip",
      "uploadedUnix": "1358746961",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/69668d1731108de67f340f7a54635f22d0572f8f551a3fe79da0cbe01e619352/analysis/1407371644/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Combat%20Brutality%20V4-30248-4.zip?fid=1000003950&ttl=1535804921&ri=8192&rs=8192&setec=eccd7b9a1e46500934e68e402cb89609"
    },
    {
      "fileId": "1000004665",
      "name": "Combat Brutality V4 No Lighted Arrows",
      "version": "4",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "37",
      "fileName": "Combat Brutality V4 No Lighted Arrows-30248-4.zip",
      "uploadedUnix": "1359072909",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/cc86346f3c76d23bb0e81a8dc8b8f076cca30f9100e191e53f1775bbf132eeb4/analysis/1407377224/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Combat%20Brutality%20V4%20No%20Lighted%20Arrows-30248-4.zip?fid=1000004665&ttl=1535804921&ri=8192&rs=8192&setec=922e54f3c563d719622fbbf28548a91f"
    }
  ]
}