{
  "modId": 30243.0,
  "modName": "Nordic Iron Cuirass",
  "summary": "Adds stadalone armour as a craftable item.",
  "descriptionHtml": "18 Morning Star 4E 202\r\n    I am getting restless for my voyage. It seems the ship is running late. Its now been rescheduled to Sun\\'s Dawn. Today is a holiday in High Rock, Waking Day. During my earlier days in the legion, I was stationed in Southern High Rock near a place called Anticlere. Anticlere was said the first place that the Aldmer landed in Tamriel and is still an Thalmor hub since after the war. Its really unfortunate that so many in Skyrim are siding with the Stormcloaks. There are actually quite a few jarls siding with Ulfric. Skyrim probably was the most untouched of all the provinces by the war, and this civil war is only going to weaken the Empire further. Its only High Rock, Skyrim and Cyrodiil left. What the sons of Skyrim don\\'t seem to get is that if they win the war, then the Aldmeri Dominion would invade, conquer and destroy Skyrim and Skyrim would be totally defenseless to stop them. Even combined, the Empire barely survived the war and that was with Hammerfell doing half of the fighting on their own. \r\nOn the other front, I still haven\\'t got a chance to bang Ysolda. I was wearing my amulet of Mara and she started asking about it. I told her how Erandur was actually a Priest of Mara. I didn\\'t go into the whole Daedric Worship miasma story though. I drank a lot of mead. Ysolda isn\\'t so great when you get to know her she\\'s like empty and I\\'m getting sick of the whole Whiterun scene. I like Ulfberth and Adrianne, but thats about it. The freaking companions think they are such hot shit and act like I\\'m nothing because I haven\\'t joined their group. Oh you killed a giant ? The three of you did. Nice work. Didn\\'t you hear i killed a freaking dragon and got summoned by the Greybeards. Which reminds me I got to make that trek up those steps to the Throat of the World. Anyway first things first, I\\'m going to Solsthiem with Erandur.",
  "categoryId": "54",
  "version": "1",
  "author": "Franklin Zunge",
  "createdUnix": "1358741503",
  "updatedUnix": "1358741593",
  "containsAdultContent": false,
  "uploadedBy": "FranklinZunge",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000003936",
      "name": "Loose Files",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10349",
      "fileName": "Loose Files-30243-1.7z",
      "uploadedUnix": "1358741593",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/36ffd35c7c4ed4985e7784f1657499a421db12d9de36b0bee140b22b674ae12d/analysis/1407371529/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Loose%20Files-30243-1.7z?fid=1000003936&ttl=1535804909&ri=8192&rs=8192&setec=16e5308ed23c83dbee94a746eb0b1b3c"
    }
  ]
}