{
  "modId": 30245.0,
  "modName": "Riverwood Guest Chest",
  "summary": "\\\"Here\\'s a key to the house, stay as long as you like.\\\" Gerdur said when welcoming me to her home. Because I do stay around Riverwood for a while before I buy a house, and I need a place to store my possessions, I made this mod, which gives the Player a Safe Chest to store their belongings while living in Hod & Gerdur\\'s or Alvor & Sigurd\\'s home",
  "descriptionHtml": "- Introduction - \r\n\r\n\r\nFrom the Journals of Aethelstan the Nord, Dragonborn Hero of the 4th Era:\r\n\r\n\\\"After the destruction of Helgen, I followed Ralof to the village of Riverwood, where I was welcomed with open arms by his sister Gerdur and her husband Hod. Gerdur gave me a key to their home, and invited me to stay with them as long as I wished. They were fine hosts in the tradition of our people. I lacked for neither food nor drink nor good company while staying with them, and when I needed a place to store the things I had brought back from Helgen that I did not wish to part with, they offered me the use of a chest by their spare bed. For the first few weeks that I can remember in Skyrim, all that I owned was in that chest, in the home of the only friends I had in the world.\\\"\r\n\r\n\r\n- What the Mod Does - \r\n\r\n\r\nSimply put, it makes one of the chests in the house of your companion\\'s relatives yours to use as you please. I did this by making the chest mirror the properties of the chests in the player\\'s house as much as possible. To make it obvious which chest is the Player\\'s chest, I put a simple lock on it, which is keyed to match the key to the house (or you can pick the lock), and once opened, the chest and all its contents are yours to do with as you please, and the chest will store whatever you want to from there. \r\n\r\n[For modders interested in what specifically I did, I picked one of the chests in the home – the one on the dresser for Hod & Gerdur\\'s House (I deleted the bandit chest that was there and replaced it with a small personal chest, because a bandit chest would respawn its contents no matter what I did to it, and that was exactly what I didn\\'t want the player\\'s chest to do. In Version 1.1, I moved the clutter - a book and a tankard - off the dresser and over to the nightstand and straightened the chest on the dresser), and the one in the basement of Alvor & Sigurd\\'s house. Then I set the chest in question\\'s ownership to \\\"Player\\\", I told all NPCs to ignore it through \\\"No AI Acquire\\\" and \\\"Ignored by Sandbox\\\", and I put a Novice lock on it, keyed to match the door to the house, so you don\\'t even have to pick it if you were invited to stay by the owner. \r\n\r\n(This happens when you follow Hadvar/Ralof back to Riverwood and meet up for a little scene with their family - Hadvar tells his story inside Alvor\\'s House, while Ralof tells his on a tree stump out by the Mill. Stick around until they\\'ve all said their pieces, and one of the owners of the House  - Alvor in Hadvar\\'s case, Gerdur in Ralof\\'s - will say something to the effect of \\\"Any friend of _______ is a friend of mine. Here\\'s a key to the House, stay as long as you like. If there\\'s anything else you need, just let me know.\\\" - though Alvor didn\\'t offer a key the last time I played this through from Helgen to test the mod, so there may be a benefit to using the Loose Key Version of this mod if you experience the same thing.)\r\n\r\nBy request, I made a loose keys version where I left a key to the house in question lying around in the house (See Images for Locations) so you can just pick up the key and unlock the chest and thereafter, you have a key to both the house and the chest.]\r\n\r\n\r\n- Requirements - \r\n\r\n\r\nA functional version of Skyrim.esm\r\n\r\nThe mod does not require Dawnguard or Hearthfire and will work with both as far as I am aware.\r\n\r\n\r\n- Installation - \r\n\r\n\r\nThis is a simple .esp file that can be dropped into your Data directory and it should work fine from there. It is completely plug - and - play through Nexus Mod Manager, which I highly recommend using. \r\n\r\n\r\n- Uninstallation - \r\n\r\n\r\nAs noted above, this is a simple .esp file, so you would just delete it from your Data directory, or uninstall using NMM. I would recommend you visit the chest and empty it of your possessions before you uninstall it, or they might just go \\\"poof\\\" into Gods - Know - Where . . .\r\n\r\n\r\n- Versions - \r\n\r\n\r\nVersion 1.1a - Updated version. Moved some clutter - a book and an overturned tankard - off the dresser in Hod & Gerdur\\'s house and onto the nightstand by the single bed, and straightened the chest so it fits on top of the dresser properly. \r\n\r\nVersion 1.1b - Includes the changes above, and also puts a loose key that unlocks both the chest and the house somewhere inside the house. See the pictures for the locations of the Keys. \r\n\r\nVersion 1.0 - Initial release. Locks keyed to match the corresponding house key.\r\n\r\nVersion 0.1 - Unreleased version I built for myself, featuring unkeyed locks on both chests. \r\n\r\n(Checked with TES5Edit, version 3.0.26, contains no Dirty Edits that I am aware of.)\r\n\r\n\r\n- Future Plans - \r\n\r\n\r\nNone at the moment, though I might make the lock uniquely keyed and add the key somewhere in the house in a future release. I\\'m very new to making mods, though, and having gotten this to work, I\\'m not inclined to mess with success. \r\n\r\n(This is quite literally the first mod I\\'ve ever made, done in about 20 minutes - 15 of them learning how to use the Creation Kit, 5 of them actually making Version 0.1. Version 1.0 took a few minutes more to key the locks. Versions 1.1 a & b were a little more involved, because I had to figure out how to move and place objects, and it wasn\\'t exactly intuitive, but I\\'m quite pleased with the results.)\r\n\r\n\r\n- Conflicts - \r\n\r\n\r\nThis mod alters two items in two houses. It should not conflict with anything, and it should not crash your game. As someone who is fairly addicted to modding myself, this little mod coexists with about 200+ other mods from this site, and it hasn\\'t caused any problems for me so far. (Will publish a complete list to this entry when I finish compiling it - there are some seriously awesome mods out that that deserve as much recognition as they can get!)\r\n\r\nUnless you have another mod that alters these two chests in some way, load order shouldn\\'t matter either. If you want my mod to work over any other mods that modify those chests for any reason, you should load it after them. \r\n\r\n\r\n- User Permissions - \r\n\r\n\r\nYou have my permission to use this mod to your heart\\'s content. \r\n\r\nIf you wish to include it in some compilation of mods, please let me know & credit me. If you want to use it to base a mod of your own, please let me know and credit me and I\\'ll be happy to help. \r\n\r\n\r\n- Credits - \r\n\r\n\r\nBethesda Softworks, for creating one of the best games I\\'ve ever played, giving us permission to tweak it to our heart\\'s content, and handing us the Creation Kit to make modding it so simple even a novice like myself can mod successfully. Keep cranking out Elder Scrolls titles, and you can count on my continuing to purchase them!\r\n\r\nThe Nexus Forums, for hosting mods to fix anything and everything I don\\'t like about this already awesome game. \r\n\r\nAll those who download and endorse this mod, thank you and enjoy!",
  "categoryId": "53",
  "version": "1.1a",
  "author": "RenaissnceMan",
  "createdUnix": "1358743184",
  "updatedUnix": "1359097229",
  "containsAdultContent": false,
  "uploadedBy": "RenaissnceMan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000003943",
      "name": "Riverwood Guest Chest",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Riverwood Guest Chest-30245-1-0.zip",
      "uploadedUnix": "1358743774",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0044a69f8310b459255d9f441c9f9e0325224296eca78ce3139dce38d7b7c342/analysis/1407371591/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverwood%20Guest%20Chest-30245-1-0.zip?fid=1000003943&ttl=1535804915&ri=8192&rs=8192&setec=9188632e6ab26f29cb65a652427633ef"
    },
    {
      "fileId": "1000004686",
      "name": "Riverwood Guest Chest",
      "version": "1.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Riverwood Guest Chest-30245-1-1a.zip",
      "uploadedUnix": "1359090813",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/1f0ef8a99aecb2ab4964d4a31e1720840dba8a8ee0354c62709009853f17095c/analysis/1407377553/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverwood%20Guest%20Chest-30245-1-1a.zip?fid=1000004686&ttl=1535804916&ri=8192&rs=8192&setec=7d769257fb6acdee2542ae0123481cd8"
    },
    {
      "fileId": "1000004696",
      "name": "Riverwood Guest Chest - Loose Keys Version",
      "version": "1.1b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Riverwood Guest Chest - Loose Keys Version-30245-1-1b.zip",
      "uploadedUnix": "1359097229",
      "modVersion": "1.1b",
      "virusScanUrl": "https://www.virustotal.com/file/b0d155e45191e4f71b8016bc1929484691ee28be34c7a9369c67a10b1091d4bd/analysis/1407377576/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverwood%20Guest%20Chest%20-%20Loose%20Keys%20Version-30245-1-1b.zip?fid=1000004696&ttl=1535804917&ri=8192&rs=8192&setec=9666af7a1253547ab00f425a82d41d14"
    }
  ]
}