{
  "modId": 30259.0,
  "modName": "Elves - Kalii",
  "summary": "Adds a Forest Elf Race and Light Steel Armor for them to use\r\n- Pictures coming soon, Suggestions appreciated :)",
  "descriptionHtml": "So the long awaited update is finally here! i basically restarted the mod from scratch due to some problems i was encountering and so the light steel armor is not included in the new version, however you will still need to download the ears separately.\r\n\r\nSo, previous users will probably know that i was having troubles with naming the race, but i have eventually done it. :)\r\n\r\nI\\'m using no7 of Nouserhere\\'s ears mod resources which i haven\\'t worked out how to attach to the race yet so it\\'s still using the equipable ears. \r\n> http://skyrim.nexusmods.com/mods/21459\r\n\r\nThe Kalii, pronounced Ka-lee, are an elven subspecies similar in appearance to the Bretons of High Rock with a distinct difference; their ears.\r\nThey were driven from the mainland just over two hundred years ago by the Altmer, many taking refuge on a small island off of the north western coast which a century later was lost to the seas due to unusual geological activity; scattering the remaining elves across Tamriel.\r\n\r\nThough pure elf they lack the High Elves\\' obsession with magic, whilst talented in it their natural gift for swordsmanship generally takes precedent in combat due to their superior speed and quick  stamina recovery. Their innate magic resistance also gives them an edge against mages and other magic users. Some historians believe that had the Kalli not been so vastly outnumbered by the Altmer they would most likely have defeated them. However they were never a particularly large population. There are accounts of Kalli being taken in by other elven settlements who protected them from the High Elves and what they called \\\"The Cleansing\\\".\r\n\r\n> They currently don\\'t have a racial power, i\\'m looking to add that in the next update and would appreciate some suggestions and feedback in regards to that.\r\n\r\n> however, they do have a Lesser power of Numbing Touch which is a 10 second paralysis ability that costs 50 magicka.\r\n\r\n> Skill Modifiers\r\n\r\n  Light Armor    10\r\n  Speech          5\r\n  Smithing        5\r\n  Destruction Mg  5\r\n  One-Handed Wp   5\r\n  Sneak           5\r\n\r\n> Abilities\r\n\r\n  Night Eye - This uses the Werewolf ability so that any night eye mods you might have will hopefully affect this too.\r\n  25% magic Resist - For fighting Thalmor\r\n  8% stamina regen boost\r\n\r\nI\\'m considering swapping one handed and light armor\\'s skill boosts so that the focus is on one handed instead, so how do people feel about that?\r\n\r\n<><><><><><><><><><><><><><><><><><><><><>(Old info below)<><><><><><><><>>><><><><><><><>><>\r\n\r\n>UPDATE COMING REALLY SOON<\r\n\r\nRight sorry about the long wait i kind of got distracted by lots of other stuff, anyway when i finish typing this out i\\'m gonna open the construction set and try to finish the update, i\\'ve got what i think are some good ideas for improvements and hopefully you\\'ll like them too.\r\n\r\nAdds a playable Forest Elf race and Light Steel armor. \r\n\\'\r\nI actually made it for personal use but i thought i\\'d upload it incase anyone else wanted to use it. I\\'m using no7 of Nouserhere\\'s ears mod resources which i haven\\'t attached to the race yet so it\\'s still using the equipable ears. \r\n> http://skyrim.nexusmods.com/mods/21459\r\nThe light Steel armor is using the shoulderless steel armor design and imperial light bracers with modified stats and weight. Available to buy at Warmaiden\\'s in Whiterun.\r\n\r\nYeah i realised about the wood elf thing a while ago, was toying with River elves maybe? \r\n\r\nThe backstory i\\'m looking at for them at the moment is the idea of having a second pure elf race.\r\nOne that stands against the Thalmor and has a decent chance of fighting them off. \r\nI was trying to find a way to fit them into the elderscrolls lore somewhere but atm i\\'m having trouble finding a homeland for them.\r\nI\\'ve got two ideas at the moment, either Valenwood as a companion race to the Wood Elves. Which would be a good reasoning for the Night Eye.\r\nAnd/OR -and here\\'s the odd one- have most of them been wiped out by a plague shortly before the war with the first Aldmeri Dominion.\r\nIf i decide to go with that one i\\'ll probably add in a suspicious book talking about rumors that the thalmor somehow started the plague\r\nto get them out of the way in time for the war.\r\n\r\nSo with that in mind the Elves are as follows:\r\n\r\n> Their racial power is currently Woodlander, which grants 60 seconds of invisibility. -I\\'m definitely not 100% on this and would definitely \r\n  appreciate some suggestions for this and anything else.\r\n\r\n> Skill Modifiers\r\n\r\n  Light Armor    10\r\n  Speech          5\r\n  Smithing        5\r\n  Destruction Mg  5\r\n  One-Handed Wp   5\r\n  Sneak           5\r\n\r\n> Abilities\r\n\r\n  Night Eye - This uses the Khajiit ability so that any night eye mods you might have will hopefully affect this too.\r\n  25% magic Resist - For fighting Thalmor, i may nerf this a bit to somewhere between 20 and 10 if you guys think it\\'s too strong.\r\n  5% stamina regen boost - Because why should elves be all about magic? this would also be the reason i\\'m thinking of nerfing the resist a bit, i don\\'t want them to be really OP.\r\n\r\nI\\'m also going to see about seperating the light Steel armor mod so it\\'s an optional file. When i made this i wasn\\'t thinking much about uploading it so i just added it into this as a sidethought. \r\nHowever i do advise it for this race as it suits them quite well in my opinion.\r\n\r\nSo yeah, if anyone has any suggestions for new names or anything else please comment i will be reading them. :)",
  "categoryId": "34",
  "version": "V1.0",
  "author": "EchoSparrow",
  "createdUnix": "1358773549",
  "updatedUnix": "1369748885",
  "containsAdultContent": false,
  "uploadedBy": "EchoSparrow",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004306",
      "name": "Fairfax RTS v1-0",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Elves-30259-V0-1.7z",
      "uploadedUnix": "1358925618",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/341ed36412b800f8c2eed13bf97da6d6d63265a0940bdcad7c4c9e03c1f3e229/analysis/1407374535/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elves-30259-V0-1.7z?fid=1000004306&ttl=1535804937&ri=8192&rs=8192&setec=f1f7e26bdd9d6bf68e10572382d574c3"
    },
    {
      "fileId": "1000031840",
      "name": "Main File V1",
      "version": "V10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Main File V1-30259-V10.7z",
      "uploadedUnix": "1369748885",
      "modVersion": "V10",
      "virusScanUrl": "https://www.virustotal.com/file/026c56cafa39698cb90b1e12f6837d8e21ed2efaf8e0014c305c8598cd37e987/analysis/1407584539/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File%20V1-30259-V10.7z?fid=1000031840&ttl=1535804938&ri=8192&rs=8192&setec=8f54cf2e6784bb228b3f0f8348b09bec"
    }
  ]
}