{
  "modId": 30263.0,
  "modName": "Well of Rebirth - A Perk Respec Mod",
  "summary": "This mod lets you reset all of your perks and reclaim all perkpoints already spent",
  "descriptionHtml": "Introduction:\r\n------------------------\r\nWith this mod you can respec your character, reclaim all your already spent perkpoints a re use them for new perks, you can either reset a single skill or reset the whole 18 Perk trees from your character.\r\n\r\nThis mod is even better then  the one that Dragonborn will add later, in Dragonborn you can reset the skills only if you completed the Dragonborn Campaign, and by look at the scripts of the DLC , it does not even reset some Archery skills nor does it reset speechcraft to 100% (This is only an observation from taking a look at the scripts)\r\n\r\nVideo:\r\n------------------\r\n[youtube]YZZltb7id-I[/youtube]\r\n\r\nHow to use:\r\n------------------\r\nGo to Blackreach, then to Sinderions Shack, you will find a new button there, this button will lead you to a secret room, in this room you will find an in game manual right of the entrance on a table, this manual explains on how to use the mod.\r\n\r\nInstallation:\r\n-----------------\r\nBest would be to use NMM, or extract all contents to the /data/ folder of skyrim.\r\n\r\nCompatibility:\r\n--------------------\r\nThis mod is meant for vanilla perks, changed vanilla perks still using the same ID will be reset as long as they are in one of my created formlists, if you want Skyrim Redone support it would be best to contact the Dev himself and ask him to add his perks to one of the AVReset[Skillnamehere] Formlists, i will not add support for this mod because i do not know what the mod author changed or added to the game, nor do i know if any Global Variables were set or changes or Quest Stages initiated. \r\n\r\nVersion Info:\r\n-----------------\r\nThis mod needs at least v1.8 Every version below will not do because of a few new Papyrus Commands added by this version.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Keldis",
  "createdUnix": "1358782094",
  "updatedUnix": "1358782348",
  "containsAdultContent": false,
  "uploadedBy": "Keldis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000003998",
      "name": "Well of Rebirth - Mainfile",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Well of Rebirth - Mainfile-30263-.rar",
      "uploadedUnix": "1358782348",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ffa63211f42823258db8afd73d6ad21032662f29104bce8ada2f3edfacb8350e/analysis/1407372063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Well%20of%20Rebirth%20-%20Mainfile-30263-.rar?fid=1000003998&ttl=1535804941&ri=8192&rs=8192&setec=57a4d114742bd3924a90b8257382a451"
    }
  ]
}