{
  "modId": 30278.0,
  "modName": "Game of Thrones Lannister Guards in Solitude",
  "summary": "Makes all guards in Solitude and Haafingar Hold wear Lannister guard armor from Omegared99\\'s Armor Compilation. (Requires that mod for this to work).",
  "descriptionHtml": "**Requires Omegared99 Armor Compilation in order to work!!**\r\n\r\nFor all you \\\"Game of Thrones\\\" and \\\"Song of Ice and Fire\\\" fans out there....\r\n\r\nI always associated the city of Solitude with King\\'s Landing (or Casterly Rock), both of which have an abundance of scarlet-cloaked Lannister guardsmen. With this mod, the town and hold guards in Solitude and Haafingar wear the Lannister armor from the Omegared99 Armor Compilation. \r\n\r\nNot a replacer! I just created a new outfit using the Lannister guard armor pieces from the Omegared99 Armor Compilation (Lannister meshes by Omegared99, textures by BILWIT) and assigned it to all guards in the city of Solitude and throughout Haafingar Hold.\r\n\r\nI do not own any of the meshes or textures in this mod; they belong to/were created by Omegared99 and BILWIT. \r\n\r\n**FAQ**\r\n\r\nQ: Wait a minute! We *all* know that King\\'s Landing is policed by the City Watch--the Gold Cloaks--and not the Lannisters! What are you trying to pull here? \r\n\r\nA: If there was a mod that created armor for the City Watch of King\\'s Landing, I would gladly make the Haafingar guards make that. As it stands, there isn\\'t, and if you\\'re so bothered by this you should think of Solitude as Casterly Rock. Also, Solitude\\'s color is red, which makes sense with the scarlet cloaks, and we all know that the City Watch is in the pocket of the Lannisters, so it makes sense that they would send their own guards to supplement the City Watch.\r\n\r\n\r\nQ: Could you make a mod that gives the Windhelm/Riften/Whatever guards Winterfell/Iron Islands/Whatever armor??\r\n\r\nA: Maybe. I despise the Stormcloak faction so I doubt I\\'ll give their capital the honor of being guarded by Stark men, but again, maybe.\r\n",
  "categoryId": "33",
  "version": "1.0",
  "author": "Invctus",
  "createdUnix": "1358800037",
  "updatedUnix": "1358828025",
  "containsAdultContent": false,
  "uploadedBy": "Invctus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004140",
      "name": "Solitude Lannisters",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Solitude Lannisters-30278-1-0.zip",
      "uploadedUnix": "1358828025",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c8dce28424c12a17082bdbf7f9b2d03b24731e4f109491f9aac3727a7e109797/analysis/1407373264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Solitude%20Lannisters-30278-1-0.zip?fid=1000004140&ttl=1535804967&ri=8192&rs=8192&setec=7c24aad8ef3fca99f300d95d3e78a571"
    }
  ]
}