{
  "modId": 30297.0,
  "modName": "Paradise Halls - Dres Trade -slavery-WIP",
  "summary": "Two small  slave camps, a paid labor system, and follower stand-down  for Paradise Halls (0.6.x compatible!). ",
  "descriptionHtml": "Disclaimer: I do not endorse slavery.\r\n\r\n*******NOTE******** This is not yet compatible with PAH 0.7. If you need to uninstall this mod, It\\'s really important to clean out any existing scripts in /data/scripts starting with \\'dres\\'. Also, remove FFDogs.esp, in you data fo0lder. \r\n\r\n\r\n*******NOTE********* You MUST HAVE  at least ONE SLAVE COLLAR in your inventory to buy a slave.\r\n\r\n*******NOTE********* Do not bring any slaves that you don\\'t want to sell into the trade cave/camp, while you are selling. You can store them in a slave nearby slave pit, to keep them from being sold. \r\n\r\n\r\n *** If updating, install from a clean save. You can sell all of your dres slaves and binds first. This should not do anything to the slaves you caught yourself.***  \r\n\r\n* This mod works, but some issues have been reported, and is still being tested.\r\n\r\n* In time, the camps will be expanded to accommodate more non-Dres traders. \r\n\r\n* This mod would not have been possible without Paradise Halls. So, much of the credit (especially slave behavior) goes to layam. \r\n\r\nPlease comment if you encounter any problems with the install, or bugs in the MOD. I will do my best to fix what ever problems we run into. Thanks.\r\n\r\n\r\n****Known issues****\r\n\r\n-The wood elf still throws his voice. \r\n\r\n\r\n-If your registered followers are close to a tagged enemy (who is not dead and not yet captured), they should stand down. However there will be situations where this makes them incapable of defending you (or even themselves). If this happens, you may have to defend yourself, and your followers until the nearby prisoner is captured or dead.  I have a good idea of how to fix this issue, but I will have to rearrange the script a bit. For now, keep this in mind before entering a huge battlefield, while tagging everything that moves.  \r\n\r\n-A really strange thing started happening after I updated to 1.932.0. Occasionally, I would find a dead slave in the camp, that is annoying because they will miss role call, and you will lose money. Now, I believe this only happens when you try to elapse time (using wait), while near the laboring slaves. They will sometimes spawn five to ten feet off the ground, and die. I have no idea why this is happening, and wouldn\\'t know how to fix; however, you could minimize the chance of slaves spawning this way by not trying to elapse time too often, in the camp.   \r\n\r\n-The freshly bought slaves will sandbox their way over the table to get to you seat so don\\'t buy too many at once. layam has asked that we wait until PAH 0.7 before we try to mess with slave behavior, on our own.  Expect to see a fix around the time of his next release.  \r\n\r\n- If you toggle through to view slaves too quickly, they may bunch up on you. If this happens, you can just slowly toggle through the whole set and they should all go back to where they belong. This has been improved. \r\n\r\n- If you toggle and buy slaves to quickly, they may show up dead. This means that after they were cloned by PAH, you didn\\'t give them time to be resurrected, before opting to see the next slave. Resurrecting them in console will correct this. I have worked with this a lot, and am not sure if I will ever fix it. It all boils down to speed and control verses stability. I, personally like the speed, but will continue to find a way to reach stability. For now, a good rule of thumb is to wait until you hear the whiplash sound (after buying a slave) before toggling/buying the next slave.\r\n \r\n- The slave faces (from slaves, that you buy from dres traders) might  be discolored, or even appear to be distorted. I regenerate the face textures each time I update, but there could be texture issues, nonetheless. You may need to regen the face textures (ctrl+F4) in CK. Selecting all NPCs that start with the letters \\\"dres\\\" will include all of the NPCs I have added. \r\n\r\n-There is no mechanism to remind yo to have a slave collar before buying a slave. I forgot to add this again. I will do better next time.\r\n\r\nRequirements:\r\n\r\n* SKSE: http://skse.silverlock.org/\r\n* Paradise Halls: http://skyrim.nexusmods.com/mods/29886\r\n\r\n\r\nInstallation:\r\nUse NMM or unpack into data folder.\r\n\r\n>correct loadorder:\r\n\r\nparadise_halls_base.esm\r\nparadise_halls_core.esm\r\nparadise_halls_farengars_study.esp\r\n\r\nFFDogs.esp      <------- This is the .esp for Dres Trade\r\n\r\nU.F.O. (for UFO users)\r\n\r\n\r\nInstructions:\r\n\r\nGo to the Dres Trader, east of the rift (It will be marked on your map). On the right side of the road (way back in the brush), you will see a hidden trap door that leads to the trade cave. \r\nOn the map, you will also see a marker for the Coven of the Blind, for the other camp. \r\n\r\nOn the trader\\'s table, you will see two activator cards. The one on the right toggles through slaves to buy. Click this and the quest will start. The left card will buy the current slave. Click on the trader NPC to toggle between buying and selling. In selling mode, activate the left card, and all owned slaves in the room will be bought.\r\n\r\nYou will have to talk to the trader before buying slave. \r\n\r\nYou will need to talk to the Dres trader, in the trade cave, to receive the harvest human flesh spell, along with the follower stand-down spells, and some extra rings. \r\n\r\n*Tip- check your journal after the quest has started to see what items (other than slave collars) you need to have in your inventory before buying a slave. You can find a limited amount of the items in the trade camps.\r\n\r\n***Warning, cheat is about to be revealed.****\r\n\r\nThere is a chest near the crash site (west of the trade cave) that contains enough \\\"Binds of Tear\\\"  poison to buy all of the slaves in the lineup, almost three times. Check the bodies too. There are now 60 slave collars in the barrel, in the Dres Slave Cave. I forgot to take these out after testing, so disregard them if you wish. \r\n\r\n****************NOTE******************** Do not bring any slaves that you don\\'t want to sell, into the trade cave/camp while you are selling. If the slaves are kept in another room (like the back room in the trade cave), they should be ok. \r\n\r\n\r\nWhat this mod is, and what it is not:\r\n\r\n\r\n* This mod adds two lore-friendly slave camps to Skyrim. They are both relatively small.\r\n\r\n* One of the camps features a working area, where a contractor will pay you daily wages for up to 30 slaves.  \r\n\r\n* There are three slave traders, so far. Two of the traders trade in potion, while one plays a middle-man and will give you gold for slaves. They are all arguably evil characters.\r\n\r\n* There is no dialogue for any of the characters that I have added (except for the slaves). I might add some later, but no promises. For now, everything is controlled through message boxes, which is much easier to work with. Sorry.\r\n\r\n* Gold means nothing to Dres Traders. There are still pockets of wealth amongst the would-be nobles, and Sympathizers of the Great House Dres. Slaves are not bought and sold with gold (at least, not in this faction of House Dres), and their stats do not effect their value. This does not include the lake boat trader, who will give a generous amount of gold for a slave (and offers an explanation for inflated prices). \r\n\r\n* You can buy as many slaves as you want.\r\n* You can sell as many slaves as you want.\r\n\r\n* Both camps feed off the same Actor array, so you will see the same slaves at both camps. This may, eventually be changed.  \r\n\r\n** IMPORTANT ** If you sell a slave to a dres trader, you are sending them to their death.\r\n  \r\n* This mod is quest-driven in the sense that it uses a quest script. There is no real quest  yet.     \r\n\r\n* This mod also adds an ash-bandit caravan that has been intercepted by the Vigilant. They are more interested in the traders (for things other than slavery) than you. \r\n\r\n* A new poison is introduced called \\\"Binds of Tear\\\". This is used, by Dres traders, as the base unit of exchange for slaves:\r\n \r\n         1 slave = 4 Binds of Tear\r\n\r\n* Alternatively, you must have any combination of (12) pieces of human flesh, or Swamp Fungal  Pod. For example:\r\n\r\n         1 slave    =    (9) human flesh     +      (3) Swamp Fungal  Pod   \r\n\r\n* I recommend using mods that allow you to  grow Swamp Fungal  Pods. However, you could buy all of your slaves with human flesh that has been harvested by the included spell.\r\n\r\n* A new spell is provided to you (talk to the cave trader) that allows you to harvest (6) pieces of human flesh from any HUMAN corpse. This won\\'t work on elves, or any of the beast races.   \r\n\r\n* Slaver bands and travelers have been introduced, but they are more for show, right now. I will spend more time tweaking them and making them vulnerable to other slaver factions> Perhaps, I will even form slaver wars.\r\n\r\n\r\nFuture Updates:\r\n\r\n\r\nI will definitely make the camps feel more like camps people are living in, and better looking. How big is hard to say.\r\n\r\nI will continue to build the two camps up to accommodate future traders (of all types), but again, it is hard to say how much further I will expand it beyond that. At this point, I am dealing with dialogue issues, which are preventing me from inheriting the more sophisticated traders that layam is working on. When I get through these, players should be able to bypass dealing with the evil characters, if they want.    \r\n\r\nAfter seeing layam\\'s camp, I know I am going to want to visit frequently, so I will continue to make groups of traders (who trade useful items like slave materials) walking to and from the camps, escorting slaves. \r\n\r\n\r\nI am trying to find needs to fill, and haven\\'t had much encouragement to build more camps. I am looking into working on slaving strategies, scripting stuff. In order to maximize your slave capture, you need to separate the enemies, without killing them. One idea I had was to make hound tags for the the dogs that are included in this mod (Whiterun stables). Some projectile that signals the dogs to individually attack a downed enemy, and keep them on the ground and occupied until they get struck or you finally whip the guy. \r\n\r\nI always liked the idea of a mobile slave assessor. A trader that will meet you at a desired location, and buy your slaves from you. There is an opportunity to interact with other traders too. \r\n\r\nNow that there is no longer a master dependency to MPtE, I may expand the trade into Elsweyr, in a separate plugin (not this mod). Again, thank you to anyone who DLd Moonpath the first release, and I apologize to anyone who was hoping to see Elsweyr content in this mod.\r\n\r\nI would like to add an optional plugin for a witch burning campaign, by the Vigilant. This is something that I have been thinking about, but haven\\'t been sure how to implement, for a while. Regular assaults, on both camps- by the Vigilant could also be a part of this plugin.\r\n\r\nAnd, of course, everything will work in parallel with Paradise Halls.\r\n\r\n\r\n\r\n\r\nChangelog\r\n\r\n\r\n\r\nVersion 0.6.5\r\n\r\n- The biggest feature of this update is the addition of the companion trader. She can be found in the back room, inside the Dres Slave Cave. She is a companion follower, based on Janessa. She is also capable of trading slaves, and human flesh for BoTs. \r\n\r\n    *The companion trader is also able construct a slave pit and store up to 30 slaves inside of it, for the player. You can think of this as a pack mule feature, for slaves. The pit may then be packed up, and the slaves are sent to a safe spot until player redeploys the pit, and pulls them out later. The Player is paid 25 gold a day for each slave that is held in the pit. The pit is essentially a slave resource for Ash Bandits, who are willing to pay for temporary slave labor (which goes on inside the pit). This may not make much sense yet, but there will soon be a kind of proxy-war between the Dres Traders and the Thalmor, involving the Vigilant of Stendarr. Slave pits, along with slaves, will be a resource that the two factions fight over.   \r\n \r\n- Fixes labor area in the Coven of the Blind. This should work properly now.\r\n- Slaves that are brought to labor can now be beaten (as much as you want) without them   retaliating. \r\n\r\n-You may negotiate with all traders for a the proper slave price. You can add/remove increments of 100 gold to the price of slaves, and increments of 1 BoT for dres style traders.   \r\n\r\n-The Witch trader has been moved out of her tent, and is now on the deck. The Deck has been navmeshed to allow for npcs to move around on it. \r\n\r\n- Binds of Tear has been reworked to be a one-shot-drop, 1-sec capture spell. It is cheap and easy. If you are looking for a challenge, stick to Family Feud\\'s capture Bow, or any of the other methods that are out there. The Major advantage to using the BoTs, as a capture spell, is that I have included a tagging system that will tell your followers to stand down, once the poison has set. ***NOTE*** Your followers must be registered with the Stand Down Array.\r\n\r\n-Registering followers is now one easy step. Just use the spell on any follower that you don\\'t want killing potential slaves. A ring of coordination is now given to the follower automatically. \r\n\r\n- All Dres slaves are now lvl 60 so that they aren\\'t completely worthless in battle (and in werewolf form).\r\n\r\n-A number of other tweaks/polish have been added since last update. \r\n\r\n-A bonus shout is given to you, by the the witches. \\'Ritual Call\\' is not finished, and really doesn\\'t work yet. It changes any soulbound slave into a werewolf slave (irreversibly). There are many bugs that need to be worked out with this shout, but when it does work it is pretty fun. \r\n\r\n       **The source was taken from Werewolf followers by Brevi; So, many thanks to that developer  for opening up the code.**\r\n\r\n   \r\n\r\n\r\n\r\nVersion 0.6.1\r\n\r\n-Adds a labor area to the Coven of the Blind. It is overseen by a contractor that will pay you 25 Gold for a slave\\'s day (and night) worth of work. Up to 30 slaves may be registered at any given time. This appears to work pretty well, but haven\\'t tested the end product all that much.\r\n\r\n- The Nightshade Garden, at CotB has been altered to accommodate a camping area for the player, along with food for the slaves. \r\n\r\n-The boat Trader now buys slaves, and for a competitive price. I have added an explanation of why he will pay more for slaves than MJ, so just ask him.\r\n\r\n- Binds of Tear has been reworked to be a one-shot-drop, 3-sec capture spell. It is cheap and easy. If you are looking for a challenge, stick to Family Feud\\'s capture Bow, or any of the other methods that are out there. The Major advantage to using the BoTs, as a capture spell, is that I have included a tagging system that will tell your followers to stand down, once the poison has set. ***NOTE*** Your followers must be registered with the Stand Down Array.\r\n\r\n- Follower Stand-Down has been introduced. Once you talk to the Dres Trader in the trade cave, you will be given 20 Dres Rings of Coordination. If you want a follower to NOT attack a potential slave, you can follow this procedure:\r\n\r\n1) Give the follower 1 Dres Ring of Coordination.\r\n\r\n2) Use the Register Follower spell on that follower with the ring (look for the \\\"follower registered\\\" confirmation).\r\n\r\n3) Apply a BoT poison to a weapon (preferably an arrow), and give the followers three seconds to let the poison set. Once this happens, your follower should stand down an let you do the slaving.\r\n\r\n4) The slave will drop, but Have a whip handy if you don\\'\\'t see the surrender dialogue (some slaves never surrender, just like in PAH).\r\n\r\n**NOTE** Stand Down has not been tested much; however, the The little testing that I have done (2-3 followers) proved to be somewhat stable. I did witness one mass execution of potential slaves, by one of my followers.  You will still have problems with bandits that warn and aggro, just like in regular PAH. In Fact, if you come across a slave that refuses to surrender (maintains a red dot on radar) your followers will try desperately to stay cool but they may end up killing them anyways. It is probably better that they do kill them, if the plan was to send them to labor. There is a good chance that this kind of slave will cause a riot at your labor camp. The slave will resist, and all of your obedient slaves will try to kill the aggressive slave, and may leave their posts- trying to get him. That will cost you money if you don\\'t go and collect the slaves, in day\\'s time. So, if you have any doubt about a slave, don\\'t bring him/her to the labor camp. Sell them, hide them away, or have them work at Whiterun Farm, and buy a Dres Slave to do the work, at the camp, for them. A Dres Slave will never start a slave riot.  \r\n \r\n- Two spells have been added that will allow you to register/unregister your followers to stand down, when a Binds of Tear potion has been used.  \r\n\r\n- Sends a new slaver group to Whiterun farm. \r\n\r\n- Most emaciated slaves have been given weight. A few voluptuous women slaves have been added along with a couple of beefcakes. A set of unassuming Woodelfs are also introduced.\r\n\r\n\r\n-The Traveling bands of slavers should all be at level 60, so they shouldn\\'t fold the second they get hit. \r\n\r\n-The only Dres slave that will throw voice is the male wood elf. You won\\'t be hearing anymore \\\"Hey, melon nose\\\" or \\\"cheesebrain\\\", unless it comes from a slave that you captured yourself, or the male wood elf. He will be fixed next update \r\n\r\nVersion 0.5.2\r\n\r\n- Same as 0.5.0, but removes a dirty edit.\r\n\r\n- No longer conflicts with Family Feud.  \r\n\r\nVersion 0.5.0\r\n\r\n- Dres Trade is now compatible with Paradise Halls 0.6.2. \r\n\r\n- A spell has been added that will allow you to harvest human flesh from human bodies (will not work if bodies are not human). This spell is given to you when you talk to the Dres Trader (in the cave).\r\n\r\n-You can now buy as many slaves as you want, of any of the slaves available. \r\n\r\n- A four-button message box has been integrated into trader dialogue, to switch trading modes. Two of the four buttons are disabled (used later).\r\n\r\n-Traveling bands of slavers move between COtB and Fellglow, they will defend you, if you are traveling alongside them. They are more for look at this point, but they will play a bigger role in future updates.\r\n\r\n- Female slaves look better (still not super models). Added a breton female slave, changed orc  male to female.\r\n- Witches are more developed (new faces).\r\n- Tweaked lighting more in trade cave.      \r\n- Got rid of shades on Binds of tear effect, and dremora attack.\r\n\r\nVersion 0.4.0\r\n\r\n- You will now get your slave collar back when you sell a slave. However, you now need a collar in your inventory to buy a slave from a trader. This was done to make the traders behave more like layam\\'s. There are enough slave collars in the barrel, at the trade cave, to buy all of the initial slaves. These were left by mistake, so just ignore them if you would rather make your own.     \r\n\r\n- The deck and scaffolding, at the coven have been replaced, and cleaned up. The wolf heads have been disabled from the silver alter (please comment if you want them back). \r\n\r\n- A boat and trader has been added to the coven. This trader is not yet able to buy slaves, but will use layam\\'s slave analysis system, when he is able to.\r\n\r\n- The ambient lighting has been turned down in the trade cave, and added some new fill light sources. Makes it look darker and moodier. A cooking spit and spare tent has also been added to the trade cave, for future traders. \r\n\r\n- The array Has been improved. If a slave is marked as unique, it will be stored in the array when you sell it, so that the traders can now sell that slave back to you. This function was not written to handle the storage of more than 50 slave, and the whole thing might fall apart if you go over (again, I will fix this next update, asap). The array still drops an occasional slave (a lot less than it did), so it still needs work. \r\n\r\n \r\n   \r\n\r\nVersion 0.3.2\r\n\r\n- Moonpath to elsweyr is no longer required!\r\n\r\n- Slave, and dremora face textures have been rebuilt. There SHOULD not be anymore  discoloration, or dirty Silda face. The human girl slaves still look beat though. It will take time to make them look attractive. The other slaves still look generic. \r\n\r\n- The iterator ceiling for the buyslave array has been increased so you should be able to get close to all 50 slaves (I was only able to buy 48). The array is still being worked on.\r\n\r\n- Dres slaves no longer fight with your bandit slaves (or any of your PH slaves)\r\n\r\n- I ran the mod through TES5edit and deleted some dirty edits. There are some errors showing still. I will need time to figure these out, I suspect. But there is nothing critical, and the mod works.\r\n\r\nI am sure I will get more ideas as layam discloses more about the future of the project.\r\n\r\n\r\n\r\n\r\n\r\nBack Story\r\n\r\nOk, so what is with all of this funky stuff?\r\n\r\nThe Dres Trader\r\n\r\nThe dunmer slave trader is suspected of being a descendant of nobles of House Dres, one of the five great houses of Morrowind. \r\n\r\nAccording to Nurcius Punitus, student at the Academy of Literary arts of the Imperial Library in CyrodilI,\r\n\r\nThe Great House Dres \\\"possesses the large plainlands on the southern border of the province, remains the one that keeps most to itself and openly defies Imperial authority. Great House Dres still commemorates the laws of old with their beliefs in ancestral spirits and their religion based on the worship of the living gods, the Tribunal.\\\" \r\n\r\nhttp://tamriel-rebuilt.org/?p=books§ion=106810\r\n\r\nI suspect that some things have changed since this was written. It is unknown whether our character is, in fact, a descendant. We do know that he is a sympathizer of the old Dres customs. He writes about his interest in rebuilding the saltrice plantations of southern Morrowind. Dres Slave owners have had a very independent, entrepreneurial spirit.\r\n\r\nTraditionally, Dunmer (Dark Elves) have worshiped the Daedra. Boethiah was a very important Dadric Prince to the Dunmer. However, it would be fair to say that our trader is more bandit than noble. His understanding of Dadric worship has been altered by the grief and loss of his homeland. He has been forced underground, and into the arms of evil. In desperation he reached out to the only daedric prince that seemed to be able to provide real change. Mehrunes Dagon. At first he believed Dagon would help him. But Dagon only knows deceit and destruction. After years of worship, our trader was granted the assistance of an unbound Dremora Lord. The trader had no Idea what he was getting himself into. Night after night, the dremora demanded more and more flesh. His hunger was insatiable, and his hatred was infectious. So much so, our trader became infected by it. Needless to say, it was not long before he was completely incapacitated, unable to speak. He is now controlled by the Dremora Lord. His slave population has diminished greatly, and the vast majority of slaves that are traded to him, go straight to Oblivion.   \r\n\r\nThe Coven of the Blind\r\n\r\nThe witches of the Coven of the Blind control the second of the two trading camps. They are all of a mix of Breton and High-Elf descent. Each were practicing to become Hagravens, in camps throughout Skyrim. Each were rejected, and feared by their respective covens, due to their advanced abilities, as sorcerers. Each eventually usurped, and ate their Hagravens. It is believed that the flesh of a Hagraven yields great power to a witch that consumes it during ritual. It is not known what this ritual is, but we do know that each of the the witches went blind in one eye, while preforming it. None of the them succeeded, and so they all met, and now spend their days trying to understand why the ritual failed. Unlike the Dres trader the witches have maintained control over their camp. They captured an unfortunate werewolf, and bewitched it through a silver-blood ceremony. The witches capture blood relatives of the the werewolf, and sacrificed them upon an alter of silver (the sword). The wolf is bound to the witches and is forced to maintains their camp.      \r\n\r\n\r\n The Binds of Tear\r\n\r\nThe Binds of Tear is a potion of paralysis- a powerful poison- that has long been used by the Dres, to capture slaves. It is a special mix of Human Flesh, Swamp Fungal Pod (from the Black Marsh), and Saltrice (from Morrowind). The traditional recipe is unknown- except by Dres Nobles, who study the old alchemy. The Witches of the Coven of the Blind, not only know the traditional recipe, they have perfected it. The Binds of Tear has become a popular poison amongst slave hunters, who trade with Dres sympathizers. And so, the Blind witches and the Dres traders have adopted it as the base currency, for their local slave economy. The majority of slaves that are sold to Dres traders are sick and dying. This is because the traders do not differentiate between slaves with high stats, and those with low. All these traders care about is the ability to cultivate Swamp Fungal Pod, or human flesh. Most slaves (non-human) do not survive the harvest of more than 12 pods, regardless of their initial condition. Similarly, humans do not yield more than 6-12 pieces of flesh (required for 4 separate potions). The witches are able to produce the binds with less, but they ask for extra (price of convenience). The Dres trader followed suit.       \r\n    \r\n\r\n\r\nHappy hunting!\r\n\r\n \r\n\r\n",
  "categoryId": "53",
  "version": "0.6.5",
  "author": "RET45",
  "createdUnix": "1358825043",
  "updatedUnix": "1373415234",
  "containsAdultContent": false,
  "uploadedBy": "RET45",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000006529",
      "name": "DresTrade_0_1_2",
      "version": "0.1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6431",
      "fileName": "DresTrade_0_1_2-30297-0-1-2.rar",
      "uploadedUnix": "1359810781",
      "modVersion": "0.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/01ead4a263b63ad8cad308e81c2a0d0380f0482897798be36645d369347687d7/analysis/1407392594/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DresTrade_0_1_2-30297-0-1-2.rar?fid=1000006529&ttl=1535804992&ri=8192&rs=8192&setec=e635224e1881a0eff5b8746cd8b383ec"
    },
    {
      "fileId": "1000007232",
      "name": "DresTrade_0_3_2",
      "version": "0.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6151",
      "fileName": "Dres Trade-30297-0-3-2.rar",
      "uploadedUnix": "1360062500",
      "modVersion": "0.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/584a407fc4a994e07147eb81b4fb3467173ead593231f26b268acfe11c1b1b6f/analysis/1407398477/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dres%20Trade-30297-0-3-2.rar?fid=1000007232&ttl=1535804993&ri=8192&rs=8192&setec=2b24fe0584fa282105d249cdec50fa4e"
    },
    {
      "fileId": "1000008689",
      "name": "DresTrade_0_4_0",
      "version": "0.4.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6198",
      "fileName": "DresTrade_0_4_0-30297-0-4-0.rar",
      "uploadedUnix": "1360503054",
      "modVersion": "0.4.0",
      "virusScanUrl": "https://www.virustotal.com/file/4bf96d354f4a12b8c24af4700ccfa789d3dde2437609d2e593e00c6abc8b587d/analysis/1407409397/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DresTrade_0_4_0-30297-0-4-0.rar?fid=1000008689&ttl=1535804994&ri=8192&rs=8192&setec=e109b7bfba1b25d8732214d0084c0128"
    },
    {
      "fileId": "1000015448",
      "name": "DresTrade_0_5",
      "version": "0.5.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6204",
      "fileName": "DresTrade_0_5-30297-0-5-0.rar",
      "uploadedUnix": "1362565543",
      "modVersion": "0.5.0",
      "virusScanUrl": "https://www.virustotal.com/file/6515a0517714cd21964390e289f32a5665b0afec051fb0c61291e674e1b3bbec/analysis/1407455289/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DresTrade_0_5-30297-0-5-0.rar?fid=1000015448&ttl=1535804994&ri=8192&rs=8192&setec=5b2935cdb1230bfd4f8db0be194e14d5"
    },
    {
      "fileId": "1000015635",
      "name": "DresTrade_0_5_2 ",
      "version": "0.5.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6195",
      "fileName": "DresTrade_0_5_2 -30297-0-5-2.rar",
      "uploadedUnix": "1362628785",
      "modVersion": "0.5.2",
      "virusScanUrl": "https://www.virustotal.com/file/3f8fc5fb16f936976381f927b982c6e83f5e76e8085c4d58f2e30238a827f056/analysis/1407456726/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DresTrade_0_5_2%20-30297-0-5-2.rar?fid=1000015635&ttl=1535804994&ri=8192&rs=8192&setec=b50de1f1873b0e88ce0b98e04e74b6ae"
    },
    {
      "fileId": "1000024302",
      "name": "DresTrade_0_6_1",
      "version": "0.6.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6237",
      "fileName": "DresTrade_0_6_1-30297-0-6-1.rar",
      "uploadedUnix": "1365918784",
      "modVersion": "0.6.1",
      "virusScanUrl": "https://www.virustotal.com/file/f6c7f1dc9fb8a2ceb075abd182c9e43858bea282ac9490e2d9862f5b810c7f59/analysis/1407521325/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DresTrade_0_6_1-30297-0-6-1.rar?fid=1000024302&ttl=1535804995&ri=8192&rs=8192&setec=8841005d493a8b90dc7f443bcdff377e"
    },
    {
      "fileId": "1000038117",
      "name": "DresTrade_0_6_5",
      "version": "0.6.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6322",
      "fileName": "DresTrade_0_6_5-30297-0-6-5.rar",
      "uploadedUnix": "1373415234",
      "modVersion": "0.6.5",
      "virusScanUrl": "https://www.virustotal.com/file/87d1291526d1b0177245848a3875eca4549b6059319c69d97fc2e87673edeb9a/analysis/1407637399/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DresTrade_0_6_5-30297-0-6-5.rar?fid=1000038117&ttl=1535804995&ri=8192&rs=8192&setec=ef579840a13e32e4719854afeba66b91"
    }
  ]
}