{
  "modId": 30300.0,
  "modName": "Shield Enchantments BETA v0_1",
  "summary": "The mod adds 28 new shield enchantments to skyrim.  It also allows for encounters and NPCs to carry and use these shields.  Currently this is a beta.  Since my character right now is level 77 it\\'s hard for me to get a feel for what\\'s balanced.  So, I need feedback from everyone.",
  "descriptionHtml": "Intro:\r\n\r\nThe mod adds 28 new shield enchantments to skyrim.  It also allows for encounters and NPCs to carry and use these shields.  Currently this is a beta.  Since my character right now is level 77 it\\'s hard for me to get a feel for what\\'s balanced.  So, I need feedback for everyone.\r\n\r\n\r\nRequirements:\r\n\r\nThe latest version of SKSE is all that is required.  You do not need Dawnguard or Hearthfire.\r\n\r\n\r\nGetting Started:\r\n\r\nFirst things first, this is a BETA.  Which means I want to hear all your ideas and complaints about the mod(within reason).  I believe I\\'ve done the best I can in eradicating the bugs so far, but with other systems, and other mods, you never know.\r\n\r\nSecond thing is where to go.  Pull up your map and look east of Rorikstead and you\\'ll find the map marker is already discovered.  It leads to a blank dungeon not filled with any enemies, yet.  Just run through to the middle room and open the grate to lead down the shaft to a podium with an effect on it.  Click the podium and you\\'ll do two things:  You\\'ll unleash the enchantments so that bandits and most npcs have a chance to get an enchanted shield.  The Armory room will also unlock, giving you access to all the existing enchantments.  There\\'s also a disenchantment table in the dungeon, so go to town with it.\r\n\r\n\r\nList of Enchantments:\r\n\r\nEnchantments are broken into three types: Bashing, Thorns, and Shield Raising.\r\n\r\nBashing\r\n-Banish\t\t\tBashing will Banish Daedra under level 15.\r\n-Bleeding\t\tBashing does 3 bleeding damage over 5 seconds.\r\n-Boost Damage\t\tBashing does 10 times more damage.\r\n-Magicka Damage \tBashing will do an additional 25 magicka damage.\r\n-Fire Damage\t\tBashing with do an extra 20 fire damage.\r\n-Frost Damage\t\tBashing does an extra 20 Frost Damage.\r\n-Lightning Damage\tBashing does an extra 20 Lightning Damage.\r\n-Telekinetic Bash\tBashing is given additional range.\r\n-Fus Bash\t\tPowerbashing will knock most opponents down.\r\n\r\nShield\r\n-Detect Life\t\tRaising your Shield will detect nearby life.\r\n-Flame Cloak\t\tRaising your shield engulfs you in a flame cloak doing 15 damage to nearby enemies.\r\n-Frost Cloak\t\tRaising your shield engulfs you in a frost cloak doing 15 damage to nearby enemies.\r\n-Lightning Cloak\tRaising your shield engulfs you in a lightning cloak doing 15 damage to nearby enemies.\r\n-Poison Cloak\t\tRaising your shield engulfs you in a poison cloak doing 15 damage to nearby enemies.\r\n-Illumination\t\tHolding your shield up radiates light to show the way.\r\n-Invisibility\t\tRaising your shield makes you invisible at the cost of 20 stamina per second.\r\n-Magic Ward\t\tBlocking creates an magic ward that deflects up to 50 magic damage.\r\n-Regen Health\t\tRaising your shield restores 10 health per second at the cost of 10 stamina per second.\r\n-Regen Magicka\t\tRaising your shield restores 10 magicka per second at the cost of 10 stamina per second.\r\n-Regen Stamina\t\tRaising your shield restores 10 stamina per second.\r\n-Stagger Guard\t\tYou stagger 50% less.\r\n\r\nThorns\r\n-Calm\t\t\tEnemies up to level 20 that hit your shield are calmed.\r\n-Frenzy\t\t\tEnemies that are up to level 14 that hit your shield are frenzied.\r\n-Disarm\t\t\tEnemies that hit you with a power attack will get there weapon disarmed.\r\n-Ethereal\t\tOn every 15th hit, you will become ethereal for 5 seconds.  Casting spells or bashing will remove the Ethereal Effect.\r\n-Slow\t\t\tEnemies that hit your shield are slowed by 75%.\r\n-Soul Trap\t\tEnemies that hit you while your shield is raised will be soul trapped.\r\n-Damage\t\t\tEnemies that hit you will receive an extra 20 thorns damage.\r\n\r\nSmall video breaking most of the enchantments down.  It is somewhat old though:\r\n[youtube]VXwViK99SN4[/youtube]\r\n\r\nCompatibility:\r\nNo know Compatibility issues....so far....",
  "categoryId": "75",
  "version": "0.1",
  "author": "Kevin Swiecicki aka BigKevSexyMan",
  "createdUnix": "1358834774",
  "updatedUnix": "1358835775",
  "containsAdultContent": false,
  "uploadedBy": "BigKevSexyMan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004156",
      "name": "Shield Enchantments",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6836",
      "fileName": "Shield Enchantments-30300-0-1.zip",
      "uploadedUnix": "1358835775",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/3e84c5ac9b5e7e49c65c08e19c800f6bab22ff4cfb88e0d0b983baf277601b73/analysis/1407377050/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shield%20Enchantments-30300-0-1.zip?fid=1000004156&ttl=1535805000&ri=8192&rs=8192&setec=36cb431c1979dfa313cc441650aa8d0f"
    }
  ]
}