{
  "modId": 30319.0,
  "modName": "Skyrim Fidelity Guide",
  "summary": "A guide on how to get the best fidelity for Skyrim and how to use what you have better.",
  "descriptionHtml": "This is just a guide on how to get the best graphics fidelity out of Skyrim and may help you improve the look, immersion of Skyrim and explain the truths about some graphics technology.\r\n\r\n[b]Anti-Aliasing, What\\'s the real situation?[/b]\r\n\r\nAs you may know, Skyrim like some other games now days have an option for FXAA(Fast Approximate Anti-Aliasing) and MSAA(Mulitsample Anti Aliasing). It\\'s easy to think FXAA is better because it does the same job as MSAA but this is not true. FXAA is a shader based Anti-aliasing method which is better at removing aliasing with games that use a lot of post processing effect that MSAA finds hard to do, also FXAA works with deferred rendering, lighting based game engines which are rather common now days(Skyrim doesn\\'t use deferred rendering or lighting) and MSAA cannot be used in such games using DirectX 9 with deferred renderer(DX10/11 enables MSAA with deferred rendering engines or methods).\r\n\r\nFXAA in Skyrim can reduce image fidelity by quite a difference compared to MSAA and to say it does the same job with less performance is simply false. Losing image fidelity at the expensive of performance is not what\\'s supposed to happen, especially if you cannot keep the crispness and sharpness of Skyrim. SMAA solves the image quality problem somewhat because it uses a sharpening filter but it still has the same fundamental problems as FXAA, like broken diagonal lines, fences, flickering on textures which is coined \\\"texture popping\\\". This happens when you walk and textures in front of your view shimmer. MSAA reduces this greatly and transparency anti-aliasing methods like supersample remove this effect almost completely on every part of the image as you move but at very high FPS cost. High image fidelity costs FPS and there is no way around it, FXAA, SMAA doesn\\'t get around it, hence the point of this guide and why sacrificing FPS for image quality might be a worth while look into for better immersion in Skyrim.\r\n\r\nI\\'ve put up a screenshot of a MSAA and FXAA comparision, the second shot is of FXAA and SSAA(supersample), where FXAA breaks the pixels in the bars so they flicker. FXAA is brutal at reducing the fidelity of the image sharpness on the ground, it\\'s considerably more blurry and the crispness of the texture is lost. This is on the whole image not just one part, so the whole image becomes soft and blurry, reducing the texture detail even more, no good if you\\'re using those lovely texture mods.  Add on top of this, texture shimmering while you\\'re moving. Always use MSAA if you want the best fidelity, transparency multisample, supersample if you want only the very best image quality, There is always a reduction in FPS for anti-aliasing quality, make no mistakes about that, FXAA doesn\\'t actually change anything when you make an apples to apples comparison and MSAA is only at 4x, 8,16,32 and CSAA are much better but high levels over 8x seem to be incompatible with Skyrim for some reason or have problems. Note that in Crysis with 16xAA Quality I get about the same frame-rate as Skyrim and that\\'s with much higher fidelity and quality all round.\r\n\r\nSGSSAA(Sparse Grid Super Sample Anti-Aliasing), this can be enabled in tools like NVIDIA Inspector but comes at a very high FPS cost at 4x. NVIDIA recently added automatic LOD bias so that it doesn\\'t blur the image with SGSSAA and is possibly the best anti-aliasing method to date. This method is more demanding than SSAA but image fidelity will be pretty close to pin sharp at 1920x1080, even small posts at distance will look crisp. Having this enabled might actually improve overall frame-rate, since SGSAA will make your GPU work harder and increase GPU initialisation.\r\n\r\n[b]Lights and Darks[/b]\r\n\r\nOne thing that is often overlooked is calibration of your monitor. Skyrim is very sensitive to how your brightness, contrast and gamma are set and in fact the lightness of your room or lights that might be near to your monitor(same as when you look at stars in the night sky and don\\'t want garden lamps or window lights to spoil your view). Go to Control Panel>Display> Calibrate Display Colour in WIndows 7 and follow the instruction(or use a third party one). Not only does a overly bright screen destroy the colour in the game but it also can make the game look washed out and can kill the immersion of nights. Really you should walk around at night with a torch in Skyrim, where you can barely pick out detail and hear animals, bandits near by that may attack, which can make for a more intense and immersion in a room with minimal light while you are playing.\r\n\r\n[b]Promo Screenshots of Skyrim And DLCs[/b]\r\n\r\nYes, we would all like our game to look like those fake promo screenshots that Bethesda put out, in reality they don\\'t look like that in-game, unless you mod it and use supersample, because that\\'s what Bethesda do for their console shots. Those shots are setup, rendered at very high resolution and downsampled to coincidentally, the same resolution that consoles use (1280x720). A relatively high end PC using SSAA(supersample Anti-aliasing) can match those with tweaks and mods and still keep above 30fps at 1920x1080.\r\n\r\n[b]V-Sync and Screen Tearing[/b]\r\n\r\nV-Sync is a much talked topic and can greatly affect fidelity and responsiveness. If you don\\'t use any third party mod like ENB or Sweetfx that uses a dll then you can enabled triple buffer with tools like D3DOverrider. This will make your experience with V-Sync on a whole lot better without the downside of V-Sync in which the frame-rate will half to your screen refresh rate if the frame-rate drops below it. If your screen refresh is 60hz then using V-Sync will cap your frame-rate to 60fps, if the frame-rate drops below that then you will get \\'lag\\' because your screen cannot keep that and cannot tear to stop the frame-rate dropping.\r\n\r\nYou should consider using tools like NVIDIA inspector which has a frame-rate limiter and reduces mouse lag because it locks the frame-rate just under your screen refresh This can really help mouse responsiveness in menus and general movement in Skyrim. Give it a try and get your screen refresh rate from your monitor instructions or specs.\r\n\r\n[b]It\\'s Down To You[/b]\r\n\r\nUltimately, it\\'s down to you and what performance you\\'re willing to sacrifice for fidelity but part of fidelity is immersion, which helps you feel more part of the game. On a personal note, I always like the best fidelity and quality possible with the hardware at hand.  Bethesda didn\\'t give PC gamers the best default Skyrim experience by a long shot but hopefully this guide might help with that, along with various other tweaks.\r\n\r\nATI/AMD users can use a tool called [url=http://www.radeonpro.info/en-US/]RadeonPro[/url]. I personally have never used this tool nor do I have a ATI/AMD card to pass judgement on their features.\r\n\r\n[url=http://www.geforce.com/games-applications/pc-games/elder-scrolls-v-skyrim]NVIDIA Tweak Guides For Skyrim[/url]\r\n\r\n[url=http://sweetfx.thelazy.net/]SweetFX[/url]\r\n\r\n[url=http://mrhaandi.blogspot.co.uk/p/injectsmaa.html]SMAA[/url]\r\n\r\n[url=http://en.wikipedia.org/wiki/Deferred_shading]Deferred Rendering[/url]\r\n\r\n[url=http://www.pcadvisor.co.uk/news/pc-peripheral/3314212/how-calibrate-your-monitor/]Monitor Calibration[/url]\r\n\r\n[url=http://www.guru3d.com/content_page/rivatuner.html]RivaTuner(comes with D3DOverrider)[/url]\r\n\r\n[url=http://downloads.guru3d.com/NVIDIA-Inspector-1.94-download-2612.html]NVIDIA Inspector[/url]\r\n\r\nEndorse this if you found it helpful!",
  "categoryId": "62",
  "version": "1.2",
  "author": "Half64",
  "createdUnix": "1358875536",
  "updatedUnix": "1358971960",
  "containsAdultContent": false,
  "uploadedBy": "Half64",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004411",
      "name": "Skyrim Fidelity Guide in rich text format",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "439",
      "fileName": "Skyrim Fidelity Guide-30319-1-2.zip",
      "uploadedUnix": "1358971960",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/5d7aa9d254f9d90c0e32e026510ae418f544c8b5d51794832d32c9077e93594a/analysis/1407375844/",
      "changelogHtml": " Added rich text format with images. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Fidelity%20Guide-30319-1-2.zip?fid=1000004411&ttl=1535805021&ri=8192&rs=8192&setec=d968c981ef90bc09b52735d39de1a19a"
    }
  ]
}