{
  "modId": 30358.0,
  "modName": "Smeltable Silver Tableware",
  "summary": "Smelt silver goblets, plates, platters, jugs and bowls to silver ingots.",
  "descriptionHtml": "NEW SIMPLE VERSION \r\n\r\nA little mod made with the Creation Kit \r\n\r\nNow you are able to smelt silver goblets (both types), plates, platters, jugs and bowls (both types) to silver ingots. \r\nNOT candlesticks!\r\n\r\nFIRST aND FOREMOST you must smelt them all into plates as if you\\'ve hit them with a hammer to flatten them. Then the plates are smelted to silver ingots.\r\n\r\nIf you have version 1.0 uninstall it. It\\'s more complex and it does not produce.\r\n\r\nI\\'ve taken into account the weight values of the mod \\\"Skyrealism-Mass and Materials\\\" that I use.\r\nHere is the link:\r\nhttp://skyrim.nexusmods.com/mods/21724\r\n\r\nI believe you could save some septims instead of selling the silverware and buying a Silver ingot from a shop. It surely helps if they are stolen in the first place. \r\n\r\nATTENTION: Stealing is bad. Do not steal in your Real Life or you will end up in prison. \r\n                   Also, stealing in skyrim can get you in prison too.\r\n\r\n\r\nManual Installation (Gopher\\'s way):\r\n\r\nGo to NMM and click on add mod from file (the puzzle bit with the plus sign button at the upper left corner). Find the folder where you\\'ve put the downloaded .rar file ( preferably a SkyrimMods folder), click on it and then click Open. Then activate. Run the Installer of TESVSkyrim and then hit play.\r\nIf you have skse installed, rather than hit play, exit the installer and double click the skse.exe.\r\n\r\n\r\nThanks to bethesda for this epic game and to the release of the creation kit.\r\nThanks to all the modders who inspired me to start modding too,\r\nespecialy to Gopher whose method of installation of the compressed files in NMM has been a real lifesaver and also for the instructions of how to install the SKSE. All these are explained in his videos.\r\nhttp://skyrim.nexusmods.com/users/38219\r\n\r\nPlease visit my other mods too. Don\\'t forget to endorse.",
  "categoryId": "28",
  "version": "1.1",
  "author": "myself",
  "createdUnix": "1358955808",
  "updatedUnix": "1359066914",
  "containsAdultContent": false,
  "uploadedBy": "jetfalmer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004647",
      "name": "SmeltableSilverTableware",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "SmeltableSilverTableware-30358-1-1.rar",
      "uploadedUnix": "1359066914",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2779f2af67f8103ee6b6150e175543db21fb4e3d962f1a7ceda64564a6ae0ad6/analysis/1407377046/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SmeltableSilverTableware-30358-1-1.rar?fid=1000004647&ttl=1535805096&ri=8192&rs=8192&setec=7a72b17c203146a848588adaf4410863"
    }
  ]
}