{
  "modId": 30364.0,
  "modName": "Smeltable Iron Stuff",
  "summary": "Smelt pots small and medium, kettles, tankards, flagons, lanterns, woodcutter\\'s axes, pickaxes tongs, shovels heavy and light, hammers and clothes irons into iron ingots.\r\n\r\n",
  "descriptionHtml": "NEW SIMPLE VERSION \r\n\\\"Some may call this junk. Me, I call them treasures.\\\"\r\nA little mod made with the Creation Kit \r\n\r\nNow you can smelt iron stuff like pots, kettles, tankards, flagons, lanterns, woodcutter\\'s axes, pickaxes tongs, shovels, tongs, hammers and clothes irons into iron ingots.\r\n\r\nFIRST AND FOREMOST you must smelt all these into clothes irons. It\\'s the closest thing that seems like a lump of scrap iron.\r\nHeavy shovels and kettles are smelted directly to iron ingots.\r\nYou must smelt flagons into tankards Then smelt tankards to get iron ingots or if you don\\'t have enough of them smelt them to clothes irons. \r\n\r\nIf you have version 1.0 or 1.1 uninstall it.\r\n\r\nVersion 1.0\r\nSmeltable pots, kettles, clothes irons, tankards and lanterns in combinations.\r\n\r\nVersion 1.1 \r\nAdded smeltable flagons, woodcutter\\'s axes, pickaxes, tongs, shovels and hammers.\r\nAll these and the previous are melted down to clothes irons and then to iron ingots.\r\nIncreased base damage to pickaxes and woodcutter\\'s axes to 8 and 10 respectively and changed their weight to 6.\r\n\r\nVersion 1.2 \r\nCorrected the clothes irons smelted from woodcutters axes to 2. \r\n\r\n\r\nI\\'ve taken into account the weight values of the mod \\\\\\\"Skyrealism-Mass and Materials\\\\\\\" that I use.\r\nHere is the link:\r\nhttp://skyrim.nexusmods.com/mods/21724\r\n\r\nManual Installation (Gopher\\\\\\'s way):\r\n\r\nGo to NMM and click on add mod from file (the puzzle bit with the plus sign button at the upper left corner). Find the folder where you\\'ve put the downloaded .rar file (preferably a SkyrimMods folder), click on it and then click Open. Then activate. Run the Installer of TESVSkyrim and then hit play.\r\nIf you have skse installed, rather than hit play, exit the installer and double click the skse.exe.\r\n\r\nThanks to bethesda for this epic game and to the release of the creation kit.\r\nThanks to all the modders who inspired me to start modding too,\r\nespecialy to Gopher whose method of installation of the compressed files in NMM has been a real lifesaver and also for the instructions of how to install the SKSE. All these are explained in his videos.\r\nhttp://skyrim.nexusmods.com/users/38219\r\n\r\nPlease visit my other mods too. Don\\'t forget to endorse.",
  "categoryId": "28",
  "version": "1.2",
  "author": "jetfalmer",
  "createdUnix": "1358962639",
  "updatedUnix": "1359157485",
  "containsAdultContent": false,
  "uploadedBy": "jetfalmer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004853",
      "name": "SmeltableIronStuff",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "SmeltableIronStuff-30364-1-2.rar",
      "uploadedUnix": "1359157485",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/2cd6dcdf7763fb6792d258a19755100854947a96f23d99da691e60a7d1f81742/analysis/1407378693/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SmeltableIronStuff-30364-1-2.rar?fid=1000004853&ttl=1535805114&ri=8192&rs=8192&setec=7518a574cee84284c478ddbd42945319"
    }
  ]
}