{
  "modId": 30375.0,
  "modName": "Benevolent Wand Pack",
  "summary": "Wands. Stand-alone.",
  "descriptionHtml": "The Benevolent Bystander left a few fun things on the Wizard of Dragonsreach\\'s desk! This gift will blow you (and your enemies) away! Stand-alone Wand Pack.\r\nFor the most recent version, and the best description, go here and subscribe! http://steamcommunity.com/sharedfiles/filedetails/?id=122408595\r\n\r\nscripts : This one has no papyrus needs.\r\npowers : One of the casts is a shout, which registers as a shout, so yes, the courier thing will trigger. (at least, it should. come to think of it, haven\\'t tested it yet.)\r\ncharges : the wands do not use charges. they can be used ad infinitum. yes, that\\'s lore unfriendly. no, my care bucket is empty.\r\nperks : perks only affect them if the spells i will list are effected by perks. flames, frostbite, sparks, fus ro dah. the steam workshop version adds magelight, a custom spell \\\"sap\\\", and disarm. \r\nknown bugs : sometimes the wands roll off the table. if they\\'re not on the table, check on the floor. no idea what triggers it, don\\'t really care as it only happened once.\r\nbug fixes : workaround is promoted : use the mouse to look down, and pick the fallen wands off the floor. wipe them off, no harm done. if really dirty submerse in water for ten seconds, and wipe clean. repeat as needed.\r\nfuture plans : i am working on a big exploration/quest/story mod which will include its own wands (with more textures and new powers) and it is very likely that the current steam workshop version is the last version of the wand pack for a long time, if not ever.\r\ncooldowns : none! aside from two that aren\\'t even in the nexus version, they\\'re all concentrated, aimed. even the fus ro dah one. again, yes that\\'s lore unfriendly and no, still nothing in my care bucket.\r\nrecharges : none needed. not sure if they can interact with soul gems, as they shouldn\\'t need to, and thus shouldn\\'t.\r\nwordcasts : fus ro dah is the full fus ro dah, mixed with knockback. both are wickedly overpowered. i removed the actual \\\"fus ro dah\\\" shouting because when you keep the attack button down it\\'s a horrible mess of a noise to hear that. but the rest of the effects are there.\r\nSKSE : i heard of it, i don\\'t use it. i don\\'t papyrus too well.\r\nmodels/textures : shivs with scaling along the depth axis, x1 x1.5 and x2, with the metallic bit of the texture replaced with the wood bit of a wooden bow. because magic wand. the LTOKR questexplorationmod i\\'m working on will have much more badass textures.\r\nalpha/beta : this is end product.",
  "categoryId": "55",
  "version": "1.00",
  "author": "Wes Lesley - the Benevolent Bystander",
  "createdUnix": "1358979134",
  "updatedUnix": "1358989348",
  "containsAdultContent": false,
  "uploadedBy": "weslesley",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004464",
      "name": "IX wand pack",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "436",
      "fileName": "IX wand pack-30375-1-01.7z",
      "uploadedUnix": "1358989348",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/1013db785d5592c8bd24e607beef607c11bc8f2a1f91ffee82c1e32708b87f36/analysis/1407375970/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/IX%20wand%20pack-30375-1-01.7z?fid=1000004464&ttl=1535805139&ri=8192&rs=8192&setec=04f8a22e48f10ce786689b6648d0db5e"
    }
  ]
}