{
  "modId": 30388.0,
  "modName": "New Followers Ready for Action",
  "summary": "Want some more followers? Then check this out.",
  "descriptionHtml": "I originally made this for myself, but then I thought \\\\\\\"why not share it?\\\\\\\" So, here it is. \r\nThis is my first mod but it´s already been tested, so you shouldn´t have problems at all. \r\n\r\nWhat this mod does: It adds one follower of each race (well not actually, since I included two wood elves and two argonians), all scattered and placed in different TAVERNS of skyrim; you will be able to find them easily. I also assigned each follower a different class, perks and basic spells (yet not all followers know spells, which I decided to balance with more perks) to improve their combat efficiency, without giving them too much power. All of them are MARRIAGEABLE AND ESSENTIAL and will level up with you. This is a list of my custom followers:\r\n\r\n-Briet: Female nord, best with heavy armor and two-handed weapons. You will find her in Windhelm.\r\n\r\n-Cale: Female imperial. Useful with one-handed weapons and heavy armor. You will find her in Morthal.\r\n\r\n-Karshiva: Female argonian. You will find her in riverwood, near the river to be more precise.\r\n\r\n-Khorja: Female khajiit. Useful as a thief, if you need extra hands (LOL at me talking like Brynjolf). You will find her in Riften, inside Haelga´s Bunkhouse.\r\n\r\n-Loane: Female breton. Mage. You will find her in Winterhold.\r\n\r\n-Lunwen: Female high elf. You will find her in Solitude.\r\n\r\n-Marundil: Male wood elf. Should be a decent archer. You will find him in Falkreath.\r\n\r\n-Neruna: Female dark elf. Fights best with bows and one-handed weapons. You will find her in Dawnstar.\r\n\r\n-Nirnwen: Female wood elf. Archer. You will find her in Dragon Bridge.\r\n\r\n-Romeen: Female redguard. Makes good use of heavy armor. You will find her in Rorikstead.\r\n\r\n-Ronorak: Male orc. Juggernaut/heavy duty/badass or whatever you may call him. You will find him in Markarth.\r\n\r\n-Shadowfang: Inspired in a character created by a friend of mine, and the tip of the iceberg in this project. Male argonian, good marksman and assassin. Might want him as bodyguard. You will find him in Riften, inside the Bee and Barb.\r\n\r\nWell, there´s more I could tell you, but then it would have no fun. Find out what these followers can do by yourself.\r\n\r\nAll of them were created using vanilla textures, so NO OTHER MODS ARE REQUIRED.\r\n\r\nI might tweak these characters a little bit in the future, if they are either too powerful or too weak regardless my previous testing, or to make some aesthetic changes. But for now, enjoy!\r\n\r\n\r\nChangelog:\r\n\r\n-Edited Khorja, just changed the color of her fur and other minor aesthetic details",
  "categoryId": "33",
  "version": "1.0",
  "author": "lolwutS117",
  "createdUnix": "1358999885",
  "updatedUnix": "1359000328",
  "containsAdultContent": false,
  "uploadedBy": "lolwutS117",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004493",
      "name": "Follower Add-On",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Follower Add-On-30388-1-0.rar",
      "uploadedUnix": "1359000328",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4966c0a77424ebcb600769c013ffd0a4491b3267f887c9c5b04f5c10ffeef6af/analysis/1407376089/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Add-On-30388-1-0.rar?fid=1000004493&ttl=1535805154&ri=8192&rs=8192&setec=c1ba8131feec6563ba6b4d423e5d573d"
    }
  ]
}