{
  "modId": 30413.0,
  "modName": "Smeltable Coins and Wood Stuff",
  "summary": "Smelt gold coins to gold ingots and vice versa.\r\nSmelt buckets and brooms to Firewood.",
  "descriptionHtml": "A little mod I\\'ve made using the Cration Kit\r\n\r\n-Weight of gold coins is estimated from the dimensions of the exact septim replica that was made for oblivion (D=3.8cm or 1.5in, H=0.32cm or 0.125in and Volume of H*?[D/2]^2= 3.63cc) and the density of gold p=19.3gr/cc. So 1 coin = 0.07Kg or 0.15lb \r\n\r\nThe weight of 1 ingot is 27.4lb=12.43kg (skyrealism mass and materials)\r\nThe calculations I\\'ve done show that in order to get 1 gold ingot you have to smelt 178 coins.\r\n-The ingame price of the ingot was 100. I\\'ve changed the ingot\\'s price to 178 coins.\r\n\r\n-You can smelt 1 gold ingot to 178 coins too, so you get the full price than that of a shopkeeper.\r\n\r\n-Ingots can be made now from 6 gold ores and their price went to 30 coins. I wanted to depict the low content of gold in rocks but made it not too realistic for the sake of the game. \r\n\r\n-Coins have no weight as in vanilla because you would have like 150lbs more for just 1000 coins.\r\n\r\nAll in all things in skyrim are overpriced. 1 tankard for 2 gold? come on!\r\nif you had 150 grams or 0.15 pounds of gold you would be able to buy more than 1 tin tankard!\r\n\r\nAdditionaly you can smelt buckets or brooms to Firewood in different combinations. I use Frostfall so I need firewwood all the time to make fire kits. http://skyrim.nexusmods.com/mods/11163/\r\nI thought of smelting wooden bawls and plates, but firewood is used for armor and weapon making too, so it wouldn\\'t be lore friendly.\r\n\r\nI\\'ve taken into account the weight values of the mod \\\"Skyrealism-Mass and Materials\\\" that I use.\r\nHere is the link: http://skyrim.nexusmods.com/mods/21724\r\n\r\nManual Installation (Gopher\\'s way):\r\n\r\nGo to NMM and click on add mod from file (the puzzle bit with the plus sign button at the upper left corner). Find the folder where you\\'ve put the downloaded .rar file (preferably a SkyrimMods folder), click on it and then click Open. Then activate. Run the Installer of TESVSkyrim and then hit play.\r\nIf you have skse installed, rather than hit play, exit the installer and double click the skse.exe.\r\n\r\nThanks to bethesda for this epic game and to the release of the creation kit.\r\nThanks to all the modders who inspired me to start modding too,\r\nespecialy to Gopher whose method of installation of the compressed files in NMM has been a real lifesaver and also for the instructions of how to install the SKSE. All these are explained in his videos.\r\nhttp://skyrim.nexusmods.com/users/38219\r\n\r\nPlease visit my other mods too. Don\\'t forget to endorse.",
  "categoryId": "28",
  "version": "1.0",
  "author": "jetfalmer",
  "createdUnix": "1359043245",
  "updatedUnix": "1359043565",
  "containsAdultContent": false,
  "uploadedBy": "jetfalmer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004588",
      "name": "SmeltableCoinsAndWoodStuff",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "SmeltableCoinsAndWoodStuff-30413-1-0.rar",
      "uploadedUnix": "1359043565",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7bbf6bd337122efdaf099af3d56b1a20963be95a836d19d14d0f8eae75475f68/analysis/1407376689/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SmeltableCoinsAndWoodStuff-30413-1-0.rar?fid=1000004588&ttl=1535805205&ri=8192&rs=8192&setec=50027e1a0debd1710fa4e19736760c40"
    }
  ]
}