{
  "modId": 30479.0,
  "modName": "Legendary Daedric Artifacts",
  "summary": "Changes the base damage or armor of Daedric Artifacts(like Dawnbreaker or Ebony Mail) to their legendary stats(like when you upgrade them at a grindstone or workbench)",
  "descriptionHtml": "YOU HAVE PERMISSION TO USE THE FILES HOWEVER YOU WANT\r<br />I probably will not do any future work on this mod(Note that I consider this mod finished) feel free to edit them or do whatever you want with them&#33; You do not even have to credit me.(but I certainly would not mind if you did)\r<br />WHY I MADE IT\r<br />It never made sense to me that you could easily improve artifacts when most or all of them were made by Deadric Lords&#33;\r<br />WHAT IT DOES\r<br />Changes the base damage or armor of Daedric Artifacts(like Dawnbreaker or Ebony Mail) to their legendary stats(like when you upgrade them at a grindstone or workbench) it includes the Ebony Blade. And SHOULD remove the smithing recipes(Makes it where they can not be further improved at grindstones or workbenches) \r<br />The changes to their base damage go like this\r<br />Dawnbreaker 12 to 22\r<br />Mace of Molag Bal 16 to 26\r<br />Mehrunes&#39; Razor 11 to 21\r<br />The Rueful Axe 22 to 32\r<br />Volendrung 25 to 35\r<br />Ebony Blade 11 to 21\r<br />and the changes to the base armor rating go like this\r<br />Ebony Mail 45 to 65\r<br />Masque of Clavicus Vile 31 to 33\r<br />Savior&#39;s Hide 26 to 46\r<br />Spellbreaker 38 to 48\r<br />\r<br />WHAT IT DOES NOT DO\r<br />It does not change the enchantments on the items or effect the daedric staves and rings. It does not change the speed, weight, or value of the weapons. It does not say (LEGENDARY) next to the items(which is intentional).\r<br />\r<br />IMPORTANT\r<br />This MAY make your corresponding weapon skills level faster because it changes the base damage. I do not know of any way around this.\r<br />\r<br />FUTURE PLANS(I probably will not work on this mod anymore but others can if they want)\r<br />Possibly make an optional version where their base damage or armor is equal to their normal daedric counter-parts and possibly another optional version after that which makes their base damage equal to their dragon-bone counter-parts.\r<br />\r<br />BUGS\r<br />I do not know of any. If you find some please report them to me.\r<br />\r<br />A BIG THANKS TO\r<br />senterpat who helped a lot with ideas, suggestions, and told me how to do some of the stuff that I did not know how to do&#33;\r<br />Eshlix who made a batch file that save me a lot of time in making this mod. http://skyrim.nexusmods.com/mods/6184 \r<br />\r<br />\r<br />\r<br /> ",
  "categoryId": "55",
  "version": "1.0",
  "author": "Dantw",
  "createdUnix": "1359164858",
  "updatedUnix": "1359164806",
  "containsAdultContent": false,
  "uploadedBy": "dantw",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004870",
      "name": "Legendary_Artifacts",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Legendary_Artifacts-30479-.rar",
      "uploadedUnix": "1359164806",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f688717bb205e697d6a076b33c7d2fd238397cef7cde3de890a7b356ce01db66/analysis/1407378842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary_Artifacts-30479-.rar?fid=1000004870&ttl=1535805330&ri=8192&rs=8192&setec=ad902074514496ea084202426f415518"
    }
  ]
}