{
  "modId": 30482.0,
  "modName": "Falmer Servant Respawn And Believable Equipment",
  "summary": "Adding a little more immersion to the falmer\\'s servants.",
  "descriptionHtml": "I felt that it was odd that the Falmer\\'s slaves/servants were only encountered in Blackreach, and even more odd that they all wore pretty much the same clothes and had iron weapons.  Being as these would be people captured during the Falmer\\'s surface raid mentioned occasionally in-game, and then forced to work for their blind masters, it stands to reason that the Falmer would mistrust them, and remove all their slave\\'s possessions, so as to avoid them being any threat.  However, human nature dictates that people tend not to enjoy being naked in public, so I thought to myself, \\\"If I was captured, stripped, and forced to work as a slave by blind degenerate elves, what would I do for warmth, defense, etc.  The answer was... scavenge!  Seeing as how these poor folks are only encountered in a dilapidated ruin of a Dwarven city run by the Falmer, the only things they would be able to get a hold of would be rags (from rugs/tapestries/etc, Falmer-style apparel and weapons made from domesticated Chaurus chitin, and leftover dwarven items.  And so this mod was born!\r\n\r\nWhat this does:\r\n~Falmer servants now respawn\r\n~Added Falmer servant spawn points in some of the deeper areas of Falmer-controlled Dwarven ruins\r\n~Edited the Falmer servant\\'s inventory, which is a randomly generated mix of beggar\\'s clothes, prisoner\\'s clothes, falmer armor/weapons, dwarven armor/weapons, and a few non-outfit-specific bits and pieces\r\n\r\nNotes:\r\n-Does NOT require any other mods or DLCs\r\n-I DIDN\\'T give them the chance to spawn with:\r\n     ~Dwarven Helmet (Their masters obviously wouldn\\'t their slaves heavily equipped)\r\n     ~Dwarven Armor (Same As the helmet)\r\n     ~Dwarven Shields (Same as helmet & armor)\r\n     ~Falmer Helmets (They cover the eyes, implying that they are blind, and what use has a blind master for a blind slave?)\r\n     ~Two handed weapons (Why would a slave/servant be given a giant weapon?)\r\n     ~Bows/Arrows (Why would a blind degenerate elf trust a slave with a ranged weapons)\r\n     ~Dawnguard Falmer Armors (I see these as a higher end armor only used by the most powerful of the Falmeri warriors)\r\n\r\nBugs: None that I am aware of, but it may conflict with mods altering the Falmer servant\\'s inventory.\r\n\r\nConstructive criticism, advice, thoughts, ideas and the such are all welcome!",
  "categoryId": "33",
  "version": "1",
  "author": "Jyggalagman",
  "createdUnix": "1359166258",
  "updatedUnix": "1359166050",
  "containsAdultContent": false,
  "uploadedBy": "jyggalagman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004872",
      "name": "FalmerArmorOverhaul",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "FalmerArmorOverhaul-30482-1.rar",
      "uploadedUnix": "1359166050",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8bf307ea48c9cf85b7d54378836976ebf05bd14065ef5a07dffefc316c81ccb5/analysis/1407378842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FalmerArmorOverhaul-30482-1.rar?fid=1000004872&ttl=1535805337&ri=8192&rs=8192&setec=76ffb50f99486358beb4bd363327881a"
    }
  ]
}