{
  "modId": 30493.0,
  "modName": "Jehennian Leather Cuirass",
  "summary": "adds leather cuirass from north eastern high rock  as a craftable item.",
  "descriptionHtml": "Morning Star 26 4E 202\r\n     Erandur and I plan on taking a carraige tomorrow back to Dawnstar, where we will stay for a week or so and get our affairs in order before our long trip. I\\\\\\'m anxious to return to there. As cold as it is, the people are all hard working folks and honest people. The docks bring in some interesting stuff. Just recently, a large crate full of leather armor came in from Jehenna, on the northeastern shore of High Rock. I got myself one and it is great craftsmenship I must admit. Although I see them all around now, the armorers in Skyrim must be trying to mimic the style. I got Ysolda a few of them, so she\\\\\\'d that she could be The first to have any in Whiterun.\r\n I think we have to sail first to Windhelm, and switch at the docks. Windhelm is a miserable place, but the last time we were there we found a nice little cornerclub in the Grey Quarter. It\\\\\\'ll be nice to stop there if we have to stop off in that horrible city. Last time I was there, there was anothe imperial named Sam that wanted to challenge me to a drinking contest. Maybe I\\\\\\'ll take him up on that. Although, if I get too drunk I\\\\\\'m liable to just march right into the so called \\\\\\\"Palace of Kings\\\\\\\" and shove a dagger in Ulfric Stormcloak face. \r\n   ",
  "categoryId": "54",
  "version": "1",
  "author": "Franklin Zunge",
  "createdUnix": "1359191405",
  "updatedUnix": "1359215683",
  "containsAdultContent": false,
  "uploadedBy": "FranklinZunge",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004995",
      "name": "Jehennian Leather Loose",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7575",
      "fileName": "Jehennian Leather Loose-30493-1-01.7z",
      "uploadedUnix": "1359215683",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/a58fc7c0783a10c950b67880a37a4d23711cceee12c82fb159f71e9054a3d05a/analysis/1407380656/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jehennian%20Leather%20Loose-30493-1-01.7z?fid=1000004995&ttl=1535805364&ri=8192&rs=8192&setec=fbc1f808aa16def16b5ee18b8d4a40b5"
    }
  ]
}