{
  "modId": 30500.0,
  "modName": "The Sword of Fuck em All",
  "summary": "When I decided to start modding I knew I was going to be stupid. \r\nIntroducing THE SWORD OF FUCK\\\\\\'EM ALL, a craftable katana that uses the unfamous \\\\\\'Get The Fuck Away\\\\\\' spell on its unlucky targets with an Inception-like BWOOOOOOOOOOOM sound! \r\nA deadly swing will result in a classic SoulTrap, a non-deadly one will push those fuckers away fr",
  "descriptionHtml": "------------------------------------------------------------------- \r\n3rd UPDATE! \r\nAfter months I finally decided to fix the finishing-moves bug. Now you\\\\\\'re free to cut-off heads and stuff without any bug occuring, while still BWOOOMing the fuckers away with normal hits! \r\n------------------------------------------------------------------- \r\n2nd UPDATE! \r\nAdded a corpse at the end of the seven thousand steps which contains a note with the materials you need to craft the Sword of Fuck\\\\\\'em All (plus some stupid stuff).\r\n------------------------------------------------------------------- \r\n1st UPDATE! \r\nDisenchanting the Sword of Fuck\\\\\\'em All now gives you the proper \\\\\\'Get The Fuck Away\\\\\\' enchant knowledge, so you can enchant normal weapons (and bows too!) and make them BWOOOOM while your targets fly away in tears. \r\n------------------------------------------------------------------- \r\n\r\nWhen I decided to start modding I knew I was going to be stupid. \r\nIntroducing THE SWORD OF FUCK\\\\\\'EM ALL, a craftable katana that uses the unfamous \\\\\\'Get The Fuck Away\\\\\\' spell on its unlucky targets with an Inception-like BWOOOOOOOOOOOM sound! \r\nA deadly swing will result in a classic SoulTrap, a non-deadly one will push those fuckers away from you. VERY far away from you. \r\n\r\nPerks required: \r\n- Daedra Smithing \r\n- Orchish Smithing \r\n\r\nItems required in order to craft it (you\\\\\\'ll find it under the Daedra weapons tab): \r\n- 1 Ebony Ingot \r\n- 1 Orichalcum Ingot \r\n- 1 Daedra Heart \r\n- 1 Black Soul Gem \r\n- 1 Ale \r\n\r\nItems required in order to improve it: \r\n- 1 Ebony Ingot \r\n- 1 Orichalcum Ingot \r\n\r\n\r\nCity guards piss you off? \r\nThrow those fuckers over the city walls or watch them roll down a cliff. Or just play squash with their bodies until they\\\\\\'re dead. \r\nFus Ro Dah was just the beginning. \r\nThe Sword of Fuck\\\\\\'em All is here now. \r\nBWOOOOOOOOOOM! \r\n\r\n------------------------------------------------------------------- \r\nNOTE! \r\nFor those of you concerned with the weapon damage: I\\\\\\'ve updated the screenshot as you can see above: I managed to get the weapon damage to 476. Please consider that the base damage for this sword is 80, which is already A LOT considering that the base damage for the Daedric Sword is just 18. All the extra damage comes from my perks and the items I wear. I made myself a couple of sets based on the kind of weapon I want to use, so for sword fighting I got every possible item (ring, necklace, gauntlets, etc) enchanted with one-handed damage bonus, plus I used a couple of potions before upgrading the sword at the blacksmith AND my enchanted blacksmithing set. No cheats used! And I didn\\\\\\'t want to use the potion/enchant/upgrade/potion trick because I\\\\\\'m too lazy, so damage could be even much more higher. \r\nAt first the base sword damage was way higher than this, but it was no fun at all. I prefer to throw my enemies away and laugh watching them trying to come back to me for the next round of BWOOOOOMness :) \r\n------------------------------------------------------------------- \r\nCOMPATIBILITY ADVICE! \r\nSomeone pointed out that this mod isn\\\\\\'t compatible with \\\\\\\"No Requirements Weapon Crafting!\\\\\\\" mod. I\\\\\\'m not looking into this issue because I made high crafting requirements for this weapon on purpose: it\\\\\\'s meant to be a funny (or just silly) \\\\\\\"reward\\\\\\\" for non-cheaters, for people who have spent a lot of time increasing their skills and now just want to chill out and have some fun throwing people around. BWOOOM isn\\\\\\'t cheap. <3",
  "categoryId": "55",
  "version": "1.4",
  "author": "zappeo",
  "createdUnix": "1359206502",
  "updatedUnix": "1359206502",
  "containsAdultContent": false,
  "uploadedBy": "zappeo",
  "primaryFile": null,
  "files": []
}