{
  "modId": 30549.0,
  "modName": "Dragonborn Worship",
  "summary": "Are you feeling unappreciated as the Dragonborn?  Take as many followers as you can to the Blackreach  Warquarters.  Order them to relax for a bit.  Sit down in the short dwemer chair and enjoy the show.  I use EFF to manage my many companions.  A key to connect you back to Breezehome is in the next room in the corner.  The door is on the floor.",
  "descriptionHtml": "   This mod is most interesting if you can move a small army into the War Quarters, say 8-30 followers depending on your rig, and tell them to relax via other mods.  Companions will only sandbox (use idles) if they are instructed to relax or live in the War Quarters in Blackreach via other mods like EFF.  This mod does not add anything new to Skyrim including followers. Although there are many cool followers in the screenshots, this mod provides none.  This is not my first mod, just the first mod I have added to the Nexus.  [font=Helvetica, Arial, sans-serif][color=#1d2129] [/color][/font]\r<br />\r<br />Dragonborn Worship update log:\r<br />v1.2  Well now this is a new mod.   I added lay down spots to the War Quarters and it has become place of worship for the living Dragonborn.  Bring as many followers as you can (10 or more works best) to the War Quarters and tell them to relax.   You can also set this area as home to followers to get the lay down effects to work.  Multiple follower, follower relaxation and setting a new home can be accomplished through various follower mods on the Nexus.  I use EFF.\r<br />v1.1  Added a key in the War Quarters to unlock the door.   You must first find the War Quarters to use the door.  The key is in a strong box, in a corner, near the new door, on the floor of the War Quarters which are not locked by default.   The location of the War Quarters is Wikiable.   This was changed to prevent possibly breaking Blackreach descent quests by approaching from the wrong direction.  \r<br />As a side note, the War Quarters are not part of any quest at this time so go ahead and move in.  I changed nothing in the War Quarters to create safe storage.  The War Quarters make a nice addition to Breezehome.\r<br />v1.0  There is not much to this mod.  Just an .esp file that adds a door to Blackreach.  It is on the floor in the kitchen.\r<br />\r<br />Requirements:\r<br />    Skyrim esm.  update.esm\r<br />\r<br />Recommended: \r<br />   EFF http://www.nexusmods.com/skyrim/mods/12933/?\r<br />\r<br />Installation: \r<br />   Download with Mod Organizer / Nexus Mod Manager or copy WarQuarters Breezehome Door to Skyrim Data file and check the box in the data files at start.\r<br />\r<br />Conflicts:  \r<br />        Hearthfires- Potential CTD.  I will update this soon.  Load this mod after my mod or any other mod that changes the Navmesh is Breezehome.  http://www.nexusmods.com/skyrim/mods/27053/?\r<br />        Warquarters- This mod will/might conflict with any other mod that changes the Warquarters in Blackreach.   \r<br />   Breezehome- Load this mod before any mod that changes Breezehome in Whiterun.  Only one small dwemer door is added to the floor there.\r<br />\r<br />Even more fun:  \r<br />   &#34;Data/meshes/actors/character/animations/laydown.hkx&#34; & &#34;Data/meshes/actors/character/animations/idlepraycrouched_loop.hkx&#34; are two files that are not used very often in skyrim.  Rename any .hkx file you like and put the animation into the file paths of your skyrim/data folder with the paths I just outlined.  Create a folder if you don&#39;t already have one.  This will change every kneel pray and laydown vanilla animation in the game but it doesn&#39;t break any quest or CTD.\r<br />\r<br />Creation Kit tutorial on How to get followers to follow you through a door in a mod where they won&#39;t follow you through a door: \r<br />      In my mod, followers will take the very long way around, through Blackreach, to get to the Warquarters.  If you want to change this mod so the followers go through the same door you do, the one I added to the floor in Breezehome, here is how to do it.  The Creation Kit is buggy. Saving your progress after each step is a good idea but not necessary.  Don&#39;t change the name of the mod upon saving unless you want to create a new and separate mod from the original, which is ok too.\r<br />\r<br />1.  Open the CK with my mod installed and click FILE/DATA/Warquarters Breezehome Door.esp(double click) in the Creation Kit window (One of four). \r<br />2.  Check the box that says &#34;Set as active file&#34; then click OK\r<br />3.  Cleck &#34;yes to all&#34; and &#34;ignore&#34; until you have no more messages and can access the tabs.\r<br />4.  The four windows should be more populated now.  Find the one labeled &#34;cell view&#34;.\r<br />5.  The cells in the window of the &#34;cell window&#34; should all be interior cells by default.  If you see outdoor areas listed, use the &#34;world space&#34; selector near the top to choose &#34;interior&#34;.  \r<br />6.  Click on any cell listed to highlight it.\r<br />7.  Press the letter &#34;b&#34; one time.\r<br />8.  Scan trough the b list until you find Blackreach Warquarters.  It won&#39;t take long.  Right click that cell and select &#34;view&#34;.   Whoa&#33;  Popups&#33;  Click &#34;yes to all&#34; and &#34;ignore&#34; on the popups until images appear in the separate window titled &#34;render window&#34;.  Continue &#34;yessing&#34; and &#34;ignoring&#34;.  There are usually a few pop ups.\r<br />9.  Highlight something, anything by single clicking anywhere in the &#34;render window&#34;.  This enables tabs for the navmesh tool to open.  A tool you won&#39;t even need to figure out, don&#39;t click on it.  It is just a tool bar with no window.\r<br />10.  Press Ctrl E.  This toggles on and off the navmesh tool.  Straight red lines will appear all over the &#34;render window&#34;.  There are three eyes up near the &#34;file tab&#34; you clicked in the first step.  Toggling these eyes will change the mesh views if you don&#39;t see any red lines.  Doesn&#39;t really matter which view you have, make sure you see straight red lines.\r<br />11.  Click the &#34;navmesh&#34; tab.  It is also in the same window and row as the &#34;file&#34; tab from the first step.\r<br />12.  From the options click on &#34;finalize cell meshes&#34;.  Wait until you can highlight something again by single clicking objects in the &#34;render window&#34;.  If you can highlight something, the navmesh process is complete.  It should not take more than about 5 seconds with this mod.  Triangles under the yellow refrigerator boxes with a pyramid for a nose, near the doors, will be green instead of red.   The green triangles under these boxes means they are ready for followers to follow your character through the door.   Shift + mouse functions allow you to look around in the &#34;render window&#34;.   BE CAREFUL- Investigating the work you just did can get you lost in a void of blank images -IF- you are not proficient at navigating the render window.  No biggie. You didn&#39;t ruin your work.  Just move to the next step if this happens.\r<br />13.  Save, again don&#39;t change the name.\r<br />14.  Repeat steps 7-13 only with the letter &#34;w&#34; for &#34;Whiterun Breezehome&#34;.\r<br />15.  Exit Creation Kit and go play Skyrim.\r<br />\r<br />Your followers will now use the same door that you use.  IF you cheat by unlocking the door with console command &#34;unlock&#34;, your followers won&#39;t follow you UNTIL you open up the pathways to Blackreach through the regular Bethesda routes, OR you finalize the navmesh of this mod in Breezehome and the Warquarters.\r<br />\r<br />Question:  Dude, wouldn&#39;t it be easier for you to just do all these steps and add it to your mod?\r<br />Answer:  My version of this mod no longer resembles this mod as I have modded the crap out of my own mod.  So, no it would not.\r<br />\r<br />Question:  Share?\r<br />Answer:  No\r<br />\r<br />Question:  Why not just provide a link on how to fix a door. \r<br />Answer:  This mod is good practice.  Save the original .esp somewhere, or download the mod a second time, so you can start over, if you totally botch the job.  If you were successful at modding my mod, the followers will appear right behind you or near you when you travel back and forth from Breezehome to the Warquarters in Blackreach.  Without modding my mod they will race to you, after a small wait, from the other side of the room. If you haven&#39;t traveled to the vast main area of Blackreach yet by the normal routes, your followers will not appear.\r<br />\r<br />Thanks for downloading.  Have fun.",
  "categoryId": "40",
  "version": "v1.2",
  "author": "Fossmana",
  "createdUnix": "1359287267",
  "updatedUnix": "1360020110",
  "containsAdultContent": false,
  "uploadedBy": "fossmana",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000005174",
      "name": "Breezehome door to Blackreach",
      "version": "v1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Breezehome door to Blackreach-30549-v1.zip",
      "uploadedUnix": "1359285432",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/12671d717663757e6b958abb31ed93259f81676ee1476016abb7657262be7c9e/analysis/1407381546/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20door%20to%20Blackreach-30549-v1.zip?fid=1000005174&ttl=1535805465&ri=8192&rs=8192&setec=c7763098cb56528581f40ea73ebecbad"
    },
    {
      "fileId": "1000005486",
      "name": "War Quarters access from Breezehome",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "War Quarters access from Breezehome-30549-1-1.zip",
      "uploadedUnix": "1359378364",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ffa7c884049e9ded9b54ef91a71f2ed9fa7fd96bc58993121c2cc874162cf372/analysis/1407383766/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/War%20Quarters%20access%20from%20Breezehome-30549-1-1.zip?fid=1000005486&ttl=1535805465&ri=8192&rs=8192&setec=d31e3e951d4ec457bc770ed26ae4c7b4"
    },
    {
      "fileId": "1000007132",
      "name": "Worship the Dragonborn",
      "version": "v1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Worship the Dragonborn-30549-v1-2.zip",
      "uploadedUnix": "1360020110",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/742acd6a26e6247943753a23011c26011150950e894eff85f7887720038a8dd3/analysis/1407397714/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Worship%20the%20Dragonborn-30549-v1-2.zip?fid=1000007132&ttl=1535805466&ri=8192&rs=8192&setec=f8ab61c038467150a2dd5a52525558df"
    }
  ]
}