{
  "modId": 30570.0,
  "modName": "Mages Kitchen",
  "summary": "Adds a full Kitchen to the Hall of Attainment in the Mage&#39;s College\r<br />And optional file adds changes to ArchMage Quarters",
  "descriptionHtml": "[color=#ff00ff][size=6]Kursan Presents: Mages Kitchen   \r<br />\r<br />                                    [img]http://i.imgur.com/VFlvwAI.png[/img] [/size][/color]\r<br />\r<br />[color=#00ffff][size=3]Description:\r<br />\r<br />At last I got to play a mage and what, no place to cook in the mages college?\r<br />No wonder all those mages look so gaunt and starved&#33;\r<br />\r<br />This mod adds a complete kitchen (except the sink) in the upstairs \r<br />Hall of Attainment in the Mages College of Winterhold.\r<br />\r<br />I used one of the alcoves that had absolutely useless storage crates in it,\r<br />all the usable food barrels that were there got simply moved in the hall or next door.\r<br />The Kitchen features many labeled storage barrels and 3 of them respawn because\r<br />their contents are hard to find in game, they are: Butter Milk and Chicken eggs all\r<br />needed for baking and there is a bread oven in the kitchen.\r<br />There is a cooking spit before a large fire place and besides those functional items \r<br />a bunch of decorative clutter one might find in a kitchen.\r<br />\r<br />The Mages actually will come by and use the kitchen at random.\r<br />\r<br />On the outside I added a wood chopping block in the yard.[/size][/color]\r<br />\r<br />\r<br />[color=#cc4125]Now there is an optional version that makes some changes to the ArchMages Quarters&#33;\r<br />I felt that those living quarters were really drab and cold feeling; I know there are other mods that improve the ArchMages Quarters, this is my interpretation of a more welcoming and cozier living space, I hope you like it. The additions are not over the top and more aimed at luxury versus the usual &#34;show off my loot&#34; lay out. \r<br />1.1 makes the following changes to the ArchMages Quarters:\r<br />Adds two fire places, one to cook and one more ornamental one for heat and looks by the bed.\r<br />Changes location of bed, necessary for fire place location logistics.\r<br />Adds an ornamental tub with steaming water. \r<br />Adds several heat sources for comfort and looks.\r<br />Adds 9 standing weapon racks, perfect for staffs.\r<br />Adds 3 library type Bookcases, one empty plus one more open bookshelf.\r<br />Adds many rugs to cover the cold stone floor.\r<br />Adds some wall decorations and draping.\r<br />Adds one more small display case.\r<br />Moved some existing furnishings around to work better with the layout.\r<br />Deleted unnecessary clutter, i.e. useless baskets etc.\r<br />There are NO mannequins or wall mounted plaques and I will not take requests for any, sorry. \r<br />You can find that file here[/color][color=#9900ff]:[/color] [url=http://www.nexusmods.com/skyrim/mods/48806/?]http://www.nexusmods.com/skyrim/mods/48806/?[/url]\r<br />\r<br />[color=#ffd966][size=3]Dependencies:\r<br />This mod requires Hearthfires dlc because of the bread oven and new ingredients&#33;\r<br />\r<br />Compatability:\r<br />This mod should be compatible with other mods that make changes to the college or the Arch-Mage quarters in particular unless they affect the exact same room in the Hall of Attainment, which is a fairly small area.\r<br />\r<br />Credits:\r<br />Thanks to Bethesda for Skyrim. \r<br />Special thanks to Shezrie who&#39;s wonderful kitchens have been an inspiration since Morrowind.\r<br />\r<br />Liability:\r<br />\r<br />None, use this mod at your own risk, always save a back up before installing a new mod&#33;\r<br />Most game malfunctions are due to interaction of mods not one particular mod. [/size][/color]",
  "categoryId": "78",
  "version": "1.1",
  "author": "Kursan",
  "createdUnix": "1359311985",
  "updatedUnix": "1386996397",
  "containsAdultContent": false,
  "uploadedBy": "Kursan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086685",
      "name": "Mages Kitchen",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38",
      "fileName": "Mages Kitchen-30570-1.zip",
      "uploadedUnix": "1386996397",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/c4302d6480ca575467584c0fb22583f1f219ea73bf83095a44bad02be41770fa/analysis/1407836166/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mages%20Kitchen-30570-1.zip?fid=1000086685&ttl=1535805497&ri=8192&rs=8192&setec=87d720d5e487e3559781c07e304e8bcf"
    }
  ]
}