{
  "modId": 30587.0,
  "modName": "Better Dwemer Exteriors",
  "summary": "Have you ever wished that the ancient Dwemer ruins of Skyrim were as big as they were in Morrowind? Do you miss their often sprawling exterior zones and multitudes of proud towers? This mod fixes this, adding towers, rooms, various buildings and rubble, and more! ",
  "descriptionHtml": "Have you ever wished that the ancient Dwemer ruins of Skyrim were a little... I dunno... Bigger? \r\nDo you miss the Dwemer ruins of Morrowind, with their often sprawling exterior zones and multitudes of proud towers? I know I do.\r\n\r\nThe Dwemer are often described as  free-thinking yet reclusive clans devoted to the secrets of science, engineering, and the arcane. Also, they were described as careful, intelligent, and masters of industry. Yet in Skyrim, their ruins give them no justice. Look at Dwarven ruins scattered throughout Morrowind? The Monoliths, giant, protruding gears and pipes, and enormous towers are how these ruins are supposed to look like. They are supposed to be imposing, ginormous structures built by an ancient, and somewhat superior race, and that\\'s what this mod fixes.\r\n \r\nThis mod, quite simply, augments the exteriors of most of the Dwemer ruins found throughout Skyrim, by adding more towers, more structures, imposing walls, heaps of rubble, and all manner of extra details, Including a new building in Mzulft called \\\"Mzulft Broken Tower\\\"\r\n\r\nThe ruins that are affected by this mod include:\r\n-Bthalft \r\n-Bthardamz\r\n-Irkngthand\r\n-Kagrenzel\r\n-Mzinchaleft\r\n-Mzulft\r\n-Raldbthar\r\n-Reachwind Eyrie\r\n\r\nHere\\'s a link to a video featuring my mod, done by BDMods:\r\nhttp://www.youtube.com/watch?v=r8sP3gIGsU8&feature=youtube_gdata_player\r\n\r\nEvery update for this mod will include more and more additions to Dwemer ruins exteriors around skyrim, so be sure to endorse this mod if you think it\\'s worth downloading, and don\\'t forget to tell your friends!! :)",
  "categoryId": "74",
  "version": "1.0",
  "author": "skillest",
  "createdUnix": "1359328032",
  "updatedUnix": "1359325017",
  "containsAdultContent": false,
  "uploadedBy": "skillest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000005327",
      "name": "Better Dwemer Exteriors",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "102",
      "fileName": "Better Dwemer Exteriors-30587-1-0.rar",
      "uploadedUnix": "1359325017",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e03801cd10555443961251d785b705a6a771dd164715a5d24d94e251f83a867c/analysis/1407382710/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Dwemer%20Exteriors-30587-1-0.rar?fid=1000005327&ttl=1535805533&ri=8192&rs=8192&setec=2f25ba51a9be80b7015f40c620dfe4e4"
    }
  ]
}