{
  "modId": 30614.0,
  "modName": "Templars Weapon set",
  "summary": "Templar themed weapons in Skyrim.",
  "descriptionHtml": "1/28/2013 Lord Banewrath Sunblade\r\n\r\n This mod adds brand new custom weapons to the game. Two new templar swords in one hand and two hand versions.\r\nTwo new templar hammers in one and two handed versions. The hammer was in the release of my previous mod but I \r\ndid a few texture updates and made a special two handed version because it was requested.I decided to integrate \r\nthe hammer mod into the swords mod and build upon it from there. I plan on adding more new custom models as my \r\nexperience with making new meshes and texturing improves. These are brand new models that use existing skyrim texture assets.\r\n\r\n The weapons have two different types. Each weapon has a regular steel counterpart that can be crafted and\r\ntempered in the normal steel smithing tab. The higher quality weapons are equal to daedric in power and can\r\nbe upgraded at the skyforge while being classed as silver weapons that will do enhanced damage to undead foes. These\r\nhigher quality weapons are only found as loot and I placed only a few in the gameworld. I also decided to experiment \r\nand give the bsa builder tool in the ck a try. Now there are no more meshes and texture folders, just the esp and the bsa\r\nto drop into your data folder and that should ease installation more.\r\n\r\n The higher quality versions can be found in these locations.\r\n\r\nThe Shrine of Talos interior cell\r\nVolunruud\r\nMovarths Lair\r\nFrostflow Lighthouse Abyss\r\nFort Neugrad\r\n\r\n\r\n You may not alter or use the assets from this mod without permission. You MAY translate it to your language\r\nand upload it to your national modding site, because I know you are just going to do it anyway. User beware though,\r\nI only make my mods in english and if you download a different language version from a different site and your pc \r\nexplodes or you get a virus, Don`t say I didn`t warn you. I only host my mods on the Nexus.\r\n\r\n So until the next update, enjoy the weapons and have a good day. \r\n\r\n \r\n\r\n      Version 2 update 1/29/2013\r\n\r\n   A new battlehammer was added. A new one handed hammer, and two handed hammer. All weapons are added to the steel crafting \r\nlists along with three new unique daedric quality weapons found in the folloing cells.\r\n\r\nRavenscar Hollow\r\nTovolds Cave\r\nseptimus outpost\r\n\r\n\r\n     Version 3 update 2/1/2013\r\n\r\n    Version 3 adds two new templar themed shields. One kite and one tower type. Two new maces have been created and added. One \r\nspiked mace and one flanged mace. Two new swords added. One bastard sword and one claymore. Two new hammers added. One single \r\nhand and one two handed. The new items have been added to the following cells.\r\n\r\nTrevas Watch\r\nValthume\r\nRimerock Burrow\r\nLunds Hut\r\nDrelas Cottage\r\nForsaken cave",
  "categoryId": "55",
  "version": "3",
  "author": "Lord Banewrath Sunblade",
  "createdUnix": "1359359874",
  "updatedUnix": "1359777072",
  "containsAdultContent": false,
  "uploadedBy": "hammerhorde",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000006465",
      "name": "Templar weapons",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7165",
      "fileName": "Templar weapons-30614-3.7z",
      "uploadedUnix": "1359777072",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/31f1838c74bd0cfa77c6a51e5720d0acd2e77b2b8cf959f2ad32d512c508f848/analysis/1407391928/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Templar%20weapons-30614-3.7z?fid=1000006465&ttl=1535805565&ri=8192&rs=8192&setec=1f00ab6ab9a95622ae6103d2c03e06eb"
    }
  ]
}