{
  "modId": 30644.0,
  "modName": "Dovahkiin of the Dead Trailer",
  "summary": "Trailer Only",
  "descriptionHtml": "Hello, this is the trailer for the Machinima Project “Dovahkiin of the Dead.” All episodes will be placed on a different page and this one removed after the release of Episode 1 along with relevant content as they become available. This is the second Machinima Project that I am leading. Some of you might already be familiar with New Vegas: BLITZKRIEG.\r\n\r\nDovahkiin of the Dead: The series focuses around a mage named Gary who was hired by the Aldmeri Dominion to clear a Dwemer Ruin of zombies. Instead of hiring a bunch of mercenaries this mage had an idea to clear the ruin for free and this idea just so happens to be way more entertaining. Why hire mercenaries when you can just send out a bunch of letters to adventurers and then teleport trap them inside the ruins when they come to investigate? Then afterwards, you watch from the safety of a zombie proof bunker as hundreds of misinformed idiots die horribly at the hands of a zombie horde while clearing the ruin for you. The series will focus on Dovahkiin’s attempts to clear the ruin of a zombie horde while being mercilessly bashed by Gary as he watches in amusement at the carnage.\r\n\r\nIf the video link does not work, I attached a downloadable version for your connivance. \r\n",
  "categoryId": "45",
  "version": "",
  "author": "jcdenton2012",
  "createdUnix": "1359412490",
  "updatedUnix": "1359412135",
  "containsAdultContent": false,
  "uploadedBy": "jcdenton2012",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000005580",
      "name": "DOD Trailer",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8180",
      "fileName": "DOD Trailer-30644-.rar",
      "uploadedUnix": "1359412135",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c834ab2d66658026cf338e683651662e29e802a8f308ba7c53223078c30df4ca/analysis/1407384557/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DOD%20Trailer-30644-.rar?fid=1000005580&ttl=1535805625&ri=8192&rs=8192&setec=9633d8bd06eb51ff0a44d022b814aa03"
    }
  ]
}