{
  "modId": 30670.0,
  "modName": "Skov Klan Hjem",
  "summary": "Skov Klan Hjem situated near the Half Moon Mill, is an abode suited for those with a small army to house or for adventures who require, just for themselves, a residence large enough but modest at the same time, without the feeling of being overwhelmed.",
  "descriptionHtml": "Skov Klan Hjem (Forest Clan Home) is an abode perfectly suited for those who wish to house their small army of growing followers in one place.\r<br />It is also great accommodation for adventures who require, just for themselves, a residence large enough to show importance but being modest at the same time, without you feeling overwhelmed.\r<br />\r<br />[img]https://dl.dropbox.com/u/102991470/SkovKlanHjem.jpg[/img]\r<br />\r<br />Located a short walk from the Half Moon Mill is where you will find the Hjem.\r<br />Entry will require the use of a key found on a barrel right of the entrance next to the stable. This key will unlock the front and back doors. Accompanying the key is a note with a short back story.\r<br />\r<br />Below are the four main areas to use and explore.\r<br />\r<br />Skov Klan Hjem -\r<br />Surrounding the outside of the Hjem is a covered smithery, stabling for several horses and an archery range.\r<br />Inside you will find a large hall to relax in with its own bar and keeper, Helki.\r<br />Above can be found a private and personal space with a small but practical, alchemy and enchanting room.\r<br />Finally a war room, just off to the main hall with stairs to the basement, is the great area for planning you next adventure.\r<br />\r<br />Skov Klan Basement -\r<br />This lower area boasts plenty of storage, ample sleeping for a small clan, armoury with crafting capabilities, bathing room and access to Javik&#39;s Tower and Skov Klan Mountain.\r<br />\r<br />Skov Klan Mountain -\r<br />Opposite the rear of the Hjem is the entrance to the mountain.\r<br />The interior is a place for acquiring blessings. If you have the energy (and patients), why not make the long spiraling clime to the top of the interior where upon outside, you can find  unprecedented views of lake llinalta and beyond to the Throat of the World. Although other means of travel is possible in or out of the mountain to access the summit.\r<br />\r<br />Javik&#39;s Tower -\r<br />Just a shot of an arrows distance from the Hjem can the tower be found. Owned by Javik, once a member of the previous clan residing at the Hjem, now spends his retirement honing his craft as a blacksmith.\r<br />Although a man of few words, Javik welcomes visitors who wish to trade.\r<br />\r<br />Vampire Abode -\r<br />This is pretty much a player home on its own but still linked to the rest of the Hjem.\r<br />It is accessed from the basement wooden tunnel and outside round the back, down the side of the archery range.\r<br />Please install the optional file if you experience long load screens when exiting the abode to the outside. \r<br />\r<br />Works well with -\r<br />Ultimate Follower Overhaul\r<br />My Home Is Your Home\r<br />\r<br />Special thanks to:\r<br />concepts2a for helping me keep this mod in order\r<br />Laufknoten2 for fixing gray face bug\r<br />\r<br />Installing -\r<br />Download using the Nexus Mod Manager or Manually extracting the files to your Skyrim Data folder.\r<br />\r<br />Uninstall -\r<br />Make sure your items you have placed in this mod are removed prior to uninstallation of they will be lost.\r<br />Uninstall using the Nexus Mod Manager of remove the file from your Skyrim Data folder.\r<br />\r<br />I hope it may fit what you are looking for and please endorse if you like it.",
  "categoryId": "67",
  "version": "v3.0",
  "author": "dal100",
  "createdUnix": "1359485876",
  "updatedUnix": "1370691090",
  "containsAdultContent": false,
  "uploadedBy": "dal100",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000022370",
      "name": "SkovKlanHjem",
      "version": "v3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1014",
      "fileName": "SkovKlanHjem-30670-v3-0.rar",
      "uploadedUnix": "1365104248",
      "modVersion": "v3.0",
      "virusScanUrl": "https://www.virustotal.com/file/c200069b2e79753ecc8c1d2509b2647c6e368e2d2db6e597979fe65bc0749ae7/analysis/1407506100/",
      "changelogHtml": " Added Vampire Lair. Added trap door and ladder to basement. Some minor fixes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkovKlanHjem-30670-v3-0.rar?fid=1000022370&ttl=1535805679&ri=8192&rs=8192&setec=1f611d0eafe6dbae6818c70db03fe16f"
    },
    {
      "fileId": "1000033286",
      "name": "SkovKlanHjem",
      "version": "v3.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "658",
      "fileName": "SkovKlanHjem-30670-v3-0.zip",
      "uploadedUnix": "1370691090",
      "modVersion": "v3.0",
      "virusScanUrl": "https://www.virustotal.com/file/6bd7b5f0db86cf9cc57ea67e58862b3bd5d836a74bba4b7e4ad7d6fb0913cdfd/analysis/1407596163/",
      "changelogHtml": " Added Vampire Lair. Added trap door and ladder to basement. Some minor fixes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkovKlanHjem-30670-v3-0.zip?fid=1000033286&ttl=1535805679&ri=8192&rs=8192&setec=3fc15a90a5fcb211d178ddc67dc07492"
    }
  ]
}