{
  "modId": 30684.0,
  "modName": "Perk Reset - Using MCM and Skyrim Redone Support",
  "summary": "This mod adds the feature to reset perks via MCM, also reset SkyRe perks.",
  "descriptionHtml": "[size=5]Before using this mod, read the description!!![/size]\r\n\r\nPlease make a backup of your save game (as you should before using any mod)  before using this mod, i will not be held responsible for any damage to your save game if you do not heed this warning, this is only a disclaimer, i did not find anything game breaking yet, because it changes nothing vanilla or uses anything that could get stuck.\r\n\r\nplease report any bugs or wishes in the comments section, after all this is a beta and that is what it is there for :-)[/size]\r\n\r\nUpdates:\r\n--------------------\r\nIf you are updating this mod (Date 30.01.2013) you would need to do a clean save, just disable the Perk-Reset-MCM.esm and load your game, save it afterwards, then enable the Perk-Reset-MCM.esm again, make sure to load the SkyRE-Patch.esp after the SkyRe_Main.esp.\r\n\r\nAfter you have everything setup you will then be able to reset your SkyRe Perks from the MCM menu aswell, to do that just get into the MCM menu and select the \\\"SkyRe Perks\\\" Page, activate the first option and wait for the message to pop up, it is only a reminder read it and you can then continue playing until your perks are fully reset.\r\n\r\nAnd now to the pain in the butt part: If your P.P Exceed 255 During the reset Skyrim will not add more P.P to your Skill menu, if that is the case, the rest of the P.P will be store into the second  menu entry of my MCM menu, just select it and you will get the rest of your P.P\r\n\r\nE.G: SkyRe has 752 Perks, and you have unlocked them all, now you reset SkyRe Perks, you would get 255 Perk Points into your Skill Menu, which is Skyrims P.P Limit, the other 497 Points get store elsewhere until you need them, once you ran out of P.P in your Skill menu just open the MCM and select the option mentioned above, a small message will tell you that the rest of the P.P have been added t the Skill Menu again, and after that you can spend the rest like normal.\r\n\r\nI hope my description makes it clear, i will upload a video if not.\r\n\r\nIntroduction:\r\n------------------------\r\n\r\nWith this mod you can now reset all your perks from within the game menu.\r\n\r\nAccidentally spend a perk point in the wrong tree? Use this to reset it!.\r\nWant to Try a new Build? Just use this to reset your whole tree!\r\n\r\nThere are many more things to do with a perk reset, and the most handy thing is: You can always access it via the menu, with MCM: Mod Configuration Menu made by the SkyUI team.\r\n\r\nInstallation:\r\n----------------------\r\nFirst of all, you need SKSE click [url=http://skse.silverlock.org/]here[/url] to download it, and extract all content to your main folder (where TesV.exe is located).\r\n\r\nThen use NMM to DL my archive and install it with NMM.\r\n\r\nAfter that you are going to need SkyUI with MCM (v3.1 Recommended) -> [url=http://skyrim.nexusmods.com/mods/3863]Download[/url] and follow their instruction on how to install it.\r\n\r\nIf you want to keep you current interface then follow [url=http://skyrim.nexusmods.com/news/280/]this[/url] tutorial.\r\n\r\nNote: you need to start skyrim with skse_loader.exe, or if you are using ATTK you would want to start it via the attk executable.\r\n\r\nUsing the Mod:\r\n------------------------\r\nAfter you installed the mod correctly you can now access the new Perk Reset menu from within MCM, to do that just go into you System Menu (the one you load or save your game with), from there you can choose between three paths:\r\n\r\n\\\"Path of Shadow\\\"\r\n\\\"Path of Might\\\"\r\n\\\"Path of Magic\\\"\r\n\r\nSelect one these menus and select the perk tree/s you want to reset, you can also check everything in every Path to reset every perktree in one go, this will take longer then resetting only one or two trees but it gets the job done.\r\n\r\nAfter enabling the trees you want to reset, close the Journal Menu to get back ingame, you will get a message that the reset will now begin, confirm it with OK and wait for the finish message to pop up. After that you can redistribute all perk points again :-)\r\n\r\nCheck this Video for more instruction:\r\n[youtube]vWF6Jxa4jFI[/youtube]\r\n\r\nCompatibility:\r\n-----------------------\r\nThis mod is for vanilla perks only, if you want it to support Skyrim Redone or other mods you would be better of asking the authors of those mods, simply because they know best what they added and what needs to be reset (in case of quest stages, Global Variables etc...) \r\n\r\nThis mod comes as an .esm file so adding new perks would be easy.\r\n\r\nTo add new Perks do this:\r\n\r\nOpen the CK and Check the Perk-Reset-MCM.esm like you do with Skyrim.esm, after this set your plugin as active and press OK.\r\n\r\nAfter that you will have a Formlist for every perktree, for convenience every list will end with Perks\r\ne.g: DestructionPerks, AlterationPerks etc...\r\n\r\nIn those list you would want to add your own perks (Drag and Drop them in the lists), if you only changed a vanilla perk that still has the same ID you do not need to re add it.\r\n\r\nCredits:\r\n------------\r\nBethesda for such an awsome game and the CK.\r\nSkyUI Team for MCM and SkyUI\r\nElminsterAU, Zilav, and Sharlikran for TES5Edit which helped me merge a few plugins and cleaning this mod.\r\n\r\nAnd especially the SKSE team, without them this mod would have never been possible in the first place.\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "79",
  "version": "1.0",
  "author": "Keldis",
  "createdUnix": "1359498917",
  "updatedUnix": "1360064475",
  "containsAdultContent": false,
  "uploadedBy": "Keldis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000005781",
      "name": "MCM-PerkReset - MainFile",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "MCM-PerkReset - MainFile-30684-.rar",
      "uploadedUnix": "1359498142",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d8e861356950b3d77f12827ce81a446a4ea95e07f02e8f543b3a39f9fa4456a1/analysis/1407386350/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MCM-PerkReset%20-%20MainFile-30684-.rar?fid=1000005781&ttl=1535805712&ri=8192&rs=8192&setec=d78ddd31a8965122e17fedb7df2a523b"
    },
    {
      "fileId": "1000006014",
      "name": "MCM-PerkReset - MainFile - SkyRe Support",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "MCM-PerkReset - MainFile - SkyRe Support-30684-1-0.rar",
      "uploadedUnix": "1359593349",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a5b720ca2a627a228a8304ba440c6f0587d97b30f8dd5077662ec250f3fe4434/analysis/1407388213/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MCM-PerkReset%20-%20MainFile%20-%20SkyRe%20Support-30684-1-0.rar?fid=1000006014&ttl=1535805713&ri=8192&rs=8192&setec=f1377038a3ff91a7246ffcbbfbd333f7"
    },
    {
      "fileId": "1000006022",
      "name": "Script Update - Needed",
      "version": "1.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "9",
      "fileName": "Script Update - Needed-30684-1-0.rar",
      "uploadedUnix": "1359595515",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/99f71e81d38ccd545ed79a9c68a9a65fa5ae7f300e45c54b70eb7157630db54b/analysis/1407388263/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Script%20Update%20-%20Needed-30684-1-0.rar?fid=1000006022&ttl=1535805713&ri=8192&rs=8192&setec=116dc81f50704e6c578d61dc64f427f9"
    },
    {
      "fileId": "1000007237",
      "name": "Source Files",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Script Files-30684-1-1.rar",
      "uploadedUnix": "1360064475",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5ec41942c18fa291f633a203b88dd890aca22522e74a63122a023f813f663018/analysis/1407398478/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Script%20Files-30684-1-1.rar?fid=1000007237&ttl=1535805713&ri=8192&rs=8192&setec=7704d4222017de12d8ce16c4300fa75f"
    }
  ]
}