{
  "modId": 30704.0,
  "modName": "Ladyhawke Standalone Follower Companion",
  "summary": "Standalone companion follower \\\"Isabeau Ladyhawke\\\",  she has a tone build, tribal tattoos, very long hair, a gorgeous face, faithful and loyal to the end. She has a trusty tame wolf\\' and a magnificent horse. She and her wolf both have custom Classes and Combat Styles. She has the KnightRangers Class and Combat Style and will be ",
  "descriptionHtml": "[IMG]http://img692.imageshack.us/img692/6319/ladyhawke01.jpg[/IMG]\r\n\r\n\r\n\r\n[size=200][color=#990000][b]Description[/b][/color][/size]\r\n\r\nStandalone companion follower \\\"Isabeau Ladyhawke\\\",\\\"Pronunciation\\\"- \\\"Izabow\\\"... she has a tone build, tribal tattoos, very long hair, a gorgeous face, faithful and loyal to the end. She has a trusty tame wolf named \\\"Etienne Navarre\\\" \\\"Pronunciation\\\"- \\\"Eti-enn Navar\\'. She has a magnificent horse named Goliath, he and the wolf are immortal, but she is mortal. She and her wolf both have custom Classes and Combat Styles. She has the KnightRangers Class and Combat Style and will be explained below.\r\n\r\nThis mod has been fully cleaned and tested with 200+ mods.\r\nLoad after UFO\r\n\r\n[size=200][color=#990000][b]Story[/b][/color][/size]\r\n\r\nIsabeau Ladyhawke is a KnightRanger Class....\r\n\r\nIt is said the KnightRangers were founded by a group of noble knights that took a sacred blood oath to vanquish the evil that plagues this land, apparently they were losing the battle and struck a deal with a demon in order to win the war against the deadiets, but...they were betrayed by the demon and a terrible curse was cast upon them by Arkay himself...though the exact nature of the curse is unknown, it is written that the only way for the KnightRangers to be rid of this curse, is to make love to a Siren and survive. The KnightRangers skills are legendary. They are trained at a young age in many aspects of survival and war. They are taught the ancient art of forging weapons, the complicated art of alchemy, hand to hand combat, stealth, duty, honor and loyalty. They are taught the fundamentals of war and sacred battle tactics only known to the KnightRangers. Not much is known about the KnightRangers except that one does not want to be on the wrong side of their sword to be sure!\r\n\r\nHow she came to be a KnightRanger.....\r\n\r\nFar across the western sea in the region known as Telesfan, the Village of Mooncrest was massacred by the Orc warlord Malacarn Aglash. A regiment of noble knights known as The KnightRangers, were investigating the lifeless, burned out village of Mooncrest when they came upon a filthy small child holding a shovel and weeping over freshly dug graves. The second in command of the KnightRangers, General Thade, took pity on the young girl and convinced the head of his order to take her in and teach her the ways of the KnightRangers and raise her as his own. The young girl reminded him of his own daughter he had lost. General Thade and the KnightRangers taught her many wonderful things, but revenge weighed heavily on her heart and as she grew, her hatred for the Orc race grew with her. It\\'s been twenty two years since the massacre at Mooncrest village. She now wanders the land searching for the Orc Warlord Malacarn Aglash. She tracked him across Hammerfell, through Elsweyr and Cyrodiil then finally to Skyrim when the trail went cold.\r\n\r\nEtienne Navarre the wolf is a Badmoon Class....\r\n\r\nThe wolf is a powerful adversary and will often try to flank his opponent. He will also try to draw an enemy off his allies.\r\n\r\n[size=200][color=#990000][b]Location[/b][/color][/size]\r\n\r\nShe is camped near Riverwood by the river. It should be easy to find, you can see it from Riverwood.\r\n \r\n\r\n[size=200][color=#990000][b]Details[/b][/color][/size]\r\n\r\n1. Fully standalone, no other mods are needed.\r\n2. She has a pet wolf to protect her and her allies, he is much more powerful than normal wolves and is now immortal.\r\n3. Both she and the wolf have their own custom class and combat style.\r\n4. She has a tone fit build and tribal tattoo\\'s and very long hair.\r\n5. She is proficient in melee and ranged weaponry. She has a heal spell.\r\n6. She has a magnificent steed who cannot die and will ignore combat and will travel with her and stay were she leaves him.\r\n\r\n\r\n[size=200][color=#990000][b]Install[/b][/color][/size]\r\n\r\n1. This should work fine with NMM.\r\n2. Manual download- Extract the files to a temporary location. Copy the files to \\\\Skyrim\\\\Data\\\\ or steam steamapps\\\\common\\\\skyrim\\\\Data\r\n\r\n\r\n[size=200][color=#990000][b]Uninstall[/b][/color][/size]\r\n\r\n1. Remove what you want in her inventory Then, in data files, Uncheck and delete.\r\nIf you need to delete everything that came with this mod then do this.... examine the contents of the whole mod folder and delete all\r\nthe corresponding files.\r\n2. Or use Nexusmodmanager\r\n\r\n\r\n[size=200][color=#990000][b]Incompatibility[/b][/color][/size]\r\n\r\nShouldn\\'t be incompatible with any other mods that I know as of yet.\r\n\r\n[size=200][color=#990000][b]Issues or Bugs[/b][/color][/size]\r\n\r\nI have not found any yet and I tested it with over 200+ mods. Please let me know if you find any. \r\n\r\n[size=200][color=#990000][b]History[/b][/color][/size]\r\n\r\nThis is my first attempt at a standalone follower mod so go easy on me trolls! But everything works as intended for me.\r\n\r\n[size=200][color=#990000][b]Authors Notes[/b][/color][/size]\r\n\r\n1. This is the first part of this mod, when it is complete it will be fully voiced with a quest to go with it. Also in the future she will turn into a Hawk by day and a woman by night and the wolf will turn into a wolf at night and a man by day. They will transform at the exact same time. This will be tied into the quest.\r\n\r\n2. Like I said this is my first standalone follower mod so please let me know how you like it and what I can improve or any suggestions for my future\r\nreferences. Thanks. Hope you like it!\r\n\r\n3. I will release this mod on Steam when it is complete.\r\n\r\n4. I tried really hard to hide the neck seem but you can still see it in certain light. So if anyone would like to help me with it I will credit you with the help, thanks\r\n\r\n5. Also I could use some help making some armors and clothes fit her perfect body type so let me know if anyone feels up to it thanks.\r\n\r\n[size=200][color=#990000][b]Recommend[/b][/color][/size]\r\n\r\nIf you don\\'t want the wolf to sound like a developmentally disabled one legged Japaneses transvestite then I recommend this mod.... http://skyrim.nexusmods.com/mods/30636 .\r\n\r\n\r\n[size=200][color=#990000][b]Contact[/b][/color][/size]\r\n\r\nKnightRangersGuild on Skyrimnexus or KnightRangersGuild@yahoo.com\r\n\r\nA few of my other mods.... http://skyrim.nexusmods.com/mods/30704 and http://skyrim.nexusmods.com/mods/23317 and http://skyrim.nexusmods.com/mods/26590 and http://skyrim.nexusmods.com/mods/23415 and http://skyrim.nexusmods.com/mods/29526\r\n\r\n[size=200][color=#990000][b]Credits[/b][/color][/size]\r\n\r\nThanks to Bethesda for creating Skyrim and the Creation Kit.\r\nThanks to xs2reality for letting me use his Sporty CBBE - Athletic muscle map... http://skyrim.nexusmods.com/mods/13377\r\nThanks to dives41 for letting me use his most excellent tattoo\\'s........ http://skyrim.nexusmods.com/mods/14496/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D14496\r\nThanks to Caliente for his awesome body mod and the wicked cool bodyslide..... http://skyrim.nexusmods.com/mods/2666\r\nThanks to apachii for his killer hair...... http://skyrim.nexusmods.com/mods/10168\r\n\r\n[size=200][color=#990000][b]Tools Used[/b][/color][/size]\r\n\r\nSkyrim Creation Kit, lot\\'s of coffee and my brilliant imagination. Maybe a little hooch to, he, he, he.\r\n\r\n[size=200][color=#990000][b]My Other Mods[/b][/color][/size]\r\nI have a bunch but these are the only ones that I am proud of.... http://skyrim.nexusmods.com/mods/23317 ..... http://skyrim.nexusmods.com/mods/23415 ..... http://skyrim.nexusmods.com/mods/26590 .... Not to proud of this one but I am not done with it just yet my friends. ..... http://skyrim.nexusmods.com/mods/29526 . Now remember, I am still a beginner modder and I think these aren\\'t to bad for a beginner, right ?\r\n\r\n\r\n[size=200][color=#990000][b]Permissions[/b][/color][/size]\r\n\r\nI am not done with this mod yet so do not upload to another site without my permission dudes!",
  "categoryId": "66",
  "version": "4",
  "author": "KnightRangersGuild",
  "createdUnix": "1359536858",
  "updatedUnix": "1369699048",
  "containsAdultContent": true,
  "uploadedBy": "KnightRangersGuild",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000011104",
      "name": "Ladyhawke Standalone Follower Companion",
      "version": "4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12503",
      "fileName": "Ladyhawke Standalone Follower Companion-30704-4.7z",
      "uploadedUnix": "1361252451",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/610688dd72da7530ac1b0b7a0773e9001fb20b7f5f341a4b82fb0dd399099f94/analysis/1407426322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ladyhawke%20Standalone%20Follower%20Companion-30704-4.7z?fid=1000011104&ttl=1535805745&ri=8192&rs=8192&setec=02da465431b872c3f6a0fdbc0048d122"
    },
    {
      "fileId": "1000031747",
      "name": "Ladyhawke Update",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8",
      "fileName": "Ladyhawke Update-30704-.7z",
      "uploadedUnix": "1369699048",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c7123c40e66e663bc9cb36edf45398d951f1123e6d93994ad9704dd43b362233/analysis/1407583926/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ladyhawke%20Update-30704-.7z?fid=1000031747&ttl=1535805745&ri=8192&rs=8192&setec=33e9ebb241e094b0b54608d09c850d6e"
    }
  ]
}