{
  "modId": 30703.0,
  "modName": "Amulets of the Shout Master",
  "summary": "Adds amulets to reduce shout cooldown, craftable at a forge.",
  "descriptionHtml": "Update 1.1: Added an edit to the original Amulet of Talos\\' enchantment. The value is the same, this edit is simply for compatibility purposes for other mods that also edit the Amulet of Talos\\' enchantment. Simply place the mod you want to take precedence later in your load order.\r\n\r\nCAUTION: This edit will show as an ITM in TES5Edit. Do NOT clean it out; it is a purposeful ITM for the above-stated reason.\r\n\r\nThis mod adds three new amulets to the game; Shout Adept\\'s Amulet, Shout Expert\\'s Amulet and Shout Master\\'s Amulet. All three are craftable at a forge under the jewelry section, using Moonstone, Dragon Bones and the previous rank of the amulet. I tried to make these amulets useful without being overpowered. Let me know how they work out, any comments and/or suggestions are welcome.\r\n\r\nNOTE: Requires Skyrim version 1.8.151.0\r\n\r\nShout Adept\\'s Amulet; Reduces Shout Cooldown by 35%. Requires an Amulet of Talos, 1 Moonstone and 1 Dragon Bone.\r\n\r\nShout Expert\\'s Amulet; Reduces Shout Cooldown by 50%. Requires a Shout Adept\\'s Amulet, 2 Moonstones and 3 Dragon Bones.\r\n\r\nShout Master\\'s Amulet; Reduces Shout Cooldown by 70%. Requires a Shout Expert\\'s Amulet, 3 Moonstones and 5 Dragon Bones.\r\n\r\nManual Install; Simply drop Amulets of the Shout Master.esp into your skyrim/Data folder and check it in the Skyrim Lancher/NMM/Your launcher of choice.\r\n\r\nNMM Install; Download it through the Download with Manager button on the mod page and activate it through NMM.\r\n\r\nNOTE: It is possible for the Amulet of Talos to become a quest item, thus preventing its use to craft the new amulets. This happens if you take the Amulet of Talos off of Roggvir (the guy who is executed when you first enter Solitude), or out of his grave. The only way to fix this is to find his sister Greta, also in Solitude, and give her his Amulet of Talos. That should remove the quest item flag from any other Amulets of Talos you may have and allow you to use one to create the Shout Adept\\'s Amulet.",
  "categoryId": "27",
  "version": "1.1",
  "author": "Ritaku",
  "createdUnix": "1359531253",
  "updatedUnix": "1363165821",
  "containsAdultContent": false,
  "uploadedBy": "Ritaku",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000017144",
      "name": "Amulets of the Shout Master",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Amulets of the Shout Master-30703-1-1.zip",
      "uploadedUnix": "1363165821",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/181b4abe17ab77eaa572072a1f4a6d56b70cf95f6c1c552396ba579913a854e3/analysis/1407467172/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Amulets%20of%20the%20Shout%20Master-30703-1-1.zip?fid=1000017144&ttl=1535805744&ri=8192&rs=8192&setec=95c7c27fcb771511ffb5065a0e985b10"
    }
  ]
}