{
  "modId": 3073.0,
  "modName": "Improved Mage Armor",
  "summary": "An improvement to the Mage Armor perks so that they affect the duration of the master level alteration spell as well.",
  "descriptionHtml": "A simple mod to make the Mage Armor perks improve the duration of Dragonhide as much as they do the defense of other such spells. Using this mod, with Mage Armor level 3, Stability and Dual Cast, Dragonhide will last for almost exactly five minutes per cast.\r\n\r\nTo elaborate: By default, Dragonhide has a duration of 30 seconds. Using this mod, Mage Armor improves that duration by the same amount it improves Armor Rating of other ~flesh spells. So at mage armor level 1, Dragonhide will have a duration of 60 seconds. At level 2, 75 seconds. At level 3, 90 seconds. With stability, 135 seconds. Dual casted, 297 seconds. Keep in mind that to dual cast it, you need to have 590 mana.\r\n\r\nThis mod should be compatible with all mods that do not directly affect the Mage Armor perks. It should be entirely safe to remove this mod from your savegame at any time.\r\n\r\nKnown bugs:\r\n- The Mage Armor perk name and description will be in English regardless of the language of your game.\r\n- The duration increase works even if you are wearing armor.\r\n\r\n",
  "categoryId": "93",
  "version": "1.0",
  "author": "Kachajal",
  "createdUnix": "1323380423",
  "updatedUnix": "1323380511",
  "containsAdultContent": false,
  "uploadedBy": "Kachajal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "8348",
      "name": "Improved Mage Armor v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Improved Mage Armor v1-3073-1-0.zip",
      "uploadedUnix": "1323380511",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/acf579e109928c1890debe3ee1bbbeb06be8ebda4f0781a57d1fe883608479be/analysis/1406495045/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Mage%20Armor%20v1-3073-1-0.zip?fid=8348&ttl=1535757818&ri=8192&rs=8192&setec=1c9cfb427a2ba5599d5a3b0a921e5e18"
    }
  ]
}