{
  "modId": 3076.0,
  "modName": "War Baby - Shihong - Female Breton",
  "summary": "Shihong is a Lvl 1 Breton female. The save is located just before you decide whether to follow Hadvar or Ralof into Helgen Keep.",
  "descriptionHtml": "Shihong\r\n---------\r\nThis plugin allows you to play as Shihong, a custom level 1 female Breton. There are two files; choose the one you want to use--you don\\'t need both.\r\n\r\nSave Game\r\n---------\r\nIf you want to use the save game, just drop the Shihong.ess in your Documents\\\\My Games\\\\Skyrim\\\\Save\\\\ folder. It begins at the start of the game right before you decide whether to follow Ralof (the Nord) or Hadvar (the Imperial) into Helgen Keep. If you get a warning about missing content, just ignore it; it\\'s harmless.\r\n\r\n\r\nPlugin\r\n------\r\nAlternately, you may use the Shihong.esp plugin. Just place it in your Skyrim\\\\Data\\\\ folder and activate it in the Data menu in the Skyrim launcher before loading your game. This adds Shihong as a preset to the character generation screen, so you will have to start a new game to create her (or load a save point after the cart-ride but before the character gen screen, which is what I do): just choose the last Breton female preset. If you use the .esp, you can customize Shihong\\'s appearance (makeup/hair/etc.). Once you\\'ve created the character and saved your game, you no longer need the Shihong.esp so you can remove it from your load order.\r\n\r\nScreenshots\r\n-----------\r\nThere are also screenshots that show all of Shihong\\'s sliders with numbers. Skyrim won\\'t always show every slider accurately no matter how much you fiddle with the controls so a couple of the slider settings are bound to be a little off. The numbers are there to correct for these kinds of errors, so use the numbers. They\\'re faster and more accurate. To use the numbers, push the slider all the way to the left, then click to the right the number of times shown on the screenshot. If it says 10, click 10 times. If it says 0, don\\'t click at all.\r\n\r\nKnown Conflicts\r\n---------------\r\nThe Shihong.esp makes a change to the Breton race (in order to add her appearance as a preset). If you use a mod that also changes this race, there will be conflicts. Fortunately, your appearance is stored in your save game, so once you\\'ve created your character, you can remove the plugin from your load order.\r\n\r\nCredits\r\n---------------\r\nnecKros\\' Beauty Faces for the skin texture used in the screenshots; still my favorite\r\nBethesda, for being awesome\r\nSkyrim Nexus, for hosting even crap mods like mine\r\n\r\n\r\nHelpful Links\r\n---------------\r\nFor dozens of additional characters, visit: http://truancyfactory.com/mods/skyrim/skyrim_characters.html\r\n\r\nFor additional tips on customizing your character, check out my HubPages articles:\r\n\r\nChanging your character\\'s appearance and name:\r\nhttp://j-u-i-c-e.hubpages.com/_truancyfactory/hub/How-to-Change-Your-Characters-Appearance-and-Name-in-Skyrim\r\n\r\nCreating beautiful characters:\r\nhttp://j-u-i-c-e.hubpages.com/_truancyfactory/hub/better-looking-characters\r\n\r\nRole-playing tips,\r\nhttp://j-u-i-c-e.hubpages.com/_truancyfactory/hub/roleplaying-skyrim\r\n\r\nCreating interesting back-stories for your characters,\r\nhttp://j-u-i-c-e.hubpages.com/_truancyfactory/hub/skyrim-interesting-character-builds ",
  "categoryId": "43",
  "version": "1.1",
  "author": "TheMagician",
  "createdUnix": "1323381540",
  "updatedUnix": "1343331241",
  "containsAdultContent": false,
  "uploadedBy": "TheMagician",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76761",
      "name": "WB_Shihong",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3558",
      "fileName": "WB_Shihong-3076-1-1.rar",
      "uploadedUnix": "1343331241",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/702aec3f7ab2f37dc8ad798123415bae1adae1fe6cdc9157be122f20405dfce5/analysis/1407047827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WB_Shihong-3076-1-1.rar?fid=76761&ttl=1535757823&ri=8192&rs=8192&setec=d7bfc7b3e446e072ad3bf9104159c50c"
    }
  ]
}