{
  "modId": 30776.0,
  "modName": "The Jagger Hunting Camp",
  "summary": "This Mod adds Five recruitable companions to the legendary Jagger Campsite.",
  "descriptionHtml": "The Jagger\\'s have a long tradition of being able to hunt any creature with great effectiveness and have traveled all across Tamriel as their clan not only hunted for a living,but also took jobs to remove \\\"Problem\\\" beings earning them a great reputation. They are now back in Skyrim looking for their greatest hunt ever...Dragons.\r\n\r\nThorn the patriarch of the clan has now settled into the managing part of the family business. \r\n\r\nMorrigan who is the blood-mother of Thor and Camilla,is a powerful sorceress who Thorn met on one of his distant travels. \r\n\r\nThor the eldest sibling,joined his father Thorn on his first hunt at the age of 6 and fell his first game at the age of 9,adapted with a bow,but prefers his trusty great sword more than anything and enjoys heavy armor. \r\n\r\nHe met his wife Leliana on one of their travels and they instantly fell for one another,they wed and now she travels along with them on their hunts,she found she is quite adept with a bow and will use it over anything.\r\n\r\nKol-ston, was left to die as a babe in Valenwood had it not been for Thorn and Morrigan,they raised him as their own and being a \\\"Bosmer\\\" he adapted to the hunting lifestyle of the Jagger\\'s quite effectively.\r\n\r\n On one of their hunts they ran across a clan of Bosmer hunters and met Leuana who is now his wife.Also a companion the youngest of the Jagger\\'s,Camilla who wears her biggest trophy a Werewolf pelt armor and is also currently looking for a husband. \r\n\r\nButch Ironhead hired on long ago as a hunter to assist around the camp and as a hunter and as since has kinda been considered one of the family and as you can imagine can be a little hard headed at times. \r\n\r\nLorenzo the drunk,of which he takes great pride in,was also hired on by Thorn as another hand around the camp and as Butch\\'s cousin,Thorn just hates to run him off. \r\n\r\nHom\\'er,the height challenged Khajiit,is the camp tanner and cook as he is too afraid to venture out into the woods,or away from the camp fire for that matter. I hope you enjoy the mod please endorse and comment if you do,and may you adventures with the Jagger\\'s be fulfilling.",
  "categoryId": "66",
  "version": "1",
  "author": "Taylor",
  "createdUnix": "1359663598",
  "updatedUnix": "1359661722",
  "containsAdultContent": false,
  "uploadedBy": "taylord125",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000006191",
      "name": "Jagger Campsite",
      "version": ".7z",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "42",
      "fileName": "Jagger Campsite-30776--7z.7z",
      "uploadedUnix": "1359661722",
      "modVersion": ".7z",
      "virusScanUrl": "https://www.virustotal.com/file/fa2257159d858b03c314e48d3e6e58aa4da604f8a5f09be18fd9e5a0df24e282/analysis/1407389353/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jagger%20Campsite-30776--7z.7z?fid=1000006191&ttl=1535805864&ri=8192&rs=8192&setec=0ad330974e409b8be1366d6917603409"
    }
  ]
}