{
  "modId": 30782.0,
  "modName": "Eragon-WIP-",
  "summary": "Play With Eragon Shadeslayer from the Inheritance cycle.",
  "descriptionHtml": "This is my first mod here so bare with me. First off, he is not entirely done yet, still trying to work out some stuff so that you can be able to find him and recruit him into your party. Currently, I have him looking as close as I can to the Eragon from the movie (Good actor, shitty move) and gave him some armor that makes him look kinda cool. He will already have a set skill value and will pretty much be immensly powerful as the version of him that I am making is from after his Galbatorix experience. \r\n\r\nAgain, there realy isn\\\\\\'t that much to this mod but I do plan on adding much much more, including but not limited to:\r\n\r\n-Additional Companions(Brom, Arya, Murtagh, Rorin, you know our favorites)\r\n-Companion Quest\r\n-Saphira(After Dragonborn comes out and I get it)\r\n-New Playable races(Only the dragonrider races)\r\n-Dragon Rider Island(The one that Eragon goes to at the end of Inheritence)\r\n-Other Various locations (Like Carvahall and stuff)\r\n-Misc NPC\\\\\\'s(NPC\\\\\\'s that wont be followers)\r\n-Better version of Brisingr (Not Zarrock-Blue, thats just Zarrock with blue paint)\r\n-Flyable Saphira\r\n-Dragonriders Guild\r\n-Other new factions\r\n-New Main Questline (Not gunna give too many hints, but it may involve you playing as someone from the books)\r\n-Voice-acting (Need awesome voice actors for that)\r\n-Books(Yay...)\r\n-Spells that make you say stuff(Like Brisingr or just using the ancient language)\r\n-New armors and weapons\r\n-Horses from the book\r\n-New Houses (Places where Eragon stayed basicly)\r\n-New Equipment items (Like Eldunarí)\r\n-Other Cool stuff\r\n\r\nSo yea, I am working my way up. Im not realy a good mesh artists but textures I can handle. Also as stated above, I am looking for some nice sounding voice actors. If you want a spot then send an example (just a line from the book) with the character that you would like to Monkeydjc@yahoo.com",
  "categoryId": "66",
  "version": "0.1",
  "author": "YepThatGuy",
  "createdUnix": "1359756053",
  "updatedUnix": "1359756053",
  "containsAdultContent": false,
  "uploadedBy": "chucknorris134",
  "primaryFile": null,
  "files": []
}