{
  "modId": 30867.0,
  "modName": "Ivarstead Workshop PLUS",
  "summary": "Adds a lore-friendly workshop with a Blacksmith Merchant in the center of Ivarstead, along with a shrine to kynareth and an enchanting table outside of Shroud Hearth Barrow. ",
  "descriptionHtml": "Version 2.1(Ivarstead4000) now released!\r\n\r\nAs always, please come back and endorse if you like my work on this mod, it\\'s good for everyone!\r\n\r\n-------------------------------------------------------------------------------------------------------------------------------------------\r\n*Minor navmesh issue fixed* If you are updating, don\\'t forget to grab whatever you have in the chest before you do, the filename is different so the game will treat it like a new mod. (which means you should uninstall Ivarstead3000 before running Ivarstead4000)\r\n-------------------------------------------------------------------------------------------------------------------------------------------\r\nHave you ever found yourself in Ivarstead with a heavy load of looted steel armor, but no way to smelt it down into ingots? Tired of having no way to make or improve armor in the Northern Rift? Ever get stuck between High Hrothgar and Winterhold WITH A GODDAMN LOAD OF CRAFTING MATERIALS AND NO WHERE TO FRICKIN\\' CRAFT!?!?!?! TIRED OF HOBBLING AROUND LIKE A DISEASED RAT IN THE MIDDLE OF THE GODDAMN MAP? WELL THOSE DAYS ARE OVER, FRIEND! \r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nThe Ivarstead Workshop includes a forge, workbench, tanning rack, grinding wheel, smelter, chopping block and a chest set to player-owned that does not respawn. Also added a small shrine to Kynareth behind the inn, on the small promontory to the right of the nearby bridge. Added an enchanting table just outside the doors to Shroud Hearth Barrow, so now along with the alchemy table inside, Ivarstead has everything you need but didn\\'t have before.\r\n\r\nThere are no scripts in this mod, it HAS been cleaned with TES5 edit, and will be maintained for the foreseeable future, unlike many other Ivarstead upgrade mods.\r\n\r\nI will consider any suggestions for improvements, as I did want to keep this as simple as possible, but can\\'t shake the feeling that it still might need one or two more elements/tweaks to make it a real winner. (like an NPC blacksmith, for instance).\r\n\r\nThe platform is navmeshed, so companions can be set to idle there, and Ivarstead NPC\\'s will wander in and craft from time to time as well.\r\n\r\nTo install, use NMM or manually unpack the .esp into your data directory using 7zip.\r\n\r\nthanks for checking it out.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nVERSION 2.0 Update Notes:\r\n\r\nAdded a fully functional NPC Blacksmith vendor who works at the forge during the day, and hangs out in Vilemyr Inn at night. It\\'s a boring life, but it beats shoveling horseshit outside of Whiterun. Made a few cosmetic improvements to the Workshop, mainly adding a smokestack and pulling the forge and smelter \\\"up\\\" a few clicks so that yer feet aint in the floor when ya use \\'em.\r\n\r\nAlso added a small shrine to Kynareth behind the inn, on the small promontory to the right of the nearby bridge.\r\n\r\nDropped an enchanting table just outside the doors to Shroud Hearth Barrow, so now along with the alchemy table inside, Ivarstead has everything you need but didn\\'t have before.\r\n\r\nHope you enjoy this simple little utility mod that makes Ivarstead a bit more \\\"useful\\\" without the trouble-prone over-the-top redesign of other town mods. Don\\'t forget to come back and endorse if you like it!\r\n\r\n-----------------------------------------------------\r\n",
  "categoryId": "22",
  "version": "2pt1",
  "author": "Sabat9",
  "createdUnix": "1359816850",
  "updatedUnix": "1361838960",
  "containsAdultContent": false,
  "uploadedBy": "Sabat9",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013278",
      "name": "Ivarstead4000",
      "version": "2pt1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "118",
      "fileName": "Ivarstead4000-30867-2pt1.7z",
      "uploadedUnix": "1361838960",
      "modVersion": "2pt1",
      "virusScanUrl": "https://www.virustotal.com/file/72c5a580c34e01a77458d7003a21ba6adc4027012892ce3e474096dad7735bf3/analysis/1407439808/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ivarstead4000-30867-2pt1.7z?fid=1000013278&ttl=1535806017&ri=8192&rs=8192&setec=004dbc1a358837b4caeaf7289bd078f3"
    }
  ]
}