{
  "modId": 30888.0,
  "modName": "Akaviri Armaments",
  "summary": "Improves and adds to the armory of Sky Haven Temple",
  "descriptionHtml": "Akaviri Armaments - A Mod by Kohdi\r\n\r\n-Requirements-\r\nSkyrim patched to the latest version\r\n\r\n-Info-\r\nHave you ever wondered why, after hours of following your destiny as Dragonborn and rediscovering the ancient Sky Haven Temple, the most you\\'re rewarded with is a single set of armor and a regular old katana with a crackly enchantment? Why did the ancient Dragonguard leave such a monumental Temple so empty and lifeless? Didn\\'t anyone care to maintain Alduin\\'s Wall? And where in Talos\\' name do your Blades recruits get their extra sets of armor?\r\n\r\nThe Akaviri said it best; Alduin\\'s Wall and the Temple itself were to be a gift for those who came after them. With this mod I hope to reinstate some of that promised reward, fitting for the Dragonborn who is to face Alduin the World-Eater himself.\r\n\r\nAfter the blood seal is broken for the first time in millennia, you will find a more uniquely-stocked armory befitting those great dragonslayers of old. Upon the wall hang twin Dai Katanas, two-handed swords which sing their razor-edged song in battle, and the legendary shield Dragonguard, forged and enchanted to protect those in great risk of dragon-fire and frost, recorded in the hand of the Last Dragonborn on Alduin\\'s Wall. On a table rests Dragonbane, given a new texture and more reliable attributes, as well as an old book documenting some of the characterizing features and history of these armaments and more. Lastly, beside the table looms a great locked chest, sealed to preserve its contents for the one who would come to need them. Within is a majestic set of armor in the Akaviri dragonscale style, but forged from hardest ebony and dyed with the blood of fallen dragons. Accompanying this armor is a matching ebony katana and shield, so that whoever wields such a masterwork may strike fear and death into the hearts of their enemies. Aside from these gifts of old there are new chests at the foot of each bed in the dormitory containing within a full set of Blades armor and shield, so that the future equipment of such a storied Order is guaranteed to maintain its foreign yet respected appearance.\r\n\r\nOn top of these visual changes are several tweaks to the system of stats on Akaviri armaments, including the vanilla pieces. The regular Blades Swords have been renamed to Akaviri Katanas, every katana (except the ebony Dovahkriid) has had its tempering recipe changed from steel to quicksilver to match Dragonbane, the steel armor has been cleaned up to ensure proper tempering and perk benefits, and Dragonbane itself has had its buggy levelled enchantment straightened out and repaired. This means, necessarily, that any other mods which change these same values will conflict, possibly fatally, and should be removed prior to activating mine. Things that have not been changed, and will not be, include weapon damage and armor ratings, and the fact that no Akaviri gear can be crafted at a forge. Think about it; these weapons and armor were crafted in the first era, over 1,700 years before the present! The knowledge of how to forge modern Blades armor and katanas, too, was likely lost in the attacks by the Thalmor thirty years ago. You\\'ll just have to work with what armaments survived the bite of time.\r\n\r\nNow, you wonder, this is all well and good and I am eagerly downloading and warming up my endorsement finger, but this mod is relatively simple, something expected right when the Creation Kit was released last year! What gives? The answer, of course, is that you are right. This was my first mod made for Skyrim, started a long time ago, and I have put off releasing it because other, bigger projects have captured my attention since then. But, perhaps every now and then it is good to take a step back, to play a simple mod and enjoy its rewards, though they may not glow or shoot flames or sing Malukah\\'s songs with every step (with all respect to Malukah). That said, the armor is still very good-looking, exquisitely detailed, and befitting the hero (or villain) which lives in all our characters. So give it a try, you may be surprised at just how much you like it!\r\n\r\nCompatability note - For users of InsanitySorrow\\'s great Dragonbane remake I have included a patch file which points the game to use those meshes, but keep my damage, speed, etc. Only use either my patch .esp or Insanity\\'s original, not both, and certainly not both of my files at the same time. You must first install that mod correctly in order for the patch to work. Because this is only a mesh/texture workaround, Insanity\\'s two-handed Dragonbane and the forging recipes are not included and will not be supported.\r\n\r\n-Troubleshooting-\r\nQ: Nothing has changed! The armory room is still bare and full of shattered dreams!\r\nA: Make sure you have the .esp active, and that no other mod of yours conflicts with the interior of Sky Haven Temple.\r\n\r\nQ: The swords/armor are bright pink, or are invisible! Why?\r\nA: Double-check the mesh and texture paths in your data folder, it should go Meshes/Textures - Armor/Weapons - Blades/Akaviri - Dovahkriid/Dragonguard/Dragonbane.\r\n\r\nQ: I get a CTD when loading the game/entering the Temple! Why have you ruined my game?\r\nA: There is likely a major conflict going on with another mod, make sure you have none loaded which change the values of Blades weapons and armor, or which change the inside of the Temple. If you use InsanitySorrow\\'s Dragonbane replacer, refer to the last part of the description above.\r\n\r\nQ: There isn\\'t a Dragonbane on the table, it\\'s just a regular katana! Why won\\'t you give me two?\r\nA: The katana is a levelled-item generator in disguise, which means it will only be Dragonbane the first time the cell is loaded. If it\\'s not Dragonbane, that means you already have it, and no, you can\\'t have two.\r\n\r\nQ: Kthx now make one in blue or green or yellow or bent apart to show my character\\'s delicates.\r\nA: Sorry, I\\'m not taking any requests on recolorings, and I don\\'t have the skills to make new meshes. If you\\'re industrious the textures are easy enough to apply to compatible meshes, and even recoloring them isn\\'t so hard. Learn a new talent and better yourself!\r\n\r\nQ: Will you/can I upload this to Steam Workshop?\r\nA: No.\r\n\r\n-Changelog-\r\n2/2/13 - v1.0 - Initial Release\r\n\r\n-Credits-\r\naBaDmAn91, for the dai katana mesh\r\nZyuu, for the crested Blades helmet\r\nThe good folks at NifTools, for making .nif editing possible\r\nBethesda, for the vanilla resources, larger textures, and inspiration\r\n\r\n-Contact-\r\nPM me here or leave a comment, I\\'ll respond either way.",
  "categoryId": "36",
  "version": "1.0",
  "author": "Kohdi",
  "createdUnix": "1359833840",
  "updatedUnix": "1359833225",
  "containsAdultContent": false,
  "uploadedBy": "Kohdi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000006600",
      "name": "Akaviri Armaments",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34202",
      "fileName": "Akaviri Armaments-30888-1-0.rar",
      "uploadedUnix": "1359833225",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ea2dcd5ba17ff102d5ce6a46a944175e5eb65c9e544c98ba72c84c285c290da7/analysis/1407393134/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Akaviri%20Armaments-30888-1-0.rar?fid=1000006600&ttl=1535806050&ri=8192&rs=8192&setec=57fa1c11f0ec4e700f6e17950660b3f7"
    }
  ]
}