{
  "modId": 30915.0,
  "modName": "Als Vault of the Old Slayer -- Requires All 10 Dragon Claws",
  "summary": "Uncover an ancient evil, sealed away millennia ago by the most unlikely of protectors. This mod is the fifth in my Completionist series, meant to reward the diehard collector who finds all 10 Dragon Claws in vanilla Skyrim. LORE-FRIENDLY. Requires Dawnguard.",
  "descriptionHtml": "[b]AL&#39;S VAULT OF THE OLD SLAYER - [i]Requires Dawnguard DLC[/i][/b]\r<br />\r<br />This mod adds a new dungeon to Skyrim. There is some lore-friendly backstory told across 4 new books. In the deepest bowels of the dungeon is a series of 10 Dragon Claw doors; therefore, you must have all 10 Dragon Claws collected in order complete the dungeon.\r<br />\r<br />[b][u]Entrance[/u][/b]\r<br />\r<br />Although the exterior is an unassuming ancient Nordic guardhouse, there is a trapdoor in the snow leading to a long-forgotten secret. The trapdoor, entrance to the Vault of the Old Slayer, is found on the same mini-island as the Serpent Doomstone.\r<br />\r<br />[b][u]Design[/u][/b]\r<br />\r<br />There are 4 cells: the Wintry Cairn, Mafresel, the Forbidden Bridge, and the Vault of the Old Slayer itself. They are each very small; the total size of this dungeon is probably equal to or less than a vanilla Skyrim dungeon. Lighting, navmesh, clutter, and enemies are all placed. I have done my best to make the dungeon look good and unique, a treat to look at. Everything in the dungeon will respawn - enemies and loot both.\r<br />\r<br />[b][u]Difficulty[/u][/b]\r<br />\r<br />This is a VERY difficult mod. If you have discovered all 10 Dragon Claws in Skyrim, then you have completed much of the game&#39;s content and are very likely high level. Every leveled enemy in this dungeon is scaled to be Very Hard. There are some non-leveled enemies that remain at a particular level no matter what level you are: anywhere from Level 40 to Level 75.\r<br />\r<br />[b][u]Lore-Friendly[/u][/b]\r<br />\r<br />The backstory is told through four new books: two journals, [i]Mafresel[/i], and the Ritual of Sealing. In addition, the Wintry Cairn holds gravestones with unique inscriptions. Names are either in Draconic (for ancient Nordic names) or Ayleid (for Merish names). The backstory is plausible for the setting and fits into Tamriel&#39;s history.\r<br />\r<br />[b][u]Incredible Treasure[/u][/b]\r<br />\r<br />Your reward for delving to the bottom of the Vault (and thus, for having found all 10 Dragon Claws) is fantastic amounts of loot. A few potions are included in the treasure room which will increase your Carry Weight for a time. Need something to do with all the gold you get? Try [url=http://skyrim.nexusmods.com/mods/9994]Als Treasure Vault[/url]. Need a way to get all your loot out of the Vault? Try [url=http://skyrim.nexusmods.com/mods/25824]Als Elsweyr Rift[/url].\r<br />\r<br />[b][u]Notes[/u][/b]\r<br />\r<br />1. If you want to play this dungeon, and you do not have all the Dragon Claws, fear not&#33; I have included a bat file to give yourself all Dragon Claws instantly. Simply open your console by pressing the tilde ( ~ ) key and enter the followering:\r<br />\r<br />bat DragonClaws\r<br />\r<br />and you will receive all ten in your inventory.\r<br />\r<br />2. I am too unskilled and too impatient to mess around much with navmesh. Therefore all I did was to auto-generate the navmesh. What this means is that, yes, followers and enemies can move around; however, they may have difficulty in some spots.\r<br />\r<br />3. I am not perfect. This is not a perfect mod. It&#39;s my first dungeon mod, for one thing. I am not going to pull my hair out trying to fix every little thing. That said, if you come across a game-breaking bug, by all means let me know&#33; I will also strive to help those with questions in the comments.\r<br />\r<br />-----\r<br />\r<br />[b]Take a look at the other mods in my Completionist Series&#33;[/b]\r<br />\r<br />[b][u]OTHER MODS BY ME[/u]:[/b]\r<br />\r<br />Al&#39;s Completionist Series:\r<br />    1. [url=http://skyrim.nexusmods.com/downloads/file.php?id=9994]Al&#39;s TREASURE VAULT[/url] -- [i]Now you have a place to store all your gold and have it display as treasure&#33;[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/30633]Als Paragon Reward Chest[/url] -- [i]little mod rewarding the completionist player who collects all 5 Paragons[/i]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/30643]Als Konahrik[/url] -- [i]little mod rewarding the completionist player who collects all vanilla dragon priest masks with a previously missing boss fight[/i]\r<br />    4. [url=http://skyrim.nexusmods.com/mods/30765]Als Treasure Map Reward[/url] -- [i]little mod rewarding the completionist player who collects all 11 Treasure Maps in vanilla Skyrim[/i]\r<br />    5. [url=http://skyrim.nexusmods.com/mods/30915]Als Vault of the Old Slayer -- Requires All 10 Dragon Claws[/url] -- [i]modestly sized dungeon rewarding the completionist player who collects all Dragon Claws in vanilla Skyrim with fantastic amounts of treasure[/i]\r<br />\r<br />Al&#39;s Powers and Abilities:\r<br />    1. [url=http://skyrim.nexusmods.com/mods/12859]Al&#39;s Thunder Smite[/url] -- [i]Insta-Kill Enemies, and ONLY Enemies[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/24486[/url]Al&#39;s Eclipse Bloodcurse[/url] -- [i]Tired of shooting arrows at the sun? Now you can get a true eclipse (including removed sun damage) as a power[/i]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/35123]Als Shadow Walk - Automatic Invisibility While Sneaking[/url]\r<br />    4. [url=http://skyrim.nexusmods.com/mods/35045]Als Shout Like a Dragon - Dragonlike Cooldowns[/url] -- [i]Now you can shout as often as dragons can&#33;[/i]\r<br />\r<br />Al&#39;s Conveniences:\r<br />    1. [url=http://skyrim.nexusmods.com/mods/25824]Al&#39;s Elsweyr Rift[/url] -- [i]Teleport to and from a one stop shop for selling loot and crafting items from anywhere&#33;[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/7728]Al&#39;s &#34;Nothing Sells for Zero Gold&#34; Tweak[/url] -- [i]I bet you&#39;re tired of picking up loot that sells for nothing. So am I[/i]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/35234]Als Thuum of the Magesmith[/url] -- [i]Keep the benefits of your enchanted and smithed items even when you switch outfits for a different look&#33;[/i]\r<br />    4. [url=http://skyrim.nexusmods.com/downloads/file.php?id=13355]Al&#39;s -Get 80 Perk Points and All Skills 100- Cheat Ring[/url]\r<br />\r<br />Al&#39;s Dungeons:\r<br />    1. [url=http://skyrim.nexusmods.com/downloads/file.php?id=13121]Al&#39;s Dead Dragon Giant Camp[/url] -- [i]Just as dragon lairs and giant camps are quick and easy (relatively) stops for a rich haul, so is this&#33;[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/30915]Als Vault of the Old Slayer -- Requires All 10 Dragon Claws[/url]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/35295]Als Revakzoor - Lair of Mythic Dragons - Unfairly Difficult Mod[/url] -- [i]A lair laden with treasure, and guarded by six lethal dragons.[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/19697]Al&#39;s Three Stone Watch[/url] -- [i]Lore friendly, non-cheaty, humble starter home[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7444]Al&#39;s Starry Armor and Clothing Retextures[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7648]Al&#39;s Virility - Nude Male - PC Only (Adult Content; NSFW)[/url]",
  "categoryId": "88",
  "version": "1.0",
  "author": "AlCiao",
  "createdUnix": "1359864972",
  "updatedUnix": "1359864604",
  "containsAdultContent": false,
  "uploadedBy": "AlCiao",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000006666",
      "name": "Als Vault of the Old Slayer",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "223",
      "fileName": "Als Vault of the Old Slayer-30915-1-0.7z",
      "uploadedUnix": "1359864604",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/17747a13bb697b34ee8b7e2a76f6e2dd2f13d626608e7fd3529e66880e0c6f7e/analysis/1407393783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Als%20Vault%20of%20the%20Old%20Slayer-30915-1-0.7z?fid=1000006666&ttl=1535806088&ri=8192&rs=8192&setec=1d60c99b1c3ad0ae4287e38478f943e7"
    }
  ]
}