{
  "modId": 30931.0,
  "modName": "The Enchanters Alcazar",
  "summary": "The Enchanter\\'s Alcazar is a player home with a difference; splitting the home into several rooms which can be accessed via portals from a central hub. This house mod requires Dawnguard.",
  "descriptionHtml": "[center][img] http://cookingwithgrenades.com/wp-content/uploads/2013/02/Enchanters-Alcazar-logo.png [/img][/center]\r\n\r\n[heading]Hearthfire Edition Coming Soon[/heading]\r\nThe Enchanter\\'s Alcazar is a player home with a difference; splitting the home into several rooms which can be accessed via portals from a central hub. [b]This house mod requires Dawnguard[/b].\r\n\r\n[heading]The Home[/heading]\r\n\r\nFind the entrance just West of Solitude. Alternatively, you can access it through a teleportation pad in each town. The home is made up of a total of 9 cells:\r\n\r\n[b]The Main Hub[/b]\r\nA circular room with a well in the center and 8 colour-coordinated portals around it.\r\n\r\n[b]Green - Living Quarters[/b] \r\nA medium-sized room with a bed and some storage facilities along with a cosy fireplace.\r\n\r\n[b]Blue - Forgery[/b]\r\nA medium-sized room with everything you need to forge things. The room includes a forge, a workbench, a grindstone, a smelter and a tanning rack along with 9 shield racks (perfect for collecting guard shields) and individual storage for ores and materials.\r\n\r\n[b]Yellow - Armory[/b]\r\nA large room featuring a lot of places to put your trinkets. 11 weapon racks, 6 weapon displays, 6 shield racks, 30 mannequins and room for every dragon priest mask will give you plenty of room to display your treasures.\r\n\r\n[b]Black - Laboratory[/b]\r\nA small room that you may visit a lot. This room features an enchantment table and alchemy table along with storage for soul gems and alchemy ingredients along with 8 book shelfs holding approximately 360 books.\r\n\r\n[b]Red - Kitchen[/b]\r\nA small room with a cooking spit roasting near an open oven. Store your ingredients in the cupboard and display your finest creations on the many shelfs.\r\n\r\n[b]Purple - Map Room[/b]\r\nWhy only have one entrance to your house when you can have 10? This room houses 9 teleport pads leading to the 9 main cities in Skyrim. Each one is two-way and do you can use them either to leave the house or to enter them through their respective pads located in each city.\r\n\r\n[b]Orange - Garden[/b]\r\nSome may say it\\'s more of a brown colour, but never mind that. This is a large-ish garden split into two main plots growing alchemy ingredients and cooking ingredients. This area  will be improved in the Hearthfire version.\r\n\r\n[b]White - Market[/b]\r\nSometimes you just want to sell a load of stuff. Luckily, this house features a market located in a dark and mysterious realm. Buy from or sell to the three forgotten merchants. This feature is balanced and they will not give you unfair prices just because they technically live in your house (they\\'re also ghosts, so don\\'t worry about feeding them).\r\n\r\n[heading]...Why?[/heading]\r\n\r\nI\\'ve had the idea to create a house mod using portals instead of corridors for a while now. As someone who plays on a relatively low-end PC, I often experience framerate drops in homes which feature a lot of objects in small areas and so I wanted to make something that will ultimately work at a good constant framerate for anyone.\r\n\r\nThe project started within a single cell, using alters to teleport into various rooms detached from the main hub. This concept ran into some problems however and so I decided to switch to the current method of assigning each room to a cell and using portals to enter each one.\r\n\r\nThe main sacrifice here is that you need to view a loading screen between every room, but luckily the loading times are very short due to the size of the rooms.\r\n\r\n[heading]Installation[/heading]\r\n\r\nInstalling this mod is easy. Simply click the \\'Install with mod manager\\' button or download the zipped folder and move its contents into your Skyrim data folder.\r\n\r\nAlternatively, you can install it via the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=124815914]Steam Workshop[/url].\r\n\r\n[heading]Conflicts[/heading]\r\n\r\nAt this moment in time the only testing for this mod has been done by me and so any feedback regarding crashes or any other kind of conflict with other mods is welcome. I play with around 60 mods and I have not noticed any problems.\r\n\r\nThe mod does add some new textures and meshes, all of which are altered versions of existing ones. All of these have been duplicated and so none of the base objects have been changed.\r\n\r\nThe main potential for conflict is objects placed in the main world. This mod adds a portal near Solitude and small pads throughout Skyrim. If another mod places an objects close to these, there may be some kind of problem. Such a thing is unlikely, however.\r\n\r\n[heading]Feedback[/heading]\r\n\r\nFeedback and suggestions are very welcome. If you want to suggest a feature or submit a bug report, please don\\'t hesitate to post them in the comments.\r\n\r\n[heading]Final Notes[/heading]\r\n\r\nIf you like this mod, please endorse to show your support.\r\nYou may also like my other mod [url=http://skyrim.nexusmods.com/mods/22964]Houses of Skyrim Connected[/url] (which is due for an update soon).\r\nMy gaming-related website: [url=http://cookingwithgrenades.com/]www.cookingwithgrenades.com[/url]\r\n\r\nA Steam Workshop version is coming soon (as soon as I can upload it without errors.",
  "categoryId": "67",
  "version": "1.0",
  "author": "Mattiebo",
  "createdUnix": "1359900807",
  "updatedUnix": "1360327078",
  "containsAdultContent": false,
  "uploadedBy": "Mattiebo123",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000006763",
      "name": "The Enchanters Alcazar v1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10779",
      "fileName": "The Enchanters Alcazar v1-30931-1-0.zip",
      "uploadedUnix": "1359899479",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5ba051de2661679d3d78d0b9fa6333c4339f20dc9e3c0f3ba8f9d518441786f2/analysis/1407394397/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Enchanters%20Alcazar%20v1-30931-1-0.zip?fid=1000006763&ttl=1535806129&ri=8192&rs=8192&setec=186c2be106085998a59d53ac0f26a0cb"
    },
    {
      "fileId": "1000008000",
      "name": "The Enchanters Alcazar v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10995",
      "fileName": "The Enchanters Alcazar v1_1-30931-1-1.zip",
      "uploadedUnix": "1360327078",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7029a87f0d1821fef5ad326eb4c77a27d6f425bf9f958b38d51fa6dfd6b4bb0f/analysis/1407404484/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Enchanters%20Alcazar%20v1_1-30931-1-1.zip?fid=1000008000&ttl=1535806130&ri=8192&rs=8192&setec=cbe784b426fec831169c5e45c22a2447"
    }
  ]
}