{
  "modId": 30957.0,
  "modName": "Skimpy Noldorian Female Witchplate Replacer v2-0 -Silly Huge- CBBEv3",
  "summary": "This is Version 2.0 \\\"Silly Huge\\\" of my mesh and texture replacer for the Bodyslide-compatible female version of the [url=http://skyrim.nexusmods.com/mods/6685]Witchplate by Telthalion[/url] armor, which he has graciously released to the Nexus community for general use. ",
  "descriptionHtml": "I have always found the male form of the Witchplate armor to be one of the most \\\"badass\\\" looking male armors around, in the positive sense of the word, without being explicitly \\\"evil\\\", as in dark or sinister. However, the female armor looked like an afterthought and didn\\'t really look that great on women. This \\\"Skimpy Noldorian\\\" replacer for the female Witchplate hopes to remedy that situation.\r\n\r\nThis mod is completely derivative of the [url=http://skyrim.nexusmods.com/mods/25259]Noldorian Lifeguard Cuirass - Standalone Vanilla and UNP by EcthelionOtW[/url], and the use of the adjective \\\"Noldorian\\\" is done with his explicit consent to recognize that self-evident fact. In addition, the modified mesh used for the \\\"skimpy\\\" cuirass is adapted from the [url=http://skyrim.nexusmods.com/mods/25259]Remodeled Armor for CBBEv3 Bodyslide and BBP by ChronoTrigger77[/url] mod and derives its attractive Bodyslide properties entirely from that source, which is a good thing because I don\\'t know how to add that otherwise. \r\n\r\nEcthelionOtW also granted me permission to use his newly-posted textures with ChronoTrigger77\\'s more feminine-looking ebony meshes for boots and gauntlets for my new \\\"skimpy\\\" version.  I also cut and copied the chainmail pattern of EcthelionOtW\\'s optional \\\"golden skirt\\\" texture and used it on the mesh for Telthalion\\'s female Witchplate Hood, since that was free for the taking.  Finally, I discovered that ChronoTrigger77\\'s lacey leather panty mesh fit the general look of the new armor and used it with permission. I think the set looks pretty nice now, although quite different in character from both EcthelionOtW\\'s and ChronoTrigger77\\'s originals, as well as from my previous version of this same armor replacer.\r\n\r\nSome posters had expressed the opinion that the previous version was insufficiently protective to qualify as a female version of the Witchplate armor as originally envisioned by Telthalion. I hope that the current version, while remaining somewhat \\\"skimpy\\\" in displaying some bare skin around the torso and midriff, partially addresses that concern by providing significantly more armor coverage to the arms and legs. There were also some questions posted regarding whether previous versions were truly Bodyslide-Compatible. The current \\\"Silly Huge\\\" version I posted definitely is, as it was modified by me from ChronoTrigger77\\'s original body proportions using that excellent tool.  Those who don\\'t like the \\\"Silly Huge\\\" style can therefore easily use the Bodyslide to change it either back to ChronoTrigger77\\'s rather tasteful set of female body proportions or to some other body type they might prefer.\r\n\r\nI should also mention that besides providing permission for the use of their posted materials, both EcthelionOtW and ChronoTrigger77 were incredibly helpful and generous with their time in providing technical and aesthetic consulting as to how to do this, so I would like to express my appreciation to them for their invaluable assistance. Although the final creative decisions I made in combining those elements are my own responsibility, most of the credit for this work goes to them. Finally, I should mention that the original Witchplate armor set in now featured in the hothtrooper44\\'s amazing [url=http://http://skyrim.nexusmods.com/mods/19733]Immersive Armors[/url] compilation, so if you don\\'t have Telthalion\\'s original mod, get that one instead and be sure to endorse hothtrooper44\\'s awesome work as well as both EcthelionOtW\\'s and ChronoTrigger77\\'s!",
  "categoryId": "54",
  "version": "2.1",
  "author": "Restutitor Orbis",
  "createdUnix": "1359924687",
  "updatedUnix": "1367903095",
  "containsAdultContent": true,
  "uploadedBy": "Restutitor Orbis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000007146",
      "name": "Skimpy Noldorian Female Witchplate Replacer",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7895",
      "fileName": "Skimpy Noldorian Female Witchplate Replacer-30957-1-2.7z",
      "uploadedUnix": "1360022600",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/3c00da6a207159ba692b376d0c160e8e81fba01ee7d04ae73739bf5b7723b87e/analysis/1407397812/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skimpy%20Noldorian%20Female%20Witchplate%20Replacer-30957-1-2.7z?fid=1000007146&ttl=1535806182&ri=8192&rs=8192&setec=e21de783c3f5def1671e53e45391d02e"
    },
    {
      "fileId": "1000028515",
      "name": "Skimpy Noldorian Female Witchplate Replacer 2-0 Silly Huge",
      "version": "2.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "7421",
      "fileName": "Skimpy Noldorian Female Witchplate Replacer 2-0 Silly Huge-30957-2-0.7z",
      "uploadedUnix": "1367881840",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/06a35e6abcd9ff084166aee7813a3a4aa7ea299ad2c1cdf81c30f16d27f5375c/analysis/1407558393/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skimpy%20Noldorian%20Female%20Witchplate%20Replacer%202-0%20Silly%20Huge-30957-2-0.7z?fid=1000028515&ttl=1535806183&ri=8192&rs=8192&setec=191b6a13649f19a27262b0ad48bcfc51"
    },
    {
      "fileId": "1000028567",
      "name": "Skimpy Noldorian Female Witchplate Replacer v2-1 - Silly Huge - Golden Skirt",
      "version": "2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10600",
      "fileName": "Skimpy Noldorian Female Witchplate Replacer v2-1 - Silly Huge - Golden Skirt-30957-2-1.7z",
      "uploadedUnix": "1367903095",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/adcdd951aabab24749b77f3c1c4f13f6a0d88d3f3a6a2712a41969b6f488ce1b/analysis/1407558787/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skimpy%20Noldorian%20Female%20Witchplate%20Replacer%20v2-1%20-%20Silly%20Huge%20-%20Golden%20Skirt-30957-2-1.7z?fid=1000028567&ttl=1535806184&ri=8192&rs=8192&setec=9886ec935d398eaa1d0c2f960b01c3ac"
    }
  ]
}