{
  "modId": 30950.0,
  "modName": "Community Skybrary",
  "summary": "Share your very own story with all of Skyrim! This mod plans to be a collection of community made books for players to enjoy on their breaks from dragon slaying and dungeon exploring.",
  "descriptionHtml": "The idea of this mod is to collect peoples own books in Skyrim and place them in the game in realistic locations for people to read in their relaxing time; they can be about anything you want such as lore, fictional books etc... If you enjoy reading books in Skyrim or have some ideas for a book but dont have the time/knowledge of how to place it into the game then this mod is for you!\r\n\r\n-Rules and info on books-\r\n\r\nI obviously want as many people giving me scripts for books so ill be as lenient as possible but there is just 1 rule which everyone must follow if their book is to be added to the mod:\r\n\r\nThe book has to be reasonably realistic. What I mean by this is no \\'Godzilla appeared and destroyed all of Skyrim in 5 seconds\\' sort of stuff. I would like the books to seem like they were already in the vanilla game.\r\n\r\n-Getting your book in the mod-\r\nTo get your book in the mod its very easy; simply E-mail skyrimlibrary@gmail.com with your book script and ill reply within 24 hours if your book has been added to the game. I dont choose the books on whether or not I think theyre good; just if they fit into the scene of Skyrim.\r\n\r\nAlso, you can tell me your Skyrim Nexus/Steam username which I will add to the credits page of this mod and also the name of the author for the book you have written which will be included on the first page of every book. If your book is accepted then Ill also tell you where abouts in Skyrim you can find it if youd like to read your own masterpiece over again.\r\n\r\nThanks for reading, please ask any questions and send this out to all of your Skyrim friends so I can start adding books!\r\n\r\nCurrent Book Count: 4 (over 28 pages)\r\n\r\n-Inspired by GophersVids-\r\n\r\nCredits:\r\nValayane - Author of \\\"The Altmer Ancestry\\\" (The Arcanaeum in Winterhold)\r\nKnightRangersGuild - Author of \\\"A Tavern Tale\\\" (Upstairs in the Winking Skeever in Solitude)\r\nJ Allin - Author of \\\"Draugr Tomb\\\" (In Heimskr\\'s house in Whiterun)\r\nAngelOfPassion - Author of \\\"Tattered Journal\\\" A.K.A Loneliness (In the Alftand Glacial Ruins)",
  "categoryId": "28",
  "version": "",
  "author": "The Community and Onion Boy",
  "createdUnix": "1359917307",
  "updatedUnix": "1359997860",
  "containsAdultContent": false,
  "uploadedBy": "OnionBoyy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000007041",
      "name": "Community Skybrary v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Community Skybrary v1-30950-1.rar",
      "uploadedUnix": "1359997860",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/eaa14e4c78a4fc6367498ea361ab551eb892885bea46fb70ac8ceff90afeac43/analysis/1407397083/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Community%20Skybrary%20v1-30950-1.rar?fid=1000007041&ttl=1535806166&ri=8192&rs=8192&setec=64ef92f3cb8c56ed418b8229cc5d60fc"
    }
  ]
}