{
  "modId": 30968.0,
  "modName": "Athletics Training - with MCM",
  "summary": "This mod brings back Athletics to Skyrim. Raise your speed and jump height by sprinting, jumping and swimming. The more you train, the better you will get! Fully customizable via MCM! Introduces several new athletic abilities like simultaneous sprinting and jumping...",
  "descriptionHtml": "[size=5][color=yellow]Athletics Training v1.41[/color][/size] (by Volek, featuring Deathless Aphrodite and Spinner385)\r\n\r\nRequires Skyrim 1.8, [url=http://skse.silverlock.org/]SKSE 1.6.6[/url] and [url=http://skyrim.nexusmods.com/mods/3863]SkyUI 3.1[/url].\r\n\r\nThis mod brings back Athletics to Skyrim. Raise your speed and jump height by sprinting, jumping and swimming. The more you train, the better you will get!\r\n\r\nAfter having enjoyed the Athletics skill in Morrowind and especially Oblivion, I was quite dissappointed that Skyrim did not feature anything athletics related. \r\nI took first measures to fix that with my pre-CK mods [url=http://skyrim.nexusmods.com/mods/164]Higher Jumping[/url] and [url=http://skyrim.nexusmods.com/mods/167]Longer Sprinting[/url]. Later I made a much more advanced mod, [url=http://skyrim.nexusmods.com/mods/28675]SKSE Athletics[/url], which calculated speed and jump height from stamina, inventory weight and some other factors. Now I have added the training aspect to that mod, and also added MCM support for convenience and fun.\r\n\r\n[color=yellow]Features:[/color]\r\n[list]\r\n[*]Train your athletic skills: The more you jump, the higher you will be able to jump. The longer you sprint, the faster you will be able to run. Swimming improves all athletic skills. With higher jump height and speed, your tolerance for fall damage will raise as well.\r\n[*]Every 3 seconds, a script re-calculates your jumping height and running speed. MCM lets you adjust this rate.\r\n[*]Each race has different athletic boni, for example Khajiits are more agile than High Elves, so they will run faster and jump higher by default. You can change these boni in the MCM.\r\n[*]Vampires receive an additional boost to both speed and jump height (compatible with \\\"Better Vampires\\\"). You can change this bonus in the MCM.\r\n[*]As your training progresses, you will gain ranks and unlock several abilities: Simultaneous sprinting and jumping, power sprinting, water sprinting, better stamina gain/loss rates, and more.\r\n[*]Your current stamina affects both running and jumping, you will be slower when exhausted. You can adjust or deactivate this feature in the MCM.\r\n[*]You are more agile after having rested, you will slowly become slower when awake for a long time. A quick nap will not help, you need a good night\\'s sleep. You can adjust or deactivate this feature in the MCM.\r\n[*]Inventory weight slows you down, but you can counter this effect with Fortify Carry potions and enchantments. You will always be able to move, but you may not be able to jump anymore if your inventory weighs too much. You can adjust or deactivate this feature in the MCM.\r\n[*]Your body weight has a small effect on athletics too. A weight of 50 is the optimum, anything higher or lower will make you slower (compatible with \\\"Pumping Iron\\\"). The body weight factor can be turned off in the MCM if desired.\r\n[/list]\r\n[color=yellow]MCM Features:[/color]\r\n[list]\r\n[*]Skill page: A basic overview over your athletic skills and abilities. You can see your current athletic ranks, your special abilities (locked abilities are grayed out), and your race specific boni. If you use \\\"Better Vampires\\\", you will also see your vampirism rank and additional boni.\r\n[*]Statistics page: A detailed overview over your athletic statistics. Keeps track of your training efforts, and displays values that flow into the athletics calculation.\r\n[*]Options page: Here you can customize your athletics training. There are many useful options, mouse-over each option for an explanation. Use the cheat & debug options at your own risk! And save your game BEFORE messing around. You have been warned!\r\n[/list]\r\n[color=yellow]Abilities:[/color]\r\nThere are currently 5 new abilities that can be unlocked. \r\n[list]\r\n[*]Simultaneous Sprinting and Jumping: Novice ability, unlocked after about 50 jumps and 50 sprint seconds. Enables you to jump while sprinting.\r\n[*]Power Sprint: Adept ability, unlocked after about 1500 sprint seconds. After having rested, you can sprint with twice the speed until you stop, jump or your stamina is drained. Does only work once after resting, rest again to re-gain the ability. \r\n[*]Instant breath-catching: Expert ability, unlocked after about 3000 sprint seconds. Normally when your stamina is depleted after sprinting, it takes 3 seconds until stamina starts to refill itself (the stamina bar flashes for 3 sec). With this ability, this delay is removed and you\\'ll sometimes even regain your stamina before it\\'s even completely depleted. This allows you to sprint more often. \r\n[*]Water Sprint: Master ability, unlocked after about 5000 sprint seconds. You can sprint on any water surface. Does only work if you sprint forward, and if you stop sprinting, you will sink into the water. You can still go swimming, just walk or run into the water.\r\n[*]Reduced Lung Damage: Apprentice ability, unlocked after about 500 swim seconds. When you dive for a long time, you\\'ll usually receive damage. This ability reduces this damage. Not much at first, but with more swim training the reduction is improved.\r\n[/list]\r\n[color=yellow]Known issues:[/color]\r\n[list]\r\n[*]The abilities are not unlocked exactly on the mentioned training values. Even if you have more training than needed, it may take up to half an hour (game time, not real time) before you can use the abilities. Check the MCM from time to time to see if you have gained new abilities.\r\n[*]The values that flow into the calculation (see additional info below) are probably not balanced. If you think something is too unbalanced, please provide feedback and I\\'ll see into it.\r\n[*]When you are over-encumbered, the message \\\"You are over-encumbered\\\" will appear every few seconds. This is due to a workaround for a shortcoming in the speed calculation. The speed does not update unless the player uses block or sprint (which is not always used) or the inventory weight changes. The script silently adds and removes a fork to the inventory to update the speed value.\r\n[*]When you become a vampire or change your race otherwise, the new race modifier will apply during the next 30 game minutes. You can use the wait menu. This method prevents the script from unnecessarily checking your race every few real time seconds. \r\n[/list]\r\n[color=yellow]Compatibility:[/color]\r\n[list]\r\n[*]This mod is probably not compatible with mods that alter the gamesettings [i]fJumpHeightMin, fJumpFallHeightMin, fActorSwimBreathDamage, fOutOfBreathStaminaRegenDelay[/i], and the actor values [i]Speedmult[/i] and [i]StaminaRate[/i].\r\n[*]Mods that add custom Fortify Carry effects, such as Bandolier - Bags & Pouches, are not compatible. All mods that use the vanilla Fortify Carry effect work fine, such as Mage Backpack.\r\n[*]Mods that modify any of values needed for the athletics calculation (see additional info below) will affect the calculated result. For example, Pumping Iron changes body weight, the effect is directly applied to your athletics skill.\r\n[*]This mod should also work with any custom race.\r\n[/list]\r\n[color=yellow]Installation/updating:[/color]\r\n[list]\r\n[*]Just put the .esp and .bsa into your Data folder and activate it with the launcher. You will know that it worked when you see a message a few seconds after loading your game.\r\n[*]If you are one of the few people who used my old mod SKSE Athletics before, you should uninstall that mod first. Do not run both mods together. Most importantly, get rid of the loose files [i]Data/Scripts/vvvAthleticAlias.pex[/i] and [i]vvvAthleticQuest.pex[/i]. After installing the new mod and starting the game, you should see a message saying that the mod has been updated.\r\n[*]As of v1.2, this mod implements the scripts of the mod [url=http://skyrim.nexusmods.com/mods/19668]Sprint and Jump with Boost[/url]. Do NOT use both mods together, there will be severe conflicts. If you used that mod before, remove the file [i]Data/Scripts/DeathlessSprintJump2.pex[/i].\r\n[/list]\r\n[color=yellow]Additonal info:[/color]\r\n[list]\r\n[*]The calculation takes many different values into consideration, but it shouldn\\'t slow your gameplay down. I tried to optimize the script according to some veteran scripters\\' tips.\r\n[*]The original speed is 100, the original jump height is 76, the original fall tolerance is 600.\r\n[*]The calculated speed will never be lower than 50, to prevent players with a very heavy inventory from being unable to move.\r\n[*]The calculated fall tolerance will never be lower than 500, to prevent very slow players from falling to death when jumping down low heights.\r\n[*]When you are over-encumbered, the Speed calculation is deactivated to avoid becoming slow like a snail when walking around.\r\n[/list]\r\n[color=yellow]Changelog:[/color]\r\n[list]\r\n[*]1.41: added options to customize Stamina factor\r\n[*]1.40: added many more customization options to the MCM, re-balanced calculation formula and rank gain, capped fortify carry effect factor for better compatibility with cheat mods.\r\n[*]1.30: reduced Stamina and Inventory Weight factors, increased Training factor, added more options to MCM, many small bugfixes, removed SprintJump boost due to instability, added better language support.\r\n[*]1.21: fixed SprintJump ability blocking the next jump, fixed Power Sprint ability being activated before being unlocked.\r\n[*]1.20: implemented \\\"Sprint And Jump with Boost\\\" by Deathless Aphrodite & Spinner385, added swim training, added new abilities, a little bit of re-balancing, re-organized MCM, check for race/fatigue/abilities now executes every 30 game-time minutes, several bug fixes.\r\n[*]1.12: fixed fatigue update time, race check every game hour, adjusted race modifiers\r\n[*]1.11: reworked and renamed, initial release.\r\n[*]1.00: old SKSE athletics mod, no longer supported.\r\n[/list]\r\n[color=yellow]Legal Info:[/color]\r\nDO NOT reupload this mod or anything based on this mod to any site without permission! This includes Steam Workshop.\r\nNo permission needed to upload anything based on this mod to Skyrim Nexus, just give proper credit and drop me a line.",
  "categoryId": "24",
  "version": "1.41",
  "author": "Volek",
  "createdUnix": "1359939449",
  "updatedUnix": "1363238260",
  "containsAdultContent": false,
  "uploadedBy": "Volek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000007201",
      "name": "Athletics_Training_1_12",
      "version": "1.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Athletics_Training_1_12-30968-1-12.zip",
      "uploadedUnix": "1360045027",
      "modVersion": "1.12",
      "virusScanUrl": "https://www.virustotal.com/file/3183ee01d15ab0f382d2f246d6763dfff2c7f01cb326e52bd6d2b0e0c697adea/analysis/1407398246/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Athletics_Training_1_12-30968-1-12.zip?fid=1000007201&ttl=1535806199&ri=8192&rs=8192&setec=cc2bb315342c0a718db16fb726fc6fa1"
    },
    {
      "fileId": "1000008616",
      "name": "Athletics_Training_1_20",
      "version": "1.20",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51",
      "fileName": "Athletics_Training_1_20-30968-1-20.zip",
      "uploadedUnix": "1360472846",
      "modVersion": "1.20",
      "virusScanUrl": "https://www.virustotal.com/file/715872cf5e1dc973c0b14b957350f4973acf99102cd465ff7281ded13d22cd82/analysis/1407408791/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Athletics_Training_1_20-30968-1-20.zip?fid=1000008616&ttl=1535806200&ri=8192&rs=8192&setec=1de84b4969fb1980e1759b67352c5bdf"
    },
    {
      "fileId": "1000008708",
      "name": "Athletics_Training_1_21",
      "version": "1.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "52",
      "fileName": "Athletics_Training_1_21-30968-1-21.zip",
      "uploadedUnix": "1360510047",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/174cf783803846afa1275245fe173e48c8ee185f8c7ef7008183f130d4eea7e0/analysis/1407409565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Athletics_Training_1_21-30968-1-21.zip?fid=1000008708&ttl=1535806200&ri=8192&rs=8192&setec=11e89fb5b8c1985cb824f73844d5184d"
    },
    {
      "fileId": "1000010519",
      "name": "Athletics_Training_1_30",
      "version": "1.30",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "55",
      "fileName": "Athletics_Training_1_30-30968-1-30.zip",
      "uploadedUnix": "1361086646",
      "modVersion": "1.30",
      "virusScanUrl": "https://www.virustotal.com/file/472ad9c280280e93b31dfcdc2581d374e71b5d0ffe831aad4691ef52b485434d/analysis/1407422108/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Athletics_Training_1_30-30968-1-30.zip?fid=1000010519&ttl=1535806201&ri=8192&rs=8192&setec=bec19cf3580495c216b4b4ddeb7e45fb"
    },
    {
      "fileId": "1000010520",
      "name": "Athletics_Training_1_30_German",
      "version": "1.30",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "59",
      "fileName": "Athletics_Training_1_30_German-30968-1-30.zip",
      "uploadedUnix": "1361086758",
      "modVersion": "1.30",
      "virusScanUrl": "https://www.virustotal.com/file/23dd32762a9172ec32fef3b6d90f68e3f8c876d0d442ce2d4059acfcd59d955e/analysis/1407422108/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Athletics_Training_1_30_German-30968-1-30.zip?fid=1000010520&ttl=1535806202&ri=8192&rs=8192&setec=af2c32183fad084fec307b7886e2ecc8"
    },
    {
      "fileId": "1000017197",
      "name": "Athletics_Training_1_40",
      "version": "1.40",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "66",
      "fileName": "Athletics_Training_1_40-30968-1-40.zip",
      "uploadedUnix": "1363189761",
      "modVersion": "1.40",
      "virusScanUrl": "https://www.virustotal.com/file/e4e9ba4a90bf653b79535aec9dff9e5c9cefdcab0a40e567a9f426a4361957a3/analysis/1407467469/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Athletics_Training_1_40-30968-1-40.zip?fid=1000017197&ttl=1535806202&ri=8192&rs=8192&setec=648504b88194afaf6abdb4b80c007ee7"
    },
    {
      "fileId": "1000017322",
      "name": "Athletics_Training_1_41",
      "version": "1.41",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "66",
      "fileName": "Athletics_Training_1_41-30968-1-41.zip",
      "uploadedUnix": "1363235599",
      "modVersion": "1.41",
      "virusScanUrl": "https://www.virustotal.com/file/e537fc7c10aa790405fb0627278aabe517ac0cebfc7d5109b25f395ed2f38fcc/analysis/1407468922/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Athletics_Training_1_41-30968-1-41.zip?fid=1000017322&ttl=1535806202&ri=8192&rs=8192&setec=eb9b08146813464d5d534f0d41f8e835"
    },
    {
      "fileId": "1000017330",
      "name": "AT Localization text files",
      "version": "1.41",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "53",
      "fileName": "AT Localization text files-30968-1-41.zip",
      "uploadedUnix": "1363238260",
      "modVersion": "1.41",
      "virusScanUrl": "https://www.virustotal.com/file/6f61a71bce027ccb998fbcc282478f97f977766522586528ffe96b1eab9953f1/analysis/1407468962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AT%20Localization%20text%20files-30968-1-41.zip?fid=1000017330&ttl=1535806203&ri=8192&rs=8192&setec=ab4bd9a661d82897497bf1c74789d104"
    }
  ]
}