{
  "modId": 30963.0,
  "modName": "ballroom weapons and armor",
  "summary": "",
  "descriptionHtml": "CHANGES: THE HELPERS PRA TOGETHER NOW HERE IN THE MOD, REPORTED BUGS CORRECTED, DESIGNER OF IMPROVEMENT IN ARMS HACKS AND SHELLS, LIGHT AND SHADOW EFFECT + REAL, ONE OF BAU PARCHMENTS ADDED.\r\n\r\ntested at 10 SKYRIM UPDATE (1.7.706) with all DLCs but requires no DLC installed.\r\n\r\nBugs can see the attention as the game itself presents original bugs in time to put the guns in raks etc ...\r\n\r\nbut has been tested by me for hours and did not have any bug that compromises the mod, everything worked perfectly.\r\nif you experience a bug large, fold-le the mod (except the basement of the DATA folder) wipe the backup folder and install the game again\r\ndo not forget to pick up your items before uninstalling the mod but you lost forever!\r\n\r\nI do not know how it behaves in more modest pcs (use an i7 2600, 8 gig ram, ati 6970 video all maximum)\r\n\r\ndetails the mod has shortcut to the top 5 houses skyrim only you buy the house and ready look for the entrance to the cellar.\r\nhouses:\r\n\r\nWhiterun - Breezehome (tane turn around and buy the Breezehome house key with the help of the king)\r\nRiften - Honeyside (tane turn around and buy a house key Honeyside with the help of the king)\r\nMarkarth - Vlindred Hall (tane turn around and buy a house key Vlindred Hall with the help of the king)\r\nWindhelm - Hjerim (tane turn around and buy a house key Hjerim with the help of the king)\r\nSolitude - Proudspire Manor (turn tane and buy a Manor house key Proudspire with the help of the king)\r\n\r\ncontains the mod:\r\n\r\nalchemical laboratory with custom baud\r\n\r\nSpells with enchanting custom baud\r\n\r\neverything you need to forge with custom baud\r\n\r\n+ Extras different baud\r\n\r\nbookshelf for many books (352 books in Exhibition)\r\n\r\n2 safes to store their money and jewelry\r\n\r\nplates and shells crossed guns (128 guns on display 64 shells)\r\n\r\nboards weapons (32 weapons on display)\r\n\r\n(32) Big Dummies (1) Giant (33 and 33 armor shields on display)\r\n\r\nExhibitor daggers (12 daggers on display)\r\n\r\nExhibitor weapons (8 guns on display)\r\n\r\n1 throne and blessing of divine all major game to start on the right foot!\r\n\r\ntotal exposure 352 books, 180 guns on display, 33 armor, 97 shells.\r\n\r\ninstallation unzip the zip, (necklace DATA folder) in C: \\\\\\\\\\\\\\\\ Program Files (x86) \\\\\\\\\\\\\\\\ The Elder Scrolls V Skyrim (in the main folder of the game is asking to replace replace! done!",
  "categoryId": "39",
  "version": "",
  "author": "unknown",
  "createdUnix": "1359932856",
  "updatedUnix": "1359932856",
  "containsAdultContent": false,
  "uploadedBy": "leitescott",
  "primaryFile": null,
  "files": []
}