{
  "modId": 30969.0,
  "modName": "No More Helgen - Save Game",
  "summary": "A clean save outside the cave of Helgen, for those who don\\'t want to uninstall all their mods just to go through the crappy intro... or are just bored of playing it over and over.",
  "descriptionHtml": "[i]I\\'ve edited the description of this mod according to feedback, but mostly because I originally wrote it on only a few hours sleep and it was beyond stupid. Thanks to the people who have contacted and talked to me, left comments, ect.. You guys are the cream of the crop on a site filled to the brim with trolls and angry people.[/i]\r\n\r\n[size=4][center]------------------------------------[color=yellow]\r\nSave Game: Outside Helgen Cave\r\n[/color]------------------------------------[/size][/center]\r\n\r\n\r\n\r\n[b][color=yellow]What is this? What\\'s it do?[/color][/b]\r\n\r\nI suffer from issues like [url=\\\"http://www.youtube.com/watch?v=4_b23nm0clQ\\\"]this[/url] trying to get through Helgen with mods installed, so I booted up without mods and made a new \\\"clean\\\" save game for later use. I mean clean as in \\\"there are no mods installed\\\". People have since told me that it is not \\\"clean\\\" because the character is already established (character creation is long finished). But you can change the character by bringing up the console (\\'~\\' key) and typing \\'showracemenu\\' to bring it up again.\r\n\r\nYou will lose the accumulated progress to the next level if you change race, but it should not really matter much as the character is only level one. You install the save by dropping it into [i]Documents -> My Games -> Skyrim -> Saves[/i].\r\n\r\n\r\n[b][color=yellow]Reasons for this Mod[/color][/b]\r\n\r\nMany people think that such a save would be useless, as there are saves already that get off just before the character creation menu, or start in Riverwood a few days later. I\\'ve downloaded a save of the prior type, and still had issues with the scripting in Helgen hanging/getting stuck or things going terribly wrong. That, and I couldn\\'t find a save outside of Helgen cave, where I wanted to find a save.\r\n\r\nTD;LR My reasons for posting this were mostly for my own benefit, but instead of keeping it to myself, I decided to share it.\r\n\r\nPeople have also messaged me wondering what kinds of mods would cause the carriage to fly all over, or why a person would even have problems in the first place. It\\'s like this - Helgen is 99.9% scripted, and doesn\\'t actually exist in it\\'s undestroyed state. The intro is basically an instance. I\\'ve only had carriages flying all over the place, been stuck in the middle of the road, ect.. when I\\'ve installed a scripting mod. As a result, I usually remove all my mods before doing Helgen so I can get through it. I know there is the [url=\\\"http://skyrim.nexusmods.com/mods/9557\\\"]Live Another Life[/url] Mod, and [url=\\\"http://skyrim.nexusmods.com/mods/25404\\\"]Random Alternate Start[/url] too, but I found that I didn\\'t like them as much as running around with Ralof.\r\n\r\nSo use those if you want to, or use one of the alternative start mods above. Everyone to their own.",
  "categoryId": "39",
  "version": "1",
  "author": "noweha",
  "createdUnix": "1359940231",
  "updatedUnix": "1359939532",
  "containsAdultContent": false,
  "uploadedBy": "noweha",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000006921",
      "name": "Save Game - Outside Helgen Cave",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1012",
      "fileName": "No Moar Helgen-30969-1.rar",
      "uploadedUnix": "1359939532",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e89ad4b0c102b242ac650f93f9cb7af1b44f187413751a20e5a30b444417a5f6/analysis/1407396005/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Moar%20Helgen-30969-1.rar?fid=1000006921&ttl=1535806205&ri=8192&rs=8192&setec=2b6ecc9fbf9ee7aaa490fbbc85821b10"
    }
  ]
}