{
  "modId": 30991.0,
  "modName": "Alternate start - Davyd - A level 1 Nord",
  "summary": "An alternate save where you\\'re not a Dragonborn, But a nord from Solstheim, Travelling to Skyrim.",
  "descriptionHtml": "==========\r\n[B]Description[/b]\r\n==========\r\nAs stated before, You\\'re just a simple traveller from Solstheim, This means no main quest. You can read the Story to understand more about Davyd, Although unnecessary, I just love writting random stories.\r\n=============\r\n[b]Essential Mods[/b]\r\n=============\r\nYou need the mods below, Seriously, Or Davyd will explode\r\n\r\nSkyrim Redone by T3nd0\r\nhttp://skyrim.nexusmods.com/mods/9286\r\n\r\nCharacter Creation Overhaul \r\nhttp://skyrim.nexusmods.com/mods/21587\r\nNOTE (You\\'ll understand what i meant after you install the mod above): I choosed Combat as the main class, But this character is supposed to be a thief.\r\nBasic skills choosen: Sneak, Speechcraft, Pickpocket, Light armor, One handed, and Archery.\r\nI also put the book A New Beginning inside the end table beside you in case you wanted to change his look or repick the base skills.\r\n\r\n=====================\r\n[b]Installation Instruction[/b]\r\n=====================\r\nOpen \\\"My Documents\\\" ---> \\\"My Games\\\" ---> \\\"Skyrim\\\" ---> \\\"Saves\\\" and put the file there\r\n\r\n======\r\n[B]Story[/b]\r\n======\r\nMy name is Davyd, I was raised in Solstheim, Morrowind and i am 24 years old. About 3 months ago, After the death of my grandmother, My sister Vilja went to Skyrim on an odd quest with a bottle given from her grandmother. Thus days passes, We usually speak to each other by letters. After 2 months, I\\'m starting to ponder, Now that i am a mature person, I should go seek my fortune, Maybe i should go to Skyrim and maybe search for my sister whilst seeking my fortune. The very next day i went down to the city\\'s dock after saying goodbye to my parents and joined a trip to Skyrim by a ship named Red Wave heading to Solitude, A city in Skyrim. Alas the trip took a pretty while, And i\\'m running out of gold, Considering i wouldn\\'t be able to travel anywhere without gold, That very day i learned to pick people\\'s pocket and stealing food unseen, Days passes, And i even fed my self more than enough! I found this method is pretty profitting, Although i think i should steal from the rich instead of making the poor more miserable. 2 days later i\\'ve finally arrived to my destination. According to the letter i recieved from Vilja, She was in an inn called Bannered Mare in Whiterun, I should head there after i disembark the ship... And maybe steal a guard\\'s equipment  before heading there, As my family isn\\'t rich, Hence i came to Skyrim without even a spare clothes.\r\n\r\n==================\r\n[b]Recommended Mods[/b]\r\n==================\r\n\r\nVilja in Skyrim (Companion mod)- Yeah, The story idea is based on her, And you can actually pretend to be her brother.\r\nhttp://skyrim.nexusmods.com/mods/26393\r\nBinocular vision for NPCs while sneaking\r\nhttp://skyrim.nexusmods.com/mods/8719\r\nRequirements to join the Thieves Guild\r\nhttp://skyrim.nexusmods.com/mods/14157\r\nDiseased - Makes diseases... Some sorta more challenging\r\nhttp://skyrim.nexusmods.com/mods/27780\r\nNo requirements to buy breezehome - Since the main quest is disabled, You\\'ll need this if you wanna live in breezehome\r\nhttp://skyrim.nexusmods.com/mods/19055\r\n\r\nNote: In case you wanted to start the main quest, Open up console by pressing the \\\"~\\\" button and enter this: setstage MQ102 30\r\n\r\nP.S, This is my first upload, If i made a mistake please inform me about it and have mercy and don\\'t eat me!\r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "kr4pz",
  "createdUnix": "1359991088",
  "updatedUnix": "1359989773",
  "containsAdultContent": false,
  "uploadedBy": "Kr4pZ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000007021",
      "name": "Save game",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1343",
      "fileName": "Save game-30991-1-0.rar",
      "uploadedUnix": "1359989773",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7eb9e43639a5b01563400a857c50f601c811a179ed11d2a348a22f4799b815cc/analysis/1407396914/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Save%20game-30991-1-0.rar?fid=1000007021&ttl=1535806246&ri=8192&rs=8192&setec=476572b1b341faf039445735a27cc257"
    }
  ]
}