{
  "modId": 31019.0,
  "modName": "Gondor Armor",
  "summary": "",
  "descriptionHtml": "FACEBOOK!\r\nI now have a facebook page! So now you can easily get mod updates, chat to me, give me ideas, sketches, organize  mod projects or anything really. You may even on occasion get access to betas so I can get feedback before releasing final mods. This is the best place to message me as Nexus and steam workshop have limited messaging capability so on here I will always have a record of conversations:)\r\nhttps://www.facebook.com/pages/Maty743-Modder/531811283537450?ref=hl\r\n\r\nGondor Armor (lotr*) V1.0\r\nPlease don\\'t forget to endorse if you like :)\r\n[youtube]IiEkuQ_0SFc[/youtube] [youtube]OrEtMVASyLY[/youtube]\r\n---------------------------------------------------------\r\nCurrently working on adding weight slider support\r\n---------------------------------------------------------\r\nMOD FEATURES\r\n- All races and genders supported. (was designed for use of human players though.) \r\n- World/menu armor pieces for the first time in one of my mods\r\n- New custom handmade meshes and textures.\r\n- Body piece is comprised of multiple texture files = higher quality\r\n- Modular design complements my fountain guard armor mod\r\n- Light and heavy versions for different player types\r\n-----------------------------------------------------------------\r\nHOW TO ACQUIRE\r\nYou will need the Advanced smithing perk. Both the heavy and light armors can then be created at the forge under the steel category. The Heavy version has the about the same stats as Steelplate armor. The light has stats in between Steelplate and Elven.\r\n-----------------------------------------------------------------------------------------------\r\nSIDE NOTES\r\n-This is not meant to be a replica but more my own interpretation of the armor.\r\n- I have deliberately made the female armor quite bulky as it is ARMOR! \r\n---------------------------------------------------------------------------------------------\r\nCREDITS\r\n-Thank you to enpremi for letting me use his Shield mesh and base texture. Very much appreciated http://skyrim.nexusmods.com/mods/12274\r\n- Skyrim\r\n---------------------------------------------------------------------------------------------\r\nPERMISSIONS\r\n- At the moment my assets are not available due to the fact I will be making new armors out of some of these assets. Translation conversions are fine, just credit me and link. If you wanted to use this mod in a quest you can however... Just make duplicate files with the same names as this mod then ask the user to download this as well and put higher in the load order. That means your default armor files will be replaced with these armor files in game. This method also allows both parties to get credit for their contributions easily due to the user having to download both mods. Message me if your not sure what I mean. \r\n----------------------------------------------------------------------------\r\nDONATORS\r\nA huge thank you to users that have decided to make a donation. It is really appreciated. Thanks! \r\n- FelxcolossiCXx  \r\n- Tfig2110 \r\n--------------------------------------------------------------------------------------------------------------------------\r\n*This is a non-profit mod and is not intended for sales of any sort. It is in no way affliated with, or sponsored or approved, by Tolkien Enterprises, the heirs or estate of J.R.R. Tolkien Warner Brothers or any of their respective affiliates or licenses. I make no claim to armor designs that are trademarked, copyrighted or otherwise protected by law. This work is produced solely for the personal, uncompensated enjoyment for myself and other Tolkien fans\r\n",
  "categoryId": "54",
  "version": "1",
  "author": "Maty743",
  "createdUnix": "1360039695",
  "updatedUnix": "1360039421",
  "containsAdultContent": false,
  "uploadedBy": "maty743",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000007184",
      "name": "Gondor Armor",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57836",
      "fileName": "Gondor Armor-31019-1.rar",
      "uploadedUnix": "1360039421",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/88cce334ba2061fa118804ffbc7f343d95f872027901463368cd5d5f8c5167ba/analysis/1407398117/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gondor%20Armor-31019-1.rar?fid=1000007184&ttl=1535806289&ri=8192&rs=8192&setec=74e69deed201dd234a0628c61fa3072a"
    }
  ]
}