{
  "modId": 31020.0,
  "modName": "Destruction Reloaded",
  "summary": "A minimalist revamp of the Destruction Skill, focused on fixing and adding utility to the spells rather than simply pumping them up with damage increases.",
  "descriptionHtml": "This is my first mod, done as a product of my frustration with the infunctional vanilla spell system. It includes fixes for several mechanics that simply weren\\'t working as intended, as well as modifications to the Destruction perk tree to make it more interesting. Any feedback would be much appreciated!\r\n\r\n[b][u]Update 1.0.2[/u][/b]\r\nFixed a typo in the duration field of flames that cause it to not deal damage properly. Still working on a fix for leveling destruction via fire magic with the combustion perk.\r\n\r\n[b][u]Update 1.0.1[/u][/b]\r\nI have re-tuned the chance on hit effects of Combustion, Bone Chill, and Electrocute slightly. \r\n\r\nShock spells now reduce the damage of magical attacks cast by enemies by default, and the base magnitude of this effect is now increased by Electrocute.\r\n\r\nThe cost of dual cast spells has been reduced, and the base cost of Incinerate, Icy Spear, Thunderbolt, and Fire Storm have all been reduced.\r\n\r\nMaster level destruction spells now have a cast time of 2 seconds, up from 1.5 sec. \r\n\r\nThere are a few minor numerical adjustments I didn\\'t mention in full detail because, it\\'s unlikely that any player not looking for them via the console would notice them, plus I was tired of typing.\r\n\r\n[b][u]Known Issues[/u][/b]\r\nThere is currently an issue with the Combustion perked fire spells where the magic weakness effect is causing fire spells fail to increase the destruction skill (despite the proper application of the spell weakness and damage effects) Frost and Shock spells are still working as intended. I am currently working on a fix for this.\r\n\r\n[b][u]Compatibility[/u][/b]\r\nThis mod should be compatible with anything that doesn\\'t modify (a) The destruction perk tree layout (b) The Impact perk and/or (c) any vanilla destruction spells.\r\n\r\n[b][u]Installation[/u][/b]\r\nJust unpack and put the esp into your data folder!\r\nSimply remove it if you wish to uninstall.\r\n\r\n\r\n[b]All updates from 1.0.1 will be reflected in the mechanics section as follows:[/b]\r\n\r\n[B][U]Fixes to Vanilla[/U][/B]\r\n\r\nFixed an issue where the slow effects caused by frost spells were not properly applied by the vanilla system and modified the slow effects of frost magic spells. \r\n   -Added temporary inventoryweight changes to force the game to run a movement speed check on affected NPCs.\r\n   -Slows on these spells are no longer checked against frost resist, but have been reduced to 30% (before perks, while not dual casting). \r\n\r\nFixed an issue where the damage done to hostile NPCs by the frost master-level spell, \\\"Blizzard,\\\" was reduced by the player\\'s (caster\\'s) Frost Resist.\r\n    -In order to fix this Blizzard was converted into an aimed missile, which spawns the original blizzard hazard wherever it hits.\r\n\r\nMisc\r\n-Rune damage is now properly increased by Augmentation perks.\r\n-Changed some tooltips to reflect the finding that wall and cloak spells are in fact properly affected by the elemental augmentation perks.\r\n\r\n[B][U]Changes[/U][/B]\r\n\r\n[b][u]Perks[/u][/b]\r\nRemoved, \\\"Intense Flames,\\\" \\\"Deep Freeze,\\\" and \\\"Disintegrate,\\\" from the destruction perk tree and replaced them with, \\\"Combustion,\\\" \\\"Bone Chill,\\\" and \\\"Electrocute,\\\" respectively.\r\n\r\n[u]Impact[/u]\r\n-Impact now only has a 20% chance to stagger an enemy with a dual-cast spell, however dual cast spells now have a 50% chance to deal additional elemental damage (based on the spell type) equivalent to 110% of the single cast version, essentially raising the total damage of a dual cast spell which triggers the effect from 220% to 330%. In addition, impact works dynamically with the new perks (Combustion, Bone Chill, and Electrocute) to increase the chance of their chance-on-hit effects occurring from dual-cast spells.\r\n\r\n[u]Combustion[/u]\r\n-Triples the extra damage caused by the \\\"burning\\\" effect of fire spells. (Was roughly 10% of the spell\\'s instant damage for most fire spells, is increased to roughly 30% when the Combustion perk is taken) and gives fire spells a chance to make targets 35% (Increased to 43.75% and 52.5% with Augmented Flames rank 1 and 2, respectively) weaker to magic for 10 seconds. \r\n\r\nFlames and the concentration spray of Wall of Flames have a 7% (single cast), 14% (dual cast) and 21% (dual cast w/ Impact) chance to cause the effect for 3 sec.\r\n\r\nFirebolt, Fireball, and Incinerate have a 10% (single cast), 20% (dual cast) and 30% (dual cast w/ Impact) chance to cause the effect for 7 sec.\r\n\r\nFlame Cloak has a 7% chance to cause the effect for 3 sec whenever it deals damage.\r\n\r\nWall of Flames hazard has a 10% chance to cause the effect for 7 sec whenever it deals damage.\r\n\r\nFire Storm has a 30% chance to cause this effect for 7 sec.\r\n\r\n[u]Bone Chill[/u]\r\n-Increases the base magnitude of frost magic slow effects from 30% to 45% (Increased further to 56.25% and 67.5% with Augmented Frost ranks 1 and 2, respectively) and gives frost spells a chance to freeze (Paralyze) targets for a shor period of time.\r\n\r\nFrostbite and the concentration spray of Wall of Frost have a 7% (single cast), 14% (dual cast) and 21% (dual cast w/ Impact) chance to cause the effect for 2 sec.\r\n\r\nIce Spike, Ice Storm, and Icy Spear have a 10% (single cast), 20% (dual cast) and 30% (dual cast w/ Impact) chance to cause the effect for 5 sec.\r\n\r\nFrost Cloak has a 7% chance to cause the effect for 2 sec whenever it deals damage.\r\n\r\nWall of Frost hazard has a 10% chance to cause the effect for 5 sec whenever it deals damage.\r\n\r\nBlizzard hazard has a 21% chance to cause this effect for 5 sec whenever it deals damage.\r\n\r\n[u]Electrocute[/u]\r\n-Increases the base magnitude of the outgoing magical damage reduction caused to enemies by shock spells. Shock spells now reduce the magical damage dealt by afflicted attackers by 25% (increased to 31.25% and 37.5% with Augmented Shock tanks 1 and 2, respectively) for 3 seconds. In addition Shock spells have a chance to silence (prevent enemies from being able to cast spells) for a short period of time.\r\n\r\nSparks and the concentration spray of Wall of Storms have a 7% (single cast), 14% (dual cast) and 21% (dual cast w/ Impact) chance to cause the effect for 2 sec.\r\n\r\nLightning Bolt, Chain Lightning, and Thunderbolt have a 10% (single cast), 20% (dual cast) and 30% (dual cast w/ Impact) chance to cause the effect for 5 sec.\r\n\r\nLightning Cloak has a 7% chance to cause the effect for 2 sec whenever it deals damage.\r\n\r\nWall of Storms hazard has a 10% chance to cause the effect for 5 sec whenever it deals damage.\r\n\r\nLightning Storm has a 21% chance to cause this effect for 5 sec whenever it deals damage.\r\n\r\n[u]Rune Master[/u]\r\n-In addition to being able to cast runes farther away, players can now cast up to three runes at once.\r\n\r\n[b][u]Spells[/u][/b]\r\n\r\nAll master level spells have had their initial cast times reduced from 3 sec to 2 sec\r\n\r\nThe cost multiplier of dual casting has been reduced from 2.8x the cost of the single cast version of a spell to 2.0x the cost of the single cast version. The damage multiplier remains at 2.2x.\r\n\r\nIncinerate, Icy Spear, Thunderbolt, and Fire Storm have all had their magicka costs considerably reduced.\r\n\r\nAll shock spells now reduce the magical damage dealt by enemies by 15% (increased to 18.75% and 22.5% with Augmented Shock ranks 1 and 2, respectively) for 3 sec by default (i.e. with out the Electrocute perk).\r\n\r\n[u]Blizzard[/u]\r\n-Blizzard now launches a missile which spawns the original storm wherever it hits, the storm now lasts for 20 sec.",
  "categoryId": "93",
  "version": "1.0.2",
  "author": "WizardWhitenoise",
  "createdUnix": "1360048330",
  "updatedUnix": "1361851490",
  "containsAdultContent": false,
  "uploadedBy": "Soulfacade",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000007200",
      "name": "Destruction Reloaded",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Destruction Reloaded-31020-1-0.rar",
      "uploadedUnix": "1360044996",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9d5abca5ae992859d2df52a18e75b4032a18e46698c99c5b33424ecca4085662/analysis/1407398245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Destruction%20Reloaded-31020-1-0.rar?fid=1000007200&ttl=1535806290&ri=8192&rs=8192&setec=51a2e9b88c92368ebd7ee32f6475e283"
    },
    {
      "fileId": "1000007921",
      "name": "Destruction Reloaded",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Destruction Reloaded-31020-1-0-1.rar",
      "uploadedUnix": "1360292881",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/7fe7a50868577f870a3f3a4779aec50af0faa5a2f4bec15c4f01605b8924aa9e/analysis/1407403949/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Destruction%20Reloaded-31020-1-0-1.rar?fid=1000007921&ttl=1535806290&ri=8192&rs=8192&setec=f22a9cae2c14179e2e3fe99905652b1f"
    },
    {
      "fileId": "1000013317",
      "name": "Destruction Reloaded",
      "version": "1.0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Destruction Reloaded-31020-1-0-2.rar",
      "uploadedUnix": "1361851490",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/ea2dd269b9d668d8e8e4ec49a560c895634def71c501e8aad4c1514dc5c3a483/analysis/1407440214/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Destruction%20Reloaded-31020-1-0-2.rar?fid=1000013317&ttl=1535806291&ri=8192&rs=8192&setec=babc89821aab853adcbb2b0438b88283"
    }
  ]
}