{
  "modId": 31041.0,
  "modName": "Pilgrim Robes and Backpack",
  "summary": "Pilgrims are travellers, seekers of truth and enlightenment. Hearty folk, well-versed in the tomes of old. They profit in life by bartering in the market, or by persuading the weak-minded. ",
  "descriptionHtml": "[i][size=4]Pilgrims are travellers, seekers of truth and enlightenment. Hearty folk, well-versed in the tomes of old. They profit in life by bartering in the market, or by persuading the weak-minded. [/i][/size]\r\n\r\n\r\n\r\n\r\n\r\n[size=6][b]:: Description ::[/b][/size]\r\n\r\nAdds a recoloured variant of the Greybeard Robes to the game, complete with hood, along with a unique cape and backpack. Fitting the image of a Tamrielic pilgrim, traveller, or wandering healer. Nothing too fancy, something I\\'d been using myself for quite some time. Finally tidied up the bits included and thought I\\'d package it up for others who like to roleplay the wandering type or just fancied a new robe, cape and backpack. \r\n\r\n[size=6][b]:: Locations ::[/b][/size]\r\n\r\nTwo versions have been placed in the world; one enchanted, one unenchanted. \r\n\r\nHints: \r\n\r\nFor the enchanted version, rumours in Riften suggest a Nord pilgrim had been speaking about Dwemer ruins south of Darklight Tower, and had set off in that direction a week or so past. \r\n\r\nFor the unenchanted version, a guard in Morthal speaks of an Imperial who headed north-east through Hjaalmarch, with plans to search out wrecks along the coast.\r\n\r\nExact location spoilers can be found below, or if you just want the equipment for a character early on use the console: help \\\"pilgrim\\\" and the player.additem command\r\n\r\n[b][size=6]:: Installation ::[/size][/b]\r\n\r\nSimply extract the packaged files into Skyrim/Data \r\n\r\n[b][size=6]:: Uninstallation ::[/b][/size]\r\n\r\nBe sure to unequip any of the relevant items your character is wearing. Delete the \\\"Pilgrim Gear\\\" folders within Meshes and Textures and deactivate/delete Pilgrim Gear.esp \r\n\r\n\r\n\r\n\r\n:: Location spoilers ::\r\n\r\nAn unenchanted version can be found within the wreck of the Brinehammer, along the coast NE of Morthal.\r\nThe enchanted version can be found at the Ruins of Rkund, south of Darklight Tower. ",
  "categoryId": "60",
  "version": "1.0",
  "author": "Noodles",
  "createdUnix": "1360089554",
  "updatedUnix": "1360088614",
  "containsAdultContent": false,
  "uploadedBy": "Nikinoodles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000007313",
      "name": "Pilgrim Gear",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7254",
      "fileName": "Pilgrim Gear-31041-1-0.rar",
      "uploadedUnix": "1360088614",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b00b022fc403a3c78157eeaa6f5f3e29c4a0ecd1321138da3f17fbda02850e7c/analysis/1407398947/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pilgrim%20Gear-31041-1-0.rar?fid=1000007313&ttl=1535806320&ri=8192&rs=8192&setec=5b25ebb9390d8831a1dd2e525dd114b4"
    }
  ]
}