{
  "modId": 3105.0,
  "modName": "God Class",
  "summary": "A God had appeared into the realm, some 1000 years ago. You, a lone wander, looking for adventure, stumbled upon his weakend form. Foolishly attacking him, you were beaten soudly, but as the Unamed God left you in a pool of your own blood, you struck his back with lighting, his one weakness. He died soon thereafter, and you stole his power, living ",
  "descriptionHtml": "A God had appeared into the realm, some 1000 years ago. You, a lone wander, looking for adventure, stumbled upon his weakend form. Foolishly attacking him, you were beaten soudly, but as the Unamed God left you in a pool of your own blood, you struck his back with lighting, his one weakness. He died soon thereafter, and you stole his power, living in the shadows until the world needed you.\r\n\r\n===Instalation===\r\n1.Copy the file to your Skyrim base folder (look for TESV.exe)\r\n2.Launch the game\r\n3.As soon as you are able to press the tilde key (~)\r\n4.Type in: bat God\r\n\r\n\r\n===Adds===\r\nIt litterly makes you a God, meaning you regenerate Mana, Health and Stamina at an insane rate. You can also carry prettymuch anything, x300.\r\n\r\n===Uninstall===\r\nSimply go into the Skyrim base folder and delete \\\"God.txt\\\"\r\n\r\n===Credit===\r\nCredit for the original idea goes to the the Demigod class, which you can find at the end of the page.\r\nCredit for everything else is for me.\r\n\r\n===Link===\r\nDemigod Class: http://skyrimnexus.com/downloads/file.php?id=2110",
  "categoryId": "34",
  "version": "1.0",
  "author": "NekoWhite",
  "createdUnix": "1323410098",
  "updatedUnix": "1323410364",
  "containsAdultContent": false,
  "uploadedBy": "nagatora900",
  "primaryFile": null,
  "files": [
    {
      "fileId": "8455",
      "name": "God Class",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "God Class-3105-1-0.zip",
      "uploadedUnix": "1323410364",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/128653af713eb8fd50352d1b01a261c2bfaf010aab6feaadf7779c2daab22a34/analysis/1406496303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/God%20Class-3105-1-0.zip?fid=8455&ttl=1535757876&ri=8192&rs=8192&setec=16314cab9558b8edea078cd58ef3d855"
    }
  ]
}