{
  "modId": 31109.0,
  "modName": "Snowglade",
  "summary": "",
  "descriptionHtml": "This mod is still in its conceptual phase. I started this mod because the Bosmer are one of the races that have the  least presence in the game. Most races seem the have an area where they are commonly found or have some form of society (Argonian and Redguard are also at a minimal here)  So before we move on to the next Elder Scrolls game/ESO, There should be something that gives the Bosmer some stronger affiliation with Skyrim. I would also like to do this mod for any modders who are interested in producing and exporting custom architecture for Skyrim. This seems to be a factor that not many want to touch on due to technical difficulties especially with proxy issues.  If there is anyone out there who is interested in producing custom structures for Skyrim, It would be great to get some like minded people together on this project or as a platform for something else. But at the moment its just its a concepts and models that is open source. If anyone else out there is working on any similar projects please get in touch.\r\n \r\n\r\nSo this is the concept so far….\r\n\r\nSnowglade\r\n\r\n\r\nSnowglade is a place in Skyrim known in obscure legend and myth. Far to the south in the deepest forests of Valenwood it is spoken in whispers only among trusted circles. Known to the bosmer as ‘The Silent Road’ the hidden path trails from Skyrim deep into the mountains through to Cyrodiil, offering safe passage to Bosmer agents and scouts. Along the journey through caves and untold dangers, It is said the trail opens out into a clearing where the Bosmer have established a foothold. A small and secretive bosmer Settlement that has controlled the road for hundreds of years. But it is mythology that indicates that it was not the Bosmor that built the road. \r\n\r\nIn the eleven comical book ‘Ooh To Shoot A King In The knee’ Tells a story of a band of Bosmer sent secretly by king Eplear to track and kill King Borges of Winterhold. The book tells how the roads to Skyrim were so heavily guarded for King Borges’s convoy, that risking detection into Skyrim would almost certainly scupper the ‘wild hunt‘. After a comical attempt to disguise as Nords to fool the guards, The band gets desperate and scouts the bordering mountains for a safe point to climb across. Its  at this point in the book, they stumble across a mysterious magical doorway marked in in ancient snow elivish tones. After much pondering, The Shaman of the group is unable to solve the riddle of the tones. As they camp by the door with the quest looking bleak. The Shaman dreams he is visited by a spirit that reveals the magical words to unlock the door. On the mages success from the ghostly helper, they continue through where the pathway is dark a fought with danger. At this point in the book its ends from pages missing and continues with the band climbing down into the glade. There they setup camp as a base for the wild hunt after securing the Skyrim door. The book ends in a comical fashion with the evil King Borges getting ambushed and shot in the knee unable to flee as the beasts of the wild hunt close in.  \r\nFor an age the old story has been cast off as far-fetched or too stupid to be taken seriously. But with the dragons returning to skyrim from myth. Scholars are seeking the book for restudy. \r\n\r\nThe story has some standing with the local nord folklore who believe some locals have been told that Snowglade is real by Bosmer travellers. Such Bosmer as loud-mouthed travelling bards that boast ‘The Silent Road’ holds hidden secrets and powers that Valenwood greatly treasures. However the few local bosmor that have settled within the Nord settlements firmly deny its existence. \r\n\r\n\r\n\r\nPriority Goals \r\n\r\nI’ll be totally honest here. I would love to make a mod/add-on with complex story lines with multiple quests and twists and turns etc. but it would probably never see completion. This is what I’m intending to do. \r\n\r\n1) create a mountain dungeon walk-through to Snowglade positioned to the north west of Falkreath with custom entrance.  \r\n2) The Snowglade area at the end of the dungeon walk-through. A small valley area either in the main skyrim terrain or as a separate level. \r\n3) Custom Bosmer architecture with a few other Snowelf custom pieces.\r\n4) Small quest in finding the magic words to summon the magic door open. \r\n\r\nI’m looking for volunteers for\r\n\r\nTerrain Creators  \r\nEnvironment Artists \r\nQuest Scripters \r\nA writer for the book ‘Oh to Shoot A King in the knee’\r\n\r\n",
  "categoryId": "74",
  "version": "1",
  "author": "ChrisyM",
  "createdUnix": "1360158712",
  "updatedUnix": "1360164847",
  "containsAdultContent": false,
  "uploadedBy": "chrisym",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000007561",
      "name": "Skyrim Snowelf Ruin Asset",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7411",
      "fileName": "Skyrim Snowelf Ruin Asset-31109-1.zip",
      "uploadedUnix": "1360164847",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/584d77604665b07d39562d3d5b158f2da5e472a5cdd45a6b191e2cea02682584/analysis/1407400693/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Snowelf%20Ruin%20Asset-31109-1.zip?fid=1000007561&ttl=1535806445&ri=8192&rs=8192&setec=69194c3ab3d3d27e276dfb7d4f543bfc"
    }
  ]
}