{
  "modId": 31106.0,
  "modName": "Vampirism of Galejro",
  "summary": "This mod makes vampires what they should be (At least to my eyes). Makes vampires stronger and gives you a legitemate reason to feed: SunDamage/ feeding changes/ More Power/ changes to vampiris stages and more.",
  "descriptionHtml": "VAMPIRISM of Galejro\r\n\r\nby Galejro\r\n\r\nREQUIRES DAWNGUARD\r\n\r\nThis mod is my take on making vampirism what it should be. I do know there are already dozens of vampire overhauls, but maybe this one will fit your tastes.\r\n\r\nFinal Patch 1.2\r\n\r\n1. Added dialouges to custom NPCs of this mod. My low quality headphones that i can\\'t even get to cooperate and 5 characters speaking with the same male voice and british accent makes it better for them to be all mute. Now NPCs will not be the same gray characters with nothing else to offer than services. This includes Kallingrad in Solitude, be careful what you say to him.\r\n\r\n2. Added a quest to get both a room and NPC services in Grindvolk Manor. This is not a lazy quest with no quest markers and updates, this is depth. It\\'s a laughably simple and small quest but it\\'s a prelude to ther quest mod I will be making in the future. No markers, undetailed descriptions make it that you follow a QUEST not a dot on the map.\r\n\r\n3. Cosmetic upgrades of Grinvolk Manor, no more flsahsing darknes and light-related bugs. The exterior is pimped out a bit with nice gore, like any vampire lair should be.\r\n\r\n4. Changes in the Production of blood potions from this mod:\r\n\r\n-Kallingrad will now sell you twice less blood. \r\n-Now you can\\'t \\\"cook\\\" your blood using a cooking pot. Instead you must do it in style :) The description of how to do it now is available through a dialouge with a vampire from Gringvolk Manor. Deduce how and where by yourself, all I can tell that the ingredients haven\\'t changed.\r\n\r\nI can include a solution for complete dummies (the quest and getting blood) if you want, just give me a message or post a comment for this mod regarding it. I don\\'t wan\\'t to spoil the fun and a little detective work.\r\n\r\nPatch 1.1\r\n\r\n1. Fixes a possible issue with the vampire strike not costing health.\r\n\r\n2. Now all vampire lord spells cost health instead of mana according to the following chart:\r\nBats-50Hp\r\nCorpse Curse-20Hp\r\nMistform-50Hp\r\nDetect-50Hp\r\nRaise dead-30Hp\r\nSummon gargoyle-30Hp\r\nVampiric grip-20Hp\r\nSupernatural reflexes-50Hp\r\nVampire Sight/Night Cloak- no cost\r\n\r\n3. There is a new House for the Player. Grindvolk Mannor is now opened to all vampire. Inside there are 4 NPCs each one specializes in a different field: Alchemy, Spells, Weapons and Clothing/Misc. Should you like to live alone all those NPCs are not essential and DO NOT respawn (nothing stops you from killing them). NPCs are vampire allies so they may attack non-vampires making it a nice small dungeon. \r\n\r\n4. There is a new shop in Solitude: Kallingrad, a psychopathic fence, apart from buying shady goods, will also sell you 2 types of blood:\r\n-Regular craftable blood 100 health/Stamina/Magicka.\r\n-Highborn blood healing 300 health/Stamina/Magicka.\r\nBoth pretty expensive but hey, thats the only blood trader in skyrim.\r\n\r\n5. Not exactly a thing of this patch I forgot to mention this in the original release. Some text messages for vampirism are changed:\r\n-When you starve the message will tell you that you get weaker.\r\n-When you reach 4th lvl of vampirism it will tell you that you die of starvation.\r\n-The sh..y message \\\"Your vampiric powers recede as you feed\\\" is now removed and the good old Oblivion \\\"Your hunger for blood has been satisfied ... for now\\\" IS BACK.\r\n\r\n\r\nWhat it does?\r\n\r\n1. It makes changes to vampirism progression as following:\r\n\r\n-1 lvl: Vampire Has all spells, Greatest Strength and weakest Sun Damage weakneses. Also the vampire has access to \\\"Vampire strike\\\".\r\n-2 lvl: Vampire Looses some spells (including Vampire Strike), has medium strength and Sun Damage weakneses. \r\n-3 lvl: Vampire has great weankes and little strength, at this stage people are hostile to you.\r\n-4 lvl: Vampire dies of starvation.\r\n\r\n2. It makes changes to Vampiric drain, now it has increased damage 5/10/20/40 Damage.\r\n\r\n3. Adds a new vampiric spell at the first lvl of vampirism \\\"Vampiric Strike\\\": It\\'s a wealdable Vampiric Drain from the Vampire Lord set at 80 dmg + 22 drain health/Magicka/Stamina at the cost of 40 mana. It also charges the vampire lord leveling.\r\n\r\n4.             \\\"Life has no meaning any more does it? The wine has no taste, the food sickens you, there seems no reason for any of it, does there.\\\" (Lestat, Interview with the Vampire)\r\n\r\nFood and alcocholic drinks no longer take affect when a Vampire consumes them. Only blood is allowed to drink. This does not affect Potions and alchemical ingredients, these are still edable.\r\n\r\n5. You can now craft your own blood using the cooking pots, the recipe is as following:\r\n\r\n1 Human heart or flesh + vampire dust = 2 blood extract (the extract heals 100 health/Mana/Stamina and feeds the vampiric hunger).\r\n\r\n6. Upon feeding you get healed 100 points.\r\n\r\n7. Last but not least, it adds an actual Sun damage into the game. Whenever a vamapire gets exposed directly to the sunlight (that is, it must be day between 5a.m. and 7p.m. and the vampire must stand anywhere where the sunlight falls) a vampire will recieve 50 health damage per 2 secons until it eats up 1000 health. This damage is dealt ONLY when a vampire is directly exposed to sun\\'s rays, in shadows the damage will stop. \r\n\r\nWARNING: \r\n\r\n-At first the spell will not take effect, in order to get it (As well as the Vampiric Strike Spell) you must simply feed. Once you have fed once the effect will be permanently added.\r\n-Sun Damage may stack up when you try to walk past several sunlit spots and you may recieve 100 damage per 2 seconds or more.\r\n-Sun Damage is a scripted event based on Light Level. This means that even if you stand in a shadow you will take Sun Damage if you stand next to a lantern or a torch or weald a spell in your hands.\r\n\r\n\r\n\r\nDoes it have problems?\r\n\r\nYes it does:\r\n\r\n-The Sun Damage may occasionaly bug, dealing you damage outside even if it is night.\r\n-I suck at scripting and the eclipse will probably not be noticed by Sun Damage scripting event. The light during eclipse may deal you damage just like in broad daylight.\r\n\r\n\r\nCredits:\r\n\r\n-Scripting base for vampirism by David Brasher",
  "categoryId": "79",
  "version": "1.2",
  "author": "Galejro",
  "createdUnix": "1360155644",
  "updatedUnix": "1364400509",
  "containsAdultContent": false,
  "uploadedBy": "Galejro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000007532",
      "name": "Vampirism of Galejro",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "Vampirism of Galejro-31106-1-0.rar",
      "uploadedUnix": "1360155281",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8f22ac165abb3b205ddea35e66bd02d6c4cda6e95823f3cc7e818cfe2e38bde2/analysis/1407400503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampirism%20of%20Galejro-31106-1-0.rar?fid=1000007532&ttl=1535806441&ri=8192&rs=8192&setec=65757f8a857e7218bc488016c33aad3e"
    },
    {
      "fileId": "1000009755",
      "name": "Vampirism of Galejro latest patch",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "117",
      "fileName": "Vampirism of Galejro latest patch-31106-1-1.rar",
      "uploadedUnix": "1360843909",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/09c24f81a6bb6640ece41c74766724bc9568322436c8810d720efdfd792bec91/analysis/1407416819/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampirism%20of%20Galejro%20latest%20patch-31106-1-1.rar?fid=1000009755&ttl=1535806441&ri=8192&rs=8192&setec=bbb6aba3f728f9066bd817d6ed932394"
    },
    {
      "fileId": "1000020550",
      "name": "Vampirism of Galejro Final Version",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "248559",
      "fileName": "Vampirism of Galejro Final Version-31106-1-2.rar",
      "uploadedUnix": "1364400509",
      "modVersion": "1.2",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampirism%20of%20Galejro%20Final%20Version-31106-1-2.rar?fid=1000020550&ttl=1535806441&ri=8192&rs=8192&setec=ededded6988b8a262a8decd51b25c948"
    }
  ]
}