{
  "modId": 31129.0,
  "modName": "CD Slower Werewolf Perk Points",
  "summary": "Ever felt like you gain werewolf perk points too quickly? This makes it were you have to feed more times to gain a new werewolf perk point. And consequently you will gain werewolf perk points at a slower rate. DOH&#33; That&#39;s all there is to it but you can read my insanely long description for such a teeny mod if you are a glutten for punishmen",
  "descriptionHtml": "[center][/center]================================================================================================================================\r<br />[center]CD Slower Werewolf Perk Points README [/center][center]   Version 1.0[/center]================================================================================================================================\r<br />\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/65163-1-1430165301.png[/img][/center]\r<br />\r<br />1. Description\r<br />2. Install\r<br />3. Requirements\r<br />4. Compatibility\r<br />5. History\r<br />6. Contact and Feedback\r<br />7. Credits\r<br />8. Legal/Licensing\r<br />\r<br />===============\r<br />1. Description\r<br />===============\r<br />\r<br />Short Description: \r<br />You have to feed more times to gain a new werewolf perk point. And consequently you will gain werewolf perk points at a slower rate. DOH&#33; Please read about saves with werewolf perk points already gained below&#33;\r<br />\r<br />\r<br />Long Description:\r<br />\r<br />I made this mod as I think that the vanilla Dawnguard DLC1WerewolfNextPerk value of 5 gains werewolf perk points too quickly. If you went into the right dungeon or area as a werewolf you could easily feed enough times to get 3 - 4 werewolf perk points in a short amount of time. Lycanthropy is a gift and curse at the same time and I felt that it should take a longer amount of time to gain the werewolf perks to better simulate struggling with the &#34;gift&#34; and gradually learning how to master it.  In short I just don&#39;t think you should become the unstoppable werewolf juggernaut Petrovsk (If only he was still in IC, I miss him&#33;) after having the gift of lycanthropy for a week. \r<br />\r<br />This mod simply renames and increases the Dawnguard DLC1WerewolfNextPerk global variable that sets the number of times you need to feed in beast form to get to the next werewolf perk point. In vanilla Dawnguard the DLC1WerewolfNextPerk is set to 5 and increases by two each time you get a perk point. So after feeding 5 times in vanilla Dawnguard you would have one werewolf perk point available. To reach the next werewolf perk point you would need to feed 7 times and the next after that 9 times and so on. \r<br />\r<br />There are five versions of this file setting the global variable value to 10, 15, 20, 50 and 100 (Which I call INSANE&#33;) respectively. The vanilla Dawnguard value of 5 for the DLC1WerewolfNextPerk global variable means that you would have to feed as a werewolf 165 times to unlock all 11 Dawnguard werewolf perks. Setting this to 10 means you have to feed 220 times to unlock all 11 perks. Setting it to 15 equals 275 times, setting it to 20 equals 330 times, setting it to 50 equals 660 times. And finally setting it to 100 (INSANE&#33;) means you have to eat 1210 npcs to unlock all 11 Dawnguard werewolf perks and pray you don&#39;t get indigestion. So make sure you take along antacid and some toothpicks when you go hunting those pesky npcs. \r<br />\r<br />BTW if you are curious the DLC1WerewolfNextPerk global variable has been recreated as CDDLC1WerewolfNextPerk, so now you can find it in the CK to change it to whatever you like if none of my options suit your taste. BURP&#33;&#33;&#33;\r<br />\r<br />****CONCERNING SAVES WITH WEREWOLF PERK POINTS ALREADY GAINED****\r<br />\r<br />This mod WILL work with saves that have already gained werewolf perk points through feeding. The only caveat being that the count will start at the global variable value and go from there. So in other words if you have already gained 5 werewolf perk points with the vanilla Dawnguard global variable of 5 on a werewolf save you would have to feed 15 times to reach the next perk point. If you were to install &#34;CDSlowerWerewolfPerkPoints10&#34; using that same save to get to the next werewolf perk point you would feed 10 times and go from there. \r<br />\r<br />For this reason I advise only installing &#34;CDSlowerWerewolfPerkPoints10&#34; on a save that has not gained any werewolf perk points. \r<br />Or installing &#34;CDSlowerWerewolfPerkPoints15&#34; on a save that has only gained 6 werewolf perk points or less. \r<br />And of course if you already have all possible werewolf perk points there is no reason to install this mod, unless of course you are starting a new save to enjoy munching on a lot of bandits or the occasional yarl.\r<br />All the other mod options should fit in rather well with any amount of werewolf perk points you may have already gained.\r<br />\r<br />===========\r<br />2. Install\r<br />===========\r<br />\r<br />Open the &#34;CDSlowerWerewolfPerkPoints.7z&#34; zip file and Unzip/Uncompress the contents of the folder with the werewolf next perk global variable value (10,15,20,50,100) that you&#39;d like to use to your Skyrim data directory: (..SkyrimData). Use the Skyrim Launcher or the Nexus Mod Manager to activate the &#34;CDSlowerWerewolfPerkPoints.esp&#34; file. To uninstall simply delete the &#34;CDSlowerWerewolfPerkPoints.esp&#34; and the &#34;CDSlowerWerewolfPerkPointsREADME.txt&#34; files from your Skyrim Data directory \r<br />\r<br />Alternatively you can use the Nexus Mod Manager to easily install and uninstall this mod. And this is the method that I would advise.\r<br />\r<br />================\r<br />3. Requirements\r<br />================\r<br />\r<br />You must have Skyrim version 1.8.1.151.0.7 or higher and Dawnguard installed for this mod to work. \r<br />\r<br />=================\r<br />4. Compatibility\r<br />=================\r<br />\r<br />***Works fine with Brevi&#39;s Moonlight Tales located here ... http://skyrim.nexusmods.com/mods/35470/?    Make sure the CD Slower Werewolf Perk Points esp is placed after Brevi&#39;s Moonlight Tales.***\r<br />***Works fine with Brevi&#39;s Moonlight Tales - Werewolf Essentials located here \r<br />... http://www.nexusmods.com/skyrim/mods/59463/?***\r<br />***Seems to be working fine with the latest Skyrim Patch.***\r<br />\r<br />Should be compatible with any Werewolf mod as long as it does not alter or circumvent the werewolf next perk global variable used by the DLC1WerewolfFeedPointsScript script attached to the PlayerWerewolfVictimEffect magic effect to keep track of the unfortunate NPCs that have been eaten. (YUMMY&#33;)\r<br />\r<br />*BUT* frankly I am not sure what this is or is not compatible with. I do not know how any mod that adds extra werewolf perks beyond the vanilla Dawnguard&#39;s 11 would work with this mod. Currently I am using it or have used it with no problems with the following werewolf based mods:\r<br />\r<br />Tales of Lycanthropy - Werewolf Overhaul - Core, \r<br />\r<br />Tales of Lycanthropy - Werewolf Overhaul - SKSE,\r<br />\r<br />Tales of Lycanthropy MCM Menu, \r<br />\r<br />Heart of the Beast - Werewolf Sound and Texture Overhaul - Alpha Werewolf,\r<br />\r<br />Heart of the Beast - Werewolf Sound and Texture Overhaul - Speed Upgrade, \r<br />\r<br />Brevi&#39;s Moonlight Tales,\r<br />\r<br />Ring of Hircine Simplified (My own version made with the latest CK as BOSS reports the old mod as containing &#34;..unexpected (or out of order) records and should be removed&#34;.) \r<br />\r<br />If you experience any compatibility issues by all means let me know.\r<br />\r<br />===================\r<br />5. Version History\r<br />===================\r<br />\r<br />Version 1.0 - Initial release and hopefully the only release.    \r<br />\r<br />========================\r<br />6. Contact and Feedback\r<br />========================\r<br />\r<br />Please contact me via pm on the Nexus. Any feedback or bug reports are welcome.\r<br />\r<br />===========\r<br />7. Credits\r<br />===========\r<br />\r<br />To Bethesda for Skyrim and Dawngaurd and of course the CK so I could fix this annoyance (to me at least).\r<br />\r<br />And to you for reading through this insanely long description for such a teeny tiny mod. \r<br />\r<br />===================\r<br />8. Legal/Licensing\r<br />===================\r<br />\r<br />Please feel free to do whatever you wish with this mod, change it, use it or improve it in any way. No permission needed. If you do however use it in a mod that you are making let me know if you upload it somewhere as, who knows, your mod may be great and I may want to use it too&#33; :) YAY\r<br />\r<br />******************************************************************************************************************************************************************\r<br />My other mods :\r<br />[url=http://www.nexusmods.com/skyrim/mods/57886/?]CD Female Dragonscale Ebonsteel Armor Fixes[/url] - Some fixes to the Female Ebonsteel Grand Helm and Boots\r<br />[url=http://www.nexusmods.com/skyrim/mods/63978/?]CD Nord Ygritte Snow-Crowned Follower[/url]  - My Ygritte Snow-Crowned character as a follower\r<br />[url=http://www.nexusmods.com/skyrim/mods/63937/?]CD Nord Ygritte Snow-Crowned Racemenu Preset[/url] - Play as my newest character, Ygritte Snow-Crowned",
  "categoryId": "24",
  "version": "1.0",
  "author": "caldurham",
  "createdUnix": "1360184517",
  "updatedUnix": "1360525724",
  "containsAdultContent": false,
  "uploadedBy": "caldurham",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000008788",
      "name": "CDSlowerWerewolfPerkPoints",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "264",
      "fileName": "CDSlowerWerewolfPerkPoints-31129-1-0.7z",
      "uploadedUnix": "1360525724",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/894a85f4d707d6f1efb36e478a77a4bd16f808e477772b3765ed9d7ff1998a62/analysis/1407409926/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CDSlowerWerewolfPerkPoints-31129-1-0.7z?fid=1000008788&ttl=1535806472&ri=8192&rs=8192&setec=23962506e88bad7a24fa77965e2cda60"
    }
  ]
}