{
  "modId": 31203.0,
  "modName": "Skyrim Extreme",
  "summary": "The loss of most magical healing in Skyrim and many other things that make life in Skyrim too easy.",
  "descriptionHtml": "Stridrcore -- Severe Skyrim\r\n\r\nWe all know about hardcore playing, right? Gotta eat, catch some ZZZ\\'s and all that? This is harder than that. This is more challenging than most anything you\\'ve faced yet. This is Stridrcore.\r\n\r\nWHAT IS STRIDRCORE?\r\n\r\nStridr is the Old Norse word for \\\"severe\\\" (according to the York English-Old Norse Dictionary) and it is a mod made for those to whom hardcore is child\\'s play. It makes a variety of changes to the game that make it challenging in many new ways. It mostly focuses on the three attributes of health, magicka and stamina, but also lightly touches upon the economy, enemies, spells, potions, and races. \r\n\r\nThe root of this mod has to do with the healing system and how I thought it made the game just too darned easy, even playing on a difficult level. I started playing with the idea of crippling all healing spells and found that it created an enjoyable and challenging game requiring real tactics without just making monsters cause more damage. Most importantly, this change was done in a lore-friendly manner, and it is possible to complete a quest to restore magical healing back to a level close to normal.\r\n\r\nFrom that one aspect, I found it necessary to adapt other aspects of the game, from the obvious changes like deleting health regeneration and changing potions, to the obscure like tweaking the economy and enemies. These changes, many of which are new ideas introduced to Skyrim, come together to present you with an fun role-playing experience. And if you combine this with my other mod, Skyrim Perk Extravaganza, you will never have a cookie-cutter PC again.\r\nSo... milk drinkers, turn back now.\r\n\r\nNote: This mod was designed for use with a time scale of 20, but can be used fine otherwise, especially if you are using an eat/drink mod.\r\n\r\n\r\nHEALING AND THE WRATH OF KYNARETH\r\n\r\nAs you journey through Skyrim, you see soldiers laying in tents, wounded and near death. In the College of Winterhold, you meet one of the head mages and she constantly complains that no one takes Restoration magic serious any longer. In Whiterun, the once splendid Gildergreen stands barren. What happened?\r\nWhen the White-Gold Covenent banned the worship of Talos, it weakened the link between mortals and the Divines. The Lady Kynareth, who was already grieving over her beloved Shor, became furious at this apostasy. She fell into such a fit of rage that she lashed out at her sacred tree in Whiterun with lightning, nearly destroying it. Falling deeper into sorrow because of what she had done, she withdrew much of her presence in Skyrim, leaving only Arkay keep the power of magic healing going in a severely crippled state.\r\nMost people of Tamriel usually consider Arkay to have complete dominion over healing, but Kynareth also holds sway over restoration magic due to her domain\\'s connection with the Aetherius. This may be proven since Tamrielic history tells us her ancient artifact, the Lord\\'s Mail, could heal all who wear it.\r\n\r\nRestoration magic at the start of the game is weakened so that each point of health healed costs much more than usual. For instance, the starter Healing spell in Vanilla Skyrim heals 10 points per second at a cost of 10 magicka per second. This spell, now called Magic Healing since most normal people are not used to such a miracle, only gives you 2 health per second for a cost of 5 magicka.\r\nYou can reduce the cost of all your healing spells with the normal perks and also double their magnitudes by completing a certain quest and taking the Respite perk. The minimum skill requirement for this perk has been removed so you just have to complete that quest. What quest it it? I\\'ll leave that to you to figure out...\r\n\r\nThere is no health regeneration any longer, except for Argonians, because I feel that is an aspect that belongs in a first-person shooter and not a fantasy game with potions and magic. The people of Black Marsh have a small regeneration rate just below that of vanilly Skyrim and it is still possible to gain magic items that bestow a small, constant healing rate. The most common ways to gain a health regeneration effect is by eating stews, sleeping  and drinking regeneration potions. All of these actions provide you with an effect lasting 300 to 4800 seconds.\r\nIMPORTANT: Skyrim does not display decimals in its UI, therefore, these potions will say that they are healing 0 Health every second. However, the rate is 0.5 and you will be able to tell by the slow healing of your character.\r\n\r\nTo help balance the loss of magic healing, the healing properties of Nirn have become stronger. Potions will now heal more wounds, but they work over a 5 second duration. The same goes for restorative magick and stamina potions. You may combine any of these in a cooking pot to make better potions. They have been weighed in both cost and magnitude so that you can combine two of them to make a stronger potion without losing any magnitude or gold value.\r\nAll restorative potions have been renamed for categorization, with names beginning with either Healing, Stamina or Magicka. They also all have 5 levels of magnitude: Mixture, Brew, Potion, Philter, and Elixer. \r\nYou can use food to restore or boost your stamina.\r\n\r\nTHE QUALITIES OF A STRIDRCORE HERO\r\nWith Stridrcore, everyone in Skyrim is unique. Each race has its own strengths and weaknesses. For instance, Nords can carry a lot more than Wood Elves, but they also have a very weak connection with the Aetherius, so they do not have much magicka at all. Redguards can last longer in without getting winded in combat, but high elves can use more magic than any other race around. Yet, what makes Stridrcore heroes stand out among them all?\r\nFirst, there must be a power that comes to heros ever before they set out along their path. In this case, it is the Magical Healing spell. No one starts with any spells any longer, but Stridrcore heroes start out with the standard healing spell. Even though this is in a much weaker form than the vanilla counterpart, this little spell sets them apart from most everyone else because healing is just so rare these days.\r\nAlthough Stridrcore heroes learn their craft very slowly in the early stages of their career as compared to normal heroes, they do seem to advance more quickly in later levels. It also becomes apparent that whoever watches over them bestows blessings that allow them even more health, magical power or stamina with each level of experience that they achieve. This is important because these three attributes can make or break a hero, the latter especially if they are not used wisely.\r\nHeroes must have a healthy body so that they may survive the dangers of combat and the wilderness. If they take too much damage, they will bleed out and lose more health in the process. They must also be able to endure all the things that tax their stamina, such as running, sprinting, and power attacks. If they get too tired, they will be less effective with their weapons and blocking. They may even find themselves tripping while in combat, allowing for their opponent to get a free shot or two in.\r\nMagic-oriented heroes may scoff at melee and prefer to fight their foes from a distance, yet they too may tire themselves out from running around avoiding direct combat. They may also trip themselves up while casting a spell. The worse dangers for this type of hero, however, comes when they expend too much of their spiritual power. When it is about half gone, their spells will become far less effective than usual. Even worse is when they drain themselves of power, they may find themselves blacking out from the mental exertion until their power is restored.\r\n\r\nCHALLENGES OF THE STRIDRCORE HERO\r\nMany types of foes await heroes beyond the walls of the city. Each type also has combatants that range from the very weak to the very strong. Unfortunately for the Stridrcore heroes, there is no way to tell the difference as to what experience level these foes are at. This is too bad, because if they are too strong, they will follow heroes into and out of whatever place they try to hide. Once they begin combat, they will chase the intruding heroes out of their lair, into cities, and wherever else they flee to.\r\nWoe also to the Stridrcore heroes that face giants and trolls for these beings are bigger, stronger and more deadly than ever before. Giants have more healthy bodies than any other being with the exception of dragons, so it truly takes a hero to bring that being to the ground. \r\n\r\nREWARDS OF THE HERO\r\nGold. It is what the adventuring life is all about for many heroes. Even for those with more noble causes, it is gold that keeps the sweet rolls coming. However, Stridrcore heroes do not have it easy with gold. It is more rare for them to find it, especially among falmer and draugr. It is also heavy, with about 15 coins making up a single unit of weight. A Nord carrying nothing but the clothes he is wearing can carry about 4300 coins, but other races will be able to make it back from dungeon delving with far less, especially if encumbered with armor and weapons. It is best to find gems, jewelry and other things that provide good value without being so heavy, especially because the amount of weight heroes can carry remains the same throughout their whole career.\r\nWhen Stridrcore heroes make it back to the city to use their hard-earned coin, they have another battle waiting for them in the merchant shops. The vendors they trade with have a much more varied amount of gold on any single day. They could even be out of gold for purchasing the hero\\'s hard-wrought gain. In general, it is better to sell your goods at city blacksmiths and general stores than small towns. The beginning Stridrcore hero will also have to contend with some very poor deals, but as experience in trading progresses, these deals will become much better than even normal heroes get.\r\n\r\nOTHER CHANGES\r\nPlease see the Read Me for other changes, as well as specific changes mentioned in the above Description.\r\n\r\n\r\n\r\n\r\nCOMPATABILITIES\r\n-If you are using an eating/drinking mod, load Stridrcore before it to let your food continue to satisfy your hunger. I use IMCN and have customized it to include the restoration values of this mod. I may upload that if enough people want it and I get perms from the mod author.\r\n \r\n-Mods that change the playable vanilla races, the troll race, the giant race, levelled lists of vendors, draugr, bandits and falmer will conflict with this mod, so decide the change you want and load that mod last.\r\n\r\n\r\nACKNOWLEDGEMENTS\r\nThanks to Bethesda for the Elder Scroll Series\r\nThanks to all the modders who inspired me in the ES series\r\nThanks to my kids for waiting patiently for the computer while I put my mods together.\r\n",
  "categoryId": "24",
  "version": "1.0",
  "author": "Magickman12",
  "createdUnix": "1360292746",
  "updatedUnix": "1360289160",
  "containsAdultContent": false,
  "uploadedBy": "magickman12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000007909",
      "name": "Stridrcore -- Severe Skyrim",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "113",
      "fileName": "Stridrcore -- Severe Skyrim-31203-1-0.7z",
      "uploadedUnix": "1360289160",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/54de26de5e21c806e012aafaf90d1c250473ffa33192c3e6a8dfb3a0eae7efb7/analysis/1407403814/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stridrcore%20--%20Severe%20Skyrim-31203-1-0.7z?fid=1000007909&ttl=1535806595&ri=8192&rs=8192&setec=f0172ca79473eca56125ac602a76c13d"
    }
  ]
}