{
  "modId": 31232.0,
  "modName": "LEVIATHAN Creatures of the Deep",
  "summary": "ALPHA STAGE: currently adds a number of \\\"leviathans\\\" to Skyrim and one \\\"Leviathan Gargant\\\". ",
  "descriptionHtml": "This mod is in aplpha stages and I need some help with it. I know there are alot of people looking for a Sea Monster mod so I decided I would learn to create new meshes and give the community what they want! so far this simply adds a number of giant sluaghterfish with a slightly changed texture and one massive one. They can be found around some of the wrecks in skyrim off the northern coast and one around the sunken fortresss in the lake North of Falkreath and the Gargant is north of Widows Watched ruins (almost at the edge of the map in the deepest water of the area). If anyone can get some decent screenshot\\'s they will be featured and once I get the meshes up if anyone wants to do textures (since I have very little artistic skill when it comes to drawing on the computer) that would be much appretiated. If you find any bugs or think of any cool locations for one don\\'t hesitate to ask. Also if you find any bugs then also just post in the comments and I\\'ll do what I can (I am fairly new to modding).\r\nDoes NOT require any DCL.\r\n\r\nIntallation:\r\n\r\nSimply Use NMM or open the archive file and put the .esp file into your data folder.\r\n\r\nFuture Update Progress:\r\n\r\n-New Area named \\\"The Santiago Isles\\\" in progress (First island has been created but needs populated with NPC\\'s. Entrance is currently via a portal at dawnstar, it\\'s hard to miss)\r\n-New mesh for Leviathan Gargant which will be renamed Leviathan (I actually finished the mesh today, 9th Febuary, and i just need to find someone to help with textures, i will upload a pic of the mesh soon)\r\n-New mesh for Leviathans which will be renamed (I will do this once the Leviathan has texture, until then I will work on the new area)\r\n\r\nUpdate:\r\n\r\nOk guys, here\\'s how it stands: i am working on the new area as well as new meshes for new creatures and it will take a while. If you want to updated when a new version come up send \\\"UPDATE\\\" to this email adress: leviathanskyrim@gmail.com and i will send an email out. if you want regular updates on my progress and some pictures of new meshes or areas in the \\\"Santiago Isles\\\" (new area i am creating for this mod) send \\\"UPDATE +\\\" to the same email and you will be sent pictures of new meshes & textures, updates as to what is happening with the mod and any other relevant information. you will not be sent any spam mail and i will not give your emails to any 3rd party organisations (i don\\'t know any). thanks for all the downaloads and my 1 endorsemnt! really appreatiate it. As for the bug people are having with the purple leviathan textures, try re-installing the mod, the only texture in the mod is included in the esp file so the only thing i can think is that you need to update your skyrim. if you are fully updated then i am not sure. Also i think that people using hacked versions of skyrim could experience such problems (i don\\'t expect anyone to admit to that, but i know it can cause problems as other modders have warned about it on their mods) so if you are guilty of that just get the real version of the game.\r\n\r\nSide note: i do not endorse hacking games in any way shape or form, i think it is a rediculous activity that is killing the gaming industry, just buy the game!!! sorry for ranting.",
  "categoryId": "83",
  "version": "Alpha1.0.1",
  "author": "1r0nm0nk3y",
  "createdUnix": "1360330861",
  "updatedUnix": "1360332611",
  "containsAdultContent": false,
  "uploadedBy": "1r0nm0nk3y",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000008009",
      "name": "LEVIATHAN Creatures of the Deep",
      "version": "Aplha1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "LEVIATHAN Creatures of the Deep-31232-Aplha1-0.zip",
      "uploadedUnix": "1360330518",
      "modVersion": "Aplha1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ee68f64327e2cc0d5fd2c001448086a723384c84babdd2fe2df9a33239c01ab7/analysis/1407404642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LEVIATHAN%20Creatures%20of%20the%20Deep-31232-Aplha1-0.zip?fid=1000008009&ttl=1535806650&ri=8192&rs=8192&setec=b0d796a8433e792617b96a3db1d446e2"
    },
    {
      "fileId": "1000008012",
      "name": "LEVAITHAN Creatures of the Deep",
      "version": "Aplha1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "LEVAITHAN Creatures of the Deep-31232-Aplha1-0-1.zip",
      "uploadedUnix": "1360332611",
      "modVersion": "Aplha1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/2f3b424315a7183831c43a076f4303fe7af36048659eec0659a5d2df3d310efb/analysis/1407404657/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LEVAITHAN%20Creatures%20of%20the%20Deep-31232-Aplha1-0-1.zip?fid=1000008012&ttl=1535806650&ri=8192&rs=8192&setec=a18f7cd72037530cccce0074574be26a"
    }
  ]
}