{
  "modId": 31241.0,
  "modName": "Surveyors",
  "summary": "Although clad into a playable mod, this was primarily conceived as a tool for modders. Its purpose is to measure in-game travel times of NPCs between Skyrim cities and settlements and printing the results in a separate log.",
  "descriptionHtml": "Although clad into a playable mod, this was primarily conceived as a tool for modders. It adds some immersion by populating the game world with some NPCs who are frequently met travelling along the main roads, but beyond this, it doesn\\'t anything add to gameplay. \r\n\r\nThe primary purpose of this mod is to generate reliable in-game travel times of NPCs between Skyrim towns and settlements. While working on another project, I wanted to set up NPCs whose everyday schedules considerably differ from those of vanilla NPCs in that they do not stay at a town or in its immediate environment, but are supposed to travel between different locations at fixed times of the day or week. In order to set up appropriate AI packages, I needed to know their approximate travel times. Since these are best measured in the running game by \\\"real\\\" NPCs, I did put this small mod together, which places surveyors in every hold capital and lets them travel at various speeds (the \\\"fast walk\\\", \\\"jog\\\" and \\\"run\\\" options of the package forms) to a number of preset destinations. Their survey results are recorded in game hours and will be printed on a separate user log.\r\n\r\n\r\nInstallation:\r\n========\r\n\r\n(1) Unpack the archive and drop the contents into your \\\"...\\\\Skyrim\\\\Data\\\" folder\r\n(2) Don\\'t forget to enable the papyrus logs in your skyrim.ini file\r\n\r\nThe survey results will be printed on separate user logs that are found in the \\\"My Documents\\\\My Games\\\\Skyrim\\\\Logs\\\\Script\\\\User\\\" folder (this folder will be created automatically once the log is enabled and the mod is running).\r\n\r\n\r\nUninstallation:\r\n==========\r\n\r\n(1) General note:\r\nThis is a scripted mod, and as such it will store script-related information in your save game. Note that this behaviour is not specific to this mod but a general behaviour of scripted mods, which can lead to severe complications when it is not properly taken care of. I have taken appropriate measures to prevent this from happening, but I also expect that the uninstallation procedure outlined below may appear rather weird to some of you. This is possibly because you\\'re not aware of the actual problem, and if so, I recommend that you read the following lines carefully:\r\n\r\nWhen a game is saved, all running scripts are instantly stopped, and to make sure that they are properly resumed when the save is reloaded, all the related information is written in the save file. If there are several instances of a script running when the game is saved, there will be separate blocks of information written in the save file for each single instance and it is obvious that this may bloat the saves considerably (imagine, for example, that a mod attaches a script to a common clothing item and lets it carry out a specific task while the item is worn: a separate instance of the same script will then run on each equipped copy of the item, and because those instances all run independently, they have to be treated like separate scripts, so to say, when the save game is written). When a game is reloaded, the engine will reconfigure the scripts from the information it finds in the save file and then tries to complete all scripts tasks that have been interrupted when the game was saved. When the respective mod has been removed in the meantime, all those tasks will fail to execute. Unfortunately though, the tasks are not discarded when the they fail, but queued instead and called again in regular intervals until they can be completed - which is never the case when the mod has gone. Moreover, all uncompleted tasks are carried over in subsequent saves, and therefore, will remain in the save forever. In other words, careless installation and subsequent uninstallation of a single scripted mod is sufficient to irreversibly corrupt a save file.\r\n\r\n(2) Uninstallation procedure:\r\nIn order to prevent any script debris from this mod piling up in your save files, I have equipped the scripts from the beginning with built-in shut-down mechanisms. That is, all runing scripts can be stopped from within the running game (or even do so automatically once their tasks are completed). If you follow the directions specified below, there will be no scripts of this mod running when you save and thus no script tasks written in the save file. There are two ways to safely uninstall the mod:\r\n\r\n(a) Do nothing. When the surveyors have completed all of their jobs, they are disabled and the quest which controls them stops itself. At this point, no scripts will be running anymore and the mod can be safely removed (if this happens, a message will be printed on the user log). \r\n\r\n(b) If you still want to get rid of the mod prematurely, you can do so by shutting it down from within the running game. To do so, travel to Whiterun and find the shut down button, which has been placed in an unconspicuous corner of the town wall (see screenshot for its location). If you press this button, a shut down process will be started (technically, the button sets a global variable, which is checked each time the main script is called - extremely simple but very effective), which marks all surveyors as inactive once they have completed their current jobs. When all surveyors are inactive, the quest and all related scripts will stop running and the mod can be safely removed. Messages will be displayed on the screen when the button has been pressed (this can be done only once: when the process has been started, there is no way to restore the mod\\'s functionality other than re-installing it) and when the quest is stopped (the latter event is also indicated by a message on the log). The delay between the messages can be up to one and a half game days, depending on the travel destinations set for the individual surveyors when the button was pressed. Even in the worst case, however, a wait time of two in-game days is sufficient before the mod can be removed (I noticed that the second message is easily overlooked when I continue playing while the mod shuts down in the background).\r\n\r\n\r\nAdditional Notes:\r\n============\r\n\r\n(1) Load Order & Possible Interferences:\r\nThis mod will basically work without complications irrespective of where it is placed in your load order. Nevertheless, since it modifies the bandit ally faction and the civil war factions (more precisely, it adds specific relationships with the surveyors\\' faction), there may be interferences with mods that modify the same records. In this case, either use Wrye Bash to merge the faction settings, or let the interfering mod overwrite this mod (this will only result in some travel times being somewhat, but not considerably increased).\r\n\r\n(2) Customization:\r\nAt present, the mod includes all hold capitals, all settlements (including Helgen) and the mills. That is, it will generate travel times for any combination of these locations. If you want to test other locations, you can easily do this by a few minor modifications to the main script. I have included documented source files of all scripts in the download.\r\n\r\n(3) If your game doesn\\'t stop crashing after you installed this mod ...\r\n... this indicates that your save files are corrupt. More precisely, your save files almost certainly contain plenty of script debris resulting from previous installations/uninstallations of scripted mods. You can read more on this in the general note to the uninstallation process above. In any case, you can be assured that it is not this mod that\\'s causing your problems. It has been tested on a new game for more than 80 hours of real play time and always worked like a charm.",
  "categoryId": "39",
  "version": "1.0",
  "author": "Sclerocephalus",
  "createdUnix": "1360353571",
  "updatedUnix": "1360352879",
  "containsAdultContent": false,
  "uploadedBy": "sclerocephalus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000008097",
      "name": "Surveyors",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "735",
      "fileName": "Surveyors-31241-1-0.7z",
      "uploadedUnix": "1360352879",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6392f5289002d69873d8f191deba44c2eeed642a9f03edc4e311b4457a11791a/analysis/1407405291/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Surveyors-31241-1-0.7z?fid=1000008097&ttl=1535806664&ri=8192&rs=8192&setec=5b7db8baa62d3f602127725a541b2a5c"
    }
  ]
}