{
  "modId": 31252.0,
  "modName": "Scale and Fur",
  "summary": "Adds variations of Scaled Armor and Scaled Horn Armor with fur underneath. All items are craftable and temperable with the same perk requirements as Scaled Armor. ",
  "descriptionHtml": "8 Sun\\'s Dawn 4E 202\r\n     Its been two days on the seas. I\\'ve been sick and freezing for most of that time. I asked Captain Gjalund about the history of Solstheim, and if it really was a part of Skyrim like the people in Dawnstar all said. He has spent with the nordish Skaal, and according to their legends, there was an ancient battle between two dragon priests known as the guardian and the traitor. This somehow led to Solstheim becoming totally isolated from Skyrim and the empire. Although I know that the empire has had a presence there for quite a while in the south at Fort Frostmoth. It is interesting that he mentioned the dragon priests, especially now with the return of the dragons and these cultists that attacked Erandur and I in Windhelm. The captain also told me the Skaal resent the mainland Nords  claim on the island. They were isolated for hundreds of years and have their own unique cultural identity and customs. Also, he showed me a map in an old book from the third era, and Solstheim wasn\\'t on it. Which is strange, since the island is visible from mainland Morrowind.\r\n     The Sea of Ghosts is definately appropriately titled. It is so foggy and misty that you cannot see from the deck down to the water sometimes. The captain has been keeping th ship at a cautious pace and hugging the shoreline. He said many ships sink because there are so many icebergs and so much fog, and he pointed out a wreck under the cliffs of Winterhold during a rare moment of visibility. Thats one of the reasons that this area hasn\\'t even been fully explored. Supposedly the first men came to Tamriel across the Sea of Ghosts from the northern continent of Atmora, a place which no one I have ever known has ever seen. I don\\'t know how much more north you can get from where we are now, but I couldn\\'t imagine it. Its so cold. I can\\'t wait to reach Raven Rock and sit down by the hearth at the cornerclub. Rustleif made me a few extra-warm outfits for the trip and I\\'ve been getting good use out of them, although I think it makes me look like a bandit.",
  "categoryId": "54",
  "version": "1",
  "author": "Franklin Zunge",
  "createdUnix": "1360356356",
  "updatedUnix": "1360355202",
  "containsAdultContent": false,
  "uploadedBy": "FranklinZunge",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000008103",
      "name": "Scale Armor BSA",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2316",
      "fileName": "Scale Armor BSA-31252-1.7z",
      "uploadedUnix": "1360354960",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f89b043d9845065f2bd9868354232dba24207ec082bbe02d1b9429eab8d544ec/analysis/1407405376/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scale%20Armor%20BSA-31252-1.7z?fid=1000008103&ttl=1535806676&ri=8192&rs=8192&setec=f0cfa298396c1fa3cb34598811063aae"
    },
    {
      "fileId": "1000008106",
      "name": "Scale Armor Loose Files",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2315",
      "fileName": "Scale Armor Loose Files-31252-1.7z",
      "uploadedUnix": "1360355202",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/fc03de9476cf8ad2531e1859a2263914043116dbb66269f5d27c8cf0c00b5142/analysis/1407405393/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scale%20Armor%20Loose%20Files-31252-1.7z?fid=1000008106&ttl=1535806676&ri=8192&rs=8192&setec=3f21a31be73036a957ef932518d8486f"
    }
  ]
}