{
  "modId": 31291.0,
  "modName": "Telvanni Player Home - House of Llaala Arendu",
  "summary": "Adds a small Telvanni style player home to Tel Mithryn. Requires Dragonborn.",
  "descriptionHtml": "twenty six of last seed, fourth era year two hundred and one\r\n\r\ntHe gEm it..... it taLks to me.... every night in my dreams............. when I work......\r\n\r\nit whisPers........ soMetimes it... it scrEams...\r\n\r\nit is a high Pitched ringing...... when it screams, i mean.......\r\n\r\nit wants my heLp.... thEy wAnt my help.......\r\n\r\nthe Souls... thEy............\r\n\r\ncall.... to me........\r\n\r\n~ LLAALA ARENDU\r\n\r\n\r\nOn the 26th of Last Seed, 4E 201, Llaala Arendu, an apprentice to Master Telvanni Wizard Neloth, went missing. No one knows where she went, and why she went missing. She left everything behind, including her house and laboratory in Tel Mithryn. Now her home, her research, and her secrets all belong to you...\r\n\r\n\r\nDescription:\r\n\r\nEver since I first set foot in Tel Mithryn, I have wanted to have a house there. Unfortunately, it was not to be. All you get is a bed and a chest, which you share with Neloth\\'s smelly Dunmer steward. So, I made one. It was made for my mage character, but anyone can use it. \r\n\r\nCurrently, it contains two rooms: A house, and a laboratory, and a small garden outside. Also adds a spell to summon an Albino spider. All storage is safe. The home is accessible at whatever point in the game you are up to, but I plan to have a quest that will lead to the acquisition of the home. The house is pretty noticeable. It is to the east of Neloth\\'s tower, and is called \\\"Llaala Arendu\\'s house\\\". It is NOT follower friendly, unfortunately, because the navmesh didn\\'t work. I will try to fix this soon, however.\r\n\r\nI have tried to keep it as lore-friendly as possible. I apologize if it isn\\'t.  \r\n\r\nPlease leave me constructive criticism if there is something wrong. This is my first mod and it would really help if you gave feedback.\r\n\r\nPlease take the time to read Llaala\\'s notes in her lab. I put a lot of effort into them (you don\\'t have to, of course).\r\n\r\nWell, I hope you enjoy it!\r\n\r\n\r\nInstallation:\r\n\r\nJust download with NMM (preferred), or extract the .esp into your Data folder.\r\n\r\n\r\nCompatibility: \r\n\r\nShould be compatible with anything except mods that add something to the area Llaala\\'s house is in. Let me know if you find any issues.\r\n\r\n\r\nBugs:\r\n\r\nFollowers, summoned Albino spider, and everything else doesn\\'t walk around inside the house and lab. This is because I couldn\\'t get the navmesh to work, but I will fix it at a later date. Let me know if you find other bugs.\r\n\r\n\r\nFuture Plans:\r\n- 3 new quests:  - Discover Llaala\\'s whereabouts and find the key to her home.\r\n                       - Learn more about the Master Soul Gem, and what it was used for.\r\n                       - Get Llaala\\'s book, \\\"The Albino Spider\\\", published and distribute it throughout\r\n                         Solstheim.\r\n- New areas: Ralknthel: Travel deep within a hidden Dwemer ruin and discover the immense soul\r\n                                 gem discovered by Telendil and his expedition team.\r\n                   Whiterock Mine: Travel to a mine off the coast of Soltheim, and learn why it was\r\n                                           abandoned.\r\n- New Follower\r\n- New Spells: Created by none other than Laala herself.",
  "categoryId": "67",
  "version": "1.0",
  "author": "Jellyllama",
  "createdUnix": "1360404158",
  "updatedUnix": "1360404067",
  "containsAdultContent": false,
  "uploadedBy": "Jellyllama",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000008313",
      "name": "House of Llaala Arendu - Main File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "House of Llaala Arendu - Main File-31291-1-0.zip",
      "uploadedUnix": "1360404067",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9c84129665a5c8cb28eb032d95bbc8ea61a868e7885c90e44895831559bf4423/analysis/1407406803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/House%20of%20Llaala%20Arendu%20-%20Main%20File-31291-1-0.zip?fid=1000008313&ttl=1535806732&ri=8192&rs=8192&setec=910626d20da84979fd2fa8acf8914fff"
    }
  ]
}