{
  "modId": 31306.0,
  "modName": "Perk Tree Rework",
  "summary": "I reworked all of the perk trees.",
  "descriptionHtml": "Readme: V. 1.0\r\n\tAfter a year of playing Skyrim, I began to be disgusted with the way the perks acted, so I changed them! This mod aims to revamp the perk system in the game. Making perks for viable for use, or more powerful and more worthwhile to take. \r\n\tI have reworked every single perk tree, not necessarily every single perk. All my changes are listed below. I have separated each perk tree into separate ESP’s. To allow the user to pick and choose which perk tree’s they want to change. I highly recommend starting a new game, to enjoy the full benefits of this mod.\r\n\tIf anyone has any suggestions on how to make perks better or additional perks, whatever comments or concerns, I would LOVE to know. I know some of these trees are lacking, but that’s because I haven’t been able to think up of anything. So, any ideas would be greatly appreciated.\r\nBugs:\r\n\tI am fairly confident that there are bugs somewhere in this mod; I need to know about it ?\r\nWorks in Progress:\r\n\tI am going to rework the standing stone perks, as they are pretty useless at this point, and I will make them better.\r\n\tI want to change the way skills WORK, not just what they do, which may take some time.\r\nChange Log:\r\n251 Perks Before\r\n197 After\r\n\r\n\r\nCOMBAT\r\nArchery: 16 Perks Before 12 After\r\nOverdraw (3 ranks) Bows do One-Third more damage per rank. Rank 1: Level 0. Rank 2: Level 35 Rank 3: Level 60\r\nCritical Shot (2 Ranks) 15% chance to do a critical hit per rank. At Rank two, critical hit does 4 times normal damage. Rank one at Level 30. Rank two at Level 50\r\nRanger’s Disciplines – Recover all arrows from dead bodies. Able to move faster with a drawn bow. Requires level 50\r\nEagle Eye – Pressing block while aiming will zoom your view. Requires level 35. (Reduced stamina drain, and increased zoom power.)\r\n\tSteady Hand – Zooming in with a bow slows time by 50%. Requires level 45\r\n\tQuick Shot – Can draw a bow 30% faster. Requires level 50\r\n\tArmor Penetration – Arrows shot will ignore 35% of armor. Requires Level 65\r\nSilent Death – When using a bow, sneak attacks are 3 times more effective. (These effects stack!) (Requires level 70)\r\n\t\tBase Sneak attack: 2x\r\n\t\tWith just Silent death: 6x\r\n\t\tWith Deadly Aim and Silent Death: 9x\r\n\t\tWith Sneak attack from my sneak attack tree: 12x\r\nMaster Archer – Increases Bow damage by an additional 20%. Can draw your bow an additional 15% faster. Gives a 10% chance for your attacks to instantly kill your enemy. Increases critical damage by 2 times. Requires Level 100.\r\n\t\r\nHeavy Armor: 12 Perks Before, 10 After\r\nJuggernaut (3 Ranks) – Increases armor rating for Heavy armor by one third per rank. Rank 1: Level 0. Rank 2: Level 35 Rank 3: Level 60\r\n\tWell fitted – 30% armor bonus if wearing all heavy armor. Requires level 30.\r\n\tMatching Set – 30% armor bonus if wearing a matching set of heavy armor. Requires Level 60.\r\n\tShielded suit - +150 Armor rating if a heavy armor shield is equipped. Requires Level 40\r\nConditioning –Unarmed attacks now do the gloves armor Rating in extra damage. Heavy armor weighs nothing and will not slow you down when running. Requires level 30\r\nAdvanced Conditioning - Has a 50% chance to nullify all damage from falling when wearing all heavy armor. Heavy armor will increase your movement speed by a small amount. Requires Level 50\r\nMasterful Conditioning – Heavy armor will increase your movement by a larger amount. Increases armor rating by 350 if wearing all heavy armor. And by an additional 150 if equipped with a shield. Requires Level 75.\r\nInvincible – While wearing all heavy armor, gives a 20% chance to reflect melee damage back to the enemy. While wearing all heavy armor, health is increased by 200 points and an additional 50 when a heavy shield is used. Also, Stamina Regeneration is increased by 10%. Requires level 100.\r\n\r\nBlock: 13 Perks Before 10 After\r\nShield Wall (3 Ranks) – Blocking is One-Third more effective per rank. Rank 1: Level 0. Rank 2: Level 35 Rank 3: Level 60\r\n\tPower Bash – Able to do a power bash. Increases Bash damage by five times. Requires Level 35.\r\nShield Tower – When equipped with a shield type matching your armor type, armor rating is increased by 20 Points for every matching piece. Requires level 45.\r\n\tDisarming Bash – Chance to disarm an opponent when power bashing. Requires level 60.\r\nQuick Reflexes – Time slows down if you are blocking during an Enemies power attack. Requires level 30.\r\nAegis of Protection – Arrows that hit the shield do no damage. Blocking with a shield reduces incoming magic damage by 50%. Requires level 50\r\nBlock Charger – Able to move faster with a shield raised. Sprinting with a shield raised knocks down most targets. Requires level 70\r\nMaster Blocker – 15% chance to reflect melee damage while blocking. Gives 20% more effectiveness with shields. Requires Level 100.\r\n\r\nTwo-Handed: 19 Perks Before 11 After\r\nBarbarian(3 Ranks) – Two-Handed weapons do one-third more damage per rank. Rank 1: Level 0. Rank 2: Level 35 Rank 3: Level 60\r\nChampion’s Stance – Power attacks with two-handed weapons cost 25% less stamina, and does 25% more damage. Requires level 25. \r\nLimbsplitter– Attacks with battle axes cause extra bleeding damage. Has a 10% chance to do a critical hit that does 2 times regular damage. Requires level 35\r\nDeep Wounds– Attacks with great swords have a 15% chance of doing a critical strike that does 2.5 times regular damage. Ignores 10% armor. Requires level 35\r\nSkull Crusher – Attacks with war hammers ignore 50% armor. Also causes extra bleeding damage. Requires level 35.\r\nTwo-Handed Blocking – Increases block effectiveness with two-handed weapons by 45%. Requires level 50.\r\nDevastating Power– Standing power attacks do 30% bonus damage, with a chance to decapitate your enemies. Can do a sprinting power attack that does double critical damage. Requires level 50.\r\nSweep – Sideways power attacks with two-handed weapons hits all targets in front of you, with 30% more damage. Requires level 65.\r\nWarmaster – Two-Handed power attacks do 25% more damage. Increases critical chance by 20%, and critical hit damage by 50%. All two-handed attacks ignore 15% armor, and do 15% more damage. Requires level 100.\r\n\r\nOne-Handed: 21 Perks Before 13 After\r\nArmsman (3 Ranks) – One-handed weapons do one-third more damage per rank. Rank 1: Level 0. Rank 2: Level 35 Rank 3: Level 60\r\nDual Defense – While dual wielding, armor rating is increased based on skill level. Requires level 30.\r\n\tDual Flurry – Dual wielding attacks are 20% faster and stronger. Requires Level 40.\r\n\tDual Savagery – Dual wielding power attacks do double damage. Requires Level 60.\r\nFighting Stance - Power attacks with one-handed weapons cost 25% less stamina, and does 25% more damage. Requires level 25. \r\nBone Breaker- Attacks with Maces ignore 50% armor. Also causes extra bleeding damage. Requires level 35.\r\nBladesman- Attacks with swords have a 15% chance of doing a critical strike that does 2.5 times regular damage. Requires level 35.\r\nHack and Slash - Attacks with war axes cause extra bleeding damage. Has a 10% chance to do a critical hit that does 2 times regular damage. Requires level 35.\r\nSword and Shield – While using a one handed weapon and a shield, damage is increased based on the block skill. And block effectiveness is increased based on the one-handed skill. Requires level 40. (5% per 25 levels of block, up to 20% more damage, 10% per 25 levels of one handed, up to 40% more block effectiveness.)\r\nSavage Power – Standing power attacks do 35% more damage with a chance to decapitate your enemies. Can do a one-handed power attack while sprinting that does double critical damage. Requires level 70.\r\nBattle Lord – All One-Handed power attacks do 25% more damage. All attacks ignore 15% armor. Increases critical hit chance by 20% and critical hit damage by 50%. Requires level 100.\r\n\r\nSmithing: 10 Perks Before 9 After\r\nSteel Smithing (2 Ranks) - Rank one is unchanged. Rank two replaces Advanced Armors, adding the ability to forge plate and scale armor and increases all smithing improvements by 5%. Rank 1: Level 0 Rank 2: Level 40\r\nElvish Smithing (2 Rank) - Adds the ability to forge Light Elven armor, and heavy Dwarven armor, and the ability to improve them twice as much. Rank two adds the ability to forge Orsimer armor (Orcish) Rank 1: Level 30 Rank 2: Level 50\r\nArcane Blacksmith (2 Rank) - Rank one allows for magical equipment to be improved. Rank two increases all smithing improvements by an additional 10%. Effects Stack. Rank 1: Level 30 Rank 2: Level 50\r\nAdvanced Armor Smithing - Changed to add Glass forging and Ebony Forging, along with the ability to improve them both twice as much. Requires level 60\r\nDaedric Smithing – Can create Daedric armor and weapons at forges and improve them twice as much Requires level 80\r\nMaster Armor Forging (1 Ranks) – Allows Dragonbone and Scale armor to be crafted and improved. Adds an additional 15% to all smithing improvements, unto a total of 25%. Requires Level 100.\r\n\r\nSTEALTH\r\nLight Armor: 10 Perks Before 10 After\r\nAgile Defender (3 Ranks) Increases armor rating for Light armor by one third per rank. Rank 1: Level 0. Rank 2: Level 35 Rank 3: Level 60\r\nGhost Walker – When Wearing all Light Armor, sneaking movement speed is increased by 20%. Requires level 35\r\n\tCustom Fit – 30% Armor bonus if wearing all Light Armor. Requires level 35\r\n\tMatching Set - 30% Armor bonus if wearing a full set of Light Armor. Requires level 50\r\nAdvanced Conditioning – Light Armor weighs nothing and doesn’t slow you down. Increases stamina regen by 30%. Requires level 70\r\nLayered Armor – While wearing all Light armor, all incoming damage is reduced by 5%. Requires level 50. \r\nShield and Hide – While using a Light Armor shield, armor rating is increased by 75 points. Requires level 50\r\nMasterful Agility – Increases all movement speed while wearing all light armor. Increases armor rating by 15% while wearing all Light Armor. Gives 15% chance to avoid all damage while wearing all Light Armor. Requires level 100.\r\n\r\nSneak: 13 Perks Before, 10 After\r\nStealth (3 Ranks) – You are 17% harder to detect per rank. Rank 1: Level 0. Rank 2: Level 35 Rank 3: Level 60\r\nSilenced Movements – Walking and Running do not affect detection, Noise from Light Armor is reduced by 100%, and noise from Heavy armor is reduced by 50%. Requires Level 50.\r\nLight Foot – You won’t trigger pressure plates. Requires Level 40.\r\nSilent Roll – Sprinting will sneaking will execute a silent roll. Requires Level 60.\r\nSneak Attack – Sneak attacks with one-handed weapons now do six times damage, sneak attacks with bows now do four times damage. Requires level 40.\r\nAssassins Boon - Sneak attacks with Daggers now do 18 Times Damage. Requires level 60.\r\nSneak in Motion – Increases movement speed while sneaking by 35%. Requires Level 70.\r\nMaster Shadow Warrior – Crouching stops combat for a moment and forces distant opponents to search for a target. Increases Stealth effectiveness by an additional 20%. Doubles Sneak attack damage for Bows, One-handed weapons, and Two-handed weapons. Adds a 1.5x Multiplier to Dagger Sneak attack damage. Requires level 100.\r\n\r\nLockpicking: 11 Perks Before, 7 Perks After.\r\nNovice Locks – Novice locks are much easier to unlock, all other locks are somewhat easier to unlock as well. Requires level 0.\r\nApprentice Locks – Apprentice locks are much easier to unlock, all other locks are somewhat easier to unlock as well. Requires level 25.\r\nAdept Locks – Adept locks are much easier to unlock, all other locks are somewhat easier to unlock as well. Requires level 50.\r\nExpert Locks – Expert locks are much easier to unlock, all other locks are somewhat easier to unlock as well. Requires level 75.\r\nMaster Locksmith – All Locks are significantly easier to unlock. Lock picks Never Break. Picks start closer to the lock opening position. Requires level 100.\r\n\tQuick Hands – Able to pick locks without being noticed. Requires level 40\r\nTreasure Hunter - 50% greater chance of finding special treasure. Finds more gold in chests. Requires level 60.\r\n\r\nPickpocketing: 12 Perks Before 7 After\r\nLight Fingers (3 Ranks) - Pickpocketing bonus of one third-per rank. Item weight and value reduce pickpocketing odds. Rank 1: Level 0. Rank 2: Level 35 Rank 3: Level 60\r\n\tPoisoned – Silently harm enemies by placing poisons in their pockets. Requires Level 35.\r\n\tExtra Pockets – Carrying capacity increased by 150. Requires level 30\r\n\tValuable Thief – Pickpocketing gold and keys almost always works. Requires level 50\r\nMaster Thief – Increases pickpocketing odds by an additional 50%. Can pickpocket equipped weapons. Requires Level 100\r\n\r\nSpeech: 13 Perks Before, 9 After\r\nSpeechcraft (3 Ranks) – Increases Buying and selling prices by 16.6% per rank, up to 50%. Also increases persuasion and intimidation chances by 10% per rank, up to 30% more effective. At Rank 2, Allows Bribing of guards. Rank 1: Level 0. Rank 2: Level 35 Rank 3: Level 60\r\nAdvanced Salesmen – Can sell any type of item, stolen or not, to any merchant. Requires Level 50.\r\nInvestor – Can invest 500 gold with a shopkeeper to increase his available gold by 500 permanently. Requires level 60.\r\nMaster Trader – Every Merchant in the world gains 1000 extra gold for bartering. Requires Level 75.\r\nQuick Shouts (2 Ranks) – Decreases the amount of time between shouts by 15% per rank. Rank 1: Level 25. Rank 2 Levels 45.\r\nMasterful Speechcraft – Improves Buying and selling prices by 15%. Reduces the amount of time between shouts by an additional 10%.\r\n\r\nAlchemy: 15 perks before, 13 After.\r\nAlchemist (3 ranks) – Lowered to 3 ranks instead of 5. Increments increased to 33% each rank, up to twice as effective. Rank 1: Level 0. Rank 2: Level 35 Rank 3: Level 60\r\nPhysician (2 Ranks) - Rank one Increases benefits from Health, Magicka, and Stamina potions by 25%. Rank two increases benefits of these potions by 40%. Rank 1: Level 20. Rank 2: Level 40.\r\nBenefactor (1 Rank) – Changed benefit to potions with beneficial effects from 25% to 30%. Requires level 40\r\nExperimenter (2 Ranks) - Rank one reveals one additional effects; Rank two reveals all four effects. Rank 1: Level 40. Rank 2: level 60.\r\n\tSnakeblood - Removed\r\n\tPoisoner (2 Ranks) - Same as Physician, just with poisons. Rank 1: Level 20 Rank 2: Level 40.\r\nConcentrated Poison (2 Ranks) - Rank one lasts for twice as many hits, rank two lasts for three times as many hits. Rank one at level 50, rank two at level 60.\r\n\tGreen Thumb – Two ingredients are gathered from plants. Requires level 70\r\nPerfect Alchemist – Replaces Purity. Removes beneficial effects from poisons, and Harmful effects from potions. All potions made are doubled. Like the Crimson nirnroot effect, just guaranteed. Requires level 100\r\nSinderion\\'s Serendipity – Changed to increase all alchemy effectiveness by 15%. Otherwise, the effects of the perks will overlap, and create the tendency to create 4 potions, instead of two, ruining balance.\r\n\r\nMAGIC\r\nIllusion: 13 Perks before, 10 after.\r\nNovice Illusion – Cast Novice level Illusion spells for half Magicka. Novice level spells last 50% longer, and are 50% more effective. Requires level 0.\r\nApprentice Illusion – Cast Apprentice level Illusion spells for half Magicka. Apprentice level spells last 50% longer, and are 50% more effective. Requires level 25.\r\nAdept Illusion – Cast Adept level Illusion spells for half Magicka. Adept level spells last 50% longer, and are 50% more effective. Requires level 50.\r\nExpert Illusion – Cast Expert level Illusion spells for half Magicka. Expert level spells last 50% longer, and are 50% more effective. Requires level 75.\r\nMaster Illusion – Cast Master level Illusion spells for half Magicka. All illusion spells last 50% longer, and are 50% more effective. Illusion spells work on undead, Daedra and automatons. Requires level 100. \r\nIllusion Dual Casting – Dual Casting an Illusion spell overcharges the effects into an even more powerful version. Requires level 25.\r\nQuiet Casting – All spells you cast from any school of magic are silent to others. Requires Level 30.\r\nKindred Mage – All illusion spells work on higher level humans and animals. Require level 40.\r\nMaster of Emotion (2 Ranks) – Rank One: Calm, Fear, and Frenzy spells work on higher level opponents. Rank Two: Calm, Fear, and Frenzy spells work on all targets. Rank one: Level 40. Rank Two: Level 60.\r\n\r\nConjuration: 16 Perks before 11 after.\r\nNovice Conjuration – Cast Novice level Conjuration spells for half magicka. Novice level spells last 50% Longer. Requires level 0.\r\nApprentice Conjuration – Cast Apprentice level Conjuration spells for half magicka. Apprentice level spells last 50% Longer. Requires level 25. \r\nAdept Conjuration – Cast Adept level Conjuration spells for half magicka. Adept level spells last 50% Longer. Requires level 50. \r\nExpert Conjuration – Cast Expert level Conjuration spells for half magicka. Expert level spells last 50% Longer. Requires level 75. \r\nMaster Conjuration – Cast Master level Conjuration spells for half magicka. All conjuration spells last 50% Longer. Requires level 100.\r\nConjuration Dual Casting – Dual Casting a Conjuration spell overcharges the effects into an even more powerful. Requires Level 25.\r\nSummoner – Can raise atronachs or raise undead three times as far away. Requires level 50\r\nElemental Potency – Conjured atronachs are 50% more powerful. Requires level 60.\r\nDark Souls – Reanimated undead have 200 points more health. Requires level 60.\r\nMulti Souls(2 Ranks) – Rank One. You can have two atronachs or reanimated zombies. Rank Two. Can have three atronachs or reanimated zombies. Rank One: Level 80. Rank Two: Level 100.\r\nMystic Master – Bound weapons do twice as much damage, cast Soul traps on targets, and banishes Daedra and turns undead. Requires Level 50.\r\n\r\nDestruction: 17 Perks before 14 Perks After\r\nNovice Destruction – Cast Novice level Destruction Spells for half magicka. Novice level spells deal 50% more damage. Requires level 0.\r\nApprentice Destruction – Cast Apprentice level Destruction Spells for half magicka. Apprentice level spells deal 50% more damage. Requires level 25.\r\nAdept Destruction – Cast Adept level Destruction Spells for half magicka. Adept level spells deal 50% more damage. Requires level 50.\r\nExpert Destruction – Cast Expert level Destruction Spells for half magicka. Expert level spells deal 50% more damage. Requires level 75.\r\nMaster Destruction – Cast Master level Destruction Spells for half magicka. All destruction spells deal 50% more damage. (This effect does stack) All destruction spells are twice as fast to cast. Requires level 100.\r\nIntense Flames (2 Ranks) – Rank 1. Fire spells do 25% more damage. Rank 2. Fire spells deal 50% more damage and causes targets to flee if their health is low. Rank 1: Level 30. Rank 2: Level 50.\r\nDeep Freeze (2 Ranks) – Rank 1. Frost spells do 25% more damage. Rank 2. Frost spells deal 50% more damage and Paralyzes targets if their health is low. Rank 1: Level 30. Rank 2: Level 50.\r\nDisintegrate (2 Ranks) – Rank 1. Shock spells do 25% more damage. Rank 2. Shock spells deal 50% more damage and disintegrates targets if their health is low. Rank 1: Level 30. Rank 2: Level 50.\r\nDestruction Dual Casting – Dual casting a destruction spell overcharges the effect, staggering opponents. Requires level 25.\r\nRune Master – Can place runes five times farther away. Runes deal twice as much damage, and cost half as much magicka. (Effects stack) Requires Level 40.\r\nSneaking Destruction – Destruction spells cast while undetected, cause twice as much damage. Requires level 50\r\nRestoration: 13 perks before, 11 After.\r\nNovice Restoration – Cast Novice Level restoration spells for half magicka. Novice level spells are 50% more effective. Requires level 0.\r\nApprentice Restoration – Cast Apprentice Level restoration spells for half magicka. Apprentice level spells are 50% more effective. Requires level 25.\r\nAdept Restoration – Cast Adept Level restoration spells for half magicka. Adept level spells are 50% more effective. Requires level 50.\r\nExpert Restoration – Cast Expert Level restoration spells for half magicka. Expert level spells are 50% more effective. Requires level 75.\r\nMaster Restoration – Cast Master Level restoration spells for half magicka. All restoration spells are 50% more effective. Requires level 100.\r\nRestoration Dual Casting – Dual casting a Restoration spell overcharges the effects into an even more powerful version. Requires level 25.\r\nRecovery – Magicka regenerates 50% faster. Requires level 45.\r\nAvoid Death – Once a day, heals 100% health automatically if you fall below 15% Health. Requires Level 80.\r\nWard Absorb – Ward spells are 50% more effective and recharge magicka when hit with spells. Requires level 50.\r\nNecromage – All spells are more effective against the undead. Requires level 50.\r\nRespite – Healing spells cure 75% more health, and restores stamina. Requires Level 35.\r\n\r\nAlteration: 14 perks before, 10 after.\r\nNovice Alteration – Cast Novice level alteration spells for half magicka. Novice level spells last 50% longer. Requires level 0.\r\nApprentice Alteration - Cast Apprentice level alteration spells for half magicka. Apprentice level spells last 50% longer. Requires level 25.\r\nAdept Alteration - Cast Adept level alteration spells for half magicka. Adept level spells last 50% longer. Requires level 50.\r\nExpert Alteration - Cast Expert level alteration spells for half magicka. Expert level spells last 50% longer. Requires level 75.\r\nMaster Alteration - Cast Master level alteration spells for half magicka. All alteration spells last 50% longer. Block an additional 15% of spells effects. Requires level 100.\r\nAlteration Dual Casting – Dual Casting an Alteration spell overcharges the effects into an even more powerful version. Requires level 25.\r\nMagical Armor (2 Ranks) – Rank One, Protection spells are 2x as Strong if not wearing armor. Rank two, Protection spells are 2.5x as strong even while wearing armor. Rank one: Level 35. Rank two: Level 50.\r\nStability - Removed\r\nMagical Resistance – Blocks 20% of spells effects. Requires Level 60.\r\nAtronach – Absorbs 30% of the magicka of any spells that hit you. Requires Level 80.\r\n\r\nEnchanting: 13 perks before, 10 perks after.\r\nEnchanter (3 Ranks) - Lowered to 3 ranks instead of 5. Increments increased to 33% each rank, up to twice as effective. Rank 1: Level 0. Rank 2: Level 35 Rank 3: Level 60\r\n\tFire Enchanter - Removed\r\n\tFrost Enchanter - Removed\r\n\tStorm Enchanter - Removed\r\n\tInsightful Enchanter - Removed\r\n\tCorpus Enchanter - Removed\r\nSoul Squeezer (1 Rank) – Soul gems provide extra magicka for recharging. Level Required: 25. (This effect has been doubled)\r\nSoul Siphon (1 Rank) – Death blows to creatures, but not people, trap 12.5% of the victims soul, Level Required: 45.\r\nArmor Enchanter (2 Ranks) - Increases Potency of all armor enchantments by 25% (Rank one) and 45% (Rank two). Rank 1: Level 40 Rank 2: Level 70.\r\nWeapon Enchanter (2 Ranks) - Increases Potency of all weapon enchantments by 25% (Rank one) and 45% (Rank two). Rank 1: Level 40 Rank 2: Level 70.\r\nMaster Enchanter (1 Ranks) – Allows three enchantments to be added to a single item. Increases Soul Gem effectiveness by an additional ten percent. Increases all enchantments power by an additional 5%.\r\n\r\n",
  "categoryId": "73",
  "version": "1.0",
  "author": "Shtaan",
  "createdUnix": "1360430921",
  "updatedUnix": "1360509939",
  "containsAdultContent": false,
  "uploadedBy": "kjtest21",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000008707",
      "name": "Perk Tree Rework With Smithing Fix",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58",
      "fileName": "Perk Tree Rework With Smithing Fix-31306-1-0-1.rar",
      "uploadedUnix": "1360509939",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/6f0fc0c975ba2dd3e50a9ac47eef77a1a9107880d0f106c8036dde8710a48cb8/analysis/1407409564/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Perk%20Tree%20Rework%20With%20Smithing%20Fix-31306-1-0-1.rar?fid=1000008707&ttl=1535806756&ri=8192&rs=8192&setec=5c1a71a58425d5cc4e0b4f6e1828f6ef"
    }
  ]
}