{
  "modId": 31307.0,
  "modName": "Paradise Halls Extender - Slave Capture Spells and Poisons",
  "summary": "Adds slave capture spells and poisons to Paradise Halls.",
  "descriptionHtml": "Description:\r\nAdds the spell Mind Control and the Mind Control poison for use in slave capture under the Paradise Halls system.  \r\n\r\nThe capture system in Paradise Halls works on the idea that each person begins with a certain amount of endurance with which to resist capture.  Normally, this endurance stat would be reduced by successive attacks with the whip.  With the additions made in this extension mod, you can now also capture through the use of a cast spell, by the use of poisons or a combination of all three methods.\r\n\r\nThe Argonian merchant Thiss has been added to Belethor\\'s General Goods in Whiterun.  Looks like all those jokes he made about buying and selling sisters had some basis in fact after all.  Thiss stocks copies of the spell book to teach Mind Control along with a limited supply of similar poison.\r\n\r\nNow with the aid of the wondrous goods of Thiss, mage slavers can refrain from all that vigorous exercise they hate so much.  Likewise the stealthy and swift of hand can see unwary city folk enslaved and stripped right there in broad daylight in front of dozens of viewers, with no-one the wiser that consent was not given.\r\n\r\nAbout Balance:\r\nThis uses the same calculations as Paradise Halls to determine capture.  This means that the number of spells cast or applications of poison required is based upon the base health of the NPC in question.  Weaker NPCs take less, levelled NPCs with large health pools take more.\r\n\r\nIn order to compensate for this at higher character levels, the capture spells and poisons will now increase in magnitude based upon perks and skill levels.  In the case of the spell, increases will be gained upon gaining each of the Illusion Apprentice, Adept, Expert and Master perks.  In the case of the poison, similar gains will be received at skill levels 25, 50, 75 and 100.  I chose to base alchemy on skill level rather than perks largely for compatibility.  While most perk overhauls tend to leave the casting perks up to Master and perhaps simply modify them, most will change alchemy considerably.\r\n\r\nBalance issues may still require some tuning, but seem in a fairly good place.  Weak NPCs will end up being one shot into slavery by the spells and poisons at high skill levels.  However, this honestly isn\\'t much different to the number of instant kill moves performed on similar through normal combat.\r\n\r\nCaution:\r\nDo take care when using poisons to enslave people in cities.  The fact that you don\\'t have to stand there beating on someone and drawing the attention of the guard could potentially make any of us a little carefree with our poison usage.  You will want to know you no longer need them before you slap a collar on them and march them away to uncertain fate.\r\n\r\nRequirements:\r\nRequires Paradise Halls - Skyrim Slavery - http://skyrim.nexusmods.com/mods/29886\r\n\r\nLoad Order:\r\nMust be loaded after the Paradise Halls base and core files.\r\n\r\nFuture Plans:\r\nCrafting of the poison.\r\n\r\nCredits:\r\nlayam for Paradise Halls\r\n\r\nBugs/Comments:\r\nNo known incompatibilities.  If you manage to find some please do let me know.  I\\'ll try to get on problems ASAP.\r\n\r\nPlease do report any issues you are having.  You guys will use it differently to the way I use it and will likely uncover things I didn\\'t anticiptate.  If you are not having problems.. well, I love to hear that too :)\r\n\r\nOther Mods:\r\nDon\\'t forget to check my other stuff out\r\no Immersive sex slaves - Animatied Prostitution patch for Paradise Halls - http://skyrim.nexusmods.com/mods/31160\r\n\r\nChangelog:\r\n1.02.0 - Fixes and skill level/perk magnitude\r\n- Fixed inconsistencies in the effectiveness of the Mind Control spell.\r\n- Fixed inconsistencies in the behaviour of poisons when applied to a weapon.\r\n- Added increased magnitude to spell based on Illusion perks\r\n- Added increased magnitude to poison effect based on Alchemy skill level.\r\n1.01.1 - Minor update to put back minor details lost in being clumsy\r\n- Re-instated the slight stagger on the capture spell that was in the original version.\r\n- Corrected the description of the Spell Tome.\r\n1.01 - Spell capture fixed.  I broke it right before release apparently.\r\n1.00 - Release version.",
  "categoryId": "75",
  "version": "1.02.0",
  "author": "Mutifex",
  "createdUnix": "1360431439",
  "updatedUnix": "1360546706",
  "containsAdultContent": true,
  "uploadedBy": "mutifex",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000008415",
      "name": "PAHEXtender 1-01",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "PAHEXtender-31307-1-01.rar",
      "uploadedUnix": "1360433850",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/50ca1e0f1035128d72dd62d02dccc53432fe928736d5fca6600cd9d57f362b44/analysis/1407407587/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PAHEXtender-31307-1-01.rar?fid=1000008415&ttl=1535806757&ri=8192&rs=8192&setec=f4343648a1885715ae7e5a2d3ccbfa41"
    },
    {
      "fileId": "1000008482",
      "name": "PAHExtender 1-01-1",
      "version": "1.01.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "PAHExtender 1-01-1-31307-1-01-1.rar",
      "uploadedUnix": "1360442887",
      "modVersion": "1.01.1",
      "virusScanUrl": "https://www.virustotal.com/file/551a8d2a729883c62522e3481f780c16cdfdde9f1a9bb92b20ea8c5aedc10ef4/analysis/1407407765/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PAHExtender%201-01-1-31307-1-01-1.rar?fid=1000008482&ttl=1535806758&ri=8192&rs=8192&setec=31574ed4aaf1b56331ba4f03da0136ee"
    },
    {
      "fileId": "1000008879",
      "name": "PAHExtender 1-02-0",
      "version": "1.02.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "PAHExtender 1-02-0-31307-1-02-0.rar",
      "uploadedUnix": "1360546706",
      "modVersion": "1.02.0",
      "virusScanUrl": "https://www.virustotal.com/file/ec45679c8d099c2281247f0b2c701f26501c63cbc82a01ef1a750ea9d710dba3/analysis/1407410504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PAHExtender%201-02-0-31307-1-02-0.rar?fid=1000008879&ttl=1535806758&ri=8192&rs=8192&setec=b551367e075e397f6cf80cea23fed8a7"
    }
  ]
}