{
  "modId": 31328.0,
  "modName": "SkyRealism",
  "summary": "This is a complete overhaul for Skyrim&#39;s underlying carry weight, combat, enchanting, inventory, spellcasting, and survival systems. In many ways, this is similar to ASIS and T3nd0&#39;s Skyrim Redone, but with more of an emphasis on basic needs and inventory management. It is intended to make Skyrim both more realistic and more challenging wit",
  "descriptionHtml": "[img]http://static-2.nexusmods.com/15/mods/110/images/30959-4-1360271569.png[/img]\r<br />\r<br />[center][i]A more realistic Skyrim experience.[/i][/center]\r<br />\r<br />This is a complete overhaul for Skyrim&#39;s underlying carry weight, combat, enchanting, inventory, spellcasting, and survival systems. In many ways, this is similar to ASIS and T3nd0&#39;s Skyrim Redone, but with more of an emphasis on basic needs and inventory management. It is intended to make Skyrim both [b]more [color=#EABE76]realistic[/color][/b] and [b]more [color=#87CEEB]challenging[/color][/b] without changing the feel of Skyrim.\r<br />\r<br />This mod is [i]NOT[/i] intended to please everyone (that would be impossible). If you don&#39;t like using all these systems together, most of them have all been released individually. Just search for SkyRealism on the SkyrimNexus, or scroll down to the very bottom of this page for the links.\r<br />\r<br />[color=#FFFF00][b]NOTICE: [/b][/color]This is a work in progress, and I value your input. I love constructive criticism and advice. Any recommendations you have, [i]please[/i] post them in the comments&#33; If it&#39;s reasonable and realistic, I&#39;ll do my best to implement it&#33; For example, if you think dragons should be harder, let me know&#33; \r<br />\r<br />And now, for the specifics...\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-1-1360271458.png[/img]\r<br />\r<br />Food, Water, and Sleep are now a requirement. Going for long periods without Food, Water, or Sleep will result in penalties to various skills, regeneration rates, and possibly result in death.\r<br />\r<br />The system behind these basic needs is based on real-world caloric and hydration equations, and use your physical skills and stamina usage as the basis of how many calories and how much water you&#39;ll need to consume. You&#39;ll need to consume an enormous amount of food to keep up with high-end physical skills.\r<br />\r<br />Vampires do not have these needs, since they are dead. Werewolves do though, and the transformation to Beast Form consumes and enormous number of calories. These can be replenished through Feeding upon your fallen foes.\r<br />\r<br />Eventually this system will include cold-weather temperature monitoring, and apply penalties such as hypothermia, frostbite, etc.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-2-1360271458.png[/img]\r<br />\r<br />Heavy Armor provides up to 50% physical damage reduction in addition to the reduction from Armor Rating, based on how many pieces are worn. Light Armor provides up to 25% physical damage reduction. These bonuses apply to all races, so you may find that bandits, draugr, and falmer tend to take a bit more punishment than normal.\r<br />\r<br />In addition, the in-combat regeneration rates for Magicka and Stamina have been increased to allow for longer fights with tougher enemies. The amount of Stamina used for power attacks has been reduced as well, to account for greatly increased enemy health and damage resistance.\r<br />\r<br />All the combat styles have been adjusted to some degree, usually increasing aggression in circumstances where they have a numerical advantage. Even without the weight of numbers, enemies are more aggressive, have better tactics, and use slightly better strategies, and will spend less time standing around bashing their shields in combat. Bosses are much higher level, and far more dangerous. \r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-3-1360271458.png[/img]\r<br />\r<br />Nearly all crafting recipes have been changed. Material requirements have been removed from nearly all Sharpening recipes. All other recipes have been heavily tweaked to account for conservation of mass; the amount of material that goes into a recipe will almost always be greater than the resulting product. In addition, most items now can be smelted down to retrieve their more expensive material components. However, you won&#39;t get everything back from this process.\r<br />\r<br />Crafting Kits are now available, and can be found scattered across the world, and will eventually be sold by vendors. These crafting kits allow you to perform crafting on the go, without having to find a forge or enchanting table. However, if you plan to put them together yourself, you may find some of the required items rather difficult to find. \r<br />\r<br />Ingots have also been complimented with Bars, which are a smaller version of an Ingot. Individual Ingots can be smelted into 4 Bars, and 4 Bars can be smelted into an Ingot. Nearly all recipes now rely on these new Bars.\r<br />\r<br />Finally, nearly all sets of armor in the game can be crafted, provided that you have completed the related quest lines that deal with individuals who wear that equipment.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-4-1360271458.png[/img]\r<br />\r<br />This will be unveiled when it is completed.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-1-1360271499.png[/img]\r<br />\r<br />Most of the Encounter Zones in the game have had their minimum levels raised to 20 or more. The areas around Whiterun are considered a &#34;starter&#34; area. Minimum enemy levels are based on the distance of the Encounter Zone from towns and villages, and on how far into the main quest lines those areas are. Enemies in the far reaches of the world will be phenomenally more powerful (level 50+).\r<br />\r<br />Main Quest Zones:\r<br />Bleak Falls Barrow 10+, High Hrothgar 15+, Ustengrav 20+, Thalmor Embassy 25+, Karthspire Camp 30+, Aftland 30+, Blackreach 35+, Throat of the World 50+, Skuldafn 60+, Sovngarde 70+.\r<br />\r<br />Companions Quest Zones: Dustman&#39;s Cairn 15+, Gallows Rock 20+, Glenmoril Coven 25+, Driftshade Refuge 30+, Ysgramor&#39;s Tomb 35+.\r<br />\r<br />College of Winterhold Quest Zones: Saarthal 15+, Fellglow Keep 20+, Mzulft 30+, Labyrinthian 40+.\r<br />\r<br />Thieves Guild Quest Zones: Goldenglow Estate 15+, Honningbrew Meadery 20+, East Empire Company Warehouse 25+, Brinewater Grotto 25+, Snow Veil Sanctum 30+, Irkngthand 35+, Twilight Sepulcher 40+.\r<br />\r<br />The Dark Brotherhood Quest Zones: Dark Brotherhood Sanctuary 20+, Raldbthar 20+, Volunruud 25+, Mzinchaleft 30+, Dawnstar Sanctuary 35+, Katariah 40+.\r<br />\r<br />Daedric Quest Zones: Inalta&#39;s Deep 40+, Azura&#39;s Star 45+, Shrine of Boethia 35+, Knifepoint Ridge 35+, Haemar&#39;s Shame 30+, Rimerock Burrow 35+, Septimus Signis Outpost 50+, Tower of Mzark 50+, Bloated Man&#39;s Grotto 30+, Fallowstone Cave 30+, Largashbur 30+, Dead Crone Rock 35+, Cracked Tusk Keep 35+, Nightcaller Temple 30+, Morvunskar 25+, Bthardamz 35+, Reachcliff Cave 30+, Kilkreath Ruins 40+, Skyborn Altar 35+.\r<br />\r<br />Dragon Priest Zones: Valthume 45+, Labyrinthian 40+, Skuldafn 60+, Ragnvald 55+, Forelhost 45+, High Gate Ruins 50+, Volskygge 50+.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-2-1360271499.png[/img]\r<br />\r<br />An encumbrance system has been added, which will vary your (and every other NPCs) speed based on your inventory weight and physical skills. Be careful&#33; If you&#39;re carrying too much, archers and mages will have ample time to run away. Frost mages in particular can be truly terrifying opponents to a plate-wearing warrior with a full backpack&#33;\r<br />\r<br />Part of this encumbrance system is an entirely overhauled capacity system, which limits the amount of items you can carry that aren&#39;t equipped. Items you have equipped won&#39;t count against your carry weight, but they will count against your encumbrance. Mods that add bandoliers, belt pouches, backpacks and the like are [i]HIGHLY[/i] recommended. Here&#39;s a few of my favorites:\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/16438]Bandolier - Bags and Pouches[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/13732]Leather Backpack[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/13687]Saber Gear Backpack[/url]\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-3-1360271499.png[/img]\r<br />\r<br />Many enemies have been heavily tweaked. Nearly all humanoid enemies have had their base Health, Magicka, and Stamina values increased to be roughly the same as any level 1 character. Bandits, Draugr, Skeletons, Wizards, and other related enemies now start at 100 health, magicka, and stamina, rather than 20 or 35 as they used to.\r<br />\r<br />Additionally, the average quality of gear amongst these low level enemies has substantially improved. Iron and Fur are less common among bandits, Thalmor will always use Elven weaponry, Orcs will often be found wearing Orcish Armor, and so on. \r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-4-1360271499.png[/img]\r<br />\r<br />The weight of gear has also been adjusted to be much closer to real-world weights. Weapons are often much ligher, and heavy armor is even heavier. Originally I was using kilograms, but this broke the Sneak system, so weights are currently in pounds. \r<br />\r<br />As mentioned above, heavy armor is far more protective, and so is light armor to a lesser degree. Don&#39;t let that fool you; you&#39;ll need every scrap of gear and skill to scrape through some of the fights you&#39;ll encounter.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-5-1360271499.png[/img]\r<br />\r<br />The levelling system has been quite drastically overhauled. The experience gained through performing actions has been drastically reduced, by up to 50% in some cases. What this means is that you can&#39;t expect to go out and bash people over the head a few hundred times and suddenly become a master swordsman, or craft a few hundred daggers and forge weapons that would make Eorlund Greymane turn green with envy.\r<br />\r<br />Instead, you&#39;ll need to do as Farkas says: Train. Training is now less expensive, since you&#39;ll be doing it a lot more. The training per level cap has been raised to 50. Training can only do so much though; the last 10 ranks from 90 to 100 can&#39;t be trained. To reach Mastery of your skills you&#39;ll need to spend many long hours practicing your craft. \r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-1-1360271569.png[/img]\r<br />\r<br />All the perk trees have been overhauled, either by changing perks, positions, ranks, benefits, or all of the above. The biggest changes are to Smithing, Enchanting, Alchemy, and Light Armor.\r<br />\r<br />All perk trees have been reorganized to fit the shapes of their constellations. The Enchanting and Smithing trees are less powerful, and most other trees are more powerful. \r<br />\r<br />The vanilla Enchanting system allowed you to enchant your gear with up to +160% to one-handed, two-handed, marksman, sneaking, and many other skills. It allowed you to reduce the cost of any spell in the game to zero, and reach 100% resistance to all forms of magic. Clearly, having a single skill tree that let you become more powerful than any Daedric Lord is somewhat broken. To counteract this, I&#39;ve reduced the bonus from the Enchanter perk from 20% to 10% per level, and reduced the benefit from enchanting skill by 20%.\r<br />\r<br />The Smithing tree has been restructured, loosely based on learning how to work with new materials. For example, since Elven smithing requires steel and moonstone, you&#39;ll need to learn Steel Smithing before Elven Smithing. Since Glass Smithing requires moonstone and malachite, you&#39;ll need to learn Elven Smithing before Glass Smithing, and so on. Since neither moonstone or malachite are needed for Dragon Armor, it is no longer a requirement. Additionally, Smithing has been made into more of a a specialist tree, with one extra perk required to unlock the full tempering bonus for a given type of smithing. However, the number of perks to reach any given type of smithing is greatly reduced. Dragon Armor only requires 3 perks to reach, and Daedric Smithing only requires 4. \r<br />\r<br />The Alchemy tree has actually been made stronger in some ways; the Experimenter perk has had it&#39;s requirements substantially reduced, making it much easier to learn all the various properties of a given ingredient.\r<br />\r<br />The Light Armor tree has had many extra perks added, to bring it in line with the Heavy Armor tree. However, it&#39;s abilities tend to be more in the nature of dodging than in resisting. Now there are legitimate reasons to go with Light Armor over Heavy Armor.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-1-1360287512.png[/img]\r<br />\r<br />Many of the traps have been made substantially more dangerous. Swinging blade traps, bear traps, explosive oil traps, dart traps, and more have had their damage substantially increased, and in many cases doubled. Don&#39;t stand in the fire; It won&#39;t help you.\r<br />\r<br />Because of the Encumbrance effect, you may find that getting past swinging blade traps is far more difficult, and can prove fatal. Do what Indiana Jones would do, and toss your heavy gear through it before you go in yourself.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-2-1360271569.png[/img]\r<br />\r<br />This mod requires the following official DLC from Bethesda Softworks:\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-1-1360271623.png[/img]\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-2-1360271623.png[/img]\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-3-1360271623.png[/img]\r<br />\r<br />No, I have no plans to make alternate versions that do not require these mods. I support Bethesda by purchasing their DLC, and recommend that everyone do the same.\r<br />\r<br />Additionally, this mod requires both [url=http://skse.silverlock.org/]SKSE[/url] and [url=http://skyrim.nexusmods.com/mods/3863]SkyUI 3.1[/url] or higher. Here&#39;s why:\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-3-1360271569.png[/img]\r<br />\r<br />SkyRealism allows you to use SkyUI&#39;s MCM control panel to activate or deactivate many of the features, such as encumbrance, dynamic capacity, and many of the basic needs features. It also allows you to control some of Skyrim&#39;s settings, such as time scale. More features will be added over time.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-5-1360271569.png[/img]\r<br />\r<br />Everything contained in this file was created entirely from scratch by MTichenor (aka IndigoNeko). \r<br />\r<br />Special thanks go to Cordsnwires, Elys, David Brasher, Dogtown1, Dragten, Hothtrooper44, Ironman5000, Is this display name taken?, JaySuS, jjc71, Nikinoodles, Nivea, MECR, Merilia, PrivateEye, Sydney666, T3nd0, theRoadstroker, trainwiz, Tupii, and wobbuvahi for all their support and for making the mods that kept me hooked on skyrim long after it should have lost its appeal. Another special thanks to Sharlikran for making TES5Edit, without which this mod could never have been made.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/30959-4-1360271623.png[/img]\r<br />\r<br />[i]Q: Will you make a version that doesn&#39;t require Dawnguard, Hearthfire, or Dragonborn?[/i]\r<br />\r<br />A: No. I support Bethesda by purchasing their DLC, and I recommend that everyone else do so as well. Additionally, nearly all of the components that went into this mod are available as separate mods on SkyrimNexus. Here&#39;s a complete list: [url=http://skyrim.nexusmods.com/mods/30123]Armor Adjustment[/url] - [url=http://skyrim.nexusmods.com/mods/29061]Balanced Perk Trees[/url] - [url=http://skyrim.nexusmods.com/mods/21224]Capacity and Carry Weight[/url] - [url=http://skyrim.nexusmods.com/mods/21535]Detection Durations[/url] - [url=http://skyrim.nexusmods.com/mods/23765]ENB Evolved[/url] - [url=http://skyrim.nexusmods.com/mods/21211]Encumbrance[/url] - [url=http://skyrim.nexusmods.com/mods/22327]Feast and Famine[/url] - [url=http://skyrim.nexusmods.com/mods/25370]Grass[/url] - [url=http://skyrim.nexusmods.com/mods/21724]Mass and Materials[/url] - [url=http://skyrim.nexusmods.com/mods/21866]Portable Crafting Kits[/url] - [url=http://skyrim.nexusmods.com/mods/21695]Simple Save System[/url] - [url=http://skyrim.nexusmods.com/mods/21552]Time and Travel[/url]\r<br />\r<br />[i]Q: What components in this can be deactivated via MCM?[/i]\r<br />\r<br />A: Basic Needs, Encumbrance, and Dynamic Carry Weight can all be disabled. However, the changes to item weights, recipes, encounter zones, enemies, equipment, and enchantments are done by editing the base item forms and cannot be disabled via MCM. However, you can use TES5Edit to snip out whichever components you don&#39;t like. If you don&#39;t like the leveled list changes, simply open up this mod with TES5Edit and right click the Encounter Zones section and click remove. It&#39;s that simple&#33;\r<br />\r<br />[i]Q: Will you add support for (insert specific mod name here)?[/i]\r<br />\r<br />I don&#39;t intend to do direct support for any mods, since this IS an overhaul. However, I will eventually write an article that details exactly how to create compatibility patches. \r<br />\r<br />If you would like a specific feature, or have any feedback, please post here in the comments&#33; I know I can&#39;t please everyone, but as long as what you&#39;re recommending is both reasonable and realistic, I&#39;ll try to do it&#33;",
  "categoryId": "79",
  "version": "1.02",
  "author": "MTichenor",
  "createdUnix": "1360447598",
  "updatedUnix": "1360781715",
  "containsAdultContent": false,
  "uploadedBy": "MTichenor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000008577",
      "name": "SkyRealism - Encounter Zones",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "SkyRealism - Encounter Zones-31328-1-0.7z",
      "uploadedUnix": "1360462290",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/33e6040a6490d176f790c57bbfc17e038eaa3499c570840ee972ca26529b1432/analysis/1407408524/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Encounter%20Zones-31328-1-0.7z?fid=1000008577&ttl=1535806788&ri=8192&rs=8192&setec=fd2bad4bbf8602670c50f4139d81a852"
    },
    {
      "fileId": "1000009361",
      "name": "SkyRealism",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "650",
      "fileName": "SkyRealism-31328-1-02.7z",
      "uploadedUnix": "1360717181",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/075b78f283a16c97d3ba4f9f3d1b023f8a2e0ec61bfd8ef7dd15b4f102e22eeb/analysis/1407413768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism-31328-1-02.7z?fid=1000009361&ttl=1535806789&ri=8192&rs=8192&setec=00a8f30e5cd2c79428d87c75ebd06752"
    },
    {
      "fileId": "1000009540",
      "name": "SkyRealism - Compatibility Patches",
      "version": "1.01",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "23",
      "fileName": "SkyRealism - Compatibility Patches-31328-1-01.7z",
      "uploadedUnix": "1360781715",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/fd382a05979ceaba4b353b8d474bd2e2ec7239b20c9e690143230f532436ce9c/analysis/1407415502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Compatibility%20Patches-31328-1-01.7z?fid=1000009540&ttl=1535806789&ri=8192&rs=8192&setec=63fe3f5336e8e17caa09d52bdc8c99c2"
    }
  ]
}