{
  "modId": 31360.0,
  "modName": "Fix - Missing in Action - General Tullius now gives the Imperial Order",
  "summary": "Thanks to this tiny mod, General Tullius will ALWAYS give the &#39;Imperial Order&#39; to the Dragonborn, which commands the Thalmor Guards in Northwatch Keep to free the captive Thorald Gray-Mane&#33;  Requires the Unofficial Skyrim Patch.",
  "descriptionHtml": "[center][img]http://static-3.nexusmods.com/15/mods/110/images/31360-1-1360481129.jpg[/img][/center]\r<br />\r<br />[center][b][u]Mod Fix for the:[/u][/b][/center]\r<br />[center][b]SideQuest: [url=http://www.uesp.net/wiki/Skyrim:Missing_In_Action]Missing In Action[/url] - General Tullius will now give you the Imperial Order&#33;[/b][/center]\r<br />\r<br />\r<br />Despite installing the Unofficial Skyrim Patch, did you had any troubles getting General Tullius to give you the Imperial Order which is required for freeing the prisoner in Northwatch Keep? My mod comes to correct this&#33;\r<br />\r<br />\r<br />\r<br />[u][heading]MOD INFO[/heading][/u]\r<br />Everyone remembers the infamous &#34;Missing in Action&#34; SideQuest which is given to the player by talking to any of the 2 oldest families of Whiterun Hold, the Battle-Born and Gray-Mane, which are at feud with each other.\r<br />\r<br />The player is asked to free Thorald, a member of Gray-Mane Family, who was trapped by the Battle-Borns and was sent to the Thalmor who keep him imprisoned in Northwatch Keep.\r<br />\r<br />First of all, the quest allows the player 2 possible ways to finish it - by using peaceful/diplomatic means (without bloodshed), or by using violence (deaths and bloodshed). \r<br />The peaceful way, however, (even if you install the Unofficial Skyrim Patch which fixes all the issues and bugs in the quest), is more complicated to complete than the violent way... \r<br />\r<br />The problem is a hidden conditional branch imposed by Bethesda to the peaceful gamers, without letting them be aware of it:\r<br />\r<br />The players who prefer the bloody/violent way for finishing the quest, can do so, without any prerequisites, nor conditions. They can simply go, fight and kill the powerful Thalmor guards in Northwatch Keep and free the prisoner. Simple. But&#33; The players who prefer the diplomatic/peaceful way, will find that they are unable of doing so, because there is a hidden condition imposed to them, without them being aware of: You have to join the Imperial Legion faction (which starts the main Civil War questline) in order to free the prisoner without bloodshed&#33;\r<br />\r<br />More specifically, General Tullius, the commander of the Imperial Legion, won&#39;t give you the Imperial Order if you aren&#39;t already a member of the Imperial Legion faction&#33; And therefore, Joining the Imperial Legion faction (and start the Civil War questline), becomes a mandatory for peaceful gamers who prefer diplomacy over violence&#33; Very unfair&#33; This is wrong of Bethesda&#39;s part.\r<br />\r<br />The condition of having to start the Skyrim&#39;s Main Quest line (join Imperial Legion and such) in order to finish the peaceful part of this Side Quest, does not look right to me. I feel it is wrong. The 5 reasons/points here explain why I had to create this mod:\r<br />\r<br />1) The game itself does not gave us any hints/tips about what is needed to be done for the player to convince General Tullius to agree and help. The game doesn&#39;t even tells us (neither directly, nor indirectly), that, by joining the Imperial Legion, we will finally get an Imperial Order from Tullius. We don;t even know that we HAVE to join the Legion faction for General Tullius to agree to help us free the prisoner&#33; Absolutely no clue&#33;\r<br />\r<br />2) Demanding from the peaceful players extra conditions (Join the Legion) that the violent players couldn&#39;t have (they don&#39;t need to join any factions), is an unfair treatment from Bethesda&#39;s part.\r<br />\r<br />3) Forcing the peaceful gamers to pick up of sides in the Civil War (and thus join the Legion) in order to complete the sidequest, makes the maintaining of the neutrality towards the Civil War very difficult. Especially for people who could like to leave the civil war for later, for when they are absolutely ready about it.\r<br />\r<br />4) Such condition that requires us to join a faction in order to free someone of the OPPOSITE faction, simply, makes no sense to me. Why having me to join the Civil War by becoming a member of the Imperial Legion Faction in order to free and save Thorald who is a member of the Stormcloaks? Makes no sense at all.\r<br />\r<br />5) General Tullius couldn&#39;t refuce to give the Imperial Order to the player, given that this secret Thalmor custody is REVEALED/ESPOSED to the public (the player and the Gray-Mane family now are aware of Imperial Legion&#39;s ivolvement in this dirty work and this is the reason the player visits Tullius). This leak of information could worry Tullius. And the logic says that a good General such as Tullius couldn&#39;t put his reputation at risk due to his tolerance towards Thalmor&#39;s tortures which may draw unwanted public attention and stir the people against the Empire. This is one more reason Tullius should put an end to the martyrdom of Thorald and order his freedom, before it draws unwanted public attention with unforeseen consequences&#33;\r<br />\r<br />So here my mod comes: my mod puts some logic to Bethesda&#39;s errors and General Tullius of the Imperial Legion will now give you the &#39;Imperial Order&#39;, a letter that commands the Thalmor to free the captive Whiterun citizen, Thorald Gray-Mane, without requiring from you to join the Legion first (and thus, you can now complete this side quest without being forced to start the Main Questline of the game)...\r<br />\r<br />So, with few words, all what this tiny mod does to your game is just to tweak a dialog&#39;s conditions and disable the [REQUIREMENT: Join Imperial Legion Faction] dialog message condition which prevents General Tullius from giving you the letter that orders the Thalmor Guards to free the prisoner, if you aren&#39;t member of the Legion already. With few words, Tullius will always give you the letter, regardless of your stance in the Civil War (neutral, Imperial Legion or Stormcloak rebels). Simple&#33;\r<br />\r<br />Requires the Unofficial Skyrim Patch (USP). Please install this if you want all the bugs, in &#34;Missing in Action&#34; sidequest, addressed/fixed. Without the USP, you may run into bugs that left unfixed by Bethesda and which may break up the quest. \r<br />\r<br />\r<br />\r<br />[u][heading]MOD DETAILS[/heading][/u]\r<br />This mod is extremely small in file size, consists of only a single .esp file, which is clean of any dirty edits, and ensures 100% compatible with all the 2.000+ mods for TESV: Skyrim&#33; Enjoy&#33;\r<br />\r<br />\r<br />\r<br />[u][heading]MOD REQUIREMENTS[/heading][/u]\r<br />Requires the [url=http://skyrim.nexusmods.com/mods/19]Unofficial Skyrim Patch (USP)[/url]\r<br />\r<br />\r<br />\r<br />[u][heading]INSTALL[/heading][/u]\r<br />Just place the .esp to the Skyrim/Data Folder and activate it.\r<br />\r<br />\r<br />\r<br />[u][heading]UNINSTALL[/heading][/u]\r<br />Just deactivate/remove the .esp from the Skyrim/Data Folder.\r<br />\r<br />\r<br />\r<br />[u][heading]LOAD ORDER[/heading][/u]\r<br />Just load this mod AFTER the Unofficial Skyrim Patch. Simple.\r<br />\r<br />\r<br />\r<br />[u][heading]COMPATIBILITY[/heading][/u]\r<br />Compatible with ANYTHING. \r<br />This mod is so small - it only edits a dialog between General Tullius and the player. Nothing else&#33;\r<br />Because of its limited nature, this mod is compatible with all the 2.000+ mods for TESV: Skyrim&#33; \r<br />Note: It is obvious that any other mods that are trying to &#34;fix&#34; the quest &#39;Missing in Action&#39; are obsolete if the [url=http://skyrim.nexusmods.com/mods/19]Unofficial Skyrim Patch[/url] is already installed in your game.\r<br />\r<br />\r<br />\r<br />[u][heading]TROUBLESHOOTING[/heading][/u]\r<br />If you have any problems with the quest or the NPCs, please don&#39;t post them here, my mod does not touches anything&#33; For more info about the quest and for help, check the UESP, TESW, and USP pages:\r<br />[url=http://www.uesp.net/wiki/Skyrim:Missing_In_Action]The &#39;Missing in Action&#39; quest in the Unofficial Elder Scrolls Pages[/url].\r<br />[url=http://elderscrolls.wikia.com/wiki/Missing_in_Action]The &#39;Missing in Action&#39; quest in the Elder Scrolls Wiki[/url].\r<br />[url=http://skyrim.nexusmods.com/mods/19]The Unofficial Skyrim Patch&#39;s download page[/url]\r<br />\r<br />\r<br />Enjoy&#33;",
  "categoryId": "95",
  "version": "1.0",
  "author": "SilentResident",
  "createdUnix": "1360485870",
  "updatedUnix": "1360486938",
  "containsAdultContent": false,
  "uploadedBy": "SilentResident",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000008645",
      "name": "Missing in Action - Dialog Condition Removed",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Missing in Action - Dialog Condition Removed-31360-1-0.rar",
      "uploadedUnix": "1360486938",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/afc34eecb319b3b9467a022c1324cdc37b29c94245ce4d8ad0921f899b1b1e35/analysis/1407409163/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Missing%20in%20Action%20-%20Dialog%20Condition%20Removed-31360-1-0.rar?fid=1000008645&ttl=1535806848&ri=8192&rs=8192&setec=e7bf52a4f5cae93b91573ae017043e2b"
    }
  ]
}