{
  "modId": 31377.0,
  "modName": "Travel By Boat",
  "summary": "To all non-fast travellers, here is a little mod that let you wander the rivers of Skyrim by boat.\r\nYou will find two lines : west and east, each deserved by a wooden ferry that can lead you to various places. A third line has been implemented (real-time journey), along with a new event system.",
  "descriptionHtml": "[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/sSbds.png[/img][/url][/center]\r\n\r\n[color=yellow][b][u]Overview[/b][/u][/color]\r\n\r\nTo all non-fast travellers (and others), here is a mod that let you wander the rivers of Skyrim by boat.\r\nYou will find two lines : west and east, each deserved by a wooden ferry that can lead you to 15  various places. Also you will find a third line in the north. This one is a bit different, as it can lead you in real-time from Solitude to Yngol Barrow and vice-versa.\r\n\r\nWest : Abandoned Shack, Solitude, Morthal, Crabber\\'s Shanty, Dragon Bridge, Karthwasten and Reachcliff Cave.\r\nEast : Yngol Barrow, Windhelm, Mixwater Mill, Whiterun, Riverwood, Half-Moon Mill, Ivarstead and Riften.\r\n\r\nPlease see the map included in the archive for more information.\r\n\r\nDuring your trips, you will face various events, presented via message boxes, with multiple choices and equipment-dependencies.\r\n\r\nNote that before every trips, you must free your boat from the docks by untying a rope. Sorry for real-life sailors because the way the ships are attached is highly unrealistic, but it\\'s immersive, in a certain way :)\r\n\r\n[color=yellow][b][u]Features[/b][/u][/color]\r\n\r\n[list]\r\n[*]A quick [i]starting[/i] animation of the boat when you depart. [u]The fast travel is launched after a few seconds[/u] (it would be very hard to make an entire journey because of the rapids, rocks and falls).\r\n[*]At your arrival, you will received a report of your journey. You will encounter some minor events, the main one being the fact that you need to have a security kit onboard, otherwise you may be arrested by river guards and requested to pay a 1000 Septims fine.\r\n[*]Sellers of such security kits are in Whiterun (the Bannered Mare - Barnard), Solitude (docks, on a boat - Brunei), Windhelm (docks, leant on a wall - Bruno) and Morthal (outside, leant on a wall - Agatha). They cost about 600 Septims with a low Speechcraft level and with no mods. They are also available in inns, sometimes (so LItemFoodInnCommon has been modified).\r\n[*]You have a chance to use a security kit during your journeys, because there are a lot of rapids in Skyrim. It\\'s a 20% chance, so you may ask yourself whether you prefer to risk a penalty or pay an expensive security tool...\r\n[*]You do not need to discover the places where you want to go. Maybe in future versions, because I already scripted the conditions. Currently, I think it\\'s not necessary because security kits balanced the mod in a way that you will think twice before travelling by boat. Carriages are still very useful.\r\n[*]You can\\'t use the boats while you are in combat.\r\n[*]Each boat have a small orange light in its center, which makes easier to recognize as a ferry boat.\r\n[*][color=red]v1.1[/color] Hawsers! All ships are now attached to a mooring, a walkway or a sea pole. Before sailing, you have to loose the rope. To do this, you must press \\\"E\\\" near the attach point of the rope. You will find a lantern at this place to help you (this is a trigger box, because I wanted to force the player to go to a certain place to prepare his boat). So, again, you have to stand in a specific area, and be looking at the rope you wish to loose ; there is no \\\"Activate This\\\" overtext. [color=orange]Note that you have 20 seconds to set sail before the rope attach the boat back to the dock.[/color] It is to prevent bugs and in a lore-friendly way of speaking, let\\'s say it\\'s because rivers of Skyrim are strong and can take your ship away!\r\n[*][color=red]v1.1[/color] From Riverwood (to anywhere), you will enjoy a 30 seconds trip with 3 waypoints :) I\\'ve been playing with scripts to see how I could implement a full real-time journey and it looks pretty good. However, at the end of the Riverwood trip, you will see a first problem : a fall! But here, the fast travel will save you. Whew...\r\n[*][color=red]v2.0[/color] Coastal Line. At Solitude and Yngol Barrow, you\\'ll see two new ships with a red glow instead of an orange one. These boats will lead you through the north shores of Skyrim in real time. As 30 minutes can be a long time, you can buy a Swiftness Device that will let you choose if you prefer to Fast Travel directly to your destination. However, if you do so, you won\\'t be able to stop during your journey, because if you choose the real time trip, you will be asked if you wish to stop in the surrounding area several times. Note that you can open your world map during these journeys. [color=red][u]Do not ever fast travel when you are in a boat![/u][/color]\r\n[/list]\r\n[color=yellow][b][u]Install/Uninstall[/b][/u][/color]\r\n\r\nThis archive contains 23 files :\r\n\r\n[list]\r\n[*]Both psc/pex versions of the scripts needed by the mod.\r\n[*]The main .esp file.\r\n[*]A map of Skyrim with related locations (not needed by the mod...).\r\n[*]A readme file.\r\n[/list]\r\n[b]To install :[/b]\r\n1/ Delete old scripts if you have any (those beginning with \\\"_TB_\\\").\r\n2/ Extract the archive to ...\\\\Skyrim\\\\Data and overwrite if you need to.\r\n\r\n[b]To uninstall :[/b]\r\n1/ Make sure that you are not tired, not sick (fever) and have no stamina bonus in your Active Effects tab and quit the game.\r\n2/ Delete the _TB_* scripts and QF__01019527.psc/.pex.\r\n3/ Delete the .esp.\r\n\r\nThis mod requires nothing but Skyrim.\r\n\r\n[color=yellow][b][u]Compatibility[/b][/u][/color]\r\n\r\nSome map markers references have been renamed, but that should not cause any problems. LItemFoodInnCommon (Leveled Item) has been modified. However, I made custom merchants in case any of your other mods modify this same object.\r\nEvery other elements have been created for the purpose of this mod, so it\\'s compatible with everything, until proven otherwise...\r\n\r\nThis mod has been tested with Solitude Docks District and Expanded Towns and Cities without any problems. (see comments)\r\n\r\nFrom aoxer concerning Expanded Towns And Cities Morthal (comments section) : \\\"[...] I had no problem with buildings at all, but the fisherman dude had a boat that was in the same location as this one. It didn\\'t cause any problems, except sometimes the fisheman would sit in his boat and appear to be sitting in yours. So if you sailed away from the dock, there would be another boat left behind where you used to be with him in it. I disabled the fisherman\\'s boat and had no issues since. [...] Just open the console, click on the boat, and type \\\"disable\\\" without the quotes.\\\"\r\n\r\n[color=yellow][b][u]Known problems[/b][/u][/color]\r\n\r\n[list]\r\n[*]Thanks to Pushkatu : \\\"If you get drunk using Realistic Needs and Diseases mod, you keep falling dawn. This animation can break the boat travel one and your character will get stuck in a weird position and maybe even get a CTD.\\\" (comments)\r\n[*]Your horse can appear at some strange place (in the water, for example).\r\n[*]For a reason I can\\'t explain, the point of view can sometimes be changed during a trip. It\\'s maybe due to one of my mod, because it doesn\\'t happen with a fresh start.\r\n[*]Sometimes the boat will not reset its position, especially after crashes. Save and reload and that will fix the problem. Loading your game will always reset boats positions.\r\n[/list]\r\n[color=yellow][b][u]My other mods[/b][/u][/color] \r\n\r\n[URL=http://skyrim.nexusmods.com/mods/34959/?][img]http://img15.hostingpics.net/pics/681151bannirestr.png[/img][/URL]\r\n[URL=http://skyrim.nexusmods.com/mods/37042/?][img]http://img11.hostingpics.net/pics/698925banniresurvive.png[/img][/URL]\r\n[URL=http://skyrim.nexusmods.com/mods/37816/?][img]http://img15.hostingpics.net/pics/888189bannireweightedarrow.png[/img][/URL]",
  "categoryId": "78",
  "version": "2.2",
  "author": "Joubarbe",
  "createdUnix": "1360507303",
  "updatedUnix": "1366566208",
  "containsAdultContent": false,
  "uploadedBy": "Joubarbe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025718",
      "name": "Travel By Boat",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1156",
      "fileName": "Travel By Boat-31377-2-2.rar",
      "uploadedUnix": "1366566208",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/5c33c51d57a57e51bed4cd1d841fc81529de2e667be01d9244b0d62c53e8d9fe/analysis/1407533223/",
      "changelogHtml": " - Just a hotfix : added a missing file (a script fragment needed for the \"tired\" effects to be removed). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Travel%20By%20Boat-31377-2-2.rar?fid=1000025718&ttl=1535806877&ri=8192&rs=8192&setec=1c6e3751fcd74210632e2eb8289f1d41"
    }
  ]
}