{
  "modId": 31383.0,
  "modName": "The Art of Defense - Shields and Perks",
  "summary": "Features:\r\n- Small and big variants of nearly every non-unique vanilla shield\r\n- New shields integrated in level-lists\r\n- New block perk tree, offering more flexibility and more direct control\r\n- Perk-effects get weaker/stronger depending on the equipped shield type\r\n- Fully modular, all dlcs supported",
  "descriptionHtml": "So, right at the beginning something thats not part of the mod:\r\n[color=Wheat][size=2][Controls]\r\nfInitialPowerBashDelay=0.3\r\nfInitialPowerAttackDelay=0.3[/size][/color]\r\nThese two lines from the Skyrim.ini define how long (in seconds i guess) the attack key must be pressed before a power attack is performed. I play with both set to 0.16\r\nThis improves the responisveness for the input drastically.\r\nFor those who have the little bug with higher weapon speeds which always causes a normal attack to be executed before the power bash triggers, due to the fact that the animation finished faster than 0.3 seconds, and in conclusion a power attack on a blocking enemy is impossible, this ini-tweak is the fix.\r\n\r\n\r\n\r\nDESCRIPTION_Text\r\n-\r\n-Vanilla effects of shields\r\n\r\n[size=5][color=DarkOrange][b]Features[/b][/color][/size]\r\n[list][*] No scripts used.\r\n[*] \r\n[*] All new shields use vanilla textures, so they are compatible with texture replacers. Glass shields support transparancy.\r\n[/list]\r\n\r\n[size=7][color=DarkOrange][b]Shields[/b][/color][/size]\r\n\r\n-Buckler\r\n-LargeShield\r\n-Leveled Lists\r\n-doesn\\'t cover uniques\r\n\r\n[size=7][color=DarkOrange][b]Perks[/b][/color][/size]\r\n\r\nThe perk tree does not force the player to specialize on a certain type of shield. Instead, the effects of some perks slightly differ depending on the shield used.\r\n-List of Perks\r\n\r\n[List] [*]\r\n[/List]\r\n\r\nPut list into ReadmeTab\r\n\r\n[size=6][color=DarkOrange][b]Performance[/b][/color][/size]\r\n\r\n\r\n\r\n\r\n[size=6][color=DarkOrange][b]Files/Compatibility[/b][/color][/size]\r\n\r\n[color=DarkOrange][size=3][b][u]Main Download[/u][/b][/size][/color]\r\n\r\n[List] [*] [color=Wheat]Shields_Source.esm[/color]  \r\nAlways needed. Adds the new shields to the game including their crafting recipes. Does not overwrite any vanilla edits. Is pretty much compatible with every other mod.\r\n[*] [color=Wheat]Shields_Lists.esp[/color]  \r\nAdds the new shields to the leveled lists. If you have any other mod that edits the same lists, [url=http://skyrim.nexusmods.com/mods/1840]WryeBash[/url] is able to merge the changes of both mods into it\\'s bashed patch. [url=http://skyrim.nexusmods.com/mods/25859]Tes5Edit[/url] can do the same with it\\'s merged patch. *Note: i recommend using WryeBash, load shields_list.esp last and make sure it\\'s tagged as delev. Otherwise the new shields will appear less often ingame.\r\n[*] [color=Wheat]Shields_Perks.esp[/color]  \r\nContains all the changes to the perks and perk tree. Nothing else was edited. All spells and magic effects used by the perks are new records to avoid conflicts with other mods. So, as long as another mod doesn\\'t edit block perks or the perk tree itself, there are no issues. *It may be even possible to load this mod after a perk overhaul that is editing the block perks and others, as long as it doesn\\'t apply or use the block perks by scripts (scripts used by the perks themselves won\\'t be an issue). But before doing so, remove all block perks and temporary uninstall the mod if necessary.\r\n[*] [color=Wheat]Shields_noPerks.esp[/color]\r\n\r\n[*] [color=Wheat]Shields_Dragonborn.esp[/color]  \r\nAdds variants of the shields included in the dragonborn dlc, and edits the new leveled lists to make the shields appear ingame. Also edits the redoran guard outfit to make them use all three shield variants. Should be treated the same way as Shields_Lists.esp.\r\n[*] [color=Wheat]Shields_Dragonborn_NoLists.esp[/color]\r\nSame as above, but without editing the lvl-lists.\r\n[*] [color=Wheat]Shields_DawnguardBuckler.esp[/color]  \r\nChanges the Dawnguard (the faction, not the dlc) shields to appear as bucklers.\r\n[*] [color=Wheat]Shields_UniqueShields.esp[/color]  \r\nRight now only makes the Targe of the blooded appear as buckler.\r\n[/List]\r\n\r\n[color=DarkOrange][size=3][b][u]Optional Files[/u][/b][/size][/color]\r\n\r\n[List] [*] [color=Wheat]GlobalDamageAdjuster.esp[/color]\r\nEdits the settings of the difficulty slider so npcs and player do always the same amount of damage.\r\nNovice 1x, Apprentice 1,25x, Adept 1,5x, Expert 1,75x, Master 2x, Legendary 2,5x\r\n[*] [color=Wheat]CombatTweaks.esp[/color]\r\n[/List]\r\n\r\n[size=3][color=DarkOrange][b][u]Creating Patches[/u][/b][/color][/size]\r\nIf you have another mod adding shields to skyrim, and you consider them small or big enough to be treated as bucklers or large shields by the perks, creating a patch is pretty simple.\r\n1. If the mod is delivered as an .esp, open up wrye bash and do a right click on the mods esp. Than click \\\"esmify\\\" (this flags the plugin as esm, while keeping it\\'s filename so the ck is able to treat it as master file). If the mod is a .esm, this isn\\'t necessary.\r\n2. Open up the shield mod and Shields_Source.esm in the creation kit. If the mod is a .esp, make sure it\\'s loaded after my mod, for the .esm the ck loadorder should be the same as skyrims.\r\n3. Navigate to the shields you want to change. Open the shield record. On the right side in the \\\"keywords\\\" area, make a right click and add a new keyword, either aabuckler or aalargeshield. Press OK to apply the chages to the shield.\r\n4. After editing all the shields you want to, save your edits and name the file whateveryouwant.esp.\r\n5. Redo step 1., but this time klick \\\"espify\\\". The new plugin still loads the edited mod as master, even if the game loads it as esp.\r\nMake sure you load the new file after the edited mod.\r\n\r\n\r\n\r\n\r\n\r\n[size=6][color=DarkOrange][b]Installation[/b][/color][/size]\r\n\r\nNpcs Equipment is loaded from the savegame, not the plugins. So if the player has met a npc before installing this mod and the npc has spawned with a orcish shield, he will keep this shield and has no chance to get a orcish buckler on installation of this mod. On the other hand, if the player met an npc after installing this mod, and he spawned with the orcish buckler, then he won\\'t get th orcish shield when the mod is uninstalled, and remains with no shield at all. This happens with all mods editing leveled lists, but because this mod only adds shields and no armors or weapons, the effect is not game breaking. A single npc can be fixed by disabling an reanbling via the console (open console, click on npc and type disable and then enable).\r\n\r\n\r\n\r\n\r\n\r\n[size=6][color=DarkOrange][b]Recommended Mods[/b][/color][/size]\r\n\r\n[size=3][color=DarkOrange][b]Combat[/b][/color][/size]\r\n[url=http://skyrim.nexusmods.com/mods/5485]Deadly Combat[/url]\r\nA very good mod for combat-mechanics, working well and highly compatible. Makes combat faster and, yeah, more deadly.\r\n[url=http://skyrim.nexusmods.com/mods/10906]The Dance Of Death[/url]\r\nA killmove mod, adding unused killmoves to the game. It has an option to disable killmoves done to the player, so you\\'ll never get the \\\"I had blocked that one..\\\"-feeling again.\r\n[url=http://skyrim.nexusmods.com/mods/601]Realistic Ragdolls and Force[/url]\r\nBodies use more realistic physics, eg they just drop instead of beeing pushed away by an arrow. I\\'ve actually forgotten how the game looks without it.\r\n\r\n[size=3][color=DarkOrange][b]Perks[/b][/color][/size]\r\n[url=http://skyrim.nexusmods.com/mods/10037]ACE[/url]\r\nA great perk overhaul, but it\\'s missing the block tree. Well not anymore..\r\nThe realistic fighting module is compatible with Deadly combat and my mod.\r\n[url=http://skyrim.nexusmods.com/mods/10456]Path of Shadows[/url]\r\nA sneak overhaul. Alters sneak settings and sneak perks for a litle more realism and challange.\r\n\r\n[size=3][color=DarkOrange][b]Weapons[/b][/color][/size]\r\n[url=http://skyrim.nexusmods.com/mods/21120]Heavy Armory[/url]\r\nDoes the same for weapons what my mod does for shields (without the perks). New shortswords, spears, staves, helbards, hatches and more.\r\n[url=http://skyrim.nexusmods.com/mods/12892]Weapons of the Third Era MoS edition[/url]\r\nAnother weapon adding mod. This adds mainly katanas, wakizashis, tantos and others.\r\n\r\n[size=3][color=DarkOrange][b]Animation[/b][/color][/size]\r\n[url=http://skyrim.nexusmods.com/mods/34950]Immersive Animations[/url]\r\nThis one has a file that adds a Strafe-animation instead of running sideways in 3rd person while blocking. Without this, playing with shield in 3rd person is nearly impossible.\r\n\r\n\r\n\r\n[size=6][color=DarkOrange][b]Credits[/b][/color][/size]\r\n[url=http://skyrim.nexusmods.com/mods/5315]Bucklers[/url]\r\nThe first mod to come up with bucklers. I used it pretty long, but was unsatisfied with their implementation in the game.\r\n[url=http://skyrim.nexusmods.com/mods/10902]Weapon Variants Expansion[/url]\r\nThe same as above, but for the large shields.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "55",
  "version": "beta",
  "author": "dren_yppah",
  "createdUnix": "1360507629",
  "updatedUnix": "1360510186",
  "containsAdultContent": true,
  "uploadedBy": "ffe3214",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000008709",
      "name": "Global Damage Adjuster",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Global Damage Adjuster-31383-1-0.7z",
      "uploadedUnix": "1360510186",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6ab295373f4672f52de285bcfc9a7d9d25b0ff622133e01ad77f03700d6f937d/analysis/1407409566/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Global%20Damage%20Adjuster-31383-1-0.7z?fid=1000008709&ttl=1535806885&ri=8192&rs=8192&setec=23b3aad3a32290da68dbc5b6eb444a53"
    }
  ]
}