{
  "modId": 31385.0,
  "modName": "Perfect Orcs",
  "summary": "Do you know the truth of the Orc?",
  "descriptionHtml": "-DISCLAIMER-\r\nThis is part of an in-joke between me and my friends. So, if you don\\'t like it, too bad.\r\n-INTRO-\r\nIt has been known for many a year that the Orc is a being that is created from garlic and Orichalcum. They are literally forged through a secret practice known only to Orcs, which is why they stay holed up in their strongholds. Throughout the third era, a certain commodity became available to the Orcs, a commodity known as Horker Butter. The Orcs would use this to shine their skin, and give them an illustrious green sheen. Over the years, they found a way to mix in this wondrous cream into their ingots, and, along with garlic, created a type of metal simply known as \\\"Horkichalcum\\\". This ingot was much stronger than the traditional Orichalcum, on par with even Daedric weaponry. Before long, the constant poaching of Horkers for their butter, the Horker populations began to dwindle. Thus, Horker Butter became a black-market good, which only the richest of Orcs could afford. With the recent turmoil in Skyrim, the hunting of Horkers seems to have been brought back into full swing, and not only can Orcs glaze themselves with the luscious cream, Horkichalcum can once again be forged. And oh, it will be forged.\r\n-FEATURES-\r\n- Horker Butter can be picked up off of Horkers, and can occasionally be bought from any vendor selling foodstuffs.\r\n- Horkichalcum ingots can be crafted at a smelter, then made into Horkish equipment.\r\n- Full set of Horkish weapons/armor, fully temperable.\r\n- Glaze the mighty Volendrung for extra damage!",
  "categoryId": "78",
  "version": "1",
  "author": "Tsaruskie Mani",
  "createdUnix": "1360511629",
  "updatedUnix": "1360511615",
  "containsAdultContent": false,
  "uploadedBy": "TsaruskieMani",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000008720",
      "name": "Horkichalcumnation",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Horkichalcumnation-31385-1.rar",
      "uploadedUnix": "1360511615",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/bf99b401a543a603a2c58d4ca082885d452437bb984bf30bd308a11e515a9712/analysis/1407409683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horkichalcumnation-31385-1.rar?fid=1000008720&ttl=1535806887&ri=8192&rs=8192&setec=3cba0cbb9d3d01151ec332ba7045dc80"
    }
  ]
}