{
  "modId": 31450.0,
  "modName": "ImpeREAL Empire - Unique Cities - Falkreath",
  "summary": "Small, clean and smart mod that improves the cities of Imperial Tamrielic Empire, without messing up your game&#33; This mod improves the city of Falkreath while it ensures 100% Compatibility with all 3.000+ mods for the Elder Scrolls V: Skyrim&#33;",
  "descriptionHtml": "[color=#e2a753]Thanks for [b]endorsing[/b] my mod&#33;[/color]\r<br />\r<br />[center]Welcome, welcome&#33;\r<br />The humble author of the [b][url=http://oblivion.nexusmods.com/mods/19589]ImpeREAL City[/url][/b] mod\r<br />for TES IV: Oblivion, returns to TES V: Skyrim&#33;[/center]\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/31450-1-1397968738.jpg[/img][/center]\r<br />\r<br />\r<br />[center][b][u]A lore-friendly decorative mod which improves the:[/u][/b][/center]\r<br />[center][b]City of [url=http://www.uesp.net/wiki/Skyrim:Falkreath]Falkreath[/url][/b][/center]\r<br />[center][img]http://static-1.nexusmods.com/15/mods/110/images/31450-1-1360587318.png[/img][/center]\r<br />\r<br />\r<br />Despite being a Hold Capital, the city of Falkreath, does not really look much different than the neighboring, yet smaller, towns of Riverwood and Helgen. Does it? Where is the glorius city of Falkreath, for which is said that thousands of fights took place here, and that people from all over Skyrim, visit, walk and get burried on its soil??\r<br />My mod comes to correct this. While most other mods simply expand or decorate Falkreath, my own mod does NOT expand the city. It simply deals with the core of the problem that makes the city look no different than the other villages of Skyrim. And at same time, [color=#5fff00]my mod ensures 100% compatibility with all 3.000+ mods for TESV Skyrim[/color]&#33;\r<br />\r<br />Don&#39;t forget to [color=#e2a753]endorse[/color] it, if you like it&#33; Help the others gamers be aware of my mod&#33; :)\r<br />\r<br />\r<br />\r<br />[u][heading] [/heading][/u]\r<br />[center]Video of the mod, by hodilton&#33;[/center]\r<br />[center][youtube]Ge4HjWqPa8o[/youtube][/center]\r<br />[center]Video, by samv96UK&#33; (Skip to 4:45)[/center]\r<br />[center][youtube]v2RDsiBOfoY&[/youtube][/center]\r<br />\r<br />\r<br />\r<br />[u][heading]MOD INFO[/heading][/u]\r<br />When you visited [b]Whiterun[/b] for the first time, you felt impressed with the city&#39;s beauty, didn&#39;t you? It gave you an excitement for further exploring the mysterious province of Skyrim. And when you visited [b]Solitude[/b], (yes, the city with the mighty walls), you probably said &#34;whoa&#33;&#34; and you became even more satisfied with Bethesda&#39;s work, didn&#39;t you? You was flying in the sky, from happiness&#33;\r<br />Well, that was true, until you visited the city of [b]Falkreath[/b]. You fell from the clouds in a shock when the historical Falkreath welcomed you with... the Rivewood&#39;s stone walls&#33;? (or those were the walls of Helgen? It looks all same to me&#33;). Very disappointing... And, if Falkreath really is the Capital of one of the most populous Holds in Skyrim, the Hold of Falkreath, then, how comes it only has dirt (&#33;) roads that we mostly see in the... wilderness? Such dirt roads fit better in Ivarstead and Riverwood, yes, But not in Falkreath...&#33;  And if this wasn&#39;t enough, why Falkreath is being called a historical city, (which, according to the history books, was once a part of the Imperial Province of Cyrodiil but seceded and became part of Skyrim), while in the game, we don&#39;t even see anything the &#39;historical&#39; in it that may reflect its Cyrodiilic past, (with the mere exception of its notable Imperial-styled graveyard of course). Falkreath didn&#39;t even had an inch of Imperial walls which is the primary characteristic of all the Cyrodiilic cities such as Bruma, Anvil and Chorrol&#33; Very unrealistic, if you ask me. Falkreath, more or less, feels like it is a mere re-design of Riverwood...\r<br />All these make no sense...  So, here I come with this mod&#33;\r<br />\r<br />\r<br />\r<br />[u][heading]MOD DETAILS[/heading][/u]\r<br />This mod, although it does major visual changes to the city of Falkreath, still it is extremely small in terms of file size (less than 30KB&#33; - no kidding), and consists of a single .esp file, which is checked and cleaned with TES5Edit, and ensures 100% compatibility with all the 3.000+ mods for TES V: Skyrim&#33;\r<br />\r<br />[u]What my mod does:[/u][list] [*] Makes Falkreath be more of a unique city, like all the other hold capital cities of Skyrim.[*] Falkreath&#39;s walls now are more unique, and no longer same as Helgen&#39;s or Riverwood&#39;s walls.[*] Falkreath&#39;s buildings have their appearance updated to display a more lore-friendly architecture, which features Cyrodiilic + Skyrim elements. Combines the fine Imperial Stone with the strong Nordic Wood and traditional hay roofs.[*] Is a clean mod. Always is scanned with TES5Edit and checked for errors.[*] Is a friendly mod. Fully compatible with all other mods in your game&#33; [*] Is Loading Order-neutral mod. Doesn&#39;t matter where in the Loading Order you place it&#33; [/list]\r<br />[u]What my mod does NOT: [/u][list] [*] No edits to Navmesh.[*] No edits to any NPCs.[*] No edits to any Dragons, Bandits, or Vampires, etc.[*] No edits to existing Buildings, Decor, Objects, Items, or Walls.[*] No edits to Landscape, Trees, Rocks, and Flora.[*] No edits to the vanilla game, at all. Absolutely no edits&#33;[*] No disabling nor deletions of stuff&#33; (my mod does not touch the game at all)[*] No dirty edits, ITM, and such trash&#33;  The mod is absolutely clean&#33; (verified by TES5Edit)[*] No edits to scripts, events and quests, or whatever you may think.and...[*] ...contains no errors&#33; [/list]\r<br />\r<br />\r<br />[u][heading]MOD REQUIREMENTS[/heading][/u]\r<br />No mod dependencies or requirements. This is a standalone mod.\r<br />\r<br />\r<br />\r<br />[u][heading]INSTALL[/heading][/u]\r<br />Just place the .esp to the Skyrim/Data Folder and activate it.\r<br />\r<br />\r<br />\r<br />[u][heading]UNINSTALL[/heading][/u]\r<br />Just deactivate/remove the .esp from the Skyrim/Data Folder.\r<br />\r<br />\r<br />\r<br />[u][heading]LOAD ORDER[/heading][/u]\r<br />This is a Load Order Neutral Mod. With simple words, really it doesn&#39;t matter where you place it. This mod is safe to be placed anywhere in your game&#39;s mod loading order. Feel free to group it in the same load order with all other decoration mods for your game.\r<br />\r<br />\r<br />\r<br />[u][heading]COMPATIBILITY[/heading][/u]\r<br />My mod is designed with the goal of full compatibility with anything else that modifies the city of Falkreath, and therefore it decorates the city carefully, without touching any vanilla objects&#33;\r<br />[u]The ImpeREAL Empire - Unique Cities - Falkreath is:[/u]\r<br />[color=#00cc00]100%[/color] compatible with any game versions\r<br />[color=#00cc00]100%[/color] compatible with all Official Patches\r<br />[color=#00cc00]100%[/color] compatible with all Unofficial Patches\r<br />[color=#00cc00]100%[/color] compatible with all the Official DLCs (Dawnguard, etc)\r<br />[color=#00cc00]100%[/color] compatible with all the 3.000+ mods out there.\r<br />[color=#00cc00]100%[/color] compatible with any mods that may do changes to Falkreath\r<br />[color=#00cc00]100%[/color] compatible with any mods that add stuff to or expand Falkreath\r<br />[color=#00cc00]100%[/color] compatible with the Expanded Towns and Cities Mod.\r<br />[color=#00cc00]100%[/color] compatible with any overhaul mods\r<br />[color=#00cc00]100%[/color] compatible with any texture mods\r<br />[color=#00cc00]100%[/color] compatible with any NPC mods\r<br />With simple words, my mod is [color=#00cc00]100%[/color] compatible with anything in TES V Skyrim&#33; Need to say more?\r<br />This mod should be compatible with everything. If you are in doubt about the compatibility of any mod with &#34;ImpeREAL Empire - Unique Cities - Falkreath&#34;, then read the sentence above as: &#34;This mod is compatible with &lt;name of the mod you were going to ask about&gt;&#34;.\r<br />\r<br />[b][u]For the ETaC users:[/u][/b]\r<br />Although my mod is fully compatible with Expanded Towns and Cities (ETaC), two options are available for the ultimate experience from using both mods:\r<br />\r<br />[b]OPTION 1: FOR STRONG COMPUTERS [b]( * means it is available for download on ETaC&#39;s page)[/b][/b]\r<br />\r<br />- [color=cyan]ETaC - Complete[/color] *\r<br />- [color=cyan]ImpeREAL Empire - Unique Cities - Falkreath[/color]\r<br />- [color=cyan]ETaC - Complete ImpeREAL Patch[/color] *\r<br />[color=gray]What this mod combination offers: This gives you the full experience of both ETaC and ImpeREAL mods. Falkreath gets all buildings and walls updated, and new towers added. This is however GPU-demanding as the city of Falkreath gets many decorations, and they can cause bigger FPS loss.[/color]\r<br />\r<br />or\r<br />\r<br />[b][b]OPTION 2: [/b]FOR MEDIUM or WEAKER COMPUTERS ( * means it is available for download on ETaC&#39;s page)[/b]\r<br />\r<br />- [color=cyan]ETaC - Complete[/color] *\r<br />- [color=cyan]ImpeREAL Empire - Unique Cities - Falkreath for ETaC[/color]\r<br />[color=gray]What this mod combination offers: This gives you the the full experience of ETaC but a lite experience of the ImpeREAL mod. Falkreath doesn&#39;t get its buildings updated, but it gets walls updated. Also the towers are added too. Recommended for weaker (1GB VRAM or less) machines. This is less GPU-demanding as the city of Falkreath gets fewer decorations that couldn&#39;t affect FPS that much.[/color]\r<br />\r<br />AUTHOR&#39;s RECOMMENDATION: It is up to you&#33; You can choose which one you like more, although I highly recommend the 2nd option over the 1st option, even if you have strong PC, especially if using Skyrim Flora Overhaul, HD Textures, and any other graphical GPU-intense mods that make Falkreath, and the forests surrounding it, to look immensely more beautiful&#33; :)\r<br />\r<br />\r<br />\r<br />[u][heading]HISTORY/CHANGELOG[/heading][/u]\r<br />[b]Version 1.0 - Date: 14/08/2013[/b][list] [*]Given that no one has experienced any problems with my mod, which has no bugs at all and works flawlessly, I am happy to announce that it is now considered a finished/completed mod&#33;[/list]\r<br />[b]Version 0.91 - Date: 16/02/2013[/b][list] [*]Adjusted the height of the stone floor around the benches.[b]Version 0.9 - Date: 16/02/2013[/b][*]Finishing touches to the city of Falkreath.[*]Stone stairs have been improved.[*]Columns have been corrected.[*]Walls by the doors of 3 large buildings have been updated.[/list] \r<br />[b]Version 0.8 - Date: 14/02/2013[/b][list] [*]The whole city has been updated to the new architecture&#33;[/list] \r<br />[b]Version 0.5 - Date: 13/02/2013[/b][list] [*]Half of the city&#39;s buildings have been updated to the new architecture&#33;[/list] \r<br />[b]Version 0.4 - Date: 13/02/2013[/b][list] [*]New city architecture for the buildings of Falkreath&#33;[*]3 buildings, so far, have been updated to the new architecture.[/list] \r<br />[b]Version 0.3 - Date: 13/02/2013[/b][list] [*]Expanded my mod&#39;s compatibility with 2 other more mods that make changes to Falkreath.[*]Southern wall is removed to fix clipping between my mod and the Falkreath Expanded Mod.[/list] \r<br />[b]Version 0.2 - Date: 12/02/2013[/b][list] [*]Finishing details to Falkreath&#39;s walls.[*]Falkreath&#39;s watch towers now feature new roofs that match with the city&#39;s wall roofs.[/list] \r<br />[b]Version 0.1 - Date: 11/02/2013[/b][list] [*]Upgraded Falkreath&#39;s walls from poor village walls to realistic and lore-friendly city walls.[*]Added more of those new city walls around the city. Falkreath is a walled city&#33;[*]Added small decorations (shrubs, rocks and barrels) around the new walls.[*]Falkreath now features Watchtowers next to it&#39;s gates, much like other major cities do.[/list] \r<br />\r<br />\r<br />[u][heading]TROUBLESHOOTING[/heading][/u]\r<br />Please do not post here any problems you may have in your game&#33; My mod DOES NOT TOUCHES ANYTHING in your game&#33; Absolutely nothing&#33; :) \r<br />So if your game crashes to desktop, your savefiles are bloated or corrupted, or if you have missing items/objects in the towns, floating torches, or invisible walls, or whatever, it is very likely that you messed it up. Thats why the community always warns: be careful when installing mods&#33; Always read their readmes for proper installation/uninstall&#33; Please do not ask for my help, unless you got a proof that a problem in your game is caused by the ImpeREAL Cities - Falkreath mod. To ensure this, first test carefully all the installed mods in your game, one by one, Disable all mods that may do changes to outdoors/landscape/cities, before you accuse my mod for any troubles you may be having with other mods&#33; :)\r<br />\r<br />\r<br />\r<br />[u][heading]QUESTIONS AND ANSWERS[/heading][/u]\r<br />[b][u]Question:[/u][/b]\r<br />What motivated you to make this mod?\r<br />[b][u]Answer:[/u][/b]\r<br />In the game&#39;s World Map of Skyrim, the Hold Capitals are marked with a unique, shield-like icon, with the Hold&#39;s symbol carved on it. But in the actual game, not all the Hold Capitals really feel like unique cities and seats of Holds where the Jarls of Skyrim live. These cities are: Falkreath, Morthal, Dawnstar and in a lesser extend, Winterhold. Although, on the game&#39;s world map, this Shield icon highlights and distinguishes the Hold Capital Cities from towns and villages (which have a Town icon, instead), in the actual game, these Hold Capitals (Falkreath, Morthal and Dawnstar) are not really distinguished (architecturally) from the less-important towns and villages of Skyrim, such as Riverwood, Dragon Bridge, Helgen, Rorikstead or Ivarstead...\r<br />[b][u]Question:[/u][/b]\r<br />Do you make use of any new textures or meshes in your mod?\r<br />[b][u]Answer:[/u][/b]\r<br />Nope. Absolutely no new textures or meshes are added with my mod.\r<br />My mod&#39;s goal is to borrow the textures and meshes of the vanilla game, as it has been a long-time request of the people and the community to finally have a mod that upgrades the Falkreath&#39;s architecture, while at same time, keeping the Falkreath&#39;s textures in par with the quality of textures for all other cities. This way, the mod allows Falreath&#39;s graphics to be synced with the rest of the game&#39;s graphics in case you ever install any texture mods such as the [b][url=http://store.steampowered.com/app/202485/]High Resolution Texture Pack[/url][/b] (the free DLC from Steam). With few words, all the texture or DLC mods out there that may improve the game&#39;s textures, are fully compatible with my mod&#33; Falkreath will be updated and look as good as all other major cities if you install any better textures for your game&#33; In my mod, I use some specific textures carefully picked up from Solitude, which features an Imperial architecture, similar to the Colovian. This is the best possible presentation of imperial architecture for the former Cyrodiilic city of Falkreath.\r<br />[b][u]Question:[/u][/b]\r<br />Does your mod affects the game&#39;s performance?\r<br />[b][u]Answer:[/u][/b]\r<br />Yep, especially on some weaker machines. Because my mod&#39;s textures and meshes are placed ONTO the vanilla ones (without touching/removing/disabling/replacing them). This way your computer will have to render twice the content in Falkreath. The reason I followed this method is because this is the best way to preserve your game&#39;s stability and to achieve full compatibility with anything else you may have installed in your game- patches, mods, DLC, and anything&#33; A very smart idea, indeed, but it was pretty tricky for me to achieve this. Thankfully, the result is worth the effort&#33; Again, There is no performance impact for most computers, thanks to the way the Skyrim&#39;s engine runs, but people who have weaker machines may notice some FPS drops.\r<br />[b][u]Question:[/u][/b]\r<br />What is your personal goal by making this mod?\r<br />[b][u]Answer:[/u][/b]\r<br />Dear people, I tried very very hard to achieve the changing of Falkreath&#39;s architecture to something that:\r<br />1) reflects the city&#39;s Past history as part of Cyrodiil and\r<br />2) reflects the city&#39;s Present history as part of Skyrim\r<br />by marrying elements of its current Nordic architecture with the former Imperial architecture.\r<br />And I had to do that by:\r<br />1) using whatever meshes and textures the vanilla game offered to me\r<br />2) avoid creating my own meshes and textures, in order to ensure full customization of my mod with Bethesda&#39;s High Res Texture Pack (DLC) and any other texture mods out there.\r<br />And all these things had to be done:\r<br />1) without sacrificing the primary goal of FULL compatibility with vanilla game plus all 3.000+ mods over there.\r<br />2) without touching any vanilla game&#39;s objects such as houses, clutter, decorations, items, etc&#33;\r<br />That&#39;s why the mod is for: improve Falkreath&#39;s lore-friendly architecture up to the point the game allows me to do so, WITHOUT touching the vanilla buildings at all&#33; This way, my mod is absolutely (100%) compatible with ANY mods in TES Nexus and in Steam Workshop&#33; I am very happy to present you a mod that keeps all these stuff in a balance.\r<br />[b][u]Question:[/u][/b]\r<br />But... brick walls with hay roofs? Are you sure?\r<br />[b][u]Answer:[/u][/b]\r<br />This type or architecture is nothing new - we have seen combinations of Roman with Galatic architecture in the past, and given how difficult is for me to camouflage the hay roofs of Falkreath&#39;s buildings, we better stick with this for now, until we come with something better in the future.\r<br />[b][u]Question:[/u][/b]\r<br />What are your next plans? Any new mods?\r<br />[b][u]Answer:[/u][/b]\r<br />Maybe&#33; xD. It is recommended that I wait and see how things will go with this mod, before I can safely decide if it is time or not, for the next mod.\r<br />\r<br />\r<br />Have a nice day and [color=#e2a753]remember to [b]endorse[/b] the mod[/color]&#33;",
  "categoryId": "53",
  "version": "1.0",
  "author": "SilentResident",
  "createdUnix": "1360581321",
  "updatedUnix": "1407911122",
  "containsAdultContent": false,
  "uploadedBy": "SilentResident",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010315",
      "name": "ImpeREAL Empire - Unique Cities - Falkreath",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "ImpeREAL Empire - Unique Cities - Falkreath-31450-0-91.rar",
      "uploadedUnix": "1361034886",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/71e17b4e26a1a1e0ba135b81433834ae7e72d43e91f050dbf21c4fca3911e0d5/analysis/1407420850/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ImpeREAL%20Empire%20-%20Unique%20Cities%20-%20Falkreath-31450-0-91.rar?fid=1000010315&ttl=1535806986&ri=8192&rs=8192&setec=790d0704476d1ac6e17bdec2f2abdda2"
    },
    {
      "fileId": "1000121802",
      "name": "ImpeREAL Empire - Unique Cities - Falkreath for ETaC",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "ImpeREAL Empire - Unique Cities - Falkreath for ETaC-31450-1-0.rar",
      "uploadedUnix": "1407911122",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3bf1bfb6d6489b1464f7560ce49cd5b80c8d8e49fc66bc07bd1b4278ac198f1a/analysis/1407911172/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ImpeREAL%20Empire%20-%20Unique%20Cities%20-%20Falkreath%20for%20ETaC-31450-1-0.rar?fid=1000121802&ttl=1535806986&ri=8192&rs=8192&setec=91843c4a5efc745d8e44d2e4c935a1af"
    }
  ]
}