{
  "modId": 31460.0,
  "modName": "Better Bows Distribution Plugin",
  "summary": "This is an alternative esp for the Better Bows mod by Howiego08, which will distribute the new bows through levelled lists to integrate them with the game world.",
  "descriptionHtml": "General:\r\n=========\r\n\r\nThis mod is a new approach to a leveled list distribution of the bows introduced by Howiego08\\'s Better Bows mod (http://skyrim.nexusmods.com/mods/13317/). A similar approach was previously uploaded by TheFinn (http://skyrim.nexusmods.com/mods/28225/), but this did only modify a small fraction of the lists through which bows are distributed in the game and left most of them completely untouched. As a result, the new bows are used only by a minority of enemy factions and they are almost never found in chests and other loot. Moreover, at higher levels, when the leveled lists are filled by an ever increasing number of enchanted versions of the vanilla bows, the new bows become pretty rare items (in fact, this is a general problem with adding non-replacer items to the game which has to be addressed appropriately).\r\n\r\nThis mod delves much more deeply into the leveled list structure and provides much more variation by distributing the bows more widely. It also comes with a full set of enchanted versions, which guarantee a fair chance of obtaining the new bows even at high levels (this is especially important in view of the fact that special loot and reward lists are almost exclusively fed by enchanted items\\' lists):\r\n\r\n(1) The stats of the new bows were retained as in the original mod. They have been added to the lists at appropriately chosen specific levels. The strongest bows (the Valenwood war bow and the mammoth bows) appear above the Daedric bow, thereby effectively increasing the highest level at which new bows appear in the game from around 50 to somewhat below 60 (enchanted versions included).\r\n(2) The values of the bows were modified so as to prevent the game from being flooded with high value items at low levels.\r\n(3) The bows appear in the smithing categories that are best matching their materials and/or description. The recipes have been made dependent on the player\\'s level. To keep a slight advantage for the player though, each bow can be smithed 2-3 levels below the level at which it would appear otherwise in the game.\r\n(4) There is one unique bow with a unique enchantment, which can be found at Alftand.\r\n(5) Each new bow has a full set of enchanted versions that matches that of the vanilla bows with similar stats. Since special loot, boss chests and vendor chests are filled from enchanted item lists, there will be a fair chance now to acquire one of the new bows even at high levels (where otherwise the vanilla bows would grossly overweigh, due to the enchanted versions).\r\n(6) All potential enemies - bandits, draugr, imperial soldiers, forsworn, thalmor and vampires - do have a chance now to be equipped with some of the new bows. At the same time however, no actor will be equipped with a bow that is substantially stronger than the strongest bow he was supposed to equip in the vanilla setup. For example, an enemy who was not set up to use anything stronger than an elven bow in the vanilla game, will not use a new bow any stronger than a Colovian bow in this mod (Colovian bows will appear at level 8; an ornate Khajiit bow, which is the next stronger new bow, will not appear below level 30, while Elven bows already appear at level 19). On the other hand, an enemy who was set up to use a glass bow (appearing at level 27) in the vanilla game may well equip an ornate Khajiit bow instead, since this has been set up to first appear at a level which is only slightly higher. In addition, some outfit lists (i.e. \\\"use all\\\" flagged leveled lists which are exclusively used by outfits and determine the inventories of specific actors) and the inventories of several actor templates have been modified to use new bows along with the vanilla ones:\r\n\r\n- Imperial officers and Penitus soldiers will carry Colovian bows above a certain level. Guards and Imperial soldiers will be equipped with Colovian bows at a certain chance that increases with player level.\r\n- Bandits may be equipped with Colovian bows instead of Orcish bows at low and intermediate levels.\r\n- Draugr may be equipped with Colovian bows instead of Orcish bows at lower levels and with Orsimer chieftain bows instead of glass bows at higher levels. The draugr deathlords that have been set up to use ebony bows in the vanilla game will have a small chance to carry a hawk bow instead (which makes them somewhat, but not substantially, stronger ernemies).\r\n- Orc archers will be equipped with Orsimer chieftain bows instead of normal Orcish bows at high levels (who would have guessed ... ?)\r\n- A prominent wood elf will carry a fine bow from his homeland instead of a crappy hunting bow when he\\'s at an appropriate level.\r\n- Thalmor will have a chance to carry hawk bows at high levels.\r\n\r\nThe mod has been extensively play-tested for more than two weeks up to a player level of 56 to tweak the leveled list setup so as to keep the game well balanced. There is a good, but not overly high chance of finding the new bows on enemies and vendor lists (that is, they never will outnumber the vanilla bows), and there\\'s also a fair chance to find enchanted high-level versions of the strongest bows in loot all over Skyrim.\r\n\r\n\r\nInstallation:\r\n===========\r\n\r\n(1) You need to install the original mod first: http://skyrim.nexusmods.com/mods/13317/\r\n(2) Make a backup copy of the \\\"HBetterBows.esp\\\" file in your \\\"...\\\\Skyrim\\\\Data\\\" folder (in case you don\\'t like this mod and want to restore the version you\\'re presently using).\r\n(3) Unpack the archive and drop the esp file into your \\\"...\\\\Skyrim\\\\Data\\\" folder. Click \\\"yes\\\" if asked to overwrite.\r\n\r\n\r\nUninstallation:\r\n==============\r\n\r\nSince this mod is not scripted, it can be uninstalled at any time without a lasting effect on your save game. Just deactivate the esp and remove it (or replace it with the esp of the original mod).\r\n\r\n\r\nPossible interferences:\r\n======================\r\n\r\nAny mod that modifies the same records will interfere. Conflicts with the leveled lists are most easily solved by merging the leveled list records with Wrye Bash, although this may lead to a duplication of item types in inventories. Consider two mods A and B, which both replace an item in the same leveled list. Let\\'s assume that mod A adds new bows to the game and replaces Bow1 with Bow2, while mod B deals with swords and replaces Sword1 with Sword2. Since only the modifications of the later loading mod take effect, you are stuck with either a bow or a sword replaced (but not both) when no measures are taken to make the mods compatible. When the leveled lists are merged with Wrye Bash, all items are restored; that is, not only the new items from both mods are added, but also all items removed by any of the mods are undeleted. The resulting list contains Bow2 and Sword2, but also Bow1 and Sword1:\r\n\r\n(1) Mod A loading after mod B -> Items on list: Bow2, Sword1\r\n(2) Mod B loading after mod A -> Items on list: Bow1, Sword2\r\n(3) Both mods after merging the lists with Wrye Bash -> Items on list: Bow1, Bow2, Sword1, Sword2\r\n(4) Both mods plus compatibility patch -> Items on list: Bow2, Sword2\r\n\r\nThe preferred solution with the new items (Bow2 and Sword2) present and the old items (Bow1 and Sword1) gone can only be obtained with a specific compatibility patch. However, I am not aware at present of any mods that massively interfere with my plugin. Even with the leveled list plugin of the JaySuS Swords mod active at the same time, there will be only two conflicting records which do not justify to sacrifice a slot to a compatibility plugin. It has to be noted, however, that JaySuS\\'s plugin, although adding a large amount of new weapons to the game, does not delve really deeply into the leveled list structure (in some parts, it\\'s also not really well balanced). Nonetheless, if you spot massive interferences with a mod I\\'m not aware of, just post it and I will see what I can do.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Sclerocephalus",
  "createdUnix": "1363004497",
  "updatedUnix": "1363004438",
  "containsAdultContent": false,
  "uploadedBy": "sclerocephalus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016701",
      "name": "Better Bows Distribution Plugin ENGLISH",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "Better Bows Distribution Plugin ENGLISH-31460-1-0.7z",
      "uploadedUnix": "1363004321",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d62c613eae99ee1dc39ad19fbbe84aceda11d4931756e21ac412421c41656eb5/analysis/1407464466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Bows%20Distribution%20Plugin%20ENGLISH-31460-1-0.7z?fid=1000016701&ttl=1535806997&ri=8192&rs=8192&setec=bdaed4f1bb2b021167516d9ead03764d"
    },
    {
      "fileId": "1000016703",
      "name": "Better Bows Distribution Plugin GERMAN",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "Better Bows Distribution Plugin GERMAN-31460-1-0.7z",
      "uploadedUnix": "1363004438",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7f33d35a449e29d3a617812934eaa1a8feadfcfba0ef3fc0c8c3b2e1caa5a710/analysis/1407464467/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Bows%20Distribution%20Plugin%20GERMAN-31460-1-0.7z?fid=1000016703&ttl=1535806997&ri=8192&rs=8192&setec=257986888fade3c184ed07c4e5a63e1e"
    }
  ]
}