{
  "modId": 31485.0,
  "modName": "Wrath of Nature - The Path of the Druid",
  "summary": "Find an old tome containing ancient teachings of druidic lore which describes four different trials that will enable you to transform into powerful beasts that have the ability to harness the devastating forces of nature.",
  "descriptionHtml": "[img]http://static-3.nexusmods.com/15/mods/110/images/31485-1-1361068390.jpg[/img]\r<br />[heading][Font=Trebuchet MS, Helvetica, sans-serif][color=greenyellow][size=4]LATEST NEWS[/size][/color][/font][/heading]\r<br />Version 3.2. is released. New male spriggan mesh courtesy of VectorPlexus&#33; Kindly refer to the latest updates section for a more detailed look on the list of updates for 3.2.\r<br />\r<br />Back up your save files before updating as I will not be held responsible for files getting messed up due to this. Enjoy&#33;\r<br />\r<br />This mod is also available on the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=128704892]Steam Workshop[/url]&#33;\r<br />\r<br />[size=3][b][color=orange]Translations[/color][/b][/size]\r<br />Some translations that I have been made aware of: (Thanks guys)\r<br />[list]\r<br />[*] [url=http://bbs.skyrimcitizen.net/viewtopic.php?f=2&t=319]Chinese Translation by lmktaooo[/url]\r<br />[*] [url=http://www.nexusmods.com/skyrim/mods/55081/?]Polish Translation by Arti707[/url]\r<br />[*] [url=http://skyrim.nexusmods.com/mods/54008]New German Translation by ShadowDragon96[/url]\r<br />[*] [url=http://skyrim.nexusmods.com/mods/33701]German Translation by WileCoyote68[/url]\r<br />[*] [url=http://skyrim.nexusmods.com/mods/35009]Portuguese Translation by vsorg[/url]\r<br />[*] [url=http://tesall.ru/files/file/5084-]Russian Translation by Berillium[/url]\r<br />[*] [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/la_voie_du_druide.php\r<br />]French Translation by Kaos Sita[/url]\r<br />[/list]\r<br />[size=3][b][color=orange]Recommended[/color][/b][/size]\r<br />[list]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/39928]Wrath of Nature - The Champion of Kynareth[/url] \r<br />[*][url=http://skyrim.nexusmods.com/mods/37665]Druid Essentials[/url]\r<br />[/list]\r<br />[center][size=3][b][color=orange]Note:[/color][/b][/size] Now requires [url=http://skse.silverlock.org]SKSE[/url] and [url=http://skyrim.nexusmods.com/mods/3863]SkyUI[/url] 3.0 or higher&#33; (for MCM)[/center]\r<br />\r<br />[center]Watch [b]Gopher[/b] and Gamespot&#39;s very own [b]Cam & Seb[/b] doing awesome reviews of the mod. Thanks guys&#33;\r<br />\r<br />[youtube]T5K87n_HuU0[/youtube][youtube]QplXgBnWEwA[/youtube][/center]\r<br />\r<br />[center]Watch [b]Brodual&#39;s[/b] and [b]MMOxReview&#39;s[/b] excellent review of the mod&#33; Thanks guys&#33;\r<br />\r<br />[youtube]L40Cki0sZMM[/youtube][youtube]fejW-zPjRgw[/youtube][/center]\r<br />[heading][Font=Trebuchet MS, Helvetica, sans-serif][color=greenyellow][size=4]DESCRIPTION[/size][/color][/font][/heading]\r<br />Find an old tome containing ancient teachings of druidic lore which describes four different trials that will enable you to transform into powerful beasts that have the ability to harness the devastating forces of nature.\r<br />\r<br />Upon reaching level 10 and returning the Dragonstone to Farengar, a courier will deliver a letter to the player which triggers the quest &#34;Lost Practices&#34;.\r<br />\r<br />This mod adds 4 transformation lesser powers in the Alteration school of magic to the player&#39;s arsenal. They are lesser powers which means that Alteration perks do not affect magicka cost. Alteration enchanted gear will reduce the magicka required to cast it though.\r<br />\r<br />The transformations come equipped with their own special abilities. The monster skills use up stamina instead of magicka and the transformations last indefinitely.\r<br />\r<br />[heading][Font=Trebuchet MS, Helvetica, sans-serif][color=greenyellow][size=4]TRANSFORMATION SPELLS[/size][/color][/font][/heading]\r<br />[b][i][color=orange]Note:[/color] Pressing the &#34;Shout&#34; key anytime during a transformation will revert you back to your original form. Also, the jump actions for wolf and tiger both can serve as an attack.[/i][/b]\r<br />\r<br />[b][color=lightgreen]Aspect of Frost[/color][/b] - This spell will grant the user access to the powers of the frost wolf.\r<br />          [list][*][b][i][color=green]Left Click:[/color][/i][/b] Feral Bite - A melee attack with razor sharp teeth.  \r<br />          [*][b][i][color=green]Right Click:[/color][/i][/b] Frost Breath - A freezing breath attack.\r<br />          [*][b][i][color=green]Left & Right Click:[/color][/i][/b] Frigid Storm - Sub-zero winds form three icicles that shoot down towards the target and impales it.\r<br />          [*][b][i][color=green]Aura:[/color][/i][/b] The frost wolf encases foes in ice hindering their movement.\r<br />          [*][b][i][color=green]Passive:[/color][/i][/b] The frozen wolf is resistant to ice and more agile than any other form which gives it a bonus to movement speed. Also at higher levels (40 and above), the wolf freezes the path it walks on enabling it to walk on water.[/list]\r<br />[b][color=lightgreen]Aspect of Fire[/color][/b] - This spell will grant the user access to the powers of the flaming tiger.\r<br />          [list][*][b][i][color=green]Left Click:[/color][/i][/b] Fiery Strike - A melee attack with razor sharp claws.\r<br />          [*][b][i][color=green]Right Click:[/color][/i][/b] Flame breath - A flaming breath attack.\r<br />          [*][b][i][color=green]Left & Right Click:[/color][/i][/b] Blazing Inferno - The tiger generates intense flames around its body, scorching everything within the blast radius.\r<br />          [*][b][i][color=green]Aura:[/color][/i][/b] Rising temperatures deals continuous fire damage against foes, making them more vulnerable to intense heat.\r<br />          [*][b][i][color=green]Passive:[/color][/i][/b] The flaming tiger is resistant to fire and has more energy to unleash more havoc to its foes.[/list]\r<br />[b][color=lightgreen]Aspect of Earth[/color][/b] - This spell will grant the user access to the powers of the earth bear.\r<br />          [list][*][b][i][color=green]Left Click:[/color][/i][/b] Swipe Attack - A melee attack that inflicts Bone Break Fever.\r<br />          [*][b][i][color=green]Right Click:[/color][/i][/b] Rapid Dash - The bear lunges forward which generates a shockwave to stagger opponents.\r<br />          [*][b][i][color=green]Left & Right Click:[/color][/i][/b] Shockwave - The bear slams its paw on the ground dealing AoE damage.\r<br />          [*][b][i][color=green]Aura:[/color][/i][/b] An aftershock that disables enemies eventually making them unfit for battle.\r<br />          [*][b][i][color=green]Passive:[/color][/i][/b] The bear has fortified health and damage resistance but has a severe penalty to magic resistance.[/list]\r<br />[b][color=lightgreen]Aspect of Nature[/color][/b] - This spell will grant the user access to the powers of the healing tree spirit.\r<br />          [list][*][b][i][color=green]Left Click:[/color][/i][/b] Regrowth - The tree spirit&#39;s health and stamina are healed for 10 seconds.\r<br />          [*][b][i][color=green]Right Click:[/color][/i][/b] Nature&#39;s Swarm - The tree spirit focuses its magicka into a beam attack that deals magic damage. This skill spends magicka instead of stamina.\r<br />          [*][b][i][color=green]Spacebar:[/color][/i][/b] Nature&#39;s Call - The tree spirit summons smaller tree spirits to aid in battle. Number of tree spirits summoned depend on Alteration skill. Each tree spirit summoned lasts 30 seconds. Note that the tree spirits have their essences bound to the player. Any damage dealt to them will inflict a portion of damage to the player.\r<br />          [*][b][i][color=green]Aura:[/color][/i][/b] Healing Presence - The tree spirit heals nearby allies.\r<br />          [*][b][i][color=green]Passive:[/color][/i][/b] The healing guardian has fortified magical resistance.[/list]\r<br />[heading][Font=Trebuchet MS, Helvetica, sans-serif][color=greenyellow][size=4]TRANSFORMATION BONUSES[/size][/color][/font][/heading]\r<br />Each of the beast forms have bonus stats depending on the druid&#39;s level:\r<br />\r<br />[b][color=lightgreen]Frost Form[/color][/b]\r<br />\r<br />The frost form&#39;s health, stamina, damage resistance, magic resistance, frost resistance, and speed improve as the player levels up. Moreover, each point in stamina increases each stat by a given amount. This means that characters who have a decent amount of stamina will have a slightly more powerful frost form.\r<br />\r<br />[b][color=lightgreen]Fire Form[/color][/b]\r<br />\r<br />The fire form&#39;s health, stamina, damage resistance, magic resistance, fire resistance, and speed improve as the player levels up. Moreover, each point in stamina increases each stat by a given amount. This means that characters who have a decent amount of stamina will have a slightly more powerful fire form. Note that the fire form&#39;s speed bonus is inferior to the frost form&#39;s speed bonus.\r<br />\r<br />[b][color=lightgreen]Earth Form[/color][/b]\r<br />\r<br />The earth form&#39;s health, stamina, and damage resistance improve as the player levels up. Each point in health increases each stat by a given amount. This means that characters who have a decent amount of health will have a slightly more powerful earth form. Note that the earth form gets a gradual penalty to magic resistance and will keep going down as you level up. On the plus side, the earth form has the most superior bonus on health and damage resistance among all aspects.\r<br />\r<br />[b][color=lightgreen]Nature Form[/color][/b]\r<br />\r<br />The nature form&#39;s health, stamina, damage resistancem, and magic resistance improve as the player levels up. Each point in magicka increases each stat by a given amount. This means that characters who have a decent amount of magicka will have a slightly more powerful nature form. While the nature aspect only has average stats, it boasts the most magic resistance among the four aspects.\r<br />\r<br />[heading][Font=Trebuchet MS, Helvetica, sans-serif][color=greenyellow][size=4]COMPLETING THE TRIALS[/size][/color][/font][/heading]\r<br />Generally speaking the aspects are easy to defeat. It all depends on knowing what you&#39;re dealing with and what gear you&#39;re supposed to be equipped with.\r<br />\r<br />[b][color=lightgreen]Trial of Ice[/color][/b]\r<br />The spirit of the wolf is the weakest of the four aspects. It is obviously resistant to any type of frost power but equally vulnerable to fire. Pushing the wolf towards the water should also prove foolish as it can walk on water. In terms of gearing up you should be stocked with frost resistance potions and have some frost resistance enchanted gear.\r<br />\r<br />[b][color=lightgreen]Trial of Fire[/color][/b]\r<br />The spirit of the tiger is highly resistant to fire but equally vulnerable to frost. The tiger also is able to dish out an immense amount of damage very quickly while you&#39;re close to it so be sure to stay away and deal with it from afar. Be sure to bring fire resistance potions and enchanted gear.\r<br />\r<br />[b][color=lightgreen]Trial of Earth[/color][/b]\r<br />The spirit of the bear is greatly resistant to physical damage but luckily enough it has a weakness with magic. The bear has fortified physical attacks which means you should be always on the move and not let it get to you as much as possible. Gear with a high enough armor rating is vital to this trial.\r<br />\r<br />[b][color=lightgreen]Trial of Nature[/color][/b]\r<br />The spirit of nature is invulnerable to magic damage. It has no weakness plus it comes with three lesser tree spirits to aid her in battle. It is much more easier to have allies to fight with you as the battle could get out of hand pretty quickly. Gear up with magic resistance and a good armor rating is also necessary for this trial.\r<br />\r<br />[heading][Font=Trebuchet MS, Helvetica, sans-serif][color=greenyellow][size=4]COMPATIBILITY / ISSUES[/size][/color][/font][/heading]\r<br />[list][*] Sometimes the wolf, and bear reportedly glitches when running through walls and will enable you to pass through them.\r<br />[*] The Grandmaster - True Unarmed and Unarmored Combat mod by leecarter is incompatible as it causes players to have their health reduced every time they transform. There seems to be a conflict as to how much health should be returned to the player.\r<br />[*] It has been reported that the aspect of earth has an issue with the Requiem mod as it causes the movement speed to drastically drop to the point that you&#39;re not able to move.\r<br />[*] The enchantments on equipment do not get re-applied when the equipment are re-equipped. I&#39;ve found that this is a vanilla issue and I do not know if there is a workaround to make this work properly. If anyone knows how to re-equip items without losing enchantments let me know.\r<br />[*] It has been reported that BodyTypes 2.0 sometimes causes the aspects&#39; models to be invisible.[/list]\r<br />\r<br />[heading][Font=Trebuchet MS, Helvetica, sans-serif][color=greenyellow][size=4]LATEST UPDATE[/size][/color][/font][/heading]\r<br />[b][i][color=orange]Note:[/color] Back up your save files before updating&#33; Existing users should use a clean save before updating&#33;[/i][/b]\r<br />\r<br />[b]V3.2 Update[/b]\r<br />[list][*] The aspect of nature now uses the male spriggan mesh by VectorPlexus for male characters.\r<br />[*] Aspects&#39; normal attacks does not cost any stamina.\r<br />[*] Fix for aspect carry weight integrated.\r<br />[*] Aspect of Nature&#39;s Nature Call ability fixed. You can no longer summon infinite treelings.\r<br />[*] Duplicate &#34;H&#34; in the Falmer Sigils tome removed.\r<br />[*] Aspect abilities tweaks.[/list]\r<br />[i][b][color=orange]Important: [/color][/b][/i]This update has the carry weight fix integrated so the optional ESP file is no longer necessary. Please delete that file before installing this update.\r<br />[heading][Font=Trebuchet MS, Helvetica, sans-serif][color=greenyellow][size=4]CREDITS[/size][/color][/font][/heading]\r<br />Thanks to [b][color=green]VectorPlexus[/color][/b] for his amazing work on the male spriggan meshes&#33;\r<br />\r<br />Would like to thank [b][color=green]Jared Bangerter[/color][/b] and his excellent tutorial on making transformation spells. I&#39;ve personally never modded before but his teachings have proven to be really helpful. He&#39;s also the author of the mod [url=http://skyrim.nexusmods.com/mods/15045]Master Shapeshifter[/url] which is available on the Nexus.\r<br />\r<br />Thanks to [b][color=green]DVAted&#39;s team[/color][/b] for the Tiger model: \r<br />[list][*]Targaryen, tumbajamba & TreasureChest (model) \r<br />[*]DVAted (textures and model direction)[/list]\r<br />[b]Do not redistribute this model without proper permission.[/b]\r<br />\r<br />Big thanks to [b][color=green]Muppetpuppet[/color][/b] for publishing the [url=http://skyrim.nexusmods.com/mods/10473]sabre tiger texture[/url] as a mod resource. He is also responsible for one of the best quest mods out there - [url=http://skyrim.nexusmods.com/downloads/file.php?id=9782]The Moonpath to Elsweyr[/url].\r<br />\r<br />Props to [b][color=green]Vusak[/color][/b] and [b][color=green]Thunder Wolf VX[/color][/b] for helping out testing the mod and providing much needed ideas on how to improve it.\r<br />\r<br />Also thanks to [b][color=green]Kromey[/color][/b] and [b][color=green]Hanakoganei[/color][/b] for some tips on Scripting.",
  "categoryId": "93",
  "version": "3.2",
  "author": "Bluarchon",
  "createdUnix": "1361485418",
  "updatedUnix": "1399259722",
  "containsAdultContent": false,
  "uploadedBy": "Bluarchon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000107935",
      "name": "Wrath of Nature - The Path of the Druid",
      "version": "3.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4021",
      "fileName": "Wrath of Nature-31485-3-2.rar",
      "uploadedUnix": "1399259722",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/666594dfb7318ed0e616b23dda051c9d364e18a99a96b84a7be42a45fd025720/analysis/1408062961/",
      "changelogHtml": " The aspect of nature now uses the male spriggan mesh by VectorPlexus for male characters. <br/> \n Aspects&#39; normal attacks does not cost any stamina. <br/> \n Fix for aspect carry weight integrated. <br/> \n Aspect of Nature&#39;s Nature Call ability fixed. You can no longer summon infinite treelings. <br/> \n Duplicate &#34;H&#34; in the Falmer Sigils tome removed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wrath%20of%20Nature-31485-3-2.rar?fid=1000107935&ttl=1535807034&ri=8192&rs=8192&setec=09c22c13ca73f97cfd767fee3588c49c"
    }
  ]
}