{
  "modId": 31491.0,
  "modName": "Morrowind Imports",
  "summary": "Changes the stock of Brand-Shei, Revyn Sadri and the New Gnisis Cornerclub to include the new Morrowind related items from Dragonborn.",
  "descriptionHtml": "Requires Dragonborn. \r\n\r\nEver wondered why Brand-Shei would boast about his wares from Morrowind but would never have them in stock? Have you ever thought that the Dunmer of Windhelm were odd for not having goods and spirits from their home? This plugin fixes that. \r\n\r\nI\\'ve modified the merchant chests of Brand-Shei, Revyn Sadri and the New Gnisis Cornerclub to include wares from Morrowind that were provided in the Dragonborn DLC. Each of the vendors specialize in different goods imported from Morrowind. I gave the vendors a smaller stock size than those on Solstheim so you won\\'t be able to get a full stock of armor sets or all the ingredients without having to travel there. Additionally I made Nordic Carved armor, boar tusks and burnt spriggan wood unavailable from these merchants as they are more attuned to Solstheim than Morrowind. \r\n\r\nBrand-Shei will now regularly stock his stall in Riften with all sorts of oddities such as books, ash yams, beverages. crafting materials and ingredients of Morrowind. He will also occasionally offer Bonemold or Chitin armor. \r\n\r\nIn Windhelm Revyn Sadri of Sadri\\'s Used Wares will offer Bonemold and Chitin armor along with the materials to craft them and a few books from Morrowind. \r\n\r\nDown the street from Sadri\\'s you\\'ll find that the New Gnisis Cornerclub will offer both ash yams and beverages from Morrowind to remind the patrons of their home. \r\n\r\nInstall:\r\nSimply unzip and drag the MorrowindImports.esp into your data folder in .../Steam/steamapps/common/skyrim.\r\n\r\nUninstall:\r\nDelete MorrowindImports.esp from your data folder.\r\n\r\nConflicts: \r\nI have not ran into any myself but this plugin may conflict with any others that alter the leveled items lists of Dragonborn or any of the vendor\\'s merchant chests. I haven\\'t changed the stall, store or pub so that users who use a plugin that alters Riften or the shops won\\'t encounter any issues.",
  "categoryId": "69",
  "version": "1.0",
  "author": "Nazgar",
  "createdUnix": "1360623966",
  "updatedUnix": "1360623514",
  "containsAdultContent": false,
  "uploadedBy": "Nazgar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000009057",
      "name": "Morrowind Imports",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Morrowind Imports-31491-1-0.rar",
      "uploadedUnix": "1360623514",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/61cd5b246111977f0448bbbbbad9ae005ab545f80ccc101cde985350cc0e5d9d/analysis/1407411876/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morrowind%20Imports-31491-1-0.rar?fid=1000009057&ttl=1535807042&ri=8192&rs=8192&setec=7e3a500d26552cb2fef32441d8278f4f"
    }
  ]
}