{
  "modId": 31514.0,
  "modName": "Mod Translations Site - Spanish German Czech Italian Polish French Portugues and more",
  "summary": "Website to search translations for Nexus mods. More than 1700 translations mods registered. Find translations for all your mods automatically if you use NMM or Mod Organizer.",
  "descriptionHtml": "[size=+2][color=#FF3333][b]Find translations for all your mods automatically if you use NMM or Mod Organizer[/b][/color][/size]\r\n\r\n[size=+2][color=#ddaa00][b]Introduction[/b][/color][/size]\r\nHello friends of non-English speaking. I do not know if you share my opinion, but for those that we have many mods installed (for example, if we are followers of the STEP Proyect) is difficult to find all available translations in Nexus. Therefore I have made a site on which all Skyrim players can access and search for translations to their installed mods by entering the Nexus ID.\r\n\r\nHere is the site: [url=http://www.modtranslations.com]www.modtranslations.com[/url]\r\n\r\nTake a look to find translations for mods you already have installed.\r\n[b]Although in reality this mod is not a mod but a link to a web site, please download the main file from this mod to support Mod Translations here at Nexus, and endorse the mod if you think it is a good initiative.[/b]\r\n\r\n[size=+2][color=#ddaa00][b]Features[/b][/color][/size]\r\n[ul]\r\n[*] Instantly search translations for all your mods: upload a file from NMM or Mod Organizer, and find all translations for the mods on that files, in seconds.\r\n[*] If you follow the STEP Guide, upload a CSV file from them and find all translations for the project.\r\n[*] Translations hosted outside Nexus are supported, but the original mod (the one who are translated) must be a Nexus Mod.\r\n[*] \\\"Show All\\\" section, if you want to look one by one all the translations.\r\n[*] Anyone can report a translation very easily (but with a \\'Pending review\\' mark).\r\n[*] Subscription to mail alerts for individual mods: when you do a search, you can subscribe to alerts for those mods you are looking for. When a new translation is approved for one of those mods, an email is send.\r\n[*] Tool for translators: \\\"Most translated\\\" section. It show\\'s which are the most translated mods, but with the addition that looks those who are not translated into the language of the translator. If a mod has many translations, it may be because it is easy to translate or a very important mod. In this way, the translator can better choose his next job.\r\n[/ul]\r\n\r\n[size=+2][color=#ddaa00][b]News[/b][/color][/size]\r\n[color=#ddaa00][b]03-21: [/b][/color] Now you can subscribe to email alerts for new translations! When you do a search, fill in your email in the \\'Mail Alert subscription\\' box, and all the mods you are looking for will be tracked. When a new translation is approved for any of those mods, you receive an email.\r\n[color=#ddaa00][b]03-19: [/b][/color] Now you can notify translations outside Nexus. A new field called External URL was added, so leave blank the mod translation ID and fill in the URL fo your translations. However, the original mod still need to be a Nexus Mod, so they Nexus ID and Name is required.\r\n[color=#ddaa00][b]03-06: [/b][/color] New section called \\\"Most translated\\\". This section is intended to allow translators to see which are the most translated mods, but with the addition that looks for those not translated into the language of the translator. If a mod has many translations, it may be because it is easy to translate or a very important mod. In this way, the translator can better choose his next job.\r\n[color=#ddaa00][b]03-04: [/b][/color] Added NMM support: now you can upload \\\"InstallLog.xml\\\" file from Nexus Mod Manager to find your translations!!\r\n[color=#ddaa00][b]02-25: [/b][/color] We reach 1600+ informed translations. It is now almost certain that you will find what you need :)\r\n[color=#ddaa00][b]02-23: [/b][/color] Great advances on the site. Now the process to add a translation info is easier than ever. A search feature integrated with Nexus lets you look for some text, receive the mods that respond to that search, and you can directly indicate the original and the translation. Only 4 clicks are needed to inform a translation. All jQuery powered...\r\n[color=#ddaa00][b]02-21: [/b][/color] We have reached the 1000 informed translations. Many thanks to all the translators who loaded information in the web site. And the site continues to grow...\r\n[color=#ddaa00][b]02-17: [/b][/color] In response to my enhancement request, Tannin from Mod Organizer has placed starting from version 0.12.7, a new option within its program to download the full list of installed mods in CSV format. So if you use MO you can now upload the CSV file to [url=http://www.modtranslations.com]Mod Translations website[/url] and find out which translations you\\'re missing.\r\n[color=#ddaa00][b]02-16: [/b][/color] Now you can download a file with a list of all the mods of the STEP Project v2.2.1 from this mod files. Uploading that CSV file to the website, you will know what translations are available for the Mods of the project in your language.\r\n\r\n[size=+2][color=#ddaa00][b]To Do[/b][/color][/size]\r\n[ul]\r\n[*] Add the Nexus Uploader Username for translations, so translators can link to their list of translations.\r\n[/ul]\r\n\r\n[size=+2][color=#ddaa00][b]About the website[/b][/color][/size]\r\nAs you can see, is a very simple site where you can specify the ID of several mods that you have installed, the language you want, and the site search for all the translations available.\r\nIn addition, anyone may report a translation, so if you know any translation that database does not know, you can contribute by adding it.\r\nOne of the functions that I offer, and I think very useful, is the ability to search for translations from your NMM (uploading the \\\"InstallLog.xml\\\" file) or Mod Organizer (with their \\\"Export to CSV file\\\" option).\r\nWell, I hope you find my site handy and invite to all translators to inform their work on my site to make it grow and become really useful.\r\n\r\n[size=+2][color=#ddaa00][b]Thanks[/b][/color][/size]\r\n[ul]\r\n[*] Special thanks to [url=http://skyrim.nexusmods.com/users/4001252]nihlo[/url] which has made huge contribution reporting on the web site the majority of German translations.\r\n[*] Many thanks to Tannin to incorporate almost immediately on [url=http://skyrim.nexusmods.com/mods/1334]Mod Organizer[/url] the possibility of exporting the list in CSV format.\r\n[*] Many thanks to the guys from the [url=http://skyrim.nexusmods.com/mods/11]STEP project[/url] (especially to Farlo) by so quickly add a CSV file with a list of all the mods of the project.\r\n[*] And many thanks to all the authors of translations by having them made so that we can enjoy this game in our native language.\r\n[/ul]\r\n\r\nBest regards.\r\nJulio (from Argentina)",
  "categoryId": "28",
  "version": "1.5",
  "author": "Julio Farra",
  "createdUnix": "1360649449",
  "updatedUnix": "1360994449",
  "containsAdultContent": false,
  "uploadedBy": "juliofarra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010168",
      "name": "CSV file example",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "CSV file example-31514-1-1.zip",
      "uploadedUnix": "1360973646",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f233c86961707d8b9bad85299024a6a2c93289c9ee2d202d0e1f6512897ca684/analysis/1407419608/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CSV%20file%20example-31514-1-1.zip?fid=1000010168&ttl=1535807074&ri=8192&rs=8192&setec=849d75cc395b71b22ccc49e5f80f20d4"
    },
    {
      "fileId": "1000010228",
      "name": "CSV for STEP Projects mods",
      "version": "2.2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "CSV for STEP Projects mods-31514-2-2-1.zip",
      "uploadedUnix": "1360994449",
      "modVersion": "2.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/daeee1c6f5bc4c77e1e03eaae0d8c49f0022d268bb0cddd2746acc0db687b285/analysis/1407420024/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CSV%20for%20STEP%20Projects%20mods-31514-2-2-1.zip?fid=1000010228&ttl=1535807075&ri=8192&rs=8192&setec=9fc70a05b3778a70e5c71f2124631541"
    }
  ]
}