{
  "modId": 31530.0,
  "modName": "Tumbajambas Backpacks Extended",
  "summary": "An extended version of Tumbajamba&#39;s Mage Backpack.",
  "descriptionHtml": "-=IMPORTANT=- You must download and install the original mod &#39;Mage Backpack by Tumbajamba&#39; (http://skyrim.nexusmods.com/mods/31191/) or the mod will not fully work&#33; If you install this without the original mod then you will definitely have problems in-game&#33; If you comment asking about any problems this is known to cause you will be ignored&#33; -=IMPORTANT=-\r<br />\r<br />[b]Description[/b]\r<br />Now that the requirements are clearly stated (and will be again several times just for those who cannot be bothered reading), I can get to what this actually does. This mod simply provides retextured versions of the Mage Backpack by Tumbajamba to provide everyone with any play style the bonuses to help them. I wont list all of the enchantments, that is for you to go find out yourself, but I have tried to keep them appropriate to the symbol on the packs. They mainly fortify skills which go with the faction/hold/etc the symbol belongs to, for example the thieves guild backpack has a shadow mark and the skills it fortifies are sneak, lock picking, pick pocketing and speechcraft.\r<br />\r<br />You will find the backpacks in the tanning rack, under the misc category, they are craftable without any perks and currently only require leather, leather strips and wisp wrappings, I will change this in the next version to have an ingredient based on the emblem, such as thieves guild would require a lockpick.\r<br />\r<br />[b]Requirements[/b]\r<br />Skyrim 1.8\r<br />Mage Backpack by Tumbajamba (http://skyrim.nexusmods.com/mods/31191/)\r<br />\r<br />[b]Installation[/b]\r<br />Same install and uninstall as any other mod, this should not need to be explained every time someone uploads a mod, you should have the ability to use Google to find out how to install. On the chance that someone really cannot use Google: \r<br />\r<br />[url=http://bit.ly/ZAj4TE]Clicking this link means you accept that you cannot think for yourself.[/url]\r<br />\r<br />[b]Credits and Permissions[/b]\r<br />Tumbajamba - Models \r<br />DVAted - Original Implementation\r<br />Neronix17 - Re-texture&#39;s and re-implementation\r<br />Bethesda - Original Textures and Skyrim (obviously)\r<br />\r<br />Tumbajamba is to be contacted for any permissions related to the mod unless it is about the textures which I have done.",
  "categoryId": "60",
  "version": "1.1",
  "author": "Tumbajamba and DVAted and Neronix17",
  "createdUnix": "1360681417",
  "updatedUnix": "1360695493",
  "containsAdultContent": false,
  "uploadedBy": "durge13",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000009279",
      "name": "Backpacks Extended",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12658",
      "fileName": "Backpacks Extended-31530-1-1.zip",
      "uploadedUnix": "1360695493",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bbb3de06473c174ad25155c9489f00d2a706cac89fd84af579727103e617e089/analysis/1407413250/",
      "changelogHtml": " Rebalancing some of the attributes <br/> \n Textures have been fixed and converted to texture sets to reduce file size <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Backpacks%20Extended-31530-1-1.zip?fid=1000009279&ttl=1535807101&ri=8192&rs=8192&setec=0399f8e5561c293413244e97b036304b"
    }
  ]
}