{
  "modId": 31535.0,
  "modName": "Bonds Country Cottage Lore Correct",
  "summary": "A lore correct version of Bonds Country Cottage",
  "descriptionHtml": "By request I have created a lore correct version of Bonds Country Cottage. It occupies the same place as the original at the site of the burned out farm house near Fort Greymoor. Only use one Cottage at a time.\r\n\r\nI thought it would be a breeze to build a \\\"lore correct\\\" cottage. The carpenters scavenged what they could from the burned out remains of the farmhouse, but it wasn\\'t enough. The only other place to get used lumber was Helgen.\r\n\r\nThe builders wouldn\\'t go there to scavenge the ruins until they were cleared of bandits, so I hired mercenaries and cleared out the bandits and left the mercenaries to protect the builders while they gathered the best of the damaged material from the ruins.\r\n \r\nI could have bought new lumber at the Riverwood Mill at half the cost, but the interesting part became furnishing the place. There are no used furniture merchants, so it was necessary to bargain with various individuals for their old beds and tables and chairs. They usually demanded new furnishings as replacement.\r\n \r\nFortunately I had lots of bearskins to toss about to give the place a comfortable look, and after tossing in a bit of obligatory hay, (all farmhouses have hay scattered about), I deemed the house fit for habitation.\r\n \r\nThe locals deemed me \\\"eccentric\\\" and now clutch their amulets and cross themselves when they see me coming. The builders union now has me black listed.\r\n \r\nThe house is companion friendly and sleeps four.\r\n\r\nIt has been cleaned with Tes5Edit, although some of the stains and scorch marks resisted all efforts at cleaning. After burning incense for several days the place doesn\\'t smell too bad though. You get used to it. Hope everyone enjoys this humble home. \r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "Bond",
  "createdUnix": "1360685762",
  "updatedUnix": "1360685527",
  "containsAdultContent": false,
  "uploadedBy": "Bond123",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000009239",
      "name": "Bonds Country Cottage Lore Correct",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "122",
      "fileName": "Bonds Country Cottage Lore Correct-31535-1-0.7z",
      "uploadedUnix": "1360685527",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f6d4aaf5628c7b944faa95d6743b20295c4c0b49784a3075864c98b27d0e06fd/analysis/1407412926/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bonds%20Country%20Cottage%20Lore%20Correct-31535-1-0.7z?fid=1000009239&ttl=1535807107&ri=8192&rs=8192&setec=aaf20630797430d67022f6f594943590"
    }
  ]
}