{
  "modId": 31545.0,
  "modName": "Darkness - Vanilla Lighting Tweaks",
  "summary": "This is a simple lighting mod for Skyrim with natural dark night weather and dark interior/dungeons. \r<br />The main purpose of this mod is to bring dark nights and interior for immersion and gameplay reasons but try to maintain vanilla lighting feel as much as possible.",
  "descriptionHtml": "[img]http://static1.nexusmods.com/15/mods/110/images/31545-1-1360697188.jpg[/img]\r<br />[size=3][b]Darkness - Vanilla Lighting Tweaks[/b][/size]\r<br />stl;nr: Natural dark nights weather with dark interior and dungeons with vanilla daytime weather (unmodded). Lights are bright in the dark.\r<br />tl;nr: Darker nights weather and interiors, lights are brighter in contrast (to vanilla) and light up surroundings. Try to stay true to Beth design, no color hue change or visual feature removal. It only darken environment and tone down fog max when appropriate. (Wider light range might result scenes with higher contrast and more saturation, but the values are unchanged.) Eye adaptation levels are unchanged, too. So low light does not equal utter darkness. No pitch black nights unless moonless, no muted black dungeons unless there&#39;s no light source. Recommend better visual by using mod which edits cells and world light sources fixing vanilla fake and unlit lights and objects with no shadow.\r<br />\r<br />[size=3][b]Description[/b][/size]\r<br />This is a simple lighting mod for Skyrim with dark night weather (inc. dusk and dawn) lighting and dark interior/dungeons environmental lighting. It only modifies vanilla weather and lighting records, no custom textures, lighting templates or weather patterns.\r<br />Its main purpose is to bring natural dark nights and interior for balanced immersion and gameplay, but maintain vanilla lighting feel as much as possible.\r<br />It&#39;s an immersion mod. There&#39;s no pitch black nights and dungeons, you can see the surroundings in low light and figures&#39; silhouettes shrouded in darkness if without light source. However, there are places with no light source in horrifying darkness, so torches or lanterns or nighteye are still needed. The guideline is to maintain lighting fidelity and immersion, and faithful to vanilla design as much as to my ability. It tries to balance gameplay and immersion. No mute dark surrounding without color, no night-blind person (no eye adaptation) wondering Skyrim, no wearing sunglasses (dim torch) in the middle of a night. It&#39;d be a shame to miss out so much scenery and details of Skyrim by muting everything for the sake of playing a harder game.\r<br />However, please bear in mind that this is still blind edits without extensive play-testing. (It&#39;s a huge world with tons of places and I&#39;m replaying through the whole thing. Be everyone, do everything, go every place in the mean time muck about the lighting as I go. :P) Call it beta if you will. The interiors lighting seems ok so far, but the weather needs more work. If there&#39;s any errors or bad tweaks during your playthrough, please feel free to leave a comment. Much appreciated.\r<br />\r<br />[size=3][b]Details[/b][/size]\r<br />The mod tweaks values in &#34;Image Space&#34;, &#34;Lighting Template&#34; and &#34;Weather&#34; fields. \r<br />In &#34;Lighting Template&#34; fields Lighting and Directional Ambient are lowered in half so as Fog Max. The former is self explanatory, lowered the lights in environments; the latter is to tone down the fog color so that the environment color becomes more dominant. Cells brightness depends on many factors, light source design, open sky or lacking there of. You won&#39;t see clearly as vanilla in the dark, but nothing is so pitch black so that you can&#39;t see your own hands. Lights are truly bright in contrast.\r<br />In &#34;Weather&#34; fields all nights color (lum) are lowered in half and with sky, fog and water color to match. dusk and dawn are adjusted to 75% of vanilla lum to improve light and dark transition. Fog Max lowered to 85%. The formers are to lower environment lighting and the fog max is the same as that in Lighting Template and to prevent &#34;wearing tinted glass&#34; effect. No white stream or fog in dark valleys and lights are shining brightly. Torches, bonfire are bright and aurora is really vibrant with just vanilla Skyrim.\r<br />In &#34;Image Space&#34; fields brightness and HDR white are lowered in half (night) and 75% (dusk and dawn) to match above edits, so as Sunlight Scale and Sky Scale in interiors to lower ambient light. This tones down the overall light value in nights and interiors environment, that makes lights brighter. Tint lowered to 85% so that light sources become more natural and less tinted but maintain environment overall tone and color as original designed. \r<br />Two methods are used in calculating color values: 1) RGB to HSL and lower lum, which only changes color luminosity; 2) RGB div by 2, which lower lum and desat. Both methods keep color hue unchanged and have the same lum lowered. In extreme cases (very bright color with high saturation), darker color saturation has to be lowered to better match the scene, in which cases method 2 are used.\r<br />Yes, I preserved fog to an extent because it soften the lights like torches and it enhances the atmosphere perspective to show depth of the environment. See preview images of many dungeons (Bleakfalls Barrow) and interiors (Breezehome) and you will notice the blueish green in further back areas. They create illusion of atmospheric perspective (higher contrast and warmer at foreground while lower contrast and colder at background in this instance). It&#39;d be so dull and empty without fog to balancing out the color contrast between near and far, and it&#39;d be all too browny. If Blackreach had no fog, it would destroy the whole atmosphere.\r<br />\r<br />[size=3][b]Compatibilities[/b][/size]\r<br />Vanilla Skyrim has many fake lights and light objects without real lights and some objects don&#39;t have shadows. So using a mod to change all those lights are highly recommended to be installed with this mod. For details please referring to Relighting Skyrim and ELFX pages. Actually that&#39;s half the reason for me to create this mod.\r<br />[url=http://www.nexusmods.com/skyrim/mods/17609/]Relighting Skyrim[/url] - Fully compatible and highly recommended. RS only edits world and cells&#39; light source (bonfires, candles, torches, etc), Darkness edits environment lighting (night weather and interior/dungeons&#39; ambient, fog etc). RS merged in USKP changes and included Hearthfire home lights, too. And they stay true to vanilla design. It&#39;s a really great mod which deserves more appreciation. I&#39;m mainly using RS for the playthrough and screenshots. Loading order doesn&#39;t matter, either before or after it (no conflicting records).\r<br />[url=http://enbseries.enbdev.com/forum/viewtopic.php?f=6&t=1499]Skyrim particle patch for ENB[/url] - Fully compatible and highly recommended. Fixes vanilla mesh shader or blending properties. I&#39;m not using ENB, but many objects lighting have been fixed, noticeable in darker environment (i.e. mushrooms in Blackreach). I&#39;m using this with Relighting Skyrim. You don&#39;t need it if using ELFX (it&#39;s been fixed in ELFX). If it conflicts with other mods (i.e. W.A.T.E.R.) select &#34;no to mod&#34; (do not overwrite). It&#39;s probably they&#39;ve incorporated it or modified the same mesh.\r<br />[url=http://www.nexusmods.com/skyrim/mods/27043]Enhanced Lights and FX[/url] - Highly recommended. ELFX edits cells&#39; light sources (and more&#33;) with main mod and edits interior/dungeon environments with ELFX Enhancer. DLC patches includes world, cells and weather edits, too. Compatible if placing this mod before ELFX, you get dark nights with my mod and &#34;ELFX Enhancer&#34; and DLC patches overrides interiors/dungeons and other places (//SPOILERS Soul Cairn, Sovngarde, etc SPOILERS//). This way is full ELFX and Darkness&#39; dark nights weather edits. Or you could place this mod after ELFX for Darkness&#39; interior lighting to override ELFX changes. Cells and worldspace edits of ELFX&#39;s light sources, shadows are all preserved without problem. The light radius in ELFX is slightly larger than vanilla, also there are fewer lights in dungeons than vanilla and Relighting Skyrim.\r<br />(If those two mods were recordings, RS was &#34;Remaster&#34; while ELFX was &#34;Remix&#34;. Got my drift? :P)\r<br />[url=http://www.nexusmods.com/skyrim/mods/30450]Realistic Lighting Overhaul[/url] - Not compatible. You don&#39;t need to use Darkness if you like RLO style. They covered everything regarding lighting in Skyrim. If you insist on having both (although I don&#39;t see the point), placing this mod before RLO will result this mod has no effect what so ever, because RLO pretty much overrides everything. And if placing my mod after RLO, my mod will overrides its. Just like with ELFX above.\r<br />[url=http://www.nexusmods.com/skyrim/mods/17802]Climates of Tamriel[/url] - Not compatible, I guess. CoT introduced many new weather and I&#39;m not sure if placing my mod after its will have any effect on the &#34;dark night&#34; front of things. Interiors might work though.\r<br />[url=http://www.nexusmods.com/skyrim/mods/1875]Realistic Lighting and Real Nights[/url] - Not compatible, I guess. Haven&#39;t tried this mod for a long time since they used an installer. Honestly I don&#39;t know. Since they pretty much covers every aspects of lighting much like RLO, you probably don&#39;t want to add my mod to the mix anyways. They very possibly would conflict and override each other.\r<br />\r<br />[size=3][b]Installation[/b][/size]\r<br />Use NMM or manually extract following files to Data folder in Skyrim game folder and activate in Data in the game launcher.\r<br />&#34;Darkness - Vanilla Lighting Tweaks.esp&#34; (Original Skyrim and Dawnguard, Dragonborn DLC tweaks all included. DG/DB DLCs are both required or you&#39;ll get a CTD on launch&#33;)\r<br />&#34;Darkness - Skyrim.esp&#34; (Original Skyrim use this, no DLCs required.)\r<br />&#34;Darkness - Dawnguard.esp&#34; (Load after &#34;Darkness - Skyrim.esp&#34; if you only have Dawnguard.)\r<br />&#34;Darkness - Dragonborn.esp&#34; (Load after &#34;Darkness - Skyrim.esp&#34; if you only have Dragonborn.)\r<br />Note: Hearthfire has no lighting resources added to the main game. It uses vanilla Skyrim resources, so no patch required.\r<br />\r<br />To update simply overwrite with new files, no extra saves required.\r<br />\r<br />To uninstall simply remove those esps. And it&#39;s safe to do so without damaging existing character save. It&#39;s a simple game records editing mod without script. (I&#39;m not a script monkey, no ssssuch tttalenttt)\r<br />However if you just want a peak, I recommend &#34;coc bleakfallsbarrow01&#34; in the console to see the effects before you venturing further with your character save. Removing mods in the middle of a gaming session usually is not a good practice for modding Skyrim. \r<br />\r<br />[size=3][b]Known Issues[/b][/size]\r<br />Water splash might look too bright from close distance, I&#39;m not sure how to fix it. It might be in mesh particle settings, I guess.\r<br />Fog clipping might occur if brighter fog on very dark ground or walls. You may or may not notice it, depends on different monitor settings or game brightness contrast, gamma settings. It&#39;s caused by my color settings are not adjusted very well between ambient lighting and fog. If drastic clipping are noticed, please let me know and I&#39;d try to fix it.\r<br />\r<br />[size=3][b]Tools and Settings[/b][/size]\r<br />TES5Edit only. Seriously, it&#39;s just couple records editing like making a patch for a mod. &#34;Copy as override&#34; from the original records and make your changes. No need to wield a warhammer of a tool like CK. And it&#39;s really easier to do multiple versions than with CK.\r<br />PhotoFiltre7 resize, text, format conversion and layering for some comparison shots.\r<br />Stock ini on High setting with fxaa, 0-aa 8-af, light fade 25 and object detail fade, no HD texture (old rig) for the previewing screenshots taken.\r<br /> \r<br />[size=3][b]Mods used (Visual)[/b][/size]\r<br />Better Dynamic Snow\r<br />W.A.T.E.R.\r<br />Real Ice\r<br />Skyrim particle patch for ENB (not using ENB)\r<br />Enhanced Lights and FX (see notes on pic)\r<br />Relighting Skyrim (see notes on pic)\r<br />\r<br />[size=3][b]Fus Ro Dah&#33;[/b][/size]\r<br />Check my other mod if you are interested. \r<br />[url=http://www.nexusmods.com/skyrim/mods/50129]Elemental Binding - Bound Weapons Enhancement[/url] - This mod adds bound weapons&#39; damage scaling at higher lvl and additional elemental damage toning to summoned creatures with proper perks purchased. It only modifies one vanilla perk (Mystic Binding) and bound weapons&#39; object effect to function fully for better compatibility with other magic mods.",
  "categoryId": "78",
  "version": "0.3.1",
  "author": "curt",
  "createdUnix": "1360703498",
  "updatedUnix": "1390065651",
  "containsAdultContent": false,
  "uploadedBy": "0b1ivion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091570",
      "name": "Darkness - Dawnguard",
      "version": "0.2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Darkness - Dawnguard-31545-0-2-2.zip",
      "uploadedUnix": "1389770516",
      "modVersion": "0.2.2",
      "virusScanUrl": "https://www.virustotal.com/file/6dbfb24fcd6d1094566de79ea21e997c790bc1e338fba145087c286bf7c1c270/analysis/1407886649/",
      "changelogHtml": " Fixed color in weather Effect lighting fields SkyrimOvercastRain(S) SkyrimStormSnow(S). Thanks Gruftlord.\r<br />Adjusted Lighting Template fog far colors (desat). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkness%20-%20Dawnguard-31545-0-2-2.zip?fid=1000091570&ttl=1535807124&ri=8192&rs=8192&setec=4f2db5f96cdb84a2d13d33ade5397d62"
    },
    {
      "fileId": "1000091571",
      "name": "Darkness - Dragonborn",
      "version": "0.2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Darkness - Dragonborn-31545-0-2-2.zip",
      "uploadedUnix": "1389770558",
      "modVersion": "0.2.2",
      "virusScanUrl": "https://www.virustotal.com/file/1a95c69d1082783a961995f6526368f19a31e0c808e00cf9aeb339a1ad0c89c8/analysis/1407886650/",
      "changelogHtml": " Fixed color in weather Effect lighting fields SkyrimOvercastRain(S) SkyrimStormSnow(S). Thanks Gruftlord.\r<br />Adjusted Lighting Template fog far colors (desat). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkness%20-%20Dragonborn-31545-0-2-2.zip?fid=1000091571&ttl=1535807125&ri=8192&rs=8192&setec=cd02d08b8cae4df8faaf768ab64a7d9c"
    },
    {
      "fileId": "1000091626",
      "name": "Darkness - Vanilla Lighting Tweaks",
      "version": "0.2.2a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38",
      "fileName": "Darkness - Vanilla Lighting Tweaks-31545-0-2-2a.zip",
      "uploadedUnix": "1389802820",
      "modVersion": "0.2.2a",
      "virusScanUrl": "https://www.virustotal.com/file/b183891d9c1e61b9de08ccf307697d1ea4f11a8437d971171125dbd465c7d10e/analysis/1407887081/",
      "changelogHtml": " A quick update adding missing DefaultImageSpace(S). I thought it was not used in actual game cells but just a template, guess I was wrong. It affects at least Redbellymines. No DLC patches change. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkness%20-%20Vanilla%20Lighting%20Tweaks-31545-0-2-2a.zip?fid=1000091626&ttl=1535807126&ri=8192&rs=8192&setec=9fb49f9e9af1619887c2a8035ab1bc3c"
    },
    {
      "fileId": "1000091627",
      "name": "Darkness - Skyrim",
      "version": "0.2.2a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "31",
      "fileName": "Darkness - Skyrim-31545-0-2-2a.zip",
      "uploadedUnix": "1389802872",
      "modVersion": "0.2.2a",
      "virusScanUrl": "https://www.virustotal.com/file/8c4b4ec1626aabf90993fdcdc3ffbda5236ded8778edf79e6fa08972558228f5/analysis/1407887081/",
      "changelogHtml": " A quick update adding missing DefaultImageSpace(S). I thought it was not used in actual game cells but just a template, guess I was wrong. It affects at least Redbellymines. No DLC patches change. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkness%20-%20Skyrim-31545-0-2-2a.zip?fid=1000091627&ttl=1535807126&ri=8192&rs=8192&setec=a6fbf45634f5bb88b43dfe0e4bc66e82"
    },
    {
      "fileId": "1000092014",
      "name": "Darkness - Dawnguard",
      "version": "0.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "Darkness - Dawnguard-31545-0-3.zip",
      "uploadedUnix": "1390046486",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/79997e6fa06490590636bb2445754d44a5e757d756eb8bad3538f8ef820b51dd/analysis/1407891125/",
      "changelogHtml": " Added Dawn and Dusk weathers adjustment so that the light and dark transition is more smooth and gradual. It includes Imagespace and Weather records. Now it&#39;s feature complete, so a revision change is in order.\r<br />Corrected some errors in weather edits from BloatedMansGrottoFog and SkyrimOvercastRainVT. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkness%20-%20Dawnguard-31545-0-3.zip?fid=1000092014&ttl=1535807126&ri=8192&rs=8192&setec=dd5641a1a68f8b403502777d4fcfba51"
    },
    {
      "fileId": "1000092015",
      "name": "Darkness - Dragonborn",
      "version": "0.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Darkness - Dragonborn-31545-0-3.zip",
      "uploadedUnix": "1390046632",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/f73abd89ffc3d9cc6d9bfdc5bca10abf4d4f8192ee54610eb84acca05cf6da74/analysis/1407891126/",
      "changelogHtml": " Added Dawn and Dusk weathers adjustment so that the light and dark transition is more smooth and gradual. It includes Imagespace and Weather records. Now it&#39;s feature complete, so a revision change is in order.\r<br />Corrected some errors in weather edits from BloatedMansGrottoFog and SkyrimOvercastRainVT. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkness%20-%20Dragonborn-31545-0-3.zip?fid=1000092015&ttl=1535807127&ri=8192&rs=8192&setec=8a85d55ff6fe596df1dd3be9b23ddfa2"
    },
    {
      "fileId": "1000092046",
      "name": "Darkness - Skyrim",
      "version": "0.3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "Darkness - Skyrim-31545-0-3-1.zip",
      "uploadedUnix": "1390065587",
      "modVersion": "0.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/123b163b57f6ca6e15d8a16271341be93021bfe32a69e85b4c2693c219e6b7de/analysis/1407891336/",
      "changelogHtml": " Fixed 2 Imagespace errors reported by TES5Edit. AbandonedShackImagespace(S) HighHrothGarImagespace(S). Thanks again Gruftlord. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkness%20-%20Skyrim-31545-0-3-1.zip?fid=1000092046&ttl=1535807127&ri=8192&rs=8192&setec=e251574e31f38d7e11b554d45edc0f1c"
    },
    {
      "fileId": "1000092047",
      "name": "Darkness - Vanilla Lighting Tweaks",
      "version": "0.3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "42",
      "fileName": "Darkness - Vanilla Lighting Tweaks-31545-0-3-1.zip",
      "uploadedUnix": "1390065651",
      "modVersion": "0.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/effc0bac556887e628be08f838ae14bf9f4d85294fd13f90b94ec171378f7d43/analysis/1407891337/",
      "changelogHtml": " Fixed 2 Imagespace errors reported by TES5Edit. AbandonedShackImagespace(S) HighHrothGarImagespace(S). Thanks again Gruftlord. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkness%20-%20Vanilla%20Lighting%20Tweaks-31545-0-3-1.zip?fid=1000092047&ttl=1535807128&ri=8192&rs=8192&setec=71f0b8a1c69a711f21d68ad31ab22a1b"
    }
  ]
}