{
  "modId": 31548.0,
  "modName": "Hotspring Hideout - REBORN",
  "summary": "Underground cave player home",
  "descriptionHtml": "[img] http://static.skyrim.nexusmods.com/mods/images/25369-1-1350021946.jpg [/img]\r\n\r\nI\\'d like to start out by thanking Foaman, a nexus member who took it upon him self to help fix up the broken files that prevented me from working on this project for so long. \r\n\r\n\r\n[color=#ffc9e6c8][size=15]-Changelog-[/size][/color]\r\nV2.5\r\nA-> Remodeled the entrance to the hideout (PN)\r\nB-> Remade the alchemy area, it now has it\\'s own room (PN)\r\nD-> Added planet life to the hideout (PN)\r\nC-> Remodeled the kitchen and follower quarters (PN)\r\nE-> Remodeled the walls of the master bedroom and study (PN)\r\nF-> Remodeled the smithing area (PN)\r\nG-> Fixed a few clipping issues (if you find others, report them) (FM)\r\nH-> Added Dwemer respawning chests called Trash*, which you should use to get rid of any crap you don\\'t want, read the note inside them (FM)\r\nI-> Fixed the kitchen containers, they should no longer fly away on their own, just DO NOT PRESS HOLD to access them (FM)\r\nSpecial thanks to [url=http://skyrim.nexusmods.com/users/647612]gentester[/url] for helping us out with the food containers\r\n\r\nTo upgrade from v2.1 to v2.5\r\n1- Clean out the hideout, take EVERYTHING you have stored inside including your followers \r\n2- Get out of the hideout, travel to Riverwood or anywhere away from the hideout\r\n3- Save in a new slot and exit the game\r\n4- Uninstall v2.1\r\n5- Enter the game, load your last save and click yes on the warning\r\n6- Make a new save in a new slot and Exit the game\r\n7- Install v2.5\r\n8- Enter the game, go back to the hideout and enjoy the changes, feedback is always welcome! \r\n------------------------------------\r\n\r\nV2.1\r\nA-> Fixed some weapon racks in the secret room that didn\\'t work correctly (FM)\r\nB-> Added several specialized containers in the kitchen, nothing fancy yet tho (FM)\r\nC-> Added several strongboxes around the hideout (FM)\r\nD-> Removed the ingredient/potion/poison containers next/under the alchemy station and replaced them with a shelf and several better looking specialized potion containers (FM)\r\nE-> Fixed a few clipping issues (FM)\r\n\r\nTo upgrade from v2.0 to v2.1\r\n1- Take all your potions and ingredients from the containers near the alchemy stations\r\n2- Take your weapons from the weapons racks on the left side of the secret room\r\n3- Take anything you stored in the kitchen\r\n4- Exit the hideout and save the game\r\n5- Uninstall v2.0 and install v2.1 (DO NOT PERFORM A CLEAN SAVE, just uninstall and install after step 4)\r\n6- Launch the game, enter the hideout and enjoy the changes\r\n\r\n------------------------------------\r\nV2.0\r\nA-> Removed the cause of the crashes that occurred in v1.0 (FM)\r\nB-> Fixed several issues with the book shelves, they should all work normally now, your books will never fly off the book shelves (FM)\r\nC-> Removed the doors from the bookshelves because they were causing some nasty looking clipping at the bottom (FM)\r\nD-> Changed several lighting sources for better performance (FM)\r\nE-> Removed the non functioning \\\"teleporter\\\" activator ball and replaced it with a static 1 (FM)\r\nF-> Got rid if the faulty potion chest under the alchemy table because of a problem with it\\'s mesh, replaced it with a different 1 (FM)\r\nG-> Changed the acoustic sound of the cave (it\\'s right under a lively forest so it should reflect that) (FM)\r\nH-> Made the entrance sun-ray reflect the actual time outside of the cave so now it will get dimmed during the night and you will be able to see the the sky outside through the hole in the ceiling (FM)\r\nI-> Fixed how some dragonflies spawned under water in the pond (FM)\r\nJ-> Added a few bugs in more appropriate locations (FM)\r\nK-> Added some idle markers for your followers to use, there were non before (FM)\r\nL-> Removed several hidden things that caused unnecessary errors in CK (FM)\r\nM->Fixed several clipping issues I found but I\\'m sure there is more that I didn\\'t see, if you do, report them to us (FM)\r\nN-> Removed a couple of steams and repositioned others for better performance (FM)\r\nO-> Removed and tweaked several FX effects that caused huge drops in FPS in certain locations inside the hideout (FM)\r\n\r\nTo upgrade to v2.0\r\n1- Take all your items and followers you stored inside and go outside of the hideout then save\r\n2- Uninstall v1.0\r\n3- Load the game and load your last save, click yes on the warning then make a new save\r\n4- Exit the game\r\n5- Install v2.0\r\n6- Load your last save and enjoy the fixes/changes \r\n\r\n\r\n[color=#ffc9e6c8][size=15]-DESCRIPTION-[/size][/color]\r\nThis is a repost The Hotspring Hideout, an underground cave hideout for the Dovahkiin and his/her followers with a unique style that lends its self to all types of characters, good evil and everything in between. The original mods blew up into several cells most of which involved very long load screens. The Grotto Edition is reduced everything down to one cell. As such there’s still a considerable load time what with all the content crammed into one cell. The house is navmeshed but not culled with room markers, portals and such. The home is lore friendly (in so far as I can tell) and hidden just of the road that runs along the south coast of Lake Ilinata in Falkreath. There’s a small garden around the entrance that features a few plants and bugs plus more plants in planters inside at the alchemy station. There’s a large pond in the center of the cave with a variety of fish for cooking and alchemy. For a complete list of features scroll down to the FEATURES section. \r\n\r\nSince the last posting I\\'ve shuffled the clutter/movable statics a tad and with the help of Foaman removed the requirements for DLC. I\\'ve also opted for a brighter lighting template which allowed me to remove a large number of light sources. Additionally I removed the malfunctioning book case above the enchanting table and replaced it with a static. All this should result in improved performance.\r\n\r\n\r\n[color=#ffc9e6c8][size=15]-LOCATION-[/size][/color]\r\nFalkreath - Along the south coast of Lake Ilinata across the road from the lake\r\n[img] http://static.skyrim.nexusmods.com/mods/images/25369-1-1350021625.jpg [/img]\r\n\r\n[color=#ffc9e6c8][size=15]-FEATURES-[/size][/color]\r\n-Tree stump entrance\r\n-Small alchemy garden\r\n-Small cave dwelling misdirect with a hidden cave door. [spoiler]The switch is in the skeleton’s rib cage[/spoiler].\r\n-Second story main entrance with an alchemy station featuring storage for potions, poisons and ingredients as well as some plants in planters\r\n -Candle lit spiral staircase\r\n-First floor with pond including several types of fish, seating area and shrines to seven of the nine gods, kitchen cooking stations and storage, guest house which beds ten followers and a common privy, smithy with crafting stations and storage and 1 shrine\r\n-The Hotspring with a custom sofa sort of thing and recreation area (idle stations for sandbox)\r\n-Bedroom for Dovahkiin which features a closet, private privy and one shrine\r\n-Study with enchanting station, storage, bookshelves (more than 187 books total) and hidden entrance to the treasury (key is on the Mammoth Skull Desk)\r\n-Treasury with ten mannequins, lots of weapon racks, storage, some more bookshelves\r\n\r\n[color=#ffc9e6c8][size=15]-RECOMMENDED MODS-[/size][/color]\r\n\r\n      To get your followers/spouses to live in the hide out…\r\n[url=http://skyrim.nexusmods.com/mods/18045]My Home Is Your Home[/url] \r\n[url=http://skyrim.nexusmods.com/mods/11370]Spouses Can Live Everywhere[/url]\r\n\r\n      For female mannequinnes…\r\n[url=http://skyrim.nexusmods.com/mods/9131]Female Mannequines[/url]\r\n\r\n[color=#ffc9e6c8][size=15]-MODDERS’ RESOURCES USED-[/size][/color]\r\n[url=http://skyrim.nexusmods.com/mods/16525]Modder’s Resource Pack[/url] \r\n[url=http://skyrim.nexusmods.com/mods/11618]Weapon Racks-Bookshelves-Plaques-Mannequins[/url] \r\n[url=http://skyrim.nexusmods.com/mods/14134]OpenBooks Resource[/url]\r\n[url=http://skyrim.nexusmods.com/mods/14133]FoodContainer Resource[/url] \r\n[url=http://tesalliance.org/forums/index.php?/files/file/1182-soap-resource]Soap Resource[/url] ",
  "categoryId": "67",
  "version": "2.5",
  "author": "PrimeNavigator and Foaman",
  "createdUnix": "1360698412",
  "updatedUnix": "1361607619",
  "containsAdultContent": false,
  "uploadedBy": "PrimeNavigator",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000009974",
      "name": "Hotspring Hideout v2-0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4936",
      "fileName": "Hotspring Hideout v2-0-31548-2-0.7z",
      "uploadedUnix": "1360901982",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/b68a0c4fffd4eab94c81754b6a72efc2252308e6dcc1b4c7253091bc96a82be3/analysis/1407418342/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hotspring%20Hideout%20v2-0-31548-2-0.7z?fid=1000009974&ttl=1535807136&ri=8192&rs=8192&setec=713dea88444b5f894c515c864f828def"
    },
    {
      "fileId": "1000010527",
      "name": "Hotspring Hideout v2-1",
      "version": "2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5217",
      "fileName": "Hotspring Hideout v2-1-31548-2-1.7z",
      "uploadedUnix": "1361087704",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/f81ce7a74d23039d859576c2df178edd49315adab43c62dc5f6b9b9ae7586eb7/analysis/1407422161/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hotspring%20Hideout%20v2-1-31548-2-1.7z?fid=1000010527&ttl=1535807136&ri=8192&rs=8192&setec=8c1bacd34894109a04aa0bb072384645"
    },
    {
      "fileId": "1000012347",
      "name": "Hotspring Hideout v2-5",
      "version": "2.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7114",
      "fileName": "Hotspring Hideout v2-5-31548-2-5.7z",
      "uploadedUnix": "1361607619",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/184783670e715ec379f0e1f2550105b9704ef5034caa0a12912630663ee787c2/analysis/1407434478/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hotspring%20Hideout%20v2-5-31548-2-5.7z?fid=1000012347&ttl=1535807137&ri=8192&rs=8192&setec=014dfaf4c67e62902cf3e49bba74bf97"
    }
  ]
}