{
  "modId": 31556.0,
  "modName": "Mage backpack - deutsch",
  "summary": "Dies ist die deutsche Uebersetzung vom &#34;Mage Backpack&#34;-Mod.",
  "descriptionHtml": "[center]---[This is merely a translation of the Mod made from TumbaJamba and DVAted into German language. You need to download the original mod in order to use this translation.]---[/center]\r<br />\r<br />\r<br />\r<br />Ein jeder Magier träumt davon, mindestens genauso viel tragen zu können, wie ein Krieger und noch dazu den perfekten Schutz vor Magie zu besitzen. Diesem Wunsch nimmt sich dieser Mod nun an, indem er dem Spiel den mächtigen Magierrucksack hinzufügt. Doch Vorsicht - um diesen herstellen zu können, wird eine ganz besondere Zutat benötigt, die nur unter großer Gefahr und mit viel Aufwand zu finden ist. Wird es Euch möglich sein, diese zu erhaschen? Oder werdet auch Ihr auf der Suche nach diesem einzigartigen, magischen Gegenstand mit Eurem Leben bezahlen?\r<br />Findet es heraus und begebt Euch auf ein Abenteuer, das einem wahren Erzmagier würdig ist.\r<br />\r<br />\r<br />\r<br />Um diesen Mod zu benutzen, wird der original &#34;Mage Backpack&#34;-Mod von TumbaJamba und DVAted benötigt. Meine Leistung war lediglich, ihn ins deutsche zu übersetzen.\r<br />\r<br />[b][u]Zu erhalten ist der ursprüngliche Mod hier:[/u][/b]\r<br />[url=http://skyrim.nexusmods.com/mods/31191/]http://skyrim.nexusmods.com/mods/31191[/url]\r<br />\r<br />-\r<br />\r<br />[b]Installation:[/b]\r<br />1.) Installiert zunächst den &#34;Mage Backpack&#34;-Mod von TumbaJamba und DVAted nach den dort gegebenen Anweisungen.\r<br />2.) Überschreibt dann die installierten Dateien, mit der in diesem Mod vorhandenen Datei und ersetzt die entsprechenden .esp-Datei.\r<br />3.) Den Mod aktivieren und Spaß haben :-)\r<br />\r<br />\r<br />-\r<br />\r<br />\r<br />[b]Anmerkung:[/b]\r<br />Wie bei allen Text-Mods war die Übersetzung knifflig. Ich habe mit viel Sorgfalt und Mühe daran gearbeitet, die Übersetzung so qualitativ hochwertig, wie nur möglich zu machen. Sollten dennoch unvorhergesehen irgendwo Fehler auftauchen, oder ich vielleicht noch etwas übersehen haben, dann teilt es mir bitte hier auf Skyrim-Nexus mit.\r<br />\r<br />\r<br />\r<br />[b][b][size=3][color=orange]Abschließend möchte ich hier Werbung für meine neuste Übersetzung machen, nämlich für den wahnsinnig spannenden Mod &#34;[url=http://www.nexusmods.com/skyrim/mods/64283/?]Immersive Jewelry[/url]&#34;, den ich [url=http://www.nexusmods.com/skyrim/mods/66774/?]hier[/url] übersetzt habe.[/color][/size][/b][/b]\r<br />\r<br />\r<br />\r<br />Credits gehen insbesondere an TumbaJamba und DVAted für ihren interessanten Mod, sowie an alle anderen, die ansonsten an diesem Mod beteiligt waren.\r<br />\r<br />\r<br />[b]Bei weiteren Fragen, oder wenn ihr diese Mod mögt, hinterlasst mir doch einen Kommentar. Sollte euch meine Übersetzung gefallen, so klickt doch bitte einmal auf &#34;endorse me&#34;. Vergesst auch nicht, TumbaJamba und DVAted zu belohnen.\r<br />Viel Spaß&#33;[/b]",
  "categoryId": "60",
  "version": "1.0",
  "author": "TumbaJamba und DVAted und Verodor",
  "createdUnix": "1360767875",
  "updatedUnix": "1360704270",
  "containsAdultContent": false,
  "uploadedBy": "Verodor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000009325",
      "name": "Mage Backpack - deutsch",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Mage Backpack - deutsch-31556-1-0.rar",
      "uploadedUnix": "1360704270",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bf512602ada7c18b03e2d675d4f40de6b19cdf387c627115371a97bdf8861aa8/analysis/1407413478/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mage%20Backpack%20-%20deutsch-31556-1-0.rar?fid=1000009325&ttl=1535807149&ri=8192&rs=8192&setec=76e019102f2f6e3fb18386de8cb9e976"
    }
  ]
}