{
  "modId": 31604.0,
  "modName": "werewolf and vampirelord quest mod now with new config menu",
  "summary": "This is a vampirelord and werewolf quest mod with up gradable conjuration spells and a training area to test out your new spells. [color=red] now with new configuration menu. [/color] ",
  "descriptionHtml": "                           [size=7] [color=gold] Mrwoodys vampirelord and werewolf quest mod \r\n                                                    Download the trailer now [/size] [/color]          \r\n\r\n\r\n[img] http://assets2.ignimgs.com/2012/05/17/wallpaper-ipad-skyrim-8png-8cda68.png [/img]\r\n\r\n [color=red] WARNING PLZ READ FIRST !!!\r\nBefore you ask ravenger at the crypt PLZ SAVE AND RELOAD FOR THE DIALOGUE TO WORK, if this is not done the dialogue wont run. Also this DOES REQUIRE YOU TO HAVE THE DAWNGUARD DLC. [/color]\r\n\r\n[color=orange] CAUTION \r\nThe version i will be releasing on friday/saturday will \\\"NOT BE\\\" the final release of this mod its only at its beta stage. This version will only have 95% completion of the first dungeon and only 35% of the second, but everything else is done up to completion except for the dialogue and a few more adjustments needed. [/color]  \r\n\r\n  [color=green] ABOUT THIS MOD [/color] \r\n\r\n[color=green] In this mod that i am currently working on and is unfinished adds a guy called ravenger to a custom made crypt that i have created that gives you two quests to go and fetch something to create a a new summon spell called conjure werewolf and conjure vampirelord.when the quest has been completed for each one then ravenger will add to your iventory conjure werewolf or conjure vampire lord,but whats special about my mod is that there is an upgrade system that ive added for a certain amount of gold for the player so when you upgrade each time you will get a new werewolf/ vampirelord spell that enhances and makes them better stronger and potentially bigger. [/color]\r\n\r\n\r\nTRAINING AREA\r\nThis is is a pratice room for the player to test out the new summons on enemies that ive added as spells for the player to see how well they fight off against different enemies so when they do decide to go against the enemy what kind of tatic you will use against them. \r\n\r\n\r\n\r\n[img] http://skyrim.nexusmods.com/mods/images/31604-1-1363432509.png [/img]\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[color=orange] ////// CONFIGURATION MENU //////   \r\n\r\nThe recent new update adds a config menu that basically adds multiple different options including:\r\nadd all enemies = adds all the enemies to your character to test against with your new conjuration spells or any spell or weapon you may decide to use for that mater. remove all enemies = removes all the enemies from you character to give yourself more room and make it easier to find things when you leave the training area. add all spells = preferably this is used for the end of the quest when you have accomplished everything,and have all the spells(this will make more sense when you read on) or you can use this to have all the spells when your doing the quest (don\\'t really see the point of doing that but its your choice what you do). remove all enemies = this basically has the same goal as the remove all enemies when you want the spells you add them but when you don\\'t want them and are taking up to much room and is harder to find things. spell modifications = \r\nWith this witch i have recently just added adds cheats to the spells and when you modify the spells \r\nit gives you an overpowered werewolf or vampirelord and replaces the last upgrade you purchased.   \r\n[/color]\r\n\r\n\r\n[img] http://skyrim.nexusmods.com/mods/images/31604-1-1363434673.png [/img]\r\n\r\n                  [color=yellow] PERK \r\nWith this mod you also quire a perk witch helps others witch are a lower level or dont realy use conjuration spells. its a 4 upgradeable perk that alows the player to cast both the conjure vampirelord and the conjure werewolf at a lower cost of magica. [/color]\r\n\r\n\r\n\r\n\r\n\r\n/////DRAGONBORN DLC/////\r\nthis is something that i am working on at the moment and will be released sometime after the first release. \r\n\r\n\r\n\r\n\r\nTHANKS FOR CHECKING OUT THIS PAGE AND SORRY I HAVE NOT RELEASED IT YET \r\n\r\n[color=violet] PLANS FOR THE FUTURE \r\nFor the future of this mod i am going to allow this mod to have key detection to open the menu\\'s \r\nwith a simple key press like v or n, witch will require you to have the latest version of SKSE (skyrim script extender). [/color]\r\n\r\n[img] http://skyrim.nexusmods.com/mods/images/31604-1-1363728369.png [/img]\r\n\r\n\r\n[color=gold] UPDATE 2.5 FULL VERSION \r\nWith this new update i have shifted the mod configuration menu over to a ring. So now you dont have to keep going back and fourth in and out of the menu, you can hot key it to a number on your keyboard. [/color]\r\n\r\n\r\n\r\nVERSION 1,2 AND 2.5 (FULL VERSION OF THE MOD) WILL BE RELEASED AS ONE ON 5/4/13\r\n\r\n\r\nREAD PLEASE \r\n\r\n[color=dark blue] NO BETA RELEASE \r\nSo i have recently decided not to release a beta version of this mod as i see no point in releasing beta version then playing through it and then having the full release over write the beta and having to redo the whole quest again. [/color]\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "93",
  "version": "2.5",
  "author": "mrwoody",
  "createdUnix": "1360785989",
  "updatedUnix": "1360785848",
  "containsAdultContent": false,
  "uploadedBy": "mrwoody",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000009568",
      "name": "TRAILER",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "38524",
      "fileName": "TRAILER-31604-1-0.rar",
      "uploadedUnix": "1360785848",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3a5421ffcf88ea9ea6f3a94476e558f07472046c00ff0ed090542de6aa8a7567/analysis/1407415714/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TRAILER-31604-1-0.rar?fid=1000009568&ttl=1535807224&ri=8192&rs=8192&setec=654e712741f31fa161b686aa9d065e10"
    }
  ]
}