{
  "modId": 31603.0,
  "modName": "Stalhrim Heavy Shield",
  "summary": "Adds a Stalhrim Heavy Shield to the Dragonborn expansion to go with the Stalhrim Heavy Armor set.",
  "descriptionHtml": "1.1: Corrected an error in the info.txt file in the fomod folder in the zipped file. This caused NMM to throw out an error when attempting to add the mod.\r\n\r\nWARNING: Contains spoilers for the Dragonborn DLC.\r\n\r\n\r\n\r\nOne thing that irked me about unlocking Stalhrim smithing in the Dragonborn DLC was that even though there was both heavy and light Stalhrim armor, there\\'s only a light version of the shield. As such, I have made a heavy version that can both be crafted (has the same requirements of all other Stalhrim armor; must have the ebony smithing perk and unlock stalhrim smithing) as well as added to appropriate leveled lists so there\\'s a chance you may find it on enemies or for sale at one of Solstheim\\'s blacksmiths.\r\n\r\nFor now, this is simply a copy of the Light Stalhrim Shield with modified stats and set to heavy armor, as I have no 3D modeling skills. If any 3D artists out there want to take this plugin and run with it, all I ask is that you credit me for my work on the plugin.\r\n\r\nManual installation: Just simply unpack Stalhrim Heavy Shield.esp into you skyrim/Data folder.\r\nNMM Installation: Click the Download with Manager link and activate the mod through NMM.",
  "categoryId": "54",
  "version": "1.1",
  "author": "Ritaku",
  "createdUnix": "1360784252",
  "updatedUnix": "1360785057",
  "containsAdultContent": false,
  "uploadedBy": "Ritaku",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000009564",
      "name": "Stalhrim Heavy Shield",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Stalhrim Heavy Shield-31603-1-1.7z",
      "uploadedUnix": "1360785057",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ad23bd4eb710dd8e2c3430866d34e84e869fbadf468e6355207071b9f5be3f76/analysis/1407415697/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stalhrim%20Heavy%20Shield-31603-1-1.7z?fid=1000009564&ttl=1535807223&ri=8192&rs=8192&setec=1b79deec17b626a1892b66f967160b27"
    }
  ]
}