{
  "modId": 31615.0,
  "modName": "Triple Souls Plus Summoned Host Spells",
  "summary": "The Conjuration perk \"Twin Souls\" is now \"Triple Souls\" and allows three simultaneous summons. Three new Master-level Conjuration spells are added: Conjure Elemental Host, Conjure Storm Host and Conjure Dremora Host.",
  "descriptionHtml": "[[url=https://www.nexusmods.com/skyrim/articles/51469]There will be no SE port of this mod. Read here for more information[/url]]\n<br />\n<br />Triple Souls Plus Summoned Host Spells\n<br />\n<br />What It Does:\n<br />The Conjuration perk \"Twin Souls\" is now \"Triple Souls\" and allows three simultaneous summons. If you are installing to a game where you have already taken \"Twin Souls,\" it is automagically converted into \"Triple Souls.\" \n<br />\n<br />Three new Master-level Conjuration spells are added: Conjure Elemental Host, Conjure Storm Host and Conjure Dremora Host.\n<br />\n<br />Conjure Storm and Dremora Host summons three Storm Atronachs or Dremora Lords. Conjure Elemental Host conjures one Flame, one Frost and one Storm Atronach. If you have the Elemental Potency perk, the Potent version of Atronachs are summoned.\n<br />\n<br />These spells are all available from Phinis Gestor, immediately after completing the Conjuration Ritual Spell quest. The Master Conjuration perk reduces magicka cost (and that cost is really high). The Triple Souls perk is not actually required to cast the spells, but only one creature will be summoned without it.\n<br />\n<br />Compatibility:\n<br />If you have other mods that alter the merchant list for master-level spells, they may conflict. Change your load order to move the other mods *below* this one, so that the other mods loads *after* this one. The spell tomes should still be available for sale.\n<br />\n<br />If you have other mods that alter the Conjuration Ritual Quest, they may be incompatible with this mod.",
  "categoryId": "75",
  "version": "1.0",
  "author": "Rooker",
  "createdUnix": "1360817776",
  "updatedUnix": "1360793280",
  "containsAdultContent": false,
  "uploadedBy": "Rooker75",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000009610",
      "name": "Triple Souls Plus Summoned Host Spells Main 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Triple Souls Plus Summoned Host Spells Main 1_0-31615-1-0.zip",
      "uploadedUnix": "1360793280",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/07ceb8c10f25a0b9946f14213520af253e5226713bbcb93bbcd0a0ff450d4406/analysis/1407415992/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Triple%20Souls%20Plus%20Summoned%20Host%20Spells%20Main%201_0-31615-1-0.zip?fid=1000009610&ttl=1535807244&ri=8192&rs=8192&setec=fc5853aaa4895335c158a6b716bdf0fc"
    }
  ]
}