{
  "modId": 31642.0,
  "modName": "Bestial Hunger - Werewolf Bloodlust",
  "summary": "A mod that reintroduces and reinterprets the werewolf blood lust seen in Daggerfall and Morrowind. You\\'ll need to feed as a werewolf every week or suffer.",
  "descriptionHtml": "Updates:\r\n\r\nFeb 22, 2013 Version 1.1c: Added a hotfix to solve an issue where if you were cured while still being affected the powers wouldn\\'t clean up properly. Also changed terminology in messages from \\\"Feed\\\" to \\\"Hunt.\\\" File only contains altered scripts, so download main file (any one) and then install hotfix after, overwriting any files.\r\nFeb 18, 2013: Added a compatibility patch for the ToL Hircine Ring version so it can work in conjunction with Nature of the Beast II\r\nIMPORTANT Version 1.1b: There was a bug where if you uninstalled the mod it would continually give you a message about being well-fed. Get this version to fix it.\r\nFebruary 17, 2013: Added a version of the Hircine Ring version that also prevents forced transformation from Tales of Lycanthropy. Modified ToL files included with permission. See install notes.\r\nVersion 1.1: - Added multi-stage hunger. Now receive a small buff if hunger level is at 0 or 1, and a further debuff if hunger level is over 14.\r\n- Added Magicka regen debuff to mirror the Stamina one to level 1 of the hunger. \r\n- Capped hunger level at 60, to avoid potential problems down the line with an uncapped, incrementing variable.\r\n- Tidied up scripting a bit to avoid potential problems if hunger level jumps from one number to another without going through intermediary steps. Shouldn\\'t ever happen in normal course of play, but better safe than sorry.\r\nFeb 14, 2013: Added Hircine\\'s Ring version as alternative. Use either the main version, or the Hircine Ring version, not both.\r\n\r\nPREAMBLE\r\nLike, I\\'m sure a lot of people were, I was dissappointed with Skyrim\\'s interpretation of Werewolves. They went from being a cool thing that defined your character in Daggerfall and Morrowind, complete with advantages, disadvantages, and play style changes, to a daily power that the warrior guild got, and advantages/disadvantages so slight that you could easily forget about them.\r\n\r\nLuckily for me, and the rest of the community, there are some very talented modders out there that set about fixing this state of affairs. The infinitely talented Brevi/Spwned chief among them with the fantastic Tales of Lycanthropy (http://skyrim.nexusmods.com/mods/12687). I use ToL, and am very happy with it, however, its scope does not include adding back in the bloodlust feature seen in Daggerfall and Morrowind. Nor was I able to find any other mod that did it adequately. So given that I have cooked up this relatively simple mod to add it back in. \r\n\r\n\r\nDESCRIPTION\r\nThis mod is fairly simple and straightforward. Basically if you\\'ve used any Needs type mods this will be very similar. If your character is a werewolf (that is, has the werewolf disease) then you will have a bestial hunger you need to satiate to keep from getting weak. Every day your hunger grows. After a week (seven days) without eating you are stricken with a weakness. Your health is reduced by 75 and your stamina & magicka do not regenerate. There will be a warning the day before you are weakened, as well as the day of. If you go two full weeks without feeding (14 days) the debuff will progress to reducing your health by 95, and health with stop regenerating as well.\r\n\r\nYou lower your hunger by feeding in werewolf form. Each feed reduces your hunger level by one. So if after a week, you transform, eat one thing, then transform back, you will have satiated your blood lust, but only until the next day. You\\'ll need to get a nice little rampage in to fully sate a week\\'s hunger. \r\n\r\nThe counter doesn\\'t stop at 14 either. Your weakness doesn\\'t progress past the secpmd stage, but if you go awhile without eating it\\'s going to require a lot of feeding to get your hunger back down. It caps at 60, which will likely require more than one transformation to completely eliminate.\r\n\r\nThe Hircine Ring version gives the ring the power to resist the bestial hunger while worn, like it did in Daggerfall. For as long as you are wearing the ring your hunger level will be at zero, and will not increase. However when you take the ring off you revert to being as hungry as you were before, so it can\\'t be equipped and unequipped to wipe your hunger; you need to actually wear the ring to get its effects. \r\n\r\nIn addition, I\\'m pleased to say that I\\'ve been given permission by Brevi of Tales of Lycanthropy to include files of his that I\\'ve modified. As such, there is a version of the Hircine Ring version that gives the ring the power to both resist bloodlust as well as forced transformations, just as it did back in its Daggerfall glory days. See install notes for this one.\r\n\r\nThe idea behind this mechanic was to make your lycanthropic nature never something you could completely forget about. I took inspiration from the way the mechanic worked in Daggerfall and Morrowind, combined it, then reinterpreted it for Skyrim. Overall the penalty is more forgiving than either of those game\\'s systems, it\\'s less easily managed than Daggerfall, while not being quite as demanding as Morrowind. It is designed to be a meaningful debuff, one you will want to avoid, while at the same time it\\'s one you can work around and live with, if for example you wanted to roleplay a character that resists their animal urges and just rolls with the implications of that.\r\n\r\nINSTALLATION / UNINSTALLATION\r\n\r\nAll very straight forward, just either use the mod manager, or unpack the archive into your /Skyrim/Data/ folder. Pick either the Hircine Ring version or the lite version, not both.\r\n\r\nIf you use the Hircine Ring version, and your character already has the ring, you will need to get a fresh copy for the ring to work properly. Type \\'help \\\"ring of hircine\\\"\\' into the console. This will give you the formID for the ring (it\\'s the Armor entry). Then type \\'player.additem FormID 1\\\" where FormID is the number listed for the ring. You can dispose of your old one however you\\'d like.\r\n\r\n*Very Important Note For ToL Hircine Ring Version* \r\nThis version requires that you have downloaded and installed Tales of Lycanthropy Core 1.5 already (http://skyrim.nexusmods.com/mods/12687). As with the other versions of Bestial Hunger, you just need this one if it\\'s the one you plan to use. When you install it you will be prompted to overwrite ToL_Core.pex (as well as .psc but since that\\'s source it\\'s less important). Do so. Then instead of activating the ToL_Core_by_Brevi.esp, use the Tol_Core_by_Brevi - BH Version.esp. \r\n\r\nIf you want to uninstall this and go back to ToL functioning as normal, you need to replace the ToL_Core.pex with the one from ToL. Then just go back to using the regular esp.\r\n\r\n*Nature of the Beast II Compatibility Patch*\r\nNature of the Beast II\\'s ToL compatibility patch modifies the same script as my ToL Hircine Ring version which unfortunately made them incompatible. Luckily, gulogulo and I were able to work together on a version of the script that will work for both. To use it simply make sure that the script from the compatibility patch overwrites the one from both my ToL Hircine Ring version, and the one from Nature of the Beast II. \r\n\r\nYou still need to download and install the ToL Hircine Ring version as well as Nature of the Beast II and its attendant ToL compatibility patch, so just make sure that you install this cross-mod compatibility patch last, and you should be fine. Also, make sure you have both esp\\'s active (load order shouldn\\'t matter).\r\n\r\n\r\n\r\nTo uninstall, first make sure you aren\\'t being effected by any abilities (probably not strictly necessary, but always good to be sure). You can do this either the natural way, or by entering \\\"set hungerlevel to 2\\\" into the console. Give it a few seconds and any effects should be removed. Then just deactivate the mod. \r\n\r\n*Important Note*\r\nIf you plan to switch between versions of this mod (as in use the lite version for a bit, then switch over to the Hircine Ring version or the Tol Hircine Ring, etc.) make sure to uninstall and make a clean save between each switch. So turn the mod off, load your game up, save, then turn on the next version you plan to use. Not doing this can result in some weird doubling up of effects.\r\n\r\nCOMPATIBILITY\r\nSKSE is not required.\r\n\r\nThis base version is designed to be extremely compatible and modular, and should work with most every werewolf mod out there, provided they don\\'t make too extreme changes to the way werewolves work. This doesn\\'t touch or change anything that\\'s already in there, it merely adds a spell and a couple scripts that reference werewolf functions. I\\'ve tested it with Tales of Lycanthropy, and The Beast Within (another excellent werewolf mod http://skyrim.nexusmods.com/mods/22165) and it works well with both, but again it should work with any or none. This is designed to be played alongside whatever other werewolf mods you use, and was created mostly as a personal mod to compliment the other ones I\\'m currently using.\r\n\r\nThe Hircine Ring version makes changes to the ring, and specifically uses a different script to control its functions, so any mod that changes the ring or relies on that original script (for some reason) probably won\\'t be compatible.\r\n\r\nThe ToL Hircine Ring version makes changes to the base ToL script, and so will be incompatible with any mod that does the same. A compatibility patch for Nature of the Beast II\\'s ToL changes is included here, with permission from gulogulo.\r\n\r\nThat all being said, if there are werewolf mods that aren\\'t compatible with the base version (though, off the top of my head they\\'d need to use a completely different werewolf feeding system for that to happen) then let me know, and I\\'d be more than happy to try to work out a compatibility patch.\r\n\r\nFUTURE PLANS\r\nI plan to do a version where the highest level makes you susceptible to random transformations, ala the Cursed Ring of Hircine effect. This is provided I can get it working smoothly and it doesn\\'t conflict with any of the big werewolf mods. Even still it will probably remain optional.\r\n\r\nI also want to find a way to damage health as a percentage of total health, rather than an absolute number. I want the health weakening to feel significant, but I also want it to never be able to kill a player. With absolute numbers I\\'m constrained by using numbers less than 100, since that could kill a level one character, but it becomes very easy to level away from the point were even a 100 point drop in health is a huge deal. Ideally I can find a way to do this in a way that isn\\'t script heavy.\r\n\r\nCREDITS:\r\nBrevi of Tales of Lycanthropy, obviously. Not only are the scripts in the Hircine Ring ToL version his, with only the slightest of modifications, but his work on Tales of Lycanthropy has served as a big inspiration for this mod. I literally would not have made this if he hadn\\'t been blazing the way, getting the hard work of getting werewolves back on the right track done.  \r\n\r\nGulogulo for his work on Nature of the Beast II. The compatibility patch here includes work done for that mod, and it is included here with permission.\r\n",
  "categoryId": "24",
  "version": "1.1c",
  "author": "Hidden_7",
  "createdUnix": "1360847288",
  "updatedUnix": "1361529103",
  "containsAdultContent": false,
  "uploadedBy": "Hidden_7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000009764",
      "name": "BestialHungerV1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "BestialHungerV1-31642-1-0.rar",
      "uploadedUnix": "1360846661",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3706cb0565b79b01fd5c7d81d5a1d598b02ff015cfddca64a4b2f488798f00f2/analysis/1407416884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BestialHungerV1-31642-1-0.rar?fid=1000009764&ttl=1535807306&ri=8192&rs=8192&setec=3d9aa5442e221a5055a03c18c2ebfbca"
    },
    {
      "fileId": "1000009972",
      "name": "BestialHungerHircineV1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "BestialHungerHircineV1-31642-1-0.rar",
      "uploadedUnix": "1360900584",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e4c71c5747508eef43e3db24dac185e26beacfea5c3b00e25b5d169a44e38ac3/analysis/1407418337/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BestialHungerHircineV1-31642-1-0.rar?fid=1000009972&ttl=1535807307&ri=8192&rs=8192&setec=2fbabff62615a4158521b10494b1d792"
    },
    {
      "fileId": "1000010560",
      "name": "BestialHungerV11B",
      "version": "1.1b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "BestialHungerHircineV11B-31642-1-1b.rar",
      "uploadedUnix": "1361102238",
      "modVersion": "1.1b",
      "virusScanUrl": "https://www.virustotal.com/file/d194c5edac162c93e00448bdafececc52480109c11d8668e979b0f04f2f90792/analysis/1407422255/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BestialHungerHircineV11B-31642-1-1b.rar?fid=1000010560&ttl=1535807308&ri=8192&rs=8192&setec=408361fadf7c1e6f2d8977a5287c48e3"
    },
    {
      "fileId": "1000010561",
      "name": "BestialHungerHircineV11b",
      "version": "1.1b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "BestialHungerHircineV11b-31642-1-1b.rar",
      "uploadedUnix": "1361102396",
      "modVersion": "1.1b",
      "virusScanUrl": "https://www.virustotal.com/file/d194c5edac162c93e00448bdafececc52480109c11d8668e979b0f04f2f90792/analysis/1407422255/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BestialHungerHircineV11b-31642-1-1b.rar?fid=1000010561&ttl=1535807308&ri=8192&rs=8192&setec=cbcfc219c5227d84feff4a1080775c36"
    },
    {
      "fileId": "1000010562",
      "name": "Bestial Hunger Hircine Ring ToL Version 11b",
      "version": "1.1b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "17",
      "fileName": "Bestial Hunger Hircine Ring ToL Version 11b-31642-1-1b.rar",
      "uploadedUnix": "1361102436",
      "modVersion": "1.1b",
      "virusScanUrl": "https://www.virustotal.com/file/a9c260d8c9c8067995fbbbfc4db2c1af0f75aa6d0f09dec3cf84ee15bf57eb9e/analysis/1407422284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bestial%20Hunger%20Hircine%20Ring%20ToL%20Version%2011b-31642-1-1b.rar?fid=1000010562&ttl=1535807309&ri=8192&rs=8192&setec=3c66a31d82fb457e986b00adf6cc3ab9"
    },
    {
      "fileId": "1000011074",
      "name": "Nature of the Beast II ToL Compatibility patch",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "Nature of the Beast II ToL Compatibility patch-31642-.rar",
      "uploadedUnix": "1361241903",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0f367eaef69f3544eded7f0e55c3ddfc93ba114fe81c16e085d8c8f8f3f1aefa/analysis/1407426168/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nature%20of%20the%20Beast%20II%20ToL%20Compatibility%20patch-31642-.rar?fid=1000011074&ttl=1535807309&ri=8192&rs=8192&setec=c599bb94fd06e03c682535fac2a4646c"
    },
    {
      "fileId": "1000012027",
      "name": "BestialHunger11cHotfix",
      "version": "1.1c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "BestialHunger11cHotfix-31642-1-1c.rar",
      "uploadedUnix": "1361529103",
      "modVersion": "1.1c",
      "virusScanUrl": "https://www.virustotal.com/file/1e118637fd9b4b4aa99959f3ca0fe5d9240b3dfaeacd9d0cc53fb1bc6596f831/analysis/1407432557/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BestialHunger11cHotfix-31642-1-1c.rar?fid=1000012027&ttl=1535807310&ri=8192&rs=8192&setec=d8df2b8b3408a79642200ba4c24fd7d9"
    }
  ]
}