{
  "modId": 31677.0,
  "modName": "LSBRuneHammer",
  "summary": "New Hammer For Skyrim",
  "descriptionHtml": "2/14/2013 LSBRunehammer by Lord Banewrath Sunblade\r\n\r\n\r\n     This mod adds new one handed hammer to skyrim. The new weapon is the Sacred Runehammer and it is a brand new model\r\nwith a custom texture. This new hammer is of ebony quality in damage and has been given the same enchantment that \r\nDawnbreaker has. I felt that most of the unique and cool weapons in the game are mostly swords and the blunt weapons\r\nthat are in the game like volendrung and the Mace of Molag just aren`t to my taste even though they look pretty\r\ndarn cool. I wanted a weapon that you would imagine a nordic paldin or cleric would carry. Or something the Vigil\r\nwould have tucked away for safe keeping until the time came where the weapon was needed where a true champion would rise to prove his worth to carry the sacred weapon. \r\n\r\n  I had originally wanted to make a questline with the Vigil to obtain the hammer. Sadly though, I am unable to get a quest working so I decided to add this weapon as loot in an allready existing quest. I choose the Gauldurs Amulet Quest because it was a long quest that had alot of steps and after 170ish hours in my save I finally got around to just finishing it. I was dissapointed with the amulet the quest awarded so I decided to add this hammer to the skeleton of Gauldur so after the final\r\nquest foes were beaten and you got your amulet you could loot this from his corpse in his coffin. So all in all you get a \r\nnew custom blunt weapon that is actually a decent weapon with a daedric artifacts enchantment. Beware Undead!\r\n\r\n  I don`t feel the weapon is overpowered and it is only 16 damage, the equivalent to an ebony mace. And for all the trouble you need to go through with all the travel and dungeons and npc`s you must encounter. I feel this is a pretty good reward and \r\nconsidering there aren`t many decent blunt weapon mods going around, this is like a drop of heaven for blunt weapon lovers.\r\n\r\n\r\n      Hope you enjoy it. Now go smash some skulls!\r\n\r\n\r\n\r\n    To install the mod just drag and drop the esp and bsa to you date folder. To uninstall it, just delete the two files.\r\n\r\n\r\n You may not use my work in other mods without permission. You can however translate the mod to your language and upload\r\nit to your national modding site.",
  "categoryId": "55",
  "version": "1",
  "author": "Lord Banewrath Sunblade",
  "createdUnix": "1360885447",
  "updatedUnix": "1360885333",
  "containsAdultContent": false,
  "uploadedBy": "hammerhorde",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000009910",
      "name": "LSBRuneHammer",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "756",
      "fileName": "LSBRuneHammer-31677-1.7z",
      "uploadedUnix": "1360885333",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/7ae2acf50ad13a28add1bd0cec8525755499a20e0071fa8bc724f44513158fa7/analysis/1407417627/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LSBRuneHammer-31677-1.7z?fid=1000009910&ttl=1535807387&ri=8192&rs=8192&setec=273830a81205da5395950685cd078b91"
    }
  ]
}