{
  "modId": 31689.0,
  "modName": "The Tamriel Trials Official Mod",
  "summary": "A mod made, designed, and endorsed by the people behind The Tamriel Trials. The aim is to provide many small tweaks to better focus upon the goal and gameplay of T3 while automating many of the primary features.",
  "descriptionHtml": "Also available from the Steam workshop!\r\n\r\n~ ~ ~\r\n\r\n[u][b]Join the dev team![/b][/u]\r\n\r\nCurrently we\\'re looking for some help in getting this thing going. If you\\'ve got experience creating mods for Skyrim and want to help out, contact us and we can talk!\r\n\r\n~ ~ ~\r\n\r\n[i]If you are unfamiliar with The Tamriel Trials, learn more [url=http://the-tamriel-trials.tumblr.com/]here![/url][/i]\r\n\r\n~ ~ ~\r\n\r\n[u][b]About[/b][/u]\r\n\r\n[b][i]DISCLAIMER:[/i][/b] This mod is currently under development and may or may not be broken or ruin everything. Right now it is being tested, meaning if you download and use it, you are a test subject. Feel free to give us your feedback, but use at own risk.\r\n\r\nThe Tamriel Trials Official Mod (T3MOD) is designed to fit, encourage, and support the general theme of T3 which is depth, immersion, and challenge. Those unfamiliar with T3 are STRONGLY encouraged to check it out before installing this mod, but the gist of it is that The Tamriel Trials (T3) is a way of playing the Elder Scrolls games that encourages the player to take it slow and appreciate and enjoy the depth and beauty of the worlds, to truly get the most out of the games.\r\n\r\nT3 does this by imposing a set of rules that focus on giving the game more depth, immersing the player in the world, and giving actions real consequences and slowing the pace of the games by increasing the challenge.\r\n\r\nThis mod is designed and built by the people behind T3 and is meant to compliment the game play style of those undertaking The Trials. This mod makes a great deal of small tweaks to gameplay and automates several of the main features of T3.\r\n\r\nCurrently, T3MOD is under development and is only in its infancy. It is being tested as we speak and is not complete by any means. Thus by downloading and using it you are taking your own risks, but you\\'re also helping us, assuming you provide constructive feedback whenever possible.\r\n\r\nThank you for downloading!\r\n\r\n~ ~ ~\r\n\r\n[u][b]Info[/b][/u]\r\n\r\nVersion: Alpha 1.0\r\nStatus: In Development\r\nCategories: Gameplay Overhaul / Immersion / Realism / Role Play / Misc\r\nRequirements: Skyrim\r\n\r\n~ ~ ~\r\n\r\n[u][b]FAQ[/b][/u]\r\n\r\n[b]Q: If T3 is about the Elder Scrolls series in general, why did you pick Skyrim and not one of the other ones?[/b]\r\n[i]A: Skyrim, from a modder\\'s point of the view, has the most flexibility, the most support, and has the biggest \\\"audience\\\".[/i]\r\n[b]Q: When will this be out of development?[/b]\r\n[i]A: It\\'s difficult to get even a rough estimation right now. I want to say late spring.[/i]\r\n[b]Q: Your mod ruined everything! My CPU caught fire, my girlfriend died, and my car got stolen by a horse![/b]\r\n[i]A: Have you tried turning it off and back on again?[/i]\r\n[b]Q: Ok but like I don\\'t want to read about this \\\"T3\\\" thing and like just what is this??[/b]\r\n[i]A: Free candy.[/i]\r\n\r\n~ ~ ~\r\n\r\n[u][b]Current Features[/b][/u]\r\n\r\nUNDER CONSTRUCTION\r\n\r\n[i]For a full feature list click [url=http://the-tamriel-trials.tumblr.com/T3MODfeaturelist]here![/url][/i]\r\n\r\n~ ~ ~\r\n\r\n[u][b]Planned Features[/b][/u]\r\n\r\n[i]These are a handful of the features we plan on adding. Some may make it in, some may not.[/i]\r\nUNDER CONSTRUCTION\r\n\r\n~ ~ ~\r\n\r\n[u][b]Credits[/b][/u]\r\nProject Lead: Sylvanicus\r\n\r\n~ ~ ~\r\n\r\n[u][b]Installation[/b][/u]\r\n\r\nDownload with NMM\r\n\r\nOR\r\n\r\nDownload manually and extract (using something like 7zip, WinRAR, etc.) to your Skyrim data directory (usually C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\Skyrim\\\\data\\\\). If it asks you whether you want to overwrite or replace anything, say yes.\r\n\r\n~ ~ ~\r\n\r\n[u][b]Updating / Uninstallation[/b][/u]\r\n\r\nTo update just download the new version and replace the old one with it. Should cause no problems. To uninstall just uncheck the box when loading Skyrim, make sure your game hasn\\'t been affected, then delete it.",
  "categoryId": "24",
  "version": "Alpha1.0",
  "author": "Sylvanicus",
  "createdUnix": "1360898074",
  "updatedUnix": "1360898074",
  "containsAdultContent": false,
  "uploadedBy": "Sylvanicus",
  "primaryFile": null,
  "files": []
}