{
  "modId": 31698.0,
  "modName": "Brane_man Magic Overhaul",
  "summary": "This is the Brane_man Magic Overhaul (BMO).  It is a collection of completely additive mods, independent but best used together, that are designed to mod the Skyrim magic system in a purely constructive way.",
  "descriptionHtml": "This is the Brane_man Magic Overhaul (BMO).  It is a collection of completely additive mods, independent but best used together, that are designed to mod the Skyrim magic system in a purely constructive way.\r\n\r\nThat means:\r\nNone of these mods will require any extra perk points to fill up a skill tree - I’ve generally ‘overloaded’ the functionality of existing perks, making them have multiple effects.\r\nNone of these mods will reduce the effectiveness of a spell from vanilla in any way.\r\nNone of these mods will make a skill tree overpowered, relative to vanilla.\r\nAnd most importantly - None of these mods will remove functionality from anything, only add to functionality.\r\nThis is my design philosophy and I’ve stuck to it.\r\n\r\nInstallation:\r\nJust drop the .ESPs into your Skyrim\\\\data folder and activate.\r\n\r\nConflicts:\r\nWill probably conflict with any mod that changes vanilla magic in Skyrim.\r\n\r\nRequires:\r\nSkyrim.esm\r\n\r\nKnown issues:\r\nNone at the moment.\r\n\r\nChangelog:\r\n\r\nV1.0.1; Fixed minor dirty edits and reanimated undead no longer turn to dust by default.\r\nV1.0.2; Fixed Conjured Weapon XP gain and Candlelight spell cost.\r\nV1.0.3; Added a full set of Master level Bound weapons.\r\nV1.0.4; Changed Unarmored bonus to 2.5/3.5/4.5 to offset the hidden armor bonus, obsidianflesh should set you to the armor cap when fully perked.\r\nReplaced the Unarmored health bonus to bonus regeneration as the extra health actually had a tendency to kill the player outright when recast. (important note this is actually a bug with Skyrim itself and I don\\'t think I can fix it.)\r\nV1.0.5; Removed the health regen bonus from Unarmored so the player isn\\'t completely invincible with the unarmored perk.\r\n\r\n\r\nI’ve been working on these mods for weeks, and they’re finally ready for release.  I hope you enjoy using them.  Bugs/Comments/Feature Requests go in the comments.  Thanks for trying Brane_man Magic Overhaul.  A summary of the changes is below.\r\n\r\n\r\n\r\nOverhaul-Wide Changes:\r\nAll Novice, Apprentice etc. perks increase duration/effectiveness of their respective spell tiers by 10/15/20/25/30%.\r\n\r\nMost Master level spells’ casting costs have been reduced.\r\n\r\nSee the mod\\'s respective readmes for more detailed descriptions.\r\n\r\n\r\nAlteration Changes:\r\nConverted the Alteration tree into an unarmed monk tree(!).  Unarmed and Unarmored is now a very viable spec, as I’ve overloaded carefully balanced (provided you are not a Khajiit, that is) unarmed damage bonuses into the Alteration perk tree and the *Flesh spells.\r\n\r\nAll *Flesh spells have a small unarmed damage bonus which brings unarmed damage up to the same damage as an iron/orcish/glass/ebony/daedric sword (with minimal skill and perks) while the spell is active and you aren’t wearing armor.  This unarmed damage bonus is much more substantial when combined with the new Unarmed perk, below.\r\n\r\nThe perk “Magic Resistance” has become \\\"Unarmed,\\\" and in addition to its previous effects, each level of the perk now further increases unarmed damage from *Flesh spells to match the equivalent iron/orcish/glass/ebony/daedric sword with the requisite Smithing improvements and One Handed skills and perks.\r\n\r\nAll *Flesh spells’ armor values increased by 20.\r\n\r\nMage Armor bonus increased to 2.5/3.5/4.5 times as much armor, in addition it will make *Flesh spells increase your health regeneration.  These effects, like vanilla, only work while not wearing armor.\r\n\r\nAdded a new master level spell \\\"Obsidianflesh\\\"\r\n\r\nAll *Light and *Flesh spell durations increased to five minutes.\r\n\r\nNOTE: I mentioned Khajiit above.  Beast races (even in vanilla) have racial bonuses to unarmed damage (Khajiit get +18 damage, stacking with my changes).  You may find being an unarmed Alteration Khajiit to be somewhat overpowered, at least at first.  Use this combination if you choose, but don’t say you weren’t warned.  Argonians only get +6, which may feel more balanced.\r\n\r\n\r\nConjuration Changes:\r\nAdded limited level scaling to Atronachs once the “Elemental Potency” perk has been obtained, making the summons stay useful even at higher character levels. Thralls, the Familiar, and Dremora Lords will scale all the way to lv. 100.\r\n\r\nIncreased the level of all Raise Undead spells, you can now raise Dead Thralls up to lv. 100.\r\n\r\nAdded secondary effects to raised undead, once the Dark Souls perk has been obtained.\r\n\r\nAll spell durations increased to five minutes.\r\n\r\nAdded a full set of Master level Bound weapons they are equivalent to Daedric weapons with 40/60 smithing. Bound Xiphos(sword), Bound Sagaris(Battleaxe), Bound Sharanga(bow).\r\n\r\nWith the “Soul Stealer” and “Oblivion Binding” perks, Bound Weapons will give decent bonuses to the player’s relevant weapon skill while equipped.\r\n\r\n\r\nDestruction Changes:\r\nFire spells’ afterburn damage increased to 30%.\r\n\r\nChanged Master level Frost and Fire spells’ effectiveness, so with all relevant perks, they should do roughly 600 damage.\r\n\r\n\r\nIllusion Changes:\r\nAll spells’ effective levels increased, making the spells stay useful even at higher character levels.\r\n\r\nAdded secondary effects to Fury, Courage and Fear spells, tied to the \\\"Trickster\\\" perk (formerly “Aspect of Terror”). Higher-level spells have greater secondary effects than lower level spells.\r\n\r\nAdded two Apprentice level Fury and Courage spells- Hatred and Marshal.\r\n\r\nNormalized the level bonus for the perks, so at higher levels you don\\'t have to dual cast the spells just for them to work.\r\n\r\nIllusion spells now work on undead by default.\r\n\r\n\r\nRestoration Changes:\r\nAdded a full set of damaging Restoration spells! (Unfortunately I am not a 3D artist, so they use recycled visual effects.) They do more damage than Fire spells, but cost the same as Shock spells.  Uniquely, they do most of their damage as ‘afterburn’ over 2.5 seconds.\r\n\r\nAdded a spell called \\\"Renew,\\\" which increases Magicka regen by 50%.\r\n\r\nAll Turn/Repel Undead spells’ effective levels increased.\r\n\r\nWards’ effectiveness increased and Magicka cost reduced by 50%.  Ward changes apply only to the player versions of Ward spells.\r\n\r\nChanged NPC Wards to have a casting time (to simulate the player’s charging time), so they no longer can cast a fully powered Ward at you while your spell is in flight.\r\n\r\n\r\nSpecial thanks to [REDACTED] for helping with this mod.  And also [REDACTED] the [REDACTED], [DATA EXPUNGED].",
  "categoryId": "75",
  "version": "V1.0.5",
  "author": "Brane_man",
  "createdUnix": "1360914366",
  "updatedUnix": "1363129067",
  "containsAdultContent": false,
  "uploadedBy": "Braneman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000017050",
      "name": "Brane_man magic overhaul",
      "version": "V1.0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "Brane_man magic overhaul-31698-V1-0-5.7z",
      "uploadedUnix": "1363129067",
      "modVersion": "V1.0.5",
      "virusScanUrl": "https://www.virustotal.com/file/e73d4c8b8a3aba416174e4711e105a986bde4b057e87280d7969e66b6440ed47/analysis/1407466564/",
      "changelogHtml": " Removed the Unarmored health regen bonus to prevent the player becoming nearly unkillible with this perk. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brane_man%20magic%20overhaul-31698-V1-0-5.7z?fid=1000017050&ttl=1535807432&ri=8192&rs=8192&setec=918774f86a3f2d21dbface7d3fe2a790"
    }
  ]
}