{
  "modId": 31692.0,
  "modName": "Femme Fatale Mod",
  "summary": "Do you love role-playing as a sexy heroine? This mod offers you nine alteration spells that transform you into nine different heroines, each with a different outfit, method of attack, strengths, weaknesses, and powers. This is not an overpowered mod, in fact you might find it more challenging to play as these heroines.",
  "descriptionHtml": "[center] [heading] OVERVIEW [/heading] [/center]\r\nThe Femme Fatale Mod is a set of 9 alteration spells that transform the player into 9 different heroines for a period of time and then re-equip the player with the previously worn armor. The unique stats of each heroine can be found lower on this page. Each heroine has powers that are unlocked by killing enemies. This mod, although it took me a long time to make, contains very little of my own original work. In fact, it is more like a compilation of many different mods from other authors. Please look at the bottom of this page for references to all of these authors.\r\n\r\n[center] [heading] REQUIREMENTS [/heading] [/center]\r\n[ul] \r\n[*] SKSE version 1.6.6 (go to the bottom of the page to find out what SKSE is and how to install it)\r\n[*] You will need Dawngaurd for one of the heroines. However, she is downloaded as a plug-in, so if you don’t have Dawngaurd you can still have the other eight.\r\n[*] All armor uses the UNP body, but most are highly adaptable. I was able to play without any body mods and it didn\\'t look bad at all.\r\n[*] The mod doesn’t modify any vanilla game data so its order doesn’t matter on your mod list.\r\n [/ul]\r\n[center] [heading] HEROINE STATISTICS [/heading] [/center]\r\n[i] AMAZON [/i]\r\nThe Amazon specializes in killing men with a two handed bound battle-axe.\r\n[img=right] http://static.skyrim.nexusmods.com/mods/images/thumbnails/31692-2-1361572111.jpg[/img]\r\n[list]\r\n[*] [u] Strength: [/u] 50% increase in combat damage when fighting men\r\n[*] [u] Weaknesses: [/u] 65% vulnerability to all elements(Magic, Lightning, Fire, Frost, and Poison), inability to sneak, and limited to the use of the bound battle-axe\r\n[*] [u] Base Armor: [/u] 52-86 (heavy) (depending on player’s level)\r\n[*] [u] Base Damage: [/u] 16-28 (depending on player’s level and Mystic Binding Perk)\r\n[*] [u] Powers: [/u] Spear Throw, Whip Attack, Amazon Spell\r\n[/list] [list=1]\r\n[*] Spear Throw: Automatically added to shouts after getting 20 kills. Does 30 points base damage.\r\n[*] Whip Attack: Automatically added to shouts after getting 40 kills. Does small amount of damage and brings enemy to you.\r\n[*] Amazon Spell: Automatically added to your shouts after getting 60 kills. Strips the enemy of their armor, binds them, and gags them (only works on men).\r\n[/list]\r\n[i] ANGEL [/i]\r\nThe Angel specializes in Restoration and Conjuration Magic.\r\n[img=right] http://static.skyrim.nexusmods.com/mods/images/thumbnails/31692-1-1361572111.jpg [/img] \r\n[list]\r\n[*] [u] Strengths: [/u] 90% decrease in the cost of Restoration and Conjuration spells. Restoration spells are 15% more powerful.\r\n[*] [u] Weaknesses: [/u] 90% increase in the cost of Destruction and Alteration spells, health regeneration slowed by 50%, inability to sneak, no armor.\r\n[*] [u] Default Spell: [/u] After transforming into the angel you will automatically equip the spell Angel’s Light. It is a Restoration spells that casts a concentrated light beam doing damage to enemies, especially undead.\r\n[*] [u] Powers: [/u] Reflection Ward, Dawnbreaker Spell, Conjure Fairy\r\n[/list] [list=1]\r\n[*] Reflection Ward: Automatically added to restoration spells after getting 20 kills. Ward that will reflect all successfully blocked spells in the direction of aim.\r\n[*] Dawnbreaker Spell: Automatically added to restoration spells after getting 40 kills. Shoots a concentrated fire beam that has a chance to cause the Dawnbreaker explosion when killing undead.\r\n[*] Conjure Fairy: Automatically added to your conjuration spells after getting 60 kills. Summons a Fairy to fight for you.\r\n[/list]\r\n[i] CAT ASSASIN [/i]\r\nThe Cat Assassin specializes in killing people silently with two bound daggers.\r\n[img=right] http://static.skyrim.nexusmods.com/mods/images/thumbnails/31692-2-1361575252.jpg [/img]\r\n[list]\r\n[*] [u] Strengths: [/u] Footsteps are muffled, 30% harder to detect when sneaking\r\n[*] [u] Weaknesses: [/u] no armor, limited to the use of bound daggers\r\n[*] [u] Base Damage: [/u] 2-14 (depending on player’s level and Mystic Binding Perk)\r\n[*] [u] Powers: [/u] Cat Assassin Stealth, Auto-Loot, Dagger Throw\r\n[/list] [list=1]\r\n[*] Cat Assassin Stealth: Automatically added as an active effect after getting 20 kills (like prowler’s profit, you won’t be able to read it). Gives her a 10% chance to turn invisible for 10 seconds after striking an enemy.\r\n[*] Auto-Loot: Automatically added as an active effect after getting 40 kills. Automatically take all gold from enemies when you kill them.\r\n[*] Dagger Throw: Automatically added to your shouts after getting 60 kills. Does 10 points of base damage, will do 15x damage when sneaking with the Assassin’s blade perk.\r\n[/list]\r\n[i] GLADIATOR [/i]\r\nThe Gladiator specializes in using her bound shield to block most conventional weapons while attacking them with a bound mace.\r\n[img=right] http://static.skyrim.nexusmods.com/mods/images/thumbnails/31692-3-1361575252.jpg [/img]\r\n[list]\r\n[*] [u] Strengths: [/u]  15% increase in blocking effectiveness and one-handed damage \r\n[*] [u] Weaknesses: [/u] 100% vulnerability to all elements (magic, fire, lightning, frost, poison), moving 25% slower than normal, inability to sneak, and being limited to the use of her shield and mace\r\n[*] [u] Base Armor: [/u] 60-144 (heavy) (depending on player’s level)\r\n[*] [u] Base Damage: [/u] 9-19 (depending on player’s level and Mystic Binding Perk)\r\n[*] [u] Powers: [/u] War Hammer, Shield Push, Giga Hammer\r\n[/list] [list=1]\r\n[*] War Hammer: Automatically replaces your bound mace with a one-handed bound war hammer after getting 20 kills. Base damage ranges from 19 to 30.\r\n[*] Shield Push: Automatically added to shouts after getting 40 kills. Charges your shield so that for a limited time, every enemy successfully blocked, get pushed back.\r\n[*] Giga Hammer: Automatically added to your shouts after getting 60 kills. Charges your hammer so that for a limited time, every time you hit an enemy all enemies in the area are knocked back.\r\n[/list]\r\n[i] RANGER [/i]\r\nThe Ranger specializes in shooting enemies quickly and precisely with a bound bow.\r\n[img=right] http://static.skyrim.nexusmods.com/mods/images/thumbnails/31692-3-1361572111.jpg [/img]\r\n[list]\r\n[*] [u] Strengths: [/u]  50% speed boost in shooting, and a 30% increase in archery damage \r\n[*] [u] Weaknesses: [/u] the inability to sneak and being limited to the use of her bound bow\r\n[*] [u] Base Armor: [/u] 16-29 (light) (depending on player’s level)\r\n[*] [u] Base Damage: [/u] 12-22 (depending on player’s level and Mystic Binding Perk)\r\n[*] [u] Powers: [/u] Animal Friend, Rapid Fire, Animal Master\r\n[/list] [list=1]\r\n[*] Animal Friend: Automatically added as an active effect after getting 20 kills (like prowler’s profit, you won’t be able to read it). Animals won’t attack you, and will assist you if they are in the area and you are in trouble\r\n[*] Rapid Fire: Automatically added to shouts after getting 40 kills. Slows time and increases weapon speed at the same time.\r\n[*] Animal Master: Automatically added as an active effect after getting 60 kills. Animals that fight for you will have twice their normal health.\r\n[/list]\r\n[i] SCOUT [/i]\r\nThe Scout specializes in quickly dispatching enemies with two bound swords.\r\n[img=right] http://static.skyrim.nexusmods.com/mods/images/thumbnails/31692-4-1361575253.jpg [/img]\r\n[list]\r\n[*] [u] Strengths: [/u]  25% increase in movement speed and a 30% increase in one-armed damage.\r\n[*] [u] Weaknesses: [/u] 30% vulnerability to all elements (Magic, Fire, Frost, Lightning, and Poison), the inability to sneak, and being limited to the use of her two bound swords\r\n[*] [u] Base Armor: [/u] 24-43 (light) (depending on player’s level)\r\n[*] [u] Base Damage: [/u] 7-19 (depending on player’s level and Mystic Binding Perk)\r\n[*] [u] Powers: [/u] Quick Step, Rapid Strike, Swords Dance\r\n[/list] [list=1]\r\n[*] Quick Step: Automatically added to shouts after getting 20 kills. Quickly appear behind a random enemy.\r\n[*] Rapid Strike: Automatically added to shouts after getting 40 kills. Slows time and increases weapon speed at the same time.\r\n[*] Swords Dance: Automatically added as an active effect after getting 60 kills. Appear behind many enemies in quick succession, and strike each of them once.\r\n[/list]\r\n[i] SEDUCTRESS [/i]\r\nThe Seductress specializes in Illusion magic.\r\n[img=right] http://static.skyrim.nexusmods.com/mods/images/thumbnails/31692-4-1361572112.jpg [/img]\r\n[list]\r\n[*] [u] Strengths: [/u] 100% decrease in the cost of Illusion magic, a 50% increase in the power of Illusion spells, and a 15% decrease in the costs of Destruction, Alteration, and Conjuration spells.\r\n[*] [u] Weaknesses: [/u] 100% increase in the cost of Restoration magic, health regeneration slowed by 100%, no armor, and the inability to sneak.\r\n[*] [u] Default Spell: [/u] After transforming into the seductress you will automatically equip the spell Seduction. This is a contact spell (zero range) that can make any NPC your follower for a certain period of time. Talk to them to activate the Seductress’ kiss, which kills them and absorbs all of their health.\r\n[*] [u] Powers: [/u] Teleport, Multiply, Seduction Master\r\n[/list] [list=1]\r\n[*] Teleport: Automatically added to illusion spells after getting 20 kills. Launches a projectile that marks where you will teleport to.\r\n[*] Multiply: Automatically added to illusion spells after getting 40 kills. Conjure 10 immovable copies of yourself in random locations around you.\r\n[*] Seduction Master: Automatically added as an active effect after getting 60 kills. Followers under your seduction spell have twice their normal health.\r\n[/list]\r\n[i] SNIPER [/i] (This is the Add-on that requires Dawngaurd)\r\nThe Sniper specializes in killing enemies with a bound crossbow from a hidden location.\r\n[img=right] http://static.skyrim.nexusmods.com/mods/images/thumbnails/31692-5-1361572112.jpg [/img]\r\n[list]\r\n[*] [u] Strength: [/u] 10% increase in Archery damage.\r\n[*] [u] Weaknesses: [/u] no armor, a 20% reduction in the speed of reloading, and the fact that she has to stand up to recast her bound crossbow every 5 shots\r\n[*] [u] Base Damage: [/u] 8-24 (depending on player’s level and Mystic Binding Perk)\r\n[*] [u] Powers: [/u] Sniper Stealth, Sniper Eye, Catapult Barrage\r\n[/list] [list=1]\r\n[*] Sniper Stealth: Automatically added as an active effect after getting 20 kills (like prowler’s profit, you won’t be able to read it). Gives her a 10% chance to turn invisible for 10 seconds after shooting.\r\n[*] Sniper Eye: Automatically added as an active effect after getting 40 kills and getting the Eagle Eye Perk. Increases the zoom of Eagle Eye 5x.\r\n[*] Catapult Barrage: Automatically added to your shouts after getting 60 kills. Equips her with a single marker bolt. Wherever it lands, it will send a smoke signal to command a barrage of catapult missiles around its location.\r\n[/list]\r\n[i] WITCH [/i]\r\nThe Witch specializes in Destruction and Alteration magic.\r\n[img=right] http://static.skyrim.nexusmods.com/mods/images/thumbnails/31692-1-1361572139.jpg [/img]\r\n[list]\r\n[*] [u] Strengths: [/u] 90% reduction in the cost of Destruction and Alteration spells and a 15% increase in the power of Destruction spells.\r\n[*] [u] Weaknesses: [/u] 90% increase in the cost of Illusion and Conjuration spells, health regeneration slowed by 50%, no armor, and the inability to sneak.\r\n[*] [u] Default Spell: [/u] After transforming into the witch you will automatically equip the spell Flames.\r\n[*] [u] Powers: [/u] Bound Broom, Decapitate, Transmogrify\r\n[/list] [list=1]\r\n[*] Bound Broom: Automatically added to alteration spells after getting 20 kills. Conjures a flying broom that can be ridden.\r\n[*] Decapitate: Automatically added to destruction spells after getting 40 kills. Causes damage to humanoids, when killing an enemy it will remove their head. \r\n[*] Transmogrify: Automatically added to alteration spells after getting 60 kills. Transform the target into a random creature.\r\n[/list]\r\n\r\n[center] [heading] HOW TO INSTALL & PLAY [/heading] [/center]\r\nUse NMM or put the files directly into your Skyrim data folder. If you have Dawngaurd install the Sniper add-on in the same manner.  Once installed in one of these fashions, go to the very first room in Helgen Keep (where Ralof cuts your handcuffs at the beginning of the game) and find the Femme Fatale chest (and possible the Sniper chest as well). Take the spell tomes and the Femme Fatale book. The Femme Fatale book is used to see the kill counts for each of your heroines as well as reference the different powers that can be unlocked by all of them. Read the spell tomes and cast the spells to enjoy the effects. There is no way to dispel the spell until the time runs out; I did this on purpose because I wanted to make this mod a strategic challenge. The reason for its location in Helgen keep is so that you can get them early on in the game and role-play with them through the entire game if you want (because of the adjusting base values, it will be balanced the whole time).\r\n\r\n[center] [heading] ISSUES [/heading] [/center]\r\n[list=1]\r\n[*] There is a lag between casting the spell and the start of the effect, as well as between the end of the spell and the end of the effects. It was as long as 10 seconds for me sometimes, but hopefully you won\\'t see that on real gaming computers.\r\n[*] Sometimes after casting the spell, your arms will freeze and you are unable to use/draw/sheathe weapons. I don’t know why this happens yet. Just wait for the effect to die off, and then recast.\r\n[*] You will not get a kill count for killing the enemy in one shot if it is not a killmove. On the other hand, you can get multiple kill counts if it is a long kill move. You also can\\'t get kill counts for killing enemies with shouts, powers, conjured beings, cloaks, or runes.\r\n[*] There are many small issues with the seduction spell. The victim will act strangely, you won\\'t be able to command them if you have UFO, and there\\'s no kissing animation for the seductess\\' kiss.\r\n[*] I have not tested this mod with a lot of the bigger mods like Skyre, let me know if you find incompatability issues with this mod and another.\r\n[/list]\r\n\r\n[center] [heading] TO DO LIST [/heading] [/center]\r\nThis is my priorities for modding work as of right now. If you come up with issues or ways to improve this mod, leave me a comment and I might add it to this list.\r\n[list=1]\r\n[*] Fix the issues in this mod.\r\n[*] Make a male version of this mod, the Male Menace Mod\r\n[*] Make a quest mod to go with this (way in the future)\r\n[/list]\r\n\r\n[center] [heading] CREDITS [/heading] [/center]\r\nAngel & Fairy Wings = [url=http://skyrim.nexusmods.com/mods/24950] Moving Wings [/url] by Badgremlin\r\nAmazon Armor = [url=http://skyrim.nexusmods.com/mods/19928] R18Pn 03 - Argent Armor for UNP and CBBE Royal Retexture [/url] by messiasmummo \r\nGladiator Armor = [url=http://skyrim.nexusmods.com/mods/27680] Tera armors For Skyrim - UNP [/url] by Toad\r\nBound Weapons = [url=http://skyrim.nexusmods.com/mods/29259] Expanded Bound Weapons including Bound shields v2_1 [/url]  by Warden01\r\nSwords Dance & Quick Step = [url=http://skyrim.nexusmods.com/mods/13142] Sword Dance and Quick Step [/url] by Flippetized \r\nTeleport Spell = [url=http://skyrim.nexusmods.com/mods/11549] Chases Teleport Spell – ProjectileCoolFX [/url] by exploitz\r\nSniper Clothing & Cat Assassin Clothing = [url=http://skyrim.nexusmods.com/mods/24723] Alyn Shir Armor - CBBEv3 - UNP - UNP-BBP [/url] and [url=http://skyrim.nexusmods.com/mods/23790] Seraphine Armor - CBBEv3 - UNP [/url] by jmenaru\r\nBound Crossbow = [url=http://skyrim.nexusmods.com/mods/22071] Bound Crossbows [/url] by Elfpuncher and Djjojo\r\nAmazon Spell = [url=http://skyrim.nexusmods.com/mods/14697] New Spell - Bind And Gag [/url] by Daniel\r\nRanger Cloak = [url=http://skyrim.nexusmods.com/mods/12092] Cloaks of Skyrim [/url] by Nikinoodles\r\nAngel Clothing = [url=http://skyrim.nexusmods.com/mods/7327] UNP Slave Leia Clothing [/url] by sorajmoe\r\nDecapitate Spell and Bound Broom = [url=http://skyrim.nexusmods.com/mods/18277] Decapitation Spell and Raise Skull Minions [/url] & [url=http://skyrim.nexusmods.com/mods/19069] Flyable Broomstick [/url] by J3X\r\nBeam Attacks = [url=http://skyrim.nexusmods.com/mods/3413] Midas Magic – Spells in Skyrim [/url] by xilver\r\nSeductess Clothing = [url=http://skyrim.nexusmods.com/mods/27300] Sorceress elven robe for UNP [/url] by newmiller\r\nWitch Clothing = [url=http://skyrim.nexusmods.com/mods/11049] Witch Hat ClothingMod002 [/url] and [url=http://skyrim.nexusmods.com/mods/10626] Witch Girl Robe ClothingMod001[/url] by Ochinsama\r\nThrowing Spear, Throwing Knife, and Catapult Barrage =  [url=http://skyrim.nexusmods.com/mods/14176] Throwing Weapons - Death From Afar [/url] and [url=http://skyrim.nexusmods.com/mods/23791] Artillery - Death From Afar [/url] by Madrilous\r\nFairy & Seductress Copy Hair = [url=http://skyrim.nexusmods.com/mods/25395] Lore Styles hair set [/url] by MacKom\r\nFairy & Seductress Copy Face = [url=http://skyrim.nexusmods.com/mods/7897] envision Face [/url] by DD AKT\r\nFairy & Seductress Copy Headmesh = [url=http://skyrim.nexusmods.com/mods/7127] RANs HeadMesh Variants [/url] by RAN46\r\nAngel’s Halo = [url=http://skyrim.nexusmods.com/mods/11005] Angelic Halos and Demonic Horns [/url] by volvaga0\r\nScout Armor = [url=http://skyrim.nexusmods.com/mods/15279] Scamps Iron Armor Set - UNP Mashup [/url] by brokefoot\r\nRanger Armor  = [url=http://skyrim.nexusmods.com/mods/18008] Ashara Princess of the Woods for UNP [/url] by SydneyB\r\nCat Assassin Ears & Tail = [url=http://skyrim.nexusmods.com/mods/6150] Kaw Cat Disguise Set [/url] by Kaw\r\nSeduction Spell = [url=http://skyrim.nexusmods.com/mods/22903] Succubus Race [/url] by Nikitaa\r\nSound Effects are taken from various free websites\r\n\r\n[center] [heading] SKSE [/heading] [/center]\r\nYou really shouldn’t be afraid of using SKSE. It doesn’t affect your gameplay at all. In fact most of the best mods use SKSE so it will probably make gameplay better. Here’s what you need to do:\r\n[list=1]\r\n[*] Go to http://skse.silverlock.org/\r\n[*] Click on the download link and save it anywhere on your computer (such as desktop)\r\n[*] Use an unpacking tool such as WinZip or 7zip to unpack all of the files from this download into your Skyrim folder (usually for Steam users it is C:\\\\Program Files\\\\Steam\\\\SteamApps\\\\common\\\\Skyrim)\r\n[*] Now, whenever you want to start playing, instead of clicking wherever you usually click, go to your skyrim folder and click “skse_loader.exe”. That’s it.\r\n[/list]",
  "categoryId": "75",
  "version": "1",
  "author": "Chapmister333",
  "createdUnix": "1361841221",
  "updatedUnix": "1361841131",
  "containsAdultContent": true,
  "uploadedBy": "chapmister333",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013284",
      "name": "Femme Fatale Mod",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "269701",
      "fileName": "Femme Fatale Mod-31692-1.zip",
      "uploadedUnix": "1361840887",
      "modVersion": "1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Femme%20Fatale%20Mod-31692-1.zip?fid=1000013284&ttl=1535807419&ri=8192&rs=8192&setec=bdcd64109116bab50f6667036500c040"
    },
    {
      "fileId": "1000013286",
      "name": "Sniper Add-On",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "15607",
      "fileName": "Sniper Add-On-31692-1.zip",
      "uploadedUnix": "1361841131",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/65bdadc4afd4e06643c880a1bd73e9fd6290ed09e03b8999f14c93d65f9bdf3c/analysis/1407439819/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sniper%20Add-On-31692-1.zip?fid=1000013286&ttl=1535807420&ri=8192&rs=8192&setec=416cdc74cc76d3ef3fed787da9c3296e"
    }
  ]
}