{
  "modId": 31703.0,
  "modName": "SkyJubs Grand Investor - Merchant Overhaul Mod",
  "summary": "Advances the perks \\\"Investor\\\" and \\\"Master Trader\\\": You can now invest as often as you want in every merchant of the game and slowly build up their stocks. Fluctuant bonus of \\\"Master Trader\\\" to simulate a brisk market. Compatible with SkyRe and many Speech-Mods. ",
  "descriptionHtml": "[img]http://static.skyrim.nexusmods.com/mods/images/31703-1-1360928799.jpg[/img]\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Introduction[/b][/size][/color][/font]\r\n\r\nI said it at my other mod and I want to say it here again: English is not my native language. So please be kind with me, if you find some spelling or grammar mistakes. I’ll try my best, so that you guys can understand, what this mod is all about. But now: Have fun with this!  \r\n\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]What does the mod “Grand Investor” do? [/b][/size][/color][/font]\r\n\r\nDid you ever wonder why you can invest only one single time in the stores all around Skyrim? Or did you notice, that the perk „Investor“ was partially bugged, so that many, many merchants of the game don’t offer you the investment dialogue sequence? \r\n„SkyJubs Grand Investor“ tries to solve all this – and add more: [list]\r\n[*]You can invest in every (vanilla) merchant in the whole game. And with „all“ I mean [b]all[/b], even innkeepers, street vendors, teachers of Winterhold, fences or your spouse. Altogether there are now 134 NPCs (see the list below) who you can offer an investment. \r\n[*]You can invest as often as you want in the same (or different) store. So, if you like a particular merchant the most, just invest many times in his store and he’ll get a huge stock of money, which make it much easier for you to sell your loot. \r\n[*]In addition, I enhanced the perk „Master Trader“, because it was bugged in some ways (many merchants didn’t benefit from that). Now all merchants get the bonus, if you activate the perk, and the functionality is slightly changed (see detailed changes below). [/list]\r\nApart from that the vanilla function stays the same: Just activate „Investor“ and you are able to invest in the stores – but now in every single one and as much as you want. Just activate „Master Trader“ and all merchants get the bonus for their gold stock. \r\n\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Details[/b][/size][/color][/font]\r\n\r\nIn the following I explain some details of the two changed perks. You may read this carefully, in order to know, what my intention to make this mod was. \r\nFurthermore: This was much work! Because every single of the over 100 merchant chests needs to get and specific item linked to another and linked to a dialogue sequence. So… I’m only a human and for sure I made some mistakes when I work on all this entries. So please be patient and kind, if you find some bugs. Just report and I will try to fix them as fast as I can. \r\n\r\n[color=red][b]Investor:[/color][/b] As said before you can now invest in every merchant in the vanilla game. But there is something else, which I’ve changed. I thought about the word „investment“ and don’t like the idea of the original perk. This worked like that: You give a merchant 500 gold, and immediately he adds 500 to his vendor gold stock. You can even sell him out the next minute, but the raise of the stock is permanent. So, how the heck could this work? What I mean is: Investments need some time… and you don’t get everything you put into it, out of it in the very next second. So I changed the functionality of „Investor“ like this: You talk to any merchant and invest 1.000 gold per „investment talk“ in his store. This 1.000 gold will disappear immediately out of your pockets. In fact you must have 1.000 gold, otherwise you won’t even see the investment dialogue option (please have this in mind, if you test my mod). After the gold is taken from you, at first nothing happens in the vendors stock. It won’t raises immediately after the investment. Why? Because, first of all, he has to use the extra money, in order to raise his stock permanently. So you have to wait, until he updates his stock (normally two days, but some other mods you use might change this). If he does so, his stock permanently raises by 250 for every investment you made before. You might ask: “Just 250!? But I gave him 1.000 gold before!” So I say: “Yep, but you have to have some patience to take the maximum out of an investment. Sell him out with your loot four times and you got your money back. The investment is nothing more than an easement for you to sell your loot more quickly. \r\n\r\n[color=red][b]Master Trader:[/color][/b] I changed this perk in some ways. Now the perk’s name is “Trade relations”, which suggests, that your character build up some relations throughout Skyrim with every character level he archieves. If you activate the perk, all stores in the game will get a bonus for their gold stock (don’t forget, the vendor stores has to update their stock to get the money, so you have to wait 2 days to see it). So far it is equal to the vanilla version. \r\nBut, with my mod, this bonus will fluctuate every two days in order to simulate a brisk market. It fluctuates in the following limits: The minimum is always 50, the maximum is your actual character level multiplied with 50. So a growing character will have a bigger benefit from this perk, than a small level 10 trade newbie. \r\nIn addition to this, I should have fixed all old bugs of the former “Master trader”. So now really all stores should benefit from this perk. But again: If you find any bugs or notice that I miss a particular merchant, just write me a comment or a message and I will change this. \r\n\r\n[color=red][b]Which merchants should benefit from “Investor” and “Trade relations” with this mod:[/color][/b]\r\nAddvar, Adrianne Avenicci, Ahkari, Ahlam, Aicantar, Alvor, Ambarys Rendar, Angeline Morrard, Anoriath, Anton Virane, Arcadia, Arnskar Ember-Master, Asbjorn, Atahbah, Atub, Aval Atheron, Babette, Balimund, Beirand, Belethor, Bersi, Birna, Bolar, Bothela, Brand-Shei, Calcelmo, Camilla, Carlotta Valencia, Colette Marence, Corpulus Vinius, Dagur, Dirge, Drevis Neloren, Drifa, Dushnamub, Elda Early-Dawn, Elgrim, Elrindir, Endarie, Endon, Enthir, Eorlund Gray-Mane, Evette San, Eydis, Faida, Falion, Faralda, Farengar, Fihada, Filnjar, Frabbi, Fralia, Frida, Garakh, Geimund, Gharol, Ghorza gro-Bagol, Grelka, Greta, Gulum-Ei, Hadring, Hafjorg, Haran, Heimvar, Herluin Lothaire, Hermir, Hillevi Cruel-Sea, Hogni Red-Arm, Hulda, Iddra, Imedhnain, Jala, Jawanan, Jonna, Karita, Keerava, Kerah, Kleppr, Lami, Leontius, Lisbet, Lod, Lucan Valerius, Madena, Madesi, Madran, Mahjad, Mallus Maccius, Marise Aravel, Melaran, Moth gro-Bagol, Mralki, Muiri, Murbul, Nelacar, Nils, Niranye, Nurelion, Oengul War-Anvil, Orgnar, Phinis Gestor, Quintus Navale, Revyn Sadri, Risaad, Rustleif, Saadia, Sabjorn, Sayma, Seren, Sharamph, Shuftharz, Solaf, Spouse, Sybille Stentor, Syndus, Taarie, Tacitus, Talen-Jei, Thoring, Tolfdir, Tonilia, Ulfberth, Ungrien, Urag gro-Shub, Valga Vinicia, Vanryth Gatharian, Vekel the Man, Vivienne, Wilhelm, Wuunferth the Unliving, Wylandriah, Ysolda, Zaria and Zaynabi. \r\n\r\nPlease consider, that some of the named merchants don’t have a store at the beginning of the game, but can get one, if a particular main vendor dies (for example: Imedhnain can inherit the store of Lisbet and so on). So perhaps you can’t invest in Imedhain, as long as Lisbet is alive. \r\n\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Possible future updates[/b][/size][/color][/font]\r\n\r\nHere you find all suggestions, that you make in the comment section, or my future plans with this mod. If you have any idea, what I can change or advance, just post it and I will pull it over here, if I can realize it with my (limited) scripting skills. [list]\r\n[*][b]German version:[/b] I will translate this mod into german (as I did with my “No Helmet Mod”), if you guys like it. Just let me know in the comment section, if there are any german nexus users, who want to use it. \r\n[*][b]Expansion plugins:[/b] I will expand the mod, so that really all merchants, even those from Dawnguard and Dragonborn, benefit from the two perks. \r\n[*][b]Different investment ratios:[/b] Perhaps I will publish more versions of this mod, so that you can choose between different investment ratios (it is 1000/250 now). \r\n[*][b]Influence on traded items:[/b] I wish to advance the mod in the next weeks, so that made investments change the number of and add new items, which the specific merchant, you\\'ve invested in, will offer you.[/list]\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]My Mods on the Nexus[/b][/size][/color][/font]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/34239][color=red][b]SkyJubs Main Menu Aesthetics - Background Replacer Mod[/color][/b][/url]\r\nYou\\'re bored of the same, old, black main menu background of Skyrim? Then you perhaps want to take a look at this beauty: A classy series of overhauled pictures and wallpapers all around Skyrim in three different color moods - all implemented in particular auto-installers. And on top: A main menu randomizer, which gives you the option to get changing backgrounds every time you start the game. Easy to install, nice to look at - worth a try. \r\n\r\n[url=http://skyrim.nexusmods.com/mods/18250][color=red][b]SkyJubs Invisible Helmets – No Helmet Mod[/color][/b][/url]\r\nI think it’s (at present) the most advanced “No Helmet Mod” on the Nexus. As far as I know, it’s bugfree and compatible with all popular mods, which use the biped objects (f.e.“Cloaks of Skyrim”). It supports Dawnguard, Dragonborn and several armor sets from other Nexus modders (f.e. \\\"Immersive Armors\\\" by Hothtrooper44), also I offer three standard main mod versions and in addition a “Modular Kit”, which works with over 100 separate ESP-Files in order to hide just specific headdresses. So... if you want to see your character’s face although you wear a helmet, you might want to take a look at this. \r\n\r\n[color=red][b]SkyJubs Grand Investor – Endless Investments Mod[/color][/b]\r\nYou see it here ;-) Hope you like it. \r\n\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Credits[/b][/size][/color][/font]\r\n\r\nI will thank all users, who support me or this mod with their feedback, bug search or constructive hints. In return I’d like you to endorse my mod, if you like and use it. As said, it was much work, so I’d be glad to get something friendly back. \r\n\r\nAt first I have to thank some users of the “Bethesda Softworks Forums”. Those guys got the patience to explain me (a total scripting noob) the basics of papyrus scripting, which is indispensable for this mod. So I want to thank Amethyst Deceiver, Arodicus, CCNA, Cipscis, DreamKing, Grass Hopper, h4vent, Ingenue, kuertee, Turn_on_a_Dime, Worm and especially aellis, JustinOther and RandomNoob. \r\n\r\nAlso I want to thank the nexus users 4EverLol4Life, Chroniac, dDaAnNxX, Gatorz08, icemage24, ironmonkbr, LogicalFear2002, RiotBoogie, The Natoorat and tigger2 for the given feedback and support. \r\n\r\nHave fun\r\nJDB",
  "categoryId": "79",
  "version": "1.0",
  "author": "Jubeldibub",
  "createdUnix": "1360931045",
  "updatedUnix": "1360928571",
  "containsAdultContent": false,
  "uploadedBy": "Jubeldibub",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010032",
      "name": "SkyJubs_Grand_Investor_Eng",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "121",
      "fileName": "SkyJubs_Grand_Investor_Eng-31703-1-0.rar",
      "uploadedUnix": "1360928571",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f41a30748ebb9c64ed858e862bfae2ff5da0a82a1c408458cbca577d2477e848/analysis/1407418746/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Grand_Investor_Eng-31703-1-0.rar?fid=1000010032&ttl=1535807448&ri=8192&rs=8192&setec=b6962e1c3d488100b220b2cb5a7efaae"
    }
  ]
}