{
  "modId": 31714.0,
  "modName": "Adventure Planning Information Books",
  "summary": "Raiding dungeons? No problem! Seven in-game books to tell you which ones respawn and how many zones each lootable area has.",
  "descriptionHtml": "If you remember back to your days in Elder Scroll: Oblivion, you could walk into any dungeon or ruin and there would always be enemies to kill and loot to snatch.\r\n\r\nIn Skyrim, this isn\\'t the case. Nothing infuriates me more than traveling all the way to an area ready for some action, only to walk through the empty halls of a ruin and realise that this particular dungeon doesn\\'t respawn.\r\n\r\nThen theres the other case, where the dungeon does respawn, but it\\'s only one small zone and I\\'m left short wanting more action.\r\n\r\nI decided instead of \\'Alt + Tabbing\\' out my game every time to check if the dungeon respawns and how big it is, I would add books with this information into the game world.\r\n\r\nFarengar Secret-Fire at Dragonsreach in Whiterun is your man, he\\'ll sell you any of the seven books.\r\nOne for each of the following catagories:\r\nCaves\r\nDragon Lairs\r\nDwemer Ruins\r\nNordic Ruins\r\nMilitary Forts\r\nMines\r\nRuins\r\n\r\nHere\\'s the format:\r\n\r\nBleak Falls Barrow\r\nRespawn: Yes\r\nZones: 2\r\n\r\nEach book lists all of the areas under each category and states how many zones it has and if the contents respawn (enemies, loot etc)\r\n\r\nAll this information has been tediously gathered from the UESP wikia (http://www.uesp.net/wiki/) and the information in these books are as accurate as the wikia page (which is pretty accurate)\r\n\r\nBefore you ask why all the books say \\\"3ones\\\" instead of \\\"Zones\\\" it\\'s Bethesda\\'s really weird font, the Z looks like a 3.\r\n\r\nPlease leave feedback and any reports of misspellings, misinformation or anything of the sort.\r\n\r\nSide Note: Instead of upload three separate ESPs for Vanilla, Dawnguard and Dragonborn, I have instead labeled the locations appropriately in the books. This way one mod isn\\'t taking up three ESP slots. You can see in the photos how I have done this. \r\n",
  "categoryId": "28",
  "version": "V1.0",
  "author": "Aurora555",
  "createdUnix": "1360959641",
  "updatedUnix": "1360952601",
  "containsAdultContent": false,
  "uploadedBy": "Aurora555",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010097",
      "name": "Information Books",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Information Books-31714-V1-0.7z",
      "uploadedUnix": "1360952601",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3082f480ccd39b64aaeb0a691ce64fd17d353b3acf6e6a60907ecd7322457036/analysis/1407419113/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Information%20Books-31714-V1-0.7z?fid=1000010097&ttl=1535807460&ri=8192&rs=8192&setec=ce2be3cb95a5fb8103b7caa63d14c544"
    }
  ]
}