{
  "modId": 31713.0,
  "modName": "Dragon Priests Estate With Nordic Ruin Basement",
  "summary": "Dragon Priests Estate is a house owned by a dragon priest at the old times",
  "descriptionHtml": "The first time i got to high hrothgar i said ohh my god i love this place i hope bethesda will make me live here with the greybeards to help me with my shout training.Well that never happened :P\r\nso i made a house at High Hrothgar courtyard and thats it\\'s story\r\n\r\nWhen dragon priests had the world on their feet and dragons were killing everyone they saw,one dragon priest had an idea to make a house near the throat of the world to have his dragon masters always pleased to give him more power and gifts.His thought took flesh and bones and he forced people to build him the house he once dreamed.\r\n\r\nThe dragon priest\\'s house completed after some years(working was hard up there because of the cold and the snow)but alduin was sent to oblivion because his enemies used an Elder Scroll and the dragon priest never had a chance to enjoy his house,they killed him inside his new house and his body and soul still guards the place\r\n\r\n                                                            The End\r\n\r\nPs. You Have To kill the Dragon Priest who sleeps in the yard of the house and take the key to get  inside :) He still guards it with his life !!!\r\n\r\nThe mod adds a house at high hrothgar\\'s courtyard and the house contains everything a player will need \r\nContains:\r\nBlackmith\\'s forge\r\nArcane Enchanter\r\nAlchemy Workbench \r\n5 Large Display Cases\r\nSpecial Trophy Room\r\nFireplace For Cooking\r\nChest With ingots(50 of each kind)\r\nSharpening Wheel\r\nTanning Rack\r\nArmorWorkbench\r\n6 Mannequin\r\nWorking Dragon Priest Mask Altar\r\nAll 9 God Shrines\r\n2 Safes\r\n\r\n                                                          1st Update adds\r\nBases at mannequin\r\nMore trophies in the trophy room\r\nMap marker and now you can fast travel to it \r\n\r\n                                                            2nd Update adds\r\nSmelter\r\nOptimization\r\nBetter Navmesh\r\nNordic Ruin at the basement of the house(yeah you heard right!A small nordic ruin at the basement||see the images||)\r\n\r\nI still cant fix dragon priest bug so until i fix it when the dragon priest awakes if he stuck in the wall open the concole window with \\\"~\\\" target the dragon priest,type \\\"kill\\\" and press enter :D\r\n\r\n\r\nI ll continue updating the mod when i have free time :) Plz report to me any bug or anything ugly you see in the house or outside of it and dont be afraid to ask anything you want me to add  \r\n\r\nPlease never use my mods for your purposes unless i give you permission to do that.\r\n\r\nAll pictures and mods are made exclusive by me.",
  "categoryId": "67",
  "version": "V0.4",
  "author": "Butcherakos",
  "createdUnix": "1360953050",
  "updatedUnix": "1361538742",
  "containsAdultContent": false,
  "uploadedBy": "butcherakos",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012072",
      "name": "Dragon Priests Estate",
      "version": "V0.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "259",
      "fileName": "Dragon Priests Estate-31713-V0-4.rar",
      "uploadedUnix": "1361538742",
      "modVersion": "V0.4",
      "virusScanUrl": "https://www.virustotal.com/file/d1b3233747021298357a09298431aba873f1530edae2ace6de499f318a5f5235/analysis/1407432904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Priests%20Estate-31713-V0-4.rar?fid=1000012072&ttl=1535807459&ri=8192&rs=8192&setec=b3ff00bec6d233d187aa281f2660281a"
    }
  ]
}