{
  "modId": 31720.0,
  "modName": "Reworked and NEW College Of Winterhold",
  "summary": "New npc\\'s new interesting interaction marker\\'s!, renovated rooms!, more of a college feel to it and most of all makes the college alot more diverse! ",
  "descriptionHtml": "2.0 is now up and running :P !\r\n__________________________________________________________\r\n\r\n\r\nCOMING UP IN 2.0: I\\'m editing the Hall Of Countenance next! ... any specific things you good peoples want let me know in the comments section!\r\n\r\nThings added so far: \r\nAlchemical Vendor\r\nNew Shrine of Magnus, the shrine is a small Ball of Magnus and the blessing you get is actually the blessing of Magnus :P\r\nNew book vendor .. i have also increased the value of rare books so it gives you more of a feel of collecting valuable books .. or simply selling them :P\r\n________________________________________________________________\r\nVersion 1.5 Changelog: The rooms in the Hall of Attainment now have doors for each npc and player, there are more lighting, candels, decoration and better scenery!  \r\n\r\nWhen i first got to the college, well i was, you could say i was impressed but after play through and more play through well .. it just dosnt have that college feel to it .. i mean it dosnt have cooking facilities.. it dont have any armoury tools what so ever so you have to leave your new home to do pretty much 60% of other stuff in skyrim. You will notice a journal in your room .. that is just .. a cool thing to read although i might link it to some sorta treasure finding thing some time in the future.\r\n\r\nso in this mod i set out to improve the feel to it, i my self needed cooking facilities because i was using the needs and diseases mod so i need to cook my meat ect and then i thought i might as well improve the entire college.\r\n\r\nThings iv changed and created:\r\nAdded 8 new npc\\'s five in the Arcanaeum and 4 in the Hall of Attainment\r\nAdded candle lighting and fireplace lighting aswell as actual fireplaces and candles to make the college rooms more \\\"homey\\\" and magical.\r\nAll npc\\'s have AI packages so the researchers in the Arcanaeum will read books all day as they are researchers, the npc\\'s in the Hall of Attainment will act like students .. sleep .. read books when there not sleeping :L.. yes for now they tend to sleep abit to much ill try and change that  in the next update.\r\nsmall changes with furniture ect.\r\n\r\nCompatibility: This mod should work with Sexy Winterhold and will work with any Arch mage quarters mod as i havnt edited the arch mages room because theres already a good mod that does that :P\r\n\r\nInstallation: Simply put this in your date directory.\r\n\r\nCheers: Elvenheroin, thanks  for the screenshots :)",
  "categoryId": "68",
  "version": "2.0",
  "author": "Lok195",
  "createdUnix": "1360962386",
  "updatedUnix": "1362674777",
  "containsAdultContent": false,
  "uploadedBy": "lok195",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000015705",
      "name": "New College",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "85",
      "fileName": "New College-31720-2-0.rar",
      "uploadedUnix": "1362674777",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a4c63883ce91000042c31f4e0463b59fef79852dddd58555086090323dc3759f/analysis/1407457385/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20College-31720-2-0.rar?fid=1000015705&ttl=1535807468&ri=8192&rs=8192&setec=e32f26043ec989b45c03b4c77d6441fe"
    }
  ]
}