{
  "modId": 31745.0,
  "modName": "The Normans - Skyrim Edition",
  "summary": "Sequel to my mod for Oblivion, allows you to play as a Norman Knight from 1066 Earth history. Includes armour, weapons, a short quest-line, a player home and of course your faithful destrier: Plunderboss.",
  "descriptionHtml": "[img]http://users.eastlink.ca/~aaronbabcock/NormansTitle.png[/img]\r\n\r\n[b][color=Red]NOTE: For those players who would like to skip the mini-quest and simply get the armour and weapons, all items are craftable using a blacksmith\\'s forge.\r\n\r\nNEW in 2.0: Your very own Norman Keep player home north of Whiterun (northwest of Dragonsreach, almost due west of Whitewatch tower). Key required for access. Key found in same place where you retrieve your Norman Armour.[/color][/b]\r\n\r\n[i]\\\"The Normans... are a race inured to war, and can hardly live without it; rushing against the enemy, and, where force fails of success, ready to use stratagem or to corrupt by bribery.\\\"[/i] - William of Malmesbury\r\n\r\nThis is the sequel to my mod for Oblivion. It allows you to play as a Norman Knight from 1066 Earth history. Includes armour, weapons, a short quest-line and of course your faithful destrier: Plunderboss.\r\n\r\n[color=Goldenrod][b]Fictional Background[/b][/color]\r\n\r\nDuring the Oblivion crisis, you, the Norman Knight, were snatched by some unknown force straight from the battlefield at Hastings and teleported across time and space to appear in the world of Tamriel. You became the hero of Kvatch and helped Martin Septim ascend to the Emperor\\'s throne in time to destroy Mehrunes Dagon. But the sweet taste of victory was short lived. Soon you were snatched again and hurled hundreds of years into the future to face a new threat: Alduin, lord of the Dragons. Will you, Norman Knight, have what it takes to overcome the return of the Dovah? The rest is up to you.\r\n\r\n----------------------------------------------------------------------------\r\n\r\nThe Normans: Skyrim Edition v. 1.0 (March 2013)\r\nby B5_IcePick\r\n\r\n----------------------------------------------------------------------------\r\n\r\n[color=Goldenrod][b]INDEX[/b][/color]\r\n\r\n1. What this mod does.\r\n1.1 Changelog\r\n2. Why?\r\n3. How to Play\r\n4. INSTALL\r\n5. Known Issues / Deficiencies\r\n6. Disclaimer / Usage\r\n7. Credits\r\n8. Permissions\r\n\r\n----------------------------------------------------------------------------\r\n\r\n[color=Goldenrod][b]1. What this mod does:[/b][/color]\r\n\r\n----------------------------------------------------------------------------\r\n\r\nThis mod adds a new custom playable race called the \\\"Normans\\\" with armour, equipment, and a horse sidekick named \\\"Plunderboss\\\" (he\\'s essential, therefore unkillable). NOW INCLUDING your very own Norman Keep as a player home. There\\'s also a very brief quest to explain why a Norman from 11th century Earth is even in Skyrim and to lead you to where you can retrieve your stolen arms and armour. See section 3 \\\"How to play\\\" and section 5 \\\"Known issues\\\" for further information.\r\n\r\n----------------------------------------------------------------------------\r\n\r\n[color=Goldenrod][b]1.1 Changelog[/b][/color]\r\n\r\n----------------------------------------------------------------------------\r\n\r\nCurrent version is 2.0. Now includes a player home, your very own Norman Keep, northwest \r\nof Whiterun overlooking the guard tower north of town. Entrance requires a key, found in \r\nthe chest containing your equipment (if you followed the short quest at the start of the \r\nmod).\r\n\r\nIMMEDIATE PLANS: To design and include several more optional shield textures.\r\n\r\n----------------------------------------------------------------------------\r\n\r\n[color=Goldenrod][b]2. Why?[/b][/color]\r\n\r\n----------------------------------------------------------------------------\r\n\r\nI\\'ve always had a keen interest in medieval history, and in 2007 my study of the Normans inspired me to bring them to life in Oblivion for my own personal enjoyment, which I in turn decided to share with the community. \\\"The Normans: Skyrim Edition\\\" is my long planned sequel to the story I started in my original Oblivion mod ([url=http://oblivion.nexusmods.com/mods/10490/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D10490]http://oblivion.nexusmods.com/mods/10490/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D10490[/url]).\r\n\r\nInterested in learning more about the real Normans? Here\\'s a little taste of this fascinating people and time period that inspired my mod: [url=http://www.youtube.com/watch?v=oLy1LskT6Y8]http://www.youtube.com/watch?v=oLy1LskT6Y8[/url]\r\n\r\n----------------------------------------------------------------------------\r\n\r\n[color=Goldenrod][b]3. How to Play[/b][/color]\r\n\r\n----------------------------------------------------------------------------\r\n\r\nIn order to play as a Norman and play the mini-quest, you must create a new character and choose the Norman custom race. The short quest explaining the premise and leading you to retrieve your Norman armour, weapons and destrier (warhorse) Plunderboss is integrated into the character creation / opening of the main game itself, and for the full experience cannot be avoided.\r\n\r\nQuest is activated by talking to a ghost standing near the exit of the Helgen Keep cavern system.\r\n\r\nTo access your own Norman Keep you will need the key, located in the same location where \r\nyour armour is found.\r\n\r\n[b][color=Red]NOTE: For those players who would like to skip the mini-quest and simply get the armour and weapons, all items are craftable using a blacksmith\\'s forge.[/color][/b]\r\n\r\nSince this mod is designed to bring the life of a Norman Knight to Skyrim, none of the Armour exists for female characters. As yet I have not created a female set of armor to go with the quest to recover your stolen armour, so if you play as a female Norman you won\\'t be able to use the armour (well, it will look really weird, anyway). Since the mod is inspired by real history, I do not plan to create a female version of the armour. Sorry if this appears sexist or offends you; my intention was not to do either of those things. Though this is fiction, my inspiration was from real history, and since there weren\\'t any female Norman warriors in the time period the armour comes from I don\\'t plan to make any.\r\n\r\n----------------------------------------------------------------------------\r\n\r\n[color=Goldenrod][b]4. INSTALL[/b][/color]\r\n\r\n----------------------------------------------------------------------------\r\n\r\nNexus Mod Manager: [url=http://wiki.tesnexus.com/index.php/How_to_install_Skyrim_mods]http://wiki.tesnexus.com/index.php/How_to_install_Skyrim_mods[/url]\r\n\r\nManual install: Extract the contents of the archive INSIDE your Skyrim/Data folder. Launch the game, and on the splash screen click \\\"DATA\\\" and make sure the mod is checked on the list. Click play button. To uninstall, delete TheNormansSkyrim.bsa and TheNormansSkyrim.esp from your Data folder.\r\n\r\nIf you have any problems installing this, there are plenty of other mods out there and FAQ pages that can explain in detail how to install a mod for Skyrim. Teach yourself, I did.\r\n\r\n----------------------------------------------------------------------------\r\n\r\n[color=Goldenrod][b]5. Known Issues / Deficiencies[/b][/color]\r\n\r\n----------------------------------------------------------------------------\r\nDue to a bug in the Skyrim engine itself, torch lights will periodically turn off by \r\nthemselves when the player changes the viewing angle. I have exhausted my efforts in \r\nremedying that bug and from what I can surmise it is indicative to the engine itself and \r\nthere is no good fix for it presently.\r\n\r\nFor some reason, on certain test plays many of the eyebrow and eye options (and sometimes even hairstyles) were not available during the character creation sequence. I am still trying to figure out why and will fix it as time permits.\r\n\r\nFIXED - There\\'s a problem with the lighting shading on the Norman arrows quiver in some environments - I plan to attempt to fix this when time permits. - FIXED\r\n\r\nThis mod was developed using version 1.8.150.0 of the Creation Kit and the most current version of Skyrim (as of 1.8), and has only been play tested as such.\r\n\r\nOtherwise there are no known issues of conflicts at this time, however, if anyone discovers any please PM me, or mention it in the comments section of this page, and I will attempt to fix them if/when I have time.\r\n\r\n----------------------------------------------------------------------------\r\n\r\n[color=Goldenrod][b]6. Disclaimer / Usage[/b][/color]\r\n\r\n----------------------------------------------------------------------------\r\n\r\nBack up your save games prior to installing 2.0 in case there are any issues!\r\n\r\nPlease read section 5 in detail.\r\n\r\nAs with any other user created mod, use at your own risk and backup your save games before install. If you choose to install this mod, you do so taking sole responsibility and risk for any problems it may cause. The Author will not be held responsible in any way.\r\n\r\n---------------------------------------------------------------------------\r\n\r\n[color=Goldenrod][b]7. CREDITS[/b][/color]\r\n\r\n---------------------------------------------------------------------------\r\n\r\nBethesda Game Studios  for the game, Creation Kit and use of some of the vanilla meshes and textures in which to make parts of my custom armour.\r\n\r\nMY DEEPEST THANKS and eternal gratitude to all those who developed tools for working with \r\nNIF files, especially the developers of NifCovert and Chunkmerge without whose genius my \r\ndream of building my very own Norman Keep in Skyrim would never have been realized.\r\n\r\n[b]Croc[/b] - for access to his awesome Viking Armor mod (which I in turn did not actually end up using in \\\"The Normans: Skyrim Edition\\\" after all), and for his invaluable and selfless effort in helping to get some of my models working. Thanks so much Croc! - [url=http://skyrim.nexusmods.com/mods/30647/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D30647]http://skyrim.nexusmods.com/mods/30647/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D30647[/url]\r\n\r\nZira for horse textures created for \\\"Zira Skyrim Horse Base\\\" - [url=http://skyrim.nexusmods.com/mods/19710/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D19710]http://skyrim.nexusmods.com/mods/19710/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D19710[/url]\r\n\r\nHolugar for \\\"Requested horse body mesh\\\" [url=http://skyrim.nexusmods.com/mods/15449/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D15449]http://skyrim.nexusmods.com/mods/15449/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D15449[/url]\r\n\r\nM1LL3R BOY - without whose YouTube Tutorials I never could have created my short introductory quest.\r\n\r\nIF I HAVE INADVERTENTLY OVERLOOKED SOMEONE please know it was completely unintentional. Please PM me and I will rectify the oversight as soon as I receive the message. Thanks!\r\n\r\n---------------------------------------------------------------------------\r\n\r\n[color=Goldenrod][b]8. Permissions[/b][/color]\r\n\r\n---------------------------------------------------------------------------\r\n\r\nIf you would like to use any of the assets I\\'ve created in your own mod (which include: Norman helmet and modified coif, Norman Sword, Viking Sword, Norman \\\"kite\\\" shield, Viking Duke helmet, and their textures, and Norman Keep architectural components and their textures, as well as re-textures of existing meshes by Bethesda and various modders) please send me a PM with a description of how you propose to use it and I will decide on whether to grant permission for its use. Acceptance is conditional on me being given due credit in description and ReadMe and a linkback to this mod page on the Nexus. Also conditional will be that it may NOT be published on Steam or any other site other than the Nexus.\r\n\r\n\r\n",
  "categoryId": "34",
  "version": "2.0",
  "author": "B5Icepick",
  "createdUnix": "1362099296",
  "updatedUnix": "1365271665",
  "containsAdultContent": false,
  "uploadedBy": "b5icepick",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013803",
      "name": "The Normans Skyrim Edition - Main File",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "67991",
      "fileName": "The Normans Skyrim Edition - Main File-31745-1-0.7z",
      "uploadedUnix": "1362023958",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/54d3d92dfbe9cd853925a385e9e56af462f3c3ce73a55390c56bd4bf2ed2e7b0/analysis/1407443628/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Normans%20Skyrim%20Edition%20-%20Main%20File-31745-1-0.7z?fid=1000013803&ttl=1535807521&ri=8192&rs=8192&setec=f6fc3b49efd10611b8efcb64eb7e087d"
    },
    {
      "fileId": "1000022868",
      "name": "The Normans Skyrim Edition version 2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "157150",
      "fileName": "The Normans Skyrim Edition version 2-31745-2-0.7z",
      "uploadedUnix": "1365271665",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/6d1e64e8982a34282a5c6243ff8d868fd92450947bed92624740f0fed0180b47/analysis/1407509889/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Normans%20Skyrim%20Edition%20version%202-31745-2-0.7z?fid=1000022868&ttl=1535807521&ri=8192&rs=8192&setec=24f96e3967ff70ea03b14f4de7c66807"
    }
  ]
}