{
  "modId": 31758.0,
  "modName": "Wet and Cold - German Translation",
  "summary": "Deutsche Uebersetzung von Wet and Cold von isoku.\r\nAktuellste Version: 1.20\r\nDeutsche Uebersetzung von Wet and Cold - Ashes von isoku.\r\nAktuellste Version: 1.04",
  "descriptionHtml": "[center][img]http://www.abload.de/img/wetandcoldejjjr.png[/img][/center]\r\n\r\n[size=+2][color=#66CCCC]Status:[/color][/size]\r\n\r\nDeutsche Übersetzung der Mod [url=http://skyrim.nexusmods.com/mods/27563]Wet and Cold[/url] von isoku\r\nAktuellste Version: [b]1.20[/b]\r\nLetzte Übersetzungsänderungen am: 13.05.2013\r\n\r\n[b]Vergesst nicht isoku ein Endorsement zu geben![/b]\r\n\r\nDas englische Original wird nicht benötigt. Alle Dateien sind in diesem Download hier enthalten.\r\n\r\nDie Diskussion ist [url=http://forum.scharesoft.de/showthread.php?46511-Wet-and-Cold-DV-(N%E4sse-und-K%E4lte)]hier[/url] zu finden.\r\n\r\n[size=+2][color=#66CCCC]Abhängigkeiten:[/color][/size]\r\n\r\n[color=#CCCCFF]Addons[/color]: [url=http://skyrim.nexusmods.com/mods/31968]Wet and Cold - Ashes[/url]\r\nFügt Wet and Cold-Unterstützung für das Dragonborn-DLC hinzu und simuliert Effekte bezogen auf die Auswirkungen von Asche. [b]Mehr Infos zum Add-On gibt es weiter unten auf hier dieser Seite.[/b]\r\n\r\n[color=#33FFCC]Erfordert[/color]: Skyrim 1.9.29.0.8+\r\n[color=#9999CC]Optional[/color]: [url=http://skse.silverlock.org]SKSE[/url] 1.6.5+\r\nSKSE wird nur benötigt damit das Equipment-Feature funktioniert.\r\n[color=#9999CC]Optional[/color]: [url=http://skyrim.nexusmods.com/mods/11163]Frostfall - Hypothermia Camping Survival[/url] 2.0+\r\nReisende NPCs werden mit Wahrscheinlichkeit Ausrüstung und Gegenstände aus Frostfall bei sich tragen. SKSE wird dazu nicht benötigt.\r\n[color=#9999CC]Optional[/color]: [url=http://skyrim.nexusmods.com/mods/13486]Winter Is Coming - Cloaks[/url]\r\nWenn eines der Haupt-Plugins installiert ist, ziehen sich NPCs in kalten Regionen Umhänge aus dieser Mod an. [[color=#33FFDD]SKSE[/color]]\r\n[color=#9999CC]Optional[/color]: [url=http://skyrim.nexusmods.com/mods/12092]Cloaks of Skyrim[/url]\r\nWenn eines der Haupt-Plugins installiert ist, ziehen sich NPCs bei Regen Umhänge aus dieser Mod an. [[color=#33FFDD]SKSE[/color]]\r\n[color=#9999CC]Optional[/color]: [url=http://skyrim.nexusmods.com/mods/17802]Project Reality - Climates Of Tamriel - Weather - Lighting - Audio[/url]\r\nIst die Winter-Edition installiert, so wird ganz Himmelsrand als kalt eingestuft. Wird dieses Modul deinstalliert, wird Wet and Cold wieder auf die Standardeinstellungen zurückgesetzt.\r\n\r\n[size=+2][color=#66CCCC]Kompatibilität:[/color][/size]\r\n\r\n[list]\r\n[*]Wenn du Frostfall 2.0+ verwendest, führe Frostfalls Kompatibilitätsassistenten zu Wet and Cold aus.\r\n[*]Wenn du Get Snowy verwendest, werden die Verschneit-Effekte von Wet and Cold automatisch deaktiviert.\r\n[*]Wenn du Convenient Horses verwendest, werden die Pferde deiner Begleiter nicht bei Nässe tropfen oder Atem aushauchen, außer du führst den Konsolenbefehl \\\"setghost 0\\\" an ihnen aus.\r\n[*]Es wurden keine Vanilla-Records umgeändert, außer den Sound-Descriptors AMBrWindMountainGustA und B.\r\n[*]Alle Funktionen dieser Mod werden dynamisch ausgeführt. Es sollte also bei jedem NPC in jeder Gegend funktonieren (DLC, neue Regionen, neue Städte etc.). Davon ausgenommen sind die Kältefunktionen. Obwohl die Kältefunktionen ebenfalls dynamisch ausgeführt werden, müssen Kreaturen und Regionen aus neuen Mods oder DLCs manuell eingestellt werden.\r\n[*]Kälte-Effekte werden von Kreaturen und Regionen aus Dawnguard, Dragonborn (benötigt Wet and Cold - Ashes) und [url=http://skyrim.nexusmods.com/mods/25704]Wyrmstooth[/url] unterstützt.\r\n[/list]\r\n[size=+2][color=#66CCCC]Überblick:[/color][/size]\r\n\r\nDiese Modifikation simuliert im Spiel Nässe- und Kälte-Effekte. Sie betrifft sämtliche NPCs, Kreaturen und sonstige Akteure im Spiel, sofern nicht anders angegeben. Einige Funktionen setzen den [url=http://skse.silverlock.org/]Skyrim Script Extender (SKSE)[/url] voraus. Einfach zu folgende Anleitungen zur Installation von SKSE sind [url=http://static.skyrim.nexusmods.com/mods/images/27563-1-1356906123.jpg]hier[/url] zu finden, oder [url=http://www.youtube.com/watch?v=xTGnQIiNVqA]hier[/url].\r\n\r\n[list]\r\n[*]Passe die Einstellungen mittels deines magischen \\\"[color=#66CC99]Nässe und Kälte-Eiszapfens[/color]\\\" an. Es lässt sich auch als Dekoration an einen beliebigen Ort platzieren. Bei diesem Eiszapfen handelt es sich nicht um einen Quest-Gegenstand. Solltest du ihn verlieren, kannst du ihn mit Eisgeist-Zähnen an einer Schmelzhütte wiederherstellen.\r\n[*]Wenn SkyUI 3.0+ und SKSE 1.6.6.+ installiert sind, verschwindet der Eiszapfen aus deinem Inventar. Die Einstellungen können dann im Mod-Konfigurationsmenü (MCM) getätigt werden.\r\n[/list]\r\n\r\n[color=#66CC99][b]Tropfen bei Nässe:[/b][/color]\r\n[url=http://static.skyrim.nexusmods.com/mods/images/27563-1-1355300844.gif]Tropfen-Effekte[/url] erscheinen bei den Akteuren während dem Regen und nach dem Schwimmen. Das Tropfen hört auf, sobald man sich unter eine Überdachte Struktur begibt. Nach dem Schwimmen werden auch Tropf-Geräusche zu hören sein.\r\n\r\n[color=#66CC99][b]Sichttrüben durch Regentropfen:[/b][/color]\r\nBeim Hochschauen während eines Regens trüben dir Regentropfen zeitweise die Sicht.\r\n\r\n[color=#66CC99][b]Nach Hause gehen:[/b][/color]\r\nZivile NPCs gehen zurück in ihre Häuser sobald es anfängt zu regnen. Erwachsene werden sich eilig bewegen, Kinder werden laufen. Argonier, Bettler und Arbeiter werden weiterhin draußen bleiben. Sollte ein NPC keine Wohnung in der Nähe haben, geht er in eine Gaststätte.\r\n\r\n[color=#66CC99][b]Regenkleidung:[/b][/color][[color=#33FFDD]SKSE[/color]]\r\nSämtliche NPcs, ausgenommen Argonier und Bettler, ziehen sich bei einem Regen ihre Regenkapuzen an, sofern ihre Rüstungsslots frei sind. Die Kapuzen werden nicht direkt abgenommen sobald der Regen aufhört. Jeder NPC wird seine Kapuze stattdessen irgendwann im Laufe der nächsten Minuten ausziehen, ganz willkürlich. Wenn du die Regenkleidung auch für Begleiter aktiviert hast, einen bestimmten Begleiter jedoch von dieser Funktion befreien möchtest, kannst du am Kochtopf eine \\\"Nasse Schneebeere\\\" herstellen und diese deinem Begleiter ins Inventar legen.\r\n\r\n[color=#66CC99][b]Atemhauch in kalten Regionen:[/b][/color]\r\nIn eisigen Regionen, Verschneite oder Küstenregionen, wird sichtbar [url=http://static.skyrim.nexusmods.com/mods/images/27563-2-1355300845.gif]feuchter Atem ausgeatmet[/url]. In Tundren und Sumpfgebieten wird bei Nacht auch ein wenig Atemhauch zu sehen sein. Wenig Atemhauch erscheint in regelmäßigen Abständen aus der Nase, während etwas mehr Atem beim Sprechen aus dem Mund gehaucht wird (bei NPCs), beim Rennen, Sprinten und auch beim Kämpfen. Folgende Kreaturen werden unterstützt: Riesen, [url=http://static.skyrim.nexusmods.com/mods/images/27563-3-1355300845.gif]Pferde[/url], Hunde, Wölfe, Bären, (Tal)Säbelzahntiger, Falmer, Trolle, [url=http://static.skyrim.nexusmods.com/mods/images/27563-5-1355300845.gif]Drachen[/url], Kühe und Hexenraben. Atemhauch wird nicht vorkommen, wenn der Spieler sich an einer Wärmequelle befindet, oder ein Vampir ist.\r\n\r\n[color=#66CC99][b]Verschneit:[/b][/color]\r\nSchnee wird sich während eines Schneesturms an Kleidung und Haaren absetzen. Der Effekt tritt ebenfalls nach dem Schwimmen in kalten Regionen auf. Kreaturen werden aber nicht mit Schnee eingedeckt, es sei denn sie sind tot. In der Nähe von Wärmequellen wird schmilzt der Schnee weg. Gleiches gilt für tote Körper.\r\n\r\n[color=#66CC99][b]Starke Winde:[/b][/color]\r\nWenn du oder NPCs in einen Schneesturm geraten (Wetterklassifikation: Verschneit und Windgeschwindigkeit > 0.5), verringert sich die Bewegungsgeschwindigkeit um 15%. Die Windlautstärke wurde bei Schneestürmen und in Bergregionen erhöht.\r\n\r\n[color=#66CC99][b]Sichttrübung in Schneestürmen:[/b][/color]\r\nSchnee der dir ins Gesicht fliegt wird dir kurzzeitig die Sicht trüben. Halte dein Gesicht nach unten, um dies zu verhindern. Diese Funktion ist für den Spieler standardmäßig deaktiviert. NPCs werden Schwierigkeiten haben, Ziele während eines Schneesturms auszumachen.\r\n\r\n[color=#66CC99][b]Nach Hause gehen:[/b][/color]\r\nDie meisten zivilen NPCs werden eilig zu ihren Häusern zurückkehren sobald ein Schneesturm aufzieht. Sollte ein NPC keine Wohnung in der Nähe haben, geht er in eine Gaststätte.\r\n\r\n[color=#66CC99][b]Kälteausrüstung:[/b][/color][[color=#33FFDD]SKSE[/color]]\r\nSämtliche NPCs, ausgenommen Bettler, werden sich Kapuzen und Handschuhe in kalten Regionen anziehen, sollten ihre Rüstungsslots frei sein. Dank ihrer unglaublichen Resistenz gegen Kälte, werden Nord nur nachtsüber dazu veranlasst warme Kleidung anzuziehen. NPCs werden automatisch WIC-Umhänge ausziehen wenn sie sich hinsetzen, und anziehen wenn sie aufstehen. (Um das fürchterliche Clipping zu verhindern.) Anmerkung: Wenn eine Werkbank oder ähnliches von NPCs benutzt wird, gilt dies ebenfalls als \\\"Sitzen\\\". Wenn du die Kälteausrüstung auch für Begleiter aktiviert hast, einen bestimmten Begleiter jedoch von dieser Funktion befreien möchtest, kannst du am Kochtopf eine \\\"Kalte Schneebeere\\\" herstellen und diese deinem Begleiter ins Inventar legen.\r\n\r\n[color=#66CC99][b]Überlebensausrüstung:[/b][/color][[color=#33FFDD]SKSE[/color]]\r\nSämtliche NPCS, ausgenommen Begleiter, werden sich Rucksäcke anlegen, wenn sie außerhalb von Städten und Siedlungen wandern. Kuriere werden stets Rucksäcke tragen, unabhängig davon ob sie sich in Städten oder Siedlungen befinden. Fellrucksäcke werden überwiegend in kälteren Regionen anzutreffen sein. In wärmeren Gebieten werden Lederrucksäcke getragen. Lederrucksäcke werden automatisch an Fellumhänge angepasst, um Clipping zu verhindern. Diese Funktion betrifft nicht NPCs die ihre Umhänge über Leveled-Lists erhalten.\r\n\r\n[size=+2][color=#66CCCC]Empfohlene Mods:[/color][/size]\r\n\r\n[list]\r\n[*][url=http://skyrim.nexusmods.com/mods/9514]Open Faced Guard Helmets[/url] oder [url=http://skyrim.nexusmods.com/mods/16886]Friendly Guard Helmets[/url]\r\nBenutze eines von beiden wenn du Clipping zwischen Atem und Helmen vermeiden möchtest. Funktioniert beides auch mit [url=http://skyrim.nexusmods.com/mods/8943]Diverse Guards Skyrim[/url], um Wachen eine Vielzahl von Gesichtern zu verpassen.\r\n[*][url=http://skyrim.nexusmods.com/mods/19660]Get Snowy[/url]\r\nAlternative zum Schnee-Effekt von Wet and Cold.\r\n[*][url=http://skyrim.nexusmods.com/mods/23906]Run For Your Lives[/url] und [url=http://skyrim.nexusmods.com/mods/28235]When Vampires Attack[/url]\r\nNPCs suchen Schutz bei Drachen- und Vampirangriffen.\r\n[*][url=http://skyrim.nexusmods.com/mods/24020]Brawl Bugs Patch[/url]\r\nWurde in diese Mod bereits integriert. Beseitigt jedoch auch andere Fehler von Mods die ein Cloak-Effekt auf NPCs anwenden.\r\n[*][url=http://www.scharesoft.de/elder-scrolls/tes-v-skyrim/skyrim-directors-cut.html]Skyrim Director\\'s Cut[/url]\r\nDeutsche Übersetzung der inoffiziellen Patches sowie viele zusätzliche Textverbesserungen und deutsche Texturen.\r\n[/list]\r\n\r\n[color=#404040][Line][/color]\r\n\r\n[center][img]http://www.abload.de/img/wacasheszjsmx.png[/img][/center]\r\n\r\n[size=+2][color=#CC9966]Status:[/color][/size]\r\n\r\nDeutsche Übersetzung der Mod [url=http://skyrim.nexusmods.com/mods/31968]Wet and Cold - Ashes[/url] von isoku\r\nAktuellste Version: [b]1.04[/b]\r\nLetzte Übersetzungsänderungen am: 13.05.2013\r\n\r\n[b]Vergesst nicht isoku ein Endorsement zu geben![/b]\r\n\r\nDas englische Original wird nicht benötigt. Alle Dateien sind in diesem Download hier enthalten.\r\n\r\n[size=+2][color=#CC9966]Abhängigkeiten:[/color][/size]\r\n\r\n[color=#C7CC5D]Erfordert[/color]: Skyrim 1.9.29.0.8+\r\n[color=#C7CC5D]Erfordert[/color]: Dragonborn\r\n[color=#C7CC5D]Erfordert[/color]: [url=http://skyrim.nexusmods.com/mods/27563]Wet and Cold[/url] 1.20+\r\n[color=#CC4440]Dieses Add-On wird erst erkannt sobald ein Spielstand geladen wird auf dem die Version [b]1.20+[/b] von Wet and Cold installiert ist.[/color]\r\n\r\n[color=#B49599]Optional[/color]: [url=http://skse.silverlock.org]SKSE[/url] 1.6.5+\r\nSKSE wird nur benötigt damit das Equipment-Feature funktioniert und für die Konfiguration der Mod im MCM.\r\n\r\n[size=+2][color=#CC9966]Kompatibilität:[/color][/size]\r\n\r\n[list]\r\n[*]Modifikationen die das Wetter auf Solstheim ändern, müssen nach dieser ESP geladen werden.\r\n[*]Wenn Get Snowy installiert ist, wird der Staub-Shader vom Schnee-Shader bei Aschestürmen überschrieben.[/list]\r\n\r\n[size=+2][color=#CC9966]Überblick:[/color][/size]\r\n\r\nDieses inoffizielle, offizielle Add-On erweitert Wet and Colds Funktionen für das Solstheim-Gebiet und simuliert Effekte bezogen auf die Auswirkungen von Asche. Um einen Aschesturm zu aufzurufen, wende den Konsolenbefehl \\'fw XX032336\\' an, wobei XX die Nummer der Ladereihenfolge von Dragonborn.esm ist (beispielsweise 04 wenn du alle DLCs hast). Die Anleitungen zur Installation, Aktualisierung und Fehlerbehebung sind die selben wie auch bei Wet and Cold.\r\n\r\n[b]Weshalb ein separates Add-On?[/b]\r\n[list][*]Durch die Verwendung der Dragonborn.esm als Masterfile für das Ashes-Plugin, kann mit Hilfe von Spell-Conditions der Standort des Spielers auf Solstheim erfasst werden. Auf diese Weise muss keine zusätzliche Last auf das Skripting-System ausgeübt werden.\r\n[*]Einige Funktionen dieses Add-Ons gehen über das Aufgabenfeld von Wet and Cold hinaus, welches sich lediglich auf das Verhalten von Akteuren auf nässe- und kältebezogenen Ereignissen beschränkt. Die Verwendung des bereits bestehenden Fundaments von Wet and Cold und der Verzicht auf eine Standalone-Mod resultiert in weniger Arbeit für den Autor und in weniger Skripte für den Nutzer. Mit Hilfe von Add-Ons lassen sich Mods veröffentlichen, die von Wet and Colds eigentlichen Zwecken abweichen  und trotzdem auf die Skripte zugreifen können, welche bereits bei Spielern installiert sind.[/list]\r\n\r\n[b][color=#FBFFC9]Nässe und Kälte:[/color][/b]\r\nWet and Cold erkennt die kalten Regionen auf Solstheim. Die nördliche Hälfte von Solstheim ist die ganze Zeit über Kalt. Die südliche Hälfte wird nachtsüber kalt.\r\n\r\n[b][color=#FBFFC9]Aschestürme:[/color][/b]\r\nIn Rabenfels sind Aschestürme möglich. Zusätzlich wurden die Chancen für das Auftreten von Aschestürmen leicht erhöht. Das Wetter selber wird nicht verändert. Diese Option bleibt Wettermods überlassen.\r\n\r\n[b][color=#FBFFC9]Aschekleidung:[/color][/b][[color=#FFFF66]SKSE[/color]]\r\nNPCs ziehen sich Gesichtschutz und manchmal auch Schutzbrillen an, sollten Aschestürme auftreten und ihre Rüstungsslots frei sein. NPCs werden die Ausrüstung nicht sofort ablegen sobald der Aschesturm aufhöhrt. Die  Ausrüstung wird stattdessen im Laufe der nächsten Minuten ausgezogen.\r\n\r\n[b][color=#FBFFC9]Staubig:[/color][/b]\r\nWährend Aschestürmen wird der ganze Körper sichtbar mit Asche bedeckt. Wenn der Sturm aufgehört hat oder du dich in einem Innenraum befindest, klingt der Effekt im Laufe von 30 Sekunden ab. Der Effekt verschwindet ebenfalls wenn du durch Regen oder Schwimmen nass wirst. Um den Asche-Effekt durch Regen wieder loszuwerden, müssen die Tropfeneffekte oder die Sichttrübung durch Regen aktiviert sein.\r\n\r\n[b][color=#FBFFC9]Tränende Augen:[/color][/b][[color=#FFFF66]SKSE[/color]]\r\nWährend Aschestürmen bringt die fallende Asche deine Augen zum Tränen. Halte dein Gesicht nach unten oder ziehe eine Schutzbrille an. Die Schutzbrille hilft ebenfalls bei Sichttrübung in Regen und Schneestürmen.\r\n\r\n[b]Anmerkungen:[/b]\r\n[list][*]Das Optionsmenü für dieses Add-On wird nach der Installation im Nässe und Kälte-MCM verfügbar sein. Aus Zeitgründen werden Add-Ons nicht über andere Konfigurationsmöglichkeiten verfügen.\r\n[*]Du kannst die Ascheausrüstung für einen bestimmten Begleiter deaktivieren, indem du ihm eine Aschgraue Schneebeere ins Inventar legst. Diese kann mit einer normalen Schneebeere am Kochtopf hergestellt werden.\r\n[*]Der Gesichtsschutz belegt Slot 42 (Diadem-Slot) und die Schutzbrille Slot 56.[/list]\r\n\r\n[size=+2][color=#66CCCC]Fehlerbehebung:[/color][/size]\r\n\r\nSiehe [url=https://docs.google.com/document/d/1e7LHLPbLXWMwYCX22zx19zxkLdjGTuj3FvSz0Z3KnAE/edit#]hier[/url].\r\n\r\n[size=+2][color=#66CCCC]Performance:[/color][/size]\r\n\r\nDie Skripte wurden vom Autor so gut wie es geht optimiert und auf Savegame-Bloat getestet.\r\n\r\n[size=+2][color=#66CCCC]Installation:[/color][/size]\r\n\r\nEinfach den NMM benutzen oder die entpackten Dateien manuell in den Data-Ordner schieben.\r\n\r\n[size=+2][color=#66CCCC]Aktualisieren:[/color][/size]\r\n\r\nDiese Mod aktualisiert sich mit jeder neuen Version von selbst. Entferne einfach die alte Version und installiere die Neue. Schnellreisen quer über die Karte wird empfohlen.\r\n\r\n[size=+2][color=#66CCCC]Deinstallation:[/color][/size]\r\n\r\nSpeicher in einem Innenbereich und stell sicher, dass keine Effekte mehr ausgeführt werden. Danach entferne alle Dateien dieser Mod.\r\n\r\n[size=+2][color=#66CCCC]Kontakt, Infos zur Übersetzung und Übersetzungsfehler melden:[/color][/size]\r\n\r\nDiese Mod wurde von [url=http://skyrim.nexusmods.com/users/2463371]isoku[/url] erstellt und von mir lediglich übersetzt. Bei technischen Fragen und Problemen meldet euch auf [url=http://skyrim.nexusmods.com/mods/27563]isokus Originalseite.[/url]\r\n\r\nSollten euch noch Übersetzungsfehler, unschöne Formulierungen, falsche Textstellen oder Ähnliches auffallen, dann schreibt mir bitte in [url=http://forum.scharesoft.de/showthread.php?46511-Wet-and-Cold-DV-(N%E4sse-und-K%E4lte)]diesem Diskussionsforum[/url]\r\n\r\nDie Übersetzung wurde mit Hilfe von [url=http://skyrim.nexusmods.com/mods/29148]SkyrimStringTranslator[/url] und [url=http://skyrim.nexusmods.com/mods/25859]TES5Edit[/url] erstellt.\r\n[color=#404040][Line][/color]\r\n[right][b][u]Andere Übersetzungen von mir:[/u][/b]\r\n[url=http://skyrim.nexusmods.com/mods/24050]Magic Duel - German Translation (v1.1.4)[/url]\r\n[url=http://skyrim.nexusmods.com/mods/25027]Ritual Armor of Boethiah - German Translation (v4.23)[/url]\r\n[url=http://skyrim.nexusmods.com/mods/20315]Wearable Lanterns - German Translation (v2.2a)[/url]\r\n[url=http://skyrim.nexusmods.com/mods/29518]Frostfall - Hypothermia Camping Survival - German Translation (v2.4a)[/url]\r\n[url=http://forum.scharesoft.de/showthread.php?46154-Shooting-Stars]Shooting Stars - German Translation (v1.032)[/url][/right]",
  "categoryId": "78",
  "version": "1.20",
  "author": "isoku and translated by Slavovitsh",
  "createdUnix": "1368440860",
  "updatedUnix": "1368440330",
  "containsAdultContent": false,
  "uploadedBy": "Slavovitsh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010282",
      "name": "Wet and Cold 1_11 Deutsch",
      "version": "1.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17941",
      "fileName": "Wet and Cold 1_11 Deutsch-31758-1-11.7z",
      "uploadedUnix": "1361021819",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/295b43057c5747b9513d0cab2611833bb8f5d53afdbd67bccf32dd06b3852495/analysis/1407420503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wet%20and%20Cold%201_11%20Deutsch-31758-1-11.7z?fid=1000010282&ttl=1535807539&ri=8192&rs=8192&setec=9969a0ece215a19fc28bf17dc32fe500"
    },
    {
      "fileId": "1000012192",
      "name": "Wet and Cold 1_12 Deutsch",
      "version": "1.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17936",
      "fileName": "Wet and Cold 1_12 Deutsch-31758-1-12.7z",
      "uploadedUnix": "1361568931",
      "modVersion": "1.12",
      "virusScanUrl": "https://www.virustotal.com/file/29b7c95132ca5da2538216f207ef3e6cbfb085eb51502549f588cb125a83d74c/analysis/1407433516/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wet%20and%20Cold%201_12%20Deutsch-31758-1-12.7z?fid=1000012192&ttl=1535807539&ri=8192&rs=8192&setec=ab446128295ee6dedd861267789ecc2c"
    },
    {
      "fileId": "1000012193",
      "name": "Wet and  Cold - Ashes 1_0 Deutsch",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1113",
      "fileName": "Wet and  Cold - Ashes 1_0 Deutsch-31758-1-0.7z",
      "uploadedUnix": "1361569076",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/070bad906b8aadabe0359d4201f018d2989a9940ad645d27382da30fd50a0dd7/analysis/1407433521/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wet%20and%20%20Cold%20-%20Ashes%201_0%20Deutsch-31758-1-0.7z?fid=1000012193&ttl=1535807540&ri=8192&rs=8192&setec=5b8540b320fbfbbb3c21a6935eea9259"
    },
    {
      "fileId": "1000018951",
      "name": "Wet and Cold - Ashes 1_02 Deutsch",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1290",
      "fileName": "Wet and Cold - Ashes 1_02 Deutsch-31758-.7z",
      "uploadedUnix": "1363796976",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/b9fa2eb4b47c3339a3890fb3eaa948a331888046208d7c0c9092e2711e7495e5/analysis/1407478984/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wet%20and%20Cold%20-%20Ashes%201_02%20Deutsch-31758-.7z?fid=1000018951&ttl=1535807540&ri=8192&rs=8192&setec=868fa66fa428e34144a8e97c8a5b22fb"
    },
    {
      "fileId": "1000018952",
      "name": "Wet and Cold 1_121 Deutsch",
      "version": "1.121",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17942",
      "fileName": "Wet and Cold 1_121 Deutsch-31758-1-121.7z",
      "uploadedUnix": "1363797052",
      "modVersion": "1.121",
      "virusScanUrl": "https://www.virustotal.com/file/343b336ee84187d38f6d1fe632528ab4253219b61bf5abed1db5293b092efe58/analysis/1407479175/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wet%20and%20Cold%201_121%20Deutsch-31758-1-121.7z?fid=1000018952&ttl=1535807540&ri=8192&rs=8192&setec=8a4566d36033a6fd29b209f3ae157be0"
    },
    {
      "fileId": "1000018953",
      "name": "Wet and Cold - Ashes 1_03 Deutsch",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3105",
      "fileName": "Wet and Cold - Ashes 1_03 Deutsch-31758-1-03.7z",
      "uploadedUnix": "1363797112",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/cfecd649cd7355355736cd0c5ead996c26f54bb96c77f3799a76dc31ed720317/analysis/1407479178/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wet%20and%20Cold%20-%20Ashes%201_03%20Deutsch-31758-1-03.7z?fid=1000018953&ttl=1535807541&ri=8192&rs=8192&setec=50934f8092f6c2b7e4107b4f453862bf"
    },
    {
      "fileId": "1000029660",
      "name": "Wet and Cold - Ashes 1_04 Deutsch",
      "version": "1.04",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3110",
      "fileName": "Wet and Cold - Ashes 1_04 Deutsch-31758-1-04.7z",
      "uploadedUnix": "1368440209",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/b3733f4f5ddb54dcda015a4b7b00599ea8fa72311996dc9518400ded6905269d/analysis/1407567755/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wet%20and%20Cold%20-%20Ashes%201_04%20Deutsch-31758-1-04.7z?fid=1000029660&ttl=1535807541&ri=8192&rs=8192&setec=5c55b82938ea214a3d83d2505121c68d"
    },
    {
      "fileId": "1000029661",
      "name": "Wet and Cold 1_20 Deutsch",
      "version": "1.20",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24138",
      "fileName": "Wet and Cold 1_20 Deutsch-31758-1-20.7z",
      "uploadedUnix": "1368440330",
      "modVersion": "1.20",
      "virusScanUrl": "https://www.virustotal.com/file/e2eab87e5abcc8b1eed537ca69e4b111513b3370c4fcef9b162e7c8a5ea85be8/analysis/1407567793/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wet%20and%20Cold%201_20%20Deutsch-31758-1-20.7z?fid=1000029661&ttl=1535807542&ri=8192&rs=8192&setec=f389d14bd12f7f2da0eb5bc9f89035ea"
    }
  ]
}