{
  "modId": 31800.0,
  "modName": "Thalmor Embassy Disguise Fix",
  "summary": "Makes it possible to walk past some of the guards, wearing Thalmor cloths like intended in the main quest at Thalmor Embassy.",
  "descriptionHtml": "-Slight spoilers regarding main quest.\r\n\r\nOn steam: http://steamcommunity.com/sharedfiles/filedetails/?id=127683736\r\nThis tiny mod fixes the broken disguise part in the Thalmor Embassy by adding a set with the hood next to the original one. I choose to add an extra set to make the mod less intrusive if disabled or replaced by another bugfix mod. \r\n\r\nI was a bit surprised I found no mod that fixed this annoying issue, including unofficial skyrim patch (had latest version) and when my High Elf in full Thalmor gear got gutted. Sadly my low level mage wasn’t very sneaky compared to my other character that went through the main quests.\r\n\r\nIt was clearly intended by developers to use the disguise; however script/editor data seems broken for the Thalmor chest without hood. Most likely they simply placed wrong version out, since hood version makes the disguise more believable. \r\nA couple of notes:\r\n-\tThe race you are using DOES matter for the disguise. \r\n-\tIt will most likely not work at all for custom races.\r\n-\tThe disguise only works on this quest/place only as far as I can tell, its power is limited.\r\n-\tRemember to use the right piece, since I didn’t remove the malfunctioning set ;)\r\n-\tDisguise requires full set to work obviously.\r\n\r\nCompatible with Armor Disguises by Lord Darkga   http://skyrim.nexusmods.com/mods/20903\r\nTested it myself, but since it require the perks and it doesn’t work with the hoodless version I made my little fix anyway. You might get a message you are not disguised because you don’t have the perks, but it works like intended during this mission without.\r\n\r\nMy other tiny, life improving mod: http://skyrim.nexusmods.com/mods/19098/\r\n\r\nSpoilers!!!\r\nIf you tell the guard in front Solar building he was called for, he doesn’t always move or asap. Minor issue I couldn’t be bothered with since he will not bother you.  People inside the building will always see through the disguise even as High Elf, sadly. I will not fix this since its intended.",
  "categoryId": "95",
  "version": "1.0",
  "author": "Dragon89    Shocky",
  "createdUnix": "1361064311",
  "updatedUnix": "1361063195",
  "containsAdultContent": false,
  "uploadedBy": "Dragon89",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010431",
      "name": "Thalmor Embassy Disguise Fix",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Thalmor Embassy Disguise Fix-31800-1-0.rar",
      "uploadedUnix": "1361063195",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f045e5ec0496db818a2d0ec945fff056045b82131efcea2f0b0f3af2e962d19d/analysis/1407421332/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thalmor%20Embassy%20Disguise%20Fix-31800-1-0.rar?fid=1000010431&ttl=1535807610&ri=8192&rs=8192&setec=fb58393753997f485190e73f7f63cc3d"
    }
  ]
}