{
  "modId": 31848.0,
  "modName": "Better More Powerful Shouts",
  "summary": "Roleplay the ACTUAL dragonborn in all his power. ",
  "descriptionHtml": "This mod reduces the refresh time on all shouts to a more feasible, breath catching period before shouting again. Say goodbye to huge waits, be the all powerful dragonborn. \r\n\r\n\r\nI made this mod for my own personal use. \r\nBut since I couldn\\'t find a similar mod that had been updated for dawnguard and dragonborn, I decided to upload it. \r\n\r\nThis mod does not change the effect of any shouts, if you were hoping for that, go somewhere else. \r\nI don\\'t plan on compiling a list of the time changes either, if you want a mod like this, just download it and look at your shouts list, don\\'t like it? Go somewhere else. \r\n\r\nSpecial considerations:\r\nFor the BASE part of the mod that effects the vanilla shouts, both skyrim and dawnguard are required, and it changes the shouts for both, why? Because I felt like it.\r\n\r\nFor the DragonbornDLC part of the mod, you NEED the BASE part of the mod loaded above DragonbornDLC (preferably) to have all shouts time reduced.\r\n\r\nHearthfire is never needed for anything,  but good to have. \r\n\r\nI don\\'t care if this does or doesn\\'t work on a pirated copy, if you don\\'t have a legitimate copy of skyrim you are not allowed to complain.\r\n\r\nI don\\'t care if this does or doesn\\'t conflict with other mods, it definitely works with Frostfall, SkyRe, Immersive weapons/armor, deadly dragons, etc etc etc etc etc etc \r\n\r\nThis mod will not, and cannot, by nature, conflict with any mod that doesn\\'t directly change how shouts work. This mod is hereby unsupported once I release it. You can change or reupload it, steal it from me, anything, it only took me 5 minutes to make it. \r\n\r\nDragon Aspect can be cast as many times a day as you want, and it only takes 5 seconds to recharge as usual, so have fun with that.\r\n\r\n\r\nWHAT THIS MOD WORKS WITH:\r\n\r\nThis mod will be BLATANTLY overpowered if you do NOT have Deadly Dragons, Deadly Monsters and SkyRe installed, and play on a difficulty level above, but not including adept. \r\n\r\nThis mod is for roleplaying, if you think it will ruin your game because you don\\'t have the willpower to not cast dragon aspect for every single battle you get into, then simply go somewhere else. \r\n\r\nDISCLAIMER:\r\nThis mod doesn\\'t contain \\\"adults only content\\\" (as in; sex) but it does contain things worse than sex, such as murder, violence, torture, incineration, psychological torture and language. Anyone who thinks sex is worse than those things, or something to be ashamed of at all is a fool. \r\n\r\nThis mod is not work safe however, because you aren\\'t working a job that actually helps people if you\\'re allowed to play skyrim while you are \\\"working.\\\" \r\n\r\nThis mod may be incompatible with mods ranging from skyrim itself TO any, every, or no mod that exists. This mod in theory should be compatible with any mod that doesn\\'t change shout times.  \r\n\r\n\r\n\r\n",
  "categoryId": "75",
  "version": "1",
  "author": "Me",
  "createdUnix": "1361121212",
  "updatedUnix": "1361120974",
  "containsAdultContent": false,
  "uploadedBy": "lollerskates123123",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010619",
      "name": "Better Shouts BASE and DragonbornDLC",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Better Shouts BASE and DragonbornDLC-31848-1.zip",
      "uploadedUnix": "1361120974",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/2ae9f9665c266f2051fc9150c0e42d18e816276dee230caa09bda667f3bda7b5/analysis/1407422709/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Shouts%20BASE%20and%20DragonbornDLC-31848-1.zip?fid=1000010619&ttl=1535807693&ri=8192&rs=8192&setec=d2f375bbdee2e8512dfeee3f85152ebd"
    }
  ]
}