{
  "modId": 31853.0,
  "modName": "Psi Blades",
  "summary": "Wrist mounted energy blades that draw from the power of your mind\r\n(tldr? kinda like starcraft)",
  "descriptionHtml": "\\\"The might of your mind, focused into a cutting edge...literally\\\"\r\n\r\n[youtube]http://www.youtube.com/watch?v=iGaRCD6vy_A[/youtube]\r\n\r\nINTRO\r\n-------------------------------------------------------------------------------------------------------------------------------------------------\r\nThis is a small mod i have been wanting to make for a while now, so i thought i would share it. Anyone who has plade starcraft knows what a psi blade is, this is just a simple adaptation of that concept for Skyrim, i hope you enjoy!\r\n\r\nACQUIRING\r\n-------------------------------------------------------------------------------------------------------------------------------------------------\r\nEverything is crafted at the forge, you will need to craft the spellbooks (yes, at the forge, yes i know that makes no sense) to teach you the spells, there are three in all, a left blade spell, a right blade spell, and a master blade spell.\r\n\r\nAfter that you need to craft the gauntlets, if you are not wearing the focus gauntlets, the spells will fizzle.\r\n\r\nThere are light and heavy versions of the dual gauntlets, and the master gauntlet, the master blade will not work with the dual gauntlets, but the right normal blade spell will work with the master gauntlet\r\n\r\nAll the gauntlets are crafted at the forge as well, and they can be improved like any other piece of armor (although i do not know if you can enchant them. or if you cant enchant them, i am not certain that it wont crash the game.\r\n\r\nThe spells themselves work similarly to the bound weapon spells, stats are a little shifted around, but the swords pull from the same perks that bound weapons do, if you get a perk that would upgrade a bound weapon, the psiblades will get that upgrade as well (including the damage increase from mystic binding)\r\n\r\nKNOWN BUGS AND ISSUES\r\n-------------------------------------------------------------------------------------------------------------------------------------------------\r\nThis is my first mod for anything in over a year, so there are going to be some issues, IF YOU LIKE THIS MOD AND ENCOUNTER AN ISSUE THAT YOU MIGHT KNOW HOW TO FIX, CONTACT ME! I am not that knowledgable about the inner workings of skyrim, but if i can learn something, i can put that knowlege to use.\r\n\r\n1. Blocking with the blades looks kinda funky, unless i can figure out how to place the blades attached to the wrist instead of the hand, i do not know how to fix this\r\n\r\n2. Changing perspectives (i.e: 1st to 3rd person or vice versa) completely fucks with the transparencies in the alpha channel of the blades, making them look like shit. I do not know what causes this, but a quick fix is to just sheathe and re-cast the blade(s) while already in whichever perspective you want.\r\n\r\n3. There is a conflict with certain armor mods (currently only confirmed is Omegared\\'s oh so amazing armor mod), the conflict is minor but annoying, when wearing the gauntlets and some of his chest armors, your wrists (and the gauntlets with them) disappear entirely. This is not absolute though, unequipping all spells, lowering your hands, saving and then restarting skyrim should fix this, if it does not, then try it again, it seems random, but if you can get it to work properly, it should work for as long as skyrim is running. \r\n\r\n(i will be contacting Omegared later to see if he can shed any light on this issue, his armor mod is nothing short of legendary in my opinion, and i would love to remove any conflicts between my mod and his)\r\n\r\n4. The gauntlets themselves are pretty slap dash in creation, if any of you expert modelers/texturers want to try making better ones, contact me and we will see about improving them, but i am lazy, and my inexperience at texturing greatly hampers my efforts to create complete models, so any assistance will be appreciated)\r\n\r\nIF YOU ENCOUNTER ANY MORE BUGS, CONTACT ME AND WE WILL SEE ABOUT FIXING THEM!",
  "categoryId": "55",
  "version": "1.0",
  "author": "Gwyvern",
  "createdUnix": "1361126694",
  "updatedUnix": "1361126476",
  "containsAdultContent": false,
  "uploadedBy": "Gwyvern",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010649",
      "name": "Psi Blades v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9077",
      "fileName": "Psi Blades v1-31853-1-0.7z",
      "uploadedUnix": "1361126476",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4b18d2ec4e630dd745f0af49fb8f0ac0ede612f3133e0272e7f1d0ba39f5a393/analysis/1407423075/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Psi%20Blades%20v1-31853-1-0.7z?fid=1000010649&ttl=1535807699&ri=8192&rs=8192&setec=4e3cff0e3550fa1b08356c7f8f46b3a5"
    }
  ]
}