{
  "modId": 31865.0,
  "modName": "Skyrim Co-Op LAN Mod NOT SKYRIM ONLINE",
  "summary": "This mod is NOT Skyrim Online but, a much smaller version of it by only having 2 (to possibly more) players and is only networked through LAN. However, this mod does have the advantage (potentially) of making Skyrim be Cooperative (Read Full Description Ahead)",
  "descriptionHtml": "Lets get a few things straight off the bat. I am not the creator of this mod, I am not the owner of this mod, and I am only a messenger of this mod since I found this on Youtube of all places. Now before you start sending hate comments and tell me that this isn\\'t real and that i shouldn\\'t get people\\'s hopes up in thinking that this mod is real. Keep in mind I had to do a few surveys to unlock this, if you should get pissed at anyone you should get pissed at these people:\r\nhttp://www.youtube.com/watch?v=qSR_ZVXhxVE\r\nhttp://www.youtube.com/watch?v=u0ElN0c5ND4\r\nThese are just a few videos that have these files through surveys (yes I know one of them gives you a password through the description but i\\'m trying to make a point conceptually speaking by saying that people have uploaded other versions of this mod (or variations) and force people to do surveys that might not get it to work in the first place. Those are the people you should be ticked at, not me i\\'m just a messenger and someone in need of help. Now for all those that are already typing comments saying that \\\"im an idiot because its fake\\\" before you even finish reading this, this is one of the reasons why I uploaded this mod. I have tried to contact the modder (Dragonborn(by reading the readme)) and have tried commenting through the Youtube videos and haven\\'t recieved a reponse from either. So I have decided to upload it here seeing how this is the modding community. If anyone can find Dragonborn (the user) and or figure out how to get this mod to work kudos all around. This is what the mod can \\\"suposibly\\\" do\r\nQuesting\r\nTrading\r\nPVPing\r\nPretty much everything you can do in SP\r\nI know that once you see that I got these files off of youtube will imediately tell me im an idiot (again) and leave, but take a look at the links before you decide because while I have seen videos with \\\"fake\\\" \\\"it works\\\" or \\\"it\\'s real\\\" comments I have seen close to 30 different users saying the same thing which may not be confident enough to be real but it has to be enough to take a look at. So if you would please disect this mod and tell me (and others) if this mod is real or not. If it is GREAT! Please leave a \\\"STEP BY STEP\\\" from start to finish please on how to make this mod work because I have been at this mod for a few weeks now and have hit a snag because no one tells anyone how exactly to get this mod to work. I have tested this mod myself (with multiple computers(yeah im spoiled)) and have done everything the readme told me to do and I still don\\'t see the other computer. I have used both Tunngle and Hamachi and both computers see and can chat with each other but can\\'t see each other in Skyrim. Please help. Im not doing this for money like those ass***** on youtube that get money by adding surveys to the file. I will add two different versions of the mod 1.ziped password:draggy288 and 2. unziped. I don\\'t care if you use or take this mod, whatever HOWEVER, if you can find Dragonborn ask him about anything to be sure and give him ALL CREDIT for this mod, I am just a messenger asking for help to see if its real or not and how to get it to work. Can\\'t wait to see the comments. Anyone that can port this mod to the Fallout series would be AWESOME and if you can send me a link to it (without a survey or a password or ziped unless required without a password)\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "Dragonborn",
  "createdUnix": "1361137473",
  "updatedUnix": "1361137828",
  "containsAdultContent": false,
  "uploadedBy": "BryceSkylander",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010711",
      "name": "Skyrim Co-Op LAN Mod NOT SKYRIM ONLINE",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1147",
      "fileName": "Skyrim Co-Op LAN Mod NOT SKYRIM ONLINE-31865-1-0.rar",
      "uploadedUnix": "1361137828",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0f17264ba29a50fd2f40c08a59fa241babefafcdd32bcaa70ac5b73ddfffa0d2/analysis/1407423609/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Co-Op%20LAN%20Mod%20NOT%20SKYRIM%20ONLINE-31865-1-0.rar?fid=1000010711&ttl=1535807718&ri=8192&rs=8192&setec=f03756b247ae2852cbb48c18f9dc110d"
    }
  ]
}