{
  "modId": 31871.0,
  "modName": "Quest- Sorcery",
  "summary": "The forgotten treasure of a great Sorcerer lies hidden in a long abandoned tower, kept away from the world and its perils for many long years. Time has come to unravel the Sorcerer\\\\\\'s mysteries. Travel to the mountains of the West Reach to find the Sorcerer\\\\\\'s Tower and uncover it\\\\\\'s many secrets. What perils guard The Treasure, and what orde",
  "descriptionHtml": "The forgotten treasure of a great Sorcerer lies hidden in a long abandoned tower, kept away from the world and its perils for many long years. Time has come to unravel the Sorcerer\\\\\\'s mysteries. Travel to the mountains of the West Reach to find the Sorcerer\\\\\\'s Tower and uncover it\\\\\\'s many secrets. What perils guard The Treasure, and what ordeals must be survived to gain access to The Sorcerer\\\\\\'s Realm? \r\n\r\n--------- \r\nFeatures \r\n\r\n- Travel to surreal magical realms in search of a mysterious treasure. \r\n\r\n- Lore friendly and consistent with the style and themes of the rest of the game. \r\n\r\n- Many unique environments and locations to explore. \r\n\r\n- Additional stories, quests and secrets exist throughout the West Reach mountains. \r\n\r\n- Compatible with all Bethesda DLC. No Prerequisites. \r\n--------- \r\n\r\n***Please read the notes and troubleshooting guide below before posting comments*** \r\n\r\n--------- \r\nNotes \r\n\r\n- Sorcery can be started by reading A Sorcerer\\\\\\'s Folly. Available in the Bards College and in some book form lists. \r\n\r\n- The quest can also be started by stumbling upon the locations during exploration. \r\n\r\n- Exploration is key. Don\\\\\\'t just stick to the path if you want to see everything that Sorcery has to offer. \r\n\r\n- Taking followers in this mod is supported, but may encounter minor issues in certain places. Remember, fast travel will always return your follower to you. However, followers will never join you in the Magical Realms \r\n\r\n- The mod also features a short series of books that can be found as random book spawns, and one or two specific locations. \r\n\r\n- If you have a mod that lets you wear multiple Rings:don\\\\\\'t equip more than one of the red, yellow or purple rings at any given time \r\n\r\n- Quests include: \r\n+ Sorcery (Side) \r\n+ Atulg\\\\\\'s Bounty (Misc) \r\n+The Grahlwraith (hidden) \r\n\r\n- Atulg\\\\\\'s Bounty is not started within the confines of new quest areas. It is started in Skyrimby finding the body of a Penitus Oculatus agent on the road leading from Falkreath to Cyrodiil/Hammerfall, near the edge of the map. \r\n\r\n- Areas include: \r\n+ West Reach Pass \r\n+ The Sorcerer\\\\\\'s Tower \r\n+ White Tooth Gorge \r\n+ Lake Hjalfaar \r\n+ Hjalfaar Glacier \r\n+ Numerous magical Realms \r\n+ White Lodge \r\n\r\n- How to find Hjalfaar Valley:Hjalfaar Valley can be accessed via the West Reach river which runs through the pass. \r\n--------- \r\n\r\n--------- \r\nPatch 1.4 \r\n\r\n- Fixed a bad string in the Sorcery objectives. \r\n\r\n- Cleared the Alias\\\\\\' for quest items manually before shutting down the quest. \r\n\r\n- New title image. \r\n\r\n- Slightly different placement for rings. Should be easier for people to find. \r\n--------- \r\n\r\n--------- \r\nPatch 1.31 \r\n\r\n- Fixed an old String for the West Reach Pass location. \r\n\r\n- Set interiors and Realms as no reset zones. \r\n--------- \r\n\r\n--------- \r\nPatch 1.3 \r\n\r\n- Fixed some small issues with water sounds and some gaps in a cliff. \r\n\r\n- Other similar misc changes. \r\n--------- \r\n\r\n--------- \r\nPatch 1.2 \r\n\r\n- Fixed an issue in the .bsa archive that was breaking things a little. \r\n--------- \r\n\r\n--------- \r\nTroubleshooting Q&A \r\n\r\nQ: What could make the game crash to the desktop \r\nA: If crashes or failure to load assets/areas repeatedly occur, it is usually caused by one of two things: \r\n\r\n1) Skyrim\\\\\\'s limited memory allocation for the use of .esp (mod) files means using a lot of mods (especially large ones) will eventually cause the game to run out of memory and cause issues during gameplay. The solution is simply to use less mods. \r\n\r\n2) The .bsa is conflicting with another archive from a mod using the same scripts/assets or otherwise failing to access it\\\\\\'s data will cause the game to CTD in the front end menus. Try changing the load order first as the issue can sometimes cause \\\\\\\"incompatibilities\\\\\\\" between mods that would otherwise work together. If it still won\\\\\\'t work, then disable other mods one at a time until it does... \r\n\r\nQ: One of the rings fails to work. Help? \r\nA: Sometimes the game doesn\\\\\\'t initialize the scripts from the .bsa. Theres a couple of ways to kick it into action. 1) Relaunch the mod (turn it off, save, turn it on, start from scratch) 2) Add another version of the ring to your inventory, using the console. \r\n--------- \r\n\r\n--------- \r\nVoice Acting \r\n\r\nAriana Siarkiewicz [Viridiane] \r\nas Asciene Maurard \r\n--------- \r\n\r\n--------- \r\nIf you enjoy this quest, please rate and try out my other Quest mods \r\n\r\n- Quest: Sea Of Ghosts \r\n\r\n- Quest: And the Realms of Daedra \r\n\r\n- Quest: No Mercy \r\n\r\n- Quest: The Bigger They Are \r\n\r\nFollow Quests I\\\\\\'m currently working on via Twitter \r\n\r\nIf you have the time, please answer this quick survey to help with my future projects. \r\n\r\nPlease rate The Elder Scrolls Quests Collection if you like all of these mods. \r\n\r\nIf you enjoy these Quests, you may also enjoy The Elder Scrolls Places Series. \r\n--------- \r\n",
  "categoryId": "35",
  "version": "1.8.183.0.7",
  "author": "ThirteenOranges",
  "createdUnix": "1361143095",
  "updatedUnix": "1361143344",
  "containsAdultContent": false,
  "uploadedBy": "benislegit",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010733",
      "name": "quest- sorcery",
      "version": "1.8.183.0.",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15106",
      "fileName": "quest- sorcery-31871-1-8-183-0-.zip",
      "uploadedUnix": "1361143344",
      "modVersion": "1.8.183.0.",
      "virusScanUrl": "https://www.virustotal.com/file/3e2a4b00b1d6ea2456dd963690804390b1f85ac61a89628249b30e7234e8393d/analysis/1407423806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/quest-%20sorcery-31871-1-8-183-0-.zip?fid=1000010733&ttl=1535807724&ri=8192&rs=8192&setec=e75781da6dd8f4a5b9610d871463cfdd"
    }
  ]
}