{
  "modId": 31870.0,
  "modName": "Lootification - immersive armors",
  "summary": "Enchants and properly distributes all the armors Immersive Armors adds.",
  "descriptionHtml": "[size=36]Please upgrade to [url=http://skyrim.nexusmods.com/mods/32339/]Lootification[/url]  and download the rebuilt patch for immersive armors there. To make multiple patches compatible I had to change how some things were handled.[/size]\r\n\r\nI\\'m a big fan of [url=http://skyrim.nexusmods.com/mods/19733]Immersive Armors[/url], but it has the same drawback eery other weapon and armor mod does: the new armor are mostly up to you to craft and enchant. Looking for that Seadog Armor of Eminent Health? Don\\'t hold your breath.\r\n\r\nThey say that an infinite number of monkeys chained to typewriters will eventually recreate the collected works of Shakespeare. \r\n\r\nMy team of monkeys carefully copied all appropriate enchantments from the vanilla armors and applied them to each of the immersive armors armors. Then with utmost precision combed the leveled lists and inserted the immersive armors and their newly enchanted versions without changing the odds of getting anything. They are really quite tired.\r\n\r\nBasically this mod adds 1929 weapons over 1027 leveled lists. And a few outfits. I guess you still shouldn\\'t hold your breath for a Seadog Armor of Eminent Health but at least its out there.\r\n\r\nHowever this is, at the moment, just a test release. I actually don\\'t know Immersive Armors that well as a mod so I may have accidentally damaged something. The monkeys may have made a mistake and your computer will melt. Back up your save and report any bugs.\r\n\r\nNote: this is a patch only, you still need the full immersive armors mod. \r\n\r\nTo use it replace your old hothtrooper44_ArmorCompilation.esp and activate GearVariants.esm, hothtrooper44_ArmorCompilation.esp, and immersivearmors_LLI.esp, and make sure they load in that order. For best results immersivearmors_LLI.esp should be as late as possible in your load order. Rebuild your bashed/merged patch.\r\n\r\n-Dienes\r\n\r\nYes I find and replaced my crafting 300 readme, you think I got this far without cutting a few corners? Also included is immersiverarmors.esp. You don\\'t have to load it or anything, I got it for you as a gift.",
  "categoryId": "54",
  "version": "0.2",
  "author": "Dienes",
  "createdUnix": "1361142120",
  "updatedUnix": "1361141726",
  "containsAdultContent": false,
  "uploadedBy": "Dienes",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010728",
      "name": "Lootification - immersive armors",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "95",
      "fileName": "Lootification - immersive armors-31870-0-1.7z",
      "uploadedUnix": "1361141726",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/984355a9a5836731202acb8c988cf3bb7154331f680b202ace894276fe906616/analysis/1407423785/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lootification%20-%20immersive%20armors-31870-0-1.7z?fid=1000010728&ttl=1535807723&ri=8192&rs=8192&setec=c5890dc373ce87031f214736a29428c3"
    }
  ]
}