{
  "modId": 31896.0,
  "modName": "God of War Armor",
  "summary": "For all of the GoW fans out there",
  "descriptionHtml": "I wanted an introduction into making armors in Skyrim and after seeing volvaga0’s awesome GoW weapons mods, I decided to create Kratos’ armor.\r\n\r\nAfter hours of work, and nearly bashing my head against my desk out of frustration, this mod is what I managed to produce. \r\n\r\nThe armor itself is fairly weak, honestly it’s just a belt with cloth, however, the gauntlets and boots should have ratings close to steel. The Golden Fleece is fairly powerful though. \r\n\r\nObtaining the Armor:\r\nYou can obtain the armor outside of Riverwood next to the little beggar\\'s camp or you can craft it at any forge.\r\n\r\nWhen crafting, you can find the armor under steel and the Golden Fleece under Daedric and you’ll need the Dwarven Smithing and Advanced Armor Perks to craft them. \r\n\r\nIf you want to use console commands, type : help \\\"spartan\\\" to get the armor parts IDs and help \\\"golden fleece\\\" for the Golden Fleece\\'s ID\r\n\r\nInstallation\r\nYou should install with the nexus mod manager or extract the KratosArmor.7z file in your Skyrim data directory\r\n\r\nUpdate 1.1: \r\n-- Fixed minor skinning issues which caused the armor to morph weirdly in game.\r\n-- Update the ground meshes (the ones you see in your inventory or when you drop the armor) which were quite horrible\r\n-- Removed all vestiges of the breast bones/nodes introduced in the UNPB body, hopefully this will fix the some crash people are experiencing with the female armor\r\n\r\n\r\nCompatibility: \r\nThe armor uses new meshes and textures so it shouldn’t conflict with anything. Bear in mind though that the Golden Fleece uses the 57 body slot/node (Mod shoulder) and so you won’t be able to equip it with an item that also uses it.\r\n\r\nI used Chris57’s and FavoredSoul’s Underwear–Slip body from their Better Males mod as a base for the armor, but I think it should be compatible with the vanilla body. The female uses the UNBP body and you’ll  probably get issues if you use anything else. If any one wishes to make the armor compatible with any other body mod please feel free to do so. \r\n\r\nNotes:\r\nThere are some minor clipping issues with the armor but I think I managed to avoid anything major, but please let me know if you see any major deformation or clipping during gameplay.  Also, I am aware that the armor is kinda bright, I might mess with it later and try to make it darker but I like the way it looks.\r\n\r\nThe mods should have no nudity, but the way the panties move in the female version may show too much depending on the body position. For those of you who want a topless female version let me know and I\\'ll make one. \r\n\r\nThe armor is also not completely correct, the back cloth section should be made of pteruges and I am missing the chains, but I couldn’t make them look good in game so I didn\\'t add them.\r\n\r\nI really recommend volvaga0\\'s GoW weapons mods to go along with the armor http://skyrim.nexusmods.com/mods/12720\r\nhttp://skyrim.nexusmods.com/mods/12322\r\n\r\nAnyway, I hope  you guys enjoy it. This is my first mod so please be gentle, but seriously any comments and suggestions are more than welcomed. \r\n\r\nI would like to thank:\r\nChris57 and FavoredSoul for the Underwear-Sip body that I used for the base of this mod (http://skyrim.nexusmods.com/mods/2488)\r\ncalyps, xp32, mrtroublemaker, and dimon99 for the UNPB and UNP bodies (http://skyrim.nexusmods.com/mods/14899)\r\nVectorPlexus and hardarg (http://skyrim.nexusmods.com/users/4293742) for giving me advice for fixing issues with the weight slighter\r\nnightasy for his awesome tutorials (http://skyrim.nexusmods.com/users/3076419)\r\nvolvaga0 who inspired the idea (http://skyrim.nexusmods.com/users/3147615)\r\nMy cousin (you know who you are) who insisted that I make this armor\r\nBethesda Studios for creating such an awesome and mod friendly game\r\nSanta Monica Studios for creating a very memorable character.",
  "categoryId": "54",
  "version": "1.1",
  "author": "cw97",
  "createdUnix": "1361167610",
  "updatedUnix": "1361226582",
  "containsAdultContent": true,
  "uploadedBy": "cw97",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010816",
      "name": "Kratos Armor v1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5755",
      "fileName": "Kratos Armor v1-31896-1-0.7z",
      "uploadedUnix": "1361167352",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5e76eb413c0a5771436a7dd41483de3689885f74e77c2c1570cdcb0d75b05267/analysis/1407424148/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kratos%20Armor%20v1-31896-1-0.7z?fid=1000010816&ttl=1535807756&ri=8192&rs=8192&setec=91f598942deab7e5a8f536381784488b"
    },
    {
      "fileId": "1000011011",
      "name": "Kratos Armor v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5747",
      "fileName": "Kratos Armor v1_1-31896-1-1.7z",
      "uploadedUnix": "1361226582",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bcf65190e9f2270121bb4005183dd27717ab326831dda6ec24a6ca9bf84c9fd9/analysis/1407425776/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kratos%20Armor%20v1_1-31896-1-1.7z?fid=1000011011&ttl=1535807757&ri=8192&rs=8192&setec=fc4332edc34f936263418e6b29708d94"
    }
  ]
}