{
  "modId": 31951.0,
  "modName": "Nightcaller_TempleOfMara Remake",
  "summary": "This changes the entrance area where Erandur sets up his little shrine into a full out Temple!",
  "descriptionHtml": "BEFORE YOU READ! below... I strongly suggest you install this mod AFTER you\\'ve completed the deadric quest at Night Caller Temple as not only would it make sence then but just incase it conflicts with it although i didnt really edit anywhere beyond the transparent door .. its just to be safe :). ASLO in the images i know the image of the cooking split is .. wrong .. but i actually changed it so ignore that.\r\n\r\nWell all this really is, is a full out temple instead of Erandur\\'s little shrine, i cleaned the place up added two new NPC\\'s .. and they will read books, eat and pray.\r\n\r\nI havnt edited anything about the rest of the place apart from getting rid of a few cobwebs, hope that dont bother anyone too much ;D\r\n\r\nI also added new interaction markers for all sorts of things around the temple to make it more diverse.. i also added a cooking split for anyone who needs to cook as in for me i have a mod that requires me to be kept well fed so cooking there is rather handy. You will notice as you walk in on your right there is a book, well read it its interesting, its for pure role playing purpose\\'s and to give you a reason why this place has become a new Temple Of Mara.\r\n\r\nThanks :)! please check out my other mod Reworked and NEW college of Winterhold as there both Improvement mods :D.\r\n\r\nTo install simply place this in your Data folder.",
  "categoryId": "68",
  "version": "1.0",
  "author": "Lok195",
  "createdUnix": "1361231054",
  "updatedUnix": "1361230775",
  "containsAdultContent": false,
  "uploadedBy": "lok195",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000011031",
      "name": "NewTempleOfMara",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "NewTempleOfMara-31951-1-0.rar",
      "uploadedUnix": "1361230775",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ac4bc2be18f68dc75916fa3cbe3206eb4189cc9f81b7776cf2840e2f6d78f185/analysis/1407425888/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NewTempleOfMara-31951-1-0.rar?fid=1000011031&ttl=1535807879&ri=8192&rs=8192&setec=b4a82964fb2d0a0dc2d2eec353d58cc1"
    }
  ]
}