{
  "modId": 31978.0,
  "modName": "Skyrim OblivionATED",
  "summary": "Designed to bring the charm from Oblivion to Skyrim, that excess flora colour.",
  "descriptionHtml": "Designed to bring the charm from Oblivion to Skyrim, that excess flora colour and charm(non realistic).\r\n\r\nUpdate.\r\nWent though and removed all textures that generally effect anything outside reach/forest and midland Skyrim.(they wernt tweaked and fixed to begin with so they shouldnt really have been included but it was a alpha demo, some textures are global plants so they will be found elsewhere).\r\nTurned Reach dead trees into blooming Ornamental Chinese Peach Trees(yes they are that colourful in real life)\r\nTweaked most textures to turn down brightness and made textures fit together better on the whole. While keeping the super lush look.\r\nTried to tweak any weird looking colour differences or just plain wrong looking textures.\r\n\r\nIf you find any weird textures/missmatches in Rift,Midland and reach areas please let me know.\r\n\r\nThis mod works best using\r\n\r\nLush Grass\r\nhttp://skyrim.nexusmods.com/mods/3288\r\nIncrease grass size.\r\n\r\nGlorious grass\r\nhttp://skyrim.nexusmods.com/mods/9185\r\nIncrease grass Density.\r\n\r\nRealistic Water and Terrain\r\nhttp://skyrim.nexusmods.com/mods/711\r\nImprove water areas of the game.\r\n\r\nOr/and\r\nSkyrim Flora Overhaul Summer Edition\r\nInstall Skyrim Flora Overhaul Summer Edition first and then install this mod.\r\nIt will want to Overwrite files, thats ok let it.\r\n\r\nNo bugs known.\r\nNone of these are required.\r\nSO far as I have not done any extra placements or added new flora or increased texture sizes(except for reach peach tree) there should be almost no FPS hit if you install it by itself.\r\n\r\nConsidered beta, in that it should look great depending on your tastes and there shouldnt be any broken areas due to texture mismatch.\r\n\r\nDue to most people not likeing my idea, this maybe the final version simply due to the manhours that would be required to properly implement my vision.\r\n\r\nThis mod is seperate from other flora mods in its not aiming for realism but charm\r\nThis mod shouldnt cause any bugs with skyrim as its just a texture replacer for now.\r\n\r\nUse mod manager or extract to Skyrims data folder or manual install.\r\nNo compatablity issues overall with other mods no ESP or scripts, it will only clash with other mods that change the same flora and terrain textures.(only terrain with organic matter is modified in this mod)\r\nto remove delete landscape folder in skyrim\\\\data\\\\textures\\\\ or remove with mod manager.\r\nIf you want the textures to overide other mods, add this mod last and overwrite any files.\r\nYou may need to reinstall other mods if they had files in Landscape folder and you delete it.",
  "categoryId": "62",
  "version": "0.2",
  "author": "Phoynix",
  "createdUnix": "1361296062",
  "updatedUnix": "1361367702",
  "containsAdultContent": false,
  "uploadedBy": "Phoynix",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000011484",
      "name": "Sykrim OblivionATED",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15266",
      "fileName": "Sykrim OblivionATED-31978-0-2.rar",
      "uploadedUnix": "1361367702",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/e2b08a5b332530146c30176260cb4fa18323f322389b58ae31c48cac404d59d3/analysis/1407428904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sykrim%20OblivionATED-31978-0-2.rar?fid=1000011484&ttl=1535807924&ri=8192&rs=8192&setec=bce3c65521ea802743331b98e2d11eb7"
    }
  ]
}