{
  "modId": 31985.0,
  "modName": "Cultural Diversity - Khajiit-Argonian-Dunmer",
  "summary": "Modular options for Khajiit, Argonian and Dunmer NPCs, offering race-specific clothing and armour based on a number of mods.",
  "descriptionHtml": "[size=5][b]News[/b][/size]\r<br />[line]\r<br />[*][url=http://skyrim.nexusmods.com/mods/36966//?]French translation available here&#33;[/url]\r<br />\r<br />Agunsthemagi has posted a set of [url=http://www.skyrim.nexusmods.com/mods/47663]NPC and Race Mods Patches[/url] for combining Ethereal Elven Overhaul, Gender and Race Heights, Cultural Diversity, and more. Check it out :-)\r<br />\r<br />Scroll to the bottom for a list of other cool mods to combine Cultural Diversity with&#33;\r<br />\r<br />\r<br />[size=5][b]WTF?[/b][/size]\r<br />[line]\r<br />This mod aims to bring a little cultural diversity to Skyrim, primarily in terms of clothing and armour. Version 1.0 covered only Khajiit civilians; version 2.0 and above offer options for Argonians and Dunmer as well. It is completely modular, meaning that you can install exactly what you want, and nothing more.\r<br />\r<br />Better screen shots will follow.\r<br />\r<br />[line]\r<br />[size=5][b]Required files[/b][/size]\r<br />[line]\r<br />This mod use a number of others which you will need to download first, although you really only need the ones which relate to the components you plan to install. But to make things easier, here&#39;s a list of the mods you&#39;ll need to download if you want to install everything:\r<br />\r<br />[list][*][url=http://skyrim.nexusmods.com/mods/24342]Regal Assassin Armor[/url] - for the Khajiit Clothing component.[*][url=http://skyrim.nexusmods.com/mods/27563]Wet and Cold[/url] - not actually required, although a plugin is offered.[*][url=http://skyrim.nexusmods.com/mods/39983//?]Regal Huntsman Armor[/url] - for the Khajiit Armour component.[*][url=http://skyrim.nexusmods.com/mods/27676]Argonian Mercenary Armor[/url] - for the Argonian Armour component.[*][url=http://skyrim.nexusmods.com/mods/23920]Marsh Armor[/url] - for the Argonian Armour component.[*][url=http://skyrim.nexusmods.com/mods/16438]Bandolier[/url] - for the Argonian Armour component.[*]Dragonborn - for the Dunmer components, and for Regal Hunstman Armor.[*]Dawnguard - for Regal Hunstman Armor.[/list]\r<br />\r<br />I have asked for and received permission to use these mods.\r<br />\r<br />[line]\r<br />[size=5][b]Khajiit Components[/b][/size]\r<br />[line]\r<br />\r<br />[size=4][b]i) Khajiit Clothing[/b][/size]\r<br />\r<br />This was where the mod started, so I&#39;ll spend a little time explaining what the original idea was.\r<br />\r<br />Basically, this component takes [url=http://skyrim.nexusmods.com/mods/24342]Dreamburrows Regal Assassin Armor[/url] as a basis and alters most NPC Khajiit to use some form of it instead of the standard merchant or farmer outfits.\r<br />\r<br />My aim was to make the Khajiit feel even more like outsiders, wearing richly exotic clothes that the Nords of Skyrim, with their love of good, hard steel, would probably consider a little flamboyant or even ostentatious. Their clothes are meant to represent both cultural difference and identity.\r<br />\r<br />Dreamburrows&#39; outfit is quite beautiful, in my opinion, and it comes in both cloth and light armor, each with six colours and two variants of hood and/or scarves. I thought that should be enough to guarantee that not every Khajiit you meet will be wearing exactly the same clothing, but still look like they belong to the same culture.\r<br />\r<br />I took a couple of approaches to the various Khajiit in the game. Firstly, the main characters which you can interact with, mostly among the caravans, had their outfits selected individually.  I usually tried to look for some colour cue to decide the actual look: so Ahkari uses the purple variant to match her eyes, and Ma&#39;jhad uses a black version to match his fur. Similarly, male Khajiits with sideburns never get Regal hoods (to avoid clipping), and NPCs with more noticeable hair (Ri&#39;saad, for example) tend not to get scarves. And within each caravan, I made sure that some used the standard look, and some the variant. It isn&#39;t a big difference, but it&#39;s there.\r<br />\r<br />Secondly, a number of NPCs, mostly dead ones, have randomly generated clothes from the Regal set. So when you stumble across a dead Khajiit in a dungeon prison, he or she will have appropriate gear, but (hopefully) not look identical to the Khajiit in the next cell. One or two living Khajiit also have randomly generated clothing as well.\r<br />\r<br />That being said, a number of NPCs have intentionally not been changed:\r<br />\r<br />[list][*]People with professions, such as miners or the Solitude lighthouse keeper, haven&#39;t been changed.[*]The Khajiit assassins you sometimes meet remain untouched, so that there should be no conflict with Dark Brotherhood Armor replacers.[*]I was tempted to change Maiq, but, well, he&#39;s Maiq, and perfect as he is.[/list]\r<br />\r<br />I made one other tweak: the Khajiit cook you meet in the Thalmor Embassy, Tsavani, now wears the chef outfit, instead of the generic farming gear she had before.\r<br />\r<br />Version 1.1 of the mod included a plugin for Interesting NPCs, but now that I&#39;ve expanded the mod I intend to do a better job of that, and cover more of the NPCs. It will be back.\r<br />\r<br />New in 2.0, on the other hand, are granzh&#39;s retextures of the Redguard hoods, made to match the colours of the Regal armor set. So now Ahkari, for example, has a purple hood to match her clothes. I&#39;d like to express my sincere gratitude to granzh for the work on this: I think it enhances the mod significantly. Kudos&#33;\r<br />\r<br />\r<br />[size=4][b]ii) Khajiit Clothes - Wet and Cold plugin[/b][/size]\r<br />\r<br />Version 1.1 included a version of the Khajiit clothing without any hoods or scarves so that there would be no conflict with the dynamically generated hoods and cloaks of Wet and Cold.\r<br />\r<br />Version 2.0 takes a different approach, altering the Wet and Cold conditions and forcing the mod to ignore Khajiit NPCs. The downide is that you&#39;ll never see a Khajiit wearing a Wet and Cold generated hood or cloak; the upside is that I was able to use DreamBurrows scarves and granzh&#39;s custom hoods without worrying about conflicts and clipping.\r<br />\r<br />\r<br />[size=4][b]iii) Khajiit Armour[/b][/size]\r<br />\r<br />With 3_0 I decided to change the Khajiit armour component again, this time to [url=http://skyrim.nexusmods.com/mods/39983//?]Regal Huntsman Armor[/url], alos by DreamBurrow. I think this will be the last change, as the two sets by DreamBurrow go together beautifully, giving a real sense of unity to the Khajiit in the game. With so many colour variations and accessories, I set a lot of the Khajiit in this component to have random gear; except for Kharjo, who&#39;s armed to the teeth :-)\r<br />\r<br />I have not changed every Khajiit warrior or bandit to use the armour, though. Caravan guards use it, as do some of the melee-orientated bandits. Mages and archers, on the other hand, don&#39;t use it at all. And as with the clothing component, less important NPCs such as bandits have randomly-generated sets.\r<br />\r<br />I&#39;ve left up two earlier versions of the mod for people who prefer the armours I used earlier, [url=http://skyrim.nexusmods.com/mods/25832]Crimson Ranger Armor[/url] and [url=http://skyrim.nexusmods.com/mods/19733]Akaviri Samurai Armor[/url].\r<br />\r<br />\r<br />[size=4][b]iv) Kharjo[/b][/size]\r<br />\r<br />Kharjo can also wear the Regal Huntsman armour, but to avoid conflicts with any follower overhaul mods I&#39;ve included a alternative file for him.\r<br />\r<br />J&#39;zargo was not touched at all, by the way.\r<br />\r<br />\r<br />[size=4][b]v) Moonpath to Elsweyr[/b][/size]\r<br />\r<br />Finally. with version 3.0 I have added a plugin for muppetpuppet&#39;s [url=http://skyrim.nexusmods.com/mods/9782//?]Moonpath to Elsweyr[/url]. This has A LOT of dependencies, all of which must be installed first: Dragonborn, Dawnguard, Regal Assassin Armor, Regal Hunstman Armor, Khajiit Clothes, Khajiit Armor, and obviously Moonpath itself. It&#39;s a separate download because you will need to make sure you have correctly installed the core Cultural Diversity components first, and the included installer will attempt to prevent you from installing the plugin if you haven&#39;t.\r<br />\r<br />I&#39;ve tested this a little to make sure it works, but I&#39;d be extremely happy to receive feedback on the changes I made. In an environment in which almost everyone you meet is Khajiit, it may be a little overkill. Also, I&#39;ve removed several cases (but not all) of Khajiit wearing siligonder armour, as it doesn&#39;t really fit with the style I&#39;m using in the core mod.\r<br />\r<br />\r<br />[line]\r<br />[size=5][b]Argonian Components[/b][/size]\r<br />[line]\r<br />\r<br />[size=4][b]i) Argonian Armour[/b][/size]\r<br />\r<br />This component uses  kimern88&#39;s awesome [url=http://skyrim.nexusmods.com/mods/27676]Argonian Mercenary Armor[/url] and [url=http://skyrim.nexusmods.com/mods/23920]Marsh Armor[/url] as a basis, as well as Dragten&#39;s [url=http://skyrim.nexusmods.com/mods/16438]Bandolier[/url] for additional details. Obviously, these armours were made with Argonians in mind (check out the armoured tail&#33;) and look splendidly dangerous.\r<br />\r<br />As before, named and important NPCs tended to have the armour specifically chosen for them, while lesser NPCs usually have randomly generated sets. This time, however, I decided to let bandit mages use the armours as well. Most of the Argonian bandits you meet are mages, and it seemed like a waste to let them strut around in furs.\r<br />\r<br />\r<br />[size=4][b]ii) Argonian Dock Workers[/b][/size]\r<br />\r<br />This component changes the Argonian dock workers in Windhelm so that they all use typical labourer outfits rather than generic farming clothes. I wanted them to feel like they were working on the docks rather than just hanging out there.\r<br />\r<br />At the same time I added a small patch to fix the variant miner&#39;s outfit, so that men, just like women, should have two versions of the outfit. The effect of that can be seen on the Argonians, but also on any NPC who uses the variant outfit.\r<br />\r<br />A similar fix can be found here: [url=http://skyrim.nexusmods.com/mods/16037]Miners Clothes Variant Fix[/url]. Citadel535&#39;s mod drew my attention to the issue, but the fix included in this mod is my own work.\r<br />\r<br />[line]\r<br />[size=5][b]Dunmer Components[/b][/size]\r<br />[line]\r<br />\r<br />The components in this section ALL require the &#39;Dragonborn&#39; DLC. The DLC adds a number of Dunmer-specific clothes and armors, and it made sense to me that they should not be confined to Solstheim. So I&#39;ve added them to the rest of Skyrim.\r<br />\r<br />\r<br />[size=4][b]i) No Hoods for Dunmer Clothes[/b][/size]\r<br />\r<br />This is a small file which changes all of the Dunmer outfits to use the No Hood version. The reason for that is simple: Wet and Cold. Without built-in hoods, the affected Dunmer will use Wet and Cold&#39;s dynamically generated hoods and cloaks. Or, in the case of [url=http://skyrim.nexusmods.com/mods/31968]Wet and Cold - Ashes[/url], more Dunmer should equip face covers and goggles. \r<br />\r<br />Installing this component will affect the next one, so it needs to come earlier in the load order.\r<br />\r<br />\r<br />[size=4][b]ii) Dunmer clothing and Armour[/b][/size]\r<br />\r<br />Dragonborn comes with three versions of standard Dunmer clothing, and I&#39;ve added them to a number of vanilla Dunmer as well. But not all: that would be ridiculous. Obviously, most of the Dunmer in the basic game are to be found in and around Windhelm, and there I&#39;ve taken the approach that wearing traditional clothes is a minor sign of rebellion. Dunmer who are trying just get by (such as the bard in Candlehearth Hall) or are in the direct employ of a Nord don&#39;t normally wear traditional garb. But you&#39;ll see a fair amount of it in the Gray Quarter.\r<br />\r<br />Outside of Windhelm, however, wearing traditional clothes is less of a statement. Farmers and miners will still tend to wear their work clothes, but merchants in Riften, for example, may be seen wearing Dunmer clothes - because the city is more accepting.\r<br />\r<br />I&#39;ve tried to avoid going overboard with this component. Hopefully there should be enough traditional clothes around to give a sense of cultural identity, but not enough to make every Dunmer look the same.\r<br />\r<br />You&#39;ll also find some instances of Chitin armor being used, occasionally in proper sets, but more often in random collections of parts. If I recall correctly, I only used Bonemold armour once: maybe I&#39;m too influenced by it&#39;s semi-official appearance in Dragonborn. \r<br />\r<br />Perhaps more controversially, you will come across the occasional instance of Temple Robes and Telvanni Robes being used. Let&#39;s take them one at a time.\r<br />\r<br />The temple in Raven Rock, when the Temple Robes are seen in Dragonborn, has shrines to Azura, Boethiah, and Mephala, who are key figures in Dunmer religion. As such, I did not think it too much of a liberty to use the robes in relation to those daedra in Skyrim. Hence the priestess of Boethia will be seen wearing such Temple Robes, as well as, optionally, two of the NPCs mentioned below.\r<br />\r<br />As far as the Telvanni Robes are concerned, I  added a third version with the standard magicka regeneration, but without the heartstone design for females. As with the Temple Robes, only a couple of NPCs were given them: Daylas Valen (the researcher into the Galdur legend), and Maluril (who has a Dark Brotherhood contract on him). A single wilderness encounter was given the robes, namely the most powerful pyromancer you&#39;ll meet in the game. So I&#39;ve tried to include the Telvanni Robes in the game, but make them extremely rare, rather than being found on every second mage.\r<br />\r<br />\r<br />[size=4][b]iii) Specific followers[/b][/size]\r<br />\r<br />As with Kharjo, I&#39;ve included a separate file for Jenassa. Install this, and she&#39;ll wear standard set of light Chitin armor, though without the helmet.\r<br />\r<br />The priestess of Azura, Aranea Ienith, can also wear Temple Robes. Again, a separate file is included in case you have any other mods affecting followers.\r<br />\r<br />Finally, I&#39;ve included a file for Logrolf, the priest of Boethiah which Molag Bal sends you after. He&#39;ll now be wearing Temple Robes, but I&#39;ve also changed him to a Dunmer. I know this won&#39;t be to everyone&#39;s taste: hence the optional file.\r<br />\r<br />\r<br />[line]\r<br />[size=5][b]Troubleshooting[/b][/size]\r<br />[line]\r<br />When I switched from the standard version to the Wet and Cold version, I found that some Khajiit NPCs would either continue wearing their old clothing, or wear no clothing at all. If this happens to you, try this:\r<br />\r<br />[list][*]Open the console[*]Select the NPC (try to target the face)[*]Type &#39;disable&#39; (without quotes) and hit Return[*]Type &#39;enable&#39; and hit Return[*]Close the console[/list]\r<br />\r<br />[line]\r<br />[size=5][b]Other Recommended mods[/b][/size]\r<br />[line]\r<br />\r<br />[list][*][url=http://skyrim.nexusmods.com/mods/37289//?]Bosmer Armor Pack[/url] - Excellent armors for Bosmer, already added to NPCs (in truth, I was going to add this myself, but didn&#39;t find the time, and Maty743 beat me to it&#33;)[*][url=http://skyrim.nexusmods.com/mods/18180]Diverse Priests[/url] - unlocks different-coloured monks robes. Religious diversity :-)[*][url=http://skyrim.nexusmods.com/mods/27345]Wilderness Thieves Wear Thieves Guild Armor[/url] - no more random pieces of glass armor&#33;[*][url=http://skyrim.nexusmods.com/mods/17720]Skyrim Peasant Fashion[/url] - more diverse colours for standard clothes.[*][url=http://skyrim.nexusmods.com/mods/31491]Morrowind Imports[/url] - adds wares from the Dragonborn DLC to a couple of merchants in the vanilla game.[*][url=http://skyrim.nexusmods.com/mods/25098]Hearthfire is a part of Skyrim[/url] - adds produce and other things from the Dawnguard DLC throughout the vanilla game.[*][url=http://skyrim.nexusmods.com/mods/46156//?]Prince and The Pauper[/url] - a clothing overhaul for children, given them upper, middle, and lower class distinctions.[*][url=http://skyrim.nexusmods.com/mods/10170//?]Gender and Race Heights[/url] - changes gender and race heights (duh) to be more diverse and lore firendly.[*][url=http://www.skyrim.nexusmods.com/mods/37460/]Dawn of Whiterun- Overhaul[/url] - a lovely overhaul which adds resources from Dragonbrn, including a Dunmer in traditional clothing :-).[/list]\r<br />\r<br />[line]\r<br />[size=5][b]Credits[/b][/size]\r<br />[line]\r<br />[list][*]Bethesda, for some reason, I can&#39;t remember what exactly.[*]granzh, for all the work on the hood textures. Thank you so much :-)[*]Dreamburrows, for permission to use the Regal Assassin Armor and Regal Hunstman Armor.[*]kimern88, for permission to use the Argonian Mercenary Armor and Marsh Armor.[*]Dragten, for permission to use Bandolier.[*]hothtrooper44, for permission to use the Akaviri Samurai Armor and Immersive Armors.[*]isoku, for help with the Wet and Cold plugin.[*]kristakahashi, for permission to do a plugin for Interesting NPCs (coming soon?)[*]VectorPlexus, for suggesting I use TextureSets to create standalone hoods.[*]patobek, for permission to use Crimson Ranger Armour and to make a standalone black texture set.[*]Everybody who takes the time to leave feedback and bug reports.[/list]\r<br />[line]\r<br />[size=5][b]My Other Mods[/b][/size]\r<br />[line]\r<br />[list][*][url=http://skyrim.nexusmods.com/mods/14513/]Khajiit Speak - Complete Dialogue Overhaul[/url][*][url=http://skyrim.nexusmods.com/mods/14430]Improved Race Descriptions[/url][*][url=http://skyrim.nexusmods.com/mods/15824]Skyforge Wolf Armor - Improved Stats[/url][*][url=http://skyrim.nexusmods.com/mods/16231]Reduced Gold Rewards for Quests[/url][/list]",
  "categoryId": "33",
  "version": "3.1BETA",
  "author": "Matthew Harper",
  "createdUnix": "1361315470",
  "updatedUnix": "1411056462",
  "containsAdultContent": false,
  "uploadedBy": "mjharper",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013629",
      "name": "Cultural Diversity 2_0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3758",
      "fileName": "Cultural Diversity 2_0-31985-2-0.7z",
      "uploadedUnix": "1361973957",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/e17b8074c39494a9001f38d752a743aa233155e2c7af643afe940c27d54b85dd/analysis/1407442309/",
      "changelogHtml": " Added Argonians and Dunmer <br/> \n Improved Wet and Cold compatibility <br/> \n A few other changes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cultural%20Diversity%202_0-31985-2-0.7z?fid=1000013629&ttl=1535807936&ri=8192&rs=8192&setec=5f240d83684c446a3d9367a1f16aefeb"
    },
    {
      "fileId": "1000043490",
      "name": "Cultural Diversity 2_5",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "39209",
      "fileName": "Cultural Diversity 2_5-31985-2-5.zip",
      "uploadedUnix": "1375443448",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/71bf6270c9b9202e75a22ce425d3e7cca7102ece39599b750f4f3b772f475585/analysis/1407666293/",
      "changelogHtml": " Changed Khajiit warriors to use Crimson Ranger Armor rather than Akaviri Samurai Armor <br/> \n Also included a standalone black texture version of the Crimson Ranger Armor (that&#39;s why the file is bigger than before&#33;) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cultural%20Diversity%202_5-31985-2-5.zip?fid=1000043490&ttl=1535807937&ri=8192&rs=8192&setec=a32eec89efe83fd72c7af05ce5a45156"
    },
    {
      "fileId": "1000081823",
      "name": "Cultural Diversity 3_0",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7008",
      "fileName": "Cultural Diversity 3_0-31985-3-0.zip",
      "uploadedUnix": "1385151027",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/bcb02197d6042573af36d84772c257c91461a3b3647cf4785f564bcc14159c99/analysis/1407803751/",
      "changelogHtml": " Khajiit armour is now based on Regal Huntsman Armor by DreamBurrows. <br/> \n Optional plugin for Moonpath to Elsweyr by muppetpuppet. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cultural%20Diversity%203_0-31985-3-0.zip?fid=1000081823&ttl=1535807937&ri=8192&rs=8192&setec=557cd8445e42b988fd7584885ac8bd26"
    },
    {
      "fileId": "1000081827",
      "name": "Moonpath to Elsweyr plugin",
      "version": "3.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "525",
      "fileName": "Moonpath to Elsweyr plugin-31985-3-0.zip",
      "uploadedUnix": "1385151119",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/6cff5e553c88ce2a73dc6b38e003f425710ee024e0ef4c35827d22e7335fc6c2/analysis/1407803752/",
      "changelogHtml": " Khajiit armour is now based on Regal Huntsman Armor by DreamBurrows. <br/> \n Optional plugin for Moonpath to Elsweyr by muppetpuppet. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moonpath%20to%20Elsweyr%20plugin-31985-3-0.zip?fid=1000081827&ttl=1535807938&ri=8192&rs=8192&setec=62b482ceb007641326a970c365b4deeb"
    },
    {
      "fileId": "1000127382",
      "name": "Cultural Diversity - Merged esp",
      "version": "3.1BETA",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5375",
      "fileName": "Cultural Diversity - Merged esp-31985-3-1.zip",
      "uploadedUnix": "1411056462",
      "modVersion": "3.1BETA",
      "virusScanUrl": "https://www.virustotal.com/file/8be16b96c8bc7ce5cf050ab74fb3fb0e8cd42430f0c0d9b5aaa8d1b65226dceb/analysis/1411056545/",
      "changelogHtml": " Added a merged esp containing all components. See comment sticky for details. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cultural%20Diversity%20-%20Merged%20esp-31985-3-1.zip?fid=1000127382&ttl=1535807938&ri=8192&rs=8192&setec=2f8360e08b45916e86fdab63b0c9c1b9"
    }
  ]
}