{
  "modId": 31995.0,
  "modName": "Homebrew Skooma - DELETED",
  "summary": "Requires Hearthfire. (Vanilla option now available)\r\n\r\nAllows you to brew skooma in the comfort of your own home, or not, it is up to you I guess.",
  "descriptionHtml": "Now includes vanilla version, see the section on Vanilla for information.\r\n\r\nVariant version requires Hearthfire.\r\n\r\nA small mod I made for myself to allow the option to brew skooma, not much else to tell really. Any ideas are welcome, but I am terrible at scripting (although I can do Fortran 90...). I am pretty certain this will have been done before, maybe even to a higher standard, but I put it here for the eventuality of needing to reinstall because of Dawnguard again.\r\n\r\nUnfortunately at the moment the process requires you build the oven in the Hearthfire kitchen addition, however, I am thinking of changing the setup to use cooking pots so that it can be created in a camp in mods like Frostfall, since it is such a widely used mod. Plus the sort of scum that usually sell skooma would probably be found in an encampment rather than a mansion.\r\n\r\nAt the moment, you need to use the console to complete the quest SKM01 by using the command:\r\n\r\nplayer.completequest SKM01\r\n\r\nThat will enable all the skooma recipes.\r\n\r\nThe normal variety of skooma is made using solely moon sugar and is independent of your alchemy level. The effect has been untouched.\r\n\r\nThis mod adds five variants of skooma:\r\nWeak (Watered Down Skooma)\r\nMedium (Medium Skooma) - requires Alchemy of 40\r\nStrong (Filtered Skooma) - requires Alchemy of 50\r\nStrongest (Triple Distilled Skooma) - requires Alchemy of 60\r\nSleeping Tree Skooma - requires Alchemy of 30\r\n\r\nEach of them is made with a form of extract obtained by baking certain foliage and other items, the extracts are pretty self explanatory on the whole (strongest is made with perfect extract). The extract can be used as a pretty potent ingredient for alchemy since the extract is meant to kill you if you ingest or inhale it, whether you use it to make potions is ultimately for you to decide.\r\n\r\nThe mod also adds an item called \\\"Bag of Sand\\\" which can be used at a forge to create Glass for a cheaper price (obviously your choice whether you use this feature) as well as wine bottles and empty skooma bottles (once the quest has been completed). The sand has been added to the lists for general goods merchants.\r\n\r\nCrafting process:\r\n\r\n1) Make empty skooma bottles with the sand at a forge.\r\n2) Use a cooking pot to boil some ingredients and get some extract.\r\n3) Use the cooking pot to mix the extract with some moon sugar and fill an empty bottle.\r\n4) Sell it or get high, I won\\'t judge you.\r\n\r\nCompatibility:\r\n\r\nAs far as I know this should be fine since all I did was add files. There is a script attached to the alchemist\\'s journal found near Evergreen Grove.\r\n\r\nWARNING!\r\n\r\nAll varieties (except sleeping tree skooma) currently have a drain health effect which I will tone down/remove in a later update, you have been warned.\r\n\r\nVANILLA VERSION:\r\n\r\nI felt that my mod was wrong so I made a much simpler version that is somewhat more toned down.\r\n\r\nIn this version there is no quest so the recipes will be there from the start. Also the variants have been removed and a single extract has been added (made from Nightshade) that will allow you to create vanilla skooma.\r\n\r\nThis option will have very little impact on your game since it only has three recipes:\r\n\r\nEmpty Skooma Bottle (requires 1 malachite ingot for 5 bottles) - Misc Item at forge\r\nNightshade Extract (requires 10 Nightshade) - Misc Item at cooking pot\r\nSkooma (requires 1 of each of the above and 1 moon sugar) - Misc item at cooking pot\r\n\r\nFuture Plans:\r\n1 - Add Images of the items you can craft.\r\n2 - Make a script that completes the quest by reading a specific alchemist\\'s journal (any pointers would be much appreciated since I have no idea).\r\n3 - Balance the skooma to be more sensible (suggestions welcome)",
  "categoryId": "94",
  "version": "1.1",
  "author": "TheJelleyMan",
  "createdUnix": "1361322916",
  "updatedUnix": "1361357023",
  "containsAdultContent": false,
  "uploadedBy": "thejelleyman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000011316",
      "name": "Homebrew Skooma Version 1_0",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "23",
      "fileName": "Homebrew Skooma Version 1_0-31995-1-0.zip",
      "uploadedUnix": "1361311938",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/10fed55e73bb3ac0bc627152270111b63f128138e9f047a410a155b082868f9f/analysis/1407427750/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Homebrew%20Skooma%20Version%201_0-31995-1-0.zip?fid=1000011316&ttl=1535807951&ri=8192&rs=8192&setec=ea0a3c6fb9432ae169d85925325c7faf"
    },
    {
      "fileId": "1000011458",
      "name": "Homebrew Variant Skooma Version 1_1",
      "version": "1.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "23",
      "fileName": "Homebrew Variant Skooma Version 1_1-31995-1-1.zip",
      "uploadedUnix": "1361356964",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a541adabe54eb940001823dce4f7cd66e22e54bf27b29bb54c0f8c982f494f01/analysis/1407428593/",
      "changelogHtml": " Extract now created at a cooking pot. <br/> \n Vanilla recipe now contains nightshade. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Homebrew%20Variant%20Skooma%20Version%201_1-31995-1-1.zip?fid=1000011458&ttl=1535807951&ri=8192&rs=8192&setec=0c8b924a297444b58924d775b775dc69"
    },
    {
      "fileId": "1000011459",
      "name": "Homebrew Vanilla Skooma 1_0",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1",
      "fileName": "Homebrew Vanilla Skooma 1_0-31995-1-0.zip",
      "uploadedUnix": "1361357023",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0ee56bf7057d4a28fe4187368077b2e58837df4ea72b7e4aad830039193bbca4/analysis/1407428594/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Homebrew%20Vanilla%20Skooma%201_0-31995-1-0.zip?fid=1000011459&ttl=1535807952&ri=8192&rs=8192&setec=1eb77b124e79618d303e5c1cb6d267e9"
    }
  ]
}