{
  "modId": 31996.0,
  "modName": "Lexi - Four-Shields Warrior - Quest - Combat",
  "summary": "A female warrior guarding the Dragon-Bridge tavern. You can side with Noriath, the leader of a small bandit group OR Lexi, a sexy imperial who guards dragon-bridge.",
  "descriptionHtml": "----------------------------------------MEET LEXI, FOUR-SHIELDS WARRIOR----------------------------------------------\r\n\r\nLexi is an adventurer, a warrior and a bounty hunter. She has been secretly followed by Niorath, a dark-elf bandit who\\'s men are constantly spying on her. Find Nioraths Journal and locate the four spies all over Skyrim and kill them all. This is an unmarked quest to make it more difficult, as map markers would make it too easy. This makes it lore-friendly too.\r\n----------------------------------------------------UPDATES AND NEWS-------------------------------------------------------\r\n\r\nThis mod is an unmarked quest mod which currently includes two new characters, one of which is a follower and a twist in the questline of Skyrim. \r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n=======================================WARNING==========================================\r\n\r\nLexi is NOT essential, nor will she ever be. Noriath isn\\'t essential either, for lore reasons. If you wish for her to be, leave a comment and if I get so many requests I will consider it. Personally I liked lore, and wish for there to be no essential characters- however, if I do get the time, I will recreate the mod and make Lexi and others essential. I planned for in days to come for there to be an option to side with Noriath or Lexi, but we shall see.\r\n--------------------------------------------------------GOT AN IDEA?------------------------------------------------------------\r\n\r\nIf you have an idea which is moderately easy to implement into the mod, feel free to leave a comment! I would love to hear from some of you creative players as lore can sometimes discard many decent ideas. \r\n-------------------------------------------------------ENDORSEMENTS----------------------------------------------------------\r\n\r\nIf you wish to support me, leave an endorsement. I am incredibly busy with exams, homework, revision etc at the moment but i\\'m sure if you leave an endorsement I can reschedule and maybe finish a few things off. Of course, at weekends i\\'ll have time- but you know how it is.\r\n-----------------------------------------------------TECHNICAL SUPPORT-----------------------------------------------------\r\n\r\nIf you have an issue, which you shouldn\\'t, DO NOT LEAVE A COMMENT INSTANTLY. First,\r\n*Reinstall the mod- if this dosn\\'t work, my mod is attacking another one of yours. If you can\\'t find out which,\r\n*Reinstall the game OR comment if you really aren\\'t sure. But I don\\'t want to have to spend twenty minutes replying to comments, you understand, right?\r\n--------------------------------------------------------AND FINALLY------------------------------------------------------------\r\n\r\nI hope you guys understand that i\\'m not a major \\'I play on the computer 23 hours and 59 minutes a day\\' person. I\\'m not an incredibly experienced modder and this is my first mod i\\'ve posted on the nexus. I will try and update as much as I can, and as the mod updates so will my modding skills. It could take a good few days before my next update because I don\\'t want to keep posting over and over again. If you have any ideas or support to share, please do. Thanks.\r\n\r\n                                        ",
  "categoryId": "33",
  "version": "0.2",
  "author": "JoeHeathcote",
  "createdUnix": "1361313871",
  "updatedUnix": "1361321760",
  "containsAdultContent": false,
  "uploadedBy": "JoeHeathcote",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000011375",
      "name": "Lexi - FourShields Warrior Fixed",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Lexi - FourShields Warrior Fixed-31996-0-2.rar",
      "uploadedUnix": "1361321760",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/00d99f260026ac3244f645e7f8f546b2145368230dec9a6684d347f6acd33709/analysis/1407428163/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lexi%20-%20FourShields%20Warrior%20Fixed-31996-0-2.rar?fid=1000011375&ttl=1535807953&ri=8192&rs=8192&setec=7fde0eb990404647d999f59abbce7073"
    }
  ]
}