{
  "modId": 32048.0,
  "modName": "Spanish Valores Adecuados Refuerzo de Armaduras",
  "summary": "Mejora, correccion de errores de armas y armaduras, cascos para capas de la tormenta y guardias",
  "descriptionHtml": "[center][color=#00ff00][size=6]ESTE MOD SE INCLUYE EN SPANISH SKYRIM RECONSTRUCTION[/size][/color][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/60019/?][img]http://static-4.nexusmods.com/15/mods/110/images/60019-1-1416161168.jpg[/img][/url][/center]\r<br />\r<br />\r<br />\r<br />=======================================Version Legendaria==============================================\r<br />\r<br />\r<br />INTRODUCCION\r<br />\r<br />\r<br />Esta es una version compatible con un monton de mods que integra algunas caracteristicas de otros pero que tiene unos altos requerimientos y mods que hay que usar para que funcione correctamente.\r<br />\r<br />\r<br />DESCRIPCION\r<br />\r<br />\r<br />Combina los aspectos de las armas de UU y UWR con los cambios en estar armas.\r<br />\r<br />Combina LFAP yWA, la armadura imperial pesada es sustituida por la armadura imperial heroica (solo aspecto) incluye guantes y botas y yelmo imperial cerrado, la armadura de jefe capa de la tormenta es sustituida por WA \r<br />\r<br />Algunos cambios en las armaduras de maestre del gremio y ruiseñor y algunas armas\r<br />\r<br />Compatibilidad con todos los mods descritos\r<br />\r<br />\r<br />REQUERIMIENTOS\r<br />\r<br />\r<br />Ultimo update\r<br />Dawnguard\r<br />Dragonborn\r<br />USP  http://skyrim.nexusmods.com/mods/19 (todos los unofficial son recomendados aunque funcionara bien sin ellos)\r<br />Unique uniques http://www.nexusmods.com/skyrim/mods/33292/?\r<br />Uniques weapons redone http://skyrim.nexusmods.com/mods/35770//?\r<br />Immersive Sounds - Aural Assortment http://www.nexusmods.com/skyrim/mods/49084/?\r<br />Warchief Armor http://www.nexusmods.com/skyrim/mods/13366/?\r<br />Lore Friendly Armor Pack http://www.nexusmods.com/skyrim/mods/6684/?\r<br />Stealth Skills Rebalanced - Sneak - Lockpicking - Pickpocket http://skyrim.nexusmods.com/mods/28418\r<br />\r<br />\r<br />RECOMENDADOS\r<br />\r<br />\r<br />Si almenos uno de estos 2 mods no esta instalado no funcionaran correctamente algunos cambios\r<br />\r<br />Weapons and Armor Fixes - Remade with Dawnguard support http://skyrim.nexusmods.com/mods/34844/\r<br />\r<br />Smithing Perks Overhaul - Remade and Updated http://skyrim.nexusmods.com/mods/33959/?\r<br />\r<br />\r<br />OTROS\r<br />\r<br />\r<br />Clothing and Clutter Fixes http://www.nexusmods.com/skyrim/mods/43053/?\r<br />Complete Crafting Overhaul Remade http://www.nexusmods.com/skyrim/mods/49791/?\r<br />\r<br />\r<br />OPCIONALES\r<br />\r<br />\r<br />Incluyo los esp traducidos y modificados de algunos mods para seguir respetando el equilibrio del juego(no son necesarios)\r<br />\r<br />Unique uniques traducido\r<br />\r<br />Uniques weapons redone traducido y se eliminan algunas armas que entraban en conflicto con el mod anrterior\r<br />\r<br />Immersive Sounds - Aural Assortment traducido\r<br />\r<br />Warchief Armor La armadura ya no se podra fabricar solo sustituye a la de los jefes capa de la tormenta.\r<br />\r<br />Lore Friendly Armor Pack Ya no se pueden crear ninguna de las armaduras a excepcion del set ligero enano, y la armadura imperial heroica solo actuara de sustituto\r<br />\r<br />\r<br />ORDE DE CARGA\r<br />\r<br />\r<br />1USP\r<br />2US..\r<br />3US...\r<br />4US...\r<br />5Weapons and Armor Fixes\r<br />6Clothing and Clutter Fixes\r<br />7LF armors\r<br />8Warchief\r<br />9Uniques weapons redone\r<br />11Unique uniques\r<br />12Immersive Sounds - Aural Assortment\r<br />13 Cualquier mod que añada armas o armaduras\r<br />14-30 Stealth Skills Rebalanced - Sneak - Lockpicking - Pickpocket\r<br />31-50 Valores realistas\r<br />50-100Complete Crafting Overhaul Remade\r<br />500 Smithing Perks Overhaul\r<br />\r<br />\r<br />NOTA\r<br />Este mod no incluye archivos de otros mods solo lo necesario para que funcionen todos juntos.\r<br />\r<br />\r<br />AGRADECIMIENTOS\r<br />\r<br />\r<br />kryptopyr\r<br />rahman530\r<br />hothtrooper44\r<br />lazyskeever\r<br />InsanitySorrow\r<br />QuarnAndKivan\r<br />SONNYSPAK\r<br />\r<br />¡¡¡¡Chicos sois increibles&#33;&#33;&#33;&#33;\r<br />\r<br />\r<br />\r<br />OTRAS RECOMENDACIONES GRAFICAS\r<br />\r<br />\r<br />Town Guards armor retexture http://skyrim.nexusmods.com/mods/2819\r<br />\r<br />Perfect Legionnaire - Imperial Armor Reforged 4-0 http://skyrim.nexusmods.com/mods/6085\r<br />\r<br />aMidianBorn Book of Silence http://skyrim.nexusmods.com/mods/24909\r<br />\r<br />aMidianBorn Textures For Immersive Armors and Lore-Friendly Armor Pack http://skyrim.nexusmods.com/mods/29167\r<br />\r<br />Nightingale Prime HD http://skyrim.nexusmods.com/mods/28899/\r<br />\r<br />Unique Dragon Priest Masks - HD textures http://skyrim.nexusmods.com/mods/35117\r<br />\r<br />Thieves Guild Armor HD revival http://www.nexusmods.com/skyrim/mods/46873/?\r<br />\r<br />Nightingale Pride - Bow Reincarnation http://skyrim.nexusmods.com/mods/33704\r<br />\r<br />Noldorian Dawnbreaker http://skyrim.nexusmods.com/mods/30291\r<br />\r<br />Elven Weapons for Silence http://www.nexusmods.com/skyrim/mods/27726/?\r<br />\r<br />Dwemer bronze and steel - Dwarven weapons recolor http://www.nexusmods.com/skyrim/mods/30998/?\r<br />\r<br />Glorious Daedric Retexture http://www.nexusmods.com/skyrim/mods/30612/?\r<br />\r<br />Glorious Stalhrim Retex http://www.nexusmods.com/skyrim/mods/32399/?\r<br />\r<br />Improved NPC Clothing - High Res http://skyrim.nexusmods.com/mods/2674\r<br />\r<br />Elaborate Textiles - NPC Clothing Retexture http://skyrim.nexusmods.com/mods/19826//?\r<br />\r<br />EotW Mage Equipment Overhaul - College Mage Robes http://www.nexusmods.com/skyrim/mods/49110/?\r<br />\r<br />EotW Mage Equipment Overhaul - Long Mage Robes http://www.nexusmods.com/skyrim/mods/49569/?\r<br />\r<br />Dawnguard Vampire Armors Retexture http://www.nexusmods.com/skyrim/mods/28014/?\r<br />\r<br />EcthelionOtW Mage Equipment Overhaul http://www.nexusmods.com/skyrim/mods/40592/?\r<br />\r<br />Jewels of the Nord - HD rings and necklaces http://www.nexusmods.com/skyrim/mods/27038/?\r<br />\r<br />Better Circlets HQ V1o1 http://skyrim.nexusmods.com/mods/6495//?\r<br />\r<br />\r<br />\r<br />=======================================Version 4.1==============================================\r<br />\r<br />INTRODUCCION\r<br />\r<br />Este mod trata de equilibrar y potenciar los objetos unicos de Skyrim y reajustar otros para darles un mayor uso y utilidad.\r<br />\r<br />DESCRIPCION\r<br />\r<br />-El vial blanco: Reajustado potencia y beneficios.\r<br />-Flecha élfica maldita con sangre: Aumenta su daño de 16 a 20, categorizada como elfica\r<br />-Flecha élfica bendecida por el sol: Aumenta su daño de 16 a 20, categorizada como elfica\r<br />-Equipo imperial, capas de la tormenta y guardias: Ahora son similares al acero y al cuero, corregidos errores de sonido y categorizacion\r<br />-Modifica armaduras y armas nordicas heroicas, la armadura es equivalente a la orca y las armas equivalentes al ebano.\r<br />-Anillo de la familia Sangre Argéntea: aumenta de 10 a 25% mejora de herreria.\r<br />-Piel del salvador: Aumenta de 15 a 35% su resistencia magica y baja de 50 a 35% resistencia a veneno y armadura de 26 a 34\r<br />-Botas de ruiseñor: Adquiere 15% de resistencia a fuego, escarcha y electricidad.\r<br />-Equipo de ruiseñor: Se aumento la potencia y efectos del resto del equipo.\r<br />-Anillo de Muiri: aumenta de 10 a 20% mejora de alquimia\r<br />-Botas de archimago: Se elimina su encantamiento (libre para encantar)\r<br />-Túnica de archimago: Aumenta de 15 a 25% la reduccion de coste de hechizos.\r<br />-Túnica de archimago con capucha: Aumenta de 15 a 25% la reduccion de coste de hechizos, de 100 a 150% de regeneracion de magia y +50 a magia.\r<br />-El lazo del matrimonio: La magia de restauracion cuesta un 10% menos,regenera salud un 10%y aumenta la capacidad de carga en 25, se puede usar como equipo adicional no ocupa ranura de anillo.\r<br />-Ropas de bufon: aumentan elocuencia y a una mano.\r<br />-Collar de Yisra:Reduce un 25% el coste de hechizos de destruccion.\r<br />-Anillo de Ilas-Tei: Reduce un 25% el coste de hechizos de ilusion.\r<br />-Botas de maestre del gremio: Adquiere reforzar trueque 25%\r<br />-Armadura de maestre del gremio: Adquiere mejora de robo 25%\r<br />-Guantes de maestre del gremio: Adquiere refuerzo a armas a una mano 25%\r<br />-Capucha de maestre del gremio: Adquiere refuerzo al robo 25%.\r<br />-Anillo de la bestia: aumenta de 20 a 35 el daño fisico y de 100 a 150 la vida, se puede usar como equipo adicional no ocupa ranura de anillo\r<br />-Anillo del erudito: Aumenta la magia de 100 a 150 y la regeneracion de magia de 2 a 50%\r<br />-Guardapelo de san Jiub: Aumenta su defensa de 5 a 25, aguante y carga de peso aumentan en 25.\r<br />-Todas las armas unicas aumentan el poder de sus efectos o añaden otros nuevos.\r<br />-Algunas modificaciones minimas en algunos equipos y armamento.\r<br />-Todos los objetos unicos con diferentes niveles de potencia se ajustaron y no existen diferencias (esto quiere decir que da igual a que lvl se obtenga.\r<br />\r<br />REQUERIMIENTOS \r<br />Requiere ultimo update, Dawnguard y Dragonborn\r<br />\r<br />ESPECTATIVAS\r<br />Con todos estos cambios lo que se pretende es que las recompensas y objetos unicos esten al nivel de los objetos mas fuertes que se pueda construir uno mismo y amplia la variedad de equipo util en el juego. Realmente me resulta bastante tedioso y arduo el comentar todos los detalles de los cambios de cada uno de los objetos modificados ya que requiere mucho mas tiempo que realizar los propios cambios. Intentare sacar una version totalmente compatible con W and A fix cuando disponga de mas tiempo.\r<br />\r<br />NOTA\r<br />Estos cambios no tendran efecto en equipos ya generados.\r<br />\r<br />COMPATIBILIDAD\r<br />Dado que se modifican numerosos objetos no se recomienda combinar con otros mods que modifiquen dichos objetos o colocar este mod en orden de carga inferior (si desea estos cambios)\r<br />\r<br />\r<br />=======================================Version 3.0==============================================\r<br />\r<br />Añadida nueva version compatible con unleashed y W&A fix, tambien se puede usar de forma independiente con sus requerimientos. Se añadio un cambio mas relacionado con el escudo de Auriel su efecto era muy poco notable, aumente su potencia y ahora sera algo a tener en cuenta que os hara dudar si es mejor o no que un escudo que proporcione defensa magica u otras cualidades. Tambien se equilibraron las armas de ruiseñor y todas tienen la misma potencia.\r<br />\r<br />Requerimientos: Update 1.9 o superior, dawnguard y dragonborn \r<br />\r<br />Recomendaciones: Se recomienda usar con unleashed y W and A fix remade\r<br />\r<br />Este mod trata de mejorar muchos objetos para tener valores mas equilibrados y realistas, tambien corrige algunos errores y bugs relacionados con armas y armaduras.\r<br />\r<br />=======================================Version 2==============================================\r<br />\r<br />&#34;Lo nuevo&#34; (se añade a la version 1)\r<br />\r<br />Este mod no estaba mal pero creo que se quedaba muy corto a si que se han añadido un monton de nuevas correcciones y equilibrio de todo tipo su intencion sigue siendo la misma pero esta vez se va a concentrar mas en objetos unicos que igualaran su potencia a objetos que podemos crear.\r<br />\r<br />Requerimientos: requiere dlcs dragonborn y dawnguard\r<br />\r<br />Descripcion:\r<br />-Se añade correccion al resto del equipo imperial, capas de la tormenta y guardias, tambien se aumento minimamente algunos complementos, los escudos de guardias y capas de la tormenta ahora se categorizan como ligeros.\r<br />-Amuleto de Saarthal: aumenta la potencia de su encantamiento de 3% a 10%\r<br />-Piel del salvador: aumenta su defensa de 26 a 32\r<br />-El amuleto de Gauldur: Aumenta tu salud, magia y aguante mejora en 20 y se regeneran un &lt;25&gt;% mas rapido.\r<br />-Ebony Mail: cambio de nombre a  Armadura de Boethiah, es categorizado como armadura ligera, disminuye su peso de 28 a 20 y su armadura de 45 a 42\r<br />-Morokei: aumenta su armadura de 5 a 21 se mejora con herreria de dragon.\r<br />-Nahkriin, Volsung, Krosis, Hevnoraak, Otar, Konahrik: se mejoran con herreria de dragon.\r<br />-Rahgot: Incrementa el aguante en 50 puntos y aumenta su regeneracion un 100% mas rapido. se mejora con herreria de dragon\r<br />-Vokun, Zahkriisos, Ahzidal, Dukaan: cambia a armadura ligera, se mejora con herreria de dragon, disminuye su peso de 9 a 5 y su armadura de 23 a 21\r<br />-Amuleto de nigromante: permite una invocacion o reanimado mas y la penalizacion cambia de 75% a 50%\r<br />-Escudo de Ysgramor: aumenta su defensa de 30 a 36\r<br />-Amuleto de Savos Aren: aumenta de 50 a 60 el refuerzo a magia\r<br />-Yelmo draugr incombustible: aumenta de 15 a 16 su armor y se categoriza como objeto draug en vez de daedrico\r<br />-Diadema del sabio: cambia de ligera a ropa, aumenta de 5% a 20% su mejora y su armadura se reduce a 0\r<br />-Escudo de auriel: ahora se mejora con daedrico y aumenta su armor en 2, 32 a 34\r<br />-Relicario de San Jiub: aumenta su armadura de 5 a 25\r<br />-Guantes de Miraak: aumenta su defensa de 7 a 11 (se mantiene como armadura ligera)\r<br />-Ropas Telvanni: aumenta su regeneracion magica\r<br />-Mascara de Cultista: cambia a armadura ligera disminuye su peso de 5 a 1 y su armadura de 17 a 15\r<br />-Miraak: (todas las versiones) cambia a armadura ligera, disminuye su peso de 5 a 1 y su armadura pasa a ser 21 en todas las versiones y + 100 a magia, mejorable con herreria de dragon y se corrige bug de grito.\r<br />-Grito Bentonica: su tiempo de recarga aumenta de 1 a 15\r<br />-Hacha del arrepentimiento: aumenta el poder de su encantamiento su daño de 22 a 30 y su critico, ategorizado como daedrico\r<br />-Maza de Molag Bal: categorizado como daedrico\r<br />-Volendrung: aumenta su critico se categoriza como daedrico\r<br />-Cráneo de corrupción: aumenta su poder al doble\r<br />-Bastón de Magnus: aumenta su absorcion de 20 a 50\r<br />-Hoja de ébano: adquiere los valores de unofficial \r<br />-Quebrantador de amaneceres: aumenta su daño de 12 a 14 y su critico, categorizado como daedrico\r<br />-Hoja de ruiseñor: (cada version) aumenta en 2 el daño, categorizado como daedrico\r<br />-Arco de ruiseñor: (cada version) aumenta en 1 el daño, categorizado como daedrico\r<br />-Arco de Karliah: aumenta ligeramente su velocidad de ataque,  categorizado como daedrico\r<br />-Espada de Harkon: aumenta su daño de 8 a 16, categorizado como daedrico\r<br />-Espada de Miraak: aumenta ligeramene su velocidad de ataque y 1 de daño por nivel del arma\r<br />-A todas las araduras se les hicieron cambios para aumetar su compatibilidad.\r<br />\r<br />Pues eso es todo, creo que son cambios justos y aumentaran la inmersion, asi como las recompensas y las ganas de buscar objetos unicos.\r<br />\r<br />\r<br />=======================================Version 1==============================================\r<br />\r<br />\r<br />Corrige: \r<br />-Desequilibrio de armaduras de ejercitos y guardias (no tiene sentido que tengan las peores armaduras del juego cuando en 5 min puedes conseguir una mucho mejor.\r<br />-Armaduras y armas Heroicas: Incluso con estas modificaciones sigue siendo mas facil conseguir una armadura orca, las armas eran casi iguales a las afiladas.\r<br />-Objetos dawnguard, con un poder real a su leyenda.\r<br />-Corona pesada de Hueso para craftear. \r<br />\r<br />Descripcion: \r<br />-Modifica armaduras imperiales, para ser como el cuero y el acero. (combina bien con perfect legionarie)\r<br />\r<br />-Modifica armaduras de capas de la tormenta y guardias para ser como el cuero y el acero. (las armaduras de oficial capa se cambiaron a armadura pesada y se corrigieron diversos errores de esta armadura) Adicional mente se añaden cascos mas realistas.\r<br />\r<br />-Modifica armaduras y armas nordicas heroicas, la armadura es equivalente a la orca y las armas equivalentes al ebano.\r<br /> \r<br />-Mejora arco de auriel (ahora es el arco mas poderoso e iguala a la ballesta) aumenta sus cargas y un 10% de velocidad de recarga y disparo (clasificado como cristal)\r<br />-Espada de harkon Mejora su encantamiento y ahora es equivalente al ebano y categorizada como tal\r<br />-Escudo auriel mejora su defensa en 1 aumenta su valor de venta a 3000, ahora se puede mejorar correctamente y categorizado como daedrico (puedo crear un parche para que sea ligero)\r<br />\r<br />-Añade corona de hueso para craftear, una vez se se termine la correspondiente mision. (no realice cambios en la corona)\r<br />\r<br />Requerimientos: requiere DLC Dawnguard\r<br />\r<br />Compatibilidad: deberia ser compatible con cualquier otro mod siempre que se cargue este en ultimo lugar, totalmente compatible con Weapons and Armor Fixes, Smithing Perks Overhaul, Complete Crafting Overhaul y Spanish Herreria de Dragon, creo que es incompatible con los guardias variados.\r<br />\r<br />Agradecimientos: a Dall que me ahorro el trabajo dejandome usar su mod. http://skyrim.nexusmods.com/mods/21983\r<br />\r<br />Recopilacion de mods: http://www.3djuegos.com/comunidad-foros/tema/19228710/0/mods-skyrim-14022013/\r<br />\r<br />\r<br /> ",
  "categoryId": "24",
  "version": "4.1",
  "author": "Incata",
  "createdUnix": "1361377194",
  "updatedUnix": "1393352799",
  "containsAdultContent": false,
  "uploadedBy": "incata",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025261",
      "name": "Valores realistas V2 texturas incluidas",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4154",
      "fileName": "Valores realistas V2 texturas incluidas-32048-2-0.rar",
      "uploadedUnix": "1366370981",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/8cd9bb2f4ccb5e6380d7b30e84ecbe07315cc5fefe85f6fa5075175140c0747c/analysis/1407529473/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Valores%20realistas%20V2%20texturas%20incluidas-32048-2-0.rar?fid=1000025261&ttl=1535808034&ri=8192&rs=8192&setec=fd9c5af40798bbca2caf59168d9bc20a"
    },
    {
      "fileId": "1000031673",
      "name": "Valores realistas V3",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4156",
      "fileName": "Valores realistas V3-32048-3-0.rar",
      "uploadedUnix": "1369663549",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/b50f9019ba948ef39f80a4a2efe9a7ed599f842689f3b1d3f6c84df0050e43ef/analysis/1407583270/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Valores%20realistas%20V3-32048-3-0.rar?fid=1000031673&ttl=1535808035&ri=8192&rs=8192&setec=2dc64684dd852d9783bab38c59234d3b"
    },
    {
      "fileId": "1000059245",
      "name": "Valores realistas V4",
      "version": "4.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4159",
      "fileName": "Valores realistas V4-32048-4-0.rar",
      "uploadedUnix": "1380290773",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/f4875b5af76a1ea3d672f06ecf03c73aedf7a78f3be78445e8574e9cbcf0c785/analysis/1407737213/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Valores%20realistas%20V4-32048-4-0.rar?fid=1000059245&ttl=1535808035&ri=8192&rs=8192&setec=3549166906008c803b0cc544c7b9c893"
    },
    {
      "fileId": "1000059883",
      "name": "Valores realistas V4-1",
      "version": "4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4159",
      "fileName": "Valores realistas V4-1-32048-4-1.rar",
      "uploadedUnix": "1380562587",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/06001e666dc7a13e0ee7a7676e7ed744dcac667db7cb39e40b750dc2af7f3433/analysis/1407740535/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Valores%20realistas%20V4-1-32048-4-1.rar?fid=1000059883&ttl=1535808036&ri=8192&rs=8192&setec=a9e7eb70595dd460aab068b84c7c3ad3"
    },
    {
      "fileId": "1000092416",
      "name": "Valores Realistas VLegendaria",
      "version": "4.5Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4162",
      "fileName": "Valores Realistas VLegendaria-32048-4-5Final.rar",
      "uploadedUnix": "1390242018",
      "modVersion": "4.5Final",
      "virusScanUrl": "https://www.virustotal.com/file/5ab50f4680d73a3e912fbf8bf50fb7918fceb6ef19324db1939435c7f0df95e8/analysis/1407894250/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Valores%20Realistas%20VLegendaria-32048-4-5Final.rar?fid=1000092416&ttl=1535808037&ri=8192&rs=8192&setec=67a237e6175b4e7bad818f8c45137e5d"
    },
    {
      "fileId": "1000092421",
      "name": "Spanish Immersive Sounds - Aural Assortment",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "Spanish Immersive Sounds - Aural Assortment-32048-1-0.rar",
      "uploadedUnix": "1390243163",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1c888723ddc407f0883a8d87c7586590a838584f8a6b4b22185a2c4126ea2d3d/analysis/1407894252/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spanish%20Immersive%20Sounds%20-%20Aural%20Assortment-32048-1-0.rar?fid=1000092421&ttl=1535808037&ri=8192&rs=8192&setec=4507e4d0ced8362e6c5f672f96d48c75"
    },
    {
      "fileId": "1000092422",
      "name": "Spanish Unique Uniques",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Spanish Unique Uniques-32048-1-0.rar",
      "uploadedUnix": "1390243289",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/26b94f06fc729d5950683038d592cad4614da70f5e94283e5ae2f92cd4119853/analysis/1407894423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spanish%20Unique%20Uniques-32048-1-0.rar?fid=1000092422&ttl=1535808038&ri=8192&rs=8192&setec=c0435cb15e42572fa552efe39ff17f17"
    },
    {
      "fileId": "1000092423",
      "name": "Spanish UniqueWeaponsRedone",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Spanish UniqueWeaponsRedone-32048-1-0.rar",
      "uploadedUnix": "1390243361",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/94013bca1e50536fe4824ac94f24beb1ce488e0823f2b693571fe74d6877719e/analysis/1407894424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spanish%20UniqueWeaponsRedone-32048-1-0.rar?fid=1000092423&ttl=1535808038&ri=8192&rs=8192&setec=9a10fdadb6a14fca58a63aa87784e32a"
    },
    {
      "fileId": "1000092424",
      "name": "Spanish LFarmors",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Spanish LFarmors-32048-1-0.rar",
      "uploadedUnix": "1390243450",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dee45f07a7988bcafebad2da248e018f21512a2ff5a39f778443f34e61cc0ad3/analysis/1407894424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spanish%20LFarmors-32048-1-0.rar?fid=1000092424&ttl=1535808039&ri=8192&rs=8192&setec=a52c068ffd306557be131c707e4850c2"
    },
    {
      "fileId": "1000092425",
      "name": "Spanish WA",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Spanish WA-32048-1-0.rar",
      "uploadedUnix": "1390243538",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4d6e633986133913a477690c676fb4c9f2af9c5ebc61dc85cd40ccb745cd857c/analysis/1407894425/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spanish%20WA-32048-1-0.rar?fid=1000092425&ttl=1535808039&ri=8192&rs=8192&setec=cc56a10f3fa23c9c7824c741d8b596f9"
    },
    {
      "fileId": "1000098741",
      "name": "Craftea la armadura del pajaro cantor",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Craftea la armadura del pajaro cantor-32048-1-0.rar",
      "uploadedUnix": "1393352585",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9c593ea2f4be111d9f5a56e48a29018c6987b3d4406378a4ddb4d37aaf84322d/analysis/1407949817/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftea%20la%20armadura%20del%20pajaro%20cantor-32048-1-0.rar?fid=1000098741&ttl=1535808039&ri=8192&rs=8192&setec=db729e75bf8b7900376a1e1539a30425"
    },
    {
      "fileId": "1000098742",
      "name": "Craftea la armadura del pajaro cantor compatible",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Craftea la armadura del pajaro cantor compatible-32048-1-0.rar",
      "uploadedUnix": "1393352799",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ba8cf13962561e2dd9e5b7e725bf8b674ea328165023544088211aba4f876245/analysis/1407949817/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftea%20la%20armadura%20del%20pajaro%20cantor%20compatible-32048-1-0.rar?fid=1000098742&ttl=1535808040&ri=8192&rs=8192&setec=bcf91622bc981cc93f498fd78682fedd"
    }
  ]
}