{
  "modId": 32096.0,
  "modName": "One-Handed Master Spellcasting",
  "summary": "Heavily changes the usefulness of the games master spells to make master  mages feel as strong as they should.",
  "descriptionHtml": "A mod that changes the way master spells are used. All spells at master level are now single handed and dualcastable.\r\nMany master spells can now be used on dragons in the dragonborn dlc.\r\n\r\nI also changed some of them to aimed spells rather than on self. Projectiles and Explosions display properly.(Except LS. Cant seem to make the effect not flicker. Unless its my ENB.) Also now that many are aimed, areas have been reduced greatly for spell balance reasons. Damage values on  master destruction spells also increased. (Havent decided if the destruction spells are too OP, i may make a version for less damage). \r\n\r\nThis is my first mod so i hope u like it! Please report bugs and i will work on them. Or try to at least.  Enjoy. Will update when i get time. Itshould be compatible with any mod that does not change the existing master spells. If you do have a mod that this would conflict with, use this after. I put it at the bottom of my mod list and it works just fine. Feedback + constructive criticism appreciated.\r\n\r\nV 1.1 Update\r\nAdded readme and changed some of the spells area/magnitude.  Firestorm is now aimed and more master spells are useable on dragons. New esp have a different name so if you are upgrading from 1.0 you must delete old files.\r\n\r\nDestruction:\r\nLightning Storm - 90 shock dmg per sec. Dualcasting increases magnitude.\r\nBlizzard - 40 Frost dmg per sec. For 15 seconds.  Resistance removed due to player resist altering dmg. Dualcast increases magnitude.\r\nFirestorm - 100/175/225 fire damage. Aimed spell in 1.1 Dualcast increases magnitude.\r\nIllusion:\r\nMayhem/Hysteria/Harmony - Aimed spells, affects up to lvl 30. Range reduced to 100 from 250. Dualcast effects magnitude.\r\nCall to Arms - 25% boost to weapon skills, increases hp and stamina.  Dualcast increases duration\r\nConjuration:\r\nThrall spells  (Frost,Flame,Storm,Dead)- last one week, dualcast effects duration.\r\nRestoration:\r\nBane of the undead - Aimed, affects up to lvl 30. 75 fire dmg per sec for 4 seconds to undead.  Dualcast affects magnitude.\r\nGuardian circle : 60 hp/sec. Turns undead up to 30.  Dualcast increases lvl affectted.\r\nAlteration:\r\nDragonhide: 80% DR for 45 seconds. Dualcast affects duration.\r\nMass paralysis - aimed, area lowered 25%. Dualcast affects duration.\r\n\r\nScroll changes will be up in a few days.\r\n\r\nI am releasing a new modpack next week and this is the first mod in it.  It will be centered mostly around mages and balancing classes.\r\nwill include:\r\n Alchemy and Enchanting Reworked\r\nOne-Handed Master Spellcasting\r\nImproved Staff Enchanting\r\nAltered alchemy and smithing perk trees\r\nWILL REQUIRE DAWNGUARD & DRAGONBORN\r\n\r\n1.9 may delay the release of the modpack. \r\n",
  "categoryId": "93",
  "version": "1.1",
  "author": "Brad2052",
  "createdUnix": "1361420480",
  "updatedUnix": "1361952887",
  "containsAdultContent": false,
  "uploadedBy": "brad2052",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013569",
      "name": "One-Handed Master Spells",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "One-Handed Master Spells-32096-1-1.rar",
      "uploadedUnix": "1361952887",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c8d2a5adf57b2f9534f970eea3475110100f95b922551c4c7b79275634fbc58c/analysis/1407442032/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/One-Handed%20Master%20Spells-32096-1-1.rar?fid=1000013569&ttl=1535808112&ri=8192&rs=8192&setec=bc53624dfbf0490432dd0c3e4bceb3b7"
    }
  ]
}