{
  "modId": 32100.0,
  "modName": "Secret of Breezehome",
  "summary": "Fully upgradable and Lore-Friendly redesign of Breezehome, spatially accurate and fit for a Thane, with a mysterious back story, secret tunnels, and several new NPCs.",
  "descriptionHtml": "** HEARTHFIRE REQUIRED **\r\n\r\nDESCRIPTION\r\n\\\"Secret of Breezehome\\\" is a fully upgradable re-design of Breezehome, but it\\'s also much more than that. It doesn\\'t include an actual quest, but it adds a mysterious back story to the origin of the house to explain why it contains some of its features.  What kind of features?\r\n\r\nOne of the biggest is a tunnel connecting the Whiterun Plains District to Skyrim, just outside the city walls.  This tunnel is a closely guarded secret, so neither the Jarl nor the steward mention it when you buy the house.  Clues are provided in the \\\"Home Decorating Guide\\\", which has been completely re-written for the new upgrades available.  More information comes by way of a mysterious note from the Jarl, which you\\'ll find if you succeed in opening up the secret passage.\r\n\r\nAnother noteworthy feature is the addition of NPCs, including a servant and bard, and many of which are trainers, followers, and/or marriage candidates.  (Another nice feature is that if you decide to marry your servant, another one will arrive to replace her.)  There is also an NPC I made and didn\\'t use, so I made her into a hireling and put her the Dead Man\\'s Drink in Falkreath.\r\n\r\nOf course, it adds all of the things that other mods have done (Arcane Enchanter, Blacksmith workshop, armor mannequins, weapons racks/plaques/cases...) but it also adds several NPCs, secret passages, a mine, and other goodies.\r\n\r\nWhy make ANOTHER Breezehome mod?  Well, the answer to that question is that I wasn\\'t satisfied with the ones I\\'ve downloaded and tried. A Thane of Whiterun should not live in a home with holes in the roof and floor.  The look and feel of the house is greatly improved, and the tired, old cliche of \\\"befitting a Thane\\\" is actually applicable here.  Also, other mods treat Breezehome like a Tardis from \\\"Doctor Who\\\", with doors and rooms opening up into areas where they shouldn\\'t. This home is spatially accurate, including what direction the underground tunnels lead to and the placement of fireplaces on multiple floors to use a single chimney.  A small addition was added in the back of the house but if you walk outside, you will see it\\'s there too.\r\n\r\nThis mod is lore friendly (if you allow for a dwemer-themed alchemy/enchanting lab) and as stated above, is fully upgradable.  If you start a new game, you will need to purchase the upgrades. It is also Hearthfire compatible (it\\'s actually required) and you no longer need to sacrifice your Alchemy Lab for a Child\\'s room.  You sacrifice an upstairs \\\"Private Office\\\" instead. \r\n\r\nI hope that you enjoy the mod.\r\n\r\n\r\nINSTALLATION\r\nTo install this mod, copy the files LAZT_BH.ESP and LAZT_BH.BSA to your Skyrim DATA folder.  \r\nThis folder is normally located at \\\"C:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\"\r\n\r\nWhen re-loading Skyrim, use a save game created OUTSIDE of Breezehome, then enter Breezehome. This only needs to be done the first time but it\\'s important.  See \\\"Item Storage\\\" note, below.\r\n\r\n\r\nCOMPATIBILITY\r\nHEARTHFIRE REQUIRED.  I intended to make this mod compatible with Heartfire, and succeeded, but somewhere along the line I did something so that the game crashes if you try to load this mod without Hearthfire. So now it\\'s not just Hearthfire-compatible, it\\'s Hearthfire-required. Oh well.\r\n\r\nThis mod is not dependent on any other mods.  (Except for Hearthfire.  See above.)\r\n\r\nI do not own Dawnguard or Dragonborn, but my 14-year old son does and he has tested this mod with both.  He says that it works fine but, not having verified this myself, I\\'m reticent to offer an ironclad assurance of compatibility.\r\n\r\nThis mod makes many changes to Breezehome. It will most likely conflict with other Breezehome mods.  \r\n \r\n\r\nITEM STORAGE\r\nThis mod includes new furniture and containers in Breezehome. The original player chest located in the Bedroom is the only original container retained in this mod.  (It is still in the bedroom but has been moved to the other side of the bed.)  Before installing this mod, you should move all of your items currently stored at Breezehome into this chest and save your game.\r\n\r\n\r\nHOME DECORATION\r\nBreezehome is fully upgradable in this mod.  Upgrades must be purchased from the Steward in Dragonsreach, just like in the unmodified \\\"vanilla\\\" game.  If you have already purchased upgrades, then you will NOT need to re-purchase them.  \r\n\r\n**Please note that the vanilla purchase options do not correspond to the modded purchase options**  \r\nSee below to determine how the vanilla and modded upgrades correspond to each other.\r\n\r\n    VANILLA\t -----BECOMES---------> MODDED\r\n    -----------------------------------------------------------------------------------------------------------\r\n    Houscarl ----------BECOMES---------> Housecarl and decorated Housecarl Quarters\r\n    Bedroom -----------BECOMES---------> Master Bedroom, Loft, and Servant/Bard Quarters\r\n    Living Room ------BECOMES---------> Living Room\r\n    Dining Room ------BECOMES---------> Dining Room\r\n    Kitchen ------------BECOMES---------> Kitchen and Basement Improvements\r\n    Loft ----------------BECOMES---------> Alchemy/Enchanting/Blacksmith Package\r\n    Alchemy Lab -------BECOMES---------> Private Upstairs Office\r\n    Children\\'s Room ----BECOMES---------> Children\\'s Room\r\n\r\nThe upgrades have been changed in order to prevent the Children\\'s Room from replacing the Alchemy Lab.  It now replaces the Upstairs Office.  The Breezehome \\\"Home Decorating Guide\\\" has been completely re-written to describe the newer decorating schemes.  (Please note that I did not modify any of the vanilla base objects in the game, so if you still have your original copy of the decorating guide you will notice that it is unchanged.  A newer copy has been placed in the bedroom and it is entitled \\\"Whiterun Breezehome Decorating Guide, Second Edition\\\".)\r\n\r\n\r\nDECORATIVE ITEMS\r\nYou will see many items throughout the house which are purely decorative.  Admittedly, there is some loot to find, but most of the items you see laying around (i.e. potions, quest items, daedric weapons) are static and cannot be picked up.  This is not an error, it is intentional.  (This mod was not intended to provide unbalanced advantages. There are plenty of other mods that do this already.)\r\n\r\n\r\nFUTURE DEVELOPMENT\r\nIf this mod is well-received by the Skyrim modding community, I\\'d like to follow through on plans to develop a back story and a quest line around the history of Breezehome and role of the Olhauser clan. At this point, any information provided in-game comes via the re-written Home Decorating Guide and a Handwritten note from the Jarl.  Time will tell if the feedback on this will be positive or negative. Thank you for downloading.  I hope you enjoy it.  \r\n\r\n   \r\nACKNOWLEDGEMENTS\r\nSpecial thanks to SLuckyD for providing the \\\"Vanilla Mannequin Script Fix\\\" and allowing modders like myself to use, redistribute, and/or modify his work under the terms of the Free Software Foundation GNU General Public License.  See http://www.skyrimforge.com/mods/vanilla-mannequin-script-fix/ more more information.",
  "categoryId": "67",
  "version": "1.0",
  "author": "LazarusTrout",
  "createdUnix": "1361433673",
  "updatedUnix": "1361433439",
  "containsAdultContent": false,
  "uploadedBy": "LazarusTrout",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000011746",
      "name": "Secret of Breezehome EXE self extracting",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1517",
      "fileName": "Secret of Breezehome EXE self extracting-32100-1-0.exe",
      "uploadedUnix": "1361432697",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/29b1e287006c0ed536ddf4202190531d8e071bebbc39a1825b51b32330d3014c/analysis/1407430656/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Secret%20of%20Breezehome%20EXE%20self%20extracting-32100-1-0.exe?fid=1000011746&ttl=1535808120&ri=8192&rs=8192&setec=99a49f92a6391f09f68dfec90d6c55ab"
    },
    {
      "fileId": "1000011748",
      "name": "Secret of Breezehome 7z file archive",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1358",
      "fileName": "Secret of Breezehome 7z file archive-32100-1-0.7z",
      "uploadedUnix": "1361433439",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2274cd245316d604138f7ce124666d7083b8c3d9409ab96f5e90ee9d68377c3a/analysis/1407430664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Secret%20of%20Breezehome%207z%20file%20archive-32100-1-0.7z?fid=1000011748&ttl=1535808120&ri=8192&rs=8192&setec=0966660c982f5a3af5f09bb0097b6d6c"
    }
  ]
}