{
  "modId": 32102.0,
  "modName": "A Race Overhaul Project- Dragonborn Edition",
  "summary": "A roleplay mod.",
  "descriptionHtml": "A Race Overhaul Project: Dragonborn Edition\r\nContents:\r\nI) Introduction\r\nII) Mod description\r\nIII) Installation\r\nIV) Conflicts and Bugs\r\nV) Coming soon\r\nV) Credits\r\n\r\n!!Warning:  This mod needs Dragonborn in order to work!!\r\n                                                               I\r\nIntroduction\r\n\r\nThis is a series of mods for the Dunmer only.  I made this mod for myself primarily, but decided to share it.  The mod is mainly for roleplaying purposes.  If you wanted to roleplay as a Dunmer wizard with deep roots in the Telvanni, then this mod is for you.  If you want be an honorable warrior who comes from a long line of proud Redoran warriors, then this mod is for you.\r\n\r\nThis mod is basically the same as my AROP mod.  The difference is in the type of ancestral ghosts you can summon and bonuses  For example:  If you are a Dunmer Wizard you can summon one of your Telvanni ancestors to aid you.  Thanks to Dragonborn they\\\\\\'ll have the proper attire.\r\n\r\n                                                                      II\r\nTelvanni Edition\r\n\\\"The Telvanni think that wisdom confers power, and power confers right.\\\\\\\"  --Great Houses of Morrowind\r\n\r\n\\\"House Telvanni matches the disposition of my brother Sotha Sil -- iconoclastic, profane, unconventional.\\\\\\\" – Vivec\r\n\r\nPowers:\r\n\r\nAncestor Worship: Once a day summon an ancestral ghost to fight by your side.  The ancestor you summon depends on your level.\r\n\r\nAncestral Ghost (Levels 1-10):  A simple farmer of no particular importance.  He lived and died peacefully.\r\n\r\nAncestral Mage (Levels 11-20):  An ancestor who was taking their first steps into magic.  Not yet worthy to join the ranks of House Telvanni.\r\n\r\nAncestral Sorcerer (Levels 21-30):  An ancestor who was a considerable mage in life, but not enough to draw the attention of the Telvanni.\r\n\r\nAncestral Wizard (Levels 31-40):  An ancestor who became a spellwright of House Telvanni.  But made no lasting impact.\r\n\r\nMythical Ancestral Wizard (Levels 41-50):  A powerful Telvanni wizard who rose to become Archmagister of House Telvanni, and who\\\\\\'s deeds and accomplishments are still talked about amongst the Telvanni.  Considered a legend of House Telvanni. It is not known exactly how he died.  Some say his apprentice killed him or was assassinated by the Morag Tong, who were acting at the behest of another Telvanni councilor.\r\n\r\nMythical Ancestral Wizard (Levels 51-100):  A permanent and more powerful version of the previous wizard.  Once you summon him he will stay with you until you banish him or gets killed.\r\n\r\nAncestor\\'s Wrath:  Unleash the the fury of your ancestors in an explosion of fire.  Fire damage scales according to your level.\r\n\r\nBanish Ancestral Ghosts:  As the title suggests, banish your summoned ancestors any time.\r\n\r\nTraits\r\n\r\nBlighted by Fate:  Generations of living in Vvardenfells volatile atmosphere.  The Dunmer have gained 50% resistance to disease.\r\n\r\nAshborn:  Azura\\\\\\'s curse has given the Dunmer a 50% resistance to fire.\r\n\r\nHarbinger of Destruction:  All destruction spells cost 30% less.\r\n\r\nMeric Heritage:  Due to a Dunmer\\\\\\'s Aldmeri heritage, there magicka regenerates 25% faster.\r\n\r\nTelvanni Heritage:  Due to your Telvanni heritage, all magic skills increase 10% faster.\r\n\r\nSkill Bonuses:\r\nAlchemy: 5\r\nAlteration: 5\r\nConjuration: 5\r\nDestruction: 10\r\nEnchanting: 5\r\nIllusion 5  \r\n\r\nRedoran Edition\r\n\r\nHouse Redoran prizes the virtues of duty, gravity, and piety. Duty is to one\\'s own honor and to one\\'s family and clan. Gravity is the essential seriousness of life. Life is hard, and events must be judged, endured, and reflected upon with due care and earnestness. Piety is respect for the gods and the virtues they represent. A light, careless life is not worth living. –Great Houses of Morrowind.\r\n\r\nPowers\r\n\r\nAncestor Worship: Once a day summon an ancestral ghost to fight by your side.  The ancestor you summon depends on your level.\r\n\r\nAncestral Ghost (Levels 1-10): A simple farmer of no particular importance.  He lived and died peacefully.\r\n\r\nAncestral Warrior (Levels 11-20):  One of the first people in your family to take up a sword.  Wears light chitin armor and wields iron sword.\r\n\r\nAncestral Guardian (Levels 21-30):  A capable warrior who was of some importance.  Wears light chitin armor and wields glass sword.\r\n\r\nAncestral Hero (Levels 31-40):  A capable warrior who did some noteworthy deeds.  Wears heavy chitin armor and wields ebony sword.\r\n\r\nMythical Ancestral Hero (41-50):  A powerful warrior and former Archmaster of House Redoran.  Has done many noteworthy deeds and is considered a legend among House Redoran. \r\n\r\nPermanent Mythical Ancestral Hero (Levels 51-100):  After level 50, you’ll be able to summon a permanent version of the ancestor above.  He remains until you banish him or he gets killed.\r\n\r\nAncestor\\'s Wrath:  Unleash the the fury of your ancestors in an explosion of fire.  Fire damage scales according to your level.\r\n\r\nBanish Ancestral Ghosts:  As the title suggests, banish your summoned ancestors any time.\r\n\r\nCommanders Voice:  Once a day rally your allies against your enemies.\r\n\r\nIntensive Training:  Due to your family’s strong ties to House Redoran.  You are able to do and absorb more damage once a day, for 60 seconds.\r\n\r\n\r\nTraits:\r\nBlighted by Fate:  Generations of living in Vvardenfells volatile atmosphere.  The Dunmer have gained 50% resistance to disease.\r\n\r\nAshborn:  Azura\\'s curse has given the Dunmer a 50% resistance to fire.\r\n\r\nRedoran Preserverance:  Your stamina regenerates 25% faster.\r\n\r\nHope of Redoran:  All combat skills and smithing increase 10% faster.\r\n\r\nSkill Bonuses:\r\nBlock: 5\r\nHeavy Armor: 5\r\nOne Handed: 5\r\nLight Armor: 10\r\nSmithing: 5\r\nTwo Handed: 5\r\n\r\nTribunal Edition:\r\n\r\nPowers:\r\n\r\nAncestor Worship: Once a day summon an ancestral ghost to fight by your side.  The ancestor you summon depends on your level.\r\n\r\nAncestral Ghost (Levels 1-10): A simple farmer of no particular importance.  He lived and died peacefully.\r\n\r\nAncestral Layman (Levels 11-20): A humble servant of Azura.  He lived a quiet and peaceful life, in service to his goddess.\r\n\r\nAncestral Acolyte (Levels 21-30): Monk in service to the Tribunal, is known mainly for his good works.\r\n\r\nAncestral Disciple (Levels 31-40): Priest who served the Tribunal faithfully and made a somewhat significant impact.\r\n\r\nAncestral Archcanon (Levels 41-50): A powerful priest and former patriach of the Tribunal.  Has done many great deeds and is forever remembered in the Temple.\r\n\r\nAncestral Archcanon (Levels 51 -100):  A permanent and more powerful version of priest above.  Will stay you with you until death, or is banished by player.\r\n\r\nAncestor\\'s Wrath:  Unleash the the fury of your ancestors in an explosion of fire.  Fire damage scales according to your level.\r\n\r\nBanish Ancestral Ghosts:  As the title suggests, banish your summoned ancestors any time.\r\n\r\nVoice of the true Tribunal:  Enlighten the lesser races with the Voice of the True Tribunal.  (Pacify’s hostlies)\r\n\r\nTraits:\r\nBlighted by Fate:  Generations of living in Vvardenfells volatile atmosphere.  The Dunmer have gained 50% resistance to disease.\r\n\r\nAshborn:  Azura\\'s curse has given the Dunmer a 50% resistance to fire.\r\n\r\nHarbinger of Destruction:  All destruction spells cost 30% less.\r\n\r\nMeric Heritage:  Due to a Dunmer\\'s Aldmeri heritage, there magicka regenerates 25% faster.\r\n\r\nBlessings of the Tribunal:  Due to your family’s dedication to the Temple, your Alchemy, Alteration, \r\nConjuration, Destruction, Restoration and Speech skills increase 10% faster.\r\n\r\n(^This was based on skills used by Danica Pure Spring and the Priestess of Azura.)\r\n\r\nSkill Bonuses:\r\nAlchemy: 5\r\nAlteration: 5\r\nConjuration 5\r\nDestruction: 5\r\nRestoration: 10\r\nSpeech: 5\r\n\r\nIII\r\n\r\nInstallation\r\n\r\nInstall to your Steam/Steamapps/Common/Skyrim directory.  Then in the data files menu pick the one you want.\r\n                                                                     IV\r\nConflicts and Bugs\r\nWill conflict with either Dunmer, Redoran, Temple and Morag Tong editions of this mod.  \r\nFor best results please put mod last in load order.\r\n                                                                    V\r\nComing Soon\r\nTemple and Morag Tong versions of this mod.\r\n                                                                         \r\nVI\r\n\r\nCredits\r\n\r\nSpecial thanks to Bethesda for releasing Skyrim and Dragonborn.\r\n\r\nSpecial Thanks to all the people who answered my questions in the Creation Kit forum.  Especially WillieSea and Xtynct, for teaching me how to make the leveled spells and getting them to work properly.\r\n\r\nTo Albinodunmer who gave me inspiration for my original, and who’s ideas this mod is based on.\r\n\r\nTo everyone who answered my many questions in the Creation Kit forum.\r\n\r\nVII\r\n\r\nRevision History:\r\n\r\nV1.0:  Initial release.\r\n\r\nV1.1: Redoran Edition released and added skill bonuses to Telvanni Edition.\r\n\r\nV1.2: Fixed Redoran ancestral ghosts .  Added Commanders Voice and Intensive Training to Redoran version.\r\n\r\nV1.3: Fixed Ancestral Wizard and added Tribunal version.\r\n\r\n!!Warning:  This mod needs Dragonborn in order to work!!\r\n\r\n\r\n\r\n",
  "categoryId": "24",
  "version": "1.3",
  "author": "Talyn82",
  "createdUnix": "1361433181",
  "updatedUnix": "1361769926",
  "containsAdultContent": false,
  "uploadedBy": "Talyn82",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013050",
      "name": "AROP- Dragonborn Edition",
      "version": "V1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "AROP- Dragonborn Edition-32102-V1-3.7z",
      "uploadedUnix": "1361769926",
      "modVersion": "V1.3",
      "virusScanUrl": "https://www.virustotal.com/file/7a87e4bc61eb77b05f28e3bf9392b91969a9257ac45f05687934cdfedf04a5f6/analysis/1407438552/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AROP-%20Dragonborn%20Edition-32102-V1-3.7z?fid=1000013050&ttl=1535808124&ri=8192&rs=8192&setec=9780553aae613fbc081e04b21f465b6e"
    }
  ]
}