{
  "modId": 32126.0,
  "modName": "Skaal heavy Armor by TumbaJamba and DVAted",
  "summary": "Short Description:\r\n\r\nThis mod pack provides players a new heavy armor set based on the Skaal Coat and Iron Armor, a new backpack model, makes the light Skaal armor craftable and also adds a custom boss character to fight against. Dragonborn DLC Required!\r\n",
  "descriptionHtml": "===>>> Heavy Skaal Armor <<<=== \r\n----> presented by DVAted <----\r\nCreated by the extremely talented modeller TUMBAJAMBA\r\n\r\nGUYS IF YOU LIKE THIS MOD AND OUR WORK PLZ ENDORSE AND HELP US TO GET ON HOT FILES. THX.\r\nDetailed Description:\r\nDragonborn DLC Required!\r\n\r\n[youtube]dEhM2qwtHFQ[/youtube]\r\n[youtube]Tvdgs1nuBvc[/youtube]\r\n\r\nInspired by the light-weight Skaal armor set (which has now also been made craftable and temperable at any forge) this mod pack uses vanilla assets to create an outfit suitable for those of you who like to wear Heavy armor and want to feel like a walking tank through the cold mountains of Tamriel.\r\n\r\nAlso, to lighten your load, we\\'ve added a new lore-friendly backpack model with a +60 carry weight enchantment.\r\n\r\nDVAted\\'s suggestion of building the Elder Scrolls\\' equivalent armor of a Juggernaut\\'s (heavy weapons specialist) attire sparked enough interest to inspire tumbajamba to act <and model> upon it. Together we\\'ve discussed each shape of the uniquely badass Heavy Boots, Gauntlets, Cuirass and 2 (yes: TWO) Helmet variations for the very peculiar tastes of each of you.\r\n\r\nIn our opinion we have achieved the goal of adapting a heavy winter coat to a heavier iron-plated armor that feels both epic and lore-friendly.\r\n\r\nAlso, for the sheer fun of it, we\\'ve added a boss-type character, Juggernaut, in the Highpoint Tower tunnel on Solstheim, in the Ashlands. If he\\'s not in the tunnel, you will probably find him wandering North - North-West or West of Highpoint Tower, stepping over some Ash Spawn with his large boots. \r\n\r\n!!!Be careful: he is high level, has a great deal of health and is very aggressive!!!\r\n\r\nBut he\\'s not overpowered, he actually doesn\\'t do much damage with his iron mace :) \r\nThis was designed for a nice long duel that you will remember, not for a quick and easy execution of either the NPC or, most frustratingly, of you.\r\nHe has a short background story in a letter in his inventory, to make the whole setup (and origin of the armor) as lore-friendly and believable as possible.\r\n\r\nFor these reasons he will not respawn. Once you kill him he\\'s dead and will only respawn if you uninstall the mod and install it again on a clean save. \r\n\r\n_________________\r\n_________________\r\n\r\nDevelopment:\r\n\r\nThe main armor cuirass of this mod is a modified Skaal coat plated with iron armor reinforcements. The boots and gloves are made of bear-fur and iron armor plates, while the helmet itself is a modified iron helmet with extra plating details and horker tusks. The crafting ingredients are according to the source material, although we\\'ve included snow fox and wolf pelts in for diversity\\'s sake.\r\n\r\nAs of v.2.0 there is now a custom armor model for female characters, based on the female Skaal coat! However, we refuse to take requests for any \\\"revealing\\\", \\\"bouncing boobs\\\" or \\\"skimpy\\\" versions. Thank you for understanding.\r\n\r\nAll armors (the original light Skaal outfit and the new Heavy Skaal armor set) can be crafted at the blacksmith forge under the Hide section, and they can be improved at the workbench.\r\nThe Skaal backpack can be crafted at any smithing forge under the Hide section, but cannot be improved as it has no armor rating.\r\nThe Skaal amulet can now be crafted at the forge under the Jewelry section, but cannot be improved as it has no armor rating.\r\n\r\nThe stats of the armors and weapons are balanced and lore-friendly.\r\nFor the Heavy Armor set, the values are:\r\nSkaal Heavy Boots - Weight 6.5 - AR 14\r\nSkaal Heavy Armor - Weight 33.0 - AR 40\r\nSkaal Heavy Gauntlets - Weight 6.0 - AR 13\r\nSkaal Heavy Helmet - Weight 5.0 - AR 14.5\r\nSkaal Horned Helmet - Weight 6.0 - AR 16\r\n(below Heavy Chitin and above Bonemold armor)\r\n\r\nFor the light armor we left the values vanilla, \r\nexcept for the Skaal Amulet whose weight we increased to 0.20 from 0.0, and dropped the monetary value from 1000 to 100 (to avoid it being used as an exploit to get money).\r\nThe backpack also has no armor rating, but a carry weight capacity increase of 60 points.\r\n\r\n_________________\r\n_________________\r\n\r\nCompatibilities & Conflicts:\r\n\r\nMods that modify the values of the light skaal armor are compatible. Mods that modify the Skaal Amulet will conflict, and only the mod whose .esp is lower in your load order will take effect.\r\nMods that make the light skaal armor or amulet craftable are compatible, but then they would have duplicate entries at the forge.\r\n\r\nMods that modify the Highpoint Tower exterior cell may cause the NPC Juggernaut to not appear, or he will fight the hell out of whoever else is around.\r\n\r\nOur models use only vanilla textures (we have actually not included any custom texture at all), so any retexture mods of either the Skaal outfit, the thief armor\\'s textures, the bear and horker creatures or the iron armor set will also affect the appearance of the Heavy Skaal Armor or of the backpack. This is not necessarily a bad thing, in fact it could actually look completely awesome!\r\nPost screenshots of your combinations of either :D\r\n\r\n_________________\r\n_________________\r\n\r\nUpdate History:\r\n- v.1.0 - Initial Release\r\n- v.1.01 - Backpack added\r\n- v.2.0 - Custom Female armor added\r\n_________________\r\n_________________\r\n\r\nArchive contents of the mod:\r\n- ReadMe.txt (not necessary for the mod to work, but read carefully before asking anything about the mod)\r\n- SkaalHeavyArmor.esp\r\n- SkaalHeavyArmor.bsa\r\n\r\n_________________\r\n_________________\r\n\r\n\r\nInstallation:\r\nPlace the .bsa and .esp files that came with this mod in your Skyrim\\'s Data Folder\r\n\r\n_________________\r\n\r\nUninstallation:\r\nRemove the .bsa and .esp files that came with this mod from your Skyrim\\'s Data Folder\r\n\r\n_________________\r\n\r\nBugs, Requirements and Conflicts:\r\nNone so far. Feel free to report and post suggestions. If you don\\'t like something, please provide constructive criticism. If you don\\'t like anything, please keep your thoughts to yourself.\r\n\r\n_________________\r\n\r\nCredits:\r\ntumbajamba - Fantastic Models & Rigging\r\nDVAted - mod idea, .esp and .bsa, detailed ReadMe.txt and organizing the project\r\n\r\n_________________\r\n\r\n\r\nDisclaimer:\r\nDo not upload this mod anywhere without specific permission from the authors. Do not post mediafire links on youtube videos! However, you may instead post direct links to the mod\\'s release page.\r\n\r\nThis mod is only to be uploaded by TumbaJamba on Steam Workshop and Nexus.\r\n \r\nDo not use assets of this mod in your own project or release without asking for, and if received permission - giving proper credit to the team. We may be very inclined to provide permission if we consider your plans worthy, so please ask us first. In any event, due credit for this mod should be considered holy. We\\'ve only worked at it with our blood, sweat and tears. Thank you ^_^\r\n\r\nWe\\'d love to see your screenshots and videos, though, so post as many as you can!\r\n\r\n_________________\r\n\r\nContact:\r\n- By direct comment on the mod\\'s release page!\r\n\r\n- By Skype on the ID \\\"alexe-arts\\\" for DVAted\r\nor on DeviantArt at alexe-arts.deviantart.com\r\n\r\n- By Private Message for tumbajamba on Nexus Forums",
  "categoryId": "54",
  "version": "2.0",
  "author": "TumbaJamba and DVAted",
  "createdUnix": "1361475304",
  "updatedUnix": "1361569309",
  "containsAdultContent": false,
  "uploadedBy": "tumbajamba",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012194",
      "name": "heavy skaal armor",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2237",
      "fileName": "heavy skaal armor-32126-2-0.zip",
      "uploadedUnix": "1361569309",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/e908ae5385b99fd673fd4055e7c9a1a2dc838a800d843912eca4130cf87d7018/analysis/1407433624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/heavy%20skaal%20armor-32126-2-0.zip?fid=1000012194&ttl=1535808157&ri=8192&rs=8192&setec=6baa0f8e45ac362c531d6fae3a9a908d"
    }
  ]
}