{
  "modId": 32168.0,
  "modName": "Inuyasha Weapon Tenseiga Sesshomarus Sword",
  "summary": "Sesshomaru\\'s weapon from the anime, Inuyasha. ",
  "descriptionHtml": "<<<Version 1.1 Whats New>>>\r\nYou NO LONGER Need the Bleach Total Conversion Mod to use this mod. Just use Mod Manager or copy the data folder to your skyrim directory!\r\nSTILL REQUIRES MARAS TOOL MOD!\r\n\r\n<<<Description>>>\r\n\r\nThis is Sesshomaru\\'s Weapon from the anime, Inuyasha. The colors aren\\'t exact. It\\'s a bit shiner, the pommels color is purple. Not exactly a exact replica but it has the same powers.\r\n\r\n\\\"The Tenseiga is a sword that belongs to Sesshomaru, and was once wielded by his Father. The sword has a special property in that it cannot harm any living beings, which is ironic for a sword. However its power lies in the fact that it can bring the recently dead back to life as well as healing the wounded. The sword was once part of Inuyasha\\'s Tessaiga. Tenseiga allows a powerful wielder to see and slay the beings from the underworld, as well as bringing up to 100 beings back to life in one swing. And it should be noted, that the Tenseiga has a mind of its own, as at various points, it has been seen talking to Sesshomaru by telling him things like wishing to be drawn or giving him advice. The same thing goes for Inuyasha\\'s Tessaiga.\\\"\r\n\r\nWhen attacking it will HEAL your opponent! Got an ally low on HP and in need of help, but you arent a mage class so cant heal them? Well no problem, just slash em with this sword and it will heal them! Get to your ally to late and find them dead? Still no problem! This sword will bring a dead person BACK TO LIFE!!!\r\n\r\nTo see the legendary sword in action, check out the video!\r\n\r\nThis is my first ever mod, I am NOT a modder, so if you can\\'t get this to work, or you would like to see something added to the mod, I most likely CANT help you. I just took a sword from another mod and an enchantment from another mod, slammed them together to make Tenseiga and called it done. So I do not know if the resurrection will keep the NPC alive nearly forever like the \\\"maras tool\\\" mod will. I also just noticed I spelled resurrect wrong in the swords description, ignore it.\r\n\r\n<<< Location>>>\r\nYou can buy Tenseiga from Belethor at Belethor\\'s General Store in Whiterun. If for some reason it doesnt show up hit the \\\"~\\\" key and type in \\\"help tenseiga\\\" and you should see something that says \\\"WEAP: (########) \\'Tenseiga\\' then type in \\\"player.additem ######## 1\\\" and it will be added to your inventory.\r\n\r\n\r\n\r\n<<<Required Mods>>>\r\nMaras Tool by AutGamer96 - http://skyrim.nexusmods.com/mods/31478\r\n\r\n---BIG THANKS TO----\r\nThanks to Viperslayer and Niagra127 for creating the katana I used for the texture/mesh of Tenseiga! \r\nThanks to AutGamer96 for the healing/Resurrection enchantment!",
  "categoryId": "55",
  "version": "1.1",
  "author": "Saint Grimm",
  "createdUnix": "1361516914",
  "updatedUnix": "1361535373",
  "containsAdultContent": false,
  "uploadedBy": "saintgrimm92",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012006",
      "name": "Tenseiga",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Tenseiga-32168-1-0.rar",
      "uploadedUnix": "1361513914",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c02e076739f03737d522c17bfe922551ddf535894da21c21a111064904b92350/analysis/1407432363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tenseiga-32168-1-0.rar?fid=1000012006&ttl=1535808233&ri=8192&rs=8192&setec=aab1803a04cda983c8e767c393d468f0"
    },
    {
      "fileId": "1000012049",
      "name": "Tenseiga",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "56862",
      "fileName": "Tenseiga-32168-1-1.rar",
      "uploadedUnix": "1361535373",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e1355e7ec148411dad934788b569a585136582b71695ed1f3a37124d8411d90c/analysis/1407432818/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tenseiga-32168-1-1.rar?fid=1000012049&ttl=1535808233&ri=8192&rs=8192&setec=852195224abb65bb4ab443d331d53d33"
    }
  ]
}