{
  "modId": 32170.0,
  "modName": "Lichs Soul",
  "summary": "Completely changes conjuration tree.",
  "descriptionHtml": "I changed Conjuration tree to be necromancer themed, this will also change the rate at which your skills level up.\r\nFirst mod I\\'ve put on nexus, and I\\'m only putting it here for personal reasons, however feel free to do whatever with it.\r\nI made this mod to take a break from GW2 but still play as a necromancer.\r\n\r\nMy first goal was to stack novice~master conjuration on to one perk which I renamed Lich Master and added another rank, then to make \\\"Keeper\\\" stronger.\r\nSo I added a ton more ranks to Dark Souls which I renamed Soul Shroud. The last picture in the list is a picture of Soul Shroud rank 12\\'s effect.\r\nI\\'ve changed Wrathman to Keeper summons that won\\'t provoke anything other than enemies.\r\nAt lower levels you will not be summoning Keepers yet.\r\nI made the Keeper summons be affected and gain increased stats by each Soul Shroud rank.\r\nI removed all bound and atronach perks, in exchange for overall stats.\r\nI increased the amount of summons you\\'re allowed to have by a great amount, which can be acquired by advancing in the Lich\\'s Soul tree. I sort of created a leveled spell that you get with the first perk in the tree.\r\nThe leveled spell greatly reduces damage,and increases your health magicka and stamina as you level up.\r\nAs you advance in this tree, so does your power, as you level up, so does your basic stats.\r\nAt a certain point I made it so that you can only choose 1 of 3 paths. Mastery of the paths require certain mastered skills and lv150.\r\n\r\nSoul Shroud - Summoner path\r\nIncrease the amount of allowed summons and further increases their potential, increase the amount of damage you take, and increase your spell magnitude/duration by how much Magicka you have.\r\n\r\nLich\\'s Shroud - Tank path\r\nSacrifices your ability to summon in exchange for high critical rate, critical damage, and armor, your critical damage will increase by how much health you have.\r\n\r\nDeath Shroud - Dragonsoul path\r\nIncreases your stats by a fair amount, you won\\'t have as much critical damage or armor as Lich, and you won\\'t be able to summon as much as Soul.\r\nAt the last rank, the more dragon souls you have, the more power you have.\r\n\r\nI\\'ve changed Keeper mobs AI a bit so that they only use the Lich Scythe, and added the spell and scythe needed for the full experience of the Lich\\'s Soul tree to their inventory. (The Keepers in the Soul Cairn btw.) I also increased Keeper stats and made it a leveled mob.\r\n\r\nThis mod requires version 1.8.151.0 of Skyrim or higher, and Dawnguard.\r\nIt also requires Lilith\\'s Sickle, which I\\'ve added in the file.\r\n\r\nRecommended mods are \r\nhttp://skyrim.nexusmods.com/mods/4406 Intense Difficulty \r\nhttp://skyrim.nexusmods.com/mods/25001 Darksiders 2 Reaper Form Robes\r\nhttp://skyrim.nexusmods.com/mods/1175 Elys Uncapper for the higher level effects I made.\r\n\r\n[Compatibility]\r\nFinally fixed all the bugs, the only thing this isn\\'t compatible with now is just conjuration overhauls.\r\n\r\n[Install]\r\nTo install it just extract the file in to your skyrim folder or download with NMM.\r\n\r\n[Credits]\r\nwiikki for making an amazing scythe. \r\nSKSE team for pure awesomeness.\r\nElys for the uncapper and semi-inspiration to play skyrim again.\r\nPlutoman101 for making a mod that can stand up against this.\r\nBethesderp and Anet for necromancer inspiration. xP",
  "categoryId": "40",
  "version": "1.3",
  "author": "contaejus",
  "createdUnix": "1361523970",
  "updatedUnix": "1361523970",
  "containsAdultContent": false,
  "uploadedBy": "contaejus",
  "primaryFile": null,
  "files": []
}