{
  "modId": 32178.0,
  "modName": "Spanish El Equilibrio de la Magia and Magic Master Balance English",
  "summary": "Mod dual language, the magic balance (no updating)\r<br />Mod Exclusivo en español para equilibrar la magia",
  "descriptionHtml": "[center][color=#00ff00][size=6]ESTE MOD SE INCLUYE EN SPANISH SKYRIM RECONSTRUCTION[/size][/color][/center]\r<br />\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/60019/?][img]http://static-4.nexusmods.com/15/mods/110/images/60019-1-1416161168.jpg[/img][/url][/center]\r<br />\r<br />(Nota: si lo que no les gusta del mod es que las armas vinculadas no tienen aura pueden usar [url=http://www.nexusmods.com/skyrim/mods/56614/?]Enchanted Arsenal[/url] yseleccionar el tipo de aura que queramos para estas armas y el resto de armas magicas).\r<br />\r<br />=====================================Español======================================\r<br />¿Cansados de preks que solo sirven para ciertos hechizos (habil, etc...) para luego acabar usando otros?\r<br />¿Las armas vinculadas hacen un daño de mierda en niveles altos y en dificultad alta?\r<br />¿Os gustaría llevar tunicas o ropas en lugar de armaduras? Joder es que muero al instante....\r<br />¿Veis inutil los perk de armadura de mago?\r<br />¿Os gustan mas los hechizos de destruccion de nivel experto que de nivel maestro pero hacen menos daño?\r<br />¿Quieres ser un mago que usa bastones sin ver mermada tu potencia?\r<br />¿No os gastais el perk de nivel maestro porque veis algunos hechizos de nivel maestro inutiles....?\r<br />¿Vuestras conjuraciones de nivel maestro no estan a la altura del combate?\r<br />¿Os gustaria revivir a cualquier criatura de forma permanente?\r<br />¿Quiere usar armas vinculadas de otro tipo a las originales?\r<br />¿No pueden reanimar a la criatura x por que es de excesivo nivel?\r<br />¿No quieres usar mods que puedan corromper tus partidas?\r<br />\r<br />¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡Este mod es para tí&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;\r<br />\r<br />=====================================Update===============================================\r<br />(solo para la version 5)\r<br />\r<br />Añado un archivo opcional que soluciona algunos bugs y fija algunos valores incorrectos.\r<br />\r<br />Debido a una limitacion del juego que yo desconocia parece que hay un limite maximo de hechizos a los que se les puede modificar el tiempo de casteo, esto producia en el juego que algunos hechizos tuvieran un tiempo de 0 segundos y otros igual al original, he fixeado esto y reorganizado el tiempo de los hechizos para que todos se comporten del mismo modo a si que la mayoria vuelve a un tiempo de casteo de 0,5 seg.\r<br />\r<br />A de mas gracias al usuario Dovahkiin56 (que es el que detecto el error) tambien esta arreglado el baston de conjurar familiar, ya que no aplicaba el nuevo sistema de familiares.\r<br />\r<br />Solo hay que sustituir el archivo principal por este (requiere el main ya que no incluye los meshes de las armas nuevas)\r<br />\r<br />=============================NUEVO (Opcional Beta)======================================\r<br />\r<br />Añado una version opcional que hace mi mod totalmente compatible con Staves of Skyrim http://www.nexusmods.com/skyrim/mods/22691/?.\r<br />\r<br />Lo unico que hay que hacer es sustituir el archivo principal de mi mod por este (requiere el main) y cargar mi mod por detras de Staves of Skyrim.\r<br />\r<br />Descripcion: Une las caracteristicas de estos 2 mods para hacerlos funcionar lo mas correctamente posible y aplicar los beneficios de unos a otros, a de mas he modificado algunos textos que no reflejaban correctamente los cambios de este mod, tambien se han añadido datos relacionados al DLC dragonborn. (ya incluye los cambios del update)\r<br />\r<br />¿Por que es una beta?\r<br />No he tenido ocasion de poder probarlo y aunque se que la mayoria de las cosas estan bien en otras tengo algunas dudas y no se si funcionaran correctamente. \r<br />¿Que cosas podrian no funcionar bien?\r<br />Principalmente hay 2 cosas sobre las que tengo dudas, una esta relacionada a la funcion de los instructores, (tanto para la alquimia como para los bastones) agradeceria que si alguien prueba estos tipos de instructores me comentara si funciona bien o existe algun fallo, a de mas esta entrada es modificada por dragonborn y no se si estos cambios afectaran en algo tambien (estan incluidos) El otro esta relacionado con la carga con el escudo, implemente una correccion del unofficial y faltaria probar si funciona bien con este mod.\r<br />\r<br />Cualquier persona que quiera probarlo o usarlo le agradeceria que me dejara un comentario, confirmando que esto funciona correctamente, gracias.\r<br /> \r<br />\r<br />===================================VERSION 5.0Final=====================================\r<br />\r<br />(mas detalles en las fotos)\r<br />\r<br />En esta (espero) ultima versión principalmente me centre en mejorar y solucionar diversos problemas con el uso de los bastones, en el juego original muchos de ellos no funcionan correctamente en aspectos tan variados como: duración, potencia (ridicula la mayoria un 50% menos que su hechizo equivalente), uso de ambas manos, categorizacion de material, aplicacion de perks sobre sus efectos etc, no vi ningun otro mod que trate este tema y los unofficial solo trataban 3 o 4 efectos yo trate mas de 30,  tambien me centre en hacer su uso mas atractivo y dar un sentido logico a que un mago use baston (merlin, gandalf por algo sera :) ) esta nueva version modificara todo esto y mucho mas.\r<br />\r<br />(todo esto se añade a la version 4)\r<br />\r<br />MODIFICACIONES.\r<br />\r<br />Familiares:\r<br />Los familiares ahora siguen una progresion similar a las armas vinculadas cambiando al familiar por uno mas poderoso (preferi hacer esto que añadir 5 hechizos)\r<br />Sin perk. Familiar lobo\r<br />Conjuración aprendiz. Familiar goto sable\r<br />Conjuracion novato. Facoquero\r<br />Conjuracion adepto. Cazador cauro\r<br />Conjuracion experto. Oso de cueva\r<br />Conjuracion maestro. Araña congeladora gigante\r<br />\r<br />Bastones:\r<br />Todos los bastones aumentan al doble su numero de cargas. (mas comodidad)\r<br />Corregidos todos los errores relacionados con los bastones. Ahora funcionan exactamente igual que los hechizos. (aplican perks, misma potencia etc)\r<br />Craneo de corrupcion y baston de magnus aumentaron su potencia.\r<br />Todas las potencias de todos los efectos de los bastones se equilibran con los valores de este mod.\r<br />\r<br />General:\r<br />La ejecucion de magias con ambas manos aumenta un 20% su poder. 2.2 a 2.4 x\r<br />\r<br />Todols los hechizos pasan a tener 0 segundos de casteo a excepcion de armas vinculadas, hechizos de nivel maesto y repulsiones o dominacion o exiliación. (faltaban algunos)\r<br />Todos los hechizos de nivel maestro pasan a tener 1,5 seg de casteo (faltaba alguno)\r<br />Las armas vinculadas se mantienen en 0,5seg.\r<br />El resto pasan a tener 1 seg de casteo.\r<br />\r<br />AÑADIDOS\r<br />\r<br />Se añaden 5 nuevos perks uno por cada rama magica intente que fueran habilidades utiles pero sin pasarme.\r<br />\r<br />Conjuración: Cuando se usan bastones puedes tener una invocacion adicional. (el limite con mi mod de razas son 4 invocaciones)\r<br />\r<br />Ilusión: Cuando se usan bastones aumenta nuestra salud y mana maximo en 50.\r<br />\r<br />Destrucción: Cuando se usan bastones aumenta el poder o/y la duracion de todos los hechizos un 40%.\r<br />\r<br />Restauración: Cuando se usan bastones regeneras tu vida constantemente (2 por segundo)\r<br />\r<br />Alteración: Cuando se uasn bastones aumenta nuestra defensa magica un 10%\r<br />\r<br />Se puede usar en cualquiere combinación y con cualquier arma que este categorizada como bastón\r<br />\r<br />Futuros planes: Quizas algun parche o complemento como armas vinculadas con fuego\r<br />\r<br /> \r<br />===================================VERSION 4.0Final=====================================\r<br />\r<br />INTRODUCCION\r<br />\r<br />Este mod trata de balancear la magia y volverla mucho mas peligrosa (equilibrada) y util, añadiendo una serie de cambios en habilidades, hechizos e invocaciones.\r<br />\r<br />DESCRIPCION\r<br />\r<br />PERKS (Habilidades):\r<br />\r<br />\r<br />-Dominio Conjuracion: Cada perk reduce un 10% el coste y aumenta un 20% su duracion (Tambien aumenta el daño de armas vinculadas\r<br />\r<br />-Dominio Alteracion: Cada perk reduce un 10% el coste y aumenta un 20% su duracion.\r<br />\r<br />-Dominio Ilusion: Cada perk reduce un 10% el coste y aumenta un 20% poder. (en este caso el nivel de eficiencia)\r<br />\r<br />-Dominio Destruccion: Cada perk reduce un 10% el coste y aumenta un 20% poder. (daño de hechizos)\r<br />\r<br />-Dominio Restauracion: Cada perk reduce un 10% el coste y aumenta un 20% poder. (daño y curacion)\r<br />(Son 25 habilidades en total)\r<br />\r<br />-Defensa Mistica: Aumenta nuestra defensa en 50 y añadira 40 mas de defensa por nivel de maestria de conjuracion si no se usan armaduras. (sustituye a Mystic Binding)\r<br />\r<br />-Esencia de piel de dragon: Otorga 400 de defensa si no se usan armaduras. (sustituye a Atronach)\r<br />\r<br />-Recarga de armas magicas: Las gemas de alma recargan 4 veces mas las armas. (mejora recarga de alma)\r<br />\r<br />-Sumdero de almas: Los golpes mortales atrapan un 10% del alma de la victima y funciona en humanoides. (mejora extractor de almas)\r<br />\r<br />\r<br />HECHIZOS\r<br />\r<br />-Se añades 6 nuevos hechizos de armas vinculadas; Maza, hacha a 1 mano, espadon, martillo de guerra, pico, hacha de leña. Estos nuevos hechizos se pueden adquirir en los vendedores habituales, son de nivel aprendiz (para maximizar su compatibilidad y uso) y su coste es de 300 de oro excepto para el pico y el hacha de leña que es de 49\r<br />\r<br />-Modificadas todas las armas vinculadas, aumentan de daño por nivel de maestria (incluidas las nuevas) todas tienen un efecto de desangre (10 de daño durante 3 seg) y se elimina el efecto visual de fuego. El ultimo nivel de cualquier arma vinculada aumenta su duracion a 300 segundos\r<br />\r<br />-Hechizos de destruccion maesto aumentan su daño en 50% y reducen su casteo a 1.5 seg.\r<br />\r<br />-Todos los hechizos maestros aumentan o disminuyen su casteo a 1.5 seg.\r<br />\r<br />-Valor: aumenta su duracion a 120 segundos.\r<br />\r<br />-Reagrupacion: aumenta su duracion a 120 segundos y aguante,salud en 50.\r<br />\r<br />-LLamada a las armas: aumenta salud y aguante en 125.\r<br />\r<br />-Respiracion acuatica: aumenta su duracion a 120 segundos.\r<br />\r<br />-Luz de mago dura 450.000 segundos y puedes tener 15 al mismo tiempo  \r<br />\r<br />-Luz de vela aumento su duracion al doble.\r<br />\r<br />-Las pieles de alteracion Ahora siguen una progresion de 40-80-120-160-200 y duran el doble.\r<br />\r<br />-Piel de dragon fue modificado para funcionar como las otras y otorga 200 de defensa (maximo 600)\r<br />\r<br />-Hechizos de reaimacion aumentaron su duracion al doble y el nivel de los resucitados.\r<br />\r<br />-Esclavo Muerto elimina su restriccion de solo funcionar con humanoides.\r<br />\r<br />-Todos los hechizos de Invocacion (a escepcion de armas y maestros) reducen su casteo a 0 seg.\r<br />\r<br />-Curacion aumenta su potencia un 50%\r<br />\r<br />-Paralisis y paralisis masiva reducen su duracion a la mitad. \r<br />\r<br />INVOCACIONES\r<br />\r<br />-Modificados todos los atronach, cambiado sus estadisticas y hechizos (ahora son algo a tener en cuenta, claro que los del enemigo tambien) segun hechizos y perks aumentaran su potencia.\r<br />\r<br />-Modificadas muchas invocaciones la mayoria ahora escalan a nuestro nivel.\r<br />\r<br />-Corregidos diversos bugs de invociones de dragonborn y los bugs de la daga vinculada tambien (ahora es un arma silenciosa en su golpeo)\r<br />\r<br />Con todos estos cambios la magia en skyrim adquiere una nueva dimension y no tendra nada que envidiar a las artes de combate.\r<br />\r<br />Requerimientos: Se requieren DLCs Dragonborn y Dawnguard.\r<br />\r<br />Compatibilidad: Debido a la gran cantidad de cambios que hace este mod no se recomienda combinar con otros mods de magia. Es totalmente compatible con mods que añadan hechizos (siempre que no añadan hechizos de conjuracion nivel novato, para lo cual se necesitaria compatibilizar) Pero puede haber diferencias entre los tiempos de casteo y duraciones, recomiendo mi mod de hechizos http://skyrim.nexusmods.com/mods/36997/? que añade 12 hechizos totalmente amigables al mundo de Skyrim y con tiempos iguales a estas modificaciones. Totalmente compatible con Immersive Creatures.\r<br />\r<br />VERSIONES\r<br />\r<br />Dejo la version 3 en archivos opciones si no quiere añadir hechizos nuevos (armas vinculadas) \r<br />\r<br />\r<br />Recopilacion de mods http://www.3djuegos.com/comunidad-foros/tema/19228710/0/mods-skyrim-14-07-2013/\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />====================================VERSIONES ANTIGUAS=================================\r<br />\r<br />\r<br />===================================VERSION 3.5====================================\r<br />\r<br />Añadidos 6 nuevos hechizos de armas vinculadas\r<br />\r<br />-Maza\r<br />-Hacha a 1 mano\r<br />-Espadon\r<br />-Martillo de guerra\r<br />-Pico\r<br />-Hacha de leña\r<br />\r<br />Se elimina el efecto de fuego de todos los hechizos incluidos los originales (esto mejorara la vision en primera persona)\r<br />Se añade un efecto de desangramiento de daño magico a todas las armas vinculadas\r<br />\r<br />Estos nuevos hechizos se pueden adquirir en los vendedores habituales, son de nivel aprendiz (para maximizar su compatibilidad y uso) y su coste es de 300 de oro excepto para el pico y el hacha de leña que es de 49\r<br />\r<br />\r<br />===================================VERSION 3.0====================================\r<br />\r<br />Correccion de algunos errores y modificados algunos hechizos.\r<br />\r<br />Pieles: se modifico el tiempo de usar skills en la mano izquierda (fallo mio)\r<br />Perdicion de los no muertos: modificado para ser potenciado con restauracion, no con destruccion\r<br />Violencia: modificado para ajustar su tiempo de carga como los demas 1,5seg\r<br />Invocar Arvak: aumenta su duracion vida y aguante\r<br />Invocar de Arniel Shade: mejora su magia y aguante, se le añaden nuevas habilidades.\r<br />\r<br />Otros cambios de menor importacion y correccion de algunos textos.\r<br /> \r<br />\r<br />===================================VERSION 2.5====================================\r<br />\r<br />Bueno esta version esta enfocada para una mayor diferenciacion entre magos que usen armaduras y los que no, aunque el mod equilibraba bastante el daño y los efectos aun se quedaba un poco corto en este aspecto, asi que estos cambios equilibraran y recompensaran a los magos que solo usen ropa \r<br />\r<br />Esto quiere decir que se añade la posibilidad de usar ropa como mago y no ver tu defensa mermada en comparacion a los que usen armadura, pero no disminuye la potencia de los que si usen armaduras. La diferencia es que unos subiran perks en armaduras pesadas o ligeras y los que usen ropas subiran mas perks en habilidades magicas como alteracion y conjuracion para aumentar su defensa.\r<br />\r<br />(entre otros cambios)\r<br />\r<br />Se añade o modifica:\r<br />\r<br />PERKS:\r<br />-Mystic Binding se cambio por Defensa Mistica, este perk ahora aumenta nuestra defensa en 50 y añadira 40 mas de defensa por nivel de maestria de conjuracion si no se usan armaduras.\r<br />\r<br />-Atronach ahora se llama Esencia de piel de dragon y otorga 400 de defensa si no se usan armaduras\r<br />\r<br />HECHIZOS\r<br />-Piel de dragon ahora requiere las condiciones de no usar armadura para ser potenciado. aumenta su duracion al doble y todas las demas pieles tambien\r<br />\r<br />-Armas vinculadas el ultimo nivel de cualquier arma vinculada aumenta su duracion a 300 segundos\r<br />\r<br />-Valor: aumenta su duracion a 120 segundos\r<br />\r<br />-Reagrupacion: aumenta su duracion a 120 segundos y aguante,salud en 50 \r<br />\r<br />-LLamada a las armas: aumenta salud y aguante en 125\r<br />\r<br />-Respiracion acuatica: aumenta su duracion a 120 segundos\r<br />\r<br />-Mejorada la traduccion (cosas nimias)\r<br />\r<br />Ahora si hay claras diferencias entre un mago que use armadura y uno que no la use y ambos viables incluso con mods que aumenten mucho la dificultad y al eliminar el efecto de absorcion de atronach eliminara el efecto visual al usar mods como dragon combat u otros.\r<br />\r<br />Nada mas gracias por los endorses.. cualquier duda o idea comenten\r<br />\r<br />(la version 2 solo esta disponible en español) (version 2 is only available in Spanish)\r<br />=====================================Version 2=====================================\r<br />Instalacion: eliminar la version 1 e instalar la 2 (el nombre del esp cambia)\r<br />\r<br />Version 2.1: Corregido un error que no permitia vincular las armas de mayor nivel, correccion de texto y un equilibrio mejor para dichas armas que alcanzaran valores similares a las armas daedricas mejoradas mediante herreria, la unica diferencia entre las armas invocadas es que los hechizos de mayor nivel tienen una progresion mas corta y unos valores iniciales mas altos por contra los de menor nivel tienes una progresion mucha mas pronunciada y requeriran mas nivel de maestria en conjuracion para aumentar notablemente su daño. \r<br />\r<br />¿Que trae nuevo?: \r<br />-Numerosos cambios relacionados con la invocacion, ahora las armas vinculadas ascienden de nivel por nivel de maestria de conjuracion (cree 4 armas nuevas por tipo de arma vinculada cada una con sus correspondientes caracteristicas). Ahora cada nivel de maestria en conjuracion mejora nuestras armas vinculadas.\r<br />\r<br />-Modificados todos los atronach, cambiado sus estadisticas y hechizos (ahora son algo a tener en cuenta, claro que los del enemigo tambien)\r<br />\r<br />-Modificadas muchas invocaciones la mayoria ahora escalan a nuestro nivel. Aumentado el tiempo y el nivel maximo de los reanimados.\r<br /> \r<br />-Corregidos diversos bugs de invociones de dragonborn y los bugs de la daga vinculada tambien\r<br />\r<br /> -Modificada la rama derecha de ecantamiento Recarga de alma perk aumento su potencia al doble y Sumidero de almas en vez de recargar 5 cargas por muerte ahora son 10 y le quite la restriccion de no funcionar con humanos (ahora es util y te puedes plantear usarlo) \r<br />\r<br />-Modifique la luz de mago para que dure 450.000 segundos y poder tener 15 al mismo tiempo (ya puedes decorar tu casa con luces de mago chulas ajajaja, si quieres quitarlas colocas mas luces y las primeras se van) luz de vela aumento su duracion al doble.\r<br />\r<br />-Mystic Binding se cambio por Defensa Mistica, este perk aumenta en 40 nuestra defensa\r<br />\r<br />Y no se si algo mas..... Espero no dejarme nada en el tintero, todos estos cambios se agregan a los que ya teniamos de la version 1 y creo que es un balanceo de toda la magia en Skyrim, si ven algo sin traducir o algo que se pueda mejorar no duden en comentar.\r<br />\r<br />Requerimientos: Se requieren DLCS Dragonborn y Dawnguard\r<br />\r<br />=====================================Version 1============================================   \r<br />Este mod trata de balancear la magia cambiando 25 perks de dominio magico, ahora cada perk aumentara un 20% el poder, y disminuira un 10% el coste (dependiendo de la rama aumentaran potencia y/o duracion) . Tambien se modificaron algunos hechizos para encajar mejor:\r<br />\r<br />Las armaduras de mago de alteracion Ahora siguen una progresion de 40-80-120-160-200\r<br />Piel de dragon ha cambiado y ahora da 200 de armadura, se beneficia del perk armadura de mago como los de mas pero no requiere uso de ropa para su efecto, se aumento el coste\r<br />(esto deberia hacer que los magos no fueran de papel y da un sentido logico a armadura de mago y piel de dragon, tambien se aumento su coste, para que los guerreros no se aprobechen de esto) \r<br />Paralisis y paralisis masiva: ahora su efecto dura la mitad (se puede aumentar con las maestrias)\r<br />Los 3 hechizos de nivel maestro de destruccion aumentaron un 50% su poder (ahora son utiles)\r<br />\r<br />Libre de scripts, sin requerimientos para la instalacion. Compatible con cualquier mod que no modifique estos perks o hechizos. ¿que mas quieres? jaajajaj\r<br />\r<br />Para hacer esto que parece facil he tenido que crear mas de 50 efectos y hechizos pero se asegura compatibilidad con otros mods.\r<br />\r<br />Balancea todo bastante bien a excepcion de conjuracion, se recomienda otro mod para balancear mas esta rama (añadir hechizos o mod que modifique invocaciones)\r<br />\r<br />=====================================English=======================================\r<br />\r<br />English is not my language cream, sorry if you do not understand well.\r<br />\r<br />This mod is 25 balance changing magic magical domain perks, now every perk increase by 20% power, and decrease by 10% the cost.\r<br />Some spells also modified to fit better\r<br />Ironflesh: Aument power and cost\r<br />Stoneflesh: Aument power and cost\r<br />Ebonyflesh: Aument power and cost\r<br />Dragonhide: change this skill, def Increase by 200 but get bonuses for any armor (maximum 600)\r<br />Mass Paralysis and paralysis: paralysis time reduced by 50%\r<br />LightningStorm, Blizzard and Fire Storm: Aument power by 50% and cost.\r<br />\r<br />Free scripts, without requirements for installation. Compatible with any mod that does not change these perks or spells\r<br />\r<br />Espero que les guste.\r<br />Recopilacion de mods http://www.3djuegos.com/comunidad-foros/tema/19228710/0/mods-skyrim-24022013/",
  "categoryId": "93",
  "version": "5.0Final",
  "author": "Incata",
  "createdUnix": "1361531962",
  "updatedUnix": "1404991878",
  "containsAdultContent": false,
  "uploadedBy": "incata",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012035",
      "name": "Magic Master Balance",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Magic Master Balance-32178-1-0.rar",
      "uploadedUnix": "1361531522",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8d09a01c148d1b287c8d8057ff60f6543d2580b66c7e2f4e2e6be2c33af16cfb/analysis/1407432638/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Magic%20Master%20Balance-32178-1-0.rar?fid=1000012035&ttl=1535808250&ri=8192&rs=8192&setec=7f4027c8d450273e4a4fef11cdd7f528"
    },
    {
      "fileId": "1000012036",
      "name": "Magia Maestra Balanceada",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Magia Maestra Balanceada-32178-1-0.rar",
      "uploadedUnix": "1361531641",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b9e45f9163948312706b6ff880caddd33952a8417ba23fcf13abb7b0446db062/analysis/1407432639/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Magia%20Maestra%20Balanceada-32178-1-0.rar?fid=1000012036&ttl=1535808250&ri=8192&rs=8192&setec=77970faa1cc81cc1c8a0a19f420fd32a"
    },
    {
      "fileId": "1000014691",
      "name": "El equilibrio de la magia v2",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14",
      "fileName": "El equilibrio de la magia v2-32178-2-0.rar",
      "uploadedUnix": "1362319128",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9a5fe9911da9566e62e5f387b5fa52216464edf10b3bda69dd5db7deda2dbca5/analysis/1407450022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/El%20equilibrio%20de%20la%20magia%20v2-32178-2-0.rar?fid=1000014691&ttl=1535808251&ri=8192&rs=8192&setec=b496afa82ae1945e552c0bf2d1b52a65"
    },
    {
      "fileId": "1000014807",
      "name": "El equilibrio de la magia v2-1",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14",
      "fileName": "El equilibrio de la magia v2-1-32178-2-1.rar",
      "uploadedUnix": "1362344495",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/54798e41c2daeb864e34f70a146a4362b84a4b52e103521a8d584b1d757f7f5b/analysis/1407451085/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/El%20equilibrio%20de%20la%20magia%20v2-1-32178-2-1.rar?fid=1000014807&ttl=1535808251&ri=8192&rs=8192&setec=9d75d1cb7ea338c35c9a49d3af0a21cc"
    },
    {
      "fileId": "1000028091",
      "name": "El equilibrio de la magia",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "El equilibrio de la magia-32178-2-5.rar",
      "uploadedUnix": "1367695223",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/39560fbe7178a8559ae27313451fc8bdf418603bc8bdd986040580eb6c94c9be/analysis/1407554831/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/El%20equilibrio%20de%20la%20magia-32178-2-5.rar?fid=1000028091&ttl=1535808252&ri=8192&rs=8192&setec=709c5667d98d454097b8462599bba54a"
    },
    {
      "fileId": "1000033472",
      "name": "El equilibrio de la magia",
      "version": "3.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "16",
      "fileName": "El equilibrio de la magia-32178-3-0.rar",
      "uploadedUnix": "1370788124",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/47ff28f00ab1b4055ecd61a47f136810578dd0e2d54ececf68c6b20376fa0b8b/analysis/1407597827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/El%20equilibrio%20de%20la%20magia-32178-3-0.rar?fid=1000033472&ttl=1535808253&ri=8192&rs=8192&setec=66cab26eff678c5e1871fb2d8816239d"
    },
    {
      "fileId": "1000036399",
      "name": "El equilibrio de la magia vinculada",
      "version": "3.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "837",
      "fileName": "El equilibrio de la magia vinculada-32178-3-5.rar",
      "uploadedUnix": "1372509024",
      "modVersion": "3.5",
      "virusScanUrl": "https://www.virustotal.com/file/6a4b35f336bc1a7a53a861fd2d791b308d4e5de7693736e8a0b9e3fae4823a9b/analysis/1407621608/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/El%20equilibrio%20de%20la%20magia%20vinculada-32178-3-5.rar?fid=1000036399&ttl=1535808254&ri=8192&rs=8192&setec=bfff9198c74f0f5616d5cc39a3dfc5ba"
    },
    {
      "fileId": "1000039744",
      "name": "El equilibrio de la magia",
      "version": "4.0Final",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "856",
      "fileName": "El equilibrio de la magia-32178-4-0Final.rar",
      "uploadedUnix": "1374283173",
      "modVersion": "4.0Final",
      "virusScanUrl": "https://www.virustotal.com/file/329603cfbf5614becf33b791b5a6e010c4baf70fbb39af7e96ea9a1e9904a940/analysis/1407649929/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/El%20equilibrio%20de%20la%20magia-32178-4-0Final.rar?fid=1000039744&ttl=1535808254&ri=8192&rs=8192&setec=7524f514244f0e639f3942c407ec4341"
    },
    {
      "fileId": "1000041771",
      "name": "Equilibrio de la magia ",
      "version": "4.0Final",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "839",
      "fileName": "Equilibrio de la magia -32178-4-0Final.rar",
      "uploadedUnix": "1375025200",
      "modVersion": "4.0Final",
      "virusScanUrl": "https://www.virustotal.com/file/823430309fb9fa42f2407bda89b18217f8a1a6dbc6c9f9cec986c4c208570403/analysis/1407658456/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equilibrio%20de%20la%20magia%20-32178-4-0Final.rar?fid=1000041771&ttl=1535808255&ri=8192&rs=8192&setec=4b28571fffd3cc50d6a127288bec07ad"
    },
    {
      "fileId": "1000090538",
      "name": "Equilibrio de la magia V5",
      "version": "5.0Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "848",
      "fileName": "Equilibrio de la magia V5-32178-5-0Final.rar",
      "uploadedUnix": "1389226348",
      "modVersion": "5.0Final",
      "virusScanUrl": "https://www.virustotal.com/file/84ada87d0d6435c1ed3c53f6605df3ed962e8cf31c2957de54bdef96298050f4/analysis/1407878166/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equilibrio%20de%20la%20magia%20V5-32178-5-0Final.rar?fid=1000090538&ttl=1535808255&ri=8192&rs=8192&setec=bfe1a64b7688931fe126c333598b601c"
    },
    {
      "fileId": "1000115410",
      "name": "Update magia",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32",
      "fileName": "Update magia-32178-1-0.rar",
      "uploadedUnix": "1404217521",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b48e23c006a18783c8f069d285b6f158f8b903b89a154f5a9f4cc762c0d1de93/analysis/1408155968/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20magia-32178-1-0.rar?fid=1000115410&ttl=1535808256&ri=8192&rs=8192&setec=f5328ae21a2c75256a346aec6c071ca6"
    },
    {
      "fileId": "1000116676",
      "name": "Actualizacion magia",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "32",
      "fileName": "Actualizacion magia-32178-1-1.rar",
      "uploadedUnix": "1404904991",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f3ff182374c681f2b0af7bd3e36bbcf4f4c5aba01e4d02409b016cec9d7e2f71/analysis/1408170668/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Actualizacion%20magia-32178-1-1.rar?fid=1000116676&ttl=1535808256&ri=8192&rs=8192&setec=9c64513bb5c541765911e7d0d9280050"
    },
    {
      "fileId": "1000116846",
      "name": "Equilibrio de la magia compatible Staves of Skyrim",
      "version": "5.01",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "61",
      "fileName": "Equilibrio de la magia coma Staves of Skyrim-32178-5-01.rar",
      "uploadedUnix": "1404991878",
      "modVersion": "5.01",
      "virusScanUrl": "https://www.virustotal.com/file/25a13d8669b180ea9e958ac7fc7a75e3195c9d56280154d5b7a48d10f1538d13/analysis/1408172192/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equilibrio%20de%20la%20magia%20coma%20Staves%20of%20Skyrim-32178-5-01.rar?fid=1000116846&ttl=1535808257&ri=8192&rs=8192&setec=dfb4d8c00aa2c820a2d8d80c7176c29d"
    }
  ]
}