{
  "modId": 32202.0,
  "modName": "Shockys Sorcerers Set",
  "summary": "This mod adds a whole new set of clothes for mages or anyone that dont want to use armor for one reason or another.  Chest piece will use same enchants as college robes of destruction, alteration etc. Gloves, hat and boots uses enchant typically found on armor pieces.",
  "descriptionHtml": "Shocky’s Sorcerer’s Set\r\n\r\nFound it hard to roll as none armor user due to the powerful enchants you miss out on? Maybe even use no armor perks or got unarmored mod? Then maybe you are in luck!\r\n\r\nIntroduction:\r\n\r\nThis mod adds a whole new set of clothes for mages or anyone that don’t want to use armor for one reason or another.  Chest piece will use same enchants as college robes of destruction, alteration etc. Gloves, hat and boots uses enchant typically found on armor pieces. The set was aimed to be as vanilla like as possible, while being a real alternative for players giving up armor. Some of the enchantments are new for the item slot, while blacksmithing enchant pieces isn’t dropped due this being mage set mostly and because having armor for blacksmithing purposes doesn’t really handicap you.\r\nThe missing enchants or at least very rare in vanilla; Night Eye, Water Breathing and Water Walking are in as well.\r\n\r\nWater Walking and Night Eye can be disenchanted and placed on another item. Water Walking use same restriction as stamina and Night Eye use magicka restriction. Water Breathing already got a set of restriction from developers (it didn’t look strict). \r\n\r\nNight Eye effect is unique for this set, so replacers won’t do anything for it, however I did completely remove the horrible nauseating blur effect at the edge of screen, rest of settings I tweaked to be a bit greenish like it was in Morrowind (saturation, contrast and brightness settings was inspired by Nocashs on Steam http://steamcommunity.com/sharedfiles/filedetails/?id=104079299).\r\nI might add more pieces, enchants and sets, more on that further down in readme. \r\n\r\nWhere do you find it? \r\n\r\nFound randomly at merchants (10% chance) and in chests, wardrobes, coffins and tomb urns etc. that makes sense (5% chance). Boss chests are the most reliable source (15% chance).\r\n\r\nSet consists of following:\r\n\r\nSorcerer’s Hat, mostly found randomly and for sale at merchants.\r\nSorcerer’s Hood, mostly found in boss chests.\r\nSorcerer’s Chest\r\nSorcerer’s Gloves\r\nSorcerer’s Boots\r\n\r\nI used vanilla items and tried my best to make a decent looking set for clothes. Hood is from the unplayable warlock/spell -bandit headpiece in vanilla game. Chest and Hat is mourner’s cloths combined with the black Fine Boots and Gloves that use same model as Focusing Gloves from mage quest. The gloves are slightly more dark blue then dark/black. Also, female version of chest got legs slightly clipping through skirt and might look a bit off in colors on arms in first person if field of view is set large enough. Or maybe only I have the problem, wouldn’t mind seeing screenshots.\r\n\r\nPower compared to vanilla items?\r\n\r\nThe clothes that can be found in containers might be a tier above in terms of enchants compared to armors, but I found it fairly balanced since the set is relatively rare and the fact it gives no armor. With other words skipped first tier with some of the enchantments.\r\nClothes at vendors tend to be more in line with armor found as far as enchants go, still might luck out in later levels however. Some vendors will sell full un-enchanted set for your enchanting pleasure including spouses that sell spells and misc. related stuff. A lot of vendors will have at least 1 piece of un-enchanted. \r\nTheir loot lists are intact; I just added my own loot lists without replacing, same with containers.\r\n\r\nSo does it play nice with other mods?\r\n\r\nI see no reason why it shouldn’t since all items is added under new ID, with Shocky in the name, but like always backup your saves before using a new mod.\r\nI did fix a few bugs I saw and added some misc. and cloth garbage loot to coffins, all of them where empty despite developers having an own loot list for them. So it feels more natural on rare occasions to find Sorcerer’s pieces.\r\nI also fixed the numbers on enchants for college robes; worst case scenario last mod to fix the robes goes last? I will clean with SkyEdit, this fix out if future patches fix this issue.\r\nAny mod that change on basic enchants used for all items in vanilla game will affect my set as well. Except night eye, water walking, resist poison and ultimate robes which are new with this add-on.\r\n\r\nHow do the tiers you speak of work? + More on drop chance and info.\r\n\r\nEnchants tend to go from t2-t6 while chests and magicka heads got an extra tier going from t1-t6.\r\nExample: Sorcerer’s Hat of Health, - of Major Health, - of Eminent Health, - of Extreme Health and – of Peerless Health.\r\nChest: Sorcerer’s Clothes of Alteration, Major, Eminent, Extreme, Peerless and newly added last tier called Ultimate.\r\nOn vanilla armor pieces it goes from: Minor up to Peerless.\r\n\r\nThe basic loot chance 5% from some containers, wardrobes, coffins (which didn’t have any loot any of them, so added chance for small amount of gold, 1 gem in some and random cloth piece) etc. The boss loot chests are 15%, all boss chests have the chance including the very few in numbers such as dwemer and falmer.\r\n\r\nUn-enchanted + t1 Magicka head and novice chest drops from level 1\r\nFirst tier from level 3\r\nSecond: 9 (Muffled boots, Night Eye, Water Breathing and Water Walking starts showing up)\r\nThird: 14\r\nFourth: 20\r\nFifth: 29\r\n\r\nMerchants have 10% chance of selling enchanted gear. Some of them will have extra pieces of un-enchanted pieces for sale. A very small amount of merchants have only chance for having boots in different flavors. Cat caravans and few others were I think merchants who sell magic related were a bit cramped.\r\n\r\nBasic Magicka, novice chests and un-enchanted: 1\r\nFirst: 5\r\nSecond: 13 (Muffled boots, Night Eye, Water Breathing and Water Walking starts showing up)\r\nThird: 20\r\nFourth: 29\r\nFifth: 36\r\n\r\nInstall/uninstall\r\n\r\nIt’s just a simple esp. atm. Place in data folder.\r\nWhen uninstalling I would strongly advise you to take off magic equipment just to be safe and save. Then remove the esp.\r\nI advise to use Nexus mod manager for easy mod installing and removing for bigger mods at least.\r\n\r\nFuture Plans\r\n\r\n-Depends on feedback, if requested I may add more enchanted pieces such as the basic 40+ health on chest etc. and bit more exciting enchants. First step was to add a cloth alternative with vanilla enchants that could have passed as baseline set from developers, lore and balance wise. If people find something wildly unbalancing I might change/tune the numbers. Then again the elder scrolls games have never had a perfect balance, which is good in most cases since it’s a single player game focusing on empowering the player with fun. If people want to make insane overpowered gear from blacksmithing, by all means, people will always find a way. :p\r\n\r\n-I sort of want to add artifacts (unique enchants), some hand placed in hidden locations, some carried by boss magicians and a few from loot chance only like current drops. So that might be coming.\r\n\r\n-Night Eye might need more tweaking, feedback?\r\n (Haven’t bothered upgrading my realistic lightning mod, so it might look quite different with others)\r\n\r\n-New cloth sets, maybe not as extensive as Sorcerer’s set.\r\n\r\n-Maybe put up some alternative looks of the set, or have it as alternative to vanilla appearance on items. Let’s face it; we didn’t get drowned in good looking cloth/robe alternatives in this game, or at least with enchants. So considering asking around for fancy looking robes, clothes being new models or retextures. Know nothing of the sort myself.\r\n\r\n-Why don’t I add the new set to enemies such as warlocks/generic baddie bandit in black robe? As tired I’m of default baddie spell caster all using the same robe, well…it’s hard to avoid touching basic enemy lists without causing incompatibilities. Not everyone knows Wrye Bash and I gave up on it last I tried to understand it. It also starts sounding like a total conversion mod, of the OOO, FCOM etc. kind from Oblivion (which was awesome), adding new factions, loot and enemies.  Still, I will see.\r\n\r\nPlease excuse my English and general mess, tried to clean up my readme as well as I could. \r\n\r\nPS! \r\nRequirements; NONE\r\nThe water walking effect has always been in game for Atronachs, all I did was to make new id for use on items. \r\n\r\nWarning! Water Walking boots + dismount horse in water = stuck.\r\n\r\nBtw, I cleaned out Riverwood Sleeping Giant Inn with TES5EDIT 3.0.28 so you will find no free loot or changes at all there. EVERYONE should use this tool.\r\nGophersVids at youtube will explain why this is a very good idea.\r\nhttp://www.youtube.com/watch?v=Re8YBJm9l64\r\nhttp://www.youtube.com/watch?v=UOQO2S6HDBw",
  "categoryId": "60",
  "version": "1.0",
  "author": "Dragon89  Shocky",
  "createdUnix": "1361568308",
  "updatedUnix": "1361564258",
  "containsAdultContent": false,
  "uploadedBy": "Dragon89",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012170",
      "name": "Shockys Sorcerers Set v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29",
      "fileName": "Shockys Sorcerers Set v1-32202-1-0.rar",
      "uploadedUnix": "1361564258",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5390651fef078132f169c5fd2960cd186a08308d6d7000e2ae8ada67b34f1f53/analysis/1407433384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shockys%20Sorcerers%20Set%20v1-32202-1-0.rar?fid=1000012170&ttl=1535808313&ri=8192&rs=8192&setec=0bcdcfb14ee41461da0bb1bc36ef1d26"
    }
  ]
}