{
  "modId": 32237.0,
  "modName": "Imbued Weapons - Bloodskal Effect with any Melee Weapon",
  "summary": "Adds a toggleable constant effect spell that adds a Bloodskal Blade effect to any melee weapon, one-handed or two. (Now with critical hits&#33;)",
  "descriptionHtml": "[size=30]OH MAN&#33; 2.1 - The &#34;I fixed the universe and decimated critical hits&#34; Update&#33;[/size]\r<br />\r<br />\r<br />[b][u]Note: With 2.1, SKSE is a requirement for damage calculations, also colour changes require toggling the lesser power off then on to take effect.[/u][/b]\r<br />\r<br />[size=5]I MADE A VIDEO YO[/size]\r<br />[youtube]0PxatNGzANo[/youtube]\r<br />[size=3]Skip to 5.00 if all you&#39;re interested in is Imbued Weapons, I&#39;m far too lazy to make separate videos.[/size]\r<br />\r<br />\r<br />[b][u]Latest Change&#33;:[/b][/u]\r<br />\r<br />[u]02/20/2014[/u]\r<br />Damage calculations no longer SUCK, but I broke critical hits down into a steaming pile of garbage to do it, they&#39;ll be back in and customizable at a later date. \r<br />\r<br />\r<br />[b][u]Description:[/b][/u]\r<br />This is a small mod that adds a toggle-able, constant effect lesser power, &#34;Imbue Weapon&#34;, toggle it on and any melee weapon will be capable of producing the same magic flinging effect as the &#34;Bloodskal Blade&#34;, now configurable with an MCM menu, you can either have the effects scale with the appropriate weapon skill, based on a (hopefully) balanced formula, or just set a value between 20 and 600 yourself.\r<br />\r<br />Now with critical hits&#33; By default these are governed by the critical hit perks in each weapon tree, should work still even with SkyRE, SkyPE or any other perk alterations as long as those perk entries still exist.\r<br />\r<br />15% critical chance with 1.35 severity for taking the first tier critical hit perk.\r<br />30% critical chance with 1.6 severity for second tier.\r<br />50% chance with 2.0 severity for final tier.\r<br />\r<br />Chance and severity can both also be overridden with their respective MCM sliders, a value of 0 maintains the above perk behaviour.\r<br />\r<br />To get started visit the &#34;Strange Shrine&#34; north of Silent Moons Camp, there&#39;s no map marker to it, map markers are for pansy casuals, be a manly explorer.\r<br />The third image at the top has the location circled if you&#39;re still lost, there IS a path leading up there too.\r<br />\r<br />\r<br />[b][u]Requirements:[/b][/u]\r<br />It does require Dragonborn since I&#39;m using the same mesh for the magic effect.\r<br />\r<br />SkyUI is not a requirement necessarily but the configuration menu is built with it, so without it you&#39;re on defaults only.\r<br />\r<br />SKSE however is a requirement as of version 2.1.\r<br />\r<br />\r<br />[b][u]Install:[/b][/u]\r<br />Click that handy &#34;Download with NMM&#34; button, then activate this bad boy.\r<br />Or if you&#39;re doing it manually, just extract the 7zip and throw the .bsa and .esp in your data folder.\r<br />\r<br />\r<br />[u][b]Remove:[/b][/u]\r<br />Deactivate, then send me a written apology for hurting my feelings so badly.\r<br />Or manually remove chfshimbuedsword.bsa and chfshimbuedsword.esp from your data folder.\r<br />\r<br />\r<br />[u][b]Conflicts:[/b][/u]\r<br />None&#33; At least there shouldn&#39;t be, technically this uses none of the same script, assets or effects as the Bloodskal Blade, the only thing it borrows is the projectile&#39;s mesh, so even modifications to the sword should work just fine with this.\r<br />\r<br />[u][b]Frequently Asked Questions:[/u][/b]\r<br />Q: Where is the shrine?\r<br />A: Exactly where the description and the picture show you.\r<br />\r<br />Q: I still can&#39;t find it&#33;\r<br />A: Check that the plugin is installed correctly and activated.\r<br />\r<br />Q: How do I change colours?\r<br />A: First, make sure you have SkyUI installed and activated, then wait til SkyUI registers new menus, then hit ESC/Start, hit Mod Configuration next to settings, Imbued Weapons, change whatever you want, go nuts.\r<br />\r<br />Q: Can you make it work properly while dual-wielding?\r<br />A: Nope, because those animations are awkward as hell to detect.\r<br />\r<br />Q: Do you expect anyone to read this?\r<br />A: Probably not.\r<br />\r<br />Q: Then why would you type it?\r<br />A: In the vain hope that maybe I&#39;ll get less comments asking about things I&#39;ve already explained.\r<br />\r<br />Q: Isn&#39;t it a little redundant since people who have read this far are not the people that will ask those questions?\r<br />A: Ah...shit...\r<br />\r<br />[b][u]Changelog:[/u][/b]\r<br />\r<br />[u]02/19/2014[/u]\r<br />Scripts have been rewritten almost entirely, they&#39;re now FAR more accurate and efficient.\r<br />\r<br />Bugfix: Everything, not even joking, everything works where it&#39;s supposed to and doesn&#39;t where it isn&#39;t pretty much perfectly, block bashing now no longer inexplicably triggers it.\r<br />\r<br />[u]07/08/2013[/u]\r<br />- After breaking the configuration menu almost completely, it is now fixed and working, yay go me.\r<br />\r<br />[u]07/07/2013[/u]\r<br />- Critical Hits&#33; - By default you gain crit bonuses to your Imbued Waves when taking the appropriate weapon skills critical hit perk, 15% chance with 1.35 severity for the first perk tier, 30% with 1.6 severity for second tier and 50% with 2.0 severity for final tier. - I realise the severity&#39;s are OP, it&#39;s by design, I like big fat sexy crits, queue the next change for those of you who do not.\r<br />- Customization sliders for both critical chance and severity, 0 values for either slider make them default to perk control as mentioned above.\r<br />- 1 sexy bugfix, changed the default value of 1 whole global so that by default damage scaling is governed by skill, instead of my MCM lying to first time users about it doing so...\r<br />\r<br />[u]05/23/2013[/u]\r<br />- 2 more colours, White and Gold, added to the MCM, created by user White Shadow\r<br />- Changed resulting damage to take Magic Resist into account since it actually wasn&#39;t\r<br />- Fixed effects/lighting effects discrepancies\r<br />- Raised the maximum value on the fixed damage slider to 600\r<br />- Fixed a couple of lingering conditions that could prevent the spell from firing under the right circumstances.\r<br />\r<br />[u]03/09/2013[/u]\r<br />- Now choose from a selection of colours within the configuration menu&#33;\r<br />\r<br />[u]03/08/2013[/u]\r<br />- Fixed sneak attacks triggering effect - note, as a side effect sneaking power attacks will no longer cast the effect, I don&#39;t really have another way around it, it&#39;s all or nothing with sneak attacks at this point unfortunately.\r<br />\r<br />[u]03/06/2013[/u]\r<br />- Can now consistently detect when block bashing as opposed to power attacking.\r<br />\r<br />[u]03/04/2013:[/u]\r<br />- MCM support added&#33; (Assuming I packaged everything correctly, lulz)\r<br />- Skill based damage scaling now changed to a super secret formula based on appropriate skill level.(Should be a bit more balanced now.)\r<br />- Sexied up this page&#33;\r<br />\r<br />[u]03/03/2013:[/u]\r<br />- Fixed up detection even more, should work flawlessly now, I hope.\r<br />\r<br />[u]03/03/2013:[/u]\r<br />- Changed toggle to lesser power.\r<br />- Moderate overhaul of script, detection should be significantly better.\r<br />\r<br />[u]02/26/2013 part 3:[/u]\r<br />- Forgot to add 1 little line that makes maces work, apologies for like, 3 updates in the space of an hour, me so tired.\r<br />\r<br />[u]02/26/2013 part 2:[/u]\r<br />- Now works with any melee weapon, be it one-handed or two, with appropriate scaling differences also&#33;\r<br />\r<br />[u]02/26/2013:[/u]\r<br />- Support for all battleaxe type weapons added, other weapon types will be easy to add from this point, but I need sleep.\r<br />\r<br />[u]02/24/2013:[/u]\r<br />- Increased damage output slightly at lower levels and significantly later on, feedback on the scaling would be appreciated.\r<br />- Added snazzy fx/sfx to the shrine interaction.\r<br />\r<br />[u]02/23/2013:[/u]\r<br />- Changed the name and description for now since for the time being this only works with greatswords. - FIXED&#33;\r<br />\r<br />\r<br />Big thanks to Verteiron on the Bethsoft forums for helping me wrap my head around...everything...animation related&#33;\r<br />Thanks to Schlangster also for his awesome SkyUI that allows even novice modders like myself to have nice presentable menus&#33;",
  "categoryId": "75",
  "version": "2.1.1",
  "author": "ChizFoShiz",
  "createdUnix": "1361609216",
  "updatedUnix": "1393642466",
  "containsAdultContent": false,
  "uploadedBy": "ChizFoShiz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097765",
      "name": "Imbued Weapons - No SKSE",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "98",
      "fileName": "Imbued Weapons-32237-2-0.7z",
      "uploadedUnix": "1392802077",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/c2d48e206cca0de092dc711cc72dfde54ac256f50a2b141e3ddb6b98401ee21c/analysis/1407940328/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imbued%20Weapons-32237-2-0.7z?fid=1000097765&ttl=1535808472&ri=8192&rs=8192&setec=840f11ea65713ead16cd1a01ad4b8e48"
    },
    {
      "fileId": "1000097898",
      "name": "Imbued Weapons",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "99",
      "fileName": "Imbued Weapons-32237-2-1.7z",
      "uploadedUnix": "1392881085",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/0e7b137ec45b1304d8f1c49b75ed956fdb405e1562e9005635269feb9565f678/analysis/1407941780/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imbued%20Weapons-32237-2-1.7z?fid=1000097898&ttl=1535808472&ri=8192&rs=8192&setec=f617d173cb3a99912ce6c40a6d7e50a9"
    },
    {
      "fileId": "1000099209",
      "name": "Imbued Weapons",
      "version": "2.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "99",
      "fileName": "Imbued Weapons-32237-2-1-1.7z",
      "uploadedUnix": "1393642466",
      "modVersion": "2.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bfc61e60be8deb79e0a086c388386834980c4c70941f15cc134e7657aa01eae5/analysis/1407954548/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imbued%20Weapons-32237-2-1-1.7z?fid=1000099209&ttl=1535808473&ri=8192&rs=8192&setec=0ee1068938e6ede5eadf18da58eb206d"
    }
  ]
}