{
  "modId": 32244.0,
  "modName": "The Gourmet Recipes",
  "summary": "Custom Cooking & Cuisine À La Carte",
  "descriptionHtml": "[center][size=30][color=#0054a6]THE GOURMET RECIPES[/color][/size][/center]\r\n\r\n[center][url=http://www.hostingpics.net/viewer.php?id=576742TGRIntro.jpg][img]http://img15.hostingpics.net/pics/576742TGRIntro.jpg[/img][/url][/center]\r\n\r\n[center][size=+4][color=#0054a6]Custom Cooking & Cuisine À La Carte[/color][/size][/center]\r\n\r\n\r\n\r\n[size=+2][color=#0054a6]I) DESCRIPTION[/color][/size]\r\n\r\nCooks of Skyrim tired of their usual food can now demonstrate their culinary skill and their taste in gastronomy. THE GOURMET RECIPES is a custom cooking mod which let you create your own Recipes, by selecting every detail from Ingredients to Name, for a full customization of your meals.\r\n\r\nStarting as simple Kitchen Boy, you will improve your Cooking Level (from 0 to 100) tracked in your Cook Diary by creating Recipes (to a current maximum of 32), cooking or eating them, to become the new Gourmet of Skyrim. Becoming a better cook will let you use more Ingredients (from 4 to 8) and in largest Quantities (from 3 to 5 pieces) in your Recipes, increase progressively the prices of your meals to twice their initial values, and improve their quality with a small random chance to have extra Ingredients consumed -besides the original quantities- when you\\'ll savour your own food.\r\n\r\nBon Appétit !\r\n\r\n\r\n[size=+2][color=#0054a6]II) USAGE[/color][/size]\r\n\r\n  1) Open the Book Of Recipes and select a new Recipe to create. Wait for the scan of the Ingredients of your Inventory.\r\n\r\n  2) Choose at least 2 different Ingredients and validate to continue. The Weight of the Recipe is automatically calculated and is equal to the sum of the Weights of all Ingredients divided by 2, while the Value of the Recipe is equal to the sum of the prices of all Ingredients multiplied by the percentage of your Cooking Level.\r\n\r\n  3) Choose the Appearance of the Recipe between 35 Skyrim models of various foods and drinks, choose the Cookpot as cooking mode and validate. \r\n     Hearthfire users can select one of 23 additional models, and have also the possibility to cook at the Oven.\r\n\r\n  4) Give the Recipe a Name with at least one character by using the real Keyboard (type) or the virtual one (click on characters), and give an optional Description. Validate to create the Recipe.\r\n\r\nYou can change the Names and the Descriptions of your created Recipes as many times you want, or choose to delete them from your Book to make space for new Recipes.\r\n\r\nIMPORTANT : Recipes containing Ingredients from mods must be deleted before you remove the concerned mods.\r\n\r\n\r\n[size=+2][color=#0054a6]III) LANGUAGES & COMPATIBILITY[/color][/size]\r\n\r\nThe Gourmet Recipes is compatible with English, French, Italian, German & Spanish keyboards and versions of the game. English settings are used by default for all others versions. Language & Keyboard are automatically attributed on start but can be changed at any moment. \r\n\r\nThis mod should be compatible with most of Needs/Survival mods.\r\n\r\n\r\n[size=+2][color=#0054a6]IV) KNOWN PROBLEMS[/color][/size]\r\n\r\n* Values of the Recipes can not be changed dynamically and will always be of 1 septim. You will though receive the correct amount of gold when you\\'ll barter.\r\n\r\n* Insolvable issues of wrong cases in Names & Descriptions.\r\n\r\n\r\n[size=+2][color=#0054a6]V) UNINSTALLATION & UPDATES[/color][/size]\r\n\r\nThis mod must be uninstalled with the \\\"Uninstall\\\" option. Future updates *should* be possible the old way.\r\n\r\n\r\n\r\nLOG :\r\n\r\n02/23/2013 Version 1.0 : Initial Release\r\n\r\n\r\nREQUIREMENTS : Skyrim 1.8, SKSE 1.6.6 & SkyUI 3.1\r\n\r\nPERMISSIONS : No permissions of re-upload nor modifications of any kind. This mod is also exclusive to Skyrim Nexus and TES Alliance.\r\n\r\nCREDITS : Bethesda, the SKSE & SkyUI teams\r\n\r\n\r\n********************************************************************************************************************************************************************************************\r\n********************************************************************************************************************************************************************************************\r\n\r\n[center][size=30][color=#0054a6]LES RECETTES DU GOURMET[/color][/size][/center]\r\n\r\n\r\n[center][size=+4][color=#0054a6]Cuisine À La Carte[/color][/size][/center]\r\n\r\n\r\n\r\n[size=+2][color=#0054a6]I) DESCRIPTION[/color][/size]\r\n\r\nLes cuisiniers de Bordeciel lassés de leur nourriture habituelle peuvent maintenant démontrer leur talent culinaire et leur goût en gastronomie. LES RECETTES DU GOURMET est un mod de cuisine personnalisée qui vous permet de créer vos propres Recettes, en sélectionnant chaque détail des Ingrédients au Nom, pour une personnalisation complète de vos plats.\r\n\r\nDébutant comme simple Marmiton, vous améliorerez votre Niveau de Cuisine (de 0 à 100) suivi dans votre Journal Du Cuisinier en créant des Recettes (jusqu\\' à un maximum courant de 32), en les cuisinant ou en les mangeant, pour devenir le nouveau Gourmet de Bordeciel. Devenir un meilleur cuisinier vous permettra d\\'utiliser plus d\\'Ingrédients (de 4 à 8) et en plus grandes Quantités (de 3 à 5 morceaux) dans vos Recettes, d\\'augmenter progressivement les prix de vos plats jusqu\\'à deux fois leurs valeurs initiales, et d\\'améliorer leur qualité avec une petite chance aléatoire d\\'avoir des Ingrédients extra consommés -en plus des quantités d\\'origine- lorsque vous savourerez votre propre nourriture.\r\n\r\nBon Appétit !\r\n\r\n\r\n[size=+2][color=#0054a6]II) USAGE[/color][/size]\r\n\r\n  1) Ouvrez le Livre De Recettes et sélectionnez une nouvelle Recette à créer. Attendez la recherche des Ingrédients de votre Inventaire.\r\n\r\n  2) Choisissez au moins 2 Ingrédients différents et validez pour continuer. Le Poids de la Recette est automatiquement calculé et est égal à la somme des Poids de tous les Ingrédients divisée par 2, tandis que la Valeur de la Recette est égale à la somme des prix de tous les Ingrédients multipliée par le pourcentage de votre Niveau de Cuisine.\r\n\r\n  3) Choisissez l\\'Apparence de la Recette parmi 35 modèles variés de nourritures et de boissons de Skyrim, choisissez la Casserole comme mode de cuisson et validez. Les utilisateurs d\\'Hearthfire peuvent sélectionner un des 23 modèles supplémentaires, et ont aussi la possibilité de cuire au Four.\r\n\r\n  4) Donnez un Nom à la Recette avec au moins un caractère en utilisant le Clavier réel (taper) ou virtuel (cliquer sur les caractères), et donnez une Description facultative. Validez pour créer la Recette.\r\n\r\nVous pouvez changer les Noms et Descriptions des Recettes créées autant de fois que vous voulez, ou choisir de les supprimer de votre Livre pour faire de la place à de nouvelles Recettes.\r\n\r\nIMPORTANT : Les Recettes contenant des Ingrédients de mods doivent être supprimées avant que vous n\\'enleviez les mods concernés.\r\n\r\n\r\n[size=+2][color=#0054a6]III) LANGAGES & COMPATIBILITÉ[/color][/size]\r\n\r\nLes Recettes Du Gourmet est compatible avec les claviers et les versions Anglaises, Françaises, Italiennes, Allemandes et Espagnoles du jeu. Les réglages Anglais sont utilisés par défaut pour toutes les autres versions. Le Langage et le Clavier sont automatiquement attribués au départ mais peuvent être changés à tout moment.\r\n\r\nCe mod devrait être compatible avec la plupart des mods de Besoins/Survie.\r\n\r\n\r\n[size=+2][color=#0054a6]IV) PROBLÈMES CONNUS[/color][/size]\r\n\r\n* Les Valeurs des Recettes ne peuvent être changées dynamiquement et seront toujours de 1 septim. Vous recevrez toutefois la somme correcte d\\'or lorsque vous négocierez.\r\n\r\n* Problèmes de cas incorrects impossibles à résoudre dans les Noms & les Descriptions.\r\n\r\n\r\n[size=+2][color=#0054a6]V) DÉSINSTALLATION & MISES À JOUR[/color][/size]\r\n\r\nCe mod doit être désinstallé avec l\\'option \\\"Désinstallation\\\". Les futures mises à jour *devraient* être possibles comme avec l\\'ancienne méthode.\r\n\r\n\r\n\r\nENTRÉE :\r\n\r\n23/02/2013 Version 1.0 : Sortie Initiale\r\n\r\n\r\nNÉCESSITÉS : Skyrim 1.8, SKSE 1.6.6 & SkyUI 3.1\r\n\r\nPERMISSIONS : Aucunes permissions de remise en ligne ni de modifications d\\\\\\'aucune sorte. Ce mod est également exclusif au Skyrim Nexus et à TES Alliance.\r\n\r\nCRÉDITS : Bethesda, les équipes de SKSE & SkyUI",
  "categoryId": "78",
  "version": "1.0",
  "author": "Seigneur Voland",
  "createdUnix": "1361631719",
  "updatedUnix": "1361631573",
  "containsAdultContent": false,
  "uploadedBy": "SeigneurVoland",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012434",
      "name": "The Gourmet Recipes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "171",
      "fileName": "The Gourmet Recipes-32244-1-0.7z",
      "uploadedUnix": "1361631573",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f7604073ff7fab624a1bf1ff6695f4385061536348a3b594923696b4e3563041/analysis/1407434943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Gourmet%20Recipes-32244-1-0.7z?fid=1000012434&ttl=1535808482&ri=8192&rs=8192&setec=3d3ef621e1b3f174b6301af2aa186fe2"
    }
  ]
}