{
  "modId": 3227.0,
  "modName": "Younger Females - Realistic young female faces",
  "summary": "This mod makes your character look younger while keeping a realistic non-barbie doll look. Works great for elves. FREE BONUS TIPS for creating beautiful characters inside.",
  "descriptionHtml": "[b]This mod is especially good for elves&#33;[/b]\r<br />[b]Bonus tips for character creation below.[/b]\r<br />[b]Version 1.1 released&#33; Details are under &#34;Version History&#34; below.[/b]\r<br />\r<br />[color=yellow][b]CREDITS[/b][/color]\r<br />First I want to give credit to [b]Windsong[/b] for his [b]Beauty Faces And PressOutTheForehead v4[/b] mod and [b]Xenius[/b] for his [b]Detailed Faces[/b] mod (which Windsong&#39;s mod is partially based on).\r<br />Both have graciously given me permission to use their textures as a base for my mod. About 90% of the credit goes to them.\r<br />\r<br />[color=yellow][b]PURPOSE OF THIS MOD[/b][/color]\r<br />As the name says, this mod makes females in Skyrim look younger. That is the main aim of the mod. While there are other mods that might do this by using an extremely smooth look, I found them to look unrealistic compared to the defaults. One thing I liked about how Bethesda did the characters in Skyrim is how the skin isn&#39;t completely smooth but they have what could be called skin pores which makes their faces look a lot more realistic. This mod keeps that realism, while at the same time removes the &#39;wrinkles&#39; which make characters look old.\r<br />\r<br />[color=yellow][b]WHAT THIS MOD ACTUALLY DOES[/b][/color]\r<br />It replaces the female face texture, specular and normal maps for all humanoid female faces. It works wonders for elves as you can see from the sceenshots (the Dark Elf one gives a very clear example). \r<br />\r<br />You basically get the same character but younger after you apply this mod.\r<br />\r<br />[color=yellow][b]WHAT LEAD ME TO MAKE IT AND HOW I DID IT[/b][/color]\r<br />I was trying to get my High Elf character to look as good as possible but whatever I tried she looked &#39;old&#39;. I tried many different face texture mods and found Windsong&#39;s &#34;Beauty Faces And PressOutTheForehead v4&#34; the best, but still wasn&#39;t completely satisfied. There were some wrinkles around the mouth that wouldn&#39;t go away which made her look old. \r<br />\r<br />Windsong and Xenius did super jobs with the normal map and texture. I just edited the area around the mouth. \r<br />\r<br />Additionally, the key thing I did is that I applied the same edited younger-looking normal maps to all races. This made the elves look a lot better as usually they have their own normals which make them have very angular faces and generally look old.\r<br />\r<br />[color=yellow][b]VERSION HISTORY[/b][/color]\r<br />[b]1.0[/b]\r<br />- first release\r<br />\r<br />[b]1.1[/b]\r<br />- I noticed that the area above the right eye was blocky so I fixed the normal maps. Also fixed some other areas that were blocky.\r<br />- I noticed there were wrinkles below eyes in the default specular map so I added a modified specular map to the mod to remove it. \r<br />- In the specular map I also made the skin just a bit smoother.\r<br />- Added some specular (light reflection) to the forehead. (I guess old ladies have dry skin so Bethesda didn&#39;t put any specular there??)\r<br />- See screenshot for a visual comparison.\r<br />\r<br />[color=yellow][b]CHARACTER FACE CREATION/MODIFICATION TIPS[/b][/color]\r<br />This mod will only help with the normal maps and a somewhat detailed face texture. It is still up to you to create a good looking face for your character with good proportions.\r<br />\r<br />BTW: the following tips are just my opinions from my experience. You may or may not agree with them - no problem.\r<br />\r<br />So here are some tips for creating beautiful characters (useful independently of whether you use my mod or not):\r<br />- First, if you want to modify your character&#39;s face use showracemenu() in console. Remember that you shouldn&#39;t change your race. And when you&#39;re done, your race&#39;s special powers will probably disappear. You will need to use player.addspell command to add it back.\r<br />- Now, when modifying your character, you should go somewhere where there is good light coming into the character&#39;s face. In front of a torch or a lantern is good. Actually that is also the trick to get good screenshots of your character&#39;s face too.\r<br />- First thing is the eyes. Elves especially start with weirdly positioned eyes. You should lower the eye height and lessen &#39;eye width&#39; (make them closer together). Just doing that will help your elf character look a lot better (if you want to make them more human/less alien). Other races may also benefit from this, depending on the preset.\r<br />- Raising the brows higher will give the character less of a &#39;mean&#39; look making her look more pleasing. Lowering it can create a meaner look if you like that. This should be adjusted together with the eye height.\r<br />- You might try moving the gauge for eye depth towards the left which makes the eyes deeper. Some presets start with eyes that are almost protruding-looking. Making them set deeper will help make the character&#39;s cheeks look rounder and will make the face look less flat.\r<br />- [more tips later]\r<br />\r<br />[color=yellow][b]ADDITIONAL CREDITS[/b][/color]\r<br />Also, thank you to Porcelyn for the Human Eyes for Elves mod which is used in some of the screenshots above. Really makes the elves look awesome.\r<br />\r<br />[color=yellow][b]USE WITH OTHER MODS[/b][/color]\r<br />This mod includes a face texture and normal maps for each race. The normal maps are the more important part, especially for elves. You can try using the normal maps from this mod together with face textures from other mods. (The normal maps are the &#39;femalehead_msn.dds&#39; files. The face texture is femalehead.dds.)\r<br />\r<br />If you don&#39;t like this mod, you could also try \r<br />Windsong&#39;s Beauty Faces And PressOutTheForehead v4:\r<br />http://www.skyrimnexus.com/downloads/file.php?id=139\r<br />\r<br />\r<br />[color=yellow][b]PERMISSIONS[/b][/color]\r<br />No permission is needed from me to modify this into your own mod. Just credit me and notify me.\r<br />You may have to ask permission from Windsong and Xenius as this mod is based from theirs.",
  "categoryId": "29",
  "version": "1.1",
  "author": "Chanon",
  "createdUnix": "1323523702",
  "updatedUnix": "1323600524",
  "containsAdultContent": false,
  "uploadedBy": "chanon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "8915",
      "name": "Younger Females 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5700",
      "fileName": "Younger Females 1_0-3227.zip",
      "uploadedUnix": "1323523919",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2d06956b4bc481cf4ad238c1c6730c4c682a28edd6ca9938fdaf4ad22e3db73f/analysis/1406501653/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Younger%20Females%201_0-3227.zip?fid=8915&ttl=1535758114&ri=8192&rs=8192&setec=fbc7992c3d16879d79fe76d560183cd0"
    },
    {
      "fileId": "9224",
      "name": "Younger Females 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4808",
      "fileName": "Younger Females 1_1-3227.zip",
      "uploadedUnix": "1323600524",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/75bbcc50ec8f9d155788de9a859047a9cc71a84fd8952229d712ad32a9e6fab8/analysis/1406505245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Younger%20Females%201_1-3227.zip?fid=9224&ttl=1535758114&ri=8192&rs=8192&setec=6e7b587665ee138f3d5c3c2377bfe64e"
    }
  ]
}