{
  "modId": 32284.0,
  "modName": "Hoodswap",
  "summary": "A minimalist mod to allow changing the hooded state of a robe by swapping a robe item for its hooded version and vice-versa. No new items or materials are added; it simply adds new recipes to the tanning rack that use existing items. Also, hooded robes/clothes are fixed to allow wearing circlets.",
  "descriptionHtml": "This mod is intended for Skyrim version 1.8.151.0.7 or higher. Older versions of Skyrim might not work with this mod.\n<br />\n<br />The Hoodswap mod is a minimalist mod aimed at providing the means for robes and their hooded variants to be easily swapped for one another, addressing what I feel is a gap in the vanilla Skyrim's item system. By minimalist, I mean that the mod is aimed at being as simple and noninvasive as it can be for the sake of compatibility with other mods and to allow for the use of this mod to be discontinued with little to no side-effects on one's save files. No new items or crafting materials are added by this mod; it simply adds some new recipes to the tanning rack that only utilize items and materials that already exist in the game. Additionally, since this mod is already dealing with the hooded robes in the game, it implements a simple bug fix for all of the hooded robes in the game enabling circlets (and dragon masks, which use the circlet slot) to be worn with them under the hoods thus allowing players in hooded robes to wear the normal number of enchantable clothing items (4).\n<br />\n<br />In order to swap the hooded state of a robe item, simply take the item to any tanning rack and access its recipe in the Misc section. Adding a hood to a robe will cost the base item + 2 leather + 2 leather strips. Removing a hood costs only the base item. I would've preferred to make the hood addition recipe cost some kind of cloth instead of leather, but I'm not aware of any shops in the game that sell cloth material so leather is what I ended up going with since it's easy to acquire. If you have any thoughts regarding the current recipe costs or suggestions for changes, please let me know in the comments section.\n<br />\n<br />Currently, only robe &lt;-&gt; hooded robe conversions are supported. At some point I intend to add a set of hooded robe &lt;-&gt; hood recipes that will allow you to acquire the hood portion from a hooded robe instead of the robe portion. Update: After looking into it, only the black mage hood exists as an item by default and is set as unplayable and enchanted. Because of this, I'll be making a supplement mod to go along with this mod that adds some new mage hood items (and unenchanted) and the recipes to get them from hooded robe items. I consider adding items to the game to be a more invasive change which is why it'll be in a separate mod rather than included inside of this one.\n<br />\n<br />Hoodswap recipes implemented so far:\n<br />Black Robes (unenchanted) &lt;-&gt; Hooded Black Robes (unenchanted)\n<br />Blue Robes (unenchanted) &lt;-&gt; Hooded Blue Robes (unenchanted)\n<br />Brown Robes (unenchanted) &lt;-&gt; Hooded Brown Robes (unenchanted)\n<br />Green Robes (unenchanted) &lt;-&gt; Hooded Green Robes (unenchanted)\n<br />Grey Robes (unenchanted) &lt;-&gt; Hooded Grey Robes (unenchanted)\n<br />Red Robes (unenchanted) &lt;-&gt; Hooded Red Robes (unenchanted)\n<br />Monk Robes (unenchanted) &lt;-&gt; Hooded Monk Robes (unenchanted)\n<br />Archmage Robes (without hood) &lt;-&gt; Archmage Robes (with hood)\n<br />Mythic Dawn Robes (without hood) &lt;-&gt; Mythic Dawn Robes (with hood)\n<br />Clothes (green, without hood) &lt;-&gt; Clothes (green, with hood)\n<br />\n<br />In order to get access to the Brown, Green, Grey, and Red unhooded robes you may need to get the [url=http://skyrim.nexusmods.com/mods/19]Unofficial Skyrim Patch[/url] as it adds them to the Radiant Raiment shop for purchase. I strongly suggest getting and using the Unofficial Skyrim Patches anyways, as they fix a plethora of bugs in the game.\n<br />\n<br />Installation:\n<br />Either use the Nexus Mod Manager, or copy Hoodswap.esp into the Data subfolder of your Skyrim installation directory and then enable it in the launcher.\n<br />\n<br />Uninstallation:\n<br />Either disable it in the Nexus Mod Manager, or delete Hoodswap.esp from the Data subfolder of your Skyrim installation directory.\n<br />\n<br />Note: This is my first Skyrim mod and was created using the Creation Kit, so I would like to ask for your patience and understanding regarding this mod in light of that. If you discover any bugs with this mod, or have suggestions for more item recipes to add or items I may have missed adding, please mention it in the comments section and I'll get to updating the mod as soon as I can. I'll also update this mod as I find other related items that should be added to it through the course of my own playthroughs.\n<br />\n<br />Dawnguard, Dragonborn, and any other applicable DLC:\n<br />Support for any hooded robe items and such in these DLC's will eventually be done as separate Hoodswap mods, for the sake of compatibility and ease of maintenance. It might be a bit before I get to creating those mods, though, as I've yet to start into those quest lines and whatnot in my own playthrough (I'm getting there, though).\n<br />\n<br />My other mods:\n<br />[url=http://skyrim.nexusmods.com/mods/32422]College of Winterhold Shop Fixes - Mage Hoods - Robes - Gloves - Boots - Psiijic - Etc[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/32761]Better Divine Blessings[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33016]Better Daedric Blessings[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/32817]Silda the Unseen Master[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33062]Unleveled Skyrim Items[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33069]Unleveled Dragonborn Items[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33135]Gemstone Recovery[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33326]Better Imperial Luck[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33614]Better Standing Stones[/url]",
  "categoryId": "60",
  "version": "1.2",
  "author": "SkylerModder",
  "createdUnix": "1361664087",
  "updatedUnix": "1361685641",
  "containsAdultContent": false,
  "uploadedBy": "SkylerModder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012575",
      "name": "Hoodswap_v1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Hoodswap_v1-32284-1-0.7z",
      "uploadedUnix": "1361663314",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b6aac835dc10745c535ac0ae8e255983ff0ff6637afdb136a536e18ee34786ed/analysis/1407435785/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hoodswap_v1-32284-1-0.7z?fid=1000012575&ttl=1535808552&ri=8192&rs=8192&setec=8c47ea921eec297eb014d01ac2b63661"
    },
    {
      "fileId": "1000012617",
      "name": "Hoodswap_v1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Hoodswap_v1_1-32284-1-1.7z",
      "uploadedUnix": "1361672309",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b50191c2b197330ac45b2b67a2957045284bf66771de3d310e83895a055a9c10/analysis/1407436023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hoodswap_v1_1-32284-1-1.7z?fid=1000012617&ttl=1535808553&ri=8192&rs=8192&setec=3ec73803e44751986b8496e175eb9a8a"
    },
    {
      "fileId": "1000012658",
      "name": "Hoodswap_v1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Hoodswap_v1_2-32284-1-2.7z",
      "uploadedUnix": "1361685641",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/c1a4d28dca22f778152694f93a934033ef575ad2e01f56fbb5f6fd6d0245a373/analysis/1407436383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hoodswap_v1_2-32284-1-2.7z?fid=1000012658&ttl=1535808553&ri=8192&rs=8192&setec=49380efc62e3633a6ea92adf006d497a"
    }
  ]
}