{
  "modId": 32281.0,
  "modName": "Vahlok Strunmah the Guardian Mountain",
  "summary": "I always wanted a super secret and secure room/place for my most valuable items but there wasn\\'t any in Skyrim. So I made my own secret treasure room in a totally new little volcanic island far away from Skyrim so that no one should find it and the most powerful items of Tamriel would be safe from evil people.",
  "descriptionHtml": "\r\n[b][u]To all members:[/u][/b]\r\nBtw if you have any screenshots of my mod, feel free to put them on the mod page so other members will see different views from different players. Also, feel free to make video reviews on youtube and ask me if you do so I can put them on the mod page.\r\n\r\n[color=#DB7900]-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n[b]LORE[/b]\r\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------[/color]\r\nThis island is secret and no one knows where it is. Only the Dragonborn can find it because he is connected to it. He just needs a boat and he will find it. The island first appeared during the dragon war from a volcano irrupting in the middle of the ocean, far away from Skyrim. But something in it, maybe the fire of the volcano, no one knows, was connected to the Dragonborn.\r\n\r\nSo a secret group of trusty and honorable men later went there with the help of the Dragonborn to build a secret room directly into the mountain, because it was a lot later the end of the dragon war and the volcano had then became a mountain. They dug deep in the mountain until they reach the flames of the ancient volcano. They also dug up almost to the top on the mountain but stopped before getting outside to keep only one entrance. \r\n\r\nFor the entrance, they built a mighty structure inspired by the nordic ones in Skyrim. Inside the mountain, they built a big storage room and they also forged a big metal cage and a safe box inside of it. This cage was made to keep the strongest weapons of the world so they chained it to the mountain with huge chains to protect it from anyone. They also dug another small room for the maintenance of the items and for planning the constructions when they were building the room.\r\n\r\nAt the end, they built the strongest, the safest, and the most secret storage room the world has ever seen. And to prevent any security leaks, they all stayed in it to die and keep the secret of the location between the walls and only the Dragonborns can now get there.\r\n    \r\n[color=#DB7900]-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n[b]DESCRIPTION[/b]\r\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------[/color]\r\nThis mod adds a new location to the world of Tamriel where you can store your most valuable items. I made it because I wanted a “safe” and secret location where only the Dragonborn would be able to go to put the most powerful items of Tamriel in safety. I know that any player houses would be safe too but it’s just for the realism and the lore.\r\n\r\nIt is made of a small volcanic island far away from Tamriel in the middle of the ocean where no one ever went except the past Dragonborns. You can get there by taking a boat from Dawnstar near the shore and you will find a trapdoor on it. Once you entered it, you will automatically get transported to the island via a loadscreen. You will then be facing the island. You will see a big nordic ruin entrance at the base of the mountain.\r\n\r\nOnce you get inside, you will find a big cage with a safe in it to store your most important items. (I personally store my daedric artefacts and my dragon priest masks) Around it, you will find: 8 mannequins, 16 weapon racks, 8 chests, 2 strong boxes and some display cases. You will also find a passage leading to a small room with more strong boxes, an alchemy lab, an arcane enchanter, a sharpening wheel and a workbench.\r\n \r\n[color=#DB7900]-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n[b]CHANGELOG[/b]\r\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------[/color]\r\nv1_0 \r\nmod release\r\n\r\n[color=#DB7900]-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n[b]INSTALLATION[/b]\r\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------[/color] \r\nTo install this mod you have two options:\r\n1)\tYou can use the NMM by simply downloading it and then click “DOWNLOAD WITH MANAGER”\r\n2)\tOr you can download it manually by clicking “Download manually” and then extract the data file and copy it into the Skyrim folder normaly located under Programfiles/Steam/SteamApps/common/skyrim\r\n\r\n[color=#DB7900]-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n[b]UNINSTALL[/b]\r\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------[/color]\r\nYou just have to make the inverse process of the installation. By NMM or by deleting the .esp file from the Skyrim data folder named “Vahlok”.\r\n\r\n[color=#DB7900]-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n[b]CREDITING[/b]\r\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------[/color]\r\nIf you want to use my mod for whatever you want you will first have to ask me the permission and explain me what you want to do with it. All I ask you in return crediting me in you mod page.\r\n",
  "categoryId": "89",
  "version": "1.0",
  "author": "alextrep",
  "createdUnix": "1361661684",
  "updatedUnix": "1361675979",
  "containsAdultContent": false,
  "uploadedBy": "alextrep",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012623",
      "name": "Vahlok Strunmah V1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "72",
      "fileName": "Vahlok Strunmah V1-32281-1-0.zip",
      "uploadedUnix": "1361675979",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6963322fb6b04797faf0f231ffbc673ba08579729403b7420f4f6bea83750507/analysis/1407436026/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vahlok%20Strunmah%20V1-32281-1-0.zip?fid=1000012623&ttl=1535808546&ri=8192&rs=8192&setec=2389ea20cbded1af629cb78324e29acc"
    }
  ]
}