{
  "modId": 32285.0,
  "modName": "Vulfen Boundkin - Conjurer and Battlemage Follower",
  "summary": "The best defence is a good... defence? Right? Maybe in the mind of this battlemage and master Conjurer. A new companion that uses unique fighting mechanics without being overpowered or out of lore. All the spells are in game and balanced by the engine, and comes with stats and perks similar to the player. Inspired by Vilja.",
  "descriptionHtml": "The best defence is a good... defence? Right? Maybe in the mind of this battlemage and master Conjurer. A new companion that uses unique fighting mechanics without being overpowered or out of lore. All the spells are in game and balanced by the engine, and comes with stats and perks similar to the player. Inspired by Vilja.\r<br />\r<br />Requires Dawnguard.\r<br />\r<br />Well here&#39;s Vulfen, a Khajit Battlemage, he&#39;s a tough kitty who grew up among the forsworn, but left his clan many moons ago and now sits in Whiterun waiting for his boundkin. \r<br />\r<br />Coming from among the Bretons, he tends to specialise in the primal magics of summoning and draining life, as well as swinging a mean mace when the enemies close enough. I&#39;ve tried to create a unique follower and he&#39;s fully functional and comes with basic voice acting.\r<br />\r<br />Basic info: \r<br />Essential and Autolevels with player 1-81. Balanced class based on the spellsword in game, uses same level up mechanics as other npc classes, and starts with 100 in all stats like player.\r<br />Has the all the casting costs perks for conjuration/Destruction/Restoration, a few blocking perks, the first 2 levels of bow/1 handed damage perks, and seems to use them. \r<br />\r<br />As for armour, in lore he uses heavy armour. The idea is that he isn&#39;t all out offensive like with some mages, rather he tanks out the hits while stealing the enemys life to keep him alive. \r<br />\r<br />However due so that he can be used with thief play-style, as a player optional he now levels both light armour + heavy at same time and sneak to boot. He shouldn&#39;t set off traps and has a few levels of quieter sneak like the player can. So he should still be useful if you&#39;d prefer him as a sneaky kitty. :)\r<br />\r<br />Major Skills in order of importance of how they level: Conjuration, Destruction/Restoration, Heavy/light armour+sneak, Block, One handed, Bow. \r<br />\r<br />Can be found in the Drunken Huntsman, in Whiterun enjoying a meal. At the moment he will just say a few comments and offer to join you. \r<br />\r<br />I tweaked his attack ai and settings so that he will try to fight in a unique way of fighting, he will spam various conjuration pets depending on his level and then try to absorb life from the enemy. He will fully melee with a shield if cornered and will also use a bow if his target is far enough away.\r<br />\r<br />There&#39;s 3 versions of absorb spell which he should use once got the various perks and enough mana to cast them.\r<br />\r<br />Drain life1 = 10hp/s 0 Dest\r<br />Drain life2 = 20hp/s 25 Dest\r<br />Drain life3 = 30hp/s 50 Dest\r<br />\r<br />They are all balanced by spellcost in the engine. Comes with a custom mace that fits his future theme, if he&#39;s forced into melee he will absorb hp on hit. Recommend you keep this on him or create a better version for him since it fits with his lore&#33;\r<br />\r<br />I&#39;d love feedback on if people think  the drain spells are too strong or weak at various levels so I can try and get something nice and balanced. In future I&#39;m hoping to add proper lore and a custom voice if I can get in the mood.\r<br />\r<br />To install place the files into your data folder, to remove just delete them. It should be NMM installable.\r<br />\r<br />Recommended mod to use with is Amazing follower tweaks, lots of nice info on followers and comes with sandboxing to boot, but should work with UFO just the same.\r<br />\r<br />Lore and quest’s may come later.\r<br />",
  "categoryId": "66",
  "version": "0.62",
  "author": "eyupwolf",
  "createdUnix": "1361669532",
  "updatedUnix": "1363744919",
  "containsAdultContent": false,
  "uploadedBy": "eyupwolf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000018835",
      "name": "vulfencomp",
      "version": "0.62",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9303",
      "fileName": "vulfencomp-32285-0-62.zip",
      "uploadedUnix": "1363744919",
      "modVersion": "0.62",
      "virusScanUrl": "https://www.virustotal.com/file/092524804cb509887b3c521c73a31c6f9edcd2c18b3300cf5a276106e1a1cb68/analysis/1407478167/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/vulfencomp-32285-0-62.zip?fid=1000018835&ttl=1535808555&ri=8192&rs=8192&setec=b3629502f316a137f2747868d41d1910"
    }
  ]
}