{
  "modId": 32308.0,
  "modName": "Gareth Freyrik - Nord Companion of Jorrvaskr Follower",
  "summary": "Gareth Freyrik - A Nord, dual wielding warrior companion and marriage candidate. As member of the Companions he knows danger well.  He will follow you into the deepest of dungeons, up the highest peaks, and face the deadliest of foes with you, as you battle your way across Skyrim.  ",
  "descriptionHtml": "[url=http://minus.com/lQ6LLaKsaLBzR][img]http://i.minus.com/jQ6LLaKsaLBzR.png[/img][/url]\r<br />\r<br />[b][size=18]Details[/size][/b]\r<br />Gareth Freyrik\r<br />Nord - Dual Skyforge War ax wielding warrior\r<br />Currently he is at level 8 with the potential to reach 100 and he levels up with the player.\r<br />Gareth is a member of the Companions in Whiterun and you can find him wandering Jorrvaskr&#39;s main hall, outside in the training yard, or resting in the living quarters in the basement.\r<br />He has several perks in One Handed, Stealth, as well as the Light Foot Perk for those pesky traps.\r<br />Gareth is currently set to protected status, and is a potential marriage candidate.\r<br />Even if you dislike the Companion quests, Gareth is still a GREAT Warrior Follower to pick up and adventure with&#33;&#33;&#33;\r<br />\r<br />You will *[color=red]REQUIRE[/color] [url=http://skyrim.nexusmods.com/mods/10168]ApachiiSkyHairMale[/url]* for this mod to work, no other mod besides that is needed&#33;&#33;&#33;\r<br />\r<br />This mod is not a standalone mod, hence Gareth will use whatever face or body textures you have installed, so please be warned. \r<br />\r<br />If you enjoy my Gareth Freyrik mod please check out my other mods\r<br />[url=http://skyrim.nexusmods.com/mods/32648][img]http://i.minus.com/iSuNPcTLxydFa.png[/img][/url] [url=http://skyrim.nexusmods.com/mods/32864][img]http://i.minus.com/ivDa7YXM96Th2.png[/img][/url]\r<br />I love, love, love screenshots&#33;&#33;&#33; If you decide to invite Gareth into your game please comeback and show me&#33;&#33;  Give me all the screenshots you can&#33;&#33;&#33; I will love them all&#33;&#33;&#33;\r<br />\r<br />[url=http://minus.com/lS22NqGPVi6dd][img]http://i.minus.com/jS22NqGPVi6dd.png[/img][/url]\r<br />\r<br />[b][size=18]Backstory[/size][/b]\r<br /> Gareth Freyrik&#39;s parents were killed when he was very young, he was raised in Falkreath by his only other living relative, his cousin Rikar Frostheart. Even though Rikar took great care with raising him, there were several questions about his parents deaths he would not answer. Gareth himself was far to young to remember anything but vague images and shadows from long since past. The only thing tangible he could bring forth from the memory of his parents deaths was the name Varg. Try as he might he could find no one with any connections to that name.\r<br /> His cousin tried his best to protect him, getting him work as a scribe to keep him safe from the dangers of the world. Gareth&#39;s heart always yearned for more. A lust burned within him to wander and see other sites, explore more than just one small corner of Skyrim. By chance one day, he was charged with the delivery of a important letter to the Jarl of Whiterun. Gareth was overjoyed at the chance to spread his wings. Rikar objected to the task but, finally gave in realizing Gareth was of age and should do with his life what he chooses. \r<br /> Death came to call for Gareth that night. He had only been on the road for half a day, when he was beset by a pack of wolves. Rikar had shown him the ways of one handed fighting as he grew. Although never before did he have to use the knowledge given to him. He froze in panic, it was then he heard a battle cry from behind him. An older man with greying hair leaped past him, felling the wolves with two quick movements of his weapon. The man turned to see if he was alright. He introduced himself as Kodlak Whitemane and together they travel the road to Whiterun. He marveled Gareth with old tales of adventures lost since past. \r<br /> Before they parted ways Kodlak invited Gareth to visit Jorvaskrr during his stay in the city. After his work with the Jarl was complete, he rushed back hoping to hear more exciting stories. It then hit him, Kodlak Whitemane was a man of the world, he had seen and done allot of things in his day, he wondered if he would know this name Varg, that haunted him so. After a joyous meal many of the Companions retired and Gareth worked up the courage to question about the name. He explained about his parents deaths and how he was searching for this illusive person. \r<br />Kodlak grew pale as he heard the name, and almost instantly Gareth knew he had struck a cord. &#34;I knew a man once called Varg...&#34; Kodlak said. Gareth pressed for any information from him he had. &#34;He was once my Shield Brother and now he is dead.&#34; Kodlak looked distant, almost losing himself in the past. Gareth knew by his expression to leave well enough alone. Still for him, the mystery remained. \r<br /> After returning to Falkreath his mind was made up, he was going to become one of the Companions of Jorrvaskr. No matter how hard he would have to train, no matter what it would take, he would make Kodlak Whitemane tell him of this mysterious Varg.\r<br />\r<br />[b][size=18]Required Mods[/size][/b]\r<br />[url=http://skyrim.nexusmods.com/mods/10168]ApachiiSkyHair by Apachii - ApachiiSkyHairMale[/url]\r<br />\r<br />[b][size=18]Suggested Mods[/size][/b]\r<br />[url=http://skyrim.nexusmods.com/mods/10168]ApachiiSkyHair by Apachii[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/23755]Inhabitants of Skyrim - NPC Overhaul by Rops1981[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/14037]UFO - Ultimate Follower Overhaul by fLokii[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/31210]Vaendral - Imperial Male Follower by highonsunday[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/25791]TairenSoul Tattoo Warpaint for Men by TairenSoul[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/22524]The Companions by Netherwalk by netherwalk[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/29953]Julien Christophe - Priest of Mara by greyblood[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/29953]Better males -by Chris57 and FavoredSoul/Geonox[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/28363]Beards by Hvergelmir[/url]\r<br />\r<br />[b][size=18]Install-Uninstall[/size][/b]\r<br />INSTALL- Download with NMM and install or manually place Gareth.esp, meshes, and textures in your Skyim/Data folder \r<br />UNINSTALL-Deactivate with NMM or delete all included Gareth files from your Data, meshes and textures folders\r<br />\r<br />[b][size=18]Thanks For The...[/size][/b]\r<br />A huge thank you to [url=http://skyrim.nexusmods.com/users/982039]highonsunday[/url] for testing and helping cure Gareth of his insomnia.\r<br />Thank you to [url=http://skyrim.nexusmods.com/users/1409267]greyblood[/url] for all the help testing and for screenshot advice.\r<br />Thanks [url=http://skyrim.nexusmods.com/users/283148]apachii[/url] for use of the great hair [url=http://skyrim.nexusmods.com/mods/10168]ApachiiSkyHair by Apachii - ApachiiSkyHairMale[/url].",
  "categoryId": "66",
  "version": "1.0",
  "author": "shadowtigers",
  "createdUnix": "1361754674",
  "updatedUnix": "1361697412",
  "containsAdultContent": false,
  "uploadedBy": "shadowtigers",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012737",
      "name": "Gareth Freyrik ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "387",
      "fileName": "Gareth Freyrik -32308-1-0.rar",
      "uploadedUnix": "1361697412",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fea6fcae0a07aa6fdba7cf5266ff8c868458eaa39a0f27373461b862b5146269/analysis/1407436686/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gareth%20Freyrik%20-32308-1-0.rar?fid=1000012737&ttl=1535808692&ri=8192&rs=8192&setec=291e775344ec5285f747c7e22d714556"
    }
  ]
}