{
  "modId": 32307.0,
  "modName": "Heartstone new",
  "summary": "This mod will add the Bandolier from General Falx Carius and a Heartstone to the game.",
  "descriptionHtml": "This mod will add the Bandolier from General Falx Carius and a Heartstone to the game that can be crafted at any forge. The first mod i uploded had the same name like Drag0than mod heartstone experiment and because of that there was a conflict with the name... So i decided to reupload my mod with a new filename. All problems should be fixed now.\r\n\r\nRequirements:\r\n\r\nDragonborn DLC!!!!\r\n\r\nInstall: For those who downloaded my old mod, delete the old esp-file before downloading my new one. If you used Drag0than heartstone experiment you have to reinstall it, sorry for this.\r\nDownload and put everything into your Skyrimfolder or use Nexus Mod Manager.\r\nFor all the beasts of you, try this mod: http://skyrim.nexusmods.com/mods/32423\r\n\r\nCrafting the Items:\r\n\r\nHeartstonebandolier: It will use slot 53 of your body and should not conflict with any vanilla armor.\r\n\r\nunder miscellaneous\r\n3 Leather\r\n1 ebony ingot\r\n\r\nHeartstone: It will use the Amulet Slot (you can not wear an other amulet!)\r\n\r\nunder jewelry\r\n1 brairheart\r\n1 deadric heart\r\n1 heartstone\r\nThe heartstone has a strong enchentment. It will reduce the time between your shouts dramatically and fortify health, stamina and magicka and it will give you a little boost on the regeneration of all of them.\r\n\r\nplease note: There is only one version of this \\\"armor\\\". No difference between male and female and there is no version for Argonian and Khajiit! The original armor is really slim and so is the bandolier. The armor i use at the image is the evil mastermind armor by Zerofrost for example.\r\n\r\nIf someone is willing to create a version for the beastraces he could use my file but only with credits for my work. Thanks and have fun with the mod.\r\n\r\nIf you find bugs, please send me a PM!",
  "categoryId": "60",
  "version": "1.0",
  "author": "nomo89",
  "createdUnix": "1361697262",
  "updatedUnix": "1361703230",
  "containsAdultContent": false,
  "uploadedBy": "nomo89",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012753",
      "name": "Herzgurt",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "117",
      "fileName": "Herzgurt-32307-.rar",
      "uploadedUnix": "1361703230",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c995a6a1d6506e996114ddadcfe5005d77855f422a98030c07b01cba82259f5e/analysis/1407436752/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Herzgurt-32307-.rar?fid=1000012753&ttl=1535808690&ri=8192&rs=8192&setec=fccbd86c6796b9da0a15273121333bbc"
    }
  ]
}