{
  "modId": 32319.0,
  "modName": "Ghost Of Nany Katman",
  "summary": "You can find this character sitting near the Talos Shrine in Whiterun.",
  "descriptionHtml": "You can find this character sitting near the Talos Shrine in Whiterun. \r\n\r\n(In an effort to become more powerful , a horrible accident gone wrong in a deadly experiment leaving Nany Katman to walk the earth as a shade of her former self. Searching for the solution to once again become human she\\'ll join you on your quest.) \r\n\r\n\r\nNany Katman is a Breton Warrior. Trained in the skills of lethal Assassination, Alchemy, Spell Casting, Archery, and a Master of Daggers. Born Under the sign of LORD DAGON she secretly infiltrated the Dark Brotherhood in order to get close to the Night Mother in hopes of meeting Lord Sithis as this is her only one lead to finding his brother, Anu. Once she finds Anu she will Assassinate him to become the ruler of the Dark Void Magic. \r\n\r\nOfficially cast out of the Mythic Dawn by LORD DAGGON himself as a blaspheming pariah, LORD DAGON knew this would be the only way she could gain admittance to the dark brotherhood. At the age of 10 she was branded as cute as a tom-boy. At age 16 it was no longer cute so she decided to make all men who mocked her into Eunuchs. \r\n\r\nAs skilled as she is she also learned a great deal in Armor crafting. She hides herself well and never gets close to anyone. When she removes the Armor she is seen as an innocent ray of light reflecting off the sweetest drop of Honey. No one would ever suspect her sordid past. If one were to ask her, Nany Katman would reply simply that she does not have a sordid past as is the way of life. But then she would immediately take your life before you knew what had happened. \r\n\r\nNany Katman has indeed a very unique Biography and has been said amongst the daedra That LORD DAGON himself even fears her. There is even rumor among the Aedra that is Nany Katman who turned Lord Sheogorath insane so long ago. Which is only rumor as it had been reported that Nany Katman is in her 20’s or could be in her 30’s. So how could this be?",
  "categoryId": "66",
  "version": "1",
  "author": "chaz373",
  "createdUnix": "1361718052",
  "updatedUnix": "1361735796",
  "containsAdultContent": false,
  "uploadedBy": "chaz373",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012803",
      "name": "Ghost Of Nany Katman",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Ghost Of Nany Katman-32319-1.zip",
      "uploadedUnix": "1361718009",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e1642b0e10307edf056748437a416ce94d9547557c1855cee3633a3999fc846b/analysis/1407437105/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ghost%20Of%20Nany%20Katman-32319-1.zip?fid=1000012803&ttl=1535808708&ri=8192&rs=8192&setec=55dfc31991f7e0c82823b8cf50fbe5fc"
    },
    {
      "fileId": "1000012904",
      "name": "The Ghost Of Nany Katman",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "The Ghost Of Nany Katman-32319-1.zip",
      "uploadedUnix": "1361735796",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e1642b0e10307edf056748437a416ce94d9547557c1855cee3633a3999fc846b/analysis/1407437882/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ghost%20Of%20Nany%20Katman-32319-1.zip?fid=1000012904&ttl=1535808709&ri=8192&rs=8192&setec=9e555b0f63f9a11daa4c68d08908e356"
    }
  ]
}