{
  "modId": 32316.0,
  "modName": "Alodoriane",
  "summary": "An ancient Immortal that had lived many lives seeking revenge for her families’ death",
  "descriptionHtml": "Alodoriane can be found inside the Temple of Talos within the walls of Windhelm. \r\n\r\nAn ancient Immortal that had lived many lives seeking revenge for her families’ death so very long ago. She settles in the land of Skyrim and joined the Dragonborn in another attempt to use others to carry out what will surely be no less than chaos. Just be weary of her darkside. \r\n\r\nThis character is made unique and invulnerable so she will not die nor run out of energy like a character based on being essential. Height/Weight is a normal 1.0000/50.000 and of Imperial Race. She carries a vast fortune and be a great help along the way. Originally created with a fortune as I was working on the idea of creating her as a merchant that would also “Moonlight” as someone who would set contracts to kill NPC’s rewarding you with a large sum of gold. \r\n\r\nI switched this character into a normal character for a few reasons, one being as I said all along I just tinker at this stuff and could not figure out how to attaching scripting to her to act like the night mother and issue contracts and second doing this as a merchant just didn’t tie into a story line I wanted so she went from selling poisons only to just becoming a follower out looking to avenge the death of her family by another character I was tinkering with.",
  "categoryId": "66",
  "version": "3",
  "author": "chaz373",
  "createdUnix": "1361715822",
  "updatedUnix": "1361715721",
  "containsAdultContent": false,
  "uploadedBy": "chaz373",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012794",
      "name": "Alodorian",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Alodorian-32316-3.zip",
      "uploadedUnix": "1361715721",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/db0ca1e6f6a189fcc6c559bf4e81a591d115f6c419b94a0ec4fbfb4cce4386d8/analysis/1407437057/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alodorian-32316-3.zip?fid=1000012794&ttl=1535808704&ri=8192&rs=8192&setec=587c764b1b07efacfb0a48d6fdfb9383"
    }
  ]
}