{
  "modId": 32324.0,
  "modName": "ZaTaLa",
  "summary": "Za’Tala can be found in the city of Markath. ",
  "descriptionHtml": "ZaTala.\r\n\r\nZa’Tala can be found in the city of Markath. She will be waiting for you inside Vindrel Hall and will return there when you discharge her from following you.  Yes you will notice she does carry a blade (which was actually a gift from a Dremora Demon who may or may not have been her father) and she will take it out when you arm yourself and will act all big and stuff but the cold fact is that she is not a fighter, not even a sneaky assassin. The blade is more of a tool to de-scale fish, that said she is also not a crafty cook. Seriously. So don’t get any idea’s or you may wind up in trouble thinking she’ll save your sorry excuse for a sack of skin.  She will in deed run from trouble at the first sign of it.\r\n\r\nZa’Tala is an ancient child demon, but a child none the less. She was born about 700 years ago and learned there is a lot more to life than just fighting and killing. As she has had her share and once served MoLag Bal for 300 years faithfully.  She fell in love with the Orcs as they are a proud and strong race. But grew tired of wanton destruction and mindless skirmishes. \r\n\r\nNow she travels the land of Tamriel and found herself in in the land of Skyrim. She will travel with you and keep you company and will perform limited tasks’ , very limited. She will not attack on command, she cannot reach very high (for obvious reasons) and has limited dialogue.  What she is good for is she will carry a lot of items for you that you find along the way making good storage.\r\n",
  "categoryId": "66",
  "version": "3",
  "author": "chaz373",
  "createdUnix": "1361720069",
  "updatedUnix": "1361720012",
  "containsAdultContent": false,
  "uploadedBy": "chaz373",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012811",
      "name": "Za Tala",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Za Tala-32324-3.zip",
      "uploadedUnix": "1361720012",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/371bbf4b221dd47cf4b91799d7ac5a9e0bfcd0afb4d1de6e376cce052e0c518c/analysis/1407437162/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Za%20Tala-32324-3.zip?fid=1000012811&ttl=1535808716&ri=8192&rs=8192&setec=0b42c112f5539dc3ccc3f42df28fee23"
    }
  ]
}