{
  "modId": 32322.0,
  "modName": "The Night ViVik",
  "summary": "This creature can be found within the walls of Riften. Since there is a finite area in which to hide you will need to search him out. He will try to kill you.",
  "descriptionHtml": "The  Night Vivik\r\n\r\nLevel 50 with health of 639. This creature can be found within the walls of Riften. Since there is a finite area in which to hide you will need to search him out. \r\n\r\nLegend has it that long ago The Noble Family Vi\\' Vik Obtained so much wealth had become despised by the very people they sought to rule. The Family crest was commissioned to be stolen by the Thieves Guild by village peasants forcing the Noble family to lose everything they had forcing them underground. \r\n\r\nAll but few remain today roaming countryside as vagabonds. Save one, one whom had become obsessed with vengeance sold his soul to Lord Hircine The daedric prince, also known as the Huntsman of the Princes, and the Father of Manbeasts. Hircine bestowed the power and curse of the beast upon Lord Vi’ Vik to forever walk Tamiel as a bloodlusted beast until he utterly destroys the Thieves Guild.\r\n\r\nLord Vi’ Vik, now known only as The Night ViVik found the Thieves Guild centered around Riftens Market place. Under the protection of the Daedric Prince whose sphere is the night and darkness, Nocturnal had been aware of The Night ViVik’s intrusion and guided you into Riften to destroy the beast. Will you succeed in this epic battle or will you fail the Nocturnal forever destroying the Guild of Thieves? Good luck.\r\n",
  "categoryId": "77",
  "version": "5",
  "author": "chaz",
  "createdUnix": "1361718988",
  "updatedUnix": "1361718977",
  "containsAdultContent": false,
  "uploadedBy": "chaz373",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012806",
      "name": "The Night Vivik",
      "version": "5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "The Night Vivik-32322-5.zip",
      "uploadedUnix": "1361718977",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/2ee5f3d5b2184560ced47f59684af8c616473aa260ba45af159c3e71e724e827/analysis/1407437107/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Night%20Vivik-32322-5.zip?fid=1000012806&ttl=1535808713&ri=8192&rs=8192&setec=e06b0dc2b9022f659af6a1058e520dc9"
    }
  ]
}