{
  "modId": 32320.0,
  "modName": "M-aiq The Liar",
  "summary": "He can be found cooking inside your Breezehome located in Whiterun. ",
  "descriptionHtml": "M\\'aiq The Liar. Ever faithful to Skyrim\\'s own Nany Katman. \r\nHe can be found cooking inside your Breezehome located in Whiterun. \r\nHis default weapon is his Bow & Arrow, he comes with a Daedric Sword which you may be able to have him equip and use in battle. When your done adventuring with him he\\'ll travel back home and begin cooking again. He eats what he cooks so don\\'t go looking for food. He\\'ll only offer up some tasty Skooma. \r\nEnjoy and have fun. \r\n(01/27/2013 Edit) : \r\nGreetings, I had to make a few edits to this Mod. After 3 tries I think I got it right. \r\nI removed the extra M\\'aiq The Liar that was sitting on the bench with Olava The Feeble behind Breezehome. I also replaced the Gold ore M\\'aiq was carrying with 65535 gold coins. I also replaced the book he was carrying with a new one. He is still a follower and will always return home to your breeze home. M\\'aiq is an essential character so should be hard to kill him.\r\nM’aiq is fully voiced according to the original Skyrim M\\'aiq character. No additional voice material was added save for what already existed. Only M\\'aiq can voice M\\'aiq ;-)\r\nIn Game Known Quotes:\r\n\\\"M\\'aiq knows much, tells some. M\\'aiq knows many things others do not.\\\"\r\n\r\n\r\n\\\"M\\'aiq longs for a Colovian Fur Helm. Practical, yet stylish. M\\'aiq is very sad he does not have one.\\\"\r\n\r\n\r\n\\\"M\\'aiq wishes he had a stick made out of fishies to give to you. Sadly, he does not.\\\"\r\n\r\n\r\n\\\"M\\'aiq believes the children are our future. But he doesn\\'t want them ruining all of our fun.\\\"\r\n\r\n\r\n\\\"M\\'aiq thinks his people are beautiful. The Argonian people are beautiful as well. They look better than ever before.\\\"\r\n\r\n\r\n\\\"Some people wish to throw their weapons. That seems foolish to M\\'aiq. If you hold your weapon, you only need one.\\\"\r\n\r\n\r\n\\\"Some people want special bows that take too long to load and need special arrows called bolts. M\\'aiq thinks they are idiots.\\\"\r\n\r\n\r\n\\\"Feet are for walking. Hands are for hitting. Or shaking. Or waving. Sometimes for clapping.\\\"\r\n\r\n\r\n\\\"M\\'aiq prefers to adventure alone. Others just get in the way. And they talk, talk, talk.\\\"\r\n\r\n\r\n\\\"People always enjoy a good fable. M\\'aiq has yet to find one, though. Perhaps one day.\\\"\r\n\r\n\r\n\\\"So much easier to get around these days. Not like the old days. Too much walking. Of course, nothing stops M\\'aiq from walking when he wants.\\\"\r\n\r\n\r\n\\\"M\\'aiq is glad he has a compass. Makes it easy to find things. Much better than wandering around like a fool.\\\"\r\n\r\n\r\n\\\"Why would one want to swing a staff? A mace hurts more. Or a sword. Can\\'t shoot a fireball from a sword, though.\\\"\r\n\r\n\\\"I do not wish to fight on horseback. It is a good way to ruin a perfectly good horse... which is, to say, a perfectly good dinner.\\\"\r\n\r\n\r\n\\\"Levitation is for fools. Why would we want to levitate? Once you are up high, there is nowhere to go but down.\\\"\r\n\r\n\r\n\\\"It is good the people wear clothing. M\\'aiq wears clothing. Who would want to see M\\'aiq naked? Sick, sick people. Very sad.\\\"\r\n\r\n\r\n\\\"I don\\'t know why one would want to destroy a building. It takes time to make it. Much time.\\\"\r\n\r\n\r\n\\\"I have seen dragons. Perhaps you will see a dragon. I won\\'t say where I saw one. Perhaps I did not.\\\"\r\n\r\n\r\n\\\"Werewolves? Where? Wolves? Men that are wolves? Many wolves. Everywhere. Many men. That is enough for M\\'aiq.\\\"\r\n",
  "categoryId": "66",
  "version": "1",
  "author": "chaz373",
  "createdUnix": "1361718358",
  "updatedUnix": "1361722850",
  "containsAdultContent": false,
  "uploadedBy": "chaz373",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012804",
      "name": "Maiq The Liar",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Maiq The Liar-32320-1.zip",
      "uploadedUnix": "1361718344",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/941117c098d4294ba8a6ffbae298fca5243f07247601612aad5332a5889ae0af/analysis/1407437106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Maiq%20The%20Liar-32320-1.zip?fid=1000012804&ttl=1535808710&ri=8192&rs=8192&setec=6d7f84ce998e362b16bc0c8e1794e6a3"
    },
    {
      "fileId": "1000012825",
      "name": "M aiq The Liar",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "M aiq The Liar-32320-1.zip",
      "uploadedUnix": "1361722850",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/941117c098d4294ba8a6ffbae298fca5243f07247601612aad5332a5889ae0af/analysis/1407437106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/M%20aiq%20The%20Liar-32320-1.zip?fid=1000012825&ttl=1535808710&ri=8192&rs=8192&setec=0283cc072a20c6b358ea6a9fea99be1f"
    }
  ]
}