{
  "modId": 32332.0,
  "modName": "Pom Pom - A Crabby Companion - Mudcrab Animal Follower",
  "summary": "Pom Pom is a full featured mudcrab animal follower. You can play fetch, have him hold onto your money, impress your enemies or attack your friends... Er.. Other way around. Despite his loud foolhardy click-clacking, he wont give away your position. And best of all he was born with the ability to camouflage into nearly any stone pathway.",
  "descriptionHtml": "[center]------------------------------------------------------Steam Premium Mods------------------------------------------------------[/center]\r<br />(04/23/15) Just a heads up, my mods will [b]never[/b] be sold for profit on the Steam Workshop.   I&#39;m thinking of listing Pom Pom for &#036;100 and then providing links to obtain him here, on the nexus, for free.  Please, if you come across any of my files being sold (other than a one-hundred dollar crab pet...), let me know immediately. I am firmly against the sale of mods.\r<br />\r<br />This also might prompt me to actually finish my work to highlight what modding is about; the hobby, the challenge and the community.\r<br />[center]\r<br />--------------------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />UPDATE 2014&#33;?&#33;? WTF, you said August 2013&#33;&#33;\r<br />Yeah I know... I avoided working on Pom Pom to concentrate on his sweet home.   The Grotto will be uploaded to the nexus/sws as soon as I hear back on a few permissions for some of the mods assets.  Currently The Grotto is about 80% finished (World space finished, 2 interior cells 90% done, 3 more interior cells at roughly 60% each).  When The Grotto is released Pom Pom will get his next update which includes a speed bump from 2.00 to 2.25,  slight damage buff, and the world message on dismissal now says &#34;Your pet has gone home&#34;, fixed a dialogue typo and lastly the Path of Exile joke was removed... He is now just Pom Pom, &#34;the face shredder&#34; is hidden, fear not as he still shreds faces like Pain Shave the Face Shredder.  I&#39;ve tried everything I could to get Pom&#39;s written response to work but sadly &#34;force subtitles&#34; apparently doesnt use an unrelenting amount of force... \r<br />\r<br />03/05: Update is live&#33; Pom Pom&#39;s home [url=http://www.nexusmods.com/skyrim/mods/51808]The Grotto is now available&#33;[/url] \r<br />\r<br />--\r<br />LOCATION&#33;? Fast travel to Solitude. Exit Solitude to Skyrim and head South down the path to the docks. Once you&#39;re at the end of the docks, swim across the river and head inland about 50 metres, Pom Pom should be at the pond there. From where he is if you face north east you should be able to see the Solitude skyline as seen in picture 6. If you don&#39;t see him.. he may have burrowed. \r<br />\r<br />CAN&#39;T TALK&#33;? Remove/delete mod, launch game, load save, resave, quit to desktop. Reinstall mod, launch game, load save, discuss current economic affairs with Pom Pom. \r<br />--\r<br />\r<br />\r<br />Pom Pom is a full featured animal follower. You can play fetch, have him hold onto your money, impress your enemies or attack your friends... Er.. Other way around. Despite his loud foolhardy click-clacking, he wont give away your position. And best of all he was born with the ability to camouflage into nearly any stone pathway.  You will find him hanging out at his pond in the Solitude marshlands (see pictures).  \r<br />\r<br />Pom Pom enjoys chasing fish, eating moss, picking the occasional flower and &#34;Crab Boxing&#34;. \r<br />\r<br />As an essential follower he will not die however he is merely a mudcrab, so don&#39;t expect him to turn the tides of a battle.  If dismissed he will return to The Grotto/Solitude Marshland. \r<br />\r<br />He is a standalone animal follower that was made to help familiarize myself with the creation kit. He goes best with my Grotto Villa mod (A large luxurious property nestled in Solitude&#39;s outlying marshlands, which will be up soon in a 75% finished state) but it is not required. Currently the only known bugs I need to correct are enabling Pom Pom&#39;s written responses and the global message about a dog leaving your service when dismissed. \r<br />\r<br />The Short:\r<br />-You can tell him what to do (walk around, eat this, stab that, stay there)\r<br />-Holds onto your items\r<br />-Will not die\r<br />-Will not break stealth\r<br />-Will burrow into every floor possible\r<br />-Won&#39;t leave clawprints around the house\r<br />-Compatible with Posh Mudcrabs, Swearing Mudcrabs, Ultimate Follower Overhaul\r<br />-No reports of him attacking Vampire Lords.\r<br />\r<br />Regarding Ultimate Follower Overhaul/Amazing Follower Tweaks: A few of the options such as change morality/courage/aggression/mortality should work.  Sadly some things will not work, you won&#39;t be able to convince Pom Pom to do things such as hold a shield or don a helmet.  He will work fine alongside many followers\r<br />\r<br />Fun Fact: Pom Pom was named after the Lybia genus of small crabs in the family Xanthidae. Their common names include boxer crabs, boxing crabs and pom-pom crabs. They are notable for their mutualism with sea anemones, which they hold in their claws for defense.\r<br />\r<br />Thanks goes to DARKF0X127 for his exceptional tutorials ( https://www.youtube.com/user/DARKF0X127 ) And of course thanks for the comments. Have another vanilla skyrim critter you want as a follower? Let me know and I may just fill the request&#33;",
  "categoryId": "65",
  "version": "1.13",
  "author": "Spazmok",
  "createdUnix": "1361727096",
  "updatedUnix": "1394070720",
  "containsAdultContent": false,
  "uploadedBy": "Spazmok",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012855",
      "name": "Pom Pom - A Crabby Companion",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Pom Pom - A Crabby Companion-32332-1-01.zip",
      "uploadedUnix": "1361726455",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c0cf7baee1467e3b4cebd414e78e44809f7c6479b41dfd296f5d77d6d094fdc5/analysis/1407437522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pom%20Pom%20-%20A%20Crabby%20Companion-32332-1-01.zip?fid=1000012855&ttl=1535808741&ri=8192&rs=8192&setec=ec526cf90554455824bc28ebb5934593"
    },
    {
      "fileId": "1000044213",
      "name": "A Crabby Companion - Mudcrab Animal Follower Update",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16",
      "fileName": "A Crabby Companion - Mudcrab Animal Follower Update-32332-1-1.zip",
      "uploadedUnix": "1375649821",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6727f9e584b9b086d306c5a2f8976a6baf7005002d4a237887e2f653cbd00365/analysis/1407669081/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Crabby%20Companion%20-%20Mudcrab%20Animal%20Follower%20Update-32332-1-1.zip?fid=1000044213&ttl=1535808741&ri=8192&rs=8192&setec=d2851d1d1543233d0f5472795f6e58da"
    },
    {
      "fileId": "1000100018",
      "name": "Pom Pom",
      "version": "1.13",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Pom Pom-32332-1-13.zip",
      "uploadedUnix": "1394070720",
      "modVersion": "1.13",
      "virusScanUrl": "https://www.virustotal.com/file/63f20fd8b19e4ffd51e0473f76f0b1aad00e3e775f15e30ee9610e9986e78da8/analysis/1407961973/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pom%20Pom-32332-1-13.zip?fid=1000100018&ttl=1535808742&ri=8192&rs=8192&setec=0271c10fc04f2975ce44f4fc3b71771e"
    }
  ]
}