{
  "modId": 32349.0,
  "modName": "UMP - Utility Magic Package",
  "summary": "An immersive, lore-friendly spell package designed to add extra utility, passive and situational magic to TESV whilst being minimally invasive to the game, to magic balance and with maximum compatability.",
  "descriptionHtml": "[center][img]http://img835.imageshack.us/img835/535/headermlq.png[/img][/center]\r\n[color=WhiteSmoke]\r\n\r\n[u][size=5][b]At a glance[/b][/size][/u]\r\n\r\n[list][*]UMP is a lore-friendly, immersive, balanced spell pack designed to insert into and complement the existing magic system in TESV: Skyrim.\r\n\r\n[*]Features numerous spells and unobtrusive re-workings of the existing spell systems in Skyrim.\r\n\r\n[*]Aims to provide magic-users with better utility and more options, reminiscent of earlier TES games.\r\n\r\n[*]Brings integrative functionality to magic that gives added value to those wishing to use magic in different situations or for different character types.\r\n[/list]\r\n\r\n[u]Contents:[/u]\r\n- Description\r\n- Full Feature list\r\n- Installation\r\n- Compatibility\r\n- Help needed\r\n\r\n\r\n\r\n\r\n[u][size=5][b]Description[/b][/size][/u]\r\n\r\nThe [b]Utility Magic Package[/b] is a spell-package for TESV: Skyrim that is designed to make magic in the game more situationally useful, more diverse and with generally more utility; all whilst trying to fit as closely to the vanilla game as possible: there are no lore-breaking spells and no overpowered combat spells. As such also, there are no new spell-tomes lying on tables or in a special crate for the player to pick up. New spells are added to the correct vendors and levelled lists, where applicable.\r\n\r\nThe current version - [b]0.2[/b] - has been greatly expanded over the 0.1 \\'taster\\' pack, and includes a significant number of balanced (always subject to changes based on your feedback), lore-friendly and game-integrated spells for TESV Skyrim. These not only add to the existing game\\'s spell roster without breaking their themes, but also overhauls systems - such as magical light and muffle spells in v0.2 - into numerous levels of spells, progressive with caster ability that are inspired by the mechanics of previous Elder Scrolls games.\r\n\r\nPlease remember to [/color][size=3][color=Lime][b]endorse and share[/b][/color][/size][color=WhiteSmoke] if you like or are interested in this project - [u]it\\'ll help me to know whether to continue developing this spell package. [/u]\r\n\r\nYou can also help by [b]giving me feedback[/b] - I try to balance and bug-test, but I am but one man with other responsibilities, and if you find something wrong or unbalanced, please [u]tell me[/u] so we can work to fix it - the aim of UMP is to provide an entirely balanced, integrated and immersive spell-pack, so getting your feedback and acting to smooth things out is very important.\r\n\r\n\r\n\r\n\r\n\r\n[u][size=5][b]Full Feature list[/b][/size][/u]\r\n\r\nUMP 0.2 builds on the \\'mini-package\\' of the 0.1 release with a significant expansion of content. In the same vein, the total content has been roughly doubled to include new spells, adding brand new archetypes as well as adding to existing archetypes and modifying existing game spells - such as the magical lights, muffle spells and invisibility - in a progressive, caster-skill based way inspired by earlier TES games.\r\n\r\nFull content list (0.2):[/color]\r\n\r\n[color=WhiteSmoke][b][u]Light Spells[/u][/b][/color]\r\n\r\n[b][color=skyblue]Candlelight*[/color][/b] - [i]Alt Novice[/i] - *Changed from vanilla. Basic light spell - flickering, tinted light in a small radius. Cheaper to cast than previously.\r\n[b][color=skyblue]Gaslight[/color][/b] - [i]Alt Apprentice[/i] - Enhanced version of Candlelight - casts light in a wider radius.\r\n[b][color=skyblue]Starlight[/color][/b] - [i]Alt Adept[/i] - More powerful light spell - an even great radius, purer light.\r\n[b][color=skyblue]Moonlight[/color][/b] - [i]Alt Expert[/i] - Most powerful light spell - illuminates a large area with bright pale light.\r\n\r\n\r\n[color=WhiteSmoke][b][u]Defensive Spells[/u][/b][/color]\r\n\r\n[b][color=skyblue]Glintskin[/color][/b] - [i]Alt Apprentice[/i] - Caster gains 5% resistance to magic for a baseline 60 seconds. Improved by the Mage Armour perk.\r\n[b][color=skyblue]Shimmerskin[/color][/b] - [i]Alt Adept[/i] - Caster gains 10% resistance to magic for a baseline 60 seconds. Improved by the Mage Armour perk.\r\n[b][color=skyblue]Mirrorskin[/color][/b] - [i]Alt Expert[/i] - Caster gains 15% resistance to magic for a baseline 60 seconds. Improved by the Mage Armour perk.\r\n[b][color=skyblue]Voidskin[/color][/b] - [i]Alt Master[/i] - Caster gains 20% resistance to magic for a baseline 60 seconds. Improved by the Mage Armour perk.\r\n\r\n\r\n[color=WhiteSmoke][b][u]Awareness/Vision spells[/u][/b][/color]\r\n\r\n[b][color=SpringGreen]Target Acquisition[/color][/b] - [i]Ill Apprentice[/i] - Slows the perception of time to half its normal rate, and identifies and highlights any hostile beings that are within the caster\\'s field of vision (but not through walls or obstacles) for 5 seconds.\r\n\r\n[b][color=SpringGreen]Intuition[/color][/b] - [i]Ill Apprentice[/i] - Shows the caster the direction to his current objective, so long as he is aware of it, for 60 seconds, and is toggle-able. Archetype of Clairvoyance, but does not require concentrating a spell.\r\n\r\n[b][color=skyblue]Night Eye[/color][/b] - [i]Alt Adept[/i] - grants the caster better low-light vision for (baseline) 60 seconds. [u]Nota Bene[/u]: The filter used for Night Eye has been changed by this mod, removing the blur and halving the bloom, whilst [u]enhancing its NV effectiveness[/u]. It is now more effective with darker ENBs and light mods. This will apply to Khajit and other forms of Nighteye using the basic effect also.\r\n\r\n[b][color=skyblue]Extrasensory Perception[/color][/b] - [i]Alt Expert[/i] - provides the caster with both night-vision and a persistent Detect Life capability which has extended range over the basic spell, for a baseline 60 seconds. Can be toggled off by re-casting the spell.\r\n\r\n\r\n[color=WhiteSmoke][b][u]Stealth spells[/u][/b][/color]\r\n\r\n[b][color=SpringGreen]Stifle[/color][/b] - [i]Ill Novice[/i] - Reduces the noise made by the caster\\'s movements by 20% for a baseline 180 seconds.\r\n[b][color=SpringGreen]Muffle*[/color][/b] - [i]Ill Apprentice[/i] - * Changed from vanilla. Reduces the noise made by the caster\\'s movements by 50% for a baseline 180 seconds.\r\n[b][color=SpringGreen]Vanishing Trick[/color][/b] - [i]Ill Apprentice[/i] - Caster is rendered invisible for 8 seconds. Cannot be extended by dual casting. Effect is broken by combat or any actions.\r\n[b][color=SpringGreen]Dampen[/color][/b] - [i]Ill Adept[/i] - Reduces the noise made by the caster\\'s movements by 75% for a baseline 180 seconds.\r\n[b][color=SpringGreen]Shadowdash[/color][/b] - [i]Ill Adept[/i] - Caster is rendered invisible and movement speed is increased by 50% whilst concentrating the spell.\r\n[b][color=SpringGreen]Mute[/color][/b] - [i]Ill Expert[/i] - Reduces the noise made by the caster\\'s movements by 90% for a baseline 180 seconds.\r\n[b][color=SpringGreen]Evanescence[/color][/b] - [i]Ill Master[/i] - Caster disappears, becoming invisible and entirely silent for a baseline 60 seconds, unless the effect is broken by action.\r\n\r\n\r\n[color=WhiteSmoke][b][u]Other spells in v0.2[/u][/b][/color]\r\n\r\n[b][color=skyblue]Waterwalking[/color][/b] - [i]Alt Expert[/i] - allows the caster to walk on the surface of water for a baseline 60 seconds.\r\n[b][color=gold]Stendarr\\'s Vigilance[/color][/b] - [i]Rest Expert[/i] - grants the caster the ability to perceive the undead, even through walls, in a significant area (larger than detect undead). Grants a cloak that cripples enemy undead in melee range, halving their rate of attack. Base duration of 60 seconds.\r\n\r\n\r\n\r\n\r\n\r\n[color=WhiteSmoke][u][size=5][b]Installation[/b][/size][/u]\r\n\r\nSimply download using the Nexus Mod Manager and install as with any mod - the archive should be set up correctly. Please let me know if not.\r\n\r\nIf you wish to download manually, simply place the .esp and .bsa file in your Skyrim\\\\Data directory.\r\n\r\n\r\n\r\n\r\n\r\n[u][size=5][b]Compatibility[/b][/size][/u]\r\n\r\n[b]This mod requires Dawnguard and Dragonborn DLCs to function correctly.[/b]\r\n\r\nThis mod has been made with being immersive and unobtrusive in mind - and as such should not have many conflicts. To the best of my knowledge (and I run 180+ mods on my Skyrim, including the [b]Apocalypse Spell Package[/b]) there are no conflicts outside other mods that may change Candlelight and Nightvision effects. These should be minimal; and over-ridden by the last mod in the load order, so theoretically you can choose your poison.\r\n\r\n\r\n\r\n\r\n\r\n[u][size=5][b]Help needed[/b][/size][/u]\r\n\r\nVisual aspects in UMP are largely based on vanilla effects, which is perfectly alright for 99% of my content. If a volunteer with the skills to change the art setup for the Candlelight-type spells would lend aid, however, these could do with a re-work for the different \\'stages\\' of light in UMP.[/color]",
  "categoryId": "75",
  "version": "0.2",
  "author": "FriarChris",
  "createdUnix": "1361753808",
  "updatedUnix": "1362526855",
  "containsAdultContent": false,
  "uploadedBy": "FriarChris",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013002",
      "name": "UMP - Utility Magic Package v0_1",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "UMP - Utility Magic Package v0_1-32349-0-1.rar",
      "uploadedUnix": "1361753300",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/cdbab1389bdbec6fdcf45e29a918301a8c4652eb50c313592cc741c5fd35db56/analysis/1407438422/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UMP%20-%20Utility%20Magic%20Package%20v0_1-32349-0-1.rar?fid=1000013002&ttl=1535808770&ri=8192&rs=8192&setec=d7c7e295f6438c7505de4969d1dee30e"
    },
    {
      "fileId": "1000015345",
      "name": "ChooseMags Clean 2048x2048",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "UMP - Utility Magic Package v0_2-32349-0-2.rar",
      "uploadedUnix": "1362526855",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c52aed47cd84d0f86fb4f2872f90dd7992133492c8df06b9ab5c4a47810fa47b/analysis/1407454543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UMP%20-%20Utility%20Magic%20Package%20v0_2-32349-0-2.rar?fid=1000015345&ttl=1535808771&ri=8192&rs=8192&setec=b386fd70a2f48c1aa26d6bf2d0784a5e"
    }
  ]
}