{
  "modId": 32352.0,
  "modName": "Lydia is Less Sarcastic",
  "summary": "This is a mod that provides a simple method of preventing Lydia from saying \\\"I am sworn to carry your burdens.\\\"",
  "descriptionHtml": "-- Description --\r\nThis mod prevents Lydia from saying \\\"I am sworn to carry your burdens.\\\" You might ask \\\"Why? There are other mods that do this already.\\\" This is true. I won\\'t, and don\\'t, make judgments about the quality of other similar mods. They are well done in their own right. I simply wanted to make my own version, one that went at the issue in a different, more direct (in my opinion) way. This method makes the the mod small and generally compatible with other Lydia mods. This mod should be compatible, for example, with any mod that just changes Lydia\\'s appearance. It will also be easy to install or uninstall. \r\n\r\nMy method, for those that are curious, was to edit the one objectionable line of dialogue and just add one condition: Lydia was not allowed to be the speaker of the line. This mod has worked well for me in all of my testing, but if you have any problems while using this mod please let me know. Also, I can probably fulfill requests for similar mods for other followers that have lines you don\\'t like.\r\n \r\n-- Version History --\r\nVersion 0.1: Original mod.\r\n\r\n-- Requirements --\r\nThere are no requirements for Lydia-fixedvoice.esp, but Lydia-fixedvoice-Hearthfire.esp requires Hearthfire.\r\n\r\n-- Compatibility --\r\nThis mod should be compatible with any mod that does not modify the line \\\"I am sworn to carry your burdens.\\\" It obviously may not work as designed with any mod that is supposed to do the same thing in a different way. That shouldn\\'t be done anyway, though, as such use would be at best redundant and pointless anyway.\r\n\r\nThere is an alternate version that may have better compatibility with Hearthfire. I haven\\'t tried it yet, but you can try using it instead if you use Hearthfire. Don\\'t use both versions of my mod at once, that would be redundant and really quite pointless. \r\n\r\n-- Installation --\r\nDownload the file and extract \\\"Data\\\" into your Skyrim directory, or anywhere else and then move the .esp file(s) of your choice into your \\\"Data\\\" directory. Enable the .esp of your choice (Lydia-fixedvoice.esp or Lydia-fixedvoice-Hearthfire.esp) like you would any other mod, with either the launcher or a mod manager.\r\n\r\n-- Uninstallation --\r\nSimply disable and/or delete the .esp file(s).\r\n\r\n-- Requests --\r\nIf anyone has any requests for me to do something similar for another follower, please let me know.",
  "categoryId": "66",
  "version": "0.1",
  "author": "squid937",
  "createdUnix": "1361750100",
  "updatedUnix": "1361750018",
  "containsAdultContent": false,
  "uploadedBy": "squid937",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012984",
      "name": "Lydia_Less_Sarcastic",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Lydia_Less_Sarcastic-32352-0-1.7z",
      "uploadedUnix": "1361750018",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/ea07814b9ee26ba2422ca008f48c574c47b6ae31ea1b8bacadc0784a9a2f9d14/analysis/1407438314/",
      "changelogHtml": " Original version <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lydia_Less_Sarcastic-32352-0-1.7z?fid=1000012984&ttl=1535808776&ri=8192&rs=8192&setec=80179f7d8a1bcf5bfcabd499d32d0af2"
    }
  ]
}