{
  "modId": 32350.0,
  "modName": "That of Legends",
  "summary": "Do you love cool custom made weapons/armor from Nexus modders? Do you tire that these items always lie in a chest in Riverwood? Do you miss the challenge and adventure we used to go through, to get our unique artifacts and collectibles? Then this mod is for you!\r\n\r\nIn short: quest, story and dungeon for custom made items on Nexus! Come join the fun",
  "descriptionHtml": "[size=16] [u] That of Legends [/u] [/size]\r\n\r\nWelcome!\r\n\r\nIf you are here, then it means you love Skyrim Nexus and you love implementing armor and weapons that other Nexus users make, into your game. I do too. However, I\\'ve grown quite tired of not having an adventure attached to it. A quest or a dungeon or a story - or all three!\r\n\r\nThat is why I am now creating the mod Things of Legends, where I will put as many custom made artifacts and add them to the game, with quests, dungeons and challenge to go with them. (Of course I\\'ll get permission from each modder before I use their stuff.)\r\n\r\n[color=red] NOTE: As of this moment we are still in BETA. It\\'d be immensely appreciated if you would test out the first dungeon and provide feedback. You can get there by opening your command console and writing COC KRIEGERGRAV. You can also use the in-game map marker near the Western Watchtower.\r\n\r\nPlease comment on difficulty, design, issues, bugs and so on. Also, when you test it, don\\'t save your character, as it may yield issues with that dungeon in future updates. Not gamebreaking, but still. EDIT* I think you can save without fear now, but don\\'t update the mod while inside a mod-related cell. [/color]\r\n[color=green] Latest update [/color]\r\nI\\'ve gotten a bunch of permissions from generous modders, so soon I\\'ll be adding a bunch of new artifacts to the game. I think I\\'ll put them in pre-existing spaces first, so they\\'re at least accessible, and then I\\'ll relocate them to custom spaces with quests later.\r\n\r\nAs of right now, I am currently designing the quest for Kriegergrav. There have been several complaints that it is complex (which have semi-died down after I changed it) but the quest will guide you through. From here on out I\\'ll make more linear dungeons, since that is clearly what the people desire.\r\n\r\n[u] 1. Requirements [/u]\r\nTo use this mod you need:\r\n - Skyrim (duh)\r\n\r\n... Nothing else so far. I\\'ll add each texture and mesh to my own mod, instead of relying on the mods of others.\r\n\r\n[u] 2. \\\"Artifacts\\\" supported so far [/u]\r\n- [url=http://skyrim.nexusmods.com/mods/3143] http://skyrim.nexusmods.com/mods/3143 [/url] [color=green] (Berserk Dragonslayer) [/color]\r\n\r\n[u] 3. Compatibility [/u]\r\nCompatible with everything.\r\n\r\n\r\n[u] How to install, upgrade and uninstall [/u]\r\n- To install, simply download the .esp and put it in your Skyrim/Data foler, or use Nexus Mod Manager and it\\'ll do it for you.\r\n\r\n- To uninstall or update safely, go to a cell where ToL hasn\\'t added or edited anything. The best bet would be a player house, but as of right now, most of the world can be considered safe.",
  "categoryId": "35",
  "version": "0.8.2",
  "author": "McBraas",
  "createdUnix": "1361750500",
  "updatedUnix": "1362101147",
  "containsAdultContent": false,
  "uploadedBy": "Mads_braas",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000012982",
      "name": "That of Legends 0_7",
      "version": "0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "99",
      "fileName": "That of Legends 0_7-32350-0-7.rar",
      "uploadedUnix": "1361749308",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/223a6ad700514303714249ad5316a544c6e2f3abc407dc6e536bce141f071598/analysis/1407438313/",
      "changelogHtml": " Added nordic ruin: Kriegergrav <br/> \n Added three bosses: Grosh the Cruel, Kalindra and Alexander Faust. Not completely balanced yet. <br/> \n Added 2Hand Sword Berserk Dragonslayer to Grosh the Cruel (Final boss) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/That%20of%20Legends%200_7-32350-0-7.rar?fid=1000012982&ttl=1535808773&ri=8192&rs=8192&setec=e5e4a40e38b186c627e1b7d5f8b1b1ad"
    },
    {
      "fileId": "1000013269",
      "name": "That of Legends 0_8a",
      "version": "0.8a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2808",
      "fileName": "That of Legends 0_8a-32350-0-8a.rar",
      "uploadedUnix": "1361836505",
      "modVersion": "0.8a",
      "virusScanUrl": "https://www.virustotal.com/file/10ae860aaacf6c110ac8fb593dbf0eb26310f882c5908e3d36367f120fcbc041/analysis/1407439779/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/That%20of%20Legends%200_8a-32350-0-8a.rar?fid=1000013269&ttl=1535808773&ri=8192&rs=8192&setec=45fd669a64fab955df601914f7332fb4"
    },
    {
      "fileId": "1000014052",
      "name": "That of Legends 0_8_2",
      "version": "0.8.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2812",
      "fileName": "That of Legends 0_8_2-32350-0-8-2.rar",
      "uploadedUnix": "1362101147",
      "modVersion": "0.8.2",
      "virusScanUrl": "https://www.virustotal.com/file/f4ff38eeea0ce18c7f976646e25a9c032096c997e5fd2521f16c8b98b3ad75e4/analysis/1407445161/",
      "changelogHtml": " Balanced out the encounters a bit <br/> \n Removed all the &#39;Bandit Chiefs&#39; and replaced them with regular bandits. Grosh is the only chief here&#33; <br/> \n Added a lot more clutter. Much of it is bandit loot, but there are also things like a bucket and firewood near a bonfire.  <br/> \n Added lighting effects (they should work properly now) <br/> \n Added flora (mushrooms) to the cave section <br/> \n Added some static clutter (debris, wall sconces) to better guide you through the dungeon without getting lost. <br/> \n Gave the bandits in the first room stuff to do, so they&#39;re not just standing around. It looked dumb. If you wanna look, then sneak into the room without being seen. <br/> \n Fixed some holes that allowed the player to see out into the big empty space beyond the dungeon. <br/> \n If you go to the Bannered Mare in Whiterun, you&#39;ll see an NPC named Arik. He is the future quest giver, but he doesn&#39;t have a function right now. Don&#39;t kill him. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/That%20of%20Legends%200_8_2-32350-0-8-2.rar?fid=1000014052&ttl=1535808774&ri=8192&rs=8192&setec=75d8a1c81bc2b1f8b08bf5b19d8da420"
    }
  ]
}