{
  "modId": 32363.0,
  "modName": "Skyrim Project Stability",
  "summary": "A comprehensive guide to eliminating lag, troubleshooting mods, Increasing computer performance, boosting processor speed (Without overclocking) and above all else completely eliminating memory related freezing.",
  "descriptionHtml": "[line]\n<br />[size=100][color=green]Skyrim Project Stability[/color][/size]\n<br />[line]\n<br />[Img=center]http://i.imgur.com/QEJnGa8.jpg[/img]\n<br />\n<br />[url=http://skyrim.nexusmods.com/users/6137612]GrandBulwark[/url]: Founder, Sole-Writer, Editor and Compiler.\n<br />\n<br />[color=yellow][u]READ THIS:\n<br />The Guide is now FULLY independent.  All the information will henceforth be on this page.  That means that the main download has been rendered obsolete.  That being said, there is a pack of all the videos created here for those who want to use them.  I will also upload a document that can be easily downloaded so that users can endorse easily.[/u][/color]\n<br />\n<br />My Mods,\n<br />[url=http://www.nexusmods.com/skyrim/mods/32363/?]Skyrim Project Stability\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/54784/?]Followers Share Knowledge\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/54574/?]Conjurer's Friend\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/54577/?]Creatures of the Night Revised\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/54650/?]Immersive Armors for NPCs Revisted\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/55320/?]8-bit Skyrim Theme Music\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/55583/?]Resistance Restrictions Removed\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/55618/?]Worn Armor Effects\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/56183/?]Palace of Kings Rugs Fixed\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/58237/?]Better Shrouded Armor - Standalone\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/58235/?]Black Dragonscale Hi-Res - Standalone\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/57908/?]Evil Incarnate Daedric Gear - Standalone\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/58238/?]Glorious Daedric Armory - Standalone\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/58233/?]Heroic Dwarven Armory - Standalone\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/57999/?]Insanity's Ebony Sword - Standalone\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/58322/?]Rabbits of Skyrim\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/57973/?]Project Standalone\n<br />[/url]\n<br />Project's I've Helped with:\n<br />[url=http://www.nexusmods.com/skyrim/mods/9494/?][img]http://www.mygoodeyenyc.com/modImages/skyrim_Warzones/WZonesSignature.png[/img][/url][line]\n<br />[color=green][size=75]Table of Contents:[/size][/color] [i]use ctrl+f for easy navigation.[/i]\n<br />[line]\n<br />[color=green]Sections[/color] \n<br />[color=orange]Sub-Sections[/color]\n<br />[color=yellow][u]Necessary Information, READ IT![/u][/color]\n<br />[url=http://skyrim.nexusmods.com/Images/294604/]Links to References and utilities[/url]\n<br />\n<br />Section 1: Introduction(Optional)\n<br />[list][*]1A: What this Guide is;\n<br />[*]1B: What this Guide isn't;\n<br />[*]1C: News on Development;Section 2: background information (optional)\n<br />[*](No Sub-Sections)Section 3: Optimizing your Computer (Techniques listed or the equivalent are required for support) \n<br />[*]3A: Startup; \n<br />[*]3B: Services;\n<br />[*]3C: Cleanup and Maintenance;Section 4: Skyrim Related Tweaks and Troubleshooting; (Required for Support)\n<br />[*]4A: Safe Modding Practices;\n<br />[*]4B: Load order/Mod list Management; \n<br />[*]4C: The Unofficial Patches, SKSE, STEP and SkyProc; \n<br />[*]4D: Mods with Unsolved Issues;\n<br />[*]4E: Over Modding;\n<br />[*]4F: .ini Issues;\n<br />[*]4G: Papyrus Debugging;\n<br />[*]4H: Testing Saves For StabilitySection 5: Memory Leak (Cleanmem; Most important; Required for Support)\n<br />[*](No Sub-Sections)Section 6: Processor Optimization (High Priority, Highly Recommended)\n<br />[*]6A: Parked/Idle Processor Cores; \n<br />[*]6B: Power Saving Mode/Hybrid Sleep Mode;\n<br />[*]6C: CPU Timer Tweak;Section 7: Support/FAQ(Required For Support)\n<br />[*]7A:Support, \n<br />[*]7B:FAQSection 8: Conclusion;\n<br />[*](No Sub-Sections)\n<br />[/list][line][color=green][size=75]Section 1: Introduction;[/size][/color][line]First of all; let's be clear. This guide, if followed will eliminate memory related freezing entirely. Experience it for yourself and spread the word. There are thousands of individuals out there who would love to play Skyrim, but cannot suffer the instabilities, bugs and issues therein.[color=yellow][u]Please note that not all freezes are related to system memory usage.[/u][/color] There are still mod conflicts, scripting errors and other factors to take into consideration. With a plausible, working mod list consisting of mods that are up to date (in relation to your version of skyrim), you should no longer suffer from memory related crashes.[line][color=orange][size=50]1A: What guide is;[/size][/color][line]This guide is a list of useful utilities and techniques that will [b]ALWAYS[/b] make Skyrim a more stable and reliable application (game). These techniques will work for low end computers and Gaming rigs alike. It is based off the windows 7 operating system and while it may work for other operating systems, I cannot support or make suggestions on the functionality/implementation of these techniques on anything other that Windows 7.This guide will show you not only how to optimize your load order and clean your mods; it also focuses a great deal on optimizing your computer entirely. Everything herein is safe, effective and easy to remove in case you were wondering. Not only that, the use of this guide will carry over to every aspect of performance on your computer.[line][color=orange][size=50]1B: What this guide isn't;[/size][/color][line]This guide is NOT related to graphics, immersion, scripting, new Skyrim real estate, Bob Dole or that sexy armor that looks so good on your Dremora-Orc-hybrid priestess. In truth, this guide does not include any altered assets of any kind. As in all things, many errors are not a result of programming; but rather the operator of the equipment. These techniques will allow you to fix many errors you may have made during the course of your pre-existing Skyrim experience. The guide is NOT a substitute for a better graphics card or processor. It's not a end-all fix-all of extreme proportions. It's simply learning how to take care of your operating system and your Steam-Connected install of The Elder Scrolls V: Skyrim. [color=yellow][u]There are some mildly advanced techniques, so be sure to read carefully.[/u][/color] [line][color=#ffa500][size=50]1C: News on Development;[/size][/color][line][color=yellow][u]Important updates today. The BOSS guide will be left up for archival purposes, the merged patch guide will be removed and superseded by a text guide for Bashed Patches. All users are advised to continue their current load order with BOSS and merged patches(If you already have merged patches); then when you restart transition to Bashed Patches and LOOT(Described Below).\n<br />\n<br />I will also be revising the Skyproc section with new, critical information. And adding a forward to the Skyrim tweaks section. It will contain some information, that is not as obvious as I would have thought as I've had several people make simple mistakes with Skyrim. Skyrim does not like mistakes, simple or not.[/u][/color]\n<br />\n<br />[color=yellow][u]This guide is provided on an \"as is\" basis and is not warrantied, express or implied. These tips will HELP if you can follow simple instructions. If you cannot, read no further.[/u][/color][color=green]\n<br />\n<br />[/color][line][color=green]\n<br />[size=75]Section 2:Background Information;[/size][/color]\n<br />[line]\n<br />Here we are again people; yet another ridiculous attempt at making Skyrim run better.  There are a multitude of ill advised tweaks, tricks and mods out there that promise these results.  The thing to remember; some things work for certain setups, other things don't.  The resolutions offered in many places are subjective.  I have done my best to retain an objective approach; many of the tweaks and programs listed here are not computer dependent.  The majority of the tips here will work for all of you and if they won't, it is clearly stated. \n<br />\n<br />First of all, this is NOT another guide that tells you how to decrease graphic fidelity for the sake of performance, the world has enough of those already and it should be obvious to most already.  Performance issues due to substandard/ancient hardware may not get a significant performance boost, at least by Skyrim's standard.  Individuals with such hardware will likely have to run the game on low regardless.  Before we continue allow me to post my specs now as opposed to when I started playing Skyrim in 2011.\n<br />\n<br />Old E-Machines:\n<br />Intel core 2 duo 3.3 Ghz\n<br />Integrated G41 graphics chip\n<br />Caviar Green 1 TB HDD\n<br />3 gigs of 1333 RAM\n<br />\n<br />New PC of my own making:\n<br />\n<br />AMD FX 8350 4Ghz OC'ed to 4.5ghz base clock\n<br />{[url=http://www.youtube.com/watch?v=ssL1DA_K0sI]Overclocking[/url] support is NOT offered here, no exceptions}\n<br />Nvidia EVGA 670 FTW 2 gig DDR5 ALWAYS running latest drivers, even if they're beta\n<br />16Gbs of DDR3 1600 RAM overclocked to 1680\n<br />{*AGAIN* [url=http://www.youtube.com/watch?v=ssL1DA_K0sI]Overclocking[/url] support is NOT offered here, no exceptions}\n<br />Caviar Black 2 TB HDD (Windows 7 Ultimate)\n<br />Seagate Barracuda 250 Gig HDD (Backups)\n<br />Seagate Barracuda 80 Gig HDD (Paging File)\n<br />\n<br />Now as you can see I've been on both sides of the spectrum and I've tried EVERYTHING to make Skyrim work.  Right now I'm running Full ultra settings, with over 150 HD texture packs that cover everything with High Resolution Textures(Mostly 2048 textures, some 1024).  Almost no texture remain at 512 or below.\n<br />\n<br />Now we're approaching the root of the problems...  Even with a great PCs; Skyrim's .EXE (application file) has an underlying issue,  a memory leak.  Now for those of you who don't know, that means that the application has an issue removing the data that it no longer needs.  As the data accumulates, the game starts to lag.  When it approaches 3.2 gigs it will freeze.  This is not something that is easily FIXED but I have found a way to remove the problem.  Remove may not even be the correct word, \"treat\" seems more fitting.\n<br />\n<br />Now in reality; it may not be a result of a memory leak, it may just be poor coding or the introduction of massive edits and/or scripts into a single save.  The issue is present in vanilla Skyrim as well, though the introduction of numerous HD texture packs can severely aggravate the issue. \n<br />\n<br />Have a look [url=http://forums.bethsoft.com/topic/1298690-confirmation-of-memory-leak/]here[/url] for more information on the subject.  Although old, the same test can be run today with similar results.  Bethesda acknowledged it, although their patch history does not list it under fixes.  The patch change logs can be found here [url=http://www.uesp.net/wiki/Skyrim:Patch]here[/url] and while they do mention [i]General memory and stability improvements[/i], they never cover a potential memory leak.\n<br />\n<br />This guide is focused on working around that limitation, regardless of the issue's origin. \n<br />[line]\n<br />[color=green][size=75]Section 3: Optimizing Your Computer;[/size][/color]  \n<br />[line]\n<br />This section is devoted to the optimization of primarily the Windows 7 operating system.  Some parts carry over to other platforms.  I am unaware of the risks and benefits of these suggestions on Windows XP, Vista or 8.  I don't recommend or condemn their use on them, however I cannot support you in the event something goes awry. \n<br />\n<br />[line]\n<br />[color=orange][size=50]3A: Startup;[/size]\n<br />[/color][line]\n<br />\n<br />How fast is your PC?  Does it already run great, no issues to speak of?  Or perhaps, no issues you notice.  Skyrim notices them, or at least it suffers because of them.  How many services do you think are running that don't [i]need[/i] to be?  How many programs/utilities start up with your computer?  If you haven't delved into this before then there are [i]many[/i] issues we must address.\n<br />\n<br />[list][*]Type \"msconfig\" without the quotes in your start menu search bar.\n<br />[*]Press enter. \n<br />[*]Go to the startup tab in the new window.\n<br />[*]In the checklist, un-check the the services you recognize as unnecessary (E.G. Programs that automatically update drivers etc.)\n<br />[*]Google search the title of [i]any[/i] of any currently checked boxes to see if they are necessary. [E.G. Programs that regulate and control graphics cards, Sound Cards/Chips etc.)\n<br />[*]Un-Check the unnecessary programs.    \n<br />[/list]  [color=yellow][u]Unchecking startup items does [i]not[/i] prevent them from running; it merely prevents them from [i]starting[/i] with the PC.  Any process that you decide shouldn't startup with your operating system, will still be readily available if the need arises.[/u][/color] [line][color=orange][size=50]3B: Services;[/size][/color][line]Similar to start up items; services are features from Windows and installed programs/components that run in the background.  Some of these are very important, others are generally worthless to most users.  Mind you, there are other guides that will show you more safe candidates for disabling.  These are the ones I use and recommend. \n<br />[color=yellow][u]Disclaimer/Warning:\n<br />Should you go seeking more options to set to manual; always make sure you are reading from a [i]reputable[/i] source.  Also, should you decide you can figure it out; my advice would be to rethink that.  Do not [i]ever[/i] disable anything, (aside from themes) always set it to manual; and if you don't know what it is, leave it alone![/u][/color]\n<br /> [list][*]Type [i]services[/i] in the Start Menu's search bar\n<br />[*]click [i]services[/i] [color=yellow][u](Not component services)[/u][/color] \n<br />[/list]According to Vishal, these are the services that can be safely set to [color=yellow][u]MANUAL:[/u][/color][quote][i]\"Application Experience\n<br />Computer Browser (If your computer is not connected to any network)\n<br />Desktop Window Manager Session Manager (If you don't use Aero theme)\n<br />Diagnostic Policy Service\n<br />Distributed Link Tracking Client\n<br />IP Helper\n<br />Offline Files\n<br />Portable Device Enumerator Service\n<br />Print Spooler (If you don't have Printer)\n<br />Protected Storage\n<br />Remote Registry (Always disable it for Security purposes)\n<br />Secondary Logon\n<br />Security Center\n<br />Server (If your computer is not connected to any network)\n<br />Tablet PC Input Service\n<br />TCP/IP NetBIOS Helper (If you are not in a workgroup network)\n<br />Themes ( If you use Windows Classic theme)\n<br />Windows Error Reporting Service\n<br />Windows Media Center Service Launcher\n<br />Windows Search (If you don't use Windows Search feature frequently)\n<br />Windows Time (If you don't want to update system tray clock time using Internet)\n<br />PS: You can see the details of each service to determine whether you should disable it or not.\"[/i][/quote]\n<br />For the record, that is a direct quote and this [url=http://www.askvg.com/windows-7-services-that-can-be-safely-set-to-manual/]Link[/url] will take you straight to the full page.  Also I disable themes entirely, I prefer High Contrast Black.\n<br />[line]\n<br />[color=orange][size=50]3C: Cleanup and Maintenance;[/size]\n<br />[/color][line]\n<br />\n<br />Next, are you using the Windows default \"disk defragmenter\", \"disk cleanup\" and \"add or remove programs\" utilities?  If you aren't using them or anything else, that's a major issue.  Although there are FAR better alternatives to the windows default options, something is better than nothing.  If you were using these generic programs, let's get something better, faster and more efficient.   If you weren't using anything; for the love of Talos, read this sub-section!\n<br />\n<br />[color=yellow][u]********Solid State Drive Users: DON'T DEFRAG EVER********[/u][/color]\n<br />Refer to this [url= http://helpdeskgeek.com/featured-posts/should-you-defrag-an-ssd/]link[/url]   \n<br /> [color=yellow][u]*Please note that there are other options aside from these BUT whatever you choose should completely eliminate the need to ever run windows' \"Add or Remove Programs\",\"Disk Defragmenter\" or \"Disk Cleanup.*[/u][/color]\n<br />\n<br />[url=http://www.piriform.com/ccleaner/download]Ccleaner:[/url]     \n<br />\n<br />Ccleaner is the best disk cleanup/registry cleaner out there.  It is also one of the only utilities that doesn't charge or limit your registry cleanup options.  For the intents and purposes of this guide the cleanup options on default program congiuration are [i]all[/i] that is suggested.  [color=yellow][u]Registry optimization no longer suggested as it bears a slight yet significant chance of ruining your PC as a whole.  While Ccleaner does claim to backup your changes, it does NOT.  Rather it dumps your entire registry into a .REG file.  This is largely useless as it does not restore your registry, rather it merges with the current registry which does not FIX anything.  Users who choose to use Ccleaners Registry options should ALWAYS create a system restore point FIRST.  This is the ONLY way to effectively eliminate the risk.[/u][/color]\n<br />\n<br />[url=http://www.mydefrag.com/]MyDefrag:[/url] \n<br />\n<br />Small, fast and effective.  The best there is in defraging.  Run \"system disk monthly\" every month on local disk C: OR Run \"system disk weekly\" every week.  DO NOT DO BOTH!  It is my personal recommendation that you run \"system disk monthly\" when you first get it. (unless you have had your pc less than a month.)  Then from there make your choice.  Wait a month and do it again, or wait a month and then do it weekly. [color=yellow][u]Again, solid state drives do not need to be defragmented.  If you do defragment your solid state drive; you are negatively impacting the drive's lifespan.[/u][/color]\n<br />\n<br />[url=http://www.revouninstaller.com/revo_uninstaller_free_download.html]Revo Uninstaller:[/url] \n<br />\n<br />A great tool for getting rid of what you don't need anymore.  This program will uninstall the selected program's core files, then scan the file structure and registry for leftovers.  It is an invaluable tool for optimizing your PC.  [color=yellow][u]Make sure you let the Revo uninstaller backup your registry in a dedicated folder.  It does this by default normally.[/u][/color]\n<br />\n<br />[url= http://www.jam-software.com/treesize_free/]Tree Size:[/url] \n<br />\n<br />Now entering a new domain; the windows explorer can get old.  There are so many different folders, you couldn't possibly navigate them quickly.  This program is a nifty drop down menu that will display the contents of your ENTIRE HDD/SSD(s) in a convenient tree.  From this tree menu you can move, delete and rename files.  [color=yellow][u]Disclaimer: Running this program as administrator will give you access to [i]everything[/i] on the computer, including windows components and hidden files.  I will not be responsible should you delete a required file.  Ignore that warning at your own peril.[/u][/color]\n<br />[line]\n<br />[color=green][size=75]Section 4: Skyrim Tips,Tweaks and Troubleshooting;[/size][/color]\n<br />[line]\n<br />Foreward:  This section contains Skyrim etiquette; meaning that many of the practice here will be essential to the survival of your playthroughs.  Many people can offer you a stable, smooth Skyrim at first.  It's when you combine your chaotic Load Order with skyrim's erratic scripting that the stuff hits the fan.  So lets start at the beginning.\n<br />\n<br />The Elder Scrolls V: Skyrim is not like previous TES or Fallout titles from Bethesda, in that you cannot just rip out module files(.esp, .esm, plugins, mods etc.) and continue on the same save.  This is even more so the case when you start getting Dynamically created patches; from TES5EDIT, Wyre Bash or Skyproc(ASIS, Dual Sheathe Redux etc.).\n<br />\n<br />Select a mod manager first;  I personally use two and it is suggested that you do the same here.  I use the Mod Oraganizer for mod sorting and Wrye Bash for creating patches.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/modmanager/?]Nexus Mod Manager:[/url]  \n<br />Likely the most widely used mod sorting utility.  It offers you categories, profiles, mod update tracking and the ability to endorse files you've downloaded from it's interface.  I haven't tested this utility in some time and it should be noted that the NMM video is brief, and outdated.\n<br />\n<br />NMM Instructional Video (Old Version of NMM, should still be more or less the same):\n<br />[youtube]1yqjCtOA2q0[/youtube]\n<br />(You can visit my [url=http://www.youtube.com/channel/UCju3kgOWra96b1m7V5b9-5A]Youtube Channel[/url], use ctrl+Mousewheel(Not technically fullscreen) or download the guide pack to see the video in full screen)\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/1334/?]Mod Organizer:[/url]\n<br />My preference, this utility offers several features and has a higher learning curve than NMM.  However, it offers a virtual data directory that gives each mod it's own subfolder.  You can set the priority of mods to determine what will overwrite what in game, but no physical overwrites are ever made.  You can even look and see which mods a particular mod is overwriting; and what it is being Overwriting/overwritten by.  It also can be set up to auto extract BSA files upon installing mods.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/1840/?]Wrye Bash:[/url]\n<br />I strongly advise you to go ahead and download this utility.  As a mod sorting software, I've yet to test it.  However, it is essential that you have this program for Bashed Patches which will be covered later.  It also has a higher learning curve then NMM; I've heard it has some awesome features.  Advanced users I encourage to explore these features, I have yet to do so myself so for the purposes of this guide; Wrye Bash is only our patch creator.\n<br />\n<br />[color=yellow][u]Note:NMM should be considered the easiest one to get into and use.  People who just want to play the game, NMM is your friend.  More seasoned users I would suggest you get into the Mod Organizer as it is more reliable and it's easier to see what is actually making it into your game.  Wrye Bash can also be used, but that should be reserved for those adventurous enough to explore its features.[/u][/color]\n<br />\n<br />[color=yellow][u]The .ini tweaks have been removed due to potential side-effects with certain mods and setups.  If you added them and you're having issues, please remove them or refresh your .inis entirely before asking for support![/u][/color]  \n<br />[line]\n<br />[color=orange][size=50]4A: Safe Modding Practices;[/size]\n<br />[/color][line]\n<br />This section is probably the most useful to new modders.  That being said, seasoned modders should also take a look.  This sub-section is now required for support.  \n<br />\n<br />Here is a subject that is often overlooked, [i]preventative measures[/i].  It's far easier to [i]avoid[/i] a problem, than it is to [i]solve[/i] one!  It's also far easier to [i]isolate[/i] a problem, if you rule out potential issues with [i]preventative measures.[/i]  This applies to all areas of life, however let's take a look at how it factors into Skyrim.\n<br />\n<br />Let's start with adding mods; that is after all why we are all here!  New mods can be wonderful, unfortunately they can also corrupt your save files if you are not careful.  Most of us have a mod list and a character that depends upon that mod list.  Do NOT remove mods that are loaded into that save unless you are planning to restart from a [i]clean[/i] save.  The exceptions to this rule are as follows:\n<br />[list][*]Texture and Meshes (Some .esp files are used to load textures/meshes from a BSA)\n<br />[*]Small mods without [i]any[/i] scripts. (inadvisable with large load orders)\n<br />[/list][color=yellow][u]Do not be fooled by save game cleaners, or clean save procedures.  A clean save can only be achieved by manually restarting the game.[/u][/color]\n<br />Now let's say as an example you want to add a mod in a current play through.  That is generally okay depending upon the mod type.  Massive edits to vanilla scripts are ill advised mid-game additions (EG. [url=http://www.nexusmods.com/skyrim/mods/37216/?]Apollodown's Civil War Overhaul[/url]).  It is good to have a backup save to fallback on in the event that issues are created by your addition.  So let's walk you through my backup save procedure.\n<br />[list][*]Open your most recent save [i]without[/i] adding any new mods.\n<br />[*]press the tilde key to open the console.\n<br />[*]Type the following[quote]save \"Backup Save\"[/quote] \n<br />[*]Hit enter\n<br />[*]Make sure \"Backup Save\" appears in the list of your saves.\n<br />[*]Close out and add your mods\n<br />[*]Organize the mods with LOOT or manually\n<br />[*]Clean the mod(s) via TES5EDIT If applicable(Unless otherwise started by The Mod Author.  EG [url=http://www.nexusmods.com/skyrim/mods/23390/?]Guard Dialogue Overhaul[/url])\n<br />[*]Activate the mod(s)\n<br />[*]Play the Game\n<br />[/list]Now, let's talk about updating mods.  As you all know, many mod authors are still releasing new versions of current mods.  This is tricky because it's difficult to know what exactly has been updated, what has been changed and what has been removed entirely.  Most of the time with small mods, it's okay to update so long as you are [u]far away[/u] from what is being updated/changed.  The following mod types are NOT okay to update mid-save.[list][*]Any heavily scripted mods, despite what the author or commentators may say to the contrary.\n<br />[*]Mods containing massive edits to the world space.\n<br />[*]Mods editing your current location in game, again aside from texture/mesh swaps.\n<br />[/list][color=yellow][u]Description pages on the Nexus commonly contain an update and/or installation section.  Refer to this section to see if the Author has outlined safe update procedures.  Again if the mod is script heavy; it's good to wait until your next playthrough rather than update.[/u][/color]If you choose to ignore this, which you can of course.  At least backup your save using the procedure outlined above.  That way you don't have to restart, you can just rollback to your previous load order.   Save file cleaners are unreliable and could irreparably damage your save. SKSE's \"clearinvalidregistrations\" command does NOT prevent issues from occurring altogether.  The only fool proof way to mod successfully, is to follow the procedure.  If you don't then no amount of cleaning, swearing or hitting your monitor with a broomstick will fix your corrupted save.Now let's close this section with a final tip.  [i]Always[/i] read the descriptions of mods you are interested in.  Pay special attention to the compatibility section, installation section and any FAQs or notes on the functionality of the mod.  Next, make sure to read the first few pages of commentary on the mod.  Negative reviews aren't necessarily a \"deal-breaker\", however if everyone who has used the mod has complained, you may have just saved yourself some headache later![line][color=orange][size=50]4B: Load Order/Mod List Management;[/size][/color][line]\n<br />[url=https://github.com/loot/loot/releases]LOOT - Load Order Optimization Tool[/url]\n<br />\n<br />LOOT is the new BOSS, more or less.  It actually sorts mods by scanning them, rather than just one users interpretation of where the mods should go.  What does this mean?  No more unrecognized plugins.  It still reports dirty edits and errors as well.   \n<br />\n<br />[color=yellow][u]If you are currently using BOSS you can refer to this video.  Once you restart a new playthrough it is advised that you switch to LOOT[/u][/color]\n<br />[youtube]sgc3msTg3DY[/youtube]\n<br />(You can visit my [url=http://www.youtube.com/channel/UCju3kgOWra96b1m7V5b9-5A]Youtube Channel[/url], use ctrl+Mousewheel(Not technically fullscreen) or download the guide pack to see the video in full screen)\n<br />\n<br />Be advised, cleaning is no longer suggested.  If a mod has dirty records reported by LOOT; report it to the author and let them fix it the proper way, if they can't or won't then remove the mod.  There are various circumstances in which cleaning can mess things up in ANY Bethesda or Obsidian game which affords the option to do so via automated xedit scripts.  They *work* a lot of the time, but in many instances they will break mods entirely; and in almost no circumstance is the process \"fixing\" anything.\n<br />\n<br />Bashed Patches:  \n<br />[color=yellow][u]Merged Patches are no longer suggested here, finish your current playthroughs with them, if you have one that was suggested here; and switch to Wrye Bash.  New Users; do not ignore this section.  Bashed Patches are essential to make many of the great mods here on the Nexus, work with one another.[/u][/color]\n<br />\n<br />First download and install [url=http://www.nexusmods.com/skyrim/mods/1840/?]Wrye Bash[/url] it's installation instructions are pretty clear.  Make sure you read them.  Once you are done, start the program.  You'll notice that your load order is in a white text box in the UI, and that a new plugin titled \"Bashed Patch, 0.esp\" is in said load order.  Here is what you need to do;\n<br />[list][*]First move \"Bashed Patch, 0.esp\" below ALL of your normal mods, and directly above and Skyproc Generated patches.  So basically last unless you are using Dual Sheathe Redux, ASIS, Automatic Variants etc.\n<br />[*]Right Click \"Bashed Patch, 0.esp\" and select \"Rebuild Patch\".\n<br />[*]Select [i]only[/i] \"leveled lists\", unless you are starting a new game in which case you can merge any patches Wrye Bash detects.\n<br />[*]Press \"rebuild Patch\", when the report appears, view it if you like and then close the program.\n<br />[*]Important Note:  Bashed Patches should be updated for every mod you add/remove that alters leveled lists via this procedure. Wrye Bash is subject the same in game preparation, and in game aftermath cleanup as Skyproc is.  The procedure will be outlined in the following section under Skyproc.  It should be repeated every time you update your bashed patch.  \n<br />[/list][line][color=orange][size=50]4C:The Unofficial Patches, SKSE and SkyProc;[/size][/color][line]These mods are imperative to a error free environment; Especially if you are on the latest update; which according to Bethesda, may be the last.  If you have all the DLC's, Get all of these patches.  You only need the ones that correspond to your installed DLC's.  \n<br />[url= http://skyrim.nexusmods.com/mods/19]Skyrim Patch:[/url]  (applies to everyone)\n<br />\n<br />[url=http://skyrim.nexusmods.com/mods/23491]Dawnguard Patch:[/url] (Dawnguard users only)  \n<br />\n<br />[url= http://skyrim.nexusmods.com/mods/25127]Hearthfire Patch:[/url] (Hearthfire users only) \n<br />\n<br />[url= http://skyrim.nexusmods.com/mods/31083]Dragonborn Patch:[/url]  (Dragonborn users only) \n<br />\n<br />[url=http://skyrim.nexusmods.com/mods/31255]High Resolution DLC Patch:[/url] (High Resolution DLC users only)  \n<br />\n<br />[url=http://skse.silverlock.org/] Skyrim Script Extender (SKSE):[/url]\n<br />\n<br />SKSE is a support launcher that extends skyrim's capabilities without any cost in performance.  It is required for a great deal of mods(EG. SkyUI).  It is easy to install thanks to their fairly recent addition, a one click installer!\n<br />\n<br />SkyProc:\n<br />Several mods out there rely on a java based application known as SkyProc.  Several popular mods rely on these [url=http://www.uesp.net/wiki/Tes5Mod:SkyProc]\"SkyProc Patchers\".[/url]  Examples include [url=http://www.nexusmods.com/skyrim/mods/18436/?]\"A.S.I.S. - Automatic Spells Increased Spawns\"[/url], [url=http://www.nexusmods.com/skyrim/mods/21377/?]\"Automatic Variants\"[/url], [url=http://www.nexusmods.com/skyrim/mods/34155/?]\"Dual Sheathe Redux\"[/url] and so on.\n<br />\n<br />So installation starts off simple, just follow the instructions of the mod and then open the \"skyproc patchers\" folder in Data.  Once here you will notice a folder for each Skyproc patcher you have.  Each of these patchers [color=yellow][u]must[/u][/color] be run before you play, and EVERY time you update your load order(This includes simply re-ordering your plugins.)  \n<br />\n<br />Skyproc patchers creates a dynamic .esp to add their effects to, and maintain compatibility between themselves and your mod list.  The .esps generated by Skyproc CANNOT rely upon one another.  To prevent this, have only one of the .esps for the skyproc mods you are patching activated when you run the patcher.  So if you have ASIS, Automatic variants and Dual sheathe redux; two would be turned off in the launcher/mad manager when you patch the other.  This can be easily achieved using the [url=http://www.nexusmods.com/skyrim/mods/29865/?]Skyproc Unified Manager[/url], which is also useful to bypass the automated launch/initialization of B.O.S.S. that some Skyproc patchers have packaged with.  \n<br />\n<br />Preparing to update Wyre Bash and Skyproc Patches;\n<br />Now, this procedure is first of all [i]not[/i] optional if you use SkyProc or Wrye Bashed Patches.  This is something that may seem complicated, but it isn't.  To outline it briefly, this procedure will teach you to purge the cell buffers, and reset the world cells so that upon every update of the patches that you have, the NPCs respawn and everything is reloaded from memory and not from the games cache.  This ensures that your new records are loaded, rather than trying to update existing cached records to conform to your patch's changes.  Basically, every time you know you are going to have to run the patchers or update your bashed patch(Every time your load order is updated you should so both); repeat this procedure.\n<br />\n<br />Before you update your patches, and while in game;\n<br />[list][*]Go to an interior and open the console\n<br />[*]Type \"PCB\" and hit enter to purge cell buffers\n<br />[*]Save the game and then close itUpdate your patches, and then continue;\n<br />[*]load your save after you've updated your load order\n<br />[*]Reset the world cells. (See my note below for options to reset world cells)\n<br />[/list]Note:  You can reset world cells by default by causing 31 days to pass.  This can be achieved, albeit slowly, with this mod [url=http://www.nexusmods.com/skyrim/mods/12625/?]No more boring sleep-wait menu[/url].  While I do suggest you pick up that mod, I prefer to use the MCM options packaged in [url=http://www.nexusmods.com/skyrim/mods/3829/?]Deadly Dragons[/url](MCM&gt;Extra Options&gt;\"World Cells Reset in\") or [url=http://www.nexusmods.com/skyrim/mods/24913/?]Skyrim Immersive Creatures[/url](MCM&gt;Random Cell Respawner&gt;Prepare Cell Reset&gt;Follow Prompts).[color=yellow][u]Never overlook running the patchers when you update your mod list.  All of them, every time; it doesn't matter how much or little has changed.  Your save file depends upon this, you have been warned.[/u][/color][line]\n<br />[color=orange][size=50]4D: Mods with Unsolved Issues;[/size]\n<br />[/color][line]\n<br />This section covers the broken mods that are still very popular.  Additions, subtractions and alternatives are welcome.  This section is always a work in progress, mod authors are constantly coming/going.\n<br />[i]They're not in a particular order, priority 1-5; 5 being highest possible risk to game;[/i]\n<br />\n<br />Crimson Tide-Blood:  Generally Unstable, Cloaking Scripts. [color=yellow]{priority 3}[/color]\n<br />Unlimited Bookshelves: OLD, Unsupported [color=red]{priority 5}[/color]\n<br />(Warzones, Claralux and Imaginator removed due to development in progress.  Check their respective pages for updates.)\n<br />\n<br />If you feel that a mod has been posted here in error, feel free to contact me directly here on the Nexus via PM.  I will expect a better argument than \"It works fine for me.\"  Additions are welcome as well but again I'll expect a better argument than \"It doesn't work for me.\"\n<br />\n<br />Alternatives:\n<br />[url=http://skyrim.nexusmods.com/mods/60]Enhanced Blood Textures[/url] {Alternative to Crimson Tide}\n<br />[url=http://skyrim.nexusmods.com/mods/35399/?]Book Covers Skyrim[/url] and [url=http://skyrim.nexusmods.com/mods/24359//?]Bookshelves Script SKSE[/url] {Alternatives to Unlimited Bookshelves}\n<br />[url=http://enbdev.com/]ENB[/url] The Binaries offered at this site are the only working alternatives for shadow/color correction, depth of field and lighting options.  Presets are here on the nexus, you should select one that fits [i]your[/i] load order and needs.  Support for preset tweaking is not offered at this time. {alternative to Claralux, Imaginator}  \n<br />[line]\n<br />[color=orange][size=50]4E: Over Modding;[/size]\n<br />[/color][line]\n<br />The \"Blacklist\" now only consists of broken mods, however that is [i]not[/i] by any means an indication that previously discussed dangers, no longer exist.  If you add too many \"Cloaking Scripts\" to the player reference your save will bloat over time.  If you add an excessive amount of world edits to one cell, you will suffer crashes.  If you have 255 .esps/.esms active in your load order, you're probably going to have to restart with less because load orders that long are VERY tricky to stabilize.  \n<br />\n<br />It can be tricky to know just what is safe to add.  Certain mods add [url=http://www.nexusmods.com/skyrim/mods/141/?]hundreds of trees[/url], [url=http://www.nexusmods.com/skyrim/mods/30450/?]lighting changes[/url], [url=http://www.nexusmods.com/skyrim/mods/3829/?]dragon combat skills[/url], [url=http://www.nexusmods.com/skyrim/mods/18436/?]enemy/difficulty enhancement[/url] etc(linked examples are safe, I use them).  The more you add, the more likely you have to deal with conflicts.  Some conflicts are fine some are bad, others are game breaking.\n<br />\n<br />Two types of mods are prominent throughout the nexus(Unless we're talking adult content here, which for the record I'm not); mods that edit and add content to cells and others using the scripting system to dynamically alter some aspect of the game.  Cloaking scripts can be particularly difficult because there is only so much the the Game Engine can handle at one time, crashes from script lag can be random or consistent.  Mods that contain cloaking scripts are often signified by the need for [url=http://skyrim.nexusmods.com/mods/24020]The Brawl Bugs Patch.[/url]  These mods are [i]not[/i] flawed.  They will work fine, even in unison with one another and the rest of [i]most[/i] load orders.  However, it is much more likely that you will have issues if you have a lot of these mods active in a single load order. \n<br />\n<br />Mods that contain world and NPC edits are normally fine.  However, mods that add spawn points like  [url=http://skyrim.nexusmods.com/mods/12977]Immersive Patrols[/url] can also irritate existing issues in exceedingly altered cells/worldspaces.  Another example of a perfectly fine mod, that can cause issues on a situational basis.\n<br />\n<br />More common are mods that alter vanilla assets to add [url=http://www.nexusmods.com/skyrim/mods/10462/?]Items,[/url] [url=http://www.nexusmods.com/skyrim/mods/19733/?]Clothing/Armor,[/url] [url=http://www.nexusmods.com/skyrim/mods/10462/?]Weapons[/url] or [url=http://www.nexusmods.com/skyrim/mods/35631/?]creatures[/url] to your game.  These mods alter what are known as \"Leveled Lists\".  These lists determine what enemies you will face, and what type of gear the enemies will have your level current level.  These mods often require \"Bashed\"(Immersive Armors is not subject to this limitation) patch to function together.  Sometimes Authors will release compatibility patches for certain popular mods, this is not always the case.\n<br />[line]\n<br />[color=orange][size=50]4F: .ini Issues[/size]\n<br />[/color][line]\n<br />There have been numerous reports of certain .ini tweaks floating around that are causing infinite loading screens.  This is not related to memory but rather to improper configuration.  Some parameters in both the skyrimpref.ini and the skyrim.ini seem to have been destabilized, rendered obsolete or redundant by the last update.  If you are freezing at loading screens, barter menus, inventory screens etc.,  Here are the steps to follow.\n<br />\n<br />[youtube]cLyvlwmScI4[/youtube]\n<br />(You can visit my [url=http://www.youtube.com/channel/UCju3kgOWra96b1m7V5b9-5A]Youtube Channel[/url], use ctrl+Mousewheel(Not technically fullscreen) or download the guide pack to see the video in full screen)\n<br />[line]\n<br />[color=orange][size=50]4G:Papyrus Debugging:[/size][/color]\n<br />[line]\n<br />[color=yellow][u]This is a fairly advanced, time consuming step.  Papyrus logs are NOT crash logs, type and frequency of error messages should be considered before assuming the worst or reporting issues to authors.[/u][/color]\n<br />\n<br />Ah yes...  The dreaded papyrus logs.  Many people have already posted theirs and it can be problematic for me to troubleshoot because I CANNOT troubleshoot it without physically having your load order.  There are exceptions, some scripts contain their parent mod's name and other issues I've experienced myself.  I thought the easiest way to isolate the issue would be to give you a guide on how to use my method yourself.  First of all, let's get you set up to do this.  \n<br />\n<br />The first step you need to take is adding parameters to both the SKSE.ini(If applicable) and the Skyrim.ini as follows;\n<br />[list][*]Navigate to My Documents/My Games/Skyrim\n<br />[*] Open your skyrim.ini.\n<br />[*]Press control+f and type \"papyrus\" without the quotes.\n<br />[*]If you have no matches, then simply add this entire section to the bottom of the document.\n<br />[*]If there [i]is[/i] a match then edit or create the parameters to match the .ini settings below.\n<br />[/list][quote]  [Papyrus]fPostLoadUpdateTimeMS=500.0bEnableLogging=1\n<br />bEnableTrace=1\n<br />bLoadDebugInformation=1[/quote]\n<br />\n<br />Also in SKSE.ini (assuming you're using The Skyrim Script Extender, which you should be) located in you data/SKSE folder, add the following parameter.\n<br />\n<br />[General]\n<br />ClearInvalidRegistrations=1\n<br />\n<br />If this document doesn't exist;\n<br />[list][*]Open the SKSE folder in your Skyrim Data folder\n<br />[*]Right click inside the open window\n<br />[*]Place your cursor over new, then click \"Text Document\" when the list appears\n<br />[*]Rename the Document to read as follows \"skse.ini\" Without the quotes.\n<br />[*]Open the Document\n<br />[*]Insert the parameter above\n<br />[*]Close and Save\n<br />[*]Play Skyrim until it crashes\n<br />[*]navigate back to the documents/games/skyrim folder.\n<br />[*]Open the\"logs\" folder.\n<br />[*]Open the \"scripts\" folder.  \n<br />[*]Open the Document titled papyrus.0.log\n<br />[*]Continue Reading to get the required utilities.\n<br />[/list][url=http://www.jzip.com/]Jzip:[/url]Jzip is simply a free alternative to winzip, all it is for is creating extracting .zip, .rar, .7zip files etc..  7zip also works but this guide demonstates the technique involved with jzip as the medium.[url=http://skyrim.nexusmods.com/mods/247]BSAopt[/url]This utility is useful for many things.  Step has a guide [url=http://wiki.step-project.com/Guide:BSA_Extraction_and_Optimization]here[/url] that goes into more detail and covers some more advanced features.  The reason you need it is because your scripts may be in a .BSA file (Bethesda Softworks Archive) and BSAopt is the easiest way to open and peruse their file structure.Now that you are all set up, refer to this new video![youtube]ue4N6JgZEOE[/youtube](You can visit my [url=http://www.youtube.com/channel/UCju3kgOWra96b1m7V5b9-5A]Youtube Channel[/url], use ctrl+Mousewheel(Not technically fullscreen) or download the guide pack to see the video in full screen)[line]\n<br />[color=orange][size=50]4H:Testing Saves For Stability;[/size]\n<br />[/color][line]\n<br />Now here is an often overlooked process.  Why?  Because most people just consider running around to be an adequate test.  That is often not sufficient because with the teeming mass of variables that is Skyrim, problems don't present themselves immediately in all cases.  Mind you, these are testing procedures that I've used and support the use of.  None of them are fool proof, but they are vastly superior to running around aimlessly with your fingers crossed!\n<br />\n<br />This is [url=http://skyrim.nexusmods.com/users/41808/?]Vurt's[/url] preferred method, and my personal favorite:\n<br />[list][*]Open up your save, clean(After Helgen with you mod list loaded) or your existing save.\n<br />[*]Shut off all forms of autosave and DO NOT SAVE once the test is in progress.\n<br />[*]Head outside in game if you aren't already.\n<br />[*]Open the console and enter these commands \"player.setav Speedmult 1500\", \"TGM\" and \"TCL\" (TGM is godmode, just in case something goes screwey and you get killed during testing, and TCL turns collision off so you can run through the sky and speedmult should be obvious)\n<br />[*]Fly around the worldspace of Skyrim for at LEAST 5 minutes, Stay within sight of the ground for best results.\n<br />[*]You WILL likely stutter and freeze a bit during this test, you should NOT completely freeze or crash.\n<br />[*]If you crash, then continue reading; if not then you can assume that your save is stable at the moment.\n<br />[/list]Mind you, this test is not a guarantee but it is FAR more likely to irritate existing issues than running around normally.  This is because at those speeds and with the lack of collision restraints, you are loading and unloading textures/meshes/scripts etc. into RAM at a far greater speed that when running about normally.  If you DO crash from this, first try resetting your .inis as outlined in section 4F, saving of course the original .inis in the event that they aren't the issue.  Run the test again, if the issue persists then you will have to consider trimming your load order.  Some notes about trimming your load order, if the issue was persistent in one particular area, look for mods effecting that area.  If it is random and happens regardless of your area on the map, look to either scripts, World Edits or pushing your system too far with HD textures.  Side Note: If this test helped you in ANY way to isolate your issues, run on over to [url=http://skyrim.nexusmods.com/users/41808/?]Vurt's[/url] page and give him a kudos point!  Were it not for him this testing procedure would not be included and if it were it not for his work; I would have long since quit playing Skyrim, thus there would be no Skyrim Project Stability!Alternate method for testing problem areas:[list][*]Create a new save with [i]no plugins[/i] activated.\n<br />[*]Play through the Helgen Intro Sequence.\n<br />[*]Speak to Alvor/Gerdur in Riverwood.\n<br />[*]Go to an interior in Riverwood\n<br />[*]Make a save using the console command save \"Clean Start\".\n<br />[*]Enable the map markers via the console command \"tmm 1\" without the quotes.\n<br />[*]Make a new save via the console command [quote]save 'Test Character\"[/quote]\n<br />[*]Activate any mods, go to problem areas via the \"COC\" command, the \"Player.moveto\" command or simply by fast travelling.[quote]Command Examples;[/quote]\n<br />COC CellID  EG \"COC Whiterun\" no quotes.Player.Moveto Actor's Reference ID who is in the desired cell EG: \"Player.moveto 0001A677\" No Quotes.  That Reference ID Belongs to Balgruuf the Greater in Whiterun.[/list][i]Note: [url=http://www.skyrimsearch.com/]Skyrim Search[/url] is great for all the IDs for all items and creatures in the game.  Also I've heard that Player.moveto is safer.  I've never had any issues with either method.[/i] [color=yellow][u]COC'ing or Moveto'ing from the main menu is NOT a safe testing practice.[/u][/color][*]Remove suspected troublemakers in groups.  When have issues isolated to mods, remove them from your load order prior to starting a play through.\n<br />[*]Always use the \"Test Character\" save to test mods, and the \"Clean Start\" as your beginning for a new play through.  Make sure you weed out your old saves once in a while too.  They are located in my documents/my games/skyrim/saves.  Delete old saves as the accumulate to save some loading time.\n<br />The latter test has been revised by Arthmoor, this is the only safe and effective way to troubleshoot problems.  It is also the easiest way to determine if you are dealing with a save-based, mod-based or configuration based issue.  It also sets you up with a \"startup\" character, which you should keep.  That is unless you've discovered Arthmoor's other popular mod [url=http://skyrim.nexusmods.com/mods/9557/?]Alternate Start-Live Another Life[/url].[line][color=green][Size=75]Section 5: Memory Management;[/size][/color][line][url=http://www.pcwintech.com/cleanmem]Cleanmem:[/url][color=yellow][u]IMPORTANT: Windows 8 UsersWindows 8 has it's own RAM management method that renders that allegedly renders cleanmem ineffective.  If you continue please note that cleanmem may not help you.[/u][/color]\n<br />\n<br />Cleanmem is one of those dreaded memory optimizers you may or may not have heard so much about.  It packs a powerful punch.  It works by lowering the amount of physical RAM used by a program by trimming it's working set.  This will cause a minor skip for some people, it's only for an instant and then it's back to normal and can be further minimized by disabling sound \"Enhancements\" through Windows sound.  The program has be known to eliminate freezing and CTDs, it does not run constantly in the background and it is easy to use.  Ideal situation; you'll never freeze again with this program.\n<br />\n<br />[color=yellow][u]Disclaimer:  There are those who claim this to be a \"placebo\" effect.  Going from a windows standpoint, it has no effect on actual RAM use.  However after 1000+ hours of playing with it enabled, I can verify that it has solved my memory related freezes entirely for me. There are many others who will also advocate the use of the program.[/u][/color]\n<br />\n<br />Once you've installed Cleanmem, refer to this video!\n<br />[youtube]iYzQ24kv6n4[/youtube]\n<br />(You can visit my [url=http://www.youtube.com/channel/UCju3kgOWra96b1m7V5b9-5A]Youtube Channel[/url], use ctrl+Mousewheel(Not technically fullscreen) or download the guide pack to see the video in full screen)\n<br />[line]\n<br />[color=green][size=75]Section 6: Processor Optimization;[/size][/color]\n<br />[line]\n<br />Your CPU/Processor(Central Processing Unit) has a great impact on the performance of Skyrim and any other DirectX 9 applications.  It's good to optimize it for peak performance.  This section will help you unpark your idle cores (multi-core processors only).  It will also show you a nifty tool for further increasing your processor timer speed.  [color=yellow][u]Again, none of this is overclocking.[/u][/color]  All methods here are tested, reversible and will not harm your computer.  All of them could potentially increase stability and performance, not just in Skyrim, but across the board!\n<br />[line]\n<br />[color=orange][size=50]6A: Parked/Idle Processor Cores;[/size]\n<br />[/color][line]\n<br />[url=http://www.coderbag.com/Programming-C/Disable-CPU-Core-Parking-Utility]Disable CPU Core Parking Utility:[/url]\n<br />\n<br />As a power saving feature, Windows 7 will \"park\" cores on multi-core processors.  Mind you, they do unpark in certain situations.  However, CPU intensive situations often occur over a few nanoseconds, which would be fine if Windows could un-park your cores instantaneously, however it cannot.  Unparking your cores indefinitely will increase system stability across the board; it will also boost performance based upon the situation.  [color=yellow][u]However, know that by doing this; you are disabling a power saving feature.  On a desktop this is no problem, however the extra cores may drain your laptop battery faster.[/u][/color]\n<br />\n<br />[youtube]uTeC2wkuduI[/youtube]\n<br />(You can visit my [url=http://www.youtube.com/channel/UCju3kgOWra96b1m7V5b9-5A]Youtube Channel[/url], use ctrl+Mousewheel(Not technically fullscreen) or download the guide pack to see the video in full screen)\n<br />[line]\n<br />[color=orange][size=50]6B: Power Saving Mode/Hybrid Sleep Mode;[/size][/color]\n<br />[line]\n<br />Windows 7 is prepackaged with integrated power saving plans titled \"Balanced\" and \"power Saver\".  This is an obvious one.  You don't [i]want[/i] to be on \"Balanced\" or \"power Saver\" while gaming.  You [i]want[/i]  to be on \"high performance\" mode.  To accomplish this refer to the following video, I would advise everyone take a look as the video also explains how to disable \"Hybrid Sleep Mode.\"\n<br />\n<br />[youtube]Yl7E3c5g870&amp;feature=youtu.be[/youtube]\n<br />(You can visit my [url=http://www.youtube.com/channel/UCju3kgOWra96b1m7V5b9-5A]Youtube Channel[/url], use ctrl+Mousewheel(Not technically fullscreen) or download the guide pack to see the video in full screen)\n<br />[line]\n<br />[color=orange][size=50]6C: CPU Timer Tweak;[/size]\n<br />[/color][line]\n<br />[url=http://www.lucashale.com/timer-resolution/]Timer Resolution:[/url]\n<br />[color=yellow][u](there is a box on the page detailing versions 1 and 2, below that there is a download link for 1.2 which is free and support windows 7.)[/u][/color]\n<br />\n<br />Now furthering upon the subject of processor performance.  There is a nifty program that was brought to my attention called \"Timer Resolution\"; it increases your processor's responsiveness via editing the timer.  It is done in real time and lasts as long as the program is open.  From my experience; it boosted my framerates by 3; all steps in this guide included.  That's nothing to write home about really but, it requires no installation and it is lightweight.  It's also simple to use; drag and drop, open the .exe and press a button and then open skyrim.  Simple, free and a performance increase; why not?  Upon reading why the program was created, it is (based upon my understanding) very similar to the \"Skyrim Background Booster.\"  Many of you may be familiar with that program.  The benefit of this program will most likely vary from person to person; just as it did with the background booster.\n<br />[line]\n<br />[color=green][size=75]Section 7: Support/FAQ;[/size][/color]\n<br />[line]\n<br />[color=orange][size=50]7A: Support;[/size]\n<br />[/color][line]\n<br />Support can now be found exclusively on the discussion topic titled \"HELP?\"  The following questions should be addressed in you first post.  You should include any documentation via a link to [url=http://www.pastebin.com]pastebin[/url] This includes papyrus logs you find relevant, and specifically your load orders.\n<br />\n<br />[list][*]What version of Skyrim are you playing?\n<br />[*]Are you on a legitimate copy?\n<br />[*]Are you using LOOT?\n<br />[*]Are you cleaning you mods with TES5EDIT?\n<br />[*]Did you add any mods around the time your issues started?\n<br />[*]Is the issue random or recurring?\n<br />[/list]Next, lets go over etiquette.  I am not a mind reader, saying \"this doesn't work\" doesn't help anyone.  Also, I'm sick of troubleshooting problems that I've already discussed; so don't just post a book on my comment board.  Look for your answer, and THEN ask away.  I may not be doing any in depth troubleshooting for a while.  This recent renovation of the guide was made in the hopes that ALL of you could benefit.  Even if I can't personally be here to help all of you, I can certainly post a sign pointing the way to the answers you need![line][color=orange][size=50]7B: FAQ;[/size][/color][line]\n<br />[color=red]Q:[/color] Can you provide a viable load order as reference?\n<br />[color=green]A:[/color] No. No one here has a perfect load order.  There are often new updates and Hotfiles to test out so no load order is safe for long! :) \n<br />\n<br />[color=red]Q:[/color] Is Cleanmem functional on Windows XP, 8 etc.?\n<br />[color=green]A:[/color] Not that I'm aware of.  I use windows 7, so I don't honestly know.  Previous posters claim that it does [b]not[/b] help with Windows 8.\n<br />\n<br />[color=red]Q:[/color] Where should I upload my load order/papyrus logs?\n<br />[color=green]A:[/color]They should be included on your post to the \"HELP?\" discussion thread located on this page, under the forums category.  Upload your load orders and whatnot to [url=www.pastebin.com]pastebin[/url] It makes things easier to keep track of.\n<br />\n<br />[color=red]Q:[/color] Do you use, recommend or have experience with the \"Skyrim Save Cleaner?\"\n<br />[color=green]A:[/color] No.  Clean saves are only achieved by the \"New\" button on the main menu screen.\n<br />\n<br />[color=red]Q:[/color] Do you recommend the the use of ENBoost or the ENB binaries supporting memory reducing functionality?\n<br />[color=green]A:[/color] Yes, but I will not troubleshoot any issues related to [url=http://skyrim.nexusmods.com/mods/38649//?]ENB/ENBoost[/url], [url=http://enbdev.com/]ENBs[/url] or any presets you download.\n<br />\n<br />[color=red]Q:[/color] Do you still offer support here?\n<br />[color=green]A:[/color] When time permits, which isn't as often as it used to be.\n<br />[line]\n<br />[color=green][size=75]Section 8: Conclusion;[/size][/color]\n<br />[line]\n<br />I would like to thank you all for your support and endorsements.  Know that I've made this guide for everyone.  The greatest reward you could ever give would be an endorsement, a vote, kudos and/or sharing my work with others.  I wish you luck!\n<br />\n<br />Sincerely,\n<br />GrandBulwark",
  "categoryId": "95",
  "version": "8.1",
  "author": "GrandBulwark",
  "createdUnix": "1361764077",
  "updatedUnix": "1381928867",
  "containsAdultContent": false,
  "uploadedBy": "GrandBulwark",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000066669",
      "name": "Complete Guide Pack",
      "version": "7.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "117701",
      "fileName": "Complete Guide Pack-32363-7-0.rar",
      "uploadedUnix": "1381922617",
      "modVersion": "7.0",
      "virusScanUrl": "https://www.virustotal.com/file/e291468cbb51547b4cf1037695ea738cc15f62994a2fa73590cf4f9e044b2809/analysis/1407757841/",
      "changelogHtml": " Made the guide standalone.  The main download is now fully optional <br/> \n Revised JPG guides to video format <br/> \n Revised \"power saving mode\" section to video format <br/> \n Revised \".ini issues\" to video format  <br/> \n Added links after all videos to my youtube channel <br/> \n Uploaded guides in video format to downloads section <br/> \n Uploaded a .txt file for easy endorsing&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Complete%20Guide%20Pack-32363-7-0.rar?fid=1000066669&ttl=1535808792&ri=8192&rs=8192&setec=01256873f66a63d7acdf52ca750deb73"
    },
    {
      "fileId": "1000066698",
      "name": "Endorsement File",
      "version": "7.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Endorsement File-32363-7-0.rar",
      "uploadedUnix": "1381928867",
      "modVersion": "7.0",
      "virusScanUrl": "https://www.virustotal.com/file/dd59fe505e338d8e94f0d0156bc90a1686b9228aaa43512eaf31aa854ed00f87/analysis/1407757866/",
      "changelogHtml": " Made the guide standalone.  The main download is now fully optional <br/> \n Revised JPG guides to video format <br/> \n Revised \"power saving mode\" section to video format <br/> \n Revised \".ini issues\" to video format  <br/> \n Added links after all videos to my youtube channel <br/> \n Uploaded guides in video format to downloads section <br/> \n Uploaded a .txt file for easy endorsing&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Endorsement%20File-32363-7-0.rar?fid=1000066698&ttl=1535808792&ri=8192&rs=8192&setec=feb79cfbc244ae9a98535ba7d06c2874"
    }
  ]
}