{
  "modId": 32388.0,
  "modName": "Lore Followers",
  "summary": "Adds followers based on the classes from previous Elder Scroll games",
  "descriptionHtml": "This mod adds several followers based on the default classes from previous Elder Scroll games.\r\n\r\nIt is meant to expand on the followers already in game by giving the player interesting options to complement you own character with followers that are recognizable for players of the previous games, and be somewhat clear on their purposes, strengths and weaknesses for players new to the series.\r\n\r\nIt is important to note that followers do not use several skills that the player does, so all the followers focus on what really matters combat wise to give them flavor and so that they fight in different ways. I will try to improve on this over time.\r\n\r\nNone of the followers allow you to change their clothes, this is made for flavor, meaning they will look like I imagine the classes look (as much as possible), you will however be allowed to give them weapons.\r\n\r\nSome followers will only join you when you fulfill certain requisites.\r\nExamples:\r\nDefeating them in a fist fight.\r\nBringing them items.\r\nBeing a certain level.\r\nHaving a certain skill level.\r\netc.\r\n\r\nInitial release completion status and info:\r\n\r\nAcrobat - yes, custom voices are messed up, reverting to vanilla voices and dialogue.\r\n\r\nName: Tehriel Benoch\r\nRace: Bosmer (Wood Elf)\r\nSex: male\r\nLocation: Drunken Huntsman, Witherun\r\n\r\nStrengths:\r\nBlade\r\nBlock\r\nMarksman\r\nSneak\r\n\r\nEither a companion for sneaky characters or ranged support for a warrior type, Tehriel is quite fragile, so avoiding damage is a priority for him. He feels most comfortable with a bow, but will pull a sword and light shield when cornered.\r\n\r\n\r\nAgent - n\r\nArcher - n\r\nAssassin - n\r\nBarbarian - n\r\nBard - n\r\nBattlemage - n\r\nCrusader - n\r\nHealer - n\r\nKnight - n\r\nMage - n\r\nMonk - n\r\nNightblade - n\r\nPilgrim - n\r\nRogue - n\r\nScout - n\r\nSorcerer - n\r\nSpellsword - n\r\nThief - n\r\nWarrior - n\r\nWitch hunter - n\r\n\r\n\r\n\r\n\r\nThe release schedule will be as follows:\r\n\r\nInitial release with only vanilla dialogue and voices.\r\n\r\nSecond release with custom dialogue, no voice acting, this will flesh out the characters quite bit story wise.\r\n\r\nThird release and following ones is where custom voices are added to all the followers, this depends a lot on community contribution.",
  "categoryId": "33",
  "version": "0.1",
  "author": "Irinir",
  "createdUnix": "1361818858",
  "updatedUnix": "1361818858",
  "containsAdultContent": false,
  "uploadedBy": "nokturnum",
  "primaryFile": null,
  "files": []
}