{
  "modId": 32384.0,
  "modName": "Perydon Islands - Skyrim Online Homeland",
  "summary": "This mod aims to add a large collection of islands that are compatible with the Skyrim Online mod. Currently in early alpha.",
  "descriptionHtml": "Created as a response to a new direction Skyrim Online took a few weeks ago, the Perydon Islands aims to serve as the main player hub on both official and private servers once Skyrim Online is in a workable condition.\r\n\r\nThis new direction leaves the power to create in the hands of the players, and leaves the original Skyrim region untouched. If you wish to read more about this system, you can do so here: http://forums.skyrim-online.com/showthread.php?tid=421\r\n\r\nIn essence, this mod aims to create a fully synchronized environment, separate from Skyrim itself with a multitude of areas, quests and player abodes.\r\n\r\nCurrently, a minor starting area is nearing completion. The mod is in a very early alpha stage and is only intended for hardcore fans and people interested in lending a hand. Actual gameplay is not implemented yet, as we\\'re waiting for Skyrim Online to reach a workable stage. In the meantime, the focus will lie on creating and improving the landscape, as well as fleshing out the details of the upcoming scenarioes and quests.\r\n\r\nIf you have feedback or would like to lend a hand, don\\'t hesitate to comment! ",
  "categoryId": "30",
  "version": "0.1",
  "author": "Jargon and Arkansas",
  "createdUnix": "1361813977",
  "updatedUnix": "1361909838",
  "containsAdultContent": false,
  "uploadedBy": "RSN068",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013443",
      "name": "Perydon Islands",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "385",
      "fileName": "Perydon Islands-32384-1-0.rar",
      "uploadedUnix": "1361909838",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/84f505daa140a3e75c7400fd8c014bb78e00af9f8d81f568367c2619afa941ac/analysis/1407441094/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Perydon%20Islands-32384-1-0.rar?fid=1000013443&ttl=1535808836&ri=8192&rs=8192&setec=c919b3b43c6681c906144c837c1809f4"
    }
  ]
}