{
  "modId": 32382.0,
  "modName": "A Touch of Sithis",
  "summary": "A mystery spell straight from the Void which does major damage to all who witness it. Not recommended for \\'serious\\' players or non-adults. Do you dare to experience a touch of Sithis?",
  "descriptionHtml": "[b]NOTE:[/b] The power of this spell is potentially game-breaking so [i]MAKE A CLEAN SAVE BEFORE YOU USE.[/i] I will not be held responsible for any damage to either your brain or your gamesave due to this mod.\r\n\r\nSo I\\'m in the process of completely remaking Morthal into a larger marsh town when my mod becomes corrupted due to changes to the landscape in certain cells. Fed up with the Creation Kit, I made this mod to amuse myself. It is NOT intended to be a serious mod so if you don\\'t like it, don\\'t use it!\r\n\r\nIt adds a spelltome which you should be able to find lying in the water trough near where Adrianne Avenicci lurks. Since it has been known to wander you can also just pickpocket it from Adrianne.\r\n\r\nUse the spelltome and learn this devastating spell, even with a level 1 character. The spell is highly dangerous and not recommended for people who either want a serious style of gameplay or have no sense of humour. It is also not recommended for younger players due to the amount of graphic horror. I warn you that should you dual-cast this spell, twice the horror ensues. Multiple castings will bring the Void itself to Skyrim. Repeated casting is not recommend except for the most twisted of players.\r\nAlso note that if you are using any blood enhancing mods then there will literally be a sea of blood covering whatever area you cast it in. Other mods may also affect the spell in terrifying ways.\r\n\r\nDo you dare to experience Sithis\\' fancies?\r\n\r\nI give you \\'A Touch of Sithis\\'.\r\n\r\nJust doing my good deed for the day.",
  "categoryId": "75",
  "version": "1",
  "author": "Anuiel",
  "createdUnix": "1361838279",
  "updatedUnix": "1361838090",
  "containsAdultContent": true,
  "uploadedBy": "Anuiel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013277",
      "name": "A Touch of Sithis",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "A Touch of Sithis-32382-1.zip",
      "uploadedUnix": "1361838090",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/35f8de9024724e3f4c0d06a23c71e393675cb050da0b2f3a7ee40a4e3c2859e4/analysis/1407439806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Touch%20of%20Sithis-32382-1.zip?fid=1000013277&ttl=1535808834&ri=8192&rs=8192&setec=ddf04c5bfd7f0537450d2f8a9f1ba12a"
    }
  ]
}