{
  "modId": 32386.0,
  "modName": "Race Menu Mod plugin extender",
  "summary": "This is just an extension to Expired\\\\\\\\\\\\\\'s amazing Race Menu Mod found here http://skyrim.nexusmods.com/mods/29624.  This will just add pelvic, thigh, calf, and spine sliders to the body changing part of his mod.  You must have Expired\\\\\\\\\\\\\\'s mod first.",
  "descriptionHtml": "This is just an extension to Expired\\'s amazing Race Menu Mod found here http://skyrim.nexusmods.com/mods/29624.  This will just add pelvic, thigh, calf, and spine sliders to the body changing part of his mod.  You must have Expired\\'s mod first. You must also have the same version of Expired\\'s mod that I have listed, different versions of his mod will not work.  As he continues to update his mod I will do so with this one.\r\n\r\nIf you increase any of the lower body sliders you must decrease another lower body slider or your feet will start to go through the floor.\r\nSuch as if you decide to increase Pelvic to 1.1 you must then decrease either the left/right calfs or the left/right thighs to .9.  All the lower body sliders must equal exactly 3 to keep your feet on the ground, such as L/R Calf\\'s at .6, L/R Thighs 1.1, and Pelvic at 1.3 when you add all three values together they will equal 3.  The values can be whatever you desire as long as the end value is 3.\r\n\r\nThis mod will work with all body meshes, though I am not entirely sure if all of the sliders will work for male characters.\r\n\r\nDirections:\r\nJust copy the contents of this folder to your Skyrim directory. You must replace the old plugin as I have just extended his.\r\n\r\nKnown Issues:\r\n-I know there is a dollar sign in-front of the added sliders, and I am working to correct this.\r\n-There is an issue where sometimes making your legs go through the floor to much will cause you to somewhat start flying but you wont be able to walk on a solid surface.\r\n\r\n\r\nIf there are other sliders you would like me to add just ask when I find the time I will add them,  I only do body part sliders. If you would like to know what sliders are available you can download a program called Nifskope it shows all available sliders with each body mesh.  If you have any questions or concerns feel free to ask in the comments section I or another friendly user will answer your question as quickly as I can.  If you really like this extension please feel free to endorse.",
  "categoryId": "28",
  "version": "1.4.5",
  "author": "Vinncent318",
  "createdUnix": "1361819019",
  "updatedUnix": "1361816823",
  "containsAdultContent": false,
  "uploadedBy": "Vinncent31",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013183",
      "name": "Extended Sliders",
      "version": "1.4.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "11",
      "fileName": "Extended Sliders-32386-1-4-5.rar",
      "uploadedUnix": "1361816823",
      "modVersion": "1.4.5",
      "virusScanUrl": "https://www.virustotal.com/file/01b02d8b927bddb78327fcc372bb1a42519cd4b6fbfc0d76706e047100a5c417/analysis/1407439265/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extended%20Sliders-32386-1-4-5.rar?fid=1000013183&ttl=1535808838&ri=8192&rs=8192&setec=de6c10bc57da12f062f58749dce9e9e6"
    }
  ]
}