{
  "modId": 324.0,
  "modName": "Fully automatic destruction magic",
  "summary": "Provides two customizable keys for automatically casting dual-wielded destruction magic spells - one for rapid fire, and one for chaining dual casts. Can also run Skyrim in a fullscreen window. See version history for full functionality.",
  "descriptionHtml": "This is an Autohotkey script that automates destruction spell casting. Two user definable keys are used, \r\none for successively casting each hand in rapid fire, and another for chaining dual casts. The script \r\ncomes with an ini file where you can change the keys (the defaults are \\\"C\\\" and \\\"X\\\").\r\nThe video in the videos section shows the rapid fire hotkey.\r\n\r\nSince version 1.3, the \\\"use script as shortcut\\\" functionality has been expanded to allow for running Skyrim in a full \r\nscreen window, which is like using fullscreen mode, but lets you alt tab easily, and may improve performance. \r\nTo use it, set your game to run in windowed mode at your monitor\\'s native resolution (Skyrim launcher -> Options). \r\nIf you have provided the path to the executable (including file name) in the script\\'s ini file, then the script will \r\nlaunch Skyrim when run, and make the window fill the whole screen (it removes the title bar and border, and positions \r\nthe window at 0,0). The executable you specify doesn\\'t have to be the game executable, it can also be that of a \r\nprogram that it itself acts as a shortcut/launcher (like the script extender for example).\r\n\r\nSome people have reported having problems sustaining an uninterrupted chain of casts. I\\'m not entirely sure\r\nwhy that happens for them, but I suspect it has to do with performance (frame rate) and input lag. If you download \r\nthe regular version and find that you\\'re affected by this, then you can download the alternative version listed \r\nunder \\\"optional files\\\", and see if that works for you. The casting speed will be slower, but it should work smoothly.\r\n\r\n[color=#ffaf37][b][u]Version history[/u][/b][/color]\r\n\r\nv1.7:\r\n- added new hotkey (Pause/Break) for toggling hotkeys off and on (useful when they interfere with typing - mostly when \r\n  renaming enchanted items)\r\n- fixed a bug that was causing the window borders to remain when loading the game with SKSE\r\n\r\nv1.6:\r\n- made the delay values for auto fire accessible in the ini file\r\n- added new hotkey (Shift+Enter) for updating the autofire keys and delay values from the ini file, while in the game\r\n\r\nv1.5:\r\n- Switched to standard format ini file. The old ini file won\\'t work anymore.\r\n- Added functionality for equipping a spell in both hands by pressing its favorite key only once. \r\nBy default, the favorite keys (the keys from 1 to 8) behave normally, meaning you have to press a key twice to equip \r\nthe spell bound to that key in both hands. By pressing Shift+[numberkey], the script lets you designate that key as a \r\n\\\"spell key\\\", which means that from then on, when you press that key once, the script will send two keystrokes and equip \r\nthe spell in both hands automatically. If you want to revert that key to normal behavior, just press Shift+[numberkey] \r\nagain to toggle it off. The configuration is saved in the ini file when the script exits, and loaded at the next run, \r\nso you don\\'t have to redo everything each time you play the game.\r\nYou can toggle this functionality off and on by pressing Shift+S. You can also reset all the keys to normal \r\nbehavior at once by pressing Shift+Backspace.\r\n\r\nv1.4:\r\n- fixed a bug that sometimes caused the script to think that the console was in the wrong closed/open state\r\n- fixed a bug with the fullscreen window mode, that would sometimes create a black bar at the bottom of the screen;\r\n  this fix relies on the game loading straight to the menu, so delete Data\\\\Video\\\\BGS_Logo.bik if you haven\\'t already\r\n- fixed a bug with alt tabbing back into the game, that would cause the system cursor to be displayed in the game; \r\n  this is a bug with the game that the script mitigates, not a fault of the script\r\n- added a hotkey (Alt+CapsLock) for quickly switching windows between Skyrim and Firefox (if Firefox isn\\'t running, \r\n  it will switch to the desktop instead); this works in both windowed and fullscreen modes\r\n- added a hotkey (Alt+Q) for quickly exiting the game\r\n\r\nv1.3: added support for running Skyrim in a fullscreen window\r\n\r\nv1.2: fixed a bug with window detection\r\n\r\nv1.1:\r\n- added a new key (default \\\"X\\\") for chaining dual casts; incidentally, it can also be used with weapons\r\n- the keys used by the script no longer prevent typing in the console\r\n- the keys are now stored in an ini file, and can be changed there\r\n- the script now closes when Skyrim closes\r\n- if the path to the Skyrim executable (including file name) is present in the ini file, the script will launch \r\n  Skyrim when run, or make its window active if it\\'s already running; this allows the script to be used like a \r\n  shortcut to the game\r\n- included a compiled (executable) version of the script, which doesn\\'t require Autohotkey\r\n  \r\nv1.0: initial version that introduced the rapid fire key.\r\n\r\n[color=#ffaf37][b][u]Instructions:[/u][/b][/color]\r\n\r\nFirst, create a folder anywhere you want to put the script, and unzip the files in that folder. Then:\r\n\r\n1) Edit the ini file to change the keys if the defaults aren\\'t convenient for you; \r\n   see http://www.autohotkey.com/docs/KeyList.htm for a list of keys and mouse buttons that can be used\r\n2) Run the compiled script (\\\"Skyrim_autofire.exe\\\") (it will have an icon in the system tray)\r\n3) Play Skyrim\r\n\r\n[color=#dddddd]----------------------[/color][b][color=#ffff99]OR[/color][/b][color=#dddddd]----------------------[/color]\r\n\r\n1) Download and install/unzip Autohotkey (basic version) if you don\\'t have it already (http://www.autohotkey.com)\r\n2) Edit the ini file to change the keys if the defaults aren\\'t convenient for you; \r\n   see http://www.autohotkey.com/docs/KeyList.htm for a list of keys and mouse buttons that can be used\r\n3) Open the script (\\\"Skyrim_autofire.ahk\\\") with Autohotkey.\r\n4) Play Skyrim",
  "categoryId": "42",
  "version": "1.7",
  "author": "greentea101",
  "createdUnix": "1321447111",
  "updatedUnix": "1328379370",
  "containsAdultContent": false,
  "uploadedBy": "greentea101",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25864",
      "name": "autofire_version_1_7",
      "version": "1.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "244",
      "fileName": "autofire_version_1_7-324.zip",
      "uploadedUnix": "1328379320",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/cbfc88b2fe2fa8cd04b5e5cd2a19598d7b854d3d2a729fae1a8f8a9279e4371c/analysis/1406653568/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/autofire_version_1_7-324.zip?fid=25864&ttl=1535753094&ri=8192&rs=8192&setec=e65427f6d14c7de5576ee3ff280cfbfa"
    },
    {
      "fileId": "25866",
      "name": "autofire_version_1_7a",
      "version": "1.7a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "244",
      "fileName": "autofire_version_1_7a-324.zip",
      "uploadedUnix": "1328379370",
      "modVersion": "1.7a",
      "virusScanUrl": "https://www.virustotal.com/file/c7b719f29ace65e71349e736171f3abffa74bfb71f56179b8fd7f4abc8ab75d7/analysis/1406653570/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/autofire_version_1_7a-324.zip?fid=25866&ttl=1535753095&ri=8192&rs=8192&setec=c3c09a44ed2b4222809ee86c309fbb81"
    }
  ]
}