{
  "modId": 32448.0,
  "modName": "Dynamic Things - Woodpiles and Barrels and More Oh My",
  "summary": "Turn useless &#34;statics&#34; in Skyrim into something useful&#33;\r<br />Turn woodpiles, barrels, crates and hay bales into containers with appropriate contents.\r<br />Drink or bottle mead, water, skooma or blood from mead barrels with spigots.\r<br />Gain experience from training dummies and archery targets.\r<br />And much more . . .",
  "descriptionHtml": "[center]\r<br />[url=http://www.skyrimgems.com/][img]http://i.imgur.com/m24Q6.png[/img][/url]\r<br />&#34;Dynamic Things - Woodpiles and Barrels and More Oh MY&#34; is proud to be featured on GEMS under category 400 - Realism\r<br />\r<br />[size=10][color=yellow][b]Dynamic Things[/b][/color][/size]\r<br />[size=6]Thanks to Brodual for the recent review. It&#39;s an honor.[/size]\r<br />[youtube]MQYfC5LpcK4[/youtube]\r<br />[size=6]My original videos.[/size]\r<br />[youtube]56yZes8uBUg[/youtube][youtube]zr9-Q7EzCwY[/youtube]\r<br />For clarity: The lighting of the campfire shown in the video is a Frostfall feature[/center]\r<br />\r<br />[size=4][color=yellow][b]8/06/2013 - Thanks to a recent review by Brodual, I have gotten back to adding features to this mod. I hope you enjoy the new release.[/b][/color][/size]\r<br />\r<br />vX.XX\r<br />[list]\r<br />[*]Use the CHANGES button above to preview what features are coming in the next release. I add the changes to that tab before the update is released as they get added during mod development&#33;\r<br />[/list]\r<br />v1.40 - POSSIBLE CLEAN SAVE REQUIRED\r<br />[list]\r<br />[*]NEW FEATURE - You can now &#34;destroy&#34; rocks and rock piles using a pickaxe\r<br />[*]NEW FEATURE - If Hearthfire is installed, &#34;destroyed&#34; rocks will yield quarried stone\r<br />[*]Modification - You can now set the amount of training you receive from dummies and targets as a percentage of Vanilla experience\r<br />[*]Addition - MCM Option to allow bushes/trees WITHOUT collision to regrow on cell reset (default is ON)\r<br />[*]Addition - MCM Option to allow trees WITH collision to regrow on cell reset (default is OFF)\r<br />[*]Addition - Support for wood havesting from Skyrim Flora Overhaul - Expanded Diversity\r<br />[*]Notification - Added a notification when a container cannot be made safe because the original container cannot be disabled\r<br />[*]Fix - Significant fix for tree and stump chopping on trees located outside of Skyrim (was a CK bug)\r<br />[*]Fix - Added missing bushes from Dragonborn for harvesting\r<br />[*]Fix - MCM menu option for stumps and logs now works correctly\r<br />[/list]\r<br />v1.36 \r<br />[list]\r<br />[*]Addition - You can now harvest/clear logs from fallen trees found throughout the world by hitting them with a woodcutter&#39;s axe\r<br />[*]Addition - You can now harvest/clear stumps found throughout the world by hitting them with a woodcutter&#39;s axe\r<br />[*]Fix - Changed around some scripting to make them more reliable on slower CPU&#39;s and/or on heavily modded games\r<br />[*]Fix - Bee hives and bird nests now get removed from felled trees\r<br />[/list]\r<br />v1.351\r<br />[list]\r<br />[*]FIX - Quick fix for Acquisitive Soul Gems and Dynamic Safe Containers\r<br />[/list]\r<br />v1.35\r<br />[list]\r<br />[*]NEW FEATURE - Dynamic Safe Containers&#33; Make any container from vanilla, any DLC or any MOD safe for storage simply by adding anything to that container. It will then never respawn. (See video above)\r<br />[*]NEW FEATURE - Added the ability to harvest firewood or deadwood from trees with collision meshes by hitting them with a woodcutter&#39;s axe\r<br />[*]NEW FEATURE - Hit a tree enough times and it will fall over and you will chop it into a woodpile\r<br />[*]NEW FEATURE - Burn woodpiles from felled trees in order to clear land for campsite or home (see video)\r<br />[*]NEW FEATURE - You can harvest firewood/deadwood from driftwood and branch piles by hitting them with a woodcutter&#39;s axe (high concentration along the northern coast)\r<br />[*]Addition - DT now keeps track of all DT safe containers and allows for easy removal of all items from said containers using MCM. Main use is for uninstall\r<br />[*]UPDATE - Changed bush rustling sounds and added several different varieties of sounds\r<br />[*]CHANGE - Rearranged the MCM to take advantage of paging and the new state functionality\r<br />[/list]\r<br />See CHANGES button above for older updates\r<br />\r<br />[size=4][color=yellow][b]Dependencies:[/b][/color][/size]\r<br />Required: Skyrim 1.9.32+\r<br />Required: [url=http://skse.silverlock.org/]SKSE 1.6.16+[/url]\r<br />\r<br />Optional: [url=http://skyrim.nexusmods.com/mods/3863]SKYUI 4.1+[/url] (For MCM menu)\r<br />\r<br />NO DLC’s REQUIRED\r<br />\r<br />[size=4][color=yellow][b]Overview:[/b][/color][/size]\r<br />There you are almost frozen to death and in desperate need of firewood to light a fire when you see your salvation - a freshly chopped pile of firewood in the camp up ahead. But wait the pile is useless&#33; You take your last breath as your blood freezes in your veins. This mod aims to change that by dynamically changing those useless firewood piles into containers of firewood ready for your plundering.\r<br />\r<br />That&#39;s how this mod started anyway. It has now morphed into something more substantial as we attempt to turn some of the useless “junk” in Skyrim into more usable objects. Since its initial release, we now convert woodpiles, barrels, crates, mead kegs, training targets and dummies, hay bales, hanging hagraven taproot pouches and even coal piles. We still have a list of features and tweaks to come but could use your help with some ideas. Join us in the comments.\r<br />\r<br />[size=4][color=yellow][b]Detailed Workings/Features:[/b][/color][/size]\r<br />[b]CLEARING ROCKS AND ROCK PILES (Video Incoming)[/b]\r<br />[list]\r<br />[*]You can now clear rocks and rock piles by hitting them with a pickaxe\r<br />[*]Rocks that can be cleared have a distinct &#34;ping&#34; sound to them that should sound familiar. Rocks with a dull thud sound cannot be removed\r<br />[*]Amount of hits required depend on the size of the rock (MCM option)\r<br />[*]If you have Hearthfire installed, removed rocks will yield Quarried Stone (MCM option)\r<br />[*]Amount of stone received depends on size of rock\r<br />[*]MCM option to undo last rock removal - sometimes removing a rock or rock pile will show a previously hidden unsightly seam\r<br />[*]Rocks do not respawn with cell reset. They are gone forever.\r<br />[/list]\r<br />[b]DYNAMIC SAFE CONTAINERS[/b]\r<br />[list]\r<br />[*]You may now turn ANY container from Vanilla, ANY DLC and ANY mod into a &#34;safe-for-storage&#34; container simply by adding anything to that container&#33;\r<br />[*]Take over any house, cave or fort and make it a player home&#33;\r<br />[*]You will be able to choose to convert the container, not convert the container or to permanently ignore the container\r<br />[*]You should convert ALL containers you use for storage even if you &#34;know&#34; they are safe\r<br />[*]You may easily remove all contents from all remembered containers using MCM - this make moving a breeze\r<br />[*]Sometimes a container cannot be converted because the original container cannot be disabled. You will be notified of such.\r<br />[/list]\r<br />[b]HARVESTING FIREWOOD/DEADWOOD FROM TREES/BUSHES WITH COLLISION[/b]\r<br />[list]\r<br />[*]Hitting a tree with a woodcutter&#39;s axe will yield deadwood/firewood for every three swings of the axe\r<br />[*]Hitting a tree enough times will cause the tree to weaken. Hit it enough and it will fall down (see video).\r<br />[*]Cutting down a tree will yield a rather large pile of wood for the taking\r<br />[*]You can clear you wood piles by taking all the wood or by BURNING them (see video)\r<br />[*]There is a possibility for the tree to house a spider (spriggans as well in a future update)\r<br />[*]Trees with collision do not respawn by default (MCM option)\r<br />[/list]\r<br />[b]HARVESTING FIREWOOD/DEADWOOD FROM TREES/BUSHES WITHOUT COLLISION[/b]\r<br />[list]\r<br />[*]You may now harvest firewood or deadwood if Frostfall is installed from bushes and smaller trees without a collision mesh (the ones you can simply walk through)\r<br />[*]Simply equip a Woodcutter&#39;s Axe from Vanilla or Frostfall and walk into the center of the bush or tree and look around for deadwood.\r<br />[*]You must actively search in the bush by looking around. Standing in the bush will not do it. This is meant to be a realistic endeavor.\r<br />[*]If you are doing it correctly, you will hear the noise of you rustling around in the bush\r<br />[*]Vanilla = One Firewood, Frostfall = 3, 5 or 7 deadwood depending upon size of bush\r<br />[*]If using Frostfall&#39;s Axe Degrading system, your axe will degrade one level per 15 deadwood collected\r<br />[*]Bushes/Trees will disappear after harvest. They will regrow when the cell is reset.\r<br />[*]Here are all the checks done to qualify for searching - player can not be sprinting, player can not be in combat, player must have axe drawn at the ready, you must be IN the bush, you must have your head down &gt;45 degrees where 0=straight ahead and 90=looking at feet and you must be actively looking around the bush\r<br />[*]Trees and bushes without collision respawn with cell reset (MCM option)\r<br />[/list]\r<br />[b]MORE FIREWOOD/DEADWOOD OPTIONS[/b]\r<br />[list]\r<br />[*]You can collect deadwood from driftwood and branch piles by hitting them with a woodcutter&#39;s axe (high concentration along the northern coast)\r<br />[*]BETA - You can now harvest/clear logs from fallen trees found throughout the world by hitting them with a woodcutter&#39;s axe\r<br />[*]BETA - You can now harvest/clear stumps found throughout the world by hitting them with a woodcutter&#39;s axe\r<br />[*]Still tweaking the stumps and logs everyone&#33;\r<br />[/list]\r<br />[b]KEG BARRELS[/b]\r<br />[list]\r<br />[*]All keg barrels found throughout the world are now usable as follows:\r<br />[*]Keg text is color coordinated to preview what will happen when activated (see screenshot)\r<br />[*]If located within an inn or other shop, you will automatically pay the proprietor the appropriate amount for the drink upon activation\r<br />[*]Payment within shops and inns may be bypassed by trying to steal the drink by being in sneak mode (see warning below)\r<br />[*]People of Skyrim take their drinking seriously. Drinking without paying from most kegs (and being noticed) will result in severe penalty and you will be attacked on site&#33; Keep your hands off our mead.\r<br />[*]An exception to the paying rule is if you belong to the faction that owns the keg. For example, drinking from a keg in Jorrvaskr while being a member of The Companions is an expected benefit and can be done freely.\r<br />[*]Kegs can contain Nord Mead, Honningbrew Mead (uncommon), Blackbriar Mead (uncommon) or Blackbriar Mead Private Reserve (very rare)\r<br />[*]If Realistic Needs and Diseases (RND) is installed. Nord Mead kegs have a chance to contain water instead\r<br />[*]Kegs located at bandit camps or bandit lairs have a chance to contain Skooma\r<br />[*]If Dawnguard is installed, bloody kegs contain blood and can quench your hunger (I think I&#39;m going to add this feature to vanilla vampires lairs in a future update too)\r<br />[*]If you have empty bottles in your possession (from Vanilla or RND), you will be presented with the option to bottle whatever is in the keg instead. You can make a pretty penny bottling Private Reserve if you are lucky enough to find such a keg. You can even bottle Skooma or blood&#33;\r<br />[*]Effects gained drinking from kegs will be the same effects as drinking a bottled version of the same liquid. This means that any changes made by mods, will be used by the kegs.\r<br />[/list]\r<br />[b]TRAINING DUMMIES/ARCHERY TARGETS[/b]\r<br />[list]\r<br />[*]We now have advanced functional Training Dummies/Archery Targets. They work as follows:\r<br />[*]Archery Targets and Training Dummies function the same EXCEPT you can&#39;t gain experience with handheld weapons at an archery target\r<br />[*]Whacking at a dummy with sword, dagger, battle axe, war hammer, etc will add experience to the appropriate skill based upon the weapon&#39;s BASE damage. That means hitting it with an Iron Sword will be less beneficial than hitting it with a Daedric Sword.\r<br />[*]For you brawlers, punching a dummy with your fists will increase one-handed. SkyRe and other &#34;unarmed&#34; mods place their perk changes in this tree.\r<br />[*]Using a bow or crossbow on a dummy or target will level your Marksmanship skill according to the BASE damage of the weapon used AND the distance you are from the target. Make a long shot for maximum training effectiveness. Type of arrow used has no effect on experience given - this is how vanilla works.\r<br />[*]Shield-bashing a dummy will raise your Blocking skill\r<br />[*]Torch-bashing a dummy will slightly raise your destruction skill - this is what Vanilla does believe it or not.\r<br />[*]Hitting a dummy or target with any type of spell will raise the school of magic associated with the spell based upon the BASE magicka  cost of the spell. Note: This is not the cost to the player which fluctuates based upon skill and enchantments. It is the base magicka from the CK.\r<br />[*]Streaming spells like flames or sparks work as well as targeted spells like fireball or fury. Area of effect spells like &#34;cloaks&#34; or area heal spells will not provide training. Simply hit the dummy and check if your stats change. (I&#39;ll most likely add some sort of visual effect signifying that training took place in a future update)\r<br />[*]Most schools other than destruction contain timed spells. For example, Fury is a thirty second spell. The dummy or target will be unusable for the duration of the spell and will glow accordingly to indicate such. This prevents spamming and allows for a more natural training progression when using dummies. Experience points are awarded AFTER the spell wears off. If a mod makes a spell duration indefinite, for example making a summoned thrall permanent, the dummy will be unavailable for a five minute time frame.\r<br />[*]Because I used SKSE functions, any weapon or spell from any mod should be recognized by the dummies and targets.\r<br />[*]Amount of training received as a percentage of Vanilla experience can be set through MCM. 100% is default. 10% would train at 1/10th the speed while 1000% would train at 10 times the speed.\r<br />[/list]\r<br />[b]FIREWOOD PILES[/b]\r<br />[list]\r<br />[*]There are four different piles of wood in Skyrim – small, medium, large and huge (hey that’s what the CK called them). The potential firewood count per container is as follows: Small 4-6 pieces, Medium 8-12 pieces, Large 12-18 pieces, Huge 16-24 pieces.\r<br />[*]The Firewood Piles will only accept firewood as an item. They can’t be used as regular storage containers.\r<br />[*]Removing all pieces of firewood from the container will cause the pile to disappear – after all you just took them all&#33;\r<br />[*]Firewood Piles are set to respawn with the cell they are in. Completely harvested firewood piles should reappear upon cell reset (need to confirm)\r<br />[*]Taking wood from an owned pile is considered stealing.\r<br />[/list]\r<br />[b]BARRELS/CRATES[/b]\r<br />[list]\r<br />[*]All those useless static barrels and crates are now containers\r<br />[*]Barrels and crates have &#34;intelligent&#34; contents. If located near a keg, they will contain mead. If located near a cooking pot, they will contain meat or fish. If located near an alchemy table, the will contain alchemical ingredients, otherwise they contain food or misc household stuff. I will add more intelligence over time.\r<br />[*]Taking stuff from an owned barrel or crate is considered stealing.\r<br />[*]All barrels and crates respawn with the cell they are located in\r<br />[/list]\r<br />[size=4][color=yellow][b]Help and Feedback Needed:[/b][/color][/size]\r<br />This is my first mod, so friendly and constructive criticism is welcomed and needed. Does this work as intended for you? What other features would you like to see added? What other items do you think need a similar makeover?\r<br />\r<br />[size=4][color=yellow][b]Compatibility:[/b][/color][/size]\r<br />FULLY compatible with Texture mods like [url=http://skyrim.nexusmods.com/mods/607]HD2K[/url], [url=http://skyrim.nexusmods.com/mods/2146]SHD[/url], etc. Also mesh altering mods like [url=http://skyrim.nexusmods.com/mods/8655]SMIM[/url].\r<br />FULLY compatible with new land masses that use Vanilla or DLC resources like [url=http://www.nexusmods.com/skyrim/mods/37994/]Falskaar[/url], [url=http://www.nexusmods.com/skyrim/mods/25704/]Wyrmstooth[/url], etc.\r<br />Built-in compatibility with [url=http://store.steampowered.com/agecheck/app/211720/]Dawnguard[/url], [url=http://store.steampowered.com/agecheck/app/226880/]Dragonborn[/url], [url=http://store.steampowered.com/app/220760/]Hearthfire[/url], [url=http://www.nexusmods.com/skyrim/mods/11163/]Frostfall[/url], [url=http://www.nexusmods.com/skyrim/mods/26228/]Realistic Needs and Diseases[/url], [url=http://www.nexusmods.com/skyrim/mods/141/]Skyrim Flora Overhaul[/url] AND\r<br />[url=http://skyrim.nexusmods.com/mods/25068]Placeable Statics – Move Anything[/url]\r<br />Otherwise this should be compatible with everything else that doesn&#39;t outright change the &#34;statics&#34; to a non-vanilla form - like Placeable Statics did.\r<br />No vanilla resources were altered or changed in any manner. All functionality is accomplished through safe scripting – as safe as the engine allows anyway.\r<br />\r<br />[size=4][color=yellow][b]Installation:[/b][/color][/size]\r<br />Install in the usual manner using your favorite Mod Manager of choice. I can’t recommend enough the awesome [url=http://skyrim.nexusmods.com/mods/1334]Mod Organizer[/url], but any will do.\r<br />\r<br />[size=4][color=yellow][b]Uninstallation:[/b][/color][/size]\r<br />[list]\r<br />[*]REMOVE ALL STORED ITEMS FROM DYNAMIC THINGS CONTAINERS (if applicable)\r<br />[*]Using the Mod Configuration Menu in SkyUI, disable the mod - if it is missing or you don&#39;t use SkyUI then open the Console (~ key by default) and type &#34;Set wizDynamicThingsEnabled to 0&#34; and hit enter.\r<br />[*]Now change cells – if you are outside, go inside. If you are inside, go outside (failure to do so will result in converted items in the currently loaded cell to disappear permanently upon mod deactivation).\r<br />[*]Save your game (full or quick shouldn&#39;t matter)\r<br />[*]Uninstall in your Mod Manager of choice\r<br />[/list]\r<br />[size=4][color=yellow][b]How to Clean Save:[/b][/color][/size]\r<br />[list]\r<br />[*]Follow the Uninstallation procedures above\r<br />[*]After uninstalling in your mod manager, start the game back up and load your save\r<br />[*]Create a NEW save and close Skyrim\r<br />[*]Re-install with the mod manager of your choosing \r<br />[*]Restart the game and enjoy&#33;\r<br />[/list]\r<br />[size=4][color=yellow][b]Recommended Mods:[/b][/color][/size]\r<br />[url=http://skyrim.nexusmods.com/mods/11163]Frostfall[/url] by Chesko – really the inspiration for needing this mod\r<br />[url=http://skyrim.nexusmods.com/mods/26228]Realistic Needs and Disease[/url] (at least until Last Seed)\r<br />\r<br />[size=4][color=yellow][b]Known Issues/Quirks:[/b][/color][/size]\r<br />[list]\r<br />[*]If in a snowy environment a static with a dusting of snow will get converted to a Dynamic Things container without any snow on it. It’s barely noticeable though.\r<br />[*]You may come across a scattering of firewood on the ground (one such pile is directly outside the blacksmith in Riverwood). These piles are actually used by NPC AI as part of their daily routine. As of yet, I can’t find a way of altering them without breaking them.\r<br />[*]There are two small woodpiles on either side of chopping blocks that aren’t harvestable. They “belong” to the chopping block.\r<br />[*]Statics may flicker slightly when converted to Dynamic Things containers.\r<br />[*]When turning the mod or its features on and off, you may need to leave the current cell before previously replaced items function properly.\r<br />[/list]\r<br />[size=4][color=yellow][b]FAQ:[/b][/color][/size]\r<br />Q. Will this bloat my save game?\r<br />A. Yes and No. We ARE dynamically disabling static items and replacing them with containers and/or activators so each one that gets converted is recorded in your save. But this is no different than dropping a plate or moving a pot so it shouldn&#39;t be a big deal.\r<br />\r<br />Q. Will this break my save?\r<br />A. I have been very careful to prevent this. But as when installing all mods you should make a fresh backup save to keep just in case. If you follow the uninstallation procedures found above, the only “error” you should find in your Skyrim logs is an MCM warning for my mod reported by SkyUI because of the missing configuration page. No other trace&#33;\r<br />\r<br />Q. Are Dynamic Things containers safe for storage?\r<br />A. Yes and no. Because the Skyrim engine does not respawn any container that is placed in the world through script using PlaceAtMe, I had to create my own container respawn mechanism. DT containers will respawn with the rest of the world according to the respawn time game setting. If you wish to make a container safe from respawn, simply place ANY item in that container. You will be advised that the container has been marked safe via a notification and it will never respawn unless you completely empty it at which time it will respawn normally.\r<br />\r<br />Q. There are other mods which do similar things. What makes yours superior?\r<br />A. I wouldn&#39;t say superior per se, but there certainly are some features I implement that I think make mine at least more beneficial.\r<br />[list]\r<br />[*]First all the other mods to my knowledge use the Creation Kit&#39;s find and replace feature, which basically replaces all vanilla forms with the mod&#39;s replacement. This instantly adds all the form changes into your save game&#33; Try loading up Placable Statics and make a save. Your save instantly jumps up 2 megabytes in size and stays that way even if you uninstall the mod - don&#39;t even bother checking your Skyrim log after uninstalling a mod that uses the find and replace feature. Because it replaces the Vanilla forms, it also requires patches for any DLC and mods. The features found in these like-minded mods will not be present in the new locations.\r<br />[*]Secondly load order is irrelevant&#33; If you&#39;ve made it this far in my description, you no doubt have load order handled, but MANY do not - especially in the Steam Workshop. My dynamic static (and activator) replacement will occur regardless of where you place Dynamic Things in your load order. Place me first, place me last and it will simply work. Dynamic replacement is also the main reason why my mod does not require patches to work automatically with other mods.\r<br />[*]Lastly, although I certainly acknowledge a source of inspiration in similar mods out there, I believe I don&#39;t just make identical features to those mods, but instead expand upon them and, in my own mind at least, improve upon them. Look no further than the training dummies.\r<br />[/list]\r<br />\r<br />[size=4][color=yellow][b]Change Log:[/b][/color][/size]\r<br />Use the CHANGES Button near the top of the page\r<br />\r<br />[size=4][color=yellow][b]Translations and Permissions:[/b][/color][/size]\r<br />You have permission to translate this file if uploaded to the Nexus.\r<br />You do not have my permission to upload this file to other sites.\r<br />If I am unreachable via the usual methods in excess of 60 days, fell free to do what you will with me at that time.\r<br />\r<br />[size=4][color=yellow][b]Credits:[/b][/color][/size]\r<br />[list]\r<br />[*]Bethesda for Skyrim and the vision to understand the importance of the modding community\r<br />[*]DarkOne for taking thousands of hours from my life since Morrowind and giving us all a home\r<br />[*]CreationKit.com for all the initial tutorials and documentation\r<br />[*]Awesome mod authors for including their script source files for me to learn even more especially – Chesko (of Frostfall fame), Perseid9 (of Realistic Needs and Diseases fame), LtMattmoo (Camping fame)\r<br />[*]HUGE thanks to [url=http://skyrim.nexusmods.com/users/1888738]B1gBadDaddy[/url] for allowing me to use his scripts from [url=http://skyrim.nexusmods.com/mods/23698]Training Dummies and Targets[/url] as a base for DT Training Dummies and Archery Targets functionality\r<br />[*]And anyone else I may have missed\r<br />[/list]\r<br />-Dominoid",
  "categoryId": "24",
  "version": "1.40",
  "author": "Dominoid",
  "createdUnix": "1361922224",
  "updatedUnix": "1375837028",
  "containsAdultContent": false,
  "uploadedBy": "dominoid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013476",
      "name": "Dynamic Things ",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Dynamic Things -32448-0-9.rar",
      "uploadedUnix": "1361919555",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/7cfa3377deb8dc93a8d798f94539afe98cdc9a45990fc06c82ef118d327037ef/analysis/1407441450/",
      "changelogHtml": " Initial Release&#33; <br/> \n Converts useless firewood piles into containers containing . . . well firewood&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Things%20-32448-0-9.rar?fid=1000013476&ttl=1535808928&ri=8192&rs=8192&setec=0a32238a217a7b25e75a4e254fa58c99"
    },
    {
      "fileId": "1000014156",
      "name": "Dynamic Things",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14",
      "fileName": "Dynamic Things v1-32448-1-0.rar",
      "uploadedUnix": "1362151818",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c3a2c37ba5d0162bb7b1c2f8cd49956b3812cba8df20b6b0257bfda05d14c589/analysis/1407445995/",
      "changelogHtml": " Added Barrels with intelligent contents <br/> \n Added Dynamic Things containers owned when located outside in cities, towns, villages, etc (Containers from v0.9 may remain unowned) <br/> \n Changed default search length to 2000 (up from 500 - existing users will not be changed automatically) and changed max conversion distance allowed from 2000 to 5000. <br/> \n Added built-in support for Placeable Statics - no patch necessary <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Things%20v1-32448-1-0.rar?fid=1000014156&ttl=1535808928&ri=8192&rs=8192&setec=3dcfa90c34a43455a06d516074997d74"
    },
    {
      "fileId": "1000014481",
      "name": "Dynamic Things",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14",
      "fileName": "Dynamic Things-32448-1-01.rar",
      "uploadedUnix": "1362252722",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/b2801dc17ca191f8a86c975abd7f8ef6c7d4a7267c59e2509eaf9d40747fb654/analysis/1407448508/",
      "changelogHtml": " Greater compatibility with other mods that may MOVE vanilla objects around <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Things-32448-1-01.rar?fid=1000014481&ttl=1535808929&ri=8192&rs=8192&setec=5a3440e3e292dd308c390ed839338a45"
    },
    {
      "fileId": "1000015567",
      "name": "Dynamic Things",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "21",
      "fileName": "Dynamic Things-32448-1-1.rar",
      "uploadedUnix": "1362613995",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/edffb77b8009358a1e3ccff9459dfbdba3add9c9e272bb4dc2b292101bd90200/analysis/1407456409/",
      "changelogHtml": " Crates, crates and . . . oh ya crates&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Things-32448-1-1.rar?fid=1000015567&ttl=1535808929&ri=8192&rs=8192&setec=fa26f33d60fa2b7d7037ebdb15cc8085"
    },
    {
      "fileId": "1000016810",
      "name": "Dynamic Things",
      "version": "1.15",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "45",
      "fileName": "Dynamic Things-32448-1-15.rar",
      "uploadedUnix": "1363048790",
      "modVersion": "1.15",
      "virusScanUrl": "https://www.virustotal.com/file/14a4844f9d1cd0ba5df139aa2a719c8fdec04f092a23e65ba057f3341c074fb5/analysis/1407465216/",
      "changelogHtml": " Probable fix for missing Mod Configuration Menu <br/> \n Dynamic Hay Bales <br/> \n Dynamic Hanging Hagraven Taproot Pouches <br/> \n Dynamic Smelter Coal Piles <br/> \n Made check for adding contents to woodpiles and hay bales by the player only - should increase compatibility and eliminate possible message spamming <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Things-32448-1-15.rar?fid=1000016810&ttl=1535808930&ri=8192&rs=8192&setec=c4e1909909e2c7f1f86e8a2d0963e748"
    },
    {
      "fileId": "1000018290",
      "name": "Dynamic Things",
      "version": "1.20",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "66",
      "fileName": "Dynamic Things-32448-1-20.rar",
      "uploadedUnix": "1363551376",
      "modVersion": "1.20",
      "virusScanUrl": "https://www.virustotal.com/file/dd79e22ec923ba7f83c7b9123c917c3b04f28ed1400c05eba21d405b1df7f7d2/analysis/1407474550/",
      "changelogHtml": " Keg Barrels (the small ones with the spigot) are now usable. Drink from or bottle mead, water, Skooma and even blood. Many features - see full description <br/> \n Training Dummies and Archery Targets actually train you&#33; You can train all schools of magic, one-handed, two-handed, marksmanship and blocking. See full description for details.   <br/> \n Added support in Solitude and Windhelm to better handle \"enable parent\" statics. These are things that get altered when the Civil War stuff heats up or even those traveling Khajiit caravans among other things. I will do other areas next update <br/> \n HUGE thanks to B1gBadDaddy for allowing me to use his scripts from Training Dummies and Targets as a base for DT Training Dummies and Archery Targets functionality <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Things-32448-1-20.rar?fid=1000018290&ttl=1535808930&ri=8192&rs=8192&setec=6398bc8deb2458cf5162e56124c5ec66"
    },
    {
      "fileId": "1000020234",
      "name": "Dynamic Things",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "193",
      "fileName": "Dynamic Things-32448-1-3.rar",
      "uploadedUnix": "1364259050",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/87afbca90288e241bb39c91063463d30d1a32643b8794592eeb83815bb8024b0/analysis/1407488705/",
      "changelogHtml": " Fix - MCM setting for Crates and Misc items were cross linked and not functioning correctly <br/> \n Fix - Objects remaining (such as smelter shovel) after being moved by Placeable Statics <br/> \n Fix - Compatibility checks now run upon mod installation in addition to with each save load <br/> \n Fix - Followers no longer get angry and attack when witnessing you \"steal\" a drink from a mead keg <br/> \n Addition - Mead keg text now color coordinated to preview what will happen when activated (see screenshot) <br/> \n Fix - Unarmed attacks on training dummies now gives proper XP increase <br/> \n Addition - If RND is installed, barrels and crates will contain RND stale food instead of fresh food when appropriate <br/> \n Addition - Created own respawn system for Dynamic Things containers to overcome the fact that containers placed via script using PlaceAtMe will never respawn via the Skyrim engine. <br/> \n Addition - Added a method to make any Dynamic Things container \"safe\" from my custom respawn script. Simply add ANY item to the container. You will be advised that the container is now safe via a notification. <br/> \n Addition - If Frostfall is installed, woodpiles will contain a random amount of deadwood as well as firewood <br/> \n BETA Addition - Harvest Firewood/Deadwood from bushes and small trees without collision meshes. See description for full instructions/information. <br/> \n Fix - Object with \"enabled parents\" will now properly be removed with their parent state. For example: Khajiit caravan crates and barrels. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Things-32448-1-3.rar?fid=1000020234&ttl=1535808930&ri=8192&rs=8192&setec=3916ac52bb5da51eee77a78132539cc3"
    },
    {
      "fileId": "1000021783",
      "name": "Dynamic Things",
      "version": "1.35",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1639",
      "fileName": "Dynamic Things-32448-1-35.rar",
      "uploadedUnix": "1364853564",
      "modVersion": "1.35",
      "virusScanUrl": "https://www.virustotal.com/file/b2797f2f09f428828d51cb9d3f07a03eaea471aa3b1be5414a858ed1e45e6c42/analysis/1407500584/",
      "changelogHtml": " Fix - Missed some training dummy forms from Placeable Statics <br/> \n Addition - DT now keeps track of all DT safe containers and allows for easy removal of all items from said containers using MCM. Main use is for uninstall. <br/> \n NEW FEATURE - Dynamic Safe Containers&#33; Make any container from vanilla, any DLC or any MOD safe for storage simply by adding anything to that container. It will then never respawn. <br/> \n UPDATE - Changed bush rustling sounds and added several different varieties of sounds <br/> \n NEW FEATURE - Added the ability to harvest firewood or deadwood from trees with collision meshes by hitting them with a woodcutter&#39;s axe <br/> \n NEW FEATURE - Hit a tree enough times and it will fall over and you will chop it into a woodpile <br/> \n NEW FEATURE - Burn woodpiles from felled trees in order to clear land for campsite or home <br/> \n Change - Rearranged the MCM to take advantage of paging and the new state functionality <br/> \n NEW FEATURE - You can now harvest wood/deadwood from \"driftwood\" and \"branch piles\" by hitting them with a woodcutter&#39;s axe 5 times <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Things-32448-1-35.rar?fid=1000021783&ttl=1535808931&ri=8192&rs=8192&setec=c4dcaefbd65fd47d5505527163928203"
    },
    {
      "fileId": "1000021798",
      "name": "Dynamic Things",
      "version": "1.351",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1662",
      "fileName": "Dynamic Things-32448-1-351.rar",
      "uploadedUnix": "1364860834",
      "modVersion": "1.351",
      "virusScanUrl": "https://www.virustotal.com/file/1b6647ab2cde427c47e5e31b80cfc33a0b0880e25a22ba7dcfbea2a65785b81f/analysis/1407500653/",
      "changelogHtml": " FIX - Quick fix for Acquisitive Soul Gems and Dynamic Safe Containers <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Things-32448-1-351.rar?fid=1000021798&ttl=1535808931&ri=8192&rs=8192&setec=69979c4f21190976b0214d4b1b4928ba"
    },
    {
      "fileId": "1000022214",
      "name": "Dynamic Things",
      "version": "1.36",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1646",
      "fileName": "Dynamic Things-32448-1-36.rar",
      "uploadedUnix": "1365027058",
      "modVersion": "1.36",
      "virusScanUrl": "https://www.virustotal.com/file/c43c616ea768f2edbe832e65284c21b13225e668c07ebb619c40677bed03297d/analysis/1407504367/",
      "changelogHtml": " Fix - Changed around some scripting to make them more reliable on slower CPU&#39;s and/or on heavily modded games <br/> \n Fix - Bee hives and bird nests now get removed from felled trees <br/> \n Addition - You can now harvest/clear stumps found throughout the world by hitting them with a woodcutter&#39;s axe  <br/> \n Addition - You can now harvest/clear logs from fallen trees found throughout the world by hitting them with a woodcutter&#39;s axe  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Things-32448-1-36.rar?fid=1000022214&ttl=1535808932&ri=8192&rs=8192&setec=4ec1fb65b82dc720e6c27476cf44a253"
    },
    {
      "fileId": "1000044820",
      "name": "Dynamic Things",
      "version": "1.40",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1792",
      "fileName": "Dynamic Things-32448-1-40.rar",
      "uploadedUnix": "1375837028",
      "modVersion": "1.40",
      "virusScanUrl": "https://www.virustotal.com/file/20acee7a8f90b87d1320d34d41c924e46623feb56b6f4b6b848c261e5868dceb/analysis/1407672243/",
      "changelogHtml": " Fix - MCM menu option for stumps and logs now works correctly <br/> \n Notification - Added a  notification when a container cannot be made \"safe\" because the original container cannot be disabled <br/> \n Addition - You can now set the amount of training you receive from dummies and targets as a percentage of Vanilla experience <br/> \n Addition - You can now \"destroy\" rocks using a pickaxe. <br/> \n Addition - If Hearthfire is installed, \"destroyed\" rocks will yield quarried stone. <br/> \n Fix - Made adjustments to MCM option of enabling/disabling mod for better stability <br/> \n Addition - Added the ability to undo the last rock \"destruction\". Sometimes destroying rocks can reveal an unsightly previously hidden seam. <br/> \n Addition - Support for wood havesting from Skyrim Flora Overhaul - Expanded Diversity <br/> \n Addition - MCM Option to allow bushes/trees WITHOUT collision to regrow on cell reset (default is ON) <br/> \n Addition - MCM Option to allow trees WITH collision to regrow on cell reset (default is OFF) <br/> \n Fix - Significant fix for tree and stump chopping on trees located outside of Skyrim (was a CK bug) <br/> \n Fix - Added missing bushes from Dragonborn for harvesting <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Things-32448-1-40.rar?fid=1000044820&ttl=1535808933&ri=8192&rs=8192&setec=785a5dcb10fc37e9399d390c405a6bca"
    }
  ]
}