{
  "modId": 32456.0,
  "modName": "The Warren - Whiterun",
  "summary": "The Warren.\r<br /> A modest player home deep under the Skyforge with tunnel exits to Whiterun and outside to the east and west.",
  "descriptionHtml": "[size=6][color=lightblue]The Warren.[/color][/size]\r<br />\r<br />[color=orange]*** Please read my sticky post in the comments section before you update.***[/color]\r<br />\r<br /> I have created a modest player home situated deep under the Skyforge in Whiterun.\r<br />The main entrance in Whiterun is through a door up on the bank behind the statue of Talos. The key is under the bench by the door. \r<br />Tunnels lead to the home and also to trapdoors on the east and west sides of Whiterun. I have found it tedious always having to run around to the main gate when approaching from the northern side.\r<br />\r<br /> The home consists of four rooms:-\r<br />A living-room with cooking, enchanting and alchemy facilities.\r<br />A work-room with anvil, armor workbench, sharpening wheel, tanning rack and wood chopping block. There are some barrels and storage.\r<br />One bedroom with single beds for four followers.\r<br />The master bedroom with a double bed, storage and bookcase.\r<br /> I wanted to keep it relatively simple, so have not included mannequins and weapon racks which I tend not to use anyway.\r<br />\r<br /> I have given &#39;The Warren&#39; a fairly dark lighting scheme as it is all under ground and therefore has no external ambient light, although you can find your way around without a torch or lantern.\r<br />Screen shots were taken using ELFX and COT.\r<br /> Please let me know if it is too dark for your settings and I will try to help.\r<br />\r<br /> As far as I can tell this mod should only be incompatible with mods that change Whiterun in the areas where I have added structures. Again, let me know if you find any issues.\r<br /> No other mods or DLCs are needed.\r<br /> I use SKSE in game and have not tested without it.\r<br />Cleaned with TES5Edit.\r<br />\r<br />  To Install use NMM or download manually and copy &#39;TheWarren.esp&#39; to your Skyrim/Data folder.\r<br />   Don&#39;t forget to activate the mod in NMM or in your game launcher&#33;\r<br />  To Uninstall use NMM or delete &#39;TheWarren.esp&#39; from your Skyrim/Data folder.\r<br />\r<br />This is my first attempt at a mod so please be forgiving of any problems. I hope you enjoy it.\r<br />Don&#39;t forget to come back and endorse if you do&#33;\r<br />\r<br />Thanks for looking&#33;\r<br />Thanks also to Bethesda for Skyrim and the Creation Kit, and Nexus for a fantastic site.",
  "categoryId": "67",
  "version": "1.01",
  "author": "Skyrabbit",
  "createdUnix": "1362951022",
  "updatedUnix": "1379361745",
  "containsAdultContent": false,
  "uploadedBy": "Skyrabbit",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000055938",
      "name": "TheWarren",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4524",
      "fileName": "TheWarren-32456-1-01.rar",
      "uploadedUnix": "1379361745",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/3ebeb4831e47e451c5b491f719d826745f5b8d7ae200ce209c9c1f2705c9ef1f/analysis/1407725407/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheWarren-32456-1-01.rar?fid=1000055938&ttl=1535808944&ri=8192&rs=8192&setec=9433d1973fbce6e8bf4f91aec6b4ecf6"
    }
  ]
}