{
  "modId": 32466.0,
  "modName": "Scimitar Replacer Glowing Text",
  "summary": "Scimitar Replacer with glowing embossed \\\"Arabic and Greek-like\\\" text in Red, Green and Blue",
  "descriptionHtml": "Hi guys! I’m playing a Redguard warrior-assassin on Master Difficulty and it sucked when the challenging factor went away once I crafted and wielded a pair of Daedric Swords with almost maxed-out One-handed, Enchanting and Smithing skills. To level the playing field once again, I returned to my character’s cultural roots by using Scimitars. However, a Scimitar looks bland even with enchantments whipped onto it. Downloaded a few of graphic mods here in Skyrim Nexus but by visual appetite still wasn’t satisfied. Subsequently, I created my own. Not my first graphic mod but the first one to be shared online. Thought you guys might like.\r\n\r\nAnyway, my favorite is the Greek Red version because of the crisper impressions on the metal (similar to LOTR’s Ring of Power). And, it looks awesome with Daedric Armor equipped. However, if you want to be more authentic, go for the Arabic versions. In addition, the Button on the Pommel is a modified Redguard Crest (might be too small to discern its features). BTW, this was inspired by RavenCane’s Scimitar with Runes. Also, I’m using the Enchantments Upgraded mod of Aetherius that’s why there are spectacular glows on the weapons. Kudos to Aetherius for such an awesome mod!\r\n\r\nLastly, I don’t speak or write in Arabic or Greek, I just typed the text normally. Transcribed (not translated), it says, without spaces and in lowercase, “A Hammerfell Warrior’s Curved Sword” (holds guards’ comment on the Alik’r).\r\n\r\nInstallation:\r\n\r\nThe Scimitar Pack contains all versions (Arabic & Greek in Red, Green and Blue). Just extract the one version you want to use to your Skyrim Data directory, similar to what you do to other mods of this type.\r\n\r\nEnjoy!\r\n",
  "categoryId": "55",
  "version": "1.0",
  "author": "19wEEdmAstEr25",
  "createdUnix": "1361941115",
  "updatedUnix": "1361939746",
  "containsAdultContent": false,
  "uploadedBy": "19wEEdmAstEr25",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013543",
      "name": "ScimitarPackArabicGreekRGB",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1795",
      "fileName": "ScimitarPackArabicGreekRGB-32466-1-0.zip",
      "uploadedUnix": "1361939746",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b69f05a18bd327a0f23a0efa5a8c6704a95e31565147292ab34f0f2a67e63ed0/analysis/1407441913/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ScimitarPackArabicGreekRGB-32466-1-0.zip?fid=1000013543&ttl=1535808961&ri=8192&rs=8192&setec=249dfd59125ef623f4e5b4fdf910b3fd"
    }
  ]
}