{
  "modId": 32465.0,
  "modName": "Skyrim Ultimate Character Builder Bat all in One",
  "summary": "This is a small set of Batch Files to make an Ultimate Character. Its Ultimate but not Overrated.\r\nJust choose yourself what you like, and build your own charcter. No overrated Perk stats like 10000 Archery or 500 Smithing. Just normal Maxed out Stats. No corrupt Scripting in Savegames no Corrupting Files.\r\nTry it yourself",
  "descriptionHtml": "[center]First of all I want to say that this is in first Reason for People who have finished Skyrim in a normal Playthrough without any Cheats or Godmode. I have finished Skyrim several times without any Cheat or God mode too. But after a while i felt using this. So if you dont like Cheating or dont feel like using God mode than this is not for you and you should quit reading now and look for something else. This Mod is posted in the Cheat section cause I think this is what the mod does.\r\nThis Mod is a Cheat Bat and will give you the Ultimate Character in Skyrim. You can use it just at the Start at Skyrim or just in the middle of the Game. Whenever you feel your Character is Weak and you are getting sick of dying or always have to watch for your carryweight or getting low on stamina and magicka, then this is for you. Even all the Werewolf Perks and Skills can be maxed out and the Vampire Lord Perks and Skills too + some unorganized Perks can be added too.\r\nYou can choose up to 5 different Modifications. Each one is a standalone and you can also combine all of them together to use them at the same time. \r\nPlease also read the other INFO FILES for further details.\r\nIf you dont like the Stats or think that the Values are too high so dont use it and dont comment it that the Values are too high. This is Cheat and Gode mode Section so of course you will have God Stats.\r\n\r\nMy favorite one is of course the HXP File.\r\nJust open the Console and then type in: \r\n\r\nbat hxp\r\n\r\n[heading]This will give you [/heading]\r\n\r\n999999 Gold\r\n999999 Health\r\n999999 Magicka\r\n999999 Stamina\r\n999999 Carryweight\r\nRemoved Cooldown for all Shouts ( No more waiting for Shouts to Recover ) Instant Shouting enabled\r\nKillmove chance is set to 100 so you will see a lot more cinematic kills\r\nThe Daedric Armor Set with Daedric Weapons so you have something to dress more than Prisoner Clothes.\r\n\r\nCharacter will be set to Level 81 cause Level 81 is necessary to start some Quests ( for example the Ebony Warrior Quest from the Dragonborn DLC )\r\n\r\nAll Perks and Skills will be at the Maximum State\r\n\r\nAll Ingots 1000 each\r\nDiamonds and Ametyhst and all other Gems ( I didnt add the Flawless ones )\r\nDaedra Hearts 1000\r\nDragonsouls 300\r\nTorches 50 ( I didnt add more cause I hate these things - LOL )\r\nBlack Soul Gems Full 1000\r\nDragon Scales and Dragon Bones 1000\r\nFirewood 1000 ( Always was low on it when needed for Crafting )\r\nCow Hide 1000 ( For Crafitng Leather and Leather Strips )\r\nI didnt add Leather and Strips theirselves cause we dont want to make things to easy - LOL\r\nLockpicks 100 ( you will never use so many since they will never break again )\r\nDaedra Arrows 1000\r\nAzuras Star 10\r\nAzuras Black Star 10\r\n\r\nand some other things that you could use for a Ultimate Start, or whenever you need to.\r\n\r\nI just use this in Helgen Keep just shortly after starting a new Game and you have to escape Helgen and make your way to Riverwood.\r\n\r\n\r\nThis should be compatible with all mods and all DLCs or even without any DLCs. Since I did not add any Items that need any DLC. \r\nI am using over 200 + Mods and still no conflict.\r\nI am just tired of typing in all the console commands again and again. Everytime I start a new Game to build up my Character again. Or even if some Savefiles get corrupt of using and testing a lot of Mods. I know you can still clean those Savfiles but this still does not work 100 % and the best way for now is still to start a new clean save from a new clean game.\r\n\r\nFirst I was using Phinix Skybuilder but unfortunetaly it stopped working for me and I cannot use it anymore. But i still recommend his Great Work as good alternative for this one since it has a visual Interface and just looks cool. But there where still some things missing for me and thats why I had to make this Mod by myself.\r\n\r\nJust 3 letters in the Console and Boom you are Ultimate.\r\nThis took me a couple of hours to put all this togther. Just searched the Internet for Console Commands to make this so I own no rights for this. \r\n\r\nPLEASE TAKE A SMALL MOMENT TO ENDORSE THIS MOD !\r\n\r\nIt Was a long Night after a Hard days work.\r\n\r\n\r\nCREDITS GO TO THE ELDER SCORLLS WIKIA HOMEPAGE FOR RELEASING THE CONSOLE COMMANDS FOR THE PUBLIC USE !\r\n\r\nCREDITS GO TO BETHESDA GAMES FOR MAKING THIS AWESOME GAME\r\n\r\nCREDITS GO TO NEXUS NETWORKS FOR LETTING US ALL SHARE THIS AMAZING THINGS !\r\n\r\n\r\nTHANKS TO ALL OF YOU !!!\r\n[line]\r\nHXP[/center]",
  "categoryId": "40",
  "version": "Final",
  "author": "HXP",
  "createdUnix": "1361938770",
  "updatedUnix": "1361936977",
  "containsAdultContent": false,
  "uploadedBy": "HXP",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013539",
      "name": "Ultimate Skyrim  Character building HXP",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Ultimate Skyrim  Character building HXP-32465-v1.rar",
      "uploadedUnix": "1361936977",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/3c2c3daf0d1c32e9ee7e5825845188ebe73d34d7648e2bc8f67710ba9d94513b/analysis/1407441905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ultimate%20Skyrim%20%20Character%20building%20HXP-32465-v1.rar?fid=1000013539&ttl=1535808960&ri=8192&rs=8192&setec=d7759fad12cbfefc56b95b836e7623c8"
    }
  ]
}