{
  "modId": 32517.0,
  "modName": "BPSF - Barons Plus Size Females",
  "summary": "Adds actual weight to female bodies - thin to chubby to fat. Nude body replacer. Vanilla armor compatibility in the works.",
  "descriptionHtml": "[color=green]>Introduction[/color]\r\n\r\nBPSF is a nude body replacer for the female body in Skyrim. It is a modified version of [url=http://skyrim.nexusmods.com/mods/9510]RBBB[/url], which in turn is a modified version of [url=http://skyrim.nexusmods.com/mods/4888]CHSBHC[/url].\r\n\r\nIt adds actual weight to female characters using the standard weight slider, giving you the option of a slim (0 weight), chubby (50 weight) or overweight (100 weight) female. It is compatible with all vanilla and DLC armor, meaning all characters you see in the world will also be affected.\r\n\r\n[color=green]>Changes[/color]\r\n\r\nThe body is a modified [url=http://skyrim.nexusmods.com/mods/9510]RBBB[/url] model, slimmed down to more realistic levels. While the RBBB size body is appealing, the breast physics are tough to control, the thicker parts clip through all sorts of things, and stretching vanilla armor to fit is a nightmare and doesn\\'t ever come out very well.\r\n\r\nBPSF seeks to give players the ability to play a plus size female, while keeping their character at a more realistic weight.\r\n\r\nSpecifically, weight was significantly dropped all around. Model weight was reduced roughly 30%. Breasts and butt were reduced in size to be more in line with the rest of the body. Belly was increased in size slightly.\r\n\r\n[color=green]>Requirements[/color]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/4888]CHSBHC[/url] must be installed, as it is the 0 weight model for this body. You can go without, but anything nude and 1-99 weight will look a little misshapen.\r\n\r\n[color=green]>Installing[/color]\r\n\r\nYou have two methods to install BPSF:\r\n\r\n1) Automatic install with Mod Manager. This is the easiest - simply click \\\"Install with Manager\\\" above and all the work is done for you!\r\n\r\n2) Manual install by extracting all the files contained in the .rar file straight to your Skyrim directory. This, however, will overwrite all existing body and armor replacers, so back ups are a good idea.\r\n\r\n[color=green]>Armor Compatibility[/color]\r\n\r\n",
  "categoryId": "29",
  "version": "0.1",
  "author": "Baron Von Clop",
  "createdUnix": "1362044512",
  "updatedUnix": "1362044512",
  "containsAdultContent": true,
  "uploadedBy": "baronvonclop",
  "primaryFile": null,
  "files": []
}