{
  "modId": 32532.0,
  "modName": "Isle Of The Falendrue",
  "summary": "Adds a new island, New Race, New Armors, New Enemies, and more.",
  "descriptionHtml": "This is a work in progress!!\r\n\r\nIsle of The Falendrue!- \r\n\r\n\\\" He is the god of destruction, he is our father, all others can not stand to him. \r\nWe are his children, he grants us the ability to destroy, though our choice, we do not. \r\nWe shall not defy him, our father. To come out victorious is his one rule. We will succeed so long as we follow in his steps. Mehrunes Dagon. \\\" \r\n--Chant carried down by the Falendrue. \r\n\r\n------------Lore------------ \r\n\\\" Isle of Falendrue \\\" features a new race; The Falendrue (Also known as the \\'Dirt Dwellers\\'. They live on a dark, damp island that\\'s name is not known to any other race other than their own. Due to their paranoia of other races, the Falendrue do not share customs or culture with other races. Nor do they even interact with them. They live on their island in seclusion, living in small homes burrowed underground beneath the dunes. \r\n\r\nThey worship Mehrunes Dagon, not to be cofused with that of the Mythic Dawn. They see him as a symbol of power, and confidence rather than a Daedric Lord. The Falendrue believe that the coming of Mehrunes Dagon that happened during the 3rd era due to the Mythic Dawn\\'s meddlings was a great event, and thought that Mehrunes Dagon\\'s appearance would convince all the other races of just how powerful he was, and are therefor shunned by most races for it. Especially the Imperials. Most races ( that know of the Falendrue ) also blame them for the Oblivion Crisis. Due to their love for Mehrunes Dagon, they specialize in Destruction and Conjuration. Though most no longer favor Conjuration due to the once great temple \\' Talinvazur \\' that mysteriously raised millions of dead, leaving its surroundings dank, and inhospitable plagued with the undead. There is said to be Falendrue who have been corrupted by the Talinvazur when entering it. \r\n\r\n---------------------------------------------------------------------------------- \r\nLatest Features: \r\n\r\n- New playable race, the \\\" Falendrue \\\". \r\n\r\n- New island, home of the Falendrue. \r\n\r\n- New Armors, and Weapons made specifically for the Falendrue. \r\n\r\n- Enemies; Raiders(Bandits), Sabrecats, Draugr, Skeletons, Giants, Corrupted Shades, and Corrupted Falendrue. \r\n\r\n- You can now enter the ship you traveled in, and can sleep, cook, forge, tamper, and use a tanning rack under deck. \r\n\r\n----------------------------------------------------------------------------------- \r\nHow to get to the Isle: \r\n\r\nUpdate: \r\nThere is now a ship at Solitude, across from the docks, underneath the giant stone arch that holds the Blue Palace. This should make it compatable with other mods. ( I don\\'t think there are any mods that edit the area across from Solitude\\'s Docks. ) \r\n------------------------------------------------------------------------------------- \r\n\r\nWhat\\'s to come!;\r\n\r\n- Storyline\r\n- Quests\r\n- Followers\r\n- Marriage Options\r\n- Dungeons\r\n- Player Homes\r\n",
  "categoryId": "30",
  "version": "3.5",
  "author": "SemprusGalligan",
  "createdUnix": "1362067908",
  "updatedUnix": "1362075480",
  "containsAdultContent": false,
  "uploadedBy": "SemprusGalligan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013937",
      "name": "Falendrue Isle -Update-",
      "version": "3.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13959",
      "fileName": "Falendrue Isle -Update--32532-3-5.rar",
      "uploadedUnix": "1362075480",
      "modVersion": "3.5",
      "virusScanUrl": "https://www.virustotal.com/file/7183a845fd44d045a2d98cd811ecdae05627de4755c74608a313dd7085c9a083/analysis/1407444332/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Falendrue%20Isle%20-Update--32532-3-5.rar?fid=1000013937&ttl=1535809067&ri=8192&rs=8192&setec=404975deef161096fa17b469e083883d"
    }
  ]
}