{
  "modId": 32543.0,
  "modName": "Quenya - Full of Life and Dread - A Standalone Companion",
  "summary": "This mod adds two Dunmer followers to the game. They are of the same person but from different part of a story I created. Both have their own unique appearance and combat style which compliment their personality.",
  "descriptionHtml": "** NEWS : I\\'m sorry to say this file will no longer be supported by me. I am quite busy nowadays and have not much time to game. Thanks for your understanding and thank you all for downloading this mod! :) --feenixfly **\r\n\r\n[IMG]http://i33.photobucket.com/albums/d93/evenstar15/banner_translucent_zps4a7d7867.png[/IMG]\r\n\r\nThis is a my first ever mod. I\\'m still in the learning process so any advice is appreciated! Please feel free to report any problems you might find in the comments section. \r\n\r\n*This is a mod which adds Quenya, a standalone (no mods required!) Dunmer follower to your game. Although don\\'t let the description \\\"1 companion. 2 personalities\\\" fool you. This is simply a standard follower mod which comes with two options (different in both appearance and skills) for the \\'same\\' character: First option is \\\"Full of Life\\\", the other is \\\"Full of Dread\\\" (Read her story below to learn more) All in all, I simply made this mod because I wish to share my creation to the community. :) My knowledge of making a follower is still quite limited, so voice acting will have to come much later.\r\n\r\nAlso, feel free to post your screenshots of Quenya to the image gallery of this mod. Seeing Quenya going on some adventures makes me happy. :)\r\n\r\n\r\nI N S T A L L A T I O N :\r\n\r\n1) FIRST, make sure you have the latest Nexus Mod Manager installed, or you\\'ll get an error of not being able to activate the mod.\r\n2) Install with Nexus Mod Manager (If you wish to install both Quenya\\'s, press NO when asked to upgrade the mod. (AKA install the mod normally).)\r\nOR\r\n2) Install manually by extracting the data folder into Skyrim directory.\r\n\r\n>  Yes, you can use both versions of Quenya as followers at the same time. To learn where they are placed in the world of Skyrim, read the story below (and no, they are not in the same location).\r\n\r\n\r\nK N O W N   -   I S S U E S :\r\n> [Fixed] - For older and weaker PC users, if you installed Quenya \\'Full of Dread\\', you may experience rainbow face glitch and/or crashes when you load up your save. Download the optional compressed file to fix these problems.\r\n \r\n\r\n\r\nC H A N G E - L O G :\r\n1.2 - NMM installation should be working properly now.\r\n      - Added an optional file for Quenya FoD compressed version\r\n\r\n1.1 - Updated Quenya \\\"Full of Life\\\" as a standalone version.\r\n      - Added Quenya \\\"Full of Dread\\\" version. Also standalone. (updated the story to indicate her current location)\r\n\r\n1.0 - Initial release of Quenya - \\\"Full of Life\\\" (non-standalone)\r\n\r\n\r\n\r\n\r\n[IMG]http://i33.photobucket.com/albums/d93/evenstar15/banner_whoisshe_zpsf17ea8e2.png[/IMG]\r\n- Full of Life - version\r\n\r\nQuenya is a Dunmer who was born and raised in Windhelm. She is not your typical arrogant Dunmer that you\\'d usually see roaming around Morrowind, calling everyone \\\"Outlander\\\" for no logical reason. She was raised by two gentle Nordic folk who are living near the Stone District of Windhelm. Like many other Dunmers of the time, her real parents hailed from the prosperous capital of Blacklight, fleeing the eruption of the Red Mountain just to end up in the worse possible place for Dunmer in Skyrim: The Gray Quarters. Quenya is an exception now since she was taken in by the local Nords, thus escaping the impoverish conditions of those poor souls. Ever since she realized she was never going to be accepted by her own people in the Gray Quarters, she spends most of her childhood wandering the around market place, learning the trades of a blacksmith from Oengul War-Anvil and the arts of archery from Angrenor Once-Honored.\r\n\r\n\r\nShe grew up with her lively and strong-hearted personality like that of a typical Nord. Some folks even say she might part-Bosmer. Her quick and nimble footsteps, combining her unmatched archery skill made her very distinctive from a typical Dunmer, a magic caster. Quenya is not much of a mage: having never used even her own ancestral power nor a simplest candlelight spell before. These are curious forces beyond nature that she does not want to play around with. Nowadays, Quenya likes to linger around the Candlehearth Hall, enjoying a nice bottle of Nord mead and perhaps, waiting for someone to take her on an adventure...\r\n\r\n\r\n[IMG]http://i33.photobucket.com/albums/d93/evenstar15/overlook_zpsd8b02daa.png[/IMG]\r\n\r\n[color=red]UPDATED![/color]NOTE: Below is a story for the \\\"Full of Dread\\\" version of Quenya. Her location is indicated in the story.\r\n\r\nHer life seems flawless, passing the days at the smithy\\'s forge, deer hunting and peeking into bear caves for a thrill... until she heard about Gjalund Salt-Sage\\'s vessel arriving at the docks. Having never seen her homeland before, she took a leap of faith and wander out of the lands of Eastmarch for the first time. \r\n\r\nAn excerpt:\r\n \r\n\\\"As she felt the colors leaving her skin, Quenya now realized that she has been \\\"taken\\\".\r\n\r\nIt is all because of that cursed so-called Black Book. The corrupted powers of Hermaeus Mora Instead of going mad like the \\'fake\\' Dragonborn and becoming all tentacle-y like him, her skin will bare this terrible mark until the end of her days. Because of that foul Daedric prince of Fate, she is forever bounded to Miraak. Bounded by her soul. Defeating Miraak to rid of this curse will mean the end of her own life. For Quenya, this \\'side effect\\' will forever serve as a cruel reminder of her own foolishness and greed.\r\n\r\nQuenya slowly dragged herself out of Apocrypha to board the vessels back to Skyrim. She was almost rejected to board the ship for Gjalund feared whatever strange marks she bore may bring the ship ill-favored luck and potentially, to a tragic end during the journey. Fortunately, one of the crew members of the vessel, Sogrlaf, a citizen of Windhelm, had known her since she was a child, thus insisted the captain to take her on-board and back to her homeland. Unwillingly, Gjalund reluctantly agreed to this and set sail for Windhelm port. While on-board, Sogrlaf suggested that she sees Runil, an altmer monk and the keeper of Falkreath cemetary, for a potential spell that may cure her ill-fated curse. With pain, she cursed at his caring advice, saying it is a futile and foolish attempt, her white glowing eyes are solid proofs of her confirmed death. These pair of eyes blurred her visions from the real world. Simultaneously, she sees an overlaying image which revealed, again and again, her body crumbling to the ground as the marks on her skin spreads like wildfire, burning her pale skin, peeling them into shreds, her muscles horribly twisted and teared while her bones gradually melted into pools of black liquid... not even her fire-resistance ability can delay this gruesome death.\r\n\r\nKindly ascorted by Sogrlaf all the way to Falkreath, he led her inside the Dead Man\\'s Drink for a rest. At first glance on Quenya, Valga Vinicia, the innkeeper, immediately rejected her entry, but with Sogrlaf\\'s plead, she unwillingly allowed Quenya to stay there at most of 4 days. No more, no less. Then she will be casted off to the road if whatever mark she bores does not disappear. Thus, Quenya hopelessly sought the help from the monk while staying at the inn. Although, a faint light of her old self flickers even as death has its arms tightly wrap around her shoulder wherever she went. If her ticket to the Gates of Oblivion has been punched, then her one last desire is to go on one final adventure with someone who\\'s willing to take her along... \\\"\r\n\r\n[ To be continued ... ]\r\n* NOTE : Please keep in mind that the story is for roleplaying purposes only! :)\r\n* NOTE 2: I didn\\'t have time to add this to her story but Quenya \\'Full of Dread\\' is a nightblade. She specializes in one-handed (dual wielder) and destruction magic.\r\n\r\n[IMG]http://i33.photobucket.com/albums/d93/evenstar15/taken_zpse26ea886.png[/IMG]\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i33.photobucket.com/albums/d93/evenstar15/banner_specialthanks_zpsbdb15b3c.png[/IMG]\r\n\r\nI\\'d like to give special thanks to the following people who helped me through the making of this follower. Without whom I would have failed miserably during the process of making this follower plus the standalone version. And don\\'t forget to click their names to view their screenshot galleries, these guys are all talented screenarchers! :)\r\n\r\nBeta-Testers (Thank you, guys!): \r\n[url=http://www.skyrim.nexusmods.com/users/3921571]namaste911[/url] | [url=http://www.skyrim.nexusmods.com/users/2449196]amoebae[/url] | [url=http://www.skyrim.nexusmods.com/users/209736]kamikazekossori[/url] | [url=http://skyrim.nexusmods.com/users/4243482]schmoops9[/url] | [url=http://www.skyrim.nexusmods.com/users/2500005/]Jorundr[/url]\r\n\r\nThanks to... \r\n> [url=http://www.skyrim.nexusmods.com/users/3921571]namaste911[/url] \r\nYou have been one of the most helpful person to have helped me through the process from the very beginning til the end; from countless beta-testing, to making Quenya a standalone, to fixing those darn neck seams and so many other things. xP I couldn\\'t thank you enough for all the help you\\'ve given me, my friend. I salute you. Noobs (&expert) United! xD\r\n\r\n> [url=http://www.skyrim.nexusmods.com/users/3650229]m0ckin9bird[/url]\r\nThank you ever so much for helping me through the process of making Quenya standalone; from fixing my files to giving great advices. Your expertise is limitless and I couldn\\'t thank you enough. I\\'m truly grateful. :)\r\n\r\n> [url=http://skyrim.nexusmods.com/users/5373679]Diethardt[/url]\r\nThank you for your tips and tricks on making followers. Those were extremely helpful! :)\r\n\r\n> [url=http://skyrim.nexusmods.com/users/2596035]sPINELESSjELLY[/url] \r\n(I can\\'t really remember what you helped me with but it\\'s somewhere in Flickr that you helped me out lol! xP Sorry and thanks!)\r\n\r\nAnd a little shout out and special thanks to [url=http://skyrim.nexusmods.com/users/2808024]Midhras[/url] who \\\"nudged\\\" me in sharing my Quenya. ;)\r\n\r\nC R E D I T S :\r\nThe following mod authors were kind enough to allow for their mods to be used for my standalone version. Thank you very much!\r\n\r\nCreator of [url=http://www.skyrim.nexusmods.com/mods/13722]Eyes of Beauty[/url]: LogRaam (use of eye retexture)\r\nCreator of [url=http://www.skyrim.nexusmods.com/mods/1329]Beauty Faces for Female[/url]: Neckros (use of the face retexture)\r\nCreator of [url=http://www.skyrim.nexusmods.com/mods/2356]Xenius Character Enhancement[/url]: Xenius (use of normals and specular maps)\r\nCreator of [url=http://www.skyrim.nexusmods.com/mods/6709]Dimonized UNP Female Body[/url]: dimon99 (use of body mesh)\r\nCreator of [url=http://www.skyrim.nexusmods.com/mods/6554]CBBE skin texture[/url]: navetsea (use of body retexture)\r\n\r\nENB used to take these screenshots: \r\n> Countervibe ENB 1.0 by [url=http://www.skyrim.nexusmods.com/users/3463021]Kyokushinoyama[/url]\r\n> [url=http://www.skyrim.nexusmods.com/mods/15050]Skyrim Visual Immersion III[/url] by Matso\r\n> [url=http://www.skyrim.nexusmods.com/mods/11930]TV ENB v1000[/url] by Trillville\r\nAnd of course, Bethesda for creating Skyrim and CK.\r\n\r\n\r\n> P E R M I S S I O N : This is a nexus-exclusive mod. Please do not reupload this on the steam workshop or anywhere else without my permission. Thanks for your understanding.\r\n\r\n> (possible) F U T U R E - P L A N (s) :\r\n- Voice acting\r\n- Custom quest line",
  "categoryId": "66",
  "version": "1.2",
  "author": "feenixfly",
  "createdUnix": "1363361429",
  "updatedUnix": "1364666346",
  "containsAdultContent": false,
  "uploadedBy": "feenixfly",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021043",
      "name": "Quenya - Full of Dread 1_2 Standalone",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19811",
      "fileName": "Quenya - Full of Dread 1_2 Standalone-32543-1-2.zip",
      "uploadedUnix": "1364610427",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/becc095e4701884a6fa01ae89ee0ede38763d45ad9ffb87841945acdbc06d7df/analysis/1407494722/",
      "changelogHtml": " Folder arrangement in both files fixed. NMM installation should work fine now. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Quenya%20-%20Full%20of%20Dread%201_2%20Standalone-32543-1-2.zip?fid=1000021043&ttl=1535809087&ri=8192&rs=8192&setec=c73d06881e5888112a6f8115127556ab"
    },
    {
      "fileId": "1000021044",
      "name": "Quenya - Full of Life 1_2 Standalone",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15504",
      "fileName": "Quenya - Full of Life 1_2 Standalone-32543-1-2.zip",
      "uploadedUnix": "1364610488",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b84487b07b07d086cbb0282f1d12f62fc43aad2f6ae03e923957e6928a18c3fe/analysis/1407494730/",
      "changelogHtml": " Folder arrangement in both files fixed. NMM installation should work fine now. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Quenya%20-%20Full%20of%20Life%201_2%20Standalone-32543-1-2.zip?fid=1000021044&ttl=1535809088&ri=8192&rs=8192&setec=d1d6714d9adc9693f9c870a4949e29b3"
    },
    {
      "fileId": "1000021249",
      "name": "Quenya - Full of Dread_Compressed",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10712",
      "fileName": "Quenya - Full of Dread_Compressed-32543-1-2.zip",
      "uploadedUnix": "1364666346",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e17293080ac4a5bd3ebfbdcdcb74a33d438ef4b9acdd89565b192499b9b52074/analysis/1407496149/",
      "changelogHtml": " Folder arrangement in both files fixed. NMM installation should work fine now. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Quenya%20-%20Full%20of%20Dread_Compressed-32543-1-2.zip?fid=1000021249&ttl=1535809088&ri=8192&rs=8192&setec=f7997ca9d4486c0037ad4f35758c2624"
    }
  ]
}