{
  "modId": 3255.0,
  "modName": "Lydia out please and Lydia moving out alpha version",
  "summary": "Moves Lydia\\'s ref position downstairs in Breezehome or makes her move to another house.",
  "descriptionHtml": "If you are using a mod which affects one of the houses to which a housecarl you are tampering with belongs, make sure to load this file after that mod. If the modder added the housecarl ref id to the house it will overwrite the change made here if loaded after.\r\n\r\nAnother fix update: crash to desktop when loading the files lydia to dragonsreach, lydia to windhelm, lydia to solitude and lydia to riften should be fixed now.\r\n\r\nUpdate: reuploaded the \\\"moving out\\\" archive since I used a wrong fromID for Calder by distraction in the previous whiterun windhelm housecarl swap esp. Sorry about it.\r\n\r\nUpdate: Added \\\"lydia moving out\\\" archive. Contains multiple .esp files to either make lydia swap places with another housecarl or to move her to a different house or dragonreach. Version 0.01 so download at your own risk.\r\n\r\nIf swapping housecarls take notice that:\r\n1) This was meant to be used if you already own Breezehome and Lydia inhabits it.\r\n2) the RefIDs of the two housecarls will now be swapped.\r\n3) The gear you give your housecarl is linked to their RefIDs so it will get swapped as well. \r\n4) Do not use a swap file if you are married or plan to marry one of the housecarls you are moving since your spouse is linked to you by his/her RefID. \r\n5) Use only if both housecarls are alive and well. Avoid testing Fus Ro Dah on your new whiterun housecarl as well.\r\n6) This was meant to be used with both housecarls dismissed and in their regular positions.\r\nSame applies when uninstalling.\r\n\r\nIf moving Lydia to another house:\r\n1) Remove all items she might be holding for you else they\\'ll be gone.\r\n2) Her new RefID is a2c98.\r\n3) You will not find her in the house you plan her to go to first time you install the mod but in dragonreach. There she will great you as if you have never met her before. Upon that she will travel to the appropriate house.\r\n4) Again, if you decide to marry her, remove this mod first.\r\n5) This was intended to be used with lydia dismissed in her regular position in Breezehome.\r\nUpon disintallation remember to take away her items from her again.\r\n\r\nGlobal notice: I recommend you test if it works properly for you both when installing and removing before making a real save. Also any mods or console changes which apply to lydia by her refid will not work. Those mods aren\\'t compatible with lydia out please.esp as well.\r\n\r\nPlease report any bugs you might find to me. If something doesn\\'t work: sorry, I tried XD If you tell me what\\'s wrong maybe i\\'ll be able to fix it. Suggestions are of course welcome too.\r\n\r\nInstallation: read all written above with attention, if you decide to proceed extract the .esp you want into your skyrim data foulder. Make sure it\\'s checked when running the game. \r\n\r\nTo remove it: read all written above with attention, uncheck or delete the appriate .esp file from your skyrim data foulder.\r\n\r\nLydia out please: Moves Lydia\\'s Ref position downstairs in Breezehome. This should make her pass most of her time downstairs instead of upstairs in player\\'s bedroom. For the file to work she must be reset first: either hire and dismiss her as follower or open the console, target her and type \\\"disable\\\" and then \\\"enable\\\" commands.\r\n\r\nInstallation: extract into your Skyrim Data foulder. Make sure the .esp is checked when launching the game. Reset Lydia by either hiring and dismissing her as follower or by opening the console, targeting her and typing \\\"disable\\\" and then \\\"enable\\\" commands.\r\n\r\nUnistallation: delete the  \\\"lydia out please.esp\\\" from your skyrim data foulder. reset her in game as described in the installation procedure.\r\n\r\nAttention: this file was meant for use when you already own the Breezehome and Lydia inhabits it, but not as a spouse. \r\n\r\nPlease let me know if it doesn\\'t work or create issues.\r\n ",
  "categoryId": "33",
  "version": "0.1",
  "author": "stsg",
  "createdUnix": "1323548215",
  "updatedUnix": "1325148151",
  "containsAdultContent": false,
  "uploadedBy": "STSG",
  "primaryFile": null,
  "files": [
    {
      "fileId": "9016",
      "name": "lydia out please",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "lydia out please-3255-0-1.rar",
      "uploadedUnix": "1323548296",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/25cc1054c8a8ee578049c2cbd9f649836f05c553d3967c7163e0fc70232147b0/analysis/1406503384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/lydia%20out%20please-3255-0-1.rar?fid=9016&ttl=1535758161&ri=8192&rs=8192&setec=676f544a37c1740173c8850f3170002d"
    },
    {
      "fileId": "10447",
      "name": "Lydia moving out version before alpha",
      "version": "0.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Lydia moving out version before alpha-3255.rar",
      "uploadedUnix": "1323893205",
      "modVersion": "0.01",
      "virusScanUrl": "https://www.virustotal.com/file/21ad2cb82ad2c18622ea15f14514f6eba839f2fddebb7d2e622c8ab23c3acaa7/analysis/1406519105/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lydia%20moving%20out%20version%20before%20alpha-3255.rar?fid=10447&ttl=1535758162&ri=8192&rs=8192&setec=838df06b5cdbf312553e00ce9de9a654"
    },
    {
      "fileId": "14753",
      "name": "Lydia moving out",
      "version": "0.11",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Lydia moving out-3255.rar",
      "uploadedUnix": "1325148151",
      "modVersion": "0.11",
      "virusScanUrl": "https://www.virustotal.com/file/5e0da627164236fa6bce1638c5d3f665016c99f2284ebe586b73c40fc8f784c7/analysis/1406567181/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lydia%20moving%20out-3255.rar?fid=14753&ttl=1535758162&ri=8192&rs=8192&setec=df122680ad0511e6d6ecbf9e62771435"
    }
  ]
}