{
  "modId": 32567.0,
  "modName": "Drelas Cottage - Player Home",
  "summary": "Turns Drelas&#39; Cottage into a player home. Made only very small changes. ",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center]\r<br />\r<br />\r<br />Hello everybody&#33; This small mod makes Drela&#39;s Cottage usable as a player home.\r<br />\r<br />The file has been cleaned with TES5EDIT, does not require any DLC, is fully navmeshed and has no scripts, so it should be safe for everybody to use. Still, you should always make a backup save before installing ANY mod, in case something goes wrong.\r<br />\r<br />Drelas&#39; Cottage is the home of a Dunmer elemental mage in northern Whiterun and part of the [url=http://www.uesp.net/wiki/Skyrim:Drelas%27_Cottage]vanilla game[/url], who will attack you as soon as you enter. He&#39;s quite tough, but after the battle, you can&#39;t take items from his house without them counting as a crime - all are flagged as owned and are considered stolen if taken. Since there are a few leveled potions and poisons and many valuable alchemy ingredients in there, as well as a bed, and the location is quite nice, I decided to go all the way and turn this into a player-friendly home. Feel free to take everything&#33;\r<br />\r<br />I made a couple of changes, such as moving the lights around a bit, adding a cooking spit, a bookcase, a satchel, a strongbox, and a couple of non-respawning chests. The whole house is set as a no-respawn zone, but still, be careful when storing items in barrels and sacks - they&#39;re not safe&#33; Outside you&#39;ll find a garden with some vegetables, chickens, and nests. I also put a copy of Song of the Alchemists in the working area for all the alchemists out there. \r<br />\r<br />This mod is really simple and shouldn&#39;t conflict with anything, except any mods that change Drelas&#39; Cottage, of course. I tested the mod before and after attacking him, and all seems to be working as intended. Also, since the place is now a no-respawn zone, that may mean that Drelas&#39; body may never disappear - in which case I&#39;d recommend using the console to &#39;disable&#39; him. Let me know if anything&#39;s gone wrong, and I&#39;ll do my best to fix it up&#33;\r<br />\r<br />[u][b]Notes[/b][/u]\r<br />I originally made this mod for the Steam Workshop. Link [url=http://steamcommunity.com/sharedfiles/filedetails/?id=114582157]here[/url]. To install, place the files in your &#39;Steam/SteamApps/Common/Skyrim/Data&#39; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp. Or use your mod manager of choice to install the mod automatically. Have fun&#33;\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "67",
  "version": "1.00",
  "author": "Jokerine",
  "createdUnix": "1362099958",
  "updatedUnix": "1362095974",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014040",
      "name": "Drelas Cottage",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Drelas Cottage-32567-1-00.rar",
      "uploadedUnix": "1362095974",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/ff7802797e731fd4c4854d6dc42e6dd35e0c570b2b96250040b95badb16345bd/analysis/1407444968/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Drelas%20Cottage-32567-1-00.rar?fid=1000014040&ttl=1535809139&ri=8192&rs=8192&setec=1bf482165a2dc69d16a35ae4848ee40c"
    }
  ]
}