{
  "modId": 32566.0,
  "modName": "Whiterun - Sparrow Plains Player Home",
  "summary": "Adds a player house in Whiterun, in the location where Carlotta Valentia&#39;s home used to be. ",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center]\r<br />\r<br />\r<br />As some of you may know, Breezehome in Whiterun can cause a crash to desktop with Hearthfire enabled. So, I decided to make a different house for my character that would be *in* Whiterun, instead of outside the walls; and, since I liked the final result, I figured I&#39;d share. There don&#39;t seem to be many custom houses located in the town itself... \r<br />\r<br />Now, Whiterun is not very big, so I had to tweak things around a bit. I liked the location of Carlotta Valentia&#39;s home (all my houses MUST have water nearby&#33;), so I shamelessly took it for my own house and gave her a different one not too far away, upstream. I had to move the walls of the city and other things around a bit, just so you know - there may be compatibility issues there. \r<br />\r<br />The house is really simple - it has alchemy and enchanting stations, cooking pot, one double bed, a bookcase, and plenty of safe storage. There is also a little indoor garden of sorts, and a garden outside with a bench to sit and enjoy the sun. \r<br />\r<br />I tried to give kind of a theme to the place, including a note stuck to the door explaining the name of the house, and why it&#39;s empty, as well as feathers and the previous owner&#39;s journal. You can also find a house dog, named Idlar. Heh, get it? Because he idles, since he doesn&#39;t go anywhere? Yeah, I&#39;ll show myself out. In my defense, it&#39;s a Nord name from Tamriel Rebuilt&#39;s name generator. Finally, I placed a hidden chest under the bed for you to store your savings safely from thieves. Be sure to check it out&#33; \r<br />\r<br />No DLC required - just the main game. And yes, this means you cannot build a child&#39;s room here; the house is offered as-is. There&#39;s also a fast-travel marker, for your convenience. \r<br />\r<br />\r<br />[u][b]Finding the house:[/b][/u]\r<br />Sparrow Plains is in the Wind District, first house on the left after going up the steps to the left of the main gate. It cannot be missed&#33; \r<br />\r<br />\r<br />[u][b]FIinding the key: [/b][/u]\r<br />The house is locked, and the key is somewhere in the vicinity. Good luck finding it&#33; A small clue - look in the little yellow tree next to the grate upstream. One of the pictures I uploaded points at it.\r<br />[i][b]Spoiler:[/b] [url=http://i47.tinypic.com/ivhdtc.jpg]Here[/url] is a picture of the exact location, in case you still cannot find it.[/i]\r<br />\r<br />\r<br />[u][b]Notes[/b][/u]\r<br />I originally made this mod for the Steam Workshop. Link [url=http://steamcommunity.com/sharedfiles/filedetails/?id=111941508]here[/url]. To install, place the files in your &#39;SteamSteamAppsCommonSkyrimData&#39; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp.\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "67",
  "version": "1.00",
  "author": "Jokerine",
  "createdUnix": "1362100028",
  "updatedUnix": "1362095523",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014039",
      "name": "Sparrow Plains",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "51",
      "fileName": "Sparrow Plains-32566-1-00.rar",
      "uploadedUnix": "1362095523",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/50946b5b40ede8a7902bc8d3705249f06a5dc417c56012b008378e8a308c2cac/analysis/1407444967/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sparrow%20Plains-32566-1-00.rar?fid=1000014039&ttl=1535809138&ri=8192&rs=8192&setec=28ed25ea538d8a19c283ef2e44d3225d"
    }
  ]
}