{
  "modId": 32570.0,
  "modName": "Markarth - Refurbished Abandoned House and Altmer Follower",
  "summary": "This mod does two things; adds a new Altmer follower, Olquar, and restores the abandoned house in Markarth. ",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center]\r<br />\r<br />WARNING: May not be lore friendly&#33; Also, install only after finishing &#34;The House of Horrors&#34;&#33; IF YOU DO IT BEFORE YOU MAY GET ERRORS&#33;\r<br />\r<br />***\r<br />\r<br />This mod does two things; adds a new Altmer follower, Olquar, and restores the abandoned house in Markarth.\r<br />\r<br />People familiar with my [url=http://skyrim.nexusmods.com/mods/32558]Seaside Library[/url] mod may recognize Olquar; he is basically a follower version of the library keeper&#39;s husband. I thought he looked rather handsome, so that&#39;s my excuse. He is a High Elf and  former Thalmor captain who has decided to enjoy his twilight years in Markarth in the company of his dog. He is to be found in the no longer Abandoned House, up the street from the main gate. \r<br />\r<br />The house has been refurbished, featuring bookshelves, mannequins, weapon plaques and full smithing amenities in the basement. There are numerous chests and containers, alchemy and enchanting stations, and an unowned bed. I changed the house flag to a no-respawn zone so all the crazy floating items leftover by the quest would stop popping up (you may still have to pick up some stray items the first time you enter, however). The chests and dressers inside the house do not respawn items, but barrels and sacks are set to respawn. The destroyed part of the house and Molag Bal&#39;s altar have been blocked from view with a hidden door, shown in the last screenshot. \r<br />\r<br />Olquar is a level 10 warrior who will level up with you. He specializes in heavy armor, two-handed, and archery. You can hire him for free, since he is itching for adventure; I placed some of his old equipment in a chest by the mannequins to get you started, so he doesn&#39;t go around attacking bandits in his fine clothes. He will also marry you and defend your love of all naysayers, even if you are a Nord&#33;\r<br />\r<br />Again, DO NOT INSTALL THIS MOD UNTIL YOU HAVE FINISHED &#34;THE HOUSE OF HORRORS&#34;&#33;\r<br />\r<br />This is my first attempt at a full-fledged follower, so let me know if there&#39;s any problem&#33;\r<br />\r<br />[u][b]Notes[/b][/u]\r<br />I originally made this mod for the Steam Workshop. Link [url=http://steamcommunity.com/sharedfiles/filedetails/?id=126951960]here[/url]. To install, place the files in your &#39;SteamSteamAppsCommonSkyrimData&#39; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp.\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "67",
  "version": "",
  "author": "Jokerine",
  "createdUnix": "1362099995",
  "updatedUnix": "1362097304",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014043",
      "name": "Abandoned House and Follower",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29",
      "fileName": "Abandoned House and Follower-32570-1-00.rar",
      "uploadedUnix": "1362097304",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/9a2b8615682093778b9fc8fc6a2f1647030ee58dc61236a9dd2cd2cf40186323/analysis/1407444971/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Abandoned%20House%20and%20Follower-32570-1-00.rar?fid=1000014043&ttl=1535809143&ri=8192&rs=8192&setec=9a6b9c015735040c205ab39565862648"
    }
  ]
}