{
  "modId": 32576.0,
  "modName": "Werebears Found in Skyrim",
  "summary": "A simple mod which adds a few werebear spawns to the mainland of Skyrim. Requires Dragonborn.",
  "descriptionHtml": "This is a simple mod which adds a few werebear spawns to the mainland of Skyrim. Since they\\'re naturally supposed to be found in Skyrim, I thought it rather disappointing they could only be found on Solstheim... \r\n\r\nThere are eighteen spawns in total - scattered rather widely throughout Skyrim, with a preference for mountainous regions, although there are a few lurking around Morthal\\'s swamps and the general Falkreath area. I debated creating more, but they\\'re not supposed to be commonly found, hence the rarity.\r\n\r\nI also tossed a single werebear into the non-boss werewolf spawn list, so there\\'s a slight chance one might show up in place of a werewolf as well. \r\n\r\nAt very low levels, the spawns will only produce a regular bear. \r\n\r\nThis mod doesn\\'t allow you to be infected with werebear lycanthropy (sanies ursus?), unfortunately. I don\\'t understand enough of Skyrim\\'s scripting for that. I am hoping that somebody creates such a thing, though. It\\'d be fun to have that variety. \r\n\r\nIn any case, enjoy! Requires Dragonborn, of course.",
  "categoryId": "83",
  "version": "1",
  "author": "Diana",
  "createdUnix": "1362102872",
  "updatedUnix": "1362102680",
  "containsAdultContent": false,
  "uploadedBy": "dianacat777",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014055",
      "name": "Wild Werebears",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45",
      "fileName": "Wild Werebears-32576-1.zip",
      "uploadedUnix": "1362102680",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9eb6ac5bd47a3c55e53e196f0d61455e1c350ca48847ec8f05bcbb7958cdf642/analysis/1407445206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wild%20Werebears-32576-1.zip?fid=1000014055&ttl=1535809153&ri=8192&rs=8192&setec=dac2483f4c3ab5ec6adc8845f561a23d"
    }
  ]
}