{
  "modId": 32589.0,
  "modName": "Leaps Of Skyrim",
  "summary": "Want to air assassinate your target? Want to feel awesome? Want to make a quick escape from the guards? If you answered yes to any of these questions, Leaps Of Skyrim is the mod for you!",
  "descriptionHtml": "-READ ME-\r\n1. I highly suggest using mods that change the god-awful jumping animations. Many work well with this mod.\r\n2. The majority of the leaps lead to safe landings, but not all. You may get hurt or even die. If you want to bypass this, then there are many mods that alter fall damage. I did not do so with this mod because I feel it breaks immersion.\r\n3. The EPIC jump off the Solitude arch looks like its missing rocks. This is not my mod.\\'s fault The developers did not expect you to be able to get up there so they did not fully develop the area.\r\n\r\n-DESCRIPTION-\r\nUPDATE: After a lengthy hiatus, I am back and hard at work on all of my mods. Updates will be coming shortly for all four of my releases. Thank you for your continued support and patience!\r\n\r\nSo you may be here because you like the AC games. They are famous for their crazy acrobatic \\\"leaps of faith.\\\" Now Skyrim\\'s engine isn\\'t quite made for that much fuss, but this is pretty damn close. \r\n\r\nLeaps Of Skyrim (LoS) adds 25+ (and counting!) \\\"leaps of faith\\\" into the world of Skyrim. You\\'ll find these leaps while adventuring, questing, etc. They open up many new gameplay opportunities. Perhaps you\\'re an assassin who wishes to surprise your target from the air, or an archer wanting to do some sniping, or a warrior who wants to swing his big hammer in the air, or a mage who needs a way to escape battle before taking too much damage. Whatever your game style is, this mod is fully compatible with them all. \r\n\r\nThe leaps will add new opportunities. You will be using them to escape the guards or maybe to just feel like an awesome acrobat. The leaps are divided into three categories: small, medium, and EPIC. Medium and EPIC leaps are marked by a hawk flying around the general vicinity of the leap (just like in AC). \r\n\r\nThe leaps are also incorporated naturally as if someone put them there maybe to escape from the guards or dive into a waterfall. They are easily accessible and very immersive. They aren\\'t just random pieces of wood either. They are all supported with beams for a more natural and purposeful look. They are varied as well. Some leaps use planks, others use bridges, there\\'s a little something for everyone.\r\n\r\nThis is my second mod so any feeback is welcome and appreciated. If you like this mod please endorse! I\\'m also open to requests for leaps!\r\n\r\n-FUTURE PLANS-\r\n\r\nI\\'m currently trying to figure out a way to use triggers to make all of the leaps safe. The majority are and most of the falls won\\'t be fatal to mid-higher level characters. I will also be adding more leaps throughout Skyrim. I will also look into aerial combat as that seems to be a big request! Also, I am looking into adding some leaps into towns if it is requested a lot.\r\n\r\n-CREDITS-\r\n\r\nAll CK work done by myself (jrod1311).\r\n\r\n-OTHER MODS-\r\n\r\nThe Hole In The Wall- Thief Hideout\r\nhttp://skyrim.nexusmods.com/mods/31024\r\n\r\nMove Through Time\r\nhttp://skyrim.nexusmods.com/mods/32636\r\n\r\nThe Mage\\'s Gorge\r\nhttp://skyrim.nexusmods.com/mods/32897\r\n\r\nHunter\\'s Abode- The Lodge\r\nhttp://skyrim.nexusmods.com/mods/35030\r\n\r\nDragonborn Hall\r\nhttp://skyrim.nexusmods.com/mods/35306",
  "categoryId": "24",
  "version": "1.0",
  "author": "jrod1311",
  "createdUnix": "1362112385",
  "updatedUnix": "1362111975",
  "containsAdultContent": false,
  "uploadedBy": "jrod1311",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014086",
      "name": "Leaps Of Skyrim",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50",
      "fileName": "Leaps Of Skyrim-32589-1-0.rar",
      "uploadedUnix": "1362111975",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bf690dca932dd4f273d312582427c0485c44c80de751e489765f4d15475e1282/analysis/1407445388/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Leaps%20Of%20Skyrim-32589-1-0.rar?fid=1000014086&ttl=1535809168&ri=8192&rs=8192&setec=76d3da399ae95bfb344a1744f9d4e1bb"
    }
  ]
}