{
  "modId": 32597.0,
  "modName": "Dragon Combat Overhaul",
  "summary": "Are you ready?",
  "descriptionHtml": "[center][b][b][b][b][center][youtube]YpTy5CbuLzI[/youtube][/center][/b]\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/37216-1-1430053788.png[/img][/b][/b]\r<br />\r<br />\r<br />\r<br />[size=15][color=green]DRAGON COMBAT OVERHAUL[/color][/b][/center][color=green][/size][/color]\r<br />\r<br />[size=5][center]AN [url=http://www.nexusmods.com/skyrim/mods/52487/?]EPIC GAMEPLAY OVERHAUL[/url] MOD[/center][/size]\r<br />\r<br />\r<br />[center][b][size=4]THIS MOD REQUIRES DAWNGUARD, DRAGONBORN, SKSE, AND THE LATEST SKYRIM UPDATE.[/size][/b][/center]\r<br />\r<br />\r<br />[center][center][youtube]EyJKt3J3EDo[/youtube][/center][/center]\r<br />\r<br />\r<br />[center][size=4]\r<br />[url=http://skyrim.nexusmods.com/mods/32597/?][/url][size=4][url=http://skyrim.nexusmods.com/mods/32597/?]Dragon Combat Overhaul[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/37216/?]Civil War Overhaul[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/43241/?]Fire and Ice Overhaul[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/52474/?]Combat Drama Overhaul[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/52471/?]Important Information Overhaul[/url][/size]\r<br />[size=4][url=http://www.nexusmods.com/skyrim/mods/53888/?]Epic Music Overhaul\r<br />[/url][url=http://www.nexusmods.com/skyrim/mods/58051/?]Simple Magic Overhaul\r<br />[/url][url=http://www.nexusmods.com/skyrim/mods/edit/?id=60077][/url][url=http://www.nexusmods.com/skyrim/mods/60077/?]Movement and Stamina Overhaul[/url][/size][url=http://www.nexusmods.com/skyrim/mods/53888/?][/url]\r<br />[/size][/center]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=5]INSTALLATION NOTES[/size][/b]\r<br />\r<br />DO NOTHING OTHER THAN THIS.\r<br />\r<br />Remove all previous versions of DCO.  Install the mod with or without the mod manager.  Profit.\r<br />\r<br />If you have The Dance of Death:\r<br />Load it after/below DCO.  Or your main menu won&#39;t appear.  If it doesn&#39;t appear then  move it to the other side.  Violens is the superior mod and has no such issue, use it instead.\r<br />\r<br />If you are upgrading:\r<br />DO NOT MAKE A CLEAN SAVE, THERE IS NO SUCH FREAKING THING.  Remove all previous files.  Install normally.  IT&#39;S THAT EASY.  Just don&#39;t try to do it mid-dragon fight.\r<br />\r<br />\r<br />[b][size=5]APOLLO&#39;S OBJECTIVE MOD ASSESSMENT[/size][/b]\r<br />\r<br />Script weight.........................Medium(during dragon fights)\r<br />Installation Difficulty...............Low\r<br />Modding Skill Level Required......Low\r<br />Game Difficulty Increase...........Very High\r<br />\r<br />\r<br />[b][size=5]TABLE OF CONTENTS[/size][/b]\r<br />\r<br />I.  Features\r<br />II.  I still don&#39;t understand.  What is this and what does it do?\r<br />III.  Known issues and Incompatibilities\r<br />IV.  Frequently Asked Questions\r<br />V.  The Wall of Shame: Discontinued Features\r<br />VI.  Reviews\r<br />VII.  Recommended Mods\r<br />VIII.  Glowing Testimonials\r<br />IX.  Shameless Advertising for My Buddies\r<br />\r<br />\r<br />\r<br />[size=3][i]Intelligence has been defined in many different ways including, but not limited to, abstract thought, understanding, [b]self-awareness, communication, reasoning, learning,[/b] having emotional knowledge, retaining, [b]planning, and problem solving.[/b]\r<br />Intelligence is most widely studied in humans, but has also been observed in animals and in plants. [b]Artificial intelligence is the simulation of intelligence in machines.[/b][/i][/size] - Wikipedia, master of knowledge.  Not to be confused with Google, master of pornography.\r<br />\r<br />\r<br />[center][size=8][color=#0084ed]TL;DR[/color][/SIZE][/center]\r<br />\r<br />[size=3][b][center]Mod good.  Make dragons big bad.  Og like.[/center][/b][/size]\r<br />\r<br />\r<br />\r<br />[center][img]http://i.qkme.me/3tyvbd.jpg[/img][/center]\r<br />\r<br />[color=#00ff00][size=6][b][u][center]\r<br />\r<br />DRAGON BEHAVIOR AND ARTIFICIAL INTELLIGENCE[/center][/u][/b][/size][/color]\r<br />[b][size=5][color=#FF0000]\r<br />UNPREDICTABLE INJURIES[/color][/size][/b]\r<br />Dragons no longer get injured at the magical 35% mark: it could happen to them at any time, anywhere.  Every hit has a low chance of injuring a dragon, with the amount of health the dragon has remaining determining to an extent how long the dragon stays injured.  If the dragon does not take enough(Read: A LOT) of damage during the random time allotted for its injury, it may recover and regain the ability to fly.  They also might not.  Due to the amount of randomness this inserts into a fight, it makes dragons wildly unpredictable(in comparison to Vanilla).  Don&#39;t count on an injury saving you, and don&#39;t assume they&#39;ll be back up and flying when you think they will.  You know what they say happens when you assume stuff...\r<br />\r<br />[b][size=5][color=#FF0000]JOE COLLEGE WAINWRIGHT/JOE&#39;S P.H.D.[/color][/size][/b]\r<br />Dragon AI and tactics have been significantly improved, allowing for better situational awareness and more unpredictable behavior. Yup, definitely reminds me of college. Speaking of things we&#39;ve tried in college, &#34;Triple threat&#34;, a dragon combo attack, has been added. If a dragon chooses to do so, he will slam his tail down once, twice, three times, with the third strike flinging NPCs(and you) away like so many leaves on the wind. Hint: if you see him slam twice, don&#39;t wait for the third slam, just RUN. Because if he decides to do the third and you haven&#39;t already started running, your day will be absolutely ruined. Dragons will now execute talon grabs on unsuspecting NPCs. New attack, Kamikaze, has been added. New attack, Artificial Tan, has been added. New attack, Some People Think Clowns Are Scary, has been added. Dragons may also flee from combat, and may tactically retreat to gain the advantage.\r<br />\r<br />[b][size=5][color=#FF0000]MOOSE AND SQUIRREL[/color][/size][/b]\r<br />Dragons now communicate tactics, and dragons&#39; AI significantly improves the more dragons a team has. Fights with multiple dragons are now exponentially more difficult: they will work together to bring you down. Watch out for their simultaneous landings, that nearly killed my god testing character. *evil smile* Dragons may also come to the aid of their injured comrades. This unpredictably changes multiple dragon fights to such a degree that I don&#39;t know what will happen to you. My flying monkeys inform me that they all had to turn on God mode to test this feature. It has been advised that you bring an extra pair of shorts, just in case. Good luck.\r<br />\r<br />[center][youtube]6Lpqt5luGKo[/youtube][/center]\r<br />[b][size=5][color=#FF0000]SMOOTH OPERATOR[/color][/size][/b]\r<br />DARGONS NOW MAKE AWESOME WITH AIR SHOW. DCO&#39;s AI improvements can push the boundaries of what is acceptable movement for a dragon.  This feature expands those boundaries by editing how the dragon moves so it can incorporate new tactics, and possibly even give you an air show.\r<br />\r<br />[b][size=5][color=#FF0000]STARBUCKS-STYLE DEATH[/color][/size][/b]\r<br />Dragons deaths now come in a wide variety of epic flavors, including crash landings, torment, perch, and latte. If variety is the spice of life, this is enough variety to make you permanently stoned. Wait, I thought you were talking about that popular new drug that all the kids are doing these days. Hang on, they don&#39;t call it that? I&#39;VE BEEN LIVING A LIE.\r<br />\r<br />[b][size=5][color=#FF0000]THREAT LEVEL MIDNIGHT, OSCAR&#33;[/color][/size][/b]\r<br />Dragons now prioritize the Dovahkiin as a target. Note: there are serious limitations on how this works - you will every once in a while still get dragons flying around teasing you because THEY THINK NOW AND THEY DECIDED TO DO THAT, but you are a prioritized target. Finally. Best of luck with that, really.\r<br />\r<br />[center][youtube]jAgjMnm-ES4[/youtube][/center]\r<br />\r<br />\r<br />[center][b][u][color=#00ff00][size=6]GAMEPLAY[/size][/color][/u][/b][/center]\r<br />[b][size=5][color=#FF0000]\r<br />GET OUT OF MY SKY(tm) + MOMENTUM(tm) + AIRSPEED VELOCITY OF AN UNLADEN SWALLOW[/color][/size][/b]\r<br />In vanilla, if you kill a dragon mid-flight he&#39;s all like &#34;Broski, I understand you want me to keel over and die now and hand you my immortal soul, BUT I&#39;M IN THE MIDDLE OF SOMETHING HERE. I&#39;ll get on it in a sec, dude.&#34; But I&#39;m all like, &#34;Homeskillet, It&#39;s time for you to FALL RIGHT OUT OF THE FREAKING SKY.&#34; And then he&#39;s all like &#34;NOOOOOOO BROOOOOO&#34; and then faceplants into the side of the Throat of the World. Basically, if you kill a dragon in mid-flight, it falls like you killed it in mid-flight. Watch where it lands or you&#39;ll never find it and its precious soul.\r<br />\r<br />[b][size=5][color=#FF0000]NOTHING CAN MOVE THE BLOB + OH NO SHE DIDN&#39;T[/color][/size][/b]\r<br />Dragons are now immune to normal means of stagger. They may now only stagger randomly under normal circumstances, similarly to how dragon injuries are handled.  However, you can stagger a dragon with the highest level of unrelenting force and dragonrend, and you can also stagger a dragon with a bash or power attack to counter a bite attack or shout(there is a one second window in which to do this).\r<br />\r<br />[b][size=5][color=#FF0000]UNCLE SHEO&#39;S HAPPY DAY[/color][/size][/b]\r<br />Kill a dragon while you have Wabbajack equipped.  Trust me on this one, Uncle Sheo would never steer you wrong.\r<br />\r<br />\r<br />[center][youtube]1wqF3lXGjZo[/youtube][/center]\r<br />\r<br />[b][size=5][color=#FF0000]AIRSTRIKE[/color][/size][/b]\r<br />You gain a once a day power that, when used, causes a nearby friendly dragon(this assumes you have one) to attempt a talon grab on an NPC in your immediate area. THERE ARE LIMITATIONS ON THIS. It will not work if your dragon is flying, and sometimes the dragon will simply refuse to do it(remember that I gave them brains). It is still freaking awesome.\r<br />\r<br />[b][size=5][color=#FF0000]DUDE IT WAS IN THE TRAILER[/color][/size][/b]\r<br />if you hit a dragon mid flight at high speed during cruise at low health, it crashes and dies in the most epic fashion. You&#39;re welcome.\r<br />\r<br />[b][size=5][color=#FF0000]FRICTION[/color][/size][/b]\r<br />During dragon fights, the player has friction when ragdolled. This should make the ragdolling slightly less painful. Yeah buddy, I made FREAKING FRICTION HAPPEN. *drops mic*.\r<br />\r<br />[b][size=5][color=#FF0000]SOULSUCK (tm)[/color][/size][/b]\r<br />I have taken over dragon soul absorption. Using the might of the MCM, you can control the range at which you can suck souls, as well as whether or not to absorb souls during combat.\r<br />\r<br />\r<br />\r<br />\r<br />[center][b][u][color=#00ff00][size=6]NEW VERY BAD THINGS DRAGONS CAN DO TO YOU[/size][/color][/u][/b][/center][b][u]\r<br />\r<br />[/u][/b][b][size=5][color=#FF0000][b][size=5][color=#FF0000]TROGDOR THE BURNINATOR + [/color][/size][/b][b][size=5][color=#FF0000]OH REGINALD.......I DISAGREE&#33;[/color][/size][/b]\r<br />[/color][/size][/b]All Dragon movement has force associated with it. Every landing, wing flap, or tail slam creates a knockback explosion. Camera shake, visual effects, and controller vibrations also play during these events. Dragons move and attack faster. Dragons shout more often.\r<br />\r<br />The flip side of this is that the player can resist all knockdown events by blocking, warding, or using Become Ethereal.\r<br />\r<br />[center][youtube]gmdkuFFbn-s[/youtube] [/center]\r<br />\r<br />[b][size=5][color=#FF0000]ASSAULT 2.0[/color][/size][/b]\r<br />I LOVE Deadly Dragons.  So now, after you&#39;ve installed DCO, I want you to go to the Deadly Dragons MCM menu and TURN OFF ASSAULT.  DCO will take it from here.  ASSAULT 2.0 will make scripted dragon events happen, DCO style.  :D  This feature will cause dragons to attack you randomly in groupings of up to 3 dragons under normal conditions(let&#39;s be honest, how often do &#34;normal conditions&#34; happen with DCO anyway).  These attacks are designed to be as devastating as possible.  There are no &#34;safe zones&#34;, so don&#39;t ask.  How often and how randomly this occurs can be configured in the MCM.  The main takeaway from this feature is: you are being hunted.  Be afraid.\r<br />\r<br />[b][size=5][color=#FF0000]MORTAL KOMBAT[/color][/size][/b]\r<br />Dragons are dynamically placed into dragon categories based on magic and faerie dust and algorithms. A dragon, depending on what type it is, will be designated fire, frost, shock, nature, undead, multiple, or default. Each category grants the dragon special traits and behaviors that the dragons will utilize with their new AI to bring you down. I don&#39;t want to spoil the surprise, and writing out everything they do would take too long, and I have to finish writing this description before the community center&#39;s Bocce Ball Madness event. This is fully compatible with many of your favorite dragon mods.\r<br />\r<br />[center][youtube]UMf40daefsI[/youtube][/center]\r<br />\r<br />[b][size=5][color=#FF0000]LIMIT BREAKS[/color][/size][/b]\r<br />Let me just start by saying that this feature is awesome-in-a-can. Bethesda made a bad design choice by having dragons get perma-injured at the magical 35% marker - making the fight get EASIER before they died made it anticlimactic. A fight should get harder and harder until you finally win, that&#39;s how I think most people would define a fun fight. Now, when a dragon reaches 20% health it may fire off an extremely powerful shout, designed by yours truly. What kind of shout it fires off depends on what category MORTAL KOMBAT sorted the dragon into - so no need to worry about lore-unfriendlyness. These shouts are designed to completely turn the tides of battle by either decimating any support you might have or by turning said support against you - how effective these are for the dragon very much depends on the situation and the limit break used, sometimes it&#39;s useless, and sometimes it ends in your immediate death.\r<br />\r<br />[b][size=5][color=#FF0000]REINFORCEMENTS[/color][/size][/b]\r<br />When a dragon reaches 20% health, it has a 25% chance of calling for reinforcements. Up to three dragons will fly in in an attempt to kill you or support the dragon. HOW they help the dragon can vary dramatically, but there are basically six different &#34;scenarios&#34; that these dragons play out. And I won&#39;t spoil it for you. Back to bocce ball.\r<br />\r<br />[b][size=5][color=#FF0000]EL GUAPO[/color][/size][/b]\r<br />Alduin is now EL GUAPO. Not only does that mean he now commands a Mexican army with the help of his sidekick, Jefe, but also his combat is now controlled by DCO just like any other dragon. Furthermore, he has been given access to the very best of DCO&#39;s abilities, and even has one new ability that no other dragon has. You get a Gold Star if you beat him with EMD and DD on. So go forth and try to earn your Gold Star - I&#39;ll be waiting here for the inevitable &#34;BRO THIS IS TOO HARD HOW AM I SPOSED TO DO THIS IHATEUIHATEUIHATEUIHATEU&#34;. \r<br />\r<br />\r<br />[center][youtube]tyBUMntP6DI[/youtube][/center]\r<br />\r<br />\r<br />\r<br />[b][size=5][color=#FF0000]MCMS EVERYWHERE[/color][/size][/b]\r<br />As a member of the EGO family, DCO has an MCM which will let you edit all manner of things, like reinforcements and limit break chance, how deaths and SOULSUCK(tm) are handled, and much more&#33;\r<br />\r<br />\r<br />\r<br />[b][size=5]I STILL DON&#39;T UNDERSTAND - WHAT IS THIS AND WHAT DOES IT DO[/size][/b]\r<br />\r<br />DCO dynamically edits dragons to maker them better, faster, and smarter.  It also gives them unique effects and abilities based on what type of dragon it is.  It basically completely rewrites dragon fights, and makes them significantly harder.\r<br />\r<br />\r<br />\r<br />[b][size=5]KNOWN ISSUES[/size][/b]\r<br />\r<br />Please visit [url=http://www.nexusmods.com/skyrim/mods/52487/?]the EGO bug tracker[/url] for a list of all known issues and incompatibilities associated with this mod.\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=5]FREQUENTLY ASKED QUESTIONS[/size][/b]\r<br />\r<br />&#34;Dude, there&#39;s already a thousand great mods out there for Dragons.  We don&#39;t need another one.&#34;\r<br />That&#39;s not a question.  This mod doesn&#39;t change dragon textures or meshes, or give dragons awesomesauce new spells, or increase their stats in any way.  It instead modifies dragon behavior and AI, for the most part.  I highly recommend your favorite dragon mods to be paired with this, they will almost certainly be compatible.\r<br />\r<br />&#34;I HATE KNOCKDOWNS.  WHY THE *CENSORED* ISN&#39;T THERE A MCM OPTION TO TURN THIS OFF.  I WILL KILL YOU.&#34;\r<br />Let me first address that last bit because people really do go way too far about this issue: this is a modification of a video game.  This is not the most important thing in the world.  If this mod does not appeal to you in its current form, you don&#39;t have to use it.  You in fact have no RIGHT to have it, and you would not have it in the first place had I not arbitrarily decided one day to start modding Skyrim and upload my work here.  If you don&#39;t like some aspect of this mod, just don&#39;t use it.  You have alternatives.\r<br />Now, let&#39;s talk about knockdowns.  They are there in the first place because I am not actually a wizard, and the dragons are still INCREDIBLY DUMB.  I can only call a grand total of FIVE attacks from a dragon EVER - Tail slam(useless unless you&#39;re right up the dragon&#39;s booty), Wing slap(useful attack, short range, more on that later), bite(useful attack, short range), Breath, and Fireball-style breath.  By giving dragon movement knockdown force, I expand the dragon&#39;s arsenal exponentially.  Now, you also have to watch out for landings of all stripes, tail slams from any angle, and even low dive-bombs by the dragon.  Using knockdowns enables me to create new &#34;attacks&#34; that can be accessed from a much wider variety of strategies and positions than any vanilla asset could.  \r<br />GIVEN THAT - the AI in DCO ASSUMES knockdown is on.  That is how I am able to bring you such exciting combat, I&#39;m actually telling the dragons to try to surprise land on your head, I&#39;m telling them to chase you down with a slow landing, and I&#39;m telling them to dive bomb you as closely as possible to knock you off mountains.  If the knockdown isn&#39;t on, THESE BEHAVIORS DON&#39;T MAKE SENSE.  This causes the fight to become dramatically easier, as DCO will say to the dragon &#34;Hey you, use this attack&#34;, the dragon says &#34;Ok bro&#34;, then uses the &#34;attack&#34;(which, since it has no knockback, is in fact simply movement) and say to DCO &#34;It&#39;s all good, took care of it G&#34; and DCO will say &#34;Good job homie.  Have a cookie and a smoke and take 5.&#34;  When in fact no good job has been done and the dragon does not deserve its cookie.  Without knockdown, DCO dragons are easier and stupider than vanilla dragons.  It is horrifying for me to watch my carefully educated dragons get lobotomized before my eyes.\r<br />So why get rid of the option in the MCM?  Two reasons: a) most of the people that wanted it or used it have been rude about it and I&#39;m not inclined to do them any favors and b) I never should have given you the option anyway for the reasons given above.  THEREFORE, you can either adopt a &#34;Apollo knows best&#34; attitude, or a &#34;I don&#39;t like this but I&#39;m not going to be a jerk about it&#34; attitude or finally JUST DON&#39;T INSTALL THE MOD BECAUSE IT COMES WITH KNOCKBACKS AND NO AMOUNT OF WHINING WILL CHANGE MY MIND.  Those are all acceptable reactions to this feature.\r<br />\r<br />&#34;BUT THE KNOCKDOWNS ARE UNFAIR AND ANNOYING AND HAPPEN ALL THE TIME AND NOW I CAN&#39;T USE MY MELEE CHARACTER&#33;&#34;\r<br />Your continuous whining will not be the warm tropical breeze that melts my icy heart.  Or the cool wind that chills my fiery heart.  If you are unable to use melee against DCO dragons, you&#39;re proving that a bad AI is smarter than you.  Personally, one of the main characters I play is a twohanded and archery character, and I very often run up to dragons and start swinging.  The trick is to be smart about it - be prepared for breath and bite attacks, be prepared to block when they land/takeoff/tail slam and everything&#39;s chill.  I personally believe it is way too easy to get around the knockdowns by simply blocking, because I hardly ever get knocked down anymore in my games.  You have options.\r<br />\r<br />&#34;What is the difference between ASSAULT 2.0 and Deadly Dragons&#39; Assault feature?&#34;\r<br />ASSAULT 2.0 is meant to be an across the board improvement to the original Assault.  First of all, with regular Assault, dragon attacks are only based on time, where after the time runs out, an attack is guaranteed immediately.  The problem with this is that if you consider how time works in Skyrim, the majority of your &#34;time&#34; is spent sleeping or fast traveling.  This means you become accustomed to fast traveling somewhere and immediately fighting 3 dragons.  Beyond that, if you have a save BEFORE an attack occurs, you can always predict exactly when the attack will occur and can fast travel wherever you want in preparation, meaning you can completely control the environment where you fight the dragons.  In short, the likelihood that you will face a dragon while actively wandering and being genuinely surprised by it is incredibly low.  DCO&#39;s ASSAULT uses a timer, but also a random chance.  Now, even if you have a save right before an Assault, it probably won&#39;t happen the next time if you reload to it, and maybe a few minutes later.  Secondly, DD Assault dragons are simply spawned in above your head.  DCO&#39;s Assault dragons fly in from a distance, and immediately start playing out a preprogrammed, generally devastating strategy.  Finally, DCO&#39;s dragons are less likely(if not impossible) to spawn in interiors because they require somewhere to fly in FROM in order to activate.\r<br />\r<br />&#34;Why do you not recommend Ultimate Dragons?  It&#39;s because you&#39;re jealous, right?  Tktk is just better than you and you&#39;re throwing a tantrum.&#34;\r<br />If you&#39;ll notice, I heavily feature mods I endorse in my descriptions, videos, and mod lists.  Tktk is a darn good modder, and he has my respect.  THAT BEING SAID I hate Ultimate Dragons.  So much potential.....but ultimately a broken exercise.  a) the dragons are easier because they land and are motionless for MASSIVE lengths of time, b) one of the animations(the spin) is universally considered ridiculous, and c) the new animations have a tendency to &#34;lock up&#34; the dragon for brief periods of time(last I checked).  Also, while DCO and UD are TECHNICALLY compatible, like tktk says you&#39;re going to get a LOT of weird behavior because DCO&#39;s AI system requires forcing animations that are now setup in wholly different ways than DCO expects causing aberrant behavior.  So it&#39;s really a choice between the two, and I&#39;m always going to go with DCO over UD.  It&#39;s that simple.\r<br />\r<br />&#34;Ummmm. what is this &#34;Soul Curse&#34; thing?  WHAT HAVE YOU DONE TO ME???&#34;\r<br />\r<br />**DEAR GOD SPOILERS**\r<br />\r<br />[color=#444444]Soul curse is a high tier Limit Break wherein a still alive dragon curses its soul then forces you to absorb it.  Consider it to be the Kamikaze of LBs.  The only way to get rid of the curse is to get rid of ALL of your dragon souls.  You can do this by spending them on shouts, using Deadly Dragons to convert the souls to perks, or use Dragon Soul Relinquishment.  You may also use the console to temporarily remove then re-add all of your dragon souls.  When DCO detects that all of your souls have been used, it will remove the curse(this may take up to 30 seconds).[/color]\r<br />\r<br />&#34;WHAT???????  THAT IS TERRIBLE&#33;&#34;\r<br />Yeah, it really is.  It&#39;s a rare high level Limit Break.  Deal.\r<br />\r<br />&#34;Dragons are running away from me, like, a lot bro.  The first time it happened I thought &#34;Ok, so he knows who wears the pants around this Nordic province.&#34;  But then then second time it happened I was all like &#34;Ok he can fly away and I can....yell at him.  That&#39;s annoying.&#34;  And then the fiftieth time it happens I&#39;m all like &#34;BRO FOR GOD&#39;S SAKES FIX THIS OR I WILL KILL THE WORLD WITH MY BARE HANDS.&#34;  So.  What&#39;s up with that?\r<br />Wow.  Yeah, dragons run away now sometimes.  I don&#39;t know what&#39;s making them do it either, they just...do. After a lot of thought I&#39;ve decided I actually like this feature, so there are no plans to remove it.  The dragon will be back - and it will be ANGRY.  Be prepared.\r<br />\r<br />&#34;How did you do all of these things?  THIS DOESN&#39;T MAKE SENSE.  Are you a sorcerer?&#34;\r<br />The concept is a very simple one - other mods that try to make a better AI fail because they work within the constraints of the hardcoded AI: they don&#39;t actually change how the AI thinks, just how it weighs its choices.  So while a different dragon AI mod may feature dragons that land/fly/divebomb more or less often, it still will follow the same basic pattern of rules, which a player can easily predict.  My mod recognizes that the game&#39;s AI is hardcoded, and instead of messing with the few parameters Bethesda has given us, I throw a FRIGGIN WRENCH into the system by forcing dragons to play animations that they have no business doing at the time, forcing them to constantly reevaluate their situation while I&#39;m constantly forcing them to play tactics they can&#39;t even imagine.  The point is - I do NOTHING to change the AI at all, but in doing so change how every dragon acts.  The goal of any AI is to give the APPEARANCE of intelligence, nothing more, and my mod succeeds by leaps and bounds in that regard.  Finally, when all else fails, I take total control of the dragons and have them play entirely by my set of rules(MOOSE AND SQUIRREL is a good example of this).\r<br />\r<br />&#34;I&#39;m very meticulous and pay very close, almost annoyingly close, attention to detail - because of these wonderful qualities, I happened to notice that when I kill a dragon in mid-air, it pauses for a split-second before it ragdolls and falls to the ground.  HOW DO YOU EXPLAIN YOUR FAILURE??  YOU HAVE BROUGHT SHAME AND DISHONOR ON YOUR HOUSE.&#34;\r<br />How it works: When the dragon gets below .1% health in mid air, I immediately force it into its &#34;killmove state&#34; then right back out of it again, then murder-kill it in order to force the ragdoll effect.  Unfortunately, when the actor dragon dies, the ragdoll is substituted in its place.  Due to this it loses all of its inertia and simply goes *plop* to the ground. In order to combat this drawback, I added the module MOMENTUM, which upon mid air death calculates the dragon&#39;s heading, guesses at its velocity, applies a coefficient I pulled out of my butt to make up for the mass of the dragon, and then applies Havok force in the amount of an extremely rough guess to the ragdoll, forcing it to continue on its path. It has the space of 1/10th of a second to do all of this. What you are noticing is the 1/10th second necessary to calculate the momentum. And it doesn&#39;t get faster than that. That&#39;s why I laugh like Agent Smith every time I pop a dragon out of the sky. Because I know in the background my thousand monkeys just successfully guessed at something previously considered impossible.\r<br />\r<br />[center][img]http://static-1.nexusmods.com/15/mods/110/images/32597-1-1362288765.jpg[/img][/center]\r<br />\r<br />&#34;Will this break my computer/Skyrim/life?&#34;\r<br />No.  Not even if you ask really nicely.  This mod should be compatible with everything, including all of your favorite dragon mods.  Furthermore, I have yet to receive a report that this mod has caused a serious issue since the beta testing.  If your computer breaks, then this probably didn&#39;t do it.  If it DID do it and you KNOW that it did and you&#39;re not just GUESSING that my mod did it, STEVE, then tell me right away so I can fix the problem.\r<br />\r<br />&#34;But DCO totally [i]DID[/i] break my game&#33;  I installed it and X doesn&#39;t work, and when I uninstall it, X totally DOES.  This is an awful mod and you should be ashamed.  I plan to travel back in time to order your parents to never reproduce.&#34;\r<br />Before you post your &#39;bug&#39;, realize this: 99.99% of bug reports have been determined to be user error - either they didn&#39;t read this description, or installed it in the wrong place, made a critically n00btastic mistake in modding, or are lying about narrowing down DCO as the only reason for their issue because they TOTALLY did something else to their Skyrim in the meantime.  Those are just the most common user screw-ups, and there have been MANY.  YOU ARE NOT A SPECIAL AND UNIQUE FLOWER.  If you have an issue, troubleshoot it ON YOUR OWN for a bit, study up on how to properly mod, read this description, search the forum for an answer, and if you STILL have an issue, then please let us know.  Because by stopping by and telling us about your issue that YOU CAN TOTALLY FIX ON YOUR OWN BY TAKING TWO SECONDS TO LOOK IT UP, you&#39;ve just placed a big neon blinking &#34;I&#39;m With Stupid&#34; sign above your head.  This will frustrate myself and my team, and you&#39;ll quickly learn why the forum has earned the nickname &#34;The Rancor Pit&#34;.  And then moderation will have to step in and tell myself and my team to stop acting like children, and we&#39;ll be totally sorry and totally mean it, and then TOTALLY DO IT AGAIN BECAUSE WE HAVE ZERO SELF CONTROL.  So for our sake and the sake of the Nexus staff, do your homework before accusing this mod of having a bug.\r<br />\r<br />&#34;Why did you get rid of locational damage?  Ultimate Dragons does it, why can&#39;t you?&#33;  Loser.&#34;\r<br />Locational Damage in skyrim doesn&#39;t work.  I&#39;ve tried it.  The way it &#34;works&#34; is that when the object is hit by an arrow/sword/Schlong of Skyrim, a script calculates where the player is in relation to the hit object, and from that calculates which side was hit.  What this means is that this system fails ALL THE TIME.  Imagine if instead of a dragon, it&#39;s really a box.  Sometimes, you&#39;ll fire at the wings, but it&#39;ll register it as a front hit.  Other times, you&#39;ll fire at the tail, but because you moved to the side a bit too much after firing the arrow, or you have script lag, the hit shows up on the side as well.  I didn&#39;t like how unreliable and unrealistic it was, so I got rid of it.\r<br />\r<br />Hello, I, Mr.(Or Ms. - stop being sexist you video gamer you) Meticulous, am back to be myself(read: annoying) again.  I noticed that when I kill an undead dragon whose skin has already melted away before it died(yeah, they do that now), when I go to absorb its soul, the body disappears for a split second, then reappears.  THIS GAME IN WHICH I&#39;M FIGHTING A TWO TON DRAGON THAT CAN FLOAT LIKE A HUMMINGBIRD AND FLY BY FLAPPING ITS WINGS EVERY OTHER SECOND IS NO LONGER REALISTIC BECAUSE OF YOU.\r<br />I recognize that this occurs, and I currently can&#39;t do anything about it without completely reworking how a soul is absorbed.  I am planning to rework the soul absorption process and take it over entirely in a future version, but bear in mind when I do DCO will no longer be compatible for those without Dawnguard or Dragonborn(because of the whole Miraak stealing souls thing, if I completely shut down all vanilla soul absorption and create my own way, I need to also have Miraak doing his thing, which means that you&#39;ll have to have the DLC if I can&#39;t find a better way).\r<br />\r<br />Is this mod compatible with [insert your annoying mod choice here] mod or [insert the only scene you ever play, the one where you and Aela go hunting and get foxy under the sleeping tree, and then you tell your friend he has to leave the room because you need some alone time] Skyrim event?\r<br />Short Answer: Yes, this mod is compatible.  Stop asking.\r<br />Long Answer: Look at the download counter at the top of the page: if this mod was incompatible with something, I WOULD KNOW ABOUT IT.  As far as I know, with VERY limited exceptions, THIS MOD DOESN&#39;T HAVE INCOMPATIBILITIES.  But Skyrim itself is a big and buggy place, so we honestly don&#39;t know until [i]you[/i] try it.  So don&#39;t ask us.\r<br />\r<br />I like this part of the mod, and this part of the mod, and this part of the mod, BUT THIS PART OF THE MOD RUINS EVERYTHING ARE YOU TRYING TO KILL ME?&#33;?&#33;?&#33;?  MAKE A VERSION WITH THIS PART THAT DISGUSTS ME NOT IN IT OR I WILL BURN YOUR FAMILY IN THEIR SLEEP.\r<br />That&#39;s not really a question either.  In case there was some confusion, this is the Frequently Asked [i]Questions[/i] section, not Frequently Made Threats On My Dog section.  Your puppy-hating tendencies aside, unfortunately until I make this mod actually modular, which I plan to, it&#39;s pretty much all or nothing for now.  It would literally just be too much work given the massive amount of updating I plan to do in such a short timespan.  You would cut my progress into a tenth of what it should be.  So for the sake of everyone, BE PATIENT.  And you should probably see somebody about that puppy thing.  That&#39;s just messed up, man.  You&#39;ve got issues.\r<br />\r<br />&#34;Does this make dragon fights harder?&#34;\r<br />Yes, yes GOD YES.  Dragon fights are more unpredictable now, and dragons land in an injured state more often where they will try to chase you down on foot.  The good news is that you can ground them more often, the bad news is that it will be rare that you ground them for a significant period of time.  MOOSE AND SQUIRREL also means that dragons will use squad tactics to bring you down, and with every dragon added, tactics significantly improve.  Again, this does not modify their attributes, nor does it give them a host of new powers(well, not many anyway), it just makes them act more unpredictably and react better to their surroundings.  But trust me, this is more than enough to allow them TO KILL YOU DEAD DEAD [i]DEADSIES[/i].\r<br />\r<br />&#34;Help&#33;  Because of you I can&#39;t absorb dragon souls&#33;  WHY DID YOU DO THIS TO ME??  WHAT DID I EVER DO TO YOU?&#33;?  ARE YOU [i]MAD[/i] WITH POWER?&#33;?&#33;  YOU DISGUST ME.&#34;\r<br />My mod did not make this happen.  It&#39;s just that simple.  Something else is horribly, horribly wrong with your game, and I can&#39;t help you with that.  So don&#39;t ask me.\r<br />\r<br />[center][youtube]_ENi2oTCAm8[/youtube][/center]\r<br />\r<br />&#34;You didn&#39;t answer the awesome and amazingly insightful question I asked in the forum, can I please send you a private message asking you the same question again and calling you a jerk?  Thanks, I love your mod&#33;&#34;\r<br />*facepalm*  If your question didn&#39;t get answered in the forum, there&#39;s a reason for it.  Attempting to mod skyrim is a process which requires understanding and patience, and you seem to be severely lacking in both.  NEVER PM ME WITH YOUR TROUBLESHOOTING ISSUE.  At best, I will mislead you into destroying your game(ACTUAL CONVERSATION: &#34;Dude can you help me with X?&#34; &#34;Sure, just delete &#39;Skyrim - Miscellaneous.bsa&#39;, It&#39;s been known to cause bugs&#34;) and at worst it will end in swearing.  If this concept is too difficult for you to comprehend, then Vanilla skyrim is your game.  Actually, scratch that, HOPSCOTCH is too complicated for you.\r<br />\r<br />&#34;How much more are you going to do before this mod is finished?&#34;\r<br />Dragon Combat Overhaul is complete.  No further updates are planned.\r<br />\r<br />&#34;Where in my load order should I put this?  I don&#39;t want to overwrite my nude Jessica Alba mod with those cute red stockings and lingerie I love so much&#33;  Have you seen that new mod with the stiletto heels that are just TO DIE FOR?  SHOES.  OHMIGOD, SHOES.&#34;\r<br />Short Answer: I have no freaking idea(but you MUST load it before Dance of Death - I do know that)\r<br />Long Answer: It&#39;s probably smartest if you load it BEFORE your other dragon mods(and again, load it before Dance of Death). But I don&#39;t think it matters. If the dragon still gets injured at the magical 35% mark, you know something&#39;s been overwritten.  And I all-but-guarantee that your nude Jessica Alba will be safe.  So will the shoes.\r<br />\r<br />&#34;Will you ever write a normal readme for this awesome mod?  I only ask because I feel like you just melted part of my brain.  Ow.&#34;\r<br />No.  And my parakeet is offended that you would ask.\r<br />\r<br />\r<br />I need a parakeet.\r<br />\r<br />\r<br />[center][youtube]5Cx7jzq2Bx4[/youtube][/center]\r<br />\r<br />\r<br />\r<br />[b][size=5]THE WALL OF SHAME: DISCONTINUED FEATURES[/size][/b]\r<br />\r<br />IT&#39;S EASY MM&#39;KAY\r<br />Every shot at a dragon while it is flying has a VERY low random chance of killing a dragon outright once a dragon has been injured.  That&#39;s all.\r<br />FINISH HIM\r<br />If you do massive, massive damage to a dragon while it is injured and on the ground, it has a 50% chance to outright die epically.  Because if you can do that much damage the dragon deserves a painful death.\r<br />SNAIL TRAIL\r<br />Dragons now leave behind some walls of fire/frost/shock in their wake. It&#39;s not much for now, we&#39;ll see how you guys like it and I might make it bigger.\r<br />LITTLE TORTILLA BOY\r<br />You get a small chance to immediately kill a dragon if it is at full health and you attack at close range.  Because you were busy catching butterflies and picking flowers when the dragon landed on your head and INTERRUPTED YOUR FROLIC.  Freaking jerks.\r<br />THE WINGS, MAN, GO FOR THE WINGS&#33;\r<br />This module adds locational damage and realistic wing injury.  If the total damage done to the wings of the dragon exceeds 50%, the dragon can&#39;t fly anymore.  EVER.  Furthermore, if you hit a dragon in the back, you get an extra chance to injure the dragon briefly.  If you hit a dragon in the head/shoulders...well, Willy Wonka says it best:  \r<br />\r<br />[youtube]M5QGkOGZubQ[/youtube]  [youtube]QwnFBmDpfK0[/youtube]\r<br />\r<br />MINE MINE MINE MINE MINE MINE MINE MINE MINE MINE MINE MINE\r<br />Dragons will absorb each others&#39; souls to regain health when one of them dies.  Because SUCK IT.\r<br />TACTICAL REGEN\r<br />When in combat with a dragon, it&#39;s always just attack attack attack.  Dragons can&#39;t block or heal either, so they literally have ZERO defenses.  But they can recharge their juices.  Dragons may land out of combat and regenerate their health.  Hit them to stop them&#33;\r<br />LIU KANG\r<br />The player may do a finishing move where he/she turns into a dragon and kills the bejeezus out of the other dragon.\r<br />YOU CAN&#39;T TAKE THE SKY FROM ME\r<br />Massive damage(ie. &gt; 8% of dragon&#39;s current health) causes immediate and relatively lengthy injury to the dragon, immediately grounding it.  This can be repeated as often as you like(actually up to 8 times, then the dragon FREAKING DIES DUDE BECAUSE YOU KILLED IT IN 12 SHOTS).\r<br />I.M.W.U.S.S.Y.S.(tm) - IT MAY BE WHY UNCLE SHEO SAYS YOU SUCK\r<br />This optional module disables dragon knockdown effects for all but the third tail slam of &#34;Triple Threat&#34;, and implements stagger effects in their place.  Why anybody would ever want this, I will never understand.  A dragon is the size of a freaking pickup truck, and it slams down right in front of you at 35 mph?  Yeah, that&#39;d ruin your day.  So go, feel free to play in a world where a 2 ton dragon can land on your head and your 4&#39;10 wood elf can immediately start going to town on its belly.  To Wussify(tm) your Skyrim just download the wussy version in regular or Dragonborn flavor.  I refuse to speak any more about this module out of sheer spite.\r<br />\r<br />\r<br />\r<br />[b][size=5]REVIEWS[/size][/b]\r<br />\r<br />\r<br />[center][b][size=3]FEATURED ON:[/size][/b]\r<br />\r<br />[url=http://www.pcgamer.com/2012/10/28/the-25-best-skyrim-mods-2/][img]http://i.imgur.com/t2BsR.jpg[/img][/url]\r<br />\r<br />\r<br />[img]http://i.imgur.com/m24Q6.png[/img][/center]\r<br />\r<br />[center][youtube]xwwKvBCs-VM[/youtube]      [youtube]XqJuTBIwzWA[/youtube]\r<br />[youtube]EZdx4SzM4gI[/youtube][/center]\r<br />\r<br />\r<br />\r<br />[b][size=5]HIGHLY RECOMMENDED MODS[/size][/b]\r<br />\r<br />These mods carry my highest recommendation.  They have been thoroughly tested in my game, and I guarantee they will work with all of my mods.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/336241/?]Anything by LifesToRock[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/3959191/?]Anything by EnaiSiaion[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/1614960/?]Anything by 3jiou[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/3841389/?]Anything by tktk1[/url]\r<br />[url=http://erkeilmods.altervista.org/skyrim/category/news/]Anything by Erkeil[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/10168/?]ApachiiHair[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17802/?]Climates of Tamriel[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/1002/?]Jaysus Swords[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/18916/?]Lanterns of Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/24445/?]SPERG[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/3222912/?]Any of Immersive Sounds[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/30947/?]Dead Body Collision[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/12977/?]Immersive Patrols[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/18799/?]Radiant Potions and Poisons[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/26017/?]Destructible Bottles[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/22745/?]Footprints[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/33482/?]MinimalHUD[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27644/?]Immersive Weapons[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/10251/?]Silverlight Armor[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/40216/?]Stormlord Armor[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/25846/?]TERA Armor[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/33292/?]Unique Uniques[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/40491/?]Revenge of the Enemies[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/15599/?]Fortified Dawnstar[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17168/?]Skyrim Bigger Trees[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/52019/?]Follower Commentary Overhaul[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/49036/?]Immersive First Person[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27043/?]ELFX[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/41634/?]DVA[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/9717/?]Better Vampires[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/14353/?]Improved Dragon Shouts[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/10906/?]Dance of Death[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/15524/?]AFT[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/13268/?]WATER[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/19718/?]Bloody Facials[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/60/?]Enhanced Blood[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17214/?]No Spinning Death Animation[/url]\r<br />\r<br />We will always remember our fallen brother, Cabbage in a Pot.  Rest well, sweet prince.\r<br />\r<br />\r<br />\r<br />[youtube]di7fVCB6boU[/youtube]\r<br />\r<br />[img]http://i.qkme.me/3t9uq7.jpg[/img]\r<br />\r<br />\r<br />\r<br />[b]GLOWING TESTIMONIALS:[/b]\r<br />\r<br />&#34;Is THIS how you spent the weekend?  You need a new hobby.&#34; - My Mother\r<br />\r<br />&#34;I made a video.  Can I be in the description now?&#34; - TWarrior\r<br />\r<br />&#34;You have a funny accent&#34; - Me, watching TWarrior&#39;s video.\r<br />\r<br />&#34;I want more grunting.&#34; - Nofumasa\r<br />\r<br />&#34;Is this a texture mod?  Can you make me a black and white dragon?  Or a dragon that looks like Hulk Hogan?  Why don&#39;t you have any pictures?  I really like retextures.  I want a fuschia dragon.&#34; - The internet people that severely disappoint me and probably didn&#39;t read this description.\r<br />\r<br />&#34;I don&#39;t understand a lot of what you wrote... and I think you might be insane.&#34; - Fishbiter\r<br />\r<br />&#34;If you keep this up I&#39;m gonna need a V.A.T.S mod to deal with these lizardbrains. Did I say thank you?&#34; - Dogier, complaining that the game is too hard now.  WHINE WHINE WHINE.\r<br />\r<br />&#34;DOHVAKIIN&#33;&#33;  DOHVAKIIN&#33;&#33; YA DA DA DA DA DAAAAAAAA&#33;&#33;&#33;&#34; - The voice in my head while coding this\r<br />\r<br />&#34;you were definitely high when you wrote this&#34; - OriginsMaster\r<br />\r<br />&#34; Drag. I love you dearly for being my nuclear flying monkey of death. But one day somebody&#39;s gonna be sensitive and get your a** banned. Let&#39;s try to get to v8 before that happens.&#34; - Me, rolling on the floor laughing my ass off to Dragganax.  (HE WROTE HIS OWN WAY INTO THE GLOWING TESTIMONIALS.  SOMEBODY, THROW A PIANO IN HIS GENERAL DIRECTION.)\r<br />\r<br />\r<br />&#34;I don&#39;t see a difference&#34; - My roommate\r<br />\r<br />&#34;Why did you recommend a hair mod in a dragon mod?&#34; - Dorkykong (BECAUSE I CAN)\r<br />\r<br />&#34;I wrote something very long.&#34; - IronhideLivesOn\r<br />\r<br />&#34;You appear...unhinged.&#34; - Normal people reading this, whoever they are\r<br />\r<br />&#34;What kind of **** mod is this&#33;? I attacked a dragon. And immideatly I get ****ing insta killed by a ****ing meteor?&#33; bull****.&#34; - ChristianJohan\r<br />\r<br />&#34;DOHVAKIIN&#33;&#33; DOHVAKIIN&#33;&#33; NOT A SINGLE SARDINE&#33;&#33;&#33;&#34; - Teh Masterer(OH so that&#39;s what they were saying.  It all makes sense.  Wait...But...ow....OW...I think you broke my brain)\r<br />\r<br />&#34;Is this mod compatible with my &#39;ladies of the night&#39; mod?  Because I don&#39;t want to download it if it isn&#39;t.&#34; - More internet people that severely disappoint me and also didn&#39;t read this description\r<br />\r<br />&#34;First, you complete every single questline and sidequest in Skyrim, saving the main quest till last. When you go to Sovngarde, you must bring with you a sample of moon sugar, two and a half mammoth tusks, the torchbug in a jar, and a basic knowledge of the ENTIRE FREAKIN&#39; illusion school of magic. When you fight Alduin, throw the moon sugar into his face precisely 4 minutes and 2 seconds into the fight. While he is busy taking a trip through the wonders of time and space, prop his mouth open with the half mammoth tusk. Stick the other two into each of his nostrils, because why not. Enter Alduin&#39;s mouth, using the torchbug to light your way. Once you find your way into his stomach, make a raft out of the bodies of his consumed victims. Now, cast every single illusion spell in the game at once while standing on the raft and chanting a nursery rhyme in a sadistic manner. The combined force of all of the spells and the chant will break the normal dragon immunity to illusion, allowing you to control Alduin. Now, all you have to do when you don&#39;t want a normal dragon to use his death animations is use Alduin to kill said dragon. No mere normal dragon would dare disgrace their leader by using his unique death animation in his presence&#33; If they did, he would eat them on the spot. So there you have it, problem solved.&#34; - Yodah, who has earned the right to be here.  Uncle Sheo is proud.\r<br />\r<br />&#34;Separate question.  Is there a way to turn off the dragon death effect that occurs when you kill them with the Wabbajack?  I don&#39;t like missing out on the dragon bones and scales, or any loot it&#39;s carrying, plus my GPU has a seizure whenever all those items explode all over the place.  This was especially problematic when a dragon assault occurred in Whiterun.  There were 5 dragons total, and the Wabbajack was the best weapon I had to kill them.  But now there&#39;s random garbage all over the streets.&#34; - Frozenwolf160, who is clearly misusing Uncle Sheo&#39;s gift.\r<br />\r<br />&#34;This was a lot funnier than I felt it should have been.&#34; - AK151\r<br />\r<br />&#34;Meme, meme, meme, meme, CAN I PLEASE BE IN THE F***ING GLOWING TESTIMONIALS SECTION NOW????&#34; - Sevencardz, who made it.\r<br />\r<br />&#34;ANIMATED GIFS&#34; - EtimSoru\r<br />\r<br />&#34;File of the month.&#34; - Everybody Else.\r<br />\r<br />\r<br />\r<br />[img]http://ic.pics.livejournal.com/robinbridges/8053554/73293/73293_600.jpg[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[youtube]TyHeep65RxY[/youtube]\r<br />...What I think is happening behind your computer every time you ask me if this mod is compatible.\r<br />\r<br />\r<br />[b][size=5]SHAMELESS ADVERTISING FOR MY FRIENDS[/size][/b]\r<br />\r<br />Millions of pageviews, guys; I gotta do something with it.  Help me make these guys famous.\r<br />\r<br />\r<br />[center][i][size=6][color=red]Driver Friendly&#33;[/color][/size]\r<br />(Screaming and taking off your bra is optional, but recommended)[/i]\r<br />\r<br />[youtube]MOrAic-vuoM[/youtube][/center]",
  "categoryId": "77",
  "version": "FINAL.3",
  "author": "ApolloDown",
  "createdUnix": "1362122423",
  "updatedUnix": "1422051810",
  "containsAdultContent": false,
  "uploadedBy": "Apollodown",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144263",
      "name": "Dragon Combat Overhaul",
      "version": "FINAL.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91",
      "fileName": "Dragon Combat Overhaul-32597-FINAL-3.7z",
      "uploadedUnix": "1422051810",
      "modVersion": "FINAL.3",
      "virusScanUrl": "https://www.virustotal.com/file/6e7e5e4ae60e7a5f95ed0e649c1709e6703849cbb4c87172866fb3f83ea64d02/analysis/1422051843/",
      "changelogHtml": " The undead Dragon Limit Break effect where the sun goes down has had the &#34;no Death Dispel&#34; checkbox checked.  This should prevent issues where the condition becomes permanent. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Combat%20Overhaul-32597-FINAL-3.7z?fid=1000144263&ttl=1535809179&ri=8192&rs=8192&setec=38beb87f231095111cd16b30df2b911f"
    }
  ]
}