{
  "modId": 32608.0,
  "modName": "Alchemy and Atronach Forge Guide Books",
  "summary": "Adds a weightless alchemy book. Does not contain all recipes, only those I have found useful, with multiple effects. Also adds two guide books for the Atronach Forge in Winterhold containing all the recipes.",
  "descriptionHtml": "Description\r\n===========\r\nAdds an in-game Alchemy guide book that has multiple effect potion recipes. The book is intended for useful potions/poisons and does not focus on profit. (The recipes are from the vanilla game and Hearthfire DLC ingredients list.)\r\n\r\nAlso adds two in-game Atronach Forge guide books. Whilst there are recipe sheets available as random drops, they aren\\'t easy to collect. Also some are written in Daedric, which requires hassle in translating. These guide books aim to make the Atronach Forge a more interesting and useful location to visit early/mid game for mages.\r\n\r\nThe first volume of the Atonach Forge guide, details all the recipes available without a sigil stone (See below for spoiler on obtainment of sigil stone and location of forge)\r\nThe second volume of the Atonach Forge guide book, details all the recipes that do require a sigil stone. This book contains the recipe written in Daedric and the translation.\r\n\r\nAll of these books have no weight value, thus allowing you to keep them on you at all times for reference with no penalty. (Useful for checking what components are required for any items you may want in future.)\r\n\r\n\r\n\r\nLocation\r\n========\r\nThe Alchemy book is freely available from Whiterun Dragonsreach, where it has been placed on the Alchemy crafting station.\r\n\r\nThe two Atronach Forge guide books are also freely available from Whiterun Dragonsreach, where they have been placed on the Enchanting crafting station.\r\n\r\nThere is also a copy of both Atronach Forge Guide books available on the floor near the Atronach forge itself.\r\n\r\n\r\n\r\nReason and lore for the mod\r\n===========================\r\nAlchemy tends to be under used early in-game when it is of most help due to the lack of potions and poisons knowledge. Later in game most spells, enchantments, perks, or armour rating make alchemy less relevant.\r\nAlso unlike smithing if your inventory has no ingredients, then using a workstation will not show you anything. This means unless you have memorised what ingredients you need, or made a list. You will have no clue where to go harvesting, or what ingredients you specifically need to purchase.\r\nThe guide book aims to give you, some of the most useful recipes to use early on in your play through (without having to google them). The guide does not tell you what every ingredient does, neither will it cover all craftable potions, so there will still be discoveries to make.\r\nWith regard to whether it is lore freindly or not. I see no reason why someone would not have published an alchemy guide book. As for the placement of the book and free availability. The whiterun mage always seems to be trying to recruit me to Winterhold college and better my mind, so a logical choice to let me borrow his old school books.\r\n\r\nSimilarly with the Atronach Forge. You don\\'t usually encounter this area straight away in the game, as such you are unaware of any useful items you could craft yourself there. Even after discovery, the recipes first available discourage use of the device, as these recipes are only for summoning hostile atronachs. Looting the random drop recipes in the wilds, is of no real help either. As you are unlikely to have them all, prior to finishing the game.\r\nLucily our favourite Whiterun mage has a copy of the updated Atronach forge recipe books. This allows you to see what you can potentially craft there and make a start on gathering the ingredients.\r\n\r\n\r\n\r\nRequirements\r\n============\r\nNone - although some of the ingredients listed in the book are only available with Hearthfire.\r\n\r\n\r\n\r\nInstallation Instructions\r\n=========================\r\nInstall using NMM.\r\n\r\n\r\n\r\nUninstallation\r\n==============\r\nDrop books from your inventory, save the game.\r\nUninstall mod using NMM.\r\nDelete.\r\n\r\n\r\n\r\nIncompatabilities\r\n=================\r\nNone (this mod was made using the creation kit no scripts were used, the books are new items and no original items were changed)\r\n\r\n\r\n\r\nMy other Mods\r\n==============\r\nIf you like this mod you may also like be interested in my other mod below.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/32623]Improved Atronach Forge[/url]\r\nAdds more recipes that do not require the sigil stone. Notably this mod has more Staffs,Conjuration spell tomes, master robes of conjuration, Potions and Poisons, etc.\r\nIt also amends the fire, frost and void salts recipe to give 10 items instead of 1, making it slightly more useful for alchemy.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/32623]Improved Atronach Forge[/url]\r\nAdds more recipes to the Atronach Forge that do not require the sigil stone. Notably this mod has more Staffs, Conjuration spell tomes, Potions and Poisons, etc.\r\nIt also amends the original fire, frost and void salts recipe to give 10 items instead of 1, making it slightly more useful for alchemy.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/34743]Nightingale Hall and Twilight Sepulcher - Improved[/url]\r\nUpgrades Nightinagle Hall upon completion of the Thieves guild questline, to a more fitting home for Karliah. Adds crafting stations, general gold silver bling, weapons racks, mannequins etc. Also adds the portal to the Inner sanctum for changing your nightingale powers.\r\nTwilight sepulcher moved the portal door that appears after completing the thieves guild questline back to the end of the dungeon. (ie jumping down the well to get into the inner sanctum). The portal door was moved as it made no sense that it was placed at the start of the dungeon upon completion.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/38055]Full four item effect Alchemy and Smithing fortify skill on one ring[/url]\r\nAdds a crafting ring which has the combined total of four items worth of alchemy & blacksmithing enchants (~120%). The ring also comes with a large boost (~6000) to carryweight to make crafting and selling easier withing towns.\r\n\r\n\r\n\r\nThanks\r\n=======\r\nThanks to Bethesda for creating Skyrim and the creation kit.\r\n\r\n\r\n\r\n\r\n***  SPOILER  ***\r\nSigil Stone obtainable at conjuration skill level 90, after a quest from one of the College mages.\r\nAtronach forge located beneath the college of Winterhold in a area known as the Midden.\r\nMany of the ingredients required by the recipes are found within the midden, such as brooms, salt, and various ingots (hint check the ceiling rafters for ingots). These ingredients are all there in the vanilla game, no ingredients are added by this mod.",
  "categoryId": "78",
  "version": "1.1",
  "author": "ClackingKeys",
  "createdUnix": "1362171788",
  "updatedUnix": "1363624580",
  "containsAdultContent": false,
  "uploadedBy": "ClackingKeys",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014225",
      "name": "AlchemyAndAtronachForgeGuideBooks 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "AlchemyAndAtronachForgeGuideBooks 1_0-32608-1-0.7z",
      "uploadedUnix": "1362170126",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5973ad7385dee2b01892fc1ea46bc9ba7c09e04aaf60963816fc77993024ef77/analysis/1407446354/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AlchemyAndAtronachForgeGuideBooks%201_0-32608-1-0.7z?fid=1000014225&ttl=1535809197&ri=8192&rs=8192&setec=af52056878e5d1a40c3a3e3cb184c52a"
    },
    {
      "fileId": "1000018475",
      "name": "AlchemyAndAtronachForgeGuideBooks 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "AlchemyAndAtronachForgeGuideBooks 1_1-32608-1-1.7z",
      "uploadedUnix": "1363624580",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/34575191df8e9d96840d48d38e89f880b98828eee13c4c7cfe4201e2a3e465a2/analysis/1407476111/",
      "changelogHtml": " Fixed some typos (namely Flame sell tome to Flame spell tome) <br/> \n Changed some of the heading fonts in the atronach books, to distinguish them a little more from the recipe ingredients. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AlchemyAndAtronachForgeGuideBooks%201_1-32608-1-1.7z?fid=1000018475&ttl=1535809197&ri=8192&rs=8192&setec=e22f12290d380d2908387a87b508af2b"
    }
  ]
}