{
  "modId": 32604.0,
  "modName": "DreamWorld Book 1",
  "summary": "This adds you dream world books for you to read if you like to read books.\r\nplayer.additem 26000d62 1\r\nYes i will remake another one with out any caps.And more of them but please leave it what it is.It is a really interesting book.I got my self and my friends even my lover be",
  "descriptionHtml": "What its really about.Storie about dragons in dreamworld alot of trouble is going on in DW(DW?) short for dream world.Also it has characters.Wich diffent characters has their own stories and their own stats wich is on my website.\r\n\r\nHow do i find the book or books?Just type the ID\\'s wich shown below\r\nbook 1\r\nplayer.additem 26000d62      I will remake the book so instead it wouldnt be from id.It will be in the chest for the remake one.For know use the id at the top.If i am incorrct please give me the real code.I have test it my self.it can be 26000d62 but it might be a diffent id code for you.If you know the id for everyone please comment me.\r\n\r\n\r\n\r\nIf your having problems please let me know.Also please do not take my characters or my world it belongs to me.-.-\\'\\' Thankyou\r\nPlease no mean comments thankyou.I am a beginner so this was an easy way for me to do for my first time.Instead of complinning please~!Give me advise cause...It wouldnt do you any good.Advise will be more necessary.\r\n\r\nAlso i aplosigse for the miss understood description.I got soo excited and wasnt thinking stright.And very tired.Yes theirs one file.But its a start.Meaning its my book that allows you to read for fun.Their will be more mods and more books of DW.I am a beginner so i do not know the creation kit that well.I do not know how to upload it correctly please comment.If you wish to comment and give me advise on how to upload it.That will be wonderful.Please this is my first mod so it was easy for me to do.For my first time.There for i will remake DWbook 1 for you guys to read it soo much better.Because it is an old memorie of a friend and i did when we were 14 and 9.So i will refix the book in the future and i hope you i understand what i\\'m mean.If not please read my comment in page 2.It has more explaining.Anyways hope you injoy my book and my mods thankyou.P.s i\\'m a female not a male.Also feel free to join my website.The link will be with the book of the description below when you veiw the book in the game.\r\n\r\n\r\n\r\nI will soon be working on more mods.Soon.If you know a modder that i can use for skyrim and its free,Please comment.\r\n\r\nFor know books will be an order.Cause its easy for me.There for i am a beginner.So its much easyier to start with the creation kit.\r\n",
  "categoryId": "27",
  "version": "DWB1",
  "author": "cynderorangel139",
  "createdUnix": "1362140033",
  "updatedUnix": "1362139291",
  "containsAdultContent": false,
  "uploadedBy": "cynderorangel139",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014116",
      "name": "CDW1",
      "version": "DWB1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "CDW1-32604-DWB1.rar",
      "uploadedUnix": "1362139291",
      "modVersion": "DWB1",
      "virusScanUrl": "https://www.virustotal.com/file/1698c0f168e8f62ba5832d1c11421ef2ebe68e7500a8104bbb2538d090813624/analysis/1407445746/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CDW1-32604-DWB1.rar?fid=1000014116&ttl=1535809192&ri=8192&rs=8192&setec=fe326cc3c701f7262c259998b83b4ad6"
    }
  ]
}