{
  "modId": 32611.0,
  "modName": "Blaze of Eventide - Traduzione Italiana",
  "summary": "Traduzione italiana di questa bellissima mod di mitchalek",
  "descriptionHtml": "[img=center]http://static.skyrim.nexusmods.com/images/621184-1349535829.jpg[/img]\r\n\r\n[center][size=6]Traduzione [color=green]ITA[/color][color=white]LI[/color][color=red]ANA[/color] per la mod \\\"[color=yellow]Bla[/color][color=orange]ze o[/color][color=red]f Ev[/color][color=orange]ent[/color][color=yellow]ide[/color]\\\"[/size][/center]\r\n[line]\r\n\r\n[center][b][color=red]ATTENZIONE![/color][color=cyan] Questa è solo la traduzione della mod, è necessario scaricare anche la mod originale.\r\nPotete scaricarla dalla pagina ufficiale ->[/color][url=http://skyrim.nexusmods.com/mods/25097]Blaze of Eventide[/url][/b][/center]\r\n\r\n[center][b][color=red]NOTICE![/color][color=orange] This is only the italian translation, you need the original mod too.\r\nYou can download it by the official mod page ->[/color][url=http://skyrim.nexusmods.com/mods/25097]Blaze of Eventide[/url]\r\nIF YOU LIKE THAT MOD ENDORSE IT!!![/b][/center]\r\n[line]\r\n\r\n\r\n\r\n[heading][color=red]RINGRAZIAMENTI PERSONALI[/color][/heading]\r\n[url=http://skyrim.nexusmods.com/users/621184]mitchalek[/url] - Per aver creato questa splendida mod che mi ha subito catturato e mi ha fatto decidere di provare a cimentarmi in qualcosa di più della sola caccia alla mod migliore\r\n\r\n[url=http://skyrim.nexusmods.com/users/1571960]Andre7890[/url] - Senza i suoi consigli e le sue informazioni non avrei neanche potuto iniziare. GRAZIE!!!\r\n\r\n[color=#55FF2A][center]TUTTI VOI CHE DECIDERETE DI INSTALLARE QUESTA TRADUZIONE!!![/center][/color]\r\n\r\n[heading][color=red]INFORMAZIONI GENERALI E CONSIDERAZIONI[/color][/heading]\r\n[b][color=yellow]Tutti i crediti vanno a [/color][url=http://skyrim.nexusmods.com/users/621184]mitchalek[/url] [color=yellow]che ha realizzato questa splendida mod. Se la mod vi piace mi raccomando andate sulla pagina della sua mod e fate click su \\\"ENDORSE ME\\\", a voi non costa nulla ma per un modder è una bella gratifica[/color][/b]\r\nNel tradurre ho cercato di farlo nel modo più possibile corretto e fedele all\\'originale, cercando allo stesso tempo di risultare chiaro. La traduzione ovviamente copre ogni singola parola o frase della mod e questo può avermi portato a fare scelte grammaticali o verbali che magari non tutti condivideranno, siete caldamente invitati a farmi notare se c\\'è qualcosa che non è stato tradotto correttamente o in maniera comprensibile, o se avete suggerimenti per migliorare la traduzione.\r\nHo inoltre deciso di tradurre tutta la parte di informazioni e descrizione del readme di mitchalek in modo da fornire qualcosa di un po\\' completo.\r\nFinché seguirò lo sviluppo di questa traduzione la numerazione delle versioni, per praticità vostra e mia, andrà di pari passo con quella della mod originale.\r\n\r\n\r\n[center][size=5][color=#55FF2A]SE SIETE CONTENTI PER\\\\E DELLA TRADUZIONE...\r\nBRACCIA AL CIELO E CLICCATE SU \\\"[i]ENDORSE ME[/i]\\\"!!! =P[/color][/size][/center]\r\n\r\n[heading][color=red]CARATTERISTICHE E DESCRIZIONE DELLA MOD[/color][/heading]\r\n[list]\r\n[*] Effetto fiamme reali.\r\n[*] Impronte fiammeggianti e sfrigolanti.\r\n[*] Ambiente circostante illuminato.\r\n[*] Effetto luminescente di notte.\r\n[*] Segue il giocatore (dal menu si può impostare come).\r\n[*] Sistema di evocazione ed effetti personalizzati.\r\n[*] Immunità al danno da fuoco - al contrario il fuoco lo cura.\r\n[*] Vendicatore fiammeggiante (ustiona chi lo attacca).\r\n[*] Può esplodere infliggendo ingenti danni (il comando viene gestito dal giocatore).\r\n[*] Totale compatibilità con Convenient Horses v4.4 (armature, comportamento, ecc...).\r\n[/list]\r\n\r\nBlaze è una fiammeggiante cavalcatura evocabile. Diversamente da altri, Blaze ha meccaniche di evocazione personalizzate, in modo da renderlo permanente nel mondo di gioco e compatibile con tutte le caratteristiche di Convenient Horses o di qualunque altra mod relativa alle cavalcature. Per imparare i poteri di evocazione devi recuperare un libro che si trova nel Cottage di Drela (una piccola casupola situata a nord-ovest di Whiterun, ovest di Riposo di Hamvir, sud di Morthal, nella valle tra le montagne).\r\n\r\nLeggendo il libro imparerai due poteri: \\\"Evoca Blaze\\\" e \\\"Schiera Blaze\\\". Questi sono poteri NON magie, quindi per usarli devi preme il pulsante che usi per lanciare gli urli. Usa il potere \\\"Evoca Blaze\\\" per cavalcarlo. Il potere \\\"Schiera Blaze\\\" si usa per marcare i nemici, evocare Blaze nel punto in cui si trovano e avviare l\\'esplosione. È possibile schierare Blaze una volta ogni 5 minuti, il cooldown è visibile nel menu degli effetti magici attivi. Entrambi i poteri possono essere usati solo in zone in cui puoi cavalcare.\r\n\r\nBlaze può esplodere causando ingenti danni da fuoco. Questa abilità si attiva usando il potere \\\"Schiera Blaze\\\" su bersagli ostili ed entro una distanza di 360 piedi (circa 110 metri). Una volta arrivato vicino al suo bersaglio, Blaze comincerà a seguirlo, surriscaldandosi ed infine esploderà. L\\'esplosione infliggerà danni da fuoco sia istantanei che nel tempo, questi danni aumentano ogni 10 livelli del giocatore. Il suolo dove è avvenuta l\\'esplosione arderà per 30 secondi infliggendo ulteriori danni da fuoco ai nemici che vi si trovano all\\'interno. Solo i nemici subiranno i danni dell\\'esplosione.\r\n\r\nBlaze ustionerà chiunque lo aggredisca con attachi fisici (corpo a corpo) e non è sufficientemente lontano. Inoltre Blaze può essere curato lanciandogli contro incantesimi di fuoco o colpendolo con una torcia accesa.\r\n\r\n[heading][color=red]INSTALLAZIONE DELLA TRADUZIONE[/color][/heading]\r\n[list=1]\r\n[*] Installate la mod originale (con NMM o manualmente)\r\n[*] Copiare dall\\'archivio della traduzione il file \\\"Blaze of Eventide.esp\\\" nella cartella \\\"Steam\\\\steamapps\\\\common\\\\Skyrim\\\\Data\\\"\r\n[*] Quando verrà chiesto se si vuole sovrascrivere rispondere di SI.\r\n[/list]\r\nEt voilà il gioco è fatto! Godetevi il vostro splendido Destriero Fiammeggiante!!!\r\n\r\n[heading][color=red]DISINSTALLAZIONE[/color][/heading]\r\n[list]\r\n[*] Se per \\\"Disinstallazione\\\" intendete il tornare alla versione inglese allora è sufficiente che procediate come nell\\'installazione descritta sopra, però prelevando il file \\\"Blaze of Eventide.esp\\\" dall\\'archivio della mod originale.\r\n\r\n[*] Se per \\\"Disinstallazione\\\" intendete la rimozione della mod dal gioco, allora vi rimando al file \\\"Blaze of Eventide ITALIANO - Leggimi.txt\\\" contenuto nell\\'archivio della traduzione in cui trovate il procedimento tradotto.\r\n[/list]\r\n\r\n[heading][color=red]COMPATIBILITÀ[/color][/heading]\r\nCome per la mod originale...\r\n[list]\r\n[*] [color=#0070FF]Automatic Variants[/color] - È necessario aggiungere la mod Blaze of Eventide alla \\\"block list\\\" di AV, altrimenti a Blaze verrà assegnata una skin normale.\r\n[*] [color=#0070FF]Convenient Horses[/color] - È necessario usare CH v4.4 o successive, in caso contrario le armature per i cavalli renderanno Blaze invisibile (senza skin).\r\n[/list]\r\n\r\n[heading][color=red]PERMESSI[/color][/heading]\r\n[b]PER EVITARE CONFUSIONE E DISCREPANZE TRA VARIE EVENTUALI VERSIONI IN GIRO PER LA RETE:[/b]\r\n[list]\r\n[*] È permesso pubblicare questa traduzione su altri siti ma [b][u]SOLO[/u][/b] fornendo il link a questa pagina;\r\n[*] NON è quindi permesso l\\'upload altrove;\r\n[*] NON è permesso modificare in alcun modo questa traduzione, per varie ed eventuali contattare direttamente me tramite messaggio privato o nel mini forum relativo alla traduzione;\r\n[*] È permesso creare derivati di questa [b][u]TRADUZIONE[/b][/u], e solo di essa, ma solo se prima è stato ottenuto il consenso esplicito dell\\'autore della mod originale ([url=http://skyrim.nexusmods.com/users/621184]mitchalek[/url]) al quale andrà spiegato quale uso dovrete fare della mod. Ma per questo vi rimando ai permessi nella pagina della mod originale.\r\n[/list]\r\n[b]In ogni caso andranno indicati espressamente i crediti per la mod originale e per questa traduzione, con i link alle rispettive pagine[/b]\r\n\r\n[heading][color=red]CREDITI[/color][/heading]\r\nGrazie a [url=http://skyrim.nexusmods.com/users/621184]mitchalek[/url] - Creatore della mod originale \\\"[url=http://skyrim.nexusmods.com/mods/25097]Blaze of Eventide[/url]\\\", per avermi permesso di tradurla\r\nGrazie a [url=http://skyrim.nexusmods.com/users/1571960]Andre7890[/url] - Per l\\'aiuto e i consigli",
  "categoryId": "83",
  "version": "1.6",
  "author": "Brezza77",
  "createdUnix": "1362159235",
  "updatedUnix": "1362155207",
  "containsAdultContent": false,
  "uploadedBy": "Brezza77",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014171",
      "name": "Blaze Of Eventide v1_6 _traduzione_italiana",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Blaze Of Eventide v1_6 _traduzione_italiana-32611-1-6.zip",
      "uploadedUnix": "1362155207",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/6304016f059cdbc50a82b7b0c0790e99f7ae5b140495382dc91c16f7a6a9adf1/analysis/1407446137/",
      "changelogHtml": " 01 mar 2013 - Prima versione Italiana, basata su Blaze of Eventide v1.6 - First Italian release, based on Blaze of Eventide v1.6 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blaze%20Of%20Eventide%20v1_6%20_traduzione_italiana-32611-1-6.zip?fid=1000014171&ttl=1535809201&ri=8192&rs=8192&setec=7a5c302c255af49ee57213b70ab11e43"
    }
  ]
}