{
  "modId": 3261.0,
  "modName": "Hvergelmir&#39;s Armor Retexture - HAR",
  "summary": "[url=http://skyrimnexus.com/downloads/file.php?id=3261]Hvergelmir&#39;s Armor Retexture - HAR[/url] is an on-going frequently updated retexture project that aim to eventually have every piece of armor (and shields through [url=http://skyrimnexus.com/downloads/file.php?id=7045]Hvergelmir&#39;s Shield Retexture - HSR[/url]) in the game updated with a",
  "descriptionHtml": "[center][img]http://lthot.dk/har/header_har.png[/img][/center]\r<br />[img]http://lthot.dk/har/introduction.png[/img]\r<br />Hvergelmir&#39;s Armor Retexture [HAR for short] is the first ever complete Skyrim armor and weapons retexture project. Initially this project started with the sole intention of retexturing all armor and shields in the game when the game was released back in 11.11.11. Since weapons have been included in the project. Eventually I got the idea to make quality (color) variations of all armor tiers, but that has yet to be implemented into the actual mod.\r<br />\r<br />Because of the wast size of such a project, HAR is still an on-going project that gets updated every once in a while when I have something new released. Although it may seem at times that HAR is a dead project I can assure you it is not.\r<br />\r<br />HAR is a retexture project that aim to stay true to TES lore and vanilla textures, while still giving them a drastic overhaul for realism and better looks. Future releases (v2.0) will be have all previous releases completely remade from scratch, using high poly models to bake new normal maps, more detailed meshes and new cubemaps to add more realistic reflection on the retextured items. Weapons will most likely undergo a de-LARP-ification and be remodeled, while still attempting to not stray too far from the vanilla look. I will, however, redesign these to look functional, practical and realistic.[color=#e69138]\r<br />\r<br />[/color][list]\r<br />[*][color=#e69138]Vanilla textures vary between 512x512 to 1024x1024 in size. The HRDLC is between 1024x1024 and 2048x2048 normally.[/color]\r<br />[*][color=#e69138]HAR comes in [color=#e69138]1024x1024 and 2048x2048 - most, if not all people should be able to run these, if not... stop playing on a potato[/color].[/color]\r<br />[*][color=#e69138]With release 2.0 (and onwards) HAR will have an ultra version with textures at [color=#e69138]2048x2048[/color] and 4096x4096 - these are for the super rigs, or people that enjoy taking screenshots.[/color]\r<br />[*][color=#e69138]All textures have been remade from scratch using new high poly models as the foundation for the new normal maps. HAR&#39;s aim is realism.[/color]\r<br />[/list]\r<br />All textures have already been optimized, so please avoid running them through optimizer tools (Ex. DDSopt) or you will get undesirable results.\r<br />\r<br />Enjoy\r<br />[center]\r<br />\r<br />\r<br />[img]http://lthot.dk/har/addimage.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />[url=https://www.facebook.com/HvergelmirsMods][img]http://lthot.dk/har/facebook.png[/img][/url][/center]\r<br />\r<br />[img]http://lthot.dk/har/videos.png[/img]\r<br />\r<br />[center]Please restrain yourself from making more HAR feature videos until AFTER 2.0 has been released ;)[/center]\r<br />[img]http://lthot.dk/har/current_progress.png[/img]\r<br />Please note that I work in a specific order from low to high tier armor as seen on this list. The reason for this is simple, the game is bloated with the lower tier stuff and you see it in-game everywhere. I wanna make everything more pleasing to the eye, not just the player that tend to be one of the only characters in the game wearing higher tier stuff.\r<br />\r<br />[center][img]http://lthot.dk/har/progress_armor.png[/img]\r<br />\r<br />I&#39;ll update the list with DLC armor and weapons. Be patient.[/center]\r<br />[img]http://lthot.dk/har/individual_armor.png[/img]\r<br />\r<br />[center][url=http://skyrim.nexusmods.com/mods/25664/][img]http://lthot.dk/har/har_steel.png[/img][/url][/center]\r<br />[img]http://lthot.dk/har/installation_and_uninstallation.png[/img]\r<br />It is recommended to install HAR with Nexus Mod Manager, it simplifies the process greatly and also makes it simple to uninstall again if needed.\r<br />\r<br />To manually install HAR, use either WinRar or 7-Zip to extract the files to[b] Steam/steamapps/common/skyrim[/b]\r<br />If asked to override, click yes. Please keep in mind this will override any other armor (re)textures you currently have installed. This is what we intent, though. Isn&#39;t it? ;)\r<br />\r<br />To manually uninstall HAR, delete the Armor and Weapons folders (Fur armor is found in Clothes in a folder called Bandit) inside the textures folder found here[b] Steam/Steamapps/Common/Skyrim/Data/Textures/[/b]\r<br />Please keep in mind this will delete any other armor and weapon (re)textures you currently have installed. If you know what you&#39;re doing you can enter the folders and delete each texture manually as you see fit.\r<br />\r<br />\r<br />\r<br />\r<br />[img]http://lthot.dk/har/distribution_permission.png[/img]\r<br />You may NOT use Hvergelmir&#39;s Armor Retexture for a mod of your own. Please contact me for special permissions and we can discuss further.\r<br />\r<br />My mods may not under any circumstances be distributed any other place than Nexusmods. If in doubt, refer to the mirrors list, if a site is featured there it has my permission to distribute my mod(s).\r<br />You may not under any circumstances release my mods on Steam.\r<br />\r<br />\r<br />[img]http://lthot.dk/har/additional_information.png[/img]\r<br />I am open to suggestions and collaboration work on other mods, got any great ideas feel free to contact me. My strong side is mainly (re)texturing, but I am flexible and should be suitable for other jobs.\r<br />\r<br />If you like my work, I&#39;d appreciate it highly if you&#39;d comment or post screenshots featuring my work&#33;\r<br />\r<br />Read my [url=http://skyrim.nexusmods.com/modules/members/index.php?id=30027]profile page[/url] if you want to know more about me, or find my other mods.\r<br />\r<br />\r<br />\r<br />\r<br />[img]http://lthot.dk/har/footer_hsr.png[/img]",
  "categoryId": "29",
  "version": "v1.8a",
  "author": "Hvergelmir",
  "createdUnix": "1323551045",
  "updatedUnix": "1351092649",
  "containsAdultContent": false,
  "uploadedBy": "lthot",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95571",
      "name": "Complete HAR",
      "version": "v1.8a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54755",
      "fileName": "Complete HAR-3261-v1-8a.rar",
      "uploadedUnix": "1351092357",
      "modVersion": "v1.8a",
      "virusScanUrl": "https://www.virustotal.com/file/0e1065d72545a17c6bed606ece1f85949f7770f231367026209e4c8e05004c74/analysis/1407234386/",
      "changelogHtml": " Added indents inbetween the ornaments found on steel armor <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Complete%20HAR-3261-v1-8a.rar?fid=95571&ttl=1535758173&ri=8192&rs=8192&setec=c449906d69dad45ea218463c49379f64"
    },
    {
      "fileId": "95572",
      "name": "Complete HAR - BSA",
      "version": "v1.8a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53677",
      "fileName": "Complete HAR - BSA-3261-v1-8a.rar",
      "uploadedUnix": "1351092649",
      "modVersion": "v1.8a",
      "virusScanUrl": "https://www.virustotal.com/file/7147dcee8950ab34f551f7954871a62f676d44334423a0e21c9b6884bd9274d9/analysis/1407234401/",
      "changelogHtml": " Added indents inbetween the ornaments found on steel armor <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Complete%20HAR%20-%20BSA-3261-v1-8a.rar?fid=95572&ttl=1535758173&ri=8192&rs=8192&setec=d41783689c2e2efa12b90c95899fe2e9"
    }
  ]
}