{
  "modId": 32621.0,
  "modName": "Belchik Isles",
  "summary": "",
  "descriptionHtml": "Welcome to my brand new map called Belchik Isles. \r\n\r\nThis is a very mountainous, and foresty map, filled with dense forests, waterfalls, rivers, and small mining and fishing towns. \r\n\r\nThis map is brand new and still very much a work in progress. I do obviously know there is a lot of bugs and glitches. If you encounter any of these please write a quick commment. If there is something you think would make the map better. please tell me so i can make everyone happy. \r\n\r\nThere will be many, many, many updates in the future. I also plan on making a few questlines. perhaps bringing back some questlines from skyrim. But thank you again. If you run into any problems just shoot a comment over to me. \r\n\r\nNow to get to the map you must go to the solitude docks where there is a ship with a cargo hold, enter the cargo hold to travel to Belchik Isles. \r\n\r\nUPDATE 0.1- Added one interior and a lake, also expanded landmass. \r\nUPDATE 0.2- Added one interior, a mountain, and a mine. \r\nUPDATE 0.3- Added small market area, forest, and took away the dumb looking dirtpath through the city for now. \r\nUPDATE 0.4- Added shipwreck at the giant rock on the river, animal den on side of mountain, and enhanced forest. \r\nUPDATE 0.5- Adjusted terrain height in Bedoy, updated and added lots more screenshots. \r\nUPDATE 0.6- Added three interiors, completed pathway through Bedoy, added island and mountain to the lake, started gardens and plants in city, and re-did the terrain through city and surrounding areas, also added stables. \r\nUPDATE 0.7- Completed vegetation and garden throughout Bedoy, removed half of dock, added mountain next to dock, started remaking the forest. \r\nUPDATE 0.8- Sized down plants and removed some trees from Bedoy. Also added guard barracks, and jail to Bedoy, no guards yet though. \r\nUPDATE 0.9- Added a few guards throughout Bedoy, and made it so the SHOULD arrest you for crimes and take you to jail. \r\nUPDATE 1.0- Added river, road leading to bridge and waterfall into ocean at the end of river(WIP). Also decorated a few interiors. \r\nUPDATE 1.1- Added lots of things, decorated forest area outside of Bedoy, added bandit camp around the giant mountain, decorated the ocean port floor and the river floor a little. ",
  "categoryId": "30",
  "version": "1.1",
  "author": "TheMarineScoutSniper",
  "createdUnix": "1362170023",
  "updatedUnix": "1362170023",
  "containsAdultContent": false,
  "uploadedBy": "TheMarineScoutSniper",
  "primaryFile": null,
  "files": []
}