{
  "modId": 32623.0,
  "modName": "Improved Atronach Forge",
  "summary": "Adds new recipes to the Atronach Forge and improves the reward for the vanilla ingredient and potion recipes.",
  "descriptionHtml": "Improved Atronach Forge\r\n\r\nVersion 1.0   -   01 March 2013\r\nVersion 1.1   -   18 March 2013  (minor update corrected some typos, changed some fonts)\r\n\r\n\r\nDescription\r\n===========\r\n\r\nNote all original recipes at the forge are still available and function.\r\n\r\n1.  Adds new recipes to the atronach forge for use without the sigil stone. (Items created are from the vanilla game, no new spells etc)\r\n\r\nSome of the recipes could be exploited for gold profit, but are meant as a valid reason to visit the Forge to craft your items.\r\nAs the forge is a conjuration device I have included items relating to the Conjuration school of magic. This follows the vanilla recipe list which produces items relating to the Conjuration school of magic.\r\nRecipes are added for the creation of the following.\r\n\r\n\t- Master Robes of Conjuration\r\n\t- Staff of Daedric Command\r\n\t- Staff of Revenants\r\n\t- Staff of Familiar\r\n\t- Bound Sword Spell Tome\r\n\t- Bound Battleaxe Spell Tome\r\n\t- Bound Bow Spell Tome\r\n\t- Conjure Familiar Spell Tome\r\n\t- Potion of Ultimate Healing x 5\r\n\t- Potion of Ultimate Magicka x 5\r\n\t- Philter of Extra Magicka x 5\r\n\t- Weak Aversion to Magic x 5 \r\n\t- Philter of the Phantom x 5\r\n\r\n2.  Adds a guide/recipe book.\r\n\r\nThe book is available in Whiterun Dragonsreach under the enchanting table and a re-spawning copy available on the floor near the Forge itself. The guide book contains all the new items that can be conjured and the ingredients required. The book is Volume 3 as, my other mod dealing with the vanilla recipes are volumes 1 & 2.\r\n\r\n\r\n3.  Gives a larger return for the vanilla recipe of Fire, Frost & Void Salts\r\n\r\nThe vanilla game the forge consumes precious gems/jewelry and only returns one Fire Salt. This is changed to return 10 Fire Salts making it more rewarding to visit on occasions, to stock up on alchemy goods. The intention is not to make it into a cheat for gaining gold, but to recognize its a somewhat out of the way destination to go to, along with bringing somewhat hard to find items (early in game) and to reward the effort.\r\nI feel this amount is balanced, considering the amount of viable gems and jewelry you will have early on. Later in game the gold that you could earn with this, is trivialized by the various other lucrative crafting techniques. However the forge still remains a good place to stock up on these slightly rare ingredients.\r\n\r\n\r\n4.  Gives a larger return for the vanilla recipe of Conjurer\\'s Elixir\r\n\r\nI have also changed the number of Conjurer\\'s elixir received to 10. This is to make the visit more rewarding, and to make the potion more of a staple for your character to use.\r\n\r\n\r\n5.  Changed the Empty bottle requirement for Conjurer\\'s Elixir recipe.\r\n\r\nNow you can use either empty bottles or any bottle of alcohol. (DLC added alcohol not included, eg Argonian Bloodwine from Hearthfire). This is to add compatability with Realistic Needs and Diseases mod.\r\n\r\n\r\n\r\nReason and lore for the mod\r\n===========================\r\nThis mod aims to add a greater reason for players to visit and use the Atronach Forge. It seemed a great shame that a \\\"powerful conjuration device\\\", was let worthless in the basement with practically no use.\r\nThe recipes are balanced to give a good payout, so you have incentive to visit but not overpowered so your getting stuff for free (hopefully it should still feel like your going there to do some crafting and not pick up free loot).\r\nRecipes have been chosen to fit with the original recipes of device.\r\n\r\nThe potion creation is fairly well balanced. Yes you can create ultimate healing potions etc, but only if you have another specific healing potion to upgrade from.\r\n\r\nThe Philter of the phantom potion was thrown in for fun :)\r\n\r\n\r\n\r\nRequirements\r\n============\r\nNone\r\n\r\n\r\n\r\nInstallation Instructions\r\n=========================\r\nInstall using NMM.\r\n\r\n\r\nUninstallation\r\n==============\r\nUninstall mod using NMM.\r\nDelete.\r\n\r\n\r\nIncompatabilities\r\n=================\r\nThe only compatability problem I can think of may possibly be, with the Dovachore mod on the Steam workshop. Other than that I do not know of any other mod that changes the lists at the atronach forge.\r\n\r\n\r\n\r\nCompatability\r\n=============\r\n* This mod now allows the Conjurer\\'s Elixir recipe (recipe from the vanilla game) to be created at the Atronach Forge with Realistic Needs mod installed.\r\nThe Realistic Needs mod changes, the empty bottles to useful refillable water carrying bottles. These refillable bottles do not work at the Atronach Forge.\r\nHowever with my mod installed you are now able to use full bottles of alcohol at the forge instead. So this is no longer a problem.\r\n\r\nIf you are not using the Realistic Needs mod it just means you can use either empty or full bottles.\r\n\r\n* Please note I\\'m not knocking The Realistic Needs mod in anyway, neither do I think that this needs to be changed within the mod. I use the mod myself, and highly recommend it to anyone. I love the fact that, once pretty useless items, now have a purpose within Realistic Needs.\r\n\r\n\r\n\r\nMy other mods\r\n==============\r\nIf you like this mod you may also like be interested in my other mod below.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/32608]Alchemy and Atronach Forge Guide Books[/url]\r\nAdds a Alchemy guide book detailing potions I have found useful. Mainly multiple ingredient multiple effect poisons and potions. Also gives details on poisons with the maximum strength.\r\nAdds two Atronach Forge Guide Books, listing all vanilla game recipes.\r\nAll books free and weightless available from Whiterun Dragonsreach.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/38055]Full four item effect Alchemy and Smithing fortify skill on one ring[/url]\r\nAdds a crafting ring which has the combined total of four items worth of alchemy & blacksmithing enchants (~120%). The ring also comes with a large boost (~6000) to carryweight to make crafting and selling easier withing towns.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/34743]Nightingale Hall and Twilight Sepulcher - Improved[/url]\r\nUpgrades Nightinagle Hall upon completion of the Thieves guild questline, to a more fitting home for Karliah. Adds crafting stations, general gold silver bling, weapons racks, mannequins etc. Also adds the portal to the Inner sanctum for changing your nightingale powers.\r\nTwilight sepulcher moved the portal door that appears after completing the thieves guild questline back to the end of the dungeon. (ie jumping down the well to get into the inner sanctum). The portal door was moved as it made no sense that it was placed at the start of the dungeon upon completion.\r\n\r\n\r\n\r\nThanks\r\n=======\r\nThanks to Bethesda for creating Skyrim and the creation kit.\r\nThanks to all the great people, who have created some amazing mod making tutorials.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n***SPOILER***\r\nSigil Stone obtainable at skill level 90, after a quest from one of the College mages.\r\nAtronach forge located beneath the college of Winterhold in a area known as the Midden.",
  "categoryId": "78",
  "version": "1.1",
  "author": "ClackingKeys",
  "createdUnix": "1362171802",
  "updatedUnix": "1363613995",
  "containsAdultContent": false,
  "uploadedBy": "ClackingKeys",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014228",
      "name": "ImprovedAtronachForge 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "ImprovedAtronachForge 1_0-32623-1-0.7z",
      "uploadedUnix": "1362170720",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f285dbf1641788d766355226532f9bab28ddf041c2686ab75136e5aebc4d9427/analysis/1407446420/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ImprovedAtronachForge%201_0-32623-1-0.7z?fid=1000014228&ttl=1535809226&ri=8192&rs=8192&setec=8cdfd5b2885fd326914487ebc4d2df86"
    },
    {
      "fileId": "1000018449",
      "name": "ImprovedAtronachForge 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "ImprovedAtronachForge 1_1-32623-1-1.7z",
      "uploadedUnix": "1363613995",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/346631ab6b497bdc7c7c6e62efe497601bfd3505d3975f1f9b4d521c999cc001/analysis/1407475924/",
      "changelogHtml": " Corrected some typo&#39;s in the books text (namely ultimate magika potion should have required a plentiful magika potion) <br/> \n Changed some of the heading fonts in the books, to distinguish them a little more from the recipe ingredients. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ImprovedAtronachForge%201_1-32623-1-1.7z?fid=1000018449&ttl=1535809227&ri=8192&rs=8192&setec=b83ac734be23c93ead4ecb980c9cb4ca"
    }
  ]
}