{
  "modId": 32630.0,
  "modName": "Lazarias Wreck - For Pirates",
  "summary": "I created this mod for one simple purpose, to have a starting location for a pirate character. It is lore friendly and uses only objects in the game. The pirate outfit is from Immersive Armors http://skyrim.nexusmods.com/mods/19733 and inspired me to create a starting point for my new pirate. If you\\'re a true pirate you\\'ll need it to create your ",
  "descriptionHtml": "This is a very small, lore friendly mod that can be fast traveled to so that you can start a pirate character. A smithing anvil is aboard the ship for crafting the pirate armor. However that armor does not exist with this mod. (See below)\r\n\r\nThe back story is simple, the pirates were high atop the sea when a ravaging storm carried them into Skyrims iciest of waters. Striking the ice their boat was split in two and then carried toward land freezing into the iceberg as heavy rain and water forcefully washed over it. After that the pirates then created a temporary setup to survive until drifting to a stop near the beaches off Windhelm. \r\n\r\nCredit for the outfit in the picture goes to hothtrooper44 for the mod Immersive Armors found here: http://skyrim.nexusmods.com/mods/19733 - The outfit is called \\\"Seadog\\\".\r\n\r\nI highly recommend download and wearing it. If you do decide to start as I did, you\\'ll have to use the console command player.incpcs smithing or advskill smithing [1-99999] in order to obtain the level needed to create the outfit at the Glass level. Unfortunately, I couldn\\'t remember the supplies needed to create those items, so they are not aboard the wreck, you\\'ll have to console command them, it\\'s pretty easy. This was my ghetto way to start a pirate with Alternate Start: Live Another Life.\r\n\r\nOh, don\\'t forget to loot the chest! Pirates need booty!\r\n\r\nConstructive critisism is welcome, thank you!",
  "categoryId": "67",
  "version": "3.1.2013",
  "author": "Artparker",
  "createdUnix": "1362184229",
  "updatedUnix": "1362183815",
  "containsAdultContent": false,
  "uploadedBy": "Artparker",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014289",
      "name": "LazariasWreckv1",
      "version": "3.1.2013",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "LazariasWreckv1-32630-3-1-2013.zip",
      "uploadedUnix": "1362183815",
      "modVersion": "3.1.2013",
      "virusScanUrl": "https://www.virustotal.com/file/e402c390c661d24f6b57788eda358241d64c9f348cb3c629fea9f1d0d94a9475/analysis/1407446946/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LazariasWreckv1-32630-3-1-2013.zip?fid=1000014289&ttl=1535809238&ri=8192&rs=8192&setec=2fe93759fde2c4c34f9bbada4d2ca5a4"
    }
  ]
}