{
  "modId": 32632.0,
  "modName": "Mammoth Shelter - Survival Shack",
  "summary": "A lore-friendly, small and cozy shelter created in a mammoth skeleton with makeshift wood, a few storage crates (no respawn) and a twist. ",
  "descriptionHtml": "This shelter was created in mind to store things in a remote place while traveling on foot. I don\\'t fast travel so I need a safe place for my characters. There is a bed outside and safe storage containers that don\\'t respawn. However, for those seeking greater warmth there is an obvious trapdoor right as you walk into the shelter.  Just enter it for the minor surprise, (I say minor because I don\\'t want anybody saying, \\'booooo\\')there is a book that explains the rest. \r\n\r\nLIST of available craft-abilities and brief explanations of them:\r\n\r\nTANNING RACK: As a hunter/gatherer/adventurer this spot in the mountain is well situated for you.\r\n3 STORAGE BARRELS: These barrels are labelled and placed to add integrity to the structure and provide a place to stash what have you. The third barrel is inside, it is FULL of salt because I imagined this small cavern being a place where salt is easily available.\r\nWOODCUTTING BLOCK: There is a chopping block and some spare wood laying around, especially useful for those who use the Frostfall mod, which I do.\r\n1 CHEST: This chest is labelled for pelts, leather, and fur. I don\\'t care what you put in it, but that\\'s the theme.\r\n\r\nI am open to suggestions and changing the mod on request for individuality\\'s sake, however this mod is created with a minimalistic attitude in mind. I did not wish to add every crafting device in the game to this location because that is unrealistic for the purposes of immersion and even lore.\r\n\r\nThis file uses only in game objects. Enjoy!\r\n\r\n",
  "categoryId": "67",
  "version": "3.1.2013",
  "author": "Artparker",
  "createdUnix": "1362189394",
  "updatedUnix": "1362184971",
  "containsAdultContent": false,
  "uploadedBy": "Artparker",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014293",
      "name": "Mammoth Shelter",
      "version": "3.1.2013",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "Mammoth Shelter-32632-3-1-2013.zip",
      "uploadedUnix": "1362184971",
      "modVersion": "3.1.2013",
      "virusScanUrl": "https://www.virustotal.com/file/674e2d805c9d8320488b2bdb4fc9d90c8e566b43f039bd379696e6af68b66ea6/analysis/1407446946/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mammoth%20Shelter-32632-3-1-2013.zip?fid=1000014293&ttl=1535809241&ri=8192&rs=8192&setec=d038de3301502f4fd5a4e19f3d824fdc"
    }
  ]
}