{
  "modId": 32669.0,
  "modName": "Death Knights of Skyrim",
  "summary": "- 9 new Races\r\n- new armors\r\n-Questline\r\n- 52 new Spells\r\n- Turn Followers into Death Knights\r\n- A Custom Made Levelingsystem for Death Knight´s\r\nAnd more!",
  "descriptionHtml": "[img]http://www.fildirekt.se/dl/1362291642.png[/img]\r\n\r\n\r\n\r\nDEATH KNIGHT´S OF SKYRIM\r\nBY TheSkoomaKing\r\nRequires: Dawnguard, and latest update of Skyrim!\r\nIn order for this mod to work properly you must have Bigger And Badder Lich King Armor\r\nhttp://skyrim.nexusmods.com/mods/25696\r\n\r\n\r\nRemember to like us on [url=http://www.facebook.com/pages/Theskoomaking-Productions/510725382328603?skip_nax_wizard=true]Facebook![/url]\r\n\r\nUPDATE 1.1 HAS BEEN RELEASED. Make sure to read what is new below!\r\n\r\n[color=aqua] Feel free to PM me if you have any ideas or Questions about the mod! [/color]\r\n[color=lime]Remember to Endorse and Vote if you like the mod![/color]\r\n\r\n[youtube]_WbIhiUgdps&feature=youtu.be[/youtube]\r\n[Color=aqua] This is a small trailer ive made for the mod, however it is not very well done since i do not have that much experience with making movies, this was one of the first i´ve ever made! So tell me what you think!! :)\r\n\r\n[/color]\r\n\r\n[center][img]http://www.fildirekt.se/dl/1362235761.png[/img][/center]\r\n\r\n\r\nThis mods adds 9 new playable races. \r\nThe Death Knight Version of each nine races of tamriel. \r\nOnce you reach level 10 you will have to choose what kind of Death Knight you\r\nwould like to be. A Specialization. If you then later feel that you chose the wrong specialization, then have no fear. You can visit the Shrine of Replacement inside Acherus anytime to change your specialization. \r\nNOTE: once you have used the Shrine you must then fast travel in order for the script to update itself.\r\n\r\nThis is so much more than just a regular Racemod. \r\n\r\nThere is two ways of becoming a Death Knight:\r\n\r\n- You create a new Character\r\nNote: When you first hover over the character when you create a new character, you must then\r\nscroll up and down the race list again until the eyes appears ( sorry its really wierd! will do a video about this! )\r\n\r\n- Turning your already existing Character:\r\nonce you load your game with a race that is not a Death Knight, you will be given a \\\" Death Knight Configure\r\nSkull, simply Drop it and then pick it up and you will have an option to start the death knight\r\nquest. ( P.S if you are a vampire this doesnt work! )\r\nNote: Once you get teleported, dont take a step forward before you have saved your game then loaded it \r\nup again, there is a dialogue issue surrounding Scenes.\r\n\r\nMeet the Lich King Himself:\r\n\r\n- Fight for the Lich King himself in a new Featured Questline ( Not finished! )\r\nNote: the questline is not available as of now, but in every update i will bring atleast one or two quests (Death Knight Only)\r\n\r\nThe Quest \\\" Destroying the Weak \\\" is NOT finished, do not try to complete it just yet, i added it only to avoid problems later on when the new update comes\r\n\r\nDeath Knight Armors\r\n\r\nDeath Plate:\r\n- Craftable armor ( Requires Dragonsmith Perk )\r\n- Is a little better then Dragonbone Armor\r\n- A Lesser version of the armor can be found in Acherus for newly Created Death Knights.\r\n\r\nScourge Lord Armor:\r\n- Craftable armor ( Requires Dragonsmith Perk )\r\n- Is a little better then Deathplate Armor\r\n\r\n[color=lime]\r\n\r\n[center][img]http://www.fildirekt.se/dl/1362233330.png[/img][/center]\r\n\r\nA master of Death and Decay, spreading infection and controlling undead minions\r\nto do his/her bidding. \r\n\r\n- Raise Dead. \r\nSummon a Undead Creature to fight for you until it dies. \r\n\r\n- Death Pact.\r\nSacrifices your Undead Minion and giving you 100 health back.\r\n ( Raise Dead Minions only and can only be used one time every day. ) \r\n\r\n- Pestilence. \r\nInfect your Target with every known Diseases from Skyrim. weakening your enemy. \r\n\r\n- Unholy Strikes. \r\nEach time you hit an opponent. There is a 40% chance that they will be inflicted by Blood Plague and Frost Fever. Blood plague damage the target for 10% and Frost fever Slows the target for the same amount of time. \r\n\r\n- Improved Death Coil.\r\nYour Death Coil does 50% More Damage. \r\n\r\n- Summon Gargoyle ( Power )\r\nOnce a day you may summon a powerful Gargoyle to fight for you. \r\n\r\n- Unholy Frenzy\r\nYour target becomes 20% stronger for 10 seconds, however he loses health over time during the effect\r\n\r\n- Unholy Plague ( Level 70 )\r\n\r\nYou cast a tormenting plague on the target, if the target dies within the duration of the plague it  will become an undead and will follow you until it dies.\r\n\r\n[/color]\r\n[color=aqua]\r\n\r\n[center][img]http://www.fildirekt.se/dl/1362285467.png[/img][/center]\r\n\r\nAn Icy harbinger of Doom, channeling runic power and delivering vicious \r\nweapon strikes.\r\n\r\n\r\n- Dualwield Specialization\r\nFrost Death Knight´s does more Damage with Dualwielding Power attacks.\r\n\r\n- Raise Dead.\r\nSummons a Undead Minion to fight for you for 30 seconds\r\n\r\n- Chains of Ice ( lvl 20 )\r\nYou trap your target in ice, slows the target by 25% for 12 seconds.\r\n\r\n- Pillar of Frost ( level 40 )\r\nYou take half as much damage and do double damage\r\n\r\n- Wall of Ice ( level 50 )\r\nYou cast a powerful icebeam at the ground, damaging anyone that walks through it.\r\n\r\n- Frost Fever. \r\nInflict Frost damage and slows your opponent \r\n\r\n- Frost Immunity. \r\n100% Frost Resistance. \r\n\r\n- Icebound Fortitude. ( level 30 )\r\nIncreases your Armor by 25% for 30 seconds \r\n\r\n- Remorseless Winter. ( level 40 )\r\n Creates a Frost Cloak around the player, throwing powerful cold wind at your enemies. \r\n\r\n- Hungering Cold. \r\nEvery target within a 10 yard will become solid ice for 10 seconds. \r\n\r\n- Howling Blast ( level 30 )\r\nYou cast a powerful frost beam that damages nearby targets \r\nof the target it hits.\r\n\r\n- Rune of Frost ( level 50 )\r\nYou cast a rune of Frost on the ground, anyone who contact the rune will be frozen solid for 10 seconds\r\n\r\n- Storm of Ice ( Level 70 )\r\nYou cast a storm of Ice at the target, damaging it and slows the target by 70% for 10 seconds. \r\nThe effect cannot be resisted\r\n\r\n\r\n\r\n[/color]\r\n[color=red]\r\n[center][img]http://www.fildirekt.se/dl/1362272480.png[/img][/center]\r\n\r\nA Dark Guardian who manipulates and corrupts life energy to sustain himself/herself\r\nin the face of an enemy onslaught. \r\n\r\n- Raise Dead.\r\nSummons a Undead Minion to fight for you for 30 seconds\r\n\r\n- Death Pact.\r\nSacrifices your Undead Minion and giving you 100 health back.\r\n ( Raise Dead Minions only and can only be used one time every day. ) \r\n\r\n- Two-Handed Specialization\r\nBlood Death Knight´s does 20% more damage with Two-Handed Weapons.\r\n\r\n- Avoid Death ( Perk )\r\nOnce a day if your health falls below 10% you will instantly gain 100 health points\r\n\r\n\r\n- Vampiric Blood. \r\nIncreases your health Regeneration\r\n\r\n- Blood Strikes. ( Perk )\r\n Each time you hit a target. There is a 15% chance to regain some of your Health.\r\n\r\n- Consume Magic ( level 40 )\r\nYou cast a beam of magicka on your target, consuming their Magicka. \r\n\r\n- Consume Stamina ( level 30 )\r\nYou cast a beam of magicka on your target, consuming their Stamina. \r\n\r\n- Rune of Blood ( Level 50 )\r\n\r\nYou cast a rune of blood on the ground, anyone who contacts the rune will be damage by blood damage.\r\n\r\n- Veteran of the Third War. ( Ability )\r\n Permanently grants you 100 more health. \r\n\r\n- Mark of Blood ( Level 70 Power)\r\n\r\nYou mark the target, each time the target hits you will you be healed for 20hp. The mark holds for \r\n15 seconds\r\n\r\n[/color]\r\n\r\nAll Specialization Spells:\r\n\r\n- True Evil ( passive )\r\nDeath Knights are now considered as Undead. Therefore, silver weapons does double the damage to you\r\n\r\n- Path of Frost\r\nGrants you The Ability to walk on water for 30 seconds\r\n\r\n- Summon Acherus Deathcharger:\r\nSummons The Acherus Deathcharger, custom horse for Death Knights only!\r\n\r\n- Death Grip ( Level 30 )\r\nGrip the current target to your location, hold to toss him away when releasing.\r\n\r\n- Deathgate:\r\nTeleports you to Acherus. ( WIP )\r\nNote: this spell is like 50% finished, so make a clean save before going in there.\r\nIn the near future the place will not even look the same so please do not complain about the looks.\r\n\r\n- Death Coil\r\nSend a powerful Bolt at your enemy.\r\n\r\n- Army of The Dead ( Level 70 )\r\nConjures a vile horde of Undead to tare you enemies apart for 30 seconds\r\n\r\n- Corpse Explode ( Level 70 )\r\nif cast on a corpse. The corpse will explode after three seconds damaging anyone nearby ( wip )\r\n( this spell works great but the visuals for it is kinda lame for now )\r\n\r\n- Dark Resurrection: \r\n\r\nReanimates your current Target, Turning it to a Death Knight like yourself. \r\nWill follow your every command until it takes it´s last breath.\r\n\r\n( Your target becomes a Companion/follower )\r\n\r\nReanimate your enemies or betray your friends so that they can become your \r\nslaves.\r\n\r\n[center][img]http://www.fildirekt.se/dl/1362250593.png[/img][/center]\r\n\r\n[center][img]http://www.fildirekt.se/dl/1362307016.png[/img][/center]\r\n\r\nNew Weapons And Armor fit for a Death Knight\r\n\r\nBUG FIXES:\r\n- Fix for the vanishing eyes for some of the followers when you use Dark Resurrection.\r\n- Dialogue fix for Dark Resurrection.\r\n\r\nRUNEFORGING\r\n- Visit Acherus. There you can learn how to Runeforge your weapons. Permanently adding a powerful enchant them. \r\n\r\nCONTROL UNDEAD ( it was originally meant to be in the first release, but the dialogue did´t work so removed it for now )\r\n- You dominate the mind of the targeted Undead Creature. Forcing him to follow your every command until \r\ndeath claims him\r\n\r\n\r\nRAISED LEVEL CAP ( 80 )\r\n\r\n- New Quest: Fall of The Lich King\r\nOnce you reach level 80 with your death knight, the time has finally come to destroy your evil master.\r\nWith the help of Tirion Fordring and The Champions of Azeroth, you will take the fight to Arthas and you\r\nwill tare down the walls of Icecrown. Two ways to end the quest.. Evil way..Good way.\r\n\r\n- New Spells and Abilites.\r\n\r\n[center][img]http://www.fildirekt.se/dl/1362250593.png[/img][/center]\r\n\r\nNEW IN UPDATE 1.1\r\n\r\nNOTE: important if you are updating the mod! You must visit the Shrine of replacement in order to get some of the new spells.\r\n\r\n(( The questline has been delayed, because of a stupid dialogue bug that i cannot fix atm.))\r\n\r\nAs of update 1.1 Acherus is now floating in the air! You can now go outside the acherus and use your fast travel from there! It is located High above Windhelm\r\n\r\n\r\nBUGFIXES\r\n- Veteran of The Third War will no longer make you unkillable.\r\n\r\n- Consume Magicka and Stamina now is a channeling beam, instead of a bolt. \r\n\r\n- several minor bugfixes\r\n===================================================================================\r\n- Blood, Frost, Unholy Presence\r\n\r\n- Blood Presence.\r\nIncreases your Armor by 25% while in Blood Presence\r\n\r\n- Frost Presence.\r\nIncreases your damage by 10% while in Frost Presence.\r\n\r\n- Unholy Presence.\r\nIncreases your attack speed by 15% while in Unholy Presence\r\n\r\nOnly one presence can be activated at the same time.\r\n===================================================================================\r\nChange Specialization: Read more about this at top of the description!\r\n===================================================================================\r\n- Two new Armor´s fit for a Death Knight\r\n\r\nDeath Plate ( was missing files in prev. update )\r\n\r\nScourge Lord Armor\r\n===================================================================================\r\n- Death Knight Leveling system Cap raised to (70)\r\nYou can now level to 70 and get updated spells.\r\n- New Spells and Abilites for level 70.\r\n\r\n- Army of The Dead\r\nConjures a vile horde of Undead to tare you enemies apart for 30 seconds\r\n\r\n- Corpse Explode\r\nif cast on a corpse. The corpse will explode after three seconds damaging anyone nearby\r\n\r\n- True Evil ( passive )\r\nDeath Knights are now considered as Undead. Therefore, silver weapons does double the damage\r\n\r\n- Mark of Blood ( Blood, power )\r\n\r\nYou mark the target, each time the target hits you will you be healed. The mark holds for \r\n15 seconds.\r\n\r\n- Storm of Ice ( Frost )\r\nYou cast a storm of Ice at the target, damaging it and slows the target by 70% for 10 seconds. \r\nThe effect cannot be resisted\r\n\r\n- Unholy Plague ( Unholy )\r\n\r\nYou cast a tormenting plague on the target, if the target dies he will become an undead and will follow\r\nyou until he dies.\r\n\r\n- Rune of Blood ( blood )\r\n\r\nYou cast a rune of blood on the ground, anyone who contacts the rune will be damage by blood damage.\r\n\r\n- Rune of Frost ( frost )\r\nYou cast a rune of Frost on the ground, anyone who contact the rune will be frozen solid for 10 seconds\r\n\r\n===================================================================================\r\n\r\nLEVELING SYSTEM:\r\n\r\n\r\n\r\nAs you level your Death Knight you will unlock and improve your Death Knight\r\nSpells and Abilities.\r\n\r\nNew spells and abilities will be given to you at level:\r\nlevel 10,20,30,40,50,60,70,\r\n\r\nThe Death Knight Leveling System will cap at level 70. And once you reach level\r\n70 your powers have reached maximum power and the Spells Army of The Dead,Corpse Explode, Mark of Blood ( bloodspec ), Storm of Ice ( Frostspec ) and Unholy Plague ( Unholyspec ) will be available to you\r\n\r\nJust to make clear. When i say that the level caps at 70, i mean for the Death Knight spells only, \r\nyou can still level up the original way!\r\n\r\n\r\n\r\n[center][img]http://www.fildirekt.se/dl/1362250593.png[/img][/center]\r\n\r\n[img]http://www.fildirekt.se/dl/1362248804.png[/img]\r\n\r\nBethesda softwork for Skyrim and the Creationkit.\r\nBlizzard Entertainment who gave life to The Death Knights\r\nMyself.. for mixing those two games together :)\r\n\r\n\r\nI would like to give a special thanks to:\r\nXion: for extracting files from Texture.BSA for me, cause it doesnt work on my computer for some reason.\r\nHfiani: For supporting me and helping me with scripting issues.\r\nSteve40: For saving the mods leveling system, as i could´t find the error \r\ninside the script for it, but he could! \r\n\r\nReally Thanks you two!\r\n\r\nWould also like to thank my friend Sebastian, who has helped me with the images for this file!",
  "categoryId": "34",
  "version": "1.1",
  "author": "TheSkoomaKing",
  "createdUnix": "1362243159",
  "updatedUnix": "1362695277",
  "containsAdultContent": false,
  "uploadedBy": "TheSkoomaKing",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014432",
      "name": "DKVersion1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4780",
      "fileName": "DKVersion1-32669-1-0.rar",
      "uploadedUnix": "1362241425",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6432c849da20c26556cc8f5dda894b85af6ff0cb8fed5d281f7b721b243172b5/analysis/1407448107/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DKVersion1-32669-1-0.rar?fid=1000014432&ttl=1535809309&ri=8192&rs=8192&setec=27fab876716116cff89161be3a774f41"
    },
    {
      "fileId": "1000015793",
      "name": "DKVersion2",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19640",
      "fileName": "DKVersion2-32669-1-1.rar",
      "uploadedUnix": "1362695277",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b12f6fd6d0b6b5098345e1d7a325a87bd2fb25bbdba7fd3c1918f40b7ef11e1e/analysis/1407457848/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DKVersion2-32669-1-1.rar?fid=1000015793&ttl=1535809310&ri=8192&rs=8192&setec=6b95810cce0e3ce0bf37c55428578766"
    }
  ]
}