{
  "modId": 3267.0,
  "modName": "ENBSeries graphic enhancement and FXAA Injector Hybrid - Ins",
  "summary": "Absolutely ridiculous upgrade to visuals.  \r\n\r\nALL CREDITS go to Boris Vorontsov for the ENB Series Graphic Enhancement and some_dude for the FXAA Injector.  ",
  "descriptionHtml": "PLEASE NOTE:\r\n-These are not my mods.  I have simply edited the files to obtain the look that I wanted.  ALL CREDITS go to Boris Vorontsov for the ENB Series Graphic Enhancement and some_dude for the FXAA Injector.  \r\n\r\n-Personal preference is everything here.  If you do not like the changes made to the mods, then don\\'t be vocal about it.  Edit them yourselves and find settings that suit YOU.  \r\n\r\nAlright, first of all, I would like to say how shocked I am to see how few downloads the ENBSeries Graphic Enhancement mod has received.  Boris has done a fantastic job with it, and, perhaps a lot of people were turned off by HIS original config settings for the mod.  You must remember that the files are fully editable and can be changed to your liking.  \r\n\r\nThis is what I have done.  I wasn\\'t particularly satisfied with how high the brightness was and how low the contrast was in the ENBSeries mod.  I thought I would merge it with the FXAA Injector to achieve the SSAO (and more) that the ENB adds, as well as the defined shadows and lighting that the FXAA adds.  This is my result.  \r\n\r\nINSTALLATION:\r\n1. Download the file\r\n2. Open the .RAR\r\n3. Extract all files into your main Skyrim directory\r\n(program files>steam>steamapps>common>Skyrim)\r\n4. Enjoy\r\n\r\nQUESTIONS:\r\nIf you have any questions or concerns, please refer to either the ENBSeries Graphic Enhancement mod found here:\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2971\r\n\r\nOR\r\n\r\nThe FXAA Post Process Injector mod found here:\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=131\r\n\r\nENJOY!\r\n \r\n\r\n\r\n",
  "categoryId": "62",
  "version": "1.0",
  "author": " Boris Vorontsov and some_dude ",
  "createdUnix": "1323555914",
  "updatedUnix": "1323555914",
  "containsAdultContent": false,
  "uploadedBy": "demonic790",
  "primaryFile": null,
  "files": []
}