{
  "modId": 32671.0,
  "modName": "Northern Hideout",
  "summary": "A secret lair in a giant glacier! This house is the ultimate hideout that everyone is looking for",
  "descriptionHtml": "my first mod, always loved pinewoods cottage, but half the time my game would crash while walking in, so i made my own home to my liking, its a bit bare, so if anyone wants to take it, dress it up more and repost it u are more than welcome to. if anyone knows how to place gemstones and have them stationary and non pickable, please let me know\r\n\r\n\r\nthis mod includes:\r\n9 book shelves\r\nall the crafting table thingamajigs\r\ntonnes!!!!! of display cases and plaques for weapons\r\nbout 16 manniquens i think\r\nsecret treasure room\r\n- in the treasure room you will notice the safe says \\\"Gemstones\\\" it is because i am currently working on a mod to add another 50 - 100 different types of gemstones since ive waited a year and nobody has done it, cant figure out how to change the color on the textureless gemstones so im just retexturing and creating new gemstones from different items, will post it when its ready\r\n\r\nNOTE!!!!!!  HOW TO GET TO THE HOUSE!!!!!!\r\nits north of Dawnstar on a giant glacier that requires the basic whirlwind shout to even hope to try and climb it, if your a bad mountain climber, u may not get to the house lol\r\n\r\nby the way, if you can climb that glacier! u deserve a medal (in this case, an awesome home!), since it took me like a half hour the FIRST time!\r\n\r\n\r\nRequirements: Deus Mons\r\nhttp://skyrim.nexusmods.com/mods/11803\r\nthis mod will not work without this mod\r\n\r\nCredits: Deus Mons!!!! they made the multiple book shelves and dining area that i incorperated into this mod!! they are the master engineers so go download their great mod to play this one!",
  "categoryId": "67",
  "version": "1.0",
  "author": "zephur6788",
  "createdUnix": "1362250818",
  "updatedUnix": "1362249729",
  "containsAdultContent": false,
  "uploadedBy": "Zephur6788",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014466",
      "name": "Northern Hideout",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "71",
      "fileName": "Northern Hideout-32671-1-0.rar",
      "uploadedUnix": "1362249729",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/213d24acf70bf485acf3e40921271089ef8930e2aa067ea6289b2d48fb02f0ef/analysis/1407448420/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Northern%20Hideout-32671-1-0.rar?fid=1000014466&ttl=1535809315&ri=8192&rs=8192&setec=e1ab1cc8584ab70da6639e0be27c20de"
    }
  ]
}