{
  "modId": 32683.0,
  "modName": "Archmage Robes Replacer - Royal Vampire Armor",
  "summary": "Replaces the Archmage Robes you get at the end of the College of Winterhold questline with the Royal Vampire Armor you see Serana wearing. Requires the Dawnguard DLC.",
  "descriptionHtml": "I absolutely hated the Archmage Robes but loved the enchantment. There were a ton of great mods out there that replace the Archmage Robes already but I\\'m replaying Dawnguard, and knew right away that I wanted Serana\\'s armor. \r\n\r\n**REQUIRES DAWNGUARD**\r\n\r\nEverything changed and added counts as clothing, has zero armor, and won\\'t affect the mage armor perk.\r\n\r\nThis mod **WILL** conflict with anything that replaces the Archmage Robes, or the boots. I created a new piece of clothing for the gloves, so it shouldn\\'t change anything else in game.\r\n\r\n----------------------------------------\r\n----------------------------------------\r\n\r\nI changed a few things:\r\n\r\n- Replaced both the hooded and hoodless version of the Archmage Robes for males and females. \r\n\r\n- Gave the hoodless version the same enchant as the hooded Archmage Robes (it normally is missing the +50 magicka). You could wear a circlet under the hooded Archmage Robes anyway, so I don\\'t find this overpowered or cheating in any way. I keep both in my inventory and swap constantly.\r\n\r\n- Renamed the hoodless version of the robes to Archmage\\'s Robes (Hoodless) for better sorting, and to make it easier to tell the difference. Added a set of the hoodless robes to the chest at the foot of the bed in the archmage quarters.\r\n\r\n- Renamed the boots you find in the Archmage quarters to Archmage\\'s Boots for better organization, and so it feels like part of a set. Also replaced the mesh with the light armor version of the Vampire Boots.\r\n\r\n- Added an item called Archmage\\'s Gloves with the Vampire Gauntlents mesh, and gave it a Resist Magic 10% enchant. They are on the same table as the Archmage\\'s Boots in the Archmage Quarters.\r\n\r\n----------------------------------------\r\n----------------------------------------\r\n\r\nBugs and Feedback\r\n\r\nThis is my first mod, I had to figure out everything as I went along so forgive me if there are any bugs. There shouldn\\'t be, I haven\\'t noticed anything in 40 or so hours of gameplay, but if you find anything definitely let me know.\r\n\r\nIf anyone wants a version with the hoodless Archmage Robes to have its default enchantment just leave a comment. I also don\\'t mind making some changes and adding some different versions if anyone wants.\r\n\r\n----------------------------------------\r\n----------------------------------------\r\n\r\nInstallation\r\n\r\nWith NMM\r\nJust press \\\"Download with Manager\\\", activate, and you\\'re good to go. \r\n\r\nManual\r\nExtract the .esp from the archive and place in your Data folder, and select it under Data Files on the main Skyrim loader.\r\n\r\n----------------------------------------\r\n----------------------------------------\r\n\r\nSuggested Mods:\r\n\r\n\r\nA black and simple Archmage Robe Replacer by Adrius\r\nhttp://skyrim.nexusmods.com/mods/1429\r\n\r\nThis mod changes the Archmage robes to the set you see Farengar wearing. I used it for the longest time until I decided I wanted to make my own.\r\n\r\nElder Scroll on back by ShatteredSteel\r\nhttp://skyrim.nexusmods.com/mods/21709\r\n\r\nI was going to try to figure out how to do this myself until I saw it was already done! Looks great with a mage character, and with the Royal Vampire Armor you look just like Serana.",
  "categoryId": "60",
  "version": "1.0",
  "author": "nate1232",
  "createdUnix": "1362257051",
  "updatedUnix": "1362256844",
  "containsAdultContent": false,
  "uploadedBy": "nate1232",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014502",
      "name": "Archmage Robes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Archmage Robes-32683-1-0.rar",
      "uploadedUnix": "1362256844",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9250ba6e39c55aa1325d0c948a27643f05120a7483a1edeb87e5d47c4db2f1f3/analysis/1407448579/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Archmage%20Robes-32683-1-0.rar?fid=1000014502&ttl=1535809337&ri=8192&rs=8192&setec=314f8bbe983ebf501e6992b73c0723c0"
    }
  ]
}