{
  "modId": 32719.0,
  "modName": "Dragon Powers by Mordrid Cowl",
  "summary": "A alternative to some Dragon Shout overhauls out there. I think this will make many ppl very happy to \\\"use\\\" their Shouts again.",
  "descriptionHtml": "Welcome to my 4th Mod for Skyrim.\r\n\r\nI had the notion to enhance the dragon shouts in the vanilla game. I did some research and found some mods that have done this already, but each one has a aspect I didin\\'t want my mod to have. Once you alter the in game shouts, the enemies who also use the shouts will use them against you. Most of the time, the extra damage you add ends up killing you when you would normally survive. That is where my mod is different.\r\n\r\nThis mod adds 25 new \\\"lesser powers\\\" to the game that are infact enhanced dragon shouts and spells! \r\n\r\nOnce you\\'ve installed the mod, nmm is the easiest; you can craft the Dragon Power Tomes at any forge under the misc catagory....eventually. I made the recipes a bit tricky. \r\n\r\nAt 1st you won\\'t see any recipe under misc except a Dragon Power Manual. It requires \\\"The Book of the Dragonborn\\\" book that most of us find during our escape from Helgen. If you lost your copy, don\\'t worry, all the manual covers is what I\\'m typing now. The manual is just an ingame reference for the recipes.\r\n\r\n\r\nEach recipe has a base set of ingrediants. They are as follows:\r\n\r\n1 Dragon Bone\r\n1 Dragon Scale\r\n1 Dragon Tongue\r\n1 Ruined Book\r\n1 Black Soul Gem (filled with a Grand Soul)\r\n\r\n\r\n\r\n15 of the Dragon Power recipes require you to have learned the 1st part of the 15 corresponding shouts along with the base set of ingrediants. If you don\\'t know the shout, the recipe wont appear. \r\n\r\n\r\nEach of the 15 following Dragon Powers are enhanced versions of their corresponding Dragon Shout. Here is the description.\r\n\r\n\r\nArctirus = Frost Breath. 54pts dmg for 15sec to Health and Stamina\r\n\r\nAsunder = Disarm. Disarms and destroys enemy armor ratings\r\n\r\nCall To Kin = Call Dragon. Call a permanant Dragon for your aid\r\n\r\nCall to Nature = Animal Allegiance. Calls all nearby animals to fight for you permanantly.\r\n\r\nDragon Fury = Elemental Fury. Fight with the speed of a Dragon for 3 min with any unenchanted weapon\r\n\r\nGlacier = Ice Form. Enemies will be trapped in unyeilding Ice forever and sustain 10pts dmg until they DIE!\r\n\r\nInfernus = Fire Breath. 270pts Fire dmg to Health. Targets on Fire take extra dmg\r\n\r\nRejuvenate = Become Ethereal. You cannot harm, nor be harmed while Health, Magicka, and Stamina regen 1,000% faster for 1 min\r\n\r\nRott Flesh = Marked for Death. Target suffers 20pts for 5min Health dmg\r\n\r\nStop = Slow Time. Time moves at 0.01% its normal pace for everyone except you for 10sec\r\n\r\nSubmission = Dragon Rend. All dragons affected will bend to your will for 1 min\r\n\r\nTerrify = Dismay. Terrfy your enemies forever!\r\n\r\nTranquility = Kyne\\'s Peace. End all hostility around you within 500ft for 1min\r\n\r\nUnbridled Power = Unrelenting Force. Rebuke all in your path with your will and do 100pts Health dmg\r\n\r\nVision = Aura Whisper. See lifes pulse from all within 500ft for 1min\r\n\r\n\r\n\r\n\r\nThe next set of Dragon Powers are considered Master Lvl. Each still required the base ingrediants, but they also have 2 extremely rare additional ingrediant requirments. Thats not all. Untill you learn atleast the 1st word of 20 vanilla Dragon Shouts, these Master Recipes won\\'t even show up!\r\n\r\nThat\\'s right! You\\'ve got to learn all the Dragon Shouts before you can learn the 10 Master Lvl Dragon Powers. But they\\'re worth it.\r\n\r\n\r\nThe following 10 Master Lvl Dragon Powers require the following additional ingrediants, in addtion to having learned all 20 vanilla shouts. They are:\r\n\r\n\r\nBlaze Rune = 1 Spell Tome: Fire Rune, 1 Fire Rune Scroll. Deals 500pts Fire dmg to Health to enemies within 100ft of Rune\r\n\r\nComet = 1 Spell Tome: Blizzard, 1 Blizzard Scroll. 400pts Frost dmg for 15ft aoe\r\n\r\nConsume = 1 Nightingales Vol.1, 1 Nightingales Vol.2. Absorb 100pts Health for 10sec \r\n\r\nDaedric Ally = 1 Spell Tome: Conjure Dremora Lord, 1 Spell Tome: Command Daedra. Summon a permanant Dremora Lord to fight by your side\r\n\r\nDisciple = 1 Hevnoraak\\'s Staff, 1 Dragon Priest Dagger Conjure a permanant Dragon Priest\r\n\r\nDragon Blast = 1 Spell Tome: Bane of Undead, 1 Spell Tome: Guardian Circle. 100pts Fire dmg for 4sec around caster. Heals caster for 10 sec 100pts of Health.\r\n\r\nFreeze Rune = 1 Spell Tome: Frost Rune, 1 Frost Rune Scroll. 500pts Frost dmg for 100ft.\r\n\r\nMeteor = 1 Spell Tome: Fire Storm, 1 Fire Storm Scroll. 400pts Fire dmg for 15ft aoe\r\n\r\nRaze = 1 Spell Tome: Fire Ball, 1 Fire Ball Scroll. 240pts Fire dmg for 15 ft aoe\r\n\r\nVoltage Rune = 1 Spell Tome: Shock Rune, Shock Rune Scroll. 500pts Shock dmg.\r\n\r\n\r\n\r\nEndorse if you like, I\\'m off to bed. Cheers!\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nFor those of you wanting to cheat, you must look inside the offering chest at the base of the steps infront of Highroghgar.\r\n ",
  "categoryId": "75",
  "version": "1.0",
  "author": "Mordrid Cowl",
  "createdUnix": "1362309073",
  "updatedUnix": "1362348577",
  "containsAdultContent": false,
  "uploadedBy": "Mordrid Cowl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014834",
      "name": "Dragon Powers V1_0 ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "631",
      "fileName": "Dragon Powers V1_0 -32719-1-0.rar",
      "uploadedUnix": "1362348577",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/25de534755ccd8f1e00ad5241ce9ef6201ac162f306e81c2c94928f7f8ba6f80/analysis/1407451226/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Powers%20V1_0%20-32719-1-0.rar?fid=1000014834&ttl=1535809384&ri=8192&rs=8192&setec=89d3f453ad1e4d1307bfba527964d4ec"
    }
  ]
}