{
  "modId": 32735.0,
  "modName": "The Lucky Horker Inn",
  "summary": "Overlooking the rough coast of the Sea of Ghosts high up in northeastern Skyrim there nestles a little inn under the last snowy pine trees ...\r<br />You will find Honnalee here, the Khajiit inn keeper, as well as Ylva Silver-Lute, the bard, and the two guests and possible followers Nimue Albarogh and Dances with Ice Wolves - and a home for yourself",
  "descriptionHtml": "[color=orange]The Lucky Horker Inn\r<br />A Merchant & Player Home & Follower-Mod\r<br />English Version\r<br />by &#34;Fireandflame&#34;[/color]\r<br />\r<br />\r<br />[img] http://static-2.nexusmods.com/15/mods/110/images/32735-1-1362350787.jpg [/img]\r<br />\r<br />[color=aquamarine]Overlooking the rough coast of the Sea of Ghosts high up in northeastern Skyrim there nestles a little inn under the last snowy pine trees ...[/color]\r<br />\r<br />------------------------------------------------\r<br />\r<br />\r<br />[size=2,5]Now with a video review made by &#34;olivierhacking&#34;  - thank you very much&#33;&#33;&#33;[/size]\r<br />\r<br />\r<br />[youtube]YLM8c0bKHY0[/youtube]\r<br />\r<br />\r<br />The video is showing version 1.2\r<br />Only the underground greenhouse, the &#34;Lucky Horker Conservatory&#34;, has been skipped. The entrance seems to be rather, hm, unobstrusive.\r<br />I really didn&#39;t mean to hide it, but it was Easter, when I uploaded the new version - lol.\r<br />So, your player home is not that small anymore ;-) But it&#39;s just a nice little cellar greenhouse, no big thing. Big things are plans for the future.\r<br />The entrance is a trapdoor in the study - the information is added meanwhile to the video. Anyway, hope you enjoy watching it&#33;\r<br />\r<br />\r<br />------------------------------------------------\r<br />\r<br />\r<br />[color=aquamarine] [b] [size=4] What you will find here: [/size] [/b]\r<br />\r<br />\r<br />- a medium sized home in in a scenic and snowbound coastal region but not too far from civilization\r<br />(from your porch you will overlook the Sea of Ghosts while Dawnstar is just around the mountain).\r<br />- a house mod that might suit any kind of character - mage, warrior, rogue, or hunter ...\r<br />- it is lore-friendly, not overdone, no cheat-items, rustical but with decent comfort, complete crafting equipment, stables,\r<br />  some extra beds for followers, and a lot of safe storage\r<br />- a warm and lived-in place, but with a home only for yourself and personally invited guests\r<br />- a little quest to get access to the extra player home (so it is not just for free)\r<br />- two possible followers staying at the inn (Argonian warrior and Dunmer archer)\r<br />- a rather unique and friendly merchant, not directly in the player home but under the same roof, and another merchant quite close in the neighborhood\r<br />  This last point makes life much easier out there in the wilds - and is something I painfully miss in many otherwise beautiful wilderness house mods.\r<br />\r<br />- New in V1.2: An underground greenhouse with respawning fruit crates, plants, and planters,\r<br />  and some insects - all other containers in V1.2 are safe\r<br />\r<br />- New in V1.1: A respawning barrel in the backyard labeled &#34;Fresh ingredients&#34; - all other containers in V1.1 are safe\r<br />\r<br />All in all I aimed for a thought-out and useful house mod in the Sea of Ghosts/Dawnstar area, complete with everything you might need.\r<br />\r<br />The mod has been cleaned with TES5Edit.[/color]\r<br />\r<br />\r<br />------------------------------------------------\r<br />\r<br />[color=orange][size=3]Some backstory:[/size][/color]\r<br />\r<br />Meet the innkeeper Honnalee, a former caravan merchant who decided to settle down for a while, tired of freezing her whiskers off every night in the bitter cold.\r<br />Of course she wouldn&#39;t give up on doing business and she needed a place where she could stay in peace - so when she got the opportunity to take over the old Lucky Horker Inn it seemed to be the perfect place to her.\r<br />Being a trader with her heart and soul Honnalee not only sells the usual inn food and drinks but she can also provide you with a lot of other goods.\r<br />As a very likeable and smart person she managed to keep good business contacts with the caravan leader Ahkari as well as already attracting some regulars and residents to the inn.\r<br />And she really doesn&#39;t mind whether you&#39;re stormcloak or not, politics are not her issue, so everyone is welcome to the Lucky Horker Inn.\r<br />You will find Argonian warrior Dances with Ice Wolves and Dunmer archer Nimue Albarogh as her guests, but they were not the only visitors who decided to spend some time in the wilds between Dawnstar and Winterhold.\r<br />\r<br />Yet something has happened to Lucido Curious, the resident of the Lucky Horker basement (the so-called &#34;Lucky Horker Suite&#34;), he is missing for a short time now.\r<br />If you bear the challenge to discover what is going on there, you might be rewarded for your determination and courage.\r<br />When you have entered the tavern, you may read the note on the counter for more information...\r<br />\r<br />\r<br />------------------------------------------------\r<br />\r<br />[color=IndianRed][size=3]Updates/Changes:[/size][/color]\r<br />\r<br />\r<br />Yay, it is updated&#33; As a thank-you for the endorsements and nice comments and because I like the Lucky Horker Inn so much myself :-))\r<br />\r<br />[color=IndianRed]V1.2: Enhanced Version[/color] \r<br />The same fixes as in V1.1 and more changes (a lot of modder&#39;s resources), including a new underground greenhouse, the &#34;Lucky Horker Conservatory&#34;\r<br />Please note: All plants and planters down there are respawning - only the cabinet is really safe for storage in the Conservatory&#33;\r<br />[color=IndianRed]V1.1: Basic Version[/color] Some fixes and minor changes - for those who want to stay close to the original plain-vanilla version\r<br />\r<br />There is always the equivalent “Follower-Go-Home version” (FGH) where dismissed followers will go home to the Lucky Horker Inn\r<br />instead of staying wherever you dismiss them.\r<br />\r<br />You can upgrade to whatever version - I didn’t replace or remove any existing containers/mannequins/weapon displays, so upgrading will be safe.\r<br />(E.g. you could try the Basic Version first and then advance to the Enhanced Version and you can even switch between the main and the FGH versions.)\r<br />Find more details below.\r<br />\r<br />\r<br />[center][img] http://static-3.nexusmods.com/15/mods/110/images/32735-1-1364647420.jpg[/img][/center]\r<br />\r<br />[color=coral]As always – make a savegame before updating ….[/color]\r<br />\r<br />\r<br />[color=IndianRed]Update 1.2 Enhanced Version\r<br />The same fixes as in V1.1 (minus the &#34;Fresh Ingredients&#34; barrel) and a lot of modder&#39;s resources (plus the &#34;Lucky Horker Conservatoy&#34;)[/color]\r<br />\r<br />- Added a lot of modders resources (some new food and alchemy containers, a jewel box in the master bedroom, a keyholder, static objects like paintings and planters, and more …)\r<br />- A new greenhouse called the “Conservatory” with a lot of flora and some insects which is accessible via a trapdoor in the study\r<br />  All the plants and planters, and fruit containers there are respawning - only the “cabinet” is safe for storage\r<br />  (Though I hoped it would be 10 days the respawning period seems to be 20-30 days here, so only after not entering the Conservatory for at least 20 days the containers and plants will respawn.)\r<br />- Two new shrines: A shrine of Julianos in the Suite and a shrine of Mara in the “Conservatory”\r<br />\r<br />I think I have packed the meshes and textures for the included modder&#39;s resources accurately now, but please report when anything is missing or not working. Thank you&#33;\r<br />I added some new static objects – in case you have placed something else at the same spot it will be pushed aside (maybe check the new screenshots).\r<br />I deleted some bottles, cups, loafs of bread, potion flasks to make room for some of the fancy new modder&#39;s resources …\r<br />I really had fun choosing and adding them to the Lucky Horker (and I just could not resist to add Mr. Snowman, the little elf dolls, and the scarecrow) – I hope you will enjoy the result as much :-)\r<br />\r<br />[color=IndianRed]Update 1.1 Basic Version with fixes and minor changes - very close to V1.0[/color]\r<br />\r<br />- Fixed the door between the main room and Nimue&#39;s and Ice Wolve&#39;s room in the Inn (there was still a little gap)\r<br />- Fixed the weapon plaque above the master bed to improve accessibility when holding a weapon\r<br />- Changed Nimues hairstyle to also show her ears (for visible earrings/ear piercings)\r<br />- Set both cells (Lucky Horker Inn and Suite) to “NoResetZone” (default setting for vanilla player houses)\r<br />  You will not lose anything in the old version, but now mannequins and weapon displays will always work like intended.\r<br />(See &#34;Issues/Conflicts&#34; below for more details)\r<br />  But plants and herbs will never respawn again. That is why I added 1 respawning barrel labeled “Fresh Ingredients” outside to the backyard - all other containers in this version are safe\r<br />  (Inside a „NoResetZone“ nothing ever respawns, not even containers that are set to respawn, so I placed this barrel outside the house – respawning period seems to be 30 in-game days)\r<br />\r<br />Please note the plants and herbs in the Inn and the Suite will never respawn again – maybe you want to keep them for decoration.\r<br />If the weapon plaque above your master bed holds a weapon, you may remove it before upgrading (should be possible, but a bit difficult, I fixed that, it will work much smoother in the new version).\r<br />If you want to upgrade without removing the weapon it should be alright, too, I always got the old weapon back in the new version (it was half sunken into the weapon plaque then, but still accessible)\r<br />\r<br />[color=IndianRed]Update 1.0 Follower Go Home-Version[/color]\r<br />\r<br />Alternative &#34;Follower Go Home Version&#34; (FGH) added (as requested by JJDrakken)\r<br />Dismissed followers will return home instead of staying at the current location (will hopefully also work with the mod &#34;My Home is your Home&#34; now)\r<br />You can switch between both versions, it doesn&#39;t affect the inventory of the followers, they will keep what you gave them ... \r<br />\r<br />If you have hired them before - using the original/main version of the mod - make a save game before trying to switch to this version and keep it until you are sure it works for you.\r<br />It should work in general (I have tested it several times), but you never know what happens in detail, so you might need a second try. You might wait an hour for them to show up, also.\r<br />(I have lost Nimue once because she preferred listening to the bard performance at the other inn instead of leaving and then her follower options were all messed up.\r<br />But after complaining about that the next time she didn&#39;t listen to the bard at all, you can see it in the latest screenshot, - good Nimue :-))\r<br />\r<br />\r<br />------------------------------------------------\r<br />\r<br />\r<br />[color=orange][size=3]Included features in detail (V1.0):[/size][/color]\r<br />\r<br />Interior and exterior completely navmeshed and follower friendly (there might be glitches outside especially with more than one follower but they should never get stuck or lost)\r<br />Stables and place for some more horses behind the inn (the place is quite safe, no monster spawns close-by, not even from SkyMoMod :-))\r<br />All crafting stations:\r<br />Outside: smelter, tanning rack, wood chopping block\r<br />Inn: alchemy station, cooking station\r<br />Suite: cooking pot, tanning rack, sharpening wheel, workbench, forge, enchanting & alchemy station with a small indoor alchemy garden (since it&#39;s too cold outside for most plants)\r<br />A lot of safe storage (no respawning containers inside and around the house)\r<br />1 shrine of Dibella\r<br />8 armor mannequins\r<br />4 big display cases\r<br />2 dagger display cases\r<br />4 weapon racks\r<br />9 normal weapon plaques\r<br />1 double weapon plaque (recommended for great weapons or staffs)\r<br />3 bookcases (one of them &#34;working&#34; with three rows for books or other stuff) \r<br />1 good merchant: &#34;Honnalee&#34;, as described (and another merchant who is not included in the mod but conveniently close - you will find out about that yourself)\r<br />1 working bard: &#34;Ylva Silver-Lute&#34;, a breton maid who is half-blind and found a safe place to stay and work in Honnalee&#39;s inn\r<br />2 possible followers: &#34;Nimue Albarogh&#34;, a Dunmer archer, and &#34;Dances with Ice Wolves&#34;, an Argonian warrior (one-handed)\r<br />If you accept them as followers and dismiss them later, they will stay at the current location so it&#39;s easy to bring them to another place.\r<br />Beds: the 4 beds in the Lucky Horker belong to it&#39;s inhabitants - but good Honnalee wouldn&#39;t keep freezing weary visitors from using the 2 hay bedrolls in the back of the inn.\r<br />3 more single beds for followers in the Lucky Horker Suite as well as 1 double bed in the master bedroom (on the whole you can bring 5 companions and maybe 1 spouse and have Nimue and Ice Wolves as followers, too)\r<br />Some rewarding loot - in case you manage to lockpick Honnalee&#39;s 2 cupboards with extra supplies. Being more active in trading than the usual inn keeper I thought she needed this extra storage.\r<br />\r<br />Services officially: Honnalee from 10am to 1am - Ylva from 1pm to 1am\r<br />\r<br />[color=orange]A quest[/color] in order to get access to the Lucky Horker Suite\r<br />The quest is not scripted, so please read the note Honnalee placed on the counter as information and warning for new visitors.\r<br />Your char should at least be around level 15 and have some very good equipment and followers - or find a way to outwit your opponent, then it won&#39;t be so hard. Make a savegame before trying&#33;\r<br />(Okay - there is a hint at the bottom of the readme.)\r<br />\r<br />[color=darkcyan]Followers (more details)[/color]\r<br />They come with some perks because I play with &#34;Mighty Dragons&#34; and &#34;SkyrimMonsterMod&#34; and need strong companions.\r<br />They are &#34;essential&#34; by default, marriable, and will level from level 8-80 with the player.\r<br />\r<br />[color=darkcyan][u]Nimue Albarogh[/u][/color]\r<br />Stats/Skills: Sneak, Archery, Light Armor (Alteration, Destruction, Restoration)\r<br />Spells: RaceDarkElf, PowerDarkElfFlameCloak, Fast Healing, Healing Hands, \r<br />Perks:  Stealth40, Overdraw20, AgileDefender20, MuffledMovement\r<br />\r<br />[color=darkcyan][u] Dances with Ice Wolves [/u][/color]\r<br />Stats/Skills: Heavy Armor, One-Handed, Archery, Block, Lockpicking\r<br />Spells: RaceArgonianResistDisease, PowerArgonianHistskin\r<br />Perks: ShieldWall20, Armsman40\r<br />\r<br />------------------------------------------------\r<br />\r<br />[color=orange][size=3]Requirements:[/size][/color] None (only pure vanilla Skyrim ;-))\r<br />\r<br />------------------------------------------------\r<br />\r<br />[color=orange][size=3]Issues/Conflicts:[/size][/color]\r<br />Oh yes, I had some building the Lucky Horker Inn ... ;-)\r<br />I should have fixed most of them now, speaking of navmeshes, light sources, AI packages, merchant conditions ... \r<br />\r<br />[color=chocolate]Merchant container:[/color] The only way (and I tried every trick I could think of) to give Honnalee an intact merchant dialogue was adding her to Ahkari&#39;s merchant faction (&#34;caravancleader&#34;)-\r<br />this means they are sharing the same merchant container and will show an identical range of items&#33; (With the &#34;Golden Vendors&#34; 1 day restocking-period you would hardly ever notice.)\r<br />Considering Honnalee being a former caravan merchant herself and still being in contact with Ahkari fortunately this feels rather natural.\r<br />But I changed the container slightly - I added &#34;vendorgold&#34; (so you will see the effects of the mod &#34;Golden Vendors&#34;) and some food, drinks and ingredients. (I guess Ahkari wouldn&#39;t complain.)\r<br />This will conflict with any other mod changing this merchant chest - in that case just load the mod with the changes you want to keep last/lower in the load order.\r<br />\r<br />The three deer/elks close to the inn sometimes just went too crazy while turning out to be immortal (maybe a mod conflict in my game),\r<br />so I made them unique, non-agggressive, and slowed them down a bit. They will still respawn, so as a hunter you can have the cake and eat it ;-)\r<br />(I placed one of the three somewhere behind the house.)\r<br />\r<br />Sometimes the music won&#39;t play in the Suite, I have no idea why.\r<br />\r<br />[color=chocolate]Initial reason for the updates V1.1 and 1.2 (what to consider after a cell reset in V1.0):[/color]\r<br />\r<br />I had a closer look into the conflict whether to set a cell to reset/respawn or not.\r<br />Both Lucky Horker Inn and Suite were set to reset because I wanted the herbs and plants to respawn (after not entering the cells for 10 ingame days they would regrow)\r<br />A cell reset doesn’t mean you would lose anything there (so you can calm down now ;-)) but the weapon plaques/racks and mannequins will behave a bit weird.\r<br />Mannequins will hide their inventory, you have to take the items that are still in there and give them back (or something new), then they will work properly again until the next cell reset.\r<br />Some weapons may lay on the ground – and if you pick one from a plaque/rack, you have to leave and re-enter the cell (just go through the door between the inn and the suite), then they will work again.\r<br />After testing it several times I found a way to make the weapon plaques stable, but not the mannequins – and found the whole situation just too annoying.\r<br />So I set both cells to “NoResetZones” meaning everything there will always work like intended – but nothing will ever respawn also –\r<br />that is why I added the respawning “Fresh ingredients” barrel outside the house in the Basic Version\r<br />and with the Enhanced Version you get the “Conservatory”.\r<br />\r<br />\r<br />------------------------------------------------\r<br />\r<br />[color=orange][size=3]Recommended Mods:[/size][/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/10652] Vanilla Mannequin Script Fix [/url]  by SLuckyD\r<br />(makes those creepy mannequins stay put&#33;)\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/11370] Spouses Can Live Everywhere [/url]  by Amgepo and Emma\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/7315] Golden Vendors [/url]  by RivvqPL\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/14037] Ultimate Follower Overhaul (UFO)[/url] by fLokii\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/23812] ENB: Seasons of Skyrim [/url]  by Bronze316\r<br />Everything looks much better and vanilla shadows are rather creepy especially in the Suite.\r<br />(Of course there are other beautiful ENB-mods ...)\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/4955] 83Willows 101BugsHD Butterfly Dragonfly Luna-Moth Torchbug by 83Willow [/url]\r<br />Recommended for better insects/butterflies (in version 1.2 there are some nice, err, bugs ;-))\r<br />\r<br />\r<br />[u] Facial and body texture mods[/u] which I have installed and whose effects you can see in the screenshots\r<br />Especially Nimue and Ylva will look different without them - for the better, the worse or just different, lets see ...\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/2666] Female body: CBBE [/url]  by Caliente\r<br />(I am still using CBBE V3.1 slim)\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/3563] Female face: Coverwomen [/url]  by mrLenski\r<br />(I am using look #3)\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/2464] Bright Eyes [/url]  by Skree000\r<br />(I am using the latest version v1-3 for my NPCs)\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/7712] JazzJR Argonian Retexture[/url] by JazzJR\r<br />(Bright Version)\r<br />\r<br />\r<br />The Whiterun texture replacer I use and whose impacts you see in the screenshots of the Lucky Horker Suite (it is the copy of a Whiterun interior):\r<br />[url=http://skyrim.nexusmods.com/mods/8143] Alternatives - Whiterun [/url] by ZayLa\r<br />(v1.2 with Yellow Roofs)\r<br />\r<br />------------------------------------------------\r<br />\r<br />[color=orange][size=3]Installation:[/size][/color]\r<br />\r<br />I started to build the mod a while ago so it still comes with an esm- and an esp-file (it was needed to fix the face tint bug).\r<br />\r<br />NMM or\r<br />Manually:\r<br />Download the file, unpack, and drop the Data folder into your Skyrim folder (which already contains a &#34;Data&#34; folder).\r<br />Overwrite, if asked. (There are also meshes and textures included for the faces.)\r<br />Check the &#34;FF Jolly Horker.esm&#34; as well as the &#34;FF Jolly Horker 1.esp&#34; in your skyrim launcher/mod manager.\r<br />\r<br />Yes, the files are called &#34;Jolly Horker&#34;.\r<br />Originally I was thinking about a &#34;Happy Horker Inn&#34; but found out this existed as a Morrowind mod.\r<br />After a &#34;Jolly Horker&#34; period I am happy with the &#34;Lucky Horker Inn&#34; now. But renaming the files caused some problems so I let it alone.\r<br />\r<br />------------------------------------------------\r<br />\r<br />[color=orange][size=3]Credits to:[/size][/color]\r<br />\r<br />All the authors of the above mentioned mods\r<br />Bethesda for this tremendous game (and the whole TES series)\r<br />and to countless other modders for adding so much to our Elder Scrolls universe (and inspiring my own modding experience).\r<br />&#34;JJDrakken&#34; for liking the Lucky Horker Inn so much right from the start and helping me answering questions etc..\r<br />\r<br />Additional Credits V1.2:\r<br />&#34;Runspect&#34; for the wonderful and creative modder&#39;s resource pack: [url=http://skyrim.nexusmods.com/mods/26132] &#34;Resources for modders&#34; [/url]\r<br />&#34;Oaristys&#34; and &#34;Tony67&#34; for their beautiful modder&#39;s resources: &#34; [url=http://skyrim.nexusmods.com/mods/16525] &#34;Modders Resource Pack&#34; [/url]\r<br />&#34;Blary&#34; for several very useful modder&#39;s resources\r<br />  I was working with the [url=http://skyrim.nexusmods.com/mods/14133] &#34;FoodContainer Resource&#34; [/url], [url=http://skyrim.nexusmods.com/mods/30602] &#34;Ingredients Wall Art Resource&#34; [/url] , and [url=http://skyrim.nexusmods.com/mods/30601] &#34;Ingredients in a Jar Resource&#34; [/url]\r<br />&#34;Artisanix&#34; for so many new paintings and canvas we can add to Skyrim now: [url=http://skyrim.nexusmods.com/mods/17423] &#34;Paintings and Frames&#34; [/url]\r<br />\r<br />Thank you so much for sharing your great work with other modders&#33;\r<br />\r<br />\r<br />------------------------------------------------\r<br />\r<br />\r<br />Of course constructive critisism, advice and endorsements are always welcome ;-)\r<br />\r<br />[color=coral]Endorsements[/color] really mean much to a modder - I have just published my first mods on the nexus, this one being the biggest, and know it now myself.\r<br />It&#39;s like getting a bunch of flowers as a reward for all the work - or for a male modder rather a crate of beer ;-)\r<br />So if you like a mod, please endorse it&#33; I have endorsed a lot more the last days ...\r<br />\r<br />------------------------------------------------\r<br />\r<br />\r<br />[color=darkorange][size=4]Have Fun&#33;[/size][/color]\r<br />\r<br />\r<br />------------------------------------------------\r<br />\r<br />[color=Chartreuse][size=3]My other mods: [/size][/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/31794] Caethspell Caverns Overhaul [/url]\r<br />Now a complete player home with all crafting stations, follower beds, and it&#39;s own little merchants\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/32493] More Solstheim Followers [/url]\r<br />Adds four UFO-compatible followers to Raven Rock and Skaal Village\r<br />\r<br />------------------------------------------------\r<br />\r<br />\r<br />[color=bisque]English is not my first language, but I am trying my best ;-)\r<br />\r<br />And in German &#34;to be fire and flame for something&#34; means to feel really enthusiastic about it -\r<br />that is why I chose this name some years ago when I started playing and modding Oblivion, and then Morrowind, and Fallout3 - and meanwhile Skyrim.[/color]\r<br />\r<br />",
  "categoryId": "67",
  "version": "V1.2",
  "author": "Fireandflame",
  "createdUnix": "1362359555",
  "updatedUnix": "1364602136",
  "containsAdultContent": false,
  "uploadedBy": "Fireandflame",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014887",
      "name": "The Lucky Horker Inn",
      "version": "V1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "675",
      "fileName": "The Lucky Horker Inn-32735-V1-0.7z",
      "uploadedUnix": "1362357586",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/da325da1a49247639465c091393d772b6d59df96f59c1dce4ed4f17f17c4f2a5/analysis/1407451508/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Lucky%20Horker%20Inn-32735-V1-0.7z?fid=1000014887&ttl=1535809408&ri=8192&rs=8192&setec=c3265f4b55b6216278840bef6cf22b7c"
    },
    {
      "fileId": "1000015946",
      "name": "The Lucky Horker Inn - FGH",
      "version": "V1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "674",
      "fileName": "The Lucky Horker Inn - FGH-32735-V1-0.7z",
      "uploadedUnix": "1362760231",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e05900aef4a3d34b5e0aa9f33b8cd94741ce2e20467556834d8767214d4a58a9/analysis/1407458892/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Lucky%20Horker%20Inn%20-%20FGH-32735-V1-0.7z?fid=1000015946&ttl=1535809409&ri=8192&rs=8192&setec=51a3efe65908ea465b17edbecd8849b3"
    },
    {
      "fileId": "1000021007",
      "name": "The Lucky Horker Inn - Enhanced Version FGH",
      "version": "V1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10096",
      "fileName": "The Lucky Horker Inn - Enhanced Version FGH-32735-V1-2.7z",
      "uploadedUnix": "1364598880",
      "modVersion": "V1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b4dc9adad645c6dc283ab4eb4c4e9218a1a9bca8bd43b30929ee8010bf5f81fd/analysis/1407494534/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Lucky%20Horker%20Inn%20-%20Enhanced%20Version%20FGH-32735-V1-2.7z?fid=1000021007&ttl=1535809409&ri=8192&rs=8192&setec=78603e634ca7a212751ab127a36daa0b"
    },
    {
      "fileId": "1000021009",
      "name": "The Lucky Horker Inn - Basic Version",
      "version": "V1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "670",
      "fileName": "The Lucky Horker Inn - Basic Version-32735-V1-1.7z",
      "uploadedUnix": "1364599117",
      "modVersion": "V1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3a636a06320b99bf5685f8291a0659db250f06bf769189d948ba9ed46a2ede5a/analysis/1407494543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Lucky%20Horker%20Inn%20-%20Basic%20Version-32735-V1-1.7z?fid=1000021009&ttl=1535809410&ri=8192&rs=8192&setec=3d69a94cdac88b53fa51b01738968a32"
    },
    {
      "fileId": "1000021011",
      "name": "The Lucky Horker Inn - Basic Version FGH",
      "version": "V1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "671",
      "fileName": "The Lucky Horker Inn - Basic Version FGH-32735-V1-1.7z",
      "uploadedUnix": "1364599260",
      "modVersion": "V1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c96d811fb2c6ab532be2da69b1267345eca509cde1048cb1bd17ac9919d48bb4/analysis/1407494584/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Lucky%20Horker%20Inn%20-%20Basic%20Version%20FGH-32735-V1-1.7z?fid=1000021011&ttl=1535809410&ri=8192&rs=8192&setec=43d9bd7d533f6e1966b32b9ed0b387bd"
    },
    {
      "fileId": "1000021020",
      "name": "The Lucky Horker Inn - Enhanced Version",
      "version": "V1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10093",
      "fileName": "The Lucky Horker Inn - Enhanced Version-32735-V1-2.7z",
      "uploadedUnix": "1364602136",
      "modVersion": "V1.2",
      "virusScanUrl": "https://www.virustotal.com/file/1adeb0dfb9a1beb9c0162ff112625c7b5ab515bd37ebf5eab59186e32b2fa7cd/analysis/1407494593/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Lucky%20Horker%20Inn%20-%20Enhanced%20Version-32735-V1-2.7z?fid=1000021020&ttl=1535809411&ri=8192&rs=8192&setec=55e357f5a1fca34bdcabeab5c1c049be"
    }
  ]
}