{
  "modId": 32751.0,
  "modName": "CotH - Drizzt Wulfgar Catti-brie Bruenor Regis",
  "summary": "Companions of the Hall (CotH) \r<br />Adds the five iconic heroes from &#34;The Legend of Drizzt&#34; book series.\r<br />Custom textures, meshes, and effects used to re-create every detail.\r<br />Drizzt - Drow Ranger\r<br />Wulfgar - Human Barbarian\r<br />Catti-brie - Human Ranger\r<br />Bruenor - Dwarf Warrior\r<br />Regis - Halfling Rogue",
  "descriptionHtml": "[center][b][i][u]CotH is completely Stand-alone and Cleaned.  Vanilla/modded armors/weapons are unaffected.  UFO/AFT/EFF compatible.  [/u][/i][/b][/center]\r<br />\r<br />[center][img]http://static-4.nexusmods.com/15/mods/110/images/32751-1-1362749452.jpg[/img][/center]\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/32751-1-1362752474.jpg[/img]\r<br />[b][u]RACE[/u][/b] - Drow (20% Spell Resistance, 50% Fire Resistance, 80% Poison Resistance)\r<br />[b][u]STATS[/u][/b] - [b]Attack:[/b] Highest  |  [b]Defense:[/b] Low  |  [b]Health:[/b] Low  |  [b]Speed:[/b] High  |  [b]Stealth:[/b] Highest  \r<br />[b][u]COMBAT[/u][/b] - [i]Offensive[/i] : Charging into battle with dual scimitars, summons Guenhwyvar to aid him in combat.\r<br />[b][u]DESCRIPTION[/u][/b]\r<br />Drizzt, the rebel Drow ranger.  Born the night House Do&#39;Urden destroyed House DeVir, the death of Nalfein Do&#39;Urden by the hands of Dinin Do&#39;Urden saved Drizzt from being sacrificed to Lolth. He was trained in magic by his sister Vierna Do&#39;Urden and Drizzt&#39;s father, Zaknafein Do&#39;Urden trained him to master the blade, in both his hands.  On his first Drow raiding party he refused to kill an innocent Moon Elf.  This caused House Do&#39;Urden to lose Lolth&#39;s favor resulting in Zaknafein being sacrificed.  After finding about his father&#39;s fate, Drizzt escaped Menzoberranzan and became a wanderer for many years before being taken in at Blingdenstone, a Deep Gnome city. Later he left to live on the surface where he was taught to be a ranger from Montolio Debrouchee.\r<br />\r<br />It took him many years for his eyes, accustomed to the darkness of Menzoberranzan, to accept the sunlight.  It is almost unspeakable to ever meet a Drow in broad daylight.  As such, Drizzt has become immensely well-known throughout Icewind Dale and Ten Towns.  He has beaten many foes; Giants, Demons, Wizards, Zombies, Drow... there is no foe that can match the ability of Drizzt, except perhaps the dreaded Artemis Entreri.\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/32751-1-1362753745.jpg[/img]\r<br />[i]Cannot be handled by player.  Drizzt summons this companion on his own.[/i]\r<br />[b][u]RACE[/u][/b] - Astral Panther (25% Spell Resistance, 100% Poison/Disease Resistance)\r<br />[b][u]STATS[/u][/b] - [b]Attack:[/b] High  |  [b]Defense:[/b] Low  |  [b]Health:[/b] High  |  [b]Speed:[/b] Highest  \r<br />[b][u]COMBAT[/u][/b] - [i]Support[/i] : Will ambush and surround enemies for the companions.    \r<br />[b][u]DESCRIPTION[/u][/b]\r<br />Not of this world and majestic beyond words, Guenhwyar is a giant black panther that resides in the Astral Plane, and can be summoned by use of an enchanted black onyx figurine.  Guenhwyvar&#39;s figurine was crafted by the finest dwarven craftsman in the Cormanthor region and enchanted by Anders Beltgarden.  It was to be a parting gift for Anders&#39; friend, the Bladesinger, Josidiah Starym, before Anders died of old age.  Josidiah saw an intelligence in the giant panther&#39;s eyes that he felt should not be caged, let alone killed; he thought her body should not be enslaved to magic and a master&#39;s command.\r<br />\r<br />Anders let the cat go, only to have her follow Josidiah to a hill where he was under attack by a trio of giants and several dozen orcs. With the help of the panther and Anders, the monsters were defeated, but the cat was mortally wounded from the battle. The pair rushed her back to Anders&#39; tower and carried out the enchanting ritual to save the panther&#39;s life.  Josidiah decided to name the panther &#34;Guenhwyvar.&#34; the elven word for shadow. \r<br />\r<br />After an event in the underdark, Josidiah lost the figurene, but was later found by Masoj Hun&#39;ett, a Drow wizard who mistreated Guenhwyvar. During Drizzt&#39;s escape he was confronted by Masoj, but he was bested.  Taking the figurine from his corpse, Drizzt established a bond with the summoned animal. After spending some years with Guenhwyvar as his only companion, Drizzt and she became more than just master and servant; they became friends.\r<br />\r<br />Guenhwyvar can be summoned by Drizzt to aid the party.  She will adventure alongside until she feels the need to rest in the Astral Plane, because she cannot stay within the Prime Material Plane, due because she is of Astral property.  If she falls in combat, she will immediately return to the Astral Plane and rest, during this time she cannot be re-summoned. \r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/32751-1-1362755413.jpg[/img]\r<br />[b][u]RACE[/u][/b] - Human\r<br />[b][u]STATS[/u][/b] - [b]Attack:[/b] High  |  [b]Defense:[/b] Medium  |  [b]Health:[/b] Highest  |  [b]Speed:[/b] Low  |  [b]Stealth:[/b] Low  \r<br />[b][u]COMBAT[/u][/b] - [i]Defensive[/i] : Stuns and staggers enemies with his mighty hammer. \r<br />[b][u]DESCRIPTION[/u][/b]\r<br />Wulfgar, son of Beornegar, barbarian hero of Icewind Dale.  There is not enough space on this page to list his heroic and noble deeds.  After a botched attempt by the Elk Tribe to take over Ten Towns, Wulfgar, just a boy then, was knocked unconscious and taken to the mines of Clan Battlehammer, deep within Icewind Dale.  There, he was made to labor for Bruenor, five years, after which he would be given his freedom.  \r<br />\r<br />Working the forge and mining for those long years gave him tremendous strength, and over the years his relationship with Bruenor turned from slaver to father.  Towards the end of his sentence, he was gifted Aegis-Fang, a wondrously crafted warhammer forged by Bruenor himself.  It was the absolute highest point of Bruenor&#39;s smiting career, and no weapon would ever surpass it&#39;s magnificence.\r<br />\r<br />Wulfgar is a mighty barbarian.  Capable of shrugging off the hardest of hits and fighting to his last breath.  His love for the companions is unmeasurable, once even almost dying for their safety.     \r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/32751-1-1362756795.jpg[/img]\r<br />[b][u]RACE[/u][/b] - Human\r<br />[b][u]STATS[/u][/b] - [b]Attack:[/b] Medium  |  [b]Defense:[/b] Low  |  [b]Health:[/b] Medium  |  [b]Speed:[/b] Medium  |  [b]Stealth:[/b] High \r<br />[b][u]COMBAT[/u][/b] - [i]Support[/i] : Shoots explosive arrows from afar.  Can use a sword in close-combat. \r<br />[b][u]DESCRIPTION[/u][/b]\r<br />  Beautiful but deadly isn&#39;t enough justice for Catt-brie, adopted daughter of Bruenor.  Living in the deep mines of Icewind Dale for most of her upbringing she has grown accustomed to hard labor and weapon use.  Catti-brie&#39;s most deadly features come from her use of two powerful artifacts; Taulmaril and Khazid&#39;hea.   \r<br />\r<br />  Taulmaril, once gifted to Clan Battlehammer by Lady Anariel, Sister of Faerun.  Regis found this magical bow in the ruins of the Hall of Dumathoin in Mithril Hall.  Along with the bow was found the Quiver of Anariel, a holster for twenty silver arrows that had the ability to explode when struck, it also has the ability to replenish itself indefinitely.\r<br />\r<br />  Khazid&#39;hea is a sentient sword, capable of sending blood-thristy thoughts to the wielder.  Khazid&#39;hea means &#34;Cutter&#34; in the Drow dialect.  This item was once owned by Dantrag Baenre, the weapons master of House Baenre in Menzoberranzan.  It is always hungry for blood and battle, and it is never sated; it has one desire, to be held by the greatest warrior. \r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/32751-1-1362805003.jpg[/img]\r<br />[b][u]RACE[/u][/b] - Dwarf (25% Spell Resistance, 50% Poison/Disease Resistance)\r<br />[b][u]STATS[/u][/b] - [b]Attack:[/b] Medium  |  [b]Defense:[/b] Highest  |  [b]Health:[/b] High |  [b]Speed:[/b] Lowest  |  [b]Stealth:[/b] Lowest \r<br />[b][u]COMBAT[/u][/b] - [i]Offensive[/i] : Relies on his shield to deflect blows and topple his enemies, waiting for the perfect opening.\r<br />[b][u]DESCRIPTION[/u][/b]\r<br />  Bruenor Battlhammer, Eighth King of Mithral Hall.  Although there is no leader of the Companions of the Hall, if there had to be, no doubt it would be mighty Bruenor.  Commanding thousands of Dwarfs under his clan, Clan Battlehammer, he has taken back his home of Mithral Hall and crowned himself king.  \r<br />\r<br />  Bruenor is the hardiest of the companions.  No amount of punishment or mead will waiver his resolve.  He fights furiously and bravely, throwing himself into the heat of battle with little thought of his own safety.  His strength allows him to use a two-handed axe as a one-handed weapon, and his shield is almost as deadly, using it to charge and deflect blows back at his enemies. \r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/32751-2-1362804846.jpg[/img]\r<br />[b][u]RACE[/u][/b] - Halfling (10% Spell Resistance)\r<br />[b][u]STATS[/u][/b] - [b]Attack:[/b] Lowest  |  [b]Defense:[/b] Lowest  |  [b]Health:[/b] Lowest |  [b]Speed:[/b] Low  |  [b]Stealth:[/b] High\r<br />[b][u]COMBAT[/u][/b] - [i]None[/i] : Regis is a lover, not a fighter.  Don&#39;t count on him to aid you in battle, except maybe for a final blow to the back of your would-be killer.\r<br />[b][u]DESCRIPTION[/u][/b]\r<br />  Looking at Regis, one might think him useless.  However, after many years of running with the Pook Gang in Calimport he has gained mastery over locks, pickpocketing, and speechcraft.  There is no lock strong enough to keep his nimble fingers from opening chests to see what wonderful treasure is inside, the same applies to pockets...\r<br />\r<br />  Rumor has it, Regis is currently on the run for abandoning the Pook Gang and stealing a priceless artifact from Pasha Pook himself; the Ruby Pendant.  This pendant is capable of bending the mind of others to the users will, granting perfect speechcraft and amazing discounts on wares.\r<br />\r<br />- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\r<br />\r<br />  This mod was a combined effort of many modders, modelers, and hobbyists and as such I can hardly take all the credit.  I acted more as a director with AverageJustin helping me along developing it, giving ideas, lore, and ironing out the small details.\r<br />\r<br />Even with a director, this mod required heavy support from the wonderful people of Nexus:\r<br />\r<br />[b][u]RESOURCES[/u][/b]\r<br />[i][b]CotH is completely Stand-alone and Cleaned.  Having any of the below mods will not effect or be changed by CotH and vice-versa.  These items were used as a resource for this mod.[/i][/b]\r<br />\r<br />apachii - [ApachiiSkyHair] Drizzt, Catti-brie, and Regis hairstyles \r<br />http://skyrim.nexusmods.com/mods/10168\r<br />\r<br />Nikinoodles - [Cloaks of Skyrim] Cloak of Drizzt and Regis\r<br />http://skyrim.nexusmods.com/mods/12092\r<br />\r<br />ghosu - [Thors Hammer Mjolnir V2] Aegis-fang (Wulfgar&#39;s Hammer)\r<br />http://skyrim.nexusmods.com/mods/9196\r<br />\r<br />Sushiyant - [Ariyan Weapon Pack] Twinkle & Icingdeath (Drizzt&#39;s Swords) | Taulmaril (Catti-brie&#39;s Bow)\r<br />http://skyrim.nexusmods.com/mods/13218\r<br />\r<br />hothtrooper44 - [Immersive Armors] Catti-brie&#39;s Armor\r<br />http://skyrim.nexusmods.com/mods/19733\r<br />\r<br />Anuiel - [Dwemer Beards] Bruenor&#39;s Beard\r<br />http://skyrim.nexusmods.com/mods/30062\r<br />\r<br />lautasantenni - [Expanded Jewelry Crafting] The Ruby Pendant\r<br />http://skyrim.nexusmods.com/mods/8361\r<br />\r<br />AnOldFriend - [AOF Believable Hair -Female and Male] Wulfgar&#39;s Hair\r<br />http://skyrim.nexusmods.com/mods/4307\r<br />\r<br />Special Thanks:\r<br />AverageJustin - For searching the lore and squeezing the details out.\r<br />\r<br />Scohnhoff - Inspiring me to create my first public mod.\r<br />\r<br />IsharaMeradin - Discovering the &#34;Gray Face&#34; bug and helping correct it.\r<br />\r<br />~Gido - Drew the art that is used as the title for this mod.\r<br />http://gido.deviantart.com/art/Companions-of-the-Hall-304891376\r<br />\r<br />  I am, and probably never will be, a great modeler, but I can use Creation Kit and Photoshop CS5 with ease, which is why many of the vanilla armors and weapons have been copied and textured differently to match closely to the lore and appearance of the Companions of the Hall.  These items are also stand-alone and will not change anything in vanilla Skyrim.  \r<br />\r<br />  For the more detailed and unique weapons, I had to search for models and ask for the support of the above modders.  I have an E-mail of each allowing the use of the meshes, and I have promised I will not allow players to use these items so that I can promote their mods, a showcase if you will.  This was my choice originally, as I did not feel comfortable allowing the player to use these items [i](Plus, it doesn&#39;t quite make sense, would Drizzt give up Twinkle?)[/i]\r<br />\r<br />[b]TO INSTALL:[/b]\r<br />Drag and drop [b]CotH - Companions of the Hall.esp[/b] and [b]CotH - Companions of the Hall.bsa[/b] into data.\r<br />I prefer you load this mod [i]BEFORE[/i] all other mods.  This mod has been cleaned and is stand-alone, it only ADDS to the game, the only thing that is &#34;changed&#34; is the world space of the Winking Skeever, so that the player can recruit the companions.  Mods that effect inns should be loaded [i]AFTER[/i] CotH to ensure compatibility.\r<br />\r<br />That&#39;s it.\r<br />\r<br />CotH should be compatible with all mods, and works with UFO, AFT, EFF and probably any other follower tweaking mod.\r<br />\r<br />[b] YOU CAN FIND THE COMPANIONS AT THE WINKING SKEEVER IN SOLITUDE [/b]",
  "categoryId": "66",
  "version": "2.0",
  "author": "Gamebryo",
  "createdUnix": "1362669259",
  "updatedUnix": "1364584718",
  "containsAdultContent": false,
  "uploadedBy": "gamebryo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020967",
      "name": "CotH - Companions of the Hall",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "64319",
      "fileName": "CotH - Companions of the Hall-32751-2-0.rar",
      "uploadedUnix": "1364584718",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/5dc4a06453764ccdbe31adbc1d51edd94d3e80182a0cf068dcf8c4998aee7e8e/analysis/1407494135/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CotH%20-%20Companions%20of%20the%20Hall-32751-2-0.rar?fid=1000020967&ttl=1535809441&ri=8192&rs=8192&setec=dd9e2a9af48b97f51b14ade5db8858fb"
    }
  ]
}