{
  "modId": 32799.0,
  "modName": "MorrowindVampireClansReturned",
  "summary": "Adds a boat to a new island, that will feature NPCs from all three vampire clans from Morrowind, along with a choice of three blood potions the player can drink to join one of them, along with abilities very similar to Morrowind vampire abilities from drinking them, and it&#39;s compatible with other vampire mods. ",
  "descriptionHtml": "Update 5: The Requiem compatibility patch is now released.\r<br />\r<br />In the MorrowindVampiresRequiemPatch version here&#39;s a comparison of the vampires stats...\r<br />\r<br />Volkihar: 300+ Health, 300+ Stamina, 95% Frost Resistance.\r<br />Quarra: 235+ Health, plus the 50% normal weapon resistance, the 15+ Health/Stamina/Magicka of a fully feed Vvardenfell vampire.\r<br />Berne: 365+ Stamina, plus the 50% normal weapon resistance, the 15+ Health/Stamina/Magicka of a fully feed Vvardenfell vampire.\r<br />Aundae: 315+ Magicka, plus the 50% normal weapon resistance, the 15+ Health/Stamina/Magicka. of a fully feed Vvardenfell vampire.\r<br />\r<br />Because Volkihar vampires have such strong stats in Requiem the patched version buffs the Vvardenfell vampires a bit so they don&#39;t fall behind too much, while still letting the Volkihar keep their unique status of a balanced Health+Stamina ratio and keeping Frost resistance as Volkihar specific. Volkihar are more well rounded, can avoid sun damage more easily, and are resistant to frost, but Vvardenfell vampires have the advantage in being more specialized. In the 2016 edition it&#39;s still the same old 75+ to various attributes instead of 235 to 365+, because of that.\r<br />\r<br />In the Requiem compatibility patch Quarra get 235 bonus health because they already have 50% damage resistance to normal weapons, and I thought it&#39;d be interesting if Quarra and Volkihar were both physically tougher but in different ways from each other. And Quarra are already very strong, and I didn&#39;t want them to be overpowered by having as much bonus health as a Requiem Volkihar on top of their already very strong stats. Please remember to only use either the MorrowindVampires2016edition or MorrowindVampiresRequiemPatchRequiemPatch. Or else things will get buggy.\r<br />\r<br />Update 4: I&#39;m sorry it&#39;s been so long... This is by far my most complex most time consuming mod I ever made, and I did temporarily &#34;abandon&#34; it in a \r<br />broken state some time during 2014. Lets just say, a lot of stuff was going on in my life at the time, hence there was a very severe delay \r<br />with fixing this mods issues. FYI the mod breaking bugs were Berne clan vampires getting Aundae abilities after feeding, and feeding in general \r<br />not working. As a very small extra, I also remembered it felt odd and immersion breaking when town guards would defend vampires from Paladins,\r<br /> as well as the player not being guilty of murder even if seen killing a bounty target character added by this mod. Partially because of that, \r<br />and partially to make up for the very long delay, I did an improvement  there as well, and added said Paladins and bounty targets to crime  factions. What caused that very game breaking glitch, was that I didn&#39;t realize that it was way too easy to lose script fragments when packing a\r<br /> mod if you don&#39;t rename them... This time I remembered how to make  feeding work, and renamed said script fragments so they&#39;d be uploaded.\r<br />\r<br />Anyways, I highly recommend you use the 2016 Edition unless you don&#39;t have Dragonborn. As for compatibility, any mods that alter the feeding perk will have issues with this mod, as this mod does depend on altering the feed perk message so you only get 1 feed messagebox instead of 2. TLDR: Basically I have to add a condition to the vanilla feeding perk where it cannot be used if the player is in the Berne/Aundae/Quarra clan factions, or else a Vvardenfel vampire will have TWO feeding functions due to being of the vampire race, one of which being the vanilla one... And it is super immersion breaking, so I trust you can understand why I had to make the difficult choice of altering a vanilla Perk.\r<br />\r<br />Be aware that the current 2016 Edition is not compatible with Requiem for that reason- However I have today released the compatibility version to fix that issue.\r<br />\r<br />\r<br />Update 3: About to test the released 2016 version will update when done testing to ensure it&#39;s okay. Still have yet to update on that. \r<br />\r<br />Update 2: So yeah I was very busy for a long time. And I got &#34;off game&#34; about lots of stuff I knew about modding due to not using the Skyrim CK much for a while. Basically the reason feeding got buggy was because so long ago I forgot to upload the fragment scripts which are different from regular PEX and PSC scripts, though after a lot of trial and error I re-learned how to make feeding work again, and a fixed version of this mod with the properly loaded fragment scripts is expected to be released fairly soon.\r<br />\r<br />Also if you used an earlier version, be sure to fully uninstall before installing the newest version, and to ensure all the scripts in your folder that say &#34;ALectra&#34; in them are deleted before installing... I had to improve some scripts, that may share names with older outdated scripts, so if you&#39;re upgrading from a more outdated version you might have to do that, sorry for any inconveniences that may cause.\r<br />\r<br />Okay first things first, before the update an important disclaimer. Important disclaimer: The vampiric/vampire affiliated companions that my\r<br /> mod adds Berne Apprentice/Quarra Apprentice/Apprentice Aundae  Cyromancer/Helnarr/Jo&#39;s Thrall/Yazgarzu Shazog/Ennassean Mirel (all of \r<br />whom initially spawn in Xemorah Island), it&#39;s very important that if you plan ondrinking the purgeblood potion, that you empty everything you \r<br />put in their inventories before you drink it, because they will be disabled, and replaced by hostile versions of themselves afterward, and \r<br />if you don&#39;t remove everything you put in their inventories first, you could lose items forever, so just please remember this if you plan on \r<br />drinking the purgeblood potion.\r<br />\r<br />Thanks to constructive criticism from Disi, and Terra Nova telling me how to make actual functioning versions of vampirism different than the vanilla one, I was able to massively upgrade this mod far beyond what I thought was possible.\r<br />\r<br />Update: I made an ENTIRELY new version with actual totally unique Vvardenfell vampire feeding stages, various bug fixes, craftable blood potions, and more. I highly recommend you DL the UltraUpgraded version unless you don&#39;t have Dragonborn. I&#39;ll eventually try to get around to releasing a more up to date non-Dragonborn version, though I&#39;m uploading this one for people who do, and to save a lot of progress too after a lot of hard work. \r<br />\r<br />Now you can also feed on paralyzed people, Aundae vampires just like in the lore have a calm spell to feed on low level NPCs, and only Aundae vampires maintain the raise thrall ability. All Vvardenfell vampires are also more powerful when fully feed- based on the lore of a Quarra who became very weak from not feeding. So unlike Volkihar Aundae&#39;s most powerful raise thrall ability will be at stage 1. Oh and even with Dawnguard you should be now be hated at stage 4 again.\r<br />\r<br />Finally, frost weakness has been removed, because Vvardenfell vampires in this new version share NO ABILITIES with Volkihar vampires, other than having a similar drain life, and not regenerating in the sun. Berne vampires share the muffled footsteps with Volkihar vampires, but the other Vvardenfell vampries don&#39;t have that.\r<br />\r<br />Also all Vvardenfell vampires now have a toggleable Greater Night Vision that lasts 7 days if left on, as well as an extremely cheap cast 2 magicka detect life ability. The bounties have also been significantly improved to be more rewarding should you do them- some items WILL NOT SPAWN if you do not kill your vampire clan leaders bounties.\r<br />\r<br />I also substantially reduced the ridiculously high health of the elites, while keeping their damage output as I think only the boss vampires should&#39;ve been so powerful in hindsight. I also altered the outfits of all Vvardenfell vampires to be far more random and unique, they will always have at least one bloodline specific piece equipped but there&#39;s a lot more random things involved now.\r<br />\r<br />You&#39;ll also now more often see things like Vvardenfell vampires in partial bonemold, partial imperial partial iron /etc/, because I think it makes sense these blood sucking communities living on the wrong side of the law would be more likely to wear mixed scavenged outfits. Now higher ranking Vvardenfell vampires are more likely to wear fully matching armor.\r<br />\r<br />I also plan on a daedric/ghost immunity to normal weapons mod, and temple guardians mod which adds super powerful guardians to temples, and various holy places who HATE vampires, though those will all be separate from this mod.\r<br />\r<br />Also the AI of the vampires are much better now, the ones who stalk the player, have had their AI massively improved by adding location keyword conditions where they won&#39;t follow the player into towns or other such important places anymore. Now they&#39;ll only follow you into the wilderness, dungeons and other places. And a few places had keywords added to them, that used to not have them to augment AI beyond it&#39;s past levels.\r<br />\r<br />Some of the huge cells this mod adds, have been divided into multiple cells, to significantly reduce the chances of a crash.\r<br />\r<br />Do be forewarned in this newest version: I did alter the vanilla feeding perk, slightly. There was absolutely no other way. The player character has it by default. All I did though was add conditions to it, so that Vvardenfell vampires would not be able to activate the vanilla perk.\r<br />\r<br />Because if I didn&#39;t do this you&#39;d get TWO VAMPIRE FEED boxes every time you tried to feed, and that would be game breakingly irritating, not to mention imbalanced cause you could get Volkihar AND Vvardenfell vampire abilities from feeding.\r<br />\r<br />Here&#39;s a screenshot showing the location of the boat. http://static-1.nexusmods.com/15/mods/110/images/32799-1-1415226396.png\r<br />\r<br />\r<br />New Vampire Stages.\r<br />\r<br />Stage 1 Blood Gorged Vvardenfell Vampire\r<br />\r<br />15+ better attributes, 20+ carry weight, 30+ illusion,15+ destruction, blocking, lockpicking, 10%+ better melee damage, 20+ better unarmed damage, 50%+ normal weapon resistance, 15%+ speed, but 50% less fire resist, 25% more vulnerable to silver weapons, and no healrate or potion benefits.\r<br />\r<br />Stage 2 Sated Vvardenfell Vampire.\r<br />\r<br />10+ better attributes, 15+ carry weight, 25+ illusion,10+ destruction, blocking, lockpicking, 5%+ better melee damage, 15+ better unarmed damage, 50%+ normal weapon resistance, 10%+ speed, but 60% less fire resist, 30% more vulnerable to silver weapons, and no healrate or potion benefits.\r<br />\r<br />Stage 3 Malnourished Vvardenfell Vampire\r<br />\r<br />5+ better attributes, 15+ carry weight, 20+ illusion,5+ destruction, blocking, lockpicking, 3%+ better melee damage, 10+ better unarmed damage, 50%+ normal weapon resistance, 5%+ speed, but 70% less fire resist, 35% more vulnerable to silver weapons, and no healrate or potion benefits.\r<br />\r<br />Stage 4 Starving Vvardenfell Vampire. 3+ better attributes, 5+ carry weight, 10+ illusion,5+ destruction, blocking, lockpicking, 2%+ better melee damage, 5+ better unarmed damage, 50%+ normal weapon resistance, 2%+ speed, but 100% less fire resist, 40% more vulnerable to silver weapons, and no healrate or potion benefits.\r<br />\r<br />Stage 1 drain health, Advanced Drain Life drain 12 health per second, (higher for Aundae).\r<br />\r<br />Stage 2 drain health, Drain Life drain 8 health per second\r<br />\r<br />Stage 3 drain health, Lesser Drain Life drain 4 health per second\r<br />\r<br />Stage 4 drain health, Petty Drain Life drain 2 health per second.\r<br />\r<br />Vampiric Orb from ring: Drain 15 health on target, about 30 health if Aundae and using Focus Casting.\r<br />\r<br />Greater Night Eye: Night Eye for 7 days though can be toggled.\r<br />\r<br />Detect Prey: Channelled spell, 2 magicka per second, detect life friend interior 100 feet, detect friend exterior 200 feet, detect life enemy exterior 200 feet, detect life enemy interior 100 feet.\r<br />\r<br />Grand Blood Potion: Restore health 6 points for 25 seconds, resist fire 5% for 13 seconds.\r<br />\r<br />Greater Blood Potion: restore health 5 points for 25 seconds, resist fire 5% for 13 seconds.\r<br />\r<br />Plentiful Blood Potion: Restore health 5 points for 15 seconds, resist fire 5% for 6 seconds.\r<br />\r<br />Lesser Blood Potion: restore health 5 points for 10 seconds, resist fire 5% for 3 seconds.\r<br />\r<br />Palty Blood Potion: Restore health 3 points for 6 seconds, resist fire 5% for 3 seconds.\r<br />\r<br />Blood Elixir: Fortify heal rate 0.25% for 36000 seconds.\r<br />\r<br />Stalkers Elixir: Turn invisible, identical to invisibility potions.\r<br />\r<br />Energy Blood- identical to restore stamina, arcane blood identical to restore magica.\r<br />\r<br />To make Energy Bloods or Arcane Bloods, just mix a paltry blood potion with a restore magic or restore stamina potion.\r<br />\r<br />To make blood potions stronger than paltry, use 2 Paltry blood pots for Petty, 4 paltry blood pots for Lesser, 8 paltry for Plentiful, 10 paltry and a Human Heart for Greater, and 12 paltryand a Daedric heart for Grand.\r<br />\r<br />Each humanoid enemy you cast drain life on- the one my mods add, or use the blood preparation enchantment on, will drop 1 Paltry Blood potion upon dying, if you do either while they are still alive.\r<br />\r<br />The Vampiric Stun Rod in spite of being a dwemer staff, is in the iron crafting section sorry for the tiny immersion breaker. The dagger of sapping is in the misc section, and the ring in jewelry or misc think jewelry.\r<br />\r<br />If you complete all the bounties assigned to you, ingredients to the cheaper recipes of certain sapping items, will be added to your vampiric base, and or player home, amongst other things. I suggest saving those\r<br />to make them.\r<br />\r<br />If you are Quarra the cheap version you will get will be the Vampiric Stun Rod, if you are Aundae a Vampiric Ring Of Sapping, and if you are Berne a Dagger Of Sapping. You can technically craft any of them, as you will\r<br />have two available recipes but the cheap versions will be bloodline specific. The recipes for these will be in the respective vampire bases, somewhere fairly close to the vampire clan leaders, inside certain books.\r<br />\r<br />These items stun your victim and drain a little health, and you can feed on stunned victims so these are extra useful- they are extremely inefficient charge wise to be balanced. Also the steel dagger with the blood preparation enchantment, as well as the companions this mod adds, \r<br />are behind a locked door, and the key will only be provided if you complete the right bountry for it, so doing bounties is far more rewarding and immersive now. \r<br />\r<br />The expensive Sapper Dagger recipe requires 1 steel, orcish and elven dagger, 3 heart stones, 25 frostbite venoms, 25 paltry blood potions, 25 nightshade, 25 deathbells, 40 filled grand soul gems, and 75 Volkihar vampire dust.\r<br />\r<br />The Expensive Ring requires 3 heart stones, 5 golden rings, 5 silver rings, 40 filled grand soul gems, 50 paltry blood potions, and 75 vampire dusts of Volkihar.\r<br />\r<br />The expensive vampiric stun rod recipe, requires 1 dwarven sword, 3 heart stones, 4 Dwarven Scrap Metals, 25 void salts, 40 Dwarven Gears, 45 grand soul gems, 50 paltry blood potions, and 75 Volkihar vampire dusts.\r<br />\r<br />The bloodline specific versions will require far less resources, but rely on vampire dusts of enemy Vvardenfell vampire clans instead of Volkihar dusts, and various unique items.\r<br />\r<br />And here are the new vampire dust types...\r<br />\r<br />Aundae Vampire Dust Fortify Destro 5, restore magicka 5, regenerate health 5, cure disease \r<br />Vampire Vampire Dust Berne Fortify sneak 5, invisibility 4 seconds, regen health 5, cure disease\r<br />Quarra Vampire Dust Fortify two handed 5, fortify one handed 5, regen health 5, and cure disease.\r<br />\r<br />Compared to Volkihar Dust which instead has invisibility, regen health, restore magic and cure disease.\r<br />\r<br />Neutral versions released at the request of Disi... How this work I&#39;ll explain. The Roaming Vampires/Aundae Thralls still appear in Skyrim, but now they only attack each other. I also just realized that it&#39;s impossible to give NPCs perks by casting spells on them, so turning someone into an Aundae/Quarra/Berne vampire, gives them 15% damage resistance to make up for being unable to get the normal weapons resistance perk. From now on all up to date versions will be neutral, cause I feel in hindsight it&#39;s the best way to make this type of mod.\r<br />\r<br />\r<br />The companions this mod supplies still have it, and the player still has it. I&#39;m sorry, but there is quite simply no way to add perks to NPCs while currently being in game, so it was the closest equivalent I could possibly make. That all said, NPCs you convert with Aundae Infection, Quarra Infection or Berne Infection will have identical abilities other than normal weapon resistance being replaced with 15% damage resistance, with stat buffs, factions, and even spells, and it&#39;s still balanced out by a severe weakness to sun damage, and a 50% fire vulnerability.\r<br />\r<br />I think I should&#39;ve made a neutral version long ago... Would&#39;ve solved a lot of problems. Don&#39;t worry though in the neutral version the NPCs on Xemorah island are still just as aggressive, only the ones in Skyrim have been changed. Gameplay wise the reasons for this are obvious, lore wise it does partially make sense that they would be more aggressive on the island they now dominate, and more cautious when in Skyrim.\r<br />\r<br />Also along with this, I finally released Dragonborn versions. In the Dragonborn version, many of the vampires will be wearing partial bonemold or chitin armor, because seeing as how all three Morrowind vampire clans originate from Morrowind, it would seem very odd if none of them kept some armor that was common to the land of Morrowind.\r<br />\r<br />The reasons behind this being partially, to add on to the feel of these vampires being from Morrowind, and cause the ones in Skyrim are more isolated from Xemorah Island hence it&#39;d make sense they&#39;d have less armor from Xemorah Island, though they always have at least one piece of armor you can identify their bloodline with.\r<br />\r<br />Lower ranking vampires will have at least a slightly higher tendency of wearing partial chitin/bonemold, where as the higher ranking ones are more likely to be wearing full Quarra armor or full Berne armor, the Aundae nightblades/shadow archers/agents will now wear partial light chitin, Quarra/Aundae battlemages will have partial bonemold armor, although almost all Aundae vampires still have their classical dark black robes with many skulls on them. Lastly in the Dragonborn version in said vampires home bases, there will be some loot from the land of Morrowind, mostly drinks like Shein and Mazte.\r<br />\r<br />The Dragonborn version is otherwise identical- at least with the older versions.\r<br />\r<br />So anyways, I recommend the most UltraUpgraded version if you have Dragonborn, and the old Non-Dragonborn Neutral version if you don&#39;t.\r<br />\r<br />Update: Okay I released the four modified bug fixed versions of the MorrowindVampiresUpgraded series.\r<br />\r<br />The textures for a formerly untextured object are in the installation folder now, and the scripts that were vital to turn NPCs into vampire versions of their races were added, the Sun Damage Control Effect was renamed to the far more lore friendly and immersive Vvardenfell Vampire Sun Weakness, and one window in the Aundae Laboratory which... Was placed a little bit in a jarring/clipping location was moved slightly, as a last minute fix.\r<br />\r<br />Sorry about the inconvenience this caused anyone, sometimes after I release a mod with lots of meshes/textures/scripts to the Nexus I need to re-download it myself, to bug test it... That all said, those last few bugs I believe are all gone now. Including old meshes/scripts/textures from earlier mods is easy, but when adding a ton of new stuff, sometimes missing new things is all too easy. x_X ah well, all fixed now.\r<br />\r<br />A suggested mod to combine with this, is Everyone is Essential - NPCs Protected, as the vampires, can possibly kill NPCs. Unless you use a SafeSkyrim version. Also the vampires that attack Skyrim have been changed to much weaker versions with &#34;roaming&#34; in their name, the hardest to kill is the Quarra juggernaut who is easily outrun or very very very slowly kited to death- if they can&#39;t absorb health from hitting anything anyways.\r<br />\r<br />These are band new versions, so if you get any bugs, tell me what type of bug it was, and what it seemed to cause, and then I&#39;ll try to fix it, though I don&#39;t think there will be any- as I double checked trying to make sure all the meshes/textured/scripts added by it are all in the right folders hopefully it won&#39;t, just saying it could happen... I did try to fix a variety of bugs that&#39;d take too long to explain here in these newest MorrowindVampiresUpgraded versions.\r<br />\r<br />Choose only one ESP, if you absolutely don&#39;t want to use a mod to make almost all NPCs essential then I highly recommend you download a &#34;safe&#39; version. Also if you used my mods previously I recommend you totally uninstall the scripts then reinstall them, as I had to do some changes. I believe uninstalling and reinstalling with the NMM should be enough.\r<br />\r<br />The vampires that are outside at night in Xemorah Island have been highly nerfed as well, though not as much as the roaming ones, to compensate for this the Elite vampires, and vampire bosses have been buffed to be even more difficult to stand any chance against. I know that the NPCs, especially the ones that weren&#39;t supposed to be isolated bosses were extremely overpowered, and I went to great lengths and great wrist aches and finger pains to fix that.\r<br />\r<br />Quarra players now have a three times higher chance to intimidate successfully as well... Because... Well, they are extremely strong, like\r<br /> capable of literally ripping off limbs in the lore, and that&#39;s AFAIK just what an AVERAGE Quarra vampire is capable of lore wise, so I gave \r<br />them an intimidation bonus to make their strength seem more realistic and immersive.\r<br />\r<br />Also Berne Executioners have now been divided into Berne Executioners and Berne Rogues, Berne Rogues are like the old Berne Executioners, where as these executioners are like berserkers, tons of melee damage, but very very very easy to kill. The executioners will wear a retextured version of the headsman&#39;s hood to tell them apart, and yes you can equip it if you loot it off of them. Unfortunately however, Bethesda never intended for khajiit or argonian to wear a Headsman&#39;s helm, so it won&#39;t look good on them, and I made all the executioners other races because of that. \r<br />\r<br />Also new sewers have been added, so you can safely travel to your vampiric base, and get to the blood potions with a much higher chance of survival. The vampires who live in the sewers are extremely weak, lets just say, they were shunned from the Quarra/Berne/Aundae clan for being too weak, so they now live in the sewers to survive.  I tried to make the sewers look like an interesting place in their own right, so that just like in Morrowind, there was both a safer path and more dangerous path.\r<br />\r<br />Further more the Blood Chamber now has a sewer connected to it, so that sorcerer guarding the potions is easier to sneak past, though I recommend you horde a bunch of lockpicks possibly a hundred to get through it. The doors to the blood potions themselves now have a lock level of apprentice rather than master, so non-combat characters don&#39;t get screwed over by this now.\r<br />\r<br />The bosses are extremely powerful each being about level 140, with paralysis effects, and damage outputs that would be overpowered on the player character or any followers.... And the squishest of them having 1940 health, so if you really hate dying effecting your immersion, I don&#39;t recommend actually trying to kill them. They are there to serve as extremely challenging enemies, who you only encounter if you go deeply into the base of vampires if you&#39;re either not a vampire or of a different bloodline.  At least now the super powerful ones stay deep inside of their one bases though.\r<br />\r<br />Important FORM ID&#39;s related to this mod will be at the very bottom.\r<br />\r<br />If the respawning assassins that keep getting sent after you- and they do respawn and follow the player, really really really start bothering \r<br />you, you can go to a place in the mod called Palmordoth to pull on a chain showering in it&#39;s waters to get rid of your scent. Afterwards they\r<br /> stop respawning. Do be warned though this is a permanent change, so be sure if it&#39;s what you really want. I added that Palmordoth shower, just \r<br />in case some people didn&#39;t like being actively hunted by rival vampires, so they had the option to disable it. Oh and don&#39;t drink the Purgeblood potion shown in the video unless you want to be permanently cured of Vvardenfell vampirism.\r<br />\r<br />Cutting to the chase before this huge wall of text, here&#39;s the stat bonuses, and weaknesses you get. Because that&#39;s all some people want to know. (The Aundae destruction bonus might look massive on paper, but that&#39;s only cause of destro being so weak in vanilla Skyrim).\r<br />\r<br />\r<br />Aundae vampires have 60 more Magicka,  5% faster magicka regeneration,10% stronger Illusion spells, 50% stronger Destruction, 20% stronger Conjuration, Alteration spells, 20% longer lasting alteration, illusion and conjuration spells, and are 20% more effective with daggers.\r<br />\r<br />Power: Aundae Focus Casting Destruction spells do 150% more damage for 24 hours, but they cost four times as much, and you are also 50% more vulnerable to magicka damage, 35% more vulnerable to fire damage, and take 75 extra damage from silver weapons for 24 hours. (Was changed from Aundae Hypnosis).\r<br />\r<br />Power: Aundae Blood Channeling Fortifies Destruction by 88%, reduces cost for destruction spells by 75%, and increases Magicka regeneration by 115% for 20 seconds, also causes 85% weakness to fire, and 75 additional weakness to silver weapons for 8 hours. (Used to be called Aundae Focus Casting).\r<br />\r<br />Quarra vampires have 60 more health, 20% stronger unarmed attacks, 175 more carry weight, 20 better heavy armor rating, 15% more powerful melee skills, and are 20% more powerful with blunt weapons.\r<br />\r<br />Power: Wrath Of The Quarra 115+ health, and 20% increased melee and 20% damage resistance for 20 seconds, at the cost of 85% weakness to fire, and 75 weakness to silver weapons for 8 hours. (Used to be Quarra Berserking).\r<br />\r<br />Berne vampires have 60 more stamina, 40% better unarmed damage, 10% better archery, 35% more effective sneak, regenerate stamina 20% faster, 10% stronger melee skills, 30% faster movement speed, 20 better armor rating if unarmored, and 20% more powerful pickpocketing and lockpicking. \r<br />\r<br />Power: Berne Blood Rush 95% better sneaking, 15% stronger one handed and two handed, 75% additional movement speed, 40% stronger pickpocket and lockpicking, 30% faster stamina regeneration for 20 seconds. 85% weakness to fire and 75+ vulnerability to silver weapons for 8 hours. (Used to be Berne Adrenaline Rush).\r<br />\r<br />Power: Berne Poison Bite slows victim by 75% for 60 seconds and slowly does 600 total damage after a minute, and for 120 seconds absorbs 33 stamina per second from the victim.\r<br />\r<br />Also it&#39;s very unlikely but still possible it could conflict with Whiterun mods, as it adds 3 new NPCs there- particularly the ones that aren&#39;t safeskyrim versions. Also only pull the chain at Palmordoth if you WANT the respawning enemy vampires to stop stalking and attacking you.\r<br />\r<br />Update: This mod just got massively updated, and all the other versions are only there for legacy support at this point. The up to date brand new versions are MorrowindVampiresUpgraded or something very similar.\r<br />\r<br />New Content: Shared effects by all the bloodlines have been renamed to Vvardenfell Vampirism to help with any confusion, the Aundae clan have had their magic especially destruction magic buffed significantly because of destruction being weak in vanilla Skyrim, and matching the lore Aundae vampires now have a damage bonus to daggers.\r<br />\r<br />Also a bunch of NPC only spells have been renamed to &#34;Intense master&#34; this or that, so people won&#39;t get confused by them in the console.\r<br />\r<br />The fire damage vulnerability Vvardenfell vampires have is now 50% extra on top of normal vampirism on top of 25%, I did this because Dawnguard reduces fire damage vulnerability more than I expected, and because it shouldn&#39;t be too much of a problem for people who don&#39;t use Dawnguard anyways, and Vvardenfell vampires need significant weaknesses to not be overpowered.\r<br />\r<br />Aundae vampires now have illusion and conjuration spells that last 20% longer as well, to benefit non-destruction specialists.\r<br />\r<br />In hindsight I feel making Quarra the 2 handed specialists and Berne the 1 handed specialists was a bad idea, and now the Quarra have 15% more melee damage, and 20% more melee damage with blunt weapons, the Berne only have 10% more melee damage. It would make sense that Quarra would have the highest melee damage hands down, although the Berne just like in Morrowind still do more unarmed damage. The Aundae clan have the lowest melee damage out of all Vvardenfell vampires but they now do 20% more damage with daggers.\r<br />\r<br />Further more power attacks with blunt weapons cost 25% less stamina for Quarra, and likewise power attacks with daggers cost 25% less stamina for Aundae, and unarmed power attacks cost 25% less stamina for Berne, to try to replicate Morrowind weapon skills as close as I can.\r<br />\r<br />The Berne bonus to archery has been reduced as archery is already very strong, and I think it&#39;s more lore friendly for their archery to only be slightly better from their agility. However in turn the Berne sneak bonus has been increased, and their cooldown now grants invisibility as well, as it should have long ago. Their poison bite ability I feel was too easily exploited so it was turned into a 24 hour cooldown ability. Berne also got a bonus to lockpicking and pickpocketing as well.\r<br />\r<br />Also the possibly imbalanced resist damage ability used in older versions has been replaced with the more balanced, more lore friendly resist normal weapons. The Berne move 30% faster, and the other Vvardenfell vampires move 15% faster. Also all of the player homes now have vampire faction specific armor in their player homes, and you&#39;ll find more faction specific armor in various vampire bases, and the non-respawning containers now start with loot inside of them, to be more immersive. A long time ago I thought they had to start empty but I was mistaken.\r<br />\r<br />\r<br />NPC Vvardenfell vampires just like player character Vvardenfell vampires now burn in the sun. Also the Aundae player home was way too tiny, so was Helnar-Jo the Aundae leaders so called &#34;laboratory&#34; now they have been significantly increased in size, and look like REAL laboratories, and the player home I promise you, both looks like a laboratory and looks very magical.\r<br />\r<br />The Aundae caves have had those magical looking vines re-added cause I finally figured a way around the massive memory problem they caused by merging two static meshes, and the Aundae cave has been divided into more cells to be easier on memory now, and the lighting also looks much better there. I very pain stakingly made sure none of the containers used in my earlier versions were deleted, so nobody would risk losing any items. In screenshots I will show where some of the old containers in Elinunab cave were moved to.\r<br />\r<br />They are near the entrance to Elinunab depths, near the platform, and by that miniature stockades fence made home by the platform with beds, and a dinner table... I&#39;ll clarify more in screenshots. I also added... Oh lets just say, my version of an easter egg somewhere on Xemorah Island, I doubt you&#39;ll find it if you do I&#39;ll be impressed, I won&#39;t spoil anything about it here though.\r<br />\r<br />Some of the notes left by the Quarra/Aundae/Berne bosses have been slightly altered, including adding in insults like S&#39;wit and Fetcher, because originating from Morrowind these vampires would likely still have some cultural influences from the land of Morrowind. In future versions that rely on Dragonborn I might even give them Morrowind specific armor and clutter to add to that type of immersion. None of the current versions rely on Dragonborn yet though, and I&#39;ll leave those old ones for people too poor, or low on money or whatever to get Dragonborn.\r<br />\r<br />Quarra vampires have a damage bonus to blunt weapons just like in Morrowind, all Vvardenfell vampires take 5 damage per second from the sun, and have a 50% resistance to normal weapon. Restoration spells are hypothetically castable but you would need to have over a thousand magicka, and points in restoration just to cast the weakest restoration spell. Unlike Morrowind you can still heal from sleeping, but unlike vanilla Skyrim your health will NOT automatically regenerate anymore.\r<br />\r<br />Aundae Vampires have had their powers split between Aundae Focus Casting, and Aundae Blood Channeling. Focus casting is intended for glass cannon mages, and gives you 150% additional spell damage on TOP of the passive 20%, at the cost of being 50% weaker to magicka, having a 75 weakness to silver weapons, and destruction spells costing four times as much magicka. You can&#39;t even cast focus casting unless you sacrifice enough health in leveling to have 500 magicka. Blood Channeling like the other 24 hour cooldowns makes you vulnerable to fire and silver 8 hours after using it, and makes your destro spells 75% more efficient and 80% more powerful, as well as 115% magicka regeneration for 20 seconds.\r<br />\r<br />Blood Channeling is your most powerful power with a cooldown as an Aundae vampire, where as Focus Casting is there to support more squishy mages who sacrificed a lot of potential health to have enough magicka to cast the spell, and use it efficiently. I felt like in my old versions that Aundae players got screwed over, and were underpowered, so I buffed their abilities, and gave them an additional alternate playstyle, balanced in the way an older TES game would be- if you want the most powerful spells possible you need to sacrifice health points or stamina points for magicka points, thus becoming a glass cannon or a more ordinary mage, so you&#39;re not an overpowered steel cannon.\r<br />\r<br />All Vvardenfell vampires now have an ability they can use every 24 hours that turns NPCs into a vampire of your bloodline, keep in mind that this spell is considered hostile though, I did that cause I didn&#39;t want you to be able to cast that in front of guards with nobody caring. You can easily cast it on allies, or use a calm ability on an NPC after turning them though.\r<br />\r<br />Do be careful you don&#39;t &#34;convert&#34; non-essentials who spend any amount of time in the sunlight though, or else they&#39;re AI won&#39;t change to match their new weakness to sunlight, and they&#39;ll die. And yes, once you turn someone into a Vvardenfell Vampire they are one for life now. Also be forewarned that turning some important vanilla NPCs especially the jarls can break the main quest, I wanted the option to create fellow Vvardenfell Vampires to be there, cause it makes sense, it&#39;s lore friendly, adds immersion, and lets you turn your favorite companions into Vvardenfell Vampires, but I still as a modder feel obliged to warn you to use that ability with caution- especially on any NPC related to the main quests.\r<br />\r<br />Also I recommend you do not use that power on machines, werewolves, dragons, animals litches or the like, and only use it on playable races, as it could\r<br />possibly get very buggy if you do.\r<br />\r<br />Use a similar form of caution for turning NPCs to vamps you&#39;d use for Better Vampires, only remember that my mod uses different mechanics to convert people to your bloodline, and that my NPCs are vulnerable to sunlight- they can die from it.\r<br />\r<br />Also the 24 hour cooldown abilities have all been altered, they last for only 20 seconds now, and make you very vulnerable to fire damage and silver weapons for 8 hours after using them. Helnar-Jo&#39;s spells have been renamed to Hand of Helnar-Jo, Helnar-Jo&#39;s Wrath, and Helnar-Jo&#39;s Tempest Cloak, Senyind Mirel&#39;s  paralysis spell has been renamed to Senynd&#39;s Catatonic Nightmare, to be more appropriately named of extremely powerful characters.\r<br />\r<br />\r<br />So here&#39;s the versions and what you need to know about them. In MorrowindVampiresUpgraded the vampires still all respawn, and rival vampires/paladins still attack you in Skyrim. In MorrowindVampiresUpgradedNoRespawns it&#39;s identical only none of the NPCs this mod adds respawn, which I made because some people wanted to be able to clear out the vampires, or eliminate rival vampire clans, and take their homes for themselves.\r<br />\r<br />In MorrowindVampiresUpgradedSafeSkyrim none of the Vvardenfell vampires in Skyrim ever leave their little homes so you likely don&#39;t have to worry about them killing quest givers, nor will the paladins in Skyrim spawn. In MorrowindVampiresUpgradedNoRespawnsSafeSkyrim it&#39;s the same only no respawns for any NPCs this mod adds.\r<br />\r<br />Adds Morrowind vampire bloodlines to Skyrim... As well as six potential companions two per faction for said vampires. \r<br />\r<br />Note that this mod doesn&#39;t have any effect on vanilla companions or companions from other mods though. And if you want the khajiit paladin follower Sajilvadni to be an optional follower, you will need to use this mod http://www.nexusmods.com/skyrim/mods/36913/? MFVM - More Follower Voices Mod Plus Khajiit Marriage in conjunction with my mod, or else her voice won&#39;t work with the in game follower functions.\r<br />\r<br />In order to get this vampirism you must travel to Xemorah Island which can be teleported to via a boat north of Dawnstar, when you arrive you&#39;ll be near Lealmal village, and eventually you should be able to find the Blood Lair, unless you&#39;re lockpicking skill is 100, you&#39;ll need to enter a nearby building and either steal a key from Leonde Gabenagus... Either by pickpocketing or murdering him.\r<br />\r<br />Once inside you will be able to use a teleport scroll to teleport deeper inside, where you&#39;ll fight or sneak past Zabhena Akar, and you will see three doors. The one behind a floating staff leads to the Aundae, the one by the combat dummy like figure holding a sword and shield leads to the Quarra, and the one underneath a bow leads to the Berne blood potion.\r<br />\r<br />Once you open the door you will fall inside, and land near some Aundae/Berne/Quarra specific loot, a blood potion, and a teleport scroll, be sure to loot everything especially blood potions before teleporting out with the scroll, there is no return back.\r<br />\r<br />After you drink the potion you&#39;ll gain these effects according to your vampiric bloodline, further more upon transforming vampires from other factions will attack you, and the package that makes them repeatedly try to kill the player can only be disabled by pulling a chain to &#34;shower&#34; in the waters of Palmordoth (for people who don&#39;t like being endlessly attacked by respawning enemy vampires), also no matter what vampire faction you join, a group of paladins will also hunt down the player.\r<br />\r<br />If you do drink the purgeblood potion though to become an ex-vampire, some of these paladins become optional companions. Lastly fire damage, and silver weapons do extremely high damage to non-elite vampires, and still pretty high damage to elite vampires, although this isn&#39;t so much the case on the one of a kind vampire bosses.\r<br />\r<br />And yes, drinking the purgeblood potion, will disable the vampiric (or vampire affiliated in the case of Helnarr-Jo&#39;s thrall) companions, and replace them with hostile versions of themselves that attack the player on sight... Because of course, they feel betrayed by you for rejecting their bloodline, and will forever hate you if you do that.\r<br />\r<br />New creatures have also been added, the Quarra have a new Quarra Great Hound that is a new type of dog that&#39;s roughly equally as powerful as a sabrecat, the Berne get an otherwise ordinary transparent dwarven spider that is heavily resistant to magic attacks, and the Aundae get phantom spiders with one spell that summons about 3-4 weak phantom spiders (equally as powerful as the usual small spiders), or at master conjuration a massive phantom spider. \r<br />\r<br />The massive phantom spider is weaker than a frost atronach in melee combat and will lose against it in all likelihood, but is stronger in melee combat than the storm atronach is, and it has a weak but useful ranged attack, it&#39;s initial jumping attack also does a lot of damage. Both phantom spiders are immune to frost damage being ghosts.\r<br />\r<br />The Aundae vampires also now have access to scrolls they can buy from the Aundae merchant who will teleport them safely to the Aundae base. Each faction now has 3 bounties left by the faction leaders, which you can find on a wall nearby said leaders. The scrolls explain where the targets are, why they want them killed, and other such details. You will be awarded gold, and a few items for killing them, although these items are either faction specific stuff, or stuff that exists in the default game.\r<br />\r<br />The Aundae companions are Hellnar-Jo&#39;s Thrall (the only non-vampire companion) who summons phantom spiders, and uses scalding hot poison spells, these spells on a target with no resistance do as much damage as default fire spells do, but instead half the damage is fire, and half the damage is poison, and Apprentice Aundae Cryomancer an Aundae vampire who summons frost atronachs and uses frost spells.\r<br />\r<br />For the Berne the companions are Ennassean Mirel also the fastest companion and the weaker brother of the Berne leader Senynd Mirel who is an archer with a spell called shadowgrasp that paralyzes targets for only one second, and causes minor shock damage, the spell is expensive and can&#39;t be recast very often. As well as the companion Apprentice Berne Archer without shadowgrasp who is weaker, and Ennassean also has the lightstep perk.\r<br />\r<br />For Quarra the companions are Yazgargzu Shazog the Quarra Leaders weaker sister who has very similar abilities but weaker stats to be a balanced companion, she is a two handed specialized warrior with higher carry weight than all the other companions, and the highest health. The other Quarra companion is Apprentice Quarra Berserker, who is essentially a weaker version of Yazgargzu and carries the second most weight.\r<br />\r<br />The companions are in Galthumun Luxury Depths, Vodeera Arena Forging Room, and Elinunab Laboratory, all connected to the door leading to the player home.  Also FYI the player homes are the places with non-respawning containers are where it&#39;s safe to keep your stuff. \r<br />\r<br />\r<br />So here&#39;s the form ID&#39;s of various things, as you may wish to use them for console commands in my mod.\r<br />\r<br />Not only has this mod been significantly improved, but now with the form IDs of extremely important things like companion NPCs, factions spells/abilities and perks clarified, there&#39;s also additional\r<br />customization using console commands now.\r<br />\r<br />\r<br />So if you want you could for instance make Lydia into a Quarra vampire, or an Aundae vampire, simply by giving her Vvardenfell Vampirism Companions/Quarra Vampirism, and the sun damage/normal weapon resistance perks, and clicking on her with the console then typing in &#34;addtofaction F5056173&#34; if the mod is F5 on your load order.\r<br />\r<br />Maybe a bug happened that removed all active spell effects? Or you had to remove all active spell effects? In the case that hypothetically happens, simply re-add the effects you lost, which would be vampire sun vulnerability player, vvardenfell vampirism, and either one of the three following Quarra, Berne or Aundae vampirism. Dispells are so incredibly rare in Skyrim it probably won&#39;t be much of an issue, but it&#39;s a good thing you know just in case.\r<br />\r<br />\r<br />If you WANT to you can even use the console to remove the restoration perk nerf, or sun vulnerability, I consider that to make Morrowind vampires extremely overpowered, and lore unfriendly, but it&#39;s your\r<br />game so do as you please.\r<br />\r<br />Further more by default the six companion NPCs, two per faction, are set as protected, however if you want to make them essential you can simply type their ID to make them essential. \r<br />Further more, if you have a multiple follower mod you can probably have two of them at once.\r<br />\r<br />Please note NPC vampires use a different sun damage mechanism than the player, which you can also remove if you want.\r<br />\r<br />Lastly, yes if you want to make a vanilla NPC, or an NPC from another mod into a Morrowind vampire, you can give them the Vvardenll Vampirism+Sun Damage vulnerability NPC+Resist normal weapons+\r<br />restoration nerf perk+Aundae, Quarra or Berne vampirism via console commands, and even set them into the specific vampiric faction you want them to be in.\r<br />\r<br />If you use companions from other mods as a Morrowind vampire, at the very least, I recommend adding them to your bloodlines faction, be it Aundae, Quarra, or Berne, so that they won&#39;t risk being\r<br />attacked by vampires of the same blood family if they quit your service in your fellow vampires presence.\r<br />\r<br />Technically you&#39;re SUPPOSED to use the blood potions to do everything in the most lore friendly, immersive, realistic way for lack of better term, but if some issue comes up, or a bug/glitch happen \r<br />which would otherwise ruin this mod, here are the form IDs, and related console commands you will need\r<br />\r<br />Addspell.\r<br />\r<br />AddPerk.\r<br />\r<br />AddToFaction.\r<br />\r<br />(Note that if you use AddtoFaction you will have to type 1 after the faction in question, like for example- click on player or even NPC in console, type AddToFaction F5056175 to add someone to the\r<br />Aundae faction).\r<br />\r<br />Don&#39;t worry the potions will handle everything, this mod doesn&#39;t force a bunch of immersion destroying console commands, and all the NPCs already have all of their appropriate perks, spells, and factions, these things here, are just optional levels of customization, as well as bug fixes should something go wrong in this mod.\r<br />\r<br />\r<br />Form IDs\r<br />\r<br />\r<br />Note to change first two digits to your specific load order.\r<br />\r<br />XX (&lt;Your load order number, where you have the Morrowind Vampires ESP on your active mod index, replace F5 with wherever it is on your mod load order, for example if it&#39;s at F5 replace the XX with F5).\r<br />\r<br />Aundae Potion ID-XX050b83\r<br />\r<br />Quarra Potion ID-XX050b85 \r<br />\r<br />Berne Potion ID-XX050b80\r<br />\r<br />\r<br />Aundae Faction ID- XX056175\r<br />\r<br />Quarra Faction ID- XX056173\r<br />\r<br />Berne Faction ID- XX056174\r<br />\r<br />Perk Restoration Nerf: XX0816D4\r<br />\r<br />Perk Resist Normal Weapons Perk: XX03AA22\r<br />\r<br />Spell Vvardenfell Vampire Sun Vulnerability NPC-XX084081\r<br />\r<br />Spell Vvardenfell Vampire Sun Vulnerability Player- XX0816CF\r<br />\r<br />Spell Vvardenfell Vampirism- XX02f538\r<br />\r<br />Spell Vvardenfell Vampirism Companions-XX084B5F\r<br />\r<br />\r<br />Faction Aundae Vampirism- XX000d67\r<br />\r<br />Faction Quarra Vampirism- XX02f52B\r<br />\r<br />Faction Berne Vampirism- XX02f534\r<br />\r<br />\r<br />NPC Berne Apprentice Archer- XX01DCC6\r<br />\r<br />NPC Berne Companion Ennassean Mirel- XX01DCD4\r<br />\r<br />\r<br />NPC Apprentice Quarra Berseker- XX01DCCC\r<br />\r<br />NPC Quarra Companion Yazgarzu Shazog- XX01DCD1\r<br />\r<br />NPC Apprentice Aundae Cryomancer- XX01DCCB\r<br />\r<br />NPC Aundae Companion Helnar-Jo&#39;s Thrall- XX01E36C\r<br />\r<br />\r<br />If you WANT to you can even use the console to remove the restoration perk nerf, or sun vulnerability, I consider that to make Morrowind vampires extremely overpowered, and lore unfriendly, but it&#39;s your game so do as you please.\r<br />\r<br />Further more by default the six companion NPCs, two per faction, are set as protected, however if you want to make them essential you can simply type their ID to make them essential.  Further more, if you have a multiple follower mod you can probably have two of them at once.\r<br />\r<br />Please note NPC vampires use a different sun damage mechanism than the player, which you can also remove if you want.\r<br />\r<br />Lastly, yes if you want to make a vanilla NPC, or an NPC from another mod into a Morrowind vampire, you can give them the Vvardenll Vampirism+Sun Damage vulnerability NPC+Resist normal weapons+ restoration nerf perk+Aundae, Quarra or Berne vampirism via console commands, and even set them into the specific vampiric faction you want them to be in.\r<br />\r<br />If you use companions from other mods as a Morrowind vampire, at the very least, I recommend adding them to your bloodlines faction, be it Aundae, Quarra, or Berne, so that they won&#39;t risk being attacked by vampires of the same blood family if they quit your service in your fellow vampires presence.\r<br />\r<br />Technically you&#39;re SUPPOSED to use the blood potions to do everything in the most lore friendly, immersive, realistic way for lack of better term, but if some issue comes up, or a bug/glitch happen which would otherwise ruin this mod, here are the form IDs, and related console commands you will need\r<br />\r<br />Addspell.\r<br />\r<br />AddPerk.\r<br />\r<br />AddToFaction.\r<br />\r<br />(Note that if you use AddtoFaction you will have to type 1 after the faction in question, like for example- click on player or even NPC in console, type AddToFaction F5056175 to add someone to the\r<br />Aundae faction).\r<br />\r<br />Don&#39;t worry the potions will handle everything, this mod doesn&#39;t force a bunch of immersion destroying console commands, and all the NPCs already have all of their appropriate perks, spells, and factions, these things here, are just optional levels of customization, as well as bug fixes should something go wrong in this mod.",
  "categoryId": "30",
  "version": "",
  "author": "Letrarunt",
  "createdUnix": "1377420044",
  "updatedUnix": "1466306433",
  "containsAdultContent": false,
  "uploadedBy": "Letrarunt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049396",
      "name": "Readme mod spoiler warning",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "Readme mod spoiler warning-32799-.zip",
      "uploadedUnix": "1377416996",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ed67691c70af2c97b64bbcbedaa6e12ccc546dda9d47debe771fbc78feb8b4b7/analysis/1407695903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Readme%20mod%20spoiler%20warning-32799-.zip?fid=1000049396&ttl=1535809510&ri=8192&rs=8192&setec=11fab2a1f1e9acfd14dad9a1ab355711"
    },
    {
      "fileId": "1000050656",
      "name": "XemorahFlawedAttackNerfBatReBalanced",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51191",
      "fileName": "XemorahFlawedAttackNerfBatReBalanced-32799-.zip",
      "uploadedUnix": "1377804244",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3224ffebd9e05eea217cad487fd987fac83091e22a06a8157dc0a5743e8a5e3c/analysis/1407701273/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahFlawedAttackNerfBatReBalanced-32799-.zip?fid=1000050656&ttl=1535809511&ri=8192&rs=8192&setec=75f27f6fe42729fc17517055f0c10d0a"
    },
    {
      "fileId": "1000050658",
      "name": "XemorahFlawedAttackNerfBatOld",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51176",
      "fileName": "XemorahFlawedAttackNerfBatOld-32799-.zip",
      "uploadedUnix": "1377804248",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/9d27ebeea09666e48d8b461deb58f623d96f531055b3328abee7ffe1871de07f/analysis/1407701281/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahFlawedAttackNerfBatOld-32799-.zip?fid=1000050658&ttl=1535809511&ri=8192&rs=8192&setec=e3dbc8a697e203edea4c98913378d2b7"
    },
    {
      "fileId": "1000050659",
      "name": "XemorahFlawedAttackSuperRebalanced",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51188",
      "fileName": "XemorahFlawedAttackSuperRebalanced-32799-.zip",
      "uploadedUnix": "1377804250",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a488795c270f38968247d6c047041f1afbc708458a6f6eaa5dbb4463c0aadbbe/analysis/1407701369/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahFlawedAttackSuperRebalanced-32799-.zip?fid=1000050659&ttl=1535809512&ri=8192&rs=8192&setec=4d7a96b0a555d90d005fc6fc2c65b66b"
    },
    {
      "fileId": "1000050661",
      "name": "XemorahFlawedAttackSuperOld",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51174",
      "fileName": "XemorahFlawedAttackSuperOld-32799-.zip",
      "uploadedUnix": "1377804253",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d0f65c7d4782a8417a5706d48598b8f03a611acb3e84d9ca17c88b8977d597a7/analysis/1407701352/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahFlawedAttackSuperOld-32799-.zip?fid=1000050661&ttl=1535809512&ri=8192&rs=8192&setec=06fcab3d584d5fc17461fcb89b4753fa"
    },
    {
      "fileId": "1000050662",
      "name": "XemorahIslandNoAttackNerfBatOld",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51185",
      "fileName": "XemorahIslandNoAttackNerfBatOld-32799-.zip",
      "uploadedUnix": "1377804255",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/421d89dfe5bfd6430a8f7861c88ea265d22bfdf0350a6efe38bc14ba954b45a8/analysis/1407701360/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandNoAttackNerfBatOld-32799-.zip?fid=1000050662&ttl=1535809513&ri=8192&rs=8192&setec=82b6df65a9e7dcd933ba9445e94d1b01"
    },
    {
      "fileId": "1000050663",
      "name": "XemorahIslandNoAttackNerfBatRebalanced",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51199",
      "fileName": "XemorahIslandNoAttackNerfBatRebalanced-32799-.zip",
      "uploadedUnix": "1377804256",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/585e8b31130e6229721ea678d37beb0bafbc7ff0a4204586dc103492712099f5/analysis/1407701392/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandNoAttackNerfBatRebalanced-32799-.zip?fid=1000050663&ttl=1535809513&ri=8192&rs=8192&setec=2df8175b8e35abbfc61d464759eee9d3"
    },
    {
      "fileId": "1000050665",
      "name": "XemorahNoAttackSuperPowersRebalanced",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51205",
      "fileName": "XemorahNoAttackSuperPowersRebalanced-32799-.zip",
      "uploadedUnix": "1377804322",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5ac8974be9e2bcc0af11e242b7701343b6bcbb24b011914c9ef2f2979f2e492c/analysis/1407701392/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahNoAttackSuperPowersRebalanced-32799-.zip?fid=1000050665&ttl=1535809513&ri=8192&rs=8192&setec=c72e41a8c7c39432f94572c01cd7633f"
    },
    {
      "fileId": "1000050666",
      "name": "XemorahNoAttackSuperPowersOld",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51190",
      "fileName": "XemorahNoAttackSuperPowersOld-32799-.zip",
      "uploadedUnix": "1377804334",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5934864e7066634d30849ea24c6908456e1488a9ea80644a1f2ab0d01c0b5744/analysis/1407701404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahNoAttackSuperPowersOld-32799-.zip?fid=1000050666&ttl=1535809514&ri=8192&rs=8192&setec=a2ae3a6def5adc18cccb3908da9e5681"
    },
    {
      "fileId": "1000060825",
      "name": "XemorahIslandMassiveUpdateBetterVampsNerfBat",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "74205",
      "fileName": "XemorahIslandMassiveUpdateBetterVampsNerfBat-32799-.zip",
      "uploadedUnix": "1380750429",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/cf89ef10b0ebf3b1a0902a857d1ae31f753b5569b6882fc5a0462b4735c5aa48/analysis/1407743058/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateBetterVampsNerfBat-32799-.zip?fid=1000060825&ttl=1535809514&ri=8192&rs=8192&setec=1f272d4d2ebc55a0baff3e182a9565e9"
    },
    {
      "fileId": "1000060829",
      "name": "XemorahIslandMassiveUpdateSuperBetterVamps",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "74200",
      "fileName": "XemorahIslandMassiveUpdateSuperBetterVamps-32799-.zip",
      "uploadedUnix": "1380750503",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ed39530a05eb100fa4af52fa1b9040e7955b7dd93d66a041bd45a6536896f0e1/analysis/1407743119/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateSuperBetterVamps-32799-.zip?fid=1000060829&ttl=1535809515&ri=8192&rs=8192&setec=ca115ef60d5a9156de014c7ea6e0f642"
    },
    {
      "fileId": "1000060833",
      "name": "XemorahIslandMassiveUpdateNoDawnguardOrBetterVampsSuper",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "74235",
      "fileName": "XemorahIslandMassiveUpdateNoDawnguardOrBetterVampsSuper-32799-.zip",
      "uploadedUnix": "1380750546",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a7d729b8f259e9795332afbcf5b9be31e2ed1d5355ffc8f94c647db51bcc907a/analysis/1407743144/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateNoDawnguardOrBetterVampsSuper-32799-.zip?fid=1000060833&ttl=1535809515&ri=8192&rs=8192&setec=9cc1d2b937dc6e7aff127cdf7e0286ab"
    },
    {
      "fileId": "1000060845",
      "name": "XemorahIslandMassiveUpdateNoDawnguardOrBetterVampsNerfbat",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "74241",
      "fileName": "XemorahIslandMassiveUpdateNoDawnguardOrBetterVampsNerfbat-32799-.zip",
      "uploadedUnix": "1380751494",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2710c976cc105e293497543f381e5c043346107f29926004f940daedf21501ac/analysis/1407743152/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateNoDawnguardOrBetterVampsNerfbat-32799-.zip?fid=1000060845&ttl=1535809516&ri=8192&rs=8192&setec=0d12c4e35b4e52e8366b03b94f293676"
    },
    {
      "fileId": "1000098042",
      "name": "XemorahIslandMassiveUpdateOldSuper2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73443",
      "fileName": "XemorahIslandMassiveUpdateOldSuper2014-32799-.zip",
      "uploadedUnix": "1392975986",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/42663277f4a8e9b2e37a16027bb098afad59097e6e8354290c027b37fd37b2e2/analysis/1407943259/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateOldSuper2014-32799-.zip?fid=1000098042&ttl=1535809516&ri=8192&rs=8192&setec=f11a70570ccd11c97bd7ec17c8927669"
    },
    {
      "fileId": "1000098043",
      "name": "XemorahIslandMassiveUpdateSuperBetterVamps2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73443",
      "fileName": "XemorahIslandMassiveUpdateSuperBetterVamps2014-32799-.zip",
      "uploadedUnix": "1392975989",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/42663277f4a8e9b2e37a16027bb098afad59097e6e8354290c027b37fd37b2e2/analysis/1407943259/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateSuperBetterVamps2014-32799-.zip?fid=1000098043&ttl=1535809517&ri=8192&rs=8192&setec=5643e6880f0c84d427992182f3c04517"
    },
    {
      "fileId": "1000098044",
      "name": "XemorahIslandMassiveUpdateNerfbatOld2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73443",
      "fileName": "XemorahIslandMassiveUpdateNerfbatOld2014-32799-.zip",
      "uploadedUnix": "1392975991",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4e09bace59e7181c6ad0188949ff3609de3e42d25710b6eb9aec8f1074284e61/analysis/1407943306/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateNerfbatOld2014-32799-.zip?fid=1000098044&ttl=1535809517&ri=8192&rs=8192&setec=00e979b6fbb8644f954c3c921df02a03"
    },
    {
      "fileId": "1000098045",
      "name": "XemorahIslandMassiveUpdateBetterVampsNerfbat2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73443",
      "fileName": "XemorahIslandMassiveUpdateBetterVampsNerfbat2014-32799-.zip",
      "uploadedUnix": "1392975993",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/cdbea19233ae29d8778c7409a41c5febbe3ce5814a639fd1806c79954e227aba/analysis/1407943305/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateBetterVampsNerfbat2014-32799-.zip?fid=1000098045&ttl=1535809518&ri=8192&rs=8192&setec=0de59da4aae926ef6b8fb75315e89175"
    },
    {
      "fileId": "1000098080",
      "name": "ReadMeFor2014VersionsOfXemorahIsland",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "ReadMeFor2014VersionsOfXemorahIsland-32799-.zip",
      "uploadedUnix": "1392998624",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d52a01d15c752fe69684d1062f9b3a5905d7870b15b265cb9ad18b036ed4f097/analysis/1407943782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ReadMeFor2014VersionsOfXemorahIsland-32799-.zip?fid=1000098080&ttl=1535809518&ri=8192&rs=8192&setec=5aac7a724b8be9b57dfb635677affe9d"
    },
    {
      "fileId": "1000098081",
      "name": "XemorahIslandReadMe2014Versions",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "XemorahIslandReadMe2014Versions-32799-.zip",
      "uploadedUnix": "1392998634",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/885a1181e6c0854b33cf845e9f391f41e7d19148bee182177f52eb91d3cd4486/analysis/1407943783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandReadMe2014Versions-32799-.zip?fid=1000098081&ttl=1535809518&ri=8192&rs=8192&setec=50aa02ee06e57b2bca5a5d806adf2219"
    },
    {
      "fileId": "1000098459",
      "name": "XemorahIslandMassiveUpdateBetterVampsNerfbatPatch2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73522",
      "fileName": "XemorahIslandMassiveUpdateBetterVampsNerfbatPatch2014-32799-.zip",
      "uploadedUnix": "1393190081",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a8adab11a37e0f51eb18580e457ff7950918472ac86f705c587da49d598027c2/analysis/1407947388/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateBetterVampsNerfbatPatch2014-32799-.zip?fid=1000098459&ttl=1535809519&ri=8192&rs=8192&setec=dc91a9ece28711cdecca294047483214"
    },
    {
      "fileId": "1000098460",
      "name": "XemorahIslandMassiveUpdateOldSuperPatch2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73522",
      "fileName": "XemorahIslandMassiveUpdateOldSuperPatch2014-32799-.zip",
      "uploadedUnix": "1393190085",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/70aac89fb3b60585990f45fdf1bb579ab6520741d8c8668693d78c4a8c801cd4/analysis/1407947311/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateOldSuperPatch2014-32799-.zip?fid=1000098460&ttl=1535809519&ri=8192&rs=8192&setec=f3ef4efba0ffc73531fb32c009b6d0d2"
    },
    {
      "fileId": "1000098461",
      "name": "XemorahIslandMassiveUpdateSuperBetterVampsPatch2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73522",
      "fileName": "XemorahIslandMassiveUpdateSuperBetterVampsPatch2014-32799-.zip",
      "uploadedUnix": "1393190092",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/6ceb8db96a47703103a5b31fdcea6d43af3a857076cebd6ca0fb34af27200838/analysis/1407947334/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateSuperBetterVampsPatch2014-32799-.zip?fid=1000098461&ttl=1535809520&ri=8192&rs=8192&setec=160c3c0c1eddd1ce6ca64a9eb21a6cb6"
    },
    {
      "fileId": "1000098462",
      "name": "XXemorahIslandMassiveUpdateNerfbatOldPatch2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73522",
      "fileName": "XXemorahIslandMassiveUpdateNerfbatOldPatch2014-32799-.zip",
      "uploadedUnix": "1393190093",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/141ff4c75198dbcdaafd57fe4359eb06361c545308e96cceff532678d1d23a0e/analysis/1407947369/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XXemorahIslandMassiveUpdateNerfbatOldPatch2014-32799-.zip?fid=1000098462&ttl=1535809520&ri=8192&rs=8192&setec=d940b79cec8814c7afb887caf3e2a932"
    },
    {
      "fileId": "1000099162",
      "name": "XemorahIslandMassiveUpdateSuperBetterVampsPatchBugFix2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73540",
      "fileName": "XemorahIslandMassiveUpdateSuperBetterVampsPatchBugFix2014-32799-.zip",
      "uploadedUnix": "1393622800",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4ae8ee4f33eab6299972d02ece40a03ca6396cd7642eaedaeb0fc77a228d0c8e/analysis/1407954136/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateSuperBetterVampsPatchBugFix2014-32799-.zip?fid=1000099162&ttl=1535809521&ri=8192&rs=8192&setec=a753cc90a8199cfa4a5ee351382bef24"
    },
    {
      "fileId": "1000099163",
      "name": "XemorahIslandMassiveUpdateBetterVampsNerfbatPatchBugFix2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73540",
      "fileName": "XemorahIslandMassiveUpdateBetterVampsNerfbatPatchBugFix2014-32799-.zip",
      "uploadedUnix": "1393622803",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/59d7769334cbd3ca2798046401a95f5bba7daee406e7dae7d6c1c8d9e7cc15aa/analysis/1407954147/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateBetterVampsNerfbatPatchBugFix2014-32799-.zip?fid=1000099163&ttl=1535809521&ri=8192&rs=8192&setec=0c2e87940417c3dbee21d4b4fa85d8cc"
    },
    {
      "fileId": "1000099164",
      "name": "XemorahIslandMassiveUpdateOldSuperPatchBugFix2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73540",
      "fileName": "XemorahIslandMassiveUpdateOldSuperPatchBugFix2014-32799-.zip",
      "uploadedUnix": "1393622809",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ef20523c19c923c2f649ea1eb39151cdab49d4417d8aa1843e27b6f335f03ef8/analysis/1407954167/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateOldSuperPatchBugFix2014-32799-.zip?fid=1000099164&ttl=1535809521&ri=8192&rs=8192&setec=c4b4befe718a6753bac565051ac345bf"
    },
    {
      "fileId": "1000099165",
      "name": "XemorahIslandMassiveUpdateNerfbatOldPatchBugFix2014",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73540",
      "fileName": "XemorahIslandMassiveUpdateNerfbatOldPatchBugFix2014-32799-.zip",
      "uploadedUnix": "1393622811",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c9f7216143edf2b9d799c3810605241ecaa36d077f613e47acf2b6ca9d206201/analysis/1407954187/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XemorahIslandMassiveUpdateNerfbatOldPatchBugFix2014-32799-.zip?fid=1000099165&ttl=1535809522&ri=8192&rs=8192&setec=93276570de62df5ef45c05a9df00f7a5"
    },
    {
      "fileId": "1000131654",
      "name": "2014VersionsReadme",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "2014VersionsReadme-32799-.zip",
      "uploadedUnix": "1413723749",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3584aa2c6d268a4f8f166dc746817bd88abe880347286b035675df5c0d238384/analysis/1413723842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/2014VersionsReadme-32799-.zip?fid=1000131654&ttl=1535809522&ri=8192&rs=8192&setec=8257d87ebb9e82f66956a390b4afc4d8"
    },
    {
      "fileId": "1000131692",
      "name": "MorrowindVampiresUpgradedNoRespawnsSafeSkyrim",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91861",
      "fileName": "MorrowindVampiresUpgradedNoRespawnsSafeSkyrim-32799-.zip",
      "uploadedUnix": "1413745081",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/fad4999f37d22752bda2dcde57aed7e26449cd86c69dc63f48ad285eed350e94/analysis/1413745217/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MorrowindVampiresUpgradedNoRespawnsSafeSkyrim-32799-.zip?fid=1000131692&ttl=1535809523&ri=8192&rs=8192&setec=cc538ee3ede12f394b2c77b3e8fb07d7"
    },
    {
      "fileId": "1000131693",
      "name": "MorrowindVampiresUpgraded",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91862",
      "fileName": "MorrowindVampiresUpgraded-32799-.zip",
      "uploadedUnix": "1413745099",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/239af4feef9d2821e4ceadf61151de36e17f689f8d6a1e965d76e7e5f5ebadbc/analysis/1413745232/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MorrowindVampiresUpgraded-32799-.zip?fid=1000131693&ttl=1535809523&ri=8192&rs=8192&setec=9e8ea3195e4bee632fd7de5d20deb5a9"
    },
    {
      "fileId": "1000131694",
      "name": "MorrowindVampiresUpgradedNoRespawns",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91863",
      "fileName": "MorrowindVampiresUpgradedNoRespawns-32799-.zip",
      "uploadedUnix": "1413745099",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/6ab24b756cbddc3d3834dd074a28b5be61fa4d47f0fb69ed7f6a9d7b033693fe/analysis/1413745247/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MorrowindVampiresUpgradedNoRespawns-32799-.zip?fid=1000131694&ttl=1535809524&ri=8192&rs=8192&setec=ba9d60d449158f8fc19d26f97afee4bf"
    },
    {
      "fileId": "1000131695",
      "name": "MorrowindVampiresUpgradedSafeSkyrim",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91862",
      "fileName": "MorrowindVampiresUpgradedSafeSkyrim-32799-.zip",
      "uploadedUnix": "1413745105",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1855c18af4d56dd806e88d679abd3028ec22d4ec275b1aff3a949d0f16bdefc1/analysis/1413745261/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MorrowindVampiresUpgradedSafeSkyrim-32799-.zip?fid=1000131695&ttl=1535809524&ri=8192&rs=8192&setec=acc3ed9fd1352e3494ba3142d90a4e0c"
    },
    {
      "fileId": "1000131825",
      "name": "MorrowindVampiresUpgradedNeutralDragonBorn",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "92956",
      "fileName": "MorrowindVampiresUpgradedNeutralDragonBorn-32799-.zip",
      "uploadedUnix": "1413833286",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2f4315ccd185b54301c5fd05332e6a64a2d7401616a09add3ca3cac1c971c5a3/analysis/1413833417/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MorrowindVampiresUpgradedNeutralDragonBorn-32799-.zip?fid=1000131825&ttl=1535809525&ri=8192&rs=8192&setec=8ef2735d612ff9c331449116aff0f085"
    },
    {
      "fileId": "1000131826",
      "name": "MorrowindVampiresUpgradedNeutral",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "92955",
      "fileName": "MorrowindVampiresUpgradedNeutral-32799-.zip",
      "uploadedUnix": "1413833294",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/01f16273b64655d54fb17613b5d853f602b71cc35270aca65237dab76ba62aa3/analysis/1413833434/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MorrowindVampiresUpgradedNeutral-32799-.zip?fid=1000131826&ttl=1535809525&ri=8192&rs=8192&setec=812490fa93a57a098b7c13a1f0cb0a38"
    },
    {
      "fileId": "1000134052",
      "name": "MorrowindVampiresUltraUpgradedOutdatedNow",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "93231",
      "fileName": "MorrowindVampiresUltraUpgraded-32799-.zip",
      "uploadedUnix": "1415228369",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5e1f8bce81e3e92e2893bd2789937865c91a158925d8ec2b5c116a311cc2b85e/analysis/1415228482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MorrowindVampiresUltraUpgraded-32799-.zip?fid=1000134052&ttl=1535809526&ri=8192&rs=8192&setec=5905cdb4cc650983f3a2eef5d2ba5dce"
    },
    {
      "fileId": "1000210085",
      "name": "MorrowindVampires2016Edition",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31780",
      "fileName": "MorrowindVampires2016ImprovedEdition-32799-.7z",
      "uploadedUnix": "1466106476",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f6fc6670dee1bb67dfb95e26123717708209bc357357137a5292eda0fe27edae/analysis/1466117529/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MorrowindVampires2016ImprovedEdition-32799-.7z?fid=1000210085&ttl=1535809526&ri=8192&rs=8192&setec=f60892874279b79a05b3ccd186f0e01b"
    },
    {
      "fileId": "1000210303",
      "name": "MorrowindVampiresRequiemPatch",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28791",
      "fileName": "MorrowindVampiresRequiemPatch-32799-.7z",
      "uploadedUnix": "1466306433",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4f01cc617cac5782dfb5d3f2a807dca2d2773fa3bf3ebecb522fa448066dd4d5/analysis/1466317515/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MorrowindVampiresRequiemPatch-32799-.7z?fid=1000210303&ttl=1535809527&ri=8192&rs=8192&setec=d283e86fa62f18140f51511b2200a47a"
    }
  ]
}