{
  "modId": 32808.0,
  "modName": "Pet Shop - Move them into your home or anywhere else",
  "summary": "Allows you to adopt an animal companion (wolf, sabre cat or crab) and have that pet return to wherever you choose when you dismiss them.  No DLC required.",
  "descriptionHtml": "(No DLC required) \r\nJust behind the Windhelm Stables, Gorob the retired Orc hunter has opened up a pet shop. Currently, he has Philia the Wolf, Krag the Sabrecat and Clack the Crab up for adoption. Each pet comes with an item they are particularly attached to. For Philia, it\\'s a sabrecat hide blanket, for Krag, it\\'s a chew toy ripped from some poor tusker, and for Clack it\\'s the toe of an adventurer that wandered too close. When you tell them to go home, they will return to wherever you\\'ve placed their particular item. \r\n\r\nAdopting one or all of them is easy: buy the adoption papers from Gorob (just meant to cover the expenses of caring for them of course) and THEN go say hello to your new friend. \r\n\r\nNo DLC required, but compatible wth DawnGuard, Hearthfires and Dragonborn \r\n--- \r\nNotes: \r\nEach is essential, and levels with the Dragonborn, from 6-55. \r\n\r\nTo access their commands, you have to have the right adoption papers on you (Gorob has 5 of each in case you lose them.) \r\n\r\nIt\\'s best not to \\\"activate\\\" or try to talk to any of them until you have the right papers. They\\'re lonely, meaning you won\\'t be able to dismiss them until you\\\\\\'ve officially adopted. (If you don\\'t have an animal companion, \\\"activating\\\" one of these puts your animal follower count at 1 until you \\\"dismiss\\\" that animal.) \r\n\r\nOf course, you should dismiss any animal followers before adopting any of these. \r\n\r\nFinally, if you happen to have the item the particular animal companion is attached to in your inventory when you \\\"dismiss\\\" them --meaning you don\\\\\\'t have it set down anywhere currently-- no worries, your pet isn\\'t lost. They will return to the last place the item was set down.  You can also simply set it down in a new place and they will go there.\r\n\r\n",
  "categoryId": "65",
  "version": "",
  "author": "Phreejazz",
  "createdUnix": "1362458405",
  "updatedUnix": "1362459432",
  "containsAdultContent": false,
  "uploadedBy": "phreejazz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000015144",
      "name": "GorobsPetShop",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "GorobsPetShop-32808-.rar",
      "uploadedUnix": "1362459432",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e50a79eb2441f20eacee753711b0ebea782af8b94c4015e0d0490e4f2cc41786/analysis/1407453372/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GorobsPetShop-32808-.rar?fid=1000015144&ttl=1535809541&ri=8192&rs=8192&setec=b4c12d82eb04adee51cc5a4ad418bdaa"
    }
  ]
}