{
  "modId": 32804.0,
  "modName": "Companions Radiant Quest Adjustment",
  "summary": "This Mod alters the random way in which the radiant quests are given by the Companions to modify the chances that the special radiant quests will be the ones given once available. It also unlocks the hidden Animal Pelt Collection radiant quest and adds it to Aela\\'s potential quest choices.",
  "descriptionHtml": "[font=Century Gothic][size=2]This Mod alters the random way in which the radiant quests are given by the Companions to modify the chances that the special radiant quests will be the ones given once available. The “Totems of Hircine” quest is now significantly more likely to be given. Farkas will now only offer the “Purity” quest once his brother Vilkas has completed it. It also unlocks the hidden “Animal Pelt Collection” radiant quest and adds it to Aela’s potential quest choices.\r\nIt does not add, change or remove any of the main Companion quests.[/size]\r\n\r\n[size=3][color=orange][u]Installation/Uninstallation[/u][/color][/size]\r\n[size=2]To install, make sure that you do not currently have an active Companions Radiant Quest then simply download and activate using NMM or download the file manually, unpack with 7-zip and drop the plugin files into your Skyrim Data folder, then ensure that it is activated in your Data files.\r\n\r\nTo uninstall, make sure that you do not currently have an active Companions Radiant Quest then simply use NMM to uninstall or delete the files from your Skyrim Data folder.[/size]\r\n\r\n[size=3][color=orange][u]Load Order[/u][/color][/size]\r\n[size=2]Make sure to add this AFTER anything else that alters Companion Radiant Quests.[/size]\r\n\r\n[size=3][color=orange][u]Final Comments[/u][/color][/size]\r\n[size=2]This was actually my first Mod but I ended up producing [url=http://skyrim.nexusmods.com/mods/32681]Dawnguard Radiant Quest Adjustment[/url] first as I used it as a training exercise for this one. I would like to thank the Nexus community for the support and encouragement that spurred me on to create this Mod, Sydney666 is mostly to blame ;) and most especially to Eckss for all of his help and advice.[/size][/font]\r\n",
  "categoryId": "35",
  "version": "1.1",
  "author": "Nemesis The Warlock",
  "createdUnix": "1362447417",
  "updatedUnix": "1365283620",
  "containsAdultContent": false,
  "uploadedBy": "NemesisTheWarlock",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000022912",
      "name": "Companions Radiant Quest Adjustment",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Companions Radiant Quest Adjustment-32804-1-1.7z",
      "uploadedUnix": "1365283620",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c178c8324056d1c2b34c8176027f8b6c356853f3840a05225bad761c51e62cd7/analysis/1407510128/",
      "changelogHtml": " Fixed the vanilla Companions Radiant Quest reward bug <br/> \n Created a comprehensive fix for the random pelt spawning bug in Jorrvaskr <br/> \n Fixed the Vilkas quest bug reintroduced by the 1.9 update <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Companions%20Radiant%20Quest%20Adjustment-32804-1-1.7z?fid=1000022912&ttl=1535809534&ri=8192&rs=8192&setec=fd7236443b09aeb965cc11d3212f0382"
    }
  ]
}