{
  "modId": 32811.0,
  "modName": "Mark Targets",
  "summary": "Adds a new lesser power that allows you to mark targets. This power can be unlocked from the Sneak tree with a skill level of 30. Marked targets glow and can be seen through walls for a short time similar to the Detect Life spells.",
  "descriptionHtml": "[b]Overview[/b]\r\n\r\nYou can get this power by investing a perk point in the Sneak tree at level 30. The power allows you to keep track of targets from behind obstacles and walls. Targets will glow blue for 90 seconds.\r\n\r\nSince this is a sneak power this is only useful for tracking targets while you are sneaking. You can keep track of their movements, see their patterns, and try to avoid running into them around a corner while you are attempting to move around. If the targets detect you or are hit with anything or die then the effect will dispel. There is no limit to the number of targets that can be marked at the same time.\r\n\r\n[line]\r\n\r\n[b]Install[/b]\r\n\r\n[list]\r\n[*]Nexus Mod Manager (Recommended): This is fully compatible with the mod manager. Just download with it and install.\r\n[*]Manual: unzip into the Skyrim Data folder\r\n[/list]\r\n\r\n[line]\r\n\r\n[b]Uninstall[/b]\r\n\r\nIf installed manually you need to delete the MarkTarget.esp file from the Data folder and the Data\\\\Textures\\\\MarkTarget folder.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Darkwind Media",
  "createdUnix": "1362461523",
  "updatedUnix": "1362459885",
  "containsAdultContent": false,
  "uploadedBy": "darkwindmedia",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000015147",
      "name": "Mark Targets",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Mark Targets-32811-1-0.7z",
      "uploadedUnix": "1362459885",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/527e6adf15562439e1a9107ce206df496c6952bf1c9fb8ed36d9e8581f4d3aff/analysis/1407453422/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mark%20Targets-32811-1-0.7z?fid=1000015147&ttl=1535809551&ri=8192&rs=8192&setec=f2fb1f2f8fc6b85b78adf5c9413db5fb"
    }
  ]
}