{
  "modId": 32818.0,
  "modName": "White Hot Flames",
  "summary": "Changes the Texture of All the Fire Spells in Game to a White with a Little Bit Of Blue, Compatible with HD REALISTIC FLAMES Just Replaces the Textures, No .esp so its CTD Free!",
  "descriptionHtml": "This Replaces All the Flames Textures except for the Fire Rune Spell\r\n\r\nNOTE: Changes the Vanilla Colour of the Flames to White and Bit Blue Flames, DOES NOT ADD NEW ANIMATIONS OR MESHES JUST TEXTURES\r\n\r\nThis Looks Great With any Kind Of Character You Might Come Up With, If it Has Fluffy Boots and a Fuzzy Tale or Resemble a Cripple Inbred Baby Alduin it Still Looks Nice\r\n\r\nIts Just New Textures with no .esp File so it is Bug Free and Tested Thoroughly Just For incase Some Crazy Shit Happens.. Well Crazy Shit Will Happen, Why Not Light Up a Few Enemies and See them Clear as Day in the Dark While Screaming They Don\\'t Have the \\'Stop, Drop and Roll\\' animation! \r\n\r\nI Left the Fire Rune Colour Normal Because its not Flames.. You want Flames? Step on it.. I tried to Keep Realism a Factor Although White and Blue Flames are So Rare in Real Life.. But so Are Dragons, Point is it Fits in Nicely with Skyrim\\'s Theme, The Flames will Still Have Normal Red Flames at the ends and the smoke is still black so the Flames Just Look Intensely Hot\r\n\r\nThe Textures was Tested by DKLAN66 using the HD REALISTIC FIRE Mod and it Looks Even Better with the Textures of this Mod on Those Meshes and Animations\r\n\r\nAnd as Permission Goes.. Do with This what Ever You want.. If You Just Put My Name Behringer911 in somewhere I will Be Happy.. And a Happy Me will Help Me Release My Argonia Map Mod I am Working on So Frantically, Peace",
  "categoryId": "62",
  "version": "1",
  "author": "Behringer911",
  "createdUnix": "1362575460",
  "updatedUnix": "1362470724",
  "containsAdultContent": false,
  "uploadedBy": "Behringer911",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000015170",
      "name": "White Hot Flame Textures",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "256",
      "fileName": "White Hot Flame Textures-32818-1.7z",
      "uploadedUnix": "1362470724",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/09bf901ca75ba20f43d9d7abc718b530aaf568ec938b841029ba1707bb996d45/analysis/1407453607/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20Hot%20Flame%20Textures-32818-1.7z?fid=1000015170&ttl=1535809564&ri=8192&rs=8192&setec=6daa5a32314183f637c1e9bd49d61631"
    }
  ]
}