{
  "modId": 32840.0,
  "modName": "CBM - Natural Curvy Cleavage (CBBE body - clothing - armor)",
  "summary": "My own version of the CBBE body (created using Bodyslide 2) designed to look very curvy and appear natural (requires HDT/TBBP compatible skeleton). Special armor/clothing designed just for this body morph also included.",
  "descriptionHtml": "[size=4][i][color=#f1c232][u]\r<br />STATUS:[/u][/color][/i][/size]\r<br /> \r<br />- Receiving updates.\r<br />\r<br />[color=#f1c232]\r<br />[size=4][i][u]COMPATIBILITY:[/u][/i][/size][/color]\r<br />\r<br />* Replaces the default body, armor and clothing with versions created using CBBE Bodyslide 2. If you already use a custom body type you should backup those files first before installing these. This mod only includes meshes and [b]no textures[/b] whatsoever, it will use the textures you already have installed as default (so obviously they have to be CBBE compatible). Also requires that you have a custom skeleton installed for breast/butt animations to function correctly.\r<br />\r<br />\r<br />[size=4][i][color=#f1c232][u]CONTENT GUIDE:[/u][/color][/i][/size]\r<br />\r<br />1. Mod Details\r<br />2. Planned Updates\r<br />3. Install/Uninstall\r<br />4. Bugs/Fixes\r<br />5. Q&A\r<br />6. Best Comments Wall\r<br />\r<br />\r<br />[color=#f1c232][size=5][b][u][MOD DETAILS][/u][/b][/size][/color]\r<br />\r<br />- Here are the fine details on what my mod changes about the game :D\r<br />\r<br />* Replaces the default body, most armor and most clothing (including Skyrim&#39;s DLC) with versions created using CBBE Bodyslide 2.\r<br />\r<br />* IMPORTANT&#33; Most of the armor and clothing included with this mod is based on preset files designed specifically for Bodyslide 2 which were uploaded by ChronoTrigger77. I have NOT included those preset files because I do not have permission to do so, if you wish to create your own armor and clothing using Bodyslide 2 as well as the presets created by ChronoTrigger77 then you can download them at the link located just below (also remember to endorse his mod anyway if you like the clothing and armor&#33;).\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/25259/]Remodeled Armor for CBBE Bodyslide by ChronoTrigger77\r<br />[/url]\r<br />* This body type was designed to be a &#34;gifted&#34; and curvy hourglass figure but also to appear natural to go with the flow of the game&#39;s fantasy setting. As for the variety of armor and clothing used they are more revealing (lots of cleavage and push-up including the &#34;undressed&#34; underwear model) but NOT extremely skimpy (no nudity, see images section).\r<br />\r<br />* The included &#34;undressed&#34; nude model is also designed to be curvy but more natural (no cleavage or push-up, breasts fall naturally and buttocks hangs loose).\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][PLANNED UPDATES][/b][/u][/size][/color]\r<br />\r<br />[size=4][u]Official[/u][/size] \r<br />\r<br />- These are changes I will definitely include as future updates\r<br />\r<br />* None so far.\r<br />\r<br />[size=4][u]Feedback[/u][/size] \r<br />\r<br />- These are changes based on feedback which I may or may not include as updates)\r<br />\r<br />* None so far.\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][INSTALL/UNINSTALL][/b][/u][/size][/color]\r<br />\r<br />[size=4][u]Install[/u][/size]\r<br />\r<br />- Simply copy the downloaded files of your choice to the &#34;Data&#34; folder found in Skyrim&#39;s root folder location.\r<br />\r<br />- Includes 3 options that each need to be installed:\r<br />\r<br />1. The default &#34;undressed&#34; body, either the [i]nude[/i] version [b]OR[/b] the [i]underwear [/i]version. Using both requires that you have experience with the Creation Kit tool.\r<br />2. All armor and clothing designed for vanilla (the usual armor and clothing with no DLC included).\r<br />3. All armor and clothing designed for DLC only (obviously requires that you own the DLC content of the game).\r<br />\r<br />[size=4][u]Uninstall[/u][/size]\r<br />\r<br />- Delete all installed files and replace with the backup files you should have created before installing.\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][BUGS/FIXES][/b][/u][/size][/color]\r<br />\r<br />* Some armor and clothing has clipping issues, this is a common problem with these type of mods and very little can be done by me to fix it so don&#39;t ask.\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][Q&A][/b][/u][/size][/color]\r<br />\r<br />- Here is where you can find the answers to the most commonly asked questions (this also means that if these questions are asked in the comments \r<br />section you will be directed to this page).\r<br />\r<br />Q: In the images section the character model used is not posing and its a little dark sometimes, what gives?\r<br />A: Simple, most body replacers at the Nexus show off the goods with cheesy posing and/or image editing which just isn&#39;t the norm in the game itself, this often leads to the downloader being deceived as the body models can appear completely different in-game compared to the advertising images. Thus my images are the way they are so that YOU KNOW exactly what to expect in-game while using this particular body replacer.\r<br />\r<br />Q: In the images section their are letters that don&#39;t make much sense, whats with that?\r<br />A: Then I will explain in the simplest way possible:\r<br />\r<br />mwv = maximum weight value (weight of PC was set to 99).\r<br />lwv = lowest weight value (weight of PC was set to 3).\r<br />ngf = no gloves or footwear.\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][BEST COMMENTS WALL][/b][/u][/size][/color]\r<br />\r<br />- A compilation of the best quotes of user comments.\r<br />\r<br />&#34;&#34;",
  "categoryId": "29",
  "version": "1.0",
  "author": "-KC",
  "createdUnix": "1362517755",
  "updatedUnix": "1413389785",
  "containsAdultContent": true,
  "uploadedBy": "Enix031798",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000131133",
      "name": "Natural Curvy Cleavage (CBBE body)",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "165091",
      "fileName": "Natural Curvy Cleavage (CBBE body)-32840-1-0.zip",
      "uploadedUnix": "1413389785",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/28d9c755328e34b2672cfdafd919ae43780a55bdd9b35dcd2e8fca20aeaeca2d/analysis/1413389905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Natural%20Curvy%20Cleavage%20%28CBBE%20body%29-32840-1-0.zip?fid=1000131133&ttl=1535809592&ri=8192&rs=8192&setec=9d38d659f0294ebcd9d19adcc5861291"
    }
  ]
}