{
  "modId": 32897.0,
  "modName": "The Mages Gorge",
  "summary": "Journey to your own secluded underwater gorge full of mystery and magic. With a backstory that spans 300 years and a variety of magical equipment and trinkets, the Mage\\'s Gorge is the ultimate home for your Mage character.",
  "descriptionHtml": "-CHANGELOG-\r\nV1.1 is out! Fully NavMeshed and tested multiple times. Gave all areas of The Gorge a much-needed facelift as well. Filled up the large rooms with clutter and flora and spruced up the master bedroom to feel less empty. Enjoy.\r\n\r\n\r\n*Falthir\\'s Last Words*\r\n\r\nTo whom it may concern,\r\n\r\nI grow tired of Mundus and will soon depart. I look back on my days in Cyrodiil as a young mage and what joys I had in Frostcrag Spire. It was quite a magical place and I am sad that it has fallen in disrepair since the Great War. \r\n\r\nAs soon as war erupted, I gathered all of my notes and inventions and moved into the College. It was nice for awhile and I led a peaceful life traveling to various planes of the Daedric Princes. I used to conduct my research into Aetherius and delve deep into Dwemer ruins from time to time. Those were the days. \r\n\r\nLife went on that way for many years until I was visited by a stranger. The hooded figure appeared before me claiming to be from the Psijic Order! He told me that my research had not gone unnoticed and that I would \\\"be going soon.\\\" Before vanishing into nothingness, he told me of a remote iceberg that was once home to a branch of the Order. \r\n\r\nWhen I first levitated my way to the iceberg, there was only a ruined tower and a caved in entrance. I went inside to see a vast gorge right beneath the ice and water. I remember that first sight of beauty like it was yesterday. \r\n\r\nI quickly traveled back to the mainland to assemble a crew to dig away the ice. Through a lot of gold, some dumb luck,  and a little blood, the gorge revealed itself to me. Huge mushrooms emanating a cool blue light, clear opal water, waterfalls for miles....it was breathtaking. \r\n\r\nI packed up my belongings and inventions and made the gorge my home. I spent years gathering the necessary tools and equipment to make this a befitting home for any great mage and went through a great deal of trouble to get certain items. \r\n\r\nAs I grow excited for my journey to Aetherius, I will wrap up this note with a list of some of the features of the gorge. \r\n\r\nSoularbor: When you enter the gorge, you will notice a huge tree dominates the center. This is Soularbor. I feel a strong connection to this beautiful creature seeing as part of my soul is infused in her bark and roots. That being said, she is like a child to me. Soularbor started as a sapling I was given while I was a young man adventuring in the deep forests of Valenwood. Through many years of research and trials, I infused part of my soul into the tree itself. Soularbor draws on this essence and gives life to the soil around it, literally infusing it with magic. Since its days as a sapling, a beautiful garden has appeared around its base. It is perfect for alchemy and awe. \r\n\r\nMaster Quarters: A bedroom fit for a king (literally). I managed to salvage several Dwemer artifacts and furniture sets that the old Dwarven kings once used themselves! Included in the master quarters are my museum, study, and training room along with a grand fireplace and crafting area. \r\n\r\nAetherial Wing: This is where I will have departed from, perhaps moments or even years before your arrival. Here you will find where I did the majority of my research. You will also find a few holding cells for any test subjects you wish to put. I cannot restock the cells since the subjects may die. The last point of interest in this wing is the testing room. It is a completely empty room to test all the spells and incantations you learn or create. \r\n\r\nJournals and Notes: Throughout the gorge, you will probably stumble upon my old journals and notes. Feel free to read them. You might learn a thing or two. They are all scattered around, so make sure to check everywhere. \r\n\r\nI have lived a long and happy life and I know not what wonders may lie ahead of me, but one day I will return perhaps. Until that day comes, please take care of Soularbor and the gorge. I don\\'t want either to be forgotten and lost. So, farewell my fellow mage. I travel to Aetherius and leave this letter at the entrance to the gorge in hope it has reached you in good health. \r\n\r\n-Falthir: Scholar, Mage, Adventurer, Dreamer \r\n\r\n-DESCRIPTION-\r\nUPDATE: V1.1 is out!\r\n\r\nThe Mage\\'s Gorge is a MASSIVE underwater mage stronghold hidden under a secluded iceberg just off the map a bit near the Winterhold College. The Gorge includes various mage-themed items, equipment, and trinkets:\r\n\r\n~Fully NavMeshed and playtested\r\n~Beautiful scenery\r\n-A HUGE alchemy garden surrounding a majestic tree named Soularbor\r\n~Winterhold College Decor\r\n~FULL crafting area\r\n~An epic backstory that spans 300 years\r\n~New armored robes plus a new staff\r\n~Testing Area\r\n~Training room decorated with Dwemer items\r\n~Dragon museum\r\n~Map Marker\r\n~Secluded and private location\r\n~Bathtub\r\n~Cooking Spit\r\n~Storage\r\n~Bedroom\r\n~Three fireplaces\r\n~Holding cells for test subjects\r\n~AND MORE!\r\n\r\n-CREDITS-\r\n\r\nAll CK work and lore writing done by me (jrod1311).\r\n\r\n-OTHER MODS-\r\n\r\nLeaps Of Skyrim\r\n\r\nhttp://skyrim.nexusmods.com/mods/32589\r\n\r\nMove Through Time\r\n\r\nhttp://skyrim.nexusmods.com/mods/32636\r\n\r\nThe Hole In The Wall- Thief Hideout\r\n\r\nhttp://skyrim.nexusmods.com/mods/31024\r\n\r\nHunter\\'s Abode- The Lodge\r\n\r\nhttp://skyrim.nexusmods.com/mods/35030\r\n\r\nDragonborn Hall\r\n\r\nhttp://skyrim.nexusmods.com/mods/35306",
  "categoryId": "67",
  "version": "1.1",
  "author": "jrod1311",
  "createdUnix": "1362609958",
  "updatedUnix": "1366722528",
  "containsAdultContent": false,
  "uploadedBy": "jrod1311",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000015554",
      "name": "The Mages GorgeV1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "The Mages GorgeV1-0-32897-1-0.rar",
      "uploadedUnix": "1362609362",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/71b65b1e79c618de273640396bd4eccb9c16e19a5b9505a6853bbb04c382a045/analysis/1407456373/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Mages%20GorgeV1-0-32897-1-0.rar?fid=1000015554&ttl=1535809685&ri=8192&rs=8192&setec=61525d56dc0dd2033e1f0cecade1b94f"
    },
    {
      "fileId": "1000026042",
      "name": "The Mages GorgeV1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "69",
      "fileName": "The Mages GorgeV1-1-32897-1-1.rar",
      "uploadedUnix": "1366722528",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9e0dd57157036d035d4a768be1080921b333136da89fe31e437391d7408a9188/analysis/1407536241/",
      "changelogHtml": " Gave The Gorge a much-need facelift. Added new clutter and flora to fill in the empty areas and really bring the place to life. <br/> \n NavMeshed&#33; Playtested&#33; <br/> \n Filled up the bedroom quite nicely for those who felt it was too big or empty. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Mages%20GorgeV1-1-32897-1-1.rar?fid=1000026042&ttl=1535809685&ri=8192&rs=8192&setec=09ea1b358eee3f37fb28c11343ee1dd8"
    }
  ]
}