{
  "modId": 32906.0,
  "modName": "Surrealz Followers",
  "summary": "This is a Mod for SurrealzGaming it adds 5 followers to the game.\r\n",
  "descriptionHtml": "This is a Mod for SurrealzGaming it adds 5 followers to the game.\r\nThe followers stand are all in different locations that i will not tell to make it a search for them all :P\r\n\r\n1. Eliteracen, This follower is the most weakest thing you will come across on the whole game. He has 1 Health 0 Magicka and 1 Stamina, This follower was added in for a laugh to see who will try and use him. This follower can be found at the Sleeping Giant Inn.\r\n\r\n2. Ninjacat123, This follower is a 2-Handed fighter, his default equipment is full set of steel plate with a steel battleaxe. He has average stats and base level is 20 (may be changed later to a lower level). This follower can be found in Dragonsreach main hall normally around the main entrance on the left when entering.\r\n\r\n3. Hayley, This follower is another 2 handed fighter with a full set of steel plate and a steel greatsword, This follower is a follower who is training to learn the way of the voice (may take awile to get this done but hopefully i can get it done :P), she will only be able to use 5 shouts). Her stats are all average, her default level is 1, but she should level as the player levels. She can be found at High Hrothgar in the seating hall. (room with the round table and loads chairs, not sure what they call it).\r\n\r\n4. Idajakobsson, This is a high level follower that has full dragonscale armor with Daedric bow and battleaxe. its default level is 50 but this character may be changed later on. The location of this follower ill leave you to find for now.\r\n\r\nThis mod is not made for everyone to use but if you do use it i hope you enjoy it, and any way to make the followers better please leave a comment, Thank you.",
  "categoryId": "66",
  "version": "0.01",
  "author": "LifelessMe",
  "createdUnix": "1362616739",
  "updatedUnix": "1362616535",
  "containsAdultContent": false,
  "uploadedBy": "LifelessMe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000015575",
      "name": "SurrealzFollowers",
      "version": "0.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "SurrealzFollowers-32906-0-01.rar",
      "uploadedUnix": "1362616535",
      "modVersion": "0.01",
      "virusScanUrl": "https://www.virustotal.com/file/a7da634e1a9e33d0de96423b5081a70ac0cd0b609771864cb0b84158cdeda8ea/analysis/1407456543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SurrealzFollowers-32906-0-01.rar?fid=1000015575&ttl=1535809699&ri=8192&rs=8192&setec=bb71f9d5b366da847fddea58a01b69ad"
    }
  ]
}