{
  "modId": 32903.0,
  "modName": "Wrath of the northmen ALPHA",
  "summary": "A full functioning city on an isle which you can travel to.\r\nNew npcs, quests, armor, weapons and alot more!",
  "descriptionHtml": "REQUIREMENTS\r\n\r\nNone so far\r\n\r\n\r\nDESCRIPTION\r\nThis is a work in progress mod and what im trying to achieve is to build a Nordic / viking age town.\r\nIm using the first uploaded picture as a drawing and im trying to scale the land and everything by the picture.\r\n\r\nTO DO LIST:\r\n\r\n- Custom Dungeons\r\n-  Adding LOD\r\n- Landcape with trees,plants...\r\n- Custom made buildings\r\n- Creating functioning npcs with ai package\r\n- Adding quests\r\n- Adding items weapons, armor etc...\r\n-Adding shops\r\n- Animals\r\n- Backyard\r\n- New encounters\r\n\r\n\r\n\r\nHISTORY:\r\n\r\nThe Vikings were the North Germanic explorers, warriors, merchants, and pirates who raided, traded, explored and settled in wide areas of Europe, Asia and the North Atlantic islands from the late 8th to the mid-11th century.[1]\r\nThe Vikings used their famed longships to travel as far east as Constantinople and the Volga River in Russia, and as far west as Iceland, Greenland, and Newfoundland, and as far south as Nekor.[2] This period of Viking expansion – known as the Viking Age – forms a major part of the medieval history of Scandinavia, Great Britain, Ireland and the rest of Medieval Europe.\r\n\r\n\r\nINSTALLATION\r\n\r\nAutomatic Download with NMM\r\nClick the Download with manager button on top of the file.\r\nNorthman race will appear in in NMM\\\\\\'s Mods list once it\\\\\\'s downloaded. Double-click the Northman race entry to Activate it.\r\n\r\nOR\r\n\r\nManual Download with NMM\r\nStart NMM and click on Mods.\r\nIn the left icon bar, click on Add Mod From File and select the downloaded archive file.\r\nNorthman race will now appear in the list. Double-click to Activate it.\r\n\r\nOR\r\n\r\nManual Installation\r\nLocate the Data/ folder in your Skyrim installation directory. Typically it\\\\\\'s found at Program Files/Steam/steamapps/common/skyrim/Data/.\r\nExtract the contents of the downloaded archive file to your Data/ folder.\r\nIn the Skyrim Launcher, select Data Files and enable Northman race.esp.\r\n\r\n\r\n\r\nCREDITS",
  "categoryId": "53",
  "version": "0.1",
  "author": "Danyyy",
  "createdUnix": "1362614702",
  "updatedUnix": "1362614702",
  "containsAdultContent": false,
  "uploadedBy": "danyyy",
  "primaryFile": null,
  "files": []
}