{
  "modId": 32912.0,
  "modName": "An Alchemist For Winterhold - Alchemy Store",
  "summary": "\\\"An Alchemist For Winterhold\\\" \r\n\r\n*STAND ALONE MOD - NO DLC REQUIRED. \r\n\r\nThis simple mod will install a new fully functional, lore friendly, Alchemy store, \\\"The Great Collapse\\\" in the run down city of \\\"Winterhold\\\". \r\n",
  "descriptionHtml": "On my most recent run through of Skyrim I found myself constantly irritated by the fact that in \\\"Winterhold\\\", the town surrounding the \\\"Collage Of Winterhold\\\" ( Mages Guild ), there was no Alchemy shop. Being a mage on this particular run through and spending most of my time around the collage, this was becoming more and more of a hassle. In short i created this mod for personal use, to give myself somewhere to buy ingredients and such when i am in \\\"Winterhold\\\" , but i thought some other people might enjoy it too so here it is. \r\n\r\nThe store itself is conveniently located right next to the entrance to the collage, you wont miss it. The shop is named after the destructive natural disaster that occured in \\\"Winterhold\\\" some time ago, but though time has passed, the town and townsfolk still have the scars plainly shown from this terrible occurance. Once inside you will find a Dunmer woman who will act exactly same as any other Alchemy store owner, but with a twist. \r\nOur merchant has a darker motive to opening this fine establishment, feeding her habit. This fine young wench has one serious \\\"Skooma\\\" problem, most of the day you will find her cooking up another batch of those sweet moon rocks, other than that you will find her high as a kite training her Alchemy. The bed is mostly for show with this scab scratcher, as she spends almost all of her time cooped up indulging in her favourite poison, Also you cant make gold if you are asleep!. This is a plus for all of us though, as her shop is open almost 24/7. \r\n\r\nShe is also a student at the collage, and the store itself is funded through the collage, so stealing from the merchant or her shop is stealing from the Collage of Winterhold. \r\n\r\nMy reasons for doing this are fairly simple, I thought it might add a tiny bit of depth to this very simple mod, and because Skyrim can always use more \\\"Skooma\\\" junkies. If you like the mod but want a version where the shop owner sleeps and such, and acts identical to all other shop owners, then drop a comment below saying you would prefer that, if enough people want it, I will make another version. \r\n\r\nThis mod should be compatible with all other mods as it does not change much, You might see issues if you have any mod that changes the exterior of \\\"Winterhold\\\" or the collage, as i modded on vanilla Skyrim when i made this. \r\n\r\nIf you like the mod please give it a thumbs up, comment and all that jazz. Also if you have any issue\\'s or anything drop a comment below and ill look into it for you. \r\n\r\nThats about it, Enjoy!",
  "categoryId": "94",
  "version": "1.0",
  "author": "Ache",
  "createdUnix": "1362627703",
  "updatedUnix": "1362627703",
  "containsAdultContent": false,
  "uploadedBy": "Aches",
  "primaryFile": null,
  "files": []
}