{
  "modId": 32915.0,
  "modName": "Miraak the True First Dragonborn",
  "summary": "This mod change Miraak from mediocre to deadly, modifies the weapons and equipment of Miraak to have better bonuses and values, fixes the prices of the equipment (no more 100 septims for a demigod armor) Miraak is now level 100 (no levelling with the player),WARNING: low level players (below 25) will be killed in seconds, mirak now uses more spells",
  "descriptionHtml": "***sorry for mistakes or  gramatical errors english is not my native language :)***\r<br />\r<br />This mod change Miraak from mediocre to deadly, modifies the weapons and equipment of Miraak to have better bonuses and Higher values, fixes the prices of the equipment (no more 100 septims for a demigod armor) Miraak is now level 100 (no levelling with the player), low level players (below 25) will be killed in seconds, mirak now uses more spells and 20 perks that the first dragonborn should use. Miraak also have standarized equipment in fight he uses light armor, only after you killed him the loot change to heavy or light for the mask (depend on the player favored skill)\r<br />\r<br />miraak stats\r<br />health:2000 hp (he is the freaking asassin of  dragons)\r<br />magicka:1400 (1550 for the mask bonus)\r<br />stamina:250 (not needed that much for a powerful sorcerer)\r<br /> \r<br />perks: impact,restoration alteration destruction master,bladesman3,armsman 5, fighting stance, critical charge, savage strike,agile defender 5, disintegrate, intense flames, dualcasting, recovery, mage armor, magic resistance,augmented shock 2 flames 2 and frost 1,avoid death,respite, regeneration etc.(all perks fitted for a sorcerer with good sword combat skills)\r<br />\r<br />he have now more spells he may use depend on the weak points of the player, more shouts too, like ice form (really deadly with chain lightning or storm).tested myself I asure you is deadly for 30 to 60 level players.\r<br />The weapon and equipment are nearly the same for lore friendly reasons, only with higher values for the bonuses and enchantments, the mask now have 150 magicka bonus and 20% magicka regen bonus. also miraak have better armor and an amulet. The equipment is worth money now, the sword have 35 stamina absortion. The weapons and armor/robes ARE NOT OVERPOWERED, again for lore friendly reasons.The enchant of the Miraak Staff do more damage (slightly),the tentacles stay for more time and shoots 2 proyectiles.you will have bugs with another mod that changes the miraak weapons, armor.\r<br /> \r<br />BUT why i should pick this one over the others?\r<br />well i tested the others and are good BUT NOT DEADLY LIKE IT SHOULD BE&#33;\r<br />\r<br />This is for the hardcore player that love the lore of TES games and need a really good challenge for their principal characters, a threat for tamriel itself.\r<br />\r<br />tips: when you are ready to face miraak you should carry at least 15 ultimate healing potions, lots of stamina potion,at least 15 ultimate magicka potions, good gear against fire and lightning at least 40% protection,egendary war gear and potion or enchantments that raise your damage, in the last stage he may use avoid death, always try to kill him with a power attack or your greatest spell before he uses avoid death.\r<br />\r<br />If you have sugestions im glad to read them :)\r<br />\r<br /> MY other mods\r<br /> Better armor diffeences http://skyrim.nexusmods.com/mods/19032/\r<br />Ulfgar the Berserk\r<br />\r<br />sorry for mistakes or  gramatical errors english is not my native language.",
  "categoryId": "24",
  "version": "1.00",
  "author": "mayanking",
  "createdUnix": "1362635111",
  "updatedUnix": "1362634918",
  "containsAdultContent": false,
  "uploadedBy": "mayanking",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000015646",
      "name": "MiraakFirstDragonborn",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "MiraakFirstDragonborn-32915-1-00.zip",
      "uploadedUnix": "1362634918",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/34100d1182c54d86f0cdec07690dc3f1d3650e0d8a2c565d5f444af57be68cb2/analysis/1407456843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MiraakFirstDragonborn-32915-1-00.zip?fid=1000015646&ttl=1535809714&ri=8192&rs=8192&setec=3cf826632a9b14afe8df5e91d1cfe66f"
    }
  ]
}