{
  "modId": 32924.0,
  "modName": "Update for Reapers Ebony Crossbow",
  "summary": "This is an ESP that fixes some issues with Reaper\\'s Ebony Crossbow mod. (Even though is says 0kb there is a file!)",
  "descriptionHtml": "Hello. This is my first file uploaded ever! \r\nYou still need the original textures and meshes from Reaper\\'s mod, so go and download it from here: http://skyrim.nexusmods.com/mods/22130\r\nTotal changes:\r\n-Corrected the model for the projectile. Now it is indeed the black as night ebony bolt.\r\n-Corrected the name for the projectile as you pick it up from \\\"Daedric Bolt\\\" to \\\"Ebony Bolt\\\"\r\n-Added exploding bolts of fire, shock and ice to compete with the vanilla ones. Still, these have the dwarven equivalent enhancement dealing 15 points of damage the corresponding element.\r\n-Added recipes for the aforementioned bolts, requiring the basic ingredients plus salts(Fire for Fire, Frost for Frost, Void for Shock).\r\n-Added an Enhanced version of the Crossbow with the ignore armor perk, but I need some feedback to determine whether or not it works.\r\n\r\nTo install:\r\nManually: Simply drag and drop the ESP in your data folder, AFTER you have installed Reaper\\'s Original mod, overwriting his old ESP.\r\nNMM: Install Reaper\\'s mod first, then this. When you are prompted for the overwriting of a file choose \\\"Yes to all\\\".\r\n\r\nI\\'m also open for any suggestions and tweaking of the above values. \r\n\r\nAll credits should go to Reaper9111 for his original mod.",
  "categoryId": "55",
  "version": "2",
  "author": "Reaper9111 ",
  "createdUnix": "1362659092",
  "updatedUnix": "1362658792",
  "containsAdultContent": false,
  "uploadedBy": "stelios666777888",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000015681",
      "name": "Fixed ESP",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Fixed ESP-32924-2.rar",
      "uploadedUnix": "1362658792",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/96ff058c89bee2a837889c1f660c7f1ffefe90da93c057bd13cabf31d25695ff/analysis/1407457227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fixed%20ESP-32924-2.rar?fid=1000015681&ttl=1535809730&ri=8192&rs=8192&setec=b852fa90f26a4b1d8f5abd51fde0304e"
    }
  ]
}