{
  "modId": 32937.0,
  "modName": "Better Rideable Durnehviir",
  "summary": "Durnehviir now scales his level with the player\\\\\\'s and is able to be mounted on. Optional file: Allows Paarthurnax to be mountable and makes him scale with the player\\'s level.",
  "descriptionHtml": "PLEASE ENDORSE IF THIS MOD WORKS FOR YOU! IF IT DOES NOT, JUST POST A COMMENT AND I WILL DO MY BEST TO FIX THE ISSUE!\r\n\r\nUPDATE: Now you can ride Paarthurnax too!\r\n\r\nRegarding Paarthurnax:\r\n\r\nWhen mounting him, just press \\\"esc\\\" to exit his dialogue and you should be fine.\r\n\r\nPaarthurnax will not talk while you order him to do things (such as landing and attacking or fast traveling), but he will still obey your orders to the letter. This is because he uses a unique voice in the game that has no such dialogue. I could change his voice to a normal voice of a dragon, but that would simply break the main quest altogether...  So you\\'ll have to contempt yourselves with a mute dragon.\r\n\r\nAs usual, I\\'d not advise using this shout during important scripted events in which Paar will take action. When you mount him, he will stay sometime flying around the throat of the world (forget what I said about the game labeling it as a bad place for flying), but he will normally return to perch over his dragon wall.\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nFor long I\\'ve awaited a mod to make Durnehviir rideable... it took so long that I\\\\\\'ve made it myself.\r\n\r\nFully compatible with any and all mods here on Skyrim Nexus.\r\n\r\nTo install, simply drop the \\\"Rideable Durnehviir1\\\" on your Skyrim Data folder. To uninstall, simply delete the same file.\r\n\r\nDragonborn and Dawnguard DLCs are required.\r\n\r\nWhat this mod does:\r\n- The Bend Will shout now affects Durnehviir (only the Durnehviir you summon, not the one perched on a broken dragon wall in the Soul Cairn).\r\n- He now levels with the player.\r\n- He now stays with the player for nine minutes, so that you can use him for fast traveling (in real time).\r\n- He still speaks the same dialogue when you summon him. While riding him, you can command him to attack, land, lock on targets, etc. to which he will respond with dragon voice.\r\n\r\nSome questions you might ask:\r\n- \\\"What happens if I\\\\\\'m riding him and his timer runs out (if he has stayed for long enough)?\\\"\r\nHe will gently land on any appropriate spot and the vanish. You\\\\\\'ll never have to worry about being dropped in mid air and landing to your doom at the hands of gravity.\r\n\r\n- \\\"Does this changes his AI behaviour\\\"?\r\nNo, it does not, in any way.\r\n\r\n- \\\"Will he use his own shouts?\\\"\r\nAbsolutely! He uses Drain Vitality, Frost Breath and can even summon his undead minions with his unique shout, just as he can without this mod. He will use these shouts when you\\\\\\'re riding him.\r\n\r\n- \\\"I can\\'t ride him on the Soul Cairn! What\\'s happening?\\\"\r\nThe game considers this (and some other) area to be \\\"bad for flying\\\", hence, you simply cannot ride ANY dragon while on it (not that you would find any other dragon there...)\r\n\r\n- \\\"Will this break the quest where I learn the three words of a shout by summoning Durny for the first 3 times?\\\"\r\nWell, it shouldn\\'t. I didn\\'t test it myself, but I think that as long as you don\\'t rudely shout to his face while he is kindly teaching you the words of power, you should be fine.\r\n\r\nIf you have any questions, suggestions or custom demands, just comment and I\\'ll see what I can do.",
  "categoryId": "24",
  "version": "1.0",
  "author": "MorgulCaptain",
  "createdUnix": "1362680498",
  "updatedUnix": "1370317502",
  "containsAdultContent": false,
  "uploadedBy": "MorgulCaptain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032749",
      "name": "Better Rideable Durnehviir - and Paarthurnax - Spell Absorb Fix",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Better Rideable Durnehviir - and Paarthurnax - Spell Absorb Fix-32937-1-0.rar",
      "uploadedUnix": "1370316990",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/069ffcb0bdd2c72cabc7c96c9d9646759788bd3ceef47ae707d468d17b081a06/analysis/1407591561/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Rideable%20Durnehviir%20-%20and%20Paarthurnax%20-%20Spell%20Absorb%20Fix-32937-1-0.rar?fid=1000032749&ttl=1535809748&ri=8192&rs=8192&setec=a8a2969f7502122ec94afc1757b214f0"
    },
    {
      "fileId": "1000032750",
      "name": "Better Rideable Durnehviir - Spell Absorb Fix",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Better Rideable Durnehviir - Spell Absorb Fix-32937-1-0.rar",
      "uploadedUnix": "1370317502",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/24730cc477f2af5cc462484717a4d341233b421017d4f98553bb6ce14f08a1be/analysis/1407591561/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Rideable%20Durnehviir%20-%20Spell%20Absorb%20Fix-32937-1-0.rar?fid=1000032750&ttl=1535809749&ri=8192&rs=8192&setec=85d2c0b2d8993c7294567c8e211e2ca4"
    }
  ]
}