{
  "modId": 32961.0,
  "modName": "Miraak Un-Suckified",
  "summary": "Two basic, leveled, lore friendly reworks of Miraak\\'s rewarded inventory to actually make the climax of the Dragonborn DLC worth it.",
  "descriptionHtml": "[color=red]I has a sad. You wanna know why I has a sad? Because this mod does not work. And that makes me sad. There are a number of very saddening errors made throughout the creation of this mod that all make me quite sad. I\\'m in the process of rebuilding this mod from the ground up, in a way that will definitely work and will not make me or anyone else sad. I will provide a link upon its completion. Which should be very very soon.\r\n\r\nSeriously, check back in like... and hour.[/color]\r\n\r\n[size=4][center][b]Miraak Un-Suckified[/b][/size]\r\n[i]or: Miraak my good man, your equipment does not befit your stature!\r\nor: The Hyac Miraak Item Overhaul[/i]\r\n~ By Hyacathusarullistad [Hi-ACK-a-THUSS-a-RUL-iss-Tad] ~[/center]\r\n\r\n[center][size=3][u][b]Introduction[/b][/u][/size][/center]\r\nHey all. Long time Skyrim player, first time modder. Now, I know what you\\'re thinking. Yes, I do! You\\'re thinking \\\"But Hyacathustareika... Hyac, there are [i]lots[/i] of mods out there that change Miraak\\'s equipment!\\\". You\\'re absolutely right, of course. You observant thing you. But none of the existing mods were to my taste - they were either too overpowered, lore unfriendly, or nowhere near as extensive as what I wanted. So I\\'ve braved an excursion into the creation kit and, maybe most importantly, made it out alive. And I managed to bring with me a relatively simple (by Nexus standards, anyway - though it almost killed me), lore-friendly version of what I believe Miraak\\'s equipment [i]should[/i] have been like.\r\n\r\n[b]Requires:[/b] The Dragonborn DLC, and most likely the most recent [i]stable[/i] version of Skyrim (currently 1.8.151.0.7). You should probably also only install it [i]before[/i] you\\'ve confronted Miraak, just to be sage. I meant to type safe, but it\\'d be sage as well, probably. You\\'ll also need a near-anal obsession with maintaining lore friendliness and a touch of butthurt over the vanilla Miraak equipment.\r\n\r\n\r\n\r\n[center][size=3][u][b]Unnecessarily Long-Winded Explanation[/b][/u][/size][/center]\r\nI\\'m gonna rant for a while now. Some more. Probably a lot. If you\\'d rather not read it, YOU INSENSITIVE JERK, then scroll down past the wall of text to where I summarise the changes I\\'ve made, [color=orange]highlighted in orange below[/color].\r\n\r\nI\\'m a huge immersion junky. Like, hardcore. Bordering on anal. I\\'ve uninstalled perfectly good, helpful, awesome mods simply because a quest description, line of (awesomely voiced) dialogue, or item description had a small grammatical oversight. I can\\'t use the Lock Overhaul mod because the pop-up notifications use a lowercase \\\"i\\\" where it should use \\\"I\\\". I need the More Jewelry Combinations mod not because I use jewelry a lot - in fact I rarely use it at all - but because it never made sense to me that I couldn\\'t crazy-glue a ruby onto a gold band and call it a Gold Ruby Ring. That\\'s me. That\\'s how my mind works. THESE ARE THE KINDS OF TWISTED OBSESSIONS THAT KEPT ME OUT OF THE REALLY GOOD SCHOOLS. So Miraak\\'s equipment left me incredibly angsty and unsettled once I finally defeated him.\r\n\r\nThe first thing I noticed about Miraak\\'s stuff was how underwhelming the effects of his mask were. This man has the power to slay a dragon and absorb its power with a single shout.. He\\'s spent the last two millenia trapped in the Oblivion plane that houses the collected knowledge of the entire known Universe, and his mask can be outstripped by a talented enchanter or even an alchemist with too much time and a sack of spriggan sap on his hands. No. Nu-uh. Sorry Beth (no not you, Mum!), but I\\'m not buying it. So I\\'ve  not only improved the leveling aspects of the existing enchantment, but I\\'ve added a three-level shout recovery percentage that scales at the same rate as the vanilla mask. I also added a scaled price to it, so that if (for whatever bat-crap crazy reason) you want to sell it, you\\'ll get some decent coin out of it. And while I\\'m not entirely sure why Beth did it in the first place, I\\'ve left both the light and heavy versions of the mask fully intact, with the odds of receiving either one entirely unchanged. Mostly because I didn\\'t know how to change said odds. In time I might end up making separate light and heavy versions, but for now you\\'ll get whichever one Beth\\'s adorable, nigh-untested algorithms decide to bestow upon you.\r\n\r\nThe next thing I noticed was how stupid and ugly and useless and ugly and cheap and ugly his sword was. Man. That thing is [i]ugly[/i]. We\\'re talking like... post-bleach Michael Jackson ugly. Seriously. Ugly. Sadly, a complete and utter lack of modelling knowledge forced me to leave its appearance alone. However, I\\'ve made some changes that will hopefully make it worth swinging around a Lurker penis. I kept the damage scale where it is, but taken its weight into account by increasing its swing speed. I never understood why that massive tentacle is spits out didn\\'t actually hit anything when I swung it, either, so I\\'ve risen its range by just a hair as well. Its now-scaling stamina absorption enchantment is also a little more powerful for higher levels, and I upped the number of available charges a touch. Should make up for the fact that it looks like the after effects of a Seeker\\'s colonoscopy. Can you imagine?\r\n\r\nThe robes, gloves, and boots I thought were all almost fine the way they were, but again I\\'ve added leveled versions of both that make them a little more powerful if you find them at a higher level. They\\'ll also sell for a pretty penny as well if you want to just liquidate them instead of use them. I left their enchantments alone, though, mostly because I couldn\\'t for the life of me find the partner-spell from the Robes. Otherwise I\\'d have added a small absorb rate of their own that would take effect whether you had the robes on or not. If anyone knows how the CK refers to the robes\\' spell absorption enchantment, throw me a PM or leave it in the comments section and I\\'ll update the mod (with full acknowledgement of whomsoever happens to point me in the right direction).\r\n\r\nThe staff I left alone almost entirely. Because while I\\'m not particularly fond of the spell/power it utilises, it\\'s lore friendly and decently powered just the way it is.\r\n\r\n\r\n\r\n[center][color=orange][size=3][u][b]Specific Alterations[/b][/u][/size][/center]\r\nAs promised, here are the specific changes I\\'ve made to each item without all the fancy high school edumacated explanations. Keep in mind that these are vanilla base stats. SkyRe changes some of them, and the numbers aren\\'t always as clean and round as my obsessive compulsive mind would prefer. Expect a version tweaked to play better with SkyRe values someday.\r\n\r\n[list][size=2][b][i][u]Mask, Heavy[/u][/i][/b][/size]\r\nPC Level 1-44:\r\n[*]Armor = 22pts\r\n[*]Weight = 10pts\r\n[*]Value = 2100 septims\r\n[*]Enchantments = Shout Recovery +20%, Magicka +50pts, MagReg +20%\r\n\r\nPC Level 25-59:\r\n[*]Armor = 25pts\r\n[*]Weight = 10pts\r\n[*]Value = 2600 septims\r\n[*]Enchantments =  Shout Recovery +30%, Magicka +60pts, MagReg +25%\r\n\r\nPC Level 60+:\r\n[*]Armor = 27pts\r\n[*]Weight = 10pts\r\n[*]Value = 3000 septims\r\n[*]Enchantments = Shout Recovery +40%, Magicka +70pts, MagReg +35%[/list]\r\n\r\n[list][size=2][b][i]Mask, Light[/i][/b][/size]\r\nPC Level 1-44:\r\n[*]Armor = 20pts\r\n[*]Weight = 8pts\r\n[*]Value = 1800 septims\r\n[*]Enchantments = Shout Recovery +20%, Magicka +50pts, MagReg +20%\r\n\r\nPC Level 25-59:\r\n[*]Armor = 22pts\r\n[*]Weight = 8pts\r\n[*]Value = 1900 septims\r\n[*]Enchantments = Shout Recovery +30%, Magicka +60pts, MagReg +25%\r\n\r\nPC Level 60+:\r\n[*]Armor = 25pts\r\n[*]Weight = 8pts\r\n[*]Value = 2000 septims\r\n[*]Enchantments = Shout Recovery +40%, Magicka +70pts, MagReg +35%[/list]\r\n\r\n[list][size=2][b][i]Robes[/i][/b][/size]\r\nPC Level 1-44:\r\n[*]Armor = 0pts\r\n[*]Weight = 1pts\r\n[*]Value = 3000 septims\r\n[*]Enchantments = Dragon/Spell Absorb 15%\r\n\r\nPC Level 25-59:\r\n[*]Armor = 0pts\r\n[*]Weight = 1pts\r\n[*]Value = 3100 septims\r\n[*]Enchantments = Dragon/Spell Absorb 20%\r\n\r\nPC Level 60+=\r\n[*]Armor = 0pts\r\n[*]Weight = 1pts\r\n[*]Value = 3200 septims\r\n[*]Enchantments = Dragon/Spell Absorb 25%[/list]\r\n\r\n[list][size=2][b][i]Gloves[/i][/b][/size]\r\nPC Level 1-44:\r\n[*]Armor = 7pts\r\n[*]Weight = 1.5pts\r\n[*]Value = 900 septims\r\n[*]Enchantments = AbsorbDragonBoost 5%\r\n\r\nPC Level 25-59:\r\n[*]Armor = 9pts\r\n[*]Weight = 1.5pts\r\n[*]Value = 1100 septims\r\n[*]Enchantments = AbsorbDragonBoost 10%\r\n\r\nPC Level 60+=\r\n[*]Armor = 11pts\r\n[*]Weight 1.5pts\r\n[*]Value = 1400 septims\r\n[*]Enchantments = AbsorbDragonBoost 15%[/list]\r\n\r\n[list][size=2][b][i]Boots[/i][/b][/size]\r\nPC Level 1-44:\r\n[*]Armor = 7pts, \r\n[*]Weight = 2pts\r\n[*]Value = 900 septims\r\n[*]Enchantments =\tAbsorbDragonBoost 5%\r\n\r\nPC Level 25-59:\r\n[*]Armor = 9pts\r\n[*]Weight = 2pts\r\n[*]Value = 1100 septims\r\n[*]Enchantments =AbsorbDragonBoost 10%\r\n\r\nPC Level 60+:\r\n[*]Armor = 11 pts\r\n[*]Weight = 2pts\r\n[*]Value = 1400 septims\r\n[*]Enchantments = AbsorbDragonBoost 15%[/list]\r\n\r\n[list][size=2][b][i]Sword[/i][/b][/size]\r\nPC Level 1-44:\r\n[*]Armor = 12pts\r\n[*]Weight = 3pts\r\n[*]Speed = 1.10\r\n[*]Reach = 1.10\r\n[*]Value = 1400 septims\r\n[*]Enchantments = Absorb Stamina, 15pts\r\n\r\nPC Level 25-59:\r\n[*]Armor = 14pts\r\n[*]Weight = 3pts\r\n[*]Speed = 1.10\r\n[*]Reach = 1.10\r\n[*]Value = 1500 septims\r\n[*]Enchantments = Absorb Stamina, 25pts\r\n\r\nPC Level 60+:\r\n[*]Armor = 16pts\r\n[*]Weight = 3pts\r\n[*]Speed = 1.10\r\n[*]Reach = 1.10\r\n[*]Value = 1650 septims\r\n[*]Enchantments = Absorb Stamina, 35pts[/list][/color]\r\n\r\n\r\n[center][size=3][u][b]Future Development[/b][/u][/size][/center]\r\nSkyrim is a hobby. Modding Skyrim is like... a subhobby. One that I\\'m not very good at when it comes to idea execution. I\\'d love to spend more time both playing and modding, but both my boss and my [s]home boss[/s] wife make me do other stuff to, and sometimes [size=1](rarely)[/size] that stuff is pretty important. So it may take me a while to implement some of these ideas, especially the ones I don\\'t have a clue how to do yet.\r\n\r\n[list][*]First, I plan on removing the \\\"zOMG WILL I GET LIGHT OR HEAVY MASK THIS TIME??!1?\\\" problem. Because it\\'s annoying. I know how I plan to do that, I just didn\\'t feel like getting it done right this second. I\\'ll create three versions of the mask - one for each heavy, light, and clothing - so that everyone can get what they want.\r\n[s][*]Following the same idea as the last point, I expect to do multiple distinct versions of the rest of the equipment as well. Whether or not this will include a heavy version of the robes, boots, and gloves depends on my modelling and/or texturing experience, which at the moment is minimal. But for sure I\\'ll soon release a cloth and light armour version for the entire ensemble (look at me I use French in every day conversation like a fancy man).[/s]\r\n[*]Also, I expect I\\'ll get sick of the strange and uneven numbers that SkyRe introduces to the new levelled versions. I\\'ll probably end up creating a SkyRe \\\"patch\\\", so to speak - it works fine with SkyRe now, the patch will just round off the numbers to something that won\\'t send us OCD maniacs turning doorknobs or flicking lightswitches to avoid our computers exploding or something. This is one of those ideas that will take a loooong time, as I try to make myself more familiar with the intricacies of SkyRe\\'s behaviour.\r\n[*]One day, maybe, if I\\'m very very lucky, I\\'ll work out how to create a scripted installer that will let me keep one file for download but still give users as much flexibility and options as possible. If anyone can points me towards a decent tutorial (possibly with video instructions) for doing that, I\\'d love them for like... a year, at least. Maybe even longer.\r\n[*]Wouldn\\'t it be cool if you could craft Miraak\\'s stuff? If you agree, then you\\'re in luck! But it\\'s bad luck because you\\'re wrong. I won\\'t be doing that.\r\n[*]As soon as I figure out how to add the sure-thing Dragon/Spell Absorb spell to an item alongside the boost-only version, you\\'ll find a small sure-fire absorb rate on the gloves for sure. And possibly the boots. This is anotherone that might take a good while for me to hammer out, so bear with me.\r\n[*]Once I\\'m content with where the equipment overhaul stands, I\\'ll move on to reworking how Miraak himself behaves in combat, as well as his abilities, strength, and general suckiness. I know there are a lot of other mods out there for that, but SHUDDUP. I\\'m doing it anyway, because they\\'re not what I want. I\\'ll make the Miraak character changes their own modular download file, so those who don\\'t want my changes can have their own way too.\r\n[/list]",
  "categoryId": "27",
  "version": "1.SAD",
  "author": "Hyacathusarullistad",
  "createdUnix": "1362713027",
  "updatedUnix": "1362875170",
  "containsAdultContent": false,
  "uploadedBy": "Hyacathusarullistad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000015848",
      "name": "HyacMiraakItemOverhaul",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "HyacMiraakItemOverhaul-32961-1-0.rar",
      "uploadedUnix": "1362712528",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/80652905d0838019fb6f29eb5f69ec990511a3880fd6b862846c330043202289/analysis/1407458224/",
      "changelogHtml": " Sacrificed nearly six hours to the Creation Kit Gods. While crying.  <br/> \n Cried some more. <br/> \n Finally defeated Miraak, and got his equipment. <br/> \n Had to disable six separate Dragonborn-unfriendly mods to complete the final battle. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HyacMiraakItemOverhaul-32961-1-0.rar?fid=1000015848&ttl=1535809779&ri=8192&rs=8192&setec=0bb72c001506fd1fe25d833f020eead1"
    },
    {
      "fileId": "1000016345",
      "name": "HyacMiraakItemOverhaul 1-1 Fix",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "HyacMiraakItemOverhaul 1-1 Fix-32961-1-1.rar",
      "uploadedUnix": "1362875037",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6109ebde79aa026f7c37e808f97240744beb8703c8ac991eac3f53346894f065/analysis/1407461964/",
      "changelogHtml": " Fixed some rather n00bish errors in enchantment magnitude levels. <br/> \n All three levels of both the gloves and the boots were using the same enchantment. It was meant to be a leveled enchantment. WELL CRAP. Fixed it now though. <br/> \n Tidied up some crappy tweaks that didn&#39;t make as much sense as I thought they would. We all make mistakes, get over it. <br/> \n NEW VERSION: I&#39;ve added a light armour variant of Miraak&#39;s entire equipment pool, including a guaranteed light armour mask. Cool, eh? SHUT UP, YES IT IS. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HyacMiraakItemOverhaul%201-1%20Fix-32961-1-1.rar?fid=1000016345&ttl=1535809780&ri=8192&rs=8192&setec=531e135b329034cd9798cc0f8d0d095f"
    },
    {
      "fileId": "1000016346",
      "name": "HyacMiraakLiteArm",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2440",
      "fileName": "HyacMiraakLiteArm-32961-1-1.rar",
      "uploadedUnix": "1362875170",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7a5aec3b7e969c30bd1ebc3768567b1030d9fcd7b9d380891ba811ab2316f36f/analysis/1407461966/",
      "changelogHtml": " Fixed some rather n00bish errors in enchantment magnitude levels. <br/> \n All three levels of both the gloves and the boots were using the same enchantment. It was meant to be a leveled enchantment. WELL CRAP. Fixed it now though. <br/> \n Tidied up some crappy tweaks that didn&#39;t make as much sense as I thought they would. We all make mistakes, get over it. <br/> \n NEW VERSION: I&#39;ve added a light armour variant of Miraak&#39;s entire equipment pool, including a guaranteed light armour mask. Cool, eh? SHUT UP, YES IT IS. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HyacMiraakLiteArm-32961-1-1.rar?fid=1000016346&ttl=1535809780&ri=8192&rs=8192&setec=0041850eb62d5c9048d95ae5e170826e"
    }
  ]
}