{
  "modId": 32972.0,
  "modName": "More Alien Skyrim Sky and Light - SweetFX - Lighting Galaxy Nebula Sun Sunglare and Star - Now using Climates of Tamriel Sun",
  "summary": "More Alien Skyrim is total sky overhaul and a SweetFX preset design to make skyrim totally alien, and totally beautiful. It is designed for use with Climates of Tamriel, and now contains an edited version of the CoT sunsprite designed by me especially for this mod.",
  "descriptionHtml": "[center][color=#00cc00][size=6]MAS - More Alien Skyrim - Sky[/size]\r\nUPDATE!!! November 24th - Add MAS Darker Sky patch, if you having problems with overly bright galaxy textures, this might help! Keep in mind, some objects are intended to be quite bright (like the supernova) but should NOT be blinding!\r\n\r\nALSO; For those who want to cut back on ESPs, you can delete the ESP from this mod, and all it will change is the moon sizes and when the moons appear in the sky, it will not dramatically effect this visual appearance of the sky itself in any way! ^_^ \r\n\r\nUPDATE; Download version 1.5! Totally redoes every single texture included with this mod to be higher def and look better, also has an improved SweetFX settings! Also has a totally redesigned Galaxy texture with some highly requested add-ons! \r\nNow designed for use with Climates of Tamriel! It was always compatible, but now it is designed for use with it! Just make sure all 'sun' related .dds files are successfully replaced by this mods! This is of coarse done with direct permission from the author of CoT! I HIGHLY suggest using these two mods together! The result is really stunning! If you use any of the darker night settings for CoT the night will become very dark with my sweetfx setting, because dark nights make the night sky really ''pop' \r\n\r\nThe new Galaxy texture is a collage made by me of random free images from NASA and images taken from galaxy texture resources on The Nexus which I obtained permission to use!\r\n\r\nIs this mod a little to much for you, or would you just like a more refined taste, dramatic SweetFX preset? Download my other mod [url=http://skyrim.nexusmods.com/mods/39925/]Alienvision[/url]! Simply install it after this one (saying yes to overwrite all files) and you are good to go! \r\n\r\n----------------------------------------------------------------------------------------------------------------\r\n\r\nI'll cut to the chase quickly. Some mod authors will ramble for 45 minutes before telling you what a mod does. I will lay it out clearly in black and white for you... err, grey and green.\r\n\r\nFirst, and foremost, this is a sky overhaul. This adds a high def starfield with visible distance galaxies, a BEAUTIFUL high def galaxy, completely separate rigged nebula that cover the entire sky, giving an effect unlike any mod that just edits the stars and galaxies. This combines, for a STUNNING night sky that is simply awing to look at.\r\n\r\nSecondly, this is a moon replacer, or more, overhauler. Instead of just two bland, boring moons, there are now [u]14 moons[/u] which will circulate about randomly! These are all very visually striking, and unique, special moons! You will never see two of the same moon, nor will you see simple recolors of saturn and earth! All moons are totally alien, and stunning! \r\n\r\nThirdly, and perhaps, most importantly, this mod now uses SweetFX!! I originally intended an ENB, but this is far simpler, and much better in my opinion. Sense this mod can look wonky with most ENBs installed, I decided to forgo them altogether, and included it's own SweetFX! This make the entire game stunning, not just the sky, but it is balanced around the sky to keep it stunning and vibrant!\r\n\r\nLastly, I threw in an interesting sun replacer that fits the theme of this mod very well! It doesn't add much, but it's a very pretty sun, and not overly bright, or overly bland.\r\n\r\nDON'T FORGET TO CHECK OUT THE CREDITS! A lot of hard work from a LOT of people have gone into this mod (mostly indirectly) I greatly appreciate there hard work, and over 40 hours of my life have been suck into this mod as well! I really hope you enjoy it! ^_^\r\n\r\n----------------------------------------------------------------------------------------------------------------\r\n\r\n[size=8]NOTICE!!![/size] \r\nThis mod only adds textures and a single mesh to the game, it adds no scripts, and the esp only resizes the moods, and thus, THIS MOD CAN NOT CAUSE A CRASH; \r\n\r\nIf you experience a crash with this mod, it is MEMORY RELATED, which means uninstalling and talking bad about my mod won't fix your game permanently. What will fix your game will also let you continue to use this mod. \r\n\r\n[b][u]WHAT TO DO IF YOU GET A CTD FROM MEMORY OVERLOAD TO THIS MOD!!![/b][/u]\r\n1) Download ENBoost from the nexus\r\nhttp://skyrim.nexusmods.com/mods/38649//?\r\n2) Change the d3d9.dll included with [u]this[/u] mod to SweetFX_d3d9.dll. Do NOT change the name of the dll included with ENBoost!!!\r\n3)Then open the enblocal.ini included with ENBoost and change the Proxy section so that it looks like this.\r\n\r\n[PROXY]\r\nEnableProxyLibrary=true\r\nInitProxyFunctions=true\r\nProxyLibrary=SweetFX_d3d9.dll\r\n\r\nNow, these two programs should work perfectly fine together, and you should no longer have memory related CTDs, thus you can use more high res texture mods like this one! ^_^\r\n\r\n\r\n[size=6]Intro[/size]\r\n\r\nThis mod was made with one intention, and one intention only - To make exploring Skyrim a visually exhilarating experience. I eventually intend to release animal texture replacers, armor texture replacers, and even a plant replacer! But for now, I have created MAS SKY - A total sky and lighting overhaul! A MAJOR update from the Demo version I had up until now! It's basically not even the same mod, and because of this, you will have to totally uninstall the old version first!\r\n\r\nThe previous version of this mod was based on making skyrim look as if it was an alien moon, orbiting some giant planet. The new version actually digs more into the TES world, and throws all former remnants of logical astronomy out the window(kinda like vanilla skyrim); But not in a bad way. You see, Nirn isn't like the Earth at all. It isn't even orbiting a star, but rather floats aimlessly in a void near a giant hole that was ripped in said void by magnus some time ago. This giant hole, is the sun, and all the other stars are tiny holes; THAT is legit TES lore. I take that a step father, and say, there are tons of OTHER planets floating aimlessly around this void. The result?\r\n\r\nMasser shuffles between 7 large, gas-like planets, pretty to look at, but not much going on with them. Secunda shuffles between 7 rocky or watery planets, some of them can be very interesting to look at. NONE of them should be remotely recognizable! (no saturn, no earth, etc) \r\n\r\nOther updates?\r\n\r\nI took the large blue ring planet out, because the way it's moonshadow worked created lots of glitches with the new system this mod is set up under. I would have been forced to disable secunda, and I want MORE moons in the sky, not less, so I voted to take it out, and replace it with shuffling planets instead! \r\n\r\nI added a SweetFX lighting mod to this, which is designed to make the world look similar to normal, yet very vibrant and wowing, without overdoing it on the bloom or saturation!\r\n\r\n\r\n----------------------------------------------------------------------------------------------------------------\r\n\r\n\r\n[size=6]Installation[/size]\r\n\r\nExtract the contents of the ZIP file to a separate folder if you aren't sure how much of this mod you want to install, or if you are new to manually installing mods.\r\n\r\n------\r\n\r\nIf you want to install the entire mod;\r\n\r\nMake sure you are not using any ENBs! This mod is intended to work like an ENB, and thus will likely go horribly wrong when combined with one.\r\n\r\nMerge the \"Skyrim\" Folder with your \"Skyrim\" folder. Make SURE you say \"YES\" if it asks you to overwrite anything!\r\n\r\nActivate the More Alien Skyrim.esp. Load order position shouldn't matter, but to be safe, put AFTER anything that edits the sky or lighting!\r\n\r\n------\r\n\r\nIf you want just the mod itself WITHOUT the SweetFX;\r\n\r\nEnter the \"Skyrim\" folder, ignoring EVERYTHING accept the \"data\" folder. Merge just that \"Data\" folder with your \"Data\" folder, and make SURE to say yes if anything asks to overwrite!\r\n\r\nActivate the More Alien Skyrim.esp. Load order position shouldn't matter, but to be safe, put AFTER anything that edits the sky or lighting!\r\n\r\n------\r\n\r\nIf you want just the SweetFX preset;\r\n\r\nMAKE SURE you do not have an ENB installed or this will likely blow up!!\r\n\r\nEnter the \"Skyrim\" folder, and DELETE the \"Data\" folder. Back out to the main folder, and merge the \"Skyrim\" folder with your \"Skyrim\" folder, making sure to say yes if anything asks to overwrite!\r\n\r\nThat's it! No ESP to activate! You may need to adjust the brightness, as this is intended to be played 1/4 to 1/2 of the way up the slider.\r\n\r\n------\r\n\r\nIf you do not want the moon shuffle;\r\n\r\nEither pick two moons from the 14 you can download with this mod and rename them appropriately to replace masser and secunda respectively.\r\n\r\nOr delete all \"masser' and 'secunda' files and use the vanilla moons, or simply install a new moon replacer OVER this mod! Note- use of this mod with other moons might result in odd unforeseen visual glitches. \r\n\r\nIt is not my job to make your mod setup work together, if you want to use this with other moons besides the given ones go right ahead, but it's not my problem if your sky melts and dagoth-ur comes parachuting out of it and steals all your sweet rolls.\r\n\r\n------\r\n\r\nUninstalling MAS Demo; \r\n\r\nDelete the MAS Sky Demo esp, then go to your textures/sky folder and delete every file with 'masser' or 'secunda' in it's name, moonshadow.dds skyrimgalaxy.dds  skystars.dds and sun.dds and sunglare.dds if you downloaded the optional sun file. \r\n\r\nInstalling the newer version of this mod will automatically overwrite all of these files EXCEPT Moonshadow.dds! Make sure to delete that file if you are updating, as it will create glitches with your moons!! \r\n\r\nIf you want to uninstall the full version of this mod, follow the exact same instructions, but do not delete moonshadow.dds. Also, delete the 'itn' folder in your textures/sky folder, as well as well stars.nif in your Meshes/Sky folder.\r\n\r\n If you want to delete the SweetFX go to your Skyrim main install folder delete the entire SweetFX folder, d3d9.dll, d3d9.fx, dxgi.ddl, dgxi.fx, injector.ini, shader.fx, SweetFX_readme.txt, SweetFX_preset.txt, and SweetFX_settings.txt\r\n\r\n\r\n----------------------------------------------------------------------------------------------------------------\r\n\r\n[size=6]Troubleshooting[/size]\r\n\r\nMy moons are solid black! - This is a vanilla moon problem, Skyrim displays the 'new moon' phase as a blank, solid black disc that can not be edited, and have yet to discover a way around this. This issue should only persist until the moon(s) ends it's phase at the end of the night. Do not contact me about this glitch.\r\n\r\nSecunda is in front of Masser and it's semi-transparent! - I have no idea why this happens, but apparently they decided to make the moons auto-fade into one another if they overlap into the sky. I have not found a work around for this glitch. Do not contact me about this glitch.\r\n\r\nEverything is to bright/dark! - First are you using an ENB? Use of this mod with an ENB is not supported, and it's likely causing the issue. If not, try moving the 'brightness' slider in your display settings. If the issue persists, post and make sure to let me know what other lighting mods you are using!\r\n\r\nThe moon is in front of my sun and the sun is shining through the moon! - I am pretty sure I fixed this glitch by making the moon avoid the sun, but if you still experience it, please let me know! Also, make not of what day/month/time it was!\r\n\r\nSomething not described here is horribly wrong with my sky! - Take a screenshot, make not of the time of day, day of the week, and month of the year it was, as well as any mods you have that could be causing it! MAS DOES NOT SUPPORT ENBS AS THEY WILL CAUSE SEVERE ISSUES WITH THE SKY MOST OF THE TIME.\r\n\r\nHELP! My ENB does not work with, or is destroyed by this mod! - This mod MAY work with SOME ENBs if you know how to tweak them right, but your completely on your on, because for the most part this mod is designed to REPLACE an ENB and use of it with one is NOT supported in any way!\r\n\r\n\r\n----------------------------------------------------------------------------------------------------------------\r\n\r\n\r\n[size=6]Suggested Mods[/size]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/33017]Tropical Skyrim[/url] \r\n\r\n[url=http://skyrim.nexusmods.com/mods/17802/]Climates of Tamriel[/url]\r\n\r\n\r\n----------------------------------------------------------------------------------------------------------------\r\n\r\n\r\n[size=6]Credits[/size]\r\n\r\nA lot of work from a lot of people went into this mod! All content in this mod is used by ArtMurder with direct permission from the makers, \r\nor with indirect permission through their Asset Use Permissions on The Nexus Mods website.\r\n\r\n---------\r\n\r\nArt Murder - SweatFX Preset; Sticking this entire thing together with duct tape and bubble gum.\r\n\r\nHXP - Galaxy and star Textures\r\n \r\nKriskos - Nebula\r\n\r\nAnOldFriend - Sunglare\r\n\r\nUses SMAA. Copyright (C) 2011 by Jorge Jimenez, Jose I. Echevarria,\r\n\r\nBelen Masia, Fernando Navarro and Diego Gutierrez.\r\n\r\nUses InjectSMAA by Andrej Dudenhefner ( mrhaandi )\r\n\r\nUses shaders from FXAATool by Violator, [some dude], fpedace, BeetleatWar1977 and [DKT70]\r\n\r\nDPX shader by Loadus\r\n\r\nLift Gamma Gain shader by 3an and CeeJay.dk\r\n\r\nSweetFX, LumaSharpen, Dither, Curves, Vibrance and Splitscreen by Christian Cann Schuldt Jensen ( CeeJay.dk )\r\n\r\nPaint.net + Various Plug-Ins, I.e Shape 3d.\r\n\r\nVarious texture libraries (licence free.)\r\n\r\nVarious DeviantART Planet resource textures.\r\n\r\nhttp://www.spacetelescope.org/ - Public free to use pictures of wonderful things in space.\r\n\r\nThe Hubble Telescope\r\n\r\nAdobe Photoshop CS6(+CS2).\r\n\r\nNexusmods.com\r\n\r\nBethesda\r\n\r\n\r\nIf I have missed you, or you wish for me to no longer use something of yours in this mod, despite the permission given, PLEASE CONTACT ME(ArtMurder) ON THE NEXUS FORUMS!\r\n[/center][/color]",
  "categoryId": "74",
  "version": "1.55",
  "author": "Art Murder",
  "createdUnix": "1362741520",
  "updatedUnix": "1385853801",
  "containsAdultContent": false,
  "uploadedBy": "ArtMurder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039217",
      "name": "More Alien Skyrim Sky - Full Version OUTDATED",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10271",
      "fileName": "More Alien Skyrim Sky - Full Version BETA-32972-0-9.7z",
      "uploadedUnix": "1373980463",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/1447e0aa6cdb12e1dd72b408b9297b6ae5c8d1c07096ee45c95a10a1860c0773/analysis/1407646220/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Alien%20Skyrim%20Sky%20-%20Full%20Version%20BETA-32972-0-9.7z?fid=1000039217&ttl=1535809794&ri=8192&rs=8192&setec=909a518f3629952c0f61d2e5c73c3eeb"
    },
    {
      "fileId": "1000077461",
      "name": "More Alien Skyrim COT Fix",
      "version": "1.52",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "More Alien Skyrim COT Fix-32972-1-52.7z",
      "uploadedUnix": "1384113864",
      "modVersion": "1.52",
      "virusScanUrl": "https://www.virustotal.com/file/e9aa05a84fec7b359fb779d12443ce08e111a69aea104a64b784d9297916af77/analysis/1407787711/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Alien%20Skyrim%20COT%20Fix-32972-1-52.7z?fid=1000077461&ttl=1535809795&ri=8192&rs=8192&setec=ab9a32c8a08fbeefc47e618b92293f87"
    },
    {
      "fileId": "1000082920",
      "name": "More Alien Skyrim Darker Galaxy Texture",
      "version": "1.52",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2029",
      "fileName": "More Alien Skyrim Darker Galaxy Texture-32972-1-52.7z",
      "uploadedUnix": "1385389075",
      "modVersion": "1.52",
      "virusScanUrl": "https://www.virustotal.com/file/51cba2ab53b71bd8389ba2aba1cbf4bdfd0ef1514ebaab1f9e8c53f5cb722a17/analysis/1407807871/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Alien%20Skyrim%20Darker%20Galaxy%20Texture-32972-1-52.7z?fid=1000082920&ttl=1535809795&ri=8192&rs=8192&setec=5e77223501517c54573a47a70a148897"
    },
    {
      "fileId": "1000084706",
      "name": "More Alien Skyrim - Sky",
      "version": "1.55",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7410",
      "fileName": "More Alien Skyrim - Sky-32972-1-55.7z",
      "uploadedUnix": "1385853483",
      "modVersion": "1.55",
      "virusScanUrl": "https://www.virustotal.com/file/a9dc9e229d30329d688ac6832d14cc4c5d88a7105389f3da551390f4721505b8/analysis/1407815297/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Alien%20Skyrim%20-%20Sky-32972-1-55.7z?fid=1000084706&ttl=1535809795&ri=8192&rs=8192&setec=2246d9ff2953d4601bcb94f9ab30189c"
    },
    {
      "fileId": "1000084708",
      "name": "More Alien Skyrim - Light",
      "version": "1.55",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "826",
      "fileName": "More Alien Skyrim - Light-32972-1-55.7z",
      "uploadedUnix": "1385853700",
      "modVersion": "1.55",
      "virusScanUrl": "https://www.virustotal.com/file/47ab6ee00ecd5e40674856153119ecc0b6bd5416022a68a6d366aa454ee6e4fd/analysis/1407815303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Alien%20Skyrim%20-%20Light-32972-1-55.7z?fid=1000084708&ttl=1535809796&ri=8192&rs=8192&setec=a25cf77dc85add447c9afa183428cb64"
    },
    {
      "fileId": "1000084712",
      "name": "More Alien Skyrim PLANETS ONLY",
      "version": "1.55",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2851",
      "fileName": "More Alien Skyrim PLANETS ONLY-32972-1-55.7z",
      "uploadedUnix": "1385853801",
      "modVersion": "1.55",
      "virusScanUrl": "https://www.virustotal.com/file/220de8656c245ea444a76d74dd64c1666416e93b20f60409b91bc0b21593a4cc/analysis/1407815306/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Alien%20Skyrim%20PLANETS%20ONLY-32972-1-55.7z?fid=1000084712&ttl=1535809796&ri=8192&rs=8192&setec=79958b4be1263cd29194084390bc4765"
    }
  ]
}