{
  "modId": 32989.0,
  "modName": "Player Beds at Bards College",
  "summary": "A small mod that changes ownership of the beds so that once you are a member of the bards college, you will be able to sleep on any of the student beds in the basement.  ",
  "descriptionHtml": "A small mod I did for myself that changes ownership of the beds so that once you are a member of the bards college, you will be able to sleep on any of the student beds in the basement.  Frankly, I found becoming a member of the college and not being able to stay in the basement \\\"dorm\\\" really ruined immersion for me, and contributed to leaving the whole Bards College feel like a guild that could have been promising but was left very far from being finished.  \r\n\r\nThis mod does not add any beds, it just changes the ownership qualities of them.  Adding beds would require either restructuring the Bards College basement or cramming the existing beds and their dividers so close together that it felt like a three-sided jail cell (when viewed in game).  I wanted the mod to be as simple and true to the original game as possible, for those who don\\'t want much changed, so I opted to leave the number of beds the same.  \r\n\r\nThe master files for this mod are Skyrim.esm and Update.esm.  No additional DLCs or anything like that required.  ",
  "categoryId": "78",
  "version": "",
  "author": "EnlilofNippur",
  "createdUnix": "1362776413",
  "updatedUnix": "1362776386",
  "containsAdultContent": false,
  "uploadedBy": "EnlilofNippur",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000015994",
      "name": "BardsCollegeBed",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "BardsCollegeBed-32989-.rar",
      "uploadedUnix": "1362776386",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b8ade198e700c3809353a7a27e58ad30c192e9df0f50b2cfe0767e945a7c45b6/analysis/1407459244/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BardsCollegeBed-32989-.rar?fid=1000015994&ttl=1535809824&ri=8192&rs=8192&setec=bfe558aebd21a2b7475e13890a8c2aae"
    }
  ]
}