{
  "modId": 32988.0,
  "modName": "Historical Revival - The Roman Era",
  "summary": "Roman classical antiquity &#34;conversion&#34;, with Roman, Celtic and Parthian presence",
  "descriptionHtml": "[center] \r<br />[img] https://lh4.googleusercontent.com/-7LHS99n0IWQ/UatXmP_e2sI/AAAAAAAAAjY/sStjDCFYb5c/w925-h425-no/Untitled-1.png [/img] [/center]\r<br />[center]\r<br />\r<br />\r<br />\r<br />[size=4]IF THIS MOD IS TOO BUGGY FOR YOU PLEASE TRY [url=http://www.nexusmods.com/skyrim/mods/10740/]http://www.nexusmods.com/skyrim/mods/10740/[/url] That mod contains just the Roman stuff and is reported as being more stable.[/size][/center]\r<br />[center]I AM NO LONGER WORKING ON THIS MOD BUT I AM LOOKING FOR MODDERS TO TAKE OVER IT. PLEASE SEND ME A MESSAGE IF YOU ARE INTERESTED.[/center][center][/center]\r<br />\r<br />\r<br />\r<br />[b]QUICKSTART INFORMATION[/b] (for those who do not read the readme):\r<br />\r<br />* How to install? Same as other simple mods - download and unpack the contents of the &#34;data&#34; folder into your game&#39;s data folder. No other mods required, HOWEVER, some mods listed below are highly recommended for complete experience.\r<br />* This mod consists of 7 independent mods and you can disable the ones you don&#39;t want.\r<br />* I cannot make special versions of the mod or items on request (unless you help making it) but I do welcome suggestions. \r<br />* if you find a bug, please make sure it is not caused by incompatibility with another mod you are running and kindly make sure to go through the rest of the troubleshooting guide below before reporting the bug.\r<br />* Screenshots don&#39;t show everything\r<br />* Will this mod get better in the future? Yes, in fact, it&#39;s been in slow imporvement since early 2012, when I only had one armor set, but I cannot say by how much or when it will improve. I try to update every couple of weeks. The mod&#39;s development might stop around the time of Rome 2 Total War&#39;s release.\r<br />\r<br />\r<br />Here&#39;s a video made by Tomzy (ZyTom) with the use of the mod. \r<br />\r<br />[center][youtube]YtvFIHiMmI4[/youtube][/center]\r<br />\r<br />[img] https://lh3.googleusercontent.com/-IbsVvrI8ED8/UWgWUQY-bGI/AAAAAAAAAeY/xU2s_gn1HsY/s605/announcements.jpg [/img]\r<br />\r<br />\r<br />[b]9 September 2013[/b]\r<br />I started working on the female clothing but it is very slow going still because I&#39;m busy with other stuff\r<br />In other news, Rome 2 Total War came out&#33; And it is kind of disappointing, especially because I believe that covered in all that cr*p there hides a good TW game. I hope they dig it out.\r<br />\r<br />[img] https://lh6.googleusercontent.com/-yopC-U14cJA/UWgWVCNI2FI/AAAAAAAAAes/x67ihgx9K2o/s605/contents.jpg [/img]\r<br />\r<br />I decided to put my historical armor and weapons mods into one. However, I have kept the modular structure and the names of the older mods so that you can pick the parts you want and so that you don’t have to worry if you are upgrading from the previous mod. I have also kept all the bugs, whohoo&#33;\r<br />  \r<br />This mod has become mostly about putting the Roman era stuff into Skyrim - mostly armor and weapons but not only. The mod approximately covers a period from the classical antiquity between 100 BC and 200+ AD, but some objects may be based on later or earlier examples. \r<br />\r<br />You could say there are several factions I concentrate on in my mod. Here is a list of the factions and the mod contents relating to them. Screenshots show a lot of this stuff, but not all&#33;:\r<br />\r<br />=============================\r<br />The Romans\r<br />=============================\r<br />\r<br />Grown from a small village into a Mediterranean empire, the Romans in this mod consist of the well-established Imperial forces, with the army well organized and the armor provided to each soldier by the state. The main Roman infantry wears the lorica segmentata set, while the archers and auxiliaries (non-Romans) wear chainmail. Their swords are good for what they are used, but inferior to those used by their Northern neighbors. \r<br />\r<br />The Romans replace the Imperials in the replacer version of the mod.\r<br />\r<br />The following items are included for the Romans:\r<br />- 2 types of gladius or spanish sword; \r<br />- 2 types of Spatha or longsword/cavalry sword\r<br />- 2 daggers - one Roman (pugio) and one Celto-Roman\r<br />- a deco &#34;fake&#34; version of the pugio dagger to be worn on the right side.\r<br />- 3 types of shields - light (parma) medium light (cetratus) and one heavy (scutum). The cetratus shield comes in red and blue. \r<br />The Scutum comes in two versions. &#39;V2&#34; is the one with the standard Skyrim handle that looks better when used by player in 1st person view.\r<br />- lorica laminata/segmentata set - a heavy segmented armor set, including several types of helmets (galea), two types of boots, separate left and right arm protection (manica)\r<br />- lorica hamata set - a light chainmail armor set\r<br />- lorica musculata set - a heavy armor officer&#39;s set \r<br />- Arcani armor set - a light armor spy outfit\r<br />- Centurion armor set - a light armor set\r<br />- a cape to serve as a sort of sagum for now (three types, one for light armor, one for heavy armor and one for Arcani)\r<br />- 2 legionary rings (jewelry)\r<br />- 3 types of javelins - they are currently quite overpowered, just the way I like it.\r<br />- a Roman standard that summons a couple of imperial ghosts from the legion\r<br />- The gold Septim has been changed to a Roman style coin\r<br />\r<br />- Extra retextured items by JedJTL and SPQRLegate can be downloaded as the optional file.\r<br />- Andouce created a number of esp versions for better compatability with SkyRe, Immersive Patrols and Battles and Wet & Cold. They can be found in the optional files. To be used INSTEAD of the REPLACER version of my mod.\r<br />\r<br />=============================\r<br />The Celts and the Germanic tribes\r<br />=============================\r<br />\r<br />To the North of Rome are the Celts. These people are fierce and have superior steel, but are lightly armored if armored at all. Unlike imperial Romans, Celtic men had to provide for their own armor so the personal financial situation was a factor.\r<br />\r<br />To the east(-ish) of the Celts are the Germans. Despite being lightly armored and, in this early period, borrowing weapons from other ethnicities, Germans were nonetheless one of the more dangerous Roman enemies (I am still researching how they managed it).\r<br />\r<br />Celtic and Germanic factions replace the Stormcloaks and the Celts will also replace the Foresworn, which I think works out nicely since it makes sense that sotrmcloak celts and foresworn celts would be antagonistic.\r<br />\r<br />The following items are included for these two factions:\r<br />\r<br />-   Two types of Germanic helmets – no further armor or clothes yet\r<br />-   2 variants of Celtic chainmail sets and a few retextures (one retexture by AngryEw0k) (male only)\r<br />-   A Celtic light clothes outfit (needs a lot of work)\r<br />-   3 types of axes\r<br />-       Celtic steel sword\r<br />-       Celtic iron sword\r<br />-       Cherusker sword (Germanic)\r<br />-   Celtic round shield with several retextures done by AngryEw0k\r<br />-   A copy of the Spatha from the Roman mod for Germans to use, as they indeed have historically.\r<br />-   Celtic torc (juwelry)\r<br />-       Equippable body paint ([color=red]WORKS ONLY with default body mesh or with 4uDIKs Real Body mod using my optional leg mesh files that are included with the main download[/color])\r<br />-       Equippable hair paint for males\r<br />\r<br />=============================\r<br />The Parthians\r<br />=============================\r<br />\r<br />Before the Arabic invasions in Iran, before the Sassanids took over, there was Parthia. Parthians originate from a Skythian tribe(s?) and they took control over the Iranian area after the weakening of the Seleucids. Even though politically unstable, they were one of the long standing enemies of Rome and defeated several of its armies.\r<br />\r<br />When you think Parthia, you think heavily armored cavalry (cataphracts) and horse archers. There is an issue with that - Skyrim&#39;s NPCs cannot fight on horseback. It should be possible, but someone has to script it and I cannot. Wouldn&#39;t that be cool to have a bunch of Parthians riding arround, turning around in their saddle to do the &#34;Parthian shot&#34; and all …I can dream can&#39;t I. \r<br />\r<br />The Parthian faction replaces the Elven Dominion in Skyrim for now, although in general I want to keep the Nordic folklore races in the game and may need to introduce Parthians elsewhere.\r<br />\r<br />The following items are included for the Parthians:\r<br />-   A heavy cataphract armor set (currently male only and one size fits all)\r<br />-   A bronze recolor of the above armor\r<br />-       An archer outfit\r<br />-       Scythian composite bow \r<br />-       A sword with a bronze and iron recolor. \r<br />-       A small Scythian dagger\r<br />\r<br />=============================\r<br />Roman conversion\r<br />=============================\r<br />\r<br />In addition to the armor and weapons I am going to slowly try and convert the Skyrim items into classical antiquity items. At the moment I only got \r<br />\r<br />- The gold coinage has been changed to denarii; and \r<br />- A few types of ores have been converted to bring bronze into Skyrim.\r<br />- Names of days and months have been changed\r<br />- Some Roman God-related lore has been added\r<br />\r<br />[img] https://lh5.googleusercontent.com/-CYR4B3t6f94/UWgWVcNynTI/AAAAAAAAAec/2F6e74eeLk8/s605/installation+and+lcoation.jpg [/img]\r<br />\r<br />There are several .esp files that make up the mod, each can be used independently from the rest, so that you can to some degree pick the parts of the mod you like.\r<br />\r<br />If you are not sure what you want, just download the mod and extract the files located within the data folder of the zip file into your Skyrim&#39;s data folder and then make sure all the new esps are enabled in your mod list (preferably they should be at the bottom of your mod list).\r<br />\r<br />This is what each of the .esp files does:\r<br />\r<br />- Roman Imperial Armor and Weapons.esp – puts Roman armor and weapons into a custom Room in the Solitude castle, the door to which is in the small room behind General Tullius\r<br />- Roman Imperial Armor and Weapons Replacer.esp – Replaces the Imperial armor and weapons with the Roman versions\r<br />- Celtic and Germanic armor and weapons standalone.esp – Puts Celtic and Germanic armor and weapons into a custom new room in Windhelm (in the Barracks area).\r<br />- Celtic and Germanic armor and weapons replacer.esp – Replaces the Stormcloak and Foresworn armor and weapons\r<br />- WestAsianArmorandWeapons.esp – puts Parthian armor into a chest in front of the Thalmor embassy.\r<br />- WestAsianArmorandWeaponsReplacer.esp – replaces the Elven armor with the bronze version of the Parthian armor\r<br />- Roman Conversion.esp – this is the general esp for replacing various other objects in Skyrim with Roman era themed content. Currently it replaces the gold coin, some metal ores, the calendar names and some other names.\r<br />\r<br />\r<br />[img] https://lh6.googleusercontent.com/-jnlR4cJ2muI/UWgWVw-nSwI/AAAAAAAAAeo/LR8fpI0PKHo/s605/the+plan.jpg [/img]\r<br />\r<br />This is an approximate overivew of open things I would still like to see done. Most of all right now I am looking for:\r<br />- a modder who can create new landmass and \r<br />- a scripter who can make NPC soldiers fight on horseback, \r<br />but If you would like to pick up something else, even something I am working on, or something that is not on that list but you think would be relevant to the mod, please go ahead.\r<br />\r<br />[img]https://lh4.googleusercontent.com/-sOT79MGdSlM/Udlj1UM5RBI/AAAAAAAAAnY/uNFIUedFkyc/w931-h543-no/overview.jpg [/img]\r<br />\r<br />\r<br />[img]https://lh5.googleusercontent.com/-_aWhFWYOTHg/UWgWfgMBROI/AAAAAAAAAe8/peRji6G61iQ/s605/bugs+and+other+issues.jpg [/img]\r<br />\r<br /> [color=red] [b]PLEASE READ THIS BEFORE REPORTING IN COMMENTS[/b] [/color]\r<br />==============================================================================\r<br />\r<br />=============================\r<br />Troubleshooting\r<br />=============================\r<br />\r<br />1. If you found a bug that is not in the list of known bugs below, please try running the game with no other mods first. If the problem disappears then you know it&#39;s a compatibility issue and the only solution I know that could help is the solution No. 2\r<br />\r<br />2. Try to move my mods down to the bottom of the list of your mods in Data Files.\r<br />\r<br />3. Make sure your version of the game is updated with the latest patch or the mod might not work at all or the game might crash when running the mod. I am again powerless to change this behavior.\r<br />\r<br />4. Some people reported that installing skse (a script extender mod) helps non-appearing armors. My mod shouldn&#39;t require it though.\r<br />\r<br />5. To see all of the changes in the replacer versions of my mod, Skyrim first might need to reset/respawn the characters it already spawned, so that means the old ones need to die first (or respawn otherwise). Use the &#34;set timescale to 100000&#34; command to skip time and/or wait and after a while new armors should start spawning AND make sure that the replacer esp file is lowest on your list of mods (that modify leveled lists of items)\r<br />\r<br />6. Make sure that the all the files from the zip file got unpacked correctly by going to each directory in your data folder and comparing it to the files in the zip file.\r<br />\r<br />7. If none of the above works, you can try sending me a message, although I can&#39;t promise I&#39;ll be able to help.\r<br />\r<br />8. By the way, if something is wrong with the Roman armor, try using this version instead:\r<br />[url=http://skyrim.nexusmods.com/mods/10740] http://skyrim.nexusmods.com/mods/10740 [/url]\r<br />\r<br />If you cannot download this mod from Nexus for any reason, you can also get it from my website: [url=http://meusartis.com] http://meusartis.com [/url]\r<br />\r<br />=============================\r<br />List of known issues\r<br />=============================\r<br />\r<br />This mod still contains many little &#34;bugs&#34; at the moment. The more content I add, the more bugs I add. This outlines some of the issues you may see:\r<br />\r<br />i. There are still some clipping issues during animations, especially on the Roman armor, since that was my first mod. I have already spent countless hours improving this.\r<br />\r<br />ii. Currently there is LIMITED SUPPORT and no plans for adding full support for animal races, so the armour may look weird/broken on them or may not work - I don&#39;t know as haven&#39;t tested this and don&#39;t really want to. \r<br />\r<br />iii. There is some support for the females, but it is not full yet. Some things are messed up and some are missing;\r<br />\r<br />iv. There are distortions in texture during animations, especially on the chainmail - it is more obvious on other NPCs. I have been trying to fix it for a while now and will continue to do so, but even vanilla armors get distorted and the sad truth is that there is not much you can do about this problem. For example in real life the chainmail is able to bend and stretch due to all the space but of course a texture on a game model can only stretch as a whole. \r<br />\r<br />v. The tunics in both the Roman mod and in the Celtic mod have a little issues with the sleeves.\r<br />\r<br />vii. The backs of some helmets are a bit too narrow and clip through long hair. I think this is even the case with some of the vanilla Skyrim helmets.\r<br />\r<br />viii. Something&#39;s wrong with Tullius&#39; gauntlets so I removed them (they should disappear the next time the game updates its cells).\r<br />\r<br />ix. Please note that if you have both the standalone and the replacer esps enabled then things will appear in the list of craftable items twice - that is not a bug. This was designed so that people can use each mod separately.\r<br />\r<br />x. For one of the heavy caligae (boots) types the slider doesn&#39;t work. I don&#39;t know why it does that or how to fix it.\r<br />\r<br />xi. For Parthian scale armor the skinny-beefy slider currently doesn&#39;t work. Haven&#39;t gotten to making it yet.\r<br />\r<br />and....like a million other issues?...\r<br />\r<br />=============================\r<br />Conflicts\r<br />=============================\r<br />\r<br />Mods that modify inventory lists may have a problem with the replacer version of my mod (because they may tell the imperial soldiers to wear something else than what my mod tells them to wear). This is why you have to place my mod at the bottom of your mod stack.\r<br />\r<br />There seems to be a problem with the Civil War mod and the Imperial armor replacer esp of my mod:\r<br />1. Fast traveling to a civil war zone sometimes causes a crash/freeze. \r<br />2. My game will freeze in the midst of a busy battle sometimes. I think it might be all those high res textures and polys that push the PC too far. I tried cleaning my mod but to no result. On a new computer I had recently bought the game has not crashed so far\r<br />\r<br />\r<br />\r<br />[img] https://lh3.googleusercontent.com/-vhqKkUYy15s/UWgWUAQrcRI/AAAAAAAAAeg/BDEM0U51WBk/s605/Credits.jpg [/img]\r<br />\r<br />Thanks to \r<br />- Andouce for optional compatibility files\r<br />- JedJTL and SPQRLegatecan for additional retextures ofthe Roman armor\r<br />- AngryEw0k for the Hadrian Wall expansion textures and for the celtic shield retextures.\r<br />- all who helped me with some of the issues I have been having.\r<br />- somuchmonsters for the excellent tutorials\r<br />- SeptusTiberius for the red version of the Cetratus shield texture.\r<br />- Lord_Kosmos for fixing my Scutum shield texture\r<br />- 747823, represented by his successor, for letting me use one of the cubemaps\r<br />- My girlfriend for providing me a base texture and mesh for the rope. She also mods [b][url=http://www.ohbehave007.blogspot.com]http://www.ohbehave007.blogspot.com[/url][/b]\r<br />- AND THANKS TO MADRILOUS FOR LETTING ME USE HIS THROWING WEAPONS MOD and assisting me with making the javelins work. I picked his mod because out of all the throwing mods I have seen, his seems to be the most thorough and best for javelins.[b][url=http://skyrim.nexusmods.com/downloads/file.php?id=14176]http://skyrim.nexusmods.com/downloads/file.php?id=14176[/url][/b]\r<br />- and of course to everyone supporting this mod\r<br />\r<br />\r<br />[img]https://lh3.googleusercontent.com/-2OW7STslC8o/UWgWVD6P-9I/AAAAAAAAAe0/Hk-2JK4OlRg/s605/historical+accuracy.jpg[/img]\r<br />\r<br />Amost all the items I made have some sort of historical source to them. A movie by the way does not constitute a historical source (grrr).\r<br />\r<br />If you&#39;re interested to know a little more about my research please follow this link:\r<br />[url=http://www.romanarmytalk.com/rat/14-gaming-a-modelling/320065-roman-weapons-and-armour-mod-for-skyrim.html#323798]http://www.romanarmytalk.com/rat/14-gaming-a-modelling/320065-roman-weapons-and-armour-mod-for-skyrim.html#323798[/url]\r<br />If you want to see images you have to have an account there.\r<br />\r<br />At the moment it only covers the Romans, but I will expand the article.\r<br />\r<br />\r<br />\r<br />[img] https://lh5.googleusercontent.com/-Bp9Ia7Jbhi0/UWgWUX9EzII/AAAAAAAAAew/SB3j4fhFkEk/s605/Other+info.jpg [/img]\r<br />\r<br />\r<br />=============================\r<br />Change history:\r<br />=============================\r<br />\r<br />The history of previous changes can be found in the readme included with the file.\r<br />\r<br />\r<br />=============================\r<br />Recommended mods\r<br />=============================\r<br />\r<br />To have the complete Living History experience, I suggest the following mods:\r<br />\r<br />- Some gladiator armor can be found here [url=http://skyrim.nexusmods.com/mods/36079]http://skyrim.nexusmods.com/mods/36079[/url]\r<br />- Warzones: [url=http://skyrim.nexusmods.com/mods/9494]http://skyrim.nexusmods.com/mods/9494[/url]\r<br />- Immersive patrols: [url=http://skyrim.nexusmods.com/mods/12977]http://skyrim.nexusmods.com/mods/12977[/url]\r<br />There are unfortunately no great battles in Skyrim where thousands of soldiers can march forward under volleys of arrows and stones to the glorious slaughter, but Warzones and Immerive patrols together turn the whole SKyrim into a semi-battlefield.\r<br />- this banner mod [url=http://skyrim.nexusmods.com/mods/32833] http://skyrim.nexusmods.com/mods/32833 [/url]\r<br />- this nude mod is needed if you want to see the Forsworn naked [url=http://skyrim.nexusmods.com/mods/6667] http://skyrim.nexusmods.com/mods/6667 [/url] you will also need the optional leg meshes from the optional files folder of the main mod.\r<br />- It should not be required for my mod, but opeople reported that their bugs were fixed when they used the skse script extender. I use it too and it is a requirement for many mods out there so I would just get it either way [url=http://skse.silverlock.org/] http://skse.silverlock.org/ [/url]\r<br />\r<br />\r<br />=============================\r<br />Performance impact\r<br />=============================\r<br />\r<br />Last year I got a new computer so I no longer have any problems with big textures (that I know of). Most of my textures are 1024x. Some are 2048x and some are 512x, and I tried to not go overboard with the number of polys for my meshes. They are about the same amount of polys as some of the vanilla Skyrim meshes (which by the way differ considerably from armor to armor). Yes, I could make my armor and weapons even prettier if I increased resolution and polycount or more optimized if I reduced everything, but I think I have reached a good balance.\r<br />\r<br />=============================\r<br />Permissions\r<br />=============================\r<br />\r<br />Since I am putting a lot of effort and time into this (and my favorite sin is pride), you can use the mod and its contents for any non-commercial purposes, BUT please inform me first and please give due credit - it&#39;s the usual honor system.\r<br />\r<br />Please don’t just release a separate small modification with all of my meshes and textures included. Either let me add your mod as optional to my mod page or, if you want to release retextures as a separate file, that is fine if you just make clear that they are retextures.",
  "categoryId": "79",
  "version": "1.7.5",
  "author": "Jedo Dre and the team",
  "createdUnix": "1365842305",
  "updatedUnix": "1374426404",
  "containsAdultContent": false,
  "uploadedBy": "Jedo_Dre",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024022",
      "name": "Optional replacer esp files by Andouce",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "168",
      "fileName": "Optional replacer esp files by Andouce-32988-1-0.rar",
      "uploadedUnix": "1365813525",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d9b14d6a3b9e1b0574daff951d8d9ccc2650e8bb239b3d23ba0595b132f45d9a/analysis/1407518843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20replacer%20esp%20files%20by%20Andouce-32988-1-0.rar?fid=1000024022&ttl=1535809820&ri=8192&rs=8192&setec=80916d075454a5ac7482e29a3f1f73dd"
    },
    {
      "fileId": "1000024025",
      "name": "Additional retextures by JedJTL and SPQRLegate",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "124859",
      "fileName": "Additional retextures by JedJTL and SPQRLegate-32988-.zip",
      "uploadedUnix": "1365814207",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/bb57facf1f066d6bec2915276b44c54e9b047f8cf1ef9be9f1cbb1e45f4a68f8/analysis/1407518919/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Additional%20retextures%20by%20JedJTL%20and%20SPQRLegate-32988-.zip?fid=1000024025&ttl=1535809821&ri=8192&rs=8192&setec=d1ab77b4cae71d91e2cb0daf058ab708"
    },
    {
      "fileId": "1000031438",
      "name": "Shield Pack",
      "version": "0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3915",
      "fileName": "Shield Pack-32988-0-1.7z",
      "uploadedUnix": "1369518710",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/ca33033b08c532d72a83c0b5528e9a2a9985d1e260f9b0a3e45b3b34ddb61820/analysis/1407581597/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shield%20Pack-32988-0-1.7z?fid=1000031438&ttl=1535809821&ri=8192&rs=8192&setec=cc6c0d6c489e2388a2dc0b052b01b8a0"
    },
    {
      "fileId": "1000036424",
      "name": "Historical Revivial - The Roman Era 16",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "219129",
      "fileName": "Historical Revivial - The Roman Era-32988-1-6.zip",
      "uploadedUnix": "1372521078",
      "modVersion": "1.6",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Historical%20Revivial%20-%20The%20Roman%20Era-32988-1-6.zip?fid=1000036424&ttl=1535809822&ri=8192&rs=8192&setec=ca6aef836733db3bb37fcb9330834c9b"
    },
    {
      "fileId": "1000037681",
      "name": "Historical Revival - The Roman Era",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "221943",
      "fileName": "Historical Revival - The Roman Era-32988-1-7.zip",
      "uploadedUnix": "1373202602",
      "modVersion": "1.7",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Historical%20Revival%20-%20The%20Roman%20Era-32988-1-7.zip?fid=1000037681&ttl=1535809822&ri=8192&rs=8192&setec=5733990f05ffe419d87772fcaf12a9b9"
    },
    {
      "fileId": "1000039972",
      "name": "Historical Revival - The Roman Era",
      "version": "1.7.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "226534",
      "fileName": "Historical Revival - The Roman Era-32988-1-7-5.zip",
      "uploadedUnix": "1374426404",
      "modVersion": "1.7.5",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Historical%20Revival%20-%20The%20Roman%20Era-32988-1-7-5.zip?fid=1000039972&ttl=1535809823&ri=8192&rs=8192&setec=5c40862926ac1b340bb2f6351ea62df6"
    }
  ]
}