{
  "modId": 33001.0,
  "modName": "Improved Psiblades - Master Blade",
  "summary": "The start of an improved version of my psiblades mod, wrist mounted magical energy blades and that sort of thing.",
  "descriptionHtml": "IMPROVED PSIBLADES: MASTER PSIBLADE\r<br />“The power of your mind, focused into a cutting edge… literally”\r<br />_________________________________________________________________\r<br />THANK YOUS:\r<br />\r<br />Skyrim Nexus modder foster xbl, for her bound armor scripts, which are used in this mod and solved an issue that confounded me for a month, if not for that, I might have never gotten around to finishing this. If you want some true, lore friendly bound armor, check out her mod “True Bound Armor” on the Skyrim Nexus\r<br />\r<br />Skyrim Nexus modders IsharaMeradin, and Willy4x4, for all the time and effort they put forth to helping me understand scripting, I still don’t, but that is my own fault :P\r<br />\r<br />Credit to Nexus user: Bael for the original starcraft sound pack (downloadable as an optional file)\r<br />\r<br />INDEX\r<br />_________________________________________________________________\r<br />1.   Description\r<br />2.   How to get\r<br />3.   CUSTOM RACE USERS/ ”CANNOT SEE IN FIRST PERSON”\r<br />4.   Other bugs and issues\r<br />\r<br />DESCRIPTION\r<br />_________________________________________________________________\r<br />If you have seen or downloaded my older mod “Psiblades” then thank you for enjoying my work, and sorry that I have not updated that mod, but once I finished that mod, I had ideas on how to improve it, and make it cleaner, and It ended up being easier to make a fresh mod, and this one can and will be used to add in the other Psiblades as improved versions are made (I plan on improving the dual version, making a stealth version, and perhaps for those who have Dragonborn, a Bloodskaal mindcutter that uses the energy wave from the Bloodskaal blade) Just a heads up, the updates will come slowly, as there is other content I want to try my hand at making, and I am in college, so I frequently find myself busy, but when i do add these, i will do so as an update to this mod, so check back every now and again.\r<br />\r<br />For those who are familiar with this mod’s precursor, a list of changes goes as follows:\r<br />\r<br />-   The blade still uses the perk tree for regular bound weapons, but now the base damage scales with your conjuration skill, rather than upgrading once upon taking the mystic binding perk (mystic binding now has no effect on the blades performance, but all other perks for bound weapons apply to the Psiblade normally) Stat wise, at 0 conjuration, the blade is equal to a steel sword, with the reach of a greatsword, at conjuration 100 it is a bit better in raw damage than a standard legendary daedric sword (standard meaning with a smithing = 100) still with the reach of a 2 handed weapon (you cannot dual wield the master blade, which is why its damage and reach are the way they are)\r<br />\r<br />-   The visuals are now attached to a bone in the forearm, so the blade no longer points awkwardly when blocking, and the killcam visuals should work much better than the old blades, which were attached to the weapon node, and as such would turn sideways for stabbing motions and such\r<br />\r<br />-   Unfortunately this means I had to scrap the animations until such a time I can figure out just how the hell that stuff even works.\r<br />\r<br />-   ******** THE GAUNTLET IS NO LONGER ARMOR it is now a cloth item that can be equipped separate to any gauntlet, so you can wear it with any gloves you wish, or with none at all, and it also means it now does not inhibit the mage armor spell.\r<br />\r<br />-   Crafting materials have been changed, no more searching far and wide to find an inkwell&#33; :D\r<br />\r<br />-   The gauntlets no longer randomly fail to show, and as such, no longer take your forearms with them, hooray for staying in one piece&#33;\r<br />\r<br />HOW TO GET\r<br />_________________________________________________________________\r<br />The weapon comes in two parts, it is a bound weapon style spell, whos spellbook can be crafted at the tanning rack. The spell will not work however, without forging and equipping the Master Focus gauntlet, which can be crafted at the forge. Both of these require the arcane blacksmith perk to craft, so anyone who uses mods that re-work the smithing perk tree might have issues with crafting the objects.\r<br />\r<br />To use, learn the spell, then with the focus gauntlet equipped, cast it. If the gauntlet is not equipped, the spell will fizzle\r<br />\r<br />The bound sword perks apply to the psiblades, except mystic binding, which has no effect, the base damage of the blade levels with your conjuration skill\r<br />\r<br />CUSTOM RACE USERS / “I CANT SEE THE BLADE OR GAUNTLET IN FIRST PERSON”\r<br />_________________________________________________________________\r<br />The gauntlet/blade visuals are armor items attached to biped objects 59 and 60, if you use a custom race, you must load up the custom race mod in the creation kit, find your race under the “races section” and under the list of biped objects, you must enable biped objects 59 and 60, save the changes, and you should be able to see the meshes while in first person.\r<br />\r<br />If you don’t use a custom race but still can’t see the meshes in first person, then you have another mod that changes the race files (very common for custom armor mods, the few standard biped objects are rather limiting) the easiest way to fix this, is to go into whatever mod with the CK, and do the same as those with custom races, but with the vanilla races, open them up, and activate biped objects 59 and 60, or if after installing this mod another one of your installed armor mods does not work, find out what biped objects that mod uses for its meshes, and activate those in this mod, I don’t entirely know how Skyrim handles the race files, but if I can find out if it is safe, I might just enable all biped slots at some point, just to avoid all potential conflict.\r<br />\r<br />OTHER BUGS AND ISSUES\r<br />_________________________________________________________________\r<br />None that I know of, sh** actually works now&#33; But if you come across a bug while using this mod, don’t hesitate to inform me so I can fix it.\r<br />\r<br />FOR ANYONE WHO CRASHES WHEN CASTING THE SPELL: \r<br />\r<br />that is a problem with bound weapon spells, it is a common bug attributed to vanilla skyrim, hopefully bethesda will make a fix soon, but until then, try loading up older saves, if that does not work, i heard somebody fixed it by totally emptying their inventory of EVERYTHING saving, loading, then just grabbing what they actually use, if THAT dosn&#39;t work, the only thing i can say is either don&#39;t use bound weapons, or make a new character\r<br />\r<br />Quote\r<br />User Dareksun\r<br />\r<br />Put all things from your inventory into an empty chest or barrel, including weapon, armor, key , book etc.(if quest item cannot remove just ignoring it, I did that myself). Then use console command: player. resetinventory, then system will reset your inventory by giving you some gears (It gave me the whole set of iron armor), and this bug shall be fixed.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Gwyvern",
  "createdUnix": "1362788579",
  "updatedUnix": "1410733165",
  "containsAdultContent": false,
  "uploadedBy": "Gwyvern",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016031",
      "name": "Improved Psiblades - Master Blade",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5659",
      "fileName": "Improved Psiblades - Master Blade-33001-1-0.7z",
      "uploadedUnix": "1362788148",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/af4f43ea980c898e6529566a9c923f1aaa807a0a5062c494841b3f1625ad3091/analysis/1407459607/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Psiblades%20-%20Master%20Blade-33001-1-0.7z?fid=1000016031&ttl=1535809859&ri=8192&rs=8192&setec=3a9af64b2c479b3c9ab208b32f39b51b"
    },
    {
      "fileId": "1000016037",
      "name": "Improved Psiblades - Master Blade",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5662",
      "fileName": "Improved Psiblades - Master Blade-33001-1-1.7z",
      "uploadedUnix": "1362789829",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/170fbe126a29df5b18fa107a5b0cbf230f4bffb408c10c2c3db829b7db6ad4ac/analysis/1407459611/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Psiblades%20-%20Master%20Blade-33001-1-1.7z?fid=1000016037&ttl=1535809859&ri=8192&rs=8192&setec=4ebbae43f5906d898df2c09c0546d92e"
    },
    {
      "fileId": "1000016236",
      "name": "SkyRe Compatability file ONLY DOWLOAD IF YOU USE SKYRE",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "42",
      "fileName": "SkyRe Compatability file ONLY DOWLOAD IF YOU USE SKYRE-33001-1-1.7z",
      "uploadedUnix": "1362853930",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0a06440907fc5f53b40adc71d4a6988408ae8a2369e3b84d6bdaa41059e24cd3/analysis/1407461246/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRe%20Compatability%20file%20ONLY%20DOWLOAD%20IF%20YOU%20USE%20SKYRE-33001-1-1.7z?fid=1000016236&ttl=1535809859&ri=8192&rs=8192&setec=f75a9d83ccc11eba97ff9181765977f8"
    },
    {
      "fileId": "1000126907",
      "name": "Original Starcraft Soundpack",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "132",
      "fileName": "Original Starcraft Soundpack-33001-.rar",
      "uploadedUnix": "1410733165",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c16d24863bf6cf14f8ea82ebf889b5bd1fe34b5db0d7f04db7a844e147fb8cf9/analysis/1410733262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Original%20Starcraft%20Soundpack-33001-.rar?fid=1000126907&ttl=1535809860&ri=8192&rs=8192&setec=e3dff1e879093ce5fc7adcc682c6fe6e"
    }
  ]
}