{
  "modId": 33016.0,
  "modName": "Better Daedric Blessings",
  "summary": "Augments the Blessings of the Daedra with enhanced and/or extra effects in order to make a character's 'worship' of the daedra more meaningful and have a better impact on gameplay. This mod was developed with game balance and mod compatibility in mind; no new items or scripts are added to the game.",
  "descriptionHtml": "This mod is intended for Skyrim version 1.8.151.0.7 or higher. Older versions of Skyrim might not work with this mod.\n<br />\n<br />The Better Daedric Blessings mod was created with a similar goal to my [url=http://skyrim.nexusmods.com/mods/32761]Better Divine Blessings[/url] mod, which is to enhance and update the lackluster daedric blessings with more meaningful effects; all while still trying to keep in line with the Elder Scrolls lore. Hopefully this mod should help give players (particularly those who play daedra-worshipping characters) more reason to actually use the daedric blessings rather than ignoring them altogether.\n<br />\n<br />Unfortunately, while I would've liked this mod to directly encompass several blessings all at once, the sad fact of the matter is that in the original Skyrim there is only a single daedric blessing: the Blessing of Nocturnal. However, three new daedric blessings were added by the Dragonborn DLC, so when I get changes to those blessings done I'll be including a separate mod to cover those changes along with this mod as a supplement. Although if Bethesda ever does add more daedric blessings to the core game via future patches (doubtful), they'll receive their due makeovers and enhancements via this mod.\n<br />\n<br />Please keep in mind that the effects assigned to the blessings are not necessarily final; I'm open to suggestions for improvements to these effects and other suggestions for improving this mod, and I implore anyone who reads this and has some thoughts or ideas on the matter to let me know in the comments section. If some effect is too strong, too weak, doesn't make sense for that daedra, etc, please let me know. It's my hope that I've already come up with a good setup, but I feel that there is always room for improvement.\n<br />\n<br />This mod was also created with compatibility in mind; no new scripts are added to the game by this mod, as those create considerable save file and compatibility problems - particularly if or when you decide to stop using a mod. To the best of my knowledge, the design of this mod is such that it can be easily installed and uninstalled with no ill effects on one's save files.\n<br />\n<br />Changes to Blessings of the Daedra as implemented by this mod:\n<br />Blessing of Nocturnal - Sneaking +30%, Pickpocketing +30%, Lockpicking +30%\n<br />\n<br />Special note regarding the effect types on Nocturnal's Blessing:\n<br />The default effect on Nocturnal's Blessing is actually a flat increase to the Sneak skill of 10 points. Not only was this a piddly amount, it also has an incredibly small (unnoticeable) effect on the character's ability to sneak. Because of this, I changed the sneak component of her blessing to use the same \"SneakMod\" effect that is used by enchanted armors and jewelry. So the effect on sneaking you now get from the blessing is the same as if you had an enchanted item with that effect at that magnitude, which has a much more noticeable impact on sneaking ability overall. Similarly, the pickpocket and lockpicking components also use the same effect type as that enchanted armors and jewelry use, so their effects should also be fairly noticeable.\n<br />\n<br />The description attached to the Shrine of Nocturnal has also been changed to include an informative summary of the blessing's effects. This should be particularly helpful to anyone that has difficulty remembering the effects of the shrine's blessing.\n<br />\n<br />CAUTION - Before installing, uninstalling, or updating:\n<br />Just as a precaution, I encourage anyone who is about to install, uninstall, or update this mod to a newer version, to prepare your save file for the transition by first making sure that none of the blessings from the shrines of the daedra are currently affecting your character. You can forcibly dispel any active blessings on your character using the console command \"player.dispelallspells\". The reason for doing this step is to ensure that no bugs occur with effects being active for which there is no data or that the data is incorrect; by clearing these effects ahead of time, this problem is considerably mitigated if not avoided entirely. Again, it might not even be necessary to do this, but you might as well just to be on the safe side.\n<br />\n<br />Installation:\n<br />Either use the Nexus Mod Manager, or copy Better_Daedric_Blessings.esp into the Data subfolder of your Skyrim installation directory and then enable it in the launcher.\n<br />\n<br />Uninstallation:\n<br />Either disable it in the Nexus Mod Manager, or delete Better_Daedric_Blessings.esp from the Data subfolder of your Skyrim installation directory.\n<br />\n<br />Some final notes regarding the design decisions made in this mod:\n<br />Nocturnal - Considering her nature as a patron to thieves, it was a pretty straightforward decision that her bonus to stealth ought to include bonuses to pickpocketing and lockpicking. I personally feel it's something of a boring addition, and it would've been nice to give the blessing some kind of unique or otherwise more interesting effects, but I don't think any other effects would make as much sense as what the blessing has now. If anyone has some ideas or thoughts on the matter though, I'd like to hear about it.\n<br />\n<br />Well, that's about all there is to say about this mod for now. If you have thoughts or suggestions or happen to find any bugs that I missed, please let me know in the comments section.\n<br />\n<br />My other mods:\n<br />[url=http://skyrim.nexusmods.com/mods/32284]Hoodswap[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/32422]College of Winterhold Shop Fixes - Mage Hoods - Robes - Gloves - Boots - Psiijic - Etc[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/32761]Better Divine Blessings[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/32817]Silda the Unseen Master[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33062]Unleveled Skyrim Items[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33069]Unleveled Dragonborn Items[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33135]Gemstone Recovery[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33326]Better Imperial Luck[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33614]Better Standing Stones[/url]",
  "categoryId": "24",
  "version": "1.0",
  "author": "SkylerModder",
  "createdUnix": "1362820616",
  "updatedUnix": "1362820075",
  "containsAdultContent": false,
  "uploadedBy": "SkylerModder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016112",
      "name": "Better_Daedric_Blessings_v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Better_Daedric_Blessings_v1_0-33016-1-0.7z",
      "uploadedUnix": "1362820075",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0a601c4d95054459887dabf7f8a9dbac7faa1456a7afa85fc43ec7b175b4fa98/analysis/1407460228/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better_Daedric_Blessings_v1_0-33016-1-0.7z?fid=1000016112&ttl=1535809883&ri=8192&rs=8192&setec=9901d01172c78159f13ce43c3440046d"
    }
  ]
}