{
  "modId": 33017.0,
  "modName": "Tropical Skyrim -- A Climate Overhaul",
  "summary": "This mod is a complete overhaul of skyrims climate, from a snowy wasteland to a tropical paradise. Skyrim now features lush jungles, scortching deserts, sandy beaches, bamboo forests, fiery \r<br />volcanic areas and much more. Each of these areas also come with new animals, new lighting, and new weather. ",
  "descriptionHtml": "Checkout TheCoDzillaPlayers&#39; youtube channel for a great Tropical Skyrim Playthrough\r<br />[url=http://www.youtube.com/user/TheCoDzillaPlayer?feature=watch\r<br />]http://www.youtube.com/user/TheCoDzillaPlayer?feature=watch\r<br />[/url] \r<br />\r<br />Don&#39;t forget to endorse this mod if you enjoy Tropical Skyrim&#33; In fact, why not take a few minutes to endorse all your favourite mods?\r<br />\r<br />[color=green][size= 10] [center][u]Tropical Skyrim[/u][/center] [/size][/color]\r<br />[color=green][size=5] [center]By Soolie[/center] [/size][/color]\r<br />\r<br />\r<br />\r<br />\r<br />Thank you to Oliver.G for giving me a donation :).\r<br />\r<br />\r<br />[youtube]2pSNEXqbmII[/youtube] [youtube]4y7GNezfepc[/youtube]\r<br />[youtube]GIpzzys0168[/youtube] [youtube]34TZc415IVE[/youtube]\r<br />[youtube]ujcA6DO-jWA[/youtube]\r<br />\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img]\r<br />[color=green][size=6] [center]Description[/center] [/size][/color]\r<br />\r<br />\r<br />\r<br />Are you one of the many people who are tired of snow and rain every day? Are you tired of the same dull landscape? Are you tired of living in a frozen wasteland? Are you seeking something new?\r<br /> Well look no further. Tropical skyrim gives you a completely new experience in the world of skyrim. \r<br />\r<br /> This mod is a complete overhaul of skyrims climate, from a snowy wasteland to a tropical paradise. Skyrim now features lush jungles, scortching deserts, sandy beaches, bamboo forests, fiery \r<br />volcanic areas and much more. Each of these areas also come with new animals, new lighting, and new weather. Almost all the animals and monsters have been replaced as well. \r<br />\r<br />\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img] \r<br />[color=green][size=6] [center]Details[/center] [/size][/color]\r<br />\r<br />\r<br />\r<br />[u]New Areas:[/u]\r<br />\r<br />The tundra area has been converted into a desert with small amounts of vegitation. I have Also added sandstorms to this area.\r<br />\r<br />The costal areas have been given new life, they now feature warm sands and shady palms.\r<br />\r<br />The pine forest has been changed into a dense jungle. Featuring giant palms + many more types of foliage.\r<br />\r<br />The snowy areas of skyrim have been changed quite a lot. After much thought I decided to change them into a grassy environment with a few aspen trees which ended up looking like the area in Oblivion around Skingrad. I have changed the snow shader which puts snow on the top of objects into a grass/moss shader, which puts grass/moss on them.\r<br />\r<br />The aspen forest has been converted into a dense bamboo forest.\r<br />\r<br />The Reach has also been converted into a jungle, however it has darker textures and slighly less dense trees.\r<br />\r<br />The marsh area is still a marsh, only now it has brown muddy water, cattails, and jungle foliage.\r<br />\r<br />I have retextured the glaciers to turn them into huge cliffs.\r<br />\r<br />The volcanic tundra has been transformed into a firey wasteland with darker rocks, very small patches of lava oozing from the ground and small fires dotting the landscape\r<br />\r<br />\r<br />\r<br />[u]Weather/Lighting/Environment changes:[/u]\r<br />\r<br />Each of the new areas has also been given new sets of weather and lighting setups (imagespace modifiers). These new lighting/weather setups give the game a real hot and humid feel. The new setups also feature stronger (and better) bloom than vanilla skyrim. Personaly i think this suits the climate however, alot of people dislike it, so i have included an optional less bloom version for those who want it.\r<br />\r<br />\r<br />\r<br />[u]Animals/Monsters:[/u]\r<br />\r<br />The creatures that live in skyrim aren&#39;t really what you would expect to see in a tropical climate. So i have replaced them. :)\r<br />\r<br />You will now meet the following creatures in your travels:\r<br />\r<br />Pandas. --  Replaces some bears\r<br />Jungle Spiders.  --  replaces Frostbite Spiders\r<br />Seals  --  replaces Horkers\r<br />Raptors  --  replaces Wolves\r<br />Tigers  --  replaces sabre cat\r<br />Therium (Rino like creature)  -- replaces some Bear&#39;s\r<br />Ape&#39;s -- replaces Troll&#39;s\r<br />\r<br />Some other skyrim creatures are still present (some with slightly different names) but with a retexture to make them fit the climate.\r<br />\r<br />A lot of tropical birds have been added too. (you can have even more with the Birds of Skyrim mod, which has been included)\r<br />\r<br />\r<br />\r<br />\r<br />[u]Other Changes:[/u]\r<br />-- Changes to the water.\r<br />-- Most cities and buildings have been retextured to suit their surroundings.\r<br />-- Nordic ruins retextured to look like ayleid ruins.\r<br />-- Ice caves retextured into stone (with moss)\r<br />-- Fur and hide armors have been retextured into leopard fur armor.\r<br />-- Backround added to main menu and loading screens.\r<br />\r<br />\r<br />\r<br />Also, for those who have been asking, yes this will replace skyrims landscape rather than create any new lands. The reason i have chosen to take this approach is to save time. At the present, I don&#39;t have the time to create an entire new land filled with quests, npc&#39;s, monsters, items, dungeons, cities, etc.\r<br />So by replacing assets already in the game, I can focus purely on the environment and the &#34;aesthetics&#34; of the mod, rather than work on entirely new worlds with quests/npc&#39;s/towns, as they are already there. :)\r<br />\r<br />\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img]\r<br />[color=green][size=6] [center]Recommended Mods[/center] [/size][/color]\r<br />\r<br />\r<br />\r<br />-- [url=http://skyrim.nexusmods.com/mods/23771]SkyBirds[/url],  This adds even more birds to the game... and in a tropical paradise, you can NEVER have too many birds ;)\r<br />\r<br />--[url=http://skyrim.nexusmods.com/mods/33669]Fantasy Music Overhaul[/url],  Because skyrims music just doesn&#39;t suit the tropics :&#92;  This mod will add 45+ new music pieces to fit the jungle theme.\r<br />\r<br />--[url=http://skyrim.nexusmods.com/mods/31686]Waves[/url], I haven&#39;t actualy tried this as i dont have any of the DLC, but i think it would be perfect for the coastline\r<br />\r<br />--[url=http://skyrim.nexusmods.com/mods/28944/]Tame The Beasts of Skyrim[/url], \r<br />\r<br />--[url=http://skyrim.nexusmods.com/mods/12647/]Pride&#39;s of Skyrim[/url],  Adds pride&#39;s of lion&#39;s and panthers to the wilderness .\r<br />\r<br />-- SneakyBastard has also redone some of the textres in higher resolution which you can use if you dont like my own textures, you can get it [url=http://skyrim.nexusmods.com/mods/33415/]Here[/url]\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img]\r<br />[color=green][size=6] [center]Performance[/center] [/size][/color]\r<br />\r<br />This mod will cause a performance drop in some areas, however its not too much. An estimate of the average drop across the whole game would be roughly     4-6 fps. \r<br />If you do find the performance drop too much, there are still some things you can do.\r<br />\r<br />-- Lower the grass draw distance.  This mod has quite alot of grass objects and some of them are higer poly than the vanilla grass, (The grass is responsible for about 70% of the performance hit in the swamp areas, which has very dense grass).\r<br />\r<br />-- Install HiAlgo Boost.  From personal experience i can tell you that this DOES make the game run alot more smoothly. This mod dynamicaly lowers the render resolution when the camera is moving, this allows the user to have very smooth motions when turning the camera while still maintaing full quality when stationary.\r<br />\r<br />\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img]\r<br />[color=green][size=6] [center]Install[/center] [/size][/color]\r<br />\r<br />\r<br />\r<br />**THIS MOD HAS A LARGE NUMBER OF LOOSE FILES, TAKE CARE WHILE INSTALLING AND UNINSTALLING**\r<br />** I STRONGLY RECOMMEND YOU INSTALL THIS WITH THE NEXUS MOD MANAGER**\r<br />\r<br />AUTOMATIC DOWNLOAD WITH NMM\r<br />1. Click the Download with manager button on top of the file.\r<br />2. Tropical Skyrim will appear in in NMM&#39;s Mods list once it&#39;s downloaded. Double-click the Tropical Skyrim entry to Activate it.\r<br />3. Enable TropicalSkyrim.esp and TropicalSkyrim--Birds.esp.\r<br />4. if you wish to play with less bloom, then download TropicalSkyrim--LessBloom.esp under optional files.\r<br />\r<br />\r<br />MANUAL DOWNLOAD WITH NMM\r<br />1. Start NMM and click on Mods.\r<br />2. In the left icon bar, click on Add Mod From File and select the downloaded archive file.\r<br />3. TropicalSkyrim will now appear in the list. Double-click to Activate it.\r<br />4. Enable TropicalSkyrim.esp and TropicalSkyrim--Birds.esp.\r<br />5. if you wish to play with less bloom, then download TropicalSkyrim--LessBloom.esp under optional files.\r<br />\r<br />\r<br />MANUAL INSTALL\r<br /> 1. Extract the files to a temporary location.\r<br /> 2. Navigate to your /data folder and make a backup of your Textures and Meshes folders. (this could be quite a large backup, so make sure you watch your disk space).\r<br /> 3. Copy the contents of the extracted folder to your skyrim folder.\r<br /> 4. enable TropicalSkyrim.esp and TropicalSkyrim--Birds.esp.\r<br /> 5. if you wish to play with less bloom, then download TropicalSkyrim--LessBloom.esp under optional files.\r<br />\r<br />\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img]\r<br />[color=green][size=6] [center]Uninstall[/center] [/size][/color]\r<br />\r<br />\r<br />\r<br />NMM INSTALLATION\r<br />In NMM&#39;s mod list, search for the TropicalSkyrim entry and deactivate the mod.\r<br />\r<br />MANUAL INSTALLATION\r<br />1. View the contents of the downloaded TropicalSkyrim archive, look for each file at its install location and remove it.\r<br />2. Restore any backup&#39;s you made of your Textures and Meshes folders prior to installation.\r<br />\r<br />\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img]\r<br />[color=green][size=6] [center]Incompatibility[/center] [/size][/color]\r<br />\r<br />\r<br />There will be quite a large number of mods incompatible with tropical skyrim. As it would be impossible to name all the mods i will just give you a general idea of the sorts of mods that will be incompatible.\r<br />\r<br />Any mod that changes the outdoor weather or lighting will be incompatible.  However, you can still use a different weather/lighting mod such as CoT by simply placing it after Tropical Skyrim in the load order.\r<br />\r<br />Any mod that changes the trees/grass/terrain will be incompatible.\r<br />\r<br />Any mod that changes other environmental textures will me incompatible\r<br />\r<br />Any mod that changes the LOD textures, will be incompatible.\r<br />\r<br />Any mod that changes the city textures will be incompatible. If you prefer the textures from other city mods, then you can install them over the top of this. However, they may not suit the climate.\r<br />\r<br />Any mod that changes the vanilla animals/monsters will be incompatible.\r<br />\r<br />Almost all player home mods or similar mods will be compatible with this mod provided they are loaded before tropical skyrim. However any trees placed in or around the player home will be replaced by bigger tropical trees, this may cause clipping with other objects.\r<br />\r<br />DLC: As i dont have any of the dlc i cant tell you exactly what will happen.  However, assuming bethesda has used the same textures and trees in the dlc&#39;s, they should become tropical aswell :)\r<br />\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img]\r<br />[color=green][size=6] [center]Known Issues or Bugs[/center] [/size][/color]\r<br />\r<br />\r<br />\r<br />distant trees currently have terrible lighting. This is because their LOD was generated as if they were normal objects rather than trees, this was necessary to overcome some limitations in the creation kit.  Fortunately a fix is on the horizon and the lod will be fixed in a later version.\r<br />\r<br />Some of the solitude object LOD is diplaced slightly, so there are some sections off the castle that hang over the cliff, and some sections of the wall are missing. This will fix itself once the tree lod is sorted out.\r<br /> \r<br />\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img]\r<br />[color=green][size=6] [center]History[/center] [/size][/color]\r<br /> \r<br />\r<br />1.1, 2013/03/16 \r<br />This Fixes\r<br />--desaturated whiterun at night\r<br />-- sandstorm issue\r<br />-- raptor stats (way too strong)\r<br />-- raptor&#39;s dropping wolf pelts (now drop raptor skin)\r<br />-- Fixed objects that still had snow on them.\r<br />-- Collisions have been fixed for large trees.\r<br />\r<br />\r<br />1.0, 2013/03/10 \r<br />-- Initial release.\r<br /> \r<br />\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img]\r<br />[color=green][size=6] [center]Contact[/center] [/size][/color]\r<br />\r<br />\r<br />\r<br /> You can find me on the Nexus as &#39;Soolie&#39;\r<br /> \r<br />\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img]\r<br />[color=green][size=6] [center]Credits[/center] [/size][/color]\r<br />\r<br />\r<br />\r<br />\r<br />Unfortunately I lost track of who&#39;s work I used in my mod. I have tried my best to remember everyone, but if some of your content has been used in my mod and your name does not appear in the list below, PLEASE contact me ASAP, and i&#39;ll fix it right away.\r<br />\r<br />\r<br /> Thanks to lookout21 for the following animal textures: Elk, Reindeer, 2 fox textures, goat.\r<br />\r<br /> Thanks to Ga-Knomboe Boy For letting me use trees from his GKB Green Trees Mod.\r<br />\r<br /> Thanks to qasiermo for allowing me to package his Birds of Skyrim mod into Tropical Skyrim.\r<br />\r<br /> Thanks to Muppetpuppet for letting me use use some of the foliage objects from his Moonpath mod, and for also letting me use the folowing creatures: raptor, imga, therium, spider.\r<br />\r<br /> Thanks to HellStorm102 for allowing me to use his/her main menu background mesh with my custom texture.\r<br />\r<br /> Thanks to Tamira for letting me use plants from her New Plants mod.\r<br />\r<br />\r<br />I would also like to thank my two beta testers for this mod: Acceleratio and humannature66.  Without their help, this mod would probably still be a buggy mess.\r<br />\r<br />\r<br />\r<br />[img]http://img24.imageshack.us/img24/7656/linegi.png[/img]\r<br />[color=green][size=6] [center]Licensing/Legal[/center] [/size][/color]\r<br />\r<br />\r<br />\r<br />\r<br />you MUST contact me and obtain permission before uploading this mod to other sites or using its contents in your own mod.\r<br />If you want to create an addon for this mod (improving the lighting, adding creatures, etc..) please contact me before doing so.",
  "categoryId": "79",
  "version": "1.1",
  "author": "Soolie",
  "createdUnix": "1362969156",
  "updatedUnix": "1363432955",
  "containsAdultContent": false,
  "uploadedBy": "Soolie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016119",
      "name": "Less Bloom Option",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1565",
      "fileName": "Less Bloom Option-33017-1-0.zip",
      "uploadedUnix": "1362822263",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/75327a0368f2489528dcd0c5a941e83d4291368de00f5a4db116274f5921d255/analysis/1407460232/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Less%20Bloom%20Option-33017-1-0.zip?fid=1000016119&ttl=1535809884&ri=8192&rs=8192&setec=421da5b2a224f3da10ed649f6bcacf60"
    },
    {
      "fileId": "1000016188",
      "name": "Tropical Skyrim v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "897311",
      "fileName": "Tropical Skyrim v1_0-33017-1-0.zip",
      "uploadedUnix": "1362838858",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tropical%20Skyrim%20v1_0-33017-1-0.zip?fid=1000016188&ttl=1535809885&ri=8192&rs=8192&setec=fc4e9d22f1392a07ce22b80b599f7576"
    },
    {
      "fileId": "1000016632",
      "name": "TEXTURE MISSING FROM MAIN ARCHIVE -- MUST DOWNLOAD THIS AS WELL",
      "version": "1.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "0",
      "fileName": "TEXTURE MISSING FROM MAIN ARCHIVE -- MUST DOWNLOAD THIS AS WELL-33017-1-0.zip",
      "uploadedUnix": "1362966368",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c851de851f4b2e663039cb66c4cc2b20e19700e4ca894c6da8f08a72541db7ed/analysis/1407463934/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TEXTURE%20MISSING%20FROM%20MAIN%20ARCHIVE%20--%20MUST%20DOWNLOAD%20THIS%20AS%20WELL-33017-1-0.zip?fid=1000016632&ttl=1535809885&ri=8192&rs=8192&setec=264cf66e0db2e2291679a25e680f3e19"
    },
    {
      "fileId": "1000017932",
      "name": "UPDATE v1_1  -- DOWNLOAD THIS ",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "2561",
      "fileName": "UPDATE v1_1  -- DOWNLOAD THIS -33017-1-1.zip",
      "uploadedUnix": "1363432955",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6d13f696c90d57e1f4e94bcea8369256360b15a76867b06d2a3c14a86651188d/analysis/1407472526/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UPDATE%20v1_1%20%20--%20DOWNLOAD%20THIS%20-33017-1-1.zip?fid=1000017932&ttl=1535809886&ri=8192&rs=8192&setec=ebb015e818fd40cc2b38f17af87ae325"
    }
  ]
}