{
  "modId": 33057.0,
  "modName": "Dragon Bone Weapons Complete",
  "summary": "Dragon Bone Weapons Complete Set :  Back by actual popular demand.  Does NOT require Dawnguard or replace Dawnguard\\'s weapons.  This was originaly released about 6 months before DG was announced but some people seem to prefer it on Nexus.",
  "descriptionHtml": "Dragon Bone Weapons Complete Set :  Back by actual popular demand.  Does NOT require Dawnguard or replace Dawnguard\\'s weapons.  This was originaly released about 6 months before DG was announced but some people seem to prefer it on Nexus.\r\n\r\n----------------------------------------------------------- \r\n>>>PLEASE READ THE SHORT FAQ AND \\'KNOWN ISSUES\\' SECTIONS<<< \r\n----------------------------------------------------------- \r\n\r\n\r\nAdds craftable Dragon Bone Weapons to Skyrim. These have original models and textures. The purpose of the mod is to make the Dragon Bone Smithing perk worth getting after Deadric Smithing and the weapons are meant to fit in as seamlessly as possible with Bethesda\\'s original Dragon Bone armor. Their damage stats are the same as ebony, with the notable advantages of higher crit/stagger chances, lower weight, and faster swing-speeds. They can be created or tempered with dragon bones, dragon scales, ebony ingots, iron ingots, duct tape, and leather strips, if you have the Dragon Bone Smithing perk. \r\n\r\nIn this pack: \r\n-Sword \r\n-Axe \r\n-Mace \r\n-Greatsword \r\n-BattleAxe \r\n-WarHammer \r\n-Dagger \r\n-Bow \r\n-Arrows / Quiver \r\n\r\nIn Before Before Last Update, 1.02: \r\n- Errant references to daedric weapons removed from .esp file. \r\n- Dagger tempering bug fixed. \r\n- Quiver had wrong spec map, fixed. \r\n- Quiver env. map missing from bsa file, added. \r\n\r\nIn Before Last Update, 1.03: \r\n-Bug with mace\\'s blood splatter fixed. \r\n\r\n\r\nIn Last Update, 1.04: \r\n- Every texture on every weapon slightly improved. \r\n- Normal maps normalized. \r\n\r\nIn This Update, v1.05: \r\n\r\n-Errant references to daedric/ebony weapons removed from .esp file. No idea how they showed up again. \r\n\r\n\r\nFAQ: \r\n\r\nQ - Can I still use the weapons I already crafted from the last two packs? \r\nA - Yes >>BUT!!<< you need to use Wrye Bash (http://skyrim.nexusmods.com/downloads/file.php?id=1840) to convert your save file first. It\\'s pretty easy, really; See instructions below. \r\n\r\nQ - Why switch to a complete pack? \r\nA - I originally had separate packs so I could test them individually. After learning that there is a limit to the number of mods you can have installed, I decided to put them all together, now that they are all done anyway. This is the one that will be getting all future updates. Sorry for the initial confusion. \r\n\r\nQ - Why do these have ebony stats if they\\'re harder to make than Daedric? \r\nA - Because TES lore says nothing is stronger than daedric and the point of this mod is to fit seamlessly into the vanilla game. Anyway, these weapons are faster and have better crit/stagger chance so they\\'re better without doing more damage, which would break lore. \r\n\r\nQ - Do these replace the dawnguard ones? \r\nA - No. They don\\'t replace anything. Dawnguard DragonBone weapons will still be there. \r\n\r\nQ - Can you make me a katana? \r\nA - Go to hell. \r\n\r\nQ - Can I translate your mod into another language and release it OTHERWISE UNCHANGED on another site? \r\nA - Yes but please link back to the original mod page and put a link to my website, ktacreations.com, in the description. Thank you. \r\n\r\nQ - Is this mod compatible with my favorite mod? \r\nA - YOU MEAN THIS ISNT YOUR FAVORITE MOD? Anyway, yeah it only adds things and doesnt change any existing things so it should be fine with any mod that doesn\\'t use the exact same formIDs. \r\n\r\n\r\n--KNOWN ISSUES-- \r\n-Some weapons look larger when sheathed than they do when drawn. I have no idea why. If you have any suggestions, put them in haiku format, print them out and mail them to Churchofsmalldog, C.O.: The Internet, Red Bluff, WI 68260 \r\n-Some have reported weapons not taking custom names when you enchant them. \r\n-Dancing is forbidden. \r\n-If the weapons are invisible, you may need to extract the BSA archive into your data folder, keeping the directory structure intact. This means textures go in data/textures/weapons/dragonbone and the meshes go in data/meshes/weapons/dragonbone. \r\n\r\n\r\n------------------------------------------ \r\nIF YOU ALREADY HAVE THE PREVIOUS TWO PACKS \r\n------------------------------------------ \r\n\r\nThis mod has all the weapons but they\\'re ascribed to THIS .esp file and not the previous files. If you really don\\'t want to have to re-craft your existing dragon bone weapons after switching to this pack from the previous two packs, you can use Wrye Bash to edit the mods that your current save file requires. Follow these steps: \r\n\r\n1 - Download Wrye Bash here: http://skyrim.nexusmods.com/downloads/file.php?id=1840. You may be familiar with it from oblivion and fallout. It\\'s a useful thing to have installed anyway. You\\'re welcome. \r\n2 - Install Wrye Bash and check \\\"Skyrim\\\" when it asks you for what game you wish to install it. It\\'ll probably be the only checkbox. \r\n3 - Run Wrye Bash and open the \\\"Saves\\\" tab. \r\n4 - Here you\\'ll see a list of your saved games. Click on the one you want to load (ideally one you JUST made specifically for this). \r\n5 - In the right panel you\\'ll see a list of the mods that this save game uses. Right click on the entry for one of the previous Dragon Bone Weapon Packs and select \\'Change to...\\' then browse to DragonBoneWeaponsComplete.esp and click OK. Do this for the other pack as well so all the entries for the previous weapon packs now say DragonBoneWeaponsComplete.esp. \r\n6 - There is no step 6. \r\n7 - Click \\'Save\\' button below the list of mods. \r\n8 - Unsubscribe/disable the other two packs and make sure DragonBoneWeaponsComplete.esp is enabled. \r\n9 - Run Skyrim, load the save you edited and see that your weapons are still there even though you switched mods. \r\n\r\nIf you don\\'t care about having to re-forge your dragon bone weapons: \r\n1 - Unsubscribe/disable the other two packs. \r\n2 - Subscribe to this one. \r\n3 - Call your mother; she worries. \r\n4 - Run Skyrim.",
  "categoryId": "55",
  "version": "1.08",
  "author": "ktacreations",
  "createdUnix": "1362873061",
  "updatedUnix": "1362872715",
  "containsAdultContent": false,
  "uploadedBy": "theycallmecheese",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016336",
      "name": "Dragon Bone Weapons Complete",
      "version": "1.08",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15727",
      "fileName": "Dragon Bone Weapons Complete-33057-1-08.zip",
      "uploadedUnix": "1362872715",
      "modVersion": "1.08",
      "virusScanUrl": "https://www.virustotal.com/file/858b737fd8b39082a15732014bba603d29540a7639015070df9694b5e3dbbb7c/analysis/1407461955/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Bone%20Weapons%20Complete-33057-1-08.zip?fid=1000016336&ttl=1535809947&ri=8192&rs=8192&setec=517e2527f70b0fad2c08d635e338e7be"
    }
  ]
}