{
  "modId": 33069.0,
  "modName": "Unleveled Dragonborn Items",
  "summary": "Removes the player's level as a factor in deciding what version of various unique items should be rewarded to the player for various quests, thus ensuring that the highest-level version of that item is rewarded at all times.",
  "descriptionHtml": "[heading][center]Note: This mod is now obsolete. I recommend using [url=http://www.nexusmods.com/skyrim/mods/79023]Unleveled Items[/url] instead.\n<br />\n<br />This mod is intended for Skyrim version 1.9.32.0.8 or higher. Older versions of Skyrim might not work with this mod.\n<br />[color=red]The Dragonborn DLC is required by this mod.[/color][/center][/heading]\n<br />The Unleveled Dragonborn Items mod is a simple, highly compatible mod similar to my [url=http://www.nexusmods.com/skyrim/mods/33062]Unleveled Skyrim Items[/url] mod that fixes the problem of the player receiving inferior versions of various unique items based on the player's level in the Skyrim Dragonborn DLC addon. So now, regardless of the player's level, you will always receive the highest-level version of the various \"leveled\" unique items you get that are specific to the Dragonborn DLC.\n<br />\n<br />As I mentioned above, this mod is designed with compatibility in mind so the only changes it makes are to the 'leveled lists' that determine which version of the items to select. Not only does that method allow for this mod to be installed and uninstalled at will with no side effects, it also allows this mod to be fully compatible with other mods such as the [url=http://www.nexusmods.com/skyrim/mods/71214]Unofficial Skyrim Legendary Edition Patch[/url]. However, as a result of that method, this mod does [i]not[/i] retroactively fix saved games that have already received the lower-level versions of the leveled items; in order to fix those you'll still have to use the console to spawn a copy of the highest-level version of that item and then junk your lower-level copy.\n<br />\n<br />All of the leveled items now fixed by this mod:\n<br />[list]\n<br />[*]Miraak's Sword\n<br />[*]Miraak's Staff\n<br />[*]Miraak (miraak's mask, heavy armor version)\n<br />[*]Miraak (miraak's mask, light armor version)\n<br />[*]Miraak's Robes\n<br />[/list]\n<br />Additionally, the leveled item lists that generate the non-reward versions of Miraak's items for Miraak himself to use during his fights (which may or may not be obtainable) have also been fixed to use their highest level versions.\n<br />\n<br />If I have somehow missed any other leveled items from the Skyrim Dragonborn DLC (I searched through the DLC's data in the Creation Kit but couldn't find any others) then please let me know and I'll get them fixed as well.\n<br />[heading]Installation:[/heading]\n<br />Either use a mod manager (such as [url=http://www.nexusmods.com/skyrim/mods/1334]Mod Organizer[/url]), or copy Unleveled_Dragonborn_Items.esp into the Data subfolder of your Skyrim installation directory and then enable it in the launcher.\n<br />[heading]Uninstallation:[/heading]\n<br />Either remove/disable it in your mod manager, or delete Unleveled_Dragonborn_Items.esp from the Data subfolder of your Skyrim installation directory.\n<br />[heading]Permissions[/heading]\n<br />[list]\n<br />[*]You may not upload this mod to other sites without my permission.\n<br />[*]You may not distribute this mod without my permission.\n<br />[*]You may not include this mod, in whole or in part, inside or alongside other mods without my permission.\n<br />[*]You may not release altered versions of this mod without my permission.\n<br />[*]You may not release translated versions of this mod without my permission.\n<br />[*]If I have not noted something here regarding my mod as needing my permission that does [b][u]not[/u][/b] mean you don't need my permission for it. When in doubt, ask me directly via Personal Message.\n<br />[/list][line]\n<br />And that's all there is to this mod. Enjoy!\n<br />\n<br />My other mods:\n<br />[url=http://www.nexusmods.com/skyrim/mods/33614]Better Standing Stones[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/32761]Better Divine Blessings[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/33016]Better Daedric Blessings[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/33135]Gemstone Recovery[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/79023]Unleveled Items[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/32422]College of Winterhold Shop Fixes - Mage Hoods - Robes - Gloves - Boots - Psiijic - Etc[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/32817]Silda the Unseen Master[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/33326]Better Imperial Luck[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/32284]Hoodswap[/url]",
  "categoryId": "24",
  "version": "1.0",
  "author": "SkylerModder",
  "createdUnix": "1362888679",
  "updatedUnix": "1362888034",
  "containsAdultContent": false,
  "uploadedBy": "SkylerModder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016390",
      "name": "Unleveled_Dragonborn_Items_v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Unleveled_Dragonborn_Items_v1_0-33069-1-0.7z",
      "uploadedUnix": "1362888034",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/80b8d3cf4ee651e40330d0a1b4bf50b738005c3fe26239828735d12b983ed16f/analysis/1407462261/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unleveled_Dragonborn_Items_v1_0-33069-1-0.7z?fid=1000016390&ttl=1535809960&ri=8192&rs=8192&setec=0aa8ce60b830b5baa99bb27e84800b05"
    }
  ]
}