{
  "modId": 33075.0,
  "modName": "Better Cloth Enchanting",
  "summary": "Makes player enchantments on cloth and jewelry 50% better. \\'Nuff said.",
  "descriptionHtml": "[u][b]Better Cloth Enchanting[/b][/u]\r\nv1.0\r\nDirect any questions or comments to the official forum thread [url=http://forums.bethsoft.com/topic/1448719-better-cloth-enchanting/]here.[/url]\r\nCheck out my other mods for Oblivion and Skyrim [url=http://www.alshammajones.com/?page_id=228]here.[/url]\r\n\r\n\r\nBetter Cloth Enchanting is a super-simple mod to make going unarmored a little more appealing: by boosting the power of player-made enchantments on clothes and jewelry by 50%!\r\n\r\n[b]So how does it work?[/b]\r\n\r\nExactly what I said. Any armor enchantment that has a magnitude will be 50% stronger when added to clothing or jewelry. This will work on any enchantment, even ones added by mods. It will work on mod-added clothes, too, as long as the clothes are properly tagged in the CK (This means they have the \\\"ArmorJewelry\\\" or \\\"ArmorClothing\\\" keywords).\r\n\r\n\r\n[b]Uh... That\\'s all?[/b]\r\n\r\nYeah, that\\'s all! I thought about adding different boosts to different material types, like in Morrowind (in Morrowind, the max strength of an enchantment depended on the item you put it on). I may still do that. For instance, give a boost to silver weapons and daedric armor and such.\r\n\r\nThen again, I may not. In either case, the source code is packaged in the .bsa, so if you want to give it a shot, go wild.\r\n\r\n\r\n[b]So how do I install it?[/b]\r\n\r\nIf you\\'re on Steam, subscribe. If you\\'re on Nexus, unzip the most recent file directly into your Data folder.\r\n\r\nTo uninstall... Well, best not uninstall. I don\\'t know if it\\'ll do bad things to your game. Skyrim is weird like that. If you do, just uncheck Better Cloth Enchanting in your mod order and pray to the deity of your choice.\r\n\r\n\r\n[b]Hey, I thought you retired from modding![/b]\r\n\r\nFirst, thanks for asking. It\\'s cool to know you care!\r\n\r\nSecond, well, yeah. I did. But I wanted this feature, and I couldn\\'t find any other mods that added it. Besides, this is a little sneeze of a mod.\r\n\r\n\r\n[b]Anything else I should know?[/b]\r\n\r\nAs always, my mods are a resource (of questionable value, but still, a resource). Feel free to take it apart and learn from it, incorporate these techniques into your own modding, whatever you want. Go wild. Don\\'t need to ask me first, don\\'t need to credit me.\r\n\r\n[i]Unless[/i] you\\'re just re-uploading this mod without making any changes. Then credit is very much appreciated.",
  "categoryId": "75",
  "version": "1.0",
  "author": "opaj",
  "createdUnix": "1362899559",
  "updatedUnix": "1362899409",
  "containsAdultContent": false,
  "uploadedBy": "opaj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016417",
      "name": "Better Cloth Enchanting",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Better Cloth Enchanting-33075-1-0.zip",
      "uploadedUnix": "1362899409",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e0e8697bf1a8556d5c0b0aeb5db973576d9602054e358d8b1d71faed7df70510/analysis/1407462485/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Cloth%20Enchanting-33075-1-0.zip?fid=1000016417&ttl=1535809970&ri=8192&rs=8192&setec=2dc6fddf1fbe2f3467f8844d3d00cb20"
    }
  ]
}