{
  "modId": 33070.0,
  "modName": "Instant Mastery - Speed Level Cheat Mod",
  "summary": "Speed leveling cheat mod. Quickly advance your skills the way you want to with no console commands, scripts, or .bat files.",
  "descriptionHtml": "Ever wanted to create a new character but hate the idea of grinding out all thoes skill levels again? \r\n\r\nWant to be a master of enchanting or smithing without hours spent at the table or forge? \r\n\r\nWant to max out your skills without dealing with messy console commands? \r\n\r\nThen this is the mod for you! \r\n\r\n\r\n[b][u]Further information[/b][/u] \r\n\r\nThis mod adds a cheat chest just inside of Riverwood. Inside the chest you will find many skill books and one spelltome. The spelltome will teach you a spell called \\\"Instant Mastery\\\". This spell will increase the amount of points you gain from reading skill books to ten (10). \r\n\r\nCast the \\\"Instant Mastery\\\" spell then read the other books from the chest to quickly level the skills of your choice. See the step-by-step guide below for a more detailed explanation or watch the video tutorial here: http://www.youtube.com/watch?v=PF7u4r6ZwoQ&feature=youtu.be\r\n\r\nYou may level your skills as much or as little as you choose in increments of ten levels at a time.\r\n\r\nYou could also choose to use this just to speed up a normal adventure. Just learn the spell and ignore the other books in the chest. Then cast the spell before reading skill books you find throughout Skyrim to give your skills an added boost.\r\n\r\n\r\n[b][u]Step-by-Step Guide[/u][/b] \r\n\r\n1. Move your character to Riverwood. \r\n\r\n2. Find the chest just inside the main gate. \r\n\r\n3. Open the chest and take out the \\\"Instant Mastery Spelltome\\\" \r\n\r\n4. Learn the \\\"Instant Mastery\\\" Spell. Note: If this is a new character that was created after this mod was installed they will already know the \\\"Instant Mastery\\\" Spell. \r\n\r\n5. Cast the \\\"Instant Mastery\\\" spell. \r\n\r\n6. Check to make sure the Magic Effect is applied. \r\n\r\n7. Take the books for the desired skills from the chest. \r\n\r\n8. Read the books for the skills you want to level. Each book will increase a skill\\'s level by ten (10). Each book can only be used once. There are nine books for each skill so you can reach 100 in every skill. \r\n\r\n9. Level up! \r\n\r\n10. Distribute Magicka, Health, Stamina, and Perk points on the Skill menu like normal. \r\n\r\n11. Enjoy your newly leveled character!\r\n\r\n\r\n[b][u]Why not just use console commands?[/b][/u] \r\n\r\nIf you use commands like \\\"IncPCS\\\" or \\\"setlevel\\\" then you\\'ll need other commands to raise the perk points, the levels or skill levels, and the Health, Magicka, and Stamina to match what you should have at that level. This will level you up the same way the game does naturally.\r\n\r\nUsing \\\"advskill (skill name) 999999999999\\\" will give you levels, perk points, and skill levels but will only put skills at 100. If you use lower numbers to try to get a specific level it will have unpredictable results. This mod gives you the option to stop at whatever level you want within ten levels without numerous game breaking console commands. \r\n\r\nConsole commands have the potential to break the game if used incorrectly or too aggressively. CTD\\'s and corrupted saves are not uncommon. This .esp file cannot break the game no matter how you use it\\'s contents in the game and the chances of a conflict with another mod are very slim. \r\n\r\nI originally made it for myself as an easy way to create different types of characters, at different levels, and with different skill sets to test out various mods. I thought other players would find it useful for \\'re-rolling\\', increasing a skill like enchanting without the grind involved or console commands, or testing mods like myself so I decided to share it with the community. You may find other uses for it. the choice is yours! \r\n\r\n\r\n[b][u]Install[/b][/u]\r\n\r\nInstall using the Nexus Mod Manager or download and place the \\\"Instant Mastery.esp\\\" into your Skyrim/Data directory.\r\n\r\n\r\n[b][u]Uninstall[/b][/u]\r\n\r\nRemove the \\\"Instant Mastery.esp\\\" into your Skyrim/Data directory.",
  "categoryId": "40",
  "version": "1.0",
  "author": "KahjiitRaj",
  "createdUnix": "1362888905",
  "updatedUnix": "1362888847",
  "containsAdultContent": false,
  "uploadedBy": "KahjiitRaj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016392",
      "name": "Instant Mastery - Leveling Cheat Mod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Instant Mastery - Leveling Cheat Mod-33070-1-0.7z",
      "uploadedUnix": "1362888847",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2efed81f0d5ef26b8c2fad67e4506ba23a19ffa428bc654edc9c36dd6fbf926e/analysis/1407462263/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Instant%20Mastery%20-%20Leveling%20Cheat%20Mod-33070-1-0.7z?fid=1000016392&ttl=1535809961&ri=8192&rs=8192&setec=ac96cba248c4f1652758bc051ca1d8cc"
    }
  ]
}