{
  "modId": 33082.0,
  "modName": "Travel Robes",
  "summary": "Adds 5 robes/tunics to tanning rack under imperial\r\nAdds 2 Chainmail tunic to forge under imperial\r\nOptional file adds outfits to Level Lists of townsfolk/farmers",
  "descriptionHtml": "10 First Seed 4E 202\r\n    \r\n    I have been plagued by exhaustion and vivid feverish dreams ever since landing on this blasted ruin of an island. Its like the way I felt during the miasma episode when I first got to Dawnstar and met Erandur, only a lot more intense. I recently dreamt I was with a nord warrior woman and we were exploring some ruined temple that turned into a daedric realm. Solstheim might as well be a realm of Oblivion in its own right. My memory is turning to into a maze.\r\n    Enough of this place. I need to go back to the mainland as soon as possible. I thought this would be a nice respite from the civil war and craziness going on but its even crazier here. It isn\\'t easy to book passage either. There has only been one other vessel beside the Northern Maiden and it unloaded its cargo and left within two days. Gjuland Salt-Sage is still here but he says he won\\'t return unless he can get some freight to bring back or if I and whoever else wants to leave can come up with 5000 septims to pay him. It cost 500 to get here and he says its because he was coming here anyway, and Morvayn\\'s return shipment has been delayed.\r\n  I am doing my best to gather unrefined gold ore which is somewhat more plentiful here due to the vulcanism. Glover Mallory has written me a letter to bring to an Argonian jeweler in Riftin who will pay well for the unrefined gold. Erandur and I went out together last week to comb through the ashlands, I looking for more gold and he looking for something called heartstone. Apparently it has powerful alchemical properties. He\\'s been spending most of his time in Tel Mithryn, to the east of the island, where there is the tower of a well known Telvanni lord and mage, Neloth of Tel Najje. I tried to visit him there yesterday to tell him I was leaving. You could see the Red Mountain from the shoreline. A haze of ash and ocean mist obscured the giant mushroom citadel as the oil lamps spread their tinted light through the veil. The whole area was an uncanny place indeed. I\\'ve heard of the great mushroom trees of Vvardenfell but it is still a surreal sight to behold. \r\n   One of Neloth\\'s apprentices, Talvas of the House Fathryon, had summoned an ash shade prior to my arrival and lost control of it. He came up on me hurriedly as I made my approach, fearful of his master\\'s anger. He asked me to help dispatch the shade, promising he could make it worth my while. I\\'ve dealt with a few conjured elementals before, but I was still quite nervous. My quiver had an assortment of different arrows, mostly orcish and nordic, but luckily I had a couple prized ebony points which proved effective in expelling the unruly creation. I was able to recover one of the arrows, but the other was lost in the ashbed.\r\n      I had been carrying those arrows ever since I had pulled them from the slain corpse of the dragon Sahloknir at Kynesgrove. They had originally been loosed by the tavern wench Delphine, who claims to be a member of the Blades. I handled them very carefully then, because it was clear from the wounds on the dragon that she had soaked the arrowheads in a tincture of frostbite venom. I felt my fingertips start to go numb through my gauntlet so I wrapped the arrows in a bundle of old linen I had taken the night before from the barrow at Ustengrav. I didn\\'t remove them for nearly three moons until  Erandur and I were preparing for the voyage. We took them out and studied the hard black glass-like substance. I had heard that Solstheim and even moreso Vvardenfell were in their heyday once great sources of ebony. Erandur said that its used in daedric armor, in a form highly refined through magic, alchemy and the dark powers of the daedra themselves. It could easily be used to carve through lesser metals the way iron carves through wood. Ebony is though to be the blood of the ancient heroes, spilled and then petrified over untold aeons. Erandur said that during the centuries of Septim Rule, raw ebony was protected by the high law throughout Tamriel. It was unlawful to be mined or exported without having a charter from Cyrodiil, with unsanctioned trade punishable by death. The ebony mine is still there in Raven Rock, although I don\\'t think there\\'s any more ebony to be had.\r\n    For my trouble dispatching his shade, Talvas wanted to give me a staff of restoration. I had argued that the arrowhead lost was worth equal to or more than the staff, not to mention the risk in fighting a Creature summoned by a Telvanni wizard. He said he had taken me for a mage of Winterhold because of the travel robes I was wearing and because only mages ever come to Tel Mithryn. I explained I was there to see Erandur but he and Neloth had been gone for some hours. \r\n   The apprentice and I supped and I waited but eventually returned to Raven Rock with the staff and a filled black soul gem. There aren\\'t many merchants on the island, and I had difficulty getting rid of the items for a fair price. I am hoping to be able to convince Gjuland to take 1000 septims now and then let me sell the gold to the Argonian. I can sense he wants to leave this place too, so maybe I can get him to bring down his price. Morvayn doesn\\'t seem like he\\'s going to be getting his shipment together anytime soon. I left Erandur a note saying that I will come back in two seasons. I am hoping the horn relic is safe with Ysolda. When I return, I will take it to High Hrothgar and tell the greybeards all that I have witnessed here, with the Cult of the dragon priest, Miraak.\r\n\r\nthanks hothtrooper for the viking chainmail armor",
  "categoryId": "60",
  "version": "1.3",
  "author": "Franklin Zunge",
  "createdUnix": "1362986239",
  "updatedUnix": "1394302722",
  "containsAdultContent": false,
  "uploadedBy": "FranklinZunge",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000022109",
      "name": "Travel Robes",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50940",
      "fileName": "Travel Robes-33082-1-3.7z",
      "uploadedUnix": "1364996373",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/4f9c54f5ed5d46bac0728ad454fb6b23880c00609f7d72677a4f2da8421b5362/analysis/1407503485/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Travel%20Robes-33082-1-3.7z?fid=1000022109&ttl=1535809980&ri=8192&rs=8192&setec=fb25ceb03782ed17a5c26acc986916a1"
    },
    {
      "fileId": "1000022110",
      "name": "Travel Robes BSA",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57681",
      "fileName": "Travel Robes BSA-33082-1-3.7z",
      "uploadedUnix": "1364996676",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/3feff28c504eba9cd0945bb99ad7f19ef916a5191aa8056acfa2a2a287314c35/analysis/1407503503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Travel%20Robes%20BSA-33082-1-3.7z?fid=1000022110&ttl=1535809981&ri=8192&rs=8192&setec=759a1bd4d9d4b21a8c6219842f8e88cb"
    },
    {
      "fileId": "1000022112",
      "name": "Travel Robes Level List",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "50945",
      "fileName": "Travel Robes Level List-33082-1-3.7z",
      "uploadedUnix": "1364997002",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/c3045814c2cacced5540a062c9eefdd95b0974040d4725144237635fd6889707/analysis/1407503514/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Travel%20Robes%20Level%20List-33082-1-3.7z?fid=1000022112&ttl=1535809981&ri=8192&rs=8192&setec=4391e07ce2cfe3708165a9cedd26a739"
    },
    {
      "fileId": "1000022114",
      "name": "Travel Robes Level List BSA",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "57682",
      "fileName": "Travel Robes Level List BSA-33082-1-3.7z",
      "uploadedUnix": "1364997283",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/32056bd7f7e02a1ae1731d012cdc80c61faa8bdc39a8eba259fc97f5ba39705a/analysis/1407503557/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Travel%20Robes%20Level%20List%20BSA-33082-1-3.7z?fid=1000022114&ttl=1535809981&ri=8192&rs=8192&setec=72551309b127fc0d2404650eba7c10bf"
    },
    {
      "fileId": "1000100373",
      "name": "missing normal map for long robes",
      "version": "",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "623",
      "fileName": "missing normal map for long robes-33082-.7z",
      "uploadedUnix": "1394302722",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3a619ebc55e4c4209adc24a111fd4ab94eab14c53f47ed23ecd661aea7292cb4/analysis/1407965337/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/missing%20normal%20map%20for%20long%20robes-33082-.7z?fid=1000100373&ttl=1535809982&ri=8192&rs=8192&setec=d8c13c370d4a87e190fe1bd5f7ba43d8"
    }
  ]
}