{
  "modId": 33110.0,
  "modName": "Mortals Revenge",
  "summary": "The weapon fit for a hunter of the undead. I present to you: Mortal\\\\\\'s Revenge!!!",
  "descriptionHtml": "Mortal\\'s Revenge (no, not \\'\\'Morthal\\'\\'. I mean \\'\\'Mortal\\'\\' as in the opposite of undead which is living and being a subject to death) is a woodchopping axe with some special abilities. It\\'s enchanted with the same enchantment as Dawnbreaker. When it hits, it sets the target on fire and, if the enemy is and undead, it will cause an explosion, damaging other undead too. This makes Mortal\\'s Revenge the perfect weapon for taking out several skeletons or Draugr quickly. It\\\\\\'s also effective against vampires as they are very vulnerable to fire. \r\n\r\nThe weapon is both smithable and temperable and can be found under the Misc. Section (I don\\'t know how to change which section it appears under)\r\n\r\nCreator\\'s Note:\r\nMy original idea was to make a weapon that caused sun damage just like Auriel\\'s Bow with Sunhollowed Arrows but I didn\\'t find any enchantment of that kind in the creation kit. If anyone knows how apply sun damage to weapons in the Creation Kit, I would really appreciate it if you told me. Also, I\\'m at the moment very busy and today (the day I uploaded this file), I didn\\'t have the time to take some screenshots of the axe. The only difference in appearence between the normal axe and Mortal\\\\\\'s Revenge is that this axe glows red. If you, the users of this mod, could take some pictures for me, I\\'d be very grateful!\r\n\r\n",
  "categoryId": "55",
  "version": "1.0",
  "author": "TarTelcontar",
  "createdUnix": "1362946030",
  "updatedUnix": "1362945911",
  "containsAdultContent": false,
  "uploadedBy": "TarTelcontar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016552",
      "name": "Mortals Revenge",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Mortals Revenge-33110-1-0.rar",
      "uploadedUnix": "1362945911",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1623de1b562bc12a3cc0de6d537e8fb87a5454fadee05510e343c59ee717fc66/analysis/1407463535/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mortals%20Revenge-33110-1-0.rar?fid=1000016552&ttl=1535810022&ri=8192&rs=8192&setec=f2d5be54bb9e860338e8c68b0c7332be"
    }
  ]
}