{
  "modId": 33114.0,
  "modName": "Colovian Brandy at Thalmor Embassy",
  "summary": "Adds obtainable Colovian Brandy to the Thalmor Embassy.",
  "descriptionHtml": "It always struck me as strange during the quest Diplomatic Immunity that even though Elenwen says she would never serve anything other than the finest at her parties, the cellar immediately behind the bar contains only standard Nord Mead, Wine, and a few bottles of Alto Wine.  For that matter, it would seem the entire Embassy is stocked only with Nord Mead, Ale, Wine, and Alto Wine.  Which cellar does Malborn retrieve \\\"more colovian brandy\\\" from?  \r\n\r\nThis is a little mod that replaces some of the Alto Wine with Colovian Brandy, standard Wine with Cyrodillic Brandy, and Nord Mead with Honningbrew Mead.  There is also a chest somewhere in the Embassy containing a larger stash of Colovian Brandy and Cyrodilic Brandy imported fresh from Cyrodil.  There are two \\\"types\\\" of Colovian Brandy - both are identical in effect, appearance, weight, and cost to the quest item you obtain from Malborn or Brelas.  One of them has the same appearance as the original Colovian Brandy, the other has the straw base.  These are totally \\\"new\\\" beverages, in that they are not a duplicates of the quest item \\\"Colovian Brandy\\\" and so should not cause any errors.  \r\n\r\nMaster files this mod depends on are Skyrim.esm and Update.esm.  (If you are playing Skyrim you ought to have these master files anyway.)  ",
  "categoryId": "78",
  "version": "",
  "author": "EnlilofNippur",
  "createdUnix": "1362947389",
  "updatedUnix": "1362947376",
  "containsAdultContent": false,
  "uploadedBy": "EnlilofNippur",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016561",
      "name": "ColovianBrandyAtThalmorEmbassy",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "ColovianBrandyAtThalmorEmbassy-33114-.rar",
      "uploadedUnix": "1362947376",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5c1f37226a11cf0abbe0f469e87b1d01fe957f147d99f41db61dc1f4e230fc9e/analysis/1407463570/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ColovianBrandyAtThalmorEmbassy-33114-.rar?fid=1000016561&ttl=1535810028&ri=8192&rs=8192&setec=4018bac9e90455f4e2b1ea8637ed987e"
    }
  ]
}