{
  "modId": 33136.0,
  "modName": "Elevage de destriers plus pratiques - Convenient Horse Herding - Traduction francaise",
  "summary": "Chaque cheval que vous possédez ou chevauchez fera dorénavant partie intégrante de votre élevage ! Choisissez un endroit pour établir votre campement ou devenez le meneur de votre horde, renommez vos chevaux et achetez des chiens de garde pour protéger votre élevage. Nécessite SKSE, et conçu avec des Destriers plus pratiques.",
  "descriptionHtml": "Suite à d\\'autres priorités, à pas mal de problèmes liés à certaines mises à jour et à l\\'absence de réponse d\\'Alek quant à son autorisation pour des modifications autres que celles de l\\'.esp, j\\'ai abandonné la traduction des scripts de ce mod. Si quiconque souhaite l\\'utiliser pour la compléter, demandez-moi simplement ! Vous devrez également obtenir l\\'autorisation d\\'[url=http://skyrim.nexusmods.com/users/621184]Alek[/url], vous aurez peut-être plus de chance que moi.\r\n\r\n[color=red][size=3]Pour utiliser ce mod, devez tout d\\'abord installer [url=http://skyrim.nexusmods.com/mods/26704]Convenient Horse Herding[/url] dans sa version originale, et remplacer le fichier .esp d\\'origine par celui-ci.[/color]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/26704][img]http://static.skyrim.nexusmods.com/images/621184-1352563887.jpg[/img][/url]\r\n\r\n[center][b]Également disponible sur[/b][/size]\r\n[url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/elevage_de_destriers_plus_pratiques.php][img]http://www.confrerie-des-traducteurs.fr/forum/styles/3myl_parchemin/imageset/Laconf.png[/img][/url][/center]\r\n\r\n[center][size=3]Ce mod est une traduction du mod original de [url=http://skyrim.nexusmods.com/users/621184]Alek[/url], [b][url=http://skyrim.nexusmods.com/mods/26704]Convenient Horse Herding[/url][/b].[/size]\r\nIl a été conçu avec [url=http://skyrim.nexusmods.com/mods/14950]Convenient Horses[/url], dont vous pourrez trouver une traduction par [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/destriers_plus_pratiques.php]ici[/url] (merci [url=http://skyrim.nexusmods.com/users/2235573]Oaristys[/url] pour la traduction). Je vous recommande donc [b]vivement[/b] d\\'utiliser ce mod : non seulement cela apporte à l\\'Élevage de destriers plus pratiques des options supplémentaires, mais en plus il est simplement génial.\r\nD\\'ailleurs, si vous souhaitez [i]endorser[/i] un travail, [i]endorsez[/i] celui de Alek. [i]Endorser[/i] ce mod m\\'encouragera simplement à traduire d\\'autres mods.[/center]\r\n\r\n\r\n[center][url=http://skyrim.nexusmods.com/mods/28680][img]http://www.ushareimg.com/images/286T3R.png[/img][/url][/center]\r\n\r\n\r\n[heading]Possibilités[/heading]\r\n[list]\r\n[*] Gérez facilement votre élevage, et ce jusqu\\'à 30 destriers.\r\n[*] Changez le nom de vos destriers, choisissez le nom que vous voulez.\r\n[*] Choisissez l\\'emplacement de votre élevage, afin que tous vos destriers se trouvent à un seul endroit.\r\n[*] Devenez le meneur de votre élevage ; alors, tous vos chevaux voyageront avec vous.\r\n[*] Effectuez un voyage rapide jusqu\\'à l\\'emplacement de votre élevage grâce au marqueur de carte dynamique.\r\n[*] Les chevaux non uniques se verront attribués des noms donnés au hasard lorsqu\\'ils rejoindront votre élevage.\r\n[*] Achetez jusqu\\'à trois chiens de garde afin de protéger votre élevage.\r\n[*] Intègre l\\'option Destrier - Appel de Destriers plus pratiques si Convenient Horses est installé.\r\n[/list]\r\n\r\n[heading]Quelques détails que vous devriez connaître[/heading]\r\n[list]\r\n[*] Les versions de Skyrim v1.8.151.0.7 ou plus et de Skyrim Script Extender v1.6.5 ou plus sont requises afin de faire fonctionner ce mod.\r\n[*] Ce mod change de façon irréversible les noms des chevaux qui rejoignent votre élevage. Tous les chevaux du nom de \\\"Cheval du joueur\\\" verront leur nom changé en \\\"Cheval\\\", ce qui restera même une fois le mod désinstallé. Ceci est nécessaire pour que vous puissiez nommer vos chevaux.\r\n[*] Si vous utilisez une version non anglophone de Convenient Horses, votre cheval ne se verra pas attribué un nom unique mais simplement renommé \\\"Cheval\\\". [size=1](À vérifier, parce que ça m\\'étonne quand même.)[/size]\r\n[*] Au départ, l\\'élevage de chevaux était développé comme partie intégrante de Convenient Horses, mais l\\'auteur a décidé de le sortir séparément, afin que Convenient Horses ne nécessite pas SKSE pour fonctionner, et pour que les chevaux possédés n\\'aient pas tous leur nom changé en \\\"Cheval\\\".\r\n[/list]\r\n\r\n[heading]Démarrer[/heading]\r\n[b][u]Installation[/b][/u]\r\n1. Mettez Skyrim à jour vers la version 1.8.151.0.7 au minimum.\r\n2. Installez SKSE, ou mettez-le à jour vers la version 1.6.5 ou plus.\r\n3. Téléchargez et installez [url=http://skyrim.nexusmods.com/mods/26704]Convenient Horse Herding[/url].\r\n4. Téléchargez et installez ce mod. Remplacez le fichier [b]Convenient Horse Herding.esp[/b] du mod original par celui-ci !\r\n\r\n[b][u]Désinstallation[/b][/u]\r\n1. Ouvrez la console et tapez [b][i]StopQuest CHHerding[/b][/i].\r\n2. Sauvegardez.\r\n3. Désinstallez le mod.\r\n\r\n[b][u]Chargement[/b][/u]\r\nDès que vous aurez chargé votre jeu avec ce mod d\\'installé, vous verrez le dernier cheval que vous avez \r\nchevauché ajouté à votre élevage en premier. Afin d\\'ajouter d\\'autres chevaux à votre élevage, vous n\\'aurez qu\\'à les monter. Si un cheval n\\'a pas déjà un nom unique, il se verra attribué un nom au hasard que vous pourrez changer plus tard. En dehors de cette attribution d\\'un nom unique, rien de nouveau n\\'arrivera jusqu\\'à ce que vous achetiez de l\\'Équipement d\\'élevage auprès n\\'importe quel maître d\\'écuries.\r\n\r\n[heading]Descriptions des différentes options[/heading]\r\n[b][u]Équipement d\\'élevage[/b][/u]\r\nUne fois que vous aurez acheté l\\'Équipement complet d\\'élevage (à savoir le sac à dos et le drapeau), il vous sera immédiatement équipé. Votre capacité de port augmentera de 100 points lorsque vous porterez cet équipement. C\\'est maintenant le moment de décider où vous désirez établir votre élevage ! Juste devant votre propriété, ou dans les étendues sauvages de la toundra ? Le choix est vôtre. Notez cependant que vous ne pourrez établir votre campement que dans la zone extérieure principale, à savoir Bordeciel. Pour marquer l\\'emplacement de votre élevage, déposez simplement votre Équipement d\\'élevage au sol. Si toutes les conditions requises sont remplies, il sera planté en face de vous, et votre sac à dos vous sera rendu sous le nom d\\'Équipement basique d\\'élevage (à savoir le sac à dos, sans le drapeau) afin que vous conserviez une capacité de port augmentée. Si vous ne marquez pas l\\'emplacement et ne portez pas l\\'Équipement d\\'élevage, vos chevaux attendront simplement à l\\'endroit où ils se trouvent, et si vous rangez votre équipement à un autre endroit, ils retourneront là où vous les avez trouvés.\r\n\r\n[b][u]Drapeau de horde[/b][/u]\r\nLe drapeau marque l\\'emplacement de votre élevage, où tous vos chevaux se rassembleront. Il lui est attribué un marqueur de carte, grâce auquel vous pouvez effectuer un Voyage rapide. Activez le drapeau pour gérer votre élevage, à savoir pour renommer ou relâcher un cheval. Vous pouvez également ramasser le drapeau afin de changer l\\'emplacement de votre élevage.\r\n\r\n[b][u]Renommer un cheval[/b][/u]\r\nVous pouvez commencer la procédure pour renommer un cheval via le menu de gestion de l\\'élevage du drapeau. Tout sera fait au travers d\\'un système de dialogue, afin que vous n\\'ayez pas besoin d\\'un clavier. Un dialogue de sélection d\\'un cheval sera montré en premier, afin que vous choisissiez le cheval que vous souhaitez renommer. Une fois votre cheval sélectionné, une nouvelle boîte de dialogue apparaîtra afin que vous composiez un nouveau nom, de 3 à 40 caractères. Afin de composer le nom, utilisez l\\'ensemble des options de dialogue et validez quand vous aurez terminé.\r\n\r\n[b][u]Relâcher un cheval[/b][/u]\r\nCette option est également disponible via le menu de gestion de l\\'élevage du drapeau. Choisissez l\\'un des chevaux de votre élevage. Ne relâchez pas le dernier cheval que vous avez monté, il serait automatiquement ajouté à nouveau à votre élevage.\r\n\r\n[b][u]Chiens de garde[/b][/u]\r\nVous pouvez acquérir jusqu\\'à 3 chiens de garde auprès de n\\'importe quel maître d\\'écuries. Leur seul rôle sera de protéger votre élevage des menaces, et en aucun cas de vous aider durant un combat. Les chiens essaieront de rester autant que faire se peut avec l\\'élevage, et patrouilleront au hasard entre les chevaux. Ils sont définis comme Essentiels et ne peuvent donc pas mourir. Pour chaque chien acquis, tous les chevaux de votre élevage se verront attribué un bonus de 3% de régénération de santé et fuiront toute menace. La seule exception est le cheval que vous montez actuellement, qui ne recevra pas de bonus et ne sera pas affecté par le comportement de l\\'élevage. Pour gérer le comportement de ce cheval, je conseille d\\'utiliser [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/destriers_plus_pratiques.php]Destriers plus pratiques[/url], ou n\\'importe quel autre mod de contrôle du comportement des montures.\r\n\r\n[b][u]Équipement égaré[/b][/u]\r\nSi jamais vous perdez votre équipement, vous pouvez parler à n\\'importe quel maître d\\'écuries pour le récupérer. Si votre équipement est perdu ou détruire de façon permanente, recommencez la quête par une commande console : ouvrez la console, tapez [b][i]StopQuest CHHerding[/b][/i] puis [b][i]StartQuest CHHerding[/b][/i].\r\n\r\n[b][u]Intégration de Destriers plus pratiques[/b][/u]\r\nAppeler et monter les chevaux de votre horde n\\'a jamais été plus facile. Si vous utilisez le mod [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/destriers_plus_pratiques.php]Destriers plus pratiques[/url] dans sa version 4.5 ou plus, utilisez le pouvoir [i]Destrier - Appel[/i] tout en étant en mode discrétion afin d\\'appeler n\\'importe quel cheval de votre élevage.\r\n\r\n[b][u]Compatibilité[/b][/u]\r\n[list]\r\n[*] Ce mod modifie la quête \\\"stables\\\" (\\\"étables\\\") afin de pouvoir modifier les noms des chevaux. Si un mod modifie la même quête, placez-le avant ce mod-ci, sans quoi vous pourriez pas pouvoir renommer vos chevaux.\r\n[*] Ce mod fonctionne avec tous les chevaux, que ceux soient ceux du jeu [i]Vanilla[/i] ou ceux d\\'autres mods, SAUF les chevaux invoqués.\r\n[*] Ce mod est conçu pour fonctionner avec le mod [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/destriers_plus_pratiques.php]Destriers plus pratiques[/url].\r\n[/list]\r\n\r\n\r\n[b][u]Permissions[/b][/u]\r\n\r\nCe mod est le fruit du travail de [url=http://skyrim.nexusmods.com/users/621184]Alek[/url]. Si vous désirez l\\'utiliser de quelque façon que ce soit, c\\'est lui que vous devez contacter. Si vous désirez utiliser [i]également[/i] la traduction, contactez-moi.\r\n\r\nThis mod is the exclusive work of [url=http://skyrim.nexusmods.com/users/621184]Alek[/url]. If you want to use it in any way, you must ask him. If you [i]also[/i] want to use the translation, ask me.\r\n\r\n\r\n[b][u]Credits[/b][/u]\r\n[list]\r\n[*][url=http://skyrim.nexusmods.com/users/621184]Alek[/url], l\\'auteur de ce mod dont ma modeste contribution en est la traduction.\r\n[*][url=http://skyrim.nexusmods.com/users/417719]Epervier 666[/url], pour son excellent [url=http://skyrim.nexusmods.com/mods/29457]ESP-ESM Translation[/url], grâce auquel j\\'ai traduit ce mod.\r\n[/list]",
  "categoryId": "83",
  "version": "1.1",
  "author": "Alek and Hydroel",
  "createdUnix": "1363000474",
  "updatedUnix": "1364995833",
  "containsAdultContent": false,
  "uploadedBy": "Hydroel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000022106",
      "name": "v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "v1_1-33136-1-1.zip",
      "uploadedUnix": "1364995833",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/184a000fe892fbf069d39fa4614c307e4e7fe93f02f61565a9331d82ca28515c/analysis/1407503471/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/v1_1-33136-1-1.zip?fid=1000022106&ttl=1535810062&ri=8192&rs=8192&setec=98a1aef33be69e30b13e107132541eac"
    }
  ]
}