{
  "modId": 33141.0,
  "modName": "Populated Prisons",
  "summary": "Fills the prisons of Skyrim with prisoners. After all, what&#39;s the point of so many cells if they are unused?",
  "descriptionHtml": "Did you ever feel that the prisons and dungeons of Skyrim were underpopulated? I know I did, especially seeing how many cells there are and the amount of crime and bandits in the Province. I looked about, but couldn&#39;t find any mods to fix the issue, so I decided to made it myself. \r<br />\r<br />FEATURES:\r<br />\r<br /> - 18 Prisoner NPCs have been placed in cells and torture rooms around Skyrim, in all Hold Capitals except Winterhold and Markarth.\r<br /> - A map marker to The Chill, the Winterhold prison, as it really annoyed me there weren&#39;t one. \r<br /> - Dragonsreach Dungeon have gotten itself a torture room with a prisoner inside. \r<br /> - Tortured prisoners have been added to some of the torture rooms already in the game. \r<br /> - Changed Morthal Jail to add another cell, and make some variation in how the prisons looked. \r<br /> - Slighty edited the NPC called Sabjorn, so he hopefully won&#39;t leave his cell like he used to. \r<br /> - A few skeletons and blood splatters where I felt it fit. \r<br /> - Gave the dead prisoner in Dragonsreach Dungeon some pants, the poor man\r<br />\r<br />COMPATIBILITY:\r<br />\r<br />Will most likely conflict with anything that edits any of the prisons, except Cidhna Mine. \r<br />Will conflict with anything that edits Sabjorn or his AI Packages.\r<br />Otherwise, it should run well with few to none conflicts. \r<br />\r<br />NOTES:\r<br />\r<br />I have not added any prisoners to Cidhna Mine, the Markarth prison and The Chill, the Winterhold prison. This was to make it work better with the quests at Cidhna Mine, and because I didn&#39;t feel The Chill and Winterhold were big enough to need more prisoners. I&#39;ve added yet a skeleton though, if that helps. \r<br />\r<br />I am no longer working on this mod and I won&#39;t ever do so again. I will however upload a SE-version sometime. ",
  "categoryId": "33",
  "version": "1.0",
  "author": "Stigwa",
  "createdUnix": "1363012914",
  "updatedUnix": "1363012436",
  "containsAdultContent": false,
  "uploadedBy": "Stigwa",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016720",
      "name": "Populated Prisons",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Populated Prisons-33141-1-0.rar",
      "uploadedUnix": "1363012436",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/17e3bbf592f95e77ca0966b039604c820fa654dc05c37efd150acdb4e8d4d622/analysis/1407464617/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Populated%20Prisons-33141-1-0.rar?fid=1000016720&ttl=1535810068&ri=8192&rs=8192&setec=5b0e10a18f511d4d10243c56b97781e8"
    }
  ]
}