{
  "modId": 33163.0,
  "modName": "Skyrim Item Compendium",
  "summary": "This is an Excel database of almost all the items in the Skyrim universe, including DawnGuard and HearthFire with the addtional DragonBorn Added Id codes, map, Ladies of Skyrim.",
  "descriptionHtml": "This is an Excel database of almost all the items in the Skyrim universe, including DawnGuard and HearthFire with the addtional DragonBorn ID Codes.\r\n\r\nPlease see enclosed images for the contents page.\r\n\r\nThis has been compiled from many sources and many long hours of routing inside the Skyrim programming to find the relevent ID codes.\r\n\r\nThis ID Codes Compendium 2.0 was painstakingly compiled by\r\n\r\nthealien2000uk\r\n\r\na long time player of all the Elder Scrolls games.\r\n\r\nThis is a continuing project to compile all the the codes for all of the elements of\r\nThe Elder Scrolls V: SKYRIM game.\r\n\r\nPlease note that this compilation is not finished yet and some elements may be repeated, missing or wrong, and some of the formatting of some codes has messed up due to the expotential formula of the cells, never the less this compilations has taken many hours of work.\r\n\r\nIf you feel that you would like more information or you know of sections I have missed out, or just wish to comment or just praise my hard work and dedication Please post a message in the Forum of this download and I\\'ll endevour to enter the required ID codes and update the file.\r\n\r\nPlease endorse this program if you like it.\r\n",
  "categoryId": "39",
  "version": "2.3",
  "author": "thealien2000",
  "createdUnix": "1363037864",
  "updatedUnix": "1370122976",
  "containsAdultContent": false,
  "uploadedBy": "thealien2000uk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032394",
      "name": "Skyrim Item Compendium",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "79243",
      "fileName": "Skyrim Item Compendium-33163-2-3.zip",
      "uploadedUnix": "1370122976",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/b4c349a453abf902e29566b12c05bb4480a9ef4e1c10c6830801e5035e2c7024/analysis/1407589020/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Item%20Compendium-33163-2-3.zip?fid=1000032394&ttl=1535810119&ri=8192&rs=8192&setec=3bcf1805584c0fff27fa2815ceb28f68"
    }
  ]
}