{
  "modId": 33165.0,
  "modName": "Miraak Un-Suckified - Light Armor Edition",
  "summary": "Are you sick of Miraak dropping a bunch of equipment that seems like he stole it from the lost and found bin at Oblivion\\'s local Wal-Mart? Of course you are. We all are.",
  "descriptionHtml": "[color=red]Much like the original version, this light armor version just makes me so sad. It doesn\\'t work any better than the first one, because it\\'s really just an extension of said one. It\\'s all really very sad. But turn that frown sideways, because there\\'s a new version on the way very, very soon. So both of you who actually installed this mod, just stay tuned.[/color]\r\n\r\n[center][b][size=4]Miraak Un-Suckified - Light Armour Edition[/size][/b]\r\n[i]or: You\\'re quite all over the place with your Armour selection, Mr. Miraak!\r\nor: The Hyac Miraak LiteArm Implementation[/i]\r\n~ By Hyacathusarullistad [Hi-ACK-a-THUSS-a-RUL-iss-Tad] ~ [/center]\r\n\r\n[b]Note: anyone interested in and willing to get some better screenshots for this is totally welcome and encouraged to do so. Because mine... well it doesn\\'t really... it doesn\\'t [i]exactly[/i] capture... it just nee--well it blows. Screenshots are not my forte. Help me Skyrim modding community, you\\'re my only hope![/b]\r\n\r\nSo. You\\'re back. Just as I knew you would be. You saw [url=http://skyrim.nexusmods.com/mods/32961/]the first version[/url] and thought to yourself \\\"Hyac, you\\'re lame. Your mod is bad and you should feel bad\\\". And if that\\'s the case, I\\'d just like to say that you\\'re an ungrateful, weiner-nosed little git and don\\'t deserve my mods. If however you\\'re here because you actually enjoyed and appreciated my first version and want to see what I\\'ve done next, then welcome! You\\'re the pinnacle of geniality and I wish you nothing but good fortune and cake. Or pie, if you prefer. Though I can\\'t imagine why you would.\r\n\r\nANYWAY. When I released the leveled Miraak loot mod, I knew that it wouldn\\'t please everyone. In fact, it probably didn\\'t please anyone all that much at all. And once a few people pointed out a few things, I realised that there were whole possibilities I hadn\\'t considered yet. And I really liked some of those possibilities. I hated some of them too, of course... but just because your ideas suck doesn\\'t mean you do. So don\\'t stress over it. \r\n\r\nThe second stage of the Hyac Miraak Item Overhaul tries to resolve Miraak\\'s tendency to choose random armour pieces to wear around Apocrypha. I dunno who decided giving him clothes, light armour, and the possibility of a heavy armoured helmet was a good idea, but they were wrong. It was not a good idea. It was actually a pretty sucky idea. Almost as sucky an idea as dog sweaters, or microwaveable cupcake mix. Seriously, has anyone gotten those things to work right? I always end up with a gritty, coacoa flavoured sponge. Hardly an acceptable replacement, despite the convenience. BUT THIS ISN\\'T ABOUT CAKE. I\\'ve resolved the issue with Miraak\\'s equipment coming out all in a jumble. He\\'ll now drop a standard, [i]unleveled[/i] set of light armour. But wait, there\\'s more! In addition to changing all the equipment into light Armour, I\\'ve made each and every one of them temperable as well! Yaaaaay! You\\'ll need ebony and a Daedra heart to temper the mask; and ebony, moonstone, and leather strips to temper the cuirass, gloves, and boots. And of course, Arcane Blacksmithing is required to temper any of them.\r\n\r\nIn addition to the temperable light armour versions of everything, you\\'ll also find a shiny new texture for Miraak\\'s Chainmail. In fact, you\\'ll find two new textures for it. The default replacement is similar in colour to the vanilla robes themselves, while the second variant turns the chainmail a golden colour. These retextures took me the better part of two days to finish. Two. Freaking. Days. And that\\'s not working on it for a few hours after work or tinkering away between workouts (ahahaha). No, that\\'s two off days devoted to these textures. If you don\\'t like them for whatever reason I\\'ve included the original vanilla texture as well, but... I\\'ll know. And I\\'ll cry womanly tears.\r\n\r\nOh yeah. In case you want to know (why can\\'t you just load up the game and be surprised? It\\'d be a lot less typing for me), the specific stats are roughly comparable to dragonscale, and are as follows:\r\n\r\n[list][size=2][b][i]Mask[/i][/b][/size]\r\n[*]Armour = 22\r\n[*]Weight = 6\r\n[*]Value = 1900\r\n[*]Enchantment = Shout Recovery +30%, Magicka +60pts, MagReg +25%[/list]\r\n[list][size=2][b][i]Chainmail[/i][/b][/size]\r\n[*]Armour = 41pts\r\n[*]Weight = 9pts\r\n[*]Value = 1550 septims\r\n[*]Enchantment = Dragon/Spell Absorb 20%[/list]\r\n[list][size=2][b][i]Gloves[/i][/b][/size]\r\n[*]Armour = 11pts\r\n[*]Weight = 1.5pts\r\n[*]Value = 700\r\n[*]Enchantment = AbsorbDragonBoost 10%[/list]\r\n[list][size=2][b][i]Boots[/i][/b][/size]\r\n[*]Armour = 11pts\r\n[*]Weight = 1.5pts\r\n[*]Value = 700\r\n[*]Enchantment = AbsorbDragonBoost 10%[/list]\r\n[list][size=2][b][i]Sword[/i][/b][/size]\r\n[*]Damage = 12\r\n[*]Weight = 3\r\n[*]Speed = 1.2\r\n[*]Reach = 1.1\r\n[*]Value = 1500\r\n[*]Enchantments = Absorb Stamina, 25pts @ 55 charges[/list]",
  "categoryId": "27",
  "version": "1.SAD",
  "author": "Hyacathusarullistad",
  "createdUnix": "1363042257",
  "updatedUnix": "1363040738",
  "containsAdultContent": false,
  "uploadedBy": "Hyacathusarullistad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016799",
      "name": "HyacMiraakLiteArm",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7648",
      "fileName": "HyacMiraakLiteArm-33165-1-1.rar",
      "uploadedUnix": "1363040738",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e639701190dfce6b5d77fe5c4ae37fa58009fbfc37df48f005ac3ab83b622cae/analysis/1407465140/",
      "changelogHtml": " Seriously, Vanilla Coke. Amazing. <br/> \n Decided to do a more vanilla-feeling texture of the chainmail, and decided I liked it better than the gold. It&#39;s now the primary texture, though both are still included in case other (crazy) people disagree with me. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HyacMiraakLiteArm-33165-1-1.rar?fid=1000016799&ttl=1535810124&ri=8192&rs=8192&setec=c22e685a9ca351e5db853424ff0b482b"
    }
  ]
}