{
  "modId": 33172.0,
  "modName": "Joy of Perspective - Dragonborn Compatability",
  "summary": "This addon/patch converts the Dragonborn armor sets to be compatible with the Joy of Perspective mod by the RFVP team. ",
  "descriptionHtml": "Hi everyone,\r\nThis mod is a Joy of Perspective (http://skyrim.nexusmods.com/mods/6002) compatibility patch for the Dragonborn Armors. You need the original mod for this to work! If you don\\'t already have it, what on earth are you doing here anyway...\r\n\r\nAnyway, note that the three screenshots are not an exhaustive list, but merely there to prove my competency. But if you go in game and see some missing, let me know. \r\n\r\nThe Joy of Perspective mod is fantastic and keeps getting better and more immersive as it goes on. I absolutely loved being able to look down and actually be able to see a body! But then Dragonborn was released, and I was devastated to realize that all those shiny new armors weren\\'t visible from first person. So off I went in search of conversion... which ultimately left me fruitless and dismayed, and with a burning passion to make it happen myself.\r\n\r\nAn hour later, I had the armors working with the help of excellent instructions left by the RFVP mod team. Then, after playing to my hearts content, I started wondering if others might feel the same passion, and if I might spare them the same crushing despair I had felt. So here it is. Note, this is my first attempt at any sort of modding save for creation kit tweaks. I know it works in my game and I\\'m pretty sure I converted every file correctly. But feel free to comment and yell at me if I messed up or missed something :)\r\n\r\nAlso, this is my first Nexus upload. I\\'m mostly, kinda, positive I did it right and it should work with the mod manager, but comment if there\\'s an issue and I\\'ll do some more work to get it right.",
  "categoryId": "78",
  "version": "1.0",
  "author": "Crusader12k",
  "createdUnix": "1363056641",
  "updatedUnix": "1363054917",
  "containsAdultContent": false,
  "uploadedBy": "crusader12k",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016832",
      "name": "Main File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Main File-33172-1-0.7z",
      "uploadedUnix": "1363054917",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/05a4651d6c9efc70d4a1bd1b5a360af11b11e2c07d99df18bdf073bfbf0db97f/analysis/1407465367/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-33172-1-0.7z?fid=1000016832&ttl=1535810142&ri=8192&rs=8192&setec=096145f6201f5c1791986e3218bd1275"
    }
  ]
}