{
  "modId": 33171.0,
  "modName": "Special Companion_ Half Khajjiit and Half Dark Elf",
  "summary": "This mod includes a half and half creature companion mod",
  "descriptionHtml": "Hello everyone, this is my second mod. if you want too see my first mod go to http://skyrim.nexusmods.com/mods/33056/ there you can find some \\\\\\\\\\\\\\\"epic\\\\\\\\\\\\\\\" mods that are in its beta stage. Please take effort and your time too follow the steps and                                                     [b][u]Read the whole description[/u][/b] \r\n\r\n[b][u]Update Coming soon everybody ![/u][/b]\r\n\r\n- Texture mod for the neck too look for realistic \r\n\r\n\r\nBrief Description of Francis the Great:\r\n\r\nFrancis was born on a island called Elsweyr his father was a dark elf named Edwond his father was off on a assassination mission on his soon to be wife, why? because she stole 3 loafs of bread for herself. He then sat on a tree and aimed his ancient bow at her. He then felt something in her that was the meaning of love. Once he made eyes on her from looking through that bow that will kill her. He put down his bow and jumped off the tree and went into the store and bought a sweet role for her. As you may know a dark elf would never do this unless its love at true sight, well guess what? It was love at first site. Once he gave her the sweet role they started too bond and spend lots of time together. Edwond will always surprise her at any given time such as giving her flowers etc. but the most surprising thing was the ring he gave her for marriage. They soon been married and had a child named Francis, yes Francis a very unusual name for a half Dark Elf and half Khajiit. When Francis was 5 he caught his parents fighting about the imperials coming to their house to take everything away ( Imperials were taking over and killing Khajiit\\\\\\\\\\\\\\'s in their own province I know really screwed up ) So anyways while Francis got scared Edwond was scared of the imperials and left his wife and Francis. Soon the imperials came took his mother in his own sight. He never saw his father or mother ever since. Once they raided their house and took Francis and shipped too a nearby jail. They burnt down his house including the village they lived in while he watched. A lot of people would make fun of him for his half and half body, but he still made friends here and there. He watched his whole childhood burn too the ground, while years past in his jail he made friends that would help him mine rocks (He is 18 now) soon him and some of his friends planned a escape route to get out of the jail. He escaped the jail and now needs money, so for money he will become your own companion. \r\n\r\n[b][u]Look at photos for more[/u][/b] \r\n\r\n[b][u]Installation[/u][/b]\r\n\r\n[b][u]Nexus Mod Manager[/u][/b]\r\nPress Open with NMM (Nexus Mod Manager)\r\nEnable the mod in the section \\\\\\\\\\\\\\\"Mods\\\\\\\\\\\\\\\"\r\nCheck the mod so its enabled\r\n\r\n[b][u]Manual Installation[/u][/b]\r\n\r\nDownload the file by pressing \\\\\\\\\\\\\\\"Manual Installation\\\\\\\\\\\\\\\"\r\nOpen the winrar file\r\nDrag the esp. file to Program files -> Steam -> Steam Apps -> Skyrim -> Data -> DRAG !\r\nOpen Skyrim\r\nEnable the mod in data files\r\nPlay and have fun !\r\n\r\n[b][u]Where to find Francis[/u][/b]\r\n\r\n- Sky forge in Whiterun \r\n\r\n\r\n[b][u]Recommended Files[/u][/b]\r\n\r\nUFO COMPANION MOD\r\n\r\n- How will this mod help this mod out? Answer: It will allow you to do so much more things in the dialogue box and allows to look at his stats or just to make him chill out and make stuff. \r\n\r\nWhere can I find this \\\"UFO MOD\\\"? Answer: http://skyrim.nexusmods.com/mods/14037 BOOM !",
  "categoryId": "66",
  "version": "1.8.1",
  "author": "Joseph_Tento",
  "createdUnix": "1363053276",
  "updatedUnix": "1363053018",
  "containsAdultContent": false,
  "uploadedBy": "idevicehelper16",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016827",
      "name": "Companion Mod",
      "version": "1.8.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1433",
      "fileName": "Companion Mod-33171-1-8-1.rar",
      "uploadedUnix": "1363053018",
      "modVersion": "1.8.1",
      "virusScanUrl": "https://www.virustotal.com/file/a31683e7ef7e24161ff0a4a49c03b42838f34f77f9ed6aede37c70e12fcd69cf/analysis/1407465365/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Companion%20Mod-33171-1-8-1.rar?fid=1000016827&ttl=1535810140&ri=8192&rs=8192&setec=971bc5df78ba2c27f2852f384edd4bd9"
    }
  ]
}