{
  "modId": 33176.0,
  "modName": "Duskfall - A Dawnbreaker Companion Blade",
  "summary": "The fallen, darkened version of the Dawnbreaker sword, much more balanced than the other \\\"Dark Dawnbreakers\\\" I\\'ve seen and at least semi-lore friendly. Looks great and has interesting, balanced enchantments. Over 9000 downloads through Steam.",
  "descriptionHtml": "I wanted a blade to go along with Dawnbreaker and act as a dark/night version of it. First skyrim mod so any feedback is appreciated. \r\n\r\nUnlike other \\\\\\\"Duskbreaker\\\\\\\" \\\\\\\"Dark Dawnbreaker\\\\\\\" etc mods, this one is not OP and actually takes a small amount of work to obtain. Its not just \\\\\\\"Get Breezehome, and heres a sword that\\\\\\'ll 1 shot enemies.\\\\\\\" Duskfall is only a slight amount stronger than the original Dawnbreaker (2 or 3 base damage, its extremely close to the original), making it much more balanced in comparison to other mods. \r\n\r\nYou can obtain Duskfall ingame by completing the quest \\\\\\\"Nightfall\\\\\\\" (started by reading a book on the altar at the Kilkreath ruins). There are currently no quest markers (cant figure the damn things out, will be working on that) but there is a map marker for the location of the sword. \r\n\r\nThe enchantments are subject to change if I get suggestions for better ones or more powerful upgrades, so please give me your suggestions for the enchantments on this weapon. \r\n\r\nCurrent Enchantments: \r\n10 Frost Damage \r\n1 second Soul Trap \r\n25% chance to freeze targets solid at night \r\n\r\nCan be upgraded at a grindstone with Ebony Ingots if you have the Arcane Blacksmith perk.\r\n\r\nKnown Bugs:\r\nQuests may not start when you read the book. If this happens, you must just go find the Lair using the information in the book (there wasn\\'t any location pointers anyway, so having the quest wouldn\\'t have helped).\r\n\r\nOver 83,000 Unique Visitors and more than 9000 Downloads through Steam",
  "categoryId": "55",
  "version": "1",
  "author": "Soulsbane96",
  "createdUnix": "1363060835",
  "updatedUnix": "1363060743",
  "containsAdultContent": false,
  "uploadedBy": "Soulsbane96",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016856",
      "name": "Duskfall - A Dawnbreaker Companion Blade",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1678",
      "fileName": "Duskfall - A Dawnbreaker Companion Blade-33176-1.rar",
      "uploadedUnix": "1363060743",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e343ada651f53f70938337ac7c921f85c4d1168edb7b810e286702ea3be1608b/analysis/1407465488/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Duskfall%20-%20A%20Dawnbreaker%20Companion%20Blade-33176-1.rar?fid=1000016856&ttl=1535810149&ri=8192&rs=8192&setec=51d01849fdd93754f205f5e405a2f4fe"
    }
  ]
}