{
  "modId": 33174.0,
  "modName": "Studded Chainmail",
  "summary": "Adds a version of studded armour with chainmail sleeves as forgeable temperable item.\r\nEasy instructions to use as a replacer are contained in the readme tab",
  "descriptionHtml": "12 First Seed 4E 202\r\n       Back on the sea, and much sooner than expected. I was sneaking around earlier tonight, while most of the city slept, wearing a chitin helmet to conceal my face. I managed to pick the lock of a vacant building on the waterfront. I had been intrigued by this building since I landed in Raven Rock, once I had seen the door open a crack and then close just as quickly. It appeared to be a skooma den, with trash and empty bottles littering the floor. The reavers were out marauding no doubt, and luckily for me they had left their stash behind. I found the nearly 50 bundles of moon sugar in an old dusty urn. A potent narcotic, as addictive as it is illegal, moon sugar was the unrefined precursor of skooma and in these quantities, worth a kings ransom. I took the stash straight to the Northern Maiden and told Gjuland that we needed to leave. We could get rid of it as soon as we landed in Windhelm. There were as often as not khajiit caravans set up on the other side of the bridge, and I had sold one of them, an older khajiit named R\\'saad, moon sugar before. He had said if I ever find more to take it straight to him and he would pay me well for it. Gjuland was scared that the Redoran Guard might find out and we\\'d be jailed in their dungeons, never to be seen again. Truth be told I was nervous too. House Redoran is known for its inflexible sense of duty and justice, not for their mercy. I suspect had they found our cargo, we\\'d die in the bulwark dungeons if we were lucky. If not, they\\'d have ropes around our necks before the sun rose. We decided to leave port and send a deckhand in the dory to collect the rest of the crew and some of the gold ore that I hadn\\'t already stowed on the ship, as well as some other personal effects I had left in my room at the Retching Netch.\r\nThey came back and we pulled anchor right as the sun began to rise. \r\nIt was a lucky score and Gjuland knew it too. We\\'d have enough to more than cover the cost of the voyage and that was without the gold included. He could have all the moon sugar profits, as far as I was concerned, I still had the gold ore to take to Mallory\\'s argonian jeweler, and I wanted to be on my way as soon as we landed. Also I didn\\'t need to risk being caught the Windhelm guards any more than I needed to risk it for the Redoran guards. The gold ore would bring me enough septims to get back to Whiterun, so I can get the Horn from Ysolda and then head back east to the Throat of the World via Ivarstead.\r\n\r\nThanks hothtrooper for the chainmail textures.",
  "categoryId": "54",
  "version": "1",
  "author": "Franklin Zunge",
  "createdUnix": "1363055787",
  "updatedUnix": "1363055539",
  "containsAdultContent": false,
  "uploadedBy": "FranklinZunge",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016836",
      "name": "Studded Chainmail - Loose Files",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9785",
      "fileName": "Studded Chainmail - Loose Files-33174-1.7z",
      "uploadedUnix": "1363055452",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1c89470fb3d9577037f91744ea7832ba523ab96c3bad6ee50541fbb6ca3aa6ff/analysis/1407465382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Studded%20Chainmail%20-%20Loose%20Files-33174-1.7z?fid=1000016836&ttl=1535810146&ri=8192&rs=8192&setec=4713e920596ff8808f3fc7b776301dc0"
    },
    {
      "fileId": "1000016837",
      "name": "Studded Chainmail - BSA",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9784",
      "fileName": "Studded Chainmail - BSA-33174-1.7z",
      "uploadedUnix": "1363055539",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/94634d55c590c5d5861a50217105438d027c3fdb01a90c88013a66ec7f500738/analysis/1407465430/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Studded%20Chainmail%20-%20BSA-33174-1.7z?fid=1000016837&ttl=1535810146&ri=8192&rs=8192&setec=5e284ffdc4fb6e0e7a881bf07dc067bf"
    }
  ]
}