{
  "modId": 33185.0,
  "modName": "Lara Croft - The Tomb Raider",
  "summary": "A completely stand-alone mod featuring our lovely Lara Croft from Tomb Raider 2013 by Square-Enix and Crystal Dynamics.",
  "descriptionHtml": "[IMG]http://i73.photobucket.com/albums/i217/Braigus09/cooltext951664198_zps8b0e2495.png[/IMG]\r\n\r\nAdds a completely stand-alone follower based on a recent hit game, Tomb Raider. Lara Croft.\r\n-----------------------------------\r\n\r\nA breton-raised nord of High Rock, a lost orphan. Born of a Breton father and a Nord mother, she was a Daggerfall-born daughter of the late Lord Richter Croft, one of the prestigious members of the Emperor\\'s Elder Council. Although bereft of a mother\\'s love, she was raised well by her loving father, always setting politics aside and putting his daughter first before everything else. \r\n\r\nGrowing up, the young Lara take to a liking to taking up Archery. Everyday she would be up all afternoon training at their backyard shooting range; even training together with her father. She may not be a hardened warrior but she grew up to be a strong independent woman. \r\n\r\nBehind the mask of blissfulness, her father can\\'t deny the growing tension and politics within the Emperor\\'s court. In the aftermath years of the Great War, tensions became full-on conflicts hidden from the eyes of the Emperor. Lara was at Daggerfall while Lord Richter was at the Imperial City. With his influence the most prominent among the Elder Council, he knew it would not be safe for him and his daughter.\r\n\r\nThat fateful day, one anonymous member of the Council hired the remnants of the Dark Brotherhood from Cyrodiil after Lord Richter Croft. The aristocrat knew of this outcome, he knew if he tried, he can\\'t escape the hands of the void from claiming him, but perhaps his daughter could. \r\n\r\nHe sent a hidden missive to his personal couriers to be sent to his daughter, whom is currently at Daggerfall. Hours after the missive was sent, he was claimed by the hands of Sithis within the darkness, courtesy of his children, the Dark Brotherhood. \r\n\r\nThe missive reached her daughter a few days later, telling her to escape High Rock as soon as possible. She insisted on seeing her father but their servants didn\\'t let her because it was too dangerous to go to Cyrodiil. Not to mention staying at High Rock because of the Empire\\'s visage over the province. Once her presence is felt within the borders of the capital, the Council might sent assassins after her. She was then sent aboard the Winter War, a fishing vessel and property of the Crofts, to make her way to Solstheim to meet up with his uncle Crescius. That way she will be safe from the prying eyes of the Council.\r\n\r\nTwo days after their departure, the Winter War immediately met disaster upon the unforgiving tides of the Sea of Ghosts. Their ship was smashed against the towering ice bergs. Lara then woke up after the terrifying ordeal; the whole crew killed in one fell swoop by the sheer force of nature. She realized she was out cold for about 3 days now, as she got out the wreck, she was immediately ambushed by the bandits that took residence at the wreck while she was out. \r\n\r\nBound and tied, one of the bandits attempted to have his way on the knocked-out and defenseless Lara. But before he can even touch her delicate flesh, Lara took advantage and immediately knock the bandit out and went off as fast as she can with her hands still tied. She braved the fierce blizzard, with only adrenaline pumping through her veins. \r\n\r\nNext thing she knew, she found herself laying down by the fire at an inn. Elda Early-Dawn, nursed her back to health. She asked where she was and how she end up here, Elda told her that she was at Windhelm, inside Candlehearth Hall; she found by Brunwulf out cold on the snow. Jora, the priestess of the Temple of Talos, tended her wounds. This she realize, she wasn\\'t able to make it on Solstheim and end up on Skyrim. She is still unable to wander off on her own but for now, she is staying and working at Candlehearth Hall as a cook together with old man Nils.\r\n\r\n(1.2 update)\r\n\r\nThree days later, she fully recovered from her severe injury, since she can\\'t leave for Solstheim yet, she wandered west towards Whiterun hold. It wasn\\'t long before she realized the harsh and unforgiving environment Skyrim had to offer. From wild animals to bandits, it was all too overwhelming for her. \r\n\r\nShe made camp from time to time every passing day, and little-by-little she adapted, she learned. With her patience, she studied how the animals behave and how they hunt. With this accumulated knowledge, she honed her survival skills, her mastery with the bow and even assimilating herself to the cold and to the land itself. \r\n\r\nEver since she was a little girl, she wanted to be an archaeologist and an adventurer. So during her travels, she explored every nordic tomb she would come across. Digging up ancient artifacts for study and of course appraisal for her every day needs. Since she doesn\\'t have the money to afford books, she acquires it by sneak-salvaging bandit camps, abandoned ruins, and bartering with Khajiit caravans. \r\n\r\nAfter weeks exploring the wild, she settled down and made camp at the top of Borgas Hills, north of the ruined Fort Greymoor.  Where she would train and hone her hunting skills, collecting pelts for money and studying salvaged books and relics. It may not be the life meant for her but it is something she always wanted to do. \r\n\r\n[b]THE OAKHEART[/b]\r\n\r\nA family heirloom of the Crofts. A bow crafted from the sacred branch of the Windsor, a legendary tree feared by the forces of Oblivion, that grows on an island border the coast of Pyandonea. The magical property of the branch gives this bow extraordinary power over the undead and daedra alike.\r\n\r\n------------------------------------\r\n\r\n[b]Mod Features:[/b]\r\n\r\n-Completely Stand-Alone follower\r\n-Custom hair courtesy of Ponytails by Azar\r\n-She has her own custom bow, the Oakheart\r\n-She perked with Archery and Sneak, good for sneak-type characters\r\n-Optimized combat AI, using my other mod\\'s AI, Maiev with little small touches to make her a full-on ranger class follower.\r\n-She has her own set of leveled arrows, and weapons\r\n-She also levels with with the player up to 999\r\n\r\n[u]Author\\'s Note:[/u]\r\n\r\nHer Facegen is not permanent, I\\'ll keep editing it until I fully-studied the entirety of her head model. \r\n\r\nSo if you\\'re gonna post on the comments with \\\"This isn\\'t Lara at all\\\" type of post. Then by all means provide me some constructive reason and be specific. We can be more productive by helping each other. If not then I\\'m sure it won\\'t be a problem to make your own rendition of Lara Croft right? Or if you have CK with you, download my file and provide your own edit.\r\n\r\nI made this mod to share my work to the modding community and as a tribute to one of my favorite game characters of all time, not to compete with others modders. If there\\'s any mod similar content to mine that has more endorsements, that\\'s fine with me. I don\\'t really give a damn. I hope you all can respect that.\r\n\r\n[b]If you encounter bugs and issues with the mod, please let me know right away![/b]\r\n\r\n[IMG]http://i73.photobucket.com/albums/i217/Braigus09/cooltext951666493_zps098fc650.png[/IMG]\r\n\r\n-Creation Kit\r\n-Skyrim NPC Editor 0_75_1 by foretrenty\r\nhttp://skyrim.nexusmods.com/mods/4554\r\n-TESVSnip\r\n\r\n[IMG]http://i73.photobucket.com/albums/i217/Braigus09/cooltext951665690_zps0be2c0b3.png[/IMG]\r\n\r\n[b]Required file:[/b]\r\n\r\n-Skyrim 1.8+ (yep that\\'s it!)\r\n\r\n[b]Recommended Mods[/b]\r\n\r\n-Battle Hardened Body Mod Vanilla UNP UNPB UNPC CBBE ADEC by Wast1980\r\nhttp://skyrim.nexusmods.com/mods/32329\r\n-Brows by Hvergelmir\r\nhttp://skyrim.nexusmods.com/mods/30411\r\n-Pretty Lips by Danariel\r\nhttp://skyrim.nexusmods.com/mods/1167\r\n-Enhanced Character Edit by tktk\r\nhttp://skyrim.nexusmods.com/mods/12951\r\n\r\n[IMG]http://i73.photobucket.com/albums/i217/Braigus09/cooltext951665947_zps298e34e4.png[/IMG]\r\n\r\n-Mujuro for the tips\r\n-Azar for the Ponytail Hairstyles (http://skyrim.nexusmods.com/mods/31797)\r\n-Bethesda for being an awesome game company\r\n-Nexus, the best modding community\r\n-BravoOskar for his NPC creation tutorial",
  "categoryId": "66",
  "version": "2.6",
  "author": "Braigus09",
  "createdUnix": "1363072587",
  "updatedUnix": "1364173059",
  "containsAdultContent": false,
  "uploadedBy": "braigus09",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016896",
      "name": "Lara Croft",
      "version": "1.0Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1654",
      "fileName": "Lara Croft-33185-1-0Beta.zip",
      "uploadedUnix": "1363072574",
      "modVersion": "1.0Beta",
      "virusScanUrl": "https://www.virustotal.com/file/58171feb88ec7b2b74e0ccb2b2186777728ad87a06b55c13ae56ced059523a7c/analysis/1407465664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lara%20Croft-33185-1-0Beta.zip?fid=1000016896&ttl=1535810166&ri=8192&rs=8192&setec=fff80d867c962c9f7b1d2366cf1a6a3e"
    },
    {
      "fileId": "1000017081",
      "name": "Update 1",
      "version": "1.1Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1654",
      "fileName": "Update 1-33185-1-1Beta.zip",
      "uploadedUnix": "1363136739",
      "modVersion": "1.1Beta",
      "virusScanUrl": "https://www.virustotal.com/file/de99327808fbf02b327d7dd46e39431cfc41ef951b7a13344b07cb419a121161/analysis/1407466660/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%201-33185-1-1Beta.zip?fid=1000017081&ttl=1535810167&ri=8192&rs=8192&setec=94fa0d91eff8a63e34a1e535bb4f045f"
    },
    {
      "fileId": "1000017858",
      "name": "Update 2 point 1",
      "version": "2.1Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1788",
      "fileName": "Update 2 point 1-33185-2-1Beta.zip",
      "uploadedUnix": "1363408394",
      "modVersion": "2.1Beta",
      "virusScanUrl": "https://www.virustotal.com/file/dd6b5d43e78e2c3afef57d9065feac07adda00bf4e2fc75b147e32c675247b5b/analysis/1407472167/",
      "changelogHtml": " Sorted her head parts via TESVSnip <br/> \n Cleaned the mod with TES5Edit <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%202%20point%201-33185-2-1Beta.zip?fid=1000017858&ttl=1535810167&ri=8192&rs=8192&setec=aa8faa1fd4627a1fed58bcbc6e898412"
    },
    {
      "fileId": "1000018589",
      "name": "Lara Croft Update 3",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7488",
      "fileName": "Lara Croft Update 3-33185-2-5.zip",
      "uploadedUnix": "1363656199",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/e62362a04e020e738116361104a877e4d91a4819afe85d6d5eda28f56824a02b/analysis/1407476718/",
      "changelogHtml": " Changed her hairstyle, thanks to Azar for releasing the TR2013 hairstyle. Now she is 95% accurate <br/> \n Added Tusk Arrows and Recipe (Read Lara&#39;s Diary Fragment for the Recipe) <br/> \n Added her journals for future quest add-on and immersion. Adds more backstory for her. <br/> \n Added Survivor&#39;s Axe in her inventory <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lara%20Croft%20Update%203-33185-2-5.zip?fid=1000018589&ttl=1535810168&ri=8192&rs=8192&setec=b5b6fc831123bbc82707e47ccf14d29a"
    },
    {
      "fileId": "1000020067",
      "name": "Lara Croft Update 4",
      "version": "2.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7534",
      "fileName": "Lara Croft Update 4-33185-2-6.zip",
      "uploadedUnix": "1364173059",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/13de06590f4446fe14803663727d7282aa06e39f96a56f873396f39166a0a152/analysis/1407487279/",
      "changelogHtml": " Fixed the Hired Thugs, they were supposed to be corpses in the first place <br/> \n changed a few minor details on her facegen <br/> \n Preparation for her personal quest in the next update <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lara%20Croft%20Update%204-33185-2-6.zip?fid=1000020067&ttl=1535810168&ri=8192&rs=8192&setec=405b3b9987850fec99bd2bc1cdf6a21e"
    }
  ]
}