{
  "modId": 33192.0,
  "modName": "Character Creation Overhaul - Creation de Personnages Amelioree - French",
  "summary": "French Translation of Character Creation Overhaul by syclonix.\r\nTraduction française du mod Création de Personnages Améliorée par syclonix.\r\n\r\nCréation de Personnage Améliorée (CCO) rapporte enfin les classes, signes, compétences majeures des Elder Scrolls dans Skyrim. Laissez faire votre imagination en créant le personnage de votre choix ",
  "descriptionHtml": "[font=georgia][center]\r\n[color=Ivory][size=7]C[/size][size=7]HARACTER [/size] [size=7]C[/size][size=7]REATION [/size][size=7]O[/size][size=7]VERHAUL[/size]\r\n[size=7]CREATION DE PERSONNAGE AMELIOREE[/size][/color]\r\n[size=4]Races – Signes – Classes – Compétences – Spécialisation – Attributs[/size]\r\n\r\n\r\n[url=http://skyrim.nexusmods.com/mods/21587][img]http://www.ushareimg.com/images/49121587_1_1343998070.jpg[/img][/url][/center]\r\n\r\n[center][url=http://skyrim.nexusmods.com/mods/35320][img]http://www.ushareimg.com/images/286T3R.png[/img][/url][/center]\r\n\r\n\r\n[color=yellow]Si vous aimez ce mod et cette traduction, n\\'oubliez pas les endorsements! Ca ne prend qu\\'un clic et ça fait toujours plaisir![/color]\r\n\r\n\r\nCe mod est la traduction française du mod [url=http://skyrim.nexusmods.com/mods/21587]Character Creation Overhaul[/url] de Syclonix.\r\n\r\n\r\nRetrouvez d\\'autres mods sur le [url=http://skyrim.nexusmods.com/mods/28680]répertoire.[/url]\r\n\r\nPour suivre mon actualité de traduction de mods: [url=http://www.facebook.com/pages/Traduction-de-mods-Par-Raphou112/455702141160610?]ICI[/url]\r\n\r\n[size=5]Lien Mirror[/size]: [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/creation_de_personnages_amelioree.php]La confrérie des traducteur[/url]. (Attention: il se peut que la version soit un peu en retard, étant donné que ce n\\'est pas moi uppload sur ce site.)\r\n\r\n[color=Lemonchiffon][size=6]D[/size][size=5]ESCRIPTION[/color][/size]\r\n\r\nCréation de Personnages Améliorée (CCO) rapporte enfin les classes, signes, compétences majeures des Elder Scrolls dans Skyrim. Fini la création de personnage à la va vite, les personnages tous identique au bout de 50 niveaux. Maintenant, il va falloir vous spécialiser, comme dans tout bon RPG, et revenir sur ses premiers choix sera bien difficile. Laissez faire votre imagination en créant le personnage de votre choix parmi les 229 320 combinaisons possibles. En plus de cela, CCO garantit une compatibilité maximale avec les mods d’atouts, de gameplay, de départs. Voici donc les caractéristiques de ce mod.\r\n\r\n\r\n[color=Lemonchiffon][size=5]R[/size][size=4]ACES ET GENRES DIFFERENTS (OPTIONNEL)[/color][/size]\r\n\r\nLe Skyrim de base autorise n’importe quel personnage, quel que soit sa race et son genre, d’exceller dans tous les domaines, ruinant le plaisir, la stratégie, et l’univers Elder Scroll. CCO remédie à cela, en rendant les races et genres différents, avec chacun leur force et faiblesse. Chaque approche en jeu sera donc différente. Ainsi, un homme orque pourra au départ porter beaucoup plus de poids qu’une femme haut-elfe, alors qu’elle aura une capacité magique bien plus grande. Logique non ? Visiblement pas pour les développeurs de Skyrim qui ont attribué les mêmes caractéristiques à toutes les races… La santé, vigueur, magie et poids de départ ont été soigneusement attribués en fonction des attributs habituels des Elder Scrolls (force, endurance, agilité, intelligence etc…) et ajustés pour une meilleure correspondance et équilibrage avec Skyrim. De plus, comme dans tous les autres Elder Scrolls, tous les talents (avant bonus raciaux et spécialisation) démarrent au niveau 5. Voir le tableau des races et genres pour plus de détails. Le fichier optionnel « CCO –Diverse Race and Gender.esp » modifie les attributs selon les races et genre. Le fichier optionnel « CCO – Oblivion Carry Weight.esp » modifie la capacité de port selon les races.\r\n\r\n[color=Lemonchiffon][size=5]S[/size][size=4]IGNE DE NAISSANCE[/color][/size]\r\n\r\nChoisissez, comme dans les autres Elder Scrolls, la constellation sous laquelle vous êtes né. Vous pouvez aussi naître sous une constellation mystérieuse ou la choisir plus tard. Vous aurez ainsi une seule constellation et n’aurez plus besoin de traverser tout Bordeciel pour choisir votre pierre préférée. Vous pouvez choisir directement la constellation adaptée à votre personnage. Le fichier optionnel « CCO - Permanant Birthsings.esp » supprime la possibilité de changer de signes via les pierres dressées.\r\n\r\n[color=Lemonchiffon][size=5]S[/size][size=4]YSTEME DE CLASSES TRADITIONNEL[/color][/size]\r\n\r\nToutes les 21 classes d’Oblivion font leur retour dans Skyrim. Du discret et charmeur Agent au Sorcier à l’armure lourde, il y en a pour tous les styles de jeux. Chaque classe a sa spécialisation, son attribut favoris et ses talents principaux. Très peu de libertés ont été prises lors de la traduction Oblivion-Skyrim, et la différence est très faible entre les classes, pour la continuité et l’équilibrage :\r\n• Oblivion a 21 talents, chaque classe en possède 7. Skyrim a seulement 18 talents, donc chaque classe en possède 6.\r\n• Oblivion vous autorisait à choisir deux attributs favoris parmi Agilité, Endurance, Intelligence, Chance, Personnalité, Rapidité, Force et Volonté. Ceci étant merveilleusement supprimé dans Skyrim, CCO vous autorise à choisir entre Santé, Vigueur et Magie.\r\n• Les compétences de classes ont dû être adaptées pour faire face à ce manque d’attributs et de compétences.\r\nRegardez les tableaux des classes pour plus de détails.\r\n\r\n[color=Lemonchiffon][size=5]C[/size][size=4]LASSE PERSONNALISEE[/color][/size]\r\n\r\nVous pouvez aussi créer votre propre classe en choisissant Spécialisation, Attribut et Compétences pour faire place à votre imagination.\r\n\r\n[color=Lemonchiffon][size=5]P[/size][size=4]ROGRESSION DYNAMIQUE DES COMPETENCES[/color][/size]\r\n\r\nDans les précédents Elder Scrolls, les compétences spécialisées progressaient plus rapidement que les autres. Dans Skyrim, toutes les compétences progressent à la même vitesse, rendant les personnages plus adaptables et identiques. CCO modifie donc la vitesse de progression des compétences spécialisées pour qu’elles soient plus rapides.\r\n\r\n\r\n[color=Lemonchiffon][size=6]C[/size][size=5]OMPATIBILITE[/color][/size]\r\n\r\nCe mod ne modifie pas le jeu car il est totalement scripté. Les incompatibilités sont donc minimes. Ainsi, la plupart des mods d’atouts, de départs alternatifs, de races etc seront compatibles. Les incompatibilités viennent des mods qui changent les compétences raciales de départ ou la vitesse de progression des compétences.\r\n\r\n\r\n[color=Lemonchiffon][size=6]I[/size][size=5]NSTALLATION[/color][/size]\r\n\r\nCopier le dossier \\\\\\\"Data\\\\\\\" du mod dans là où votre jeu est installé (là où vous avez mis Steam).\r\nSoit: ...\\\\\\\\Steam\\\\\\\\SteamApps\\\\\\\\common\\\\\\\\skyrim.\r\nActiver les plugins via le mod manager.\r\nJe vous conseille d\\\\\\'utiliser Nexus Mod Manager pour faciliter l\\\\\\'installation/désinstallation des mods.\r\nUn tutoriel entièrement en français est disponible ici:\r\nhttp://www.confrerie-des-traducteurs.fr/forum/viewtopic.php?f=183&t=10216\r\nVoici la liste des pluggins. Les fichiers optionnels doivent être chargé après le fichier principal dans l’ordre de chargement.\r\n\\\\\\'Character Creation Overhaul.esp\\\\\\' (Requis): Le fichier .esp principal.\r\n\\\\\\'CCO - Diverse Races And Genders.esp\\\\\\' (Optionnel): Races et genres différents selon les attributs. Hautement recommandé.\r\n\\\\\\'CCO - Dynamic Skill Progression.esp\\\\\\' (Optionnel): Rend plus facile l’apprentissage des compétences spécialisées.\r\n\\\\\\'CCO - Oblivion Carry Weights.esp\\\\\\' (Optionnel): Change la capacité de port des races selon Oblivion.\r\n\\\\\\'CCO - Permanent Birthsigns.esp\\\\\\' (Optionnel): Désactive la capacité de changer de signe via les pierres dressées.\r\n\\\\\\'CCO - Uninstaller.esp\\\\\\' – C’est le désinstalleur. Ne PAS activer si vous ne voulez pas désinstaller le mod.\r\n\r\n\r\n[color=Lemonchiffon][size=6]D[/size][size=5]ESINSTALLATION[/color][/size]\r\n\r\nOuvrez le livre « Un nouveau départ » et sélectionner l’option détruire. Vous pouvez aussi copier \\\\\\'CCO - Uninstaller.esp\\\\\\' dans votre dossier data, lancer le jeu, sauvegarder et supprimer tous les fichiers CCO.\r\n\r\n\r\n[color=Lemonchiffon][size=6]M[/size][size=5]ODS RECOMMENDES[/color][/size]\r\n\r\nVivez une nouvelle vie : http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/vivez_une_nouvelle_vie.php\r\nCe mod vous donne la possibilité de démarrer une partie sans faire l’intro d’Helgen, et même mieux, de démarrer directement dans une guilde, en tant que bandit, patron d’auberge, arrivant, nouvel habitant…\r\n\r\nAtouts et Gameplay Améliorés : http://skyrim.nexusmods.com/mods/29286/ , prochainement disponible sur la Confrérie. Une grande révision du système de compétences en ajoutant un grand nombre d’atouts. Un système d’atouts automatiques (désactivable) est aussi introduit afin de retrouvé la progression des atouts à la Oblivion.\r\n\r\n\r\n[color=Lemonchiffon][size=6]B[/size][size=5]UGS CONNUS[/color][/size]\r\n\r\n• En utilisant CCO sur un personnage déjà existant, certaines compétences vont baissées sous le niveau nécessaires à certains atouts déjà débloqués. Ils sont néanmoins toujours utilisables.\r\n• Si vous utilisez des mods qui modifient les signes de naissance, CCO les reconnaîtra mais la description de ces nouveaux signes peut ne pas être bonne.\r\n\r\n\r\n[color=Lemonchiffon][size=6]C[/size][size=5]REDITS[/color][/size]\r\n\r\n• syclonix pour son super mod et pour m\\\\\\'avoir permis de le traduire et de le partager.\r\n• Kearsage et icechamber pour avoir inspiré ce mod.\r\n• Unofficial Elder Scrolls Pages pour les données sur les races et genres.\r\n• Bethesda pour ce jeu ainsi que l\\\\\\'univers \\\\\\\"The Elder Scrolls\\\\\\\".\r\n\r\nLa Confrérie des Traducteurs:\r\nSite Skyrim: http://www.confrerie-des-traducteurs.fr/skyrim/index.php\r\nForum: http://www.confrerie-des-traducteurs.fr/forum/index.php[/font]",
  "categoryId": "24",
  "version": "1.3.2",
  "author": "Raphou112",
  "createdUnix": "1363083489",
  "updatedUnix": "1365439766",
  "containsAdultContent": false,
  "uploadedBy": "raphou112",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000016921",
      "name": "Creation de Personnage Amelioree",
      "version": "1.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1283",
      "fileName": "Creation de Personnage Amelioree-33192-1-3-2.7z",
      "uploadedUnix": "1363083094",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/c44aa8e55b28be932f2a63f0a9e4d3f47a8aea9e51201b747ad2b8718fbd6774/analysis/1407465844/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Creation%20de%20Personnage%20Amelioree-33192-1-3-2.7z?fid=1000016921&ttl=1535810177&ri=8192&rs=8192&setec=35af31d78069efed2d12680fd7b2495d"
    },
    {
      "fileId": "1000023298",
      "name": "Creation de Personnage Amelioree ",
      "version": "1.3.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1058",
      "fileName": "Creation de Personnage Amelioree -33192-1-3-2.7z",
      "uploadedUnix": "1365439766",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/874c303a08c80ce5f3e30167b39055462b4718fb2a673279300ad725f5ccaa48/analysis/1407513004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Creation%20de%20Personnage%20Amelioree%20-33192-1-3-2.7z?fid=1000023298&ttl=1535810177&ri=8192&rs=8192&setec=8d2d477cf972d660363350bb56198199"
    }
  ]
}