{
  "modId": 33214.0,
  "modName": "Skyrim Shogun - Samurai -WIP-",
  "summary": "Adds a new area to Explore called Kyosaka home of the Samurai.  A Castle, VIllage, Monastery and more to see, craft armor, Weapons, and new food.",
  "descriptionHtml": "[color=#ff0000] Disclaimer\r\n\r\nThis mod is currently not being supported, It\\'s alot of work for just one person.  Until I am contacted by anyone with any significant talent who would make an impact on this mod it will sit as is.  No updates or bug fixes so please don\\'t ask.  I have put months of work into this mod and it has finally taken its toll on me.  I need a nice long break, but I also feel I should not keep this mod from the public.  So here it is, and I hope you all enjoy. \r\n\r\nAlot of people enjoy this mod, but instead of finishing it I feel this mod is just too big for its time.  Instead ZeroEternalz and I are going to create a Samurai Class mod which will include a few skills, Armor and weapons, featured in this mod, and a Player home.  All components will be found within Tamriel and not its own worldspace. Look forward to this new mod in the near future.[/color]\r\n\r\n[IMG]http://i384.photobucket.com/albums/oo284/Arcane51388/2013-02-04_00004_zps1cb7af10.jpg[/IMG]\r\n\r\nCredits\r\nAlot of people helped out in allowing me to use aspects of there mods.  Here are those people.\r\nBreton Longbow by cageu\r\nBlades Samurai Armour and Kimonos by Prime\r\nBlades Armor Red version And the black version by dabo\r\nJapanese Weapons by Zuneku Daitou\r\n    Genji Armor Conversion, Sashimono, and Sakkat.\r\nChristmas Lanterns by MannyGT\r\nGenji Armor (Oblivion) by Nitiren\r\nSai by Ghosu\r\nQuechus13 Japanese Arrow\r\nOdems Onihime Katana\r\nTraining Dummies and Targets by B1gBadDaddy\r\n\r\nIf I failed to mention you, I apologize please message me so I can make it right.\r\n\r\nDescription This mod Adds a new area to explore which includes various weapons and Armor.  If Samurai is your thing then this mod is for you, Kyosaka the land of \\\"Clan Kusano\\\".  At least that was my original Idea.  No NPCs exsist in this area which for alot of people would be upsetting.  Explore the various areas, The Village includes a Dojo, Archery range, Combat trail, tea house (no tea but Sake) A Ramen Shop, a Theater, some housing (incomplete), a Blacksmith and a craft store.\r\n\r\nThe Blacksmith and Craft store are unique to Kyosaka.  Thanks to Odem he has allowed me to make crafting go to a whole new level.  Using his idea of crafting individual pieces to creating a perfect sword, I expanded on that and went a little further.  I made an Assembly table to assemble your katanas, I made a forge to craft various pieces for your katana.  You can head over to the craft store and craft Dyes which are necessary in Crafting the Katana.  You can also craft Samurai Weapons using these Stations.  All these can only be found in the village within the heart of Kyosaka.  The Map below will show you where Kyosaka is located in the land of Skyrim.\r\n\r\n[IMG]http://i384.photobucket.com/albums/oo284/Arcane51388/2013-01-23_00013_zpsa50d6092.jpg[/IMG]\r\n\r\nSoutheast of Markarth, along a path you see Gates leading up the mountain.",
  "categoryId": "89",
  "version": "A1.0",
  "author": "Howard Anderson",
  "createdUnix": "1363125725",
  "updatedUnix": "1363125525",
  "containsAdultContent": false,
  "uploadedBy": "Arcane51388",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000017033",
      "name": "Skyrim Shogun",
      "version": "A1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "266139",
      "fileName": "Skyrim Shogun-33214-A1-0.rar",
      "uploadedUnix": "1363125525",
      "modVersion": "A1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Shogun-33214-A1-0.rar?fid=1000017033&ttl=1535810212&ri=8192&rs=8192&setec=899edb13edaaf16fc8e76b77789f2e39"
    }
  ]
}