{
  "modId": 33219.0,
  "modName": "Gypsy Eyes Caravan",
  "summary": "For the wandering adventurer&#33;\r<br />\r<br />Not a fan of fast-travel?\r<br />Like to travel the world at your own pace but want to do it in style?\r<br />Gypsy Eyes Caravan&#33; The player home you can take with you&#33;&#33;",
  "descriptionHtml": "Release candidate Version 3.1 Beta available in Misc section of downloads tab, I HIGHLY recommend reading the sticky for it in the comments tab&#33;&#33;&#33; (Really, not kidding&#33; )\r<br />\r<br />Gypsy Eyes Caravan Version 2.0 Now Available&#33;\r<br />\r<br />A quick note:\r<br />No images have been updated yet, I forgot to put them on the stick:(\r<br />\r<br />I know that what follows looks like a wall of text, but believe it or not, this is the condensed version&#33;\r<br />It is HIGHLY advised you read your drivers manual to familiarize yourself with the main functions and aspects now available on the caravan.\r<br />The manual can also be found in the book pile for easy access during play.\r<br />Version 1.0 & 1.1 info and vids can be found waaayy below.\r<br />\r<br />Files available:\r<br />Gypsy Eyes Caravan V.2.0 - Main\r<br />Gypsy Eyes Caravan V.2.0 - Rustic Texture Pack - Optional - An Almost Completely Different Texture Theme For The Caravan\r<br />Gypsy Eyes Caravan V.2.0 - Alternate Window Glass Pack - Optional - 21 Alternate Glass Textures\r<br />Gypsy Eyes Caravan V.2.0 - Window Mask Resource - Optional - A Loose PNG For Cutting Window Holes In Your Own Custom Textures\r<br />Previous Versions & Bits\r<br />\r<br />\r<br />Gypsy Eyes Caravan - Drivers Manual\r<br />\r<br />Purchase Location: Markarth Stables\r<br />Price: 4000 Septims\r<br />Goods Purchased: 1 Fully Outfitted Caravan (Gypsy Eyes Caravan) + 1 Carthorse (Thuse)\r<br />\r<br />\r<br />Quick(ish)-Start Procedures\r<br />\r<br />01 - Auto-Storage Systems\r<br />02 - Self-Drive, Fast Travel, The Map & The Shovel\r<br />03 - Trinkets - Follower Rings, The Whistle & Amulet Of Reset\r<br />04 - Crouch Menu\r<br />05 - Final Notes And Stuff\r<br />\r<br />\r<br />01 - Auto-Storage Systems\r<br />After purchase, activate the Super-Sorter button at the rear of the carriage, select &#34;Auto-Options&#34; then select &#34;Fill&#34; to fill the Auto-Sort container&#39;s Auto-Sort lists with all standard items.\r<br />On completion, select &#34;Super-Sorter&#34; to run the main Super-Sorter function, this will remove all standard items from your inventory and place them in the appropriate containers.\r<br />Open the carriage and go to each of the Amour, Weapon etc. containers in turn and select &#34;Options&#34;, &#34;Auto-Sort&#34; to begin adding/removing items from that particular container&#39;s Auto-Sort list to stop what you carry being stored when the Super-Sorter or individual Auto-Sort functions are used or to add DLC or Mod added items to the lists. Continue adding/removing &#39;till done then exit the container to finalize.\r<br />NOTE: Filling the standard lists can take around 5 real minutes or more depending on the speed of your P.C. Removing items from the Auto-Sort lists can take around a minute per item for the larger lists (Armour, weapons etc.), though much less for smaller lists (Soul-Gems, Scrolls etc).\r<br />Now activate the containers for the items you use up during the course of an adventure, Arrows, Potions & Poisons etc. and select &#34;Options&#34;, &#34;Auto-Restock&#34; and add one of each item that you wish to have restocked each time you use the Super-Sorter or Auto-Sort functions. You will then be asked the amount you wish to be restocked with, make your selection then continue adding or removing items &#39;till done. Exit the container to finalize.\r<br />NOTE: To add to any Auto-Sort or Auto-Restock list you must have at least one of the item in your inventory to add to the container, to remove there must be at least one in the container to be removed&#33; \r<br />NOTE: Because the standard function does not recognize player-made potions the potions & poisons containers use a slightly different method which takes longer, please keep this in mind&#33;\r<br />NOTE: The game does not distinguish between standard unenchanted and player enchanted items (weapons, Armour, trinkets etc.), setting unenchanted rings, for instance, to be Auto-Sorted will result in all unenchanted AND player enchanted rings of the chosen type to be Auto-Sorted.\r<br />Inversely setting your player enchanted Ebony Armour to NOT be Auto-Sorted means no other player enchanted or standard unenchanted Ebony Amours will be Auto-Sorted.\r<br />Back at &#34;Auto-Options&#34; in the Super-Sorter button you will also find options to turn the Auto-Sort menus on the containers on or off, they can also be turned off in each containers &#34;Options&#34; menu and turned back on by crouch-activating that particular container.\r<br />The &#34;Auto-Options&#34; version is global and will turn all Auto-Sort menus off and on though each container will remember it&#39;s own personal setting, i.e., turning off the Heavy Armour Auto-Sort menu in that containers options will only turn off that containers menu, then turning of all Auto-Sort menus using the &#34;Auto-Options&#34; option will turn off ALL Auto-Sort menus on all containers. Turning them all back on at the Auto-Options menu will turn all back on except the Heavy Armour menu which has remembered that it was disabled and must be crouch-activated to re-enable that containers menu.\r<br />Similarly you cannot turn on an individual menu by crouch-activating a container if they are all switched off at the Auto-Options menu, that must be re-enabled first.\r<br />Also included are Auto-Gets, these are placed on all the crafting stations (Alchemy and Enchanting stations, cooking pot, smelting pot etc. but not the woodpile) and will automatically &#34;Auto-Get&#34; all the necessary goods from their respective containers and transfer them to your inventory the moment you activate any crafting station, e.g., activating the cooking pot will auto-get all raw & cooked foods, all bevererages and all potions ingredients (as long as they are in the Auto-Sort lists for those containers) then, when done crafting, they will automatically be transferred back to their containers and the Auto-Restock will be initiated if that function is included on that container.\r<br />These too can be enabled or disable either individually at each station by crouch-activation or globally in the &#34;Auto-Options&#34;.\r<br />Once you have set things up how you want you can then also turn off the Super-Sorter&#39;s menu so it will just Super-Sort on activation&#33; Crouch-activate to re-enable it&#39;s menu.\r<br />Now, on exiting a crypt, dungeon etc. you should be able to just hit the Super-Sorter and be instantly cleared and restocked and left with only any unique or mission items that you have just acquired and be ready to go again&#33;\r<br />\r<br />02 - Self-Drive, Fast Travel, The Map & The Shovel\r<br />For the perfect camping experience the caravan comes with four functions, taking them in reverse order:\r<br />The Shovel: When you find a spot that you think would make a perfect camp site you may find the spot is ruined by plants and trees, simply equip the shovel while standing within about 50 feet of the caravan and on exiting your inventory you will be offered the option of clearing the area, this will clear all plants and trees (even dead ones) around the caravan to a radius of about 30 feet and take 4 game-hours.\r<br />If you decide you aren&#39;t happy with it, or wish to change the location simply re-equip the shovel and select the Replant Area option, again, 4 game-hours will pass and the area will be reset.\r<br />NOTE: The Shovel cannot remove grass or low shrubbery as these are part of the texture painted onto the ground and cannot be altered during run-time, nor will it remove rocks as they could be anything from an annoying small boulder (not a problem) to a decent chunk of mountain (BIG problem&#33; ).\r<br />If equipped outside the caravans influence the shovel will just remain a shovel....except you can spank people up-side the head with this one&#33;&#33; SPAAANNNNGGGG&#33;&#33;&#33;&#33;\r<br />The Shovel can be upgraded but you cannot craft a new one, don&#39;t loose it&#33;\r<br />The Map: Once you have found the perfect camp site, activate the map in the carriage, if inside the boundary of any of the major cities or towns you can place up to 2 sites, an Alpha Site and a Beta Site and a blue (Alpha) or red (Beta) flag will be added to the map so you can check your sites at a glance.\r<br />If not near any cities or towns you can still use one of ten &#34;Wilds&#34; sites, these do not get flags.\r<br />Self-Drive & Fast Travel: Once you have set any camp sites on the map you can now select either Self-Drive or Fast Travel in the mounted menu while driving the caravan, Self-Drive will have Thuse make his own way to the site you have chosen and you can sit back and enjoy the ride or Fast Travel will act like normal fast travel and transport you immediately to the location. Fast Travel travels at on-foot speed, Thuse is not in a hurry&#33;\r<br />\r<br />03 - Trinkets - Follower Rings, The Whistle & Amulet Of Reset\r<br />Follower Rings: In the Rings Pillar you will find 4 rings, 1 Diamond and 3 Gold, any follower that has one of these rings equipped will be taken into account by the caravan when you drive it, ride Thuse while hitched or tell Thuse to follow using the caravans menu.\r<br />The follower with the Diamond ring will drive the carriage if you are not. All other followers will be transferred to a storage cell until the dismount process is initiated.\r<br />The Whistle: On using (equipping) the Whistle which you will find in the Amulets Pillar Thuse will hear it and be on his way, no matter where in the world he is, no matter whether he is hitched or not.\r<br />NOTE: Convenient Horses can interfere with Thuse, while unhitched he may not respond to the whistle and if ridden while hitched, on dismounting he may not reappear&#33; To get him back in this case activate the carriage (nothing happens) then activate again and choose &#34;Unhitch&#34;, Thuse should then reappear.\r<br />NOTE: Thuse is an abject coward and will always run away from danger&#33;&#33; He is also immortal, as are you while driving the caravan, but not while riding except for when dismounting him while he&#39;s hitched and you are under attack, in this case you become mortal after dismount.\r<br />Amulet Of Reset: Also found in the Amulets Pillar this works as it sounds, this will reset the carriage and Thuse to their start location near Markarth stables should he or it go missing, I suggest keeping this in a safe place but obviously NOT in the carriage&#33;\r<br />\r<br />04 - Crouch Menu\r<br />While the carriage is hitched you can crouch-activate it to gain access to a hidden menu which controls enabling/disabling of the mounted menu, long-term follower mounting options as well as compatibility checks for FrostFall and Climates Of Tamriel, if you have either mod installed you must use this option for the rain/snow to work with CoT and for you to get warm in FrostFall, only if a mod is found will compatibility be turned on.\r<br />While the mounted menu is enabled you can also access this menu from there.\r<br />NOTE: If using FrostFall you MUST close the door to get warm, whether in the carriage or in the tent.\r<br />NOTE: Selecting Followers Never Dismount means when you dismount from driving the carriage or from riding Thuse while hitched your followers will remain mounted until you activate the carriage again and tell them to dismount (the in-game menu just didn&#39;t really have enough space to explain that fully.), the rest of those options are pretty self-explanatory.\r<br />NOTE: I have tried to supply menu options for every situation but there are some limits, for instance you can have your followers mount the carriage if you choose to ride Thuse while he&#39;s hitched but once you are back on-foot you cannot drive the carriage or re-mount Thuse without first dismounting your followers.\r<br />\r<br />05 - Final Notes And Stuff\r<br />For the purist, to turn all Auto-Systems and menus off toggle Auto-Sorts & Auto-Gets off in the Auto-Options menu in the Super-Sorter then hitch Thuse and crouch-activate the carriage and toggle off the Mounted Menu.\r<br />It takes 30 game-minutes to unpack/pack the side bags, if you choose Pack Up & Lock Up from the lock those times will be combined into a full hour.\r<br />I have not included any uniquely named items in the Auto-Sort lists for 2 reasons, firstly most unique items tend to be mission items which cannot normally be dropped, having one of these in the list would cause the Auto-Sort to stop when it reached that item in the list and would not store anything beyond it until the mission was completed and the item becomes drop-able. Secondly I personally like to know when I&#39;ve bagged something unique and it&#39;s too easy to just store it without realizing&#33;\r<br />Auto-Gets will not get Armour, weapons, trinkets etc, they will only get the raw ingredients as it were, not the final product, except cooked food. Any other final product needed for crafting by any mods will have to be got by you first.\r<br />They will also not auto-sort anything you make (again, except cooked food), you must store these by hand or using the Auto-Sorts or Super-Sorter.\r<br />Be sure to wait until given the &#34;Done&#34; notification when removing items from the Auto-Sort lists before removing another item&#33;\r<br />Be sure to exit any container after editing it&#39;s list to finalize the list and end the add/remove function.\r<br />Your options are severely limited if in combat&#33;\r<br />The Shovel has a smart-detection system so you cannot &#34;cut a swathe&#34; through the countryside, you have to be at least around 100 feet away from the last position and the areas will not be close enough to join.\r<br />The mannequins can still get a bit mobile when naked (the amulet only works to get them in position at first after unhitching) though once dressed I&#39;ve had no problems with them in that regard though if you &#34;bump&#34; their collision their &#34;souls&#34; can still wander.\r<br />I&#39;ve added fade-outs and locked player controls for while most processing intensive functions are running but it doesn&#39;t hurt to give events an extra second or 2 just to be sure it&#39;s done until you get a feel of how smoothly things run on your particular system.\r<br />While a follower is driving you may be tempted to &#34;Trade Items&#34; and take the crop from their inventory, I advise against this, they are impossible to pick up so if dropped in a non-respawning area or placed on a weapon rack (there are 2 versions, one is a weapon the other a torch) they will be there forever&#33; Similarly, do not drop the torch from your inventory while driving and I advise not trying to switch weapon also.\r<br />The weather systems that stop it from raining or snowing under the awnings or while inside the caravan take a few second to process, if you dodge in and out too fast the weather WILL break&#33;&#33; It is advised that if you enter these trigger areas you should stop for a second or so to let the script run it&#39;s course and the &#34;real&#34; weather to be switched for the fake. When (not IF&#33;&#33;) the weather breaks simply re-enter the awning or caravan area that broke the weather, wait a few seconds then exit for the weather to be repaired.\r<br />DON&#39;T double-activate stuff&#33;&#33; This is bad&#33; Just wait a second first to be sure.\r<br />If playing with Papyrus Logging Enabled I suggest adding &#34;bEnableProfiling=1&#34; to the Papyrus section of your Skyrim.ini. Hearthfire and mods including, but not limited to, FrostFall and Realistic Needs & Diseases each use quests that keep track of all objects that are placed in and taken from your inventory and using the Auto-Sorts and Super-Sorter can move a LOT of stuff from you into containers, each item removed is noted in the papyrus log for each mod & the DLC so three times each with just those mentioned installed, these are not warnings or errors they are just information entries but can create a HUGE log file (I Super-Sorted 10,000 KiloPounds of goods during testing and got a 4 Megabyte log&#33;&#33; ) so I added a bit of code that basically turns off Papyrus logging while the Auto-Sorts or Super-Sorter is running as long as bEnableProfiling=1 is added then turns it back on.\r<br />And finally, BAD INSTALLS&#33;&#33;&#33; What can I say, they happen. When a mod is first installed and detected by the game the engine has to &#34;join the dots&#34; and sometimes a dot gets missed or joined to the wrong dot and the more complex a mod is the more dots there are, and the more dots there are the more the likelihood of a bad install and the caravan is now a VERY complex mod, I advise not installing the mod until you are ready to buy the caravan then running a check on all systems before continuing, or, if you REALLY want it there from the get-go make a full save, install the mod then make another full save then give yourself the money to buy it and check things out, if all goes well go back to the second save safe in the knowledge that when the time comes everything will work as it should.\r<br />\r<br />I&#39;ve probably forgotten plenty but I think you&#39;ll be able to figure things out as you go.\r<br />Happy camping&#33;\r<br />berticus0001\r<br />\r<br />Credits:\r<br />First & foremost gentester for testing & rug texture.\r<br />InsanitySorrow for rug mesh.\r<br />Blary for his book stacks.\r<br />Noble cupboard/chests texture, Langley&#39;s Wood, Metal and Stone Workshop, slightly modified by me.\r<br />1st/3rd person check by IsharaMeradin.\r<br />The basic script from which I reverse engineered how to tether horses: Simple Buyable Carts, now updated to Wagonborn - A Player Cart Mod by LP1\r<br />Crop mesh and texture by zaz\r<br />SoulGem Bowl from Oaristys & Tony67 and to civicchick for pointing that out&#33;\r<br />\r<br />-------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[center][youtube]SwhL1yJ5HJM[/youtube][youtube]e02kj8e65I0[/youtube][/center]\r<br />And one more by chickenbrothel - WARNING: Mature Language - [url=http://www.youtube.com/watch?v=hT4kHAfz-zA&feature=player_embedded] Skyrimtastic Modstravaganza # 5[/url]\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/Ywhtm.png[/img][/url][/center]\r<br />\r<br />Gypsy Eyes Caravan V.1.1\r<br />[url=http://skyrim.nexusmods.com/mods/35415/]Deutsche[/url] Version by Awadea\r<br />\r<br />For the wandering adventurer&#33;\r<br />\r<br />Not a fan of fast-travel?\r<br />Like to travel the world at your own pace but want to do it in style?\r<br />Gypsy Eyes Caravan&#33; The player home you can take with you&#33;&#33;\r<br />\r<br />The caravan can be found near Markarth stables and costs 4,000 Septims.\r<br />\r<br />[u]If Upgrading from V.1.0 you MUST do a clean install&#33;&#33; Grab ALL your gear and lock the caravan then make a full save, quit and uninstall V.1.0, reload/continue and save again to clean the previous version from your save file then install the new 1.1.[/u]\r<br />\r<br />Description:\r<br />A two mode caravan, mobile & unlocked.\r<br />Mobile: While in mobile mode the caravan is the same as any wagon, it will take one follower in the back and you can hitch your horse to it and off you go&#33;\r<br />Unlocked: Once unlocked you can climb in the back and use any of the containers, potion table, enchanting table, the 2 mini mannequins, 2 weapons racks and a full display for dragon masks&#33;\r<br />Outside you can access the Smithing, Cooked Foods, Raw Foods, Ales & Wines barrels directly, or, activate the side bags to unpack&#33;\r<br />Cooking & Bedding Unpacked: Once unpacked this bag lays out 2 cots, a cooking fire and moves the Raw Foods, Cooked Foods and Ales & Wines barrels.\r<br />Smithing Unpacked: Unpacked this bag spreads out a full set of smithing furniture for your armoury needs&#33;\r<br />\r<br />When the time comes to move on simply hit the Pack Up & Lock Up button on the back and you&#39;re ready for the road again&#33;\r<br />If unhitched the caravan automatically drops a map marker so you&#39;ll never forget where you parked&#33;\r<br />\r<br />This mod is compatible with UFO & Convenient Horses&#33;\r<br />\r<br />For those interested in having a go at your own caravan I&#39;ve just uploaded the first 2 parts of a tutorial series on how to build them&#33;\r<br />[url=http://bertscktutorial.ucoz.com/index/part_1_stripping_your_nif/0-22]Caravans 101 - Part 1 - Stripping Your NIF[/url]\r<br />\r<br />Known issues to bear in mind:\r<br />When hitching/unhitching you should allow time for your horse to &#34;rematerialize&#34; fully before activating anything else, ie, hitch horse, wait until your horse is fully solid in the harness then mount the caravan, or, unhitch horse, wait until horse is fully solid then activate the unlocking.\r<br />You can drive the caravan or ride the horse while hitched. Either way, it is best to zoom all the way out&#33; If riding and you have a follower they will keep bumping into the caravan&#33;\r<br />When a follower is in the back, even though they are sitting their &#34;soul&#34; is still following so for the first 100 yards or so the caravan can be very bouncy until the followers &#34;legs are broken&#34;&#33; They don&#39;t actually break, obviously, it just takes a while for them to realize they should pick their feet up&#33; Set your follower to wait before boarding to avoid this, don&#39;t worry, they still get on&#33;\r<br />If you manage to get your caravan stuck at the bottom of a crevass or even the ocean, it&#39;s probably lost&#33;&#33;&#33;&#33; Gather your goods and do a clean reinstall&#33;\r<br />The caravan does not auto-level, it would look stoopid half way up a mountain&#33; find level ground before unlocking&#33;\r<br />It is advised to find yourself a nice bit of wide, flat land once you buy the caravan and test the unlocking/unpacking there to be able to judge suitable places to park.\r<br />When unlocking/unpacking you are automatically moved a safe distance and controls are turned off while the unlocking/unpacking process completes, this is to avoid and chance of breaking the mod while it is processing the unlock/unpack scripts.\r<br />It is best if any followers are told to wait a short distance away before unpacking as they may be standing where something goes&#33;\r<br />This mod is primarily built for the lone adventurer. While it is compatibly with 1 follower I cannot guarantee what will happen with multiple&#33; \r<br />While follower compatible it is NOT NPC friendly&#33; NPC&#39;s do not &#34;see&#34; the caravan or anything that is unpacked so will constantly be trying to walk through stuff&#33;&#33;\r<br />If the mannequins wander shutting and reopening the door should put them back, if not, lock up and the&#39;ll return to their places on unlocking&#33;\r<br />\r<br />berticus0001\r<br />\r<br />Changes to 1.1\r<br />\r<br />Rewrote the main unlocking/locking up script to be smoother, slightly faster & no more ending up in the storage area.\r<br />Changed some of the containers inside to be more obvious of their contents.\r<br />Fixed potions & poisons linked to wrong containers, renamed Amulets (no &#34;E&#34; this time&#33;).\r<br />Rewrote hitching script, no more statue horses (I hope&#33;&#33;).\r<br />Added new option to primary menu to toggle whether to change your saddle for the harness so if you use animals with custom saddles you should swtch this off to keep them&#33;&#33;&#33;\r<br />Added new mounted menu (toggle by crouch-activating the carriage in mobile mode) offering alternate dismount type and speed settings (select speed then jump while moving to enable new setting, don&#39;t ask me why it needs this it just does, I will be looking into this to make it smoother&#33;&#33;) and the option to toggle the automatic dismount & unhitch when tha carriade comes under attack.\r<br />Removed weather spell & added weather swapping to the interior, when you enter the carriage the weather type stays the same but it stops snowing/raining and fake snow/rain is placed at the doorway for immersion. The snow is a bit pants still, I will be working on it further&#33; This only applies to the interior, it does not work on the awnings, next update for that as I&#39;m thinking of making a change to the bedding side&#33;\r<br />Auto-locked to 1st person on entering the interior then auto-switch back to 3rd person if that&#39;s how you entered. So no more bouncing around inside&#33;&#33;\r<br />Tweaked the living daylights out of the carriage physics & gravity, this is about a good as it&#39;s gonna get, but it&#39;s not half bad if I do say so myself, even at full speed&#33;&#33;-)\r<br />Oh, and I&#39;ve swapped out the Winterhold symbols for new gold eyes, I&#39;ll want the Winterhold symbol for that cities carriage&#33;\r<br />\r<br />Defaults:\r<br />Mounted Menu = Off\r<br />Swap saddle for harness = On\r<br />Auto dismount & unhitch when attacked = On\r<br />\r<br />Some great tips from vvk78¬\r<br />\r<br />A few nice features of this mod that aren&#39;t self-evident, plus a few tips on improving your enjoyment of this wonderful mod..\r<br />\r<br />[i]1. Your caravan&#39;s horse gets into unwanted fights on its own?&#33; Change its behavior&#33;[/i]\r<br />\r<br />The caravan&#39;s horse is just as important as the caravan&#33; And no one wants their caravan to be suddenly dragged off the road by a crazed caravan-horse, that decides to attack some unseen enemy (e.g., a roadside wolf).\r<br />\r<br />There are some nice horse mods, that will allow you to change the default behavior (and looks -- get some horse armor&#33;) of your horse/mount, so the horse will avoid/ignore combat.\r<br />\r<br /> [url=http://skyrim.nexusmods.com/mods/14950]Convenient Horses[/url] or [url=http://skyrim.nexusmods.com/mods/10579]Better Horses[/url] mods will enable your caravan horse to behave obediently.\r<br />\r<br />[i]2. Don&#39;t doze on the caravan driver&#39;s seat, go ride the caravan horse and pull your caravan&#33;[/i]\r<br />\r<br />After tethering the horse to the caravan, it is better to ride the horse than drive the caravan from the carriage seat, for a few reasons.\r<br />\r<br />a. It is [u]easier to control the horse[/u] (and hence the caravan), as it is easier to see where it&#39;s going.\r<br />b. Riding the tethered horse means [u]followers will follow easily[/u], and for advanced (mod added) followers, they&#39;re most likely to follow on their own horse -- now they don&#39;t bump erratically into the caravan and can deal with enemies by themselves if your caravan is ambushed, while you continue driving the caravan slowly.\r<br />c. You can do  [u]horse combat[/u] while riding your caravan-horse, with the caravan bouncing merrily behind you&#33; Very useful for quickly dealing with that odd (and pesky&#33;) wolf and sabercat, that may waylay you (and its loot get added to you automatically, so you do not even have to get down from your caravan horse).\r<br />d. You can [u]engage in conversations and/or trade with the wayfarers[/u] you meet along the journey -- farmers, Imperial/Stormcloak soldiers, Thalmor Justicars, Khajiit traders, etc.\r<br />e. Or maybe you can just bribe that highwayman/bandit that pops out from behind a bush, to let you continue on your way, unhindered&#33; :-)\r<br />\r<br />[i]3. How to fast-travel with your caravan?&#33; Can&#39;t be done yet, but ScriptDragon can help a little bit&#33;[/i]\r<br />\r<br />If you unhitch the horse from the caravan, a map marker is added pointing conveniently to the caravan&#39;s location. But if you forgetfully fast-traveled with your horse still tethered to the Gypsy Eyes Caravan, then the horse will appear alongside you & your party, but the caravan will be missing&#33; If you go back again to the place where you had last hitched it, then sure enough, the caravan will still be there.\r<br /> \r<br />[url=http://alexander.sannybuilder.com/?category=other-bethgames&altname=skyrim_script_dragon]ScriptDragon[/url] (a simple utility similar to SKSE), comes with a default script for spawning the horse in front of you (default hotkey is HOME).  Here&#39;s a [u]tip that will work as long as the Gypsy Eyes Caravan and your Horse are in the same &#34;cell&#34; in the Tamriel worldspace[/u]..\r<br /> \r<br />Just press HOME and the horse (which looks untethered, but is still &#34;virtually tethered&#34;) will spawn wherever you are pointing the mouse pointer. Within a few seconds, the caravan will come rushing and bouncing ridiculously fast towards the horse (it may snag on any boulders or obstacles, so just respawn the horse on an unencumbered piece of terrain, and wait patiently), and tether itself to the horse&#33; This works best if the caravan is line-of-sight of the horse.\r<br /> \r<br />Voila, we can continue the caravan trip now&#33;\r<br />\r<br />[i]4. Make your own caravan retinue, with multiple carriages and trailer-homes&#33; Get the Dragonkiller mod too&#33;[/i]\r<br />\r<br />[Based on a tip from Evol2] If you have the pioneering [url=http://skyrim.nexusmods.com/mods/25493]DragonKiller Cart[/url] mod, you can make your own retinue of caravan carriages/trailer-homes. Here&#39;s how:\r<br />a. Tether your own horse to the Gypsy Eyes Caravan.\r<br />b. Command your horse to follow you (using [url=http://skyrim.nexusmods.com/mods/14950]Convenient Horses[/url] or [url=http://skyrim.nexusmods.com/mods/10579]Better Horses[/url] mod).\r<br />c. Then get onto the Dragonkiller Cart (which has its own horse), start your journey and ride out. Your horse will follow, obligingly pulling along the Gypsy Eyes Caravan as the &#34;follower caravan&#34;.\r<br />\r<br />You can also do the same with [url=http://skyrim.nexusmods.com/mods/12577]SRM Companion Cart[/url] as the follower caravan.  Your followers can ride in the Dragonkiller cart, and this is a neat idea for a long journey, if your follower doesn&#39;t know how to ride a horse.\r<br />\r<br />If you want more than 2 carriages in your caravan retinue, then get the [url=http://skyrim.nexusmods.com/mods/26704]Convenient Horse Herding[/url] or [url=http://skyrim.nexusmods.com/mods/13530]Horse Branding[/url] mods, which allow you to travel with more than 1 horse. Just tether each horse to a separate caravan/cart, and you have your own retinue&#33; This is especially great if you are roleplaying as a Khajiit or as a travelling merchant/trader.\r<br />\r<br />[i]5. Unpacking the caravan makes the skies too dark for you? ScriptDragon to the rescue again&#33;[/i]\r<br />\r<br />With this mod, a script action has been added to clear the weather while the caravan is unpacked (after which its door becomes openable). This is needed since this caravan is an exterior home after all (yes, if it is raining/snowing outside, you will get the precipitation inside the caravan).  But if you are using any ENB mods, you might find the clear weather to be too dark at nights (though the caravan does have some warm lanterns and indoor lighting).\r<br /> \r<br />Don&#39;t worry, just get [url=http://skyrim.nexusmods.com/mods/8221]ScriptDragon[/url], and use its default hotkeys PAGE-UP/PAGE-DOWN, and choose a new weather (out of 38&#33;) according to your mood&#33; For example, just press PAGE-UP once, and the beautiful &#34;Sovngarde&#34; weather will make the night as clear as day&#33; The new weather will automatically change after its usual change cycle, so nothing is broken&#33;\r<br />\r<br />[i]6. Get your NPC followers to ride on their own horses&#33; Protect your caravan and its valuable cargo&#33;[/i]\r<br />\r<br />If you already have Convenient Horses (CH) installed, just enable the &#34;Horses for Followers&#34; in the CH options menu. CH has advanced features like Mounted Combat for Followers, Horse Trampling and Smart Horse Follow&#33;\r<br />\r<br />Alternatively, get the [url=http://skyrim.nexusmods.com/mods/13530]Horse Branding[/url] or [url=http://skyrim.nexusmods.com/mods/7017]Horse Riding Follower[/url] mod, and it allows you to &#34;tame&#34; any wild (unowned) horse and add it to your follower list. Indicate which horse you want your follower to use, and your NPC follower can then ride it and follow behind your caravan (assuming they&#39;re not able to summon their own horse previously).\r<br />\r<br />-----------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />Other Mods By Me&#33;\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/8922]Berts Breezehome Remodeled[/url]\r<br />A full remodel of Breezehome including interior, exterior and cellar & so much more&#33;\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/15801]Berts Breezehome Cellar[/url]\r<br />Adds an open (no loadscreen) cellar to Breezehome with a full set of crafting and smithing tools plus displays for armour, weapons, dragon masks and dragon claws&#33;\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/15806]Berts Breezehome Garden[/url]\r<br />A new garden grotto added to Whiterun available as a standalone or connected to the vanilla Breezehome & is also pre-packed with my Cellar & Remodeled mods.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/29942/]Berts Breezehome Greenhouse[/url]\r<br />A stand-alone version of the greenhouse thats included with this mod (Berts Breezehome Remodel) & Berts Breezehome Cellar.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/29665]Remo&#39;s Display Spells[/url]\r<br />A collection of spells aimed specifically at making your house a home.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/25239/#]Berts Hearthfire Dairy Goods Upgrade[/url]\r<br />An upgrade for the dairy goods side of the Hearthfire DLC.",
  "categoryId": "67",
  "version": "2.0",
  "author": "berticus0001",
  "createdUnix": "1363131208",
  "updatedUnix": "1488941964",
  "containsAdultContent": false,
  "uploadedBy": "berticus0001",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000017053",
      "name": "Gypsy Eyes Caravan",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5055",
      "fileName": "Gypsy Eyes Caravan-33219-1-0.7z",
      "uploadedUnix": "1363130119",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c16c921ee23eaa072f7dbbf2ce595083ac3fe59cff29baa0b3c210b68d2b9efc/analysis/1407466575/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gypsy%20Eyes%20Caravan-33219-1-0.7z?fid=1000017053&ttl=1535810228&ri=8192&rs=8192&setec=c294fb39fa72df7f658cf92e32b4c5bf"
    },
    {
      "fileId": "1000024662",
      "name": "Gypsy Eyes Caravan V_1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7091",
      "fileName": "Gypsy Eyes Caravan-33219-1-1.7z",
      "uploadedUnix": "1366060667",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d270880a57c141027d4328e5cc8fcd56b6cd220bd4920ceff161eaf8cec6e869/analysis/1407524122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gypsy%20Eyes%20Caravan-33219-1-1.7z?fid=1000024662&ttl=1535810229&ri=8192&rs=8192&setec=0676a98e5f61493097ed95fa8662aa72"
    },
    {
      "fileId": "1000086640",
      "name": "Gypsy Eyes Caravan V2 Final Beta",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20664",
      "fileName": "Gypsy Eyes Caravan V2 Final Beta-33219-.7z",
      "uploadedUnix": "1386966566",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/bb9b9375fb69a962094438759af648b352ee74801e0cf3ea4d2b163be67cda70/analysis/1407835456/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gypsy%20Eyes%20Caravan%20V2%20Final%20Beta-33219-.7z?fid=1000086640&ttl=1535810229&ri=8192&rs=8192&setec=0af4a75bc1bd7ecb6653f141ba4ebd94"
    },
    {
      "fileId": "1000086642",
      "name": "NavMesh Fix - Markarth _Demo_",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "106",
      "fileName": "NavMesh Fix - Markarth _Demo_-33219-.7z",
      "uploadedUnix": "1386966963",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2cd9bab252a104da4a0e6c1d9db23bfa0ff772d131d62f0da15af0736f3e83fa/analysis/1407835457/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NavMesh%20Fix%20-%20Markarth%20_Demo_-33219-.7z?fid=1000086642&ttl=1535810230&ri=8192&rs=8192&setec=8cf12bfd7adb8f17ba3ff4baaa3ab7f7"
    },
    {
      "fileId": "1000090513",
      "name": "Gypsy Eyes Caravan V2 - Alternate Window Glass",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "19204",
      "fileName": "Gypsy Eyes Caravan V2 - Alternate Window Glass-33219-.7z",
      "uploadedUnix": "1389216662",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/df549876f1145ef8379c9e32cb3a6f062162e91622d1f75a13a79566ba535a86/analysis/1407877914/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gypsy%20Eyes%20Caravan%20V2%20-%20Alternate%20Window%20Glass-33219-.7z?fid=1000090513&ttl=1535810230&ri=8192&rs=8192&setec=bfb344ca6a6dd36be7af388a6fa6d558"
    },
    {
      "fileId": "1000090514",
      "name": "Gypsy Eyes Caravan V2 - Rustic Texture Pack",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2657",
      "fileName": "Gypsy Eyes Caravan V2 - Rustic Texture Pack-33219-.7z",
      "uploadedUnix": "1389216860",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5fd69e7d218ab1f227764d2340aeee76bab0a14ff456dd913b410690cf64a023/analysis/1407877917/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gypsy%20Eyes%20Caravan%20V2%20-%20Rustic%20Texture%20Pack-33219-.7z?fid=1000090514&ttl=1535810231&ri=8192&rs=8192&setec=d12b657d9c838293dbca59b9c36c40ef"
    },
    {
      "fileId": "1000090515",
      "name": "Gypsy Eyes Caravan V2 - Window Mask",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Gypsy Eyes Caravan V2 - Window Mask-33219-.7z",
      "uploadedUnix": "1389216980",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d1fd92ecbb4c67103d897f195d7313a8407c49f3792b39bca76e3d4c1798c525/analysis/1407878043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gypsy%20Eyes%20Caravan%20V2%20-%20Window%20Mask-33219-.7z?fid=1000090515&ttl=1535810231&ri=8192&rs=8192&setec=deb50c65e6436ed06602f3a8437bc9c1"
    },
    {
      "fileId": "1000090517",
      "name": "Gypsy Eyes Caravan V2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22483",
      "fileName": "Gypsy Eyes Caravan V2-33219-2-0.7z",
      "uploadedUnix": "1389217192",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/af5094e46bed530d87e2ecdcbc50bafcd7b4cfc81d5234d719246e25e680d119/analysis/1407878064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gypsy%20Eyes%20Caravan%20V2-33219-2-0.7z?fid=1000090517&ttl=1535810232&ri=8192&rs=8192&setec=4bffc192b2458db34cacc7467031c798"
    },
    {
      "fileId": "1000133722",
      "name": "Gypsy Eyes Caravan 2.1 Beta",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22278",
      "fileName": "Gypsy Eyes Caravan 2.1 Beta-33219-.7z",
      "uploadedUnix": "1414982387",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/580ee4b7613966648b9c5e549088db905d0af721ec50227545bc1dec84d62b1c/analysis/1414982469/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gypsy%20Eyes%20Caravan%202.1%20Beta-33219-.7z?fid=1000133722&ttl=1535810232&ri=8192&rs=8192&setec=6bb32e0e57764e257679068c87e06e4d"
    },
    {
      "fileId": "1000155646",
      "name": "Gypsy Eyes Caravan V3 Beta",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23002",
      "fileName": "Gypsy Eyes Caravan V3 Beta-33219-.7z",
      "uploadedUnix": "1429026815",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5c9045a44f6dc62520c148321fd3a10db42f5ebc78235cbfd970a197861f85f4/analysis/1429026856/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gypsy%20Eyes%20Caravan%20V3%20Beta-33219-.7z?fid=1000155646&ttl=1535810233&ri=8192&rs=8192&setec=2e064cde549e6be9353af2ab186597cf"
    },
    {
      "fileId": "1000155647",
      "name": "Gypsy Eyes Caravan V3 Immersive First Person Profile",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "Gypsy Eyes Caravan V3 Immersive First Person Profile-33219-.7z",
      "uploadedUnix": "1429026981",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/042520d9d3688e576b09a47e5dc3efd1331af2d3f325f038bb891e4407c63124/analysis/1429027022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gypsy%20Eyes%20Caravan%20V3%20Immersive%20First%20Person%20Profile-33219-.7z?fid=1000155647&ttl=1535810233&ri=8192&rs=8192&setec=fe01bd839327a4c2b0a6410d365c1613"
    },
    {
      "fileId": "1000238480",
      "name": "Gypsy Eyes Caravan 3.1 Beta",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "28118",
      "fileName": "Gypsy Eyes Caravan 3.1 Beta-33219-.7z",
      "uploadedUnix": "1488941964",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/8b67390f7188c564bf47f69b858c70f52aaf3e534a57bd62a17b306859240d16/analysis/1488942402/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gypsy%20Eyes%20Caravan%203.1%20Beta-33219-.7z?fid=1000238480&ttl=1535810233&ri=8192&rs=8192&setec=72b4b9c3cddbd500bd0feec14a8a1bf7"
    }
  ]
}