{
  "modId": 33248.0,
  "modName": "The Legend of Bloodlust Tomb",
  "summary": "Somewhere around Riverwood, people have been acting strangely aggressive. Could the core of Bloodlust Tomb be active again?",
  "descriptionHtml": "The Legend of Bloodlust Tomb, a mod that adds a small bit of content to your game, including a new part of the lore, weapons, clothing, and... a cow.\r\n\r\nThis mod contains not too difficult puzzles but the bosses can be quite hard if you\\'re low leveled. With good gear and a good weapon, you MAY be able to take out the Bloodlust Champion himself! But be prepared, as he LOVES to block.\r\nAgainst all bosses I used fully enchanted and tempered Stalhrim gear. BUT I recommend you level up quite a bit before you even attempt it, unless you already maxed everything out. Read the books, journals and notes in the dungeon to get to know more about the lore of this mysterious tomb!\r\n\r\nDLC Required:\r\n-None\r\n\r\nDungeon Added:\r\n-Bloodlust Tomb. The dungeon of this mod exists out of 4 parts: the entrance, the depths, the arena (boss) AND the core, where you can find the Bloodlust Core item (which you can use to empower Spurius).\r\n-Temple of Zolru: The temple of the zolru mages, hidden somewhere in bloodlust tomb.\r\n\r\nWeapons added:\r\n-Spurius: A holy sword that has a custom enchantment that NEVER ends. It burns enemies and also has a 1,98% to instantly kill the enemy. No more sacrificing power and hoping for an insta kill of Mehrunes\\' Razor.\r\n-Bloodlusty Spurius: An unholy version of Spurius, which is a bit stronger.\r\n-(Hidden)Dragoncast: A staff that can endlessly fire... well, fire. BUT of course the flames are very weak, so unless you are VERY patient, not the greatest weapon.\r\n--Both versions of Spurius can be tempered to gain some power.\r\n\r\nClothing Added:\r\n-Zolru Robes/Amulet: The equipment of the 6 Zolru Mages you can read about in game, perhaps even meet one? Just don\\'t hope for a friendly visit, who knows what the Core of Bloodlust could do to a mage who has been there for Akatosh-knows how long.\r\n\r\nMagic added:\r\n-5 Spells you can get by reading the Zolru Tomes\r\n-1 Disease called \\\"Bloodlust\\\" which makes you stronger but tires you out quickly.\r\n-1 Blessing that fortifies magicka.\r\n\r\nKnown bugs:\r\n-None\r\nCHANGELOG: \r\n\r\nUpdate 1.2: The Zolru Update\r\nContent added:\r\n-5 new Zolru Spells\r\n-1 new part of the Dungeon based on the Zolru\r\n-Dungeon Improvements\r\nRead more about the Zolru Update here: http://cowctus.blogspot.nl/2013/03/the-zolru-update.html\r\n\r\nUpcoming updates:\r\n-The Zolru Update: An update that is about the Zolru mages which are involved in the lore of this mod. In this update you will be able to get 5 new spells, get to know more about the Zolru Circle, know how they got their power AND meet the only priest of Zolru, Bormahsero. Perhaps even use the source of Zolru\\'s powers, hmmm? Also, dungeon improvements to make it slightly better.\r\n\r\n-Dungeon improvements\r\n*This one will take a while, I am going to play all of skyrim once again to see how dungeons are mostly constructed and how they have been made difficult. Sadly, I do not know how to script yet, but I am training to do so.",
  "categoryId": "88",
  "version": "1.2",
  "author": "Cowctus",
  "createdUnix": "1363187723",
  "updatedUnix": "1363530353",
  "containsAdultContent": false,
  "uploadedBy": "theherodemon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000017194",
      "name": "The Legend of Bloodlust Tomb V1_1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3185",
      "fileName": "The Legend of Bloodlust Tomb-33248-1-0.rar",
      "uploadedUnix": "1363187702",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7cba1a637e56e83b9f93698829ddbf3b3291c2e53118b77a07256bdde0d79e33/analysis/1407467467/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Legend%20of%20Bloodlust%20Tomb-33248-1-0.rar?fid=1000017194&ttl=1535810271&ri=8192&rs=8192&setec=c1829eac89c21e9f62710332261d2387"
    },
    {
      "fileId": "1000018209",
      "name": "The Legend of Bloodlust Tomb V1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5381",
      "fileName": "The Legend of Bloodlust Tomb V1_2-33248-1-2.rar",
      "uploadedUnix": "1363530353",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/a78957dcc9ca8f60f8632fc292a7fc325f8984fda191718f128dab61f151c16a/analysis/1407474146/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Legend%20of%20Bloodlust%20Tomb%20V1_2-33248-1-2.rar?fid=1000018209&ttl=1535810271&ri=8192&rs=8192&setec=bc9ccfe8eb61db4d2fb7dc3671168e27"
    }
  ]
}