{
  "modId": 33262.0,
  "modName": "Skyrim Redone Scroll Crafting Apocalypse",
  "summary": "Makes the scrolls from the great Apocalypse Spell Package (http://skyrim.nexusmods.com/mods/16225) available in Skyrim Redone\\'s scroll crafting system (the parks required are part of the new Enchanting skill tree).",
  "descriptionHtml": "WARNING: Requires Dawnguard\r\n\r\nThis mod is based on the version of SkyRe which requires Dawnguard. There is an older version which does not require it but I had forgotten about this version while making the mod. I will try to update with a version of this mod based on that SkyRe.\r\n\r\n[line]\r\nSkyrim Redone has a really interesting set of perk in the Enchanting tree which lets you use a Quill to open a new crafting menu to create scrolls. You must have the necessary perks to unlock higher level scroll crafing options. Unfortunately only vanilla spell scrolls are available with SkyRe. This is a patch which lets you create Apocalypse spell scrolls with this system. It goes without saying that both SkyRe and Apocalypse are required to use this.\r\n\r\nNot every spell added by Apocalypse is available as a scroll with this system, but I have added every scroll. So, any scroll that you have picked up with this spell package installed can now be crafted, if you have the correct perks, with a quill, inkwell, and a simple roll of paper.",
  "categoryId": "84",
  "version": "1.0",
  "author": "Darkwind Media",
  "createdUnix": "1363220540",
  "updatedUnix": "1363220395",
  "containsAdultContent": false,
  "uploadedBy": "darkwindmedia",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000017291",
      "name": "Main file",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Main file-33262-1-0.7z",
      "uploadedUnix": "1363220395",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1060a8e869bf7af3d1e5a6a0ecd0c8f271adffb601d8f7fa1f5dbaa1e73dadd9/analysis/1407468565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20file-33262-1-0.7z?fid=1000017291&ttl=1535810301&ri=8192&rs=8192&setec=5deecd6b55c76461dc6ce44c5d9b67bf"
    }
  ]
}