{
  "modId": 33297.0,
  "modName": "Easter Egg Hunt - 2013 Edition",
  "summary": "Happy Easter 2013!!!\r\n\r\nThis mod adds 250 Easter Eggs to the Nine Holds. 45 more than last year\\'s version. See how many you can find!",
  "descriptionHtml": "[center][IMG]http://i49.tinypic.com/2i7bplk.jpg[/IMG][/center]\r\n\r\nHappy Easter 2013!!! \r\n\r\nThis mod adds 250 Easter Eggs to the Nine Holds. 45 more than last year\\'s version. See how many you can find! \r\n\r\n***After Holiday Note: I hope everyone had a Happy Easter! Thank you all for subscribing and I hope you all enjoyed the hunt. I hope to see you all next year. Feel free to add me as a friend or check back once in a while to keep updated about next years edition and/or other mods I\\'m working on. Thank you all again and have a wonderful Spring!*** \r\n\r\n\r\n[b][u]Information[/u][/b] \r\n\r\nThere are twenty-five Easter Eggs in the major cities (Markath, Riften, Solitude, Whiterun, and Windhelm) plus five Special Easter Eggs and one Golden Egg in each. There are also twenty in the smaller holds (Dawnstar, Falkareth, Morthal, and Winterhold) plus three Special Easter Eggs and one Silver Egg in each. All the eggs are outdoors and within city limits. \r\n\r\nThe Easter Eggs are worth 50 gold each, The Special Easter Eggs are worth 100 gold each, the Silver Eggs are worth 250 gold each and the Golden Eggs are worth 500 gold each. A total of 18,250 in gold. \r\n\r\nThe regular Easter Eggs can be used as Alchemy ingredients. Each of the five egg types can be used to create different potions.The Special Easter Eggs offer powerful potions effects when eaten, like those already found in Skyrim. Including complete health/magicka/stamina recovery and 100% resistances. The Special Eggs will also display a little bit of lore about the town/city they are found in when first picked up. The Silver and Golden Eggs grant the player God Mode for a short time when eaten. \r\n\r\n\r\n[b][u]Those who played last year\\'s edition[/u][/b] \r\n\r\nFirst of all... Welcome back! All of last year\\'s eggs have been retextured to look more eggish. I have also added ten new textures for the special eggs, silver eggs, and golden eggs. The physics on all of the eggs has been corrected and the placements have been checked, double checked, and triple checked to be sure every egg is accessible by the player. \r\n\r\nMost of the old eggs are in the same places they were last year due to the fact that there are only so many hiding spots in these towns and cities and the difficulty of properly placing eggs where they can be accessible. If your memory is good enough to remember where they were last year then you will at least still be challenged to find the new ones :) \r\n\r\n\r\n[b][u]Compatibility[/u][/b]\r\n\r\nUse caution when running other mods during the hunt. Mods that alter the terrain or it\\'s features can cause eggs to be hidden by the ground, snow, foliage, brush, etc. and thus become inaccessible. Use your best judgement to decide which mods might cause a problem.\r\n\r\n\r\n[b][u]Misc Info[/u][/b] \r\n\r\nVirtual Easter Egg - A virtual Easter egg is an intentional hidden message, in-joke, or feature in a work such as a computer program, web page, video game, movie, book, or crossword. \r\n\r\nReal Easter Egg - Easter eggs are special eggs that are often given to celebrate Easter or springtime. The oldest tradition is to use dyed or painted chicken eggs. \r\n\r\n\r\n[b][u]Other Editions[/u][/b] \r\n\r\nGolden Egg Treasure Hunt: http://skyrim.nexusmods.com/mods/16831\r\n\r\nEaster Egg Hunt 2012: http://skyrim.nexusmods.com/mods/14190\r\n\r\n\r\n[b][u]Version Information[/u][/b] \r\n\r\nVersion 1.0 - 2013 Edition \r\n\r\n\r\n[b][u]Credits[/u][/b] \r\n\r\n\r\nLore - UESP Wiki: http://www.uesp.net/wiki/Skyrim:Skyrim",
  "categoryId": "28",
  "version": "1.0",
  "author": "KahjiitRaj",
  "createdUnix": "1363280657",
  "updatedUnix": "1363279810",
  "containsAdultContent": false,
  "uploadedBy": "KahjiitRaj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000017437",
      "name": "Easter Egg Hunt - 2013 Edition",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22081",
      "fileName": "Easter Egg Hunt - 2013 Edition-33297-1-0.7z",
      "uploadedUnix": "1363279810",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/56c0edb4dd31d320c2223f3d9f39a5e30b52c48abcf99c9e6abfd1b7342fd8eb/analysis/1407469702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Easter%20Egg%20Hunt%20-%202013%20Edition-33297-1-0.7z?fid=1000017437&ttl=1535810355&ri=8192&rs=8192&setec=d8577fdedeb532695edee3a42361eeed"
    }
  ]
}