{
  "modId": 33301.0,
  "modName": "Quest Reward Reforging - Dragonborn",
  "summary": "Reforge levelled quest reward unique items based on your level. Only (currently) including levelled items from Dragonborn, it was created to cover items not dealt with by \\\"Skyrim Leveled items can level up Unique upgrade balanced\\\" mod.",
  "descriptionHtml": "[b]the old blade\r\nexperience, component\r\nreforged[/b]\r\n\r\n(Reforge levelled quest reward unique items based on your level)\r\n\r\nThis was created to provide the items not dealt with by [url=http://skyrim.nexusmods.com/mods/7590]\\\"Skyrim Leveled items can level up Unique upgrade balanced\\\"[/url] mod that does not have support for Dragonborn items, (but so as to not be dependent on it this mod uses different recipes). As such it currently only includes Dragonborn leveled items [url=http://www.uesp.net/wiki/Dragonborn:Leveled_Items]as described by the UESP[/url]. Note that Dawnguard has no leveled items.\r\n\r\nCompatibility: All mods. This does not modify any underlying item, and works through recipes.\r\n\r\nEach item upgrade requires the following:\r\n\r\n1) The previous level leveled item\r\n2) Appropriate level\r\n3) A filled grand soul gem\r\n4) Item dependent material based on what is required to temper/fit the item, or for items that are not temperable/fittable such as a staff, an appropriate material such as a gold ingot\r\n\r\nDependencies: Dragonborn\r\n\r\nInstallation: Install manually or using your preferred mod manager (I use NMM), activating the esp\r\n\r\nUninstallation: Deactivate esp (no scripts attached etc so no need for any special procedures)\r\n\r\nInspirations:\r\n- Quazzy\\'s [url=http://oblivion.nexusmods.com/mods/5701]Quest Award Leveller[/url] for Oblivion, that solved the many frustrating levelled items in Oblivion all those years ago.\r\n- Darkangel13\\'s [url=http://skyrim.nexusmods.com/mods/7590]\\\"Skyrim Leveled items can level up Unique upgrade balanced\\\"[/url] that provided similar features for Skyrim leveled items in a balanced (and as immersive as possible) manner.\r\n- Bethesda for the great game\r\n\r\n\\\"Uncredits\\\":\r\n- Bethesda for still including roleplaying-gimping levelled uniques, though thankfully many fewer than in Oblivion",
  "categoryId": "27",
  "version": "1",
  "author": "Mallard7",
  "createdUnix": "1363284001",
  "updatedUnix": "1363284001",
  "containsAdultContent": false,
  "uploadedBy": "mallard7",
  "primaryFile": null,
  "files": []
}