{
  "modId": 33326.0,
  "modName": "Better Imperial Luck",
  "summary": "A simple and highly compatible mod that increases the amount of extra gold found with the Imperial Luck perk and adds a small chance of finding a gemstone as well. This mod's main page also includes info regarding a quest-related bug with the Imperial Luck perk that's causing it to be activated on all races instead of just Imperials.",
  "descriptionHtml": "This mod is intended for Skyrim version 1.8.151.0.7 or higher. Older versions of Skyrim might not work with this mod.\n<br />[line]\n<br />[color=red][size=5]IMPORTANT INFORMATION REGARDING A BUG WITH THE IMPERIAL LUCK PERK AND HOW TO FIX IT:[/size][/color]\n<br />\n<br />Something I've found out in the process of creating this mod is that Skyrim still has an unresolved bug relating to the Imperial Luck perk which is causing the perk to be activated on [b][u]all races[/u][/b] instead of just on Imperials. This bug occurs at stage 5 of the quest \"Before The Storm\"; specifically, the moment you exit the cave beneath Helgen Keep. Why Bethesda chose that spot to handle adding the Imperial Luck perk to characters is beyond me, but the point is that they forgot to add a [i]race check[/i] to that part of the game and as such [i]every character in the game has the Imperial Luck perk active on them[/i]. The presence of this bug is current as of Skyrim version 1.9; USKP version 1.3.1 fixes this bug, however.\n<br />\n<br />Checking for and fixing this bug:\n<br />Use the command \"GetGlobalValue ImperialLuck\" to check for this bug. If it returns a value of 100, that means the perk is not active. However if it returns a value of 0 it means the perk is active, and if you get a value of 0 on a non-Imperial that means the character is bugged. In order to fix the bug, use the console command \"set ImperialLuck to 100\" in order to deactivate the Imperial Luck perk on that character. This fix persists through saves, so you'll only have to do this once per character.\n<br />\n<br />Why I'm not currently including a fix for the bugged quest with this mod:\n<br />Because USKP 1.3.1 already includes a fix for this bug, and also because I'm still currently not very good with Papyrus scripts, I've opted to not include a bugfix in the mod itself. As a result of this, you'll have to manually bugfix your new characters with the above console commands every time you leave the cave under Helgen Keep for the first time, until an official or unofficial patch for the bug comes out. I'm sorry if this inconveniences you.\n<br />[line]\n<br />The Better Imperial Luck mod is a simple and highly compatible mod that adjusts the \"Imperial Luck\" perk so that it has a more noticeable impact on an Imperial character's gameplay, particularly during the early and middle portions of the game. It's still likely to become a mostly irrelevant perk later on in the game, but that's simply the unfortunate eventuality of perks and systems that relate to wealth in Skyrim. If anyone has ideas for ways that this perk can be further improved to try and keep it more relevant later on in the game, I'd love to hear about it in the comments section.\n<br />\n<br />This mod was also created with compatibility in mind; no new scripts are added to the game by this mod, as those create considerable save file and compatibility problems - particularly if or when you decide to stop using a mod. To the best of my knowledge, the design of this mod is such that it can be easily installed and uninstalled with no ill effects on one's save files.\n<br />\n<br />The Imperial Luck perk's effects [u]without[/u] this mod:\n<br />100% chance of finding an extra 2-10 gold in various corpses, chests, etc.\n<br />\n<br />The Imperial Luck perk's effects [u]with[/u] this mod:\n<br />100% chance of finding an extra 10-50 gold in various corpses, chests, etc, and a 2% chance of finding a gemstone.\n<br />\n<br />Additionally, this mod alters descriptions relating to the perk found in both the race selection menu for Imperials and the perk effect listed under Active Effects. Because of this, any mods that make alterations to the Imperial race data (if any such mods exist) are likely to conflict with this mod. Loading this mod before any such mods will resolve the conflict, but will likely cause the description in the race menu to go back to the default description.\n<br />\n<br />Installation:\n<br />Either use the Nexus Mod Manager, or copy Better_Imperial_Luck.esp into the Data subfolder of your Skyrim installation directory and then enable it in the launcher.\n<br />\n<br />Uninstallation:\n<br />Either disable it in the Nexus Mod Manager, or delete Better_Imperial_Luck.esp from the Data subfolder of your Skyrim installation directory.\n<br />\n<br />That's all there is to this mod. Enjoy!\n<br />\n<br />My other mods:\n<br />[url=http://skyrim.nexusmods.com/mods/32284]Hoodswap[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/32422]College of Winterhold Shop Fixes - Mage Hoods - Robes - Gloves - Boots - Psiijic - Etc[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/32761]Better Divine Blessings[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33016]Better Daedric Blessings[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/32817]Silda the Unseen Master[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33062]Unleveled Skyrim Items[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33069]Unleveled Dragonborn Items[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33135]Gemstone Recovery[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/33614]Better Standing Stones[/url]",
  "categoryId": "24",
  "version": "1.0",
  "author": "SkylerModder",
  "createdUnix": "1363316974",
  "updatedUnix": "1363315335",
  "containsAdultContent": false,
  "uploadedBy": "SkylerModder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000017545",
      "name": "Better_Imperial_Luck_v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Better_Imperial_Luck_v1_0-33326-1-0.7z",
      "uploadedUnix": "1363315335",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/da18893beb35b5689d1af4fe6976fe1ea2ea2f7207d2bdb751cef8fdbb21eb66/analysis/1407470493/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better_Imperial_Luck_v1_0-33326-1-0.7z?fid=1000017545&ttl=1535810408&ri=8192&rs=8192&setec=dd24c9d1b11a610421a4623d69db001e"
    }
  ]
}