{
  "modId": 33364.0,
  "modName": "Skyrim HD Realism Sky",
  "summary": "HD images taken from the Hubble Space Telescope (HST) for your night sky.",
  "descriptionHtml": "    Do you ever get bored of the default night sky Texture for Skyrim? This mod pack allows you to select which sky texture which you would like to see in your game, and liven up your Skyrim nighttime experience. All of the images included were taken from the Hubble Space Telescope (HST), which are of only the highest quality. The original image sizes are over 60MB, so you know that you will be getting the best standard possible.\r\n\r\n    Installation Instructions:\r\n\r\n    Locate your Skyrim directory (e.g. C:\\\\Games\\\\The Elder Scrolls V- Skyrim). Go to data. Go to textures. Go to your sky folder. If you don\\\\\\'t already have a sky folder, then just create a new folder, and call it,\\\"sky\\\", without the quotation marks.\r\n\r\n    Sky Textures:\r\n\r\n    1. The Eagle Nebula\r\n          Appearing like a winged fairy-tale creature poised on a pedestal, this object is actually a billowing tower of cold gas and dust rising from a stellar nursery called the Eagle Nebula. The soaring tower is 9.5 light-years or about 90 trillion kilometres high, about twice the distance from our Sun to the next nearest star.\r\n\r\nStars in the Eagle Nebula are born in clouds of cold hydrogen gas that reside in chaotic neighbourhoods, where energy from young stars sculpts fantasy-like landscapes in the gas. The tower may be a giant incubator for those newborn stars. A torrent of ultraviolet light from a band of massive, hot, young stars [off the top of the image] is eroding the pillar.\r\n\r\nThe starlight also is responsible for illuminating the tower\\'s rough surface. Ghostly streamers of gas can be seen boiling off this surface, creating the haze around the structure and highlighting its three-dimensional shape. The column is silhouetted against the background glow of more distant gas.\r\n\r\nThe edge of the dark hydrogen cloud at the top of the tower is resisting erosion, in a manner similar to that of brush among a field of prairie grass that is being swept up by fire. The fire quickly burns the grass but slows down when it encounters the dense brush. In this celestial case, thick clouds of hydrogen gas and dust have survived longer than their surroundings in the face of a blast of ultraviolet light from the hot, young stars.\r\n\r\nInside the gaseous tower, stars may be forming. Some of those stars may have been created by dense gas collapsing under gravity. Other stars may be forming due to pressure from gas that has been heated by the neighbouring hot stars.\r\n\r\nThe first wave of stars may have started forming before the massive star cluster began venting its scorching light. The star birth may have begun when denser regions of cold gas within the tower started collapsing under their own weight to make stars.\r\n\r\nThe bumps and fingers of material in the centre of the tower are examples of these stellar birthing areas. These regions may look small but they are roughly the size of our solar system. The fledgling stars continued to grow as they fed off the surrounding gas cloud. They abruptly stopped growing when light from the star cluster uncovered their gaseous cradles, separating them from their gas supply.\r\n\r\nIronically, the young cluster\\'s intense starlight may be inducing star formation in some regions of the tower. Examples can be seen in the large, glowing clumps and finger-shaped protrusions at the top of the structure. The stars may be heating the gas at the top of the tower and creating a shock front, as seen by the bright rim of material tracing the edge of the nebula at top, left. As the heated gas expands, it acts like a battering ram, pushing against the darker cold gas. The intense pressure compresses the gas, making it easier for stars to form. This scenario may continue as the shock front moves slowly down the tower.\r\n\r\nThe dominant colours in the image were produced by gas energized by the star cluster\\'s powerful ultraviolet light. The blue colour at the top is from glowing oxygen. The red colon in the lower region is from glowing hydrogen. The Eagle Nebula image was taken in November 2004 with the Advanced Camera for Surveys aboard the NASA/ESA Hubble Space Telescope.\r\n\r\n    Thanks for the continued downloads,\r\n          EsvDefcon",
  "categoryId": "74",
  "version": "v1.0",
  "author": "EsvDefcon",
  "createdUnix": "1363366925",
  "updatedUnix": "1363366925",
  "containsAdultContent": false,
  "uploadedBy": "EsvDefcon",
  "primaryFile": null,
  "files": []
}