{
  "modId": 33374.0,
  "modName": "My kindof Useful Spells",
  "summary": "A few of my fav. spells I made with Oblivion spell crafting system for Skyrim!",
  "descriptionHtml": "Hello, it\\'s been a while. I\\\\\\'m not a modder, I just like to play around with the CK & I\\\\\\'d want to learn how to create mods so please give me feedback & suggestions so I may improve myself.\r\n\r\nSo I was missing my favorite spells I made with spell crafting back in Oblivion & I\\\\\\'m kind of sad that even if I\\\\\\'m the arch mage, I don\\\\\\'t have any powerful spells at all! So I load up the CK & make them!\r\n\r\nWhile I was on a CK, my friend & asked me what am I doing & he was interested to try the spells out after I told him how powerful they are, since he\\\\\\'s leaving to Japan for a year in a couple of days, so I just want him to got a chance to play with it before he left.\r\n\r\nUpdates\r\n1.0) Initial Release\r\n1.1) 2 More spells added\r\n\r\nMod description\r\nAdd 4 new powerful spells to the game. These spells are aimed for end game, fighting modded bosses & monsters & mage characters primarily. Although I made all the tomes to be vendor items, but to make up for it\\\\\\'s overpoweredness, I made the spell tomes expensive & the spells itself to be use lots of mana to cast. I\\\\\\'ll tell you where to look for the tomes, but you have to find them out yourself ;)\r\n\r\nElemental Kiss (OP)\r\n-Deals 100 fire, frost, shock damage & 50 damage overtime for 3 seconds.\r\nI really meant this 1 for end game, it can 1 hit kill pretty much everything. According to my test run with Deadly Dragons on with max difficulty, it can take down an ancient dragon in 5 shots.\r\n\r\nYou can find the tome somewhere in the arch mage quarter.\r\n\r\nElemental Trident (OP)\r\n-This is the same as Elemental Kiss, but also deals splash damage.\r\nThis is also meant for the end game, this 1 is more focused on dealing with large enemy groups or in tight walkways.\r\n\r\nYou can find the tome somewhere in the Temple of the Divines in Solitude\r\n\r\nPoisonfang (OP)\r\n-Deals 200 poison damage over 5 seconds & also 5 seconds of paralysis.\r\nIt can 1 hit kill many normal NPCs, it won\\\\\\'t kill undead & dragons. The dragons are immune to paralysis as far as I can tell, but not the poison. Tried this with Deadly Dragons on, hurts an ancient dragon just a little bit.\r\n\r\nYou can find the tome somewhere in Honorhall Orphanage (wink wink nudge nudge)\r\n\r\nPoison Arrow\r\n-Deals 50 poison damage to target, paralyzes target for 15 seconds & if target dies within 15 seconds, fills a soul gem.\r\nThis 1 should be more balanced as it\\'s not all that powerful & doesn\\'t take insane amount of mana to cast. I don\\'t know about you but I just hated it to get close to cast soul trap, back in Oblivion I also made this spell, saves me a lot of time!\r\n\r\nYou can find the tome somewhere in Arcadia\\'s Couldron.\r\n\r\nParamedic\r\n-Heals all friendly NPCs in an area for 100 hp, targeted NPC will not flee for 1 minute.\r\nI don\\'t know about you, but I\\'m so sick & tired of dumb NPCs thinking they can take on an ancient dragon or a zombie horde with their tiny butter knife & always get in your way & when you accidentally hit them (because they ran in to your way or to your spells) they all try to kill you or hurl you to jail. Fine, if these smartass think they can do it? Fine, but the problem is, they can\\'t & they get themselves killed in less than 5 seconds! If you don\\'t want that to happen, you have to nurse them with your healing spells. Well here it is, a splash healing spell that also gives them a temporary confidence boost. This spell is short ranged, not all that short but enough distance to keep you from getting caught up in the fight. Tested this with 5 fierce trolls (Levelers Tower) & the entire Whiterun with 5 more guards, the battle takes half the in game day & 2 women died during the test of this mod! The trolls received no casualties because they recovered too fast & the puny guards can\\'t hit hard enough!\r\nBut this spells will be useful if you have many followers & you want to heal all of them at the same time, or maybe for roleplay purposes?\r\n \r\nYou can find the tome somewhere in the Temple of Kynareth.\r\n\r\nFirst Aid Kit\r\n-Heals 50 hp, 25 magicka for 3 seconds, 50 stamina, iron skin for 1 minute & cure disease.\r\nJust like the name suggests, if you\\\\\\'re in need of a quick buff & heal in the middle of a fight, this is what you\\'re looking for. This spell can be useful in the early game as they don\\'t use much mana.\r\n\r\nYou can find the tome somewhere in the Sleeping Giant Inn\r\n\r\nOr...\r\njust console them XD\r\ntype help \\\\\\\"(item name here)\\\\\\\"\r\nplayer.additem (item id)\r\nor \r\nplayer.placeatme (item id)\r\n\r\nRequirement\r\nNone\r\n\r\nInstallation\r\nExtract the file to SteamApps\\\\\\\\common\\\\\\\\skyrim\\\\\\\\Data\r\n\r\nKnown Issues\r\nNot that I know of\r\n\r\nIncompatibilities\r\nAnything that changed how magic works or mods that enhance fire or ice.\r\n\r\nWhat I\\\\\\'ve learned\r\n-Just because that\\\\\\'s what it said on the CK doesn\\\\\\'t mean that\\\\\\'s what it will looks like in the actual game\r\n-When mix destruction spells together, you\\\\\\'ll have frost graphics for them\r\n-Types of spells & how restrictive CK can be\r\n\r\nFuture plans\r\n-I\\\\\\'ll add some more spells when I know how to get them, I was a bit sad I can\\\\\\'t get all the spells I made back in Oblivion to Skyrim \r\n-I\\\\\\'ll definitely need help!\r\n\r\nLegal stuff\r\n-Do whatever you want\r\n\r\nLastly, I hope you enjoy this mod the same way I enjoy testing them, be sure to give feedback & suggestions :D\r\nEven better, show you killing a big bad boss with the spells!\r\nOK I asked too much, I\\\\\\'m gonna go now...\r\n\r\n\r\n\r\n",
  "categoryId": "75",
  "version": "1.1.1",
  "author": "laomaster",
  "createdUnix": "1363378448",
  "updatedUnix": "1363424991",
  "containsAdultContent": false,
  "uploadedBy": "laomaster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000017911",
      "name": "My kindof Useful Spells",
      "version": "1.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "My kindof Useful Spells-33374-1-1-1.rar",
      "uploadedUnix": "1363424991",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b7e24b20e1742430181f0b04318e466eb2d597c0808a8417f59ee8b0e13ea281/analysis/1407472450/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20kindof%20Useful%20Spells-33374-1-1-1.rar?fid=1000017911&ttl=1535810473&ri=8192&rs=8192&setec=ae57df577e34e80595b0137c4040e635"
    }
  ]
}