{
  "modId": 33388.0,
  "modName": "Sasha Nord Female Follower Marriageable Quiet Sophistication",
  "summary": "Follower version of Sasha Nord Female Save Game",
  "descriptionHtml": "Sasha Nord Female Follower Marriageable Quiet Sophistication.\r\n\r\n(If you can call ancient Nord leather sophisticated)\r\nSasha is a recreation of one of my favorite self-created toons.  I did my best to make her look like Sasha the save game.  Sasha the follower is in the foreground, Sasha, the level two save game in the background.  As with my save game version of this toon, please follow the below instructions carefully.\r\n\r\nSasha can be married. She’s setup as a combat scout, ranged fighter and will level up to level 81.  I gave her several perks to make her viable at higher levels so she’s a bit overpowered early on.  Perks include stealth, muffled movement, light foot, silence, deadly aim, overdraw, power shot, quick shot, bullseye, critical shot, and ranger.  This will bother some, but personally I enjoy that this build doesn’t step on traps, get you spotted by the enemy constantly, feels like an actual partner and such.\r\n\r\nShe should look exactly as pictured as of 3/15/2013 so long as you have no conflicting mods.  For instance, if you use CBBE, DO NOT use the CBBE face textures.\r\n\r\nTo get here to look right please install the following mods – in order:\r\n\r\nhttp://skyrim.nexusmods.com/mods/6953  Better Face Gen\r\n\r\nhttp://skyrim.nexusmods.com/mods/9897  RANs Tweaked FaceMenu\r\n\r\n(I’m not sure it’s necessary but I did use it to adjust the eyes)\r\n\r\nhttp://skyrim.nexusmods.com/mods/7127  RANs HeadMesh Variants – B\r\n\r\nhttp://skyrim.nexusmods.com/mods/2812  Better Females by Bella\r\n\r\nhttp://skyrim.nexusmods.com/mods/2812  Better Females by Bella Makeup version one\r\n\r\nhttp://skyrim.nexusmods.com/mods/13722  The Eyes of Beauty\r\n\r\nhttp://skyrim.nexusmods.com/mods/18110  Hair packs of TES IV Oblivion for Female Only – Oblivionhairs 01\r\n\r\nhttp://skyrim.nexusmods.com/mods/2666 Calientes Female Body Mod Big Bottom Edition –CBBE was used in creation of this follower.  I’m really not sure how she’ll look without it.\r\n\r\nShe’s in the Riverwood Sleeping Giant Inn.  Known Bug: unfortunately she may disappear into the basement.  If this happens, exit the Inn, save the game, exit to desktop and try again.\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "Hirram",
  "createdUnix": "1363399716",
  "updatedUnix": "1363399560",
  "containsAdultContent": false,
  "uploadedBy": "Hirram",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000017830",
      "name": "Sasha Marriageable Nord",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Sasha Marriageable Nord-33388-1-0.zip",
      "uploadedUnix": "1363399560",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6ac9b476df0aebacb486071d1cfa52eff07f3e466c927e2d30fe66be4599b867/analysis/1407472083/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sasha%20Marriageable%20Nord-33388-1-0.zip?fid=1000017830&ttl=1535810491&ri=8192&rs=8192&setec=23f01692f37c2f49eb49b4f2a8c5b0ac"
    }
  ]
}