{
  "modId": 33387.0,
  "modName": "Dragons Roost",
  "summary": "Small tower fortress atop a high mountain in Southern Skyrim. Comes with every crafting utensil, a few merchants, display units and plenty of storage. Everything is exterior to remove the need for loading screens. ",
  "descriptionHtml": "The Dragons Roost is perched high up in the mountains in Southern Skyrim. Originally a small mining colony the humble village was later fortified in order to serve as a satellite fort to the much larger Helgen, assisting her in the duty of watching the roads and borders of Skyrim. \r\n\r\nDrawn to the promise of the location and the lure of its gold mines the Roost has since been overrun by bandits during the chaos of the civil war, although some hardy townsfolk and miners remain under their oppression.\r\n\r\n\r\n\r\nThis is not supposed to be a grand castle nor does it come with any god items or treasure. It does however, boast an excellent view (when it is not snowing!) and includes every crafting utensil that one can imagine. I hope. \r\n\r\nIt has its own map marker and the player home, in the tallest tower is built entirely in exterior cells (along with all crafting areas) - all to make the tower more convenient.\r\n\r\nThere are mannequins, a few display cases and more storage chests then one can shake a stick at.\r\n\r\n\r\nBe advised there are currently a good number of bandits that live in the town and watch the primary approach to the Roost - They are not set to respawn and certainly wont make good neighbours. (I refuse to simply hand the player such a thing for nothing!).\r\n\r\n\r\nOne final thing, there seems to be a navmesh bug that prevents me from joining particular areas of mesh together. I am not sure what causes this so have no idea how to fix it. If anyone does, please do pm me. This means that the tower is probably not greatly follower friendly.\r\n\r\nOn the up side, by extension this means that you might have to take the fortress from the bandits alone. Ha. If you survive the battle then you deserve the prize. If not, well .. \r\n\r\n\r\n\r\nEdit - Grammar police please note that I have removed apostrophes from the above work only because it caused an odd effect when I uploaded the text. It pains me to write something that requires apostrophes without any!",
  "categoryId": "67",
  "version": "1.1",
  "author": "Voidshard",
  "createdUnix": "1363399558",
  "updatedUnix": "1364614682",
  "containsAdultContent": false,
  "uploadedBy": "Voidshard",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021053",
      "name": "DragonsRoost1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "303",
      "fileName": "DragonsRoost1_1-33387-1-1.7z",
      "uploadedUnix": "1364614682",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f9289b585678a50780a8bbf47f7721f1a3f03d44775648fabc87042315b141fd/analysis/1407494827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DragonsRoost1_1-33387-1-1.7z?fid=1000021053&ttl=1535810489&ri=8192&rs=8192&setec=a63930b3f2648b3fa1751953fead86f8"
    }
  ]
}