{
  "modId": 33418.0,
  "modName": "The Mace of Baal",
  "summary": "THIS MOD WILL MODIFY THE ENCHANTMENT OF THE MACE, AND MAKE IT A SPELL FOR BRINGING MOLAG BAL\\'S WRATH FORTH FROM OBLIVION.",
  "descriptionHtml": "If you have come this far you probably want to install my mod, and maybe you would like some spesifications? Here you go:\r\n\r\n\r\nYou will find a spell tome in the Abandoned house in Markarth. The spell tome lies before Molag Bal\\'s Altar, and you can just go pick it up, nomatter if you\\'ve done the quest or not. (Sorry, I have no idea how to make the quest reward ( i TRIED, and it might be that you will get the conjuration book upon finishing the quest, but most likely, nothing will happen), and besides, most of you already finished the quest, and would be unable to aquire it otherwise.\r\n\r\nThe spell-tome respawns at the shrine aswell in case you were to loose it somehow before you learned it, this also means a follower could learn the spell if helped by one of the popular FO-mods, but I doubt that a follower would use it unless you use the AFT, setting it a forced spell.\r\n\r\n\r\n\r\nWhat I did:\r\n\r\n- made a spell tome --> place it by the altar.\r\n- had a spell attached to the tome, and the mace of molag bal attached to the spell.\r\n- I also altered the enchantment, so that it now would pack a punch to the enemy\\'s magicka and stamina (damaging 50pts for 50 secs each(which is quite powerful)) aswell as draining 5pts of health (just for the red effect). It will also have a 3sec soul capture chance, as default.. \r\n- changed the duration to five days, so you wont need to recast it to ofthen... (sheathe to disspel)\r\n- Changed the enchantment so that it will (close to) never be needed recharged..\r\n\r\nThis is not overpowered, yet more powerfull than the original.. I ADWIZE YOU TO USE THIS LATER IN THE GAME, OR ON EXPERT/MASTER/LEGENDARY SETTINGS!\r\n\r\n\r\nIMPORTANT!!! (i think)\r\n\r\nYou should really use the Amidianborn, darker retexture with this. I personally think It looks supreme!!!\r\n\r\n- http://skyrim.nexusmods.com/download/1000011487\r\n\r\n\r\n\r\nConflicts...\r\n\r\nI think It will conflict of you use the mounted casting mod, and cast the mace untop of a horse.. You will not be able to disspell it as easely, and it would be buggy..\r\n\r\nIt would also conflict with anything that alters the mace\\'s statistics..\r\n\r\n--###--- that would be all ---###-- ",
  "categoryId": "55",
  "version": "1.1.1.1.1",
  "author": "TheFlamingDaedra",
  "createdUnix": "1363454953",
  "updatedUnix": "1363454936",
  "containsAdultContent": false,
  "uploadedBy": "TheFlamingDaedra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000017996",
      "name": "Finalyzed mod",
      "version": "1.1.1.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Finalyzed mod-33418-1-1-1-1-1.rar",
      "uploadedUnix": "1363454936",
      "modVersion": "1.1.1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5d73507f2d4595f5686b18244d7b36cd345505128a5abd4d3ce1e02be119025e/analysis/1407472925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Finalyzed%20mod-33418-1-1-1-1-1.rar?fid=1000017996&ttl=1535810531&ri=8192&rs=8192&setec=7e035e6cead9d473d1bfe7c6938156cd"
    }
  ]
}