{
  "modId": 33431.0,
  "modName": "NS Kits",
  "summary": "I know, many mods add kits to the beginning. But looking around, I realized most of them aren\\\\\\'t balanced with each other (ei; some are WAYYY better than others), and many are too overpowered for the very beginning of the game. I added kits that have weak, yet not too weak, armor and weapons. Most have one or two enchanted items, but weak enchant",
  "descriptionHtml": "Hello all! I\\'m working on a mod at the moment named the NS Mod, or NethanielShade\\'s Mod. It\\'s basically a mod that would be fun for me, and I\\'m uploaded to the community for anyone else who wants it. But as I\\'m working on it, I\\'ll also be uploading it in parts. This is the first part, named NS Kits (Dawnguard), or Nethaniel Shade\\'s Kits (Dawnguard). It adds 11 new kits to Helgen Keep. Now I know, many mods add kits to the beginning. But looking around, I realised most of them aren\\'t balanced with each other (ei; some are WAYYY better than others), and many are too overpowered for the very beginning of the game. I added kits that have weak, yet not too weak, armor and weapons. Most have one or two enchanted items, but weak enchantments. The kits\\' aim is to nudge you in the right direction of a certain \\'class\\' or path in Skyrim, without launching you into it and still giving you time to turn back a different route. This is technically my second mod,\r\n\r\nThe Kits will be listed below: \r\n\r\n•Assassin - 2 Steel Daggers, Leather Curiass, Leather Gauntlets, Leather Helmet, Leather Boots enchanted with Fortify Sneak, and 10 Frostbite Venom. \r\n•Thief - 2 Steel Daggers, Leather Curiass, Leather Gauntlets enchanted with Fortify Lockpicking, Leather Helmet, and Leather Boots. \r\n•Archer - Hunting bow, Iron Dagger, 100 Iron Arrows, Leather Curiass, Leather Gauntlets enchanted with Fortify Archery, Leather Helmet, and Leather Boots. \r\n•Mage - Steel Dagger, 2 Firebolt Scroll, Spell Tome: Bound Sword, Mage Hood [unenchanted], Mage Robes [unenchanted]. \r\n•Knight - Iron Sword, Iron Banded Shield enchanted with Fortify Block, Iron Curiass enchanted with Fortify Health, Iron Gauntlets, Iron Helmet, and Iron Boots. \r\n•Brute - Iron Warhammer, Iron Curiass enchanted with Fortify Health, Iron Gauntlets, Iron Helmet, and Iron Boots. \r\n•Warrior - Iron Greatsword, Iron Curiass enchanted with Fortify Health, Iron Gauntlets, Iron Helmet, and Iron Boots.\r\n•Stormcloak - Iron War Axe, Hide Shield, Stormcloak Curiass, Stormcloak Officer Gauntlets, Hide Helmet, Stormcloak Officer Boots. \r\n\r\n\r\nDawnguard Version Adds:\r\n\r\n•Dawnguard Archer - Crossbow enchanted with Fire Damage 01, Iron Sword enchanted with Turn Undead 01, Dawnguard Curiass (light), Dawnguard Gauntlets (light), Dawnguard Helmet (light) with it\\'s unique enchantment, and the Dawnguard Shield with it\\'s unique enchantment. \r\n•Dawnguard Brute Heavy - Dawnguard Warhammer with it\\'s unique enchantment, Dawnguard Curiass (heavy), Dawnguard Gauntlets (heavy), and the Dawnguard Helmet (heavy) with it\\'s unique enchantment.\r\n•Vampire Kit - Steel Dagger with Fear enchantment, Steel Dagger with Frost enchantment, Red Vampire Armor, Vampire Guantlets, Vampire Boots, Vampire Robes with Destruction Enchantment, and 10 Blood Potions.\r\n\r\nSome may think that the Dawnguard Kits are a bit stronger and unbalanced with the other kits. Well, I think they aren\\'t too much stronger, yet strong enough to be a reward to those who paid for Dawnguard yet not be game-breaking or considered cheating.\r\nAlso, if you get the Dawnguard DLC required version do not get the non-Dawnguard version, as this contains everything the non-Dawnguard version has, plus more.\r\n\r\n\r\n\r\nI\\'m thinking of adding, but may or may not add; \r\n-Thalmor Kit \r\n-Imperial Kit\r\n\r\nFAQ:\r\nI\\'ll add to this section when people start asking questions\r\n\r\nBugs:\r\n•Equipping the Dawnguard Shield prevents the Well Fitted, Custom Fit and Matching Set perks from functioning.\r\n---This bug is fixed by the Unofficial Dawnguard Patch. (I can\\'t recommend this, as I don\\'t have the UDP and will never get any of the unofficial patches, but if you want to do it you can.)",
  "categoryId": "24",
  "version": "v1.00",
  "author": "NethanielShade",
  "createdUnix": "1363472298",
  "updatedUnix": "1363471958",
  "containsAdultContent": false,
  "uploadedBy": "NethanielShade",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000018057",
      "name": "NS Kits Vanilla",
      "version": "v1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "NS Kits Vanilla-33431-v1-00.zip",
      "uploadedUnix": "1363471899",
      "modVersion": "v1.00",
      "virusScanUrl": "https://www.virustotal.com/file/c6a9d923408565fabdfd65a4dd832d20762c40f7648191110a2f394116651323/analysis/1407473168/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NS%20Kits%20Vanilla-33431-v1-00.zip?fid=1000018057&ttl=1535810550&ri=8192&rs=8192&setec=8a60a4bf71ca4dbba578fa55143942c2"
    },
    {
      "fileId": "1000018058",
      "name": "NS Kits Dawnguard",
      "version": "v1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "NS Kits Dawnguard-33431-v1-00.zip",
      "uploadedUnix": "1363471958",
      "modVersion": "v1.00",
      "virusScanUrl": "https://www.virustotal.com/file/94118dba52f788ec855a30a70ba8dd2b712e5a5474d5019648fe528aa6372fe5/analysis/1407473169/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NS%20Kits%20Dawnguard-33431-v1-00.zip?fid=1000018058&ttl=1535810550&ri=8192&rs=8192&setec=be3a98aa9cae913dc621df22035a8b8a"
    }
  ]
}