{
  "modId": 33449.0,
  "modName": "Skald Favor Quest - Level Requirement Fix",
  "summary": "Upset that Heljarchen Hall is the only Hearthfires property with a stupid level requirement? Feel brave enough to tackle a giant at level 20, rather than 22? Can\\'t buy land in The Pale? Here\\\\\\'s your solution.",
  "descriptionHtml": "Upset that Heljarchen Hall is the only Hearthfires property with a stupid level requirement? Feel brave enough to tackle a giant at level 20, rather than 22? Can\\'t buy land in The Pale? Here\\'s your solution.\r\n\r\nThis mod is a VERY, VERY simple fix to a problem that has frustrated me since Hearthfires was released: Why can\\'t I buy land in The Pale? What do you mean there\\'s a level requirement?! I DON\\'T WANT TO WAIT TO BUY HELJARCHEN HALL!\r\n\r\n\\\"Kill the Giant\\\", the favor quest from Skald the Elder in Dawnstar, must be completed before he\\'ll let you purchase the property for Heljarchen Hall. This mod simply removes the completely unnecessary requirement that you be level 22 before you can be offered the quest. Skald will still refuse to discuss anything until you solve the nightmare problem in Dawnstar, and you will still have to kill a giant before the Jarl (either of them) will sell you the land.\r\n\r\n** Compatibility **\r\nShould work with everything. I don\\'t know of any mods that alter the Favor153 quest, including the Unofficial Skyrim/Hearthfires Patch(es). Does not require Hearthfires DLC, as the favor quest is in vanilla Skyrim, though I can\\'t imagine much use for this fix without Hearthfires.\r\n\r\n******\r\nIf you\\'re looking for a fix to the bug that sometimes keeps you from turning in the quest--and therefore buying land in the Pale--there is already a fix available (below). However, that\\'s a separate issue from the level requirement that keeps you from starting the quest in the first place. \r\n\r\nSkald Bounty Fix: http://skyrim.nexusmods.com/mods/13903\r\n\r\nI honestly don\\'t know if that bug still exists, or if it was fixed in either an official update or in the Unofficial Skyrim Patch. But it comes up a lot when trying to find a fix for buying land in the Pale.",
  "categoryId": "84",
  "version": "1.0",
  "author": "Deome",
  "createdUnix": "1363505643",
  "updatedUnix": "1363505506",
  "containsAdultContent": false,
  "uploadedBy": "Deome",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000018130",
      "name": "SkaldFavorNoLevelReq",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "SkaldFavorNoLevelReq-33449-1-0.7z",
      "uploadedUnix": "1363505506",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1cbadfa3656f0e39be820b437c051be4e6d0b22a2a0dfe39fbcbd11581247ad/analysis/1407473794/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkaldFavorNoLevelReq-33449-1-0.7z?fid=1000018130&ttl=1535810574&ri=8192&rs=8192&setec=1b4918297e392243f2f1f1e2a6d00298"
    }
  ]
}