{
  "modId": 33469.0,
  "modName": "Ash Magic",
  "summary": "An attempt to increase the variety of ash-themed spells introduced in Dragonborn DLC.\r\n\r\nVersion 1.2 finally released!",
  "descriptionHtml": "The mod \\\"Ash Magic\\\" brings new ash-themed spells to Skyrim, as well as some improved versions of existing ones. 13 new spells have been added so far. This is my third mod and I\\'m still unexperienced at modding, so any constructive criticism is appreciated, as always.\r\n\r\nList of Spells:\r\n*Ashbolt (named Ash Firebolt prior to v1.1) - a unique form of firebolt which is used by the Ash Spawn. This destruction spell has less flames, more smoke, and throws off a small shower of sparks on contact. Adept Destruction spell.\r\n*Ash Armor - an alternative to Ebonyflesh, an alteration spell that encases the caster in hardened ash for a limited amount of time. Expert Alteration spell.\r\n*Searing Embers - a spell which you may have seen being cast by Ash Guardians, which throws a wave of heated ash at enemies. Adept Destruction spell.\r\n*Greater Ash Shell - this spell is almost identical to default Ash Shell, except that enemies encased in ash can be attacked and take damage. Expert Alteration spell.\r\n\r\nList of Spells (v1.1):\r\n*Ash Cloak - this spell cloaks the caster in heated ash that does fire damage to nearby enemies. Adept Destruction spell.\r\n*Ash Storm - a very damaging ash explosion centered on the caster. Does more damage to closer targets. Master Destruction spell.\r\n*Bound Ash War Axe (named Bound Ash Spawn War Axe prior to v1.2) - a spell that allows the caster to summon a war axe used by the Ash Spawn. Adept Conjuration spell.\r\n*Bound Ash Battleaxe (named Bound Ash Spawn Battle Axe prior to v1.2) - summons the battle axe used by the Ash Spawn. Adept Conjuration spell.\r\n\r\nAlso, a new enchantment was added by version 1.1, called \\\"Greater Ash Shell\\\", which has a chance of encasing the target in hardened ash for a limited amount of time. New cuirass, called \\\"Ash Mail\\\", has been added as well, which has a chance of spawning an ash explosion on hit, dealing damage to close targets.\r\n\r\nList of Spells (v1.2):\r\n*Ashball - ash version of Fireball. Does about the same damage. Adept Destruction spell.\r\n*Immolate - ash version of Incinerate. Also does about the same damage. Expert Destruction spell.\r\n*Fire Stream - the spell used by Dragon Priest Ahzidal, similar to Fire Breath shout. Expert Destruction spell.\r\n*Conjure Unbound Ash Spawn - summons a stronger version of the Ash Spawn to fight for the caster. Expert Conjuration spell.\r\n*Ash Feast - causes (almost) every creature/NPC to attack anyone, similar to Mayhem. Master Illusion spell.\r\n\r\nThere is also an \\\"Eruption\\\" spell added by v1.2, which basically has the same effect as Alduin\\'s Storm Call shout. It is buggy, and may not work, so it\\'s only accessible via console command (help eruption). Use at your own risk.\r\n\r\nEverything is placed inside the chest behind Tel Mithryn, near the heart stone deposit.\r\n\r\nI will continue to expand the mod by periodically adding a couple of spells. I\\'m open to any suggestions/requests, but keep in mind that I may not be able to make a suggested/requested spell. Also, I would be glad to see screenshots of your characters using the spells =)\r\n\r\nBugs:\r\n*Occasionally, the \\\"Ash Storm\\\" spell may do no damage at all, for reasons unknown. Looking into it.\r\n*Bound Ash Spawn War Axe/Battle Axe do not spawn if the player has perks like Mystic Binding/Soul Stealer, etc. that alter bound weapons in any way. Period. Currently trying to solve the problem.\r\nNo other bugs or problems encountered so far. Tell me if you find any.\r\n\r\nInstallation:\r\nDrop the .esp file in your Data folder, or use NMM.\r\n\r\nRequirements:\r\nSkyrim with the latest patch (the later the better)\r\nDragonborn DLC\r\n\r\nTo everyone who endorsed the file: Thank you! Without you all, I wouldn\\'t have made this mod and updated it! To everyone else: I hope you\\'ll enjoy my mod!\r\n\r\nHave fun!\r\n\r\nAnd, if your Ash Mage is in need of shelter on Solstheim, check [url=http://skyrim.nexusmods.com/mods/40962]Archagruhn[/url].",
  "categoryId": "75",
  "version": "1.2",
  "author": "Ancient Nightblade",
  "createdUnix": "1363526289",
  "updatedUnix": "1375543544",
  "containsAdultContent": false,
  "uploadedBy": "AncientNightblade",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000018192",
      "name": "Ash Magic",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Ash Magic-33469-1-0.zip",
      "uploadedUnix": "1363525628",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/354b37304ca72560c96b7ad39a647d1e0c04679e6cf6de6a1a1943b69fab2c5f/analysis/1407474064/",
      "changelogHtml": " Initial Release <br/> \n Ash Firebolt added <br/> \n Searing Embers added <br/> \n Ash Armor added <br/> \n Greater Ash Shell added <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ash%20Magic-33469-1-0.zip?fid=1000018192&ttl=1535810614&ri=8192&rs=8192&setec=34d9f11104267948bc5d767a937a83c4"
    },
    {
      "fileId": "1000018912",
      "name": "Ash Magic",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10",
      "fileName": "Ash Magic-33469-1-1.zip",
      "uploadedUnix": "1363783729",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/90083422105fceb9afdbb61c12f3eb5e57a80183a01fd40b806ee5f0bbd1b92a/analysis/1407478697/",
      "changelogHtml": " Ash Firebolt renamed to Ashbolt, some sound changes <br/> \n Ash Cloak, Ash Storm added <br/> \n Bound Ash Spawn War Axe, Bound Ash Spawn Battle Axe added <br/> \n Greater Ash Shell enchantment added <br/> \n Ash Mail (with \"Ash Explosion\" script) added <br/> \n Staff of Ashbolts added <br/> \n Scrolls of Ash Armor added <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ash%20Magic-33469-1-1.zip?fid=1000018912&ttl=1535810615&ri=8192&rs=8192&setec=95f5b89c1117115e0fca084100df2aa0"
    },
    {
      "fileId": "1000043848",
      "name": "Ash Magic",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Ash Magic-33469-1-2.zip",
      "uploadedUnix": "1375543544",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/0a72f0f5500dee790a454886cd3fa42d85091f935a1f0b9d6cc9991abfcb2739/analysis/1407667623/",
      "changelogHtml": " Bound Ash Spawn Battle Axe renamed to Bound Ash Battleaxe <br/> \n Bound Ash Spawn War Axe renamed to Bound Ash War Axe <br/> \n Ash Feast, Ashball, Immolate added <br/> \n Fire Stream, Conjure Unbound Ash Spawn added <br/> \n All spells classified <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ash%20Magic-33469-1-2.zip?fid=1000043848&ttl=1535810615&ri=8192&rs=8192&setec=661ac693c9160a2832fcf1595b04592a"
    }
  ]
}