{
  "modId": 33481.0,
  "modName": "Skyforge Steel Mace And Warhammer by MarshalToy FIXED",
  "summary": "This adds the Skyforge Steel Mace And Warhammer to the Skyforge for purchase from Eorlund Gray-Mane and fixes the Skyforge Steel Dagger so it can be improved at a grindstone",
  "descriptionHtml": "This adds the Skyforge Steel Mace And Warhammer to the Skyforge for purchase from Eorlund Gray-Mane\r\nSkyforge Steel Mace and Warhammer can be improved and tempered at a grindstone.\r\nAlso fixes the Skyforge Steel Dagger so it can be improved and tempered at a grindstone.\r\n\r\nThis mod is working fine now for me after a fix in the CK... Hope it works for all that try it.\r\n\r\nHow to install : unpack to the \\\"Data\\\" folder in your skyrim directory. \r\n\r\nLink to original mod page by MarshalToy : http://skyrim.nexusmods.com/mods/11860\r\n\r\nOriginal mod description by MarshalToy : \r\nAs the title suggests, Eorlund Gray-Mane is now selling Skyforge Steel Maces and Warhammers for your skull bashing needs. They\\'re like the other Skyforge Steel weapons: Steel with a dose of vitamin Nord. Also like the other Skyforge Steel weapons: They can\\'t be crafted. Bugger.\r\n\r\nLet me know if any bugs are encountered. Or fix them yourself and post it online, I honestly won\\'t mind.\r\n\r\nUPDATE LOG\r\n---\r\n\r\nv 1 dot 01: The Skyforge Steel Mace and Warhammer is now available for tempering. It uses the same perk as the other Skyforge weapons so now you have no excuse to buy one unless you really like that ugly looking Elf club. Also, for some reason, the Skyforge Steel Dagger available for refinement as well.\r\n\r\nv 1: Eorlund Gray-Mane is now selling his latest creations.\r\n",
  "categoryId": "55",
  "version": "v1.01",
  "author": "MarshalToy",
  "createdUnix": "1363545306",
  "updatedUnix": "1363544285",
  "containsAdultContent": false,
  "uploadedBy": "SkyrimAl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000018258",
      "name": "Skyforge Steel Mace and Warhammer plus Dagger Temper Fix",
      "version": "v1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Skyforge Steel Mace and Warhammer plus Dagger Temper Fix-33481-v1dot01.zip",
      "uploadedUnix": "1363544285",
      "modVersion": "v1.01",
      "virusScanUrl": "https://www.virustotal.com/file/28231de2604bfa99a710f0aab283d5191e68a2c0f8031617ee9dc6809941314a/analysis/1407474380/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyforge%20Steel%20Mace%20and%20Warhammer%20plus%20Dagger%20Temper%20Fix-33481-v1dot01.zip?fid=1000018258&ttl=1535810638&ri=8192&rs=8192&setec=28ba689b81b0176df20c4e79058a99ec"
    }
  ]
}