{
  "modId": 33487.0,
  "modName": "Outlaws Hut-No DLCs player home",
  "summary": "My first mod, just a little camp in Falkreath hold were an outlawed Orc lives, but some imperials came and killed him, now if you are an outlaw in every hold you could live in this small hut with a chopping block and an anvil, including a new Dagger, not a new dagger.",
  "descriptionHtml": "Description\r\n\r\nMy first mod, just a little camp in Falkreath hold were an outlawed Orc lives, but some imperials came and killed him, now if you are an outlaw in every hold you could live in this small hut with a chopping block and an anvil, including a new Dagger, not a new dagger.the hut itself is an orcish building because i just really like there roofs.The inside just contains a small fire pit and a cot for the player to sleep, armor, bow and a battleaxe can be found within the dead orc. And some of you may not like grass growing in your home but the last owner was an outlaw he couldn\\\\\\\\\\\\\\'t get much otherwis he would live in a castle and be a weirdo, like me. the mod doesn\\\\\\\\\\\\\\'t require Zoner i dont think, a good texture mod, but I used it in the pictures, if I can put them on.\r\n\r\nNo DLCs\r\n\r\nWell before I got Dawnguard and hearthfire, haven\\\\\\\\\\\\\\'t got dragonborn, I got so deprest of finding mods that needed a DLC so I just felt for all the people going crazy at home because they couldn\\\\\\\\\\\\\\'t have cool mods, and I know this one isn\\\\\\\\\\\\\\'t really cool, so I gave them a mod to use as a home, and about the crazy part maybe its just me that goes crazy but I hope there is someone out there who can relate to me :).\r\n\r\nRecomended Mods\r\n\r\nI really like Tropical Skyrim it just make the place seem so cool it may just be because I like China and I think its like that I can\\\\\\\\\\\\\\'t be shure, liking China brings me on to my next one, the Song General Armor one again I just love this mod.And finally this mod, Get it it maybe the best or it maynot be we will see:D\r\n\r\nBugs\r\n\r\nNo bugs are known to me but any mods like th tropical skyrim mod may pace trees in the hut.\r\n\r\n\r\n\r\n",
  "categoryId": "89",
  "version": "0.1",
  "author": "Joeru Kodo",
  "createdUnix": "1363552146",
  "updatedUnix": "1363552146",
  "containsAdultContent": false,
  "uploadedBy": "JoeruKodo",
  "primaryFile": null,
  "files": []
}