{
  "modId": 33519.0,
  "modName": "Tropical Skyrim - deutsch",
  "summary": "Die deutsche Version des tropical Skyrim-Mods.",
  "descriptionHtml": "[center]---[This is merely a translation of the Mod made from Soolie into German language. You need to download the original mod in order to use this translation.]---[/center]\r<br />\r<br />\r<br />Wer schon immer Mal Skyrim in einem anderen Licht sehen wollte, dessen Traum wird mit diesem Mod wahr. Tropical Skyrim verändert ganz Himmelsrand von einer trockenen, kargen Eiswüste hin zu einem lebendigen, prächtigen Dschungel, fügt dem Spiel neue Tiere hinzu und ändert die bereits vorhandenen Tiere ab, sodass ein völlig neues Spielgefühl mit völlig neuen Inhalten entsteht. Als würde man das Spiel noch einmal in einer neuen Welt durchspielen.\r<br />Da dieser Mod die bisher vorhandenen Ressourcen überdeckt, geschieht dies sogar ohne größeren Leistungsverlust in der Grafik.\r<br />Wer es also lieber warm mag, anstatt kalt und eisig, für den ist dieser Mob ein absolutes Muss.\r<br />\r<br />\r<br />-\r<br />\r<br />Dieser Mod basiert auf dem populären &#34;Tropical Skyrim&#34;-Mod von Soolie und funktioniert nur, wenn sein Mod zuerst installiert ist. Meine Leistung ist lediglich, dass ich ihn ins deutsche übersetzt habe.\r<br />\r<br />[b][u]Zu erhalten ist der ursprüngliche Mod hier:[/u][/b]\r<br />[url=http://skyrim.nexusmods.com/mods/33017]http://skyrim.nexusmods.com/mods/33017[/url]\r<br />\r<br />\r<br />-\r<br />\r<br />\r<br />[b]Installation:[/b]\r<br />1.) Installiert zunächst den &#34;Tropical Skyrim&#34;-Mod von Soolie nach den dort gegebenen Anweisungen.\r<br />2.) Für das Klima-Update die Tropical Skyrim.esp in den Dateiordner verschieben (in der Regel steam&#92;steamapps&#92;common&#92;Skyrim&#92;Data) und die vorhandene Datei überschreiben.\r<br />3.) Für das Vogel-Update die Tropical Skyrim -- Birds.esp in den Dateiordner verschieben und die vorhandene Datei überschreiben (funktioniert auch ohne Klima-Update).\r<br />3.) Wahlweise einen von beiden, oder beide Mods aktivieren und Spaß haben :-)\r<br />\r<br />\r<br />-\r<br />\r<br />\r<br />[b]Anmerkung:[/b]\r<br />In diesem Download sind zwei Dateien enthalten, die voneinander unabhängig funktionieren und somit auch einzeln installiert werden können. Wer also nur eine neue, tropische Welt haben will, der sollte Tropical Skyrim -- Birds.esp nicht installieren, wer stattdessen nur die neuen Vögel haben und bewundern möchte, sollte Tropical Skyrim.esp nicht installieren.\r<br />Ich hatte mir die Übersetzung komplizierter vorgestellt, da dieser Mod aber größtenteils Grafikanteile überarbeitet, bin ich schneller fertig geworden, als ich dachte.\r<br />Nach mehrtägigem Test bin ich mir auch sicher, dass meine Übersetzung fehlerfrei ist. Sollte sich dennoch irgendwo ein Rechtschreibfehler eingeschlichen haben, oder ich unerwartet irgendetwas übersehen haben, dann teilt mir das bitte hier auf Skyrim-Nexus mit.\r<br />\r<br />\r<br />\r<br />[b][b][size=3][color=orange]Abschließend möchte ich hier Werbung für meine neuste Übersetzung machen, nämlich für den wahnsinnig spannenden Mod &#34;[url=http://www.nexusmods.com/skyrim/mods/64283/?]Immersive Jewelry[/url]&#34;, den ich [url=http://www.nexusmods.com/skyrim/mods/66774/?]hier[/url] übersetzt habe.[/color][/size][/b][/b]\r<br />\r<br />\r<br />\r<br />Credits gehen insbesondere an Soolie für seinen überragenden Mod und an alle, die ihm dabei geholfen haben.\r<br />\r<br />\r<br />[b]Bei weiteren Fragen, oder wenn ihr diese Mod mögt, hinterlasst mir doch einen Kommentar. Sollte euch meine Übersetzung gefallen, so klickt doch bitte einmal auf &#34;endorse me&#34;. Vergesst auch nicht, Soolie zu belohnen.\r<br />Viel Spaß&#33;[/b]",
  "categoryId": "79",
  "version": "1.1",
  "author": "Soolie und Verodor",
  "createdUnix": "1363622526",
  "updatedUnix": "1363620925",
  "containsAdultContent": false,
  "uploadedBy": "Verodor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000018462",
      "name": "Tropical Skyrim - v1_1 - deutsch",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1349",
      "fileName": "Tropical Skyrim - v1_1 - deutsch-33519-1-1.rar",
      "uploadedUnix": "1363620925",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d71bfc06e4415d9bbadd1bf1cda153c5b45457c29275ded86189401533cddbaf/analysis/1407475993/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tropical%20Skyrim%20-%20v1_1%20-%20deutsch-33519-1-1.rar?fid=1000018462&ttl=1535810701&ri=8192&rs=8192&setec=16a57f36c6d0e439be86a9287dad1bd4"
    }
  ]
}