{
  "modId": 33543.0,
  "modName": "Alfnak Ruin - Dissertation Research Mod",
  "summary": "A Nordic Ruin dungeon mod built specifically for the sake of research. Dungeon + 9 Question survey to fill out! [NO DLC NEEDED]",
  "descriptionHtml": "PARTICIPATION IS OVER - PLEASE DO NOT FILL OUT THE SURVEY!!\r\n\r\nWelcome to my Dungeon Mod! This mod is created for the sake of my dissertation. It is an experiment if you will. You\\'ll find this Nordic Ruin situated near Riverwood [see picture]. It is fully nav meshed so bring your followers! Bear in mind this is my first mod EVER created, so please ignore tessellation issues ^_^\\'.\r\n\r\nSteam : http://steamcommunity.com/sharedfiles/filedetails/?id=132822111\r\n\r\nLink to the Survey: http://www.surveymonkey.com/s/N69NHMS (DON\\'T VIEW UNTIL AFTER YOU\\'VE PLAYED)\r\n\r\n            By filling out the survey you consent to your data being used to \\\"research purposes only\\\".\r\n                                                         It is completely anonymous = )\r\n\r\n------------------------------------------------------------------------------------------------------------------------------\r\n------------------------------------------------------------------------------------------------------------------------------\r\n\r\nResults!\r\n\r\nDissertation Title:\r\n\r\n“Can Visual Cues / Elements act as a stimulus to create directed player choice in Role Playing Games?”\r\n\r\nIMAGES UPLOADED OF THE RESULTS!\r\n\r\n6.3 Hypothesis Testing (Inferential Statistics) [ Copied straight from Dissertation Article ]\r\n\r\nQ3 Hypothesis: The player will pick up the dagger.\r\n\r\nQ3 hypothesis wasn’t correct as the results had an almost equal score. The visual element of objects placed in a player’s path does not encourage the player to pick up the object.\r\n\r\nQ4 Hypothesis: The player will take the safe path.\r\n\r\nResults had shown that when faced with a safe option versus a dangerous one, more players had taken the safe option proving Q4’s hypothesis correct.\r\n\r\nQ5 Hypothesis: The player will take the axe side.\r\n\r\nWhen faced with 2 dangers, my hypothesis was that the player would now that the axe side as opposed to before. However results shows that most players had taken the enemy side rendering Q5’s hypothesis incorrect.\r\n\r\nQ6 Hypothesis: The player will take the safe path.\r\n\r\nStrangely enough, when given an option of “enemy danger” versus empty paths, the players mostly had taken the enemy side or both. It seems that players don’t necessarily take a safe path when faced with a particular challenge.\r\n\r\nQ7 Hypothesis: Players will collect the treasure.\r\n\r\nWhen faced with an obstacle, ¾ of the participants would choose to overcome that obstacle. This was the expected outcome when faced with this particular visual element; player choice was directed more than not.\r\n\r\nQ8 Hypothesis: The player will follow the river flow assuming it’s the main path.\r\n\r\nIn the entire study, the visual element which affected player choice the highest was an environmental one (river flowing). An astounding 85.45% followed the river to the dead end(instead of the actual path). This shows that player’s choice can be directed when shown a visual element stimulating enough.",
  "categoryId": "91",
  "version": "1.1",
  "author": "Remnantique",
  "createdUnix": "1363648521",
  "updatedUnix": "1363648346",
  "containsAdultContent": false,
  "uploadedBy": "Remnantique",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000018564",
      "name": "Alfnak Ruin V1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "65",
      "fileName": "Alfnak Ruin V1-33543-1-1.rar",
      "uploadedUnix": "1363648346",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/66936f25c6ee0a7e151756d27c14af100175e1e18a56824f36abe93c46ca0bb3/analysis/1407476643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alfnak%20Ruin%20V1-33543-1-1.rar?fid=1000018564&ttl=1535810735&ri=8192&rs=8192&setec=93aa5be942dec4e0107d001a0def2516"
    }
  ]
}