{
  "modId": 33589.0,
  "modName": "SEX - Strong Enemy Xtreme",
  "summary": "I thoroughly enjoy SEX, you will too.  This mod enhances the abilities of Boss and Sub Boss enemies.",
  "descriptionHtml": "This is now ported over to SSE as Real Bosses.  Any new updates will be for the SSE version.\n<br />https://www.nexusmods.com/skyrimspecialedition/mods/18183?tab=files\n<br />\n<br />--------------------\n<br />Foreplay Edition\n<br />--------------------\n<br />- Recommended for those starting new characters, or for those who never end up with much for enchantments on their character for their playthrough. Also for those not quite sure they're ready to handle the main version yet.\n<br />\n<br />- Most enemies scale to player level more closely and have lower minimum level. ( eg:Harkon min lvl 20 instead of 80 )\n<br />- Damage reduction and damage output reduced for all enemies considerably (dmg reduced by about 50%, which is still 2x-6x higher than vanilla dmg depending on enemy)\n<br />- Regen rates of enemies vastly reduced ( no more minimum damage requirement to kill certain enemies )\n<br />- Elemental resistances of certain enemies reduced ( less need to use particular elements against certain enemies )\n<br />- Ebony Warrior is still the way he was, bring an army to beat him if you have to\n<br />- Max HP reduced for all enemies\n<br />- Enemies retain any unique qualities from the descriptions below and are still very dangerous.\n<br />\n<br />\n<br />\n<br />**Requires Dawnguard and Dragonborn DLC's **\n<br />\n<br />This mod aims to make all the 'boss' fights in the game much more challenging and feel like a unique encounter.  Powerful enemies are no longer to be taken lightly.\n<br />\n<br />The strongest enemies in this mod 'can' do comparable damage to what Dragons would do on Deadly Dragons Nightmare preset.  This is probably the best reference I can give as an indicator of the challenge.  The most powerful of the enemies ( Miraak/Harkon/Vahlok The Jailor etc ) start at level 80, and others start as early as lvl 10.  Almost all of them will go up to 200 if your character is that high , but these aren't just leveled enemies with a stat boost ( well most of them aren't ), more has been done to increase the challenge and make them unique.  \n<br />\n<br />All changes are noted here, also note anytime items or spell enchantments etc had to be changed they were added as extra items/effects etc.  So you don't have to worry about having some random npc who happens to have the same spell or enchantment as these 'boss' npcs.\n<br />\n<br />Some of these enemies you are just not going to beat at low level.  Walking around at lvl 20 don't expect to be able to defeat the top tier enemies, or even low Tier DragonPriests, unless you have excellent gear somehow at that low level.\n<br />\n<br />Tier 4 enemies are designed to still put the hurt on even when you have substantial resistances as well, if your hp isn't high enough some spells can crit and you will die outright.  Plan your encounters against the strongest of these enemies, and enjoy your struggle against the others. \n<br />\n<br />Also, some changes won't apply if you use this on an existing game. Some enemies have their level/hp etc set as soon as you first encounter them. You don't need to start a new game, but if for example you're near the end of dragonborn then install this mod, Miraak won't have the appropriate stat changes. He will have the addition perks and spells/resistances however. ( although his magicka may not be high enough to use some of the spells )\n<br />\n<br />----------------------------------------------------------------------------------------------------------\n<br />\n<br />-----------------------\n<br />1.3 Additions/Changes\n<br />-----------------------\n<br />\n<br />-haknir death brand : slightly reduced dmg\n<br />\n<br />-Arch Curate Vyrthur : greatly reduced regen, greatly reduced dmg of penetrating spear.\n<br />\n<br />-Ancano : Reduced HP\n<br />\n<br />-Malkus : greatly reduced regen\n<br />\n<br />-Harkon : Moderately reduced regen\n<br />\n<br />-Feran Sadri : slightly reduced dmg\n<br />\n<br />-Miraak : -reduced elemental resistance for thunder/fire/frost ( Dragon Aspect will still heavily buff this )\n<br />          -Reduced HP back to standard HP ( this should fix needing to restore his health mid fight )\n<br />          -Increased based dmg reduction % ( due to having low hp this is needed )  \n<br />          -Increased spell magnitude a bit, he will have dmg loss in general due to being lower lvl to prevent bugs.\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />----------------------\n<br />1.2 additions/changes\n<br />----------------------\n<br />-General Falx Carius dmg reduced, hp slightly increased further\n<br />-Ancano removed healing spells\n<br />-Tsun added\n<br />-Drascua added\n<br />\n<br />\n<br />----------------------\n<br />1.1 additions/changes\n<br />----------------------\n<br />- Mercer Frey updated\n<br />- Keepers from Soul Cairn added\n<br />- Orchendor added\n<br />- Captain Hargar added\n<br />- Lu'ah Al-Skaven added\n<br />- Estormo added\n<br />\n<br />-------------------------------------------------------------------------------------------------------------\n<br />\n<br />--------------------\n<br />DragonPriests:\n<br />--------------------\n<br />\n<br />All Dragon Priests have elemental based resistances, fire will be 'almost' completely inneffective against a fire casting Priest for example.\n<br />\n<br />All priests have a spell damage buff which is indicated by their 'Tier'\n<br />\n<br />All priests have a measure of damage reduction indicated by their 'Tier'\n<br />\n<br />I did my best to give something unique to each Priest so it'll never feel like the same fight twice.  I'm very happy with how it's turned out.\n<br />\n<br />Do not try to fight them without a large amount of elemental resistance, the harder ones you better have some magic resistance also. Wards are going to be useful against these guys..sometimes you just need to negate their damage completely instead of trying to absorb it.\n<br />\n<br />Here's the list and their Traits/Tiers ( pay attention..some Tier 1 priests have some unique traits you don't want to be unprepared for )\n<br />\n<br />--------------------------------------------\n<br />\n<br />Hevnoraak - Tier 1, standard stat increase, Buffed Wall of Storms staff, Massive physical damage resistance\n<br />*challenge w/Hevnoraak lies in that his shock based attacks/cloak will constantly put a strain on your magicka, and his near immunity to physical damage makes him hard to damage at all.\n<br />Suggestions: Heavily damage enchanted weapons, shouts, run away and get summons out that can do magic based damage even once out of magicka*\n<br />\n<br />Krosis - Tier 1, standard stat increase, Speed heavily increased, Wall of Frost added, Blizzard added, staff buffed\n<br />*when he wants to/is able to he moves around quickly and is hard to catch, he's frost based but has a fire staff*\n<br />\n<br />Morokei - Tier 3, Large stat increase, multiple summons perk, conjure 4 high seekers spell, Lightning Storm\n<br />*lightning damage puts a bad enough strain on magicka, add high seekers to the mix and you can expect to be taxed most of the fight.  Do not under estimate the damage a Tier 3 can put out! Fitting for the one in possesion of the staff of magnus*\n<br />\n<br />Nahkriin - Tier 3, Moderate stat increase, Universal Elemental Resistances , 2x summon perk, Conjure two buffed dremora Lord spell\n<br />*Can damage you with all elements, no real weakness, Dremora Lords make it difficult to focus on doing damage, the other Tier 3-Be careful.*\n<br />\n<br />Otar The Mad - Tier 2, Moderate stat increase, insane elemental/magic resistance, 2x summon perk, \n<br />*uses both ice and fire,and unless you have spells to bypass resistance you're going to need to get in his face, mages nightmare*\n<br />\n<br />Rahgot - Tier 1, standard increase, has healing, 2x summon perk, 2x Ash spawn summon, fire storm , buffed staff\n<br />*isn't the hardest of the Priests, but be ready to do some burst damage to finish him off before he heals*\n<br />\n<br />Vokun - Tier 2, standard increase, universal resistance, added wall spells, buff staff\n<br />*Simply dangerous, as normal as these priests come.  Let your guard down and think you got him already beat though and he'll whip out a spell you weren't expecting and ruin your day before you realize how naive you were*\n<br />\n<br />Volsung - Tier 1, standard increase, has unique attack spell that ignores all magic resistance\n<br />*His ice attacks can be potent enough if you let them hit you to completely root you in place from the slow down..if you let this happen don't expect to survive his defense penetrating ice spears*\n<br />\n<br />---------------------------------\n<br />Dragonborn DragonPriests:\n<br />---------------------------------\n<br />\n<br />Ahzidal - Tier 3, bigger, moderate increase, 4x summon perk, 2xBigass GargoyleSummons\n<br />*probably the most potent fire using D.priest, his Dragon Breath like fire spell can really put the hurt on.  He's also got a buffed up mayhem spell to match the carnage he causes in his quest, your allies may turn against you. Gargoyles in place to make you stay on your toes.*\n<br />\n<br />Duukan - Tier 2, Standard increase, Mass Paralysis\n<br />*He can already conjure high seeker in vanilla, and has frost breath style spell, add to that the frost slowing you down and him potentially paralyzing you..you're cannon fodder. Stay sharp.*\n<br />\n<br />Vahlok - *Tier 4 , Massive increase, conjure 2x dragon priest spell ( not as buff as named dragon priest ), fire breath style spell added, necromancy added, 5x summon perk, Firestorm\n<br />*He defeated Miraak. He is the Boss. He is Tier 4, he is the only tier 4 priest, tier 4 is scary, be scared.*\n<br />\n<br />Zahkriisos - Tier 3, immune to shock dmg, higher than avg mag resist, 2x summon perk, 2x high seeker summon\n<br />*Most powerful lightning priest, it'll hurt, it'll take away your magicka, seekers make it worse.  Dodge the seeker attacks and LOS Zahkriisos when you can. He's durable.*\n<br />\n<br />\n<br />----------------------------\n<br />Known Problems:  Priests will often conjure their summons first..then place their respective shields up after..sometimes this dispels the summons.. i have no idea why.  Regardless they'll re-summon again and the fight will continue. ( if anyone notices why this happens please tell me )\n<br />\n<br />Also, sometimes you may find an enemy just isn't hitting as hard as they were..sometimes the game doesn't like to apply the changes to spell magnitude, i have no idea why.  Re-load prior to coming across the enemy and it should work. This is true for all the enemies. I experienced this in testing but haven't heard any reports yet of this happening. ( can be hard to notice if you don't already know what to expect as well i suppose )\n<br />-----------------------------\n<br />\n<br />\n<br />\n<br />\n<br />-----------------------------------------------------------------------------------------------------------\n<br />\n<br />--------------------\n<br />Vanilla Enemies: \n<br />--------------------\n<br />\n<br />Usually categorized as 'fighters' and 'Wizards', Wizards have 2 Tiers.  Both Tiers are powerful however.\n<br />Fighters strength can vary greatly.  Note that 'perks added' usually means the bare perks that are missing, ie 2h warrior will be given the barbarian perk, the rank of which will depend on the character.  Perks like reflect, which you should know about so you don't kill yourself will be noted, same with any perks i made myself then added to the character.   \n<br />\n<br />----------------------\n<br />\n<br />\n<br />*Ancano - Tier 2 wizard,Large hp/magicka boost,  2x Dremora Lord summon, fire/frost stream spells added, 2x summon perk added\n<br />*He's using the eye of magnus, so he gets to have a bit of an abnormal boost. I wasn't able to test him properly since I didn't have a save just before fighting him surprisingly, and using console spawns a non aggressive version who just won't attack me lol.  Feedback welcome.*\n<br />\n<br />General Tullius - Large hp boost, perks added including reflect blows, large damage boost\n<br />\n<br />Ulfric Stormcloak - Large hp boost, perks added, large damage boost, Miraaks fire breath shout added, magic damage boost ( to amplify his fire shout damage w/out changing the shout )\n<br />\n<br />Malyn Varen - Tier 1 wizard, Moderate hp/mp boost, resistances added, spell damage increase\n<br />(guy stuck in azura's star)\n<br />\n<br />Kematu - Moderate hp boost, more perks, damage increase, speed increase\n<br />(Red Guard Leader)\n<br />\n<br />*Mercer Frey - Large hp boost, more perks added, Large damage increase, speed increase, Custom Perk 40% chance to dodge all incoming melee damage.\n<br />*he was supposed to be a death sentence to cross swords against..now he is*\n<br />\n<br />Malkoran - Tier 1, standard increase, universal resistances\n<br />(I only edited his shade form, which is basically a DragonPriest, so he follows the DragonPriest system, in my game he spawns multiple shades..not sure if it's from ASIS or normal so I brought him\n<br />down to Tier 1, ..one of my favourite fights so far )\n<br />\n<br />Legatte Rikke - small hp increase, perks added, more damage\n<br />\n<br />Galmor Stonefist - small hp increase, perks added, more damage\n<br />\n<br />Orchendor - Wizard Tier 1, moderate health increase, melee dmg increase, master magic perks, mage armour added.\n<br />(peryite quest )\n<br />\n<br />Jaree-Ra - small hp increase, speed increase, extra damage, minor perk additions\n<br />(Assasin)\n<br />Deeja - small hp increase, speed increase, extra damage, minor perk additions\n<br />(Assasin)\n<br />\n<br />Captain Hargar - moderate hp increase, perks added, damage increase, \n<br />(blackblood leader) \n<br />\n<br />Estormo - Tier 1, small hp increase\n<br />\n<br />Lu'ah Al-Skaven - Tier 2, multiple summon perks added ( 8x!) , ability to conjure atronachs added\n<br />\n<br />Tsun - Moderate health, damage increase, 40% chance to nullify physical damage taken, speed increase, perks added\n<br />\n<br />Drascua - Moderate health, additional fire spells added, tier 1 wiz buff, speed increase\n<br />\n<br />\n<br />\n<br />-----------------------------------------------------------------------------------------------------------\n<br />\n<br />----------------------------------\n<br />Dawnguard Enemies/Allies:\n<br />----------------------------------\n<br />\n<br />The Dawnguard and Volkihar vampires have the same 'Tier' system.  The Tier's effect the npc's level in relation to the player and have specific changes depending which faction they belong to.  The volkihar vampires get faster, have higher stats, do more damage, and have more magic resistance as they get higher in their Tiers. They also have increased regeneration as they go up in Tiers.\n<br />\n<br />The Dawnguard factions Tiers effect the npc's level in relation to the player, as well as effect the power of their weapons and spells.  The Dawnguard doesn't have the raw power the vampires do,\n<br />but their specific skills against the undead make them extremely deadly and specialized.  Below is the list of the npc's and their Tiers. As well as any additional things added to them. ( these changes are IN ADDITION to the standard changes ALL these npcs get from being part of a Tier)\n<br />\n<br />----\n<br />\n<br />-------\n<br />Volkihar: \n<br />-------\n<br />\n<br />*Malkus - Tier 3, the leader of the expedition into forebears if you side with Dawnguard. He has extra increase to his health to make him function more like a mini boss style character. Melee damage perks added. Bigger.\n<br />\n<br />Feran Sadri - Tier 3, spell damage perks added.\n<br />\n<br />Fura Bloodmouth - Tier 2, speed of a Tier 3, extra melee perks\n<br />\n<br />Garan Marathi - Tier 2\n<br />\n<br />Hestla - Tier 1\n<br />\n<br />Modhna - Tier 1\n<br />\n<br />Namasur - Tier 1\n<br />\n<br />Orthjolf - Tier 3, bigger, additional melee perks, additional health\n<br />\n<br />Rargal Thrallmaster - Tier 2\n<br />\n<br />Ronthil - Tier 1\n<br />\n<br />Salonia Caelia - Tier 1, HP of a Tier 3 for a sub-boss like encounter\n<br />\n<br />Stalf - Tier 1, HP of a Tier 3 for a sub-boss like encounter\n<br />\n<br />Vingalmo - Tier 3, more magicka, conjure gargoyles, multiple summons perk\n<br />\n<br />Harkon - Tier 5 , added claw damage(he actually didn't have any..in case anyone ever wondered why he hit with his claws like ..well nothing )\n<br />*His battle is interesting enough, so didn't add too much to him.  I gave him the speed of a Tier 2 cause he's already pretty damn fast in that form. Only additional spell is he can summon 2 buffed up gargoyles like Vingalmo.\n<br /> use Wards, summon minions, use buffing potions etc if you need to. like the rest of the mod you need magic resistance to stand much of a chance. \n<br />I've had Isran make it to this fight before, and other times he won't join..but if he does he'll be a big help in this fight*\n<br />\n<br />\n<br />-----------------------\n<br />The Dawnguard:\n<br />-----------------------\n<br />\n<br />Agmaer - Tier 1 , buffed sun fire spell added, sun damage enchanted war axe added\n<br />\n<br />Beleval - Tier 1 , buffed sun fire spell added, sun damage enchanted war axe added, sun damage enchanted Crossbow added\n<br />\n<br />Celann - Tier 1, buffed sun fire spell added, sun damage enchanted war axe added\n<br />\n<br />Durak - Tier 1, buffed sun fire spell added, sun damage enchanted war axe added\n<br />\n<br />Florentius Baenius - Tier 3, buffed sun fire, vampires bane, sun damage enchanted silver sword, healing spells added, more perks\n<br />\n<br />Gunmar - Tier 3, sun fire, sun damage enchanted silver greatsword\n<br />\n<br />Ingjard - Tier 1, sun fire, sun damage enchanted silver sword, armsman and barbarian perks\n<br />\n<br />Isran - Tier 4, sun fire, buffed stendarr's Aura (including mag resistance), Sun damage enchanted Warhammer, Buffed vampires Bane\n<br />*When his aura is up magic barely hurts him..forcing to get in close..but if you're in close..he can hit you with that undead smashing warhammer*\n<br />\n<br />Sorine - Tier 3, heavily enchanted crossbow added, sun fire, vampires bane, perks, enchanted silver sword\n<br />\n<br />Vanik - Tier 3, sun fire, enchanted silver sword, armsman/juggernaut perks\n<br />\n<br />Armored Trolls - level to the player, health increase, heavy damage increase\n<br />*only changes the tamed trolls*\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />------------------------\n<br />Additional Dawnguard NPCS:\n<br />------------------------\n<br />\n<br />Arch-Curate Vyrthur - Tier 4 , Penetrating ice spear spell added ( it's deadly! )\n<br />\n<br />Serana - Tier 2 ,very minimal hp buff,  with some added perks. ( I'd love to make her Tier 4..but Tier 2 is best for the sake of balance )\n<br />\n<br />Valerica - Tier 3, with small hp buff\n<br />\n<br />Minorn - Tier 1, moderate hp buff, large magicka buff, all illusion mastery spells/perks added\n<br />\n<br />Keepers in Soul Cairn - Moderate hp/stamina buff, greater damage/magic resistance, more frost resistance, relevant perks to their style added, reflect blows added to 1-hand and shield variant\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />------------------------------------------------------------------------\n<br />\n<br />----------------------\n<br />DragonBorn NPCS:\n<br />----------------------\n<br />\n<br />--------------------\n<br />(Miraak uses the dragonpriest Tier system )\n<br />*Miraak - Tier 3, Lightning based DragonPriest stats, Large HP/MP boost, fire/frost streak added, lightning storm added(srly..dont get hit by this ), 4x summon perk, conjure 2x high seeker, perks added, conjure DremoraLord and 2x DragonPriestSPell added, conjure 4x High seeker spell added ( what he conjures depends on the player level when metting him )\n<br />\n<br />*He may not be Tier 4 like Vahlok the Jailor, but he's likely to be more Deadly.  DragonPriests by nature are alot slower..Miraak is not.\n<br />His Firebreath/frostbreath shout has been seperated from the players fire breath, this will prevent other mods from affecting his breath power. This will affect any other mod that uses the greybeard shouts. ( it uses the default vanilla effects so unless someone for some reason had\n<br />a mod that changes greybeard shouts specifically..it's something you'd never notice )\n<br />\n<br />I hate to point out the obvious, but he's dangerous.  Probably the strongest enemy there is.  His versatility mixed with the potency and speed of his attacks makes him hard to deal with at all times.  Being a lightning based dragon priest..he has heavy lightning resistance..he's also a nord, so he has heavy frost resistance, his Dragon Aspect shout gives him even more fire/frost resistance. All of my dragon priests also get a general magic resistance. I hope you see where i'm going with this.. his dragon aspect also gives him fairly decent melee defense.\n<br />\n<br />\n<br />Haknir Death Brand - large hp increase, magic resistance, perks added, speed increased, damage increased, regeneration\n<br />\n<br />Karstaag - Bigger, Hp increase, more damage, more regen\n<br />*he's already pretty beefy, didn't take things much higher*\n<br />\n<br />General Falx Carius - large hp increase, perks, damage increase, faster\n<br />\n<br />Ebony Warrior - He's broken, seriously, if you beat him you are god. I don't even recommend trying.\n<br />\n<br />\n<br />\n<br />\n<br />-----------------------------------------------------------------------------------------------------------\n<br />\n<br />------------------------------\n<br />To be added in next update:\n<br />-----------------------------------\n<br />-Gauldurson enemies ( more trouble with these guys than expected, they rely on alot of scripts surprisingly, will come back to them when i have more time )\n<br />-ForgeMaster from Lost to the ages ( same thing, don't want to break the fight, uses lvl lists )\n<br />-Hajvarr, Amren Sword Quest \n<br />-Movarth , Master Vampire - Morthal Quest\n<br />-Kvenel the tongue \n<br />-The Caller ( added through lvl lists, will come back to it when i know i can safely implement changes )\n<br />-Bone Dragon in labyrinthian ( maybe )\n<br />-Petra and Melka \n<br />-Silvia\n<br />-Ghunzul\n<br />-Arondil\n<br />-Champion of Boethiah\n<br />-Rigel Strong Arm\n<br />-Slid the Warlock\n<br />-Bashnag\n<br />-Haldyn\n<br />-Vals Veran\n<br />-Warlord Gathrik\n<br />-Beem-Ja\n<br />-Wolf Queen Potema\n<br />-ALL the imperial/stormcloak base camp leaders.\n<br />\n<br />\n<br />-----------------\n<br />Recommended Mods\n<br />-----------------\n<br />\n<br />--------------------\n<br />I use all of these and they work great together, my mod is made to have the enemies including on a tier ABOVE what these mods add, so they retain their unique feel\n<br />-----------------------\n<br />\n<br />---------------\n<br />Balanced Magic - Good spell damage scaling + Wards don't cost magicka until hit with a spell.  Which is damn near essential sometimes with this mod.\n<br />http://skyrim.nexusmods.com/mods/2275\n<br />---------------\n<br />ACE - I like the whole mod, but the smithing/Enchanting modules i feel are essential in preventing you from breaking your character. Highly recommended in order to keep this mod a challenge.\n<br />Note that this mod was designed using only the smithing/enchanting modules in mind, perks added from other mods can have unexpected effects.  Particularly to enemy attack speed.  It's compatible, just may have some unexpected results.\n<br />http://skyrim.nexusmods.com/mods/10037\n<br />-------------------\n<br />Dodge Mod - Dodging is important.. now dodging is even more import..those slow moving ice spells aren't too bad if you dodge them, but if you get hit by even one your gonna be slow..and you're probably going to die unless you have good wards.  This one seems to work under stress better than\n<br />TK Dodge, but both are good.\n<br />http://skyrim.nexusmods.com/mods/29258\n<br />--------------\n<br />ForgottenMagic - Many very fun and useful spells that level up with you. My favourite is definately the fire spells but the restoration ones have saved my life a billion times over against some of these guys.\n<br />http://skyrim.nexusmods.com/mods/23625\n<br />-----------\n<br />Deadly Dragons - set em to nightmare preset to have comparable challenge to these enemies.\n<br />http://skyrim.nexusmods.com/mods/3829\n<br />----------------\n<br />Dragon Combat overhaul - goes along w/ Deadly Dragons in very nice harmony\n<br />http://skyrim.nexusmods.com/mods/32597\n<br />----------------\n<br />Deadly Enemies - have my mod last in load order\n<br />http://skyrim.nexusmods.com/mods/14691\n<br />---------------\n<br />High Level enemies - have my mod last in load order\n<br />http://skyrim.nexusmods.com/mods/27866\n<br />----------------\n<br />Immersive patrols\n<br />http://skyrim.nexusmods.com/mods/12977\n<br />------------------\n<br />Immersive Creatures\n<br />http://skyrim.nexusmods.com/mods/24913\n<br />-------------------\n<br />ASIS - Makes the game SO much more fun.  But don't use this unless you read how it to make it work properly.  It's great if you use it right, it'll cause nothing but headache if you don't.\n<br />http://skyrim.nexusmods.com/mods/18436\n<br />--------------------\n<br />DUEL - My personal favourite gameplay changer. Everyone hits harder but blocking is more effective. Excellent AI improvement, and stealth changes make you use skill to sneak. If you use this and ASIS i recommend disabling the ASIS AI in the patcher so that it makes full use of DUEL AI.\n<br />http://skyrim.nexusmods.com/mods/2700\n<br />---------------------\n<br />\n<br />--------------------------\n<br />My Mods:\n<br />--------------------------\n<br />Strong Odahviing And Durnehviir\n<br />http://skyrim.nexusmods.com/mods/33559/\n<br />----------------------------\n<br />Archery Changes for DUEL:\n<br />http://skyrim.nexusmods.com/mods/33627/\n<br />-------------------------------\n<br />SEX - Strong Enemy Xtreme:\n<br />http://skyrim.nexusmods.com/mods/33589/\n<br />-------------------------------",
  "categoryId": "24",
  "version": "1.3",
  "author": "kapxis",
  "createdUnix": "1363761420",
  "updatedUnix": "1390553990",
  "containsAdultContent": false,
  "uploadedBy": "sixpak",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020268",
      "name": "Strong Enemy Xtreme",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53",
      "fileName": "Strong Enemy Xtreme-33589-1-1.rar",
      "uploadedUnix": "1364268451",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3d517d65f54e74acc3b32258dc1498a821845f5dedc86e04fd9322f6d9849de7/analysis/1407488884/",
      "changelogHtml": " Update Mercer Frey, bit faster, new 40% dodge perk added <br/> \n Some new enemies added - more to come ran out of time quickly this update <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Strong%20Enemy%20Xtreme-33589-1-1.rar?fid=1000020268&ttl=1535810804&ri=8192&rs=8192&setec=1e6b1e162ece60091f07aca27eed11a5"
    },
    {
      "fileId": "1000023227",
      "name": "SEX - Strong Enemy Xtreme ",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54",
      "fileName": "SEX - Strong Enemy Xtreme -33589-1-2.rar",
      "uploadedUnix": "1365407592",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/477818932002af4dc40d8ec7519776a58b50da966c3eba35184c431a360eb5a3/analysis/1407512467/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SEX%20-%20Strong%20Enemy%20Xtreme%20-33589-1-2.rar?fid=1000023227&ttl=1535810805&ri=8192&rs=8192&setec=8524778d44cc02546e59f620a5c9f6a8"
    },
    {
      "fileId": "1000093030",
      "name": "SEX ",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54",
      "fileName": "SEX -33589-1-3.rar",
      "uploadedUnix": "1390534823",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/ac3649e3acbc62815910533b1d60d38170742a770cf585b6f5f4336dadc55759/analysis/1407898987/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SEX%20-33589-1-3.rar?fid=1000093030&ttl=1535810805&ri=8192&rs=8192&setec=3538da514432867b94964ccc5755d4ee"
    },
    {
      "fileId": "1000093055",
      "name": "SEX Foreplay Edition",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "55",
      "fileName": "SEX Foreplay Edition-33589-1-3.rar",
      "uploadedUnix": "1390553990",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/614b5f385563f36ebc5d086816d7f3eacdf7da58cc7aaa8ae41221289a09c818/analysis/1407899383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SEX%20Foreplay%20Edition-33589-1-3.rar?fid=1000093055&ttl=1535810805&ri=8192&rs=8192&setec=ebfb934c5541f709cc3120d285fe445f"
    }
  ]
}