{
  "modId": 33591.0,
  "modName": "Solitude Two Point Zero",
  "summary": "A modification of Freeedy\\'s Solitude City Enhancement Mod! Complete with revised spelling and grammar! ",
  "descriptionHtml": "Solitude 2.0\r\n\r\n**Please notice that this mod shouldn\\'t change any of the game\\'s textures. Pictures uploaded by me use the \\\"Sexy Solitude\\\" mod.**\r\n\r\nDirectly to the point:\r\n\r\n-Adds buildings (House of Equality, Alchemy School, two houses, Imperial tavern, Thieves\\' hideout) with interiors and NPCs (Some with detailed daily activities) to Solitude. (Freeedy)\r\n-Adds flora and misc. objects to the city. (Freeedy)\r\n-Adds wooden frames and detail to all buildings for a much more medieval feel. (MarmotaMonax)\r\n-Overhauls appearance of several buildings, specifically the wooden houses in the middle of the city. (MarmotaMonax)\r\n-All of Freeedy\\'s interiors have been fixed, most bugs are gone, no floating objects, no texture problems, no collision, proper navmesh added, improved grammar and spelling. (MarmotaMonax)\r\n-Adds clutter to the new buildings, as well as changing the interiors of the remodeled houses. (MarmotaMonax)\r\n-Minor details I can\\'t recall. (Freeedy & MarmotaMonax)\r\n\r\nDeeper Description:\r\n\r\n-I have always loved Solitude. Ever since I first played Skyrim I fell in love with the city. However, it was too small, so I waited for a good expansion mod, and Freeedy provided it. However, it came packed with many small bugs and some incorrect grammar and spelling, which is totally acceptable with such a beautiful mod. I decided to add much more to it, add some better exteriors, change various interiors, change some NPC dialogue and add some heavy detail here and there. The city now has wooden frames! This makes Solitude look much better, in my opinion. This mod is still in need of some few things for the new buildings and factions, so if you are willing to help out with making each NPC unique and give them a purpose and maybe even some voice acting, contact me. \r\n\r\n**Please, do yourself a favor and download the Sexy Solitude texture mod. It is highly recommended to run it with this mod. As mentioned earlier, this mod by itself does not change any of the game\\'s textures.**\r\n\r\n-Many thanks to Freeedy for letting me work with his mod. It has been three months in development since I didn\\'t had any time to work in it continuously.\r\n\r\n-Also, this mod is quite demanding, so a good rig is recommended. \r\n\r\n-More city mods to come! Next stop: Morthal gets a total revamp (Made by me from scratch, that is)!\r\n\r\n**If this file is not working properly, contact me and I will do what I can to give you guys a solution.** ",
  "categoryId": "53",
  "version": "1.0",
  "author": "MarmotaMonax and Freeedy",
  "createdUnix": "1363732677",
  "updatedUnix": "1363732021",
  "containsAdultContent": false,
  "uploadedBy": "MarmotaMonax",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000018788",
      "name": "SolitudeTwoPointZero",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "298",
      "fileName": "SolitudeTwoPointZero-33591-1-0.rar",
      "uploadedUnix": "1363732021",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a95a25bbe10368c3031db6db29ca83ac1fc342978fd67f58f1b60dfc2e5e6d6f/analysis/1407477904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SolitudeTwoPointZero-33591-1-0.rar?fid=1000018788&ttl=1535810809&ri=8192&rs=8192&setec=659cc360c9f3f540d0db48e35f70c718"
    }
  ]
}