{
  "modId": 33605.0,
  "modName": "Pocket Hearthfires - A Plugin For The Pocket Empire Builder",
  "summary": "The Pocket Hearthfire is a plugin for the Pocket Empire Builder. It provides access to a few of the items available in the Hearthfire DLC",
  "descriptionHtml": "Pocket Hearthfire v1.07 - A Pocket Empire Builder Plugin \r\nby splynter \r\n\r\nReadMe:\r\n\r\nMOD REQUIREMENTS: \r\n    Hearthfire DLC\r\n    Pocket Empire Builder v1.34\r\n    SKSE  (SKSE can be downloaded from: http://skse.silverlock.org/ )\r\n\r\nIMPORTANT: After installing Pocket Empire Builder v1.34 and Pocket Hearthfire v1.07, you MUST move Pocket Hearthfire in the load order so that it loads AFTER Pocket Empire Builder. Pocket Empire Builder is a master file for Pocket Hearthfire and shares a lot of resources. If Pocket Hearthfire isn\\'t loaded after PEB you will lose a lot of functionality.\r\n\r\nWHAT IS IT? \r\nThe Pocket Hearthfire is a plugin for the Pocket Empire Builder. It provides access to a few of the items available in the Hearthfire DLC\r\n\r\nDEPLOYABLE HOUSES: 3 new player houses: a Whiterun style shack, a large Whiterun style Longhouse with a tower, and a large Whiterun style Longhouse with porches on 3 sides. These houses are spawned and have walkthrough doors, with the exception of the tower doors, so you can place as many in game as you need. \r\n\r\nThe shack is fairly small, but the longhouses are quite large. Since they are spawned, there isn\\'t any furniture or decorations inside. You will need to decorate them yourself, but then again, that\\'s part of the fun ;-)\r\n\r\nThe doors to the tower are load doors, so the number is limited by how many I make and store in game. Right now, there\\'s 10 sets of load trapdoors for the towers. I\\'ll add more later if needed. \r\n\r\nIf you have the \\\"Adjust Item after Placement\\\" option enabled in \\'settings\\', when you place a house, you can adjust the position just like you normally would. When you are finished moving the building where you want it, click \\'exit\\' and the doors will be automatically placed for you. \r\n\r\nIf you decide to move the house later or if you had the \\\"Adjust Item After Placement\\\" disabled, you can use the \\\"packup/adjust spell\\\" to place the doors. When you cast the pack/adjust spell at one of these houses, you\\'ll get the same menu as before only with a third choice: \\\"deploy doors\\\". Selecting \\\"deploy doors\\\" will cause that buildings doors to be spawned and placed. If you need to move the house, I suggest that you first remove (delete) the existing doors using the pack/adjust spell, then move the house to where you want it. After that, cast the spell at the house again and select \\\"deploy doors\\\".\r\n\r\nTROPHIES\r\nAll of the Hearthfire trophies are available for decorating your houses. You can select from 3 different bases (or pedestals) and 26 different life sized animal trophies to place on it. It also includes humanoid creatures like the Falmer, Hagravens, as well as Dwemer robotic constructs.\r\nTo place a trophy on a pedestal, select the \\'trophy bases\\' option and select the base you want to use. Next, select the trophy to place.  If you made no adjustments to the bases position and spawn a trophy, it will be placed in position on the base. If you move the base you will need to move the trophy accordingly after spawning it.\r\n\r\nMISC ITEMS\r\nThere are also a few misc items, such as the crafting oven,  butter churn, and the sleepable vampire coffin.\r\n\r\nHow Do You Get It? \r\n************************* \r\nDownload it, extract it to your Skyrim \\\"data\\\" directory, choose \\'yes\\' to overwrite files or combine folders, or, use NMM to download and install it. Make sure it\\'s enabled in either NMM or in the Skyrim Launcher \\'Data Files\\' section. \r\n\r\nHow To Use It \r\n****************** \r\nThe first time you launch the game after installing the Pocket Heathfire or after an update, you should get a message telling you that it was added. You will find a \\\"Pocket Hearthfire\\\" token in the apparel section of your inventory. Equip the token and exit the menu to get started. I suggest you hot-key the token to have easy access.  A menu will give you the various choices. After you click on an item, and it appears before you, you will be be presented with an Adjustment Menu to adjust the positioning of the item. \r\n\r\nYou also have the option of repositioning an item by using the \\\"Packup/Adjust Spell\\\" found in the Pocket Empire Builder \\\"settings\\\" menu. Simply equip the spell and cast it on whatever you want to move or packup and a dialogue will appear giving you the choices. \r\n\r\nFor more info on using the various controls, read the Pocket Empire Builder \\\"readme\\\" file and the FAQ that are included in the Pocket Empire Builder archive.\r\n",
  "categoryId": "67",
  "version": "1.07",
  "author": "THX1138 aka splynter",
  "createdUnix": "1363749630",
  "updatedUnix": "1363749610",
  "containsAdultContent": false,
  "uploadedBy": "THX1138",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000018847",
      "name": "Pocket Hearthfires - A Plugin for The Pocket Empire Builder",
      "version": "1.07",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22346",
      "fileName": "Pocket Hearthfires - A Plugin for The Pocket Empire Builder-33605-1-07.rar",
      "uploadedUnix": "1363749610",
      "modVersion": "1.07",
      "virusScanUrl": "https://www.virustotal.com/file/fea3b1020d923cfff2413d2d5cb8e721ac232e208398d2214247d0ac31b3acc2/analysis/1407478233/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pocket%20Hearthfires%20-%20A%20Plugin%20for%20The%20Pocket%20Empire%20Builder-33605-1-07.rar?fid=1000018847&ttl=1535810881&ri=8192&rs=8192&setec=cc8ae6da24110b26d842e17df20bfea9"
    }
  ]
}