{
  "modId": 33613.0,
  "modName": "Chain ENB and SKSE Autoloader",
  "summary": "Fixed Chain ENB to work with OTHER ENBs EXE loaders.",
  "descriptionHtml": "PLEASE ENDORSE THE ORIGINAL WRITER OF THE MOD. I TAKE NO CREDIT BUT THANK ANYONE WHO DOES ENDORSE ME. I MERELY WRITE GUIDES AND EDIT OTHER PEOPLEs WORK.\r\n\r\nhttp://skyrim.nexusmods.com/mods/30705/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D30705  Authors page.\r\n\r\nIF YOU KNOW HOW TO EDIT BATCH FILES YOU CAN MODIFY THIS TO USE \\\"YOUR\\\" ENB\r\n\r\nSINCE NMM DOESN\\'T SUPPORT ROOT SKYRIM DIRECTORY INSTALLATION (GOD FORBID...MILLIONS OF MOD FILES WOULD HAVE TO BE RE-WRITTEN...) THIS IS A MANUAL DOWNLOAD ONLY.\r\n\r\nWell hullz bellz. I didn\\'t expect anyone to ACTULLY get this from me so many thanks.  Since people ARE picking this up perhaps YOU can help ME out by sending me a PM explaining WHAT exactly to download (EXACT references please) from that ENB page the original author links to.\r\n\r\nNow here\\'s the REST of the original author\\'s page notes:\r\n\r\nI was getting awfully tired of having to start the injector before running Skyrim each time, or accidentally opening it multiple times and having multiple redundant processes running.\r\n\r\nThis is designed for people who use Boris Vorontsov\\'s ENB\\'s injector version for post-processing effects and the Skyrim Script Extender (SKSE) for script extensions. If you are not using SKSE, it can be modified by changing the line reading \\\"skse_loader.exe\\\" to \\\"TESV.exe\\\" in order to chain ENB and Skyrim directly. (YOU CAN ADD TO THIS IF YOU KNOW HOW TO EDIT BAT FILES.  THORNE)\r\n\r\nJust drop this into your main Skyrim directory (NOT Data, but the directory above it) and either run it by itself, or use it as a custom command from NMM (OR STEAM.  THORNE). Note: This was designed to be run with the injector (not wrapper) version of ENB. I\\'m using v0.144 (all hail Boris Vorontsov and ENB...), but anything using an \\\"ENBInjector.exe\\\" should work. Like I said, it\\'s a very simple batch file, and you can edit it accordingly if you need to, but this might save people some headaches.\r\n\r\nNOTE: NMM will put this INTO \\\"Data.\\\" Please move it up a directory. With a utility this small, you\\'re likely better off using the manual download anyway.",
  "categoryId": "39",
  "version": "",
  "author": " marius2k4",
  "createdUnix": "1363764074",
  "updatedUnix": "1363763910",
  "containsAdultContent": false,
  "uploadedBy": "Thorne67",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000018881",
      "name": "Chain ENB and SKSE NMM fixed",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Chain ENB and SKSE NMM fixed-33613-.zip",
      "uploadedUnix": "1363763910",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f9e0fb7678aebbe9b0b3adb9a072da285243f40375fda37a88ca1d7b1be4f550/analysis/1407478456/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chain%20ENB%20and%20SKSE%20NMM%20fixed-33613-.zip?fid=1000018881&ttl=1535810898&ri=8192&rs=8192&setec=e6003aaafcbbd830fe2fabb52c34a528"
    }
  ]
}