{
  "modId": 33614.0,
  "modName": "Better Standing Stones",
  "summary": "A highly compatible and lore-friendly mod that upgrades the 13 standing stones of Skyrim to have better and more useful effects and powers, making each stone more desirable and hopefully removing the problem of some stones being completely ignored by Skyrim players.",
  "descriptionHtml": "[heading][center]This mod is intended for Skyrim version 1.9.32.0.8 or higher. Older versions of Skyrim might not work with this mod.[/center][/heading]\n<br />The Better Standing Stones mod has been created to address the problems of the thirteen standing stones in Skyrim, which by default have lackluster effects and laughably weak powers. Unlike other standing stone mods, which I also found to be rather lackluster and/or lore-unfriendly, my approach to upgrading the standing stones in this mod is to stay true to the vanilla (so to speak) by enhancing their effects and powers in ways that are meaningful but don't stray too far from the original design and concept of each stone. However, due to the disparity in the usefulness of the effects that some stones have over others by default, some standing stones will see more changes and upgrades than others. E.g., a weak stone like The Serpent is likely to receive more upgrades than a strong stone like The Lord. Overall, I've tried to balance out the usefulness and desirability of all of the standing stones so that a player doesn't feel like their choice to use any given standing stone is one that was wasted.\n<br />\n<br />This mod was also created with compatibility in mind; no new scripts are added to the game by this mod, as those create considerable save file and compatibility problems - particularly if or when you decide to stop using a mod. To the best of my knowledge, the design of this mod is such that it can be easily installed and uninstalled with no ill effects on one's save files. However, due to the nature of this mod there are a few important steps that should be followed before installing, updating, or uninstalling this mod; those steps are carefully detailed in the pre-installation section near the bottom of this page.\n<br />\n<br />In designing this mod, I've also attempted wherever possible to stay true to the Elder Scrolls lore regarding the various constellations, doomstones (i.e., \"Standing Stones\"), and so on, as keeping my mods lore-friendly is very important to me. However, not all of the changes made to the stones in this mod are explicitly lore-adherent; some of them are done as gameplay balancing attempts, such as the heavy negative effects added to The Ritual, and others are done to fill in gaps in the number of effects attributed to each stone. Where possible, any effects that are not lore-adherent as such are chosen to try and fit in with the concept and design of that particular stone. E.g., the weakness to shock effect on The Tower plays off the concept of tall structures such as a tower being more prone to lightning strikes. Conceptual links of that nature are what drives much of the thought process behind such choices.\n<br />\n<br />If anyone has thoughts, suggestions, or ideas for how this mod could be improved, or for changes to the designs of the various stones to make them better, please let me know in the comments section. I feel that I've come up with a good overall design for the stones, but I'm always looking for ways to make it better.\n<br />\n<br />The changes to the 13 standing stones of Skyrim as implemented by this mod are described below, and included with each section is an excerpt of the lore regarding that particular sign:\n<br />[heading]The Apprentice Stone[/heading]\n<br />[i]\"The Apprentice's Season is Sun's Height. Those born under the sign of the apprentice have a special affinity for magick of all kinds, but are more vulnerable to magick as well.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] Magicka +100.\n<br />[*] Magicka regenerates twice as fast.\n<br />[*] All spells are 20% stronger.\n<br />[*] Weakness to Magic +100%.\n<br />[/list]\n<br />Greater power: \"Skein of Magnus\"\n<br />[list]\n<br />[*] All spells are 30% stronger for 120 seconds.\n<br />[/list][line]\n<br />[heading]The Atronach Stone[/heading]\n<br />[i]\"The Atronach (often called the Golem) is one of the Mage's Charges. Its season is Sun's Dusk. Those born under this sign are natural sorcerers with deep reserves of magicka, but they cannot generate magicka of their own.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] Magicka +150.\n<br />[*] Spell Absorption +50%.\n<br />[*] Your Fire, Frost, and Shock damage is 20% stronger. This affects the magnitude of elemental spells, weapon enchantments, and shouts.\n<br />[*] Your magicka doesn't regenerate.\n<br />[/list]\n<br />Greater power: \"Arcane Well\"\n<br />[list]\n<br />[*] Spell Absorption +30% for 120 seconds.\n<br />[/list][line]\n<br />[heading]The Lady Stone[/heading]\n<br />[i]\"The Lady is one of the Warrior's Charges and her Season is Heartfire. Those born under the sign of the Lady are kind and tolerant.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] Health regenerates 25% faster.\n<br />[*] Stamina regenerates 25% faster.\n<br />[*] Power attacks cost 25% less stamina. Stacks [i]multiplicatively[/i] with the Fighting Stance and Champion's Stance perks. This effect also reduces the stamina cost of zooming in with a bow.\n<br />[*] Intimidation is twice as difficult. This stacks with the Intimidation perk (in theory; still untested).\n<br />[/list]\n<br />Lesser power: \"Lady of the Lake: Waterwalking\"\n<br />[list]\n<br />[*] Waterwalking effect for 999 days.\n<br />[*] Deactivates lesser power \"Lady of the Lake: Waterbreathing\".\n<br />[*] This power can be toggled on and off with the same button.\n<br />[/list]\n<br />Lesser power: \"Lady of the Lake: Waterbreathing\"\n<br />[list]\n<br />[*] Waterbreathing effect for 999 days.\n<br />[*] Deactivates lesser power \"Lady of the Lake: Waterwalking\".\n<br />[*] This power can be toggled on and off with the same button.\n<br />[/list][line]\n<br />[heading]The Lord Stone[/heading]\n<br />[i]\"The Lord's Season is First Seed and he oversees all of Tamriel during the planting. Those born under the sign of the Lord are stronger and healthier than those born under other signs.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] Armor Rating +50.\n<br />[*] Magic Resistance +25%.\n<br />[*] Disease Resistance +25%.\n<br />[*] Weakness to Fire +75%. The effective magnitude is actually 50%, not 75%, due to the passive Magic Resistance effect.\n<br />[/list]\n<br />Greater power: \"Blood of the North\"\n<br />[list]\n<br />[*] Completely restores your Health.\n<br />[/list][line]\n<br />[heading]The Lover Stone[/heading]\n<br />[i]\"The Lover is one of the Thief's Charges and her season is Sun's Dawn. Those born under the sign of the Lover are graceful and passionate.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] All skills improve 15% faster.\n<br />[*] Prices are 10% better.\n<br />[*] Speech +15.\n<br />[*] Weakness to Physical Damage +25%. This affects the damage enemies do to you, not your armor's effectiveness against damage.\n<br />[/list]\n<br />Greater power: \"Lover's Kiss\"\n<br />[list]\n<br />[*] Paralyze target for 30 seconds. Some targets are immune to paralysis, however.\n<br />[/list][line]\n<br />[heading]The Mage Stone[/heading]\n<br />[i]\"The Mage is a Guardian Constellation whose Season is Rain's Hand when magicka was first used by men. His Charges are the Apprentice, the Golem, and the Ritual. Those born under the Mage have more magicka and talent for all kinds of spellcasting, but are often arrogant and absent-minded.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] All magic skills improve 20% faster.\n<br />[*] Magicka +50.\n<br />[*] All spells cost 10% less to cast. This stacks [i]additively[/i] with spell cost reductions from enchanted items.\n<br />[/list]\n<br />Greater power: \"Gates of Aetherius\"\n<br />[list]\n<br />[*] Magic Resist +20% for 120 seconds.\n<br />[*] Magicka regenerates 50% faster for 120 seconds.\n<br />[/list][line]\n<br />[heading]The Ritual Stone[/heading]\n<br />[i]\"The Ritual is one of the Mage's Charges and its Season is Morning Star. Those born under this sign have a variety of abilities depending on the aspects of the moons and the Divines.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] Weakness to Physical Damage +50%. This affects the damage enemies do to you, not your armor's effectiveness against damage.\n<br />[*] Weakness to Magic +50%.\n<br />[/list]\n<br />Lesser power: \"Cursed Ritual\"\n<br />[list]\n<br />[*] Casting this ritual takes 6 seconds to charge up and costs 100 magicka. Drains 50 health [i]per corpse[/i] that is successfully revived; this effect [i]can[/i] kill you.\n<br />[*] Reanimates all ritually prepared corpses (except corpses that [i]can't[/i] be revived) up to level 999 in a range of 100 ft for 999 days.\n<br />[*] A maximum of 10 corpses can be reanimated at any one time.\n<br />[*] Ritual preparation means the corpse must contain a Black Soul Gem (filled), Deathbell, Hagraven Claw, Nightshade, and Skull.\n<br />[*] The ritual components in a corpse are [i]not[/i] consumed by the power; they can be re-used repeatedly.\n<br />[*] Any corpses not ritually prepared in this way will not be reanimated by this power.\n<br />[/list]\n<br />Greater power: \"Blessed Ritual\"\n<br />[list]\n<br />[*] Casting this ritual takes 3 seconds to charge up.\n<br />[*] Casts turn-undead on all applicable undead NPCs up to level 999 within 100 ft for 30 seconds and casts calm on all applicable non-undead/non-dragon NPCs up to level 999 within 100ft for 30 seconds.\n<br />[*] Using this power on peaceful NPC's is not considered an attack, so it's safe to use even in towns.\n<br />[/list][line]\n<br />[heading]The Serpent Stone[/heading]\n<br />[i]\"The Serpent wanders about in the sky and has no Season, though its motions are predictable to a degree. No characteristics are common to all who are born under the sign of the Serpent. Those born under this sign are the most blessed and the most cursed.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] Poison Resistance +50%.\n<br />[*] Sneak attacks do 25% more damage.\n<br />[*] Weakness to Physical Damage +50%. This affects the damage enemies do to you, not your armor's effectiveness against damage.\n<br />[*] Weakness to Magic +50%.\n<br />[*] Sneaking, pickpocketing, and lockpicking are 20% less effective.\n<br />[/list]\n<br />Lesser power: \"Serpent's Senses\"\n<br />[list]\n<br />[*] Detect Creatures and Corpses within 200 ft (100 ft indoors) for 999 days.\n<br />[*] Creatures means living beings that aren't flagged as undetectable and aren't undead, machines, daedra, ghosts, or familiars.\n<br />[*] Corpses means anything dead or undead that isn't flagged as undetectable and isn't a machine, daedra, ghost, or familiar.\n<br />[*] Detected Creatures show up as Red and detected Corpses show up as Blue, regardless of whether they're friends or enemies.\n<br />[*] The detection effect works like a cloak spell; it follows you as you move and acquires new targets automatically.\n<br />[*] Casting is silent (i.e., NPC's don't hear it).\n<br />[*] This power can be toggled on and off with the same button.\n<br />[/list]\n<br />Greater power: \"Serpent's Fangs\"\n<br />[list]\n<br />[*] Paralyze target for 10 seconds. Some targets are immune to paralysis, however.\n<br />[*] Poison target for 10 seconds, dealing (amount based on player level) damage per second. Ignores poison resistance.\n<br />[*] Damage scale: Lv1: 10/s. Lv10: 15/s. Lv20: 20/s. Lv30: 30/s. Lv40: 40/s. Lv50: 50/s.\n<br />[*] The poison damage amount updates on its own when you level up to the next level range.\n<br />[*] Casting is silent (i.e., NPC's don't hear it).\n<br />[/list][line]\n<br />[heading]The Shadow Stone[/heading]\n<br />[i]\"The Shadow's Season is Second Seed. The Shadow grants those born under her sign the ability to hide in shadows.\"[/i]\n<br />\n<br />Lesser power: \"Chameleon\"\n<br />[list]\n<br />[*] You become invisible for 999 days. Activating an object or attacking will break the spell.\n<br />[*] This power can't be cast during combat.\n<br />[*] Casting is silent (i.e., NPC's don't hear it).\n<br />[*] This power can be toggled on and off with the same button.\n<br />[/list]\n<br />Greater power: \"Moonshadow\"\n<br />[list]\n<br />[*] Casts invisibility on everything within 100 ft (including you) for 60 seconds.\n<br />[*] Activating an object or attacking will only break the spell on that individual. All other targets remain invisible for the duration.\n<br />[*] Casting is silent (i.e., NPC's don't hear it).\n<br />[*] Using this power on peaceful NPC's is not considered an attack, so it's safe to use even in towns.\n<br />[/list][line]\n<br />[heading]The Steed Stone[/heading]\n<br />[i]\"The Steed is one of the Warrior's Charges, and her Season is Mid Year. Those born under the sign of the Steed are impatient and always hurrying from one place to another.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] Movement Speed +20%.\n<br />[*] Carry Weight +100.\n<br />[*] No movement penalty from armor.\n<br />[*] Weakness to Poison +50%.\n<br />[/list]\n<br />Greater power: \"Hellride\"\n<br />[list]\n<br />[*] Movement Speed +40% for 120 seconds.\n<br />[*] Stamina regeneration is doubled for 120 seconds.\n<br />[*] Immunity to fall damage for 120 seconds.\n<br />[/list][line]\n<br />[heading]The Thief Stone[/heading]\n<br />[i]\"The Thief is the last Guardian Constellation, and her Season is the darkest month of Evening Star. Her Charges are the Lover, the Shadow, and the Tower. Those born under the sign of the Thief are not typically thieves, though they take risks more often and only rarely come to harm. They will run out of luck eventually, however, and rarely live as long as those born under other signs.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] All stealth skills (excluding Archery, which is a combat skill) improve 20% faster.\n<br />[*] Sneaking, pickpocketing, and lockpicking are 10% more effective.\n<br />[*] 10% chance of avoiding all damage from an attack. Doesn't work on spells. Stacks in parallel with the Deft Movement perk.\n<br />[/list]\n<br />Lesser power: \"Greed\"\n<br />[list]\n<br />[*] Detect Wealth within 200 ft (100 ft indoors) for 999 days.\n<br />[*] Wealth items are defined as: Gold coins, gems, ores, ingots, and jewelry.\n<br />[*] Wealth items are detected when carried by anything alive, dead, undead, or mechanical that isn't flagged as undetectable.\n<br />[*] Detected targets show up as gold/yellow, regardless of whether they're friends or enemies.\n<br />[*] The detection effect works like a cloak spell; it follows you as you move and acquires new targets automatically.\n<br />[*] Casting is silent (i.e., NPC's don't hear it).\n<br />[*] This power can be toggled on and off with the same button.\n<br />[/list][line]\n<br />[heading]The Tower Stone[/heading]\n<br />[i]\"The Tower is one of the Thief's Charges and its Season is Frostfall. Those born under the sign of the Tower have a knack for finding gold and can open locks of all kinds.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] Lockpicking is 30% easier.\n<br />[*] You are immune to stagger effects.\n<br />[*] Weakness to Shock +50%. \n<br />[/list]\n<br />Lesser power: \"Beggar's Nose\"\n<br />[list]\n<br />[*] Detect Creatures, Gold Objects, and Keys within 200 ft (100 ft indoors) for 999 days.\n<br />[*] Creatures means living beings that aren't flagged as undetectable and aren't undead, machines, daedra, ghosts, or familiars.\n<br />[*] Gold Objects means gold coins, gold ores, gold ingots, and unenchanted gold jewelry.\n<br />[*] Gold Objects and Keys are detected when carried by anything alive, dead, undead, or mechanical that isn't flagged as undetectable.\n<br />[*] Detected targets are displayed in one of three colors: Blue = Keys, Gold/Yellow = Gold Objects, and Red = Creatures. Multiple detections of the same target only shows a single color based on priority: Blue is the highest priority and Red is the lowest priority.\n<br />[*] The detection effect works like a cloak spell; it follows you as you move and acquires new targets automatically.\n<br />[*] Casting is silent (i.e., NPC's don't hear it).\n<br />[*] This power can be toggled on and off with the same button.\n<br />[/list]\n<br />Greater power: \"Warden's Key\"\n<br />[list]\n<br />[*] You can automatically open a Master or lower lock via the Activate menu of a locked object.\n<br />[/list][line]\n<br />[heading]The Warrior Stone[/heading]\n<br />[i]\"The Warrior is the first Guardian Constellation and he protects his charges during their Seasons. The Warrior's own season is Last Seed when his Strength is needed for the harvest. His Charges are the Lady, the Steed, and the Lord. Those born under the sign of the Warrior are skilled with weapons of all kinds, but prone to short tempers.\"[/i]\n<br />\n<br />Passive effects:\n<br />[list]\n<br />[*] All combat skills (including Archery, which is a combat skill) improve 20% faster.\n<br />[*] Weapons and unarmed strikes do (amount based on level) additional damage.\n<br />[*] Weapon damage scale: Lv1: 1. Lv10: 2. Lv20: 4. Lv30: 6. Lv40: 8. Lv50: 10.\n<br />[*] Unarmed damage scale: Lv1: 2. Lv10: 4. Lv20: 8. Lv30: 12. Lv40: 16. Lv50: 20.\n<br />[*] The damage amounts update automatically when you level up to the next level range.\n<br />[*] Intimidation is twice as successful. This stacks with the Intimidation perk (in theory; still untested).\n<br />[/list]\n<br />Greater power: \"War Cry\"\n<br />[list]\n<br />[*] Increases your Physical Damage by 20% for 120 seconds.\n<br />[*] Casts a rally effect on all non-hostile NPC's within 60 feet for 120 seconds. Does not affect daedra, dragons, or machines.\n<br />[*] The rally effect boosts an NPC's confidence, and adds 50 to their maximum health and stamina.\n<br />[*] Using this power on peaceful NPC's is not considered an attack, so it's safe to use even in towns.\n<br />[/list][line]\n<br />Loading screen and missing standing stones tips:\n<br />In the process of making this mod I've also discovered that loading screen tips for the Lord Stone and Tower Stone were never created even though the objects for use in those loading screens exist in the CK. So, this mod also corrects that bug by adding in loading screen tips for the Lord Stone and Tower Stone.\n<br />[heading]Save-file Preparation Instructions:[/heading]\n<br />While this is a highly compatible mod, there are still explicit steps that should be followed whenever you install, uninstall, or update this mod to a newer version. This is because the overall internal arrangement of the effects of each standing stone is different from the vanilla defaults, and also because those internal arrangements might change between different versions of this mod. Following these steps will help you avoid corrupting your save files:\n<br />\n<br />1) Use the console to clear all active effects on the player with the command \"player.dispelallspells\".\n<br />2) Use the console to clear the current standing stone you have active on the player with the following commands, depending on the stone that is active:\n<br />[list]\n<br />[*] Apprentice Stone: \"player.removespell 0010e439\" and \"player.removespell 000e5f4e\".\n<br />[*] Atronach Stone: \"player.removespell 000e5f51\".\n<br />[*] Lady Stone: \"player.removespell 000e5f54\".\n<br />[*] Lord Stone: \"player.removespell 000e5f58\"\n<br />[*] Lover Stone: \"player.removespell 000e5f5a\"\n<br />[*] Mage Stone: \"player.removespell 000e5f47\"\n<br />[*] Ritual Stone: \"player.removespell 000e7329\"\n<br />[*] Serpent Stone: \"player.removespell 000e5f61\"\n<br />[*] Shadow Stone: \"player.removespell 000e732a\"\n<br />[*] Steed Stone: \"player.removespell 000e5f5e\"\n<br />[*] Thief Stone: \"player.removespell 000e5f45\"\n<br />[*] Tower Stone: \"player.removespell 000e7328\"\n<br />[*] Warrior Stone: \"player.removespell 000e5f4c\"\n<br />[/list]\n<br />3) Just for good measure, again use the console to clear all active effects on the player with the command \"player.dispelallspells\".\n<br />4) Save your prepared save file, then continue your installation, uninstallation, or updating of the mod as usual.\n<br />[heading]Installation:[/heading]\n<br />Either use a mod manager (such as [url=http://www.nexusmods.com/skyrim/mods/1334]Mod Organizer[/url]), or copy Better_Standing_Stones.esp into the Data subfolder of your Skyrim installation directory and then enable it in the launcher.\n<br />[heading]Uninstallation:[/heading]\n<br />Either remove/disable it in your mod manager, or delete Better_Standing_Stones.esp from the Data subfolder of your Skyrim installation directory.\n<br />[heading]Permissions[/heading]\n<br />[list]\n<br />[*]You may not upload this mod to other sites without my permission.\n<br />[*]You may not distribute this mod without my permission.\n<br />[*]You may not include this mod, in whole or in part, inside or alongside other mods without my permission.\n<br />[*]You may not release altered versions of this mod without my permission.\n<br />[*]You may not release translated versions of this mod without my permission.\n<br />[*]If I have not noted something here regarding my mod as needing my permission that does [b][u]not[/u][/b] mean you don't need my permission for it. When in doubt, ask me directly via Personal Message.\n<br />[/list][line]\n<br />That's all there is to this mod. If you find any bugs or have suggestions or ideas for the mod please let me know in the comments section. Enjoy!\n<br />\n<br />My other mods:\n<br />[url=http://www.nexusmods.com/skyrim/mods/32761]Better Divine Blessings[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/33016]Better Daedric Blessings[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/33135]Gemstone Recovery[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/79023]Unleveled Items[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/32422]College of Winterhold Shop Fixes - Mage Hoods - Robes - Gloves - Boots - Psiijic - Etc[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/32817]Silda the Unseen Master[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/33326]Better Imperial Luck[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/32284]Hoodswap[/url]",
  "categoryId": "24",
  "version": "1.22",
  "author": "SkylerModder",
  "createdUnix": "1366426925",
  "updatedUnix": "1391381016",
  "containsAdultContent": false,
  "uploadedBy": "SkylerModder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000094926",
      "name": "Better_Standing_Stones_v1_22",
      "version": "1.22",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "Better_Standing_Stones_v1_22-33614-1-22.7z",
      "uploadedUnix": "1391381016",
      "modVersion": "1.22",
      "virusScanUrl": "https://www.virustotal.com/file/2a965c7d4cfbd9738f5affd5036b455127ba3c460a8f7acbfb85c1315ea7d3a9/analysis/1407915192/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better_Standing_Stones_v1_22-33614-1-22.7z?fid=1000094926&ttl=1535810899&ri=8192&rs=8192&setec=3fdfa22baf4720466caabc82016e1322"
    }
  ]
}