{
  "modId": 3362.0,
  "modName": "M17 Glass set Darker with blue Moonstone",
  "summary": "Glass armor and weapons: Glass is darker green and the metal is blue moonstone.",
  "descriptionHtml": "Just before you download this, check my new glass armor and weapon set: http://www.skyrimnexus.com/downloads/file.php?id=4201\r\nJust finished it today and i feel its more like it.\r\n\r\n\r\n!!!!!  Update !!!!\r\nNow every glass weapon and armor piece is finished. The whole set. Enjoy and let me know what you think.\r\n\r\nDescription:\r\nI didn\\'t like the original glass set, the glass parts were too pale and the gold metal was too close to Elven and dwarven gear. When smithing the armor and weapons you  use malachite and moonstone. I like the moonstone to be pale blue, so i changed the textures to my liking.\r\nBefore anyone is going to write that some parts have different shades, i want to say thats is because in nature you never find two pieces of stone with the exact same shade and texture :-)\r\n\r\n\r\n\r\nIf you like this mod, you might want to check out my Blue Moonstone Elven set: http://www.skyrimnexus.com/downloads/file.php?id=3239\r\nThey go nicely together.\r\n\r\nThere is only small problem with the glass bow. The glass part on the bow are not the right shade. I just can\\'t get it to change the proper color. Will try to fix it eventually.\r\n\r\n",
  "categoryId": "29",
  "version": "1.2",
  "author": "Malkav17",
  "createdUnix": "1323622667",
  "updatedUnix": "1323720717",
  "containsAdultContent": false,
  "uploadedBy": "malkav17",
  "primaryFile": null,
  "files": [
    {
      "fileId": "9768",
      "name": "Dark green glass with blue moonstone full set",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9284",
      "fileName": "Dark green glass with blue moonstone full set-3362-1-2.zip",
      "uploadedUnix": "1323720717",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/9a37cf84bb485ce7dba3191e9af5887b7b315fd17cec2054080c3e4a10e70e42/analysis/1406511917/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20green%20glass%20with%20blue%20moonstone%20full%20set-3362-1-2.zip?fid=9768&ttl=1535758345&ri=8192&rs=8192&setec=531fb62a7002042a79af0fc93bbced8b"
    }
  ]
}