{
  "modId": 33632.0,
  "modName": "Greta - Vampire Follower",
  "summary": "My Vampire, Greta, as a follower.  Requires Dawnguard!!!",
  "descriptionHtml": "Backstory:\r\nGreta was born 23 years ago in the Province of Cyrodiil.  At the age of 9, she discovered she was a good marksman.  At the age of 14, she was winning tournaments and could best even the best hunter.  By 19, she was recognized as one of the best marksmen in Cyrodiil, and she was aiming for all of Tamriel.  However, she lost a tournament and got discouraged at the age of 22.\r\n\r\nShe moved to Skyrim, wandering as a sort of mercenary.  She was attacked by a Vampire who, for some reason, took her to Castle Volkihar.  Harkon killed the man, but spared Greta.  He offered her his blood, and she accepted.\r\n\r\nAfter a three day sleep, she awoke and Harkon taught her how to utilize her power.\r\n\r\nGreta spent three months there when she found two unique swords and took up Swordmanship.\r\n\r\nShe now spends her days in the Bannered Mare in Whiterun, wearing rags.  The official reason is unknown, but she\\'s an ally of the Dragonborn and will follow him/her anywhere.\r\n\r\nWhere she left her swords, no one knows.\r\n((I hope to make this a quest and have her voiced and everything one day.  But I need to learn to script first.))\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nDawnguard IS REQUIRED!! No way around this.\r\n\r\nHello all.  This is my second follower.\r\n\r\nI used a different file set up for this one.\r\n\r\nShe\\'s in the Bannered Mare in Whiterun.\r\n\r\nAlso, when you take the Swords from her, she will equip a bow.  My screen wasn\\'t big enough to show the option to take it away, so if someone out there would fix this for me, I would be much obliged.\r\n\r\nInstead of uploading pictures of the follower, I will upload pictures of the original character.  They look exactly alike.\r\n\r\nI suppose it depends on the situation what she will use.  I haven\\'t completely finished testing her.\r\n\r\nChangelog:\r\nV1 - Initial\r\n\r\nPlanned updates:\r\nFix the neckseam if enough people complain.\r\n\r\nCredits\r\nDimon99 - http://skyrim.nexusmods.com/mods/6709\r\nIthot - http://skyrim.nexusmods.com/mods/30411\r\nApachii - http://skyrim.nexusmods.com/mods/10168\r\nSvarogNL - http://skyrim.nexusmods.com/mods/16731\r\n\r\nRecommended:\r\nFemale Vampires have Fangs - http://skyrim.nexusmods.com/mods/22522\r\nIf you want her to have fangs.  I highly recommend it.  If you don\\'t have this mod and she has fangs, you tell me.\r\nUnbleak - http://skyrim.nexusmods.com/mods/24828\r\nI use the Unbleak Performance version because I have such a crappy graphics card with no distance blur and no film grain.  I have absolutely no performance drop.\r\nLustmord Vampire Armor - http://skyrim.nexusmods.com/mods/25852\r\nGreta, I think, looks best in this.  She might use the crossbow, as her back story states she was an expert with a crossbow at a young age.  If not, I\\'ll tweak her traits.\r\nDread Knight Weapon Set - http://skyrim.nexusmods.com/mods/15494\r\nIt\\'s cool, that\\'s why...\r\nDual Wield for followers - http://skyrim.nexusmods.com/mods/13571\r\nShe won\\'t dual wield without it.\r\nLess sunken cheeks - http://www.skyrim.nexusmods.com/mods/16506\r\nIf you don\\'t want those cheeks sunken.  She\\'ll use any Chargen you have that affects Vampires.\r\nCovereyes - http://skyrim.nexusmods.com/mods/4869\r\nIf you want her to have the eyes in the pictures.  Otherwise she\\'ll use Vanilla eyes.  Or whatever vampire eyes you have installed.  She has the covereyes texture in the pictures because I use Covereyes.\r\n\r\nPermissions:\r\nYou may NOT upload her to anything.  This is a Nexus exclusive.\r\nYou may, however, edit her to your liking and show me.  I may add your version to my mod, giving you due credit.",
  "categoryId": "66",
  "version": "V1",
  "author": "Amor",
  "createdUnix": "1364158798",
  "updatedUnix": "1364158549",
  "containsAdultContent": false,
  "uploadedBy": "Amoryenar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020019",
      "name": "Greta",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25172",
      "fileName": "Greta-33632-V1.zip",
      "uploadedUnix": "1364158549",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/c9f0d0834d727a61cb878ae7f8e45d8ab39037db6bc25ee7e36a8e512a6a3f7a/analysis/1407486861/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Greta-33632-V1.zip?fid=1000020019&ttl=1535810928&ri=8192&rs=8192&setec=0e5183fbbce4f5be8fb0805ca16d73d8"
    }
  ]
}