{
  "modId": 33656.0,
  "modName": "Lakeview Manor Overhaul ENG_RUS",
  "summary": "This mod add to your Lakeview Manor the following:\r<br />- walls\r<br />- cellar Glory Hall \r<br />- balcony \r<br />- magic garden\r<br />- pool\r<br />- your bard not male anymore)))\r<br />- your personal underground burrow with two girls (followers marriable)",
  "descriptionHtml": "Requirements:\r<br />+ Skyrim 1.8\r<br />+ Heartfire DLC\r<br />\r<br />V1.1:\r<br />+ BUG with location names fixed\r<br />+ Gals in burrow are prettier now (faces based: Lisa looks like Saadia and Sophie looks like Muiry)\r<br />+ Oven has been added to the Forgotten burrow\r<br />\r<br />1) Dont you think that it is strange, that such big manor do not have any walls to protect you from wolfs in wild forest? Even in Morrowing all manors were protected by the walls. I decided to improve that - now your manor is fully protected, moreover - now you will have a small pool outside and nice balcony in nordic ruins style with lakeview. Also you will have a nice magic garden, like in mages guild. \r<br />All navmeshes carefully edited - so you companoins will easy find their way. Random attacs on your manor are still in force, but you will fight now inside your walls perimeter.\r<br />2) Dont you think that left wall in cellar looks like entrance to other room? I think so, and now in your cellar you will have a personal Glory Hall (not gloryhole lol) - its like armory in vanilla manor, just bigger. WARNING&#33;&#33;&#33; PLEASE READ THIS&#33;&#33;&#33; If you are vimpire and you have a coffin in your cellar - it will be not easy to pass throught it to you Glory Hall. The wall behind coffin was removed, however, if you do not want to use Glory Hall you can open creation kit and just put the wall back (she is at her place but much higher). The other thing that you can do it&#39;s to try to move the coffin using console commands:\r<br />   open console, select coffin, then type:\r<br />   &#34;getpos x&#34; will tell you the X coordinate the coffin it currently at.\r<br />   &#34;setpos (now you type a new coordinate)&#34; will move the coffin.\r<br />3) The last thing in this mod is new location in nordic ruins style, the entrance is in Glory Hall. You should look at this place, its really nice. Here you will find two girls that can be your followers (I recommend you to use UFO mod with your followers). They are vanilla followers non-essential and sorry, they are naked, so we have adult content here).\r<br />4) Bard sex has been changed, now its a girl\r<br />.\r<br />Installation: just copy the file to your Skyrim/Data folder\r<br />Unistall: delete ...Skyrim/Data/Lakeview overhaul.esp\r<br />incompatibility: with all other mods connected with the Lakeview Manor\r<br />.\r<br />PS: this is my first mod, and I should say that is quite a squeaky bum time to expect peoples comments))) So if u like it, let me know)\r<br />.\r<br />Требования\r<br />+ Skyrim 1.8 или выше\r<br />+ Heartfire DLC\r<br />\r<br />V1.1:\r<br />+ все названия локаций и имена персонажей на английском языке\r<br />+ девки в забытой норе стали посимпотичнее (лица взяты от других персонажей: Lisa выглядит как Saadia, а Sophie как Muiry)\r<br />+ Печка добавлена в забытую нору - можно печь печеньки. Пригодится на случай, если в ососбняке отстроили вместо кухни какую-то безделицу\r<br />\r<br />1) Вам не кажется странным, что Ваш особняк не имеет даже забора для защиты от волков в диком лесу? Даже в старом добром Варденфелле все особняки были обнесены стеной. Я решил это исправить - теперь особняк обнесен серъезными стенами, более того  - теперь у Вас есть небольшой бассейн на приусадебной территории, плюс небольшой балкон в стиле древних нордов с шикарным видом на озеро. Также добавлен маленький сад а-ля гильдия магов. Да, ещё много выпивки)))\r<br />Навмеши прописаны как надо, компаньоны не должны тупить. Если такое, всё-же происходит - значит, вы используете два и более мода, редактирующих одну и ту же территорию. \r<br />Рандомные атаки на поместье сохранены. Враги будут спауниться там же, где и раньше.\r<br />2) не думаете, что слева, при входе в подвал, определенно должна быть дверь? Я рассудил именно так - теперь у Вас есть свой Зал Славы, с кучей манекенов для Вашего многочисленного барахла. ВНИМАНИЕ&#33;&#33;&#33; ПРОЧТИ&#33;&#33;&#33; Если Вы кровососущщий персонаж, и в подвале находится Ваша резиденция - то попасть в Зал Славы будет несколько неудобюно - на месте прохода будет стоять &#34;оное&#34;... И, если вы умеете пользоваться редактором SCK - можете либо передвинуть оно самостоятельно, либо вернуть стену назад (я ее не убирал, он висит в воздухе значительно выше).\r<br />Другой способ переместить &#34;оное&#34;, не прибегая к помощи редактора - с помощью консольных комманд:\r<br /> подходим к &#34;оному&#34;, жмём &#34;~&#34;, кликаем на оное и пишем:\r<br />   &#34;getpos x&#34; покажет Вам координату X на которой &#34;оное&#34; находится в данный момент.\r<br />   &#34;setpos (ввести новые координаты)&#34; оное передвинется.\r<br />3) Забытая нора. Небольшие нордские руины с широким размахом обустроенные. Вход в зале славы, люк в полу. Это классное место, там есть кровати, кухня, печка, ванная джакузи=) А ещё в норе  Вас, помимо прочего, ждут два дружелюбных NPC женского пола, которых можно взять с собой в поход. Они стандартные фолловеры, без изысков, на них можно жениться.\r<br />4) Пол барда поменян. Теперь это красивая девушка Sonya с неочень красивым голосом)))\r<br />.\r<br />Установка: бросить все файлы в папку с игрой: Skyrim/Data \r<br />Удаление: удалите ...Skyrim/Data/Lakeview overhaul.esp\r<br />несовместимость: с любым другим модом, редактирующим окрестности Особняка у Озера. Однако, если поиграть с лоад ордером, можно решить проблемы совместимости.\r<br />",
  "categoryId": "67",
  "version": "1.1",
  "author": "Serg1313 aka Rzhevskiy",
  "createdUnix": "1363852597",
  "updatedUnix": "1364632121",
  "containsAdultContent": false,
  "uploadedBy": "serg1313",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000019103",
      "name": "Lakeview overhaul",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "270",
      "fileName": "Lakeview overhaul-33656-.7z",
      "uploadedUnix": "1363851304",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/77000ad206f79f6d257f49b8ad4e9bea360798501cb6f322fde1baa2036087f2/analysis/1407480483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20overhaul-33656-.7z?fid=1000019103&ttl=1535810967&ri=8192&rs=8192&setec=b9fe1fcf21742bedeacddb7558c57664"
    },
    {
      "fileId": "1000021084",
      "name": "Lakeview overhaul",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "271",
      "fileName": "Lakeview overhaul-33656-1-1.7z",
      "uploadedUnix": "1364632121",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7fdb473198059691c87901959f243d5cae3f1eee84709cce7ddccddf24f4a94f/analysis/1407495190/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20overhaul-33656-1-1.7z?fid=1000021084&ttl=1535810967&ri=8192&rs=8192&setec=f73a6940544a93e6feb57807c87f507d"
    }
  ]
}