{
  "modId": 33696.0,
  "modName": "SkoomaSale -WIP-",
  "summary": "This is a small modification that makes you a street level Skooma dealer, allowing you to offer Skooma to any NPC in the game. Be careful of whom you proposition, however; selling drugs is illegal, and not everybody in Skyrim will approve of your entrepreneurial exploits. ",
  "descriptionHtml": "[img]http://static.skyrim.nexusmods.com/mods/images/33696-1-1363916113.jpg[/img]\r\nSkoomaSale 0.2 Released!\r\n\r\nAre you unimpressed with the average Nord\\'s access to Skooma?\r\nDo you see Skyrim as an untapped market for illegal goods?\r\nDo you have a Khajit friend looking for a fix?\r\nDo you want to be the subject of After-School-Specials from Riften to Markarth?\r\n\r\nIf you answered \\\"Yes\\\" to any of these questions, then SkoomaSale is the mod for you.\r\n\r\nSkoomaSale lets you try to sell Skooma to any NPC in the game. NPCs will react to offers a variety of different ways, from gratitude, to ignorance, to outright assault. Race, age, wealth, and employment (along with some blind luck!) all influence whether or not an NPC is interested in your wares. \r\n\r\nNEW IN 0.2\r\n-NPCs who buy Skooma from you will be more likely to buy from you for 3 days (refreshes on sell)\r\n-NPCs who are \\\"Users\\\" have a chance to become addicted, massively increasing sell success rate and possibly causing some erratic behavior... (last for 4 days, refreshes every time you sell to them)\r\n-NPCs who refuse your offer will be much more likely to call the guards on you for 3 days (refreshes on rejection)\r\n-Rewards for Selling Skooma \r\nwill now scale with your Speech skill. \r\n-Rewards for selling Skooma to Users / Addicts will scale MUCH better than \\\"normal\\\" sales.\r\n\r\nBUGS: The script that prevents you from selling to the same person for 24 hours sometimes breaks. I\\'m working on a solution. In the meantime, if you sold to an NPC, waited 24 hours (or more) and STILL do not get the \\\"Want to buy some Skooma\\\" (or equivalent) message here is a temporary fix.\r\n\r\n-Open up the console, type \\\"help SkoomaRecentUserSpell\\\" It will display a number similar to 04001847\r\n-Click on the target NPC, and type \\\"removespell THATHUMBER\\\" where THATNUMBER is the string you got from the help command.  \r\n\r\n\r\nGameplay example:\r\nYou run into Whiterun, and try to sell to an NPCs. After many failures (and daring escapes from NPCs) you finally have a reliable customer. This NPC has been flagged as a user for 24 hours, and will be safer and more profitable. Make sure you sell to him at least once every 3 days, to ensure that he remains a user. There is a small chance on sell that he will \\\"upgrade\\\" to a full blown addict. He will now offer superior payouts, and you should feed him a steady stream of Skooma to keep him hooked. \r\n\r\n\r\nFIRST USE:\r\nLoad the mod, load a save. Make a new save. Quit to main menu, load that save.\r\n\r\nThe mod is not active, and you will be able to sell Skooma to NPCs.\r\n\r\nIF UPGRADING from 0.1: wait for 24 hours, save game. quit game. follow first use instructions.\r\n\r\nHow to activate:\r\n-As long as you have a bottle of Skooma in your inventory, you will be able to offer it to an NPC.\r\n\r\nThings to be aware of:\r\n-This mod does not yet work with \\\"special\\\" Skooma (Double Distilled, etc.) \r\n-You can only ask the same NPC to buy Skooma once per day.  \r\n-You can ask as many individual NPCs as you want per day.\r\n-You should be able to ask any non-hostile NPC.\r\n-The success rate of a sale is quite low. \r\n-SELLING SKOOMA IS A CRIME. Some NPCs will get very offended by this behavior, and report you to the guards\r\n (they treat it like assault).\r\n\r\nStuff I will be working on in the short term:\r\n-Dynamically added Regular Customers, who will always buy your goods.\r\n-Dynamically added \\\"Skooma Haters,\\\" who will always report you. \r\n\r\nStuff I will be working on in the long term:\r\n-Skooma Dealer\\'s den.\r\n-Skooma Dealer\\'s questline.\r\n-Radiant quests\r\n\r\nCOMPATIBILITY:\r\nSkoomaSale deals with the distribution of Skooma Vials, and not their contents. The sale dialogue should work with any Skooma modification that overwrites/replaces \\\"vanilla\\\" Skooma potions. It will not with any custom Skooma types that other mods add in.\r\n\r\nOther than that, this mod is (as of 0.1 release) almost entirely dialogue based. It shouldn\\'t mess anything up.\r\n\r\nSKSE: You need to use Skyrim Script Extender (SKSE) (available at http://skse.silverlock.org/ ) to get maximum functionality. If you\\'ve found the dark hole of the Nexus that my mod resides in, I\\'ll assume that you know how to run it.\r\n\r\nIf you don\\'t want to run SKSE, the core functionality of the mod will work fine. You\\'ll miss out on 2 special events (potentially different reactions for rich/poor target NPCs) but everything else will work fine.\r\n\r\nINSTALLATION:\r\nPut SkoomaSale.ESP and SkoomaSale.BSA into your Skyrim/data folder\r\n\r\nUNINSTALLATION: \r\ndelete the aforementioned files.\r\n\r\nI\\'m putting out this early release to get feedback on the basic Sale mechanics, and get some fresh thoughts on the project. Please feel free to post and comments/suggestions/questions that you have, and I will respond in a timely manner.\r\n\r\nAlso, please report any bugs that you discover!\r\n\r\nCheers,\r\nKG\r\n\r\n\r\n\r\nCHANGELOG:\r\n\r\nCurrently implemented features (0.1 Release, 3.21.2013)\r\n-\\\"Basic\\\" Skooma functionality; you can try to sell to any NPC in the game.\r\n-A few special interactions with certain demographics.\r\n-Some citizens will report you to the guards if you try to push your wares on them. \r\n-Randomly generated responses, depending on a variety of factors.\r\n\r\nThank you to everyone for your comments, time, and kind words.\r\n\r\nSpecial shoutout to Mojo for walking me through the scripting. This mod would be dead in the water if not for him.\r\n\r\nCheck out his mod, Spells of Tamriel, here: http://skyrim.nexusmods.com/mods/21941",
  "categoryId": "78",
  "version": "0.2",
  "author": "SILVI0BERLUSCONI",
  "createdUnix": "1363915892",
  "updatedUnix": "1364182622",
  "containsAdultContent": false,
  "uploadedBy": "SILVI0BERLUSCONI",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020083",
      "name": "SkoomaSale_v_0_2",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "SkoomaSale_v_0_2-33696-0-2.zip",
      "uploadedUnix": "1364182622",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/02eacc34fe199bd9da76422f8e257e93d3431d1fac11375bf47b3e25660eac81/analysis/1407487394/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkoomaSale_v_0_2-33696-0-2.zip?fid=1000020083&ttl=1535811027&ri=8192&rs=8192&setec=cdd4f558537d36f676b16434d1756c31"
    }
  ]
}