{
  "modId": 33698.0,
  "modName": "Ghosts of Akavir",
  "summary": "Adds a ghostly new follower and an undead frost dragon to fight.",
  "descriptionHtml": "Long ago, the Blades were many in number. Though much of their tale is lost to time, one Blade in particular still haunts Skyrim\\'s northern coast at the site of her final kill, eternally locked in combat with the draconic lich Vedstrunah (\\\"Black Snow Hunter\\\"). As the Dragonborn of the new Blades, it\\'s your job to put Vedstrunah to rest, and you might just find a new ally to travel with along the way...\r\n\r\n-=-=-=-=-\r\n\r\nWHAT\\'S IN THIS VERSION:\r\n-An encounter with an undead frost dragon at Questant\\'s Rest, a new dragon lair just west of the Tower Stone, which features a ruined Word Wall and the skeletal remains of Vedstrunah and the ancient Blade, Virassa.\r\n-A unique dagger, the Fang of Vedstrunah.\r\n-Vedstrunah\\'s Contract, a summoning scroll used to conjure your own dracolich. One use; lasts 120 seconds.\r\n-The Ghost of Virassa, a long-dead member of the old Blades, who becomes available as a follower after Vedstrunah is put down. If dismissed, she will return to Questant\\'s Rest and can be re-recruited any time.\r\n-A note to the player about Virassa from Esbern, viewable in the Sky Haven Temple.\r\n\r\nTO BE ADDED IN FUTURE VERSIONS:\r\n-A proper Blades faction quest featuring Virassa. The note to the Dragonborn from Esbern in the Sky Haven Temple will trigger it when it is completed.\r\n\r\nKnown bugs:\r\n-Using the Dragonrend shout against Vedstrunah causes him to lose the ghost shader effects while still retaining a transparent model.\r\n-The follower version of Cicero -may- have a problem with bits of dialogue, as he was the template for Virassa\\'s dialogue. This should not impact Cicero\\'s greater role in the Dark Brotherhood questline or his AI -- just a handful of sound files like \\\"What do you want me to do?\\\" This will be fixed in the next version.\r\n\r\n-=-=-=-=-\r\n\r\nMy second submission to the Nexus! If you have the previous incarnation of this project, Undead Frost Dragon (http://skyrim.nexusmods.com/mods/14982), please uninstall it if you want this to run correctly. While not a follower with unique lines, Virassa -does- have a unique voicetype -- GhostFemaleEvenToned, which applies a ghostly echo effect to all of her dialogue with the player. I was extremely pleased to get this working properly.\r\n\r\nOTHER MODS REQUIRED:\r\n• ApachiiSkyHair - http://skyrim.nexusmods.com/mods/10168\r\n\r\nOTHER MODS RECOMMENDED FOR COSMETIC PURPOSES:\r\n• Cloaks of Skyrim - http://skyrim.nexusmods.com/mods/12092 - Virassa comes equipped with a unique cloak, the Mantle of the Lonely Spectre.\r\n• Coverwomen - http://skyrim.nexusmods.com/mods/3563 - Virassa\\'s face was created with Look #4.",
  "categoryId": "66",
  "version": "1.2",
  "author": "Oathwind",
  "createdUnix": "1363917173",
  "updatedUnix": "1363916365",
  "containsAdultContent": false,
  "uploadedBy": "oathwind",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000019291",
      "name": "Ghosts of Akavir",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3584",
      "fileName": "Ghosts of Akavir-33698-1-2.rar",
      "uploadedUnix": "1363916365",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/733c589993d62ad25669c87c95e5699cbe328d0a3e45b905499e9c0883603fd2/analysis/1407481878/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ghosts%20of%20Akavir-33698-1-2.rar?fid=1000019291&ttl=1535811031&ri=8192&rs=8192&setec=ee9e90278fbf1bd3c59af3865ccc5c86"
    }
  ]
}