{
  "modId": 33759.0,
  "modName": "Improved Artifact and Unique Weapons",
  "summary": "This allows artifact weapons such as The Mace of Molag Bal or Mehrune\\'s Razor to benefit from smithing perks when using a grindstone. This also gives weapons like The Ebony Blade the option to be improved and benefit from a perk. ",
  "descriptionHtml": "Intro\r\nI find the Daedric artifacts to be some of the most interesting unique weapons in the game. The design and effort put into some of these weapons by Bethesda is spectacular and much appreciated. However that hasn\\'t stopped these artistic relics of the past from gathering dust in my home. I simply can\\'t use them at higher levels anymore once they are outclassed due to their lack of of beneficial smithing perks. \r\n\r\nWhat Does This Mod Do?\r\nThis mod will alter Mace of Molag Bal, Dawnbreaker, Ebony Blade, Mehrune\\'s Razor, Volendrung and Spellbreaker (Yes, Spellbreaker would be considered armor rather than a weapon but whatever).\r\nThis allows all of the above to be improved to legendary status as with any other weapon. It will require you to have both the Daedric Smithing and the Arcane Blacksmith perks. In addition to to the original improvement materials, a Daedra Heart has been added to the required ingredients. This was done for balancing purposes. In the case of the Ebony Blade, it used to be impossible to improve at all. This has also been changed.   \r\nNOTE: I have not actually altered damage stats or enchantment magnitudes. They will not be overpowered at a Legendary level but they will be closer to being on par with regular weapons in terms of damage or defense in regards to Spellbreaker.\r\n\r\nFuture: I plan on applying this to other weapons that have no beneficial perk such as Wuuthrad. Please post any weapons you would like to see in future releases. Will be adding improvements to armors as well like the Ancient Shrouded armor in later releases as well or perhaps in a second mod. \r\n\r\n",
  "categoryId": "55",
  "version": "v.1",
  "author": "pookyrune",
  "createdUnix": "1364000019",
  "updatedUnix": "1363999373",
  "containsAdultContent": false,
  "uploadedBy": "pookyrune",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000019560",
      "name": "IAUW v1",
      "version": "v.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "IAUW v1-33759-v-1.rar",
      "uploadedUnix": "1363999373",
      "modVersion": "v.1",
      "virusScanUrl": "https://www.virustotal.com/file/09378d8d8e9d2a4f5d0977e960bab0cc11b86357f10bd75cc41276d8ba056faa/analysis/1407483663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/IAUW%20v1-33759-v-1.rar?fid=1000019560&ttl=1535811110&ri=8192&rs=8192&setec=9694f06182807e4c9bc2dc45728b2275"
    }
  ]
}