{
  "modId": 33781.0,
  "modName": "Soul Gems for Racial Powers",
  "summary": "Now you can use Racial Powers more than once a day. But everytime you use it after the first time, you will need a proper Soul Gem. For every time you use your racial before sleeping, you will need 1 hour of proper sleeping to recover from it.",
  "descriptionHtml": "[color=lime][b][center][size=8]Soul Gems for Racials[/size][/b][/color]\r\n[color=cyan][size=4]- Trying to make racial powers make more sense -[/size][/color][/center]\r\n\r\n[size=4][color=yellow][b]Overview:[/b][/color][/size]\r\nNow you can use Racial Powers more than once a day. But everytime you use it after the first time, you will need a proper Soul Gem. Also, you just need to rest for a while to recover your racial power - no need to wait 24 hours for that!\r\n\r\n--\r\nEx:\r\nThe first time you use it, it\\'s free.\r\nThe second time, you will need a filled Petty or stronger Soul Gem.\r\nThe third time, you will need a filled Lesser or stronger Soul Gem.\r\nThe fourth time, you will need a filled Common or stronger Soul Gem.\r\nThe fifth time, you will need a filled Greater or stronger Soul Gem.\r\nThe sixth time, you will need a filled Grand or Black Soul Gem.\r\nThe seventh time, you will need TWO filled Grand or Black Soul Gem.\r\nAnd on.\r\n--\r\n\r\nFor every time you use your racial before sleeping, you will need 1 hour of proper sleep to recover from it. Every hour slept counts to recover, even if you don\\'t sleep all the hours you needed to recover completely. Considering that, you can use racial powers a lot in a single day for free, as long as you sleep 1 hour between uses. But you can\\'t use it two times for free in 24 hours without sleeping.\r\n\r\n--\r\nEx:\r\nIf you used 5 times your racial in a day, you will need 5 hours of proper sleep to use it again without Soul Gems. But if you sleep only 3 hours, you will be able to use it with a filled Petty or stronger Soul Gem (recovered 3 from 5 hours you needed!).\r\n--\r\n\r\n[color=yellow][b]KNOWN ISSUES:[/b][/color]\r\nSoul Gems must be fully filled to be useable. So it is not possible to use a Grand Soul Gem (Petty). This seems to be an engine limitation, since I am unable to detect the soul level in the soul gem via scripts.\r\nOther than that, no issues!\r\n\r\n[color=yellow][b]INSTALLATION:[/b][/color]\r\nUse NMM or extract the files in your Data Folder.\r\n\r\n[color=yellow][b]UNINSTALLATION:[/b][/color]\r\nUse NMM or delete the mod from load order and Data Folder.\r\n\r\n[color=yellow][b]COMPATIBILITY:[/b][/color]\r\nDragonborn, Heartfire and Dawnguard 100% compatible. Also, completely compatible with other races mods (I just messed with the powers, not the races). \r\n\r\n[color=yellow][b]Can I interest you in some other mods I have?[/b][/color]\r\n[url=http://skyrim.nexusmods.com/mods/28329]Travel Mod[/url]: Ever asked why would you spend 1000 gold for a horse in Skyrim? Well, with this mod you will need a mount if you want to be able to fast travel! \r\n[url=http://skyrim.nexusmods.com/mods/28264]Weighted Arrows[/url]: makes arrows and crossbow bolts weigh.\r\n[url=http://skyrim.nexusmods.com/mods/33325]Potions Cooldown[/url]: Potions that restore health, magicka or stamina will have a cooldown of 5 or 10 seconds. During this time they will be 10% or 20% as effective as they are supposed to be.\r\n[url=http://skyrim.nexusmods.com/mods/33459]Lorecraft - Vanilla Blacksmithing Tutorial Fix[/url]: When the blacksmith asks you to craft a dagger (and later a hide helmet), you will get a book on how to do it. That simple.\r\n[url=http://skyrim.nexusmods.com/mods/27780]Diseased[/url]: a complete, rewarding, lore friendly disease system. Featured on G.E.M.S.",
  "categoryId": "93",
  "version": "1.00",
  "author": "Manaflow",
  "createdUnix": "1364018949",
  "updatedUnix": "1364018781",
  "containsAdultContent": false,
  "uploadedBy": "manaflow",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000019632",
      "name": "v100",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "v100-33781-1-00.rar",
      "uploadedUnix": "1364018781",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/7e525f982b4539a9ea00cc574ac0dc5fc80f0f6f3aeb60a5d64fb9e6a0c3d9c0/analysis/1407484117/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/v100-33781-1-00.rar?fid=1000019632&ttl=1535811147&ri=8192&rs=8192&setec=febded1e1d0b082ee565b34fdb20fb30"
    }
  ]
}