{
  "modId": 3381.0,
  "modName": "Useful Bat Files",
  "summary": "No, they\\'re not cheats! more to be added by request!",
  "descriptionHtml": "This is a couple of useful bat files for Skyrim that I use myself. There is currently a bunch of them, but if you want more, please request it in the comments section!\r\n\r\n=====List of bat files=====\r\n\r\n==0.3==\r\n>Fixed Marry Me and Follow me bats\r\n\r\n>Added Leave me alone  (Divorce... Press ~ and click and husband/wife and type in \\'bat leavemealone\\')\r\n\r\n>Next version will include some cool fights by request (GIANT CRABS INCLUDED)\r\n\r\n==v0.2==\r\n>Marry Me  (Adds an NPC to the marriage-faction, allowing players to marry this NPC. Press ~ and click on the future wife/husband then type in \\'bat marryme\\')\r\n\r\n>Follow Me  (Adds an NPC to the potentialfollower faction. However, whether or not they\\'ll follow you depends on their disposition towards you. Press ~ and click on you future follow and type in \\'bat followme\\')\r\n\r\n> Resurrection  (Killed someone you didn\\'t mean to? Target them once in the console menu and type \\'bat alive\\' and it will bring them back from the grave as they were before the fight started. They will just stand up alive, their items won\\'t respawn, so if you take all the gear, weapons off a character, then [bat alive] they will stand up naked. Useful for giving characters gear they wouldn\\'t have normally.)\r\n\r\n>Testing Hall  (This brings you to one of the developer\\'s testing cells, with all items and crafting interfaces in the game. Press ~ and type in \\'bat testinghall\\')\r\n\r\n>ScreenShot Mode  (Toggle flying cam, main menu, and ai. Useful for taking screenshots. Type in \\'bat screenshotmode\\')\r\n\r\n>Changing looks  (Ever wished you could change your looks again? well, here you go! DON\\'T CHANGE RACE, or SEX! Make sure you\\'re in 3rd person before you do this! Save before you do this! If you look like you have your hands tied in front of you after doing this, revert back to last save! Anyway, press ~ and type in \\'bat looks\\')\r\n\r\n>Strip Inventory  (Empties the inventory of someone, including equipped items. Press ~ and click on the victim and type in \\'bat strip\\')\r\n\r\n>Faster Exiting  (Exits the game. Faster. Press ~ and type in \\'bat quit\\')\r\n\r\n>Removing and Adding Anything  (With the console open, click on a corpse or item, piece of environment or really anything at all and type \\'bat remove\\' then press enter. This will make the selected thing disappear, good for cleaning up messes, dragon corpses that won\\'t disappear, and is sometimes amusing for removing big mountains and stuff. If you remove something by mistake because you selected the wrong thing, simply type \\'bat addback\\' before selecting anything else and it will reappear.)\r\n\r\n==v0.1==\r\n>Wench/Tavern Outfit   (Press ~ and click on whoever you want to wear that outfit, like your wife, and type in \\'bat wench\\')\r\n\r\n>Killcam  (Increases the odds of getting a cool cinematic kill move, press ~ and type in \\'bat killcam\\')\r\n\r\n>Forsworn Armor  (Want Lydia to look sexy? Before she takes an arrow to the knee, press ~ and click on her and type in \\'bat forsworn\\')\r\n\r\nRequest more in the comments!   (No Cheats!)\r\n\r\n\r\n=====Installation=====\r\nPlace all the .txt files in the skyrim directory, the one with skyrim.exe\r\n\r\n\r\n=====Extra=====\r\nCheck out my awesome shader mod: http://www.skyrimnexus.com/downloads/file.php?id=1752",
  "categoryId": "28",
  "version": "0.3",
  "author": "Parsa",
  "createdUnix": "1323634993",
  "updatedUnix": "1323676575",
  "containsAdultContent": false,
  "uploadedBy": "parsz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "9593",
      "name": "The Bat Files",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "The Bat Files-3381-0-3.rar",
      "uploadedUnix": "1323676575",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/a9d23051e7c34a7da83ab76cd4231fcd797d3c90b7f785296afbebc70c01a2a4/analysis/1406509863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Bat%20Files-3381-0-3.rar?fid=9593&ttl=1535758377&ri=8192&rs=8192&setec=019fefe1898f59adf93be13f36227932"
    }
  ]
}