{
  "modId": 33850.0,
  "modName": "Bards and Guards - An NPC expansion",
  "summary": "Bards and Guards was my attempt to fill a need in the game. In Bards and Guards you can hire 5 Guards and 5 Bards that are scattered throughout Skyrim. After hired you can place them anywhere, Bards sing on command and Guards, well, they Guard an the area you put them. Great for mod houses and to give some empty crash house a little more flavor.",
  "descriptionHtml": "Bards and Guards is a mod that makes it so you can hire, Bards and Guards. They will play or guard any place you put them, no muss no fuss.\r\n\r\nA great mod if you feel that a custom house is a little lonely, or you think your Hearthfire home could use a little protection from wandering creatures or NPCs.\r\n\r\nPlease let me know if you find any glitches or a Bard or Guard doesn\\'t seem to be responding or wanders back to where you found them. I\\'ve tried to test it well, but it\\'s always possible in a tweak I misplaced something or didn\\'t double check.\r\n\r\nAmenities:\r\nFully Voiced\r\nNPCs are fairly easy to find\r\nHelps you spend all that extra money your level 74 character has built up\r\nYou can put the NPCs ANYWHERE, including in Solstheim\r\nInteractive characters (many lines of conversation)\r\n\r\nLocations:\r\nWhiterun - One Guard, One Bard\r\nMarkarth - One Guard\r\nSolitude - One Bard\r\nRiften - One Bard\r\nWindhelm - One Bard, One Guard\r\nRiverwood - One Guard\r\nFalkreath - One Bard\r\nWinterhold - One Guard\r\n\r\nRequirements:\r\nJust Skyrim, though compatible with all the DLCs, the other DLCs are not required\r\n\r\nWishlist: (feel free to do it yourself if you have the know how, just let me know please, thanks)\r\nUnique songs for Khajit Bard (Was thinking Arabic instrumentals)\r\nExpansion on Bard Songs\r\nFixing some of the voice overs (willing to look at submissions)\r\nGifts are used by NPCs, they wear the dress you give them\r\n\r\nKnown Glitch:\r\nIf the bard is singing, let them finish before hiring them. If you hire them during the song I\\'ve noticed they get confused about following.\r\n\r\nNot really a glitch, but a characteristic, the Bards and Guards have hours where they do their main job, and are kind of free to wander when not on duty. Guards won\\'t wander as far as Bards, they have responsibilities and all. Basically, if one of the NPCs wanders off some night, don\\'t worry about it (unless you find them where you found them when you first met them), they\\'ll be back in the daytime hours, doing their jobs. The Bards are quite capable of defending themselves, have no worries.\r\n_______________________________________________________________________\r\n\r\nv1.01 update removed guard aggression when you first meet the guards in their respective inns/taverns. Also did a proper archiving. Shouldn\\'t have trusted Creation Kit to do it right, my bad. I\\'m just learning how to package my work. Work fine on my computer. : )\r\n_______________________________________________________________________\r\n\r\nSo I guess that\\'s it, if you have any questions, complaints or suggestions, let me know.\r\nFeel free to mod this mod to your hearts content, but credit would be nice, and please share with your fellow players, especially me. : )\r\n\r\nEdit: Since I just noticed almost all of my bard pics reference this mod, I thought I\\'d provide a link.\r\n\\\"Bard music replacement by Malukah\\\"\r\nhttp://skyrim.nexusmods.com/mods/2801",
  "categoryId": "33",
  "version": "v1.01",
  "author": "donAllister",
  "createdUnix": "1364139028",
  "updatedUnix": "1364480348",
  "containsAdultContent": false,
  "uploadedBy": "donAllister",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020733",
      "name": "Bards and Guards v101",
      "version": "v1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "61467",
      "fileName": "Bards and Guards v101-33850-v1-01.7z",
      "uploadedUnix": "1364480348",
      "modVersion": "v1.01",
      "virusScanUrl": "https://www.virustotal.com/file/855d9d75b7dc86a02e6740c66a6a2376615cf4cfc12d96a448c5743d0f8c1545/analysis/1407492447/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bards%20and%20Guards%20v101-33850-v1-01.7z?fid=1000020733&ttl=1535811231&ri=8192&rs=8192&setec=84fb002cf3110a53ac350d7b3b6a00f4"
    }
  ]
}