{
  "modId": 33860.0,
  "modName": "TTRSO - TheThirdRace Skill Overhaul - Modular",
  "summary": "TTRSO is a minimalistic and modular skill overhaul aimed at balancing the vanilla skills while maintaining the vanilla feel.\r<br />\r<br />Magic, Combat and Stealth skill trees have been balanced to offer meaningful choices with perks, spells and some mechanics.\r<br />\r<br />Best of all, it&#39;s modular so you can select all the modules or only use",
  "descriptionHtml": "[center][url=https://thethirdrace.com/games/skyrim/my-mods/ttrso.aspx][size=5]TheThirdRace.com[/size][/url][/center] [center][b][color=#c27ba0]Be sure to checkout my website for everything I&#39;m currently involved with[/color][/b][/center]\r<br />\r<br />[size=4][color=#ffcc33]Introduction[/color][/size]\r<br />TTR.S.O. is a [color=#cb99c9]minimalistic[/color] and [color=#cb99c9]modular[/color] skill overhaul aimed at balancing the vanilla skills while maintaining the vanilla feel. Magic, Combat and Stealth skill trees have been balanced to offer meaningful choices with perks, spells and some mechanics.\r<br />\r<br />If you feel the vanilla Skyrim was doing a &#34;good&#34; job but was just missing something, this mod is for you. Overall, the game is gonna be a bit harder since I&#39;ve fixed a lot of exploits, but it won&#39;t be overwhelming nor will prevent you from becoming a legend.\r<br />\r<br />Each skill tree has its own ESP file so you can activate only the ones you want. For a description of almost all the changes made by this mod, you can consult the image section or the [url=https://sites.google.com/site/ttrcreations/skyrim/ttr-skill-overhaul][color=#7dc7ea]HTML version of this page[/color][/url]. [color=#cb99c9]Highlighted[/color] parts show what changed from vanilla Skyrim. Notes are always new changes so I didn&#39;t highlighted them to avoid color oversaturation. Perks not present anymore in the skill trees have been modified to reflect the perks they have been replaced with. This will allow NPCs to benefit from those perks the same way you do yours.\r<br />\r<br />\r<br />[size=4][color=#ffcc33]Main features[/color][/size]\r<br />[list]\r<br />[*][color=#ffcc33]General[/color]: Minimalistic approach, stay true to vanilla Skyrim as much as possible\r<br />[*][color=#ffcc33]General[/color]: Balanced approach that offers more playstyles, overpowered skills were brought back in line while underpowered ones were buffed\r<br />[*][color=#ffcc33]General[/color]: The [color=#3399ff]Magic[/color], [color=#ee0033]Combat[/color] and [color=#339966]Stealth[/color] skill trees now have 100 perks each\r<br />[*][color=#ffcc33]General[/color]: Main perks of most skill tree scale according to your skills, no more flat 20% boost\r<br />[*][color=#ffcc33]General[/color]: Each type of armor (heavy, light and unarmored) have their own bonuses and drawbacks\r<br />[*][color=#ffcc33]General[/color]: Shouts can play a more important role but you have to invest yourself for that power\r<br />[*][color=#ffcc33]General[/color]: Unarmed damage has been given a boost\r<br />[*][color=#ffcc33]General[/color]: [color=#cb99c9]All the custom items/spells added by this mod are sold by a new merchant in The Frozen Heart inn (Winterhold)[/color]\r<br />[*][color=#ffcc33]General[/color]: Reset a perk tree whenever you want\r<br />[*][color=#3399ff]Magic[/color]: Main perks from the magic schools now boost magnitude or duration\r<br />[*][color=#3399ff]Magic[/color]: The master perk of each magic school now also affect dual casting (uniform 2.5x multiplier for cost, duration and magnitude)\r<br />[*][color=#3399ff]Magic[/color]: It&#39;s not possible anymore to cast magic for free\r<br />[*][color=#3399ff]Magic - Alteration[/color]: Equilibrium is now a &#34;state&#34; where your magicka is your health (akin to blood mages)\r<br />[*][color=#3399ff]Magic - Alteration[/color]: Mage Armor spells now give less protection, but you keep your full magicka and stamina regeneration rates intact\r<br />[*][color=#3399ff]Magic - Conjuration[/color]: Bound weapons have new abilities to make them as powerful as physical weapons\r<br />[*][color=#3399ff]Magic - Conjuration[/color]: Reanimated bodies and conjured atronach will be more usefull to those dedicated to the art\r<br />[*][color=#3399ff]Magic - Destruction[/color]: Most perks now have a chance to trigger instead of always doing so, making Destruction fun and not boring\r<br />[*][color=#3399ff]Magic - Enchanting[/color]: Staves are now worth using if you&#39;re willing to invest some perks\r<br />[*][color=#3399ff]Magic - Illusion[/color]: Build you character around Illusion and be a force to be reckoned with even past level 50\r<br />[*][color=#3399ff]Magic - Restoration[/color]: Wards are now useful against any style of combat\r<br />[*][color=#ee0033]Combat - Archery[/color]: Bows are now even deadlier than before, especially to the unsuspecting target\r<br />[*][color=#ee0033]Combat - Block[/color]: Blocking is a bit less effective, but offers a bit more offensive\r<br />[*][color=#ee0033]Combat - Heavy Armor[/color]: Most perks work as long as you wear at least 3 pieces of Heavy Armor\r<br />[*][color=#ee0033]Combat - Heavy Armor[/color]: Gives the maximum protection, but comes at the cost of lower magicka and stamina regeneration rates\r<br />[*][color=#ee0033]Combat - One-Handed[/color]: Perks have been streamlined by regrouping weapon types\r<br />[*][color=#ee0033]Combat - Smithing[/color]: The reorganized tree offers you more choices about which perks you want to invest in\r<br />[*][color=#ee0033]Combat - Smithing[/color]: &#34;Infusion&#34; perks allow you to craft equipment just as strong as Daedric and Dragon\r<br />[*][color=#ee0033]Combat - Two-Handed[/color]: Perks have been streamlined by regrouping weapon types\r<br />[*][color=#339966]Stealth - Alchemy[/color]: Reworked to match or surpass the power of existing potions and poisons while keeping balance\r<br />[*][color=#339966]Stealth - Light Armor[/color]: Most perks work as long as you wear at least 3 pieces of Light Armor\r<br />[*][color=#339966]Stealth - Light Armor[/color]: Give you less protection than Heavy Armor but the lower magicka and stamina regeneration rates are not as bad either\r<br />[*][color=#339966]Stealth - Lockpicking[/color]: Those not dedicated enough will have a really hard time picking locks\r<br />[*][color=#339966]Stealth - Pickpocket[/color]: Those not dedicated enough will have a much harder time in their endevour\r<br />[*][color=#339966]Stealth - Sneak[/color]: Detection has been improved, light has a greater effect and NPCs will search for you longer\r<br />[*][color=#339966]Stealth - Sneak[/color]: Sneak attack with two-handed weapons\r<br />[*][color=#339966]Stealth - Speech[/color]: Shouts have perks to give longer duration, greater magnitude and lower cooldown\r<br />[*][color=#339966]Stealth - Speech[/color]: Bartering is now more dependant on your speech skills\r<br />[/list]\r<br />\r<br />[size=4][color=#ffcc33]Installation and Requirements[/color][/size]\r<br />[color=#ffcc33]-- Requirements --[/color]\r<br />[list]\r<br />[*]Latest version of Skyrim\r<br />[*]([color=#cb99c9]optional[/color]) Dawnguard\r<br />[*]([color=#cb99c9]optional[/color]) Dragonborn\r<br />[*]([color=#cb99c9]optional[/color]) Heartfire\r<br />[/list]\r<br />[color=#ffcc33]-- Install (auto) --[/color]\r<br />For an automatic install without risk of errors, I suggest you use the [url=http://skyrim.nexusmods.com/mods/modmanager/][color=#7dc7ea]NexusModManager[/color][/url]. Simply select the DLC you use, if any, click &#34;Next&#34; and select the skill trees you want to install.\r<br />\r<br />[color=#ffcc33]-- Install (manual) --[/color]\r<br />For a manual install, extract the files from this mod and copy them to the appropriate folders. The important thing to remember is that each ESP is complete by itself, meaning you only need 1 ESP perk skill.\r<br />\r<br />[color=#cb99c9]If you don&#39;t have any DLC[/color], you should remove all files with suffixes (_DB, _DBDG, _DBDGHF, _DBHF, _DG, _DGHF, _HF).\r<br />\r<br />[color=#cb99c9]If you use one or more DLCs[/color], it&#39;s a bit more complicated as you need to keep the ones that &#34;applies&#34; to your situation. Each DLC has a suffix associated with it (DG:Dawnguard, DB:Dragonborn, HF:Heartfires) and you need to eliminate the ESPs you can&#39;t use by keeping the only file that match the right suffixes. For any combination of DLCs, there is only 1 ESP possible. If a skill doesn&#39;t have any ESP with the suffix for your DLC, that means the DLC has no impact on it and thus don&#39;t need to be part of the suffix for that skill.\r<br />\r<br />When all is said and done, I suggest you remove the suffixes from the ESPs you install, meaning that &#34;TTR_Skill_Overhaul_Sneak_DB.esp&#34; would become &#34;TTR_Skill_Overhaul_Sneak.esp&#34;. This will ensure a smoother upgrade to newer versions.\r<br />\r<br />[color=#ffcc33]-- Built-in install/reset/uninstall quest --[/color]\r<br />There&#39;s a built-in quest to manage installation, reset and uninstallation of each module (ESP and ESM).\r<br />\r<br />The first time you load your game, the install phase will automatically start after 5 seconds. Then, the reset phase will begin and each skill tree will be reset, giving you back all your perk points.\r<br />\r<br />This will happen only once and it&#39;s necessary to have all the right settings. If a new version need some initializations, it will automatically reset only the required skill trees when you load your game the first time after an update.\r<br />\r<br />If you want to manually reset a module to get back your perk points, open the console and type [color=#cb99c9][code]SetStage TTR_Reset_Module 50[/code][/color]. Simply replace &#34;Module&#34; with the module you want to reset (Alteration, Archery, etc.). This can be done as many time as you want and you can find all the required commands in the TTR_Reset_Module.txt file included in this mod.\r<br />\r<br />As a precaution while a module installs/resets itself, [color=#cb99c9]it would be wise to wait until the messages stops[/color] before doing anything.\r<br />\r<br />The uninstall quest will be detailed further down.\r<br />\r<br />[color=#ffcc33]-- The problem with Legendary skills and Dragonborn&#39;s &#34;reset perks&#34; option --[/color]\r<br />Unfortunately, legendary skills and Dragonborn&#39;s &#34;reset perks&#34; option don&#39;t reset everything correctly, even for the vanilla perks. You get back all your perk points, but some things aren&#39;t reset like your higher chance to find special treasure with Treasure Hunter. This means that after picking Tresure Hunter and use any of those 2 options to get back your perk points, you don&#39;t have to invest in this perk again to benefit from it... That&#39;s one of the reason why I included a built-in reset quest. Unfortunately, I couldn&#39;t reset everything either, but I take care of much more things than those 2 options do on their own.\r<br />\r<br />To force a clean reset after using legendary skills or Dragonborn&#39;s &#34;reset perks&#34;, simply save and reload your game. The reset quest will automatically start after 5 seconds, even if you used quick save/load functionality. If you don&#39;t want to save/reload, simply launch the reset manually with the console.\r<br />\r<br />[color=#ffcc33]-- Uninstall --[/color]\r<br />To remove all traces of this mod from your save game (even the scripts), load your game and open the console. The command to launch the built-in uninstall quest is the same as with the reset quest, but you will use a stage of 100 instead of 50 ([color=#cb99c9][code]SetStage TTR_Reset_Module 100[/code][/color]).\r<br />\r<br />[color=#cb99c9]Do not forget to uninstall the ESM module, it&#39;s very important[/color].\r<br />\r<br />When you&#39;re done, [color=#cb99c9]save your game in a new slot, quick saves won&#39;t work[/color].\r<br />\r<br />Finally, close your game and use the uninstall function of the NexusModManager or manually delete all the files of this mod. Be sure you&#39;re not in The Frozen Heart inn (Winterhold) when doing so because there&#39;s a custom merchant there.\r<br />\r<br />If you change your mind after uninstalling my mod, you can re-install it following the &#34;install&#34; section and then launching the built-in install quest. While the reset quest used stage 50 and the uninstall quest used stage 100, the install quest use stage 0 ([color=#cb99c9][code]SetStage TTR_Reset_Module 0[/code][/color]). Quite simple isn&#39;t it?\r<br />\r<br />If for any reason you have a problem after uninstalling this mod, try to install the ESM module only and this should solve the problem. I&#39;m pretty confident this won&#39;t be necessary.\r<br />\r<br />\r<br />[size=4][color=#ffcc33]Compatibility[/color][/size]\r<br />[list]\r<br />[*]Obviously, this mod will conflict with other perk mods. Fortunately, this mod is modular so you can decide which modules you want\r<br />[*]Ace - Combat Skills: There&#39;s a weapon speed fix included in the &#34;Melee&#34; module that will conflict with my mod. To disable ACE&#39;s weapon speed fix, simply open the console and type &#34;[color=#cb99c9][code]set WeaponSpeedBaseFix to 0[/code][/color]&#34;\r<br />[/list]\r<br />\r<br />[size=4][color=#ffcc33]Future plans[/color][/size]\r<br />[list]\r<br />[*]A final content update to balance and ameliorate a few things\r<br />[*]Release a new all-in-one file (will probably be released as a new mod with this one as a base)\r<br />[/list]\r<br />\r<br />[size=4][color=#ffcc33]Credits[/color][/size]\r<br />I would like to thank all the mod authors out there for their work, they have inspired me countless times. I would extend a special thanks to:\r<br />\r<br />[list]\r<br />[*][color=#cb99c9]Aertyr[/color] for the ideas for the Ethereal Binding, Soul Stealer and Ward Deflection perks, also for the ideas for various spells for bound weapons and for healing spells damaging undeads([url=http://skyrim.nexusmods.com/mods/13643][color=#7dc7ea]Bound Weapon Redux[/color][/url], [url=http://skyrim.nexusmods.com/mods/14013][color=#7dc7ea]Alteration and Restoration Redux[/color][/url])\r<br />[*][color=#cb99c9]Allzero[/color] for the tutorial on toggle-able spells which I used for the Equilibrium &#34;state&#34; ([url=http://skyrim.nexusmods.com/mods/21852][color=#7dc7ea]Toggle-able Spells tutorial[/color][/url])\r<br />[*][color=#cb99c9]Ayrton Massey[/color] for the idea behind the Ward Bash perk ([url=http://skyrim.nexusmods.com/mods/10828][color=#7dc7ea]Improved Wards[/color][/url])\r<br />[*][color=#cb99c9]DamarStiehl[/color] for the idea about the Smithing perk tree layout ([url=http://skyrim.nexusmods.com/mods/13384][color=#7dc7ea]Smithing Rebalanced[/color][/url])\r<br />[*][color=#cb99c9]Eldiran[/color] for the idea for the Marauder perk ([url=http://skyrim.nexusmods.com/mods/6593][color=#7dc7ea]Better Lockpicking Perks[/color][/url])\r<br />[*][color=#cb99c9]Gosgosgosu[/color] for the idea for the Ethereal Binding perk and the idea about ignoring some percentage of enemies&#39; armor([url=http://skyrim.nexusmods.com/mods/10892][color=#7dc7ea]Enchanted Bound Weapons[/color][/url])\r<br />[*][color=#cb99c9]Headbomb[/color] for the great classification for smithing materials ([url=http://skyrim.nexusmods.com/mods/6047][color=#7dc7ea]Smithing Perks Overhaul[/color][/url])\r<br />[*][color=#cb99c9]Kryptopyr[/color] for the ideas for detection while sneaking (muffle, light and NPC awareness), for the harder lockpicking settings and for the Nimble Fingers, Sleight Of Hand and Wax Key perks ([url=http://skyrim.nexusmods.com/mods/28418][color=#7dc7ea]Stealth Skills Rebalanced - Sneak - Lockpicking - Pickpocket[/color][/url])\r<br />[*][color=#cb99c9]Jeclxohko[/color] for the ideas of giving buffs when holding a staff ([url=http://skyrim.nexusmods.com/mods/33564][color=#7dc7ea]Staffbuffs[/color][/url])\r<br />[*][color=#cb99c9]Jjiinx[/color] for the idea behind Echanter Focus perk ([url=http://skyrim.nexusmods.com/mods/12862][color=#7dc7ea]Syynxs Perky - The Major Perk Overhaul[/color][/url])\r<br />[*][color=#cb99c9]Jonwd7[/color] for the scripts to correct the &#34;brawl bug&#34; ([url=http://skyrim.nexusmods.com/mods/24020][color=#7dc7ea]Brawl Bugs Patch - Plugins - Modder Resource[/color][/url])\r<br />[*][color=#cb99c9]LazyLionus[/color] for the ideas on how to make the Lockpicking main perks actually useful ([url=http://skyrim.nexusmods.com/mods/10619][color=#7dc7ea]Fluffkins Immersive Lock Picking Mod[/color][/url])\r<br />[*][color=#cb99c9]Leasm[/color] for the ideas behind Dream Feeder and Nightmare perks ([url=http://skyrim.nexusmods.com/mods/11139][color=#7dc7ea]Empowered Magic[/color][/url])\r<br />[*][color=#cb99c9]Magickman12[/color] for the ideas for the Chameleon, Deathblow and Stability perks ([url=http://skyrim.nexusmods.com/mods/21512][color=#7dc7ea]SKYrim Perk Extravaganza[/color][/url])\r<br />[*][color=#cb99c9]Niux[/color] for the idea of making bartering more dependent on speech skills ([url=http://skyrim.nexusmods.com/mods/21495][color=#7dc7ea]Better Bartering[/color][/url])\r<br />[*][color=#cb99c9]Renketsu0[/color] for the complementary tutorial ([url=http://www.creationkit.com/Dynamically_Attaching_Scripts][color=#7dc7ea]to the creation kit site[/color][/url]) on weapon speed mult ([url=http://skyrim.nexusmods.com/mods/28456][color=#7dc7ea]Attack Speed Mod[/color][/url])\r<br />[*][color=#cb99c9]Seorin[/color] for the idea for the Defensive Stance, First Draw, Heart Seeker, Purse Snatcher and Swift Strike perks ([url=http://skyrim.nexusmods.com/mods/24445][color=#7dc7ea]SPERG - Skyrim Perk Enhancements and Rebalanced Gameplay[/color][/url])\r<br />[*][color=#cb99c9]Sushisquid[/color] for the ideas for the Intense Flames, Deep Freeze and Disintegrate perks ([url=http://skyrim.nexusmods.com/mods/4374][color=#7dc7ea]Better Magic[/color][/url])\r<br />[*][color=#cb99c9]T3nd0[/color] for the ideas for the False Peace, Grave Bound, Terror, Weaver&#39;s Link and Zealot&#39;s Fury perks ([url=http://skyrim.nexusmods.com/mods/9286][color=#7dc7ea]T3nd0s Skyrim Redone[/color][/url])\r<br />[/list]\r<br />\r<br />[size=4][color=#ffcc33]My other mods[/color][/size]\r<br />\r<br />[list]\r<br />[*][url=https://sites.google.com/site/ttrcreations/skyrim/ttr-skill-overhaul][color=#7dc7ea]HTML version of this page with a description of all the changes[/color][/url] (You can also find the HTML version of my other mod pages)\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/50460/][color=#7dc7ea]Master Trader[/color][/url] (Merchants never run out of gold)\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/35567/][color=#7dc7ea]Mod Publishing Tutorial[/color][/url] (Everything you need to know to publish your mod and make your mod page right)\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/51256/][color=#7dc7ea]Oghma Infinium - A Training Station[/color][/url] (Just like training with a trainer, but without all the non-sense)\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/51972/][color=#7dc7ea]Ziil Los Dii Du[/color][/url] (Taste the power of Miraak. Consume a Dragon soul to get temporary and permanent bonuses)\r<br />[/list]",
  "categoryId": "79",
  "version": "1.6.1",
  "author": "TheThirdRace",
  "createdUnix": "1364562526",
  "updatedUnix": "1403981621",
  "containsAdultContent": false,
  "uploadedBy": "TheThirdRace",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036447",
      "name": "TTR_Skill_Overhaul",
      "version": "1.6.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "172",
      "fileName": "TTR_Skill_Overhaul-33860-1-6-0.7z",
      "uploadedUnix": "1372535442",
      "modVersion": "1.6.0",
      "virusScanUrl": "https://www.virustotal.com/file/05e5ec1510af19b2aa0b72dea93a9c1d2a95756ffa7a61e0decc95cb41304cf5/analysis/1407622267/",
      "changelogHtml": " [General]\r<br />- Include all the conflicting fixes from the Unofficial Dragonborn Patch\r<br />- Support all the new stuff added by Dragonborn\r<br />- Resetting your perks with the new Dragonborn functionality works the same way as Legendary Skills\r<br />\r<br />[Alchemy]\r<br />- Modified all the new Dragonborn ingredients to be balanced with this mod\r<br />\r<br />[Conjuration]\r<br />- Adjusted Bound Dagger (Dragonborn&#39;s version) to behave correctly with all the corresponding perks\r<br />- Removed the absorb/reflect possibility of new summons\r<br />\r<br />[Destruction]\r<br />- Adjusted Freeze to behave correctly with all the corresponding perks\r<br />- Adjusted Ignite to behave correctly with all the corresponding perks\r<br />- Whirlwind Cloak now has the same conditions as the other cloaks to be considered active\r<br />\r<br />[Heavy Armor]\r<br />- Matching Set now supports the Bonemold, Chitin (heavy), Nordic Carved and Stalhrim (heavy) sets\r<br />\r<br />[Light Armor]\r<br />- Matching Set now supports the Chitin (light), Morag Tong and Stalhrim (light) sets\r<br />\r<br />[Smithing]\r<br />- Adjusted keywords on some equipment to stay consistent with the Smithing skill tree\r<br />- Advanced Smithing now supports Nordic Carved equipment\r<br />- Basic Smithing now supports Bonemold equipment\r<br />- Daedric Infusion unlocks Improved Bonemold, Chitin (heavy), Nordic Carved and Stalhrim (heavy) infused equipment\r<br />- Dragon Infusion unlocks Chitin (light) and Stalhrim (light) infused equipment\r<br />- Ebony Smithing now supports Stalhrim equipment\r<br />- Elven Smithing now supports Chitin and Morag Tong equipment\r<br />- Master Blacksmith now supports all the new equipment materials\r<br />\r<br />[Speech]\r<br />- Adjusted all the new Dragonborn shouts to be balanced with this mod\r<br />- Removed Brothers And Sisters perk so Stealth category has 100 perks instead of 101 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TTR_Skill_Overhaul-33860-1-6-0.7z?fid=1000036447&ttl=1535811241&ri=8192&rs=8192&setec=78bc9ce8fcb59be0ebbbf86dbeafb928"
    },
    {
      "fileId": "1000095464",
      "name": "Excel files used for developing this mod",
      "version": "1.6.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "87",
      "fileName": "Excel files used for developing this mod-33860-1-6-0.7z",
      "uploadedUnix": "1391636484",
      "modVersion": "1.6.0",
      "virusScanUrl": "https://www.virustotal.com/file/3b00bde5f957c800af4b5534372c96d313e832055fe8b7986865354fd6b46fd4/analysis/1407919813/",
      "changelogHtml": " [General]\r<br />- Include all the conflicting fixes from the Unofficial Dragonborn Patch\r<br />- Support all the new stuff added by Dragonborn\r<br />- Resetting your perks with the new Dragonborn functionality works the same way as Legendary Skills\r<br />\r<br />[Alchemy]\r<br />- Modified all the new Dragonborn ingredients to be balanced with this mod\r<br />\r<br />[Conjuration]\r<br />- Adjusted Bound Dagger (Dragonborn&#39;s version) to behave correctly with all the corresponding perks\r<br />- Removed the absorb/reflect possibility of new summons\r<br />\r<br />[Destruction]\r<br />- Adjusted Freeze to behave correctly with all the corresponding perks\r<br />- Adjusted Ignite to behave correctly with all the corresponding perks\r<br />- Whirlwind Cloak now has the same conditions as the other cloaks to be considered active\r<br />\r<br />[Heavy Armor]\r<br />- Matching Set now supports the Bonemold, Chitin (heavy), Nordic Carved and Stalhrim (heavy) sets\r<br />\r<br />[Light Armor]\r<br />- Matching Set now supports the Chitin (light), Morag Tong and Stalhrim (light) sets\r<br />\r<br />[Smithing]\r<br />- Adjusted keywords on some equipment to stay consistent with the Smithing skill tree\r<br />- Advanced Smithing now supports Nordic Carved equipment\r<br />- Basic Smithing now supports Bonemold equipment\r<br />- Daedric Infusion unlocks Improved Bonemold, Chitin (heavy), Nordic Carved and Stalhrim (heavy) infused equipment\r<br />- Dragon Infusion unlocks Chitin (light) and Stalhrim (light) infused equipment\r<br />- Ebony Smithing now supports Stalhrim equipment\r<br />- Elven Smithing now supports Chitin and Morag Tong equipment\r<br />- Master Blacksmith now supports all the new equipment materials\r<br />\r<br />[Speech]\r<br />- Adjusted all the new Dragonborn shouts to be balanced with this mod\r<br />- Removed Brothers And Sisters perk so Stealth category has 100 perks instead of 101 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Excel%20files%20used%20for%20developing%20this%20mod-33860-1-6-0.7z?fid=1000095464&ttl=1535811241&ri=8192&rs=8192&setec=30d9986cfd5a6f9552c866bcedba4531"
    },
    {
      "fileId": "1000114968",
      "name": "TTR_Skill_Overhaul",
      "version": "1.6.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "172",
      "fileName": "TTR_Skill_Overhaul-33860-1-6-1.7z",
      "uploadedUnix": "1403981621",
      "modVersion": "1.6.1",
      "virusScanUrl": "https://www.virustotal.com/file/73aff62a8fb6d90763c24740b856033f937930aaf872bd8f844dc8603b4e44e4/analysis/1408151833/",
      "changelogHtml": " [Alteration]\r<br />- Equilibrium state will now update twice a second instead of every second\r<br />- Equilibrium state will now reduce health correctly when items gives you more magicka\r<br />\r<br />[Enchanting]\r<br />- Extra Effect perk now requires level 75 instead of 80\r<br />- Reduced the cost of Banish. It still sells for the highest amount of gold, but now much closer to Paralyse <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TTR_Skill_Overhaul-33860-1-6-1.7z?fid=1000114968&ttl=1535811242&ri=8192&rs=8192&setec=e24422775a1bd07e4c00553cd40ee0a1"
    }
  ]
}