{
  "modId": 33882.0,
  "modName": "Manie The Manikin-Headed Kahjiit Follower",
  "summary": "",
  "descriptionHtml": "You can find tough old Manie in the middle of Riften on one of the benches usually. As you can see poor Manie has a bit of a... condition. Many years ago a Kahjiit mercenary was hired to find and kill a poor manikin woman from the tribal nation of Manikikiwiki. But when he laid eyes upon her, he fell in love with the Manikikiwiki woman and knew he could not kill her. The tribe eventually let him become one of their own. They eventually fell in love and got married. A few months later, she became impregnated with his offspring. During the end of the pregnency though, the men who hired the mercenary came to find him and kill him for not killing the manikikiwiki woman and returning with the tools and moeny they gave him to execute her. Sadly they succeeded and the man was no more. The woman fled and Manie entered our world a few days later. She died many years later after Manie grew up. Training himself to get revenge on the men who killed his father was hard work because many would make fun of him for his mixed look and would not train him because they thought he would never amount to anything. He eventually got strong and exacted revenge upon the men who killed his father. Now Manie has settled down in riften, choosing to sleep on a bench so others may enjoy warm bed and housing. He also does volunteer mercenary work, just like his father. That my friends, is the story of Manie, the half Kahjiit half Manikin. \r\n\r\nThis mod is for pure comical purposes. Just subscribe and Manie will be waiting your order in the middle of Riften on one of the benches in the area. Hope you enjoy!",
  "categoryId": "66",
  "version": "v1.0",
  "author": "SPARTAN NICK004",
  "createdUnix": "1364227794",
  "updatedUnix": "1364179018",
  "containsAdultContent": false,
  "uploadedBy": "nick004",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020079",
      "name": "Manie The Manikin-Headed Kahjiit Follower",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Manie The Manikin-Headed Kahjiit Follower-33882-v1-0.rar",
      "uploadedUnix": "1364179018",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6c3fab01990abc3d71bfacb62a914de3154a2661f4b510f80cc4cf64e4225844/analysis/1407487391/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Manie%20The%20Manikin-Headed%20Kahjiit%20Follower-33882-v1-0.rar?fid=1000020079&ttl=1535811281&ri=8192&rs=8192&setec=8f7789378b08ae5df8245350f6909293"
    }
  ]
}