{
  "modId": 33903.0,
  "modName": "SPERG - Skyrim Perk Enhancements - German - Deutsch",
  "summary": "Dies ist die Uebersetzung von\r<br />SPERG - Skyrim Perk Enhancements and Rebalanced Gameplay von seorin\r<br />[url=http://www.skyrim.nexusmods.com/mods/24445]Hier geht es zur Original-Modifikation, gebt seorin bitte ein Endorsement&#33;[/url]\r<br />",
  "descriptionHtml": "[b][color=yellow]Gute Nachricht: Version 4 ist fertig.[/b][/color]\r<br />\r<br />Die Veränderungen zur Version 3.X lest bitte zunächst auf der Seite der Original-Mod nach. Ich werde an dieser Stelle die wesentlichen Änderungen noch nachliefern. Vorausgeschickt sei, dass nun alle Perks überarbeitet sind und es die eine oder andere Überraschung gibt :-).\r<br />\r<br />Der MCM dieser Mod ist auf der Oberfläche selbst Deutsch, die Hilfetexte sind noch auf Englisch. Hier wird es ggfs noch ein Update geben.\r<br />\r<br />[b][color=yellow]NEU in Version 3.1.1.1 der deutschen Übersetzung:[/b][/color]\r<br />\r<br />In der Version 3.1.1.1 gibt es außer einem kleinem Bugfix der Version 3.1.1 keine Änderungen in den Funktionen und Features. Die deutsche Übersetzung ist allerdings nochmal deutlich angepasst worden, um die Verständlichkeit und Nachvollziehbarkeit der automatischen Talent-Vergabe im Spiel besser nachvollziehen und planen zu können. [b]Deshalb empfehle ich die Installation der Version 3.1.1.1 dringend[/b].\r<br />\r<br />\r<br />[color=#add8e6][b]-Kennzeichnung der automatisch vergebenen Talente[/b][/color]\r<br />\r<br />In allen Talentbäumen sind die Talente, die bei einem Stufenaufstieg automatisch vergeben werden, mit einem (Auto) oder (Auto/Stufe) gekennzeichnet. Dies sollte die Planung der Vergabe der Talentpunkte erleichtern. An dieser Stelle sei in diesem Zusammenhang nochmal auf die Bedeutung der Farbe der Sterne in den Sternenbildern hingewiesen:\r<br />\r<br />[list]\r<br />[*]Weiß = Ist vergeben\r<br />[*]Blau = Kann aktiviert werden, wenn Talentpunkt(e) vorhanden\r<br />[*]Pink = Voraussetzung noch nicht erreicht\r<br />[/list]\r<br />\r<br />[color=#add8e6][b]-Stufenbezeichnungen durchgehend angepasst[/b][/color]\r<br />\r<br />Innerhalb des SPERG-Talentbaumes sind die Stufen der Erfahrung durchgehend wie folgt benannt:\r<br />\r<br />[list]\r<br />[*]Neuling (Novize)\r<br />[*]Lehrling (Apprentice)\r<br />[*]Geselle (Adept)\r<br />[*]Experte (Expert)\r<br />[*]Meister (Master)\r<br />[/list]\r<br />\r<br />[color=#add8e6][b]-Bezeichnungen der Talentbäume und Talente angepasst[/b][/color]\r<br />\r<br />Der Talentbaum &#34;Wiederherstellung&#34; heißt nun &#34;Heilung&#34;. Es wurden viele Talente in der Bezeichnung  verändert oder verkürzt, um die oben beschriebene Kennzeichnung mit (Auto) oder (Auto/Stufe) im Rahmen der zulässigen Anzahl von Buchstaben zu ermöglichen.\r<br />\r<br />\r<br />[color=#add8e6][b]-Der Community-Uncapper[/b][/color]\r<br />\r<br />[color=yellow]Ohne den Einsatz des Community-Uncappers werden die Helden ungewollt stark. Deshalb wird die Installation des CU (vor der Installation dieser Mod&#33;) dringend empfohlen. Ab der Version 3.1.1.1 ist nur noch die INI-Datei des CU im Paket enthalten. Diese ist so angepasst, dass nach dem SKSE-Start von Skyrim der Splashscreen des CU für 2 Sekunden angezeigt wird. Dies soll helfen eindeutig festzustellen, dass der CU installiert und aktiv ist. Der Splashscreen oder die Anzeigezeit kann in der INI im Verzeichnis &#34;SKSEPlugins&#34; im Installationspfad von Skyrim angepasst werden.[/color]\r<br />\r<br />[heading]Über diese Modifikation[/heading]\r<br />Dies ist die Übersetzung von SPERG - Skyrim Perk Enhancements and Rebalanced Gameplay von seorin\r<br />[url=http://www.skyrim.nexusmods.com/mods/24445]Hier geht es zur Original-Modifikation, gebt seorin bitte ein Endorsement&#33;[/url]\r<br />\r<br />[b][color=yellow]Der originale Mod ist nicht erforderlich.[/b][/color]\r<br />\r<br />Das originale Talent-System enthält viele gute Fähigkeiten, die aber teilweise langweilig sind und interessante Talente, die wenig Auswirkungen haben. SPERG nimmt sich diesem Problem an, indem notwendige aber eher langweilige Talente automatisch vergeben werden. Damit nähert SPERG Skyrim dem System von Oblivion und Morrowind an. Die weiteren Talente wurden verbessert und ausgebaut, auch neue wurden hinzugefügt. Dabei können Talente aus einem Talentbaum auch Auswirkungen auf andere Bäume haben, die zusammen eine noch spannendere Zusammenwirkung erzeugen. Mit SPERG gibt es noch mehr Anlass, sich auf einen neuen Level zu freuen&#33;\r<br />\r<br />[b][color=red]VOR DER INSTALLATION:[/b] \r<br />\r<br />Diese Modifikation benötigt [url=http://skse.silverlock.org]SKSE[/url], [url=http://skyrim.nexusmods.com/mods/3863]SkyUI[/url], und den [url=http://skyrim.nexusmods.com/mods/1175]Skyrim -Community- Uncapper[/url]. \r<br />\r<br />SKSE ermöglicht das Zurücksetzen der Talente (und weitere Funktionen), SkyUI aktiviert das Konfigurationsmenü der MCM, und der Uncapper beschränkt die Punktevergabe für neue Talente auf einen Punkt alle zwei Level. Dies verhindert, dass Dein Charakter zu schnell zu stark wird, was mit den SPERG-Talentbäumen schnell passieren könnte. Es kann auch ohne diese Erweiterungen gespielt werden, allerdings ist es dann nicht möglich, die Talente zurückzusetzen, die umfangreichen Möglichkeiten zur Konfiguration gehen verloren und Dein Charakter wird unangebracht stark werden.[/color]\r<br />\r<br />[color=yellow]Wenn ihr meine Übersetzung gut gelungen findet, dann gebt mir bitte gerne ein Endorsement. In jedem Fall sollte der Ersteller für das fantastische [url=http://www.skyrim.nexusmods.com/mods/24445]Original[/url] ein Endorsement bekommen. Vielen Dank&#33;\r<br />\r<br />Ich freue mich auch über jeden konstruktiven Hinweis zu Übersetzungsfehlern und Inkonsistenzen. Nutzt dazu bitte gerne den Kommentarthread.[/color]\r<br />\r<br />[heading]Skyrim Perk Enhancements and Rebalanced Gameplay[/heading]\r<br />[b][color=yellow]NEU in Version 3.1:[/b][/color]\r<br />\r<br />[list][*]MCM Integration mit einem umfassenden Konfigurationssystem.\r<br />[*]Neue Beschwörungstalente für die Fans der Beschwörungszauber.\r<br />[*]Frostmagier sind nun tötlicher denn je, dank des Frost-Umhanges.\r<br />[*]Erweiterte Unterstützung für den waffenlosen Kampf.\r<br />[*]Ein Dragonborn- und Dawnguard-Patch zur Lösung einiger kleinerer Konflikte.\r<br />[*]Override-Dateien machen SPERG noch kompatibler und konfigurierbarer.\r<br />[*]Unmengen an Fehlerberichtigungen.[/list]\r<br />\r<br />[b][color=orange]Warum diese Modifikation nutzen?[/color][/b]\r<br />\r<br />[color=#add8e6][b]-Importiere Deinen bestehenden Character[/b][/color]\r<br />Während SPERG das beste Spielerlebnis mit einem neuen Charakter bietet, wird SPERG auch bestehende Charakter automatisch importieren, wenn ein Charakter nach der Installation von SPERG geladen wird. Es wird dringend empfohlen, einen Speicherstand vor dem Laden eines bestehenden Charakters anzulegen, zu dem man zurückkehren kann.\r<br />\r<br />[color=#add8e6][b]-Mehr Spielmöglichkeiten[/b][/color]\r<br />Spiele Deinen Charakter auf die Weise die Du willst, ohne darüber nachdenken zu müssen, ob Talententscheidungen Nachteile haben. Charaktere wie Magier, die nicht auf Zerstörung setzen oder Dolch-Schurken, machen deutlich mehr Spaß mit SPERG.\r<br />\r<br />[color=#add8e6][b]-Modulares Design ohne Installations-Drama[/b][/color]\r<br />Alles wurde um die Talente herum entworfen und ist auch genau dort angesiedelt. Du kannst auswählen, welche Erweiterungen Du möchtest und welche nicht. Alles innerhalb des Spieles und alles, ohne sich Gedanken um die Installation und manuelle Anpassungen zu machen. Einfacher geht es nicht: Installieren und Spielen&#33;\r<br />\r<br />[color=#add8e6][b]-Nahtlose Integration in das originale Spiel[/b][/color]\r<br />Alles was SPERG an Modifikationen einführt oder ändert, könnte auch Bestandteil des Originalspieles sein, wenn Du es nicht besser wüsstest. Sicherzustellen, dass ein neuer Spieler überhaupt nicht merkt, dass er eine Modifikation benutzt, war eine der Top-Prioritäten. Alles aus einem Guss, keine Brüche.\r<br />\r<br />[color=#add8e6][b]-Mehr Abwechslung[/b][/color]\r<br />Zu viele Charaktere im originalen Skyrim ähneln sich in den höheren Stufen. Sie spielen sich praktisch gleich. Der Zugriff auf neue, veränderte und erweiterte Talente und Fähigkeiten machen Deinen Charakter deutlich einmaliger und spannender. Du möchtest einen Jäger erstellen, der in Frieden mit wilden Tieren lebt, die nicht angreifen? Jetzt kannst Du das, und vieles Andere mehr.\r<br />\r<br />[color=#add8e6][b]-Bringt den Spaß am Stufenaufstieg zurück[/b][/color]\r<br />Mit mehr Talenten und mehr einzigartigen Fähigkeiten kannst Du die Weiterentwicklung Deines Charakteres praktisch fühlen. Ein Stufenaufstieg bringt jetzt deutlich mehr als nur neue Waffen. Die Spielweise Deines Charakters verändert sich, während er sich weiterentwickelt. Spürbar.\r<br />\r<br />[color=#add8e6][b]-Sorgfältige Ausgewogenheit[/b][/color]\r<br />Während es immer Raum gibt, etwas noch besser zu machen, hat seorin eine Menge Anstrengungen darin investiert, die Änderungen ausgewogen zu gestalten. Insgesamt sind die Talente ein wenig kraftvoller als im Original, weil die Talente und deren Wirkungen untereinander besser sind. Allerdings sollte es kein bestimmtes Talent und keinen Talentbaum geben, der zu stark ist. seorin hat dazu Schadenswerte, basierend auf den internen Formeln des Spieles, wieder und wieder simuliert, um alle Wirkungen durchgängig zu gestalten.\r<br />\r<br />[color=#add8e6][b]-Fertigkeiten-Zusammenwirkung[/b][/color]\r<br />Die alten Talentbäume gaben bisher nur Vorteile für eigene Talente/Fertigkeiten, was dazu führte, dass sich Fertigkeiten nicht als Teil des Ganzen anfühlten und manchmal nutzlos waren. Die neuen Talentbäume haben viel mehr Wirkungen innerhalb der eigenen Talente und zeigen sogar Wirkungen auf andere Talentbäume. Damit sind deutlich unterschiedlichere Charaktere möglich. Und schließlich sind die meisten bisher nutzlosen Talente interessanter.\r<br />\r<br />[color=#add8e6][b]-Voll konfigurierbar[/b][/color]\r<br />Sogut wie alle Einstellungen dieser Modifikation können ab- und angeschaltet werden. Auch Anpassungen aktivierter Einstellungen sind möglich, aus dem Spiel heraus, ohne Notwendigkeit eines Neustartes des Spieles. Darüberhinaus ist Alles so entwickelt worden, dass es möglichst wenig Konflikte mit anderen Modifikationen gibt. Dadurch sind deutlich mehr Anpassungen als in anderen Talent-Überarbeitungen möglich, ohne dass mit einzelnen .esp-Dateien herumprobiert werden muss oder Kompatibilitäts-Patches erforderlich werden. Trotzdem bleibt die Anwendung solcher Patche natürlich möglich.\r<br />\r<br />[color=#add8e6][b]-Modder&#39;s Resource[/b][/color]\r<br />Der Source-Code aller Skripte ist beigefügt, in der Regel ausführlich kommentiert.\r<br />\r<br />[b][color=orange]Was macht diese Modifikation nun genau?[/color][/b]\r<br />\r<br />[color=#add8e6][b]-Automatische Talente[/b][/color]\r<br />Talente, die langweilig aber erforderlich sind (sogut wie alle 5-Punkte-Talente), werden nun automatisch erworben, abhängig vom Fertigkeitswert. Das Entfernen hätte eine drastische Auswirkung auf die Charakterkräfte, durch die Automatisierung werden diese erhalten und die Punkte können in spannende Talente investiert werden. Dies entspricht mehr dem System von Oblivion, verbessert um das neue Talentsystem von Skyrim.\r<br />\r<br />[color=#add8e6][b]-Neue Talentbäume[/b][/color]\r<br />Ohne Frage wurde das gesamte Talentsystem überarbeitet. Trotzdem wurde nichts entfernt, aber mehr als 100 Talente wurden hinzugefügt.\r<br />\r<br />[color=#add8e6][b]-Weniger Grinden[/b][/color]\r<br />Durch den [url=http://skyrim.nexusmods.com/mods/1175]Skyrim -Community- Uncapper[/url] passt SPERG die Aufstiegsgeschwindigkeit aller Fertigkeiten an. Das Ziel war, das &#34;Grinden&#34; zu reduzieren und die Ausgewogenheit der Weiterentwicklung aller Talentbäume aufeinander abzustimmen, ohne die Erfahrung durch das originale Spiel aufzugeben. Während die mitgelieferten Werte sehr ausgewogen sind, können diese in der INI-Datei des Community-Uncappers auf die eigenen Bedürfnisse angepasst werden.\r<br />\r<br />[color=#add8e6][b]-Metallschmelzen[/b][/color]\r<br />Die bisher aufgeführten Änderungen waren nicht wirklich genug für einige Talente, besondere das Schmieden. Schmieden fühlte sich einfach nicht richtig an. SPERG ermöglicht nun das Schmelzen von Gegenständen und das Gießen in Barren der entsprechenden Art. Damit kann deutlich mehr geschmiedet werden, ohne ganze Berge abzubauen. Natürlich kann dies auch abgeschaltet werden - Glück auf&#33;\r<br />\r<br />[color=#add8e6][b]-Quest-Belohnungen[/b][/color]\r<br />Ein weiterer Ansatz zur Anpassung der Fertigkeitssteigerung ist die Einführung von Questbelohnungen. Beim Abschließen von wichtigen Quests werden zufällige Fertigkeitssteigerungen vergeben. Dies ermutigt, einfach zu spielen und Quests zu erleben, als nur für die Fertigkeitssteigerung zu grinden. So gibt es auch eine Belohnung für Quests, deren originale Belohnungen für den Charakter möglicherweise nutzlos sind.\r<br />\r<br />[color=#add8e6][b]-Talentbaum-Zurücksetzung[/b][/color]\r<br />Die Talentbäume können vollständig zurückgesetzt werden. Allerdings ist dies mit den voreingestellten Werten mit dem zeitweisen Verlust eines Teiles der Gesundheit, Ausdauer und Magicka verbunden. Dies kann über das Konfigurationsmenü durchgeführt werden oder über eine kleine Quest, die in der Akademie in Winterfeste startet. Dort ist in den Unterkünften in einer verlassenen Ecke eine kleine Notiz zu finden, die... aber seht selbst.\r<br />\r<br />[color=#add8e6][b]-Minimalistische Unterstützung des waffenlosen Kampfes[/b][/color]\r<br />Der waffenlose Kampf wurde brauchbar gemacht. Es gibt auch jetzt keine magischen Fertigkeiten, die einen mönchartigen Charakter ermöglichen. Dies würde nicht der Geschichte von Skyrim entsprechen. Allerdings können Charakter nun sehr wohl die Rolle eines mit bloßen Fäusten kämpfenden Gauners einnehmen. Dies passt zu Skyrim und ganz besonders zu den Nords.\r<br />\r<br />[color=#add8e6][b]-Bessere Zauberentwicklung[/b][/color]\r<br />Alle Zauber verstärken sich nun direkt mit dem Fertigkeitsfortschritt. Zerstörungszauber machen mehr Schaden, Illusionszauber beeinflussen stärkere Ziele, Wiederherstellungszauber heilen (oder schädigen) mehr und sowohl Illusions- als auch Beschwörungszauber wirken länger. Mit dem Höchstwert von 100 einer Fertigkeit sind Zauber doppelt so stark wie bisher.\r<br />\r<br />[color=#add8e6][b]-Stäbe für niedrigstufige Magier[/b][/color]\r<br />Das Spielen eines reinen Magiers kann in den niedrigen Stufen hart sein. Nun können Stäbe wirklich einen Beitrag leisten, dem Magier zu helfen. Auch wenn Stäbe bisher bereits machtvoll waren, hatte deren Einsatz stets zur Folge, dass sich die magischen Fertigkeiten nicht weiterentwickelten. Nun wird der Einsatz von Stäben auch Einfluss auf die magischen Fähigkeiten haben und diese weiterentwickeln.\r<br />\r<br />[b][color=orange]Erforderliche Voraussetzungen[/color][/b]\r<br />[list][*]Skyrim Version 1.9+ erforderlich.\r<br />[*][url=http://skse.silverlock.org]Skyrim Script Extender (SKSE)[/url] - Ermöglicht den Import bestehender Charaktere und viele andere Funktionen der Talentbäume, zum Beispiel auch das Zurücksetzen.\r<br />[*][url=http://skyrim.nexusmods.com/mods/3863]SkyUI 3+[/url] - Aktiviert das Konfigurationssystem von SPERG.\r<br />[*][url=http://skyrim.nexusmods.com/mods/1175]Skyrim -Community- Uncapper[/url] - Passt die Auswirkungen von Aufstiegen und Talenten an, um einen Charakter nicht zu stark werden zu lassen.[/list]\r<br />\r<br />[b][color=orange]Empfohlene Modifikationen[/color][/b]\r<br />[list][*][url=http://skyrim.nexusmods.com/mods/34925/]Inoffizielle SPERG Patches[/url] - Einige nützliche Patches, die kleinere Konflikte mit bekannten Modifikationen bereinigen (Englisch&#33;).\r<br />[*][url=http://skyrim.nexusmods.com/mods/9465]Faster Mining[/url] - 10 Sekunden für&#39;s Abbauen von Lagerstätten? Nein danke. (Englisch&#33;)\r<br />[*][url=http://skyrim.nexusmods.com/mods/33395]SkyTweak[/url] - Unzählige Anpassungsoptionen, alle im Zugriff direkt im Spiel (Englisch&#33;).[/list]\r<br />\r<br />[b][color=orange]Installationsanweisungen[/color][/b]\r<br />[list=1][*]Erforderliche Voraussetzungen herstellen.\r<br />[*]Installation mit dem NMM/ModOrganizer (empfohlen&#33;), oder manuelles Entpacken in das Data-Verzeichnis.\r<br />[*]Bei manueller Installation müssen die erforderlichen Patches für Dawnguard und Dragonborn sowie das SKSE-Verzeichnis per Hand in das Data-Verzeichnis kopiert und die ESPs aktiviert werden.\r<br />[*]Spielen und Spaß haben&#33;[/list]\r<br />\r<br />[heading]Neue Talentbäume[/heading]\r<br />Im Folgenden werden die neuen Talentbäume abgebildet. Diese sind in den Abbildungen nicht übersetzt, auch die Wirkungen sind an dieser Stelle nicht übersetzt. Die Darstellung auf dieser Seite ist darüber hinaus etwas schwierig, bei Interesse bitte das Mod (ggfs manuell) herunterladen und die Datei perktrees.html im Verzeichnis SPERGreadme aufrufen (Englisch&#33;). \r<br />\r<br />[b][color=yellow]Im Spiel sind alle Talente und Konfigurationseinstellungen übersetzt.[/b][/color]\r<br />\r<br />\r<br />\r<br />[color=red][size=4][b]Warrior Skills[/b][/size][/color]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-1-1348720388.jpg[/img]\r<br />[color=red][b]Archery[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i]Overdraw (Novice)[/i] - Bows do 20% more damage.\r<br />[*][i]Critical Shot (Apprentice)[/i] - Bows do 40% more damage and have a 10% higher chance to critically hit.\r<br />[*][i]Hunter&#39;s Discipline (Adept)[/i] - 80% chance to recover arrows from dead bodies. Bows do 60% more damage and have a 15% higher chance to critically hit.\r<br />[*][i]Ranger (Expert)[/i] - Able to move faster with a drawn bow. Bows do 80% more damage and have a 20% higher chance to critically hit.\r<br />[*][i]Quick Shot (Master)[/i] - Can draw a bow 30% faster. Bows deal double damage and have a 25% higher chance to critically hit.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Ethereal Arrows[/i] - Firing a bow without any arrows equipped will fire an ethereal arrow from your magicka pool.\r<br />[*][i]Eagle Eye[/i] - Pressing Block while aiming will zoom in your view.\r<br />[*][i]Steady Hand[/i] - Zooming in with a bow slows time by 50%.\r<br />[*][i]Survivalist[/i] - Most wild animals are friendly until attacked. Gain use of the Hunter&#39;s Sight lesser power.\r<br />[*][i]Knockout[/i] - Bashing with a bow briefly knocks the target out. This ability can only be used once every 15 seconds.\r<br />[*][i]Power Shot[/i] - Arrows stagger all but the largest opponents 50% of the time. Critical hits with all weapons deal 50% more damage.\r<br />[*][i]Sniper[/i] - Bow attacks are guaranteed to critically hit when firing from out of combat.\r<br />[*][i]Head Shot[/i] - Critical hits with a bow have a 10% chance to deal lethal damage. All weapons are 5% more likely to critically hit.\r<br />[*][i]Knee Shot[/i] - Bow attacks have a 15% chance to cripple the target for 12 seconds. Targets without vulnerable knees will be paralyzed instead.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-2-1348258740.jpg[/img]\r<br />[color=red][b]Block[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i]Shield Wall[/i] - Blocking is (20, 25, 30, 35, 40)% more effective.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Power Bash[/i] - Able to do a power bash.\r<br />[*][i]Quick Reflexes[/i] - Time slows down if you are blocking during an enemy&#39;s power attack.\r<br />[*][i]Deflection[/i] - Arrows that hit the shield do no damage. Blocking with a shield reduces incoming fire, frost, and shock damage by 50%.\r<br />[*][i]Disarming Bash[/i] - Chance to disarm when power bashing. Bashing does five times more damage.\r<br />[*][i]Defensive Stance[/i] - Take 20% less damage even when not using a shield. Blocking with a shield has a 50% chance to reflect all damage back at the attacker.\r<br />[*][i]Shield Charge[/i] - Shields weigh nothing when wielded and you are able to move faster with one raised. Sprinting with a shield raised knocks down most targets.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-1-1354061596.jpg[/img]\r<br />[color=red][b]Heavy Armor[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i]Juggernaut (Novice)[/i] - Increases armor rating for Heavy Armor by 20%.\r<br />[*][i]Well Fitted (Apprentice)[/i] - 25% Armor bonus if wearing only Heavy Armor. Increases armor rating for Heavy Armor by 40%.\r<br />[*][i]Conditioning (Adept)[/i] - Heavy Armor weighs nothing and doesn&#39;t slow you down when worn. Increases armor rating for Heavy Armor by 60%.\r<br />[*][i]Tower of Strength (Expert)[/i] - 50% less stagger when wearing only Heavy Armor. Increases armor rating for Heavy Armor by 80%.\r<br />[*][i]Matching Set (Master)[/i] - Additional 25% Armor bonus if wearing at least three matched pieces of Heavy Armor. Doubles armor rating for Heavy Armor.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Fists of Steel[/i] - Heavy Armor gauntlets increase melee damage and reduce the stamina cost of power attacks. Gauntlets made of stronger materials have a greater effect (max 30%).\r<br />[*][i]Thick Padding[/i] - When you are wearing mostly heavy armor, arrow damage is reduced by half and frost resistance is increased by 20%.\r<br />[*][i]Mounted Knight[/i] - Attacks from horseback deal double damage.\r<br />[*][i]Wall of Iron[/i] - When you are wearing mostly heavy armor, enemies that strike you in melee occasionally stagger.\r<br />[*][i]Warded Plate[/i] - For each piece of heavy armor equipped, there is a 5% chance for incoming fire, frost, and shock spells to deal no damage (maximum 20% chance).\r<br />[*][i]Iron Will[/i] - Grants immunity to paralysis and the strongest Unrelenting Force shouts.\r<br />[*][i]Ignore Pain[/i] - 20% chance of ignoring all damage from a melee attack.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-2-1354061596.jpg[/img]\r<br />[color=red][b]One Handed[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i]Armsman[/i] - One-Handed weapons do (20, 40, 60, 80, 100)% more damage and power attacks with one-handed weapons cost (5, 10, 15, 20, 25)% less stamina.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Bone Breaker[/i] - Attacks with maces have a 5% chance to knock the target down. Attacks with all weapons ignore 50% of armor.\r<br />[*][i]Hack and Slash[/i] - Attacks with war axes deal 50% more critical damage. Attacks with all weapons are 5% more likely to critically hit.\r<br />[*][i]Bladesman[/i] - Attacks with one-handed swords are 30% faster. Attacks with all other weapons are 15% faster.\r<br />[*][i]Fighting Stance[/i] - All weapons swing 15% faster and critical damage is increased by 50% when wielding one or more one-handed weapons.\r<br />[*][i]Weapon Master[/i] - Melee attacks gain unique bonuses based on weapon type. These bonuses are listed with active magic effects. (See below)\r<br />[*][i]Critical Charge[/i] - Can do a one-handed power attack while sprinting that does double critical damage. One handed power attacks are 20% more likely to critically hit.\r<br />[*][i]Savage Strike[/i] - One-handed sideways power attacks may slay targets low on health and regenerate 100 points of stamina over 5 seconds if successful. One handed standing power attacks may decapitate enemies.\r<br />[*][i]Dual Savagery[/i] - Dual wielding power attacks do 50% bonus damage. Dual wielding attacks are 35% faster.\r<br />[*][i]Paralyzing Flurry[/i] - For 6 seconds following a one-handed backwards power attack, all attacks paralyze their target. This can only occur once every 20 seconds.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-5-1348258741.jpg[/img]\r<br />[color=red][b]Smithing[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i](Material) Smithing[/i] - Can create (material) weapons and armor at forges.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Dragon Armor[/i] - Can create Dragon armor at forges.\r<br />[*][i]Light Armorer[/i] - Can improve Light Armor twice as much.\r<br />[*][i]Heavy Armorer[/i] - Can improve Heavy Armor twice as much.\r<br />[*][i]Weaponsmith[/i] - Can improve weapons and shields twice as much.\r<br />[*][i]Arcane Blacksmith[/i] - You can improve magical weapons and armor. Enchantments you cast are 10% stronger.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-3-1354061596.jpg[/img]\r<br />[color=red][b]Two Handed[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i]Barbarian[/i] - Two-Handed weapons do (20, 40, 60, 80, 100)% more damage and power attacks with two-handed weapons cost (5, 10, 15, 20, 25)% less stamina.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Skullcrusher[/i] - Standing power attacks with warhammers have a 30% chance to knock the target backwards. Attacks with all weapons ignore 50% of armor.\r<br />[*][i]Limbsplitter[/i] - Attacks with battleaxes deal 50% more critical damage. Power attacks with all weapons are 20% more likely to critically hit.\r<br />[*][i]Great Swings[/i] - Attacks with greatswords are 30% faster. Attacks with all other weapons are 15% faster.\r<br />[*][i]Champion&#39;s Stance[/i] - Attacks with two-handed weapons have a 10% chance to stagger the target. Power attacks with all weapons deal 20% more damage.\r<br />Specialization perks (cont.)\r<br />[*][i]Great Critical Charge[/i] - Can do a two-handed power attack while sprinting that does double critical damage. Critical hits with two-handed power attacks deal 50% more damage.\r<br />[*][i]Devastating Blow[/i] - Two-handed standing power attacks do 25% bonus damage with a chance to decapitate your enemies. Melee attacks with two-handed weapons deal 10% more damage.\r<br />[*][i]Sunder Armor[/i] - Two-handed forward power attacks destroy the target&#39;s shield if blocked and have a 30% chance to destroy a piece of the target&#39;s armor if unblocked.\r<br />[*][i]Sweep[/i] - Sideways power attacks with two-handed weapons hit all targets in front of you. Melee damage is increased by 20% for 6 seconds after any two-handed power attack.\r<br />[*][i]Warmaster[/i] - Two-handed power attacks have a 10% chance to deal lethal damage.[/list]\r<br />\r<br />[color=#65d700][size=4][b]Thief Skills[/b][/size][/color]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-2-1348258791.jpg[/img]\r<br />[color=#65d700][b]Alchemy[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i]Novice Alchemist[/i] - Potions and poisons you make are 25% stronger. Potions that restore health, magicka, or stamina are another 25% more powerful.\r<br />[*][i]Apprentice Alchemist[/i] - Potions and poisons you make are 50% stronger. Eating an ingredient reveals the first two effects.\r<br />[*][i]Adept Alchemist[/i] - Potions and poisons you make are 75% stronger. Eating an ingredient reveals the first three effects.\r<br />[*][i]Expert Alchemist[/i] - Potions and poisons you make are 100% stronger. Eating an ingredient reveals all four effects.\r<br />[*][i]Master Alchemist[/i] - Potions and poisons you make are 125% stronger. Two ingredients are gathered from plants.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Troll Blood[/i] - Health regenerates 50% faster.\r<br />[*][i]Concentrated Poison[/i] - Poisons you mix are 50% stronger and poisons applied to weapons last four times as long.\r<br />[*][i]Knowledge Seeker[/i] - Allows you to create the Philosopher&#39;s Stone at a smelter, which unlocks the ability to transmute metal ingots. Also grants 50% resistance to all poisons.\r<br />[*][i]Purity[/i] - All negative effects are removed from created potions, and all positive effects are removed from created poisons.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-4-1354061597.jpg[/img]\r<br />[color=#65d700][b]Light Armor[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i]Agile Defender (Novice)[/i] - Increase armor rating for Light armor by 20%.\r<br />[*][i]Custom Fit (Apprentice)[/i] - 25% Armor bonus if wearing only Light Armor. Increase armor rating for Light Armor by 40%.\r<br />[*][i]Unhindered (Adept)[/i] - Light Armor weighs nothing and doesn&#39;t slow you down when worn. Increase armor rating for Light Armor by 60%.\r<br />[*][i]Nimble (Expert)[/i] - Falling damage is reduced by half. Increase armor rating for Light Armor by 80%.\r<br />[*][i]Matching Set (Master)[/i] - Additional 25% Armor bonus if wearing at least three matched pieces of Light Armor. Increase armor rating for Light Armor by 100%.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Light Burden[/i] - Horses you ride move 50% faster.\r<br />[*][i]Wind Walker[/i] - Stamina regenerates 50% faster.\r<br />[*][i]Berserker Rage[/i] - When hit with a power attack, gain stamina regeneration and a 25% damage increase for 6 seconds.\r<br />[*][i]Insulating Wards[/i] - For each piece of light armor equipped, potions and armor spells have a 10% longer duration (maximum 40% increase).\r<br />[*][i]Strategic Retreat[/i] - When an attack brings your health below 20%, you gain a burst of speed for 10 seconds. This effect can only occur once every 30 seconds.\r<br />[*][i]Skirmish Tactics[/i] - Perks which affect power attacks have a lesser effect on regular attacks as well.\r<br />[*][i]Riposte[/i] - 40% chance to reflect melee damage back at the enemy.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-3-1367541166.jpg[/img]\r<br />[color=#65d700][b]Lockpicking[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i](Rank) Locks[/i] - (Rank) locks are much easier to pick.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Inside Man[/i] - Allows access to inconspicuous chests placed outside of town jails. These are used for laundering stolen goods and paying discounted fines.\r<br />[*][i]Blinding Bash[/i] - Bashing opponents with a torch gives their attacks against you a 30% chance to become a glancing blow (10% damage) for 8 seconds.\r<br />[*][i]Thief[/i] - Able to pick locks without being noticed. Carrying capacity is increased by 100.\r<br />[*][i]Treasure Hunter[/i] - 50% greater chance of finding special treasure, and find more gold in chests.\r<br />[*][i]Dungeon Delver[/i] - Chaurus, skeevers, and spiders are friendly until attacked. Gain use of the Dungeon Sense lesser power.\r<br />[*][i]Blazing Bash[/i] - Fire damage from your torch bash is significantly increased and may cause opponents to run in fear.\r<br />[*][i]Dwemer Engineer[/i] - Dwemer Automatons are friendly until attacked. Grants 30% shock resistance and increases the variety of dwemer scrap metal that may be melted into ingots.\r<br />[*][i]Locksmith[/i] - Lockpicks never break, the pick starts close to the lock opening position, and successfully picking a lock rewards a copy of the key.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-5-1354061597.jpg[/img]\r<br />[color=#65d700][b]Pickpocket[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i]Light Fingers (Novice)[/i] - Pickpocketing bonus of 20%, and unarmed damage increases. Item weight and value reduce pickpocketing odds.\r<br />[*][i]Night Thief (Apprentice)[/i] - +25% chance to pickpocket if the target is asleep. Pickpocketing bonus increases to 40%, and unarmed damage increases further.\r<br />[*][i]Cutpurse (Adept)[/i] - Pickpocketing gold is 50% easier. Pickpocketing bonus increases to 60%, and unarmed damage increases further.\r<br />[*][i]Keymaster (Expert)[/i] - Pickpocketing keys almost always works. Pickpocketing bonus increases to 80%, and unarmed damage increases further.\r<br />[*][i]Misdirection (Master)[/i] - Pickpocketing bonus and gold pickpocketing bonus both increase to 100%. Unarmed damage increases even further.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Poisoned[/i] - Silently harm enemies by placing poisons in their pockets.\r<br />[*][i]Extra Pockets[/i] - Carrying capacity is increased by 100 and stamina is increased by 50.\r<br />[*][i]Brigand&#39;s Brew[/i] - Consuming alcohol increases your melee damage by 30% for 15 seconds.\r<br />[*][i]Acid Splash[/i] - As long as one hand is free, melee attacks deal 50% more critical damage and have a 20% chance to deal extra poison damage over 3 seconds.\r<br />[*][i]Purse Snatcher[/i] - Increases run speed by 30%.\r<br />[*][i]Blade Catcher[/i] - As long as one hand is free (unarmed or spell), melee attacks deal 20% more damage and you have a 10% chance to disarm attackers that strike you in melee.\r<br />[*][i]Drunken Rage[/i] - Consuming alcohol has a chance of sending you into a drunken rage, increasing melee damage and reducing damage taken by 50% each. This chance increases the more you drink.\r<br />[*][i]Perfect Touch[/i] - Can pickpocket equipped items.\r<br />[*][i]Cheap Shot[/i] - As long as one hand is free, power attacks have a 25% chance to cripple the target. Unarmed attacks have a 5% higher chance to critically hit.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-1-1348258852.jpg[/img]\r<br />[color=#65d700][b]Sneak[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i]Stealth (Novice)[/i] - You are 20% harder to detect when sneaking.\r<br />[*][i]Muffle (Apprentice)[/i] - Noise from armor is reduced 50%. You are 25% harder to detect when sneaking.\r<br />[*][i]Silence (Adept)[/i] - Walking and running does not affect detection. You are 30% harder to detect when sneaking.\r<br />[*][i]Silent Roll (Expert)[/i] - Sprinting while sneaking executes a silent forward roll. You are 35% harder to detect when sneaking.\r<br />[*][i]Assassin&#39;s Blade (Master)[/i] - Attacks with daggers deal 50% more damage. You are 40% harder to detect when sneaking.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Sneak Attack[/i] - Sneak attacks deal triple damage when using a bow, x6 damage when using a one-handed weapon, x8 damage when unarmed, and x15 damage when using a dagger.\r<br />[*][i]Keen Eye[/i] - Dagger attacks made from out of combat are guaranteed to critically hit.\r<br />[*][i]Light Foot[/i] - You won&#39;t trigger pressure plates and you&#39;re 20% less likely to stagger when struck.\r<br />[*][i]Heart Seeker[/i] - Sneak attacks have a 10% chance to deal lethal damage.\r<br />[*][i]Assassin&#39;s Reflexes[/i] - Grants the Assassin&#39;s Reflexes lesser power, which slows time in exchange for stamina, but only while sneaking.\r<br />[*][i]Shadow Warrior[/i] - Crouching stops combat for a moment and forces distant opponents to search for a target.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-2-1348258852.jpg[/img]\r<br />[color=#65d700][b]Speech[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i]Haggling (Novice)[/i] - Buying and selling prices are 10% better.\r<br />[*][i]Merchant (Apprentice)[/i] - Can sell any type of item to any kind of merchant. Buying and selling prices are 15% better.\r<br />[*][i]Investor (Adept)[/i] - Can invest 500 gold with a shopkeeper to increase his available gold permanently. Buying and selling prices are 20% better.\r<br />[*][i]Fence (Expert)[/i] - Can barter stolen goods with any merchant you have invested in. Buying and selling prices are 25% better.\r<br />[*][i]Master Trader (Master)[/i] - Every merchant in the world gains 1000 gold for bartering. Buying and selling prices are 30% better.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Convincing[/i] - Can bribe guards to ignore crimes. Persuasion attempts are 30% easier and intimidation is twice as likely to succeed.\r<br />[*][i]Trained Voice[/i] - Shouts are 50% more powerful and last 30% longer.\r<br />[*][i]Allure[/i] - 30% better prices with the opposite sex. Also gain the &#34;Lover&#39;s Comfort&#34; buff.\r<br />[*][i]Legendary Skald[/i] - Time between shouts is reduced by 50%.[/list]\r<br />\r<br />[color=#3bb9ff][size=4][b]Mage Skills[/b][/size][/color]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-1-1354061621.jpg[/img]\r<br />[color=#3bb9ff][b]Alteration[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i](Rank) Alteration[/i] - Cast (rank) level Alteration spells for half magicka.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Ancestral Awakening[/i] - Your passive racial abilities are twice as strong, and you receive a second, awakened version of your racial power that can be used every 6 hours.\r<br />[*][i]Spell Charge[/i] - Single cast spells are 15% more effective for each second spent casting them (max 45% increase).\r<br />[*][i]Mage Armor[/i] - Magic armor spells never need to be re-cast. When not wearing armor, they are four times as strong and level Alteration as if it were an armor skill.\r<br />[*][i]Mystic Transmutation[/i] - Allows you to forge an Arcane Converter, which can convert magicka into soul energy for powering enchantments. Higher skill levels allow the creation of more potent converters.\r<br />[*][i]Efficiency Expert[/i] - Each rank in a spell school reduces the cost of all spells in that school by 10% and increases spell duration by 20%.\r<br />[*][i]Magic Resistance[/i] - Blocks 30% of a spell&#39;s effects.\r<br />[*][i]Spirit Echo[/i] - 10% chance of summoning a Spirit Echo in combat, which drains health, magicka, and stamina from enemies and returns it to you.\r<br />[*][i]Chain Casting[/i] - Destruction spells charge with each spell cast. At max charge, dual casting a spell allows you to cast double damage spells at no magicka cost for 5 seconds, but afterwards the charge will reset.\r<br />[*][i]Atronach[/i] - Absorb 30% of the magicka of any spells that hit you.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-2-1367541166.jpg[/img]\r<br />[color=#3bb9ff][b]Conjuration[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i](Rank) Conjuration[/i] - Cast (rank) level Conjuration spells for half magicka.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Spirit Binding[/i] - Bound weapons do more damage and cast Soul Trap on targets.\r<br />[*][i]Summoner[/i] - Doubles the range of all summon spells and the duration of all conjuration spells. You gain 50 health, and friendly summoned creatures gain 20% damage resistance when near you.\r<br />[*][i]Dark Souls[/i] - Reanimated undead have 100 points more health and leech health from nearby enemies.\r<br />[*][i]Mystic Binding[/i] - Bound weapons do more damage, banish summoned creatures, and turn raised ones.\r<br />[*][i]Elemental Potency[/i] - Conjured Atronachs are significantly more powerful, and you gain 25% resistance to all elements.\r<br />[*][i]Plague Carrier[/i] - Can reanimate higher level undead. Reanimated undead spread a contagious disease that slows movement, drains health and stamina, and increases damage taken by 30%.\r<br />[*][i]Oblivion Binding[/i] - Bound weapons do more damage and gain elemental enchantments.\r<br />[*][i]Elemental Mastery[/i] - Conjured Atronachs gain new abilities and give you a 30% increase to elemental damage when summoned.\r<br />[*][i]Twin Souls[/i] - You can have two atronachs or reanimated zombies. Every six hours, you may summon three atronachs at once or reanimate all corpses around you.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-1-1367541165.jpg[/img]\r<br />[color=#3bb9ff][b]Destruction[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i](Rank) Destruction[/i] - Cast (rank) level Destruction spells for half magicka.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Dual Casting[/i] - Enables dual casting for all spell schools. Dual casting a spell overcharges the effects into an even more powerful version.\r<br />[*][i]Impact[/i] - Most destruction spells will stagger an opponent when dual cast.\r<br />[*][i]Rune Master[/i] - Can place runes five times farther away and they deal twice as much damage.\r<br />[*][i]Flame Affinity[/i] - Weapon attacks have a 20% chance to make targets take triple damage from fire for 4 seconds. Smithing improvements are 20% more effective.\r<br />[*][i]Frost Aura[/i] - Increases armor and frost resistance by 20%. Nearby enemies suffer 75% weakness to frost and 20% reduced movement speed.\r<br />[*][i]Flowing Current[/i] - Shock spells deal 50% more damage. All spells cost 20% less to cast.\r<br />[*][i]Intense Flames[/i] - Fire damage causes targets below 30% health to flee. 20% chance when casting a fire spell to instantly cast it a second time for no magicka.\r<br />[*][i]Deep Freeze[/i] - Frost damage paralyzes targets below 20% health. 20% chance when casting a frost spell to instantly cast it a second time for no magicka.\r<br />[*][i]Disintegrate[/i] - Shock damage disintegrates targets below 10% health. 20% chance when casting a shock spell to instantly cast it a second time for no magicka.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-1-1348259185.jpg[/img]\r<br />[color=#3bb9ff][b]Enchanting[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i]Enchanter[/i] - New enchantments are (20, 40, 60, 80, 100)% stronger.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Soul Scavenger[/i] - Soul gems provide extra magicka for recharging. Death blows to creatures, but not people, trap 5% of the victim.\r<br />[*][i]Magic Dust[/i] - Doubles the duration of all potions. Potions which fortify a crafting skill last ten times as long.\r<br />[*][i]Elemental Enchanter[/i] - Elemental enchantments on weapons and armor are 25% stronger.\r<br />[*][i]Corpus Enchanter[/i] - Health, magicka, stamina, and skill enchantments on armor are 25% stronger.\r<br />[*][i]Imbue Potion[/i] - All potions are 50% more effective.\r<br />[*][i]Extra Effect[/i] - Can put two enchantments on the same item.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-2-1354061622.jpg[/img]\r<br />[color=#3bb9ff][b]Illusion[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i](Rank) Illusion[/i] - Cast (rank) level Illusion spells for half magicka.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Rallying Presence[/i] - Nearby allies have 50 more health, take 20% less damage, and regenerate 6 health per second. Does not work on undead, daedra or automatons.\r<br />[*][i]Quiet Casting[/i] - All spells you cast from any school of magic are silent to others.\r<br />[*][i]Phantom Beast[/i] - Phantom creatures fight at your side during combat, dealing damage and occasionally casting fear on their targets.\r<br />[*][i]Spectral Warding[/i] - For every 70 points of armor rating gained from worn armor, you also gain 5% magic resistance (max 40%).\r<br />[*][i]Spectral Warrior[/i] - 5% chance to enter Spectral Form for 8 seconds when hit. In this form, you take no damage, deal 50% more damage, and illusion spells cost no magicka.\r<br />[*][i]Calming Presence[/i] - Giants, mammoths, ice wraiths, and trolls are friendly until attacked. Gain use of the Tranquility lesser power.\r<br />[*][i]Master of the Mind[/i] - Illusion spells and Rallying Presence work on undead, daedra and automatons.\r<br />[*][i]Ghostwalk[/i] - Invisibility effects last twice as long. While invisible, your movement is silent, and attacks and spells pass through you.\r<br />[*][i]Phantom Armory[/i] - Invulnerable phantom weapons will aid you during combat.[/list]\r<br />\r<br />[img]http://skyrim.nexusmods.com/mods/images/24445-3-1348259185.jpg[/img]\r<br />[color=#3bb9ff][b]Restoration[/b][/color]\r<br />[b]Automatic Perks[/b]\r<br />[list][*][i](Rank) Restoration[/i] - Cast (rank) level Restoration spells for half magicka.[/list]\r<br />[b]Specialization Perks[/b]\r<br />[list][*][i]Respite[/i] - Healing spells also restore Stamina.\r<br />[*][i]Recovery[/i] - Magicka regenerates 50% faster.\r<br />[*][i]Ward Absorb[/i] - Wards recharge your magicka when hit with spells. Absorb 10% of the magicka of any spells that hit you.\r<br />[*][i]Concentration[/i] - Magicka regenerates at its full rate even when you are in combat.\r<br />[*][i]Necromage[/i] - All spells are more effective against undead.\r<br />[*][i]Avoid Death[/i] - Once a day, automatically heal to full if you fall below 10% health.[/list]\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/hXQSy.png[/img][/url][/center]",
  "categoryId": "24",
  "version": "4.001",
  "author": "Thoddy398 - Orig by seorin",
  "createdUnix": "1364228415",
  "updatedUnix": "1388337769",
  "containsAdultContent": false,
  "uploadedBy": "Thoddy398",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020153",
      "name": "SPERG - Skyrim Perk Enhancements - German - Deutsch",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1336",
      "fileName": "SPERG - Skyrim Perk Enhancements - German - Deutsch-33903-3-0.rar",
      "uploadedUnix": "1364228261",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/1f98de040aad12c4e393c825958e04e8109c93941040487896f4249e55b22c32/analysis/1407488050/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%20-%20Skyrim%20Perk%20Enhancements%20-%20German%20-%20Deutsch-33903-3-0.rar?fid=1000020153&ttl=1535811308&ri=8192&rs=8192&setec=566dbd220392cbce21832daf0ece9642"
    },
    {
      "fileId": "1000027874",
      "name": "SPERG - Skyrim Perk Enhancements - German - Deutsch",
      "version": "3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1904",
      "fileName": "SPERG - Skyrim Perk Enhancements - German - Deutsch-33903-3-1.rar",
      "uploadedUnix": "1367620259",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/1590e629af4969f9b1e154768bca053a87c5d80921c95c04a2f1fd9a06c5e3c9/analysis/1407553264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%20-%20Skyrim%20Perk%20Enhancements%20-%20German%20-%20Deutsch-33903-3-1.rar?fid=1000027874&ttl=1535811308&ri=8192&rs=8192&setec=d536cccfdb467ac0414f9a2715cc8742"
    },
    {
      "fileId": "1000028855",
      "name": "SPERG - Skyrim Perk Enhancements - German - Deutsch",
      "version": "3.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1907",
      "fileName": "SPERG - Skyrim Perk Enhancements - German - Deutsch-33903-3-1-1.rar",
      "uploadedUnix": "1368030000",
      "modVersion": "3.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6a7d0c1bd1c1bea4add6a3d05cbf387331b0d3366a7f100a2929bff9787423f3/analysis/1407561072/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%20-%20Skyrim%20Perk%20Enhancements%20-%20German%20-%20Deutsch-33903-3-1-1.rar?fid=1000028855&ttl=1535811308&ri=8192&rs=8192&setec=ebd77261399f8bee380cb8451e62a553"
    },
    {
      "fileId": "1000030009",
      "name": "SPERG - Skyrim Perk Enhancements - German - Deutsch",
      "version": "3.1.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1446",
      "fileName": "SPERG - Skyrim Perk Enhancements - German - Deutsch-33903-3-1-1-1.rar",
      "uploadedUnix": "1368645255",
      "modVersion": "3.1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c548d2818dbec2d8c806b0aa4bda406c06ef0a187c271ddcf2de13e8a8543f9a/analysis/1407570524/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%20-%20Skyrim%20Perk%20Enhancements%20-%20German%20-%20Deutsch-33903-3-1-1-1.rar?fid=1000030009&ttl=1535811309&ri=8192&rs=8192&setec=79fabf1bf26bd1670053d186daa3c3bb"
    },
    {
      "fileId": "1000088076",
      "name": "SPERG - Skyrim Perk Enhancement - German - Deutsch",
      "version": "4.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3340",
      "fileName": "SPERG - Skyrim Perk Enhancement - German - Deutsch-33903-4-0.rar",
      "uploadedUnix": "1387816787",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/0365aef2aa3d254c4b3b4510461ff98627577620daf8ca46c40586ae2994a103/analysis/1407855524/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%20-%20Skyrim%20Perk%20Enhancement%20-%20German%20-%20Deutsch-33903-4-0.rar?fid=1000088076&ttl=1535811310&ri=8192&rs=8192&setec=461af2082b4039e967e66fe6fc80595d"
    },
    {
      "fileId": "1000088855",
      "name": "SPERG - Skyrim Perk Enhancement - German - Deutsch",
      "version": "4.001",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3339",
      "fileName": "SPERG - Skyrim Perk Enhancement - German - Deutsch-33903-4-001.rar",
      "uploadedUnix": "1388337769",
      "modVersion": "4.001",
      "virusScanUrl": "https://www.virustotal.com/file/54345601dd74e32df7abb55a9467f4bfb9986ae32ac933be2b9abc0416a6f1b1/analysis/1407863577/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%20-%20Skyrim%20Perk%20Enhancement%20-%20German%20-%20Deutsch-33903-4-001.rar?fid=1000088855&ttl=1535811310&ri=8192&rs=8192&setec=d6a2bde33bd9f0e2c0314f861624ad53"
    }
  ]
}