{
  "modId": 33935.0,
  "modName": "Clean Save - Male - Orc - Whiterun",
  "summary": "This save is a clean save, with no modifications activated. You start off as a Male, Orc named Mulgore right at the gate entrance in Whiterun. In Escaping Helgen I choose to help out the Stormcloaks, although this has no impact to the overall game. I killed and picked up ALL items this included killing two Stormcloak members before the bridge colla",
  "descriptionHtml": "Description\r\nThis save is a clean save, with no modifications activated. You start off as a Male, Orc named Mulgore right at the gate entrance in Whiterun. In Escaping Helgen I choose to help out the Stormcloaks, although this has no impact to the overall game. I killed and picked up ALL items this included killing two Stormcloak members before the bridge collapsed, there is no bounty associated with this once so ever so it\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s just a few extra starting coins when you sell everything. I picked almost every plant on and along the road to Helgen, killed approximately a half dozen bandits, to include the one in the camp site south of the Guardian Stone near the road and the one guarding the Embershard Mine. Killed the wolves along the road to Helgen. Went with the Theifs Guardian Stone buff.\r\n\r\nInstall\r\nClick and drag to C:\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\Users\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\<User Logon Name>\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\Documents\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\my games\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\skyrim\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\saves",
  "categoryId": "43",
  "version": "",
  "author": "Mulgore",
  "createdUnix": "1364266144",
  "updatedUnix": "1364266144",
  "containsAdultContent": false,
  "uploadedBy": "MichaelChute",
  "primaryFile": null,
  "files": []
}