{
  "modId": 33943.0,
  "modName": "Borealis",
  "summary": "A massive gameplay overhaul, broken up into bits and pieces.",
  "descriptionHtml": "In the vast and complex Elder Scrolls games, small gameplay and balance changes can yield a cascade of side-effects through seemingly unrelated systems. In my experience modding Oblivion, it became progressively harder to maintain balance even between my own mods, since I assumed an unmodified game as the basis for each. Add mods by other authors, and all bets were off!\r\n\r\nSkyrim offers a clean slate, so I\\'m adopting a different basis: Borealis.\r\n\r\nBorealis is a family of mods. When designing each of them, my assumption is that you\\'re using them all. This doesn\\'t mean I\\'m throwing all external balance considerations out the window; but when I\\'m forced to choose between playing nice with an unknown multitude of other mods, versus creating the most cohesive and consistent experience possible within my own work, I will choose Borealis.\r\n\r\nYou can, of course, use some components and not others. That\\'s why they\\'re kept separate, instead of merged into a true overhaul: I can\\'t expect anyone to use nothing but my mods! If you have compatibility issues or simply prefer someone else\\'s take on a particular game aspect, it\\'s perfectly safe to skip over some Borealis components while using the rest; it just becomes your responsibility, not mine or another author\\'s, to ensure balance between the mods you\\'ve picked.\r\n\r\nSee the Nexus Readme tab for full details!\r\n\r\n- Big Parts -\r\nBlessings of the Nine\r\nRacial Adjustment\r\n\r\n- Small Parts -\r\nArmor Scaling, Falling Damage, Soul Values, Trade Rates.",
  "categoryId": "24",
  "version": "1.01a",
  "author": "tejon",
  "createdUnix": "1364284677",
  "updatedUnix": "1364354326",
  "containsAdultContent": false,
  "uploadedBy": "tejon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020489",
      "name": "Borealis",
      "version": "1.01a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "43",
      "fileName": "Borealis-33943-1-01a.7z",
      "uploadedUnix": "1364354326",
      "modVersion": "1.01a",
      "virusScanUrl": "https://www.virustotal.com/file/51d83d2d216e7acb35899f9d6b725e0c949913f366e2b0dbbdb3edf66addce9c/analysis/1407490502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Borealis-33943-1-01a.7z?fid=1000020489&ttl=1535811366&ri=8192&rs=8192&setec=d98fd6dfc702122c2f9d553f4f21bef4"
    }
  ]
}