{
  "modId": 33972.0,
  "modName": "Wicked Jester A Remake",
  "summary": "",
  "descriptionHtml": "Wicked jester is just a remake of Cicero that I enjoy and thought I\\'d share with you all here on Nexus..Hope you enjoy the new look and please ENDORSE!!!                                                                                                                                                    \\\"The jester lies dead. My final contract has been completed. Oh, how he laughed and laughed. Until he didn\\'t.\\\"                                                                                                                                                                                                                                                                                                                             \\\"So long since I worked my blade. So long since I saved a soul. But I am now Keeper. No longer a taker. I think back fondly on my hours with the jester. His laughter, his screams, his pitiful cries. And then, as the end drew near, his laughter once more. Merry in death as well as life. I was honored to know him.\\\"                                                                                                                                                                                          \\\"Silence! Deafening silence! In my head in my head in my head. It is the silence of death, the silence of the Void. Seeping into me, through the Mother. The silence is hatred. The silence is rage. The silence is love.\\\"                                                                                                                                                                                                                                                                                                                                    \\\"Laughing, laughing, laughing, laughing! It is the jester! A voice from the Void, to cheer poor Cicero! I accept your gift, dearest Night Mother. Thank you for my laughter. Thank you for my friend.\\\"                                                                                                                                                                                                                                                                                                                                                        \\\"I love the laughter, dearest Night Mother, but still I long to hear your voice. It\\'s not too late! Speak to me, my mother! Speak to me, that I may set things right! I can save the Sanctuary, I can save the Brotherhood! You can have the laughter! Take it back! An exchange, then? The laughter for your voice?\\\"                                                                                                                                                                                                                                                                                                                                                         \\\"Cicero is dead! Cicero is born! The laughter has filled me, filled me so very completely. I am the laughter. I am the jester. The soul that has served as my constant companion for so long has breached the veil of the Void finally and forever. It is now in me. It is me. The world has seen the last of Cicero the man. Behold Cicero, Fool of Hearts - laughter incarnate!\\\"                                                                                                                                                      ",
  "categoryId": "66",
  "version": "1.0",
  "author": "joshx336",
  "createdUnix": "1364329408",
  "updatedUnix": "1364329280",
  "containsAdultContent": false,
  "uploadedBy": "joshx336",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020409",
      "name": "Data",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "449",
      "fileName": "Data-33972-1-0.rar",
      "uploadedUnix": "1364329280",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ed1f926786328bea73adcd06acf9bfaa5e78fafda748d408e90dc77d27f38df3/analysis/1407489964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Data-33972-1-0.rar?fid=1000020409&ttl=1535811415&ri=8192&rs=8192&setec=3a1e9c342d3eb0f8f424be992ba2e5c2"
    }
  ]
}