{
  "modId": 33989.0,
  "modName": "General Stores Glue",
  "summary": "This mod adds the general stores chest to all inns and player homes in the game (not Hearthfire however). Upon renting an inn room, the GS chest appears, as soon as the time limit is up, the GS chest disappears. For player homes, it also overhauls the interiors of player homes and adds smithing amentities to all of them. Inns now have a dynamic inv",
  "descriptionHtml": "General Stores Glue\r\nVersion: 1.3\r\nDate: 3/27/2013\r\nCategory: Locations Vanilla\r\nRequires: General Stores (http://skyrim.nexusmods.com/mods/18340)\r\nAuthor(s): Cerest\r\nSource: http://skyrim.nexusmods.com/mods/33989/\r\n\r\nDescription\r\n===========\r\n\r\nIMPORTANT: You must download (http://skyrim.nexusmods.com/mods/18340) first! This mod fixes some .esm issues in General Stores and thus has a GeneralStores.esm in it as well. It should be backwards compatible with other General Stores mods.\r\n\r\nThis mod adds the general stores chest to all inns and player homes in the game.\r\n\r\nIt also overhauls the player houses by adding smithing amenities and \\\"unburden buttons\\\" ala the style of Functional Homes by gorey666. General Stores items are added to nearly every player-owned interior in the game including but not limited to, the College of Winterhold, the Dark Brotherhood Sanctuaries, Jorrvaskr, all player homes, Inns... etc. You simply have no idea where it will appear!\r\n\r\nInns now have a dynamic inventory system, whenever you rent an inn, you now own some of the consumable items! A Realistic-Inn like system will be introduced shortly. Upon renting an inn room, the GS chest appears and as soon as the time limit is up, the GS chest disappears. Food items and containers will now be considered yours to take! No item duplication in this mod, food items and container ownership is handled through a cleannnnnn script that leaves a nonexistent footprint in your game.\r\n\r\nThis also includes an unofficial hotfix by Mansarde. Note, I didn\\'t make the unofficial hotfix. Since the creator of the mod, Harvey, has been mysteriously banned from the Nexus, updates to General Stores have ceased to exist. There was a bug with regards to potions that has been fixed by another user (mansarde)...\r\n\r\nYou can find the link here,\r\nhttp://forums.nexusmods.com/index.php?/topic/694796-general-stores/page-26#entry7394256\r\n\r\nUnfortunately, after a few messages of the illegitimacy of Mediafire and how mansarde has disappeared as well... I uploaded the unofficial hotfix here. I messaged him (mansarde) a few weeks ago and haven\\'t gotten a response from him yet... if he doesn\\'t want his patch to be up here, I\\'ll remove it.\r\n\r\nThe only things used from Functional Homes (gorey666) are item placements and decorating guides. Harvey (General Stores), state under modification permissions:\r\n\\\"You are allowed to modify my files and release bug fixes or improve on the features so long as you credit me as the original creator.\\\"\r\n\r\nIf any of these authors wish for me to take the mod down... I will do so. Despite trying to get into contact with these authors, they have both mysteriously disappeared @_@\r\n\r\nA patch for the house you can obtain in Dragonborn is also available in the download, including adding Dragonborn items to the FORMID lists! No more book bugs! :D Please report any errors though!\r\n\r\n If you have Hearthfire or Dawnguard the corresponding mods can be found here from the author of General Stores himself, (http://skyrim.nexusmods.com/mods/25154) and (http://skyrim.nexusmods.com/mods/30221).\r\n\r\nThis is packaged in BAIN-Ready format, with an FOMOD script and has been cleaned with Tes5Edit (it\\'s amazing how many UDRs and ITMs a simple mod like this can have...)\r\n\r\n\r\n\r\nLocation\r\n========\r\nEVERYWHERE!\r\n\r\nDetails\r\n=======\r\nThe following locations have been modified...\r\n\r\nThroughly Overhauled:\r\nBreezehome\r\nVlindrel Hall\r\nDawnstar Sanctuary (Overhaul Player\\'s Room!)\r\nProudspire Manor\r\nHoneyside\r\nHjerim\r\n\r\nLightly Touched:\r\nSleeping Giant Inn\r\nWindpeak Inn\r\nCandlehearth Hall\r\nThe Bee and Barb\r\nOld Hroldan Inn\r\nJorrvaskr\r\nThe Frozen Hearth\r\nThe Hall of Attainment\r\nArch-mage\\'s Quarters\r\nFrostfruit Inn\r\nSilver-Blood Inn\r\nBraidwood Inn\r\nBannered Mare\r\nDead Man\\'s Drink\r\nVilemyr Inn\r\nWInking Skeever\r\nNightgate Inn\r\nFourshield\\'s Tavern\r\nMoorside Inn\r\nDark Brotherhood Sanctuary\r\n\r\nThe scripts I\\'ve written for this mod, with prefix, xGSxCRx are general use scripts that can be used by anyone to do crap. I narrated them so you can understand them and reverse engineer them -> source files are thus included. All the changes above are done with two scripts without changing quests/dialogues! :D\r\n\r\nInstall\r\n=======\r\nW/ NMM and other FOMOD compatible mod managers...\r\n1. An installer is included.\r\n\r\nW/ BAIN\r\n1. This mod is BAIN-ready, for those who don\\'t know what that is... know that I am very saddened :(\r\n\r\nManual\r\nWtf? Get yourself a mod manager.\r\n\r\nLoad Order\r\n=======\r\nCurrently, place these plugins after Realistic Lighting Overhaul if you use it. Otherwise, anywhere is fine.\r\n\r\nIn the Works...\r\n=======\r\nOverhaul Inns, make them look unique!\r\nTraveling alchemical/enchanting areas once you are an archmage.\r\nRealistic Inn Rental, a lightweight version of it.\r\nA skyproc patch to automatically add mod added items to formID lists, no more manually adding items to formID lists :(\r\nInclusion of my other mod, Reagents in Bulk into the Skyproc Patch.\r\n\r\nIncompatibility\r\n===============\r\nVanilla house mods will not work with this mod. Changes to inns however are light and should be compatible with plugins that make overhauls to inns. Perseid\\'s Realistic Inn Overhaul should be fine, though because of the way this mod works, during some inn rentals you may not have a chest appear since that mod randomly assigns beds to rent. This will be fixed in future versions.\r\n\r\nArthmoor\\'s Live Another Life mod doesn\\'t disable some of the markers added by Hearthfire, so do not use a player-home start on Live Another Life with this mod! You will encounter badddd clipping issues. I\\'ve tried to fix some of the issues by disabling haystacks, cobwebs and whatnot, but it\\'s up to LAL to disable the Hearthfire markers so that stuff looks right. Moreover, LAL is fine, just don\\'t do a player home start! :(\r\n\r\nRealistic Lighting Overhaul (Major City Interiors) has some weird wild edits (or maybe intentional edits...) that disrupt how the mod works. I\\'ve contacted the authors about it, but you can basically see it in the SS here, (http://s24.postimg.org/lz8h2pnx0/dirty_edit.jpg). Solution? Because this seems like a wild/intentional edit, a normal mod cleaning of RLO does not work. Simply load this mod after Realistic Lighting Overhaul (Realistic Lighting Overhaul - Major City Interiors.esp).\r\n\r\nKnown Issues or Bugs\r\n====================\r\nNone currently. Tell me if you see any flickering lights or collision issues... or weird sorting problems!\r\n\r\nHistory\r\n=======\r\n1.3, 4/20/2013 - Fixes Installer\r\n1.11, 4/20/2013 - General Stores Glue Release!\r\n1.0, 3/27/2013 - Initial release.\r\n\r\nContact\r\n=======\r\nYou can contact me here.\r\n\r\nCredits\r\n=======\r\nHarvey2112 - for General Stores\r\ngorey666 - for Functional Homes\r\nmansarde - for the Unofficial Patch to General Stores\r\nTes5Edit authors!\r\nWyre Bash authors!\r\n\r\nLicensing/Legal\r\n===============\r\nYou can do whatever you want with this mod, just give credit to everyone above.",
  "categoryId": "90",
  "version": "1.3",
  "author": "Cerest",
  "createdUnix": "1364367352",
  "updatedUnix": "1366594135",
  "containsAdultContent": false,
  "uploadedBy": "Cerest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025813",
      "name": "General Stores Glue",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "413",
      "fileName": "General Stores Glue-33989-1-3.zip",
      "uploadedUnix": "1366594135",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/f269ed64f74efb84cbadced8e979e214d9838dc5502ede3d6433b1e8f3dc6af6/analysis/1407533962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/General%20Stores%20Glue-33989-1-3.zip?fid=1000025813&ttl=1535811443&ri=8192&rs=8192&setec=770baf77b4c39d4f897219ae37fba73e"
    }
  ]
}