{
  "modId": 33987.0,
  "modName": "Stalneisti and Staleldur - AKA Shock and Fire Stalhrim Variants",
  "summary": "(Formerly titled \"Qolhrim and Yollhrim\")\r\nAdds two equipment sets to the game named Stalneisti and Staleldur. They are essentially the fire and shock equivalents of Stalhrim from the Dragonborn expansion. These armors and weapons have re-colored textures for their corresponding elements and elemental enchanting boosts like Stalhrim.",
  "descriptionHtml": "*This mod was formerly called Qolhrim and Yollhrim and so the images on the top still have the old names for armor and weapons.  \r\nUPDATE:\r\nV. 1.1 adds actual ore to mine for crafting the items as opposed to using salts. Staleldur ore can be found near Tel Mithryn behind the house and in the graveyard. Stalneisti can be found in the Throat of The World and High Hrothgar. The names of these sets were changed to match the icelandic origin of the word Stalhrim. NOTE: Make sure to uninstall my original file before installing the v. 1.1. In the future, I will upload regular updates that can just overwrite previous releases. \r\n\r\nYou are downloading a armor and weapon pack that contains my variations on the Stalhrim set from the second Skyrim DLC, Dragonborn. Stalneisti (Meaning Steel Spark in Icelandic) and Staleldur (Meaning Steel Fire in Icelandic) both come in Heavy and Light armor and includes all weapon types and arrows. Staleldur items have a light red tone, while Stalneisti has a deeper purple coloring. Similar to the Stalhrim set, these weapons and armor give a 25% enchanting boost for their assigned element. \r\nEx: Iron sword enchants for 40 fire dmg.\r\n     Staleldur Sword enchants 50 fire dmg. \r\n\r\n     Glass Armor enchants for 40 percent shock resist\r\n     Stalneisti enchants for 50 percent shock resist\r\nThis mod DOES NOT replace Stalhrim in the game. This is meant to compliment Stalhrim and make it seem like part of an elemental trio. The requirments for smithing these two sets are very similar to Stalhrim in that they require the same quest to be completed and they require Ebony Smithing. These items can be crafted and tempered using special ore I have placed in the world (see update notes at top). You can find Staleldur and Stalneisti items for crafting in Misc. section (still researching on how to create my own smithing category).    \r\nThis is my first real mod that i've put any real time into. I had lots of fun making this while exploring the abilities of the Creation Kit. Please don't hesitate to let me know what I can improve on especially in regards to my texturing work which I'm still a novice at. The download contains \"Stalneisti and Staleldur\".esp and a \"textures\" and \"meshes\" folder all inside a .7z folder. If you are not using NMM, just drag and drop these to files into your Skyrim Data directory and allow the files to merge if necessary.   Thanks!!!\r\n",
  "categoryId": "36",
  "version": "v1.1",
  "author": "pookyrune",
  "createdUnix": "1364364827",
  "updatedUnix": "1365731025",
  "containsAdultContent": false,
  "uploadedBy": "pookyrune",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020504",
      "name": "Qolhrim and Yollhrim",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "48611",
      "fileName": "Qolhrim and Yollhrim-33987-v1-0.7z",
      "uploadedUnix": "1364364793",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c4dcc8b31bb0cd0e96dd8559847fb1b5f35e6e7334599d562e2b71019e607379/analysis/1407490692/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Qolhrim%20and%20Yollhrim-33987-v1-0.7z?fid=1000020504&ttl=1535811440&ri=8192&rs=8192&setec=283bc4f965794cc5904c811e9fc3e83f"
    },
    {
      "fileId": "1000023895",
      "name": "Stalneisti and Staleldur v 1-1",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "49897",
      "fileName": "Stalneisti and Staleldur v 1-1-33987-v1-1.7z",
      "uploadedUnix": "1365731025",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/630d25b558afd711ae0ec4294834267c938c1b408f0c3162fa85d16e736ef01b/analysis/1407517806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stalneisti%20and%20Staleldur%20v%201-1-33987-v1-1.7z?fid=1000023895&ttl=1535811440&ri=8192&rs=8192&setec=d5833bcb888c73b84bab2649e4aebaa7"
    }
  ]
}