{
  "modId": 34004.0,
  "modName": "Miraak for Mages",
  "summary": "Miraak gear improved to (better) fit mage-style charecters.",
  "descriptionHtml": "Working your way through the Dragonborn main quest was fun for sure, but was it rewarding? The standard Miraak armor is very weak, and despite being mostly cloth, it is rather ineffective for a mage. This mod changes that.\n<br />\n<br />[b]All[/b] of Miraaks items are now catagorized as [i]Clothing[/i], so that the player can benefit from the Mage Armor perk.\n<br />\n<br />[b]Miraak[/b] (mask) - now grants 70 magicka and reduces the cooldown of shouts by 20%.\n<br />[b]Miraak's Robes[/b] - Tentacle explosion damage increased from 100 to 150. Now also reduce the cost of spells from [i]any school[/i] by 10%, and grant 100% increased magicka regeneration rate. The spell-absorbtion effect remains unchanged.\n<br />[b]Mirrak's Gloves[/b] - Now fortify the spell-absorbtion effect by 10%, up from 5%. In addition the gloves reduce the cost of Destruction spells by 25%.\n<br />[b]Miraak's Boots[/b] - Now fortify the spell-absorbtion effect by 10%, up from 5%. In addition the boots increase carry weight by 50 points.\n<br />\n<br />Note 1: The price of the items has been heavily increased, not because you should ever sell them, and not because any NPC can afford to pay the full price, but simply because it looks better - it makes the item feel more legendary when it has a huge value.\n<br />Note 2: [b]ALL[/b] versions of the Miraak mask are now identical, so as to not punish the player for completing the questline early (previously you could gain between 30-70 magicka versions, based on your level when you killed Miraak).\n<br />\n<br />\n<br />Feel free to edit this mod in any way to fit your own needs, and don't bother giving me if you release your own version.",
  "categoryId": "85",
  "version": "1.1",
  "author": "LittleBigPeach",
  "createdUnix": "1365024130",
  "updatedUnix": "1365086377",
  "containsAdultContent": false,
  "uploadedBy": "Littlebigpeach",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000022329",
      "name": "Miraak for Mages Fixed",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Miraak for Mages Fixed-34004-1-1.rar",
      "uploadedUnix": "1365086377",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d66f4d584c3efe6164864292a95574b2a6196bb9da3dbcc971a348247aa0b179/analysis/1407505621/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Miraak%20for%20Mages%20Fixed-34004-1-1.rar?fid=1000022329&ttl=1535811466&ri=8192&rs=8192&setec=01598f268fa809c8159027b7ea662297"
    }
  ]
}