{
  "modId": 34018.0,
  "modName": "RiB - Reagents in Bulk",
  "summary": "RiB - This mod distributes ingredients from Hearthfire, Dawnguard, and Dragonborn to the world of Skyrim in random fashions. This mod builds off of Expanded Apothecary Inventory (by argvminusone) and further adds DLC items. This mod is NOT modular, it requires all of the DLC.",
  "descriptionHtml": "Name: Reagents in Bulk\r\nVersion: 1.3\r\nDate: 3/28/2013\r\nCategory: Mercantiles\r\nRequirements: Dragonborn, Dawnguard, Hearthfire\r\nAuthor(s): Cerest\r\nSource: http://skyrim.nexusmods.com/mods/34018/\r\n\r\nDescription\r\n===========\r\nRiB - This mod distributes ingredients from Hearthfire, Dawnguard, and Dragonborn to the world of Skyrim in random fashions. This mod builds off of Expanded Apothecary Inventory (by argvminusone) and further adds DLC items. This mod is NOT modular, it requires that you have all of the DLC. \r\n\r\nIt categorizes all alchemists as one of the following: healers, experimenters, poisoners, and standard alchemists. Healers will stock more common ingredients (flowers and the like) , but less rare and uncommon ones, though they are still large amounts. Poisoners stock more uncommon items, typically stuff you can make poisons with, but less common and rare ingredients. Experimenters are more likely to hold items like Daedra Hearts and Dwarven Oil, though they typically have less uncommon and common ingredients due to their pursuit of these items. These values are balanced and don\\'t allow any exploit, you can\\'t find 20 daedra hearts on a single merchant (unless you are playing the Obese Module), though its guaranteed to find a crap-load of flowers.\r\n\r\nItems from Dawnguard, Hearthfire are distributed through Skyrim. Solstheim/Dragonborn items have not been added to Skyrim as the type of ingredients found there shouldn\\'t be easily found in Skyrim whatsoever, likewise items that shouldn\\'t be found in Solstheim shouldn\\'t be found either (currently the only ones I thought of were Briar Hearts and Jazbay Grapes @_@) . However, due to Solstheim\\'s proximity to Morrowind, expect Milore (the alchemist there) to stock more items like Dwarven Oil and Daedra Hearts. \r\n\r\nThese plugins have been cleaned with Tes5Edit.\r\n\r\nIt comes in 4 Flavors...\r\n\r\nLight -> Lore Friendly, Recommended. \r\nMedium -> Less Lore Friendly\r\nHeavy -> Surely Less Lore Friendly\r\nObese -> Paula Dean Lore Friendly\r\n\r\nUse only one, see the screenshots if you want a visual comparison, though keep in mind that those don\\'t say much as it changes every respawn. This is much more realistic as it stimulates how ingredients were procurred, randomly. There were no plantation systems in Skyrim, so ingredient supply was not constant, thus expect supply flunctuations.\r\n\r\nLocation\r\n========\r\nThe following merchants have been modified either by me or argvminusone\r\nNurelion - The White Phail @ Windhelm -  Experimenter\r\nBolar - Mauhulakh\\'s Longhouse @ Narzulbur - Poisoner\r\nBabette - Dark Brotherhood Sanctuary @ Various Locations - Poisoner\r\nZaria - Grave Concoctions @ Falkreath - Standard\r\nAngeline Morrard - Angeline\\'s Aromatics @ Solitude - Healer\r\nLami - Thaumaturgist\\'s Hut @ Morthal - Experimenter\r\nFrida - The Mortar and Pestle @ Dawnstar - Standard\r\nBothela - The Hag\\'s Cure @ Markarth - Standard\r\nMurbul - Burguk\\'s Longhouse @ Dushnikh Yal - Poison\r\nSharamph - Larak\\'s Longhouse @ Mor Khazgur - Poison\r\nElgrim - Elgrim\\'s Elixirs @ Riften - Experimenter\r\nHafjorg - Elgrim\\'s Elixirs @ Riften - Standard\r\nHerluin Lothaire - Ragged Flagon @ Riften - Poison\r\nArcadia - Arcadia\\'s Cauldron @ Whiterun - Healer\r\nOrgnar - Sleeping Giant Inn @ Riverwood - Standard Gimpy (4x less)\r\n\r\nDawnguard:\r\nFeran Sadri - Volkihar Keep - Experimenter\r\nFlorentius Baenius - Fort Dawnguard - Healer\r\n\r\nDragonborn:\r\nMilore Ienth - Her Home @ Raven Rock - Experimenter\r\n\r\nDetails\r\n=======\r\nI\\'m up for suggestions about what items should be sold by apothecaries and what shouldn\\'t @ Raven Rock and other locations. Some of these are obvious, like Briar Hearts (no Forsworn in Solstheim). But some aren\\'t. If you happen across an item that you think shouldn\\'t be sold comment on it and provide reasons why it shouldn\\'t.\r\n\r\nHuman hearts can sometimes be found at apothecaries... these were obviously received by \\\"donations to science.\\\"\r\n\r\nRemember that in Skyrim moon sugar is legal, skooma is not. Thus, you will find moon sugar stocked in Alchemist stores. Similiar as to how poppy seeds are legal, while opium is not in the US. However, Moon Sugar in Morrowind is illegal, therefore you will NOT find it stocked in Raven Rock.\r\n\r\ntmh47 pointed out that Juniper Berries should not be stocked in Raven Rock (limited bushes). Because of that, I removed it from Milore (and thus, the ingredient leveled list for the island)... though the single bush of juniper berries, whereever it is on the island, is still intact.\r\n\r\nThere are a number of ingredients that have Solsthiem equivalents while the Skyrim equivalents are not found on Solstheim, thus, Skyrim equivalents are removed from the island\\'s leveled list.\r\nCreep Cluster -> Ash Creep Cluster\r\nGrass Pod -> Ash Grass Pod\r\n\r\nInstall\r\n=======\r\nPlace your choice of RiB - Reagents In Bulk.esp into your data folder, with BAIN. Or whatever... you should see effects immediately. If not wait 48 hours for stuff to restock.\r\n\r\nUninstall\r\n=========\r\nRemove RiB - Reagents In Bulk.esp from your data folder. This mod has a clean uninstall and won\\'t leave behind any dirt.\r\n\r\nUpgrade\r\n=======\r\nIf and when upgrades occur, changes to the merchants inventory won\\'t be changed until it respawns.\r\n\r\nIncompatibility\r\n===============\r\nThis changes the inventory of many merchants. I suggest you use Wyre Bash\\'s bashed patch and/or Tes5Edit\\'s merged patch functions for maximum compatibility. It should be compatible with all mods provided you use a bashed and merged patch.\r\n\r\nI\\'ve modified a few leveled lists as well... so again, bashed patch and merged patch.\r\nI\\'ve modified the following level lists:\r\nLItemApothecaryIngredientsCommon75\r\nLItemApothecaryIngredientsUncommon75\r\nDLC2LItemIngredientsCommon\r\nDLC2LItemIngredientsUncommon\r\nDLC2LItemIngredientsRare\r\n\r\nKnown Issues or Bugs\r\n====================\r\nYou may notice that items are distributed in blocks of numbers... this is seen at the obese level especially. This is due to how ingredients were implemented. A solution would be to overhaul alchemist inventories, but that would make the mod less compatible...\r\n\r\nHistory\r\n=======\r\n1.3, 3/29/2013 - More Modifications!\r\n1.2, 3/29/2013 - Modified some values, noticed I put some stuff in the wrong Leveled List -_- Fixed.\r\n1.1, 3/28/2013 - Added Different Sizes.\r\n1.0, 3/27/2013 - Initial release.\r\n\r\nContact\r\n=======\r\nYou can contact me here.\r\n\r\nCredits\r\n=======\r\nargvminusone -  for the original plugin.\r\n\r\nLicensing/Legal\r\n===============\r\nYou can do whatever you want with this mod, just give credit to me and argvminusone.",
  "categoryId": "69",
  "version": "1.3",
  "author": "argvminusone Cerest",
  "createdUnix": "1364443228",
  "updatedUnix": "1364612286",
  "containsAdultContent": false,
  "uploadedBy": "Cerest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021051",
      "name": "RiB - Reagents In Bulk",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "832",
      "fileName": "RiB - Reagents In Bulk-34018-1-3.zip",
      "uploadedUnix": "1364612286",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/5581a6bce17778cce53ad6b1a307edce6e31db0c9e05a20a5627f1e9d19bb2bb/analysis/1407494826/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RiB%20-%20Reagents%20In%20Bulk-34018-1-3.zip?fid=1000021051&ttl=1535811489&ri=8192&rs=8192&setec=f2afe35582998ed487191bf18fe3bd1e"
    }
  ]
}