{
  "modId": 34023.0,
  "modName": "Male Elven Followers Compilation",
  "summary": "Adds 9 gorgeous Male Elven followers to the world of Skyrim.  Each one is unique and marriable.  They even come with short bio\\'s for those who want a little history to go with their new friend.",
  "descriptionHtml": "[size=48pt][color=yellow][b] Male Elven Followers Compilation Vol. 1 [/b][/color][/size]\r\n\r\n\r\n[b] Important Note [/b]\r\n\r\nApologies to those who had issues locating followers with the Vanilla Hair Version.  It contained a testing esp.  I have now uploaded the correct file for you to download.\r\n\r\n[color=yellow] Special thanks to Kidokit for bug testing [/color]\r\n\r\nI have also release versions with the followers marked as \\'Non Essential\\' (i.e. can die in combat).  A few other follower mods require this for compatibility (they will let you know on their relevant page).\r\n\r\n[b] Description [/b]\r\n\r\n9 goregous new elven followers await you in Skyrim.  There are 3 each of Dunmer, Bosmer and Altmer and all can be married.  There is also a very special guest hanging out in Jorrvaskr, but I\\'ll leave it to you to find out who....\r\n\r\nAll come fully clothed and with a suitable weapon for their class where appropriate.  They will level up to level 85, won\\'t impact on your ability to sneak, are marked as essential (so they won\\'\\'t die on you) and won\\'t rat you out to the guards if you swipe the trousers off someone.  They have been tested with AFT and should be suitable with other follower mods.  Let me know if you have any issues.\r\n\r\nBelow you will find simple installation instructions, including mods you will need to have installed before activation of the Apachii Hair version of this follower mod.\r\n\r\nBelow the installation instructions you will find a list of recommended mods, they are not essential however if you want your followers to look like the screen shots you may want to install them.  \r\n\r\nToward the bottom of the page you will find some breif bio\\'s.  This is to add a bit of depth to the characters if you enjoy roleplaying with fuller personalities.  It is however your playthrough so these gentlement can be whatever you want them to be, in which case you can simply ingnore the bio\\'s.\r\n\r\n\r\n---------------------------------------------------\r\n[b] Installation Instructions [/b]\r\n---------------------------------------------------\r\n\r\n1.  Required Files:\r\n\r\n    Skyrim.esm\r\n    Update.esm\r\n    ApachiiSkyHair.esm  (only for Apachii Hair version)\r\n    ApachiiSkyHairMale.esm  (only for Apachii Hair version)\r\n\r\nIf you do not currently have ApachiiSky Hair and AppachiiSkyHairMale installed, you can locate the files at:  http://skyrim.nexusmods.com/mods/10168\r\n\r\nThese files are *required* for the Apachii version to work properly (and thanks to Apachii for such excellent hair mods).  If you prefer using Vanilla Hair then you don\\'t need to worry about it.\r\n\r\nWhile this follower mod is compatible with Dawnguard, Hearthfire and Dragonborn, it will work perfectly fine without them.\r\n\r\n\r\n2.   Download and activate this mod with Nexus Mod manager (recommended)\r\n\r\n     ----or----\r\n\r\n     Download and install the esp file into your Skyrim\\\\data directory and place the the meshes and   textures in the appropriate folders.\r\n\r\n\r\n3.   Place the esp low in your mod order to avoid any conflicts.  Make sure it is below any mods that impact followers (i.e. AFT, UFO, EFF)\r\n\r\n4.   Launch Skyrim and enjoy the elven goodness!\r\n\r\n\r\n\r\n\r\n---------------------------------------------------\r\n[b] Recommended Mods [/b]\r\n---------------------------------------------------\r\n\r\n[b] Better Males [/b] by Chris57 and FavoredSoul have a range of mods availabe to improve the appearance of your male characters.  Be warned, some of these mods do contain adult content and should not be downoladed unless you are of an appropriate age to do so.\r\n\r\nTwo mods from their page were used in the screenshots of these followers\r\n\r\nFaces - Younger Faces Merged with Men by Geonox\r\n\r\nNudes - FavoredSoulMeshes - Flaccid  (there are several body sizes and chest hair levels to choose from when installing this mod, I have used a fuller figure but you may prefer one of the slimmer options if you aren\\'t into full on beefcakes!)\r\n\r\nBoth of these mods can be downloaded from here:  http://skyrim.nexusmods.com/mods/2488\r\n\r\n\r\n\r\n[b] Covereyes [/b] by mrLenski will provide the stunning eyes that you could just drown yourself in used in the screenshots.\r\nIt can be found here:  http://skyrim.nexusmods.com/mods/4869\r\n\r\n\r\n\r\n---------------------------------------------------\r\n[b] Follower Bios and location guide [/b]\r\n---------------------------------------------------\r\n\r\n\r\nVelis Indaram\tDark Elf\tDrunken Huntsman\t1 handed weapons  Destruction Magic  Light Armour\r\n\r\nVelis is a happy go lucky Dunmer who isn\\'t quick to anger but can hold his own in a fight when it counts.  He came to skyrim to attend the funeral of a friend killed in a skirmish between the Stormcloaks and Imperials.  He is saddened by the loss of life on both sides and belives there is nothing that can\\'t be solved by a chat and a cup of tea.  He is a hopeless romantic at heart and if you let him tag along with you, he is likely to spend half his time on the trip home picking mountain flowers to make a posie for you.  \r\n\r\n\r\nNovor Saren\tDark Elf\tNew Gnisis (upstairs)\tDestuction Magic\r\n\r\nNovor is a mage who dabbles in the \\'questionable \\'arts.  Some of his earlier experiments had him expelled from the College of Winterhold. Subsequently he moved to Windhelm and has taken up residence in the New Gnisis Corner club in an attempt to drink his sorrows away.  Novor is looking for a practical outlet for his skills (and an opportunity to try out some new ideas he has brewing away in that little head of his) and would jump at the chance to go investigating old crypts.\r\n\r\n\r\nDals Andavel\tDark Elf\tRagged Flaggon\t\t1 handed weapons  Archery  Light Armour\r\n\r\nDals\\' sullen expression hides a mind as sharp as a tack.  He is an excellent theif with graceful agility and cat like litheness.  Born into the Thieve Guild to parents who achieved some renown of their own, Dals knows how to play the game and play it well.  With such skilled \r\nhands and determined patience, he could make quite the companion.\r\n\r\n\r\nOrben\t\tWood Elf\tSleeping Giant Inn\t1 handed weapons  Archery  Light Armour\r\n\r\nOrben is an assasain sent from Cyrodiil to monitor recent developments within the Dark Brotherhood.  Orben himself adheres to a stict code of behaviours in the execturion of his duties, even if other members have abandoned such pretences.  He avoids alcohol when on assignment as he feels it dulls the senses and cheapens the lives of those he ends.  Clinical to a fault, he will serve you well in your adventures.\r\n\r\n\r\nEridor\t\tWood Elf\tDead Mans Drink\t\tArchery\t Light Armour\r\n\r\nEridor is a native of Skyrim and has become an exceptional hunter.  His survivalist skills have seen him travel from one end of Skyrim to the other in pursuit of the ultimate quarry, although what that is exactly he is not yet sure.  He loves the thrill of the chase and no doubt if you offer him the chance to tackle a dragon, you will have won his heart for ever.\r\n\r\n\r\nThador\t\tWood Elf\tAracnium\t\tDestruction Magic\r\n\r\nThador is a scholar currently studying classical texts in the Arcanium (College of Winterhold).  His goal is to reignite the Empire\\'s passion for magic and one day, hopefully reestablish the Mages Guild.  He dislikes necromancy and other forms of magic that corrupt life rather than serving to protect it in some way.  He does however consider flinging fireballs at bad guys a form of preservation...\r\n\r\n\r\nArmion\t\tHigh Elf\tSilver Blood Inn\tDestruction Magic  Conjuration\r\n\r\nAssigned to Markarth as part of the Thalmor Contingent, Armion is increasingly finding himself questioning the rights of the Thalom to persecute the Nords.  Considered a highly gifted individual, Armion was groomed for his role with the Thalmor from a young age but his time in Skyrim is causing him to question all that he has come to beleive.  This is not only due to the cruelty he has witnessed first hand, but also from the constant condemnations from his younger brother Halion, who defies both Armion and the Thalmor through flaunting his worship of Talos.\r\n\r\n\r\nHalion\t\tHigh Elf\tWinking Skeever\t\tDestruction MAgic  Heavy Armour\r\n\r\nYounger brother to Armion, Halion opposes the Thalmor and preaches the word of Talos.  His actions have brought shame to his family and instability in his life.  He constantly moves from one town to another to avoid capture, but freqently writes to his brother reporting the abuses of the Thalmor against the citizens of Skyrim.  Helion is very much alone in Skyrim, chased by the Thalmor and despised by the Stormcloaks who can\\'t tell one Altmer from another.  He could certainly use a good friend right about now.\r\n\r\n\r\nKael\t\tHigh Elf\tFrost Fruit Inn\t\tArcher  Light Armour\r\n\r\nKael likes the quite life and spends his time hunting for hides to sell to the local blacksmith.  He has become a valued resident of Rorikstead and in turn helps to make sure the farms and townsfolk are safe from predators.  He would give his life to protect the friends he has made, even if that means travelling long distances to help put and end to that which theatens his adopted home.\r\n\r\n\r\n---------------------------------------------------\r\nNotes\r\n---------------------------------------------------\r\n\r\nPlease do not host this mod anywhere except the Skyrim Nexus.\r\n\r\n\r\n",
  "categoryId": "66",
  "version": "1.2",
  "author": "UlanX",
  "createdUnix": "1364459424",
  "updatedUnix": "1364789593",
  "containsAdultContent": false,
  "uploadedBy": "UlanX",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020697",
      "name": "Male Elven Followers Volume 1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3092",
      "fileName": "Male Elven Followers Volume 1-34023-1-0.rar",
      "uploadedUnix": "1364457681",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bafe3bfb813ff83a355025826a863fb32bc09a1894190b1179ceab47aec408ea/analysis/1407492142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Male%20Elven%20Followers%20Volume%201-34023-1-0.rar?fid=1000020697&ttl=1535811496&ri=8192&rs=8192&setec=1f8045403fc63c1d8fe97cada4ea21c5"
    },
    {
      "fileId": "1000021037",
      "name": "Male Elven Followers Volume 1   -with Apachii Hair-",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3092",
      "fileName": "Male Elven Followers Volume 1   -with Apachii Hair--34023-1-1.rar",
      "uploadedUnix": "1364609583",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6b8c055df2728a47e1826e8f45040ea08a4a4f0464e36b7909acc45070d581ce/analysis/1407494705/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Male%20Elven%20Followers%20Volume%201%20%20%20-with%20Apachii%20Hair--34023-1-1.rar?fid=1000021037&ttl=1535811497&ri=8192&rs=8192&setec=88025d5ca6c34732f625cf925c9146aa"
    },
    {
      "fileId": "1000021555",
      "name": "Male Elven Followers Volume 1  -Vanilla Hair- ",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1470",
      "fileName": "Male Elven Follower  -Vanilla Hair- -34023-1-2.rar",
      "uploadedUnix": "1364774808",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/c85f1a8559826df592b26a77ef59b483af9a11ac926f1f6534522e85aed6a5c9/analysis/1407498664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Male%20Elven%20Follower%20%20-Vanilla%20Hair-%20-34023-1-2.rar?fid=1000021555&ttl=1535811498&ri=8192&rs=8192&setec=bc3a6bce6f00d375bcc9aaf08b41ac15"
    },
    {
      "fileId": "1000021559",
      "name": "Male Elven Followers Volume 1 Non Essential -Vanilla Hair-",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1470",
      "fileName": "Male Elven Followers Volume 1 Non Essential -Vanilla Hair--34023-1-2.rar",
      "uploadedUnix": "1364775043",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/ab308c86b9f0a312d4d794b73085f11566b1efcfb65c9f6dfe04a8ea4dee10bf/analysis/1407498686/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Male%20Elven%20Followers%20Volume%201%20Non%20Essential%20-Vanilla%20Hair--34023-1-2.rar?fid=1000021559&ttl=1535811498&ri=8192&rs=8192&setec=24cc04fd5bb6bf1aa072447b1c0ddedf"
    },
    {
      "fileId": "1000021598",
      "name": "Male Elven Followers Volume 1 Non Essential - Apachii Hair-",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3092",
      "fileName": "Male Elven Followers Volume 1 Non Essential - Apachii Hair--34023-1-3.rar",
      "uploadedUnix": "1364789593",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/4b339e14f58518f8de0557b60bdf31acc09d8a801660d78e1e75f5714bf2d7ce/analysis/1407499028/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Male%20Elven%20Followers%20Volume%201%20Non%20Essential%20-%20Apachii%20Hair--34023-1-3.rar?fid=1000021598&ttl=1535811498&ri=8192&rs=8192&setec=173b05dfad32f6d80c23c332b73cdde1"
    }
  ]
}