{
  "modId": 34033.0,
  "modName": "Status - deutsch",
  "summary": "Die deutsche Version von mannygts &#34;Status&#34;-Mod",
  "descriptionHtml": "[center]---[This is merely a translation of the Mod made from mannygt into German language. For an english version, go and use the original mod.]---[/center]\r<br />\r<br />\r<br />\r<br />\r<br />Ihr solltet schon immer mal Eure Statuswerte sehen, könnt im Spiel aber weder eine Übersicht finden, noch einen Einblick in eure zusätzlichen Fähigkeiten? Euch sind Charaktermenü, Statusmenü und Fähigkeiten-Menü zu umständlich? Oder ihr wolltet einfach mal einen übersichtlichen Blick auf eure Werte werfen?\r<br />Dafür ist dieser Mod perfekt. Er fügt in einem schnell übersichtlichen und einfach zu bedienenden Menü all Eure Statuswerte und zusätzliche Boni zu, sowie eure aktuellen Koordinaten und Umgebungs-Informationen. Ein wahres Muss für jeden, der einen schnellen Blick auf seinen Status werfen will, ohne sich erst einmal zurecht wurschteln zu müssen.\r<br />Dazu kommt, dass dieses Menü mit nahezu allen bekannten Mods kompatibel ist und euch so auch in fremden oder modifizierten Gebieten zuverlässige Informationen gibt. Das macht ihn zu einem extrem nützlichen Werkzeug für Modder und normale Spieler.\r<br />\r<br />-\r<br />\r<br />Dieser Mod wurde ursprünglich von mannygt erstellt. Meine Leistung war lediglich, ihn ins deutsche zu übersetzen.\r<br />\r<br />[color=orange]Diese Übersetzung funktioniert auch ohne Original-Mod und kann sofort installiert werdet. Wer dennoch den Original &#34;Status&#34;-Mod von mannygt sucht, kann diesen hier finden:\r<br />[url=http://skyrim.nexusmods.com/mods/32657]http://skyrim.nexusmods.com/mods/32657[/url]\r<br />\r<br />\r<br />[b]Weiterhin braucht dieser Mod auf jeden Fall SKSE und SkyUi Version 3.1 oder höher, um zu funktionieren. Beide Mods können hier heruntergeladen werden:[/b]\r<br />\r<br />SKSE: [url=http://skse.silverlock.org/]http://skse.silverlock.org/[/url]\r<br />SkyUI: [url=http://skyrim.nexusmods.com/mods/3863]http://skyrim.nexusmods.com/mods/3863[/url][/color]\r<br />\r<br />\r<br />-\r<br />\r<br />\r<br />[b]Installation:[/b]\r<br />1.) Die Dateien aus diesem Download in das Installationsverzeichnis (in der Regel steam&#92;steamapps&#92;common&#92;Skyrim&#92;Data) verschieben.\r<br />2.) Wenn Ihr gefragt werdet, ob ihr alte Dateien überschreiben wollt, drückt &#34;ja&#34;.\r<br />3.) Den Mod aktivieren.\r<br />4.) [b][color=red]WICHTIG:[/color][/b] (wenn ihr den Mod bereits in Englisch installiert habt): Einen CleanSave machen. Anschließend im Spiel die Konsole über die Taste &#34;^&#34; öffnen und die Befehle &#34;stopquest mannystatus&#34; und direkt danach &#34;startquest mannystatus&#34; eintippen. Dieser Schritt ist nötig, damit die neue Übersetzung auch ins Spiel geladen wird. Ansonsten bleibt entweder die englische Version erhalten, oder es kann sogar zu einem CTD kommen.\r<br />5.) Spaß haben :-)\r<br />\r<br />\r<br />-\r<br />\r<br />\r<br />Credits gehen insbesondere an mannygt für seinen genialen Mod und an alle, die ihm dabei geholfen haben.\r<br />\r<br />\r<br />\r<br />-\r<br />\r<br />\r<br />\r<br />[b]Schlusswort:\r<br />[b][b][size=3][color=orange]Abschließend möchte ich hier Werbung für meine neuste Übersetzung machen, nämlich für den wahnsinnig spannenden Mod &#34;[url=http://www.nexusmods.com/skyrim/mods/64283/?]Immersive Jewelry[/url]&#34;, den ich [url=http://www.nexusmods.com/skyrim/mods/66774/?]hier[/url] übersetzt habe.[/color][/size][/b][/b]\r<br />\r<br />\r<br />Diese Übersetzung dürfte komplett und fehlerfrei sein. Sollte ich aber unverhofft doch noch etwas übersehen haben, oder euch ein Fehler auffallen, dann teilt mir das bitte umgehend mit.\r<br />Bei weiteren Fragen, oder auch, wenn euch diesen Mod gefällt, hinterlasst mir doch einen Kommentar. Sollte euch meine Übersetzung gefallen, so klickt doch bitte einmal auf &#34;endorse me&#34;. Und hinterlasst auch mannygt ein &#34;endorse&#34;.[/b]",
  "categoryId": "82",
  "version": "1.9",
  "author": "mannygt und Verodor",
  "createdUnix": "1364485655",
  "updatedUnix": "1364485641",
  "containsAdultContent": false,
  "uploadedBy": "Verodor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000020748",
      "name": "Status - deutsch",
      "version": "1.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Status - deutsch-34033-1-9.rar",
      "uploadedUnix": "1364485641",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/5eb64cf966e972e5bc2f507a174a940fd68c5caae3d4e6e56540539f5861e79a/analysis/1407492495/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Status%20-%20deutsch-34033-1-9.rar?fid=1000020748&ttl=1535811510&ri=8192&rs=8192&setec=d2563ae495ea841abb3c6b8a82c3eb89"
    }
  ]
}