{
  "modId": 34077.0,
  "modName": "Tribunal to Archmage Robes",
  "summary": "This mod will change the enchantments of the Non-Hooded Archmage robes, aswell as change the appearance.",
  "descriptionHtml": "This mod will change the enchantments of the Non-Hooded Archmage robes, aswell as change the appearance.\r\n\r\nThis mod will also make it so the gauntlets actually are being used, as they now are placed alongside the AM-boots. \r\n\r\nI am really sorry, but the socalled hood-less robes are now light armour, and you ALERATIONISTS are not going to like that, but I thought it necesary since there is metal-plating on them. \r\n\r\n\r\nI alway though the AM-robes looked kinda ugly, and this mod will change that, BEWARE: You will still need the original textures, and those can be found here --> http://skyrim.nexusmods.com/mods/20077\r\n\r\n\r\n\r\nHOW TO INSTALL:\r\n\r\n- go get yourself something to drink, IN A GLASS (hydration is important)\r\n\r\n- now that you have gotten the drink you may drink half of it\r\n\r\n- then you may overview the mod page\r\n\r\n- and now take just a little sip of your drink thereafter\r\n\r\n- it is important to read the description, remember to do that\r\n\r\n- take just a little sip more, leaving about 1/4 left in the glass\r\n\r\n- now you may click the download with manager button\r\n\r\n- while it dowloads you may finish your drink\r\n\r\n- And at last you may sit yourself comfertably back in a chair with a straight back\r\n\r\n- now you may double-tap the mod in the manager\r\n\r\n- adjust your back meanwhile, not to make long term injury\r\n\r\n- and then click the \\\"OK\\\" button.\r\n\r\n- now you may go to the Tribunal Robes mod page, and click download\r\n\r\n- You may now maybe get some fruit, with Vitamine C, preffered something that doesn\\'t affect you should you have an allergi againt it, such is nasty\r\n\r\n- Then click the download button (manual)\r\n\r\n- While it is Downloading you may eat the fruit\r\n\r\n- When the Dornload is finished you simply move the meshes and textures to the data file, and click yes to all\r\n\r\n- CONGRATULATIONS, YOU HAVE NEW ROBES, ARCH MAGE!\r\n\r\n..... Just to play skyrim now ..... \r\n\r\n\r\n",
  "categoryId": "60",
  "version": "1wq",
  "author": "TheFlamingDaedra",
  "createdUnix": "1364574172",
  "updatedUnix": "1364754241",
  "containsAdultContent": false,
  "uploadedBy": "TheFlamingDaedra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021506",
      "name": "this",
      "version": "1wq",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "this-34077-1wq.rar",
      "uploadedUnix": "1364754241",
      "modVersion": "1wq",
      "virusScanUrl": "https://www.virustotal.com/file/35514bccf4bebf7665b2135f34414cc66d448c466fa3aaf404e3289665dc3044/analysis/1407498139/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/this-34077-1wq.rar?fid=1000021506&ttl=1535811591&ri=8192&rs=8192&setec=62d0850f6bb6ff896a10470bda931a82"
    }
  ]
}