{
  "modId": 34096.0,
  "modName": "Skinny Dipping",
  "summary": "Automatically undress when swimming or in custom locations. On undressing/becoming a werewolf drop a sack with your gear in it, with  options that decide how much gear to unequip (just unencumber/take all) & configure gear to leave alone. Choose to automatically dress again or not.  Roleplay returning to your gear or summon it with a spell.",
  "descriptionHtml": "[B][COLOR=#ea7500]Skinny Dipping  v2.6 by Qeezer\r\n______________________________________________[/COLOR][/B]\r\n\r\n[CENTER][COLOR=#E36C09][B]Now available:  \r\n[U][SIZE=5]Custom Locations![/SIZE][/U] [/B] [/COLOR]\r\n[COLOR=#d8d8d8]Custom locations allow you to set triggers to undress at locations where you aren\\'t swimming, \r\nlike beds, saunas, your entire hideout,  Warmaiden\\'s, the sun deck of your custom home ... \r\nAlso includes new option to drop a stash sack when transforming into a werewolf, plus numerous bugfixes. \r\nSee the readme for full details [/COLOR][/CENTER]\r\n\r\n[B][COLOR=#ea7500]--- O V E R V I E W ---[/COLOR][/B]\r\n\r\n[COLOR=#d8d8d8]This is a mod that addresses the immersion of … well … immersion.   Unless you are an Argonian with unfortunate positive buoyancy issues, this could be the mod for you.  Quite simply it takes care of getting you (un)dressed for swimming, and (optionally) dressing again when done.  [/COLOR]\r\n\r\n[COLOR=#FBD5B5][B]Please note: this mod does not add any nudity to your game.  What you wear under your armour remains entirely your own business.[/B][/COLOR]\r\n\r\n[COLOR=#d8d8d8]The issue for me with swimming in Skyrim is that it is somehow perfectly ok to swim when fully kitted out in full armour, long robes or whatever.  It isn’t realistic, you’d sink or get tangled up and your equipment would get ruined. \r\n\r\nNow more than just swimming:[LIST]\r\n [*]Create[/COLOR] [COLOR=#FAC08F][B]custom locations [/B][/COLOR][COLOR=#d8d8d8]to trigger undressing even when not swimming\r\n [*][/COLOR][COLOR=#FAC08F][B]Beast form[/B][/COLOR][COLOR=#d8d8d8] can cause you to drop a stash sack for your excess gear (or all of it if you prefer!)  Optionally re-equip automatically when returning to human.[/COLOR]\r\n[/LIST]\r\n\r\n[B][COLOR=#ea7500]--- D E T A I L S ---[/COLOR][/B]\r\n[COLOR=#d8d8d8]\r\n[U]Swimming:[/U]\r\n[LIST]\r\n[*]Worn (cosmetically visible) items are unequipped when you start swimming – unless they are a water-breathing item (duh!)\r\n[*]If removing items makes you over-weight (eg. because you had +carry-weight bonuses on items like backpacks etc) then your excess weight can be taken care of in one of two ways[SIZE=1](1)[/SIZE] :[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . [/SIZE][/COLOR][B]* [/B][COLOR=#d8d8d8]When you begin swimming a ‘ [/COLOR][COLOR=#FBD5B5][B]stash sack’[/B][/COLOR][COLOR=#d8d8d8] is placed at the water’s edge[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . [/SIZE][/COLOR][B]* [/B][COLOR=#d8d8d8]Heavy items removed from your inventory and put in the sack until you aren’t encumbered[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . [/SIZE][/COLOR][B]* [/B][COLOR=#d8d8d8]You can configure items that should never be unequipped.[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . [/SIZE][/COLOR][B]* [/B][COLOR=#d8d8d8]You can configure items that should never be removed from your inventory [/LIST][/COLOR][COLOR=#313131][SIZE=1]. . . . .  . . . . . . . . . . . . . . . . . . . . . . . .. . . . . [/SIZE][/COLOR][B][/B][I][COLOR=#d8d8d8] ~OR~[/COLOR][/I]\r\n[COLOR=#313131][SIZE=1][/SIZE][/COLOR][B][/B][I][COLOR=#d8d8d8](if you can’t be bothered with “realism” and all the sacks stuff and just want to get your kit off when you get wet…)[/COLOR][/I][COLOR=#d8d8d8][/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . [/SIZE][/COLOR][B]* [/B][COLOR=#d8d8d8]By (optionally) giving you a [/COLOR][COLOR=#FBD5B5][B]temporary buff[/B][/COLOR][COLOR=#d8d8d8][SIZE=1](2)[/SIZE] so you don’t find yourself suddenly and panic-inducingly encumbered, sinking slowly into the [/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . .[/SIZE][/COLOR][COLOR=#d8d8d8]cold abyss as the light of day recedes above you like a forgotten dream …[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . [/SIZE][/COLOR][B]* [/B][COLOR=#d8d8d8]Again, you can configure items that you don’t want to be unequipped.[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . [/SIZE][/COLOR][B]* [/B][COLOR=#d8d8d8]When you stop swimming you then can choose whether or not to automatically dress again.  [/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . [/SIZE][/COLOR][B]* [/B][COLOR=#d8d8d8]If you choose not to dress automatically and you are using the stash sack,  you can either [/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . . . . . . . . [/SIZE][/COLOR][B]-[/B][COLOR=#d8d8d8]return to the sack to get your kit when you are ready[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . . . . . . . . [/SIZE][/COLOR][B]-[/B][COLOR=#d8d8d8]use the [/COLOR][COLOR=#FBD5B5][B]summon spell [/B][/COLOR][COLOR=#d8d8d8]to call the sack to you.[/COLOR]\r\n[COLOR=#d8d8d8]All options are configured via the fabulous  [/COLOR][COLOR=#FBD5B5][B]MCM [/B][/COLOR][COLOR=#d8d8d8] (Mod Configuration Menu) .[/COLOR]\r\n\r\n[COLOR=#d8d8d8]____________________________________[/COLOR]\r\n[SIZE=1][1][COLOR=#d8d8d8] Way 3 being ‘surgery’ courtesy of Mongo the Orc and Glassy the Battleaxe.[/COLOR]\r\n[2][COLOR=#d8d8d8] the buff is removed when you leave the water, so if you choose not to dress automatically using this option, remember you may find yourself encumbered [/COLOR][/SIZE]\r\n\r\n\r\n[COLOR=#d8d8d8][U]Custom Locations:[/U]\r\nSet a location by\r\n[/COLOR][LIST]\r\n[*][COLOR=#d8d8d8]Position fix (coordinates plus a customisable trigger zone size and map marker)[/COLOR]\r\n[*][COLOR=#d8d8d8]Location name (best fit from location tag or cell name for interiors)[/COLOR]\r\n[*][COLOR=#d8d8d8]Keywords (keywords for your location presented as a pick list to choose from).[/COLOR]\r\n[/LIST]\r\n[COLOR=#d8d8d8]This feature is perfect for role playing in hideouts with ‘spa’ type pools or sun decks :P[/COLOR]\r\n[COLOR=#d8d8d8]If you use  [/COLOR][URL=http://skyrim.nexusmods.com/mods/34222][COLOR=#4f81bd][B][I]Wardrobe Manager[/I][/B][/COLOR][/URL][COLOR=#d8d8d8]  you can now have it\\'s Sleep and Swimming custom locations shared with Skinny Dipping.[/COLOR]\r\n\r\n[COLOR=#d8d8d8]\r\n[U]Beast form:[/U]\r\nWhen you change into beast form you can choose to drop a sack to put gear in.  You now won’t be encumbered when you revert to human form!  This feels much more realistic to play a werewolf (if you are like me and wonder where all your equipment is supposed to go!).  For ultimate realism v2.2 introduces the option to have ALL your equipment placed in the sack.  You can optionally choose to automatically dress again after werewolf mode.\r\n\r\n\r\n[/COLOR]\r\n\r\n\r\n[B][COLOR=#ea7500]--- R E Q U I R E M E N T S ---[/COLOR][/B]\r\n\r\n[URL=http://skse.silverlock.org/][B][I][COLOR=#4f81bd]SKSE[/COLOR][/I][/B] [/URL][COLOR=#d8d8d8](1.06.11)\r\nSkyrim 1.9.29.0.8 \r\nNB: Not tested with any DLC as I have none (cry)[/COLOR]\r\n\r\n\r\n[B][COLOR=#ea7500]--- I N S T A L L A T I O N - & -  U P G R A D I N G  ---[/COLOR][/B]\r\n\r\n[COLOR=#d8d8d8]1) Use Nexus Mod Manager.  Or you could just do it manually, but ain’t nobody got time foh that.[/COLOR]\r\n[COLOR=#d8d8d8]2) [/COLOR][COLOR=#FAC08F][B]This mod will defer installation for 10 seconds after you load a game.[/B][/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . .[/SIZE][/COLOR][COLOR=#d8d8d8]a. While installation is running the mod won’t do anything if you swim and you won’t be able to access the configuration sacks.[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . .[/SIZE][/COLOR][COLOR=#d8d8d8]b. The configuration takes about 1 minute to complete depending on inventory size.[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . .[/SIZE][/COLOR][COLOR=#d8d8d8]c. What it is doing is reviewing your inventory and sorting it by weight so it can rapidly make decisions about what to do[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . .[/SIZE][/COLOR][COLOR=#d8d8d8]when you begin swimming.[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . .[/SIZE][/COLOR][COLOR=#d8d8d8]d. The delay is because in testing with old savegames I found that certain mods (which I’d added since the old save) [/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . .[/SIZE][/COLOR][COLOR=#d8d8d8]didn’t play very nicely and/or created a lot of work for the VM and some mods fail to install if everyone fights it out the very second the game loads..[/COLOR]\r\n\r\n[COLOR=#d8d8d8]V2.0 has been designed and extensively tested to  upgrade from  previous versions as well as a fresh install.  Simply install with NMM and select the \\'upgrade\\' option.  V2.0 reworks how user settings are stored to ensure that the great number of user settings you might now have will be preserved for future upgrades.  You will lose your settings from 1.x when upgrading on this occasion due to its reliance on a mechanism that is currently \\'not peforming as described\\'.[/COLOR]\r\n\r\n\r\n[B][COLOR=#ea7500]--- C O N F I G U R I N G - I T E M - E X C L U S I O N S ---[/COLOR][/B]\r\n\r\n[B][COLOR=#ea7500]The sack summoning spell[/COLOR][/B]\r\n\r\n[COLOR=#d8d8d8]You are given a spell called “Summon Swimming Stash bag”.  This does several things:\r\n[LIST]\r\n[*]it summons your stash bag (obvs)\r\n[*]it summons two configuration sacks \r\n[*]it can also be used to dismiss the above if you are standing near to them \r\n[/LIST][/COLOR]\r\n[B][COLOR=#ea7500]\\'Sacred Receptacles of Determination\\' [/COLOR][/B]\r\n\r\n[COLOR=#d8d8d8]The receptacles (or \\\"configuration sacks\\\" in the common tongue)  allow you to choose which items you want to leave equipped (i.e. be completely ignored by this mod)  and which items you want left in your inventory.  You simply\r\n[LIST]\r\n[*]open the sack\r\n[*]drop the corresponding items into it\r\n[*]close the sack\r\n[*]get all your items returned\r\n[*]… and the mod now remembers to treat those items accordingly.[/LIST]To edit your choices, simply open the corresponding sack again.  The mod will “automagically” remove the items you previously told it to leave alone (oh, the irony) and add them to the sack’s inventory.  If you manually remove them, they are removed from the exclusions list, and again when you close the sack any items you left in are remembered and returned to you.[/COLOR]\r\n\r\n[COLOR=#d8d8d8]Once you’ve got this set up you’ll rarely want to mess around with configuration until you get new gear.[/COLOR]\r\n\r\n[COLOR=#d8d8d8]NB – while the reset / setup process is running you won’t be able to access the configuration sacks.  The setup process takes about a minute depending on your inventory size.  A ‘lock’ message will be shown during this time, and you may also see it if you are really quick about opening a configuration sack immediately after using the other.[/COLOR]\r\n\r\n\r\n[B][COLOR=#ea7500]--- S T A B I L I T Y , - P E R F O R M A N C E - & - D E S I G N - N O T E S - ---[/COLOR][/B]\r\n\r\n[COLOR=#d8d8d8]I’ve designed this mod so that it has a minimal amount of work to do when you enter the water, and you don’t have to mess around doing anything manually.  In early development I found that trying to remove items one at a time was really slow, and if you tried to do anything extra like check their weight or magic effects it became ridiculously slow, so I built in several ways to speed the process along, such as the mod tries to remove the fewest & heaviest items it can to get you under your carry weight cap.[/COLOR]\r\n\r\n\r\n\r\n[B][COLOR=#ea7500]--- C O M P A T I B I L I T Y ---[/COLOR][/B]\r\n\r\n[COLOR=#d8d8d8]Any mod that automatically changes your outfit may fight with this mod.  Some items have equip code as part of them: for example one of my characters uses the awesomely excellent  [/COLOR][URL=http://skyrim.nexusmods.com/mods/13133][COLOR=#4f81bd][I] Dwemer Goggles[/I][/COLOR][/URL][COLOR=#d8d8d8], and to prevent the on-equip pop up message appearing when I automatically dress after swimming I have simply chosen to leave them equipped by configuring them as a ‘never unequip’ exception.  [/COLOR][COLOR=#4f81bd][B][I] [/I][/B][/COLOR][URL=http://forums.nexusmods.com/index.php?app=members&module=messaging&section=send&do=form&fromMemberID=227598][COLOR=#4f81bd][B][I]Let me know[/I][/B][/COLOR][/URL][COLOR=#d8d8d8] if you have any concerns, issues and experiences  around compatibility and at the very least I’ll add your advice to this documentation, but I am more likely to also try to address the issue.[/COLOR]\r\n\r\n\r\n\r\n[B][COLOR=#ea7500]--- F U T U R E ---\r\n\r\nPlanned in next release:[/COLOR][/B]\r\n[COLOR=#d8d8d8][I]NB this is just my current work flow, and may change depending on how time consuming / feasible fixes turn out to be.  [/I]\r\n[LIST][*] Please see this mods  \\\"Bugs and troubleshooting\\\" forum for the latest.  I keep more up to date notes of my progress and plans there.[/COLOR]\r\n[/LIST]\r\n[B][COLOR=#ea7500]On the \\\"wish list\\\" but schedule to be confirmed:[/COLOR][/B][COLOR=#d8d8d8]\r\n[LIST]\r\n[*]Tricky bugfixes:[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . [/SIZE][/COLOR][COLOR=#d8d8d8] - There is a game / script bug that means the magic effects of certain items won\\'t apply when kit is re-equipped.  I am currently testing a[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . . .[/SIZE][/COLOR][COLOR=#d8d8d8]workaround for this issue.[/COLOR]\r\n[*][COLOR=#d8d8d8]Option to replace sack with custom backpack (i.e. whatever backpack you have equipped or in inventory)\r\n[*]Maintain hotkey settings while unequipping / requipping\r\n[*]Various related mini-quest ideas TBC\r\n[/LIST][/COLOR]\r\n\r\n[B][COLOR=#ea7500]--- M Y - O T H E R - M O D S ---[/COLOR][/B]\r\n[COLOR=#d8d8d8]This is my first mod ever :P  Straight off writing this one I made [/COLOR][URL=http://skyrim.nexusmods.com/mods/34222][COLOR=#4f81bd][B][I]Wardrobe Manager[/I][/B][/COLOR][/URL][COLOR=#d8d8d8] that allows followers to automatically equip situation-appropriate outfits,  so now both you AND your friends can enjoy swimming au naturel :P [/COLOR]\r\n\r\n\r\n[COLOR=#d8d8d8] [/COLOR]\r\n[B][COLOR=#ea7500]--- G E N E R A L - F A Q ---[/COLOR][/B]\r\n\r\n[B][COLOR=#ea7500]Where do the bags go?[/COLOR][/B]\r\n[COLOR=#d8d8d8]They are dismissed ‘off scene’ to a safe place.  Any unique / crafted / charged items are preserved, so you don’t need to worry about the mod trying to fob you off with a cheap knockoff when you finish swimming.[/COLOR]\r\n\r\n[B][COLOR=#ea7500]How come it never removes my stack of a thousand healing / waterbreathing potions?[/COLOR][/B]\r\n[COLOR=#d8d8d8]Well I figured these might come in handy, what with you swimming underwater and all, so the mod ignores healing and waterbreathing potions by design.  You’re welcome :P[/COLOR]\r\n\r\n[COLOR=#d8d8d8] [/COLOR][B][COLOR=#ea7500]I lost my hotkey / favourites setting [/COLOR]L[/B]\r\n[COLOR=#d8d8d8]Normal vanilla rules are if you remove a favourite item you’ll lose the hotkey & favourite settings.  I recommend that you configure this mod to leave favourite items in your inventory (so unfortunately that’s still one time you have to re-favourite and hotkey them).   I spent a lot of time looking into this and it may be possible but certainly doesn’t seem technically trivial, so this is on my ‘Future’ wish list.[/COLOR]\r\n\r\n[COLOR=#d8d8d8] [/COLOR][B][COLOR=#ea7500]Is this compatible with mod X?[/COLOR][/B]\r\n[COLOR=#d8d8d8]This has been play-tested with a large number of mods installed with no logged errors or in-game issues, so I’m confident it is “playing nice” but [/COLOR][URL=http://skyrim.nexusmods.com/articles/1099/][B][I][COLOR=#4f81bd]see my mod list[/COLOR][/I][/B][/URL][COLOR=#d8d8d8] for more details.  [/COLOR]\r\n\r\n\r\n[B][COLOR=#ea7500]Can I make a suggestion ?[/COLOR][/B]\r\n[COLOR=#d8d8d8]Yes please! :P Any ideas for improvements and new features are welcomed. ([/COLOR][URL=http://forums.nexusmods.com/index.php?app=members&module=messaging&section=send&do=form&fromMemberID=227598][B][I][COLOR=#4f81bd]Contact me[/COLOR][/I][/B][/URL][COLOR=#d8d8d8]). I will always try to prioritise bug fixes or improvements to existing functionality, but sometimes new stuff is more interesting ;-)[/COLOR]\r\n\r\n\r\n[B][COLOR=#ea7500]Can I use your mod in my mod?[/COLOR][/B]\r\n[COLOR=#d8d8d8]Probably :P I\\'m open to the idea but I\\'d need to be sure we could handle things like users getting the latest version and support where needed. I\\'d be willing to make modifications to this mod to sit within another mod, but I don\\'t currently want to share dev ownership of this mod (specifically I don\\'t want to end up supporting multiple flavours of this mod with drastically different code that may have been altered by someone else, and I\\'d like to ensure that all implementations of the mod benefit from any changes.). Have your people call my people ... \r\n\r\n[/COLOR]\r\n[B][COLOR=#ea7500]I am an Argonian with UPBI – can your mod help me?[/COLOR][/B]\r\n[COLOR=#d8d8d8]Sorry, no.  You need my other mod “Dwemer boots of Sinking”[/COLOR]\r\n\r\n[B][COLOR=#ea7500]Isn\\'t it cheating / unbalancing to provide a way of storing lots of heavy gear  \\\"somewhere\\\"?[/COLOR][/B]\r\n[COLOR=#d8d8d8]Methinks you may not have actually tried to do this in-game.  If so and it [I]does[/I] work, please let me know so I can break it again :P[/COLOR]\r\n[B]\r\n[COLOR=#ea7500]How does the stash sack know where to go?[/COLOR][/B]\r\n\r\n[COLOR=#d8d8d8]The logic is basically to chuck it behind you a few meters where “behind” is based on the direction you were facing the instant you started swimming.  If you jump off a really steep cliff it is possible your sack will end up somewhere back on top or half way down or even under water at the bottom.  If you can’t reach or find it, just use the summon spell.  If you’ve identified a particular location or circumstance where it gets it wrong [/COLOR][URL=http://forums.nexusmods.com/index.php?app=members&module=messaging&section=send&do=form&fromMemberID=227598][COLOR=#4f81bd][B][I]let me know[/I][/B][/COLOR][/URL][COLOR=#d8d8d8].\r\n[/COLOR]\r\n\r\n\r\n[B][COLOR=#ea7500]--- T R O U B L E S H O O T I N G - - F A Q ---[/COLOR][/B]\r\n\r\n[B][COLOR=#ea7500]I think I have found a bug / something has gone wrong can you help?[/COLOR][/B]\r\n[COLOR=#d8d8d8]First off, try selecting \\\"disable mod\\\" via the config menu as it a) attempts to end the undress mode normally multiple times and b) if this fails it retrieves the players items via a different mechanism and c) clears some essential flags.  If your items haven\\'t been returned to you,  and for some reason the summon spell isn\\'t working, simply toggling this option on and off in the menu may be enough to sort things out for you without going for a full reset (but please do report any issues that get you into this position).[/COLOR]\r\n\r\n[COLOR=#d8d8d8]Next you could try using the reset option from the configuration menu.  This clears out all the behind the scenes stuff but specifically doesn’t touch the contents of the Stash Bag or your configuration settings, so is ‘safe’ to use.[/COLOR]\r\n\r\n[COLOR=#d8d8d8]If this doesn’t work,  there is some additional ‘first time’ installation code that can be turned back on by entering the following at the console.[/COLOR]\r\n\r\n[CODE]Set SkinnyDippingver to 0[/CODE]\r\n\r\n[COLOR=#d8d8d8]Run the reset function again, and it will run as though it were a first-time install.[/COLOR]\r\n\r\n\r\n[COLOR=#d8d8d8]If the problem is something you can easily describe, is easily repeatable etc  it may be sufficient to just [/COLOR][URL=http://forums.nexusmods.com/index.php?app=members&module=messaging&section=send&do=form&fromMemberID=227598][B][I][COLOR=#4f81bd]tell me[/COLOR][/I][/B][/URL][COLOR=#d8d8d8] what happened.[/COLOR]\r\n\r\n[COLOR=#d8d8d8]If it isn\\'t an easily described issue the first thing to do is to turn on script debug logging so you can capture the logs and send them on to me for analysis.\r\n\r\n[/COLOR]\r\n[COLOR=#d8d8d8]Turn on papyrus logging for ALL scripting (not just this mod). [/COLOR]\r\n\r\n[COLOR=#d8d8d8]a)  You must enable logging via the <Skyrim saved games folder>\\\\skyrim.ini file for this feature to take effect [/COLOR]  \r\n\r\n[COLOR=#d8d8d8]b)   Take a copy of your skyrim.ini [/COLOR] \r\n\r\n[COLOR=#d8d8d8]c) Edit Skyrim.ini using notepad or similar. There should be a [Papyrus] heading, but you can add this if it is missing. Set the following options to 1 as shown or just add these three lines under [Papyrus] if they are missing: [/COLOR] \r\n\r\n[CODE]Add bEnableLogging=1[/CODE][COLOR=#313131] [/COLOR]\r\n[CODE]bEnableTrace=1[/CODE]\r\n[CODE]bLoadDebugInformation=1[/CODE]\r\n\r\n\r\n[COLOR=#d8d8d8]For best performance set these values back to zero when done.\r\nLogs are output to [/COLOR] [CODE]<Skyrim saved games folder>\\\\Logs\\\\Script[/CODE] [COLOR=#d8d8d8]and the latest log is called Papyrus.0.Log[/COLOR]\r\n\r\n\r\n[B][COLOR=#ea7500]My equipment has been removed but I can’t summon the sack[/COLOR][/B]\r\n[COLOR=#d8d8d8]Something has gone wrong during installation. Because of this, I’d recommend attempting to reinstall the mod (ideally going back to a save prior to installation, enabling logging per the instructions above, and installing the mod. If it doesn’t work, get in touch and I’ll take a look at the logs with you).\r\nIf you do want to play on with the current save, your equipment should be safely stored in the stash sack.  Try toggling the “disable mod” option on and off in the configuration menu.  If that doesn’t work:[/COLOR]\r\n[COLOR=#d8d8d8]1. Type \\\"[CODE]sqv skinnydipping[/CODE]\\\" into the console, you should see a line that reads \\\"[CODE]Swimming sack -> (XX004341)[/CODE].[/COLOR]\r\n[COLOR=#d8d8d8]2. Type in \\\"[CODE]prid XX004341[/CODE]\\\" (replacing XX with the two numbers you seen on your screen).[/COLOR]\r\n[COLOR=#d8d8d8]3. Enter \\\"[CODE]moveto player[/CODE]\\\"[/COLOR]\r\n[COLOR=#d8d8d8]4. Try accessing the sack, if it doesn\\'t work you may need to go back to the console and ...[/COLOR]\r\n[COLOR=#d8d8d8]5. Enter \\\"[CODE]disable[/CODE]\\\" (the sack should disappear)[/COLOR]\r\n[COLOR=#d8d8d8]6. Enter \\\"[CODE]enable[/CODE]\\\" (the sack reappears)[/COLOR]\r\n\r\n\r\n\r\n\r\n\r\n[B][COLOR=#ea7500]--- L E G A L - S T U F F - - - D I S C L A I M E R , L I C E N S I N G - E T C ---[/COLOR][/B]\r\n\r\n[COLOR=#d8d8d8]I make no warranty that this mod will not break your game, and you use it at your own risk. Make a save game before you install the mod, and if you experience issues you can always uninstall the mod and revert to your save game. I also make no warranty that it will work at all. Having said all that every reasonable effort has been made to design and test this mod.\r\nI reserve the copyright to this mod, all intellectual property and development rights.\r\nYou are free to install this mod for use with Skyrim. You may not use this mod nor any portion of its design or code without my express permission and only then if my work is credited. (Seriously, just ask :) )\r\nThis mod is uploaded to the Nexus (skryim.nexusmods.com) exclusively, and should not be uploaded and made available anywhere else so long as that site is active. This restriction is in recognition of my appreciation of the excellent Nexus Mod Manager tool and website. If you see this mod available for download from anywhere else please let me know. ([/COLOR][URL=http://forums.nexusmods.com/index.php?app=members&module=messaging&section=send&do=form&fromMemberID=227598][B][I][COLOR=#4f81bd]Contact me[/COLOR][/I][/B][/URL][COLOR=#d8d8d8]).\r\nI reserve the right to change these terms and conditions at any time. Damn I sound so official. I should write this stuff for a living, seriously I\\'m just making this up off the top of my head and it\\'s like I\\'m channelling Denny Crane here.\r\nI acknowledge all rights and trademarks owned by Bethesda\\'s with respect to their product Skyrim, with thanks for making their game open to the modding community.\r\nIf you are still reading this section, I hope you found it less boring than writing it was :P\r\n\r\n[/COLOR]\r\n\r\n\r\n\r\n\r\n\r\n\r\n[COLOR=#d8d8d8] \r\n[/COLOR]",
  "categoryId": "78",
  "version": "2.6",
  "author": "Qeezer",
  "createdUnix": "1364811110",
  "updatedUnix": "1368215286",
  "containsAdultContent": false,
  "uploadedBy": "qeezer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021646",
      "name": "Skinny Dipping 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "411",
      "fileName": "Skinny Dipping-34096-1-0.7z",
      "uploadedUnix": "1364810701",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7ca300c4c1ffd21423c45d443d07a819f98b60dc8830c7affa20b42fe72f85e6/analysis/1407499373/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skinny%20Dipping-34096-1-0.7z?fid=1000021646&ttl=1535811620&ri=8192&rs=8192&setec=edaab6ef3afbd1bbc10b4fdc8c4eac58"
    },
    {
      "fileId": "1000021901",
      "name": "Skinny Dipping 1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "748",
      "fileName": "Skinny Dipping-34096-1-1.7z",
      "uploadedUnix": "1364910925",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b1ca4edc2761b5094d6476cc8e018c3b64f3c81f4c69fc91d9698a753287257a/analysis/1407501726/",
      "changelogHtml": " New feature:  option to disable or enable the mod.   <br/> \n New feature:  when using &#39;auto equip&#39; after swimming, you can set the delay before dressing <br/> \n + Improved functionality: installation has some improvements to make it more robust when other scripts are consuming a lot of resources, and given me an addtional option to help support any failed installs.   <br/> \n Improved Functionality: threading improved, meaning faster and more reliable experience when rapidly alternating between swimming and not swimming <br/> \n  BugfixES: auto-equip option was making you dress shortly after you started swimming;Auto-equip option prevented certain items being unequipped.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skinny%20Dipping-34096-1-1.7z?fid=1000021901&ttl=1535811620&ri=8192&rs=8192&setec=079db93048c5538d2d9d20d9c5ae41ec"
    },
    {
      "fileId": "1000023623",
      "name": "Skinny Dipping 2-0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "417",
      "fileName": "Skinny Dipping 2-0-34096-2-0.7z",
      "uploadedUnix": "1365616826",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/61afbbce431ac5d103647a65e0dc92da0c3e22a789ceb1745bb7335384ea6d50/analysis/1407515788/",
      "changelogHtml": " New feature: custom locations <br/> \n New feature: use a stash sack when transforming into a werewolf <br/> \n Bugfixes (see readme for details) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skinny%20Dipping%202-0-34096-2-0.7z?fid=1000023623&ttl=1535811621&ri=8192&rs=8192&setec=3de0aed7c9145f983b4fa6a7d4dc3448"
    },
    {
      "fileId": "1000023937",
      "name": "Skinny Dipping 2-1",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "425",
      "fileName": "Skinny Dipping 2-1-34096-2-1.7z",
      "uploadedUnix": "1365767829",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/741d3b457d043aceb400a4ea32fe9d4e6b3226a980f3359b223a207867e41130/analysis/1407518048/",
      "changelogHtml": " minor bugfix where those playing with healratemult at 0 found this mod blocked that value <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skinny%20Dipping%202-1-34096-2-1.7z?fid=1000023937&ttl=1535811621&ri=8192&rs=8192&setec=248e9e850247d2e1c445f52a2d2d6122"
    },
    {
      "fileId": "1000026117",
      "name": "Skinny Dipping 2-2",
      "version": "2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "475",
      "fileName": "Skinny Dipping 2-2-34096-2-2.7z",
      "uploadedUnix": "1366756306",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/ba1dfd636b8af6bc7caf4881d95553f62db5bb55b09b53d7a3b05cf6485844b0/analysis/1407536771/",
      "changelogHtml": " Other: option changes via the menu are now logged to debug output to help with troubleshooting <br/> \n Other: added a functional test that the stash sack is accessible to the unequip code, which fails over to using &#39;inventory&#39; mode if not.  <br/> \n Bugfix: Radius conversion for position fixes have been corrected: new position fixes will have a smaller (and correct) radius.  Existing position zone sizes are unnaffected by this change. <br/> \n Bugfix: Some logic relatiing to optimising the speed of checks while in an external position fix trigger zone wasn&#39;t quite right.  Would only have affected you if you had a lot of external position fixes. <br/> \n Bugfix: the way I&#39;d implemented the beast form sack drop could interfere with some werewolf mods that relied on modifying the base beast form power.  I&#39;ve now used a method that doesn&#39;t change any vanilla components. <br/> \n New option:If you use Wardrobe Manager,  Skinny Dipping can be updated with a copy of any Sleep or  Swimming postition fixes added in that mod.  They will appear in the list of position fixes within this mod as normal.  This is a one way, non destructive  <br/> \n New option:  I&#39;ve added (back) an option for hardcore werewolves to have ALL their kit placed in their stash sack.  I&#39;m having a lot of fun playing with this option enabled :P  Thanks to \"raginglycanthrope\" for the feedback.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skinny%20Dipping%202-2-34096-2-2.7z?fid=1000026117&ttl=1535811621&ri=8192&rs=8192&setec=c5852759c659b3986b29651153e64bc8"
    },
    {
      "fileId": "1000026541",
      "name": "Skinny Dipping 2-3",
      "version": "2.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "429",
      "fileName": "Skinny Dipping 2-3-34096-2-3.7z",
      "uploadedUnix": "1366972123",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/d9766aa215560d3e5d266667b275a117a0e87b8b1f010809b7aeb8720f53a36a/analysis/1407542645/",
      "changelogHtml": " Bugfix:  the code for the spell to dismiss the sacks was accidently omitted from the previous release <br/> \n New feature: periodically check for and attempt to remove projectiles sticking into the player <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skinny%20Dipping%202-3-34096-2-3.7z?fid=1000026541&ttl=1535811622&ri=8192&rs=8192&setec=81944730ba06c9290b73b4926dad0641"
    },
    {
      "fileId": "1000026619",
      "name": "Skinny Dipping 2-4",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "482",
      "fileName": "Skinny Dipping 2-4-34096-2-4.7z",
      "uploadedUnix": "1367010173",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/3f4df8913c397e313b44aff037e56077ca79bcb1b4daa50ea80ff887d9167ece/analysis/1407543443/",
      "changelogHtml": " * if you add custom locations the current location is reassessed and you will undress immediately if you are already within the new trigger area. <br/> \n * if you delete custom locations either individually and delete the currently active trigger, you will cease the current undress mode (and your autoequip and delay preferences etc are still honoured).  <br/> \n *  if housekeeping or reset are called, they will now terminate the current &#39;undress&#39; mode, and retrieve all items from the sack. <br/> \n * similarly if you disable the mod via the config menu, you will leave the undress state and your items are retrieved. <br/> \n * if Wardrobe Manager updates custom locations, the current location is immediately reassessed to see if we are now standing in a trigger location. <br/> \n *  selecting \"disable mod\" will now also be a useful troubleshooting option for retrieving your gear and resetting a few key flags in the event of difficulties. <br/> \n Bugfix: a bug with matching locations where they weren&#39;t matching under some circumstances. <br/> \n Bugfix: disabling the mod via the config menu wasn&#39;t disabling very reliably <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skinny%20Dipping%202-4-34096-2-4.7z?fid=1000026619&ttl=1535811622&ri=8192&rs=8192&setec=5e5e74a44a23fa99063160e4832381a4"
    },
    {
      "fileId": "1000026938",
      "name": "Skinny Dipping 2-5",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "435",
      "fileName": "Skinny Dipping 2-5-34096-2-5.7z",
      "uploadedUnix": "1367174015",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/d296274b259b6f04ccc2c6e6f2dd783e5085dd86fd290522be73bc65c8bde3b6/analysis/1407545823/",
      "changelogHtml": " Bugfix:  custom enchanted waterbreathing items not getting consistently handled as expected. I&#39;ve implemented a completely new  mechanism which is also much faster.  <br/> \n Bugfix: rings and circlets: were being ignored by the unequip code. If you currently WANT to keep wearing jewlery when undressed, you may simply configure them as a &#39;don&#39;t unequip&#39; exception. <br/> \n Bugfix:  autoequip may have run before you&#39;d finished swimming in v2.4 due to elements of the custom location code not being correctly turned off in swim mode. <br/> \n Bugfix:  the position-fix review popup was showing interiors other than the one we were inside. <br/> \n New: a much faster & more cosmeticaly pleasing unequip (especially for &#39;sack&#39; mode) <br/> \n New: Auto-equip Improvements: for the case where you briefly cease swimming and resume within the auto-equip delay SD should now leave you undressed. If you resume swimming after it begins dressing you, it will now undress you again.  <br/> \n New: Werewolf fans now have an option to automatically dress after returning to human after being in beast form. The option is separate from the swimming re-equip option if you want one and not the other. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skinny%20Dipping%202-5-34096-2-5.7z?fid=1000026938&ttl=1535811623&ri=8192&rs=8192&setec=992e8fc0075e3b2847fe8b319b88cd1b"
    },
    {
      "fileId": "1000029197",
      "name": "Skinny Dipping 2-6",
      "version": "2.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "439",
      "fileName": "Skinny Dipping 2-6-34096-2-6.zip",
      "uploadedUnix": "1368215286",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/9a4db668080916e60430f7df99f9d76ad6cd59d749489a556b7df9082781e02c/analysis/1407564205/",
      "changelogHtml": " -bugfix - while standing inside a position fix (coordinates) area, the &#39;start&#39; routine was being incorrectly called periodically. <br/> \n -bugfix - deleting a postion fix (coordinates) while standing in it could leave it &#39;active&#39;  until you left the old trigger area. <br/> \n - bugfix -  sack ownership was (sometimes) not to set correctly (showed \"steal\" warning for the sacks) <br/> \n -bugfix: the new equip code wasn&#39;t correctly activated for new installs meaning they would have been using the original (slower) method.  New installs of 2.6 do not have this issue, and upgrades of installs prior to 2.6 will now be corrected.  <br/> \n - bugfix: certain items could prevent the new equip code holding details for all equipped items resulting in excess items being unequipped using the original (slower) method. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skinny%20Dipping%202-6-34096-2-6.zip?fid=1000029197&ttl=1535811624&ri=8192&rs=8192&setec=f194d01dbf874075122d10449f9f56e2"
    }
  ]
}