{
  "modId": 34103.0,
  "modName": "Mage Craft - Scrolls",
  "summary": "A small and simple mod to allow crafting of all standard scrolls that exist in the vanilla game.\r\nThis is to promote scroll usage which I believe is generally overlooked in the vanilla game play experience.",
  "descriptionHtml": "2013/3/29\r\nScrolls in the vanilla game of Skyrim are largely overlooked, and I feel that\\'s a shame because in my idea of sword and magic fantasies magic scrolls play a vital role.\r\n\r\nThe role of scrolls, I feel, should be a backup plan for a rainy day. Whether purchased from a mage for your adventures or sat at a table to scribe one yourself, when you are all out of magicka and potions with an enemy breathing down your neck, you can pull out that scroll you saved up and make quick work of said enemy (or heal yourself). In my 300+ hours of playtime (yes, it\\'s too much, I know) I have never used a scroll. I am always \\\"saving\\\" it for another time because I don\\'t know when will be the next time I stumble across another scroll.\r\n\r\nHaving said that, I started scouring for mods on the nexus which do exactly that, and there are a few. However, they don\\'t feel exactly right for me and so I set out to make one for myself.\r\n\r\nIn order to make this mod, I had looked at two existing (and brilliant) mods:\r\n[url=http://skyrim.nexusmods.com/mods/20583]Scrollcraft[/url] by Corsair101.\r\n[url=http://skyrim.nexusmods.com/mods/33950#]Extended Scroll Crafting[/url] by mackam08 aka IrksomeBadger.\r\n\r\nBorrowing ideas from these two mods, I have made a mod of my own. However, I\\'d like to state that I did make this mod from scratch using the CK, so it is my work, and I would not resort to stealing other people\\'s hard work. \r\n\r\nSince both the mods didn\\'t feel like it was for me, I had made one that\\'s more or less in the middle ground. I like the idea of using silver dust to make scrolls as it resembles imbuing magicka into the scroll, but on top of that, I have added the requirement of using quill and inkwell during the process. Using a spell tome to scribe a scroll makes sense because it allows scroll making for spells that you do not know yet, thus increasing the incentive to actually make scrolls. However, I have also added the ability to craft from spells that you already know without the tomes.\r\n\r\nAt the moment you will need to make scrolls at the tanning rack, I have yet to figure out how to make a separate station.\r\n\r\nYou will need: Roll of paper, quill, inkwell, silver dust, and the spell tome of the scroll you want to make. However, quill, inkwell and the spell tome are NOT consumed during crafting process.\r\n\r\nYou can make roll of paper using: a ruined book (of each type, there are two) or 2 linen wraps.\r\nYou can make silver dust using: a silver ore for 5 silver dusts or a silver ingot for 10 silver dusts. This is done at the smelter.\r\n\r\nIf you have learned the spell already, you can craft the scroll without the tome.\r\n\r\nCurrently, you can craft all the standard scrolls in the vanilla game.\r\n\r\nNote that none of the recipe will show up for crafting unless you have all the needed components to craft a scroll. This is to prevent cluttering of menu.\r\n\r\nOh, I also added a recipe to turn mammoth tusk to powered mammoth tusk (ingredient), because, you know, why not.\r\n\r\n\r\n=Future=\r\nHope to added more to this mod to include staves making.\r\nMake an actual table for the scroll crafting.",
  "categoryId": "93",
  "version": "1.0",
  "author": "Kalpa2004",
  "createdUnix": "1364611744",
  "updatedUnix": "1364611882",
  "containsAdultContent": false,
  "uploadedBy": "kalpa2004",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021047",
      "name": "MageCraft",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "MageCraft-34103-1-0.7z",
      "uploadedUnix": "1364611882",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/20c8dab905f9522962b9d5730f5eecc2555464263a1717d4cc14286c2f49eef3/analysis/1407494822/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MageCraft-34103-1-0.7z?fid=1000021047&ttl=1535811646&ri=8192&rs=8192&setec=1eb57267609d90f304f98cbc546a149c"
    }
  ]
}