{
  "modId": 34121.0,
  "modName": "Tropical equipment - Less Armor More Shields",
  "summary": "The Tropical Skyrim mod is amazing, but citizens of Skyrim dress way too warmly for the tropics. \r\nThis is a first step to remedy that. ",
  "descriptionHtml": "The Tropical Skyrim mod is amazing, but citizens of Skyrim dress way too warmly for the tropics. \r\n\r\nThis is a first step to remedy that.   And, coincidentally, to make NPCs more varied.\r\n\r\nAt the moment, this mod changes Bandits, Imperial soldiers, and (to a lesser extent) Stormcloak soldiers... I\\\\\\'m working on extending it. \r\n\r\n\r\nUPDATE (v002):  Now makes Imperial soldiers have a chance of spawning without a helmet, without gauntlets, or without a helmet and gauntlets.  This also has the added benefit of making the soldiers a bit more varied.  This update also has a much more subtle change to Stormcloak soldiers, where some (very few) will not have a helmet or gauntlets.  Anyone have any issues with the way the Imperials are?  If they\\'re working fine, I will do the equivalent to Stormcloaks.  After that, probably guards... \r\n\r\n\r\n\r\n\r\n-----------\r\n\r\n\r\n\r\n\r\nDescription: \r\nThis has only been done for a few factions in the current version, but will soon be extended to other factions and NPCs. \r\nIncreases the chance of shields.  Why?  Because Googling for tropical warriors turned up lots of pictures of people holding shields and wearing nothing but loincloths.\r\nDramatically decreases the chance of helmets and gauntlets. \r\nLight armor sets sometimes include clothes instead of armor (ONLY FOR BANDITS; Imperials always wear Imperial armor). \r\nBandits no longer wear suits of leather armor... Leather is not especially suited for summer weather.  \r\nHeavy armor sets sometimes include light armor (boss characters are less likely to wear full suits of iron armor in the blistering heat of the tropics). \r\nI did this by altering leveled item lists, so any mod that alters leveled item lists will conflict with this, but this should not conflict with anything else.  The old version 001 only alters bandits, so if you don\\'t want stormcloaks/imperials changed, use that file.\r\nNote that this DOES nerf these npcs a bit... I\\'m trying to think of a way to get around that a little, but this mod is meant for roleplaying/immersion purposes, and the focus is simply on making things look a little less sweaty.  This also means there\\'s less armor to loot.\r\n\r\nRecommended mods: \r\nTropical Skyrim ( http://skyrim.nexusmods.com/mods/33017 ) \r\n\r\nRequired mods:\r\nNone (though your version of Skyrim needs to be up-to-date)\r\nIf you want it to look like the image, you need Tropical Skyrim.  This mod WILL work without Tropical Skyrim, however. \r\n\r\nI am extremely open to suggestions. \r\nHarsh criticism is welcome, but needlessly rude comments are not.",
  "categoryId": "78",
  "version": "2",
  "author": "friedscience",
  "createdUnix": "1364646632",
  "updatedUnix": "1364654515",
  "containsAdultContent": false,
  "uploadedBy": "rgalexander",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021139",
      "name": "LessArmorMoreShields v001 bandits only",
      "version": "001",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "LessArmorMoreShields v001 bandits only-34121-001.zip",
      "uploadedUnix": "1364646572",
      "modVersion": "001",
      "virusScanUrl": "https://www.virustotal.com/file/bb39d85d32131d1960d6c212485420a4830fa6e3849459e297b8b825258546b6/analysis/1407495501/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LessArmorMoreShields%20v001%20bandits%20only-34121-001.zip?fid=1000021139&ttl=1535811688&ri=8192&rs=8192&setec=452687de43bf19f8074df4197fcdd812"
    },
    {
      "fileId": "1000021168",
      "name": "LessArmorMoreShields v002 bandits plus imperials and a bit of stormcloak",
      "version": "002",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "LessArmorMoreShields v002 bandits plus imperials and a bit of stormcloak-34121-002.zip",
      "uploadedUnix": "1364654515",
      "modVersion": "002",
      "virusScanUrl": "https://www.virustotal.com/file/a71468c8c212b06976edbff78879ed19f725277463d4fea6c444e2371fb5064a/analysis/1407495728/",
      "changelogHtml": " Now makes Imperial soldiers have a chance of spawning without a helmet, without gauntlets, or without a helmet and gauntlets.  This also has the added benefit of making the soldiers a bit more varied. <br/> \n This update also has a much more subtle change to Stormcloak soldiers, where some (very few) will not have a helmet or gauntlets. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LessArmorMoreShields%20v002%20bandits%20plus%20imperials%20and%20a%20bit%20of%20stormcloak-34121-002.zip?fid=1000021168&ttl=1535811689&ri=8192&rs=8192&setec=76fe7f60e7376ec963f23ec69dfa3331"
    }
  ]
}