{
  "modId": 34125.0,
  "modName": "Nueva Hibernalia",
  "summary": "/Este mod revisa la ciudad de Hibernalia y el colegio de magos, reconstruyendo y añadiendo edificios (como por ejemplo el puente y las almenas de la entrada), comerciantes, salas, aulas y alumnos, guardias y comerciantes. \r\n/This mod reviews the Hibernalia city and the college of wizards, rebuilding and adding buildings (such as the bridge and the",
  "descriptionHtml": "/Este mod revisa la ciudad de Hibernalia y el colegio de magos, reconstruyendo y añadiendo edificios (como por ejemplo el puente y las almenas de la entrada), comerciantes, salas, aulas y alumnos, guardias y comerciantes. \r\n/de tal manera ahora Hibernalia es más entretenida y alberga más vida. \r\n/Se recomienda encarecidamente su instalación tras haber terminado la historia principal del juego, llevando además así una línea argumental realista. \r\n/Curiosidades: \r\n-lo que está al final de la calle de mercaderes es un reloj de sol (si no nevara tanto funcionaría sin reparos) \r\n-la reparación del pudridero es lógica dado que en él ya ha habido bastantes muertos, en vez de tapiarlo he decidido reutilizarlo como sala de conjuración, aunque si te fijas bien, todas las entradas tapiadas son solo puertas secretas. \r\n-cada almena (de las 4 que hay) tienen en la parte de arriba un aula especializada. La sala de encantamiento ha sido magnificada, pues al ser el principal motor económico del colegio debía ser un sitio esencial del colegio. \r\n-dado que nunca he utilizado la sala del archimago, he decidido transformarla en el principal aula de estudio que tiene como centro un trono de oro como el de Odín. \r\n-al existir un comedor enorme no es necesario comer en las almenas. \r\n-al haberse vuelto el colegio de magos, fuente de muchas miradas, por tener al dobakin como archimago, vi lógico aumentar la seguridad poniendo tanto guardias (cuyo cuartel esta dentro de la casa del jarl), como una buena muralla que rodeara toda la ciudad. \r\nUn saludo. \r\n----------------------------------------------------------------------------------------------------------------------------\r\n/This mod reviews the Hibernalia city and the college of wizards, rebuilding and adding buildings (such as the bridge and the battlements of the entrance), traders, halls, classrooms and students, guards and merchants. \r\n/so far Hibernalia is more entertaining and has more life. \r\n/Installation is strongly recommended after completing the main story of the game, also carrying a storyline realistic. ",
  "categoryId": "53",
  "version": "30del3del2013",
  "author": "Tije Goblinight",
  "createdUnix": "1364655805",
  "updatedUnix": "1364655117",
  "containsAdultContent": false,
  "uploadedBy": "tije",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021174",
      "name": "Nueva Hibernalia -2esp",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Nueva Hibernalia -2esp-34125-.zip",
      "uploadedUnix": "1364655117",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/8f6a6ef7d619d44d366084cc358773dd8ad89bf5b569c74f2d2841f00a0b8444/analysis/1407495729/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nueva%20Hibernalia%20-2esp-34125-.zip?fid=1000021174&ttl=1535811696&ri=8192&rs=8192&setec=13b74a0cf9f21dcf86f85d800a6acb0b"
    }
  ]
}