{
  "modId": 34133.0,
  "modName": "Taliesin Falls player home",
  "summary": "Mid-sized player home near Whiterun with bonuses: auto-storage chests, all Standing Stones around the outdoor pool, unique outdoor lighting and decorations.",
  "descriptionHtml": "[color=#64beef][b][size=7]Taliesin Falls[/color][/b][/size]\r\n\r\n[color=#64beef][b][size=6]Short Description[/color][/b][/size]\r\nMid-sized player home near Whiterun with bonuses: auto-storage chests, all Standing Stones around the outdoor pool, unique outdoor lighting and decorations.\r\n\r\n[color=#64beef][b][size=6]Comments Note[/color][/b][/size]\r\nThe folks at Nexus suggested that mod authors start making use of the discussions forum to separate comments out into categories. So I\\'m trying to be a good citizen and follow their lead. Unfortunately, that means the comments that people had already posted are now gone (no way to move them to the new threads). Anyway, from now on use the Forums tab to access the comment boards, and if you don\\'t mind, try to post to them appropriately.\r\n\r\n[color=#64beef][b][size=6]Longer Description[/color][/b][/size]\r\nI\\'ve always been a fan of Mattcm919\\'s Dragon Falls Manor, since I felt it was a nice \\\"Goldilocks\\\" home: not too big, not too small, just right. Plus the exterior location was awesome. One day I was stealing something from Thane Bryling\\'s house (hey, it was just a job), and thought to myself, this would make a nice house to mod. So I decided to do that for my first mod. When I opened up the Bryling house interior in the Creation Kit, I realized that this was the same house that was the base for Dragon Falls Manor--awesome place to start! So with Thane Bryling\\'s interior as my starting point, I created this house.\r\n\r\nIf you liked Dragon Falls Manor\\'s interior, you\\'ll probably like this one. But some things about DFM bugged me, so I changed them when I made my own. I didn\\'t like the load door to get into the basement (waste of time), so you won\\'t find one here. I also found the alchemy/enchanting area upstairs to be too tight (kept getting blocked in by followers), so I put it on the main floor with more open access. I kept follower beds up in the room that used to be the alchemy/enchanting area. Obviously, I made many other changes to the original Bryling house.\r\n\r\nI don\\'t know much of anything yet about creating custom textures and items, so I decided to only use stuff in the basic Skyrim pack. But to make things unique, I changed the scale of a lot of items to make them into decorations, or unique plants, etc. I also used some things (like driftwood) that might not normally be considered decorative. Basically, I tried to think outside of the box while staying inside of it. The decorating theme tends to favor a magic user who isn\\'t afraid to get \\\"hand-to-hand\\\" when necessary, but I think most non-dark-and-scary Dragonborns will like it.\r\n\r\nOne thing I added was Manilla Turtle\\'s Automatic Item Storage (which he kindly made available for modders). This is the handiest thing for easy crafting, which I tend to do a lot of. You can store items in chests, and then access those items from the appropriate crafting station, without having to load up and unload again (it does this for you). So there\\'s a chest near the basement smelter that will store all of your ore (won\\'t even ask you, it\\'ll just do it); a chest by the forge that will store crafting goods and be accessible from the forge, tanning rack, wheel and bench; a satchel by the alchemy station for ingredients; a strong box by the enchanting station for soul gems; a pantry by the cooking pot for food; and a bookshelf right by the pantry for books/scrolls/etc. I modified the item list for the crafting station storage slightly to include gems and linen, since many of the custom armors/clothes use linen. I didn\\'t change the name of the MTAutoStorage.esm file, so if you\\'re already using this for your other houses, it MAY cause problems. But I\\'m pretty sure all that will happen, (unless you\\'ve modded the file yourself) is that if you overwrite your existing MTAutoStorage.esm file, it\\'ll now store linens and gems in your crafting storage chest. If you don\\'t overwrite, it won\\'t.\r\n\r\nI didn\\'t want to put it in the same location as Dragon Falls Manor, so I put it between Riverwood and Whiterun. I know, I know, this is a popular location, but there\\'s a good reason for that: it\\'s easy for players to get to when first starting, and it\\'s purdy. No quest is attached to this, and the house is unlocked. For some, this might be too easy, but hey, it\\'s my first mod. At least the interior and exterior are fully navmeshed, so your follower shouldn\\'t have any trouble...following. Also, it\\'s been cleaned with TES5Edit.\r\n\r\n[color=#64beef][b][size=6]Installation[/color][/b][/size]\r\nNexus Mod Manager:\r\nDownload with manager, activate it. Make sure BOTH taliesin_falls.esp and MTAutoStorage.esm are checked in the plugins list to load correctly.\r\nManually:\r\nDownload, unpack the archive. Move the taliesin_falls.esp and MTAutoStorage.esm files to your data folder, and the script files to your data/script folder. Make sure to check BOTH taliesin_falls.esp and MTAutoStorage.esm in your game loader of choice.\r\n\r\n[color=#64beef][b][size=6]Uninstall[/color][/b][/size]\r\nSave outside of the cell being uninstalled.\r\n\r\n1. Use NMM\r\n2. Delete the scripts (they all start with NC1), .esp and .esm files from your Skyrim/Data folder.\r\n\r\n[color=#64beef][b][size=6]Load Order[/color][/b][/size]\r\nShouldn\\'t matter. A house is a house...\r\n\r\n[color=#64beef][b][size=6]Conflicting mods[/color][/b][/size]\r\nAny mod that alters the location where the house is at: along the river between Riverwood and Whiterun, by the falls.\r\n[list][*] LC-Become King of Riverhelm mod: definite conflict, since it takes up most of the falls area\r\n[*] Riverside Lodge: conflicts, located in same cell (almost the same spot, even)\r\n[*] Rayeks End: haven\\'t checked yet, but I\\'m guessing it\\'ll conflict based on the map image the author posted\r\n[/list]\r\nIt\\'s not in the same location as Ranger Ridge, so that should be ok.\r\n\r\n[color=#64beef][b][size=6]Thanks[/color][/b][/size]\r\n[list]\r\n[*]Bethesda (obligatory bow)\r\n[*]Mattcm919, for the original [url=http://skyrim.nexusmods.com/mods/10901]Dragon Falls Manor[/url]\r\n[*]Manilla Turtle, for [url=http://skyrim.nexusmods.com/mods/12468]Automatic Item Storage[/url]\r\n[/list]\r\n\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "Doc Norm",
  "createdUnix": "1364660974",
  "updatedUnix": "1364659027",
  "containsAdultContent": false,
  "uploadedBy": "clarkne",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021208",
      "name": "Taliesin Falls",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "140",
      "fileName": "Taliesin Falls-34133-1-0.7z",
      "uploadedUnix": "1364659027",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/30707624b886c199b722185a0bc7d6ed9f57cd86b709a67ab3acc4d39786d4e8/analysis/1407495905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Taliesin%20Falls-34133-1-0.7z?fid=1000021208&ttl=1535811704&ri=8192&rs=8192&setec=3b221914a8a97a18c15c51dfed8ac16c"
    }
  ]
}