{
  "modId": 34140.0,
  "modName": "Kurzboegen und Recycling_Waffen-und Pfeilschmelzen_Deutsch",
  "summary": "Mit dieser Mod werden dem Spiel Kurzboegen hinzugefuegt. Diese haben aber eine schnellere Angriffsgeschwindigkeit und weniger Schaden.\r\nAusserdem koennen Waffen und Pfeile bei Schmelzhuetten zu Barren eingeschmolzen werden.\r\n",
  "descriptionHtml": "Mit dieser Mod werden dem Spiel Kurzbögen hinzugefügt. Diese benutzen die Modelle der Vanilla-Langbögen, haben aber eine schnellere Angriffsgeschwindigkeit und weniger Schaden. Außerdem haben sie kürzere reichweiten.\r\nDie Kurzbögen sind dazu gedacht, im offenen Kampf eingesetzt zu werden. Langbögen werden ja sowieso eher für Überraschungsangriffe benutzt. Mit diesen Kurzbögen wird also die Möglichkeit des offenen Kampfes mit Bögen hergestellt. Die Kurzbögen sind trotz ihrer höheren Geschwindigkeit immer noch balanced und lore-friendly. Die optimale Waffe für Bogenschützen, die, wenn sie entdeckt wurden, trotzdem nicht zu Einhandwaffen wechseln wollen. \r\nAlle \\\"realen\\\" Kurzbögen können bei Schmieden geschmiedet werden, sobald man die Schmiedefertigkeit freigeschaltet hat.\r\nHier eine Liste der Kurzbögen und ihren Vanilla-Langbögen:\r\nAlter Nordkurzbogen (Von Alter Nordbogen)\r\nKurzbogen (Langbogen)\r\nJagdkurzbogen (Jagdbogen)\r\nZwergenkurzbogen (Zwergenbogen)\r\nElfenkurzbogen (Elfenbogen)\r\nFalmerkurzbogen (Falmerbogen)\r\nVulkanglaskurzbogen (Vulkanglasbogen)\r\nEbenerzkurzbogen (Ebenerzbogen)\r\nDaedrischer Kurzbogen (Daedrischer Bogen)\r\n...und noch dazu den \\\"Beschworenen Kurzbogen\\\". Der kann nicht geschmiedet werden, also findet ihn!\r\n(Falls ihr ihn nicht findet, gebt in der Konsole (^) ein: \\\"help kurzbogen\\\" und sucht nach einem beschworenen)\r\n\r\nWaffen und Pfeile können mit dieser Mod bei Schmelzhütten zu Barren eingeschmolzen werden.\r\nMan bekommt aber nur die Barren, die bei der Herstellung hauptbestandteil waren.\r\nSo kann man zum Beispiel ein Stahlgroßschwert einschmelzen und bekommt dadurch 4 Stahlbarren.\r\nDa man zum Schmieden eines solchen 4 Stahlbarren, Eisenbarren und Leder braucht, stimmt das Gameplay und macht die Mod lore-friendly.\r\nMan kann Stahl-, Eisen-, Elfen-, Vulkanglas-, Zwergen- Daedra- und Ebenerzwaffen einschmelzen.\r\n\r\nAußerdem kann man bei Gerbständern 2 Drachenknochen zu 1 Drachenschuppe\r\n                                                    und 2 Drachenschuppen zu 1 Drachenknochen umwandeln.\r\n\r\nDas Pfeilschmelzen ist sehr nützlich - gerade für nicht-Bogenschützen, die sonst für Pfeile keine Verwendung hätten. So kann man Stahl-, Eisen-, Elfen-, Vulkanglas-, Zwergen-, Daedra- und Ebenerzpfeile einschmelzen:\r\n10 Pfeile -> 1 Barren\r\n50 Pfeile -> 5 Barren\r\n100 Pfeile -> 10 Barren\r\nMit dieser Mod können Nichtbogenschützen die gesammelten Pfeile einschmelzen und wiederverwenden - ein nützliches Recycling.\r\n\r\nDas ist meine erste Mod. Schreibt also bitte, ob sie funktioniert.. Enjoy! PLEASE ENDORSE :)\r\n\r\n\r\nP.S. Bitte fügt Bilder hinzu. Danke!",
  "categoryId": "55",
  "version": "1.0",
  "author": "GGinddi",
  "createdUnix": "1364663978",
  "updatedUnix": "1364663564",
  "containsAdultContent": false,
  "uploadedBy": "GGinddi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021238",
      "name": "Kurzboegen und Waffenschmelzen 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Kurzboegen und Waffenschmelzen 1_0-34140-1-0.rar",
      "uploadedUnix": "1364663564",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b405226ba808a4646a4849f6a7da0761b836a0dd7abe296905e95906b2ce4594/analysis/1407496182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kurzboegen%20und%20Waffenschmelzen%201_0-34140-1-0.rar?fid=1000021238&ttl=1535811718&ri=8192&rs=8192&setec=568ae8925657d6482fd54e76cc3bb6dc"
    }
  ]
}