{
  "modId": 34172.0,
  "modName": "Boggs Breezehome Enhanced",
  "summary": "This is my version of a Breezehome Enhanced that i am making for the collector of official Bethesda Skyrim armors and books.",
  "descriptionHtml": "Bogg\\\\\\'s Breezehome Enhanced\r\n\r\nI will try to do an update every Thursday or Friday so my progress can be viewed and tested over the weekend and i can get back to work on it during the week.\r\n\r\n(this is my first time listing a mod so i will start with the disclaimer. If this mod causes problems its not my fault and all that good stuff. Also if it is infringing on another mod or seems similar i have no prior knowledge of the mods. only one i know of is a home enhancement for Breezehome but i made sure to not do the same things (at least the things i know about within it...and that\\\\\\'s not much). IF this mod is EXTREAMLY similar to an existing one i am sorry but nothing was copied it is all original work and like i said before i have no knowledge of how other Home enhancement mods are set up. That being said, Download, Test, Enjoy...and give constructive feedback.)\r\n\r\nPLEASE LEAVE FEEDBACK, i would like to be informed if any mod incompatibilities are found, along with issues i have not listed below.\r\nHowever... any feedback that is negative or nonconstructive for instance \\\\\\\"mod sucks\\\\\\\", \\\\\\\"other mods like this exist and are better\\\\\\\" will not be replied to for i DO NOT CARE IF OTHERS DO NOT LIKE IT! :D i made this for me and decided to share for those that might like it. and i don\\\\\\'t feed trolls...so feel free to move on or starve >:D\r\n\r\nThis is a mod i am working on to make Breezehome more suitable for the players that are collectors and want a place to display all the armor, books, and bones that they have found in the game.\r\n\r\nUnlike many other mods that add something like this my mod makes you get EVERYTHING yourself other than info. i give you NO crafting materials, armor, weapons, or books provided by Bethesda!\r\n\r\nYou must still pay for the upgrades to the home to get anything the base home is EXACTLY the same as vanilla Skyrim. However after making the decoration purchases you will start to notice some bigger changes to the house.\r\n\r\nRecommended Mods:\r\nRemove Interior Fog v2 - http://skyrim.nexusmods.com/mods/29253\r\nHigh Rez Texture packs (why not if you can run them?) - Currently have the Bethesda versions :/\r\nTowns and Villages Enhanced - Whiterun http://skyrim.nexusmods.com/mods/19799\r\nFurniture and Clutter - HD Retextures http://skyrim.nexusmods.com/mods/4571\r\nHD High Resolution Armors - http://skyrim.nexusmods.com/mods/2009\r\nMannequins Look Like YOU - MLLY - http://skyrim.nexusmods.com/mods/17710\r\n\r\nLooks nice with the CBBE body mod. - http://skyrim.nexusmods.com/mods/2666\r\nand also, Better males - http://skyrim.nexusmods.com/mods/2488\r\n\r\nInstalling updates: It seams that if you place armor on a mannequin then update to a new version that armor might start to duplicate on the mannequin. the only way you will notice is if you open the mannequin. And this could just be a problem i am having during testing and the constant updates i am doing to my game in between releases. If this is happening to you before you update turn on God Mode with console \\\"TGM\\\" for no carry capacity, take all your stuff from house. save outside. disable mod. load into game make new save outside without mod. then activate new version.\r\n\r\nDid have some issues with:\r\nQs Mannequins and More - http://skyrim.nexusmods.com/mods/13279\r\nI really like and want this mod to work/be compatible with my activated mods but it caused at least 40 of the 60 mannequins i have to float/strike an odd pose. The top half would be fine but the bottom would look like it was trying to crouch. it is possible the pedestals are to close to the mannequins but im not sure at this point.\r\n\r\n\r\nChanges:\r\n\r\nLiving room/entry: Not to much changes here just yet. moved some chairs and the cooking pot.\r\n\r\nDinning: Moved the table closer to the fire to make room for the stairwell that goes down to the Collectors Hall.\r\n\r\nAlchemy: Has been moved upstairs where the spare bed once was and also accompanied it with Enchanting station, Grinding wheel, Leather station, and work bench.\r\n\r\nBedroom: Has been expanded to make better use of the upstairs and added 3 mannequins, some more chests, and a couple display cases.\r\n\r\nCollectors Hall (until i think of a better name for it): has been added and outfitted with 60 mannequins. and in front of each on is a short pedestal that is a functioning book case that contains a book on a specific type of armor. These Books are filled with information about each set of armor in the game. For instance one title is \\\\\\\"Ancient Nord Armor\\\\\\\", and the contents of these books will contain information like how many pieces are in the set, names of the pieces, how to get them, and how and what you need to craft and upgrade them. Some even have a little extra info in the back just for fun.\r\n-ALL info inside of these books comes from the Elder Scrolls Wiki page. and i take no credit other than organizing it into each book.\r\n\r\nCurrently you must open the pedestals and take the book and then put it back to make them show up on the pedestal. Once i know a way around this i will fix it...i have some ideas)\r\n\r\n-Blood/Bone Pit-\r\nsomething i have ALWAYS wanted. If you are a collector of bones, bloody rags, and other body parts (if you can find them...or from animals) i have added the Blood Pit!!! :D At the bottom is a  mammoth skull in a pool of BLOOD! (actually volcanic water :/...but we will pretend.) Its top is activated by pull chain for when you want to open it to toss in the body parts...or to punish your followers just for the hell of it.\r\n\r\n-V.16a UPDATE 4/2/13-\r\n\r\n-Rugs in the Hall have been better positioned.\r\n-the vaulted ceiling has been re-positioned (or \r\nreplaced) to be more believable.\r\n-Added teleportation back to Hall start\r\n-Floors in Library have been moved to take care of \r\nthe overlap flickering\r\n-Added functioning bookshelves to library.\r\n-Buildings and trees from Towns and Cities \r\nenhanced: Whiterun have been added to be seen from \r\nupstairs.\r\n\r\nThings to come:\r\n-The house is going to be slightly more fleshed out with clutter.\r\n-If i can find a way to make the followers use the spiral case and not just \\\\\\\"hang out\\\\\\\" at the top and occasionally fall to the bottom i will...but i have NO CLUE how to fix this.\r\n-I am going to hit up Youtube and learn how to make weapon racks. So that i can place them behind the appropriate mannequins. Who wants to just show off the armor and not the fact you have collected all the weapons to go with it also?\r\n\r\nSomeday when i make my own versions of Enhanced houses for ALL of the houses i will make a second hall to connect all the houses to the Collectors Hall. but you will still need to purchase and upgrade the houses to gain access to them from the CH. I plan to make door specific keys spawn when you buy so that you cant buy Breezehome and then just fast travel to your home in Riften without paying for it.\r\n\r\nI would also like to get the SkyMoMod and add weapon racks and mannequins for the ones offered by it. but until then its a no go. Ive had some trouble downloading it :/\r\n\r\n\r\n\r\n\r\nCurrently uploading this for the soul purpose to get better and well rounded tests to help fix or better understand the issues i am having.\r\n\r\nThis mod is in the beta stages due to some problems i have had:\r\n\r\n-Not being able to leave the house due to crash/freeze this problem started today (3/30/13) for no real reason. i haven\\\\\\'t changed anything in the mod. My best guess is im not completely closing the CK or re-opening files after testing the mannequins in game (then saving the game -_-...mistake)\r\n\r\n-Some frame skipping. I believe the house is getting to big and the collectors hall needs to be instanced off or removing the interior fog is causing this.\r\n\r\n-Followers seem to have a hard time with the spiral stair case leading down to the Collectors \r\nHall.\r\n\r\n-Had a problem with flickering lights but i think i fixed it by changing the light sources.\r\n\r\n-Objects not staying on tables within Breezehome(plates,bowls,jugs,etc). This is more of a small thing that could just be my personal save. With 3 followers it can get cramped.\r\n\r\n-Some floor tiles are not aligned like they should be but i will fix this when its a bigger problem.\r\n\r\n",
  "categoryId": "67",
  "version": "v.16a",
  "author": "Boggtroll",
  "createdUnix": "1364720511",
  "updatedUnix": "1365156138",
  "containsAdultContent": false,
  "uploadedBy": "boggtroll",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021436",
      "name": "Boggs Breezehome Enhanced",
      "version": "0.15a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "68",
      "fileName": "Boggs Breezehome Enhanced-34172-0-15a.zip",
      "uploadedUnix": "1364719423",
      "modVersion": "0.15a",
      "virusScanUrl": "https://www.virustotal.com/file/8ce5ba3b433122bbb8813863de854131e9caf5a60d7ec47aa0bed00ce0034120/analysis/1407497706/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Boggs%20Breezehome%20Enhanced-34172-0-15a.zip?fid=1000021436&ttl=1535811802&ri=8192&rs=8192&setec=9076082eb78a00225aa7b6107986be20"
    },
    {
      "fileId": "1000021881",
      "name": "Boggs Breezehome Enhanced",
      "version": "v.16a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "95",
      "fileName": "Boggs Breezehome Enhanced-34172-v-16a.zip",
      "uploadedUnix": "1364900028",
      "modVersion": "v.16a",
      "virusScanUrl": "https://www.virustotal.com/file/c4ee2c879b1456b6039b1376ba1bf41a477409bd58646d110463fe2cd5f56715/analysis/1407501540/",
      "changelogHtml": " -Rugs in the Hall have been better positioned. <br/> \n -the vaulted ceiling has been re-positioned (or replaced) to be more believable. <br/> \n -Added teleportation back to Hall start <br/> \n -Floors in Library have been moved to take care of   the overlap flickering <br/> \n -Added functioning bookshelves to library. <br/> \n -Buildings and trees from Towns and Cities   enhanced: Whiterun have been added to be seen from   upstairs. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Boggs%20Breezehome%20Enhanced-34172-v-16a.zip?fid=1000021881&ttl=1535811802&ri=8192&rs=8192&setec=6d6920ca72cc90afd417b4ad82ea894b"
    },
    {
      "fileId": "1000022503",
      "name": "Boggs BH Fog or Sky fix",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Boggs BH Fog or Sky fix-34172-1-0.zip",
      "uploadedUnix": "1365156138",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/854de6a3212f75a9bf6033879c16a748957f6d2fa92058c9787494779d56afc5/analysis/1407507324/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Boggs%20BH%20Fog%20or%20Sky%20fix-34172-1-0.zip?fid=1000022503&ttl=1535811802&ri=8192&rs=8192&setec=536c6a7b9d861d2ed8d80506c8e2f4eb"
    }
  ]
}