{
  "modId": 34180.0,
  "modName": "Ova the Rainbow - A Psychedelic Easter Adventure",
  "summary": "Celebrate Easter, Skyrim-style: the search for a missing man leads to a psychedelic egg hunt unlike anything you\\'ve seen before! ",
  "descriptionHtml": "[color=#FFCC00][IMG]http://i.imgur.com/1jFFiIw.png[/IMG][youtube]DOTgPgSUNt8[/youtube]\r\n[size=3]The search for a missing man leads to an psychedelic egg hunt unlike anything you\\'ve seen before! [/size]\r\n\r\n1.01 Update release!\r\nNow available on Steam Workshop as well: http://steamcommunity.com/sharedfiles/filedetails/?id=151837234\r\n\r\n[center][IMG]http://i.imgur.com/SPKB8oe.png[/IMG][/center]\r\n[list]\r\n[*]Find colorful, hand-painted eggs hidden all over Skyrim\\'s cities and wilderness.\r\n[*]Dynamic placement means eggs are never hidden in the same place twice and the hunt can go on for as long as you like!\r\n[*]Make the eggs as easy or difficult to find as you like by tweaking settings using SkyUI\\'s MCM.\r\n[/list]\r\n\r\n[center][IMG]http://i.imgur.com/udQDevj.png[/IMG][/center]\r\n[list]\r\n[*]Each egg provides a unique, psychedelic experience when used.\r\n[*]Many grant you powerful abilities like nothing you\\'ve ever seen before!\r\n[/list]\r\n\r\n[center][IMG]http://i.imgur.com/ORfW9Nx.png[/IMG][/center]\r\n[list]\r\n[*]Where are the eggs coming from? \r\n[*]What sort of madman spends his time hiding colors eggs all over Skyrim?\r\n[*]What is the creature \\\"all in pink\\\"?\r\n[/list]\r\n\r\nMeet Tsajami, a lone Khajiit woman living in a tent just south of Whiterun. Her friend has gone missing, and she needs your help. When you find him, the egg hunt will begin.\r\n\r\n[center][IMG]http://i.imgur.com/hpANr3q.png[/IMG][/center]\r\n1.01:\r\n[list]\r\n[*]Adds a configuration book to your inventory if SKSE is not installed\r\n[*]REALLY fix the fall damage bug in the final battle\r\n[*]Included missing FaceGeom data\r\n[/list]\r\n1.0:\r\n[list]\r\n[*]New MCM options to configure visual effects and audio \r\n[*]Tons of bugfixes\r\n[*]Too much to list here, see the changelog for details!\r\n[/list]\r\n\r\n[center][IMG]http://i.imgur.com/finK7cd.png[/IMG][/center]\r\nIf you\\'re running SkyUI 3.4 (and you should be!) you can use the MCM to tweak almost every aspect of the eggs during the hunt. You may change the size of the egg beacons (the glow surrounding the egg), make it float in the air for easier visibility, and change when (or if!) it appears. You can also change the egg sound effect to make them easier (or harder) to find. You can also tweak some variables in the placement script to reduce script latency or change the number of eggs you run across. If you find settings that work particularly well for you, please post them!\r\n\r\nYou can also enable or disable various visual effects and audio options. This is particularly useful if you are sensitive to flashing lights or motion sickness.\r\n\r\nAs of 1.01, if you do not use SKSE, a configuration book will be added to your inventory automatically. \r\n\r\n[IMG]http://i.imgur.com/zwfb70q.png[/IMG]\r\n[list]\r\n[*]Pay attention to your quest log!\r\n[*]Currently there is no way to restart the egg hunt once you have completed the final battle. This will be added in an update in the near future. In the meantime, make sure you have hunted all the eggs you want before you track down the Creature.\r\n[*]Eggs are placed in real time as long as you\\'re outdoors. You will find them tucked next to cliffs, in bushes, hollow logs, baskets or pots and sometimes even on open ground.\r\n[*]Eggs emit a glow and a faint sound to make them easier to spot; both are customizable.\r\n[*]Hunting in the same area for a long time will deplete it of eggs. It\\'s better to keep moving.\r\n[*]If you can hear an egg nearby but can\\'t find it, it may have been placed in an unreachable spot. This is now a very rare occurrence; if you MUST get that unreachable egg, just use tcl and look under the ground.\r\n[/list]\r\n\r\n[IMG]http://i.imgur.com/Du37agP.png[/IMG]\r\nThis mod is a collaboration between me (Verteiron) and my wife (Syrcaid). Her original idea for an egg hunt took on a life of its own, and this mod is the result.\r\n\r\n[IMG]http://i.imgur.com/rLxQvKG.png[/IMG]\r\nThe egg placement script places a load on the script engine. Other very script-intensive mods may impede performance. You may find tweaking the placement script improves this. You can change the script settings in the config menu under Egg Options->Placement Options->Advanced.\r\n\r\nIf you play Skyrim with the in-game music turned off, you may find this mod turns it back on from time to time. This can be fixed by disabling the \\\"Volume changes\\\" option in the configuration menu under Effects->Audio. \r\n\r\n[IMG]http://i.imgur.com/vXMjkUY.png[/IMG]\r\n\r\nImaginary Butterflies are intended to be catchable but currently are not; this is a Bethsoft bug (related to the infamous display case bug), and will take some time for me to work around. \r\n\r\n[IMG]http://i.imgur.com/4KdPIle.png[/IMG]\r\n[list]\r\n[*]Make the egg hunt and final battle repeatable. \r\n[*]Give Tsajami something useful to do after the quest is over.\r\n[*]Add a couple of additional visual effects and attacks to the final battle.\r\n[/list]\r\n\r\n[IMG]http://i.imgur.com/ksNyXpI.png[/IMG]\r\nScript sources are included, messy though they are.\r\n\r\n[IMG]http://i.imgur.com/sZGTNeP.png[/IMG]\r\n[list=1]\r\n[*]Extract this archive to any folder and then copy the contents to Skyrim\\'s Data folder.\r\n[*]Start Skyrim, click Data Files, and enable the OvaTheRainbow.esp file.\r\n[/list]\r\n\r\nOr simply use Nexus Mod Manager.\r\n\r\n[IMG]http://i.imgur.com/iaJPTyD.png[/IMG]\r\n[list=1]\r\n[*]Why would you do this?\r\n[*]Start Skyrim Launcher, click Data Files, uncheck the OvaTheRainbow.esp file.\r\n[*]Delete the files/folders associated with the mod.\r\n[/list]\r\n\r\nSkyrim\\\\Data\\\\OvaTheRainbow.esp\r\nSkyrim\\\\Data\\\\OvaTheRainbow.bsa\r\n\r\nOr just use Nexus Mod Manager.\r\n\r\n[IMG]http://i.imgur.com/cxTf1rd.png[/IMG]\r\nJust overwrite everything, no problem.\r\n\r\n[IMG]http://i.imgur.com/V7e4MXg.png[/IMG]\r\n1.01, 2013/06/09 - Added missing FaceGeom data, added config book for non-SkyUI users. Initial Steam release.\r\n1.00, 2013/06/07 - Tons of fixes. See the changelog.\r\n0.95, 2013/05/06 - Re-add some notifications that went missing in 0.94.\r\n0.94, 2013/05/04 – Lots of bugfixes. Added customizable options to the egg beacon visuals and sound effects using MCM. See the changelog on Skyrim Nexus for complete details.\r\n0.91, 2013/04/09 - Corrected path issues in the BSA file. Thanks, Bethsoft, for making your tools as unhelpful as humanly possible.\r\n0.90, 2013/04/05 - Various bugfixes. Tweaked the egg placement script to lower resource usage. Reduced egg sound effect volume.\r\n0.81, 2013/03/31 – Fixed eggs spawning in interior cells (thanks restcoser!).\r\n0.80, 2013/03/31 – Initial beta release to Nexus.\r\n\r\n[IMG]http://i.imgur.com/BtDete0.png[/IMG]\r\nverteiron@gmail.com\r\n\r\n[IMG]http://i.imgur.com/ee6GTrF.png[/IMG]\r\nThanks to my lovely wife Syrcaid for the idea, artwork, and voice acting.\r\nThanks to Ducey, Alex Velicky, Chesko, Worm, dAb, Antares, gulogulo, isoku, Rongphale and anyone else I forgot over at the Bethsoft CK forums.\r\nThanks to Bethesda for creating Skyrim and the Creation Kit.\r\n\r\n[IMG]http://i.imgur.com/9TXTlCb.png[/IMG]\r\n[list]\r\n[*]Creation Kit\r\n[*]nifSkope\r\n[*]Audacity\r\n[*]Freeverb 3\r\n[*]Dee-Esser\r\n[*]Archive.exe\r\n[*]BSAOpt\r\n[*]TES5Edit\r\n[*]7-Zip\r\n[/list]\r\n\r\n[IMG]http://i.imgur.com/Q8b2BcC.png[/IMG]\r\nYou must contact me and obtain my permission before re-packaging any part of this mod UNLESS your sole intent is to provide a translation of the mod to another language. In that case, please send me a link to the translated version and I\\'ll thank you kindly for helping this reach a wider audience![/color]",
  "categoryId": "92",
  "version": "1.01",
  "author": "Verteiron and Syrcaid",
  "createdUnix": "1364730127",
  "updatedUnix": "1370811812",
  "containsAdultContent": false,
  "uploadedBy": "verteiron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000023547",
      "name": "OvaTheRainbow 091b",
      "version": "0.91b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6525",
      "fileName": "OvaTheRainbow 091b-34180-0-91b.7z",
      "uploadedUnix": "1365566049",
      "modVersion": "0.91b",
      "virusScanUrl": "https://www.virustotal.com/file/432a06d412131b62493cbb42d5ef8225b670ff86048639e598db56a7a5c2619e/analysis/1407515003/",
      "changelogHtml": " Fixed path isssues in the BSA file, because Bethsoft can&#39;t tell a relative path from an absolute one. Thanks, guys. Great work. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OvaTheRainbow%20091b-34180-0-91b.7z?fid=1000023547&ttl=1535811812&ri=8192&rs=8192&setec=47e09d57059cccc8a0b5f68625c776a0"
    },
    {
      "fileId": "1000028140",
      "name": "OvaTheRainbow 094b",
      "version": "0.94b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6650",
      "fileName": "OvaTheRainbow 094b-34180-0-94b.7z",
      "uploadedUnix": "1367709513",
      "modVersion": "0.94b",
      "virusScanUrl": "https://www.virustotal.com/file/9ab3a5162ddf8af987a96f43b3ba0157ff1960ccd8bb16969edf74d3d1965ceb/analysis/1407555204/",
      "changelogHtml": " Player AI on Berserk effect much improved <br/> \n Giants and Mammoths are no longer immune to the Chill Out effect <br/> \n Fixed some script errors that were causing log spam <br/> \n Greatly reduced the odds of multiple eggs appearing in one place <br/> \n Trip visuals now fade more quickly when the trip has ended <br/> \n DoF effects in trips now ignore the sky, which makes the particles a bit more clear <br/> \n Egg sound effect has been altered slightly to make it easier to pick out from background noise <br/> \n Killer Bunny hallucination now goes for the throat rather than above the target&#39;s head <br/> \n Imaginary Butterflies and their alchemy item now have their own texture <br/> \n New feather particles have been added to the yellow chicken effect <br/> \n MCM:\r<br />Egg beacons can be disabled\r<br />Egg beacon size can be changed\r<br />Egg beacons can be set to hover in the air over the egg, rather than directly on it\r<br />Egg sound effect volume can be changed (or muted)\r<br />Eggs can have their havok physics disabled <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OvaTheRainbow%20094b-34180-0-94b.7z?fid=1000028140&ttl=1535811813&ri=8192&rs=8192&setec=643d47ded0a484c2f26d3431c6d77d63"
    },
    {
      "fileId": "1000028485",
      "name": "OvaTheRainbow 095b",
      "version": "0.95b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6650",
      "fileName": "OvaTheRainbow 095b-34180-0-95b.7z",
      "uploadedUnix": "1367868277",
      "modVersion": "0.95b",
      "virusScanUrl": "https://www.virustotal.com/file/c5694fbf72bca6eb64420f6a0a438016e3c03d79b0993e50ac1f85427efa99da/analysis/1407558084/",
      "changelogHtml": " Restored missing notifications. Gotta watch that \"find in files\" function... <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OvaTheRainbow%20095b-34180-0-95b.7z?fid=1000028485&ttl=1535811813&ri=8192&rs=8192&setec=84ae498ff11d6d204780c3740531f476"
    },
    {
      "fileId": "1000033262",
      "name": "OvaTheRainbow 100",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7117",
      "fileName": "OvaTheRainbow 100-34180-1-0.7z",
      "uploadedUnix": "1370661916",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/052ece252c3dd61711645413df3772a4134448a464e4a7b55157f291972cd319/analysis/1407595899/",
      "changelogHtml": " Dragons are now immune to One with Nature <br/> \n Egg addiction script now double-checks to make sure egg placement is happening <br/> \n Init script now restarts egg placement script if player is addicted <br/> \n Voices are no longer distorted for mild withdrawal <br/> \n It should no longer be possible to start the creature hunt before you experience withdrawal symptoms <br/> \n Fixed some error logspam in the One with Nature script <br/> \n Added a special music track for the final battle intro <br/> \n Egg placement script now favors eggs the player doesn&#39;t have many of <br/> \n All eggs now allow you to track the pink creature once the hunt has started <br/> \n Final reward item is now vastly improved <br/> \n Fixed a rare condition that caused one of the quests to fail <br/> \n Fixed eggs sometimes still spawning after the creature is defeated <br/> \n Pink hide is now called Pink Hide instead of Cow Hide <br/> \n Changed rabbit attack sound slightly <br/> \n Improved the creature&#39;s defenses against wild animals <br/> \n Creature&#39;s trail no longer makes slaughterfish noises <br/> \n Creature&#39;s charge attack no longer kills you with fall damage <br/> \n Chill Out and Everybody Runs now immediately affect NPCs in combat <br/> \n Reduced the weight of the eggs <br/> \n Eggs are more creatively named <br/> \n Withdrawal levels are now more clearly indicated. <br/> \n Options are now available to disable custom music, volume alteration, flashing colors and the ripple effect if desired (requires MCM) <br/> \n Fixed a couple of minor glitches in the final battle <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OvaTheRainbow%20100-34180-1-0.7z?fid=1000033262&ttl=1535811814&ri=8192&rs=8192&setec=a3c20be9cd817ce002fd9a9e326b860b"
    },
    {
      "fileId": "1000033552",
      "name": "OvaTheRainbow 101",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7376",
      "fileName": "OvaTheRainbow 101-34180-1-01.7z",
      "uploadedUnix": "1370811812",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/fc89c2fe13bdc027e175c6d596c2dda693ccff6629d62c23b292a6e4b9f45b46/analysis/1407598453/",
      "changelogHtml": " Added missing FaceGeom data <br/> \n Added config book for non-SkyUI users <br/> \n REALLY fixed the fall damage bug in the final battle&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OvaTheRainbow%20101-34180-1-01.7z?fid=1000033552&ttl=1535811814&ri=8192&rs=8192&setec=613b8f5871be81765328664c82160e2b"
    }
  ]
}