{
  "modId": 34184.0,
  "modName": "Marco&#39;s Integrated Leveled Lists",
  "summary": "This mod seeks to add more variety to the game by adding content from Dawnguard and Dragonborn into the main game, as well as other unused assets in-game. For instance, Draugr may now spawn with Carved Nordic or even Stalhrim weapons, and warlocks wear different colored robes depending on their preferred element. ",
  "descriptionHtml": "[b]DAWNGUARD AND DRAGONBORN DLCS BOTH REQUIRED FOR THIS PLUGIN&#33;[/b]\r<br />\r<br />This mod seeks to add more variety to the game by adding content from Dawnguard and Dragonborn into the main game, as well as other unused assets in-game. For instance, Draugr may now spawn with Carved Nordic or even Stalhrim weapons, and warlocks wear different colored robes depending on their preferred element. Do you think warlocks have a terrible fashion sense? Or that Draugr buy all their weapons from the same Ancient Nord department store? Well, maybe you should try &#34;Marco&#39;s Integrated Leveled Lists&#34;&#33; &#34;Marco&#34; because that&#39;s who I am (and I&#39;m an egomaniac), &#34;Integrated Leveled Lists&#34; because that&#39;s what this mod does; it integrates content from Dawnguard and Dragonborn into the vanilla leveled lists, as well as content yet unused in the game. Obviously, that means [i]you need to have Dawnguard and Dragonborn installed to use this mod.[/i] \r<br />\r<br />MILL does not use any assets that aren&#39;t found in Skyrim or the DLCs. I tried hard to make it as lore-friendly as possible, so that it fits in seamlessly with the vanilla gameplay/aesthetic.\r<br />\r<br />[b]EXACTLY WHAT THIS MOD DOES:[/b]\r<br />\r<br />DRAUGR\r<br />-Draugr now have a chance to spawn with Carved Nordic and Stalhrim weapons. Carved Nordic appear around the same levels as Honed Ancient Nord weapons. Stalhrim weapons appear at the same level as Ebony, but they&#39;re much more rare. In addition, Draugr will use Ebony Maces and a wider variety of shields (Dented Iron, Banded Iron, and Carved Nordic).\r<br />\r<br />-Armored skeletons from Dawnguard now appear alongside Restless Draugr, Draugr Wights, and Draugr Scourges. They will have matching stats and gear; the only difference is appearance. They also have a chance to spawn in place of ordinary skeletons; in this case, they will be a bit tougher than what you&#39;d normally find. But I don&#39;t think anyone&#39;s really going to have trouble with skeletons now that they don&#39;t crumble whenever you sneeze near them. This isn&#39;t Daggerfall.\r<br />\r<br />BANDITS\r<br />-Dunmer bandits will now only spawn with Leather Armor, or light Chitin Armor.\r<br />\r<br />-Bandit mages now wear Green Robes. They will wear either hooded or nonhooded variants, and they can either be unenchanted, or enchanted with a leveled Fortify Magicka Regen effect. They still wear bracers and boots, of course.\r<br />\r<br />-Orc Bandit Chiefs now have a chance to spawn in a full set of Orcish Armor. They have to be Orcs, and they have to be Bandit Chiefs, and even then it&#39;s possible they spawn in ordinary steel/steel plate armor.\r<br />\r<br />WARLOCKS\r<br />-Warlocks now wear robes that match their class. Ice Mages wear blue, Fire Mages wear brown, Storm mages wear grey, and Conjurers wear red. All of these robes can either be unenchanted, or come with a leveled Fortify Magicka Regen effect. Necromancers still wear Necromancer robes, but now it&#39;s possible to find unenchanted versions of their robes.\r<br />\r<br />MISCELLANEOUS\r<br />-Werebears have been added to leveled lists. Wherever you might encounter a werewolf (mostly from the Dawnguard expansion), there&#39;s a chance you&#39;ll encounter a Werebear instead. Only at higher levels, though, and infrequently, because Werebears are [i]mean[/i]. And rare.\r<br />\r<br />-Most named Dunmer NPCs will now be wearing Dunmer clothes, or Chitin/Bonemold armor if they wore armor beforehand. It&#39;s not much, but it adds just a little more variety among the commoners. While I was at it, I modified the enchantments on the Dunmer Outfit, the Temple Priest Robes, and the Telvanni Robes: regular Dunmer clothes are unenchanted, Temple Priest Robes match Expert Robes of Restoration, and Telvanni Robes have a &#34;Fortify Magicka Regen 150%&#34;. If you use another mod that changes (or removes) the enchantments on these items, place it after mine in the load order and everything will be gravy.\r<br />\r<br />-Three Dunmer merchants (Aval Atheron, Revyn Sadri, and Brand-Shei) will now stock various goods from Morrowind (Solstheim). Atheron and Sadri stock weapons and armor while Brand-Shei doesn&#39;t, but Brand-Shei stocks books from Morrowind that the other two don&#39;t.\r<br />\r<br />-Silver Hand mooks now wear Leather Armor and unenchanted Mage Hoods. It looks cooler, separates them further from ordinary bandits, and gives you a chance to find unenchanted mage hoods. And I totally forgot to mention this in the readme because I&#39;m a dip.\r<br />\r<br />-Orc Chieftains at the Orc Strongholds now wear Orcish Armor (save for Chief Mauhulakh, who wears Ebony thanks to his stronghold having an ebony mine), and any Orcs in the strongholds should be carrying Orcish weapons and nothing else.\r<br />\r<br />-Potions of Well-being have been added to leveled lists. I think. You may need to complete the &#34;Fetch the Netch&#34; sidequest to activate them. Someone tell me if they&#39;re seeing these&#33; Also, I added Vigor and Recovery poisons, which damage stamina and magicka regen, respectively. These poisons existed in the game, but weren&#39;t in any leveled lists, so good luck finding many of them.\r<br />\r<br />-Lurkers (the giant walking lungfish in Apocrypha) drop Daedra Hearts. Because... they&#39;re Daedra.\r<br />\r<br />-Mudcrabs now have a 75% chance to drop a single Chitin Plate. \r<br />\r<br />[b]INSTALL:[/b]\r<br />Either use the NMM, or just extract the ESP into your Skyrim/Data folder and check it in the Data Files section of the launcher.\r<br />\r<br />[b]COMPATIBILITY:[/b]\r<br />\r<br />This mod changes a wide variety of leveled lists, so if you&#39;re using another mod that edits leveled lists (such as Immersive Armors/Weapons), you need to use Wrye Bash to merge the lists together. In addition, I had to make custom outfit sets for several different NPCs (for instance, all of the warlocks use the same outfit, so I had to go through each one and give them their own unique to their preferred element). If you have any other mods that affect outfits, I&#39;d suggest putting this one lower in your load order. (if you notice any compatibility issues, please, tell me&#33;)\r<br />\r<br />[b]CHANGELOG:[/b]\r<br />Version 1.3\r<br />-Fixed shields not showing up on Draugr\r<br />-Lurkers now drop Daedra Hearts\r<br />-Added Vigor and Recovery Poisons\r<br />\r<br />Version 1.2:\r<br />-Dunmer merchants (Aval Atheron, Revyn Sadri, and Brand-Shei) now sell Dunmer merchandise and items found on Solstheim.\r<br />-Redressed Orc Chieftains to always wear Orcish Armor, or Ebony in the case of Chief Mauhulakh. Stronghold Orcs will also carry only Orcish weapons.\r<br />-Added Potions of Well-Being to leveled lists for health, magicka, and stamina potions.\r<br />-Redressed Silver Hand to wear Leather Armor and unenchanted Mage Hoods.\r<br />-Added &#34;Fortify [Magic School] and Magicka Regen&#34; effects to new robe leveled lists.\r<br />-Removed dirty edits with TES5Edit\r<br />\r<br />Version 1.1:\r<br />-Added Werebears to Werewolf leveled lists.\r<br />-Redressed most Dunmer NPCs in the game to wear Dunmer apparel.\r<br />-Added Chitin Plates to Mudcrab item drops&#33; YAY&#33;&#33;&#33;\r<br />-Gave Draugr Deathlords their pointy helmets back. \r<br />\r<br />Version 1.0:\r<br />-Initial Release.\r<br />\r<br />[b]SPECIAL THANKS[/b]\r<br />- Everyone who offers suggestions and feedback. Seriously, I&#39;m like a skooma addict for this stuff.\r<br />- UESP.net for their wealth of information that I used as a reference for this mod.\r<br />- My friend who loaned me his laptop to take some awesome screenshots.\r<br />- Of course, Bethesda Game Studios, for making a great game and giving the community the tools to make it even better.\r<br />\r<br />[b]Stay tuned, folks&#33; And please, feedback, suggestions, and advice are all welcome&#33;[/b]",
  "categoryId": "24",
  "version": "1.3",
  "author": "Marco",
  "createdUnix": "1364740955",
  "updatedUnix": "1372842114",
  "containsAdultContent": false,
  "uploadedBy": "BOXMAAAN",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021480",
      "name": "Marcos Integrated Leveled Lists",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "47",
      "fileName": "Marcos Integrated Leveled Lists-34184-1-0.rar",
      "uploadedUnix": "1364739055",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/eb5dea27e44f9b1cbed3e32e8be2e89239690acf4d3c6076e3a50c2ecafa06e0/analysis/1407497894/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marcos%20Integrated%20Leveled%20Lists-34184-1-0.rar?fid=1000021480&ttl=1535811819&ri=8192&rs=8192&setec=949c9eb56feb5032af2e3e84aa1543fd"
    },
    {
      "fileId": "1000025063",
      "name": "Marcos Integrated Leveled Lists",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "70",
      "fileName": "Marcos Integrated Leveled Lists-34184-1-1.rar",
      "uploadedUnix": "1366247718",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6ac505924d9cbe3ebe3add13ddda5019e3c5620746994be8fed4489cfb8c0345/analysis/1407527766/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marcos%20Integrated%20Leveled%20Lists-34184-1-1.rar?fid=1000025063&ttl=1535811820&ri=8192&rs=8192&setec=8baf38e5819900eb5ea714a8d863af50"
    },
    {
      "fileId": "1000027891",
      "name": "Marcos Integrated Leveled Lists",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "78",
      "fileName": "Marcos Integrated Leveled Lists-34184-1-2.rar",
      "uploadedUnix": "1367634430",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/81f6e9b716955927e8695ab19a4eb71348e952baa22a46d861c7fac0abf3ae2a/analysis/1407553382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marcos%20Integrated%20Leveled%20Lists-34184-1-2.rar?fid=1000027891&ttl=1535811820&ri=8192&rs=8192&setec=bf78ebaabffd7f2065ff0feb6d4b85e9"
    },
    {
      "fileId": "1000037033",
      "name": "Marcos Integrated Leveled Lists",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "79",
      "fileName": "Marcos Integrated Leveled Lists-34184-1-3.rar",
      "uploadedUnix": "1372842114",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/338198067c3b4eeb379f1cc6f9cf956b29bb3bfa4ad9eda265b2545ab090a379/analysis/1407629664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marcos%20Integrated%20Leveled%20Lists-34184-1-3.rar?fid=1000037033&ttl=1535811821&ri=8192&rs=8192&setec=05e2b3877fe1c32aa36302607b556d07"
    }
  ]
}