{
  "modId": 34199.0,
  "modName": "SouGhemz",
  "summary": "Create and grow soul gems with enchanting or alchemy. This mod is designed to \\\"make sense\\\" and let you \\\"legitimately\\\" create and level soul gems from soul shards to even black soul gems.",
  "descriptionHtml": "You do not need any other mods or scripts to run this mod. This mod adjusts the weights of some gems/fragments slightly to make visual sense when shattering soul gem fragments into the new \\\"soul gem shards,\\\" which can also be obtained by taking silver ore and dissolving it with one of the new alchemy compounds.\r\n\r\nThe way it works is through the alchemist 1-5/5 and enchanting 1-5/5 perks that each give 20% stronger effect. In fact, there won\\'t be any recipes added until 1/5 of both are applied. This way the character has some basic understanding of enchanting gems for the use of the alchemy compounds, as well as the understanding of the alchemy compounds needed to create the first petty shard.\r\n\r\nCreating a petty gem, to start off, is done through the use of soul \\\"shards,\\\" which is a new item for universal conversion of raw material value. For instance, if you find some soul gem fragments, you can \\\"shatter\\\" them into shards (the recipe only shows when you have a fragment, to avoid recipe clutter, and if you compare sizes of the 5 types of fragments, you\\'ll see that some fragments give more shards than others). Want to make shards from scratch? Then find silver ore, not refined ore, and use the starter alchemy recipes to dissolve the silver (which is historically a \\\"mythical\\\" compound used to fight off undead, lycans, and ghouls) with the other minerals find in the ore into basic shards that you can combine afterwards into soul gems.\r\n\r\nBy using a cooking pot, you can use common ingredients to make compounds that will dissolve silver ore into shards or to use the shards to crystallize a soul gem. After that you make compounds with slightly less common ingredients (the gem process is meant to take a couple of extra steps, but to not drive you mad hunting rare stuff to do a simple upgrade) to enhance petty gems into higher grade gems. For high level alchemy, you can make a more rare compound to convert gems into black gems... only around midnight though. With various levels of potency, higher alchemy yields faster gem conversion as well as jumping say a petty gem into a greater gem. (However, greater soul gems take stronger potency to make a grand.)\r\n\r\nAfter level 1 of the two perks, you can go all the way with either alchemy or enchanting... meaning you don\\'t have to level both schools to get what you are after. With alchemy, you have access to higher level gems quicker than through enchanting, since enchanting makes higher gems when your enchanting grows. As you learn higher level compound potency, you can more \\\"easily\\\" obtain higher level gems. Some people don\\'t want to actually enchant items, but need the souls to charge weapons. With alchemy you can make higher level gems without sacrificing other gems in the process, and not have to level enchanting if you don\\'t want to. Enchanting takes 3 filled gems to convert to 1 gem of a higher level. However, with the soul squeezer perk in enchanting, those filled gems makes a filled gem of the higher level instead. Soul squeezing doubles the power of the energy inside the gems, so with the perk that\\'s quite easy to get, you can convert those useless lesser-leveled souls into more powerful souls.\r\n\r\nOne advantage to counter the alchemist advantage of earlier higher-level shards is the enchanting-only ability to make a reusable black soul gem. With high enough conjuration, alteration, or a little extra effect from enchanting, the black soul gems are available to create at night. With a better understanding of conjuration and alteration, you can make a new hot black-market item, the Nemesis Soul Gem, with the power filled into 10 regular black soul gems (soul squeezing halves the cost) to never have to worry about running out of black soul gem power again!\r\n\r\nOh, and higher enchanting yields greater effect when dissolving silver ore. Get more shards with more points into the perk. Go from needing 3 ore for a shard to needing 1 ore for 3 shards.\r\n\r\nTo recap, alchemy provides earlier access to higher shards as well as not having to sacrifice quantity for quality. Higher levels gives better conversion as well as ability to make grand and black soul gems. Enchanting uses more useless souls to combine into higher level souls... as well as leading to unique refillable black soul gems.\r\n\r\n-------------------------------------------------------------\r\nLevel 1 perks of alchemy and enchanting:\r\nCrush fragments and dissolve ores into shards.\r\nCooking pots are used to make compounds; forges are used to make the gems with the compounds and shards.\r\nMake petty and lesser gems right away.\r\n\r\nIf alchemy perks increased:\r\nUse compounds to alchemically grow soul gems into higher levels.\r\nStronger compounds make more soul gems.\r\nStronger compounds boost lower gems higher.\r\nSpecial compound to create black soul gems (night).\r\n\r\nIf enchanting perks increased:\r\nMake more soul gem shards from silver ore.\r\nConvert filled gems into empty of higher level.\r\nSoul squeezer perk makes filled gems instead.\r\nExpert conjuration, expert alteration, OR extra effect from enchanting unlocks black soul gem creation (night).\r\nExpert conjuration AND expert alteration WITH either master conjuration, master alteration, OR extra effect unlocks reusable black soul gems: Nemesis soul gems.\r\n\r\n----------------------------------------\r\n\r\nI hope I\\'ve explained everything fully. This mod is for a \\\"make sense\\\" approach which is not too troublesome to advance soul gems, as well as a couple of neat features like the use of fragments and ore to make new gems. This will not shoot out free gems for you, but the steps to get them shouldn\\'t be a huge burden once you take a peek and test it out.",
  "categoryId": "75",
  "version": "1.000.00.0",
  "author": "Ryoka000",
  "createdUnix": "1364772974",
  "updatedUnix": "1364772341",
  "containsAdultContent": false,
  "uploadedBy": "Ryoka000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021552",
      "name": "SoulGhemz",
      "version": "1.000.00.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "SoulGhemz-34199-1-000-00-0.zip",
      "uploadedUnix": "1364772341",
      "modVersion": "1.000.00.0",
      "virusScanUrl": "https://www.virustotal.com/file/e89236b6f1a61edb3306d2ff844c4c02c7dbdf6ce89af87c85e963f32f57c94f/analysis/1407498611/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SoulGhemz-34199-1-000-00-0.zip?fid=1000021552&ttl=1535811842&ri=8192&rs=8192&setec=8748d3c7b0efcaa9025376786bfd8dbc"
    }
  ]
}