{
  "modId": 34222.0,
  "modName": "Wardrobe Manager",
  "summary": "Followers will intelligently equip appropriate clothing according to outfits you give them  (eg for sleeping, around the home, in town etc.)  Followers can randomly choose from choices within an outfit category, or you can  tell them certain outfits are preffered. Configure custom locations from a whole town to a 2m area.",
  "descriptionHtml": "[B][COLOR=#ea7500][SIZE=4]Wardrobe Manager v2.2 by Qeezer[/SIZE][/COLOR][/B]\r\n\r\n-------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/hXQSy.png[/img][/url][/center]\r\n\r\n\r\n[CENTER][COLOR=#E36C09][B]V2.2 Now available!\r\n[U][SIZE=5]Outdoor Gear[/SIZE][/U] [/B] [/COLOR]\r\n[COLOR=#d8d8d8]Intelligent equipping of  \\'outdoor gear\\' (hoods, cloaks, gloves, backpacks).  \r\nIf these items are included as part of an outfit they\\'ll only be worn when conditions indicate it. \r\nIf \\'disallow equipping of additional items\\' is NOT set, you could leave one set of outdoor gear on your follower for all occasions and allow the AI / 3rd party mods to equip them (eg [URL=http://skyrim.nexusmods.com/mods/27563]Wet and Cold [/URL]).  \r\nWith this mode set, backpacks are permitted indoors only if adventuring gear or custom2 gear is also worn.[/COLOR][/CENTER]\r\n\r\n[CENTER][COLOR=#E36C09][B]V2.0 Now available: introducing  \r\n[U][SIZE=5]Custom Locations![/SIZE][/U] [/B] [/COLOR]\r\n[COLOR=#d8d8d8]Custom locations allow you to set triggers for outfit changes anywhere you want :\r\n ~have your follower equip a blacksmith\\'s outfit around a forge~\r\n~dress for dinner around your dining table. ~\r\n~have your followers undress to use your hideouts spa pool~\r\n~set an adventuring outfit to be worn in a combat arena inside a town~\r\n~share sleep and swim locations with [/color] [URL=http://skyrim.nexusmods.com/mods/34096/][COLOR=#4f81bd][B][I]\\\"Skinny Dipping\\\"[/I][/B][/COLOR][/URL]~\r\n[COLOR=#d8d8d8]See the \\\"Customisable Locations\\\" section, and readme for full details of the new version. [/COLOR][/CENTER]\r\n\r\n[COLOR=#ea7500]--- O V E R V I E W ---[/COLOR]\r\n[COLOR=#D8D8D8]Followers will automatically equip appropriate clothing according to outfits using equipment you give them.  Followers can randomly choose from choices within an outfit category, or you can  tell them certain outfits are preferred. Many user options (MCM menu) to change features & access maintenance tasks. [/COLOR]\r\n\r\n[COLOR=#ea7500]--- D E T A I L S ---[/COLOR]\r\n[LIST]\r\n[*][COLOR=#D8D8D8]Followers will [/COLOR][COLOR=#FBD5B5][B]intelligently equip appropriate clothing[/B][/COLOR][COLOR=#D8D8D8] (e.g. for sleeping, around the home, in town, adventuring, swimming, visiting royalty ...)[/COLOR]\r\n[*][COLOR=#D8D8D8]Define outfits for up to eight of your followers / spouse(s).[/COLOR]\r\n[*][COLOR=#D8D8D8]Each follower has multiple categories of outfit (currently 6 implemented, custom categories TBC - see the Futures section)[/COLOR]\r\n[*][COLOR=#D8D8D8]Each category may have up to 8 user defined outfits.[/COLOR]\r\n[*][COLOR=#D8D8D8]A single outfit is a collection of any equippable armour or clothing item, including the excellent [URL=http://skyrim.nexusmods.com/mods/16438]Bandolier - Bags and Pouches by Dragten[/URL], backpacks, cloaks and hoods from various mods. These are [/COLOR][COLOR=#FBD5B5][B]\\'real\\' items[/B][/COLOR][COLOR=#D8D8D8] not the token outfit items that NPCs usually wear - all stats (tempering, enchantments etc.) are maintained, so you can have your followers choose from anything you might wear yourself, [/COLOR][COLOR=#FBD5B5][B]including unique and crafted items[/B][/COLOR][COLOR=#D8D8D8]. [/COLOR]\r\n[*][COLOR=#D8D8D8]Optionally [/COLOR][COLOR=#FBD5B5][B]any equipped weapons / shield[/B][/COLOR][COLOR=#D8D8D8] can also be recorded as part of an outfit. (See Future section for further enhancements).[/COLOR]\r\n[*][COLOR=#D8D8D8]Where categories contain multiple outfit options, an outfit will [/COLOR][COLOR=#FBD5B5][B]randomly equipped[/B][/COLOR][COLOR=#D8D8D8]. Optionally:  one outfit within a collection can be set to be [/COLOR][COLOR=#FBD5B5][B]preferred[/B][/COLOR][COLOR=#D8D8D8] so it is worn more often, or you may set an outfit to [/COLOR][COLOR=#FBD5B5][B]\\'always wear[/B][/COLOR][COLOR=#D8D8D8]\\'[/COLOR]\r\n[*][COLOR=#FBD5B5][B]Weapons and shields[/B][/COLOR][COLOR=#D8D8D8] can optionally be unequipped (i.e. [/COLOR][COLOR=#FBD5B5][B]hidden[/B][/COLOR][COLOR=#D8D8D8]) unless \\'adventuring\\'. They will still be available if your followers need them.[/COLOR]\r\n[*][COLOR=#D8D8D8]Outfits will not be changed if you are already in combat (e.g. if your follower wants to chase after an enemy on the other side of the river, they won\\'t strip off to do so). [/COLOR]\r\n[*][COLOR=#D8D8D8]Optionally an outfit from \\'Adventuring\\' can be automatically equipped if combat is started and your follower is under-dressed.[/COLOR]\r\n[*][COLOR=#FBD5B5][B]Arrows[/B][/COLOR][COLOR=#D8D8D8] - Followers now find it annoying removing clothes when they are pinned on with arrows, so they [/COLOR][COLOR=#FBD5B5][B]will attempt to remove arrows[/B][/COLOR][COLOR=#D8D8D8] when undressing. Optionally, they can be told to remove arrows periodically (without undressing), although you\\'ll have to help them with darning the holes yourself.[/COLOR]\r\n[*][COLOR=#D8D8D8]When you first talk to a follower about their clothing they will attempt to equip their \\'best\\' adventuring gear from their inventory (using the usual AI decisions for this process). This will also generate \\'real\\' clothing items from their vanilla outfits and enable you to add these to a Wardrobe Manager outfit if you wish. Similarly, whenever you configure an \\\"Adventuring\\\" outfit, you will have an option [/COLOR][COLOR=#FBD5B5][B]\\\"Have you got anything better?\\\"[/B][/COLOR][COLOR=#D8D8D8] which will cause the follower to equip their \\'best\\' adventuring gear. [/COLOR]\r\n[*][COLOR=#D8D8D8]On follower death, all their stored items are placed on their corpse, and their storage space made available to any new followers.[/COLOR]\r\n[*][COLOR=#D8D8D8]During the \\\"[/COLOR][COLOR=#FBD5B5][B]show me what we decided on before[/B][/COLOR][COLOR=#D8D8D8]\\\" dialog the follower stands still and bookmarks the dialog at the \\'show me\\' activity so that you can quit out of the dialog menu and take a look around your follower and really check out that outfit before deciding whether to keep it, change it or forget it, and then resume your discussion where you left off. If you get distracted or interrupted, the bookmarked outfit dialog is forgotten so the next time you speak to your follower you\\'ll get the normal follower menu.  (The time-out value is configurable within the mod settings menu.)[/COLOR]\r\n[/LIST]\r\n\r\n[COLOR=#ea7500]--- R E Q U I R E M E N T S ---[/COLOR]\r\n[COLOR=#D8D8D8][URL=http://skse.silverlock.org/]SKSE [/URL](1.06.11)\r\nSkyrim 1.9.29.0.8 \r\nNB: Not tested with any DLC as I have none (cry)[/COLOR]\r\n\r\n[COLOR=#ea7500]--- O U T F I T -  P R O B A B I L I T I E S ---[/COLOR]\r\n[LIST]\r\n[*][COLOR=#D8D8D8]All outfits within a given category are picked at random when the follower determines circumstances call for a new outfit.[/COLOR]\r\n[*][COLOR=#D8D8D8]You may optionally tell your follower you prefer one outfit for a given category, which will cause that outfit to get picked more often than any others. [/COLOR]\r\n[*][COLOR=#D8D8D8]You can also tell a follower to always wear one particular outfit for a given category, which might be handy if you have provided resist gear for a particular encounter type. To unset \\'always wear\\' you simply have to review the outfit with your follower via the \\\"show me\\\" dialog branch, and tell them you don\\'t mind how often they wear it.[/COLOR]\r\n[*][COLOR=#D8D8D8][U]Optionally[/U], if you have no outfits of a matching type, the next most appropriate will be tried. (eg: in town:  town -> [/COLOR][COLOR=#D8D8D8]best -> adventuring[/COLOR][COLOR=#D8D8D8]) For example, if you visit a palace, smart clothes will be worn, but if you have not given your follower any \\'smart\\' outfits to wear, they\\'ll pick from any \\'town clothes\\' you\\'ve given them.To help you, you can ask your follower for a list of which outfit slots are in use and what their associated probability is.[/COLOR]\r\n[*][COLOR=#D8D8D8]If your follower is wearing a remembered outfit and you change how often the follower is to wear it, how often it actually gets worn will depend on whether you have set any preferences on other outfits in that category:[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . [/SIZE][/COLOR][B]- [/B][COLOR=#D8D8D8]if you set any preference (\\'wear more often\\' or \\'always wear\\') then this is what happens[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . [/SIZE][/COLOR][B]- [/B][COLOR=#D8D8D8]if you tell your follower you \\'don\\'t mind\\' how often they wear it, then your follower tries to respect their standing instructions:[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . . . . [/SIZE][/COLOR][B]* [/B][COLOR=#D8D8D8]if there is another outfit in that category set to \\'always wear\\', then your current outfit\\'s probability of being picked is zero.[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . . . . [/SIZE][/COLOR][B]* [/B][COLOR=#D8D8D8]if there is another outfit in that category set to \\'wear more often\\' then your current outfit will be worn, but less often than the other one.[/COLOR]\r\n[*][COLOR=#D8D8D8]Similarly if you have your follower forget an outfit, probabilities will be recalculated so that any remaining \\'preferred\\' outfits will still be preferred as you would expect. If you have your follower forget an \\'always wear\\' outfit, any remaining outfits that had been [/COLOR]\r\n[*][COLOR=#D8D8D8]You can have your follower summarise what outfits are assigned to a category.  They will tell you only about outfits you\\'ve had them remember, including any that are currently zero-probability to wear (because you\\'ve told them to always wear a different outfit) and \\'naked\\'outfits.  Empty (unassigned) outfit slots are not reported.\r\n[/COLOR]\r\n\r\n[/LIST]\r\n[COLOR=#ea7500]--- F O R G E T T I N G  -  O U T F I T S ---\r\n[/COLOR][COLOR=#D8D8D8]Outfits are stored in eight numbered wardrobe slots per category, so if your follower is told to forget an outfit, the corresponding slot becomes free. During the \\'show me\\' dialog, only the slots with a remembered outfit will be shown, so if you previously had outfits in slots 1,2 and 3 then your follower forgets slot 2, the \\\"show me\\\" dialog will offer to show you outfit slots 1 and 3.[/COLOR]\r\n\r\n[COLOR=#ea7500]---U N D E R C L O T H E S / N U D I T Y ---\r\n[/COLOR][COLOR=#D8D8D8]Underclothes (or nudity if you use a nudity mod) counts as an outfit. The easiest way to set an outfit as \\'naked\\' is to offer a new outfit and close the special outfit inventory without adding any items. (You can also edit an outfit and remove all items from the current outfit inventory.)  The first outfit in the swimming and sleeping categories is set to \\'naked\\' by default. These can be changed.[/COLOR]\r\n\r\n[COLOR=#ea7500]--- D I S A B L I N G - A - C A T E G O R Y ---\r\n[/COLOR][COLOR=#D8D8D8]If you don\\'t want your follower to change clothes to suit one of the categories simply have them forget any outfits within that category. So for example if you didn\\'t want them to change into \\'smart\\' clothes on entering the blue palace, simply leave the \\'Smart\\' category empty of outfit options. NB - assigning a \\'naked\\' outfit as \\\"always wear\\\" is not the same thing as an empty clothing category, and would simply have them undress every time that clothing category was applicable.[/COLOR]\r\n\r\n[COLOR=#ea7500]--- N E W - O U T F I T S - A N D - E D I T I N G ---[/COLOR]\r\n[COLOR=#D8D8D8]A special inventory is opened and your follower\\'s current outfit (if already \\'remembered\\') is temporarily unequipped to it so you can remove or add items. Your follower may randomly equip items from their personal inventory while you do this, but this is only temporary and they\\'ll dress in whatever items are in the inventory (if any). If you provide multiple items for the same slot, they are equipped using the usual AI priority rules, and only the items that get equipped are recorded as part of the outfit.\r\nNew outfits can also be created based on what the NPC is wearing now, unless what they are wearing it is a \\'remembered\\' outfit). A worn outfit that is already remembered outfits will simply have its probability of wearing changed to your preferences.\r\nWhen you\\'ve finished discussing outfits, your follower will change back into whatever is the most appropriate outfit at the time.[/COLOR]\r\n\r\n[B][COLOR=#ea7500]--- C U S T O M I S A B L E – L O C A T I O N S ---[/COLOR][/B]\r\n\r\n[COLOR=#D8D8D8]There are four main ways of triggering outfit changes which are prioritised as follows (higher wins out over lower):[/COLOR]\r\n[LIST]\r\n[*][COLOR=#FAC08F][B]Special events[/B][/COLOR]\t   [COLOR=#D8D8D8][I]eg Sleeping, Swimming, Combat[/I][/COLOR]\r\n[*][COLOR=#FAC08F][B]Position fixes[/B] [/COLOR]\t    [COLOR=#D8D8D8][I]coordinates and area method[/I][/COLOR]\r\n[*][B][COLOR=#FAC08F]Named places[/COLOR][I]\t    [COLOR=#D8D8D8][/I][/B][I]named (Bethesda) Locations are checked before named interior Cells[/I][/COLOR]\r\n[*][COLOR=#FAC08F][B]Keywords[/B][/COLOR]\t\t\t [COLOR=#D8D8D8][I]only one keyword needs to match[/I][/LIST][/COLOR]\r\n[COLOR=#D8D8D8]For each location trigger type, the checks are made against outfit types in the order they appear in the menu, so if a location (set using the same method) matches a home outfit and also a town outfit, the home outfit will be equipped.   Any \\\"adventuring\\\" outfit will be equipped if no alternative matches are made or if there is a problem. [/COLOR]\r\n\r\n[COLOR=#D8D8D8]Outfits are checked against locations:[/COLOR]\r\n[LIST][COLOR=#D8D8D8]\r\n[*]when changing location \r\n[*]on a timer for each follower (interval adjusts depending on results of last check plus user option)\r\n[*]when entering a position fix area[/COLOR][/LIST]\r\n[B]“[COLOR=#FAC08F]Named places[/COLOR]”[/B][COLOR=#D8D8D8] are either a proper \\\"Location\\\" (in Bethesda terminology) or an interior (i.e. dungeon or building).  Since interiors can also be designated as Locations, the Location name is used in preference over the interior\\'s cell name.  Exterior cells often share non-unique names (eg \\\"wilderness\\\") so it didn\\'t make sense to include these.  Currently \\'child\\' and \\'sibling\\' locations are not automatically included (but I may add this in the future).[/COLOR]\r\n\r\n[COLOR=#D8D8D8]\\\"changing location\\\"  can be moving from an un-named location to a named or vice versa,   or moving between two named locations.[/COLOR]\r\n\r\n[COLOR=#D8D8D8][U]Note:[/U] Bethesda Locations and keywords are set for a variety of game purposes, so you may find a trigger in the middle of nowhere.    A good example is on the road from Whiterun to Dragon Bridge,  where there is a small patch (just past the road running back up into the mountains) desginated via keywords as a \\\"town\\\" type location.   (If this sort of thing bothers you, you may now set a position fix for that area to override it with \\\"adventuring\\\")[/COLOR]\r\n\r\n[COLOR=#D8D8D8][U]Note:[/U] followers go into a \\'suspended\\' state when they aren\\'t around the player and ignore most of the usual triggers (with the notable exception of \\'dress for combat\\', if enabled).[/COLOR]\r\n\r\n[COLOR=#D8D8D8]Any locations you add for the “Sleep” or “Swimming” categories may be automatically shared with[/COLOR] [URL=http://skyrim.nexusmods.com/mods/34096/][COLOR=#4f81bd][B][I]\\\"Skinny Dipping\\\"[/I][/B][/COLOR][/URL] [COLOR=#D8D8D8]if you have it installed.[/COLOR]\r\n\r\n[COLOR=#ea7500]--- O U T D O O R – G E A R ---[/COLOR]\r\n[COLOR=#D8D8D8]Specific types of items (gloves, hoods, cloaks, backpacks) can be restricted to outdoor and bad weather use only. If it is not snowing or raining or if you are indoors then these items will not be equipped (whether they are part of an outfit or not). The vanilla AI or 3rd party mods will be allowed to equip such items , overriding the \\'disallow non-outfit\\' option.[/COLOR]\r\n\r\n[COLOR=#ea7500]--- S U B T I T L E S ---[/COLOR]\r\n[COLOR=#D8D8D8]As with any new dialog in mods, there are responses that simply haven\\'t been recorded by the original voice actors. I have used generic dialog responses where possible, but also tried to avoid the same - surprisingly few - generic options which can get very tedious to listen to. To compensate for this, just during the wardrobe manager dialog portions subtitles are turned on (if they aren\\'t already), and are turned off again (if they were already off) when you either quit out of dialog or return to the top dialog level. Your dialog subtitle preferences should be preserved outside of this mods dialog portions, the only exception shown in testing is if you force quit /crash out of the game right in the middle of the affected dialog.[/COLOR]\r\n\r\n[COLOR=#ea7500]--- S T A B I L I T Y , -  P E R F O R M A N C E -  & -  D E S I G N -  N O T E S - ---\r\n[/COLOR][COLOR=#D8D8D8]This mod consists of [/COLOR][COLOR=#FBD5B5][B] almost seven thousand lines of code[/B][/COLOR] at the time of writing. While it isn\\'t possible to guarantee there will be no bugs I thought it would be reassuring / interesting to some to lay out where I am coming from as the mod author. - We\\'re talking a [COLOR=#FBD5B5][B]couple of hundred hours of development and testing[/B][/COLOR][COLOR=#D8D8D8] here, so it is highly likely to do what it is meant to, and very unlikely to do things it isn\\'t :P\r\n[/COLOR][LIST]\r\n[*][COLOR=#D8D8D8]Housekeeping occurs every game load, and there is also the option to manually trigger a non-destructive maintenance routine as well as a full reset.[/COLOR]\r\n[*][COLOR=#D8D8D8]Designed with \\\"threadsafe\\\" transaction locking techniques to handle situations where multiple triggers try to set an outfit, which preserves the integrity of the outfits and makes for a speedier and more cosmetically pleasing changing process[/COLOR]\r\n[*][COLOR=#D8D8D8]Designed with a highly modular / re-usable code structure which eliminates the issue of bugs lurking in rarely used code portions (inevitably there will be bugs as with any software, but this designs out one cause of them not getting found).[/COLOR]\r\n[*][COLOR=#D8D8D8]Designed with speed in mind: the decision tree for outfit changes is kept as fast as possible both by the design of the decision process and by specific coding choices within it that avoid  impacting \\\"live\\\" gameplay. This efficiency is further enhanced by additional techniques such implementing random delays to spread out the actions of multiple followers, and decreasing or disabling clothing updates where appropriate (such as in combat, or when followers aren\\'t in your vicinity). [/COLOR]\r\n[*][COLOR=#D8D8D8]Fail-safe behaviour: items are never deleted, and are returned to the npc in the event of any problems or their death.  [/COLOR]\r\n[*][COLOR=#D8D8D8]The mod makes no changes to base objects (the only change it makes as such is where it programmatically alters the two \\\"vanilla\\\" follower outfits for those followers you choose to manage). The mod runs via quest aliases in the usual manner.[/COLOR]\r\n[*][COLOR=#D8D8D8]This mod has been heavily tested during development by bossing a gang of followers around and poring over copious debugging output. [/COLOR]\r\n[/LIST]\r\n\r\n[COLOR=#ea7500]--- C O M P A T I B I L I T Y ---\r\nNPC mods with their own outfit management behaviour[/COLOR]\r\n[COLOR=#D8D8D8]While there *should* be no issue with having this mod installed alongside such mods, I strongly recommend you do not use the features of this mod with followers / companions who already manage their own gear. It should sit alongside them in the same game quite happily, since it doesn\\'t change any base objects.  [I]See the FAQ for how to remove the initial dialog option from a particular follower.[/I][/COLOR][I]\r\n[/I]\r\n[COLOR=#ea7500]Other follower outfit mods[/COLOR]\r\n[COLOR=#D8D8D8]This mod should be essentially compatible with any mod using the standard Skyrim outfit system since that mod would have no need to remove normal inventory items from the follower, and my mod doesn\\'t remove anything from the follower it hasn\\'t been specifically told about. Be aware that the first-time dialog with the follower manipulates the default and sleep outfits. The obvious issue with mods that manage follower outfits would be where the two mods tried to apply outfit changes based on the same trigger condition (e.g. being in a player home), which could be managed in that instance by removing all outfit options from Wardrobe Manager\\'s Home category. Any mod which removes items that are part of an outfit will potentially cause that outfit choice to be \\'forgotten\\' [I](see \\\"Stability, performance & design\\\" and \\\"Future\\\")[/I][/COLOR]\r\n\r\n\r\n[COLOR=#ea7500]--- F U T U R E ---[/COLOR][COLOR=#ea7500]\r\nPlanned in next release:[/COLOR]\r\n[COLOR=#D8D8D8][I](NB this is just my current work flow, and may change depending on how time consuming / feasible fixes turn out to be.)[/I]\r\n[/COLOR][LIST]\r\n[*][COLOR=#D8D8D8]Bug fixes resulting from user feedback - TBC.[/COLOR]\r\n[*][COLOR=#D8D8D8]Add \\'deletion\\' capability to the synching with Skinny Dipping positions.[/COLOR]\r\n\r\n[/LIST]\r\n[COLOR=#ea7500]On the \\\"wish list\\\" but schedule to be confirmed:[/COLOR]\r\n[LIST]\r\n[*][COLOR=#D8D8D8]Weapons and shields:[/COLOR][/LIST]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . .[/SIZE][/COLOR][COLOR=#D8D8D8]- currently the option to remember is \\'global\\', would like to make it individual. [/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . .[/SIZE][/COLOR][COLOR=#D8D8D8]- add a mechanism for adding alternative weapons (e.g. ranged if melee equipped or vice versa) as part of the \\\"outfit\\\"[/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . .[/SIZE][/COLOR][COLOR=#D8D8D8]- add a way of instructing a follower which hand to equip with which item for all you micromanagers out there :P[/COLOR][LIST]\r\n[*][COLOR=#D8D8D8]Add an option to allow outfit to be changed if already in combat (e.g. if you feel it is unrealistic for your follower to remain kitted out in full plate while (in defiance of physics) swimming across a river to chase an enemy ....)[/COLOR]\r\n[*][COLOR=#D8D8D8]Change feedback about invalidated outfits being forgotten.[/COLOR]\r\n[*][COLOR=#D8D8D8]Disable outfit changes on individual followers (currently possible to do this globally).[/COLOR]\r\n[*][COLOR=#D8D8D8]Optionally the outfit can be deemed invalid after it has \\'lost\\' a certain number / type of items.[/COLOR]\r\n[*][COLOR=#D8D8D8]Add a friendly way to include / exclude followers from this mod\\'s starting dialog. (See FAQ for further details)[/COLOR]\r\n[/LIST][COLOR=#D8D8D8]\r\nIf the various (serious) bugs and limitations with formlist manipulation in the current Papyrus version get fixed, it will be possible to finish building this the way I originally began, which would allow for \\'virtualised\\' outfits where a given item could be used in multiple outfits, and a lot of the \\'safety\\' code would no longer need to be wrapped around the core transactional functions (and less complexity is usually a good thing I find!). Since this would imply a substantial re-write, I\\'d probably only do this now if the present design failed to perform well after release.[/COLOR]\r\n\r\n[COLOR=#ea7500]--- M Y - O T H E R - M O D S ---[/COLOR]\r\n[COLOR=#D8D8D8]The functionality of this mod grew out of my learning experiences authoring my other mod [URL=http://skyrim.nexusmods.com/mods/34096/]Skinny Dipping [/URL] which allows the player to automatically undress when swimming, and handles where their gear goes / encumbrance various configurable ways. If you want a simple and more realistic alternative to perfect buoyancy while wearing plate armour and carrying twenty eight times your body weight, check it out :P[/COLOR]\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n\r\n\r\n\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------------------\r\n[COLOR=#ea7500]--- G E N E R A L -  F A Q ---[/COLOR][COLOR=#ea7500]\r\nWhy only eight followers?[/COLOR]\r\n[COLOR=#D8D8D8]Because there had to be a limit as a result of the coding choices imposed by Papyrus (and some key Papyrus bugs) and it seemed unlikely to me that anyone would want to micro-manage wardrobe choices for more than eight. See note in \\'Future\\' section. While I\\'ve made an effort to make it possible to expand beyond eight followers (and would be willing to do so if there was strong demand), I\\'d be concerned about the impact on speed (and to a lesser extent, memory and save game size).[/COLOR]\r\n\r\n[COLOR=#ea7500]Why only eight outfits / why only eight outfit options per outfit?[/COLOR]\r\n[COLOR=#D8D8D8]See the answers to the previous question. The usability of even more dialogue options becomes an issue where these are concerned. [/COLOR]\r\n\r\n[COLOR=#ea7500]Is this compatible with mod X? [/COLOR]\r\n[COLOR=#D8D8D8]All testing to date done with [URL=http://skyrim.nexusmods.com/mods/14037]UFO[/URL] installed, using vanilla , home-made and mod-added (eg [URL=http://skyrim.nexusmods.com/mods/17823]Apachii [/URL]) followers without any issues.\r\nI also had [URL=http://skyrim.nexusmods.com/mods/26393]Vilja [/URL]and [URL=http://skyrim.nexusmods.com/mods/20787]Ceriwiden [/URL] installed all through testing, and their own clothing management features were unaffected by this mod.[I] (NB: I did not attempt to use this mods features with those NPC, this is simply noting that the two mods coexisted without any conflicts).[/I]\r\nThis has been play-tested with a number of mods installed([URL=http://skyrim.nexusmods.com/articles/1110/]see my mod list[/URL]), most notably ones like [URL=http://skyrim.nexusmods.com/mods/27563]Wet and Cold [/URL]which add clothing items periodically to NPCs, and which coexisted quite happily with no problems observed in-game or in the logs (which I have spent a great deal of time looking at!).  For example, Wet and Cold will add items per its triggers, and this mod will remove them when the follower next has to make an outfit change, or when Wet and Cold has equipped an item that conflicts with an item that is part of an outfit.[/COLOR]\r\n\r\n[COLOR=#ea7500]Can I make a suggestion ?[/COLOR]\r\n[COLOR=#D8D8D8]Yes please! :P Any ideas for improvements and new features are welcomed. ([URL=http://forums.nexusmods.com/index.php?app=members&module=messaging&section=send&do=form&fromMemberID=227598]Contact me[/URL]). I will always try to prioritise bug fixes or improvements to existing functionality, but sometimes new stuff is more interesting ;-)[/COLOR]\r\n\r\n[COLOR=#ea7500]My follower is randomly getting naked. How can I stop them?[/COLOR]\r\n[COLOR=#D8D8D8]This happens when you\\'ve tried to remove an outfit option, and instead of telling them to forget the outfit via a dialog option, you\\'ve perhaps edited it using the inventory-style dialog and removed all the outfit components. An empty outfit means \\'be undressed\\' is the option they should remember. To forget an outfit, simply get them to show you what outfits they have in a category and tell them you don\\'t like what they are wearing. This will work for getting rid of the \\'naked\\' outfit option too: when you tell them to \\\"Show me outfit x\\\" and they get undressed, just tell them \\\"No, I really don\\'t think that one is right\\\". Or you could offer to make changes to the outfit and give them something to cover up with :P\r\n[/COLOR]\r\n[COLOR=#ea7500]Is there any way to create a custom category?[/COLOR]\r\n[COLOR=#D8D8D8]There are two \\'Custom\\' categories which work just like the other categories.  If you need more than two categories, In version 2 you could use any category apart from sleep or swimming for any purpose / location settings you like.[/COLOR]\r\n\r\n[COLOR=#ea7500]How do I make my follower get undressed / be naked?\r\n[/COLOR][COLOR=#D8D8D8]Simply offer them a new outfit, and close the \\\"New Outfit\\\" menu without giving them anything. You can assign the usual preferences to this, so if you want your follower to always be in their underwear (/naked) at home, just tell them to always \\'wear\\' the empty outfit.\r\n[/COLOR]\r\n[COLOR=#ea7500]Can I use your mod in my mod?[/COLOR]\r\n[COLOR=#D8D8D8]Probably :P I\\'m open to the idea but I\\'d need to be sure we could handle things like users getting the latest version and support where needed. I\\'d be willing to make modifications to this mod to sit within another mod, but I don\\'t currently want to share dev ownership of this mod (specifically I don\\'t want to end up supporting multiple flavours of this mod with drastically different code that may have been altered by someone else, and I\\'d like to ensure that all implementations of the mod benefit from any changes.). Have your people call my people ... [/COLOR]\r\n\r\n[COLOR=#ea7500]That\\'s a lot of dialog - any plans to make a menu management system?[/COLOR]\r\n[COLOR=#D8D8D8]There are some ways of doing this I might explore if there is demand. Personally I don\\'t find I want to make changes to my follower\\'s outfits very often once they are set up, and I greatly prefer the immersion of managing this via the NPC themselves so you can try on the outfit etc. I have some ideas around using SkyUI - MCM but I\\'m not currently posting this as a \\'future\\' because I\\'d need to do a proof of concept first.[/COLOR]\r\n\r\n[COLOR=#ea7500]How can I remember the weapons for just one follower but not for the rest?[/COLOR]\r\n[COLOR=#D8D8D8]The recommended workaround is to make the configuration change to enable the option to remember weapons, configure your follower and then turn the option off again. The weapons will be remembered until you make any changes to the outfit contents. See the Future section for more.[/COLOR]\r\n\r\n[COLOR=#ea7500]Isn\\'t it cheating / unbalancing to provide a way of storing lots of heavy armour \\\"somewhere\\\"?[/COLOR]\r\n[COLOR=#D8D8D8]Once you\\'ve used the mod you\\'ll see that this only allows you to give followers items to keep that they can wear and nothing more. Arguably if you wanted them to \\\"look after\\\" armour sets for you, then you could do that, but it isn\\'t a particularly convenient way of doing it as you\\'d have to go through several menu interactions to give / retrieve the items concerned.[/COLOR]\r\n\r\n[COLOR=#ea7500]I don\\'t want to manage a particular follower\\'s outfits with this mod, is there any way I can get rid of the initial dialog option?[/COLOR]\r\n[COLOR=#D8D8D8]Yes - easily. You may want to do this if you have a special follower who already manages their own gear.\r\nOpen the console, click on your follower (their reference will appear below the crosshairs when you do this). \r\n\r\ntype:  [CODE]help jemWMExcludes[/CODE]\r\n\r\nyou\\'ll get something back like:  [CODE]FACT: (xx053989) \\'jemWMExcludes\\'[/CODE]\r\n\r\nIn theory you\\'ll have the number in brackets with two digits instead of the xx.   What you then do is replace your value in brackets in this example:\r\n\r\n[CODE]addtofaction xx053989 1[/CODE]\r\n\r\nThis will hide the dialog menu \\\"I think we should try to put together something more appropriate for you to wear\\\". If you\\'ve already selected this option, you should dismiss them from the mod by selecting \\\"I think you can make your own outfit choices now\\\". (See Future section for further details.)[/COLOR]\r\n\r\n[COLOR=#ea7500]What makes followers decide to change outfits?[/COLOR]\r\n[COLOR=#D8D8D8]Outfit changes are either “triggered” or “timed”.\r\nTriggered updates are things such as going to sleep, going for a swim, entering a town etc.\r\nTimed updates are a secondary mechanism to check that the current clothing is still appropriate. These updates are spaced out randomly (with larger random delays after outfits have been successfully changed etc.).   You can increase the interval between updates by changing the “check outfit interval multiplier” in the configuration menu.  This allows you to reduce it to a window of  approx. 20s average, and increase it up to 5 mins average.[/COLOR]\r\n\r\n\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n\r\n\r\n\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------------------\r\n[COLOR=#ea7500]--- T R O U B L E S H O O T I N G -  - F A Q ---\r\nI don\\'t see the choices to add or remember outfits[/COLOR]\r\n[COLOR=#D8D8D8]The outfit category you are using is full use the \\\"Show me\\\" option to review, change or forget outfits.[/COLOR]\r\n\r\n[COLOR=#ea7500]The follower doesn\\'t offer me any Wardrobe Manager dialog options.[/COLOR]\r\n[COLOR=#D8D8D8]They should have told you that they spotted that you were \\\"out of storage space\\\" in other words, you\\'ve already taken on managing outfits for the maximum number of followers (currently 8).[/COLOR]\r\n\r\n[COLOR=#ea7500]I think I have found a bug / something has gone wrong can you help?[/COLOR]\r\n[COLOR=#D8D8D8]If it isn\\'t an easily described issue the first thing to do is to turn on script debug logging so you can capture the logs and send them on to me for analysis.\r\n1)   Turn on papyrus logging for ALL scripting (not just this mod). [/COLOR]\r\n[COLOR=#313131][SIZE=1]. . . .[/SIZE][/COLOR][COLOR=#D8D8D8]a)   You must enable logging via the  [CODE]<Skyrim saved games folder>\\\\skyrim.ini[/CODE] file for this feature to take effect[/COLOR] \r\n[COLOR=#313131][SIZE=1]. . . .[/SIZE][/COLOR][COLOR=#D8D8D8]b)   Take a copy of your skyrim.ini[/COLOR] \r\n[COLOR=#313131][SIZE=1]. . . .[/SIZE][/COLOR][COLOR=#D8D8D8]c)   Edit Skyrim.ini using notepad or similar. There should be a [/COLOR] [CODE][Papyrus][/CODE][COLOR=#D8D8D8] heading, but you can add this if it is missing. Set the following options to 1 as shown or just add these three lines under [Papyrus] if they are missing:[/COLOR] \r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . [/SIZE][/COLOR][CODE]Add bEnableLogging=1[/CODE]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . [/SIZE][/COLOR][CODE]bEnableTrace=1[/CODE]\r\n[COLOR=#313131][SIZE=1]. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . [/SIZE][/COLOR][CODE]bLoadDebugInformation=1[/CODE][COLOR=#D8D8D8]\r\nFor best performance set these values back to zero when done.\r\nLogs are output to [CODE]<Skyrim saved games folder>\\\\Logs\\\\Script [/CODE]and the latest log is called Papyrus.0.Log\r\n    \r\n2)   Set this mod\\'s logging level within the MCM mod options:\r\n[/COLOR][LIST]\r\n[*][COLOR=#D8D8D8]Level 0 (Off) Useful in case you need logging on for other mods and this mod is being too chatty.[/COLOR]\r\n[*][COLOR=#D8D8D8]Level 1 (Default) will help you see things like: the logic of how a particular outfit is being chosen if you have alternatives enabled; when outfit decisions are being made.[/COLOR]\r\n[*][COLOR=#D8D8D8]Level 2 (Max) will generate *lots* of debug output about what it is doing if you can repeat an issue with full (maximum setting) logging enabled, I\\'ll be able to help you much more quickly by looking at these detailed logs. [/COLOR]\r\n[/LIST]\r\n\r\n[COLOR=#D8D8D8]NB: All errors will show up irrespective of the logging level setting, but warnings are only shown when the relevant logging option is enabled.\r\n\r\n3)   It is possible to disable all triggers for followers so that they will no longer change outfits. This can be really helpful for diagnosing issues, but be aware this will currently disable chunks of the dialog as a side effect. \r\nThere is also a (normally) hidden dialog which might help:\r\n[/COLOR][LIST]\r\n[*][COLOR=#D8D8D8]Housekeeping allows you to manually kick the housekeeping function that runs on game load, [/COLOR]\r\n[*][COLOR=#D8D8D8]Maintenance does more than housekeeping but does require very briefly suspending the mod functioning etc. and so is left as a manual option for you here.[/COLOR]\r\n[*][COLOR=#D8D8D8]Reset this is a full programmatic reset which will return all outfit items to followers and attempts to return the mod to as near to a fresh install state as possible. This option should always be tried before a mod uninstall / reinstall [/COLOR][/LIST][COLOR=#D8D8D8]\r\nThese options have worked well for me during testing where I was trying very hard to break things, so I\\'ve made them available to you so to minimise inconvenience of any problems, but if you do hit a bug it would be great if you could still [URL=http://forums.nexusmods.com/index.php?app=members&module=messaging&section=send&do=form&fromMemberID=227598] report it.[/URL]\r\n\r\n4)   If the issue is with one particular follower, a workaround for your issue might be to dismiss them from the wardrobe manager (option \\\"I think you can make your own outfit choices now\\\"). This process wipes all settings associated with the follower, and is the next best thing to a full reset. You can then resume managing them as if they were a new follower.[/COLOR]\r\n\r\n\r\n[COLOR=#ea7500]My follower won\\'t wear their outfit[/COLOR]\r\n[LIST=1]\r\n[*][COLOR=#D8D8D8]Use the \\'show me\\' dialogue option to check they still know about an outfit. If some of the outfit\\'s components were taken away from the NPC then the outfit may have been \\'forgotten\\'. Watch out for your followers standing still with their hands behind their backs - if this happens outside of dialogue, it is their way of letting you know. (See Future section) .[/COLOR]\r\n[*][COLOR=#D8D8D8]If they know about an outfit but never wear it, you may have set another outfit to \\'always wear\\'. Try setting your problem outfit to a preferred state to test if this is the case.[/COLOR]\r\n[*][COLOR=#D8D8D8]If the above steps don\\'t help, it sounds like you\\'ve hit a bug. See \\\"I think I have found a bug / something has gone wrong - can you help?\\\"[/COLOR]\r\n[/LIST]\r\n[COLOR=#ea7500]Followers are going through rapid outfit changes when entering certain zones[/COLOR]\r\n[COLOR=#D8D8D8]When your followers load into a new location they will sometimes (but not always) appear in their adventuring outfit as this is the default. They should immediately dress in the appropriate outfit if they need to change (you actually have to turn around pretty fast after zoning to even spot this most of the time). [/COLOR]\r\n\r\n[COLOR=#ea7500]Followers are changing between outfits for no reason[/COLOR]\r\n[COLOR=#D8D8D8]This mod has several design features that specifically prevent it from making rapid outfit changes itself, so it’s unlikely to be this mod on its own that is the problem, but more likely this mod and another one fighting. Having said that, there are several things you can try that might help:\r\n[/COLOR][LIST=1]\r\n[*][COLOR=#D8D8D8]Try setting the \\\"Disable automatic outfit changes\\\" option, which will stop all followers from receiving any instructions to change outfits from this mod. If your followers still show the issue, it really can\\'t involve this mod.[/COLOR]\r\n[*][COLOR=#D8D8D8]Try increasing the \\\"Check outfit interval multiplier\\\" option, which at the maximum end means the mod shouldn\\'t make more than one clothing change every 10 minutes or so (the smallest setting is around 15s average). [/COLOR]\r\n[*][COLOR=#D8D8D8]Ensure that \\\"Allow alternative outfit types\\\" is disabled. This can lead to as many as four outfits (at the time of writing) being considered. By design, equipping the first valid outfit, should cause it to stop looking, but if we\\'re looking for bugs this is a good place to start in this instance.[/COLOR]\r\n[*][COLOR=#D8D8D8]Try disabling the \\\"Dress in adventuring clothes if entering combat\\\" option : if there is a combat alarm on the actor, even if they aren\\'t actively fighting its possible they could be dithering in and out of hunt / combat mode.[/COLOR]\r\n[*][COLOR=#D8D8D8]If that doesn\\'t help, try disabling other mods that make real-time changes to equipment and test if it still happens. If it does still happen or if you\\'ve established it is a bug with this mod then please get in touch with me.[/COLOR]\r\n[/LIST]\r\n\r\n[COLOR=#ea7500]My follower doesn\\'t have the initial dialog to allow me to manage their wardrobe[/COLOR]\r\n[COLOR=#D8D8D8]This dialog is only available to followers in the \\\"Potential Follower\\\" , \\\"Potential Hireling\\\" and \\\"Potential Marriage\\\" factions (Factions, eh? - factions are just categories of NPCs used by the game to determine things like friend or foe, merchant, guard, bandit etc.). If you are using a custom follower, the issue may be that they are not in one of these factions. This may be a deliberate design decision by your follower\\'s mod author to protect them / your game from issues with other mods that modify followers. While it is technically easy to add the follower to one of these factions via the console, you may prefer to get in touch with me or your follower\\'s mod author and we can work something out (technically it\\'s easy to fix, it\\'s just whether we really should or not ). As a possible workaround I have provided a factions that does other than allow the use of this mod, but use at your own risk.\r\nTo do so, open the console, click on the relevant NPC (their ref will be displayed below the crosshair when you do this). \r\n\r\ntype:  [CODE]help jemwmpotentialadds[/CODE]\r\n\r\nyou\\'ll get something back like:  [CODE]FACT: (xx053988) \\'JemWMPotentialAdds\\'[/CODE]\r\n\r\nIn theory you\\'ll have the number in brackets with two digits instead of the xx.   What you then do is replace your value in brackets in this example:\r\n\r\n[CODE]addtofaction xx053988 1[/CODE][/COLOR]\r\n\r\n[COLOR=#ea7500]Dialog is getting stuck[/COLOR]\r\n[COLOR=#D8D8D8]This was reported as happening after selecting the \\\"Lets talk about what you are wearing\\\" dialogue,  and the symptom was that the dialogue wouldn\\'t proceed to the next option.  \r\nCheck your skyrim.ini for the line [CODE]bBackgroundLoadLipFiles=1[/CODE] and change the 1 to a zero.  Thanks to PetPet for the report and fix![/COLOR]\r\n--------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n\r\n\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------------------\r\n[COLOR=#ea7500]--- L E G A L -  S T U F F -  - -  D I S C L A I M E R , L I C E N S I N G -  E T C ---[/COLOR]\r\n[COLOR=#D8D8D8]I make no warranty that this mod will not break your game, and you use it at your own risk. Make a save game before you install the mod, and if you experience issues you can always uninstall the mod and revert to your save game. I also make no warranty that it will work at all. Having said all that every reasonable effort has been made to design and test this mod.\r\nI reserve the copyright to this mod, all intellectual property and development rights, and the names \\\"Jem Wardrobe Manager\\\" and \\\"Wardrobe Manager\\\".\r\nYou are free to install this mod for use with Skyrim. You may not use this mod nor any portion of its design or code without my express permission and only then if my work is credited. (Seriously, just ask :) )\r\nThis mod is uploaded to the Nexus (skryim.nexusmods.com) exclusively, and should not be uploaded and made available anywhere else so long as that site is active. This restriction is in recognition of my appreciation of the excellent Nexus Mod Manager tool and website. If you see this mod available for download from anywhere else please let me know. ([URL=http://forums.nexusmods.com/index.php?app=members&module=messaging&section=send&do=form&fromMemberID=227598]Contact me[/URL]).\r\nI reserve the right to change these terms and conditions at any time. Damn I sound so official. I should write this stuff for a living, seriously I\\'m just making this up off the top of my head and it\\'s like I\\'m channelling Denny Crane here.\r\nI acknowledge all rights and trademarks owned by Bethesda\\'s with respect to their product Skyrim, with thanks for making their game open to the modding community.\r\nIf you are still reading this section, I hope you found it less boring than writing it was :P[/COLOR]\r\n--------------------------------------------------------------------------------------------------------------------------------------------------",
  "categoryId": "66",
  "version": "2.2",
  "author": "Qeezer",
  "createdUnix": "1364812629",
  "updatedUnix": "1368134262",
  "containsAdultContent": false,
  "uploadedBy": "qeezer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021649",
      "name": "Wardrobe Manager",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "391",
      "fileName": "Wardrobe Manager-34222-1-0.7z",
      "uploadedUnix": "1364812230",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dfca8ccdbbe84fa9ebf9ef4c88d646ddf1f2a09d136380892d8c7e7403f06cd8/analysis/1407499374/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wardrobe%20Manager-34222-1-0.7z?fid=1000021649&ttl=1535811887&ri=8192&rs=8192&setec=147fb136e93b6a53909ac03b7f8a3d68"
    },
    {
      "fileId": "1000025745",
      "name": "Wardrobe Manager 2-0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "452",
      "fileName": "Wardrobe Manager 2-0-34222-2-0.7z",
      "uploadedUnix": "1366575201",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/364acafe73e5424377da9fb6c8c501eff1f0c80411af6c18d4558d49c5a1f876/analysis/1407533526/",
      "changelogHtml": " Bugfix: Custom races can now be used with this mod.  <br/> \n Bugfix: All equippable slots are now included, including circlets etc. <br/> \n Bugfix: The AI would equip items from their inventory to empty slots.  You may now choose to check for this and unequip extra items.  <br/> \n Bugfix: Followers were sometimes not being triggered to change into adventuring outfits (other than during combat). <br/> \n Bugfix: &#39;Naked&#39; outfits were sometimes being forgotten shortly after use / being added. <br/> \n Bugfix: Offering a new outfit or editing an existing outfit would leave the follower wearing that outfit even if not apropriate to the location until the timed check ran. <br/> \n Bugfix: buggy skyrim alias filling now more tightly managed (combat targets were sometimes behaving as though they were followers) <br/> \n Other: Temples are now included in the &#39;Town&#39; category keywords by default. <br/> \n Other: Debug logged output is now consistentm with key decision triggers more easily visually identified.   <br/> \n Other: When you change the \"check outfit interval\" the random interval is now reset immediately for all followers. <br/> \n Two custom outfit categories to use as you wish (with up to 8 alternative outfits each) <br/> \n Other:  Missing items: Outfits are now only &#39;forgotten&#39; automaticaly when ALL items are missing.  Previously outfits were invalidated if at least one item was missing. <br/> \n New feature: custom locations <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wardrobe%20Manager%202-0-34222-2-0.7z?fid=1000025745&ttl=1535811887&ri=8192&rs=8192&setec=2977b6785882e32c9ebf57ace84dd18c"
    },
    {
      "fileId": "1000026625",
      "name": "Wardrobe Manager 2-1",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "455",
      "fileName": "Wardrobe Manager 2-1-34222-2-1.7z",
      "uploadedUnix": "1367013037",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/c0df23257cc32cb83613f0ac1f93ad0be373503af73b0b9c6bd6bbd333d84491/analysis/1407543424/",
      "changelogHtml": " Other: updating a position for the sleep or swim outfits will prompt the Skinny Dipping mod (if installed) to immediately check the area and undress if appropriate. <br/> \n Bugfix: adding new followers to be managed by WM: sometimes NPCs are already wearing a &#39;real&#39; item from their inventory, so this step can be skipped. <br/> \n Bugfix: when followers were added to the mod sometimes they would end up naked and not wearing their new &#39;real&#39; clothing items.  This would mostly occur when the follower was not yet &#39;following&#39; the player. <br/> \n Other: improved success-testing and reporting when adding new followers to assist troubleshooting. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wardrobe%20Manager%202-1-34222-2-1.7z?fid=1000026625&ttl=1535811888&ri=8192&rs=8192&setec=c040e58f438b9d2081478930dd5e4a3d"
    },
    {
      "fileId": "1000029044",
      "name": "Wardrobe Manager 2-2",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "517",
      "fileName": "Wardrobe Manager 2-2-34222-2-2.zip",
      "uploadedUnix": "1368134262",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/19883e61a56af8173fa9ddbd881a8c332422de4815ac1f727e0b75e7a64543b2/analysis/1407562930/",
      "changelogHtml": " Summary:\r<br />---------------\r<br />Faster and more reliable changing of outfits.\r<br />Multiple changes to reduce the incidence of wrong items (or optionally, additional items) being equipped.  \r<br />Reduces the amount of visible item changes arising from the native AI equipping non-outfit gear. (see notes at end)\r<br />A number of changes to improve responsiveness of dialogue. \r<br />Improvements to debug of output of outfit probabilities, which has enabled a number of bugs in this area to be identified.\r<br />\r<br />Details:\r<br />-----------\r<br />New optional feature: outdoor gear.   Will detect items that are consider &#39;outdoor gear&#39; (hoods, cloaks, gloves, backpacks).  If included as part of an outfit which you have configured they&#39;ll only be worn when conditions indicate it (outdoors and in bad weather).  If &#39;disallow equipping of additional items&#39; is NOT set, you could leave one set of outdoor gear on your follower for all occasions and allow the AI / 3rd party mods to equp them (eg Wet and Cold).  With this mode set, backpacks are permitted indoors only if adventuring gear or custom2 gear is also worn.\r<br />\r<br />Other: \tnew event based checks for worn items means corrections to worn gear are promptly applied.  Previously these would have been left until the scheduled check caught the problem.\r<br />\r<br />Other:  improved dress / storage code further reduces the chance for the vanilla AI equip code to affect the process (potentially before it could sneak an item into an outfit, or leave wrong items equipped)\r<br />\r<br />Other: when you change certain options in the menu, followers are prompted to re-evaluate their outfit to make sure it meets the new rules.\r<br />\r<br />- other: if there is a problem finding a valid outfit, followers should now be prompted to find something suitable from their current inventory.\r<br />\r<br />-other: improvements to the maintenance routine: as part of this, followers will now undress to enable certain settings to be safely flushed.  They will be prompted to dress again after maintenance completes.\r<br />\r<br />- other: a few tweaks to debug to keep level 1 as  &#39;overview + warnings + errors&#39; ,   a few items moved to a &#39;developer&#39; debug level as they were just log spam otherwise.\r<br />\r<br />bugfix: when deleting the last outfit of its type, the dialog will now leave the WM dialogue properly rather than returning to the &#39;catwalk&#39; portion of the dialogue.\r<br />\r<br />bugfix: an error state could have been triggered where individual followers stopped changing outfits if outfit items were removed unexpectedly, and the maintenance routine would have had to be run to fix it.\r<br />\r<br />bugfix: under certain conditions leaving the &#39;catwalk&#39; dialogue wasn&#39;t properly clearing a lock, meaning the follower would not reassess their outfit until certain housekeeping / maintenance actions occurred.\r<br />\r<br />- bugfix &#39;hide weapons&#39; will no longer apply when wearing the adventuring outfit (previously shields and weapons were hidden or periodically being equipped or unequipped)\r<br />\r<br />-bugfix:  the &#39;beta&#39; disable outfit changes wasn&#39;t really working too well and now (apparently) does.  Beta status removed as it has had some attention and testing now.\r<br />\r<br />-bugfix: the  position fix markers weren&#39;t filed under &#39;Miscellaneous&#39;  quest sectiion (pesky upstarts).\r<br />\r<br />- bugfix: followers&#39; mouths sometimes were stuck open. This seems to be a vanilla game bug and would happen in any dialogue especially when you interrupt them in mid speech (by clicking through dialogue etc). Some followers were more prone than others, and would work approx 50% of the time if you reloaded Skyrim completely (otherwise were usually stuck for that game session even if you reloaded).\r<br />\r<br />-bugfix: dialogue not progressing automatically. This now seems to have been related to the stuck mouths issue: fixing that issue seems to have eliminated this issue too.\r<br />\r<br />-bugfix: the bug addressed in 2.1 regarding new follower adds getting naked wasn&#39;t 100%, and so further changes have been made to the routine in question that now actively tests for nakedness :P\r<br />\r<br />-bugfix: where an outfit was being added without a preference weighting to an outfit type which had exactly one outfit already present, probabilities of the new outfit were being incorrectly set to zero (do not wear)\r<br />\r<br />-bugfix: when trying to instruct the follower to \"wear more\" for an outfit currently set to zero chance of wearing, an error was preventing the change being completed.\r<br />\r<br />-bugfix: the automated &#39;forget&#39; which occurs if outfits are missing their items may potentially have been unable to clear probabilities for the affected outfit, which in turn may have resulted in incorrect probability calculations for new outfits to that category.\r<br />\r<br />-bugfix: forgetting an outfit made a minor error in recalculating probabilities (if another outfit in the same category  had been &#39;preferred&#39; it might have gain a slightly higher relative preference weighting).\r<br />\r<br />-bugfix: deleting a position fix while a follower is in that position would not take effect until they left the old trigger zone.\r<br />\r<br />-bugfix: the dialogue option to wear the currently worn clothing with no preference (\"its nothing special ..\" ) was not storing the outfit for a few race / voice type combinations. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wardrobe%20Manager%202-2-34222-2-2.zip?fid=1000029044&ttl=1535811888&ri=8192&rs=8192&setec=c0efdd0d16ad66d8cea4186dd23f0601"
    }
  ]
}