{
  "modId": 34239.0,
  "modName": "SkyJubs Main Menu Aesthetics - Background Replacer Mod",
  "summary": "Advanced Skyrim Main Menu background replacer! 83 new wallpapers in each of the three classy color sets. Full customizable with an auto-installer. Uses a randomizer to alternate the start wallpapers. Requires SKSE. ",
  "descriptionHtml": "[img]http://static.skyrim.nexusmods.com/mods/images/34239-1-1364837099.jpg[/img]\r\n[color=white][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=white][size=4][b]Introduction[/b][/size][/color][/font]\r\n\r\nHi there everyone and welcome to my newest mod on Skyrim Nexus! At first: English is not my native language, so please be kind, if I did some misspelling or grammatically errors. I’ll do my best, to make sure, that you can understand, what I’m writing ;-) \r\n\r\n[color=white][b]What does this mod do?[/color][/b]\r\nThis mod replaces the plain Skyrim Main Menu background with a full customizable set of wallpapers, I found throughout the internet. “Full customizable” means, that you can download my mod as an auto-installer, with which you can install just those main menu backgrounds that you like and leave the rest aside. And right: You can install even more than one background replacer at the same time. If you do so, there will be a random one of your chosen wallpapers, every time you start the game and see the main menu. \r\nBut for sure, that’s not all. In order to expand the Skyrim ambiance, I didn’t just download some wallpapers and convert them to new backgrounds, but I spending many hours of work on those pictures to fit them in sets and give them classy and lore-fitting looks. So I work over the lighting, shadows and the color tone. Also nearly every image is available in two versions: One with ambiance title and one without (you can see this best in the images section of this mod). The three available sets of pictures you see in the banner of this mod (Ancient Gold Edition, Silver Steel Edition, Winter Night Edition) are divided in three different files in the download section. The names of the three editions are related to the base color tone of the particular wallpaper series (gold, silver and dark blue). Every one of the three editions includes 83 wallpapers of which you can choose. All wallpapers are in HD and fit for the resolutions 1920x1080 (HD1080, 16:9) and 1920x1200 (WUXGA, 16:10). For a closer look on many examples, just check the image section of this mod. \r\n \r\n[color=white][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=white][size=4][b]Installation[/b][/size][/color][/font]\r\n\r\nThe mod “Skyjubs Main Menu Aesthetics” works with an auto-installer (for the “Nexus Mod Manager”) and is very easy to handle. But you have to consider two important points:\r\n[list] \r\n[*]At best you use the Nexus Mod Manager to install the mod, so you can be sure, that the auto-installer works with full function. You get the NMM [url=http://skyrim.nexusmods.com/mods/modmanager/][color=white][b]here[/b][/color][/url]. \r\n[*]In order to get my Main Menu Mod to work, you have to install SKSE (the “Skyrim Script Extender”), which you get [url=http://skse.silverlock.org/][color=white][b]here[/b][/color][/url]. It’s pretty easy to install: Just download the Archive-File with the current build (you find it at the top of the page) and extract it to your Skyrim-Folder (normally you find it here: […]\\\\Steam\\\\SteamApps\\\\common\\\\skyrim). If you already got SKSE your ready to go and can use my mod. [/list]\r\nIf you have installed the NMM and SKSE just download one of the three available Mod Editions of “Skyjubs Main Menu Aesthetics”. If you did, just install it with the NMM. The auto-installer menu will lead you through the installation and let you customize which wallpapers you want to see and which not. \r\nJust to make this clear: The pictures in all three editions are identical, they just differ in the base color tone. \r\n\r\n[color=white][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=white][size=4][b]Ambience titles and fan support[/b][/size][/color][/font]\r\n\r\nI hope you like the ambiance titles I made for nearly every image of the three sets. If not, just choose the version of your prefered pictures without the title. If someone finds some grammatically error in a title, just post a comment or write me a private message and I will fix this soon. As I said: I’m not a native english speaker, but I hope everything’s just alright.  \r\n\r\nFurthermore, in order to enhance this mod in the future, I invite you all to send me pictures or picture links, which you want to see added to my three series. Also you can send me ambience title lines you want to see with this pictures. Then I’ll look through the suggestions and will see what I can do. \r\n\r\n[color=white][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=white][size=4][b]Important notes[/b][/size][/color][/font]\r\n\r\nPlease read those notes carefully! They should answer most of the questions.\r\n\r\n[color=white][b]Load order: [/color][/b]This mod has no position in the load order, because it got no ESP. It just works with new files in your Data-Folder and replace none of the old files. So it’s totally safe to try it. \r\n\r\n[color=white][b]Compatibility: [/color][/b]This mod is compatible with pretty much everything – except other Main Menu background replacer mods. As a matter of fact, you can just replace one thing with another – not with two ;-) \r\n\r\n[color=white][b]Using more than one Edition of this mod at the same time: [/color][/b]This is possible, but with a important “BUT”. You can download two or even all three editions of the series. If you install them, just choose the pictures as you want and overwrite all files, which the NMM already detect in your Data-Folder. All will work properly, but you can’t install the same picture in different colors. An example: You could install “AELA1” in “Ancient Gold” and “AELA2” in “Winter Night”, but you can’t install AELA3 in both color settings. \r\nAlso I don’t recommend to mix the sets up, but that’s just from a aesthetics point of view. \r\n\r\n[color=white][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=white][size=4][b]My Mods on the Nexus[/b][/size][/color][/font]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/31703][color=white][b]SkyJubs Grand Investor - Endless Investments Mod[/color][/b][/url]\r\nDid you ever wonder why you can invest only one single time in the stores all around Skyrim? Or did you notice, that the perk „Investor“ was partially bugged, so that many, many merchants of the game don’t offer you the investment dialogue sequence? \r\n„SkyJubs Grand Investor“ tries to solve all this – and add much more. \r\n\r\n[url=http://skyrim.nexusmods.com/mods/18250][color=white][b]SkyJubs Invisible Helmets – No Helmet Mod[/color][/b][/url]\r\nI think it’s (at present) the most advanced “No Helmet Mod” on the Nexus. As far as I know, it’s bugfree and compatible with all popular mods, which use the biped objects (f.e.“Cloaks of Skyrim”). It supports Dawnguard, Dragonborn and several armor sets from other Nexus modders (f.e. \\\"Immersive Armors\\\" by Hothtrooper44), also I offer three standard main mod versions and in addition a “Modular Kit”, which works with over 100 separate ESP-Files in order to hide just specific headdresses. So... if you want to see your character’s face although you wear a helmet, you might want to take a look at this. \r\n\r\n[url=http://skyrim.nexusmods.com/mods/34239/][color=white][b]SkyJubs Main Menu Aesthetics - Background Replacer Mod[/color][/b][/url]\r\nYou see it here ;-) Hope you like it. \r\n\r\n[color=white][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=white][size=4][b]Credits and gratitude[/b][/size][/color][/font]\r\n\r\nAt first and most important I want to thank all the artists, who created and create all the pictures and screenshots of Skyrim, which I used as a base for my humble modifications. Without them there wouldn’t be any of my work-overs. Guys, you’re really the best and make this game to something special! \r\n\r\nNext I want to thank the user hellstorm102! He gave me permission to use his Wallpaper Randomizer, which enhances my mod much and makes it possible to use several wallpapers at the same time. Thanks also for all your explanations and support! You find his genius Background Randomizer [url=http://skyrim.nexusmods.com/mods/3708][color=white][b]here[/b][/color][/url]. \r\n\r\nLast but not least, I want to thank all downloaders and users of my mod. \r\n\r\nHave fun\r\nJDB",
  "categoryId": "62",
  "version": "1.0",
  "author": "Jubeldibub",
  "createdUnix": "1364903476",
  "updatedUnix": "1364843374",
  "containsAdultContent": false,
  "uploadedBy": "Jubeldibub",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021733",
      "name": "SkyJubs_Main_Menu_Aesthetics_AutoInstaller_AncientGold",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "288737",
      "fileName": "SkyJubs_Main_Menu_Aesthetics_AutoInstaller_AncientGold-34239-1-0.rar",
      "uploadedUnix": "1364840300",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Main_Menu_Aesthetics_AutoInstaller_AncientGold-34239-1-0.rar?fid=1000021733&ttl=1535811918&ri=8192&rs=8192&setec=ef938e44c7fd1df01eca174150864424"
    },
    {
      "fileId": "1000021740",
      "name": "SkyJubs_Main_Menu_Aesthetics_AutoInstaller_SilverSteel",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "153033",
      "fileName": "SkyJubs_Main_Menu_Aesthetics_AutoInstaller_SilverSteel-34239-1-0.rar",
      "uploadedUnix": "1364841497",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1e86f2cc69e0c94eeecece192c4d331ac02929d08a532deb4c68ea75d9c05032/analysis/1407500176/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Main_Menu_Aesthetics_AutoInstaller_SilverSteel-34239-1-0.rar?fid=1000021740&ttl=1535811919&ri=8192&rs=8192&setec=c98da5e9de64aa043131cc61aba9a577"
    },
    {
      "fileId": "1000021744",
      "name": "SkyJubs_Main_Menu_Aesthetics_AutoInstaller_WinterNight",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "292586",
      "fileName": "SkyJubs_Main_Menu_Aesthetics_AutoInstaller_WinterNight-34239-1-0.rar",
      "uploadedUnix": "1364843374",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Main_Menu_Aesthetics_AutoInstaller_WinterNight-34239-1-0.rar?fid=1000021744&ttl=1535811919&ri=8192&rs=8192&setec=6f296a33c655584085e702bca8013002"
    }
  ]
}