{
  "modId": 34235.0,
  "modName": "Daedric Fashion English German",
  "summary": "A Daedric light armor and a deadric robe for mages.",
  "descriptionHtml": "[center][size=15][url=http://www.youtube.com/watch?v=23yTaEm4zBA]Video by Hodilton[/url][/size][/center]\r\n\r\nThis Mod adds a Light Daedric armor (the screenshots with bow and in combat) and a deadric clothing set for mages (the screenshots with magic in the college of Winterhold) to your game. (English and German Version available) Works for males and for females\r\n\r\nThis mod is based on the models of Naterforme´s [url=http://skyrim.nexusmods.com/mods/14709]Daedric Mage Armour[/url] and I only edited the .esp and uploaded it here with his friendly permission. The original mod is NOT required.\r\n\r\nBUT! It is strictly forbidden to upload this on steam! Natterforme don´t want this to be seen there and I follow this rule. If anyone sees this (or Natterformes original mod) on steam pleas contact us.\r\nYou´ve been warned!\r\n\r\nCompatible wit any texture mods for daedric, I highly recommend [url=http://skyrim.nexusmods.com/mods/30612]Glorious Daedric Retexture[/url] by the awesome gloriuz. (this one I used for my screenshots)\r\n\r\nFirst I want to tell you why I edited his esp:\r\nHis original mods, adds:\r\nA new daedric cuiress with four diefferent variants (with spikes and bags, wit only spikes, with only bags, without both) \r\nA new model for daedric boots\r\nA hood coming with six variants (normal hood, normal hood with mask, No head hood, No head hood with mask, No head hood with eye glow, No head hood with mask and eye glow)\r\nNew gountlets with two variants (armoured and unarmoured)\r\n\r\nAl these models came as a heavy armor version, a light armor version, as clothing and as test version with no item requirements to forge it but no armour value too (this was to test wich looked best on your character)\r\n\r\nNow my daedric smithing section was spammed with tons of things and I completely lost the overview. Another thing I don´t liked was, that a heavy version, a light version and a clothing version had all the same model. And the quirass with spikes, definitely doen´t look like clothing xD\r\n\r\nAnd this is what I made out of this:\r\n\r\n[size=10]A light armor set:[/size]\r\n1: a light quirass, for wich I used the model with spikes but without bags.\r\n2: light daedric boots\r\n3: A light daedric mask wich used the masked hood model (Not usable for kahjiit and argonians, maybe I´ll make a version wich uses the NoHead hood, but i tested it on a dark elf and the masked hood simply looked best)\r\n4: light daedric gauntlets for wich I used the armored gloves model\r\n\r\n[size=10]A mage clothing set:[/size]\r\n1: a daedric robe, for wich I used the spikeless model with bags\r\n2: daedric boots \r\n3: A daedric hood (the normal hood model)\r\n4: Daedric gloves (the unarmored)\r\n\r\nThe light armor can be smithed at every forge if you have the daedric smithig perk. The stats are settled slightly under the dragonscale (Boots and gauntlets have the same stats, hellmet and quirass have one basicarmorpoint less)\r\nIt can be improved at any workbench with an ebony ingot.\r\n\r\nThe Mages Robe can be crafted at any tanning rack.\r\n\r\nBoth sets are fully enchantable at the enchanting table.\r\n\r\nI also changed the recipies (Hoods need lether, and not 10 leather strips) and I removed the filled greater soulgems from the crafting recipes, wich were origanally required.\r\n\r\n\r\nThanks for using this mod and have fun with it.\r\nPlease leave an endorsement at the Original mod please.\r\n\r\nPlease excuse my English if it´s bad, I don´t know. xD",
  "categoryId": "54",
  "version": "1",
  "author": "Boerthi",
  "createdUnix": "1364831515",
  "updatedUnix": "1364829866",
  "containsAdultContent": false,
  "uploadedBy": "boerthi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021694",
      "name": "Daedric Fashion English",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7187",
      "fileName": "Daedric Fashion English-34235-.zip",
      "uploadedUnix": "1364829710",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d1a3bfa211dca20e8403658273af195d813ef94b4da63a5832e457a317b648d7/analysis/1407499735/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Fashion%20English-34235-.zip?fid=1000021694&ttl=1535811912&ri=8192&rs=8192&setec=9c524cbbf6a69fe34fc2c9683bacc51a"
    },
    {
      "fileId": "1000021695",
      "name": "Daedric Fashion German",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7185",
      "fileName": "Daedric Fashion German-34235-1.zip",
      "uploadedUnix": "1364829866",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/56c79c975b2d22b6ebc21c4489f5118719f4f00cf11d08ca4c01136a153cb3b1/analysis/1407499746/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Fashion%20German-34235-1.zip?fid=1000021695&ttl=1535811913&ri=8192&rs=8192&setec=c19bc7f0fac5eb784d0bf64ba182ba74"
    }
  ]
}