{
  "modId": 34241.0,
  "modName": "Wingspread Abode",
  "summary": "Mid-sized player home in the Reach with bonuses: auto-storage chests, all Standing Stones and shrines, unique lighting and decorations, working catapult, exterior wall, and more.",
  "descriptionHtml": "[color=#64beef][b][size=6]Wingspread[/color][/b][/size]\r\n\r\n[color=red][b][size=5]Update v2.0[/color][/b][/size]\r\nI put a lot into this update, so I figured it was worth a new whole number! This update adds many requested features, including:\r\n[color=#64beef][b][size=4]Interior[/color][/b][/size]\r\n[list]\r\n[*]Basement! Complete with lots more storage, weapon racks/mounts, mannequins, for people who like to show off their spoils, unique decorations, door to the outside.\r\n[*]Also has a followers\\' \\\"dormitory,\\\" with beds, screens, nicely decorated even if it\\'s in the basement and for lowly companions.\r\n[*]Pool area fed by the waterfall outside (yes, it\\'s actually physically located in the right end of the house, and would drain as seen outside--maybe not precisely at the right height, but give me a break). So you and your followers can take a bath, as Vilja is always telling me to.\r\n[*]Chopping block in the crafting area--I forgot to put one in before, and I like handy access to firewood for crafting arrows, charcoal, etc.\r\n[*]Standard activatable bookshelves (in addition to the autostore one in the office) scattered throughout the upper two floors (in the office, downstairs hall, upstairs bedrooms, etc.)\r\n[/list]\r\n[color=#64beef][b][size=4]Exterior[/color][/b][/size]\r\n[list]\r\n[*]Door into the basement, with stairs leading to it, from the side garden area (I\\'m all for equal access)\r\n[*]Stable! For those of you with a horse, you can now park it off to the side of the main gate, tucked away in the pine trees.\r\n[*]Portcullis! Pull-chain activated, both inside and out, to keep out the neighbors.\r\n[*]Beehive for the bees, practice dummy, some other small changes/additions to add more to the exterior without cluttering it up.\r\n[/list]\r\nVarious other changes that I forgot, I\\'m sure, but you get the gist of the main stuff. See the images section for screencaps of the new stuff.\r\n\r\n[color=red][b][size=5]Update v1.3[/color][/b][/size]\r\nI didn\\'t realize that the Dragon Claw storage script file I was using actually came from another mod I had active--sorry! I\\'ve included it in this update, so those mounts should work.\r\n\r\n[color=#64beef][b][size=5]Short Description[/color][/b][/size]\r\nMid-sized player home in the Reach with bonuses: auto-storage chests, all Standing Stones and shrines, unique lighting and decorations, working catapult, and more.\r\n\r\n[color=#64beef][b][size=5]Video Walkthrough[/color][/b][/size]\r\n[youtube]73J8QVJqXLs[/youtube]\r\nThanks to hodilton for making this! This video is shot with the Project MATSO ENB, so the colors are more saturated than vanilla, and the interior is darker than it will be for you if you aren\\'t using the ENB.\r\n\r\n[color=#64beef][b][size=5]Comments Note[/color][/b][/size]\r\nThe folks at Nexus suggested that mod authors start making use of the discussions forum to separate comments out into categories. So I\\'m trying to be a good citizen and follow their lead. Unfortunately, that means the comments that people had already posted are now gone (no way to move them to the new threads). Anyway, from now on use the Forums tab to access the comment boards, and if you don\\'t mind, try to post to them appropriately.\r\n\r\n[color=#64beef][b][size=5]Longer Description[/color][/b][/size]\r\nThis is my second house mod. The first one, [url=http://skyrim.nexusmods.com/mods/34133/]Taliesin Falls[/url], I actually completed a while ago and just posted. As some people pointed out to me, it\\'s in a \\\"prime\\\" location, where several other popular houses are located. So I decided to finish this one up (for now, I have some more plans, see below) and post it, since it\\'s in a completely different location.\r\n\r\nI\\'ve always loved the views from up on Bard\\'s Leap Summit, and decided I\\'d build a house on the hills to the SW of it. I like the look of the stone houses, so I used Elenwen\\'s Solar from the Thalmor Embassy for the starting point of the interior and the exterior. The interior is highly modified, of course, including the fact that I ditched the basement.\r\n\r\nThe first house I made was easy to get to and take over. This one will take a little more effort. First of all, it\\'s a bit more out of the way, off in the Reach. Second, it\\'s locked. To open the gate and house door, you\\'ll need the key.\r\n\r\nI don\\'t have the skills yet to create my own quests, so I did the next best thing: the key (as well as a journal with more backstory) is found on Kopis the Blade\\'s dead body. To get to his body, you\\'ll have to make your way up to Bard\\'s Leap Summit (which usually means killing some Forsworn), then go south of it to the structure with the hagravens and the Word of Power wall. Kopis\\' body is to the left of the altar (I\\'ve included images to help you find him). I\\'d recommend reading his journal to find out how Wingspread (and his body) came to be there--it\\'s not long.\r\n\r\nLike in my first house, I only used meshes from the basic Skyrim pack. But to make things unique, I changed the scale of a lot of items to make them into decorations, or unique plants, dioramas (see the journal for backstory on these), etc. I\\'d recommend getting the [url=http://skyrim.nexusmods.com/mods/193]Glowing Ore Veins[/url] mod to get the full effect on the wall by the smelter (plus, it\\'s a great mod). Check out the lever on the desk for some additional fun. All of the shrines in the upstairs chapel work.\r\n\r\nOutside, you\\'ll find I heavily modified that area while keeping it true to the Reach, including some additional water features. A small garden is to the left across the stone bridge when you first enter the compound. Farther up the stairs, you\\'ll find a working catapult (see Kopis\\' journal for the backstory on this). On the patio behind the house, you\\'ll find a place to store dragon claws and masks. SPOILER ALERT--skip to next paragraph if you don\\'t want to learn more about the dragon masks. [spoiler]the dragon\\'s head WILL open up to reveal the storage spot for Konahrik\\'s mask, but the mask itself WON\\'T be there. To get that mask, you\\'ll still have to go to Labyrinthia. Once you have it, you can store it on the patio. [/spoiler]\r\n\r\nOne thing I added was Manilla Turtle\\'s Automatic Item Storage (which he kindly made available for modders before he apparently disappeared). This is the handiest thing for easy crafting, which I tend to do a lot of. You can store items in chests, and then access those items from the appropriate crafting station, without having to load up and unload again (it does this for you). So there\\'s a chest near the smelter that will store all of your ore (won\\'t even ask you, it\\'ll just do it); another chest on that same shelf that will store crafting goods and be accessible from the forge, tanning rack, wheel and bench; a satchel by the alchemy station for ingredients; a strong box by the enchanting station for soul gems; a bookshelf by the desk for books/scrolls/etc.; and a pantry in the kitchen for food. I modified the item list for the crafting station storage slightly to include gems and linen, since many of the custom armors/clothes use linen. I didn\\'t change the name of the MTAutoStorage.esm file, but if you\\'re already using this for your other houses, all that will happen (unless you\\'ve modded the file yourself) is that if you overwrite your existing MTAutoStorage.esm file, it\\'ll now store linens and gems in your crafting storage chest. If you don\\'t overwrite, it won\\'t.\r\n\r\nThe interior and exterior are fully navmeshed, so your follower shouldn\\'t have any trouble...following. Also, it\\'s been cleaned with TES5Edit.\r\n\r\n[color=#64beef][b][size=6]Installation[/color][/b][/size]\r\nNexus Mod Manager:\r\nDownload with manager, activate it. Make sure BOTH wingspread.esp and MTAutoStorage.esm are checked in the plugins list to load correctly.\r\n\r\nManually:\r\nDownload, unpack the archive. Move the wingspread.esp and MTAutoStorage.esm files to your data folder, and the script files to your data/script folder. Make sure to check BOTH wingspread.esp and MTAutoStorage.esm in your game loader of choice.\r\n\r\n[color=#64beef][b][size=5]Uninstall[/color][/b][/size]\r\nSave outside of the cell being uninstalled.\r\n\r\n1. Use NMM\r\n2. Delete the scripts (they start with NC1 and NC02), .esp and .esm files from your Skyrim/Data folder.\r\n\r\n[color=#64beef][b][size=5]Load Order[/color][/b][/size]\r\nShouldn\\'t matter. A house is a house...\r\n\r\n[color=#64beef][b][size=5]Conflicting mods[/color][/b][/size]\r\nAny mod that alters the location where the house is at: along the ridge SW of Bard\\'s Leap Summit. I don\\'t KNOW of any previous mods affecting this area, but then I\\'m not familiar with every mod out there. If anyone knows of one, please let me know.\r\n\r\n\r\n[color=#64beef][b][size=5]Future Plans[/color][/b][/size]\r\nLet me know if people are interested in these:\r\n[list]\r\n[*]A cook to live in the house, potentially marriable?\r\n[*]Guards for the exterior walls, potential followers/spouses?\r\n[*]Other additions if enough people want \\'em!\r\n[/list]\r\n\r\n\r\n[color=#64beef][b][size=5]Thanks[/color][/b][/size]\r\n[list]\r\n[*]Bethesda (obligatory bow)\r\n[*]Manilla Turtle, for [url=http://skyrim.nexusmods.com/mods/12468]Automatic Item Storage[/url]\r\n[/list]\r\n",
  "categoryId": "67",
  "version": "2.0",
  "author": "Doc Norm",
  "createdUnix": "1364847232",
  "updatedUnix": "1365974687",
  "containsAdultContent": false,
  "uploadedBy": "clarkne",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021915",
      "name": "Wingspread without Autostorage",
      "version": "1.0a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "104",
      "fileName": "Wingspread without Autostorage-34241-1-0a.7z",
      "uploadedUnix": "1364917424",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/7a8adc5d72a180d4754b969192b7d88f795f5ce2ad35d55f5f1a8b9b89065694/analysis/1407501852/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wingspread%20without%20Autostorage-34241-1-0a.7z?fid=1000021915&ttl=1535811921&ri=8192&rs=8192&setec=1301d53393ef018a2ee37e2816489992"
    },
    {
      "fileId": "1000023820",
      "name": "Wingspread",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "118",
      "fileName": "Wingspread-34241-1-3.7z",
      "uploadedUnix": "1365699241",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/e5c70dd91ff271b845666b9d67fe0551e4261bb9d18463d1b67474a07ef48552/analysis/1407517091/",
      "changelogHtml": " Restored missing script file for Dragon Claw Storage <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wingspread-34241-1-3.7z?fid=1000023820&ttl=1535811921&ri=8192&rs=8192&setec=e19b2ce27283b97454fcf4589374d0cb"
    },
    {
      "fileId": "1000024468",
      "name": "Wingspread",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "125",
      "fileName": "Wingspread-34241-2-0.7z",
      "uploadedUnix": "1365974687",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a4d5f435e74d06e3db2808c3569bca7d5b6f1ae26e64ae03aceac11ace29bb83/analysis/1407522377/",
      "changelogHtml": " Large basement with more storage/racks/mannequins for people who like that sort of thing, followers&#39; dormatory, bathing pool fed by waterfall, more unique decorations <br/> \n Door from basement to side yard by garden, new stairs, beehive <br/> \n Stable&#33;, attack dummy, other modifications to exterior <br/> \n Pull-chain activated portcullis, to keep out the neighbors <br/> \n Wood pile added to crafting area <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wingspread-34241-2-0.7z?fid=1000024468&ttl=1535811922&ri=8192&rs=8192&setec=3b210cac4362bf5e8ae4b2da6709dee2"
    }
  ]
}