{
  "modId": 34281.0,
  "modName": "Royal Bloodline - French Version - FRANCAIS",
  "summary": "Ce mod a pour objectif d\\'augmenter le potentiel du Seigneur Vampire et ainsi de le rendre utile aux difficultés supérieures à Novice, tout en restant fidèle au gameplay du jeu vanilla.\r\nMalgré tout, le plus important reste le fun!\r\nCe mod ajoute des nouvelles compétences dans l\\'arbre du Seigneur Vampire (ce qui inclut de nouvelles capacité",
  "descriptionHtml": "Ceci est la traduction française de [url=http://skyrim.nexusmods.com/mods/22565]Royal Bloodline, mod créé par xyks[/url].\r\n\r\nCe mod ajoute différentes compétences disponibles après avoir débloqué toutes les compétences Vanilla permettant de rendre le Seigneur Vampire très utile à un haut niveau de difficulté. Ou juste beaucoup plus fun! \r\n\r\nNouvelles compétences:\r\n\r\n[b]Sang Royal[/b]\r\n+ 10% Santé/Magie/Vigueur\r\nChange votre apparence pour celle d\\'Harkon; nécessite tous les perks Vanilla. (si vous souhaitez retirer certaines choses comme la cape, vous pouvez télécharger le fichier bsa associé sur la page du mod original, celui-ci est totalement compatible et ne passera rien en anglais. (J\\'utilise d\\'ailleurs ce bsa, la cape ayant tendance à faire un affreux clipping))\r\n\r\n[b]Perfection Sanguine[/b]\r\nRang 1: Augmente vos dégats de magie du sang de 10%\r\nRang 2: Augmente vos dégats de magie du sang de 20%\r\nRang 3: Augmente vos dégats de magie du sang de 30%\r\n\r\n[b]Griffes Aiguisées[/b]\r\nRang 1: Augmente vos dégats de mélée de 15% et ajoute 5% de chance d\\'infliger un coup critique qui infligera 10% de dégats supplémentaires à l\\'ennemi.\r\nRang 2: Augmente vos dégats de mélée de 30% et ajoute 10% de chance d\\'infliger un coup critique qui infligera 20% de dégats supplémentaires à l\\'ennemi.\r\nRang 3: Augmente vos dégats de mélée de 45% et ajoute 15% de chance d\\'infliger un coup critique qui infligera 30% de dégats supplémentaires à l\\'ennemi.\r\n\r\n[b]Invocation de Goliath[/b]\r\nInvoquez Goliath, chef des Gargouilles, pour combattre à vos côtés.\r\nSupprime l\\'invocation de Gargouille basique.\r\nNécessite le perk Gargouille à côté de Sang Royal.\r\nNécessite Griffes Aiguisées et Perfection Sanguine aux niveaux maximums.\r\n\r\n[b]Transfusion Sanguine[/b]\r\nAjoute un sort qui convertit 50 points de vie en 25 points de magie et 25 points de vigueur.\r\nC\\'est un sort pratique mais qui peut s\\'avérer dangereux: il peut vous tuer, soyez prudent!\r\nNécessite Griffes Aiguisées et Perfection Sanguine aux niveaux maximums.\r\n\r\n[b]Envol du Seigneur[/b]\r\nLéviter au dessus du sol est trop limité pour un vrai Seigneur Vampire!\r\nCette capacité permet de voler pendant la lévitation tout en permettant de conserver les colisions! \r\nPour lui donner une utilité pour vos déplacements, il ajoute également 50 de vigueur.\r\nRetire les dégats de chute pendant la lévitation.\r\nNécessite Invocation de Goliath et Transfusion Sanguine.\r\n\r\n[b]Eclipse[/b]\r\nAssombrit le soleil pour 30 secondes.\r\nPendant ce temps, vous ingligez 50% de dégats supplémentaires, magiques comme de mélée, et vous subissez moitié moins de dégats.\r\nVotre régénération de vie, vigueur et magie s\\'active comme en pleine nuit.\r\nPeut être utilisé une fois par jour, pendant la journée uniquement (5h-19h) et uniquement en extérieur.\r\nNote: Si vous l\\'activez pendant la nuit, l\\'effet ne fonctionnera pas mais le cooldown se lancera le rendant indisponible pour les prochaines 24H virtuelles.\r\n\r\n[b]Rune Cauchemardesque[/b]\r\nPlace une rune qui effraie les NPC de niveau 40 et moins qui la traverse durant 7 secondes.\r\nCela ne semble pas spectaculaire mais xyks a voulu réaliser quelque chose qui puisse repousser les ennemis sans que cela soit aussi abusé que le Totem de la Terreur des Loups-Garou.\r\nLe sort n\\'effraie que pendant 7 secondes mais les NPC de hauts hauts niveaux, en faisant une véritable option pour votre Seigneur Vampire!\r\nLe cooldown est de 20 secondes à partir du moment où la rune est activée.\r\n\r\n[b]Bouclier Sanguin[/b]\r\nUn puissant bouclier magique qui consomme 35 points de magie par seconde mais bloque 50 points de dégats! Particuliérement utile contre les dragons et les mages!\r\n\r\n________________________________________________\r\n\r\n\r\nPour le mod ThroneRoom, c\\'est une réhausse de la pièce d\\'Harkon, la rendant plus sympa à vivre pour le joueur, rendant les coffres utilisables, etc...\r\nTout a été traduit également.\r\n\r\n________________________________________________\r\n\r\nPour les fixs, ceux qui nécessitent un esp vont retraduire des choses en anglais. Si l\\'un de vous a besoin de ce fix, je le traduirait éventuellement. Sachez avant tout que j\\'ai traduit ce mod pour mon usage personnel et ait décidé de le partager, rien ne m\\'oblige donc à traduire les fichiers dont je n\\'ai pas besoin. Mais je reste à l\\'écoute, si j\\'ai le temps, pourquoi pas.\r\n\r\n_______________________________________________\r\n\r\nJe vous invite à regarder la section des fichiers recommandés sur le lien original. Je recommande Grimoas Vampire Lord, Vampire Lord Retexture et Vampire Lord Fix que j\\'utilisent et qui sont juste des nécessités!\r\nJouant souvent en solitaire, je n\\'utilise par contre pas Serana\\'s Secret. \r\n\r\n_______________________________________________\r\n/!\\\\ Si vous trouvez une faute d\\'orthographe, une phrase mal tournée et donc difficilement compréhensible, ou un oubli de traduction (attention à ce que ça soit bien dû à ce mod et pas à un autre!), merci de me le faire savoir de manière à ce que je puisse publier une version 1.1 corrigée.\r\n\r\n\r\n\r\nCREDITS: Merci à Xyks pour son merveilleux mod, à tous ceux qui ont contribué à la création du mod original et à Epervier 666 et son ESP Translation, logiciel réellement utile pour traduire la plupart des éléments sans les bugs du CK!\r\n\r\n\r\n[url=http://skyrim.nexusmods.com/mods/35320][img]http://www.ushareimg.com/images/286T3R.png[/img][/url]\r\n",
  "categoryId": "73",
  "version": "1.31",
  "author": "xyks",
  "createdUnix": "1364894450",
  "updatedUnix": "1364894174",
  "containsAdultContent": false,
  "uploadedBy": "Tapsibaba",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021870",
      "name": "Royal Bloodline",
      "version": "1.31Fr",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "159",
      "fileName": "Royal Bloodline-34281-1-31Fr.zip",
      "uploadedUnix": "1364894118",
      "modVersion": "1.31Fr",
      "virusScanUrl": "https://www.virustotal.com/file/b0874a93f244bc4a2134b014e71e59a97b82c2ce0d55c8c4b5a1327eeaf0d190/analysis/1407501365/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Royal%20Bloodline-34281-1-31Fr.zip?fid=1000021870&ttl=1535812001&ri=8192&rs=8192&setec=0f2ea07a327b62713aac3ec5fcbcba21"
    },
    {
      "fileId": "1000021872",
      "name": "Throne Room",
      "version": "1.31Fr",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "263",
      "fileName": "Throne Room-34281-1-31Fr.zip",
      "uploadedUnix": "1364894174",
      "modVersion": "1.31Fr",
      "virusScanUrl": "https://www.virustotal.com/file/c48ebf259d5e5268dc5505486e518561f1b211d2ab84825db83372bc9af2d80a/analysis/1407501367/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Throne%20Room-34281-1-31Fr.zip?fid=1000021872&ttl=1535812002&ri=8192&rs=8192&setec=2559c726884c9d2879426802da31a9eb"
    }
  ]
}