{
  "modId": 34330.0,
  "modName": "OceanView Lodge - RiverView Lodge FAMILY MATTERS QUESTS",
  "summary": "Two very very nice homes - two quests to find that Family Matters&#33;&#33;  Meet your Father, meet the ghost of your Aunt - see all your family portraits&#33;  Discover your TRUE inheritance as Dragonborn&#33;",
  "descriptionHtml": "** FINAL UPDATE - RiverView Lodge Fixed children&#39;s beds so doesn&#39;t &#39;re-size&#39; kids\r<br />********* will now begin on creating quests for ALL OTHER RACES ************\r<br />Update: RiverView Lodge Family Matters File Only\r<br />Fixed a hole in the navmesh by the stable\r<br />Added a missing pot in the hallway\r<br />Added towels to RiverView Lodge\r<br />\r<br />OceanViewLodge MASTER V4.0- requires HEARTHFIRES DLC\r<br />\r<br />*** IMPORTANT ***\r<br />Be SURE to remove any items you have in OceanView Lodge (if you are using an older version) BEFORE installing the OceanView Lodge .esm file.\r<br />You will receive the key to OceanView Lodge from the messenger.\r<br />\r<br />This mod REQUIRES HearthFires DLC\r<br />\r<br />OCEANVIEW LODGE\r<br />Inherit OceanView Lodge - your Aunt passed away, leaving you a lovely farm that includes a goat you can milk and a working butter churn.\r<br />A courier will give you the news of your aunts passing, a key and small monetary inheritance.\r<br />Includes:\r<br />Navmesh - follower friendly, interiors & exteriors\r<br />A dining table that sets itself when guests are seated\r<br />Milk the goat Gert - goat and inventory respawns\r<br />Harvest honey from all beehives in Skyrim\r<br />Make your own butter, cream, cheese and OceanView mead with juniper\r<br />Original containers for your inventory items\r<br />Beds that ARE NOT Skyrim green\r<br />Stable for your horse and goat\r<br />Garden to harvest vegetables and herbs\r<br />Cellar includes mannequins, weapon racks, forge, smelter, tanning rack and workbench\r<br />Improved lighting - music for interior and exterior\r<br />Alchemy station with potion rack\r<br />Enchantment table with storage for your soul gems\r<br />Well Rested bonuses for both master and guest beds\r<br />\r<br />This mod adds a room off the master bedroom and will adjust to whatever race you are and accommodate custom races with a race-specific menu.  \r<br />Includes:\r<br />Portraits of your entire family back to your great-great grandparents\r<br />A shower area with soap containers\r<br />A tanning rack for making wash cloths\r<br />A cooking pot for making soap\r<br />A bookshelf area\r<br />Small indoor garden area\r<br />\r<br />************************************ NOW RELEASED *************************************\r<br />*** REQUIRES OCEANVIEW LODGE MASTER AND HEARTHFIRES DLC ******\r<br />\r<br />RiverView Lodge (Imperials Only) - OceanView_LodgeFamilyMatters_Imperial v2.0\r<br />(Highly recommended you start a new game)\r<br />\r<br />The spectre of your Aunt visits OceanView Lodge \r<br />(when you are level 10 - or have started the Main Quest)\r<br />She needs you to find her body and claim the DragonBorn Bow ... so she can rest in peace.\r<br />A mysterious note takes you to Riften where you meet your Father.  But all is not well, there is a Thalmor Agent who you suspect killed your Aunt ...  \r<br />\r<br />RIVERVIEW LODGE-Requires OceanView Lodge Master file above&#33;\r<br />-- the reward(s) for the above quest(s) include the DragonBorn Bow and a wonderful chateau on the River of Riften which includes:\r<br />A shower in the master bedroom\r<br />A tanning rack where you can make wash cloths in the master bedroom\r<br />A cooking pot where you can make soap in the master bedroom\r<br />You can have a spouse and house carl/steward live with you there\r<br />Accommodates children (with MultiKid mod) - and large enough no one is underfoot\r<br />Comfortable and not overly large or cluttered\r<br />A cellar with an archery range, bar area and racks for equipment and masks\r<br />A room in the cellar for blacksmithing (smelter located OUTSIDE)\r<br />An upper floor where 4 of the six children can stay as well as a room for your housecarl/steward\r<br />A kitchen with all the amenities and storage\r<br />An enchantment area\r<br />An Alchemical room - store your potions/ingredients \r<br />A large display area in the back hallway with a bookshelf and indoor garden\r<br />A large stable on the grounds that comes with a horse\r<br />Chickens and a garden outside\r<br />VERY COOL - \r<br />The kitchen table has food/settings when anyone sits down - table is cleared when they leave.\r<br />\r<br />************* IMPORTANT ******************* IMPORTANT ****************\r<br />\r<br />EACH Race will have their own file - The other Race files are in progress and will be uploaded asap.\r<br />ie: OceanView_Lodge_FamilyMattersII_Imperial is for imperials only.\r<br />*** this file REQUIRES OceanView Lodge MASTER and HEARTHFIRES to be enabled.\r<br />you will only need to download the file for the race your character belongs to - if you download multiple race files - please be sure to enable only one when playing.\r<br />\r<br />If you plan on adopting children with the quest mod - you will need to have the HearthFires Multi-Kid mod.  This will allow you to adopt up to 6 children.\r<br />Strongly recommended mods that work exceptionally well with the above are TMPhoenix- HearthFires Multiple Kids mod - Chesko- FrostFall and Drink, Eat, Sleep, Bathe mod by Ryan Byczek.\r<br />\r<br />#################### SPECIAL THANKS TO ###################\r<br />Credit for the towels in OceanView Lodge goes to InsanitySorrow\r<br />Credit for the table place settings in RiverView Lodge goes to Catering by Lilith\r<br />Credit for the awesome Voice Acting - Edouard TES Alliance\r<br />special thanks to OFish for his testing of the mod&#33;\r<br />** special thanks to LordMorpheus1 for his encouragement&#33;\r<br />\r<br />AND most importantly - credit for this mod working with HearthFires Multi-Kids mods goes to TMPhoenix, who fixed the issues I was having.  Without his help and support - this mod would NOT have been released.\r<br />\r<br />\r<br />MODS have been thoroughly cleaned with TES5EDIT\r<br />If you encounter any difficulties - please let me know.",
  "categoryId": "67",
  "version": "4.0",
  "author": "LeianneG",
  "createdUnix": "1364967665",
  "updatedUnix": "1364967665",
  "containsAdultContent": false,
  "uploadedBy": "LeianneG",
  "primaryFile": null,
  "files": []
}