{
  "modId": 34340.0,
  "modName": "Proper Combat",
  "summary": "Overhaul and tweaks for all things Combat",
  "descriptionHtml": "[font=book antiqua][size=4pt][center]This is a collection of tweaks for players who enjoy a vanilla or at least semi-vanilla play experience.\r\n\r\n[b]This mod focuses on settings, perks, skills, and items related to the Combat category.[/b]\r\n\r\n***REQUIRES USKP--DAWNGUARD ADDON REQUIRES UDGP***\r\n\r\nWHAT THIS MOD INCLUDES:\r\n\r\n--Smithing overhaul--\r\n--Better Heavy Armor perks--\r\n--Better weapon specializations--\r\n--Better critical hits--\r\n--Better Stamina mechanics--\r\n\r\n***I highly suggest playing this mod with a very clean save, or better yet, a fresh playthrough***\r\n\r\nIf you like the mod, endorse![/center]\r\n\r\n\r\n[center]====================================================================================[/center]\r\n\r\n\r\n[b]First, a few notes:[/b]\r\n[b]1.[/b] Bergzore\\'s mods are clean. You don\\'t need to worry about cleaning them.\r\n[b]2.[/b] If you don\\'t know what you\\'re doing, don\\'t make changes to the DLC addons and save them in the CK. It will break dependencies.\r\n[b]3.[/b] It\\'s good to periodically check the comments section. I will often post details of why and how changes were made, share ideas that I\\'m brainstorming, and explain how the game calculates certain things. Think of it as a Twitter page that you can reply to.\r\n[b]4.[/b] Wyre Bash will tell you that Proper Combat Dawnguard has reordered masters. Ignore this and load as the file page instructs.\r\n[b]5.[/b] If you are using Proper Magic, load mods in this order:\r\n\r\n(Unofficial patches)\r\nProper Combat\r\nProper Combat Dawnguard\r\nProper Combat Hearthfire\r\nProper Combat Dragonborn\r\nProper Magic\r\nProper Magic Dawnguard\r\nProper Magic Dragonborn\r\n\r\n\r\n[center]====================================================================================[/center]\r\n\r\n\r\n[b]Mod details:[/b]\r\n\r\nProper Combat seeks to improve some of the useless perks in the Combat trees, as well as overhauling the awkward Smithing system. Combat was overall satisfying in vanilla Skyrim, but a few finer details were poorly delivered, and Smithing was just a mess. Players who are not fans of big overhaul mods may find what they are looking for here.\r\n\r\nFor a complete list of changes, please see the Change Log.\r\n\r\n\r\n[b]Problems, Solutions, and Reasons:[/b]\r\n\r\n***\r\n\r\n[b]Problem:[/b] The vanilla Smithing system was oddly organized. A lot of generic weapons and armor fell under random categories, and the Light side got very little love. Also, what\\'s up with Steel Plate being on the Light side?\r\n\r\n[b]Solution:[/b] What you see is what you get. If a perk reads, \\\"Can forge Steel armor and weapons, and temper them more skillfully,\\\" then that is what you can do. Nothing more, nothing less. To better temper generic items, you would need the perk Critical Smithing that begins a new branch in the center. Additionally, the Light side has received the love it deserves. There are seven perks for each side, and each Light side perk that did not come with its own weapon set now includes the Heavy equivalent weapon set, including the shield. For Fur armor, the required animal pelts have been added to blacksmiths and general goods vendors.\r\n\r\n[b]Reason:[/b] This limits what you can forge with each perk, but it also simplifies the system. If you prefer Light Armor, go the left side. For Heavy Armor, go the right side. If you rather like to use what you find instead of forging your own gear, go up the middle branch. This branch starts with the perk Critical Smithing and ends with the perk Accession. These perks improve the tempering of rare items and unique artifacts, respectively.\r\n\r\n***\r\n\r\n[b]Problem:[/b] Stamina did not function as a full and proper resource.\r\n\r\n[b]Solution:[/b] If you perform a power attack with low Stamina, and that attack sends your Stamina into the negative, you will now wait the full amount of time it takes for it to regenerate back into the positive. Blocking also costs Stamina; the base amount is 15 and is affected by weapon/attack type. Bashing cost has been reduced to 25, and power bash to 40. Additionally, Stamina Regeneration is no longer penalized in combat.\r\n\r\n[b]Reason:[/b] You should pay full price for a power attack, just as a mage pays full price for spells. It\\'s nice enough that warriors have a Stamina-free normal attack, let alone a power attack performable with 1 Stamina without full penalty. Also, blocking should not be free. You will not go out of breath from it, so you will always be able to block, but it will help to drain you.\r\n\r\n***\r\n\r\n[b]Problem:[/b] Weapon specialization perks were pretty much useless. Swords\\' critical damage was a static number based on unaffected base damage, axes\\' bleeds were calculated likely, and hammers\\' armor penetration was \\\"meh\\\" considering very few NPCs wear anything better than Steel.\r\n\r\n[b]Solution:[/b] Sword/greatsword perks grant 5/10/15% increased attack speed; war axe/battleaxe perks provide a 5/10/15% chance to do double damage; mace/warhammer perks increase damage by 5/10/15%. Critical Shot has a 10/20/30% chance to do 50% more damage. The \\\"critical hits\\\" of bows and axes do not play a silly drum sound or post an immersion-breaking message; they simply do their damage. These perks obviously only work for the respective weapons.\r\n\r\n*[I]The Elemental Fury shout and the Dual Flurry perk have been fixed to not grant an additional 100% attack speed when the affects stack. This was a vanilla issue and was the reason why dual wielders got insane attack speed if they had the Dual Flurry perk and used Elemental Fury.[/I]\r\n\r\n[b]Reason:[/b] I think the solution speaks for itself here. Any player sensible with perks would not waste 3 perk points on the vanilla versions. Now, they are useful. Each one provides a potential 15% increase in DPS (damage per second) for the respective weapon.\r\n\r\n***\r\n\r\n[b]Problem:[/b] There wasn\\'t much of a reason to use the different power attacks. The standing power attack did the most damage with the right perk, and the rest were just used to attack while moving.\r\n\r\n[b]Solution:[/b] With the Warmaster or Battlemaster perk, forwards power attack delivers a slow for 10 seconds, and backwards power attack does 25% more damage. Devastating Blow and Savage Strike are now Relentless Stance and Unyielding Stance. They still provide the new kill move, but reduce standing power attack Stamina cost by 25% instead of increasing its damage. Also, the Critical Charge perks no longer apply a worthless critical. The fact that you can power attack while sprinting should be enough anyway. Also, Sweep no longer allows you to hit all frontal targets; instead, it grants +150% damage while wielding a broom. Just kidding.\r\n\r\n[b]Reason:[/b] Now each power attack is useful in its own way. Forwards and sprinting power attacks deliver a slow for when you close in on a kiter. Sideways power attack hits all frontal targets. Backwards power attack does the most damage, and standing power attack is for when you\\'re conserving Stamina.\r\n\r\n***\r\n\r\n[b]Problem:[/b] Heavy Armor perks were very boring and unimaginative, and the Fists of Steel perk was just in the way.\r\n\r\n[b]Solution:[/b] For one thing, Fists of Steel has been moved to the middle of the tree all by its lonesome. Many of the other perks have been redone as well. Well Fitted is now the perk that lowers armor weight while worn, and is a 2 point perk, the first of which is available very soon. Aegis is also a 2 point perk, and increases armor rating by 25/50% while in full Heavy Armor. Conditioned provides 50% Health Regeneration just as the Light Armor tree provides Stamina Regeneration. At 100 skill is the perk Unstoppable, which provides immunity to slowing effects. Cushioned is no longer in the tree.\r\n\r\n[b]Reason:[/b] The perk setup before was just silly, and it was too painful to wait until 70 in Heavy Armor to reduce the armor weight. Also, Fists of Steel is really useless considering the extra damage is based on the unaffected base armor of the gauntlets, and it should not be blocking the way in the main branch. Also, Cushioned seems more like a Light Armor perk, and that will be implemented in Proper Stealth. I think jumping off a ledge in full plate armor would actually make it [i]more[/i] painful. Wait... That\\'ll be the next perk implemented! Painful Jump: Increases the damage taken from falling while wearing full Heavy Armor. Just kidding.\r\n\r\n***\r\n\r\n[b]Problem:[/b] Arrows are too slow, and aiming is horrible. The arrows in Skyrim remind me of the arrows in an old game called Secret of Mana. Anyone who has played that game would know what I\\'m talking about.\r\n\r\n[b]Solution:[/b] Arrows are significantly faster now, and bolts are just a tad faster than arrows. The gravity effect has been reduced as well. Aiming will be much more accurate now, but if you like effects from mods such as Proper Aiming better, just load said mod after this.\r\n\r\n[b]Reason:[/b] This speaks for itself.\r\n\r\n***This next change only applies to the RST version main file***\r\n\r\n[b]Problem:[/b] Shield Charge, and perks that offered Slow Time effects were overpowered, and in my opinion, unnecessary. Also, Fists of Steel is just there...\r\n\r\n[b]Solution:[/b] Shield Charge now allows you to sprint with a shield, and that is all. Slow Time perks and Fists of Steel have been removed.\r\n\r\n[b]Reason:[/b] Just being able to sprint while blocking is incentive enough to get the perk. It doesn\\'t need a godly overpowered Unrelenting Force effect added to it. The Slow Time perks and Fists of Steel were obviously optional, but it\\'s just annoying to see them there.\r\n\r\n\r\n[center]====================================================================================[/center]\r\n\r\n\r\n[b]Installation, uninstallation, and compatibility:[/b]\r\nInstall with Nexus Mod Manager\r\n-or-\r\nExtract anywhere, then move or copy the .esp file(s) and the meshes folder into your Skyrim/data folder and be sure the mod(s) is/are checked in data files. To uninstall, remove the .esp file(s) from the data folder, the DwarvenSword.nif from the data/meshes/weapons/dwarven folder, the BladesSword.nif from the weapons/akaviri folder, the NightingaleSword.nif from the weapons/nightingale folder, and the 1stPersonEbonyBlade.nif and EbonyBlade.nif from the weapons/ebonyblade folder. \r\nThis mod may not be fully compatible with other mods that modify or overhaul the Combat system, but should work fine with any dlcs. It was built around the latest release version of Skyrim.\r\n\r\n\r\n[center]====================================================================================[/center]\r\n\r\n\r\n[b]Included meshes:[/b]\r\n\r\nThe Ebony Blade meshes make it a One-Handed weapon as it should be. These are required unless you have another mod that makes changes to the Ebony Blade as a Two-Hander. In that case, load said mod after Proper Combat and do not install the Ebony Blade meshes. The other meshes are to fix weapons that do not have sheathes for NPCs. These are optional.\r\n\r\n[b]More specific details on what categorizes an item under Critical Smithing or Accession:[/b]\r\n\r\nI\\'m sure any knowledgeable Skyrim players could guess what falls under the artifact category--all Daedric artifacts, obviously, and any other \\\"stand-out\\\" items, like Dragon Priest masks or Auriel\\'s equipment.\r\nFor an item to be rare, it pretty much needs a unique name, but not always its own look. For example, if a war axe is called \\\"Iron War Axe of Super Doom\\\", then it will be classified as a normal Iron weapon. However, if the same axe is called \\\"Super Doom Axe\\\", so it is unique, then it would be considered rare. One example is \\\"Ironhand Gauntlets\\\", which are unique Steel gauntlets. Other rare items are all generic armor sets, such as Imperial, Stormcloak, Elven Gilded, Steel Plate, Dark Brotherhood, Thieves Guild, etc. Odd weapons like the pickaxe, woodcutter\\'s axe, fork, knife, etc. are all rare as well.\r\nPretty much, if an item does not fall under the specific armor and weapon sets of main perks, or Accession, then it falls under Critical Smithing.\r\nThe idea is that a Critical Smith is a blacksmith that isn\\'t good at creating his own stuff, but can critique what he finds and improve it.\r\n\r\n[b]Note for the DLC files:[/b]\r\n\r\nFor Dawnguard, Steel crossbows and bolts will be forgeable with the Hide Smithing or Steel Smithing perk after the relative quest(s). The Dwarven versions will require the Leather Smithing or Dwarven Smithing perk. For Hearthfire, building materials will not be forgeable until you first visit your house. That said, the Hearthfire addon is strictly optional. I thought it was a bit disorienting to see Building Materials in the Smithing menu right from the start, especially for a new player who would have no idea what they are for. Introducing them after you are instructed to use the drafting table makes much more sense. For Dragonborn, Stalhrim Light Armor will be forgeable with the Scaled Smithing perk, and Stalhrim Heavy Armor with the Ebony Smithing perk. The weapons are available to both. It is said through the quest that if you can forge Ebony, you can forge Stalhrim, and Scaled Smithing offers Ebony weapon forging as well as Scaled Armor.\r\n\r\n[b]Note from author:[/b]\r\n\r\nIf there is a mod that makes these exact changes and nothing more, please let me know and I will strangle myself with floss.\r\n\r\n\r\n[i]Thanks, and have fun bashing stuff to pieces.[/i][/size][/font]",
  "categoryId": "79",
  "version": "V1.3",
  "author": "Bergzore",
  "createdUnix": "1365038608",
  "updatedUnix": "1365555452",
  "containsAdultContent": false,
  "uploadedBy": "Bergzore",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000022374",
      "name": "Proper Combat Hearthfire",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Proper Combat Hearthfire-34340-V1-1.zip",
      "uploadedUnix": "1365105806",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/447ac9ab5d9f4574d09668c8ae44a9b86fa13c0af70d328608dbf4f07c5e109f/analysis/1407506102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proper%20Combat%20Hearthfire-34340-V1-1.zip?fid=1000022374&ttl=1535812112&ri=8192&rs=8192&setec=09f3970b705c6c90a71e1417d39e9385"
    },
    {
      "fileId": "1000023507",
      "name": "Proper Combat Dawnguard",
      "version": "V1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8",
      "fileName": "Proper Combat Dawnguard-34340-V1-3.zip",
      "uploadedUnix": "1365545425",
      "modVersion": "V1.3",
      "virusScanUrl": "https://www.virustotal.com/file/91707bbe24945b43f9e0936609d96b3b9d6e5d7fb29f69aed4d137e539e0babe/analysis/1407514629/",
      "changelogHtml": " Removed perk requirements to forge Fur and Iron items <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proper%20Combat%20Dawnguard-34340-V1-3.zip?fid=1000023507&ttl=1535812112&ri=8192&rs=8192&setec=20be97d055551d6b0a3b94d045c6cb61"
    },
    {
      "fileId": "1000023508",
      "name": "Proper Combat Dawnguard RST",
      "version": "V1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8",
      "fileName": "Proper Combat Dawnguard RST-34340-V1-3.zip",
      "uploadedUnix": "1365545467",
      "modVersion": "V1.3",
      "virusScanUrl": "https://www.virustotal.com/file/67ce3c3b195d38c129e58294f059dd9e2dc1c97355646bbd698f9be08a452e7a/analysis/1407514699/",
      "changelogHtml": " Removed perk requirements to forge Fur and Iron items <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proper%20Combat%20Dawnguard%20RST-34340-V1-3.zip?fid=1000023508&ttl=1535812113&ri=8192&rs=8192&setec=58c8a378a316e4dc81c1e2c796d3d901"
    },
    {
      "fileId": "1000023510",
      "name": "Proper Combat Dragonborn",
      "version": "V1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8",
      "fileName": "Proper Combat Dragonborn-34340-V1-3.zip",
      "uploadedUnix": "1365545514",
      "modVersion": "V1.3",
      "virusScanUrl": "https://www.virustotal.com/file/a68a07a009fc73079ee8eeb574651d859872dcae8e63ad57b256ac4f47ac6792/analysis/1407514699/",
      "changelogHtml": " Removed perk requirements to forge Fur and Iron items <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proper%20Combat%20Dragonborn-34340-V1-3.zip?fid=1000023510&ttl=1535812113&ri=8192&rs=8192&setec=934528381cc6bbca4ee0cab69a43cbd6"
    },
    {
      "fileId": "1000023515",
      "name": "Proper Combat",
      "version": "V1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "293",
      "fileName": "Proper Combat-34340-V1-3.zip",
      "uploadedUnix": "1365547946",
      "modVersion": "V1.3",
      "virusScanUrl": "https://www.virustotal.com/file/ca2826312b93c71063bd4f65b30a7f09c3678c8679f3fd8805b00ec24c73ef74/analysis/1407514711/",
      "changelogHtml": " Removed perk requirements to forge Fur and Iron items <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proper%20Combat-34340-V1-3.zip?fid=1000023515&ttl=1535812113&ri=8192&rs=8192&setec=c55abafff4cb252707d62f5291bf9640"
    },
    {
      "fileId": "1000023527",
      "name": "Proper Combat RST--Remove Silly Things",
      "version": "V1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "293",
      "fileName": "Proper Combat RST--Remove Silly Things-34340-V1-3.zip",
      "uploadedUnix": "1365555452",
      "modVersion": "V1.3",
      "virusScanUrl": "https://www.virustotal.com/file/c290a8e5ca5e433dafc1d1d1afa7a8cd60fa8f89c134c83c21bcaa9ebc43872c/analysis/1407514851/",
      "changelogHtml": " Removed perk requirements to forge Fur and Iron items <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proper%20Combat%20RST--Remove%20Silly%20Things-34340-V1-3.zip?fid=1000023527&ttl=1535812114&ri=8192&rs=8192&setec=e20798781cc01ec96328a9f7b284c21e"
    }
  ]
}