{
  "modId": 34349.0,
  "modName": "Sagas Tomb",
  "summary": "Simple Follower with a Simple Dungeon",
  "descriptionHtml": "This is both a dungeon & a follower mod; the dungeon, which can be found at the base of the bonestrewn crest, is a sort of introduction or more interesting way of bringing a new character into the game than simply placing them into an already existing cell.\r\n\r\nThe dungeon itself is mostly there for you to walk through and enjoy, but there are a few engagements and one boss type battle. I tested it with my character on legendary mode, but if it\\'s simply too hard feel free to cheat and move through the next area. \r\n\r\nAt the end of the dungeon is Saga, and for whatever reason she is in the dungeon waiting to be your follower! \r\n\r\nAs for her appearance, you may or may not like it, I would like to make her an interesting standalone follower... more specifically I\\'d like to recruit someone to do it, as I am not really interested in doing that sort of stuff.  Just to be clear though, no other mods were used to enhance her appearance, if you want her to look like the image you would have to use the same mods I do.\r\n\r\nThe mods used in the image are Maevan2\\'s Mature skin and The Wilds 3.0 ENB.\r\n\r\n\r\nEnjoy~ \r\n\r\nAlso if you like this dungeon you might want to try my other one: \r\nhttp://skyrim.nexusmods.com/mods/30481\r\n",
  "categoryId": "88",
  "version": "1",
  "author": "Endolite",
  "createdUnix": "1365018038",
  "updatedUnix": "1365017048",
  "containsAdultContent": false,
  "uploadedBy": "Endolite",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000022175",
      "name": "Sagas Tomb",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "444",
      "fileName": "Sagas Tomb-34349-1.7z",
      "uploadedUnix": "1365017048",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8ac8c0062a80894b3ed8bc35e4d9a2db8b171334fb62169a9487ad6471b52cf7/analysis/1407504064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sagas%20Tomb-34349-1.7z?fid=1000022175&ttl=1535812137&ri=8192&rs=8192&setec=35c7d7933c0f8389620a89114fdd4caf"
    }
  ]
}