{
  "modId": 34387.0,
  "modName": "UYS- Upgrade Your Summon",
  "summary": "CLICK HERE TO READ FULL  \r\nThis mod adds a fully upgradable summon that is weak at the start but can build him to be one of the best summons in the game. Version 1.8 is out download now.",
  "descriptionHtml": "[img] http://skyrim.nexusmods.com/mods/images/34387-1-1365674421.png [/img]\r\nVERSION 1 \r\nwhen in game use this command to get THE FIRST SUMMON bat uysjohn DO THIS FIRST OR THE PROBLEM BELOW WILL HAPPEN. AND USE THIS COMMAND TO GET THE RING bat uys\r\n\r\n  VERSION 2 \r\nwhen in game use this command help \\\"uys class section\\\" then find the code then put player.additem (code here) then space then 1 \r\n\r\n[color=red]WARNING PLEASE READ FIRST \r\nDue to the layout of the menu and the scripting there is a slight problem but can break the mod. This problem occurs when you have enough gold but dont go from left to right in ACENDING ORDER basically what will happen is it wont will run the script but because it will only allow it to run the script once when it comes to purchasing it and you have the correct amount of gold and have gone in the right direction from left to right not skipping it wont run the script therefore it wont upgrade john. So to avoid this i asure you to SAVE every time you make an upgrade and to GO IN THE RIGHT DIRECTION FROM LEFT TO RIGHT.[/color]     PS i am trying to solve this problem   \r\n\r\n\r\nUYS MAIN V2.0\r\nThis recent BIG update adds a new menu to the game called class selection wich enables you to pick a different play-style for example john the warrior. This also adds a new summon into the selection menu called mage which alows the player to summon a mage and to upgrade his armor and his spells(replacement for weapons) to a bad ass mage. To get the new ring you must type help \\\"uys class selection\\\" then find the code then player.additem (code here) 1. THERE IS NOW NO NEED TO ADD JOHN THIS IS ALL ADDED WHEN A CERTAIN PLAYSTYLE IS PICKED.\r\n\r\n\r\n\r\n[color=green] MAIN INFO\r\nThis mod adds a conjurerable man called john into the world of Skyrim with limited weapons and no armor.You are able to upgrade John from a naked wimp to a demolishing bad ass through a ring that can be added by this command bat uys. Each upgrade costs a certain amount of gold. First the player has only access to the armor menu UNTIL!! he has purchased all available upgrades to the armor menu, i wanted to do this because if the player has access to both menus then it wouldn\\'t take long to fully upgrade John. [/color]\r\n\r\n[color=red] FUTURE PLANS \r\nfor the future of this mod i am hopping to make more conjureable characters but different style  of armor/gameplay/magic for example a mage. Also for the future i will be making a complete overhaul on the conjuration spells already in the game for example summon Dremora with a totally unique upgrade system. [/color]\r\n\r\n\r\nARMOR MENU FURTHER DETAIL \r\nIn the armor menu you can purchase upgrades to boost johns armor, BUT you cant select anything on the menu you have to start from the left and work your way up. \r\n\r\n\r\n\r\nWEAPON MENU FURTHER DETAIL \r\nOnce you have purchased all upgrades for the armor menu you then will be able to purchase upgrades from the weapon menu. BUT again you must start from the left side and make your way over to the right.\r\n\r\n\r\n\r\nNO SWITCHING BETWEEN THE TWO (ARMOR/WEAPONS)\r\nIn this version of the mod 1.0 you will not be aloud to switch between the two upgrade menu\\'s. You have to start with the armor menu then once you have purchased all upgrades you will then be given another ring and this one will be the weapon menu.\r\n\r\n\r\n\r\n[color=green]  UYS NO LIMITATIONS OPTIONAL VERSION \r\nSome people have requested to choose what they want out of the menu\\'s without going up in accending order so that\\'s what i have done with this new optional version. This version also fixes most problems scripted at the top of the page. To get the ring just do the same thing and also you need the first conjure john to be able to purchase upgrades and again this can cause problems so it is acential to add the first conjure john with this command bat uysjohn and the other for the ring is uys. [/color]\r\n[color=red] REMEMBER PLZ SAVE AFTER EACH UPGRADE BECAUSE IF YOUR NOT CAREFUL THIS PROBLEM THAT IS STATED AT THE TOP COULD HAPPEN THERES A 15 PERCENT CHANCE FOR THIS VERSION AND A 75 PERCENT CHANCE FOR THE OTHER VERSION.  YOU HAVE BEEN WARNED !!! [/color] \r\n\r\nNO LIMITATIONS\r\n\r\nINSTALATION FOR NMM\r\nJust click the download with nmm like normal and when it asks you to overwrite you are to do so.\r\n\r\nNEW VERSION 1.8                                DATE 4/14/13 \r\nIn this new version (1.8) there some things i have fixed like miss spellings and some scripts not working but the meager change to this mod is the files during installation. This mod now does not need the scripts folder or source folder to run it is all compressed into a BSA file therefore it makes it easier to install and quicker to unstall. Another change is that if your using nexus mod manager then when you activate the mod there is a little installation menu for the player to get more of an in depth view of the mod.  \r\n[img] http://static.skyrim.nexusmods.com/mods/images/34387-5-1365895811.jpg [/img]",
  "categoryId": "93",
  "version": "2.0",
  "author": "Mrwoody",
  "createdUnix": "1365678782",
  "updatedUnix": "1366063615",
  "containsAdultContent": false,
  "uploadedBy": "mrwoody",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000023836",
      "name": "UYS MAIN",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "UYS V1-34387-V1-0.rar",
      "uploadedUnix": "1365705549",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2ef94915b821bcbd45daa1a5421564b1328ad412c194a23fa31c9fed702f248b/analysis/1407517270/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UYS%20V1-34387-V1-0.rar?fid=1000023836&ttl=1535812193&ri=8192&rs=8192&setec=16e5ef576c12170054a6d939eabb59bd"
    },
    {
      "fileId": "1000023968",
      "name": "UYS NO LIMITATIONS",
      "version": "1.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "12",
      "fileName": "UYS NO LIMITATIONS-34387-1-5.rar",
      "uploadedUnix": "1365790912",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/b08f9059ba7c16af8063cfd1e226dd09c889de2fe5a6f94787f0e5ca44a3ff0f/analysis/1407518286/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UYS%20NO%20LIMITATIONS-34387-1-5.rar?fid=1000023968&ttl=1535812193&ri=8192&rs=8192&setec=babaa71dc58238e652f1a6389d586148"
    },
    {
      "fileId": "1000024242",
      "name": "UYS Version 1_8",
      "version": "1.8",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "1889",
      "fileName": "UYS version one point eight -34387-1-8.rar",
      "uploadedUnix": "1365896640",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/814de7dc4e66c9f3c291987d1c9660f3a2bc6a6ec5b61493b2e3699d334e050a/analysis/1407520866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UYS%20version%20one%20point%20eight%20-34387-1-8.rar?fid=1000024242&ttl=1535812194&ri=8192&rs=8192&setec=d5e76d21b94062e51205699736a2da15"
    },
    {
      "fileId": "1000024669",
      "name": "UYS V2 MAIN",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2155",
      "fileName": "UYS V2 MAIN-34387-2-0.rar",
      "uploadedUnix": "1366063615",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/0383cc9ade56d413d0462e883a7b6931eccd8ba0f6208e0465d95aa267b0aba3/analysis/1407524179/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UYS%20V2%20MAIN-34387-2-0.rar?fid=1000024669&ttl=1535812194&ri=8192&rs=8192&setec=8b725f4c23a8378fed5dd65cdc615f79"
    }
  ]
}