{
  "modId": 34419.0,
  "modName": "Smallfolk",
  "summary": "A work in progress (Yeah I know sorry : P ) If it is deemed inappropriate to have this up at an early stage, I will gladly take it down. I am uploading what I have because I am a noobie, and would love input.",
  "descriptionHtml": "--- This is intended as a new land with quests and fluff to come. At this moment, this mod is only up to gather opinions/advice/etc.----\r\n\r\nTo install, just drop the Smallfolk esp in your data folder, and the GoToGreyridge script into your script folder. (Only one, clean, simple script, but still, don\\'t do any saving to ensure a clean uninstall.) I\\'ll say it again, this is up for input, and is very basic. If it shouldn\\'t be up, I shall take \\'er down for the time being.\r\n\r\nATTENTION, SEPTEMBER 2013: This is not a dead project. Found a backup a while ago. Once evens out I will be pressing forward. Won\\'t be posting any updates until i catch back up to my previous work.\r\n\r\nI\\'m new to modding, and this is my first swing at a project. We are at the basic conceptual stage here. This will most likely be a slow learning process, and a slower creation process. The details and ideas are likely to change frequently. Opinions, suggestions, advice, word of encouragement, words of hate, tomato throwing, or just jibberish, all welcome. This mod is called Smallfolk because the story takes place on an island of little importance with similar people. You won\\'t become a guild leader or warlord by finishing X amounts of quests. \r\n\r\nCurrently, there is a statue just west of the Whiterun stables that you can\\'t miss. This is a one way path to Sharpstone. (Don\\'t save.) Not an inch of the island is polished or done, and many existing locations are jagged and ugly. A semi hidden path leading to a cave can be found. (Cave\\'s interior is a small copy and pasted placeholder.) .\r\n\r\nMy intention still is to create branching questlines with visible consequences be it small or large. I\\'m thinking that incorporating a sailable boat mod would be nice, but either way things are going to be a bit more incremental. (As in, this island won\\'t be the only one.) ",
  "categoryId": "35",
  "version": "0.003",
  "author": "Greenpact",
  "createdUnix": "1365178807",
  "updatedUnix": "1366128414",
  "containsAdultContent": false,
  "uploadedBy": "Greenpact",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024790",
      "name": "Smallfolk",
      "version": "0.003",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "601",
      "fileName": "Smallfolk-34419-0-003.7z",
      "uploadedUnix": "1366128414",
      "modVersion": "0.003",
      "virusScanUrl": "https://www.virustotal.com/file/6af8e2d6c353f61a23584702a0c8fcf96629ef2581c296ebe084e20eb1075977/analysis/1407525308/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Smallfolk-34419-0-003.7z?fid=1000024790&ttl=1535812254&ri=8192&rs=8192&setec=2ec039549183c792bb48d6b3ae65e1e0"
    }
  ]
}