{
  "modId": 34435.0,
  "modName": "Requiem - The Roleplaying Overhaul - Traduccion - Spanish Translation",
  "summary": "Traducion del mod requiem.\r<br />Este mod es propiedad del usuario Xarrian, yo solo me encargue de traducirlo al español con su permiso. Espero que lo disfruten.\r<br />\r<br />Si todavía no tienen este increíble mod, lo pueden encontrar aqui :\r<br />http://skyrim.nexusmods.com/mods/19281\r<br />\r<br />",
  "descriptionHtml": "Traducción BETA del mod requiem (Versión antigua &#34;Non Dawnguard&#34; - Pendiente terminar de traducirla)\r<br />Este mod es propiedad del usuario Xarrian, yo solo me encargue de traducirlo al español con su permiso. \r<br />\r<br />Si todavía no tienen este increíble mod, lo pueden encontrar aquí :\r<br />http://skyrim.nexusmods.com/mods/19281\r<br />\r<br />\r<br />Para quienes hayan llegado a esta traducción y todavía no lo conozcan, les explicare un poco:\r<br />\r<br />1- ¿Que cosas añade este mod?\r<br />\r<br />Este mod se encarga de mejorar la jugabilidad de Skyrim haciéndolo de un modo mucho mas realista de la siguiente forma:\r<br />- Las flechas son mortales. Un flechazo en la cabeza basta para matar a alguien.\r<br />- Los NPC tienen mejor puntería.\r<br />- La magia se ha vuelto mucho mas letal, pudiendo morir quemado en segundos por magia de fuego.\r<br />- Ahora los animales no solo darán pieles, si no que al buscar en sus cadáveres podrás encontrar carne y órganos, como tuvo que haber sido originalmente.\r<br />- Añade mas tipos de armas al juego como espadas cortas, espadas largas, mazas, bastones para el combate, la posibilidad de fabricar flechas en la forja, etc.\r<br />- Las habilidades ahora subirán muy lentamente, por lo que subir de nivel sera todo un desafió. \r<br />- Los dragones y los draugr, entre otros enemigos, se volverán extremadamente fuertes. Hasta un grupo de bandidos puede resultar una amenaza.\r<br />- El oro tiene peso\r<br />- Las pociones no curan instantáneamente\r<br />- Los animales salvajes se han vuelto peligrosos. Un oso podría llegar a matarte de un solo zarpazo.\r<br />- El combate cuerpo a cuerpo es mucho mas letal (como bien se ha especificado en los puntos anteriores).\r<br />- Todas las perks han sido modificadas, para ser adaptadas al estilo de juego que el mod propone.\r<br />- Las armaduras pesadas consumen mas aguante y provocan que su portador se mueva extremadamente lento, a cambio de la posibilidad de soportar mas golpes, mientras que aquellos que decidan usar armaduras ligeras podrán moverse de manera ágil y rápida, con la desventaja de resistir menos golpes.\r<br />\r<br />Entre otras tantas características que les invito a que las descubran ustedes mismos.\r<br />\r<br />2- ¿Por que hay algunas cosas sin traducir?\r<br />\r<br />Eso se debe a lo extenso que es el mod, por lo que solo me limite a sacar una versión beta de la traducción, aunque una gran parte de el esta traducida.\r<br />\r<br />3- ¿Para que version del mod sirve esta traducción?\r<br />\r<br />Esta traducción es para la versión 0941 Non-dawnguard del mod. Es un tanto antigua, pero vale la pena probarla.",
  "categoryId": "79",
  "version": "941",
  "author": "EvilOverlord5",
  "createdUnix": "1365194567",
  "updatedUnix": "1365194240",
  "containsAdultContent": false,
  "uploadedBy": "EvilOverlord5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000022617",
      "name": "Requiem - Traduccion al espanol - Version beta",
      "version": "0948",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "485",
      "fileName": "Requiem - Traduccion al espanol - Version beta-34435-0948.rar",
      "uploadedUnix": "1365194240",
      "modVersion": "0948",
      "virusScanUrl": "https://www.virustotal.com/file/63e3b7ec9c7629921dba75db49de977080d7c265a81cd9e8a62bc5dbdb34caa5/analysis/1407508169/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20-%20Traduccion%20al%20espanol%20-%20Version%20beta-34435-0948.rar?fid=1000022617&ttl=1535812306&ri=8192&rs=8192&setec=af52848c8c9b31b9d7fa1bd8f296b1a3"
    }
  ]
}