{
  "modId": 34459.0,
  "modName": "Forgotten Magic Spanish",
  "summary": "Traducción al español del mod \\\"Forgotten Magic\\\" de 3jiou.",
  "descriptionHtml": "[CENTER]\r\nTraducción al castellano del mod \\\"Forgotten Magic\\\" de 3jiou.\r\n[i]Esta traducción requiere del mod original:[/i]\r\n[url=http://skyrim.nexusmods.com/mods/23625]-Forgotten Magic-[/url]\r\n\r\n\r\n[LINE]\r\n\r\n[size=12][color=red]El DLC Dawnguard es requerido, SKSE también.[/color][/size]\r\n\r\n[LINE]\r\n\r\n[b][color=orange]DESCRIPCIÓN[/color][/b]\r\n\r\n[/CENTER]\r\n\r\nForgotten Magic(Magia Olvidada) te trae algunos de los hechizos más completos e interesantes para Skyrim hasta la fecha, es la continuación del mod [url=http://skyrim.nexusmods.com/mods/16481]-Deadly Dragons: Spells-[/url], las artes arcanas ahora pueden ser dominadas.\r\n\r\nMientras que otros mods magia a menudo introducen cientos de hechizos diferentes (que puede ser un poco abrumador) este mod tiene un enfoque diferente. Magia olvidada proporciona un conjunto más reducido de hechizos, que en parte se complementan entre sí, y trata de mantenerse equilibrado y envolvente.\r\n\r\nLo que hace este mod especial es que los hechizos que usas suben de nivel contigo y te permitirá descubrir algunos de los misterios ocultos en sus scripts, otorgando nuevos efectos sobre ellos a medida que crecen más y más fuertes.\r\nAquellos que quieran utilizar el mayor número posible de diferentes hechizos pueden usar este mod junto con otros mods mágicos sin ningún problema.\r\n\r\nMagia olvidada va en un largo camino hacia el objetivo un verdadero sistema de hechizos complementario, dándote la oportunidad de dominar una serie de hechizos que cubrirán tu estilo de juego, en las distintas escuelas de magia, mientras que desatan una gran cantidad de efectos combinados que van a deslumbrar incluso al Archimago.\r\n\r\nE incluso puedes hacer uso de las almas dragón, para permitir que tus hechizos crezcan más rápidamente en poder, por un período corto de tiempo. ¿Interesado?\r\n\r\n[LINE]\r\n[CENTER]\r\n[b][color=orange]CARACTERÍSTICAS[/color][/b]\r\n[/CENTER]\r\n[LINE]\r\n\r\nMagia olvidada añade 42 nuevos hechizos al juego, cada uno con 7 posibles mejoras de hechizo, más de 280 mejoras en total. El nivel de los conjuros tiene un máximo(esta capado) de 4.\r\nLos hechizos ganan experiencia a medida que los utilizas, lo que te permite desbloquear un nuevo efecto cada vez que subas de nivel.\r\nEstas mejoras, así como los propios hechizos pueden ser combinados para conseguir efectos mayores, depende ti decidir dónde está tu verdadero poder.\r\n\r\nTambién hay 9 poderes que te ayudarán a completar tu estilo de juego. En su mayoría son habilidades pasivas que duran hasta que se cancelen.\r\n\r\nEl poder \\\"Magia olvidada\\\" se utiliza para abrir el menú para subir de nivel tus nuevos hechizos. Basta con equipar tu hechizo elegido en tu mano * Izquierda *, activar el poder, y el menú aparecerá. Puedes ver tu experiencia de hechizo actual, los puntos restantes, y las actualizaciones disponibles para ese hechizo especial. Además, una vez que has utilizado un hechizo lo suficiente para que alcance el nivel siguiente, recibirás una notificación en pequeño que dice \\\"¡Tu hechizo ha subido de nivel!\\\" en la esquina superior izquierda de la pantalla.\r\n\r\nLos Hechizos adquieren experiencia a través de un golpe exitoso en un objetivo, o cuando se utilizan durante el combate, si es un hechizo pasivo o algo similar. Por cada nivel que ganas con un hechizo, la experiencia requerida se incrementa al doble. Sólo los más dedicados dominarán este arte. El Dovahkiin posee una cierta ventaja sobre los magos normales y pueden usar alma de dragón para aumentar la experiencia adquirida por tus hechizos durante 6 horas. Esta habilidad se llama \\\"Mente Arcana\\\", y es necesario desbloquearla mediante la lectura del tomo correspondiente (que se debe encontrar o comprar a Dominus).\r\n\r\n\r\n[LINE]\r\n[CENTER]\r\n[b][color=orange]QUE SON ESTOS HECHIZOS[/color][/b]\r\n\r\n[LINE]\r\n\r\nClicka sobre una escuela de magia para ver una descripción completa. En inglés.\r\n\r\n[url=http://skyrim.nexusmods.com/articles/584/]Death Magic[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/articles/585/]Divine Magic[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/articles/586/]Nature Magic[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/articles/587/]Fire Magic[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/articles/588/]Arcane Magic[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/articles/589/]Frost Magic[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/articles/590/]Storm Magic[/url]\r\n[/CENTER]\r\n\r\n[color=red]IMPORTANTE[/color]: La ventaja \\\"impacto\\\" del árbol de destrucción no afecta a los hechizos de este mod. Esto es intencional, porque, francamente, la ventaja \\\"impacto\\\" es super poderosa. Si ya tienes la ventaja \\\"impacto\\\" con el personaje actual escribe en la consola:\r\n\r\n\\\"player.removeperk 153d2\\\" - esto elimina la ventaja-impacto\r\n\\\"player.addperk <perk-id>\\\" - esto suma la ventaja de tu elección (puedes encontrar la ID para todas las ventajas de Skyrim aquí ... simplemente haga clic en cualquiera de las maestrías y busca la ID)\r\n\r\n\r\n[LINE]\r\n[CENTER]\r\n[b][color=orange]DONDE ESTÁN LOS HECHIZOS[/color][/b]\r\n[/CENTER]\r\n[LINE]\r\n\r\nPara iniciar la búsqueda que te permitirá aprender los hechizos, necesitas hablar con Dominus en Carrera Blanca. Puede ser encontrado vagando por la ciudad o en el interior de la Yegua Abanderada (a veces se esconde en uno de los cuartos traseros).\r\n\r\nRecibirás el primer hechizo de tu dominio elegido como recompensa por completar la misión. El resto o bien se puede comprar de Dominus (\\\"¿Tienes algo especial?\\\") O se puede encontrar en cajas fuertes en diferentes mazmorras listadas a continuación:\r\n\r\n     *Bleak Falls Barrow(Sagrario de las Cataratas Lúgubres) - Hechizos al azar\r\n     *Forsaken Cave(Cripta abandonada) - Magia de Muerte\r\n     *Folgunthur - Magia de Hielo\r\n     *Forelhost(Refectorio de Hueste de Forel) - Magia de Tormenta\r\n     *Orotheim - Magia Divina\r\n     *Pinewatch(Santuario de bandidos de Guarda Pineda) - Magia de la Naturaleza\r\n     *Gorge Sunderstone(Garganta de Peña Partida) - Magia de fuego\r\n     *Hag\\'s End(Punta de la Arpía) - Magia Arcana\r\n\r\n*****Ten en cuenta que las cajas fuertes no aparecerán hasta haber terminado la misión de Dominus.\r\n\r\n\r\n\r\n[LINE]\r\n[CENTER]\r\n[b][color=orange]COMPATIBILIDAD[/color][/b]\r\n[/CENTER]\r\n[LINE]\r\n\r\nHasta el momento muy, muy pocos conocen o confirmaron problemas de compatibilidad. En caso de experimentar alguno, por favor notifiquenos en los comentarios y 3jiou echará un vistazo a él tan pronto como le sea posible.\r\n     Como norma general: Antes de avisarnos de su problema en los comentarios, trate de cambiar el orden de carga de los mods (poniendo Forgotten Magic al final o al principio de la orden de carga) y ver si eso ayuda.\r\nForgotten Magic es compatible con \\\"Skyrim T3nd0s Redone\\\", \\\"Apocalypse Spell Package\\\" y cualquier otra mod de magia para el caso (salvo que otro mod realmente elimina texturas de ortografía y las animaciones del juego).\r\n\r\n\r\n[color=red]PERO[/color]\r\n\r\nAlgunos de los añadidos, más nuevas ventajas de SkyRe no se aplican a los conjuros de Forgotten Magic todavía (esto se añadirá en el futuro). Todos los ventajas que se basan en las ventajas de vainilla-se aplican sin embargo.\r\n     El hechizo \\\"Ciclón Elemental\\\" de Apocalipsis parece meterse con varios hechizos de Forgotten Magic (causando clipping extraño y fallos gráficos).\r\n\r\n\r\n[LINE]\r\n[CENTER]\r\n[b][color=orange]PROBLEMAS CONOCIDOS[/color][/b]\r\n[/CENTER]\r\n[LINE]\r\n\r\nSi no recibes la opción de iniciar la búsqueda cuando hablas con Dominus, sólo tienes que guardar y volver a cargar.\r\nDebido a un problema extraño de conversión de apóstrofos (\\') pueden aparecer como cuadrados en los diálogos con Dominus. Por el momento, sin embargo, esto no se puede solucionar. Si alguien tiene una solución para este problema, por favor póngase en contacto con 3jiou.\r\nDebido a que el mod no contiene voces para los diálogos, los usuarios pueden experimentar un problema con la visualización de las líneas de diálogo (que desaparecen demasiado rápido). Esto es exactamente porque no hay ningún archivo de voz conectado al diálogo todavía. Para solucionarlo el ya conocido:\r\n[url=http://skyrim.nexusmods.com/mods/14884]Fuz Ro D-oh - Silent Voice[/url]\r\n\r\n[LINE]\r\n\r\n[i]En el siguiente enlace podréis encontrar mis otros mods traducidos al español, así como de otros traductores.[/i]\r\n[url=http://skyrim.nexusmods.com/mods/34137]Translations and mods to spanish in the nexus[/url]\r\n\r\n\r\n[size=10][i][b]Thanks to 3jiou for this mod.[/b][/i][/size]",
  "categoryId": "75",
  "version": "v4.3.0",
  "author": "Jalmpitt",
  "createdUnix": "1365249197",
  "updatedUnix": "1365246280",
  "containsAdultContent": false,
  "uploadedBy": "jalmpitt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000022775",
      "name": "ForgottenMagic V4-3-0 Spanish",
      "version": "v4.3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "122",
      "fileName": "ForgottenMagic V4-3-0 Spanish-34459-v4-3-0.rar",
      "uploadedUnix": "1365246280",
      "modVersion": "v4.3.0",
      "virusScanUrl": "https://www.virustotal.com/file/79309f41aad7337b765437f658a49dfc58a01ca261fad1ce9d6abe39180250c4/analysis/1407509323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ForgottenMagic%20V4-3-0%20Spanish-34459-v4-3-0.rar?fid=1000022775&ttl=1535812346&ri=8192&rs=8192&setec=d78af7fc9a0b2aa16792e342a6c64257"
    }
  ]
}