{
  "modId": 34454.0,
  "modName": "The Bloodmoon Calls - Lycanthropy Reborn",
  "summary": "TBMC Is a Unique lycanthropy MOD With many werebeast spawns",
  "descriptionHtml": "[img=center]http://i49.tinypic.com/32zl4c9.jpg[/img]\r<br />============================================================================================\r<br />REQUIRES: Nothing\r<br />[size=4][u][i][b]HIGH COMPATIBILITY VERSION:[/b][/i][/u][/size]\r<br />------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />[size=3][u][i][b]UPDATE HC1.1[/b][/i][/u][/size]-\r<br />\r<br />1) Added Check to script to prevent werebeast spawns indoors \r<br />\r<br />2) Minim Level player level requirements added to werebeast spawns\r<br />   a)Werewolf = Player LVL 6\r<br />   b)Werebear = Player LVL 12\r<br />   c)Weresabre = Player LVL 18\r<br />   d)Weredrake = Player LVL 24\r<br />\r<br />3) Werebeast lunar cycle spawn chances tweaked* \r<br />     *changes marked with star in [i][b]&#34;Werebeasts lunar spawn chance[/b][/i]&#34; section below \r<br />-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />MCM MENU CONTAINS NO OPTIONS TO INFECT YOURS SELF THIS IS FOR COMPATIBILITY WITH MOON LIGHT TALES THE ESSENTIALS\r<br />[i][b]MOON CYCLE:[/b][/i]\r<br />\r<br />[b]0[/b] = full moon \r<br />[b]1[/b] = waning gibbous \r<br />[b]2[/b] = last quarter \r<br />[b]3 [/b]= waning crescent \r<br />[b]4 [/b]= new moon \r<br />[b]5[/b] = waxing crescent \r<br />[b]6[/b] = first quarter \r<br />[b]7[/b] = waxing gibbous \r<br />\r<br />[i][b]Werebeasts lunar spawn chance-[/b][/i]\r<br />(Leveled single* & group encounters*)\r<br />    * Based on race (this means on full moon you may get (1 werewolf) (1 weresabre) (1 werebear) & (1 weredrake) these all count as separate single events \r<br />       the same is true for pack events this means at lvl 50+ each pack event has 4 werebeast per event so on a full moon if all pack events are running you may enconter up to but no more then 16 werebeasts at time in one night \r<br />\r<br />[b] 1) Werewolves[/b] ( LVLREQ: 6)\r<br />     if MoonPhase == 0\r<br />    Chance = 100\r<br />    elseif MoonPhase == 7 || MoonPhase == 1\r<br />    Chance = 50*\r<br />    elseif MoonPhase == 4\r<br />    Chance = 0\r<br />    else\r<br />    Chance = 15\r<br />\r<br /> [b]2) Werebears[/b]  (LVLREQ: 12)\r<br />    if MoonPhase == 0\r<br />    Chance = 45*\r<br />    elseif MoonPhase == 7 || MoonPhase == 1\r<br />    Chance = 25*\r<br />    elseif MoonPhase == 4\r<br />    Chance = 0\r<br />    else\r<br />    Chance = 10\r<br />\r<br />[b] 3) Weresabre[/b]  (LVLREQ: 18)\r<br />   if MoonPhase == 0\r<br />    Chance = 25*\r<br />    elseif MoonPhase == 7 || MoonPhase == 1\r<br />    Chance = 15*\r<br />    elseif MoonPhase == 4\r<br />    Chance = 0\r<br />    else\r<br />    Chance = 5*\r<br />\r<br />[b] 4) Weredrake[/b] (LVLREQ: 24)\r<br />if MoonPhase == 0\r<br />    Chance = 25\r<br />    elseif MoonPhase == 7 || MoonPhase == 1\r<br />    Chance = 5*\r<br />    elseif MoonPhase == 4\r<br />    Chance = 0\r<br />    else\r<br />    Chance = 1*\r<br />\r<br />(Any were there is a * next to the number marks a change in the spawn chance with the new HC1.1 upadate)\r<br />\r<br />[i][b]Silver Hand Events[/b][/i] -\r<br />\r<br />1) As werewolf you will have 2% chance to be hunted by werewolf hunter/hunters from the silver hand\r<br />\r<br />2) Leveled single & group encounters\r<br />\r<br />[i][b]Werewolf infection [/b][/i]-\r<br />Sainus Lupians is still present but the dilivery system has been changed to support all werewolf npcs even once added by other mods as the infection is now apart of the werewolf beast race.\r<br /> NO NPC/FOLLOWER INFECTION( may be added later)\r<br />\r<br />[i][b]MCM Menu-[/b][/i]\r<br /> 1)Werebeast spawn toggles\r<br />\r<br /> 2)Silver Hand Hunter toggle\r<br />\r<br /> 3)Player lunar werewolf change event Control:\r<br />    a) Full Moon \r<br />    b) High & Full Moon\r<br />    c) Low & Full Moon\r<br />   d) Every night\r<br />   e) Disabled\r<br />\r<br />4) Change Transformation animation\r<br />\r<br />5)Cycle Howls*\r<br /> * Compatible with MTE\r<br />     (It doent mater weather you change your howl with my mod or MTE it will regiter in both & will not interfere with the companions\r<br />\r<br />[i][b]COMPATABLITY -\r<br /> [/b][/i]This mod should be compatible with most other werewolf mods as this mod uses all original scripts and dose not edit any vanilla werewolf scripts\r<br />(TBMC-FULL, MOONLIGHT TALES FULL, TALES OF LYCANTHROPY & any other werewolf mods that add the werewolf disease to the game WILL NOT be compatible)\r<br />============================================================================================\r<br />============================================================================================\r<br />\r<br />\r<br />\r<br />[size=4][u][i][b]THE BLOODMOON CALLS FULL[/b][/i][/u][/size]\r<br />============================================================================================\r<br />REQUIRES: DAWNGUARD , DRAGONBORN\r<br />                 - High compality version dose not require any DLC&#39;s\r<br />SUBTITLES REQ (no voice acting{no mic sorry})\r<br />So after a long time of playing skyrim and playing a werewolf i felt very underwhelmed at the lack of traditional lore that we all know and love that make being one of these brutes both a blessing and curse. \r<br />\r<br />THEN Tales of Lycanthropy came out (and up until they switched to the modular version i loved it) but once the modular came out the old version fell into obscurity and many of the great features of the older version were lost.\r<br />\r<br />After talking with Brevi the original creator of T-o-L witch can be found here: http://skyrim.nexusmods.com/mods/12687\r<br />\r<br />I got his permission to use his source scripts and Have rebuilt this long lost mod from the ground up&#33;\r<br />\r<br />UPDATE 3.1:\r<br />*fix werebeast event spawns on solstheim\r<br />\r<br />*Bloodlust damage reduced by 5\r<br /> \r<br />*Werebeast perk tree feeding requirement Reduced from 50 to 35\r<br />(this means that as a new werebeast it will now only take 35 feedings to get your first perk point instead of 50)\r<br />\r<br />*Vanilla werewolf placements should now be any one of the 3 werebeasts based on you level\r<br />(this means when any were you may find werewolves in cages depending on you level may be any one of the 3 werebeasts)\r<br />\r<br />* 3 new ESP&#39;s for Falskaar users to allow werebeast events in falskaar world space.\r<br />\r<br />                                   Falskaar by AlexanderJVelicky\r<br />                     http://www.nexusmods.com/skyrim/mods/37994/?\r<br />( if you use the falskaar mod then & would like falskaar werebeast \r<br />events to work and trigger the use one of the new esps. Else if you \r<br />would like falskaar werebeast free{except for you of course} then use \r<br />the regular esps & wile in falskaar you may get the hunt messages \r<br />but they will not spawn)\r<br />\r<br />* updated werebeast immunities \r<br />\r<br />Purebred lycanthrope blood:\r<br />\r<br />As a purebred lycanthrope you maintain higher control over your condition then most hence you will have the power to trigger your transformation once per day. Companion werebeasts will always be purebreds at start, and feral werebeasts can &#39;go clean&#39; if they don&#39;t feed on humanoids for 2 full nights and survive. When you trigger your transformation, it will last for 180 seconds real-time (like in vanilla Skyrim) and each feeding (animals and humanoids) will extend it by 30 seconds. You must be careful however as feeding 3 or more times on humans during a single transformation will result in loosing your ability to stay in control of the beast and you will become a feral werebeast. The reason why feeding on humanoids can strain you is because you don&#39;t just devour your poor victims earthly remains... when a werebeast feeds it desecrates the very soul of your prey and your conscious will have to pay the price. Purebreds also gain bloodlust upon transformation but they can get away by feeding on animal corpses.\r<br />\r<br />On the nights of the full moon even purebred werebeasts will be transformed whether they like it or not\r<br />\r<br />\r<br />Feral lycanthrope blood:\r<br />\r<br />If you embrace the lust for carnage and walk the path of the feral lycanthrope you will be able to feed on human souls as many times as you want as you never hold back anyway. There is a price however as you won&#39;t have the ability to trigger transformation at will (as you are not in control of your condition) and only humanoids will settle your bloodlust. You embrace the big bad beast inside hence you will gain 50 points of fortified health compared to normal humans when you are not transformed (the beast would not want to loose such an eager host). There is a way to regain control even for the most bloodthirsty werebeast  but it won&#39;t be easy. You will have to survive two full nights in the row without feeding on humans at all. You will be under the effect of bloodlust (loosing health continuously) and you will have to feed on animal corpses to maintain yourself. Feeding on a human would of course settle the bloodlust but that way you cannot overcome your animal nature. \r<br />\r<br />============================================================================================\r<br />\r<br />\r<br />PLAYER MOON PHASE CHANGE: New werebeast events will take place the will happen regardless of whether you are infected or not\r<br />      -Event Chances\r<br />        * Full moon events chance 100%\r<br />        * 3/4 Events chance is 25%\r<br />        * New moon events chance 0%\r<br />        * any other time is a 10% chance\r<br />\r<br />(Only the dragonborn experiences 3/4 Event chance to change. This because of his dragonbood allows for a deeper bond with your beast spirit so the moon has more pull over you then other lycanthropes)\r<br />\r<br />\r<br />WEREBEAST RACES:\r<br />        *Weredova (High compatbility version only)\r<br />        *Weresabre (DONE)\r<br />        *Werewolf (DONE)\r<br />        *Werebear(DONE)\r<br />   \r<br />CURING LYCANTHROPY:\r<br />  To cure you Lycanthropy you will have to make your way to Glenmoril Coven and in the Back Sconces labeled Flame of Curing you will need to collect 10 beast hearts to cure your self. You can still get infected again if you contract the disease again.\r<br />     \r<br />*there are 10 free hearts in the chest in the same room as the Flame of hircine. \r<br />(after that you are on your own)\r<br />\r<br />(DO NOT USE WITCHES HEAD TO CURE YOUR SELF PLZ USE FLAME OF HIRCINE AND BEAST HEARTS)\r<br />\r<br />BEAST HEARTS:\r<br /> The werebeast that drops the hearts will depend on witch esp you are using.\r<br />\r<br />    *TBMCxWW.ESP: Werewolves drop Beast Hearts \r<br />\r<br />    *TBMCxWS.ESP: Weresabres drop Beast Hearts \r<br />\r<br />    *TBMCxWB.ESP: Werebears drop Beast Hearts\r<br />\r<br />\r<br />\r<br />(you will still need to collect the witches heads and got to Yasgmors tomb for the companions quest to cure Kodlak, Vilkas, or Farkas)\r<br />\r<br />HOWLS:\r<br /> Each Werebeast race will be able to change howls with the totems but Each race will have one howl that is Unique to that race.\r<br />\r<br />   *Werewolves : Howl of fear - Living cretures flee in terror\r<br />\r<br />   *Weresabres : Howl of Stalking - Turn invisible and muffles movement for short time \r<br />\r<br />   *Werebear : Howl of Blood Rage - Go in to a rage becoming a vicious killing machine\r<br />\r<br />\r<br />Tap it quickly to activate night eye or Hold it to use your howl. If you use any of your howls (excluding night eye effect) your shout bar will activate and you must wait yo use it again \r<br />\r<br />WEREWOLF CANNIBALISM & RING OF HIRCINE:\r<br /> As a feral lythrope the ring of hircine will grant you serenity bonus witch gives you more control over your transformation and grants you the ability to change at will but it comes at a price will the beast is struggling to get out you health stamina and magicka do not recharge how ever if you feed the beast by eating the flesh of mortals it will restore 50 health & stamina\r<br />\r<br />\r<br />ENCOUNTERING WEREBEASTS IN SKYRIM:\r<br />\r<br />PACK EVENTS:  You will not trigger any pack events until level 20\r<br />\r<br />WEREBEAST EVENTS: \r<br />Werebeasts can appear anywhere in Skyrim, Solstheim & Falskaar outside of settlements and dungeons. When  starting a new character you will not encounter any werebeasts until level 6. No matter what esp you pick all 3 wereraces are active and werebeasts will only show up on hunts or in there vanilla skyrim locations.\r<br />\r<br /> Events are random and all 3 wereraces have both single and pack events \r<br />\r<br />   *Werewolf event chance-\r<br />        * Full moon events chance 50%\r<br />        * New moon events chance 0%\r<br />        * any other time is a 10% chance\r<br />\r<br />  *Weresabre & Werebear event chance-\r<br />        * Full moon events chance 25%\r<br />        * New moon events chance 0%\r<br />        * any other time is a 10% chance\r<br />\r<br />(werewolves are the most common form of lycanthrope in skyrim hence the higher encounter rate)\r<br />\r<br />(WARNING:\r<br />      HIGH LVL PLAYERS: may encounter triple pack events be prepared or you will not survive\r<br />      LOW LVL PLAYERS(6-20): may encounter triple single events be prepared or you will not survive)\r<br />\r<br />\r<br />(Werebeasts will only spawn in Falskaar if you are using any one of the TBMC-Falskaar esps. otherwise you will get werebeasts event messages but they will not spawn)\r<br />\r<br />On the new moon you will get reprieve from being hunted as event chances are 0% so relax enjoy the time because come the first night of the Waxing Crescent moon you may be hunted again and will not get a reprieve again until the next new moon. If they start to hunt you, one or more messages corresponding to the werebeasts race to will appear on your screen and you will start to hear them howling.\r<br />\r<br />FENDING OFF A WEREBEAST ATTACK: Just like traditional lore werebeasts have weakness to silver weapons and can kill them very quickly. However if you are carrying anything other then Silver prepare to have major fight on your hands as regular weapons do little damage to werebeasts if you get pack event and have no silver weapons I&#39;d run fast\r<br />\r<br />=========================================================================================== \r<br />\r<br />SPREADING THE DISEASE:\r<br />\r<br />From now on if you are in werebeast form, you can talk to your current follower (but only him/her and no other NPCs). If he/she is not using a custom race, then you will have the option to bite him/her spreading your disease to the follower.\r<br />\r<br />The bite does massive damage (50 health points) so you better make sure your follower has high enough hp. Your follower will be shocked by the pain and will be knocked out for 1 hour in-game time. You can either guard him/her through this duration or just wait. IMPORTANT: Do not try to give your follower commands while he/she is stunned from the initial bite. If possible don&#39;t interact with him/her at all.\r<br />\r<br />Once your follower stands up again, she/he is taken over by the disease completely and will transform into werewolf form when you do (only if he/she is your active follower). On moon based transforms he/she will use the longer animation (also the customization setting) while on Ring of Hircine / Beast Form triggered transformations the follower will also use the quicker shift. When you turn back to being human your follower will do the same.\r<br />\r<br />Make sure that you DO NOT DO the following things (in theory they would still work, but can create problems):\r<br />- DON&#39;T try to give your follower commands while he/she is stunned from the initial bite. If possible don&#39;t interact with him/her at all.\r<br />- DON&#39;T dismiss / send your follower away in werewolf form. Wait till he/she fully becomes human again. (Waiting is no problem.)\r<br />\r<br />\r<br />Companion followers will be already infected so you won&#39;t need to bite them. If the player would be cured from lycanthropy the werebeast followers will remain cursed and will start to shift according to the moon phases instead of when the player transforms (only if they are set as current follower).\r<br />\r<br />Werewolf hunters\r<br />Every day that you spend as a werebeast (even when you are not transformed) there is a very small chance (2% on default every 1 hour in-game time) that an old seasoned order of warriors that know all about your dark secret will come looking for you. They are always out there... searching... \r<br />\r<br />NEW PET: \r<br />with all the dogs in the game i thought kajits could use a sabre pet to go with there new weresabre form so i give you:\r<br />\r<br />VIGILANCE -THE SABRE CAT:\r<br />vigilance the war dog is now a sabre cat with all the corresponding stats it still cost 500 gold to buy him and keeping with that theame the 2 war dog in Understone keep in Markarth are now sabre cats \r<br />\r<br />============================================================================================\r<br />\r<br /> INSTALL PROCESS:\r<br />1) MUST USE NMM to download TBMCxMain and install\r<br />2) MUSTUSE NMM to download esps (dose not require all 6 esps may pick any one of the 6 if you like)\r<br />3) USE NMM to switch between esp&#39;s if you have an esp active deactivate it and active one of the other ones always deactive first and if asked to update say no\r<br />\r<br />The_Bloomoon_Calls.esm &lt;= Must be first in load order (between Skyrim.esm and Update.esm)\r<br />The_Bloodmoon_Calls.esp &lt;= Should be last in load order, but must be present and loaded\r<br />\r<br />*make sure Bloodmoonrising.esp is loaded after bloodmooncalls.esp\r<br />\r<br />\r<br />IF YOU ARE SWITCHING FROM OTHER WEREWOLF MODS OR UPDATING FROM OLD VERSION OF THIS MOD   MAKE SURE TO COMPLETELY REMOVE OLD MOD OR OLDER VERSION\r<br />\r<br />BE SURE TO CURE YOUR SELF OF LYCANTHROPY BE FOR UNINSTALLING THIS MOD AND MAKING A CLEAN SAVE\r<br />\r<br />THIS MOD IS NOT COMPATIBLE WITH OTHER WEREWOLF MODS            \r<br />\r<br />THIS MOD A LABOR OF LOVE AND IS MEANT TO BE EXPERIENCED AS IS AND WILL NOT BE MADE COMPATIBLE WITH ANY OTHER WEREWOLF MODS\r<br />\r<br />\r<br />(this excludes any bugs or glitches you may encounter plz report them to me asap Thank you)\r<br />\r<br />\r<br />Special thanks & credits\r<br />Brevi- Creator of T-O-L and the source scripts FOR BOTH VERSIONS\r<br />NsJones-creator of Heart of the Beast - Werewolf Sound and Texture Overhaul: http://skyrim.nexusmods.com/mods/13779\r<br />(meshes glowing red eyes, and more aggressive sounds) MESHES & TEXTURS PRESENT IN FULL ONLY &#34;MORE AGGRESSIVE SOUNDS&#34; PRESENT IN BOTH}\r<br />Credit for Weresabre/weredrake/drake/drakess  texture and meshes go Dogtown1 and newermind\r<br />\r<br />Comment and endorse if you like \r<br />============================================================================================",
  "categoryId": "79",
  "version": "HC1.1",
  "author": "TOKINKLOWNZ420",
  "createdUnix": "1365239272",
  "updatedUnix": "1416534295",
  "containsAdultContent": false,
  "uploadedBy": "Blade1634",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000116630",
      "name": "FULLxMain",
      "version": "3.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "86932",
      "fileName": "TBMCxMain-34454-3-1.rar",
      "uploadedUnix": "1404876614",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/b511600e4df8ceddee681ae537a37457a96ecf6abe461b99bd74392c240f9cc6/analysis/1408170194/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TBMCxMain-34454-3-1.rar?fid=1000116630&ttl=1535812335&ri=8192&rs=8192&setec=3b50631c40dd84289d996d4495ec6cf2"
    },
    {
      "fileId": "1000116631",
      "name": "FULLxWB",
      "version": "3.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "77",
      "fileName": "TBMCxWB-34454-3-1.rar",
      "uploadedUnix": "1404876764",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/71debca1bb2fe9c33337f7172696b36a984a09ce40931a498d0b996e864b7737/analysis/1408170194/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TBMCxWB-34454-3-1.rar?fid=1000116631&ttl=1535812336&ri=8192&rs=8192&setec=c2a4795976f339d0c85c3a0f6dc9113f"
    },
    {
      "fileId": "1000116634",
      "name": "FULLxWS",
      "version": "3.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "77",
      "fileName": "TBMCxWS-34454-3-1.rar",
      "uploadedUnix": "1404876848",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/19db92ecf11c195404a0539a792135b41bc239b6215536b5e35b17b75e3257de/analysis/1408170195/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TBMCxWS-34454-3-1.rar?fid=1000116634&ttl=1535812337&ri=8192&rs=8192&setec=4df72a57d2379f46a98b25b41118fc14"
    },
    {
      "fileId": "1000116635",
      "name": "FULLxWW",
      "version": "3.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "77",
      "fileName": "TBMCxWW-34454-3-1.rar",
      "uploadedUnix": "1404876923",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/73a652f3ad22ed4a1c2c98ad3c2b2b4d283ce1730ac96d24eb94d7bac442b8e5/analysis/1408170195/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TBMCxWW-34454-3-1.rar?fid=1000116635&ttl=1535812337&ri=8192&rs=8192&setec=403cad82470a39fc5869d3093c8bfa3e"
    },
    {
      "fileId": "1000116636",
      "name": "FULLxWB-Falskaar",
      "version": "3.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "71",
      "fileName": "TBMCxWB-Falskaar-34454-3-1.rar",
      "uploadedUnix": "1404877058",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/d7bb851ae55d0d525c186506bb4ae281615692bdd8a61ad1acad9169751732e5/analysis/1408170197/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TBMCxWB-Falskaar-34454-3-1.rar?fid=1000116636&ttl=1535812338&ri=8192&rs=8192&setec=2234503db624c72ed4df67ebded3edd2"
    },
    {
      "fileId": "1000116638",
      "name": "FULLxWS-Falskaar",
      "version": "3.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "77",
      "fileName": "TBMCxWS-Falskaar-34454-3-1.rar",
      "uploadedUnix": "1404877106",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/a7b2a59dc1756af6138dc3fc9ca36d62ab50f245b4bc60d45169bbb48d1f88aa/analysis/1408170198/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TBMCxWS-Falskaar-34454-3-1.rar?fid=1000116638&ttl=1535812338&ri=8192&rs=8192&setec=626a782e30ab131698e608465df0a3f8"
    },
    {
      "fileId": "1000116639",
      "name": "FULLxWW-Falskaar",
      "version": "3.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "78",
      "fileName": "TBMCxWW-Falskaar-34454-3-1.rar",
      "uploadedUnix": "1404877146",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/a996a560df0861131aee9e794f15bec455de7dc70aac53f4ce56cc5f8ef999cf/analysis/1408170199/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TBMCxWW-Falskaar-34454-3-1.rar?fid=1000116639&ttl=1535812339&ri=8192&rs=8192&setec=97f20baf9c0fb8a59fea8b87e6761d96"
    },
    {
      "fileId": "1000135815",
      "name": "HIGH COMPATBILATY",
      "version": "HC1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "34939",
      "fileName": "HIGH COMPATBILATY-34454-1-0.rar",
      "uploadedUnix": "1416253507",
      "modVersion": "HC1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7e848c78328f057da97c83dd5ccaba642f39d990f5a906be738319b397d8f49e/analysis/1416253631/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HIGH%20COMPATBILATY-34454-1-0.rar?fid=1000135815&ttl=1535812339&ri=8192&rs=8192&setec=3787a1785ce9c552cad4daeb4fdb38c2"
    },
    {
      "fileId": "1000136200",
      "name": "HIGH COMPATBILATY",
      "version": "HC1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34940",
      "fileName": "HIGH COMPATBILATY-34454-HC1-1.rar",
      "uploadedUnix": "1416534295",
      "modVersion": "HC1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6349993bc5a6e35731a7ec24d3114a5e2ddf7afd02cedb806074f94f28d6b1ee/analysis/1416534384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HIGH%20COMPATBILATY-34454-HC1-1.rar?fid=1000136200&ttl=1535812340&ri=8192&rs=8192&setec=c6c716ed49d4307e0b403f22f8285718"
    }
  ]
}