{
  "modId": 34468.0,
  "modName": "Castle Crashers",
  "summary": "UPDATED 0.71! This will be the most epic home ever seen. and YOU will get it in the most epic way! BY killing waves of enemies till you get to the final boss and then win you\\'er self a castle. mod in its starts as of right now it is just a player home/ new town.",
  "descriptionHtml": "Beta 0.7\r\nUpdate news got much more done with the castle though still behind on what I wanted done by today. I have put my personal file putting everything I have planed for the mod which I am always adding more to the txt doc and I will now add an updated one every time I put a new file up. I do have more done then what you see I just want the castle and its grounds done first so I don\\'t get ahead of myself and mess up a mod which I have worked hard on to make it the best I can for you girls/guys. \r\n\r\nNotes on what is done: The blacksmith is now a blacksmith so you can buy and sell stuff from him and he has a home he can go to and sleep aka The 8th Hammer. the bard inside will now take requests and also I have navmeshed the mead hall.\r\n\r\nNotes on whats not done: the dungeon isn\\'t all the way nav meshed I want some ideas on what I should fill it with before I complete its nav meshing. The grounds still have the random wall which I will get to when I\\'m done inside.\r\n\r\nThis will be the most epic home ever seen. and YOU will get it in the most epic way! BY killing waves of enemies till you get to the final boss and then win you\\'er self a castle.. mod in its starts as of right now it is just a player home.\r\n\r\nIf you would please read through the STORY section of my castle crashers readme and tell me what you think of it I like it and have already started doing stuff for it which it will be a short story because I know people watching this really just want a good murder time, but none the less I want to make it blend with skyrim not just a place you walk up to and suddenly get attacked by large angry men for no purpose.\r\n \r\nBeta 0.6\r\nBut like I said its just a player home right now i still have lots i want to do with the castle I am just uploading the files right now so i can get feedback, because I love nothing more then some good or bad feedback it makes building this castle and scripting all the more fun.\r\n\r\nUPCOMING: I will be completing the castle finally. then I will be starting on the long and hard scripting to make the waves for fighting so to get that out of the way\r\n\r\nWILL BE DOING (sometime) completing the castle grounds right now im more worried about the inside though I will make the blacksmith able to trade. also in a huge maybe project once the castle crasher scripting is done i might make it so you can build the town and hire people to work in the castle\r\n\r\nTHANK YOU TO ALL WHO GIVE FEEDBACK IT MEANS A LOT TO ME KNOWING ALL MY TIME DOING THIS ISN\\'T WASTED.",
  "categoryId": "67",
  "version": "0.71",
  "author": "Draco Stormfire",
  "createdUnix": "1365262843",
  "updatedUnix": "1366181472",
  "containsAdultContent": false,
  "uploadedBy": "DracoStormfire",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024909",
      "name": "Castle Crashers",
      "version": "0.71",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2572",
      "fileName": "Castle Crashers-34468-0-71.rar",
      "uploadedUnix": "1366181472",
      "modVersion": "0.71",
      "virusScanUrl": "https://www.virustotal.com/file/01ea3b85ff777bf1376d01346a76094503aaec3e95ba981114bc84465f43d474/analysis/1407526336/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Crashers-34468-0-71.rar?fid=1000024909&ttl=1535812355&ri=8192&rs=8192&setec=1d45596a1fddd8fd2aed99de5546421a"
    }
  ]
}