{
  "modId": 34488.0,
  "modName": "Instant Merchant",
  "summary": "Use the \\\\\\\"Ring of Sales\\\\\\\" to instantly summon traveling merchant Goonie! She always carries 20,000 gold and will even buy your *cough* stolen goods!",
  "descriptionHtml": "Use the \\\\\\\"Ring of Sales\\\\\\\" to instantly summon traveling merchant Goonie! She always carries 20,000 gold and will even buy your *cough* stolen goods! \r\n\r\nEasier to use than similar mods! Equip the \\\\\\\"Ring of Sales\\\\\\\" and Goonie will appear instantly. This special ring will not unequip your current favorite ring, and unequips automatically after use! \r\n\r\nThe basic aim here was to add a merchant who actually has enough coin to buy your goods so you don\\\\\\'t end up lugging them all over Tamriel. Since Goonie comes to you, you never have to abandon a dungeon to unload heavy goods or resupply! \r\n\r\nTo obtain the \\\\\\\"Ring of Sales,\\\\\\\" locate Goonie outside the Drunken Huntsman in Whiterun. She is the only merchant who can sell you the ring. However, for convenience, a copy of the ring can be attained from the work table near the front door of Warmaiden\\\\\\'s in Whiterun, across from the Drunken Huntsman. \r\n\r\nQuick features list: \r\n* Unique NPC, Goonie, with custom voice acting for all dialogue (thanks Dark Rogue) \r\n* Easy summon, anywhere, with the Ring of Sales \r\n* Will buy any item, even stolen goods \r\n* Has 20,000 gold for bartering \r\n* Carries a wide range of useful items \r\n* Goonie has the ability to \\\\\\'store\\\\\\' an endless amount of items, free of charge \r\n\r\nNote: If Goonie will not talk to you upon first meeting her in Whiterun, simply save your game and then load that save. It is a known bug with custom merchant NPCs in Skyrim. Fortunately, the solution is fairly simple :) \r\n\r\nIs there anything you think this mod needs? Is something broken? Please leave a comment!",
  "categoryId": "33",
  "version": "2.1",
  "author": "vapid",
  "createdUnix": "1365279630",
  "updatedUnix": "1365279630",
  "containsAdultContent": false,
  "uploadedBy": "vapid",
  "primaryFile": null,
  "files": []
}