{
  "modId": 34527.0,
  "modName": "Talos Island - Reborn",
  "summary": "REBORN!, This mod adds a huge estate to skyrim based upon the mod Lakeview cottage and Talos Island",
  "descriptionHtml": "Talos Island Reborn.\r\n\r\nA mysterious island has appeared off the coast to Falkreath; its purpose for being there is unknown\r\nbut what is known is that this island somehow calls to the Dovakiin and revealed itself through the mist\r\nthat was once there.\r\n\r\n[youtube]CaiBfSCe9PQ[/youtube]\r\n\r\n====Description====\r\n\r\nThis mod is my biggest project yet in terms of land mass used. \r\nIt has taken 1 week to get this mod to a stage of amazing quality and is now ready to be released to the public.\r\n\r\nI set my goals high for this mod in terms of detail for the sole purpose of achieving the perfect lore \r\nfriendly home that people have been asking for. It has also been a struggle not only for land mass \r\nbut for optimization too, with lighting and fog emitters causing most of the issues. But i have succeeded\r\nin the project and now i want every one of you to experience this and share your thoughts.\r\n\r\n\r\n\r\n===Features===\r\n\r\n-First class terrain deformation known by me for such projects as Mountain Crest.\r\n-Structured envriomentals that has been hand placed within the game world to seem like it was in the vanilla game\r\nto begin with.\r\n-Lighting and fog has been hand crafted by me for optimization and colour for such a big project.\r\n-Insects galor!, from nocturnal to butterflies, to even ants!. \r\n-Your own personal shack for crafting and storage.\r\n-Your very own farm!\r\n-Signs to guide you around the manor due to size\r\n-Offcoast island for a lovely view.\r\n-Hand placed plants and flora for alchemists alike.\r\n-Hand crafted rivers and lakes and sounds used from Whiterun rivers have been added that sound so calming.\r\n-Chopping block\r\n-Archery and dummy training areas for your skills to be had.\r\n-Hand placed books to give information about the house and island\r\n-A mysterious letter from the imperials giving you details to the location of the key to the outside areas\r\n-Hand picked trees for immersion and realism.\r\n\r\n\r\n=== Recommended mods and warnings====\r\n\r\nThis mod will conflict with Talos islands; my first mod. So please be sure to remove that before installing this.\r\n\r\ni recommend:\r\n\r\n-Climates of tamriel optimized and built with AMD software and hardware.\r\n-Built for Real waters, No comments on W.A.T.E.R but should work fine\r\n-This mod was not intended for collectors, this mod is purely cosmetic and used for general storage.\r\ni may add a treasure room if i get enough complaints per say.\r\n-I do not recommend any flora or grass overhaul mods as the land and sea i have created are made under vanilla lands \r\nmay conflict if added with these kinds of mods. Thank you.\r\n-Mod also built for Enhanced lights and FX.\r\n\r\nTHIS MOD IS DEMANDING AND WILL TAX YOUR SYSTEM EVEN AFTER MY OPTIMIZATIONS AND PATCHES TO BE RELEASED.\r\n\r\nPLEASE GIVE ALL FEEDBACK!!!",
  "categoryId": "67",
  "version": "V1.0",
  "author": "Countercruel",
  "createdUnix": "1365349571",
  "updatedUnix": "1365348947",
  "containsAdultContent": false,
  "uploadedBy": "countercruel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000023093",
      "name": "Talos Island - Reborn",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "147",
      "fileName": "Talos Island - Reborn-34527-V1-0.rar",
      "uploadedUnix": "1365348947",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/96a095f765a1f0a042d5f9721a5547dc13f8a5475e23f51ab14346fa10aeaef0/analysis/1407511385/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Talos%20Island%20-%20Reborn-34527-V1-0.rar?fid=1000023093&ttl=1535812442&ri=8192&rs=8192&setec=c9a884243943b6388212cb3164700743"
    }
  ]
}