{
  "modId": 34520.0,
  "modName": "Whiterun and Windhelm Patrol Quarters",
  "summary": "A mod that adds a small quarters for Whiterun Guards in the two empty rooms near the drawbridge at Whiterun, and fixes up the quarters beneath the Windhelm Bridge for the Stormcloaks. Includes a fix for falling baskets in the inns found at Morthal and Rorikstead. The quarters can be used as a secondary player home as well.",
  "descriptionHtml": "[b]-== DESCRIPTION ==-[/b]\r<br />\r<br />Have you ever been to the room beneath the bridge to Windhelm? If so you&#39;ve probably seen how empty this place was. What this mod does is add clutter and some amenities to liven the place up a little. It also fixes a few oversights left in the game by Bethesda making the chairs usable and clutter items that apparently had fallen out of the bridge somewhere along the line back to where they belong.\r<br />\r<br />[b]&gt;&gt; Windhelm Fixes[/b]\r<br />\r<br />* Replaced all the faulty chairs with working ones. Now you can sit in a chair without glitching through the table when you get up or out of it.\r<br />* Placed the baskets and tankards back in the room. Upon opening the CK I found three tankards suspended in air, and two baskets stuck in the bridge. When you approach Windhelm if you go below the bridge you would find a couple tankards and baskets floating around in the water. These are now placed back where they belong.\r<br />* Placed a handcart back on the bridge. A handcart had fallen through the bridge, floating in the water under the ground. This has been placed along the path in front of the Windhelm Stables and a few cabbages tossed in.\r<br />* Raised the shelf sitting against the west wall. Originally it was shoved partway into the floor.\r<br />\r<br />[b]&gt;&gt; Windhelm Additions:[/b]\r<br />\r<br />* Added clutter to the tables. Tankards, food, plates, utensils. Food and clutter also added to the shelves actually giving the place a &#34;lived-in&#34; feel.\r<br />* Two cots added, both usable by the player.\r<br />* Four standing working weapon racks for displaying weaponry.\r<br />* Two chests, both non-respawning. One is located near a cot with a set of Stormcloak armor inside and another by the eastern shelf. A few other non-respawning sacks added to the area. Cabinets do not respawn by default but the barrels in the area will.\r<br />* Crafting stations: Anvil, Cooking Pot, and Grindstone.\r<br />\r<br />In Whiterun there were two unused rooms that sat to either side of the drawbridge, these now have items added to them.\r<br />\r<br />[b]&gt;&gt; Whiterun Additions:[/b]\r<br />\r<br />[b]-=Northern Room=-[/b]\r<br />\r<br />* A long table with one bench added, clutter placed on the table including some food.\r<br />* One cot, usable by the player.\r<br />* Two standing working weapon racks for displaying weapons.\r<br />* Crafting stations: Alchemy Lab and Cooking Pot.\r<br />* One non-respawning chest by the cot for storage. An additional non-respawning sack sits on a crate near the cooking pot.\r<br />\r<br />[b]-=Southern Room=-[/b]\r<br />\r<br />* One cabinet, a few clutter items and food displayed. Cabinet does in non-respawning.\r<br />* A chair.\r<br />* Stack of hay.\r<br />\r<br />While I made these as possible secondary player homes they are not specifically designed to be as such thus why I didn&#39;t cram in every crafting station. The Whiterun location has nearly everything needed, just beyond the gates is the Warmaiden which can easily supply a tanning rack, forge, workbench, and smelter. The player only needs to make the extra trip to Dragonsreach for enchanting. However the main purpose of this mod was to fix up the empty room in Windhelm and make it actually usable. In short, these changes were primarily done for immersion. Now the guards in Whiterun have a small area to retire to between patrols, and the Stormcloaks don&#39;t have to run all the way to the Palace of Kings just to take a break.\r<br />\r<br />Unfortunately however, they still won&#39;t use these added facilities... But that doesn&#39;t mean the Dragonborn can&#39;t&#33; Roleplay yourself as a member of the Stormcloaks and retire to get a bite to eat or a quick rest, take up the role of a guard for Whiterun and use the spare quarters area as a base of operations between defending the hold. Or just use them as you please.\r<br />\r<br />[b]-== ADDITIONAL CHANGES ==-[/b]\r<br />\r<br />* Frostfruit Inn and Moorside Inn had floating baskets that fell whenever the player entered. Shelves have been set in place with the baskets sitting on them. No more entering a room to find baskets strewn about the floor. Rest of these areas remain unchanged except for a few clutter items added to the shelves along with the baskets.\r<br />\r<br />[b]-== COMPATIBILITIES AND WARNINGS ==-[/b]\r<br />\r<br />&gt; Frostfall: The cooking spit I&#39;ve noticed acts as a source of heat and the cot nearby in Windhelm&#39;s quarters should be close enough to keep the player warm if they use it. The one in Whiterun is close to the cot as well but the distance may not be close enough to warm up the player sufficiently through a cold night.\r<br />\r<br />&gt; Battle for Whiterun/Windhelm: I have taken extra care not to disturb or mess with any markers in the area. That is to say however that I cannot guarantee if NPCs who are set to spawn in these areas may not use or take advantage of items stored on the weapon racks or chests. So I strongly recommend removing any weapons/armor from these area first before beginning the Civil War battles to overtake/defend one of these areas.\r<br />\r<br />No items have been deleted, some vanilla objects [i](Such as barrels, clutter.)[/i] have been moved where others that were faulty like the chairs in Windhelm were simply disabled and left in their original location. As long as no other mods [i](Or Bethesda.)[/i] delete these items everything will work fine.\r<br />\r<br />&gt; Expanded Towns and Cities: There may be a minor conflict with ETaC. In it the mod changes the Frostfruit and Moorside Inns, so there might be a chance of clipping issues with the changes I&#39;ve made.\r<br />\r<br />&gt; Load Order: Load order may not matter, but if you use any other mods that change these locations you should load this mod after them. Mods that add items to these locations in the same area may have clipping issues if they place an object at the very same spot.\r<br />\r<br />[b]-== INSTALLATION ==-[/b]\r<br />\r<br />Click the Download with Manager button and activate, the mod already has the correct file structure so it will install fine. Alternatively you can just open the RAR file and drop the Data folder into your Skyrim folder.\r<br />\r<br />[b]-== UNINSTALLATION ==-[/b]\r<br />\r<br />Uncheck the mod from Nexus Mod Manager or simply delete the &#34;Windhelm Bridge Fix.esp&#34; file from your Data folder. A clean save isn&#39;t required since there are no scripts. The weapon racks use scripts but only the same scripts used by the vanilla game for activating weapon display racks. You may do a cell buffer purge [i](PCB command.)[/i] if you feel the need but it shouldn&#39;t be needed. [u]Be sure to remove any items from containers and the weapon racks prior to uninstalling or these will be lost&#33;[/u] It is recommended you move to an interior area and are not in the following cells during uninstallation:\r<br />\r<br />WindhelmBridge01\r<br />WindhelmBridge02\r<br />WindhelmBridge03\r<br />WindhelmBridge04\r<br />WhiterunExterior04\r<br />MorthalMoorsideInn\r<br />RoriksteadFrostfruitInn\r<br />\r<br />[i]* SMIM (Static Mesh Improvement Mod) was used for the items in the screenshots so they will look different to you in-game if you aren&#39;t using that mod. SMIM however is NOT required to use this mod. Some clutter items though may settle differently on a game that does not use SMIM.[/i]\r<br />\r<br />[b]-== TO-DO LIST ==-[/b]\r<br />\r<br />* Figure out how to light up the hallways under the Windhelm bridge. Tried but they only go on from certain angles. Currently removed from the mod until I can figure it out.\r<br />* Check out Solitude, see if it may be possible to make a &#34;patrol quarter&#34; for them as well.",
  "categoryId": "28",
  "version": "1.2",
  "author": "SamusKnight2K",
  "createdUnix": "1365339114",
  "updatedUnix": "1365598378",
  "containsAdultContent": false,
  "uploadedBy": "SamusKnight2K",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000023065",
      "name": "Windhelm Bridge Fix",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Windhelm Bridge Fix-34520-1-0.rar",
      "uploadedUnix": "1365338037",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4d6389b119d2bc9ec97b67e3d67a473dcd8787201571f421daa1788b8760724f/analysis/1407511089/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Windhelm%20Bridge%20Fix-34520-1-0.rar?fid=1000023065&ttl=1535812434&ri=8192&rs=8192&setec=30d5c57d1a0afa937fcf7a2edc4708cc"
    },
    {
      "fileId": "1000023589",
      "name": "Whiterun and Windhelm Patrol Quarters",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Whiterun and Windhelm Patrol Quarters-34520-1-2.rar",
      "uploadedUnix": "1365598378",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6afc39f439538d7aa8f214ab1c8a62df8acf071d115d258d563e04fa663ff4a5/analysis/1407515464/",
      "changelogHtml": " Redecorated the Windhelm Quarters. Added weapon racks, storage, cots, anvil, cooking pot, and a grindstone. <br/> \n Added a quarters area to the two empty rooms in Whiterun. Weapon racks, storage, cot, cooking pot, alchemy lab. <br/> \n Fixed some floating baskets in Frostfruit Inn at Rorikstead. <br/> \n Renamed mod to \"Whiterun and Windhelm Patrol Quarters\". Mod still retains name of \"Windhelm Bridge Fix.esp\" since that was its primary function. May change later but kept same for now to prevent inconsistencies with plugin names. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whiterun%20and%20Windhelm%20Patrol%20Quarters-34520-1-2.rar?fid=1000023589&ttl=1535812434&ri=8192&rs=8192&setec=0f059f80b5fec63e3731419976253317"
    }
  ]
}