{
  "modId": 34547.0,
  "modName": "Cash4Pelts-Alpha",
  "summary": "A small mod that increases Pelt Values to make ranger type characters more attractive.",
  "descriptionHtml": "I have been playing ranger type characters recently and have my needs mods installed realistic inn prices installed, camping, etc. The only thing really missing was a hunting mod. While tThere are a few out there they a.) havent been updated in over a year b.) Do not include DLC animals.\r\n\r\nThis is my first mod, ever so be gentle.\r\n\r\nIt is very simple changes the value of hides and a few other drops so that you can go wild with your inner hunter. \r\n\r\nThe following numbers are the base values. With 0 Speech you can expect a merchant to pay 30% of value.\r\n\r\nWeights have been upped a bit so you have to return to town more. (or get a bag addon)\r\n\r\nNew Items:\r\n-Each is classified as a hide and can be sold wherever hide can\r\n-As of right now neither can be turned to leather.\r\nMammoth Hide:500\r\nRabbit Furs: 150\r\n\r\nNon Hide:\r\nHorker tusks: 150\r\nMammoth tusks: 300\r\nDragon Bone: 1000\r\nDragon Scale: 400\r\n\r\nHides\r\nGoat: 100\r\nHorse: 125\r\nCow: 150\r\nDeer: 100\r\nFox: 100\r\nSnow Fox: 117\r\nWolf: 150\r\nIce Wolf: 200\r\nBear: 250\r\nSnow Bear: 300\r\nCave Bear: 275\r\nSabre Cat: 275\r\nSnow Sabre Cat: 300\r\nVale Deer: 150\r\nVale Sabre: 350\r\nWerewolf: 500\r\n\r\nFuture Plans:\r\nLong Term Goals:\r\nI am considering this my alpha release. I am using needs mods, and frostfall, and ranger of the north along side this mod (So they go into consideration when i balance my mod). My main goal is a light(Read minmum scripting and high compatibility) hunting mod to make hunting profitable and support current dlc and Future DLC. I also want to eventually have a version that is compatible with the mod Real Wildlife.\r\n-Compatibility with Real Wildlife\r\n-Random work orders (similar to bounties by the Jarl) for meat vendors/inn keepers.\r\n-Craftable rugs and Trophies\r\n\r\nShort Term Goals:\r\n-Find the right balance for values.\r\n-New Hides can be used for leather\r\n-Realistic Drop rates for parts, 4 legs for rabbits a few peices of venicine etc.\r\n-Increase the Value of some none Hide items.\r\n-Implement a Quality System. To simulate how sometimes you mangle the hide when you kill the beast. Mangled Hides create less leather and are worth 10% less. Sturdy hides are standard. Prestine hides create 2 more leathers and are worth 20% more. Trophy hides are worth 50% more and can be used to craft rugs for the home and trophies.\r\n",
  "categoryId": "79",
  "version": "Alpha",
  "author": "FishMcCray",
  "createdUnix": "1365377226",
  "updatedUnix": "1365378208",
  "containsAdultContent": false,
  "uploadedBy": "FishMcCray",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000023186",
      "name": "Cash4PeltsV0_1Alpha",
      "version": "Alpha",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Cash4PeltsV0_1Alpha-34547-Alpha.rar",
      "uploadedUnix": "1365378208",
      "modVersion": "Alpha",
      "virusScanUrl": "https://www.virustotal.com/file/be2478aebc9ca2b8eab2987a57e951e30cd3c9e90c54396f66c7bd08cac82f4f/analysis/1407511941/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cash4PeltsV0_1Alpha-34547-Alpha.rar?fid=1000023186&ttl=1535812478&ri=8192&rs=8192&setec=1b7128ccb8968b4787fd4ba608a1bab8"
    }
  ]
}