{
  "modId": 34562.0,
  "modName": "Blood From A Stone - Mini Blood Potions Overhaul",
  "summary": "Allows you to craft various Blood potions and elixirs from the hearts of your foes! Requires Heart Breaker 1.1 or later.",
  "descriptionHtml": "[b]NOTICE: I am no longer supporting this file. It may contain bugs, USE AT YOUR OWN RISK. Anyone here on the Nexus has my full permission to modify/fix and reupload this mod (as long as you make changes to the original mod).[/b]\r\n[center]\r\n[img]http://static.skyrim.nexusmods.com/mods/images/34562-1-1365411484.png[/img]\r\n\r\n[b]REQUIRES DAWNGUARD, DRAGONBORN, & [url=http://skyrim.nexusmods.com/mods/32598/]HEART BREAKER[/url] 1.1 OR LATER.\r\nDO NOT USE WITH MY \\\"CRAFTABLE BLOOD POTIONS\\\" MOD, THIS MOD DOES EVERYTHING THAT ONE DOES, AND MORE.[/b]\r\n\r\n[i]You may not be able to squeeze blood from a stone, but why shouldn\\'t you be able to squeeze it from your enemies\\' hearts?[/i]\r\n[/center]\r\nThis mod does two things:\r\n1) Allows you to craft the Potions of Blood added by Dawnguard from 2 of any race\\'s heart (Human, Orc, Argonian, Khajiit, Elf). They can be crafted at any cooking pot.\r\n2) Adds 3 powerful new blood potions that can be crafted from the different races\\' hearts. They can only be crafted at the Blood Font (Shrine to Molag Bal in Castle Volkihar).\r\n--[b]Blood Elixir[/b] - Heals vampires for 100 health, magicka, and stamina. Also counts as feeding off human blood. Crafted from one heart from each of the 10 playable vanilla races.\r\n--[b]Blood Elixir (Purified)[/b] - Heals non-vampires for 50 health, magicka, and stamina. Also cures all diseases. If a vampire drinks it, they become paralyzed for 10 seconds. Crafted from 1 Blood Elixir and 1 Briar Heart.\r\n--[b]Blood Elixir (Tainted)[/b] - Causes the victim\\'s blood to boil, doing 100 damage to health, magicka, and stamina. Crafted from 1 Blood Elixir and 1 Daedra Heart.\r\n[center]\r\nThese potions may seem a bit overpowered, but they DO require at least 10 hearts, most of which can only be acquired by ripping them from the chest of a near-death enemy. The Blood Font is not available during the final boss fight of Dawnguard, and it\\'s only available to Dawnguard players after the questline is complete, whereas the Vampires can access it immediately after being \\\"turned\\\" by Lord Harkon.\r\n\r\nIf you just want a simple blood potion crafting mod for the normal Potions of Blood added in Dawnguard, check out my [url=http://skyrim.nexusmods.com/mods/34513/]Craftable Blood Potions mod[/url] (includes both a normal, Human Heart-only version, and Heart Breaker compatibility patch). Do NOT use the two together.[/center]",
  "categoryId": "94",
  "version": "1.0.0",
  "author": "VladiMatt",
  "createdUnix": "1365412724",
  "updatedUnix": "1365411459",
  "containsAdultContent": false,
  "uploadedBy": "VladiMatt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000023234",
      "name": "Blood From A Stone",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "Blood From A Stone-34562-1-0-0.rar",
      "uploadedUnix": "1365411459",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/51e9b8eb0ef7a79c6d02afaff79508062adf29273d396f530c949748e68233a6/analysis/1407512471/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20From%20A%20Stone-34562-1-0-0.rar?fid=1000023234&ttl=1535812499&ri=8192&rs=8192&setec=bdf1e9fdd977e3e761c7a77b88cc00cd"
    }
  ]
}