{
  "modId": 34617.0,
  "modName": "Zelda Hyrule Castle Player House Followers Items",
  "summary": "This Mod adds Hyrule Castle as a player house and also adds several followers.",
  "descriptionHtml": "Zelda Hyrule Castle Player House/Followers/Items\r\nHyrule, Item Names, and characternames are Nintendo Trademarks, assets used are from Skyrim and belong to Bethesda Softworks and Zenimax Media.\r\n\r\n\r\n\tThis is my 5th mod that I have worked on and I spend over 150 hours on it so I hope you enjoy. Big Thanks to my friend Brent who helped me with many diffrent things.\r\nRequirements \r\nNone\r\nThis mod adds Hyrule Castle as a player house and much more to the world of skyrim! To get to Hyrule Castle you must find the Hyrule Ruins just right of HonningBrew meddery.\r\n                                                                       Hyrule Castle Rooms\r\nMaster Bed room\r\nChilds Bed room\r\nThrone room\r\nHyrule Dining Room\r\nGuard Barracks\r\nCrafting room\r\nThis mod also adds 4 Hyrule guards that can be found in the Guard barracks left door in the dining room. In the Throne room there is a Iron Knuckle Follower that is very strong. This mod also adds talon the milk man who sells many Zelda items that I made. He starts selling things at 8:00 A.M. Some of the items will be for later quests that I will make in updates.\r\nItems Talon sells\r\nBlue Potion \r\nGreen Potion\r\nLon Lon milk\r\nRed Potion \r\nRocs’s Feather\r\nSilver Scale \r\nSkull Necklace\r\nStrange Flute\r\nThunder Drum \r\nWeird Egg\r\nSilver Gauntlets \r\nThings I Plan To Add\r\nI Plan to make a option to move your family to Hyrule Castle if you want to. I aslo plan on making  several quests that have to do with items I made.\r\nA mod i recommend is UFO - Ultimate Follower Overhaul. it allows you to have up to like 16 followers\r\nyou can get this mod on the skyrim nexus http://skyrim.nexusmods.com/mods/14037 \r\n\r\nIf you want to add to my mod ask me first and make my mod a requirement for the mod. You must give me credit for the mod. Just shoot me a message. \r\n\r\nLet me know if there is any bugs.\r\nEnjoy.\r\n\r\nManual Install \r\nPut hyrule castle.esp in C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\Skyrim\\\\Data\r\nPut FaceGenData in  C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\Skyrim\\\\Data\\\\meshes\\\\actors\\\\character\r\nPut FaceGenData2 in C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\Skyrim\\\\Data\\\\textures\\\\Actors\\\\Character\r\n...........................................................................................................................................\r\nUPDATE 1.0\r\nBug fix\r\nLighting fix\r\nStorage Crates\r\nI added a Zelda follower who casts magic and has her own sword. She also lives in hyrule castle and can be married. But the only way to marry her is to choose to go and live at her house(Note If you ask her to come live with you she will disappear due to the packaging). If you have children you cant marry her at the moment I am working on fixing that. She can be found walking around the castle. If you cant find a way to get rid of your current wife there is a mod that can help with that. I would recommend  Bonds of Matrimony – Divorce http://steamcommunity.com/sharedfiles/filedetails/?id=11387\r\nJust make sure after you divorce your current wife that you go back and talk to the guy who gives you the amulet to get married. Then after that you can marry Zelda if you choose but you can still live in the castle with her and not marry her to. If you have hearth fire and kids and a wife i would recommend not marring zelda and just living in the castle with her till i update the mod some more.\r\nPLEASE LET ME KNOW IF THE GREY FACE BUG IS ON ZELDA’S FACE SO I  CAN FIX IT.\r\nEnjoy.\r\n\r\nCurrent Bug \r\nDark Face on zelda. When downloaded with NMM there is a grey face bug on zelda. the best way to fix this is to open creation kit load skyrim.esp and update.esp and hyrule castle1.0.esp and search for zedla  in actor click the follower and hit crtl alt4 this will set the carictor gen up so the bug will go away. dose not take long to do. in the mean time i will try to fix this.",
  "categoryId": "67",
  "version": "",
  "author": "Bman131",
  "createdUnix": "1365658811",
  "updatedUnix": "1365658485",
  "containsAdultContent": false,
  "uploadedBy": "sleg131",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000023739",
      "name": "Zelda Hyrule Castle Player House Followers",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "497",
      "fileName": "Zelda Hyrule Castle Player House Followers-34617-1-0.rar",
      "uploadedUnix": "1365658485",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/471b645f1c0de5b4e14ee44a36b3e05a095f14be9a4c484a3b98ceb59f39f12c/analysis/1407516664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Zelda%20Hyrule%20Castle%20Player%20House%20Followers-34617-1-0.rar?fid=1000023739&ttl=1535812596&ri=8192&rs=8192&setec=b5a3452824334ac8be87f74904ac4e6b"
    }
  ]
}