{
  "modId": 34637.0,
  "modName": "EBD - EveryBodys Different",
  "summary": "Skyproc patcher for diversifying NPCs. Changes NPC body and face textures like Automatic Variants but for NPCs. Basic support for meshes as well. Distributes hair styles and eye colours (even from mods) among NPCs. Changes NPC height by race with optional gender bias. Option to force all females which use male animations to use female ones instead.",
  "descriptionHtml": "[size=8][center]\r<br />EBD Redone has been released. [url=http://www.nexusmods.com/skyrim/mods/51612/]Get the new version here[/url]\r<br />[/size][/center]\r<br />[size=5][center]\r<br />EBD - EveryBody&#39;s Different\r<br />by\r<br />MongoMonk\r<br />[/size]\r<br />\r<br />Version: 2.30\r<br />Released: 10.04.2013\r<br />Last Update: 14.12.2013\r<br />Site: http://www.nexusmods.com/skyrim/mods/34637/\r<br />[/center]\r<br />\r<br />[center][size=5][u][color=yellow]Summary[/size][/u][/color][/center]\r<br />This mod is a skyproc patcher meant for diversifying NPCs throughout Skyrim. Skyproc patcher means that it is a java program which is run once after you&#39;ve downloaded the patcher. You can change your settings in a convenient user interface. Each time you add/remove NPC adding/changing mods you should rerun the patcher. The patcher will work with any load order and works with mod added and vanilla NPCs.\r<br />EBD offers several options to make NPCs more interesting. Most of them require no work from the user (you&#33;) at all and all are optional (i.e. may be turned off/on at anytime). The main features are:\r<br />\r<br />Option to set [b]height ranges for the vanilla races[/b]. Every NPC will have a height in the range you define for that race. EBD comes with a predefined set of values, but you may change them to your liking. This feature is completely script free as all changes are done in the plugin (the .esp).\r<br />\r<br />Option to [b]distribute hair styles and eye colours among NPCs[/b]. This includes hair styles/eye colours added by mods. You can finally let all the NPCs in Skyrim benefit from ApachiiSkyHair and the like. The distribution works on a random basis but hair styles and eyes are only applied to the proper gender and race. This feature uses a script which itself is quite lightweight. However, especially the hair meshes might cause a slight stutter when loaded. There are several options to reduce that stutter.\r<br />\r<br />Option to [b]distribute textures and meshes among NPCs[/b]. This feature requires you to set up the meshes and textures as described below. It allows to see all those great texture (and mesh) mods in your game simultaneously. It also means that your player character textures will be unique (without the need of any custom races). This feature is mostly script free. However, it needs a very lightweight script to apply the face tints. The script and performance impact is barely noticeable though you should use texture resolutions not too demanding for your VRAM.\r<br />\r<br />Option to [b]have all females use female animations[/b]. You may have noticed that soldiers, bandits, orcs and housecarls use male animations even when they are female. This feature will have all females use female animations. Best used on a new game as animations can&#39;t be changed for NPCs you&#39;ve already encountered. Completely script free.\r<br />\r<br />There are [b]more features[/b] you can discover below or when running the patcher.\r<br />Please note that the script is entirely optional. Also it is not running permanently, it only runs once per NPC you encounter. It executes pretty fast and EBD should be safe to uninstall at any time even with the script enabled.\r<br />\r<br />\r<br />[center][size=5][u][color=yellow]Requirements[/size][/u][/color][/center]\r<br />Java runtime environment (http://www.java.com/en/download/)\r<br />Knowledge about skyproc patchers\r<br />No DLC required\r<br />No SkyUI required\r<br />SKSE version 1.06.16 or higher is required IF you want to use body textures WITH matching face textures or/and if you want to change hair styles/eye colours. I wrote a script which fixes face textures not applying. It&#39;s not possible to fix this without the script. Same goes for headparts like hair/eyes. The script, in turn, requires SKSE. Get it here: http://skse.silverlock.org/\r<br />\r<br />\r<br />[center][size=5][u][color=yellow]Compatibility[/size][/u][/color][/center]\r<br />This mod should work with ANY setup and any other mod. It works with any mod which adds NPCs and adds those NPCs to the random mix automatically (that&#39;s the concept of a skyproc patcher).\r<br />To answer the most asked question on the Nexus: Yes, it is compatible with SkyRe.\r<br />It is also compatible with any body mod. Use CBBE, UNP, Adec, ... whatever comes to mind. All the textures you add to the patcher have to be for the the SAME BODY TYPE (the body you&#39;re using) or strangeness will occur.\r<br />\r<br />EBD is compatible with SUM. \r<br />\r<br />If you want some NPCs from mods to be excluded, then add the mod&#39;s .esp file to &#34;SkyProc PatchersEBDFilesBlocklist.txt&#34;. As of version 1.2 no mods are in there by default. There are no known incompatibilities&#33;\r<br />\r<br />\r<br />[center][size=5][u][color=yellow]Overview[/size][/u][/color][/center]\r<br />This skyproc patcher changes several attributes of all NPCs in the game:\r<br />\r<br />- NPC body and face textures (humanoid races, males and females); requires SKSE for the face textures. Yes, this is like Automatic Variants, but for NPCs. Works for any body type (UNP, CBBE, ...) as long as your provide the appropriate textures.\r<br />- NPC body meshes (humanoid races, males and females); script free. This feature works only in combination with the above texture feature. Furthermore it only replaces the meshes of the naked body, no armor/clothes meshes.\r<br />- NPC height (all races, males and females); script free\r<br />- NPC hair styles(all races, males and females, includes mod added hair); requires SKSE\r<br />- NPC eye colours(all races, males and females, includes mod added eye colours); requires SKSE\r<br />- NPC animations (set the &#34;use opposite gender animation&#34; flag to false for all females, enable Orc &#34;ladies&#34; to use female animations)\r<br />- Bonus feature: add all face textures the patcher finds to the complexion slider for your player character to choose\r<br />- NPC weight (removed as of version 2.00 because it was not working as intended. Might come back)\r<br />- NPC skin color (removed as of version 2.00 because it&#39;s not working. Might come back)\r<br />\r<br />Every feature is optional and can be turned on or off at your leisure. The mod now uses a script for fixing face textures and applying headparts. Even the script can be turned off. It is recommended to activate it for every feature except the race heights.\r<br />Please note: The script is pretty light weight. It works via a magic effect attached to all playable races. It is only run once per NPC you meet in one gaming session. After the face/head of that NPC is fixed the magic effect dispels.\r<br />This means it is very safe to remove the mod even when using the face fix script. I&#39;ve done so several times without getting ANY papyrus errors. Check the uninstallation section for more information.\r<br />\r<br />The patcher now creates a file called &#34;EBD Summary.txt&#34; in &#34;DataSkyProc PatchersEBDSkyProcDebug&#34;. You can view some information about what the patcher has done in there. This is especially useful if you want to see whether the textures packs were created as intended.\r<br />\r<br />\r<br />[center][size=5][u][color=yellow]Future Plans[/size][/u][/color][/center]\r<br />- fix weight feature - sadly this feature seems to be a goner\r<br />- fix body colour feature (might not be possible)\r<br />- make textures persistent even if the patcher is rerun(doable but with greatly increased script load, still pondering)\r<br />- race specific face and body textures (working on it)\r<br />- race specific meshes\r<br />\r<br />This mod will always work on a random basis. I do not have the coding skills & time to assign specific textures/hair styles/eye colours to specific NPCs. Sorry.\r<br />\r<br />\r<br />[center][size=5][u][color=yellow]Installation[/size][/u][/color][/center]\r<br />Use NMM, Mod Organizer or Wrye Bash to install. If you are familiar with Skyrim&#39;s folder structure you can install manually of course.\r<br />If you want to use body/face textures set them up as shown in the &#34;NPC body and face textures&#34; chapter.\r<br />Run the included &#34;EBD.jar&#34; in: &#34;DataSkyProc PatchersEBD&#34;.\r<br />Configure the patcher as you please. If you&#39;re modifying the textures and if you&#39;ve changed the setup of your texture files (removed or added any) make sure to check &#34;Force Patch&#34; in the upper right corner. \r<br />Check the created &#34;EveryBody&#39;s Different.esp&#34; in your launcher.\r<br />\r<br />\r<br />[center][size=5][u][color=yellow]Uninstallation[/size][/u][/color][/center]\r<br />Uncheck the &#34;EveryBody&#39;s Different.esp&#34; in your launcher. \r<br />Delete the &#34;EveryBody&#39;s Different.esp&#34; & remove the folder &#34;EBD&#34; in &#34;DataSkyProc Patchers&#34; and in &#34;DataTextures&#34;.\r<br />Delete the &#34;EBDExcludeNPCScript.pex&#34;, &#34;EBDHelperScript.pex&#34;, &#34;EBDNewLooksScript.pex&#34; and &#34;EBDTestScript.pex&#34; in &#34;Datascripts&#34;.\r<br />If you&#39;re not using the helper script you can remove the mod any time. \r<br />If you are using the script then go inside some place with no or few NPCs (like a player home), save & remove the mod then. Even if you&#39;re not following that procedure there should be no errors when removing the mod. I recommend this procedure just to take no chances.\r<br />\r<br />\r<br />[center][size=5][u][color=yellow]Updates[/size][/u][/color][/center]\r<br />Generally every update of the patcher is safe to overwrite the previous version with. However, you should always rerun the patcher after upgrading. Otherwise you might get a mismatch between the data in the plugin and what the script expects. Even if you don&#39;t use any script functions you should rerun the patcher to benefit from bugs fixes and new features.\r<br />\r<br />[center][size=5][u][color=yellow]Details[/size][/u][/color][/center]\r<br />\r<br />[center][size=4][u][color=green]NPC body and face textures (humanoid races, males and females)[/size][/color][/u][/center]\r<br />\r<br />[u][color=orange]Important: The patcher provides no texture files. You have to put the texture files where they belong yourself. Every time you add or remove textures you have to rerun the patcher&#33; Make sure to check &#34;Force Patch&#34; in the upper right corner&#33;[/u][/color]\r<br />\r<br />This feature is definitely the most important one of the patcher. \r<br />It allows you to distribute body and (matching&#33;) face textures on a random basis for every NPC in the game. [b]Nice side effect: the body/face textures you installed normally will be unique to your player character.[/b]\r<br />To use this feature you are required to be able to create some folders and put the body/face textures in there by hand. Some basic knowledge of the different texture files for skyrim is advantageous but not required.\r<br />No worries though, I implemented the feature very straight forward. Once you figured it out, it&#39;s really intuitive to use. The patcher uses so-called mainpacks and subpacks to achieve its goal.\r<br />Female mainpacks go to &#34;TexturesEBDFemale&#34; and male ones to &#34;TexturesEBDMale&#34;. \r<br />\r<br />Here is the concept: mainpacks (folders in TexturesEBDFemale or in TexturesEBDMale) classify textures of the same making (for example CBBE standard or MatureSkin or navetsea or ...). Textures in one mainpack should be interchangeable. The subpacks (folders inside a mainpack) contain the actual texture files. It goes like this:\r<br />Let us assume you want to use female body textures. You go the the aforementioned folder for females. Then you create a new folder in there and name it any way you want (the patcher recognizes folders in there automatically). Every folder you create will be a mainpack. Inside those mainpack folders you create folders again, subpacks, which contain the actual texture files. The patcher works recursively and will create any possible combinations of the textures you offer. [b]For more information refer to the readme.[/b] For pictures check the screenshot section. It&#39;s shown where to put which files.\r<br />\r<br />Some simple facts:\r<br />- Missing files in one subpack will be replaced by files from another subpack. This means you shouldn&#39;t put the same file twice in a mainpack. \r<br />- Files which are in one subpack will always be used together. \r<br />- If a Mainpack misses one of the compatible files, the standard path for this file will be used. For example many texture mods don&#39;t provide *Body_1_sk.dds files. If the file is not provided in any of the subpacks of a mainpack then the regular file will be used for this mainpack.\r<br />- The patcher will not replace the &#34;*body_1_msn.dds&#34; for old people. They will get the new textures but still look old.\r<br />- Face textures are handled the same as body textures: the &#34;*_msn.dds&#34; will not be replaced for old people and for all races which use their own unique &#34;*_msn.dds&#34; file. Right now this means only Nords will get the &#34;*_msn.dds&#34; you set up. Nords are the only race pointing to the default path.\r<br />- Vampires will get the new face textures as well. They won&#39;t look as ugly as before. This might be changed in later versions.\r<br />- Check out the provided images for more details for the file setup\r<br />\r<br />[b]PLEASE NOTE: Any time you make changes to the folder structure of the textures (i.e. you remove or add some textures) you HAVE TO RERUN the patcher. Be sure to check &#34;Force Patch on Exit&#34; in the upper right corner.[/b]\r<br />\r<br />\r<br />[center][size=4][u][color=green]Face textures for player character[/size][/color][/u][/center]\r<br />This is a small bonus feature found under texture settings. It will add any face textures the patcher finds to the complexion slider in the race menu. It will also create all possible complexions with those new textures.\r<br />You can then use the complexion slider in the race menu to change the face textures of your player character.\r<br />Only works for vanilla races & does not work for vampires.\r<br />This is a bonus feature and might not work for your setup.\r<br />\r<br />\r<br />[center][size=4][u][color=green]NPC body meshes (humanoid races, males and females)[/size][/color][/u][/center]\r<br />This feature is meant to be an addon the texture feature. Before you can use it you should have understood how the texture feature works.\r<br />Female meshes go to &#34;MeshesEBDFemale&#34; and male ones to &#34;MeshesEBDMale&#34;. Inside those folders you have to create subfolders with the [b]SAME NAMES[/b] (though lower case/upper case does not matter) as the mainpacks from the texture folder. So the meshes will be assigned to a certain texture mainpack. For example: You have the following mainpack for textures: &#34;TexturesEBDFemaleAntiWo&#34;. If you want assign specific meshes to that mainpack you create the folder: &#34;MeshesEBDFemaleAntiWo&#34; (note that lower case/upper case does not matter). Now all females using the &#34;AntiWo&#34; mainpack for textures will have the corresponding meshes assigned located in the &#34;AntiWo&#34; mesh folder.\r<br />\r<br />The following files are recognized: \r<br />\r<br />- Females: &#34;femalebody_0.nif&#34;, &#34;femalebody_1.nif&#34;, &#34;femalefeet_0.nif&#34;, &#34;femalefeet_1.nif&#34;, &#34;femalehands_0.nif&#34;, &#34;femalehands_1.nif&#34;\r<br />\r<br />- Males: &#34;malebody_0.nif&#34;, &#34;malebody_1.nif&#34;, &#34;malefeet_0.nif&#34;, &#34;malefeet_1.nif&#34;, &#34;malehands_0.nif&#34;, &#34;malehands_1.nif&#34;\r<br />\r<br />If one or more files are missing then the regularly installed mesh file will be used. Though you should never put a &#34;_0.nif&#34; without the corresponding &#34;_1.nif&#34; in the folder (or vice versa) or strangeness will occur.\r<br />\r<br />Please note that only the naked body mesh will be replaced, no armor or clothes meshes will be replaced. So you&#39;ll see the new meshes only on naked NPCs. \r<br />\r<br />When is this useful? For example if you&#39;re a body slide user and want to distribute slightly different meshes this works quite well. It is also useful if you want to mix different kinds of the UNP body (like skinny, &#34;normal&#34;, UNPB, ..).\r<br />This feature can even be used to mix CBBE/UNP/Whatever... You just have to use texture packs with the UNP/CBBE/... textures and put the corresponding meshes in the corresponding mesh folders. However, as said before, it will not change armor/clothes. So if you&#39;re using skimpy armor/clothes the NPCs with wrong body textures/meshes will look strange.\r<br />\r<br />Check the &#34;EBD Summary.txt&#34; in &#34;DataSkyProc PatchersEBDSkyProcDebug&#34; if you want to check whether the feature worked.\r<br />\r<br />\r<br />[center][size=4][u][color=green]NPC height (all races, males and females)[/size][/color][/u][/center]\r<br />You can change the minimum and maximum height of all playable races, the old Old People race and races which fit none of those categories (i.e. custom races) to your liking. Additionally you can set a female height offset. This configures whether females should be smaller or taller than men or have the same height (if set to 0). \r<br />\r<br />An NPC of the according race will get a height between (and including) those min/max values you set. Any NPC whose height differs from 100 (the default value) will not be modified to avoid changes to NPCs who are supposed to have a different height or which were modified by mods.\r<br />\r<br />\r<br />[center][size=4][u][color=green]NPC head parts (all races, males and females)[/size][/u][/color][/center]\r<br />This feature enables you to distribute hair styles and eye colours among NPCs. You can choose between females and males and whether to exclude unique NPCs.\r<br />It will include any hair styles and eyes added by mods and distribute them among NPCs just like vanilla hair. \r<br />I&#39;ve invested a lot of work into making sure that NPCs of a specific race & gender will only receive the headparts viable for them.\r<br />It should remember the hair/eyes it assigned to a NPC on the first time and use them again even if you rerun the patcher. However, if you add/remove hair/eye mods then every NPC will receive a new hair style/eye colour.\r<br />This done by adding invisible items to NPCs&#39; inventories. You cannot see or loot them. However, if open the console, click on an NPC and enter &#34;inv&#34; then you&#39;ll see that they are indeed in the inventory. They are used to remember the headparts for each NPC. No values whatsoever are saved into the script&#33;\r<br />\r<br />New in version 2.10 is the setting of the probability to change the headparts of a single NPC.\r<br />This setting is useful if you don&#39;t want every NPC&#39;s head changed by EBD and/or reduce script load. Fewer NPCs processed equals less load on the papyrus engine. The script will decide for every NPC whether to change that NPC or not. The decision taken (to change or not) for that NPC will be remembered until you change the probability in the patcher.\r<br />Setting the probability to 0 is equal to disabling the head feature altogether while setting it to 100 means that every NPC will be changed.\r<br />If you use the one of the spells described below to change the appearance of an NPC then the looks of that NPC will be remembered no matter what you set here.\r<br />IMPORTANT: If you change the probability the cards will be mixed again, i.e. the decision whether to change a NPC or not will be made again.\r<br />As of version 2.25 you are able to set the probabilities independently for males and females.\r<br />\r<br />As of version 2.10 you are able to exclude/include certain NPCs via spell from this feature or force a new look on them. As of version 2.20 they are automatically added to your player character if you check the corresponding setting in the headparts menu. You can remove those spells again by unchecking the setting.\r<br />\r<br />The EBDNewLooksSpell: Say you find an NPC which has an extraordinary ugly hair style. Just use the lesser power on that NPC and he/she will receive a new look (just like going to the hair dresser). Additionally, you can use this spell to have a new look on a previously disabled NPC. For example if you have unique NPCs excluded but you want Lydia to have a fresh new hair style then you can use that spell on her.\r<br />\r<br />The EBDExcludeSpell: Use this spell on an NPC you don&#39;t want to be changed by EBD (this only concerns the headpart feature). If the NPC you&#39;re using this on has already been changed, then you&#39;ll the change back to vanilla looks only the next time the game loads that NPC. So you have to fast travel or save and quit the game and reload to see the change to vanilla looks.\r<br />\r<br />There is also third spell which I use for testing some new script functions. Right now this undresses/redresses an NPC and calls the face texture fix function.\r<br /> \r<br />\r<br />[b]IMPORTANT: You have to enable the helper script if you&#39;re using this feature or it will NOT WORK at all.[/b]\r<br />\r<br />[center][size=4][u][color=green]NPC animations[/size][/u][/color][/center]\r<br />Sets all females to use female animations. There are some female NPCs (like Housecarls) which use male animations. This will disable the &#34;use opposite gender animation&#34; flag on those NPCs.\r<br />Enabling this means those NPCs use female animations (instead of male ones) from now on. This will also fix Orc females using male animations, so they will act like females now as well.\r<br />Please note: some females using opposite gender animations is (I think) a design choice by Bethesda. So this is not a &#34;fix&#34;, it is just a matter of personal preference.\r<br />\r<br />IMPORTANT: You might have to start a new game to see the effect for females you have already encountered. They will probably stick to the animations they used before.\r<br />Furthermore it is possible that the female animations stick for NPCs you&#39;ve met even when you disable this feature. Use with care.\r<br />\r<br />Please note: I know that there are numerous mods available doing the same. However, EBD will achieve it&#39;s goal in an automated fashion. Meaning there will be no females left out/forgotten. It also means that any females added by DLCs/other mods are affected by this setting automatically.\r<br />\r<br />This feature is completely script free.\r<br />\r<br />PLEASE NOTE: The patching can take some time (up to five minutes on my system). It depends on how many mods and texture packs you have installed.\r<br />\r<br />\r<br />[center][size=5][u][color=yellow]Texture Tools/VRam Usage[/size][/u][/color][/center]\r<br />The VRam and performance impact of my patcher can be kept quiet low. I use about 1 gb of texture files while my ingame VRam usage only increases by 100-150 mb & performance impact is not noticeable.\r<br />\r<br />Check out the following tools to optimize the textures in the EBD folder (make a backup before using them, just in case). Only use them to optimize textures, I do not recommend optimizing meshes/nifs:\r<br />[url=http://skyrim.nexusmods.com/mods/13529]SMCO[/url]\r<br />Very easy to use. Just click and play. I like it a lot. However, you cannot resize big textures (4096px). For resizing and more options use the tool below.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/12801]Optimizer Textures[/url]\r<br />Has more options and is a tad more complicated to use. I recommended to use this tool to resize any textures with a resolution greater than 2048px down to 2048px. Especially if you have 1 gb of VRam or less.\r<br />\r<br />\r<br />[center][size=5][u][color=yellow]Credits[/size][/u][/color][/center]\r<br />Leviathan1753 - the guy who made it all possible\r<br />Plutoman - for helping me with some coding questions\r<br />PurpleLunchBox - for helping me with the helper script. Without him it would not exist\r<br />DienesToo - for bug fixes and new features in the skyproc library\r<br />[url=http://skyrim.nexusmods.com/mods/21377]Automatic Variants[/url] - inspired me to create this patcher\r<br />\r<br />\r<br />[center][size=5][u][color=yellow]Recommended Mods[/size][/u][/color][/center]\r<br />I recommend to check out the following body/face textures to use the patcher in the full glory:\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/32986]MatureSkin by Maevan2[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/31954]BI Phenotypes by betterbecause[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/4686]Textures by AnTiWoMaAgNoT[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/6554]Textures by navetsea[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/28946]Sporty Sexy Sweat by xs2reality[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/32329]Battle Hardened Body Mod by Wast1980[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/27466]Tan Lines for CBBE by anshio[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/35267]SG Female Textures Renewal by Hello Santa[/url]\r<br />\r<br />All of them are really awesome and I use them myself with the patcher. Use them. Endorse them.\r<br />\r<br />Please note: EBD is mainly about textures. Mesh support is pretty basic. Changing meshes and the corresponding armor meshes is a lot of work & might mess up more than it achieves. You might want to check out RBS by VadersApp for more extensive mesh support: http://skyrim.nexusmods.com/mods/23311\r<br />This mod changes meshes as well as other things about NPCs.\r<br />\r<br />For hair mods check out the following:\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/31797]Ponytail Hairstyles v2_5 by Azar[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/10168]ApachiiSkyHair by Apachii[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/7403]Lovely Hairstyles by sn00p[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/18110]Hair packs of TES IV Oblivion for Female Only by Radioragae[/url]\r<br />Google for the awesome SGHairs to find even more&#33;\r<br />\r<br />Eye mods:\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/14539]Flans Eyes for Skyrim by DarNilavu[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/13722]The Eyes Of Beauty by Gabriel Mailhot[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/3589]Natural Eyes by nevenbridge[/url]\r<br />\r<br />[center][size=5][u][color=yellow]Permissions[/size][/u][/color][/center]\r<br />Do not redistribute this file or any part of it. Exclusive to the Nexus.\r<br />I reserve the copyright of this mod and all intellectual property and the development rights.\r<br />\r<br />[center][size=5][u][color=yellow]Disclaimer[/size][/u][/color][/center]\r<br />This mod comes without any guarantees that it will work or leave your game/computer intact. Use at your own risk.",
  "categoryId": "33",
  "version": "3.00",
  "author": "MongoMonk",
  "createdUnix": "1365618443",
  "updatedUnix": "1394194831",
  "containsAdultContent": false,
  "uploadedBy": "MongoMonk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000055359",
      "name": "EBD - skyproc patcher",
      "version": "2.25",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2540",
      "fileName": "EBD - skyproc patcher-34637-2-25.rar",
      "uploadedUnix": "1379154821",
      "modVersion": "2.25",
      "virusScanUrl": "https://www.virustotal.com/file/f985748518a94468c5a3aac5b9282b706c90b7b2c40097914f4882f2f41899de/analysis/1407722186/",
      "changelogHtml": " Headpart feature: Massive speed improvements to the headparts script. It&#39;s now as fast as it gets.\r<br />\r<br />Headpart feature: you can now set the probabilities for males and females independently\r<br />\r<br />Headpart feature: option to disable elderly NPCs. Use this to save resources if you don&#39;t care about the looks of old NPCs.\r<br />\r<br />Texture feature: fixed a bug where NPCs without the proper gender flag would cause mismatched head textures. Possibly fixes pale heads for males. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EBD%20-%20skyproc%20patcher-34637-2-25.rar?fid=1000055359&ttl=1535812633&ri=8192&rs=8192&setec=2a5cc62ccb3d1c08ffd311e20c4cdcba"
    },
    {
      "fileId": "1000062289",
      "name": "EBD - skyproc patcher",
      "version": "2.26",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2540",
      "fileName": "EBD - skyproc patcher-34637-2-26.rar",
      "uploadedUnix": "1381052215",
      "modVersion": "2.26",
      "virusScanUrl": "https://www.virustotal.com/file/cb198d592c361b05f5919f3ed9ebd56e9ccb66ee34b7a8deb4db2651a8f15e01/analysis/1407747207/",
      "changelogHtml": " Headpart feature: small stability improvement to the script\r<br />\r<br />Bug fix for the patcher: some records from Interesting NPCs would be exported incorrectly. Those NPcs will be ignored now (until fixed in skyproc itself). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EBD%20-%20skyproc%20patcher-34637-2-26.rar?fid=1000062289&ttl=1535812633&ri=8192&rs=8192&setec=23cfd7cb05d5bcc45afb9950643ad84b"
    },
    {
      "fileId": "1000086712",
      "name": "EBD - skyproc patcher",
      "version": "2.30",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4143",
      "fileName": "EBD - skyproc patcher-34637-2-30.rar",
      "uploadedUnix": "1387020675",
      "modVersion": "2.30",
      "virusScanUrl": "https://www.virustotal.com/file/88103d29743ca666cc88f0f788feac37b12999b3da321022252d5b4358a333d6/analysis/1407836472/",
      "changelogHtml": " - Update of the skyproc library: There were a few instances of NPC records getting processed incorrectly (e.g. from Interesting NPCs). Many thanks to DienesToo\r<br />\r<br />- Headpart feature: Headparts are now matched by flags and not by EDID. This improves the recognition of headparts significantly. Any mod should now be recognized. Again thanks to DienesToo.\r<br />\r<br />- Headpart feature: Added two new options. You may now disable NPCs in combat & prevent the distribution of vanilla headparts.\r<br />\r<br />- If you&#39;re updating, you have to RERUN the patcher <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EBD%20-%20skyproc%20patcher-34637-2-30.rar?fid=1000086712&ttl=1535812634&ri=8192&rs=8192&setec=f5c17df857cb96e48d35b0586ae279db"
    },
    {
      "fileId": "1000100195",
      "name": "Dummy File",
      "version": "3.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Dummy File-34637-3-00.rar",
      "uploadedUnix": "1394194831",
      "modVersion": "3.00",
      "virusScanUrl": "https://www.virustotal.com/file/b6bf4ac8a561176afae4fd62245543a4fb493b03827f0b4b66643e1f6fce2f52/analysis/1407963619/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dummy%20File-34637-3-00.rar?fid=1000100195&ttl=1535812634&ri=8192&rs=8192&setec=a3978d8c3c4cef86d2c1bf68ac6c7901"
    }
  ]
}