{
  "modId": 34662.0,
  "modName": "Tundra Defense - deutsch - Construct your own Outpost",
  "summary": "Die deutsche Übersetzung von Tundra Defense.\r<br />Ermöglicht Euch, einen eigenen Außenposten bis hin zu einer kompletten, eigenen Stadt zu bauen.",
  "descriptionHtml": "[center]---[This is merely a fan-translation of the Mod made from Elderwind into German language. You need to download the original mod in order to use this translation.]---[/center]\r<br />\r<br />\r<br />Wer wollte nicht schon immer mal selbst eine komplette, neue Stadt in Himmelsrand aufbauen? Diesen Traum versuchte Hearthfire zu erfüllen... und scheiterte kläglich an den wenigen Möglichkeiten.\r<br />Dieser Mod ändert das nun. Werdet vom einfachen Häusle-Bauer zum Fürsten einer ganzen Provinz. Errichtet Häuser, Befestigungen, Wachen, ein Handelssystem und ganze Wirtschaftszweige, um so zum König einer neuen, aufstrebenden Stadt zu werden, die Ihr ganz alleine selbst gestalten könnt. Regelmäßige Überfälle und vereinzelte Events sorgen dabei dafür, dass Euch nie langweilig wird. Zusätzlich ist dieser Mod mit einer sehr umfangreichen Menü-Steuerung ausgestattet, die jedem ermöglicht, seinen Außenposten perfekt nach eigenen Wünschen zu gestalten.\r<br />\r<br />\r<br />\r<br />\r<br />[center][color=darkred][size=5]-\r<br />Dies ist mein vorerst letzter Mod. Mit Beginn des neuen Semesters habe ich leider keine Zeit mehr, um noch an weiteren Übersetzungen zu arbeiten. Ich nehme daher keine Requests, Nachfragen oder Angebote mehr an.[/size][/color][/center]\r<br />[color=yellow][size=3]Nur um Nachfragen zuvor zu kommen: Für alle meine bisherigen Übersetzungen gibt es nach wie vor Support und sollten neue Versionen erscheinen, werde ich auch diese noch übersetzen. Das Ende meiner &#34;Arbeit&#34; bezieht sich [u]nur[/u] auf neue Projekte.[/size][/color]\r<br />\r<br />[center][color=darkred][size=5]-[/size][/color][/center]\r<br />\r<br />\r<br />\r<br />\r<br />Dieser Mod basiert auf dem &#34;Tundra Defense&#34;-Mod von Elderwind.  Meine Leistung ist lediglich, dass ich ihn ins deutsche übersetzt habe. Die finale Version funktioniert auch ohne das Original, ihr solltet dem Autor des Originals aber ebenfalls euren Dank und ein &#34;Endorse&#34; hinterlassen.\r<br />\r<br />[b][u]Zu finden ist der ursprüngliche Mod hier:[/u][/b]\r<br />[url=http://skyrim.nexusmods.com/mods/22330]http://skyrim.nexusmods.com/mods/22330[/url]\r<br />\r<br />-\r<br />\r<br />[b]Installation:[/b]\r<br />1.) Die Datei herunterladen.\r<br />2.) Wenn ihr zuvor den Original-Mod installiert habt, überschreibt die installierten Dateien mit den in diesem Mod vorhandenen Dateien und ersetzt die entsprechende .esp sowie .bsa-Datei.\r<br />Ansonsten einfach die Dateien aus dem Verzeichnis in Euren Spieleordner (in der Regel steam&#92;steamapps&#92;common&#92;Skyrim&#92;Data) kopieren.\r<br />3.) Den Mod aktivieren und Spaß haben :-)\r<br />\r<br />Damit der Mod fehlerfrei funktioniert, MUSS zusätzlich SKSE installiert sein. Zu finden ist es hier:\r<br />[url=http://skse.silverlock.org/]http://skse.silverlock.org/[/url]\r<br />\r<br />\r<br />\r<br />Beachtet, dass Ihr, wenn Ihr bereits eine alte Version dieses Mods besitzt, bei einem Upgrade sicherheitshalber einen Clean-save macht (also einmal den Mod deaktivieren, das Spiel starten, abspeichern, Spiel beenden, Mod wieder aktivieren und dann den Spielstand neu laden), damit alle Änderungen auch übernommen werden. Nach meiner Erfahrung ist dieser Schritt zwar nur selten nötig, aber trotzdem übernehme ich keine Garantie dafür, was mit eurem Spielstand passiert, wenn ihr diesen Schritt auslasst.\r<br />\r<br />-\r<br />\r<br />\r<br />[b]Anmerkung:[/b]\r<br />Nach langer Tüftelei und einiger Hilfe habe ich nun endlich die finale Version fertigstellen können, die komplett auf deutsch ist. Vielen Dank in dieser Hinsicht auch an firuz22, der mir tatkräftig geholfen hat.\r<br />Mit der finalen Version benötigt der Mod nun auch nicht mehr das englische Original, sondern ist selbstständig voll funktionsfähig.\r<br />\r<br />\r<br />-\r<br />\r<br />\r<br />[b]Schlusswort:[/b]\r<br />Ich habe diesen Mod mit genauso viel Sorgfalt und Mühe übersetzt, wie alle anderen bisher auch, es kann jedoch bei so umfangreichen Mods wie diesem hier immer mal sein, dass ich etwas übersehen habe oder mir sie Übersetzung eines Satzes nicht perfekt gelungen ist. Solltet Ihr also Rechtschreibfehler finden, eine Formulierung unschön finden, oder andere Probleme haben, dann teilt mir das bitte hier auf Skyrim-Nexus mit.\r<br />\r<br />\r<br />\r<br />[b][b][size=3][color=orange]Abschließend möchte ich hier Werbung für meine neuste Übersetzung machen, nämlich für den wahnsinnig spannenden Mod &#34;[url=http://www.nexusmods.com/skyrim/mods/64283/?]Immersive Jewelry[/url]&#34;, den ich [url=http://www.nexusmods.com/skyrim/mods/66774/?]hier[/url] übersetzt habe.[/color][/size][/b][/b]\r<br />\r<br />\r<br />\r<br />Credits gehen insbesondere an Elderwind für seinen genialen Mod und an alle, die ihm dabei geholfen haben.\r<br />Credits gehen auch an firuz22 für seine tatkräftige Mithilfe beim erstellen der .bsa-Datei.\r<br />\r<br />\r<br />Bei weiteren Fragen, oder wenn ihr diese Mod mögt, hinterlasst mir doch einen Kommentar. Sollte euch meine Übersetzung gefallen, so klickt doch bitte einmal auf &#34;endorse me&#34;. Vergesst auch nicht, Elderwind zu belohnen.\r<br />Viel Spaß&#33;",
  "categoryId": "24",
  "version": "3.06",
  "author": "Elderwind und Verodor",
  "createdUnix": "1365683745",
  "updatedUnix": "1366122905",
  "containsAdultContent": false,
  "uploadedBy": "Verodor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000023778",
      "name": "Tundra Defense - deutsch",
      "version": "3.06",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "108",
      "fileName": "Tundra Defense - deutsch-34662-3-06.rar",
      "uploadedUnix": "1365682735",
      "modVersion": "3.06",
      "virusScanUrl": "https://www.virustotal.com/file/9213822d471a959bed6005950f8af8e10d3dbdef72df178c8bce38f6a17f8c7b/analysis/1407516806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tundra%20Defense%20-%20deutsch-34662-3-06.rar?fid=1000023778&ttl=1535812673&ri=8192&rs=8192&setec=1bb3fe1d2cea68773fb8fb5ad17b8de7"
    },
    {
      "fileId": "1000024782",
      "name": "Tundra Defense - deutsch - final",
      "version": "3.06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10309",
      "fileName": "Tundra Defense - deutsch - final-34662-3-06.rar",
      "uploadedUnix": "1366122905",
      "modVersion": "3.06",
      "virusScanUrl": "https://www.virustotal.com/file/7e326c66643e2db31eedfb4880823c75fd7c6aaa41dd25c8034eb01ef1846805/analysis/1407525279/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tundra%20Defense%20-%20deutsch%20-%20final-34662-3-06.rar?fid=1000024782&ttl=1535812674&ri=8192&rs=8192&setec=5f5d08751ff2c05db9720b5643095c10"
    }
  ]
}