{
  "modId": 34677.0,
  "modName": "Starlight and Darknight - Candlelight Toggleable",
  "summary": "Starlight spell - Continuous candlelight spell\r\nDarknight spell - Switches off the candlelight",
  "descriptionHtml": "Adds 2 new spell tomes to Tolfdir\\'s merchant chest in the College of Winterhold. Both are novice alteration spells.\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nI was sick of having to recast candlelight every minute as I trudged through the darkest and deepest of dungeons so I wrote to Tolfdir and begged him to create something a little bit better for the dasiy sniffer, dungeon delver that I am. \r\nLuckily he was actually in possession of his alembic at the time so he was able to concoct a potion to pour over a spare candlelight tome which would greatly increase it\\'s duration. He told me the potion was mixed from skooma and stardust with a dash of nirnroot... or was that what he was drinking when he made it? \r\nNevermind, I digress. The result... Starlight a spell that will allow you to see into the deepest darkest recesses of a dungeon and then another recess and then a rubble pile and then down a corridor and then... for a whole 5hrs (realtime that is).\r\nThank you Tolfdir, never again will I curse your absentmindedness. Well not for a few days anyway (gametime).\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nStarlight (11 magika) - Creates a candlelight effect that lasts for 5hrs (not quite continuous but please excuse a little bit of artistic license).\r\n\r\nDarknight (0 magika) - An absorption spell that puts out the starlight when you are bored of it following you around! \r\n\r\nNotes:\r\n\r\nDarknight tested with other alteration spells and it will only dispel starlight. Candlelight will not be affected/dispelled by Darknight.\r\n\r\nStarlight will cancel out Candlelight if it has already been cast but if you cast Candlelight when Starlight is active you will have 2 lights. I didn\\'t want to mess around with the original candlelight spell (and you never know when you may want two lights).\r\n\r\nTested with various mods active and had no problems. Shouldn\\'t be any conflicts as I have only created new tomes, spells and magic effects. Vanilla versions are untouched.",
  "categoryId": "75",
  "version": "1.0",
  "author": "Saryent",
  "createdUnix": "1365709177",
  "updatedUnix": "1365709687",
  "containsAdultContent": false,
  "uploadedBy": "saryent",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000023849",
      "name": "Starlight",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Starlight-34677-1-0.7z",
      "uploadedUnix": "1365709687",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b6cc3b23cc3cd20500487014f0fe8467a85e008ed4271a7a88d5bc6994040e8d/analysis/1407517349/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Starlight-34677-1-0.7z?fid=1000023849&ttl=1535812698&ri=8192&rs=8192&setec=2786d2d19bb0ea2029068707b61edcd8"
    }
  ]
}