{
  "modId": 34688.0,
  "modName": "Purgatory Mine WIP",
  "summary": "A work in progress prison/mine. The idea is that if you get arrested with a high enough bounty you are sent to this here instead of to the dungeon of the hold you are in.",
  "descriptionHtml": "This is a work in progress prison/mine. It is located north-east of Ansies Cabin (south of Whiterun, just south from Bleak Falls Barrow). There is a fast travel marker. My hope for this is to be a starting point in adding a more complex prison system to Skyrim. The dungeons in the cities are nice, but would you really put Dragonborn in there after he killed your entire guard force? There should be a special place for criminals like that. That\\'s what I hope to add eventually, this is the starting point.\r\n\r\nThere is a secret way out, like all dungeons/prison cells in Skyrim. Please leave some feedback. Your thoughts on this are very important, as criticism is a great way to help me improve as a dungeon maker. \r\n\r\nNothing to special. If you attack any of the guards in the mine they will attempt to arrest you or kill you. Right now you won\\'t be sent here no matter what you do in other holds, only if you commit a crime while inside the mine. What I\\'m hoping is that I can create break-out quests for the thieves guild eventually (or that someone else would be willing to do it for me). The idea would be to get arrested and sent here, and break out someone of importance. Simple stuff but something different.\r\n\r\nThe guards inside are high level, so if you want to fight high level opponents just head on in and start a fight. Attacking other prisoners should also work.\r\n\r\nI hope you enjoy my mod. I will be working to make it better as much as I can. Hopefully I can make breaking out of jail harder for those Dovakiins that commit murder in the holds.",
  "categoryId": "88",
  "version": "0.3",
  "author": "SandMan131313",
  "createdUnix": "1365734067",
  "updatedUnix": "1365803415",
  "containsAdultContent": false,
  "uploadedBy": "SandMan131313",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000023896",
      "name": "Purgatory Mine",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "72",
      "fileName": "Purgatory Mine-34688-0-1.rar",
      "uploadedUnix": "1365733927",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/b5cae0ee2949b9158c07eb07275cb4f19912f2d6f241dd04bc26df0f6edac272/analysis/1407517803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Purgatory%20Mine-34688-0-1.rar?fid=1000023896&ttl=1535812714&ri=8192&rs=8192&setec=8636cf947637b2eac4e780f665301e94"
    },
    {
      "fileId": "1000024007",
      "name": "Purgatory Mine",
      "version": ".2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "72",
      "fileName": "Purgatory Mine-34688--2.rar",
      "uploadedUnix": "1365803415",
      "modVersion": ".2",
      "virusScanUrl": "https://www.virustotal.com/file/1e9b830552d8e9347856a32950ca5033616d4d5228740324b8e1e20482766a66/analysis/1407518593/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Purgatory%20Mine-34688--2.rar?fid=1000024007&ttl=1535812715&ri=8192&rs=8192&setec=8962154cfeccee481945e815d1087d10"
    }
  ]
}