{
  "modId": 34684.0,
  "modName": "Dragon Knight Armor Alternate Helmet",
  "summary": "Replacer for helmet of Dragon Knight Armor. ",
  "descriptionHtml": "NOTES\r\nI love hothtrooper\\'s Dragon Knight Armor, but something about the extra set of fins bothered me. Therefore, I present a version that looks exactly like the vanilla Ebony helmet, but retextured to glorious dragonbone. A little bit of messing with texture files and a quick edit in NifSkope let me remove the extra fins without altering the helmet in any other way.\r\n\r\nBecause of the cool edits hothtrooper made to the Ebony helmet mesh, including teeth at the corners and visible eyes, you can\\'t just use the vanilla Ebony helmet textures. I will add a non-replacer version once I have the know-how.\r\n\r\nThe greatsword on my back is Akaviri Dragonbone, from the awesome mod Wulfharth\\'s Dragonebone Weapons Complete: http://skyrim.nexusmods.com/mods/10171\r\n\r\nScreenshots taken with CoT, RLO, and the great BPENB, which is, unfortunately, hidden by the author. \r\n\r\nCONFLICTS\r\nNone\r\n\r\nINSTALLATION\r\nRequires Dragon Knight Armor: http://skyrim.nexusmods.com/mods/28287\r\n\r\nJust download and extract, then drop the files into the Skyrim Data folder. Overwrite when asked. I recommend backing up the original files. To avoid possible floating texture issues, go to Data/textures/armor/Ebon Drake Armor Textures and delete any textures that mention \\\"fins.\\\" These are the textures for the extra fins that do not exist in my altered meshes\r\n\r\nIf there are any problems, either revert or simply reinstall DKA to overwrite my altered files.\r\n\r\nCHANGELOG\r\nVersion 0.1: initial upload\r\n\r\nCREDITS\r\nFull credit to the fantastic original Dragon Knight Armor and modified files goes to Hothtrooper44.",
  "categoryId": "54",
  "version": "0.1",
  "author": "Adragalus",
  "createdUnix": "1365727196",
  "updatedUnix": "1365726600",
  "containsAdultContent": false,
  "uploadedBy": "adragalus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000023890",
      "name": "Altered DKA Helmet",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "126",
      "fileName": "Altered DKA Helmet-34684-0-1.zip",
      "uploadedUnix": "1365726600",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/7c252f1802d63c5bc686c4f1f10f9047c56f2b1c2c6fd950d69dcd027984d5bd/analysis/1407517682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Altered%20DKA%20Helmet-34684-0-1.zip?fid=1000023890&ttl=1535812708&ri=8192&rs=8192&setec=186dc2c3dcbe914a0df94c1da7c62622"
    }
  ]
}