{
  "modId": 34743.0,
  "modName": "Nightingale Hall and Twilight Sepulcher - Improved",
  "summary": "Improves Nightingale Hall with added crafting stations, loot clutter and adds the portal to the Twilight Inner Sanctum on completion of the Nightingale questline.\r<br />Keeps the Twilight Sepulcher dungeon as a gauntlet/trial event to reach Nocturnals inner sanctum.",
  "descriptionHtml": "Description\r<br />===========\r<br />Upon completing the Nightingale quest line, this mod will add the following :-\r<br />\r<br />1.  Adds a portal to and from Nightingale Hall to the Twilight Inner Sanctum. The doorway within the Inner Sanctum for return to Nightingale Hall is labelled and matches the other doorways in look and operation.\r<br />\r<br />2.  Keeps the Twilight Sepulcher as a gauntlet/trial to reach the Inner Sanctum, as this was the buildings intended purpose.\r<br />\r<br />2.  More clutter and loot to Nightingale Hall, to make it feel more like Karliah has been busy and is living there.\r<br />\r<br />4.  Adds a cooking area and alchemy workstation within range of Karliah&#39;s default AI sandbox. So she will move about and use these. Also there are some more idle markers for her to use, lean against walls, sit on crate etc.\r<br />\r<br />5.  Adds some a alchemy workstation and some ingredients & plants, all chosen for paralysis poison effect.\r<br />\r<br />6.  Two weapons racks, one containing a set of Nightingale weapons next to Karliah&#39;s armor equipping stone (hinting at they are Karliah&#39;s but not marked for stealing if you wish to take/replace them). The other weapons rack has Glass weapons with new enchantments you can learn or leave (see below).\r<br />\r<br />7.  Three new enchantments based on the original games Fiery Soul Trap enchantment, these are added for a bit of flavour. Similar charges, damage and duration to Fiery Soul Trap but a Frost / Shock / Paralysis version. The Paralysis version has a 1 sec paralysis effect, with varying soul trap duration. I have tested this with a bow, and it seems fairly balanced. The paralysis effect doesn&#39;t not apply on every hit and only lasts long enough to topple them over.\r<br />\r<br />8.  Adds all of the black smithing workstations including smelter, as Karliah would need a space to melt down all that gold she&#39;s been stealing. Also some clutter next to the smelter, to make it look like that is what she has been doing.\r<br />\r<br />9.  Cleans up some rubble piles and straightens up the target practice area.\r<br />\r<br />10. Adds some additional light sources in the Nightingale Hall and some night time critter spawn points, just to make the place look a bit more alive.\r<br />\r<br />\r<br />\r<br />This mod does not alter any of the questline, activators, NPC&#39;s or navmesh. Karliah will move about more with this mod installed; cooking, leaning against walls, sitting on crates, mixing potions, etc. But this is all from the games default AI making use of the new activators.\r<br />\r<br />The mod has been tested with a new play through and installed on a completed play through and works fine on both.\r<br />\r<br />The mod has been designed with relatively few changes to the default areas. I have tried to keep the changes made sympathetic to the original game and layout, while in keeping with the change of fortunes to the Nightingales.\r<br />\r<br />All changes are set to occur upon completing the Nightingale quest line and involve disabling/enabling objects so no unsafe changes.\r<br />\r<br />\r<br />\r<br />Reason and lore for the mod\r<br />===========================\r<br />In the original game the Twilight Sepulcher is described as a trial/gauntlet/rite of passage to reach the inner sanctum. However upon completing the quest line the gauntlet element is completely removed, and the doorway is there for any passerby to pop into the inner sanctum. \r<br />\r<br />This mod restores the gauntlet/trial to the twilight sepulcher. The traps and ghosts respawn by default in the original game. (The only thing to note is the lights next to Nocturnal&#39;s statue do not reset, as such just remember to pull the chain to the left of statue to Nocturnal.) All my mod does is move the entrance and disable/enable some load doors.\r<br />\r<br />Karliah also mentions that a portal to the Inner Sanctum will appear in Nightingale Hall but, this never occurs. My mod adds that portal in the collapsed doorway, near the entrance of Nightingale Hall. The portal for return in the Inner Sanctum looks the same as the other two doorways, however it is clearly labelled when you wish to return to Nightingale Hall. The other exits in the Inner Sanctum, still return you to the start of the Twilight Sepulcher dungeon.\r<br />\r<br />Karliah also mentions that she has been busy thieving since the Skeleton Key has been returned. In the original game there is no visible loot or containers with much loot in them as evidence of this. My mod adds various gold & silver candles, plates & other clutter, crates, and a few chests with some random loot.\r<br />\r<br />The weapons rack next to the stone Karliah receives her armor from has a set of Nightingale swords and bow. This is just for flavor so Karliah has some means to defend her home and the skeleton key, as she has already given you her bow and Gallus&#39;s sword.\r<br />\r<br />The alchemy ingredients were chosen for the paralysis poison effect, which seemed fitting for Karliah. Just incase she wanted to make another batch of her special poison, on the chance that anyone else tries stealing the skeleton key again.\r<br />\r<br />\r<br />\r<br />Requirements\r<br />============\r<br />None\r<br />\r<br />\r<br />\r<br />Installation Instructions\r<br />=========================\r<br />Install using NMM.\r<br />\r<br />\r<br />\r<br />Uninstallation\r<br />============\r<br />Remove all items you don&#39;t want to loose from weapon racks mannequins etc.\r<br />Open the console and type\r<br />prid E4cf6       hit enter\r<br />disable           hit enter\r<br />Close the console, make a save and exit the game.\r<br />\r<br />Uninstall mod using NMM.\r<br />Reload your save open the console again and type\r<br />prid E4cf6      hit enter\r<br />enable           hit enter\r<br />Close the console and save (the interior of nightingale hall will now be updated with the default interior from completing the nightingale questline)\r<br />\r<br />\r<br />\r<br />Update instructions\r<br />==================\r<br />Nothing fancy deactivate old version and download and install new version.\r<br />\r<br />\r<br />\r<br />Incompatabilities\r<br />=================\r<br />The only thing that may cause incompatibilites are mods changing either the Nightingale Hall or Twilight Sepulcher.\r<br />\r<br />Recommended mods\r<br />===================\r<br />[url=http://skyrim.nexusmods.com/mods/16002/]Lonely Karliah[/url] mod will make Karliah a follower and give marriage options.\r<br />\r<br />FAQ\r<br />====\r<br />Q. When should in install the mod with regards to the Thieve&#39;s Guild quest line.\r<br />A. You can install it at anytime all the content is enabled based on the markers already used by the quest line. So you will not see barrels, chests, doors etc until the quest line is complete. Once the Nightingale quest line is completed all the furniture markers etc will appear.\r<br />\r<br />Q. The door in the twilight sepulcher is not working.\r<br />A. The blue veil at the start of the dungeon after completing the nightingale questline is not a door. As detailed in the description, you will need to go through the dungeon and drop down the well.\r<br />I left this veil in as it looks pretty atmospheric and seemed a shame to remove it. It also adds to the explanation as to why you are deposited near the dungeon entrance when leaving the inner sanctum (I did not move this spawn point for exiting the inner sanctum, as it makes no sense, and in one spot impossible if the dungeon has respawned, to do the dungeon in reverse).\r<br />\r<br />Q. Does this mod add quests or scripts that could break my game.\r<br />A. No the mod uses only default creation kit objects and does not alter or add any quests to function. Within Nightingale Hall there is a marker used for setting the chairs and beds for Karliah&#39;s return, this mod acts the same way as those chairs work and enables / disables when the questline is complete and the marker is activated.\r<br />\r<br />Q. The mannequins are moving.\r<br />A. They are default mannequins exactly the same sort as found in Honeyside, Proudspire etc.\r<br />\r<br />Q. The weapons rack is upside down.\r<br />A. This is done intentionally, the swords look better in my opinion and match the riften flag. I did consider putting the center piece for the shield rack the correct way up, but I found I like the look of Daedric shields upside down.\r<br />\r<br />Q. Do the mannequins come with the outfit in the pictures.\r<br />A. No I used a mod to craft a blank set of nightingale armor and another mod to craft a set of gold armor.\r<br />You do not need these mods to use mine, but if you want that gold armor it is from [url=http://skyrim.nexusmods.com/mods/23924]here[/url], and crafting a duplicate Nightingale armor from [url=http://skyrim.nexusmods.com/mods/799]here[/url]\r<br />\r<br />Q. Is there anything more planned for the mod.\r<br />A. I think this area is about done and I will be moving on to making a mod for another area now.\r<br />I have considered putting the portal at the end of the stream in the front chamber so it is less conspicuous. Or adding a shortcut between the ratway/ragged flagon and Nightingale Hall. Installing a new concealed doorway to the exterior entrance to Nightingale Hall.\r<br />However with version 1.1, I&#39;m pretty happy with the way it is now anything more I think may spoil it. I will be keeping an eye on the comments to keep it up to date if any patches break anything or if anything is particularly hated or wanted.\r<br />\r<br />\r<br />My other Mods\r<br />=============\r<br />If you like this mod you may also like be interested in my other mod below.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/32608]Alchemy and Atronach Forge Guide Books[/url]\r<br />Adds a Alchemy guide book, detailing potions I have found useful. Mainly multiple ingredient, multiple effect poisons and potions. Also gives details on ingredients for poisons with the maximum strength.\r<br />Adds two Atronach Forge Guide Books, listing all vanilla game recipes.\r<br />All these books are free and weightless available from Whiterun Dragonsreach.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/32623]Improved Atronach Forge[/url]\r<br />Adds more recipes to the Atronach Forge that do not require the sigil stone. Notably this mod has more Staffs, Conjuration spell tomes, Potions and Poisons, etc.\r<br />It also amends the original fire, frost and void salts recipe to give 10 items instead of 1, making it slightly more useful for alchemy.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/38055/]Full four item effect Alchemy and Smithing fortify skill on one ring[/url]\r<br />Adds a crafting ring which has the combined total of four items worth of alchemy & blacksmithing enchants (~120%). The ring also comes with a large boost (~6000) to carryweight to make crafting and selling easier withing towns.\r<br />\r<br />\r<br />Credits and Thanks\r<br />==================\r<br />Thanks to Bethesda for creating Skyrim and the creation kit.",
  "categoryId": "91",
  "version": "1.1",
  "author": "ClackingKeys",
  "createdUnix": "1365901156",
  "updatedUnix": "1367264914",
  "containsAdultContent": false,
  "uploadedBy": "ClackingKeys",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024163",
      "name": "NightingaleHallSepulcherImproved 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "NightingaleHallSepulcherImproved 1_0-34743-1-0.7z",
      "uploadedUnix": "1365865897",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9d7008edbcf28d73fbbe2543b3742d66dd3c60255575beabd54aa5a46dd96876/analysis/1407520152/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NightingaleHallSepulcherImproved%201_0-34743-1-0.7z?fid=1000024163&ttl=1535812816&ri=8192&rs=8192&setec=fd1cbd3a9dd94cf13048a225536c18df"
    },
    {
      "fileId": "1000027146",
      "name": "NightingaleHallSepulcherImproved 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "NightingaleHallSepulcherImproved 1_1-34743-1-1.7z",
      "uploadedUnix": "1367264914",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/faa9d485426499f3f7a906e4fac2112a0b7e4a0df895b068343aea6c90d20c2e/analysis/1407547386/",
      "changelogHtml": " Set Nightingale Hall to respawn, so that chests and plants respawn. (does not affect the gate in the backrooms which remains open) <br/> \n Moved the spawn point within the inner sanctum away from the nightingale buff selection spots to prevent accidental activation upon entering the room. <br/> \n Added mannequin near Brynjolf&#39;s equipment stone. <br/> \n Added mannequin, plants, barrels, seating, display cases with weapons racks inside, table and cabinet to the small room next to the oath giving chamber. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NightingaleHallSepulcherImproved%201_1-34743-1-1.7z?fid=1000027146&ttl=1535812816&ri=8192&rs=8192&setec=d8e1d3552120631dcb7d4a0de2b061a7"
    }
  ]
}