{
  "modId": 34795.0,
  "modName": "Learn Alchemy From Recipes",
  "summary": "Your character can learn the ingredient effects required to craft potions from alchemy recipes",
  "descriptionHtml": "[color=#66CCCC][size=5][b][u]Description[/u][/b][/size][/color]\r\n\r\nVanilla recipes are useless, but with the help of this mod your character can learn ingredients effects just by reading alchemy recipes, and if you collect the ingredients needed for the potion, the alchemy workbench will display the corresponding menu to craft it, instead of having to remember the ingredients yourself.\r\n\r\nThis Mod fixes some mistakes on vanilla recipes and it adds the following new recipes to vendors:\r\n\r\n[color=#8C99C2][list][*]Fortify Barter\r\n[*]Fortify Health\r\n[*]Fortify Heavy Armor\r\n[*]Fortify Light Armor\r\n[*]Fortify Lockpicking\r\n[*]Fortify Magicka\r\n[*]Fortify Marksman\r\n[*]Fortify Smithing\r\n[*]Fortify Sneak\r\n[*]Fortify Stamina\r\n[*]Regenerate Health\r\n[*]Regenerate Magicka\r\n[*]Regenerate Stamina\r\n[*]Resist Magic\r\n[*]Restore Stamina\r\n[*]Waterbreathing\r\n[*]Frenzy\r\n[*]Slow[/list][/color]\r\nFor a better immersive experience the following alchemy skill books can teach ingredients effects too:\r\n\r\n[color=#8C99C2][list][*]De Rerum Dirennis\r\n[*]Herbalist\\'s Guide To Skyrim (revised)[/list][/color]\r\nThe story of [i][color=#8C99C2]De Rerum Dirennis[/color][/i] has been changed, now the ingredients and potions of the story makes more sense, therefore you can craft the potions of the story if you have the corresponding ingredients.\r\n\r\nAll the recipes you buy or loot and the two edited skill books will have a little script attached to them, it will make your character learn the corresponding effects of the ingredients listed in the recipe in order to help you craft the potion you are reading about. There is no background process you have to worry about.\r\n\r\nWell, there is a problem, if you are not creating a new game, all your recipes you currently possess have to be converted to make them work with this mod, so you need a way to transform old recipes into new ones. I programed different approaches to fix this problem.\r\n\r\n\r\n[color=#66CCCC][size=5][b][u]Installation[/u][/b][/size][/color]\r\n\r\nI recommend installing this mod with [i]Nexus Mod Manager[/i] because I made a script to ease the installation. If you are installing it manually, choose the type of configuration you have and extract it into your [i]skyrim/data[/i] folder.\r\n\r\n\r\n[color=#66CC99][size=3][b]Different mod configurations[/b][/size][/color]\r\n\r\n[list][*][color=#BBFF77]Normal:[/color] You only need skyrim 1.9.32.0.8 or higher to make it work, you can try using it in a lower version of skyrim. In this version, at the initialization you will receive the [i]Manual to Renew Recipes[/i], it will have a script to help you convert your recipes every time you read it. If by any chance you lose the book, there is a copy in a chest near the alchemy workbench at [i]Breezehome[/i], there is another copy you can steal in a wardrobe at [i]Arcadias Cauldron[/i], and finally [i]Urag[/i] is selling a copy at [i]The College of Winterhold[/i].\r\n\r\n[*][color=#BBFF77]Normal Mod with Item Sorting compatibility:[/color] If you have an item sorting mod, just load this mod after the item sorting mod.\r\n\r\n[*][color=#BBFF77]SkyUI support:[/color] You will need skyrim 1.9.32.0.8 with SkyUI 3.4 installed, I did not test it in lower versions, but you can try it. In this version, SkyUI have a configuration mod page dedicated to renew your recipes, you just have to activate it, exit the menus, and all the recipes you are carrying will be converted.\r\n\r\n[*][color=#BBFF77]SkyUI support with Item Sorting compatibility:[/color] Same as regular SkyUI support, but you have to load this mod after the sorting mod.[/list]\r\nTo prevent any issues, make this mod the last one to load.\r\n\r\n\r\n[color=#66CCCC][size=5][b][u]How to Use[/u][/b][/size][/color]\r\n\r\nAfter a successful installation, just load your saved game, wait 10 seconds for initialization to kick in, while you wait, please don’t do anything that might be stressful to your computer, after that, a message will appear telling you that new recipes have been added to the game and all your old recipes you have in your inventory have been renewed.\r\n\r\nAfter the initialization messages, you only have to read an alchemy recipe to learn ingredient effects, as soon as you close the menus, a message will appear telling you that your character just learned new ingredient effects. \r\n\r\nDepending on your installation you will either have, a book or a SkyUI mod configuration page, with a script to renew recipes. This procedure is just in case you have more recipes in a chest or by any chance you get a recipe without the script to learn ingredients effects.\r\n\r\nIf this mod is not working you might need to load it last.\r\n\r\nNow [color=#FF8811]if you want to cheat[/color], there is a [i]Master Alchemist Recipe[/i] that will teach your character the effects of all the ingredients of the game, to get it you have to add it manually to your inventory.\r\n\r\nFirst, search of the ID number of the recipe with the following console command:\r\n\r\n[color=#EEFF77]Help \\\"Master Alchemist Recipe\\\" 0[/color]\r\n\r\nAdd the recipe to your inventory by replacing #### with the item ID:\r\n\r\n[color=#EEFF77]Player.AddItem #### 1[/color]\r\n\r\nFinally, you only have to read the recipe.\r\n\r\n\r\n[color=#66CCCC][size=5][b][u]Compatibility[/u][/b][/size][/color]\r\n\r\nThe mod is [color=#FF6622]incompatible[/color] with any other mod that changes the recipes or the alchemy skill books.\r\n\r\n\r\n[color=#66CCCC][size=5][b][u]Recommended Mods[/u][/b][/size][/color]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/29512]Swift Potion Reborn[/url]\r\nIf you want to take full advantage of the potions you create, this mod is really useful and easy to use.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/10012]Unread Books Glow[/url]\r\nA very cool mod, now there is no excuse to miss any skill book or recipe that is lying around.\r\n \r\n[url=http://skyrim.nexusmods.com/mods/31676]Better Alchemy Drops[/url]\r\nChanges the vanilla drop rate of ingredients, the majority of the changes helps not only to get more ingredients, it actually makes more sense, why can you only loot a single eye when the beast you just slayed have two?\r\n\r\n[url=http://skyrim.nexusmods.com/mods/10460]Weightless Ingredients[/url]\r\nI know this mod robes you a little bit of an immersive gameplay, but let’s face it, Skyrim is a little broken, and the menus don’t help much. This mod helps you to focus on crafting potions and getting on with your game quests, instead of passing items from your inventory to a chest and vice versa.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/34815]Master Alchemist Extras[/url]\r\nDownload this mod if you want only the cheat to learn the effects of all the ingredients. \r\n\r\n\r\n[color=#66CCCC][size=5][b][u]Credits[/u][/b][/size][/color]\r\n\r\n[b]Author:[/b] [color=#BBFF77]NeoRunek[/color]\r\n[b]Special Thanks to:[/b] [color=#BBFF77]Zeitz[/color] (Logo designer)",
  "categoryId": "78",
  "version": "1.0",
  "author": "NeoRunek",
  "createdUnix": "1365993095",
  "updatedUnix": "1365991378",
  "containsAdultContent": false,
  "uploadedBy": "NeoRunek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024503",
      "name": "Learn Alchemy From Recipes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "192",
      "fileName": "Learn Alchemy From Recipes-34795-1-0.7z",
      "uploadedUnix": "1365991378",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/92afdf36452cd5bcad4a8984e717cb29c291960b179a5b3f4a791f498e2d8532/analysis/1407522761/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Learn%20Alchemy%20From%20Recipes-34795-1-0.7z?fid=1000024503&ttl=1535812942&ri=8192&rs=8192&setec=e05cd32179745671f57ce5227493801c"
    }
  ]
}