{
  "modId": 34823.0,
  "modName": "Sleep in their Beds - Farkas and Vilkas Companions Edition",
  "summary": "Allows you to sleep in both the twins beds (even when they are in it) as well as removing the ownership tag from their items, so you can take their stuff without stealing it! Also adds several new idles throughout the inside & outside of Jorrvaskr.",
  "descriptionHtml": "It has always bugged me that even after marrying Farkas, I couldnt sleep in his bed or take any of his stuff. Afterall, a marriage should be about sharing, right? So I set about fixing that, which is why this mod came about.\r\n\r\n---WHAT THIS MOD DOES---\r\n- enables you to sleep in both Vilkas and Farkas bed even when they are sleeping in it already.\r\n*Note - gave Farkas a double bed to allow for room for two\r\n- removes ownership of the items in their rooms, so now you can take their stuff without having to steal it. (and if you find any Ive accidentally missed, please let me know!)\r\n- puts extra idles into various places in and around Jorrvaskr. Idles include:\r\nlute playing \r\ndrum playing\r\nreading\r\nsword polishing\r\ndrunken drinking\r\nwaving for attention\r\n\r\n---REQUIREMENTS---\r\nNone\r\n\r\n---PROBLEMS/COMPATIBILITY ISSUES---\r\nNone known - if you find any please let me know\r\n\r\n---INSTALL---\r\ndownload with NMM or for manual install, simply download, unzip and drop file into Skyrim/DATA directory\r\n\r\n---UNINSTALL---\r\nto uninstall manually, simply delete .esp file from skyrim/DATA directory\r\n\r\n=========================== FAQS===================================\r\n\r\n\\\\\\\\\\\\\\\"DO I NEED TO BE MARRIED TO THE TWINS FOR THIS TO WORK?\\\\\\\\\\\\\\\"\r\n- No, there is no marriage requirement. You should be able to sleep in their beds at anytime - even if you are not yet a Companions member, although you will need to be a member to be able to take their stuff without stealing it.\r\n\r\n\\\\\\\\\\\\\\\"WHY ONLY THE TWINS, AND NOT OTHER COMPANION MEMBERS?\\\\\\\\\\\\\\\"\r\n- Because they are the ones I spend the most time with. However, if I get enough requests, I may include Aela and/or Skjor in a future update\r\n\r\n\\\\\\\\\\\\\\\"WHY DID YOU INCLUDE EXTRA IDLES?\\\\\\\\\\\\\\\"\r\n- because I was tired of seeing them do little more than sit or stand around all the time. Now you may see any of the companions do something more exciting, like playing an instrument and just getting drunk! :P\r\n\r\n\\\\\\\\\\\\\\\"VILKAS DOESNT SEEM HAPPY THAT I CAN NOW TAKE HIS STUFF\\\\\\\\\\\\\\\"\r\n- Vilkas is rarely happy. Either ignore him or tell him to get over it - thats what I do\r\n\r\n======================================================================\r\n\r\nConstructive feedback and bug/issue reports are always welcome! Trolling IS NOT!\r\n\r\n==========================CREDITS==============================\r\n\r\nA HUGE THANKYOU to everyone who tested this mod for me! Your feedback, suggestions and support is greatly appreciated! :)\r\n\r\nand of course, credits and thanks to Bethesda for Skyrim and the Creation Kit!\r\n",
  "categoryId": "25",
  "version": "1.0",
  "author": "Lordess",
  "createdUnix": "1366022838",
  "updatedUnix": "1366022622",
  "containsAdultContent": false,
  "uploadedBy": "Lordess",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024563",
      "name": "fvbedownership",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "fvbedownership-34823-1-0.rar",
      "uploadedUnix": "1366022622",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8062d20dc9c04bb04edb5b543c5d6766277ade6eea113d42ef0fc57b93068b61/analysis/1407523325/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/fvbedownership-34823-1-0.rar?fid=1000024563&ttl=1535812988&ri=8192&rs=8192&setec=bccfee23ff259a5283c87c002702dc38"
    }
  ]
}