{
  "modId": 34825.0,
  "modName": "Thunderbolt Shout Package Spanish translation",
  "summary": "Traducción al español del mod \\\"Thunderbolt Shout Package\\\" de Enai Siaion.",
  "descriptionHtml": "[CENTER]\r\nTraducción al castellano del mod \\\"Thunderbolt Shout Package\\\" de Enai Siaion.\r\n[i]Esta traducción requiere del mod original:[/i]\r\n[url=http://skyrim.nexusmods.com/mods/27708]-Thunderbolt Shout Package-[/url]\r\n\r\n\r\n[LINE]\r\n\r\n[color=orange]DESCRIPCIÓN Y CARACTERÍSTICAS[/color]\r\n\r\n[/CENTER]\r\nTraducción del Mod \\\"Thunderbolt Shout Package\\\" de la conocida modder Enai Siaion autora de \\\"Apocalypse Spell Package\\\", mod de magia que figura entre los 100 mods más endorsados de todos los tiempos, disfruta de los nuevos poderes de tu Sangre de Dragón.\r\n\r\n\r\nUn conjunto de herramientas para el aprendiz de la Voz con 17 nuevos gritos y muchos artículos con los que mejorar la experiencia como Sangre de Dragón. Los gritos se crean mediante la combinación de gritos existentes, abriendo nuevos y poderosos efectos.\r\n\r\n[color=RoyalBlue]BALANCE[/color]\r\nLa mayoría de gritos de Skyrim son inútiles, Thunderbolt añade una nueva variedad de gritos ofensivos, defensivos y de apoyo con, por lo general múltiples efectos. Aunque por lo general son más poderosos que los gritos de Skyrim, el equilibrio es la clave\r\n\r\n[color=RoyalBlue]ALTA CALIDAD[/color]\r\nEl Thu\\'um no es magia normal, y los gritos deben reflejar esto. Cada nuevo grito Thunderbolt cuenta con gráficos y sonidos personalizados, algunos de sus efectos se asemejan a los hechizos de Skyrim.\r\n\r\n\r\n[CENTER]\r\n[color=orange]DONDE CONSEGUIRLOS[/color]\r\n[/CENTER]\r\n\r\n[list]\r\n[*]Los gritos nuevos se adquieren mediante el estudio de libros antiguos en Alto Hrothgar, pero esto no es más que el principio hasta ser un maestro en los gritos.\r\n[*]También podrás encontrar en la nueva estantería de Alto Hrothgar4 nuevos conjuntos de ropa para mejorar tu thu\\'um y un libro que te ayudará en la búsqueda de los gritos.\r\n[*]No olvides coger el amuleto de Señuelo Fantasmal que te permetirá aprender un grito único, solo disponible mediante este objeto\r\n[*][color=Crimson]¿La nueva estantería no aparece?[/color] Sal de Alto Hrothgar, abre la consola y escribe \\\"pcb\\\".\r\n[/list]\r\n[color=RoyalBlue]JOYERÍA, LOOT DEL MUNDO[/color]\r\nTodos los amuletos y anillos Thunderbolt son obtenidos por azar y se puede encontrar en cualquier lugar donde se puedan encontrar joyas al azar. \r\n\r\n[color=RoyalBlue]COMO SE ENLAZAN LOS GRITOS[/color]\r\nPara aprender o mejorar un grito debes:\r\n[list]\r\n[*]Conocer el grito requisito.\r\n[*]Desbloquear el grito con un alma de dragón.\r\n[/list]\r\nLee el libro del grito y se te informará de que \\\"Reconoces estas Palabras\\\". Cierra el menú y se te pedirá que sacrifiques un Alma de Dragón por cada palabra que se puede aprender. Si no tienes ningún Alma del dragón, no puedes aprender nuevas palabras.\r\n\r\nSi no sabes la palabra siguiente en el grito o no inviertes un Alma de Dragón en él, leyendo el libro te dirá que \\\"No estás familiarizado con estas Palabras\\\" y no ocurrirá nada.\r\n\r\n\r\n[CENTER]\r\n[color=orange]BUGS CONOCIDOS[/color]\r\n[/CENTER]\r\n\r\nEscudo Relámpago y Tierra Arrasada no enlazan bien durante Manto de Ventisca.\r\nLeer el mismo libro varias veces antes de cerrar el inventario dará lugar a varias peticiones para aprender la siguiente palabra(s). En realidad no pierdes las almas del dragón varias veces, así que esto es sólo una cuestión estética.\r\n\r\n\r\n[CENTER]\r\n[color=orange]COMPATIBILIDAD[/color]\r\n[/CENTER]\r\n\r\n[list]\r\n[*]Compatible con todos los mods que implementen escala de magia.\r\n[*]Compatible con todos los mods que modifiquen gritos existentes.\r\n[*]Compatible con Skyrim Redone, salvo por unos perks que afectan a armas en Tormenta de Relámpago y Disparo Certero, T3nd0 lo solucionará en la próxima actualización.\r\n[/list]\r\n\r\n[LINE]\r\n\r\n[i]En el siguiente enlace podréis encontrar más mods traducidos al español.[/i]\r\n[url=http://skyrim.nexusmods.com/mods/34137]Translations and mods to spanish in the nexus[/url]\r\n\r\n\r\n[b]Thanks to Enai Siaion for this mod.[/b]",
  "categoryId": "75",
  "version": "v1.03",
  "author": "Jalmpitt",
  "createdUnix": "1366024684",
  "updatedUnix": "1366024149",
  "containsAdultContent": false,
  "uploadedBy": "jalmpitt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024568",
      "name": "Thunderbolt - The Shout Package v1-03 Spanish",
      "version": "v1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58",
      "fileName": "Thunderbolt - The Shout Package v1-03 Spanish-34825-v1-03.rar",
      "uploadedUnix": "1366024149",
      "modVersion": "v1.03",
      "virusScanUrl": "https://www.virustotal.com/file/f9430e803a75ee4aac906caf24d5c2bd358953dc601769815c03790448ea8a5f/analysis/1407523443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thunderbolt%20-%20The%20Shout%20Package%20v1-03%20Spanish-34825-v1-03.rar?fid=1000024568&ttl=1535812991&ri=8192&rs=8192&setec=e30c540d4fc80298e68e32a39b338fbf"
    }
  ]
}