{
  "modId": 34849.0,
  "modName": "SnowValley Manor",
  "summary": "Adds a huge Manor west of Windhelm, complete with followers and merchants.",
  "descriptionHtml": "WARNING:\r\n-THIS MOD IS DESIGNED FOR STORMCLOAKS ONLY, IMPERIALS WILL BE ATTACKED ON SIGHT. NO JOKE.\r\n-THIS MOD REQUIRES MOST OF THE DRAGONBORN DLC TO WORK PROPERLY AND THE 1.9 UPDATE!.\r\n-ONLY CHESTS/CUPBOARDS AND ARMOR/WEAPONS SHOWERS ARE ALOUD TO BE CHANGED, REST OF THE CONTAINERS WILL RESPAWN DUE TO NPC\\'S NEEDING THEM.\r\n\r\nNow that i have that out of the way, let me introduce SnowValley Manor!, my biggest project to date.\r\n\r\nSnowValley Manor was a project built to house a perfect Navmesh building/outside and in. And also to give the player all the things he or she needs in one perfectly built spot.\r\n\r\nThe mod is far from finished but the \\\"foundation level\\\" is complete. Heres a list of to-dos:\r\n\r\n-Players bedroom not added yet, but the manor has plenty of beds so pick and choose for now.\r\n-Navmesh is 100% complete and i super follower friendly.\r\n-Mannequins can bug out if left with nothing on them, hoping this wont affect any player though.\r\n\r\n\r\nNow onto to meat of the mod. Lets talk features:\r\n\r\n-Fully scripted Follower included and lives in the manor by default.\r\n-Fully working and timed merchants inside, Blacksmithy/Apothecary and a Alchemist.\r\n-Fully scripted bard for your singing times!\r\n-Living quarters includes 4 beds for followers and Companions alike.\r\n-Kitchen with dynamic respawns.\r\n-Gigantic front hall for all your armor and weapon show offs. \r\n-Dynamic guards patrol and keep watch on the area.\r\n-Custom lighting by Countercruel.\r\n-Performance friendly 100% bug free!.\r\n-Intensly lore friendly with not too much detail but not too little; fits in perfectly to the world.\r\n-Crafting galore, from smithing to enchanting! your wishes have come true!\r\n-100% navmeshed for followers and merchants!\r\n-Dynamic front hall lighting a.k.a. When its nighttime the lighting in the room will change!.\r\n-Storage and armor showoff galore!\r\nAnd much much more!.\r\n\r\n---Changelog---\r\n\r\nV1. Release\r\n\r\nV2.1\r\nAdded Master bedroom, fixed some navmeshes. Fixed wallmounts and some bookcases. 100% complete now!",
  "categoryId": "67",
  "version": "V2.1",
  "author": "Countercruel",
  "createdUnix": "1366062734",
  "updatedUnix": "1366151003",
  "containsAdultContent": false,
  "uploadedBy": "countercruel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024837",
      "name": "SnowValley Manor V2",
      "version": "V2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7689",
      "fileName": "SnowValley Manor V2-34849-V2-1.rar",
      "uploadedUnix": "1366151003",
      "modVersion": "V2.1",
      "virusScanUrl": "https://www.virustotal.com/file/2f0c511c3be590af1f77213d6e3f7d6f22b42944b2ffff87de04769e640a498d/analysis/1407525809/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SnowValley%20Manor%20V2-34849-V2-1.rar?fid=1000024837&ttl=1535813032&ri=8192&rs=8192&setec=774b4bea491aba41f8918d51caf383e6"
    }
  ]
}