{
  "modId": 34858.0,
  "modName": "SKSE INI for those that dunno if they have it",
  "summary": "SKSE INI with tintmasks at 2048 for those that dunno if they need it. NMM install should work now.",
  "descriptionHtml": "WoW. 12000 downloads.  Many thanks to all who use this and endorsed. REMEMBER to post ANY new INI edits in the posts section so we can keep this up to date&#33;\r<br />\r<br />SKSE INI with tintmasks set to 2048 for the tattoos.  I take no credit for this one either.  Thank Tairensoul for it but I figured since it&#39;s not readily available and &#34;I&#34; could never figure out where it went I just made it a single download and safe with the current NMM install.\r<br />\r<br />FINE. This is NOT SKyrim Script Extender (SKSE)  It&#39;s an INI file FOR that program. Sigh.  \r<br />\r<br />SKSE can NOT be installed thru the Mod Manager.  It is a FRONT END loader FOR Skyrim and thus HAS to be installed into the main Skyrim folder with TESV.EXE.\r<br />\r<br />What SKSE does is allow for a LOT of cool and interesting mods to work with a MENU for customizations, enhance graphics capabilities, smooth video, etc etc...it depends on the PLUGIN you get to USE with Skse.\r<br />\r<br />I hope I explained things a little better. Grumph.\r<br />\r<br />Blessings to all.\r<br />Gramps.",
  "categoryId": "39",
  "version": "",
  "author": "Tairensoul",
  "createdUnix": "1366072819",
  "updatedUnix": "1391728444",
  "containsAdultContent": false,
  "uploadedBy": "Thorne67",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095679",
      "name": "SKSE INI should be NMM installable now",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "SKSE INI should be NMM installable now-34858-.rar",
      "uploadedUnix": "1391728444",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4c7f6c7f5bbfff47285dad8270d46787d79ac97b36416b20f3a264093a20d486/analysis/1407921939/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SKSE%20INI%20should%20be%20NMM%20installable%20now-34858-.rar?fid=1000095679&ttl=1535813046&ri=8192&rs=8192&setec=64197ae8c8b0fefe1a1ad8ecd52077c4"
    }
  ]
}