{
  "modId": 34865.0,
  "modName": "Naughty Steve and Followers",
  "summary": "Adds a variety of unique followers which include a \\\"technicolor psychopath who likes kids\\\" and a half-alive warrior with a war-torn face. More to come! Please Support!",
  "descriptionHtml": "-EDIT-\r\nAfter looking over my mod and the comments today, I agree this mod is very creepy. For people asking what the heck Naughty Steve is supposed to be, I will tell you now. He is the result of messing with the Creation Kit while bored. I descided I will make him as colorful as possible. Now, I\\'m going to add some more followers (much less creepy and maybe even more cool looking). I may even get them voice acted and add some quests. I\\'m still learning how to do all this modding stuff... it\\'s actually kinda hard.\r\n\r\nAdds a variety of unique followers which include a \\\"technicolor psychopath who likes kids\\\" and a half-alive warrior with a war-torn face. More to come! Please Support!\r\n\r\nSteves story: After getting his hobo licence revoked, Steve, who no longer was allowed to live on the streets, and his ugly son, Little Steve, were driven to madness. This madness caused Steve to bleach the skin of himself and his son\\'s skin as well. Also, he began to develop a wild, crazy, and defiling alter personality, and has come to be known as... Naughty Steve. Now, the psychotic drunkard and his son reside in the Falkreath inn waiting for either their next victims or the Dragonborn to come along. Have fun! This is my first mod so its kind of pointless... just figured I would put it here and see what happens. He\\'s whatever you think he is. This is my first mod and I havent done much with it. I\\'m planning to do more with this including voice acting, larger ingame backstory, quests (maybe even a quest to make him normal) and more Steves. I may even make little steve adoptable (it might look creepy since hes just a midget version of his father with a child voice) \r\n\r\nBubble\\'s story (added in 1.1) : You can say to an extent Bubble\\'s story is similar to a Skyrim version of Darth Vader (not a bad idea) gone wrong. Bubble was a prestigious Stormcloak warrior who was burned to death in battle. Having been resurrected by a wandering mage, the only thing keeping him alive is magic. He is a very powerful companion talented in both hand to hand combat and destruction magic.",
  "categoryId": "66",
  "version": "1.1",
  "author": "FedoraG",
  "createdUnix": "1366085777",
  "updatedUnix": "1366168164",
  "containsAdultContent": false,
  "uploadedBy": "fedoragamer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024730",
      "name": "Naughty Steve OLD",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "348",
      "fileName": "Naughty Steve-34865-1.zip",
      "uploadedUnix": "1366085248",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/cfb8a0aa929d6db63566a8182ef9463e7eed1bc68f7b5bf0db8fa6149a93e361/analysis/1407524891/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Naughty%20Steve-34865-1.zip?fid=1000024730&ttl=1535813057&ri=8192&rs=8192&setec=df5a92c1dc4b015656e20b02f1edeb1f"
    },
    {
      "fileId": "1000024886",
      "name": "Steve",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "670",
      "fileName": "Steve11-34865-.zip",
      "uploadedUnix": "1366168164",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/25564917b4095ee39d24101de137f27231e425a90d58a7600b7ad37e1bfa6ac6/analysis/1407526245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Steve11-34865-.zip?fid=1000024886&ttl=1535813058&ri=8192&rs=8192&setec=22578c98500f562090ad5bdbd75ee18b"
    }
  ]
}