{
  "modId": 34874.0,
  "modName": "Lorecompleting Goldbrand",
  "summary": "This mod will add goldbrand into skyrim in a way that is more immersive than that of those alternatives I have found sofar.",
  "descriptionHtml": "BTW: INSANITY\\'s GOLDBRAND HAS ALOT HIGHER RESOULUTION THAN THE PICTURE!\r\nTo find it: You need to do the DB questline, are you finished with it, you must add by console, or just use the insanitysorrow esp.\r\n\r\n\r\nThis mod will add goldbrand into the game, and also add some Lore, instead of just laying it in a dark cave, or any semi-LORE friendly quest. This will not do anything majorly game-changing, but it will not brek immersion.\r\n\r\nUnfortunately, it couldn\\'t be done; making a better texture and mesh-pack to that done by insanity, so you will need his textures and meshes that you can find here: http://skyrim.nexusmods.com/mods/15431. You just dw/l with manager and disable the Insanity-Esp-file, or manually, that you just delete the esp:P\r\n\r\nI made this mod for myself, but I remembered the moment I wanted such a mod, that I didn\\'t exist, and thus I would like to help others of which would have it, too.\r\n\r\nWhat the mod does:\r\n\r\nIt will add goldbrand into the game, with a really powerful enchantment, but not so powerful damage. That it would be something beautyful, and since something as soft as gold really doesn\\'t do well as swords the damage would rely on the wrath of boethiah, and her word to enforce that power.\r\n\r\nSPOILER:\r\n\r\nI said Spoiler, are you sure?\r\n\r\nPlease don\\'t?\r\n\r\nI am beggin you!\r\n\r\nDo not do this, you will destroy the fun.\r\n\r\nThere is nothing below, you may download if you wish.\r\n\r\nWhy do you do this?\r\n\r\nYou wouldn\\'t like to do this, I promise!\r\n\r\nI know you would like to have the details, but It would ruin everything :/, and thus If you want that, you may pm me, or just send a mail at: \\\" trengerjegenadresse@yahoo.com \\\".\r\n\r\nThanks for understanding I will not post the spoiler :P BTW; picture is from UESP.com, all copyrights to bethesda.\r\n",
  "categoryId": "55",
  "version": "1.1",
  "author": "TheFlamingDaedra ",
  "createdUnix": "1366112953",
  "updatedUnix": "1366113423",
  "containsAdultContent": false,
  "uploadedBy": "TheFlamingDaedra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024765",
      "name": "GoldBrandWiThLoRe",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "GoldBrandWiThLoRe-34874-1-1.rar",
      "uploadedUnix": "1366113423",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2087878e1de34ca78fa2baf102ea80bde89ddd1924b5640fa468dd35413e60fb/analysis/1407525137/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GoldBrandWiThLoRe-34874-1-1.rar?fid=1000024765&ttl=1535813067&ri=8192&rs=8192&setec=500323615d6fc2567544f30eed1ef807"
    }
  ]
}