{
  "modId": 34904.0,
  "modName": "Aetherium Gladiator Armor - Female -CBBE-",
  "summary": "Adds a new female-only Armor-Set with difficult  crafting-recipes, New Items like: Black Dye, Black Leather, Black Leather-Stripes, Aetherium Ingot, Aetherium Sticks, Aetherium Ocular.... ",
  "descriptionHtml": "Under Construction... 2.0 Text Work in Progress\r\n\r\n\r\nEnglish version powerd by Google... :D \r\n\r\nThis mod adds a new, not Lore-unfriendly  armor in the game. The armor has some glow-effeckts and is black in popular xD\r\n\r\nOriginally, this armor was made just for me, because I had love one hairstyle that is as good as any armor clipping and since this hairstyle my favorite hairstyle, I decided to give the hair an arms build xD\r\nanyway, since I was now pointed out several times that the armor \\\"looks real fucking good!\\\" I decided to refine it a bit and upload.\r\nEven though I much on the arms themselves have made, it remains by and large a Meshup whose component parts are of course quite the respective author. (Credits below)\r\nWhatever we come for the production:\r\nAre in many places Skyrim\\'s more or less hidden obviously lie some Aetherium bars. collect them, you will need them ;)\r\n\r\nFrom the bar you can craft the following: Aetherium sticks and Aetherium oculars the two things are what you need, the rest is really honest trifles, and lots of them.\r\n\r\nSo you can, for example, produced at any cooking place a black dye, can with her on tanning rack black leather and this in turn produced from black leather strips. Correct: you will need that. These are some steel, ebony and silver-ingots and you\\'ve already almost everything you need .. maybe some normal leather strips and Daedrahearts, then you should seek the Aetheriumsmithery. For there can craft her top, gloves and boots. For the boots no Aetherium needed.\r\n\r\nMake the whole you can but only if you first have to Dragonarmorperk, lvl 30, or 35 have (for top and gloves), and to this you must still be female.\r\n\r\nThe armor is made a little better than the dragonplate armor, but weighs just a little more. (Defenitiv not overpowerd)\r\n\r\nThe mod is completely in German, will on occasion also driven eventually translated into English by me, unless someone is faster than me xD\r\n\r\n\r\n### and in German ###\r\n\r\nDieser Mod fügt eine neue, nicht ganz Lore-unfreundliche Rüstung in das Spiel ein. Die Rüstung verfügt über einige Glow-Effeckte und ist in beliebten schwarz gehalten xD\r\n\r\nUrsprünglich war diese Rüstung nur für mich gedacht, ich hatte sie aufgrund einer Frisur erstellt, die so gut wie mit jeder Rüstung Clippte und da diese Frisur meine Lieblingsfrisur ist, entschied ich mich dazu eben um die Frisur eine Rüstung zu bauen xD \r\nwie auch immer, da mir nun schon mehrfach gesagt wurde das die Rüstung \\\"Echt verdammt geil\\\" aussieht hab ich mich dazu entschlossen, sie etwas zu verfeinern und hoch zu laden. \r\nAuch wenn ich vieles an der Rüstung selbst gemacht hab, so bleibt sie im großen und ganzen ein Meshup, deren Einzelteile natürlich ganz dem jeweiligen Author gehören. (Credits weiter unten)\r\nWie auch immer: Kommen wir zur Herstellung:\r\nIn vielen Orten Skyrim\\'s liegen mehr oder weniger offensichtlich versteckt einige Aetherium Barren herrum, sammelt sie ein, die braucht ihr ;) \r\n\r\nAus den Barren könnt ihr folgendes Herstellen: Aetherium Stäbe und Aetherium Oculare die beiden dinge sind das ausschlaggebene was ihr benötigt, der rest ist eigentlich ehr Kleinkram und davon jede menge. \r\n\r\nSo könnt ihr zum Beispiel an einer beliebigen Kochstelle ein schwarzes Färbemittel herstellen, mit dem ihr am Gerbergestell schwarzes leder und aus diesem wiederum schwarze Lederstreifen herstellen könnt. Richtig: Auch diese werdet ihr brauchen. Dazu noch einige Stahl, Ebenerz und Quecksiberbarren und ihr habt schon beinah alles was ihr braucht.. vielleicht noch ein paar normale Lederstreifen und Daedraherzen, dann solltet ihr die Aetheriumschmiede aufsuchen. Denn dort könnt ihr Oberteil, Handschuhe und Stiefel herstellen. Für die Stiefel wird kein Aetherium benötigt.\r\n\r\nDas ganze herstellen könnt ihr aber nur wenn ihr erstens den Dragonsmitheryperk habt, lvl 30, beziehungsweise 35 (für Oberteil und Handschuhe) habt, und dazu noch weiblich seid.\r\n\r\nDie hergestellte Rüstung ist ein wenig besser als die Drachenplattenrüstung, wiegt aber ebenso auch ein wenig mehr. (defenitiv nicht overpowerd)\r\n\r\nDer Mod ist komplett auf deutsch, wird bei Gelegenheit aber bestimmt noch irgendwann von mir ins Englische übersetzt, insofern nicht jemand schneller ist als ich xD\r\n\r\n----------------------------------------------------------------------------------------------------------------------\r\n\r\nCredits: Many thanks to MAK07, NPR and Caliente for the used base meshes.",
  "categoryId": "54",
  "version": "2.0.1",
  "author": "Rikushai",
  "createdUnix": "1366167548",
  "updatedUnix": "1367526258",
  "containsAdultContent": false,
  "uploadedBy": "Rikushai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000024884",
      "name": "Aetherium Gladiator Armor",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23801",
      "fileName": "Aetherium Gladiator Armor-34904-1-0.rar",
      "uploadedUnix": "1366167186",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3f11002eed77a8f18caa442d645a44adce2a06c328f6899751cd0d91bccf13d7/analysis/1407526243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aetherium%20Gladiator%20Armor-34904-1-0.rar?fid=1000024884&ttl=1535813106&ri=8192&rs=8192&setec=ae2e518c3da57c60fef41e397daecb8c"
    },
    {
      "fileId": "1000027228",
      "name": "Aetherium Gladiator Armor v2",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11568",
      "fileName": "Aetherium Gladiator Armor v2-34904-2-0.rar",
      "uploadedUnix": "1367310232",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/2643b80be1b903c254dee714203c646553bdddfeee1751ea6e661f7c67e5ac96/analysis/1407548127/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aetherium%20Gladiator%20Armor%20v2-34904-2-0.rar?fid=1000027228&ttl=1535813106&ri=8192&rs=8192&setec=e65607a0c7bd08f2b86769d39c392a22"
    },
    {
      "fileId": "1000027666",
      "name": "Aetherium Gladiator Armor v201",
      "version": "2.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "56044",
      "fileName": "Aetherium Gladiator Armor v201-34904-2-0-1.rar",
      "uploadedUnix": "1367526258",
      "modVersion": "2.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/3cff7c9f0301da337ef4e089c140420efdb3e05ac0cc373d3aac7e461120d876/analysis/1407551634/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aetherium%20Gladiator%20Armor%20v201-34904-2-0-1.rar?fid=1000027666&ttl=1535813107&ri=8192&rs=8192&setec=c76d2579182e8999e3498de7968408df"
    }
  ]
}