{
  "modId": 34931.0,
  "modName": "Honeyside Thieves Lair",
  "summary": "A Thieves-based add-on to the Riften based, player-purchased, home called \\\"Honeyside\\\", with a Nightingale Temple and shortcut to Ragged Flagon.",
  "descriptionHtml": "Honeyside Thieves Lair Mod for Skyrim.\r\n\r\nHello.\r\n\r\nThis Mod provides an extension to the basement of the Riften, \\\"Honeyside\\\", Player Home, located behind a secret door... that is not too hard to find.\r\n\r\nThe \\\"Thieves Lair\\\" is meant as a convenient hideaway for a member of the Thieves Guild, where he can cool his heels, plot his strategies, lay his plans, and change his gear... into the respectable front, or whatever role he needs to play at any given time.\r\n\r\nBut any player can live there, not only thieves, for the atmosphere is both pleasing and warm, safe and secure.\r\n\r\nLike any respectable Thieves Lair, there is a nice, shiny, trophy room that doubles as a shrine to the \\\"Gray Fox\\\".\r\n\r\nThere are other addons to Honeyside out there, but for me, they are all too little or too much... so, I decided to dust off my MOD-maker skills and have a go at it.\r\n\r\nThere are some \\\"keys\\\" lying around and that can be legitimately classified as being a cheat, but it is not expected that you will use them. They just add atmosphere and flesh out the idea of it being a thieve\\'s home.\r\n\r\nThere are no secret rooms just -yet!- but that _will_ change. There is no quest attached to it, but that might change too! depending on the availability of the time to do it... and of course... if there is a demand for it.\r\n\r\nThis is an extremely lightweight Mod that has no scripts or additional requirements.\r\n\r\nThere are a few Unique items in there, that I created for this Mod in particular, and that you will see nowhere else, though it requires no additional graphics or images... keeping the package small and memory usage, minimal.\r\n\r\nKeep in mind that this is a work in progress, so some parts and/or items, are incomplete.\r\n\r\n\r\nVersion Information\r\n\r\n0.95\r\n- Added a Nightingale Temple.\r\n- Added a secret tunnel to a hidden room where portals will be later added.\r\n\r\n0.90\r\n- Original release.\r\n\r\nInstallation instructions are in the \\\"readme\\\", but there is nothing special about it.\r\n\r\nThere are no known bugs, but I am only one person...\r\n\r\nFeedback, as with all Mods, is appreciated. 8)\r\n\r\nThis is my first go at a Skyrim Mod; I do hope that you enjoy it.\r\n\r\n... And if you do like it, then do not hesitate to \\\"Endorse\\\" it.\r\n\r\nEnjoy.\r\n\r\nPS\r\n\r\nYou cannot reuse this MOD without permission and you cannot upload it elsewhere or make it available through any other means other than through Nexus.",
  "categoryId": "67",
  "version": "0.95",
  "author": "Thomas C",
  "createdUnix": "1366235606",
  "updatedUnix": "1366727799",
  "containsAdultContent": false,
  "uploadedBy": "Thomas_C",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025027",
      "name": "HThievesLair_090_-oldversion",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26",
      "fileName": "HThievesLair-34931-0-9.zip",
      "uploadedUnix": "1366229506",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/472b3cd61ea52bef73cbc010ffa747ee8b94f930561936d245dbd75ef14b51ad/analysis/1407527485/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HThievesLair-34931-0-9.zip?fid=1000025027&ttl=1535813143&ri=8192&rs=8192&setec=ac978773453a12c2aece2c0ab104cd07"
    },
    {
      "fileId": "1000026052",
      "name": "Honeyside Thieves Lair version 0_95",
      "version": "0.95",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Honeyside Thieves Lair version 0_95-34931-0-95.zip",
      "uploadedUnix": "1366727799",
      "modVersion": "0.95",
      "virusScanUrl": "https://www.virustotal.com/file/b808571d21284a7b5fa7afc6743cbb51915a55e10986fd1a2f69bd4ed6c4595e/analysis/1407536309/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Honeyside%20Thieves%20Lair%20version%200_95-34931-0-95.zip?fid=1000026052&ttl=1535813143&ri=8192&rs=8192&setec=004781641aae0319dbfb8b0cc2473c24"
    }
  ]
}