{
  "modId": 34948.0,
  "modName": "What Mjoll Replacer",
  "summary": "This is my first mod to publish, just made some changes to Mjoll\\'s face and hair. She\\'s a sexy lioness now.",
  "descriptionHtml": "I\\'m new to modding, and NPCs were my starting point. This is my first to publish because it\\'s my favorite so far.\r\n\r\nUpdate: 5/10/2013 I had some issues with the other face/body textures, so I tried out [url=http://skyrim.nexusmods.com/mods/35267//?]SG Female Textures Renewal[/url] by Hello Santa and used the [url=http://skyrim.nexusmods.com/mods/30759/?]UNP Texture Blender[/url] by Svarog to clear up the minor seams. Worked perfectly! Added one screenshot of it.\r\n\r\nUpdate: A couple days ago I began trying new body and face textures, only to find out that most combinations, even so-called compatible versions, caused worse neck seam issues than I had to begin with. Then I stumbled on this:\r\n[url=http://www.darkcreations.org/forums/files/file/578-alt-navetsea-unp-seamless/]Alt Navetsea UNP Seamless[/url]\r\nThis guy had already done everything I was trying to do! The install is even scripted for NMM installation. Very easy, and it WORKS. Warning: Link Is NSFW\r\n\r\nUpdate: You can check out my second mod here [url=http://skyrim.nexusmods.com/mods/35109]What New Companion - Sera[/url]\r\n\r\nUpdate: I\\'ve added some new screenshots, hopefully more appealing to the eye. If you like this mod, upload some of your own!\r\n\r\nIf you like it, but want a small change like hairstyle, warpaint, etc, I might be able to do that for you. Although it might be faster to do it yourself ;]\r\n\r\nInstall:\r\nExtract to your Data folder, overwrite .nif or .dds (if you have/had another Mjoll replacer).\r\nMake sure you have it \\\"checked\\\" in Data Files on the Skyrim Launcher.\r\nDelete the files to uninstall.\r\nOR, hopefully you can use NMM to install.\r\n\r\nKeep this below follower mods in the load order, but this really shouldn\\'t conflict with anything. It only changes her face and weight.\r\n\r\nRequirements:\r\n\r\n1. Skyrim patch 1.8 or higher\r\n2. [url=http://skyrim.nexusmods.com/mods/10168]ApachiiSkyHair by Apachii[/url] V 1.5 Full\r\n\r\nI\\'m not sure how this will work with other mods, but I can tell you what I use, and what was used in the screenshots: (I have a perfectly stable game right now with dozens upon dozens of mods, so I don\\'t really want to screw it up with random tests for this)\r\n\r\n1. The above \\\"Requirements\\\" \r\n2. [url=http://skyrim.nexusmods.com/mods/6709]DIMONIZED UNP Female Body by dimon99[/url] Warning: Link is NSFW\r\n3. The armor in the screenshots is: [url=http://skyrim.nexusmods.com/mods/30416]Inpou by Neo by Meister aka Neovinci[/url]\r\n4. Some of the screenshots use: [url=http://skyrim.nexusmods.com/mods/35092]ApachiiSkyHair natural Retexture by Aron[/url]\r\n\r\nOther Info:\r\nFrom my limited experience, it helps to make a clean save before installing. Especially if you have just uninstalled another Mjoll replacer prior to installing this one. Once installed, you can start game and save again, exit, start game again.\r\nI\\'m no expert, but once you\\'ve installed, if you aren\\'t seeing the correct changes, you can try opening up the console, clicking on Mjoll, and typing setnpcweight 0-100, (0 being the least amount of weight, 100 being the highest) you should see the change in weight and hopefully the correct appearance changes as well. \r\nIf you don\\'t, or if it goes horribly wrong, exit without saving and load it up again. I\\'m pretty sure I have her weight set at 30. \r\nYou can also type resurrect after clicking her, just make sure you take any items you\\'ve given her away from her before doing this, and see if this fixes the problem.\r\n\r\nCredit:\r\nTo all the authors of the mods listed above, and to their co-authors as well. Thanks for some great mods!",
  "categoryId": "33",
  "version": "1",
  "author": "SeaverWhat",
  "createdUnix": "1366323858",
  "updatedUnix": "1366323742",
  "containsAdultContent": false,
  "uploadedBy": "SeaverWhat",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025166",
      "name": "What Mjoll Replacer",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "848",
      "fileName": "What Mjoll Replacer-34948-1.7z",
      "uploadedUnix": "1366323742",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/dcbd04b4430372c320a6651f89b01c5df31fb036255aa77fdc79c1f6d81e1dae/analysis/1407528775/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/What%20Mjoll%20Replacer-34948-1.7z?fid=1000025166&ttl=1535813166&ri=8192&rs=8192&setec=dd9fd9fc710e2fb678ebc044388441a9"
    }
  ]
}