{
  "modId": 34956.0,
  "modName": "Begin At Your Best",
  "summary": "Created on Skyrim 1.9.32.0.8 with all DLC\\'s running\r\n\r\nStart the game as a real Dovahkiin!",
  "descriptionHtml": "Created on Skyrim 1.9.32.0.8 and uses the Legendary status for skills, so will need to be run on 1.9 or higher\r\n\r\nThis is just a save file I have spare as something fun to muck around with.\r\nIt is also a clean save (Skyrim and Offical DLCs only). \r\n\r\nThe game is saved inside Helglen (however the first escape from Helglen mission is completed).\r\nHowever this character is level 250 and has every single perk (except for Steady Hand (archery perk, slows time when zoomed) this is due to missing 2 perk points, and I personally can\\\\\\'t stand that perk)\r\n\r\nThe character is a Male Brenton, however if you use the ShowRaceMenu Mod (http://skyrim.nexusmods.com/mods/20394) you can change that and the name to be whatever you would like :)\r\n\r\nThis character comes with no weapons or clothes/armor.\r\nBut does know all spells and shouts (including DLCs) and knows all Enchantments for armors and weapons.\r\n\r\nPLEASE NOTE:\r\nIn the comments people have been saying all quests completed.\r\nI am not sure what is causing this, however, I just tried downloading this myself, I extracted the file from the zip folder and copied it into C:\\\\Users\\\\(accountusername)\\\\Documents\\\\My Games\\\\Skyrim\\\\Saves and opened skyrim, the file appears as save 045 Skyrim within skyrim\\'s load menu (even if you already have a save 45 they will just both appear there even if you rename the file) it opened fine, and no quests had been stared or completed.\r\nHope this works for everyone else! :)",
  "categoryId": "43",
  "version": "1",
  "author": "Migit78",
  "createdUnix": "1366287456",
  "updatedUnix": "1366268611",
  "containsAdultContent": false,
  "uploadedBy": "Migit78",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025091",
      "name": "Begin At your Best",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1516",
      "fileName": "Begin At your Best-34956-1.rar",
      "uploadedUnix": "1366268611",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e2abc5919db2f3be3576144f7b59a776c05543fc52eec0cc7f4f8dde7a0c7f02/analysis/1407528004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Begin%20At%20your%20Best-34956-1.rar?fid=1000025091&ttl=1535813186&ri=8192&rs=8192&setec=aa08d9c6d4c0acc537e20d499fdb9f49"
    }
  ]
}