{
  "modId": 34959.0,
  "modName": "Skyrim Tycoon - Reloaded",
  "summary": "A new way to make money, through capturing places and fighting four other factions for the economic control of Skyrim. A game within the game ! - Now with new optional features that modify the way you level up.",
  "descriptionHtml": "[center][img]http://img11.hostingpics.net/pics/639680SkyrimTycoonNewBack.png[/img][/center]\r\n[center][img]http://img11.hostingpics.net/pics/882668overview.png[/img][/center]\r\n\r\nIn my opinion, Skyrim has a problem with gold. It\\'s too easy to get rich, and I wanted to have a \\\"parallel\\\" way to make money in the game. But it was necessary to avoid overwhelming the player and keep the exploration feeling intact. \r\nSo the first thing Skyrim Tycoon does is to [b]drastically[/b] decrease the buy/sell values of barter, the looted gold and the quests rewards. Now if you want to win more precious Septims, you will have to capture, conquer and defend 34 places against four other factions, two of which being \\\"active\\\" and playing like you.\r\n\r\nThis mod is a long experience. There are two distinct times. The first one is when you have to gather resources and manufacture products to capture more places, because every places ask for specific items and produce different resources. In the meantime, you will have to improve your HQ and your places to defend them or increase your possibilities. For example, you can build a Dark Room to hire spies and scout/rob/sabotage/conspire against your two main enemies.\r\nAlso, you have to keep an eye on the loyalty of the people you \\\"own\\\", because... well, you don\\'t own them, they are Nords and they always can revolt and take back control of the place.\r\n\r\nThe second time is the war! Building an army is very expensive and it\\'s not easy to destroy every defense levels of a place. So you will have to level up your soldiers, manage losses tolerance depending on the situation and conquer strategic places, without being too threatening, because bandits are always nearby...\r\n\r\nKeep in mind that this mod has been made considering a new fresh player. Even though it\\'s possible to play it with your favorite characters, [color=Blanchedalmond][b]it\\'s highly recommended to start a new game to enjoy the learning curve.[/b][/color]\r\n\r\n\r\n[center][img]http://img11.hostingpics.net/pics/508653installation.png[/img][/center]\r\n\r\nThis mod requires no DLC, but it requires [url=http://skse.silverlock.org]SKSE[/url] and [URL=http://skyrim.nexusmods.com/mods/3863/?]SkyUI[/URL].\r\n\t\r\nTo [color=red]install[/color], place all the files into your ...Skyrim\\\\Data folder.\r\n\\\"Skyrim Tycoon - Reloaded - StandAlone Option - Less Gold In Dragonborn.esp\\\" is an option ; you do not require this file and this has no dependency to the main mod. It simply reduces gold you receive from rewards and loot in Dragonborn. Recommended if you have the DLC.\r\nBecause this mod is a deep gameplay change, it\\'s recommended to load it after all others (at the end of the list).\r\nTo launch the mod, read the note from your brother in your inventory.\r\n\r\nTo [color=red]uninstall[/color], you can only \\\"disable\\\" the mod. Uninstallation is not recommended.\r\n\r\nTo [color=red]update[/color] from a previous version, you just ovewrite the old files with the new ones. No clean save/install required.\r\n\r\n\r\n[center][img]http://img11.hostingpics.net/pics/736121compatibility.png[/img][/center]\r\n\r\nThese game settings have been changed : [i]fBarterBuyMin, fBarterMax, fBarterMin, fBarterSellMax[/i]. That\\'s why shoppers are now really tough businessmen.\r\nI modified some leveled lists regarding looted gold and quests rewards. These are important changes and shouldn\\'t be ovewritten by other mods.\r\nUpdate 1.3 : the \\\"Merchant\\\" perk has been changed.\r\n\r\nFollowing mods are known to be incompatible : \r\n\r\n[list]\r\n[*]None\r\n[/list]\r\n\r\nOtherwise, it should be compatible with everything, because it\\'s 99% scripts.\r\n\r\n\r\n[center][img]http://img11.hostingpics.net/pics/744221issues.png[/img][/center]\r\n\r\n[list]\r\n[*]I use a quest with many many objectives to show the informations you need on your world map, so when the core mod is activated (after the first quest), you will see objectives scrolling during quite a long time. That can be avoided by saving/reloading immediately.\r\n[*]There are no voices recorded, so you have to force subtitles in the Display menu.\r\n[*]Some players don\\'t have any dialogue available from the Dark Elves of Windhelm. I can\\'t reproduce the bug, so if you find the solution, please post it in the comments section. There\\'s a Quickstart mode for those who can\\'t complete the initial quest.\r\n[/list]\r\n\r\n\r\n[center][img]http://img11.hostingpics.net/pics/171235othermods.png[/img][/center]\r\n\r\n[URL=http://skyrim.nexusmods.com/mods/31377][img]http://img11.hostingpics.net/pics/406512banniretbb.png[/img][/URL]\r\n[URL=http://skyrim.nexusmods.com/mods/37042/?][img]http://img11.hostingpics.net/pics/698925banniresurvive.png[/img][/URL]\r\n[URL=http://skyrim.nexusmods.com/mods/37816/?][img]http://img15.hostingpics.net/pics/888189bannireweightedarrow.png[/img][/URL]\r\n\r\n\r\n[center][img]http://img11.hostingpics.net/pics/229877tips.png[/img][/center]\r\n\r\n[list]\r\n[*]If you don\\'t know what to do at the beginning, take a look at the sheet included in the mod\\'s archive. You\\'ll find first places you can capture with the resources you have, depending on your initial choice. For example, if you choose to capture Hollyfrost Farm, you\\'ll be able, after some time (and some shipments full of resources), to take either Chillfurrow or Corpselight, because these two require the resources produced by Hollyfrost.\r\n[*]The ledger has an essential button : \\\"What Should I Do ?\\\". Use it often, along with summaries (inside the Sky UI menu).\r\n[*]Taverns produce beers every time a new shipments comes. Improving it will produce more beers, and that can be an easy way to make more money, or capture places such as Steamscorch Mine, which requires 300 beers. Furthermore, as soon as you reach the level 3, you will receive +20 Influence as an achievement\\'s reward.\r\n[*]After capturing a place, you should consider improving it with a level 1 defense as soon as possible. It has around 150 health points, and without any defense, you just have around 20 HP.\r\n[*]For this reason, you should always prioritize acquiring of stones and wood.\r\n[*]Don\\'t try to make higher level soldiers as soon as you are able to make an army. Prefer few level 1 soldiers, that you will send to the enemy\\'s places with a minimum losses tolerance, to level up.\r\n[*]Attack level 3 and level 2 defenses to harass your enemies. They will loose many stones trying to rebuild. Those defenses can do a lot of damage, but they are weak and easily destroyed. The AI uses this technique. Also, instead of wasting stones rebuilding expensive defense 3 level, you should keep a defense level 1 sometimes : this is the lowest attack priority for the AI (and the one that does the least damage).\r\n[*]If you send two groups at the same place, the defense level of the defenders is reset between the two battles ; so don\\'t expect having more power. The \\\"Multi Group\\\" feature is essentially here either to send two groups at different destinations, or to send two big groups of soldiers (12-18) to be sure to destroy two defense levels in a short time period.\r\n[*]Plotters sent to places you controlled can\\'t be killed, even if they fail their mission.\r\n[*]Contracts block both natural loyalty decrease and enemy plotters trying to reduce it. This is a very important improvement in middle game.\r\n[*]Renegade bandits will always join the less threatening faction\\'s army. The East Empire Trading Company being less agressive, they often receive such bonus, and slowly grow a dangerous army.\r\n[*]If you don\\'t need some resources, see if you can\\'t manufacture them into products at the crafting workbench (next to the overwiew table). A product is always more profitable than a resource.\r\n[*]All the mod is working in real-time, meaning that it\\'s useless to wait or rest in hope of speeding up the process. Note that when you are in menus, time stops (except when you manufacture).\r\n[*]When winning a battle, Defenders gain loyalty. \r\n[*]When a specific number of places have been captured (28), Imperials and EETC become much more agressive, wanting to capture and conquer all remaining places.\r\n[*]The achievement [i]Transmission of Knowledge[/i] is interesting : it can increase your Maximum Spies by 1.\r\n[*][i]Be Popular[/i] (+1 max scribes), [i]The Path To Mastery[/i] (+1 max scribes), [i]Versatile[/i] (+35 expertise points) and [i]Greedy[/i] (+20 Influence) are also important, especially if you play with Buy Your Skills on. These are the first four achievements on the right column.\r\n[*]When you conquer a new place (by the force), improve its defense to the level 1 as soon as possible. The AI will target defensless places first.\r\n[/list]\r\n\r\n",
  "categoryId": "79",
  "version": "1.52",
  "author": "Joubarbe",
  "createdUnix": "1366284151",
  "updatedUnix": "1374310111",
  "containsAdultContent": false,
  "uploadedBy": "Joubarbe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034902",
      "name": "Less Gold In Dragonborn",
      "version": "1.00",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Less Gold In Dragonborn-34959-1-00.rar",
      "uploadedUnix": "1371644885",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/1cf6fb65668ee2687c6024b46eecb4c7570295556b2f1d246538f757cf3fd209/analysis/1407609251/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Less%20Gold%20In%20Dragonborn-34959-1-00.rar?fid=1000034902&ttl=1535813189&ri=8192&rs=8192&setec=2f74d4a814f16e2ea1321666086d6607"
    },
    {
      "fileId": "1000038540",
      "name": "Skyrim Tycoon - Reloaded",
      "version": "1.52",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18682",
      "fileName": "Skyrim Tycoon - Reloaded-34959-1-52.rar",
      "uploadedUnix": "1373630106",
      "modVersion": "1.52",
      "virusScanUrl": "https://www.virustotal.com/file/545a82f539713afbc4cc2cae1e4c54b70aac5a86a8579fb0190b186203d0ad7a/analysis/1407640599/",
      "changelogHtml": " - Now you can launch three types of research missions to receive better books : Prudent (cost : 10 Influence) - Careless (20) - Foolhardy (30).\r<br />- Defense level will decrease when you conquer a place with Defense level 1 (like it should...).\r<br />- Loyalty&#39;s fluctuation when a battle is won (for the attackers) have been reduced (/ 1.5 instead of 2.0) and has been increased when a battle is lost (* 1.2 instead of 1.1).\r<br />- Added another tutorial for the commander, explaining that destroying Defenses of level 1 or 0 will let you conquer the place.\r<br />- Deleted in-game menu help topics (incompatibilities and outdated).\r<br />- Fixed the orientation of a fermentation tank.\r<br />- Some achievements are easier to complete. (Stubborn and Back And Forth).\r<br />- Logistics Improvements don&#39;t require field-glasses anymore.\r<br />- Armours and Weapons don&#39;t require wood anymore. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Tycoon%20-%20Reloaded-34959-1-52.rar?fid=1000038540&ttl=1535813190&ri=8192&rs=8192&setec=2ee96ea2fca71c01d1269a18082d0b5c"
    },
    {
      "fileId": "1000039774",
      "name": "Skyrim Tycoon - Reloaded --- Loose Files",
      "version": "1.52",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "45732",
      "fileName": "Skyrim Tycoon - Reloaded --- Loose Files-34959-1-52.rar",
      "uploadedUnix": "1374310111",
      "modVersion": "1.52",
      "virusScanUrl": "https://www.virustotal.com/file/aad3a1d03c3cdf32ec83f3efbdb058462330aef88272e325ef2f9f63c13d9de8/analysis/1407650196/",
      "changelogHtml": " - Now you can launch three types of research missions to receive better books : Prudent (cost : 10 Influence) - Careless (20) - Foolhardy (30).\r<br />- Defense level will decrease when you conquer a place with Defense level 1 (like it should...).\r<br />- Loyalty&#39;s fluctuation when a battle is won (for the attackers) have been reduced (/ 1.5 instead of 2.0) and has been increased when a battle is lost (* 1.2 instead of 1.1).\r<br />- Added another tutorial for the commander, explaining that destroying Defenses of level 1 or 0 will let you conquer the place.\r<br />- Deleted in-game menu help topics (incompatibilities and outdated).\r<br />- Fixed the orientation of a fermentation tank.\r<br />- Some achievements are easier to complete. (Stubborn and Back And Forth).\r<br />- Logistics Improvements don&#39;t require field-glasses anymore.\r<br />- Armours and Weapons don&#39;t require wood anymore. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Tycoon%20-%20Reloaded%20---%20Loose%20Files-34959-1-52.rar?fid=1000039774&ttl=1535813190&ri=8192&rs=8192&setec=ed6bfed1931edc6e763ecc4411c841ce"
    }
  ]
}