{
  "modId": 34967.0,
  "modName": "Dragons of Legend",
  "summary": "Dragons are now as fearsome as the legends surrounding them.",
  "descriptionHtml": "[size=5][B][center]Dragons of Legend[/center][/B][/size]\r\n\r\nThe aim of this is to make Dragons a bit more fearsome as many of us were a bit surprised by how easy they can be, plenty of mods fix this but too many do so many different and unnecessary things. I just never found the perfect one that truly kept in line with the vanilla game.\r\n\r\nI have changed Dragons in such a way that the \\\"Regular\\\" Dragons you generally start seeing at about level 10 onwards, now possess abilities, stats and level completely Identical to the Legendary Dragons, while progressing in strength as you go up in the types of Dragons you encounter.\r\n\r\nGreat care has been taken to ensure that the Stats and abilities are scaled and increased exactly as they are in the vanilla game by their same amounts. For example, if a Blood Dragon has 15% More HP than a regular Dragon, then that is still true, only that it\\'ll now be that much deadlier as the default Dragon started off much stronger.\r\n\r\nI must warn you guys that if some of you don\\'t appreciate NPCs around Towns/villages being killed then this mod is probably not for you, a regular Dragon more or less completely decimated everything around Windhelm during the 30+ minute long test battle to take it down, this was on Normal difficulty, those of you who enjoy playing on Legendary Difficulty, I\\'m curious to find out how things go and hope you understand that not \\'every\\' scenario has been tested, therefore I can\\'t say for sure exactly how dangerous Legendary Dragons are, other than the fact they simply are.\r\n\r\nEnjoy your Dragons.\r\n\r\n[B]Required:[/B]\r\nSkyrim 1.9.32.0.8 or later\r\nDawnguard\r\nDragonborn",
  "categoryId": "24",
  "version": "1.0",
  "author": "Foxhound Commander",
  "createdUnix": "1366302520",
  "updatedUnix": "1366301423",
  "containsAdultContent": false,
  "uploadedBy": "foxhound commander",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025135",
      "name": "Dragons of Legend",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "Dragonsoflegend-34967-1-0.7z",
      "uploadedUnix": "1366301423",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bed56b98938e092913f8b9a09739dcd62c6a2eef5aa6f0e8951b0c2cd4286012/analysis/1407528484/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonsoflegend-34967-1-0.7z?fid=1000025135&ttl=1535813200&ri=8192&rs=8192&setec=ba6420f5f25e385b723afce618730da6"
    }
  ]
}