{
  "modId": 34993.0,
  "modName": "Iron Man Mk6 WIP",
  "summary": "Iron Man Mark 6 Suit - Work in progress",
  "descriptionHtml": "Armor Rate: 90 \r\nWeight: 25 \r\nValue: 2000 \r\nNo special abilities. \r\n\r\nStill to do: \r\nFix in first person view (add arms to hands) \r\nImprove Textures / Normal Maps \r\nEnchantable \r\nCraftable \r\nMaybe a spell but I would prefer you just download another mod for this \r\nThere won\\'t be flying function, so check this out: \r\nhttp://skyrim.nexusmods.com/mods/15775 \r\n\r\nThere will also be some optic improvements but not at the moment. \r\n\r\nThe suit is located in the East Empire Warehouse near Solitude. \r\n\r\n~ I finally came to release my ironman mark 6 suit. The mesh was all made by my own and if you have critics please keep in mind that it was a lot of work and the best I was able to do. I hope you have fun with it, and if you like it please vote with thumbs up :) \r\nI added WIP to the title so it should be more clear that this is not the finished suit, I have just released it so you can finally play it. \r\nPlease don\\'t tell me what I have to do next or what I should change on the Ironman, I have looked on it for many hours and know all the see through parts and that the textures are not very well. I will fix these things in time. If you did not read this and still post \\\"Add some textures\\\" or \\\" I can see through it\\\" I will delete the comment, and for the trolls of you who still think they have to write somethign like that: I\\'m neither amused nor bothered by these comments, so spare your energy and let it be. \r\n\r\nI know that it is still not perfect but I will update this mod from time to time to improve the suit. \r\n\r\nPost pics, post videos, I\\'m happy about everything i can see. \r\nIf you want to modify this mesh please contact me first.",
  "categoryId": "54",
  "version": "0.1",
  "author": "Motch1391",
  "createdUnix": "1366378076",
  "updatedUnix": "1366374717",
  "containsAdultContent": false,
  "uploadedBy": "Motch1391",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025272",
      "name": "MK6",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2411",
      "fileName": "MK6-34993-0-1.zip",
      "uploadedUnix": "1366374717",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/8ea3b81a19f881b0657a4ad089f00e8db3d3b218743d11fd6edfa4e5170caeac/analysis/1407529574/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MK6-34993-0-1.zip?fid=1000025272&ttl=1535813243&ri=8192&rs=8192&setec=a54ecc5644515a4087647229d6c7907f"
    }
  ]
}