{
  "modId": 35.0,
  "modName": "Full Item Guide",
  "summary": "Tnor from CheatHappens has put a lot of effort into creating a full item guide for all things in the game. \r\n",
  "descriptionHtml": "PLEASE NOTE THIS GUIDE ONLY COVERS THE PRE DLCGAME, AS SUCH IT HAS NOT BEEN UPDATED TO COVER DAWNGUARD/HEARTHFIRE/DRAGONBORN\r\n\r\nGUIDE UPDATED TO V3.30\r\n\r\nThis took me A LOT OF work. I initially received the Collector\\'s Edition from Bethesda Softworks on 10/28/2011. I am distributing this for free and not exclusively through CheatHappens (unlimited + limited members alike) Please thank me..it would be nice to know my work isn\\'t going unnoticed lol! This guide is SEARCHABLE (cntrl f). PLUS: You can also copy/paste the entire guide to anywhere else (for other forums etc etc). Please give credit back to me. (Tnor)\r\n\r\nUPDATE: I ADDED A DEDICATION GUIDE. AwakenedJay, this guide is for you.\r\n\r\nInstead of 1.40, I was motivated by AwakenedJays quote and have included THE EASIEST Dragon Souls console method.\r\n\r\nPlease note: This method took me 30 hours to find and test. I would appreciate any and all thanks.\r\n\r\nThis is the FINAL V3.0. I will update it, but this is DEFINITIVE. Ingredients, Soul Gems, and finally DRAGON SOULS METHOD has been added.\r\n\r\nTake care everyone, please keep thanking me. I do read them all.\r\n\r\nGod Bless.\r\n\r\nOh one last thing: If you use the command \\\"psb\\\" in your console (player spell book - grants every spell, shout, etc to a player) note it may not work with all shouts. There are only 75 shouts, but the PSB gives 120. The rest are experimental, and can and WILL not work OR crash your game entirely. Try to stick to ones with recharges and DESCRIPTIONS.\r\n\r\nFYI: To use souls, make sure you UNLOCK the shouts. You have to USE the souls to unlock shouts otherwise it will say \\\"Dragon Souls needed to Unlock shouts.\\\"\r\n\r\nAlso...make sure you are OUT of the beginning level (underground Helgen escape)\r\n\r\n-Michael / Tnor\r\nnewskyborn@live.com",
  "categoryId": "39",
  "version": "3.30",
  "author": "Tnor",
  "createdUnix": "1321052917",
  "updatedUnix": "1323939962",
  "containsAdultContent": false,
  "uploadedBy": "nathanb16",
  "primaryFile": null,
  "files": [
    {
      "fileId": "10640",
      "name": "Full Item Guide V3 30",
      "version": "3.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1161",
      "fileName": "Full Item Guide V3 30-35.zip",
      "uploadedUnix": "1323939962",
      "modVersion": "3.3",
      "virusScanUrl": "https://www.virustotal.com/file/455d856d703d9bfbec884248ba3054e3f67f735d5fbaca8e9e45510fa3bafc06/analysis/1406520663/",
      "changelogHtml": " More Tpyo fixes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Full%20Item%20Guide%20V3%2030-35.zip?fid=10640&ttl=1535752550&ri=8192&rs=8192&setec=bdd69670c6c688ccd41ed6334c260023"
    }
  ]
}