{
  "modId": 35016.0,
  "modName": "Breezehome Enhanced - For ENB or RLO users",
  "summary": "Provides with useful stuff (enchanting table, chests, blacksmith...) in Breezehome without adding a single more room, I don\\'t like basements. Not Heartfire compatible, and you need to have Lydia dead first (I\\'ll explain why). Also improves the lighting system (especially for RLO/ENB users who probably can\\'t see s**t).",
  "descriptionHtml": "First of all, I\\'d like to apologize for my filthy-French-coward English.\r\nI have the famous RLO and ENB mods, which look fantastic but really make it hard to see in many cells (I had to use a torch in my own house!) and I thereby felt the urge to add some light in my house, that I can, after all, tweak as I want since it\\'s mine. Lakeview Manor can\\'t be modded, so I\\'ve chosen to bring a couple of changes to Breezehome which, furthermore, has a good position for a non-fast traveller like me. But I also noticed, as a lot of you probably did, that it missed a lot of utilities. I downloaded many mods to change that, but some of them were just too heavy for my poor SSD-less computer (like Robinsage\\'s amazing \\\"Brilliant Breezehome and Burrows\\\") or excessive for a little, modest house like it should be. I still wanted it to look simple and realistic. I took all of this in consideration and made my own mod, which is, by the way, the first I ever made.\r\n\r\n\r\nHere\\'s a list of all the adds/changes I\\'ve made:\r\n- 1 enchanting table, 2 small barrels for Empty and Filled soul gems ;\r\n- Lydia is in my opinion very annoying, so i killed her, removed all of her room\\'s furniture and replaced it with all you need for blacksmithing, plus a chest and a barrel, except the smelter (way too big, you\\'ll have to use the one in Warmaiden\\'s).\r\n- Shrine of Zenithar (better speech for better prices);\r\n- 5 more chests;\r\n- 1 more alchemy satchel, for your precious ingredients;\r\n- 1 more shell under the stairs instead of these ugly, useless barrels;\r\n- Removed all objects that tend to fly across the room when you\\'re not watching (plate under the rabbit legs, pot on the entrance\\'s shell...) and replaced by aesthetic ones that will suit your house;\r\n- Several horns, candles, etc. to light up the ensemble.\r\nThat\\'s pretty much it. Needless to say, all the new recipes are perfectly safe.\r\n\r\nINSTALLATION :\r\nKill Lydia (outside your house, unless you want to keep with you her hot body forever...), and take everything you have put in the house\\'s recipes (or I can\\'t guarantee it\\'ll be there when you come back), then get out, save and quit the game. \r\nAfter that, just add it on your Nexus Mod Manager (I personnally always do it manually).\r\nIt may crash a time or two at the beginning when you try to get in, or are inside and doing random stuff, but don\\'t worry, that won\\'t last. \r\n\r\nCOMPABILITY ISSUES:\r\nNot that I know of, but it will obviously probably conflict with any other mod that changes Breezehome, so make sure you disable them first. \r\nAs written above, NON-Hearhfire friendly. \r\nI have the 1.9.32.0.8 update, but since I haven\\\\\\'t enabled it in the creation kit you shouldn\\'t need it.",
  "categoryId": "67",
  "version": "1.0",
  "author": "TheHappyBiatch",
  "createdUnix": "1366455655",
  "updatedUnix": "1366471260",
  "containsAdultContent": false,
  "uploadedBy": "TheHappyBiatch",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025485",
      "name": "Breezehome Enhanced - RLO and ENB",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Breezehome Enhanced - RLO and ENB-35016-.rar",
      "uploadedUnix": "1366471260",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/6c137d442a4c283d0f0f95f333b0fb9d62803a977fa71773b833b550293cb024/analysis/1407531245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20Enhanced%20-%20RLO%20and%20ENB-35016-.rar?fid=1000025485&ttl=1535813274&ri=8192&rs=8192&setec=464ef86b9d2f9cb162ff2db23d0a316b"
    }
  ]
}