{
  "modId": 35013.0,
  "modName": "Tolpan",
  "summary": "Tolpan Barfuss (Tolpan the Kender) DRACHENLANZE (DRAGONLANCE)",
  "descriptionHtml": "Hi there,\r\n\r\nas a big fan of Margaret Weis and Tracy Hickman and the amazing Dragonlance epos, here is my attempt to create  \r\nthe kender Tolpan Barfoot from the Dragonlance books. Now i find, he looks so nice, so i would like\r\nto share him to the Nexus community, because the forum has given me so much inspiration, that i try to give something \r\nback to the community. But i am not a modder, so I dont want to change him anymore, because i have spend many many \r\nhours to give him the kender-look, although the only race i found to create this look was  the dwemer race. Feel free to modify him further.\r\n\r\nPlease keep in mind: This is only a simple savegame of a character i have createt just for\r\nfun and would like to share it with you. This is no kender race, only dwemer! And: i am no modder.\r\n\r\nTolpan is smaller as the most people, you will meet. He loves colored clothes and his biggest treasure are his many many little and big bags for his founded things ... most of you will say: PREY ! :) Maybe you will try to use a bags-mod.\r\n\r\nTolpan is now level 4 in Riverwood. He is a small Kender (Dwemer: the power looks good to a kender, they are friends of all animals. Tolpan has got the Thief-Stone-Power. He comes with some clothing and leather armor and shield. Weapons: -sorry, there is no Hupack - only Quarterstaff (Immersive Weapons Mod), Sword, Bow, Dagger (clipping is possible, because i have changed the size of Tolpan himself and the size of the weapons and quiver.)\r\n\r\nDont worry, if you see the reference of missing mods. I have installed more as a view of them, but the only mods you need, to make tolpan look like in the screenshots i have noticed here. SKSE and the Editors are very important! Please post your screenshots  with a start of Tolpan without this modules - i have never tested it. \r\n\r\nHave a lot of fun with my firsst posted savegame. I hope, you have much fun with Tolpan :)\r\n\r\nPlease comment and endorse if you like him :) \r\n\r\nDrangonlance:\r\nhttp://en.wikipedia.org/wiki/Dragonlance\r\n\r\nKender:\r\nhttp://en.wikipedia.org/wiki/Kender\r\n\r\n\r\nThe mods are installed on my skyrim (Awesome mods. All Credits go to that wonderful modders): \r\n\r\nskse_1_06_09 for Skyrim 1.8.151.0 \r\nhttp://skse.silverlock.org/\r\n\r\nRaceMenu by Expired\r\nhttp://skyrim.nexusmods.com/mods/29624/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D29624\r\n\r\nEnhanced Character Edit by ECE team\r\nhttp://skyrim.nexusmods.com/mods/12951/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D12951\r\n\r\nXCE - Xenius Character Enhancement by Xenius\r\nhttp://skyrim.nexusmods.com/mods/2356\r\n\r\nFine Face Textures for Men by Urshi \r\nhttp://skyrim.nexusmods.com/mods/27815Fine  \r\n\r\nimproved skyrim eyes by missjennabee\r\nhttp://www.loverslab.com/topic/13302-improved-eyes-skyrim-by-missjennabee/\r\n\r\nFor the clothes-texture in the screenshots:\r\nElaborate Textiles - NPC Clothing Retexture by Miss Obsidienne\r\nhttp://skyrim.nexusmods.com/mods/19826\r\n\r\nRecommended:\r\n\r\nBandolier - Bags and Pouches by Dragten\r\nhttp://skyrim.nexusmods.com/mods/16438\r\n\r\nFor the Quarterstaff: Immersive Weapons by Hothtrooper44 - Ironman5000 - Eckss \r\nhttp://skyrim.nexusmods.com/mods/27644\r\n\r\nMaybe try (not tested jet, but sounds good for a kender)\r\nQuarterstaff by JZBai\r\nhttp://skyrim.nexusmods.com/mods/25431/?tab=3&navtag=%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D25431\r\n\r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "NexusLeo",
  "createdUnix": "1366407463",
  "updatedUnix": "1366406428",
  "containsAdultContent": false,
  "uploadedBy": "NexusLeo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025353",
      "name": "Savegame Tolpan",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2048",
      "fileName": "Savegame Tolpan-35013-1-0.zip",
      "uploadedUnix": "1366406428",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/82947f8d15cb990da09c5512d48d7b438e15b1a0ca932312bc9db3e3f291af57/analysis/1407530176/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Savegame%20Tolpan-35013-1-0.zip?fid=1000025353&ttl=1535813271&ri=8192&rs=8192&setec=69b7d73a030a87196da50d661a57028f"
    }
  ]
}