{
  "modId": 35027.0,
  "modName": "Nvidia Quadro Win7x32 Hacked Gaming Drivers",
  "summary": "STABLE and tested with Win7x32 Quadro 320M and FX1600M video, 1 Gig ram and T7200 Intel Cpus.  Various games tested by users. Check forum page.  Win7x64 not supported. Vista unknown. I don\\'t own it.",
  "descriptionHtml": "This is NOT a Nvidia Corp drivers. It is a hacked gaming driver for Quadro based machines. Tested on HP Quadro based laptops only so I cannot say exactly what else it will work on.  You MUST do a clean install.  Skyrim has been tested and ran stable with several mods, including modified HiResTexturePacks.\r\n\r\nIt is a STABLE no frills, no extras driver. So far it works with all games. NOT for cad use at all. You\\'ll need a dual boot OS.\r\n\r\nSEE FORUM FOR WORKING GAMES SO FAR...SKYRIM, OBLIVION, MORROWIND, COUNTERSTRIKE SERIES, TORCHLIGHT, DIABLO, DUNGEON SIEGE, AND LEFT 4 DEAD 1, L4D2 tested...buggy but works.\r\n\r\nFor this driver to work with games like Skyrim (tested) VSync MUST be enabled.  This can be done with Skyrim Configurator. Tested with and without. \r\n\r\nhttp://skyrim.nexusmods.com/mods/814\r\n\r\nI do NOT have Left4Dead games so I am unable to test for you. My grandchildren aren\\'t scheduled to visit until Christmas 2013 and I can post test results then.\r\n\r\nIt\\'s taken me since Skyrim first came out to find a stable driver to work with the Quadro cards so I\\'m uploading it here based on the GNU licenses as I found only ONE site worldwide with a working driver.  Thought this worked with Win7x64 but it doesn\\'t.  Still can NOT, after YEARS...find any working x64 drivers for Quadro graphics that are stable.\r\n\r\nIf ANYONE finds a STABLE Quadro x64 driver, multi OS platform, PLEASE upload to nexus, with site admin permissions.  BTW... LaptopVideo2go drivers haven\\'t been updated and don\\'t work anymore.\r\n\r\nIf site moderator feels this is in violation of rules please inform me for immediate removal but it\\'s dam near impossible for people running Quadro based machines to play games.  THIS one WORKS with Skyrim so I hope you\\'ll allow it to stay.\r\n\r\nFinally, I don\\'t do STEAM or Forums in general. I have a hard enough time at my age trying to figure out how to do things just here at the site I consider home for me. Nexus only.\r\n\r\nBlessings to all gamers, modders and the Nexus group.\r\n\r\nGramps",
  "categoryId": "39",
  "version": "",
  "author": "Unknown",
  "createdUnix": "1366437643",
  "updatedUnix": "1366437363",
  "containsAdultContent": false,
  "uploadedBy": "Thorne67",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025406",
      "name": "Nvidia Quadro Hacked Gaming Driver",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34702",
      "fileName": "Nvidia Quadro Hacked Gaming Driver-35027-.zip",
      "uploadedUnix": "1366437363",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c77574dbb0b157e1eb1c20112b8f6fb91cda6ab81c7ae20feffe7066c35ed4f0/analysis/1407530658/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nvidia%20Quadro%20Hacked%20Gaming%20Driver-35027-.zip?fid=1000025406&ttl=1535813289&ri=8192&rs=8192&setec=0dc803f5a6d32be83fd1783efff6b827"
    }
  ]
}