{
  "modId": 35042.0,
  "modName": "Sinding Follower",
  "summary": "This mod makes Sinding, the character from the daedric quest Ill Met By Moonlight, a follower. ",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center]\r<br />\r<br />A request from the Nexus forums to make Sinding, from the daedric quest Ill Met By Moonlight, a follower. \r<br />\r<br />This one took some tweaking to get working, therefore DO NOT INSTALL THIS MOD UNTIL YOU HAVE FINISHED THE QUEST &#34;ILL MET BY MOONLIGHT&#34;&#33;\r<br />\r<br />Now, the fine print. Sinding&#39;s voice type did not allow him to become a follower, so I had to change it. Since I also planned on making him marriageable, that only gave me one voice type to choose. But it doesn&#39;t sound out of place, so I don&#39;t think it&#39;s much of a problem.\r<br />\r<br />As a follower, I left his stats untouched, so he is a one-handed warrior. He will however level up with you. He starts off with just his rags, so be sure to give him some nice equipment&#33; My skills on the Creation Kit are not amazing so I don&#39;t think he&#39;ll transform into a werewolf at will (I don&#39;t even know if that&#39;s possible), but in the recommended links section you can find some mods that will help you out with that. \r<br />\r<br />For the very fine print, the follower Sinding is a copy of the original, since I didn&#39;t want to mess with any scripts or quests. This may mean he will not have dialogue regarding his condition or quest when you talk to him. Not much to do there I&#39;m afraid, since, again, his voice type would not allow him to follow you. The original Sinding and his werewolf form (they are individual entities in the game) have been placed in a platform underground to keep them out of sight, but don&#39;t be surprised if you happen to meet Sinding on the road even if you have him follow you&#33; And yes, this means that, if you chose to slay him, this follower version will still be there if you decide to install this mod for whatever reason.\r<br />\r<br />You can meet your new pal at Banehallow Cave, a small dwelling inside Bloated Man&#39;s Grotto. The cave is fully navmeshed, but the containers are not safe&#33; \r<br />\r<br />Now, some recommended links for you: [url=http://skyrim.nexusmods.com/mods/11459/]Werewolf Followers[/url] should give you the option to have Sinding become a werewolf. [url=http://skyrim.nexusmods.com/mods/15524]Amazing Follower Tweaks[/url] gives this option as well. About great-looking armors, [url=http://skyrim.nexusmods.com/mods/34615]Mantle of the Silver Hand[/url] would be a great choice for human form, and  [url=http://skyrim.nexusmods.com/mods/26874]Werewolf Lord Armor[/url] will look amazing for beast form&#33;\r<br />\r<br />To install, place the files in your &#39;SteamSteamAppsCommonSkyrimData&#39; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp.\r<br />\r<br />My old save where I finished Ill Met By Moonlight is unfortunately damaged beyond repair, and I haven&#39;t gotten around to start it on my new playthrough, so I haven&#39;t been able to test this mod very thoroughly. Please, if there&#39;s any problem, let me know&#33;\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "66",
  "version": "1.00",
  "author": "Jokerine",
  "createdUnix": "1366463681",
  "updatedUnix": "1366463435",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025454",
      "name": "Sinding Follower",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "269",
      "fileName": "Sinding Follower-35042-1-00.rar",
      "uploadedUnix": "1366463435",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/e936b41e81e7a63486f95be3642a5f79d8c921b0cca2ce25eaa729ff32249227/analysis/1407531064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sinding%20Follower-35042-1-00.rar?fid=1000025454&ttl=1535813309&ri=8192&rs=8192&setec=63660642cbb286820b0affff02addd86"
    }
  ]
}