{
  "modId": 3505.0,
  "modName": "Nerulls Hardcore and Realistic mod",
  "summary": "",
  "descriptionHtml": "This is my first mod so be patient and please note nothing will be released until after the creation kit is released. Until then I ask my fellow gamers and modders to be patient and also to give their support. I could use any experianced modders and coders as I could use all the help I can get. Also if you wish to help out contact me at ramnoch@hotmail.com simply title te subject of the email \\\"about the mod\\\" so I know its you and not spam.\r\n\r\n\r\n                                                       Main features.\r\nNew survival perk tree. Allows for improvements on things such as running speed, jumping height and offers increased buffs from being well fed and rested.\r\n\r\nAdds hunger, hydration and sleep meters ingame much like in Fallout: New Vegas. Will offer the option to add or remove from your HUD at anytime ingame.\r\n\r\nAdds hundreds of new NPCs to Skyrim, many with unique dialogue options and side quests.\r\n\r\nAll NPCs both vanilla and new are not stuck to the walls of their homes. Occasionally they may travel by carriage or simply walk the world to other cities or villages.\r\n\r\nAdds many new random encounters such as a chance to happen upon a large caravans with 30+ NPCs consisting of travalers, merchants and body guards.\r\n\r\nAdds weather and enviromental effects such as hypothermia from ice cold water or even the chance to freeze to death in an icy blizzard.\r\n\r\nWill double or even triple all city sizes and will add dozens of villages.\r\n\r\nRemoves fast travel except for the city to city horse carriage system.\r\n\r\nAdds a chance when using the horse carrige system a random encounter will trigger causing the carriage and yourself to come under attack by bandits, wolves or worse.",
  "categoryId": "79",
  "version": "0.0.0",
  "author": "Nerull",
  "createdUnix": "1323738174",
  "updatedUnix": "1323738174",
  "containsAdultContent": false,
  "uploadedBy": "vrede666",
  "primaryFile": null,
  "files": []
}