{
  "modId": 35057.0,
  "modName": "Revampt ESP for Hentai Void Armor",
  "summary": "Some small revisions fixing some minor bugs/dislikes in the original file",
  "descriptionHtml": "Changes.                                                                                                                                             Raised base armor values  Cuirass 44 orig 24 Boots 20 orig 11 Gloves 15 orig 11, Moved the boots and gloves from misc section to hide in the forge menu,(now all pieces are listed together). Set the boots and gloves so they can be enchanted, Removed \\\"The Void  Hides You\\\" from the description (allows you to view enchantments on the cuirass) Installation. requires the original mod,(no meshes or textures included in this file) either down load and install with NMM (overwrite when prompted) Manual Unzip drag/drop data file to your skyrim file overwrite when prompted Credits: Hentai  Author of the original mod and zotman12 skyrim nexus version Notes: Should be compatible with Hentai Void Armor Cold Shoulder, and other Versions using the original ESP file. Recommended: Void Armor By Hentai UNPB-BBP Conversion by xp32 (meshes used in screen shot) Permissions: Please respect the original authors wishes(no posting to steam) has far as this file goes no permissions are necessary",
  "categoryId": "54",
  "version": "final",
  "author": "DRAGONJOE69",
  "createdUnix": "1366485272",
  "updatedUnix": "1366482874",
  "containsAdultContent": false,
  "uploadedBy": "DRAGONJOE69",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025529",
      "name": "HentaiVoid_FixedEsp",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "HentaiVoid_FixedEsp-35057-final.7z",
      "uploadedUnix": "1366482874",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1036e78bddaaa87b764c9f9f0300e7cd680edc0099f85cc28874b0ff54cef6b6/analysis/1407531456/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HentaiVoid_FixedEsp-35057-final.7z?fid=1000025529&ttl=1535813334&ri=8192&rs=8192&setec=3f0aaebf5d838cb35108463819ca515d"
    }
  ]
}