{
  "modId": 35051.0,
  "modName": "Compound Bow Collection",
  "summary": "Compound Bows Collections:\r<br />In this version, some improvements have been made and incorporated seven new models of bows and one arrow model.\r<br />",
  "descriptionHtml": "Compound Bows Collections:\r<br />In this version, some improvements have been made and incorporated seven new models of bows and one arrow model.\r<br />\r<br />All bows can be crafting in the forge on dwarven category and the arrow in misc category.\r<br />\r<br />THE BOWS\r<br />\r<br />Metal Compound Bow: Designed by Scatterface, though in order to achieve a more realistic animation had to delete a couple of components. Basically it is a compound bow metallic materials.\r<br />\r<br />Simple Metal Compound Bow: Designed by 3DSam79, is a simple compound bow as it has no sight or axle, consists of metal and carbon fiber.\r<br />\r<br />Predator Bow: By Marcos MC from Grabcad, the same bow of Crisis Game.\r<br />\r<br />Elder Compound Bow: This bow I&#39;ve seen in several places even in oblivion, the designer is unknown but the model is free on the web, this time I bring it under the name of Elder Compound Bow to fit more into the game.\r<br />\r<br />Dragon Skin Compound Bow: An assembly made for me with multipart obtained, the design itself is not the most optimal for an animation in Skyrim, the arrow is not in the position where it should be in real life but also looks bad, the bow have a visually appealing design with dragon skin texture and black metal.\r<br />\r<br />Bow Zingler: The same as in the previous version taken from Tomb Rider game.\r<br />\r<br />Wood Compound Bow: In the previous version was Arco compuesto, this time is wood texture. Also taken from Tomb Rider Game.\r<br />Carbon Fiber Compound Bow:  A bow with arbon fiber texture and metal, as the Dragon Skin Compound Bow design is not the most suitable for the animation of skyrim, for the body&#39;s curves bow the arrow looks more away from this but it is still a good design.\r<br />Simple compound Bow: Another simple compound bow that did not know how to name, textured metal and carbon fiber pulleys, and it gave me more work to convert it to Nif file because It had more triangles than an encyclopedia of geometry.\r<br />The arrow:\r<br />The design of the arrow corresponds to the same arrow that comes with the Predator Bow from Grabcad by Marcos MC, just textures have been changed to carbon fiber, feather hawk, the quiver was designed by my build on leather and black  metal, it can be crafting in the forge in the misc category. The arrow has no gravity, if someone wan it with gravity, send a message.\r<br />\r<br />Fixed:\r<br />\r<br />Bows no longer disappear if dropped.\r<br />\r<br />Was corrected the bow position in the character&#39;s hand to make it look more real taking them by their handles.\r<br />\r<br />A better distribution of the allocation of vertices to bones so that you can see the bow from any angle in the third person without any deformation (feel free to consult doubts about this because the tutorials out there are pretty basic and only conform to simple bow, compound bows are similar but different to see in the behavior of your animation.)\r<br />\r<br />Installation:\r<br />\r<br />Recommended install with NMM and overwrite files if prompted.\r<br />\r<br />Manually you can copy and paste the files from the Compound Bows Collection.rar in the Data folder of your game installation folder, if you have the old version and ask you to overwrite some files, do it, then activate the esp files from the data launcher.\r<br />\r<br />\r<br />Uninstall:\r<br />Use the NMM or delete the corresponding files in the data folder from the game installation folder.\r<br />\r<br />Permissions:\r<br />Feel free to use this mod in your mod, just always adding designers mentioned and me in the credits.\r<br />\r<br />Thanks:\r<br />\r<br />To Nicoroshi once again for your help.\r<br />To the designers of the bows and parts.\r<br />",
  "categoryId": "55",
  "version": "1",
  "author": "Alrock10",
  "createdUnix": "1366477345",
  "updatedUnix": "1393896540",
  "containsAdultContent": false,
  "uploadedBy": "Alrock10",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000099734",
      "name": "Compound Bow Collection",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33363",
      "fileName": "Compound Bow Collection-35051-1.rar",
      "uploadedUnix": "1393896540",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/99dcdbc2832dca513cb15fbe314906fc2e46dfbae6902b73b91851b1425de9dd/analysis/1407959391/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Compound%20Bow%20Collection-35051-1.rar?fid=1000099734&ttl=1535813326&ri=8192&rs=8192&setec=2b9180cfc5283b90fef13596afebdc1f"
    }
  ]
}