{
  "modId": 35078.0,
  "modName": "Lakeview Freehold- Tundra Defense and Pocket Empire Builder Compatible BETA",
  "summary": "Expands the Lakeview Manor area (Hearthfire required) to add a fortified flat terrain area with enhanced perimeter walls and core buildings for use with Tundra Defense, Pocket Empire Builder, or similar mods. ",
  "descriptionHtml": "This is the first mod I have made for uploading, and the tenth I have made overall (the other nine being personal mods). It is still in beta pending feedback from testers. [b][u]NOTE:[/u][/b] This is a work-in-progress mod being beta-tested. There have already been some issues that people have found, and I am correcting them as I get feedback, but please remember that this is not a finished mod. It is published for the purpose of testing and troubleshooting on various computers with a variety of mod mixtures to streamline it as best I can.\r\n\r\nThe premise of the mod is based in part on the Hearthfire storyline for Lakeview and in part on the lore from [url=http://skyrim.nexusmods.com/mods/28829]Hearthfire Expanded Homes Vaults and Lost Garden[/url] by Draco1122. \r\n\r\n[b]Overview[/b]: The Jarl of Falkreath grants his newest thane- this Dragonborn person, who is quickly making a name for themselves- land in the northernmost part of his hold along the shores of Lake Inalta. Banditry is a serious problem there, and thus the land grant is assumed to encourage the thane to build a fortified manor from which to project the Jarl\\\\\\'s power- at the Dragonborn\\\\\\'s own expense, of course. Little did the Jarl know that buried in the mountain on the site chosen for the manor is one of the many vaults of the original Dragonborn, built using Dwemer craft to be hidden from the outside world and keep his treasures safe. Workmen broke through into a tunnel leading to this vault when building the basement for Lakeview Manor, making the Dragonborn disgustingly wealthy overnight.\r\nNow, the choice is yours- be the mighty right arm of a pampered, spoiled little Jarl, defect with the northern third of Falkreath Hold to join Whiterun or another hold, or carve out your very own hold and become a jarl yourself? Designed to be used with village and fortress creation mods such as Tundra Defense and Pocket Empire Builder, this is a base platform mod on which to build using these others. For those handy with the Creation Kit, it can be used as a base for constructing a permanent city, as well. Future versions will include questlines and customized NPCs, but for now it is still in Beta stage testing and tweaking.\r\n\r\n[b][u]Videos[/b][/u]-\r\n[youtube]YUIxq_kCiS0[/youtube]\r\nShort Video Tour\r\n\r\n[youtube]UHlV1QO8HH8[/youtube]\r\nLong and Comprehensive Video Tour\r\n\r\n\r\n[b][u]Elements of the Mod[/b][/u]-\r\n\r\n[b]Perimeter Walls[/b]: The perimeter walls are far taller and more advanced than shoddy Imperial craftsmanship. Hiring the best craftsmen in Tamriel using a mixture of Dunmer and Redguard architecture, the perimeter walls are not only more aesthetically pleasing, but far tougher to crack. Internal halls with arrow loops allow defenders to attack enemies from protection, and working portcullis gates can be quickly shut from within. Thanks to Tamira and Stroti for the awesome models.\r\n\r\n[b]Mage\\\\\\'s Quarters and Library[/b]: The Tundra Defense version of this mod will not feature NPCs in these locations in beta. The Populated version will, however, and some of these may be ported over in a future update. These are for immersion to explain where all of the mage guard the player can summon using TD or PEB sleep, study, etc., and also gives magic-using, alchemist and enchanting characters a handy location to work their arts. Look for easter eggs in the library!\r\n\r\n[b]Temple of Talos[/b]: No crude temple hewn from rough rock here, the Dovahkiin of today gives honour to the Dragonborn who founded the empire and became deified. The interior is relatively simple to allow for furnishing mods to flesh it out, but the architecture is an evolution of Nord aesthetics as the new age looms. A general Temple of the Eight variant may be developed later for Imperial sympathizers ;-)\r\n\r\n[b]Blacksmith Shop[/b]: A basic functioning smithy complete with a blacksmith, this area allows smithing characters access to everything they need in one spot but a smelter (which may be added later).\r\n\r\n[b]Militia Barracks[/b]: Not only did the Dragonborn use the vast wealth uncovered to quickly build a vast fortified city around the manor granted by the Jarl, but troops were also recruited, trained and armed. These guardsmen and women live in two barracks, with the one in the Lower City being the primary one.\r\n\r\n[b]High Pass Outpost Barracks[/b]: Located above and south of the Upper City, High Pass Outpost is the barracks and base for the guarsmen and women who protect High Pass Gate, which leads to Falkreath to the south.\r\n \r\n[b]Harbour and Shipyard[/b]: Banditry on the road is a major threat, but as the shipwrecks on the floor of Lake Inalta can attest, some bandits use the water to attack villages and merchants. Countering this, the Dragonborn commissioned the creation of a fortified harbour and shipyard in which to build a new light fast-attack variant of longships. A lighthouse on the western arm of the harbour wall helps guide returning vessels find their way home in fog or darkness, and catapults give substantial firepower to smash and burn any attacking vessels.\r\n\r\n[b]Snekkja Longships[/b]: The snekkja (rough translation: \\\\\\\"thin and projecting\\\\\\\") was a class of Scandinavian longship, and was the smallest variant used in warfare. It was about 50\\\\\\'-55\\\\\\' in length (17m), 8\\\\\\'-9\\\\\\' wide (2.5m-3m), and a draft of only 1.5\\\\\\'-2\\\\\\' (.5m) from keel to waterline (Danish models were shallower, Norse were deeper and able to cross the Atlantic). It generally had 20 rowing benches with two men per bench (total crew compliment was 40 warriors rowing, one steering, and generally one or two lookouts in the bow and/or at the gunwale gauging depth). These were the most common type of longship, capable of both crossing oceans and sailing up shallow rivers. It is theorized that these vessels first came into use under Ragnarr Loðbrók (Ragnar Lothbrok) in the 8th century, and were in use well into the renaissance. This class of longship is the most common one seen in recreations, reenactments, movies, and television series focused around the Vikings, and were copied by many late Iron Age and early Medieval cultures the Vikingr came in contact with.\r\nBecause of the small size, fast attack design, decent cargo capacity and shallow draft of the snekkja, it seemed to make much more sense as the type of longship a military or armed traders would use on Lake Inalta. These ships can sail into every inlet and be ported by the crew over narrow stretches of land to bypass rapids and waterfalls, allowing the forces of Lakeview Freehold (or whichever hold the player chooses to side with) to project naval power and fast-transport anywhere there are rivers with half a meter or greater depth. I designed the snekkja using the Gokstad Longship mod by SLuckyD (with permission), and retextured the hull, sails (the black wolf head is my character\\\\\\'s crest, but I also figured it would work well for the Freehold as well), etc. He created a version of this that can move as well, but I am nowhere near the skilled modder he is, and will not implement that until I can work with him to make a viable version of it. This is in the cards, however, and eventually the player will be able to tool around Lake Inalta in one of these.\r\n\r\n[b]Lakeview Guards[/b]: Well-paid and fiercely loyal, these men and women are well-armed with custom lamellar armour and the best blades Eorlund Greymane could forge. They are excellent archers as well, and can handle themselves well. Unlike the guards of other holds, the Lakeview guards use a type of shield based loosely off of an Imperial design to protect them better.\r\n\r\n[b]Marketplace[/b]: The smith\\\\\\'s wife sells weapons and armour, a grocer sells excellent food, and a rather small but jovial Breton sells the finest meads and ales from his traveling merchant\\\\\\'s wagon. The magic vendor is still a work-in-progress, apologies for her being out of stock at the moment. A fourth sales kiosk is set up for the Tundra Defense merchant\\'s kiosk to be placed within it. To do this, merely line it up with the existing kiosk so that it can still be triggered, but is otherwise hidden within, and the TD merchant should work just fine. This also gets rid of the problem of the TD merchant walking into the middle of his kiosk, defying physics and phasing through solid matter.\r\n\r\n[b]Flat Terrain Areas[/b]: There are roads and dirt trails already laid out for you to place homes and building on either side, but the primary focus was to leave it as adaptable as possible for the personal tastes of the player. \r\n\r\n-------------\r\n[b] [url=http://skyrim.nexusmods.com/mods/22330]Tundra Defense[/url] [/b]\r\n-------------\r\nLakeview Freehold is designed for use with Tundra Defense in Advanced Settings mode. To do this, you access the Tundra Defense menu (apostrophe \\\\\\' key by default) and click Change Settings. Click [More] on the right twice, and then click the option to [Toggle Advance Mode]. At the top of the menu it should show Advanced Menu: 1. With this enabled, you can now build and place guards outside of the post boundaries, but raids will still spawn at the boundry markers. The perimeter curtain wall is larger than the boundaries, but early experiments with a smaller city still had raiders spawning inside the gates regardless. So, apply lots of patrol guards and static guards at key choke points such as gates, stairwells, etc. If you use the Guard Equipment Box, the shields and helmets used by Lakeview Freehold guardsmen are located in an armoury next to the gate leading the harbour quarter.\r\n\r\n-------------\r\n[b] [url=http://skyrim.nexusmods.com/mods/30948]Pocket Empire Builder[/url] [/b]\r\n-------------\r\nPocket Empire Builder is a simpler mod to initiate as it is largely quest-free. Merely activate it, buy it, build it, or just have it placed in you inventory, and start plopping buildings down. \r\n\r\n-------------\r\n[b] [url=http://skyrim.nexusmods.com/mods/22791]Home Construction and Decoration[/url] [/b]\r\n-------------\r\nI have not tested HCaD with Lakeview Freehold, but I am unaware of any incompatibilities at this time. I do know that it only really builds a handful of homes, and will leave the Freehold very, very empty.\r\n\r\n[b]TO DO LIST[/B]\r\n1) Add in a farmstead near Pinewatch\r\n2) Add an inn\r\n3) Add in aquatic homes in- and under- the harbour area for dock workers, including Argonians as requested\r\n4) Add in said dock workers\r\n5) Add in lore materials such as books, journals explaining where the wealth to build all of this came from, etc.\r\n\r\n\r\n[b]WISH LIST[/B]\r\n1) Get the snekkja in the harbour to function as a personal transport ship to tool around Lake Inalta\r\n2) Script epic raids and sieges\r\n3) Develop a trigger system so that the city isn\\'t already in place, but grows as the character spends wealth on it, buying sections at a time.\r\n4) Date Jewel Staite (what? It\\'s a wish-list, I can wish, can\\'t I? :P )\r\n\r\n[b]REQUIREMENTS[/b]:\tSkyrim 1.9 or higher, Hearthfire. \r\n[url=http://skyrim.nexusmods.com/mods/28829]Hearthfire Expanded Homes Vaults and Lost Garden by Draco1122 [/url] is not required but highly recommended to fit into the lore of the mod. A future update will include the journal of an archaeologist from Winterhold who first discovered the ancient vaults, and mysteriously disappeared.\r\n\r\n[b]CONFLICTS[/b]: Any mod that modifies the area around Lakeview Manor will likely conflict with this mod. The one exception I have found is [url=http://skyrim.nexusmods.com/mods/29467]Guards on Your Home- Hearthfire[/url], though the tents originally developed for the mod will poke through a few places. Either open Guards on Your Home in Creation Kit and delete the tents, bedrolls and fireplace (or move them to safe locations), or open the console ( ` key), click on the item (save prior to this just in case), type markfordelete, hit enter, close the console, repeat for each item sticking out, save the game in a new save and then load it. \r\n\r\n[b]CREDITS[/b]:\tInspired by and based on Lakeview Flats by [url=http://skyrim.nexusmods.com/users/1600388]Whpsh[/url].\r\nMeshes and Textures for walls, furniture and some houses by [url=http://skyrim.nexusmods.com/users/776954]Tamira[/url] and [url=http://skyrim.nexusmods.com/users/1657719]Stroti[/url].\r\nSnekkja-class longships based on a mesh created by [url=http://skyrim.nexusmods.com/users/3375677]SLuckyD[/url]\r\nVarious textures, clutter, etc. by [url=http://skyrim.nexusmods.com/users/1308288]Runspect[/url], [url=http://skyrim.nexusmods.com/users/2250922]Blarry[/url] (book, dish and scroll statics), [url=http://skyrim.nexusmods.com/users/2235573]Oaristys[/url] (coin stacks and such), and [url=http://skyrim.nexusmods.com/users/867382]Darkrider[/url] (paintings)\r\nArmour based on textures and meshes by [url=http://skyrim.nexusmods.com/users/3672571]PhilSchmidheiny[/url]\r\nThird floor library easter egg textures by [url=http://skyrim.nexusmods.com/users/1308288]BadGremlin[/url], who got a sadistic giggle out of its intended use :D\r\n\r\n[b]TROUBLESHOOTING[/b]:\tPost any issues you notice in the Issues and Bugs forum rather than the main one so that they will receive the prompt attention they need. Suggestions should go in the main forum. I run over 200 mods and Lakeview Freehold works well on my computer for the most part, but this doesn\\\\\\'t mean there won\\\\\\'t be mods that Lakeview Freehold won\\\\\\'t play nice with. Let me know what mods you figure out conflict with it so I can compile a list.\r\n\r\n---------------------------------------------\r\n\r\n[b]UPDATES[/B]\r\n---------------------\r\n0.2b- Added in patrols, cleaned up a few minor clipping and alignment issues with the southern curtain wall, added in a farmstead near Pinewatch, fixed (hopefully) the issue with constantly-aggressive merchant NPCs.\r\n0.2a- Fixed a few minor issues\r\n0.2- Cleaned up the Master File dependency on unneeded mods that was causing CTDs for some folks. Had a couple of ghost textures that weren\\'t showing in CK that I found through TESVEdit. Due to popular request, the Temple of Talos has now been expanded out to polytheism, and is a Talos-centric Temple of the Nine now. Did a bit of cleanup on terrain, added in a windmill, NPC merchant house for the apothecary (the armourer and blacksmith live in the smithy, and the grocer\\'s house is in the works for a future update). I also added in the Thane\\'s Office. The Tundra Defense Outpost Office can be placed over the existing if you wish, but this version was designed to give the Dragonborn a place to meet the citizens and handle business. \r\nThe High Pass outpost seems to have gone poof somehow, so that will be rebuilt for the next mod, and patrol AIs are currently being rebuilt and improved.",
  "categoryId": "68",
  "version": "0.2b",
  "author": "Breandan",
  "createdUnix": "1366531771",
  "updatedUnix": "1367437761",
  "containsAdultContent": false,
  "uploadedBy": "Breandan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025634",
      "name": "LakeviewFreehold_TundraDefense",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "441594",
      "fileName": "LakeviewFreehold_TundraDefense-35078-0-1.rar",
      "uploadedUnix": "1366530861",
      "modVersion": "0.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LakeviewFreehold_TundraDefense-35078-0-1.rar?fid=1000025634&ttl=1535813365&ri=8192&rs=8192&setec=175f6bd8634b8735b9432900d16d3cef"
    },
    {
      "fileId": "1000026542",
      "name": "LakeviewFreehold_TundraDefense_BETA-dot-two-A",
      "version": "0.2a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "589228",
      "fileName": "LakeviewFreehold_TundraDefense_BETA-dot-two-A-35078-0-2a.rar",
      "uploadedUnix": "1366972451",
      "modVersion": "0.2a",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LakeviewFreehold_TundraDefense_BETA-dot-two-A-35078-0-2a.rar?fid=1000026542&ttl=1535813366&ri=8192&rs=8192&setec=1dbd4562872de776750a444142186c66"
    },
    {
      "fileId": "1000027475",
      "name": "LakeviewFreehold_TundraDefense_BETA-dot-two-B",
      "version": "0.2b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "589236",
      "fileName": "LakeviewFreehold_TundraDefense_BETA-dot-two-B-35078-0-2b.rar",
      "uploadedUnix": "1367437761",
      "modVersion": "0.2b",
      "virusScanUrl": null,
      "changelogHtml": " Added in patrols in the Lower City and along curtain walls. <br/> \n cleaned up a few minor clipping and alignment issues with the southern curtain wall. <br/> \n Added in a farmstead near Pinewatch. <br/> \n Fixed (hopefully) the issue with constantly-aggressive merchant NPCs. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LakeviewFreehold_TundraDefense_BETA-dot-two-B-35078-0-2b.rar?fid=1000027475&ttl=1535813366&ri=8192&rs=8192&setec=67a0680d1a262f4b043db3ebbe8c9b2d"
    }
  ]
}