{
  "modId": 35082.0,
  "modName": "Vampire Bite",
  "summary": "Here\\'s the Vampire Bite, an enchanted iron dagger for all those that like me love to kill in stealthy way or prefer to use the bow as a primary weapon but having a good short second choice for melee combat.",
  "descriptionHtml": "Sorry for my not so good english, i\\'m italian...\r\nHere\\'s my first mod ever made so you\\'ll see that it\\'s very simple...\r\nHere\\'s the Vampire Bite, a custom enchanted iron dagger that player can forge at any forge under iron category and improve at the wheel like any other weapon in Skyrim.\r\nIt\\'s simple to craft it, because i used the same recipe as for the standard iron dagger, but you need also a vampire dust to make it.\r\nI made it a little overpowered for people like me that don\\'t like to arrive at 60 smithing point to can improve it and prefer to dedicate perk points at other skills, like sneak or magical skills, and because maybe there are some people like me that like to have the same weapons from the beginning, without passing from stronger weapon to stronger weapon, something like: \\\"it\\'s my lucky dagger\\\" :)\r\nAs the name suggests and thanks to his own enchantment, it absorb all the three Health, Stamina and Magicka so it could be useful against quite all kinds of enemies, and a good suited weapon for rangers, assassins, hunters and thieves characters or left hand weapon for duellists...\r\nNo DLC or specific Skyrim game versions are required for it.\r\nHope you enjoy it and if you like it endorse it!\r\n\r\nAlso available on Steam Workshop!\r\n\r\nFor permissions about this mod, look at the perms icon.\r\n\r\nAll credits and thanks to Bethesda for creating Skyrim and Creation Kit!\r\nThanks to Anduniel for her \\\"magical advice\\\"!\r\nThanks to Haldir307 for his tutorial on how to make armors and weapons standalone!",
  "categoryId": "55",
  "version": "1.0",
  "author": "Alduin78",
  "createdUnix": "1366543422",
  "updatedUnix": "1366543059",
  "containsAdultContent": false,
  "uploadedBy": "alduin78",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000025662",
      "name": "Vampire Bite",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "420",
      "fileName": "Vampire Bite-35082-1-0.7z",
      "uploadedUnix": "1366543059",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/413b5c3aafc2ee0bfdcf90a1ca98d1bede1de11f65d8da06510cfee550b95a3a/analysis/1407532768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampire%20Bite-35082-1-0.7z?fid=1000025662&ttl=1535813377&ri=8192&rs=8192&setec=c1083394ce6305b96f09f8a04271154a"
    }
  ]
}