{
  "modId": 35095.0,
  "modName": "Skyrim Avada Kedavra - Killing Curse",
  "summary": "Adds the killing curse from Harry Potter to the game. Purchase it from Farengar Secret-Fire.\r\n\r\nREQUIRES DAWNGUARD",
  "descriptionHtml": "This a small mod I created for use in another mod I am creating that adds the Avada Kedavra curse from Harry Potter to Skyrim, available for purchase from Farengar Secret-Fire.\r\n\r\nIt does not work quite like a normal spell though, as there are two different versions of it, each with different appearances and slightly altered characteristics. When you first buy the spell tome from Farengar (has a base cost of 10000 gold), you will get the lesser version of the spell. This looks exactly the same as paralyze, except for a green explosion created on impact, its meant to be like the green flashes the wizards produce when duelling. This version can be blocked by wards, absorbed and reasonably easily dodged. If the target does not do any of these things, they will be killed however, via script.\r\n\r\nThe second version of the spell is only available in one way. If you kill someone with the first version and still have at least 350 magicka, you will gain access to the second version of the spell. This version is a concentration spell (like flames or sparks) and its visuals are based on when Voldemort produces and especially powerful curse, such as when killing Harry or breaking Hogwarts protections during the film. You cannot block it, absorb it or easily dodge it as it is a concentration spell. It also creates a massive explosion on impact and will kill the enemy via script (neither will kill essential NPCS).\r\n\r\nNote that once you have unlocked the more powerful version of the spell, I have tried to make it difficult to spam (as both spells are already very unbalanced by nature) to make it less OP, if you kill someone with it and continue to cast it until you drop below 350 magicka, it should be replaced by the earlier version of the spell. Both spells are Illusion (I thought this appropriate as the description says they inflict brain death, and require the mastery-level illusion perk.\r\n\r\nAgain, BOTH SPELLS ARE UNBALANCED AS THEY KILL INSTANTLY, THIS MOD IS REALLY INTENDED FOR FUN OR ALREADY OP CHARACTERS.\r\n\r\nP.S Video is out of date, it only shows the powerful version, and the new powerful version has a bigger, brighter explosion. I may change this at some point.\r\n\r\nREQUIRES DAWNGUARD FOR POWERFUL VERSION HAND FX\r\n\r\nINSTALL:\r\n\r\nJust extract to your Skyrim Data Folder.\r\n\r\nBugs/Glitches:\r\n\r\nYou will not lose the more powerful version the instant you drop below 350 magicka, it may take a couple of seconds for the game to register the change.\r\n\r\n\r\nThis is the first mod I\\'ve decided to release for Skyrim, I hope it won\\'t be the last.",
  "categoryId": "75",
  "version": "1.1",
  "author": "Daedthr",
  "createdUnix": "1367074530",
  "updatedUnix": "1367144167",
  "containsAdultContent": false,
  "uploadedBy": "Daedthr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026748",
      "name": "Avada Kedavra Main",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "47",
      "fileName": "Avada Kedavra Main-35095-1-0.7z",
      "uploadedUnix": "1367073582",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5a44897e5631c60b7e9e8f43dd409236cce01bf05d801a5cd001c9af750fe0be/analysis/1407544203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Avada%20Kedavra%20Main-35095-1-0.7z?fid=1000026748&ttl=1535813404&ri=8192&rs=8192&setec=f0621be7e0f14d99502a224556158dbe"
    },
    {
      "fileId": "1000026859",
      "name": "Avada Kedavra Main",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48",
      "fileName": "Avada Kedavra Main-35095-1-1.7z",
      "uploadedUnix": "1367144075",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f7bb7eda5cd72f6af64d2955cfb0fdb9105f85a8c142f4c4381aadf7df1bea5e/analysis/1407545046/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Avada%20Kedavra%20Main-35095-1-1.7z?fid=1000026859&ttl=1535813404&ri=8192&rs=8192&setec=d1cb998f2f75c44122fed6060dce8b9b"
    },
    {
      "fileId": "1000026860",
      "name": "Old Version Bug Fix",
      "version": "1.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "1",
      "fileName": "Old Version Bug Fix-35095-1-0.7z",
      "uploadedUnix": "1367144167",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/96b6c217ec8783dd13764a68619c9b6f48b9e83a5a34948452ccf4a15befe49d/analysis/1407545047/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Old%20Version%20Bug%20Fix-35095-1-0.7z?fid=1000026860&ttl=1535813405&ri=8192&rs=8192&setec=87cf8e998aa83ec3d14e7ddaca0a1a83"
    }
  ]
}