{
  "modId": 35094.0,
  "modName": "Aesir Armor",
  "summary": "The long awaited, fully customizable, ancient armor of the Gods is finally avaiable for you to claim&#33; Will you dare venturing in the Halls of the Aesir and survive their mortal obstacles?\r<br />",
  "descriptionHtml": "[center][b]Disclaimer in light of the current &#34;monetized modding&#34; controversy:\r<br />None of my assets (nor any assets contained within this mod, like Nivea&#39;s) are to be used for monetized purposes. No fragment of Æsir Armor or any other mod by my hand are to be uploaded to the Steam Workshop, for monetized purposes or not.[/b]\r<br />\r<br />[img]http://img534.imageshack.us/img534/2956/titlelj.gif[/img]\r<br />[b][size=3]ÆSIR ARMOR\r<br />by OmeSean \r<br />Version 1.6.1 - Look at the changelog&#33;[/size][/b][/center]\r<br />\r<br />[center][img]http://img824.imageshack.us/img824/999/video01v.jpg[/img][youtube]n4QtYOwJrnA[/youtube][img]http://img826.imageshack.us/img826/5171/video02v.jpg[/img][/center]\r<br />\r<br />[center][img]http://img9.imageshack.us/img9/2736/descriptionj.jpg[/img][/center]\r<br />\r<br />[center][b][i]Hearing I ask from the holy races,\r<br />From Heimdall&#39;s sons, both high and low;\r<br />Thou wilt, Valfather, that well I relate\r<br />Old tales I remember of men long ago.[/i][/b][/center]\r<br />\r<br />Æsir Armor is perhaps the most versatile piece of equipment currently out on the Nexus. If you have been scouring the database looking for the ultimate set of armor for your mighty warrior, then look no further&#33; Æsir Armor has something for nearly every type of playing style. From the mighty, lone warrior to a more mystic approach, from thieves to brawlers - Æsir Armor offers equipment for everyone. The armour consisting of thirteen objects, all of which with variations, the amount of possibilities touches infinity.\r<br />Brave through a custom dungeon, fight hordes upon hordes of blood-crazed Einherjar, solve riddles and dodge traps, untill at last you can claim the armor of the Gods themselves for your own. \r<br />Nearly all pieces of the armor use vanilla textures. This means Æsir Armor will benefit from most high-resolution texture packs you may or may not have installed.\r<br />[center][img]http://img811.imageshack.us/img811/1809/installationx.jpg[/img][/center]\r<br />[b]REQUIREMENTS:[/b]\r<br />- [url=http://skse.silverlock.org/]For some of the scripts to function properly, downloading and installing the latest version of SKSE will be mandatory.[/url] You&#39;ll be perfectly fine without it, though, so long as you stay away from the combiner shrine.\r<br />[b]INSTALLATION:[/b]\r<br />- Either download the mod with the Nexus Mod Manager and let it work its magic, or download the mod manually.\r<br />- For the latter:\r<br />[list]\r<br />[*] Drop the .BSA, .ESP files and SEQ folder into your Skyrim data folder.\r<br />[*] Activate the .ESP with either the Skyrim Launcher or the Nexus Mod Manager\r<br />[/list]\r<br />[b]ACQUIREMENT:[/b]\r<br />   Æsir Armor can be found deep inside a tomb called the Halls of the Æsir. The tomb is located on the northwestern shore of Haafingar. A map marker is added from the beginning.\r<br />   It is recommended to be of at least level 25 before entering the dungeon - foes and traps will reduce you to a fine red mist if you fail to heed this warning.\r<br />   Throughout the dungeon you will encounter multiple puzzles, most of which require you to solve a riddle. When you feel absolutely stuck at a certain point, scroll down to the bottom of this page to find the answers to said riddles.\r<br />\r<br />[b]BUGS:[/b]\r<br />[list]\r<br />[*] None known since the latest patch.\r<br />[/list]\r<br />\r<br />[b]INCOMPATIBILITIES:[/b]\r<br />Some mods may conflict with Æsir Armor:\r<br />[list]\r<br />[*] Some mods that add objects different than armour may conflict with Æsir Armor pieces. One example may be the [url=http://skyrim.nexusmods.com/mods/16438]Bandolier[/url] by Dragten.\r<br />[*] Certain elements of the dungeon may fail to function correctly if you&#39;re using very-script intense mods. A good example of a mod that may cause issues in the dungeon is the [url=http://skyrim.nexusmods.com/mods/23600]Player Headtracking[/url] mod by Maegfaer.\r<br />[*] The sleeves (originating from the Stormcloak armour meshes) may sometimes be incompatible with dramatic retextures of said armour. This causes the sleeves to become black. \r<br />[*] The belts are all incompatible with the Schlongs of Skyrim mod by Smurf and VectorPlexus. Having SoS installed will make equipping the belts added by Æsir Armor impossible.\r<br />[/list]\r<br />[center][img]http://imageshack.us/a/img534/1896/armordz.jpg[/img][/center]\r<br />In total, Æsir Armor consists of well over eighty objects obtained at the end of the dungeon. All items can be equipped at your leisure at any time in the game. Dislike the idea of cluttering your inventory and having to equip thirteen pieces every time you wish to don your armour? Have no fear, for at the end a shrine can be found that combines all items into the standard four pieces vanilla armour sets comprise - cuirasses, boots, gauntlets and helmets.\r<br />This pictorial guide will serve to show you what items are available.\r<br />[center][img]http://img837.imageshack.us/img837/574/baseek.jpg[/img][/center]\r<br />In order to prevent the armor from becoming too easily overpowered, only the base armour pieces (torso, boots and gauntlets) are the only pieces of Æsir Armor that can be upgraded or enchanted. These are the pieces Æsir Armor was built around, and these are the pieces that should always be equipped when donning the variations. It is entirely possible to equip the add-on pieces with other base armour sets - but remember that this will cause issues with certain add-ons. For instance, boot and glove addons cannot be worn with most other vanilla gauntlets. \r<br />[center][img]http://img59.imageshack.us/img59/6207/upperfur.jpg[/img][/center]\r<br />The upper fur pieces are the pelts from Skyrim&#39;s mightiest predators. Both versions will shield you from Skyrim&#39;s harshest snowstorms. The bear pelts will also boost your melee damage, whilst the sabre cat version will give you some feline prowess: an increased aptitude in sneaking.\r<br />[center][img]http://img853.imageshack.us/img853/9794/lowerfur.jpg[/img][/center]\r<br />Foxes can be found throughout Skyrim, and that&#39;s partly due to their resistance to Skyrim&#39;s harsh climate. With these pieces of fur, you&#39;ll be able to assume some of those properties.\r<br />[center][img]http://img27.imageshack.us/img27/9704/pauldrons.jpg[/img][/center]\r<br />These pieces of armor will adapt to the current equipment you&#39;re wearing. If a lower fur piece is equipped, scripts will cause the game to equip larger versions. Without a lower fur piece, the game will automatically equip smaller versions.\r<br />The pauldrons increase your size dramatically, and will most certainly prove a boon during your attempts at intimidating foes. They also slightly increase your healing rate and damage done with melee weapons.\r<br />[center][img]http://img534.imageshack.us/img534/2517/satchels.jpg[/img][/center]\r<br />These satchels (first seen on my first-ever mod, Einherjar Armor) will prove a boon to your current favorite playing style.\r<br />The adventurer&#39;s edition will increase your carry weight, healing rate and amount of stamina. The thief&#39;s equipment will, too, increase the player&#39;s carry weight, whilst increasing the sneak and alchemy abilities and fortifying the speed at which stamina is restored. And, like the previous versions, the mage version also fortifies the player&#39;s carry weight - whilst boosting your regeneration and base value of magicka and increasing your aptitude with spells placed in the school of destruction.\r<br />[center][img]http://img19.imageshack.us/img19/4395/beltsjn.jpg[/img][/center]\r<br />The belts are similar to the satchels in enchantments and appearal. The adventurer&#39;s belt will increase your carry weight, healing rate, melee damage and stamina. The thief version will also increase your carry weight, whilst increasing your aptitude in sneaking and alchemy, and will cause you to regain your stamina much quicker. The mage&#39;s belt will fortify both your base magicka and magicka regeneration.\r<br />[center][img]http://img194.imageshack.us/img194/6403/bonebelts.jpg[/img][/center]\r<br />Bone belts consist of the trophies obtained from your most hated enemies. The dragon skull increases damage done to dragons, the human skull increased damage done to humanoids and the elf ears will ease your ability to rend through Elven flesh.\r<br />[center][img]http://img534.imageshack.us/img534/3422/helmetsa.jpg[/img][/center]\r<br />Helmets can be equipped individually or beneath a hood. Along with the base armour pieces, all four helmet variations come without enchantments and can be enhanced at a workbench or altar. Like the pauldrons, these pieces are dynamic: when wearing a helmet with a hood, the horns are automatically hidden. When unequipping the hood, the normal mesh returns.\r<br />[center][img]http://img802.imageshack.us/img802/8201/hoods.jpg[/img][/center]\r<br />Hoods are equipped on top of a helmet and will adapt to the player having equipped an upper fur piece or not. All increase the player&#39;s speechcraft and resistance to frost. They can also be worn on their own, but be warned: wearing only hoods will not affect the matching set perk and will not count towards your armour rating.\r<br />[center][img]http://img405.imageshack.us/img405/1994/gloveaddons.jpg[/img][/center]\r<br />Glove addons are deadly weapons attached to your gauntlets. The axes will greatly increase your bashing damage and provide a minor unarmed damage boost. The daggers will boost both your unarmed and bashing damage by a mediocre amount. The claws will greatly enhance your unarmed damage whilst boosting your bashing damage only slightly.\r<br />[center][img]http://img5.imageshack.us/img5/3329/bootaddons.jpg[/img][/center]\r<br />Boot addons are pieces of equipment attached to your boots. The spurs increase your speed whilst mounted, whilst the daggers will increase your sneak and ability to regenerate stamina. The snow shoes are still in development - one day they will increase your speed on snowy grounds.\r<br />[center][img]http://img37.imageshack.us/img37/3796/bannershw.jpg[/img][/center]\r<br />Banners are mainly cosmetic, except for the Stormcloak and Imperial ones. These banners will cause the player to become hostile to the opposing faction - a great asset for any serious roleplayer.\r<br />[center][img]http://img838.imageshack.us/img838/1586/trophiesv.jpg[/img][/center]\r<br />Trophies are the severed heads of mighty foes. All increase your aptitude with one and two handed weapons.\r<br />- Note: human head trophies are still in development.\r<br />[center][img]http://img5.imageshack.us/img5/2425/shieldsu.jpg[/img][/center]\r<br />All shields negate damage from arrows that strike your back (EXPERIMENTAL). The backpack increases your carry weight by 50.\r<br />[center][img]http://img845.imageshack.us/img845/205/cloaks.jpg[/img][/center]\r<br />These cloaks are created by the talented modder Nivea, and will greatly increase your ability to resist Skyrim&#39;s harsh climate. They cannot be equipped with satchels and trophies.\r<br />[center][img]http://img844.imageshack.us/img844/7391/recommendedc.jpg[/img][/center]\r<br />Æsir Armor uses vanilla textures for nearly every piece available. As such, the armor benefits from the Nexus&#39; wide selection of texture mods. Please note that these mods are NOT required for Æsir Armor, just recommended. Here are a few I prefer to use with Æsir Armor:\r<br />[list]\r<br />[*] [url=http://skyrim.nexusmods.com/mods/3261]Hvergelmir&#39;s Armor Retexture - HAR[/url] - [url=http://skyrim.nexusmods.com/users/30027]by lthot[/url] - Greatly enhances the base armor and kilt&#39;s textures. Absolutely mandatory.\r<br />[*] [url=http://skyrim.nexusmods.com/mods/7045]Hvergelmir&#39;s Shield Retexture- HSR[/url] - [url=http://skyrim.nexusmods.com/users/30027]by lthot[/url] - Spruces up the otherwise dull shields.\r<br />[*] [url=http://skyrim.nexusmods.com/mods/20792]aMidianBorn Steel Plate Armor[/url] - [url=http://skyrim.nexusmods.com/users/571605]by CaBaL120[/url] - Enhances parts of the kilt.\r<br />[*] [url=http://skyrim.nexusmods.com/mods/13429]Designs of the Nords[/url] - [url=http://skyrim.nexusmods.com/users/952273]by KEBW1144[/url] - Greatly enhances the banners.\r<br />[*] [url=http://skyrim.nexusmods.com/mods/12085]Better Bones[/url] - [url=http://skyrim.nexusmods.com/users/2570251]by Ironman5000[/url] - Makes the bones much more appealing.\r<br />[*] [url=http://skyrim.nexusmods.com/mods/3621]Bellyaches Animal and Creature Pack[/url] - [url=http://skyrim.nexusmods.com/users/84873]by wrig675[/url] - Covers the wide selection of fur this mod offers.\r<br />[*] [url=http://skyrim.nexusmods.com/mods/1754]Weapon Retexture Project[/url] - [url=http://skyrim.nexusmods.com/users/431125]by Milennia[/url] - The armour is riddled with weapons. With this mod, it&#39;ll be riddled with pretty weapons.\r<br />[*] [url=http://skyrim.nexusmods.com/mods/3595]HD Misc[/url] - [url=http://skyrim.nexusmods.com/users/3181472]by calfy[/url] - Spruces up some of the smaller bits of the armor.\r<br />[*] [url=http://skyrim.nexusmods.com/mods/20801/]Texture Pack Combiner[/url] - [url=http://skyrim.nexusmods.com/users/676369]by cestral[/url] - Following this mod&#39;s guide will enhance the armor to an absolute maximum. Don&#39;t forget to endorse the original texture&#39;s creators&#33;\r<br />[*] [url=http://skyrim.nexusmods.com/mods/34508]360 Walk and Run Plus[/url] - [url=http://skyrim.nexusmods.com/users/4222869] By yukl [/url] - Will fix feet clipping through the cloaks in a most elegant fashion.\r<br />[/list]\r<br />[center][img]http://img202.imageshack.us/img202/2103/faqhl.jpg[/img][/center]\r<br />[b]Q:[/b] I don&#39;t like a single item on a piece of armour. Could you please create a version without said objects?\r<br />[b]A:[/b] I&#39;m not going to cater to the needs of a single person. Please download NifSkope and remove the object yourself - it&#39;s as simple as pressing a delete button.\r<br />\r<br />[b]Q:[/b] You promised us custom beards in this package&#33; Where are they?\r<br />[b]A:[/b] I am still working on creating the beards, and might release them as a different mod altogether. Please be patient and satisfied with the amount of material I already gave you.\r<br />\r<br />[b]Q:[/b] Could you please create a skimpy version?\r<br />[b]A:[/b] If you take a look at my previous work, you&#39;d see I don&#39;t mod that way. Do it yourself.\r<br />\r<br />[b]Q:[/b] Your dungeon is too difficult&#33; I keep dying all the time&#33;\r<br />[b]A:[/b] The dungeon is leveled and starts and level 25. If you are below this level, the Halls of the  Æsir will prove a difficult dungeon indeed. Go and level up a bit more.\r<br />\r<br />[b]Q:[/b] I can&#39;t enter the dungeon&#33; The blood seal keeps killing me all the time&#33;\r<br />[b]A:[/b] Yes, I specifically intended to block acces to all Elven players. It&#39;s for roleplaying purposes. If it frustrates you that much: Lydia isn&#39;t an elf, is she? Gee... I wonder...\r<br />\r<br />[b]Q:[/b] ZOMG, cud U plz do a blck retax of the armur? Kthxbai&#33;\r<br />[b]A:[/b] Shoo.\r<br />[center][img]http://img189.imageshack.us/img189/5475/changelog.jpg[/img][/center]\r<br />[b]1.6.2[/b]\r<br />- Throttled the CTD for good, this time.\r<br />   The crash was caused by some corrupted models. Rather than fixing the models I got a better idea and implemented some new additions - I&#39;m sure you&#39;ll like them.\r<br />- Replaced the disablehavokonload scripts with a custom one. You won&#39;t notice any difference, but it takes a great strain away for the game.\r<br />- General flickering light fixes.\r<br />- Small roombound fix.\r<br />- Navmesh fix in level one. Several parts were flagged as being under water, when clearly they were not.\r<br />[b]1.6.1[/b]\r<br />- Hopefully fixed the CTD people were experiencing.\r<br />- Tremendously stupid mistake corrected in the blood seal script. High elves can now use their followers to open the gate as intended.\r<br />- Fixed the disappearing water in the messhall.\r<br />- Fixed the clipping with small bear hood (male) and several helmets.\r<br />- Fixed the double beheading bug.\r<br />- Fixed the door in prison area failure to open when finishing the event. \r<br />- Fixed backpack enchantments.\r<br />[b]1.6.0[/b]\r<br />- Added a failsafe script to the first door in level 1.\r<br />- Changed the first encounter to be more intuitive and at the same time difficult.\r<br />- Revamped the water level to replace it with a maze. Removed the disappearing wall bug in the narrow corridor prior to that in the process.\r<br />- Changed the large mess hall fight into an all-out brawl. The ghosts will now start smashing each other, much like they would in Valhalla. Hide or join, it&#39;s up to you.\r<br />- Changed the &#34;Where does true power lie?&#34; riddle into something a little more challenging. Three statues, a sword and a riddle. Enjoy.\r<br />- Fixed the faulty letters in one of the notes in the final puzzle area.\r<br />- Fixed several room bounds in level two to prevent the slightly visible disappearing walls.\r<br />- The ghosts in the prison branch of level two are now disabled untill triggered. This prevents players from killing them and screwing up the event.\r<br />- At the end of the final encounter, the ghosts start at their throne rather than around the mound. \r<br />- When a ghost falls into the water, a script will automatically kill it.\r<br />- Replaced the portculli in the draugr branch of level 2 with rotating doors to make it slightly trickier.\r<br />- Windir&#39;s War Axes are a bit more interesting now.\r<br />- Replaced the barred door at the very end with a rotating door.\r<br />- Created an MCM menu to allow for:\r<br />   - Implementation of SkyRe values.\r<br />   - Combining/separating the armour away from the shrine.\r<br />   - Debug: remove all Æsir items\r<br />   - Debug: unequip all Æsir items.\r<br />- Slight change to the combiner script and alleged formlists to remove the dummy pauldrons after combining, and adding them once more when separating.\r<br />- Fixed the female glove addons (daggers and claws) to properly move along with the animations.\r<br />- Fixed and changed several lights to stop them from flickering or casting odd shadows.\r<br />- All Einherjar now come equipped with a preview version of Einherjar Armor 2.0.\r<br />- Added a new boss in level one.\r<br />- Cleaned the .esp using TesVEdit. Yes, this removes the 2 ITM&#39;s and navmesh &#34;issue&#34;.\r<br />   [b]1.5.2[/b]\r<br />    - Changed the very first ambush to prevent the door from refusing to open.\r<br />    - Changed a lot of bipedal slots to be more friendly towards other mods. Frostfall compatibility ready.\r<br />   [b]1.5.1[/b]\r<br />   - Fixed the back straps of the small female pauldrons.\r<br />   - Fixed the buggy male dragon pauldrons.\r<br />   - Fixed the crash occuring when equipping the thief satchel.\r<br />   - Followers can now activate the blood seal.\r<br />   - Fixed the purple sabre cat and wolf related items.\r<br />   [b]1.5.0[/b]\r<br />   - Fixed the bugged skull pauldron.\r<br />   - Fixed the clipping around the boots.\r<br />   - Fixed the health regeneration bug.automated.\r<br />   - Dramatically changed all combiner scripts to remove stuck hoods/helmets and faulty armor rating.\r<br />   - Fixed the brown bear fur. \r<br />   [b]1.4.0[/b]\r<br />    - Fixed the teared up helmets.\r<br />    - Fixed the male ancient nord helmet.\r<br />    - Changed the hood and helmet scripts to be more automated.\r<br />    - Changed the lower fur scripts to be more automated.\r<br />    - Replaced the mannequin with a crate. \r<br />   [b]1.3.0[/b]\r<br />      - Fixed the bug where killing the high elf prisoner in level 2 will never cause the other elves to appear, and thus never opening the gates.\r<br />      - Fixed some playable pauldrons that should remain invisible.\r<br />      - Went over the mannequin script again. It now double checks the appropriate items being added. \r<br />      - Dropped the water level in the submerged section to make it slightly easier.\r<br />      - Fixed SRPauldron03 - F and SRPauldron06 - F \r<br />   [b]1.2.0[/b]\r<br />      - Added a quick way out and in.\r<br />   [b]1.1.0[/b]\r<br />      - Fixed the brown bear hoods.\r<br />      - Fixed the mannequin bug.\r<br />      - Fixed the land tearing issue outside the dungeon&#39;s entrance.\r<br />      - Fixed the invisible small pauldrons.\r<br />      - Fixed the cloaks.\r<br />   [b]1.0.2[/b]\r<br />      - Fixed the weighting on the right small female pauldrons.\r<br />   [b]1.0.1[/b]\r<br />      - Fixed the map marker.\r<br />   [b]1.0[/b]\r<br />      - Release version.\r<br />[center][img]http://img195.imageshack.us/img195/1429/creditsjd.jpg[/img][/center]\r<br />[b]Permissions:[/b]\r<br />\r<br />You may not redistribute either an unmodified or modified version of Æsir Armor or parts of to any website - be it the Nexus or Steam Workshop - without permission from the original mod author (Omesean). \r<br />\r<br />In short: doing anything with this armour (unless it&#39;s for pure, personal use) is prohibited. Do think of asking me for permissions - if you have a great idea for a modification or patch for Æsir Armor, or wish to create a translation - feel free to write.\r<br />\r<br />[b]Credits:[/b]\r<br />[list]\r<br />[*] Aesir, a poet and fellow whisky enthusiast. If you have been bashing your head against your keyboard from frustration of being unable to solve the riddles, thank him&#33;\r<br />[*] Nivea, for creating her awesome cloaks. A wonderful addition to this mod.\r<br />[*] Northborn, for our wonderful exchange of Creation Kit expertise. Some things would never have been possible without his help.\r<br />[*] lthot, for his help with some tricky texture stuff (though trivial matters to him), and the wonderful enhancement his texture overhaul provides to Æsir Armor. Go check it out&#33;\r<br />[*] Reaper9111, for the creation of the textures for the boot addons.\r<br />[/list]\r<br />[b]Tools used:[/b]\r<br />[list]\r<br />[*] TesVEdit\r<br />[*] Blender\r<br />[*] NifSkope\r<br />[*] GIMP\r<br />[*] Creation Kit\r<br />[*] AVS Audio Editor\r<br />[*] Unfuzer\r<br />[*] My Status Graphite, for preventing me from becoming frustrated too much.\r<br />[/list]\r<br />[center][b]Enjoy&#33;\r<br />With love, \r<br />Sean.[/b][/center]\r<br />\r<br />\r<br />\r<br />Below you&#39;ll find the greyed-out solutions to the riddles. Select them with your mouse to make them visible.\r<br />[color=#313131]\r<br />Answers to the riddles:\r<br />   Riddle 1: underwater section, 1 (splits into three tombs)\r<br />      The lever in the tomb with just one candle is the one you&#39;ll want.\r<br />   Riddle 2: underwater section, 2 (large tomb)\r<br />      It&#39;s the one with the nightshade on top of it.\r<br />   Riddle 3: above the mess hall\r<br />The first skeleton (holding up one finger) got it right.\r<br />   Riddle 4: spider room\r<br />      The first riddle:   \r<br />         The whale got it right.\r<br />      The second riddle:\r<br />         The snake got it right.\r<br />      The third riddle:\r<br />         The eagle got it right.\r<br />      The fourth riddle:\r<br />         The snake got it right.\r<br />   Riddle 5: draugr room (level 2)\r<br />      The whale got it right.\r<br />[/color]",
  "categoryId": "54",
  "version": "1.6.2",
  "author": "Omesean",
  "createdUnix": "1366576111",
  "updatedUnix": "1370643973",
  "containsAdultContent": false,
  "uploadedBy": "Omesean",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027005",
      "name": "AesirArmor",
      "version": "1.5.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "63428",
      "fileName": "AesirArmor-35094-1-5-2.zip",
      "uploadedUnix": "1367198694",
      "modVersion": "1.5.2",
      "virusScanUrl": "https://www.virustotal.com/file/2f84d623ca7b7b85221fec8abe6b2568205603394b3c6fdb441d67989e4e5030/analysis/1407546338/",
      "changelogHtml": " Changed a lot of bipedal slots to be more friendly towards other mods. Frostfall compatibility ready. <br/> \n Changed the very first ambush to prevent the door from refusing to open.      <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AesirArmor-35094-1-5-2.zip?fid=1000027005&ttl=1535813402&ri=8192&rs=8192&setec=fb24c9295761e882cfe49907efa08fdc"
    },
    {
      "fileId": "1000033239",
      "name": "Aesir Armor",
      "version": "1.6.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "43622",
      "fileName": "Aesir Armor-35094-1-6-2.rar",
      "uploadedUnix": "1370643973",
      "modVersion": "1.6.2",
      "virusScanUrl": "https://www.virustotal.com/file/76cf06c2e15bd5f846695249892689f2a10750f10d100177b95f65ac1ff6b5a3/analysis/1407595657/",
      "changelogHtml": " Throttled the CTD for good, this time. <br/> \n Replaced the disablehavokonload scripts with a custom one. You won&#39;t notice any difference, but it takes a great strain away for the game. <br/> \n General flickering light fixes. <br/> \n Small roombound fix. <br/> \n Navmesh fix in level one. Several parts were flagged as being under water, when clearly they were not. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aesir%20Armor-35094-1-6-2.rar?fid=1000033239&ttl=1535813402&ri=8192&rs=8192&setec=780a639c9acd63e05970d3eaa0b5acd4"
    }
  ]
}