{
  "modId": 35093.0,
  "modName": "Writhes Smithing Items Revised",
  "summary": "Upgrade all armor and weapons as your smithing progresses!",
  "descriptionHtml": "[center][img]http://i285.photobucket.com/albums/ll80/Writhes/Introduction.gif[/img][/center]\r\n\r\n[b][size=+1][color=#FCCE8E]I have been playing Skyrim for a long time and I never really liked how smithing worked. There are so many weapons and armor sets in the game yet most weapons are useless and nearly every armor set can exceed the armor cap 567 (80%) damage reduction.\r\n\r\nAs amusing as the item progression may be in skyrim I still dislike being pigeonholed into using whatever is the \\\"best\\\" and in the end not really having choices about which armor or weapons I decide to wear.\r\n\r\nI wanted to make a mod which allows players to choose armor and weapons without quality or stats influencing decisions about which material those armor and weapons may be. [/color][/size][/b]\r\n\r\n[center][img]http://i285.photobucket.com/albums/ll80/Writhes/Description.gif[/img][/center]\r\n\r\n[b][size=+1][color=#FCCE8E]This mod does a few things. It gives smithing items progression and gives them the potential to be the best when fully upgraded. It adds all previously non craftable vanilla armor sets and weapons to smithing. It makes almost all unenchanted armor and weapons smeltable or salvageable. [/color][/size][/b]\r\n\r\n[center][img]http://i285.photobucket.com/albums/ll80/Writhes/Features.gif[/img][/center]\r\n\r\n[b][size=+1][color=#FCCE8E]\r\n- The smithing tree has been altered to reflect the new style of smiting progression. Each rank reflects the quality of an item that can be crafted.\r\n\r\n-Items now consist of the following ranks from worst to best from left to right.\r\n     Worn, Simple, Moderate, Standard, Advanced, Elegant, Elaborate, Intricate.\r\n         An items lowest rank is determined by the level of smithing required to craft its original.\r\n\r\n- Every level of smithing gives access to upgraded item variations from previous perks as well as new armor and weapons more or less at the same points they would have been earned from the vanilla game.\r\n\r\n- Arrows can be combined with firewood to upgrade them if the player has unlocked the required level of smithing. Additionally, Arrow crafting automatically adjusts based on smithing rank. Example - Arrows at novice smithing may deal 12 damage however all arrows crafted at Grand Master Smithing will deal 25 damage. \r\n\r\n- At grand master (smithing100) Intricate quality replicas can be created for all unique items and daedric artifacts if their relative quests are completed. Additionally, if an item has a unique enchantment their replicas can be upgraded to apply their original enchantments.  \r\n(It may be required to hold some of these unique items in the player inventory to craft replicas)\r\n\r\n- Leveled items can be upgraded with the proper smithing perks.\r\n\r\n- All armor and weapons gained from quests are unlocked for smithing once their relative quests have been completed. Examples (DarkBrotherhood, ThievesGuild, Nightingale, and more!)\r\n\r\n- Ingots now have ranks. Ingot ranks are as follows worst to best left to right.\r\n     Poor, Low, Mid, High, Top, Perfect.\r\n\r\n- All un-enchanted items including their upgraded counterparts are smeltable and yield ingots of quality equal to the item which was smelted. Ranked ingots are always salvageable via smelting.\r\n          \r\n- 2 Ingots of equal rank can be smelted together to create a higher rank ingot and a single ingot can be smelted down to 2 ingots of lower rank.\r\n\r\n- Crafting now consist of a specific structure.\r\n      Original Item - Cheap Crafting Materials, Ranked Ingots, Rare Item\r\n      Upgraded Item - Ranked Ingot, Lower Quality Counterpart\r\nUpgrades will not not be visible in the smithing menu for a player without the lower quality counterpart required for the upgrade however originals will always be visible on the crafting menu.\r\n\r\n- The shrouded gloves effect aka \\\"DB Backstab\\\" now effects bows and has been renamed to Enhanced Sneak Attack. Enhanced Sneak Attack is passively added to all light armor gloves. All heavy armor gloves have a passive effect called Exploit Balance which allows the player to deal twice as much damage to staggered targets. Gloves will maintain their passive effects regardless of their current enchant.\r\n\r\n- Once a player has invested their first perk into the heavy armor tree or light armor tree they will gain weapon damage based on their total armor rating. This is to motivate players to maximize their armor rating beyond the damage resistance cap. Damage bonuses are equal to roughly 5% of total armor rating. (Now that excessive 1000+ armor rating will pay off by giving 50+ damage)\r\n\r\n[/color][/size][/b]\r\n\r\n[center][img]http://i285.photobucket.com/albums/ll80/Writhes/ModderNotes.gif[/img][/center][center][b][size=+2][color=RED]Read This Before Installing![/color][/size][/b][/center]\r\n\r\n\r\n[b][size=+1][color=#FCCE8E]\r\n\r\nItems created from smithing with enchantments or tempering may or may not vanish once this mod is activated. Clothing and all other items that aren\\'t created with smithing will not be affected. \r\n\r\nIt would be a good idea to unequip all items before installing so that if your smithing items do happen to vanish their magic enchants will not linger on your character. This is good advice for ANY mod and not just this one.\r\n\r\nMods which add similar features may create duplicates and clutter in the smithing menu. I advice against using smithing mods that alter vanilla crafting with this mod.\r\n\r\nThe unofficial skyrim patch adds a few crafting items for vanilla items. If anyone uses uskp they may notice duplicates of scaled armor and imperial items but this is really not that significant. \r\n\r\nIf a player wishes to do so they can remove these duplicates by following a few simple steps.\r\n\r\n1. Start the creation kit and go to file/data and find the unofficial skyrim patch. Select it and click the set as active file box and click Ok. Click yes to all to any warnings until it is fully loaded.\r\n\r\n2. Make sure the object window is open or if it isn\\'t go to the view section at the top and select object window. In the object window find the items section and expand it clicking the +. Under items select Constructible Object.\r\n\r\n3. Above the list you will see a box with the word filter. In the box type uskp and you will see on the right all the added uskp tempering and crafting recipes. Simply select it all and delete it then just save from the file section at the top.\r\n\r\n[/color][/size][/b]\r\n\r\n[b][size=+1][color=#FCCE8E]\r\n\r\n[center][img]http://i285.photobucket.com/albums/ll80/Writhes/FuturePlans.gif[/img][/center]\r\n\r\nEventually I want to add an optional version of the mod which will give npcs upgraded items and add upgraded items to level lists so they can appear as loot, treasure, and in merchant inventory. I might only add these features to the dawnguard/dragonborn version.\r\n\r\nI plan to ask some other modders if I can add support for their mods with mine. I don\\'t want to say which but there are some I have in mind.\r\n\r\nAfter everything else is completed I might decide to create duplicate .nifs for armor and weapons and separate them to their own file paths. The idea is to give each rank a separate .nif so that people can give each rank of armor and weapons a separate appearance if they choose to do so. Players will be able to give their armor and weapon customization graphically.\r\n\r\n[/color][/size][/b]",
  "categoryId": "36",
  "version": "Unreleased",
  "author": "Writhes",
  "createdUnix": "1366567938",
  "updatedUnix": "1366567938",
  "containsAdultContent": false,
  "uploadedBy": "Writhes",
  "primaryFile": null,
  "files": []
}