{
  "modId": 35168.0,
  "modName": "Constructable Soul Gem Turrets",
  "summary": "Adds constructable soul gem turrets to the game.",
  "descriptionHtml": "Have you ever thought while getting killed by those soul gem traps “Man, wouldn’t it be nice to be able to craft these and make them fight on my side?” Well with this mod you can! Not only can you make one, but 14 different types of turrets, each having six levels.\r\n\r\nSo how does it work? Well in the Arcanaeum at the Winterhold College you will now be able to create turret scrolls at the turret forge and with these turret scrolls you can conjure turrets. You can create them by adding soul gems, regular gems, spell tombs and scrolls to the turret forge. Just follow the recipes in the “Art of Turret Security” book that can be found on the turret forge. If you want to see the recipes now there are images of the book in the image tab of this page. Most recipes in the book have \"Any Filled Soul Gem\" at the end of it. What this means is you can add one of any filled Soul Gem types, but whatever one you chose will affect how powerful that turret is.  You can create only one scroll at a time at the forge and any extra material that wasn’t used will silently be given back to you. You can also add turret scrolls to the forge to get the material used to create them back.\r\n\r\nThe book will also show you global settings whenever it is picked up. You can change them anytime by just dropping it and picking it up. These are the options and what they do.\r\n\r\nView Book/Close:\r\nCloses the menu and opens book.\r\n\r\nChange Default Target Settings:\r\nWill give you four options of what you want all turrets from now on to immediately target upon being summoned. Does not affect turrets already summoned.  Here are the options.\r\nEveryone (Including Me).\r\nEveryone (Except Me).\r\nOnly Hostiles.\r\nOnly Me.\r\n\r\nBy default it’s “Only Hostiles” but you can change it whenever you want to. So for example if you changed it to “Everyone (Except Me)” all turrets you summoned afterword would immediately fire on everyone except you.\r\n\r\nRemove All Turret Parts in Area:\r\nThis is just added because of a rare bug that sometimes happens. What it does is remove all turret parts from the area you are currently in and should only be used if un-pickup-able turret parts got left behind.\r\n\r\nToggle Baseless:\r\nWill give you the option to remove or add the base of all turrets you summon from then on (In till you switch it back that is.) However, the turrets that are already summoned will not be changed in till you pick them up and re-summon them. This option can be switched anytime.\r\n\r\nAnyways once you created and summoned a turret. Depending on what type of turret it is it well ether start casting spells at your enemies or you. You can also go up to the turret and change its personal options by activating the soul gem. Here are the three options that will only affect it.\r\n\r\nView current type/Close:\r\nWill close the menu and also display in the top left corner what type of turret it is.\r\n\r\nChange Target:\r\nWill give you four options of what you want this turret to target. Here are the options.\r\nEveryone (Including Me).\r\nEveryone (Except Me).\r\nOnly Hostiles.\r\nOnly Me.\r\n\r\nPick Up:\r\nPicks up the turret. The moment you pick up the turret you will get its turret scroll and the entire turret will disintegrate.\r\n\r\nSo there, I think I explained everything, but if you are still confused I recommend you look at the video in the video tab.\r\n\r\nHere is some random info about the turrets!\r\n\r\nHere are the levels according to what soul gem you used to make the turret scroll:\r\nLvl-01: Filled Petty Soul Gem\r\nLvl-02: Filled Lesser Soul Gem\r\nLvl-03: Filled Common Soul Gem\r\nLvl-04: Filled Greater Soul Gem\r\nLvl-05: Filled Grand Soul Gem\r\nLvl-06: Filled Black Soul Gem\r\n\r\nTurrets health (For all turrets) is: 500\r\nTurrets health regeneration (only for turrets made with black soul gems) is: 2.5\r\n\r\nThe turrets types are:\r\nFlames\r\nFirebolt\r\nFireball\r\nFrostbite\r\nIce Spike\r\nIce Storm\r\nSparks\r\nLightning Bolt\r\nChain Lightning\r\nShield\r\nHealth restoring\r\nMagicka restoring \r\nStamina restoring\r\nSoul Trap\r\n\r\nThe turret firing rates are:\r\nFlames, Frostbite, Sparks = 0.2 seconds\r\nFirebolt, Ice Spike, Lightning Bolt = 1 seconds\r\nFireball, Ice Storm, Chain Lightning  = 3 seconds\r\nHealth, Magicka, and Stamina restoring = 3 seconds\r\n\r\nThe turret ranges are:\r\nFlames, Frostbite, Sparks = 750\r\nFirebolt, Ice Spike, Lightning Bolt = 1000\r\nFireball, Ice Storm, Chain Lightning = 1500\r\nHealth, Magicka, and Stamina = 2000\r\n\r\nFlames turret damage:\r\nLV01 = 8, LV02 = 12, LV03 = 16, LV04 = 20, LV05 = 24, LV06 = 28\r\nFirebolt turret damage:\r\nLV01 = 15, LV02 = 25, LV03 = 30, LV04 = 35, LV05 = 40, LV06 = 45\r\nFireball turret damage:\r\nLV01 = 30, LV02 = 50, LV03 = 60, LV04 = 70, LV05 = 80, LV06 = 90\r\nFrostbite turret damage:\r\nLV01 = 10, LV02 = 20, LV03 = 25, LV04 = 30, LV05 = 35, LV06 = 40\r\nIce Spike turret damage:\r\nLV01 = 25, LV02 = 35, LV03 = 45, LV04 = 55, LV05 = 65, LV06 = 75\r\nIce Storm turret damage:\r\nLV01 = 40, LV02 = 60, LV03 = 70, LV04 = 80, LV05 = 90, LV06 = 100\r\nSparks turret damage:\r\nLV01 = 15, LV02 = 25, LV03 = 30, LV04 = 35, LV05 = 40, LV06 = 45\r\nLightning Bolt turret damage:\r\nLV01 = 30, LV02 = 40, LV03 = 50, LV04 = 60, LV05 = 70, LV06 = 80\r\nChain Lightning turret damage:\r\nLV01 = 25, LV02 = 35, LV03 = 40, LV04 = 45, LV05 = 50, LV06 = 55\r\n\r\nHere are the answers to some questions you might have:\r\nQ: I summoned the shield turret too far away from me and can’t get to it to pick it up.\r\nA: Open the console and use TLC. Now you can get to it and pick it up.\r\nQ: Can the soul gems be grabbed or knock off like the trap turrets?\r\nA: No, they will stay in place.\r\nQ: If the turret dies will I get the scroll that created it back?\r\nA: No, if the turret dies the scroll is gone.\r\nQ: Can the healing turret accidentally heal enemies.\r\nA: No, it should only heal you.\r\nQ: If I set the turret to attacks everybody. Will that make everybody hate me as well as the turret?\r\nA: No, everyone will just attack the turret you can even join in if you like the turret will forgive you.\r\nQ: Can the turrets accidentally hit you?\r\nA: Yes, they can. If you get in between them and their target they will hit you instead. They won't mean to, their just kind of stupid like that... So just don’t get in their way and you’ll be fine.\r\nQ: Can I improve this mod and repost it?\r\nA: Yes you can, just remember to give me some credit.\r\nQ: What if I repost it and don’t give you credit?\r\nA: Well three things will happen…\r\nOne: As usual, God will kill a puppy. That’s puppy blood on your hands and that stuffs is hard to wash off.\r\nTwo: Cave Johnson will be dispatched to your house to burn it down with combustible lemons.\r\nThree: I will be very sad… and I might cry… and nobody wants to see a grown man cry, as it will just makes things awkward so please don’t do it.\r\n\r\nKnown bugs:\r\n*Lightning turrets look like there firing in only one direction, yet they hits there targets just fine. I have no idea why this happens. I could find nothing wrong with the scripts or spells and to tell you the truth I don't think it’s the mod. I think it’s my game. If any of you have this problem tell me and then I'll know it’s the mod.\r\n\r\nCompatibility issues:\r\n*None that I know of… But if the book and turret forge isn’t in the Arcanaeum then you’re probably having a compatibility problem.\r\n\r\nUpdated to 2.0:\r\n*The turrets now can be attacked and destroyed.\r\n*You can change what a turret will target.\r\n*An overhaul of how the turrets are created and their type changed.\r\n\r\nUpdated to 2.1:\r\n*Added shield turret type which is made using \"The Black Star\".\r\n*Added healing turret type which is made using \"Azura Star\".\r\n*Soul gems on top of the turret rotate as a cool effect.\r\n*Using black soul gems in turrets will not only make them level 6, but will also give them health regeneration.\r\n*Made the scripting a bit more efficient and organized.\r\n\r\nUpdated to 2.2:\r\n*Turret parts no longer get left behind. Even when picking it up while the Orb is moving.\r\n*Turret no longer fire randomly and have set firing rates.\r\n*Turret Targeting is more efficient now.\r\n*A lot of other stuff.\r\n\r\nUpdated to 2.3:\r\n*Ice Spike turret range fix.\r\n*The regular gems inside the turret will degrade if the turret health lowers below half of its base HP. Turrets will continue to fire though as long as you don't open its inventory.\r\n*Made the main script a bit more efficient.\r\n*Decreased turrets health regeneration as it was too powerful.\r\n*Turret dialog been removed.\r\n\r\nUpdated to 2.4:\r\n*Gems degrade feature removed because it was causing problems.\r\n*Turret forge added to make it more immersive.\r\n*Book change to make it more immersive.\r\n*Healing turret cannot accidentally heal enemies anymore.\r\n*Turret scroll recipe changed to make it more immersive.\r\n*Turret recipes change slightly to balance it as I thought the gem prices were a bit high. So you only need one gem per recipe now.\r\n*Main script a bit more efficient.\r\n*Added new option to turret targeting.\r\n*Added the source scripts to the BSA file. The only reason why I didn't add it to the previous versions was because I forgot. Anyways it's added now so you can edit the scripts now.\r\n*A lot of other stuff.\r\n\r\nUpdated to 2.5:\r\n*Redid the way you create turrets so instead of adding ingredients to the turret in mid-battle. You would just create the Individual turret scrolls at the turret forge.\r\n*Made the turret forge give you material back when any turret scroll is added to it.\r\n*Probably fixed turrets resetting in areas that reset.\r\n*Added two more types of turrets.\r\n*Added more settings.\r\n\r\nUpdated to 2.6:\r\n*Added soul trap turrets.\r\n*Found out the health of all turrets was 50 instead of 500 so changed it to 500.\r\n*Changed Health, Magicka, and Stamina turrets so its create with grand soul gems instead of Azura Star.\r\n\r\nUpdated to 2.7: \r\n*Book and forge was set as npc owned. Changed it so its owned by the player.\r\n\r\nFuture updates:\r\n*Fixing bugs.\r\n\r\nMod requirements:\r\n*There are none!\r\n\r\nWant to upgrade to higher version of mod:\r\n*Before you upgrade I recommend you pick up all the turrets you placed.\r\n\r\nWant to uninstalling the mod:\r\nFor safe removal. You will need to pick up all the turrets you placed and unequipped any scrolls that came with this mod. This should ensure that no scripts from this mod remain in your save game file. After that all you'll have to do is delete the any soul gem turrets files from the data folder. Then to make sure it's gone load your game and save again and that should get rid of it for good.\r\n\r\nAnyways please comment on any problems you have with the mod. I'm no longer upgrading this mod in less real big problems are reported, sorry i just want to move on to other things. \r\n",
  "categoryId": "75",
  "version": "2.7",
  "author": "AnonAccount",
  "createdUnix": "1366751018",
  "updatedUnix": "1383705998",
  "containsAdultContent": false,
  "uploadedBy": "AnonAccount",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000075714",
      "name": "Craftable Soul Gem Turrets",
      "version": "2.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "403",
      "fileName": "Craftable Soul Gem Turrets-35168-2-7.rar",
      "uploadedUnix": "1383705998",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/ef08f3f589a8c4ce2a1dfc8f38d7f51670b503dd5099db92c856f0047b0ad3f1/analysis/1407782532/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20Soul%20Gem%20Turrets-35168-2-7.rar?fid=1000075714&ttl=1535813550&ri=8192&rs=8192&setec=7eae5bc6e80830b7d3b6db28998fc264"
    }
  ]
}