{
  "modId": 35179.0,
  "modName": "EZ Magic Sets",
  "summary": "Switch between your magic spells with ease, you don\\'t even need to open the menus",
  "descriptionHtml": "[color=#66CCCC][size=5][b][u]Description[/u][/b][/size][/color]\r\n\r\nThis mod has a SkyUI configuration mod page dedicated to create sets of magic spells. You can equip your shouts, powers and magic spells in your left and right hand with one hotkey, you can also auto cast a spell at the same time you equip the set.\r\n\r\nWhen I started playing as a mage in Skyrim, every battle was a pain, instead of remembering how cool I beat the odds and survived an impossible fight, all I could remember was the clunky menus, equipping spells that I had to cast just once, like [color=#CCCCFF][i]Flame Cloak[/i][/color], changing back and forth restoration spells and damage dealer spells, half of the time I was selecting some magic to equip instead of fighting, even with the enhanced favorite menus.\r\n\r\nWith the help of this mod you can have more fun using your magic spells in a faster and more flexible way. Not only the mage class benefits from this mod, any class can use it to cast those pesky little spells to give you the edge in a fight. For example, with little effort a warrior can cast an alteration spell before getting into battle.\r\n\r\n\r\n[color=#66CCCC][size=5][b][u]Installation[/u][/b][/size][/color]\r\n\r\nBefore installing this mod, make sure you have [color=#EEFF77]SkyUI 3.4[/color] and [color=#EEFF77]SKSE 1.6.13[/color] installed, you can try using a lower version, but I programmed the scripts using those versions.\r\n\r\nThis is my first mod using the localization feature of SkyUI. Right now it has only the English version of the texts, but from there you can make your customization. I included a mod version without the localization, if you don’t want to deal with any localization problems.\r\n\r\nI recommend installing this mod with [i]Nexus Mod Manager[/i], but if you are installing it manually, just extract the mod version you want into your [i]skyrim/data[/i] folder.\r\n\r\n\r\n[color=#66CCCC][size=5][b][u]How to Use[/u][/b][/size][/color]\r\n\r\n[color=#66CC99][size=3][b]Short explication[/b][/size][/color]\r\n\r\n[color=#BBFF77][list][*]Install the mod.\r\n[*]Equip some spells to your character.\r\n[*]Go to a magic set page and assign those spells to an empty slot.\r\n[*]Remember to add the ring to your character inventory.\r\n[*]Assign a hotkey to that ring, each time you try to equip the ring, the magic set will be equipped instead.\r\n[*]The main set will equip first, then the secondary set, if you have assigned any auto cast spell, it will be cast one second after you equip the magic set, after that you will have a 5 seconds cooldown on auto cast spells.[/list][/color]\r\n[i]The images of this mod describe this process too[/i]. I believe I made this mod very intuitive so you can learn by trial and error too.\r\n\r\n[color=#66CC99][size=3][b]A very long explication[/b][/size][/color]\r\nAfter a successful installation, you will have a SkyUI configuration mod page that will help you create magic sets. You have 9 possible sets to customize, each one with two settings, main set and secondary set. The main set will be activated as soon as you press the assigned hotkey, and if you press it again you will equip the secondary set. Any slot that is empty in a magic set will not make your character bare handed, it will do nothing, this is useful if you are using a weapon or even spells that you don’t want to get unequipped when you load a magic set.\r\n\r\n[color=#BBFF77][b]-> Assign a hotkey to a Magic Set[/b][/color]\r\nTo assign a magic set to a hotkey, you need the ring for each corresponding set, this ring have no value or weight, but when you try to equip it, all your magic set will be equipped instead. I prefer this approach than assign specific hotkeys, from my understanding it maintains better compatibility with mods that changes the way the favorite menu behave or any other mod that messes up the hotkeys. From the games point of view it is just another accessory to equip.\r\n          \r\nTo obtain the ring assigned to a magic set, you have to go to the magic set page and press the [i]Ring[/i] option in the lower left of the menu, this option will toggle between [i]add[/i] and [i]remove[/i], depending if you have the ring or not in your inventory. The reason it is implemented this way is to give you the freedom to choose the number of rings you really want, instead of just adding all 9 rings to your inventory at the mod initialization. And yes, you can add a ring, drop it, and create another one just to drop it too, until you have a room filled with rings. I did not want to implement something to prevent this kind of behavior.\r\n\r\nThe ring has no biped slot assigned to it, what that means is that the rings of this mod will not unequipped any item from another mod, or at least is really unlikely, even if you have a mod to give you the ability to equip earrings,  cloaks, piercings, etc.\r\n\r\n[color=#BBFF77][b]-> Assign spells to your Magic Set[/b][/color]\r\nUpdating your magic sets should be easy, you have to equip the spells to your character first, then go to the magic set page and press the text options to assign them, if you press the default key the slot will empty. For the [i]auto cast[/i] option, it will toggle between your left and right hand spell each time you select it.\r\n\r\n[color=#BBFF77][b]-> The auto cast feature[/b][/color]\r\nSpells selected in the auto cast option will be cast one second after you equip the magic set, you can use this time to switch between main and secondary sets, or even another magic set. When the time is up, the auto cast of the current magic set will be executed.\r\n\r\nTo prevent users from abusing the auto cast feature, it has a 5 second cooldown, you can still switch between magic sets within this time, but there will be no auto cast, however the last auto cast spell will be queued, and as soon as the cooldown ends, that spell will be cast.\r\n\r\nYou can assign any spell to be an auto cast spell, even the ones that need a target, but I highly recommend using only cast-on-oneself spells and avoid concentration spells that need to be hold on to be useful, for example, use [color=#CCCCFF][i]Fast Healing[/i][/color] instead of [color=#CCCCFF][i]Healing[/i][/color]. There is no way to dual cast an auto cast spell, and not all the spells will behave the way they should, you have to experiment with this option and see if everything is ok.\r\n\r\nWhat I had in mind for the auto cast feature was something like an opening spell, for example, automatically dual cast a [color=#CCCCFF][i]Flame Cloak[/i][/color] spell and just after you character finishes the animation switch to a dual [color=#CCCCFF][i]Fireball[/i][/color] spell for you to use in your fight. But limitations in papyrus negates this kind of behavior, so I came up with the secondary set idea and I kept the [i]auto cast[/i] option only to give little assistance when you change between magic sets.\r\n\r\n\r\n[color=#66CCCC][size=5][b][u]Compatibility[/u][/b][/size][/color]\r\n\r\nI did my best to program this mod to be compatible with any other mod. I tested it with [url=http://skyrim.nexusmods.com/mods/16225]Apocalypse Spell Package[/url] and [url=http://skyrim.nexusmods.com/mods/2275]Balanced Magic[/url].\r\n\r\n\r\n[color=#66CCCC][size=5][b][u]Recommended Mods[/u][/b][/size][/color]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/35178]Vanilla Magic Tweaks[/url]\r\nI did this mod to make [color=#CCCCFF][i]Detect Life[/i][/color], [color=#CCCCFF][i]Detect Undead[/i][/color] and [color=#CCCCFF][i]Clairvoyance[/i][/color] spells viable for auto cast, and along the way I made a toggle version of [color=#CCCCFF][i]Candlelight[/i][/color] spell.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/5312]Acquisitive Soul Gems[/url]\r\nThe way soul gems should behave, give it a try, you won’t be disappointed.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/2275]Balanced Magic[/url]\r\nAnother [i]must have[/i] mod if you are a magic user. This mod changes vanilla magic spells to be more useful without breaking game immersion.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/246]Better Xbox360 Controller - 8 hotkeys[/url]\r\nThis is the mod I use for my xbox360 controller, and it is perfect to have all those hotkeys at your disposal if you are using my mod.\r\n\r\n\r\n[color=#66CCCC][size=5][b][u]Credits[/u][/b][/size][/color]\r\n\r\n[b]Author:[/b] [color=#BBFF77]NeoRunek[/color]\r\n[b]Special Thanks to:[/b] [color=#BBFF77]Zeitz[/color] (Logo designer)",
  "categoryId": "93",
  "version": "1.0",
  "author": "NeoRunek",
  "createdUnix": "1366954085",
  "updatedUnix": "1366953808",
  "containsAdultContent": false,
  "uploadedBy": "NeoRunek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026506",
      "name": "EZ Magic Sets",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "456",
      "fileName": "EZ Magic Sets-35179-1-0.7z",
      "uploadedUnix": "1366953808",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/650c80a14e323e57ed6e315cd67ead9af6f51bf9c86d62fff310d909a6106ad1/analysis/1407540066/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EZ%20Magic%20Sets-35179-1-0.7z?fid=1000026506&ttl=1535813566&ri=8192&rs=8192&setec=686e81b2e4aa4805aba612c81575eb7d"
    }
  ]
}