{
  "modId": 35188.0,
  "modName": "Shadowrend - lautasantenni",
  "summary": "This mod adds the legendary blade Shadowrend from Oblivion - The Shivering isles expansion to Skyrim, with a slight attemp to re-create the way it was originally claimed. REQUIRES DAWNGUARD&#33;",
  "descriptionHtml": "-=REQUIRES DAWNGUARD&#33;=-\r<br />\r<br />Summary:\r<br />--------\r<br />\r<br />This mod adds the famous shadow sword know as &#39;Shadowrend&#39; to the world of Skyrim from the previous elderscrolls tittle; Oblivion - The Shivering Isles expansion. Shadowrend was originally a part of a quest during the Shivering Isles plot that you were able to claim after you faught and defeated a shadow replica of yourself. This mod adds the sword with a slight attemp to remake that battle with the shadow. To discover the secret of the shadowrend, travel to the college of Winterhold, enter the Arcaneum and look for a black colored conjuration spell book under a journal. The journal will tell where you need to go and what to do.\r<br />\r<br />The sword itself is very agile one handed or two handed sword, that is decided upon you defeating the shadow. If your *base* skill with one handed weapons is greater than with two handed weapons, shadowrend will be a one handed sword. If your skill with two handed weapons is greater OR equal, it will be a two handed blade.\r<br />\r<br />The sword is not identical to the one in Oblivion. I have remade the blade with a bit of more of the &#34;twin snakes&#34; motif to it.\r<br />\r<br />Optional ESP\r<br />-----------------\r<br />\r<br />This optional version of the Shadowrend mod will change the location of the books from college to Kjenstag Ruins in the swamp for those who do not wish to join the college etc.\r<br />\r<br />\r<br />Weapon Stats:\r<br />-------------\r<br />\r<br />Base Damage:\r<br />\r<br />2handed sword: 22\r<br />(daedric claymore for example has 24)\r<br />\r<br />1handed sword: 12\r<br />(daedric longsword has 14)\r<br />\r<br />Weapon Speed:\r<br />\r<br />2handed sword: 0.920\r<br />(a base 2handed sword has 0.700)\r<br />\r<br />1handed sword 1.100\r<br />(base 1handed sword has 1.000)\r<br />\r<br />Special abilities:\r<br />\r<br />The sword(s) will ignore 50% of the enemy&#39;s armor rate and will cause 30pt stamina damage and 10pt health damage for 3 seconds. The sword has infinite enchantment energy.\r<br />\r<br />\r<br />Installation:\r<br />-------------\r<br />\r<br />Extract the &#34;Data&#34; folder tree in the zip archive to your: ...Steam&#92;SteamApps&#92;Common&#92;Skyrim&#92; -so that it overwrites your Data folder in the Skyrim -folder. This will put the folders and files in the zip to their correct places. After that, run your &#34;SkyrimLauncher.exe&#34; and click the DATA button. Find the &#34;Shadowrend.esp&#34; and check that it is enabled. To disable the mod, just uncheck the box.\r<br />\r<br />\r<br />HINT SPOILERS:\r<br />-----\r<br />\r<br />If you do not know how to claim the sword after you find the journal, do just this:\r<br />Travel to Morthal and head out of the town across the bridge to the north. Keep going a little more north until you find the stone pedestal that Fallion always lurks around during the night. Make a quicksave here. Cast the &#34;Provoke Shadow&#34; spell at the pedestal and it should make the &#39;Reflection&#39; creature spawn. After if dies, it will explode and leave behind the shadowrend. Look carefully if it fell onto the grass. Sometimes the sword can fell through the ground if the &#34;Reflection&#34; was in a awkward position when it died, so just quickload if this happens.",
  "categoryId": "55",
  "version": "1.10",
  "author": "lautasantenni",
  "createdUnix": "1366825763",
  "updatedUnix": "1366832628",
  "containsAdultContent": false,
  "uploadedBy": "lautasantenni",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026255",
      "name": "Shadowrend Mainfile",
      "version": "1.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1651",
      "fileName": "Shadowrend Mainfile-35188-1-10.7z",
      "uploadedUnix": "1366832628",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/534bbf985dfede98d001c573210a9de4f9c667fb769ff116c502cd13f18fab69/analysis/1407537936/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shadowrend%20Mainfile-35188-1-10.7z?fid=1000026255&ttl=1535813576&ri=8192&rs=8192&setec=f4e296dea6120717ec6c2b50a3572667"
    }
  ]
}