{
  "modId": 35204.0,
  "modName": "Vulfen The Spellsword - Werewolf - Follower",
  "summary": "Ever wanted a follower that felt unique? How about one that fights in multiple styles?\r\nHeres Vulfen, a Breton heavy armored mage, who spam\\'s lightening bolts as he approaches the enemy, casts unique and lore friendly conjuration pets, is handy with a mace and when the time is required, can release his inner werewolf and go all berserk on offence.",
  "descriptionHtml": "Notes: Requires Dawnguard and latest 9.** Patch. Please mind my English. :)\r\n\r\nStrongly Recommended for use with Vulfen: \r\nMantle of the Silver Hand by *Hothtrooper44* - (http://skyrim.nexusmods.com/mods/34615/) the armour worn by Vulfen in the pictures.\r\nAmazing Follower Tweaks by *Dheuster* - (http://skyrim.nexusmods.com/mods/15524) Multiple follower mod and recognises Vulfen as a werewolf and used in Werewolf Follower Mechanics. You can use UFO if you prefer but I can\\'t support it as I use AFT for the werewolf aspect.\r\n\r\nFelt a little letdown by the lack of a good spellsword follower in Skyrim? I was, Belrand stats seemed all messed up and  J\\'zargo played mostly as a mage, despite his use of heavy armour and one handed. \r\n\r\nSo I created my own Follower that matched my favourite character I made for skyrim: \r\n\r\nHeres Vulfen, a Breton heavy armored mage, who spam\\'s lightening bolts as he approaches the enemy, casts unique and lore friendly conjuration pets, is handy with a mace and when the time is required, can release his inner werewolf and go all berserk on offence.\r\n\r\nMade with Skyre balance in mind, he starts in 100 in all stats like all other NPCs in that mod and the player, uses his own spellsword class that levels about the same as the other Spellsword class, given his mindset about defence and lore, I\\'ve given him the heavy armoured perks and Twincast for his pack.  He should be found in the Drunken Huntsman in Whiterun, and with the armoraddon, there should be a mantle for you to pickup to equip Vulfen with right away. He levels with he player so will match your level.\r\n\r\nSpells are custom crafted but balanced by the engine, only useable in the left hand so that he will keep out his mace and move in to lay the smackdown more often. He won\\'t compare to a true warrior in melee attack wise, but between his unique pets, defence and varity of fighting styles he should outlast most fights one on one without feeling overpowered. One time he might hang back, send a pet in and fight as a mage flinging spells, the next fight he could be casting flamecloak and wading in melee, just like a flexible spellsword should!\r\n\r\nHe comes with his own two unique lore summons that he will cast at random during combat. They both fill a unique role in combat, a wolf with high hp but low damage, able to take a few hits but mostly a distraction, and a werewolf the crowd controller, this summon has low hp but can occasionally knock over foes. They level with Vulfen so should always be a little use during combat,  they are mostly just distractions, the powers in the Alpha of the pack that is Vulfen!\r\n\r\nWant him to fight more as a mage? A few tweaks with AFT, set him to magic and staff, give him a few mage staffs if desired and he will dual wield lightening bolts and use staffs, resorting to archery if he has no mana like all mage followers.\r\n\r\nWant a more melee character or werewolf? Disable his casting ability and set him to sword and shield in AFT. Tell him to turn into a werewolf at combat start, 50% health or whenever you command. The choice is yours on how you want him to fight. :)\r\n\r\nWith default leveling he levels Heavy armor, one handed, conjuration and destuction, with a few points in Restoration and Alteration. \r\n\r\nWant a more sneaky Vulfen? He also levels light armor and sneak at an average rate, this isn\\'t supported by perks or lore, but the options there if it works for your play-style. With Manual leveling In AFT you can pritty much customise him to whatever style of follower you\\'d like.\r\n\r\nI\\'d created a custom voiced follower in the past and have loads of lore in my head, quests and more if this is well liked and I can get in the mood, but he should be fully working as a follower now, through any bug reports or balance issues are welcomed.\r\n\r\nAs for mod placement requirements in loadorder Make sure it goes something like this:\r\n--\r\nAFT\r\nMantle\r\nVulfen\r\nVulfenArmorAddon\r\n--\r\nThey don\\'t have to be next to each other just in that kind of order going down to bottom.\r\n\r\nI play with Skyre, Asus, frostfall and lots of other hard enhancing mods so multiple followers and lots of party based fun is required. :)\r\n\r\nThanks goes to Hothtrooper44 for permission to use his armour. Dheuster for the awesome mod and Darkfox127 for his awesome Tutorials. (http://darkfox127productions.weebly.com/index.html)\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "eyupwolf",
  "createdUnix": "1366851936",
  "updatedUnix": "1366848185",
  "containsAdultContent": false,
  "uploadedBy": "eyupwolf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026301",
      "name": "Vulfen",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Vulfen-35204-1-0.7z",
      "uploadedUnix": "1366848185",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/691721d99b95542409b81ce970d6e5a816b03716e8d8de1465c43582d20b4bc2/analysis/1407538209/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vulfen-35204-1-0.7z?fid=1000026301&ttl=1535813596&ri=8192&rs=8192&setec=6a1aa9a670687e93a1605239228b9749"
    }
  ]
}