{
  "modId": 35200.0,
  "modName": "Death Mountain",
  "summary": "Chapter One: Death Mountain\r<br />An evil is hidden beyond the cold mountains, An evil that knows no mercy, a young sorceress in danger, Death Mountain rises up before you, once you advance in their domains, nothing will ever be the same.",
  "descriptionHtml": "[font=Georgia][center]\r<br />\r<br />[img]http://i.imgur.com/KDMx5aA.png[/img][/center]\r<br />\r<br />[center][color=#a47a08][size=3]In a tower shrouded by mystery and crumbling with evildoers, surrounded by a vast castle filled with foes and creatures of dark, on an inconceivably enormous mountain floating above the land of Skyrim, one soul of a dragon may be able to defeat the worst of enemies. \r<br />To get there, the Dragonborn must defeat foes of all shapes and sizes, from skeletons and draugrs, through Falmer and creatures from Oblivion and all the way to full fledged dragons, who all have three things in common: They are strong, they are mad, and they are willing, able and eager to kill. \r<br />In order to overcome the challenge ahead, the Dragonborn may acquire new weapons, learn new spells, study the history of Skyrim and Death Mountain, earn the trust of the few good people on Death Mountain, gaining new followers, and leading them to safety. On Death Mountain, the Last Dragonborn may reach their most dangerous and difficult challenge yet. \r<br />The quest to the Underworld will be unfolded as the Dragonborn advances through Death Mountain. Whether or not the Dragonborn will succeed? That story, my friend, will have to be written by you.\r<br />\r<br />Descrition of Mod by [url=http://www.nexusmods.com/games/users/21498159] Itamar310[/url]\r<br />     \r<br />\r<br />[line]\r<br />\r<br />[center][img]http://i.imgur.com/AQnKMYG.png[/img][/center]\r<br />\r<br />Death Mountain Trilogy\r<br />Written and Created by Oblivionlaserie\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/35200/?]Chapter One: Death Mountain[/url] \r<br />[url=http://www.nexusmods.com/skyrim/mods/58311/?]Chapter Two: The Beginning of the End[/url] \r<br />Chapter Three: The Lady Dark\r<br />\r<br />Chapter One: &#34;Death Mountain&#34; is the first chapter of my trilogy, is a particular project began as the great Elders Scroll V &#34;Skyrim&#34;, a project that began as one of the future scenario Skyrim Saga comic and after nearly a year of work and many problems solved by the difficult location of the mod took shape as mod. 100% playable,by [url=http://skyrim.nexusmods.com/users/2002999] Sanchez (ilpinfas)[/url] and [url=http://skyrim.nexusmods.com/users/1170735] Perdida[/url] for your help and good advice, without which this project would not be a reality today, tanks.\r<br />\r<br />I comment that said:\r<br />Death Mountain is a fortress located in the skies of skyrim, full of enemies.\r<br />Death Mountain will require a very high level of experience, and there will be many dangers they will have to bite along the entire adventure, from the beginning of the story we will face many struggles and great battles for survival that will test the true dragon blood.\r<br />\r<br />In this video [url=http://skyrim.nexusmods.com/mods/34909] Death Mountain Trailer -The Beginning-[/url] where he tells the origins of history.\r<br />\r<br />Death Mountain is made up of several Quest, in which we will move finding various hidden notes, which show us the way forward, during our tour we will discover as you enter the large tower, and will not be otherwise than finding the keys that close each area and only get by defeating enemies who guard.\r<br />\r<br />Once we maintain the master key, the great tower will be at our disposal and we use it as our home, which we won with blood and steel.\r<br />\r<br />Also at this time we have at our disposal several areas in which to stock up on different merchants, and rest from the arduous struggle, these airlines can find our allies and followers which are formed in various arts of combat and use the thu `ums, language of the dragon, which will be of inestimable help to the battles that still lie ahead.\r<br />\r<br />If you thought your adventure was completed to find and make yours the Great Tower, you are very wrong, even you Death Mountain is to free his master and Lord which is in the depths of the mountain, at a place called the Underworld , but that story will have to write it yourself.\r<br />\r<br />Lucky Dragon&#39;s Blood\r<br />\r<br />[img]http://i.imgur.com/AdS04Oa.png[/img]\r<br />\r<br />Because of the difficulty for the mod, I have thought proper to make a book which is a guide to all the secrets of the mod, the book itself is part of the mod and what you can find in the Nerelia house and the first destination mod, the guidebook is intended to be used in case things get tough and you should find the way to go, I advise you will use it wisely, because in its pages will be unveiled secrets and places of Death Mountain, be it really is if you are going to use.\r<br />\r<br />[img]http://i.imgur.com/hlWBeOe.png[/img]\r<br />\r<br />I leave my job one year, you will say if it was worth it, I feel very proud to have completed this project and have made a few more hours of gameplay in this great game, I apologize if I made any mistakes in the translation the English who have insurance, but has been a difficult decision to launch the English-speaking mod, not my native language. If you have got two minutes I would like to know your opinion about the mod.\r<br />\r<br />Tell the artists are free to make videos and  pictures of this project, I ask only that  communicate me  for thank  and continue your great work.\r<br />\r<br />Greetings and I hope you enjoy it.[/size][/color][/center]\r<br />\r<br />[line]\r<br />\r<br />[center][img]http://i.imgur.com/4DgcyRV.png[/img][/center]\r<br />\r<br />[center][size=3][color=#cf5454]The NPCs, Daedric Guard inside and outside The Great Tower and the Five Dragons that are outside the fortress Death Mountain are neutral Allies, not attack unless you do your before[/color]\r<br />\r<br />[color=#a47a08]The mod consists of two locations as I have appointed, Nerelia&#39;s house, as in Death Mountain, the Great Tower and exterior rooms are places specially created for future Player&#39;s private, it would be impossible to list the contenders, Craftin, appliances, mobility and other containing all the rooms, just know that your character will be able to use them freely, as your followers.\r<br />\r<br />The following map shows the two locations of the mod, only visible at the beginning of the adventure the brand on the map Nerelia house, look for notes on the young sorceress in the basement of your home and you will find the clues to follow in this part of the adventure.\r<br />\r<br />[img]http://i.imgur.com/hRTOTex.png[/img]\r<br />\r<br />The only way to enter the realms of Death Mountain, is crossing the bridge abysmal skeletons, one wrong step and not shall count.\r<br />Guard daedric five dragons, winged fortress guard, but do not be afraid, they will recognize the true Dragon Bloods and do not be hostile, of course, if for any reason they feel threatened by the new visitor, you shall not will see a new dawn.\r<br />\r<br />Once you are in your hands the key to The Tower, you will have all areas at your disposal, it is now that you can choose the way to go, the two missions that await you, bite the Daedra Lord and Lord of Death Mountain or find and free the young Sorceress Nerelia, whatever your decision there are still many secrets to uncover during your search.\r<br />\r<br />[img]http://i.imgur.com/DfUikuQ.png[/img]\r<br />\r<br />In the surroundings of Death Mountain, there is a passage through an abandoned mine, called the passage of death. This step connects the two sides of the mountains near Death Mountain, this step will only be accessible if you posses the master key to The Tower in your power, only then you can come across for this step, a mine full of riches from which you can extract all kinds of minerals, but also shelters very-high enemies, deadly enemies.\r<br />\r<br />[img]http://i.imgur.com/8Pkka1M.png[/img]\r<br />\r<br />Death Mountain is a floating fortress walled outbuildings includes, sides and central, and interior lots in the next map shows all entries that comprise, where you can see the buildings as inputs which has the Great Tower and heart of the Mountain.\r<br />\r<br />[img]http://i.imgur.com/uRpCz2k.png[/img]\r<br />\r<br />There are many rooms specially edited in the mountains where you will find items that will help you in your adventure I commented some of them:[/color]\r<br />\r<br />[color=#8a0b0b]WEAPONS:[/color]\r<br />\r<br />[color=#a47a08]There are various weapons and arrows specially created for your confrontations with enemies that I will come to pass, these unique weapons in the game have a very high destruction power and can destroy their major rivals. But keep in mind that these weapons in enemy hands are lethal to the player, so be careful with Disarm Shout.[/color]\r<br />\r<br />[color=#8a0b0b]SPELLS:[/color]\r<br />\r<br />[color=#a47a08]You can find several books with which you will learn new spells that will greatly help you in your battles.[/color]\r<br />\r<br />[color=#8a0b0b]BOOKS:[/color]\r<br />\r<br />[color=#a47a08]There are five volumes of the History Skyrim Saga, each book will add a point found in different skills experience in these books tells part of the story for which was conceived in mod, an original story that will take you deep into a world of fantasy, the five volumes are scattered areas of Death Mountain.[/color]\r<br />\r<br />[color=#8a0b0b]FOLLOWERS:[/color]\r<br />\r<br />[color=#a47a08]There are a total of nine followers edited especially for this story, nine followers that you can find this in your power once the master key of the Great Tower, the find in the outdoor rooms in the resort, the inn and canteen, each follower is specialized in a particular fighting style, each of them knows the language of the dragon, thu `ums and taken out of many troubles you also have the option of marriage and you can make them your spouse.\r<br />\r<br />These are some of the followers specially designed for Great Battles that await you and which you can get their services. You only have to find in the different rooms of the Great Tower.[/color]\r<br />\r<br />\r<br />[color=#8a0b0b]STAYS:[/color]\r<br />\r<br />[color=#a47a08]In the interior rooms of the tower and the exterior you will find everything you need for your stay in this remote and cold place,\r<br />\r<br />- Crafting\r<br />- Weapon Racks\r<br />- Secure Containers\r<br />- Ingredients\r<br />- Potions\r<br />- Minerals\r<br />- Bedrooms\r<br />- Armories\r<br />- Mannequins\r<br />- Etc...\r<br />\r<br />[img]http://i.imgur.com/9ambGOl.png[/img][/color]\r<br />\r<br />[color=#8a0b0b]ADVICES:[/color]\r<br />\r<br />[color=#cf5454]The NPCs, Daedric Guard inside and outside The Great Tower and the Five Dragons that are outside the fortress Death Mountain are neutral Allies, not attack unless you do your before.\r<br />\r<br />First and most important is the level of character that you may begin your adventure, as the mod is intended as a challenge to pure bloods of Dragon, I advise a level above 40 and still the help of a follower will almost essential to be victorious in some of the Great Battles that await you.\r<br />\r<br />Due to the difficulty of the enemies I advise save game  often to not have unwanted surprises.\r<br />\r<br />The  Dragons of  tower sometimes not pose well in the walls of the tower, you only Have to gain an hour in the game to return to fly and land again, This Will happen When exit to stays to outer.\r<br />\r<br />We recommend a PC for high performance, but if you find slow-down near the fortress in your pc, save game, exit the game, and reload the game.\r<br />\r<br />In the stable Nerelia house is his horse, &#34;Red Shadow&#34;, which can be mounted and so your long journey to Death Mountain will be much faster.\r<br />\r<br />I advise you to go step by step and not spending any overlooked element as hidden keys and notes can be where less images.\r<br />\r<br />At home you have the guidebook Nerelia, take him with you always if You&#39;re under stuck at any point in the adventure, and canceréis a look which is your next destination.\r<br />\r<br />[img]http://i.imgur.com/5dmn2B8.png[/img]\r<br />\r<br />For those of you seems too hard some of Battles, in your journey and in strategic places you count weapons, arrows and spells special insurance will be of great help to succeed.\r<br />\r<br />Search rest stays there for the scenarios so you can upload your skills and use potions in big strife scattered.[/color]\r<br />\r<br />[color=#8a0b0b]BATTLES:[/color]\r<br />\r<br />[color=#a47a08]One of the great attractions and stands what the mod will undoubtedly their Great Battles, Just approach the vicinity of Death Mountain you will know what I mean and it&#39;s where you have to use what they learned in Skyrim without I certainly cost them quite out victorious.\r<br />\r<br />Undead armies of the Dark Legion try to shed your blood and make you finish not started your adventure alive.\r<br />\r<br />The mod consists of five great battles of a high standard, large number of enemies at once, led by Ordás draug skeletons and dragons will attack without mercy, especially enemies edited, with great potential for life and regeneration, do not put your trust nor the most mere skeleton as you can down in one fell swoop.\r<br />\r<br />Good luck and enjoy it if you can, XD\r<br />\r<br />[img]http://i.imgur.com/bGG3PAO.png[/img]\r<br />\r<br />May the gods guide your destiny.[/color][/size][/center]\r<br />\r<br />[line]\r<br />\r<br />[center][size=5][color=#a47a08]LANGUAGE:[/color][/size][/center]\r<br />[center][color=#a47a08][size=3]Avaiable: English\r<br />\r<br />Translation \r<br />Chinese: LingYang Tan\r<br />Deutsche:[url=http://www.nexusmods.com/games/users/8185401]Novem99[/url]\r<br />Russian:[url=http://www.nexusmods.com/games/users/2712510/?]DWayfer[/url][/size][/color][/center]\r<br />\r<br />\r<br />[line]\r<br />\r<br />[center][img]http://i.imgur.com/IUSs1oT.png[/img][/center]\r<br />\r<br />[center][size=3][color=#a47a08]You can see the video made especially for Death Mountain, in which he recounts the origin of the story are you about to begin, but in Death Mountain nevertheless I await many more surprises to uncover.[/color][/size][/center][size=3]\r<br />\r<br />[center][youtube]QRGBL2c0BPQ[/youtube][/center]\r<br />\r<br />[/size][center][size=3][color=#a47a08]Coming Soon Second Part[/color][/size][/center]\r<br />\r<br />[center][youtube]VuTJzQjdPNg[/youtube][/center]\r<br />\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/52559/?] DEATH MOUNTAIN 2 [/url][/center]\r<br />\r<br />[line]\r<br />\r<br />[center][img]http://i.imgur.com/Ucb4ju9.png[/img][/center]\r<br />\r<br />[center][size=3][color=#a47a08]You only need Skyrim\r<br />No need any other mod, and none of the DCL.\r<br />It is also recommended to have Skyrim latest update.[/color]\r<br />\r<br />[color=#8a0b0b]VERSIONS:[/color]\r<br />\r<br />[color=#a47a08]Extreme Version:\r<br />\r<br />-Extreme difficulty level,\r<br />-Greater number of simultaneous enemies in the battles,\r<br />-Higher level of difficulty,\r<br />-Requires a lot of PC performance.\r<br />-The outside of the Fortress custody for Five Dragons Allies and lots of NPC&#39;s (Guards Daedric Allied) guarding the area.\r<br />\r<br />\r<br />Light Version:\r<br />\r<br />-Normal Difficulty Level\r<br />-Few enemies simultaneous in Battles\r<br />-Lowest level of difficulty\r<br />-Requires lower PC performance\r<br />-Exterior of the zone guarded by two Dragons Allies and two daedric Allied patrols Guards patrolling the area.[/color][/size]\r<br />\r<br />\r<br />[line]\r<br />\r<br />[center][size=3][img]http://i.imgur.com/B9Fz7gZ.png[/img]\r<br />\r<br />[color=#a47a08]Option 1. Use NMM (recommended).\r<br />or\r<br />Option 2. Simply extract the file with Winrar or 7zip.\r<br />The mod data folder contains two files one esp. and bsa. Install these two files manually into the Skyrim data folder. \r<br />enjoy[/color][/size][/center]\r<br />\r<br />[line]\r<br />\r<br />[center][img]http://i.imgur.com/IA1NhvU.png[/img][/center]\r<br />\r<br />[center][size=3][color=#a47a08]Deactivate the esp file in the mod manager of your choice (default Skyrim director, NMM, etc.) \r<br />Delete the esp and bsa file in the data folder of your Skyrim.[/color][/size][/center][size=3]\r<br />\r<br />[line]\r<br />\r<br />[center][img]http://i.imgur.com/Qy1BKp1.png[/img][/center]\r<br />\r<br />[center][size=3][color=#a47a08]Only mods may not be compatible with buildings that occupy the same field in Skyrim.\r<br />Fixed the problem with the mission &#34;The Taste of Death&#34; , thanks to user &#34;Cappito&#34;\r<br />Incompatibility with the Mod &#34;The Secret Of Dragonhead&#34; by Manny GT. [/color][/size][/center]\r<br />\r<br />[line]\r<br />\r<br />[center][img]http://i.imgur.com/gkJpFhK.png[/img][/center]\r<br />\r<br />[center][size=3][color=#a47a08]Ask before using any of the resources from Death Mountain, and don&#39;t upload at  Steam Workshop and the anywhere else without permission.\r<br />Please refrain from distributing an unmodified version of this mod without my written permission.\r<br />Contact me for permission on subjects not covered by these aforementioned terms.[/color][/size][/center]\r<br />\r<br />[line]\r<br />\r<br />[center][img]http://i.imgur.com/S9UeGbl.png[/img][/center]\r<br />\r<br />[size=3][color=#a47a08]For more information, followed in this Web:\r<br />[url=http://oblisanteam.creatuforo.es/foro.html]ObliSan Team Forum[/url]\r<br />[url=http://oblisanteam.blogspot.com.es]ObliSan Team Blog[/url]\r<br />[url=http://www.taringa.net/comunidades/oblisan/]ObliSan Team Web[/url]\r<br />Thank the members of the team, without whose help and support this project would not be possible.\r<br />\r<br />Thank:\r<br />[url=http://skyrim.nexusmods.com/users/2002999] Sanchez (ilpinfas)[/url] \r<br />[url=http://skyrim.nexusmods.com/users/1170735] Perdida[/url] \r<br />[url=http://skyrim.nexusmods.com/users/4941348] TenshiSP[/url]\r<br />\r<br />And Thank for Translation \r<br />Chinese: LingYang Tan\r<br />Deutsche:[url=http://www.nexusmods.com/games/users/8185401]Novem99[/url]\r<br />Russian:[url=http://www.nexusmods.com/games/users/2712510/?]DWayfer[/url]\r<br />\r<br />OBLISAN TEAM 2012-2013\r<br />\r<br />[/color][/size][/size][/center][/font]",
  "categoryId": "35",
  "version": "1.2",
  "author": "Oblivionlaserie",
  "createdUnix": "1367576294",
  "updatedUnix": "1442046647",
  "containsAdultContent": false,
  "uploadedBy": "Oblivionlaserie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027584",
      "name": "Death Mountain V 1.0",
      "version": "Latest Version",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "70646",
      "fileName": "Death Mountain-35200-.rar",
      "uploadedUnix": "1367491148",
      "modVersion": "Latest Version",
      "virusScanUrl": "https://www.virustotal.com/file/e465354b9575b22435645c4fd7505c832b1b774874aba54473db762d3f182e82/analysis/1407551026/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain-35200-.rar?fid=1000027584&ttl=1535813587&ri=8192&rs=8192&setec=1852651f1488aa3d6d18d2235b5cdcc7"
    },
    {
      "fileId": "1000028258",
      "name": "Death Mountain Guide",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "17081",
      "fileName": "Death Mountain Guide-35200-.rar",
      "uploadedUnix": "1367768028",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3c566542dacfdb7a2b4c5a7e944e045c9f457d29541ecc1a9ea850f9c2230f1e/analysis/1407556094/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%20Guide-35200-.rar?fid=1000028258&ttl=1535813588&ri=8192&rs=8192&setec=9c688d6cf0637b67fbb6d4efaa3ea45d"
    },
    {
      "fileId": "1000029574",
      "name": "Death Mountain V 1.0 -Light Version- ",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "70643",
      "fileName": "Death Mountain Light Version-35200-.rar",
      "uploadedUnix": "1368387820",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c655d563cf6f3a756e3d4e6ab67b98c49955120a6da26880c892e861e8d11e2f/analysis/1407567079/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%20Light%20Version-35200-.rar?fid=1000029574&ttl=1535813588&ri=8192&rs=8192&setec=8f132ee3868ac394b291aa6cf92fbeb7"
    },
    {
      "fileId": "1000091414",
      "name": "Death Mountain V 1.0 Chinese Translation",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1374",
      "fileName": "Death Mountain Chinese Translation-35200-.rar",
      "uploadedUnix": "1389689470",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5aab3ccb955c88082ed4b4e5170542ad15ef975ba94d60ae97653d13af3caaae/analysis/1407885619/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%20Chinese%20Translation-35200-.rar?fid=1000091414&ttl=1535813588&ri=8192&rs=8192&setec=41fb15d705d651cda478b228240dcede"
    },
    {
      "fileId": "1000091415",
      "name": "Death Mountain V 1.0 -Light Version- Chinese Translation",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1369",
      "fileName": "Death Mountain Light Version Chinese Translation-35200-.rar",
      "uploadedUnix": "1389689535",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1c1095947a88b543f7c660ddcc8ec9e801ffbba11fca8ee39528cf55fea1a20a/analysis/1407885621/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%20Light%20Version%20Chinese%20Translation-35200-.rar?fid=1000091415&ttl=1535813589&ri=8192&rs=8192&setec=2ee0f386b768a6c57977ae189304c82f"
    },
    {
      "fileId": "1000126394",
      "name": "Death Mountain V 1.1",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "70718",
      "fileName": "Death Mountain V 1.1-35200-1-1.rar",
      "uploadedUnix": "1410424463",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4769796b9ea9bb7fbea694341ec3af8c0c6982432550615b526d571d737f41dd/analysis/1410424580/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%20V%201.1-35200-1-1.rar?fid=1000126394&ttl=1535813589&ri=8192&rs=8192&setec=1c5e0d389bfe7a3a457844e5789b2c7b"
    },
    {
      "fileId": "1000126396",
      "name": "Death Mountain V 1.0 - Deutsche Version Translation",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1436",
      "fileName": "Death Mountain - Deutsche Version Translation-35200-.zip",
      "uploadedUnix": "1410425855",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/78b18a7849046066eb0da34f6e822708c43497f124211fc9edca2aff3c8e47bb/analysis/1410425943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%20-%20Deutsche%20Version%20Translation-35200-.zip?fid=1000126396&ttl=1535813590&ri=8192&rs=8192&setec=2912ce75abdfa833e2c7f844106cf937"
    },
    {
      "fileId": "1000134549",
      "name": "Death Mountain V 1.1 - Russian Version Translation",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1438",
      "fileName": "Death Mountain V 1.1 - Russian Version Translation-35200-1-1.rar",
      "uploadedUnix": "1415524525",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e7b384c2a30a392c4f5298d7029cb03841c3929293f6c7712cf9477d4d2f2128/analysis/1415524623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%20V%201.1%20-%20Russian%20Version%20Translation-35200-1-1.rar?fid=1000134549&ttl=1535813590&ri=8192&rs=8192&setec=9189abb995524d42c8ab02006b2baefc"
    },
    {
      "fileId": "1000175690",
      "name": "Death Mountain V 1.2 -Extreme Version-",
      "version": "1.2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "70718",
      "fileName": "Death Mountain V 1.2 -Extreme Version--35200-1-2.rar",
      "uploadedUnix": "1442045163",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/f4d1bac633a62130cee168c384db4f6b6ea8bf9be2d6849a8e8755e1dbe37f30/analysis/1442045238/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%20V%201.2%20-Extreme%20Version--35200-1-2.rar?fid=1000175690&ttl=1535813591&ri=8192&rs=8192&setec=6e85de9a5b529bf5a2a4604b7445ae48"
    },
    {
      "fileId": "1000175692",
      "name": "Death Mountain V 1.2 -Light Version-",
      "version": "1.2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "70643",
      "fileName": "Death Mountain V 1.2 -Light Version--35200-1-2.rar",
      "uploadedUnix": "1442046647",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/9296d5fb6103e3a8bc7c7254bbc11f3e7a06c76f91bdfac8cf6994e5d9d5c9ec/analysis/1442046677/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%20V%201.2%20-Light%20Version--35200-1-2.rar?fid=1000175692&ttl=1535813591&ri=8192&rs=8192&setec=b1d07564e71ebff6402b622dbc6fd4fb"
    }
  ]
}