{
  "modId": 35205.0,
  "modName": "Cooking Is A Job Mod",
  "summary": "Have a job as a cook!",
  "descriptionHtml": "Ever noticed how expensive food ingredients are compared to the food itself? Ever notice how the weight-effect ratio of the food makes food nearly useless compared to potions?\r\nEver wanted to just live a normal life and be a cook?\r\n\r\nThis is a small mod where cooking complex food actually makes money.\r\n\r\nEDIT: I noticed earlier that I didn\\'t say exactly what the mod contains. Basically, it increases the  price of the more complex cook-able food and increases their effectiveness, depending on how complex it is. For example, the most effective one, Venison Stew, was revamped to be actually effective in battle, but buying/selling it would take loads of money.\r\n\r\nI recommend not using any console commands, exploits, or mods to make barrels or shops reset faster, as the mod loses its point of making you work to find ingredients.\r\n\r\nI would like to recommend the Work a Steady Job as a Blacksmith mod by Blacksmith Job Project Team http://skyrim.nexusmods.com/mods/16782\r\n\r\nThis is my first mod. Please make your comments useful and troll-free.\r\nJust give me credit if you\\'re going to copy this to another site. It didn\\'t really take much time to make. You can edit it any way you want!",
  "categoryId": "27",
  "version": "1.0",
  "author": "metamudkip",
  "createdUnix": "1366847736",
  "updatedUnix": "1366847638",
  "containsAdultContent": false,
  "uploadedBy": "metamudkip",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026299",
      "name": "cookingisajob",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "cookingisajob-35205-1-0.rar",
      "uploadedUnix": "1366847638",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2aebe492af4c81d92a01c805cc8cdca9ce12570cd168ba7d718d64d21b964634/analysis/1407538208/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/cookingisajob-35205-1-0.rar?fid=1000026299&ttl=1535813598&ri=8192&rs=8192&setec=f9617dc8789749bb0d514c038d5277a0"
    }
  ]
}