{
  "modId": 35209.0,
  "modName": "Brutal Skyrim Mod Collection",
  "summary": "A Hardcore Skyrim Mod Collection list meant to make Skyrim the way it is supposed to be. Combine a Harsh climate, rough terrain, tough denizens, and an economy that is torn to pieces by the prospect of on going war; all that makes a world that is hard to live in. ",
  "descriptionHtml": "This mod collection list is meant to make Skyrim not just tougher, but more realistic, immersive, and epic. It is meant to change how you play the game, and slow down the passage of time within the game. With the collection installed, you will be experiencing years of your character\\'s life in Skyrim. There your character will endure many hardships along the way, and the victories your character achieves will so much more enthralling, making your play through of Skyrim a very emotional one. The following story is a example of what can happen:\r\n\r\nAfter spending all the previous day and all night in Nordic Ruin of Ustengrav, Eric finally emerges. He is cold, sick, and extremely tired, hungry, and thirsty. He has several bloody scratches on his body, and his armor is cracked. He limps his way to where his horse is standing, and looks in the pack on the horse to see what supplies are left. There is very little, just enough to take the edge of his hunger and thirst, but he will need to make it to a city where he can get proper rest for his injuries. He packs up the camp that he set up awhile back before entering Ustengrav, he gets back on his horse, and rides as hard as he can to Solitude, with his surviving followers trying to catch up from behind.\r\n\r\nAfter a few hours journey, Eric finally arrived at Solitude. The money he made from all the loot from Ustengrav was not enough to pay the rent for the night at the Winking Skeever and the food he needed to recover his strength. So he bought some food and went to the little shack near the city gate set up for homeless people to sleep. This as low as he had gotten for several months. Things will get better, it will just take time. Over the next few weeks, Eric spends his time not resting repairing his equipment, cooking food, gathering food ingredients from the farm down the road.\r\n\r\nThis was an example of Brutal Skyrim, which is world where survival is a day to day struggle, where every moment can mean the difference between life and death, and the ill-prepared, ill-equipped, and ill-wittid can quickly meet an untimely doom. Welcome to Brutal Skyrim. I challenge everyone that reads this to install all of the essential mods, and some if not all the optional add ons and see how far your character can make it. Can you survive in such a brutal land.\r\n\r\nTo see the full mod collection, including an installation guide, mod descriptions and videos, please visit https://sites.google.com/site/brutalskyrim/\r\n\r\nIf you like what you see, please download the file so that you can endorse this mod collection. Please feel free to leave comments and suggestions for improvement.\r\n\r\nThis mod collection list is a work in progress\r\nFuture Work still to be done:\r\n\r\n1. Linking mods with their mod page on the Skyrim nexus (complete for essential mods as of version 1.3)\r\n2. Adding alternative mods on respective pages, including ones that are hardcore (complete as of version 1.2)\r\n3. Writing up the recommend mods pages\r\n4. Adding new or better mods to the pages when they are released.\r\n\r\nVersion Features (check changelog for full list of changes\r\nVersion 1.1: Added new details to the different mod descriptions to make them more understandable.  Added missing information that I forgot to put in.\r\nVersion 1.2: Added all the alternative mods to flesh out mod lists.\r\nVersion 1.3: Added links to nexus pages and other sites on the essential mod lists to allow users to get more information from mod authors and even download the mod.\r\nVersion 1.4: Added optional mods to the Realistic and Immersive Page. Added the Utilities page to the recommended mods area, listing recommended utility mods and applications. ",
  "categoryId": "79",
  "version": "1.4",
  "author": "brianiangoodman",
  "createdUnix": "1366852322",
  "updatedUnix": "1367370545",
  "containsAdultContent": false,
  "uploadedBy": "brianiangoodman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027335",
      "name": "Brutal Skyrim Mod Collection Original",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Brutal Skyrim Mod Collection Original-35209-1-0.zip",
      "uploadedUnix": "1367370545",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/233cbc8d0f0ce06e3ae2600e8a872c1c55dca4ecab98c7461bbcfd382d87ab6e/analysis/1407549011/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brutal%20Skyrim%20Mod%20Collection%20Original-35209-1-0.zip?fid=1000027335&ttl=1535813602&ri=8192&rs=8192&setec=54dd1cf61fae39e90f05bbf8613f6dd0"
    }
  ]
}