{
  "modId": 35215.0,
  "modName": "Bromjunaar Orkiin - Ashes of the Dragon Cult",
  "summary": "The evolution of my old &#34;Call Strunlokmaar&#34; mod, re-purposed and refurbished to provide an exciting adventure for anyone interested in the lore of the ancient Dragon Cult and the Dov who ruled over them&#33;",
  "descriptionHtml": "***Please note that this mod is a work in progress. At this point in time the final reward, a Shout, can be learned ahead of time by activating a tile currently set in the centre of the Word Wall. This tile will be removed in a later version once the questline is fully completed.***\r<br />\r<br />UPDATE: Work on this project has currently been put on hold. While it would be great to finish it, I just haven&#39;t been able to find motivation to work on the mod consistently. I do plan to occasionally work on a bit here and there, and priorities for the next patch are:\r<br />[list][*]Fix weirdness with book fetching radiant quest.[/*]\r<br />[/list][list][*]Fixing the issue with Strun believing that you can read his mind to figure out what he wants you to do for radiant quests if you exit conversationafter accepting but before he explains your target.[/*]\r<br />[/list][list][*]More faffing around trying to get attacking the dragon hunters to correctly count as a crime, forcing the player to be creative if they spawn in a town.[/*]\r<br />[/list]\r<br />[b]===Introduction===[/b]\r<br />\r<br />\r<br />Bromjunaar Orkiin is a work-in-progress mod which aims to deliver a deep and enjoyable, lore-friendly questing experience to anyone who wants to go beyond what vanilla Skyrim has provided, properly exploring the dark secrets of the ancient Dragon Cult and understand what exactly it means to be Dragonborn.\r<br />\r<br />This mod originally started out as a simple just-for-fun addition, aimed at my friends and other Skyrim role players who wished to see my draconic original character Strunlokmaar in-game, and make him wreck havoc upon their enemies. However, I felt it didn&#39;t seem quite right to just put him into the game, suddenly your best friend forever with absolutely no explanation: the seed was planted, and I decided that I needed to implement a &#34;suitably epic&#34; questline over which the player can earn his trust and the right to summon him from the skies via Shout.\r<br />\r<br />Over time, the premise of the questline has developed into an in-depth story with detective work, dungeon crawling, dragons, grey morality, radiant portions, unique rewards, dragons, fleshed out lore and flavour, a place to call home, unique NPCs, a totally new villain with their own motivations and wishes, and of course, dragons. While at this point the mod is not much to look at, the final version should include enough content to be considered a DLC in its own right, with a conservative estimate being at least six hours of gameplay&#33;\r<br />\r<br />At this point in time, the mod includes the following (additions which will be made in the future can be found further down, for an idea of what the final version will be like):\r<br />\r<br />A new dragon who will serve as your primary quest-giver.\r<br />Two main quests and four repeatable radiant quests.\r<br />A handful of unique items, most of which will become later quest rewards.\r<br />Take over a Dragon Priest&#39;s old abode and make it your own&#33;\r<br />A Draugr follower, for the lulz.\r<br />\r<br />So come on and give it a try, or just wait and see the final result. Hin sossedov peylle&#33;\r<br />\r<br />\r<br />[b]===Installation Instructions===[/b]\r<br />\r<br />\r<br />Upgrading from a previous version:\r<br />\r<br />As this mod is currently in its beta stage, and will remain so until the questline is complete, I cannot stress enough how important it is that it [i]always[/i] be installed using a clean save&#33; If you have been testing a previous version, please load Skyrim and save your game in a location which has not been added by the mod (locations which have only been [i]edited[/i] by it are fair game however, as I can confirm from my own testing), exit, remove the mod from your load order, load your Skyrim and save once again. You can then delete the old files and install the new version.\r<br />\r<br />[b]Note that your progress in the quest line will be erased, and any items which may have been present in the player home will be permanently deleted&#33;[/b] Be sure to remove any of them before doing this&#33; I&#39;m sorry, but this is a necessary evil to ensure that the upgrade goes smoothly, as later additions to the mod will break otherwise.\r<br />\r<br />Regular installation:\r<br />\r<br />Either use NMM or extract the .BSA and .ESP files directly into your Skyrim/Data/ directory. The mod should now be installed and ready to go, just check that it is selected in the &#34;Data Files&#34; section of the Skyrim launcher.\r<br />\r<br />\r<br />[b]===Compatibility===[/b]\r<br />\r<br />\r<br />Most files in this mod are completely stand-alone, so there should be no compatibility issues with Dawnguard, Dragonborn or mods that modify dragons including Odahviing (Hearthfire has not been tested however, and sorry but I am not interested in wasting money on it just to test things). A notable exception is the vanilla file WordWallListenerScript.pex, to which I have added two lines in order for a radiant quest to function correctly, after finding that the functionality I wanted could not be accomplished using separate scripts.\r<br />\r<br />As this is a quest mod, it does contain scripts&#33; Do be aware of this considering the effect orphaned scripts can have on savegame bloat. I recommend staying on the safe side and using a separate save file to play this mod until it is completed.\r<br />\r<br />The current version (1.00b) has modified the following exterior cells, so any mod which edits the same ones would not be compatible and cause issues if loaded alongside this one:\r<br />\r<br />Wilderness (-6, 8)\r<br />ValkyggExterior01\r<br />ValkyggExterior02\r<br />LabyrinthianExterior02\r<br />LabyrinthianExterior04\r<br />\r<br />Every release is cleaned with Tes5Edit prior to uploading to ensure that no dirty edits are present. If you find a dirty edit in this mod, it is there for a reason and should be left alone&#33;\r<br />\r<br />\r<br />[b]===Future Features===[/b]\r<br />\r<br />\r<br />Obviously, this release is only the very start of what the final mod will be. There should three more major releases before I declare this mod finished, which will include:\r<br />\r<br /> - The rest of the questline, split over three major updates.\r<br /> - (At least) Two more unique dragons for the player to interact with and recruit to their cause.\r<br /> - Multiple unique quest rewards including weapons, Dragon Priest robes, and other flavour items.\r<br /> - The &#34;Call Strunlokmaar&#34; Shout updated to be rewarded toward the end of the quest line (for now it can still be learned from the placeholder activator by the Word Wall at Bromjunaar Overlook).\r<br /> - Four sprawling, non-linear dungeons to explore (and a couple of smaller ones too).\r<br /> - Lots of expanded lore about the Dragon Cult and Skyrim&#39;s ancient history, painstaking made to be as consistent with what little we already know as possible.\r<br />\r<br />\r<br />[b]===Known Bugs===[/b]\r<br />\r<br />\r<br />I cannot for the life of me figure out how to get the Dragon Hunters for one of the radiant quests to respond to being attacked properly. Killing one in front of a guard or citizen will result in it counting as murder, however they rarely fight back and simply whacking one doesn&#39;t count as an assault - in fact it is possible for town guards to help you kill them instead of defending them&#33; If anyone knows how to fix this, [b]please[/b] let me know&#33;\r<br />\r<br />\r<br />[b]===FAQ===[/b]\r<br />\r<br />\r<br />[b]How do I start the questline?[/b]\r<br />The questline should automatically trigger after the player changes location following installation, given that dragons are enabled in the current save file. This means either completing Skyrim&#39;s Main Quest up to and including Dragon Rising (Sorry guys, but this is a questline designed for Dragonborn characters, so that is the barest requirement), or by forcing dragons to appear using console commands or some other mod. A courier should track you down and give you a note to initiate the quest.\r<br />\r<br />Note: If you have already started the questline in a previous version of the mod, the hidden quest which sends the courier to you may register as already having been completed and not work. Simply open the console and type &#34;setstage DCMQ00 1&#34; to force it to start. It is also possible for this to happen even if your save hasn&#39;t previously run the quest: the Story Manager has a tendency to swap the &#34;DragonsEnabled&#34; and &#34;DragonsReturned&#34; global values, just try redownloading in a couple of hours or a day - I should have noticed by then and changed them back.\r<br />\r<br />[b]Why is the house a complete wreck?[/b]\r<br />It&#39;s just a temporary thing, don&#39;t worry. Labyrinthian&#39;s Draugr are on the job and will have it cleaned up in no time&#33; Or a lot of time. It depends on what you do.\r<br />\r<br />[b]Strunlokmaar keeps saying the same thing when I ask if the house is cleaned up yet, what gives?[/b]\r<br />The progress on house upgrades is determined by the number of Strunlokmaar&#39;s radiant quests you have completed. Simply keep doing radiant quests and check up with Strunlokmaar every now and then to see if the new section of the house has been finished, although some unlocks may require more than one radiant quest to be completed.\r<br />\r<br />If the dialogue option to ask on the house&#39;s progress disappears, it likely means that you have unlocked all of the upgrades and there are no more left.\r<br />\r<br />[b]EEK&#33; There&#39;s a Draugr in my house&#33;[/b]\r<br />Say hello to Vershun, your new housekeeper&#33; He isn&#39;t very talkative, and doesn&#39;t quite know how to use his broom properly, but after a few millennia of boredom guarding Morokei&#39;s tomb he is more than eager to accept you as his new master and vanquish your foes&#33;\r<br />\r<br />[b]How do I get the next part of the questline to trigger?[/b]\r<br />The radiant quests and Main Quest up to and including &#34;One Dragon&#39;s Trash...&#34; is all we have at this point in time, but don&#39;t worry, I&#39;m working on the rest of it&#33; Or maybe you should worry, because I am incredibly slow at this, and about to start an Honours project so my free time will be diminished this year...\r<br />\r<br />\r<br />[b]===Changelog===[/b]\r<br />\r<br />\r<br />Version 1.00b\r<br />\r<br />-Strunlokmaar will no longer appear in savegames where dragons have not been enabled (either by completing Dragon Rising, or forcing them to appear through other means).\r<br />-The quest line begins&#33;\r<br /> * Added Main Quests DCMQ00, &#34;Bromjunaar Overlook&#34; and &#34;One Dragon&#39;s Trash...&#34;\r<br /> * Added radiant story manager and radiant quests DCR01, DCR02, DCR03 and DCR04.\r<br /> * Added upgradable player home, unlocked at a certain part of the quest line.\r<br /> * Added a Draugr [strike]butler[/strike] follower, unlocked at a certain house upgrade level.\r<br /> * Added random dialogue to Strunlokmaar.\r<br />\r<br />Version 0.8r\r<br />\r<br />- Fixed issue where Dawnguard.esm and Dragonborn.esm were incorrectly being treated as master files and were required to load the mod. Derp.\r<br />- Fixed bug where learning “WordM1rStrun” would also cause the player to learn the entirety of a dummy “Lightning Breath” Shout.\r<br />- The Word Wall now has text, pretty&#33;\r<br />- There is now an activator located at Bromjunaar Overlook which is used to learn the Shout.",
  "categoryId": "35",
  "version": "1.00b",
  "author": "Randomixx",
  "createdUnix": "1366860809",
  "updatedUnix": "1390052265",
  "containsAdultContent": false,
  "uploadedBy": "Randomixx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026335",
      "name": "CallStrunlokmaar_Beta0-7",
      "version": "0.7b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2750",
      "fileName": "CallStrunlokmaar_Beta0-7-35215-0-7b.zip",
      "uploadedUnix": "1366859474",
      "modVersion": "0.7b",
      "virusScanUrl": "https://www.virustotal.com/file/7055c7007eb9ecd160cf5fd12775d87dcb7dd65c53a98a71eddedd664285b52f/analysis/1407538450/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CallStrunlokmaar_Beta0-7-35215-0-7b.zip?fid=1000026335&ttl=1535813610&ri=8192&rs=8192&setec=783d23203fe0ca872d91cc03ebde0422"
    },
    {
      "fileId": "1000035968",
      "name": "CallStrunlokmaar_Release0-81",
      "version": "0.81r",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2643",
      "fileName": "CallStrunlokmaar_Release0-81-35215-0-81r.rar",
      "uploadedUnix": "1372290923",
      "modVersion": "0.81r",
      "virusScanUrl": "https://www.virustotal.com/file/c1fd47a454d9a21a9265af7d0244a846e0912f10c9f994bc56d0accd87bc86b0/analysis/1407618488/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CallStrunlokmaar_Release0-81-35215-0-81r.rar?fid=1000035968&ttl=1535813610&ri=8192&rs=8192&setec=628d6f3a95d02cd69ebc40856920357b"
    },
    {
      "fileId": "1000092025",
      "name": "Bromjunaar Orkiin v1-01b",
      "version": "1.01b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22766",
      "fileName": "Bromjunaar Orkiin v1-01b-35215-1-01b.rar",
      "uploadedUnix": "1390052265",
      "modVersion": "1.01b",
      "virusScanUrl": "https://www.virustotal.com/file/d9041133fb2415ccc812df8151809e65f159e8c562aa37735d40eddf7d7ee1b3/analysis/1407891237/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bromjunaar%20Orkiin%20v1-01b-35215-1-01b.rar?fid=1000092025&ttl=1535813611&ri=8192&rs=8192&setec=e09d2ff8683e615dde395959bd55c1d4"
    }
  ]
}