{
  "modId": 35224.0,
  "modName": "Werewolf Aftermath - Gota Get My Stuff Back",
  "summary": "Makes it so when you transform into a werewolf you leave all you gear behind...And when you change back to normal you need to go back and get it&#33;",
  "descriptionHtml": "Name: Werewolf Aftermath - Gota Get My Stuff Back\r<br />Author: popcorn71\r<br />\r<br />\r<br />\r<br />Beta and general Warnings\r<br />=========================\r<br />In case the version number didn&#39;t give it away this mod is still in &#39;beta&#39; status. It SHOULD be safe\r<br />for normal game play. Just remember to backup your saves just in case something goes horribly wrong.\r<br />Also minor bug and oddities are to be expected. Feel free to report any bugs, give suggestions or\r<br />constructive criticism in the comments section but remember that I mod first and foremost for\r<br />myself.\r<br />\r<br />Above all else think before you post. I see enough idiocy on this sight as it is and will not\r<br />tolerate it in the comment thread.\r<br />\r<br />If you do not agree with any of the above statements then I&#39;m sorry but this mod is not for you.\r<br />\r<br />\r<br />\r<br />Requirements\r<br />============[list][*]Skyrim v1.7.7.0 or greater\r<br />[/list]\r<br />\r<br />\r<br />Description\r<br />===========\r<br />I always felt there was something off about how Bethesda handled the transition to and from werewolf \r<br />form, but it never quite hit home until I watched Gopher review Werewolf Aftermath Re-Equipper.\r<br />I believe he said something along the lines of &#34;forcing me to open the inventor and re-equip my \r<br />stuff in order to acknowledge a game play mechanic&#34;. \r<br />\r<br />While the Werewolf Aftermath Re-Equipper does indeed eliminate the need to acknowledge said game\r<br />play mechanic, I would much rather Expand upon it then eliminate it.\r<br />\r<br />This mod makes it so when you enter beast form you drop all your items to the ground in a backpack.\r<br />When you change back to normal, you are left naked, with NO item (except quest items) in you\r<br />inventory. If you want your stuff back, you will need to back track to were you change into the\r<br />beast pick up your backpack.\r<br />\r<br />I even added a quest that marks the location of you stuff so you can always find your way back to \r<br />your precious items.\r<br />\r<br />\r<br />\r<br />Install\r<br />=======\r<br />Use Wrye Bash or Nexus Mod Manager to install. If you would rather manually install then download\r<br />the archive and extract the files into your data folder.\r<br />\r<br />\r<br />\r<br />Uninstall\r<br />=========[list=1][*]Make SURE you are NOT in werewolf form. Otherwise, you will lose all you items.\r<br />[*]Uninstall with Wrye Bash or Nexus Mod Manager or delete Werewolf_GGMSB.esp, Werewolf_GGMSB.bsl, and Werewolf_GGMSB.bsa files form your data folder.\r<br />[/list]\r<br />\r<br />\r<br />Upgrading to a new version\r<br />==========================\r<br />Unless otherwise stated, it should be safe to install the new version over top the old one.\r<br />\r<br />\r<br />\r<br />compatibility and Incompatibility\r<br />=================================[list][*]Mods that mess with the players equipment after transforming into or back from a werewolf are incompatible.\r<br />[*]Mod that manage equipment with scripts in general should be compatible but may cause oddities.\r<br />[*]Will most likely  have minor Incompatibility with mods that let you loot and open doors in werewolf form. Should still be playable though. You will have to use your own judgment on these.\r<br />[*]Should be compatible with all other mod including mods that add or alter werewolf perks.\r<br />[/list]\r<br />\r<br />Known Issues or Bugs\r<br />====================[list][*]I don&#39;t have proper handling in place yet if you transform to werewolf and then transform to werewolf AGAIN before retrieving you gear. The current implantation merges the items dropped from both transformations into the most recent container. So, nothing game breaking, just a little weird.\r<br />[*]The bag that gets dropped when you transform is static and will not havok settle (roll down hills, get knocked around when you hit it, etc). This was done on deliberately to prevent you from losing all you stuff if you transformed in an inopportune place.\r<br />[/list]\r<br />\r<br />\r<br />Tools Used\r<br />==========[list][*]Creation Kit\r<br />[*]Notepad++\r<br />[*]TES5Edit\r<br />[*]Creation Kit\r<br />[/list]\r<br />\r<br />\r<br />Contact\r<br />=======\r<br />The best way to reach me is by PM on the Nexus.\r<br />I also check the comments section regularly, so chances are good I will see and respond to feedback\r<br />as needed.",
  "categoryId": "28",
  "version": "0.90.0",
  "author": "Popcorn71",
  "createdUnix": "1366879375",
  "updatedUnix": "1366879260",
  "containsAdultContent": false,
  "uploadedBy": "popcorn71",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026360",
      "name": "Werewolf Aftermath - Gota Get My Stuff Back",
      "version": "0.90.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54",
      "fileName": "Werewolf Aftermath - Gota Get My Stuff Back-35224-0-90-0.7z",
      "uploadedUnix": "1366879260",
      "modVersion": "0.90.0",
      "virusScanUrl": "https://www.virustotal.com/file/cc24a9b83bcb9eaff635c00c80ab8ecbaa30e65077d6ea62271e730f456ab635/analysis/1407538779/",
      "changelogHtml": " Initial beta release. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Werewolf%20Aftermath%20-%20Gota%20Get%20My%20Stuff%20Back-35224-0-90-0.7z?fid=1000026360&ttl=1535813623&ri=8192&rs=8192&setec=784e48b4930ba5a0316b085f9357983d"
    }
  ]
}