{
  "modId": 35235.0,
  "modName": "Behemyths - Alpha Creatures",
  "summary": "Behemyths, creatures of legendary power and strength have entered Skyrim. Ultra-strong and ruthlessly powerful, the Behemyths will prove a challenge to even the strongest adventurers in Tamriel.",
  "descriptionHtml": "This Mod adds respawning creatures with unique ID\\'s to many locations in Skyrim.\r\nThey are found in many locations throughout the world and are designed to prove more of a challenge than standard creatures. They vary in size and strength and do not always behave as normal creatures do. They respawn just as other standard creatures do, so you can come back and kill them again. Not all Behemyths are hostile and some are even timid, so you may find that strength is not directly related to bravery in some cases.\r\n\r\nThe general features of the Behemyths are:\r\nHigh Overall and Skill Levels- Very adept fighters\r\nVery high health- Behemyths are highly endurable (usually, there are some exceptions. Behemyths generally vary from standard boss creature level strength to virtually unkillable without cheats)\r\nHigh Stamina- Unlike other creatures, Behemyths rarely tire\r\nVariations in size- Behemyths vary in size, some are the same size as other creatures of their species, most are larger though not significantly (with some exceptions) while some are smaller (though size is not necessarily an indication of strength). It is worth noting that in most cases I have tried to keep the mod lore friendly, so humanoid Behemyths are generally around similar size to normal (i.e. No 50 foot tall Nords).\r\nUnusual behaviour- Some Behemyths exhibit behaviour that is unusual to their species.\r\nUnique names- Each Behemyth has a unique name which is a reference to Mythology, Folklore or Pop-Culture, usually directly related to the creature itself (I\\'ll be very impressed if anyone can work them all out).\r\n\r\nIn the main mod (which is not yet complete) the Behemyths are all confined to dungeons or within close proximity of dungeon entrances. I am working on another mod that will add Behemyths to the wilderness which will be kept separate from the main mod.\r\n\r\nRequirements-\r\nNone\r\n\r\nInstallation-\r\nExtract the BehemothsV1.esp to your skyrim data folder.\r\n\r\nUninstallation-\r\nDelete the esp from the data folder.\r\n\r\nKnown Issues and Bugs-\r\nNone that I know of, if you find any please let me know\r\nby sending me a message with the name, location and creature\r\ntype of the creature that is causing the issues.\r\n\r\nCreature Locations-\r\nIn V1 all creatures are located within dungeons or in close\r\nproximity to them. I am working on an add-on mod that will\r\nadd Behemyths to the wilderness.\r\n\r\nDungeon List- (Locations marked with a ! contain a boss behemyth) \r\n\r\nAbandoned Prison\r\nAlftand\r\nAvanchnzel\r\nBleak Coast Cave\r\nBleak Falls Barrow (!)\r\nBonechill Passage\r\nBrinehammer\r\nBronze Water Cave\r\nBthardamz\r\nChillwind Depths\r\nCold Rock Pass\r\nCracked Tusk Keep\r\nCragswallow Slope\r\nCrystaldrift Cave\r\nDarklight Tower\r\nDead Crone Rock\r\nDead Men\\'s Respite\r\nDuskglow Crevice (!)\r\nDustmans Cairn\r\nFaldars Tooth\r\nFellglow Keep\r\nFolgunthur (!)\r\nFort Dunstad (!)\r\nFort Greenwall\r\nFrostflow Abyss (!)\r\nGloomreach\r\nGreywater Grotto\r\nGuldun Rock\r\nHag Rock Redoubt (!)\r\nHalted Stream Camp\r\nHarmugstahl\r\nHigh Gate Ruins (!)\r\nHobs Fall cave (!)\r\nIronbind Barrow\r\nIlinata\\'s Deep (!)\r\nKilreath Ruins\r\nKorvanjund\r\nLabyrinthian (!*!)\r\nLiars Retreat\r\nLost Echo Cave\r\nLost Prospect Mine (!)\r\nMaras Eye Den (!)\r\nMistwatch\r\n\r\n* Labyrinthian contains the mod\\'s strongest Behemyth",
  "categoryId": "83",
  "version": "V1",
  "author": "Drakynval",
  "createdUnix": "1366904990",
  "updatedUnix": "1366903524",
  "containsAdultContent": false,
  "uploadedBy": "Drakynval",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026396",
      "name": "BehemythsV1",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27",
      "fileName": "BehemythsV1-35235-V1.rar",
      "uploadedUnix": "1366903524",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/b3fc73003daecadd92bed32852724c5570128cbbea4cb7877ad79846e057e7c7/analysis/1407539106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BehemythsV1-35235-V1.rar?fid=1000026396&ttl=1535813636&ri=8192&rs=8192&setec=a49246b35b79087bb01535c5ac18a0d5"
    }
  ]
}