{
  "modId": 35241.0,
  "modName": "Guild Outposts - Directors cut",
  "summary": "Guild outposts - Director\\'s cut includes the collection of guild outposts, alone the main file has over 7000k subscriptions on workshop in total. It also includes the No 1 of the Dragonborn mod contest.\r\nEnhance Skyrim & Solstheim with new outposts, each unique cluttered and with custom music and voices. REBUILD THE OLD FALKREATH SANCTUARY too!",
  "descriptionHtml": "[center][URL=http://www.directupload.net][IMG]http://s14.directupload.net/images/130426/txg2p838.gif[/IMG][/URL]\r\nThe whole land of Skyrim seems so empty, so... so much wasted potential: Why can\\'t you rebuild your old Sanctuary, why does the Thieve guild only has one base and no outposts etc - This mod adds much more detail by adding custom designed outposts for guilds, with merchants, trainers and custom voices!\r\nThe file consists of 4 parts:\r\nThe normal [b]guild outposts[/b] adding new outposts all over Skyrim\r\n[b]Guild outposts - Dawnguard edition[/b] adding a new Dawnguard outpost and a volkihar vampire outpost [i](requires Dawnguard DLC)[/i]\r\n[b]Guild outposts - Dragonborn edition[/b] adding new outposts to the island of Solstheim [i](requires Dragonborn DLC)[/i]\r\n[b]Guild outposts - Falkreath\\'s resurrection[/b] makes you able to rebuild the abandoned falkreath sanctuary\r\nIf you don\\'t possess the required DLCs, simply deactivate the certain .esp so you\\'re still able to use the other parts of this mod\r\nEach of them has custom music, custom voices and some also quests. All of them add new merchants and trainers, happy to sell you goods and train you the newest styles.\r\n\r\nLocation\r\n========\r\n[b]Guild outposts[/b]\r\n[i]Thieve guild[/i] outpost is located under the bridge to the college of winterhold\r\n[i]Companions[/i] outposts are located in the rift (in front of riften) and near Dragonbridge\r\n[i]Dark brotherhood[/i] outpost is located in narfi\\'s house (ivarstead) to enter this sanctuary you need to finish the DB questline and take the key out of the chest in your sleeping room (YEAH, no spoilers! :D)\r\n[i]College[/i] outpost is located just in front of markarth, you can\\'t miss it\r\n\r\n[b]Guild Outposts - Dragonborn edition[/b]\r\nTwo outposts just behind Ravenrock ([i]College[/i] and [i]Companions[/i]) and a [i]Dark Brotherhood[/i] outpost at the strange stone you face in the questline\r\n\r\n[b]Guild Outposts - Dawnguard edition[/b]\r\nAdds a [i]dawnguard[/i] outpost near old-hroldan and a [i]vampire[/i] outpost in whiterun\r\n\r\n[b]Guild Outposts - Falkreath\\'s resurrection[/b]\r\nself explaining... ;-)\r\n\r\nDetails\r\n=======\r\nThere are several custom voiced characters like the architect in the Falkreath Sanctuary with unique options to speak with them, so go check it out!\r\nThe music is by AngryJack and Organic view, both from the [url=http://skyrim.nexusmods.com/mods/23953]Alagaesia creation group[/url]. Take a look on this awesome mod.[/center]\r\nTo start the mod in the Dragonborn edition, you need to talk to Jaqen in the Ravenrock Sanctuary. \r\n\r\nFalkreath\\'s resurrection - instructions\r\n===================================\r\nTo enter the new (tidied) sanctuary you need to speak to a new NPC in front of the Sanctuary. He\\'s set to respawn so if you accidentally kill him (or he gets killed) he should respawn within max. 30 days ingame.\r\nIn the Sanctuary you need to talk to a (custom voiced) architect who gives you the ability to slowly upgrade your old Sanctuary. Upgrades include for example an armory, a secret sleeping room or sleeping rooms for your assassins. With some of the upgrades new assassins will arrive at the sanctuary, some of them trainers, some of them merchants.\r\nInstallation\r\n=======\r\n[b]NMM[/b]: just install it via NMM\r\n\r\n[b]Manual:[/b]\r\n1. Extract the files to a temporary location.\r\n2. Copy all files into Skyrim\\\\Data\r\n3. Start Skyrim Launcher, click \\'Data Files\\', place a checkmark beside the .esp file(s).\r\n\r\nUninstall\r\n=========\r\nWhy do you want to uninstall?^^\r\n1. Start Skyrim Launcher, click Data Files, uncheck the .esp file(s).\r\n2. Delete the files associated with the mod. (all files starting with \\'FZGuildOutpost\\' or \\'FZFalkreath\\')\r\n3. Delete all folders which start with \\'FZGuildOutpost\\' or \\'FZFalkreath\\' in \\\\Skyrim\\\\Data\\\\Meshes\\\\actors\\\\character\\\\facegendata\\\\facegeom\r\n4. Delete all folders which start with \\'FZGuildOutpost\\' or \\'FZFalkreath\\' in \\\\Skyrim\\\\Data\\\\Textures\\\\actors\\\\character\\\\FaceGenData\\\\FaceTint\r\n5. Delete all folders which start with \\'FZGuildOutpost\\' or \\'FZFalkreath\\' in \\\\Skyrim\\\\Data\\\\Sound\\\\Voice\r\n6. You\\'re done!\r\n\r\nUpgrade\r\n=======\r\n1. Before upgrading, remove all items from the chests\r\n2. Save your game.\r\n3. Uninstall old version.\r\n4. Install new version.\r\n5. Start Skyrim.\r\n\r\n\r\n[center]Incompatibility\r\n===============\r\nNot known yet\r\n\r\nKnown Issues or Bugs\r\n====================\r\nSome strange errors may occur (like a high-level thief in riverwood) which affect all mods that affect guilds. If you face such things, open the console, click that guy and type \\'disable\\'. The errors should be a minimum as the mod is tesVcleaned. I never faced such issues and the mod is also cleaned so there should be almost none of such issues.\r\nThere\\'s also a skyrim bug that dialogue options don\\'t show up. To fix this, simply quicksave (F5 by default) and quickload (F9 by default). That fixes the issue.\r\n\r\nF.A.Q\r\n=====\r\n[b]Q:[/b] I already installed your workshop editions of the guild outposts. Why should I use the nexus version?\r\n[i]A: Just because the nexus version is - much better. Due to the raised upload limit I was allowed to add voice acting, custom music and custom meshes. [/i]\r\n[b]Q:[/b] I\\'ve got suggestions/bug reports. Where shall I post them?\r\n[i]A: Use the extra forum for this please. It helps keeping everything in order.[/i]\r\n[b]Q:[/b] This mod makes my Skyrim crashing. What shall I do?\r\n[i]A: This mod is pretty clean so it seems that another mod edits the same things as this. I didn\\'t have any problems with my mod even though I have it installed with 200 (or even 300?) other mods. For this case I created the optional files: Deinstall the old version, download the optional files and try what makes your skyrim crashing.[/i]\r\n[b]Q:[/b] Why is this mod so huge?\r\n[i]A: Well, I added custom voices, custom music, scripts, quests etc - so please be kind, I did everything I could to keep the file small\r\n[b]Q:[/b] What are your future plans with the mod?\r\n[i]A: actually I only created guild outposts as a test mod for myself but then I decided to publish it. After its great success on workshop I decided to release similar mods for the dlcs, all with good to very good success. Actually I only wanted to make the dlcs for the nexus version but so many asked me to publish it so i did - but nexus version is still a lot better.\r\nThis mod can be considered to be finished but if you like it, I could also add some more voices and stuff, put the suggestions into the forum thread \\'suggestions\\' ;)\r\n\r\nWhat has been changed to workshop version?\r\n=======================================\r\nI added some custom voices for some characters, for example the Dawnguard commander and the Argonian of the Dark Brotherhood, then I added custom ambient music (no vanilla music at all anymore!), the files were TesVcleaned (finally^^), which should prevent many issues and I added a volkihar outpost for the vampire players of you. So really enough to give it a try!\r\n\r\nHistory\r\n=======\r\n2.0 Director\\'s cut version\r\n\r\nContact\r\n=======\r\nJust send me a message on Nexus\r\n\r\nCredits\r\n=======\r\nThanks to Bethesda for creating Skyrim and creation kit.\r\nThanks to TESNexus.com for the a one-stop-shop resource for authors and players.\r\nThanks to LHammonds for the Readme Generator this Readme was based on.\r\n[url=http://skyrim.nexusmods.com/mods/23953]AngryJack and the Alagaesia Creation Group for the custom music tracks and the joy of working with them. Take a look on this awesome mod![/url]\r\n[url=http://skyrim.nexusmods.com/mods/17583]AmethystDeceiver for the vampire coffin[/url]\r\n[url=http://skyrim.nexusmods.com/mods/23254]SuperNastyPants for his tutorial[/url]\r\n[url=http://skyrim.nexusmods.com/mods/17207]Some more music by OrganicView who\\'s also part of the Alagaesia mod[/url]\r\n[url=http://www.elderscrolls.com/]elderscrolls.com for the fonts[/url]\r\nThanks to God for creating us all.\r\n\r\nTools Used\r\n==========\r\nCreationKit\r\n[url=http://HammondsLegacy.com/obmm/tools_readme_generator1.asp]Readme Generator[/url]\r\n\r\nLicensing/Legal\r\n===============\r\nYou must contact me and obtain my permission before re-packaging any part of\r\nthis mod.\r\n[/center]",
  "categoryId": "25",
  "version": "2.0",
  "author": "Flammenzunge",
  "createdUnix": "1367339426",
  "updatedUnix": "1367338918",
  "containsAdultContent": false,
  "uploadedBy": "Flammenzunge",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027273",
      "name": "Guild outposts - full edition",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "165499",
      "fileName": "Guild outposts - full edition-35241-2-0.zip",
      "uploadedUnix": "1367338918",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/464817c2b6619bc2e59181ef77875f33018904c69c6faa72853ac1b2d7bc6641/analysis/1407548539/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guild%20outposts%20-%20full%20edition-35241-2-0.zip?fid=1000027273&ttl=1535813643&ri=8192&rs=8192&setec=c4254e162e0e164c2e27dca719c5d785"
    }
  ]
}