{
  "modId": 3524.0,
  "modName": "Makers Mark Ingots",
  "summary": "Retexture - All crafting ingots now have unique minting stamps on them.",
  "descriptionHtml": "Maker\\'s Mark Ingots\r\n\r\nI have to credit the user \\\"omguleh\\\" when I was crowd-sourcing Nexus for something to retex for suggesting I remake gold ingots to look like modern bullion.  After pondering on it a while, I thought this would be even better; fit all the materials into the lore and make the experience and add some immersion.\r\n\r\n[Skip ahead a few hours of researching Skyrim lore] \r\n\r\nAll of the different ore ingots now bear a minting mark from the capitol of the region that had a mine with the most veins of that particular material in Skyrim.  A few were based on lore from the game story [such as a \\\"SILVERBLOOD\\\" stamp for silver] or in-game books and a few were to just switch it up a bit as only really 2-3 holds turned out to have most of the mines in Skyrim.  Not every ingot has text and not every stamp has the same aspect, layout or placement - to keep things looking unique and realistically from the different areas.  \r\n\r\nStamps go as follows:\r\n~Corundum - The Mark of Knifepoint Mine in Falkreath.  Elaborate mark for a large producer - 19 veins.\r\n\r\n~Ebony - Mark of Gloombound Mine with the Windhelm Crest.  16 veins.\r\n\r\n~Gold - Kolskeggr Mine of Markarth produced [i]far[/i] above anywhere in Skyrim, with 24 veins of Gold.  They get an elaborate Mark, as this would be a large enterprise for Markarth.\r\n\r\n~Iron - Iron is very abundant in Skyrim, so I chose Hjaalmarch with the Mark of Morthal.  They just seem like they make some good iron.  Hjaalmarch isn\\'t the largest producer with only 4 veins, but I imagined them as boasting the, \\\"best iron.\\\" Seems like a hardy Morthal thing to claim. \r\n\r\n~Malachite - Kynesgrove got it\\'s own mark [rather than another Markarth mark] for the Steamscorch Mine as Malachite is very rare. [There are only two locations in all of Skyrim with Malachite veins] 8 veins.\r\n\r\n~Moonstone - I could not find any crest or symbol of the Aldmeri Dominion like I wanted [being as Moonstone is only used in Elvish gear] so I used an Elvish Knot and some Elvish script to comprise this Maker\\'s Mark.  While there are places to mine Moonstone in Skyrim, I thought it would be more to the lore if the ingots were imported from the Aldmeri lands.\r\n\r\n~Orichalcum - Mark of the Mor Khazgur Mine attached to the Orc Stronghold Mor Khazgur in Haafingar.  It also features the Crest for Solitude, as that is the capitol of the area it would be the most likely place the Orcs would distribute their ore through.  With 7 veins, Mor Khazgur is the second largest producer of Orichalcum, but as it is mainly used in Orcish gear, I chose an Orcish mine over Falkreath.\r\n\r\n~Quicksilver - Mark of Dawnstar in The Pale for the Quicksilver Mine.  5 veins.\r\n\r\n~Silver - Stamp of the Silver-Blood House of Markarth.  8 veins.\r\n\r\n~Steel - Imperial Mark of Skyrim.  Steel is an alloy so it gets the Skyrim stamp as it is made everywhere in Skyrim.\r\n\r\nA fair bit of thought went into this and making it fit into the Skyrim lore available.  Although it was a fair bit of work [all textures also have modified bump maps and specularity maps as well for extra goodness] I also realize it\\'s a relatively small part of this immense gaming experience of Skyrim, but I hope you will find it a nice touch to your immersion in the game.    This will be especially welcome for those who love smithing; I\\'m sure you\\'re tired of looking at the same old ingots by now.\r\n\r\nTo install: Unzip and drop \\\"data\\\" folder into your Skyrim directory and click Merge.  Or manually install by creating this filepath - \r\n.(yourskyrimfolder)/data/textures/clutter/ <<put all the .dds files in the \\\"clutter\\\" folder\r\nRun game! You win!\r\n\r\nMaker\\'s Mark Ingot also goes really great with Kman\\'s [url=\\\"http://www.skyrimnexus.com/downloads/file.php?id=3794\\\"]Super Realistic Ore Textures[/url] and a modified blue version of this moonstone texture is featured in Cmdo\\'s [url=\\\"http://www.skyrimnexus.com/downloads/file.php?id=3793\\\"]Skyrim Weapon and Armor Tweaks[/url].  Also, take a moment and check out my [url=\\\"http://www.skyrimnexus.com/downloads/file.php?id=3321\\\"]Ornate Nightingale Armor[/url].  \r\n\r\nComments/discussion are very welcome- and please, if you like the mod, come back and endorse it!  You guys have the power to make this mod a success!\r\n\r\nEnjoy!\r\n\r\nP.S.  If anyone else is going to toy with these, I\\'ll give you a heads up of a few hiccups I ran into - Silver ingots uses ingotiron01.dds/ignotiron01_n.dds and Iron ingots use the ingotsilver01.dds/ingotsilver01_n.dds.  Someone liked them switched around and was too lazy to go into the code an switch the names back around.  Also, for some reason Malachite uses ingotobsidian01.dds/ingotobsidian01_n.dds which is funny as there isn\\'t even an obsidian ore in Skyrim period.  These were just hilarious to discover *after* finishing the wrong work, so, you\\'re welcome.",
  "categoryId": "78",
  "version": "1.0",
  "author": "Mike Omni",
  "createdUnix": "1323749595",
  "updatedUnix": "1323751577",
  "containsAdultContent": false,
  "uploadedBy": "mikeomni",
  "primaryFile": null,
  "files": [
    {
      "fileId": "9924",
      "name": "Makers Mark Ingots - by mikeomni",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3139",
      "fileName": "Makers Mark Ingots - by mikeomni-3524-1-0.zip",
      "uploadedUnix": "1323751577",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ae26f49fd02b8f051693ad2e1d3846c3245b9b273cf849a11f93e78dc00e8a27/analysis/1406513710/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Makers%20Mark%20Ingots%20-%20by%20mikeomni-3524-1-0.zip?fid=9924&ttl=1535758633&ri=8192&rs=8192&setec=7613ee5c6d1c41f7a2ea4a79b501df92"
    }
  ]
}