{
  "modId": 35255.0,
  "modName": "Dual Sheath Redux for JaySuS Swords",
  "summary": "The long awaited patch for both Dual Sheath and JaySuS Swords - is now here. This is going to be a mod to remember!",
  "descriptionHtml": "[b][size=3]-- Description --[/size][/b]\r\n\r\nA patch for using both [url=http://skyrim.nexusmods.com/mods/1002]JaySuS Swords[/url] and [url=http://skyrim.nexusmods.com/mods/34155]Dual Sheath Redux[/url] together. Made because I don\\'t want one of my favorite weapon mods being the odd-one out for Dual Sheath.\r\n\r\nPLEASE READ THE BELOW DISCLAIMER:\r\n\r\n[b][size=3]-- An important disclaimer about permissions --[/size][/b]\r\n\r\nJaySuS on the permissions for his mod states \\\"you may create plugins and mods based on this mod as long as your mod stays dependant on mine, your mod may not contain any assets contained in my mod under any circumstances\\\". However, making patches for Dual Sheath requires assets from his mod to be altered (else, the swords will not show up while sheathed).\r\n\r\nBefore reporting this mod for being unauthorized, hear me out: In normal cases, I would ask the author to see if the modification is fine with them. But, JaySuS has not been active on the Nexus for a long while. As such, he has been very hard to contact. Neovalen (the author of Dual Sheath Redux) has tried to contact him though multiple methods - none of them worked as of now. \r\n\r\nHis mod is one that I personally use (as well as many others), and it is one that I would like to have compatible with Dual Sheath, but the inactivity of the author is a major problem for such a patch.\r\n\r\nTherefore, I am hoping that this doesn\\'t go against the wishes of JaySuS - the mod requires his original mod to work. This is not intended as a replacement for JaySuS Swords, it is meant to complement it.\r\n\r\nIf JaySuS or a Nexus staff member sees this mod as inappropriate, I will promptly take it down. Make sure you let me know beforehand via private message. This mod is not intended to offend anyone, and I do not intend to be seen as a mod thief.\r\n\r\nAdditionally, if JaySuS responds to Neovalen\\'s request, or he officially allows a patch for Dual Sheath to be made, then this mod will be removed and the compatibility patch will be on the main page for Dual Sheath Redux.\r\n\r\n[b][size=3]-- Installation --[/size][/b]\r\n\r\nFirstly, you need [url=http://skyrim.nexusmods.com/mods/1002]JaySuS Swords[/url] to be installed. As the author has not been very active lately, you need to install [url=http://skyrim.nexusmods.com/mods/26230]Sharlikran\\'s compatibility patch[/url] over this mod, or else the Dual Sheath patcher will puke when it tries to process the mod. Currently, the latest patch does not require JaySuS\\'s mod to be downloaded, but later patches might.\r\n\r\nSecondly, you need [url=http://skyrim.nexusmods.com/mods/34155]Dual Sheath Redux[/url] to be installed. Otherwise, this patch will not come into play. Make sure you follow the installation instructions carefully!\r\n\r\nInstall this mod before running the patcher for Dual Sheath Redux - a mod manager is the best method to doing so. Otherwise, extract to the Skyrim data folder. After you run the patcher for Dual Sheath, the weapons from JaySuS swords should behave like any other properly patched weapon.\r\n\r\n[b][size=3]-- Uninstallation --[/size][/b]\r\n\r\nUse a mod manager to uninstall, or remove any files ending with Left.nif or Sheath.nif from <Skyrim Data>\\\\meshes\\\\jaysmods\\\\weapons\\\\axes and <Skyrim Data>\\\\meshes\\\\jaysmods\\\\weapons\\\\swords.\r\n\r\n[b][size=3]-- Compatibility --[/size][/b]\r\n\r\nShouldn\\'t interfere with anything at all. No files are replaced, and no plugins are introduced.\r\n\r\n[b][size=3]-- Issues --[/size][/b]\r\n\r\nThe two one-handed Dragonbone weapons introduced by JaySuS Swords will not have scabbards. Adding them would require further mesh editing, and I really don\\'t want to make more modifications to JaySuS\\'s meshes than necessary for the patch.\r\n\r\n[b][size=3]-- Credits --[/size][/b]\r\n\r\nJaySuS for creating such a well done set of weapons. You seriously know your stuff - all credit to you.\r\nNeovalen for creating both the well-done [url=http://wiki.step-project.com/User:Neovalen/Skyrim_Revisited]Skyrim Revisited guide[/url], and for creating Dual Sheath Redux.\r\nSharlikran for fixing JaySuS\\'s mod, and for maintaining one of the best modding tools of all time for Bethesda games.\r\nThe entire STEP team, for being awesome, and crafting a very detailed noob-friendly guide to enhancing Skyrim, as well as being the key factor to my start in Skyrim modding. [url=http://skyrim.nexusmods.com/mods/11]Go check it out![/url]\r\n\r\nAnd finally, Bethesda Softworks for creating such a modular and quality game. Thank you all!\r\n\r\n[b][size=3]-- Other Mods Made By Me --[/size][/b]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/32695]Even Better Quest Objectives[/url]\r\n[url=http://skyrim.nexusmods.com/mods/30087]Enhanced Projectile Soul Trap[/url]\r\n[url=http://skyrim.nexusmods.com/mods/31202]Disease Descriptions for the Immersive Adventurer[/url]",
  "categoryId": "78",
  "version": "1.0",
  "author": "William Imm",
  "createdUnix": "1366929299",
  "updatedUnix": "1366928782",
  "containsAdultContent": false,
  "uploadedBy": "WilliamImm",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026469",
      "name": "Dual Sheath Redux for JaySuS Swords",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2544",
      "fileName": "Dual Sheath Redux for JaySuS Swords-35255-1-0.7z",
      "uploadedUnix": "1366928782",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cd483ade5a757fc506caab077fbe4abcd7d52db25327046d21b2c2c57dfa461f/analysis/1407539665/",
      "changelogHtml": " Wow, they came out with a sneaky surprise attack at the start of the round&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dual%20Sheath%20Redux%20for%20JaySuS%20Swords-35255-1-0.7z?fid=1000026469&ttl=1535813662&ri=8192&rs=8192&setec=9c9c584d70ada0c5a68d105045869ab7"
    }
  ]
}