{
  "modId": 35273.0,
  "modName": "My Own Tower",
  "summary": "ever wanted to have a fortification as a base for your raids against bandits&#33;&#33;?&#33;?\r<br />here is a mod for you&#33;as you can see this mod includes a tower and a stable with guards and loads of stuff in it&#33;\r<br />",
  "descriptionHtml": "[color=#FF0000]#NEWS:[/color] 30/04 new version is up for download&#33;enjoy&#33;\r<br />\r<br />[img]http://imageshack.us/a/img819/2319/presentazionef.jpg[/img]\r<br />\r<br />[color=#FF0000]#DISCLAIMER: [/color]\r<br />this is a playable version that may be improved in the future, be sure to truck this file for new updates.. endorsements and feedbacks will be appreciated as always :D\r<br />As all alphas, is highly recommended:\r<br />[u]do not store valuable stuff in the containers because they may be moved or deleted during the process[/u]\r<br />[u]make backup savegames to recover the previous conditions[/u]\r<br />\r<br />[color=#FF0000]#INTRODUCTION:[/color]\r<br />ever wanted to have a fortification as a base for your raids against bandits&#33;&#33;?&#33;?\r<br />here is a mod for you&#33;as you can see this mod includes a tower and a stable with guards and loads of other stuff in it&#33;\r<br />\r<br />[color=#FF0000]#BACKGROUND:[/color]\r<br />The tower, built on the ruins of an ancient nordic fortification of the Bleakwind Bluff, dominates the area with its massive stone walls as evidence of the exceptional wisdom of the Cyrodiil&#39;s imperial craftsmen.\r<br />The rests of the previous fortifications still can be seen around in pieces guarding the foundation of the new mighty tower, ready to provide shelter from the assaults of the evil forces awaken in these dark times...\r<br />\r<br />[color=#FF0000]#UPDATES:[/color]\r<br />-fixed stonestairs glitches\r<br />-fixed pullchain in the secret passage that was not working properly\r<br />-added aesthetic stuff\r<br />-fitted guards patrols\r<br />-fixed guards face generator, now the guards are all different from each other\r<br />-changed some architectures to expand some internal spaces\r<br />-fixed the spawning enemies using TFC command (if not tell it to me)\r<br />-added stuff around\r<br />-added Bleakwind&#39;s Lord Armor Set to the lord&#39;s room mannequin\r<br />-fixed some minor issues and the cell names thanks Supergrunt\r<br />-posted many screens of the interiors\r<br />\r<br />[color=#FF0000]#INSTALL:[/color]\r<br />just put the .esp file in your skyrim/data folder\r<br />\r<br />[color=#FF0000]#COMPATIBILITIES:[/color]\r<br />any that does not change the same towerspot\r<br />REQUIRES DAWNGUARD DLC \r<br />\r<br />[color=#FF0000]#DESCRIPTION:[/color]\r<br />this is a mod that modifies a vanilla location tower (Bleakwind Bluff) not linked to any quest, the purpose of this work is to give a functional (and very lorefriendly) home placed in a keyspot on the highlands of the Reach.\r<br />the amazing landscape and the retexturing of all the stuff used to build it makes this unique place a &#92;&#34;must&#92;&#34; for any adventurer that wants to own a fortification with your own guards overlooking the area.\r<br />All the guards are equipped with ordinance gear created expressly for this mod (this mod does not include new models nor retexture of existing ones but creates new outfits using renamed vanilla stuff fitted to the style and color of the existing models).\r<br />some unique characters live in the tower and the stables with unique outlines but without any papyrus script.\r<br />about the place: look at the screens and discover yourself the huge structure ;)\r<br />(may include some hidden passages)\r<br />\r<br />[color=#FF0000]#LOOKING FOR MODDERS:[/color]\r<br />need people skilled to improve this mod, bugfix, alpha testing, papyrus scripts etcetc\r<br />any help will be appreciated to end up with a finished product&#33;&#33;",
  "categoryId": "89",
  "version": "alpha",
  "author": "mybad",
  "createdUnix": "1366977321",
  "updatedUnix": "1367354646",
  "containsAdultContent": false,
  "uploadedBy": "mybad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027306",
      "name": "My Own Tower ALPHA",
      "version": "alpha",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "264",
      "fileName": "My Own Tower ALPHA-35273-alpha.zip",
      "uploadedUnix": "1367354646",
      "modVersion": "alpha",
      "virusScanUrl": "https://www.virustotal.com/file/4f8fa279d246aee1bdf6cd922144faebcedcb2f15e3e74ad7d560de396fdfe33/analysis/1407548825/",
      "changelogHtml": " this is an alpha testing release, no scripts nor quests in it <br/> \n fixed the spawning enemies using TFC command (if not tell it to me) <br/> \n added stuff around <br/> \n added Bleakwind&#39;s Lord Armor Set to the lord&#39;s room mannequin <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20Own%20Tower%20ALPHA-35273-alpha.zip?fid=1000027306&ttl=1535813692&ri=8192&rs=8192&setec=05051930306f7391c1b21fa7d0af7b7d"
    }
  ]
}