{
  "modId": 35306.0,
  "modName": "Dragonborn Hall",
  "summary": "A highly-detailed Solstheim home for the Dragonborn. Contains one main hall, and three underground halls (Hall of Spirit, Hall of Force, Hall of Shadow). Comes with various amenities and full NavMesh. See full description.",
  "descriptionHtml": "The Dragonborn DLC was a very beautiful albeit short return to the Morrowind days. I enjoyed it and the manor you are given, but I wanted something more. I chose a place where my Dragonborn could lay down and rest after saving the world (twice), a place where He could gather his companions, a place where He could show off his skills and trophies...I chose...I chose to build Dragonborn Hall&#33;\r<br />\r<br />-DESCRIPTION-\r<br />\r<br />Welcome to Dragonborn Hall: a highly detailed, fully NavMeshed, robust player home located on the island of Solstheim overlooking and in proximity of Skaal Village.\r<br />\r<br />Are you an assassin who sticks to the shadows? Perhaps a mage who melts his/her foes with a fireball? Maybe you&#39;re the sneaky type or maybe you&#39;re a powerful warrior. Or you might even be a combination of all of these things. Whatever your play style may be, Dragonborn Hall is built to adapt to you. Located on a beautiful lake, Dragonborn Hall consists of one main hall along with three separate halls (Hall of Spirit, Hall of Force, Hall of Shadow.) You can live in one hall, the main hall, or all of them. That&#39;s right, DBH is 4 immersive and highly-detailed player homes in one&#33; You&#39;ll never look at player homes the same again.\r<br />\r<br />-FEATURES-\r<br />\r<br />To name a few:\r<br />\r<br />-A private dock \r<br />-Map marker\r<br />-Display cases\r<br />-Mannequins\r<br />-5 fully decorated interiors\r<br />-Doghouse for your pet\r<br />-Chicken coop\r<br />-Beautiful view of Red Mountain\r<br />-Various Idle Markers for role playing \r<br />-Fully NavMeshed\r<br />-Loads of storage\r<br />-An insane amount of epicness and functionality\r<br />-Three halls to accommodate any and all play styles\r<br />-More detail than you can imagine\r<br />-And much, much more\r<br />\r<br />-REQUIREMENTS-\r<br />Skyrim and Dragonborn DLC. These are non-negotiable obviously.\r<br />\r<br />-TYPICAL MOD AUTHOR MUMBOJUMBO-\r<br />\r<br />If you like this mod, vote, endorse, comment, tell your grandma, whatever&#33; Any and all feedback is welcome&#33;\r<br />\r<br />I am using Climates of Tamriel in my screens which effects lighting. I love the realistic darkness that you see. If you don&#39;t like the the way the lighting is, vanilla lighting is much brighter. This is just my preference. I also put a lot of detail into this mod such as object placement and what certain images mean. Look around and you&#39;ll see what I&#39;m talking about. The screens don&#39;t even begin to show the half of it.\r<br />\r<br />-OTHER MODS-\r<br />\r<br />Leaps Of Skyrim\r<br />http://skyrim.nexusmods.com/mods/32589\r<br />\r<br />Move Through Time\r<br />http://skyrim.nexusmods.com/mods/32636\r<br />\r<br />The Hole In The Wall- Thief Hideout\r<br />http://skyrim.nexusmods.com/mods/31024\r<br />\r<br />The Mage&#39;s Gorge\r<br />http://skyrim.nexusmods.com/mods/32897\r<br />\r<br />Hunter&#39;s Abode- The Lodge\r<br />http://skyrim.nexusmods.com/mods/35030\r<br />\r<br />-CREDITS-\r<br />\r<br />All CK work done by myself (jrod1311). And a special thanks goes out to my mate acidzebra. Without his tips to fix certain bugs, this mod would not exist. My hat is off to you sir.",
  "categoryId": "67",
  "version": "1.0",
  "author": "jrod1311",
  "createdUnix": "1367052071",
  "updatedUnix": "1367048124",
  "containsAdultContent": false,
  "uploadedBy": "jrod1311",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026693",
      "name": "Dragonborn HallV1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "69",
      "fileName": "Dragonborn HallV1_0-35306-1-0.rar",
      "uploadedUnix": "1367048124",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7d2787d198fa08e719cfe260a9620a954d1d1647500ded1ea41643648c48a7de/analysis/1407543903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20HallV1_0-35306-1-0.rar?fid=1000026693&ttl=1535813753&ri=8192&rs=8192&setec=5f85efb8077be8f30fc698c61eb1fb51"
    }
  ]
}