{
  "modId": 35304.0,
  "modName": "Useful Clothing",
  "summary": "Increases the usefulness of clothing by making small tweaks to various perks.",
  "descriptionHtml": "~Description~\r\n\r\nI have always found it frustrating that clothing in Skyrim is practically useless. Once you have enough invested into enchanting, light and heavy armor can be enchanted to the same degree and also come with an armor value. However, I like the look of robes on my mages and wanted to create a mod that gives an incentive to use something other than armor. The mod achieves this by tweaking the following perks:\r\n\r\n-Every Novice, Apprentice, Adept, Expert, and Master perk from each of the schools of magic now give an additional 10% reduction in Magicka cost (bringing the spell cost down to 40% instead of 50%) but only if you\\'re not wearing any light or heavy armor.\r\n\r\n-Each rank of the \\\"Enchanter\\\" perk in the Enchantment perk tree now adds an additional 4% strength per rank that only applies to enchantments on cloth armor. The new values for clothing enchantments per perk are now 24%/48%/72%/96%/120%\r\n\r\n-Fire Enchanter, Frost Enchanter, Storm Enchanter, Insightful Enchanter, and Corpus Enchanter now give an additional 15% strength to their respective enchantments on clothing (bringing the increase from 25% to 40%).\r\n\r\nWhen all applicable enchantment perks are purchased, the same enchantment on a piece of light or heavy armor will be roughly 40% stronger on a piece of clothing.\r\n\r\n~Mod Compatibility~\r\n\r\nThis mod should be compatible with any mod that adds new perks or changes perks that I didn\\'t touch. If in doubt, loading my mod after the mod in question will let my mod override any changes theirs makes to the above perks while leaving the rest of their mod alone.",
  "categoryId": "93",
  "version": "1.0",
  "author": "Xandermud",
  "createdUnix": "1367035054",
  "updatedUnix": "1367034867",
  "containsAdultContent": false,
  "uploadedBy": "Xandermud",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026677",
      "name": "Useful Clothing",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Useful Clothing-35304-1-0.7z",
      "uploadedUnix": "1367034867",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c2e34d9a045c92b8993f7106e645ef7dca2e19b502f47c820cffb1e7f9b869c6/analysis/1407543801/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Useful%20Clothing-35304-1-0.7z?fid=1000026677&ttl=1535813747&ri=8192&rs=8192&setec=71062e0ebfe2888fa37e01a1546bf6b5"
    }
  ]
}