{
  "modId": 35333.0,
  "modName": "REVENGE OF THE SEXIFIED HOUSECARLS - Hoamaii Armor Mashup for Male",
  "summary": "Housecarls got fed up with exposing their butts when male Dovahkiins ran around clasped in heavy layers of metal, so they decided to forge this: a complete mashup of 8 armor pieces for male, slightly skimpier than what they&#39;re used to but carefully covering the essential parts…",
  "descriptionHtml": "REVENGE OF THE SEXIFIED HOUSECARLS - HOAMAII CHAURUS ARMOR MASHUP FOR MALE\r<br />\r<br />A LITTLE BACKSTORY:\r<br />\r<br />My Dovahkiin was never too keen on exposing his followers&#39; butts in the snow, but with all these Springtime, Summertime and Tropical mods invading his world, he got moved by those poor things sweating along in Dragonbone and Fur and Iron while carrying his burden. So Lydia, Jordis, Iona, they all had to trade their precious iron for, uh, skimpier stuff?..\r<br />\r<br />Little did he know that his housecarls saw things differently. Somewhere between Markarth and Solstheim, they got fed up of charging dragons in bikinis and exposing more clean skin than they ever knew they had. And while my Dovahkiin was off somewhere with soft-spoken Karliah, they started plotting some revenge plan…\r<br />\r<br />Lydia and Jordis went raiding a Falmer den for Chaurus Chtin in some dark Dwemer ruins while Iona and Aela went hunting for some tough hide. And with all these mods, see, they&#39;ve learnt how to use the forge and the tanning rack, to pick up Tundra Cotton, create potions, heck they&#39;re even able to use the enchanting tables&#33;.. Iona&#39;s not so good at sewing yet, Lydia&#39;s not a master of dying textures and Jordis is still a bit rough at the forge, but there it was: when my Dovahkiin returned, he received this… armor, as a present. And you cannot refuse a present, right? Especially when it comes from 3 angry housecarls armed to the teeth…\r<br />\r<br />\r<br />MOD DESCRIPTION:\r<br />\r<br />The Chaurus Mashup comes in 8 pieces of armor, all meshed for Sundracon&#39;s version for Better Males, each assigned to a different slot so that they can be worn together, or separately, or even on top of other stuff:\r<br />- Chaurus Pauldron; slot 58\r<br />- Chaurus Belt: slot 52\r<br />- Chaurus KneePad: slot 53\r<br />- Chaurus Mixed Gauntlets: slot 33 (hands, like other gauntlets)\r<br />- Chaurus Boots: slot 37 (feet, like shoes and boots)\r<br />- Dragon Bracelet: slot 50.\r<br />- Leather String: slot 32 (main body, like Vanilla armor)\r<br />- Booboo bandage: slot 54.\r<br />None of these will prevent you from wearing a cloak, helmet, mask, or piece of jewelry on top of it all.\r<br />\r<br />All can be crafted at any Forge under the Dwemer section but do not require the Dwemer perk. And all can be tempered at the Working Bench.\r<br />\r<br />The Dragon Bracelet comes with the &#34;shortens time between shouts by 20%&#34; enchantment, and the Booboo bandage with the &#34;health restores 20% faster&#34; enchantment.\r<br />\r<br />What&#39;s under the belt is, well, whatever you&#39;re wearing when you&#39;re wearing nothing. That&#39;s why these sweet Housecarls also created the Leather String, it&#39;s basically your underwear. \r<br />\r<br />\r<br />BUGS AND OTHER ISSUES:\r<br />\r<br />None that I am aware of, other than a minor forearm clipping (which is only visible from up close) for the wristband - if any of you sweet people can point out what mistake I may have done, I&#39;ll gladly correct this. \r<br />And, uh, I&#39;m still learning texturing - please be forgiving, guys :). Most Falmer parts use Vanilla textures, other leather and linen parts, I&#39;ve textured myself -  I do not use any ENB, so I have no idea what it may look like with yours.\r<br />Also please remember it is meshed for Sundracon&#39;s, it is very likely that some pieces may look strange on Vanilla bodies or other versions. Per request, I added an optional meshes replacer of the Leather String and the Booboo for FavoredSoul&#39;s body meshes.\r<br />That being said, if your computer gets an arrow in the knee or your housecarls turn green, look another way, it&#39;s not this mod.\r<br />\r<br />\r<br />INSTALLATION:\r<br />\r<br />Easiest way is to use NMM. If not, just drop the meshes in your data&#92;meshes&#92;armor directory and the textures in your data&#92;textures&#92;armor directory, don&#39;t forget to add the .esp in your data, and to check it either in NMM or/and in you launcher data files.\r<br />\r<br />Uninstallation goes exactly the other way around.\r<br />\r<br />REQUIREMENT:\r<br />Better Males: http://skyrim.nexusmods.com/mods/2488 - Sundracon for Main file, FavouredSoul for replacer option for Leather String and Booboo.\r<br />\r<br />\r<br />CHANGE LOG:\r<br />\r<br />01/05/2013: Optional file to replace Leather String and Booboo for FavouredSoul body meshes. The belt may clip in the butt cheek with some custom sneak anims, but it was either that or it was floating around when you&#39;re walking... Can&#39;t have it all ;) \r<br />\r<br />\r<br />CREDITS AND THANKS:\r<br />\r<br />- Nightasy for putting together a great tutorial&#33; Man, everything I&#39;ve done here, I&#39;ve learnt from you&#33;\r<br />http://skyrim.nexusmods.com/mods/19249\r<br />- FavoredSoul for kindly explaining how to assign meshes to body parts: http://forums.nexusmods.com/index.php?/topic/576983-tutorial-assign-meshes-to-new-body-parts/\r<br />- AmesthystDeceiver for offering a consensus on how to assign unused biped nodes: http://forums.nexusmods.com/index.php?/topic/556424-body-part-ids-for-unused-biped-nodes-consensus/\r<br />- Prometheus, for kindly giving me permission to use some of her Conan textures, even though I did not use them in this mod in the end.\r<br />- All the Nexus team and members for creating such an inspiring Website,\r<br />- Bethesda, for creating a great game and giving us the tools to mod it (almost) any way we like,\r<br />- and, of course, Sundracon and FavoredSoul for creating such great male meshes and textures.\r<br />\r<br />\r<br />MY OTHER MODS: \r<br />\r<br />- RSH II - LYDIA STRIKES AGAIN: Hoamaii InnerWear for male: [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://skyrim.nexusmods.com/mods/35940]Hoamaii Inner Wear for Male[/url][/b][/size][/font][/color]\r<br />\r<br />- RSH III - Gannicus Modular Armor: [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://www.nexusmods.com/skyrim/mods/39730]Gannicus Modular Armor[/url][/b][/size][/font][/color]\r<br />\r<br />- Hoamaii Meat Sandwich: [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://www.nexusmods.com/skyrim/mods/57435]Hoamaii Meat Sandwich[/url][/b][/size][/font][/color]\r<br />\r<br />- RSH IV - Hoamaii Modular Iron Armor: [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://www.nexusmods.com/skyrim/mods/58482]Hoamaii Modular Iron Armor[/url][/b][/size][/font][/color]\r<br />\r<br />- Wine and Beer in Tankards (animobjects and static objects replacers): [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://www.nexusmods.com/skyrim/mods/59260]Wine and Beer In Tankards[/url][/b][/size][/font][/color]\r<br />\r<br />- or my fully animated playerhouse: [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://www.nexusmods.com/skyrim/mods/62903]Clearsky Hideout - Fully Animated Playerhouse[/url][/b][/size][/font][/color]\r<br />\r<br />[youtube]CAk4FO8YtrU[/youtube]\r<br />[line]\r<br />\r<br />Tools used:\r<br />- Autodesk 3ds Max\r<br />- Nifskope\r<br />- Gimp\r<br />- Photoshop\r<br />- Bethesda&#39;s Creation Kit\r<br />\r<br />I&#39;m French so please, pardon my French… English ;)",
  "categoryId": "54",
  "version": "",
  "author": "Hoamaii",
  "createdUnix": "1367126276",
  "updatedUnix": "1367424555",
  "containsAdultContent": false,
  "uploadedBy": "Hoamaii",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026833",
      "name": "RSH - Hoamaii Chaurus Mashup ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10683",
      "fileName": "RSH - Hoamaii Chaurus Mashup -35333-1-0.7z",
      "uploadedUnix": "1367125644",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a85250821667395bad59972d4f6014a00cfda0433ff021e7033830387f3e122c/analysis/1407544870/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RSH%20-%20Hoamaii%20Chaurus%20Mashup%20-35333-1-0.7z?fid=1000026833&ttl=1535813798&ri=8192&rs=8192&setec=3b7b8c1eb6dc1790275bbd8c2bb2cf0f"
    },
    {
      "fileId": "1000027446",
      "name": "Favored Soul Replacer for Leather String and Booboo",
      "version": "V1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "308",
      "fileName": "Favored Soul Replacer for Leather String and Booboo-35333-V1-2.7z",
      "uploadedUnix": "1367424555",
      "modVersion": "V1.2",
      "virusScanUrl": "https://www.virustotal.com/file/65df81a89064823a1ff5ddaa345f0bd46f266ee4b6138cc8112bf3180003f6ac/analysis/1407549786/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Favored%20Soul%20Replacer%20for%20Leather%20String%20and%20Booboo-35333-V1-2.7z?fid=1000027446&ttl=1535813799&ri=8192&rs=8192&setec=ee9b266d00c33f5e2c46e8ef797c90a3"
    }
  ]
}