{
  "modId": 35332.0,
  "modName": "MIraak Un-Suckified Un-Suckified",
  "summary": "The new and improved (read: actually working!) version of Miraak Un-Suckified! This mod ACTUALLY adds a basic, leveled, lore friendly rework of Miraak\\'s rewarded inventory to actually make the climax of the Dragonborn DLC worth it.",
  "descriptionHtml": "[center][b][size=4]Miraak Un-Suckified Un-Suckified[/size][/b]\r\n[i]or: You really buggered it up, didn\\'t you Hyac?!\r\nor: ... no seriously, you buggered it up royally, man.[/i]\r\n~ By Hyacathusarullistad [Hi-ACK-a-THUSS-a-RUL-iss-Tad] ~ [/center]\r\n\r\nSo I made a fascinating discovery last night. Apparently, despite my valiant effort, the previous versions of Miraak Un-Suckified did not quite accomplish what I had intended. In fact, they really didn\\'t accomplish much of anything. I mean, they added new versions of Miraak\\'s equipment to the game and all, but I really have no idea why I thought I\\'d integrated them properly. Because I really actually kind of sort of hadn\\'t. And I mean like... at all.\r\n\r\nInstead of trying to fix a mod broken in ways I couldn\\'t even track down, I\\'ve rebuilt the entire thing from the ground up. And I\\'ve uploaded it as a separate file because the last one sucked [i]so hard[/i] that I don\\'t think anyone is even still bothering to track or check it anymore; and I want people to know that I\\'m not a [i]complete[/i] screw up, no matter what my high school guidance councilor might have had to say on the matter. Who\\'s \\\"hopelessly unfocussed and irrational\\\" now, Mr. Garrison? WHO?\r\n\r\nMoving on from my traumatic childhood though (the floor isnt really lava the floor isnt really lava the floor isnt really lava), let\\'s talk some more about what the newest incarnation of this mod does. If you\\'re not familiar with the creation kit, then stick around and get you some ejucatedness. Or you could skip to the paragraphs below where I\\'ll outline the specific item stats, [color=orange]highlighted in orange text below.[/color]\r\n\r\nI\\'ve spent a little more time in the CK since first releasing the Miraak Un-Suckified mod. Small things for my own personal use, mostly. The kind of tweaks that I probably could have gotten the effects of by downloading one of countless near-identical mods on the Nexus. But I made the tweaks myself specifically so I could become better acquainted with the tool, and I feel I\\'ve learned a great deal over the last few weeks because of it.\r\n\r\nOne thing I\\'ve learned trying to fix MUS is that the way the vanilla game handles Miraak and his equipment is actually [i]all[/i] over the place. There are a number of oversights and sets of incomplete data that I hadn\\'t noticed the first time around. For example, there are at least a half dozen different \\\"actors\\\" for the Miraak character that are used at different points in the Dragonborn questline. These characters all have different equip sets, and these equip sets are all managed in a number of different ways - some through outfits and some through basic inventory. The character that you fight at the summit of apocrypha could be wearing any of six different versions of the Miraak robes; and there are three leveled enchantments for these robes. But only the first and most basic of these enchantments is ever used, and it\\'s used on all six of the potential robes. The other two are not apparently used at all, and there are still three robe versions that seem to have no matching leveled enchantment at all. And the character you fight at the summit and the one whose inventory you raid after Miraak\\'s death are two entirely different actors with different inventories. The robes you receive from his corpse are technically a leveled item, but all three potential versions are identical. Same with his staff. You get a 50/50 chance at either a light armor of heavy armor version of his mask, regardless of your skill levels, perk choices, etc.\r\n\r\nAll of this on top of my obsessive compulsive need for immersion and lore-friendliness made for a massive amount of crying, compulsive cursing, and rocking back and forth to nature sounds. But with the helpful collaboration of my good friends caffeine and alcohol, I\\'ve managed to re-create the spirit of the original MSU mod without that pesky \\\"not working\\\" problem that I really think held it back a bit.\r\n\r\n[color=orange]Miraak\\'s entire equipment set is now light armor. [b]I will very shortly be uploading an optional heavy version of the Miraak mask with identical enchantments.[/b] But it\\'s late and I have a whole lot of poor decisions to make tomorrow, so it\\'ll have to wait.\r\n\r\n[list][size=2][b][i]Boots[/i][/b][/size]\r\nPC Level 1-44:\r\n[*]Armor = 7pts, \r\n[*]Weight = 2pts\r\n[*]Value = 900 septims\r\n[*]Enchantments = Absorb Dragonbreath/Spells 5%; Boost Absorb Dragonbreath/Spells 5%.\r\n\r\nPC Level 45-59:\r\n[*]Armor = 9pts\r\n[*]Weight = 2pts\r\n[*]Value = 1100 septims\r\n[*]Enchantments = Absorb Dragonbreath/Spells 10%; Boost Absorb Dragonbreath/Spells 5%.\r\n\r\nPC Level 60+:\r\n[*]Armor = 11 pts\r\n[*]Weight = 2pts\r\n[*]Value = 1400 septims\r\n[*]Enchantments =  Absorb Dragonbreath/Spells 15%; Boost Absorb Dragonbreath/Spells 5%.[/list]\r\n\r\n[list][size=2][b][i]Gloves[/i][/b][/size]\r\nPC Level 1-44:\r\n[*]Armor = 7pts, \r\n[*]Weight = 2pts\r\n[*]Value = 900 septims\r\n[*]Enchantments = Absorb Dragonbreath/Spells 5%; Boost Absorb Dragonbreath/Spells 5%.\r\n\r\nPC Level 45-59:\r\n[*]Armor = 9pts\r\n[*]Weight = 2pts\r\n[*]Value = 1100 septims\r\n[*]Enchantments = Absorb Dragonbreath/Spells 10%; Boost Absorb Dragonbreath/Spells 5%.\r\n\r\nPC Level 60+:\r\n[*]Armor = 11 pts\r\n[*]Weight = 2pts\r\n[*]Value = 1400 septims\r\n[*]Enchantments =  Absorb Dragonbreath/Spells 15%; Boost Absorb Dragonbreath/Spells 5%.[/list]\r\n\r\n[list][size=2][b][i]Chainmail[/i][/b][/size]\r\nPC Level 1-44:\r\n[*]Armor = 36pts, \r\n[*]Weight = 9pts\r\n[*]Value = 1450 septims\r\n[*]Enchantments = Absorb Dragonbreath/Spells 15%.\r\n\r\nPC Level 45-59:\r\n[*]Armor = 38pts, \r\n[*]Weight = 9pts\r\n[*]Value = 1500 septims\r\n[*]Enchantments = Absorb Dragonbreath/Spells 20%.\r\n\r\nPC Level 60+:\r\n[*]Armor = 41pts, \r\n[*]Weight = 9pts\r\n[*]Value = 1550 septims\r\n[*]Enchantments = Absorb Dragonbreath/Spells 25%.[/list]\r\n\r\n[list][size=2][b][i]Mask[/i][/b][/size]\r\nPC Level 1-44:\r\n[*]Armor = 16pts, \r\n[*]Weight = 4pts\r\n[*]Value = 1800 septims\r\n[*]Enchantments = Shout Cooldown Reduction 20%; Magicka Increase +50; Magicka Regeneration +20%.\r\n\r\nPC Level 45-59:\r\n[*]Armor = 17pts, \r\n[*]Weight = 4pts\r\n[*]Value = 1900 septims\r\n[*]Enchantments = Shout Cooldown Reduction 25%; Magicka Increase +60; Magicka Regeneration +30%.\r\n\r\nPC Level 60+:\r\n[*]Armor = 18pts, \r\n[*]Weight = 4pts\r\n[*]Value = 2000 septims\r\n[*]Enchantments = Shout Cooldown Reduction 30%; Magicka Increase +70; Magicka Regeneration +35%.[/list][/color]",
  "categoryId": "27",
  "version": "2.0",
  "author": "Hyacathusarullistad",
  "createdUnix": "1367118871",
  "updatedUnix": "1367118095",
  "containsAdultContent": false,
  "uploadedBy": "Hyacathusarullistad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000026821",
      "name": "HyacMiraakUnsuck",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1063",
      "fileName": "HyacMiraakUnsuck-35332-2-0.rar",
      "uploadedUnix": "1367118095",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/b106fc8dd30b936633c197639f2141b73460c5a62d0b2ad735112ac75e8a2371/analysis/1407544760/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HyacMiraakUnsuck-35332-2-0.rar?fid=1000026821&ttl=1535813797&ri=8192&rs=8192&setec=4e3577f1ce264ad4d914936927ae4264"
    }
  ]
}