{
  "modId": 35376.0,
  "modName": "Beyond Furthest Borders - Working Prototype In Progress",
  "summary": "Beyond Furthest Borders is currently a Working Prototype Quest mod with heavy inspiration from the works of H.P.Lovecraft. Currently about 2 hour long, but planned to be approximately 10-15. Uncover a mystery about a sinister curse, a great race, a king, an evil that lurks beneath the earth, and a chaos from beyond furthest borders.",
  "descriptionHtml": "[size=2] Update: Greetings users. Thank you for stay with me and watching the project for so long&#33; I am genuinely humbled by each and everyone of you that has kept an eye on it. I have not forgotten this project, repeat: it is not dead.\r<br />\r<br />That said, things are not looking good.[/size] After moving computers, I have uncovered the fact that my development build was corrupted in the process. What work I did since the release you can find on this mod page is all but gone. This infuriates me to no end, not just that I have to do work over again, but have to find the time to do it. While I have cut ties with other obligations (primarily, the Metro 2033 ones), and have finished schooling - I am now in the video game &#39;work force&#39;. My time is limited, and I have other projects in mind, but so little time to dedicate to them. I do have incentive to work on this project, but only in that it can be a great portfolio piece for future job hunts. Not quite the way I wanted to make the project.\r<br />At this point BFB for TESVI ([url=http://s3.postimg.org/iokhijzox/Ftaghn_Hype.jpg]or perhaps Fallout 4[/url]&#33;) is the most likely scenario, perhaps you can find solace in that.\r<br />\r<br />Thanks for your time and dedication, if you would like to contact me you can try to PM me, or even e-mail me at ilongiaru@gmail.com.\r<br />Chaosian\r<br />\r<br />\r<br />\r<br />[size=3][center][i]Inquire within...[/i][/center][/size]\r<br />________________________________________________________\r<br />[size=10]Beyond Furthest Borders[/size]\r<br />________________________________________________________\r<br />\r<br />[size=5]Description:[/size]\r<br />Beyond Furthest Borders is currently a Working Prototype Quest mod with heavy inspiration from the works of H.P.Lovecraft, currently about 2 hour long, but planned to be approximately 10-15. Journey across Tamriel to uncover a mystery about a sinister curse, a [color=#339900]great race[/color], a [color=#FFCC33]king[/color], an [color=#0000CC]evil[/color] that lurks beneath the earth, and a [color=#FF0000]chaos[/color] from beyond furthest borders[color=#993399].[/color]\r<br />\r<br />Currently, not even one of the lengthy quests in the quest-line are complete, and the Lovecraft is simply thematic. Influences so far include: Haunter in the Dark, Whisperer in Darkness, The Shadow Out of Time, The Hound, The Statement of Randolph Carter, and The Thing at the Doorstep. Planned influences include (among others) Nyarlathotep, The Call of Cthulhu, The Mound, Through the Gates With the Silver Key, as well as extended mythos such as The King in Yellow. \r<br />\r<br />As is, at a casual pace, the mod plays for roughly 2 hours.\r<br />\r<br />[b]NOTE: THE MOD IS DESIGNED SO THAT THE PLAYER HAS COMPLETED THE MAIN QUEST (DRAGONSLAYER).[/b]\r<br />Begin your adventure by receiving and reading a letter. The best place to get said letter is by simply walking into a city, and then if nothing happens, waiting a few hours for a courier to come or going to another nearby settlement should work.\r<br />For players who have not completed the main quest, download the foolproof version.\r<br />\r<br />[size=5]Requirements:[/size]\r<br />- A file that has completed the main quest-line with the dragons (see above). If this requirement is not met, use the Foolproof version. \r<br />- A keen mind.\r<br />- Knowledge of Lovecraft is not required, but down the road, it may be a treat. Hopefully, the loading screens I have will be functional, and nice, for the uninformed.\r<br />\r<br />[size=5]Game Regarding Notes and Warnings:[/size]\r<br />- This is my first Quest mod, and in actuality, my first real mod I&#39;ve released - thus I&#39;m not entirely sure how smooth the installation will go. This is currently untested on another computer, so any crashes, gray-face bugs or, simply broken sections will be immediately attended to upon report&#33;\r<br />\r<br />[size=5]Updates:[/size]\r<br />- Version 0.1 is out for testing&#33;\r<br />\r<br />[size=5]Helping out and Future Plans:[/size]\r<br />- You don&#39;t have to like or favorite the mod or anything, but any feedback is great&#33; I love commentary, and suggestions.\r<br />- Please, report any bugs (or just gameplay oddities) you encounter&#33; It really helps me get a focus on what areas still need work&#33;\r<br />- Keeping this mod-copyright clean is always a project in itself. If you know of any good place on the net to find sounds / music, or are a generous and talented sound-artist yourself, please leave me a comment&#33;\r<br />- I am currently not yet looking for modding partners, moddlers, or voice actors for the project, as the project is, quite frankly, undeserving of such in it&#39;s state right now. However, any offers for such are still very welcome, and will be thoroughly considered&#33;",
  "categoryId": "35",
  "version": "0.1",
  "author": "Ian Longiaru",
  "createdUnix": "1367952714",
  "updatedUnix": "1371791148",
  "containsAdultContent": false,
  "uploadedBy": "Chaos_ian7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035115",
      "name": "Beyond Furthest Borders Archive Fix Directory Fix Testing Version",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57209",
      "fileName": "Beyond Furthest Borders Archive Fix Directory Fix Testing Version-35376-0-1.zip",
      "uploadedUnix": "1371791148",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/b0c1a011536be8d86b79df946b1d92ecc94c95851a1bbc8579bd461e31705cec/analysis/1407610946/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beyond%20Furthest%20Borders%20Archive%20Fix%20Directory%20Fix%20Testing%20Version-35376-0-1.zip?fid=1000035115&ttl=1535813877&ri=8192&rs=8192&setec=8f54e9362d37c4edb60988b0cb09b7f2"
    }
  ]
}