{
  "modId": 35378.0,
  "modName": "Corpse Preparation - True Necromancy",
  "summary": "Corpse Preparation is a lore-based mod to bring true Necromancy to Skyrim.  The core of this mod allows the player to pick up corpses and prepare them for reanimation on a Necromancer altar.  Depending on your skill and the available materials, you can create skeletons, zombies infected with various diseases, wraiths, thralls, and mummies.  Corpse ",
  "descriptionHtml": "[center][size=6][b][color=#c00000]Corpse Preparation: True Necromancy[/color][/b][/size]\r<br />[size=5]By, Mojo[/size][/center]\r<br /> \r<br />[center][i][font=arial narrow , sans-serif][size=5]&#34;Who can know the shame of the dead, the ceaseless weeping of the necromancer&#39;s thrall? Cruel enough is the ancestor&#39;s service given in love to Hearth and Kin. But ghost or guardian, bonewalker or bonelord, summoned by profane ritual and bound by force to the corpse miner&#39;s will, how may such a spirit ever find rest? How may it ever find its way back to its blood and clan?&#34;[/size] [/font][/i]- Unknown, Blasphemous Revenants[/center]\r<br />[center] [/center]\r<br />Corpse Preparation is a lore-based mod to bring true Necromancy to Skyrim.  The core of this mod allows the player to pick up corpses and prepare them for reanimation on a Necromancer altar.  Depending on your skill and the available materials, you can create skeletons, zombies infected with various diseases, wraiths, thralls, and mummies.  Corpse Preparation stays as true to the lore as possible, utilizing sources from multiple books, journals, dialogue, and quests spread out across the Elder Scrolls series.\r<br />\r<br />Updates\r<br />\r<br />Version 1.3.3\r<br />Fixed a bug in which corpse interaction was disabled by default \r<br />\r<br />Version 1.3.2\r<br />Added new catgut/scrap metal models by Batmanna (more to come soon)\r<br />Added new effects/sounds associated with soul corruption\r<br />Added functionality to prevent the player from moving when picking up a corpse or harvesting bonemeal until the action is complete\r<br />Fixed a bug which caused dropped corpses to not appear in front of the player\r<br />Fixed bugs with placing a corpse on the altar\r<br />Fixed bugs with managing revenant levels\r<br />Fixed a bug in which the silence effect was ineffect in certain situations (e.g. Festus in the destroy the DB quest)\r<br />Changed default MCM controls (e.g. Drop Corpse) to an invalid key instead of Escape\r<br />Added MCM options to remove corpse preparation abilities from the spell list (e.g. Drop Corpse)\r<br />Added MCM option to disable corpse interaction when sneaking.\r<br />\r<br />Version 1.3.1\r<br />Fixed a bug which prevent the player from waiting or sleeping while wearing the Mantle of Woe\r<br />Sun damage is now disable during an eclipse (no dawnguard dependency needed)\r<br />Minor edits to Soul Corruption script\r<br />Added preventive measures to catch rare soul corruption bugs\r<br />\r<br />Version 1.3.0\r<br />Added a new &#34;soul corruption&#34; system\r<br />   -Practitioners of the Dark Arts are vulnerable to the corruption of the soul.  Performing Necromantic rituals and interacting with black soul gems can corrupt your soul.\r<br />   -Corruption can reduce your speechcraft abilities, make you more prone to disease, reduce your stamina and health regeneration, and reduce your effectiveness with melee weapons.  Corruption will also prevent you from gaining rested benefits after sleeping.\r<br />   -Those adept in the Arts are more resilient to corruption.\r<br />Added an MCM option to use conjuration and alchemy attribute levels instead of perks\r<br />   -Conjuration of 20 increases max reanimate level by 5\r<br />   -Conjuration of 40 increases max level by an additional 10\r<br />   -Conjuration of 60 increases max level by an additional 10\r<br />   -Conjuration of 80 increases max level by an additional 10\r<br />   -Conjuration of 100 increases max level by an additional 10\r<br />   -Alchemy of 35 increases max level by 10\r<br />   -Conjuration of 60 substitutes as the &#34;Dark Souls&#34; perk for reanimating undead via the Altar\r<br />A new 3 day boon is available from the unholy font after all other rewards are obtained\r<br />Replaced the catgut and scrap metal models with bags\r<br />Scrap metal can now be crafted\r<br />Updated the silence magic effect to use the same system in &#34;Spells of Tamriel&#34;.  NPCs will no longer relentlessly try to cast spells when they are unable to do so.\r<br />&#34;Summon Skeletal Horde&#34; now uses dawnguard models if the plugin is installed\r<br />Rebalanced the frost magic skeleton in &#34;Summon Skeletal Horde&#34;\r<br />Fixed a bug which sometimes caused corpses to not drop in front of you when using the &#34;Drop Corpse&#34; ability\r<br />Fixed a bug in which the Shade of the Revenant did not work\r<br />Added additional measures to prevent weird bugs\r<br />\r<br />Version 1.2.3\r<br />Updated the Necromancy/NPC reaction system\r<br />   -Infamy system now works similar to Skyrim crime system.  You may be infamous in one location, but not in another.\r<br />   -Infamy in a region takes 24 hours to wear off.\r<br />   -Removed the &#34;smell of death&#34; system.\r<br />Fixed the minion command abilities\r<br />   -Minions will only respond if they are in range.\r<br />Fixed a bug where you can get locked out of the altar if you had a ghost die (and other associated issues)\r<br />Fixed a bug which caused generic thralls/zombies to be the incorrect level\r<br />\r<br />Version 1.2.2\r<br />Completing The Dark Path quest will now properly complete before you leave the cell\r<br />Fixed a bug where The Dark Path quest can end prematurely\r<br />Fixed a bug where The Dark Path courier would refuse to talk to you if you had &#34;death&#39;s cloak&#34; on\r<br />Fixed a bug which prevented the player from completing The Dark Path\r<br />Fixed a bug in which certain objects were not disabled after completing The Dark Path\r<br />Fixed a bug which caused the Guardian Wraith&#39;s Dark Curse to not dispel when it dies\r<br />Fixed a bug which prevented the speech/armor debuff from working properly on the Mantle of Woe\r<br />Added a perk to Guardian Wraiths which makes them immune to fall damage\r<br />\r<br />Version 1.2.1\r<br />Forgot to start actor base maintenance quest :S\r<br />\r<br />Version 1.2.0\r<br />\r<br />Added the ability to perform a ritual black souls to gain additional necromantic abilities\r<br />-Included alternative/less evil path\r<br />Added the ability to controll 3 thralls/mummies (as a result of the abilites gained from above)\r<br />-As a result, the functionality to select the combat style of mummies has been removed\r<br />-Upon loading the patch, the game will run a short maintenance sequence to correct the combatstyles of mummies/thralls (based on their attributes/skills)\r<br />Reworked the MCM options for modifying damage taken/dealt so it works properly and more accurately\r<br />-Currently cannot modify damage output of unique thralls/mummies\r<br />Optimized and cleaned up many scripts\r<br />Fixed the hate quest dialogue from not working\r<br />Fixed a bug which spawned a skeleton of the wrong level when removing flesh off a corpse on the ground\r<br />Fixed a bug when picking up rigid skeletons from vanilla Skyrim\r<br />Fixed a bug which caused portable items (altar, salt bath) from disappearing if combat is initiated when placing the item\r<br />Fixed a bug which made a corpses inventory inaccessible if it was taken off an altar\r<br />Fixed a bug which caused zombies to not always be cleaned up properly\r<br />Fixed a bug which caused certain unique NPCs to crash the game when embalming them or placing them on the altar\r<br />Added extra measures to make sure corpses clean up in a timely manner\r<br />Added a few edits to avoid overwriting bugs fixes from the Unofficial Skyrim Patch\r<br />\r<br />Version 1.1.0\r<br />\r<br />Added the ability to pick up the corpse preparation altar and salt bath and move them to another location.\r<br />Added catgut and scrap metal to general merchants ~25% chance (no Wrye Bash needed)\r<br />Fixed a bug which sometimes caused corpses to say &#34;arrggh&#34; when being placed on the altar.\r<br />\r<br />\r<br />Version 1.0.4\r<br />\r<br />Added the ability to pick up &#34;vanilla&#34; skeletons that aren&#39;t broken.\r<br />Fixed a bug which prevented the player from picking up unique mummies.\r<br />Fixed a bug when picking up a mummy from the altar.\r<br />Fixed a bug which caused skeletons to turn into zombies...\r<br />Fixed a few ITM edits.\r<br />\r<br />\r<br />Version 1.0.3\r<br />\r<br />Fixed a bug with unique thralls in which their voice type would revert back to its default upon reloading the game\r<br />\r<br />\r<br />Version 1.0.2\r<br />\r<br />The pickup corpse ability should be fixed so you cannot pickup living things or creatures you cannot reanimate\r<br />Fixed a bug where the clean up system didn&#39;t work properly\r<br />   -The game will now keep track of up to 20 corpses.  If you create more than 20 then it will automatically clean up one to make room\r<br />   -Corpses without linen wraps won&#39;t be cleaned up (unless you have 20 corpses with linen wraps)\r<br />   -Corpses will clean up after 24 hours after leaving their cell unless they have linen wraps in their inventory\r<br />   -Upon updating the game will try to find all corpses and transfer them over to the new system\r<br />   -Any corpses not found will just get cleaned up by the game&#39;s built in system\r<br />Fixed a bug where the flesh health or unique thralls could decrease significantly\r<br />Get Stats power should now also show spells which were dynamically added to the NPC\r<br />Fixed a bug where mummies did not have the spells of the corpse embalmed\r<br />Corpses should now be preserved when adding linen wraps\r<br />Fixed MCM interaction with archery skill\r<br />\r<br />Version 1.0.1\r<br />\r<br /> Add abilities to force all minions to attack a target/wait at a location/follow you\r<br />Add SkyUI option to add keymap controls for picking up/dropping corpses, getting stats, and ordering the commands described above\r<br />Increased the range on the MCM slider options\r<br />Unique thralls/mummies will no longer be replaced by a duplicate\r<br />Modified the clean up function to move unique actors to &#34;morgue&#34; cell\r<br />Dropping a corpse will now fade the corpse into existence\r<br />Spawning a skeleton by removing flesh off of corpse should now fade it into existence\r<br />Improved response time of activation corpse altar\r<br />Fixed a bug with the damage resist going crazy on thralls\r<br />-As a result, if you have a thrall following you they will unequip all their armor upon update so the value can be reset (one time only event)\r<br />Fixed a bug when trying to take a corpse from the salt bath while already carrying one\r<br />Fixed a bug with the fixed status of zombies resetting\r<br />Fixed a typo in one of the zombie messages\r<br />Fixed the alteration skill not being properly modified with the MCM menu\r<br />Fixed a harmless error message from popping up in the papyrus log regarding script properties\r<br /> \r<br />[size=5][b][color=#c00000]Requirements[/color][/b][/size]\r<br /> \r<br />Latest Version of Skyrim - 1.9.32.0\r<br />Latest Version of SKSE - 1.6.16 ([url=http://skse.silverlock.org/]http://skse.silverlock.org/[/url])\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Recommendations[/color][/b][/size]\r<br /> \r<br />SkyUI - 3.0+ ([url=http://skyrim.nexusmods.com/mods/3863]http://skyrim.nexusmods.com/mods/3863[/url])\r<br />Spells of Tamriel: My spell mod which adds spells from Morrowind and Oblivion into the game, as well as a couple of other fun spells in there.  Has poison based spells which prevent friendly fire with the undead/daedra as well as targeted spells such as shield and fortify attribute. ([url=http://skyrim.nexusmods.com/mods/21941/]http://skyrim.nexusmods.com/mods/21941/[/url])\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Getting Started[/color][/b][/size]\r<br /> \r<br />Corpse Preparation is designed to teach you the ways of Necromancy as you play the game.  Starting out is very easy.  You simply need to find a corpse you wish to reanimate (pick it up by crouching), and bring it down to the altar located underneath the College of Winterhold, in the Midden Dark.  Your first reanimation will be a skeleton and you will need the proper ingredients to raise it.  You&#39;ll receive tips and hints as your improve you skills, which is done by reanimating corpses.  It takes 20 reanimations to reach the mastery level.  You can only have 3 followers at once, and only of them can be a thrall.  A new NPC in the College of Winterhold Arcaeneum will have some of the needed supplies for reanimation.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Undead Servants[/color][/b][/size]\r<br /> \r<br /> \r<br />[b][size=5]Skeletal Guardian[/size][/b]\r<br /> \r<br />[center][size=3][i][font=arial narrow , sans-serif]&#34;It is difficult to generalize about fleshless revenants, or skeletons. The agility and fighting ability of the animated remains may depend on the abilities of the revenant&#39;s former life, and may therefore be weak or strong, or more or less capable with weapons and shields.&#34;[/font][/i][/size] - Unknown, Legions of the Dead[/center]\r<br />[center] [/center]\r<br />[center] [/center]\r<br />Skeletons are available to all levels of necromancy.  Their One-handed, Two-handed, Marksman, and Block skills are based off of the victim&#39;s skills.  Skeletons cannot use magic, use daggers, or dual-wield weapons.  They cannot wear armor, but they can still wear rings and amulets.\r<br /> \r<br /> \r<br />[center][size=3][i][font=arial narrow , sans-serif]&#34;While the magic involved in raising a skeleton will assemble the bones in the proper order, skeletons may be strengthened considerably by the addition of support on their joints. The most common are leather straps that bind the bones together more tightly. Some practitioners also drive metal spikes are between the joints, which is more expensive and time consuming, but they protect the servant where it is weakest ... One more note to the student: While most undead can be raised again and again, skeletons are often damaged in ways that make raising them again impossible. This is another reason that care should be given to the skeleton&#39;s preparation. Too many young Necromancers raise every skeleton they see with little or no preparation at all. Given the difficulty of obtaining corpses, this kind of inefficiency cannot be tolerated.[/font][/i]&#34;[/size] - Unknown, Corpse Preparation, Volume II: The Skeletal Corpse[/center]\r<br />[center] [/center]\r<br /> \r<br />They can be strengthened before reanimation by using 12 leather straps and a pile of scrap metal.  This improves health and stamina up to 5-25% and gives you a 5-25% chance to be able to reuse the skeleton upon death depending on your necromancer level.  The ritual requires 3 bone meal, 3 nightshade, and 1 pile of void salts.\r<br /> \r<br /> \r<br />[b][size=5]Zombie[/size][/b]\r<br /> \r<br />[center][size=3][i][font=arial narrow , sans-serif]&#34;Flesh revenants, or &#39;zombies&#39; as they are often called in the West, are known as &#39;bonewalkers&#39; in Morrowind. Magic preserves the bonewalker&#39;s fleshy remains along with the bones and spirit. Bonewalkers are readily identified by the sharp protuberances of bone and metal employed in the rituals that bind them to this plane.&#34;[/font][/i][/size][/center]\r<br />[center] - Unknown, Legions of the Dead[/center]\r<br />[center] [/center]\r<br />[center] [/center]\r<br />Zombies can be reanimated at the apprentice level of necromancy.  They deal melee damage from unarmed attacks based on their level.  Zombies cannot wear armor but they can wear rings and amulets.  They have a chance of infecting you with a disease upon interacting with them, but they can also infect enemies in combat.  Apprentice level zombies can only have Brown Rot, but Expert level zombies can also have Collywobbles, Chills, and Astral Vapors.  Zombies will also give you unique alchemy ingredients when removing their flesh.  Combined they can make a silencing poison which prevents enemies from casting spells.  The ritual requires 2 Namira&#39;s rot, 3 nightshade, and 1 pile of void salts.\r<br /> \r<br /> \r<br />[b][size=5]Guardian Wraith[/size][/b]\r<br /> \r<br />[center][size=3][i][font=arial narrow , sans-serif]&#34;Spirit revenants like the ancestor ghost, wraith, and dwarven ghost, can only be harmed by weapons that are enchanted or made of refined substances such as silver. Ancestor ghosts, the most common spirit revenant, are harmless, apart from the minor curses they lay upon their victims. Wraiths are similar to ghosts, but they are capable of inflicting wounds to the careless explorer. Dwarven ghosts are more dangerous still, but they generally appear only in Dwarven ruins.&#34;[/font][/i][/size] - Unknown, Legions of the Dead[/center]\r<br />[center] [/center]\r<br />[center] [/center]\r<br />Wraiths can be reanimated at the adept level of necromancy.  By default, they will only have access to an ice projectile.  Its damage is dependent on the wraith&#39;s level.  At the expert necromancy level, wraiths will gain curse which absorbs life from the target while reducing magicka and stamina regeneration.  At the master level, wraiths have a spell which deals frost damage over time and silences its target, which prevents spell casting.  Wraiths are immune to normal weapons, and can only be damaged by magic and weapons which are silver, daedric, or enchanted.  The  ritual requires 3 nightshade, 5 glow dust, and 3 piles of void salts.  A skull will be bound to you with the wraith until you the wraith dies or you release it.\r<br /> \r<br /> \r<br />[b][size=5]Thrall[/size][/b]\r<br /> \r<br />Thralls can be reanimated at the expert level of necromancy.  Similar to the reanimate spells, thralls have all the combat skills and spells of the victim before death.  The ritual requires 1 pile of vampire dust, 5 nightshade, and 2 piles of void salts.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Decay[/color][/b][/size]\r<br /> \r<br />[size=3][i][font=arial narrow , sans-serif]“However, there are a few tips that a young Necromancer might want to know. For instance, a decayed servant may be raised many times, even if they have been dismembered by those who do not appreciate our Art. If one of your servants comes to an unfortunate end, you may raise the servant again by carefully gathering as many parts as you can find, binding the bones with leather straps, and sewing the flesh (if it not too decayed) with catgut. Your servant may be weaker each time this is done, but with care and maintenance, one may raise zombies dozens of times.”[/font][/i][/size] -Unknown, Corpse Preparation, Volume Three: The Fresh Corpse\r<br /> \r<br />When a zombie or thall dies, its flesh health is reduced depending on the age of the minion.  These corpses must be repaired with 4 leather straps, 1 catgut suture, and a pile of scrap metal before they can be reanimated again.  This will restore the flesh health by a small amount depending on your necromancy level.  If the flesh health is below 50 and above 0, only a zombie can be reanimated.  If it is below 0, then the flesh must be removed.  Mummified thralls cannot have their flesh health damaged.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Mummification[/color][/b][/size]\r<br /> \r<br />[size=3][i][font=arial narrow , sans-serif]&#34;However, creating a mere zombie is a method best left to lazy or desperate practitioners. With only a bit more time and effort, one may create a far more useful mummified servant.The first step to creating a mummified servant is to soak the decaying corpse in a bath of salt or natron for at least one month. This will halt the decay of the corpse, and if the corpse is fresh enough to have an unpleasant odor, the salts will remove that as well. In a moist climate, such as Argonian or Thras, you may have to apply more salts if they become saturated. Some Necromancers remove the vital organs before or after this process, but I have never found any practical reason for doing this. The next step is to wrap the servant in cloth or linen. This will further preserve the body against decay and, if done properly, will offer some protection as well. Do not worry if the corpse seems too stiff or desiccated to be a useful servant, the proper rituals will imbue the mummified corpse with the strength to move itself. Most importantly, you will have a much stronger servant who will follow your commands with more independence and understanding.&#34;[/font][/i][/size] -Unknown, Corpse Preparation, Volume Three: The Fresh Corpse\r<br /> \r<br />Thralls can be mummified before reanimation  by placing them in a salt bath for 30 days and then wrapping them in linen.  This requires 5 piles of salt and 5 linen wraps.  Mummified thralls can be reanimated at the expert level of necromancy and have a 15% bonus to all attributes.  Mummified thralls can also have their confidence, aggressiveness, and combat style modified.  Mummified thralls have the same reanimation requirements as regular thralls.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Black Soul Gems[/color][/b][/size]\r<br /> \r<br /> \r<br />[b][size=5]Reanimation Requirements[/size][/b]\r<br /> \r<br />If a victim was soul trapped, then a filled black soul gem is required for the ritual in replacement of the void salts.  You can also soul trap all of your reanimated revenants.\r<br /> \r<br /> \r<br />[b][size=5]Shade of the Revenant[/size][/b]\r<br /> \r<br />[center][size=3][i][font=arial narrow , sans-serif]&#34;The Revenant, the Necromancer&#39;s Moon, watches over us all. His Form, ascended to Godhood, has taken its rightful place in the sky, and hides the enemy Arkay from us so that we may serve Him. Watch for the signs: when the heavenly light descends from above, hasten to His altars and make your offering, so that He may bless you with but a taste of His true power. Grand Soul Gems offered to Him will be darkened, and can be used to trap the souls of the unwitting; a feat even the great N&#39;Gasta would marvel at.&#34;[/font][/i][/size] - Unknown, Necromancer&#39;s Moon[/center]\r<br />[center] [/center]\r<br />[center] [/center]\r<br />Once every eight days, a purple beam will shine on an altar at Skytemple Ruins, north of the College of Winterhold.  Black soul gems can be created by placing a grand soul gem inside and casting a soul trap spell on the altar.\r<br /> \r<br /> \r<br />[b][size=5]Soul Corruption[/size][/b]\r<br /> \r<br />[center][size=3][i][font=arial narrow , sans-serif]&#34;White souls are far safer than black souls, although not as powerful. Beginning students of Mysticism should not dabble in black souls or black soul gems. Even if one were to ignore the guild strictures against the necromatic [sic] arts used to power black soul gems, it is dangerous to the caster to handle them for long. If the gem is not precisely the size of the encased soul, small bits of the caster&#39;s soul may leak into the gem when it is touched.&#34;[/font][/i][/size] -Unknown, Souls, Black and White[/center]\r<br /> \r<br />Practitioners of the Dark Arts are vulnerable to the corruption of the soul.  Performing Necromantic rituals and interacting with black soul gems can corrupt your soul.  Corruption can reduce your speechcraft abilities, make you more prone to disease, reduce your stamina and health regeneration, and reduce your effectiveness with melee weapons.  Corruption will also prevent you from gaining rested benefits after sleeping.  Those adept in the Arts are more resilient to corruption.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Reanimation and Soul Trap Spells[/color][/b][/size]\r<br /> \r<br /> \r<br />[b][size=5]Soul Trap[/size][/b]\r<br /> \r<br />The soul trap spell works differently in Corpse Preparation.  It now fires a fast moving invisible &#34;projectile&#34; and you can see where you spell hits.  More importantly, the soul trap function has been competely reworked (optional, see MCM section below).  In vanilla Skyrim, there is a bug in which dropping/transferring a filled soul gem or the Azura&#39;s/Black Star can reset it&#39;s charged.  White souls were also allowed to be trapped in the Black Star or black soul gems.  Both of these issues have been fixed.\r<br /> \r<br /> \r<br />[b][size=5]Dead Thrall[/size][/b]\r<br /> \r<br />The dead thrall spell is no longer a permanent reanimation.  Instead it can reanimate any creature/human up to any level.  It does not create an ash pile at the end of the effect.\r<br /> \r<br /> \r<br />[b][size=5]Reanimation Staves and Scrolls[/size][/b]\r<br /> \r<br />Thralls reanimate with a staff now create an ash pile on death, but the level of magnitude of the staves have been adjusted to match the corresponding spell.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Perks[/color][/b][/size]\r<br /> \r<br />Corpse Preparation does not add any new perks to the game, but utilizes already existing ones.\r<br /> \r<br /> \r<br />[b][size=5]Conjuration Mastery and Necromancy[/size][/b]\r<br /> \r<br />By default, you can only raise corpses up to level 5.  The novice conjuration perk will increase this limit by 5, and all other mastery perks as well as the necromancer perk will raise the limit by 10.  The necromancer&#39;s amulet also increases the limit by 5.  If all six perks are unlocked and you wield the amulet, then the reanimation cap is unlimited.  Alternatively, an MCM option is available to replace the perk requirements to be based on the player&#39;s conjuration and alchemy levels.  Level requirements increase at conjuration levels of 20, 40, 60, 80, and 100 as well as an alchemy level of 35.\r<br /> \r<br /> \r<br />[b][size=5]Dark Souls[/size][/b]\r<br /> \r<br />If you have the dark souls perk, then any minions you reanimate will receive the health bonus.  In addition, if you a Master of necromancy then they will also gain a 20% resistance to magic.  If using the perk alternative option via the MCM menu, this can be substituted for a conjuration level of 65.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Reactions Towards Necromancy[/color][/b][/size]\r<br /> \r<br />[center][size=3][i][font=arial narrow , sans-serif]&#34;Necromancers are the scourge of Tamriel. Whether operating independently or in concert with the sloads or King of Worms, Mannimarco, they are responsible for many horrors, animated zombies and skeletons and other forms of the undead.[/font][/i]&#34;[/size] - Master gra-Kogg, The Black Arts on Trial[/center]\r<br />[center] [/center]\r<br />[center] [/center]\r<br />Most citizens will react negatively to you as a necromancer.  You will be labeled as a necromancer while carrying a corpse or while undead servants follow you around.  Allies, members of the College of Winterhold or Dark Brotherhood, or those with low morality will not treat you any differently. Bartering will also be much more difficult.  High speechcraft skills can negate these effects.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Miscellaneous[/color][/b][/size]\r<br /> \r<br /> \r<br />[size=5][b]Arkay The Enemy[/b][/size]\r<br /> \r<br />[center][size=3][i][font=arial narrow , sans-serif]&#34;His name is Arkay. He was also a man who entered the ranks of the gods. The similarities between his mortal life and my own astonish even me. It is only proper that we should be enemies. Arkay&#39;s Blessing prevents the souls of men, beastmen, and elves from being used without consent. Arkay&#39;s Law prevents those buried with the proper rituals from being raised to serve my children&#39;s will. As you know, my children, Arkay&#39;s Blessing is flexible to those with daring, but Arkay&#39;s Law is unwavering.&#34;[/font][/i][/size] -KW, Arkay The Enemy[/center]\r<br />[center] [/center]\r<br />[center] [/center]\r<br />Arkay is not very fond of Necromancers.  After raising your first minion, you will no longer be able to receive Arkay&#39;s blessing at His shrines.\r<br /> \r<br /> \r<br />[size=5][b]Spells[/b][/size]\r<br /> \r<br />After acquiring your first minion, you&#39;ll get a spell which can teleport all your minions to your location.\r<br />You will also get 3 abilities in which you can order your minions to attack a target, hold their position, or follow you.\r<br />You&#39;ll also get an ability on installing the mod which allows you to get the attributes and spells of dead NPCs or your minions.\r<br /> \r<br /> \r<br />[size=5][b]Corpse Clean Up[/b][/size]\r<br /> \r<br />All corpses and undead should clean up properly.  This means that leveled actors will reset to their location and respawn when the cell resets.  All temporary references created in game will be deleted.  Corpses will automatically be cleaned up after 1 day of death.  The timer will reset if you re-enter the cell of the corpse.  If you want to keep a corpse from being cleaned up, you must be carrying it, have it on the altar or in the salt bath, or alternatively you can store linen wraps in it (after having picked it up/dropped it or created it through my mod).\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Mod Configuration Menu[/color][/b][/size]\r<br /> \r<br />If you use SkyUI (If you don&#39;t have it... get it&#33;), then you can customize the power of all your minions.  There are options to adjust the damage output and damage received for each minion type so you can balance the game as you see fit.  Personally I make my minions take double damage and also slightly decrease their damage output.  There are also options to turn off the automatic health regeneration of the minions (it&#39;s very slow)  as well as an option to use the vanilla soul trap function.\r<br />\r<br />The MCM menu will also show your Necromancy level as well has many tracked stats relating to your work in Necromancy.\r<br />\r<br />Added in control options to hotkey certain abilities.\r<br />\r<br />Finally, there is a built in guide which gives almost everything you need to know about the mod in game.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Installation[/color][/b][/size]\r<br /> \r<br />To install, simply put the .bsa and .esp in your Skyrim/data folder.  As always, back up your save before installing a new mod.  I am not responsible if your game blows up.  All scripts have been optimized to the best of my ability and all created references should clean up properly.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Known Issues[/color][/b][/size]\r<br /> \r<br />Due to much frustration with leveled actors resetting, any non-unique you pick up will be replaced by a clone.\r<br />These clones will no inherit the appear of the original, but the race/sex will be the same.\r<br />Since there is an existing bug which prevents me from dynamically adding perks to actors, I have decided that all regular thralls will have no perks, and mummified thralls will have a combination of perks found in high level NPCs such as bandit bosses, master necromancers, etc.\r<br />\r<br />Unique (Ulfric, Hadvar, etc) mummies have the &#34;grey-face&#34; bug.\r<br />Certian unique thralls/mummies (ex: Astrid) will level up when you do (potentially a good thing for you).  Their skills/attributes will level up, but the extra attribute bonus from mummification will not change.\r<br />\r<br />Skeletons can only wield certain shields.  More specifically: The iron shield (not heavy) and all of the Skyrim hold shields (ex: Stormcloak, whiterun, etc).\r<br />\r<br />Sometimes when placing a corpse on the altar, it may make a death sound or appear in a funny position.\r<br />\r<br />I came across one situation where my minions started fighting each other, although I have not been able to duplicate the result.\r<br />Using recall revenants spell or the Order Hold ability should force them to stop attacking each other.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Incompatibilities [/color][/b][/size]\r<br /> \r<br />Corpse Preparation tries to be as compatible as possible with other mods by making few vanilla edits.  It is not compatible with other mods which alter the soul trap spell or adds new soul trap spells.  It is also incompatible with mods which alter the reanimation staves/scrolls.  Other minor incompatibilities include modifications to the Shrine of Arkay or draugr dialogue.  Corpse Preparation should still function if you load mods later in the load order that change these, but your experience may be different.\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Acknowledgements[/color][/b][/size]\r<br /> \r<br />Batmanna for the Catgut/Scrap metal models\r<br />\r<br />ERH for one of the corruption sounds - https://www.freesound.org/people/ERH/sounds/32899/\r<br />Richard Culver for two of the corruption sounds - https://www.freesound.org/people/RichardCulver/sounds/198914/, https://www.freesound.org/people/RichardCulver/sounds/198925/\r<br />Cosmic Embers for one of the corruption sounds - https://www.freesound.org/people/CosmicEmbers/sounds/160690/\r<br /> \r<br />Shout out to the Skyrim modding community on the official forums and anyone who has ever touched the Creation Kit Wiki, including the people in no particular order: Aenara, Il Ducey, csscottydont, JustinOther, SmkViper, *Mofakin*, and many other who may have helped me work through my problems.\r<br />Fliggerty and Friends for the mod Blasphemous Revenants for Morrowind, an inspiration for this project http://planetelderscrolls.gamespy.com/View.php?view=Mods.Detail&id=4098\r<br /> \r<br /> \r<br />[size=5][b][color=#c00000]Author&#39;s Notes[/color][/b][/size]\r<br />\r<br />Comments and feedback are welcome.  If you find a bug, please report it with as much detail as you can.\r<br />\r<br />Please do not use my work without permission.  I&#39;ve worked way too long on this project, but I hope people will enjoy it.",
  "categoryId": "66",
  "version": "1.3.3",
  "author": "Mojo",
  "createdUnix": "1367190686",
  "updatedUnix": "1407035853",
  "containsAdultContent": false,
  "uploadedBy": "mojo22",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000115514",
      "name": "Corpse_Preparation_V1_3_1",
      "version": "1.3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40957",
      "fileName": "Corpse_Preparation_V1_3_1-35378-1-3-1.zip",
      "uploadedUnix": "1404272772",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/353538f1e2418fb6b20e1779ec168dd39c913ce47166403687a03e0fa862c3a3/analysis/1408157114/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Corpse_Preparation_V1_3_1-35378-1-3-1.zip?fid=1000115514&ttl=1535813882&ri=8192&rs=8192&setec=7c33658b7994b2b69a351b14aa6d24f8"
    },
    {
      "fileId": "1000120365",
      "name": "Corpse_Preparation_V1_3_2",
      "version": "1.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "48681",
      "fileName": "Corpse_Preparation_V1_3_2-35378-1-3-2.zip",
      "uploadedUnix": "1407019372",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/22d30f264f4b5e83a761b62a0491857023edf59726b80780b350e5a52b90d0a7/analysis/1408174150/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Corpse_Preparation_V1_3_2-35378-1-3-2.zip?fid=1000120365&ttl=1535813882&ri=8192&rs=8192&setec=b1c4db6a3229db12c7d1c30fcd7d79a4"
    },
    {
      "fileId": "1000120398",
      "name": "Corpse_Preparation_V1_3_3",
      "version": "1.3.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48681",
      "fileName": "Corpse_Preparation_V1_3_3-35378-1-3-3.zip",
      "uploadedUnix": "1407035853",
      "modVersion": "1.3.3",
      "virusScanUrl": "https://www.virustotal.com/file/43b44b294afb9649034524a3b5f038ffeab1f70d23afa9563d996fd7ba5fc3e9/analysis/1407035901/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Corpse_Preparation_V1_3_3-35378-1-3-3.zip?fid=1000120398&ttl=1535813883&ri=8192&rs=8192&setec=e1ff6d6b4a703392ea34a6c7ac1cad6c"
    }
  ]
}