{
  "modId": 35385.0,
  "modName": "Dovahkiins Hide-a-Way",
  "summary": "A versatile playerhome for the Dragonborn",
  "descriptionHtml": "Version 1.2!!\r\nIf you installed version 1.0 or 1.1, REMOVE ALL YOUR BELONGINGS before installing this version, as I renamed a few chests that were not previously labeled. I am not responsible if you lose your stuff. :)\r\n\r\nThe Dovahkiin\\'s Hide-a-Way is my attempt at building the perfect player home. When I say perfect, I of course mean perfect for me. Hopefully, there are others out there that find it useful as well. \r\n\r\nThe Dovahkiin\\'s Hide-a-Way is located just outside Whiterun. (See map in Screenshot for location). It\\'s located in a shack long abandoned by previous owners. The Hide-a-Way is located completely underground to offer the Dragonborn protection from the outside world. There is a map marker available for fast travel. \r\n\r\nCurrent Features:\r\nHuge armory for weapon, armor and shield storage. \r\nFull crafting area with labeled storage as well as a ton of bulk storage. \r\nMaster Bedroom\r\nStocked kitchen with cooking area\r\nHas a follower who is marriable. Marriagable... You can get hitched!\r\nHas a Blacksmith Vendor who will buy anything and has a decent amount of gold.\r\nThe Dovahkiin\\'s Library - A separate cell apart from the main house to cut down on lag. It has DOZENS of bookshelves for storage, as well as a reading and dining area. \r\nHouse and Library are navmeshed. \r\nDoesn\\'t require any other mods or DLC and is compatible with all current DLC.\r\nShouldn\\'t conflict with any other mods. I\\'m running a few and no problems, but no promises. ;)\r\n\r\nPlanned additions:\r\nAdding a Housecarl or two\r\nAdding a quest or two with custom loot.\r\n\r\nThis is my first mod built from scratch. I\\'ve edited quite a few to suit my liking, but never built one from scratch. I could NOT have done this without the help of several people, but one in particular. Ch0k3h0ld, the author of The Dovahkiin\\'s Warehouse and Bedroom (Found here: http://skyrim.nexusmods.com/mods/10342 )has been so helpful and important to me being able to finish this. Thanks to him, I didn\\'t give up and will continue to try and improve this mod as well as make others as I continue to learn the creation kit. \r\n\r\nA Few notes on the mod: \r\nI know most of the areas are pretty bare. I\\'m still learning to populate areas with clutter and decorations.\r\nI know a few of the rooms are....well...stupidly large and empty (Like the upstairs bedroom. This happened for two reasons. 1. Because I had no sense of scale when I started and 2. It allows for expansion by myself and/or others. \r\nThat being said, If you like parts or all of my mod and wish to use them in your own mod, feel free. Just please give me credit. And I\\'ll of course answer any questions and WELCOME critique on this. I can\\'t improve unless I know what sucks. :)",
  "categoryId": "67",
  "version": "1.2",
  "author": "XxFigmentxX",
  "createdUnix": "1367219421",
  "updatedUnix": "1367533738",
  "containsAdultContent": false,
  "uploadedBy": "XxFigmentxX",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027036",
      "name": "Dovahkiins Hide-a-Way",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "110",
      "fileName": "Dovahkiins Hide-a-Way-35385-1-1.zip",
      "uploadedUnix": "1367221631",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/573a2da32710ffec080840de820c9c966620d7281a6f5190082056cc957f812b/analysis/1407546694/",
      "changelogHtml": " Uploaded version 1.1 as the version I previously uploaded got fouled.... Ending with CTD&#39;s... Sorry for the foul up.... <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovahkiins%20Hide-a-Way-35385-1-1.zip?fid=1000027036&ttl=1535813895&ri=8192&rs=8192&setec=4a2a47d3145dc79223e5fa4150e1118b"
    },
    {
      "fileId": "1000027674",
      "name": "Dovahkiins Hide-a-Way",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "150",
      "fileName": "Dovahkiins Hide-a-Way-35385-1-2.zip",
      "uploadedUnix": "1367533738",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/dabf21deb309d0094780eb57fe73514891c684706d360a960de495aeeddc430f/analysis/1407551637/",
      "changelogHtml": " Redesigned Upstairs, Trophy Room, Alter Room, Kitchen and Dining room. <br/> \n Labeled Doors <br/> \n Added Workbench to Workshop <br/> \n Added a secret room. (Can you find it? :) <br/> \n Added 2 chests to the library for storing scrolls and Letters/papers if you wish. <br/> \n Fixed lighting issue in Library causing a void wall to appear at a distance. <br/> \n Improved Lighting throughout house and library Added a few lighting effects here and there. <br/> \n Added some ambient rumbling to give the feel you&#39;re under ground (Because you are&#33;) <br/> \n Corrected native direction (Previously, you entered facing east, but ended up facing north once inside) <br/> \n Updated the Dovahkiin&#39;s Hide-a-Way book. :) <br/> \n Updated Navmesh...Hopefully it works correctly now.... <br/> \n Add a few silly items here and there, just for kicks. (I&#39;ve always wanted a Hagraven doll) <br/> \n Added grave stones outside to mark past Dovahkiins&#39; final resting places.  <br/> \n building mods, etc. This is where I store Nails, Hinges, or things I craft using Placable Statics Personal Stuff - This is where I store stuff when I&#39;m smelting or doing something else where I don&#39;t want to risk disenchanting or smelting something <br/> \n Labeled a few more chests. Chests are as follows: Inside entry: Stuff to Sell Workshop Above/Near crafting stations: Ingots Ore Hides Alchemy Mats Alchemy Potions Soul Gems Enchanted Items  Along Wall: Gems Jewelry House Stuff - For those who have custom <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovahkiins%20Hide-a-Way-35385-1-2.zip?fid=1000027674&ttl=1535813896&ri=8192&rs=8192&setec=177fd789cec6ca139a0bdebdec2642bd"
    }
  ]
}