{
  "modId": 35382.0,
  "modName": "WereBeasts of Skyrim - Part I - _Sanies Ursinus_ or the Bloodcurse of the Bear",
  "summary": "Adds a Werebear transformation to the game. The Werebear form has no time limit and can be reverted at will, without menus, to preserve the immersion. It also doesn&#39;t replace Werewolves, and is usable while being a Vampire.",
  "descriptionHtml": "VERY IMPORTANT UPDATE, CHECK COMMENTS SECTION BEFORE ANYTHING ELSE.\r<br />\r<br />\r<br />\r<br />First of all I&#39;d like to introduce myself, I&#39;m new to modders&#39; universe (this is my first mod ever), so please be kind with your judgement. \r<br />I&#39;d also like to ask you all to excuse me for my poor English, but it&#39;s not my first language, I&#39;m Italian, so try not to judge my little mod by appearances.\r<br />Anyway, into the mod:\r<br />\r<br />1. INTRODUCTION\r<br />\r<br />Have you ever wondered why Bethesda has spent resources in developing the Werebear form, only to negate the player a way to play as one of them?\r<br />Well, I did. I did not find an answer, but thankfully there was no need to. I just jumped here, on Skyrim Nexus, searching for a mod that allowed me to play as a Werebear. Not because I like them in particular, but because I love the concept of transformation. Lycanthropy, Vampirism, Lichdom, all concepts that I&#39;ve always loved and that I&#39;d like to see in game. However, there are very few mods about Werebears here, and those were not what I really wanted...\r<br />Then we got the Werewolf (apart from Bloodmoon) and the Vampire Lord, and I couldn&#39;t believe it&#33; i bought Skyrim just to play as a Werewolf.\r<br />It was a good experience, however not as good as I imagined, and I&#39;m probably not the only one to think something like this, as there are lots of Werewolf mods out there. Now, after a bunch of years (two? Nearly three?) since the game came out, even the Werewolf form was becoming a bit dull, so I decided to try and create my first mod ever, regarding the only other Werebeast form possible -for now-, the Werebear.\r<br />In the future, if possible, I&#39;d love to implement new forms as well.\r<br />\r<br />2. DESCRIPTION\r<br />\r<br />VIDEO:  http://www.youtube.com/watch?v=bvKgJ2HJZH4\r<br />\r<br />NOTE: Check to the &#34;posts&#34; section for updates and news regarding the mod.\r<br />\r<br />- On Sanies Ursinus: by reading this book you will obtain the power to transform into a Werebear. The book itself is located at the SkyForge, a symbolic place as the Werebear is said to be the Lord of Werebeasts, however this is only a legend. Will you find out if it&#39;s true?\r<br />(The book is on the stone platform near the Iron Helmet and the Iron Shield).\r<br />\r<br />- The Werebear form: as you read the book, you find yourself full of energies. Your inner beast has awakened&#33; However, it is said that when your rage and strength exceed your thirst for blood, when you discover that in the middle of the battle you are not a Berserked, blood-frenzied war machine, but instead a calm yet powerful Warrior capable of maintaining your mind clear, even while fully enraged, your inner Demon takes the form of a Bear. A Werebear doesn&#39;t transform into his Beast Form to quench his thirst for blood, he does it to amplify his already enourmous strength to brutally best his enemies.\r<br />This is why a Werebear can remain transformed for as long as he wants to, and revert into his human form at will. He has total control over his mind and body, he is one with nature.\r<br />\r<br />(To Revert Form, press R -default key- to sheath your claws, then press Z -default shout key- to transform back into your Human form. You can do this as many times as you want, and you can transform as many times per day as you wish. You can&#39;t access to Werewolf perk tree, I&#39;ll explain later why. You can still feed on killed victims, and you should recover health from it. Sadly, for the moment it still adresses you as Werewolf, I&#39;ll change that as soon as possible.)\r<br />\r<br />\r<br />3- UNINSTALLATION\r<br />\r<br />To uninstall the mod, delete the following files from your Skyrim Data folder:\r<br />\r<br />- SaniesUrsius.esp\r<br />- SaniesUrsius.bsa\r<br />- SaniesUrsius.bsl\r<br />\r<br />4. WHAT&#39;S NEXT?\r<br />\r<br />Well, I don&#39;t know. If it was for me, I&#39;d create Quests, Factions, Perks and many other things, but my capacities as a modder are near to zero. I&#39;ll work hard on this mod, because I&#39;m using it for myself too. Actually, I decided to publish it just for the heck of it, maybe someone would have liked it, who knows.\r<br />I&#39;m pretty sure I can create at least:\r<br />\r<br />-Perks: by doubling the Werewolf perk tree, if possible, I&#39;ll try to create a right side entirely dedicated to the Werebear. I think it&#39;s not possible to create an entirely new perk tree, so that is going to be the best I can do. As for now, the plugin DOESN&#39;T require Dawnguard to run, as I wanted to make it accessible to as many person as possible, so that&#39;s why there is no Werewolf Perk Tree.\r<br />\r<br />-Quests: This is going to be hard, but not out of reach I hope. A Quest to retrieve the book, and some other Quests as well.\r<br />\r<br />5. REQUIREMENTS\r<br />\r<br />Skyrim latest patch (1.9.32)\r<br />Dragonborn DLC (Werebears models are in this file)\r<br />\r<br />\r<br />6. IF YOU WANT TO JOIN...\r<br />\r<br />If you are an expert modder who happens to like the idea, ...YOU&#39;RE WELCOME&#33; Since I play my mod too, the better it is, the more I&#39;m happy. \r<br />\r<br />7. BUGS & INCOMPATIBILITIES\r<br />\r<br />Well, I don&#39;t know as of now.\r<br />DO NOT spam transformations and reverts, as you&#39;ll get a little visual bug (the screen blur when you transform into a Werebeast and Revert is repeated once just before completing the transformation. Nothing too big, just avoid to spam them. This is unfixable, although it won&#39;t ever happen if you wait about 10 seconds between transformations. And even if you don&#39;t, it&#39;s a matter of seconds before the effect wears off.)\r<br />\r<br />My testing character was a Vampire Lord, and it worked fine, so I could safely say that you can be a Werebear and a Vampire Lord at the same time. TEST BEFORE SAVING.\r<br />\r<br />8. THANKS\r<br />\r<br />BotOwned, for his help with the first part of the scripts.\r<br />gulogulo, for his support and kindness in helping a noob like me. Try out his mod: Nature of the beast II - werewolf overhaul included --&gt; skyrim.nexusmods.com/mods/20721/ \r<br />Durai, for his patience in trying to understand some of my first scripts.\r<br />RolandSir, from whom I got the idea of the revert form power. Check out his Werewolf Mastery and Werewolf Revert Form mods if you are not into Werebears.\r<br />avpke, for his major beta tester role and extraordinary support.\r<br />\r<br />9. PERMISSION\r<br />\r<br />Use this as you wish, however, you should at least give some credits to me and those who I thanked.",
  "categoryId": "24",
  "version": "1.2",
  "author": "Nattens_Madrigal",
  "createdUnix": "1367198031",
  "updatedUnix": "1368532164",
  "containsAdultContent": false,
  "uploadedBy": "Nattens_Madrigal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027695",
      "name": "WereBeasts of Skyrim - Part I - _Sanies Ursinus_ or the Bloodcurse of the Bear",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17",
      "fileName": "WereBeasts of Skyrim - Part I - _Sanies Ursinus_ or the Blood curse of the Bear-35382-1-0.rar",
      "uploadedUnix": "1367541365",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d6c8a2fb42aa9d001e3f4eeb8b2b99f34664527621daf96a4994ac96453038e8/analysis/1407551883/",
      "changelogHtml": " An entirely standalone Werebear form power, accessible from a book founs near Eorlund-Gray Mane <br/> \n Werewolves untoched, exactly the same as Vanilla&#39;s skyrim. You can change textures and sounds of the Werewolves. <br/> \n Unlimited transformation time if in Werebear Form. Revert form whenever you wish. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WereBeasts%20of%20Skyrim%20-%20Part%20I%20-%20_Sanies%20Ursinus_%20or%20the%20Blood%20curse%20of%20the%20Bear-35382-1-0.rar?fid=1000027695&ttl=1535813890&ri=8192&rs=8192&setec=694f6be4eda5ce86fe28ef2fc7187851"
    },
    {
      "fileId": "1000029816",
      "name": "Sanies Ursinus v1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28",
      "fileName": "Sanies Ursinus v1_2-35382-1-2.rar",
      "uploadedUnix": "1368532164",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/c4ba5632be1919ac2d21a632ca4de6d2e57e5d8437f737f2af607b3690eb6310/analysis/1407569053/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sanies%20Ursinus%20v1_2-35382-1-2.rar?fid=1000029816&ttl=1535813891&ri=8192&rs=8192&setec=5e4cd17e2630e49354231cc9ab0bc7f8"
    }
  ]
}