{
  "modId": 35393.0,
  "modName": "Gnome playable race",
  "summary": "Adds a new race to the game called \\\"Gnome\\\". Like alot of RPG games, The Gnome is the master of the arcane. His \r\nspells are strong and his power as well. \r\n\r\nThe Gnome in Skyrim born with DAUBLE Magicka, and he also reg. it faster than other races. Also, The Gnome born with his own Spells that can be casted only by him (There are 4). \r\n\r\nGnomes a",
  "descriptionHtml": "After a couple of months it has been in the Steam Workshop, I finally upload it to Nexus. This is my biggest race mod project. If you wish, you also can check my other race mod, the Aktos\\'er: http://skyrim.nexusmods.com/mods/27649\r\n\r\nSpanish version available here: http://skyrim.nexusmods.com/mods/35393//?\r\n\r\n\r\nTASK \r\n------------ \r\n[V = Done, X = Not done, IP = In Progress] \r\n\r\n\r\nCreate the race: V \r\nFaces for male: V \r\nFaces for female: V \r\n4 Special spells for gnome: V (4/4) \r\nMake a good FP (first person): V \r\nMake a good TP (third person): V \r\n\r\n\r\nOther Gnome NPC Task: \r\n\r\n-3 followers: 2/3 \r\n-3 Marchants: 0/2 \r\n\r\n-------------------NPCs List: (in progress)------------------------------------------------------------------------------------------------- \r\n\r\n1) A follower awaits you in Whiterun near the priest that screams about Talos. \r\n2) A follower awaits you in Windhelm near the Inn (near the main gate) \r\n\r\n\r\n\r\n\r\nPlease report about any bugs with the race in the comments. \r\n\r\n-------------------------------------------------------------------------------------------------------------------------------------------------- \r\nPLEASE READ: \r\n\r\nThe beggining might be alittle buggy with the Gnome. If it does, use \\\"/showracemenu\\\" [after you press ~, (consule)] and change your race t a diffrent one, and after you enter the Helgen keep become a Gnome with the same code and keep playing. Now, I\\'m NOT sure its buggy, I am checking it right now. Thanks for reading. \r\n-------------------------------------------------------------------------------------------------------------------------------------------------- \r\n\r\nCurrect version: 1.0 \r\n\r\nAdds a new race to the game called \\\"Gnome\\\". Like alot of RPG games, The Gnome is the master of the arcane. His \r\nspells are strong and his power as well. \r\n\r\nThe Gnome in Skyrim born with DAUBLE Magicka, and he also reg. it faster than other races. Also, The Gnome born with his own Spells that can be casted only by him (There are 4). \r\n\r\nGnomes also born with a special gift: They can reg. health while in battle. or at least after they learn how... \r\n\r\nUPDATE 0.2: I fixed a couple things with the Female Gnome, and added a new effect to the fire spell - that allowes you to push your enemies - ONLY when you use Dual-spell it. \r\n\r\nUPDATE 0.3: \r\n\r\n*If you had no shadow -- Now Its fixed. \r\n*Added a hair-style to the male gnome. \r\nUPDATE 0.4: Adds a new spell. Its a spell that actualy use just the FUS RO DAH thing, but as a spell, not a shout. It costs alot of magicka. \r\n\r\nUPDATE 0.5: I posted this update to fix the bug with the Dark Brotherhood quest (when you come to kill the emperor). PLease tell me if it works when you do the quests. \r\n\r\nUPDATE 0.6: Some first-person fixes. Now it should let you see like a Nord on first person (you don\\'t see from the eyes of a gnome, people won\\'t look down for you and you won\\'t have to look up). Please report if it works, If you can. \r\n\r\nUPDATE 0.7: After a month and a half I didnt update the mod (I had a busy month) I back. This update adds a power to the Gnome (like every race got). Soon, I\\'ll also post a first Gnome NPC. \r\n\r\nUPDATE 0.8: A big First Person update. When you use spells you now see all your arm, and not just a part of it. Third/First person gameplay COMPLETE. New Gnome NPCs are coming soon. \r\n\r\nUPDATE 0.9: A new follower was added. He is sitting near that priest in Whiterun that screams about Talos. \r\nKNOWN BUG: His lips are moving but there is no voice. I Hope I\\'ll be able to fix it now. \r\n\r\nUPDATE 0.95: Just a little adding: A Book with a research, Alchemy and Enchanting table were added near the Gnome, kind of a laberatory. The research is about the Falmer, with copied data from the Skyrim Wiki. \r\n\r\nUPDATE 1.0: Fixed the follower voice bug and added a new follower, in Windhelm near the inn (near the main gate). \r\n\r\nUPDATE 1.1: I made him a little taller, but it fixed many issues such as sitting on a chair and etc. Also, I reccomend you to download this: http://skyrim.nexusmods.com/mods/18250 mod if you play with heavy armor in first person, because of an issue with the helmet. I\\'ll try to fix this, but as long as I haven\\'t you should try it out. \r\n-------------------------------------------------------------------------------------------------------------------------------------------------- \r\nThere might be some time bugs with the Vampire Lord. It might take you something like a minute to become a vampire lord and use it\\'s skills. Also, it also might take 15 seconds to become a human/elf/other (xD) back. It might be only in my computer, so it might work well for you. The Werewolf works totaly fine. \r\n\r\n\r\nPLEASE Don\\'t forget to rate it!",
  "categoryId": "34",
  "version": "1.1",
  "author": "MasterFqF",
  "createdUnix": "1367244306",
  "updatedUnix": "1367244149",
  "containsAdultContent": false,
  "uploadedBy": "MasterFqF",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027080",
      "name": " GnomeRace_VERSION_1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27",
      "fileName": " GnomeRace_VERSION_1_1-35393-1-1.rar",
      "uploadedUnix": "1367244149",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1c1d0aed3f693a4d9bcc79721b1cd568b7cff12fa64f3b5afedee6095c06ebcb/analysis/1407547025/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/%20GnomeRace_VERSION_1_1-35393-1-1.rar?fid=1000027080&ttl=1535813910&ri=8192&rs=8192&setec=012961a5d9622c607c27d61a1255be3f"
    }
  ]
}