{
  "modId": 3542.0,
  "modName": "Sabers Swords",
  "summary": "Saber\\'s weapons Calibur and Excalibur",
  "descriptionHtml": "As you might have noticed, I went rouge a couple of months ago. I will continue to do so and will not respond to anything any more. Basically I am done with skyrim mods.\r\n\r\nThere is no need for any requests, everything I uploaded onto this site you are free to use with no restrictions what so ever. I also give permission to all requests made previously that I have no responded. Good luck and have fun.\r\n\r\n[b]By an Ali 213 mod team member, aka hakari.[/b]\r\n[IMG=600,282]http://i.imgur.com/8J3KJ.jpg[/IMG]\r\nVideo: (default textures, Caliburn is now fixed and no longer look glitched.) http://www.youtube.com/watch?v=6JriT8o6aCI&context=C31dc150ADOEgsToPDskKlTKy_ALyoyGJH_TDgIMbP\r\n\r\nFull release 1.0:\r\n-Added realistic textures if you want. They are in the textures folder, copy and replace yourself. Made by Fenixant, adjusted by me.\r\n-Added enchants for Caliburn, Excalibur and Excalibur Morgan. \r\n-Fixed Caliburn\\'s bugged face normals. \r\n-Avalon now takes up no equipment slot. Since you\\'re not Saber you cannot become immortal, but it improves your healing.\r\n\r\nYou can now download the optional mod that will make all 5 swords improvable at the grind wheel, and they will have no enchants on them. Note you still have to download the main file first.\r\nTo obtain the codes for these weapons just type in \\\"help saber 0\\\"\r\n\r\n[img]http://i.imgur.com/cQ5MV.jpg[/img]\r\n====================================\r\nUpdate 2:\r\n-Added Avalon as a necklace, it won\\'t be on your character but the model is there, view it in inventory or drop on the ground\r\n-Excalibur\\'s mesh is fitted with the official drawing\r\n-Excalibur has a lighter gold color. if you like the old one just don\\'t replace that texture.\r\n\r\n======================================\r\n\r\nfull version pre-release:\r\n-Added Excalibur Morgan &#65288;with pulsing glow)\r\n-Added sheath for Caliburn\r\n*Excaliburn Morgan may over glow if your brightness is high or is on those custom shader mods.\r\n*the sheath of Caliburn may react strangely to light, I don\\'t know how to fix it.\r\n\r\nUpdate 1:\r\n-Fixed spelling, Calibur now is spelled Caliburn\r\n-New optimized UV for both weapons, suited for normal mapping and adding details\r\n-Excalibur is now a 2h sword\r\n-Excalibur is completely re-adjusted to the proper proportion according to official references\r\n-Excalibur now has normal mapping\r\n-Excalibur is now smoother with more poly count\r\n-Caliburn now has flatter purple beads instead of spherical ones\r\n-Caliburn now has rounder handle with more poly count\r\n-Fixed a wrong decoration pattern on the Caliburn\r\n\r\nAs for the enchants, I am aware of the issues, I think it\\'s because of the newer versions of the game so I tried to fix them. The update however killed my game now I can\\'t even fast travel so I don\\'t even want to bother, I just removed all enchants.\r\n\r\n\r\nYou know how to use it, presumably, works just like any other mod.\r\n\r\nget it through the console or, you can find it in the world, they are located at the two easter eggs that actually correspond to the legend of King Author. The invisible version is also available through crafting your Excalibur, and you can craft it back in case you don\\'t want to use any console commands.\r\n\r\nSince the tools we have now barely works, the stats on these weapons are far from what I intend them to be. The invisible version also lacks effects which I have yet to figure out how to add considering all the \\\"unknown float\\\" labels in nifskope.\r\n\r\nIf you have major comments, like if you know or would like to work on this thing, you can email me at my username at gmail. If you have regular comments like you want a two handed version put them in comments, I do read all of them.\r\n",
  "categoryId": "55",
  "version": "1.01",
  "author": "1096bimu",
  "createdUnix": "1323765699",
  "updatedUnix": "1327029520",
  "containsAdultContent": false,
  "uploadedBy": "1096bimu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "17010",
      "name": "Sabers Swords full",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12776",
      "fileName": "Sabers Swords full-3542-1.7z",
      "uploadedUnix": "1325810603",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/514311e278caee06297c3c3f83fc88c6dffccfb6b25f109bba46e52e252dcebe/analysis/1406585717/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sabers%20Swords%20full-3542-1.7z?fid=17010&ttl=1535758661&ri=8192&rs=8192&setec=8efe9d1fe0a6fb777bf0e3774140920e"
    },
    {
      "fileId": "21335",
      "name": "Improvable mod",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Improvable mod-3542-1.7z",
      "uploadedUnix": "1327029520",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1036619e231121147d1d1c47c0b65af21927335ecb0f72f32526e923506b1574/analysis/1406624779/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improvable%20mod-3542-1.7z?fid=21335&ttl=1535758662&ri=8192&rs=8192&setec=de7e3ca377902128e9716b90d9f0ab31"
    }
  ]
}