{
  "modId": 35440.0,
  "modName": "Demon Bow",
  "summary": "A re-textured Daedric bow and arrows. Bow AUTOMATICALLY regenerates arrows! ",
  "descriptionHtml": "I\\'ve been into modding for a while, but never cared to upload any of my creations (to the nexus) until now. I don\\'t expect my page to look as pretty as some of the big modders out there, but I can get help on that later. Be warned, I don\\'t know how to do any of the font stuff, so no big letters or underlines. Sorry.\r\n\r\n    The bow itself is not in the game, but must be crafted. I created new ore and ingots for a truly new material. The ore vein can be found outside of High Hrothgar (where you learn whirlwind sprint). There is also a forge, unique smelter and sharpening wheel. The only difference with the smelter is that it turns a single Demon Ore into 20 Demon Ingots. I don\\'t really want to be a jerk and force people to wait for the vein to replenish. \r\n    You can craft the bow anywhere, but I decided to be nice and put everything you need right next to the ore vein. The ingredients are a tad more expansive than a standard bow. You need to have the \\\"Daedric Smithing\\\" perk, a dremora heart, a filled black soul gem, 3 leather strips and 3 Demon Ingots. Not too difficult, but more of a challenge than an iron bow.\r\n\r\n    The Demon Bow brings a brand new capability to Skyrim, regenerating ammo. The weapon is currently identical in stats to the Daedric Bow, but may be upgraded in future updates.\r\n\r\n    Installation is pretty standard. Just extract the contents of the folder to your Skyrim directory. I also included the script used for this mod, you\\'re welcome. Please credit myself and IsharaMeradin if you use anything from this mod.\r\n\r\nIf you have any suggestions or complaints, feel free to comment. I may or may not respond in a timely manner, depends on the level of business at the time.\r\n\r\nUpdate 1:\r\nUnfortunately, the ore vein does not appear to be working at the moment (says that it\\'s depleted). I will be fixing this in the near future, but use the console to get the bow for now.\r\n\r\nUpdate 2:\r\nFORGET IT ALL! Yea, I scrapped most of the mod and simplified it whilst simultaneously expanding it. Now the bow is just an upgrade from the Daedric bow. Just smush a filled black soul gem into it and you\\'re good to go. Also, I decided to go a step further and include a suit of armor. Just like the bow, it\\'s purple. I decided that wasn\\'t quite enough, however, and created a special ring that you can craft at the forge...enjoy. \r\n\r\nAlso, MAKE SURE YOU PUT THE FILES WHERE THEY GO. I know for a fact that I\\'ve included all of the needed texture files this time around, so I shouldn\\'t be hearing about the textures not working anymore.",
  "categoryId": "55",
  "version": "2.0",
  "author": "Reaper 67",
  "createdUnix": "1367330150",
  "updatedUnix": "1369496939",
  "containsAdultContent": false,
  "uploadedBy": "Reaper67",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031391",
      "name": "Main File",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4739",
      "fileName": "Main File-35440-2-0.rar",
      "uploadedUnix": "1369496939",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9a7e50da8af34b10e1bb0e60845e94dfd83801d7a3ce079a00f9205b4f0a284a/analysis/1407581151/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-35440-2-0.rar?fid=1000031391&ttl=1535813977&ri=8192&rs=8192&setec=09bc9356ae7a0835de0a011958ca56d2"
    }
  ]
}