{
  "modId": 35457.0,
  "modName": "The Great Kingdom of Welskykr",
  "summary": "Off the coast of northern Skyrim lies a strange land that should not be in that region. The Land is Ruled by the greatest warrior king in all of Tamriel. And the most feared army in the world.",
  "descriptionHtml": "The island is covered in green grass, along with mountains and lakes. on the east side of the island lies a giant fortress where the Great Dragonborn King rules. To the southwest lies Welskykr Palace, this is the primary residence of the Government of Welskykr. Many people recognize it because of its twin building The Blue Palace in Solitude.\r\n\r\n     The Army of Welskykr is the most feared throughout Tamriel, uttering their name is forbidden. Their numbers are not in the thousands, but mere hundreds, although their skill in battle is unmatched.\r\n\r\nTo the far northwest lies a Dwemer city, although no record of it ever being built has ever been found. It is the most intact of it\\'s kind.\r\nThe land of Welskykr is engaged in a conflict with a faction of rebels. more will be revealed as it gets updated, but for now fell free to test it out for yourself, every update will most likely add more landscape and structures, be warned, i am doing this alone so don\\'t expect quests for a while, once im more familiar with quest scripting i will start making quests, but for now feel free to use the army to reek havoc on Skyrim or any other land masses you may have!.\r\n\r\nI recommend Extensible Follower Framework (EFF) by Expired\r\nhttp://skyrim.nexusmods.com/mods/12933/?\r\n\r\nIt will allow you to recruit multiple soldiers at once. \r\nThough it is not required to run this mod.\r\n\r\nAnd Convenient Horses by Alek\r\nhttp://skyrim.nexusmods.com/mods/14950/? \r\n\r\nThis mod is great for the Knights of Welskykr to rid with you.\r\n \r\nI plan to release the next update within the week. there will be allot of bug fixes along with the gray face bug, i know how annoying that can be.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nDLC Required:\r\n\r\nDawnguard\r\n\r\nHearthfire\r\n\r\nDragonBorn(In the future)",
  "categoryId": "30",
  "version": "1.00",
  "author": "ShakaBrah12397",
  "createdUnix": "1367362923",
  "updatedUnix": "1367362302",
  "containsAdultContent": false,
  "uploadedBy": "Shakabrah12397",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027316",
      "name": "Welskykr Version 1",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1001",
      "fileName": "Welskykr Version 1-35457-1-00.rar",
      "uploadedUnix": "1367362302",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/c95a6c722ea13e5cc7a5fa76029a9cebb2f8fa0ff873daace8125772e9c1eab7/analysis/1407548831/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Welskykr%20Version%201-35457-1-00.rar?fid=1000027316&ttl=1535813999&ri=8192&rs=8192&setec=f542ad01f000609659a6995782140435"
    }
  ]
}