{
  "modId": 35459.0,
  "modName": "Bend Will Enhanced",
  "summary": "Allows you to bend the minds of other as good as Miraak himself. Requires Dragonborn and the latest update.",
  "descriptionHtml": "Dragonborn spoilers below. \r\n\r\nYou know how the entire story of the Dragonborn DLC was set up around how Miraak was a master at controlling minds so people would serve him? And you could only defeat him by using the Bend Will shout against him, right? Although this obviously isn\\'t the spell Miraak used - it only makes a hostile enemy docile for 30 lousy seconds! Talk about weak mind control. That\\'s hardly worth the time for a master manipulator like Miraak, and potentially, you.\r\n\r\nThis is a very simple mod - it makes the Bend Will shout actually worthy of using. Instead of lasting for 30 seconds, this mod turns any person into your ally for 100 in-game days, likely longer than you\\'ll ever see them, after they are shouted at with the second tier Bend Will shout. Turn the tides of battle in an instant by turning your enemies against each other and spare those you do not wish to kill by controlling their very minds. \r\n\r\nThis only works on people - it doesn\\'t change the script with dragons, at least it isn\\'t supposed to. ",
  "categoryId": "75",
  "version": "1",
  "author": "ArchMageMatt",
  "createdUnix": "1367367066",
  "updatedUnix": "1367366511",
  "containsAdultContent": false,
  "uploadedBy": "ArchMageMatt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027327",
      "name": "Bend Will Enhanced",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Bend Will Enhanced-35459-1.zip",
      "uploadedUnix": "1367366511",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6892ecd8e0b7609cfb5c31d7a410db882d332293e82a7110aadbd47fec8a8ee8/analysis/1407548968/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bend%20Will%20Enhanced-35459-1.zip?fid=1000027327&ttl=1535814002&ri=8192&rs=8192&setec=d09b1afa0d4c432a7f1cb234bddf2641"
    }
  ]
}