{
  "modId": 35458.0,
  "modName": "Forsworn Mage Armor by Natterforme",
  "summary": " This is a Nexus Exclusive. Adds a standalone set of mage armor to the game.",
  "descriptionHtml": " Name: Forsworn Mage Armor by Natterforme\r\n Version: 1.0\r\n Date: 4/30/2013\r\n Category: Weapons and Armor\r\n Recommended: Skyrim Mod Manager\r\n Author(s): Natterforme\r\n Source: http://skyrim.nexusmods.com/downloads/file.php?id=17664\r\n\r\n[youtube]oKvHq3VUoiw[/youtube][youtube]i7U_aXe6xpM[/youtube]\r\n  \r\nDescription\r\n ===========\r\n This is a Nexus Exclusive. Adds a standalone set of mage armor to the game.\r\nLocation\r\n ========\r\n All pieces of the set can be crafted at the crafting forge and can be tempered at the proper upgrading areas. The armor is stand alone and will not replace any vanilla armors.\r\n \r\nDetails\r\n =======\r\n \r\n Forsworn Mages can now be found in Forsworn camps. They drop a set of the basic robes and will give random magic drops. They should be properly added to the leveled lists. \r\n \r\n This adds a new set of armor to your game. It adds a cuirass, boots, gloves, a necklace, and 4 types of hoods to the game. The armor set is a combination of forsworn and fur elements and is pretty low to medium level. The armor comes in Non Armor, Light Armor, and Heavy Armor versions. Unlike my previous mods, the pieces will not have the prefixes or endings of LIGHT or HEAVY but will have them integrated into the names of each piece of the gear. The basic items of each piece can be found in the leveled lists and can be crafted at the forge for the proper ingredients. The armor can also be upgraded to a Light or Heavy version if you have the proper ingredients and the required perk. I was going to make the armor of a lower level but I figured that the crafting requirements were too high to make it worth the low stats the set would have had. The hood comes in 4 varieties, with a plain hood, a hood with a fur mask over the mouth, a hood with a troll skull mask, and then the same hood/troll skull combo with the fur mouth covering. The hood uses retextures by Northborn but it does not use his altered meshes. \r\n \r\n The Light and Heavy versions of the armor both require the basic version of the armor, which can be crafted at the forge or found in leveled lists. The Light version requires the Elven Smithing Perk and has stats equivalent to Elven. The Heavy version requires the Dwarven Smithing Perk and has stats equivalent to Dwarven. Both sets require the same set of materials with the basic version of the armor. The only difference is the required perk. You do NOT need the Light version to craft the Heavy version. All versions require the same materials to craft or upgrade.\r\n \r\n You are encouraged to use Cabal120\\'s retexture mods. The screenshots use these retextures. The armor pieces will be affected by any retexture mods that target the forsworn, bandit fur, or college mage equipment. \r\n \r\nInstall\r\n =======\r\nEither throw the folders into your Data directory or use the Nexus Mod Manager to do it for you.\r\n\r\nUninstall\r\n =========\r\n Either use Nexus Mod Manager to remove the files or manually remove them from you Skyrim/Data folder. \r\n\r\nUpgrade\r\n =======\r\n I plan to upgrade and improve this mod over time as I fix bugs, think of new ideas, become more adapted to the CK, and so on. Be sure to check back in once and awhile for updates. Be sure to completely uninstall any previous versions of this mod before upgrading though.\r\n \r\nI will not take responsibility for corrupted save games or lost save games. Get into the habit of backing up your saves to protect your game data. Ignore at your own risk!\r\n\r\nIncompatibility\r\n ===============\r\n This mod should not be incompatable with any other mods to my knowledge. However it is always a possibility so please let me know about it if you experience a conflict.\r\n \r\nKnown Issues or Bugs\r\n ====================\r\n \r\n There are no known issues at this time\r\n \r\n I have never added anything to the leveled list before so if something does not show up properly I will need to know about it^^.\r\n \r\n \r\nHistory\r\n =======\r\n \r\n 4/30/2013- Version 1.0 Released\r\n\r\n \r\nContact\r\n =======\r\n You can find me on the Nexus Forums here as Natterforme.\r\n \r\nCredits\r\n =======\r\n Thanks to Northborn for letting me use his Fur Hoods HD retexture.\r\n Thanks to Cabal120 for his amazing retextures!\r\n Thanks to Bethesda for creating Skyrim.\r\n Thanks to SkyrimNexus.com for the a one-stop-shop resource for authors and players.\r\n Thanks to LHammonds for the Readme Generator this file was based on.\r\n Thanks to all of you who have encouraged me and have supported me since I first put up screenshots of my work back in December 2011 and January 2012.\r\n I thank you all for your patience with me^^.\r\n Thanks to God for creating us all. Amen.\r\n \r\nTools Used\r\n==========\r\n7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r\nBlender - http://www.tesnexus.com/downloads/file.php?id=12248\r\nNIFSkope - http://niftools.sourceforge.net/wiki/NifSkope\r\nOblivion Mod Manager - http://www.tesnexus.com/downloads/file.php?id=2097\r\nPaint.NET - http://www.tesnexus.com/downloads/file.php?id=11909\r\nPhotoshop - http://www.adobe.com/products/photoshop/\r\nReadme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r\n\r\n Licensing/Legal\r\n ===============\r\n This is a Skyrim Nexus Exclusive.\r\n\r\n You MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. I will NOT be providing Steam Workshop support at this time. Neither I nor McMuffin wish to see this mod on the Steam Workshop for the foreseable future.\r\n\r\n I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW! I will not support any version of this mod found on Steam. I will not accept any childish excuse about \\\"sharing\\\" with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r\n\r\n -Natterforme",
  "categoryId": "54",
  "version": "1.0",
  "author": "Natterforme",
  "createdUnix": "1367365382",
  "updatedUnix": "1367429547",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027326",
      "name": "Forsworn Mage Armor Official Release Ver1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18397",
      "fileName": "Forsworn Mage Armor Official Release Ver1_0-35458-1-0.zip",
      "uploadedUnix": "1367365035",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/64d1a189ca66569fed217c0ca7cf319b57d97b1bedeb25b4a0ff12186ca737e5/analysis/1407548902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forsworn%20Mage%20Armor%20Official%20Release%20Ver1_0-35458-1-0.zip?fid=1000027326&ttl=1535814000&ri=8192&rs=8192&setec=0654d0aebddd9b2d16e0f8f24d0a9c8c"
    },
    {
      "fileId": "1000027456",
      "name": "Forsworn Mage Armor Official Release Ver 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18397",
      "fileName": "Forsworn Mage Armor Official Release Ver 1_0-35458-1-0.zip",
      "uploadedUnix": "1367429547",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/558ca3237018c4fc32428c8c9f1334624b4c44cfcf2608100ce6f16780061a2a/analysis/1407549974/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forsworn%20Mage%20Armor%20Official%20Release%20Ver%201_0-35458-1-0.zip?fid=1000027456&ttl=1535814001&ri=8192&rs=8192&setec=36daacff01d54ad4fe691b017f7c00db"
    }
  ]
}