{
  "modId": 35470.0,
  "modName": "Moonlight Tales - Werewolf and Werebear Overhaul",
  "summary": "This mod aims at making being a werewolf a much more immersive, atmospheric and fun experience. Features include lunar transformations, unique skin system, playable werebear, werewolf / werebear followers and NPCs, hunter NPCs, infection and diseases, new cure alternative, music, sound effects and more.",
  "descriptionHtml": "[center][img]http://www.spwned.net/pics/moonlight_tales/logo.png[/img][/center]\r<br />\r<br />[center][youtube]qvfqm1PnH-E[/youtube]\r<br />Thanks to [url=http://www.youtube.com/user/Brodual]Brodual Skyrim Mod Spotlight[/url] for the video.[/center]\r<br />\r<br />[size=5][b][i]Introduction[/i][/b][/size]\r<br />Werewolves have always been a great addition to the adventures of every Dragonborn in the world of Skyrim. However, there was still a lot of elements that could have been improved. This mod aims at making being a werewolf a much more immersive, atmospheric and fun experience. It offers some new and interesting content with a considerable amount of customization, allowing you to choose what you would like to see (and hear) in your game and thus create your own story. Welcome to Moonlight Tales.\r<br /> \r<br /> \r<br />[center][size=6][b]Mod features[/b][/size][/center]\r<br /> \r<br /> \r<br />[size=5][b][i]Werebeast Skin System[/i][/b][/size]\r<br />Moonlight Tales provides a wide selection of the best werewolf skin and eye textures from the greatest Skyrim modders, granting you access to over 200 unique werebeast models. This innovative system allows you to immediately modify your werewolf or werebear appearance by simply accessing the MCM menu and choosing the desired texture.\r<br />\r<br />[center][img]http://www.spwned.net/pics/moonlight_tales/unique.png[/img][/center]\r<br />[center][img]http://www.spwned.net/pics/moonlight_tales/models.gif[/img][/center]\r<br />[center][img]http://www.spwned.net/pics/moonlight_tales/furs.png[/img][/center]\r<br />[center][img]http://www.spwned.net/pics/moonlight_tales/eyes.png[/img][/center]\r<br /> \r<br />[size=5][b][i]Playable Werebears[/i][/b][/size]\r<br />Werebears introduced in the Dragonborn DLC are now finally available for you as a playable race. Their Brotherhood Howl has also been modified appropriately to summon bear/ snow bear/ werebear spirits. You can become a werebear by contracting the Sanies Ursius disease from wild werebears, or by drinking a Werebear Blood Potion or by using the MCM Debug Menu.\r<br />\r<br />[center][img]http://www.spwned.net/pics/moonlight_tales/werebear.png[/img][/center]\r<br /> \r<br />[size=5][b][i]Beastblood Unleashed[/i][/b][/size]\r<br />Werewolves of Skyrim are powerful beings and yet, it seems strange that by default they can only transform once a day. Obtaining the Ring of Hircine grants additional transformations but it is not very comfortable having to equip it and select its spell every time. In Moonlight Tales, Beast Form is no longer a once-a-day spell. After returning to your human form, the power gets a cooldown of 60 seconds after which it can be used again. The cooldown rate can be customized in the MCM.\r<br /> \r<br />[size=5][b][i]Ring of Hircine[/i][/b][/size]\r<br />As far as the ring itself is concerned, its purpose and power have also been modified. Originally, one of the game characters was looking for this magical ring in order to restrain his beast side as the artifact was said to allow werewolves &#34;control their transformation&#34;. However, I don&#39;t think that allowing you to transform more often exactly fits that description... With Moonlight Tales, once the Ring of Hircine is obtained, it will truly allow you to control the beast within you by unlocking different transformation-related settings in the MCM. Additionally, if you are not a werewolf, the ring will allow you to transform into one once a day. If you&#39;re a vampire, this will effectively allow you to become a vampire-werewolf hybrid. Also, it is no longer necessary to equip the ring for its power to appear. Having it in your possession is enough.\r<br /> \r<br />[size=5][b][i]Lunar Transformations[/i][/b][/size]\r<br />Skyrim offers picturesque views of the night sky and is faithful to details such as moon phases. Unfortunately they have never been fully utilized in the vanilla game, which is a shame especially if you’re a werewolf. In Moonlight Tales, your life as a werewolf or werebear is deeply bound to the stages of the moon. If you have the Ring of Hircine, both the transformation chance for each phase and even the approximate time of the metamorphosis can be customized in the MCM. Those of you who know the [i]Tales of Lycantrophy[/i] mod will surely remember screen messages, warning the player about the imminent transformation. Those screen notifications were replaced by a less subtle but more interesting type of warning. I am not going to spoil this feature for you so you will have to discover it yourself.\r<br /> \r<br />[size=5][b][i]Sharing the Beastblood[/i][/b][/size]\r<br />Werebeasts are now able to truly spread their lycanthropic gift. By attacking NPCs there is a chance of infecting them with Sanies Lupinus (werewolf virus) or Sanies Ursius (werebear virus) disease. The infection itself is indicated by a subtle glow around the attacked character. Either of the diseases takes three days to fully develop, after which the NPC becomes a werebeast capable of spreading the virus. Of course the same rules apply to your character. Also, the NPCs turned by the player will share the skin he/she had the moment the transmission occurred. An alternative method is using Werewolf and Werebear Blood Potions found on some werebeast corpses. Note that essential and protected NPCs are immune to the disease. It is highly recommended that you don&#39;t simply wait through the days of the disease and, instead, fully experience the time your inner animal awakens as the night falls and the hunter&#39;s moon rises.\r<br />[i]Player to NPC[/i], [i]NPC to Player[/i] and [i]NPC to NPC[/i] infections can all be set in the MCM Menu.\r<br /> \r<br />[size=5][b][i]Curing the Beastblood[/i][/b][/size]\r<br />The blood of the beast is a powerful blessing, but there may still come a time when you want to part with it. The cure in question can be found on some werebeast NPCs in the form of a Werewolf or Werebear Heart. As with every cure it has to be consumed, however, there is a catch. You have to travel to Glemoril Coven, the site of the last remaining Shrine of Hircine and perform a ritual there. Remember, however, that your beast side may not give up that easily so I highly recommend saving your game before eating the heart in case the cure doesn&#39;t work the first time. Another (but far less spectacular) way to be cured is by using the MCM Debug Menu.\r<br /> \r<br />[size=5][b][i]Werebeast Followers[/i][/b][/size]\r<br />Despite the fact that most of the known werebeast clans have been wiped out, you can still find companionship on your journeys by turning your followers into hunters of your kind. Followers that are not protected can be infected by attacking them in your beast form. If you have a Werewolf or Werebear Blood potion in your inventory, then there will be a dialogue option in which you can ask the follower to drink it. Similarly, if you would like to cure your followers, you need to obtain a Werebeast Heart, travel together to Glenmoril Coven and ask your companion to eat the heart. Other dialogue options that you get are based on transformation behavior. You can ask your follower:\r<br />[list][*]to transform whenever you do[/*]\r<br />[*]to transform by themselves in combat[/*]\r<br />[*]not to transform for now[/*]\r<br />[/list]\r<br />In case you want to modify your current Follower&#39;s werebeast skin, it can be achieved by means of the &#34;Reset your skin&#34; dialogue option, which will switch follower&#39;s beast skin to the one currently used by the player.\r<br /> \r<br />[size=5][b][i]Werebeast Events[/i][/b][/size]\r<br />It is now possible to encounter more wild werewolves, as well as werebears all around Skyrim and Solstheim. If you share their blood they will be non-hostile to you. In other words, if you are a werewolf, other werewolves will not attack you. Instead, they will wander and explore the world around them. Similarly to the player character, NPC Beast Form will also last for a limited amount of time, after which they will revert to their human self and get a cooldown. They level with the player and are also capable of performing knockbacks, using howls to summon allies and cannot be scared away with the Howl of Fear. They are also dynamically spawned with random skin textures chosen from the ones available in the new Skin System. Please note that werewolves and werebears are enemies and will thus attack each other. In order to avoid cluttering game memory, NPC werebeasts will be removed from the game once they roam too far from the player. Frequency of the events, minimum required level, knockback protection etc. can all be changed in the MCM.\r<br /> \r<br />[size=5][b][i]Hunter Events[/i][/b][/size]\r<br />Since Skyrim is now a far more dangerous place, it is possible for the werebeast player to be tracked by experienced armed hunters of various skills and races. Those elite hunters from factions like Silver Hand and Vigilants of Stendarr will level with the player and are immune to the effects of Howl of Fear. Frequency of Hunter events, minimum required level etc. can all be changed in the MCM.\r<br />\r<br />[center][img]http://www.spwned.net/pics/moonlight_tales/hunters.png[/img][/center]\r<br /> \r<br />[size=5][b][i]Music[/i][/b][/size]\r<br />Personally that&#39;s my favourite part of this mod. Depending on whether you are a newly-infected human or a full-fledged werebeast, you will experience different flavours of equally atmospheric music featuring:\r<br /> \r<br />[list][*][b]McAsmod Music[/b] - 8 classic songs from [i]McAsmod&#39;s Werewolves Morrowind[/i] mod playing in random selection when the player roams the land in Beast Form. Ideal theme for a moonlight stroll or an intense hunt.[/*]\r<br />[/list]\r<br /> \r<br />[list][*][b]Full Moon Music[/b] - amazing music theme from INTERNATIONALvids YouTube channel that plays when the player is affected by either Sanies Lupinus or Sanies Ursius disease. It allows you to experience your new power growing within you as your mind becomes one with the surrounding nature.[/*]\r<br />[/list]\r<br />All of the above songs can be turned on and off in the MCM.\r<br />\r<br />[size=5][b][i]Installation[/i][/b][/size]\r<br />1. Download with Nexus Mod Manager.\r<br />2. Install with Nexus Mod Manager.\r<br />3. Play.\r<br />\r<br />[size=5][b][i]Installation over the Previous Versions of Moonlight Tales[/i][/b][/size]\r<br />No special steps required.\r<br />\r<br />[size=5][b][i]Installation over Tales of Lycanthropy[/i][/b][/size]\r<br />1. Uninstall Tales of Lycanthropy.\r<br />2. Launch Skyrim and load your save. Click yes on the pop up that complains for the missing mod.\r<br />3. Save your game. The important factor here is that it should not have ToL any more.\r<br />4. Exit the game and install Moonlight Tales.\r<br />5. Load the save that was created without ToL.\r<br />\r<br />[size=5][b][i]Recommended Mods to use with Moonlight Tales[/i][/b][/size]\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/60804][b][i]HD Werewolves[/i][/b][/url]\r<br />Don&#39;t miss this outstanding package of HD textures created by KrittaKitty&#33;\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/13779/][b][i]Heart of the Beast[/i][/b][/url]\r<br />The fur and eye textures are included in Moonlight Tales, but not the sound files. I suggest the &#39;Alpha werewolf sounds&#39; file.\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/22274][b][i]Predator Vision[/i][/b][/url]\r<br />It&#39;s a great heat and night vision mod for werewolves and vampires.\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/58038/][b][i]Real Feeding[/i][/b][/url]\r<br />Upon eating corpses, the bodies are replaced with blood, gore and assorted bones.\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/44091/][b][i]A Matter of Time[/i][/b][/url]\r<br />Displays the current moon phase, among many other useful features.\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/25392][b][i]Werewolf Mastery[/i][/b][/url]\r<br />A great overhaul that includes many options to customize your experience. Read the section bellow for instructions. Works only with MT 2.05&#33;\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/57859/][b][i]Skyrim - Enhanced Camera[/i][/b][/url]\r<br />Allows you to play from first person view in werewolf form.\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/56980/][b][i]VioLens - A Killmove Mod[/i][/b][/url]\r<br />A killmove mod that has several great settings for werewolves.\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/15524/][b][i]Amazing Follower Tweaks[/i][/b][/url]\r<br />A follower mod that allows you to have werewolf and vampire lord followers.\r<br />\r<br />[b]Recommended Perk Mods[/b] (Install only one of them at a time.)\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/22134/][b][i]Werewolf Perks Expanded[/i][/b][/url]\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/22611/][b][i]Bloodmoon Rising[/i][/b][/url]\r<br />\r<br />[b]Feature Expansion[/b]\r<br />This mod adds extra features to Moonlight Tales like: loosing control (AI Werewolf), dropping items upon transformations, Ring of Hircine rune system.\r<br /> &bull; [url=http://www.nexusmods.com/skyrim/mods/62138/][b][i]Moonlight Tales Enhanched[/i][/b][/url]\r<br />\r<br />[size=5][b][i]Moonlight Tales 2.05 + Werewolf Mastery is compatible&#33;[/i][/b][/size]\r<br />Read the appropriate section in the description for installation instructions. Thanks to RolandSir for his help and support.\r<br />\r<br />[size=5][b][i]MT + WM Installation Guide[/i][/b][/size]\r<br />Step 1: Download and install the file &#39;Moonlight Tales Main 2_05&#39; on this mod page via Nexus Mod Manager.\r<br />Step 2: Visit: [url=http://skyrim.nexusmods.com/mods/25392/]Werewolf Mastery by RolandSir[/url]\r<br />Step 3: Download and install the file &#39;Werewolf_Mastery_v3_0_and_Moonlight_Tales_v2_05_Compatibility_version&#39; via Nexus Mod Manager.\r<br />Step 4: Click yes on all overwrite attempts.\r<br />Step 5: Inside the Nexus Mod Manager make sure that my ESP file is not loaded&#33;\r<br />This is important because the two mods are now merged into WerewolfMastery.esp&#33; This is how it should look like in the Manager:\r<br />[img]http://www.spwned.net/pics/moonlight_tales/werewolfmasterycomp.png[/img]\r<br />Step 6: You are now done, enjoy and consider endorsing both mods if you appreciate our project.\r<br />\r<br />[size=5][b][i]Legend of Cain - The Machinima Werewolf Series[/i][/b][/size]\r<br />A fellow werewolf modder Ns Jones created this epic video series. I recommend it to everyone&#33;\r<br />\r<br />Site on Nexus: [url=http://www.nexusmods.com/skyrim/mods/24073/]Legend of Cain[/url]\r<br />Ns Jones on Youtube: [url=http://www.youtube.com/user/Nenadjones2]Link[/url]\r<br />\r<br />[size=5][b]Credits[/b][/size]\r<br />[i]Brevi[/i] - main author, technical support, Howling model; wild ideas and the ability to execute them :)\r<br />[i]Al99[/i] - co-author, tester, creator of this description\r<br />[i]Maryen, Redwes[/i] - testers\r<br />[i]MadCat221[/i] - La Femme Lycana, female werewolf model\r<br />[i]TheOutlander[/i] - unique eye texture models that allowed for odd and blind eyes\r<br />[i]NsJones[/i] - immersive werewolf skins and glowing eye textures\r<br />[i]Bellyache/ wrig675 - [/i]realistic werewolf skin textures\r<br />[i]Jeremy Hamilton/ artifex0[/i] - natural werewolf skin textures\r<br />[i]Foxcraft7[/i] - more wolf-like werewolf skins\r<br />[i]TheLys, Intelligentsia - [/i]atmospheric music from [i]McAsmod&#39;s Werewolves Morrowind[/i] mod\r<br />[i]INTERNATIONALvids - [/i]YouTube team composing the bone-chilling [i]Full Moon [/i]music theme\r<br />[i]Korodic -[/i] Werewolf Aftermath Re-Equipper\r<br />[i]KrittaKitty[/i] - Alternate Eye Pack textures\r<br />\r<br />\r<br />[size=5][b]Translations[/b][/size]\r<br />English localization - AI99 & Brevi.\r<br />Spanish localization - criswolf09. Download at: [url=http://skyrim.nexusmods.com/mods/36143]nexusmods.com/mods/36143[/url]\r<br />Italian localization - Lucasssvt. Download at: [url=http://skyrim.nexusmods.com/mods/36285]nexusmods.com/mods/36285[/url]\r<br />\r<br />[b]Special Thanks[/b]\r<br />To our wives and fiances for bearing with such weirdos. :)",
  "categoryId": "79",
  "version": "2.33",
  "author": "Brevi and Al99",
  "createdUnix": "1367392330",
  "updatedUnix": "1410011586",
  "containsAdultContent": false,
  "uploadedBy": "spwned",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030811",
      "name": "Moonlight Tales Main 2_05",
      "version": "2.05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "117350",
      "fileName": "Moonlight Tales Main 2_05-35470-2-05.zip",
      "uploadedUnix": "1369145981",
      "modVersion": "2.05",
      "virusScanUrl": "https://www.virustotal.com/file/12768def39ed25f3c29ed95a9f47710a620f9794c1fa81d061d4a613c4e29924/analysis/1407576973/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moonlight%20Tales%20Main%202_05-35470-2-05.zip?fid=1000030811&ttl=1535814017&ri=8192&rs=8192&setec=91bcb6d6a0f51c218759ecbac20d1b9d"
    },
    {
      "fileId": "1000099933",
      "name": "Moonlight Tales Source Code 2_05",
      "version": "2.05",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "65",
      "fileName": "Moonlight Tales Source Code 2_05-35470-2-05.zip",
      "uploadedUnix": "1394028809",
      "modVersion": "2.05",
      "virusScanUrl": "https://www.virustotal.com/file/d9c428d1863b4a5d219c2d8d2233549440e1764ae8facddc0a3d8821e65db339/analysis/1407961206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moonlight%20Tales%20Source%20Code%202_05-35470-2-05.zip?fid=1000099933&ttl=1535814018&ri=8192&rs=8192&setec=d40697359fb128e242e5bde3c36946fc"
    },
    {
      "fileId": "1000124902",
      "name": "Moonlight Tales Version 2_33",
      "version": "2.33",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "97374",
      "fileName": "Moonlight Tales Version 2_33-35470-2-33.zip",
      "uploadedUnix": "1409598046",
      "modVersion": "2.33",
      "virusScanUrl": "https://www.virustotal.com/file/d602f40070c3a834a98270e8dc8c410b1d39109ef2900a00f9eac5f16eaa723c/analysis/1409598156/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moonlight%20Tales%20Version%202_33-35470-2-33.zip?fid=1000124902&ttl=1535814018&ri=8192&rs=8192&setec=ed6bf60ed2caa7f96fd06e3004cd8deb"
    },
    {
      "fileId": "1000124903",
      "name": "Moonlight Tales Source Code 2_33",
      "version": "2.33",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "68",
      "fileName": "Moonlight Tales Source Code 2_32-35470-2-33.zip",
      "uploadedUnix": "1409598114",
      "modVersion": "2.33",
      "virusScanUrl": "https://www.virustotal.com/file/3ae90fa23a76d97f20b1a52c2ce186dd562673aeca6790b7955bdb5fca005a2c/analysis/1409598184/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moonlight%20Tales%20Source%20Code%202_32-35470-2-33.zip?fid=1000124903&ttl=1535814019&ri=8192&rs=8192&setec=b61ca1b54412c198be540e94134caed8"
    },
    {
      "fileId": "1000125405",
      "name": "KrittaKitty Eye Pack Version 2_33",
      "version": "2.33",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "213",
      "fileName": "KrittaKitty Eye Pack-35470-2-33.zip",
      "uploadedUnix": "1409911751",
      "modVersion": "2.33",
      "virusScanUrl": "https://www.virustotal.com/file/3eccf5be9189a8004f5c1de214b1ca435f165f6dece14779ccd067319f200076/analysis/1409911863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KrittaKitty%20Eye%20Pack-35470-2-33.zip?fid=1000125405&ttl=1535814019&ri=8192&rs=8192&setec=4271ac63d2d1ba533558722e8b4094b0"
    },
    {
      "fileId": "1000125582",
      "name": "KrittaKitty Eye Pack Version 2_05",
      "version": "2.05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "210",
      "fileName": "KrittaKitty Eye Pack Version 2_05-35470-2-05.zip",
      "uploadedUnix": "1410011586",
      "modVersion": "2.05",
      "virusScanUrl": "https://www.virustotal.com/file/8ce6d869518477649589015fe882824cfd1867b0e77629fb9d92e3b50fbcc160/analysis/1410011703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KrittaKitty%20Eye%20Pack%20Version%202_05-35470-2-05.zip?fid=1000125582&ttl=1535814020&ri=8192&rs=8192&setec=fe9b16ac3e1d8f08703b138602a5c5f5"
    }
  ]
}