{
  "modId": 35472.0,
  "modName": "Gatti 05 Annelotte ReTexture Silver Knight Armor",
  "summary": "This is a simple Silver & Black recolor of Gatti2012&#39;s - Annelotte armor, and Messiasmummo&#39;s - Royal Retexture of gatti2012&#39;s armor which added more texture detail.",
  "descriptionHtml": "--Description--\r<br />So this is my first armor mod, just a simple recolor into Silver and Black, it can be found under Steel at ANY forge.  Still learning how to make stand-alone armors&#33;  (Any tips are welcome in comments)\r<br />\r<br />\r<br />--Requirements--\r<br />This Armor was originally created for CBBEv3body, (but will also work with UNP as shown in my pics), if used on vanilla you will have a skin discoloration (grey body--you have been warned&#33;).\r<br />You will need the original mod by Gatti2012:\r<br />http://skyrim.nexusmods.com/mods/14065/\r<br />Works with just about every version of Skyrim.  From 1.3 to 1.9.32\r<br />\r<br />\r<br />--INSTALLATION NMM & MANUAL--\r<br />1.)  Download & Install the original mod Gatti05 Annelotte, from the link provided above  (If you skip this step, the meshes will be missing and the armor will not display properly, or at all&#33;)\r<br />2.)  Download my main file, Hopefully if you are running NexusModManager it will install properly--If it doesn&#39;t work PLEASE let me know. Or just refer to alternate step2 and manually install it.  \r<br />- Manual Install - Just extract the files into your Skyrim/Data/ folder.  Again, let me know if you have any issues.\r<br />3.)  Run game, go to any forge, craft, improve, enchant, enjoy, comment and endorse =)\r<br />\r<br />(Don&#39;t forget to ENDORSE this mod if you downloaded and are still using this armor =)  AND show us your love, POST YOUR SCREENSHOTS~&#33;) \r<br />\r<br /> \r<br />--How To Use This Mod In Game--\r<br />Found under STEEL at any forge.  You will need your Smithing at lv50 and have ADVANCED ARMORS PERK unlocked, and of course you will need the necessary materials, steel ingots, etc to create it. \r<br />Other than that, no major requirements are needed.  \r<br />This mod HAS been tested by myself, as well as by two friends on the latest version 1.9.32.0.8 (with all DLCs active), as well as version 1.3.10 (with none of the DLCs).  So should be no issues at all.\r<br />\r<br />\r<br />--Credits and Thanks--\r<br />I need to thank gatti2012 for making this armor, and messiasmummo for retexturing it&#33; (both whom have given permission to modify this)  I take no credit other than just recoloring this to mine and my friend&#39;s liking (you know who you are XD&#33;).\r<br />\r<br />\r<br />--Mods Used In My Pics--\r<br />UNPDimonized - skyrim.nexusmods.com/mods/6709/\r<br />Angels in Skyrim - skyrim.nexusmods.com/mods/11240/\r<br />ApachiiSkyHair - skyrim.nexusmods.com/mods/10168/\r<br />Eye of Beauty - skyrim.nexusmods.com/mods/13722/\r<br />RealLikeENB - skyrim.nexusmods.com/mods/22056/\r<br />SG Female Textures Renewal - skyrim.nexusmods.com/mods/35267/\r<br />zzjay and Grace Darklings Hoods with hairs - skyrim.nexusmods.com/mods/28147/\r<br />Cloaks of Skyrim - skyrim.nexusmods.com/mods/12092/\r<br />\r<br />\r<br />Please leave a comment with any questions and I will try to get back to you asap",
  "categoryId": "54",
  "version": "1.0",
  "author": "Binmaru",
  "createdUnix": "1367396165",
  "updatedUnix": "1368821532",
  "containsAdultContent": false,
  "uploadedBy": "Binmaru",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030292",
      "name": "Main File",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1406",
      "fileName": "Main File-35472-1-01.7z",
      "uploadedUnix": "1368821532",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/fafdc9430ab475299647a018a1972245f5948f721db7cbc11deb213e72cddbe8/analysis/1407572771/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-35472-1-01.7z?fid=1000030292&ttl=1535814023&ri=8192&rs=8192&setec=30482b9c94d84dc1ca6db28ebcbc3e05"
    }
  ]
}