{
  "modId": 35498.0,
  "modName": "Book Covers Skyrim Compatibility Patch USKP-Better Sorting-Better Skill and Quest Book Names-Even Better Quest Objectives",
  "summary": "Embodies the changes made by USKP, Headbomb\\'s Better Sorting, Better Skill and Quest Book Names and Even Better Quest Objectives to the Book Covers of Skyrim mod. Requires Books of Skyrim!",
  "descriptionHtml": "This mod serves as a compatibility patch between the Unofficial Skyrim Patch, the CLEANED version of Headbomb\\'s Better Sorting - books, Better Skill and Quest Book Names, and Even Better Quest Objectives.\r\n\r\nOnly Books of Skyrim is explicitly required - however, I highly recommend that you use the other mods, ESPECIALLY USKP. It shouldn\\'t break your game if you don\\'t use them, but USKP in particular fixes many bugs with vanilla Skyrim, so go use it!\r\n\r\nThis mod should be the last one that deals with books in your load order. It should REPLACE the books of Skyrim ESP, so don\\'t use both esps! Specifically, this mod requires only the BSA archive from that mod. \r\n\r\nInstallation: Install books of Skyrim and any of the other mods. Then drag and drop this into your skyrim directory, overwriting if prompted - or if using NMM, install it, but DO NOT select the overwrite option, since I think that will remove the BSA that this relies on.\r\n\r\nYes, if you are using a translation, or a foreign language version, your text may end up in English. No, I don\\'t plan on making this compatible with anything else at this time unless I\\'ve got a good reason. I made this for myself and figured it would be useful to others - feel free to use this in any way you like.",
  "categoryId": "84",
  "version": "1.0",
  "author": "SleeperService",
  "createdUnix": "1367438053",
  "updatedUnix": "1367438038",
  "containsAdultContent": false,
  "uploadedBy": "LordBishek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027476",
      "name": "Books of Skyrim USKP-BS-BSaQBn-EBQO compatible",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "872",
      "fileName": "Books of Skyrim USKP-BS-BSaQBn-EBQO compatible-35498-1-0.rar",
      "uploadedUnix": "1367438038",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f29c62c7da946c66d7ec0607a27f3a483d96b29368ba132c55d6419ea4d32a49/analysis/1407550156/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Books%20of%20Skyrim%20USKP-BS-BSaQBn-EBQO%20compatible-35498-1-0.rar?fid=1000027476&ttl=1535814063&ri=8192&rs=8192&setec=88b1f911023874926a6c5f5a469c88eb"
    }
  ]
}