{
  "modId": 35520.0,
  "modName": "ApachiiSkyHair Wigs plus Tutorial",
  "summary": "Various wigs using ApachiiSkyHair.  All wigs come in four colors.  There are six styles of stand-alone wigs, another style modified to fit the Nordic Carved helm, and the same style modified again for the Iron helm.  They use Hein84&#39;s retextures whenever possible.",
  "descriptionHtml": "[b]**Please note that evenstargw has created [url=http://www.nexusmods.com/skyrim/mods/43673/?]a mod that is far superior[/url].  I recommend using it instead of this mod.**[/b]\r<br />\r<br />[b][color=#b58f5d]Description[/color][/b]\r<br />\r<br />This adds craftable wigs of [url=http://skyrim.nexusmods.com/mods/10168/]ApachiiSkyHair[/url]-styles.  Six of them are unedited, stand-alone wigs that are not meant for use with helms.  Another style was re-shaped to fit under the Nordic Carved helm, and another wig of the same style was re-shaped for the vanilla Iron helm.\r<br />\r<br />I used Hein84&#39;s [url=http://skyrim.nexusmods.com/mods/35092/]ApachiiSkyHair natural Retexture[/url] whenever possible and adjusted them for four versions: black, blonde, brunette, and white.  They&#39;re craftable at any forge under Jewelry.  The helm wigs are named so they&#39;ll show up next to the armor set in your inventory, ie: &#34;Nordic Carved Wig (Color)&#34;.  I also made them enchantable so they can be renamed.\r<br />\r<br />I&#39;ve tried to make these as passive and non-intrusive as possible.  Only the waterbreathing enchantment is allowed (just so they can be renamed, I think it&#39;s the most non-intrusive enchantment available), no ingredients are required to craft them, and the value and weight are as low as possible.\r<br />\r<br />The two helm wigs were altered for these specific helms, so they&#39;ll probably clip if used with other helms or hoods.  Also, the helm wigs are not intended for characters using long, vanilla hairstyles (see &#39;Known Issues&#39; below).  Rather, they&#39;re intended for characters using modded hairstyles as they go bald when a helm is equipped (see my second screenshot above).\r<br />\r<br />Please post any questions, issues, requests, etc.\r<br />\r<br />\r<br />[b][color=#b58f5d]Requirements[/color][/b]\r<br />\r<br />Technically none.  This doesn&#39;t require the Dragonborn DLC, but one wig was made specifically for the Nordic Carved helm which is only available from that DLC.  It can still be used without the DLC, but it would look weird without the helm.\r<br />\r<br />\r<br />[b][color=#b58f5d]Known Issues[/color][/b]\r<br />\r<br />~Vanilla hairstyles with long hair still show the long hair portion with the helm wigs, causing clipping, and the color of your hair and wig probably won&#39;t match.  This is because the long portion uses a separate slot from the normal hair slot, and this additional long hair slot (41) isn&#39;t being overridden by the wigs (modded hairstyles don&#39;t use this slot so it&#39;s not an issue).  I&#39;ve tried using or just including the long hair slot 41, and changing priorities, but no luck yet.  Searching for a fix and will update if I figure it out.\r<br />\r<br />\r<br />[b][color=#b58f5d]Installing/Uninstalling[/color][/b]\r<br />\r<br />NMM download is available, while manual installation is as usual.  Unzip the files and move them to your Data directory, which is typically found at:\r<br />\r<br />C:Program FilesSteamsteamappscommonSkyrimData\r<br />\r<br />Then run the normal Skyrim launcher from Steam and click &#34;Data Files&#34;.  In the list, make sure this mod gets activated with a checkmark (it should get a checkmark automatically when you run the launcher, just take a look to be sure).  The load order should not matter.  Please note that the .esp is called &#34;Nordic Carved Helm Wigs&#34;. This was its original name, and I re-named it on Nexus when the stand-alone wigs were added. I chose not to re-name the .esp so people who already downloaded it wouldn&#39;t have to reinstall to get updates. Just FYI, it is the full mod.\r<br />\r<br />I considered uploading this to BOSS, but I&#39;m not sure it&#39;s worth it since it&#39;s such a basic mod that only adds new items.  Pretty sure this means it&#39;s impossible for it to conflict with any other mod.  I scanned it with TES5Edit just for the record and it&#39;s clean.\r<br />\r<br />\r<br />[b][color=#b58f5d]Recommendations[/color][/b]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/4862/]Categorized Favorites Menu[/url] by favmenumodder.  Overall an excellent highly customizable mod, and one feature that compliments these wigs particularly well is the equipment set shortcut.  Ctrl 1-0 shortcuts let you equip any combination of gear, customizable via .cfg text files, and you can always add more shortcuts that can be manually clicked in your new expanded favorites menu.  Add these wigs to equipment sets and you&#39;ll never have to manually equip them again, making them even less intrusive.  :-)\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/29624/]Race Menu[/url] by expired6978.  My wigs provide a quick and easy way to change hairstyles or to pass them out to NPCs, but of course they are limited and were only designed for quick convenience.  For full customization, I highly recommend the Race Menu mod.  It seems that many additional character mods are being created to be compatible with the Race Menu mod as well.\r<br />\r<br />\r<br />[b][color=#b58f5d]Change-Log[/color][/b]\r<br />\r<br />[Update to 1.5]\r<br />\r<br />Thanks to Mookeylama for finding a fix for transparency issues&#33;  All stand-alone wigs have been updated to fix this.  If anyone still notices transparency, please let me know.\r<br />\r<br />Also updated the mesh of one wig (long, blonde) that still had textures pointing to Apachii&#39;s mod, which meant if you didn&#39;t have her mod installed, the texture wouldn&#39;t show.\r<br />\r<br />_______________________________\r<br />\r<br />[Update to 1.4]\r<br />\r<br />All wigs are now available in white, and also fixed an issue causing two of the Iron helm wigs for females to be invisible.\r<br />\r<br />_______________________________\r<br />\r<br />[Update to 1.3]\r<br />\r<br />Six styles for stand-alone wigs have been added (see third screenshot above).  To update, just overwrite all files.\r<br />\r<br />_______________________________\r<br />\r<br />[Update to 1.2]\r<br />\r<br />Wigs to fit the Iron helm have been added, named &#34;Iron Helm Wig (Color)&#34;.\r<br />\r<br />_______________________________\r<br />\r<br />[Update to 1.1]\r<br />\r<br />Support for male characters added (I thought the mesh would need editing but it doesn&#39;t appear to, so it was an easy fix).  If you&#39;re updating from 1.0, just overwrite the .esp file.\r<br />\r<br />\r<br />[b][color=#b58f5d]Permissions[/color][/b]\r<br />\r<br />I received permission from [url=http://skyrim.nexusmods.com/users/283148]apachii[/url] and [url=http://skyrim.nexusmods.com/users/3212020]Hein84[/url] to release modified versions of their resources.  If you&#39;d like to release a revised version of this mod, get permission from them for their meshes/retextures.  You don&#39;t need permission from me, I only ask that you don&#39;t upload it anywhere but here on the Nexus.\r<br />\r<br />\r<br />[b][color=#b58f5d]Credits[/color][/b]\r<br />\r<br />~Bethesda, big fan since Daggerfall  &lt;3\r<br />~apachii for the excellent [url=http://skyrim.nexusmods.com/mods/10168/]ApachiiSkyHair[/url] mod\r<br />~Hein84 for the excellent [url=http://skyrim.nexusmods.com/mods/35092/]Retextures[/url]\r<br />~Those who have commented with feedback and ideas, especially Mookeylama&#33;\r<br />\r<br />\r<br />[b][color=#b58f5d]Thanks&#33;[/color][/b]\r<br />\r<br />~CaBaL120 for the excellent [url=http://skyrim.nexusmods.com/mods/34996/]aMidianBorn Nordic Carved[/url] retextures seen in my screenshots\r<br />~Nexus and its community  :)\r<br />\r<br />\r<br />_________________________________________________________________________________\r<br />\r<br />[b][color=#b58f5d]Modder&#39;s Guide[/color][/b]\r<br />\r<br />Here&#39;s a tutorial of the steps I used to make these.  This doesn&#39;t include edits to the meshes I made to the helm wigs so they&#39;d fit without clipping.  Please leave a comment if you have any questions.\r<br />\r<br />\r<br />PART 1 - NIFSKOPE\r<br />\r<br />Nifskope is open-source 3rd party software written to edit .nif files, the file-format Bethesda uses for 3D models in their recent games.  If you don&#39;t have it yet, download the latest version here:  http://niftools.sourceforge.net/wiki/NifSkope\r<br />\r<br />Hairstyles will commonly come in two mesh files - the original and a &#34;hairline&#34; copy.  For example, &#34;hair20.nif&#34; and a corresponding &#34;hairline20.nif&#34;.  In this first step, we&#39;re going to paste these two meshes together to resolve transparency issues.  Open both .nifs and in the hairline mesh, right-click on the &#34;NiTriShape&#34; node, then under &#34;Block&#34;, copy the branch (or just highlight and ctrl-C).\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/35520-1-1371536361.jpg[/img]\r<br />\r<br />\r<br />Alt-tab to the original mesh and paste the branch into the root &#34;NiNode&#34;.\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/35520-1-1371536631.jpg[/img]\r<br />\r<br />\r<br />You&#39;re done with the hairline mesh so you can close it.  Your original hair mesh should now look like this.  I&#39;ve expanded the &#34;NiTriShape&#34; nodes of both branches so you can see the &#34;BSLightingShaderProperty&#34; nodes for each.  To change hair-color, you can edit the hair tint line found in the block details below, and/or create edited textures (see the next step).  Note that you can open the color-wheel or click the actual hex color-code to enter the three 3-digit color values manually (useful if you want the exact same color every time).\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/35520-1-1371537378.jpg[/img]\r<br />\r<br />\r<br />Now I&#39;ve expanded the &#34;BSLighingShaderProperty&#34; node to reveal the &#34;BSShaderTextureSet&#34; node.  Notice the paths to the textures in the block details window below.  If you want to customize the textures, you&#39;ll need to change these paths to your new textures (double-click the path to edit).\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/35520-1-1371537972.jpg[/img]\r<br />\r<br />\r<br />Remember that we&#39;re working with two &#34;NiTriShapes&#34; of the same style (the original and the one we pasted in from the hairline mesh), so any changes you make need to be applied to both.\r<br />\r<br />Highlight the &#34;BSDismemberSkinInstance&#34; node.  Expand the &#34;Partitions&#34; line in the block details and you&#39;ll see the &#34;Body Part&#34; line.  This determines which slot is used, and must match what&#39;s used in the ArmorAddon in the CK or your item will be invisible when worn.  For the stand-alone wigs, I use the default slot for hair (seen in the screenshot, SBP_131_HAIR, which is just called 31 in the CK), which will replace the character&#39;s hair when worn.  So if you&#39;re making a normal wig like those, no changes should be needed here.  For the helm wigs, I used slot 60 since the character&#39;s hair (slot 31) is hidden while wearing a helm.  Note that slot 60 is a miscellaneous slot, so it might be used by other items added by other mods, meaning you could only wear one at a time unless you manually change to a different slot.\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/35520-1-1371536033.jpg[/img]\r<br />\r<br />\r<br />Of course a number of additional changes can be made to the mesh here in Nifskope, but for now this is all you&#39;ll need to add a basic wig.  &#34;Save as&#34; a new filename, and preferably save it in a new directory under your name in ...datameshes, or throw it in my Dupre232 mesh directory if you like.\r<br />\r<br />\r<br />PART 2 - CK\r<br />\r<br />Start a new mod or just work with mine, &#34;Nordic Carved Wigs.esp&#34;.  Go to the &#34;Armor&#34; category and right-click --&gt; duplicate something simple like a vanilla circlet, or if you&#39;re editing my mod, duplicate one of my wigs.  Double-click this duplicate to edit and change the ID to anything as long as there&#39;s no spaces (I usually start the ID with &#34;01&#34; so it shows up at the top of every list).  Change the name field below to be what you want the wig called in-game.  Below, I make the value 1, the weight 0.01, and make sure armor is 0.  For now, click OK and a warning will pop up asking if you want to make a new form.  Click no, it&#39;ll ask if you&#39;re sure, click yes.  Open it back up again and make sure &#34;Default Race&#34; appears in the drop-down menu at the top, then highlight / un-highlight slots until only 31 and 41 are selected (or whichever slot you used in your mesh).\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/35520-1-1371526748.jpg[/img]\r<br />\r<br />\r<br />If you&#39;re working with my mod, you&#39;ll notice my wigs use a keyword called &#34;Dupre232Wig&#34;.  This links to their enchantment info so that only the waterbreathing enchantment is possible.  I also removed the &#34;ClothingCirclet&#34; and &#34;JewelryExpensive&#34; keywords.  These changes are all optional.\r<br />\r<br />Double-click the ArmorAddon listed in the box near the bottom (in the above screenshot, it&#39;s Circlet02AA).  Enter a new ID (I usually go with the same ID as the item itself, with &#34;AA&#34; added to the end).  Click OK and you&#39;ll get the same warning, but this time click Yes to create a new AA form.  Back in the Armor window, the original AA will still be there.  Right-click and delete it, then right-click again to add the new AA you just created.  Now open this AA and highlight / unhighlight to get the same slots you used, making sure &#34;Default Race&#34; is selected above.\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/35520-1-1371527375.jpg[/img]\r<br />\r<br />\r<br />On the left side of this ArmorAddon window, you&#39;ll see a section for male and female data.  Under whichever gender your wig is intended for (or both), click &#34;Select&#34; next to &#34;Biped Model&#34;, then in the window that pops up, click &#34;Edit&#34; and browse to your wig&#39;s mesh.\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/35520-1-1371527913.jpg[/img]\r<br />\r<br />\r<br />To make it craftable, go to the &#34;Constructable Object&#34; section and create a recipe, or duplicate a simple one like the silver necklace.  Enter a unique ID for the recipe, select your wig in the &#34;Created Object&#34; field, choose your workbench and any ingredients (I deleted all ingredients).\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/35520-1-1371530048.jpg[/img]",
  "categoryId": "26",
  "version": "1.5",
  "author": "Dupre232",
  "createdUnix": "1367553629",
  "updatedUnix": "1371542193",
  "containsAdultContent": false,
  "uploadedBy": "Dupre232",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031059",
      "name": "OLD ApachiiSkyHair Wigs",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30259",
      "fileName": "ApachiiSkyHair Wigs-35520-1-4.7z",
      "uploadedUnix": "1369292789",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/82e9b5539b780896b000cf5318b5c155cc0f9359462067de8d58e900b2e5b850/analysis/1407578550/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ApachiiSkyHair%20Wigs-35520-1-4.7z?fid=1000031059&ttl=1535814100&ri=8192&rs=8192&setec=a20b63b4435d879a615272cb235ce574"
    },
    {
      "fileId": "1000034754",
      "name": "ApachiiSkyHair Wigs",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30278",
      "fileName": "ApachiiSkyHair Wigs-35520-1-5.7z",
      "uploadedUnix": "1371542193",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/6ae23991405550e8abe871a0bb00be96fce593de346a7ec149b95b436ae86dd3/analysis/1407608125/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ApachiiSkyHair%20Wigs-35520-1-5.7z?fid=1000034754&ttl=1535814100&ri=8192&rs=8192&setec=d51a7137a416bfe2965d48d6cdd00668"
    }
  ]
}