{
  "modId": 35537.0,
  "modName": "CBM - Survival of the Fittest (gameplay overhaul)",
  "summary": "- Hunger, thirst and sleep needs (plus many more).\r<br />- Game-changing combat effects (PC and NPC).\r<br />- A follower management tool.\r<br />- Weapons/armor have durability and break.\r<br />- Integrated dynamic primary stats system.\r<br />- Toggle options for your customizing needs.\r<br />- Plus much more&#33;",
  "descriptionHtml": "[size=4][i][color=#f1c232][u]\r<br />[img width=895,height=353]http://media.edge-online.com/wp-content/uploads/edgeonline/oldfiles/articles/reviews/dawnguard.jpg[/img]\r<br />\r<br />STATUS:[/u][/color][/i][/size]\r<br /> \r<br />Receiving updates.\r<br />\r<br />[color=#f1c232]\r<br />[size=4][i][u]COMPATIBILITY:[/u][/i][/size][/color]\r<br />\r<br />The changes made by this mod may not be compatible with any other mods that alter any of the following base data entries or values. The unofficial fixes that alter the same data entries have been integrated into this mod.\r<br />\r<br />  * Perk Trees\r<br />  * Game settings.\r<br />  * Default movement settings.\r<br />* Containers (vendors only)\r<br />* Potions (food included)\r<br />  * Misc Items\r<br />  * Spell Tomes\r<br />  * Shouts (player only)\r<br />  * Spells (player only)\r<br />  * Leveled Item Lists (vendors only)\r<br />\r<br />\r<br />[size=4][i][color=#f1c232][u]CONTENT GUIDE:[/u][/color][/i][/size]\r<br />\r<br />1. Introduction\r<br />2. Mod Details\r<br />3. Planned Updates\r<br />4. Install/Uninstall\r<br />5. Bugs/Fixes\r<br />6. Q&A\r<br />7. Best Comments Wall\r<br />8. Other Recommended Mods\r<br />9. SOTF Help Guide\r<br />\r<br />\r<br />[size=5][b][color=#f1c232][u][INTRODUCTION][/u][/color][/b][/size]\r<br />\r<br />Welcome, it is my pleasure to introduce my mod &#34;Survival of the Fittest&#34; (SOTF). Like most other gamers who enjoy this game I feel that their is always something more that can be added to a game like one such as Elder Scrolls V: Skyrim. So after playing for a while and finally learning about the release of the Creation Kit I decided to make a mod which would overhaul the entire game creating a whole new experience. Unlike most others however I consider myself not to be a true TES fan because I never played Morrowind (I don&#39;t plan to), I never enjoyed playing Oblivion and I&#39;m not really interested in the upcoming MMO (haters try not to hate me too much please), however I do very much enjoy Skyrim or else I never would have bothered creating a mod that functions on such a massive scale. Even though I am a huge Fallout fan which is one of the main reasons this mod adds many features that are also recognizable as features from the Fallout series the content in my mod was created from the ground up and I could only do my best to get as close to my goal as possible using the tools I have. My goal was simply to create a mod which brought the idea of &#34;hardcore survival&#34; to Skyrim like what was included with Fallout NV but only if it fitted with TES and its fantasy based theme. I am proud to say that I am satisfied with how my mod turned out and further updates will be released to greater enhance its features and gameplay. I hope that all who participate in using this mod will enjoy it as much as I do and help to improve it even further.\r<br />\r<br />\r<br />[color=#f1c232][size=5][b][u][MOD DETAILS][/u][/b][/size][/color]\r<br />\r<br />- Here are the fine details on what my mod changes about the game :D\r<br />\r<br />[u][size=4]Item Renaming System[/size][/u]\r<br />\r<br />- One of the most noticeable flaws about Skyrim (and many of Bethesda&#39;s games unfortunately) is the sloppy unpolished UI and menus (and Skyrim is no exception by far). Due to this huge flaw I have introduced a dynamic item renaming system so that as items are discovered for the first time they will be renamed. For example most weapon items have &#34;APRL/WEP&#34; in front of the name so that they become easier to track and equip especially during combat when you have to switch around quickly using the favorites menu. Also many perks which involved crafting many items, weapons and armor items that did not have required keywords attached to them have been fixed (this fixes many problems to do with smithing) and many unique items that could not be crafted before are now able to be crafted. In addition all quest related items now have a weight value of 0 (usually displayed in-game regardless) because nobody wants to spend 30 minutes or more going through a very difficult dungeon only to discover that the required quest item weighs heavier than a armor plated dragon and cannot be carried.\r<br />\r<br />[size=4][u]SOTF Config & Settings[/u][/size]\r<br />\r<br />- SOTF adds many new features to Skyrim, but players will disagree with some changes which is why &#34;Config/Settings&#34; can be activated from the SOTF menu which will allow you to toggle on/off many of these features. Most features when disabled are simply frozen and no longer have any effect or impact (meaning its best to disable any mod features you dislike as soon as the mod is active in-game, the reason for this design is to prevent exploitation). Below is a list of what can be changed:\r<br />\r<br />* Needs (hunger, thirst, sleep etc)\r<br />\r<br />* Limbs Damage (disabling limbs damage will prevent your character from taking any limb damage whatsoever and disable the feature entirely).\r<br />\r<br />* Integrity Scarring (debuffs such as bleeding will no longer affect the PC if this option is disabled).\r<br />\r<br />* Eating/drinking animations (eating and drinking animations is exactly what it sounds like, whenever you eat food or drink beverages you will see the PC perform an animation depending on the type of food consumed. This option allows you to disable these animations).\r<br />\r<br />* Arrow/Ice missiles removed from PC (arrow and ice missiles very often can &#34;attach&#34; to the PC, this allows you to choose whether they will remain for a duration of time (couple of game hours or so) or be removed every 10 seconds).\r<br />\r<br />* Breakable Items (breakable items refers to weapons and armor being able to &#34;break&#34;, please refer to the &#34;Weapons & Armor Durability&#34; section further below. Disabling this option prevents items from ever breaking).\r<br />\r<br />* Hardcore Mode (introduces more challenging gameplay including disabling fast-travel unless your have the &#34;Camping Supplies&#34; item in your inventory and preventing you from equipping armor items while in combat).\r<br />\r<br />[u][size=4]Need Stats[/size][/u]\r<br />\r<br />- Their are now need stats that must be satisfied in order to avoid the side effects no matter how minor or extreme they may be. If you played Fallout New Vegas and enjoyed hardcore mode (having to keep hunger, thirst and sleep in check) then this is definitely for you. The need stats are as realistic as possible but that does not mean it will take 3 weeks or so in-game for your character to starve to death, due to this being just a game (and for the sake of immersion and fun) it will take far less time for each stat to have a negative effect if at all. Each need stat effect scales with your current level so that they are noticeable, these stats are able to be checked on by you at any time by selecting &#34;Stats/Values&#34; found in the SOTF main menu. The included need stats are as follows:\r<br />\r<br />* Satiation (hunger): This stat is a measure of how satiated your char is and how &#34;hungry&#34; they are based on calorie intake. Only by consuming solid foods can this stat be satisfied and prevent starvation. Cooked food is much more nutritional than most raw foods and often provides buffs, also most raw foods have a high chance to cause food poisoning when consumed. You must be cautious however as carrying too much food around with you will cause it to slowly deteriorate over time and be removed. Failing to satisfy this stat over time will result in physical weakness and eventually death. This need stat does NOT apply if your char is a vampire. Also your char is immune to food poisoning if they are a werewolf (if vampires eat any food at all they immediately become poisoned). By default it takes approximately 4 days for this need stat to reach 0. \r<br />\r<br />* Hydration (thirst): This stat is a measure of how hydrated your char is and how much water is currently in they&#39;re system. Only by drinking beverages or any clean liquid substance can this stat be satisfied and prevent dehydration. Sprinting and/or engaging in combat will also cause the Hydration stat to fall slightly faster. Failing to satisfy this stat over time will result in physical weakness and eventually death. This need stat does NOT apply if your char is a vampire (you have to use the hardcoded vampire thirst system instead). By default it takes approximately 3 days for this need stat to reach 0.\r<br />\r<br />* Energy (sleep): This stat is a measure of how much energy your char currently has. Only by sleeping can this stat be satisfied and prevent your character from passing out. Failing to satisfy this stat over time will result in your char becoming weaker (magicka and stamina reduced). Their are also drinks and some rare foods which satisfy the energy stat by a small margin. Engaging in combat will also cause the Energy stat to fall slightly faster. If your char is a vampire this stat decays faster during the day but slower during the night. While sleeping most need stats will decrease as usual. By default it takes approximately 2 days for this need stat to reach 0.\r<br />\r<br />* Bladder: This stat is a measure of your char&#39;s current bladder strength. This stat can only be satisfied in specific locations (outside cities and inside homes etc). Failing to satisfy this stat over time will result in your char losing concentration, some stamina and eventually soiling themself (which resets the bladder stat but unfortunately leaves your char with a fully depleted hygiene stat and negative effects). The rate at which this stat decreases depends on what you eat and drink and how often but by default it takes just over 1 day.\r<br />\r<br />* Social: This stat is a measure of your char&#39;s current sanity and how much he/she has been conversing with other races. Only by socially interacting with other beings can this stat be satisfied (you do this by talking to any actor/creature then choosing the &#34;Social Interaction&#34; option). Failing to satisfy this stat over time will result in your char feeling lonely and depressed. By default it takes approximately 7 days for this need stat to reach 0. You are able to build a &#34;relationship&#34; with an NPC by socializing with them regularly.\r<br />\r<br />* Stimulation: This stat is a measure of your char&#39;s current adrenal and caffeine levels. Unlike other need stats stimulation only increases during combat or other intense situations and will steadily decrease while out of combat. The higher the stimulation level stat the more positive effects it will have on your char (such as increased weapon speed). Many passive spells also depend on the stimulation stat before they can activate. This stat increases much faster while in combat if your char is a werewolf. Stimulation does not need to be satisfied over time and has very few side effects.\r<br />\r<br />* Hygiene (cleanliness): This stat is a measure of your char&#39;s current cleanliness. Only by bathing in a river or taking a shower can this stat be satisfied. Being injured in combat or too close to bleeding foes can also cause this stat to fall rapidly. Failing to satisfy this stat over time will result in your char becoming unclean and more vulnerable to poisons and diseases. By default it takes approximately 5 days for this stat to reach 0.\r<br />\r<br />* Temperature: This stat is a measure of your char&#39;s current temperature. Unlike other stats this stat cannot be affected by you directly but more by your actions and where you currently are in the world. If you are inside any building this stat will very slowly increase but if you are outside in the wilderness it will slowly decrease (temperature will also increase/decrease very rapidly depending on the current weather). By standing near fireplaces, campfires and other sources of heat your char&#39;s temperature will increase rapidly. Your char&#39;s armor (exposure) has the greatest effect on how rapidly your char&#39;s temperature decreases, for example if your char is wearing only Fur armor they&#39;re temperature will decrease very slowly, however while wearing Ebony armor they&#39;re temperature will decrease very rapidly. Being too hot or too cold has varied effects on your char and being one or the other for too long can cause pneumonia or heatsation to occur. It is also possible to pass out from being too cold or too hot and to actually die from these effects. Vampires are immune to pneumonia and werewolves are immune to heatsation.\r<br />\r<br />* Morale (mood): This need stat is a measure of your char&#39;s current morale rating and mood. Morale is affected by many variables, for example taking a shower will increase morale a great deal, consuming treats (sweet rolls nom nom nom) or alcohol will also have a huge positive effect on morale. Being in combat for too long however will have a severe negative effect on morale. This stat returns to 0 over time which is its neutral value (no debuffs or buffs while neutral).\r<br />\r<br />* Alcohol: This stat is a measure of your char&#39;s current alcohol level and will increase as they consume alcoholic beverages. Alcoholic drinks also allow your char to blow off steam (no not literally lol), decrease fatigue and increase morale. Consuming too much alcohol will impair your char&#39;s vision, further consumption will result in staggering and eventually passing out completely. Its always fun to have a good ol&#39; boozer but over doing it can have disastrous consequences.\r<br />\r<br />* Potions: All potions that restore stat values (health, magicka and stamina) will now restore an amount equal to the PC&#39;s maximum HP, MP and SP, for example weak healing potions will instantly restore 10% of maximum health while greater stamina potions will instantly restore 60% of maximum stamina (this means that all restoration type potions will forever remain useful to the player regardless of the PC&#39;s level). Most items of this type now have negative effects to prevent them from being used as a safety net, this effect is called potion toxicity. The more potions consumed the higher the toxicity level reducing your health, magicka and/or stamina regeneration rate. The regenerative stat that is degraded depends on the type of potion consumed (for example a health potion will never decrease your char&#39;s health regen but will always decrease magicka regen while a magicka potion will never decrease your char&#39;s magicka regen but will always decrease health regen). All potion toxicity levels slowly decrease over time.\r<br />\r<br />* Fitness: Their are many types of food in the game which now contain different calories, those that contain fat will cause your char to gain weight and become unhealthy while foods that contain protein will keep your char physically fit. It is now important to maintain a healthy diet or else your char&#39;s stats and overall effectiveness will degrade. Different food types will have varying effects, for example apple pie will decrease your fitness far more than a sweet roll but will dramatically improve your mood. This stat means you cannot just simply digest any food on the go and must maintain a healthy diet to remain at peak efficiency. You can slowly increase fitness by staying active in-game (running and/or sprinting long distances).\r<br />\r<br />HINT: Stay on a healthy diet of vegetables and water with the occasional chop of meat and your will char will remain very healthy with lots of protein and normal/moderately low fat.\r<br />\r<br />* Fatigue: Traveling around on foot most of the time can take its toll on the body physically and cause exhaustion. Moving at a steady pace wont damage your fatigue too much but sprinting great distances all the time will increase your fatigue rapidly. The same applies to casting too many spells and draining your magicka too often which will also cause your char to fatigue and starve much more quickly. You can recover from fatigue by sleeping or just by sitting down for a minute to rest if it isn&#39;t to severe (fatigue will never increase while you are traveling by horseback). Your equipped weapons and armor are mainly what affect your fatigue, for example steel plate armor will cause fatigue to increase much faster than light elven armor.\r<br />\r<br />[size=4][u]SPECIAL[/u][/size]\r<br />\r<br />- Their is now a SPECIAL system which brings back primary stats but in a different way, the change included with this mod is more similar to Fallout than previous TES games because I feel that the SPECIAL system is much more effective and far more enjoyable. Some vanilla perks were altered due to the effects these stats have on your char. You are able to choose what your SPECIAL stats are at the beginning of the game by spending 10 SPECIAL tokens, the default value for all SPECIAL stats is 5 which can be increased and decreased at your leisure. You can manage your SPECIAL abilities from the SOTF main menu and for a sum of 3000 gold you may reset your SPECIAL stats at any time. All SPECIAL stats have 10 ranks max (with rank 10 being the most effective) and are as follows:\r<br />\r<br />* Strength: With each rank of the Strength perk the amount of damage inflicted with all melee weapons increases and you are able to carry more items. Also all weapons excluding bound weapons now require that you have a minimum strength rank in order to wield them effectively.\r<br />\r<br />* Perception: With each rank of the Perception perk your eyesight improves allowing you to cause more damage with ranged weapons and find more gold in containers. It is also rumored that this stat has another special use.\r<br />\r<br />* Endurance: With each rank of the Endurance perk you regenerate health faster and take less damage from both physical and magical attacks. Your mental fatigue also increases slower from enemy attacks.\r<br />\r<br />* Charisma: With each rank of the Charisma perk your speech skill improves, your persuasion chance increases and the cooldown of your shouts is slightly reduced.\r<br />\r<br />* Intelligence: With each rank of the Intelligence perk you become smarter increasing your magicka regen and your skill in the conjuration, restoration and destruction spell schools by a small amount.\r<br />\r<br />* Agility: With each rank of the Agility perk your stamina regen and sneak skill improves and your movement speed increases slightly.\r<br />\r<br />* Luck: With each rank of the Luck perk all non-combat and non-magic based skills improve slightly and the chances of finding treasure and artifacts in chests increases. A higher Luck stat also prevents mishaps from occurring such as tripping over at random or having some of your gold stolen while you sleep.\r<br />\r<br />[size=4][u]Weapons & Armor Durability[/u][/size]\r<br />\r<br />- Durability for weapons and armor has been brought into Skyrim (it was a mistake for Bethesda to remove it completely and I have worked endlessly to make it function in-game). Durability works similar to how it did in previous TES games but with a few twists. When you strike an enemy with any weapon (torches, staffs and misc weapons not included) the weapon gets worn down causing the durability value (the maximum durability value is 100%) to decrease, should the durability value for any item type reach 0% then the char&#39;s equipped item identical to that item type will break completely. Armor only takes durability damage whenever the PC is hit by a physical attack. Below is a list of the item types:\r<br />\r<br />* Right Weapon (all weapons that can be equipped in the right hand).\r<br />\r<br />* Left Weapon/Shield (all weapons that can be equipped in the left hand including shields).\r<br />\r<br />* Armor: Head (head-worn items such as circlets).\r<br />\r<br />* Armor: Body.\r<br />\r<br />* Armor: Hands.\r<br />\r<br />* Armor: Feet.\r<br />\r<br />- The durability values for each item type can be increased using light and heavy repair kits which can be purchased at vendors. The current durability damage level of each item type can be checked on by you at any time by selecting &#34;Durability&#34; found in the SOTF main menu. Not all weapon and armor items are capable of breaking. Weapon and armor items do NOT have their own health therefore it does not matter if you switch weapons or armor around the durability damage levels will remain the same, I refer to this system as &#34;Actionic Durability Damage&#34; since its all about keeping you in the action and letting you make important tactical choices instead of forcing you to worry about maintaining a large number of items that you most likely won&#39;t ever use or just sell anyway.\r<br />\r<br />[size=4][u]Limbs & Crippling[/u][/size]\r<br />\r<br />- It is now possible for your char to become crippled after taking too many hits from enemy attacks. A damaged limb leaves no side-effects, however a crippled limb can leave your char extremely weakened and unfit for combat. Each limb has its own health and all non-crippled limbs can be healed using restoration spells and/or &#34;Heal Extremity&#34; potions which can be purchased at most alchemy type vendors. \r<br />\r<br />* HINT: It is rumored that a spell exists somewhere in the world that can teach the caster to effectively heal non-crippled limbs.\r<br />\r<br />- Both spells and potions however cannot heal crippled limbs, special items are required in order to heal crippled limbs which are bandages, arm casts and leg braces which can be purchased at most vendors and sometimes looted. Crippled limbs once restored take quite some time to fully mend, the amount of time it takes depends on your choices, you can either use healing items to quickly restore limbs to full health (which can be very expensive) or rest in any bed to heal all limbs over time (which takes time but not your gold). Also while your char&#39;s perception or either arm is crippled it is impossible to use any crafting station. The current health of each limb can be checked on by selecting &#34;Check Limb Health&#34; found in the SOTF main menu. The limbs are typically as follows:\r<br />\r<br />* Head: The limb that has the least chance of being hit. Should this limb become crippled your vision will be impaired and your char dazed, it will also be near-impossible to craft any item.\r<br />\r<br />* Torso: The limb that has the highest chance of being hit. Should this limb become crippled the PC&#39;s max carry weight, max stamina, sneak skill and armor effectiveness will be drastically reduced.\r<br />\r<br />* Right Arm: This limb has a small chance of being hit, also every time this limb takes damage their is a very minor chance that the PC will be disarmed but this can only happen while the PC&#39;s stamina is lower than 10%. Should this limb become crippled the PC&#39;s max carry weight will be reduced by a small amount, the PC&#39;s pickpocket skill by a great amount and the PC will no longer be able to wield one-handed weapons with that crippled arm or two-handed weapons at all.\r<br />\r<br />* Left Arm: See just above.\r<br />\r<br />* Right Leg: This limb has a moderate chance of being hit. Should this limb become crippled the PC&#39;s max carry weight and stamina will be reduced by a moderate amount, also the PC&#39;s movement speed will be reduced more for each leg that is crippled.\r<br />\r<br />* Left Leg: See just above.\r<br />\r<br />HINT: Going into combat while limbs are recovering from having been crippled is a very bad idea as weakened limbs that have not fully healed have a chance to be damaged and become crippled once again.\r<br />\r<br />[size=4][u]Physical Integrity[/u][/size]\r<br />\r<br />- During combat the PC will now have a moderate chance to suffer side effects depending on the type of weapons the enemy is wielding whether it be conventional weapons or spells. Even though it is now possible to suffer side-effects in combat from taking hits these same effects can also be healed or even reversed completely by using special items that can be purchased from vendors or crafted by yourself using materials and components. The effects are as follows:\r<br />\r<br />* External Wounds: This is when permanent damage is inflicted to skin tissue or outer muscle tissue which causes blood loss. This applies to all blade type weapons (swords, greatswords, axes, battleaxes and daggers), blunt type weapons and bows also have a small chance to inflict external wounds. If enough external wounds are inflicted to your char they will start bleeding over time, this damage over time effect will get more deadly as more damaged is inflicted. Bleeding can be healed by consuming health potions or casting healing spells which now restore lost blood, sleeping also heals these wounds but slower. If enough scarring has been inflicted no amount of potions, healing spells or sleep will reverse the damage and your char will require stitches or bandages to stop the bleeding. Bandages although they stop the bleeding only do so for a short amount of time and if the bleeding is too severe no amount of bandages will stop the bleeding either. Stitches are the only way to heal fatal external wounds and the greater the damage the more stitches that will be required. Can only occur when physical attacks are NOT blocked.\r<br />\r<br />* Internal Trauma: This is when permanent damage is inflicted to inner muscle tissue or organs. This applies to all blunt type weapons (maces and warhammers) and bows, blade type weapons also have a small chance to inflict organ damage. The more internal trauma your char suffers the less damage they will inflict with weapons and the slower they will move. Internal trauma can be healed by consuming stamina potions or casting healing spells which reverse the effects of bruising. Sleeping also heals blunt force trauma while dren is able to stimulate organs. If enough scarring has been inflicted no amount of potions, healing spells or sleep will reverse the damage and your char will require ringers solution to heal. Can only occur when physical attacks are NOT blocked.\r<br />\r<br />* Elemental Scarring: Every time your char suffers damage from a destruction type spell their is a small chance that your char will suffer elemental scarring. The strength of this debuff depends on the amount of scarring that has been inflicted. This effect can be healed by using a special item (which can be purchased and/or crafted).\r<br />\r<br />[size=4][u]Combat Effects[/u][/size]\r<br />\r<br />- Even though your enemies will inflict debuffs upon you this does not mean that you cannot do the same. During combat their is now a random chance every time you strike the enemy with a specific weapon that a debuff will be inflicted upon them. The possible effects are as follows:\r<br />\r<br />* Bleeding: With every strike from a blade type weapon their is a moderate chance the enemy will bleed for a minor amount of physical damage each second over a minor duration of time. Each type of weapon material inflicts different amounts of bleeding damage. This bleed effect can stack.\r<br />\r<br />* Stagger: With each strike from any weapon or shield their is a moderate chance the enemy will be struck hard enough that they will stagger. If the enemy is already staggered they will be knocked down instead.\r<br />\r<br />* Disarm: With each strike from any weapon or shield their is a minor chance the enemy will be struck at the arms forcing them to drop any equipped weapon or shield.\r<br />\r<br />* Shatter: With each strike from any weapon or shield their is a small chance the enemy&#39;s equipped gear will be &#34;dismantled&#34; reducing their armor rating and forcing them to drop that armor item. The armor item that is dismantled depends on whether you hit the enemy with your weapon or your shield.\r<br />\r<br />* Stun: With each bashing strike from your shield their is a small chance the enemy will take a blow to the head causing them to be stunned (paralyzed) for a few seconds. Should you be lucky enough to strike an enemy from behind they will be knocked down and possibly stunned.\r<br />\r<br />* Knockdown: With each bashing strike from your shield their is also a moderate chance the enemy will be caught off balance and knocked down to the floor. This effect requires that you first unlock a perk.\r<br />\r<br />[size=4][u]Skills Remade[/u][/size]\r<br />\r<br />- Many skills (but not all) have been refurnished to accommodate this very complex mod. The changes are as follows:\r<br />\r<br />* Sneak renamed &#34;Survival&#34;\r<br />* Smithing renamed &#34;Crafting: Combat&#34;\r<br />* Alchemy renamed &#34;Crafting: Profession&#34;\r<br />* Enchanting renamed &#34;Dovah&#34;\r<br />* Conjuration renamed &#34;Creation&#34;\r<br />* Destruction renamed &#34;Sorcery&#34;\r<br />* Illusion renamed &#34;Hexes&#34;\r<br />* Alteration renamed &#34;Adaptation&#34;\r<br />* Restoration renamed &#34;Miracles&#34;\r<br />\r<br />[size=4][u]Crafting 101[/u][/size]\r<br />\r<br />- All crafting has been completely redone and now works very differently in-game, new crafting trees have also been introduced. The base princibal is still present (gather raw materials from the world and refine them at crafting stations) and has in fact been enhanced. Here is how it works:\r<br />\r<br />* Requisition - This is the main material that you will now work with when it comes to any crafting tree. As mentioned already that idea is still the same, for example you will collect iron ore from iron ore deposits, bring it to a smelter and then refine it, however instead of gaining iron ingots you will now gain &#34;Smithing Requisition&#34; which is the main resource for the Smithing crafting tree.\r<br />\r<br />* Base Items - These are the secondary materials required by most crafting trees. These items cannot be crafted and must either be purchased from a merchant and/or found as loot in the world.\r<br />\r<br />- The new crafting trees are as follows:\r<br />\r<br />* Tailoring (required to craft cheap/expensive clothing and robes)\r<br />* Fletching (required to craft all arrows)\r<br />* Artifice (required to craft random spell tomes/scrolls)\r<br />\r<br />[size=4][u]Alchemy[/u][/size][size=4][u] & Artifice[/u][/size]\r<br />\r<br />- Alchemy has been completely overhauled and their are now 3 main features to the skill which are brewing, potion mixing and scroll/tome crafting.\r<br />\r<br />- Brewing is being able to use &#34;Alchemy Requisition&#34; to create potions that you have unlocked.\r<br />\r<br />- Potion mixing allows you to take 2 or 3 potions and mix them together using a special ingredient in order to merge the effects of all potions into 1 unique potion (who knows what new effects you may discover). The reason for this huge change is simply because I strongly dislike Bethesda&#39;s hardcoded version of Alchemy and I feel that this method works far better and is much less sloppy. Potions which fortify skills now also last much longer (5 minutes the same as most other potions).\r<br />\r<br />- Scroll/Tome crafting is exactly what it sounds like, an alchemy bench now allows you to use &#34;Artifice Requisition&#34; to craft random scrolls and tomes of all spell schools.\r<br />\r<br />- Collecting ingredients found in the world is now much more difficult, every ingredient collected from flora or fauna as a chance to be ruined (and therefore removed from inventory immediately). The chance that an ingredient will be ruined when harvested depends on your char&#39;s current Survival skill (the higher the skill the less chance that an ingredient will be ruined upon collection).\r<br />\r<br />- Here is an example of how you would now craft a major healing potion:\r<br />\r<br />5x Wheat = 1x Alchemy Component A\r<br />3x Alchemy Component A  + Calcinator (common) = 350x Alchemy Requisition\r<br />350x Alchemy Requisition + 1x Empty Container = 1x Healing Potion Tier 2\r<br />\r<br />* HINT: Rarer and stronger potions cost far more Alchemy Requisition to craft, it is often preferable to save all requisition resources to later craft much better potions.\r<br />\r<br />[size=4][u]Smithing[/u][/size]\r<br />\r<br />- Smithing has also been changed a great deal but not completely overhauled like Alchemy. All recipes from the original game that allowed you to craft weapon and armor items have been altered to require more materials. The materials required to craft weapon or armor items can only be crafted if you have the required requisition and base items (explained above). This new system limits Smithing which was the basic idea.\r<br />\r<br />- Here is an example of how you would now craft a iron sword:\r<br />\r<br />1x Medium Hilt bought from vendor/looted from enemies (cannot be crafted).\r<br />1x Medium Blade bought from vendor/looted from enemies (cannot be crafted).\r<br />1x Medium Hilt + 1x Medium Blade + 250x Smithing Requisition = Iron Sword.\r<br />\r<br />- Here is an example of how you would now craft a steel greatsword:\r<br />\r<br />1x Large Hilt bought from vendor/looted from enemies (cannot be crafted).\r<br />1x Large Blade bought from vendor/looted from enemies (cannot be crafted).\r<br />1x Large Hilt + 1x Large Blade + 800x Smithing Requisition = Steel Greatsword.\r<br />\r<br />[size=4][u]Crude Crafting Technique[/u][/size]\r<br />\r<br />- It is now possible to craft many items yourself without the requirement of any crafting apparatus, the number of items that can be crafted are limited at first but as you find tools and other types of gadgets the list will expand. Some specific items can only be crafted in certain locations, for example you can only collect water while swimming and snow while it is snowing.\r<br />\r<br />[size=4][u]Arrow Crafting[/u][/size]\r<br />\r<br />- It is now possible for you to craft your own arrows using the forge, I realize that their is quite a few mods which do this already (as well as the official Dawnguard DLC) but the problem is that even though they are good at what they do they still don&#39;t fit in well enough with the vanilla game or are just too easy to get materials and craft dozens of arrows/bolts even if they are rare. Here is how arrow/bolt crafting with this mod works, first you need wood (firewood is now just called wood) which is cut down into shafts (this makes up the base of the arrow/bolt). Next you need the fletching which attaches to both sides of the arrow/bolt and allows it to travel accurately through the air once fired, this can be crafted by yourself using the crude crafting technique with feathers. Thirdly and lastly you need metal tips which make up the arrow/bolt point, you can craft these using any forge as well as smithing requisition. Also all ammo type items now have a weight value of 0.1 (no more being able to carry around unlimited arrows/bolts all the time).\r<br />\r<br />[size=4][u]House of Sophfaea[/u][/size][size=4][u][size=4][u]/[/u][/size]Bounty Points/Creation Estus[/u][/size]\r<br />\r<br />- \r<br />\r<br />* Bounty Points (can only be earned by slaying your enemies, the stronger the opponent the more BP that is rewarded. BP can be spent in the House of Sophfaea for powerful items, gold and other rewards).\r<br />\r<br />* Creation Estus (required to cast most Creation (conjuration) spells is acquired by the crude crafting technique and many other methods).\r<br />\r<br />[size=4][u]Item Gold Values[/u][/size]\r<br />\r<br />- Most weapon and armor items are now worth their weight in gold, this means that if hide armor has a weight value of 6 it will have a gold value of at least 60 and if steel armor has a weight value of 25 then it will have a gold value of at least 250. This also means that most potions have had their gold value greatly increased. Also in an effort to balance spell resistance all potions/enchants which granted fire, frost or electric resistance have been removed (so now theirs mainly just physical and magical damage resistance along with other resistances like resist poison and resist disease). The reason for changing the gold values of many items is because I want more gold sinks to exist in-game.\r<br />\r<br />[size=4][u]Dragoon Commander[/u][/size]\r<br />\r<br />- \r<br />\r<br />[size=4][u]Karma[/u][/size]\r<br />\r<br />- The karma system from the Fallout series has also been introduced into the game which will mainly affect the Dovahkiin but also have an influence on everyone else. Your char&#39;s Karma is ultimately decided by his/her actions and how they affect the world around them. Here are some examples:\r<br />\r<br />* Killing a friendly animal will greatly decrease your Karma rating.\r<br />* Killing an enemy creature will slightly decrease your Karma rating.\r<br />* Killing an enemy NPC will moderately decrease your Karma rating.\r<br />* Killing a NPC who is a member of a peaceful/law serving faction will greatly decrease your Karma rating.\r<br />* Stealing food/materials from other cities will moderately decrease your Karma rating.\r<br />* Stealing food/ingredients from supply containers located in towns/cities will greatly decrease your Karma rating.\r<br />* Harvesting raw food that has not been planted by you will slightly decrease your Karma rating.\r<br />* Stealing coin from merchants/travelers will greatly decrease your Karma rating.\r<br />* Giving raw food/ingredients to farmers at a reduced price will slightly increase your Karma rating.\r<br />* Giving ore to miners at a reduced price will slightly increase your Karma rating.\r<br />* Donating a small amount of gold to beggars will moderately increase your Karma rating.\r<br />* Donating a large amount of gold to priests will greatly increase your Karma rating.\r<br />\r<br />HINT: The trick to managing your Karma is finding an equal balance to every choice that you make, if you slaughter a dozen bandits it&#39;s a good idea to seek penance by donating some of your plundered gold to a temple.\r<br />\r<br />[s][size=4][u]The Hollow[/u][/size][/s]\r<br />\r<br />[size=4][u]Reputation[/u][/size]\r<br />\r<br />- A reputation system has been introduced into Skyrim. This means that your hostile actions will have more consequences. For example killing soldiers who follow the Empire will eventually result in you being hated by all factions who are friendly with the Empire while the Stormcloaks faction will actually be more friendly towards you and vice versa. This makes it dangerous to just go around attacking any soldier who follows a certain faction. Should your reputation with a faction become intolerable you can bribe a guard to restore that reputation to its neutral value.\r<br />\r<br />[size=4][u]Spell Changes[/u][/size]\r<br />\r<br />- Many spells have been altered to function more dynamically in-game and to be used by the player more easily. Spells are used in 3 specific ways:\r<br />\r<br />* Wielded (as usual you equip a spell in the right/left hand or both and then cast it).\r<br />* Passive (many spells no longer need to be cast manually and will always be active but only after certain conditions are met).\r<br />* Toggle (some spells/powers can now be switched on/off at your leisure but drain magicka while they are active).\r<br />\r<br />- Here are some of the new spells and abilities you can expect in-game while using this mod:\r<br />\r<br />* Entity of Song (NPC, status element): Summons an entity that uses short ranged projectile attacks to confuse and entice foes.\r<br />\r<br />* Bahamut (dragon, non-elemental element): Summons an ancient and powerful dragon to aid the Dragonborn in combat.\r<br />\r<br />* Knights of the Round (NPC&#39;s, non-elemental elements): Summons multiple entities that use an assortment of weapons and armor to bring destruction to the enemies of the Dragonborn.\r<br />\r<br />* Conjure Chair: Gives you somewhere to sit down and rest your aching legs, also slowly restores physical fatigue over time.\r<br />\r<br />* Conjure Bedroll: Gives you somewhere to sleep which restores energy.\r<br />\r<br />* Conjure Campfire: Allows you to create a campfire which is useful in many ways (such as cooking raw food and increasing temperature). Remember the rules of avoiding fire hazards&#33;\r<br />\r<br />* Fulcrum Energy: Increases the damage of all equipped weapons for a short duration of time.\r<br />\r<br />* Resurrect: This allows you to bring the dead back to life (not as a zombie) but the spell has a 5 sec cast time and a extremely high magicka cost.\r<br />\r<br />* Strip Apparel: A spell which allows you to break away the armor of your enemies leaving them vulnerable to further damage by nullifying they&#39;re armor rating. This spell can also be used on your own loyal followers (it seems that this spell when used on followers prevents them from equipping they&#39;re default outfit even when the cell is refreshed which means you may be able to give them any armor/clothing you want and they will keep it equipped with no problem).\r<br />\r<br />- Their are even more new spells just waiting to be discovered...\r<br />\r<br />- Most spell tomes now come with a heavy price, that price is &#34;Materia Slots&#34;. The more powerful the spell granted by that tome the more slots will be used (lowest is 1 and maximum is 5). Each slot filled takes a tole on the satiation, hydration and fatigue stats. This means that the more spells unlocked using tomes the more your hunger, thirst and fatigue needs will be drained over time resulting in you having to eat more food, drink more beverages and sleep longer hours (it is actually possible to starve to death in a matter of minutes but this is extremely rare). Their is NO MAX LIMIT to materia slots, the choice is always yours but so are the consequences.\r<br />\r<br />* All spells (materia associated only), shouts (player only) and some scrolls have been renamed to include acronyms so that they are easier to sort and locate within the spell list menu.\r<br />\r<br />* Spell tomes when given to allies will now grant the spell associated with that tome to the NPC.\r<br />\r<br />* Lesser Ward, Steadfast Ward and Greater Ward have been renamed and redesigned (now called &#34;Reflect&#34;). Instead of reducing physical and \r<br />magic damage these spells now simply reflect any spell that hits you back towards the attacking caster.\r<br />\r<br />[s][size=4][u]Hunting[/u][/size]\r<br />\r<br />True hunting has been brought to Skyrim with SOTF. This simply means that you can no longer simply run up to any animal and blast it with powerful destructive magic for a quick kill just to get its pelt. Animals when attacked with destructive magic will give &#34;ruined hides&#34; instead of pelts enforcing the requirement to actually hunt hostile predators and other animals. In addition animals are also capable of inflicting heavy bleeding on the PC.[/s]\r<br />\r<br />[size=4][u]Other Important Changes[/u][/size]\r<br />\r<br />- Running will now slowly drain stamina over time the same as sprinting does, but not as severely.\r<br />\r<br />- Swinging a weapon normally will now drain stamina over time but not in chunks like power attacking does.\r<br />\r<br />- Maximum carry weight per 10 stamina has been reduced slightly.\r<br />\r<br />- The range at which Actors greet you has been halved.\r<br />\r<br />- The chance of finding arrows on the corpses of those who have been slain has been reduced.\r<br />\r<br />- Blood now persists on weapons for a much longer duration of time.\r<br />\r<br />- It is now possible for many more arrows to &#34;stick&#34; to actors (10 max) and they will now persist for a much longer duration of time. By default stuck arrows will now be removed from your char every 10 seconds or so (this can be deactivated in-game).\r<br />\r<br />- Due to how easy it is to make gold in Skyrim the barter system is now less easy going (items sell for less and cost more to buy).\r<br />\r<br />- Walking speed has been increased.\r<br />\r<br />- Swim speed has been drastically reduced, nobody besides athletic swimmers can swim THAT fast.\r<br />\r<br />- Movement speed while bows are equipped/drawn has been increased slightly.\r<br />\r<br />- Movement speed while swinging 1-handed/2-handed weapons has been greatly reduced.\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][PLANNED UPDATES][/b][/u][/size][/color]\r<br />\r<br />[size=4][u]Official[/u][/size] \r<br />\r<br />- These are changes I will definitely include as future updates:\r<br />\r<br />* None so far.\r<br />\r<br />[size=4][u]Feedback[/u][/size] \r<br />\r<br />- These are changes based on feedback which I may or may not include as updates:\r<br />\r<br />* None so far.\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][INSTALL/UNINSTALL][/b][/u][/size][/color]\r<br />\r<br />[size=4][u]Install[/u][/size]\r<br />\r<br />Simply copy the files of your choice from the downloaded zip folder and paste them to your Skyrim application Data folder located in the Steam root directory. The included BSA package is REQUIRED for this mod to function correctly and must be copied.\r<br />\r<br />[size=4][u]Uninstall[/u][/size]\r<br />\r<br />To uninstall activate the &#34;SOTF: Main Menu&#34; item while in-game and use the &#34;Uninstall&#34; option, then after exiting the game just delete all installed files which should be easy due to how I have organized them.\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][BUGS/FIXES][/b][/u][/size][/color]\r<br />\r<br />None at this time.\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][Q&A][/b][/u][/size][/color]\r<br />\r<br />Here is where you can find the answers to the most commonly asked questions (this also means that if these questions are asked in the comments section you will be directed to this page).\r<br />\r<br />Q: Some need stats are kind of unrealistic, for example it actually takes an average of 3 to 4 weeks to starve to death but this mod has &#34;hunger&#34; set so that it only takes just over 4 days. Why is that exactly?\r<br />A: I tried making it so that each need stat was as realistic as possible but the problem was that during gameplay it just wasn&#39;t nearly as fun, theirs no point in having a hunger, thirst and sleep system in the game if you hardly ever interact with it or aren&#39;t able to enjoy the additional gameplay challenges and immersion that it adds. For this reason all need stats that are designed to decrease over time will never require more than 1 in-game week to fully deplete. Also the global &#34;timescale&#34; setting has been set to 10 to make time pass much more slower in-game so that the mod plays out much more smoothly.\r<br />\r<br />Q: Some of the need stats decrease far too rapidly (or too slowly?) and require too much micro-management, would it be ok if you changed the rates at which some need stats decay?\r<br />A: I plan to give players the ability to change the rate at which need stats decay over time so that they can each choose for themselves instead of me making lots of ESP files in an attempt to please everyone.\r<br />\r<br />Q: Will the &#34;integrity scarring&#34; features that have a chance of affecting the PC work with weapons and spells from other mods?\r<br />A: Yes, as long as those weapons and spells have the correct keywords attached to them.\r<br />\r<br />Q: Why did you add durability in this fashion? Why not use &#34;health&#34; for each item instead?\r<br />A: Its difficult, tiring and time consuming getting durability to work for weapons, armor and shields. Also the bug introduced in game patch 1.5 didn&#39;t help matters much (random game crash with plugins that change some weapons). Adding HP to each item and making it save to that object reference is no easy task and even though I came close to making it work the game and the way it is hardcoded just would not allow it and thus the idea was scrapped.\r<br />\r<br />Q: Why add most of your changes in one huge overhaul, why not use modules like some other modders do?\r<br />A: Just about everything within SOTF is connected to everything else, so much so that using modules (more than 1 ESP plugin for all major alterations) would be extremely awkward and time consuming and that&#39;s even if I could manage it all by my lonesome. Also due to how the game is hardcoded I doubt that I would get everything to work as well as it does now.\r<br />\r<br />Q: This mod includes X but I wish to not have it included because I use another mod which includes Y but does things differently, can you change X so that its more like Y?\r<br />A: The mod is the way it is because it is based on my personal preferences and is only available to the public because I don&#39;t mind sharing it. Any detail that fellow users are not happy with will most likely not be altered, however you can always try changing the in-game options and posting a suggestion in the comments section.\r<br />\r<br />Q: Your mod isn&#39;t working as intended&#33; What could be wrong&#33;?\r<br />A: Something not working right with the mod? Getting a CTD upon loading a saved game with this mod enabled? Try following the steps below in order and loading your saved game after each step:\r<br />\r<br />1. Install the latest version of SKSE.\r<br />2. Make sure to have the latest Skyrim patch installed as this mod will always be dependent on it (you must have both the Skyrim ESM and Update ESM plugins active for this mod to work).\r<br />3. Make sure that you have the latest version of the required ESP/ESM files and BSA package installed.\r<br />4. Revert to an earlier save (preferably a save file where this mod was not active at all) so that the properties for all active scripts are refreshed. \r<br />\r<br />If you are having a problem with a more specific issue send me a private message with as many details on the issue as possible.\r<br />\r<br />Q: This mod seems to be incompatible with the unofficial patches, did you include the changes they made?\r<br />A: Yes, but only those that were required. For example my mod changes most weapons and armor so I had to add the same changes made to weapons and armor by the Unofficial Skyrim Patch before adding my own alterations.\r<br />\r<br />Q: The spell &#34;Illumination&#34; does not seem to do anything, what&#39;s wrong?\r<br />A: You didn&#39;t check the requirements section did you? Lazy bum&#33; The mod &#34;Face Light&#34; is required to make that spell function correctly.\r<br />\r<br />[s]Q: Why do you have so many SPOILERS on the main description page for this mod without any actual real spoilers?\r<br />A: Their is so much information that people must be aware of regarding this mod that I think its best that they not be &#34;swarmed&#34; with a wall of text hence the reason for SPOILER tags being used to hide the information until otherwise needed.[/s]\r<br />\r<br />Q: How long have you been working on this mod?\r<br />A: If I remember correctly I was planning this mod almost 1 month before Skyrim was scheduled to be released to the public. I was actually working on the mod and punching in the data as soon as the CK was released on Steam.\r<br />\r<br />Q: Where did you find the patience and determination to make such dramatic game changes and write so many scripts?\r<br />A: Music, short breaks, long sleep and a refusal to give up.\r<br />\r<br />Q: Can this mod be installed automatically with programs like Nexus Mod Manager?\r<br />A: No, most mods that I download I install manually and so all mods that I publish on the Nexus will reflect this rule.\r<br />\r<br />Q: Do you plan to release the source files for the scripts that are used with SOTF?\r<br />A: Not any time soon.\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][BEST COMMENTS WALL][/b][/u][/size][/color]\r<br />\r<br />A compilation of the best quotes of user comments.\r<br />\r<br />&#34;&#34;\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][OTHER RECOMMENDED MODS][/b][/u][/size][/color]\r<br />\r<br />Here you can find a list of links to other mods that work great with SOTF which are also compatible.\r<br />\r<br />[CBM - Oblivion] by myself\r<br />http://skyrim.nexusmods.com/mods/33509\r<br />\r<br />[SkyUI] by Schlangster\r<br />http://skyrim.nexusmods.com/mods/3863\r<br />\r<br />[Vilja in Skyrim] by Emma and &lt; Team Vilja &gt;\r<br />http://skyrim.nexusmods.com/mods/26393#\r<br />\r<br />[Sofia] by djjohnjarvis\r<br />http://www.nexusmods.com/skyrim/mods/54527\r<br />\r<br />[Lovely Jessica] by Omega99jp\r<br />http://skyrim.nexusmods.com/mods/27955\r<br />\r<br />[Enhanced Blood Textures] by dDefinder1\r<br />http://skyrim.nexusmods.com/mods/60/\r<br />\r<br />[Wet & Cold] by Isoku\r<br />http://skyrim.nexusmods.com/mods/27563\r<br />\r<br />[Become a Bard] by LP1\r<br />http://skyrim.nexusmods.com/mods/31680\r<br />\r<br />[Interesting NPC&#39;s] by Kristakahashi\r<br />http://skyrim.nexusmods.com/mods/8429\r<br />\r<br />[Leather Backpack] by Tupii and theRoadstroker\r<br />http://skyrim.nexusmods.com/mods/13732\r<br />\r<br />[DSpSoB] by DarkPhoenixxy\r<br />http://skyrim.nexusmods.com/mods/17746\r<br />\r<br />\r<br />[color=#f1c232][size=5][b][u][SOTF HELP GUIDE][/u][/b][/size][/color]\r<br />\r<br />Important: When using this mod in a fresh game it is best to start from the beginning or from a save file where you have only just escaped the keep and are fresh of the bat. This guide is designed to help you get started with this mod by giving tips and guiding you step by step on what you should do in-game to receive the best enjoyable experience possible. This guide assumes that you are not using any &#34;alternate beginning&#34; mods.\r<br />\r<br />1. Make a fresh save while this mod is NOT active which you can revert back to in the event that something goes wrong. I will not be held liable for anything that goes wrong with any save files from using this mod&#33;\r<br />\r<br />2. At the very beginning of the game (assuming it is the default starting point of the game) you have very little to worry about... besides getting your head lopped off its shoulders (not by this mod but by the axe wielding executioner). Should you survive your near-death experience with the executioner&#39;s axe make your way through the fort as usual until you get inside and are safe from Alduin&#39;s attacks for the time being.\r<br />\r<br />3. After your bonds have been cut collect all the items that you can. \r<br />\r<br />4. Your satiation will be a little low and your hydration moderately low by now, find some food (cabbage or apples for example) and consume 1 or 2, also find any nearby fresh water and drink 1 to keep that hydration level afoot.\r<br />\r<br />5. This is the best time to set your SPECIAL stats, bring up the SOTF main menu (hotkey H) and choose &#34;Stats/Values&#34; and then choose &#34;SPECIAL&#34;. Using the SPECIAL menu you can set the stats to your personal preference.\r<br />\r<br />6. Make your way down to the captive cells below picking up any food and other important supplies along the way, all of these items will be required for the journey later.\r<br />\r<br />7. Now play the game as usual until you are outside.\r<br />\r<br />8. Follow the quest NPC until you reach Riverwood, its a good idea to harvest ALL flora that you come across as Alchemy has been revamped and is now much harder to work with when it comes to ingredients.\r<br />\r<br />\r<br />-KC",
  "categoryId": "24",
  "version": "1.0",
  "author": "-KC",
  "createdUnix": "1367523071",
  "updatedUnix": "1407067042",
  "containsAdultContent": false,
  "uploadedBy": "Enix031798",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120453",
      "name": "Survival of the Fittest - Categorized Favorites Menu",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Survival of the Fittest - Categorized Favorites Menu-35537-1-0.zip",
      "uploadedUnix": "1407067042",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/96d2e86a26854cd40cfae4abce3d7a280589cf97a68ad8e2ddb4a48e6ee959ff/analysis/1407067090/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Survival%20of%20the%20Fittest%20-%20Categorized%20Favorites%20Menu-35537-1-0.zip?fid=1000120453&ttl=1535814130&ri=8192&rs=8192&setec=efa072dc1ca09d8327c7fb4babcc6287"
    }
  ]
}