{
  "modId": 35547.0,
  "modName": "I Am a Hero Not a Businessman",
  "summary": "Tired of crafting iron daggers, disenchanting everything, and training your foes by picking locks? This mod places the game\\'s focus back on exploration and combat by minimizing the roles of non-combat skills.\r\n\r\nIMPORTANT: This mod is for new characters only.",
  "descriptionHtml": "Tired of crafting iron daggers, disenchanting everything, and training your foes by picking locks? This mod places the game\\'s focus back on exploration and combat by minimizing the roles of non-combat skills.\r\n\r\nIMPORTANT: This mod is for new characters only. There\\'s no good way to make old characters compatible. Also, if you use \\\"Alchemy Refinements\\\", \\\"Simpler Fortify Crafting\\\", or \\\"Top-Level Perks at 90\\\", put them above this in the load order.\r\n\r\nThe changes made by this mod affect six skills: Alchemy, Enchanting, Lockpicking, Pickpocket, Smithing, and Speech. These changes are as follows:\r\n- Perks for these skills have been reduced to three each, with no minimum skill prerequisites.\r\n- These skills don\\'t advance with usage and can\\'t be trained, though you can increase them a limited amount with skill books and quest-specific boosts.\r\n- The Warrior and Mage stones benefit slightly different sets of skills, while the Thief stone improves bartering and lockpicking.\r\n- Talking your way into the College of Winterhold is slightly easier.\r\n\r\nThis mod can also be found on Steam Workshop at [url=http://steamcommunity.com/sharedfiles/filedetails/?id=137808637]http://steamcommunity.com/sharedfiles/filedetails/?id=137808637[/url].\r\n\r\nIf you find any bugs or issues, please note them in the comments so I can promptly address them.\r\n\r\n[b]Perks[/b]\r\n\r\n[i]Alchemy[/i]\r\n- Concentrated Poison: Poisons applied to weapons last for twice as many hits.\r\n- Experimenter: Eating an ingredient reveals all of its effects.\r\n- Alchemist (requires Concentrated Poison or Experimenter): Potions and poisons you make are twice as strong.\r\n\r\n[i]Enchanting[/i]\r\n- Soul Squeezer: Soul gems provide extra magicka for recharging.\r\n- Extra Effect (requires Soul Squeezer): Can put two enchantments on the same item.\r\n- Enchanter (requires Soul Squeezer): New enchantments are twice as strong.\r\n\r\n[i]Lockpicking[/i]\r\n- Quick Hands: Able to pick locks without being noticed.\r\n- Locksmith (requires Quick Hands): Pick starts close to the lock opening position.\r\n- Treasure Hunter (requires Locksmith): 50% greater chance of finding special treasure.\r\n\r\n[i]Pickpocket[/i]\r\n- Light Fingers: Pickpocketing bonus of 100%. Item weight and value reduce pickpocketing odds.\r\n- Misdirection (requires Light Fingers): Can pickpocket equipped weapons.\r\n- Poisoned (requires Light Fingers): Silently harm enemies by placing poisons in their pockets.\r\n\r\n[i]Smithing[/i]\r\n- Basic Smithing: Can craft Steel armor and weapons, and can improve them significantly more.*\r\n- Advanced Smithing (requires Basic Smithing): Can craft Scaled and Plate armor, and can improve all armor and weapons significantly more.*\r\n- Arcane Blacksmith (requires Basic Smithing): You can improve magical weapons and armor.\r\n\r\n* Basic Smithing and Advanced Smithing always let you at least temper Superior gear. The best attainable grade is Flawless.\r\n\r\n[i]Speech[/i]\r\n- Capitalist: Every merchant gains 1000 gold for bartering, and you can invest with most merchants to further increase their available gold.\r\n- Fence (requires Capitalist): Can barter stolen goods with any merchant you have invested in.\r\n- Silver Tongue (requires Capitalist): Can bribe guards to ignore crimes, and persuasion attempts are 30% easier.",
  "categoryId": "73",
  "version": "6",
  "author": "David Sid",
  "createdUnix": "1367543369",
  "updatedUnix": "1368721857",
  "containsAdultContent": false,
  "uploadedBy": "DavidSid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029183",
      "name": "I Am a Hero Not a Businessman",
      "version": "5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "A Hero Not a Businessman-35547-5.zip",
      "uploadedUnix": "1368207760",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/2109c7f3dce4d84c719ffb5dd91c4204dd2087944bbd3f081d910ff401b0e4d1/analysis/1407564145/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Hero%20Not%20a%20Businessman-35547-5.zip?fid=1000029183&ttl=1535814142&ri=8192&rs=8192&setec=4c6cd801408e2c08b46b208d63cd700a"
    },
    {
      "fileId": "1000030142",
      "name": "I Am a Hero Not a Businessman",
      "version": "6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "I Am a Hero Not a Businessman-35547-6.zip",
      "uploadedUnix": "1368721857",
      "modVersion": "6",
      "virusScanUrl": "https://www.virustotal.com/file/602158da642bcb0540590f47911781b4d6774f1347a0898cc702e4e5d6d814f2/analysis/1407571563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/I%20Am%20a%20Hero%20Not%20a%20Businessman-35547-6.zip?fid=1000030142&ttl=1535814143&ri=8192&rs=8192&setec=39cafcc9224ff49a3c55cdf6575b948e"
    }
  ]
}