{
  "modId": 35555.0,
  "modName": "Lions Manson",
  "summary": "Since it is poor also at skill and English, the reply of a comment may not be made.",
  "descriptionHtml": "? Lions Manson? Lions Manson A, LMA, LM??\r\n\r\nI made this mod for the purpose of improving it while enjoying a rise of skills. Thank you for having this Mod downloaded.\r\nI added facilities to each city in the Skyrim.( Solitude, Markarth, Windhelm, Whiterun <suburbs> Riften <non-facilities>)\r\n\r\nThe place of institutions is close to each city. \r\nThe place where the character of \\\"LM\\\" was attached is displayed on the map, and fast travel can be carried out from the beginning.  \r\nLM Rock is in the neighborhood between Dustman\\'s Cairn and Hamvir\\'s Rest.\r\n\r\nA letter of \\\"LM\\\" is written to all the items using in mod first.(you can distinguish it from items of other mod and Vanilla.)\r\n\r\nI may not expect the effect of three kinds of necklaces and rings of the rise of skills that you can acquire in mod very much.(combat, product, stealth)\r\nThe numbers increase, but think that I cannot expect lockpicking, sneakt skill, etc.\r\n\r\nThe number attached to the last of an enemy\\'s name becomes so strong that it increases. \r\nEnemies do not fight, unless you attack.  LM Temple of the Divines only animals and a monster are state of wars from the beginning.\r\n\r\nAll the enemies who exist in this Mod appear at the same place that killed them. \r\nFrom the place which killed the enemies, please move to another city and wait for 11 days. \r\nIf it is performed, you can fight with enemies again. \r\n\r\nBookshelves can be used as a storage place, after acquiring the items currently used for this Mod. (Items can be taken only once. )\r\n\r\n\r\n? Installation and uninstallation\r\n\r\nPlease extract a Zip file and put LMA.esp into Program Files\\\\Steam\\\\steamapps\\\\common\\\\Skyrim\\\\Data. \r\n\r\nPlease put the LMA.esp folder in a meshes folder into Data\\\\meshes\\\\actors\\\\character\\\\FaceGenData\\\\FaceGeom. \r\n\r\nPlease put the LMA.esp folder in a textureses folder into Data\\\\textures\\\\actors\\\\character\\\\FaceGenData\\\\FaceTint. \r\n\r\nSkyrim starting  > Data Files selection  > LMA.esp check\r\n  \r\n? Uninstallation only deletes three items written above.  ( Please do not forget the items which you put into the bookshelf etc.) ?\r\n\r\n\r\n? Precaution?\r\n\r\nI made this Mod with the following condition. The inspection in DLC does not reach (DLC non-introduction)\r\nIt is a self-responsibility about the introduction of Mod.\r\nWhen you introduced this Mod, no matter what trouble may occur, I cannot take responsibility. \r\n\r\n\r\nTESV Version 1.8.151.0.7? Creation Kit:1.8.151.0\r\n\r\n? Since it is poor also at skills and English, the reply of a comment may not be made.",
  "categoryId": "91",
  "version": "1.0",
  "author": "TEC",
  "createdUnix": "1367568286",
  "updatedUnix": "1367572537",
  "containsAdultContent": false,
  "uploadedBy": "siestabby",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027737",
      "name": "Lions Manson",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2859",
      "fileName": "Lions Manson-35555-1-0.zip",
      "uploadedUnix": "1367572537",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e8f8c9b518fbd67f119afd808bccefd2c2f93a132b353d7deeb8220fbad3919a/analysis/1407552107/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lions%20Manson-35555-1-0.zip?fid=1000027737&ttl=1535814149&ri=8192&rs=8192&setec=b26fe24a3b9cfd20463cccb92dda3d59"
    }
  ]
}