{
  "modId": 35567.0,
  "modName": "Mod Publishing Tutorial",
  "summary": "There are a lot of things to know that aren&#39;t &#34;obvious&#34; when you first publish a mod and this tutorial aims to help you find the information you need to give your &#34;followers&#34; the best experience possible.",
  "descriptionHtml": "[size=4][color=#ffcc33]Table of contents[/color][/size]\r<br />01. Introduction\r<br />02. Register your mod to the Nexus site\r<br />03. The mod managing screens\r<br />04. The &#34;Edit attributes&#34; screen\r<br />05. Editing the descriptions\r<br />06. Add changes to the &#34;Change log&#34;\r<br />07. Upload your images\r<br />08. &#34;Posts&#34; section\r<br />09. &#34;Forums&#34; section\r<br />10. Tag your mod\r<br />11. Packaging your file for the NexusModManager\r<br />12. Create a custom installation script for the NexusModManager\r<br />13. Upload your files\r<br />14. Publish your mod\r<br />\r<br />\r<br />[size=4][color=#ffcc33]01. Introduction[/color][/size]\r<br />There are a lot of things to know that aren&#39;t &#34;obvious&#34; when you first publish a mod and this tutorial aims to help you find the information you need to give your &#34;followers&#34; the best experience possible.\r<br />\r<br />I know this tutorial may seem too long to read and overly complicated, but it&#39;s not the case. After reading it once, you&#39;ll realize you already assimilated 90% of it without even trying. You will eventually consult this guide only for the last 10% because everything else is really easy once you know it.\r<br />\r<br />Although most of this tutorial is basically a step by step of how to publish a mod, I will also give some opinions along the way. Keep in mind those are my own personal preferences [color=#fe2e2e][b][PP][/b][/color], ultimately you&#39;re the one who will have to decide which parts of this tutorial applies to you and which don&#39;t.\r<br />\r<br />I suggest you have a look at the [url=https://sites.google.com/site/ttrcreations/skyrim/mod-publishing-tutorial]HTML version of this page[/url]. It offers some commodities the Nexus can&#39;t. You&#39;ll also find the HTML version of my other mod pages on the same site.\r<br />\r<br />\r<br />[size=4][color=#ffcc33]02. Register your mod to the Nexus site[/color][/size]\r<br />First, you must log into your account on the Nexus site. To register your new mod, you simply need to click on your username at the top of the page and select &#34;User area&#34; in the drop-down menu. This will bring you to your user page, the picture below is how mine looks.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1367606349.png[/img][/center]\r<br />In the section &#34;Mods&#34;, click on the link &#34;Add a new mod&#34; and this will lead you to the registering form.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1378574669.png[/img][/center]\r<br />First, let&#39;s talk about the new publishing wizard functionality. As you can see at the right side of the image above, there&#39;s a step by step wizard guiding you thru publishing your mod. While it funnels you on the right path, it won&#39;t give you all the information you need to publish your mod. Thus, this tutorial will provide you that missing information so you can fill in the blanks.\r<br />\r<br />With that out of the way, you shouldn&#39;t have any problem to fill in the information in the image above as it&#39;s pretty self-explanatory. So let&#39;s continue with the mod information.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-3-1378574670.png[/img][/center]\r<br />It&#39;s important to remember that [color=#fe2e2e]everything you write here can be changed later[/color] so you don&#39;t have to go all OCD filling the form. The &#34;File name&#34; is your mod&#39;s name and I&#39;ll be covering the small and long descriptions in the chapter &#34;Editing the descriptions&#34; of this tutorial. You can hover your mouse over the blue &#34;i&#34; for more information.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: [color=#fe2e2e]The version number is used many times in your mod page and it&#39;s always sorted alphabetically. Thus, use a decent and logic numbering scheme for your version and stick to it[/color]. Something like &#34;1.0.0&#34; will give you all the latitude you need. If your mod is in ALPHA, set the version to something between &#34;0.0.1&#34; and &#34;0.5.0&#34;. If your mod is in BETA, set the version to something greater than &#34;0.5.0&#34; and below &#34;1.0.0&#34;.  The first release that isn&#39;t &#34;experimental&#34; should always be &#34;1.0.0&#34;, there&#39;s nothing more absurd than a perfectly usable mod stuck below version &#34;1.0.0&#34;. Don&#39;t be shy to use the last number for quick fixes, the middle one for new features and the first one for big changes.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-2-1378574669.png[/img][/center]\r<br />The &#34;File classification&#34; information aims to avoid unfortunate &#34;encounters&#34; with things people might not wanna see. Even if there&#39;s a couple options, the real aim of this information is to tag the nudity/skimpy mods so they can be filtered out from search results. There&#39;s a &#34;tag&#34; chapter we&#39;ll cover later but since mod authors were notoriously bad at tagging their own file, this information serves as a fail-safe and reminder.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: Don&#39;t worry about &#34;trimming&#34; your audience. If people went out of their way to filter out your mod, it&#39;s because they don&#39;t want to see it. Going against their will is a lose/lose situation as you don&#39;t want tons of complaints filling up your inbox and your mod page. You certainly don&#39;t want moderators on your back either.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1367844289.png[/img][/center]\r<br />You have to be careful about your choice in the &#34;Commenting&#34; section because the options aren&#39;t very clear. To make matter worst, if you choose option #4 you&#39;ll have to contact an administrator if you change your mind... The &#34;single comment topic&#34; means the &#34;POSTS&#34; tab and the &#34;discussions tab&#34; means the &#34;FORUMS&#34; tab. So by looking at the image above, the real options you have are:\r<br />\r<br />[list]\r<br />[*]Just a &#34;posts&#34; tab\r<br />[*]Both, a &#34;posts&#34; and a &#34;forums&#34; tab\r<br />[*]Just a &#34;forums&#34; tab\r<br />[*]None\r<br />[/list]\r<br />[color=#fe2e2e][b][PP][/b][/color]: I would suggest you use the second option, meaning you want both a &#34;posts&#34; and a &#34;forums&#34; tab. This will allow people to simply comment on your mod in the &#34;posts&#34; tab while you can use the &#34;forums&#34; tab to steer the conversation in a specific direction like &#34;bugs&#34;, &#34;troubleshooting&#34; and &#34;suggestions&#34;.\r<br />\r<br />The drop-down menu is about the &#34;forums&#34; tab. If you answer &#34;Yes&#34;, anyone will be able to create a new subject. If you answer &#34;No&#34;, you&#39;ll be the only one able to do that.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1367846144.png[/img][/center]\r<br />Again, everything in the picture above is self explanatory. If you have any doubts, just hover your mouse over the blue &#34;i&#34; for more information. Beware, the field that allows you to give editing permissions to another user doesn&#39;t work at all, don&#39;t waste your time.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1367847860.png[/img][/center]\r<br />In this section, you need to decide what a user is allowed to do with your mod. The site already covers the common permissions with the drop-down menus, but you can also add anything you want in the &#34;Permission notes&#34;.\r<br />\r<br />The checkbox at the top of the section allows you to ignore the drop-down menus and only fill the &#34;Permission notes&#34; text box. In that case, when you click on the icon for permissions in the mod page, you will only see the &#34;Permission notes&#34; you wrote, you won&#39;t see anything else.\r<br />\r<br />You also have the option to list your &#34;Credits&#34; section here instead of doing it in your mod page.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: Personally, I feel credits are better served directly in the mod page than hidden away in a pop-up window. Hidding permissions is ok because it doesn&#39;t concerns &#34;normal&#34; users, but credits are a way to advertise some authors, mods and tools that wouldn&#39;t get the attention they deserve otherwise.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1367856369.png[/img][/center]\r<br />Pretty simple here, just read the warnings and check the 2 checkboxes.\r<br />\r<br />Before hitting the &#34;Submit&#34; button, you need to know this only register the mod on the Nexus site, it doesn&#39;t make it available for public view. That means that nobody will see your mod unless you &#34;publish&#34; it. [color=#fe2e2e]Refrain from publishing your mod until your mod page is ready, you have all the time in the world[/color]. And don&#39;t worry about the &#34;Latest files&#34; section on the front page because this only advertise newly published mods, which means as long as you don&#39;t publish yours, you&#39;re not penalized.\r<br />\r<br />Hit the &#34;Submit&#34; button to register your mod and you&#39;ll be redirected to step #3 of the publishing wizard:\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1378586789.png[/img][/center]\r<br />Now you have 2 choices, you can either continue with the steps of the publishing wizard or you can click on the green &#34;VIEW FILE PAGE SO FAR&#34; button. This tutorial isn&#39;t gonna cover the remaining steps of the wizard because you&#39;re gonna have to do a lot of back and forth while editing your mod page and I feel the wizard is less appropriate for this kind of thing.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: I also wrote the whole tutorial before the wizard was introduced... You can still use everything I cover in this tutorial to help you fill in the information for the wizard if you wish to go that way.\r<br />\r<br />So just click on the green &#34;VIEW FILE PAGE SO FAR&#34; button at the top right to finally get to the managing screen.\r<br />\r<br />\r<br />[size=4][color=#ffcc33]03. The mod managing screens[/color][/size]\r<br />There are 2 centralized screens to manage your mod. I won&#39;t elaborate on the content of those managing screens for now because we&#39;re gonna cover them later, but you need to remember how to get there.\r<br />\r<br />The first managing screen is your mod page. If you just registered your mod on the site and clicked the green &#34;VIEW FILE PAGE SO FAR&#34; button, you&#39;ll be redirected to this screen:\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1367866819.png[/img][/center]\r<br />You have to be logged in to see the managing section on the left. If you&#39;re not logged in, your mod page will look like any other mod page on the site.\r<br />\r<br />To get to your mod page at a later date, you can:\r<br />[list]\r<br />[*]Bookmark it\r<br />[*]Click on the mod name in the second managing screen (more on that just below)\r<br />[*]Click on the &#34;Notifications&#34; icon in the top right corner and then click on your mod link in the &#34;LATEST FILE COMMENTS&#34; section\r<br />[*]Use the search option\r<br />[/list]\r<br />The second managing screen will list all your mods, making it handy to manage more than one at once. To get there, just click on your user name at the top right of the site, click on &#34;User area&#34; and then click the &#34;Manage mods&#34; link in the &#34;Mods&#34; section to see this screen:\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1367863923.png[/img][/center]\r<br />\r<br />[size=4][color=#ffcc33]04. The &#34;Edit attributes&#34; screen[/color][/size]\r<br />The &#34;Edit attributes&#34; screen is basically the same screen you filled when registering your mod with a couple changes to reflect the fact you&#39;re now editing your mod instead of creating it. This screen can be accessed by clicking on the &#34;Edit attributes&#34; link of any managing screens.\r<br />\r<br />The &#34;File information&#34; section is mostly used to edit the short and long descriptions, but I will cover those in the next chapter of this tutorial. You can also update your mod&#39;s version number so the NexusModManager can alert players when you update your mod. Finally, there&#39;s also a new option to hide your mod from public view and the possibility to explain why you did it. This option only applies if you already published your mod and should be used as a temporary solution, not a permanent one. If you want to permanently remove your mod from the Nexus site, you should use the &#34;Delete file&#34; link in the principal managing screen instead.\r<br />\r<br />There&#39;s no need to cover the remaining sections of this screen as they&#39;re the same you filled when you registered your mod.\r<br />\r<br />When you&#39;re done editing, just click the &#34;Submit&#34; button to save.\r<br />\r<br />\r<br />[size=4][color=#ffcc33]05. Editing the descriptions[/color][/size]\r<br />Your mod has 2 kind of descriptions: the short and the long one. Both can be edited by clicking on the &#34;Edit attributes&#34; link in any of the managing screens.\r<br />\r<br />The short description is the small summary of your mod that appears in the search results and the &#34;Latest files&#34;. It only has a 350 characters limit and doesn&#39;t offer any real way to customize the layout of your text except doing some paragraphs.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: The short description is the gateway to your mod, it&#39;s what should strike the interest of people so you should always strive to make it as appealing as possible. [color=#fe2e2e]There are dozens of new mods every day, if you cannot be bothered to write something of quality, what does it say about the quality of your mod[/color]?\r<br />\r<br />The long description is the text you&#39;ll see on your mod page, what you&#39;re reading right now is the long description of my mod. For a full example of a long description, you can download this mod&#39;s long description in the FILES tab.\r<br />\r<br />In your mod page, you can write as many sections as you want but there are 3 sections that should always be there. The first of those 3 sections should be an introduction explaining clearly what your mod does and what it doesn&#39;t. The second section should be an installation and requirements procedure. The last section should be the credits if you have any. The first 2 sections will give people a quick glance at what they need to know to use your mod while the last one will pay respect to your fellow modders.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: Those 3 sections should be laid out in that specific order because it&#39;s the natural chronology. I strongly suggest you order your sections from the most to the less valuable to people. Everyone that visits your page wants to know what your mod does so it&#39;s logical to put your introduction at the very top of the page. Since not everyone will be interested in your mod, it makes sense to put the installation and requirements section somewhere in the middle of your page. The credits section will be valuable to only a handful of people, so it should naturally come toward the bottom of your page.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: You&#39;re free to write whatever you want on your mod page, but you should always give as much details as you can because people will judge your mod on what you wrote. As I said with the short description, [color=#fe2e2e]there are dozens of new mods every day, if you cannot be bothered to write something of quality what does it say about the quality of your mod[/color]?\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: [color=#fe2e2e]If you don&#39;t want to give away spoilers, there&#39;s always a way to explain what your mod does without resorting to cryptic messages nobody understand[/color]. Time is precious to most people and they have no problem spending time in-game trying to figure out how to solve your quest or puzzle because they&#39;re there for that, but they don&#39;t want the same principle applied when they read the description of your mod. They want to know what to expect from your mod, they don&#39;t want to solve a riddle or install your mod just to understand what your mod does. The same can be said about books. People have no problem spending a week to read a book because they&#39;re there for that, but they&#39;re not willing to spend as much time just to decide whether or not the book will appeal to them...  that&#39;s what the back cover summary is for. Your long description is the book&#39;s back cover summary.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: If you have problems to write correctly in English because it&#39;s not your native language, just let us know in your introduction. People will be more lenient to let it slide when they know the reason why your text might not make sense sometimes. It&#39;s all about presentation, if you&#39;re upfront with your lack of knowledge in English, you&#39;re usually good to go.\r<br />\r<br />Back to the subject, as you can see the long description isn&#39;t as limited as the short one. The secret behind all this is BBCode. BBCode is a markup language like HTML but much more limited, meaning you won&#39;t be able to manage your page as much as you&#39;d like. I would gladly point you to a BBCode tutorial, but reality is the BBCode this site support isn&#39;t the full available BBCode. So the next best thing is to show you which ones are confirmed to work and tell you what you can expect using them.\r<br />\r<br />Before giving the codes, you should know how they work. BBCodes are a set of 2 tags, the first one state the intent and gives the start point while the second one gives the end point. The end point code is always the same as the start code minus the &#34;intent&#34; but with an added &#34;/&#34; to indicate it&#39;s the end point. It&#39;s gonna be clear as soon as you&#39;ll see example, but since the codes are interpreted by the site, I will have to add spaces in the tags so you can actually see them. [color=#fe2e2e]When you use the codes, you need to remove those spaces[/color] if you want to make them work.\r<br />\r<br />The codes can also be combined for multiple effects, but the start and end points must always be in a &#34;last opened = first closed&#34; order. See the examples below to understand what will [color=#339966]work[/color] and what [color=red]won&#39;t[/color]:\r<br />[center][code]\r<br />[color=#339966]Good[/color] -&gt; [color=#339966][code #1][/color][code #2][/code #2][color=#339966][/code #1][/color]\r<br />[color=#339966]Good[/color] -&gt; [code #2][color=#339966][code #1][/code #1][/color][/code #2]\r<br />[color=red]Bad[/color] --&gt; [color=red][code #1][/color][code #2][color=red][/code #1][/color][/code #2]\r<br />[color=red]Bad[/color] --&gt; [code #2][color=red][code #1][/color][/code #2][color=red][/code #1][/color]\r<br />[/code][/center]\r<br />So here are the codes:\r<br />\r<br />[color=#ff99ff][ b ][/color]Bold[color=#ff99ff][ /b ][/color] -&gt; [b]Bold[/b]\r<br />[color=#ff99ff][ u ][/color]Underline[color=#ff99ff][ /u ][/color] -&gt; [u]Underline[/u]\r<br />[color=#ff99ff][ i ][/color]Italic[color=#ff99ff][ /i ][/color] -&gt; [i]Italic[/i]\r<br />[color=#ff99ff][ s ][/color]Strikethrough[color=#ff99ff][ /s ][/color] -&gt; [s]Strikethrough[/s]\r<br />[color=#ff99ff][ size=3 ][/color]Size 3[color=#ff99ff][ /size ][/color] -&gt; [size=3]Size 3[/size]\r<br />[color=#ff99ff][ font=&#34;Impact&#34; ][/color]Impact Font[color=#ff99ff][ /font ][/color] -&gt; [font=&#34;Impact&#34;]Impact Font[/font]\r<br />\r<br />Just a note about the &#34;font&#34; tag. The font must be present on the computer reading your mod page otherwise it won&#39;t work. You are pretty safe if using one of those fonts: Arial, Arial Black, Arial Narrow, Book Antiqua, Century Gothic, Comic Sans MS, Courier New, Franklin Gothic Medium, Garamond, Georgia, Impact, Lucida Console, Lucida Sans Unicode, Microsoft Sans Serif, Palatino Linotype, Tahoma, Times New Roman, Trebuchet MS, Verdana.\r<br />\r<br />\r<br />[color=#ff99ff][ color=#ffff00 ][/color]Color[color=#ff99ff][ /color ][/color] -&gt; [color=#ffff00]Color[/color]\r<br />[color=#ff99ff][ color=green ][/color]Color[color=#ff99ff][ /color ][/color] -&gt; [color=green]Color[/color]\r<br />The color can be specified by name or with it&#39;s hexadecimal number. The hexadecimal numbers works by giving a value for each basic color that compose the color you want. Those are called &#34;RGB&#34; (Red Green Blue) colors and are widely used in HTML. Check out this [url=http://html-color-codes.info]site[/url] for a great tool to help you find the code you&#39;re looking for.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: Choose colors that are readable for crying out loud&#33;&#33;&#33; Use colors that aren&#39;t aggressive to the eye and have a great contrast with the background, not something like [color=#0000ff]this[/color]... Remember that each screen has its own color calibration, so if you are using colors that are &#34;borderline&#34;, you might make it unreadable for someone else.\r<br />\r<br />\r<br />[color=#ff99ff][ center ][/color]Text aligned in the center[color=#ff99ff][ /center ][/color]\r<br />Will align the text or image in the center like shown below:\r<br />[center]Text aligned in the center[/center]\r<br />\r<br />\r<br />[color=#ff99ff][ right ][/color]Text aligned to the right[color=#ff99ff][ /right ][/color]\r<br />Will align the text or image to the right like shown below:\r<br />[right]Text aligned to the right[/right]\r<br />\r<br />[color=#ff99ff][ heading ][/color]Heading[color=#ff99ff][ /heading ][/color]\r<br />Will act as a &#34;title&#34; with a line that span the entire page width like shown below:\r<br />[heading]Heading[/heading]\r<br />This code already include an automatic line feed, so don&#39;t put a blank line after it or you&#39;ll see 2 blank lines on your page.\r<br />\r<br />\r<br />[color=#ff99ff][ line ][/color]\r<br />Will draw a line that span the entire page width like shown below (it&#39;s the only code that doesn&#39;t need an &#34;end point&#34;):\r<br />[line]\r<br />This code already include an automatic line feed, so don&#39;t put a blank line after it or you&#39;ll see 2 blank lines on your page.\r<br />\r<br />\r<br />[color=#ff99ff][ code ][/color]Example of code[color=#ff99ff][ /code ][/color]\r<br />Will show the text with a fixed font (every character as the same width) like shown below:\r<br />[code]Example of code[/code]\r<br />\r<br />\r<br />[color=#ff99ff][ quote ][/color]Example of quote[color=#ff99ff][ /quote ][/color]\r<br />Will show text in a &#34;quote&#34; format like shown below:\r<br />[quote]Example of quote[/quote]\r<br />This code already include 2 automatic line feeds, so don&#39;t put a blank line after it or you&#39;ll see 3 blank lines on your page.\r<br />\r<br />\r<br />[color=#ff99ff][ list ][/color]\r<br />[color=#ff99ff][ * ][/color]Item 1\r<br />[color=#ff99ff][ * ][/color]Item 2\r<br />[color=#ff99ff][ /list ][/color]\r<br />Will make unordered lists (no number) like shown below:\r<br />\r<br />[list]\r<br />[*]item 1\r<br />[*]item 2\r<br />[/list]\r<br />This code reacts very inconsistently. The start point ([color=#ff99ff][ list ][/color]) will not count as a line feed. If you don&#39;t have anything else on that line, the site engine will start the list immediately so you need to put a blank line yourself if you want to see some space between the start of the list and the paragraph above. On the other hand, the end point ([color=#ff99ff][ /list ][/color]) will always count as a line feed no matter what, so you don&#39;t need to put one yourself or you&#39;ll have 2 line feeds when you intended to only have 1 blank line.\r<br />\r<br />Forget about &#34;ordered&#34; lists, they aren&#39;t supported.\r<br />\r<br />\r<br />[color=#ff99ff][ url=http://skyrim.nexusmods.com ][/color]Skyrim Nexus[color=#ff99ff][ /url ][/color]\r<br />Will include a link to any web page you want like shown below:\r<br />[url=http://skyrim.nexusmods.com]Skyrim Nexus[/url]\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: I beg you, use this URL code&#33;&#33;&#33; I&#39;m really tired of having to copy paste a link because the author couldn&#39;t be bothered to do it correctly. Remember this, [color=#fe2e2e]every time you take a shortcut, it saves time only for you while it waste the time of everyone else[/color].\r<br />\r<br />[color=#ff99ff][ img ][/color]http://static-2.nexusmods.com/15/mods/110/images/thumbnails/35567-1-1367606349.png[color=#ff99ff][ /img ][/color]\r<br />Display the image at the specified URL like shown below:\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/thumbnails/35567-1-1367606349.png[/img]\r<br />\r<br />The link to your image can be any valid URL. You can point to your favorite image service like photobucket and flickr but keep in mind that if you delete your images there, you will delete them from your mod page too. To avoid this kind of problem, you can upload your own images to this site (we&#39;ll cover how later) and use those in your mod page. That way, you&#39;re absolutely sure you will never delete them by mistake. Once uploaded to your mod page image area, all you have to do is click on the image to see it in it&#39;s full size and then right click on it to find the URL (check the image location or the properties). If you right click on a thumbnail, you will have the URL of the thumbnail which can be pretty sweet and this is what you see in my example here.\r<br />\r<br />Be careful, the [color=#ff99ff][ img ][/color] code doesn&#39;t resize your image, so you&#39;ll have to select your image with the right size from the get go.\r<br />\r<br />\r<br />[color=#ff99ff][ youtube ][/color]Hm3KIgMPEaA[color=#ff99ff][ /youtube ][/color]\r<br />Display the youtube video at the specified URL like shown below:\r<br />\r<br />[youtube]Hm3KIgMPEaA[/youtube]\r<br />\r<br />The [color=#ff99ff][ youtube ][/color] code doesn&#39;t need the full adress, you only need the movie ID (after the &#34;v=&#34; in the URL).\r<br />\r<br />\r<br />[size=4][color=#ffcc33]06. Add changes to the &#34;Change log&#34;[/color][/size]\r<br />A change log is very useful to help people keep tracks of all the changes you make to your mod.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: Avoid cluttering your mod page long description with a change log. Especially when authors put the change log at the very top of their mod page... Nobody wants to scroll thru 30 lines of change log that make no sense to them right now before they finally reach your mod description. There&#39;s a section just for the change log, freaking use it&#33;\r<br />\r<br />To manage the change log, just click on the &#34;Add a change log&#34; link in any of the managing screens. This will bring you to a new screen where you&#39;ll see all the changes you wrote (if any) since the beginning of your mod.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1368130535.png[/img][/center]\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: As you can see in the image above, this is a great example of why I strongly advise using a logic numbering scheme for your version and sticking to it. [color=#fe2e2e]Using a bad version number like &#34;alpha&#34; will top the change log but it should logically go below version 0.9.0.[/color] I know I&#39;m hammering my point thru your tick skull right now, but after reading the entire tutorial you will realize this has an impact in other chapters too. Better solve your problem now than cry later...\r<br />\r<br />If you want to delete an entry of the change log, simply click on the red &#34;x&#34; to delete it.\r<br />\r<br />Since there&#39;s no edit function for the change log, the only way to update or remove the text is to delete the entry you want to update and then add an entry with the updated text. It might be wise to add the new entry first and then delete the old one so you always have a backup if something bad happens.\r<br />\r<br />To add an entry, click on the green &#34;ADD CHANGES&#34; button at the top right. You&#39;ll see one of those 2 screens depending on which option you select: &#34;Separate text fields&#34; or &#34;Large text box&#34;.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1368129022.png[/img]    [img]http://static-3.nexusmods.com/15/mods/110/images/35567-2-1368129024.png[/img][/center]\r<br />\r<br />The &#34;Separate text fields&#34; option allows you to enter each change as a separate entry, meaning each change will have its own delete button in the managing screen. On the plus side, you can manage each change without affecting anything else, but the downsides are that everything is sorted &#34;randomly&#34; and you can&#39;t do anything to modify the order or the layout.\r<br />\r<br />The &#34;Large text box&#34; option allows you to enter all your changes as a single block, meaning you will have only 1 delete button in the managing screen for the entire block of changes. On the plus side, you can sort every changes in a block however you see fit and you can even do a little layout. The downside is that every time you want to change something you need to copy/paste the entire block of changes and then do your modifications.\r<br />\r<br />Nothing prevents you from creating 2 blocks of changes using the &#34;Large text box&#34; option, but those 2 blocks will have the same problems as the &#34;Separate text fields&#34; option, meaning that while the text of each block will stay in the same order, the 2 blocks will be displayed in a random order. You basically get the downsides of the 2 options combined without getting the plus sides of either...\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: Personally, I wouldn&#39;t even bother with the &#34;Separate text fields&#34; option because it lists changes in a random order. It&#39;s already pretty difficult to read the change log without any colors, no need to make it worst than it already is.\r<br />\r<br />Once you&#39;re ready to save those changes, simply enter the version number they relate to and click on the green &#34;SUBMIT&#34; button to return to the change log managing screen.\r<br />\r<br />Check the change log tab on this page to see what I did with the &#34;Large text box&#34; option. It&#39;s far from perfect, but it&#39;s much better than the run-of-the-mill mod. An even better example can be found [url=http://skyrim.nexusmods.com/mods/33860/?tab=12&navtag=%2Fajax%2Fmodchangelog%2F%3Fid%3D33860%26v%3D&pUp=1]here[/url].\r<br />\r<br />\r<br />[size=4][color=#ffcc33]07. Upload your images[/color][/size]\r<br />To manage your mod page images, just click on the &#34;Images&#34; link in any of the managing screens. This will bring you to a new screen where you&#39;ll see all the images you uploaded (if any) in your image section.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1368713014.png[/img][/center]\r<br />To upload a new image, simply click on the green &#34;ADD IMAGES&#34; button and this will bring you to this screen:\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-2-1368713016.png[/img][/center]\r<br />The screen above is pretty straight forward. The descriptions are optional, but if you enter something you will see the text appear when you hover your mouse on the image in the &#34;IMAGES&#34; tab of your mod page. Simply select the images you want to upload and click on the green &#34;SUBMIT&#34; button. This will bring you to this screen:\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1368713079.png[/img][/center]\r<br />You now have 3 choices. The first choice is to add more images, which allows you to repeat exactly what we just did. The second choice will bring you back to the image managing screen. The third choice will bring you back to the principal mod managing screen. Click on the second option to manage your images.\r<br />\r<br />Now that you have at least 1 image in your image section, what are your options?\r<br />\r<br />You can &#34;drag and drop&#34; images to order them however you wish. The first image will always be the one you&#39;ll see in the search results, it will also be the first displayed in the image section and in the thumbnails on your mod page.\r<br />\r<br />You can delete them by clicking on the red &#34;X&#34; below the images.\r<br />\r<br />You can modify your mod page heading image by clicking on the small computer screen icon &#34;Use in background&#34;. This will bring you to a new screen that will allow you to select the image&#39;s section you want to use as &#34;background&#34;. The top of the screen is the preview of how it&#39;s gonna look and the bottom is your original image. Simply follow the instructions and crop your original image however you see fit. When you&#39;re satisfied with your selection, just click on the save button. When you refresh your mod page, you&#39;re gonna see your new image in the background behind your mod title:\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1368723158.png[/img][/center]\r<br />The last thing you can do in the image managing screen is to set your &#34;Hot file&#34; image. To do that, just click on the small martini glass icon &#34;Use in hot files image&#34; under the image you want to use. This will bring you to the same screen as for the background image. Crop the image, save and you&#39;re set.\r<br />\r<br />Remember, you can change your images whenever you want. The &#34;hot files&#34; and &#34;background&#34; images are no different. To remove your &#34;hot file&#34; image, just click on the link &#34;a hot file image&#34; in the image managing screen and then click on the remove link. You can do exactly the same with the &#34;background&#34; image.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1368724151.png[/img][/center]\r<br />\r<br />\r<br />[size=4][color=#ffcc33]08. &#34;Posts&#34; section[/color][/size]\r<br />This section is where the majority of people will leave comments about your mod. You&#39;ll be able to post replies to people&#39;s comments and create new comments on your own. I&#39;ll spare you the details, anyone that used the Web in the last decade should be able to navigate this section.\r<br />\r<br />On the other hand, there is 1 feature worth mentioning: sticky posts. The sticky post will always be displayed on the comment&#39;s first page and will have a red border to indicate it&#39;s importance. It&#39;s a great opportunity to deliver news and instructions to posters.\r<br />\r<br />To create such a post, simply click on the &#34;POSTS&#34; tab and then click on the &#34;Add Comment&#34; link. Enter your comment and click on the green &#34;Submit&#34; button.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1369676790.png[/img][/center]\r<br />Now that your post is created, simply click on the &#34;Make sticky&#34; link to save it as a sticky post.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1369676586.png[/img][/center]\r<br />As you can see, once your post is a sticky, you still have a couple options. &#34;Un-stick&#34; will return your post to a normal post. &#34;Lock&#34; will prevent people to reply to that particular post, but they&#39;ll still be able to post comments. &#34;Reply&#34; and &#34;Edit&#34; are self-explanatory...\r<br />\r<br />\r<br />[size=4][color=#ffcc33]09. &#34;Forums&#34; section[/color][/size]\r<br />This section basically follows the same logic as the &#34;Posts&#34; section, but with multiple &#34;subjects&#34;. Again, anyone that used the Web in the last decade should know how to navigate this section, so I&#39;ll spare you the details.\r<br />\r<br />To create a topic, simply click on the &#34;FORUMS&#34; tab and then click on the &#34;New Topic&#34; link.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1369764895.png[/img][/center]\r<br />\r<br />The &#34;Subject&#34; will be the title of your post and can be seen where the pink arrow points at. The &#34;Topic description&#34; is the text you see where the green arrow points at. Finally, the &#34;Post&#34; is the text of your own post in the forum because you can&#39;t just create a topic without a post in it. It&#39;s important to mention that [color=#fe2e2e]the &#34;Subject&#34; and the &#34;Topic&#34; description&#34; can&#39;t be edited after creation[/color]. When you&#39;re ready, click on the green &#34;Submit&#34; button.\r<br />\r<br />Now, the important concept to remember here is the difference between a topic and a post. When you click the first time on the &#34;FORUMS&#34; tab, you see all the topics. You need to click on a topic to see its posts.\r<br />\r<br />As such, [color=#fe2e2e]you can make your topic a sticky but this will not affect the posts in it[/color]. To make your topic a sticky, simply click on the &#34;[stick]&#34; link between the blue and pink arrows. To undo your changes, click on the &#34;[unstick]&#34; link that replaced the former &#34;[stick]&#34; link.\r<br />\r<br />You can also delete an entire topic by clicking on the &#34;[x]&#34; link below the blue arrow.\r<br />\r<br />Now click on your topic and you will see a familiar interface. The &#34;post&#34; mode works just like the &#34;Posts&#34; section does, meaning you can edit, make a sticky post, lock a post, etc.\r<br />\r<br />There are 2 new links at the left of the &#34;Add Comment&#34; when you&#39;re in &#34;post&#34; mode.\r<br />\r<br />The &#34;Lock this thread&#34; link will disable the &#34;Add Comment&#34; link so no one will be able to add new posts to the topic. You can undo your changes by clicking on the &#34;Unlock this thread&#34; link that replaced its counterpart.\r<br />\r<br />The &#34;View forum thread&#34; link will redirect you to your own topic on the Nexus site forums, meaning it will be a completely different interface and people won&#39;t be on your mod page anymore. I advise to ignore this link since it serves no purpose for this tutorial.\r<br />\r<br />Once you&#39;re done with your post, you can go back to the topics by simply clicking again on the &#34;FORUMS&#34; tab.\r<br />\r<br />\r<br />[size=4][color=#ffcc33]10. Tag your mod[/color][/size]\r<br />Tags are pre-defined words to categorize your mod and make it easier for people to find with the &#34;search&#34; feature. To manage your mod&#39;s tags, just click on the &#34;Tag this file&#34; link in any of the managing screens or simply click on the &#34;TAGS&#34; tab.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1371573767.png[/img][/center]\r<br />\r<br />To &#34;tag&#34; your mod, simply click on the appropriate green arrow. Any mistake can be corrected by clicking on the orange arrow.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: Personally, I never used such a feature and I highly doubt this is a popular one. On the other hand, it will take you 10 seconds of your time so you might as well do it.\r<br />\r<br />\r<br />[size=4][color=#ffcc33]11. Packaging your file for the NexusModManager[/color][/size]\r<br />Packaging your mod for use with the NexusModManager (NMM) is really simple. I&#39;ll use my [url=http://skyrim.nexusmods.com/mods/33860/?tab=2&navtag=%2Fajax%2Fmodfiles%2F%3Fid%3D33860&pUp=1]TTRSO[/url] mod to explain it to you.\r<br />\r<br />First, let&#39;s examine the structure of my mod. Right click on the archive of my mod and select the option &#34;Extract to TTR_Skill_Overhaul&#34;. Open the TTR_Skill_Overhaul folder when extraction is complete and you will see this:\r<br />[color=#ff99ff][code]\r<br />fomod/\r<br />Scripts/\r<br />Source/\r<br />TTR_Reset_Module.txt\r<br />TTR_Skill_Overhaul.esm\r<br />TTR_Skill_Overhaul_Alchemy.esp\r<br />...\r<br />TTR_Skill_Overhaul_Alteration.esp\r<br />...\r<br />TTR_Skill_Overhaul_Speech.esp\r<br />[/code][/color]\r<br />As you can see, the archive&#39;s structure is made so you could manually install the mod by extracting the files in your &#34;SkyrimData&#34; folder. Why is that? First and foremost, not everyone will use the NMM so you have to cater to these users too. Second, mod managers like NMM only offer more options but their main tasks are to extract your archive in the &#34;SkyrimData&#34; folder and save the users the hard work. [color=#fe2e2e]So it doesn&#39;t really matter if you install the mod manually or with a mod manager, the files need to be in a structure that can be extracted directly in the &#34;SkyrimData&#34; folder[/color].\r<br />\r<br />You could use a different structure, but that would require the users to perform extra steps to manually install your mod or you would have to provide a custom installation script for the chosen mod manager (more on that later).\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: [color=#fe2e2e]It&#39;s also a common misconception to think you need to put your files under a &#34;Data&#34; folder in the archive[/color]. The only reason it works is because older mod managers didn&#39;t take a stand back then and the situation got out of hand with thousands of mods packed &#34;incorrectly&#34;. In order to support those older mods, the creators of NMM found it easier to patch the bad behavior than repackage them all. By avoiding the use of a &#34;Data&#34; folder, it&#39;s also easier to manage the archive with your archiving program. When you extracted my mod, I told you to extract to a specific folder for a reason. When you select all my files under the &#34;TTR_Skill_Overhaul&#34; folder and you right click on them, your archiving program will suggest to package all the files under &#34;TTR_Skill_Overhaul.7z&#34; (could be another extension) instead of &#34;Data.7z&#34;. This makes things a lot easier to manage for everyone when the structure of your mod is simple and clean. It&#39;s also very hard to search for a specific archive in the NMM mod folder when they&#39;re all named &#34;Data.7z&#34;, &#34;Data(1).7z&#34;, &#34;Data(2).7z&#34;...\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: [color=#fe2e2e]Be sure to avoid version numbers in your files name (ESP/ESM)[/color] as the game saves this information within savegames. Failing to comply with this humble request might result in broken scripts, broken quests, unintended bugs and insults (up to death threats) from angry users... For the same reasons, once you publish your mod you can never change the name of your files (ESP/ESM) again. So think twice before using a dumb name as you&#39;ll be stuck with it till the end of times...\r<br />\r<br />A lot of authors also make the mistake of forgetting to include their scripts in the archive of their mod. Don&#39;t do that&#33; [color=#fe2e2e]Remember to grab the PEX files under the &#34;Scripts&#34; folder[/color]. If you&#39;re extra generous, you can also include the source files of your scripts that are located in the &#34;ScriptsSource&#34; folder as PSC files.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: Please, help your fellow modders by including the source of your scripts in your archive. I wouldn&#39;t have been able to do my own mod without examples of how to do certain things and all of this has been possible because some authors were very generous by providing their source files. The community has given you plenty, please consider giving back in return.\r<br />\r<br />Now that we&#39;ve covered the ESP/ESM files and the &#34;Scripts&#34; folder, we need to cover the remaining 2 folders. You can begin by ignoring the &#34;Source&#34; folder as it&#39;s only there as &#34;documentation&#34; (source of the ESM file), hence optional. As for the &#34;fomod&#34; folder, it&#39;s optional and only required if you want to customize you mod in the NMM. You&#39;ll find 2 files in my &#34;fomod&#34; folder...\r<br />\r<br />The first file, &#34;fomod/ModuleConfig.xml&#34;, is the custom installation script and I&#39;ll cover it in the next chapter of this tutorial. The &#34;fomod/ModuleConfig.xml&#34; is optional and is only required if you want to give options to your users and/or perform specific installation instructions, more on that later.\r<br />\r<br />The second file, &#34;fomod/info.xml&#34;, gives NMM all the missing information about your mod. [color=#fe2e2e]The &#34;fomod/info.xml&#34; file is optional[/color] and NMM will simply not display that information if you don&#39;t provide it. In any case, I suggest you include this file anyway as it will be easier for users to manage your mod. So let&#39;s take a peek at my own TTRSO&#39;s &#34;info.xml&#34; file:\r<br />[color=#ff99ff][code]\r<br />&lt;fomod&gt;\r<br />&lt;Name&gt;TTRSO - TheThirdRace Skill Overhaul&lt;/Name&gt;\r<br />&lt;Version&gt;1.6.0&lt;/Version&gt;\r<br />&lt;Author&gt;TheThirdRace&lt;/Author&gt;\r<br />&lt;Website&gt;http://skyrim.nexusmods.com/mods/33860&lt;/Website&gt;\r<br />&lt;Description&gt;Blah bleh blih bloh bluh...&lt;/Description&gt;\r<br />&lt;/fomod&gt;\r<br />[/code][/color]\r<br />As you can see, it&#39;s pretty straight forward and doesn&#39;t need much explanation. The most important field is the &lt;Description&gt; one as it&#39;s the information displayed in the right pane of NMM. The best feature about the &lt;Description&gt; field is that you can use your mod page long description as is, just copy/paste it in this field and you&#39;re good to go. As an alternative, some people prefer to put there the install/update/uninstall instructions only. [color=#fe2e2e]Beware, any &#34;&&#34; signs will crash the NMM, so don&#39;t use them[/color]. When done correctly, you should see the description appear in the right pane of the NMM when you click on your mod:\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1379086229.png[/img][/center]\r<br />Now that you have all your files in the correct structure, just select them all and right click on them to use your archiving program to package them nice and easy.\r<br />\r<br />[color=#fe2e2e][b][PP][/b][/color]: I would highly suggest you use [url=http://7-zip.org]7zip[/url] as your archiving program. It&#39;s free, simple, clean and it&#39;s the default option for NMM. Most of all, as proven by a couple benchmarks found over the web, it&#39;s the most efficient (time and compression) archiving program publicly available at this time even when pit against paid options. So what are you waiting for?\r<br />\r<br />With your archive in hand, you need to test it with the NMM to see if everything&#39;s ok. If anything goes wrong, and believe me it probably will as it&#39;s your first time, simply remove the mod from NMM, open the folder where NMM keeps your mod files and clean up any files stuck there. [color=#fe2e2e]Don&#39;t forget to clean the subfolders and restart NMM after it&#39;s done[/color]. Eventually, you&#39;ll get the hang of it and will find it simple to create an archive without errors. So don&#39;t give up if it doesn&#39;t work the first couple times.\r<br />\r<br />One last thing, some mods cannot be made NMM compatible for the moment. Anything that doesn&#39;t install into the &#34;Data&#34; folder will require a manual install. SKSE and ENB mods are directly installed under the &#34;Skyrim&#34; folder making them impossible to install with NMM. I really hope this get handled by NMM eventually as it would provide a simple one stop for everything. Maybe if enough people ask on the forums...\r<br />\r<br />\r<br />[size=4][color=#ffcc33]12. Create a custom installation script for the NexusModManager[/color][/size]\r<br />There are 2 types of custom installation script for the NMM: XML or C#.\r<br />\r<br />I won&#39;t cover the C# method as it&#39;s overly complicated for a novice modder. If you want more information about it, I would suggest you read this [url=http://zumbs.wordpress.com/2009/11/08/fomm-and-fomods-for-dummies-3/]guide[/url]. The [url=http://skyrim.nexusmods.com/mods/3829]Deadly Dragons[/url] mod also has a nice and relatively easy C# custom install script for you to check out. There&#39;s not a whole lot information around for this method so brace yourself for a lot of trial and error.\r<br />\r<br />For the novice modder, I highly suggest you stick to the XML method. This method uses the &#34;fomod/ModuleConfig.xml&#34; file to give NMM all the information it needs to install your mod correctly. [color=#fe2e2e]The &#34;fomod/ModuleConfig.xml&#34; file is optional, NMM will simply extract your mod in the DATA folder if you don&#39;t provide more specific instructions[/color]. Most of you won&#39;t need a file like this, but this is where the magic happens when you need something more &#34;complex&#34;.\r<br />\r<br />First, it would be a very good idea to read this [url=http://newvegas.nexusmods.com/mods/44914]guide[/url] to learn the basics. It&#39;s a bit complicated so don&#39;t give up if you understand nothing the first time. Fortunately, you don&#39;t need to understand everything in that guide to cook up a basic custom install script.\r<br />\r<br />As in the previous chapter, I&#39;ll use my [url=http://skyrim.nexusmods.com/mods/33860/?tab=2&navtag=%2Fajax%2Fmodfiles%2F%3Fid%3D33860&pUp=1]TTRSO[/url] mod to explain more about the custom install script. The goal is to understand the basics so you can modify it to your own needs.\r<br />\r<br />Before going further, you should install my TTRSO mod once just to see how the custom install script plays out. What you&#39;ll see is 2 screens, one for selecting the DLCs you use and one for selecting the modules you want to install. [color=#fe2e2e]Those screens are only there to set FLAGS and I use those FLAGS to decide which optional files I&#39;m gonna install[/color]. The beauty of that method is that [color=#fe2e2e]you can put all your optional files in the same archive and install only the things the user really wants[/color].\r<br />\r<br />Ok, now open up my &#34;fomod/ModuleConfig.xml&#34; file and we&#39;ll review each sections together...\r<br />[color=#ff99ff][code]\r<br />&lt;config xmlns:xsi=&#34;http://www.w3.org/2001/XMLSchema-instance&#34; xsi:noNamespaceSchemaLocation=&#34;http://qconsulting.ca/fo3/ModConfig5.0.xsd&#34;&gt;\r<br />[/code][/color]\r<br />I understand absolutely nothing of that section, but what I do know is that it&#39;s required to define the file. Let&#39;s leave it at that and don&#39;t modify anything.\r<br />[color=#ff99ff][code]\r<br />&lt;moduleName&gt;TTRSO - TheThirdRace Skill Overhaul&lt;/moduleName&gt;\r<br />[/code][/color]\r<br />This section is the title of your mod. When you install your mod in NMM, you&#39;ll see this title in the installation window. Nothing complicated here...\r<br />[color=#ff99ff][code]\r<br />&lt;requiredInstallFiles&gt;\r<br />&lt;folder source=&#34;Scripts&#34; destination=&#34;Scripts&#34;/&gt;\r<br />&lt;folder source=&#34;Source&#34; destination=&#34;Source&#34;/&gt;\r<br />&lt;file source=&#34;TTR_Skill_Overhaul.esm&#34; destination=&#34;TTR_Skill_Overhaul.esm&#34;/&gt;\r<br />&lt;file source=&#34;TTR_Reset_Module.txt&#34; destination=&#34;TTR_Reset_Module.txt&#34;/&gt;\r<br />&lt;/requiredInstallFiles&gt;\r<br />[/code][/color]\r<br />This section tells NMM that those files/folders are required by the mod. That means that no matter what option I select in the screens, those will be installed. When you specify a folder, everything under that folder will also be installed.\r<br />[color=#ff99ff][code]\r<br />&lt;installSteps order=&#34;Explicit&#34;&gt;\r<br />[/code][/color]\r<br />This section tells NMM that the screens (&#34;DLC&#34; and &#34;Skills&#34;) must be displayed in the order they appear in the script. This is a weird option, without it all the screens would appear in a random order... Who&#39;d want that?\r<br />[color=#ff99ff][code]\r<br />&lt;installStep name=&#34;DLC&#34;&gt;\r<br />[/code][/color]\r<br />This section defines the title of installation window when you&#39;ll see the first screen. In my case, the first screen ask which DLC you use so I called it &#34;DLC&#34;.\r<br />[color=#ff99ff][code]\r<br />&lt;optionalFileGroups order=&#34;Explicit&#34;&gt;\r<br />[/code][/color]\r<br />This section tells NMM that the following options are part of the same optional group and to draw a &#34;frame&#34; to group them together. The &#34;order=&#34; part indicate the options must be displayed in the order they appear in the script. Don&#39;t ask why, it&#39;s dumb but it needs to be there otherwise they would be displayed in a random order...\r<br />[color=#ff99ff][code]\r<br />&lt;group name=&#34;DLC&#34; type=&#34;SelectAny&#34;&gt;\r<br />[/code][/color]\r<br />This section defines a &#34;filegroup&#34; with the name &#34;DLC&#34;. The &#34;&lt;type=SelectAny&gt;&#34; tells NMM that you can select whatever you want in the options, be it none, all or anything in-between. From the top of my head, there is also a &lt;type=SelectAtLeastOne&gt; to force the user to chose only one option in the group. Consult the guide I asked you to read about the XML method to find out what are the other &lt;type=&gt; available.\r<br />[color=#ff99ff][code]\r<br />&lt;plugins order=&#34;Explicit&#34;&gt;\r<br />[/code][/color]\r<br />This section tells NMM that the options must be displayed in the order they appear in the script. No kidding Sherlock...\r<br />[color=#ff99ff][code]\r<br />&lt;plugin name=&#34;Dawnguard&#34;&gt;\r<br />&lt;description&gt;\r<br />&lt;&#33;[CDATA[Use the Dawnguard compatible files]]&gt;\r<br />&lt;/description&gt;\r<br />&lt;conditionFlags&gt;\r<br />&lt;flag name=&#34;Dawnguard&#34;&gt;Y&lt;/flag&gt;\r<br />&lt;/conditionFlags&gt;\r<br />&lt;typeDescriptor&gt;\r<br />&lt;type name=&#34;Optional&#34;/&gt;\r<br />&lt;/typeDescriptor&gt;\r<br />&lt;/plugin&gt;\r<br />[/code][/color]\r<br />Finally we get to define 1 checkbox&#33; The &lt;plugin name&gt; shows the text of the checkbox. The &lt;&#33;CDATA[...]]&gt; shows the text that will be displayed in the right pane of the installation window. It&#39;s a more detailed description of what the option do. Be careful as all the brackets must be there for it to work. The &lt;flag name&gt; is exactly what it sound, the name of the flag we&#39;ll use later and the value it has if the checkbox is checked. The &lt;type name&gt; tells NMM the checkbox is optional.\r<br />\r<br />This section is repeated with the same pattern for every option I need to display, in this case &#34;Dragonborn&#34; and &#34;Heartfires&#34;.\r<br />\r<br />Now that the first screen is complete, the script just closes the tags and then chain up with the second screen...\r<br />[color=#ff99ff][code]\r<br />&lt;installStep name=&#34;Skills&#34;&gt;\r<br />&lt;optionalFileGroups order=&#34;Explicit&#34;&gt;\r<br />&lt;group name=&#34;Magic&#34; type=&#34;SelectAny&#34;&gt;\r<br />&lt;plugins order=&#34;Explicit&#34;&gt;\r<br />&lt;plugin name=&#34;Alteration&#34;&gt;\r<br />&lt;description&gt;\r<br />&lt;&#33;[CDATA[Overhaul of the Alteration skill]]&gt;\r<br />&lt;/description&gt;\r<br />&lt;conditionFlags&gt;\r<br />&lt;flag name=&#34;Alteration&#34;&gt;Y&lt;/flag&gt;\r<br />&lt;/conditionFlags&gt;\r<br />&lt;typeDescriptor&gt;\r<br />&lt;type name=&#34;Optional&#34;/&gt;\r<br />&lt;/typeDescriptor&gt;\r<br />&lt;/plugin&gt;\r<br />...\r<br />[/code][/color]\r<br />I won&#39;t go further explaining what is what as this is exactly the same pattern as for the first screen, except it now defines the second screen.\r<br />\r<br />When the second screen is complete, the script goes to the final step of installing the optional files you selected.\r<br />[color=#ff99ff][code]\r<br />&lt;conditionalFileInstalls&gt;\r<br />&lt;patterns&gt;\r<br />[/code][/color]\r<br />This section just tells NMM to evaluate the conditions in the &lt;pattern&gt; tags and install the associated files and folder.\r<br />[color=#ff99ff][code]\r<br />&lt;pattern&gt;\r<br />&lt;dependencies operator=&#34;And&#34;&gt;\r<br />&lt;flagDependency flag=&#34;Alteration&#34; value=&#34;Y&#34;/&gt;\r<br />&lt;flagDependency flag=&#34;Dragonborn&#34; value=&#34;&#34;/&gt;\r<br />&lt;/dependencies&gt;\r<br />&lt;files&gt;\r<br />&lt;file source=&#34;TTR_Skill_Overhaul_Alteration.esp&#34; destination=&#34;TTR_Skill_Overhaul_Alteration.esp&#34;/&gt;\r<br />&lt;/files&gt;\r<br />&lt;/pattern&gt;\r<br />&lt;pattern&gt;\r<br />&lt;dependencies operator=&#34;And&#34;&gt;\r<br />&lt;flagDependency flag=&#34;Alteration&#34; value=&#34;Y&#34;/&gt;\r<br />&lt;flagDependency flag=&#34;Dragonborn&#34; value=&#34;Y&#34;/&gt;\r<br />&lt;/dependencies&gt;\r<br />&lt;files&gt;\r<br />&lt;file source=&#34;TTR_Skill_Overhaul_Alteration_DB.esp&#34; destination=&#34;TTR_Skill_Overhaul_Alteration.esp&#34;/&gt;\r<br />&lt;/files&gt;\r<br />&lt;/pattern&gt;\r<br />[/code][/color]\r<br />That&#39;s where the magic comes from. All we did with the 2 installation screens was asking the user what they wanted to install, now&#39;s the time to do it. So each &lt;pattern&gt; represent a set of conditions and if those conditions are met, then the script will install the files and folders specified.\r<br />\r<br />In the example above, the 2 different patterns check if we need to install something for the Alteration skill. The tricky part is that you need to cover all possibilities. The first &lt;pattern&gt; checks if the user selected &#34;Alteration&#34; but didn&#39;t select &#34;Dragonborn&#34;. The second &lt;pattern&gt; checks if the user selected &#34;Alteration&#34; and &#34;Dragonborn&#34;. There&#39;s an implicit third &lt;pattern&gt; here, you also have to consider the user didn&#39;t select any of them either.\r<br />\r<br />If no &lt;pattern&gt; matches the user choices (the implicit third &lt;pattern&gt;), then no file for Alteration will be installed. But if a &lt;pattern&gt; matches the user choices, the &lt;file&gt; tag of that &lt;pattern&gt; will specify the file to install and what name it should have once installed. Remember, the game saves your ESP/ESM filenames in the savegame, so you need to keep the same name to avoid problems. That way, if the user first played my mod without Dragonborn and then buy that DLC, he will be able to upgrade my mod without breaking anything because the Alteration file installed will have the same name as before (TTR_Skill_Overhaul_Alteration.esp). That&#39;s a clever way to have multiple versions of the &#34;same&#34; file without causing troubles in-game for your users.\r<br />\r<br />Using that technique, you could have 1 archive with all your optional files inside. That includes textures, meshes, ESP, scripts and everything you can think of. With that technique, you don&#39;t need to package 8 different archives to give options to your users, you can tie it all nicely in a simple package.\r<br />\r<br />For more examples of the XML method, don&#39;t be afraid to open up the mods that have an installation script. Most of them will use the XML method and studying them will give you new insights on how to do yours. I decided to use FLAGs to do my things, but other authors went in different directions. Use the method that fit for you.\r<br />\r<br />Finally, test your installation script thoroughly. Test every option, test every combination. It&#39;s boring to do, but users put their trust in you so rise to their expectations. A small trick I found when testing mine was to sort my folders by &#34;Date Modified&#34; so everything that was installed would be on top, talk about a time saver&#33; Once your custom install script works correctly, you won&#39;t have to change it unless you add new files and this should be quick to test.\r<br />\r<br />\r<br />[size=4][color=#ffcc33]13. Upload your files[/color][/size]\r<br />To manage your mod files, just click on the &#34;Files&#34; link in any of the managing screens. This will bring you to a new screen where you&#39;ll see all the files you uploaded (if any) in your file section.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1373225690.png[/img][/center]\r<br />To upload a new file, simply click on the green &#34;ADD FILES&#34; button and this will bring you to this screen:\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1373225898.png[/img][/center]\r<br />For the file name, anything will do but try to use something that will sort alphabetically whenever you&#39;ll add a new update to your mod. Check how I named my files in my [url=http://skyrim.nexusmods.com/mods/33860/?tab=2&navtag=%2Fajax%2Fmodfiles%2F%3Fid%3D33860&pUp=1]TTRSO[/url] mod. As you can see, it&#39;s much easier to make sense of all my files when they&#39;re sorted alphabetically. My example mostly shows files within the &#34;Old versions&#34; category, but the principle applies to all categories.\r<br />\r<br />For the category, you have the choice between 5 types of files. The &#34;Main file&#34; category is used for the files that are essential to your mod. You can have more than one, some people put there the DLC add-ons or different colors for their textures, but I strongly advise you to make a custom NexusModManager (NMM) install script and include everything in 1 file instead. This will make your file much easier to install for NMM users and reduce the cluttering of the file section. The &#34;Update file&#34; category is used for the files that are incremental updates to your mod. Unless your mod exceed 200MB, I strongly advise to avoid this category entirely. [color=#fe2e2e]If your mod exceed 200MB and decide to have an incremental update file, you should provide an updated main file too[/color]. The &#34;Optional file&#34; category is used for files that aren&#39;t essential to your mod, but can offer options like alternative textures and DLC add-ons. Unless the size of those optional files is greater than 200MB, I would recommend you ignore this category and include everything in the main file with a custom NMM install script. The &#34;Old version&#34; category is pretty self-explanatory, I would suggest you to keep it to a minimum, but then again I&#39;m a big offender of this rule myself as I like to have a backup somewhere... Finally, the &#34;Miscellaneous&#34; category is for anything that doesn&#39;t fit into the previous categories.\r<br />\r<br />For the small description, enter something meaningful and be as clear as possible so people aren&#39;t left to guess what they should download. The greatest feature about this description is that it supports the BBCode I explained earlier&#33; That means that [color=#fe2e2e]you can use colors and if 255 characters isn&#39;t enough, you can use an image and fill it to your heart&#39;s content[/color]&#33;\r<br />\r<br />For file version, just enter the version of your file. I suggest you follow my suggestion to use a decent and logic numbering scheme for your version and stick to it. If you&#39;re uploading the latest version of your mod, be sure to check the checkbox to update your mod &#34;latest version&#34; information (this is what the NMM use to determine if there&#39;s a new update for your mod).\r<br />\r<br />Finally, be sure to [color=#fe2e2e]uncheck the checkbox &#34;Remove download with manager button&#34;[/color] unless your mod cannot be installed with NMM, which is pretty rare. It&#39;s very important for the success of your mod to offer the possibility of downloading with NMM because a lot of users will simply not bother with your mod if it could have been NMM compatible and it&#39;s not. Such is the burden of a mod author, you need to please your audience...\r<br />\r<br />When you&#39;re done, click on the green &#34;SUBMIT&#34; button. This will bring you to this screen:\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-3-1373225541.png[/img][/center]\r<br />You now have 2 choices. The first choice is to add more files, which allows you to repeat exactly what we just did. The second choice will bring you back to the image managing screen. Click on the first link and we&#39;ll see this screen again:\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1373225690.png[/img][/center]\r<br />If you want to delete a file, simply click on the appropriate link. As with images, if you want to update the file itself you&#39;re gonna have to delete the file and re-upload it, there&#39;s no workaround.\r<br />\r<br />Finally, if you want to edit the information of your file (mostly to transfer your files to the &#34;Old versions&#34; category), simply click on the appropriate link and you&#39;ll see a this screen:\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/35567-4-1373225541.png[/img][/center]\r<br />\r<br />[size=4][color=#ffcc33]14. Publish your mod[/color][/size]\r<br />Time to click on that big fat juicy green &#34;Publish&#34; button&#33;\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/35567-1-1373311773.png[/img]\r<br />In a few seconds, you&#39;re gonna see your file in the latest files for all the world to see. Congrats&#33;",
  "categoryId": "82",
  "version": "1.0.2",
  "author": "TheThirdRace",
  "createdUnix": "1379341918",
  "updatedUnix": "1379341635",
  "containsAdultContent": false,
  "uploadedBy": "TheThirdRace",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000055892",
      "name": "MPT",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "MPT-35567-.7z",
      "uploadedUnix": "1379341635",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/78772e9dbb35cb4a4ac9952d37c11609501ca6c2a8d82d9b24758176d837d045/analysis/1407725064/",
      "changelogHtml": " - Initial release to public <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MPT-35567-.7z?fid=1000055892&ttl=1535814171&ri=8192&rs=8192&setec=ee7a575ffba3a0488b1eaf68b852b25e"
    }
  ]
}