{
  "modId": 35598.0,
  "modName": "The Reserve II",
  "summary": "Located a short horseride east of Whiterun, The Reserve II is a player home meticulously designed for convenience and extravagant living. Featuring three main wings all branching from the center, it eliminates the burdon of confusing corridors, and provides the Dragonborn with all the essentials and more.",
  "descriptionHtml": "[color=#38a8e2][b][center]THE RESERVE II[/center][/b][/color]\r\n\r\n\r\n[color=#38a8e2][b]+++++++++++++++++++++++++\r\nSHORT DESCRIPTION\r\n+++++++++++++++++++++++++[/b][/color]\r\nLocated a short horseride east of Whiterun, The Reserve II is a player home meticulously designed for convenience and extravagant living. Featuring three main wings all branching from the center, it eliminates the burdon of confusing corridors, and provides the Dragonborn with all the essentials and more.\r\n\r\n\r\n[color=#38a8e2][b]+++++++++++++++++++++++++\r\nMAIN DESCRIPTION & FEATURES:\r\n+++++++++++++++++++++++++[/b][/color]\r\nThe Main Hall is the entrance, and also acts as the hub to get to each wing of the home. The high ceilings and windows to the outside sky were designed to feel open and refreshing. Depending on the time of day, the room is lit with warm sunshine, or soft blue moonlight. The Den is a furnished and warmly-lit bedroom with ample storage. It also has a closet, washroom, and two extra beds in the loft. The Forge is complete with all the tools an Adventurer needs, as well as a kitchen, bar, and dining area. Everything in The Forge is close at hand for quick and efficient crafting. The Atrium is a grand circular library with a small garden, study, and Alchemy/Enchanting tables.\r\n\r\nThe companion dog, Mocha, is textured and implemented after my RL dog who very recently had to be put down from bone cancer. I tried to remove the barking idle, but was unable to figure it out, so I do apologize if it gets annoying but she will not be removed from the mod. <3 See FAQ for more info.\r\n\r\n\r\n[color=#38a8e2][b]+++++++++++++++++++++++++\r\nFEATURES LIST:\r\n+++++++++++++++++++++++++[/b][/color]\r\n. Spacious open floor plan\r\n. Custom containers for your items instead of boring chests\r\n. Working bard, bartender/vendor, and 2 optional followers (a custom textured canine or your housecarl)\r\n. All tools needed for crafting\r\n. All shrines available for blessing of your choice\r\n. Enchanting and Alchemy tables with satchels\r\n. \\'Follower\\' room with multiple beds (only follower chests are not player owned)\r\n. Ample storage throughout (all containers are player-owned with NO respawns)\r\n. Fully navmeshed inside and outside; followers will follow you into and around the house\r\n. Display cases, weapon racks, plaques, mannequins\r\n. A bed to gain Rested bonus\r\n. Small garden with access to some herbs, carefully tended by your own Spriggan. (His sound file is removed to keep him quiet.)\r\n. Baby dragon in the alchemy wing\r\n. Scenic location with quick ride to Whiterun\r\n. And much more...\r\n\r\n\r\n[color=#38a8e2][b]+++++++++++++++++++++++++\r\nNOTICES / FAQ\r\n+++++++++++++++++++++++++[/b][/color]\r\n! This mod was cleaned with TES5Edit.\r\n\r\nQ: Can my spouse live here?\r\nA: Please use this mod with The Reserve to have your spouse live with you. (http://skyrim.nexusmods.com/downloads/file.php?id=11370)\r\n\r\nQ: Mannequins are moving or unequipted armor!\r\nA: This is very common with ANY house mod, and is a game bug, not a mod bug. I believe there are separate mod fixes for this.\r\n\r\nQ: Can my children live here?\r\nA: That would require my mod to be dependent on Hearthfire, so, no. Sorry!\r\n\r\nQ: Loralyn always walks away when I tell her to sing!\r\nA: She is on her way to go sing. She has to be standing on her \\\"marker\\\" to perform.\r\n\r\nQ: The dog is annoying the *#$% out of me.\r\nA: She is just set to \\\"protected\\\" not \\\"essential\\\" so you may ask her to follow you and take her out back \\'Old Yeller\\' style. Just dont tell me about it. :\\'(\r\n\r\n\r\n[color=#38a8e2][b]+++++++++++++++++++++++++[/b][/color]\r\n** IF YOU REMOVE THE HOUSE, YOU REMOVE THE ITEMS INSIDE. **\r\nIt is good practice to make a real save game (not a quick save), at least every few days and back these up in case something goes wrong.\r\n[color=#38a8e2][b]+++++++++++++++++++++++++[/b][/color]\r\n\r\n\r\n[color=#38a8e2][b]+++++++++++++++++++++++++\r\nHOW TO INSTALL\r\n+++++++++++++++++++++++++:[/b][/color]\r\n. If using Steam Workshop, simply press Subscribe\r\n. OR Extract the files from the download and copy them into the corresponding directories in your Skyrim folder. If the directories do not exist, simply create them. \\\"thereserve.esp\\\" goes in your Data folder and make sure it is checked in the Data popup of your Skyrim launcher.\r\n\r\n\r\n[color=#38a8e2][b]+++++++++++++++++++++++++\r\nHOW TO REMOVE:\r\n+++++++++++++++++++++++++[/b][/color]\r\n. Make [color=red]SURE you REMOVE everything[/color] from The Reserve before you uninstall, as the house will be removed from the game. You will lose your items unless you remove them. If using Steam Workshop, simply press Unsubscribe\r\n. OR Delete the files from your Data folder\r\n\r\n\r\n[color=#38a8e2][b]+++++++++++++++++++++++++\r\nOTHER:\r\n+++++++++++++++++++++++++[/b][/color]\r\nI recommend the use of HD flora and furniture mods such as \\\"Skyrim Flora Overhaul\\\", \\\"HD Furniture and Barrels\\\" with The Reserve, as they enhance the graphics of objects within the home.\r\n\r\nIf you find any bugs or graphical issues, Please bring them to my attention so they can be fixed. :)\r\n\r\nQuestions or comments about this mod or any of my projects can be sent to: lithxemods@gmail.com\r\n\r\n\r\n[color=#38a8e2][b]+++++++++++++++++++++++++\r\nKNOWN BUGS:\r\n+++++++++++++++++++++++++[/b][/color]\r\nNone.\r\n\r\n\r\n[color=#38a8e2][b]+++++++++++++++++++++++++\r\nUPDATE LOG:\r\n+++++++++++++++++++++++++[/b][/color]\r\nCurrent Release 1.2\r\n. Added a small room and beds for followers\r\n. Fixed possible crash bug from texture path\r\n. Made bard Protected instead of Essential so she is killable only by player\r\n\r\n1.1\r\n. Fixed two backwards chests\r\n. Ficked flickering on wall next to keg\r\n. Fixed custom container bug that sometimes caused items to dishevel\r\n\r\n1.0\r\n. Release The Reserve II",
  "categoryId": "67",
  "version": "1.2",
  "author": "Lithxe",
  "createdUnix": "1367647513",
  "updatedUnix": "1367832801",
  "containsAdultContent": false,
  "uploadedBy": "lithxe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028401",
      "name": "The Reserve II__MAIN FILE_1-2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4926",
      "fileName": "The Reserve II__MAIN FILE_1-2-35598-1-2.zip",
      "uploadedUnix": "1367832801",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/64fe1c10cb177898e63c10fe1c4e470fe1c8ece04c631cf81049704f30fa670a/analysis/1407557571/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Reserve%20II__MAIN%20FILE_1-2-35598-1-2.zip?fid=1000028401&ttl=1535814218&ri=8192&rs=8192&setec=0cf17b94dc620b5dc49f0a001f0fdc91"
    }
  ]
}