{
  "modId": 35596.0,
  "modName": "Chronicles of the Fallen Order",
  "summary": "An epic adventure for the ages! Traverse the whole of expanse of Skyrim and beyond, seeking the secret history behind the enigmatic Fallen Order and their eons-long crusade to keep the truth hidden from the world.\r\n\r\nGo forth, brave dovahkiin!\r\nStand tall and shake the heavens!",
  "descriptionHtml": "*** Story ***\r\nSince the dawn of Time, the Fallen Order has been a key player in the shaping of the history Skyrim, Tamriel, the whole of Nirn. In recent ages, they\\'ve been disregarded as mere myths; even in the mystical lands of Tamriel, most doubt their existence.\r\n\r\nBut now, they\\'ve come to Skyrim in force; scouring the lands for what appears to be one mortal. Rumour is that they seek the dovahkiin of prophecy, and now fate has decreed the dovahkiin shall find them.\r\n\r\nGo forth, brave dovahkiin!\r\nStand tall and shake the heavens!\r\n\r\n\r\n*** Mod Description ***\r\n[b]NOTE: STILL UNDER CONSTRUCTION![/b]\r\nConsider the current state of this mod to be little more than a preview of what will be the final product. It\\'s not quite right calling it \\\"Chronicles\\\" of anything just yet, but the groundwork is currently being laid for the much larger adventure. The current release is a meager 1% of what\\'s planned, and that could be quite generous.\r\n\r\nYeah... I just couldn\\'t contain myself for letting out this little preview. Back to the mod!\r\n\r\n\\\"Chronicles of the Fallen Order\\\" (aka: CotFO) will be a massive adventure, clocking in at a substantial 45 dungeons. This will include a rebuilt and re-tuned version of my last major mod project, \\\"Sanctum of the Fallen\\\" (aka: SotF); the size and scale of that particular dungeon could be a good rough indication of what my plans are for a typical dungeon in CotFO. I\\'ll let people put the pieces together on that one.\r\n\r\nAs for a little story behind that, this mod stems from the rather lacking story in SotF; it was shoe-horned in at the end, but it made for an interesting idea which I feel could use a lot more development and even some follow-through. Following several months of lore research, attempts at planning, and so on... it\\'s time to start putting the mouse to the CK and building it.\r\n\r\n*** Current Release ***\r\n- 1 dungeon, the \\\"Watchtower of the Fallen Order\\\". Located just outside Whiterun. Access requirement is to take the key from the \\\"Seeker of the Watchtower\\\". The version available in the mod is roughly HALF of the final size of this dungeon. The non-optional half, that is; the seven \\\"watchtower prisons\\\" you can peek into will eventually lead to the 28 \\\"sin dungeons\\\".\r\n\r\n*** Development Plans ***\r\n- 45 dungeons total, with 15 devoted to the \\\"central plot\\\" of the mod. 28 are optional, thematic dungeons based off of the Seven Deadly Sins; much like those seen in SotF, and four each (still some access requirements). The remaining two are \\\"bonus dungeons\\\", for the eternal challenge seekers... and the perfect place to unleash the most overpowered abilities I can devise. The rebuild of SotF will be part of the \\\"central plot\\\" of the mod, but will NOT be the final dungeon.\r\n- Something of a semi-coherent, but entirely optional, plot-line. It will largely be told via books enemies will drop, or placed within the many dungeons; some mis-en-scene storytelling will be used as well. The idea is for the player to slowly pick up the pieces of the story and eventually put it all together.\r\n- Integrating the mod throughout Skyrim, with various enemies from the mod scattered in the landscape. Nothing too brutally difficult (gets a bit out of control otherwise), but the idea is for it NOT to be restricted into some back-corner of the game world.\r\n- Much better world locations than SotF. The watchtower was built with this specifically in mind.\r\n- Significantly better balance and smoother difficulty progression than SotF... the watchtower still requires a bit of tuning in this area, but isn\\'t anywhere near as harsh.\r\n- Some very unique and creative boss encounters. I\\'ve got quite a few ideas in this department.\r\n\r\n\r\nBest of luck, little dovahkiin!",
  "categoryId": "35",
  "version": "ALPHA.v0.01",
  "author": "Lord Thauron",
  "createdUnix": "1367643176",
  "updatedUnix": "1367642909",
  "containsAdultContent": false,
  "uploadedBy": "LordThauron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000027913",
      "name": "Watchtower of the Fallen Order",
      "version": "ALPHA.v0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "399",
      "fileName": "Watchtower of the Fallen Order-35596-ALPHA-v0-1.7z",
      "uploadedUnix": "1367642909",
      "modVersion": "ALPHA.v0.1",
      "virusScanUrl": "https://www.virustotal.com/file/513fcc261b8d54af94a50cf554d3f10397cf4f682a71f0618b9ab41a4102f9fc/analysis/1407553506/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Watchtower%20of%20the%20Fallen%20Order-35596-ALPHA-v0-1.7z?fid=1000027913&ttl=1535814216&ri=8192&rs=8192&setec=a16c573f681af28df7cc886cd1c05fb1"
    }
  ]
}