{
  "modId": 3560.0,
  "modName": "FIX for non displayed accented characters in Skyrim - French",
  "summary": "OBSOLÈTE depuis la mise à jour 1.3.1.0 \r\n",
  "descriptionHtml": "[center][size=\\\"5\\\"] Ce fix est rendu OBSOLÈTE par la mise à jour de Skyrim 1.3.1.\r\nVous pouvez restaurer les fichiers strings d\\'origine.\r\nIl n\\'y a plus aucune raison de télécharger ce fix.[/center]\r\n\r\n[quote]\r\nUpdate 1.3.1 Notes (all platforms unless specified)\r\n\r\nSupport for 4-Gigabyte Tuning (Large Address Aware)\r\n[b]Fixed issue with accented characters not displaying properly at the end of a line[/b]\r\nGeneral stability improvements\r\nOptimize performance for Core 2 Duo CPUs (PC)\r\nFixed Radiant Story incorrectly filling certain roles\r\nFixed magic resistances not calculating properly\r\nFixed issue with placing books on bookshelves inside player purchased homes\r\nFixed dragon animation issues with saving and loading\r\nFixed Y-look input to scale correctly with frameratecomme indiqué dans le log[/quote]\r\n\r\n\r\n\r\n\r\n[color=\\\"#8B0000\\\"][b]FIX pour les caractères accentués non affichés[/b][/color][/size][size=\\\"3\\\"]        par Abribus[/size]\r\n\r\n[size=\\\"3\\\"]Ce fix rétablit l\\'affichage des caractères accentués qui avaient disparu suite à l\\'application du dernier patch pour Skyrim.\r\n\r\nIl ne rétablit pas, hélas, l\\'affichage des caractères accentués situés dans le nom que vous attribuez à votre personnage ni dans les noms que vous donnez aux divers objets enchantés par vos soins (merci à Amras Anarion pour cette précision).\r\n\r\nAutopromotion :\r\n[url=http://www.skyrimnexus.com/downloads/file.php?id=4277]\\\"Headbomb\\'s Better Sorting\\\" version française[/url], pour une meilleure organisation des objets de l\\'inventaire.\r\n\r\nAutres modules francophones de qualité sur le Skyrim Nexus: ;)\r\n[url=http://www.skyrimnexus.com/downloads/file.php?id=409]SLFC French localization[/url]. Pour un jeu en français intégral.\r\n[url=http://www.skyrimnexus.com/downloads/file.php?id=1438]Arrowsmith - French translation[/url] Fabrication de flèches.\r\n[url=http://www.skyrimnexus.com/downloads/file.php?id=73]Roadsigns - French translation[/url] Panneaux d\\'indication en français.[/size]\r\n_____________________________________________________________________________________________________________________\r\n< 14/12/2011 1:00 >\r\n\r\n1.0.2 : Modification de CLOUTé en CLOUTÉ dans l\\'interface de forge. Merci à BananaSplit-84 de m\\'avoir rapporté cette erreur.\r\n\r\n1.0.1  : Dorénavant compatible avec le Nexus Mod Manager. \r\n\r\n1.0    : Version initiale.\r\n_____________________________________________________________________________________________________________________\r\n\r\n[color=\\\"#8B0000\\\"][size=\\\"3\\\"]1. Installation & Désinstallation.[/size][/color]\r\n\r\n[b][u]1.1. Sauvegarde des fichiers originaux.[/u][/b]\r\n\r\nAvant toute chose, faites une copie de sauvegarde (ou déplacez) les trois fichiers remplacés par le fix :\r\n\r\n\\\\skyrim\\\\Data\\\\Strings\\\\Skyrim_French.DLStrings\r\n\\\\skyrim\\\\Data\\\\Strings\\\\Skyrim_French.strings\r\n\\\\skyrim\\\\Data\\\\Strings\\\\Update_French.STRINGS\r\n\r\nUne simple précaution, au pire vous devrez faire une \\\"Vérification de l\\'intégrité du cache du jeu\\\" pour vous les voir restaurés mais les serveurs de Steam ne sont pas toujours disponibles.\r\n \r\nDe même, si vous lancez une \\\"Vérification de l\\'intégrité du cache du jeu\\\" pour une tout autre raison, les trois fichiers du Fix seront remplacés puisque non identiques à ceux dont Steam dispose sur ses serveurs. Faites en donc une copie.\r\n\t\r\n[u][b]1.2. Installation.[/b][/u]\r\n\t\r\nExtraire les trois fichiers du fix dans \\\\skyrim\\\\Data\\\\Strings\\\\ .\r\n\t\r\n[u][b]1.3. Désinstallation[/b][/u]\r\n\t\r\nRemplacez les trois fichiers du fix par ceux que vous avez, préalablement, sauvegardés.\r\n\r\nSkyrim_French.DLStrings | Skyrim_French.strings | Update_French.STRINGS\r\n\r\n[color=\\\"#8B0000\\\"][size=\\\"3\\\"]2. Bugs connus.[/size][/color]\r\n\r\nPas de bugs rencontrés, pour ma part, après quelques heures de jeu mais l\\'ajout d\\'un espace en fin de ligne se voit parfois.\r\n\t\r\n[color=\\\"#8B0000\\\"][size=\\\"3\\\"]3. Notice technique.[/size][/color]\r\n\r\nBrièvement, comment j\\'ai procédé et grâce à quoi pour rassurer sur l\\'innocuité du machin. :)\r\n\t\r\nLes fichiers STRINGS et dérivés sont des fichiers texte compilés (transformés pour pouvoir communiquer efficacement avec la base de données principale : Skyrim.esm), ce qui interdit leur modification efficace à partir d\\'un éditeur de texte. Ce que j\\'ai malgré tout tenté de faire, en ajoutant un espace à la fin de chaque libellé dont le dernier caractère était accentué, avec des résultats désastreux (caractères bizarres sur la page principale et plantage lors du lancement d\\'une sauvegarde). \r\n\t\r\nCes fichiers contiennent l\\'intégralité des données textuelles du jeu (livres, dialogues, noms des objets, journal etc...) contrairement aux précédents jeux Bethesda où ces données étaient contenues dans les fichiers ESM. Néanmoins il reste possible de modifier ces données en créant des fichiers ESP (à partir du Skyrim.esm ouvert avec le TESsnip du Fallout Mod Manager puis exporté vers FNVEdit, plus pratique) dont les données outrepasseront/remplaceront (override) celles des fichiers STRINGS et en utilisant la console en jeu ou les différentes listes d\\'objets sur internet mais ce n\\'est pas super pratique et c\\'est surtout très long.\r\n\t\r\nHeureusement, je suis tombé, un peu par hasard, sur la page de JPmod qui après déterminé comment les fichiers STRINGS étaient compilés (voir le lien de son blog ci-dessous) a crée deux outils en lignes de commandes. Le premier m\\'a permis de décompiler les fichiers en format csv (texte), avec un libellé par ligne, que j\\'ai pu facilement éditer avec Notepad++ et ses outils de recherche puissants et pratiques. \r\n\r\nJ\\'ai tout simplement mis un espace entre le dernier caractère et le symbole spécial [CR][LF] de fin de ligne quand celui-ci était un caractère accentué : cela fait 536 occurrences au total (dont 501 pour le seul \\\"Skyrim_French.strings\\\"). J\\'ai vérifié au cas par cas mais l\\'opération totale n\\'a duré guère plus qu\\'une heure. J\\'ai ensuite recompilé en STRINGS et DLSTRINGS les fichier CSV modifiés avec le second outil.\r\n\t\r\n[size=\\\"3\\\"][color=\\\"#8B0000\\\"]4.  Remerciements.[/color][/size]\r\n\r\nJPmod (programmeur Japonais) pour sa courtoisie, pour ses outils (StringsUnpacker et StringsPacker) et pour avoir passé du  temps, ces derniers jours, à les adapter pour les rendre accessibles aux non-japonophones (le readme en langue anglaise date d\\'hier : le 11/12).\r\n\t\r\n[url=http://jpmod.blogspot.com/2011/11/skyrim-strings-file-tool.html#comment-form][size=\\\"2\\\"]Son blog en VO (Japonais), commentaires en anglais[/size][/url]\r\n\r\n[url=http://sites.google.com/site/jpmodfiles/localize/skyrim][size=\\\"2]La page source de ses outils[/size][/url]",
  "categoryId": "95",
  "version": "1.0.2",
  "author": "Abribus",
  "createdUnix": "1323787544",
  "updatedUnix": "1323787544",
  "containsAdultContent": false,
  "uploadedBy": "Abribus",
  "primaryFile": null,
  "files": []
}