{
  "modId": 35660.0,
  "modName": "Your Market Stall - Dein Marktstand - German - Deutsch",
  "summary": "Eroeffne Deinen eigenen Marktstand und verkaufe Deine ueberfluessige Beute... als Schnaeppchen oder zieh dem Kunden das Gold aus der Tasche! Mit deutscher Beschreibung. \r\nNMM-Installer (FOMOD) mit Versionstracker. Originalmodifikation by wgstein.",
  "descriptionHtml": "[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/hXQSy.png[/img][/url][/center]\r\n\r\n[b][color=red]Der originale Mod ist nicht erforderlich.[/b][/color]\r\nVielen Dank an wgstein für die Erlaubnis zum Übersetzen des  [url=http://www.skyrim.nexusmods.com/mods/35305]Originals[/url].\r\n\r\n[color=yellow]Wenn ihr meine Übersetzung gut gelungen findet, dann gebt mir bitte gerne ein Endorsement. In jedem Fall sollte der Ersteller für das [url=http://www.skyrim.nexusmods.com/mods/35305]Original[/url] ein Endorsement bekommen. Vielen Dank![/color]\r\n\r\n[b][color=red]VOR DER INSTALLATION:[/b] \r\n\r\nDiese Modifikation benötigt [url=http://skse.silverlock.org]SKSE[/url].[/color]\r\n\r\n[b]Installation/Upgrade[/b]\r\n\r\n[color=yellow]V1.2 nach 1.4: Einfach die neue Version über die bisherige installieren.[/color]\r\n[color=yellow]V1.0/1.1 nach 1.2: Ein \\'Clean Save\\' ist erforderlich.[/color]\r\n\r\n1. Alle Marktstände abbauen, Spielstand sichern.\r\n2. Modifikation deinstallieren, Spielstand laden und erneut sichern.\r\n3. Modifikation installieren. Fertig.\r\n\r\n[u][b]Neu in Version 1.3/1.4[/b][/u]\r\n\r\n1.4: Dein Gefährte betreibt den Stand nun auch dann, wenn Du weit weg reist (Andere Weltzonen)\r\n1.3: Preise von Vanilla und MOD-verzauberten Gegenständen angepasst. Fehlerfixe.\r\n\r\n[u][b]Neu in Version 1.2[/b][/u]\r\n\r\nMit einem Follower kannst Du jetzt auch delegieren. Warum selbst rumsitzen und sich mit Kunden rumärgern wenn das auch Dein Follower kann?\r\n\r\n\r\n[heading]Dein Marktstand[/heading]\r\n\r\n[u][b]Was ist dies für eine Modifikation?[/b][/u]\r\n\r\nMit diesem Mod kannst Du einen Marktstand wie auf einem Flohmarkt eröffnen und Waren an NPC verkaufen. Du kannst den Betrieb eines Markstandes auch an einen Follower delegieren.\r\n\r\nNPC, die an Deinem Marktstand vorbeispazieren, werden manchmal stehenbleiben und sich Deine Ware ansehen und einkaufen. Dabei kannst Du mehr verdienen als bei einem Verkauf an einen Händler, denn Du verkaufst ja direkt an den Kunden und kannst den Gewinn selbst einstreichen.\r\n\r\nErwarte dabei aber nicht zuviel - denn natürlich kannst Du als Drachenblut schneller zu Gold kommen, wenn Du Abenteuerbeute an Händler verkaufst und Dich gleich in den nächsten Kampf stürzt. Aber... der Marktstand hat mehr Flair und manchmal ist es doch ganz schön, sich einen Augenblick niederzulassen und dem Markttreiben zuzusehen und ein wenig zu verdienen, oder?\r\n\r\n[u][b]Vorgehensweise[/b][/u]\r\n\r\n[list=1]\r\n[*]Erstelle einen \\'Marktstand\\' an einer Schmiede, es werden 6 Feuerholz, 3 Leinentücher oder 3 Leder, und 2 Eisenbarren benötigt.\r\n[*]Lege den Marktstand an einem erfolgversprechenden Platz ab. Ein Stuhl, eine Truhe und ein Teppich werden dann automatisch vor Dir platziert.\r\n[*]Stelle Deine Waren zusammen: Wähle den Marktstandstuhl aus und wählen dann \\'Ware verwalten\\'. Die ersten 8 Waren werden auf dem Teppich ausgestellt.\r\n[*]Wenn Du soweit bist, dann wähle erneut den Stuhl aus und wähle nun \\\"Stand Öffnen\\\" aus. Du wirst Dich dann auf den Stuhl setzen und kannst nun auf Kunden warten.\r\n[*]Wenn Kunden an Deinen Stand kommen und etwas interessantes finden, wird die Preisverhandlung starten. Verhandlung ist die voreingestellte Verkaufsart.\r\n\r\n[list]\r\n[*]Akzeptieren\r\nDu verkaufst die Waren zum vom Kunden gebotenen Preis. Dieser Preise ist Deine Einnahme und entspricht etwas 90% des Verkaufspreise bei einem Händler. Dabei sind bereits 10% Marktsteuer für den regierenden Jarl abgezogen. Gleichzeitig erhältst Du Erfahung im Talent \\'Redekunst\\'.\r\n[*]10% Nachlass\r\nDu gewährst dem Kunden 10% Nachlass. Dieser Nachlass wird Deinen Ruf steigern und sorgt dafür, das Deine Waren mehr Kunden anziehen. Gleichzeitig erhältst Du Erfahung im Talent \\'Redekunst\\'.\r\n[*]Ablehnen\r\nDu lehnst den angebotenen Preis ab. Der Kunde wird dann entweder die Verhandlung abbrechen oder ein etwas höheres Angebot machen. Wenn der Verkauf nicht zustande kommt, wird sich dies negativ auf Deinen Ruf auswirken. Erfahrung in Redekunst wird für [b]jedes neue Preisangebot durch den Kunden[/b] gewährt.\r\n[/list]\r\nDie Verhandlungsbasis für die Preisfindung kann in den Optionen eingestellt werden.\r\n[/list]\r\n\r\n[u][b]Was macht diese Modifikation nicht?[/b][/u]\r\n\r\n[list]\r\n[*]Diese Mod bietet nur den Marktstand, keine Gebäude, Tische und so weiter. Wähle den Platz für Deinen Marktstand sorgfältig aus.\r\n[*]Es gibt kein Handelsbuch, aus denen man den Profit ablesen kann. Auch das Trennen der Geschäftskasse und dem privaten Goldbeutel ist nicht möglich. Merke Dir also Deinen Goldbestand bevor Du Deinen Marktstand eröffnest, dann kannst Du nachher den Erfolg am Füllstand Deines Goldbeutels ablesen.\r\n[*]Es gibt keine Anforderungen, die örtliche Verwaltung um eine Handelsgenehmigung zu bitten. Du bezahlst 10% Steuern für Deine Geschäfte und das ist es dann auch.\r\n[*]Nicht jeder Passant ist ein Kunde. Es kann Handel mit NPC getrieben werden, die Dir feindlich gesinnt sind. Auch Deine Gefährten werden nicht bei Dir einkaufen. Kunden sind Wachen, Einwohner und Reisende.\r\n[/list]\r\n\r\n[u][b]Aufmerksamkeit bei Kunden erzeugen[/b][/u]\r\n\r\nKunden werden auf Deinen Markstand möglicherweise aufmerksam werden, wenn mindestens eine der folgenden Voraussetzungen gegeben ist. Je mehr Voraussetzungen gegeben sind, desto mehr Kunden werden kommen:\r\n\r\n[list]\r\n[*]Es gibt viele Passanten oder es stehen viele NPC beisammen.\r\n[*]Deine Redekunst ist hoch.\r\n[*]Die Redekunst der Passanten ist hoch.\r\n[*]Dein Ruf ist hoch.\r\n[/list]\r\n\r\nKunden werden in Verhandlungen treten, wenn mindestens eine der folgenden Voraussetzungen gegeben ist. Je mehr Voraussetzungen gegeben sind, desto mehr Kunden werden einen Einkauf in Betracht ziehen:\r\n\r\n[list]\r\n[*]Die Stufe des Kunden ist hoch.\r\n[*]Der Kunde trägt feine Kleidung oder wertvolle Rüstung.\r\n[*]Der Kunde hat viel Gold.\r\n[*]Die angebotenen Waren passen zu den Wünschen und Fertigkeiten des Kunden.\r\n[*]Deine Ware ist günstig.\r\n[/list]\r\n\r\n[u][b]Delegation[/b][/u]\r\n\r\nNun kannst Du auch einen Follower mit dem Betrieb eines Marktstandes beauftragen. Genau EINEN Follower.\r\n\r\n1. Eröffne den Marktstand wie gewohnt.\r\n2. Frage einen Follower danach, ob er den Stand übernehmen kann.\r\n\r\nUm den Stand wieder selbst zu übernehmen, spreche Deinen Follower an und sage, dass Du den Marktstand wieder übernehmen willst. Alles muss man selbst machen...\r\nDein Follower wird den Markstand zwischen 08.00 Uhr und 20.00 Uhr betrieben.\r\n\r\n\r\n[u][b]Optionen[/b][/u]\r\n\r\n- Marktstandsstuhl-Menü\r\n\r\n[list]\r\n[*]Öffne Stand - Dein Marktstand wird geöffnet und Du setzt Dich hin. Stehst Du wieder auf, wird der Stand geschlossen.\r\n[*]Einpacken - Du packst alle Waren wieder ein und baust den Stand ab. Die Waren findest Du dann wieder in Deinem Inventar.\r\n[*]Preis: xxx - Voreingestellte Option für die Preisfindung.\r\n[*]Abbrechen - Menü schließen, nichts passiert.\r\n[/list]\r\n\r\n- Preis-Menü\r\n\r\n[list]\r\n[*]Immer verhandeln\r\nWenn ein Kunde etwas kaufen will, wird immer verhandelt. Du kannst jedesmal entscheiden, ob Du zu einem durchschnittlichen/geringeren/höheren Preis verkaufen willst.\r\n[*]Durchschnitt\r\nDu verkaufst immer zum normalen Preis (wie oben beschrieben). Es erfolgt keine weitere Verhandlung.\r\n[*]10% Nachlass\r\nDu verkaufst mit 10% Nachlass zum normalen Preis. Dein Ruf wird sich dadurch erhöhen.\r\n[*]Höchstmöglich\r\nDu versucht zu einem höheren Preis als normal zu verkaufen. Dabei wird es häufig zum Abbruch der Kaufes kommen, immerhin besteht die Möglichkeit die Redekunst zu steigern. Trotzdem wird dadurch möglicherweise Dein Ruf leiden.\r\n[/list]\r\n\r\n[u][b]Auswirkung auf das Talent Redekunst[/b][/u]\r\n\r\nDeine Redekunst beeinflusst in geringem Maße die Möglichkeit einen Kunden anzulocken.\r\nMit Redekunst über Stufe 30 weisst Du, was die Kunden suchen. Das ist hilfreich bei der Warenauswahl.\r\nMit Redekunst über Stufe 60 entwickelst Du ein Gespür dafür, ob ein Kunde Deinen Stand besuchen wird.\r\n\r\nDie Erfahrung für Redekunst wird auf Basis des Preise berechnet, dem ein Kunde zugestimmt hat oder der Ausgangswert für weitere Verhandlungen ist. Wenn der Kunde die Verhandlungen abbricht, basiert die gewonnene Erfahrung auf 20% des angezeigten Preises.\r\n\r\n[u][b]Der Marktstand im Spiel (Englisch)[/b][/u]\r\n\r\n[youtube]5NNIpwhR66o[/youtube]\r\n\r\n[u][b]Versionsgeschichte[/b][/u]\r\n\r\n2013.4.26 - 1.0: Fixed several messaging bugs. Totally rebalanced.\r\n2013.4.25 - N/A: First Edition.",
  "categoryId": "78",
  "version": "1.4",
  "author": "Thoddy398 - Orig by wgstein",
  "createdUnix": "1367704904",
  "updatedUnix": "1371061595",
  "containsAdultContent": false,
  "uploadedBy": "Thoddy398",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028133",
      "name": "Your Market Stall - Dein Marktstand",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "338",
      "fileName": "Your Market Stall - Dein Marktstand-35660-1-0.rar",
      "uploadedUnix": "1367704740",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2448279e65c722e798c633fa2c73834a1312ef4ca49b46b7ad80124af8fc5c75/analysis/1407555143/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Your%20Market%20Stall%20-%20Dein%20Marktstand-35660-1-0.rar?fid=1000028133&ttl=1535814329&ri=8192&rs=8192&setec=a4b7226c5bd2955b1392315b8b9fe2fe"
    },
    {
      "fileId": "1000028228",
      "name": "Your Market Stall - Dein Marktstand",
      "version": "1.001",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "338",
      "fileName": "Your Market Stall - Dein Marktstand-35660-1-001.rar",
      "uploadedUnix": "1367749721",
      "modVersion": "1.001",
      "virusScanUrl": "https://www.virustotal.com/file/1bdf28e733e331989a25b4167398d22ea85ec92fc0e9014191dcf7690cdc82e0/analysis/1407555723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Your%20Market%20Stall%20-%20Dein%20Marktstand-35660-1-001.rar?fid=1000028228&ttl=1535814330&ri=8192&rs=8192&setec=edbe3bbd384a89dd3fa5e3cbadffc873"
    },
    {
      "fileId": "1000029249",
      "name": "Your Market Stall - Dein Marktstand",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "308",
      "fileName": "Your Market Stall - Dein Marktstand-35660-1-2.rar",
      "uploadedUnix": "1368239513",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/5afd96e55248cf76191288ffad8996f424a61e242b38b5b94b6194dad6750496/analysis/1407564542/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Your%20Market%20Stall%20-%20Dein%20Marktstand-35660-1-2.rar?fid=1000029249&ttl=1535814330&ri=8192&rs=8192&setec=2a11b05bad14177ea7eb66e8e50804e7"
    },
    {
      "fileId": "1000033970",
      "name": "Your Market Stall - Dein Marktstand",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "355",
      "fileName": "Your Market Stall - Dein Marktstand-35660-.rar",
      "uploadedUnix": "1371061595",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c96c86fb9b8ae10948518cda5569187a7f1f47cdb5101f0c418c78f9aa232d49/analysis/1407601329/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Your%20Market%20Stall%20-%20Dein%20Marktstand-35660-.rar?fid=1000033970&ttl=1535814331&ri=8192&rs=8192&setec=93c862959a996db2da623d1168ceca87"
    }
  ]
}