{
  "modId": 35686.0,
  "modName": "Targeted Mayhem - Thieves Guild Quests",
  "summary": "Allows you to choose which city Thieves guild quests occur in, and allows you to collect and hand in the quests at local inkeepers.",
  "descriptionHtml": "Have you ever started a new playthrough and intended to do the thieves guild questline again, but decided against doing the radiant quest parts because of the sheer amount of trekking back and forth? Does save scumming/drop and retake over and over to get a quest in the right hold sound boring to you? Then this mod is for you.\r\n\r\nTargeted Mayhem adds an MCM menu that allows you to choose which hold Delvin and Vex will give you thieves guild quests in, if you are getting the quests directly from them, and it adds a dialogue option to innkeepers in the five main cities to check/send mail allowing you to receive/hand in thieves guilds quests in that hold directly.\r\n\r\nNote that this only affects the radiant quests, the you cannot receive the special jobs this way, you must travel back to the thieves guild for that.\r\n\r\n===Requirements===\r\n\r\nRequires SkyUI, SKSE and a legal, up to date copy of Skyrim.\r\n\r\n===Compatibility===\r\n\r\nAnything that makes edits to the thieves guild radiant quests would break the hold selection functionality if placed below Targeted Mayhem in your load order. Anything that makes edits to TGRShell (the quest that manages the radiant quests) would break the innkeeper functionality if placed below Targeted Mayhem in your load order.",
  "categoryId": "79",
  "version": "2.0",
  "author": "MGoods",
  "createdUnix": "1367763810",
  "updatedUnix": "1367763386",
  "containsAdultContent": false,
  "uploadedBy": "MGoods",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028250",
      "name": "Targeted Mayhem v 2_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Targeted Mayhem v 2_0-35686-2-0.rar",
      "uploadedUnix": "1367763386",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/4b027a4cfec478cf20d1af7883f071ce9886027975376149ab4cfd9ba6e28829/analysis/1407556026/",
      "changelogHtml": " Inital Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Targeted%20Mayhem%20v%202_0-35686-2-0.rar?fid=1000028250&ttl=1535814385&ri=8192&rs=8192&setec=0f2b36e8eeb9e65797063d73fb46b6ba"
    }
  ]
}