{
  "modId": 35689.0,
  "modName": "Be Saruman The Wise _ The White Wizard",
  "summary": "Play Skyrim as Saruman, The White Wizard with his look and equipment with SARUMAN\\'S EQUIPMENT MOD!",
  "descriptionHtml": "*******\r\nPlot:\r\n*******\r\nAfter Saruman’s betrayal to the free people of middle earth as the head of the Istaries, He was banished from middle earth, But he was not gone. Pretty much like Gandolf, Saruman has been given another chance to fulfill his duty as one of the Istaries, but not in middle earth this time. Middle earth had Gandolf the white. \r\nThis time Skyrim is in dire need of a white wizard  in order to save it from its calamities. Just like Gandolf, Saruman has returned much more powerful with a gift from the gods themselves which is his Voice. Now he is ready to fight again in Tamriel for the better or worse…\r\n\r\n\r\n*************************************\r\nSupplementary Information\r\n*************************************\r\nThis mod brings Saruman’s Equipment to Skyrim which are White Robe, White Boots and Saroman’s Satff which has unique textures and is capable of summoning Ice Storm like in the story and movies.(After all It was Saruman’s Spell of Snow Storm which forced Gandolf to refuge to the mines of Moria.)\r\nIf you are looking to virtually become Saruman instead of just putting on his robe, I recommend using my Save Files which is located in the optional part of the download section. He is  a Nord with the look of Saruman himself. I know it doesn’t look exactly like Saruman, but I believe it’s the closest face for Saruman possible with the Skyrim face editor. The save files put your Saruman character at Helgan and if used in conjunction of Saruman’s equipment mod, you have Saruman’s equipment right from the very beginning.\r\nIf you prefer to use your own save files, you can acquire Saruman’s equipment by traveling to \\\"Bleak Falls Burrow\\\". You find the chest containing Saruman\\'s Equipment by the entrance door right after entering the dungeon.\r\n\r\nPS: For those of you who are still wondering and asking who the hell is Saruman anyway: He is the main antagonist of The Lord of the Rings: Two Towers Movie and Novel. \r\n\r\n\r\n********************\r\nRequirements:\r\n********************\r\nNothing, if you are using only the equipment. However if you are going to use the save file with the look of the Saruman, You are going to need these:\r\n- Latest Skyrim Update\r\n- Enhanced Character Edit Mod on Nexus\r\n- Cloaks of Skyrim (Optional)\r\n- ApachiSkyHair v 1.5 (Optional)\r\n\r\n\r\n\r\n****************\r\nInstallation:\r\n****************\r\nSaruman\\'s Equipment: Download and extract the main file in the download section. Then copy all the files in Data directory where you have installed skyrim. Make sure Saruman\\'s Equipment.esp is selected in the Data Files of Skyrim launcher.\r\n\r\nSave Files: Download and extract the optional files in the download section. then put both files in following directory if you are using SKSE or put only ESS file if you don\\'t have SKSE.\r\n\r\nDocument>MyGame>Skyrim>Saves\r\n\r\n\r\n**********************************************************************************\r\nAlso see my other works:\r\n\r\nBE THE DARK LORD VOLDEMORT OF HARRY POTTER SERIES.(http://skyrim.nexusmods.com/mods/34861//?)\r\n**********************************************************************************",
  "categoryId": "36",
  "version": "1",
  "author": "db2538",
  "createdUnix": "1367896024",
  "updatedUnix": "1367895980",
  "containsAdultContent": false,
  "uploadedBy": "db2538",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028547",
      "name": "Equipment",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2147",
      "fileName": "Equipment-35689-1.rar",
      "uploadedUnix": "1367895717",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0e12f3a5fa9fd632bc8d9638aca27dc2c8970e660c78343dcecea1316fa110f9/analysis/1407558662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equipment-35689-1.rar?fid=1000028547&ttl=1535814392&ri=8192&rs=8192&setec=e6c7f0a94a1d5aaa1d64421326ea19ea"
    },
    {
      "fileId": "1000028549",
      "name": "Saves",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1409",
      "fileName": "Saves-35689-1.rar",
      "uploadedUnix": "1367895980",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/73507f0f905726e6caf3971fd4c7c8affcf087b9eefe47ed922dc93f6ba74a10/analysis/1407558663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saves-35689-1.rar?fid=1000028549&ttl=1535814392&ri=8192&rs=8192&setec=5f1756051f3d830e7ff7e49d6517fea6"
    }
  ]
}