{
  "modId": 35683.0,
  "modName": "Choose your Path- Standalone HD Miraak and Cultist Sets",
  "summary": "Now you can get standalone versions of Rafuels HD Miraak and Cultist Sets, wich are craftable on the Skyforge and temprable on workbenches.",
  "descriptionHtml": "DISCLAIMER: DESCRIPTION CONTAIN SPOILERS. READ IT ONLY IF YOU END THE DRAGONBORN QUEST. \r\nThis is a Nexus Exclusive Mod, don\\'t reupload it anywhere!\r\n\r\nHighly recommended for the Disciple of Talos:\r\nEzEs -Artifact Disenchanting- by xEightballx\r\nhttp://www.skyrim.nexusmods.com/mods/8157/\r\n\r\n[center][IMG]http://imageshack.us/a/img22/192/wichpathpng.png[/IMG]\r\n[IMG]http://imageshack.us/a/img801/7867/standalonecultistmiraak.png[/IMG]\r\n[/center]\r\n\r\n\r\nAfter the great battle in Apocrypha the Dovahkiin had to take the great decision:\r\nServing the Daedric Powers and become a tool for the purpose of Herma Mora or redeem the action of Miraak and use the Thu\\\\\\\\\\\\\\'um for the benefit of Tamriel?\r\n\r\n[center][IMG]http://imageshack.us/a/img593/6346/robetalos.png[/IMG][/center]\r\n\r\nAfter the battle against the First Dragonborn the Dovahkiin escape from Apocrypha with the Miraak\\\\\\\\\\\\\\'s robes and travelled from Solstheim to Skyrim for reach the Throat of the World and confide his worries about Herma Mora and Miraak to His Guide and Mentor Paarthurnax.\r\nThe ancient Dovah after a long meditation decide to purify the robes for remove every traces of corrupted power thought his powerful Thu\\\\\\\\\\\\\\'um. After that Parthurnaak ask to Arngeir to take the purified clothes and to make a new robe for the Dovahkin as personal thanks from the Greybeards not only for saved Skyrim from Alduin but also for saved Solstheim from Miraak.\r\nParthurnaax sayed to Arngeir: \r\n\r\n\\\"The Dovakiin need 3 symbols for balance his Power and penetrate his Thu\\'um. Every symbol represent what the Dovahkiin need to remember in different level for fulfil his mission. Add to his new robes accordingly to this order:\r\n\r\nThe first and minor symbol is the head of Odahviing, symbolizing \\\"the Companion\\\" and the help in the time of need. No one is alone...even in the darkest hour.\r\nThe second symbol is the Horn of Jurgen Windacaller, symbolizing the good will of the Dovah and his struggle for the balance. Century will pass after we can see another Tongue that is worthy to wear the symbol of our founder.\r\nThe third symbol is the figure of Talos, symbolizing the heavy role of the Dovahkiin as protector of mankind.\r\n\r\nOn the Hood you will also add the seal of the Thu\\'Um Master and these Words: \\\"Kruziik \r\nOnikaan\\\" and \\\"Revak Thu\\'um\\\" that means \\\"Ancient Wisdom\\\" and \\\"Sacred Thu\\'um\\\"...for remembering where comes the Power and in which way we must use it.\r\n\r\nNow the Dovahkiin is officialy the Disciple of Talos and the Hair of Jurgen Windcaller. Let his Words be mighty then ever!\\\"\r\n\r\n[center][IMG]http://imageshack.us/a/img213/1852/robemora.png[/IMG][/center]\r\n\r\nAfter the battle against the First Dragonborn the Dovahkiin decide to become the Champion of Mora and take the place of Miraak. Then you ask to Herma Mora to seal this pact materially on the Miraak\\\\\\\\\\\\\\'s clothes. Hermaeus Mora accepted the offers and put his personal symbol on the robes nominating you \\\\\\\\\\\\\\\"Prince of Apocrypha\\\\\\\\\\\\\\\"\r\n\r\n[center][IMG]http://imageshack.us/a/img845/4071/cultistboth.png[/IMG][/center]\r\n\r\nDetails:\r\n\r\nCultist of the Champion\r\n-Around the Hermaeus Mora logo on the front are written with Daedric alphabet the words: \\\"Cultist of the Champion of Hermaeus Mora\\\"\r\n- on the upper side of the pauldron\\'s plate there is the sign of Oblivion.\r\n- A small logo of Hermaeus Mora is placed between two gauntlets plate.\r\n\r\nFollower of the Disciple of Talos:\r\n-On the mask are written \\\"Govey faal Dur\\\" (Remove the Curse)\r\n- On the shoulder cover its written with repetition \\\"Qolaas se Dovahkiin\\\" (Herald of the Dovahkiin),\r\n- On the little skirt around the body are written \\\"Dovahkiin, fah hin kogaan mu draal\\\" (Dovahkiin, for your blessing we pray )\r\n-The piece of paper on the robes and the mask are the banners of High Hrothgar\r\n- Symbol added are the Symbol of Talos and the Image of Talos.\r\n- Elements for the straps are the symbol of the Greybeards.\r\n\r\nHow to get?\r\nYou can Craft your new robes on the skyforge with the advanced armor perk.\r\nfor the Miraak set you need:\r\n-Miraaks clothes, wich you will get after herma mora kills him.\r\n-A non-filled Blacksoulgem for the Herma Mora version.\r\n-A Amulet of Talos for the WIndcaller version.\r\n\r\nfor the Cultist set you need:\r\n-Cultist clothes, used by miraaks cultists.\r\n-A non filled Blacksoulgem for the Herma Mora version.\r\n-A Amulet of Talos for the Followe of the Disciple of Talos version.\r\n\r\nInstallation:\r\nDragonborn is required.\r\n\r\nNMM: Use single files with download manager.\r\n\r\nManual:\r\nINSTALL: Put the data folder in your Skyrim folder.\r\n\r\nUNISTALL: Delate contents from the folder named Rafuel and the Miraak.esp\r\n\r\nThanks to everyone who appreciate this work.\r\n\r\n[center]Original Retexture Here:\r\n[url=http://skyrim.nexusmods.com/mods/35252]\r\n[img]http://imageshack.us/a/img443/2203/miraak.png[/img][/url] \r\n[url=http://skyrim.nexusmods.com/mods/35329]\r\n[img]http://img542.imageshack.us/img542/4071/cultistboth.png[/img][/url][/center]\r\n\r\nAll credits to Bethesda\r\n\r\nEnjoy and FUS RO DAH!\r\nRafuel & Witcher5688\r\n\r\nChangelog:\r\n1.0: release",
  "categoryId": "54",
  "version": "1.0",
  "author": "Rafuel and Witcher5688",
  "createdUnix": "1367757583",
  "updatedUnix": "1367756013",
  "containsAdultContent": false,
  "uploadedBy": "Witcher5688",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028243",
      "name": "Standalone HD Miraak and Cultist Sets",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21541",
      "fileName": "Standalone HD Miraak and Cultist Sets-35683-1-0.zip",
      "uploadedUnix": "1367756013",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e158acb4e89f05e3cea9d6717a4b304a76df40e7bffe7e81960dbde760472761/analysis/1407555852/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Standalone%20HD%20Miraak%20and%20Cultist%20Sets-35683-1-0.zip?fid=1000028243&ttl=1535814381&ri=8192&rs=8192&setec=35445cb41d1e60c1c4c651cee32284f0"
    }
  ]
}