{
  "modId": 35690.0,
  "modName": "Unique Bows Collection Deutsche Version",
  "summary": "Deutsche Übersetzung von Unique Bows Collection; lore friendly",
  "descriptionHtml": "[color=red]Original Mod wird nicht benötigt![/color]\r\n\r\nUnique Bows Collection fügt dem Spiel 10 einzigartige Bögen hinzu, alle mit einer spezifischen Eigenschaft. Ich habe mir die Mühe gemacht sie nicht einfach nur zu übersetzen, sondern die Namen möglichst lore-freundlich anzupassen (Beispiele unten).\r\n\r\nDie originale Mod könnt ihr euch hier angucken:\r\n[url=http://skyrim.nexusmods.com/mods/32405]Unique Bows Collection[/url]\r\nby Artisanix\r\n\r\n[color=cyan]Zu den Übersetzenungen (unter Images findet ihr alle):[/color]\r\nWährend sich \\\"Bow of Elberond\\\" noch leicht zu \\\"Bogen von Elberond\\\" übersetzen lässt, fand ich es äußerst langweilig \\\"Bow - Scorpion\\'s Tail\\\" einfach zu \\\"Bogen - Skorpionschwanz\\\" zu übersetzen. Stattdessen habe ich versucht jeden Bogen so zu übersetzen, das er auch nach etwas klingt. Noch schwieriger war es bei \\\"Bow - Hunter\\'s Roar\\\" der wortwörtlich übersetzt \\\"Bogen - Jägers Gebrüll\\\" heißt, was ziemlich besch..eiden kingt. Also habe ich mir die Freiheit genommen alles ein wenig anzupassen, ohne die Intentionen des Authors zu verfehlen. Der \\\"Jagtgebrüllbogen\\\" und \\\"Skorpionschwanzbogen\\\" erfüllen ihren Zweck bis jetzt vorzüglich :)\r\nWortwörtlich habe ich die Beschreibungstexte der Bögen übersetzt. Diese enthalten keine genauen Schadensinformationen, im Gegensatz zu den normalen Verzauberungen. Einzigartig halt ;)\r\n\r\n[color=cyan]Wo ihr die Bögen findet:[/color]\r\nIm Blauen Palast in Einsamkeit, geht in der Eingangshalle links und gleich wieder rechts und dann am Ende des Gangs in den Keller. In der rechten hinteren Ecke hinter einem Bett steht eine Truhe in der sich das Tagebuch von Trebonius Catanius befindet. Mit Hilfe des Tagebuchs kann man alle 10 Bögen finden (Es ist allerdings weiterhin auf englisch, da ich noch nicht herausgefunden habe wie man es übersetzen kann). Die Bögen sind in bestimmten Dungeons an normal zugänglichen Orten versteckt. Haltet Ausschau nach diesen länglich verzierten Truhen, wie sie auch in den Gemächern des Jarls zu finden sind.\r\nWer keine Lust zum Suchen hat kann sich auch eines Cheats bedienen. Gebt in die Console\r\nstartquest axBowsTest\r\nein und es öffnet sich die Truhe mit allen 10 Bögen.\r\nZusätzlich können alle Bögen auch geschmiedet werden.\r\n\r\nInstallation:\r\nEntpackt die .rar Datei und kopiert den Inhalt in euer Skyrim Installationsverzeichnis (...)/Skyrim/Data\r\nModreihenfolge in NMM/BOSS ist vollkommen egal.\r\n\r\nVergesst nicht Artisanix ein Endorsement zugeben, da er die Bögen designt hat.",
  "categoryId": "55",
  "version": "1.1",
  "author": "Artisanix and Atega",
  "createdUnix": "1367768303",
  "updatedUnix": "1367767543",
  "containsAdultContent": false,
  "uploadedBy": "Atega",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028257",
      "name": "Unique Bows Collection Deutsche Version",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5780",
      "fileName": "Unique Bows Collection Deutsche Version-35690-1-1.rar",
      "uploadedUnix": "1367767543",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5617125098729c83c429c70b03261cb1f354d3e934717dcc79e2b384b8b58d03/analysis/1407556087/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unique%20Bows%20Collection%20Deutsche%20Version-35690-1-1.rar?fid=1000028257&ttl=1535814393&ri=8192&rs=8192&setec=fe19e5a4412c3b312e027c50c9d48d8e"
    }
  ]
}