{
  "modId": 35732.0,
  "modName": "Witch Outfit CBBE",
  "summary": "Clothes designed for a mage or witch type female character.",
  "descriptionHtml": "DESCRIPTION\r\n\r\nThe following mod consists of a clothing set made by me for a mage or witch type female character.\r\n\r\nAs this is my VERY FIRST CUSTOM ARMOR/CLOTHING MOD, it is not perfect, I am still learning.  But I did feel it was decent enough to upload.  What you see in the screens is what you get for now.  There are no boots or gloves to go with it.  There\\'s just the dress and some leg straps.  The outfit equips as one piece, which is a one-piece dress with the leggings/straps.  So you are still free to equip boots/gloves/etc. from other mods.\r\n\r\nHOW TO USE\r\n\r\nType \\\"help ancwitch\\\" (or try \\\"help witch clothes\\\") into the console to get the codes for the outfit.  In the future, there will be an actual in-game place you can go to get the outfit once I finish that particular mod I\\'m working on.\r\n\r\nThere are two flavors:\r\n\r\nWitch Clothes I - The basic outfit\r\nWitch Clothes II - This one uses an alpha property on the dress, making it see-thru.  RECOMMENDED FOR ADULT GAMERS ONLY.\r\n\r\nISSUES/BUGS\r\n\r\n- There is no weight slider.  I\\'ve created about a dozen armors/clothing mods (although, none of them are as ready for upload as this mod) so far and I still suck at the wight slider part.  So, for now if you use this mod, I recommend you use the \\\"showracemenu\\\" console command and set your body weight to 100 while you use this mod so you don\\'t get that weird neck gap thing.\r\n\r\n- You may find some clipping or stretching on the dress mesh.  Skinning dresses/skirts are a nightmare for a noob like me.  Overall, the dress should be fine though.\r\n\r\nFUTURE GOALS:\r\n\r\n- Weight slider support (once I learn how to properly create it)\r\n- More detail on the outfit (separate equipable parts, etc.)\r\n- More color/pattern options\r\n- Perhaps UNP/UNPB support\r\n\r\n\r\nFeel free to leave feedback.  I need to get better somehow. :)\r\n---------------------------------------------------------------------------------------\r\n\r\nNOTE:  Major credit to Nightasy for taking the time to create his amazing step-by-step custom armors tutorial!!!\r\n\r\nhttp://skyrim.nexusmods.com/mods/19249/?",
  "categoryId": "60",
  "version": "Beta",
  "author": "THEANCESTOR",
  "createdUnix": "1367854909",
  "updatedUnix": "1367854866",
  "containsAdultContent": true,
  "uploadedBy": "THEANCESTOR",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028446",
      "name": "Witch Outfit CBBE Beta",
      "version": "Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6303",
      "fileName": "Witch Outfit CBBE Beta-35732-Beta.zip",
      "uploadedUnix": "1367854866",
      "modVersion": "Beta",
      "virusScanUrl": "https://www.virustotal.com/file/fe09b884e52b01837f7def04b76e672364fb76b0ee127df16d256deb8b31a9dd/analysis/1407557869/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Witch%20Outfit%20CBBE%20Beta-35732-Beta.zip?fid=1000028446&ttl=1535814448&ri=8192&rs=8192&setec=fee094edefd545273234062189288b7e"
    }
  ]
}