{
  "modId": 35733.0,
  "modName": "Secrets of Valuungrann",
  "summary": "Help a shifty Dunmer with a simple task and find yourself in a mess of lies, confusion and revenge. All the while watch your back because who knows what lurks in the dark corners of Valuungrann Crypt.",
  "descriptionHtml": "***UPDATE***\r\n\r\nIf you are experiencing a bug where you can not advance in the final boss fight because the 4th wave of guardians does not trigger and the drop bridge does not fall, please download the patch.\r\n\r\nIf you have encountered this problem. Please install the patch and reload a save before you enter the final room.\r\n\r\n******************************\r\nTable of contents\r\n\t1. Description\r\n\t2. Installing\r\n\t3. Uninstalling\r\n\t4. Quest FAQ\r\n\t5. Acknowledgments\r\n\t6. What\\'s Next\r\n\r\n\r\n***********************************\r\n**\t\tDESCRPTION\t **\r\n***********************************\r\nThis is mainly medium length quest mod. I have spent about 14 months working on this from the time the CK came out. Instead of throwing thousands of things against the wall and trying to implement them all half halfheartedly I tried to create quality over quantity. Because of some game play elements I have implemented in the main dungeon, I advise against followers because there is some jumping and platforming which the AI in Skyrim just can\\'t handle.\r\n\r\nOn the surface this mod adds a new set of light armor between glass and dragon scale I have called Obsidian. I have lore to back it up and one of the major characters will explain it, sort of... He is a shifty fellow.\r\n\r\nBut below the surface lies a lot more and there is no way I can give more away otherwise I will just spoil the fun. So thank you for playing my mod and thank you to all the people who helped me make it.\r\n\r\nThe armor is male and female compatible. I Started this mod while doing a play through as a female Darkelf hence most of the pictures are of the female armor but Male armor is there as well. Renthar and his bodyguard are to be seen in the screens. Though the mod started out as a re-text it has grown into so much more. And the main focus has shifted away from the armor and more toward the story.\r\n\r\n\r\n******************************************\r\n**\t\tINSTALLING\t\t**\r\n******************************************\r\nInstallation is easy. If you are doing it via NMM there will be no problem. If you are Installing manually just place Valuungrann.bsa and Valuungrann.esp into your Skyrim data folder.\r\n\r\nThis mod does not change any major game play elements so load order is not too important from what I have gathered. The mod does contain a custom voiced follower so please check any Follower Overhall mods as to where custom followers should be placed in relation to them. I have not tested with UFO or any other follower overalls so there may be some buggyness. Buyer Beware.\r\n\r\n\r\n\r\n*******************************************\r\n**\t\tUNINSTALLING\t\t **\r\n*******************************************\r\nUninstalling, like installing is easy. Either use NMM or just delete Valuungrann.bsa and Valuungrann.esp from your Skyrim data folder. As with uninstalling any mod, please be aware that some elements will be left within your saved game. This is just how Skyrim works and every mod will do this.\r\n\r\n\r\n\r\n*******************************************\r\n**\t\t   QUEST FAQ\t\t **\r\n*******************************************\r\nThis is for those of you who are stuck and contains spoilers. Please read with caution.\r\n\r\nQ. How do I start the quest?\r\nA. There are really two ways to start this quest. The “main” way is to talk to a rather shifty Dunmer named Drevis Renthar who spends his time in Riften. During the day he sandboxes outside, at night he and his companions spend their time in the Bee and the Barb. The second way is to just explore skyrim and run into things.\r\n\r\nQ. I have found Renthar but he will not talk to me. What do I need to do?\r\nA. Renthar is a smith and will only ask for help if your smithing level is 80 or above. You also need to have the glass smithing perk and the arcane smithing perk.\r\n\r\nQ. Help I die so easily. Why are there so many high level monsters for my level 5 guy with 80 smithing?\r\nA. The minimum level for the main dungeon is 24. So all creatures will spawn as though you are at least level 24 even if you are lower.\r\n\r\nQ. Why are there no hits to the pillar puzzles?\r\nA. There are. They just are not the usual hints. Be sure to look for fires and tablets you can read that will help guide the way.\r\n\r\n\r\n\r\n\r\n***************************************************\r\n**\t\t   ACKNOWLEDGEMTNS\t\t **\r\n***************************************************\r\nI want to thank a bunch of people for this mod. First off is Steve40 at the Skyrim Nexus who helped me with so much of the scripting and being patient when I utterly failed.\r\n\r\nI also want to thank my Voice actors for doing an amazing job:\r\n\r\nHotemochick1992 (A.K.A Emma Moon)\t\t– Fjorna Steelclaw\t\r\n\r\nDaniel (Harmony90) Høstan Urrea \t\t\t– Bjarlin Steelclaw\r\n– Drevis Renthar\\'s Male Bodyguard\r\n\r\nEric Wheeldon\t\t\t\t\t\t– Drevis Renthar\r\n\r\nElijah Lucian\t\t\t\t\t\t– The two hapless guards\r\n\r\n\r\n***************************************************\r\n**\t\t   WHAT\\\"S NEXT\t\t **\r\n***************************************************\r\nMy future plans are to do a re texture of the weapons as well and intigrate another quest with Drevis Renthar to \\\"unlock\\\" them and to expand his story.\r\n\r\nI am also planning on expanding on Fjorna, Bjarlin, Hellena. What is the weird door in their cabins basement? Hopefully I will have time, motivation and interest in this mod to keep me going.",
  "categoryId": "35",
  "version": "1.1.2",
  "author": "Hangman4358",
  "createdUnix": "1367865467",
  "updatedUnix": "1368036272",
  "containsAdultContent": false,
  "uploadedBy": "Hangman4358",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028871",
      "name": "secterts_of_valuungrann_v1_1_2",
      "version": "1.1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19634",
      "fileName": "secterts_of_valuungrann_v1_1_2-35733-1-1-2.rar",
      "uploadedUnix": "1368036272",
      "modVersion": "1.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/28f01ea86eec2716e04af61aba898a422430904897d0b5a90ce59d38f904a642/analysis/1407561278/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/secterts_of_valuungrann_v1_1_2-35733-1-1-2.rar?fid=1000028871&ttl=1535814449&ri=8192&rs=8192&setec=f2b998cebb98e64f10e1a345eceb86b1"
    }
  ]
}