{
  "modId": 3577.0,
  "modName": "Destruction Reworked",
  "summary": "Reworking of Destruction to be more powerful and have a different playstyle for offensive mages.",
  "descriptionHtml": "This mod reworks Destruction to be a different experience in comparision to the original game.\r\n\r\nGiven my precedent experience with Empowered Destruction I decided to do a version collecting togheter some of the changes in that mod, rework some things and tailor them with a specific gameplay in mind.\r\n\r\nDestruction in the original Skyrim experience is built around a perk: Dual Casting (with the adding of Impact later). Remove that perk and Destruction is nothing. This behaviour means a thing: spellswords, battlemages and anyway any build that uses a weapon in one hand and offensive spells in the other suffers greatly from this choice on Bethesda\\'s part (and also pure mages that don\\'t want to continuosly cast the same spell in both hands over and over). \r\n\r\nThat Destruction is a weak line it\\'s well know (and in fact there are almost more mods that increase Destruction power in Nexus than texture/nude ones, and this says it all) but IMO apart this well-known issue the other is that the aforementioned builds suffers a lot, and not only for the weakeness of the line. Impact is a staple of Destruction and that requires DC. Given the weakness of the line DC is required to do damage and so utilizing a spell in one hand or two different spells in two hands it means that your character will not be effective after a while.\r\n\r\nThis mod tries to rework the Destruction line in a way that the emphasis on Dual Casting is much less than in the original game. To do so I increased power of spells all around, scaled their power while filling the tree (in a progressive way) and reworked bonuses of Dual Casting. DC still retains its effectiveness but in another way, as a tool to cast a spell faster with a little more power. \r\n\r\nAt first I wanted to add these changes in Empowered Destruction but: A) that mod is modular, B) it already has a lot of versions. Given that to work well and in a balanced way the mod must have all its components and that adding other versions to ED would only create more chaos and anyway this mod has a somewhat different flavour I thought it was better to create a separate file for it. \r\n\r\n----------------------------------------------------------------\r\nChanges overlook:\r\n----------------------------------------------------------------\r\n\r\n- Destruction spells scale in power while filling the main perks (novice, apprentice etc.). The bonus in the end will be a +50%. The increase in damage is progressive and static through the tree. However you don\\'t receive bonus to costs for spells in taking the perks.\r\n\r\n- Greatly increased magicka regeneration while in battle(*).\r\n\r\n- All spells have increased base damage(*).\r\n\r\n- Cost of spells is increased(*).\r\n\r\n- Two new cloak spells, a lower version and a greater one, useful for spellswords and battlemages builds. You can acquire the tomes from vendors as for every other spell.\r\n\r\n- Wall spells are now changed in more powerful version of Flames, Spark and Frostbite. For a probable bug wall spells in the original game didn\\'t scale in damage and (worser) the damage was applied literally every second instead as novice spells where the DPS is constant. This made them less effective than they could have been. Being now higher power version of novice spells they are much more effective and useful.\r\n\r\n- Destruction Master Spells are now instant cast with damage balanced as a spell more powerful than expert and casted with both hands (as they are).\r\n\r\n- Completely reworked Dual Casting. It now increases power of a single spell by 50% halving the casting time and costing a little more than two spells. This reworking means that DC will be now used to cast a more powerful version of a single spell in a faster time. This means that DC is useful now to cast a series of spells very quickly one after the other (but beware of mana!). Added to Impact this also means a quick way to lock an enemy in place in moments of need. However remember that for power it\\'s not the best option now because it is not damaging as two spells at the same time while costing more mana(**).\r\n\r\n\r\n(*) These changes are meant so that a mage should use his/her arsenal fully. You cannot spam all the time incinerate, for example, because while doing now a lot of damage it will empty your magicka bar very soon. You have to mix spells depending on the situation. The much increased magicka regeneration in battle means also a more dynamic playstyle. \r\n\r\n(**) There\\'s an optional version that leave DC inaltered for users that prefer the original behaviour of it. Please note that if you use a third-party modification to dual casting to load this mod AFTER because third-party mods that make changes to dual-casting usually contains also changes to costs of spells and magicka regeneration.\r\n\r\n----------------------------------------------------------------\r\nTips on how to get the best experience from the mod:\r\n----------------------------------------------------------------\r\n\r\nThe mod is tailored mostly for expert/master difficulty (the bonus to destruction damage is best meant for those two). \r\n\r\nTo better experience the mod the principal thing is to don\\'t use 0 costs. If you do so instead of playing the game normally then all the mod\\'s balance will be nullified. You will be able to instant cast Master spells to no end and stunlock everything even more than before, given the quicker dual casting. In short: if you plan on using exploits to give you 100% fortify destruction this mod will only break the game more, not less.\r\n\r\nAs a pure mage to better experience the mod you should learn to play a bit differently than you are accustomed to. Dual Casting now works differently: it is not the power storehouse that stunlocks and dispatch everything quicker than everything else. It costs more than two spells but it has LESS power than two spells casted at the same time. It is an useful tool to cast spells quickly and, added with Impact, to stunlock an enemy in place in moments of need, but not the quickest way to kill an opponent and less effective against groups.\r\n\r\nThe playstyle of a pure mage with this mod is more swapping from spell to spell depending on the situation. You should learn when double casting spells and when dual casting them. Everyone of these methods is better depending on the situation. If you want power you cast two spells (the same or two different) in different hands, if you want to be quick you dual cast. You can think that now you can stunlock everything even more than before but remember that spells now, being more powerful, costs much more and the power of DC is less than before, so if you use only it then your mana will end before you do much harm. It is better to mix attacks and either use single hands spells sometimes (yes, you did read well). \r\n\r\nAs a mixed offensive spell/fighter build this mod is made for you. There are more cloaks to help in melee range, spells are more powerful so your weapon doesn\\'t do x3 the damage of them, etc.\r\n\r\n----------------------------------------------------------------\r\nKnow bugs:\r\n----------------------------------------------------------------\r\n\r\nThe two new cloaks will be displayed as Adept spells, while being one apprentice and the other expert. This is only a display bug because the spells will behave correctly and they will be affected by the correct perks. It is a bug that would require modding some files that I don\\'t want to change, and since it\\'s a little thing it will remain as such.\r\n\r\n----------------------------------------------------------------\r\nVersions log:\r\n----------------------------------------------------------------\r\n\r\n- 1.03: Reworked wall spells to be more powerful version of novice ones. Corrected error with Lightning Storm cost.\r\n- 1.02: Revised magicka regeneration. Manually adjusted all spells\\' costs. Rebalanced a little damage bonuses on spells. Made a version without the changes to dual casting.\r\n- 1.01: Revised cost of spells and bonuses on perks to reduce their costs. Lowered damage of some spells that were too powerful. Corrected display bug for Incinerate.  \r\n- 1.00: First version of the mod.\r\n\r\n----------------------------------------------------------------\r\nHow to install\r\n----------------------------------------------------------------\r\n\r\nExtract the archive somewhere.\r\nGo to: Drive Letter:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\\r\nFor those who don\\'t have bought the game on steam put the files in the Data dir where you installed the game\r\n\r\n1. Drop the Destruction_Reworked.esp in the above folder\r\n2. Launch the Skyrim Launcher, and click on \\'Data Files\\'\r\n3. Tick Destruction_Reworked and click \\'Ok\\'\r\n\r\n\r\n----------------------------------------------------------------\r\nData Files grayed out?\r\n----------------------------------------------------------------\r\nGo to: Drive Letter:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Skyrim\\\\SkyrimPrefs.ini\r\n\r\nFor those who don\\'t have bought the game on steam, the SkyrimPrefs.ini file is located in Drive Letter:\\\\Users\\\\<USERNAME>\\\\Documents\\\\My Games\\\\Skyrim\r\n\r\nAdd these lines, or change them if they already exist so they match the below:\r\n [Launcher]\r\n bEnableFileSelection=1\r\n\r\nIf that fails:\r\n Go to: Drive Letter:\\\\Users\\\\[USERNAME]\\\\AppData\\\\Local\\\\Skyrim\r\n Make the Skyrim folder un-read only.\r\n\r\n----------------------------------------------------------------\r\nCredit and thanks:\r\n----------------------------------------------------------------\r\n\r\n- Thanks to Penumbral\\'s that created the base on whom I made my Empowered Destruction mod and so indirectly started the work on this one.\r\n- Thanks to Bethesda for the game.\r\n- Thanks to all the modders in Nexus, the users and to all of those people that produce constructive criticism without which no improvement can be made.",
  "categoryId": "24",
  "version": "1.03",
  "author": "Lautreamont",
  "createdUnix": "1323797711",
  "updatedUnix": "1323955485",
  "containsAdultContent": false,
  "uploadedBy": "Lautreamont",
  "primaryFile": null,
  "files": [
    {
      "fileId": "10697",
      "name": "Destruction Reworked",
      "version": "1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Destruction Reworked-3577-1-03.7z",
      "uploadedUnix": "1323955420",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/43cc287c558bcf3558f3063537469fab7462f0aab544bd660c8870153e998fcc/analysis/1406521033/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Destruction%20Reworked-3577-1-03.7z?fid=10697&ttl=1535758741&ri=8192&rs=8192&setec=d82c8eea32fabd3cfd106891d5546b56"
    },
    {
      "fileId": "10699",
      "name": "Destruction Reworked - No Dual-Casting changes",
      "version": "1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Destruction Reworked - No Dual-Casting changes-3577-1-03.7z",
      "uploadedUnix": "1323955485",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/036feccf652c461a09b20c2f5cefed5b2c326ff8a071c8eb47a681840bcdff53/analysis/1406521084/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Destruction%20Reworked%20-%20No%20Dual-Casting%20changes-3577-1-03.7z?fid=10699&ttl=1535758741&ri=8192&rs=8192&setec=b26e508c0c356959afb9756a3a81d98d"
    }
  ]
}