{
  "modId": 35802.0,
  "modName": "Skyrim Heart Rate FR",
  "summary": "Traduction française du mod de Anzious \\\"Skyrim Heart Rate\\\"\r\nVia l\\'ajout du rythme cardiaque et de l\\'endurance il offre une intégration fine et immersive de la gestion des efforts.",
  "descriptionHtml": "Traduction française du mod de Anzious \\\"Skyrim Heart Rate\\\"\r\nVia l\\'ajout du rythme cardiaque et de l\\'endurance il offre une intégration fine et immersive de la gestion des efforts.\r\n\r\n[u]Installation[/u] :\r\nPrérequis : [url=http://skse.silverlock.org/]SKSE[/url]\r\nOptionnels mais recommandés : [url=http://skyrim.nexusmods.com/mods/3863/?]SkyUI[/url]\r\net un modificateur de vitesses de déplacement [url=http://skyrim.nexusmods.com/mods/2873/?]Speed Revised V2[/url] ou [url=http://skyrim.nexusmods.com/mods/32229/?]Realistic Humanoid Movement Speed[/url]\r\n\r\nAvant cette traduction vous devez installer (et endorser) le mod originel d\\'Anzious : [url=http://skyrim.nexusmods.com/mods/35050/?]Skyrim Heart Rate[/url]\r\nLes fichiers de traduction doivent simplement être extraits dans le dossier du jeu en écrasant les fichiers d\\'origine.\r\n\r\n[u]Note sur la traduction :[/u]\r\nDeux termes sont utilisés par l\\'auteur (Anzious) concernant l\\'énergie du joueur :\r\nLa Stamina qui correspond à la Vigueur dans la version française du jeu. L\\'énergie utilisable à très court terme.\r\nEt il introduit le concept de LTS (Long Term Stamina). Il s\\'agit bien entendu de la gestion de son énergie à long terme. Pour la traduction j\\'ai fait au plus simple : Endurance.\r\nDonc autant dans le mod que dans le texte qui suit la Vigueur correspond à la gestion de la barre verte que nous connaissons déjà en jeux. Et l\\'Endurance reflète la gestion à long terme de notre énergie.\r\n\r\nPour tout commentaire sur la traduction n\\'hésitez pas à me contacter ici même ou sur le site de [url=http://www.confrerie-des-traducteurs.fr/forum/index.php]la confrérie des traducteurs[/url].\r\n\r\n\r\n[size=50][u][b]Bien débuter[/b][/u][/size]\r\n\r\nA première vue, la gestion de sa fréquence cardiaque ou de son énergie peut sembler ajouter une couche de micro gestion superflue, ce n\\'est absolument pas le cas. L\\'apport au gameplay et à l\\'immersion sont fondamentaux. Et ils ont été très bien pensés et intégrés au jeu par Anzious.\r\n\r\n[b]Gérer votre fréquence cardiaque[/b]\r\nLa fréquence cardiaque modifie la régénération de la Vigueur. Positivement ou négativement.\r\nUne fréquence cardiaque élevée accélère la régénération. Une fréquence basse diminue la régénération.\r\nLe mod implique donc de chercher à s\\'échauffer avant un combat (via n\\'importe quelle activité physique) afin d\\'augmenter son rythme cardiaque et sa régénération de Vigueur. Et à se reposer après le combat pour baisser sa fréquence cardiaque et donc récupérer de l\\'Endurance, ce qui nous conduit au chapitre suivant.\r\n\r\n[b]Gérer son Endurance[/b]\r\nL\\'Endurance modifie la Vigueur disponible. Dans les deux sens, une Endurance élevée augmente votre Vigueur et vice versa. Une très faible quantité d\\'Endurance diminuant également la vitesse de déplacement.\r\nL\\'évolution de l\\'Endurance quand à elle est dépendante de la fréquence cardiaque. Un rythme élevé diminue l\\'Endurance rapidement (mais régénère la vigueur plus rapidement également comme on l\\'a vu plus haut). Un rythme faible permet de récupérer de l\\'endurance (dormir, s\\'assoir, se relaxer). Un raccourci clavier permet de se relaxer n\\'importe ou.\r\n\r\n[b]Ce que cela implique[/b]\r\nAprès avoir lut ces deux premiers paragraphes vous devez avoir une bonne vue d\\'ensemble du fonctionnement du mod.\r\nEn jeux vous ne pourrez plus traverser la carte d\\'une traite en courant, en lattant deux ou trois dragons sur la route pour reprendre votre course dans la foulée comme si de rien n\\'était.\r\nSHR vous donne un avantage en combat (qui se marrie parfaitement bien avec les mods proposant une gestion de la Vigueur en combat plus pointue) via le bonus de régénération. Les poussées d\\'adrénaline ne font pas tout, il faut désormais vous échauffer et vous tenir prêt en situation dangereuses.\r\nAprès un combat acharné ou une longue course il faudra penser à récupérer un minimum, les tavernes prennent tout leur sens. La synergie avec des mods comme Frostfall ou RND se fait d\\'ors et déjà tout naturellement. Et Anzious prévoit d\\'améliorer encore cette synergie dans le futur.\r\n\r\n\r\n[size=50][u][b]Les réglages[/b][/u][/size]\r\n\r\nLe menu MCM permet de régler, personnaliser l\\'ensemble du mécanisme. Je vai détailler les réglages avancés ici, tout ne peut pas être clair dans les descriptions données en jeu.\r\n\r\n[b]Les modèles[/b]\r\nCe sont les courbes de modification de votre Endurance et de la fréquence cardiaque. Je vous conseille de vous reporter au post d\\'origine de l\\'auteur pour plus de détails à ce sujet, pour ma part je conserve le réglage par défaut (Quadratic) qui est à la fois le plus équilibré et le plus réaliste.\r\n\r\n[b]Les multiplicateurs[/b]\r\nJ\\'ai conservé ce terme assez vilain dans la traduction afin d\\'éviter les confusions. Quoi qu\\'il en soit les multiplicateurs modifient simplement la vitesse à laquelle les stats sont modifiées, positivement et négativement.\r\nSi vous passez le multiplicateur de la fréquence cardiaque de 1 à 2 par exemple, votre rythme cardiaque augmentera deux fois plus vite, avec le bonus à la régénération de Vigueur qui lui est associé bien entendu. Mais dans le même temps vous aurez perdu deux fois plus d\\'Endurance.\r\n\r\n[b]Les ratios[/b]\r\nLes ratios modifient l\\'équilibrage entre les augmentations et les diminutions de chaque stats.\r\nSi vous passez le ratio de l\\'Endurance de 1 à 1.5 par exemple cette statistique augmentera 1.5 fois plus vite qu\\'elle ne diminuera. Vous récupèrerez donc plus vite tout en vous fatiguant moins rapidement.\r\n\r\n[b]Le seuil (Endurance)[/b]\r\nVous modifiez ici le seuil à partir duquel votre fréquence cardiaque aura un impact négatif sur votre Endurance. Après ce seuil votre Endurance commence à diminuer. En dessous de ce seuil vous commencez à récupèrer votre endurance.\r\n\r\n[b]Les seuils (course, sprint, combat)[/b]\r\nPermet d\\'imposer une limite à l\\'augmentation de la fréquence cardiaque dans chacune de ces activités. Ce réglage dépend en partie du style de jeu, du type de personnage (un mage ne combat pas de la même façon qu\\'un guerrier par exemple, sont rythme cardiaque ne doit pas augmenter dans les même proportions), pensez aux répercutions sur la régénération de Vigueur également.\r\n\r\n[b]Les poussées d\\'adrénaline[/b]\r\nActive ou désactive un petit boost à la fréquence cardiaque quand vous êtes engagé dans un combat. Rééquilibre en partie les chances de façon cohérente si vous êtes attaqués sans vous être échauffé au préalable.\r\n\r\n[center][URL=http://skyrim.nexusmods.com/mods/35320/?][IMG]http://www.ushareimg.com/images/286T3R.png[/IMG][/URL][/center]",
  "categoryId": "78",
  "version": "Beta1.3",
  "author": "Anzious traduit par Lyim",
  "createdUnix": "1368009409",
  "updatedUnix": "1368008423",
  "containsAdultContent": false,
  "uploadedBy": "Lyimee",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028790",
      "name": "Skyrim Heart Rate FR",
      "version": "Beta1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Skyrim Heart Rate FR-35802-Beta1-3.7z",
      "uploadedUnix": "1368008423",
      "modVersion": "Beta1.3",
      "virusScanUrl": "https://www.virustotal.com/file/a1bdbf977e545f0b5514bdc5cda5a1b1d3fb491d480cd3a786da62172d5aa5ce/analysis/1407560711/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Heart%20Rate%20FR-35802-Beta1-3.7z?fid=1000028790&ttl=1535814570&ri=8192&rs=8192&setec=882998fa562ccf7e73146ce50bdddef6"
    }
  ]
}