{
  "modId": 35805.0,
  "modName": "Riverwood Defence",
  "summary": "Adds a Watchtower and small Barracks to Riverwood.",
  "descriptionHtml": "This is my first mod, so constructive criticism is greatly appreciated&#33;\r<br />\r<br />THANK YOU for all the support and comments so far&#33; You guys are wonderful and have got me totally addicted to modding with your kind words :)\r<br />\r<br />Playing through Skyrim, I&#39;ve always wondered why Riverwood wasn&#39;t more defended, as it&#39;s one of the major routes used to access Whiterun.\r<br />\r<br />This mod adds a two small Watchtowers and a Barracks to Riverwood, which is patrolled by 3 guards.\r<br />\r<br />CHANGELOG:\r<br />9th May - Started from Scratch. The two watchtowers are now closer to the town and the barracks is just behind the Sleeping Giant Inn. The Barracks now has more beds and is decorated AND has Whiteruns Banner on the Outside.\r<br />\r<br />9th May 2nd Update - Fixed bug with random food on fireplace in Barracks. Added Dragon Perch to top of Barracks and finally, added a Guard sweeping the floor outside the Barracks (will add more to this one later)\r<br />\r<br />14th May - Added a Guard Captain, removed Idle Markers from Watchtowers (as these were interferring with other NPC&#39;s) and added gates to Riverwood (fully Navmeshed). Hopefully this update will make Riverwood look more fortified, but also give it the feeling of being &#34;under-manned&#34; until the Jarl&#39;s men turn up&#33;\r<br />\r<br />15th May - Rebuilt Guard Barracks from scratch and added one Guard NPC to the interior.\r<br />\r<br />16th May - Barracks now Follower Compatible. Guards now patrol and have AI Packages. Added another Guard outside the barracks practicing Archery.",
  "categoryId": "53",
  "version": "1.0",
  "author": "LordDaem",
  "createdUnix": "1368019432",
  "updatedUnix": "1368700617",
  "containsAdultContent": false,
  "uploadedBy": "LordDaem",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030108",
      "name": "Riverwood Defence",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "94",
      "fileName": "Riverwood Defence-35805-1-0.zip",
      "uploadedUnix": "1368700617",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/94f4d729b18955ff0be24db8dd5b0a13a8888a1da645da5a9e62b679c148f34f/analysis/1407571326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverwood%20Defence-35805-1-0.zip?fid=1000030108&ttl=1535814576&ri=8192&rs=8192&setec=fd9c4bcf79ed29ee22bc8837da1569ae"
    }
  ]
}