{
  "modId": 35800.0,
  "modName": "Awakened Artifacts",
  "summary": "This mod attempts to overhaul all artifacts in the game to make them much more useful. This is not a simple balance tweak or stat multiplier compared to other mods that alter artifacts. Adds unique enchantments to artifacts so that they can be a viable alternative to self made items.",
  "descriptionHtml": "Current Version: Beta 0.2a\r\nRequires: Dawnguard and Dragonborn DLC\r\nLoad Order: Place it below any other mod that changes equips, weapons and armors.\r\n\r\n[color=yellow]\r\nChangelog:\r\n0.2a \r\nModified Savior\\'s Hide, Targe of the Blooded, Archmage Robes, Shield of Ygsamor\r\nAdded Ebony Blade, Wuuthrad and Rueful Axe[/color]\r\n\r\nEver got tired of having to stash away your artifacts because they just don\\'t hold up to the challenges of the game? This mod attempts to fix that problem by completely overhauling artifacts in game so that they have a unique purpose and powered by new enchantments. I made this mod because I hated how I could not use my artifacts because they were simply useless compared to the alternatives.\r\n\r\nQ: What makes yours different from other artifact mods out there?\r\nA: Most artifact mods just balance/empower the numbers associated with the artifact, for example the Ebony Mail now deals 30 dmg/sec instead of 5. Balancing them makes them useless end game or with hardcore mods because they simply aren\\'t strong enough. Empowering them, while making it balanced towards bosses and modded hardcore enemies, makes them too powerful in every other case. The effect is that you become so powerful it feels more like hax than wielding a legendary artifact. \r\n\r\nMy mods attempt to do both. How? I balanced artifact effects depending on who you are up against (ex. Ebony Mail deals more damage depending on the strength of the target). Making you feel powerful throughout, but not hax-like. I also completely changed most artifacts from how they are in game, giving them new effects and thus completely opening up new styles of gameplay when wielding them. \r\n\r\nQ: What is the balance level of your artifacts?\r\nA: I made sure these artifacts make you feel powerful alright, but not in every case. Most of the effects are limited to certain situations (situations you would have to take advantage of). These artifacts should be a little more powerful (but still comparable) than end game fully enchanted daedric gear. \r\n\r\nQ: Will wearing a combination of there artifacts make me too powerful?\r\nA: The answer is yes and no, in a sense. While I made sure none of these artifacts simply just stack up stats within themselves (that would be redundant and unbalanced), these artifacts are supposed to be a gift from daedric gods. It would be already a legendary honor to be the champion of one daedric god, so much more being the champion of them all. I made each artifact a powerful item in a certain \\\"field\\\" (or situations), wielding more then one of them just makes you cover more fields instead of making you super powerful in one field. An example would be the magical defense field, melee physical resistance field, low health defenses field, etc. \r\n\r\nQ: What artifacts did you edit?\r\nA: Right now I\\'m done with all non-weapon artifacts and I am slowly beginning to go over the weapon ones. I will also have to edit the smithing upgrade recipes later (as some weapons don\\'t have upgrades).\r\n\r\nFinally the changes,\r\n\r\n[color= #FDD017]\r\nTARGE OF THE BLOODED[/color]\r\nDefault: Too weak, it has a nice mechanic but deals insignificant damage.\r\nProblem: Simply increasing the damage would make bashing so viable that it would ruin the dynamic of a fight.[color=#F88017]\r\nSolution: Now deals your blocking skill as bash damage, 3x blocking skill for power bashes. When blocking, the shield now reflects 35% melee damage (courtesy of the spikes). These changes make this shield an offensive choice, compared to other artifact shields.\r\n[/color]\r\n\r\n[color= #FDD017]\r\nEBONY MAIL[/color]\r\nDefault: Is already quite powerful in most situations, but still lacks the punch in stronger fights.\r\nProblem: Simply increasing the range and damage makes you feel like a walking hack, instead of wielding a powerful artifact.[color=#F88017]\r\nSolution: Damage scales to stronger enemies, draining the health of stronger enemies moderately while avoiding to drain weaker enemy health too fast. This effect is already powerful, so to balance it, I made it only occur during the night. As an alternative, during the day (and only the day) you gain bonus magic and fire resist from this Ebony Mail (I got the idea from the lore).\r\n[/color]\r\n\r\n[color= #FDD017]\r\nNECROMANCER AMULET[/color]\r\nDefault: Too weak. You can easily enchant a better amulet. \r\nProblem: Simply adding/multiplying the numbers of this artifact doesn\\'t make it all that useful.[color=#F88017]\r\nSolution: I completely changed what this artifact does to suit a true Necromancer/Summoner. The amulet now grants one additional summon (like the twin souls perk; works with twin souls) as well as increasing the duration of your summons to near permanent (so they feel like a constant companion) at the cost of 300% increased mana to summon them, so you can\\'t just summon your strongest one right away (you\\'d need to level up and gain more mana), you\\'d be forced to summon a weaker but permanent creature compared to your usual temporary summon.\r\n[/color]\r\n\r\n[color= #FDD017]\r\nARCHMAGE ROBES[/color]\r\nDefault: It\\'s alright but nothing special.\r\nProblem: Again, simply increasing the numbers does not make this artifact all that useful nor unique.  Not to mention it might cause balance problems (easily attaining the zero spell cost effect).[color=#F88017]\r\nSolution: I overhauled how it works while keeping true to the spirit. The spirit of this artifact is that it enables you to cast more spells. I changed it so that you can cast more spells, not all the time, but only when you need to. Spells still cost the normal amount, but are discounted (to 50%) once your mana falls below half. Permanently grants +50 mana. I also added 50% damage reduction from all bladed weapons when you have a spell equipped. This will go a long way in helping mage survivability.\r\n[/color]\r\n\r\n[color= #FDD017]\r\nGAULDUR AMULET[/color]\r\nDefault: Doesn\\'t live up to its story.\r\nProblem: Simply increasing the stats does not make one able to \\\"lay waste to surrounding villages\\\" as the lore states.[color=#F88017]\r\nSolution: I changed this amulet into an offensive one, instead of providing defensive bonuses. The amulet now grants the user power only if the user is \\\"still powerful\\\". I got this idea from the lore. Now grants +45 bonus to all 3 stats as long as your health is above half. Spells cast while you are at full health are now 40% stronger. This way you gain much more strength at the start of the battle, but not permanently, trading blows will diminish your advantage. The point of this artifact is to deal as much damage as you can at the start, making it comparable to the lore. \r\n[/color]\r\n\r\n[color= #FDD017]\r\nRING OF NAMIRA[/color]\r\nDefault: Ends up being known as \\\"that\\\" stam ring.\r\nProblem: Simply increasing the bonus stamina doesn\\'t help. Still makes the ring bland.[color=#F88017]\r\nSolution: The ring now transforms the user into a true champion of Namira. Since Namira is the patron of slugs and parasites, the ring now causes the user to passively absorb magicka and stamina from nearby enemies at the cost of greatly reduced regeneration rates. Namira is also the patron of darkness so I added a bonus night-only effect, 10% reflect damage to make it consistent with the lore.\r\n[/color]\r\n\r\n[color= #FDD017]\r\nRING OF HIRCINE (Incomplete)[/color]\r\nDefault: Useful for only werewolf type characters.\r\nProblem: I wanted to do so much with this ring but I realize a lot of modders have already changed how lycanthrophy works (allowing you to toggle transformation even, making this ring useless).[color=#F88017]\r\nSolution: No idea, I\\\\\\'m still thinking about it. Right now it just grants bonus 30% movement speed at night. Changing this ring might not be as efficient because werewolf mods also edit this ring.\r\n[/color]\r\n\r\n[color= #FDD017]\r\nMASK OF CLAVICUS VILE (Incomplete)[/color]\r\nDefault: It\\'s a good model. Shame you would rarely find time to wear it.[color=#F88017]\r\nSolution: Right now it grants more barter and persuasion than default (but not significantly more). Since this the patron of bargains we are talking about, I plan to sync this artifact with daedric artifact weapons. Wearing this facemask while wielding a daedric artifact weapon should grant bonuses (planned, will work on it once I start editing the weapons). Think of it as Clavicus bargaining the other daedric gods to give you more power. \r\n[/color]\r\n\r\n[color= #FDD017]\r\nSAVIOR\\'S HIDE[/color]\r\nDefault: Its not much stronger than self made chestplates. The only unique thing is magical resist.\r\nProblem: Simply increasing the permanent magic resist makes it stack with other magic resist items, and thus allowing you to reach the cap easily. This is an unbalanced way of changing it.[color=#F88017]\r\nSolution: Overhaul of course! This item now focuses on \\\"saving you from death\\\". It grants bonus 100 health when you are low on health (50% or less) while also giving you a special protection that makes you almost never take damage from arrows. You also cannot be staggered, get hit by crits or take fall damage.\r\n[/color]\r\n\r\n[color= #FDD017]\r\nSHIELD OF YGASMOR[/color]\r\nDefault: A mid level shield that grants magic resist and health. A lot of other items already does this, it is redundant and encourages stat stacking.[color=#F88017]\r\nSolution: I changed this shield to be a \\\"physical defense\\\" focused shield, compared to other artifact shields. Now grants bonus 40hp permanent and 15% passive damage reduction. Blocking gives you 50% damage reduction from all melee weapons.\r\n[/color]\r\n\r\n[color= #FDD017]\r\nSPELL BREAKER[/color]\r\nDefault: An awesome shield that creats a magical forcefield that blocks spells from those pesky casters! ....well only if you are fighting against novice mages.\r\nProblem: Simply increasing the ward effect makes it a spell immune shield, while consistent with lore, makes it unbalanced.[color=#F88017]\r\nSolution: I couldn\\'t really think of much for this. I just gave it a 150 ward shield instead of the default 50, blocking most on hit spells save the strongest ones. It also grants 20% magic resist while blocking, making it much more useful as well as an additional 20% chance to spell absorb. While each of these stats isn\\\\\\'t too powerful, combined they make for quite a good anti-mage shield.\r\n[/color]\r\n\r\nDAEDRIC WEAPONS \r\n\r\n[color= #FDD017]\r\nRUEFUL AXE[/color][color=#F88017]\r\nSolution: Now a really fast cutting axe. 1.0 base speed.\r\nClavicus Bonus: Completely ignores enemy armor. \\\"So sharp it can even cut a god\\\" as the guards would sometimes say.\r\n[/color]\r\n\r\n[color= #FDD017]\r\nWUUTHRAD[/color][color=#F88017]\r\nSolution: Grants a special power attack. Really slow but deals enormous damage. Only works on the base humanoid races.\r\nClavicus Bonus: 70% damage resist while power attacking.\r\n[/color]\r\n\r\n[color= #FDD017]\r\nEBONY BLADE[/color][color=#F88017]\r\nSolution: Greatly increased the limit for killing friends. You now gain bonus absorb health damage as you keep on killing friends. (Old limit was at 30, now it is along the 200\\'s) So it\\'s up to you how much you are willing to kill and power up the weapon.\r\nClavicus Bonus: 50% damage resist while swinging your weapon.\r\n[/color]\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "79",
  "version": "0.2a",
  "author": "Solarcow",
  "createdUnix": "1372079051",
  "updatedUnix": "1373251455",
  "containsAdultContent": false,
  "uploadedBy": "aysigago",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028779",
      "name": "AwakendArtifacts_01a",
      "version": "0.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "AwakendArtifacts_01a-35800-0-1a.rar",
      "uploadedUnix": "1368001183",
      "modVersion": "0.1a",
      "virusScanUrl": "https://www.virustotal.com/file/637c50009b4d615f6819458d9c4267b9da1e686dd977452ee968f58baf8ed684/analysis/1407560703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AwakendArtifacts_01a-35800-0-1a.rar?fid=1000028779&ttl=1535814566&ri=8192&rs=8192&setec=1c310758ee7580fc466a82a1b1c55ff0"
    },
    {
      "fileId": "1000037801",
      "name": "AwakendArtifacts_02a",
      "version": "0.2a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "AwakendArtifacts_02a-35800-0-2a.rar",
      "uploadedUnix": "1373251455",
      "modVersion": "0.2a",
      "virusScanUrl": "https://www.virustotal.com/file/dae5b6eb1eb0ca538a250e34d4605a9d5f4358ea5a39eda6b1e1f37087885f7d/analysis/1407634749/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AwakendArtifacts_02a-35800-0-2a.rar?fid=1000037801&ttl=1535814566&ri=8192&rs=8192&setec=fd45c2aa1cd97282f8f02742495801cf"
    }
  ]
}