{
  "modId": 35814.0,
  "modName": "A new quest - Mystra",
  "summary": "WIP : Will requires DawnGuard and Dragonborn to work !! \r\n----No files added at the moment, waiting there\\'s something to upload, as it still heavily in work----\r\n",
  "descriptionHtml": "Since immemorial times, there are legends. Legends like Dragonborn, are knowed by everyone. These legends can persist, as there is someone to teach us what is this legend.\r\nBut, sometimes, old lost legends resurface, when no one is prepared. These legends, wich were forgotten since a long time, are yet the the more terrible.\r\nAn old confict is going to had an impact in our world of Skyrim.\r\nHigh, in the sky, where no one -even the dragon-, can go, two legions, darkness and light, corruption, and justice, these two ideals are fighting for an old Temple. Before, the legend was talking about this. But now, this knowledge have been lost. However, there is someone, who have never forgot. He was waiting his time. And his time has come. He must find someone who can stop this old conflict, before it\\'s become too dangerous.\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[color=#00CCCC] [u] FEATURES : [/u] [/color]\r\n\r\n-An entire world to explore :\r\n         - 1 Continent ; More than 10 towns ; 2 planes (like sovngarde and soul cairn... well... you know what I mean, huh ?...) ; 2 warzones ; 1 Epic Fight : 2 Boss. ; 3 player home.\r\n         -3 factions to join, as you want. Will you choose the Justice, the Corruption, or the humility way ?\r\n         -Some custom armors and weapons (... bu absolutely not sure as I don\\'t know how too use Nifskope aside to link textures for meshes)\r\n         -Quest, Original soundtrack, more than 100 new books fully voiced (in french only at the moment... looking for some who would like to voiced the dialogs in english)\r\n         -Some memorable sequence ([spoiler]I believe I can fly...[/spoiler])\r\n         -And many other I still don\\'t know ! \r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nSo, yes, it\\'s a really BIG project, but since the catastrophe of \\\"Strong heart Island\\\" (in my Image Section), I wasn\\'t in peace with myself. So, I\\'ve decided to work on another project, bigger, better, but especially LONGER. \r\nAnd I\\'m still looking for some French tuto on CK script, eheh... I\\'ve some idea, but I\\'m quite lost face to a script. But I will find ! You will see I\\'m more a level designer at heart than a programer... \r\n\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[b][u][color=red] CREDITS [/b][/u][/color]\r\n\r\nBethesda\r\nTwo Steps From Hell, for their fabulous music, useful when I was working.\r\nAll them who have support me\r\nMy coffee, for the long night...\r\nAnd, most important : All of you, Nexus Community !\r\n\r\n\r\n\r\n",
  "categoryId": "30",
  "version": "On.Paper",
  "author": "Noldorakk",
  "createdUnix": "1368038653",
  "updatedUnix": "1368038653",
  "containsAdultContent": false,
  "uploadedBy": "Noldorakk",
  "primaryFile": null,
  "files": []
}