{
  "modId": 35820.0,
  "modName": "SAB -  Skyrims Altered Beast",
  "summary": "Transform into the ultimate beasts of destruction become the ultimate shapeshifter - Inspired by the old altered beast games: Altered Beast PS1, Project Altered Beast PS2 ",
  "descriptionHtml": "[img] http://static.skyrim.nexusmods.com/mods/images/35820-1-1368047486.png [/img]\r\n \r\nHOW DO I TRANSFORM/REVERT FORM\r\nThere is a ring in your inventory named ab selection menu use that to transform, there is a ab revert form wen u have transformed in your inventory use that to revert form\r\n\r\nALTERED BEAST PROTOTYPE(Download now) realeased 8/6/13\r\nThe altered beast prototype download is the main file of the mod but this is just a test for you the public to report comments to me for feed back and acording the the comments this might not be the final release so thats why its a prototype\r\n\r\nHOW DO I START THE QUEST ?\r\nTo start the quest you must  go to the breezhome and by the fire will lay a book once you read it you will start the quest. If you do not have breezhome as a house then press the button to the left to ur 1 key and type coc whiterunbreezehome and that should teleport you there \r\n\r\n[color=red] MAIN \r\nThis mod brings back the shape shifting from the previous classics Altered Beast for the PS1 and the PS2. This mod adds a total of 7 new creatures to transform into with each of there own abilities and specials. To obtain these powerful transformations you must first follow the quest to secure all 7 of these transformations. To do this the player must follow the quest and kill the demons that posses these things called gnome chips (which were added from altered beast). For information on Genome chips look below. Once these Genome chips are obtained the player is free to transform anytime they want without any limitations, this also applies to revert form. There is also a upgrade menu for the beasts for you to personally upgrade the way you want and desire.   [/color]   \r\n \r\nREAD ABOUT THE GAME HERE http://en.wikipedia.org/wiki/Altered_Beast_(2005_video_game)\r\n\r\n\r\n\r\nCONTROLS \r\nLeft Attack =  special or normal attack \r\nRight Attack = normal attack or special attack                                    \r\nPower Attack = normal attack                                                           \r\nJump = special 2 \r\nDual attack = Power attack                                  \r\nTransform = There is a ring called AB Beast selection Menu\r\nRevert Form = There is a ring in your inventory named AB Revert\r\n-------------------------------------------------------------------------------------------------------------------------------------------\r\n[color=green]\r\nGENOME CHIPS \r\nGenome chips arrived in the second altered beast for the ps2 in 2004. Gnome chips were chips that the player fount and obtained to become the beasts of the wild, for the player to powerfully use against his enemies.  [/color]\r\n-------------------------------------------------------------------------------------------------------------------------------------------\r\nBEAST SELECTION MENU \r\nI decided to create a menu for the player to choose which beast to play as, i did this because for the player to have more control and not to have to keep selecting there power plus you can transform for as long as you like.\r\n\r\n[img] http://skyrim.nexusmods.com/mods/images/35820-1-1369592600.png [/img]\r\n-------------------------------------------------------------------------------------------------------------------------------------------\r\nTHE BEASTS \r\nThe beasts that you are able to transform into all adapt to different environments in their own way, they all have there own specials and attacks and have there pros and cons in different situations but is up to you to master the way of the beasts and to adapt to their cons and work with them to become the ultimate shape shifting bad ass!!  \r\n\r\n\r\n\r\n[img] http://skyrim.nexusmods.com/mods/images/35820-2-1369592601.png [/img]\r\n\r\nINFO\r\nFlaming Bear also known as subject 3562, this subject has the power to wield the power of fire, to throw fire balls at its enemies for its enemy to feel the power of fire, this subject also has the ability to set itself on fire burning anyone around it.\r\n\r\n[img] http://skyrim.nexusmods.com/mods/images/35820-3-1369592602.png [/img]\r\n\r\n\r\nINFO\r\nFrost Troll also known as subject 3654, as  it has the form of a frost troll but it is more developed and stronger. The Frost Troll has the power to wield the power of ice by allowing it to throw a small blizzard at its enemies, the subject also has the power to set itself  into a blizzard, freezing anyone that dares to fight it.\r\n\r\n[img] http://skyrim.nexusmods.com/mods/images/35820-4-1369592602.png [/img]\r\n\r\nINFO\r\nThe Giant also known as subject 3798, takes the form of a giant but overall is much more powerful. The subject is the 2nd biggest of the rest of the subjects, it has the power to smash enemies with its upgraded and more powerful giant club, it also can stomp the ground to cause a small earthquake, deeply staggering those who oppose it. \r\n \r\n[img] http://skyrim.nexusmods.com/mods/images/35820-5-1369592602.png [/img] \r\n\r\nINFO\r\nShouting Sabre Cat also known as subject 3214, takes the from of a Sabre cat. Subject 3214 has the ability to use the unrelenting force shout and the slow time shout on his enemies, he was the first subject to be able to shout while in beast form.\r\n\r\n\r\n[img] http://skyrim.nexusmods.com/mods/images/35820-1-1369592755.png [/img] \r\n\r\nINFO\r\nLightning Skeever also known as subject 3421, takes the form of a skeever. Subject 3421 has the ability to change the weather from clear and sunny to a lightning storm that shocks any of its enemies that oppose it. it also has the ability to leap forward and shock its enemy\r\n\r\n[img] http://skyrim.nexusmods.com/mods/images/35820-1-1369769311.png [/img]\r\n\r\nINFO\r\nThe Dragon also known as the mistake, is a beast that was not meant to be created and certainly not to be used on its enemies. The mistake takes the from of a dragon one of skyrims most powerful creatures. The mistake has the power to bite and dread health from its enemy and it to be restored to itself, mistake also has the ability to use its tail to stomp the ground thas causing meteorites to fall from the sky onto its enemies. The special thing about The Mistake is that the user can select its own shouts to use on its enemies. The Mistake is also the biggest out of the subjects and is the only one to be able to use its own shouts on its enemies,  \r\n\r\n\r\n\r\n\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n\r\n\r\n[color=green]   BONUS BEAST THE DRAGON\r\nWhen all genome chips have been collected there are 2 bonus beasts to unlock for the player to be the ultimate shape shifting monster, there is only one that will be revealed and that is the dragon . [/color]\r\n-------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[color=yellow]\r\nQUESTIONS \r\n\r\nIS THERE A TIME LIMIT WHEN I TRANSFORM ?  \r\nNo you can stay in beast form for as long as you want \r\n \r\nCAN I TRANSFORM ANYTIME I WANT ? \r\nYes [/color]\r\n\r\n\r\n\r\nINSTALLATION (Recommended)  \r\nThe recommended installation is to install with nexus mod manager as there is a custom installation menu for the user to enhance their shape shifting experience ",
  "categoryId": "93",
  "version": "1.0",
  "author": "mrwoody",
  "createdUnix": "1375789020",
  "updatedUnix": "1375788161",
  "containsAdultContent": false,
  "uploadedBy": "mrwoody",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000044653",
      "name": "Altered beast v1 Prototype ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13575",
      "fileName": "Altered beast v1 Prototype -35820-1-0.rar",
      "uploadedUnix": "1375788161",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/58c993ca64884b377c36af4d8fc9a6a1d0a9fc33fefab9f8f9f12138b9852271/analysis/1407671142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Altered%20beast%20v1%20Prototype%20-35820-1-0.rar?fid=1000044653&ttl=1535814602&ri=8192&rs=8192&setec=e6a777917ff86ede01eff6bc5fe8a93f"
    }
  ]
}