{
  "modId": 35841.0,
  "modName": "Helgen Reborn",
  "summary": "Helgen Reborn is a fully voiced adventure with over 20 superb voice actors. As you help rebuild the town you&#39;ll reunite two old friends, uncover an underground slavery ring, battle in an arena and many other adventures&#33; If you enjoyed other Mike Hancho mods, you will be blown away by Helgen Reborn as this is my most ambitious mod to date.",
  "descriptionHtml": "[center][img]http://ypdesign.com/skyrim/helgen/nexus/header.png[/img][/center]\r<br />[center][img]http://ypdesign.com/skyrim/helgen/nexus/splash.png[/img][/center]\r<br />\r<br />[center][url=http://www.pcgamer.com/2013/06/30/mod-of-the-week-helgen-reborn-for-skyrim/][img]http://ypdesign.com/skyrim/helgen/nexus/pc-gamer.png[/img][/url][/center]\r<br />[center][url=http://www.bethblog.com/2013/09/18/skyrim-modding-inverview-mike-hancho/][img]http://ypdesign.com/skyrim/helgen/nexus/beth.jpg[/img][/url][/center]\r<br />[center][url=http://skyrimgems.com//][img]http://ypdesign.com/skyrim/helgen/nexus/gems_logo.png[/img][/url][/center]\r<br />\r<br />[img]http://ypdesign.com/skyrim/helgen/nexus/introduction.png[/img]\r<br />From the author of Fallout: New Vegas&#39; &#34;New Bison Steve Hotel&#34; and &#34;Afterschool Special&#34; mods, comes my most ambitious adventure yet&#33; Simply put, Helgen Reborn is [i]THE[/i] definitive quest mod for rebuilding Helgen&#33; Learn the legend of The Keepers of Hattu as you reunite two old soldiers and are thrust into a decades old feud with a ruthless and powerful Justiciar from the Aldmeri Dominion. Recruit and train your own town guard or ask for protection from the Empire or Stormcloaks. From uncovering an underground slavery ring, to fighting for your life in exciting battles in a secret new arena, many other adventures await as the workers rebuild the town step by step&#33; You&#39;ll be rewarded with your own private tower in Helgen which includes the most interactive and dynamic display museum in Skyrim&#33; \r<br />\r<br />If you enjoyed other Mike Hancho mods, you will be blown away by Helgen Reborn as this is my biggest project yet, and has been in development for over a year and a half&#33; And of course Helgen Reborn sets the same quality standards for a quest mod that you&#39;ve grown to expect from a Mike Hancho project&#33;\r<br />\r<br />\r<br />[img]http://ypdesign.com/skyrim/helgen/nexus/features.png[/img]\r<br />[list][*]V105 adds 6 new custom dungeons&#33;[/*]\r<br />[/list][list][*]V105 adds marriage option for Cienna[/*]\r<br />[/list][list][*]V105 adds a lot more misc dialog for the characters[/*]\r<br />[/list][list][*]V105 adds repeatable recruiting options for Hattu guards[/*]\r<br />[/list][list][*]V105 adds a quest to move Haming and Froki to the empty house on the hill[/*]\r<br />[/list][list][*]V105 adds custom quests for the guards missions (replaced radiant quests)[/*]\r<br />[/list][list][*]Fully voiced with 20 of some of the best actors in the community[/*]\r<br />[/list][list][*]Easily 4 to 6 hours of game play (that is a VERY conservative estimate)[/*]\r<br />[/list][list][*]Three new sets of armor[/*]\r<br />[/list][list][*]Mike Hancho&#39;s meticulous attention to detail[/*]\r<br />[/list][list][*]Great story and characters[/*]\r<br />[/list][list][*]Private Tower player home[/*]\r<br />[/list][list][*]Interactive display room that transforms as you play the game[/*]\r<br />[/list][list][*]HUGE cavern to display stuffed creatures[/*]\r<br />[/list][list][*]Completely transforms Helgen into a vibrant community[/*]\r<br />[/list][list][*]Multiple faction options for the town include Independent, Stormcloak or Imperial[/*]\r<br />[/list]\r<br />[img]http://ypdesign.com/skyrim/helgen/nexus/reviews.png[/img]\r<br />\r<br />[youtube]iao18UxKVmo[/youtube]             [youtube]fJ9ZZ8BjcxQ[/youtube]\r<br />\r<br />[img]http://ypdesign.com/skyrim/helgen/nexus/getting-started.png[/img]\r<br />First of all before you install this mod and start your game with it loaded, make a NEW hard save. You should save often with not only this mod, but any mod. (See rant below)\r<br />\r<br />Install manually by placing Helgen Reborn.esp and Helgen Reborn.bsa in your games Data folder or install with Nexus Mod Manager. Generally, all users should install version 106.\r<br />\r<br />If you are starting a new character it is imperative that you leave Helgen Reborn UNCHECKED until you exit the cave with Hadvar/Ralof. Make a NEW hard save right there and load my plugin. It&#39;s fine if it is installed, just uncheck it in your plugin list until you exit the cave. The reason for this is if you try to start a new game from the main menu with my mod loaded it will likely place you standing by the cart you&#39;re supposed to be in, or several other strange behaviors. This is caused by a bug whereby editing the navmesh in Helgen causes the cart ride to fail. Since I cannot have a new town without finalizing the namnesh to link the teleports for my new shops, this issue is unavoidable.\r<br />\r<br />While you can certainly play at any level, I&#39;d say around level 20ish is a good sweet spot for a great combat experience. If you&#39;re a level 80 character with maxed out skills and perks, nothing in the game is going to be very challenging. Also, if you have any level character where you&#39;ve installed and uninstalled a lot of scripted mods, you&#39;re eventually going to have trouble with your save whether you run my mod or not. Missing scripts cause errors and will eventually corrupt your save, so I recommend using as clean a save as possible. This applies not only to Helgen Reborn, but any scripted mod.\r<br />\r<br />About 10 seconds after you load the game with my mod installed your journal should update with a new quest. Just follow instructions from there.\r<br />\r<br />But before you speak to Marcus in my quest, I suggest you make sure the bandits that take over Helgen are enabled and in place. These bandits are enabled 4 days after the quest &#34;Unbound&#34; has been completed, but you must enter Whiterun to enable them. You will know for sure they are enabled by checking the gates leading into Helgen and if you have the spikes with the bloody body parts on them, you&#39;re good to go&#33; If you do not, I suggest you wait somewhere for 4 days, then enter Whiterun through the main gate, NOT by fast traveling, then go back to Helgen to make sure they&#39;re enabled. If you&#39;ve killed them before and they haven&#39;t respawned that&#39;s OK. As long as you have the bloody spikes you&#39;re fine.\r<br />\r<br />This mod is 100% compatible with Alternate Start - Live Another life. I still recommend that you follow Arthmoor&#39;s quest and run through the keep to trigger anything left over from Unbound.\r<br />\r<br />As for any other Alternate Start type mods, generally as long as they set everything to the condition it would be in a vanilla start after Helgen is destroyed, you&#39;re probably good to go. But again, the suggestion about the bandits above apply to everything whether vanilla or Alt start. These steps are recommended due to the way Bethesda set up these events in the vanilla game.\r<br />\r<br />If the Quick Start Quest somehow fails, you can start the quest with the console by putting in: SetStage BalokHelgen01 5\r<br />\r<br />[u][b][size=4]IMPORTANT INFORMATION&#33;[/size][/b][/u]\r<br />I&#39;ve honestly been astounded at the number of players who don&#39;t save. Rule number ONE with any Bethesda game is save, save, save, especially if you&#39;re using mods&#33; I usually don&#39;t go more than 30 minutes or so without saving, and I ALWAYS save before initiating dialog with an active quest target. I learned this the hard way after I lost an entire character in Fallout 3 that I had literally been playing for weeks. So neglect to save only as much time as you&#39;re willing to lose. I&#39;m NOT responsible for any loss of your character or your time&#33;\r<br />\r<br />[img]http://ypdesign.com/skyrim/helgen/nexus/updates.png[/img]\r<br />[b][u][size=5]Version 105.3 Notes - Released 01-26-14[/size][/u][/b]\r<br />\r<br />This is a minor update that tweaks a few small issues in Staadomaar as seen below. If you&#39;ve already played the mission to Staadomaar, there&#39;s not much reason to update unless you just want to be using the most current version, which is always a good idea.\r<br />[list][*]Complete overhaul of the quest objectives during the Staadomaar mission. Fixes the confusing quest pointer that was pointing to the new worldspace, but shows up on the map near Whiterun.[/*]\r<br />[/list][list][*]Adds pull chains to both sides of several doors in Staadomaar that only had a chain on one side.[/*]\r<br />[/list][list][*]Removes a Gas Trap that was reported to throw entries to the script log.[/*]\r<br />[/list][list][*]Puts collision and rubble piles in a few places where the player or NPC&#39;s could get stuck.[/*]\r<br />[/list][list][*]Tweaks the Roombounds and Portals in Staadomaar where there were a couple of trouble spots. (Requires a new save to take effect.)[/*]\r<br />[/list][list][*]Minor navmesh tweaks.[/*]\r<br />[/list]\r<br />[b][u][size=5]Version 105.2 Notes - Released 12-22-13[/size][/u][/b]\r<br />[list][*]This update is a small but important patch to fix a few issues I found in Version 105 & 105.1 as follows:[/*]\r<br />[/list][list][*]Fixes Cienna&#39;s barter package that was conditioned incorrectly and could stop working.[/*]\r<br />[/list][list][*]Fixes an incorrect mesh path that rendered the claw display inoperable.[/*]\r<br />[/list][list][*]Rolund&#39;s voice files have been EQ&#39;d again for better quality and level.[/*]\r<br />[/list][list][*]Fixes a couple of minor script errors.[/*]\r<br />[/list][list][*]Removes some superfluous scripting.[/*]\r<br />[/list][list][*]Cleaned with TesVedit record-by-record in every cell for a MUCH cleaner mod.[/*]\r<br />[/list][list][*]Removed various navmesh, cell and reference edits that were unnecessary.[/*]\r<br />[/list]\r<br />[b][u][size=5]Version 105.1 Notes - Released 12-15-13[/size][/u][/b]\r<br />[list][*]This update includes everything in V105 below, plus the following changes:[/*]\r<br />[/list][list][*]Splits Staadomaar ruin into 2 cells to help those with issues of hanging up or hitting the memory cap.[/*]\r<br />[/list][list][*]Complete re-voice for Froki Whetted-Blade by River Kanoff including all the voice for Kyne&#39;s Sacred Trials & Haming Gets a Home.[/*]\r<br />[/list][list][*]Added all new guards in the Thalmor prison to help those whose games refused to respawn the cell when called to Reset.[/*]\r<br />[/list][list][*]Tweaks to follower packages.[/*]\r<br />[/list][list][*]Adds several new weapon plaques to the display room and tweaks the lighting.[/*]\r<br />[/list][list][*]Adds a new slot in the claw display for the Black Glass Claw found in Staadomaar.[/*]\r<br />[/list][list][*]Other minor tweaks you probably wouldn&#39;t notice.[/*]\r<br />[/list]\r<br />[b][u][size=5]Version 105 Notes - Released 10-27-13[/size][/u][/b]\r<br />\r<br />[color=#80BFFF][b][u]NEW FEATURES IN V105 AND UP[/u][/b][/color]\r<br />\r<br />[b][u]No more radiant quests&#33;[/u][/b] - All formerly &#34;radiant story&#34; generated quests for Helgen&#39;s guards are now all overhauled and have custom dungeons. (see below) This means NO MORE unfilled aliases for the bosses&#33; The new locations include:\r<br />\r<br />[url=http://ypdesign.com/skyrim/helgen/dungeon.htm][b][u]Staadomaar Ruin & Temple[/u][/b][/url] - MASSIVE Nord ruin and new worldspace by Wereta. In my opinion it&#39;s one of the most unique feeling ruins in the game, and you don&#39;t want to miss it&#33; Yes, it&#39;s THAT good&#33; The boss fight at the end has been pretty epic in my testing&#33;\r<br />\r<br />[url=http://ypdesign.com/skyrim/helgen/embershard.htm][b][u]Upper Embershard &#34;Haunted&#34; Mine[/u][/b][/url] - Medium sized mine with scripted &#34;ghostly&#34; encounters and really powerful boss. I&#39;m really happy with how this level turned out&#33; It was truly a team effort between myself with the concepts for the story and encounters, basic level design & scripting, Yogo&#39;s final scripting and FX, Wereta putting in the finishing touches of clutter, and Piper pulling it all together with her incredible performance for Hanna. I can&#39;t thank you guys enough for helping me bring the vision I had for this level to life.\r<br />\r<br />[b][u]Pinewatch Mine[/u][/b] - New camp by Mike Hancho and mine by Wereta inhabited by bandits near Pinewatch who are making weapons and gathering their forces to attack Helgen.\r<br />\r<br />[b][u]Brittleshin Cavern[/u][/b] - New custom level by Ionis the Bear added to Brittleshin Pass filled with Necromancers and Warlocks. The entire vanilla Brittleshin Pass level has been repopulated and is a lot more fun and challenging.\r<br />\r<br />[b][u]Shriekwind Sanctum[/u][/b] - Small and interesting vampire lair by Ionis the Bear added to the vanilla Shriekwind Bastion level. Like Brittleshin Pass, Shriekwind Bastion has been repopulated and plays like a different level than before.\r<br />\r<br />[b][u]Skybound Crypt[/u][/b] - Small nord ruin by Mike Hancho filled with bandits. The entire Skybound Watch exterior and interior has been filled with bandits preparing to attack Helgen. Fight your way through them to their leader and end the threat to Helgen once and for all.\r<br />\r<br />[b][u]More dialog[/u][/b] - New misc dialog for nearly all of my actors&#33; Now, for the most part, they shouldn&#39;t be silent if you try to talk to them. They won&#39;t really have conversations with you, but at least they&#39;re not mute, lol.\r<br />\r<br />[b][u]Cienna marriage option[/u][/b] - Added the option to marry Cienna after you meet certain conditions. The main quest City on a Hill must be completed and Cienna must be tending her shop - NOT following you. The dialog to start the courting will NOT be valid unless she is in her shop&#33; Cienna also must have followed you at least one time, and you must be wearing an Amulet of Mara and have talked to a priest to learn about marriage in Skyrim. Obviously, you cannot be married either. Once those conditions are met, you should have valid dialog to tell her you wanted to talk to her. If you&#39;re updating from an earlier version and she already spoke to you about being available to travel with you you&#39;ll have to go through that again because out of necessity I had to restart her quest. Just follow it like it was the first time you talked to her after the mission for Korst.\r<br />\r<br />[b][u]Joto gets a dog&#33;[/u][/b] - If you&#39;re clearing the new Brittleshin Cavern level with Joto for his evaluation, a stray dog will come from his hiding place and greet Joto and become his new friend. If you already evaluated Joto with one of the former radiant quests, you&#39;ll find the dog in the cavern if you go there by yourself.\r<br />\r<br />[b][u]Recruitable guards[/u][/b] - All Independent guards are now permanent recruit-able teammates when you want them to travel with you. After you finish all of the evaluation quests, just tell them you want them to come with you and they become teammates until you dismiss them&#33; They also have options to access their inventory items so you can change their weapons and armor.\r<br />\r<br />[b][u]Haming gets a home&#33;[/u][/b] - Move Froki and Haming into the empty house on the hill if you wish to.\r<br />\r<br />[b][u]New voice actors&#33;[/u][/b] - New voice actors for Balfring, Joto and Altan. Unfortunately, Mike Quinlan was not available to voice more lines for Joto&#39;s dog quest, but I found Joe MacKenzie who did an amazing job on the part&#33; He also recorded the new lines for Altan, and Daniel Hodge (the awesome voice for Wiglaf) re-voiced Balfring for me.\r<br />\r<br />[img]http://ypdesign.com/skyrim/helgen/nexus/faq.png[/img]\r<br />[color=#80BFFF][b]Q - Which version should I be using?[/b][/color]\r<br />\r<br />A - All NEW users who have never had any previous version of my mod installed should be using V106.\r<br />\r<br />[color=#80BFFF][b]Q - I&#39;m trying to start a new game, and the cart ride is broken.[/b][/color]\r<br />\r<br />A - As I mentioned under Getting Started, &#34;If you are starting a new character it is HIGHLY recommended that you leave Helgen Reborn UNCHECKED until you exit the cave with Hadvar/Ralof. Make a NEW hard save right there and load my plugin. It&#39;s fine if it is installed, just uncheck it in your plugin list until you exit the cave. The reason for this is if you try to start a new game from the main menu with my mod loaded it may place you standing by the cart you&#39;re supposed to be in. This is caused by a bug whereby editing the navmesh in Helgen causes the cart ride to fail. Since I cannot have a new town without finalizing the namnesh to link the teleports for my new shops, this issue is unavoidable.&#34;\r<br />\r<br />[color=#80BFFF][b]Q - Somebody won&#39;t talk to me. It says they&#39;re busy or I can&#39;t advance the dialog even though my journal clearly tells me to speak to them.[/b][/color]\r<br />\r<br />A - They&#39;re most likely stuck in a scene. Make a save right there and reload. You may have to try this a couple of times to get it &#34;unstuck&#34;. You can also try waiting for 1 hour at a time for a few hours, saving and reloading. Some have said that exiting the cell they are in and even leaving the game and reloading works. Others say beating the person down into bleedout works, while others have just gone and done something else for an hour or two and they were fine when they returned. I use use a stop on every stage a scene sets when it updates, so in theory this should never happen but it seems they still hang up sometimes. I highly recommend that when 2 or more of my actors are involved in a conversation that you are watching that you don NOT run off in the middle of the conversation. Once the conversations are over, they will normally say goodbye to each other and either resume their normal routines, force greet you or otherwise get ready for you to talk to them. Be patient and allow the quest a few seconds to catch up before you talk to them. It is my belief that the scripting system forgets some scripts threading through the que and this can sometimes cause a scene not to complete properly, even though I call that scene to stop in the stage that updates the objectives.\r<br />\r<br />[b][color=#80BFFF]Q - I&#39;m in the Fight Cave and it&#39;s stuck and I can&#39;t continue.[/color][/b]\r<br />\r<br />A - This includes not being able to advance the dialog with Wiglaf, or a fight getting stuck sometime before, during or after the fight and not advancing, not starting or hanging up in the middle. This could be the stuck scene issue I detail above, but the cause could be that you have a stray gambler who has fallen or spawned in the pit. If you have a gambler in the pit the scene they are a part of cannot advance because they cannot get to their mark. Make a NEW HARD SAVE&#33; Go up to them in 1st person so you can make sure you&#39;re clicking on them, open the console and select them with your pointer. Run around back up to the spectator area and open the console again and move them to you by typing in MoveTo Player. Head back down in the pit, let everything complete and you should be good to go.\r<br />\r<br />[color=#80BFFF][b]Q - I crash whenever I do ___________.[/b][/color]\r<br />\r<br />A - You may be hitting the 3.1 gig memory cap. Try drastically reducing your graphics settings and see if it still crashes. If it does not, you&#39;re probably hitting the cap. If that was not it, it&#39;s probably a load order issue or something specific to your save game, installed, or worse, uninstalled mods, or rig. Nothing of this sort has been widely reported, so I have to assume it&#39;s specific to your setup. Standard mod troubleshooting applies.\r<br />\r<br />[color=#80BFFF][b]Q - I crash when I get near the Thalmor Prison.[/b][/color]\r<br />\r<br />A - If you&#39;re using &#34;The Cyrodiil Frontier - Fight Against the Thalmor II&#34; they are not presently compatible. In V103 and up, I have done everything I can do on my end. I have also tried to contact MadFrenchie, but it appears they have abandoned their mod. Some people have said they were able to fast travel to the Thalmor Checkpoint and walk over to the prison from there, so you may want to give that a try if you&#39;re getting CTD&#39;s.\r<br />\r<br />[color=#80BFFF][b]Q - I finished the haunted mine, now the effect on my screen won&#39;t go away.[/b][/color]\r<br />\r<br />A - Your game ignored my call to remove that ISM, but you can remove it with the console by using RIMOD XX1070C1. The XX is the numerical slot my mod is in your load order. You can get this value by getting near any NPC added by Helgen Reborn, open the console and clicking on them. The first 2 numbers in their RefID are what you need to substitute for the XX.\r<br />\r<br />[color=#80BFFF][b]Q - I saw where Helgen Reborn is incompatible with Civil War Overhaul. Is this true, and what is the nature of the incompatibility?[/b][/color]\r<br />\r<br />A - There&#39;s way too much misinformation about this tiny and VERY minor issue, so here are the facts. Helgen Reborn and CWO are 100% compatible as long as you pick the Independent guards to protect Helgen which in my opinion is [b]BY FAR[/b] the best choice anyway. IMO they are a central part of my story and got a lot more love and attention than the others. The only [i]real[/i] reason to pick the Stormcloaks or Imperials is if you&#39;re hardcore role playing. So, you CAN pick them to protect Helgen, but you&#39;ll have to set the proper stage with the console because the dialog for that choice gets invalidated by CWO and will not show up in your choices. Once you get to the point where Marcus starts talking about needing guards for the town, tab out of the dialog and make a NEW hard save. If you want the Stormcloak guards put this in the console after you save: SetStage BalokHelgen01 90.\r<br />\r<br />If you want Imperials put this in: SetStage BalokHelgen01 81\r<br />\r<br />Obviously, you can only use one. Once you set your stage of choice your objective should update and give you a short journal entry that covers the conversation you would have had with Marcus if CWO didn&#39;t invalidate my dialog.\r<br />\r<br />[color=#80BFFF][b]Q - My follower acts funny in certain spots in Helgen.[/b][/color]\r<br />\r<br />A - That is a navmesh issue where the developers used a series of island navmeshes between the area in front of the inn, around to the front of town. Wherever there were rubble piles there is no navmesh, and everything I tried to do to move the islands and rebuild the navmesh resulted in errors. So I had to leave the vanilla navmesh pretty much alone and work around what they left me to work with.\r<br />\r<br />\r<br />[color=#80BFFF][b]Q - After rescuing the slaves, I exit the cave and some Thalmor guys are waiting for me but it gets stuck and does not advance.[/b][/color]\r<br />\r<br />A - Apparently, there is an issue with a vanilla animation for the Paralysis spell that hangs up for some people. Just set the stage with the console: SetStage BalokBitterWounds 140. You might need to set it again after the next scene. So if it hangs again use this: SetStage BalokBitterWounds 150.\r<br />\r<br />[color=#80BFFF][b]Q - What is the console command to disable the bandits that take over Helgen?[/b][/color]\r<br />\r<br />A - PRID 00F8240 [hit enter] disable\r<br />\r<br />[color=#80BFFF][b]Q - Some weapons I display on the new weapon plaques look out of position.[/b][/color]\r<br />\r<br />A - The new plaques added in V105.1 will allow you to place any weapon on them, but they were designed with a staff in mind. The weapons are positioned based on the spot your hand would grasp it so some swords will look funny. You&#39;ll just have to see what works for you and what doesn&#39;t, but any staff should look fine. In my testing, most maces and axes also look fine. It&#39;s only swords that look funny, but there are already a ton of sword displays.\r<br />\r<br />[color=#80BFFF][b]Q - I&#39;m doing the Shriekwind Bastion mission with my guard, and the level is cleared but my quest won&#39;t update.[/b][/color]\r<br />\r<br />A - There is a central area in Shriekwind Bastion with a pedestal with 3 switches on it. One of the switches opens a hidden rock door that leads to another hidden rock door. When you go into the tiny hall past the first hidden rock door, there is another switch on the left that opens the 2nd hidden door that leads to the NEW sanctum. Your quest target should be pointing right to it.\r<br />\r<br />[color=#80BFFF][b]Q - I&#39;m doing the mission to Staadomaar but can&#39;t find the Black Glass Claw.[/b][/color]\r<br />\r<br />A - When you enter the 2nd cell of Staadomaar, follow the linear path until you come to a flooded room with ramps that lead up to the keyhole that uses the claw. From that room, follow the other exit out, across some gated walkways and into another chamber. Go out of this chamber into the next section and you&#39;ll eventually get to an area with fire pots and oil. Go past the swinging blades and you&#39;ll find a soul gem pedestal that shoots electricity at you. Go past it and to the right and you&#39;ll eventually find a purple lit room with the claw on a pedestal.\r<br />\r<br />[img]http://ypdesign.com/skyrim/helgen/nexus/uninstallation.png[/img]\r<br />As with the Official DLC and any other scripted mod, uninstalling this mod is not recommended or supported and may cause problems if removed. (If the town has been completed, you&#39;ll have a barren, empty town.)\r<br />\r<br />[img]http://ypdesign.com/skyrim/helgen/nexus/credits.png[/img]\r<br />I would like to thank everyone who helped me along the way in building this project including my amazing cast of actors, level designers, texture artists, beta testers, those who submitted screen shots for my oil paintings and anyone else who helped answer my multitude of questions at the Official Bethesda Forums. Is to each of you that this project is dedicated. I&#39;d also like to thank JimReapa at the Bethesda forums for your help early on in sending me all the links to resources, bouncing ideas around together and writing the note you wrote. If I missed anyone I apologize, but please let me and I&#39;ll add you right away.\r<br />\r<br />[b][u]CAST[/u][/b]\r<br />Ben Britton - Marcus \r<br />River Kanoff - Valerius, Froki \r<br />Mauri Majanoja - Korst\r<br />Dante de Glanvill - Aerandil\r<br />Daniel Hodge - Wiglaf, Balfring\r<br />Nicanor K. Delacruz Romero - Maenen, Patsy, Gaenor\r<br />McKenna Swanson - Cienna, Diana, Gamblers\r<br />Piper Petrie - Hanna\r<br />Joe MacKenzie - Joto\r<br />Johannes Envall - Wanan-Dun, Rolund\r<br />Rich Heller - Sorian, Ciel, Viggun, Gambler\r<br />Julian Shanahan - Herd\r<br />Matt Laughlin - Kindrick, Alof, Miles\r<br />Christine Slagman - Orianthi, Josslin, Kar\r<br />Rory Keane - Reinhardt\r<br />Aidan Schneider - Oronar\r<br />Craig Morton - Halindil\r<br />Matthew Simmons - Goreu\r<br />Mike Quinlan - Shadrick Oaken-Heart\r<br />tauntedflail - Falco, Gamblers\r<br />Gamblers - Pippa Winslow, Mike Hancho\r<br />Mike Hancho - Misc voices\r<br />\r<br />[b][u]LEVEL DESIGN[/u][/b]\r<br />Mike Hancho\r<br />Wereta\r<br />Ionis the Bear\r<br />\r<br />[b][u]TEXTURES[/u][/b]\r<br />vipermkii\r<br />Hanaisse\r<br />Plangkye\r<br />Porscha\r<br />\r<br />[b][u]TESTERS[/u][/b]\r<br />DreamKing\r<br />Locksley\r<br />Ysne58\r<br />olympus1483\r<br />Avilyn\r<br />Cheeka\r<br />angusthemagi\r<br />vipermkii\r<br />Laufknoten2\r<br />\r<br />[b][u]MISC[/u][/b]\r<br />Yogo - Scripting in Upper Embershard Mine\r<br />Tom Colebrooke - Memorial Theme\r<br />JimRepa - resources & ideas\r<br />Amethyst Deceiver - scripting for weapon displays \r<br />Official Bethesda Forum members - too many to name individually\r<br />\r<br />[b][u]SCREEN SHOTS[/u][/b]\r<br />Alexander J. Velicky\r<br />Nimbli Bimbli\r<br />dj2005\r<br />Cogstar\r<br />Locksley\r<br />Arthmoor\r<br />Hanaisse\r<br />\r<br />Please take time to endorse if you like the mod, and don&#39;t hesitate to contact me in the comments thread. Enjoy&#33;\r<br />\r<br />MH",
  "categoryId": "35",
  "version": "105.3",
  "author": "Mike Hancho aka Balok",
  "createdUnix": "1368370486",
  "updatedUnix": "1435499551",
  "containsAdultContent": false,
  "uploadedBy": "Mike Hancho",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093586",
      "name": "Helgen Reborn V105_3",
      "version": "105.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "169798",
      "fileName": "Helgen Reborn V105_3-35841-105-3.7z",
      "uploadedUnix": "1390766823",
      "modVersion": "105.3",
      "virusScanUrl": "https://www.virustotal.com/file/b11482d2542f9e8540f3ecfa942cc67969ae2e458a6cd2215edac40c1d2210ae/analysis/1407903300/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Helgen%20Reborn%20V105_3-35841-105-3.7z?fid=1000093586&ttl=1535814642&ri=8192&rs=8192&setec=148e6a8b92e6128a2b01ab6866c73851"
    },
    {
      "fileId": "1000112897",
      "name": "Vivid Landscapes Patch - BETA",
      "version": "1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1848",
      "fileName": "Vivid Landscapes Patch - BETA-35841-1.7z",
      "uploadedUnix": "1402701706",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/a0c8834e6a787e3d04059fc0a3fe359daa12dede03d01aff36e6539c90692b7b/analysis/1408125064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vivid%20Landscapes%20Patch%20-%20BETA-35841-1.7z?fid=1000112897&ttl=1535814642&ri=8192&rs=8192&setec=05f9f6099d859fe43cc6b0ad07bdb729"
    },
    {
      "fileId": "1000165751",
      "name": "Bluecreek Estate Compatibility Patch",
      "version": "1.25",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "827",
      "fileName": "Bluecreek Estate Compatibility Patch-35841-1-25.7z",
      "uploadedUnix": "1435499551",
      "modVersion": "1.25",
      "virusScanUrl": "https://www.virustotal.com/file/0cb19d7c2156527aec529f72b3cbdc8c1a8da56f3d40db16f9d0627b21b296d0/analysis/1435499583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bluecreek%20Estate%20Compatibility%20Patch-35841-1-25.7z?fid=1000165751&ttl=1535814643&ri=8192&rs=8192&setec=7f926e4aa0c22ce6af2c9d9e1039e999"
    }
  ]
}