{
  "modId": 35856.0,
  "modName": "Magic Changes of The Cupcake King",
  "summary": "Some non-Destruction changes to magic.",
  "descriptionHtml": "V.05\r\nMade massive changes To restoration, illusion, and conjuration based magic, these are as follows,\r\nRestoration:\r\nTurn undead now does damage to non undead targets, but Does TRIPLE that damage to an undead target, These spells also work on higher level undead, but they only last for 10 seconds.Dual casting also works on their magnitude now. Here is a chart explaining the variables and new names of the turn undead family of spells.\r\nTurn lesser undead(25): Now called smite. Does 20 damage and turns undead up to level 10.\r\nTurn undead(50): Now called Bolt of light. Does 40 damage and turns undead up to level 15.\r\nTurn greater undead(75):Now called Righteous Fire. Does 60 damage and turns undead up to level 25.\r\nRepel lesser undead (50) : Now called Cleansing wave. Does 30 damage and turns undead up to level 12.\r\nRepel undead (75): Now called Wave of Justice. Does 40 damage and turns undead up to level 20.\r\nBecause i changed the magnitude of the fear the cost of these spells will be low, especially with perks, but they still take slightly longer to cast then a destruction spell, do less damage then a perked destruction spell, and will only level restoration when used on a undead target. (giant undead dragons do not count). However i fell as though the triple damage to undead targets makes up for it, and it will be a refreshing change of pace to have damaging magic without being destruction based. I have made no other changes to any other restoration spells.\r\n\r\nConjuration:\r\nI did not touch the spells for reanimation. I only touched their magical effects, and only partially at that. Now when you dual cast a reanimation spell (not scroll, or power, or vampire ability) the magnitude is boosted as well as the duration.\r\nFor example Raise zombie will raise a corpse that is level 6 or lower. With this mod when you dual cast the spell you can raise a corpse up to level 13 (if my math is right, with standard dual casting parameters). \r\nI have also boosted a perk called dark souls. Now instead of just giving a health boost , it also increases melee and unarmed damage of zombies by 50 points. That might seem overpowering at first. Then you fight a dragon. Then you fight where there isn\\'t a corpse to raise. Then you realize for how situational it is its somewhat balanced.\r\n\r\nIllusion:\r\nI have changed the magnitude and durations uniformaly between all 3 types of mind altering spells.\r\nSingle target cast: Level 10, for 15 seconds\r\nAoe cast: Level 20, for 15 seconds\r\nWith these reduced durations they are cheaper to cast and can be used more freely in combat for more tactical variation. If at first glance these numbers seem low remember, with dual casting, an aoe spell can work on a target as high as level 46 (before other perks).\r\n\r\nCompatablility with other mods : I\\'m almost positive this wont work with any mod that touches the spells and one perk mentioned. other then that it should be fine.\r\n\r\nPlease let me know what you think and of any bugs.",
  "categoryId": "93",
  "version": "0.05",
  "author": "The Cupcake King -ddomke-",
  "createdUnix": "1368133936",
  "updatedUnix": "1368133698",
  "containsAdultContent": false,
  "uploadedBy": "Ddomke",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029036",
      "name": "Magic Changes of The Cupcake King",
      "version": ".05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Magic Changes of The Cupcake King-35856--05.zip",
      "uploadedUnix": "1368133698",
      "modVersion": ".05",
      "virusScanUrl": "https://www.virustotal.com/file/6116bfdefde538140fc858eeab92d3b0846712a9919080303f8fc2c38fe4d1cf/analysis/1407562865/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Magic%20Changes%20of%20The%20Cupcake%20King-35856--05.zip?fid=1000029036&ttl=1535814672&ri=8192&rs=8192&setec=2280ca2f48180a07d451099ab8f33f36"
    }
  ]
}