{
  "modId": 35863.0,
  "modName": "Imperial Mage Armor by Natterforme",
  "summary": "This is a Nexus Exclusive. Adds a low level set of mage armor for Imperials.",
  "descriptionHtml": "Name: Imperial Mage Armor by Natterforme\r\n Version: 1.0\r\n Date: 5/12/2013\r\n Category: Weapons and Armor\r\n Recommended: Skyrim Mod Manager\r\n Author(s): Natterforme\r\n Source: http://skyrim.nexusmods.com/mods/35863/?\r\n\r\n[youtube]iTYH_n2W82U[/youtube] [youtube]TsKaah0ZBZY[/youtube]\r\n[youtube]ckSYR3tdcHs[/youtube] [youtube]oCVm3rk_CGw[/youtube]\r\n \r\nDescription\r\n ===========\r\n This is a Nexus Exclusive. Adds a low level set of mage armor for Imperials.\r\n \r\nLocation\r\n ========\r\nThis armor is available in the Crafting Tables and on the Leveled Lists. Imperial Mages will drop the non armor version.\r\n\r\nDetails\r\n =======\r\n THIS IS A NEXUS EXCLUSIVE! NO STEAM SUPPORT WILL BE OFFERED AT THIS TIME! IF I FIND THAT THIS HAS BEEN UPLOADED TO STEAM WITHOUT MY PERMISSION I WILL NOT BE LENIENT TOWARDS THE UPLOADER(S). YOU HAVE BEEN WARNED!!!\r\n\r\nLore:\r\n\r\n The Imperial Legion is facing a war against inserection in the Holds of Skyrim. Eager to assert the authority of the Empire, General Tulius has been mantled with the responsibly of restoring order. Using every tool at his disposal, Tulius has called upon a branch of the military devoted to the use of magic in wartime applications. Acceling in destructive and restorative spells, the Battle Mages accompany divisions of traditional troops. With the collapse of the Mages Guild in Cyrodiil following the Oblivion crisis, the two splinter groups, the Synods and the College of Whispers, attempt to gain political favor in the Elder Council by sending students into the Imperial ranks as political chess pieces under the pretense of gaining experience. These students are highly suspicious of others and are often distrusted by other soldiers in the army. Despite this, there is no question that they have proven to be an effective fighting force.\r\n\r\n In an age where magic and practitioners of the mystical arts are looked down upon, those serving in the field can achieve success. Although the College of Winterhold does not hold reservations to the practices of the magical arts, they are wary of mages who use magic merely as a destructive tool. Unlike the Spellswords who occasionally pass through the College seeking further training and knowledge, the Battle Mages of the Legion are different. Whereas a Spellsword intuitively uses magic as an extension of themselves, the Mages of the Legion are often not naturally gifted and achieve their power through strict military discipline and numbers. They do not often have an instinctive understanding the magic they weild and are consequently limited in their power. The Battle Mages believe that the College holds an arrogant and elitist attitude towards them and those of the College believe that the mages of the Legion are undermining the goals of studying and practicing magic, to the detriment of all.\r\n \r\n Details:\r\n\r\n This mod adds a set of mage armor to your game. The armor includes a cuirass, boots, gauntlets, and a hood. The armor is usable by both genders and all races. The armor comes in nonarmor, Light armor and Heavy armor versions. Unlike some of my previous mods, the names of each piece will not have the prefix or suffix of NONARMOR/LIGHT/HEAVY and will instead incorporate the feature into the name of each piece properly. The mage version of the armor will drop from Imperial Mages and can be found in the loot tables at a low level. This version is intended to be used with the Mage armor Perk. All versions of the armor can be crafted under the Imperial category at the blacksmith crafting areas. In order to create the Light and Heavy versions, you will need to either loot the basic, unarmored version from an Imperial Mage, get it from a drop, or craft it at any forge. Crafting the Light and Heavy versions is easy. For the Light version, you do not need an extra smithing perk but you will need the each piece plus one leather. For the Heavy version, you need the Steel Smithing perk and the basic piece plus two leather. Note that you do NOT need the Light version in order to craft the Heavy version. The armor ratings are equivalent to the Light and Heavy versions of the Imperial armor. As is standard, the mage version of the robes do not come with an armor rating.\r\n \r\n Imperial Mages already exist in the game but now they have been given a set of the robes. This is to make them stand out from other Imperial soldiers when they are casting spells.\r\n\r\nIf you wish to make a patch for the Reprocessor mod then please contact me first! This also goes for CBBE/UNP/etc. body mods!\r\n\r\nInstall\r\n =======\r\n You can either download this mod with the Nexus mod manager or download the files and extract into the Skyrim data folder. Be sure to check the tick box in your data files section on the Skyrim launcher.\r\n \r\n\r\nUninstall\r\n =========\r\n Either use Nexus Mod Manager to remove the files or manually remove them from you Skyrim/Data folder. \r\n\r\nUpgrade\r\n =======\r\n I plan to upgrade and improve this mod over time as I fix bugs, think of new ideas, become more adapted to the CK, and so on. Be sure to check back in once and awhile for updates. Be sure to completely uninstall any previous versions of this mod before upgrading though.\r\n \r\nI will not take responsibility for corrupted save games or lost save games. Get into the habit of backing up your saves to protect your game data. Ignore at your own risk!\r\n\r\nIncompatibility\r\n ===============\r\n I do not see why this mod would be incompatible with other mods but it is always a possibility. Anything that fundamentality changes the Journeyman mage clothes or Daedric Armor will probably be incompatible, since I rely on vanilla textures and normal maps where ever possible. The armor itself is completely standalone and does not replace any vanilla components.\r\n \r\nKnown Issues or Bugs\r\n ====================\r\n \r\n -I am new to adding things to the leveled lists. If the items are not showing up in the loot tables please let me know so that I can fix it^^.\r\n -There is some slight mesh clipping and stretching on the left arm but it is only noticable when jumping or casting spells from certain camera angles. This should not affect gameplay and is mostly ignorable. I have tried very hard to remove it but it keeps popping up.\r\n \r\nHistory\r\n ======= \r\n\r\n5/9/2013- Version 1.0 Initial Release\r\n \r\nContact\r\n =======\r\n You can find me on the Nexus Forums here as Natterforme.\r\n \r\nCredits\r\n =======\r\n \r\n -Thanks to Bethesda for creating Skyrim.\r\n -Thanks to SkyrimNexus.com for the a one-stop-shop resource for authors and players.\r\n -Thanks to LHammonds for the Readme Generator this file was based on.\r\n -Thanks to all of you who have encouraged me and have supported this armor mod since I first put up screenshots of it back in December 2011 and January 2012.\r\n -I thank you all for your patience with me^^.\r\n -Thanks to God for creating us all. Amen.\r\n \r\nTools Used\r\n==========\r\n7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r\nBlender - http://www.tesnexus.com/downloads/file.php?id=12248\r\nNIFSkope - http://niftools.sourceforge.net/wiki/NifSkope\r\nOblivion Mod Manager - http://www.tesnexus.com/downloads/file.php?id=2097\r\nPaint.NET - http://www.tesnexus.com/downloads/file.php?id=11909\r\nPhotoshop - http://www.adobe.com/products/photoshop/\r\nReadme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r\n\r\n Licensing/Legal\r\n ===============\r\n This is a Skyrim Nexus Exclusive.\r\n\r\n You MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. I will NOT be providing Steam Workshop support at this time. I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW! I will not support any version of this mod found on Steam. I will not accept any childish excuse about \\\"sharing\\\" with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r\n\r\n -Natterforme",
  "categoryId": "54",
  "version": "1.0",
  "author": "Natterforme",
  "createdUnix": "1368404265",
  "updatedUnix": "1368403838",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029612",
      "name": "Imperial Mage Armor by Natterforme",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5835",
      "fileName": "Imperial Mage Armor by Natterforme-35863-1-0.zip",
      "uploadedUnix": "1368403838",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/534c88be3835a779ad9644d4e5ee06226b716338c675113b78ed9b1e3999b1ad/analysis/1407567406/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Mage%20Armor%20by%20Natterforme-35863-1-0.zip?fid=1000029612&ttl=1535814683&ri=8192&rs=8192&setec=b5785dd5d2e30691ca5d234f4c471362"
    }
  ]
}