{
  "modId": 35874.0,
  "modName": "Hearthfire - Remove Bees From Greenhouses",
  "summary": "Removes most of the bees from Hearthfire greenhouses.",
  "descriptionHtml": "This mod removes most of the bees from Hearthfire greenhouses. I always hated the fact that the bees would fly through walls, made a huge racket, and respawned so quickly when I\\'d get rid of them. Plus there\\'s the whole thought of having a room full of bees when you have children running around the house. That seems like a pretty BAD IDEA to me.\r\n\r\nThis mod simply removes most of them from spawning. Every other aspect of the greenhouse is unchanged, and other insects (butterflies and moths) should still be able to spawn like normal. Some bees may still spawn as they\\'re tied in with the butterflies and moths, they cannot be removed unless ALL insects are removed. I may provide a version at a later date that removes all insects entirely.\r\n\r\nEven so, with far far far fewer bees in the greenhouses the noise level is vastly diminished.\r\n\r\nHearthfire is, as you might expect, required for this mod to work.\r\n\r\nI do not know of any conflicts this mod will have with any others.",
  "categoryId": "85",
  "version": "1.0",
  "author": "Khyron",
  "createdUnix": "1368155836",
  "updatedUnix": "1368155875",
  "containsAdultContent": false,
  "uploadedBy": "Khyron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029100",
      "name": "Bee-B-Gone",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Bee-B-Gone-35874-1-0.rar",
      "uploadedUnix": "1368155875",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6865e075157fb3d11b2059cc9a291e502f616015de72539bc0be36d4182ede2e/analysis/1407563402/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bee-B-Gone-35874-1-0.rar?fid=1000029100&ttl=1535814702&ri=8192&rs=8192&setec=b876536cc711805f19b6391fbd3443cd"
    }
  ]
}