{
  "modId": 35884.0,
  "modName": "save file-clean",
  "summary": "my own char save file which contains no mods installed except dawnguard, heartfire",
  "descriptionHtml": "this is save file i had before i installed my first mod of skyrim so its best file for experimenting mods which may cause you problems and you are unable to sort it out.\r\n\r\nif you use lots of mods and are facing unknown weird errors this file is a best backup to start with...\r\n\r\ngame progress done i guess around 30%+\r\n\r\nmarried to aela, adopted 2 kids, home at markath, allaince linked to werewolfs, version of the save V1.7\r\n\r\nif u have dragonborn installed once u use this save file will start all dragonborn quest.\r\n\r\nChar Description:\r\n\r\nRace : Altmer\r\nSex   : Male\r\nLevel : 81-83(More Saves at Different Locations)\r\nName : Teiru\r\nClan Race : Werewolf\r\nRelationship : Aela as Wife\r\nKids Adpoted : Dorthe, Lucia\r\nBase Home : Markath\r\n\r\nRequirements:\r\nDawnguard, Heartfire\r\nGame Version : V1.7(will work on latest version of skyrim too i.e V1.7+)\r\n\r\nInstall Info:\r\n\r\n1. Copy the Skyrim(1.7) to where your save file of skyrim is stored than rename it to Skyrim. NOTE:Be sure to backup your own save as am giving up my own entire save skyrim folder.\r\n\r\n2. First open my skyrim folder, than go to saves their you find the basic save files in case u need my save.ess file particularly.\r\n\r\nNOTE:let me make clear one thing guys i use more than 200+ mods as a result my main save file was crashed resulting me to reinstall skyrim and all mods.\r\nafter a long procedure i had this save file with which i was able to sort out few mods which were causing bugs in my main save, so if you are worrying about the images than ignore it as i took screenie from my present mod list installed.\r\n\r\nas you can see the mods were activated when i loaded the save file, anyone can predict it by seeing the screenie.\r\nas a matter of fact the save file works fine.\r\nits only a backup file if got any doubt just try it once.\r\n\r\nand let me make clear this is the save file when i only had skyrim with dawnguard and heartfire plugin with no other files installed\r\n\r\nif got any doubt make a comment post and i will reply about it",
  "categoryId": "43",
  "version": "1.7",
  "author": "nikhil123",
  "createdUnix": "1368190185",
  "updatedUnix": "1368190150",
  "containsAdultContent": false,
  "uploadedBy": "nikhil123",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029150",
      "name": "Teiru Clean Save",
      "version": "V1.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50348",
      "fileName": "Teiru Clean Save-35884-V1-7.rar",
      "uploadedUnix": "1368190150",
      "modVersion": "V1.7",
      "virusScanUrl": "https://www.virustotal.com/file/a65ae63632b6667e15a201bbc578bff67c060808d15952a89446a01c34dbcc59/analysis/1407563673/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Teiru%20Clean%20Save-35884-V1-7.rar?fid=1000029150&ttl=1535814718&ri=8192&rs=8192&setec=9245a79d8d32f0028a134ae35102e2b5"
    }
  ]
}