{
  "modId": 35896.0,
  "modName": "Trollsbane Armor and Weapon - German Translation",
  "summary": "Fuegt eine neue lorefreundliche Ruestung namens Trollbannruestung hinzu und verleiht der bereits in Skyrim enthaltenen Waffe Trollbann ein einzigartiges Aussehen.",
  "descriptionHtml": "Das Englische [URL=http://skyrim.nexusmods.com/mods/35793]Original[/URL] wird benötigt!\r\n\r\n\r\n[CENTER][IMG]http://dl1.scharesoft.de/screens/Skyrim/thumb/Trollsbane_Armor_and_Weapon_00.jpg[/IMG]\r\n\r\n[I][SIZE=3][B]Trollsbane Armor and Weapon[/B][/SIZE]\r\nAutor: Hothtrooper44 ~ Übersetzer: Rikash\r\nv2.0 (09.05.2013)[/I]\r\n\r\n\r\n[SIZE=3][B][I]Beschreibung[/I][/B][/SIZE]\r\n\r\n[I]Trollsbane Armor and Weapon[/I] bringt eine lorefreundliche eigenständige Rüstung namens [I]Trollbannrüstung[/I] für beide Geschlechter nach Skyrim. Zusätzlich erhält die bereits in Skyrim enthaltene Waffe [I]Trollbann[/I] ein einzigartiges neues Aussehen. Das Rüstungsset bestehend aus Rüstung, Panzerhandschuhen, Stiefeln und Helm kommt sowohl in einer Schweren als auch Leichten Ausführung daher. Im Gegensatz zu herkömmlichen Rüstungssets besitzen alle Bestandteile dieser Rüstung je Ausführung ein unterschiedliches Äußeres. Ferner gibt es vier verschiedene Varianten des Helmes. Jeder Trolljäger kann also seinen ganz persönlichen eigenen Stil finden!\r\n\r\nZu einem Trolljäger passend trägt die Rüstung viele Trolltrophäen und die Waffe ist speziell zum Vernichten von Trollen verzaubert. Außerdem wurden normalen Trollen sowie Höhlentrollen neues Beutegut in Form von (Höhlen-)Trollfell und Trollschädeln hinzugefügt, die fortan von diesen geplündert werden können. Nebenbei wird die Menge an Trollfett, die ein Troll bringt, auf ein angemessenes Maß korrigiert. Im Angesicht der Schwierigkeit ein solches Monster zu töten, ist ein Stück Trollfett wohl doch ein bisschen mager.\r\n\r\nUm das Schmieden realistischer zu gestalten, werden unter anderem diese Trollfelle und Trollschädel zum Herstellen der Rüstungsteile benötigt. Gehe auf die Jagd nach dem jeweiligen Trolltyp, um die Felle zu erlangen. Die Felle können natürlich nicht nur zum Schmieden verwendet, sondern bei Überschuss auch beim nächsten Händler verkauft werden. Die Rüstungsteile sind in Wert und Rüstungsschutz in etwa vergleichbar mit Ebenerz- und Vulkanglasqualität. Dementsprechend werden zum Herstellen auch ebendiese Schmiede-Perks vorausgesetzt.\r\n\r\nDa die Vanilla Trollschädel überaus detailarm waren, wurden von CaBaL hier extra für diese Mod hochauflösende neue Texturen angefertigt. Die Texturen werden aber nicht nur ausschließlich für die Rüstung genutzt, sondern spendieren allen Trollschädeln in Skyrim nun ebenfalls ein neues Erscheinungsbild.\r\n\r\n\r\n[SIZE=3][B][I]Vorschauvideo[/I][/B][/SIZE]\r\n\r\n[youtube]dz5df9_EMfw[/youtube][/CENTER]",
  "categoryId": "36",
  "version": "2.0",
  "author": "Hothtrooper44 und Rikash",
  "createdUnix": "1368216705",
  "updatedUnix": "1368214555",
  "containsAdultContent": false,
  "uploadedBy": "Rikash",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029195",
      "name": "Trollsbane Armor and Weapon DV",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Trollsbane Armor and Weapon DV-35896-2-0.7z",
      "uploadedUnix": "1368214555",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/0cad8c9befe2c139f62ff28b6c31ac2ccce5aed27f6ef61851e6c25f307c34ae/analysis/1407564199/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Trollsbane%20Armor%20and%20Weapon%20DV-35896-2-0.7z?fid=1000029195&ttl=1535814742&ri=8192&rs=8192&setec=a9a9ccbeee31c9f7cade6e985cce4425"
    }
  ]
}