{
  "modId": 35904.0,
  "modName": "The Elsweyr Embassy",
  "summary": "A lore-friendly Khajiit player home with a story.",
  "descriptionHtml": "Warning! Potential Spoilers!\r\nHearthfires Required\r\nLore-Friendly Khajiit Player Home\r\n\r\nBackground Info: \r\n\r\nSomething terrible has happened to the Ambassador. He didn’t arrive that long ago. He was determined to create diplomatic peace between Skyrim and Elsweyr. Why aren’t his people allowed into the cities? Why is there so much racism? He was met by a shadowy group of assassins on his way to a meeting with the Jarl of Riften.\r\n\r\nA few weeks later, the one called Dragonborn arrives home and notices a letter has been slipped under the door. Kudargo, steward at the Elsweyr Embassy, asks the Dragonborn to manage Skyrim-Elsweyr relations as the new Ambassador.\r\n\r\n\r\nOffers:\r\n\r\n1 Tunnel System to the Ragged Flagon (after joining the Thieves Guild)\r\n\r\n1 Free Carriage Driver, Bard, and Chef\r\n\r\n1 Cooking spit, Alchemy table, Enchanting table, Forge, Armor table, Grindstone, and Tanning rack.\r\n\r\n1 Unique Dagger, Amulet, and Ring\r\n\r\n2 Player Beds\r\n\r\n2 Sabre Cat Followers (1 Regular, 1 Snowy)\r\n\r\n3 Safe Chests\r\n\r\n4 Master Trainers (Smithing, Enchanting, Alchemy, Speech)\r\n\r\n4 Merchants (Blacksmith, Mage, Apothecary, Fence)\r\n\r\n5 Horses (50% faster than Vanilla horses, works with Horse Armor mod to get one of each type)\r\n\r\n8 Mannequins\r\n\r\n19 Khajiit Followers (Marriageable: 5 Females, 2 Males)\r\n\r\n30 Pages of lore written in the journals of Dro’Rabi (Introduces all NPCs at the Embassy in a story format)\r\n\r\n35 Weapon Racks (24 standing, 4 shield plaques [2 weapons, 1 shield], 3 regular plaques)\r\n\r\nEvery religious shrine/statue available in the game.\r\n\r\n\r\nLocation:\r\n\r\nThe western side of Lake Honrich, right next to the Heartwood Mill. Nearby locations include: Faldar’s Tooth, Goldenglow Estate, Angarvunde, Avanchnzel, Largashbur, and Treva’s Watch.\r\n\r\n\r\nKnown Issues:\r\n\r\n- The shield weapon plaques display shields perfectly, but sometimes weapons get displayed above the plaque... I’m not sure why. I don’t have a solution right now. Maybe I will just delete the side plaques and leave the little shield marker.\r\n\r\n- Sometimes you’ll be in the basement and a few inches of tail will be hanging from the ceiling. I tried putting collision layers across the floor where tails might hang. It helped but doesn’t stop it. Editing your Skyrim.ini to load objects at a further distance might fix it, but I’m not sure.\r\n\r\n- The Sabre Cats are antsy. They are always getting up and moving around. Sometimes they float kind of oddly above the floor. Sometimes you can see their paws from the basement. Their heavy breathing, growling, and purring can get annoying. Sabre Cats were not meant to be tame indoor pets... but they are fun to travel and battle with.\r\n\r\n- The first time you come across the horses in the stable, they might be perfectly fine... they also might be weird and floaty because of the exterior navmeshing. Just get on them, move to a spot where they look normal and get off of them. Save and they will stay in the proper position for the rest of the game.\r\n\r\n- The trainer dialogue sometimes doesn’t sound. The words appear if you have subtitles on. The training still happens. It still works perfectly fine. You just don’t hear them say something like “well, you’ve come to the right place”... all I need to do is find those sound files and include them in the archive... I think. Haven’t figured it out yet.\r\n\r\n\r\nThings I either; tried to do and couldn’t figure out, wouldn’t work, or want to add/change:\r\n\r\n- An actual system of tunnels and dungeons going all the way to Riften, instead of just a fast travelling sewer door—while still maintaining the option of travelling fast by sewer. But that’s a lot of work for nothing really...\r\n\r\n- Adoptable Khajiit Children. Probably not going to happen. We’ll see.\r\n\r\n- Initially, I had AI packages set up for every one of the NPCs (SPOILERS). When and where to sleep and eat, a rotating guard schedule, Barong disappeared to Sky Haven Temple on the weekends to wait for the Dragonborn, Bastet went into the tunnel on weekends to trade with the Argonian and chill in Nightingale hall, the diplomat couple slept together at night. They never ever worked out. It just got screwy and complicated so I deleted all of the AI packages. Now everyone kind of just chills in one spot for the most part.\r\n\r\n- A courier who delivers the initial note.\r\n\r\n- Some sort of quest related to the Embassy.\r\n\r\n\r\nNotes:\r\n\r\n- You really should have Hearthfires if you want this mod to work. It might work without Hearthfires but I haven’t tested it yet. You would definitely lose the shrines in the basement and the carriage driver. I works perfectly fine with Dawnguard and Dragonborn. \r\n\r\n- The photos are taken with Horse Armor, Enhanced Night Skyrim, SMIM, Skyrim HD, Realistic Lighting Overhaul, Enhanced Lighting Effects, and Skyrim Flora Overhaul turned on. All mods I highly recommend and had in mind while creating this one. None is required for its use.\r\n\r\n- You have full rights to do whatever you want with the mod. Go into the Creation Kit, open up Skyrim.esm, Update.esm, Hearthfires.esm, and ElsweyrEmbassy.esp (click Active File). Then add or change or take whatever you want. Then, if you really want to, put it up on Steam or Nexus or whatever. I suppose I would appreciate some sort of shout out or credit though.\r\n\r\n- ALL NPCS, followers, diplomats, refugees, sabre cats, horses, the driver... They are all marked as essential, and none of them affect your stealth meter. They still take damage, bleed, bend to one knee, but they will never actually die. They are all leveled. They are supposed to all be about as strong as the player... a bit stronger, hopefully not over-powered.\r\n\r\n- I tried to make the mod as lore-friendly as possible. Some things just don’t work with the creation kit though. Like a marriageable Khajiit or female follower. I had to change some voices around to make it work. Also... there are vaults in the basement with unlimited smithing supplies, soul gems, and alchemy ingredients.\r\n\r\n- I recommend actually reading the journals. I’m not an amazing story teller or anything, but I think the journal entries give an introduction to the NPCs that is interesting enough to make you enjoy travelling with them more.\r\n\r\n- Obviously, it’s important to have a clean save before downloading it and checking it out, just in case. Also, I don’t know what happens to the things stored in containers when an update comes out. Probably be fine. I have no idea.\r\n\r\n- Finally, please leave a comment about anything... you like, dislike, hate, want changed, want to see added, how to do any of the stuff I mentioned earlier, anything really. I’m kind of new to the whole modding thing. This certainly isn’t the first I’ve made, but the first I’m releasing. Feedback is a good thing.\r\n______________________________________________________________\r\n\r\nNEWS:\r\n\r\nA Dawnguard version of this mod is now available on both Nexus and Steam.\r\n\r\nI decided that I will be making a whole set of embassies scattered across Skyrim. Any suggestions for those upcoming mods can be left in the comments below. Each one takes a while to create, but I will try to start trickling them out.\r\n\r\nA Vanilla version will be created for every one, and a Dawnguard/Hearthfires version. I will probably not be making Dragonborn versions, unless of course it makes sense, like for the Morrowind Embassy.\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "Mapleleaf402",
  "createdUnix": "1368226739",
  "updatedUnix": "1368225408",
  "containsAdultContent": false,
  "uploadedBy": "Mapleleaf402",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029227",
      "name": "ElsweyrEmbassy",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8644",
      "fileName": "ElsweyrEmbassy-35904-1-0.zip",
      "uploadedUnix": "1368225408",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5ce58e1539ec950cfaaa77155f86f0377883ffac323a937546ed282f47473f97/analysis/1407564321/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ElsweyrEmbassy-35904-1-0.zip?fid=1000029227&ttl=1535814751&ri=8192&rs=8192&setec=2f465c1bb8c87cd4b6c113dc160807c3"
    }
  ]
}