{
  "modId": 35901.0,
  "modName": "Bracken the Spriggan Follower",
  "summary": "This mod adds a Spriggan animal follower to the game with her own custom texture. She is located in a new dungeon located in Whiterun Hold.",
  "descriptionHtml": "A Small Update: I am working on a smallish update for the mod which will include optimized textures for Bracken finally (I\\'m an idiot) and also add a little bit more to the dungeon. Not decided yet whether or not I should add the dungeon to the Radiant Quest list or if it should respawn. Also, will finally rename the Sacrificicial Dagger to Sacrificial Dagger (You fool!)\r\n\r\nThis is my first real attempt at making a mod that isn\\'t a simple texture replacer so apologies if it\\'s not brilliant! :)\r\n\r\nThis mod adds a Spriggan follower named Bracken who acts as an animal follower. She has her own unique texture and can be found in a new dungeon called Spriggan\\'s Rest, located in Whiterun Hold. \r\n\r\nShe is alot smaller than other Spriggans in the game and is a bit weaker so as not to make her overpowered as a follower. She levels with you up to 50 and if dismissed will return to Spriggan\\'s Rest. She can also carry some of your burdens though she will not be too happy about it. \r\n\r\nThe Dungeon itself is very small (my first time making one, didn\\'t want to get too ambitious) and probably not very challenging for high level players. Also as it was my first time and I cluttered the place myself it probably isn\\'t very...well good basically. Sorry! :) The dungeon is not optimized as I would like either as I encountered some bugs with that, so it may run quite badly on some machines, hopefully not too bad though as the dungeon is very small.",
  "categoryId": "65",
  "version": "1",
  "author": "Swinton",
  "createdUnix": "1368223410",
  "updatedUnix": "1368222742",
  "containsAdultContent": false,
  "uploadedBy": "Swinton1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029220",
      "name": "Bracken The Spriggan",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9004",
      "fileName": "Bracken The Spriggan-35901-1.7z",
      "uploadedUnix": "1368222742",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/cc591efc7e39705c284ff31652ef9ed5a4bda58c3aa208f1882275bfd277e2b3/analysis/1407564310/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bracken%20The%20Spriggan-35901-1.7z?fid=1000029220&ttl=1535814749&ri=8192&rs=8192&setec=80ea725341817a66c61e91298660154e"
    }
  ]
}