{
  "modId": 35918.0,
  "modName": "Cannabis Skyrim FR",
  "summary": "Traduction française du mod de MadNuttah et Virakotxa \\\"Cannabis Skyrim\\\".",
  "descriptionHtml": "Il existe de nombreuses drogues dans l\\'univers de Skyrim : Sucres de Lune, Skooma, et vous ne pouvez boire autre chose que de l\\'alcool. Cette extension ajoute une nouvelle plante et ses usages, vous l\\'aurez compris il s\\'agit du cannabis.\r\n\r\nIl n\\'est pas dans mon intention, ni dans celle des auteurs originaux du mod, d\\'encourager d\\'aucune manière l\\'usage de drogue. Si ce mod vous offense ou vous perturbe de quelque façon que ce soit... ne l\\'installez pas.\r\nIl ne s\\'agit que d\\'une petite extension bien réalisée et parfaitement intégrée à l\\'univers par ses auteurs MadNuttah et Virakotxa. Elle est très fun et complète, voilà tout. Ne lui prêtez pas des capacités ou intentions qu\\'elle ne possède pas ni ne revendique.\r\n\r\nDe retour dans la vraie vie après avoir [i]trop[/i] joué à Skyrim souvenez vous que consommer du cannabis c\\'est mal. Boire de l\\'alcool c\\'est mal. Voler c\\'est mal. Décapiter, assassiner, tuer des gens de quelque façon que ce soit c\\'est mal (oui même les trolls).\r\n\r\nMerci pour votre attention.\r\n\r\n\r\n[u][b]Installation :[/b][/u]\r\nAu préalable vous pouvez installer [url=http://skyrim.nexusmods.com/mods/11811/?]Fores New Idles in Skyrim - FNIS[/url] son utilisation est recommandée afin de bénéficier des animations. Mais elle n\\'est pas indispensable.\r\n\r\nAvant cette traduction vous devez installer (et endorser) le mod originel de MadNuttah et Virakotxa : [url=http://skyrim.nexusmods.com/mods/8732/?]Cannabis Skyrim[/url]\r\nLes fichiers de traduction doivent simplement être extraits dans le dossier du jeu en écrasant les fichiers d\\'origine.\r\nAprès l\\'installation pensez à utiliser l\\'exécutable \\\"Generate FNIS for users\\\" afin de mettre à jour les animations.\r\n\r\nPour plus de renseigments sur les procédures de mise à jour ou de désinstallation, se reporter à la présentation et à la FAQ sur le post original des auteurs du mod.\r\n\r\n\r\n[u][b]Notes sur la traduction :[/b][/u]\r\nUne traduction vient toujours avec des choix à faire, heureux ou non. Et parfois le sens ou les jeux de mots d\\'origine ne peuvent être reproduits :\r\n-J\\'ai décidé de ne pas traduire les noms des variétés. Ceux utilisés par les auteurs sont des jeux de mots entre de vraies variétés et des éléments de la lore de skyrim. Il n\\'y avait en fait... rien à traduire ici.\r\n-Par contre j\\'ai modifié le nom des tenues ajoutées par le mod. \\\"High Rock\\\" devient donc \\\"Songe-creux\\\". Les références sont très différentes, mais je trouve la traduction appropriée.\r\n-Et j\\'ai également choisis de franciser l\\'excellent nom de la boutique \\\"Your Highness\\\". Elle est désormais connue sous le nom du \\\"Divin Chanvre\\\" ;)\r\nA ce sujet je tiens à remercier MadNuttah pour la version personnalisée de l\\'enseigne.\r\n\r\nPour tout commentaire sur la traduction n\\'hésitez pas à me contacter ici même ou sur le site de [url=http://www.confrerie-des-traducteurs.fr/forum/index.php]la confrérie des traducteurs[/url].\r\n\r\n\r\n[u][b]Le contenu de l\\'extension en bref :[/b][/u]\r\n-Une boutique près de Blancherive dans laquelle vous trouverez tout le matériel et les informations dont vous aurez besoin pour lancer votre culture.\r\n-6 variétés de Cannabis. Chacune avec des effets particuliers et ses propres représentations graphiques.\r\n-De nouvelles animations pour fumer les joints, pipes, chillum et bangs (FNIS uniquement).\r\n-Des plants de marijuana qui peuvent être semés, cultivés et récoltés. Ils sont animés et évoluent visuellement du semi à la floraison.\r\n-Des représentations graphiques pour les têtes, les joints et blunts, le matériel de fumette, le haschisch, l\\'huile de haschisch, les tapis et vêtements...\r\n-Un rouet et un métier à tisser pour fabriquer les vêtements à base de chanvre.\r\n-Des statistiques qui évoluent pour refléter votre talent de rouleur de joint ou de blunts.\r\n-Un menu (accessible dans l\\'inventaire) pour configurer le mod et prendre connaissance de vos statistiques.\r\n-Un laboratoire pour créer votre haschisch, l\\'huile ou encore mettre à fermenter des oreilles d\\'elfe (pour les blunts).\r\n-Une sacoche à herbe que vous pouvez équiper sur votre personnage et dans lequel vous pourrez transporter vos meilleures têtes.\r\n-Un système de vente immersif, fumez à proximité de NPCs pour éveiller leur curiosité.\r\n\r\n[center][URL=http://skyrim.nexusmods.com/mods/35320/?][IMG]http://www.ushareimg.com/images/286T3R.png[/IMG][/URL][/center]",
  "categoryId": "78",
  "version": "0.1.6.2a",
  "author": "MadNuttah et Virakotxa traduit par Lyim",
  "createdUnix": "1368277105",
  "updatedUnix": "1368275741",
  "containsAdultContent": true,
  "uploadedBy": "Lyimee",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029316",
      "name": "Cannabis Skyrim FR",
      "version": "0.1.6.2a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "335",
      "fileName": "Cannabis Skyrim FR-35918-0-1-6-2a.7z",
      "uploadedUnix": "1368275741",
      "modVersion": "0.1.6.2a",
      "virusScanUrl": "https://www.virustotal.com/file/a279c6f0e10e7ad03365f5ce510035be029440ebfc68b8bbd57cee85bc79de18/analysis/1407565062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cannabis%20Skyrim%20FR-35918-0-1-6-2a.7z?fid=1000029316&ttl=1535814774&ri=8192&rs=8192&setec=0e00c629878ef95321ad761332bb399e"
    }
  ]
}