{
  "modId": 35947.0,
  "modName": "Guard Armour Interestification Project",
  "summary": "Replaces the Guards armour with a crazy mix out of a shitton of different armours.",
  "descriptionHtml": "Have you ever looked at the Guards armour and you were like: \\\"Meh, doesn\\'t look awesome\\\"\r\nSo here is the solution (First: Lore with the greatest sense in history):\r\nOnce upon a time the Guard faction hired a crazy as shit quartermaster, who spend his freetime dwelling in dungeons slaying evil monsters (and suspicious (of having money) adventurers) and looting bandits and chests. Because bandits and monsters obvisiously don\\'t have Guard armours and there wasn\\'t enough money to buy them, every guard was given such looted (officialy described as \\\"aquired\\\") armour. To keep it fair nobody was given a full set but a set combination of armor pieces from different materials. So in the end everybody was happy and they all apreciated that idea...NOT.\r\nActually so many guards were killed due to shitty protection that the quartermaster was executed for not finding guard armor.\r\n\r\nGives all Guards a fairly random pattern of armour pieces from different materials.\r\n\r\nNOTE:\r\nWill only give the guards with \\\"real\\\" guard armour new armour (not stormcloak nor imperial)\r\nIt also gives some guards really high end gear parts (If you don\\'t want those don\\'t loot them)\r\nThis is a JOKE mod, don\\'t take it serious, just don\\'t.\r\n\r\nCAUTION:\r\nMay cause severe burning of the eyes due to a horrifying combination of armour.\r\nMay also be followed by brain damages, caused by a complete lack of sense.\r\n(I\\'m not responsible for this shit (maybe your health insurance is gonna pay (yeah, sure)))\r\n\r\n*sorry for my bad english, it\\'s not my native language*\r\n\r\nThanks to:\r\n- Bethesda\r\n- my crazy imagination ",
  "categoryId": "28",
  "version": "1.0",
  "author": "xMaster2072",
  "createdUnix": "1368357365",
  "updatedUnix": "1368331944",
  "containsAdultContent": false,
  "uploadedBy": "xMaster2072",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029455",
      "name": "Guard Armor Interestification Project",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Guard Armor Interestification Project-35947-1-0.zip",
      "uploadedUnix": "1368331944",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/89581278628f3f071fb62527eedcf05d91fb64fa97b1b761233825a275bd249c/analysis/1407566127/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guard%20Armor%20Interestification%20Project-35947-1-0.zip?fid=1000029455&ttl=1535814819&ri=8192&rs=8192&setec=a64e103471d05e92d4ff283fc094a6b1"
    }
  ]
}