{
  "modId": 35940.0,
  "modName": "RSH II - LYDIA STRIKES AGAIN - Hoamaii InnerWear for male",
  "summary": "Housecarls got tired of exposing their butts when male Dovahkiins ran around clasped in heavy layers of metal, even in cozy Breezehome. So they decided to fight for women&#39;s rights to enjoy men&#39;s butts too and lovingly crafted this delicate set for us tough Dovahkiins…",
  "descriptionHtml": "REVENGE OF THE SEXIFIED HOUSECARLS II - LYDIA STRIKES AGAIN&#33;\r<br />\r<br />HOAMAII INNER WEAR FOR MALE (Kurese&#39;s UNP InnerWear remeshed for Sundracon)\r<br />\r<br />\r<br />A LITTLE BACKSTORY:\r<br />\r<br />You know that little old lady what&#39;s-her-name from Jorrvaskr who &#34;sees everything, hears everything&#34; but never tells anything? Well, this time she told. I was just back from some Fire Dragon lair south of Riften, exhausted and smoked like a ham, expecting to find Lydia home with some restoring stew and instead I found that old goat urging me to go to Jorrvaskr, &#34;you&#39;re the new Kodlak&#34;, she said, &#34;do something&#33;..&#34;\r<br />\r<br />And there was Lydia with a whole bunch of my Companions, all wearing nothing else but tiny loin cloths looking very much like that Kurese UNP Inner Wear* set that I thought looked so good on my female housecarls&#33;.. She and my girl housecarls have set their minds on a revenge plan, see? To craft for us male Dovahkiins the sort of skimpy outfits we think are perfect armors for them…\r<br />\r<br />You know what? I think something&#39;s been going on between Farkas and my Lydia from the very beginning. That&#39;s why she pretended not to be marriageable in the first place&#33;.. Sigh…\r<br />\r<br />Something&#39;s rotten in the kingdom of Skyrim…\r<br />\r<br />\r<br />MOD DESCRIPTION:\r<br />\r<br />The Inner Wear set for male would never exist if it was not for Kurese&#39;s initial mod: &#34;R18pn Set - Inner Wear set for UNP and CBBv3&#34; (http://skyrim.nexusmods.com/mods/15529/) - all credits go to him, also for kindly allowing me to use his textures and meshes and adapt them to Better Males - Sundracon version. \r<br />\r<br />It consists of 3 simple pieces:\r<br />- LoinCloth Black - using slot 49\r<br />- LoinCloth White - also using slot 49\r<br />- a Linen G-String - using body slot 32 so you don&#39;t go commando under these Loin Cloths.\r<br />\r<br />They all are listed under clothes but provide armor ratings. They can be crafted at any Forge in the leather section. And all pieces can be tempered at the Working Bench as well as enchanted at the Enchanting Table.\r<br />\r<br />If you&#39;re only wearing the Loin Cloth, you&#39;ll only be wearing underneath what your character was born with the first time you installed Better Males&#39;s Sundracon&#39;s body meshes and textures. \r<br />\r<br />And please don&#39;t ask me right now to adapt it to Favored Soul&#39;s meshes, I&#39;ve had enough trouble as it is with the damn skirtbones - I&#39;d rather bite my nails at the new Gladiator-like armor mashup I&#39;m working on right now. Thanks for your understanding&#33;..\r<br />\r<br />If you want the female version, go to Kurese&#39;s page: http://skyrim.nexusmods.com/mods/15529/ and don&#39;t forget to endorse him, his work is great&#33;\r<br />\r<br />\r<br />BUGS AND OTHER ISSUES:\r<br />\r<br />The biggest challenge here was to make it so that the G-string could be equipped underneath the Loin Cloth and they don&#39;t move around with the same set of bones - I fully understand what Nightasy meant when he said not to play with skirtbones&#33;.. So in order to achieve that, I had to position the Loin Cloth slightly away from the G-string, or else it will keep clipping through the cloth not so much on your character but mostly on your followers in standing  idle animations. The cloth may look like it floats a bit around the groin but that&#39;s the best I could do - and I did try a lot of solutions&#33;.. If any of you guys knows how to make it look better, please let me know, I&#39;ll be happy to fix this&#33;.. Other clippings are the standard Vanilla ones that come with all loin cloths.\r<br />\r<br />Other than that, it&#39;s just an armor, it cannot break your game in any way.\r<br />\r<br />\r<br />INSTALLATION:\r<br />\r<br />Easiest way is to use NMM. If not, just drop the meshes in your data&#92;meshes&#92;armor directory and the textures in your data&#92;textures&#92;armor directory, don&#39;t forget to add the .esp in your data, and to check it either in NMM or/and in you launcher data files.\r<br />\r<br />Uninstallation goes exactly the other way around.\r<br />\r<br />Requirement:\r<br />Better Males - Sundracon: http://skyrim.nexusmods.com/mods/2488\r<br />\r<br />\r<br />CREDITS AND THANKS:\r<br />\r<br />- Kurese, for kindly giving me permission to use his textures and adapt his meshes to the male body.\r<br />- FavoredSoul and Sundracon for their Better Males: http://skyrim.nexusmods.com/mods/2488/\r<br />- Nightasy for putting together a great tutorial: http://skyrim.nexusmods.com/mods/19249\r<br />- FavoredSoul for kindly explaining how to assign meshes to body parts: http://forums.nexusmods.com/index.php?/topic/576983-tutorial-assign-meshes-to-new-body-parts/\r<br />- AmesthystDeceiver for offering a consensus on how to assign unused biped nodes: http://forums.nexusmods.com/index.php?/topic/556424-body-part-ids-for-unused-biped-nodes-consensus/\r<br />- All the Nexus team and members for creating such an inspiring Website,\r<br />- Bethesda, for creating a great game and giving is the tools to mod it (almost) any way we like.\r<br />\r<br />\r<br />MY OTHER MODS:\r<br />\r<br />- Revenge of the Sexified Housecarls - Hoamaii Mashup for Male (a modular Falmer armor for guys): [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://www.nexusmods.com/skyrim/mods/35333]Revenge of the Sexified Housecarls[/url][/b][/size][/font][/color]\r<br />\r<br />- Revenge of the Sexified Housecarls III - Hoamaii Gannicus armor: [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://www.nexusmods.com/skyrim/mods/39730]Gannicus Modular Armor[/url][/b][/size][/font][/color]\r<br />\r<br />- Revenge of the Sexified Housecarls IV - Hoamaii Modular Iron Armor: [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://www.nexusmods.com/skyrim/mods/58482]Hoamaii Modular Iron Armor[/url][/b][/size][/font][/color]\r<br />\r<br />- Have Pita On Lydia - Hoamaii Meat Sandwich: [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://www.nexusmods.com/skyrim/mods/57435]Hoamaii Meat Sandwich[/url][/b][/size][/font][/color]\r<br />\r<br />- Wine and Beer in Tankards - animobjects and static objets replacers: [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://www.nexusmods.com/skyrim/mods/59260]Wine and Beer In Tankards[/url][/b][/size][/font][/color]\r<br />\r<br />- or my animated house mod: [color=#548dd4][font=Trebuchet MS][size=3][b][url=http://www.nexusmods.com/skyrim/mods/62903]Clearsky Hideout - Fully Animated Playerhouse[/url][/b][/size][/font][/color]\r<br />\r<br />[youtube]CAk4FO8YtrU[/youtube]\r<br />\r<br />[line]\r<br />\r<br />Tools used:\r<br />- Autodesk 3ds Max\r<br />- Nifscope\r<br />- Gimp\r<br />- Photoshop\r<br />- Bethesda&#39;s Creation Kit\r<br />\r<br />I&#39;m French so please, pardon my French… English ;)",
  "categoryId": "54",
  "version": "",
  "author": "Hoamaii",
  "createdUnix": "1368319845",
  "updatedUnix": "1368319531",
  "containsAdultContent": true,
  "uploadedBy": "Hoamaii",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029438",
      "name": "RSH II - Hoamaii Inner Wear for Male",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4660",
      "fileName": "RSH II - Hoamaii Inner Wear for Male-35940-.7z",
      "uploadedUnix": "1368319531",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/bbdaa457b3e4b90c9051761d84132563c0d90128ca02a1dbbb0ecd63bb6c271d/analysis/1407565882/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RSH%20II%20-%20Hoamaii%20Inner%20Wear%20for%20Male-35940-.7z?fid=1000029438&ttl=1535814807&ri=8192&rs=8192&setec=b95f4f3a2ee4e6a08bd8fc4532692b1e"
    }
  ]
}