{
  "modId": 35974.0,
  "modName": "Forgotten Classes - Nightblade",
  "summary": "This mod aim is to enhance the game for players like me - a Nightblade. \r\nWhat is a Nightblade? Nightblades use light armor, wield a blade or a dagger and use magic at the same time. They are silent assassins who overpower the enemy through illusion, restoration, destruction and deadly blows with weapons.  ",
  "descriptionHtml": "[Center][color=#FEFEFE][size=+2]Forgotten Classes - Nightblade[/size][/color][/center]\r\n\r\n[Center][size=+1]I have been pretty disappointed in how this game handles spells in combination with stealth. Daggers deal up to 30x sneak damage, bows are able to kill over great distances and if you play without smithing you probably don\\'t stand a chance at higher levels. Since i prefer a play-style with a one-handed blade + magic, sneaking around and win by tactics, not brute force, I decided to revive the old class known as Nightblade.[/size][/center]\r\n\r\nWhat does this mod do in particular? \r\nFirst of all, this mod comes with 2 plugins (2 independent files which can be used together or solo) and both only require vanilla Skyrim. \r\n\r\n[size=+1][color=red][u]The Enchanting changes are optional! IF you do NOT want to use them simply don\\'t copy the EnchantingTreeReworked.esp into your Skyrim/Data folder![/u][/color][/size]\r\n\r\nI overhauled the Enchanting tree, since I was disappointed in how small the reward for skilling up to 100 is. Now you can enchant every piece of armor with 2 effects, as soon as you have the Enchanter40 perk, but you lose 20% magnitude, if you pick all 5 perks, i.e. 80% instead of 100%.\r\n\\\"Insightful + corpus Enchanter\\\" now have 2 perks, each 15% / 30% increase and then, the jewel - Extra effect was renamed to Enchanter\\'s potency - Now you can add 3 effects to your armor, the magnitude increses to 2x more powerful enchantments and you get 20% magic resist - now it\\'s actually worth skilling up to 100 and getting all perks, don\\'t you think? \r\n\r\n[b][color=red] In order for the 3 enchantment effects to work, you HAVE TO get the Enchanter 40 perk. This is no bug, this is due to the limitations of Skyrim. [/b][/color]\r\n\r\nNow to the core:\r\nI have changed the enchantments of the Nightingale armor to better fit the above mentioned play-style. I also adjusted the Dark Brotherhood armor to be equivalent to the new empowered Nightingale armor.  I will now list, what i changed:\r\n\r\n[size=+1]Nightingale Armor[/size]\r\n[b]Helmet:[/b]\r\nnow fortifies Destruction, Illusion and Restoration power + Speechcraft by 10/15/20% regarding the level of armor and magicka regeneration by 20/30/40%\r\n\r\n[b]Chest:[/b]\r\nNow fortifies stamina, magic resist and carry weight. \r\nStamina: 20/30/40\r\nmagic resist: 12/17/25\r\ncarry weight: 20/30/40\r\n\r\n[b]Gloves:[/b]\r\nsame as before + Backstab enchanting. \r\n\r\n[b]Boots:[/b] \r\nMuffle effect fixed, no longer gives you the goddamn godmode silence so that you don\\'t need any sneaking skill at all\r\n20%/30%/40%\r\nand added a sneaking bonus of 15/20/25%\r\n\r\noverall this allows you to wield magic the way you want. \r\nI also changed the weapon to something like this:\r\n\r\nNightingales Talon absorbs <25> Health. poisons the target and deals <25> true damage.\r\n\r\nThat\\'s how the level 46+ edition looks.\r\n\r\nI also modified the nightingale powers to be more impressive. \r\n\r\nNightingale Strife and Nightingale Subterfuge now are spells.\r\n \r\nNightingale Strife now regenerates 350 HP and costs 200 magicka which cannot be reduced through perks or enchantments!\r\n\r\nNightingale Subterfuge now has a magnitude of 1000 - therefore it will affect everything (except dragons i think, at least it shouldn\\'t) in an area of 50 (25 default) and last 45 seconds (30 default) and costs 200 magicka, same as above. \r\n\r\nShadowcloak of Nocturnal - it will now last 600 seconds with vanilla effect. \r\nMy idea was, to make it last 3 minutes and that the invisibility didn\\'t break after interaction, but I honestly don\\'t have any idea of how to do that.\r\n\r\nIf someone knows how to do that, please contact me.\r\n\r\n[color=red][b]In case you want to know why i changed it to exactly these enchantments, i\\'ll direct you back to the vanilla game. The nightingale is an agent of Nocturnal, who servers her in life an death, utilizing many powers of the Illusion school. Just look at the 3 Nightingale powers, they utilize invisibility and frenzy + some life drain. Life drain is a vampiric power, a combination of destruction and illusion. With this in mind, the Nightingale is the modern, rather weak, version of a Nightblade. With this mod, it regained its power.[b][/color]\r\n\r\nNow to the Dark Brotherhood changes: \r\nI considered it quite strange, that an assassin who needs to sneak past guards and break into buildings actually doesn\\'t get any help for that. Well... til now. \r\n\r\n[size=+1]Cloth armor:[/size]\r\n[b]Hood:[/b]\r\n65% magicka regeneration and 15% magic resist\r\n\r\n[b]Chest:[/b] \r\nDestruction and Illusion spells are 15% stronger\r\n\r\n[b]Gloves:[/b]\r\nlockpicking increased by 15% + backstab\r\n\r\n[b]Shoes:[/b] \r\n25 % muffle and 20% sneak.\r\n\r\n[size=+1]Leather Armor, Ancient Shrouded Armor in brackets[/size]\r\n[b]Cowl[/b]\r\n20% Archery, 15% alchemy - yay better poisons!(30% archery, 25% alchemy, 10% sneak)\r\n\r\n[b]Chest[/b]\r\nResist poison 50%, 15% faster stamina regenration for better escaping (100% poison, 25% stamina regeneration rate)\r\n\r\n[b]Gloves[/b]\r\nBackstab, lockpicking 15% (backstab, lockpicking 20%)\r\n\r\n[b]Boots[/b]\r\n25% muffle, 20% sneak (40% muffle, 25% sneak)\r\n\r\nEven if that sounds weak, do not underestimate the effect of muffle at higher levels of sneak. If you use the recommended mods i listed below, you will be glad you get these armors. \r\n\r\n[b]Compatibility:[/b]\r\nThis mod will obviously be incompatible with any mod that alters the enchantments of the Nightingale armor or Dark Brotherhood armor. \r\n\r\nAlso, the optional file will not be compatible with any mod that changes the enchanting tree. \r\n\r\nRecommended mods so that it works the way it\\'s intended:\r\n\r\n[url=http://skyrim.nexusmods.com/mods/16225/?]Apocalypse spell package[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/16736/?]Classic classes[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/28418/?]Stealth Skills Rebalanced[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/11614/?]Enchantment Balance Overhaul[/url]\r\n\r\n[URL=http://skyrim.nexusmods.com/mods/19447/?]Sneak Tools[/url]\r\n\r\nThese mods are by no means required, my mod is totally standalone. Take your time to look around these mods and endorse them, they are well made. Borgut - the author of sneak tools - actually created 4 mods, i use all of them. ",
  "categoryId": "24",
  "version": "1",
  "author": "CroMe",
  "createdUnix": "1368388249",
  "updatedUnix": "1368388038",
  "containsAdultContent": false,
  "uploadedBy": "CroMe2314",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029575",
      "name": "Forgotten Classes - Nightblade",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Forgotten Classes - Nightblade-35974-1.zip",
      "uploadedUnix": "1368388038",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6f7b4914654102d12e4383030d653da8561f2e25ed18c5b7eae21ebee6f7b10b/analysis/1407567080/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forgotten%20Classes%20-%20Nightblade-35974-1.zip?fid=1000029575&ttl=1535814880&ri=8192&rs=8192&setec=9164a19951bb790043497e07a3a57960"
    }
  ]
}