{
  "modId": 35978.0,
  "modName": "Katria Lives",
  "summary": "Katria is a nord female warrior and can be found in The Drunken Huntsman in Whiterun",
  "descriptionHtml": "Katria is a nord female from Dawnguard DLC. She appears as a spirit who is encountered at the beginning of the Lost to the Ages quest. She pleads with you to leave, but accompanies you in spirit form until the quest line is complete. She then disappears from the game. Early on in the quest, you will stumble across her body. I am working on a quest to resurrect her and make her into a follower. there will be 2 versions of the mod. A full quest that requires the Dawnguard DLC, and a standard no quest version that will work with the vanilla game. I have created her character but still have a lot of stuff to do. So this a work in progress. She has a powerful bow (zephyr) and a dagger (Talon).\r\n\r\nShe prefers ranged weapons and attacks as a ranger. You can find her in the Drunken Huntsman in Whiterun.\r\n\r\nFuture versions will have custom commands, full voice acting and if you own dawnguard an Immersive quest. At the moment please consider this as a work in progress.\r\n\r\nTo install, just copy to your Data folder and activate the esp file.\r\napachiiskyhair 1.5 (full version) is required for the is mod.\r\n",
  "categoryId": "33",
  "version": "0.6",
  "author": "Dar0ne45",
  "createdUnix": "1368390073",
  "updatedUnix": "1368396326",
  "containsAdultContent": false,
  "uploadedBy": "Dar0ne45",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029603",
      "name": "Katria_noDLC_06",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "666",
      "fileName": "Katria_noDLC_06-35978-0-6.rar",
      "uploadedUnix": "1368396326",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/5642a85dd6543f93c36adb29805e7e035e0dd425a1e066a23d491f031818e04f/analysis/1407567252/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katria_noDLC_06-35978-0-6.rar?fid=1000029603&ttl=1535814885&ri=8192&rs=8192&setec=08323a5c085a56e597edf0d1657f6540"
    }
  ]
}