{
  "modId": 35979.0,
  "modName": "ESP Races",
  "summary": "A synthesis of the best ideas in skyrim race mods.",
  "descriptionHtml": "\r<br />[color=yellow]OVERVIEW[/color]\r<br />\r<br />This is the Race module of the Ehancement Synthesis Project or ESP.  The project began as a result of the imcompatibility of several different race mods that I was interested in playing which all had different but execellent features.  So, I decided to make my own mod to synthesize (combine) the features I liked best from the mods that interested me.  Following are some of the excellent mods which influenced the ideas in this mod:\r<br />[list]\r<br />[*][url=http://skyrim.nexusmods.com/mods/9286]Skyrim Redone Races[/url] by [url=http://skyrim.nexusmods.com/users/3958792]T3nd0[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/26217]Vanilla Races Redone [/url]by [url=http://skyrim.nexusmods.com/users/1934056]Erkeil[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/21587]Character Creation Overhaul [/url]by [url=http://skyrim.nexusmods.com/users/59982]syclonix[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/18649]Natural Talents [/url]by[url=http://skyrim.nexusmods.com/users/346642] icechambers[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/33795]Racial Traits Overhaul [/url]by [url=http://skyrim.nexusmods.com/users/2458832]TheLostDeathKnight[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/35489]Excellent Racials Package[/url] by [url=http://skyrim.nexusmods.com/users/3959191]EnaiSiaion[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/44684]Resplendent Racials Package[/url] by [url=http://skyrim.nexusmods.com/users/3959191]EnaiSiaion[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/37055]Immersive Race Names[/url] by [url=http://www.nexusmods.com/skyrim/users/6787717]Healey1991[/url]\r<br />[/list]\r<br />The racial skill bonuses (and detriments) are realized as increases (or decreases) in ease of learning for the skill.  Thus a +10 Light Weaponry bonus gives that race a 10% bonus to learning Light Weaponry skills.  All skills start at the default (15) for all races.\r<br />\r<br />[color=yellow]REQUIREMENTS[/color]\r<br />\r<br />[list]\r<br />[*]Skyrim 1.9.32.0.8 or newer (untested with earlier versions)\r<br />[*]Dawnguard DLC\r<br />[*][url=www.nexusmods.com/skyrim/mods/19]Unofficial Skyrim Patch[/url]\r<br />[*][url=http://skse.silverlock.org/]SKSE[/url] 1.6.13 or newer\r<br />[/list]\r<br />\r<br />NOTE: As of version 1.2, this mod is no longer dependent on Skyrim Redone.  T3nd0 has graciously given permission to merge this mod with his SkyRe Races, so this mod is now a drop-in replacement for SkyRe Races.  Although you do not need to have SkyRe installed for this mod to work, this mod is intended to be used with SkyRe.  Thus, if you are not using SkyRe, some of the settings may look a little odd.  For example, the damage done by Argonian and Khajiit claws are based on damage factors in SkyRe, and may be overpowered without SkyRe.  Additionally, if you are not using SkyRe, bonuses to Fingersmith will show up as Pickpocket bonuses, and bonuses to Wayfarer will show up as bonuses to Lockpicking.\r<br />\r<br />[color=yellow]DESCRIPTION[/color]\r<br />\r<br />[color=limegreen]Altmer (High Elf)[/color]\r<br />Calling themselves Altmer, or the &#34;Cultured People&#34;, the High Elves of Summerset Isle consider themselves to be the most civilized and cultured race in Tamriel, with some justice. They are strongly gifted in the arcane arts and are able to exert strict control over the flow of magic within them. They are among the longest living and most intelligent races of Tamriel, often becoming powerful magic users, having centuries in which to practice their art. Many of those found in Skyrim are representatives of the Thalmor, the instigators of the Great War which brought the Empire to its knees thirty years ago.\r<br />[b]Skills[/b]: +20 Illusion, Speech; +10 Alteration, Conjuration, Destruction, Enchanting, Restoration; -30 Block\r<br />[b]Stats[/b]: 100 magicka (regen +30%); 90 health (-5% regen); 90 stamina (-5% regen); 135 carry weight\r<br />[b]Abilities[/b]: Highborn: +150 magicka\r<br />[b]Weaknesses[/b]: -50% resist magic\r<br />[b]Powers[/b]: Channel Magicka: While active, both spell cost and magnitude grow dependent on your current magicka.\r<br />[b]Height[/b]: male 1.07; female 1.05\r<br />[b]Speeds[/b]:\r<br />[list]\r<br />[*]Walk forward: 120 - Walk left/right: 115 - Walk back: 110\r<br />[*]Run forward: 330 - Run left/right: 315 - Run back: 205\r<br />[*]Sneaking walk forward: 60 - Sneaking walk left/right: 55 - Sneaking walk back: 50\r<br />[*]Sneaking run forward: 160 - Sneaking run left/right 150 - Sneaking run back: 110\r<br />[*]Sprint forward: 450 - Sprint back: 280\r<br />[/list]\r<br />\r<br />[color=limegreen]Bosmer (Wood Elf)[/color]\r<br />The Elven clan-folk of Valenwood are the best archers in all of Tamriel. The Bosmer can snatch and fire arrows in one continuous motion; they are even rumored to have invented the bow, and they craft the deadliest of arrows. They have many natural and unique abilities; notably, they can command simple-minded creatures and have a nearly chameleon-like ability to hide in forested areas. The Green Pact prohibits them from harming the vegetation of their homeland (though importing produce is permitted), making them religiously carnivorous and supreme hunters. \r<br />[b]Skills[/b]: +30 Marksmanship; +20 Alchemy, Sneak; +10 Light Armor, Wayfarer; -30 Heavy Armor\r<br />[b]Stats[/b]: 110 magicka (+5% regen); 110 health (+5% regen); 120 stamina (+10% regen); 175 carry weight\r<br />[b]Abilities[/b]: \r<br />[list]\r<br />[*]Wild Hunt: Increases bow damage against non-playable races by 25%\r<br />[*]Wood Lore: Bosmer may enhance arrows with magical powers at forges. Enhanced arrows have an area affect paralyzing targets for one second and reducing light and heavy weapon damage by 30% for ten seconds.\r<br />[/list]\r<br />[b]Powers[/b]: Wild Companion: Bosmer may call an animal companion to aid them for 5 minutes. The summoned companioin is leveled, behaves like a summoned creature (but doesn&#39;t count towards the summon limit), and varies depending on the location the Bosmer is in. In snowy regions, snow bears appear, in caves, chaurus arrive to aid the caller, and everywhere else wolves answer the call for aid. Usable every 10 minutes.\r<br />[b]Height[/b]: 1.03 male; 1.01 female\r<br />[b]Speeds[/b]: \r<br />[list]\r<br />[*]Walk forward: 110 - Walk left/right: 106 - Walk back: 102\r<br />[*]Run forward: 340 - Run left/right: 330 - Run back: 230\r<br />[*]Sneaking walk forward: 60 - Sneaking walk left/right: 57 - Sneaking walk back: 55\r<br />[*]Sneaking run forward: 170 - Sneaking run left/right 160 - Sneaking run back: 115\r<br />[*]Sprint forward: 470 - Sprint back: 295\r<br />[/list]\r<br />\r<br />[color=limegreen]Breton[/color]\r<br />The Bretons of High Rock have the mixed blood of Men and Elves, the product of intermingling millennia ago. All Bretons have an affinity to magic as well as an innate resistance to it; their twin blood can prove a dangerously potent mixture, allowing them to achieve seemingly impossible feats of magic or summoning. In Skyrim, the Forsworn of The Reach are of largely Bretonian descent, and claim to be the original settlers, rather than the Nords. \r<br />[b]Skills[/b]: +20 Alteration, Conjuration; +10 Destruction, Enchanting, Illusion, Restoration, Alchemy; -15 Smithing, Heavy Weaponry\r<br />[b]Stats[/b]: 150 magicka (+20% regen); 100 health (standard regen); 100 stamina (standard regen); 150 carry weight\r<br />[b]Abilities[/b]:\r<br />[list]\r<br />[*]Twin Blood: 25% magic resistance\r<br />[/list]\r<br />[b]Powers[/b]:\r<br />[list]\r<br />[*]Twin Blood Eruption: For 60 seconds, all spells are twice as strong and cost half as much magicka, while health and stamina take continuous damage and ”Twin Blood” is negated.\r<br />[*]Twin Blood Summoning: For 60 seconds you can summon without limits, while health and stamina take continuous damage and ”Twin Blood” is negated.\r<br />[/list]\r<br />[b]Height[/b]: male 0.99; female 0.95\r<br />[b]Speeds[/b]:\r<br />[list]\r<br />[*]Walk forward: 105 - Walk left/right: 102 - Walk back: 100\r<br />[*]Run forward: 330 - Run left/right: 315 - Run back: 205\r<br />[*]Sneaking walk forward: 58 - Sneaking walk left/right: 55 - Sneaking walk back: 50\r<br />[*]Sneaking run forward: 165 - Sneaking run left/right 155 - Sneaking run back: 105\r<br />[*]Sprint forward: 450 - Sprint back: 280\r<br />[/list]\r<br />\r<br />[color=limegreen]Cyrodiil (Imperial)[/color]\r<br />The well-educated and well-spoken natives of the civilized, cosmopolitan province of Cyrodiil are more commonly known as Imperials. Cyrodiils are known for the discipline and training of their citizen armies, and their respect for the rule of law. Though physically less imposing than the other races, the Cyrodiils have proved to be shrewd diplomats and traders, and these traits, along with their remarkable skill and training in tactics and leadership, enabled them to subdue all the other nations and races and erect the monument to peace and prosperity that comprised the Glorious Empire.\r<br />[b]Skills[/b]: +30 Speechcraft; +10 Block, Heavy Armor, Light Weaponry, Destruction, Enchanting, Restoration; -30 Fingersmith\r<br />[b]Stats[/b]: 110 magicka (+5% regen); 115 health (+7.5% regen); 125 stamina (+12.5% regen); 180 carry weight\r<br />[b]Abilities[/b]: \r<br />[list]\r<br />[*]Imperial Charisma: 25% better buying and selling prices\r<br />[*]Tactician: Whenever successfully blocking an attack, you drain the attacker&#39;s stamina by 10%\r<br />[/list]\r<br />[b]Powers[/b]: \r<br />[list]\r<br />[*]Attack Order: Followers deal 25% more spell and weapon damage and move and attack 25% faster, but also suffer 25% more spell and weapon damage.\r<br />[*]Guard Order: Followers deal 25% less spell and weapon damage and take 50% less damage from spells and weapons.\r<br />[/list]\r<br />[b]Height[/b]: male 1.02; female 1.00\r<br />[b]Speeds[/b]: \r<br />[list]\r<br />[*]Walk forward: 110 - Walk left/right: 105 - Walk back: 100\r<br />[*]Run forward: 335 - Run left/right: 320 - Run back: 210\r<br />[*]Sneaking walk forward: 58 - Sneaking walk left/right: 54 - Sneaking walk back: 50\r<br />[*]Sneaking run forward: 163 - Sneaking run left/right 155 - Sneaking run back: 110\r<br />[*]Sprint forward: 460 - Sprint back: 290\r<br />[/list]\r<br />\r<br />[color=limegreen]Dunmer (Dark Elf)[/color]\r<br />The Dunmer, also known as Dark Elves, or Moriche in the Ayleid Language, are the ash-skinned, red-eyed, Elven peoples of the Eastern Empire. Despite their powerful skills and strengths, the Dunmer&#39;s vengeful nature, age-old conflicts, betrayals, and ill-reputation prevent them from gaining more influence. The hereditary animosity of their ancestors still boils within their blood, making them even more dangerous when wounded and angered. The eruption of the Red Mountain some 200 years ago led to a great exodus, bringing many Dunmer to the neighboring Skyrim, and Windhelm in particular.\r<br />[b]Skills[/b]: +30 Destruction; +20 Light Weaponry; +10 Marksmanship, Illusion, Light Armor, Sneak; -30 Restoration\r<br />[b]Stats[/b]: 125 magicka (regen +10%); 100 health (standard regen); 125 stamina (regen +10%); 175 carry weight\r<br />[b]Abilities[/b]:\r<br />[list]\r<br />[*]Dunmer Heritage: 50% fire resistance\r<br />[*]Ancestor’s Wrath [NOT PLAYER]: Flame cloak triggers automatically, once they get hit and drop below 50% health, and is not limited to one use per day. In addition to the flame cloak spell, it also adds 25% additional strength to fire-based spells. The flame cloak effect starts at a damage of 5 per second, but grows by 3 every 10 levels, up to a maximum of 17 (before bonuses are calculated in, including it’s own).\r<br />[*]Ancestor’s Wrath [PLAYER]: The same as above, but no flame cloak is cast; instead, you get a 15% chance to ignore incoming melee attacks.\r<br />[*]Ancestor’s Fury: Once per day, if your health drops below 30%, you trigger a huge explosion and two angry Dunmer ancestors arrive to aid you. They are leveled and use strong weaponry.\r<br />[/list]\r<br />[b]Height[/b]: male 1.04; female 1.02\r<br />[b]Speeds[/b]:\r<br />[list]\r<br />[*]Walk forward: 113 - Walk left/right: 108 - Walk back: 105\r<br />[*]Run forward: 335 - Run left/right: 320 - Run back: 220\r<br />[*]Sneaking walk forward: 60 - Sneaking walk left/right: 57 - Sneaking walk back: 55\r<br />[*]Sneaking run forward: 165 - Sneaking run left/right 155 - Sneaking run back: 105\r<br />[*]Sprint forward: 460 - Sprint back: 290\r<br />[/list]\r<br />\r<br />[color=limegreen]Khajiit[/color]\r<br />Hailing from the deserts and jungles of Elsweyr, these feline humanoids are typically fleet of feet and deadly of claw, possessing an innate survival instinct and ability to see in the dark. While these traits make them superb thieves and acrobats, Khajiit are also fearsome warriors, although seldom gifted with the skill to harness magical forces. The divergent appearance and mannerisms of the Khajiit often lead bigoted members of other races to look down on them. In Skyrim, Khajiit are usually seen in trade caravans, though few are permitted to enter the cities.\r<br />[b]Skills[/b]: +30 Sneak, Light Weaponry; +10 Light Armor, Wayfarer, Fingersmith; -60 Marksmanship (only applies to bows)\r<br />[b]Stats[/b]: 80 magicka (-10% regen); 120 health (+10% regen); 140 stamina (+20% regen); 185 carry weight\r<br />[b]Abilities[/b]: \r<br />[list]\r<br />[*]Feline Athletics: Khajiit take only half falling damage, and jump 50% higher.\r<br />[*]Fur Coat: Khajiit fur provides natural protection from cold (25% frost resistance)\r<br />[*]Feline Claws: Razor sharp claws out give bonus damage to unarmed attacks that scale with your Light Weaponry (One Handed) skill and Stamina (30 max bonus).\r<br />[*]Survival instinct: Once per day, if your health drops below 25%, your movement and attack speed increases by 25% for 30 seconds.\r<br />[/list]\r<br />[b]Powers[/b]: Night Eye: Khajiit have the ability to adjust their eyesight whenever desired to improve sight in diminished light.\r<br />[b]Height[/b]: male 1.04; female 1.02\r<br />[b]Speeds[/b]: \r<br />[list]\r<br />[*]Walk forward: 112 - Walk left/right: 109 - Walk back: 106\r<br />[*]Run forward: 360 - Run left/right: 355 - Run back: 260\r<br />[*]Sneaking walk forward: 70 - Sneaking walk left/right: 67 - Sneaking walk back: 62\r<br />[*]Sneaking run forward: 185 - Sneaking run left/right 178 - Sneaking run back: 130\r<br />[*]Sprint forward: 530 - Sprint back: 350\r<br />[/list]\r<br />\r<br />[color=limegreen]Nord[/color]\r<br />Natives of Skyrim, the Nords are a race of tall and fair-haired humans who have developed a resistance to the cold of their homeland. Though they tend to treat magic and magic-users with disdain, Nords are ferocious warriors, becoming increasingly enraged with each blow they take, and many become renowned soldiers and mercenaries all over Tamriel. Fiercely proud of their heritage, and traditionally staunch supporters of the Empire, the Nords have become embroiled in a brutal civil war in recent years as calls for independence have increased. The Stormcloaks are comprised chiefly of Nords.\r<br />[b]Skills[/b]: +20 Light Weaponry, Heavy Weaponry, Light Armor; +10 Block, Heavy Armor, Smithing; -15 Conjuration, Destruction\r<br />[b]Stats[/b]: 60 magicka (-20% regen); 135 health (+17.5% regen); 140 stamina (+20% regen); 210 carry weight\r<br />[b]Abilities[/b]: \r<br />[list]\r<br />[*]Warrior Heart: As your health decreases, your weapon damage grows.\r<br />[*]Skyrim Native: 50% frost resistance\r<br />[/list]\r<br />[b]Powers[/b]: Last Stand: In the heat of battle, a trained Nord warrior may enter a battle frenzy, taking no damage and regenerating no health for seven seconds in exchange for losing all stamina when the battle frenzy expires. Requires rest before reuse.\r<br />[b]Height[/b]: male 1.14; female 1.11\r<br />[b]Speeds[/b]: \r<br />[list]\r<br />[*]Walk forward: 130 - Walk left/right: 125 - Walk back: 120\r<br />[*]Run forward: 345 - Run left/right: 325 - Run back: 215\r<br />[*]Sneaking walk forward: 62 - Sneaking walk left/right: 57 - Sneaking walk back: 52\r<br />[*]Sneaking run forward: 165 - Sneaking run left/right150 - Sneaking run back: 115\r<br />[*]Sprint forward: 455 - Sprint back: 280\r<br />[/list]\r<br />\r<br />[color=limegreen]Orsimer (Orc)[/color]\r<br />Orsimer, also called Orcs or &#34;Pariah Folk&#34; in ancient times, are noted for their unshakable courage in war and their unflinching endurance of hardships. In the past, Orsimer were considered goblin-ken; but it is now thought that Orsimer have Elven blood, supposedly having been transformed along with the spirit Malacath when Boethiah defeated him.  Orsimer armorers are prized for their craftsmanship, and Orsimer warriors in heavy armor are among the finest front-line troops in the Empire, and are fearsome when using their berserker rage.\r<br />[b]Skills[/b]: +30 Smithing; +20 Heavy Armor; +10 Block, Light Weaponry, Heavy Weaponry, Enchanting; -30 Sneak\r<br />[b]Stats[/b]: 40 magicka (-30% regen); 150 health (+25% regen); 150 stamina (+25% regen); 225 carry weight\r<br />[b]Abilities[/b]: Orcish Smithing Lore: Orcs are able to temper weapons and improve armor 25% better than any other race\r<br />[b]Weaknesses[/b]: -15% magic resistance\r<br />[b]Powers[/b]: Berserker Rage: In the heat of battle, an Orc may enter a battle rage, rapidly increasing damage output and decreasing all incoming damage for 60 seconds in exchange for a 25% decrease in current health and 50% reduction in potion potency. Requires rest before reuse.\r<br />[b]Height[/b]: male 1.08; female 1.06\r<br />[b]Speeds[/b]: \r<br />[list]\r<br />[*]Walk forward: 140 - Walk left/right: 135 - Walk back: 130\r<br />[*]Run forward: 340 - Run left/right: 330 - Run back: 230\r<br />[*]Sneaking walk forward: 55 - Sneaking walk left/right: 50 - Sneaking walk back: 45\r<br />[*]Sneaking run forward: 150 - Sneaking run left/right140 - Sneaking run back: 100\r<br />[*]Sprint forward: 435 - Sprint back: 300\r<br />[/list]\r<br />\r<br />[color=limegreen]Redguard[/color]\r<br />The most naturally talented warriors in Tamriel, the dark-skinned, wiry-haired Redguards of Hammerfell seem born to battle, though their pride and fierce independence of spirit makes them more suitable as scouts or skirmishers, or as free-ranging heroes and adventurers, than as rank-and-file soldiers. In addition to their cultural affinities for many weapon and armor styles and their uncanny ability to anticipate an opponent&#39;s blows, the harsh desert conditions of their homeland have blessed Redguards with hardy constitutions, resistance to poison and disease, and quickness of foot.\r<br />[b]Skills[/b]: +20 Block; +10 Marksmanship, Heavy Armor, Light Weaponry, Heavy Weaponry, Light Armor, Wayfarer, Sneak; -30 Alchemy\r<br />[b]Stats[/b]: 80 magicka (-10% regen); 125 health (+12.5% regen); 135 stamina (+20% regen); 195 carry weight\r<br />[b]Abilities[/b]: Desert Training: +50 stamina, 20% disease resistance, 20% poison resistance, 20% fire resistance\r<br />[b]Weaknesses[/b]: -30% frost resistance\r<br />[b]Powers[/b]: Sandstorm Charge: A trained Redguard warrior may call upon the power of the sandstorms of his homeland to slow time by 25% and increase his own speed by 15% for 15 seconds. Usable every 2 minutes.\r<br />[b]Height[/b]: male 1.08; female 1.06\r<br />[b]Speeds[/b]: \r<br />[list]\r<br />[*]Walk forward: 115 - Walk left/right: 110 - Walk back: 105\r<br />[*]Run forward: 345 - Run left/right: 335 - Run back: 230\r<br />[*]Sneaking walk forward: 63 - Sneaking walk left/right: 59 - Sneaking walk back: 54\r<br />[*]Sneaking run forward: 170 - Sneaking run left/right 160 - Sneaking run back: 120\r<br />[*]Sprint forward: 475 - Sprint back: 300\r<br />[/list]\r<br />\r<br />[color=limegreen]Saxhleel (Argonian)[/color]\r<br />Hailing from the swamps of Black Marsh, this reptilian race has adapted to the harsh demands of its homeland. They have developed natural immunities to the diseases and poisons that have doomed many would-be explorers and conquerors of the region. The ability to breathe underwater, protective scales which deflect blades, and poisonous claws have made Saxhleel excellent hunters, while their bond with the ancient Hist trees allows them to manipulate their regenerative abilities, and cause extra toxic damage with their claws.\r<br />[b]Skills[/b]: +20 Light Weaponry, Light Armor, Fingersmith; +10 Alteration, Restoration, Sneak; -30 Speechcraft\r<br />[b]Stats[/b]: 120 magicka (+10% regen); 90 health (-5% regen); 110 stamina (+5% regen); 155 carry weight\r<br />[b]Abilities[/b]:\r<br />[list]\r<br />[*]Black Marsh Native: 50% disease resistance; 50% poison resistance\r<br />[*]Waterbreathing: Breathe under water\r<br />[*]Protective Scales: Saxhleel take 25% less damage from daggers, swords, waraxes, greatswords and battleaxes.\r<br />[*]Saxhleel Talons: When fighting unarmed, your talons secrete hist, causing extra toxic damage. Damage scales with your Magicka, Stamina, and Health (max 15 per attribute at 300). Other Saxhleel, ghosts, and undead (including Vampires) are immune.\r<br />[*]Hist Blood: The Hist in your blood increases your rejuvenation the more damage you take.  Heatlh, Magicka, and Stamina regenerate 50% faster when less than 75%, 75% faster when less than 50%, and 100% faster when less than 25%.\r<br />[/list]\r<br />[b]Weaknesses[/b]: Cold Blooded (-50% resist frost)\r<br />[b]Height[/b]: male 1.03; female 1.02\r<br />[b]Speeds[/b]:\r<br />[list]\r<br />[*]Walk forward: 115 - Walk left/right: 110 - Walk back: 100\r<br />[*]Run forward: 365 - Run left/right: 355 - Run back: 260\r<br />[*]Sneaking walk forward: 68 - Sneaking walk left/right: 65 - Sneaking walk back: 60\r<br />[*]Sneaking run forward: 180 - Sneaking run left/right 175 - Sneaking run back: 125\r<br />[*]Sprint forward: 500 - Sprint back: 320\r<br />[/list]\r<br />\r<br />[color=yellow]COMPATIBILITIES[/color]\r<br />\r<br />This mod will not be compatible with any mod that edits the race records (including vampire records), such as those listed as inspiration at the top of this page.  It should be compatible with anything else.\r<br />\r<br />[color=yellow]FUTURE PLANS[/color]\r<br />[list]\r<br />[*]investigate option for race randomization, and if possible, create a persistent record of races played to affect random weighting\r<br />[/list]\r<br />",
  "categoryId": "34",
  "version": "2.0.1",
  "author": "Thalioden",
  "createdUnix": "1368408069",
  "updatedUnix": "1420319669",
  "containsAdultContent": false,
  "uploadedBy": "Thalioden",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029587",
      "name": "ESP Races",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "31",
      "fileName": "ESP Races-35979-1-0.7z",
      "uploadedUnix": "1368391163",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5ca606eae75248492a336a9ff3108bf1a39c12f933c8dcc489153ab949164fac/analysis/1407567125/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP%20Races-35979-1-0.7z?fid=1000029587&ttl=1535814887&ri=8192&rs=8192&setec=668ba429581a0791b3d15c85a48c0483"
    },
    {
      "fileId": "1000029613",
      "name": "ESP Races",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "31",
      "fileName": "ESP Races-35979-1-1.7z",
      "uploadedUnix": "1368403848",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f372097efb97e8fa27df8c0f616aa92cb681ab78d64dc0d823927e49c15dcdd0/analysis/1407567406/",
      "changelogHtml": " added Khajiit Fur frost resistance <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP%20Races-35979-1-1.7z?fid=1000029613&ttl=1535814887&ri=8192&rs=8192&setec=58f15f4e00c8a286fe10dc63e4725491"
    },
    {
      "fileId": "1000033261",
      "name": "ESP Races",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73",
      "fileName": "ESP Races-35979-1-2.7z",
      "uploadedUnix": "1370660880",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/23e0194247fbba65947acd9ca26222ca12c92c4a27f9a7297473af4814ded4d5/analysis/1407595891/",
      "changelogHtml": " removed dependencies on SkyRe (Thank you, T3nd0, for permission to merge with SkyRe-Races&#33;) <br/> \n Thank you, Erkeil, for explicit permission to use race settings from Vanilla Races Redone&#33; <br/> \n reworked and scripted Khajiit claws - should now scale more smoothly and dependably <br/> \n reworked and boosted Argonian claws - poison should not work if attack blocked, damage done is now 2% of each of health, magicka, and stamina <br/> \n Argonian Histskin (now called Hist Blood) now passive ability (conformed to SkyRe Races 1.3 design) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP%20Races-35979-1-2.7z?fid=1000033261&ttl=1535814887&ri=8192&rs=8192&setec=623d56b5c677ada7b655dfb6eda9131b"
    },
    {
      "fileId": "1000126941",
      "name": "ESP Races",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "96",
      "fileName": "ESP Races-35979-1-3.7z",
      "uploadedUnix": "1410751877",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/4e30f3ef33c804652ead97bb81a7d90bac8641b9a0bbcdd7ba67ec57e28ee4f0/analysis/1410751982/",
      "changelogHtml": " Conformed to SkyRe Races 1.3 <br/> \n removed Argonian claw attack poison due to some reported spamming issues and conflict with apply spell on hit perk entry point <br/> \n New race names inspired by Immersive Race Names <br/> \n Argonian and Khajiit unarmed damage now operate without scripts&#33;  Argonian toxic claw damage is simulated with keywords and conditions to avoid spell on hit perk entry point conflict <br/> \n fix:Redguard Skills were not consistent with description <br/> \n separated Pedagogy effects so that detriments show up as red in active magic effects <br/> \n separated Highborn bonus and weakness so they show up differently in active magic effects <br/> \n doubled pedagogy facilities and tripled pedagogy inaptitudes for greater racial diversity <br/> \n boosted Altmer weakness to magic <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP%20Races-35979-1-3.7z?fid=1000126941&ttl=1535814888&ri=8192&rs=8192&setec=1c1f749f38514a58ef4f3a9b59301b59"
    },
    {
      "fileId": "1000126945",
      "name": "ESP Races",
      "version": "1.3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "95",
      "fileName": "ESP Races-35979-1-3-1.7z",
      "uploadedUnix": "1410754517",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/445261a7da71b3824bdfc2f75aef26b81cd2cd9599a49367737fc422764a7df8/analysis/1410754622/",
      "changelogHtml": " corrected High Born Weakness description <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP%20Races-35979-1-3-1.7z?fid=1000126945&ttl=1535814889&ri=8192&rs=8192&setec=845cdeb97d191d6e2c5bef6bd60adcdf"
    },
    {
      "fileId": "1000136654",
      "name": "ESP Races",
      "version": "2.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "93",
      "fileName": "ESP Races-35979-2-0-0.7z",
      "uploadedUnix": "1416880404",
      "modVersion": "2.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/f9ba3c7e1d062360786aaaef12016162129a75d51727e93d3c5757d7ca8dbf77/analysis/1416880502/",
      "changelogHtml": " Fix: renumbered most formids to resolve injection conflicts with Unofficial Skyrim Patch and Dawnguard <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP%20Races-35979-2-0-0.7z?fid=1000136654&ttl=1535814889&ri=8192&rs=8192&setec=d555a9f36104533f2de1eab024fb17b1"
    },
    {
      "fileId": "1000141275",
      "name": "ESP Races",
      "version": "2.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "92",
      "fileName": "ESP Races-35979-2-0-1.7z",
      "uploadedUnix": "1420319669",
      "modVersion": "2.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/c1ef7c47b10ad83777fb8cb1248324902f0cecac2dc84c2da7ddb5e70e753653/analysis/1420319703/",
      "changelogHtml": " Fix: corrected Channel Magicka so that it is properly applied and shows in the UI <br/> \n Fix: RedGuard ability descriptions are now accurately displayed <br/> \n Fix: Sandstorm Charge now works as it should <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP%20Races-35979-2-0-1.7z?fid=1000141275&ttl=1535814889&ri=8192&rs=8192&setec=53c738c8ecbf9a33d984e5c85dc4ea4d"
    }
  ]
}