{
  "modId": 35980.0,
  "modName": "Whitestone Spire",
  "summary": "New and unusual player home built out of the peak of a mountain. ",
  "descriptionHtml": "HELP NEEDED: This is a general appeal for help to anyone good at Papyrus Scripts. I have been trying in vain to make a script that turns certain lights on during the day and off at night, and vice versa. I want to improve the ambiance by turning sunlight off at night and the fires on, and vice versa. If anyone knows how to or has a script ready and cares to help me, please message me&#33;&#33;\r<br />\r<br />UPDATE: I have posted a major update for Whitestone Spire. It contains major changes:\r<br />\r<br />1. I have added new gateways to the interior to help access all areas of the citadel with greater ease. They use the main entrance as a hub and now no place in the Spire is more than two load screens away, if that. Also, the entrance hub has dwemer tubes near the main gate to the exterior; these are General Store containers for a quick drop off or pickup without having to enter the citadel proper.\r<br />2. Added a complete 9-god altar to the apartment as well as a hub with one-way doors to all major towns in Skyrim. I repeat, these doors are ONE WAY, you cannot return through them.\r<br />3. Redone the agricultural dome entirely. Beware, this mod silences Nirnroots, otherwise the agri-dome would be unbearably loud.\r<br />4. Redecorated the interior top to bottom, so I hope you weren&#39;t too attached to the old style. \r<br />5. Expanded the Main Hall to include more mannequins and weapon plaques.\r<br />6. Redecorated the exterior terraces a bit to make them more pleasant to the eye.\r<br />7. The Forge forge now counts as a Skyforge for all intents and purposes.\r<br />\r<br />UPDATE INSTALL: \r<br />\r<br />Just copy and paste the new update files over the old ones. Say yes to any override requests. \r<br />\r<br />\r<br />OLD DESCRIPTION:\r<br />\r<br />Finally after months of work, I&#39;ve completed my first mod. It is finished. I think. The house is at the top of a peak east of Markath, the map marker should read Citadel on a Peak. It&#39;s free, just walk in and it&#39;s yours. I may add purchasing and even a quest later on when i figure out how to do it. \r<br />\r<br />WARNING: this is a very complex mod, especially on the outside. Make sure you&#39;ve got a decent rig for it.\r<br />\r<br />It&#39;s fully functional, navmeshed inside and out, and comes with conveniently placed General Stores storage, in the forge, near the rude merchant (he works 0600-2300, hence his name), right next to the entrance for a quick drop-off and even in your appartment. And you can store books. And it has non-general stores storage. And a few bags of gold. And gems, to kick-start the new dragonborn.\r<br />\r<br />It has an alchemy station, enchanting station, forge, cooking spit and all the other crafting stations in the vanilla game. \r<br />\r<br />The house also features planting plots from Hearthfire, existing food crops, alchemical ingredient spread throughout the decorative vegetation and a cave with every ore vein in the game. The main hall has weapons plaques and mannequins to show off your second favourite gear (i assume u&#39;d be wearing your most favourite). And it has a shrine of Talos. I may add all the gods later on when I figure out where I can put them.\r<br />\r<br />AND&#33; it&#39;s not bigger on the inside than on the outside. My personal quirk.\r<br />\r<br />I&#39;ve tested all the features in the house for functionality as best I could, and it should all work. Please be patient and let me know of any bugs you find. \r<br />\r<br />REQUIREMENTS:\r<br />\r<br />Update.esm & bsa\r<br />Dawnguard\r<br />Hearthfire\r<br />GeneralStores \r<br />\r<br />Please write nice things about it as it makes me feel all warm and fuzzy.\r<br />\r<br />Thanks to:\r<br />\r<br />New Plants by Tamira for the tropical plants and statues:\r<br />   Yughues aka Nobiax (http://www.sharecg.com/pf/full_uploads.php?pf_user_name=yughues) for creating the original models and textures\r<br />   Birdy (http://www.sharecg.com/pf/full_uploads.php?pf_user_name=birdy) for creating the decidious tree mesh.\r<br />\r<br />A Classier BB Luxury Suite. V5.0 by RIP88 and:\r<br />http://Webtreats.mysitemyway.com for their textures and patterns \r<br />\r<br />Clintster74 for the paintings, some of the marble, glass and wood textures, new food statics and the beautiful paintings\r<br />\r<br />MJY for the other wonderful marble and wood textures, new furniture, angel statue, the new chairs and sofa \r<br />\r<br />Harvey2112 and those who helped him for the brilliant General Stores mod\r<br />\r<br />Stroti for the gorgeous medieval bed \r<br />\r<br />Blary for the Open Books Resource, bookset\r<br />\r<br />Oaristys & Tony67 for the Modders Resource Pack\r<br />\r<br />Lilith for the Ready Clutter resources\r<br />\r<br />More Colorful Trees\r<br />Author: Mentha\r<br />\r<br />Varlais for his beautiful Ayleid ruins resource\r<br />\r<br />Runspect for his mod resource pack, including the angel statues and the ghost ship\r<br />\r<br />The Niftools team for giving us Nifskope\r<br />Bethesda for Skyrim and the Creation Kit\r<br />\r<br />PS: don&#39;t worry about the doors you can&#39;t open, I&#39;ve left them there for future expansion. Also, sorry about the lighting, I&#39;m having trouble getting light markers not to clip each other.\r<br />PPS: if i haven&#39;t included your work in the credits, I apologise, it was not intentional, just let me know and I&#39;ll remedy the situation.",
  "categoryId": "68",
  "version": "2",
  "author": "GabrielHellborne",
  "createdUnix": "1368397054",
  "updatedUnix": "1386073855",
  "containsAdultContent": false,
  "uploadedBy": "GabrielHellborne",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029608",
      "name": "Whitestone Spire",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "147649",
      "fileName": "Whitestone Spire-35980-1-0.7z",
      "uploadedUnix": "1368400712",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9cb5eb8cf368ac65e85d1ccb8a4f0fe5fc4853d73b51a741fda35e1f4c050ed6/analysis/1407567395/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whitestone%20Spire-35980-1-0.7z?fid=1000029608&ttl=1535814891&ri=8192&rs=8192&setec=94ec228a0f3320ca11cf1552b46bc6ef"
    },
    {
      "fileId": "1000085244",
      "name": "Update for Whitestone 2",
      "version": "1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "32338",
      "fileName": "Update for Whitestone 2-35980-1.7z",
      "uploadedUnix": "1386073855",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ec8b86d470a2abb3a1ff7dccf10d3bde0a3c28362c3253aa8f166cea51e6840d/analysis/1407817996/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20for%20Whitestone%202-35980-1.7z?fid=1000085244&ttl=1535814891&ri=8192&rs=8192&setec=c2d25a81c7dd5b957f5868241091cbc6"
    }
  ]
}