{
  "modId": 35994.0,
  "modName": "Clandestine SECRETIVE Nightingale Hall",
  "summary": "A simple mod to make Nightingale Hall (home of the Nightingales, the most secretive sect in all of Tamriel), *actually hidden* and not so easy to find.",
  "descriptionHtml": "SEMI-SPOILER ALERT (sorry)\r<br />\r<br />The Nightingales are the most secretive, elusive faction in the entire game - if not all of Tamriel - and people are not even sure if they really exist, as evidenced by books such as &#34;Nightingales - Fact or Fiction?&#34;  Indeed I don&#39;t even think any of the NPCs in the game (excluding its members) even mention the name Nightingales throughout the entire game.\r<br />\r<br />However, for a faction which is supposed to be so incredible at stealth, mystery, and being unnoticed, Nightingale Hall looks like it would be pretty easy to find.  The path to the entrance (that&#39;s right, the secret hideout has a fricken PATH leading to it) is literally a stone&#39;s throw away from Riften, and there is a giant, black, VERY conspicuous Monolith stone which, when you look in its general direction, screams &#34;HEY DON&#39;T WORRY NOTHING TO SEE HERE MOVE ALONG&#33;&#34;  \r<br />\r<br />Okay I might have exaggerated a bit, but still, the Monolith Stone is right beside the path leading to the tunnel where the Hall is.  Any drunken Bandit Marauder with half a wit could stumble his way to the Hall once it&#39;s been opened and defile the Shrine of Nocturnal while the Trinity is sneaking about filling their pockets with goodies.\r<br />\r<br />This bugged me so much that I decided to fix it myself.  All I did was add a bunch of clutter (stones, trees, shrubs) to cover the side path leading to the Monolith Stone, added trees to hide the Monolith itself, and cluttered the heck out of the cave entrance of the Hall itself.\r<br />\r<br />I&#39;ve included before/after pictures for you to compare for yourself, but I think it&#39;s much more effective when you run around in-game.  Believe me, if you are playing this game and haven&#39;t gotten to the Hall yet, you probably won&#39;t even be able to find it for a while.\r<br />\r<br />The end result is - I hope - a more immersive, realistic and CLANDESTINE version of the hall for you to hide away in.\r<br />\r<br />Enjoy&#33;",
  "categoryId": "78",
  "version": "1.0",
  "author": "Dahveed",
  "createdUnix": "1368428386",
  "updatedUnix": "1368427040",
  "containsAdultContent": false,
  "uploadedBy": "Dahveed",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029646",
      "name": "Hidden NightIngale Hall",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Hidden Nightengale Hall-35994-1-0.rar",
      "uploadedUnix": "1368427040",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6d13f9bfebb6c85eabe48ad73a9ddd4fcb6f35963ad25ba063c5f11026781f8b/analysis/1407567579/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hidden%20Nightengale%20Hall-35994-1-0.rar?fid=1000029646&ttl=1535814914&ri=8192&rs=8192&setec=137259d8772dd872fc13437883dc869f"
    }
  ]
}