{
  "modId": 36047.0,
  "modName": "Alternate Actors",
  "summary": "Play as any actor or creature&#33;",
  "descriptionHtml": "[center][img]http://static2.nexusmods.com/110/mods/110/images/36047-1-1368579173.png[/img][/center]\r<br />[img] http://static1.nexusmods.com/110/mods/110/images/36047-1-1368821516.png [/img]\r<br />[color=#5dffff]Alternate Actors allows you to play as anyone, as well as change the looks of NPCs&#33;[/color] Cast one of two spells to control animals or people. The control people spell allows you almost complete control over that actor, the control animal spell lets you travel as far as you like, and gives you 3 unique attacks for that creature.\r<br />\r<br />[img] http://static1.nexusmods.com/110/mods/110/images/36047-4-1370630619.png [/img]\r<br />[b][u]\r<br />[url=http://skse.silverlock.org/]Skyrim Script Extender is required&#33;[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/28170/?]Better Messagebox Controls is required&#33;[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/3863/?]SkyUI is required&#33;[/url]\r<br />[/b][/u]\r<br />Without these mods, AA will never give you the spells or leave the loading screen&#33;\r<br />\r<br />[img]http://static1.nexusmods.com/110/mods/110/images/36047-3-1368821490.png[/img]\r<br />Control any creature and:\r<br />[list]\r<br />[*]Take control of nearly any animal and take them as far away as you like\r<br />[*]Most animals have a left, right, and special attack (activate button)\r<br />[*]Some animals (think Atronachs) can cast spells&#33;\r<br />[*]Revert from an animal at any time by pressing the shout button\r<br />[/list]\r<br />\r<br />Take control of any humanoid and gain access to their:\r<br />[list]\r<br />[*]Looks\r<br />[*]Skills\r<br />[*]Health/Stamina/Magicka\r<br />[*]Inventory\r<br />[*]Combat\r<br />[*]Crafting/ object interaction\r<br />[*]Basic factions (rub elbows with bandits, or vampires&#33;)\r<br />[*]Original player can acts as a follower, mill about, or disappear\r<br />[*]Return to original player at any time\r<br />[*]Dying as new actor results in death/load, or reverts to original player\r<br />[*]Save/load while playing another actor, then return to playing your original player later\r<br />[*]Literally play the game as that actor&#33;\r<br />[/list]\r<br />\r<br />Controlling an NPC allows you to affect them by:\r<br />[*]Leveling their skills\r<br />[*]Changing their gear\r<br />[*]Changing their face, hair, and hair color (10 NPC’s can be remembered)\r<br />\r<br />And more&#33;\r<br />[list]\r<br />[*]Many MCM configurable options\r<br />[*]360 Controller compatibility\r<br />[*]With the ghost option, dying as the main character turns you into a ghost, who must find a new main character before they can attack again&#33;\r<br />[*]Lore friendly version with new spells and spell tomes\r<br />[*][url=http://forums.nexusmods.com/index.php?showtopic=997441]Development Thread[/url] for authors to easily make AA quest mods\r<br />[*][u][b] [color=#5dffff]Most face changes to the NPC can be remembered to permanently change their looks&#33;[/u][/b]\r<br />[*]See the “Changes” tab for even more features, sorted by version.[/color] (It’s to the left of the description, files, and images tab).\r<br /> [/list]\r<br />\r<br />My walkthrough of 1.2 is coming soon.\r<br />My walkthrough of v1.1:\r<br />[youtube]8ZyAQcEfrHQ[/youtube]\r<br />Mod Reviews:\r<br />[youtube]cSY-83c1I8c[/youtube][youtube]GcXKfXQXcho[/youtube]\r<br />My walkthroughs of other versions can be found on the videos tab.\r<br />\r<br />Gem of the week on:\r<br />[url=http://www.skyrimgems.com/][img]http://static1.nexusmods.com/110/mods/110/images/15827-1-1369069574.png[/img][/url]\r<br />[img]http://static1.nexusmods.com/110/mods/110/images/36047-2-1370630619.png[/img]\r<br />YOU ARE A GOD&#33;&#33;&#33; I&#39;ve been wanting to do this for over a year&#33; This completely transforms how the game can be played. &#34;Alternate Actors&#34; is now featured on GEMS under category 410 - Roleplaying.  –Ka3m0n, Owner of Skyrim Gems Site\r<br />\r<br />Thank you&#33; Been waiting for something like this to give the experience of the rpgs where you can switch between characters. –Maymay1588, Author of hot file: Lilium Follower\r<br />\r<br />Is there anyway we could save edits we make to the character we control? … Been looking for a mod for a long time that can do that. (Now possible in 1.1) –Phenderix, Author of hot file: Phendrix Magic Evolved\r<br />\r<br />ha &#33; a new mod from you dude... another good one as usual –Psychosteve, creator of icons used in SkyUI\r<br />\r<br />Very few modders can make something as ambitious as this mod. Even fewer come back, fix almost every problem, and add in many requested features too an already outstanding mod. You good sir, have become one of my favorite modders on the Nexus. Great job my friend.  –Themusicman\r<br />\r<br />Lore Friendly version makes me a happy panda&#33; –Nudedragon\r<br />\r<br />Did anyone say the nexus needs a file of &#34;since forever&#34; vote buttom?  – Agunsthemagi\r<br />\r<br />mod of the year -Mclericp\r<br />\r<br />[img]http://static1.nexusmods.com/110/mods/110/images/36047-4-1368821490.png[/img]\r<br />Quests that utilize Alternate Actor functionality\r<br />Stability/compatibility – looking into custom race support, and racemenu / character editor mod compatibility \r<br />\r<br />If you&#39;d like to make a mod that uses Alternate Actors as a master file, check out the [url=http://forums.nexusmods.com/index.php?showtopic=997441]Development Thread[/url] to talk about the mod and how we can work together.\r<br />\r<br />[img]http://static1.nexusmods.com/110/mods/110/images/36047-1-1368821488.png [/img]\r<br />While this mod is fully playable, chances are you will run into limitations and bugs&#33; Please report these to me in the [url=http://forums.nexusmods.com/index.php?showtopic=997408]bugs / troubleshooting thread here&#33;[/url] Also, if you have ideas, suggestions, or would like to help me implement features/ contribute to the project, [url=http://forums.nexusmods.com/index.php?showtopic=997409]join the discussion here&#33;[/url] Thank you&#33;\r<br />\r<br />[img]http://static1.nexusmods.com/110/mods/110/images/36047-3-1370630619.png[/img]\r<br />[color=#5dffff]Make sure to update to 1.2 and have ALL requirements installed (and [u]up to date[/u]). If you’re updating from an earlier version, revert to your main character, save, turn the mod off, and save again. Then install the update. You may also need to save and reload once in order to access features like the MCM menu. (A quick save and quick reload will do). [/color]\r<br />\r<br />Q: Help, the game crashes when I use the full control spell&#33;\r<br />A: Make sure you’ve installed v1.2, [url=http://skse.silverlock.org/]Skyrim Script Extender[/url] and [url=http://skyrim.nexusmods.com/mods/28170/?]Better Messagebox Controls&#33;[/url]\r<br />\r<br />Q: My Npc’s face doesn’t look like it should&#33;\r<br />A: I’ve heard that loading [url=http://skyrim.nexusmods.com/mods/21488//?]Ultimate NPC Unlocker[/url] before AA may fix the problem (thanks Witcher5688&#33;)\r<br />\r<br />Q: My game is stuck on the loading screen&#33;\r<br />A: 1) Make sure you have the requirements from the question above. \r<br />2) Check the compatibility section below to see if you’re running a mod that is incompatible. \r<br />3) Try pressing your activate button or your sheathe/drop item button. \r<br />[color=#5dffff]4) Thanks to a report by o12t14a86, I was able to focus on controller compatibility for 1.2 Simply press X on the racemenu screen and the spell will finish itself. [/color] (For people still using 1.1, simply remove the controller usb during the loading screen and reinsert it after you’ve taken control. The screen should finish like normal.)\r<br />5) Are you using a non US keyboard? Some keyboards, such as AZERTY may not work and you may need to preform manual operations. There is an MCM menu option: debug mode, that hides the loadscreen so you can perform manual operations in 1.2.\r<br />6) In 1.2 and above, is the loading crystal frozen? It freezes at the beginning of the loading screen when controlling an actor of a different gender, but then should start moving again in roughly 5 seconds. If the crystal is moving, then chances are the loadscreen is working. If it’s frozen and both actors are the same gender, or it’s been 10+ seconds, try #3.\r<br />\r<br />Q: Can you make permanent changes to an NPC’s face?\r<br />A: You can currently remember the faces of 10 NPCs. Changes to an NPC’s nose, hair, eyes, mouth and hair color will all be remembered. In 1.2, adjusting the size of said features, or skin tone is now also remembered. That means that as of 1.2, everything is remembered except for textures, and possibly mod added headparts.\r<br />\r<br />Q: I can’t use furniture&#33;\r<br />A: Type “player.tai” into the console.\r<br />\r<br />Q: Help, I made an NPC ugly&#33; or: Help&#33; Something happened and now their head is gone&#33; Saving and reloading doesn’t fix it&#33;\r<br />A: Use MCM to forget their face. Then reload the game (exit to desktop) and they’ll be back to default\r<br />\r<br />Q: I can&#39;t find the spells&#33;\r<br />A: Do you have SkyUI installed? Did you save and reload? Are you looking in the right place? The spells are lesser powers.\r<br />Answers gleaned from the comments section:\r<br />In the MCM, toggle &#34;Lore Friendly&#34; Off and then back on. - WolfTheWerewolf\r<br />The spells are powers, so to use them you need to press the &#39;z&#39; key, or whatever button you have assigned to use powers - Goliatron\r<br />\r<br />Q: Everything is installed and up to date (including all required files), but I’m having a weird problem&#33;\r<br />A: It’s most likely a compatibility problem: AA is having an issue with one of your other mods. Try turning mods off one at a time (or all at the same time) and loading a save that didn’t use AA. When you turn off a mod and it works, you know which mod is incompatible (please let me know&#33;).\r<br />\r<br />[img] http://static1.nexusmods.com/110/mods/110/images/36047-1-1371129073.png[/img]\r<br />If none of these answers help you, than it’s possible that you’re having a bug that I can’t replicate. \r<br />\r<br />I have been away from modding for a year and at this point I no longer have time to do any serious modding. Over the year I&#39;ve been away I&#39;ve gotton TONS of pms either asking me to troubleshoot a mod for people, or a mod request. I simply don&#39;t have time to troubleshoot everyone&#39;s Skyrim. \r<br />[color=#5dffff]\r<br />AA is a script heavy, detailed mod that can easily be incompatible with other mods. If you really want to use AA and it&#39;s not working, you&#39;ll need to troubleshoot the mod. Make a new save with no mods installed beside AA and its requirements. This is the ONLY way to be sure no other mods are causing your issue. If the mod runs successfully on a new save, slowly install mods until it doesn&#39;t work. I usually install half of the uninstalled mods on my list and try. If it fails, I know one of the mods I just turned on is causing the issue, if not, I install the other half. I keep whiddling it down until I find the incompatible mod. Back in the day I checked and unchecked esps, but now with tools like mod organizer you can do this much more quickly and thoroughly. I used to spend literally hours troubleshooting mods I wanted to install; it&#39;s just a part of the mod experience, and it&#39;s too time consuming for me to do for others anymore, (in many cases I wouldn&#39;t even be able to without downloading your exact mod setup)))\r<br />[/color] \r<br />\r<br />\r<br />[img]http://static2.nexusmods.com/110/mods/110/images/36047-1-1368663290.png[/img]\r<br />If you think you can help me eliminate a limitation, please [url=http://forums.nexusmods.com/index.php?showtopic=997408]let me know here.[/url]\r<br />\r<br />Actors that you control may/will exhibit the following:\r<br />[list]\r<br />[*]Gray Face bug – nothing I can do\r<br />[*]Perks and overall level are retained across characters\r<br />[*]No change in crime, some specific / unique factions, and quests progress\r<br />[*]I can’t store or change NPC face tints/textures\r<br />[/list]\r<br />\r<br />[img] http://static1.nexusmods.com/110/mods/110/images/36047-1-1370630618.png [/img]\r<br />I’ve heard reports that this mod may be incompatible with [url= http://skyrim.nexusmods.com/mods/12798/?]Crimson Tide[/url]\r<br />Several people report that SkyRe’s combat.esp is incompatible with this mod\r<br />The main character may not follow people using UFO\r<br />You may not be able to edit the faces of NPC with custom face parts (like Vilja)\r<br />I’ve heard reports that this mod is incompatible with Racemenu and Enhanced Character Editor, though I wasn’t able to replicate any bugs, other than their features not being supported. \r<br />\r<br />[img]http://static2.nexusmods.com/110/mods/110/images/36047-2-1368821490.png[/img]\r<br />\r<br />First I want to thank the people who have made the Skyrim Script Extender. It&#39;s a wonderful tool that I love more practically every day.\r<br />\r<br />In one part of the script I&#39;ve taken inspiration from [url= http://skyrim.nexusmods.com/mods/13905/?]Korodic&#39;s Werewolf Aftermath mod[/url] and [url= http://skyrim.nexusmods.com/mods/34593/?]Deazurain&#39;s Loadout mod[/url]. In the script (whose source code is included in the download) I note the section I used from them, and will paraphrase that note here.\r<br />Both dudes understood how many slots there were (counted slot masks on the wiki) and understood how to multiply the hex code by two to get every combo of armor you could have and add it to a formlist. I didn&#39;t know how the hex code worked, or had the idea to do a formlist until I looked at their scripts, so I wanted to credit them. \r<br />However, I believe this inspiration is fair game/ is in the public domain, because two people did the same thing for two different mods, and my inspired section is as different from either of theirs as their script chunks are from one another.\r<br />\r<br />Update: Being the cool guy that he is, Korodic asked me to &#34;credit fg101 since it was he who developed the slot mask loop (which was brilliant).&#34; I gladly do so and thank Korodic again for letting me know. :D\r<br />\r<br />I also want to thank [url=http://skyrim.nexusmods.com/mods/29624/?]Expired&#39;s Racemenu mod[/url]. I found the getfacemorph function while looking at his script. Also, it was looking at his script alongside the Creation Kit that made me realize that face morphs are not 1 per headpart, but 2 or 3 (based on the actors tab Char Gen Morphs sliders).\r<br />\r<br />DarkWolfModding for telling me about Bandicam. :D\r<br />\r<br />The Nexus and Bethesda should also be credited, for allowing modders such cool opportunity to explore so many facets of game design and then share them with others… for free. :D\r<br />\r<br /> [img]http://static1.nexusmods.com/110/mods/110/images/36047-5-1368821490.png[/img]\r<br />\r<br />I do not post any mods on Steam Workshop. If you see one of my mods on Steam Workshop, please report the file to me. Thanks&#33; :D\r<br />\r<br />[center][url=http://www.facebook.com/IceburgModding][img]http://static1.nexusmods.com/110/mods/110/images/15827-1-1349192119.png[/img][/url][/center]\r<br />",
  "categoryId": "24",
  "version": "1.2",
  "author": "Iceburg",
  "createdUnix": "1368980777",
  "updatedUnix": "1372365950",
  "containsAdultContent": false,
  "uploadedBy": "iceburg",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030453",
      "name": "Alternate Actors 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27",
      "fileName": "Alternate Actors 1-0-36047-1-0.zip",
      "uploadedUnix": "1368917603",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b027a596b83b91bcffd4ceaaa8ec2cdae738fe17cdfb140d7680b1c9a214e107/analysis/1407574145/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Actors%201-0-36047-1-0.zip?fid=1000030453&ttl=1535814989&ri=8192&rs=8192&setec=2cf65d614de35ee0b1f33d67df13348d"
    },
    {
      "fileId": "1000032968",
      "name": "Alternate Actors 1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "62",
      "fileName": "Alternate Actors 1-1-36047-1-1.zip",
      "uploadedUnix": "1370475271",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e693fa7a9ceab7848818cd0a277d3ec8e88838502cde8996da7694b3d80e4fd4/analysis/1407593716/",
      "changelogHtml": " Spells now cast through voice slot, so items stay equipped <br/> \n Can Permanently change much of NPC&#39;s face <br/> \n MCM Menu Introduced <br/> \n Dragonborn follower is optional <br/> \n Dragonborn can interact with stuff around them (MCM option) <br/> \n Skin tone changes correctly when controlling an NPC <br/> \n Tattoos do not jump onto controlled NPC <br/> \n Lore Friendly spells added, have duration based on magicka and must be found as spell tomes <br/> \n Can remember 4 people and control them from anywhere <br/> \n Most controlled animals have left, right, and special (shout) attacks, unique to each animal <br/> \n Controlled animals can travel as far as they like (no range limit) <br/> \n Can revert from controlled animal to player at any time by pressing space <br/> \n Can revert from NPC to original player at any time by casting revert spell or using the MCM menu <br/> \n If using a lore spell, time until revert is shown in the MCM menu <br/> \n Can remember the faces of 10 NPCs. Remembered faces can be seen and deleted in the MCM menu. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Actors%201-1-36047-1-1.zip?fid=1000032968&ttl=1535814989&ri=8192&rs=8192&setec=717c3e3ea018f4eec2a59551dfefc02f"
    },
    {
      "fileId": "1000033065",
      "name": "Alternate Actors 1-1 -Masterfile",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Alternate Actors 1-1 -Masterfile-36047-1-1.zip",
      "uploadedUnix": "1370537222",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f6eef4803f5f4f370f591cc426642dff75b9b3b79b7470088b924369b48241e1/analysis/1407594305/",
      "changelogHtml": " Spells now cast through voice slot, so items stay equipped <br/> \n Can Permanently change much of NPC&#39;s face <br/> \n MCM Menu Introduced <br/> \n Dragonborn follower is optional <br/> \n Dragonborn can interact with stuff around them (MCM option) <br/> \n Skin tone changes correctly when controlling an NPC <br/> \n Tattoos do not jump onto controlled NPC <br/> \n Lore Friendly spells added, have duration based on magicka and must be found as spell tomes <br/> \n Can remember 4 people and control them from anywhere <br/> \n Most controlled animals have left, right, and special (shout) attacks, unique to each animal <br/> \n Controlled animals can travel as far as they like (no range limit) <br/> \n Can revert from controlled animal to player at any time by pressing space <br/> \n Can revert from NPC to original player at any time by casting revert spell or using the MCM menu <br/> \n If using a lore spell, time until revert is shown in the MCM menu <br/> \n Can remember the faces of 10 NPCs. Remembered faces can be seen and deleted in the MCM menu. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Actors%201-1%20-Masterfile-36047-1-1.zip?fid=1000033065&ttl=1535814990&ri=8192&rs=8192&setec=83aa2138888f9525f64a35878c6d38aa"
    },
    {
      "fileId": "1000034066",
      "name": "AA 1-1 Debug Script",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "AA 1-1 Debug Script-36047-1-1.zip",
      "uploadedUnix": "1371137590",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/359ed4b7a42364f2594e6f281366f70e595866adeaa6f8a60125b60d2d4a2404/analysis/1407602463/",
      "changelogHtml": " Spells now cast through voice slot, so items stay equipped <br/> \n Can Permanently change much of NPC&#39;s face <br/> \n MCM Menu Introduced <br/> \n Dragonborn follower is optional <br/> \n Dragonborn can interact with stuff around them (MCM option) <br/> \n Skin tone changes correctly when controlling an NPC <br/> \n Tattoos do not jump onto controlled NPC <br/> \n Lore Friendly spells added, have duration based on magicka and must be found as spell tomes <br/> \n Can remember 4 people and control them from anywhere <br/> \n Most controlled animals have left, right, and special (shout) attacks, unique to each animal <br/> \n Controlled animals can travel as far as they like (no range limit) <br/> \n Can revert from controlled animal to player at any time by pressing space <br/> \n Can revert from NPC to original player at any time by casting revert spell or using the MCM menu <br/> \n If using a lore spell, time until revert is shown in the MCM menu <br/> \n Can remember the faces of 10 NPCs. Remembered faces can be seen and deleted in the MCM menu. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AA%201-1%20Debug%20Script-36047-1-1.zip?fid=1000034066&ttl=1535814990&ri=8192&rs=8192&setec=017ee94ceaf3628dfd882382fc2ad1f3"
    },
    {
      "fileId": "1000036084",
      "name": "Alternate Actors 1-2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91",
      "fileName": "Alternate Actors 1-2-36047-1-2.zip",
      "uploadedUnix": "1372360243",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/4feb19a6a65ab5bfc9940ece4320f47f988136636fd9619436e5671370de62bc/analysis/1407619439/",
      "changelogHtml": " Controller compatibility –now works with 360 controllers&#33; <br/> \n Debug Mode  MCM Option – hide the loadscreen to help bugshoot <br/> \n New and improved loadscreen&#33; <br/> \n More Creatures – use control creature to control almost any creature in the game <br/> \n More Moves – most creatures have 3 attacks that correspond to right and left attack, and activate <br/> \n Creature Spells – Creatures like Atronachs and Dragonpriests have special moves that cast spells&#33; <br/> \n Revert from creature is now done by pressing the shout button, to make switching between characters more uniform <br/> \n Spells Renamed to be more descriptive (may have been in 1.1) <br/> \n Dragonborn interacts with world – can no longer turn off. <br/> \n Dying as an Alternate Actor reverts to main character <br/> \n Ghost MCM Options <br/> \n Ghost – Dying as your main character makes you a ghost <br/> \n Ghost- Ghosts’ cannot be damaged, or damage others <br/> \n Ghost- can control someone else, and then make them your main character <br/> \n Remember Face Spell – now allows you to set a new main character. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Actors%201-2-36047-1-2.zip?fid=1000036084&ttl=1535814991&ri=8192&rs=8192&setec=43c0360ccba930e4119254fd71add0ce"
    },
    {
      "fileId": "1000036094",
      "name": "Alternate Actors 1-2 -Masterfile",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "14",
      "fileName": "Alternate Actors 1-2 -Masterfile-36047-1-2.zip",
      "uploadedUnix": "1372365950",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/3e410a164a917004737c58384d57cb4dc8a2ff234137c3c94000fc476f703169/analysis/1407619515/",
      "changelogHtml": " Controller compatibility –now works with 360 controllers&#33; <br/> \n Debug Mode  MCM Option – hide the loadscreen to help bugshoot <br/> \n New and improved loadscreen&#33; <br/> \n More Creatures – use control creature to control almost any creature in the game <br/> \n More Moves – most creatures have 3 attacks that correspond to right and left attack, and activate <br/> \n Creature Spells – Creatures like Atronachs and Dragonpriests have special moves that cast spells&#33; <br/> \n Revert from creature is now done by pressing the shout button, to make switching between characters more uniform <br/> \n Spells Renamed to be more descriptive (may have been in 1.1) <br/> \n Dragonborn interacts with world – can no longer turn off. <br/> \n Dying as an Alternate Actor reverts to main character <br/> \n Ghost MCM Options <br/> \n Ghost – Dying as your main character makes you a ghost <br/> \n Ghost- Ghosts’ cannot be damaged, or damage others <br/> \n Ghost- can control someone else, and then make them your main character <br/> \n Remember Face Spell – now allows you to set a new main character. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Actors%201-2%20-Masterfile-36047-1-2.zip?fid=1000036094&ttl=1535814991&ri=8192&rs=8192&setec=3b6d8a4fd18b18dd7847897feda3bb13"
    }
  ]
}