{
  "modId": 3606.0,
  "modName": "Headgear with Circlets and Masks",
  "summary": "Wear headgear and circlets at the same time.",
  "descriptionHtml": "Why can\\'t you wear a circlet under your helmet, hood, or hat?  Does it hurt or something?\r\n\r\nThis mod removes the restriction of wearing a circlet from all unenchanted, player wearable headgear.  It\\'s based off of the Falmer Helmet glitch.  I\\'ve tried to include every unenchanted head piece I could find.  If you enchanted the headgear, it should work fine.  It\\'s only random Leveled items, and quest rewards that aren\\'t included (unless I\\'ve missed something).\r\n\r\nWorking Headgear: Hide Helmet, Leather Helmet, Iron Helmet, Steel Helmet, Steel Horned Helmet, Elven Helmet, Glass Helmet, Dwarven Helmet, Orcish Helmet, Ebony Helmet, Daedric Helmet, Dragonscale Helmet, Dragonplate Helmet, Worn Shrouded Cowl, Mage Hood (3), Apprentice Hood, Hooded Green Robes, Hooded Red Robes, Hooded Grey Robes, Hooded Brown Robes, Novice Hood, Adept Hood, Summerset Shadows Hood, Hooded Mages Robes (2), Hooded Blue Robes, Hooded Black Robes, Hooded Monk Robes, Elven Light Helmet, Eastmarch Guard Helmet, Solitude Guard\\'s Helmet, Wolf Helmet, Noster\\'s Helmet, Fur Helmet, Mourner\\'s Hat, Execution Hood (2), Leather Hood, Riften Guard\\'s Helmet, Pale Guard\\'s Helmet, Winterhold Guard\\'s Helmet, Hjaalmarch Guard\\'s Helmet, Falkreath Guard\\'s Helmet, Whiterun Guard\\'s Helmet, Markarth Guard\\'s Helmet, Redguard Hood, Forsworn Headdress, Fine Hat, Ancient Nord Helmet, Chef\\'s Hat, Stormcloak Helmet, Imperial Helmet (2), Psiijic Hood, Stormcloak Officer Helmet, Alik\\'r Hood, Blades Helmet, Hat (4), Cowl, Ragged Cap, Imperial Light Helmet, Steel Plate Helm, Linwe\\'s Hood, Nightingale Hood (3), Thieves Guild Hood (2), Cicero\\'s Hat, Guild Master\\'s Hood, Masque of Clavicus Vile, Shrouded Cowl, Shrouded Hood,\r\n\r\nAlso allows Dragon Masks with circlets.\r\n\r\nNote: I have tested all the pieces I have available in my current game, and will pick up every piece to test as I continue, but I cannot test every piece.  If you come across something on this list that doesn\\'t work let me know, and I will try to fix it as quickly as I can.\r\n\r\nAdding other headgear isn\\'t tough so let me know the ones I\\'ve missed.  I\\'m sure there\\'s plenty.  I will add at least some or most of the enchanted gear, but some of that I\\'ll wait for the CK.  I\\'ll start with the specific enchanted items, then work my way down in power through the generic enchants.\r\n\r\nHopefully, I can remove restrictions from other pieces of armor too.\r\n\r\nThis is a mod.  All these truths should be self evident.\r\n\r\n1\tThis file is not an official Bethesda file.  No official support is supplied.\r\n2\tNo warranty is supplied whatsoever.  Use all mods at your own risk.\r\n3\tAlways backup your save games before installing any mods.\r\n4\tNo mod is guaranteed to work with any other mod.  This includes official expansion packs.",
  "categoryId": "54",
  "version": "1.241",
  "author": "grimreefer24601",
  "createdUnix": "1323817193",
  "updatedUnix": "1325521925",
  "containsAdultContent": false,
  "uploadedBy": "grimreefer24601",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15975",
      "name": "Headgear with Circlets and Masks",
      "version": "1.241",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Headgear with Circlets and Masks-3606-1-241.zip",
      "uploadedUnix": "1325521925",
      "modVersion": "1.241",
      "virusScanUrl": "https://www.virustotal.com/file/d5327ab875f07880762630e49f08d4123466ad4e16ffccf40b40176547ef1cc5/analysis/1406577604/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Headgear%20with%20Circlets%20and%20Masks-3606-1-241.zip?fid=15975&ttl=1535758787&ri=8192&rs=8192&setec=3b2de28631f2bf838ed56f7c772b6d76"
    }
  ]
}