{
  "modId": 36076.0,
  "modName": "Arondil Thalmorised",
  "summary": "Changes the perverted Necromancer Altmer found at Yngvild into a Thalmor boos type guy",
  "descriptionHtml": "This simple mod turns the Altmer Necromancer pervert who likes to experiment and \\\"share a bed\\\" with the souls of captured females who come across the Yngvild Nordic Ruin found east of Dawnstar.\r\n\r\nI thought we needed more Thalmor individuals in game and I did this.\r\n\r\n* there is a stupid error which I cant seem to fix: the file is missing the FaceGen tint files as I cant seem to locate them in my folder despite him looking just fine in my game. I will fix it somehow. Stay tuned.\r\n\r\nThis also gives you another reason to kill this Necrophiliac High Elf by turning into a snobish, Talos hating Necrophiliac High Elf. \r\n\r\nIn keeping with lore friendliness, I also altered his diary entries also so explain why he was expelled from Dawnstar as well as the reasons behind experimenting with Necromancy.\r\n\r\nHe has an unique appearence and should be oh-so-more powerful compared with the Vanilla Arondil.\r\n\r\nOutside yngvild, you should find 2 dead Thalmor investigators with a note which has ordered them to investigate the Arondil and his disapearence (read his jornels to find out more)\r\n\r\nIm working on making more Thalmor Individuals, both custom and editing select few, just for the heck of it :3",
  "categoryId": "33",
  "version": "1",
  "author": "Beth",
  "createdUnix": "1368651330",
  "updatedUnix": "1368651322",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030033",
      "name": "Arondil Thalmorised",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Arondil Thalmorised-36076-1.rar",
      "uploadedUnix": "1368651322",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/485f0deeaf450857b8b1d1b1cf4625a3cb3d5a25d010496b1bfd0dbf7d62bde2/analysis/1407570793/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arondil%20Thalmorised-36076-1.rar?fid=1000030033&ttl=1535815053&ri=8192&rs=8192&setec=7b32878ff2b51a61ac24fb2edebe2ade"
    }
  ]
}