{
  "modId": 36097.0,
  "modName": "Wilbur The Brave",
  "summary": "Custom voiced undead follower, located near Falkreath.",
  "descriptionHtml": "A mishap with novice necromancers has turned a dying man into a walking skeleton. Adjusting to his new lot in life, Wilbur The Brave has traveled from place to place seeking some kind of purpose for a life he feels is now meaningless since he can no longer die.\r\n\r\nHe eventually makes his way to Skyrim and finds a home in a cave nearby Falkreath, where the Dragonborn later finds finds him. Upon learning of who the Dragonborn is, WIlbur offers his assistance to help slay dragons, or kill anyone for that matter. Something to give him purpose again.\r\n\r\n[b]In the mod:[/b]\r\n>One custom voiced Follower, with custom cloth/skin texture. Equipped with a shield, war axe, and can cast Oakflesh on himself. Wilbur The Brave - Southwest of Falkreath\r\n\r\n>Six extra followers, using vanilla voice types, located at various inns. Ember Pusher - Riften, Rikard - Windhelm, Giselle - Markarth, Rosalia - Solitude, Dargum - Dawnstar, Ma\\'Faaria - Whiterun\r\n\r\nIt\\'s recommended that you use the NMM to install/uninstall this mod. Otherwise, unzip the rar file, and drop the \\'Data\\' folder containing some scripts, textures, and audio into the Skyrim folder. \r\n\r\nWhen starting the game with the mod installed, you might not be able speak with Wilbur. If that is the case, make a quick save and reload before meeting him. He should be working properly now.\r\n\r\n[b]Is there any DLC required to play this mod?[/b]\r\n-No\r\n\r\n[b]Are any other mods required to use this follower?[/b]\r\n-No. I make no use out of anyone else\\'s mods. Please do not let my screen shots confuse you. How Wilbur and the extra followers look will be different depending on what you have installed.\r\n\r\n[b]Is Wilbur compatible with multiple follower mods of any kind?[/b]\r\n-I\\'ve experienced issues using Ultimate Follower Overhaul, as some commands just won\\'t work such as telling Wilbur to wait. However, I have had better results with Amazing Follower Tweaks, but I haven\\'t tested that one much.\r\n\r\n[b]Does Wilbur level with the player?[/b]\r\n-He starts off at level 5, and will level with the player up to level 81.",
  "categoryId": "66",
  "version": "1",
  "author": "Goufunaki",
  "createdUnix": "1368836976",
  "updatedUnix": "1368836935",
  "containsAdultContent": false,
  "uploadedBy": "Goufunaki",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030315",
      "name": "Wilbur The Brave",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33047",
      "fileName": "Wilbur The Brave-36097-1.rar",
      "uploadedUnix": "1368836935",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/88c798e7b9b5c248396f0a38d0f51c38d95ef6f99763dee142853379e093a82d/analysis/1407572990/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wilbur%20The%20Brave-36097-1.rar?fid=1000030315&ttl=1535815074&ri=8192&rs=8192&setec=ed412d4e2c941a42464445f880197259"
    }
  ]
}