{
  "modId": 36098.0,
  "modName": "Skyrim Treasures",
  "summary": "My upcoming Skyrim Mod spotlight reviews Nexus page.",
  "descriptionHtml": "Hey there Nexites! \r\n\r\nThis is the page where I\\'ll be posting all my new mod reviews when I actually start the series. Keep a look out, the first episode will air soon!\r\n\r\nA quick synopsis of what I want this show to be about is I noticed alot of the big name mod reviewers for Skyrim really only pick the most popular mods out there. I see that its nice to have a video to show me what I am about to download but what about the mods that really need the exposure, the mods that uploaded for the first time and are still unknown to the community? \r\n\r\nThat\\'s where I want to put my focus on, the unknown mods, mods that just came out, the ones no one knows about. Skyrim Treasures will be a show with one to two mods a week, I\\'ll feature what the mod is about, show some game play footage, and then give you my opinion on it so that maybe these new up and coming mod authors can make a name for themselves on the Nexus.\r\n\r\nThe show is currently in the development stage, I am assembling a crew of editors to help me with some of the actual footage itself. (If you or anyone you know is good at making video into\\'s and outro\\'s please send me a PM I would love to hear from you!) I also lack some of the equipment needed but that should not be a problem for much longer. So right now I am opening this page for ideas and input from you, the community. Please feel free to leave any ideas or thoughts you may have in the posts section and I\\'ll try and talk yo you all one on one. \r\n\r\nAlso if you have a mod you would like me to review in the future (My first episode is currently filled) PM me with a link to your mod page as well as a description of what you want the community to think about your mod and Ill work with that as best I can. \r\n\r\nI look forward to hearing from you all, see you in the first episode! ",
  "categoryId": "45",
  "version": "None",
  "author": "Mellophonist",
  "createdUnix": "1368686537",
  "updatedUnix": "1368686537",
  "containsAdultContent": false,
  "uploadedBy": "mellophonist",
  "primaryFile": null,
  "files": []
}