{
  "modId": 36109.0,
  "modName": "Fighting Mage Staff",
  "summary": "Ever wondered why a Mage has to pull out another weapon to fight instead of just clubbing their enemies with the perfectly good staff in their hands? Well, I have, it always bugged me, so I created this Mod so that you can use a Mage staff as a quarterstaff, block their attacks and beat your enemies senseless with it.",
  "descriptionHtml": "[font=Century Gothic][size=4][color=green][b][center]**** No Extra Content is required for this Mod ****[/center][/b][/color][/size]\r\n\r\n[size=2]Ever wondered why a Mage would be using a staff to cast spells but, when the enemy gets up close, they have to pull out another weapon instead of just clubbing them round the head with the perfectly good staff in their hands? Well, I have, it’s always bugged me, so I created this Mod so that you can use a Mage staff as a quarterstaff, block their attacks and beat your enemies senseless with it.\r\n\r\nWith this Mod installed, if you equip a Mage staff in your left hand, you’ll be able to use it as normal, but, if you equip it in your right hand, it will allow you to wield it as a fully functional two-handed melee weapon. Simply place the staff in your right hand and start thumping away! To switch back, unequip the fighting staff and then you can equip the Mage staff again in your left hand and start casting spells from it. Nice, simple, straightforward and without fuss or any extra content required to make it work.\r\n\r\nI’ve only added the fighting mage staff to the standard staves so not every staff will have the option, but, if there’s enough interest, I’ll consider extending it to other staves.[/size]\r\n\r\n\r\n[size=3][color=orange][u]Installation/Uninstallation[/u][/color][/size]\r\n[size=2]To install simply download and activate using NMM or download the file manually, unpack with 7-zip and drop the plugin & BSA into your Skyrim Data folder, then ensure that it is activated in your Data files.\r\n\r\nTo uninstall, simply use NMM to uninstall or delete the files from your Skyrim Data folder.[/size]\r\n\r\n\r\n[size=3][color=orange][u]Load Order[/u][/color][/size]\r\n[size=2] It’s best to load this Mod near the top of your load order, after all of the master files (.esm’s) and any Mods that say they have to be loaded at the top of your load order (such as the Unofficial patches). This should minimise any conflicts with other Mods and, if you do have any other Mods that modify the mage staves, the other Mods will take precedence and you won’t be able to fight with them. [/size]\r\n\r\n[size=3][color=orange][u]Final Comments[/u][/color][/size]\r\n[size=2]This Mod was a training exercise for a larger more complicated Mod but I thought it worked pretty well so I decided to share it. Let me know what you think in the comments section. Thanks to the Nexus community for the support and encouragement they provide and most especially to Eckss for his enthusiastic help and advice.[/size][/font]",
  "categoryId": "55",
  "version": "1",
  "author": "Nemesis The Warlock",
  "createdUnix": "1368712895",
  "updatedUnix": "1368712435",
  "containsAdultContent": false,
  "uploadedBy": "NemesisTheWarlock",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030123",
      "name": "Fighting Mage Staff",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "292",
      "fileName": "Fighting Mage Staff-36109-1.7z",
      "uploadedUnix": "1368712435",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9c71a10e6b27efb70d2f65e1f3b7880c2dab329dd3d4139424382ba906103b44/analysis/1407571513/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fighting%20Mage%20Staff-36109-1.7z?fid=1000030123&ttl=1535815090&ri=8192&rs=8192&setec=4d78b2d878eb6807886d4c47d8227c76"
    }
  ]
}