{
  "modId": 36105.0,
  "modName": "The Flooded City of Ankarth",
  "summary": "Enter a new world far away from Skyrim called Valesteria. Explore the world and discover the city on Ankarth and it\\'s residents that need your help. \r\n\r\nMod includes: \r\nNew world and interiors, quests and characters.",
  "descriptionHtml": "Enter a new world far away from Skyrim called Valesteria. Explore the world and discover the city of Ankarth and it\\'s residents that need your help. \r\n\r\nMod includes: \r\nNew world and interiors, quests and characters.\r\n\r\nInstructions:\r\n\r\n  1)  Download zip. Open \\\"HandIn\\\" folder and unzip all folders and files (screenshots not neccessary) into your Skyrim Data folder. For example: \\\"D:\\\\Steam\\\\SteamLibrary\\\\SteamApps\\\\common\\\\Skyrim\\\\Data\\\"\r\n\r\n  2)  Run Skyrim and select Data, select World2.esp from the list of mods. Run Skyrim.\r\n\r\n  3)  To activate the mod you need to create a new save. After saving go into the menu and load that save.\r\n\r\n  4)  The quest will begin when you speak to a man outside of Whiterun. He is placed just outside of the main gates of whiterun. Exit the city through the gate and turn right. He should be next to the archway/bridge.\r\n\r\n  5) The quest will be added to your log book so change the active quest to the new quest which will direct you where you need to be.\r\n\r\n  6) After completing the main quest you are free to explore the world, but you will need to coc to exit the world. Do this by entering \\\"coc whiterun\\\" into the console command for example.\r\n\r\nNote: The mod has a bug where the quest dialogue is skipped by too fast to read. Download the readme file to read the dialogue from a text file. ",
  "categoryId": "35",
  "version": "1.0",
  "author": "Dean Astley",
  "createdUnix": "1368710152",
  "updatedUnix": "1368709960",
  "containsAdultContent": false,
  "uploadedBy": "DeanAstley147",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030119",
      "name": "Ankarth ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10565",
      "fileName": "Ankarth -36105-1-0.zip",
      "uploadedUnix": "1368709960",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/965c9819acd0ca50e8c1ac0cb3f7f3dcaaaa6831e230f4b903a4238705f91ef5/analysis/1407571336/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ankarth%20-36105-1-0.zip?fid=1000030119&ttl=1535815086&ri=8192&rs=8192&setec=0ce7f6db750530f1d29edbb2dda2451a"
    }
  ]
}