{
  "modId": 36117.0,
  "modName": "Lakeview Manor Upgrades",
  "summary": "Neue Bauoptionen und Verbesserungen für das Haus Seeblick (Hearthfire). Wichtigste Änderungen: Grundstücksmauer; Wachen; Schmied. _________________________________________ \r\nNew buildoptions and improvements for Lakeview Manor (Hearthfire). Main changes: Wall; Guards; Blacksmith. ",
  "descriptionHtml": "------------------------------------------------------------------------------------------------------------------------------------------\r\n[color=lightblue][b][u]Beschreibung:[/u][/b][/color]\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\nDieses Plugin erweitert die Bauoptionen für das Haus Seeblick mit einer Grundstücksmauer. Kurze Zeit nach der Vollendung dieser Mauer, welche auch einen Wachturm umfasst, wird man die Möglichkeit zum Erwerb von bis zu drei Grundstückswachen bekommen, die dann auf den Mauern patroulieren. Desweiteren kann man den hauseigenen Vogt beauftragen, einen Schmied zu organisieren, der fortan diese abgelegene Siedlung mit allerlei Handelsgut versorgt.\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n[color=lightblue][b][u]Voraussetzungen / Requirements:[/u][/b][/color]\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n - Skyrim\r\n - Hearthfire\r\n\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n[color=lightblue][b][u]Anleitung:[/u][/b][/color]\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n- Das Plugin kann jederzeit und unabhängig vom Baufortschritt oder der Einrichtung des Hauses aktiviert werden. Auch die Bauform (Arten von Hausflügelerweiterungen) sollte keinen Einfluss haben.\r\n \r\n- Vorausgesetzt es wurde mindestens eines der Gebäude von Haus Seeblick fertiggestellt und man besitzt alle erforderlichen Baumaterialien, kann die Mauer direkt mit der Zimmererwerkbank gebaut werden. Die Bauoption „Grundstücksmauer“ befindet sich dann  in der gleichen Baurubrik wie der Garten oder der Stall.\r\n\r\n- Nach dem Bau sollte spätestens nach 24 Stunden In-Game-Zeit und evtl. ein paar Stadtbesuchen,\r\nein Bote einen Brief überbringen, in dem alles Nötige zum Erwerb der Wachen beschrieben ist \r\n(meistens erscheint der Bote aber schon, wenn man das Haus betritt und gleich wieder verlässt).\r\nOb und wie viele Wachen man erwerben möchte sollte man dann dem hauseigenen Vogt mitteilen (dem eigenen Vogt, nicht dem vom Jarl ;-) ).\r\n\r\n- Da die Wachen dem Spielerlevel angepasst sind, sollte das Anwesen immer ausreichend geschützt sein. Wenn man über genügend Wachpersonal verfügt (mindestens zwei), kann der Hauseigene Vogt auf Wunsch sogar dafür sorgen, dass überhaupt keine zufälligen Hausangriffe mehr z.B. durch Banditen, Wölfe oder Riesen stattfinden (Drachen können natürlich auch weiterhin wie überall in Skyrim zufällig auftauchen).\r\n\r\n- Optional kann man dem Vogt anweisen sich um verschiedene kleinere Veränderungen rund um das Anwesen zu kümmern, z.B. den Beschwöreraltal hinter dem Haus (richtung See) abzureißen, oder die Wege in der Nacht beleuchten zu lassen.\r\n\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n[color=lightblue][b][u]Allgemeine Hinweise (Themen, die schon häufig angesprochen wurden):[/u][/b][/color]\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n[b]1.) Bisher arbeite ich an keinem der beiden anderen Häuser von Hearthfire (Haus Windstad oder Haus Heljarchen) und ich befürchte, ich werde auch nicht dazukommen. Bitte dazu keine Anfragen mehr![/b]\r\nDie Quelltexte meiner Scripts liegen vollständig im BSA-Archiv bei und dürfen von jedem frei verwendet werden (z.B. um in einer eigenen Mod auch die beiden anderen Häuser mit neuen Bauoptionen zu versehen).\r\n\r\n2.) Um die schöne Landschaft um Haus Seeblick nicht zu sehr zu verbauen, habe ich auf sämtliche wuchtige Festungselemente verzichtet und die Mauer, so gut es mir möglich war, an die Beschaffenheit der Landschaft angepasst.\r\n\r\n3.) Bei den maximal drei patroulierenden Wachen habe ich mich, im Sinne der Spiellogik, an den anderen kleinen Siedlungen in Skyrim orientiert, welche üblicherweise zwei bis drei Wachen haben, allerdings keine Kaserne (24h Schichten). Der Wachturm und die Schichtablösungen sollten das Ganze lediglich ein wenig realistischer gestalten.\r\n\r\n4.) Die Wache, die gerade Ruhepause hat (ca. 8 Stunden täglich) wird sich meistens im Wachturm aufhalten und trägt dabei normale Kleidung.\r\n\r\n5.) Im Innenbereich von Haus Seeblick wurden bis auf die Atmospheredaten (etwas weniger Nebel/Dunst) keine Änderungen vorgenommen.\r\nDie Gegenstände und die Behälterinhalte innerhalb des Hauses bleiben unverändert.\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n[color=lightblue][b][u]Änderungen in Version 1.10[/u][/b][/color]\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n- Den Beschwöreraltar kann man jetzt abreißen lassen. Stattdessen entsteht dort ein Jägerlager.\r\n- Es ist jetzt möglich eine Weg- und Innenhofbeleuchtung aufstellen lassen.\r\n- Vom Spiel generierte zufällige Hausangriffe können jetzt auf Wunsch abgestellt werden.\r\n- Negative Bemerkungen des Spieler-Ehepartners bezüglich mangelnder Sicherheit für die Kinder in dieser Wildnis wurden durch geeignete positivere Bemerkungen ersetzt.\r\n- Wichtiges Bugfix: Die Mauer kann jetzt auch neu aufgebaut werden, wenn das Plugin deinstalliert wurde und zu einem späteren Zeitpunkt / Spielstand erneut installiert wurde.\r\n\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n[color=lightblue][b][u]Getestete kompatible Mods:[/u][/b][/color]\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n- Alle Mods die ausschließlich das Interior von Haus Seeblick verändern, müssten generell kompatibel sein.\r\n- Lakeview Manor Roads (Die Wachen bleiben manchmal an der Wegbegrenzung hängen)\r\n- Lakeview Manor Fish Hatchery (ist nur in der Basisversion ohne Mühle kompatibel)\r\n- Skyrim Flora Overhaul\r\n- Lush Trees and Grass (Bäume sind kompatibel - das optionale Gras verdeckt etwas die Zufahrt)\r\n- Tropical Skyrim (Wenn das Haus mit Schlafzimmeranbau gebaut ist, versperrt ein dicker Baum den Weg der Wache)\r\n\r\n[color=orange][b]\r\n_______________________________________________________English:_______________________________________________________\r\n[/color][/b]\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n[color=lightblue][b][u]Description:[/u][/b][/color]\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\nTired of your wife complaining about the wildlife and how irresponsible it is to raise a child in Falkreath Hold while it offers the most beautiful landscape of all Skyrim? Or maybe you’re agreeing with her but don’t know how to offer protection? Well, wait no longer!\r\n\r\nThis plugin offers additional (building) options for Lakeview Manor. Mainly you now are able to add a wall at the Carpenter’s Workbench (included with a smaller tower) to your estate if you already built at least the main building of the property. No more wolfs simply invading your territory! The wall itself was placed carefully and with landscape in mind, so that you don’t have the feeling of living in a heavy fortress. As soon as you built the wall, a courier (may also take a day or two) will reach you with a letter from the Jarl’s steward, which now allows you to add up to three guards to secure your land. Speak to your own steward to do the investment. The guards will patrol and work shifts. Because they are leveled according to you, they should be able to protect your house quite well.\r\n\r\nYour personal steward is also capable of handling different improvements to your house:\r\n\r\n  - The Conjurer’s Altar in the north at Lake Ilinalta can be destroyed and will be replaced with a camp with two hunters.\r\n  - A blacksmith can be hired to provide you and the inhabitants of Lakeview Manor with general goods.\r\n  - If you requested at least two guards you may disable the random house attacks (Dragons are still able to spawn).\r\n  - The streets around and the property itself can be lighted.\r\n\r\nAnd of course your wife will not be nagging anymore about your “place being unsafe”.\r\n\r\nAlso a small note about the interior: The “fog” (please refer to the pictures for the effect) has been weakened inside the house. The rest (furniture etc.) is left untouched. So this plugin should be fully compatible with others that remodel the interior.\r\n\r\nPlease note that there are no plans to extend the support to the other homes in Skyrim in the near future. However all sourcefiles are included in the download. Feel free to use them as you wish and maybe extend the support or building options.\r\n\r\n",
  "categoryId": "67",
  "version": "1.10",
  "author": "Emperor11",
  "createdUnix": "1368792282",
  "updatedUnix": "1372094484",
  "containsAdultContent": false,
  "uploadedBy": "emperor11",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030244",
      "name": "LakeviewManorUpgrades_V_1_00_DE",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "756",
      "fileName": "LakeviewManorUpgrades_V_1_00_German-36117-1-00.zip",
      "uploadedUnix": "1368790292",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/0b7cb5d14ed27b4464d83c2256551231c0a5477d576e22ca118b08a22960de4b/analysis/1407572464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LakeviewManorUpgrades_V_1_00_German-36117-1-00.zip?fid=1000030244&ttl=1535815099&ri=8192&rs=8192&setec=ff99f46befdf7675596b8ab1af0dbb08"
    },
    {
      "fileId": "1000030246",
      "name": "LakeviewManorUpgrades_V_1_00_EN",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "756",
      "fileName": "LakeviewManorUpgrades_1_00_EN-36117-1-00.zip",
      "uploadedUnix": "1368790442",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/16a94af3cf1dc7a134cd3360c95f71d3fb1a093cf19b6f0a4d12c80c5eb1095a/analysis/1407572466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LakeviewManorUpgrades_1_00_EN-36117-1-00.zip?fid=1000030246&ttl=1535815099&ri=8192&rs=8192&setec=48312a7a18349b1c8615698d27dc979d"
    },
    {
      "fileId": "1000030247",
      "name": "LakeviewManorUpgrades_V_1_10_DE",
      "version": "1.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "767",
      "fileName": "LakeviewManorUpgrades_V_1_10_DE-36117-1-10.zip",
      "uploadedUnix": "1368790602",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/c63c4f08f0a1fd9e9e8fdc37a46749d5d7f4bce555a9ca238f2ad314c6b43275/analysis/1407572469/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LakeviewManorUpgrades_V_1_10_DE-36117-1-10.zip?fid=1000030247&ttl=1535815100&ri=8192&rs=8192&setec=0578e37e011b85674f68c5322d38910d"
    },
    {
      "fileId": "1000035604",
      "name": "LakeViewManorUpgrades_V_1_10_EN",
      "version": "1.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "767",
      "fileName": "LakeViewManorUpgrades_V_1_10_EN-36117-1-10.zip",
      "uploadedUnix": "1372094484",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/666255e8f1bc48b477dc5b1214990579552bd842bf5a0d41a2c0e17de1df2fb9/analysis/1407615326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LakeViewManorUpgrades_V_1_10_EN-36117-1-10.zip?fid=1000035604&ttl=1535815100&ri=8192&rs=8192&setec=c48d13f00f64e20b6691ffddb1a8d5bf"
    }
  ]
}