{
  "modId": 36128.0,
  "modName": "Dawnguard - Restoration Addendum",
  "summary": "Mod that extends spells for the Restoration school of magic.",
  "descriptionHtml": "[center][img]http://imageshack.us/a/img834/5748/dratitle.jpg[/img][/center]\r<br />[center][youtube]a21F70bB2pA[/youtube][/center]\r<br />\r<br />*Note: Dawnguard DLC required. \r<br />**Version 3.0 Released 10/06/14 \r<br />========================== \r<br />\r<br />Have you ever wanted to play a Restoration mage, but found it to be impossible? Have you had to resort to using Conjuration, Illusion, or even Destruction Magic in order to survive? Well this mod hopes to remedy that problem. \r<br />\r<br />Dawnguard was a great addition to the Elder Scrolls V: Skyrim, but one aspect of the DLC felt lacking and tacked on: the inclusion of offensive Restoration spells for the Dawnguard. By the time you are able to recruit Florentius into the Dawnguard, you would be around level 15 or so. By that time, any of the two restoration tomes he can sell you are essentially obsolete at that point. Sun Fire is fairly weak, Stendarr&#39;s Aura makes it so you HAVE to be close to enemies to make it useful (mages should never HAVE to be at the front lines) and Vampire&#39;s Bane just isn&#39;t powerful enough. Not only that, why use these at all when most Fire spells do the job more efficiently? \r<br />\r<br />That&#39;s the purpose of this mod: to make Restoration Mages viable without making them overpowered. You won&#39;t be able to tank anything using Restoration spells alone; you&#39;ll still need to use Alteration spells or armor if you want to survive. \r<br />\r<br />All new spells are available from Oran Durai, located in Riverwood. \r<br />==================================== \r<br />\r<br />Any feedback on how the spells work/cost is greatly appreciated&#33; \r<br />\r<br />--------------------------------------------------------- \r<br />[Restoration] \r<br />\r<br />Novice \r<br />------ \r<br />Mara&#39;s Love - Regain health for a time. \r<br />Enhance Vitality - Increase health by 25 points for a time. \r<br />Hunter&#39;s Reslove - Light Armor Skill is increased by 20 points for a time. \r<br />Warrior&#39;s Will - Heavy Armor Skill is increased by 20 points for a time. \r<br />Knight&#39;s Boon - For 60 seconds, One and Two-Handed weapons are 20% more powerful. \r<br />Archer&#39;s Favor - For 60 seconds, Bows are 20% more powerful. \r<br />Iron Strike - Smithing is increased by 20% for 60 seconds. \r<br />Nerve Pressure - Projectile damages target equal to 10% of their current health, but not undead, atronachs, or machines. \r<br />Weak Ailment - For 60 seconds, target&#39;s health is decreased by 25 points. \r<br />\r<br />Apprentice \r<br />---------- \r<br />Cure Disease - Cures all disease. \r<br />Inner Focus - Restoration spells are 25% more powerful for a time. \r<br />Armsman&#39;s Vigor - Touch skill makes target&#39;s One and Two-Handed Weapon skills 20% more powerful for 60 seconds. \r<br />Ranger&#39;s Gift - Touch skill makes target&#39;s Bow skill 20% more powerful for 60 seconds. \r<br />Enhance Other - Touch skill increases target&#39;s health by 50 points for 60 seconds. \r<br />\r<br />Adept \r<br />----- \r<br />Augment Vitality - Increase health by 50 points for a time. \r<br />Hunter&#39;s Defiance - Light Armor Skill is increased by 50 points for a time. \r<br />Warrior&#39;s Conviction - Heavy Armor Skill is increased by 50 points for a time. \r<br />Mara&#39;s Compassion - Everyone regains health for a time. \r<br />Knight&#39;s Devotion - For 60 seconds, One and Two-Handed weapons are 40% more powerful. \r<br />Archer&#39;s Dedication - For 60 seconds, Bows are 40% more powerful. \r<br />Steel Soul - Smithing is increased by 40% for 60 seconds. \r<br />Sunder Nerves - Divine light explosion; targets take damage equal to 25% of their current health, but not undead, atronachs, or machines. \r<br />Severe Ailment - For 60 seconds, target&#39;s health is decreased by 50 points. \r<br />\r<br />Expert \r<br />------ \r<br />Divine Focus - Restoration spells are 50% more powerful for a time. \r<br />Armsman&#39;s Zeal - Touch skill makes target&#39;s One and Two-Handed Weapon skills 40% more powerful for 60 seconds. \r<br />Ranger&#39;s Blessing - Touch skill makes target&#39;s Bow skill 40% more powerful for 60 seconds. \r<br />Augment Other - Touch skill increases target&#39;s health by 100 points for 60 seconds. \r<br />\r<br />\r<br />[Illusion] \r<br />\r<br />Novice \r<br />------ \r<br />Shadow Cloak - Become one with the shadows. Your sneaking is 20% more effective. \r<br />Light Touch - For 60 seconds, pickpocketing and lockpicking are 20% more effective. \r<br />\r<br />Apprentice \r<br />---------- \r<br />Silk Tongue - For 60 seconds, you haggle for 20% better prices. \r<br />Mind&#39;s Eye - For 60 seconds, Illusion spells last 25% longer. \r<br />\r<br />Adept \r<br />----- \r<br />Shadow Refuge - Become one with the shadows. Your sneaking is 40% more effective. \r<br />Deft Hands - FOr 60 seconds, pickpocketing and lockpicking 40% more effective. \r<br />\r<br />Expert \r<br />------ \r<br />Fade Other - Touch spell makes the target invisible for 30 seconds. Activating an object or attacking will break the spell. \r<br />Effortless Guile - For 60 seconds, you haggle for 40% better prices. \r<br />Illusionist&#39;s Finesse - For 60 seconds, Illusion spells last 50% longer. \r<br />\r<br />\r<br />[Alteration] \r<br />\r<br />Novice \r<br />------ \r<br />Aqualung - Can breath water for 30 seconds. \r<br />Sea Stride - Can walk on water for 60 seconds. \r<br />\r<br />Apprenctice \r<br />----------- \r<br />Shifting Will - Alteration spells last 20% longer for 60 seconds. \r<br />Ease Burden - Increase your carry weight by 50 points for 300 seconds. \r<br />Quick - For 30 seconds, you move and attack 25% faster. \r<br />Evenflow - Touch spell lets target walk on water for 60 seconds. \r<br />Warp - Teleport up to 75ft to target location. \r<br />\r<br />Adept \r<br />----- \r<br />Pack Mule - Increase your carry weight by 100 points for 250 seconds. \r<br />Water Walking - Can walk on water for 120 seconds. \r<br />\r<br />\r<br />Expert \r<br />------ \r<br />Bending Will - Alteration spells last 40% longer for 60 seconds. \r<br />Ox Strength - Increase your carry weight by 150 points for 200 seconds. \r<br />Haste - For 60 seconds, you move and attack 33% faster. \r<br />Buoyancy - Touch spell lets target walk on water for 120 seconds. \r<br />Teleport - Teleport up to 150ft to target location. \r<br />\r<br />========================== \r<br />\r<br />10/06/14 - Another overhaul of spells. No longer being sold by vanilla merchants, as it caused multiple copies of tomes to stack. Now all books are sold by Oran Durai, mage found in Riverwood. \r<br />\r<br />\r<br />10/15/13 - Complete overhaul of available spells as well as leveled lists, so there won&#39;t be any conflicts with other custom spell mods. All new spells now level up your Restoration skill and benefit from the appropriate Standing Stones and Rested Bonuses.",
  "categoryId": "75",
  "version": "v4.0",
  "author": "Durai",
  "createdUnix": "1368749667",
  "updatedUnix": "1412654562",
  "containsAdultContent": false,
  "uploadedBy": "Durai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000067301",
      "name": "Dawnguard - Restoration Addendum Paladin Support",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "9",
      "fileName": "Dawnguard - Restoration Addendum Paladin Support-36128-1-0.rar",
      "uploadedUnix": "1382057408",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/68a447c5a6cb9115b4c51a0037911f0a61a12742315302f8dfc93445d2b71380/analysis/1407759491/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnguard%20-%20Restoration%20Addendum%20Paladin%20Support-36128-1-0.rar?fid=1000067301&ttl=1535815121&ri=8192&rs=8192&setec=35dac0027a9d6f7343a35aa712420d5a"
    },
    {
      "fileId": "1000102636",
      "name": "Dawnguard - Restoration Addendum",
      "version": "3.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Dawnguard - Restoration Addendum-36128-3-3.rar",
      "uploadedUnix": "1395957094",
      "modVersion": "3.3",
      "virusScanUrl": "https://www.virustotal.com/file/074adfa2b1728b5c20ccc92e8dca3b83ea608a6d9c89fc8652b16774820d994d/analysis/1407997386/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnguard%20-%20Restoration%20Addendum-36128-3-3.rar?fid=1000102636&ttl=1535815121&ri=8192&rs=8192&setec=1faa131ed72b7136cf4cb2cf0cf700ec"
    },
    {
      "fileId": "1000129939",
      "name": "Dawnguard Restoration Addendum",
      "version": "v4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "86",
      "fileName": "Dawnguard Restoration Addendum-36128-v4-0.rar",
      "uploadedUnix": "1412654562",
      "modVersion": "v4.0",
      "virusScanUrl": "https://www.virustotal.com/file/7c72589955c1a96af50cab7e37e35d70000fb1417ba41f925416ca00bd10ef7a/analysis/1412654642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnguard%20Restoration%20Addendum-36128-v4-0.rar?fid=1000129939&ttl=1535815122&ri=8192&rs=8192&setec=e35fa6b0a723b27ce04d0d20addf8ec6"
    }
  ]
}