{
  "modId": 36186.0,
  "modName": "Light and Enhanced Targe of the Blooded",
  "summary": "Turns the Targe of the Blooded (unique shield) into light armor and adds the Spellbreaker enchantment to it, while keeping its bleeding effect on bashing enemies.",
  "descriptionHtml": "Hey there ! This is my first mod so nothing really fancy, but still an improvement of a badass shield i like.\r\n\r\nThis mod is for those who play light-armored characters and don\\'t find a light shield with a badass design. Therefore, the Targe of the Blooded is turned into Light Armor.\r\n\r\nIn addition, since at high levels the Targe\\'s \\\"emnchantment\\\" becomes quite useless, I have added the Spellbreaker enchantment to it to make it a little more powerful (its armor value is kinda weak too compared to the other shields a lvl 40/50-ish character could afford to get).\r\n\r\nThis mod is a standalone and shouldnt conflict with any other mod. If it does, please send me a message and I\\'ll get the problem fixed.\r\n\r\nWell, thanks for downloading, please endorse this if you liked this small mod. I may keep on modding if I have more ideas !\r\n\r\nPS : Being a native french speaker and a fluent spanish and english speaker, if you are looking out for mod translations, voice actors or whatever for a mod, please contact me.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Killcam",
  "createdUnix": "1368889165",
  "updatedUnix": "1368888757",
  "containsAdultContent": false,
  "uploadedBy": "Killcam",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030394",
      "name": "Light and Enhanced Targe of the Blooded",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Light and Enhanced Targe of the Blooded-36186-1-0.rar",
      "uploadedUnix": "1368888757",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d62cadad20e63edea65e39f2b80ece09c10cdfe8867807efe137014d263c167b/analysis/1407573508/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Light%20and%20Enhanced%20Targe%20of%20the%20Blooded-36186-1-0.rar?fid=1000030394&ttl=1535815231&ri=8192&rs=8192&setec=0a98fdeef5decddb0d58afca7f253830"
    }
  ]
}