{
  "modId": 36191.0,
  "modName": "Lakeview with Main Hall Library",
  "summary": "Remodels Lakeview Manor, removing clutter and replacing the upstairs master bedroom with a library.  Main Hall and Entryway only - the wings/basement are not effected.",
  "descriptionHtml": "I was disapointed that the Hearthfire houses forced me to choose between a library and an armory. So I broke out CK and did something about it. This is a remodle of Lakeview Manor\\'s Main Hall and Entryway: I made this mod for my own use, so it reflects my taste and needs. \r\n\r\nI converted the main upstairs bedroom (rendered useless by the bedroom wing) into a library. Besides the bookcases, the two wall shelves and the sideboard can also except books. There is also a comfortable writing table, a planter, and a mannequin (perfect for your mage robes). The bottom of the shelf in the back hallway is also converted to take books. Overall book capacity is slightly higher than the origional library. \r\n\r\nI added another mannequin to the upper balcony, and a safe next to the enchaning table for your soul gems. I placed a large trophy base and another planter in the Entryway. There is small trophy base in the dining area. \r\n\r\nThe display case by the alchemy station has been removed and replaced with two additional sachels and a large bowl with plantable soil. An additional planter in the upstairs second bedroom gives a grand total of 4 planters for decorative plants or most-used ingredients. \r\n\r\nIt always bothered me that the basement did not line up logically with the rest of the house, so I moved the trapdoor to the cellar under the stairs on the left. \r\n\r\nThe dagger display cases in the entryway and library (bedroom), as well as the large case between the mannequins,  has been equipped with triggers to properly hold weapons.  There are a few other small changes here and there. \r\n\r\nYou need Hearthfires DLC (obviously). I highly recommend the unlimited bookcase mod, though it is no longer required. You can get it here:\r\n \r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=13661 \r\n\r\nI have tried to make this mod compatible with Sherzie\\'s Lakeview House Kitchen mod (You can get it here: http://skyrim.nexusmods.com/mods/26016//?). If you don\\'t use that mod, you MUST build the backroom furnishings before enabling this mod, or you will end up with an empty back room. \r\n\r\nIf you have not yet built Lakeview Manor, you need to have the main hall and entryway completly built before installing this mod. All the furnishings and other items have been enabled, so you don\\'t have to build them too (except for the back room behind the fireplace - you will still need to build those if you want them). You just need the interior walls. \r\n\r\nIf you have already build the house and furnishings, you may find some of the old items clipping with the new. This is a save-game issue. You will need to use the console to \\\"clean up\\\". Just open the console, select the offending object, and type \\\"markfordelete\\\". The item will be gone the next time the cell loads. WARNING: Make sure you remove anything you don\\'t want to loose before installing. Just to be safe. This mod does not effect the basement, so it is safe for you to store your loot there. \r\n\r\nThis is my first mod, so I am still learning. Please let me know of any bugs, and I\\'ll try to fix them. \r\n\r\nNote that the mannequins in the pictures are not the mannequins you will get - I use female mannequins for Hearthfire mod. Without that mod, they will be plain wooden mannequins. \r\n\r\nPlease see my other Lakeview Manor mods:\r\n\r\nArmory redone http://skyrim.nexusmods.com/mods/36427/?\r\n\r\nIf you would like additional book storage without sacrificing the master bedroom, check out my Lakeview Storage Room conversion (Nexus version to be released soon): \r\n\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=148223818\r\n\r\nI plan on releasing mods for the Basement, Trophy room and exterior as I finish them.   \r\n\r\nAlso available on Steam: http://steamcommunity.com/sharedfiles/filedetails/?id=144823874",
  "categoryId": "67",
  "version": "1.2.1",
  "author": "jecoil",
  "createdUnix": "1368893436",
  "updatedUnix": "1372012465",
  "containsAdultContent": false,
  "uploadedBy": "jecoil",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032079",
      "name": "Lakeview remodeled",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "58",
      "fileName": "Lakeview remodeled-36191-1-2.zip",
      "uploadedUnix": "1369885970",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/ab8a89d7033cd70096bbe653a5d3c451bf81eebb1e7ce9bdd91b8c17aae0d838/analysis/1407586318/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20remodeled-36191-1-2.zip?fid=1000032079&ttl=1535815238&ri=8192&rs=8192&setec=ba41bebab79250a9900033569e164278"
    },
    {
      "fileId": "1000035492",
      "name": "lakeviewremod",
      "version": "1.2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "86",
      "fileName": "lakeviewremod-36191-1-2-1.zip",
      "uploadedUnix": "1372012465",
      "modVersion": "1.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/0a16fd5c155ea957de69a92a74c5157bed6ab20c6edfff6e6832b490f35da0dc/analysis/1407614346/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/lakeviewremod-36191-1-2-1.zip?fid=1000035492&ttl=1535815239&ri=8192&rs=8192&setec=11562a9f66693423dd3f4d8fdfd74ea2"
    }
  ]
}