{
  "modId": 36236.0,
  "modName": "Delay Dawnguard Start",
  "summary": "Have you ever played Skyrim with Dawnguard just for the mods that require it? Are you tired of vampires attacking the cities when you aren\\'t even playing the questline? If so, then this mod is for you! ",
  "descriptionHtml": "* I\\'ve temporarily removed the file due to trouble getting the Dawnguard quest to start when entering Dayspring Canyon\r\n\r\n\r\n\r\n\r\nUPDATES:\r\n\r\n1.3    Made needed edit that was skipped during cleanup\r\n1.2    Removed excess \\\"dirty\\\" edits, resulting in a smaller file size\r\n1.1    Fixed the problem with Durak constantly walking up and interrupting the player\r\n\r\n\r\n\r\n\r\nINTRODUCTION:\r\n\r\nHave you ever played Skyrim with Dawnguard just for the mods that require it? Are you tired of vampires attacking the cities when you aren\\'t even playing the questline? If so, then this mod is for you! \r\n\r\n\r\n\r\n\r\nFUNCTION:\r\n\r\nWhat this mod does is delay the beginning of the Dawnguard questline and random vampire encounters/attacks until after the main questline is finished. Now you may ask: \\\"but what if I want to play the DLC with one of my characters before finishing the main story?!?\\\". Don\\'t worry! All you have to do to bypass this is go to Dayspring Canyon and start the quest manually like you would if you were below level 10 - this will start the storyline and the random encounters as normal.\r\n\r\nAnother question you may have is: \\\"Why did you delay Dawnguard to after the main storyline?\\\" Well, personally I\\'ve always felt that the DLC was inherently meant to be played after the main questline, especially with the overlap that pretty much requires you to play through 80% of the main quest just to continue through Dawnguard. I also find it fairly annoying to have to deal with all of the attacks until you finish the DLC. That being said, there are also a lot of popular mods that require Dawnguard to work, so this will allow you to use those files without worrying about the storyline. If there are any errors please let me know immediately and I will see what I can do.\r\n\r\n\r\n\r\n\r\nREQUIREMENTS:\r\n\r\nThe Elder Scrolls V: Skyrim\r\nDawnguard\r\nThe last patch update by Bethesda\r\n\r\n\r\n\r\n\r\nCOMPATIBILITY:\r\nIf you are using the Dawnguard version of \\\"The Choice is Yours\\\", you will want to put this mod after it if you don\\'t want to hear the guards or Durak talk about the Dawnguard. Otherwise, you will go with his iteration of delaying the game. The vampire attacks will be delayed the same way in both cases\r\n\r\n\r\n\r\n\r\nINSTALLATION:\r\n\r\nSimply download with Nexus Mod Manager or extract the file into the Skyrim data folder\r\n\r\nPlease keep in mind that if you already have the marker to go to Dayspring canyon then this mod will not disable the quest, but the random encounters should be stopped until you meet Isran\r\n\r\n\r\nUNINSTALLATION:\r\n\r\nSimply disable the mod in NMM and the quests will automatically begin if you are over level 10\r\n\r\n\r\n\r\n\r\nSOME MODS YOU MAY LIKE:\r\n\r\nThieves Guild Requirements - No Auto Quest Start Brynjolf: http://skyrim.nexusmods.com/mods/14157/?\r\n       NOTE - I did not copy this mod. I came up with the idea for my mod before finding this, but was overjoyed to see that someone had a similar idea \r\n\r\nWhen Vampires Attack: http://skyrim.nexusmods.com/mods/28235//?\r\n\r\nRun for Your Lives: http://skyrim.nexusmods.com/mods/23906//?\r\n\r\nAuriel\\'s Holy Bow: http://skyrim.nexusmods.com/mods/35912/?\r\n       Please visit this guy\\'s mod. It\\'s fairly new, but really awesome and could use some more views\r\n\r\nAetherium Armor and Weapons Compilation: http://skyrim.nexusmods.com/mods/23530//?\r\n\r\nAetherial Bow and Arrows: http://skyrim.nexusmods.com/mods/23802//?\r\n",
  "categoryId": "35",
  "version": "1.3",
  "author": "Mnemonic Monkeys",
  "createdUnix": "1369011632",
  "updatedUnix": "1369011632",
  "containsAdultContent": false,
  "uploadedBy": "levib12",
  "primaryFile": null,
  "files": []
}