{
  "modId": 36244.0,
  "modName": "A Moonlit Night Alpha",
  "summary": "A mysterious Khajiit has appeared inRiverwood in the Sleeping Giant Inn. Who could she be? What could she be looking for in Skyrim? And what sort of dark past is she hiding from? or chasing after?",
  "descriptionHtml": "This mod still is in [u]Alpha[/u] stages. I am still looking for voices, and people to help work on the technical parts (follower quest stages, dialogue, etc.,) to go with the follower. It\\'s completely downloadable, and shouldn\\'t screw around with anything.\r\n\r\nTo those who are having issues, I checked through a few things and found no problem(I use vanilla when Skyrim when i\\'m modding). If you\\'re using Mods some mods conflict; let me know which ones may conflict with my mod, I try to fix the problem as best I can.\r\n\r\nThe second alpha i\\'ll release is coming soon!\r\n[youtube]4gJ6QHOhvHU[/youtube]\r\n\r\nAnyone interested can PM me through the Nexus Forums or my personal e-mail ([color=red]Thadd20@hotmail.com[/color]). If you\\'re a capable modder yourself, I\\'d love to have a hand helping me with this to speed up the process. If you send a message to my e-mail be sure to make it clear you\\'re messaging for helping the mod.\r\n\r\n[u][b]Description[/b][/u]\r\n[color=Crimson]Jhazii\\'ka[/color] is the name of the Khajiit vampire follower I\\'m currently creating. I was kind of disappointed with the lack of beast race followers in Skyrim (or follower who aren\\'t elves and human) -excluding Derkeethus- and even more surprised to see that very few share my lament on the nexus. There\\'s barely any beast followers, and the ones that are here are just generic Npcs with random appearances. That\\'s cool and all but where\\'s the meat? the true personality? I don\\'t want a follower to stand there and just look pretty; I want them to interact, talk, cry, get excited, make me hate them, something! A follower mod with something to add like those of Vilja, Hoth, and Atvir Dres.\r\n\r\nSo, I took it upon myself to start making a beast follower that would be fully-voiced, have her own story, and -hopefully- react to the world around her.\r\n\r\nToo long/didn\\'t read: I\\'m making a custom-voiced Female Khajiit Vampire follower with her own story.\r\n\r\nShe already has the follower dialogue so she\\'s ready to go and join you on your adventures for the time being; though she still needs tweaking and her own actress. She has my voice right since I was testing how to work the voice files, and boy does it sound awkward (trust me, you\\'ll get a good laugh at my failed attempt at being an audible Khajiit female).\r\n\r\nIf you can get past that, then enjoy. If you think you can voice for a Khajiit Female, then [u][color=red]PM[/color][/u] me your rendition of lines from her mod. You can access them by opening the CK and setting the mod as active to see, or message me for a copy of the manuscript I\\'m working on. No, I won\\'t give rights to my scripts away for use, sorry. I\\'ll be updating this mod as I go so it\\'s a Work-In-Progress.\r\n\r\n\r\n[u][font=36]Compatibility[/font][/u](so far)\r\nRequires\r\n[color=goldenrod]Dawnguard[/color]\r\nSkyrim 1.8+\r\n\r\n[u]Installation[/u]\r\nDoesn\\'t have any specific load order and shouldn\\'t affect any other mods; Strictly vanilla as of now.\r\nIf you have [color=red]Vampiric Thirst[/color], she will -like any other Vampire- burn up in sunlight. I\\'ve set her to essential for now, but she can still bleed out.\r\nShe doesn\\'t use CBBE or any type of body altering mod, so you should be cool for whatever you use.\r\n\r\nAnymore questions you all have, just write it in the comments.",
  "categoryId": "66",
  "version": "3.6",
  "author": "Manjarowolf",
  "createdUnix": "1369040309",
  "updatedUnix": "1369034205",
  "containsAdultContent": false,
  "uploadedBy": "Manjarowolf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030638",
      "name": "A_Moonlit_Night_Alpha_3_6",
      "version": "3.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15939",
      "fileName": "A_Moonlit_Night_Alpha_3_6-36244-3-6.rar",
      "uploadedUnix": "1369034205",
      "modVersion": "3.6",
      "virusScanUrl": "https://www.virustotal.com/file/22787bb3e3c91b4bf171baad70d93a6d7862464e6e88b5f3a319bc7fc7ceb2c8/analysis/1407575659/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A_Moonlit_Night_Alpha_3_6-36244-3-6.rar?fid=1000030638&ttl=1535815324&ri=8192&rs=8192&setec=642c3b88d4ea19a1321f70758a151972"
    }
  ]
}