{
  "modId": 36250.0,
  "modName": "More Inns and Taverns",
  "summary": "This is the More Taverns and Inns mod for skyrim. it adds more Taverns/Inns to the game and is very handy if you are roaming through the world of skyrim.",
  "descriptionHtml": "This mod adds more Taverns and Inns to the world of skyrim. this mod has been on the page 3 of the most popular mods on the steam workshop and is created by me (dav1dar1). you can choose which tavern you wish to add to your game. for now only 1 tavern will be added to the game. this mod will become very handy if you use the: Realistic Needs and Diseases Mod. Enjoy!! (p.s: i had some mods still activated. the: \\\"i would like some water\\\" and \\\"i would like to perform here\\\" option aren\\'t in this mod srry for any misunderstandings)\r\n\r\nIMPORTANT: i know already that you want more taverns, even though i uploaded it on 12:13 5-20-2013.\r\nbut i will be working a lot on the taverns. although i still have school to work on. and i am working as hard as i can to make it this year. so i hope you guys understand that i will work on the taverns if i have spare time. and thank you for the nice comments you have been sending the past 2 hours. this is Davidari. Enjoy the mod!",
  "categoryId": "22",
  "version": "1.0.0",
  "author": "Dav1dar1",
  "createdUnix": "1369051105",
  "updatedUnix": "1369050477",
  "containsAdultContent": false,
  "uploadedBy": "davidari",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030661",
      "name": "The More Taverns and Inns Mod",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "61",
      "fileName": "The More Taverns and Inns Mod-36250-1-0-0.rar",
      "uploadedUnix": "1369050477",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/a29d38082adf7050589ed1bdf3882c2e871c84945fa3b968a4bb260a89106694/analysis/1407575846/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20More%20Taverns%20and%20Inns%20Mod-36250-1-0-0.rar?fid=1000030661&ttl=1535815335&ri=8192&rs=8192&setec=b5e699b673f52b5c90ac43972d8002d4"
    }
  ]
}