{
  "modId": 36262.0,
  "modName": "The Giant Slayer Pack Playable Giant Clubs and More",
  "summary": "ATTENTION\r\nFor now the mod is only available on Steam. I plan to upload to Nexus at a later date. If you would like this mod go to Steam and search: \\\"giant slayer\\\" in most popular. The title will be The Giant Slayer Pack. I\\'m sorry for this inconveinence.",
  "descriptionHtml": "\r\nATTENTION\r\nFor now the mod is only available on Steam. I plan to upload to Nexus at a later date. If you would like this mod go to Steam and search: \\\"giant slayer\\\" in most popular. The title will be The Giant Slayer Pack. I\\'m sorry for this inconveinence.\r\n\r\n*NEW* Added two new giants to the game: A friendly Skeleton Giant and an enemy Skeleton Giant. Both can be found in Whiterun. \r\nThis is a basic mod that I made. It enable the player to use GIANT CLUBS! It also adds an awesome preset to the Nord Class that makes your character look pretty bada$$. It also adds an NPC named: The Giant Slayer. The Giant Slayer may be found in Whiterun at random times of the day. You can make him a follower by using a create a follower mod. I use AFT (Amazing Follower Tweaks) and it works wonderfully. Have Fun and Be Safe! \r\n\r\n1. Playable and Craftable Giant Clubs. \r\nAdds three playable clubs. \r\n-A \\\"normal\\\" Giant Club that actual Giants use. Can be found on Giants. \r\n- And A \\\"Strong\\\" Club that is WAY too high powered. The Strong one can be found in the Jorrvaskr (Companions HQ) and Warmaiden\\'s. \r\nBoth of these clubs can be equipped by any human NPC including followers. They both behave like a typical two-handed weapon. \r\n-A one-handed Giant Club. Basically behaves the same way but allows you to DUAL WIELD Giant Clubs! \r\nGiants may now be a lot harder to kill because I increased the stats on the \\\"Normal\\\" club. \r\nTo Craft you need the Dragon SmithingPerk, but for easy acess I made it availabe in the Iron Smithing. \r\nIt requires: Dragon Bones, Leather and Leather Strips. \r\n\r\n2. Nord Preset \r\nI just changed the appearance of Nord Preset 1 to make him look like the guy in the picture above. \r\n*Sky Apachii Hair is recommended but not required. \r\n\r\n3. The Giant Slayer NPC \r\nThis is an NPC I created. He will look like the Preset described above but he will be taller, and will be wearing an executioner\\'s oufit. He should be bearing a Giant\\'s Club also. He may appear randomly in Whiterun or you can find him by using the command in the console. Just type: help slayer and then type player.placeatme \\\"code for giantslayer\\\". If you do choose to use him as a follower his stats are: Level 81, 100 one-hand, 100 two-hand, and 1430 health. He is pretty high powered but CAN BE KILLED by giants and other high powered stuff. \r\n\r\nWell that\\'s about it. Have fun slaying Giants! \r\n\r\nPlease feel free to leave any suggestions or comments. Please report any bugs. If you like my mod don\\'t forget to rate! \r\n\r\n*NEW* \r\nUpdate 1 \r\n-Made Giants larger and more intimidating. \r\nUpdate 2 \r\n- Made Giant Clubs Craftable \r\n- Added Clubs to Whiterun \r\n- Added Clubs to Warmaiden\\'s \r\n-Added New One Handed Club \r\nUpdate 3 \r\n-SKELETON GIANTS! ",
  "categoryId": "55",
  "version": "V.3",
  "author": "CadeWalnut",
  "createdUnix": "1369088937",
  "updatedUnix": "1369088937",
  "containsAdultContent": false,
  "uploadedBy": "cadewalnut",
  "primaryFile": null,
  "files": []
}