{
  "modId": 36278.0,
  "modName": "No Opposite Sex",
  "summary": "Disallows marrying NPCs who are of your the opposite gender.",
  "descriptionHtml": "[size=4]This has gotten so many hits in such a short amount of time that I tough maybe I\\'d shamelessly promote [url=http://skyrim.nexusmods.com/mods/26558/]my other mod[/url]. This one is actually serious and has nothing to do with any topics that may spark controversy ;). Thanks! :)[/size]\r\n\r\n[color=#FF0000]Update: Wow so before I got to read a single comment, the thread got locked up... \r\nAnd I agree, it got extremely rude. Mean thing were said, both by homophobics and by homo/bi sexuals.\r\nI want to clear a few things up: \r\nFirst of all, no I\\'m not gay or bisexual.\r\nThis mod was not intended to \\\"get back\\\" at the No Same Sex mod or as a \\\"social crusade\\\". And I did not release it because the original mod offended me.\r\nThe Aela thing was kind of a joke(not her being lesbian, but the whole comment). People got into very heated discussions about, jeez guys...\r\n\\\"No heterophobic comments\\\" was a joke as well; a really bad one I might add.\r\nSome people said the description was offensive against homophobics and others said it was offensive against homosexuals. Neither of those was my intention, especially the latter. What I meant to say to homophobics was: you don\\'t like it? Then don\\'t mind it. If I don\\'t like an armor mod at all I\\'ll just ignore it and look for one that suits my tastes, and that\\'s what people who don\\'t like this mod should do.\r\nLast but certainly not least: this mod is not supposed to be taken seriously (it\\'s in no way a joke either) it\\'s just meant as another option and, after all, isn\\'t that what modding is about? Also, I agree with people who said this mod is pretty much useless since it doesn\\'t really add anything to the game, because it doesn\\'t. However, if you read the whole description you\\'ll see I\\'m working on a \\\"real\\\" mod.\r\n\r\nAs a final note: I will NOT be removing this mod, any part of the description or any comments(unless a moderator asks me to) because I\\'m not violating any rules.\r\n\r\nI\\'ll leave you with my favorite comment (I don\\'t know if it was meant as a joke or he was just being rude but I choose to believe the former):\r\n\r\n\\\"Now this is a really gay mod\\\"\r\n[/color]\r\n\r\nSo I saw the [url=http://skyrim.nexusmods.com/mods/36271]No Same Sex Mod[/url] and, in the spirit of equal love, I decided to make this.\r\n\r\nVery simple just plug and play. I\\'ve never actually married in Skyrim and I don\\'t really have time to test it so please report any bugs.\r\n\r\nIf you\\'re offended by this mod you should just walk away right now.\r\nNo heterophobic comments please!!\r\n\r\nOn a more serious note: I actually found the concept interesting and I\\'m working on a mod that will give each marriable NPC their own sexual preferences. Suggestions (should Aela be lesbian?) welcome!!",
  "categoryId": "24",
  "version": "1.0",
  "author": "eclips3",
  "createdUnix": "1369120851",
  "updatedUnix": "1369120609",
  "containsAdultContent": false,
  "uploadedBy": "eclips3d",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030780",
      "name": "No Opposite Sex 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "No Opposite Sex 1_0-36278-1-0.7z",
      "uploadedUnix": "1369120609",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/282d3923b4e852ed3a585510fdce6f9549c7a16973e5cc6e1cc3b18bff05237f/analysis/1407576723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Opposite%20Sex%201_0-36278-1-0.7z?fid=1000030780&ttl=1535815373&ri=8192&rs=8192&setec=0a06813eee996eaf8ae23b46c89efb3f"
    }
  ]
}