{
  "modId": 36317.0,
  "modName": "The Lost Wonders of Mzark",
  "summary": "An enormous dwemer-based quest mod, adding four new quests, one massive open-ended dungeon, and new weapons and armor&#33;",
  "descriptionHtml": "[img]http://i.imgur.com/YpznIdo.png[/img]\r<br />\r<br />REQUIRES DRAGONBORN.\r<br />\r<br />[youtube]34HRjqQzP7Y[/youtube]\r<br />\r<br />Thanks MxR&#33;                                                                   Thanks Brodual&#33;                                      Thanks Gamestop&#33;\r<br />[youtube]KyYRUiYZWKc[/youtube]                                [youtube]naKO17cO5z8[/youtube]        [youtube]mcB8euTGz3g[/youtube]  \r<br />\r<br />\r<br />[img]http://i.imgur.com/8qMFwQ1.png[/img]\r<br />In the docks of the northern oceans, sailors whisper tales of an ancient ruin, one unlike any other. A strange dwemer machine, that sits far out in the ocean, overlooking the far shores of Skyrim. And while the sailors tell these tales, history tells another. Deep within that ruin lies the last endeavors of the great lord of Blackreach. It says that Mzark, ruler of everything under Skyrim&#39;s mountains, left behind wonders untouched for thousands of years, watched over by a group of strange sentient machines, who even now seek a worthy adventure to help them fulfill their purpose, and claim the lost wonders of Mzark&#33;\r<br /> \r<br />Lost Wonders of Mzark is a quest/dungeon mod for those who prefer a more puzzle-oriented game. The enemies you encounter within must be disposed of in careful ways, and you&#39;ll find more than just fights awaiting you in the depths of Mzarnumez. You might think of it like Dead Money, but for Skyrim.\r<br /> \r<br />Features:\r<br />-4 new quests that span several hours of gameplay, all fully voiced and scripted, and based around puzzles and hidden items.\r<br />-An enormous new non-linear dungeon, Mzarnumez, filled with wonderous dwemer contraptions. Huge foundries and robots, mineshafts, submarine bays, and vaults await within Mzark&#39;s greatest creation.\r<br />-New enemies to fight, from the invincible holograms, dwemer bots, and more&#33; As well as mini-bosses and puzzle-bosses galore.\r<br />-New weapons and spells, explode your enemies with holostaves, project holograms to fight for you, or cause a massive amount of leeks to appear in front of you, if you&#39;re into that.\r<br />-A special artifact, not seen since Arena, which will let you unlock the secrets of the dwemer.\r<br />-3 new armored robe sets, all geared towards magically oriented characters\r<br /> \r<br />To start the quests, head to the far ocean, to Mzarnumez (which is marked on your map) and press the button inside.\r<br />\r<br /> [img]http://i.imgur.com/bw5TgNW.png[/img]\r<br />Just plop it into your Skyrim data folder and activate the esp.\r<br />\r<br />Changelog\r<br />1.3\r<br />-Combined all the files into one\r<br />\r<br />1.1\r<br />-fixes a few clipping issues\r<br />-replaces a few water bottles with water coolers, to prevent the holograms from knocking them about\r<br />-makes a certain key larger, gives it a light, and adds a congratulatory note when the player finds said key\r<br />-does not make holograms less green\r<br />\r<br />1.01\r<br />-fixes coins for those who had them bugged\r<br />-fixes a few spelling errors\r<br />-doesn&#39;t make it easier to solve the puzzles.\r<br />\r<br />1.0\r<br />-Initial Release\r<br />\r<br />\r<br />Conflicts and Tips:\r<br />-The mod will only conflict with anything that changes the far northern ocean (north of the Wreck of the Brinehammer), most other things should be fine.\r<br />-The hologram characters will automatically greet you the first time you meet. Don&#39;t exit their conversations prematurely, or they might not work.\r<br />-This mod WILL be difficult. The enemies within have special ways of being defeated, but are often difficult to defeat regardless. It is recommended you be above level 25 before trying the mod, and also pay attention to the notes and your surroundings.\r<br />-Some areas (such as the Foundry) might slow down older systems at parts, due to their graphic intensity.\r<br />-The two knowledge cube recipes are not a bug, each recipe takes a different type of ruined book.\r<br /> \r<br />[img]http://i.imgur.com/9tzrpc6.png[/img]\r<br />To Gilboron, for the voice of Mz.\r<br />To Stupid-Pants for the voice of Ar.\r<br />To Mojirio, for the voice of Ka.\r<br />To Deodorhan, for the dwemer textures.\r<br />To Rafuel, for the robe textures.\r<br />To lautasantenni and MrMino,for inspiration and resources for parts of the armors\r<br />To InsanitySorrow and Haishao, for the dwemer coins.\r<br />Lost Wonders of Mzark is a quest/dungeon mod for those who prefer a more puzzle-oriented game. The enemies you encounter within must be disposed of in careful ways, and you&#39;ll find more than just fights awaiting you in the depths of Mzarnumez. You might think of it like Dead Money, but for Skyrim.",
  "categoryId": "88",
  "version": "1.3",
  "author": "Guardly and MrCasual",
  "createdUnix": "1369263745",
  "updatedUnix": "1377836401",
  "containsAdultContent": false,
  "uploadedBy": "Guardly",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000050739",
      "name": "The Lost Wonders of Mzark",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "64688",
      "fileName": "The Lost Wonders of Mzark-36317-1-3.rar",
      "uploadedUnix": "1377836401",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/27eabef835427757d3e33f25e8598f7896a84bd85aa8f8814ac8135f1f3089b7/analysis/1407701887/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Lost%20Wonders%20of%20Mzark-36317-1-3.rar?fid=1000050739&ttl=1535815433&ri=8192&rs=8192&setec=c2149b262c90cc6695e40d2a6569112c"
    }
  ]
}