{
  "modId": 36325.0,
  "modName": "Road to Winstad Manor",
  "summary": "Spanning over 31 cells a road going into Winstad Manor, plus 14 unique NPC\\'s, 7 of which are followers/spouse potential",
  "descriptionHtml": "\r\n\r\nIT IS VERY IMPORTANT TO FOLLOW THE INSTRUCTIONS FOR INSTALLATION !!! \r\n\r\nThis mod changes the landscape from Solitude to Windstad Manor \r\n\r\nRoad installed thru 31 Cells (from Winstad Manor to Solitude \r\n\r\nRetextured 31 Cells to match the surrounds with what i was adding \r\nOver 500 plants,trees. rocks, shrubs and thicket ect. \r\n\r\nRe-navmeshed all 31 cells , adding preffered pathing \r\n\r\nA Black Smith next door to you at Winstad Manor \r\n\r\nReshaped the land thru the 31 Cells \r\n\r\nOver 100 new idle markers and many things not mentioned \r\n\r\n14 New NPC\\'s (All with individual AI packages/patrols \r\n\r\nMason-Blacksmith \r\n\r\nAdele- Masons Wife \r\n\r\nBethany-Mason\\'s Adeles daughter \r\n\r\nCarina-Nord Vampire, Marriage/Follower can be found sleeping in the basement coffin of Winstad Manor during the day, is patroling/hunting the bridge over the swamp at night \r\n\r\nAmabel- Redguard Marriage/follower, Patrols from Silverblood Inn to Fours Shields Inn, to Winking Skeever, and finally to Winstad Manor (Working at each place, eating sleeping ect.) \r\n\r\nSybrina-Darkelf,Marriage/Follower Lives at the Winstad Mannor, tends to the hatchery during the day. sandboxes the Manor at night. \r\n\r\nOdebia-HighElf-Winstad Guard, patrols the road from the Manor to Solitude \r\n\r\nEugene-Argonian-Winstad Guard, patrols the road from the Manor to Solitude \r\n\r\nArthur-Orc-Winstad Guard, patrols the road from the Manor to Solitude \r\n\r\nJosia-Reguard-Winstad Guard, patrols the road from the Manor to Solitude \r\n\r\nAldous-RedGuard,Marriage/Follower, Riding his horse &quot;War&quot; on the roads between Whiterun and Riverwood \r\n\r\nAquilla-Khajiit, Marriage/follower, Sleeps at Candlehearth Inn, patrols Windhelm during the day \r\n\r\nLucien-Breton-Marriage/Follower, sleeps at the Winking Skeever, patrols the solitude docks during the day \r\n\r\nAzuba-Orc-Marriage/Follower-The biggest patrol of them all, she goes from the Winking Skeever, to Dawnstar, Whiterun, Windhelm, and stops in from time to time to the Winstad Manor for a visit, she like all the others not only patrol to the destination, they also interact at each destination \r\n\r\n\r\niNSTALLATION iNSTRUCTIONS (VERY IMPORTANT); \r\nyou will need, ApachiiSkyHair from Nexus: \r\nhttp://skyrim.nexusmods.com/mods/10168/? \r\n( I Emailed Apachi about a month ago to get permission to use ApachiiSkyHair mod, and got the approval for it, Thank you Again Apachii, very much appreciated \r\n\r\nyou will need the Creation Kit \r\n\r\n1. Start by installing ApachiiSkyHair first, using the NMM or manually, your choice : http://skyrim.nexusmods.com/mods/10168/? \r\n\r\n2. Next Install this file with NMM (File for this mod)\r\n\r\n3.  Go into game and make a save, now go talk to any of the New NPC\\'s and if they have a discolored head follow the next steps, if the coloration is fine then you are done. ( I hand packed the Face Gen Files into the Mod but its a bug With the CK and Skyrim that sometimes it does load them thats why i include the next steps, to fix the black face bug) \r\n\r\n4. Exit game and start up your Creation Kit \r\n\r\n5. Now you need to choose which files to check, Double click Skyrim.Esm, HearthFires.Esm, ApachiiHair.esm, then double click 1WinstadExt.esp, then click Set as Active File. click OK \r\n\r\n6. the Creation Kit takes a bit to load so give it time to fully load the files \r\n\r\n7. Once loaded, in the Object Window you will see Actors;, click the + sign the left of Actors, it will open up the drop down menu, Highlight the word Actor, this will give you the list of all the actors in the game, at the top of that list will be 15 names: \r\n1Adele \r\n1Aldous \r\n1AldousHorse \r\n1Amabel \r\n1Arthur \r\n1Azuba \r\n1Bethany \r\n1Carina \r\n1Eugene \r\n1Josia \r\n1Lucien \r\n1Mason \r\n1Odebia \r\n1Sybrina \r\n\r\n8. Highlight all of those names, the click Ctrl+F4, and box will pop up that says Export face gen data for all selected NPC,s? --Click yes , the when it says done, click ok, save and exit and your ready to play \r\n\r\nA Few extra notes, again i made this mod for my game, i WILL NOT make a version for vanilla skyrim, i WILL NOT make changes, if there is a legit problem i will fix it but we have been testing it for 3 days now with no issues. \r\n\r\n\r\nFor those of you who have a legitimate question or need help i am more then willing to answer your questions or help if help is needed \r\n\r\n\r\nThank you again Apachii, ApachiSkyHair is one of those mods thats a game changer, and thank you for letting me use it \r\n\r\n\r\n",
  "categoryId": "24",
  "version": "1.0",
  "author": "CadenBlack",
  "createdUnix": "1369282301",
  "updatedUnix": "1369282301",
  "containsAdultContent": false,
  "uploadedBy": "cadenblack",
  "primaryFile": null,
  "files": []
}