{
  "modId": 36326.0,
  "modName": "The Gray Prince Arena",
  "summary": "Places an Arena in the Whiterun Hold near Rorikstead with it&#39;s own Faction, Unique voice-acted NPC&#39;s,  separate interior cells, and of course it&#39;s own main Quest featuring matches in the arena.",
  "descriptionHtml": "I have abandoned this mod and everything in the description was just my expectations for the mod when I was working on it. Rather than seeing my work waste away in a hidden file on my nexus account, I&#39;m releasing it for all other modders to do with it as they see fit.\r<br />\r<br />There are 12 playable matches and a fully fleshed out arena. In a sense, it&#39;s still more complete than many other arena mods on the Nexus.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Just thought I would give the Nexus an early look at the mod I&#39;ve been making. I&#39;ve spent over 12 hours each day getting this mod put together, so you can bet that I&#39;m really excited \r<br />\r<br />The mod is still being worked on, and I honestly won&#39;t be able to give you an estimate on when I will consider it worthy of uploading. So, just to be clear:\r<br /> -------THIS PAGE IS TO VIEW THE PROGRESS FOR THE MOD NOT TO DOWNLOAD THE MOD ITSELF-------\r<br />\r<br />Truth be told, I was more than just &#34;a little disappointed&#34; with the lack of true arena mods on Skyrim. I figured someone would have made a fully functional arena like Oblivion&#39;s within the first year, yet here we are going on to year 2 and we still don&#39;t have one. My mod aims to change that, and if I did my job right you&#39;ll agree that this arena is the closest experience you&#39;ll get when it comes to the Arena in Cyrodiil. But hey, that&#39;s pretty much what every other mod page tells you their mod is going to do, so why should you bother downloading mine when you&#39;ve been told the same false story over and over again? Well first let me explain what I mean when I say this arena will actually function like Oblivions.\r<br />\r<br />--------------------NO CHAINS, BUTTONS, OR LEVERS THAT SPAWN ENEMIES-------------------------\r<br />Time and time again I&#39;ve seen this same method repeated for every arena mod I came along. Now don&#39;t get me wrong, doing this has the potential to be fun in it&#39;s own right -But spawning a bunch of mobs, jumping from a balcony, killing them, then climbing back up to all your buttons and levers is NOT what the experience in Oblivion was like. \r<br />With this mod you won&#39;t find yourself killing waves of the same enemy over and over again. If you want that you can download one of the other arena mods on the Nexus. Or, you know, just use console commands.\r<br />\r<br />------------------------------ARENA SEPARATE FROM SKYRIM WORLDSPACE----------------------------------\r<br />I feel this is the 2nd most important feature of my mod. Most of the arena mods I&#39;ve played simply place an arena out in the open. This is bad for for 2 reasons: \r<br />1. Players are much more susceptible to lag and freezing. Loading screens may get lots of hate, but having the player load up a cell that&#39;s entirely distinct from Skyrim worldspace makes the game run a lot more smoothly. Interior cells let editors (like me&#33;) place a lot more clutter and detail to their maps without causing too much lag.\r<br />And 2. Very unlike the Oblivion Arena. Nuff&#39; said.\r<br />While you can definitely see the arena from the outside before you enter, you can be assured that  beautiful and bloody interior that won&#39;t completely wreck your PC awaits you within.\r<br />\r<br />----------------------SCRIPTED FIGHTS WITH A SINGLE UNIQUE OPPONENT--------------------------------\r<br />Much like Oblivion&#39;s Arena, you&#39;ll find yourself pitted against a single opponent (With a few minor exceptions) that has their own distinct attributes. I liked the way Oblivion had you fight an enemy who had some sort of combat specialization so you&#39;ll find something very similar with this mod. You&#39;ll also have an NPC you can speak with who will give you a heads-up on your next opponent so you know what to expect, just like Owyn would do in Oblivion.\r<br />\r<br />---------------------------------------------THE BLOODWORKS----------------------------------------------------------------------\r<br />Whats an arena without a place for the fighters to train, eat, and sleep? Beneath the arena you&#39;ll find a spacious dungeon that houses some of the Arena&#39;s fighters.\r<br />\r<br />----------------------------RANKS, GOLD REWARDS, AUDIENCE, AND MORE------------------------------------\r<br />The ranks you all knew in loved in Oblivion&#39;s arena return with this mod. You&#39;ll find that your first couple matches you&#39;ll be set up against weak Pitdogs, and as you progress you&#39;ll fight stronger and more skilled opponents. Gold will be granted after the completion of each match and the amount given will be entirely dependent on the difficulty of your current rank. \r<br />\r<br />So now that I have you thinking this is going to be the same old arena you played until you were bored at least 2 years ago (No disrespect ES4, you were the shiz), let me show you what&#39;s different in my mod and my justification behind each decision I made. We&#39;ll start with something a little controversial... \r<br />\r<br />-------------------------------OPPONENTS ARE NOT LEVELED TO THE PLAYER-----------------------------------\r<br />So I understand a lot of people are going to want to jump into my mod and consecutively defeat each enemy until they have become the Grand Champion. Unfortunately for them, that&#39;s not quite the vision I had in mind whilst making this mod. To me, it doesn&#39;t make a lot of sense for some low level scrub fresh out of Helgen to be able to hold his own against well-trained, High-ranking fighters in the arena. Similarly, it doesn&#39;t make sense that a high level player who can single handedly kill a dragon will have any trouble at all fighting a weak little Pitdog who just joined the arena. \r<br />Because each opponent is set to a certain level regardless of the players current level, low level players will find some of their mid-range fights near impossible to win. This means the player will need to leave the arena and return only when they have gained enough combat experience. Higher level players will easily be able to dispatch their early opponents and may only find difficulty with enemies at later ranks. Now some people would consider this an &#34;issue&#34;, but I personally love the way it works and I think it makes the most sense so I&#39;m keeping it this way. \r<br />\r<br />Ok now for some cool stuff....\r<br />\r<br />------------------------------------------------MORE UNIQUE ENEMIES-----------------------------------------------\r<br />Oblivion did a decent job at making each opponent differ from the last, but there was really only so much they could do in the world Cyrodiil provided. With Skyrim however, we have a whole range of different possibilities. Unlike the Arena in the Imperial City, the Gray Prince Arena doesn&#39;t discriminate against people who want to participate. You&#39;ll find fighters from all walks of life who came to the arena for their own reasons. Most of the Pitdogs will just be skooma addicts who need a little extra gold for their next fix, or slaves fighting for their masters. People afflicted with curses like lycanthropy or vampirism can find a home within the Arena&#39;s bloodworks where they can be cherished for their superior strength in battle. Every NPC will have their own reasons for joining the arena.\r<br />Aside from who your opponents actually are, I&#39;ve also taken the combat a step further. Enemies will have their own sets of armor and weapons, and every so often you may encounter an enemy with unique equipment or abilities not in the vanilla game (Don&#39;t get too excited, I DID only use vanilla assets, but the combinations of assets you find aren&#39;t anything like you&#39;ll find in the vanilla game. Just don&#39;t expect new models or re-textures).\r<br />Your opponents may start the match by summoning hordes of skeletons, buffing themselves, or even with a transformation. Every enemy has the potential to be something new and different.\r<br />\r<br />-----------------------------------------------------DITCHED THE RAIMENTS--------------------------------------------------\r<br />This one I&#39;m not particularly excited about doing. I personally would have loved to have enemies wearing some cool gladiator armor get-up. However it didn&#39;t really fit with the way I wanted your opponents to be. Each one needs to be different, and I feel their clothing and items really do a good job at forming their character. A slave should be wearing rags. A vigilant of Stendarr should be wearing their typical attire. A Werewolf should only be wearing some tattered pants. \r<br />I actually had Light and Heavy raiments that functioned like the ones in Oblivion in the early stages of the mod. But I decided to lose them as my vision for the arena became more clear.\r<br />\r<br />-----------------------------------------------------A CHANGING AUDIENCE-----------------------------------------------------\r<br />If you ever wondered why you got less money for fighting as a Pitdog than when you were higher rank, you probably figured it was because less people were willing to pay to watch a match between two noobs. When you step into the arena however, you would always see the same amount of people cheering in the crowd no matter what your status was. To me, it only made sense that a Pitdog match would draw in a small and poor crowd while higher ranked matches would bring in all sorts of people. Now when you rank up you&#39;ll not only see your audience grow, but also see that more noble patrons have come to watch your fights. \r<br />Not really a game-changing feature, but I definitely think it improves the overall atmosphere.\r<br />\r<br />---------------------------------------------------THE LOOK OF THE ARENA----------------------------------------------------------------\r<br />I really didn&#39;t want to limit my own creativity by modeling the arena after Oblivions so I decided to have fun with this one. In the Imperial City it made sense that the arena was made of stone and had that &#34;clean&#34; look to it. In my arena you&#39;ll find that it&#39;s much the opposite. The walls are lined with wooden spikes, bodies and heads of defeated fighters are impaled on the walls, a massive fire pit located outside the arena serves as a furnace for the dead bodies. The arena itself just feels a lot more savage and lawless than Oblivions. I leiks it :3\r<br />\r<br />-----------------------------------------------------------NEW CHAMPION RANK-----------------------------------------------------\r<br />While technically it&#39;s own rank in Oblivion, the &#34;Champion&#34; rank didn&#39;t actually feature any matches. It was merely the placeholder between your Hero rank and your Grand Champion Rank. I decided to add it to my arena mainly because it added potential to make 3 more unique and challenging opponents. If I&#39;m ever not satisfied with the number of matches it takes to become Grand Champion, you can expect me to simply add more ranks so I can make more fights.",
  "categoryId": "25",
  "version": "0.001",
  "author": "Campocalypse",
  "createdUnix": "1369283725",
  "updatedUnix": "1369283505",
  "containsAdultContent": true,
  "uploadedBy": "Campocalypse",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031050",
      "name": "GrayPrinceArenaPics",
      "version": ".001",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6438",
      "fileName": "GrayPrinceArenaPics-36326--001.zip",
      "uploadedUnix": "1369283505",
      "modVersion": ".001",
      "virusScanUrl": "https://www.virustotal.com/file/5b55fc2494e73f488bdc7d6e076755b3019dbc3decd0895854f4672e171680f5/analysis/1407578381/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GrayPrinceArenaPics-36326--001.zip?fid=1000031050&ttl=1535815448&ri=8192&rs=8192&setec=17600e747166981fc198491ecb8ad559"
    }
  ]
}