{
  "modId": 3632.0,
  "modName": "Standalone Weapon and Armor Pack ver2",
  "summary": "ADDS (NOT REPLACES) many new \\\"lore friendly\\\" armors and shields.  Balanced, fully upgradeable, and cross-mod-capable! :)",
  "descriptionHtml": "[b]INTRODUCTION[/b]\r\n\r\nThe main goal of this mod is to provide new choices in weapons and armor for the player while still keeping them close to lore and well balanced for regular gameplay.  Other key points:\r\n\r\n-allow for both light & heavy versions of certain popular armors (like the Blades and Ancient Nord Armor)\r\n-provide crafting and perk fixes for NEW versions of pre-existing armors that can prevent them from being upgraded normally like most armors\r\n-present the mod in such a way that allows for easy installation and combination with other mods!\r\n\r\nTo prevent compatibility issues, this is NOT an armor replacer mod nor does it \\\"fix\\\" any pre-existing content.\r\n-------------------------------------------------------------------------------------\r\n\r\n[b]NEW CONTENT AND FEATURES (ver2.0)[/b]\r\n\r\n[u]Blades \\\"Seeker\\\" Armor (and shield!) [/u]\r\n-light armor stats\r\n-attached with the Advanced Armor Smithing perk and can be crafted and upgraded the same as Steel Plate Armor\r\n-intended for mid/late-game usage; allows for heavier protection than most light armors, but with an increase in weight\r\n[u]Ancient \\\"Skyforge\\\" Armor[/u]\r\n-light armor stats\r\n-attached to the Steel Smithing perk and can be crafted (same way as original) and upgraded the same as Steel Armor\r\n-intended for early/mid-game usage (original armor still sucks, but didn\\'t want to make this version too overpowered either)\r\n[u]Berserker Armor[/u]\r\n-heavy armor stats (but lighter than most...)\r\n-attached to Orcish Smithing perk and can be crafted and upgraded the same as Orc Armor\r\n-intended for mid/late-game usage; a natural choice for fans who liked the Wolf Armor, but need more protection.  Also, finally gives heavy armor users a solid choice if they want the \\\"barbarian\\\" look :)\r\n-two choices for helms; orky helm or bear hood available to player!\r\n[u]Ranger Armor[/u]\r\n-light armor stats\r\n-attached to the Elven Smithing perk and can be crafted and upgraded the same as Elven Armor.\r\n-intended for early/mid-game usage; for those who hate the Thalmore and don\\'t want to dress like them ;)\r\n[u]Companion Shield[/u]\r\n-heavy armor stats\r\n-attached to the Steel Smithing perk and can be crafted (same way as Ancient Nord/Skyforge Armor) and upgraded the same as Steel Armor\r\n-intended for mid/late-game usage; finally a more traditional looking shield (NOTE: HIGHLY RECOMMEND A SHIELD RETEXTURE/MESH FOR THIS... original sucks).  Look in my mod recommendations to get a much better shield texture/mesh.\r\n\r\nPlease keep in mind this is my FIRST attempt at modding a Bethesda game for public release.  There will definitely be regular updates (relatively speaking).  I recommend putting this on your tracking list if you like what you see.  Speaking of which...\r\n\r\n[b][u] IF YOU LIKE IT, PLEASE ENDORSE IT!  MY CREATIVE FIRES ARE FUELED BY YOUR ENTHUSIASM![/u]  :) [/b]\r\n\r\nCurrently, my mod only uses original models and textures.  If you want them to look different, see below.  I will be looking into creating new models for the new versions, but you will need to be patient with me (holidays, work, dating, etc... you know the drill).\r\n\r\n[b]Actual base stats:[/b]\r\nBlades Seeker Armor: close to glass armor, but 50% heavier\r\n-head- A:16, W:3\r\n-chest- A:38, W:10\r\n-hands- A:11, W:3\r\n-feet- A:11, W:3\r\n-shield- A:25, W:8\r\n\r\nAncient Skyforge Armor: close to leather armor, but twice as heavy (original armor is borked stat-wise)\r\n-head- A:14, W:3\r\n-chest- A:23, W:14\r\n-hands- A:8, W:3\r\n-feet- A:8, W:4\r\n\r\nBerserker Armor: stats are somewhere between Steel Plate and Dwarven, but at significantly reduced weight! (again, like the Wolf Armor)\r\n-head- A:19, W:6 (orky helm)\r\n-head- A:16,W:4 (bear hood)\r\n-chest- A:34, W:25\r\n-hands- A:14, W:5\r\n-feet- A:14, W:7\r\n\r\nRanger Armor: somewhat more boring stat-wise (very similar to basic Elven Armor), but at least now you don\\'t have to dress like an elf ;)\r\n-head- A:12, W:1.5\r\n-chest- A:30, W:6\r\n-hands- A:8, W:1.5\r\n-feet- A:8, W:1.5\r\n\r\nCompanion Shield: very similar to Ysgramor\\'s Shield, but without the enchantments (again, look below in my mod recommendations for a much better retexture/mesh design).\r\n-shield- A:30, W:12\r\n--------------------------------------------------------------------------------\r\n\r\n[b]COMPATIBILITY & MOD RECOMMENDATIONS[/b]\r\nThis mod does NOT replace any files, only adds new ones.  As far as I know, there should be ZERO compatibility issues.  Texture upgrade mods will also work in conjunction with this (confirmed).  New model/mesh mods *should* also work if they affect the originals.\r\n\r\nThis mod was built specifically to expand upon another mod that I highly recommend:\r\n[u]Legendary Smithing Upgrades[/u]\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=1690\r\n\r\nAlso highly recommended if you don\\'t want the Companion Shield to look retarded:\r\n[u]Shield of the Lone Wolf - a Shield of Ysgramor Replacement[/u]\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=1110\r\n\r\nOther mods this works well with (and among my personal favorites):\r\n[u]Lost Art of Blacksmithing[/u]\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=1020\r\n[u]Dragonbone Weapons[/u]\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=1935\r\n[u]SkyUI[/u]\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=3863\r\n[u]Realistic Ragdoll Death Force[/u]\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=601\r\n[u]No More Blocky Faces [/u]\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=30\r\n-----------------------------------------------------------------------------------\r\n\r\n[b]BUGS[/b]\r\n\r\nNONE! (none reported or found yet, anyway... let me know if you find one!)\r\n------------------------------------------------------------------------------------\r\n\r\n[b]CANCELED - IN THE WORKS (in order of priority) - CANCELED [/b]\r\n{NOTE: I have discontinued work on this, but may pick it back up if there is enough of a demand)\r\n- add additional \\\"balanced\\\" armor sets\r\n- add some \\\"actual\\\" weapons to the mod (there aren\\'t any currently)\r\n- try to find a better way of dropping the Blades armor into the game rather than crafting/consoling it (longterm solution: create a blades blacksmith and/or forge?)\r\n- create unique meshes and/or textures for new armors where it is appropriate to help distinguish them from original armors (like the Blades Armor)\r\n-try to figure out a way to repath the smithing perks (original is too restrictive/rigid)\r\n\r\nlast idea may be beyond my abilities/patience...\r\n------------------------------------------------------------------------------\r\n\r\n[b]CREDITS[/b]\r\n\r\n[b]MASSIVE \\\"FUS RO DAH\\\" to Legendary Smithing Upgrades\\' creator, LUCUBRATION!  [/b]When I first started this project, I actually used his mod as a template to create this one (with his permission).  Also, if not for his excellent technical support, this mod never would have seen the light of day!  THANKS LUC!\r\n\r\n----------------------------------------------------------------------------\r\n\r\n[b]RAMBLINGS, DISCLOSURES, & MISC.[/b]\r\n\r\nFor my first playthrough, I decided to do something different and go with a Enchanter/Smithing/Warrior combo.  Much to my surprise, even in light armor, I became nearly unstoppable.  Knowing that using heavy armor would only make me harder to kill and that I wanted to still give myself some challenge, i stuck with my scaled light armor.  It was only later that I realized there was a very limited selection of light armors for late-game play.  Dragonscale looked too exotic (and clunky) for me and glass armor was too gaudy.  So there I was, nearly level 50 and still using scaled armor.  Was time to start modding!\r\n\r\nPROTIPS: \r\nSkyforge armor can only be crafted after unlocking the \\\"full potential\\\" of the Skyforge (i.e. Companion questline)\r\nfor when using console: \r\n-new item IDs are same as old but first 3 digits are different (0004f912-->XXX4f912 for Blades Shield)\r\n-type \\\"help ranger 4\\\" or \\\"help skyforge 4\\\" to more easily find new item IDs (don\\'t include quotations)\r\n-use PageUp & PageDown keys to scroll through the list\r\n\r\n[b]MODDERS NOTE: and of course, please first get permission from me if you want to add this to another mod for public release.  thank you :)[/b]",
  "categoryId": "54",
  "version": "2.0",
  "author": "worcottle aka MagnusEffect",
  "createdUnix": "1323837449",
  "updatedUnix": "1324550804",
  "containsAdultContent": false,
  "uploadedBy": "worcottle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "10812",
      "name": "LightArmorPack14",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "LightArmorPack14-3632.rar",
      "uploadedUnix": "1323983808",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/6008fefb190d9d57c8e07496b2b0e0d82a4aa38b61b45edfe65a995b934c18fc/analysis/1406522523/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LightArmorPack14-3632.rar?fid=10812&ttl=1535758830&ri=8192&rs=8192&setec=ea004d65a89f445041f0ed5f86286539"
    },
    {
      "fileId": "12200",
      "name": "StandalonePack20",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "StandalonePack20-3632.rar",
      "uploadedUnix": "1324346204",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9a8a8bde96117f34ac0fb64132c1eb711fe1421118be212eaa707fecda1245b6/analysis/1406538436/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/StandalonePack20-3632.rar?fid=12200&ttl=1535758831&ri=8192&rs=8192&setec=42c2ba3e451f30a5096a3ea2241f862d"
    },
    {
      "fileId": "12849",
      "name": "Current Readme File",
      "version": "2.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2",
      "fileName": "Current Readme File-3632-2-0.rar",
      "uploadedUnix": "1324550804",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/dd304e3d55b9d17cc163d49dc494a1d25766a94fa7f2e8185f622b9edd8f658e/analysis/1406546769/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Current%20Readme%20File-3632-2-0.rar?fid=12849&ttl=1535758831&ri=8192&rs=8192&setec=b7d5548baca6b292f7c798ecde883c5e"
    }
  ]
}