{
  "modId": 36349.0,
  "modName": "Brenn - An Attractive Marriable Male Follower",
  "summary": "My first mod! Brenn is Brynjolf\\'s younger brother, a former member of the Thieve\\'s Guild, he was kicked out by Brynjolf because of a robbery gone bad.",
  "descriptionHtml": "[img]http://oi42.tinypic.com/j6ig4n.jpg[/img]\r\n\r\nHey all, this is my first ever mod. I, as a female, wanted a male follower that I can marry who, in my opinion, is attractive. I always thought Brynjolf was pretty attractive, but sadly, you can\\'t marry him. So here\\'s Brynjolf\\'s younger brother, Brenn! I actually do plan on making a questline when I learn how to mod better that\\'ll explain their story to you as well as re-unite them! Long story short, Brynjolf kicked Brenn out of the Thieve\\'s Guild for his own protection after someone they stole from nearly killed Brenn.\r\n\r\nSince Brenn was kicked out of the Thieve\\'s Guild, he tried to make an honest living. He studied at the Colledge of Winterhold briefly, so he has some knowledge in using magic. He uses mostly frost spells, and some lightning spells. He does not come with a default weapon. (I tried to get him to not have a bow either, so far in my game, he hasn\\'t taken one out. If he does for you let me know.)  He still wears his Thieve\\'s Guild armor. He also knows a bit of necromancy. The whole \\\"honest living\\\" thing didn\\'t work out so now he lives in The Bannered Mare in Whiterun, and continues to steal from people. \r\n\r\nTO GET THE WARPAINT TO SHOW IN YOUR GAME IF THE \\\"WITH WARPAINT\\\" VERSION DOESN\\'T WORK:\r\n1. Download the Creation Kit\r\n2. Click on File>Data and load the Skyrim and update master files, find \\\"Brenn.esp\\\" in the list and load that too. You will get a couple error/warning messages. This is normal. Just click \\\"yes to all\\\".\r\n3. Look for Brenn in the Actor menu in the Object window. He can be found under Actor>Nordrace>Male. Highlight him.\r\n4. Press Crtl+F4. This will export his face data to the game. If it didn\\'t work, try doing it again. \r\n\r\nIf you are open to helping me add the quest part in, please let me know.\r\n\r\nThis is my first mod so if you have any issues or suggestions, don\\'t hesitate to let me know.\r\n\r\nI plan on making much more followers! So keep an eye out!\r\nIf Brenn isn\\'t hot enough for you, try one of [url=http://skyrim.nexusmods.com/mods/36554/?]these guys[/url]!\r\nAlso check out [url=http://skyrim.nexusmods.com/mods/36442]Mosha - An Orcish Follower[/url].\r\n\r\n[b]Ladies! If you want me to make more attractive men, send me a message with a request! I, as a female who plays Skyrim, know how frustrating it is that the majority of downloadable followers are either ugly men or super-hot women![/b] Actually, anyone can request a follower, if he/she wants to.\r\n\r\n[i]If you like my followers, please endorse them! It shows me that I\\'m doing a good job as a beginner modder, and that you\\'d like me to continue trying to make mods![/i]\r\n\r\nCredit goes to Bethesda, for making this awesome game.",
  "categoryId": "66",
  "version": "1.1",
  "author": "FXM420",
  "createdUnix": "1369334633",
  "updatedUnix": "1369502959",
  "containsAdultContent": false,
  "uploadedBy": "FXM420",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031104",
      "name": "Brenn - No warpaint",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Brenn-36349-1-0.rar",
      "uploadedUnix": "1369334167",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/afe984d17f2fff24f218e621cd45971dab485b167c90574de25da1b7d230f3d5/analysis/1407579062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brenn-36349-1-0.rar?fid=1000031104&ttl=1535815477&ri=8192&rs=8192&setec=0d931633a3a959e12ad6c6e6a395b39c"
    },
    {
      "fileId": "1000031411",
      "name": "Brenn - Now with warpaint",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "176",
      "fileName": "Brenn - Now with warpaint-36349-1-1.rar",
      "uploadedUnix": "1369502959",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/535745c5b939fa15e0db2c59b2b1d4c19dff3fc3dd7a5374cace834f04554d15/analysis/1407581301/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brenn%20-%20Now%20with%20warpaint-36349-1-1.rar?fid=1000031411&ttl=1535815477&ri=8192&rs=8192&setec=ffa38244830286d430442c3c5f5b9875"
    }
  ]
}