{
  "modId": 36353.0,
  "modName": "Hordes of Things",
  "summary": "Adds 5 new spells that summon hoards of Bunnies, Rats, Spiders, Skeletons, or Falmer Spirits",
  "descriptionHtml": "This is a very simple mod that adds 5 new spells to the game\r\n\r\nSummon Horde of Bunnies - Novice Conjuration\r\nSummon Plague of Rats - Apprentice Conjuration\r\nSummon Frostbite Spiders - Adept Conjuration\r\nConjure Skeletons - Expert Conjuration\r\nConjure Falmer Spirits - Master Conjuration\r\n\r\nThe spells can be found randomly in the game from any chest that contains spellbooks, any mage that drops spellbooks, and any merchant that sells spellbooks.\r\n\r\nSummon Horde of Bunnies is the easiest spell to cast and requires the least amount of Magicka. Rabbits do not attack, they do however provide a tasty distraction.\r\n\r\nSummon Plague of Rats simply summons 10 small, yet fast, rats, this is a quick spell to cast and requires a small amount of Magicka and Conjuration. Rats are much like bunnies, however, they can attack enemies for you.\r\n\r\nSummon Frostbite Spiders summons 5 small spiders that will fling poison at your enemies from a distance, they can also bite if enemies get too close, this is the medium range skill.\r\n\r\nConjure Skeletons summons 10 skeletons to fight for you, they act like just normal skeletons, while they can\\'t take a hit to save their life they deal the most damage and are by far the most destructive. This spell costs high Magicka and Conjuration to cast.\r\n\r\nConjure Falmer Spirits summons 5 falmer ghosts. Falmer Ghosts are the most durable of the summons, though they take the longest cast time and most Magicka to cast. Falmer Ghosts constantly cast a frost spell on enemies to slow them down and damage them slowly.\r\n\r\nEnjoy!\r\n\r\nChangelog:\r\n1.0: Release\r\nAdds Rat, Skeleton, and Spider spells\r\n1.1: Adds Rabbit and Falmer spells, fixes typos\r\n1.2: Fixed an issue with Rat spell",
  "categoryId": "75",
  "version": "1.2",
  "author": "Syynx",
  "createdUnix": "1369337767",
  "updatedUnix": "1369349546",
  "containsAdultContent": false,
  "uploadedBy": "Jjiinx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031138",
      "name": "mainfile",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "mainfile-36353-1-2.rar",
      "uploadedUnix": "1369349546",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/edc1f9cd9f274e98bc01558aefb2725769aa67d08fe66de1b6ec1a40d997a2f6/analysis/1407579245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mainfile-36353-1-2.rar?fid=1000031138&ttl=1535815486&ri=8192&rs=8192&setec=ffabfdef0339e2b74507367ba83dbd69"
    }
  ]
}