{
  "modId": 36365.0,
  "modName": "Polymorphy",
  "summary": "Transform into any creature or npcs.",
  "descriptionHtml": "Hai guise :3 Since I don&#39;t have time to maintain this anymore (Skyrim doesn&#39;t feed me), you are free to copy, modify, translate it and upload it elsewhere :) If you can, It would be nice if you add me to the credits ;) have fun &#33;\r<br />\r<br />Transform into any creature or npc. NO DLC REQUIRED. Custom mods supported.\r<br />\r<br />v2 video by gamespot (most bugs in video have been fixed):\r<br />don&#39;t forget to watch other hilarious videos :)\r<br />If you make video send me link :3\r<br />[youtube]mcB8euTGz3g[/youtube]\r<br />\r<br />How to use:\r<br />When loading your game you will receive the spells.\r<br />To set a form you need to cast the &#34;set form&#34; spell on a target.\r<br />To morph equip a morph spell and use shout key.\r<br />To revert back just press shout key again.\r<br />If you sneak before morphing, the morph retains it&#39;s natural allegiance (You can murder innocent villagers as a frost giant or just walk among bandits as a bandit).\r<br />\r<br />limitations:\r<br />-You cannot activate objects and some menu interfaces are disabled.\r<br />-To attack, approach an hostile target and you will attack automatically.\r<br />\r<br />known issues:\r<br />-you need to sheath your weapons or spells before morphing so that the camera works correctly.\r<br />-If you try to morph into a leveled actor the morph can get a little bit random.\r<br />-Sometimes you can&#39;t move because your morph plays an idle (giant scratching his back with club :3 )\r<br />\r<br />changelog:\r<br />29.7.2013 V5:\r<br />-Morphing and reverting is now a lot faster.\r<br />\r<br />v4:\r<br />-fixed a bug where npcs or creatures would start attacking morph for no reason.\r<br />\r<br />v3:\r<br />-fixed many morphs.\r<br />-Morphs are now closer to originals (attacks,equipment).\r<br />-if you sneak before morphing the morph retains it&#39;s natural allegiance (You can murder innocent villagers as a frost giant or just walk among bandits as a bandit).\r<br />-little bug fixes\r<br />\r<br />v2:\r<br />-when using v1, when you reverted from a morph you could not activate a lot of stuff. \r<br />If you encounter this issue, update to v2 and morph to fix.",
  "categoryId": "75",
  "version": "5",
  "author": "tilokan1337",
  "createdUnix": "1369351094",
  "updatedUnix": "1375100094",
  "containsAdultContent": false,
  "uploadedBy": "tilokan1337",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000041966",
      "name": "polymorphy v5",
      "version": "5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54",
      "fileName": "polymorphy v5-36365-5.zip",
      "uploadedUnix": "1375100094",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/94eb8a187e5b1a3601aad0f155c1e02d77f89b290ff4af0a299872b969bbefbc/analysis/1407659345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/polymorphy%20v5-36365-5.zip?fid=1000041966&ttl=1535815503&ri=8192&rs=8192&setec=1a5f2b610404cd8ebaca45057c70554a"
    }
  ]
}