{
  "modId": 36372.0,
  "modName": "Wild Mountain Dairy Farm",
  "summary": "A fully functional, working dairy farm player house!\r\nEver wanted to run your very own dairy farm? Now you can!\r\nMilk cows & goats, churn cheeses and butter or hire farmhands to do the work for you and collect a weekly income without lifting a finger!",
  "descriptionHtml": "[img]http://static.skyrim.nexusmods.com/mods/images/hot/36372.jpg?check=1369394386[/img]\r\nWild Mountain Dairy Farm V.1.1 Updated!\r\nBe sure to read ALL install instructions either in the sticky in the posts or in the included .txt!\r\n([url=http://skyrim.nexusmods.com/mods/29249/?]TMPoenix\\'s Multi-Adoption Mod Compatible[/url])\r\n(Requires Hearthfire DLC)\r\n\r\n[center][youtube]hWADXYBpjzg[/youtube][/center]\r\n[center] A great little walkthrough of the farm by TheHellHunt![/center]\r\n\r\nA fully functional, working dairy farm player house!\r\n\r\nNOTE: This mod is NOT compatible with Bert\\'s Hearthfire Dairy Goods Upgrade!\r\nA future, alternate version of this mod will soon be available with BHDGU incorporated into it!\r\n\r\nEver wanted to run your very own dairy farm? Now you can!\r\nMilk cows & goats, churn cheeses and butter or hire farmhands to do the work for you and collect a weekly income without lifting a finger!\r\n\r\nLocation: Just head south from Whiterun stables, you\\'ll find it!\r\nCost: 35,000 Septims\r\n\r\nWhat you get for your gold:\r\nOutside you\\'ll find an entire herd of cattle with domesticated goats on the hillside behind, two milk churns for fair weather crafting, a full smithing area at the side, stables and cows sheds and a seating area which commands unparalleled views of the city of Whiterun and surrounding lands.\r\n\r\nInside is two tiered, at the top you\\'ll find the main farmhouse, fully furnished, with custom named autosort containers for all your goods, a full kitchen, crafting tables for potions and enchanting, bedrooms for G\\'Hertza the housekeeper and children (adoption options not available yet!), a Super-Sorter & Instant Inventory Restocker and multiple bookshelves & display points.\r\nUpstairs you\\'ll find the master bedroom with an antechamber for weapon/armour storage, 6 mannequins, 10 dual weapon/single shield plaques, 18 weapon racks, custom staff displays, safe, dragon mask/claw displays.\r\n\r\nIn the lower tier you\\'ll find the cheese cellar with churns for foul weather crafting, storage for salt, rennet, wild mountain flowers and vats for cow & goat milk (all the ingredients for making your own cheeses and butter) and one entire wall of player usable maturing shelves as well as the farmhands residence which includes 7 beds for up to 7 followers or 4 farmhands and 3 followers to live in quite comfortably.\r\nNote: By each bed there is a chest, these chests and all containers in the cheese cellar area are safe, all other containers in the farmhands quarters are NOT safe!!! They, along with the food on the table/cupboards are fully respawning containers/foods, take what you like but DO NOT add anything you want to keep!!\r\n\r\nAll standard cows and domesticated goats are now milk-able (goat milk added!) throughout the game world, rennet (used for cheese making) can be gathered from dead cows and rennet, goat milk and 3 new cheeses each with four strengths not including raw are also available from certain vendors\r\nNote: Six of the cows are immortal, these are for the milkmaid to work.\r\n\r\nA more in-depth description of the farms unique features:- (I know it\\'s long but read it, you\\'ll be glad you did!)\r\n\r\nThe Master Ledger:\r\nThe master ledger holds all the options for controlling parts of the house from hiring staff to autosort controls to deciding what you want displayed on the side tables.\r\nIt is advised that the first thing you do is use the ledger to fill all the autosort lists as this can take about 10 real minutes (set it off then go grab a cuppa!).\r\n\r\nFarmHands:\r\nEach farmhand costs 500 Septims to hire and will earn the farm 250 Septims per week from the date of the first hired, so with all 4 farmhands running the farm you will earn 1000 Septims per week!!\r\nEach farmhand has his/her own routine, 2 will work in the cheese cellar, 1 milks the cows and 1 works the forge area, every farm needs it\\'s tools after all!\r\nWeekly income can be collected from the chest near the master ledger.\r\nOnce all farmhands have been hired the master ledger\\'s main menu will change to the <House Options> menu by default.\r\nAll farmhands are set to invulnerable.\r\n\r\nAutosorts/Super-Sorter/IIR:\r\nTo make use of the autosorts or the Super-Sorter the autosort lists must be filled either at the master ledger or at each of the autosorting containers.\r\nThe IIR (Instant Inventory Restocker) allows you to set an assortment of specific items to be replenished in your inventory when the Super-Sorter is used. The containers the IIR will replenish you from include the cooked foods, weapons (heavy & light, intended for arrows), potions, poisons & soul gems.\r\nTo use simply activate the IIR and select <Add> then add the item you wish to have restocked, you will then be prompted to select the amount you wish and the item will then be returned to you. From now on whenever you use the Super-Sorter that item will be Super-sorted then the desired amount will be returned to your inventory or as much as you have available!\r\nThe intended usage for these is, A) Use the ledger to fill all autosort lists, B) Activate each container to remove those items you do not wish autosorted/Super-Sorted by going to that containers <Options> menu and <Remove> each item, one at a time. This is mainly for armour and weapons that you want to keep. Note, the armour & weapons lists are LONG, please be patient while the object is removed from the list then returned to you with a <Done> message. C) go to the IIR and add all the consumables you want replenished. D) Hit the Super-Sorter for your inventory to be cleaned and refreshed! You can now, if you choose, go back to the ledger and turn off the autosorts, this just disables the autosorts menu every time you open a container, repeating this will turn them back on for you to add or remove further items in the containers/shelves autosort options.\r\nNote: I have not added any unique items to the autosorts base lists for two reasons, firstly (and mainly!) a lot of unique items are mission items that cannot be removed from your inventory, attempting to remove these items would cause the autosorts/Super-Sorter to stop when it reached that item and you would be left with an inventory full of goods that you\\'d have to store by hand, and secondly, I personally like to know that I\\'ve bagged something unique and may want it displayed instead of stored.\r\nSecond Note: The Super-Sorter is clunky! It may seem your game has frozen but it has not, it is just running through all the lists for sorting. I am trying to get this smoother but at the moment the only way I can find takes an age! Just give it about 10 seconds to run through all the lists and it\\'ll be fine!\r\n\r\nAutoGets:\r\nWhenever you use a crafting station, cooking, alchemy, enchanting or smithing, the contents of the appropriate containers will instantly be moved to your inventory, e.g, when using the cooking pot or oven all dairy goods, raw meats, fruit & veg, cooked foods, ales & wines and potions ingredients will automatically be transfered to your inventory then, when done, transfered back to their containers. The enchanting table will not only autoget your soul gems but also take count of the amount you started with and replenish that amount when done. The smithing furniture will autoget all smithing goods from the smithing chest (standard smithing goods), the potions ingredients (for things like Daedra Hearts etc.) and the safe (jewels).\r\n\r\nAuto-Displays:\r\nThere are two auto-display systems in the farm, staffs and all the food/ales & wines.\r\nWhenever you change the contents by opening them and adding/removing goods, by using the autosorts/Super-Sorter, or when using the cooking pot/oven the revised contents will be scanned and the appropriate changes made to what is on display.\r\nAll foods, ales & wines that are displayed in the main house can be taken and then, if more exists in the house stores, replaced with a message telling you how many are left.\r\nThe staff displays are slightly different in that there are two sides to the display, on the right as you enter the antechamber facing the master bedroom the display is static, the staffs that are displayed are representative of the generic staff types that proliferate the game as levelled items and will be displayed if you have any of that specific type in stock, on the left is the unique staffs display, as stated above uniques are not included in the autosorts base lists, so will need to be stored by hand, though once stored the container will eject them and put them on display for taking as if from any weapon rack.\r\n\r\nSelf Filling Bookshelves & Self Dressing Mannequins:\r\nAll bookshelves and mannequins can be crouch-activated to present you with a hidden menu. The bookshelves will auto-fill from the two infinite bookcases to your right as you enter the main door, these are where the Super-Sorter sorts them to. Note: the option to auto-fill mixed standard books uses the autosort lists so this list MUST be filled to use this function. There must be books in the infinite bookcases for any of these functions to work.\r\nThe self-dressing mannequins use the contents of the heavy & light armour containers and offer 10 defaults, 5 light armour types and 5 heavy, plus 5 user set options. To set a custom option select a user set and you\\'ll be asked what type of armour it is, light or heavy (this lets the game know where to look), and then asked to exit, you will then be presented with another, hidden, container in which you must place armour first then boots, gauntlets, helmet and shield in any order, each piece will be returned to you instantly. Now exit and place that armour in the designated chest then crouch-activate any mannequin and select that user set to be used and your armour will be moved to the mannequin, exit for the mannequin to update.\r\nThere is also a random option which will have the mannequin select a suit of armour at random, then, every time you re-enter the house the armour will be switched with another random set! I advise you have a lot of different sets to get the most out of this feature. The mannequins will look for ten sets before deciding that there are no armours available, it will not switch to the same armour it is currently wearing but if it doesn\\'t find something different in those ten tries it will keep what it\\'s got, or, if naked, remain that way.\r\n\r\nDisplay Points:\r\nWhen first entering the farmhouse you will find pottery and potted plants on the sideboards and side tables, if you wish to display something else go to the master ledger and select the Display Points option in <House Options>, this will disable the defaults and replace them with display points. These can be activated for you to add, rotate, raise or lower pretty much anything you could want to have on display! If you find you don\\'t have enough to fill all the available points simply activate the remaining points and select <Preset> which will re-enable the default pottery/plant pot for that particular position! If you wish to open a display point that you have set to <Preset> simply switch the display points off and on again in the ledger without removing the goods you wish to remain on display, this will turn the pottery/potted plants on and off again then add your object(s) and reset the points you\\'re not using to <Preset>.\r\n\r\nAnd finally (I think?!?)\r\nThe Rocking Horse:\r\nThe rocking horse has two modes, as a hidden chest (default) and as a real rocking horse that you can ride!! You can switch between the two in the master ledger but be aware the hidden chest is NOT safe for storing stuff if you then switch to ridable!! The reason for the two types is that the ridable version can be... erm... iffy? It can take the game three or four seconds to decide how it\\'s going to use the standard \\\"mount a huge horse\\\" animation on a diddy little rocking horse. It does work pretty fine for me but not so well for gentester when she tried it out. The dismount isn\\'t great either, just hit the dismount button and don\\'t move your mouse \\'till you hit the ground, you\\'ll know what I mean when you try it, if it works for you that is!! Personally I like to sing \\\"Dum-Da-Da-Dum\\\" to the theme from bananza while riding and hitting the jump button!)\r\n\r\nQuirks/Game Bugs:\r\nUnfortunately the game does not recognise player made potions or poisons as such in the way I made my autosorts, so the autosorts will not and cannot have player made versions in their lists, they just don\\'t work! I am looking into this!! Though strangely they can be added to the IIR list!?!? Like I said, I\\'m looking into it!\r\nAlso, the game generates a lot of the staffs during run-time, so even though they are standard staffs they are not included in the base autosort lists but can be added manually from which point any version of that particular staff should be autosorted/Super-Sorted though will not trigger the display for that staff type, only the pre-listed version will do that.\r\n\r\nFinal Note:\r\nThe interior cells, all base objects (such as walls floors etc.) and containers are built into the esm, everything else, scripts, npc\\'s, custom objects, the entire exterior etc. are built into the esp, this is so, should you get a bad install but not notice straight away you can deselect the esp in the Data section of your Skyrim launcher, play the game for 3-4 game days without returning to the area, then re-select the esp in your launcher to reset all scripts. You will need to re-purchase the house and re-hire the farmhands but it should mean you don\\'t have to empty all the containers, your goods \\\"should\\\" be safe! Be sure to make a full save before just in case though!!\r\nTo replace the money you need to spend again simply open the console by hitting the tilde key (usually ¬ or ~ just under the Escape button) and type \\\"player.additem f 37000\\\" without the quote marks.\r\n\r\nI think thats it, though I\\'ll probably remember something else in a minute!!\r\n\r\nCredits:\r\ngentester for testing, inspiration and being all-round great!\r\nInsanitySorrow for washtub, washing line, soap and scrubby brush meshes & textures.\r\nAARS for the open book version of the ledger meshes & texture.\r\n\r\nberticus0001\r\nMoo!!\r\n\r\n-----------------------------------------------------------------------------------------------------------------------------------\r\n\r\nOther Mods By Me!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/33219/?]Gypsy Eyes Caravan[/url]\r\nFor the wandering adventurer, the player home you can take with you!!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/8922]Berts Breezehome Remodeled[/url]\r\nA full remodel of Breezehome including interior, exterior and cellar & so much more!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/15801]Berts Breezehome Cellar[/url]\r\nAdds an open (no loadscreen) cellar to Breezehome with a full set of crafting and smithing tools plus displays for armour, weapons, dragon masks and dragon claws!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/15806]Berts Breezehome Garden[/url]\r\nA new garden grotto added to Whiterun available as a standalone or connected to the vanilla Breezehome & is also pre-packed with my Cellar & Remodeled mods.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/29942/]Berts Breezehome Greenhouse[/url]\r\nA stand-alone version of the greenhouse thats included with this mod (Berts Breezehome Remodel) & Berts Breezehome Cellar.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/29665]Remo\\'s Display Spells[/url]\r\nA collection of spells aimed specifically at making your house a home.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/25239/#]Berts Hearthfire Dairy Goods Upgrade[/url]\r\nAn upgrade for the dairy goods side of the Hearthfire DLC. (NOT compatible with Wild Mountain Dairy Farm!!)\r\n\r\n[url=http://skyrim.nexusmods.com/mods/36301//?]Another Mannequin Script Fix[/url]\r\nKeep finding your mannequins neked every time you come home?\r\nWhat do they get up to when you\\'re out??\r\nThis is a replacer for the vanilla mannequin script to ensure your mannies get dressed when you enter!\r\n\r\n-----------------------------------------------------------------------------------------------------------------------------------",
  "categoryId": "67",
  "version": "1.1",
  "author": "berticus0001",
  "createdUnix": "1369394561",
  "updatedUnix": "1380845864",
  "containsAdultContent": false,
  "uploadedBy": "berticus0001",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031191",
      "name": "Wild Mountain Dairy Farm V_1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22157",
      "fileName": "Wild Mountain Dairy Farm V_1_0-36372-1-0.7z",
      "uploadedUnix": "1369392478",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c53d5e5b230be5774217cf1b818626367b5f41d49b8ea245fe7a4f07982c7d70/analysis/1407579690/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wild%20Mountain%20Dairy%20Farm%20V_1_0-36372-1-0.7z?fid=1000031191&ttl=1535815510&ri=8192&rs=8192&setec=acaa0af8d8e1f6d9996f3c9cd2186452"
    },
    {
      "fileId": "1000061261",
      "name": "Wild Mountain Dairy Farm V_1_1",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "350",
      "fileName": "Wild Mountain Dairy Farm V_1_1-36372-1-1.7z",
      "uploadedUnix": "1380845864",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bcb24e64e79552e69ff972e64af848d52147c33878b7193d10bf76598f2a2ca3/analysis/1407744491/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wild%20Mountain%20Dairy%20Farm%20V_1_1-36372-1-1.7z?fid=1000061261&ttl=1535815511&ri=8192&rs=8192&setec=4535baa0d760b8ac733b5d12411d2c16"
    }
  ]
}