{
  "modId": 36387.0,
  "modName": "Courier-- ENB",
  "summary": "ENBseries modification for 0.168 with a not-so-realistic approach to Skyrim. \r\nBright skies, dark nights and moody afternoons. \r\n",
  "descriptionHtml": ">>Atention, this description is not definitive<<\r\n\r\nThis ENB has been a quite long work in progress that I\\'ve been working on and off for the past five months, it differs a lot from my previous works and I am quite happy with it. I really don\\'t know how to describe it. It\\'s not all that cinematic, it is not for screenshots only, it does not feature too dark nights or caves and so on. \r\nIt\\'s really pleasing to the eye in my opinion, I wasn\\'t originally planning to upload it here like the FNV ENB, but in the end I\\'ve decided to do so.\r\nThis ENB is made for vanilla lighting, that means that it doesn\\'t need mods like CLARALUX or Realistic Lighting to work, but it works fine with them. I have NOT tested it with Climates of Tamriel but I suspect it works just as fine.\r\n\r\nPretty much all you need to know, FEATURES, that is:\r\nAnything you can find on any ENB; custom bloom files, post processing, anisotropic filtering, color correction, ambient occlusion, light source and cast intensity modification, lighting tweaking, Edge AA, complex shadows, film grain and depth of field.\r\n\r\nA quickie on the previous said things:\r\nThe bloom is very slight, barely noticeable if you ask me, mainly used for color tinting.\r\nThere are no lens flares, I\\'ve decided not to use them this time, however if people want them I can always make an under request version.\r\nThe AO and IL are tweaked a lot, so much that sometimes they can look a bit strange in some locations, I won\\'t feel honest if I don\\'t say so. However this is the one case that makes the exception, 99% of the time the AO/IL looks as intended.\r\nThe light sources and their cast light are very different from vanilla too.\r\nComplex shadows on exteriors.\r\nEdge AA, with the bloom config and the Edge AA you won\\'t notice jaggies anywhere but the loading screens.\r\nThe Depth of Field file which is a quite special config, comes with a film grain effect. This config instead of focusing on single objects focuses on all the objects in the same distance so you will not feel all that near sighted. The blurring is very soft, but that is quite taxing. It doesn\\'t make it unplayable at all, framerates with DoF are more than acceptable and the way it focuses on stuff makes it good for playing, a nifty feel most of the time. However I still don\\'t recommend playing with it for performance reasons. The DoF also makes the whole image a tad brighter and if you\\'re not focusing on the sky, aka looking at it, the sky will be slightly brighter and out of focus, wroten down sounds strange but in game it looks good and feels good. \r\nThe DoF is also good for screenshot purposes, while all my screenshots seen are from regular gameplay, it also works for that kind of stuff.\r\nAnd last of all the film grain, which comes with the DoF. So if you disable DoF you disable film grain, the film grain is applied on the out of focus parts of the image and varies on interiors/exterirors and day/night. Interiors and night use the same config (which has a tad more grain and feels darker). It\\'s not too obnoxious and I really like how it looks.\r\n\r\nAs usual, MSAA is not supported with ENB. \r\n\r\nAny doubts or quesions feel free to post in the comment section or PM me.\r\nIf you\\'re also interested in earlier than nexus releases or other stuff PMs are for it.\r\nThis is an early release version, this means it will change. When I can\\'t tell, but I like to keep tweaking and changing, evolving, untill I\\'m totally happy with the result. \r\n\r\n\r\nINSTALL INSTRUCTIONS\r\n\r\nDelete any old ENB files you had, download the newest ENB files from http://enbdev.com/download_mod_tesskyrim.htm\r\nExtract all the files in your Skyrim root folder\r\nLaunch game and enjoy.\r\n\r\n\r\nI recommend using wrapper version instead of injector, use injector only if wrapper gives you trouble. ",
  "categoryId": "62",
  "version": "1.0",
  "author": "Courier--",
  "createdUnix": "1369589891",
  "updatedUnix": "1369589056",
  "containsAdultContent": false,
  "uploadedBy": "enrikiller",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031551",
      "name": "Courier ENB 0168 ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54",
      "fileName": "Courier ENB 0168 -36387-1-0.rar",
      "uploadedUnix": "1369589056",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0986416430a737b5cc61f01f0d3c07e404820f5a9380ce44b8f29e70069f3c32/analysis/1407582381/",
      "changelogHtml": " Version 1.0 published (0.168 ENB files), added images and made placeholder description. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Courier%20ENB%200168%20-36387-1-0.rar?fid=1000031551&ttl=1535815529&ri=8192&rs=8192&setec=2febc28ac5c621d74dacc2720097fa2e"
    }
  ]
}