{
  "modId": 36389.0,
  "modName": "Chemistry - An Alchemy Overhaul",
  "summary": "An update and re-release of Alchemy Overhaul - Chemistry by FOEnthusiast. Features combined potions fore a less cluttered inventory. Potions are longer lasting, and harder-to-create, with multiple effects tailored specifically to your game play style. Extract ingredients into Compounds and then combine them into different potions.",
  "descriptionHtml": "[size=5]Questions for the community:[/size][size=2] Leave a comment or send me a message with answers/opinions.[/size]\r\n\r\n--I\\'ve added portable versions of the diffusor and extractor since they don\\'t appear at all the vanilla alchemy tables, and I’m not placing any in the DLC locations at this time. Do you want me to also add a portable alchemy work bench? Personally I use another mod that also happens to add one.\r\n*Never mind, the one Frostfall adds brings up the original Alchemy menu, not this one, so I will very likely be adding my own later. I assume most portable crafting tables added by other mods will do the same thing.\r\n\r\n[size=6] [b] [u] Description \r\n [/b] [/u] [/size]\r\n\r\nNo more carrying a thousand potions, this mod basically allows you to create cocktails of the original potions effects. The effects of the ingredients themselves haven\\'t changed much, just the way you put them together.\r\n\r\nFor Example, instead of having to select \\\"Fortify Block\\\" along with \\\"Fortify One-Handed\\\", \\\"Fortify Light Armor,\\\" and \\\"Fortify Marksman\\\" every time you enter battle you can just use one potion: \\\"Fortify Ranger,\\\" which lasts 10 minutes.\r\nThe result is a less cluttered potions/poisons inventory and favorites list.\r\n\r\nI’ve finished bulk recipes. Ingredients should be extractable in quantities of x1, x10, and x100. Potions/poisons should be extractable in x1 and x10. Potions/poisons should be craftable in quantities of x1, x5, and x10. None of the recipes for multiples will be visible if you do not have enough materials present (to help reduce crafting menu clutter).\r\n\r\n[Size=6] [b] [u] Mod Options\r\n[/b] [/u] [/size]\r\nDuring installation you have several options you can choose from. I\\'ll outline them here.\r\n-DLCs: each DLC has an additional plugin .esp. If you select all three DLCs a merged .esp will be used.\r\n-Simple Potion Names: This variant uses the mod’s original potion naming structure. For example all potions that restore health are named \\\"Restore Health\\\" regardless of how powerful they are. *Cannot be used with \\\"Labeled Potions\\\".\r\n-Labeled Potions: This is inspired by the \\\"Better Sorting\\\" naming convention (I\\'ve never actually installed that mod, only seen screenshots so this may not properly conform with that mod\\'s structure, but should be reasonably compatable.) Naming example \\\"Restore Health - I\\\", \\\"Restore Health - IV\\\". *Cannot be used with \\\"Simple Potion Names\\\".*\r\n-Potions Heal Instantly: Potions heal instantly\r\n-Potions Heal-Over-Time: Restore Health, Restore Stamina, Restore Magicka, and Elixir heal-over-time. The standard potion effects are spread out over 5 seconds. I don\\'t personally play with this version, so I am very open to balance feedback.\r\n*You should be able to switch between the options without losing any of you crafted potions or ingredients. I didn\\'t lose any in my tests, but just to be on the safe side I recommend checking to make sure you still have everything (perhaps by taking a screenshot of your potions inventory prior to changing version).\r\n\r\n[size=6] [b] [u] How to Craft Potions and Poisons\r\n [/b] [/u] [/size]\r\n**A Picture tutorial has been added to the \\\"Chemistry Documents\\\" file in the download section. It can also be viewed here: [url=http://static1.nexusmods.com/110/images/110/5012795-1374200562.png]Part 1[/url], [url=http://static1.nexusmods.com/110/images/110/5012795-1374200618.png]Part 2[/url], [url=http://static2.nexusmods.com/110/images/110/5012795-1374200800.png]Part 3[/url], or [url=http://static1.nexusmods.com/110/images/110/5012795-1374206162.jpg]Full[/url]\r\n\r\n1.\tGo to an alchemy table that had an extractor and diffusor (Ex. Arcadia\\'s Cauldron in Whiterun or Sleeping Giant Inn in Riverwood) or use the portable Alchemy Extractor and Alchemy Diffusor. (They will be in the Miscellaneous section of your inventory. Click on either the Alchemy Extractor or the Alchemy Diffusor, then exit the inventory menu. The crafting menu will then open.)\r\n2.\tSelect the chemical ingredient you want to make.\r\n   Ex. Deathbell (Damage Health) -- >Venom\r\n3.\tLeave that crafting menu and use the alchemy table\r\n4.\tSelect \\\"Damage Health Poison\\\" -- >Turns 3 Venom into a Damage Health Poison\r\n[size=6] [b] [u] Portable Tools - Alchemy Extractor and Alchemy Diffusor\r\n [/b] [/u] [/size]\r\n  -They can be crafted at the forge in the Misc category. You need 1 steel ingot to forge each of them. \r\n\r\n  -Once crafted they will be in the Misc section of your inventory. To use one of them simply click on the item (still in your inventory) to use it. Then leave your inventory, and the menu will open.\r\n\r\n*quantumbutterfly\\'s tools each required a refined malachite ingot to craft (In vanilla refined malachite can\\'t be bought until level 18, and some smithing overhauls require perks to smelt them from ore). Since these tools are such an essential part of the mod I wanted them to be easily accessible from an early point in the game. Particularly since at this time I don\\'t have any plans to add more static tools to Skyrim.\r\n[size=6] [b] [u] Recipe List\r\n [/b] [/u] [/size]\r\n.Pdf and .Docx versions are available in the Miscellaneous section of the downloads, and with the .esp\r\n\r\n[img]http://static1.nexusmods.com/110/images/110/5012795-1374622215.png[/img]\r\n[img]http://static2.nexusmods.com/110/images/110/5012795-1374622267.png[/img]\r\n\r\n[size=6] [b] [u] Compatibility\r\n [/b] [/u] [/size]\r\n-Conditional SkyRe compatibility (if this is untrue or has changed please let me know since I do not use SkyRe): Chemistry must go after SkyRe in the load order. This will give you the Chemistry perk tree. You will not get the stuff added by the SkyRe tree.\r\n\r\n-May conflict with things that change Alchemy perks\r\n\r\n-Ingredients added by other mods will not be usable.  I may make other patches if requested.\r\n\r\n-Mods that change the placement of vanilla alchemy tables may leave the diffusor and extractor floating in the air or sitting somewhere odd. If it bothers you, you can use the console to disable the wayward item(s).\r\n\r\n-Should be compatible with everything else, please let me know if you find a conflict.\r\n\r\n-*No Longer needed* quantumbutterfly\\'s Portable Alchemy Tools (http://skyrim.nexusmods.com/mods/32932/ (Portable Extractor and Diffusors). As of Chemistry version 0.2 these are redundant. They should not cause a conflict if you leave them installed, but are now unnecessary since the same functionality is included in my mod. Leaving it installed will just mean there are two different sets of portable tools.\r\n\r\n[size=6] [b] [u] Known Issues/Bugs:\r\n [/b] [/u] [/size]\r\n-Fortify Alchemy enchantment doesn\\'t work. See FAQ for more info.\r\n-Portable alchemy tables added by other mods bring up the original alchemy menu, not the one used by this mod. There\\'s nothing I can do about that.\r\n-These potions can\\'t be used in quests where you give an npc a healing potion. I have no experience with quests in the CK, so it\\'ll likely take me a while to figure out why this is happening, much less how to fix it.\r\n-NPC\\'s may bump you aside while you are using the Extractor or the Diffusor.\r\n-The following potions cannot be broken down into components by this mod. This is intentional.\r\n     --Esbern\\'s Potion\r\n     --Falmer Blood Elixir\r\n     --Philter of the Phantom\r\n     --Potion of Blood\r\n     --Vaermina\\'s Torpor\r\n     --Redwater Skooma\t\r\n     --Sleeping Tree Sap\r\n\r\n[size=6] [b] [u]FAQ\r\n [/b] [/u] [/size]\r\nQ: Is there a way to prevent the knowledge of what ingredients do unless you have the required perks or mix them? I don\\'t need to have eaten an ingredient (don\\'t know their effects) but I\\'m still able to take the effects with the Diffuser/extractor?\r\nA: To the best of my knowledge (and FOEnthusiast’s) there is no way to have a recipe check whether or not you know what the effects of an ingredient are.\r\n\r\nQ: What do the first perks in the Alchemy perk tree do now that potion effects are a fixed number? I don\\'t see any improvement from putting points into it?\r\nA: The effects of every potion and poison (besides Doom and Elixir) will upgrade with every point you put into the first perk, \\\"Alchemist.\\\" This does not apply to potions that have previously been crafted. If this isn\\'t working for you for a particular potion let me know which one, if it isn\\'t working for all of them, then there is probably a mod compatibility issue, but still let me know.\r\n\r\nQ: Alchemy Enchantments don’t work.\r\nA: To cut down on inventory clutter FOEnthusiast created potions with standardized strengths. It’s the Alchemist perks (1-5) that determine if a healing potion heals for 50 or for 100. The result is that the enchantment no longer works since the variable it affects isn\\'t part of how potions are made with this mod. I may change the enchantment at some point, but I have no idea what I would change it to or how I would make the change function. I’m open to suggestions.\r\n\r\nQ: What are the “valve” and “knob” on the extractor and diffusor for?\r\nA: The valve, the knob, and the spigot do absolutely nothing, they\\'re just decorative - trying to hide the fact that the extractor is a tiny smelter with a spigot and the diffusor is a mini dwemer boiler with a valve jammed in it.\r\n\r\nQ: Does it change the ID codes of ingredients?\r\nA: All of the vanilla ID codes of the vanilla ingredients and potions remain unchanged. All of the vanilla potions remain in game and do appear in the loot tables.\r\n\r\nQ: How much damage does the “Doom” poison do?\r\nA: They do 750 points of damage to Health, Stamina, and Magicka.\r\nFOEnthusiast intended them to do a deadly amount of damage, by having them do the 750 points of damage just to health. Quote “Doom potions are costly and strong enemies resist most poisons.” \r\nIn my game they were working on most opponents, but not doing anywhere near enough damage to kill, so I added the stamina and magicka damage. I may still rebalance the numbers at some point.\r\n\r\nQ.Why are the chemical recipes at the Extractor and Diffusor instead of having all of the recipes at the Alchemy Table?\r\nA:That many recipes all in one place is possibly going to cause crafting menu freezing and crashing for some people. Also at this point it would be an incredible amount of work and time since each recipe would have to be moved individually. That\\'s over a thousand recipes just for one esp. I would need to do that for four esps. \r\n\r\nQ:What about using this mod with custom player homes? There aren\\'t any Extractors or Diffusors on those Alchemy Tables.\r\nA:That\\'s why I added the \\\"Portable Extractor\\\" and the \\\"Portable Diffusor\\\", so use those. While someone could place them at the table manually, the portable tools are much easier. \r\n\r\n[size=6] [b] [u]Installation and Upgrading\r\n [/b] [/u] [/size]\r\nFirst Time Installation: Add .esp to data folder manually or install with NMM\r\n\r\nUpdating: \r\n-If from Chemistry 0.2 or later replace the previous version with the new version either with NMM or manually.\r\n\r\n-If up from Chemistry 0.1: Tell NMM \\\"yes\\\" you want to update. \r\n\r\n*If you have \\\"quantumbutterfly\\'s Portable Alchemy Tools\\\" installed. You no longer need them. If you choose to leave that .esp installed (since it does have a script for when you use the tools) it should not cause any problems with my mod, you\\'ll just have two types of portable tools that ultimately do the same thing.\r\n\r\n-If from one of FOEnthusiast\\'s files change the name of my .esp file to the name of the version you have been using. If you don’t you\\'ll lose any of this mods potions or ingredient that you have already crafted.\r\n\r\n[size=6] [b] [u] To Do - In No Particular Order\r\n [/b] [/u] [/size]\r\n-I may make variations (Ex. quantumbutterfly\\'s lore-friendly) or plugins for other mods that add ingredients if requested, or I add such a mod to my own game. \r\n-add portable alchemy table\r\n\r\n\r\n**Note - This was made using [url=http://skyrim.nexusmods.com/mods/16665]Chemistry 2.9[/url] the non-Hearthfire version as a base. Until I started working on this mod I used the Hearthfire version in my own playthroughs, so I may have missed a few duplicate entries or other errors. Please let me know if you find any. Also keep an eye out for any vanilla potions that are not breaking down into components.\r\n\r\n [size=6] [b] [u] Credits\r\n [/b] [/u] [/size]\r\nThanks to FOEnthusiast for the original Alchemy Overhaul - Chemistry (and its description). I started with these files as a base and built on them. Also thank you for answering all my questions. I also used several pieces of the description and some of the screenshots.\r\nThanks to quantumbutterfly from whom I picked up the project of making bulk recipes for Chemistry. Also thank you for telling me how to create portable crafting tools, and for giving me the needed script.",
  "categoryId": "94",
  "version": "2.0",
  "author": "CattyFr",
  "createdUnix": "1373623101",
  "updatedUnix": "1375432241",
  "containsAdultContent": false,
  "uploadedBy": "CattyFr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038526",
      "name": "Chemistry 0_1",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "53",
      "fileName": "Chemistry-36389-0-1.7z",
      "uploadedUnix": "1373622736",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/18a9b85dbf8b9c73a8989b6f7ba4de8124df092dd8610c0177d2bd1c0e1aabff/analysis/1407640573/",
      "changelogHtml": " Changes Made from the original 2.9 Mod: \r<br />-Added Bulk Recipes for the following effects: \r<br />  Cure Disease \r<br />  Damage Health \r<br />  Damage Magicka \r<br />  Damage Magicka Regen \r<br />  Damage Stamina \r<br />  Damage Stamina Regen \r<br />  Fear \r<br />  Fortify Alteration \r<br />  Fortify Barter \r<br />  Fortify Block \r<br />  Ravage Health \r<br />  Ravage Magicka \r<br />  Ravage Stamina \r<br />  Regenarate Health \r<br />  Regenerate Magicka \r<br />  Regenerate Stamina \r<br />  Restore Health \r<br />  Restore Magicka \r<br />  Restore Stamina \r<br />-Fixed any missing ingredients from those effects <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chemistry-36389-0-1.7z?fid=1000038526&ttl=1535815532&ri=8192&rs=8192&setec=b4d84e5eab7441b45733c4883ee80397"
    },
    {
      "fileId": "1000038616",
      "name": "Chemistry Recipes List",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "106",
      "fileName": "Chemistry Recipes List-36389-.7z",
      "uploadedUnix": "1373665492",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c35f46a09000cce112bf99f00159984cc3466a4626c92897275b06459ab3ffa4/analysis/1407641226/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chemistry%20Recipes%20List-36389-.7z?fid=1000038616&ttl=1535815533&ri=8192&rs=8192&setec=d1bbc6915e1858b940b9cfd586490925"
    },
    {
      "fileId": "1000039032",
      "name": "Chemistry 0_2",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "272",
      "fileName": "Chemistry-36389-0-2.7z",
      "uploadedUnix": "1373878047",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/59a776b626e78797f6ebda9065cd662137a74a8a468540de8575de1dc77190fa/analysis/1407644823/",
      "changelogHtml": " Version 0.2\r<br />-Added Portable Extractor and Diffusor\r<br />-Fixed Fluorine spelling error *How long has &#39;that&#39; been there? I&#39;ve been using one version or another of the orignal mod for over a year and I&#39;ve never noticed before...*\r<br />-The Forify Beast potion no longer requires Neurotxin (not available without the Experimenter 2 perk) and instead uses Potassium\r<br />-Fixed Mutagen. The Slow poison could be crafted without any perk, but the Mutagen used to make it was requiring one of several higher level perks. This requirement has been removed.\r<br />-Added Bulk Recipes for the following effects: \r<br /> Slow\r<br /> Waterbreathing\r<br /> Invisibility\r<br />\r<br />-Added Bulk Recipes for the following potions:\r<br /> Restore Health\r<br /> Restore Magicka\r<br /> Restore Stamina <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chemistry-36389-0-2.7z?fid=1000039032&ttl=1535815533&ri=8192&rs=8192&setec=cd83d9a4bcf6443ed4259cbb7c199a65"
    },
    {
      "fileId": "1000039586",
      "name": "Chemistry 0_3",
      "version": "0.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6670",
      "fileName": "Chemistry-36389-0-3.7z",
      "uploadedUnix": "1374201855",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/85e934eaf788b0312e16221dd3d8eca750216775f55ab73e4e9d5944a4574c37/analysis/1407648763/",
      "changelogHtml": " Version 0.3\r<br />-Fixed a few duplicate recipes\r<br />-Added Bulk Recipes for the following effects: \r<br /> Weakness to Fire\r<br /> Weakness to Frost\r<br /> Weakness to Magic\r<br /> Weakness to Poison\r<br /> Weakness to Shock\r<br /> Resist Fire\r<br /> Resist Frost\r<br /> Resist Magic\r<br /> Resist Poison\r<br /> Resist Shock\r<br />\r<br />-Added Bulk Recipes for the following potions:\r<br /> Damage Health\r<br /> Damage Magic\r<br /> Damage Stamina\r<br /> Slow\r<br /> Stimulant of Warriors\r<br /> Stimulant of Tacticians\r<br /> Stimulant of Mages\r<br /> Poison of Paralysis\r<br /> Poison of Fear\r<br /> Poison of Frenzy\r<br /> Dampener Poison\t\r<br /> Potion of Defiance\r<br /> Potion of Cure\t\r<br /> Potion of Waterbreathing\r<br /> Potion of Invisibility\r<br /> Poison of Exhaust\t\r<br /> Poison of Mute\r<br /> Elixir\t\r<br /> Doom\r<br /> Poison of Agony\r<br /> Poison of Despair\r<br /> Poison of Affliction\r<br /> Poison of Misery\r<br />-Removed some leftover vanilla text from the descriptions of the Benefactor and Physician perks.\r<br /> <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chemistry-36389-0-3.7z?fid=1000039586&ttl=1535815534&ri=8192&rs=8192&setec=924c387e5de547d5c9552f70f684112f"
    },
    {
      "fileId": "1000039597",
      "name": "Chemistry Documents",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6612",
      "fileName": "Chemistry Documents-36389-.7z",
      "uploadedUnix": "1374207061",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1cd4c3df6c22bd1d5d82d4388c1b3558d958ca06318712559ffedfa899f83483/analysis/1407648798/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chemistry%20Documents-36389-.7z?fid=1000039597&ttl=1535815534&ri=8192&rs=8192&setec=4a13acff9cbaa8304dd5fd52bc45d429"
    },
    {
      "fileId": "1000040351",
      "name": "Chemistry 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6697",
      "fileName": "Chemistry-36389-1-0.7z",
      "uploadedUnix": "1374622620",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/36dde55e7d2ba610a6a86ad6c700f12d443baf8cb3ada10aef2b532f9fa5ec37/analysis/1407654085/",
      "changelogHtml": " Version 1.0\r<br />-Fixed inconsistancies in several of the levels of the Fortification potions\r<br />-Added Fortify Chevalier, Fortify Paladin, and Fortify Shadowmage potions\r<br />-Finished adding bulk recipes for the rest of the potion and ingredients <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chemistry-36389-1-0.7z?fid=1000040351&ttl=1535815535&ri=8192&rs=8192&setec=79caa023c284390151e9d55574362947"
    },
    {
      "fileId": "1000040354",
      "name": "Chemistry Documents",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "6629",
      "fileName": "Chemistry Documents-36389-1-0.7z",
      "uploadedUnix": "1374622680",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e210620aa8aa971fa0177af1ffc7fe4663fe609cf925d90b247aa46e0e27e1e0/analysis/1407654088/",
      "changelogHtml": " Version 1.0\r<br />-Fixed inconsistancies in several of the levels of the Fortification potions\r<br />-Added Fortify Chevalier, Fortify Paladin, and Fortify Shadowmage potions\r<br />-Finished adding bulk recipes for the rest of the potion and ingredients <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chemistry%20Documents-36389-1-0.7z?fid=1000040354&ttl=1535815535&ri=8192&rs=8192&setec=b72ef7516a7d3cc2186106751f34d79f"
    },
    {
      "fileId": "1000043460",
      "name": "Chemistry 2_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6970",
      "fileName": "Chemistry-36389-2-0.7z",
      "uploadedUnix": "1375432241",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/451571ef4a2766f5a3701f829d1923da265c1809aa517e4dec4a19aaf597ccf0/analysis/1407666247/",
      "changelogHtml": " Version 2.0\r<br />-Added DLC patches\r<br />-Added installer\r<br />-Fixed mislabeling off level 6 restore potions (They were saying they healed completely but they were not supposed to heal more than 175)\r<br />-Added labled potions options\r<br />-Added Heal-over-time options <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chemistry-36389-2-0.7z?fid=1000043460&ttl=1535815535&ri=8192&rs=8192&setec=5cbf690690a36bbd77717b8ab7de335b"
    }
  ]
}