{
  "modId": 36392.0,
  "modName": "Thanes Basement II",
  "summary": "This is a magnificent lore friendly basement for Breezehome, worthy of the title \\\"Thane\\\".\r\nWell constructed and comfortable, it provides all a successful Thane would want or expect.\r\nIt is not to big or unbelievable and offers an alternate rout out of Whiterun.\r\nThe dungeon also serves as a player home as well, once it has been cleansed of evil!\r",
  "descriptionHtml": "[IMG]http://imageshack.us/a/img202/73/everythingfullyfunction.jpg[/IMG]\r\n\r\n[size=200][color=#ffff00][b]Description[/b][/color][/size]\r\n\r\nThis is a magnificent lore friendly basement for Breezehome, worthy of the title \\\"Thane\\\".\r\nWell constructed and comfortable, it provides all a successful Thane would want or expect.\r\nIt is not to big or unbelievable and offers an alternate rout out of Whiterun.\r\nThe dungeon also serves as a player home as well, once it has been cleansed of evil!\r\nAlso there are lot\\'s of hidden treasures and secrets so be thorough! Look for vines to climb \r\nand other hidden secrets!\r\nBelow is a list of some of what it has to offer.\r\nThis is a Non-Activateble quest, it is a clue following quest.\r\n\r\n[size=200][color=#ffff00][b]Details[/b][/color][/size]\r\n[IMG]http://img22.imageshack.us/img22/1104/thanesbasementii.jpg[/IMG]\r\n\r\nSorry about my shite voice acting. I\\'m an HVAC mechanic, not Robin Williams!\r\n\r\n\r\n\r\n[size=200][color=#ffff00][b]Story[/b][/color][/size]\r\n\r\nThe previous Thane is missing and you must find out what happened to him. A stranger contacts \r\nyou with information about the whereabouts of the old Thane. Join him and search for clues, or \r\ngo at it alone! The choice is yours! \r\nGain entry to the Old abandoned Smuggler\\'s tunnels. Unfortunately, all who delve into the old \r\ntunnels never return. \r\nStrange noises are heard coming from the old well and no one knows what became of the old \r\nsmugglers. One day the black market supply coming into Whiterun just suddenly ceased and the \r\nJarl took all the credit for vanquishing the smugglers and cleaning up Whiterun. \r\nBut it is said that a terrible curse befell the smugglers because they dug through and \r\ndesecrated ancient graves just to get their tunnels dug. \r\nAt midday a horrible unbearable stench emanates from the old well. Perhaps the smugglers are \r\nall dead!\r\n\r\n[size=200][color=#ffff00][b]Location[/b][/color][/size]\r\n\r\nThe hatch to the basement is under the stairs in Breezehome hidden under some hay alone with a \r\nyour first clue.\r\n\r\n\r\n[size=200][color=#ffff00][b]Installation[/b][/color][/size]\r\n1. This should work fine with NMM or your favorite mod manager.\r\n2. Manual download- Extract the files to a temporary location. Copy the files to \\\\Skyrim\\\\Data\\\\ \r\nor steam steamapps\\\\common\\\\skyrim\\\\Data\r\n\r\n[size=200][color=#ffff00][b]Uninstallation[/b][/color][/size]\r\n\r\n1. Remove all your stuff out of Thanes Basement and the dungeon home too. Then, in data files, \r\nUncheck and delete. If you need to delete everything that came with this mod then do this.... examine the contents of the whole mod folder and delete all the corresponding files.\r\n Or use Nexusmodmanager\r\n\r\n\r\n[size=200][color=#ffff00][b]Incompatibility[/b][/color][/size]\r\n\r\nIt will be incompatible with mods that have a door in the same place as the basement-\r\ndoor. Or if a mod is at the same location as the cemetery. It\\'s located by Chillfurow farm. The \r\nbasement hatch is under the stairs hidden under some hay.\r\n\r\n\r\n[size=200][color=#ffff00][b]Issues or Bugs[/b][/color][/size]\r\n\r\nIt can be a little hard to retrieve weapons from a couple of plaques on the walls for some \r\nreason I don\\'t know why this is. But it\\'s not a biggy, just type TCL in the console, retrieve \r\nweapons and then type TCL again when done.\r\nWhen you first enter the basement the weapons will fall off plaques the first time but it never \r\nhappens again, the mannequins will move only once and never do it again. don\\'t know why this is \r\neither.  \r\n\r\nImportant, When you first load, save, then load your save. Then save again, then load that save. And everything should work properly including the voice.\r\n\r\n[size=200][color=#ffff00][b]Authors Notes[/b][/color][/size]\r\n\r\n1. Sorry I know there is a lot of Breezehome basement mods out there but this one is the best \r\nin my opinion. I only choose Breezehome because \r\nI like it and it\\'s the only home I own at the moment, hope you agree.\r\n\r\n2. Lanterns and campfires can be turned off or on but the activator is invisible, so look at \r\nthe target lantern or fire good.\r\n\r\n3. Some Vines can be climbed!\r\n\r\n\r\n\r\n[size=200][color=#ffff00][b]Contact me[/b][/color][/size]\r\n\r\nKnightRangersGuild on Skyrimnexus or KnightRangersGuild@yahoo.com\r\n\r\n[size=200][color=#ffff00][b]Some of my other mods[/b][/color][/size]\r\n\r\nhttp://skyrim.nexusmods.com/mods/32823/?  http://skyrim.nexusmods.com/mods/30704/?  http://skyrim.nexusmods.com/mods/26590/? http://skyrim.nexusmods.com/mods/31635/?  http://skyrim.nexusmods.com/mods/23415/? http://skyrim.nexusmods.com/mods/29526/? \r\n\r\n\r\n[size=200][color=#ffff00][b]Credits[/b][/color][/size]\r\n\r\nThanks to Bethesda for creating Skyrim and the Creation Kit.\r\nThanks to Paintings and Frames by Artisanix for letting me use these wonderful frames... http://skyrim.nexusmods.com/mods/17423\r\n\r\n[size=200][color=#ffff00][b]Tools Used[/b][/color][/size]\r\n\r\nSkyrim Creation Kit, lot\\'s of coffee, cigarettes, beer, bottle of Johnny Walker blue label, some Argonian marshweed and my brilliant imagination.\r\n\r\n[size=200][color=#ffff00][b]Permissions[/b][/color][/size]\r\n\r\nDo not upload without my permission. If you want to change things or use this mod for one of \r\nyour uploads you can, just \\\"OK\\\" it with me first and credit me as the original author.\r\n\r\n\r\n[size=200][color=#ffff00][b]*SPOILER*[/b][/color][/size]\r\n\r\nFor Loners or for Players of a lower lvl and for cheaters. I do encourage you to at least try to complete the quest at some point as it is very fun and you get a lot of money and great rewards!\r\nYou can bypass the quest if you so desire using the console to unlock the hatch and use the basement. It will not break the quest in any way and you can try the quest at any time!\r\nAnyway, here it is...There is a hidden Smuggler\\'s cache at the beginning of the dungeon at the well near Chillfurrow farm, there is a dead tree nearby just outside the cemetery... look at the very bottom of the tree towards the water and look down. You should be able to see the words but not the actual cache because it\\'s invisible. But, inside will be some goodies to help you complete the dungeon. Be warned, this quest will still prove difficult even with the help cache. It only took me 22 tries, lol. \r\nGood luck! Ha, ha, ha,ha....!!!",
  "categoryId": "67",
  "version": "II",
  "author": "KnightRangersGuild",
  "createdUnix": "1369443880",
  "updatedUnix": "1369439663",
  "containsAdultContent": false,
  "uploadedBy": "KnightRangersGuild",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031300",
      "name": "Thanes Basement II",
      "version": "II",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15619",
      "fileName": "Thanes Basement II-36392-II.7z",
      "uploadedUnix": "1369439663",
      "modVersion": "II",
      "virusScanUrl": "https://www.virustotal.com/file/0b89949c3721bb5a531a9891b8e71a60206afd25fed84847c6dc215dfcc6f1cb/analysis/1407580576/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thanes%20Basement%20II-36392-II.7z?fid=1000031300&ttl=1535815540&ri=8192&rs=8192&setec=d51fa7be0feb83d81284ba289bd3305c"
    }
  ]
}