{
  "modId": 36409.0,
  "modName": "Draconic and Ebene Armor",
  "summary": "Like the best armor ? LETS GO WARRIOR",
  "descriptionHtml": "-------------------------------------------------------------ENGLISH-TEXT---------------------------------------------------------------\r\n\r\nHi guys , do you like this armor ? download ! sorry i\\'m french so convert the french text in english !\r\n\r\n-----------------------------------------------------------TEXTE-FRANCAIS----------------------------------------------------------\r\nSalut ! Vous pouvez Forger une armure en os de dragon est à la fois digne et cruelle. \r\nÊtre capable de forger une armure en os de dragon requière des connaissances extrêmes, un vrai maître forgeron peu d\\'ailleurs réussir à fusionner cette dernière avec de l\\'ébonite pour en faire un alliage à la fois résistant et souple, la souplesse provient de l\\'ébène. \r\nLes talents de ses maîtres forgerons sont d\\'ailleurs capables de rivaliser avec la qualité et la finition des armures deadriques !\r\n\r\nL\\'armure d\\'ébène en os de dragon s\\'obtient en fusionnant la résistance de l\\'os de dragon et la souplesse de l\\'ébène ! \r\nBien qu\\'elle soit considérée comme une armure en os de dragon classique, elle demandera tout de même la connaissance de l\\'ébène dans l\\'arbre de compétence ainsi que bien entendu celle de la forge draconique !\r\n\r\n* Toutes les forges permettent de la fabriquer.\r\n* Nécessite les compétences forge draconique et forge d\\'ébène, l\\'armure se trouve dans la catégorie draconique à la forge.\r\n* L\\'armure possède différents design, les valeurs sont toutes identiques, c\\'est juste un choix d\\'esthétique qu\\'il reste à faire...\r\n* Un bouclier est également présent dans le lot.\r\n* Il n\\'y a pas de problème de compatibilité entre les races que vous soyez Khajiit, Argonien ou humains.",
  "categoryId": "54",
  "version": "1.4c",
  "author": "Dreogan",
  "createdUnix": "1369482541",
  "updatedUnix": "1369482541",
  "containsAdultContent": false,
  "uploadedBy": "bitaudgaby",
  "primaryFile": null,
  "files": []
}