{
  "modId": 36402.0,
  "modName": "Silks of the Victor",
  "summary": "My first skyrim mod. First release, to be optimized and improved.\r\nA unique variant of General Tulius\\' armor.",
  "descriptionHtml": "My first skyrim mod, a throwback to my all time favourite armor of Diablo 2. I\\'ve been attempting a retexture but I think it will take me far too long to figure out how to do it with 0 experience.\r\n\r\n1: Installation/Update\r\n   - Download the mod navigate to your data folder(c:/programfiles(x86)/steam/steamapps/ common/skyrim/data) drag and drop the esp. Activate the ESP by checking the box under datafiles of the launcher (if it doesnt show up in there u may have done something wrong). If you are updating to a new version, do the same, but select copy and replace when the dialogue box shows up.\r\n\r\n2: Location:\r\n - The armor is found in a player owned novice locked chest inside the Drunken Huntsman. (it is a player chest as well so you should be able to use it as storage before you get breezehome).\r\n\r\n3: Description\r\n - The armor has a custom enchantment : Fortify shouts 15%, Poison cloud sneak effect (boethia, 15), resist magic 25%, resist dmg(25%),Lover\\'s comfort : health 25 (intended to be the 25% increase in skill gain) i am still working out the kinks and i havent done much testing of the armor yet. I am planning on testing it out tonight to see if it works as i intended.\r\n\r\nI am looking for someone to make me a custom texture similar to the Silks of the Victor from diablo 2(activision-blizzard) I would like the blank/formed part of the chest to feature a silver werewolfesque head with gold accents and glowing (if possible) Gemstones for eyes, with crimson/(dark/blood red) accents on the armor (spray paint tool, like splattered blood collecting in the formed chest) Also my last request for the retexture would require some collaboration because i would like a glowing inscription on the armor in daedric or the dragon tongue that says \\\"Woven from the hair of the Defeated\\\" This is beyond me currently and i suck too badly to figure it out it seems.",
  "categoryId": "54",
  "version": "0.1.2",
  "author": "LtAscott",
  "createdUnix": "1369534154",
  "updatedUnix": "1369665422",
  "containsAdultContent": false,
  "uploadedBy": "LtAscott",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031678",
      "name": "Silksofthevictor",
      "version": "0.1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Silksofthevictor-36402-0-1-2.rar",
      "uploadedUnix": "1369665422",
      "modVersion": "0.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e6c45a7dd3e6a60594565ef8d84fcce92cf47efff22b6d6eeaf3a8f726d3598a/analysis/1407583402/",
      "changelogHtml": " Added sword; soul snare, crit effect on death : Dark ritual power(15% chance) absorb health 25 points, paralyze 3 seconds, soul trap 5 seconds. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Silksofthevictor-36402-0-1-2.rar?fid=1000031678&ttl=1535815554&ri=8192&rs=8192&setec=8b8ff729737947c3fc3b71674c544713"
    }
  ]
}