{
  "modId": 36419.0,
  "modName": "The Ladys Heart",
  "summary": "Adds the beautiful and capeable Lady Tamriel, as well as her love and guardian, Auron.",
  "descriptionHtml": "***Please browse through entire description****  It\\'s all important!\r\n\r\n**Please be advised**  This is my first time releasing one of my follower mods, I normally make them just for me, and so I need someone brave to test the waters for me, to see if I\\'ve done what it takes to make this run on other peoples skyrim set ups!\r\n\r\nIf it turns out that I did this right and they work for you and not just me, PLEASE Endorse, and I will take the time to learn to do more extensive things and you can look forward to many more follower mods in the future.\r\n\r\nUFO is optional of course, but you will need it to get both followers to follow you at once.\r\n\r\nNPC\\'s are found at Honningbrew meadery - they cannot be married as they are married to eachother.\r\n\r\n\r\n\r\nThis Mod REQUIRES!!!!:\r\n\r\n\r\n\r\nApachii Sky Hair - http://skyrim.nexusmods.com/mods/10168//?\r\n\r\nThe Eyes of Beauty - http://skyrim.nexusmods.com/mods/13722//?\r\n\r\nPretty Face - http://skyrim.nexusmods.com/mods/7887//?\r\n\r\nTera Armor Collection - http://skyrim.nexusmods.com/mods/25846//?    (needs to be this one! can\\'t be any other tera armor mod.  Having others installed is okay, but this one needs to be as well)\r\n\r\n\r\n\r\n**Optional/Unsure if needed or not**-- I use them, and am not sure if your skyrim will demand them, or use your textures and meshes instead.\r\n\r\nFor the followers to look exactly like they do in the screen shot I am using the following:\r\n\r\n\r\nApachii Hair, Natural Retexture - http://skyrim.nexusmods.com/mods/35092//?\r\n\r\nBetter Males - http://skyrim.nexusmods.com/mods/2488//?\r\n\r\nMature skin texture and body for UNP - http://skyrim.nexusmods.com/mods/32986//?\r\n\r\nDemonized UNP - http://skyrim.nexusmods.com/mods/6709//?\r\n\r\n\r\n\r\nAnd last but not least, everything is portrayed beautifully by Sharpshooters ENB\r\n\r\n\r\n\r\nThe Mods Lore:\r\n\r\n\r\n\r\nLady Tamriel is mostly unheard of, Born of a royal blood line lost to the history books due to generations of betrayal.  Her parents long dead she travels now with the love of her life, and sword protector Auron.  You\\'ve met them before... in your journeys before finding yourself lost in skyrim among it\\'s cival war and turmoil.  The three of you have all taken turns saving each others lives, and you all miss each other dear.\r\n\r\nLady Tamriel and Auron heard that you were in skyrim, and have come to find you, knowing you need no savior, they have instead come to reminisce over a drink at the Honningbrew meadery near Whiterun.  Meet them there, and you may yet again relive the good old days.\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "66",
  "version": "1.3",
  "author": "MattBeer aka Incarnum",
  "createdUnix": "1369505687",
  "updatedUnix": "1369508078",
  "containsAdultContent": false,
  "uploadedBy": "mattbeer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031417",
      "name": "The Ladys Heart Main File",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1391",
      "fileName": "The Ladys Heart Main File-36419-1-3.zip",
      "uploadedUnix": "1369508078",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/c8842cd31034af9afa8730d4ddacfaa3f229577253e1fa2c922bc5db1b1cca30/analysis/1407581407/",
      "changelogHtml": " fixed an issue where Lady Tamriel&#39;s upper half was a black woman and her lower half was a white woman. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ladys%20Heart%20Main%20File-36419-1-3.zip?fid=1000031417&ttl=1535815579&ri=8192&rs=8192&setec=9f30856116b427f779e9140a2b7c4540"
    }
  ]
}