{
  "modId": 36427.0,
  "modName": "Lakeview Armory redone",
  "summary": "An improvement to Lakeview Manor\\'s Armory wing",
  "descriptionHtml": "Once I built the Armory in Lakeview Manor, I was disappointed with how lackluster it was. It just did not have the display capacity I wanted. This mod sets out to change that. \r\n\r\nThis is my second Lakeview remodel mod. The first was the Main Hall/Entryway (http://skyrim.nexusmods.com/mods/36191/?). I have decided to upload these as separate mods for maximum flexibility and compatibility. \r\n\r\nHere is a complete list of changes: \r\n\r\nWhat is gone: \r\n\r\n1) The workbench, grinding wheel and tanning rack. You already have these outside and in the cellar. How many more does one person need? \r\n\r\n2) The mounted heads. How many dead animals do you need in one house? \r\n\r\n3) The clutter, dressers, center table and rug. These simply did not belong, as they had nothing to do with the displaying of armor and weapons. \r\n\r\n4) The two noble dividers (and the weapon/shield racks on them) were removed for the sake of symmetry. \r\n\r\nWhat is new: \r\n\r\n1) Five additional mannequins, two placed in the corners on raised stands like the others, three placed by the doors on floor level. Please note that the mannequins in the pictures are not the mannequins you will get - I use female mannequins for Hearthfires mod. Without that mod you will have plain wooden ones. \r\n\r\n2) The stuffed heads were replaced with shield plaques. Two more shield plaques were added, one on the north wall, another on the south. \r\n\r\n3) Two pairs of wooden weapon racks were placed on each side of the corner mannequins. \r\n\r\n4) Two large weapon cases were placed in the center of the room, with enough space between them to open both lids without clipping. These will display your large weapons quite nicely, but won\\'t hold staves. \r\n\r\n5) Two noble dividers were placed against the interior wall (one on each side of the door). Each one holds three weapon plaques. \r\n\r\n6) Two additional dagger display cases opposite the original ones. In addition, each has been provided with a trigger to properly store and display your favorite daggers. \r\n\r\n7) There is a long noble chest behind the north dagger display stands (for storing mage staves), and a thin table behind the south dagger display stands to place other objects on. \r\n\r\nIn total, this mod gives you 5 more mannequins, 5 more shield plaques, 6 more weapon plaques, 4 more wooden weapon racks, two more dagger cases, and two more large cases. All without feeling cluttered or overwhelmed. \r\n\r\nInstalling: \r\n\r\nManual:  Just drop the esp file into your Skyrim data directory and enable with your preferred loader.\r\n\r\nIf you have not built the house yet, you need to build the Armory wing. But do NOT build any of the inside furniture. Everything should already be there for you. There are some things on the exterior you will have to build as normal.  Then just disable the workbench as normal and you are done. \r\n\r\nIf you have already build the armory, you will have a mess of old and new clipping each other. This is a save-game issue, and you will have to use the console to clean up. Just open the console (~), select the offending item and type \\\"markfordelete\\\" without the quotes. The next time the cell loads, the item will be gone. You should be sure to remove any items you don\\'t want to risk losing, just to be safe. And save (not quicksave) before you attempt this, just in case something goes wrong and you end up deleting the floor. \r\n\r\nIssues: Some of the mannequins like to shift position slightly, sometimes even falling through to the floor. Equipping something on them seems to snap them back into place. I cant figure this out, but its relatively minor as far as mannequin bugs go. \r\n\r\nPlease see my other mods. I am leaning a lot as I go.",
  "categoryId": "67",
  "version": "1.01",
  "author": "jecoil",
  "createdUnix": "1369532880",
  "updatedUnix": "1372182169",
  "containsAdultContent": false,
  "uploadedBy": "jecoil",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031556",
      "name": "Lakeview Armory redone",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Lakeview Armory redone-36427-1-01.zip",
      "uploadedUnix": "1369590300",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/e024bbccdc131b27a7d6218a9fc2d494921b0809addf944e086772f7d4a70a2f/analysis/1407582496/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20Armory%20redone-36427-1-01.zip?fid=1000031556&ttl=1535815599&ri=8192&rs=8192&setec=7daaaa3c6aa47b6e76a1ba15766f705d"
    },
    {
      "fileId": "1000035795",
      "name": "Lakeview Armory man test",
      "version": "x001",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "Lakeview Armory man test-36427-x001.zip",
      "uploadedUnix": "1372182169",
      "modVersion": "x001",
      "virusScanUrl": "https://www.virustotal.com/file/4fea1494a2a6e9b091175a602bc27f2cb9bbfad6dd147c724a9ee62d590517c0/analysis/1407616692/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20Armory%20man%20test-36427-x001.zip?fid=1000035795&ttl=1535815599&ri=8192&rs=8192&setec=80779903c6a6eb0844d5e6d5d82955d6"
    }
  ]
}