{
  "modId": 36425.0,
  "modName": "Real Girls Realistic Body Texture for UNP UNPB and SeveNBase - WIP",
  "summary": "Photo-realistic body and face textures for Skyrim. - ALPHA VERSION WIP ",
  "descriptionHtml": "Note: This is still an [u]alpha[/u] WIP.  That hasn&#39;t changed (yet).  \r<br />\r<br />[line]\r<br />\r<br />V07 ROADMAP \r<br />-add subcutaneous veins layer (done) [improves distance viewing]\r<br />-add to body hair layer [improves distance viewing]\r<br />-add goose bump layer (done) [improves distance viewing]\r<br />-add to mole layer [improves distance viewing]\r<br />-refine fine skin details on arms (done)\r<br />-improve texture on neck (done)\r<br />-fix seams on neck (done)\r<br />-fix seams and dark spot on inner thigh (done)\r<br />-fix seams at wrists (done)\r<br />-fix seams at ankles (done)\r<br />-fix seams on inner arms (done)\r<br />-remove dark spot on butt (done)\r<br />-adjust color tone \r<br />-lighten dark spot under breasts (done)\r<br />-lighten various dark areas (always a wip)\r<br />-improve leg texture blend (done)\r<br />-add wrist detail\r<br />-add ankle detail\r<br />-complete hand texture\r<br />-complete foot texture\r<br />-redo texture on sides of torso (done)\r<br />-adjust contrast and transparency of various layers to balance close-up detail with distance viewing\r<br />-create custom .msn files (pushed back to v1 beta to reduce workload/decrease v07 delay after surgeries)\r<br />\r<br />PROGRESS REPORT\r<br />For those who don&#39;t know, I am undergoing surgery on my legs and knees which have several fractures after a car accident.  The surgeries have been broken down in to a series over three months due to some health complications.  I have my laptop and am continuing to work on this texture in between surgeries, long naps and vast quantities of drugs.  I&#39;ll post when I feel up to it.\r<br />\r<br />\r<br />10/05/14\r<br />-I had my third surgery last week.  Two more to go. But things are looking good. Thanks everybody for you support.  It means a lot.\r<br />\r<br />-These past couple of days I&#39;ve put some time in on the feet. It&#39;s been difficult due to the strange texture projection, especially between the toes.  And there seems to be some doubling up on textures (multiple triangles pointed to the same spot on the texture) so it is going to be a pain to get everything looking both detailed and continuous.  I&#39;ll keep at it though.  It will just take me a while.  I think the end result will be worth the effort.  Even if I have to struggle with it a while.  Screens of the new feet will be up as soon as they are done.  I promise.\r<br />\r<br />9/23/14\r<br />-Fixed all of the seams, both major and minor.  I will begin working on the ankles and feet next.  I will post again with screens when they are done.\r<br />\r<br />-The new version is coming along very well and I think those concerned that v05 looked better from a distance will be pleasantly surprised.  V05 had a lot of detail layers that I couldn&#39;t get done for v06 because I had to create an entirely new texture for it.  V07 adds those layers and details back in, and more&#33;\r<br />\r<br />9/13/14\r<br />-I made a discovery today.  Apparently Mudbox was not made to work with 8192 textures and working at 8192 is the cause of the mystery seams that keep reappearing along the ankles, wrists and neck.  Each time I edit anything in Mudbox it is apparently a crap-shoot.  Sometimes the seams are great and the next time they are not.  \r<br />\r<br />-The good/bad news is that I can now end the seam issues by working at 4096 and then upscaling the texture in photoshop.  This will result in a slightly reduced texture quality in those areas but I can only work with the tools I have.  Maybe someday there will be a better solution.  So I&#39;m back to redoing the seams... yet again.  But hopefully for the last time.\r<br />\r<br />-The upcoming version (07) is looking great otherwise though.  I feel like I am finally going to have a texture worthy of entering beta.  As I&#39;ve said previously, I had to make a whole new texture for v06.  But that was just the canvas on which the masterpiece will be painted.  \r<br />-With v07 I will be able to fine tune every little detail. There are so many things, so many layers, so many details, so many photoshop tools that I can use to fine tune and adjust every little detail.\r<br />\r<br />-I know sometimes I sound like I have a superiority complex when I write about Real Girls.  (And maybe I do. Though I hope not.)  So I&#39;m going to put it this way... In a short while, there will be a single body texture made for Skyrim that is equal in clarity and detail to a tricked out, enb-modded, realistically retextured Skyrim.  Finally, we will have characters that look as good as the rest of our modded game world.\r<br />\r<br />9/10-11/14\r<br />-Fixed the muddled sides.  Added some more tiny little moles. Adjusted a the overlay textures (skin detail, goose bumps, veins, moles, body hairs) a bit for better contrast to detail balance.  Fixed some more dark spots.  Blended the legs quite a bit (I may need to work on them again at some point but enough for v07). Fixed the tiny little ankle seam.  Fixed the wrist seams. Added part of the v05 texture back in to the lower abdomen as an overlay (because it looks awesome).  Did a major rework of the neck - looks way more detailed and is still seamless. Fixed a couple of layer order issues that were causing the appearance of seams when viewed close up.  \r<br />\r<br />-I got a lot done over the last couple of days.  I need to take a nap now.  I&#39;ll probably start adding to the body hair and mole layers tonight or early tomorrow morning.  (Don&#39;t worry hair and mole haters, these are mostly tiny little details you&#39;ll barely notice unless you look really close.)  That will be the last of the distance viewing improvements for v07.  The only thing left will be a couple of seam fixes and then on to the epic task of completing the hands and feet.  The good news is, v07 may be sooner than expected (crosses fingers).\r<br />\r<br />9/9/14\r<br />-Today I slept a lot, ate some sort of overcooked meatloaf-like substance and then pondered which was worse, a catheter, a diaper or the meatloaf-like substance.  I&#39;m still undecided.  I also decided I might need to redo the sides of the torso.  They look too muddled.  But maybe that&#39;s just the morphine talking.  \r<br />\r<br />\r<br />[line]\r<br />\r<br />[b]FILE DESCRIPTION[/b]\r<br />This file is both a skin texture for UNP and UNP variants and a resource for modders.  It \r<br />currently contains only diffuse body textures and a face normal map (optional).  If you are a \r<br />modder, permissions are covered below.  You do not need to contact me personally. - Zonzai\r<br />\r<br />Alpha version 06 is a completely new texture.  Compared to v05 it will probably appear to be \r<br />less detailed from a distance.  But the opposite is true.  It is seamless and much more finely \r<br />detailed than v05.  As a part of v07 I will be adding additional details to make the texture \r<br />look better at a distance.  Also note that the hands and feet, though more detailed than v05, \r<br />have some errors in them that I didn&#39;t have time to fix before leaving for three months.  These \r<br />flaws will be fixed in v07.  Please do not post images or send me PM&#39;s asking me about the\r<br />hands and feet.  PMs and images regarding the hands and feet will be deleted.\r<br />\r<br />Known Issues: There are a couple of spots with seams.  There are areas (especially the sides and\r<br /> hands and feet) with dark spots or light spots that need to be adjusted.  There are no new msn \r<br />files and seams still appear around the neck due to the old face msn.  The shading under the \r<br />breasts is too dark.  V06 is not optimized for distance view.  Residual seam issues and distance \r<br />view will be addressed in v07.  A full msn will be included as a part of v1.\r<br />\r<br />[line]\r<br />\r<br />[u]MAIN FILES[/u]\r<br />The main files contain 4096 ARGB, 4096 DXT1 and 2048 DXT1 diffuse textures for use on Skyrim \r<br />females.  \r<br />\r<br />[u]OPTIONAL FILES[/u]\r<br />Seren4XX has produced several very high quality optional face normal maps.\r<br />\r<br />[u]OTHER FILES[/u]\r<br />8192 TIF files are available as a  resource for modders.  \r<br />\r<br />[line]\r<br />\r<br />[b]REQUIREMENTS[/b]\r<br />You will need a UNP based body for these textures to work.\r<br />\r<br />[u]Compatible Bodies[/u]\r<br />[url=http://www.nexusmods.com/skyrim/mods/6709/?]UNP - http://www.nexusmods.com/skyrim/mods/6709/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/37900/?]UNPB - http://www.nexusmods.com/skyrim/mods/37900/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/40156/?]UNPC - http://www.nexusmods.com/skyrim/mods/40156/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/35748/?]UNPetite - http://www.nexusmods.com/skyrim/mods/35748/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/41051/?]UNP Topmodel - http://www.nexusmods.com/skyrim/mods/41051/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/36992/?]SeveNBase - http://www.nexusmods.com/skyrim/mods/36992/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/32540/?]UNPK TBBP body - http://www.nexusmods.com/skyrim/mods/32540/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/25461/?]HN66s Litheria - Race - BodyReplacer - Armors - http://www.nexusmods.com/skyrim/mods/25461/?[/url]\r<br />\r<br />[b]INSTRUCTIONS[/b]\r<br />1.) Install one of the bodies above.  \r<br />2.) [url=http://www.nexusmods.com/skyrim/mods/2812/?]Install Better Females By Bella (recommended for lip tint masks).[/url]\r<br />3.) [url=http://www.nexusmods.com/skyrim/mods/29791/?]Install NO More Ugly Bronze Shine (recommended for natural skin).[/url]\r<br />4.) Install these textures.\r<br />\r<br />[b]NORMAL MAPS[/b]\r<br />I recommend using either the default body normal maps or the Fitness Body normal maps along \r<br />with Seren4XX&#39;s face normal (found in the optional files section). If you use these, install \r<br />them after everything else.\r<br />\r<br />[b]RECOMMENDED FILES[/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/2812/?]Better Females by Bella - http://www.nexusmods.com/skyrim/mods/2812/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/29791/?]NO More Ugly Bronze Shine - http://www.nexusmods.com/skyrim/mods/29791/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/11770/?]Let&#39;s Get Naked - http://www.nexusmods.com/skyrim/mods/11770/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50835/?]Killers Realistic Skin SSS Patch for ENB - http://www.nexusmods.com/skyrim/mods/50835/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/49414/?]Pubic Hairstyle Overlayes for RaceMenu - http://www.nexusmods.com/skyrim/mods/49414/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/30179/?]Better Hand Mesh for UNP UNPB UNPC - http://www.nexusmods.com/skyrim/mods/30179/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/3666/?]FemFeet - [/url][url=http://www.nexusmods.com/skyrim/mods/3666/?]http://www.nexusmods.com/skyrim/mods/3666/?[/url]\r<br />\r<br />[b]GREAT SEXY ARMOR (that you probably missed)[/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/34160/?]Sexy Vanilla Female Armor - http://www.nexusmods.com/skyrim/mods/34160/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/47376/?]UNP Minidresses Collection - http://www.nexusmods.com/skyrim/mods/47376/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/55706/?]Leather & Lace - http://www.nexusmods.com/skyrim/mods/55706/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/57540/?]Vampire cuirass with chains - http://www.nexusmods.com/skyrim/mods/57540/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/57543/?]Vampire dark knight - http://www.nexusmods.com/skyrim/mods/57543/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/34308/?]Lingerie Set - http://www.nexusmods.com/skyrim/mods/34308/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/20966/?]TroubleMakers Forsworn Armor - http://www.nexusmods.com/skyrim/mods/20966/?[/url]\r<br />\r<br />[line]\r<br />\r<br />[b]MODS INCORPORATING THIS TEXTURE[/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/55761/?]Real Girls Realistic Body Texture for CBBE by [b]drunkenmojo [/b]- http://www.nexusmods.com/skyrim/mods/55761/?[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/57083/?]HN66s Hands and Nails for CBBE UNP SeveNbase Vanilla by [b]humannature66 - [/b]http://www.nexusmods.com/skyrim/mods/57083/?[/url]\r<br />\r<br />[line]\r<br />\r<br />[b]FAQ\r<br />[/b]\r<br />[u]CBBE?[/u]\r<br />There is a CBBE version of these textures being maintained by drunkenmojo. \r<br />[url=http://www.nexusmods.com/skyrim/mods/55761/?]http://www.nexusmods.com/skyrim/mods/55761/?[/url]\r<br />\r<br />[u]Do I need to install something else first?[/u]\r<br />Install UNP, UNPB or SevenBase body meshes, skeletons and textures (usually all are included in \r<br />one package). This may or may not work with other UNP based bodies.\r<br />\r<br />[u]Is this texture supposed to be pitch black?[/u]\r<br />You are out of vram. Try using one size smaller. I personally use medium.\r<br />\r<br />[u]Is this a perverted mod?[/u]\r<br />It is fully anatomically correct and detailed. That is not the focus of the mod however. Basically, \r<br />it exists to keep me from feeling like I am playing a 2d cartoon character in an otherwise almost \r<br />photorealistic game world.\r<br /> \r<br />[u]How come you haven&#39;t converted this to [insert body type here]? [/u]\r<br />Time. It takes too long to cater to everybody and every body. I am but one man... who does not \r<br />use any of those bodies.\r<br />\r<br />[u] Why are there seams?[/u]\r<br />Aside from a few tiny spots I didn&#39;t have time to finish before leaving for three months, there \r<br />are no seams in the actual texture.  Most seams are the result of the normal maps you are using \r<br />and the Skyrim engine itself.  Using an ENB does a lot to resolve this issue.  The texture does\r<br /> have a couple of spots with residual seam issues (under the arms and on the inside of the legs).\r<br />These will be fixed in v07.  So stand by until then.\r<br />\r<br />[u]Can you edit the texture with pubic hair, extra hairy pubic hair, waxed pubic area, landing \r<br />strip, v-shaped pubic hairs, colored pubic hairs, black body hairs, outie bellybutton, innie \r<br />nipples, pale skin, dark skin, extra veins, toned muscles, ripped muscles, pink feet, tiny \r<br />nipples, huge nipples, pale nipples, dark nipples, scars, lots of scars, whip marks, pimples, \r<br />gore, dirt, freckles, extra freckles, wet skin, no moles, no goose bumps, no body hairs, no \r<br />vagina, open vagina, gaping butt hole, SoS support or futinari support? [/u]\r<br />No. I do not have infinite time. I do however have a mod as you please as long as you give \r<br />credit policy. That way you or any of your less lazy or less busy friends can tackle the \r<br />texture in whatever way you prefer. So please do not fill up my inbox with requests.\r<br /> \r<br />[u]Thanks for all your hard work but I just can&#39;t use these textures because you didn&#39;t do \r<br />something probably already covered in the FAQ.  So can you get on that?  We all know my one \r<br />endorsement is all the leeway I need to convince any modder to do anything I want.[/u]\r<br />A bit of advice, if you want a mod author to do something for you, don&#39;t try to bait them with \r<br />endorsements.  The vast majority of us know that endorsements and the quality of a mod are not \r<br />related and are not doing this for endorsements. (Trust me my Art of Magicka Mod does not \r<br />deserve its spot in the top files section.)\r<br />\r<br />[u]Can I use your textures for [insert request here]?[/u]\r<br />See the Permissions section bellow.\r<br />\r<br />[u]When will this texture be done?[/u]\r<br />Probably never. Alpha will end with v07.\r<br /> \r<br />[u]What will be in v07?[/u]\r<br />Finished hands and feet, improvements to the face, fixes for quality inconsistencies and more \r<br />high-contrast details such as veins, body hairs, goose bumps and moles for better appearance \r<br />from a distance.\r<br />\r<br />[line]\r<br />\r<br />[b]PERMISSIONS[/b]\r<br />You have my permission for the following modifications.  You do not need to contact me for \r<br />explicit permission.  If you do I will refer you here.  If you need permission for something \r<br />not covered here, please do contact me or Seren4XX who is free to give you permission in my \r<br />place. \r<br /> \r<br />[u]Body Conversions[/u]\r<br />You have my permission to convert this texture to any body so long as you give me credit and \r<br />give Seren credit if you use his excellent face normal map.\r<br />\r<br />[u]Followers[/u]\r<br />You have my permission to use this texture on any existing or new follower so long as you give \r<br />me credit and give Seren credit if you use his excellent face normal map.\r<br />  \r<br />[u]Modifications[/u]\r<br />You have my permission to make modifications to this texture and re-release it so long as you \r<br />give me credit and give Seren credit if you use his excellent face normal map.\r<br />\r<br />[u]Races[/u]\r<br />You have my permission to use this texture as a part of a new or existing race so long as you \r<br />give me credit and give Seren credit if you use his excellent face normal map.\r<br />\r<br />[u]Other Games[/u]\r<br />You have my permission to use this texture as part of any Elder Scrolls, Fallout or Witcher \r<br />game mod so long as you give me credit and give Seren credit if you use is excellent face \r<br />normal map.  Please do not convert this texture for use with other games without getting \r<br />permission first.\r<br />  \r<br />[u]Packages[/u]\r<br />You have my permission to bundle this texture as a part of any texture package or body\r<br /> mod so long as you give me credit and give Seren credit if you use his excellent face normal map.\r<br />\r<br />[u]Other Textures[/u]\r<br />You may combine parts of this texture with other Elder Scrolls, Fallout or Witcher textures \r<br />available on the Nexus so long as you give me credit and give Seren credit if you use his excellent \r<br />face normal map.\r<br />\r<br />[u]Profit[/u]\r<br />You [u][b]do not[/b][/u] have my permission to use this texture to make profit or claim it as your own in any \r<br />way (which has happened twice that I know of).  I have 30 gigabytes of tif files to prove that \r<br />these are my own textures, not a modification of any existing texture or a combination of any \r<br />other pre-existing textures.\r<br />\r<br />[line]\r<br />\r<br />[b]CREDITS[/b]\r<br />Dimon99 - The UNP body\r<br />Seren4XX - Face Normal Maps\r<br />Zonzai - Textures\r<br />Nexus - Hosting\r<br />\r<br />\r<br />[line]\r<br />\r<br />[b]Disclaimer for the Normal Map source files[/b]\r<br />Feel free to use the source files of the normal map for any non-profit purpose ([b]none[/b] other&#33; ). You can improve it and/or use it to enhance an existing Skyrim normal map with, for instance.\r<br />\r<br />The only thing required is that you give both Zonzai and I credit for the work you use in an obvious place on your mod page/in your post should you release your work.\r<br />\r<br />Enjoy&#33; :)",
  "categoryId": "29",
  "version": "V06",
  "author": "Zonzai and Seren4XX",
  "createdUnix": "1369524178",
  "updatedUnix": "1407048235",
  "containsAdultContent": true,
  "uploadedBy": "Zonzai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031451",
      "name": "real girls alpha",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8559",
      "fileName": "real girls alpha-36425-0-1.7z",
      "uploadedUnix": "1369522987",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/28d55cd68fd4335cf25ba867bdef5144fb5864564f4fbd26c5092fa6c90296ab/analysis/1407581658/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20alpha-36425-0-1.7z?fid=1000031451&ttl=1535815587&ri=8192&rs=8192&setec=87ade7bcff5c10e5a38b4b9b4b0155c8"
    },
    {
      "fileId": "1000031476",
      "name": "real girls v02",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8519",
      "fileName": "real girls v02-36425-0-2.7z",
      "uploadedUnix": "1369539353",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/c012fcf7dc46d4b41ca2aba8c034e416e649ca5f294cba8aa1369d7d906dbf78/analysis/1407581893/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20v02-36425-0-2.7z?fid=1000031476&ttl=1535815588&ri=8192&rs=8192&setec=1d633ec3311191cf845cffeaa299a257"
    },
    {
      "fileId": "1000031770",
      "name": "real girls v03",
      "version": "0.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10046",
      "fileName": "real girls v03-36425-0-3.zip",
      "uploadedUnix": "1369714715",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/0f8483d11a309274b5d66162d16a862d96d14416842a2d7c0e9250382ec52dd4/analysis/1407584120/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20v03-36425-0-3.zip?fid=1000031770&ttl=1535815588&ri=8192&rs=8192&setec=536dd9d72cef4dfd2776da62bb54f1c3"
    },
    {
      "fileId": "1000032616",
      "name": "real girls v04 - large",
      "version": "v04",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "41889",
      "fileName": "real girls v04 - large-36425-v04.7z",
      "uploadedUnix": "1370233150",
      "modVersion": "v04",
      "virusScanUrl": "https://www.virustotal.com/file/b81cd2ed2a192d969ef51ec7307d9b31ed01da490b2998d64e10796bcf302401/analysis/1407590422/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20v04%20-%20large-36425-v04.7z?fid=1000032616&ttl=1535815589&ri=8192&rs=8192&setec=4ec776d38390fec3b7da905304ad8467"
    },
    {
      "fileId": "1000032617",
      "name": "real girls v04 - small",
      "version": "v04",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2404",
      "fileName": "real girls v04 - small-36425-v04.7z",
      "uploadedUnix": "1370233230",
      "modVersion": "v04",
      "virusScanUrl": "https://www.virustotal.com/file/5fef7fabf727007b2e1a720c8a9cee203701e7bc7d36d1752d98cdd12f623c89/analysis/1407590425/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20v04%20-%20small-36425-v04.7z?fid=1000032617&ttl=1535815589&ri=8192&rs=8192&setec=776102e29f72514b7d7159cb14b136cd"
    },
    {
      "fileId": "1000032619",
      "name": "real girls v04 - medium",
      "version": "v04",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8873",
      "fileName": "real girls v04 - medium-36425-v04.7z",
      "uploadedUnix": "1370233466",
      "modVersion": "v04",
      "virusScanUrl": "https://www.virustotal.com/file/71891fb210a28377d2f8945c2e2c00b7444e024388a1f5824b3fee391dfade70/analysis/1407590430/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20v04%20-%20medium-36425-v04.7z?fid=1000032619&ttl=1535815590&ri=8192&rs=8192&setec=b3a82126857463a20a4200e091538cea"
    },
    {
      "fileId": "1000034136",
      "name": "real girls v05 - large",
      "version": "v05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35460",
      "fileName": "real girls v05 - large-36425-v05.7z",
      "uploadedUnix": "1371180229",
      "modVersion": "v05",
      "virusScanUrl": "https://www.virustotal.com/file/65a59793a6c844251d3e7614476d6cacd158fe5bf6c3a7fdec1ae79cc308f900/analysis/1407603129/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20v05%20-%20large-36425-v05.7z?fid=1000034136&ttl=1535815590&ri=8192&rs=8192&setec=fa443b4b7985da8520916a695876fe49"
    },
    {
      "fileId": "1000034137",
      "name": "real girls v05 - medium",
      "version": "v05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8149",
      "fileName": "real girls v05 - medium-36425-v05.7z",
      "uploadedUnix": "1371180632",
      "modVersion": "v05",
      "virusScanUrl": "https://www.virustotal.com/file/8620017dfc6fbcee0f6235f682d6c9a458b5f721561738d21e562531bd5a7685/analysis/1407603135/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20v05%20-%20medium-36425-v05.7z?fid=1000034137&ttl=1535815590&ri=8192&rs=8192&setec=0b7de0fc4ddcfbe14748f3f7d85f2d65"
    },
    {
      "fileId": "1000034139",
      "name": "real girls v05 - small",
      "version": "v05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2255",
      "fileName": "real girls v05 - small-36425-v05.7z",
      "uploadedUnix": "1371180763",
      "modVersion": "v05",
      "virusScanUrl": "https://www.virustotal.com/file/cc088ecf32cec6ba96b2ba2d82720142a426f36e481e4474657eb04223365998/analysis/1407603137/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20v05%20-%20small-36425-v05.7z?fid=1000034139&ttl=1535815591&ri=8192&rs=8192&setec=d6cf179e29a1755aa0505af6c502199a"
    },
    {
      "fileId": "1000034733",
      "name": "8192 RGB face",
      "version": "v05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "61707",
      "fileName": "8192 RGB face-36425-v05.7z",
      "uploadedUnix": "1371528006",
      "modVersion": "v05",
      "virusScanUrl": "https://www.virustotal.com/file/06bd2e345d49ae3566ecb589510a70c2569078e92ddb571573613abf665e4b77/analysis/1407607939/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/8192%20RGB%20face-36425-v05.7z?fid=1000034733&ttl=1535815591&ri=8192&rs=8192&setec=143f2e2af4f11635f03cf8a16983fccc"
    },
    {
      "fileId": "1000036690",
      "name": "real girls v05 Face Normal Map - large",
      "version": "v05",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "28412",
      "fileName": "real girls v05 Face Normal Map - large-36425-v05.rar",
      "uploadedUnix": "1372681008",
      "modVersion": "v05",
      "virusScanUrl": "https://www.virustotal.com/file/da5e725d97b14742b0ae62b41071c902416954ca573e0da44bbd7551885eb496/analysis/1407624499/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20v05%20Face%20Normal%20Map%20-%20large-36425-v05.rar?fid=1000036690&ttl=1535815592&ri=8192&rs=8192&setec=361c5e5a587859d766ede07fe637f33c"
    },
    {
      "fileId": "1000036692",
      "name": "real girls v05 Face Normal Map - medium",
      "version": "v05",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8772",
      "fileName": "real girls v05 Face Normal Map - medium-36425-v05.rar",
      "uploadedUnix": "1372681122",
      "modVersion": "v05",
      "virusScanUrl": "https://www.virustotal.com/file/920cbc940977cf085adf66ff4cc87af208aec951cb6885182f1a4e233e8b5870/analysis/1407624504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20v05%20Face%20Normal%20Map%20-%20medium-36425-v05.rar?fid=1000036692&ttl=1535815592&ri=8192&rs=8192&setec=fbfba05dca4299d26edafe60744e2577"
    },
    {
      "fileId": "1000036695",
      "name": "real girls v05 Face Normal Map - small",
      "version": "v05",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2298",
      "fileName": "real girls v05 Face Normal Map - small-36425-v05.rar",
      "uploadedUnix": "1372681786",
      "modVersion": "v05",
      "virusScanUrl": "https://www.virustotal.com/file/13af7e8a18722b516ae3ca5077fc0d1e313b236040aa3108e69808be2936cb0d/analysis/1407624611/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/real%20girls%20v05%20Face%20Normal%20Map%20-%20small-36425-v05.rar?fid=1000036695&ttl=1535815593&ri=8192&rs=8192&setec=3fa9750cc78f8b955c13700fa79ded7e"
    },
    {
      "fileId": "1000109167",
      "name": "Real Girls V05 4K Tangent Space Face Normal Map",
      "version": "v05",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "377534",
      "fileName": "Real Girls V05 4K Tangent Space Face Normal Map-36425-v05.rar",
      "uploadedUnix": "1400149703",
      "modVersion": "v05",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Real%20Girls%20V05%204K%20Tangent%20Space%20Face%20Normal%20Map-36425-v05.rar?fid=1000109167&ttl=1535815593&ri=8192&rs=8192&setec=88987fdb390563f83310f0c018c03e9e"
    },
    {
      "fileId": "1000109170",
      "name": "Real Girls V05 4K Skyrim Object Space Face Normal Map",
      "version": "v05",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "122137",
      "fileName": "Real Girls V05 4K Skyrim Object Space Face Normal Map-36425-v05.rar",
      "uploadedUnix": "1400152305",
      "modVersion": "v05",
      "virusScanUrl": "https://www.virustotal.com/file/4f5fd3449cd15db2dd7dada114a3a6f191d602fff5b9441e086a93453bd89662/analysis/1408077792/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Real%20Girls%20V05%204K%20Skyrim%20Object%20Space%20Face%20Normal%20Map-36425-v05.rar?fid=1000109170&ttl=1535815594&ri=8192&rs=8192&setec=a92c26646aba89d47180fb5251116d94"
    },
    {
      "fileId": "1000120412",
      "name": "V06 SMALL",
      "version": "V06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1922",
      "fileName": "V06 SMALL-36425-V06.7z",
      "uploadedUnix": "1407044532",
      "modVersion": "V06",
      "virusScanUrl": "https://www.virustotal.com/file/ff6fdea2be9690e6906b89134a0ea3e3202a0b02fd80f178e89616e5bbd8c154/analysis/1407044583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/V06%20SMALL-36425-V06.7z?fid=1000120412&ttl=1535815594&ri=8192&rs=8192&setec=3d063c79ab28a294c16a723fab7a7caa"
    },
    {
      "fileId": "1000120414",
      "name": "V06 MEDIUM",
      "version": "V06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6804",
      "fileName": "V06 MEDIUM-36425-V06.7z",
      "uploadedUnix": "1407044684",
      "modVersion": "V06",
      "virusScanUrl": "https://www.virustotal.com/file/7f68adfe459bdaa8114e906e2fd1e7b108834368daf63cc9cedf7c22dc68900a/analysis/1407044725/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/V06%20MEDIUM-36425-V06.7z?fid=1000120414&ttl=1535815595&ri=8192&rs=8192&setec=5496ca84e9d292533fa29fb2d8a39de9"
    },
    {
      "fileId": "1000120416",
      "name": "V06 LARGE",
      "version": "V06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21108",
      "fileName": "V06 LARGE-36425-V06.7z",
      "uploadedUnix": "1407045120",
      "modVersion": "V06",
      "virusScanUrl": "https://www.virustotal.com/file/620bbd1bd90fce5d03aa406b20a3b0b209a8b2a895e8551f0746df7f139f55fb/analysis/1407045204/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/V06%20LARGE-36425-V06.7z?fid=1000120416&ttl=1535815595&ri=8192&rs=8192&setec=0434278800149bc7d04127bd9c813110"
    },
    {
      "fileId": "1000120420",
      "name": "8192 TIF files for modders",
      "version": "V06",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "42994",
      "fileName": "8192 TIF files for modders-36425-V06.7z",
      "uploadedUnix": "1407045751",
      "modVersion": "V06",
      "virusScanUrl": "https://www.virustotal.com/file/496569b1b4d83c4f05309639ba08050c2bc65242951f135e489ac8c78f0ae41f/analysis/1407045827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/8192%20TIF%20files%20for%20modders-36425-V06.7z?fid=1000120420&ttl=1535815596&ri=8192&rs=8192&setec=2e7e1ec0991ea94dd3f79945112b8f23"
    },
    {
      "fileId": "1000120427",
      "name": "v06 8192 RGB face",
      "version": "v06",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "21232",
      "fileName": "v06 8192 RGB face-36425-v06.7z",
      "uploadedUnix": "1407048235",
      "modVersion": "v06",
      "virusScanUrl": "https://www.virustotal.com/file/6063ffe89178c975956d658d27aeb82e8137ac63ebd1b14b18191afb120aa4a6/analysis/1408174353/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/v06%208192%20RGB%20face-36425-v06.7z?fid=1000120427&ttl=1535815596&ri=8192&rs=8192&setec=ed1cd9692f727221aee692b81adfc811"
    }
  ]
}