{
  "modId": 36508.0,
  "modName": "Perkalicious - Level 150",
  "summary": "Written, detailed explanation of stable changes coming soon&#33; It is 100% worth it if you like this mod&#33;\r<br />FINALLY UPDATED&#33; CTD bugs FIXED and now fewer scripts (that are only used by this mod).\r<br />Complete overhaul of perks. Designed to be fun.  Works great w/ Legendary and Community Uncapper.",
  "descriptionHtml": "Perkalicious is the ONLY mod that I am aware of the has MULTIPLE, switchable zoom levels (IE: zoom closer OR further on-the-fly) and a sort of bullet-time that makes combat infininately more awesome for ranged (magic/stealth) players&#33;  Best of all, while it adds to the &#34;fun&#34; factor, it doesn&#39;t make your character overpowered&#33;  See it in action  [url=http://www.youtube.com/watch?v=LjGhj9tNjhU] in this video&#33; [/url]\r<br />\r<br />[color=orange] [size=13]That&#39;s right&#33; I finally updated this mod&#33; No more crash to desktops when looking at perk trees.  No more overlap in speech perks.  Fewer scripts, now w unique names that only this mod uses makes for an easier removal process. [/size] [/color]\r<br />\r<br />\r<br />[color=green] [size=13]This is a complete Perk overhaul&#33; [/size] \r<br />ALL perk trees have been completely re-done with tweaks to some game systems (sneak / lockpick, etc).  The purpose is to make leveling FUN, lower level play balanced, and high level play awesome. This is accomplished through carefully rethinking (I had to do math and use flow charts&#33;), copious testing, and my modding experience. Plays great on legendary difficulty. ~Two perk points per level PLUS a perk that lets you convert dragon souls into additional perk points&#33; [/color]\r<br />\r<br />[color=#0EBFE9] [size=13] Mod system that has over DOUBLE the perks of vanilla Skyrim&#33;  [/size]\r<br />This leads to better balance, more customization of your character, and the ability to become truly powerful in each skill class (à la Morrowind-style almost-overpowered goodness). This is accomplished through some (I think) awesome means: [/color]\r<br />[ul] \r<br />- [b] Takes a &#34;fix with perks&#34; approach to fix vanilla gameplay rather than additional mods/scripts.  Want to zoom with the bow? It&#39;s included. Want merchant perks to be useful? Done.  Have 100 extra dragon souls? This mod gives you a solution.  Fist-fighting is a viable option. The magic system is improved via Better Magic built-in.  Same with headbomb&#39;s smithing adjustments. I could go on. [/b]\r<br />-[b] Defined, lore-friendly branches within perk trees. [/b]  This helps to flatten out the trees (making high level perks more accessible earlier), but also makes a perk tree harder to master (to become super-powerful in a skill).  Each tree has at least 2 branches (paths) to travel up now, designed to follow a theme of leveling (ie: with Conjuration, you can now enhance bound weapons separately from summoning, which is also separate from necromancy. But if you want to be a powerful conjurer, you actually need to take ALL of the perks in a tree rather than cherry-picking)/\r<br />- [b] Leveling is actually fun&#33; [/b]  Because of the redesign of the perk trees, leveling become more strategic and interactive than simply picking the one available perk in a tree.  If you want to become really strong, you may have to save up perks.  Each tree has 2 new perks available every 10-15 skill levels, so no more waiting for hours and hours of gameplay to progress in a skill tree&#33;\r<br />-[b] Community-driven mod. [/b]  I collaborated (and stole ideas w/ permission from) all of the most popular balancing/perk mods on the Nexus. As such, this mod provides in all-in-one solution for 15 individual mods.\r<br />-[b] Customization, modular, or simple. [/b]  Want a complete overhaul and like my changes? Just install the main file.  Want to change a perk tree? No problem - this file is an ESM, do download any ESP and it will (nicely) overwrite my skill tree w/out issue. As such, this mod is compatible with almost every mod on the nexus (except for Synxys Perky, which I borrowed heavily from). I personally run &gt;200 mods at once without issue&#33;\r<br />-[b] No more &#34;cheating&#34; [/b] - enchanting and smithing are specifically and thoughtfully designed to be more frustrating to start leveling, but end up more powerfully.  This slows the grinding approach of players, but ends in a more rewarding and immersive experience.\r<br />- [b] Flexible. [/b] Harder or more powerful gameplay. Legendary not tough enough? If you don&#39;t use the community uncapper, my perk mod will provide a unique way to make the game more challenging.  Use the community uncapper, and become ultimately more powerful than Vanilla, but without making the game easier or destroying balance.\r<br />- [b] A &#39;new&#39; perk tree based solely on players&#39; overall level to make gameplay more fun and accessible.  [/b]\r<br />- [b] A lot more that I don&#39;t feel like typing right now&#33; [/b] But for example, perks in each tree are actually necessary, specific AND useful. Enhance lockpicking because you actually HAVE TO IF YOU WANT TO PICK LOCKS. Speech tree actually has some awesome features like an additional 15,000 possible gold available to merchants and a chance to unlock a &#34;private stock&#34; inventory at shops that has some awesome and useful items in it&#33; Every single perk is actually worthwhile. \r<br />[/ul]\r<br />\r<br />[color=#4F2F4F] [size=13] Here is a video showing all of the perks in all of the trees:  [/size] [/color]\r<br />[youtube]F1sIbNhOZ0U[/youtube]\r<br />\r<br />[color=red]This mod will be best used with a new play-through.  BUT if you are using an existing character and mostly vanilla perks, you can use [url=http://skyrim.nexusmods.com/mods/16471/?]Ish&#39;s Respec Mod[/url]    or  [url=http://skyrim.nexusmods.com/mods/30263/?] Well of Rebirth [/url] to reset all of your perk points.   [b] If you do this, create a backup save file w/ all of your perk points available, because these respec mods will not work once you have picked all the perks in Perkalicious [/b] [/color]\r<br />\r<br />[color=red] [size=13] REQUIRED (sort of) [/size]\r<br />-[url=http://skyrim.nexusmods.com/mods/1175/]community uncapper[/url] (check additional files in this mod for my uncapper customization designed for Perkalicious)\r<br />If you don&#39;t use the uncapper, your game will be incredibly hard.\r<br />[/color] \r<br />\r<br />I recommend using the following mods w/ Perkalicious:\r<br />-[url=http://skyrim.nexusmods.com/mods/31799/]Traps make noise[/url]  \r<br />-[url=http://skyrim.nexusmods.com/mods/952/]Tougher traps[/url]\r<br />-[url=http://skyrim.nexusmods.com/mods/2585/]TSSS[/url]  \r<br />\r<br />\r<br />[color=#C67171] [size=13] [b] Quick FAQs [/b] [/size] [/color]\r<br />[ul]\r<br />-What&#39;s with the picture?\r<br />[i] My mod borrows a lot from perky.  One of Perky&#39;s photos is a guy holding perk points. I thought that was hilarious.  My mod is called Perkalicious (my wife helped me name it, she loves Fergie and Black Eyed Peas).  The girl in the photo is Fergie from her Fergalicious music video. GET IT&#33;?&#33; HAHAHAHA [/i]\r<br />-Your mod sucks or I don&#39;t like some features\r<br />[i] First off, my mod is awesome.  One of the reasons that it is awesome is that if you don&#39;t like a certain feature, you can override it with another mod.  Check out all the credits section for mods that may float your boat. [/i]\r<br />-Your mod is still overriding another perk mod I downloaded. \r<br />[i] Try moving &#34;patchilicious.esp&#34; up above your new perk mod you load order  [/i]\r<br />-This mod contains dirty edits\r<br />[i] No it doesn&#39;t.  I cleaned it w/ TESVedit.  I also manually reviews errors after. The conflicts are between perkalicious and pathicilious, which makes sense, because the patch is overwriting the esm on purpose&#33; I also submitted this file to BOSS 5/28/13 [/i]\r<br />-What else have you modded and where did you come from?\r<br />[i] I have modded for community use: Morrowind, Command and Conquer Tiberian Dawn - Red Alert 2, plus many others for personal use. I am old now, and happened to be temporarily unemployed, so I busted this mod out in a few weeks. [/i]\r<br />[/ul]\r<br />\r<br />[color=#B13E0F] [size=13] File credits [/size] [/color]\r<br />You can use any of these mods (except for Perky) in conjunction with Perkalicious:\r<br />Jjiinx [url=http://skyrim.nexusmods.com/mods/12862/]Synxys Perky[/url]\r<br />TuCot [url=http://skyrim.nexusmods.com/mods/7787]extended block perks[/url]\r<br />SushiSquid [url=http://skyrim.nexusmods.com/mods/4374/]better magic[/url]\r<br />SushiSquid [url=http://skyrim.nexusmods.com/mods/18919/]speech tree[/url]\r<br />Eckss [url=http://skyrim.nexusmods.com/mods/27857]dragon knowledge spell[/url]\r<br />Shadow_Dragyn [url=skyrim.nexusmods.com/mods/10456]path of shadows (sneak and sneak mech)[/url]\r<br />Kryptopyr [url=http://skyrim.nexusmods.com/mods/28418]stealth skills rebalanced (lockpicking)[/url]\r<br />Vortexio2 [url=http://skyrim.nexusmods.com/mods/7395/]vortex lockpicking mod[/url]\r<br />headbombs stuff: [url=http://skyrim.nexusmods.com/mods/4719/]1_[/url] [url=http://skyrim.nexusmods.com/mods/8003/]2_[/url] [url=http://skyrim.nexusmods.com/mods/2730/]3_[/url] [url=http://skyrim.nexusmods.com/mods/6047/?] 4_[/url] ",
  "categoryId": "73",
  "version": "2.0.F.YEAH",
  "author": "NLacaria and Jjiinx- TuCot- HeadBomb- sushisquid- Eckss- Shadow_Dragyn- Kryptopyr- Vortexio2",
  "createdUnix": "1369775577",
  "updatedUnix": "1386228270",
  "containsAdultContent": false,
  "uploadedBy": "nlacaria",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000043792",
      "name": "Community Uncapper custom config",
      "version": "UncapFile",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Community Uncapper custom config-36508-UncapFile.zip",
      "uploadedUnix": "1375525466",
      "modVersion": "UncapFile",
      "virusScanUrl": "https://www.virustotal.com/file/59817b5858bcca2881315cf9ce08e3690867a4ab9eaba6c192ddb670fd683d97/analysis/1407667261/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Community%20Uncapper%20custom%20config-36508-UncapFile.zip?fid=1000043792&ttl=1535815726&ri=8192&rs=8192&setec=f747a9e61d643363d04f7add632209c5"
    },
    {
      "fileId": "1000085424",
      "name": "Perkalicious 2 - BSA Version",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1554",
      "fileName": "Perkalicious 2 - BSA Version-36508-2-0.7z",
      "uploadedUnix": "1386228146",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/03aaddbefd543f4e3cd5188da22fd92f31dbe96cb1efbd309ab2c9efc805b6c5/analysis/1407820388/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Perkalicious%202%20-%20BSA%20Version-36508-2-0.7z?fid=1000085424&ttl=1535815726&ri=8192&rs=8192&setec=ef05e4d549d9f27aa9a6ced9e0a759c5"
    },
    {
      "fileId": "1000085425",
      "name": "Perkalicious 2 - Loose File Version",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "171",
      "fileName": "Perkalicious 2 - Loose File Version-36508-2-0.7z",
      "uploadedUnix": "1386228270",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/91455a2a0f5bd9d1d872edef62e3a68dd5a945dc2c23a5ccb3c078a21b7ab2e5/analysis/1407820386/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Perkalicious%202%20-%20Loose%20File%20Version-36508-2-0.7z?fid=1000085425&ttl=1535815727&ri=8192&rs=8192&setec=8b3f37c6b73ad8b9fb4cc4b78e63fa39"
    }
  ]
}