{
  "modId": 3651.0,
  "modName": "Dalls_Forsworn",
  "summary": "Forsworn is arms n armor replacement (model-swap) and custom re-texturing (n not simple recolour) mod which changes how - your (in-game) adversaries - Forsworn and their gear look.",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - Forsworn\r\n\r\nv1.1\r\n\r\n12/12/2011\r\n\r\nForsworn is arms n armor replacement (model-swap) and custom re-texturing (n not simple recolour) mod which changes how - your (in-game) adversaries - Forsworn and their gear look.*\r\n\r\n* Word of warning - my work actually do changes how these items / subjects look - rather then \\\"polishes\\\" same / boring game \\\"apple\\\" a bit further as many other popular mods do - so it might not be fit for casual modders or more-of-same seekers.\r\n\r\nWhy my game textures look as they do: All textures I make are closer to original game Art / Game Art concept (short of some minor technical n aesthetic changes) then are those you have in your game. How is that possible? If you know process of texture (game Art) making that will be obvious but if you don\\'t it will suffice to say that this process (like any other) has various stages which serve different purposes. Brilliantly done - Original Art in game is \\\"covered\\\" in \\\"immersion\\\" grime n dirt probably out of necessity - as quite lot users / potential game buyers insist on low-key (dark) games - which they (users) find as more interesting / much more \\\"realistic\\\" (immersive). So if you want to \\\"see\\\", what you think is there you better avoid my re-texture mods - on other hand if you want to see what original Artists and I have (really) done there - go for them. ;)\r\n\r\nForsworn are in Skyrim lore aboriginal people, one of original power-players and they are one of your more important (in-game) enemies but - in my opinion - their fur, bone n feathers (very primitive cave-men attires) accompanied with their stone-age swords n axes seriously let them down in that role. This remake (model-swap mod) pulls them up - to be more in line with prevailing \\\"dressing-code\\\", other Skyrim denizens have and makes them look like - what they really are - proper (dangerous) warriors / enemies worth respect.\r\n\r\nAs this mod has moved from being simple, model-swap one - some explanation of what it really does is - probably ;) - necessary. On the most basic level, it exchanges Forsworn fur n feathers (their \\\"merry\\\" cave-men armors) for better / more appropriate - Hide (leather) ones. At same time, it exchanges their tuft bows, claw mace-swords and their flint axes for Draugr (steel) ones. Their Shamans / Chieftains - BriarHearts are not exchanged (as standard) but if you install optional AltPart - Briarheart as well they will be brought in line with the rest of my \\\"new\\\" Forsworn tribesmen. Each of these Forsworn (mod) parts can be used as stand-alone mod - but to have full benefit (of my Forsworn mod) you need all three. \r\n\r\nNote that my textures (PartTwo_Textures) can be of interest (use) to all who don\\'t want to change their fur-clad  Forsworn for mine but still wish to have better looking Hide Armors (M/F light n medium) and would like to see / have in their game more desirable / better looking Draugr Weapons (bow, long-sword n hand-axe). Forsworn arrows n quivers (still in / used in my mod) have been improved as well.\r\n\r\nAs these changes are of visual nature only - all item statistics and crafting recipes will stay same / will not be affected or changed in any way.\r\n\r\nAnd finally if you like anything in there remember to endorse it / vote for it as mods like this one take quite a bit of knowledge n time to make.\r\n\r\nTo install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like this new look, simply delete / remove my (check for file names my mod) mesh (.nif) files from - Data/meshes/clothes/forswornarmor and secondly from Data/meshes/weapons/forsworn. My new / improved (mod) textures can be found in Data/textures/armor/hide n Data/textures/weapons/draugr and forsworn After removal - all original items / their look will be restored.\r\n\r\nBugs/conflicts: none known - but take care not to overwrite them by accident!   \r\n  \r\nUse:\r\nFree to use but if any files included (therein) are to be used for modding ask me for permission!\r\n\r\nNote on v1.1: In models section original Forsworn tribal bow have been exchanged for Draugr one, new look (model) for BriarHeart has been added (male light Hide) and new / improved textures for the whole lot have been added.\r\n\r\nEnjoy and try to remember - if you like it even in a part - to give endorsement! \r\n\r\nThanks to Bethesda for really great game.\r\n\r\n",
  "categoryId": "36",
  "version": "1.1",
  "author": "Dall",
  "createdUnix": "1323865793",
  "updatedUnix": "1324075760",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "10345",
      "name": "Dalls_Forsworn",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1349",
      "fileName": "Dalls_Forsworn-3651.7z",
      "uploadedUnix": "1323865873",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/bcf72957b7b43336862223d22db8defbabf0e6f4a7095d8c0063e3c7dbbc16c3/analysis/1406518028/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Forsworn-3651.7z?fid=10345&ttl=1535758858&ri=8192&rs=8192&setec=f7a5d8937b57b3588a6fce24f32785a1"
    },
    {
      "fileId": "11140",
      "name": "Dalls_Forsworn_v11",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12561",
      "fileName": "Dalls_Forsworn_v11-3651-1.7z",
      "uploadedUnix": "1324075760",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/8b5d17ce43db4ab56dc517d153e734aa9bd4734791a7980c62a7abcf17b47e2a/analysis/1406527208/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Forsworn_v11-3651-1.7z?fid=11140&ttl=1535758858&ri=8192&rs=8192&setec=dec6cecf37cbfbe7c64fa51eb5ddeb21"
    }
  ]
}