{
  "modId": 36526.0,
  "modName": "Batch Files for Adding Armors to Game",
  "summary": "This collection of .bat files will enable you to quickly add sets of Nexus user created armors.",
  "descriptionHtml": "My goal is this, to simplify testing and previewing user made armors in the game without having to tab in and out of the game to a website page in-order to put in a code character by character just to preview a set of armor to see if one likes it. I apologize for the amateurishness of this mod, but I figure if I wanna break onto the scene, I might as well start small and contribute in my own way. Especially since Nexus really helped me get the most out of Skyrim.\r\n\r\nTo this end, I have figured the best way to go about doing this, is to create .bat files of as many sets of armor as I can, that are nexus created. I\\'m not really one for writing descriptions of something, so let me just jump right in to installation, running \\\".bats\\\" and things worth mentioning.\r\n\r\nI) [u] Special Information: [/u]\r\n           I need to mention this first and foremost because it is absolutely crucial to this mod: !!!! YOU MUST HAVE DOWNLOADED THE PROPER ORIGINAL FILES FROM THE ORIGINAL AUTHOR OF THE ARMOR/CLOTHING MOD !!!! I will provide links, descriptions and (possibly if I have enough time) reviews of armor sets. I\\'m not stealing any of the authors work, I\\'m simply making it easier to obtain the items in-game without jumping through a bunch of hoops so those that want to add the armor to their characters instantly, can.\r\n\r\n     [b][color=red]    If any Author of any Armor/Clothing mod disapproves of having a .bat created of their armor, please PM me and I will remove that batch file as soon as I see your PM.[/color][color=green] If any author would like to have their armors added to a .bat file same method applies with a few tweaks, you\\'ll have to provide me a link to your armor on the Nexus site. I will only be working with Nexus site armors, sorry. [/color][/b]\r\n\r\nFor now, I\\'ll only be adding 1 armor set which is by Gyo. The set is titled [b]Psiijic Re-Skin several versions[/b]\r\nThe set is found at this link within the Nexus site: [url=http://skyrim.nexusmods.com/mods/1854/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D1854%26preview%3D&pUp=1]Psiijic Re-Skin Several Versions[/url]\r\n\r\nDownload that mod, via NMM and follow whatever installation instructions they have included. [b][color=red]Warning! I cannot help you if you do not follow the Armor/Clothing Mod Authors instructions[/color][/b]\r\n\r\nNow onto the instructions for my Mod.\r\n\r\nInstallation:\r\n1) Click the downloads tab on this page and select the \\\"PRobes.txt\\\" file. \r\n2) Choose to download \\\"PRobes.txt\\\" file manually.\r\n3) Find out what directory you have installed Skyrim in.\r\n        [b]Steam:[/b] C:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\The Elder Scrolls V Skyrim\r\n        [b]Non-Steam:[/b] \r\n              C:\\\\Program Files\\\\Bethesda Softworks\\\\The Elder Scrolls V Skyrim \r\n                             [b]or[/b]\r\n                        C:\\\\Program Files\\\\The Elder Scrolls V Skyrim\r\n4) Place \\\"PRobes.txt\\\" into your Skyrim directory, [color=red]NOT[/color] your Data Folder.\r\n5) Launch Skyrim through whatever means you use.\r\n6) Press the ` key on your keyboard to bring up the console in game once you\\'ve loaded up entirely.\r\n7) Type in [color=green] bat PRobes.txt[/color] EXACTLY like that.\r\n8) Press enter.\r\n9) Close your console menu.\r\n10) Enjoy! You now own a full set of retextured Psiijic Order armor by Gyo, all without having to tab in and out of game to type in the codes to obtain it!\r\n\r\nFinal Thoughts:\r\nIf you like the armors featured here, ENDORSE the original Mod Authors page. In this case for example, if you like what Gyo did, endorse his work!\r\nAgain, I have not stolen any authors works, all I have done is compiled a batch to simply add these items into your inventory through one simple command via in-game Console.\r\n\r\nPlanned Sets to Come:\r\nBlack Mage Armor, Author Reko found [url=http://skyrim.nexusmods.com/mods/9645/?] here[/url]\r\nDrakul/Medusa Armor, Author Zerofrost Satyr found [url=http://skyrim.nexusmods.com/mods/31229/?] here[/url]\r\n\r\nThese won\\'t be done until I manage to PM Reko and Zerofrost and get a response. Right now I\\'m testing the waters with this type of modification and seeing if its something people would actually like.\r\n",
  "categoryId": "39",
  "version": "1.0",
  "author": "Caedes",
  "createdUnix": "1369820584",
  "updatedUnix": "1369820169",
  "containsAdultContent": false,
  "uploadedBy": "CaedesAposis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000031956",
      "name": "Psiijic Robes Batch",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Psiijic Robes Batch-36526-1-0.7z",
      "uploadedUnix": "1369820169",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c0aa6079ab51852efde048137d12f08a5ae865d1b6f949dcfee154d5befa3bdc/analysis/1407585365/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Psiijic%20Robes%20Batch-36526-1-0.7z?fid=1000031956&ttl=1535815761&ri=8192&rs=8192&setec=55640232822eebd293a6259c6731fc8b"
    }
  ]
}