{
  "modId": 36547.0,
  "modName": "Superior Dual Casting",
  "summary": "With this simple mod dual cast spells now cost three times the magicka and dish out three times the damage compared to single hand casting.",
  "descriptionHtml": "     I really fell in love with the ability to overcharge magic spells in Skyrim.  However, I was a bit put off by the technical details of how it worked.  Basically, in the vanilla game when a character dual casts it will cost 2.8 times the magicka and deal out 2.2 times the damage.  It seems silly to me that you would lose on the trade, I mean, you are already using up two hands and using extra magicka.\r\n\r\n     This mod sets the cost/bonus ratio from 2.8/2.2 to 3/3.  Some spells, when dual cast, will cost a tremendous amount of magicka now, but the payoff will be equally large with damage effects and spell durations now three times normal.  Watch out, though, or you will quickly find yourself drained of magicka reserves.\r\n\r\n     This mod will make you be a little more tactical with how you use your magicka.  If you try to dual cast against larger groups of weaker enemies you will run out of juice, fast.  If you let loose overcharged blasts and miss, you have wasted a lot of magicka for nothing.",
  "categoryId": "93",
  "version": "1.0",
  "author": "DarkMaia aka Sovereign",
  "createdUnix": "1369865643",
  "updatedUnix": "1369865820",
  "containsAdultContent": false,
  "uploadedBy": "darkmaia",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032044",
      "name": "Superior Dual Casting",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Superior Dual Casting-36547-1-0.zip",
      "uploadedUnix": "1369865820",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/28fcc39bebf67faa29f8ba3cb121a0537efd61d1b8620fcbd08c0172a4266f51/analysis/1407585961/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Superior%20Dual%20Casting-36547-1-0.zip?fid=1000032044&ttl=1535815788&ri=8192&rs=8192&setec=38fb69f4fc21120759a8e7f380abe6a1"
    }
  ]
}