{
  "modId": 36557.0,
  "modName": "Skyrim Revolved Npc Appearance Overhaul",
  "summary": "Skyrim Revolved changes a number of npcs in Skyrim. The changes can be seen in cities like Whiterun.",
  "descriptionHtml": "Skyrim Revolved changes a number of npcs in Skyrim. The changes can be seen in cities like Whiterun. So basically this mod changes the appearances of npcs around Skyrim. However this mod DOES NOT change ALL npcs. I will in the future provide various updates like changing more npcs.\r\n\r\nAnyway back to the mod details. Now you will find more of different races. Some nords are now khajiit or argonians. Some high elves, wood elves or dark elves are now the races of some nords. I have also made some npcs vampires. I however have not change voices of any npcs because I think that that would cause some errors with quests. This mod may not be very lore friendly but it is interesting to find khajiit or argonians that can speak with a nordic accent. I am not sure if there could be any mod conflicts. I think there could be conflicts with mods that change npc appearances or maybe stats. I am not sure yet but please comment on the mod and tell any bugs. Also tell me what npc would you like to change. Also tell me ways of how I could make this mod better. Please rate and endorse.\r\n\r\nIn the future: Expect npc appearance updates for Dawnguard and Dragonborn DLCs.",
  "categoryId": "79",
  "version": "1.00",
  "author": "Ajwad",
  "createdUnix": "1370061147",
  "updatedUnix": "1369902842",
  "containsAdultContent": false,
  "uploadedBy": "greatboy348",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032088",
      "name": "Skyrim Revolved Version 1",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "60",
      "fileName": "Skyrim Revolved Version 1-36557-1-00.rar",
      "uploadedUnix": "1369902842",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/d1df3c5f5f405ddd9ecad8a7ba440f5634ac723c9ff0e7207d4e74896c42695a/analysis/1407586386/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Revolved%20Version%201-36557-1-00.rar?fid=1000032088&ttl=1535815803&ri=8192&rs=8192&setec=38656d2ef0a81e93bcf9a93757551408"
    }
  ]
}