{
  "modId": 36791.0,
  "modName": "Miraak Character Preset",
  "summary": "A small mod that adds Miraak\\' to the Nord male presets. Dragonborn DLC is required.",
  "descriptionHtml": "Update: I\\'ve added a new version of the .esp that includes an alternate Miraak with blue eyes and blonde hair. In the Creation Kit, this Miraak is tagged as Essential and has significantly more perks than the other, black-eyed and grey-haired Miraaks. Because I have not played through the Dragonborn content yet, I cannot confirm which Miraak you fight in the final battle, but at the moment I\\'m putting my money on the blonde one, simply because of the above.\r\n\r\nI wanted to play as Miraak without using mods or add a custom race to Skyrim. The best way of doing this was by adding his face as a character preset.\r\n\r\nFor those of you who might want to add your own presets of characters. Simply fire up the Creation Kit and search for your desired NPC within Actors. Then tick CharGenPreset and find the race you want to add them to within Races. Right-click in the list of presets and click New, then simply add the NPC entry that you edited previously from the popup list. Finally finish by saving as a new .esp.",
  "categoryId": "43",
  "version": "",
  "author": "monkycid",
  "createdUnix": "1370173652",
  "updatedUnix": "1370174958",
  "containsAdultContent": false,
  "uploadedBy": "monkeycid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032480",
      "name": "Miraak Character Preset",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Miraak Character Preset-36791-.zip",
      "uploadedUnix": "1370174958",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ec2435098b904bae42f4619a8c8533f2a4f3ca8b30fae523d5964be48b96c2a7/analysis/1407589699/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Miraak%20Character%20Preset-36791-.zip?fid=1000032480&ttl=1535816054&ri=8192&rs=8192&setec=dd57cf9c01faf95b90939377dce8cf8a"
    }
  ]
}