{
  "modId": 36803.0,
  "modName": "More Cooking Pots",
  "summary": "Adds cooking pots/spits to inns and taverns that were missing them.",
  "descriptionHtml": "More Cooking Pots\r\nby DJ_Zephyr\r\n__________\r\n\r\n[url=http://skyrim.nexusmods.com/users/5432630/?]Perseid9[/url]\\'s [url=http://skyrim.nexusmods.com/mods/26228/?]Realistic Needs and Diseases[/url] is awesome.  I\\'ve always been the survival-gaming type, ever since Oblivion, so I like when my characters need to eat.  Zeph\\'r is a fairly voracious Dovahkiin- he can polish off two-thirds of a deer, half a cheese wheel, and a couple jugs of water on some days- so he DEFINITELY needs to eat, and to eat, he needs to cook.  And to cook, he needs a cooking pot- something oddly missing from many of the inns across the nation of Skyrim.  Which had me wondering how those inns kept their other patrons fed.\r\n\r\nWhen I didn\\'t find any mods to fill the appliance void, I decided to go thru [url=http://www.uesp.net/wiki/Skyrim:Inns]a list of inns[/url] and check each one out in the Creation Kit.  If I didn\\'t find a cooking pot or cooking spit, I added one- most (if not all) of the inns had a fire or oven somewhere, so it wasn\\'t too far of a stretch to add in the cooking equipment.  The more-heavily trafficked locations- like those in the major cities- got the fully-loaded cooking spit, while outlying locales- isolated inns, smaller villages- now have a simple pot hanging next to the fire.  I did hafta adjust the brick oven and move a couple items in The Winking Skeever in Solitude a bit, but it worked out well.  Fort Dawnguard already has a cook pot (I didn\\'t check Castle Volkihar... not sure if vampires need normal food in RND), as do the Retching Netch and the Skaal village\\'s Greathall in Solstheim, so no DLC is required.\r\n\r\nAssuming I\\'ve done this right, every inn in Skyrim should now have a spot for the player to prep their food and boil their water.  Even the NPCs will sometimes walk up and use the pots.  I\\'ve tested it with the aforementioned RND, and it should be fully compatible; no idea what it\\'ll do with other survival mods, tho.  If you have any other mods that edit the inns, this may not be compatible with them, but I haven\\'t changed too much with this- aside from the stove and items in Solitude, I mostly just added furniture items.\r\n\r\nIf I screwed something up or missed an inn, just leave a post in the comments, and I\\'ll see what I can do.\r\n__________\r\n\r\nTo install, just extract the ESP to the \\\".../Skyrim/Data/\\\" folder, and activate it with the launcher or your choice of mod manager.\r\n__________\r\n\r\nCheck the permissions section for more info. I\\'m a pretty open-source kinda guy, but I\\'m also big on credit where credit is due. Thanks, and enjoy! ",
  "categoryId": "69",
  "version": "1.0",
  "author": "DJ_Zephyr",
  "createdUnix": "1370198762",
  "updatedUnix": "1370198407",
  "containsAdultContent": false,
  "uploadedBy": "DJZephyr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032532",
      "name": "DJZ Cooking Pots",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "DJZ Cooking Pots-36803-1-0.zip",
      "uploadedUnix": "1370198407",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1f6762a712e3f21337483b9c4f0efcf2484ea8bf2366a6451d599a0af546c750/analysis/1407589987/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DJZ%20Cooking%20Pots-36803-1-0.zip?fid=1000032532&ttl=1535816076&ri=8192&rs=8192&setec=4cd25084d28193001ae00fe3eac6e98e"
    }
  ]
}