{
  "modId": 36812.0,
  "modName": "Dragon Blood",
  "summary": "This mod adds a new reason to go dragon hunting; their blood. A dark, viscous liquid with the power to enchance the body and mind of the Dovakiin. ",
  "descriptionHtml": "=================\r\n   DRAGON BLOOD   \r\n=================\r\n\r\nREQUIRES 1.8+ \r\n\r\nThis mod adds a new reason to go dragon hunting; their blood. A dark, viscous liquid with the power to enchance the body and mind of the Dovakiin. \r\n\r\nIn simple terms, a vial of dragon\\'s blood will bestow upon you an extra perk point. This is meant as an alternative to the excellent dragon souls to perks mod, which I loved and have been using since release, but I always wanted to cut out the middle man of having to go to those stones and fiddle about with custom menus. Please note, this mod does not affect the dragon soul mechanics in any way. Nor does it aim to. \r\n\r\nThis has the added benefit of letting you spend the perk points through the vanilla game menus, meaning it supports all those lovely custom perks you\\'re all using. \r\n\r\nThough not as common as dragon bones or scales, the beast\\'s blood gives you a perk point to spend any way you want. If, like me, you think bethesda were a little stingy with the perks and fancy earning a few more in an organic and immersive way, this mod is for you. \r\n\r\nI\\'ve been getting a lot of requests to put this on the nexus, so here\\'s the link: \r\nhttp://skyrim.nexusmods.com/mods/36812/ \r\n\r\nTROUBLESHOOTING / FAQ \r\n\r\nQ. I\\'m drinking the blood, but why is nothing happening? \r\nA. Sounds like the script isn\\'t firing. Make sure you have the .bsa file in your data folder and you\\'re using skyrim v1.8+ \r\n\r\nQ. I like this mod but I think the dragon blood should add [insert crazy effect here] to the player too! \r\nA. That\\'s an excellent idea for a mod. I wish you the best of luck with it. \r\n\r\nQ. Why am I no longer absorbing dragon souls? \r\nA. I have no idea, I didn\\'t touch that with this mod. It doesn\\'t affect souls at all. All the scripting I did (totalling about 6 lines) affects the effect that I added to the potion, which in turn was added to the levelled loot list for dragons. MY SCRIPTS DO NOT EFFECT DRAGON BEHAVIOUR OR SOULS. If you are having a problem with them, it was not caused directly by my mod. My only suggestions are to install the unofficial patches for Skyrim and any DLC you have and consider a clean start. \r\n\r\nQ. Now I have loads of useless souls, what am I supposed to do with them? \r\nA. I don\\'t know/care. That\\'s not an issue created by my mod and it\\'s not one I set out to solve. It seems what you\\'re after is the Dragon Souls to Perks mod. Check it out, it\\'s brilliant. \r\n\r\nQ. Does this mod work if I have the Dragon Souls to Perks mod? \r\nA. Yes, you can get perks from the blood I added and then trade your souls in for more with that ecxellent mod. Go nuts. \r\n\r\nQ. This makes me way OP! \r\nA. Ok, don\\'t use it then. I respectfully disagree. Some people, including myself, feel a little underpowered and underwhelmed when they reach the higher levels, so I made this mod for them. Plus, Bethesda already added an incredibly contrived way of getting unlimited perks in the 1.9 patch with the legendary system.",
  "categoryId": "73",
  "version": "1",
  "author": "DistinctlyMinty",
  "createdUnix": "1370206964",
  "updatedUnix": "1370206852",
  "containsAdultContent": false,
  "uploadedBy": "icechambers",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032555",
      "name": "Dragon Blood v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dragon Blood v1-36812-1.rar",
      "uploadedUnix": "1370206852",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/92e5061f60e98be009e7aca6d1de1a47849de44e9ea56e7ba0c6b3361a5efd96/analysis/1407590111/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Blood%20v1-36812-1.rar?fid=1000032555&ttl=1535816088&ri=8192&rs=8192&setec=4217b1235a97c11539d9df358f91fb5c"
    }
  ]
}