{
  "modId": 36833.0,
  "modName": "Adorning Dawnstar - A Dawnstar overhaul",
  "summary": "Dawnstar Is now a busyish dock, with plenty of loot. A new player house also. Lots of new Npc\\'s. New merchants. new storage. new uniqueness.",
  "descriptionHtml": "More Navmesh edits, i have just found some new things to do with navmesh so i a doing them. also i will be doing a few other things to make this better.\r\n[URL=http://imageshack.us/photo/my-images/27/httpmakeagifcommedia602.gif/][IMG]http://img27.imageshack.us/img27/7691/httpmakeagifcommedia602.gif[/IMG][/URL]\r\n\r\nPlease Read The Full DESCRIPTION. And More images coming tomorrow.\r\n[center]\r\n[size=10]Description[/size]\r\nIt is sort of hard to explain what it does But here goes.\r\nThis is a mod that changed most if not all of the city Dawnstar. \r\nAll interiors now hove some more clutter. And chests that a thief may avail him/her self of.\r\n\r\nWind peak inn, Has had a major change. It now has a different look than the other inn\\'s around skyrim, The Bar is at the other end, there is two dinner tables (no more 4 table\\'s on either wall) and 3 tables at the back of the Tavern. there is now more npc interaction and so on.\r\n\r\nThe White hall, I haven\\'t changed much in here, the main thing is the court mages room has had a major make over, and she no longer shares her shop/quarters with the town CO, he now lives up stairs.\r\n\r\nThe mortar and pestle now looks like an alchemists shop. Plenty of ingredients contains and displays.\r\n And so on The list could go on for pages and pages. Please look at the images for more information. \r\n\r\n[size=9]Exterior[/size]\r\nNow The Exterior of Dawnstar has had some changes. for starters there is a few new building\\'s/houses.\r\nTemple of Arkay, has been placed in front of the guard house.\r\nA House just North of the Iron Breaker mine.\r\nA Boat House on the shore of the bay.\r\nA Merchant ship that sells various items, that will be In Dawnstar during the week then it will travel to Windhelm for the weekend.\r\nMoved Leif Wayfinders Ship out the bay some more.\r\n\r\nPlus Lots Lots More.\r\n\r\n[size=9]Unique Things[/size]\r\nThe two banners on the southern imperial wall of Dawnstar will change to imperial if the CW quest completes, and vice versa.\r\n\r\nThe Merchant ship in Dawnstar Has a script that places it in two places, During the week The Ship and its two Inhabitants will be in Dawnstar docked so you can buy some items.\r\n\r\nMr Bronzefish Will take his boat out fishing during the afternoon.\r\n\r\nThe Non Existent Tree\\'s in Dawn star can be Activated By using a book That Can Be Found On A Crate On the dock in Dawnstar.\r\n\r\nA Boat to Transport you to an island just out of Dawnstar.\r\n\r\nYOU CAN BUILD YOUR HOUSE. BEWARE IT CAN BE QUITE EXPENSIVE. Speak to Leif Wayfinder He has a quest to find some salts. once that is completed you should Be able to open his shop and you\\'ll be able to buy his items to rebuild the house. NOW This should work i have just tested it and as soon as you pick up the salts his shop becomes available. \r\nSpoiler* Highlight Below to read.\r\n[color=black]Or you can dive in the Bay in Dawnstar to find A Strongbox that has all the book scripted items. OR goto the tower on the island and bring up the console \\\" ` \\\" Key below The Esc key, and type tcl and walk into the tower and collect your stuff in the strong box.[/color]\r\n\r\nNow i cant test this properly as i had to re install Skyrim (Leif wayfinder\\'s shop working) please tell me if it don\\'t work.\r\n\r\n[size=9]New Npc\\'s & Edited Npc\\'s[/size]\r\nThere is lots of new npc\\'s to be found in this town. Two new family\\'s and about 10+ other new npc\\'s. \r\nA Bandit in the Prison.\r\nA Beggar Named, Wilde the Cold\r\nA Child Urchin named, Haviland the Urchen\r\nA hire able Maid For your new house, Fahliil The Maid, she will go into town at nights.\r\nSahqo Daughter of Frida, She Guards your island when you hire her.\r\nCaecilius Metellus, Another Guard that guards your island and visits the local tavern.\r\nMorah, Another Guard that guards your island and visits the local tavern.\r\nThree New dock hands that visit various places including the local tavern and in the city Dawnstar itself, But mainly on your island. Names: Janr, Gr\\'aldi, Ca, othy.\r\nLauraa Westaway and Soli Westaway, Soli Is the local Lumberjack.\r\nEdirus, is a monk at the Temple of Arkay.\r\nDrifka, is also a monk at the Temple of arkay.\r\nCaptain Elton, is the captain and merchant on the Merchant ship.\r\nGarrett is Captain Elton\\'s Guard and friend.\r\nCronkar BronzeFish, is a fisherman.\r\nYeerlin BronzeFish, is Cronkar\\'s son.\r\nEevie Bronzefish, The Mother of the house.\r\n3 new dawnstar Guards that will be at 3 places.\r\n\r\nEdited:\r\nLeif wayfinder Has had his outfit changed. And his crew has had some new packages.\r\n\r\nThree New Dawnstar Guards, two that will patrol the two walls that have been added. and one that will follow the player in the white hall. now the guards will change if another faction take over so it starts out as a stormcloak place and the guards will change to an imperial soldier.\r\n\r\n\r\n[size=9]Things This Doesn\\'t Edit[/size]\r\nBoth the Mines remain unedited. I am unsure if i want to immersifie them.\r\nThe Dawnstar Sanctuary. This is going to remain completely unedited as there is plenty of mods that already do this.\r\n\r\n[size=9]How To Install[/size]\r\nDownload With NMM and activate.\r\nDownload And Extract the Contents of the .rar into your Skyrim/Data directory\r\nUninstall:\r\nDeactivate in Nmm or delete the contents of the .rar (in your data folder)\r\n\r\nAny Question\\'s Please ask, There is a 95% chance ill respond. unless this get crazily popular. (probably wont)\r\n[/center]\r\n\r\nTeddy Bear: Near An Orphan\\'s Bed: \r\nhttp://skyrim.nexusmods.com/mods/16625/?\r\nOriginal model of the teddy: Abitor (http://thefree3dmodels.com/stuff/accessories/toon_teddy_bear/21-1-0-2215)\r\nInsanity sorrow for his tutorial \\\"Importing models into Skyrim\\\" (http://tesalliance.org/forums/index.php?/topic/4634-3d-craftworks-importing-weapons-into-skyrim/) \r\nand for his Graphic artistry classes on Tes Alliance (http://tesalliance.org/forums/index.php?/forum/118-graphic-artistry/)\r\nThe Niftools team for giving us Nifskope\r\nBethesda for Skyrim and the Creation Kit\r\n\r\nDarkfox127 For his awesome Tutorials.\r\n\r\nPaintings and Frames by Artisanix\r\nhttp://skyrim.nexusmods.com/mods/17423//?\r\n\r\nStrotis Outdoor Toilet Resource by Stroti and Tamira\r\nhttp://skyrim.nexusmods.com/mods/32056/?\r\n\r\nModders Resource Pack by Oaristys and Tony67\r\nhttp://skyrim.nexusmods.com/mods/16525/?",
  "categoryId": "53",
  "version": "1.3",
  "author": "Jiubiizeekk",
  "createdUnix": "1370248513",
  "updatedUnix": "1370423422",
  "containsAdultContent": false,
  "uploadedBy": "jiubiizeekk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032635",
      "name": "JiubiIzeekk Dawnstar Version one",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13979",
      "fileName": "JiubiIzeekk Dawnstar Version one-36833-1.rar",
      "uploadedUnix": "1370247549",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/af8a32bcbac1ea1f5559fba6f669c19a266b01d713f45285a6d4ed85cc4d091d/analysis/1407590660/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/JiubiIzeekk%20Dawnstar%20Version%20one-36833-1.rar?fid=1000032635&ttl=1535816118&ri=8192&rs=8192&setec=781da2155ac6a3a2bf0a2964b516a804"
    },
    {
      "fileId": "1000032763",
      "name": "Adorning Dawnstar Version 1 2 ",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14024",
      "fileName": "Adorning Dawnstar Version 1 2 -36833-1-2.rar",
      "uploadedUnix": "1370334361",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d0193e085f183bbe47d466fccfcb28e45282f0702c6381d9b2dd0dff01b66915/analysis/1407591855/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Adorning%20Dawnstar%20Version%201%202%20-36833-1-2.rar?fid=1000032763&ttl=1535816119&ri=8192&rs=8192&setec=dc2a4bd179598b785ecc77dcd1aad7e7"
    },
    {
      "fileId": "1000032898",
      "name": "Version 1 3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14232",
      "fileName": "Version 1 3-36833-1-3.rar",
      "uploadedUnix": "1370423422",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/6455fa020b5a3f385581ac8304098ad4dfdbcee33743bb32c947e99eb65bacd9/analysis/1407592993/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%201%203-36833-1-3.rar?fid=1000032898&ttl=1535816119&ri=8192&rs=8192&setec=b121b9638f72a7b3c4d78a5dc2ff279f"
    }
  ]
}