{
  "modId": 36847.0,
  "modName": "Matts_Spectral_Souls",
  "summary": "Matt\\'s Spectral Souls is a small mod that adds a several conjuration spells into Skyrim. The beasts conjurable are in a spectral or \\'ghost\\' type form, and varies from a spectral noble stead to a spectral chaurus. The spell tomes are scattered around Skyrim and a journal will tell you the very location of them.",
  "descriptionHtml": "Matt\\'s Spectral Souls is a small mod that adds spectral or \\'ghost\\' form creatures into Skyrim. They are all conjurable and will last for 600 seconds/10 minutes, where you can then re-conjure them for a mere 100 magika. To start finding the spell tome books, head to The Bannered Mare in Whiterun, and look on the counter to find a journal named \\'Spectral Souls\\'. If the journal is not on the counter, it may of been knocked over by something, or an NPC, so just look on the floor. The journal will tell you the location of the books, but don\\'t worry, they are easy to locate for the lowest of levels.\r\n\r\nThe Spectral Souls are not at a high level so they do not ruin the game, but still add a run aspect of having a cool follower, mount or even a helpful pet!\r\n\r\nI have so far included the following spectral souls:\r\n\r\nSpectral Horse- A ridable horse mount in a spectral from.\r\nSpectral Chaurus\r\nSpectral Sabre Cat\r\nSpectral Bear\r\nSpectral Troll\r\nSpectral Werewolf\r\nSpectral Frostbite Spider\r\n\r\nAll of them are in a spectral form as said.\r\nIf this mod receives good feedback then I will make a additional vanilla spectral souls mod, and maybe a Dragonborn and Dawnguard version as well, for those with the DLC.\r\n\r\nThis mod was made by me, Matt55284, please leave feedback in the comments on your opinion on the mod, and please report any bugs.\r\n\r\nThank you, and enjoy,\r\nMatt55284",
  "categoryId": "75",
  "version": "v1.0",
  "author": "Matt55284",
  "createdUnix": "1370285861",
  "updatedUnix": "1370282490",
  "containsAdultContent": false,
  "uploadedBy": "matt55284",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032685",
      "name": "MattsSpectralSouls",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "MattsSpectralSouls-36847-v1-0.rar",
      "uploadedUnix": "1370282490",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/afbc100a59c84ceb76c7fb5240cbdc8e6020fc8c41f2e9ca6e1fb153228542e1/analysis/1407591092/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MattsSpectralSouls-36847-v1-0.rar?fid=1000032685&ttl=1535816143&ri=8192&rs=8192&setec=f3bc1bf2b6fc6293afa500e402f6235f"
    }
  ]
}