{
  "modId": 36848.0,
  "modName": "The Dark Brotherhood - The Black Sacrament",
  "summary": "The Pleas for the Night Mother no longer goes unheard! \r\n- Perform The Black Sacrament to hire the Dark Brotherhood to kill anyone you want!\r\n- 100% voice Acted!\r\n- Optional ( New Dark Brotherhood Armor Retexture for Female & Male )",
  "descriptionHtml": "[img]http://www.fildirekt.se/dl/1370301303.png[/img]\r\n\r\n\r\n[img]http://www.fildirekt.se/dl/1370345619.png[/img]\r\n\r\nTHIS MOD REQUIRES SKSE TO WORK! [url=http://skse.silverlock.org/] Download [/url]\r\n\r\nThe pleas for the Night Mother no longer goes unheard!\r\n\r\nWhat is The Black Sacrament? It is the only way to contact The Dark Brotherhood for their services, which is taking a life for the cost of money.\r\n\r\nThe only requirement is that you are not a member of the Dark Brotherhood, lets face it, if you could it wouldt make sence\r\n\r\nThe mod starts as soon as you read the book \\\" A Kiss, Sweet Mother\\\" which can be found around the world or bought buy some merchants.\r\n\r\nupon reading the book you will aquire a spell called \\\" Mark for Death \\\". How you use this is simple, you cast it on the person you hate the most in Skyrim.\r\n\r\nWhen you are done you need to start collecting items for the ritual:\r\n- Bone Arms ( Left & Right )\r\n- Bone Hands ( Left & Right )\r\n- Bone Ribcase\r\n- A Skull\r\n- Bone Legs ( Left & Right )\r\n- 1 human heart\r\n- 1 human Flesh\r\n- 1 night shade\r\n- 7 Candles\r\n\r\nYou also need a ceremonial dagger. Which is a dagger dipt in nightshade extraction. The Dagger can be crafted at a crafting station with 1 iron dagger and 2 nightshades. Or you can buy it from some misc merchants.\r\n\r\nThe candles can be bought from certain merchants, such as Belethor at the Belethor´s goodstore.\r\n\r\nThe bones can be collected from skeletons, or found at graveyards, or halls of the dead in some cities. \r\n\r\nOnce you have all the ingredients needed for the ritual, you must read \\\" A Kiss, Sweet Mother \\\" again but this time a messagebox will come up asking you if you want to start the ritual.\r\n\r\nWhen you press yes, you will be given a scroll. That scroll you must place at a open and secure location, cause it is the ritual itself.\r\n\r\nYou must then stab the skeleton body 3 times and pronounce the chants right to fullfill the ritual \r\n( you activate the skeleton and these will be done for you )\r\n\r\nA Speaker for The Dark Brotherhood will visit you once you sleep, demanding to know the name of the target, and he will also demand for payment, which is 5000 septims per kill. Make sure you have the payment when the speaker arrives.. otherwise the consequenses might be... bloody\r\n\r\nThe speaker will then vanish, and then you will have to wait for the dark brotherhood to contact you again, it will take between 1-3 days for the dark brotherhood to perform the contract. And once they are finished they will plant a letter in your inventory when your not watching.\r\n\r\nThe transaction is now completed and your target has been eliminated acording to the contract and without you even touching him!\r\n\r\nThe Speakers are fully voice acted. And it will also be 1 out of 3 ( more in the near future ) who will visit you, so the same speaker wont appear each time. ( for immersion )\r\n\r\nThe notes you recieve is also random. You get 1 out of 6 notes each time ( more in near future ) just to enhance the immersion.\r\n\r\nOPTIONAL FILE:\r\n\r\nThis includes a retextured version of the Shrouded armor. That is how I wanted it to be from the very beginning. \r\n\r\nFor the moment there is only the shrouded armor for both female and male. But the Robed version will be added in the near future!\r\n\r\n\r\n[img] http://www.fildirekt.se/dl/1370351480.png[/img]\r\n\r\n- Randomized payment for different people, example a beggar shouldt be as expensive as a jarl to have killed.\r\n\r\n- More letters for immersion\r\n- More Speakers for Immersion ( Voice Actors Needed!!! Both female and male!!)\r\n\r\n- specifying your order. Tell the Dark Brotherhood that you want the target to vanish. So that noone will ever find him/her.\r\n\r\n\r\n\r\n[img] http://www.fildirekt.se/dl/1370329727.png[/img]\r\n\r\nthere is a few bugs yes.. :/\r\n- you cannot order someone killed if they are in a current Scene or is used by a Quest alias. I am not speaking about Essenitality, i am speaking of reserved references. they cannot be placed inside the mark of death.\r\n\r\n- if you forget to use mark of death before contacting and speaking with the speaker, the script will randomly take an npc in the world for you xD while beta testing it picked \\\" Wild Horse \\\" for me xD\r\n\r\n- when placing the Ritual using the Scroll, you MUST look forward, if you look down or up the placement will be messed up! and that kinda breaks the immersion.\r\n\r\nThat are the bugs i am aware of and trying to fix! please report bugs by PM or on my Facebook page.\r\n\r\n[img] http://www.fildirekt.se/dl/1370372653.png [/img]\r\n\r\nThanks to Hfiani, for his support and help with Scripting!! \r\nThanks to Xion, for supporting me and giving ideas and helping with lore!\r\nThanks to Bethesda for the Creation kit and Skyrim!\r\n\r\nAnd dont forget to visit my Facebook page here for sneakpeaks and other great stuff!-----> [url=https://www.facebook.com/pages/Theskoomaking-Productions/510725382328603?fref=ts] HERE [/url]\r\n\r\n",
  "categoryId": "78",
  "version": "1.0",
  "author": "TheSkoomaKing",
  "createdUnix": "1370289171",
  "updatedUnix": "1370303123",
  "containsAdultContent": false,
  "uploadedBy": "TheSkoomaKing",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032695",
      "name": "The Dark Brotherhood - The Black Sacrament",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "631",
      "fileName": "The Dark Brotherhood - The Black Sacrament-36848-1-0.rar",
      "uploadedUnix": "1370288598",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c2fea40fdab862d59c9f9e174ed8e0f03e2f1bc665c78ec4efef6462d34dfcef/analysis/1407591125/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Dark%20Brotherhood%20-%20The%20Black%20Sacrament-36848-1-0.rar?fid=1000032695&ttl=1535816145&ri=8192&rs=8192&setec=91b5570d5a0a3389a30e59fd676553cd"
    },
    {
      "fileId": "1000032696",
      "name": "The Dark Brotherhood - Optional Retex by me",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4326",
      "fileName": "The Dark Brotherhood - Optional Retex by me-36848-1-0.rar",
      "uploadedUnix": "1370288747",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/54a29b8502df698f85438194653e57880633fd735ce46d8885a11f7867a68dd7/analysis/1407591136/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Dark%20Brotherhood%20-%20Optional%20Retex%20by%20me-36848-1-0.rar?fid=1000032696&ttl=1535816146&ri=8192&rs=8192&setec=b8c5d4acb76d8332407419f9f6516721"
    },
    {
      "fileId": "1000032736",
      "name": "The Dark Brotherhood - Voices",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8011",
      "fileName": "The Dark Brotherhood - Voices-36848-1-0.rar",
      "uploadedUnix": "1370303123",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cd3ae501beabe13c2bdb2cb1c080a51871ea7e4fe84c224f96a7a99a1efa8a46/analysis/1407591386/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Dark%20Brotherhood%20-%20Voices-36848-1-0.rar?fid=1000032736&ttl=1535816146&ri=8192&rs=8192&setec=054d4aad37cbeebd7cca6a65e51caa0c"
    }
  ]
}