{
  "modId": 36860.0,
  "modName": "Empowered Bound Weapons - ALPHA",
  "summary": "Modifies the BASE damage of bound weapons to scale with Conjuration skill, so that scaling benefits properly from enchantments and weapon damage perks.  Includes optional versions to add enchantments based on Enchanting skill.  Intended for use on Master difficulty, to obviate the need for Smithing for armor-free melee casters.",
  "descriptionHtml": "[b][color=red][size=24]Empowered Bound Weapons - ALPHA[/size][/color][/b]\r\n\r\nThis mod is intended to make bound weapons \\\"viable\\\" on Master difficulty as simply as possible.  Unlike other \\\"scaling\\\" mods, damage increments with Conjuration skill by increasing BASE damage, so that weapon skills, weapon damage perks, and damage enchantments will work properly, as they do when improving physical weapons with Smithing.\r\n\r\nThere are three versions:\r\n[b]EmpoweredBoundWeapons_1.esp[/b]: Main mod - Replaces Mystic Binding with Focused Binding\r\n[b]EmpoweredBoundWeapons_2.esp[/b]: Enchant mod - Includes everything in EmpoweredBoundWeapons_1.esp and replaces Soul Stealer with Shadow Binding\r\n[b]EmpoweredBoundWeapons_3.esp[/b]: Extra Enchant mod - Includes everything in EmpoweredBoundWeapons_2.esp and replaces Oblivion Binding with Spectral Binding\r\n\r\nALL of the mods greatly decrease the cast time of bound weapons (sorry, there doesn\\'t appear to be a way to link this to a perk).  The modified perks are described below:\r\n\r\n[b][color=magenta][size=5]Focused Binding[/size][/color][/b]\r\nReplaces Mystic Binding.  Bound weapons have increased damage and attack speed and last twice as long.\r\n\r\nSpecifically, attack speed for all bound weapons is increased by approximately 20%.  In addition, this perk changes base [b][color=red]Sword[/color]/[color=magenta]Battleaxe[/color]/[color=cyan]Bow[/color][/b] damage to [b][color=red]15[/color]/[color=magenta]24[/color]/[color=cyan]18[/color][/b] and increases it by 3% per point of Conjuration.\r\n\r\nAt 100 weapon skill, the in-game damage figures for [b][color=red]Sword[/color]/[color=magenta]Battleaxe[/color]/[color=cyan]Bow[/color][/b] are below (note: Bow damage includes a constant +24 Bound Arrow damage, which is not modified by any perks, gear, or enchants):\r\nBase game (vanilla Skyrim, no mods or perks): [b][color=red]14[/color]/[color=magenta]26[/color]/[color=cyan]51[/color][/b]\r\nFocused Binding, 20 Conjuration: [b][color=red]24[/color]/[color=magenta]38[/color]/[color=cyan]53[/color][/b]\r\nFocused Binding, 100 Conjuration: [b][color=red]60[/color]/[color=magenta]96[/color]/[color=cyan]96[/color][/b]\r\nFB, 100 Conjuration, 5/5 weapon damage perks: [b][color=red]120[/color]/[color=magenta]192[/color]/[color=cyan]168[/color][/b]\r\nFB, 100 Conj, 5/5 perks, +160% damage enchants: [b][color=red]312[/color]/[color=magenta]499[/color]/[color=cyan]398[/color][/b]\r\n\r\nWithout weapon skill potions, the maximum possible physical damage for Daedric weapons is about [b][color=red]520[/color]/[color=magenta]650[/color]/[color=cyan]560[/color][/b].  So you can still get better damage from \\\"real\\\" weapons, if you really want to. :)\r\n\r\n[b][color=magenta][size=5]Shadow Binding[/size][/color][/b]\r\nReplaces Soul Stealer.  Bound weapons are cast silently.  Bound melee weapons absorb Health, with magnitude depending on Enchanting skill.\r\n\r\nThis perk simply allows casting bound weapons without breaking Sneak and adds 4 Absorb Health per 20 levels of Enchanting.  Intended for stealthy characters, obviously.  At 100 Enchanting, it absorbs 20 health - the same amount as a fully-perked Absorb Health enchant with a Grand Soul (and no +Enchanting potions).\r\n\r\nThe Absorb effect does not apply to Bound Bow.\r\n\r\n[b][color=magenta][size=5]Spectral Binding[/size][/color][/b]\r\nReplaces Oblivion Binding.  Bound weapons banish summoned creatures and inflict powerful elemental effects based on Enchanting skill.\r\n\r\nThis is for people who want more fireworks (see screenshots) and don\\'t mind if bound weapons end up just a TAD overpowered.  Spectral Binding adds the following abilities at each Enchanting skill level:\r\n\r\n20: 5 Fire damage\r\n30: 5 Shock damage\r\n40: 5 Frost damage\r\n50: Fire damage has a 30% chance to Ignite the target, causing 10 Fire damage per second for 3 seconds.\r\n60: Shock damage has a 20% chance to Stagger the target.\r\n70: Frost damage has a 10% chance to Paralyze the target.\r\n80: 10 Fire damage.  Melee weapons also inflict 5 Fire damage to hostiles in a small area.\r\n90: 10 Shock damage.  Melee weapons also inflict 5 Shock damage to hostiles in a small area.\r\n100: 10 Frost damage.  Melee weapons also inflict 5 Frost damage to hostiles in a small area.\r\n\r\nThe effects are cumulative - i.e., they stack, rather than replacing each other.\r\n\r\n[b][size=5][color=cyan]INSTALLATION/UNINSTALLATION:[/color][/size][/b]\r\nJust drop the .esp of your choice into your \\\\Skyrim\\\\Data folder.  [b][color=red]USE ONLY ONE .ESP FILE.[/color][/b]  Do NOT activate more than one at a time!\r\n\r\n[b]Required Mods[/b]:\r\nNone.\r\n\r\n[b]Recommended Mods[/b]:\r\nThis mod was designed and tested with [b][color=yellow]sushisquid[/color][/b]\\'s Better Magic mod:\r\nhttp://skyrim.nexusmods.com/mods/4374//?\r\nand with [b][color=yellow]tejon[/color][/b]\\'s Simple Skyrim Spell Scaling Solution:\r\nhttp://skyrim.nexusmods.com/mods/2585//?\r\nIt was intended for use with both of these mods.  [b]I highly recommend installing both of them.[/b]  They are both lightweight, elegant solutions to the horrible underpoweredness of magic in this game.\r\n\r\n[b]Compatibility Issues[/b]:\r\nConflicts with any mod that modifies Mystic Binding, Soul Stealer, or Oblivion Binding. There may be other compatibility issues - please report them if you find any!",
  "categoryId": "93",
  "version": "0.1",
  "author": "Rynas",
  "createdUnix": "1370309367",
  "updatedUnix": "1370305869",
  "containsAdultContent": false,
  "uploadedBy": "Rynas",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032739",
      "name": "EmpoweredBound Weapons_v0_1",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "EmpoweredBound Weapons_v0_1-36860-0-1.rar",
      "uploadedUnix": "1370305869",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/5c7c396d8ccc8d4211014a68e0e6f09b1bbd85c61776ee7407542434cab2e36c/analysis/1407591394/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EmpoweredBound%20Weapons_v0_1-36860-0-1.rar?fid=1000032739&ttl=1535816167&ri=8192&rs=8192&setec=00a6bdf0d8f4489db4d6b69b47c219a0"
    }
  ]
}