{
  "modId": 3687.0,
  "modName": "Sinah The Sensuous Nord",
  "summary": "",
  "descriptionHtml": "This is a flexible save download with bat files included that will allow you to choose which of 3 character builds you would want to run: Mage, Thief, Warrior...\r\n\r\nEach build includes a unique item that was gifted to, Sinah, upon her birth by her deceased mother. Each item gifts her with a boost to one of her abilities and a special guardian. \r\n\r\nEach bat will also boosts the abilities of each of the builds, meaning, each will have 7 perks already unlocked, essential to each class. But she will still only be level 1. Thief and Warrior will have steel weaponry and a bow; Mage will have spell tomes that you will need to read to learn those spells. So it\\'s just a little head start. Recommended that you start on Expert/Master.\r\n\r\nPlace one of the bat files in your: Steam/steamapps/common/skyrim folder, the one where your TESV launcher is located. In game, hit \\\"`\\\" and then \\\"bat (whatever build file you used)\\\" and then the \\\"`\\\" again and you should be good to go. Of course no quotes before/after bat. The save file goes to wherever your save files are located. Or keep it to default if you don\\'t need the boost, but you\\'ll sure miss out on a COOL item, that will grant you a guardian that will never leave your side, unless you choose them to. \r\n\r\nThe mods needed for her look are:\r\n\r\nTelthalions Finer Hair \r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2207\r\n\r\nBeauty Faces For Females\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=1329\r\n\r\nCalientes Female Body Mod Big Bottom Edition\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2666\r\n\r\nNo More Blocky Faces\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=30\r\n\r\nRealistic Eyes\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=3566\r\n\r\nDetailed Faces v2\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=26\r\n\r\nFor the unique dark brotherhood nocturnal dress go to: http://www.skyrimnexus.com/downloads/file.php?id=1040 and download the files that you want for her to wear.\r\n\r\nThanks to the modders of the ones I linked to for sharing their hard work, this save file is just my way of saying thanks for all of their wonderful hard, FREE, work. Love you guys!\r\n\r\nHave fun with her, I know I am...\r\n\r\n*Forgot to add*\r\n\r\nThere\\'s a text file labeled \\\"reset\\\" place that file in the same location as the build bat file and run it ONLY if you don\\'t like the build you picked for Sinah. Type (`) then \\\"bat reset\\\" and (`) again (No quotes). This will remove all perks and reset her to default. Can be used on any of your saves if you want to respec your builds. \r\n\r\nAlso, the save begins after the Alduin attack right in front of the Guardian Stones, this way you can choose either the: Mage, Thief, Warrior stone that matches the build for her.\r\n",
  "categoryId": "43",
  "version": "",
  "author": "Concept",
  "createdUnix": "1323906474",
  "updatedUnix": "1323906474",
  "containsAdultContent": false,
  "uploadedBy": "Concept83",
  "primaryFile": null,
  "files": []
}