{
  "modId": 36888.0,
  "modName": "1982 Conan-  The Barbarian",
  "summary": "This is a Conan Follower this I believe to be done correctly.",
  "descriptionHtml": "Hello there everyone This is my first mod that I will be releasing to the world. Not the first mod I have ever made. This is a super simple mod that allows a replica of the 1982 (Conan the Barbarian) played by Arnold Schwarzenegger, to be a part of your Skyrim experience. \r\n\r\nI have seen the other Conan mods and I was unimpressed with them. I have taken a lot of time to recreate Conan to the best of my ability using Creation Kit Ver 1.9.32.0, I have not made a .BSA for this mod as you the user may feel changes may need to be made.\r\n\r\nI take no credit for any weapons, armor or skin textures used in my screen shots as they were all made by other authors.\r\n\r\nAll I did was make a new npc Follower named conan and using face gen make him as close to Arnold Schwarzenegger as Creation kit would allow. Conan will not look as he does in my screen shots without these mods. They are as follows:\r\n\r\nAll can be found at Nexus\r\n\r\nWeapons - Conan Swords - Mr.Dave\r\nArmor - Conan The Barbarian Outfits - Prometheus\r\nFace Textures - High Res Face Maps - Geonox\r\nBody Textures - Favored Soul Meshes - Respected Author*\r\n\r\nInstalation is simple copy the contents of the Data folder I have provided in the Download to your Skyrim/ Data folder and your done.\r\n\r\nA few notes about this mod:\r\n\r\nThis is not a Conan Save Game he is a fully functional Follower. Conan is a bit taller than nords may add a feeling of security for the player.\r\n\r\nConan will never die! He will go to his knees but refuses to die, I mean come on hes Conan.\r\n\r\nConan will start naked but has armor in his invintory he will equip as soon as he leaves the cell he is in. I did this so you can dress him any way you want without default armor rating issues, pretty much so he dont ware what he wants like in some other Conan mods. Only what you give him.\r\n\r\nLike other followers sometimes he will have a bow and use it even if the weapon you give him is stronger, As of this point im not sure how to correct this. It seems to work out most of the time because most followers jump in your line of fire when using a bow. Conan seems to not like doing that.\r\n\r\nConan starts at lvl 1, grab him early on so he can lvl with you.\r\n\r\nConan is Awesome!!!\r\n\r\nok so I guess the big question is, where do I find Conan?\r\n\r\nMost obvious place I could think of. He is in Riverwood! While your in Riverwood after your escape from Helgan stop in the Sleeping Giant Inn for a drink and you may bump into Conan. Cant hurt to have a partner with you for the Quest of the Golden Claw, your trip to Whiterun and maybe in the rest of your travles.\r\n\r\nI hope you enjoy this mod I took a lot of time on it.\r\n\r\nI have also included in this mod: how to make your own Follower and a fix for the dark face that you sometimes get when making a follower or if you have a follower mod you like that has a dark face there is a way to fix it.\r\n\r\nIf your like me at all, Conan had a big impact on my life as a kid so I did this as a tribute and respect.\r\n\r\nI plan on making a voice over pack for him. if I can do this correctly it will be an update for this mod using recording from the 1982 movie.\r\n\r\nHave fun and may Conan teach you the riddle of steel.\r\n\r\n-------------------------------------------------------------------------------------------------------------------------------------------\r\n1982 Conan-  The Barbarian 2.0\r\n\r\nHello guys this is just an update on the Conan project i have going.\r\n\r\nsadly the lip gen is not working because i dont have a Mic to make them, so now Conan can talk but his mouth does not move.. \r\n\r\nI know it sucks but this is the best i can do for now. \r\n\r\nThere are a few new features with Conan.\r\n\r\nHe is now a Decent level\r\n\r\nHe is a 2H warrior class\r\n\r\nHe has Conans Blue eyes now and revised face texture hard to notice the difference but there is one.\r\n\r\nHe has a few power up spells but no destruction spells because hes not a wizard.\r\n\r\nHe has no problem telling you how he feels about a choice you make.\r\n\r\nAlso the option menu when talking to Conan has been changed to make Conan feel like more of a Bro.\r\n\r\nI hope you guys enjoy the new updated Conan and remember it is not finished.\r\n\r\n\r\n",
  "categoryId": "66",
  "version": "2.0",
  "author": "MissAshlay",
  "createdUnix": "1370378752",
  "updatedUnix": "1370671986",
  "containsAdultContent": false,
  "uploadedBy": "MissAshley",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032857",
      "name": "1982 Conan-  The Barbarian",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5237",
      "fileName": "1982 Conan-  The Barbarian-36888-1-0.rar",
      "uploadedUnix": "1370390598",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dd82c2cfbb2425dae2c37f9036cbdf72ba6234c1686a5ea45014c094c9345a31/analysis/1407592566/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/1982%20Conan-%20%20The%20Barbarian-36888-1-0.rar?fid=1000032857&ttl=1535816204&ri=8192&rs=8192&setec=36a360c0b46bd804b046af94c0b466c4"
    },
    {
      "fileId": "1000033266",
      "name": "1982 Conan-  The Barbarian Voice Redux",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7466",
      "fileName": "1982 Conan-  The Barbarian Voice Redux-36888-2-0.rar",
      "uploadedUnix": "1370671986",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/4302a734daf762c7fc12a4e25f06847f6c32d98bcd4159454ce58a7aad67049f/analysis/1407595933/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/1982%20Conan-%20%20The%20Barbarian%20Voice%20Redux-36888-2-0.rar?fid=1000033266&ttl=1535816205&ri=8192&rs=8192&setec=258cc36c0ba040f052708bf6e0d88df7"
    }
  ]
}