{
  "modId": 36889.0,
  "modName": "Clear My Name",
  "summary": "Batch file to clear bounties.",
  "descriptionHtml": "[center][img]http://i.imgur.com/qqBtnl1.png[/img][/center]&#34;So there I was, right?  Sitting in a tavern with about a hundred Septims worth of Skooma and Moon Sugar in my pocket, a knapsack full of stolen goods from the palace, and a belly full of Black-Briar Reserve.  Yeah, had a bit of a bounty on my head but nothing I can&#39;t handle as long as I sneak past the guards, right?\r<br />\r<br />Like a fool, I take this guy up on a so-simple-it&#39;s-sweet challenge to a punching match in the tavern.  Yeah, I know, I know...  Bad lapse of judgement on my part, but still...  One minute, we&#39;re minding our own business, rearranging each other&#39;s faces in the hopes of some easy coin, next thing you know the guy ducks out of the way and the waitress takes an accidental bite of my knuckle sandwich and suddenly the guy and everyone in the place is drawing weapons, yelling, and summoning guards who come pouring out of the woodwork like Rieklings at a caravan accident.  \r<br />\r<br />Tried to bribe my way out and that didn&#39;t work.  Had no Thane card to play, and had a lot of Imperial folks just waiting to get the ol&#39; Dovakiin into cuffs because he&#39;s a known Stormcloak supporter to boot.  Now I&#39;m stuck in a cell with you lot and fixing to break a lot more laws and kill more folks just to be able to taste the sweet air atop the Throat of the World again.  \r<br />\r<br />Just wish there&#39;d have been some way to snap my fingers and make it all go away, ya&#39;know?&#34;\r<br />\r<br />-----\r<br />\r<br />This file does just that.  It&#39;s a simple batch which covers all nine holds, plus Raven Rock, so it is Dragonborn compatible.  Even has notated instructions on looking up factions if you need them for any reason like a mod that creates new ones.  It is set for you to keep your stolen goods.  Crime with absolutely no punishment.\r<br />\r<br />Installation and use is easy. :)\r<br />\r<br />1. Place the batch file into your Skyrim directory: \r<br />c:&#92;Program Files&#92;Steam&#92;SteamApps&#92;common&#92;Skyrim\r<br />(32-bit Windows)\r<br />c:&#92;Program Files (x86)&#92;Steam&#92;SteamApps&#92;common&#92;Skyrim\r<br />(64-bit Windows)\r<br />\r<br />2.  At the first sign of trouble (preferably before the bounty dialogue), hit your console key (~) and type &#39;bat clearmyname&#39; without the quotes and hit enter.  If you are late in catching it before the dialogue, just select &#34;I&#39;d rather die&#34; and then execute the file before they grant your wish...they will then put down their weapons and walk away as if nothing had happened.  ",
  "categoryId": "40",
  "version": "1.0",
  "author": "ShadowWhisper",
  "createdUnix": "1370378777",
  "updatedUnix": "1370378205",
  "containsAdultContent": false,
  "uploadedBy": "chaophim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000032833",
      "name": "clearmyname",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "clearmyname-36889-1-0.zip",
      "uploadedUnix": "1370378205",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/519b99ff48e0509332dbd5d780c48fe9a03922205a30bb526a39dc047627c9c4/analysis/1407592382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/clearmyname-36889-1-0.zip?fid=1000032833&ttl=1535816206&ri=8192&rs=8192&setec=181053a24bed0989b3a4684abfd25ea0"
    }
  ]
}