{
  "modId": 36909.0,
  "modName": "Monster Colosseum",
  "summary": "Welcome to the Monster Colosseum, Dovahkiin.\r\nEnter if you DARE.....",
  "descriptionHtml": "This mod adds a large number of very dangerous monsters. They are in the \\\"Unknown Dungeon\\\" at Riverwood.\r\nHowever, once you enter the dungeon, you will not be able to exit... Unless you have defeated the swarm of monsters: Draugrs, Dwarven Automatons, Seekers, Rieklings, Werebears, and Lurkers.\r\nWhen you are finished with getting rid of those monsters, a reward of 10000 gold and a conjuration magic to summon a Lurker once per day will be given.\r\n\r\nHowever, that\\'s not everything. Near the exit leading to Skyrim, you will find a book that leads to the deeper part of this dungeon.\r\n\r\nDescend to the depth, and you will find Guardian of the secret that lies in the Abyss. Along with the Guardian, you will find his minions; which are also very thretening. There also are Spriggans, the guardians of the Chest, and there are those \\\"Special\\\" monsters, the ARMY OF BUNNIES. They await you to arrive; and you will face their assault.\r\n\r\nWhen you finally escape the dungeon, go to the Whitewatch tower...he is a formidable enemy, so BE AWARE and BE PREPARED for a fierce battle! You will find him to be more resistant against the Dragonrend shout... What will you do?\r\n(Hint: Remember the \\\"Guardian of the secret?\\\")\r\n\r\nRight beside the \\\"Unknown Dungeon\\\", there is the \\\"Unknown lab\\\". It is a place where the stronger version of past Bosses are waiting; you will need to make a key in order to enter, though. Here are the ingredients: \\\"60000 Gold, Giant burnt Spriggan Wood, and two spell tomes: Conjure Vulonmear, Conjure Lurker.\\\" \r\nUse the key to enter the Lab, and you will notice active Dwarven machines and a piercing eye of Hermaeus Mora. You must continue the path filled with deadly traps.\r\n\r\nSomewhere in the Whiterun\\'s Hall of the dead, a doorway leading to the chamber of an Ancient Guard can be found. The Ancient guard and his minions are very powerful; thus I suggest you bring many followers to fight against them.\r\n\r\nThis Dungeon+Monsters mod is not a piece of cake, and it is recommended for people who wish to challenge your alre\r\n\r\nYou MUST have the Dragonborn DLC for this mod.",
  "categoryId": "88",
  "version": "1.0",
  "author": "gggle2",
  "createdUnix": "1370436892",
  "updatedUnix": "1370514373",
  "containsAdultContent": false,
  "uploadedBy": "gggle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033038",
      "name": "Monster Colosseum",
      "version": "1.0a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2852",
      "fileName": "Monster Colosseum-36909-1-0a.zip",
      "uploadedUnix": "1370514373",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/95f65941351958d1080b8740815e66f926c396a8c135339f3fa5f92a17ea58c2/analysis/1407594188/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Monster%20Colosseum-36909-1-0a.zip?fid=1000033038&ttl=1535816236&ri=8192&rs=8192&setec=702525913881235701b1b17da4ee2a11"
    }
  ]
}