{
  "modId": 36947.0,
  "modName": "Long-Lasting Night Eye",
  "summary": "Makes the night power last until it is turned off",
  "descriptionHtml": "Khajiits and vampires can cast night eye, presumably because they can see in the dark, but what creature have you ever heard of that sees in the dark in 60 second spurts?  Besides, I\\'m tired of night-eye turning itself off on me in the middle of something like a fight, or while I\\'m on horseback and can\\'t turn it back on immediately.\r\n\r\nThis mod is very very small.  It just changes the duration of the night-eye spell to nearly 3 years (real time), and, like before one can simply turn the night-eye off again when it is too bright.  This is mainly for convenience for reasons like the one listed above and because I personally thought that it was a little immersion breaking.\r\n\r\nContrary to what you might think this mod is not overpowered, and doesn\\'t actually change the way night eye works in the end.  Night eye is a lesser power, and, as such, can be cast as many times as the player darn well pleases, so if a person actually uses night eye, the moment the timer runs out they simply turn it back on again.  My alteration allows a person to set it and forget it until dawn.\r\n\r\nGiven how small this mod is there will likely never be any updates to it because it likely never need one.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Xervir",
  "createdUnix": "1370550072",
  "updatedUnix": "1370549642",
  "containsAdultContent": false,
  "uploadedBy": "Xervir",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033081",
      "name": "Long-Lasting Night Eye",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "144",
      "fileName": "Long-Lasting Night Eye-36947-1-0.zip",
      "uploadedUnix": "1370549642",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9381abe7afdf459e446af6d86b3569e0c13f078d5af0165aed00bfdbdbd83426/analysis/1407594368/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Long-Lasting%20Night%20Eye-36947-1-0.zip?fid=1000033081&ttl=1535816327&ri=8192&rs=8192&setec=a45ca05f522960f3a597d617e31ac765"
    }
  ]
}