{
  "modId": 36966.0,
  "modName": "Diversite Culturelle - Cultural Diversity - Traduction francaise",
  "summary": "Un mod qui permet de donner à certains PNJ des vêtements et armures spécifiques à leur race.\r\nFrench translation of mjharper\\'s mod, [url=http://skyrim.nexusmods.com/mods/31985/?]Cultural Diversity[/url].",
  "descriptionHtml": "[center][size=4]Ce mod est la traduction du mod [url=http://skyrim.nexusmods.com/mods/31985//?]Cultural Diversity[/url], de mjharper.\r\n\r\nThis mod is the translation of mjharper\\'s mod [url=http://skyrim.nexusmods.com/mods/31985//?]Cultural Diversity[/url].[/size][/center]\r\n\r\n\r\n\r\n[size=4][color=red][center]Également disponible sur[/color][/size]\r\n[url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/personnages/pnjs_et_creatures/diversite_culturelle.php][img]http://www.confrerie-des-traducteurs.fr/forum/styles/3myl_parchemin/imageset/Laconf.png[/img][/url][/center]\r\n\r\n\r\n[size=5][u]Introduction[/u][/size]\r\n\r\nCe mod vise à apporter une certaine diversité culturelle à Skyrim en se concentrant sur les vêtements et les armures des PNJ. La version 1.0 ne concernait que les civils Khajiits ; la version 2.0 offre bien plus d\\'options, aussi bien pour les Khajiits que pour les Argoniens et les Dunmers. Ce mod est complètement modulaire, divisé en de nombreux .esp, ce qui signifie qu\\'il est possible d\\'installer exactement et exclusivement ce que l\\'on désire, rien de plus !\r\n\r\n\r\n[center][url=http://skyrim.nexusmods.com/mods/28680][img]http://www.ushareimg.com/images/286T3R.png[/img][/url][/center]\r\n\r\n\r\n[size=5][u]Prérequis[/u][/size]\r\n\r\n[list][*][url=http://skyrim.nexusmods.com/mods/30729]L\\'armure Royale d\\'Assassin[/url], de Dreamburrow, traduit par Raphou112, pour les vêtements de Khajiits.\r\n[*][url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/armurerie/armures/armure_de_samourai_akaviri.php]L\\'armure de samouraï Akaviri[/url] (traduit ici par Kaos Sita) ou [url=http://skyrim.nexusmods.com/mods/21577/]Armures Immersives[/url] (et ici par FishNyx), de Hothtrooper44, pour les armures de Khajiits.\r\n[*][url=http://skyrim.nexusmods.com/mods/27676//?]Argonian Mercenary Armor[/url] de Spyke-Mayfly53, traduite sous le nom d\\'[b]Armure argonienne de mercenaire[/b], pour les armures d\\'Argoniens.\r\n[*][url=http://skyrim.nexusmods.com/mods/23920//?]Marsh Armor[/url] de Spyke, traduite par [b]Armure du Marais[/b], pour les armures d\\'Argoniens également. Ces deux derniers sont en cours d\\'upload sur [url=confrerie-des-traducteurs.fr]la Confrérie des Traducteurs[/url].\r\n[*][url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/vetements_et_objets/bandoulieres___sacs_et_sacoches.php]Bandoulières - Sacs et sacoches[/url], traduit par Clarwarrior. Toujours nécessaire pour les armures d\\'Argoniens.\r\n[*][b]Dragonborn[/b] pour les vêtements de Dunmer.\r\n[*][url=http://skyrim.nexusmods.com/mods/31470/]Froid et Humide[/url] (traduit par Mesut-Ozil) et son plugin Cendres (également traduit par Raphou112), pour les vêtements Dunmer.[/list]\r\nChacun de ces mods n\\'est pas nécessaire à proprement parler, car l\\'ensemble du mod est complètement modulable, car divisé en plusieurs .esp : il ne tient ainsi qu\\'à vous de choisir ce que vous souhaitez installer !\r\n\r\n\r\n[size=5][u]Présentation[/u][/size]\r\n\r\n[size=5]Les Khajiits[/size]\r\n\r\n[size=4]i) Les vêtements Khajiits[/size]\r\n\r\nL\\'idée de base s\\'est développée autour de cette trame, cette partie sera donc assez détaillée afin d\\'expliquer l\\'idée d\\'origine.\r\n\r\nLa base fut conçue sur [b][i]l\\'armure d\\'Assassin Royal de Dreamburrows[/i][/b], en altérant un certain nombre de PNJ Khajiits afin de leur vêtir à partir de ce vêtement plutôt que par des vêtements de marchands ou de fermiers standards.\r\nLe but de l\\'auteur fut de donner réellement l\\'impression que les Khajiits sont des étrangers originaires d\\'une terre lointaine de Bordeciel, de telle sorte que les nordiques, avec leur amour du bon acier bien solide, trouveraient les Khajiits complètement extravagants. Ces vêtements sont conçus pour représenter leur différence culturelle et identitaire.\r\n\r\nLes vêtements conçus par Dreamburrow sont une vraie réussite et existent en deux versions : armure légère et vêtement, chacune en six variantes de couleurs et deux variantes de capuchon ou d\\'écharpe. Tout cela devrait être suffisant afin de garantir que chaque Khajiit que l\\'on pourrait rencontrer en jeu ne porte pas les mêmes vêtements que son voisin, tout en donnant l\\'impression qu\\'ils appartiennent à la même culture.\r\n\r\nDes approches diverses ont été faites afin de vêtir les Khajiits.\r\nTout d\\'abord, les PNJ rencontrés le plus souvent, dont la plupart appartiennent aux caravanes, se sont vus attribuer leurs vêtements individuellement. L\\'auteur a essayé de rechercher des vêtements qui correspondraient aux apparences des PNJ : ainsi, Ahkari porte des vêtements violets qui s\\'accordent avec ses yeux, et Ma\\'jhad porte la variante noire du vêtement, comme sa fourrure. De la même façon, les hommes Khajiits portant des rouflaquettes ne portent jamais de capuchon, afin d\\'éviter tout clipping, et les PNJ avec des coiffures plus marquantes (Ri\\'saad, par exemple) auront plus tendance à porter des écharpes. L\\'auteur s\\'est assuré que sur chaque caravane, certains PNJ utilisaient l\\'apparence standard, et d\\'autres la variante. La différence n\\'est peut-être pas flagrante, mais elle est là.\r\nEn second lieu a été considéré les vêtements des PNJ rencontrés aléatoirement, ceux-ci étant la plupart du temps décédés. Leurs vêtements ont été générés de façon aléatoire à partir du set d\\'Assassin Royal. Ainsi, lorsque l\\'on pourrait tomber sur un Khajiit mort dans la prison d\\'un donjon, il ou elle portera un vêtement approprié, mais (à moins de ne pas avoir de chance) différent de celui du Khajiit mort de la cellule d\\'à côté. Un ou deux Khajiits en vie se sont également vus attribuer un vêtement généré aléatoirement.\r\n\r\nCela dit, certains PNJ n\\'ont intentionnellement pas été modifiés :\r\n[list][*]Les Khajiits travailleurs, comme les mineurs ou le gardien du phare de Solitude, n\\'ont pas été altérés.\r\n[*]Les Assassins Khajiits que vous pourrez parfois rencontrer n\\'ont pas été modifiés, afin de ne pas créer de conflit avec l\\'armure de la Confrérie Noire.\r\n[*]Mai\\'q n\\'a pas été modifié : n\\'est-il pas déjà parfait ?[/list]\r\n\r\nUne autre modification a été effectuée : la cuisinière Khajiit que l\\'on peut rencontrer à l\\'ambassade Thalmor, Tsavani, porte maintenant un vêtement de Chef cuisinier, au lieu du vêtement de fermière qu\\'elle portait précédemment.\r\n\r\nDepuis la version 2.0 a été intégrée la retexture des capuchons de Rougegarde de granzh, conçue afin de correspondre aux couleurs du set d\\'Assassin Royal. À présent, Akhari, par exemple, porte un capuchon violet qui s\\'accorde avec ses vêtements !\r\n\r\n\r\n[size=4]ii) Les vêtements de Khajiits - plugin pour [b][i]Froid et Humide[/i][/b][/size]\r\n\r\nLa version 2.0 altère le mod [b][i]Froid et Humide[/i][/b] et le force à ignorer les PNJ Khajiits. L\\'inconvénient est qu\\'à présent, il n\\'est plus possible de voir un Khajiit porter un manteau ou un capuchon de [b][i]Froid et Humide[/b][/i] ; l\\'avantage certain est qu\\'il a été possible d\\'utiliser les capuchons de Dreamburrow sans avoir à s\\'inquiéter de conflits ou de clipping.\r\n\r\n\r\n[size=4]iii) L\\'armure de Khajiit[/size]\r\n\r\nPour l\\'armure des Khajiits, l\\'auteur a choisi d\\'utiliser l\\'[b][i]armure de Samouraï Akavirii[/i][/b] de Hothtrooper44. En effet, aucune suggestion n\\'a été faite quant à une correspondance entre les Khajiits et les Samouraïs dans le lore de Skyrim, mais l\\'auteur recherchait essentiellement une armure qui donne vraiment une impression d\\'extériorité culturelle. L\\'armure de Samouraï Akaviri est complexe et composée de beaucoup de petits bouts, mais qui ne ressemble en rien aux grandes plaques d\\'acier des armures nordiques.\r\n\r\nTous les guerrier ou bandits Khajiits n\\'ont pas été modifiés, cependant. Les gardes de caravanes les portent, de même que certains bandits qui ont tendance à se battre au corps-à-corps. Les mages et les archers, cependant, ne l\\'utilisent pas du tout. De même que pour la partie de vêtements, les bandits ont des ensembles générés aléatoirement.\r\n\r\nDeux versions de ce plugin ont été créées : l\\'un utilisant l\\'[b][i]armure de Samouraï Akaviri[/i][/b] en standalone, et l\\'autre utilisant la compilation [b][i]Armures Immersives[/b][/i]. Les deux versions des armures sont, normalement, les mêmes, mais n\\'est-ce pas mieux de donner le choix à l\\'utilisateur ?\r\n\r\n\r\n[size=4]iv) Kharjo[/size]\r\n\r\nKharjo peut lui aussi porter l\\'armure de Samouraï, mais, afin d\\'éviter tout conflit avec d\\'autres mods de compagnons, un plugin séparé a été créé. De même que pour le plugin d\\'armure Khajiit principal, deux versions ont été créées : l\\'une pour l\\'armure seule, l\\'autre pour la compilation.\r\nJ\\'zargo n\\'a pas été altéré du tout.\r\n\r\n\r\n\r\n[size=5]Les Argoniens[/size]\r\n\r\n[size=4]i) L\\'armure argonienne[/size]\r\n\r\nCe plugin-ci utilise l\\'[b][i]armure de Mercenaire Argonien[/i][/b] de Spyke et Mayfly53 et l\\'[b][i]armure du Marais[/i][/b].\r\n\r\nComme pour les Khajiits, l\\'auteur a choisi pour les armures des PNJ les plus importants, tandis que les autres se sont vus attribuer des ensembles aléatoirement. Cette fois-ci, toutefois, il a décidé de vêtir les bandits mages de ces armures ! La plupart des Argoniens bandits que l\\'on rencontre sont effectivement des mages, et il semblait dommage de les laisser vêtus de fourrures.\r\n\r\n\r\n[size=4]Les travailleurs portuaires argoniens[/size]\r\n\r\nCe plugin a modifié les argoniens qui travaillent sur les quais de Vendeaume afin de leur faire utiliser des vêtements de travailleurs plutôt que des vêtements de fermiers. Cela donne bien plus l\\'impression qu\\'ils travaillent sur ces quais, plutôt qu\\'ils sont juste en train de déambuler dans ce coin.\r\nL\\'auteur a également ajouté un petit patch supplémentaire afin de modifier les vêtements de mineur : ainsi, les PNJ travaillant dans les mines n\\'utilisent plus une mais les deux variantes des vêtements de mineur. Ceci peut être vu non seulement sur les argoniens, mais également sur n\\'importe quel PNJ qui utilise cette variante !\r\n\r\n\r\n\r\n[size=5]Les Dunmers[/size]\r\n\r\n\r\nL\\'intégralité des plugins de cette section nécessitent le DLC [b]Dragonborn[/b]. Ce DLC ajoute effectivement un certain nombre d\\'armures et de vêtements Dunmers, et il était donc logique de ne plus les confiner à Solstheim ! Ils seront donc à présent disponibles en Bordeciel.\r\n\r\n[size=4]i) Plus de capuchons pour les vêtements Dunmer[/size]\r\n\r\nCe changement est léger, et fait en sorte que les vêtements Dunmer n\\'apparaissent plus que dans leur version \\\"Sans Capuchon\\\". La raison pour cela est simple : l\\'utilisation de [b][i]Froid et Humide[/i][/b]. Sans ces capuchons inclus, les Dunmer utiliseront les capes et capuchons générés par ce mod ; ou, dans le cas de son plugin [b][i]Cendres[/i][/b], des protections de visages et des verres.\r\nCe plugin affecte le suivant, il doit donc être installé [u]avant[/u] celui-ci.\r\n\r\n[size=4]ii) Armures et vêtements Dunmer[/size]\r\n\r\nLe DLC Dragonborn a inclus trois versions différentes des vêtements Dunmer, ils ont ainsi été ajoutés également à un certain nombre de Dunmer en Bordeciel. Mais pas à tous ! Cela serait ridicule. Bien sûr, on rencontre la plupart des Dunmers autour de Vendeaume, et y porter des vêtements traditionnels Dunmer peut être considéré comme un signe mineur de rebellion. Les Dunmer qui tentent de s\\'intégrer cependant, comme le barde de l\\'auberge du Candélâtre ou qui sont employés par un Nordique, ne portent habituellement pas de vêtements traditionnels. On peut néanmoins rencontrer un certain nombre de Dunmers arborant ces vêtements dans le Quartier Gris de Vendeaume.\r\nÀ l\\'extérieur de Vendeaume, toutefois, porter ces vêtements est moins sujet à jugement. Les fermiers et les mineurs auront toujours tendance à porter leurs vêtements de travail, mais les marchands de Faillaise, par exemple, pourront être vus portant des vêtements Dunmer - cette ville-ci est plus tolérante.\r\nL\\'auteur a tenté d\\'éviter de trop développer ce plugin. Ainsi, il devrait y avoir suffisamment de vêtements traditionnels Dunmer afin qu\\'ils aient une véritable identité culturelle, mais assez peu pour que tous les Dunmer ne ressemblent pas.\r\n\r\nIl sera également possible de trouver quelques armures de chitine, parfois même l\\'ensemble entier, mais plus souvent différentes parties séparées de l\\'armure.\r\n\r\nDans le temple de Raven Rock, vous pourrez trouver des autels d\\'Azura, de Boethia et de Mephala, qui sont les divinités principales de la religion Dunmer. Ainsi, l\\'auteur a jugé bon de mettre ces robes en relation avec les Daedra. En l\\'occurrence, la prêtresse de Boethia portera le vêtement des prêtres du temple de Raven Rock, ainsi que, optionnellement, deux PNJ mentionnés ci-dessous.\r\n\r\nL\\'auteur a également ajouté des versions de la robe Telvanni, portant l\\'enchantement standard de régénération magique, mais sans l\\'apparence de Cœur de Pierre pour personnages féminins. Ainsi, comme pour les robes du temple, l\\'auteur n\\'a donné ce vêtement qu\\'à deux PNJ : Daylas Valen (l\\'investigateur de la légende de Galdur) et Maluril (sur qui a été fait un Contrat de la Confrérie Noire). De même, il a rendu ces robes disponibles pour les PNJ mages que l\\'on peut rencontrer dans Bordeciel, mais elles demeurent très rares.\r\n\r\n[size=4]Les compagnons spécifiques[/size]\r\n\r\nTout comme pour Kharjo, un plugin séparé a été fait pour Jenassa. En l\\'installant, elle portera un ensemble d\\'armure de chitine légère (sans le casque cependant).\r\nLa prêtresse d\\'Azura, Aranea Ienith, peut également porter une robe du Temple. Une fois encore, un fichier séparé a été inclus, au cas où d\\'autres mods altèreraient les compagnons.\r\nEnfin, le mod inclut un dernier fichier pour Logrolf, le prêtre de Beothiah que Molag Bal nous envoie chasser. Il portera avec ce plugin la robe du Temple, mais l\\'auteur l\\'a également changé en Dunmer. Cela ne sera évidemment pas du goût de tous, mais c\\'est pour cela que la modification est modulable, pas vrai ?\r\n\r\n\r\n[size=5][u]Problèmes connus[/u][/size]\r\n\r\nLe seul bug connu est lorsque l\\'on passe de la version standard à la version [b][i]Froid et Humide[/i][/b] : il peut arriver que certains PNJ continuent à porter leurs anciens vêtements, voire à ne rien porter du tout. Mais ce bug est soluble facilement en passant par la console, grâce à un petit \\\"disable/enable\\\" sur le PNJ concerné.\r\n\r\n\r\n[size=5][u]Installation[/u][/size]\r\n\r\n[b]Avec le Nexus Mod Manager[/b]\r\n[list][*]Dans l\\'onglets \\\"Files\\\", cliquez sur \\\"Download with Manager\\\" pour chaque plug-in que vous souhaitez utiliser. Le téléchargement commencera.\r\n[*]Dans l\\'onglet \\\"Mods\\\" du NMM, cliquez sur le bouton bleu à flèche verte en haut à gauche : \\\"Activates the selected mod\\\".\r\n[*]Vérifiez que vous possédez bel et bien les mods nécessaires au fonctionnement de chaque plug-in, et que les fichiers .esp de ces mods sont bien chargés [u]avant[/u], dans l\\'ordre de chargement.\r\n[*]Si vous utilisez [url=http://skyrim.nexusmods.com/mods/21577//?]la version de FishNyx de Immersive Armors[/url], allez dans le dossier Data de Skyrim (en général, C:\\\\\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\skyrim\\\\Data ou C:\\\\\\\\Program Files\\\\Steam\\\\SteamApps\\\\skyrim\\\\Data) et renommez les fichiers [b]Immersive Armors - Français.bsa[/b], [b]Immersive Armors - Français.bsl[/b] et [b]Immersive Armors - Français.esp[/b] en [b]hothtrooper44_ArmorCompilation.bsa[/b], [b]hothtrooper44_ArmorCompilation.bsl[/b] et [b]hothtrooper44_ArmorCompilation.esp[/b].\r\n[color=red]Si vous ne suivez pas ces deux derniers points, Skyrim s\\'arrêtera de fonctionner juste après la cinématique d\\'introduction de Bethesda ![/color]\r\n[*]Si vous utilisez le plugin [i]Plus de capuchons pour les Dunmers[/i] pour les armures vêtements de Dunmer ET les plugins [i]Armures et vêtements Dunmers[/i], vérifiez que le premier est bien placé [u]avant[/u] le second.\r\n[*]Profitez ![/list]\r\n\r\n[b]Manuellement[/b]\r\n[list][*]Dans l\\'onglet \\\"Files\\\" de la page, cliquez sur \\\"download manually\\\" pour chaque plug-in que vous souhaitez utiliser. Le téléchargement commencera.\r\n[*]Extrayez les plugins dans le fichier Data de Skyrim (en général, C:\\\\\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\skyrim\\\\Data ou C:\\\\\\\\Program Files\\\\Steam\\\\SteamApps\\\\skyrim\\\\Data)\r\n[*]Vérifiez que vous possédez bel et bien les mods nécessaires au fonctionnement de chaque plug-in, et que les fichiers .esp de ces mods sont bien chargés [u]avant[/u], dans l\\'ordre de chargement.\r\n[*]Si vous utilisez [url=http://skyrim.nexusmods.com/mods/21577//?]la version de FishNyx de Immersive Armors[/url], allez dans le dossier Data de Skyrim et renommez les fichiers [b]Immersive Armors - Français.bsa[/b], [b]Immersive Armors - Français.bsl[/b] et [b]Immersive Armors - Français.esp[/b] en [b]hothtrooper44_ArmorCompilation.bsa[/b], [b]hothtrooper44_ArmorCompilation.bsl[/b] et [b]hothtrooper44_ArmorCompilation.esp[/b].\r\n[color=red]Si vous ne suivez pas ces deux derniers points, Skyrim s\\'arrêtera de fonctionner juste après la cinématique d\\'introduction de Bethesda ![/color]\r\n[*]Si vous utilisez le plugin [i]Plus de capuchons pour les Dunmers[/i] pour les armures vêtements de Dunmer ET les plugins [i]Armures et vêtements Dunmers[/i], vérifiez que le premier est bien placé [u]avant[/u] le second.\r\n[*]Profitez ![/list]\r\n\r\n\r\n[size=5][u]Remerciements[/u][/size]\r\n\r\nTous les remerciements vont à Matthew Harper (mjharper), auteur de ce mod fantastique. Et à Bethesda, mais voilà quoi.\r\n\r\nAll credit goes to Matthew Harper (mjharper) for his fantastic work. And Bethesda, but meh.",
  "categoryId": "33",
  "version": "2.0",
  "author": "Matthew Harper and Hydroel",
  "createdUnix": "1371292162",
  "updatedUnix": "1371291858",
  "containsAdultContent": false,
  "uploadedBy": "Hydroel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034312",
      "name": "100 Vetements de Khajiits",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5633",
      "fileName": "100 Vetements de Khajiits-36966-2-0.zip",
      "uploadedUnix": "1371290727",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/92ef8732e1f3af8081259da63df9e378acc76ad3ce366e32774a428e3f41e001/analysis/1407604690/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/100%20Vetements%20de%20Khajiits-36966-2-0.zip?fid=1000034312&ttl=1535816349&ri=8192&rs=8192&setec=aba1119beb188ea00fe5933d46e0f2d3"
    },
    {
      "fileId": "1000034313",
      "name": "101 Vetements de Khajiit - Plugin pour Froid et Humide",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "101 Vetements de Khajiit - Plugin pour Froid et Humide-36966-2-0.zip",
      "uploadedUnix": "1371290798",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/b368a6591ffaa523a033d61a46b141b63ccb3d4902b5a6ab7b83f9fa74727219/analysis/1407604690/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/101%20Vetements%20de%20Khajiit%20-%20Plugin%20pour%20Froid%20et%20Humide-36966-2-0.zip?fid=1000034313&ttl=1535816349&ri=8192&rs=8192&setec=191d3f168d3f7492679eeec556491723"
    },
    {
      "fileId": "1000034314",
      "name": "110 Armure de Khajiit - Armure Akaviri",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "101 Armure de Khajiit - Armure Akaviri-36966-2-0.zip",
      "uploadedUnix": "1371290874",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9c62caff1da3226303c7a943c4e0927416003651fb68877a13900a81ab35a8bf/analysis/1407604691/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/101%20Armure%20de%20Khajiit%20-%20Armure%20Akaviri-36966-2-0.zip?fid=1000034314&ttl=1535816350&ri=8192&rs=8192&setec=111768e664c7d3153452f208a419ac83"
    },
    {
      "fileId": "1000034315",
      "name": "111 - Kharjo - Armure Akaviri",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "111 - Kharjo - Armure Akaviri-36966-2-0.zip",
      "uploadedUnix": "1371290925",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/7611371e58672b6862df9e403a2c926cd625087eeee5d44739c8ad6a7109c083/analysis/1407604803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/111%20-%20Kharjo%20-%20Armure%20Akaviri-36966-2-0.zip?fid=1000034315&ttl=1535816350&ri=8192&rs=8192&setec=6a552b35cb6510740272c29d34dfe32c"
    },
    {
      "fileId": "1000034317",
      "name": "120 - Armure de Khajiit - Armures Immersives",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Armure de Khajiit - Armures Immersives-36966-2-0.zip",
      "uploadedUnix": "1371291064",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/fce6ff573c47237effbce27d9adbe24c9273af0adf78af0c310c9db595669a57/analysis/1407604804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Armure%20de%20Khajiit%20-%20Armures%20Immersives-36966-2-0.zip?fid=1000034317&ttl=1535816351&ri=8192&rs=8192&setec=a1202a59804f1cdb8338d0c2012b84db"
    },
    {
      "fileId": "1000034318",
      "name": "121 - Kharjo - Armures Immersives",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "121 - Kharjo - Armures Immersives-36966-.zip",
      "uploadedUnix": "1371291217",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/fce6ff573c47237effbce27d9adbe24c9273af0adf78af0c310c9db595669a57/analysis/1407604804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/121%20-%20Kharjo%20-%20Armures%20Immersives-36966-.zip?fid=1000034318&ttl=1535816351&ri=8192&rs=8192&setec=49b60876e5193da1ce5bb6e18a8eb7f6"
    },
    {
      "fileId": "1000034319",
      "name": "200 - Armures argoniennes",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "200 - Armures argoniennes-36966-2-0.zip",
      "uploadedUnix": "1371291380",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/81b09d12922095e7e1ac94324b453019aa069f419fdb5b36f699594c01590281/analysis/1407604805/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/200%20-%20Armures%20argoniennes-36966-2-0.zip?fid=1000034319&ttl=1535816351&ri=8192&rs=8192&setec=1bbb429cdd5d2425ea67d0bd94546a85"
    },
    {
      "fileId": "1000034320",
      "name": "210 - Dockers argoniens",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "210 - Dockers argoniens-36966-2-0.zip",
      "uploadedUnix": "1371291468",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/1109f7d3c55ac18a33d2d4ada4faf03b6c7eb77b9d27ddb0184a505672d8c20a/analysis/1407604806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/210%20-%20Dockers%20argoniens-36966-2-0.zip?fid=1000034320&ttl=1535816352&ri=8192&rs=8192&setec=3648cdfbe5ab8535c5a6c9ee99909718"
    },
    {
      "fileId": "1000034321",
      "name": "300 Pas de capuchons pour les Dunmers",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "300 Pas de capuchons pour les Dunmers-36966-2-0.zip",
      "uploadedUnix": "1371291598",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a49d0f31321de56eac2fa4b00c2b14592fcb5df2a9c6965c186cc7c51a648be5/analysis/1407604807/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/300%20Pas%20de%20capuchons%20pour%20les%20Dunmers-36966-2-0.zip?fid=1000034321&ttl=1535816353&ri=8192&rs=8192&setec=89fb41925c5ce59816e37a44b6d1f387"
    },
    {
      "fileId": "1000034322",
      "name": "310 Vetements et armures Dunmer",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "310 Vetements et armures Dunmer-36966-2-0.zip",
      "uploadedUnix": "1371291655",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9d7fa41cf9ded1b6ed87d31ca76dff12b3c640f40b5efd5097accaa7670bca90/analysis/1407604807/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/310%20Vetements%20et%20armures%20Dunmer-36966-2-0.zip?fid=1000034322&ttl=1535816353&ri=8192&rs=8192&setec=70964ff271b0619aa71f6422c8b07308"
    },
    {
      "fileId": "1000034323",
      "name": "311 Jenassa",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "311 Jenassa-36966-2-0.zip",
      "uploadedUnix": "1371291709",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/39844f263e62bbeba7aa495637cf82677c620670b9e059612f4bdde609c3a0e2/analysis/1407604938/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/311%20Jenassa-36966-2-0.zip?fid=1000034323&ttl=1535816354&ri=8192&rs=8192&setec=f914e2131c298fed40d76f2922564bf3"
    },
    {
      "fileId": "1000034324",
      "name": "312 Aranea Ienith",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "312 Aranea Ienith-36966-2-0.zip",
      "uploadedUnix": "1371291757",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/f7851912fb8bd2028cfd2c5fb2440ca178dddafc4451a90543cd7b0f7f6397f7/analysis/1407604938/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/312%20Aranea%20Ienith-36966-2-0.zip?fid=1000034324&ttl=1535816354&ri=8192&rs=8192&setec=416f9c092d271ca8e9bb7674ad9eefab"
    },
    {
      "fileId": "1000034325",
      "name": "313 Logrolf",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "313 Logrolf-36966-2-0.zip",
      "uploadedUnix": "1371291858",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/7f84e2cfa2568944692428e459dd068030f24363d3a6d2eaca55fd3ed7943db7/analysis/1407604939/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/313%20Logrolf-36966-2-0.zip?fid=1000034325&ttl=1535816354&ri=8192&rs=8192&setec=08c91385df9096762827bb5eef6b4b52"
    }
  ]
}