{
  "modId": 36964.0,
  "modName": "Skyrim Survival",
  "summary": "Only the strongest will survive in the hostile lands of Skyrim.\r\n\r\nSeuls les plus forts survivront dans les contrées hostiles de Bordeciel.",
  "descriptionHtml": "[center][size=30][color=#0054a6]SKYRIM SURVIVAL[/color][/size][/center]\r\n\r\n[center][URL=http://www.hostingpics.net/viewer.php?id=204107SSIntro.jpg][IMG]http://img4.hostingpics.net/pics/204107SSIntro.jpg[/IMG][/URL][/center]\r\n\r\n\r\n[size=+2][color=#0054a6]I) DESCRIPTION[/color][/size]\r\n\r\nSKYRIM SURVIVAL is a survival mod which makes the game more realistic and harder, by forcing the Player and up to 3 of his companions to fulfill 4 primary human needs in order to not die. Before any journey, the Survivors will have from now to organize their daily management of Hunger, Thirst, Sleep and body Temperature to survive in Skyrim !\r\n\r\n\r\n[size=+2][color=#0054a6]II) NEEDS[/color][/size]\r\n\r\nSurvivors Needs depend first of their Race, Height, Weight, Sex, of their Health, Magicka and Stamina levels, and of their equipment. These theoric values are then modified by their different activities, to create unique needs for characters with unique actions and days.\r\n\r\nExceeding reasonably the required need quantity allows to beneficiate of one hour maximum of bonus, but crossing a certain limit lead to problems, such as vomitings when absorbing too much food or drink.\r\n\r\nMessages will warn Survivors each hour when they\\'ll only have 4 hours resource left for the given need.\r\n\r\n\r\n[color=#0054a6]1) HUNGER[/color]\r\n\r\nCooked meals are better than vegetables or raw meat which can transmit diseases, or than ingredients (no animation) which only feed a bit. Certain drinks also remove slightly Hunger. Each piece of food will provide its own randomly minored or majored values.\r\n\r\n\r\n[color=#0054a6]2) THIRST[/color]\r\n\r\nFavoring Fresh Water rather than any other drink (Water, Stagnant Water, Sea Water, Iced Water, Hot Water) allows to quench the best way without risk to catch Typhus or Dysentery. Potions (no animation) and foods also contain water. Each piece of drink will provide its own randomly minored/majored values.\r\n\r\n\r\n[color=#0054a6]3) SLEEP[/color]\r\n\r\nIt\\'s better to sleep without armor, bellies filled, in a warm interior and his own fine quality bed to be in good form and avoid problems.\r\n\r\n\r\n[color=#0054a6]4) TEMPERATURE[/color]\r\n\r\nSurvivors must try to maintain their Temperature near 37°, by wearing an Helmet, a Cuirass, Gauntlets and solid Boots, or costly clothes to protect themselves from cold. Their theoric Resistance in hours before Hypothermia is modified by the place, altitude, weather, time, humidity of their clothes, and also considerably by iced water. They can at 36° catch Influenza, Pneumonia, or Frostbites which can only be cured by warming near a fire, then below 35° be in Hypothermia, aggravating from a minor to a major state, to death !\r\n\r\n\r\nThe \\\"STATUSES\\\" Page from Menu displays the list of the diseases or problems of the Survivors, and show if their clothes are wet.\r\n\r\n\r\n[size=+2][color=#0054a6]III) ACTIONS & SURVIVAL OBJECTS[/color][/size]\r\n\r\n* Flasks with different capacities can be bought from vendors like Belethor or created at forges in the \\\"Hide\\\" category, depending of the Smithing level. Each Survivor can carry up to 3 flasks.\r\n\r\n* Flasks can be filled by equipping them near a water point.\r\n\r\n* Player can drink water with his hands by maintaining one second the Activate key. He will drink more with a goblet or a mug.\r\n\r\n* Player can warm up and dry his clothes quickly near a fire by maintaining one second the Activate key.\r\n\r\n* Player only can milk cows or goats, by activating them to drink their milk if he has a container for it, or by equipping a flask to fill it. Each animal gives a certain quantity of milk which is renewed each day.\r\n\r\n* Player can use chop wood or wood cut from tree with axes or swords, to create a fire by setting fire to the wood with a Fire or Shock spell.\r\n\r\n\r\n[size=+2][color=#0054a6]IV) SURVIVOR COMPANIONS[/color][/size]\r\n\r\nPlayer\\'s companions can become Survivors if they belong to his Faction. Once the character is targeted, press \\\"Activate SKYRIM SURVIVAL\\\", confirm and wait for the calcul of his needs. The system can be disabled at any moment, but can not then be reactivated.\r\n\r\nClick on each need to configure the linked Artificial Intelligence, allowing for example to make your companions drink when the Player is or to make them automatically unequip their armor to have a better sleep.\r\n\r\nBe careful because essential Companions can die.\r\n\r\n\r\nIMPORTANT ! Activate the mod for a companion only if :\r\n\r\n* you can access at any time to his Inventory, to give him food, a flask or change his clothes.\r\n\r\n* you can make him sleep and wake him when you want.\r\n\r\n* your houses have enough beds or if you can install bedrolls, currently not included in the mod.\r\n\r\n* you can make him equip a potion to cure him or give him a better cold resistance. (facultative)\r\n\r\n\r\n[size=+2][color=#0054a6]V) LANGUAGES & COMPATIBILITY[/color][/size]\r\n\r\n* This mod is in french and in english, and is compatible with other versions of the game. \r\n\r\n* Foods, ingredients and drinks from the 3 DLCs are fully supported. Generic values are used for other mods stuffs.\r\n\r\n* New Races have generic need base.\r\n\r\n* Hunger, Thirst and Sleep are actually not different for vampires, werewolves & cannibals.\r\n\r\n\r\n[size=+2][color=#0054a6]VI) KNOWN PROBLEMS[/color][/size]\r\n\r\n* The detection of certain water points is not very accurate.\r\n\r\n* Companions being told to drink/warm with the Player or in an automatic way may have difficulties because of the ground configuration or locations of fires and water points. Disabling temporarily the corresponding A.I. allows to cancel the action.\r\n\r\n* It happened once that a Companion could not perform anymore a certain number of automatic actions, being though still able to eat and drink with the Player and to fulfill his needs. No explanations yet.\r\n\r\n* I died once of Hypthermia in one second simply by entering Belethor\\'s shop. I currently have no logic explanations for this very rare issue. It\\'s sorcery !\r\n\r\n\r\n[size=+2][color=#0054a6]VII) UNINSTALLATION & UPDATES[/color][/size]\r\n\r\nThis mod must be definitively uninstalled with the \\\"Uninstallation\\\" option of the Menu. It will stop all scripts, remove all objects/diseases and restore decreased Attributes and Skills.\r\n\r\nUsers can update the mod from 1.0 to 1.01 with their current save.\r\n\r\n\r\n\r\nREQUIREMENTS : Skyrim 1.9, SKSE 1.6.13 & SkyUI 3.4\r\n\r\nPERMISSIONS : No permissions of re-upload nor modifications of any kind. This mod is also exclusive to Skyrim Nexus.\r\n\r\nCREDITS : Bethesda, the SKSE & SkyUI teams.\r\n\r\n\r\n******************************************************************************************************************************************************************************************\r\n******************************************************************************************************************************************************************************************\r\n\r\n[center][size=30][color=#0054a6]SURVIE EN BORDECIEL[/color][/size][/center]\r\n\r\n\r\n[size=+2][color=#0054a6]I) DESCRIPTION[/color][/size]\r\n\r\nSURVIE EN BORDECIEL est un mod de survie qui rend le jeu plus réaliste et plus difficile, en obligeant le Joueur et jusqu\\'à 3 de ses compagnons à pourvoir à 4 besoins humains primaires afin de ne pas mourir. Avant tout périple, les Survivants devront désormais organiser leur gestion journalière de la Faim, de la Soif, du Sommeil et de la Température de leur corps pour pouvoir survivre en Bordeciel !\r\n\r\n\r\n[size=+2][color=#0054a6]II) BESOINS[/color][/size]\r\n\r\nLes besoins des Survivants dépendent d\\'abord de leur Race, Taille, Poids, Sexe, de leurs niveaux de Santé, Magie et Vigueur, et de leur équipement. Ces valeurs théoriques sont ensuite modifiées par leurs différentes activités, afin de créer des besoins uniques pour des personnages aux actions et aux journées uniques.\r\n\r\nDépasser raisonnablement la quantité requise de besoins permet de bénéficier d\\'une heure maximum de bonus, mais franchir une certaine limite entraîne des problèmes, comme des vomissements en cas d\\'absorption de trop de nourriture ou de boisson.\r\n\r\nDes messages préviendront les Survivants toutes les heures lorsqu\\'ils n\\'auront plus que 4 heures de ressources pour le besoin donné.\r\n\r\n\r\n[color=#0054a6]1) FAIM[/color]\r\n\r\nLes plats cuisinés sont meilleurs que les légumes ou la viande crue qui peuvent transmettre des maladies, ou que les ingrédients (sans animation) qui ne rassasient que peu. Certaines boissons coupent aussi légèrement la Faim. Chaque morceau de nourriture fournit ses propres valeurs aléatoirement minorées ou majorées.\r\n\r\n\r\n[color=#0054a6]2) SOIF[/color]\r\n\r\nPrivilégier l\\'Eau Fraîche plutôt que toute autre boisson (Eau, Eau Croupie, Eau De Mer, Eau Glacée, Eau Chaude) permet de se rafraîchir de la meilleure façon sans risque d\\'attraper le Typhus ou la Dysenterie. Les potions (sans animation) et les aliments contiennent également de l\\'eau. Chaque exemplaire de boisson fournit ses propres valeurs aléatoirement minorées ou majorées.\r\n\r\n\r\n[color=#0054a6]3) SOMMEIL[/color]\r\n\r\nMieux vaut dormir sans armure, le ventre plein, dans un intérieur chaud et son propre lit de bonne qualité pour être en pleine forme et éviter tout problème.\r\n\r\n\r\n[color=#0054a6]4) TEMPÉRATURE[/color]\r\n\r\nLes Survivants doivent essayer de maintenir leur Température près de 37°, en portant un Casque, une Cuirasse, des Gants et des Bottes solides, ou des vêtements coûteux pour se protéger du froid. Leur Résistance théorique en heures avant Hypothermie est modifiée par le lieu, l\\'altitude, le temps, l\\'heure, l\\'humidité de leurs habits et aussi considérablement par l\\'eau gelée. Ils peuvent à partir de 36° attraper la Grippe, une Pneumonie, ou des Engelures ne pouvant être soignées qu\\'en se réchauffant auprès d\\'un feu, puis en dessous de 35° se retrouver en Hypothermie, s\\'aggravant d\\'un état mineur à majeur, jusqu\\'à la mort !\r\n\r\n\r\nLa Page \\\"STATUTS\\\" du Menu affiche la liste des maladies ou problèmes des Survivants, et indique si leurs vêtements sont humides.\r\n\r\n\r\n[size=+2][color=#0054a6]III) ACTIONS & OBJETS DE SURVIE[/color][/size]\r\n\r\n* Des Gourdes aux différentes capacités peuvent être achetées chez les marchands comme Belethor ou créées aux forges dans la section \\\"Peau\\\", selon le niveau de Forgeage.\r\n  Chaque Survivant peut porter jusqu\\'à 3 gourdes.\r\n\r\n* Les gourdes peuvent être remplies en les équipant à proximité d\\'un point d\\'eau.\r\n\r\n* Le Joueur peut boire de l\\'eau avec ses mains en maintenant une seconde la touche d\\'Activation. Il boira plus d\\'eau avec un gobelet ou une chope.\r\n\r\n* Le Joueur peut se réchauffer et sécher ses vêtements rapidement à côté d\\'un feu en maintenant une seconde la touche d\\'Activation.\r\n\r\n* Le Joueur seul peut traire les vaches et les chèvres, en les activant pour boire leur lait s\\'il possède un récipient pour le contenir, ou en équipant une gourde pour la   remplir. Chaque animal donne une certaine quantité de lait qui est renouvelée chaque jour.\r\n\r\n* Le Joueur peut utiliser du petit bois ou du bois coupé sur les arbres avec haches et épées, pour créer un feu en enflammant le bois avec un sort de Feu ou de Foudre.\r\n\r\n\r\n[size=+2][color=#0054a6]IV) COMPAGNONS SURVIVANTS[/color][/size]\r\n\r\nLes compagnons du Joueur peuvent devenir des Survivants s\\'ils font partie de sa Faction. Une fois le personnage ciblé, pressez \\\"Activer Survie En Bordeciel\\\", confirmez et attendez le calcul de ses besoins. Le système peut être désactivé n\\'importe quand, mais ne pourra plus ensuite être réactivé.\r\n\r\nCliquez sur chaque besoin pour configurer l\\'Intelligence Artificielle liée, permettant par exemple de faire boire vos compagnons lorsque le Joueur boit ou de leur faire enlever automatiquement leur armure pour mieux dormir.\r\n\r\nSoyez prudent car les Compagnons essentiels peuvent mourir.\r\n\r\n\r\nIMPORTANT ! N\\'activez le mod pour un Compagnon que si :\r\n\r\n* vous pouvez accéder à tout moment à son Inventaire, pour lui donner à manger, une gourde, changer ses vêtements.\r\n\r\n* vous pouvez le faire dormir et le réveiller quand vous le voulez.\r\n\r\n* vos demeures possèdent suffisamment de lits ou si vous pouvez installer des sacs de couchage, actuellement non inclus dans ce mod.\r\n\r\n* vous pouvez lui faire équiper une potion pour le soigner ou lui procurer une meilleure résistance au froid. (facultatif)\r\n\r\n\r\n[size=+2][color=#0054a6]V) LANGAGES & COMPATIBILITÉ[/color][/size]\r\n\r\n* Ce mod est en français et en anglais, et est compatible avec les autres versions du jeu. \r\n\r\n* Les aliments, ingrédients et boissons des 3 DLCs sont entièrement supportés. Ceux des autres mods utilisent des valeurs génériques.\r\n\r\n* Les nouvelles Races ont une base de besoins générique.\r\n\r\n* La Faim, la Soif et le Sommeil ne sont actuellement pas différents pour les vampires, loup-garous & cannibales.\r\n\r\n\r\n[size=+2][color=#0054a6]VI) PROBLÈMES CONNUS[/color][/size]\r\n\r\n* La détection de certains points d\\'eau n\\'est pas très précise.\r\n\r\n* Les compagnons devant boire/se réchauffer en même temps que le Joueur ou de façon automatique n\\'y arrivent parfois pas en raison de la configuration du terrain ou des emplacements des points d\\'eau ou des feux. Désactiver temporairement l\\'I.A. correspondante permet d\\'annuler l\\'action.\r\n\r\n* Il est arrivé une fois qu\\'un Compagnon ne puisse plus accomplir une certain nombre d\\'actions automatiques, en pouvant toutefois manger et boire avec le Joueur et remplir ses besoins. Pas d\\'explications pour l\\'instant.\r\n\r\n* Il m\\'est arrivé une fois de mourir de froid en une seconde en rentrant simplement dans le magasin de Belethor. Je n\\'ai pour l\\'instant aucune explication logique à ce très rare problème. C\\'est sorcellerie !\r\n\r\n\r\n[size=+2][color=#0054a6]VII) DÉSINSTALLATION & MISES À JOUR[/color][/size]\r\n\r\nCe mod doit être définitivement désinstallé avec l\\'Option \\\"Désinstallation\\\" du Menu. Cela stoppera tous les scripts, enlèvera tous les objets/maladies et restaurera les Attributs et Talents diminués.\r\n\r\nLes utilisateurs peuvent mettre à jour le mod de la version 1.0 à 1.01 avec leur sauvegarde actuelle.\r\n\r\n\r\n\r\nNÉCESSITÉS : Skyrim 1.9, SKSE 1.6.13 & SkyUI 3.4\r\n\r\nPERMISSIONS : Aucunes permissions de remise en ligne ni de modifications d\\'aucune sorte. Ce mod est également exclusif au Skyrim Nexus.\r\n\r\nCRÉDITS : Bethesda, les équipes de SKSE & SkyUI.",
  "categoryId": "78",
  "version": "1.01",
  "author": "Seigneur Voland",
  "createdUnix": "1370599695",
  "updatedUnix": "1371118204",
  "containsAdultContent": false,
  "uploadedBy": "SeigneurVoland",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034036",
      "name": "Skyrim Survival",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "166",
      "fileName": "Skyrim Survival-36964-1-01.7z",
      "uploadedUnix": "1371118204",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/7e76baadc13b62efa4b8d98438c3f5f62b4bdf7c5831bbc3908b5cbd9a92d759/analysis/1407602223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Survival-36964-1-01.7z?fid=1000034036&ttl=1535816346&ri=8192&rs=8192&setec=35feac2d5094b6a27fa423079388f259"
    }
  ]
}