{
  "modId": 36962.0,
  "modName": "Whisper - Kill Them With Kindness",
  "summary": "Books and a bit more to help you become Thane",
  "descriptionHtml": "[center][img]http://i.imgur.com/qqBtnl1.png[/img][/center]\r<br />[color=red][b]Just a quick notice to current users that this mod is going to be taken down as soon as I reach &#39;that point&#39; in my new mod, which will include better versions of these books, a better shiv (better as in &#39;not a god-killer&#39;) and soooooo much more in the mod that to even hint at it would give away the surprise.\r<br />\r<br />So, if you already use this mod, please be prepared to replace it. :D  If you are just now discovering the mod, feel free to use it while it is still available, but bear in mind that it is being replaced and not updated, so it will be gone soon.\r<br />\r<br />Also, sorry for the redundancy, but I work for the Department of Redundancy Department on alternating weekends sometimes.[/b][/color]\r<br />\r<br />Whisper, a shadowy figure so feared and revered by the people of Skyrim that not a soul dares even mention him or her, has taken an interest in you and your rise to power.\r<br />\r<br />Knowing that there is room in each hold for the honorary position of Thane, Whisper has done some legwork for you in finding out how to &#34;Assist the people of ______&#34;, but isn&#39;t going to just lead you by the nose in your quest to obtain the title.\r<br />\r<br />Oh no...that would be FAR too easy.\r<br />\r<br />Instead, you find yourself in possession of a lengthy letter from Whisper, a set of cryptic journals, and a thin shiv which glows warmly and tingles in your hand.  It is a long and winding road through the forest of favors and deception which is politics and Whisper has merely shown you a rough map.  It is up to you to take the journey.\r<br />\r<br />======================\r<br />\r<br />This is a simple object mod which adds a note, nine books, and an enchanted weapon to your inventory.  The note gives a bit of lore-friendly backstory to help in roleplaying, but this is not an official journal-clogging &#34;Do this, then that&#34; quest.  I&#39;ll leave that sort of stuff to modders more experienced than myself.  \r<br />\r<br />The books themselves list names, locations, and a rough idea of what you will need to do for the person to assist them, letting you go for &#39;easy&#39; jobs like selling stuff or diplomacy or &#39;tough&#39; jobs like dungeon delving and break-ins, etc.,  \r<br />\r<br />The shiv?  Well, that&#39;s good for stealthily giving an opponent some...well...unexpected (and probably unwanted) body piercings.\r<br />\r<br />Installation:\r<br />Either use the Nexus Manager (NMM) to install the mod or unzip the file and place Whisper_Thane.esp into your Skyrim Data folder.\r<br />\r<br />c:&#92;Program Files&#92;Steam&#92;SteamApps&#92;common&#92;Skyrim&#92;Data\r<br />(32-bit Windows)\r<br />c:&#92;Program Files (x86)&#92;Steam&#92;SteamApps&#92;common&#92;Skyrim&#92;Data\r<br />(64-bit Windows)\r<br />\r<br />The &#39;quest&#39; will auto-start and auto-end just that quickly and the new items will be in place.\r<br />\r<br />======================\r<br />\r<br />Un-Installing\r<br />\r<br />Simply remove Whisper_Thane.esp from your Skyrim data directory or delete it through your mod manager.  It is only an item mod, so there is no need to worry about things like clean saves, etc.,\r<br />\r<br />======================\r<br />\r<br />Known Bugs/Conflicts\r<br />\r<br />None that I am aware of.  These are vinilla books, copied from journals and notes in the base game, so no DLCs are required.  \r<br />\r<br />A future release may include a journal on becoming &#34;Thane&#34; of Raven Rock (They don&#39;t call it that though - no Jarls) but even that will still be a base book and will just give people without the Dragonborn DLC a bunch of information that will do them no good whatsoever, right?\r<br />\r<br />======================\r<br />\r<br />Many, MANY thanks to David Brahser, without whose &#34;Auto-Add Your Item or Spell To Player Template&#34; mod/tutorial, these books would not exist outside of my own Excel spreadsheet. http://skyrim.nexusmods.com/mods/12031//?\r<br />\r<br />======================\r<br />\r<br />[color=red][b]My [u]Fallout: New Vegas[/u] Mods:[/b][/color]\r<br />[url=http://newvegas.nexusmods.com/mods/53110]Poppy&#39;s Stash[/url]\r<br />\r<br />[color=red][b]My [u]Skyrim[/u] Mods:[/b][/color]\r<br />[url=http://skyrim.nexusmods.com/mods/36889]Clear My Name[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/37120]Mulligan - College of Winterhold[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/36962]Whisper - Kill Them With Kindness[/url]",
  "categoryId": "27",
  "version": "1.0",
  "author": "ShadowWhisper",
  "createdUnix": "1370583099",
  "updatedUnix": "1370582955",
  "containsAdultContent": false,
  "uploadedBy": "chaophim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033149",
      "name": "Whisper-KTWK",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Whisper-KTWK-36962-1-0.zip",
      "uploadedUnix": "1370582955",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fd87ef946ab562fc95802637489f240d9c180abd2fb08b5aba7f8913f7a3cf17/analysis/1407594939/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whisper-KTWK-36962-1-0.zip?fid=1000033149&ttl=1535816345&ri=8192&rs=8192&setec=81e1ab0fb730628549476719171cc952"
    }
  ]
}