{
  "modId": 36976.0,
  "modName": "Companion Morgan Soul-Summer",
  "summary": "This mods add a Redguard companion in skyrim!\r\nShe can be found in Whiterun at the Drunk Huntsman.",
  "descriptionHtml": "She Is a Redguard Female Companion, it is not set as essential! instead it is set as Protected meaning: i can be kill only by you!\r\n\r\nYou can find her in whiterun in drunk huntsman.\r\n\r\nBackground History: (If you Wanna)\r\n\r\nOriginaly from hammerfell, she was a member of a secret organization that destroys the draugr\\'s.\r\nShe arrive in skyrim to investigate a sudden outbreak of ressurected draugr\\'s. She tried to rout them out, but the overhelming numbers made her retreat to whiterun where she awaits patiently for someone to go with her explore caves, and destroys them all!\r\n\r\nThis is not included in the mod, obviously, just me imaginating things...\r\n\r\nSkills:\r\nOne Handed, Heavy Armor, Destruction, Restoration.\r\nFactions:\r\nPlayerFaction, Potentialfollowerfaction, potentialmarriagefaction, Currentfollowerfaction (-1)\r\nRelationship: PlayerAlly\r\nClass: Combatspellsword**\r\nCombat style: CSSpellsword**\r\n** She only uses magic based attacks in long range, she will use onehanded attacks if she it is in close range to the enemy, or the magicka fully deplets.\r\nWeapon: Scimitar \r\nShield: Imperial Shield (She will not use the shield)\r\nArmor: Steel Plate Armor\r\nSpells:\r\nFastHealing, Flames, healing, J\\'zargo FlameCloack (funny, it acts like a normal Flame Cloack), PowerRedguardStaminaRegen (Witch is only used by the dragonborn as a redguard, proved to be very useful for me anyway).\r\nPerks: Armsman (1-3), Bladesman (1-2), Restoration Novice, destruction Novice apprentice adept, Juggernaut (1-3), WellFitted, Overdraw (1-2)*, Critical Shot*,  Recovery (1-2), regeneration, avoid death, Fists of steel, Cushioned, Tower of strenght, Augmented Flames (1-2)\r\n\r\n* She will sometimes, take off her hunting bow (defaultbythegame) and start shoting arrows to enemys, so this is supose to be a little advantage, when she does this.\r\n\r\nShe is great for a mix off berserker and mage like warrior, she maybe will use all her magicka in spells, but the cloack it doens\\'t use magicka (i think) so it will always be on. For the undead she is my favorite ultimate death dealler. you will find strange because she will run straight to the enemy than backwards to use spells, and then use one handed weapons.\r\nMine strategy:\r\nShe will either be a supporter, and you a defender. or she will kill all undead in a grasp and you still sheating your weapon. I always run straight and attack son the enemy so that she can cloack himself and then act like a mage, then backoff heal yourself and attack again (Hit and Run strategy)\r\n\r\nI do hope you really enjoy this mod, and the other COMPANION CHRYSTAL ICECLEAR, and i feel the need to say sorry, for doing just simples characteres as followers and possible wifes, and nothing more than that. You are free to change my mod, but please let me know, not just for autorization but also to know more about how to improve my skills to make better characteres.\r\n\r\nHappy modding",
  "categoryId": "66",
  "version": "0.1",
  "author": "Pedro Ferraz",
  "createdUnix": "1370632061",
  "updatedUnix": "1370630862",
  "containsAdultContent": false,
  "uploadedBy": "Petermanize",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033209",
      "name": "MOD Morgan SoulSummer",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "166",
      "fileName": "MOD Morgan SoulSummer-36976-0-1.zip",
      "uploadedUnix": "1370630862",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/476e8874a9c08f1389a8b6395c1843291f3d3fb8614adf44e7cc3c744a680cfe/analysis/1407595438/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MOD%20Morgan%20SoulSummer-36976-0-1.zip?fid=1000033209&ttl=1535816374&ri=8192&rs=8192&setec=2be92b81971ba6b445e2b2c96fbffe1e"
    }
  ]
}