{
  "modId": 36973.0,
  "modName": "Companion Chrystal Ice-Clear",
  "summary": "This Mod adds a new companion in skyrim. \r\nthe Dragonborn can find her in Riverwood, in the Sleeping Giant Inn.\r\nMarriable, Follower, !Not Essential!, but protected (Only you can kill her)\r\nRead more...",
  "descriptionHtml": "She is set as Protected, meanning: only you can kill her!!\r\n\r\nYou can find her in riverwood at Sleeping Giant Inn\r\n\r\nA little history shall we? \r\n\r\nBreton Girl, which was part of the forsworn gang in the reach. She was a devoted assassin-magic warrior, and one of the best in their ranks. Altough one day her boyfriend died, and she begged to hagravens to restore her boyfriend to life, they did the briar-heart ressurection. Since then he lost him forever, he did not remember at all, and used her most like a berserker risking her life so that he can live. When she realized the true nature of him she fled and wandered until she find the dragonborn in riverwood. Is up to you what to decide to do with her! Marry, Kill or Let just be Friends!\r\n\r\nOf course that this will not a part of the mod, because 1 is stupid and 2 it is imaginary 3 it is to complex for me to compile all this... things...\r\n\r\nSpecializations:\r\nClass: CombatNightBlade\r\nSkills: One Handed (dual), Light Armor, Sneak, Alteration, Destruction\r\nFactions: PlayerFaction, PotentialMarriageFaction, Potentialfollowerfaction, CurrentFollowerfaction(-1)\r\nRelationship: PlayerAlly\r\nCombatStyle: CSWEAssassinMelee\r\nWeapons: 2 Daedric Daggers\r\nArmor: Leather Armor\r\nSpells: Ebonyflesh, FastHealing, FrostBite, FrostCloak, Healing, Icestorm, Magelight\r\nPerks: Armsman (1-5), DualFlurry(1-2), Bladesman (1-2), FightingStance, savagestrike, dualsavagery, Agiledefender (1-5), Customfit, MatchingSet, unhindered, windwalker, deftmovement, Stealth (1-3), Backstab, mufflemovement, alteration novice apprentice adept expert, magearmor (1-3), destruction novice apprentice adept, destruction dualcasting, augmented frost, deep freeze, Restoration novice, restoration dualcasting, respite, regeneration, recovery (1), avoid death. \r\n\r\nShe is great in ranged magick type ice attacks, and with onehanded dual, but is defense is really bad altough she has all lightarmor perks. \r\nMine BattleStrategy: Berserker!!! Kill all low range hostiles, she acts as a supporter. If the situation is reversed, support her! with Archery, or low destruction spells.\r\n\r\n|||||Well i hope you like my mod, my shame is that it is a really simple and perhaps boring mod, i only make it so that i have more marriage options. If you want to improve this mod, you can do it, but tell me something before, not only for permission but  i really wanna see how i can improve my next mods as well|||||||\r\n\r\nDownload either way (Nexus Downloader Mannager), or mannualy. After Just extract all files inside the Downloaded .Rar to Skyrim Data\\'s directory :)\r\n\r\nHappy modding!",
  "categoryId": "66",
  "version": "0.1",
  "author": "Pedro Ferraz",
  "createdUnix": "1370625687",
  "updatedUnix": "1370626158",
  "containsAdultContent": false,
  "uploadedBy": "Petermanize",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033200",
      "name": "MOD Chrystal IceClear BretonGirl",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "201",
      "fileName": "MOD Chrystal IceClear BretonGirl-36973-0-1.zip",
      "uploadedUnix": "1370626158",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/d6ab26e85b0317ddfb4a7fff9511c08e7af05c4bae847efbac924fdc26c4e3df/analysis/1407595401/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MOD%20Chrystal%20IceClear%20BretonGirl-36973-0-1.zip?fid=1000033200&ttl=1535816366&ri=8192&rs=8192&setec=446989dfd2497b2f6a88737ba71d1216"
    }
  ]
}