{
  "modId": 36997.0,
  "modName": "Spanish Hechizos El clerigo el mago y el ilusionista",
  "summary": "Este mod añade 12 hechizos (4ilusion, 4restauracion y 4 alteracion) utiles y fieles al estilo de juego que equilibran un el numero y la utilidad de todas las ramas magicas ",
  "descriptionHtml": "\r<br />[center][color=#00ff00][size=6]ESTE MOD SE INCLUYE EN SPANISH SKYRIM RECONSTRUCTION[/size][/color][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/60019/?][img]http://static-4.nexusmods.com/15/mods/110/images/60019-1-1416161168.jpg[/img][/url][/center]\r<br />\r<br />La version 1.1 modifica piel de clerigo para afectar a la duracion en todos los aspectos (estaba muy op)\r<br />\r<br />Este mod añade 12 hechizos (4ilusion, 4restauracion y 4 alteracion) utiles y fieles al estilo de juego que equilibran un el numero y la utilidad de todas las ramas magicas \r<br />\r<br />Introduccion: \r<br />Se que existen muchos mods que añaden hechizos a skyrim pero a diferencia de otros este mod no añade una cantidad ingente de los mismos si no solo 12 a las escuelas mas desfavorecidas de skyrim, equilibrandolas en el numero y utilidad. Todos los hechizos son totalmente funcionales y utiles y los tiempos de duracion de hechizos se equilibraron con mi otro mod de magia Spanish El Equilibrio de la Magia http://skyrim.nexusmods.com/mods/32178/? (aunque se puede usar de manera independiente)  \r<br />\r<br />Descripcion:\r<br />\r<br />---------------------------------------------------Alteracion---------------------------------------------------------------\r<br />\r<br />-Caminar sobre las aguas: Permite al lanzador caminar sobre el agua durante 120seg, puede ser sobrecargado, potenciar el hechizo afecta a su duracion. (Nivel adepto)\r<br />\r<br />-Abrir cerraduras: Abrir cerraduras es un 50% mas facil durante 30 seg, puede ser sobrecargado, potenciar el hechizo afecta a su duracion. (Nivel adepto)\r<br />\r<br />-Piel de animago: aumenta un 25% la resistencia a descargas, fuego, escarcha, venenos y enfermedades y concedeun 15% de resistencia magica durante 120 seg, puede ser sobrecargado, potenciar el hechizo afecta a su duracion. (Nivel experto)\r<br />\r<br />-Piel estimulante: aumenta en 25 la salud, magia y aguante, aumenta la regeneracion de salud, magia y aguante en un 25% y aumenta la velocidad de movimiento en 10% durante 120 seg, puede ser sobrecargado, potenciar el hechizo afecta a su duracion. (Nivel experto)\r<br />\r<br />---------------------------------------------------Restauracion------------------------------------------------------------\r<br />\r<br />-Curar enfermedades y venenos: Elimina cualquier enfermedad o veneno del lanzador (no cura vampirismo o licantropia) puede ser sobrecargado pero no tiene efectos (nivel aprendiz)\r<br />\r<br />-Limpiar: Elimina todos los efectos temporales del lanzador, puede ser sobrecargado pero no tiene efectos (nivel adepto)\r<br />\r<br />-Cancelar: Elimina todos los efectos temporales del objetivo, puede ser sobrecargado pero no tiene efectos (nivel experto)\r<br />\r<br />-Piel de clerigo: Concede 5 puntos de salud, magia y aguante por segundo y 50 a la capacidad de carga durante 120 seg, puede ser sobrecargado, potenciar el hechizo afecta a su duracion. (Nivel experto)\r<br />\r<br />---------------------------------------------------Ilusion------------------------------------------------------------------\r<br />\r<br />-Señuelo: Creas un señuelo (zorro artico señuelo) para distraer al enemigo. puede ser sobrecargado, potenciar el hechizo afecta a su duracion, debido a las caracteristicas unicas de este hechizo se ve afectado por algunas habilidades de conjuracion como almas gemelas (nivel aprendiz)\r<br />Nota: para que el hechizo funcione con mas efectividad la habilidad de silenciar hechizos puede ser tremendamente util asi como poder crearlo a mayor distancia (perk conjuracion) su utilidad primordial es hacer moverse al enemigo de la zona custodiado (aunque seguro que alguien le saca otro uso)\r<br />\r<br />-Conceder sigilo: Movimiento amortiguado para el objetivo durante 180 seg. puede ser sobrecargado, potenciar el hechizo afecta a su duracion. (Nivel adepto)\r<br />\r<br />-Conceder invisibilidad: Vuelves invisible al objetivo durante 30 seg, puede ser sobrecargado, potenciar el hechizo afecta a su duracion. (Nivel experto)\r<br />\r<br />Nota: estos 2 ultimos hechizos son altamente utiles para personajes que usen el sigilo y seguidores.\r<br />\r<br />-Controlar mente: Permite controlar la mente del objetivo de nivel 35 o inferior durante 45 seg, usa las 2 manos, potenciar el hechizo afecta a su duracion. (Nivel maestro)\r<br />\r<br />Nota: Debido al caracter unico de este hechizo tendra efectos diferentes en funcion del objetivo, el efecto basico de este hechizo es hacer creer al objetivo que es nuestro aliado, esto quiere decir que automaticamente dejara de ser agresivo a nosotros, dependiendo de la mente controlada puede ayudarnos en el combate o no ya que no se puede obligar a la mente de una persona noble a cometer crimenes por nosotros, ¿esto que quiere decir? a efectos practicos si es lanzado sobre un ciudadano o guardia este nos considerara como aliado pero no atacara a otros guardias o ciudadanos (aunque los demas ciudadanos, guardias si le veran como un enemigo si lo somos nosotros) sobre cualquier enemigo comun que sea nuestro enemigo el efecto de control sera mucho mayor y atacara incluso a sus propios compañeros. Este hechizo se ve afectado por &#34;señor de la mente&#34; y funciona con cualquier npc a excepcion de dragones y las clases incluidas en &#34;señor de la mente&#34;.\r<br />\r<br />Estos hechizos pueden ser adquiridos como cualquier otro hechizo (normal) de skyrim teniendo en cuante su rango.\r<br />\r<br />Compatibilidad: sera incompatible con otros mods que alteren las listas de hechizos de comerciantes (aunque se puede crear facilmente un parche de compatibilidad) al no añadir hechizos de conjuracion y destruccion, sera totalmente compatible con mods de esas escuelas.\r<br />\r<br />Requerimientos: ninguno. Libre de scripts, se puede instalar y desinstalar sin problemas.\r<br />\r<br />Cualquier duda, sugerencia o error comenten.\r<br />\r<br />Recopilacion de mods http://www.3djuegos.com/comunidad-foros/tema/19228710/0/mods-skyrim-22-05-2013/",
  "categoryId": "75",
  "version": "1.1",
  "author": "Incata",
  "createdUnix": "1370702874",
  "updatedUnix": "1370783604",
  "containsAdultContent": false,
  "uploadedBy": "incata",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033306",
      "name": "Hechizos",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Hechizos-36997-1-0.rar",
      "uploadedUnix": "1370702416",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f36cc2fab1d2e640b25964836815841fc3ac824cf1cdbbd47bbd80638ce88265/analysis/1407596344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hechizos-36997-1-0.rar?fid=1000033306&ttl=1535816419&ri=8192&rs=8192&setec=9db1c8acea34aa49051cf7c3d3583b41"
    },
    {
      "fileId": "1000033466",
      "name": "Hechizos ",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Hechizos -36997-1-1.rar",
      "uploadedUnix": "1370783519",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ee1e4c4a613ef1b23d36bda54a074b5712a8f6e1b840fe7e99d975c50146ce5b/analysis/1407597768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hechizos%20-36997-1-1.rar?fid=1000033466&ttl=1535816420&ri=8192&rs=8192&setec=033cd0f2c4f3230a388c5b4e5be37e9a"
    },
    {
      "fileId": "1000033467",
      "name": "Hechizos caros",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Hechizos caros-36997-1-1.rar",
      "uploadedUnix": "1370783604",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b20e49a09f676c04a10baff5428d230e0649b523ac6bc9349552b9df5c99ed5e/analysis/1407597768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hechizos%20caros-36997-1-1.rar?fid=1000033467&ttl=1535816420&ri=8192&rs=8192&setec=62c90f1191e6a6f4abed3dba9459a67b"
    }
  ]
}