{
  "modId": 37003.0,
  "modName": "FMO - Forge Menu Overhaul",
  "summary": "Overhauls the Forge Menu interface.  This makes your forge menu less cluttered by giving recipes an extra level of categorization, where you can craft an item to activate a group of recipes and re-craft it to deactivate those recipes.",
  "descriptionHtml": "[center][size=4][b][i]Toxi2k made a neat XP gain fix which will make it so crafting AActivators/DActivators \r<br />will not give you experience.  [url=http://skyrim.nexusmods.com/mods/37207//? ]Try it out[/url] and let us know how it works for you&#33;[/i][/b][/size][/center]\r<br />\r<br />[center][youtube]3Bs7oTAqi8w[/youtube] [youtube]fKgTNnXfvqo[/youtube][/center]\r<br />\r<br />\r<br />[b][size=6]Description:[/size][/b]\r<br />[color=#66CC99]//=====================================================================================================[/color]\r<br />\r<br />How many armor mods do you have?  Have you ever gone to the smithing forge to forge something, \r<br />and found yourself scrolling down a list of recipes A MILE LONG to find it?  Have you ever gotten LOST \r<br />in the forge menu looking for a recipe?\r<br />\r<br />WELL SUFFER NO MORE&#33;\r<br />\r<br />This mod categorizes recipes into a second level of groups.  For instance, all the GLASS armor and \r<br />weapon recipes are categorized into a new section called &#34;GLASS&#34;.  You might be thinking, &#34;But that&#39;s \r<br />making more work for me&#33;&#34;  You&#39;d be right... if you weren&#39;t using a mod like MULTIGLASS, which adds \r<br />7 different colored glass armor and weapons sets to the forge.  That&#39;s 104 recipes in one tab.  With \r<br />this mod you&#39;d have 8 &#34;category&#34; recipes in the tab instead, one for each color of glass and one for the \r<br />vanilla Glass armor and weapons.  You can expand these categories by &#34;crafting&#34; the category title \r<br />(which is free).  Then you can contract them again by crafting the category title again.  BAM&#33;  \r<br />Secondary categories&#33;  I know you love me.  :)\r<br />\r<br />Now you can get every armor mod on the nexus (ok, maybe not that many) and still craft armors and \r<br />weapons in a timely manner&#33;  For the win.\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=6]Compatibility:[/size][/b]\r<br />[color=#66CC99]//=====================================================================================================[/color]\r<br />\r<br />At first I was approaching FMO by going into mods individually and categorizing recipes by hand in the \r<br />creation kit.  However, I quickly realized that this took too long, required me to get into contact with \r<br />too many people, and made this idea ineffective at best.  Thus I began to pursue writing a script for \r<br />use with TES5Edit to completely automate the process.  After several months of code writing, testing, \r<br />and compatibility checking I have two scripts that should allow you to group recipes from the majority \r<br />of mods.\r<br />\r<br />To see the list of mods which I have tested with FMO and the results of my testing, please see the \r<br />document [url=https://dl.dropboxusercontent.com/u/62976555/FMO%20compatibility.rtf]&#34;FMO compatibility.rtf&#34;[/url], as the list is too long to include here.  76% of the mods I&#39;ve tested \r<br />are compatible with FMO.  If you test a mod feel free to let me know so I can add it to the list.\r<br />\r<br />Testing is less necessary now with the 2.10 update, as the majority of mods are instantly compatible \r<br />with FMO.  Incompatibility should only occur with mods with corrupted data or unique item names.\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=6]Installation and Usage:[/size][/b]\r<br />[color=#66CC99]//=====================================================================================================[/color]\r<br />\r<br />Before installing and using FMO you need to get TES5Edit, which is an alternative editing program to \r<br />the Creation Kit.  While TES5Edit may not have some of the cool features the creation kit has, it runs \r<br />faster and allows for the execution of pascal scripts.  This is what makes FMO possible.\r<br />\r<br />You can download TES5Edit [url=http://skyrim.nexusmods.com/mods/25859/]here[/url].\r<br />\r<br />Once you have downloaded and installed TES5Edit you need to copy the scripts and associated text \r<br />files from &#34;FMO.zip/Edit Scripts&#34; into TES5Edit&#39;s &#34;Edit Scripts&#34; folder.  This is located in the directory \r<br />where TES5Edit.exe is.  The scripts should load into TES5Edit automatically when you next run it.\r<br />\r<br />\r<br />[color=#66CC99][b][size=4]{Basic Usage}[/size][/b][/color]\r<br />[b]1.[/b] Start TES5Edit.\r<br />[b]2.[/b] Select and open only the esp and esm files with recipes you wish to sort using FMO.  As of v2.10 \r<br />you can open your entire load order, just beware of overflow errors/running out of system memory&#33;\r<br />[b]3.[/b] Once all the files are loaded, right click anywhere and click Apply Script.\r<br />[b]4.[/b] Select the FMO Script from the dropdown menu and click OK.\r<br />[b]5.[/b] The script will now run. You can see it&#39;s progress in the message window.  You may be prompted \r<br />about using male/female world models.  Click Yes to use the male world model, No to use the female \r<br />world model, Yes To All to use the always use the male world model, and No To All to always use the \r<br />female world model.\r<br />[b]6.[/b] The script will list the found prefixes, and allow you to manually modify them.  If you choose yes go \r<br />to your Edit Scripts directory, as specified, and edit the text document with your changes.  Save it \r<br />and click OK to continue.\r<br />[b]7.[/b] The script will then ask you to specify the name of an existing FMO patch file. Leave the field blank \r<br />and click OK.\r<br />[b]8.[/b] In the next window you need to type the name you wish to use for your FMO patch file.  E.g. &#34;FMO \r<br />patch&#34; (without quotes)\r<br />[b]9.[/b] After a certain amount of time (depending on how many mods you&#39;re running FMO for) the script \r<br />will finish and you will have a new file.  When you close TES5Edit you will be prompted to save the \r<br />file.  Click OK.\r<br />[b]10.[/b] You&#39;re done&#33;  Make sure the FMO patch file loads after the mods it is associated with in your load \r<br />order and check it out at your nearest forge in Skyrim&#33;\r<br />\r<br />\r<br />[color=#66CC99][b][size=4]{The FMO Sorting Script}[/size][/b][/color]\r<br />The FMO Sorting Script is a secondary script I included to fix invalid nameforms in certain mods to \r<br />make it so items sort properly at the forge. This script will go through all the constructable items \r<br />present and look for names which have pre-identified spelling errors or reversed format (suffix-prefix \r<br />instead of prefix-suffix) and fix them. I&#39;d highly recommend using this script whenever you plan on \r<br />using the main script, as it will also give you a preview of how items will be sorted (as of 2.10).  To \r<br />use this script follow the instructions below:\r<br />\r<br />[b]1.[/b] Start TES5Edit.\r<br />[b]2.[/b] Select and open your mod files.  As of v2.10 you can open your entire load order, just beware of \r<br />overflow errors/running out of system memory&#33;\r<br />[b]3.[/b] Once all the files are loaded, right click anywhere and click Apply Script.\r<br />[b]4.[/b] Select  the FMO Sorting Script from the dropdown menu and click OK.\r<br />[b]5.[/b] The script will now run. The script will let you know whenever it changes a name in the  message \r<br />window, so you can see what it&#39;s doing. This script may take a while to execute, so be patient.\r<br />[b]6.[/b] If you wish to see a preview of the prefixes and how items from your mods will be grouped click yes \r<br />in the window.  This will generate a complete list of each prefix and the items associated with it.  I&#39;d \r<br />highly recommend this step&#33;\r<br />[b]7.[/b] You&#39;re done&#33;  You may now proceed to run the main FMO script&#33;\r<br />\r<br />\r<br />[color=#66CC99][b][size=4]{Updating your FMO patch file}[/size][/b][/color]\r<br />**Note: It&#39;s generally better to just generate your entire file from scratch each time**\r<br />\r<br />The FMO script allows a great deal of flexibility.  This includes the capacity to update your FMO patch \r<br />file if you want to add a new mod, without having to re-generate the entire file.  You can do this \r<br />quickly and efficiently by loading up your FMO patch file and the mod(s) you wish to add and then \r<br />modifying the FMO file exceptions text document to exclude the mods already included in your FMO \r<br />patch.  This should work for mod updates as well, as the FMO script will not create records which \r<br />already exists (it checks if records already exist before it makes them).\r<br />\r<br />[b]1.[/b] Start TES5Edit.\r<br />[b]2.[/b] Select and open your FMO patch file and the mods you wish to add to it.\r<br />[b]3.[/b] Take note of the filenames of all the other mods which open (which are master files for the FMO \r<br />patch file).  Add these filenames to &#34;FMO file exceptions.txt&#34;, which is located in the Edit Scripts \r<br />folder.\r<br />[b]4.[/b] Run the FMO script and when prompted about an existing FMO patch file type in the name \r<br />(including the file extension) of your FMO patch file.\r<br />[b]5.[/b] You&#39;re done&#33;\r<br />\r<br />Alternatively, you can also generate a completely new FMO patch file for new mods.  In some \r<br />situations it&#39;s preferable to have multiple FMO patch files, so keep that in mind.\r<br />\r<br />\r<br />\r<br />[color=#66CC99][b][size=4]{Setting User Variables}[/size][/b][/color]\r<br />In each FMO script there is a section where you can set certain user variables.  These user variables\r<br />are useful if you want to print debug messages or make it so FMO categorizes more items.  To set\r<br />these variables you need to open the FMO script (in TES5Edit or a text editor like Notepad++) and\r<br />find the section entitled &#34;SET USER DEFINED SETTINGS HERE&#34;.  From there you can change values to\r<br />true/false based on your preferences.  This is most useful in the main script, but if you want to\r<br />preview prefixes and how items are going to be sorted with the sorting script you should use the\r<br />same values there as well.\r<br />\r<br />As of 2.13 you can set the following variables:\r<br />[list]\r<br />[*][color=#5EA2E5][b]jewelry:[/b][/color] Set this to true to process recipes which produce items with the ArmorJewelry \r<br />keyword.[*][color=#5EA2E5][b]debug:[/b][/color] Set this to true to print a bunch of debug messages while the main script runs.\r<br />[*][color=#5EA2E5][b]pfdebug:[/b][/color] Set this to true to print a bunch of debug messages while the script tries to find \r<br />prefixes.[*][color=#5EA2E5][b]iwcdebug:[/b][/color] Set this to true to print a bunch of debug messages while the script is deciding \r<br />whether or not to process a recipe (the IsWantedCOBJ function).[*][color=#5EA2E5][b]mpdebug:[/b][/color] Set this to true to print a bunch of debug messages while the script is finding the \r<br />model path for an item.[*][color=#5EA2E5][b]choice:[/b][/color] Set this to 9 use female world models or 10 to use male world models for category \r<br />items when the script doesn&#39;t know which to choose.  (this will let you skip the dialog messages)[*][color=#5EA2E5][b]noreprint:[/b][/color] Set this to true to disable the prefixes from being printed to the message log a \r<br />second time when you change them manually.[/list]\r<br />\r<br />\r<br />[color=#66CC99][b][size=4]{Sorting Items at Different Crafting Stations}[/size][/b][/color]\r<br />As of v2.13 sorting items at different crafting stations is no longer supported.  You might wondering \r<br />why I did this.  Basically, I looked into making FMO behave nicely with other crafting stations, but \r<br />ultimately decided it was too much work and wasn&#39;t worth the result.  This script is for sorting \r<br />recipes at the forge, and will continue to do just that.\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=6]Future Plans:[/size][/b]\r<br />[color=#66CC99]//=====================================================================================================[/color]\r<br />\r<br />[list]\r<br />[*]Integrate the experience fix with the main mod.\r<br />[/list]\r<br />\r<br />\r<br />\r<br />[b][size=6]Thanks:[/size][/b]\r<br />[color=#66CC99]//=====================================================================================================[/color]\r<br />\r<br />Toxi2k figured out how to deal with the experience issue with crafting categories, and [url=http://skyrim.nexusmods.com/mods/37207]designed a \r<br />small mod[/url] to share his fix.  Special thanks goes out to him for figuring that out and sharing it with us&#33;\r<br />\r<br />These scripts wouldn&#39;t have been possible without the help of Zilav.  He helped me get started with\r<br />coding Pascal for TES5Edit, provided a draft of the first part of the script, reviewed my code, and \r<br />answered my endless questions along the way.  Thanks Zilav.  You&#39;re the best&#33;  :D",
  "categoryId": "42",
  "version": "2.13",
  "author": "matortheeternal",
  "createdUnix": "1370721952",
  "updatedUnix": "1377917845",
  "containsAdultContent": false,
  "uploadedBy": "matortheeternal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033372",
      "name": "FMO r1 ",
      "version": "2.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "June 2013 r1 -37003-2-00.zip",
      "uploadedUnix": "1370723074",
      "modVersion": "2.00",
      "virusScanUrl": "https://www.virustotal.com/file/02c09980b17c2a8c2943c9f694e1f771194bb1ed6f0e0e5fd33c8673ee5918f8/analysis/1407596896/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/June%202013%20r1%20-37003-2-00.zip?fid=1000033372&ttl=1535816432&ri=8192&rs=8192&setec=c4c2f061e28b7e0c51156548f3f3ec5f"
    },
    {
      "fileId": "1000033693",
      "name": "FMO r2",
      "version": "2.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "June 2013 r2-37003-2-01.zip",
      "uploadedUnix": "1370897389",
      "modVersion": "2.01",
      "virusScanUrl": "https://www.virustotal.com/file/ea00a9102de6b0b4cdb9eed3cbd6eb27c1123610c0b093a66c7d736586866335/analysis/1407599404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/June%202013%20r2-37003-2-01.zip?fid=1000033693&ttl=1535816433&ri=8192&rs=8192&setec=5387499745796d904fd456da43e51940"
    },
    {
      "fileId": "1000033762",
      "name": "FMO r3 beta",
      "version": "2.02beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "June 2013 r3 beta-37003-2-02.zip",
      "uploadedUnix": "1370935189",
      "modVersion": "2.02beta",
      "virusScanUrl": "https://www.virustotal.com/file/bc3e3683094a9ee8aec29caf79af72bb3c27aa4402edbdd91ab3696f0fd7b941/analysis/1407599863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/June%202013%20r3%20beta-37003-2-02.zip?fid=1000033762&ttl=1535816433&ri=8192&rs=8192&setec=e29ec3592d77fd464740152878af71fc"
    },
    {
      "fileId": "1000034111",
      "name": "FMO r4 beta",
      "version": "2.03beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Forge Menu Overhaul r4 beta-37003-2-04beta.zip",
      "uploadedUnix": "1371166143",
      "modVersion": "2.03beta",
      "virusScanUrl": "https://www.virustotal.com/file/4e21b25d1fa03a2d189809a6d3e4815fd5e768aaa11062a9e8b6487f7cfee2a7/analysis/1407602838/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forge%20Menu%20Overhaul%20r4%20beta-37003-2-04beta.zip?fid=1000034111&ttl=1535816434&ri=8192&rs=8192&setec=a0a0da3bd37207c142f0fa8bf95b077c"
    },
    {
      "fileId": "1000035976",
      "name": "FMO r6",
      "version": "2.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "26",
      "fileName": "FMO r6-37003-2-10.zip",
      "uploadedUnix": "1372299388",
      "modVersion": "2.10",
      "virusScanUrl": "https://www.virustotal.com/file/99dc5a0967e259d692946c3cbeefbbb97990e70198e0ec5e064b8f6d65570b03/analysis/1407618504/",
      "changelogHtml": " {General}\r<br />    - The file exceptions text documents have been updated so the scripts will \r<br />      automatically skip files which are unnecessary.  E.g. the sorting script will \r<br />      skip all files which are  recognized as flawlessly compatible, and both scripts \r<br />      skip files which are known to cause CTDs (due to corrupted data).\r<br />    - The FMO script no longer uses suffixes.\r<br />    - Large sections of the code have been re-written to be more efficient, easier to \r<br />      read, and generally better.\r<br />    \r<br />\r<br />{Sorting Script}\r<br />    - The sorting script is now better organized (cleaner code)\r<br />    - The sorting script makes fewer name changes as the new prefix recognition \r<br />      method no longer requires suffixes (so grammatical or spelling errors in suffixes \r<br />      no longer have to be fixed).\r<br />    - The sorting script will preview prefixes and the items they&#39;re associated with \r<br />      in a nice easy to understand fashion if the user wishes.  This makes it very \r<br />      useful to run it before running the  main FMO script as it will give you a nice \r<br />       idea of exactly what your forge menu will look like.\r<br />\r<br />{Main Script}\r<br />    - The script no longer uses FMO suffixes.txt to find prefixes, but rather finds \r<br />      them using word quantities.  This allows it to be compatible with all mods that \r<br />      add constructible objects to supported forges that don&#39;t have corrupted data or\r<br />      entirely uniquely named items.\r<br />    - The script will prompt you after prefixes are found, allowing you to manually \r<br />      adjust found prefixes.\r<br />    - The automated prefix finding process has been greatly improved from the beta \r<br />      releases.  It will now be just as fast as the script was with the suffix \r<br />      replacement method (if not faster).\r<br />    - The script will no longer add all loaded files as Masters for the FMO patch. It\r<br />      now only adds files with wanted COBJ records in them as Masters.  This means you \r<br />      can open your entire load order in TES5Edit and run the FMO script without any \r<br />      repurcussions, though I wouldn&#39;t recommend it.  The script may encounter an \r<br />      overflow error past 100 loaded files.\r<br />    - Keyword flags are now used for recognizing item types for assigning activator\r<br />      and deactivator models. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FMO%20r6-37003-2-10.zip?fid=1000035976&ttl=1535816434&ri=8192&rs=8192&setec=62314cc5471e55ff426fadc369f7e448"
    },
    {
      "fileId": "1000037004",
      "name": "FMO r7",
      "version": "2.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28",
      "fileName": "FMO r7-37003-2-12.zip",
      "uploadedUnix": "1372818272",
      "modVersion": "2.12",
      "virusScanUrl": "https://www.virustotal.com/file/7ac261e7b63847e21aebec340be2c9aaa6e1d240c8b60d29c30c632d97384cff/analysis/1407629286/",
      "changelogHtml": " {General}\r<br />    - FMO now boasts several configuration options as to the recipes you want to skip.\r<br />      In the script&#39;s code you&#39;ll find a section that says \"SET USER DEFINED SETTINGS HERE&#33;\"\r<br />      In this section you can adjust how the script runs.  Allowing clothing recipes,\r<br />      jewelry recipes, or even overriding the keyword sieving process entirely.\r<br />    - Though I didn&#39;t actually change anything in the code, I&#39;ve now alerted users to the\r<br />      fact that FMO can sort items from cooking pots/tanning racks as well if you just add\r<br />      two lines to the \"FMO workbenches.txt\" document.\r<br />\r<br />{Main Script}\r<br />    - Immersive Armors is now flawlessly compatible with FMO.\r<br />    - The Unofficial Skyrim patches are now flawlessly compatible with FMO.  However, I\r<br />      cannot guarantee that the FMO patch generated with them won&#39;t cause CTDs on certain\r<br />      save games.  It&#39;s funky, so make sure you disable FMO, make a new save game, then\r<br />      generate a new FMO patchfile if you&#39;re using these patches.\r<br />    - Weapons and Armor Fixes Redone by kryptopyr is now flawlessly compatible with FMO.\r<br />    - FMO is now flawlessly compatible with mods which patch armor/weapon records changing\r<br />      things like keywords.\r<br />    - Added several debug options which print extra messages to the log for resolving, \r<br />      you guess it, bugs.  (They&#39;re also useful if you want to learn how the FMO script\r<br />      works) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FMO%20r7-37003-2-12.zip?fid=1000037004&ttl=1535816435&ri=8192&rs=8192&setec=4266cc937107e30cd06291c32276da1e"
    },
    {
      "fileId": "1000050951",
      "name": "FMO r8",
      "version": "2.13",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "FMO r8-37003-2-13.zip",
      "uploadedUnix": "1377917845",
      "modVersion": "2.13",
      "virusScanUrl": "https://www.virustotal.com/file/cc1a30fcd17e6a7b66a988a95311e8a0f85073a68b4195fc39f416e57bd77bd2/analysis/1407703085/",
      "changelogHtml": " - Fixed several errors in the keyword sieving process (Nordic Carved not being recognized, and jewelry bugging out)\r<br />- Created a new function that sets all the keywords for the recipes in a category to the keyword used by the category item.  No more opening categories and having to go to different tabs to find the items&#33;\r<br />- Made it so the user can assign keywords to categories (and the items in those categories) if no keyword is present. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FMO%20r8-37003-2-13.zip?fid=1000050951&ttl=1535816435&ri=8192&rs=8192&setec=9dd0f2742d2fc91b42d215601eee9b37"
    }
  ]
}