{
  "modId": 37006.0,
  "modName": "Dual Hand Combo Hotkeys",
  "summary": "Provides with additional 12 double custom hotkeys for any combination of hand-held items or spells allowing you to create two item sets for both hands per single hotkey. Automatic hotkey conflict handling if overlapping with standard game hotkeys. Custom enchanted items supported. Safe and easy to use. Requres SKSE 1.6.15+",
  "descriptionHtml": "[img]http://static1.nexusmods.com/110/mods/images/37006-1-1370724537.gif[/img]\r\n\r\n[heading]Features[/heading]\r\n[list]\r\n[*] 12 custom hotkeys for binding hand-held item sets.\r\n[*] [b][color=red]*NEW*[/color][/b] Up to 2 sets (primary and secondary) per single hotkey with 3 different switching modes.\r\n[*] Bind just about anything that can be held in hands, items, spells, even bare fists.\r\n[*] Two modes of automatic conflict handling when sharing key bindings with standard game hotkeys.\r\n[*] Coded for safety (countering game bugs, idle when in beast or vampire form, gives priority to dragon riding controls).\r\n[*] Works with gamepad and can use keyboard hotkeys while in XBOX mode.\r\n[*] Works with custom enchanted items - no missing effect bugs.\r\n[*] Intuitive and easy to use.\r\n[*] MCM configuration and hotkey management.\r\n[*] Requires SKSE 1.6.15+\r\n[/list]\r\n\r\n[heading]Installation[/heading]\r\n[list=1]\r\n[*] Update Skyrim to minimum 1.9.32.0 version.\r\n[*] Install or update [url=http://skse.silverlock.org/]SKSE[/url] to version 1.6.15 or greater.\r\n[*] You can now download and install the mod.\r\n[/list]\r\n\r\n[heading]Uninstallation[/heading]\r\n[list=1]\r\n[*] Open console and type (StopQuest DHCH).\r\n[*] Save the game.\r\n[*] Uninstall the mod.\r\n[/list]\r\n\r\n[heading]Description[/heading]\r\nD.H.C.Hotkeys has a single purpse, to allow binding of hand-held item sets to a single hotkey. By default 12 custom hotkeys are bound to a single keyboard row (1, 2, ..., 9, 0, minus, equals) but you can change it to anything you like or even keep 11 of them unbound and use only one hotkey. As you might noticed 8 of the keys are overlapping with standard game hotkeys by default and this I made on purpose for the sake of reducing active key clutter, thanks to the addition of conflict handling routines. You can also create two equip sets per single hotkey and easily switch between them allowing up to 24 equip sets if all 12 custom hotkeys are being used.\r\nProblem that plagued other script-equip mods not allowing custom enchants to be applied is now gone thanks to new SKSE. I also made couple of small safety measures to prevent hotkeys from working when switching to non-humaniod race or when riding a dragon in which case all conflicting custom keys are blocked.\r\n\r\n[heading]Configuration[/heading]\r\nMod can be configured only thorugh SkyUI MCM where you can also preview custom item sets, swap their slot positions, empty them individually or all at once. More info is available in MCM and will show when you highlight each option.\r\n\r\n[heading]Storing Item Sets Into A Custom Hotkey Slots[/heading]\r\nBinding hand-held item sets to a custom hotkey slots is not much different from what you usually do via favorites menu. Just equip desired items to each hand and press any custom hotkey while inventory or magic menu is open. Menu will pop showing you previously saved set for that hotkey slot and showing currently equipped set. You can then choose to create new set or clear the old one and free the hotkey. All item/spell combinations are possible so you can basically create a hotkey for unarmed combat.\r\n\r\n[heading]Hotkey Conflict Handler[/heading]\r\nIf you decide to use default mod key bindings which will overlap with standard game hotkeys, you can choose how hotkey conflicts are handled by changing custom hotkey priority in config. It can be set to either Normal or High.\r\nWhen set to Normal it will handle conflicts with standard game hotkeys by giving priority to a hotkey that is being assigned last, allowing you to easily combine custom hotkeys with game hotkeys and swap between them on the fly (e.g. if you bind item set to a custom hotkey conflicting game hotkey will be cleared of any favorited items already assigned to it and vice versa).\r\nHigh priority mode (default) will always clear standard game hotkeys if they are in conflict. This way you give exclusive access to the mod hotkeys and only way to free a hotkey to be used by the game in favorites menu is to manually clear the item set, which is as simple to do as to create a new set and is done via same menu.\r\n\r\n[heading]Limitations[/heading]\r\nIt is not possible to treat same items individually (e.g. mod knows no difference between tempered, custom enchanted and renamed items). Items that you find in game as enchanted do not fall into this category, they are not the same items as mundane. At the end of the day it is the game that decides which item reference of the same base is going to be equipped and you can assist by removing all redundant items from the base stack by storing them somewhere else.\r\n\r\n[heading]Compatibility[/heading]\r\nIt should work in combination with any other mod. Just be careful when binding keys to ones already used by other mods or by the game. Best to avoid that if you don\\'t know what is really happening when mod is processing the key presses. I will repeat, it is safe to overlap this mod\\'s custom hotkeys with standard game hotkeys, it has been coded with that in mind.\r\n\r\n[heading]Known Issues[/heading]\r\nGame will crash if you attempt to bind items to a custom hotkey when used on a new character that has never opened favorites menu before. Crash is related to usage of SKSE function GetHotkeyBoundObject() inside of mod\\'s conflict handling routines under the abovementioned circumstances. To prevent the crash simply favorite any item and open favorites menu, you have to do this only once per new character.\r\n\r\n[heading]Credits[/heading]\r\nSKSE team for making this mod possible!\r\n\r\n[heading]Change Log[/heading]\r\n[list]\r\nV1.2\r\n[*] Equip sets are now broken into primary and secondary set per single hotkey. You must have primary set created in order to create secondary set. There are 3 secondary set equip modes: alternate, modifier and mixed. Alternate mode will equip primary set if it is not equipped and pressing hotkey again will alternate between primary and secondary. Modifier mode will equip secondary set only if modifier key is pressed (modifer key is customizable, LALT by default). Mixed mode works like Alternate mode but equips secondary set first if modifier key is pressed.\r\n[*] New config option to treat 1H+unarmed combos as single 1H items, which will prevent disarming of the other hand. This is useful when for example you\\'re using dual destruction spells and want only to replace one hand with a ward spell. Switching from 2H item to 1H+unarmed will always leave one hand unarmed.\r\nV1.1\r\n[*] Worked around couple of game bugs that would occur when switching from two-handed weapons. By default game restores previously used 1H items and spells when 2H weapon is unequipped. This causes couple of bugs when switching between one set of 1H items and 2H weapon back and forth: 1. If both 2H and RH are enchanted, charge amount is transfered to restored RH item; 2. If game restores to custom enchanted shield, enchantment effect will not be applied; 3. Third one is mostly SKSE related - If dual wielding two of the same 1H weapons that do not have same temper quality, switching back from 2H weapon would cause right hand weapon to be technically unequipped while model still appearing in the right hand. All these bugs are countered by equipping dummy spells in both hands when switching from 2H weapon, before set items are equipped. You will not notice anything in game because it all happen in a few milliseconds but it fixes all the abovementioned bugs at once.\r\nV1.0\r\n[*] Initial release.\r\n[/list]",
  "categoryId": "42",
  "version": "1.2",
  "author": "Alek",
  "createdUnix": "1370734899",
  "updatedUnix": "1373188042",
  "containsAdultContent": false,
  "uploadedBy": "mitchalek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033399",
      "name": "DHCHotkeys v1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "43",
      "fileName": "DHCHotkeys v1_0-37006-1-0.zip",
      "uploadedUnix": "1370734610",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/50a481afa1f4013bffe1257943cad2269682fdc934e97a6bbf26163f0e748c82/analysis/1407597088/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DHCHotkeys%20v1_0-37006-1-0.zip?fid=1000033399&ttl=1535816440&ri=8192&rs=8192&setec=06613d7722a53ef68297ed5d5388c803"
    },
    {
      "fileId": "1000033923",
      "name": "DHCHotkeys v1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "44",
      "fileName": "DHCHotkeys v1_1-37006-1-1.zip",
      "uploadedUnix": "1371034224",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/fe3b39b26c66e0c2a70b4dd28133b93c728d1bd7930175783e6eb9d1544be9dc/analysis/1407601107/",
      "changelogHtml": " Worked around couple of game bugs that would occur when switching from two-handed weapons. By default game restores previously used 1H items and spells when 2H weapon is unequipped. This causes couple of bugs when switching between one set of 1H items and 2H weapon back and forth: 1. If both 2H and RH are enchanted, charge amount is transfered to restored RH item; 2. If game restores to custom enchanted shield, enchantment effect will not be applied; 3. Third one is mostly SKSE related - If dual wielding two of the same 1H weapons that do not have same temper quality, switching back from 2H weapon would cause right hand weapon to be technically unequipped while model still appearing in the right hand. All these bugs are countered by equipping dummy spells in both hands when switching from 2H weapon, before set items are equipped. You will not notice anything in game because it all happen in a few milliseconds but it fixes all the abovementioned bugs at once. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DHCHotkeys%20v1_1-37006-1-1.zip?fid=1000033923&ttl=1535816440&ri=8192&rs=8192&setec=cc527def3de9f3c2ef339164e1848953"
    },
    {
      "fileId": "1000037653",
      "name": "DHCHotkeys v1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53",
      "fileName": "DHCHotkeys v1_2-37006-1-2.zip",
      "uploadedUnix": "1373188042",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/45f592827175df9d9cf3efa8e0e75e86eddfcba2b51791f98def341a9ec2ddc6/analysis/1407633806/",
      "changelogHtml": " Equip sets are now broken into primary and secondary set per single hotkey. You must have primary set created in order to create secondary set. There are 3 secondary set equip modes: alternate, modifier and mixed. Alternate mode will equip primary set if it is not equipped and pressing hotkey again will alternate between primary and secondary. Modifier mode will equip secondary set only if modifier key is pressed (modifer key is customizable, LALT by default). Mixed mode works like Alternate mode but equips secondary set first if modifier key is pressed.\r<br />\r<br />New config option to treat 1H+unarmed combos as single 1H items, which will prevent disarming of the other hand. This is useful when for example you&#39;re using dual destruction spells and want only to replace one hand with a ward spell. Switching from 2H item to 1H+unarmed will always leave one hand unarmed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DHCHotkeys%20v1_2-37006-1-2.zip?fid=1000037653&ttl=1535816441&ri=8192&rs=8192&setec=cb99c52bc2ca41b9d8678b8b08dd5007"
    }
  ]
}