{
  "modId": 37034.0,
  "modName": "The Drunken Stone",
  "summary": "NSFW or small children and/or sensitive pets due to foul and quite obnoxious language. You have been warned, but please post all suggestions and complaints in the comments section. I have a crack team of assistants just waiting to respond. \r\nThere are many Magical and Powerful Standing Stones in the vast lands of Skyrim. This is NOT one of them....",
  "descriptionHtml": "NSFW or small children and/or sensitive pets due to foul and quite obnoxious language. You have been warned, but please post all suggestions and complaints in the comments section. I have a crack team of assistants just waiting to respond. \r\n\r\nThere are many Magical and Powerful Standing Stones in the vast lands of Skyrim. This is NOT one of them......The Drunken Stone \r\nKnow one knows where it came from,,, and why it will not leave. \r\n\r\nLike the itinerant party guest that has had one to many of the North\\'s finest Mead, and Ales, singing \r\noff-key and chasing your daughters around, while annoying all that they meet.\r\n\r\n\r\nThe Drunken Stone has them all beat. \r\n\r\nSome say that this is where we get the word \\\"Drunken\\\" from, some say that even the dragons of lore, \r\nmay have actually fled Skyrim just to get away from The Drunken Stone, and it\\'s awful singing. \r\n\r\nSo... Adventurer, are you ready to face the true face of inebriation, well word has come down from sources\r\nclose to beverage serving establishments, that a loud, obnoxious, large rock looking thingy is hanging out it \r\nin the finest of Whiterun\\'s drinking establishments.\r\n\r\nI dare you.  \r\n\r\n(pssst It is in the Bannered Mare Upstairs in the Emperors Suite (that\\'s what I call it)\r\n\r\nFAQ:\r\nThis Mod was made with Skyrim version 1.9.32.08 and may set your Saves on fire if played with any other versions. Also I will personally re-play your old save for you if my mod burns your save. Just give me a call. \r\n \r\nThis Mod WILL allow you see into the future.\r\n\r\nThis Mod was created by an International team of Super-Genuissss. (is that how U spell that?) \r\n\r\nThis Mod WILL grant you the ability to make love like a Sabre-Cat.\r\n\r\nThis Mod WON\\\"T help you play this great game in ANY way, in fact it may just discourage you from ever playing anything ever again. ( I\\'m sorry) \r\n\r\n\r\nInstallation:\r\n\r\nAutomatic Instalation: \r\nI recomend Nexus Mod Manager, as it has been tested with this awesome program. \r\n\r\nManual Instalation:\r\n\r\nJust drop the Drunken Stone files into your Data folder,\r\nand make active with Skyrim launcher.\r\n\r\n\r\nUninstallation:\r\n\r\nAutomatic Uninstallation:\r\n\r\nUse Nexus Mod Mangaer to uninstall \r\n\r\n\r\nManual Uninstall:\r\n\r\nJust delete the Drunken Stone Files into your Data folder\r\n\r\n\r\n\r\nFuture Updates:\r\nTo add more Quotes to the Stones already baudy repertoire, I also encourage anybody who like their quote added, foul language or not leave them in the comments sections I will add them and credit you. \r\n\r\n\r\nKnown Issues:\r\n\r\nNope non, other than my own inexperience in scripting, if you find any problems just let my staff know (ha I wish had staff) \r\n\r\n\r\n\r\nDevelopers:\r\n\r\nThanks To:Adipsycho for testing and Screenies",
  "categoryId": "85",
  "version": "1.2",
  "author": "Fallhammer",
  "createdUnix": "1370792611",
  "updatedUnix": "1370789285",
  "containsAdultContent": true,
  "uploadedBy": "Fallhammer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033475",
      "name": "Drunken Stone",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Drunken Stone-37034-1-2.rar",
      "uploadedUnix": "1370789285",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/04a2cb43148d19e791e028b79b01470756ffe90ba1176806d4f4c23897fd55d0/analysis/1407597829/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Drunken%20Stone-37034-1-2.rar?fid=1000033475&ttl=1535816483&ri=8192&rs=8192&setec=375714aba3f36a38267d6f8c5680e276"
    }
  ]
}