{
  "modId": 37042.0,
  "modName": "Survive The Night",
  "summary": "Nights are scary. If you stay too long in dark areas, you\\'ll become insane!",
  "descriptionHtml": "[center][img]http://img4.hostingpics.net/pics/614019Background01.png[/img][/center]\r\n\r\n[center][img]http://img4.hostingpics.net/pics/310422BannerOverview.png[/img][/center]\r\n\r\nThey say that spirits of the night returned. Some told a story about a game schemed by two Daedric Princes, who choose one man or one woman, and play with their nightmares. Now they\\'re searching for a prey...\r\n\t\r\nAs soon as you launch this mod, you will receive, by courier, a strange blank letter. Reading it will lead you in a dark odyssey where nights are your enemies. From 9 PM to 5 AM, if you stay too long in a dark area, far from any safe places, you will become mad and endure six states of insanity :\r\n\r\n- Anxious : you see some shadows moving, but lights on the road appease you.\r\n- Scared : your vision is starting to be altered and you hear some strange noises...\r\n- Panicked : you become paranoid, see things that don\\'t exist and feel attacked. From now, outdoor lights won\\'t help you.\r\n- Lunatic : the illusions seem real and you have to fight them if you want to survive.\r\n- Insane : you can\\'t walk one step without being attacked by your own mind.\r\n- [color=Darkviolet]Unconscious[/color] (?) : the world of shadows and keepers of your sanity...\r\n\r\nTo retrieve your sanity, you have to search for light and stay [b]maximum[/b] 10 seconds under it.\r\nIf you do not retrieve your sanity under a specific light, search for a brighter one or light a torch, you\\'re still scared!\r\nYour sanity is damaged only when you are out in the wild, far away from [color=chocolate][b]safe places (towns, villages, farms, lumbermills, inns and player\\'s houses).[/b][/color]\r\nIf you are panicked, lunatic or insane, the only way to retrieve your sanity is to go inside a safe place (the game will notify you). \r\nNear safe places, you won\\'t have any illusions, but they will come back as soon as you leave.\r\nThe darker area you\\'re in, the faster your insanity will grow.\r\n\r\n[b]In this mod, your character will be affected by an obscure curse, forbidding him to wait, fast travel, open the inventory and even use his/her own weapons during the night (you will imagine new ones). All these restrictions are cancelled during the day.[/b] Fortunately, you can choose to [color=Red]\\\"pass the night\\\"[/color], if you have the items required (some Calming Herbs, a Thick Blanket, a Trap and a Torch). You can also buy some \\\"Night Safe Kits\\\", that include every items except the blanket. These can be bought from Belethor in Whiterun, along with a strange Dwemer Sensor Device that show weird numbers when you make it spin...\r\n\r\n[color=Red]Please see the Sky UI menu[/color] to have more informations and the keymapping of these new features. Note that you will still be able to use inns and carriages to pass the night (and fast travel if you are not in the wild when night falls).\r\n\r\n[color=Chocolate]Torches have been modified[/color]. Well, not really \\\"modified\\\", but I added a script to force their duration in an agressive way. My torches were eternal and now they last 240 seconds as they should. These are obviously your friends in \\\"Survive The Night\\\". You can also customize their duration, from 60 to 240 seconds.\r\n\r\n\r\n[center][img]http://img4.hostingpics.net/pics/854964BannerInstallation.png[/img][/center]\r\n\r\nThis mod needs no DLC, but [URL=skyrim.nexusmods.com/mods/3863]SkyUI[/URL] and [URL=skse.silverlock.org]SKSE[/URL] are required.\r\n\t\r\nTo install, place the BSA and the ESP files into your ...Skyrim\\\\Data folder.\r\n\r\nTo update, you only have to a clean install (delete the mod, launch your game and save it, quit, install the new version, load and play) if you come from the version 1.01. Otherwise, ovewrite the files (BSA and ESP).\r\n\r\nLike in any other mods, [b]uninstallation is unadvised[/b]. However, in the Sky UI menu, you can deactivate the progression of insanity and night restrictions. You will keep the torch modification, but the main mod won\\'t bother you anymore.\r\n\t\r\n\r\n[center][img]http://img4.hostingpics.net/pics/895947BannerCompatibility.png[/img][/center]\r\n\r\nIt should be compatible with every other mods. No vanilla elements have been modified and you can load this mod anywhere you want.\r\n\r\nThis mod is checking your light level, meaning that [b]it is compatible with every DLC and mods, including those that modify climates and weather[/b]. There are two configurations in the Sky UI menu : \\\"Bright nights\\\" and \\\"Dark nights\\\". \\\"Dark Nights\\\" is chosen by default, because it\\'s more credible to play this mod with these. Personally, I use [URL=skyrim.nexusmods.com/mods/11356]Mike Foxs Darker Nights[/URL] to have very dark nights, but you can play Survive The Night with vanilla skies without a problem. Just select \\\"I have bright nights\\\".\r\n\r\n\\\"Survive The Night\\\" do not modify brightness, climates or weathers.\r\n\t\r\n\r\n[center][img]http://img4.hostingpics.net/pics/981030BannerIssues.png[/img][/center]\r\n\r\n- If the SkyUI menu doesn\\'t show, save and reload your game. It only occurs the first time you load the mod into your save.\r\n\t\r\n\r\n[center][img]http://img4.hostingpics.net/pics/600604BannerOtherMods.png[/img][/center]\r\n\r\n[URL=http://skyrim.nexusmods.com/mods/34959/?][img]http://img15.hostingpics.net/pics/681151bannirestr.png[/img][/URL]\r\n[URL=http://skyrim.nexusmods.com/mods/31377][img]http://img11.hostingpics.net/pics/406512banniretbb.png[/img][/URL]\r\n[URL=http://skyrim.nexusmods.com/mods/37816/?][img]http://img15.hostingpics.net/pics/888189bannireweightedarrow.png[/img][/URL]\r\n",
  "categoryId": "78",
  "version": "1.03",
  "author": "Joubarbe",
  "createdUnix": "1370805573",
  "updatedUnix": "1371645746",
  "containsAdultContent": false,
  "uploadedBy": "Joubarbe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034904",
      "name": "Survive The Night",
      "version": "1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3624",
      "fileName": "Survive The Night-37042-1-03.rar",
      "uploadedUnix": "1371645746",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/2cf8ddfecf974c4f43200e3e3f1e2ac0346fb766b57ef7bfe291f96bb918e31e/analysis/1407609255/",
      "changelogHtml": " - Silver sword weigh 0.\r<br />- It is now possible to wait and sleep when you are in an indoor safe location.\r<br />- Added stables as safe locations.\r<br />- Fix a rare bug where you could still use your inventory and map during nights.\r<br />- Now the torches are working as they should&#33; With a message \"This torch won&#39;t burn long\" 20 sec. before it goes out.\r<br />- New Sky UI scripts. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Survive%20The%20Night-37042-1-03.rar?fid=1000034904&ttl=1535816495&ri=8192&rs=8192&setec=f256e58b8c6f902f603d5023fda642b9"
    }
  ]
}