{
  "modId": 37055.0,
  "modName": "Immersive Race Names",
  "summary": "A simple mod which changes the names of four races to their more proper name. Lore friendly. Dark Elves become Dunmer, High Elves become Altmer, Wood Elves are Bosmer and Orcs are Orsimer.",
  "descriptionHtml": "What this mod does is quite simple. It addresses a personal pet peeve I\\'ve always had in the naming convention of the races. It changes the names of four races (Dark Elves, High Elves, Wood Elves and Orcs) to the names they are properly called in their homeland while addressing the fact that they are not called so in the \\\"human\\\" lands.\r\n\r\nDark Elves --> Dunmer\r\nHigh Elves --> Altmer\r\nWood Elves --> Bosmer\r\nOrcs --> Orsimer\r\n\r\nThere is no need to begin a new character for this change to take place. If you\\'re playing an Orc then when you go into the Skills menu the race name should now be Orsimer, for example. This was tested on my Dunmer character.\r\n\r\nThis is a purely aesthetic change and one which I applied to the race descriptions as well to keep a sense of immersion. Not a complex mod but one which I didn\\'t find on the Nexus.\r\n\r\nIn the future I plan to apply this change to all the items in game, changing Dwarven to Dwemer and Orcish to Orsimer as well as any other I come across.\r\n\r\nShouldn\\'t conflict with anything so long as the four race objects are untouched. Let me know if anything conflicts and also if you have any other ideas.",
  "categoryId": "34",
  "version": "1.0",
  "author": "Healey1991",
  "createdUnix": "1370839389",
  "updatedUnix": "1370838957",
  "containsAdultContent": false,
  "uploadedBy": "Healey1991",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033590",
      "name": "Immersive Race Names",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "Immersive Race Names-37055-1-0.zip",
      "uploadedUnix": "1370838957",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bbc2721f1d666eaba70d372ee1da469c51168f1936f7153816f71e68bf869a87/analysis/1407598684/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Race%20Names-37055-1-0.zip?fid=1000033590&ttl=1535816514&ri=8192&rs=8192&setec=2f1cb99df76910eadaec66b2b5c2aa11"
    }
  ]
}