{
  "modId": 37066.0,
  "modName": "Morrowloot - Traduzione Italiana",
  "summary": "Rivisitazione del sistema di Looting con limitazioni al Crafting",
  "descriptionHtml": "Questa è la sola traduzione in italiano della mod [URL=http://tesalliance.org/forums/index.php?/files/file/1412-morrowloot/][color=red]Morrowloot[/color][/URL] di Trainwiz e della sua versione alternativa [URL=http://skyrim.nexusmods.com/mods/19416/?tab=2&navtag=%2Fajax%2Fmodfiles%2F%3Fid%3D19416&pUp=1][color=red]Morrowloot - Nwah Edition[/color][/URL] di wobbuvahi.\r\n\r\nVersioni tradotte: 3.0 e 3.cool\r\n\r\nNOTA.\r\nCome potete notare la versione originale non è più presente sul Nexus e difatti il link inserito sopra rimanda ad una pagina di altro sito.\r\n\r\n[color=red]Morrowloot 3.0:[/color]\r\nQuesto minuzioso lavoro va a modificare tutto il sistema relativo al Looting, rendendolo molto più simile a quello del terzultimo capitolo della saga: Morrowind, da cui il nome della mod.\r\nSono stati rimossi, come forma di bottino classico, tutti gli oggetti considerati rari (Armi e Vesti magiche potenti più Armi/Armature Naniche, Orchesche, Elfiche, di Vetro, d\\'Ebano e Daedriche), i quali sono stati a loro volta reinseriti sotto forma di bottini speciali, ubicati in determinati scrigni in particolari zone, come premio al completamento di un dungeon, per l\\'uccisione di un nemico potente, ecc.. seguendo per altro una certa logica, ovvero gli oggetti di fattura nanica si potranno trovare prettamente presso le rovine dwemer, le armi e le armature orchesche, oltre che in selezionati scrigni, potremo ottenerli solo eliminando un orco, e così via anche per gli altri materiali preziosi. D\\'ebano solo pochi set saranno presenti nel gioco, indossati da personaggi legati alla nobiltà ed ad un certo rango e solo un set daedrico figurerà nell\\'intera ambientazione, del quale le relative componenti risulteranno sparse per le varie zone di Skyrim. Sistema molto più in linea con gli RpG di vecchia data.\r\nSono stati aggiunti inoltre altri oggetti leggendari, importati da Morrowind e, elemento più importante: non sarà più possibile creare armi/armature naniche, orchesche, di vetro, d\\'ebano e daedriche, solo quelle con ossa di drago riusciremo a forgiare. Saremo quindi costretti a trovare tali oggetti durante le varie quest, i quali però potranno essere poi migliorati al bancone della forgia.\r\n\r\n[color=red]Morrowloot - Nwah Edition:[/color] \r\nQuesta versione permette tramite il menù MCM, del quale la mod fa uso ma che non è stato possibile tradurre in ITA, di scegliere se utilizzare il sistema di Crafting Vanilla, quello della Morrowloot 2.0 (la precedente versione) o una versione integrata dall\\'autore che in sostanza rappresenta una via di mezzo.\r\n\r\nPer maggiori ragguagli e per la visione delle immagini rimando alla homepage della mod linkata sopra.\r\n\r\nInstallazione: installate prima la mod originale e poi sovrascrivete i file .esp della traduzione in ITA a quelli presenti nella cartella Data\r\n\r\n[color=yellow]PS: LEGGERE il messaggio in cima alla sezione \\\"POSTS\\\" di questa pagina[/color]\r\n\r\n[color=orange]Per visualizzare la lista completa delle mie traduzioni cliccare [URL=http://skyrim.nexusmods.com/users/4028269/?tb=mods&pUp=1]QUI[/URL][/color]",
  "categoryId": "24",
  "version": "3.0",
  "author": "Lucasssvt",
  "createdUnix": "1370870929",
  "updatedUnix": "1370870804",
  "containsAdultContent": false,
  "uploadedBy": "Lucasssvt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033633",
      "name": "Morrowloot - Traduzione Italiana",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53",
      "fileName": "Morrowloot - Traduzione Italiana-37066-3-0.rar",
      "uploadedUnix": "1370870584",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/f94b0e0ebc871ec95733e16c02fd1e1008d72cd888461c235ab2b8bd803e1904/analysis/1407598986/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morrowloot%20-%20Traduzione%20Italiana-37066-3-0.rar?fid=1000033633&ttl=1535816529&ri=8192&rs=8192&setec=5eda61aa815baaace299a95e081b487a"
    },
    {
      "fileId": "1000033636",
      "name": "Morrowloot - Nwah Edition 3cool - Traduzione Italiana",
      "version": "3.cool",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58",
      "fileName": "Morrowloot - Nwah Edition 3cool - Traduzione Italiana-37066-3-cool.rar",
      "uploadedUnix": "1370870804",
      "modVersion": "3.cool",
      "virusScanUrl": "https://www.virustotal.com/file/568f066bf5d81628550be3d857227afaa4ff39052f49c9b2eb0bcdf36570538b/analysis/1407598987/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morrowloot%20-%20Nwah%20Edition%203cool%20-%20Traduzione%20Italiana-37066-3-cool.rar?fid=1000033636&ttl=1535816530&ri=8192&rs=8192&setec=5c3b2297eb8933065ab4068d6c1abf88"
    }
  ]
}