{
  "modId": 37073.0,
  "modName": "Lakeview Manor Lounge - storeroom conversion",
  "summary": "Converts the North wing storeroom into a lounge for the Dragonborn and guests, with seating, bookcases, planters and trophy bases. ",
  "descriptionHtml": "This is my third Lakeview Manor mod. This one is for those who want additional bookstorage space without sacrificing the Main Hall Master Bedroom. To do this, I have taken the Storage room (north wing) and converted it into a lounge. \r\n\r\nThe idea behind this redesign was to have a place where the Dragonborn can go to entertain friends, swap tales, relax and consume some adult berverages (or skooma). All without interfering with the activities in the kitchen/dining area. The small backroom was just too small and cluttered for such an important function. \r\n\r\nBecause the Storeroom was so cluttered with small items, I basically deleted everything except the lights and a few wall shelves and started from scratch. Visually, the room is divided into three parts. The largest, central part of the room is anchored by three large trophy bases. Two small trophy bases flank the door. A center table with 4 chairs provides a seating area for the Dragonborn and guest. There is a storage chest and dresser against the south wall (for thier traveling gear), and 4 wooden weapon racks (since anyone likely to be a guest of the Dragonborn will probably be the type to carry large weapons with them). \r\n\r\nThe northwest corner contains 4 large bookcases arranged to create a private reading area. A comfortable chair has been placed in this area. The wall shelf here also can take books. Standard capacity is 188 books. \r\n\r\nThe northeast corner is a storage area, with plenty of wine, ale, and mead. \r\n\r\nThe planters in the center of the east/west walls contain plantable soil. \r\n\r\nInstalling: \r\n\r\nThis mod works best if used before the north wing of the house is built. You must build the storage room. Use the workbench inside to build the exterior furniture associated with the storeroom, but do NOT build any of the inside items. Everything should already be there for you. Then disable the workbench as normal and you are done. \r\n\r\nIf you already have the storeroom built, you are going to have a mess of items clipping together. Look carefully at the pictures to see what is supposed to be there. I have included a screenshot of the layout in CK so you can see what the floorplan is. To delete items from the game, open the console (~), select the item you want gone and type markfordelete. The next time the cell loads, the item will be gone. Because of the excessive clutter, it may be easier to do this before enabling this mod. That way you can just delete everything not mounted to the wall (most, but not all, of the wall mlounted items were left in place). Needless to say, remove anything you dont want to lose and make a real (not quick) save before trying this - just incase you accidently delete something you didn\\\\\\'t mean to. \r\n\r\nI hope you enjoy this mod. Please tell me if anything\\\\\\'s not working as it should - I\\\\\\'ll do my best to fix it quickly. Also please check out my other Lakeview mods.",
  "categoryId": "67",
  "version": "1.0",
  "author": "jecoil",
  "createdUnix": "1370881713",
  "updatedUnix": "1370880565",
  "containsAdultContent": false,
  "uploadedBy": "jecoil",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033654",
      "name": "Lakeviewlounge",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Lakeviewlounge-37073-1-0.zip",
      "uploadedUnix": "1370880565",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/82a0f2cadb372e44a9b9b77f24b536cdef8af287679adf320a67d609c299c477/analysis/1407599168/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeviewlounge-37073-1-0.zip?fid=1000033654&ttl=1535816539&ri=8192&rs=8192&setec=814294f49e495e6faed5f526b3317b33"
    }
  ]
}