{
  "modId": 37083.0,
  "modName": "Beastblood Solution - Lycanthropy",
  "summary": "This mod is designed to allow the player to become a Werewolf as many times as they desire, rather than being bound by only being able to contract Lycanthropy a set number of times. This is done through the use of a craftable potion which bestows the player with Lycanthropy, provided they meet certain conditions. It takes the spell used by Aela the",
  "descriptionHtml": "This mod simply takes the spell that Aela the Huntress uses to restore your Lycanthropy, makes a few minor tweaks to the code (not the original code, so don’t worry) in order to make it a little more lore friendly and then applies it to a consumable potion.\r<br />\r<br />If, like me, you can never decide whether or not you want to be a Vampire / Vampire Lord one day and then a Werewolf the next, it can get a little annoying having to stay as a Werewolf long enough until you feel comfortable switching; Vampirism is all too easy to contract in the game but the same cannot be said for Lycanthropy. With the introduction of the Dawnguard DLC, this problem was addressed but not to the extent to which I was happy with; you could still only be blessed (or cursed, depends on who’s story you believe more) one additional time by Aela. If you lost Lycanthropy a second time, the only solution was to either modify the variables used by the Lycanthropy spell and risk future problems or to restart the Dawnguard DLC.\r<br />\r<br />Enter ‘Beastblood Solution’. This craftable potion works in the same way as Aela’s spell but you are not limited to the number of potions you can craft / consume, meaning you are free to switch between being a Vampire / Vampire Lord and a Werewolf as many times as you wish; this brings it on to the same level as the Vampire Lord, in that you may turn into one at any time once the prerequisites have been completed. The potion itself requires 1 Unrefined Werewolf Blood (now dropped by all Werewolves, including those that start dead upon a cell load), 1 Human Flesh (the organic catalyst to which to apply the effect, for as lore friendly as possible purposes) and 2 Juniper Berries (to allow you to hold this vile slosh down).\r<br />\r<br />In order to feel the effects of this potion, there are two requirements. Firstly, you cannot already be a Werewolf; if you are, the potion will simply have no effect (as one would expect). You must also have completed the Companions quest in which you become a Werewolf for the first time; this safeguard has been put in place in order to prevent any future quest script problems. Regardless, you are free to drink the potion at any time, just don’t expect any results unless you have fulfilled the requirements to show you are worthy of Hircine’s blessings. The potion itself works on Vampires / Vampire Lords (in the same way that Aela’s spell does) and if you have completed the ‘Rising at Dawn’ quest and are neither a Vampire / Vampire Lord nor a Werewolf, then fret not, as the potion is not solely intended for a one-jump step from Vampirism to Lycanthropy and will still work.\r<br />\r<br />I have tested this mod under various conditions including its implementation via the NMM and it doesn’t seem to have any unintended, undesirable knock-on effects. Most of the code used in the script already appears in-game, so it’s safe to assume it has been fully tested. So yes, in case you were wondering, this mod does use scripts (one script attached to the potion). Nevertheless, if anyone discovers any problems attributed to this mod, please inform me and I shall endeavour to resolve such issues in as timely a manner as possible.\r<br />\r<br />This is the first mod I have released on to the Nexus so needless to say I am pretty new at this but if it goes down well I hope to release some more in the future (I already have some in the pipeline but since I’m an absolute genius I developed them all in the same .esp file; cue the long and arduous process of separating and isolating each individual mod).\r<br />\r<br />\r<br />Requirements:\r<br />\r<br />-   Dawnguard is required for this mod.\r<br />\r<br />\r<br />Installation instructions\r<br />\r<br />For NMM users (auto):\r<br />\r<br />-   Download the .rar file using the manager.\r<br />-   Find the mod in the list and activate it by using the appropriate button on the side panel.\r<br />\r<br />For NMM users (manual):\r<br />\r<br />-   Download the .rar file.\r<br />-   Launch NMM.\r<br />-   Navigate to ‘Add Mod from File’.\r<br />-   Find the .rar file using the browser, left click it and then select ‘Open’.\r<br />-   The NMM should then add the mod to the list and create a copy of the .rar file in folder it uses to reference the mod list.\r<br />\r<br />For manual download:\r<br />\r<br />-   Download the .rar file.\r<br />-   Extract the folders to the appropriate location (…&#92;Skyrim&#92;Data&#92;); if the folders inside the .rar file already exist inside the Data folder (meshes, textures, scripts) then the sub-folders should be added without interfering with the rest of the files in the folders.\r<br />\r<br />\r<br />Uninstallation instructions\r<br />\r<br />For NMM users:\r<br />\r<br />-   Remove the mod by navigating to the ‘Deactivates the selected mod.’ button. This should remove all files used by the mod.\r<br />\r<br />For manual additions:\r<br />\r<br />-   Remove ‘Beastblood Solution.esp’ from &#92;Skyrim&#92;Data&#92;.\r<br />-   If desired, remove the files used by the mod:\r<br />o   &#92;Skyrim&#92;Data&#92;meshes&#92;Clutter&#92;potions&#92;beastbloodpotion.nif\r<br />o   &#92;Skyrim&#92;Data&#92;meshes&#92;Clutter&#92;potions&#92;beastbloodpotion_inv.nif\r<br />o   &#92;Skyrim&#92;Data&#92;scripts&#92;RegainLycanthropyScript.pex\r<br />o   &#92;Skyrim&#92;Data&#92;scripts&#92;Source&#92;RegainLycanthropyScript.psc\r<br />o   &#92;Skyrim&#92;Data&#92;textures&#92;Clutter&#92;potions&#92;beastbloodpotion.dds\r<br />\r<br />\r<br />\r<br />Additional Information:\r<br />\r<br />This mod uses one script; it is a standalone script, which means it should not conflict with any other mods.\r<br />\r<br />\r<br />As far as I am aware, SKSE is not required to run this mod; should I be proven wrong, however, the latest edition can be found at:\r<br />   http://skse.silverlock.org/\r<br />\r<br />\r<br />The script attached to the potion used in this mod is based primarily upon the spell Aela the Huntress uses to give you back your Lycanthropy in Dawnguard; therefore, barring any unintentional errors in my own additions to the effect, it is safe to assume it has been thoroughly tested.\r<br />\r<br />\r<br />I have tested this mod under various conditions including its implementation via the NMM and it doesn’t seem to have any unintended, undesirable knock-on effects.\r<br />\r<br />The Werewolf Paradox: As far as I understand, it is possible to become stuck as a Werewolf under certain conditions, these being that you must have had Serana cured of her Vampirism, you must already be a Werewolf (obviously) and you have used up all of the Glenmoril witch heads. Currently, the workaround is that a Glenmoril witch head spawn has been added on one of the tables in the chamber with the Flame of the Harbinger in Ysgramor&#39;s Tomb, meaning you cannot access the item before they are officially required (if you&#39;re playing the game through properly). If Serana is still a Vampire, then having used all of the Glenmoril witch heads, you can simply ask Serana to turn you into a vampire and then complete &#39;Rising at Dawn&#39;.",
  "categoryId": "24",
  "version": "1.0",
  "author": "YourUnequal",
  "createdUnix": "1370893411",
  "updatedUnix": "1370891225",
  "containsAdultContent": false,
  "uploadedBy": "YourUnequal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033678",
      "name": "Beastblood Solution v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "90",
      "fileName": "Beastblood Solution v1_0-37083-1-0.rar",
      "uploadedUnix": "1370891225",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/241521bd06c6733a160470740aea6084b7df192f9de00665490b7f537dbb057e/analysis/1407599311/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beastblood%20Solution%20v1_0-37083-1-0.rar?fid=1000033678&ttl=1535816551&ri=8192&rs=8192&setec=659248a3a660138dc6e0fcd41fca24ac"
    }
  ]
}