{
  "modId": 37107.0,
  "modName": "Hentai Void Armor for Litheria Body and Race",
  "summary": "WARNING: Contains a little nudity. Just a little mesh conversion of Hentai\\'s Void Armor to fit Humannature66\\'s Litheria body.",
  "descriptionHtml": "Name          : Litheria Hentai\\'s Void Armor\r\nVersion       : 1.0\r\nDate          : 06-11-13  \r\nCategory      : Armour\r\nAuthor(s)     : Tattooedillusions via Hentai/zotman12\r\n-------------------------------------------------------------------\r\n-------------------------------------------------------------------\r\n\r\nDescription:\r\n------------\r\nWARNING: Contains a little nudity. Just a little mesh conversion of Hentai\\'s Void Armor to fit Humannature66\\'s Litheria body.  \r\n\r\n\r\nDetail:\r\n-------\r\n\r\nVERY IMPORTANT SO PLEASE READ THE FOLLOWING BEFORE DOWNLOADING!!:\r\n\r\nYou will need the mod HN66s Litheria - Race - Body - Armors by humannature66 and ginnyfizz (http://skyrim.nexusmods.com/mods/25461) in order for this to work because the is just that, Just the armor with no body attached and use body slots to coincide with HN66\\'s armor mod. They will only fit the Litheria body. If you use a different body there will be insane clipping.\r\n\r\nYou will also need Hentai\\'s version of the Void Armor (http://skyrim.nexusmods.com/mods/11871) for the textures. I only included the mesh files and my .esp so without the original for Skyrim, your armor will be purple.  NOTE: you only have to install the textures for this to work.  Naturally if you still want to use the original for your followers then you\\'ll need to install the whole mod.\r\n\r\nMy conversion of this Void Armor is far from perfect.  One, I\\'m not the best converter by any stretch. Two, it\\'s been a while so I\\'m pretty rusty at it. There are key differences between this and the original other than just body shape also. Again, there is no body attached to the mesh and uses body slots. I\\'ve separated the top and the bottom for more versatility with HN66\\'s armor files at the above link. I\\'ve separated the pauldrons so people that like the bare shoulder can have it that way. I\\'ve also included 2 different bottoms. 1 that\\'s regular and 1 that has the panties removed from the mesh for people that like their Litheria girl to run commando or to mix and match with one of HN66\\'s many thongs as shown in one of the pictures.\r\n\r\nThe Litheria version of the Void Armor is craftable and temperable. The cuirass and bottoms in the Hide section and the boots, gauntlets and pauldrons in the Misc section. I tried to keep it true to the original in that way. I\\'ve adjusted the top to give it even more \\\"underboob\\\" than the original so that was on purpose just in case someone was wondering. \r\n\r\nI am totally aware that I didn\\'t get all of the clipping out of it but nothing real noticeable until you use the tanning rack you can see it on the elbow. \r\n\r\nMany thanks to Hentai/zotman12 for this armor and for the open permissions as stated on the site:\r\n\r\n\r\n\\\"Permissions\r\n==========\r\n1. Feel free to use everything in this file.\r\n\r\n2. Everything I made for Obliviion is free to convert to Skyrim. Since Im not going to convert them myself.\r\n\r\n3. Do not upload this file on Steam Workshop until furthur notice. ( I like Nexus so much more as a modder)\\\"\r\n\r\nAlso once again, thanks to Humannature66 and ginnyfizz for the Litheria body, race and armor mod.\r\n\r\n\r\nCheers!\r\nTI\r\n\r\n\r\n---Installation:---\r\n-------------------\r\nManual Installation:\r\n--------------------\r\nIMPORTANT PLEASE READ THE FOLLOWING\r\nIn order for the outfits to work as intended, you MUST:\r\n\r\nFIRST download and install the Litheria Race Body & Armor mod by following their install directions.\r\n\r\nSECOND download and install Void Armor by Hentai and install just the textures unless you want the original version for your followers also (which I would suggest just because it\\'s a sexy armor)\r\n\r\nTHIRD extract the file you just downloaded from here to anywhere you want to on your computer.\r\n\r\nFOURTH copy the meshes folder and the LitheriaHentaiVoidArmor.esp in the file you just downloaded to your Skyrim/Data folder which should be C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\data.\r\n\r\nFIFTH make sure the LitheriaDraugrSkirt.esp is ticked in either your mod manager or your launcher and enjoy.\r\n\r\nYou can probably also install this via NMM. I don\\'t see why it wouldn\\'t work but if it doesn\\'t, then just install it manually. Just install it, no matter the method, AFTER installing the required mods.\r\n\r\n\r\n---Uninstallation:---\r\n---------------------\r\nManual Uninstallation:\r\n----------------------\r\nUntick the .esp file in the mod manager or launcher and delete it and the files that came with this mod.\r\n\r\n\r\nKnown issues and bugs:\r\n----------------------\r\nA little clipping is all that I\\'ve found, but if you find something else please let me know.\r\n\r\n\r\nIncompatabilities:\r\n------------------\r\nAny other body type will \\\"bust out\\\" of the clothing because this was formed for the Litheria body and only the Litheria body.\r\n\r\n\r\nContact:\r\n--------\r\nFeel free to send me a message here at the Nexus if you run into any issues or just to say Hey.\r\n\r\n\r\nIMPORTANT - Requirements:\r\n-------------------------\r\nSkyrim of course\r\n\r\nHN66s Litheria - Race - Body - Armors by humannature66 and ginnyfizz\r\nhttp://skyrim.nexusmods.com/mods/25461\r\n\r\nVoid armor by Hentai - Nexus Exclusive - by Hentai\r\nhttp://skyrim.nexusmods.com/mods/11871\r\n\r\n\r\nCredits:\r\n--------\r\nHumannature66 and ginnyfizz for the sexy (IMO) Litheria body, race and armor mod.\r\nhttp://skyrim.nexusmods.com/mods/25461\r\n\r\nHumannature66 for some of the other goodies he\\'s brought to Skyrim.\r\nhttp://skyrim.nexusmods.com/users/1341839\r\n\r\nHentai/zotman12 for all the great outfits through the years\r\nhttp://skyrim.nexusmods.com/users/293510\r\n\r\nKendo 2 for some nifskope tips he\\'s given me and the sweet NV comics and all the awesome clothing/armors past and present.  You can check all those out at his user page.\r\nhttp://newvegas.nexusmods.com/users/282595\r\n\r\nJonas66 for the blender tips and his amazing tutorials on Blender, Nifskope, Screenshots, etc.  Check out those if you\\'re interested in starting Blender along with his other great clothing mods.\r\nhttp://newvegas.nexusmods.com/users/241581\r\n\r\nNightasy for all of the amazing video tutorials he has done for modding Skyrim including a couple that covered some CK questions I didn\\'t know the answers to.\r\nhttp://skyrim.nexusmods.com/users/3076419\r\n\r\nNifskope\r\n\r\nBethesda for creating the Fallout & Elder Scrolls series and allowing us to mod these games\r\n\r\nAnd everyone else that is among the credits of each of the people listed above! \r\n\r\nIf I\\'ve left anyone out at all please don\\'t hunt me down just yet.  PM me and I will gladly add you!\r\n\r\n\r\nLegal and licensing:\r\n--------------------\r\nAgain, taken right from the original mod page and the same goes with my conversion:\r\n\r\n\\\"1. Feel free to use everything in this file.\r\n\r\n2. Everything I made for Obliviion is free to convert to Skyrim. Since Im not going to convert them myself.\r\n\r\n3. Do not upload this file on Steam Workshop until furthur notice. ( I like Nexus so much more as a modder)\\\"  \r\n\r\n",
  "categoryId": "54",
  "version": "1.0",
  "author": "tattooedillusions via Hentai-zotman12",
  "createdUnix": "1370963574",
  "updatedUnix": "1370962783",
  "containsAdultContent": true,
  "uploadedBy": "tattooedillusions",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033800",
      "name": "Litheria_Hentai_Void_Armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "431",
      "fileName": "Litheria_Hentai_Void_Armor-37107-1-0.7z",
      "uploadedUnix": "1370962783",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/aaf87b5d31c6ba5919b988000a0ba2e92b802cf082c040caf184751565b72530/analysis/1407600309/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Litheria_Hentai_Void_Armor-37107-1-0.7z?fid=1000033800&ttl=1535816584&ri=8192&rs=8192&setec=67d561ebaa9ad5d2bb85a217aebbdb56"
    }
  ]
}