{
  "modId": 37102.0,
  "modName": "Sybilla Aldmeri-Imperial Female Follower",
  "summary": "Female Imperial Combat Companion. Will level with you, with no level cap. She is set to Essential. Apachii Sky Hair is required. Able to wear gear given to her.\r\n",
  "descriptionHtml": "[IMG]http://i.imgur.com/STT36SH.jpg[/IMG]\r\n\r\nSybilla Aldmeri, was named after the Aldmer race, who were called the First Ones.\r\nThe Aldmer were tall and lithe, and more graceful than humans. But they were a short-lived race, sadly becoming extinct very quickly.\r\nSybilla is a Imperialist through and through. She is well-travelled, well-educated and master of 9 languages. She may not look like a Imperialist, with her lighter skin colour, platinum hair and blueish eyes. But for what she lacks in stereo-type looks she makes up for in Combat, Discipline and Negotiating.\r\n\r\nShe is battle-hardened, with many battles behind her already.\r\nShe resides in Whiterun\\'s Drunken Huntsman, keeping her distance from the common Rabble, drunken Fools and is quick to accept invitations from suitably courageous Travellers who are seeking Fame, Fortune, Blood and Ale.\r\nYou should seek Sybilla out, traveller, for she is loyal, good-willed but ruthless in Combat.\r\n\r\n\r\n[IMG]http://i.imgur.com/rSnPNOV.jpg[/IMG]\r\n\r\nSybilla is a Combat Warrior, specializing in 1-handed weapons.\r\nShe is set to essential, her speed has been increased to keep up with the likes of you, \r\nher factions are all adjusted so she doesn\\'t get herself into trouble.\r\nEquipped in Clothes outfit, with imperial heavy armor set, no helmet as starter, there\\'s plenty of improvising you can do to kit her out throughout your adventures with her.\r\nWeapon equipped is the Imperial Sword of Torpor, which deals 15 points of stamina damage. Shield used is enchanted and steel, with a block value of 3.\r\n\r\nShe has the following Spells:\r\nFlames, Fast Heal, along with Oakflesh. \r\n\r\nPerks are as follows:\r\nResto Apprentice, Alteration Apprentice, Champion\\'s Stance,\r\nArmsman to 60, Bonebreaker to 60, HackandSlash to 60,\r\nDual Flurry 30.\r\n\r\nShe is an absolute Tank and Spank! We came upon a small Bandit Encampment, \r\nwith 4 Foes. Whilst i had just finished disposing of my first, she had killed 1\r\nalready, with her 2nd the HP bar was down to 50% already.\r\nBleedout will occur at 10% HP. She will be better in later levels i believe, early on, ie. btw. lvl 10 and 20 she is quiete strong, disposing foes with ease.\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/Is2QIa8.jpg[/IMG]\r\n\r\nUse NMM to install. Simple.\r\n\r\nUninstall with NMM.\r\n\r\n\r\n[IMG]http://i.imgur.com/Umk9eku.jpg[/IMG]\r\n\r\nNo issues here, although Apachii Sky Hair is required.\r\nIf you find any issues or incompatibilities, please let me know so i can produce a fix.\r\n\r\n[IMG]http://i.imgur.com/HI745Qm.jpg[/IMG]\r\n\r\nWhere would we be without the following:\r\n\r\napachiis\\' Apachii Sky Hair\r\nhothtrooper44s\\' Immersive Armors\r\nNikinoodles\\' Cloaks of Skyrim\r\nXenius\\' High Quality Eyes\r\nBethesda\r\nNexus\r\nNexus Community and Modders alike.\r\n\r\nCheers!\r\n\r\nEDIT: I had to re-release this file with a fix due to textures and meshes \r\nnot sticking in initial release. I apologise to those few who had already d/l before i could pull the bad release. New version is up and working as intended. Thank you.\r\n\r\n\r\n ",
  "categoryId": "66",
  "version": "v1.1",
  "author": "heeresman1",
  "createdUnix": "1370958469",
  "updatedUnix": "1371010892",
  "containsAdultContent": false,
  "uploadedBy": "heeresman1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033901",
      "name": "PGSybilla-Apachii Sky Hair required",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "494",
      "fileName": "PGSybilla-Apachii Sky Hair required-37102-v1-1.7z",
      "uploadedUnix": "1371010892",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c2152eb66f4f2ad628dc776e5a653a70909602e6ec0d071b483434f1f3c1b1da/analysis/1407601024/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PGSybilla-Apachii%20Sky%20Hair%20required-37102-v1-1.7z?fid=1000033901&ttl=1535816578&ri=8192&rs=8192&setec=92626847768461c69780c974133a55fb"
    }
  ]
}