{
  "modId": 37109.0,
  "modName": "The Return of the Blades",
  "summary": "With my mod, I want to revive the old Order of the Blades. In my oppinion the Blades of Skyrim are too few to become a real threat for the Thalmor. So I want to make such a project, which enhanced this organization. But please read the DESCRIPTION and my at notes first. ",
  "descriptionHtml": "Version 0.5 \r\nThis mod adds 7 new Blades in a better Sky Haven Temple. \r\nThe improved Skyhaven Temple has now a forge, a workbench, a smelting plant and a grindstone. \r\nAlso it has an Arcane Enchanter and an alchemylab. \r\nThe new Blades consit of 5 male Nords (Atular, Roalder, Henk, Gunnar and Tulvar), a male Argonian (Fight-Many-Battles) and a female Imperial (Freyda). \r\nFurther you can marry Freyda and Gunnar. \r\n\r\nUpdate to Version 0.6 \r\nI added a big underground complex under an Abandoned Inn in the Principality Winterhold (there is a Screenshot of the exact location). This undergraound complex is named &quot;the last Sanctuary&quot; and it is a place for over 70 Blades. I have made 2 new classes of Blades. Apart from the &quot;normal&quot; Blades, now there are also sorcerers, which use destruction-magic and the &quot;Masters of Voice&quot;, which could use the Fire-Breath-Thu\\'um, the Disarm-Thu\\'um and Unrelenting Force. Besides I added 4 Merchants for Food, for Weapans and Armors, for books and for Miscs and a bard. Further I added a prison with Thalmors, where you can find the &quot;Sacrifice for Boethiah&quot; a follower which you can use for the Daedra-quest for Boethiah. Also I have added a Grandmaster for the Blades, his name is Wilbart and he has his own room, but he is not a follower. I took the liberty of joking and added Caius Cosades (from Elder Scrolls III: Morrowind) and Jauffree (from The Elder Scrolls IV: Oblivion). As well there is now a new Crown of the Dragonborn and new Dragonbone Weapons, which are really effective against Dragons. \r\n\r\nI add new rooms and merchants to the Last Sanctuary and place a journal of Wilbart. Besides I &quot;bring&quot; some Baldes and Akaviri artifacts from Oblivion to Sykrim and enchant them with there Oblivion-enchantings. \r\nThe Blades Armor and the Blades Sword is now smithable. But &quot;Talos and Blades Monument&quot; is not ready yet and the Blades would not train in the &quot;Training Room&quot;. \r\n\r\nThe Baldes Agents are coming! They are stronger then the normal Blades, but be careful. They will protect their idendity, cost what it wants. So when you are a enemy of the faction, these agents will be your enenmy! You find the first Agents in Jorrvaskr, in the Guardhouse of Whiterun, in the college of Winterhold. \r\nAs well in the Cistern of the Thieves Guild and in the Blue Palace. Besides threre is now a new Agent in the The Winking Skeever. A agent names Groar, a Barbarian. \r\nWith the time other agents will follow. \r\nYou find Screenshots of them on the end of the Gallery. \r\n\r\nI will expand the underground complex after time, add new Blade-members and I will make a questline. \r\n\r\nI hope you like my mod and you could understand the letters which you can find in this mod. \r\nPlease rate it and share this mod. ",
  "categoryId": "22",
  "version": "0.65",
  "author": "Legion1995ME",
  "createdUnix": "1370966881",
  "updatedUnix": "1370966881",
  "containsAdultContent": false,
  "uploadedBy": "Legion1995ME",
  "primaryFile": null,
  "files": []
}