{
  "modId": 37113.0,
  "modName": "Better Book Mesh - Modders Resource",
  "summary": "An optimised and accurately UV-mapped version of the Skyrim book mesh. Contains both World and Inventory versions of the standard book as well as the taller, fatter book. Allows easy use of a single wrap-around cover.",
  "descriptionHtml": "[img]http://www.dcoffey.co.uk/images/betterbookmesh/BBM_Banner_Large.jpg[/img]\r<br />\r<br />Dissatisfied with the atrocious UV-mapping in the vanilla Skyrim book mesh? Frustrated that you cannot create a true wrap-around cover like you could in Oblivion when creating a new book for your new mod? Concerned that visitors to your in-game Library will find their computers struggling to display all those books? This is the resource for you.\r<br />\r<br />This mod contains optimised and accurately UV-mapped versions of the Skyrim book meshes ready for you to add your own custom book cover texture.\r<br />\r<br />SEE ALSO : [url=http://skyrim.nexusmods.com/mods/42388]Better JOURNAL Mesh - Modders Resource[/url] AND [url=http://www.nexusmods.com/skyrim/mods/48471]Better NOTES Mesh - Modders Resource[/url]\r<br />\r<br />\r<br />[img]http://www.dcoffey.co.uk/images/betterbookmesh/BBM_MeshesTextures.jpg[/img]\r<br />\r<br />There are essentially two models of book in Skyrim - the big fat one which is used fairly frequently and the smaller, slightly thinner one which is the book you encounter most often in Skyrim. Both models are covered in this resource.\r<br />\r<br />There are two meshes for each type of book... the lower detail one (now around 470 triangles) which you see in the world of Skyrim and the more detailed one (now around 900 triangles) which you see in your inventory.\r<br />\r<br />The world view mesh consists of a simple skeleton with the rigid spine and the two covers. The inventory view contains a more complex skeleton and a script since there is that page-turning animation to be played and text to be laid out onto the pages. The skeleton and Havok physics of the books have not been altered from Vanilla in any way.\r<br />\r<br />Despite the two book types differing in thickness, the difference is relatively minor so the same template can easily be used for both.\r<br />\r<br />Instead of the Vanilla books making do with either a single (or rarely a pair of) square 256x256 textures that are inaccurately mapped to their mesh, you can now use a single rectangular texture to cover your book.\r<br />\r<br />These meshes are based around a single 2:1 rectangular texture of say 512x256 or 1024x512 which wraps right around the book edge to edge. Included in the resource is a Photoshop template with helpful guide lines so that you can easily create custom textures for all your own books.\r<br />\r<br />The template includes a bleed area where the texture will be wrapped around the sides of the cover of your book. If your new texture has that triangular leather corner cover, remember to design your texture so that it wraps the correct way around the side of the cover (see the images for a working example). The texture on the outside of each cover is repeated on the inside of that cover.\r<br />\r<br />Remember to save your visible texture file (*.dds) as DXT1 with mipmaps. The Normal/Specular map (*_n.dds) should be saved as DXT5 with mipmaps.\r<br />\r<br />To view your textures in-game you need to reference them in the meshes. Use NIFskope to open a copy of one of the meshes and refer to the pictures posted above to locate the correct BSShaderTextureSet group in which to declare the name of your texture. The texture itself goes first, followed by the normal/specular map. Remember to use relative paths from the Skyrim textures folder before publishing your mod.\r<br />\r<br />So that your books stack nicely on a bookshelf, don&#39;t forget to set the OBND Object Bounds for them. Suggested OBND settings are -9, -11, -1, 9, 11, 2 for the Standard book and -11, -15, -3, 11, 15, 3 for the Tall book.\r<br />\r<br />\r<br />[img]http://www.dcoffey.co.uk/images/betterbookmesh/BBM_Optimisation.jpg[/img]\r<br />\r<br />Triangle count has been reduced by around 15% in the World view of both books and by around 11% in the Inventory view simply by culling out-of-sight or minuscule triangles. In places of the mesh where triangles were not affecting the geometry of the book, they have been sensitively merged with their neighbours. In your Libraries this means that you can get one free book on screen for every eight or nine that you place.\r<br />\r<br />\r<br />[img]http://www.dcoffey.co.uk/images/betterbookmesh/BBM_FilesIncluded.jpg[/img]\r<br />\r<br />BBM_StandardBook.nif - World view of the standard book\r<br />BBM_StandardBookCA.nif - Inventory view of the standard book\r<br />\r<br />BBM_TallBook.nif - World view of the taller, fatter book\r<br />BBM_TallBookCA.nif - Inventory view of the taller,fatter book\r<br />\r<br />BBM_BookTemplate.psd - Photoshop template from which to create your own textures\r<br />BBM_BookTemplate.dds - sample texture so that you can see what goes where on the cover\r<br />BBM_BookTemplate_n.dds - sample normal/specular map\r<br />\r<br />BBM_HalfdanTheBlack.dds - sample texture\r<br />BBM_HalfdanTheBlack_n.dds - sample normal/specular map\r<br />\r<br />\r<br />[img]http://www.dcoffey.co.uk/images/betterbookmesh/BBM_Permission.jpg[/img]\r<br />\r<br />You can use, modify or redistribute these files for any purpose without asking. Feel free to use the template to create your own textures and apply the meshes to books in your own (or any other) mod.\r<br />\r<br />\r<br />[img]http://www.dcoffey.co.uk/images/betterbookmesh/BBM_Credits.jpg[/img]\r<br />\r<br />Hanaisse from TES Alliance (tesalliance.org) for extensive coaching in Blender and NIFskope.",
  "categoryId": "82",
  "version": "1.1",
  "author": "DanielCoffey",
  "createdUnix": "1371028659",
  "updatedUnix": "1392802873",
  "containsAdultContent": false,
  "uploadedBy": "DanielCoffey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097766",
      "name": "Better Book Mesh",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1331",
      "fileName": "Better Book Mesh-37113-1-1.7z",
      "uploadedUnix": "1392802873",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/fecb4025d0f57254a0e4063871fbf14f8d13b2dd4ef24782268192eb258d67d4/analysis/1407940331/",
      "changelogHtml": " Version 1.1\r<br />==================\r<br />Corrected bad Vertex Shading data on Book meshes\r<br />Adjusted UV Map for cover on Book meshes\r<br />Adjusted SCALE of Book Inventory Mesh - Standard to be 1.20\r<br />Adjusted SCALE of Book Inventory Mesh - Tall to be 1.35 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Book%20Mesh-37113-1-1.7z?fid=1000097766&ttl=1535816594&ri=8192&rs=8192&setec=b2a911016d7489294a9a3add8b7f973a"
    }
  ]
}