{
  "modId": 37129.0,
  "modName": "NS Hunting Grounds for SevenBase Bombshell with BBP",
  "summary": "A conversion of the awesome Hunting Grounds Outfit from Nimezis to work with Sevennity\\'s SevenBase Bombshell Body.",
  "descriptionHtml": "[color=#daa520][i][b][size=4][font=lucida sans unicode,lucida grande,sans-serif]Hunting Grounds Outfit for SevenBase Bombshell with BBP[/font][/size][/b][/i][/color]\r\n \r\nThis mod simply contains converted torso meshes for the 0 and 100 weight body to be used with SevenBase Bombshell or other SevenBase bodies. It was converted with full permissions from the original author Nimezis.\r\n \r\n[color=#daa520][i][b][font=lucida sans unicode,lucida grande,sans-serif]Installation:[/font][/b][/i][/color]\r\n \r\nTo use this mod you must download the original [url=http://skyrim.nexusmods.com/mods/30466][b]Hunting Grounds Outfit by Nimezis[/b][/url] and install that mod first. [b]Please use the UNP version.[/b]\r\n \r\nThen install this mod with NMM and allow it to overwrite [b]HHChest_0.nif[/b] and [b]HHChest_1.nif[/b], once done the armor is now converted for use with SevenBase/SevenBase Natural/SevenBase Bombshell\r\n \r\n[color=#daa520][font=lucida sans unicode,lucida grande,sans-serif][i][b]Stuff you might care about:[/b][/i][/font][/color]\r\n \r\n[b][color=#ff0000]Q:[/color] You said this armor has BBP! My breasts aren\\'t flopping around when I walk? What gives?[/b]\r\n \r\n[color=#00ff00][b]A:[/b][/color] [i]It does have BBP, but I reduced the breast bone influence on the armor slightly to ensure that the \\\"bound\\\" effect of a wrapped hide around the breasts was more realistic. The BBP effect is very subtle but it is there. If you want your breasts to wobble around every time you so much as breathe, please feel free to convert your own version of the armor as I have no intention to introduce comically hilarious levels of breast bone influence on this armor (or any armor I happen to convert or create for the 7B bodies for that matter).[/i]\r\n \r\n[color=#ff0000][b]Q:[/b][/color] [b]The chain at the bottom of the back skirt clips a bit through the skirt when I walk or run![/b]\r\n \r\n[color=#00ff00][b]A:[/b] [/color][i]Its completely minor to be almost unnoticeable at this point. If anyone wants to sacrifice a goat to get that last tiny bit of skirt out of the chain on full run extension, feel free to let me know.[/i]\r\n \r\n[color=#ff0000][b]Q:[/b][/color] [b]Can you convert <insert armor here> to the SevenBase body?[/b]\r\n \r\n[color=#00ff00][b]A: [/b][/color][i]I likely can but at this time I will only entertain armors that have open permissions or armors I can get permissions to convert. I will not be doing any conversions on armors where the author has specifically stated that they do not allow conversions or modifications. If you want me to consider an armor, please feel free to PM me with a link to the armor and I will see if I can get permissions to convert it. No guarantees, and...don\\'t take this as an open invitation to demand I convert things I don\\'t want to put time into. Conversions aren\\'t rocket science (compared to creation of original armors) but they are time consuming to get right.[/i]\r\n \r\n[b][font=lucida sans unicode,lucida grande,sans-serif][i][color=#daa520]Other Stuff:[/color][/i][/font][/b]\r\n \r\nFirst and foremost do not credit me for this mod, this is Nimezis\\'s work entirely, all I did was push some vertices around and make it work for the SevenBase Bombshell body. If you want to endorse this or vote for it please endorse and vote for Nimezis\\'s original mod.\r\n \r\nSecondly this is my very first foray into 3D Mesh work for Skyrim or any other game, I have a few previous smaller graphic and edit mods for Dragon Age and Fallout New Vegas but this is as deep as I\\'ve ever gone into modding and I\\'m happy I finally took the time to learn it all. Regardless of that as it is my very first 3D mesh based project its not going to be 100% perfect right out of the gate and I will update this mod accordingly when I work out the few issues it may have. The HGO outfit is a beautiful piece of art and the reason I chose it is because I love this armor and use it almost exclusively and once I became peripherally involved with the SevenBase project, I decided I couldn\\'t deal with playing Skyrim without my favorite armor, and while Nimesiz\\'s UNP version works just fine, I felt this was the right time and place to challenge myself to learn how to make armor work for the body I am using...as well as to begin taking the steps into creating my own custom armors. HGO is a pretty complex mesh set that runs the gauntlet in regards to just about every relevant detail that is important to Skyrim armor modding, so I also chose to convert this armor, rather than something far simpler, simply to ensure I was exposed to just about every potential hurdle and challenge I could be presented with.\r\n \r\nOver the next couple of days I will fix the hand issue with this mesh, and convert a SevenBase, SevenBase Natural and a SevenBase cleavage version of the armor as well and add them to the downloads, for now its based entirely around Bombshell and it will be compatible for anyone that uses any of the other SevenBase variants.\r\n\r\n[font=lucida sans unicode,lucida grande,sans-serif][color=#daa520][b][i]Permissions:[/i][/b][/color][/font]\r\n \r\n[b]This armor conversion was done with the full permission of the original author. As I am not the original author of the models, please do not contact me for permissions to convert or use the armor in any other mod. You must contact Nimezis for their express permission to use HGO in any way.[/b]\r\n \r\n[i][font=lucida sans unicode,lucida grande,sans-serif][b][color=#daa520]Credits:[/color][/b][/font][/i]\r\n \r\n[b]Sevennity[/b] for [url=http://skyrim.nexusmods.com/mods/36992][b]SevenBase Bombshell[/b][/url]\r\n[b]Nimezis[/b] for [url=http://skyrim.nexusmods.com/mods/30466][b]Hunting Grounds Outfit[/b][/url]\r\n \r\n[b]The SevenBase Team: [/b]\r\nSevennity\r\nCrosscrusade\r\nDemonHunter1986\r\nWast1980\r\n \r\nThanks for all their work on [url=http://skyrim.nexusmods.com/mods/36992/?][b]SevenBase[/b] [/url]so far.",
  "categoryId": "54",
  "version": "1.1",
  "author": "pr0",
  "createdUnix": "1371003955",
  "updatedUnix": "1371759702",
  "containsAdultContent": false,
  "uploadedBy": "pr0",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033881",
      "name": "NS Hunting Grounds for SevenBase Bombshell with BBP",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5295",
      "fileName": "NS Hunting Grounds for SevenBase Bombshell with BBP-37129-1-0.zip",
      "uploadedUnix": "1371003257",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/388d871c37d9ffd3058887ec14e9e75a22d705d641880ec85a06e65dbec67f36/analysis/1407600744/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NS%20Hunting%20Grounds%20for%20SevenBase%20Bombshell%20with%20BBP-37129-1-0.zip?fid=1000033881&ttl=1535816624&ri=8192&rs=8192&setec=a0a74239c6d254909d56a0c59f8e67ed"
    },
    {
      "fileId": "1000035061",
      "name": "NS Hunting Grounds for SevenBase Bombshell with BBP",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5411",
      "fileName": "NS Hunting Grounds for SevenBase Bombshell with BBP-37129-1-1.zip",
      "uploadedUnix": "1371759702",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f1d0fe70fa01e4fa0e4f3e21b36adc66fc094483ccff8eee2ff8a14782a1ed6a/analysis/1407610579/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NS%20Hunting%20Grounds%20for%20SevenBase%20Bombshell%20with%20BBP-37129-1-1.zip?fid=1000035061&ttl=1535816625&ri=8192&rs=8192&setec=2fdebc9787723e145353d57c64f67bac"
    }
  ]
}