{
  "modId": 37120.0,
  "modName": "Finger-Wigglers BEGONE",
  "summary": "A set of batch files to help you fast-track through the College of Winterhold&#39;s main questline.  Read and follow directions carefully.",
  "descriptionHtml": "[center][img]http://i.imgur.com/qqBtnl1.png[/img][/center]\r<br />IMPORTANT&#33; - READ BEFORE DOWNLOADING - IMPORTANT&#33;\r<br />\r<br />This is not a simple set of batch files to be blindly executed at a whim.  I have listed detailed instructions at the bottom of this description that, if not followed exactly, will cause these batch files to break your quests.  This is not a threat, but a simple truth, as I painstakingly discovered during their creation and playtesting.\r<br />\r<br />As with any mod or batch file, be sure to save your game first, just in case something goes wrong.\r<br />\r<br />Again, and I cannot stress this enough, read and follow the directions carefully&#33;  I&#39;m a huge fan of colorful language, have a rather thick hide, and possess a sadistic streak so if you don&#39;t follow directions and decide to rip into me in the comments in order to blame me for your error, be forewarned that you will probably get just a smile and a shrug in return.\r<br />\r<br />============================\r<br />\r<br />Description:\r<br />\r<br />Mulligan (mul·li·gan):\r<br />Noun\r<br />2. (in informal golf) An extra stroke allowed after a poor shot, not counted on the scorecard.\r<br />\r<br />&#39;Mulligan - College of Winterhold&#39; is a set of batch files to help you fast-track through the College of Winterhold&#39;s main questline.  In trying to research how to do this for my own reasons, I usually found the common answers of just use &#34;setstage&#39; (which not only had a sharp learning curve but also tended to break quests on occasion, as noted often in this description) and &#39;due to bugs, you can&#39;t&#39;.  There was no &#39;newbie-friendly middle ground&#39; like the kind these files provide.\r<br />\r<br />Your reasons for doing so are your own, but I created these batch files for the following reasons and, if they match your own, then these files may be for you.\r<br />\r<br />1. Catching a character up to speed in the case of missing/corrupted savefiles.\r<br />\r<br />2. Avoiding having to re-play the questline with a new character.\r<br />\r<br />3. I, personally, hate playing mages and resented the fact that my assassin had to &#39;serve time&#39; in a mage questline just to finish Vanilla Skyrim&#39;s main questlines to 100% while the other vanilla quests seemed to tie in nicely with my subtrefuge and infiltration image of my character.  Seemed odd that we have the perk trees to &#39;customize&#39; our characters, yet are forced to water trees we never wanted to water in the first place, right?\r<br />\r<br />4. In conjunction with all of the above, I like playing with mods like &#39;Alternate Start: Live Another Life&#39;, &#39;Helgen Reborn&#39;, and many of the other fine add-in quests made by modders on both Steam Workshop and Nexus, so this allows me to quickly pass the &#39;old&#39; quests that I have played a dozen times over in order to get to the &#39;new&#39; without worrying about &#39;breaking&#39; the main quests or losing that &#39;same setting, different game&#39; feel created by the mods I have added.\r<br />\r<br />Pros:\r<br />* You get to &#39;fast-track&#39; through the main College of Winterhold questline in minutes instead of hours.\r<br />\r<br />* You still get the end-of-quest rewards/items where applicable, including the position of Archmage and your official swanky abode.\r<br />\r<br />* In order to prevent accidentally breaking the Forgotten Legends or Dragon Priest quests, you get the important loot for both Jyrik and Morokei.\r<br />\r<br />* Unlocks the locations for crawling (most, if not all, adding location markers to your map).  These locations will still have to be officially &#39;discovered&#39; before you can fast travel to/from, but they will no longer be quest-locked and therefore open for your causal adventuring.\r<br />\r<br />* Keys required for completing the quests have been auto-given, where applicable.\r<br />\r<br />* Each quest in the questline is handled by a separate batch file, enabling you to start using the batch files at any point within the questline or to pass just certain quests and play out the rest of the questline normally, if desired.\r<br />\r<br />Cons:\r<br />* You don&#39;t auto-earn the XP for all of the monsters that you would have had to fight completing the quest normally.  All is not lost, however, as those monsters are still there, waiting for you in the darkness...\r<br />\r<br />* You don&#39;t auto-earn all of the gold and miscellaneous loot that you would have gotten from delving the dungeon normally.  This goes for monster loot, chests, and loose objects.  As stated just above though, the dungeon is still there, awaiting your causal visit.\r<br />\r<br />* Keys that are not essential for quest completion are not auto-given and must be found.\r<br />\r<br />* Special items (unique treasures, etc.,) are not auto-given and must be found.  The only exceptions are Jyrik and Morokei&#39;s loot.\r<br />\r<br />* You do have to put in a little effort, not only for following the instructions below, but for two quests near the end of the questline that could not be auto-skipped due to the programming in the game.  They are short battles (10 anomalies and Arcano), so a small price to pay for the hours of toil that these files lift off of your workload, right?\r<br />\r<br />============================\r<br />\r<br />Important Notes About The Batch Files In General:\r<br />\r<br />In order to keep from overloading the game by executing too many commands at once, you will want to run the batch files slowly (as detailed in the instructions below), when the time comes to execute a few in a row, closing and re-opening the console after running each and allowing all new items/spells to add as well as for the quests to update.  I also did it this way because running them as a single batch file caused some quest objectives to be started and completed so quickly that there was no journal entry for them in the &#39;completed&#39; section.  \r<br />\r<br />You will have to play through &#34;Containment&#34; and &#34;Eye of the Magus&#34;.  There is no getting around this, as far as I can tell, due to the way that the game is coded.  I tried completing these two quests via SetStage like the others, but the game glitched on both occasions.  \r<br />\r<br />* If you SetStage past &#34;Containment&#34;, the anomalies still appear in Winterhold, terrorizing the townsfolk in a broken quest.  You can zap anomalies all day long, but there is no countdown quest (since it is flagged as already completed) and the quests that follow &#34;Containment&#34; are unobtainable.\r<br />\r<br />* If you Setstage past &#34;Eye of the Magnus&#34;, Ancano won&#39;t be dead, the Eye will remain at the college, and Quaranir will not appear.  The quest will be marked as complete and you will get your Archmage reward, of course, but I&#39;m not sure what impact these bugs would have on the rest of the game, and so I opted for a &#39;clean&#39; finish, and hope you would too.\r<br />\r<br />============================\r<br />\r<br />Important Notes About Special Treasures And Overlapping Quests:\r<br />\r<br />1. MCQ-2.bat skips the &#39;Under Saarthal&#39; quest and nets you the three Enchanted Rings and Saarthal Amulet, as well as Jyrik Gauldurson&#39;s Staff, Writ of Sealing, and Amulet Fragment.  The reason that I manually added the Enchanted Rings and Saarthal Amulet is that the markers for the rings disappear once you find and use the amulet and the amulet is a required item for completing the quest and I am not sure if it would be needed or not tin order to enter the dungeon later since solving the door puzzle was skipped.  I manually added Jyrik&#39;s treasures because he is the end boss of the quest and, at the time of this writing, I have not officially delved Saarthal with my test character to see if Jyrik is &#39;still alive and just skipped&#39;, &#39;randomly dead and lootable&#39;, or &#39;dead with no corpse&#39; and did not want to break the Forgotten Legends quest and/or deprive you of the important loot from his body.  (If you have not started this quest yet, reading the Lost Legends book followed by Jyrik&#39;s Writ should put this quest back on track for you.)\r<br />\r<br />2. MCQ-3.bat skips through Fellglow Keep.  There is an Unusual Gem hidden in Fellglow Keep, so you will have to officially crawl this level to get it.  I did not auto-give the key because finding it is part of the fun and was not necessary for quest completion.\r<br />\r<br />3. MCQ-4 skips over the Midden/Midden Dark where Valek Sain&#39;s side quest and the Atronach Forge can be found.\r<br />\r<br />4. MCQ-6 auto-gives you Morokei&#39;s Dragon Priest mask because he is the end boss of the quest and, at the time of this writing, I have not officially delved Labarinthian with my test character after running these batch files in order to see if Morokei is &#39;still alive and just skipped&#39;, &#39;randomly dead and lootable&#39;, or &#39;dead with no corpse&#39; and did not want to break the Dragon Priest quest and/or deprive you of the important loot from his body.\r<br />\r<br />============================\r<br />\r<br />Installation and use:\r<br />\r<br />1. Unzip the file and place the batch files into your Skyrim directory:\r<br />c:Program FilesSteamSteamAppscommonSkyrim\r<br />(32-bit Windows)\r<br />c:Program Files (x86)SteamSteamAppscommonSkyrim\r<br />(64-bit Windows)\r<br />\r<br />2. Execute the batch files via the console by pressing the ~ key and then typing &#39;bat&#39; followed by the filename and hit enter.  Be sure to read and follow the instructions below as not doing so can cause errors.\r<br />\r<br />============================\r<br />\r<br />Instructions:\r<br />\r<br />You may want to write these down somewhere (unless you like alt-tabbing or memorizing), as this is not a quick-and-easy &#39;1. Open the console 2. Run single bat file 3. ??? 4. Profit&#39; solution, although the whole process should not take more than 15-20 minutes, more if you need to do the pre-batch legwork coming from a new game.\r<br />\r<br />1. Before running these batch files, you will need to discover both Winterhold and the College, the latter of which will, unfortunately, require that you perform a spell at the gate and follow the slowpoke gate-keeper on her trek up the ramp.  Don&#39;t worry, you won&#39;t have to talk to Mirabelle or take that boring &#39;backtracking&#39; tour, as this is covered in the first batch file, but stay put in the college courtyard as we still have something to do here afterward.\r<br />\r<br />2.  Open the console by pressing the ~ key and type &#39;bat mcq-1&#39; without the quotes and hit enter.  This completes &#39;First Lessons&#39;, skips the tour and gives you your student robes as well as access to the college.\r<br />\r<br />3. IMPORTANT&#33;  Close the console (~ again) and look around the college for the arch-mage, Savos.  Introduce yourself.  While beta testing these batch files, I found that not introducing yourself first broke a later quest as the script that needed to run assumed that you had spoken to him before, which is correct, as a quest between then and now DOES require you to speak to him, but is skipped over by the batch file for that quest.\r<br />\r<br />4. Fast travel away from the college.  Winterhold itself is a safe cell to work in (tested).\r<br />\r<br />5. Open the console and run mcq-2.  Close the console and wait for the updates to finish.  This completes the &#39;Under Saarthal&#39; quest.\r<br />\r<br />6. Open the console and run mcq-3.  Close the console and wait for the updates to finish.  This completes the &#39;Hitting the Books&#39; quest.\r<br />\r<br />7. Open the console and run mcq-4.  Close the console and wait for the updates to finish.  This completes the &#39;Good Intentions&#39; quest.\r<br />\r<br />8. Open the console and run mcq-5.  Close the console and walk (don&#39;t fast-travel) back to the college while the updates finish in the background.  This batch file completes most, but not all, of the &#39;Revealing the Unseen&#39; quest, but things need to be done manually to avoid game-breaking glitches.\r<br />\r<br />9. Meet with Savos as instructed and use a spell on the energy field to gain access to the hall.  \r<br />\r<br />10. Continue to follow instructions and play through &#39;Containment&#39;.  The Anomalies can be taken out with mundane weapons, so no worries about having short-changed your mage with these batch files.\r<br />\r<br />11. Continue to follow instructions until the &#39;Staff of Magnus&#39; quest begins.\r<br />\r<br />12. Fast travel away from the college and back to a safe cell like Winterhold.\r<br />\r<br />13. Open the console and run mcq-6.  Close the console and walk (don&#39;t fast-travel) back to the college while the updates finish in the background.  This completes the &#39;Staff of Magnus&#39; quest.\r<br />\r<br />14. Follow instructions and defeat Arcano.  Speak to Quaranir before speaking to Tolfdir.\r<br />\r<br />15. Speak to Tolfdir and become Arch-Mage (yay&#33;) and ask him what you can do next (if the option is available, it wasn&#39;t there for me) and the &#39;Aftershocks&#39; quest should begin.\r<br />\r<br />16. Open the console and run mcq-7.  Close the console and wait for the updates to finish.  This completes the &#39;Aftershocks&#39; quest as well as the main College of Winterhold questline.  All College sidequests should still be available.\r<br />\r<br />============================\r<br />\r<br />Future Mods Planned:\r<br />More Whisper journals for in-game hintage.\r<br />More Mulligan batch files for the other vanilla questlines like theive&#39;s guild, dark brotherhood, main quest, etc.,  I will NOT be doing Mulligans for Dragonborn or Dawnguard because, honestly, they feature one big quest apiece and that&#39;s why you bought it, right?\r<br />\r<br />[color=red][b]My [u]Fallout: New Vegas[/u] Mods:[/b][/color]\r<br />[url=http://newvegas.nexusmods.com/mods/53110]Poppy&#39;s Stash[/url]\r<br />[url=http://newvegas.nexusmods.com/mods/53299]A Neutered Beagle[/url]\r<br />\r<br />[color=red][b]My [u]Skyrim[/u] Mods:[/b][/color]\r<br />[url=http://skyrim.nexusmods.com/mods/36889]Clear My Name[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/37120]Mulligan - College of Winterhold[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/36962]Whisper - Kill Them With Kindness[/url]",
  "categoryId": "40",
  "version": "1.0",
  "author": "ShadowWhisper",
  "createdUnix": "1371006225",
  "updatedUnix": "1371006041",
  "containsAdultContent": false,
  "uploadedBy": "chaophim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033898",
      "name": "Mulligan-CollegeOfWinterhold",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Mulligan-CollegeOfWinterhold-37120-1-0.zip",
      "uploadedUnix": "1371006041",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fef9386b2cb93ddcbc59ca4de8864c9e20671fa8ed3ab16774337921069bd6b5/analysis/1407600943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mulligan-CollegeOfWinterhold-37120-1-0.zip?fid=1000033898&ttl=1535816602&ri=8192&rs=8192&setec=742eddcea235ac056c63d09f35a43ab7"
    }
  ]
}