{
  "modId": 37139.0,
  "modName": "Meet Ian the Protector a Nord raised Khajiit - Iona Replacer",
  "summary": "Because Iona’s default voice is the same voice as that commander who at the beginning of the game orders the dragon born to the chopping block.  I don’t know about you but that voice doesn\\'t inspire warm fuzzies or feelings of being protected.\r\n\r\nPlus even if you don’t use him as a follower or someone to marry you’ll have someone other tha",
  "descriptionHtml": "I wanted a different look for my housecarl in Riften.  Why?  \r\n\r\nBecause Iona’s default voice is the same voice as that commander who at the beginning of the game orders the dragon born to the chopping block.  I don’t know about you but that voice doesn\\'t inspire warm fuzzies or feelings of being protected.  \r\n\r\n(That and Iona has the kind of stare that BORES INTO YOUR SOUL!!! *shivers*)\r\n\r\nAlso a lack thereof Khajiit that are canadaites for marriage is a major complaint among many of us.  I too was very-very-VERY irked to find that you can’t marry khajiits!  I know WTH?!?!?  \r\n\r\nPlus even if you don’t use him as a follower or someone to marry you’ll have someone other than another Nord protecting your home.  A warm and fuzzy someone who can seriously mess a trespassing thief up.  \r\n\r\nAnd speaking of thieves what better place to start than with Riften to fix that issue eh? \r\n\r\nI made voice options for the following reason:\r\n\r\nFirstly Housecarls are limited to a total of five voices: Three for females and two for males.  Still new to modding I did try using a Khajiit voice at first but the voice files for housecarl phrases were not there and I doubt there are ones for matrimony interactions as well.  \r\n\r\nIf you’re into the strong and silent type let me know and I’ll try to post a male Khajiit voice option.  If I do… bear in mind they won’t talk about thane or marriage related stuff but will say something at least when you stop talking to them.  Note the text will show up with captions on but in most cases you won’t hear the voice to go along with it.  This might be a good thing if the Thane talk is getting old but I didn’t explore much into this option because I like all of the voice options to work correctly.\r\n\r\nSo the choices are:\r\nMaleBrute  (Argis the Bulwark)\r\nMaleNord (Calder)\r\n\r\nWhat lead to the voice options?\r\nI chose my male Khajiit, Ian to have the same voice as Argis the Bulwark because my follower usually is Belrand and Calder uses that voice as well.\r\n\r\nClothing Options:\r\nEach voice comes with two options the default housecarl steel armor and tavern clothes.  Weapons are just the basic iron dagger.  It’s less bulky when they are about the house and when you give them any weapon they will use it.\r\n\r\nBackstory? \r\n\r\nFor Iona or Ian the Protector I imagine the conversation would say something like this.\r\n\r\nDragonborn: \\\"Hey you\\'re a Khajiit!\\\"\r\n\r\nIan: “Yes I know… I don’t sound like other of my kind either.  I get that a lot.  See when I was but a cub with my eyes yet to open my parents and I were a part of a caravan that was traveling from Bruma.  It\\'s a city in the most northern province of Cyrodiil.  I was told as soon as I could understand that we were just south of Helgen when we were attacked by Bandits.  Only my Uncle M\\'aiq the Liar and I survived.  I am told is a wandering soul and so he left me to be raised by a wonderful Nord family which came to his aid.  I do miss them… terribly.  But someday perhaps I will get to see my Uncle again… or maybe we will find that dragon that attacked Helgen, yes?”  \r\n\r\nDragonborn: \\\"If Khajiit are not allowed in the city how did you get in here?\\\"\r\n\r\nIan: \\\"I used the back door, silly.\\\"\r\n\r\n\r\n\r\n",
  "categoryId": "79",
  "version": "1.0",
  "author": "CeaseSphire",
  "createdUnix": "1371037362",
  "updatedUnix": "1371037362",
  "containsAdultContent": false,
  "uploadedBy": "CeaseSphire",
  "primaryFile": null,
  "files": []
}