{
  "modId": 37141.0,
  "modName": "Winter is Coming - Cloaks - German - Deutsch",
  "summary": "Uebersetzung der Mod \\\"Winter is coming - Cloaks\\\" von nivea. ESP. Original ist erforderlich vor Installation der Uebersetzung.",
  "descriptionHtml": "Dies ist die Übersetzung von \\\"Winter is coming - Cloaks\\\" von nivea.\r\nVielen Dank für die Erlaubnis zur Übersetzung. \r\n\r\nNivea ist eine der talentiertesten Modderinnen. Sie hat Skyrim erweitert, in dem sie uns durch ihre Mods noch mehr in die Welt eintauchen lässt und dem Spiel ganz neue Erfahrungen hinzufügt. Sie verdient wirklich jedes Dankschön und Lob. Hinterlasst ihr bitte ein Endorsement auf ihrer Seite.\r\n\r\nNivea is one of the most talented modder (and a girl modder, too). She brought immersion and options to the vanilla Skyrim changing the whole gameplay. She really deserves your kudos and endorsement, please head for her page and do so. Thanks!\r\n\r\n[url=http://www.skyrim.nexusmods.com/mods/13486]Hier geht es zur Original-Modifikation, gebt nivea bitte ein Endorsement![/url]\r\n\r\n[b][color=yellow]Der originale Mod IST erforderlich. Bitte installiert es vor der Installation der Übersetzung![/b][/color]\r\n\r\n[heading]Anforderungen & Kompatibilität[/heading]\r\n- Mod erforderdert Skyrim-Version 1.9.32.0\r\n- Enthält Patches zur gleichzeitigen Verwendung von \\\"Cloaks of Skyrim\\\"\r\n- Enthält NMM installer\r\n\r\n[heading]Was ist Winter is Coming - Cloaks[/heading]\r\n\\\"Winter is Coming - Cloaks\\\" (WiC) fügt Mäntel und Kapuzen über angepasste Levellisten und das Handwerk in die Welt von Skyrim ein. Die Gegenstände passen zu Skyrim und stammen von Bären und Wölfen. Sie sind stark durch die Kultur der Wikinger und die HBO-TV-Serie \\\"Game of Thrones\\\" inspiriert.\r\n\r\nDie Mod enthält momentan folgende Mäntel und Kapuzen:\r\n\r\nBärenklauenmäntel: 9\r\nBärenklauenkapuzen: 9\r\nVerstärkte Leichte Bären-Kapuzen: 9\r\nVerstärkte Schwere Bären-Kapuzen: 9\r\n\r\nWolfsmäntel: 12\r\nWolfspelzkapuzen: 15\r\nVerstärkte Leichte Wolfspelzkapuzen: 15\r\nVerstärkte Schwere Wolfspelzkapuzen: 15\r\n\r\nAlle Gegenstände sind für alle Rassen und Geschlechter verfügbar, können gekauft, angefertigt und auf NPC gefunden werden.\r\nMitgelieferte optionale ESPs (über FOMOD-Installer) können dabei dazu verwendet werden, dass die Gegenstände nur angefertigt oder nicht auf Wachen gefunden werden. Ebenso gibt es Patches für die Verwendung mit \\\"Cloaks of Skyrim\\\".\r\n\r\nWiC ist voll kompatibel mit den Mods Frostfall und Hypothermia.\r\n\r\n[heading]Handwerk[/heading]\r\nUm selbst Mäntel und Kapuzen aus WiC anfertigen zu können, benötigt man zunächst das \\\"Pelzmacherwerkzeug\\\". Dies kann selbst angefertigt (Gerbgestell) oder auch gekauft werden. Ohne Pelzmacherwerkzeug werden die Mäntel und Kapuzen nicht für die Herstellung angezeigt. Dies sorgt auch dafür, dass die Gegenstandslisten nicht zu lang werden. Nach der Anfertigung von Mänteln oder Kapuzen verstaut das Pelzmacherwerkzeug einfach in eurem Haus oder einer Kiste, bis es wieder gebraucht wird.\r\n\r\nDie Anfertigung des Pelzmacherwerkzeuges erfordert:\r\n\r\n- Gerbgestell\r\n- Korb x 1\r\n- Leder x 1\r\n- Lederstreifen x 1\r\n\r\n[heading]Videovorstellung (Englisch)[/heading]\r\n[youtube]GQRwNtGiFnA[/youtube]\r\n\r\n[heading]Permission/Genehmigung[/heading]\r\n[color=red]Die Verwendung meiner Übersetzung für andere Übersetzungs-Versionen genehmige ich nicht. Ebenso darf diese Version nicht auf Seiten außerhalb des Nexus gehostet/angeboten werden. Vielen Dank für die Beachtung.[/color]",
  "categoryId": "60",
  "version": "2.3",
  "author": "Thoddy398 - Orig by nivea",
  "createdUnix": "1371039541",
  "updatedUnix": "1371039511",
  "containsAdultContent": false,
  "uploadedBy": "Thoddy398",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033927",
      "name": "Winter is coming - Cloaks - German - Deutsch",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "298",
      "fileName": "Winter is coming - Cloaks - German - Deutsch-37141-2-3.rar",
      "uploadedUnix": "1371039511",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/6918a88a9ac20a0f8ce3f44691e0371224beaf1d619bc330589e4cf809a70a9b/analysis/1407601204/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winter%20is%20coming%20-%20Cloaks%20-%20German%20-%20Deutsch-37141-2-3.rar?fid=1000033927&ttl=1535816642&ri=8192&rs=8192&setec=ef0ffd3c3d9f1409a0ebee67b5d47541"
    }
  ]
}