{
  "modId": 37155.0,
  "modName": "Project SALEM - SKYRIM AUTHENTIK LAUNCHER and ENB MOD - BETA",
  "summary": "Completely replaces default launcher, gives the user more graphics options, integrates ENB, SweetFX, Nexus Mod Manager, generates config files..",
  "descriptionHtml": "[center][IMG]https://famwtw.bay.livefilestore.com/y2pgBTkf41qa9W0UWRE4PeughzU6G0dm5twoNTlxyVLKXMw1bJoGjLSCfE1dw3EDtM3jRZW1SNbwMXnHfvR9d3e3OG6PPEwfFxL3ZTF6Fxy6ZVeod6VHBzWd9qAoUyzI9_O/SALEM.jpg[/IMG][/center]\r\n\r\n\r\n[color=#448ccb][b]Version 0.93 : [/b][/color] Updated ENB profile.\r\n\r\n[color=#448ccb][b]Version 0.92 : [/b][/color] Many improvements. App will now automatically detect SKSE (gives you an indicator in the bottom left of the launcher). Optimized \\\"Ultimate\\\" setting, the frame rate is now much better. Improved SweetFX color correction. Includes a new \\\"noise\\\" texture to improve distant terrain.\r\n\r\n[color=#448ccb][b]Version 0.91 : [/b][/color] Compiled the .exe as \\\"release\\\" so now it actually works.. lol changed the GUI a bit, its more professional now, included enbraindrops.tga so custom rain works, general optimization.. this is a solid release I think.\r\n\r\n[color=#448ccb][b]Version 0.90 : [/b][/color] BETA is released.\r\n\r\n\r\n[center][IMG]https://famwtw.bay.livefilestore.com/y2pRkQzUEphwFmWnZA7XAsqB5qPDXqWyuC6pWq0f6Gyfs3snBqkG6aOYnHb6YEuhabjpzblqadJNffQspmHVNGNrEmmT4CdyK2vAKf7Nxk8Jks11kfMRt08RYrRnDw2775Q/About.jpg[/IMG][/center]\r\n\r\n\r\nProject S.A.L.E.M. stands for \\\"SKYRIM AUTHENTIK LAUNCHER and ENB MOD\\\"\r\nThis MOD completely replaces the Skyrim launcher, it includes advanced options for customizing graphics, a new \\\"Ultimate\\\" preset for powerful computers, a tab for customizing ENB Series (if you have it), Nexus Mod Manager integration and more..\r\n\r\nS.A.L.E.M. will work with your current configs, it will not automatically change your settings, it does not attempt to override any files you may already have including custom ENB or SweetFX profiles. It merely \\\"integrates\\\" these popular mods into the user interface and extends the range of settings available to the user, including graphics options better than the previous maximum \\\"ultra\\\" available in the default launcher.\r\n\r\nThe download does come with my [url=http://skyrim.nexusmods.com/mods/31935]Authentik ENB profile[/url] if you don\\'t already have one. This is obviously optional.\r\n\r\n\r\n[center][IMG]https://famwtw.bay.livefilestore.com/y2pqc1MftJK1kdRJdA6Nl-QkMZsa1xuAy5ctmVR7N6qxfX_T-JvJprjSNyZF8J8X9eVZdL9T2O-5i1UXEOkOmZbv5OoxP1YKMz7wvf7taIHK2a9lhWd4NWXZmC4Yj4HpWAD/Install.jpg[/IMG][/center]\r\n\r\n\r\n[color=#ff0000][b]DISCLAIMER : [/b][/color]This program is currently in BETA. You may want to backup SkyrimLauncher.exe first before continuing. I only have one computer, its running Win8 64-bit, I cannot guarantee the current build will run on old operating systems like WinXP, please try it out and let me know. Only overwrite the files you want, I will not take responsibility if you replace existing config files.\r\n\r\nNOTE : If you are using WINDOWS 8 and you want to use this MOD with ENB you may have to download the [url=http://www.microsoft.com/en-au/download/details.aspx?id=35]DirectX End-User Runtime[/url] from Microsoft.\r\n\r\n\r\n[color=#448ccb][b]BASIC INSTALL : [/b][/color]\r\n\r\n[color=#448ccb][b]- [/b][/color]If you only want the launcher, just copy SkyrimLauncher.exe and SDL.dll to your install directory.\r\n\r\n\r\n[color=#448ccb][b]FULL INSTALL : [/b][/color]\r\n\r\n[color=#448ccb][b]- [/b][/color]Download the ENB Series v0.172 for Skyrim [url=http://www.enbdev.com/mod_tesskyrim_v0172.htm]HERE[/url] (if this link is broken, try grabbing the latest version from [url=http://www.enbdev.com/download_mod_tesskyrim.htm]THIS[/url] page)\r\n\r\n[color=#448ccb][b]- [/b][/color]Extract the ENB SERIES download and copy all files from the \\\"wrapper\\\" folder into your Skyrim directory, usually \\\"Steam\\\\steamapps\\\\common\\\\Skyrim\\\" or something similar (you actually only need one file called \\\"d3d9.dll\\\" but you can copy all of them, as the rest can be overwritten)\r\n\r\n[color=#448ccb][b]- [/b][/color]Download THIS MOD and extract all files and folders into your Skyrim directory, same as above.\r\n\r\n[color=#448ccb][b]- [/b][/color]DONE :) see below for a quick guide on whats new.\r\n\r\n\r\n[center][IMG]https://famwtw.bay.livefilestore.com/y2pWXvtE5GNUV86-92pdafp_BJS5VnnUUwvSfSfn7KDd-41F8-CPxkz9NmCN5rTcCu4KLvHErW_QZqnMhnbRVfBCEh2lhPiuwv0M2Yl7Q0BPto1X3AWr61rpjiHmaeuz_DS/Guide.jpg[/IMG][/center]\r\n\r\n\r\nS.A.L.E.M. will work with your existing configs, however I recommend deleting and letting this program rebuild them, if you can be bothered :P \r\n\r\nNexus Mod Manager now replaces \\\"Data Files\\\" so you will need to download that if you don\\'t already have it. SKSE will be automatically detected only if the file name is \\\"skse_loader.exe.\\\"\r\n\r\nSweetFX can only be toggled if ENB is present first, because it is treated as an \\\"extension\\\" of ENB so both librarys can exist simultaniously.\r\n\r\nThe \\\"ULTIMATE\\\" preset is basically an option to max absolutely everything for the best possible graphics, and can only be unlocked if all configs are \\\"Authentik\\\" (belonging to this MOD). If the configs are NOT Authentik you can still toggle ENB effects on/off in options and manually set all detail levels to maximum under the advanced tab.\r\n\r\nI mostly just want to get this out and see if there are any bugs, if anyone would like to request a feature then please give feedback, this page is a work in progress.\r\n\r\n\r\n[color=#448ccb][b]REPORTING BUGS : [/b][/color]\r\n\r\nIf you have some spare time, I would like to hear about your experience with this program, particularly the following:\r\n\r\n[color=#448ccb][b]- [/b][/color] Does the program detect your graphics card properly? If you have multiple graphics cards does it detect all of them?\r\n\r\n[color=#448ccb][b]- [/b][/color] Is the program automatically detecting the install path for Nexus Mod Manager on your computer? or does it force you to look for it manually?\r\n\r\n[color=#448ccb][b]- [/b][/color] If you are running an old version of windows, or you are running a 32-bit operating system, are you experiencing any issues?\r\n\r\n",
  "categoryId": "79",
  "version": "0.93",
  "author": "JMFruitSalad",
  "createdUnix": "1371078003",
  "updatedUnix": "1372260613",
  "containsAdultContent": false,
  "uploadedBy": "Freemanhl2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035926",
      "name": "SALEMv093",
      "version": "093",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1258",
      "fileName": "SALEMv093-37155-093.zip",
      "uploadedUnix": "1372260613",
      "modVersion": "093",
      "virusScanUrl": "https://www.virustotal.com/file/7df24bd59922d0bd4ea0901183d2ea8e7a2b836c4cb24d10c99ad511ef5543e1/analysis/1407617985/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SALEMv093-37155-093.zip?fid=1000035926&ttl=1535816659&ri=8192&rs=8192&setec=520e598c4acaf53a493090bba78ebcea"
    }
  ]
}