{
  "modId": 37184.0,
  "modName": "The Black Wolf Lodge Ranch Add-On",
  "summary": "An add-on for TheWinterHawk\\'s excellent player home mod, The Black Wolf Lodge, that expands it into a cattle ranching estate",
  "descriptionHtml": "One of my favorite player homes of all times has been [url=http://skyrim.nexusmods.com/mods/14660]the Black Wolf Lodge[/url] by TheWinterHawk. However, I always felt that due to the wealth of the estate and its location that it should be more than a simple manse upon the road. Remembering that land-owning farmers with livestock were the wealthy upper middle class (or higher) in most Northern European societies traditionally, it hit me- the Black Wolf Lodge estate should be a farm or ranch. Well, the terrain pretty much limited the former, and then it hit me- my ancestors viewed cattle as THE source of wealth (cows to the Gaelic people of Ireland were basically walking, mooing, edible ATM machines for milk cows, cashable checks for yearling bulls), and the Scandinavian peoples held them as a measure of wealth as well, soooo…. CATTLE RANCH!\r\nThis add-on is designed to compliment the Black Wolf Lodge by adding in two cattle paddocks, one for grazing and ranging, the other smaller for calves and culling for butchering. It also includes a third paddock with goats and a small weather shed or barn for them, three house guards with their own house out back (complete with outhouse, which Skyrim is lacking… makes one wonder, it does…), perimeter fencing on the nicer (Whiterun) side and a log palisade wall on the outer side to keep those pesky giants from nipping off with your livestock. \r\nFor simplicity’s sake (read that as: “I do navmesh and scripts as well as a fratboy does brain surgery after the tractor-pull of Spring Break drinking binges”), I didn’t make the guards overly interactive or set them up to do specific routines. This also keeps them on-site in case anything happens (like a dragon deciding to drop in for a spot of tea and your head, which happened to me twice while playtesting this mod… I must’ve gotten eat-me pheromones on me from the last dragon I fought), so don’t expect chess-champion ninja guards.\r\n The screenshots show different colouration for buildings as I am using the Beautiful Whiterun mod, along with 211 handy-dandy other mods that somehow have not caused my computer to have a nervous breakdown, so your appearances may vary a bit from what is shown. There is an easter egg or two, but I’m not spoilering them.\r\n\r\n[b]Compatibility[/b]- anything that doesn’t muck with Whiterun Exterior 14 or surrounding cells (basically, anything west of Whiterun’s walls out almost to Whitewatch Tower). \r\n\r\n[b]Installation[/b]- Download and activate with NMM. It largely uses vanilla meshes and textures, with only a handful of exceptions, so it’s a fairly straightforward plug-n-play mod.\r\n\r\n[b]Uninstallation[/b]- Nuke the entire site from orbit--it\\'s the only way to be sure. Sorry, wrong game. Simply uninstall using NMM, or delete the BlackWolfLodgeRanchAddon.esp file, and the Buildings and Stroti files in the Meshes and Textures folders.\r\n\r\n[b]Credits[/b]- Outhouse courtesy of Stroti and Tamina, Black Wolf Lodge (http://skyrim.nexusmods.com/mods/14660) created by TheWinterHawk\r\n\r\n---------------\r\n\r\n[b]Future Plans[/b]- \r\n* Adding ranch hands and another house for them\r\n* Counter-dragon AA guns... hey, one can wish.\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "Breandan",
  "createdUnix": "1371181515",
  "updatedUnix": "1371162571",
  "containsAdultContent": false,
  "uploadedBy": "Breandan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034103",
      "name": "Black Wolf Ranch Add-On",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4819",
      "fileName": "Black Wolf Ranch Add-On-37184-1-0.rar",
      "uploadedUnix": "1371162571",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/430ef3298631b6e7c8bbe4bde110f36045cd5c877f0aaf578c8224e3122b287e/analysis/1407602718/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Wolf%20Ranch%20Add-On-37184-1-0.rar?fid=1000034103&ttl=1535816705&ri=8192&rs=8192&setec=80efca04b8668498fe1cc0ba441079a9"
    }
  ]
}