{
  "modId": 37194.0,
  "modName": "Armor Rebalance ods spreadsheet file",
  "summary": "Simple spreadsheet with rebalanced armor stats based on the Vanilla armors in game. I have taken some time to consider armor type, materials, coverage and protection of each armor, with consideration for some special materials or crafting that may enhance the protection of a given set of armor. Armor is in Heavy and Light ordered lists.",
  "descriptionHtml": "Simple spreadsheet with rebalanced armor stats based on the Vanilla armors in game. \r\n\r\nI have taken some time to consider armor type, materials, coverage and protection of each armor, with consideration for some special materials or crafting that may enhance the protection of a given set of armor. \r\n\r\nArmor is in Heavy and Light ordered lists.\r\n\r\nSome notes: \r\n\r\nBlades armor has been moved to Light Category and adjusted appropriately for weight while retaining similar protection. This places is just below Dragonscale, which I have placed below Glass.\r\n\r\nStormcloaks (Guard) armor is actually the leather scaled variety of the Hold Guard armor, and does not account for the padded variety. The padded variety will retain the same protection for the shield and Helm, but will drop 2 pounds and 4 points of armor to 8/24.\r\n\r\nScale armor has been moved to a lesser armor, falling just above Imperial Light armor due to it\\'s complete lack of reasonable protection for the body. This sort of armor relies far more on Light armor skill for protection than the actual coverage of the armor, which is why I have done this. The boots, Gauntlets, and Helm still offer reasonable protection.\r\n\r\nHide Shield has been moved to Leather Armor, which has moved up the list considerably, being a more complex armor that offers more complete protection than many other armors on the list.\r\n\r\nI have broken up Nordic Steel and Steel Armor, though both are essentially the same. The Steel armor set includes the Pauldron Cuirass and offers somewhat more weight and Protection as a result. The Horned Helm is part of the Nordic set and is considered slightly more protective than the Steel Helm, etc..\r\n\r\nThis includes Dawnguard, Dragonborn, and Special armor sets and pieces. Originally, it also included some player added sets, but I have excluded those here as they were for my own personal use.\r\n\r\nAlso, mods like aMidian Born Book of Silence - Armors, Yngols Armor, and others that modify coverage and textures of Vanilla Armors will change the potential protection of a given suit based on those modifications by my way of thinking. The Scale armor from aMidian Born Armors is a perfect example of this, affording much better protection.\r\n\r\nThe other issue with balancing I have found, is the difference in armor pieces for male and female characters, with the female varieties in some cases, (such as Scale above), offering better protection than the male varieties of the same armor. Their is no way to resolve this without splitting the armor into different variants, or using similar variants for both, such as above.\r\n\r\nI have also included some notes on possible crafting materials with certain armors, and just specified basic crafting materials for others.\r\n\r\nI was considering making a Daedric metal, (Ebony ingots and Daedra Heart), which would yield some 5 ingots as a recipe, requiring an equal number of Ebony Ingots, possibly Void Salts or Fire Salts, (more likely the latter), and a single Daedra Heart. \r\n\r\nThis removes the absurdity of using a Daedra heart in the forging process and moves that element to the alchemy of metal, while keeping the requirements minimal in terms of the amount of that specific ingredient required.\r\n\r\nAlso, Akaviri Steel was another potential addition, which would require 1 ingot Orichalcum, 2 ingots Steel, and one ingot Corundum, (roughly), in a recipe yielding two 2lb. ingots of Akaviri Steel. Obviously only useful in making Akaviri Weapons and Armor, but lore friendly. \r\n\r\nThis would likely mean that both Adv. Armor Perk and Orcish Armor Perk would be required to work Akaviri Steel and forge armor and weapons from it.\r\n\r\n",
  "categoryId": "82",
  "version": "1.0",
  "author": "1027Kelvin",
  "createdUnix": "1371187813",
  "updatedUnix": "1371187813",
  "containsAdultContent": false,
  "uploadedBy": "1027Kelvin",
  "primaryFile": null,
  "files": []
}