{
  "modId": 37197.0,
  "modName": "Hot Tubs",
  "summary": "This is a hand made model that I created from scratch with textures. It comes with animated steam effect. There two of them that are wood and stone, I see that there\\'s a sweat lodge mod that has already been built. ",
  "descriptionHtml": "Wouldn\\'t the Dragonborn like to sit in a portable hot tub to relax his muscles after long hard battles and after a session with his wife? ;)\r\n\r\nUpdate: I have set up the collision data and the character no longer walks through the hot tubs. \r\nI will have version 1.1 uploaded tonight or tomorrow. \r\n\r\nThis hand built mod will let the Dragonborn look cool. The wooden hot tub that stands on all four legs with a stair mounted into it, you walk up the stairs to sit down. It is found sitting right behind Breezehome, it has a little fire underneath it to keep the water warm, just walk around the building and there it is. There\\'s the rock tub in Markarth next to the Water Mill that is upon one of the steps next to it\\'s cliff and is sitting without legs.\r\n\r\nMore textures will be added later. You can request to me the style of texture to add. I will place them at more locations and I accept location requests (PLEASE BE SPECIFIC.) \r\n\r\nEveryone: If any other problems, let me know and I will look into it. \r\n\r\nEnjoy!   \r\n",
  "categoryId": "85",
  "version": "V1.0",
  "author": "Valus34",
  "createdUnix": "1371197118",
  "updatedUnix": "1371195818",
  "containsAdultContent": false,
  "uploadedBy": "Valus34",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034162",
      "name": "Hot Tub",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7644",
      "fileName": "Hot Tub-37197-V1-0.rar",
      "uploadedUnix": "1371195818",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3ee4ead6778f2a56e33454402b058dee3139a8c943f8c84f355180c7fa1e6176/analysis/1407603399/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hot%20Tub-37197-V1-0.rar?fid=1000034162&ttl=1535816726&ri=8192&rs=8192&setec=dfe8ff8bad1a04f923126a4b237e66c5"
    }
  ]
}