{
  "modId": 37202.0,
  "modName": "Unreal Cinema ENB",
  "summary": "Unreal Cinema is an ENB configuration designed to give a cinematic and immersive experience within The Elder Scrolls V: Skyrim. ",
  "descriptionHtml": "[center][color=#D11E6E][b][u]INTRODUCTION[/u][/b][/color]\r\n\r\nUnreal Cinema is an ENB configuration designed to give a cinematic and immersive experience within The Elder Scrolls V: Skyrim. \r\n\r\n[img]http://static1.nexusmods.com/110/mods/110/images/37202-1-1371217050.jpg[/img]\r\n\r\nThe main focus of Unreal Cinema, aside from making effective use of cinematic style effects such as Letterbox Vignette, Tilt Shift Depth of Field, Active Film Grain, and Lens Flares, was to give the player the feel of a dark, yet fantastical, gritty and medieval atmosphere while exploring Skyrim. Rather than go for a realistic style or a vibrant style, that a lot of other ENB's offer, the goal was to achieve a unique artistic style that nobody else has quite captured yet. A lot of time was spent to make sure that you never felt like you was running an ENB. That this style was the way the game is meant to be played. From careful positioning of vignette borders to go with the UI to lighting balancing to avoid mountains looking like cardboard cutouts in specific lighting/weather types. There is a heavy emphasis on creating use for torches and light spells so darkness at night and in dungeons & caves is common. \r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nThe configuration may not be for everyone, it's certainly far from realistic, however I hope you can appreciate the time and effort put into this configuration and enjoy the many little things that combine together to bring this cinematic vision to Skyrim Nexus. \r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nUnreal Cinema was configured using an i5 3570k @4.2ghz, 8gb Corsair Vengeance RAM, & MSI Twin Frozr III R7950 OC BE 3gb. It also supports [url=http://skyrim.nexusmods.com/mods/27043][b][u]Enhanced Lights and FX[/u][/b][/url]. Also included within this profile is Mindflux's [url=http://enbdev.com/enbseries/forum/viewtopic.php?f=6&t=1499&sid=651088896bc1f208a077f5aa3d8627ee][b][u]Skyrim Particle Patch for ENB[/u][/b][/url].\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nAll author screenshots were taken using Unreal Cinema however please be aware that screenshots may vary by ENB profile version as the configuration is improved and may not represent the work in it's current form. If you upload user images please note the version used in the image title. \r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nYou can view a video of Unreal Cinema below.\r\n\r\n[youtube]NeIz6evkQuQ[/youtube]    [youtube]5TzjlvGJrlA[/youtube]\r\n\r\nFollow [url=https://www.facebook.com/beautifulskyrim][b][u]Beautiful Skyrim on Facebook[/u][/b][/url]. \r\n\r\n\r\n[img]http://static2.nexusmods.com/110/mods/110/images/37202-2-1371217050.jpg[/img]\r\n\r\n\r\n[color=#D11E6E][b][u]INSTALLATION[/u][/b][/color]\r\n\r\nBackup your saves and any d3d9.dll files in your Skyrim directory and remove any previous ENB/FXAA and Realistic Lighting files to avoid confliction.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nTo use this configuration you must download the required [url=http://beautifulskyrim.yolasite.com/enb-binaries.php][b][u]ENB Binary file[/u][/b][/url] (that is the d3d9.dll file) and [url=http://beautifulskyrim.yolasite.com/enb-files.php][b][u]ENB Helper file[/u][/b] [/url] (that is the enbhelper.dll) and install both into your Skyrim Directory.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img] \r\n \r\nOpen the Unreal Cinema ENB folder and extract the contents into your Skyrim directory. Overwrite if prompted.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nInstall Unreal Cinema Data Files. This is a mandatory install. You can install / uninstall via NMM for ease of use. All files are used with permission of their respective authors.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img] \r\n \r\nNavigate to My Documents/Games/Skyrim and set: \r\n\r\nbFloatPointRenderTarget=1 \r\nbEnableFileSelection=1 \r\nbDoDepthOfField=0\r\nbTreesReceiveShadows=1\r\nbDrawLandShadows=1\r\nbDrawShadows=1\r\nbShadowsOnGrass=1\r\n\r\nin skyrimprefs.ini.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img] \r\n\r\nNow, right click on enbhost.exe, click on Properties, click on the \"Compatibility\" tab, then check \"Run as Administrator\", and save.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nGo to [url=http://www.iparadigm.org/pages/pnenb/ENBoost.html][b][u]ENB Boost Setup[/u][/b][/url] and follow the instructions accordingly. Once you have the settings open enblocal.ini and edit it accordingly then save.\r\n\r\nOnce done search for the line:\r\n\r\n[MEMORY]\r\nVideoMemorySizeMb=3072\r\n\r\nAnd edit this according to the amount of VRAM your GPU has. Use the below table as a guide.\r\n\r\n1gb VRAM: 1024\r\n2gb VRAM: 2048\r\n3gb VRAM: 3072\r\n4gb VRAM: 4096\r\n5gb VRAM: 5120\r\n6gb VRAM: 6144\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img] \r\n\r\nDisable, or set to application controlled, all Anti Aliasing, Anisotropic Filtering, and V-Sync settings on your graphics card control centre and in-game. These will be handled by the ENB profile. Failure to do so will result in many ENB effects not being rendered as well as an increased performance hit.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nRun the Launcher and disable Anti Aliasing (including FXAA) and Anisotropic Filtering settings then save and exit.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nLaunch The Elder Scrolls V: Skyrim.\r\n\r\n\r\n[img]http://static1.nexusmods.com/110/mods/110/images/37202-3-1371217051.jpg[/img]\r\n\r\n\r\n[b]PLEASE READ THE NEXT THREE SECTIONS BEFORE ASKING QUESTIONS IN THE COMMENTS SECTION.[/b]\r\n\r\n\r\n[color=#D11E6E][u][b]RECCOMMENDED MODS[/b][/u][/color]\r\n\r\nIn order to get the most out of this ENB you should check out my [url=http://skyrim.nexusmods.com/articles/1308//?][b][u]Guide to modifying Skyrim & mod list[/u][/b][/url].\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nThis mod is pretty much developed around [url=http://skyrim.nexusmods.com/mods/27043][b][u]Enhanced Lights and FX[/u][/b][/url]. It is worth noting however that I was using an older version during development so ELFX Enhanced was not a part of it. Therefore until further notice I recommend not using ELFX Enhanced with Unreal Cinema.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nIf you play in third person exclusively then I highly reccommend editing your character position using [url=http://beautifulskyrim.yolasite.com/mods.php][b][u]Enhanced Third Person Camera[/u][/b][/url] so that your character is a little to the left of the crosshair for optimal experience with the Tilt Shift Depth of Field. This way Depth of Field blurring will only render beyond where the crosshair points rather than all the time due to the character being centred.\r\n\r\nReccommened settings for Enhanced Third Person Camera are: \r\n\r\nX Position= 35 (50 for Bow and Crossbow)\r\nZ Position= -10\r\n\r\nThis mod requires SKYUI/MCM and the latest version of SKSE.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nI also recommend using [url=http://skyrim.nexusmods.com/mods/26387][b][u]Simple Crosshair[/u][/b][/url] if you are using Enhanced Third Person Camera. This will replace the cursor with a small dot reducing the chance of breaking your immersion.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nWith the darker nights and dungeons you will find [url=http://skyrim.nexusmods.com/mods/11008][u][b]Candlelight Toggle [/b][/u][/url] very much useful.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nYou will also find great use in [url=http://skyrim.nexusmods.com/mods/12801][u][b]Optimizer Textures[/b][/u][/url] to help improve your performance. \r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\nLastly f you encounter a problem where dungeons fade extremely dark then install [url=http://skyrim.nexusmods.com/mods/27960/?][b][u]Blackout[/u][/b][/url] as this is reported to fix the issue.\r\n\r\n\r\n[img]http://static2.nexusmods.com/110/mods/110/images/37202-5-1371217051.jpg[/img]\r\n\r\n\r\n[color=#D11E6E][b][u]EFFECTS, DUNGEONS, & NIGHTS[/u][/b][/color]\r\n\r\n[b][u]SSAO[/u][/b]\r\n\r\nTo disable SSAO open the ENB GUI by pressing Shift+Enter, uncheck Ambient Occlusion and Indirect Lighting, and then click on Save Configuration at the top of the GUI.\r\n\r\nTo enable SSAO open the ENB GUI by pressing Shift+Enter, check Ambient Occlusion and Indirect Lighting, and then click on Save Configuration at the top of the GUI.\r\n\r\nEnabling or disabling SSAO will have an impact on performance. \r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]Depth of Field[/u][/b]\r\n\r\nTo disable Depth of Field open the ENB GUI by pressing Shift+Enter, uncheck Depth of Field, and then click on Save Configuration at the top of the GUI.\r\n\r\nTo enable Depth of Field open the ENB GUI by pressing Shift+Enter, check Depth of Field, and then click on Save Configuration at the top of the GUI.\r\n\r\nEnabling or disabling Depth of Field will have an impact on performance.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]Letterbox Vignette[/u][/b]\r\n\r\nTo disable Letterbox Vignette open the ENB GUI by pressing Shift+Enter, uncheck Letterbox Vignette, and then click on Save Configuration at the top of the GUI.\r\n\r\nTo enable Letterbox Vignette open the ENB GUI by pressing Shift+Enter, check Letterbox Vignette, and then click on Save Configuration at the top of the GUI.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[u][b]Sepia Tone[/b][/u]\r\n\r\nTo disable Sepia Tone open the ENB GUI by pressing Shift+Enter, uncheck Sepia Tone, and then click on Save Configuration at the top of the GUI.\r\n\r\nTo enable Sepia Tone open the ENB GUI by pressing Shift+Enter, check Sepia Tone, and then click on Save Configuration at the top of the GUI.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]Film Grain[/u][/b]\r\n\r\nTo disable Film Grain open the ENB GUI by pressing Shift+Enter, uncheck Film Grain, and then click on Save Configuration at the top of the GUI.\r\n\r\nTo enable Film Grain open the ENB GUI by pressing Shift+Enter, check Film Grain, and then click on Save Configuration at the top of the GUI.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]Sun Rays[/b][/u]\r\n\r\nTo disable Sun Rays open the ENB GUI by pressing Shift+Enter, uncheck Sun Rays, and then click on Save Configuration at the top of the GUI.\r\n\r\nTo enable Sun Rays open the ENB GUI by pressing Shift+Enter, check Sun Rays, and then click on Save Configuration at the top of the GUI.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]Detailed Shadows[/u][/b]\r\n\r\nTo disable Detailed Shadows open the ENB GUI by pressing Shift+Enter, uncheck Detailed Shadows, and then click on Save Configuration at the top of the GUI.\r\n\r\nTo enable Detailed Shadows open the ENB GUI by pressing Shift+Enter, check Detailed Shadows, and then click on Save Configuration at the top of the GUI.\r\n\r\nYou can also edit the [SHADOW] section as you see fit. Settings to edit are as follows: \r\n\r\n[SHADOW]\r\nShadowCastersFix=true / false\r\nShadowQualityFix=true / false\r\nDetailedShadowQuality=2 (lower is higher)\r\nUseBilateralShadowFilter=true / false\r\n\r\nThese are set to true by default.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]Rain[/u][/b]\r\n\r\nThe latest version of ENB now includes adjustable Rain as a feature. \r\n\r\nTo disable Rain open the ENB GUI by pressing Shift+Enter, uncheck Rain, and then click on Save Configuration at the top of the GUI.\r\n\r\nTo enable Anti Aliasing open the ENB GUI by pressing Shift+Enter, check Rain, and then click on Save Configuration at the top of the GUI.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[u][b]Anti Aliasing[/b][/u]\r\n\r\nTo disable Anti Aliasing open the ENB GUI by pressing Shift+Enter, uncheck Anti Aliasing, and then click on Save Configuration at the top of the GUI.\r\n\r\nTo enable Anti Aliasing open the ENB GUI by pressing Shift+Enter, check Anti Aliasing, and then click on Save Configuration at the top of the GUI.\r\n\r\nEither enable ENB AA or use SMAA Injector AA (ENB AA and Injector AA can be used together). Hardware AA will cause effects not to render so should always be disabled with this configuration.\r\n\r\n\r\n[img]http://static2.nexusmods.com/110/mods/110/images/37202-1-1371217062.jpg[/img]\r\n\r\n\r\n[color=#D11E6E][b][u]F.A.Q[/u][/b][/color]\r\n\r\n[b][u]Will this overwrite any other mods?[/u][/b]\r\n\r\nThere may be textures included that will overwrite textures already installed. I normally keep these to water and sun textures.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]Why is everything dark/bright?[/u][/b]\r\n\r\nThis is likely caused by the difference in monitor settings between you and I. Just adjust your in game brightness level a little to a level that you are comfortable with. \r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]Why is fog not rendering properly?[/u][/b]\r\n\r\nThis is sometimes caused by SSAO which is enabled by default. You can either disable SSAO (see the EFFECTS section for instructions on how) or try refreshing the render by opening up your map and then exiting.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]I don't have great performance.[/u][/b]\r\n\r\nENB can be very taxing on an average system, especially with alot of effects applied. If you have a GPU with limited VRAM, and tons of large texture mods installed, this can cause performance issues. \r\n\r\nTry enabling the FPS limiter in game by pressing the Division key on your number pad. This can make the game smoother at the cost of slightly increased loading times.\r\n\r\nFailing that try disabling some of the effects. Depth of Field & SSAO can have a taxing performance cost with ENB. So try disabling them if you find the performance just isn't enough.\r\n\r\nYou can also try using a [url=http://skyrim.nexusmods.com/downloads/file.php?id=12801][u][b]Texture Optimizer[/b][/u][/url] to improve your performance. This will compress your textures to manageable sizes for your RAM to load in to decrease stuttering.\r\n\r\nIt's also worth noting that no ENB can ever be one hundred percent perfect for visual quality & performance (until it is optimised by it's developer) without alot of quality resources being cutback. What's good for one person may not neccessarily be good for someone else. This is the case with every ENB, even those geared towards high performance.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]How can I alter a setting I dislike?[/u][/b]\r\n\r\nTo alter settings in enbseries.ini you can change them in real time in-game by pressing Shift+Enter to bring up the ENB GUI. Make sure you save your changes if you want to keep them. If you wish to discard your changes just exit the GUI (Shift+Enter) and then press Backspace to reload the profile.\r\n\r\nFor all other file edits use notepad. You will have to Alt+Tab in and out but you will see most changes in real time.\r\n\r\nIf you wish to edit the ENB more to your personal taste then I reccommend checking out the [url=http://skyrim.nexusmods.com/downloads/file.php?id=8005][u][b]Guide to ENB Series mods[/b][/u][/url]. If that doesn't answer your question then feel free to ask me on the comments section and I'll try my best to help.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]Is there an in game FPS counter?[/u][/b]\r\n\r\nYes. If you wish to enable the ENB FPS Counter, press * on your number pad.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]How can I take a screenshot with all the effects applied?[/u][/b]\r\n\r\nIf you wish to take a screenshot, press Insert. This will ensure the screenshot is taken with all effects applied.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]Is there any way to disable the ENB in game?[/u][/b]\r\n\r\nIf you wish to disable the ENB, press Shift+F12.\r\n\r\n[img]http://imageshack.us/a/img513/5605/6jmx.jpg[/img]\r\n\r\n[b][u]Will you be updating Unreal Cinema to ENB Binary version X?[/u][/b]\r\n\r\nYes, though there is no time frame on when it will be updated. Work is considered final until I get around to updating the profile.\r\n\r\n\r\n[img]http://static1.nexusmods.com/110/mods/110/images/37202-4-1371217018.jpg[/img]\r\n\r\n\r\n[color=#D11E6E][b][u]CREDITS[/u][/b][/color]\r\n \r\nUnreal Warfare (Tweaker and compiling of Unreal Cinema, GUI code implementation, Raindrops file, Sunsprite texture)\r\nBoris Vorontsov (ENB Series)\r\nHeliosDoubleSix (HD6 Shader code)\r\nMatso (Sun textures, original Depth of Field code)\r\nIndigoNeko (Active Film Grain)\r\nConfidence Man (Water texture)\r\nKalicola (Palette)\r\nMidhras (Palette)\r\nJawZ (DNI, GUI coding, Sunsprite texture)\r\ngp65cj04 & Soulwynd (Tilt Shift DoF + GUI implementation)\r\nKyokushinoyama (Sun Sprite file)\r\nMindflux (Particle Patch & Further Dark Dungeons for ENB)\r\nOpethfeldt (Sunsprite texture)\r\nTapioks (Shader Package Port)\r\n747823 (Fog Meshes)\r\nPlutoman & co (Realistic Lighting)\r\nThe FXAA Team (FXAA)\r\nHodilton (Video)\r\nBDMods (Video)\r\nTarmicle (Donation)\r\n\r\nAlso a big thankyou to everyone who has supported my work. Without your support, and sometimes a push in the right direction to pick myself back up this mod would never of have existed.\r\n\r\nIf you are not on this list but think you should be please let me know.\r\n\r\nThankyou.[/center]",
  "categoryId": "62",
  "version": "0.236",
  "author": "Unreal Warfare",
  "createdUnix": "1371217581",
  "updatedUnix": "1385825810",
  "containsAdultContent": false,
  "uploadedBy": "UnrealWarfare",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034209",
      "name": "How to install ENB",
      "version": "FINAL",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "5234",
      "fileName": "How to install ENB-37202-FINAL.zip",
      "uploadedUnix": "1371225093",
      "modVersion": "FINAL",
      "virusScanUrl": "https://www.virustotal.com/file/656a19b72d6865007c8e7299abd120508bdda058c63dc9ad707d6ed71f52c69f/analysis/1407603728/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/How%20to%20install%20ENB-37202-FINAL.zip?fid=1000034209&ttl=1535816734&ri=8192&rs=8192&setec=81a97aa7c90e478706d38f4824f48a88"
    },
    {
      "fileId": "1000057605",
      "name": "Unreal Cinema Data File v1-17",
      "version": "v1.17",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21551",
      "fileName": "Unreal Cinema Data File v1-17-37202-v1-17.rar",
      "uploadedUnix": "1380018838",
      "modVersion": "v1.17",
      "virusScanUrl": "https://www.virustotal.com/file/aa8f43b3cd8081efee3772e23871b10276b90965c637c28f58651d3cc83b5189/analysis/1407732977/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unreal%20Cinema%20Data%20File%20v1-17-37202-v1-17.rar?fid=1000057605&ttl=1535816734&ri=8192&rs=8192&setec=c0c63c0f239d9259526602c38adeac3d"
    },
    {
      "fileId": "1000080113",
      "name": "Unreal Cinema ENB - The Directors Cut - 0-236 - BETA",
      "version": "0.236",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "629",
      "fileName": "Unreal Cinema ENB - The Directors Cut - 0-236 - BETA-37202-0-236.rar",
      "uploadedUnix": "1384707306",
      "modVersion": "0.236",
      "virusScanUrl": "https://www.virustotal.com/file/f159e01d5feafbdbdd02d4c7f7d3d37cd25ee837141e8e12be0b324fb06b5510/analysis/1407796870/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unreal%20Cinema%20ENB%20-%20The%20Directors%20Cut%20-%200-236%20-%20BETA-37202-0-236.rar?fid=1000080113&ttl=1535816735&ri=8192&rs=8192&setec=b230a381f7fa1ec655f50e5c3dd995d7"
    },
    {
      "fileId": "1000084573",
      "name": "Optional Files for ENB ",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2015",
      "fileName": "Optional Files for ENB -37202-v1-0.rar",
      "uploadedUnix": "1385825810",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a214052942724ff9524faf046f3aeb3dcf1b7616ee0c3c025b118e920eedad65/analysis/1407814749/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20Files%20for%20ENB%20-37202-v1-0.rar?fid=1000084573&ttl=1535816736&ri=8192&rs=8192&setec=fbdcaf2adf5396f640148c489e9cbcba"
    }
  ]
}