{
  "modId": 37200.0,
  "modName": "Horkers Of Skyrim",
  "summary": "Have you ever noticed how similar Horkers are to Walrus? Yes, then how come you only see them in groups of 3?  Why are there no babies or big males?  This mod changes and adds large pods of Horkers with new Baby pups and big Bulls.   ",
  "descriptionHtml": "[IMG] http://frank-the-fish.webs.com/2013-06-14_00001sss.png [/IMG]\r\n\r\n\r\n[color=gold]--------Horkers Of Skyrim--------[/color]\r\nHorkers of Skyrim is a Lore friendly mod that aims to add realism to Horkers and realistically integrate them into the world. It adds 2 new Horker models to match the old one a ‘Bull Horker’ – the equivalent of a large dominant male walrus.  These are larger than normal Horkers they have a lot more blubber (putting it simply - they are fatter :D) and they have much longer tusks and are very aggressive and can even knock you over.  The other added creature is the ‘Horker Pup’ – a small baby Horker, these Horkers are the equivalent of baby walrus and will try to run (slither rather) away from you if approached. You can find these herds of Horker located above ‘Dawnstar’ (there will be a map in the images section).  There are not many herds implemented yet, this mod is still a work in progress, but I have plans to have these herds scattered across Skyrim’s shores in the future. Other features include custom sounds near the herds, this fills the sea air with loud Horker Burps, Gurgles and Roars. There is also an implemented Horker poaching faction called “the Huntsmans Horker”. All that has been added is a base for them, with plenty of custom items. The faction currently does nothing quest wise, but could possibly be transformed into a quest later on if I found someone with the experience and know how.\r\n[color=gold]for those who don’t want to read the description You Can Find the Horkers above Dawnstar :D[/color]\r\n\r\n\r\n\r\n[color=gold]--------Horkers Of Skyrim V1--------[/color]\r\n*New Creature Bull Horkers\r\n*New Creature Horker Pups\r\n*New Creature Horker Dog\r\n*New NPC ‘Faulk’\r\n*New Buildings (Huntsman’s Horker Complex)\r\n*3 Interiors (Huntsman’s Horker office, warehouse and bunkhouse) \r\n*New Weapon Horker Bone Dagger\r\n*New Misc. Horker Hide\r\n*New Misc. Gutting Tools\r\n*New Food Salty Horker Loaf\r\n*Added ‘Tanning Racks’ with Horker Skin Texture\r\n*Added lots of notes\r\n*New Book ‘Killing Horkers by Olaf’\r\n*New Objects Crates of Horker meat\r\n*New Objects Hanging Horker meat\r\n*New Objects Huntsman’s Horker Banner\r\n[color=gold]*Extra Added[/color]\r\n*Papa Walrus an essential bull Horker (all his attacks will knock you down and he can’t die)\r\n*Baby Walrus an essential Horker Pup (can’t Die)\r\n(^^^both of these can be found on the crossroad near ‘Honningbrew Meadery’ they are there to use as companions if you have a pet mod of some kind. But they are not yet standalone pets/followers.) \r\n\r\n\r\n[color=gold]---- Installation ----[/color]\r\n  - extract archive\r\n  - copy the data folder into your Skyrim directory\r\n  - if prompted for an overwrite hit yes/copy and replace\r\n\r\n\r\n[color=gold]---- RECOMENDED MODS!! ----[/color]\r\nSkyrim Pets by Kcaz – allows you to get the Horkers to follow you and be your pets you can check out his mod! (Link Below)\r\n[url=http://skyrim.nexusmods.com/mods/11396/?]  Skyrim Pets [/url]\r\n\r\nPrides of Skyrim– this has nothing to do with this mod but it’s my other mod, so thought I would chuck it in – it will add prides of lions to Skyrim if this sounds cool the link’s Below!\r\n[url=http://skyrim.nexusmods.com/mods/12647]  Prides Of Skyrim [/url]\r\n\r\n\r\n[color=gold]-----Credits-----[/color]\r\n - All new Horker Meshes were edited by me originally from Bethesda\r\n - All new textures were edited and/or created by me\r\n - Meshes for Horker meat creates and the hanging meat was from Food Container Resource by Blary\r\n - New sounds where found at www.Freesound.org recorded by felix.blume\r\n - Special thanks to DogTown101 for sharing his knowledge on exporting Creatures for Skyrim\r\n\r\n\r\nHOPE YOU ENJOY THIS MOD!\r\nPM me if you have any further questions or queries \r\n\r\n\r\nI would like to give a shout out to \\'Robbaz\\' my favourite youtuber\r\n[IMG] http://frank-the-fish.webs.com/RobbazTitle.png [/IMG]\r\nI would like to dedicate this mod to Robbaz and Walrus: “love your Vids, thanks for the laughs xD”\r\n - (hope you get the chance to see and play this, and don’t mind me using your images).\r\nif you don\\'t know Robbaz the link to his channel is below, SUBSCRIBE to him! ..... become a Viking today!\r\n[url=http://www.youtube.com/user/Robbaz] CLICK HERE FOR ROBBAZ\\'s CHANNEL!![/url]\r\n\r\n\r\nThanks everyone for [color=gold]ENDORSEING!![/color] Frank the Fish\r\n[IMG] http://frank-the-fish.webs.com/2013-06-14_00014.jpg [/IMG]\r\nMORE HORKERS AND VIKING ADVENTURES TO COME!!\r\n[url=http://www.youtube.com/user/Robbaz] CLICK HERE FOR ROBBAZ\\'s CHANNEL!![/url]",
  "categoryId": "83",
  "version": "v1",
  "author": "frankthefish",
  "createdUnix": "1371225516",
  "updatedUnix": "1371218713",
  "containsAdultContent": false,
  "uploadedBy": "frankthefish",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034186",
      "name": "Horkers Of Skyrim",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19803",
      "fileName": "Horkers Of Skyrim-37200-V1.rar",
      "uploadedUnix": "1371218713",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/f1152d9469f834d98fb40685c03b05650b9b89d91e54a057ed205bdcd2b8b880/analysis/1407603441/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horkers%20Of%20Skyrim-37200-V1.rar?fid=1000034186&ttl=1535816730&ri=8192&rs=8192&setec=70a7cb651fc5b05a84e756911c297e9a"
    }
  ]
}