{
  "modId": 37227.0,
  "modName": "Clothing Armor",
  "summary": "Converts all clothing to have an armor rating.",
  "descriptionHtml": "With the mage in mind, all vanilla clothing has a slight armor rating.\r\nClothing now has more function then just appearance.\r\n\r\nWhat this mod changes:\r\n1: All clothing functions like light armor. You will get light armor skill by wearing clothing.\r\n2: Starting Light Armor (Agile Defender 1/5) and Heavy Armor Perk (Juggernaut 1/5) now increase clothing\\'s armor rating as well.\r\n3: Chest pieces have a base armor rating of 8\r\n4: Hats, Boots and gloves have a base armor rating of 5\r\n5: Chest with hood clothing have a base armor rating of 13\r\n6: Clothing names have been update to reflect what type of \\\"clothing\\\" they are. Example: instead of it saying clothing, it will say Farmer\\'s Clothing or Merchant\\'s Clothing.\r\n\r\nHaving the Light Armor Perk Agile Defender and Heavy Armor Perk Juggernaut increase the base armor rating for clothing by 20%, 40% etc and will likely stack. No clothing can be upgraded or crafted by a armor smith. I felt this helped balance clothing. Armor is still more protective, but if you are like me and want to play a mage who uses clothing but don\\'t want to equip armor that makes you look like a warrior or thief, this mod gives a reason for the mage to put a perk or two into light/heavy armor and get by with just clothing.\r\n\r\nThe idea of this mod as led me to create something less lore breaking and obviously clunky to get a protected mage in clothing. This mod was created as a replacement.\r\nhttp://skyrim.nexusmods.com/mods/37405//?\r\nI will continue to leave this one up for a time.\r\n\r\nMod Conflict\r\nDoes not appear to conflict with any mod that changes the texture or mesh of clothing.\r\nWould likely not work well with mods that change the perks for Heavy and Light Armor.\r\nDoes not update clothing provided by any DLC yet.",
  "categoryId": "60",
  "version": "0.1",
  "author": "WetWire",
  "createdUnix": "1371280495",
  "updatedUnix": "1371279749",
  "containsAdultContent": false,
  "uploadedBy": "wetwire",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034304",
      "name": "Clothing Armor 01",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Clothing Armor 01-37227-0-1.rar",
      "uploadedUnix": "1371279749",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/24fb8dc5007735b09e304b2e15f32ac201ba79c74426500e00854bf84e96a1e0/analysis/1407604623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clothing%20Armor%2001-37227-0-1.rar?fid=1000034304&ttl=1535816785&ri=8192&rs=8192&setec=34cfd9a9123b7b4d54c0d0669ea80701"
    }
  ]
}