{
  "modId": 37240.0,
  "modName": "Dragonmast Keep",
  "summary": "A keep that is home to the Dragonborn away from the woes of the land.",
  "descriptionHtml": "DESCRIPTION-\r\n-Dragonmast Keep is a quaint home for the Dragonborn located on the hilltop of a deserted island NE of Dawnstar, ready to be traveled to. Safe for storage and accessible immediately as a player home (I hope). Comes with two areas: Courtyard and Dragonmast proper, the former holding a large garden and smithing area, and the keep holding the living quarters for yourself, a housecarl and a spouse. A secret storage area is in the Enchanting/Alchemy room, and the keep provides a kitchen as well. There are several manikins and weapon racks. The decorum works for any side of the civil war the Dragonborn may hail to, albeit perhaps a more Imperial bias. I\\'d simply figure the dragon motif works even if you\\'re non-aligned. I felt like the place could use a good mix of different influences. Imperial, older Nordic, and even some Dwemer as if the place had been built on top long after. Mm, looks good I think. \r\n\r\nThis is my first mod, so I hope everything works out alright. This creation kit thing is a marvelous hobby! Please contact me if there are any problems, concerns, or praise.\r\n\r\nREQUIREMENTS- \r\n-None, besides vanilla Skyrim. Hadn\\'t gotten to using any mods or expansions for the work yet.\r\n\r\nINSTALLATION- \r\n-Copy file into the Skyrim Data folder, I\\'d imagine. \r\n\r\n",
  "categoryId": "68",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1374642020",
  "updatedUnix": "1374641985",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040398",
      "name": "DragonmastKeep",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "189",
      "fileName": "DragonmastKeep-37240-1-0.zip",
      "uploadedUnix": "1374641985",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e462f6498ec810dd0cad706513c94a23b15c1e671457f8db819cf410239f0d97/analysis/1407654369/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DragonmastKeep-37240-1-0.zip?fid=1000040398&ttl=1535816806&ri=8192&rs=8192&setec=3dd7d30314b745d816a2da2c5a49856c"
    }
  ]
}