{
  "modId": 37246.0,
  "modName": "Relics of The Reach",
  "summary": "Relics of the Reach adds many rare breton weapons and armors to skyrim and replaces red eagles fury/bane swords with new meshes and textures. Complete the reg eagle quest to find new items and talk to breton merchants to buy new armors and weapons imported from high rock. New armors have male and female support.",
  "descriptionHtml": "Updated again&#33;\r<br />\r<br />Repacked everything this time no bsa file just loose files, everything should work correctly and I fixed the esp file with tes5edit and properly added back what was fixed and it does work correctly for me. Only way it could mess up for someone is because there is another mod that somehow conflicts. I removed all modded items from the containers of qasmoke since they were conflicting with any other mod including my own that also added things to those containers. I deleted all changes I did to both red eagle swords with tes5edit because they were both dirty edits and then put them back the right way so it should be all good now:-)\r<br />\r<br />\r<br />\r<br />Finally found the time to make this mod&#33; \r<br />\r<br />It has always bugged me that bretons in skyrim are mostly miners or slaves or crazy cult members. They don&#39;t have their own type of armor or weapons like the other races do and the few bretons that do carry weapons are trying to kill the player all the time. I have added unique armors and weapons to four breton merchants in the game. Two of them, belethor in whiterun and  imedhnain in markarth are part of the main game. The other two are split between dawnguard and dragonborn DLCs. \r<br />\r<br />Sorine jurard in the dawnguard hq and glover mallory in raven rock DB DLC also sell these items. The armors are called noble plate armor, noble plate gauntlets, noble plate boots, noble plate helmet with one variation of the helmet and there is a noble plate shield. These items have similar stats to steel plate only slightly lighter. There are several color variations on the noble plate cuirass red, blue, green, orange, and purple. \r<br />\r<br />There is a rare relic armor only found in the reach called wayrest plate armor. The forsworn are actually bretons that left high rock to be witchmen and their story is told in many elder scrolls games. At some point they had to collect many things from their original homeland before settling in the reach in skyrim. Throughout the reach when you find forsworn chests and boss chests you will have a 50% chance of finding the new items in there but the wayrest plate armor can only be found in one place as part of a default quest in the reach. \r<br />\r<br />There are eight new swords, four base models and four better versions. The swords are patron sword, patron brand, partisan sword, partisan brand, noble sword, noble brand, majestic sword, majestic brand. The base models look common or old and their scabbards do too but the better versions look expensive and highly polished with fancy engravings.\r<br />\r<br />There are three rapiers but they are harder to find because they have only a 25% chance of being found or bought. The rapiers are steel ivory rapier, antique rapier, and noble steel schiavona.\r<br />\r<br />None of these new items can be forged only improved at the forge/grindwheel/table. They are supposed to be old or new but imported from high rock or relics so no they can&#39;t be made at a forge.\r<br />\r<br />Installation: use nexus mod manager or manually extract contents to skyrim data directory. There are two other files available, one is for main game plus dawnguard support and the other is both dawnguard and dragonborn support.\r<br />\r<br />BUGS\r<br />\r<br />Oh yes there are bugs&#33; The new armor has rigging problems but I have heard from the person that works on the original meshes that he is working on a fix but for now there are problems. A scabbard is missing on one rapier maybe I can get it done in the next version not sure yet. The blood FX for the rapiers are not right at all hopefully original author can fix them soon. Find any other bugs please post them in the comments section so I can fix them thanks.\r<br />\r<br />\r<br />CREDITS\r<br />\r<br />This mod would not be possible without content from other mods and here are the credits for those mods authorized with permission of course:-)\r<br />\r<br />Red eagle sword handles and textures by Ewi65  Ewis True Weaponry of Viscounts and Sirrahs Weapon Pack http://skyrim.nexusmods.com/mods/27898/?\r<br />\r<br />Swords and red eagle sword blades and textures by ImsumDave  four swords mod http://skyrim.nexusmods.com/mods/28858/?\r<br />\r<br />Rapiers by Throttlekitty files found on foreign language site and informed him about it and he authorized use of files.\r<br />\r<br />Witcher2 armors and textures by CDProjektRED and LordOfWar The Witcher 2 Models http://skyrim.nexusmods.com/mods/5588/?\r<br />\r<br />Female witcher 2 armor by LordBaraban  Witcher 2 Style Dawnguard and Standard Heavy Plate http://skyrim.nexusmods.com/mods/22602//?\r<br />\r<br />Shield by TheMalfazar BDYEB mod http://skyrim.nexusmods.com/mods/34433//?\r<br />\r<br />\r<br />Thanks for downloading this mod and remember to endorse it if you like it thanks:-)\r<br />\r<br />",
  "categoryId": "36",
  "version": "v1.1",
  "author": "Dragonslayer2k12",
  "createdUnix": "1371362786",
  "updatedUnix": "1404530519",
  "containsAdultContent": false,
  "uploadedBy": "dragonslayer2k12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000115947",
      "name": "RelicsoftheReach",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "233924",
      "fileName": "RelicsoftheReach-37246-v1-1.rar",
      "uploadedUnix": "1404529747",
      "modVersion": "v1.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RelicsoftheReach-37246-v1-1.rar?fid=1000115947&ttl=1535816816&ri=8192&rs=8192&setec=66ed754002231349b5eb465abb67ad65"
    },
    {
      "fileId": "1000115949",
      "name": "Dawguard Version",
      "version": "v1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "Dawguard Version-37246-v1-1.rar",
      "uploadedUnix": "1404530460",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d9c811b1e595173c7b873ed2962372d642ea1e5e8123445fd27abfda3a2f3fe9/analysis/1408161254/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawguard%20Version-37246-v1-1.rar?fid=1000115949&ttl=1535816816&ri=8192&rs=8192&setec=069ca6ae666f57ac869e847d51f76d38"
    },
    {
      "fileId": "1000115950",
      "name": "DGDB Version",
      "version": "v1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "DGDB Version-37246-v1-1.rar",
      "uploadedUnix": "1404530519",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6f9bec469d736950a03f91b747f0cfeca2d576dd75cf9e085841767f762072a5/analysis/1408161254/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DGDB%20Version-37246-v1-1.rar?fid=1000115950&ttl=1535816817&ri=8192&rs=8192&setec=e3de9ff4bb9cedef9c218576d89ab203"
    }
  ]
}