{
  "modId": 37276.0,
  "modName": "Better ritual stone and twin souls perk mod",
  "summary": "This Mod changes the Twin souls Perk and Ritual Stone power for a more realistic gameplay as a necromancer and will benefit any summoner class.",
  "descriptionHtml": "\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n-Added New version which renames the twinsouls perk, changes it so you can have up to 100 summons AND get it right away no need to get 100 conjuration skill just get a level up and purchase the perk. Also makes a MUCH longer reanimation and summon time on atronachs and undead but you MUST get the Atromancy perk and necromancy perk to improve both time limits. or get necromancy perk for longer reanimation. (DOES NOT CHANGE RITUAL STONE AT ALL) \r\n\r\n- original ritual stone file is also still avaible. you only need one main file but if you want both the 100 summon cap AND modified ritual stone effect download both main files.\r\n\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\nThis Mod changes the Twin souls Perk and Ritual Stone power for a more realistic gameplay as a necromancer and somewhat as a conjurer. \r\n\r\nWhat i did was change the twin souls perk to allow UP TO 100 summons. Now im not saying you should go out and summon a whole army and feel overpowered and ruin your game experience (unless you want to) what im trying to do is allow you the freedom of a real necromancer/conjurer. I found it very unrealistic that i could only summon 1-2 creatures max, how do all these other NPC\\'s have many skeletons raised in there dungeons? so now that this is unlocked you can go around and play skyrim like normal, except if you ever find yourself in a tight spot and your one summon isn\\'t doing enough or you are fighting a boss and need some backup and have some extra magicka you can summon say 4 or 5 fire atronachs to help bombard the enemy while you rain down lightning or something. You can also have more then 2 dead thralls now ;) and i can see many roleplaying enhancements with that.\r\nthere is also a version that raises the cap to only 10 so that its not to overpowered but you still get a feel of being a master\r\n\r\nNote: You won\\'t receive the ability to summon up to 100 summons unless you actually have the Twin souls perk which requires 100 conjuration, so now you can feel like a true master of conjuration. \r\n\r\nAnother thing i changed was the Ritual stone power, so that it is now a lesser power and ressurects the targets permanently. you can use it as many times a day as you want but i changed it so the area of effect is 6. so you can now stand over the body you want to raise and resurect just that one. then onto the next etc... NOTE: sometimes you have to be in the correct position or the effect won\\'t reach the body, i tried to fix this by make the AOE a little larger and it worked for me. just have the body under or right infront of you to resurect it.\r\n\r\nNOTE: you can\\'t use this power unless you get it from the ritual stone, you can\\'t use console commands or anything else you must get it from the stone. if you store the power on the Aethrial crown that might work but i haven\\'t tested it yet.\r\n\r\n\r\nthis is my first mod uploaded to Nexus so i welcome any constructive critism and feedback.\r\n\r\nThanks!\r\n\r\n\r\n*Please do not upload to any other site without my permission. \r\n\r\n\r\n\r\nInstallation:\r\nDownload and save to desktop or somewhere that you remember. then\r\n1. Unzip and put the necromancermod.esp in your skyrim\\\\data folder and your done, if you use a mod manager you need to tick the box to enable the mod.\r\n2. if you use nexus mod manager or another and want to use that then, download to desktop or somewhere easy to find and in your mod manager click \\\"add mod\\\" then select the archive of my mod and upload it. then just install and activate.\r\n\r\nNOTE: i have included two pictures showing where the buttons are for add mods to NMM and how the ESP should look when activated incase you didn\\'t know :)\r\n\r\nUninstallation: \r\nfirst get a differant stone power then the ritual stone and and go inside somewhere, anywhere then save without having the ritual stone power OR ANY undead summoned from the power.\r\nthen manuallly remove necromancerMOD.esp for your skyrim\\\\data folder directory OR if you used a mod manager click uninstall. There are NO scripts used in this mod so there is no save game bloating or anything. \r\n*see bugs for unninstallation safety.\r\n\r\n\r\nif there are any bugs or problems with this mod please let me know and i will try my best to fix them.\r\n\r\n\r\nFuture plans:\r\nto add more necromancer spells and possible a perk tree dedicated to necromancy and a necromancer lair where you can store all your undead minions.\r\n\r\n\r\ncompatability: should be compatible with all mods EXCEPT those that alter the ritual stone Power and Twin souls perk in the conjuration tree. if you want to use both mods then you can activate my mod AFER theres so that you still get the effect.\r\n\r\n\r\nthere are five versions:\r\nNormal: 100 sumons cap, unlimited ritual stone uses\r\nBalanced: 10 summons cap, 1 time a day ritual stone but has large area of effect.\r\nBalanced 2: 10 summons cap, 1 time a day but smaller radius\r\ntwinsouls only: only affects twin souls perk up to 100 summons\\\\undead.\r\nritualstone only: affects the ritual stone power only, unlimited use tiny area so that you can target individual bodys.\r\n\r\n*USE ONLY 1 MAIN FILE\r\n\r\n\r\nBUGS: currently there is a bug involving some thralls to just dissapear, thsi is not from my mod but a bug in the main game of skyrim so there is nothing i can do to fix it. when you see that you have no undead following you but there are some active affects in your magic tab saying \\\"ritual stone effect\\\" or somthing similiar then you MUST get rid of this before unninstalling. there are currently two ways of doing this,\r\n1. transforming  into a werewolf gets rid of all active Affects I BELIEVE, im not entirely sure though.\r\n2. go to jail, commit any crime then go to jail and serve your sentance gets rid of all active affects such as these left over thralls.\r\nit is now safe to unninstall",
  "categoryId": "93",
  "version": "1.0.0",
  "author": "thebeast505",
  "createdUnix": "1371484801",
  "updatedUnix": "1373250957",
  "containsAdultContent": false,
  "uploadedBy": "thebeast505",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034644",
      "name": "Normal Version",
      "version": "BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Necromancer Conjuration Mod-37276-BETA.rar",
      "uploadedUnix": "1371481694",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/65991b3aa42e9c0cc07e230387614b861a4f44ae0a17f028d45a0d5a84da96c0/analysis/1407607338/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Necromancer%20Conjuration%20Mod-37276-BETA.rar?fid=1000034644&ttl=1535816867&ri=8192&rs=8192&setec=e893df934460f0589eb3f254ebb3e651"
    },
    {
      "fileId": "1000034646",
      "name": "Balanced 1",
      "version": "BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Necromancy - Conjuration Mod Balanced 1-37276-BETA.rar",
      "uploadedUnix": "1371483679",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/00c926d04593786e3b475b5d140fd410c974cf88327eb9c1bf4deca195bd8fc2/analysis/1407607395/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Necromancy%20-%20Conjuration%20Mod%20Balanced%201-37276-BETA.rar?fid=1000034646&ttl=1535816868&ri=8192&rs=8192&setec=6fa6377f66e57929772fe98f07d79825"
    },
    {
      "fileId": "1000034647",
      "name": "balanced 2",
      "version": "BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Necromancy - conjuration mod balanced 2-37276-BETA.rar",
      "uploadedUnix": "1371483729",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/044330221884bfcc46685c8ef71e34726c59c7912c95dfc56d427a9897aa630a/analysis/1407607395/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Necromancy%20-%20conjuration%20mod%20balanced%202-37276-BETA.rar?fid=1000034647&ttl=1535816868&ri=8192&rs=8192&setec=75622369e76e9b69b2c4c7be3be24dff"
    },
    {
      "fileId": "1000034650",
      "name": "Ritual Stone only",
      "version": "BETA",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Necromancy - conjuration Mod Ritual Stone only-37276-BETA.rar",
      "uploadedUnix": "1371484709",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/ac0122d7cff6ec320afd8e3cd208ba492079c75878535777b5144648326e5ca6/analysis/1407607397/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Necromancy%20-%20conjuration%20Mod%20Ritual%20Stone%20only-37276-BETA.rar?fid=1000034650&ttl=1535816869&ri=8192&rs=8192&setec=0fc82fa5a04a3e4f99693ea4d543151b"
    },
    {
      "fileId": "1000034651",
      "name": "twinsouls effect only",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "Necromancy - conjuration mod twinsouls effect only-37276-.rar",
      "uploadedUnix": "1371484778",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4080515c0923da994188d2ced13f1063cea3d3b510dd7d456e68511257e12ca3/analysis/1407607398/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Necromancy%20-%20conjuration%20mod%20twinsouls%20effect%20only-37276-.rar?fid=1000034651&ttl=1535816870&ri=8192&rs=8192&setec=01c1e3b9f9b97c08fecedc42b02720ee"
    },
    {
      "fileId": "1000037799",
      "name": "NEW version 1dot0dot0",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "NEW version 1dot0dot0-37276-1-0-0.rar",
      "uploadedUnix": "1373250957",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/4063de46edcdb68d0decb8702a537d909551546f911b412ad12910d756838984/analysis/1407634741/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NEW%20version%201dot0dot0-37276-1-0-0.rar?fid=1000037799&ttl=1535816870&ri=8192&rs=8192&setec=4e6df9e4c67bad8d09366188887b678c"
    }
  ]
}