{
  "modId": 37270.0,
  "modName": "Lakeview Lost Gardens",
  "summary": "Adds a stunning garden beneath the cellar of Lakeview Manor with many working planters.",
  "descriptionHtml": "[B][size=5]Description:[/size][/B]\r\nLakeview Lost Gardens is a mysterious little cave beneath the cellar of Lakeview Manor. It is my first mod and there may be a few mistakes here and there, but I fully tested everything in this mod and it works perfectly for me. There are several planters located around the area for you to plant whatever you want as well as bugs and a few fish. [b]*Hearthfire Required*[/b]\r\n\r\n[B][size=5]History/Discovery:[/size][/B]\r\nAfter building Lakeview Manor and hiring your housecarl (assuming you became thane of Falkreath), she soon discovered a crack in your cellar floor on one of her patrols. She had then asked for permission to fix it when you noticed that the crack appeared the be glowing. Intrigued, you examine the crack more closely and discover that there seems to be another room below the cellar. After enlarging the crack into a small hole, you can see the beauty that lies beneath. After making the hole big enough for you to fit through, you tie off a rope and shimmy on down into what will become a fascinating discovery. Before you there are glowing plants that thrive with life and have flourished underground. It\\'s obvious this cave is very old, but where did it first come from? Who created some of the ruins discovered throughout the small cave? Overtime, the a small room in front of the cave is built a long with a door and ladder to easily reach the Gardens.\r\n\r\nSo, right now this is just a small cavern with some glowing plants and planters, but I one day hope to make a small quest with more history and treasures to find.\r\n\r\n[B][size=5]Compatibility:[/size][/B]\r\nThis mod should be compatible with any other mod that alters Lakeview Manor, as long as it does not alter anything below the cellar. (Or if you have a mod that changes the cellar, I\\'d make sure nothing is moved in place over the door I added.)\r\n\r\n[B][size=5]Bugs/Problems:[/size][/B]\r\nIf you find any bugs or other issues please let me know and I will do my best to fix them. :)\r\nNote: A few of the planters overlap each other in one spot. I tried fixing them, separating them, and even moving them, but they always ended up overlapping. They still work, however.\r\nAlso, if the planters are not working for you, try waiting three days and loading the room back up.\r\n\r\n[size=5][U][B]Future Plans[/B][/U][/size]\r\n~Add a separate room containing Enchantment and Alchemy Table\r\n~Make a small quest tied to the gardens that contains the history\r\n\r\n\r\nOriginally I wasn\\'t going to upload this mod, but I found that it turned out better than I had thought it would have. So, I do hope some of you will enjoy this mod. :)\r\n\r\n[B]Thank Yous:[/B]\r\nI\\'d like to thank jecoil, Ac3s, and sa547 for the tips and info I had asked for. Your help was much appreciated.\r\n\r\n[B][size=5]Update Log:[/size][/B]\r\nV1.1 added. Fixed a spot in the water that had no floor. Somehow missed it originally.",
  "categoryId": "67",
  "version": "V1.1",
  "author": "FatalxSyn",
  "createdUnix": "1371412516",
  "updatedUnix": "1371438863",
  "containsAdultContent": false,
  "uploadedBy": "FatalxSyn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034522",
      "name": "Lakeview Lost Gardens",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "55",
      "fileName": "Lakeview Lost Gardens-37270-V1.rar",
      "uploadedUnix": "1371413715",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/4addbabd52d6d90c2117ec48764d9fe2050fac59c5e7e029718f5e31ffc0f288/analysis/1407606351/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20Lost%20Gardens-37270-V1.rar?fid=1000034522&ttl=1535816857&ri=8192&rs=8192&setec=34acc01f573285345ecc007b312bea2f"
    },
    {
      "fileId": "1000034565",
      "name": "Lakeview Lost Gardens",
      "version": "V1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "55",
      "fileName": "Lakeview Lost Gardens-37270-V1-1.rar",
      "uploadedUnix": "1371438863",
      "modVersion": "V1.1",
      "virusScanUrl": "https://www.virustotal.com/file/cd91ce01d1be05922f3997b28f1ecef276334f49698bc66265811616e708ace7/analysis/1407606783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20Lost%20Gardens-37270-V1-1.rar?fid=1000034565&ttl=1535816857&ri=8192&rs=8192&setec=a29571faabfed8da351d09656cdef35b"
    }
  ]
}