{
  "modId": 37282.0,
  "modName": "Sorry Camilla but Faendal is MINE - Marriage and Perks Mod",
  "summary": "Sure we always help the adorable shy Bosmer try to win Camilla over.  Why?  Free Archery training?  No&#33;  Um-well let&#39;s be honest its part of it BUT the bigger reason is we get him as a follower.  Now get him as a husband too. ",
  "descriptionHtml": "Sure we always help the adorable shy Bosmer win Camilla over.  Why?  Free Archery training?  No&#33;  Um-well let’s be honest its part of it BUT the bigger reason is he seems so much kinder and more useful as a follower than that smug Bard.  So... we help Faendal but then as he joins us on one adventure after another we find ourselves falling, hard-really hard for him.  \r<br />\r<br />“Oh if only he could forget all about Camilla&#33;”  \r<br />\r<br />Is it fair she becomes a marriage option after you get back the golden claw but not Faendal?  NO&#33;\r<br />\r<br />(Oh and don’t get me started on the whole no male Altmers and Bosmers available for marriage kick.  The voice acting is there&#33;  All lines of marriage dialogue are present for Faendal since he shares the same voice as Marcurio&#33; See Video&#33;)\r<br />\r<br />[center][b]So let us all say, “Sorry Camilla but Faendal is MINE&#33;”[/center]\r<br />\r<br />[size=+2]Requirements for Marriage:[/size][/b]\r<br />\r<br />1.  You still need to help Faendal eliminate Sven as a Rival.  Do this by either talking to Sven, taking his fake letter and telling the truth to Camilla or take Faendal’s and lie to Camilla.  \r<br />\r<br />2.  Once Faendal becomes your follower speak with Marmal in Riften about how marriage works in Skyrim.  \r<br />\r<br />3.  Buy the amulet of Mara from him (he usually sells it the cheapest when compared to other merchants) \r<br />\r<br />4.  Put it on talk with Faendal and he will gasp, “Is that an Amulet of Mara?” \r<br />\r<br />[center]*cue very happy squealing fan girls and boys*[/center]\r<br />\r<br />[b][size=+2]Recommendations:[/size][/b]\r<br />\r<br />It might be a good idea to get Honeyside in Riften first as a home.  Then as soon as the ceremony is over with run after Faendal and suggest you live there.\r<br />\r<br />Another thing is it might be a good idea to keep him as a follower.  The visit Camilla has been removed from his AI but when left home alone he might wander back to Riverwood to chill in his old little bachelor&#39;s house or do some work for Hod and Gerdur.\r<br />\r<br />Also…\r<br />Ultimate Follower Overhaul by by fLokii \r<br />Dovahkiin Relaxes Too by wgstein\r<br />Followers can Relax by King Coin\r<br />My Home Is Your Home - a mod for followers by Volek  \r<br />\r<br />[size=+2]Mods found in screen shots and video:[/size]\r<br />Straight hair retexture by navetsea \r<br />(I like this one because it doesn’t change the vanilla hair colors so much)\r<br />\r<br />Nights Watch Armor by trinkof\r<br />(Faendal&#39;s Groom Armor)\r<br />\r<br />Crimson Ranger Armor by patobek\r<br />Unenchanted Craftable Thieves Guild Armor by blyatzkrieg\r<br />Winter Is Coming - Cloaks by Nivea\r<br />(Faendal&#39;s Usual Gear)\r<br />\r<br />theRoadstrokers Royal Elven Set by theRoadstroker and Zoberraz\r<br />recolor - White and Grey Royal Elven Set by CrimsonFairy\r<br />(Armor for the Bride to be?)\r<br />\r<br />Better males - Beautiful nudes and faces - New hairstyles by Chris57 and FavoredSoul\r<br />(YoungerFaces & Geonox option) \r<br />\r<br />Coverwomen by mrLenski\r<br />(Look #1)\r<br />\r<br />AlexScorpions SnakeBows standalone version by AlexScorpion\r<br />(Best Bow EVER&#33;)\r<br />\r<br />Scout Armor by DoODABoOM\r<br />recolor - Scout Armor - Black Leather-Dark Green clothes by Gunvarian and doodaboom\r<br />(Quiver and Arrows)\r<br />\r<br />[b][size=+2]Bugs?[/size][/b]\r<br />Do you have Hearthfire?  See sticky in posts for the fix.  If anything this mod buffs him up to be a stronger end game follower.\r<br />\r<br />The only one I’ve encountered (Besides Hearthfire-again see sticky in posts) so far is when he’s following you he doesn&#39;t seem to keep shop like he says he will.  But the bright side is he will never try to sell you the Band of Matrimony.\r<br />\r<br />If you knock him down (hurt him pretty bad) he may stay that way and crawl about.  For how long?  No clue and didn&#39;t want to loose additional game play to find out.  This might be a vanilla bug as I remember watching a video on youtube about it ages ago.  I did a little bit of research and found out some followers just do this and to fix the problem you need to FUS them. (Force Shout but obviously not a good idea to do near a cliff unless you want to be widowed.)  If anyone who can confirm a better solution to this glitch please let me know.  Till then If this happens go back to a previous save.  I&#39;ve only had to do this once so far and a general good rule of thumb is to save often or perhaps wrap Faendal in bubble wrap er-I mean manly kick butt armor&#33;\r<br />\r<br />[b][size=+2]Enhancements?[/size][/b]\r<br />I did tweak a few of his stats so he can be your follower longer by increasing his health, magicka and stamina to 200 to start out with.  I also gave him the following perks to fit with his skills: Overdraw, Overdraw 20%, Agile Defender,  Agile Defender 20%, Stealth, Stealth 20%, Muffled Movement, Light Foot, Alteration Novice, Restoration Novice and Conjuration Novice.  He also comes with two spells (Healing and Oakfleash) with UFO you can give him more tomes to learn more.  \r<br />\r<br />You may want to use Alternate Actors by Iceburg to set up more perks points he has earned while leveling up by your side.\r<br />\r<br />I&#39;m up for more suggestions in this department if you feel something else will fit his character.  But in all honesty I&#39;ve never seen him as very magically inclined hence why I only gave him two practical spells for defense.\r<br />  \r<br />\r<br />[b][size=+2]FAQ:[/size]\r<br />\r<br />Why did you do this?[/b]\r<br />I wanted to make him as close to his vanilla looks as possible, be available for marriage and a bit stronger so he can be alongside of you till around end game play.  That and I really do love how he usually looks-even with that hair style.  \r<br />\r<br />[b]Why did you take him out of this and that faction?[/b]\r<br />Simple so you can have fewer complications with him being a follower/spouse.  The vanilla version of him sympathizes with the Thalmor and Imperials.  If you start a fight with them first he will probably leave your services, run off terrified or may even start attacking you.  As for what happens after you are married I really don’t care to find out but it just might involve an attempt to pelt you to death with arrows rather than file for divorce.\r<br />\r<br />[b]Wait&#33; I can commit crimes with him now?[/b]\r<br />Almost.  Everywhere except Riverwood.  Why?  He loves you&#33;  That&#39;s why&#33;  But... he loves Riverwood too.  He also will not attack Camilla.  *whistles innocently*  What? I was ah just curious to see if he would.  For experimental purposes purely, really so don&#39;t judge okay?\r<br />\r<br />[b]Can you make a pure vanilla version of him?  (No perks added or factions removed)[/b]\r<br />Upon request?  Sure.\r<br />\r<br />[b]Is he essential?[/b]\r<br />He should be.  However I&#39;ve come across that UFO marks all followers automatically essential and this mod could cancel this out.  If you have you UFO be sure to double check his status just in case.  (Also place this mod after UFO in your load order.)  To turn off  essential without UFO open with ~ key click on Faendal to bring up his ID number and enter the following:  setessential 0 \r<br />This should make him mortal.\r<br />\r<br />[b]Can you make him prettier?  His hair… His wrinkles… eeewww&#33;[/b]\r<br />*gasp* No&#33;  And I’ll save you the rant about society’s unhealthy obsession with youth and say simply: shoo&#33;  This is a Faendal mod and not Legolas from Lord of the Rings or Fenris from Dragon Age or any other pretty boy elf.  So I’ll say it again… SHOO&#33;\r<br />\r<br />[b]But you changed his eyes?[/b]\r<br />Only because they were glitched.  (Eye lashes were growing out of his eyeballs&#33; O.o Bethesda seriously wth&#33;)  So... to fix that I needed to pick another which were close as possible to the original look of his eyes.\r<br />\r<br />[b]Can you make him at lease have this _____ hair style, pretty please?[/b]\r<br />Okay fine... I’ll [i]consider[/i] it only if it’s any ApachiiSkyHair or Vanilla one.  (Consider only because I don’t want to put up dozens of variations of this mod.)  Will need a photo or link to the style you want.  Or if you have the NPC editor your welcome to edit it yourself.  \r<br />\r<br />For now a Witcher Hair option as seen in some of the screenshots is now available.\r<br />\r<br />[center][b]One more thing to keep in mind...[/b]\r<br />But this happens whenever you ruin Sven&#39;s chances and Faendal becomes your follower.  \r<br />Eventually the Dark Brotherhood may come after you and make at least one attempt on your life.  \r<br />So be prepared.[/center]\r<br />\r<br />[b][size=+2]Distribution Permissions:[/size][/b]  \r<br />Please do not upload this anywhere without my consent.  \r<br />For posting in other languages again please contact me [u]first[/u] so I may link you on my page. :)\r<br />\r<br />[center][b][size=+2]Lastly, a BIG thank you to...[/size]\r<br />Skyrim NPC Editor 0_75_1 by foretrenty\r<br />\r<br />Enjoy and please let me know of any issues. :) \r<br />If you like this please remember to endorse and send photos\r<br />(Photos of you being happy with him gives me warm fuzzies and encourages me to keep making more mods)[/center][/b]\r<br />\r<br />Version Log:\r<br />1.2 Added by request an alternative vanilla hairstyle (Same one as Brynjolf&#39;s)  The photo was taken a long time ago before I added Better Males and a few other mods to the game.  At first I actually did go with this hair style then later on switched back to his vanilla look. \r<br />1.1 Just added the Witcher hair option and made both files available for Mod Manager.\r<br />1.0 Premier release which required manual installation.",
  "categoryId": "79",
  "version": "1.2",
  "author": "CeaseSphire",
  "createdUnix": "1371444339",
  "updatedUnix": "1373146157",
  "containsAdultContent": false,
  "uploadedBy": "CeaseSphire",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034558",
      "name": "FaendalMarriageMod",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "249",
      "fileName": "FaendalMarriageMod-37282-1-0.zip",
      "uploadedUnix": "1371435102",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bd631a6faaf9ce7f8e6c669e6b4d693b7b4f777e3129b0503a0b197ff96f67c6/analysis/1407606664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FaendalMarriageMod-37282-1-0.zip?fid=1000034558&ttl=1535816880&ri=8192&rs=8192&setec=9de7ce951d1537befd5425f8056931ca"
    },
    {
      "fileId": "1000034648",
      "name": "Faendal with Vanilla Hair ",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "249",
      "fileName": "Faendal with Vanilla Hair -37282-1-1.zip",
      "uploadedUnix": "1371484110",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/89cb35b85f1704e4aa5e1ed90052294f90e59ef79f4d8952bf7fa95b3aa291f6/analysis/1407607396/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Faendal%20with%20Vanilla%20Hair%20-37282-1-1.zip?fid=1000034648&ttl=1535816881&ri=8192&rs=8192&setec=281e69660dde0196c1561ef94150ffed"
    },
    {
      "fileId": "1000034652",
      "name": "Faendal with Apachii Witcher Hair",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "638",
      "fileName": "Faendal with Apachii Witcher Hair-37282-1-0.zip",
      "uploadedUnix": "1371484827",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5691b2365996f861146284892bfc914cad4366bd556d537fbff8772dfebc60af/analysis/1407607399/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Faendal%20with%20Apachii%20Witcher%20Hair-37282-1-0.zip?fid=1000034652&ttl=1535816881&ri=8192&rs=8192&setec=b5151b2c7278c3a0cf11acda0d4d9504"
    },
    {
      "fileId": "1000037566",
      "name": "Faendal with Vanilla Hair Alternative",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "287",
      "fileName": "Faendal with Vanilla Hair Alternative-37282-1-0.zip",
      "uploadedUnix": "1373146157",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/84b450809104cb17724fce77136bfd15f961bed3b0daf894f217b7b511cdecf0/analysis/1407633408/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Faendal%20with%20Vanilla%20Hair%20Alternative-37282-1-0.zip?fid=1000037566&ttl=1535816882&ri=8192&rs=8192&setec=709a7ffc1754d62ff548996ab6b29b81"
    }
  ]
}