{
  "modId": 37287.0,
  "modName": "Eves Children II Storm Elf Race plus Storm Horses companions",
  "summary": "Shock-magic lore based Elven race for your PC with NPCs and Storm Horse companions, compatible with many texture mods.   ",
  "descriptionHtml": "The second Race of Eve\\'s Children, the Storm Elf is based on the race morph of High Elves, but with add-ons that deal with Shock-based spells. VERY cool Storm Atronach-like effects! \r\n\r\nThis Stand-alone mod requires no additional plug-ins or DLC. That having been said, they look great with the following plug-ins installed, which my sample screenshots had: \r\n\r\nApachii hairstyles (one of these female screenshots has Apachii Hair with the spiky do, another without; it is compatible with that plug-in), which can be found here: http://skyrim.nexusmods.com/mods/10168//? \r\n\r\nIn case you don\\'t want Apachii hair and want to try something different, another hairstyle mod that works with my Storm Elves is the Oblivion hairstyles for Skyrim by radioragae, shown here in a screenshot with mod 2 (blue swirly bun screenshot in Dragonsreach), which can be found for females here: http://skyrim.nexusmods.com/mods/18110//? \r\nand for males here: http://skyrim.nexusmods.com/mods/17993//? \r\nand one I haven\\'t tested yet but sounds good: http://skyrim.nexusmods.com/mods/22598//? \r\n\r\nMikoYork\\'s Beautiful Elves plug-in which can be found here: http://skyrim.nexusmods.com/mods/2929//? \r\n\r\nCaliente\\'s body mods for female textures, which can be found here: http://skyrim.nexusmods.com/mods/2666//? \r\n\r\nBetter Males for male body textures and faces, which can be found here: http://skyrim.nexusmods.com/mods/2488//? \r\n\r\nIf you get Amazing Follower Tweaks plug-in installed, you can collect five of them as followers and decimate giants without lifting your own finger in battle. Get AFT here: http://skyrim.nexusmods.com/mods/15524//? \r\n\r\nThey have been taken to the Dragonborn Solstheim world, where they kick a$$ and take names as PCs; haven\\'t taken them there as NPCs, but I\\'m sure they\\'d follow you just fine. \r\n\r\nWhat do they do, Eve? Well, they: \r\n\r\nCreate a PC out of eye, hair, brow or nose characteristics of all non-beast races, because who says you can\\'t have a blue-skinned human eyed orc-brow horned high elf earred dreadlocked purple haired character if you want one? This is fantasy, dammit. Go on with your bad rainbow self. \r\nCome outfitted in Psijic Monk robes, gloves and boots when you make them a follower \r\nHave shock resistance, 90% \r\nRun a little taller and leaner than the average citizen \r\nHave the Storm Atronach cloud/sparks effect, so they are easy to find when you are looking for them \r\nCast Sparks as well as a more powerful Storm Elf Sparks spell \r\nCast Stoneflesh or Fast Healing; they are also Essential so they do not die in combat and return to where you found them in the markets when dismissed \r\nAre Follower and Marriage capable, and level with you when you do \r\nAre Trainers of Destruction Magic by trade \r\nStart with 150 Magicka points \r\nCan summon Storm Atronachs when they get enough magicka base \r\nFight like storm atronachs in battle, casting Sparks or using their equipped Enchanted Glass Swords\r\n\r\nAs an added OP bonus, I have created and placed for your riding pleasure three swift invulnerable horses, found initially on the Riverwood Bridge waiting patiently for you, and all three willingly kick a$$ in battle for you as well, and they are easily found for those dark night escapades since they are either sparking, flaming or ghost-lit (because I am so sick of losing my ride when I\\'m in a big fat hurry to get the hell outta somewhere fast) and they are: \r\n\r\nWildFire, a lovely dappled Palomino who has a flame trail behind him \r\nStormCloud, a lovely dappled gray who is storming sparks like you \r\nSnowStorm, who is a black and white with a cool frosty-ghost lit appearance \r\n\r\nI placed 8 PCs within the world in the following locations, usually found browsing the marketplace: \r\n\r\nMichael Faraday and Sarah Faraday, in the Riften Market area \r\nAmber Tesla and Nikola Tesla, in the Solitude market \r\nMari Curie and Max Planck in the Whiterun Market area \r\nKyne Cirrus and Kyrie Cirrus in the Markarth marketplace \r\n\r\nKnown issues: \r\nIf you go into the showracemenu and change your current player character into a Storm Elf, the first time or two it MAY lag and CTD, but try again, it is a lot of info for your computer to digest at once; try try again. This also happens when you change from male to female etc or browse between races. Also, if you change your player character, you will often unfortunately set your accumulated skill stats to default. You will not lose your perks accumulated, but your stats will drop down to 15 or so. Best to change over those lower level characters if you want to try it out, otherwise you may cry. \r\n\r\nAnother thing you may encounter that is annoying in this mod (and many many others) is when the NPC characters have all greyish faces on top of colored flesh bodies. This can be remedied by going into the Creation kit tool (which is available under LIBRARY in the TOOLS menu of your Steam account). Double clicking on the name of the plug-in that you want to modify (In this case, eveschildrenstormelfrace.esp plus any other modification files you want to draw the information from, such as ApachiiHair.esp or whatever you want to use), hit Active File, then going into the actor files for that race (Storm Elf race), highlighting them all and then hitting Ctrl F4, which will import all their face files into your computer and saving them there. Wait a moment til the computer says &quot;done&quot;, then go up and hit the save file to save your changes. Exit out and when next you see them in your game, voila, they are as they should be. You can also tweak and modify your characters there as you see fit, for example if you also click on a hair mod (like Apachii or Oblivion hairstyles) you can change anything physically that you want to on the original character appearance. There are a number of youtube tutorials on how to do this step by step if you need a walkthrough. Go to youtube, search for &quot;skyrim creation kit modifying my NPC&quot; such as this one by Kolton Ramsey, \r\nthe Apachii hair wizard: http://www.youtube.com/watch?v=jewiFMDoH8M . \r\n",
  "categoryId": "34",
  "version": "1.0",
  "author": "EveGK",
  "createdUnix": "1371440958",
  "updatedUnix": "1371439827",
  "containsAdultContent": false,
  "uploadedBy": "EveGK",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034575",
      "name": "EvesChildrenStormElfRace",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54",
      "fileName": "EvesChildrenStormElfRace-37287-1-0.zip",
      "uploadedUnix": "1371439827",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0e41da8b0dbb332b39746e2a28da4ddd88f16eb70c0c26f9c162866e60d527cb/analysis/1407606783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EvesChildrenStormElfRace-37287-1-0.zip?fid=1000034575&ttl=1535816890&ri=8192&rs=8192&setec=c343038863ac28eed0a03d2006ee713f"
    }
  ]
}