{
  "modId": 37283.0,
  "modName": "Eves Children Ember Elf Race plus FireWolf Companions",
  "summary": "A Fire-lore based Elven race for your PC that includes FireWolf companions and NPCs ",
  "descriptionHtml": "If you always longed to leave a flame-atronach trail behind you as you run through Skyrim, this is your mod.  This race mod includes PC creation options, NPCs ready to follow or marry you (who doesn&#39;t want a FLAMING HOT SPOUSE, I ask you...), and I even threw in the family FireWolf companions to help conquer known evils out there (and pre-cook the food they kill for you, I wish...)  Yes, it is a little OP.  And if you didn&#39;t like that, you wouldn&#39;t be HERE, now would you?\r<br />\r<br />DONE FOR SKYRIM BASIC FILE, no other DLC needed&#33; \r<br />\r<br />If you&#39;ve ever wanted an Elven NPC that was Fire-lore friendly, try this one&#33; The mod is titled EvesChildrenEmberElfRace.esp if you&#39;re wondering what the plug-in is called when you subscribe to it. Go into your data menu when you load your game and make sure it is checked for it to work within your game. \r<br />\r<br />I wanted to create a character class that is focused on the element of fire...so, voila, the Ember Elf race.  Then I added FireWolf companions, because every Dragonborn needs a flaming wolf follower.  Yup.  Or four.\r<br />\r<br />This race is based on the skin of the dark elves, but with some additional attributes. I haven&#39;t tweaked a whole lot, but I added some features that just look...hot. Just look for these eight NPCs located near the forge area of several cities. Please keep in mind that they may not be at work at 2am like the DragonBorn, try looking for them around 10am if you&#39;re having trouble finding them. \r<br />\r<br />The atronach-esque flame trail should be their giveaway, I&#39;d think. I don&#39;t think it interferes with anything, other than making that snooty chick in Radiant Raiments get a little nervous in her shop full of fabrics. \r<br />\r<br />This is a player character race as well as just NPCs.  It works well with Apachii hair mods, or the Oblivion hair mods for males and females.  It will also allow you to give your PC Orc horns or Dremora hair and horns if you wish.  Or, if you want, a High Elf or Redguard with Orc brows and Dremora horns.  Go on with your badassery, because this is fantasy, dimmit.\r<br />\r<br />I have placed NPCs within the world for your in-game use. They each look different, although similar in some attributes. If you ask them nicely, they may also train you in some important skills, if you have the coin.  You can find these NPC brother/sister pairs at the following forges in Skyrim (all are potential followers and potentially marriageable): \r<br />\r<br />At the forge in Windhelm, Ars Vulcanum (male) and Valerya Vulcanum (female) \r<br />Near the outdoor forge in Markarth, Helena Pacificum (female) and Rainier Pacificum (male) \r<br />Near the forge in Solitude, Danaerys Vesuvium (female) and Morgan Vesuvium (male) \r<br />Near the Skyforge in Whiterun, Circe Napolitanum and Pompeii Napolitanum\r<br />\r<br />Now, lest you think, &#34;Geez, Eve, those look hideous&#33;&#34; Well, to give you an idea of how other mods can improve the look of your NPCs and character, take a look at Danaerys. She looks mahvelous with the Caliente CBBE mod, and kinda meh without it. The player character screenshot for female and male look weatherbeaten and meh as well, as does Ranier and Helena. I have several Basic vs modded Morgan shots for your comparison. I use the Apachii hair styles on them after they are created, so if you want them to look like the pictures, you will need the 1.5 Apachii hairstyle plug-in available from the Nexus mod, which is an awesome master file that every modder should have&#33; Thanks, Apachii&#33; Other mods I use include the Caliente CBBE mod for the ladies, and Better Males with Underwear/Slip edition for the gents. Morgan looks fabulous with this mod compared to without. If you would like some links to these great mods, I can link them here for you. \r<br />\r<br />These elves look stunning using the following mods:\r<br />MikoYork&#39;s Beautiful Elves (this one is just MEANT for these elves&#33;  Get it&#33;)\r<br />Caliente&#39;s CBBE mod\r<br />Better Males \r<br />Bella&#39;s Beautiful females\r<br />Apachii hairstyles\r<br />Oblivion hair for skyrim mods\r<br />Amazing Follower Tweaks lets you have 5 of them as Followers, or their FireWolves\r<br />\r<br />Credit for original inspiration was MontyX&#39;s original Frost Elf Race, OP as it is, it was fun to look at and tweak. I have also developed an elven race for the element of Air (shock type spell based) called the Storm Elf Race. Look for my next mod to be published soon.  That one contains cool storm horse companions that are happy to stomp the mud out of whatever decides to be hostile to you and yours. \r<br />\r<br />I promise there are no nekked bits in here, I have kids who play, too&#33; But, if you need to make them nekked, they are compatible with skin mesh mods like Better Males or CBBE or whatnot so you can enjoy them in exotic colored skin and flames.  Because this is fantasy, dimmit.\r<br />\r<br />Please comment if you have suggestions on improving this race, I aim to please.",
  "categoryId": "34",
  "version": "1.1",
  "author": "EveGK",
  "createdUnix": "1371438180",
  "updatedUnix": "1371669679",
  "containsAdultContent": false,
  "uploadedBy": "EveGK",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034560",
      "name": "EvesChildrenEmberElfRace",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58",
      "fileName": "EvesChildrenEmberElfRace-37283-1-0.zip",
      "uploadedUnix": "1371436296",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6af663ff7c6f0ea909462776a6280f0e1acb4c625a681d48e58296e5ef9baa41/analysis/1407606602/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EvesChildrenEmberElfRace-37283-1-0.zip?fid=1000034560&ttl=1535816883&ri=8192&rs=8192&setec=7929904456f9e7efb88f886ca3d3146f"
    },
    {
      "fileId": "1000034943",
      "name": "EvesChildrenEmberElfRace",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "60",
      "fileName": "EvesChildrenEmberElfRace-37283-1-1.zip",
      "uploadedUnix": "1371669679",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c185e4c1851081c7a41f55c3c4a0fcc74f53f5f7a6570e0a77293ec5cdc5dee8/analysis/1407609667/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EvesChildrenEmberElfRace-37283-1-1.zip?fid=1000034943&ttl=1535816884&ri=8192&rs=8192&setec=02c7ef896fe84bce7d6862e9d32038b2"
    }
  ]
}