{
  "modId": 37310.0,
  "modName": "The Wizards Grotto",
  "summary": "A wizard themed player house hidden in the mountains of the Rift.",
  "descriptionHtml": "AND THE LAWRD SAID LET THEIREI BE VIDYO - AND THUS IT WUZ SEW\r\n\r\nMuch thanks to Chayification for the feature!\r\n\r\n[youtube]ti9KNI5IUCQ?hl=en_US&version=3[/youtube][youtube]bjj57lat1vQ?version=3&hl=en_US[/youtube]\r\n\r\n===========================\r\nGOOD NEWWWWWWWS EVERYONE! IT ALL WORKS NOW!\r\n===========================\r\n\r\n\r\nBig Visuals - Small Space. (Do I sound like an Apple advert yet? Also: WHY WOULD YOU EVER BUY AN APPLE PRODUCT!? Seriously, but I digress.)\r\n\r\nThat was my design philosophy for the Wizard\\'s Grotto. I tried some other house mods but most of them just felt too large. I wanted something with a smaller, cozier feel, but that could also deliver that feeling of grandiosity. (That\\'s a word now.)\r\n\r\nFirst off, this mod does use Tribunal Robes By Zairam which you can and should download [url=\\\"http://skyrim.nexusmods.com/mods/20077//?\\\"]here[/url] because the guy is awesome, and his armor mod is awesome (and also because weirdness WILL ensue without the nifs from his mod. Seriously, it is REQUIRED. (unless you like armor that makes your body dissapear)). Indeed if you enter the Grotto at mid-high level and then load from a save (I know, lame, but it was the only method I could concoct atm, though I am currently planning a quest as an alternative) you may just find an extra special set...\r\n\r\nSince it was designed for pure mage characters, and it\\'s supposed to be a small hidden cave it lacks a forge/smelter worktable, but has all the other essentials including: Five wall mounted weapon racks, two display case dagger racks, three functional bookshelves holding up to a total of 88 books, and enchanting station, an alchemy crafting table, a mannequin, a tanning rack, various different types of containers such as chests wardrobes and safes, and most importantly SPELL ACTIVATED SECRET ENTRANCES!!! (Totally not a gimmick or anything)\r\n\r\nThe doors are opened by pointing the \\\"Aetherial Resonance\\\" spell at the nord book pedestal upon which the spell tome is found (for the front entrance) and the stone cairn nearest to the door (for the back entrance, also try and aim for the base of each, as the spell seems to be somewhat finnicky about where it hits the two activators.\r\n\r\nIn addition, as per request I have included a teleport spell which will return the player to the entrance chamber of the wizards grotto from anywhere in the game, I\\'ve added an image showing where to find the tome for it. The spell is called Aetherial Tether, is a two-handed spell and has a 10 second cast.\r\n\r\nAfter hours of hand meshing, everything is fully npc friendly (with one or two minor ticks but nothing that actually impacts gameplay)\r\n\r\nThe Grotto is located just northwest of Boulderfall Cave, and is not currently set to be visible on your map before traveling there.\r\n\r\nThe mod is still a work in progress of sorts as I had originally intended to include a quest chain with a couple voiced npcs ending a fully scripted perhaps-over-the-top-for-this-mod bossfight, but I\\'m also learning as I go so it could take a while... but at least the \\\"house\\\" is finished. In the interest of putting it out there I opted to simply place the tome for the spell that opens the grotto (Aetherial Resonance) right in the entrance, underneath a small letter from it\\'s original owner. Simply hit the pedestal/cairn (back entrance) with the spell and the door will open/close.\r\n\r\nEnjoy!",
  "categoryId": "67",
  "version": "1.0.3",
  "author": "WizardWhitenoise",
  "createdUnix": "1371507599",
  "updatedUnix": "1371599465",
  "containsAdultContent": false,
  "uploadedBy": "Soulfacade",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034819",
      "name": "The Wizards Grotto",
      "version": "1.0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "265",
      "fileName": "The Wizards Grotto-37310-1-0-3.rar",
      "uploadedUnix": "1371598719",
      "modVersion": "1.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/cddef2bf72c9bfb48910a54750a3a38b2fec67d95f1dafdc51034ecefa8c0c45/analysis/1407608585/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Wizards%20Grotto-37310-1-0-3.rar?fid=1000034819&ttl=1535816931&ri=8192&rs=8192&setec=59da9a2f48b1d84a98def01514b8c136"
    },
    {
      "fileId": "1000034822",
      "name": "The Wizards Grotto - No Tribunal Robes",
      "version": "1.0.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "265",
      "fileName": "The Wizards Grotto - No Tribunal Robes-37310-1-0-3.rar",
      "uploadedUnix": "1371599465",
      "modVersion": "1.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/f131b1f6299adc0497782261e028f995687272ccdb49fbe4e3d8eb7a3de252df/analysis/1407608643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Wizards%20Grotto%20-%20No%20Tribunal%20Robes-37310-1-0-3.rar?fid=1000034822&ttl=1535816932&ri=8192&rs=8192&setec=569a5e0b115439006ede4829713fc3a9"
    }
  ]
}