{
  "modId": 37355.0,
  "modName": "One Piece X - Haki Reborn",
  "summary": "This mod contains a couple of powers based upon the anime \\\"One Piece\\\". ",
  "descriptionHtml": "[youtube]tCSe2K6dRuw[/youtube]\r\n\r\nThis mod contains a couple of powers based upon the anime \\\"One Piece\\\".  Simply install with Nexus Mod Manager or drop into the Data folder. The spells are located within Ustengrav, which requires you to start some of the Greybeards\\' quests and locate the horn of Jurgen Windcaller.\r\n\r\nRead about the anime descriptions of these powers here: [url=http://onepiece.wikia.com/wiki/Haki]The One Piece Wiki[/url]\r\n\r\nBusoshoku Haki (Armament Haki) - While using Busoshoku, 90% of inconming damage is reduced, 70% of incoming magic damage is reduced, you take no fall damage, you are staggered 70% less, attack damage is increased by 30%, and you appear to be more Intimidating during speech interactions. Has a 50 point magicka upkeep, and all health and stamina regeneration is negated while active. (This is a spell toggle so you can switch it off and on whenever you wish)\r\n\r\nBusoshoku Enhance Weapon Haki - Hardens the weapon with Armament Haki. This guarantees stagger on enemies and ignores armor and magical resistances.\r\n\r\nKenbunshoku Haki (Observation Haki) - Allows the prediction of all incoming melee attacks. Has a 50 point Magicka upkeep. (Time automatically slows down for a brief time as enemies try to attack you, this is a spell toggle so you can switch it off and on whenever you wish )\r\n\r\nHaoshoku Haki (Conqueror\\'s Haki) - Has a cool down of 60 seconds. All enemies in the area that fail to resist are rendered unconscious for 300 seconds. Has no effect on targets higher level than self, dragons, and dwarven constructs. Drains all magicka on self and cannot shout again for 30 seconds. (Does not affect allies or those who are not hostile towards you)\r\n\r\nI plan to later add Devil fruits to my mod that function exactly like the fruits from the anime. Including the whole don\\'t touch the sea water thing, and their resistances and powers and such.\r\n",
  "categoryId": "75",
  "version": "1.0",
  "author": "Cielox00",
  "createdUnix": "1371606965",
  "updatedUnix": "1371599030",
  "containsAdultContent": false,
  "uploadedBy": "Cielox00",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034821",
      "name": "One Piece X v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "One Piece X v1-37355-1-0.zip",
      "uploadedUnix": "1371599030",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a1679de61e7a3eff0ea5b98af28be612d2a2a132e40457c7efb30649e8f84dc6/analysis/1407608641/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/One%20Piece%20X%20v1-37355-1-0.zip?fid=1000034821&ttl=1535816989&ri=8192&rs=8192&setec=961a11ebc65613651ff4cf2d158f5efc"
    }
  ]
}