{
  "modId": 37383.0,
  "modName": "Realistic Carry Weight and Item Value Economy Overhaul",
  "summary": "Changes the weight and item values of nearly all items.",
  "descriptionHtml": "SELLING IRON DAGGERS! ONLY 5 LBS! IRON SWORDS ONLY 11 LBS!\r\n\r\nWhat\\'s that? You want to give me a once in a lifetime offer to buy an item of legendary existence bestowed upon you by the daedric prince Azura herself? Meh, I\\'ll take it for 400 coins, no more than that.\r\n\r\n\r\n\r\n\r\nThis mod changes the weight and item values of nearly all items to realistic values.\r\n\r\nChanges can be seen https://docs.google.com/spreadsheet/ccc?key=0Ajw5xLXfCiC3dFB4RWVkeVh6ZnBDQXlDYWdaeUd1TXc#gid=0\r\n\r\nUses kryptopyr Armor & Weapon Fixes as base.\r\n\r\n[v1.0] 1104.19JUN2013\r\n===============================================================\r\nUses kryptopyr Armor & Weapon Fixes as base.\r\nAdds weights and values to all weapons, but staves.\r\nAdds weights and values to all armor and clothes but divine amulets, nonplayable clothes and armor, amulet of articulation.\r\nRenames several armor sets to match appearance (ie. gauntlets to bracers) and to allow better sorting (ie. forsworn garments of the old gods).\r\nAdds weights and values to all misc., soul gems.\r\n\r\nFeature creep: Quest weapons (ie. _____\\'s Sword) have been changed to match lore better.\r\n\r\nRoggi\\'s Ancestral Shield (Iron to Targe)\r\nQueen Freydis\\'s Sword (Steel to Nord Hero)**\r\nAll Wedding Bands (Gold Ring or Silver Ring to Gold Diamond Ring)\r\nNoster\\'s Helmet (Imperial Light Helmet to Imperial Helmet (Closed))\r\nRename Harrald\\'s Sword (Steel Sword to Harrald\\'s Steel Sword)\r\nAmren\\'s Family Sword (Iron Sword to Scimitar)*\r\nGhorbash\\'s Ancestral Axe (Iron Axe to Orcish Axe) (Cut from game)\r\nBalgruuf\\'s Greatsword (Iron Greatsword to Nord Hero Greatsword)\r\n\r\n*Amren is a Redguard, moved in from Cyrodiil. His father made money with the weapon to feed his entire family.\r\n** Oeungul War-Anvil specifically states that Queen Freydis had a legendary sword, in the old style. It has been changed to a Nord Hero Sword enchanted with x6 frost.\r\n\r\nTo Do:\r\n===============================================================\r\nDivine Amulets\r\nAmulet of Articulation\r\nAll Potions\r\nAll Books\r\n\r\n\r\nBooks are untouched because I am indecisive at the moment on how to weight them. Real books in the medieval era were expensive. The Bible would weigh in at 8lb, take 15 months to write, and cost around 670, absolutely unaffordable by the common man.\r\n\r\nPotions and their values are tied directly to raising their skill value and will not be touched.\r\n\r\nEnchanted gear are too numerous and would cause mod bloat, and will not be touched.\r\n\r\n\r\nCompatibility\r\n===============================================================\r\nNot compatible with any other item overhaul. Weapon and Armor Fixes by kryptopyr is included in this release, therefore is redundant and not compatible.\r\nThis should be placed high in the load order, preferably after Unofficial Skyrim Patches.",
  "categoryId": "79",
  "version": "1.0",
  "author": "Ossuarium",
  "createdUnix": "1371670835",
  "updatedUnix": "1371669457",
  "containsAdultContent": false,
  "uploadedBy": "Ossuarium",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034942",
      "name": "Realistic Carry Weight Value Overhaul MAIN",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "76",
      "fileName": "Realistic Carry Weight Value Overhaul MAIN-37383-1-0.7z",
      "uploadedUnix": "1371669457",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/23c9fbc25eb50dfea056c53b6c587adae364effd428cd58fdd8becbdec464dfd/analysis/1407609627/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Realistic%20Carry%20Weight%20Value%20Overhaul%20MAIN-37383-1-0.7z?fid=1000034942&ttl=1535817022&ri=8192&rs=8192&setec=9a345cc3ec268d323deaf1324cb4910a"
    }
  ]
}