{
  "modId": 37401.0,
  "modName": "WIP Society of Combat Archery",
  "summary": "A small preview offering a unique sword found in the upcoming Society of Combat Archery mod",
  "descriptionHtml": "[IMG]http://i1161.photobucket.com/albums/q515/Dfac364/SocietyArcher_zps2a80a81c.jpg[/IMG]\r\n\r\n\r\n\r\n[center][size=+2][color=red][b]This MOD [u]only[/u] contains a sword that is also found in the upcoming Full mod, this is intended as a WIP announcement for the full version[/b][/color][/size][/center]\r\n\r\n\r\n\r\n[center][size=+1][b]Why bother posting this WIP than?[/b][/size][/center]\r\n\r\n\r\n\r\n\r\n[center][size=+3][color=red][b]FOR HELP![/b][/color][/size][/center]\r\n[center][size=+1]Aside from trying to gauge interest, this is going to be a big mod and although Ive made a lot of progress on the full version I cant finish it alone.  So if you have any experience and are interested in helping in any way or even if you would just like to leave your two cents please post a comment or PM me anytime.[/size][/center]\r\n\r\n\r\n[center][size=+1][b]What kind of help do I need?[/b][/size][/center]\r\n[list][*][color=red][u]Advising[/u][/color]The focus of this mod is making you as the player, a better archer, so if you have any input towards this end let me know and it might just make it into the mod additionally i am also more than open to criticism regarding the sword in the preview\r\n[*][color=red][u]Voice Actors[/u][/color]I have already received some help in this area but their are still many characters both male and female that need voices\r\n[*][color=red][u]Quest Writing[/u][/color]I have over 500 hours in the creation kit and I know how to write a quest, but truth be told I\\'m pretty mediocre and a little help would be greatly appreciated\r\n[*][color=red][u]Scripting[/u][/color]I know basic level scripting and Ive already written a few for various archery training activities but a better script can only make it a better experience so if you can help, please do\r\n[*][color=red][u]Testers[/u][/color]As with any mod it needs to be tested and as always the more the merrier[/list]\r\n\r\n\r\n\r\n\r\n\r\n[center][size=+2][color=red][b]Finally the Mod Description[/b][/color][/size][/center]\r\n[center]This mod introduces a new Society of Combat Archery into Skyrim complete with an underground clubhouse. The idea is to actually train yourself as an archer as opposed to just paying a trainer and leveling up, because lets be honest..kinda boring. The quest will do this through a series of brief lectures on tactics and alchemy as well as several training rooms all of which will prepare you for a culminating test of membership. IF you succeed than you will be rewarded with membership as well as a unique bow made by [url=http://skyrim.nexusmods.com/mods/32405//?]Artisanix[/url], a unique sword, and a unique outfit.[/center]\r\n\r\n\r\n\r\n[center][size=+2][color=red][b]How to Use this Preview[/b][/color][/size][/center]\r\n[center]Because it wouldn\\'t be right to just post a WIP asking for help without first offering something I am making available a unique sword called a Gladium. It can be crafted at any forge and is found under the steel category, it matches the ebony sword in all categories except price[/center]\r\n\r\n\r\n\r\n[center][size=+2][b]Installation[/b][/size][/center]\r\n[center]Its easy! this mod doesn\\'t use any scripts and contains a bare minimum of data so their is no chance of conflicting or issues in general.[/center]\r\n[list][*]Download using either the NMM or manually, if you use NMM disregard the following \r\n[*]Unzip the file using the free software 7zip\r\n[*]Open the archive common/Skyrim and merge the provided \\\"data\\\" folder with the one found in your computer\r\n[*]That\\'s all! have fun[/list]\r\n\r\n",
  "categoryId": "28",
  "version": "1.0",
  "author": "dfac364",
  "createdUnix": "1371762582",
  "updatedUnix": "1371699826",
  "containsAdultContent": false,
  "uploadedBy": "dfac364",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034980",
      "name": "Society of Combat Archery Preview",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8800",
      "fileName": "Society of Combat Archery Preview-37401-1-0.7z",
      "uploadedUnix": "1371699826",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ad18443b1d7e519742579fd38e8bf0517cefd345bb03b347bc1f3c137556386a/analysis/1407610029/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Society%20of%20Combat%20Archery%20Preview-37401-1-0.7z?fid=1000034980&ttl=1535817051&ri=8192&rs=8192&setec=27d17b9f89c3bf16107ce7ad97ba31af"
    }
  ]
}