{
  "modId": 37405.0,
  "modName": "Physical Adept",
  "summary": "Physical Adept add a new perk tree and set of martial combat abilities to work with being unarmored and hand-to-hand combat.",
  "descriptionHtml": "Physical Adept aims to add an old skill set from older elder scrolls game into Skyrim. The hand-to-hand and unarmored Skills. Physical Adept\\'s use magic and natural abilities to enhance and modify their bodies capabilities beyond normal means without the aid of weapons or armor. This mod emulates the vanilla skill progression and applies it to unarmed combat in a method that uses no scripting. Allot of care was taken to ensure the damage output and armor rating is balanced for the skill level. Magic armor, light armor, and heavy armor will overwrite the unarmored rating while worn or in use, they do not stack. Hand-to-Hand damage does not stack with one-handed, two-handed or magic damage.\r\n\r\nAdditions\r\n1: New perk tree for the Physical Adept using the Alteration skill experience. This does not modify the vanilla Alteration perk tree. Simply uses the same skill to level the Physical Adepts potential.\r\n\\\"The School of Alteration involves the manipulation of the physical world and its natural properties. The Physical Adept uses the same knowledge to alter themselves.\\\"\r\n\r\n2: Perks gained for the Physical Adept add new abilities and spells focused on being unarmored and  hand-to-hand combat. \r\n\\\"The Physical Adept does not buy his knowledge of magic. It can not be learned from a book or a some ritual. Mastery of the body requires deep inner reflection and practice.\\\"\r\n\r\n3: Unarmed Damage and Unarmored damage resistance increases progressively biased on Alteration skill in a balanced method emulating vanilla skill progression and damage one would see in using armor, or weapons. \r\n\\\"The more one understands the alteration of self, the greater their natural potential.\\\"\r\n\r\n4: Spells added all give Alteration skill, and increase character values such as unarmed damage, running speed, Health bonus at the cost of stamina, cure disease as the cost of health, or give the Physical Adept a type of unarmed block. \r\n\\\"The Physical Adept focuses his understanding of magic inward. Some magic is beneficial others due to the strain on the body, pushing it beyond the mortal limits, come with a price.\\\"\r\n\r\n***Version: 0.2***\r\nThis is the Main file\r\n1: Spells updated to now show up under Alteration spell list when provided by perk.\r\nWay of the Fist Apprentice - Master, Adrenaline Boost, Body Control\r\n2: The \\\"Enhanced Speed\\\" Spell now cost the correct amount for its level.\r\n\r\nConflicts:\r\nWill not work with Mods that change clothing status into light or heavy armor. (unless you like being naked to get the unarmored bonus)\r\n\r\nWorks with:\r\nDoes not require any DLC\r\nMods for new or replaced Armor/clothing/cloaks and Weapons.\r\nNew hairs and body styles / including retextures and mesh\r\nDance of Death Mod\r\nConvenient Horses and Training animals\r\nBetter Magic\r\nAlternate Start\r\nFollowers (no NPC current or added will use this mod.. yet)\r\nExtra Music\r\nTropical Skyrim\r\n\r\nAuthor Note\r\nThis Mod is in a Play Test state.\r\nI expect this mod to have more spells and abilities that would fit the Physical Adept concept, but wanted to get it tested by characters at different levels perks and play styles.\r\nOriginally I was inspired to create a mod that focused on a play style for Mage that uses only clothing. The first mod simply changed clothing to have a slight armor rating but limitations to the game mechanics still left me wanting something better. Using magic and its whimsical array of perks and abilities the Physical Adept was born. I now get a progressive and balanced armor rating when using only clothing which feels more natural and does not modify the clothing. As the ability is a modified shield spell it worked well with the alteration school of magic that made sense. This did not feel to be enough for a Mod i should release so i dived a bit deeper and created a progressive unarmed damage system using the same knowledge for the unarmored ability. This proved to be quite a headache to get balanced as Unarmed Damage is not a skill and does not give XP. So by using spells to enhance the Physical Adept and supplement Unarmored and Hand-to-Hand combat, The character now gains Alteration skill who can focus on being a Physical Adept.",
  "categoryId": "77",
  "version": "0.4",
  "author": "WetWire",
  "createdUnix": "1371705257",
  "updatedUnix": "1374355205",
  "containsAdultContent": false,
  "uploadedBy": "wetwire",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000034990",
      "name": "Physical Adept 01",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "Physical Adept 01-37405-0-1.rar",
      "uploadedUnix": "1371703111",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/c8533917a7aebb83528ed0d1f9d60e833aa64100f9db003e7363e4f44cae31fa/analysis/1407610087/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Physical%20Adept%2001-37405-0-1.rar?fid=1000034990&ttl=1535817063&ri=8192&rs=8192&setec=222a933f361d5298ae583f5feb05960c"
    },
    {
      "fileId": "1000035097",
      "name": "Physical Adept 02",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "Physical Adept 02-37405-0-2.rar",
      "uploadedUnix": "1371780129",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/d067f29bc7c29a3bcd9da6bbe26c85f82b723c4200f6c58041133c496f7ed05e/analysis/1407610824/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Physical%20Adept%2002-37405-0-2.rar?fid=1000035097&ttl=1535817063&ri=8192&rs=8192&setec=210406c62f1be2dbcebb5a61e19cb794"
    },
    {
      "fileId": "1000038930",
      "name": "Physical Adept",
      "version": "0.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "Physical Adept-37405-0-3.rar",
      "uploadedUnix": "1373826709",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/11308d1d6600ed41a5f1c06767407aaee705c4e1be1404ba2de8ba6a0b8695f4/analysis/1407643787/",
      "changelogHtml": " Fixed first person issue\r<br />~ Reported issue after casting that disabled hand-to-hand combat while in first person. Punching would become unresponsive.\r<br />* Resolution: Removed animation to grab summoned weapon. Character no longer will attempt to run animation to grab a summoned weapon in first and third person.\r<br />\r<br />Removed Sparkles\r<br />~ Request to remove the blue hit shader\r<br />* Resolution: Blue on hit shader removed. character will no longer sparkle when damaged while not using armor.\r<br />\r<br />Unarmed Damage stacking\r<br />~ Issue with Way of the Fist spell stacking with other versions of itself.\r<br />* Resolution: Added keywords to dispell magical spells with the same effect. Now no longer able to stack novice way of the fist with apprentice. Had to remove the Stamina bonus built into Way of the Fist spells for this to work correctly\r<br />\r<br />Known Issues\r<br />~ Way of the Fist spell runs on a 60 second or 2 min timer. Recasting the spell without sheathing or letting the the prior effect elaps, will replace the bonus to unarmed damage but not the duration. After the first cast expires the character will auto sheath and return to last known equiped status but still have an active bonus running to unarmed damage.\r<br />* Temp work around. Sheath the characters fist will force end the spell. then you can recast way of the fist and the duration will react correctly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Physical%20Adept-37405-0-3.rar?fid=1000038930&ttl=1535817063&ri=8192&rs=8192&setec=de028974cff1244b6afe8a08fd22a329"
    },
    {
      "fileId": "1000039856",
      "name": "Physical Adept",
      "version": "0.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Physical Adept-37405-0-4.rar",
      "uploadedUnix": "1374355205",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/47bb3ce2b0c8ff2bfc271f295dc1f54fd6f0b04972863fbfa52686705ba2a4dd/analysis/1407650890/",
      "changelogHtml": " Update: Jul 20, 2013\r<br />Fixed Perks\r<br />~ Reported issue with perks not providing correct abilities. Missing some higher teir way of the fist combat spells.\r<br />* Resolution: Added correct spells for each perk and updated perk description to reflect correctly.\r<br />\r<br />Known Issue\r<br />~ Werewolf perk from dawnguard CTD while mod enabled.\r<br />* Still need a werewolf character to figure out why this would happen. \r<br />Will load dawnguard into creation kit along with Physical Adept to see what needs changed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Physical%20Adept-37405-0-4.rar?fid=1000039856&ttl=1535817064&ri=8192&rs=8192&setec=5552f25478978b2cec5adb86e9d35f8d"
    }
  ]
}