{
  "modId": 37419.0,
  "modName": "eerie elegance",
  "summary": "Castle Volkihar Redecorated Master bedroom, courtyard, library, valericas room, valericas study, chalice Room.",
  "descriptionHtml": "Dawnguard DLC needed, this mod is stand alone besides that.\r<br />\r<br />i like Castle Volkihar and so i live there..  however.. \r<br />some things about it looked really bad to me so i changed them more to my liking.\r<br />ive seen others mod for the castle, however they make it look bright, clean and neat.. \r<br />which is fine i guess, i however like the eerie ruin castle look.\r<br />what i did was try to make it very classic vampiric castle themed.\r<br />i gave the master bedroom some class and elegance with new meshes and just changing the overall flow of the room.\r<br />i also made it look like someone is living there even if its someone whom is undead.. rather then the hollow feeling it had before.\r<br />i also upgraded the courtyard. all i did was try to make it look more full and creepy as it too felt hollow to me.\r<br />i added more grave markers, fog, bushes and trees. i didnt like the fact the valerica cleans up the place.. so i undid all she did besides her garden.\r<br />when i updated next, i changed the lab/library around, trying again to make it the castle look classy yet very old and pretty dark.\r<br />i read it was a lab not a library and i never like to add what isnt meant to be there nor take away what made the room w/e what it was\r<br />so though it is a library now i kept the crafting tables and also made it look like some research and experiments are transpiring there..\r<br />however im not yet happy with the lab so i will likely come back to it.\r<br />i also added a few fitting static around the keep and yard. \r<br />\r<br />new- i added some new items to valericas room, valericas study and the chalice Room.\r<br />i wanted the chalice room to look more like a lounge or councle room. \r<br />as for valericas bedroom i only added a few items to make it look like serana was raised there.\r<br />and her study? i just tryed to make it look more full.\r<br />i also fixed her balcony door to the main castle, however its locked and the key to it is in her study.\r<br />there is also a jamed gate blocking your way which can be removed with the rumble blocking the courtyard door.\r<br />\r<br />i might add or change somethings to peoples likings if anyone would ask, i wont however place every crafting resource in one single spot.\r<br />i dont like having every crafting resource in one room. why? because if i did it would take away the need for the rest of the castle.\r<br />\r<br />\r<br />future?\r<br />i want attach the castle together, like each pathway linked to the right castle zone.\r<br />and i also might change that empty tower room to something more.. useful and fitting which will give us a reason to go in the yard.\r<br />and some other rooms will lightly be changed..\r<br />\r<br />\r<br />safety:\r<br />this mod removes the weapon rack by the coffin and the foot chest under the table in the study that you likely didnt know was there.\r<br />i also deleted just about everything in the chalice room.\r<br />therefor dont place any of your items in there before installing this. and if you have things in there take them out before you turn this on.\r<br />or they will be deleted along with the storage or maybe the storage will stay there out of place? im not sure but dont try.\r<br />nothing else should be wrong, unless you wanted the trash items that where in the room by default?\r<br />and if you un-stall this mod dont leave your stuff in the cupboards, bookcases or coffins.. as they will get deleted.\r<br />\r<br />the only bug i see is that i saved while an npc was on a marker i moved, so once i added the new update my game crashed when he tryed to move.\r<br />to not run into this problem just skip sometime and all should be fine.\r<br />\r<br />\r<br />Credits\r<br />oaristys - Modders Resource Pack: i used the crystal ball and ebony raven.\r<br />Stroti - Organ Resource: i used the organ and the organ bench.\r<br />stroti - caste furniture resource: i used the bed, however i plan to use more.\r<br />runspect - Resources for modders: i used both dress forms, big and small birdcages, the screen, hand mirror and brush, gothic dresser, angel statue, vanity, violin, ivy and flasks, chaises, golden coffe table, globe, urn, geode, spy glass, calla plant, telescope, harp, shells and starfish, classy chairs and love seat, rocking horse, female elf doll, teddy bear, dragon toy, chinese tea pot? and likely other stuff i forgot about of just havent placed in yet.\r<br />hxp - vampire hunter set: i used both stake weapons.\r<br />grimoa - Grimoas Picture Frame - A Resource for Interior Decorators: i used the oval one\r<br />Breti - New Buildings Modder&#39;s Resources: i used the static knight armor statue\r<br />Artisanix - Paintings and Frames: i believe i used paintingmc0202 though i changed the pic to my own.\r<br />Blary - Alchemy Clutter Resource: i used all items\r<br />Blary - Ingredients Wall Art Resource: i used all items\r<br />\r<br />\r<br />most are resources so that should be no problem and i got the okay from hxp for using his vampire hunter weapons.\r<br />i dont think ive used anything from any other mods besides those, \r<br />other clutter and such should be from the game it self unless im mistaken.",
  "categoryId": "67",
  "version": "",
  "author": "JackalX137",
  "createdUnix": "1371757317",
  "updatedUnix": "1377525641",
  "containsAdultContent": true,
  "uploadedBy": "jackalx137",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035058",
      "name": "eerie elegance",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20924",
      "fileName": "eerie elegance-37419-1.zip",
      "uploadedUnix": "1371756985",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/af27e06c91e175f93cf7ccdae8edda6bb0c09a07660ff9dcd7e285285b45d482/analysis/1407610572/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/eerie%20elegance-37419-1.zip?fid=1000035058&ttl=1535817087&ri=8192&rs=8192&setec=fd63d4d93c335ac7459eea000bb874c0"
    },
    {
      "fileId": "1000036097",
      "name": "eerie elegance update 1 - esp only",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "81",
      "fileName": "eerie elegance update 1 - esp only-37419-.zip",
      "uploadedUnix": "1372367568",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7df248ca02c36642dc1a22d41bafce916c355121f449a1c9f95632c2e23e94de/analysis/1407619562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/eerie%20elegance%20update%201%20-%20esp%20only-37419-.zip?fid=1000036097&ttl=1535817088&ri=8192&rs=8192&setec=96ae9029b90fd3c0eda274f90c2b9e29"
    },
    {
      "fileId": "1000036414",
      "name": "eerie elegance update 2",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6191",
      "fileName": "eerie elegance update 2-37419-.zip",
      "uploadedUnix": "1372517649",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/df1a3eaca5a12e49c5b92155988792fc12b3e629442e79766cb8fc93bd80effc/analysis/1407621912/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/eerie%20elegance%20update%202-37419-.zip?fid=1000036414&ttl=1535817089&ri=8192&rs=8192&setec=48cf000305589e239df0efac88a498ae"
    },
    {
      "fileId": "1000049366",
      "name": "eerie elegance",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "55836",
      "fileName": "eerie elegance-37419-.zip",
      "uploadedUnix": "1377398276",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/bff0b5052174ebabb3e07ee0c97379a627ce6d850f707e4f0f626f60fc9b8047/analysis/1407695780/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/eerie%20elegance-37419-.zip?fid=1000049366&ttl=1535817089&ri=8192&rs=8192&setec=d586d82fe07507d79c026ba32b81339a"
    },
    {
      "fileId": "1000049709",
      "name": "new update 1",
      "version": "",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "3148",
      "fileName": "new update 1-37419-.zip",
      "uploadedUnix": "1377525641",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d4f69fe282e4746a5ffc0ae4eee30ab337d8e4afba9a382e263b0302d16547da/analysis/1407697340/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/new%20update%201-37419-.zip?fid=1000049709&ttl=1535817089&ri=8192&rs=8192&setec=829d4188f7573e1a0bf29dd2004a2e7c"
    }
  ]
}