{
  "modId": 37416.0,
  "modName": "Visual Improvement for Absorb Effect Darkness",
  "summary": "Prevents the Absorb Health, Absorb Stamina, and Absorb Magicka weapon enchantments from applying a darkening/blurring during absorption.  The same thing was done for Dragonborn DLC weapons.  Word Wall visual effects have been brightened so the screen doesn\\'t turn black when you learn a new Word of Power (optional file).",
  "descriptionHtml": "[center][i] If you enjoy my work, please consider taking a moment to endorse. Thank you. [/i][/center]\r\n\r\n[size=4][color=#FF0000]UPDATE:[/color] Word Wall absorbing effect fix!! [/size]\r\nI have just uploaded an [b]optional file[/b] that will brighten the visual effect modifier that is applied in-game when you approach a word wall to learn/absorb a new Word of Power. I adjusted some of the settings in the effect record to try and lighten/brighten it up a little bit so it doesn\\'t get so dark and contrasty when you approach a word wall.  This is a test version, so please let me know if i should make it brighter or darker or whatever you think is best. This was done by request so let me know if this is acceptable. Once I decide on a \\'final\\' version, I can integrate the appropriate fixes/changes into the main file. \r\nI tried to remove the effect altogether, but have not had any luck so far.  The game handles this situation a little differently than it does for the absorb enchantment effects, so I will continue to look for a way to remove the effects if someone still wants that. However I have had some great results with brightening the effect. Some people still might find the effect to be too dark. If you want a lighter/brighter version, let me know and I will make one for you.\r\n\r\n\r\n[center][size=4] [[[[[          BACKGROUND          ]]]]] [/size][/center]\r\n\r\nIn skyrim, all [b]*enchantments*[/b] have associated [b]*magic effects*[/b].  Sometimes, these [b]*magic effects*[/b]  will have visual effects associated with them, so that when you use the enchanted weapon, some cool-looking magical visuals will be displayed so that you, the player, know your enemy just got pwned with hardcore magic skills,... and because it looks cool.  The game can accomplish these effects using various different techniques (that are beyond the scope of this description), one of which being an [b]*imagespace modifier*[/b], which as you might have guessed, modifies the imagespace.  An imagespace is a particular set of instructions that tells the game how to display effects for a given cell or worldspace. This includes things such as blur, coloring, brightness, and bloom.  So, in summary, the imagespace basically makes the game look the way it does.  \r\n\r\nWell, when the game registers that you have hit someone with a weapon enchanted with \\\"absorb ___\\\", it applies a modifier to the [b]*imagespace*[/b] that (yep, you guessed it) changes the way things look visually.  As it turns out, the [b]*imagespace modifier*[/b] that bethesda chose to use in this case applies a darkening/blurring effect (blurring effect only noticeable with proper lighting or during the day) that makes everything on the screen get significantly darker than it was before you used the weapon.  This is all fine and dandy during the day (even though i still find it annoying during the day), it is bad news at night time when it\\'s already pretty dark out (or when you\\'re in a dark interior or dungeon).  This problem is expecially noticeable if you;re using any type of weather/lighting mod that makes your nights/dungeons darker than vanilla (ENB, RLO, ELFX, etc). \r\n\r\n\r\n[center][size=4] [[[[[          What it DOES          ]]]]] [/size][/center]\r\n\r\nWhat this mod does is it simply removes the [b]*imagespace modifier*[/b] from being applied when striking someone with an Absorb Health, Absorb Stamina, and/or Absorb Magicka enchanted weapon. This prevents the dark abyss from being unleashed on the dragonborn when he/she is right in the thick of it. It so happens that the same modifier is supposed to add blurring as well, which doesn\\'t really bother me, but nonetheless it is also removed.\r\n\r\n\r\n[center][size=4] [[[[[          What it DOESN\\'T          ]]]]] [/size][/center]\r\n\r\nWhat this mod doesn\\'t do is remove the other visual effects that are applied, such as the fancy blue/green/red swirls that fly towards you from the affected enemy. These colorful effects are still there, while the current level of brightness and all other visual properties remain the same.\r\n\r\n\r\n[center][size=4] [[[[[          INSTALLATION          ]]]]] [/size][/center]\r\n\r\nStep 1: \r\nChoose which version you want. \r\n - Currently there are three versions to choose fro No DLC, No DLC - all visual absorb effects removed), or Dragonborn DLC (which applies the fix to several DB weapons).\r\n\r\nStep 2:\r\nVery simple. Drop the ESP into [b][i]skyrim/data/ [/i][/b] and then activate the ESP with your mod manager of choice\r\n\r\n[center][size=4] [[[[[          (IN)COMPATIBILITIES          ]]]]] [/size][/center]\r\n\r\nThis mod will be incompatible with any mods that alter the Absorb Health, Absorb Stamina, and/or Absorb Magicka [b]*magic effects*[/b] \r\nMods that alter Absorb Health, Absorb Stamina, and/or Absorb Magicka [b]*enchantments*[/b] should be 100% compatible. There may be some magic mods that conflict with this. \r\n- So, If anyone does find this to be true, please let me know and I should be able to make you a compatibility patch pretty easily.\r\n\r\n\r\n[center][size=4] [[[[[          FUTURE          ]]]]] [/size][/center]\r\n\r\nI am fairly confident there are other versions of the Health/Magicka/Stamina (HMS) absorb enchantments that are less commonly used and/or added by the DLCs. I plan to look for these and others and, when found, I will edit those too.\r\n- Thus, if anyone knows of a specific enchantment that is still giving you the same nasty darkening effect, please let me know ASAP so I can update the file.\r\n\r\n[color=#FF0000] UPDATE: It looks like all weapons and enchantments from Dawnguard (such as Harkon\\'s Sword) are using the vanilla effects. Thus, no additional fixing or modding needs to be done for them.  Dragonborn DLC has two weapons in it that use special absorb enchantments that use their own unique effects, namely Miraak\\'s Sword and a unique Bow.  I have released a new separate version of the mod that fixes the the darkness effect that these weapons produce.  If you don\\'t have Dragonborn DLC then this of course is not necessary for you to use. [/color]\r\n\r\nThis darkening effect may be seen in some spells, I\\'m not very sure yet. I plan to look into this further. \r\n- Again, if anyone knows of a spell that applies the same nasty darkening effect, please let me know ASAP so I can update the file or create an addon.\r\n\r\n[color=#FF0000] UPDATE: After a bit of research, it seems there a re quite a few spells that use this effect in nearly the exact same way as the enchantment does. I have no problem making an add-on module that will take care of all of the spells in the game, as well as the spells in the official DLCs (Dawnguard uses the effect quite heavily).  However, I do not want to spend a lot of time creating a new module if nobody is really interested in using it. If I receive some feedback or get anyone specifically interested in using this same fix on the spells, I will have no problem creating the add-on. Just let me know in the posts section or send me a private message.[/color]",
  "categoryId": "62",
  "version": "1.1",
  "author": "michaelrw",
  "createdUnix": "1371738032",
  "updatedUnix": "1373950311",
  "containsAdultContent": false,
  "uploadedBy": "michaelrw",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035032",
      "name": "Visual Improvement For Absorb Enchantments v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Visual Improvement For Absorb Enchantments v1_0-37416-1-0.7z",
      "uploadedUnix": "1371742827",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/df8adaf1b501eef0a5a3fb5aafa20e38ea889fdd21d431294ea5e147bfd80038/analysis/1407610449/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Visual%20Improvement%20For%20Absorb%20Enchantments%20v1_0-37416-1-0.7z?fid=1000035032&ttl=1535817081&ri=8192&rs=8192&setec=27d373b4770efb3fc2dcd7b7ca47fb2c"
    },
    {
      "fileId": "1000035034",
      "name": "Visual Improvement For Absorb Enchantments v1_0 - All Effects Removed",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Visual Improvement For Absorb Enchantments v1_0 - All Effects Removed-37416-1-0.7z",
      "uploadedUnix": "1371745136",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/88cdb2a4f41efca10255ef422c84bfee7b9bf8e167b461a7a7de0c8cc116761e/analysis/1407610473/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Visual%20Improvement%20For%20Absorb%20Enchantments%20v1_0%20-%20All%20Effects%20Removed-37416-1-0.7z?fid=1000035034&ttl=1535817082&ri=8192&rs=8192&setec=5905c77e3b9c1e56f89c0323f7dfcf15"
    },
    {
      "fileId": "1000036155",
      "name": "Visual Improvement For Absorb Enchantments v1_1 Dragonborn",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Visual Improvement For Absorb Enchantments v1_1 Dragonborn-37416-1-1.7z",
      "uploadedUnix": "1372399644",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/18239bac13ca39fd57675942b7e4f5e9ea4aea56e13f305cd09a8fe41ea0accd/analysis/1407620129/",
      "changelogHtml": " Removed darkening effects that take place when using Miraak&#39;s Sword, a unique weapon from the Dragonborn DLC.  <br/> \n Removed darkening effects from Dwarven Black Bow of Fate, another unique weapon from the Dragonborn DLC.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Visual%20Improvement%20For%20Absorb%20Enchantments%20v1_1%20Dragonborn-37416-1-1.7z?fid=1000036155&ttl=1535817082&ri=8192&rs=8192&setec=5bc611681def573b2070bd5ccc1a6614"
    },
    {
      "fileId": "1000039153",
      "name": "Word Wall Darkness Fix - Lighter and Brighter",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Word Wall Darkness Fix - Lightened Effect-37416-1-1.7z",
      "uploadedUnix": "1373950311",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/511b97fc2d16de9e24fd32136248a0b3a0b666f321665a82ef1a382f38f0533f/analysis/1407645718/",
      "changelogHtml": " Removed darkening effects that take place when using Miraak&#39;s Sword, a unique weapon from the Dragonborn DLC.  <br/> \n Removed darkening effects from Dwarven Black Bow of Fate, another unique weapon from the Dragonborn DLC.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Word%20Wall%20Darkness%20Fix%20-%20Lightened%20Effect-37416-1-1.7z?fid=1000039153&ttl=1535817083&ri=8192&rs=8192&setec=89d1cd38807d155f505c02f05f894fbc"
    }
  ]
}