{
  "modId": 37421.0,
  "modName": "The Mid World",
  "summary": "The Mid World requires Dawnguard to be played. This is a whole new world space for the player to enter and explore. It is still a large work in progress. Anyone who enjoys the area that I have created and knows about creation kit or quest scripting please message me if you have any ideas or would like to be a part of it. Please read the full descri",
  "descriptionHtml": "Mid world contains two main areas so far; The snowy vampire and werewolf battle ground which includes a vampire pyramid which is the closest to being done. The werewolf army camp is not done yet and really just includes basic landscape and the foot soldiers. They will not attack you unless attacked first. I am still working on creating the quest line for this, if anyone playing this has experience quest scripting and wants to be a part of this just message me I would be very relieved to have someone who actually understands how to make a decent quest.The other area is the Trawallani Village, this is an area for buying/selling goods and storing your own items in a player home located on the ship in the village. This village will also have a quest line associated with it to acquire the player home but for now you can just go in and use it.\r\n\r\nThe Goal!\r\nMy goal for this mod is to create an area where a higher level character can be challenged and rewarded highly for that. Anyone who has creation kit experience or scripting experience and wants to be a part of this world I have no problem working with others and sharing in the credit for it. Some areas that I would like to create are an area that will essentially be a volcanic plains area where dragons fly by the hordes and the player will rarely find himself/herself fighting just one. As well as new spells, enchantments, and weapons and enemies who drop more rare loot. \r\n\r\nTo get there:\r\nGo to Riverwood and take the road north that leads to Whiterun, on the way you will notice a shrine of Nocturnal on the left hand side of the road, click it and you have entered the Mid World! If this does not work then just \\\"coc testpyramidinterior02\\\" or \\\"01\\\" this should take you to the inside of the vampire pyramid where you can exit right where you spawn to enter the world or continue through the pyramid. ",
  "categoryId": "30",
  "version": "0.1",
  "author": "theSandanimal",
  "createdUnix": "1371757731",
  "updatedUnix": "1371757718",
  "containsAdultContent": false,
  "uploadedBy": "theSandanimal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035059",
      "name": "The Mid World",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "324",
      "fileName": "The Mid World-37421-0-1.zip",
      "uploadedUnix": "1371757718",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/88b5a813c18943c69f133e8f73f5f42ef20cbc0afa676b36d4adfcc30e076abd/analysis/1407610573/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Mid%20World-37421-0-1.zip?fid=1000035059&ttl=1535817091&ri=8192&rs=8192&setec=b70be96feb47234b3e49c22cc8e8cd0e"
    }
  ]
}