{
  "modId": 37466.0,
  "modName": "Ladle of Ludicrousity",
  "summary": "Overpowered, annoying, stupid...but oh so much fun.",
  "descriptionHtml": "~Ladle of Ludicrousity~ (v0.1)\r<br />\r<br />[color=red]-&#33;- Attention. Support for this mod had ended. I am coming out of my hiatus from posting mods, and have decided to \r<br />consolidate my efforts for my new releases. Thanks to everyone&#39;s kind words and desire to see this go far. -&#33;-[/color]\r<br />\r<br />Why?\r<br />--------\r<br />And why the hell not? This sucker boasts instakill status, with a reach 200 times that of your standard Skyrim sword, and insults your enemies to boot&#33; Imagine taking out a dragon as it circles a mountainpeak high above you, the Ladle throwing skeever butt insults all the while you mash the attack button. What&#39;s not to love?\r<br />\r<br />Compatability\r<br />----------------\r<br />It&#39;s all standalone, so it shouldn&#39;t mess with mods you have running. The only possible way it could go wonky is if you have mods that screw with the Western Watchtower near Whiterun. You know, the one you slay your first dragon at in the main quest. I&#39;d recommend not being in the same cell as the Watchtower before loading the mod up, get a good distance away first.\r<br />\r<br />Installation\r<br />----------------\r<br />Simple, easy, clean. Just drop the contents of the compressed file (the .bsa, .bsl and .esp files) into Skyrim&#39;s data folder, minus this readme of course. To uninstall, simply remove the same files.\r<br />\r<br />Extra Crap\r<br />-------------\r<br />A) This mod is meant to be a joke, don&#39;t take it seriously.\r<br />\r<br />B) I really have no intention of supporting it, save for possibly doing up a better texture and a version with a small ladle. But I will always take enduser feedback into account, so say something. I may like it and add your idea.\r<br />\r<br />C) The default mesh and texture are ripped right from the game, so credit to Bethesda I guess, and a small portion to myself for assembly *shrug*.\r<br />\r<br />\r<br />Enjoy the spoils all you skeever butts,\r<br />-arecaidianfox",
  "categoryId": "55",
  "version": "0.1",
  "author": "arecaidianfox",
  "createdUnix": "1371858534",
  "updatedUnix": "1371858530",
  "containsAdultContent": false,
  "uploadedBy": "arecaidianfox",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035219",
      "name": "Ladle of Ludicrousity 0-1",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "51",
      "fileName": "Ladle of Ludicrousity 0-1-37466-0-1.rar",
      "uploadedUnix": "1371858530",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/9193a20163049cc7be84db3beacd4e5a828fb2f21bc31d0d499748279ade3af8/analysis/1407612068/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ladle%20of%20Ludicrousity%200-1-37466-0-1.rar?fid=1000035219&ttl=1535817172&ri=8192&rs=8192&setec=457994cb2eae4752f77b629b1e69827e"
    }
  ]
}