{
  "modId": 37483.0,
  "modName": "Silmeri - The Froststorm Blade",
  "summary": "New from yours truly, the counterpart of the Infinity Sword is here&#33; Silmeri is a frost AND shock sword that will seriously ruin the days of anyone who thinks it&#39;s smart to try and pick a fight with the Dragonborn. ",
  "descriptionHtml": "&#34;There are a few sources that speak of Alduin&#39;s Tongue, or the Infinity Sword as it is more commonly known. But if these sources are rare, the sources for this sword are rarer still. I do not speak of the Infinity Sword, but its foil, the svelte icy blade known by only one name:&#34;\r<br />\r<br />[center][img]https://staticdelivery.nexusmods.com/mods/1704/images/9759-0-1499640104.png[/img][/center]\r<br />\r<br />   -Unknown, &#34;Ancient Mysteries of Tamriel&#34;\r<br />\r<br />[center][img]https://staticdelivery.nexusmods.com/mods/1704/images/9759-0-1499640740.png[/img][/center]\r<br />\r<br />\r<br />With much work, blood, sweat, tears, expletives and accidentally making 3dsMAX crash by hitting the &#34;show desktop&#34; button, I bring you the counterpart and foil of the Infinity Sword: Silmeri.\r<br />\r<br />Silmeri is a frost AND shock weapon, dealing both kinds of damage with one hit, so whatever poor sop you decide to smack across the bonce will be slowed, injured and have their magicka kicked in the face. If they&#39;re REALLY unlucky, the sword will freeze them solid, at which point they&#39;ll fall over and have about 10 seconds (or less) to contemplate what they did with their life while you stomp them into ice shavings.\r<br />\r<br />Freezing them PHYSICALLY isn&#39;t the only thing Silmeri can do, it can also &#34;freeze&#34; their magicka and stamina. As with the instant Banditsicle™, there&#39;s a chance Silmeri will completely evaporate your opponent&#39;s magicka or stamina (maybe even both&#33; D:) and break the regen for both stats over her knee, preventing either from restoring for a certain amount of time. What good does that do, you may ask? Why it&#39;s elementary, Watson&#33; Now shut up and get me my tea.\r<br />\r<br />Wait, what? Oh, right, the stats. Well, it means that melee boobsticks can&#39;t do their oh-so-special power attacks, and all wizards can do is wave their hands ineffectually at you while shouting &#34;WINGARDIUM LEVIOSA&#33;&#34; as you cut them into freeze-dried bacon bits. Because of the frost damage, melee and wizzies alike will be slowed so you can easily catch up to them and punt them across Whiterun.\r<br />\r<br />Oh, but Watson, that&#39;s not all Silmeri can do&#33; Got a problem with an archer who&#39;s hanging back and peppering you with arrows while shouting &#34;Pew pew&#33;&#34; Well, shut him up by instant messaging an ice spear to his face&#33; How do you do that? Just like with the Infinity Sword, Silmeri comes with some special power attack effects. However, because of Silmeri&#39;s dual element, each power attack does something different&#33; Want an ice spear? Do a right-ways power attack&#33; Feeling like zapping a twit? Dance your ass to the left, and knock him in the face with a lightning bolt&#33; Insurance salesmen getting in your personal space? Do a backwards power attack and knock him on his arse with a blast of ice shards&#33; Not good enough for you? Run at him screaming like a Viking with his balls caught in a blender and do a forward power attack, and zap him out of that suit with a radial blast of electricity (and maybe some frost storm too)&#33; Don&#39;t feel like moving? Just stay put and power attack, and everyone around you will get bowled over by an instant blizzard, followed by a blast of electricity that would make Nikola Tesla shed a single tear.\r<br />\r<br />Now, that&#39;s all well and good, but what if a bunch of Draugr come at you and start half-heartedly spewing Frostbite at you? Or some uppity necromancer is giving out ice bolts like they&#39;re sno-cones? Well, my friend, not to worry. Like the Infinity Sword, Silmeri offers protection from this guff. With the sword equipped you gain Silmeri&#39;s Blessing, which provides you with a high resistance to frost and shock damage, and a little bit to fire but not half as much as what the Infinity Sword offers. It&#39;ll also boost the damage of frost spells and shouts, and shock spells, as well as reducing the amount of magicka needed to cast them spells. The sword will also [i]boost[/i] your magicka and stamina by 100 while its equipped.\r<br />\r<br />Silmeri can be tempered, like the Infinity Sword. To do so you need frost and void salts, and a quicksilver ingot. (I would&#39;ve liked to use the unmelting snow you get in the White Phial quest, but you can only get it during that quest, and only once.)\r<br />\r<br />[center][img]https://staticdelivery.nexusmods.com/mods/1704/images/9759-0-1499640740.png[/img][/center]\r<br />\r<br />[u][b]FINDING SILMERI[/b][/u]\r<br />\r<br />[b]DAWNGUARD:[/b] You can find Silmeri in the Forgotten Vale. It&#39;s located in the sealed off part of the Temple to Auriel that&#39;s reachable via the Sapphire Paragon. It&#39;s to the left of all the phat lootz that you find in that little chamber, buried a little under some rubble.\r<br />\r<br />[b]VANILLA:[/b] Silmeri is located on the peak of the Throat of the World. Reaching the *absolute* peak is pretty daunting but manageable. I mean, how else would you get the Notched Pickaxe? Of course, to get there you have to go through the main quest far enough to the point where you can actually climb up to where Paarthurnax is. Silmeri itself is behind the little peak where the Notched Pickaxe is stuck, wedged into a smaller peak that&#39;s behind it.\r<br />\r<br />[center][img]https://staticdelivery.nexusmods.com/mods/1704/images/9759-0-1499640740.png[/img][/center]\r<br />\r<br />[b][u]Future Plans&#33;[/u][/b]\r<br />\r<br />&bull;Like the Infinity Sword, I&#39;d like to make a dedicated quest for Silmeri. I don&#39;t have anything yet in the way of story but, for now the sword&#39;ll chillax in the Forgotten Vale and on the Throat of the World (in the Vanilla version)\r<br />\r<br />&bull;Also like the Infinity Sword, Silmeri is a shapeshifting weapon and I plan to make weapon variants that&#39;ll be accessed by way of an ability or several. I&#39;m thinking if I go with one ability, it&#39;ll bring up a menu that says &#34;Choose your weapon type&#34; and you can pick from the selection. When all is said and done, there&#39;ll be a war axe, battleaxe, greatsword, dagger, shortsword?, hammer, warhammer, mace, and bow versions of the weapon you can choose that&#39;ll probably use Silmeri&#39;s powers in different ways.  [b]For now it&#39;s only a 1-handed sword, but the greatsword version will come around in due time.[/b]\r<br />\r<br />&bull;Custom draw, sheath and swing sounds. What I have in mind is a sound like ringing glass, probably with the frost spell equip/sheath sound on top of it (at least for the draw and sheath sounds). Currently it has the frost spell equip/sheath sounds applied, and uses a frost spell loop, which I find pretty rad.\r<br />\r<br />&bull;An additional effect where blocking heals all your stats. The spell is in there but I haven&#39;t had much luck figuring out how to script it to realize you&#39;re blocking with the sword, and so cast the spell.\r<br />\r<br />&bull;Possibly a custom quest for the sword. Unlike the Infinity Sword, Silmeri likely will utilize vanilla locations in the quest rather than new ones.\r<br />\r<br />&bull;Like the Infinity Sword, there&#39;s plans for a summonable ally that&#39;s also the sword&#39;s soul. For the Infinity Sword, that&#39;s Ulf. For Silmeri, it&#39;s...well, Silmeri. The soul and sword share the same name.\r<br />\r<br />&bull;Maybe a scabbard?\r<br />\r<br />[b][u]CHANGE-A-LOG[/u][/b]\r<br />\r<br />[b]VERSION 1.1a[/b]\r<br />\r<br />&bull;Nerfed the damage dealt by the frost and shock enchantments by 10\r<br />\r<br />&bull;Increased the ice form chance by 5%\r<br />\r<br />&bull;Increased swing speed (it was actually slower than the Infinity Sword. I might tweak the Infinity Sword so it&#39;s slower)\r<br />\r<br />&bull;Nerfed the explosion damage by half, as well as removing the duration from the effect.\r<br />\r<br />&bull;Reduced the base damage of the weapon to 27 (was originally 28) \r<br />\r<br />[b]VERSION 1.1[/b]\r<br />\r<br />&bull;Modified the mesh so the sword uses fewer textures. The number of large textures being used was a bit problematic to filesize, so I fused certain parts of the mesh so they use one texture rather than each part using an individual texture.\r<br />\r<br />&bull;Changed some of the textures to look better, particularly the blade wrappings and the handgrip.\r<br />\r<br />&bull;Modified all of the normal maps to be less shallow (hopefully) and made environment masks for the iced metal bits, most of which also use a different cubemap now.\r<br />\r<br />&bull;Some of the sword&#39;s abilities have been tweaked a bit as well. The radius of the power attack explosions have been reduced some, the frost and shock damage enchantments on the sword now no longer have a duration, and the frost explosion visual has been changed.\r<br />\r<br />&bull;The sword now also has &#34;The Froststorm Blade&#34; as a description.\r<br />\r<br />\r<br />[b]VERSION 1.0[/b]\r<br />\r<br />Initial Release \r<br />\r<br />\r<br />[u]Known Issues[/u]\r<br />\r<br />&bull;For some reason, your opponent will resist some aspect of the sword&#39;s enchantment. After testing a bit I&#39;m 99% sure it&#39;s the ice form effect, but I&#39;m not sure what exactly in it they&#39;re resisting.\r<br />\r<br />&bull;Your game [i]might[/i] hang for a bit when the explosions go off. It may well be just a problem with my game due to the NPC Havok Hit mod, and between that and the stagger calculation the game gets all constipated, but it&#39;s worth noting here so you know it&#39;s a possibility and you don&#39;t freak out and sacrifice a goat or something to Microsoft to make sure your computer doesn&#39;t burst into flame.\r<br />\r<br />[b][u]Extra Bits[/u][/b]\r<br />\r<br />The sword&#39;s design was inspired by Kit Rae&#39;s sword Avoloch.\r<br />\r<br />[u]LET IT BE KNOWN THIS MOD SHALL NOT BE COPIED AND PASTED ELSEWHERE WITHOUT PERMISSION OF THE AUTHOR (ME). DOING SO WITHOUT PERMISSION MAY RESULT IN FREQUENT RASHES, HEAD COLDS, ANTIDAEPHOBIA, WEIGHT GAIN, DEMONIC HARD DRIVE POSSESSION, BAD GAS, AND A SUDDEN LOVE FOR JUSTIN BIEBER. IF YOU ALREADY ARE A FAN OF JUSTIN BIEBER, YOUR CDS WILL TURN PLAID AND ONLY PLAY CIRCUS MUSIC.[/u]",
  "categoryId": "55",
  "version": "1.2",
  "author": "DMagnus",
  "createdUnix": "1372229316",
  "updatedUnix": "1494037890",
  "containsAdultContent": false,
  "uploadedBy": "DMagnus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035870",
      "name": "Silmeri",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "84738",
      "fileName": "Silmeri-37483-1-0.zip",
      "uploadedUnix": "1372229003",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/968fbac2be5359bf4fd4e85d9daeea2abcac2589a21c04ac1474deecda7a5358/analysis/1407617520/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Silmeri-37483-1-0.zip?fid=1000035870&ttl=1535817212&ri=8192&rs=8192&setec=4d8795b51448c1a07bfec6a65b425ba8"
    },
    {
      "fileId": "1000036136",
      "name": "Silmeri 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73819",
      "fileName": "Silmeri 1_1-37483-1-1.zip",
      "uploadedUnix": "1372386849",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/71265fe931d06c1528519975b0c18b82805e544e4837ec4922eedcae4bdfda7d/analysis/1407619890/",
      "changelogHtml": " •Modified the mesh so the sword uses fewer textures. The number of large textures being used was a bit problematic to filesize, so I fused certain parts of the mesh so they use one texture rather than each part using an individual texture.\r<br />\r<br />•Changed some of the textures to look better, particularly the blade wrappings and the handgrip. \r<br />\r<br />•Modified all of the normal maps to be less shallow (hopefully) and made environment masks for the iced metal bits, most of which also use a different cubemap now. \r<br />\r<br />•Some of the sword&#39;s abilities have been tweaked a bit as well. The radius of the power attack explosions have been reduced some, the frost and shock damage enchantments on the sword now no longer have a duration, and the frost explosion visual has been changed. \r<br />\r<br />•The sword now also has \"The Froststorm Blade\" as a description. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Silmeri%201_1-37483-1-1.zip?fid=1000036136&ttl=1535817213&ri=8192&rs=8192&setec=c78434f9bb5c8f0a7d10b5f89248bc17"
    },
    {
      "fileId": "1000036638",
      "name": "Silmeri 1_1a",
      "version": "1.1a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73819",
      "fileName": "Silmeri 1_1a-37483-1-1a.zip",
      "uploadedUnix": "1372629329",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/4d6d4ae104e57da4a7aeeab8ee64cebe165dd943fbdc533557335777389e765c/analysis/1407624021/",
      "changelogHtml": " Nerfed the damage dealt by the frost and shock enchantments by 10 <br/> \n Increased the ice form chance by 5% <br/> \n Increased swing speed (it was actually slower than the Infinity Sword. I might tweak the Infinity Sword so it&#39;s slower) <br/> \n Nerfed the explosion damage by half, as well as removing the duration from the effect. <br/> \n Reduced the base damage of the weapon to 27 (was originally 28) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Silmeri%201_1a-37483-1-1a.zip?fid=1000036638&ttl=1535817213&ri=8192&rs=8192&setec=708b2cdd2256995994236b7a81f1c60e"
    },
    {
      "fileId": "1000190792",
      "name": "Silmeri DSR Mesh",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "960",
      "fileName": "Silmeri DSR Mesh-37483-1-1a.zip",
      "uploadedUnix": "1452405785",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/eba5dfeb844634de262cbaaeaf9ef8d7fa41ecbd68182fd3321e87096dcac8b4/analysis/1452406686/",
      "changelogHtml": " Added a greatsword version and the ability to switch between 1 and 2 handed at a smelter. <br/> \n Repositioned the sword so it&#39;s now located on a chest in the Sapphire Paragon chamber, rather than on the floor under rubble. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Silmeri%20DSR%20Mesh-37483-1-1a.zip?fid=1000190792&ttl=1535817214&ri=8192&rs=8192&setec=8c3ff4fcc52b5fcf251eb821ae8cc8a3"
    },
    {
      "fileId": "1000243522",
      "name": "Silmeri 1.2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7361",
      "fileName": "Silmeri 1.2-37483-1-2.zip",
      "uploadedUnix": "1494037890",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/066338c2a4eb008777be6fa9ffd45ecb603e3b0e37af403db72badc32cf6c2b7/analysis/1494038067/",
      "changelogHtml": " Added a greatsword version and the ability to switch between 1 and 2 handed at a smelter. <br/> \n Repositioned the sword so it&#39;s now located on a chest in the Sapphire Paragon chamber, rather than on the floor under rubble. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Silmeri%201.2-37483-1-2.zip?fid=1000243522&ttl=1535817214&ri=8192&rs=8192&setec=fc70d61d40bbd4f2a1e78eb210c13bff"
    }
  ]
}