{
  "modId": 37500.0,
  "modName": "Vilja in Skyrim - Russian",
  "summary": "Vilja in Skyrim - Russian",
  "descriptionHtml": "[b][center]Новость: (От переводчика на 8.01.2017)\r<br />Уважаемые пользователи. На данный момент выложен доработанный перевод с адаптацией на SSE - [url=http://www.nexusmods.com/skyrimspecialedition/mods/7246/]http://www.nexusmods.com/skyrimspecialedition/mods/7246/[/url]\r<br />Выложен под другим аккаунтом. Это мой новый основной аккаунт, а от этого я буду уходить и закрывать здесь. Эту версию мода я буду выкладывать с доработанным переводом под другим именем. Автора я местами уведомил об этом, так что не теряйте. Доработанный перевод этой версии мода, вы можете скачать отсюда [url=http://modgames.net/load/tes_v_skyrim/kompanony/vilja_in_skyrim/251-1-0-16232]http://modgames.net/load/tes_v_skyrim/kompanony/vilja_in_skyrim/251-1-0-16232[/url]\r<br />Возможно завтра или на днях доработанный перевод на основную версию игры уже будет выложен на нексусе.[/center][/b]\r<br />_____________________________________________________________________________________________________________________________________________________\r<br />* Для тех, кто хочет написать комментарий без нарушения кириллицы, то перед написанием тут комментария, нажмите &#34;View forum thread&#34;, что идет справа в верху над окном комментария. И вам даст перенаправление на форум, там и пишите, а в теме мода отобразится ваш комментарий. \r<br />_____________________________________________________________________________________________________________________________________________________\r<br />[center][img]http://savepic.org/3699152.png[/img][b][/b][/center][b]\r<br />_____________________________________________________________________________________________________________________________________________________\r<br />[/b][center][b][/b][b]Link - The main mod here - Vilja in Skyrim for Emma. Thank y[/b][b]ou Emma for mod&#33;[/b]\r<br />[url=http://skyrim.nexusmods.com/mods/26393/][img]http://savepic.org/3949469.jpg[/img][/url][/center]\r<br />_____________________________________________________________________________________________________________________________________________________\r<br />[center]Требования:\r<br />TES V: Skyrim v1.9 и выше\r<br />DLC: Dawnguard\r<br />DLC: Dragonborn [/center]\r<br />_____________________________________________________________________________________________________________________________________________________\r<br />[size=4][b]Язык текста: Русский (RUS)\r<br />Язык озвучки: Английский (ENG)[/b][/size]\r<br />_____________________________________________________________________________________________________________________________________________________\r<br />[b]При последующих обновлениях знать&#33;[/b]\r<br />ВНИМАНИЕ: Установка последующих обновлений может повлиять на потерю всех вещей в дополнительных сумках, что у Вильи на хранении. Очистите все её дополнительные сумки перед установкой обновления (это весьма хороший повод отправить её по магазинам.). Известные несовместимости с другими модами быть не должно, но если у вас возникли проблемы, то пожалуйста, рассмотрите порядок изменения загрузки мода, между вашими другими.\r<br />Известные проблемы:\r<br />Не загружайте запись с этим модом, если ваш ГГ уже находится в таверне &#34;Гарцующая кобыла&#34;. Это может помешать работе мода&#33;\r<br />Используйте самую последнею версию игры. В зависимости на сколько версия игры будет устаревшей, то все скрипты, модели, текстуры и звуки этого мода могут работать некорректно (например: Вилья будет голая, то лысая, не подвижная или во все не существующей в игре.).\r<br />______________________________________________________________________________________________________________________________________________________\r<br />[b][center]Список изменений 4.02:[/center][/b]\r<br />[list]\r<br />[*][size=2]Ходьба &#34;бок о бок&#34; - разработана системой, используемой в моде [url=http://www.nexusmods.com/skyrim/mods/62863/]Followers as Companions[/url] от автора Ishara Meradin.[/size]\r<br />[*][size=2]Улучшена система атак горячих клавиш - теперь Вилья должна быть более точна при нападениях.[/size]\r<br />[*][size=2]Улучшена скрытность. Вилья должна будет держаться подальше и укрываться от посторонних глаз.[/size]\r<br />[*][size=2]Новые музыкальные исполнения флейты - добавлено 4 новых песни для Вильи от Bosa123 (Речь про группу Granskog).[/size]\r<br />[*][size=2]Более тонкая настройка навыков стрельбы - Вилья больше не предпочитает стальные стрелы, вместо того, что лежит лучше их в её инвентаре.[/size]\r<br />[*][size=2]Прочие, мелкие исправления.[/size]\r<br />[/list]____________________________________________________________________________________________________________________________________________________[center][b]Где найти Вилью?\r<br />Таверна «Гарцующая кобыла» - Вайтран.[/b][/center]______________________________________________________________________________________________________________________________________________________\r<br />[center][b]Вилья - со шведского значит &#34;Сила воли&#34;.[/b][/center]\r<br />\r<br />[list][*][size=2]Вилья обладает такими шведскими чертами как воля, мужество, решимость. И в ней этого много&#33;[/size][/*]\r<br />[*][size=2]Унаследовав от бабушки таинственную бутылку, молодая девушка из Солстейма решает отправиться в Скайрим, чтобы узнать правду о послании. Но всё вышло не так, как Вилья планировала. После скитаний по враждебному Скайриму с конём Брюсом, она так и не нашла человека способного ей помочь, да ещё и бутылку кто-то украл&#33; Вилья, возможно, и храбрая, но ей нужна помощь&#33;[/size][/*]\r<br />[*][size=2]Вы находите Вилью в таверне &#34;Гарцующая кобыла&#34; в Вайтране. Согласитесь ли вы ей помочь? Позволите ли вы путешествовать с вами? Решите ли вы помочь в её миссии? Со временем вы узнаете и другие тайные причины её приезда в Скайрим. Если вы разрешите ей путешествовать с вами, то её квесты вольются в игру на долгое время, и вы сможете узнать немало интересного от полностью озвученных побочных персонажей.[/size][/*]\r<br />[*][size=2]Вилья является компаньоном с квестами, а не квестом с компаньоном. Вы спросите, в чём же разница? Вы не будете чувствовать себя вынужденными делать задания Вильи вместо собственных. Они станут естественной, неотъемлемой частью вашей жизни в Скайриме, на длительное время.[/size][/*]\r<br />[*][size=2]Вилья имеет не только свой распорядок дня, но и свои надежды, видения происходящего, а так же мнения, которыми она будет рада с вами поделиться.[/size][/*]\r<br />[*][size=2]Она мечтает стать бардом, но согласно семейной традиции - все женщины в её семье были алхимиками, чего и ждут от Вильи.[/size][/*]\r<br />[*][size=2]Вилья не является лучшим воином (иначе зачем ей Вы?) или лучником. Когда дело доходит до магии, в её арсенале лишь телепорт и исцеление.[/size][/*]\r<br />[*][size=2]Но со временем это изменится и она станет более эффективной.[/size][/*]\r<br />[*][size=2]Но у Вильи есть множество других особенностей, она безусловно изменит вашу одинокую жизнь в Скайриме своей болтливостью, любопытством и непредсказуемостью.[/size][/*]\r<br />[*][size=2]Доступно несколько квестовых линий, уникальные возможности и около 9.000 строк, 6.000 которых выделено Вилье. Вилья будет вас развлекать в течение многих-многих часов игры своими разговорами. Её диалоги и особенности развились со временем так, что даже разработчики не могут отследить ход её действий. Есть много скрытых сюрпризов в её диалогах и разработчики просят вас опробовать все варианты, вы не будите разочарованы. Это всего лишь краткое описание, но можно сказать одно, что она сильно отличается от обычных компаньонов и на сегодняшний день вряд ли найдется что-то подобное.[/size][/*]\r<br />[/list][img]http://savepic.net/5569416.jpg[/img]\r<br />[list][*][size=2]Имея в наличии несколько квестовых линий (в т. ч. роман и свадьбу), уникальные способности и ооколо 9.000 строк, 6.000 которых выделено Вилье. Вилья увлечет вас всерьез и надолго. В общении с ней вас ждет множество сюрпризов. Диалогов и прочих особенностей настолько много, что даже разработчики не могут сходу вспомнить их все. Это лишь краткое описание достоинств Вильи и её отличий от остальных спутников.[/size][/*]\r<br />[*][size=2]Около 9.000 строк, 6.000 которых выделено Вилье. Вилья по умолчанию очень общительна, но, если это вас утомляет, то можно легко настроить параметры так, чтобы Вилья болтала поменьше или вовсе молчала. Она не обидится.[/size][/*]\r<br />[*][size=2]Улучшена система поведения компаньона. Если Вилья, следуя за вами, вдруг застрянет или просто потеряется, то ничего страшного,  просто отвернитесь и идите дальше, она сразу появится сразу рядом с вами. Вилью также можно призвать заклинанием.[/size][/*]\r<br />[*][size=2]По умолчанию Вилья следует за вами в режиме обычного спутника, но через диалог вы можете включить опцию «песочницы» (то бишь Вилья будет взаимодействовать с окружением во время остановок, как, например, Серана).[/size][/*]\r<br />[*][size=2]Система отношений. Отношение Вильи к вам будет меняться со временем, оно будет зависеть от ваших действий. Если Вилья разозлится на вас, то вы заметите это по изменившимся репликам и её поведению в целом.[/size][/*]\r<br />[*][size=2]Конечно же, можно изменить отношения и в лучшую сторону. Например, если дать Вилье сладкий рулет или выпивку. Так же можно улучшить  отношения подарком или сделав комплимент. Кстати, Вилья же хочет стать бардом и будет очень рада, если вы проявите интерес к ее музыкальным начинаниям.[/size][/*]\r<br />[*][size=2]Система инвентаря. Вы можете попросить Вилью надеть броню или одежду, попросить носить или не носить плащи, украшения и прочее снаряжение. Если Вилья носит одежду, то в бою она автоматически переоденется в броню (если  унее есть броня, и вы не сказали ей сражаться в одежде). Можно выбрать, будет ли Вилья раздеваться во время плавания. Так же у нее есть ночная рубашка, которую она, будучи дома, надевает перед сном. Есть две дополнительные сумки, в которых предметы остаются в полной неприкосновенности (Вилья не будет ими пользоваться). Можно попросить Вилью что-нибудь продать, для этого имеется инвентарь на продажу. Вещи можно хранить и в седельных сумках ее лошади - Брюса. Главное, чтобы Брюс был рядом.[/size][/*]\r<br />[*][size=2]Детальные боевые инструкции. Станет ли Вилья принимать участие в сражениях или же будет держаться от них подальше? Какой вид оружия предпочтет - ближнего или дальнего боя? Вилья  готова прислушаться к вашему совету. В дальнейшем Вилья научится магии, и вы сможете выбрать, какие заклинания ей следует использовать. Завершив первую часть ее задания, вы получите три команды (активируются клавишей крика), с помощью которых можно отдавать быстрые приказы во время боя: Вилья, в атаку&#33;; Вилья, прекрати бой&#33;; Вилья, прекрати бой и следуй за мной&#33;[/size][/*]\r<br />[*][size=2]Настраиваемые функции. В ветке диалога «Путешествуем вместе» вы сможете настроить гардероб Вильи, её поведение и привычки (в т.ч. разговорчивость), наличие бессмертия и т.п.[/size][/*]\r<br />[*][size=2]Лечение. Поначалу Вилья будет в состоянии лечить лишь себя, но со временем научится исцелять и вас.[/size][/*]\r<br />[*][size=2]Спарринг. Хотите отточить свои боевые навыки? Вилья будет рада стать вашим оппонентом в дружеском поединке.[/size][/*]\r<br />[*][size=2]Ремесло. В отличие от обычных спутников, Вилья способна изготавливать различные предметы с помощью инструментов&#33; Если у нее будут нужные материалы, конечно. И кое-какие инструменты она использует не так, как вы. Вот список того, что она может сделать:[/size][/*]\r<br />[*][size=2]Котелок: Вилья будет готовить различную пищу, в зависимости от ингредиентов в её инвентаре.[/size][/*]\r<br />[*][size=2]Алхимическая лаборатория: Вилья будет варить зелья, в зависимости от ингредиентов в её инвентаре.[/size][/*]\r<br />[*][size=2]Пентаграмма душ: Увы, Вилья не знает, как с ней обращаться.[/size][/*]\r<br />[*][size=2]Кузня: Вилья может использовать кузницу для изготовления отмычек. Нужен хотя бы один железный слиток.[/size][/*]\r<br />[*][size=2]Верстак: Вилья может использовать верстак для оперения стрел. Для этого ей потребуются десять поленьев и слиток (железный, стальной, серебряный или двемерский).[/size][/*]\r<br />[*][size=2]Дубильный станок:  С помощью дубильного станка Вилья может выделывать кожу (при наличии шкур). Если у Вильи нет шкур, но есть кожа, то она нарежет их в полоски.[/size][/*]\r<br />[*][size=2]Точильный камень:  Вилья не умеет пользоваться точильным камнем.[/size][/*]\r<br />[*][size=2]Плавильня: Как и вы, Вилья может выплавлять металлы, только дайте ей руду.[/size][/*]\r<br />[*][size=2]Рубочная колода: Подобно другим спутникам, Вилья может рубить дрова.[/size][/*]\r<br />[*][size=2]Кое-какие предметы Вилья может изготавливать буквально на ходу, без инструментов.[/size][/*]\r<br />[*][size=2]Простые зелья. Если у вас будет хотя бы ОДИН нужный ингредиент,  Вилья сделает простенькое зелье:  здоровья, восстановления магии, восстановления запаса сил, исцеления болезней.[/size][/*]\r<br />[*][size=2]Готовка. При наличии подходящих ингредиентов, Вилья по-быстрому приготовит что-нибудь поесть.[/size][/*]\r<br />[*][size=2]Факелы. Для факела понадобится лишь полено и льняная ткань.[/size][/*]\r<br />[*][size=2]Лошади и сражения верхом. Очевидно, что Вилья - спутник незаурядный. У нее есть свой призываемый конь, Брюс, которого она седлает каждый раз, когда вы едете верхом.  При выборе соответствующей ветки диалога Вилья может ехать верхом, даже если вы идете пешком. Если вы сражаетесь верхом, Вилья последует вашему примеру.[/size][/*]\r<br />[*][size=2]Веди нас&#33; Вилья не всегда будет следовать за вами, возможен и обратный расклад - ВЫ будете следовать за НЕЙ. Да, вы можете стать спутником Вильи. Она сама может предложить это, или же вы попросите. Вилья может показать вам места, в которых вам еще не доводилось бывать&#33; Согласитесь, это огромный плюс для ролевой игры - спутник берет на себя обязанности провожатого, а не только следует за вами в пяти шагах. Изначально, эта функция была представлена в  «Вилья в Обливионе», и благополучно перекочевала в Скайрим.[/size][/*]\r<br />[*][size=2]Лидер группы. Вы можете попросить других спутников следовать за Вильей, а не за вами. Наличие этой функции позволяет лучше планировать стратегию для прохождения подземелий.Отправив Вилью ждать в выбранную локацию или просто прогуляться, привязанный спутник составит ей компанию.[/size][/*]\r<br />[*][size=2]Болтовня о заданиях. Вилья соображает, что происходит вокруг нее, и высказывает свои мысли по поводу ваших заданий. Данная функция будет улучшаться (на данный момент Вилья слегка равнодушна к тому, что происходит в Гильдии Воров и Темном Братстве)[/size][/*]\r<br />[*][size=2]Болтовня о местах. У Вильи всегда складывается мнение о местах, которые вы посещаете. Зачастую и не приходится его спрашивать - сама скажет. Мысли Вильи о текущей локации также можно узнать с помощью соответствующей ветки диалога.[/size][/*]\r<br />[*][size=2]Взаимодействие с другими спутниками. Вилья в разной степени взаимодействует со стандартными спутниками. Советуем взять в компанию Лидию, Эйлу, Дж’зарго, Дженассу, Фаркаса или Аргиса. Вы заметите не только то, как Вилья обращается к ним, но и то, как спутники ей отвечают. Порой доходит и до продолжительных дискуссий.  Подобное, но более посредственное взаимодействие наблюдается с Ионой, Рией, Бенором, Стенваром, Атаром, Иллией, Утгерд, Аделаизой и Аннеке Скалолазкой, а также с Карджо, Дженассой, Аранией и любым нестандартным спутником, использующим следующие голоса:  FemaleCommander, FemaleDarkElf, FemaleEventoned, MaleBruteandMaleKhajiit. С другими популярными спутниками у Вильи простое взаимодействие, т.е. она видит их присутствие и что-то говорит, но те ничего не отвечают (Мьол, Эрик Грозный Убийца, Колдер). Взаимодействие с другими спутниками, возможно, нестандартными, будет добавлено в будущем.[/size][/*]\r<br />[*][size=2]Обстановка дома. Вы можете сказать Вилье, где будет ее дом. Находясь дома и в режиме свободного перемещения, она будет действовать согласно расписанию, включающему в себя: приготовление еды, уборку, музыку, чтение книг, диалоги с другими спутниками и прогулки (даже в таверну). У Вильи будет специальный диалог, пока она дома.[/size][/*]\r<br />[*][size=2]Создание лагеря. Вилья может развести костер и поставить палатку. Полная совместимость с Frostfall.[/size][/*]\r<br />[*][size=2]Чтение книг. Вилья будет рада почитать вам вслух. Изначально у нее есть только одна книга, но, как только у вас появятся другие подходящие произведения, она сразу вас известит.[/size][/*]\r<br />[*][size=2]Сбор и уборка. Вилья готова помочь вам со сбором различных предметов - стрел, оружия и, конечно, ингредиентов. Вилья возьмется за метлу, если вы попросите ее «убрать беспорядок».[/size][/*]\r<br />[*][size=2]Заклинания. Поначалу Вилья может творить лишь простую магию исцеления и телепортации. По мере прохождения своего задания, она научится ряду других заклинаний. Среди них не будет ничего особенно, ибо не предполагается, что Вилья - хороший заклинатель. Через диалог вы можете выбрать, какие заклинания ей следует использовать. Как только Вилья выучит базовые заклинания при прохождении основного задания, вы сможете и дальше обучать ее магии, давая соответствующие тома заклинаний. (не все заклинания доступны для обучения).[/size][/*]\r<br />[*][size=2]Покупки. Вы можете попросить Вилью сделать покупки, указав, что именно нужно купить. Выбор можно оставить и за Вильей - это хороший способ улучшить отношение, но будьте готовы получить то, что вам совершенно не нужно. У Вильи есть специальная сумка для вещей на продажу, доход зависит от навыка красноречия. Иногда Вилья ходит закупаться без вашей просьбы (но вас предупредит).[/size][/*]\r<br />[*][size=2]Сводка навыков. Через диалог вы можете узнать, как развиваются навыки Вильи. В сводке также будет отображено отношение Вильи к вам.[/size][/*]\r<br />[*][size=2]Игры. Вилья - тот еще ребенок и любит играть в игры. Можете сыграть с ней в салочки до какого-нибудь места, в камень-ножницы-бумагу, либо устроить дружеский поединок.[/size][/*]\r<br />[*][size=2]Музыка. Вилья мечтает стать бардом и всегда рада сыграть вам. Поначалу ей доступен только барабан, но по завершению некоторых заданий в наличии появятся флейта и лютня. KindaInappropriate (лютня) и Bosa123 (флейта) за написание музыки для Вильи.[/size][/*]\r<br />[*][size=2]Игра для аудитории. Как только вы завершите некоторые задания Вильи, она сможет развлекать  музыкой некоторых посетителей таверн и даже зарабатывать на этом деньги&#33; Вам решать, стоит ли Вилье устраивать подобные перфомансы.[/size][/*]\r<br />[*][size=2]Ролевые функции. Дабы порадовать любителей ролевой игры, предусмотрено множество функций, несущественных, на первый взгляд. Например, можно купить Вилье выпивку в таверне, поблагодарить за помощь, подарить что-нибудь, сделать комплимент. Если у вас роман с Вильей, можете лишний раз напомнить, как любите её. Вилья внезапно может спросить ваше мнение по какому-нибудь серьезному вопросу, ответ на который вы можете выбрать в зависимости от вашей личности (либо просто дать ответ, который наверняка порадует Вилью). В версии 2.0 вы также сможете ответить на только что сказанную реплику (пункт в главном меню).[/size][/*]\r<br />[*][size=2]Вульгарная солстеймская традиция. Те, кто знаком с обливионской Вильей, скорее всего, ухмыльнулись и догадались, о чем пойдет речь… Остальным же советуем направиться в одну из таверн, купить Вилье чего-нибудь выпить и отдать через специальную ветку диалога, отображающуюся только внутри таверн. Немного выпивки, и Вилья покажет вам, что люди Солстейма делают, когда навеселе.[/size][/*]\r<br />[*][size=2]Роман и брак. - Роман и свадьба. Вилья негативно относится к свадебному обычаю с амулетом Мары. Для нашей героини любовь, прежде всего, - это дружба и доверие. У вас будет шанс развить отношения с Вильей, но сначала узнайте её поближе и помогите ей завершить миссию в Скайриме. Возможно, вы даже поженитесь, тогда на свадебной вечеринке вас ждет знакомство с семьей Вильи.[/size][/*]\r<br />[*][size=2]Вилья из Сиродила. Из эл. почты, постов на форуме и приватных сообщений стало ясно, что многие игроки желают видеть Вилью такой же, какой она была Сиродиле. Потому была добавлена дополнительная функция. По завершению первой части задания Вильи, вам будет предложена ветка диалога, позволяющая вам выбрать, является ли Вилья вашим старым потерянным другом или любовницей. Если вы выберете этот вариант, предыстория Вильи и некоторые аспекты изменятся соответствующим образом.[/size][/*]\r<br />[/list]______________________________________________________________________________________________________________________________________________________\r<br />[size=2]Основной мод:\r<br />[/size][list][*][size=2]Из папки &#34;01_Data&#34; извлекаем всё содержимое и кидаем в папку игры на замену Skyrim&#92;Data.[/size][/*]\r<br />[/list][size=2]\r<br />Дополнение:\r<br />[/size][list][*][size=2]Если вы используете DLC Dragonborn, то в папке &#34;02_Дополнение&#34;, вас ждёт возможность пройти его вместе с Вильей. Для установки, всё содержимое и кидаем в папку игры Skyrim&#92;Data.[/size][/*]\r<br />[/list][size=2]\r<br />Мини-дополнение:\r<br />[/size][list][*][size=2]Рождественская песня v1.0 - которое добавляет возможность Вилье, Синдре и Уилберту исполнять рождественскую песню &#34;Silent Night (Тихая ночь)&#34; (если находитесь в Коллегии Бардов, то можете попросить Вилью спетьвместе с Синдрой или устроить трио с Уилбертом), которую автор могла использовать по причине свободного распространения. Скромный подарок от автора на Рождество. Для установки, всё содержимое и кидаем в папку игры Skyrim&#92;Data.[/size][/*]\r<br />[/list][size=2]______________________________________________________________________________________________________________________________________________________\r<br />Опции: (В каждой опции свой ReadMe (RUS), перед установкой читайте)\r<br />Внешний вид:\r<br />[/size][list][*][size=2]Ванильная внешность Вильи (без уник. лица) и (с уник. лицом) - просто смена внешности, если вам нужно.[/size][/*]\r<br />[*][size=2]Внешность Анджелины Джоули для Вильи v.2  - меняет лицо и волосы под указанный образ.[/size][/*]\r<br />[*][size=2]Внешность Джессики Альба для Вильи v.2 и от GeeGee - меняет лицо и волосы под указанный образ с использованием отдельного мода.[/size][/*]\r<br />[*][size=2]Вилья вампир - данная опция предоставляет только текстуры внешнего вида. Какие будут использованы меши, то и получите в результате.[/size][/*]\r<br />[*][size=2]Вилья со станд. прической, индив.лицом, анимацией и телом СВВЕ - некая альтернатива внешность используя меши и текстуры.[/size][/*]\r<br />[*][size=2]Отдельная сетка уникального лица без текстур - просто удачно подобранные меши (модель тела) на которые можно наложить практически любые текстуры.[/size][/*]\r<br />[*][size=2]Отдельное уникальное тело и лицо Вильи - отобранные меши от UNP и текстуры от Mature Skin. (Нажмите, чтобы увидеть пример).[/size][/*]\r<br />[*][size=2]1) A Vilja Custom Face for FFA and CBBE. Barbie Looks, 2)Adriana Face for Vilja, 3) Dubhorizon Vilja Look Pack for CBBE and  Female Facial Animations - это альтернативная внешность для Вильи.[/size][/*]\r<br />[*][size=2][b]Рыжая красотка[/b] - Добавлена новая внешность под тела CBBE, UNP.[/size]\r<br />[/list][size=2]\r<br />Индивидуальный вид:\r<br />[/size][list][*][size=2]Без индивидуального лица для Вильи v.2 - Вилья будет использовать установленные текстуры и меши лиц для всех женских НПС (Она потеряет свой первоначальный вид)[/size][/*]\r<br />[*][size=2]Индивидуальное лицо Вильи для тел CBBE - это текстуры и меши пользовательского лица для поддержки текстур тел СВВЕ.[/size][/*]\r<br />[*][size=2]Индивидуальное лицо Вильи для тел UNP - это текстуры и меши пользовательского лица для поддержки текстур тел UNP.[/size][/*]\r<br />[*][size=2]Индивидуальное лицо Вильи для тел Vanilla - это текстуры и меши пользовательского лица для поддержки текстур тел Vanilla.[/size][/*]\r<br />[*][size=2]Индивидуальное лицо Вильи для женской лицевой анимации и ванильных тел - это индивидуальное лицо для женской лицевой анимации.[/size][/*]\r<br />[*][size=2]Исправление для DLC HearthFires - если вы состоите в браке с Вильей, то ваши дети из DLC Hearthfire будут поддерживать собственный диалог для перемещения на новое место. Потому что у Вильи уникальный голос, который не позволяет использовать последующий диалог с супругом. (Подробней в ReadMe)[/size][/*]\r<br />[*][size=2]Лунный свет (Ликантропия) - добавляет возможность трансформироваться в оборотня Вилье и другим любым спутникам, которые имеют не ванильную расу. (Не рекомендуется использовать)[/size][/*]\r<br />[*][size=2]Макияж Вильи - представлены готовые текстуры для лицевого макияж Вильи.[/size][/*]\r<br />[*][size=2]Ретекстур - Волчий Клич - полностью заменяет текстуры и меши брони.[/size][/*]\r<br />[*][size=2]Прически - дан ряд выделенных причесок на ваш вкус.[/size][/*]\r<br />[*][size=2]Глаза - дано 3 вида основных цветовых глаз и 67 видов разных цветов.[/size][/*]\r<br />[*][size=2]Патч для мода PC Exclusive Animation Path - совместимость с указанным модом.[/size][/*]\r<br />[*][size=2]Убрать уникальное лицо - Эта опция содержит сетку лица, которое можно использовать, если вы хотите использовать свои текстуры тела и лица.[/size][/*]\r<br />[*][size=2]Уникальное лицо Вильи для тел (убрать шов) - опция дает бесшовные и уникальные лица под указанные тела, как UNP, XCE, СВВЕ, ADEC и CHSBHC.[/size][/*]\r<br />[*][size=2]Уникальное тело Вильи - позволяет настроить тело Вильи под свой вкус, как душе угодно.[/size][/*]\r<br />[*][size=2]Черный цвет для собаки Лейфур - заменяет цвет собаки на черный.[/size][/*]\r<br />[*][size=2]Hush Doggy - Это Meshes исправления для всех собак в игре. Проще говоря, он заменяет базовую анимацию на другую. Таким образом, ваша собака компаньон больше не будет лаять постоянно.[/size][/*]\r<br />[*][size=2][b]Исправление для гардероба[/b] - увидите &#34;FixForChargia&#34;. Использовать, если возникают проблемы с гардеробом.[/size]\r<br />[*][size=2][b]Реплейсер Уилберта[/b] - Новая внешность Уилберта.[/size]\r<br />[/list][size=2]______________________________________________________________________________________________________________________________________________________\r<br />Удаление:\r<br />[/size][list][*][size=2]EMCompViljaSkyrim.bsa[/size][/*]\r<br />[*][size=2]EMCompViljaSkyrim.esp[/size][/*]\r<br />[/list][size=2]\r<br />Scripts:\r<br />[/size][list][*][size=2]&#92;AAEMCompViljaCompquest.pex[/size][/*]\r<br />[*][size=2]&#92;AAEMExtraStorageScript.pex[/size][/*]\r<br />[*][size=2]&#92;AAEMSellingItemsScript.pex[/size][/*]\r<br />[*][size=2]&#92;Viljascript.pex[/size][/*]\r<br />[/list][size=2]\r<br />Video:\r<br />[/size][list][*][size=2]&#92;ViljaWeddingNight3.bik[/size][/*]\r<br />[/list][size=2]\r<br />Дополнение:\r<br />[/size][list][*][size=2]emviljainsolstheimaddon.bsa[/size][/*]\r<br />[*][size=2]EMViljaInSolstheimAddOn.esp[/size][/*]\r<br />[/list]______________________________________________________________________________________________________________________________________________________\r<br />Примечание от Krist&#39;a по поводу совместимости LB:\r<br />\r<br />[size=3][list][*][url=http://u.to/QVSgAg][b]Туториал - v.2.0 [LB] адаптация сторонних модов[/b][/url][/*]\r<br />[*][url=http://u.to/Yv4tBQ][b]Туториал: адаптация Вильи под LB + LH [1 часть][/b][/url][/*]\r<br />[*][url=http://u.to/P1suBQ][b]Туториал: адаптация Вильи под LB + LH [2 часть][/b][/url][/*]\r<br />[/list][/size]\r<br />Единственное, что до кучи потребовалось чтоб работала с LH, так это после адаптации тела еще найти ее в списке НПС и нажать Ctrl + F4 (это для того, чтоб работала анимация лица во время разговора).\r<br />Готовой внешности от Кристы не будет. \r<br />\r<br />[center][b]Проблемы с инвентарём Вильи: (Читать, если возникает)[/b][/center]\r<br />Наиболее распространённая проблема с которой сталкиваются люди на версии 2.0-3.0+, это невозможность получить доступ к инвентарю Вильи. Причина этому то, что вы используете пользовательский внешний вид для неё.\r<br />Чтобы избежать этого, сделайте следующее:[list][*][size=2]В новой игре: Не добавляйте никаких косметических изменений на Вилье, которые требуют ESP (как лица, волосы, тела и пр.) до тех пор, пока вы не встретите её и не получите доступ к её инвентарю, который в начале должны получить сразу после того, как встретитесь с ней с ворами.[/size][/*]\r<br />[*][size=2]Обновление версии в текущей игре:  Если вы используете какое-либо косметическое изменение Вильи, которые требует ESP (как лица, волосы, тела и пр.), то необходимо их отключить&#33; Прежде чем вы установите новую версию ESP и BSA мода. Иначе вы не сможете получить доступ к её инвентарю&#33; Встречайте Вилью в игре с её первоначальным внешним видом. Вы увидите сообщение в левом верхнем углу об &#34;Обновлении до версии...&#34;. Через пару секунд вы получите новое сообщение, что обновление успешно завершено и что Вилья на миг исчезнет из вашего вида и окажется за спиной. Сразу же убедитесь, работает ли её инвентарь. Если вы лишнее отключили, то работать будет. Теперь вы можете сохранить игру, выйти и включить все необходимые опции и вернутся в игру. Её инвентарь при этом должен работать правильно.[/size][/*]\r<br />[*][size=2]P.S. &#34;от переводчика&#34; - всё это не всегда помогает, зависит ещё то, какие вы геймплейные моды могли установить, которые затрагивают скрипт игры, лишний раз лучше воздержаться от их установки до той поры, пока Вилью не встретите и не получите доступ к инвентарю. Просто я проверял этот баг с установленным опциями и всё было в порядке. По крайне мере у многих были проблемы с её LB внешностью. Потому, когда захотите её поставить, воздержитесь от опций, пока не получите над ней полный контроль.[/size][/*]\r<br />[/list]\r<br />[b]Авторы:[/b]\r<br />[list][*][size=2]Персонаж, история, диалоги и голос от Emma[/size][/*]\r<br />[*][size=2]Основное кодирование и ИИ от Amgepo[/size][/*]\r<br />[*][size=2]Текстуры, модели и кодирование от Lycanthrops[/size][/*]\r<br />[*][size=2]Дополнительная озвучка от SirCharleytheKhajiit, Lycanthrops, Jezdamayel и Majamikol.[/size][/*]\r<br />[*][size=2]Специальная музыка для Вильи от Adrien Ortone (KindaInappropriate) (Лютня) и Bosa123 (Флейта).[/size][/*]\r<br />[*][size=2]Более 50 разновидностей написанных диалогов  для Вильи от Discworld, автор Sir Terry Pratchett.[/size][/*]\r<br />[/list]",
  "categoryId": "66",
  "version": "4.2",
  "author": "Emma Amgepo Lycanthrops",
  "createdUnix": "1371933677",
  "updatedUnix": "1449423371",
  "containsAdultContent": false,
  "uploadedBy": "Sadorimatsu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037682",
      "name": "Vilja_in_Skyrim_v_1_5_b_rus",
      "version": "1.5b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "395784",
      "fileName": "Vilja_in_Skyrim_v_1_5_b_rus-37500-1-5b.7z",
      "uploadedUnix": "1373203165",
      "modVersion": "1.5b",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vilja_in_Skyrim_v_1_5_b_rus-37500-1-5b.7z?fid=1000037682&ttl=1535817251&ri=8192&rs=8192&setec=5fbca3fed4e7dc466ad5041462d982d3"
    },
    {
      "fileId": "1000084975",
      "name": "Vilja_in_Skyrim_v_2_03",
      "version": "2.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "490316",
      "fileName": "Vilja_in_Skyrim_v_2_03-37500-2-03.7z",
      "uploadedUnix": "1385915913",
      "modVersion": "2.03",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vilja_in_Skyrim_v_2_03-37500-2-03.7z?fid=1000084975&ttl=1535817252&ri=8192&rs=8192&setec=a960e0b8a47b21b9beed8feae54b0e8a"
    },
    {
      "fileId": "1000109959",
      "name": "Vilja in Skyrim v.3.02",
      "version": "3.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "668064",
      "fileName": "Vilja in Skyrim v.3.02-37500-3-02.7z",
      "uploadedUnix": "1400748655",
      "modVersion": "3.02",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vilja%20in%20Skyrim%20v.3.02-37500-3-02.7z?fid=1000109959&ttl=1535817252&ri=8192&rs=8192&setec=1463e362d5c43e92027716b9a1b4bbab"
    },
    {
      "fileId": "1000140505",
      "name": "Vilja in Skyrim v.4.01",
      "version": "4.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "937096",
      "fileName": "Vilja in Skyrim v.4.01-37500-4-01.7z",
      "uploadedUnix": "1419782263",
      "modVersion": "4.01",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vilja%20in%20Skyrim%20v.4.01-37500-4-01.7z?fid=1000140505&ttl=1535817253&ri=8192&rs=8192&setec=9b2c4b18fc0af88121469fa3777ba5de"
    },
    {
      "fileId": "1000187039",
      "name": "Vilja in Skyrim v.4.2",
      "version": "4.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "949603",
      "fileName": "Vilja in Skyrim v.4.02-37500-4-02.7z",
      "uploadedUnix": "1449423371",
      "modVersion": "4.2",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vilja%20in%20Skyrim%20v.4.02-37500-4-02.7z?fid=1000187039&ttl=1535817253&ri=8192&rs=8192&setec=ce5c7b2ad0d82c6a88f3e9299c1defe5"
    }
  ]
}