{
  "modId": 37524.0,
  "modName": "The Lost Wonders of Mzark Deutsch",
  "summary": "Deutsche Version von \\\\\\\"The Lost Wonders of Mzark\\\\\\\"\r\nOriginal wird NICHT benötigt! Entspricht der EV Version 1.3\r\nEine riesige, auf Dwemer-orientierte Questmod, die vier neue Quests hinzufügt, ein mächtiges offenes unterirdisches Gewölbe sowie neue Waffen und Rüstungen!\r\nEnglisches Original von Guardly und MrCasual hier:\r\nhttp://skyrim.nexu",
  "descriptionHtml": "Original hier: http://skyrim.nexusmods.com/mods/36317/ Wird NICHT benötigt!\r\nDa ich in meiner Übersetzung die Dateien schon zusammenführte, ist ein Update auf Version 1.3 überflüssig, da an den Files selbst nichts verändert wurde.\r\n\r\nDRAGONBORN WIRD BENÖTIGT!\r\n\r\nIn den Häfen der nördlichen Meere hört man das Geraune der Seeleute von einer alten Ruine, eine, die anders ist als alle anderen. Eine seltsame Dwemermaschine, die sich weit draußen im Ozean befindet und auf die fernen Küsten Himmelsrands blickt. Und obwohl die Seeleute diese Geschichten erzählen, besagt die Historie etwas anderes. Tief in dieser Ruine befindet sich die letzte Errungenschaft des Großherrn von Schwarzweite. Es heißt, dass Mzark, der Beherrscher von allem, was unter Himmelsrands Bergen liegt, Wunder zurückließ, die Tausende von Jahren unberührt blieben, bewacht von einer Reihe fühlender Maschinen, die selbst jetzt noch auf einen würdigen Abenteurer warten, der ihnen hilft, ihren Zweck zu erfüllen und die verlorenen Wunder Mzarks beansprucht! \r\n\r\nBei \\\\\\\"Lost Wonders of Mzark\\\\\\\" handelt es sich um eine Quest/Dungeon-Mod für die Liebhaber eines rätsellastigen Spiels. Die Gegner, auf die man im Inneren trifft, müssen mit Bedacht beseitigt werden und es gibt mehr als bloß Kämpfe, was euch in den Tiefen von Mzarnumez erwartet. Man könnte es mit \\\\\\\"Dead Money\\\\\\\" vergleichen, aber für Skyrim.\r\n\r\nÜbersicht:\r\n-4 neue Aufgaben, die sich über etliche Stunden Spielzeit erstrecken, alle komplett vertont und gescriptet, basierend auf Rätsel und verborgenen Gegenständen. \r\n- Ein enormer, neuer, nicht-linearer Dungeon, Mzarnumez, angefüllt mit seltsamen Dwemermaschinerien. Riesige Gießereien und Roboter, Schächte, unterseeische Buchten und Kammern erwarten euch in Mzarks größter Schöpfung. \r\n-Neue Gegner, unbesiegbare Hologramme, Dwemerbots und mehr! Sowie Mini-Bosse und Meisterrätsel im Überfluss! \r\n-Neue Waffen und Zauber. Lass deine Gegner mit Holostäben explodieren, projiziere Hologramme als Verbündete oder lass vor dir einen Haufen Lauchstangen erscheinen - wenn dir das zusagt. \r\n-Ein besonderers Artefakt, das seit Arena nicht mehr gesehen wurde, hilft dabei, die Geheimnisse der Dwemer zu ergründen.  \r\n-3 neue gerüstete Robensets, alle auf magie-orientierte Charaktere zugeschnitten. \r\n\r\nUm die Quest zu starten, begebt euch weit ins Meer hinaus, nach Mzarnumez (das auf der Karte markiert wird) und drückt den Schalter darin.",
  "categoryId": "35",
  "version": "1.1",
  "author": "Guardly and MrCasual     DV von Stefanu",
  "createdUnix": "1372006130",
  "updatedUnix": "1373722230",
  "containsAdultContent": false,
  "uploadedBy": "Stefanu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035484",
      "name": "Lost Wonders of Mzark DV",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "64430",
      "fileName": "Lost Wonders of Mzark DV-37524-.7z",
      "uploadedUnix": "1372005876",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c21d76fe787fed7583c9a1592eb02f41e9f6577103d611645037a732a0bceb94/analysis/1407614343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lost%20Wonders%20of%20Mzark%20DV-37524-.7z?fid=1000035484&ttl=1535817285&ri=8192&rs=8192&setec=52f064a5b9d6375724548e19ee8c5f4c"
    },
    {
      "fileId": "1000038726",
      "name": "Lost Wonders of Mzark Deutsche Version",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "61353",
      "fileName": "Lost Wonders of Mzark Deutsche Version-37524-1-1.7z",
      "uploadedUnix": "1373722230",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/03c48c98c99a167c0231b297a58e65ac62fa75c0791aa9f9791fdcece3130e7b/analysis/1407642074/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lost%20Wonders%20of%20Mzark%20Deutsche%20Version-37524-1-1.7z?fid=1000038726&ttl=1535817285&ri=8192&rs=8192&setec=dcfb2e2c79f21da67503b32e3a421799"
    }
  ]
}