{
  "modId": 37528.0,
  "modName": "Improved Lakeview exterior and greenhouse",
  "summary": "This mod improves the exterior landscape around Lakeview Manor without turning your quaint country estate into a fortress.  Includes a greenhouse separate from the main manor.  No walls, gates, NPC\\'s or pretentious luxuries.",
  "descriptionHtml": "This is my fourth Lakeview Manor mod. This mod improves the exterior landscape without turning your quaint country estate into a fortress or a shopping mall. \r\n\r\nThings added by this mod: \r\n\r\n1) Improved landscape to give better view of the lake. \r\n\r\n2) Road leading to the lake - necromancer alter removed. \r\n\r\n3) A greenhouse, with a full interior containing 21 plantable soil plots, a small lofted storage area, and a complete alchemy station with plenty of storage for your ingredients and crafting gear. Also includes a book listing all potion effects and which ingredients provide them (if this is too much of a cheat for you just pick the book up and toss it into the lake). The loft also includes the \\\"doghouse\\\" where you can sleep when your spouse is mad at you. \r\n\r\n4) An extended Stable that includes an outdoor storage area so you can drop off your loot without going inside. \r\n\r\n5) A functional outhouse, apparently the only one in Skyrim. No more trees! \r\n\r\n6) A campsite on an island in the lake, for when you what to sleep under the stars. \r\n\r\n7) A viewing area. \r\n\r\n8) A fish hatchery and dock. \r\n\r\n9) As a bonus, there are a few lost treasures on the lake bottom. You will have to go diving to find them. Nothing that will make or break the game, but worth getting your hair wet for. \r\n\r\nWhat it DOESN\\'T add are walls, guards, merchants, followers or other NPC\\'s. I prefer privacy and quiet. Besides, who needs guards when you have Lydia patroling the grounds? \r\n\r\nBefore installing this mod, make sure you are not in the Lakeview cells or any of the adjacent wilderness cells. Pinewatch is a safe place to save. It is also safe to be inside the house. \r\n\r\nThis mod can be installed no matter what the current status of the house is. You have to buy the charter before anything but the basic landscape and road will be available. Some of the features will enable as soon as you own the property. Others are linked to existing structures, and their building recipies have been modified to reflect that. These are the things that are linked: \r\n\r\nGreenhouse: Must build garden. Sorry about the small print, its a large recipe and the game wants to fit it all on one line. But remember you are building an entire building as well as its internal furnishings. \r\n\r\nFish hatchery: Must build apairy. \r\n\r\nOutdoor storeage and Outhouse: These are linked to the stable. \r\n\r\nFront door landscape: These are linked to the animal pen, but do not require any additional materials. This was just a matter of convenience, as they looked weird being there without the house, and I couldn\\'t get them to link properly to the house itself. \r\n\r\nOf course, if you have already built the structures, the attached new structues will automatically be enabled. \r\n\r\nIssues: Fish Hatchery. \r\n\r\nI dont know why, but there is a bug with the fish hatchery. It is changing the species of fish - you put in one kind you get another. There is a patern to this; silverside=riverbetty, riverbetty=spadetail, spadetail=histcarp, histcarp=salmon+silverside, longfin=longfin. \r\n\r\nSlaughterfish eggs are not working, so I added three slaughterfish nest and two tame slaughterfish to the hatchery. \r\n\r\nFuture plans: I eventually want to get the new buildings to build independently. \r\n\r\nIf there are any problems with this mod, let me know and I will try to fix them. I will be leaving Lakeview for now to begin work on Windstad (which I have gotten alot of request for). \r\n\r\nCredits: \r\n\r\nThe outhouse belongs to Stroti and Tamira, used with permission (http://skyrim.nexusmods.com/mods/32056/?) \r\n\r\nThis mod will NOT be compatable with any other mod that alters the Lakeview exterior cells or any of the adjacent wilderness cells. ",
  "categoryId": "67",
  "version": "1.0",
  "author": "jecoil",
  "createdUnix": "1372017146",
  "updatedUnix": "1372016706",
  "containsAdultContent": false,
  "uploadedBy": "jecoil",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035510",
      "name": "Lakeview Exterior greenhouse",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1419",
      "fileName": "Lakeview Exterior greenhouse-37528-1-0.zip",
      "uploadedUnix": "1372016706",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/60cc8a68693634cb86fc512490245de4b5251d79544c82cf482757f4abdd5da4/analysis/1407614534/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20Exterior%20greenhouse-37528-1-0.zip?fid=1000035510&ttl=1535817291&ri=8192&rs=8192&setec=17c335e0b76a5dd3643fe2a83d234d89"
    }
  ]
}