{
  "modId": 37538.0,
  "modName": "Skyrim Community College",
  "summary": "A Legendary Hero needs a legendary school to help hone and perfect skills. East of Whiterun, the Skyrim Community College stands, with 18 trainers, 12 merchants, and a diverse storehouse of free gear for new students to begin their adventures! ",
  "descriptionHtml": "This mod DOES NOT require DLC. \r\n\r\nOne thing I hated about going Legendary was running all over Skyrim, trying to find trainers to advance my skills back up to a level to use all the perks I had just redeemed. Worse, the fate of my character being tied to the vile monster, Hermaeus Mora, stemming from my use of the Oghma Infinium stuck in my craw. A Dragonborn\\'s destiny is not to serve the Daedra. \r\n\r\nThus I resolved to create a mod that would let me level-up my character as much as I wanted, so long as I had the money, with no need of ever acquire the Oghma Infinium, nor give into the temptation to take a lore-based shortcut that would damn my soul to a Daedra. \r\n\r\nThus I give you the Skyrim Community College! \r\n\r\nThis new location is East of Whiterun, near Shimmer Mist Cave. \r\n\r\nThere is a fast-travel option built in, that does not require you to go searching for the location, so you can fast-travel to the college right out of Helgen.\r\n\r\nThere are 18 master-level trainers, encompassing every player skill in the game. Each trainer can help the player level-up to a skill of 90. Additionally, every training book in the game is ALSO available at the Skyrim Community College. \r\n\r\nThere are also 10 brand new training books for Pickpocketing, only available at the Skyrim Community College. If players hold off on using these books, found in the Community College basement or for sale by Unar, you can level from 90 to 100 in pickpocket without EVER committing a crime! \r\n\r\nFor the sake of lore, all the trainers found at the Skyrim Community College are veterans, i.e. they are all very, very old. Orcs who were deposed from their strongholds, who were not looking for a \\'good death\\'. Nords, Breton, and Imperial elders who have long since retired but have a great deal of knowledge left to share with the world. Age, however, does not mean weak, each trainer being a level 180 character. \r\n\r\n12 of the trainers are also merchants, 2 of them being fences that do NOT require Thieves Guild membership to deal with you, selling everything from spell tomes, weapons, robes, ordinary clothes and stuff for your child. \r\n\r\nAlchemy and Enchanting tables are also available, along with a horde of leveled items that are free for the player to take with them. Don\\'t worry about feeling guilty, they\\'ll make that money back by charging you for training. There is even a bedroll and a player-safe chest on the top floor, near the large mead barrels, should you need to stay the night. \r\n\r\nI also HIGHLY recommend that you use this mod in conjunction with Atlas\\' Better Training so you can train as many times as you want with no \\'\\'5x level cap\\'\\', provided you have the gold to do it - an encouragement to actually use the vast fortune high-level players often find themselves sitting on. \r\n\r\nReporting a technical glitch in a courteous fashion is totally acceptable. Any valid report of a problem is welcome, and I am happy to fix any bugs, \r\n\r\n----------------------------------------------------------------------------------- \r\n\r\nTo all the trolls and haters, pay attention, listen close... sod off. \r\n\r\nEveryone else? Enjoy the mod. :-)",
  "categoryId": "73",
  "version": "v1.2",
  "author": "RKO381",
  "createdUnix": "1372036084",
  "updatedUnix": "1372036043",
  "containsAdultContent": false,
  "uploadedBy": "rko381",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035533",
      "name": "Skyrim Community College",
      "version": "v1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6256",
      "fileName": "Skyrim Community College-37538-v1-2.rar",
      "uploadedUnix": "1372036043",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/a617f1c8174e27acca931131dcc5faec7ae86392497b08c6fd5e379cffde4a90/analysis/1407614766/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Community%20College-37538-v1-2.rar?fid=1000035533&ttl=1535817298&ri=8192&rs=8192&setec=92d1603f026e1dd083eef9dbcb8dacba"
    }
  ]
}