{
  "modId": 37545.0,
  "modName": "Become A Highwayman",
  "summary": "Become a highwayman. Rob travelers all over skyrim. ",
  "descriptionHtml": "Become A Highwayman.\r<br />\r<br />This mod allows you to roleplay as a highwayman character. Stop unsuspecting travelers along the road and demand their gold and valuables. \r<br />\r<br />You can only rob travelers, farmers, and other people who live outside the cities in Skyrim.\r<br />I am working on an optional mod that lifts the restrictions, and lets you rob anyone except children and guards (unless you want to end up in jail).\r<br />\r<br />There are two different reactions:\r<br />Scared - Will give you their valuables in exchange for their lives.\r<br />Brave - Refuses to be intimidated, and challenges you to a fight to the death.\r<br />\r<br />You will instantly become enemies with anyone you rob.\r<br />You will earn an increase in speechcraft if you intimidate someone into giving you their valuables. \r<br />Since the crimes happen outside the cities and towns of Skyrim, the guards are not notified and you won&#39;t receive a bounty.\r<br />Those people you let live have a good chance to call the dark brotherhood or bandit thugs to go after you.\r<br />\r<br />This mod requires Skyrim&#39;s latest update.\r<br />\r<br />[CENTER]\r<br />A little story:  \r<br />\r<br />This is Kiara.\r<br />\r<br />[IMG]http://i1367.photobucket.com/albums/r781/MimiTheAlchemist/Skyrim%20Mods/Become%20A%20Highwayman/kiara_zpsab43a268.jpg[/IMG]\r<br />\r<br />Kiara was a refugee from Morrowind who moved to Skyrim in hopes of a better future, but work was very hard to come by so she found herself begging and stealing to get by. While visiting Riften, Kiara heard of the thieves guild and longed to join. Then one day, she got the opportunity she had waited for. She was at the market when she met him. He told her thievery was his line of work and  asked her to do a simple job that involved taking a ring from a merchant and stashing it on an unsuspecting Dunmer. &#34;Easy enough&#34;, Kiara thought to herself, but one thing led to another, and she totally botched the job. He then divulged his true identity as Brynjolf of the thieve&#39;s guild. &#34;This was a test; and sorry lass, you failed.&#34;, Brynjolf told Kiara. She was totally dumbfounded. She knew she wasn&#39;t too good at pickpocketing or lockpicking, and her sneak skills left much to be desired. Kiara returned to her room at the bunkhouse and cried herself to sleep. &#34;There must be another way to make money and get the thieves guild to notice me?&#34;, Kiara said as she got out of bed.  As she rose to her feet, Kiara saw a book lying on the end table called &#34;The Marksmanship Lesson&#34;. As she flipped through the pages, she was engrossed by the the rogue highwayman named Dob. She knew then what to do. That was the day her career as a highwayman began. She got a hood and a mask and headed out of town to try her luck.\r<br />\r<br />[IMG]http://i1367.photobucket.com/albums/r781/MimiTheAlchemist/Skyrim%20Mods/Become%20A%20Highwayman/scarletblade_zps1bd7b566.jpg[/IMG]\r<br />\r<br />Kiara even thought of a secret identity for herself. When she wore her hood and mask, she became The Scarlet Blade, a name Kiara knew most people in Skyrim would grow to fear. It wasn&#39;t long until Kiara had gotten the hang of her new profession. She was always a great fighter, and it wasn&#39;t too hard to intimidate most people. Her name had gotten a little fame around Riften, but Kiara wanted to be known all over Skyrim. Kiara then got on the carriage to Whiterun to try her luck there. Once she got off the carriage, it wasn&#39;t long until she saw two unsuspecting farmers. She jumped from out of the shadows looking as intimidating as possible and demanded the farmers&#39; valuables.\r<br />\r<br />[IMG]http://i1367.photobucket.com/albums/r781/MimiTheAlchemist/Skyrim%20Mods/Become%20A%20Highwayman/scaredfarmers_zps597864c2.jpg[/IMG]\r<br />\r<br />The two farmers had little valuables on them, but it wasn&#39;t just about the loot. Kiara wanted everyone in Skyrim to quake at the mere mention of her name. A couple weeks later, everyone in Whiterun was talking about The Scarlet Blade. Kiara laughed about some of the false rumors being spread about her. One girl said she heard Kiara was an orc. Another lady said Kiara was a man. Kiara only stayed in Whiterun one more day. The next day she departed for Dawnstar. It was on the road to Dawnstar, Kiara had one of the most memorable moments as a highwayman.\r<br />\r<br />On the road, she met a merry traveling bard who wandered around Skyrim singing songs and getting drunk. Even though Kiara personally liked the jovial bard, she was running low on loot. &#34;Hand over your valuables, and nobody gets hurt&#33;&#34;, Kiara said in a deep intimidating tone. Kiara didn&#39;t know if it was the alcohol or if the bard had gone crazy, but the bard surprised her and refused.\r<br />\r<br />[IMG]http://i1367.photobucket.com/albums/r781/MimiTheAlchemist/Skyrim%20Mods/Become%20A%20Highwayman/bravebard_zps80457cdf.jpg[/IMG]\r<br />\r<br />Their battle was long and heated, but at the end Kiara came out victorious. She took the bard&#39;s gold and valuables and scrawled an image of a dagger into the bards arm, the calling card of The Scarlet Blade. \r<br />\r<br />[IMG]http://i1367.photobucket.com/albums/r781/MimiTheAlchemist/Skyrim%20Mods/Become%20A%20Highwayman/deadbard_zpsbec0254a.jpg[/IMG]\r<br />\r<br />Although it took a couple of days before the poor bard&#39;s body was discovered, word of the deeds of The Scarlet Blade had reached all the way to Windhelm. Kiara counted out gold coins on her bed at the Nightgate Inn with an amused smile on her face. &#34;Where to next?&#34;, she asked herself. &#34;Should I go to Markarth or give Solitude a try?&#34; Although Kiara was uncertain where to go next, she was certain that it wouldn&#39;t be long until everyone in Skyrim knew the name of The Scarlet Blade.\r<br />\r<br />The end.\r<br />\r<br />Update - Become Highwayman version 2.0 - Now available for download&#33;\r<br />This is an update of the voiced version that features Bandit Gear.\r<br />Those wearing the new bandit gear will fool the bandits into thinking you&#39;re one of them.\r<br />If you are in a bandit camp, do not unequip the bandit gear unless you are ready to fight.\r<br />Without your bandit gear, the bandits will know that you are not one of them.\r<br />I would advice equipping the bandit gear before entering a bandit camp. Once they\r<br />start fighting you, they won&#39;t stop even if you equip the gear.\r<br />The gear can be crafted at the forge under the Hide section. It can also be tempered. \r<br />\r<br />I hope you enjoy my mod&#33;\r<br />\r<br />[/CENTER]",
  "categoryId": "28",
  "version": "2.0",
  "author": "MimiTheAlchemist",
  "createdUnix": "1372071767",
  "updatedUnix": "1399677676",
  "containsAdultContent": false,
  "uploadedBy": "MimiTheAlchemist",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035566",
      "name": "Become a Highwayman",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Become a Highwayman-37545-1-0.zip",
      "uploadedUnix": "1372071757",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bf33edab008eee8b7391c50a9a919f784331f09242ccd949c1a081e5a65e5311/analysis/1407614970/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Become%20a%20Highwayman-37545-1-0.zip?fid=1000035566&ttl=1535817306&ri=8192&rs=8192&setec=e9df8f4406e80c232853fef05fbbf673"
    },
    {
      "fileId": "1000036824",
      "name": "Become a Highwayman - voiced",
      "version": "1.0a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Become a Highwayman - voiced-37545-1-0a.zip",
      "uploadedUnix": "1372742091",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/ca28d24ce7660b082cffa875ec3bdb1e90471d0c3bd0ead3fa619f22f1a1fa0f/analysis/1407625543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Become%20a%20Highwayman%20-%20voiced-37545-1-0a.zip?fid=1000036824&ttl=1535817307&ri=8192&rs=8192&setec=921c92cca215eaf9f3cf8b5fcb2fce34"
    },
    {
      "fileId": "1000066351",
      "name": "Become a Highwayman - Update",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Become a Highwayman - Update-37545-2-0.zip",
      "uploadedUnix": "1381857916",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/529e24fca4e002937e6558ccc8bd08d80ee912fd426da4eb336789961ed277e4/analysis/1407757085/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Become%20a%20Highwayman%20-%20Update-37545-2-0.zip?fid=1000066351&ttl=1535817307&ri=8192&rs=8192&setec=01d198df45aa9f3f4b7c109824a50de8"
    },
    {
      "fileId": "1000108483",
      "name": "Become A Highwayman - Bandit Necklace",
      "version": "Z",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Become A Highwayman - Bandit Necklace-37545-Z.zip",
      "uploadedUnix": "1399677676",
      "modVersion": "Z",
      "virusScanUrl": "https://www.virustotal.com/file/a917827fa7883f3daebdb9e76a4c2da306027c9308963a4c17b310ce63226c82/analysis/1408069984/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Become%20A%20Highwayman%20-%20Bandit%20Necklace-37545-Z.zip?fid=1000108483&ttl=1535817308&ri=8192&rs=8192&setec=bc538d815a0a8ef0126ea62e8fe7a231"
    }
  ]
}