{
  "modId": 37558.0,
  "modName": "Follower Adla Raf",
  "summary": "Adds a new magic-wielding follower into The Bannered Mare in Whiterun. ",
  "descriptionHtml": "Adla Raf got her beginnings in some other mod, some time ago. I don\\'t know whose idea she was, or where she came from, but while browsing the Steam discussion forum for Skyrim, I came across a post called \\\"Ghost in My Machine?\\\"\r\n\r\nSomeone was having trouble with a follower they had for a very short time. They had no idea where they came from or what they were doing there, but it was almost like a creepypasta in the way it was setup. While searching through some containers in The Bannered Mare in Whiterun, someone called out to the player. It sounded so close that the player looked behind her before realizing it came from the game. Behind her character was a woman standing there. Adla Raf had this very dark complexion, almost like a dark elf, but was clearly of human race. Her hair was a bright blonde color. She was apparently very good with magic and blew through groups of bandits like they were nothing. Clearly modeled after Faralda from The College of Winterhold, she wore the same clothing, and used many of the same spells. But, suddenly, one day she just disappeared from the game, for no apparent reason. Gone forever, well, at least until I decided that I needed to help the young lady who encountered her. I am certainly not a great modder, but I did what I could to recreate Adla Raf the best I could, and this is what I came up with.\r\n\r\nSo, Adla was clearly modeled in some way after Faralda from the College of Winterhold. I gave her many of the same spells that Faralda uses, and some similar behaviors. I tried not to make her too overpowered, but still a useful mage character. Retrace her steps, enter The Bannered Mare in Whiterun, and perhaps you will run across her.\r\n\r\nSo, if you download this, I hope you enjoy. Thanks for reading.",
  "categoryId": "96",
  "version": "1.0",
  "author": "TearsOfCrimson",
  "createdUnix": "1372104893",
  "updatedUnix": "1372104822",
  "containsAdultContent": false,
  "uploadedBy": "TearsOfCrimson",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035633",
      "name": "Follower Adla Raf",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Follower Adla Raf-37558-1-0.rar",
      "uploadedUnix": "1372104822",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f7129987f321f7172e37e010ccd30124d450d443c28586b8ce1bcf8a28a38bdd/analysis/1407615502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Adla%20Raf-37558-1-0.rar?fid=1000035633&ttl=1535817326&ri=8192&rs=8192&setec=29f6caa1efb5a5f23ef2d6dda395acba"
    }
  ]
}