{
  "modId": 37554.0,
  "modName": "SkyEx  Your Skyrim Loot Shipping and Storage Solution",
  "summary": "SkyEx Your Skyrim Loot Shipping and Storage Solution \r\nEver want to \\\"Ship\\\" items to different locations? Tired of having to \\\"drop\\\" items just use the carriages, or fast travel, never have to choose between taking the Dwemmer Armour over the Steel Plate again. Is being over-encumbered a way of life for you? Well my friend SkyEx is here to help",
  "descriptionHtml": "[heading][size=42][color=#004dbb][b]Sky[/b][/color][color=#c0c0c0][b]Ex[/b][/color][color=#c0c0c0][b][/size]   Your Skyrim Loot Shipping Solution [/b][/color][color=#8000ff][b]   Subsidary of The East Empire Trading Co.[/b][/color][/heading]\r\n\r\n************************SkyEx Hearthfire Edition Added (see below for details)*********************\r\n\r\n\r\nIntroducing Skyrim Express Shipping! or SkyEx \r\n\r\n\\\"Your Skyrim Loot Shipping and Storage Solution.\\\"\r\n\r\nThe Travel Carriages are a wonderful safe way of traveling through wonderful lands of Skyrim, except if you are over-encumbered, then you have to choose what item(s) you need to drop. \r\nWell with SkyEx all you do is pay a nominal fee and your items will be sent along with you when you travel. Look for our SkyEx East Empire crates at each of Travel Carriages, pay the fee, add your items, and at the end your journey, your items will be waiting for you . \r\n\r\nRemember SkyEx \\\"Your Skyrim Loot Shipping and Storage Solution\\\"\r\n\r\nHow it Works: \r\n\r\nThere are 3 types of \\\"Shipping\\\" with SkyEx.\r\n\r\n[size=20]1) SkyEx Carriage Storage [/size]\r\n\r\nThere are East Empire Trading Company crates, now known as SkyEx Carriage Storage attached to the undersides of each of the 5 main travel carriages. \r\n\r\nSelect the crate, pay the Delivery fee, add as many items as you like. Talk to driver and select one of the 5 main Hold Capitals, and board the carriage. When you arrive just select the SkyEx Carriage Storage and pay the additional Imperial Transportation Tax to retrieve your items. \r\n\r\n[size=20]2)  SkyEx Home Delivery Service[/size]\r\n\r\nYes you heard right SkyEx now has Home Delivery Service. You can now have your loot shipped directly to your home. \r\nBeing a homeowner in Skyrim, is a privilege that few will ever know, mostly afforded to the most honored of our citizens, doing good deeds and helping the fine people of the Holds, may well win you a Thaneship, a lovely home and now personal delivery. \r\n\r\nYou must own at least ONE home in the five Holds, to access any of the SkyEx Home Delivery boxes.  There is a SkyEx Home Delivery Service Key just inside the doorway of each of the 5 purchasable homes. (Hearthfire Homeowners will find the Key in the chest outside)\r\nSame as the SkyEx Carriage Storage, select the SkyEx Home Delivery box that is next to the door of your home, pay a nominal delivery fee, make sure you have the SkyEx Home Delivery Service Key in your possession, (you will be charged with or without the the key) add your items, travel to one of the other SkyEx Home Delivery Service equipped homes, pay the Imperial Mail Tax to obtain the items you shipped. \r\n\r\nAre you moving from Whiteruns\\' Breezhome to the big city of Solitude and it\\'s most prominent address of Proudspire? \r\nWe have you covered, just dropped all of your household goods and treasures in the Breezehome SkyEx Home Delivery box, travel to Solitude, and all of your items will be waiting for you in the Proudspire SkyEx Home Delivery box, it is that simple.\r\n\r\n[size=20]3) SkyEx Merchant Shipping and SkyEx Shipping Centre[/size]\r\n\r\nShip your items to any General Goods Merchant in Skyrim.\r\nSame as the above services, you pay a nominal delivery fee to access the SkyEx Merchant Shipping box, travel any General Goods merchant in our network, pay the Imperial Commerce Tax and retrieve your items.  \r\n\r\nYou also have access to ALL three services with our SkyEx Shipping Centre in these locations.\r\nThis is where your Imperial Tax dollars are being spent, this is your one stop shop for ALL your shipping needs, at the SkyEx Shipping Centre.\r\nSkyEx Carriage Storage, SkyEx Home Delivery, and SkyEx Merchant Shipping are located in each major General Goods Merchant.\r\n\r\n\r\n__________ End of Roleplaying____________\r\n\r\nNow Available Over at the Steam Workshop  [url=http://steamcommunity.com/sharedfiles/filedetails/?id=155705026]http://steamcommunity.com/sharedfiles/filedetails/?id=155705026[/url]\r\n\r\n\r\n\r\nFAQ:\r\nJust needs Skyrim No DLC\\'s required For Full Version\r\n\r\nHearthfire Required for SkyEx - HearthFire\r\n\r\n*****The Hearthfire Home Delivery Key is in the chest outside near the Home Crafting Table********\r\n\r\nThis mod is a “Cloud Storage” system. So when you store items the SkyEx boxes you are actually storing them in a chest that is located in a hidden cell. There only 3 chests: Carriage, House, and Merchant. So when you stick items in a Carriage SkyEx box those items are only accessible from another Carriage SkyEx box, same with House and Merchant. So remember where you put things. All 3 chests are “Player Chests” so they will not re-spawn, and are safe for long-term storage.\r\n\r\nI made this mod because, I like being immersed, in this game, and being that I use mods that, reduce my carry weight, and don\\'t let me travel when I am encumbered. This is my solution to getting around. There are other mods that let you create “Magic Chests” or access your remote inventory anywhere, those are great, but I like realism, and I think this mod does it an original way. \r\nSo I made the the Carriage SkyEx system, then I thought you could also use this with the houses, mostly moving things from house to house or having a way to access you items in each major city. \r\nI also use economic mods that change local prices, and items, so I added the SkyEx Merchants boxes, So I could buy say silver in Markarth, “ship it” in the merchant box to Riften, and then sell it for a profit all without having to carry all those heavy ingots clear across Skyrim.\r\n\r\n\r\nThe idea of using the Cloud Storage came to me after I watched a Creation Kit Tutorial by Darkfox127, he also wrote the original scripts for this mod. He has a great website for his own mods and tutorials you should check it out. [url=http://darkfox127productions.weebly.com/]http://darkfox127productions.weebly.com/[/url]\r\nInstallation:\r\n\r\nAutomatic Instillation: \r\nI recommend Nexus Mod Manager, as it has been tested with this awesome program. \r\n\r\nManual Instillation:\r\n\r\nJust drop the SkyEx files into your Data folder,\r\nand make active with Skyrim launcher.\r\n\r\n\r\nUninstall:\r\n\r\nAutomatic Uninstall:\r\n\r\nUse Nexus Mod Mangaer to uninstall \r\n\r\n\r\nManual Uninstall:\r\n\r\nJust delete the SkyEx.esp from your Data folder\r\n\r\n\r\nCredits:\r\n\r\nDarkfox127 for his Youtube Creation Kit Tutorials and with making the scripts for this happen. You are a King! \r\n\r\nAdipsycho for beta testing and idea bouncing.\r\n\r\n",
  "categoryId": "53",
  "version": "1.0",
  "author": "Fallhammer",
  "createdUnix": "1372251774",
  "updatedUnix": "1372824051",
  "containsAdultContent": false,
  "uploadedBy": "Fallhammer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035904",
      "name": "SkyEx Your Skyrim Loot Shipping and Storage Solution",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "SkyEx Your Skyrim Loot Shipping and Storage Solution-37554-1-0.rar",
      "uploadedUnix": "1372251738",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9e83c1241587b160d51a5b5e5f8aef930e412aba4edc3ddd53db61c22f49e8cd/analysis/1407617827/",
      "changelogHtml": " June 26th 2013\r<br />\r<br />Version 1.0 of SkyEx Full version Added Main File \r<br />\r<br />Version 1.LiteV1 added SkyEx Lite No Shipping Centre only Carriages, Houses and Merchant Boxes\r<br />\r<br />Version 1.LiteV2 added SkyEx Lite Carriages and Houses only NO merchants or Shipping Centre\r<br />\r<br />Version 1.LiteV3 added SkyEx Lite Carriages only NO Houses, Merchants or Shipping Centre (most compatible version) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyEx%20Your%20Skyrim%20Loot%20Shipping%20and%20Storage%20Solution-37554-1-0.rar?fid=1000035904&ttl=1535817318&ri=8192&rs=8192&setec=ce5ad39485f04604affe073be5fea57b"
    },
    {
      "fileId": "1000035927",
      "name": "SkyEx Lite No Shipping Centre",
      "version": "1.LiteV1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "30",
      "fileName": "SkyEx Lite No Shipping Centre-37554-1-LiteV1.rar",
      "uploadedUnix": "1372260628",
      "modVersion": "1.LiteV1",
      "virusScanUrl": "https://www.virustotal.com/file/dc6f2e014b74a4cdf718c222fe712c4156f9b4303fa174ba819ff804474a35cf/analysis/1407617986/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyEx%20Lite%20No%20Shipping%20Centre-37554-1-LiteV1.rar?fid=1000035927&ttl=1535817319&ri=8192&rs=8192&setec=058ffc775dcef4689a3644d25ff1673a"
    },
    {
      "fileId": "1000035928",
      "name": "SkyEx Lite Carriages and Houses NO Merchants",
      "version": "1.LiteV2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "30",
      "fileName": "SkyEx Lite Carriages and Houses NO Merchants-37554-1-LiteV2.rar",
      "uploadedUnix": "1372260951",
      "modVersion": "1.LiteV2",
      "virusScanUrl": "https://www.virustotal.com/file/1f093089d51a844f482b1c7e1b70d19280c4aa5aab3f2c30c97bee853cef47b1/analysis/1407617986/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyEx%20Lite%20Carriages%20and%20Houses%20NO%20Merchants-37554-1-LiteV2.rar?fid=1000035928&ttl=1535817319&ri=8192&rs=8192&setec=a0e19354657f71fc5e84c90c2d355cc8"
    },
    {
      "fileId": "1000035929",
      "name": "SkyEx Lite Carriages ONLY ",
      "version": "1.LiteV3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "42",
      "fileName": "SkyEx Lite Carriages ONLY -37554-1-LiteV3.rar",
      "uploadedUnix": "1372261128",
      "modVersion": "1.LiteV3",
      "virusScanUrl": "https://www.virustotal.com/file/b10ff22d47038e1febae30e4289a59599b423deabdaea399639d42dd740ce124/analysis/1407618142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyEx%20Lite%20Carriages%20ONLY%20-37554-1-LiteV3.rar?fid=1000035929&ttl=1535817320&ri=8192&rs=8192&setec=fc7e2277c0bc9a945c0291139deb9de0"
    },
    {
      "fileId": "1000037011",
      "name": "SkyEx - Hearthfire",
      "version": "1.0Hearth",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36",
      "fileName": "SkyEx - Hearthfire-37554-1-0Hearth.rar",
      "uploadedUnix": "1372824051",
      "modVersion": "1.0Hearth",
      "virusScanUrl": "https://www.virustotal.com/file/62e7f3985170d923a579448ed68ec2e3375a3b8108b6660e251dbad7c62d6127/analysis/1407629462/",
      "changelogHtml": " SkyEx - Hearthfire Added July 2nd 2013 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyEx%20-%20Hearthfire-37554-1-0Hearth.rar?fid=1000037011&ttl=1535817320&ri=8192&rs=8192&setec=de7d6c7db78b7011c23fa8eaa1c173a1"
    }
  ]
}