{
  "modId": 37574.0,
  "modName": "Simple Vlad The Impaler Follower",
  "summary": "Simple Vlad The Impaler Follower",
  "descriptionHtml": "[size=+2][center]Simple Vlad The Impaler Follower[/center][/size]\r\n\r\n[size=+1]\r\nPretty self explanatory. A little history of him, provided by Wikipedia, is at the bottom.\r\nHe is located at the entrance of Hall of the Dead Catacombs at Solitude, but not inside there.\r\nSolitude is near many vampire camps and locations, therefore, I felt it was best to put him somewhere near there.\r\n\r\nI hope that maybe in the future, once I get more of a grasp of home making, make a vampire house for him and maybe even add in a little quest or something. If you would like that, please comment and or endorse this project!\r\nIf I get enough, I may even add some custom clothes and such for him ;)\r\n[/size]\r\n\r\n[size=+1]\r\nVlad III, Prince of Wallachia (1431–1476), was a member of the House of Dr?cule?ti, a branch of the House of Basarab, also known by his patronymic name: Dracula. He was posthumously dubbed Vlad the Impaler), and was a three-time Voivode of Wallachia, ruling mainly from 1456 to 1462, the period of the incipient Ottoman conquest of the Balkans. His father, Vlad II Dracul, was a member of the Order of the Dragon, which was founded to protect Christianity in Eastern Europe. Vlad III is revered as a hero in Bulgaria as well for his protection of the Bulgarian population both south and north of the Danube. A significant number of Bulgarian common folk and remaining boyars (nobles) moved north of the Danube to Wallachia, recognized his leadership and settled there following his raids on the Ottomans.\r\n\r\nAs the cognomen \\'The Impaler\\' suggests, his practice of impaling his enemies is central to his historical reputation. During his lifetime, his reputation for excessive cruelty spread abroad, to Germany and elsewhere in Europe. The total number of his victims is estimated in the tens of thousands. The name of the vampire Count Dracula in Bram Stoker\\'s 1897 novel Dracula was inspired by Vlad\\'s patronymic.\r\n[/size]",
  "categoryId": "96",
  "version": "1.0",
  "author": "satelliting",
  "createdUnix": "1372134224",
  "updatedUnix": "1372134221",
  "containsAdultContent": false,
  "uploadedBy": "JorBinks",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035685",
      "name": "Vlad-Impaler",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Vlad-Impaler-37574-.rar",
      "uploadedUnix": "1372134221",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/10996fcfc748daaa540c2aadfac855c6dafcb25c455e354376c030d4016bcbf8/analysis/1407615962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vlad-Impaler-37574-.rar?fid=1000035685&ttl=1535817348&ri=8192&rs=8192&setec=f9a891c49ccfa4007b0d1cc6b65a63e1"
    }
  ]
}