{
  "modId": 3758.0,
  "modName": "Follower Extended",
  "summary": "Make two followers at time.",
  "descriptionHtml": "Hi all, this is my second mod, i hope you like it, now you can have a second follower with full list of commands, after all i explain:\r\n\r\n-The second follower take the dog place, so you can not have 2 followers and a dog.\r\n-I make a picture instructions to made it easy for all.\r\n-If you have my other file (setfriend or setfollower) no matters.\r\n-This work perfect with the potencial followers so you can have two Edecan at time, they dont need my mod but if you use on them was best.\r\n-This also work on that NPC you can make follower with my last mod.\r\n-If you leave one of them alone no problem, they back to normal life.\r\n-No bugs or error with NPC who give you quest.\r\n-After have two followers you can not leave the second one ( but you can change him ) only if you kill him or you attack him and flee.\r\n-Fix the problem with that NPC who flee on combat, now they come the most brave in Skyrim.\r\n-And for the momment no more, here are the instructions to change you main two followers for others:\r\n\r\n-First follower change, no problem, only ask him to leave and take other like always ( using the mod )\r\n-Second follower change ( who are the dog ) no problem, use my mod in your next follower ( bat 2follower ) and after that open console, click on target again and type \\\"forcerefintoalias animal\\\" and the second follower leave and the new one comes.\r\n-I hope that instructions help you in everything, any issue please ask me, thanks to all.\r\n\r\n-if you dont want to lose your follower just do that:\r\nopen console\r\ntype \\\"help <<Name of the NPC>> 4\\\"\r\nthere appear at the end --->NPC <<NPC name>> and ID\r\ntake that ID for example \\\"1412b\\\"\r\ntype setessential <<ID>> 1\r\nnow you can not lose your follower.\r\n\r\nThis mod work Better with my other mod \r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2176",
  "categoryId": "66",
  "version": "0.1",
  "author": "Gotika",
  "createdUnix": "1323980656",
  "updatedUnix": "1323980776",
  "containsAdultContent": false,
  "uploadedBy": "abrahan1981",
  "primaryFile": null,
  "files": [
    {
      "fileId": "10790",
      "name": "second follower",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "909",
      "fileName": "second follower-3758-0-1.rar",
      "uploadedUnix": "1323980776",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/2f728769b262712c82d42a39bc572abb543bc73aa384beba15edfd0aff1d3d6a/analysis/1406522164/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/second%20follower-3758-0-1.rar?fid=10790&ttl=1535759059&ri=8192&rs=8192&setec=5dad37903ea2a2768ad95f829883e8c0"
    }
  ]
}