{
  "modId": 37598.0,
  "modName": "phiTame",
  "summary": "Tame (virtually) any living creature or mechanical in Skyrim. Many (bears, cats, elk, etc) can also double as mounts&#33; Command them to attack NPC&#39;s, follow you, or guard an area. Can also buy (for 2x the normal cost) all standard horses to summon as desired, with shared saddle bag storage.",
  "descriptionHtml": "[b][size=5]phiTame v1.18[/size][/b]\r<br />\r<br />Requires [url=http://skse.silverlock.org/]SKSE[/url], which you should have regardless as it improves the stability of Skyrim in many ways. If for some reason you do not wish to install it then you can still use the old 1.12 version which doesn&#39;t require it (but uses the clunky old dialogue-based menu system). [url=http://www.youtube.com/watch?v=Vvo8bhS6m8I]Here is a video[/url] showing how to install SKSE. It is as simple as copying the files to your Skyrim folder.\r<br />\r<br />[u][b]NOTE:[/b][/u] All summons are managed with pristine scripting using safe cleanup (disable + delete) and will never bloat your save game.\r<br />\r<br />\r<br />[u][b]MAJOR UPDATE:[/b][/u] [b]New immersive menus that actually pause the game and function as real menus thanks to [url=http://www.nexusmods.com/skyrim/mods/57308/]SkyUILib[/url]&#33;[/b]\r<br />\r<br />[list][*][u]New Spirit Form toggle[/u] available under Combat Posture from the main menu. Switching it on will make all your combat summons ghosts, so they are easier to distinguish in melee. Switch back to Solid Form to return them to normal.[/*]\r<br />[*][u]New color text[/u] icon and notifications thanks to SkyUILib.[/*]\r<br />[*][u]New horse naming system.[/u] You can now name any of your horses whatever you like&#33;[/*]\r<br />[/list]\r<br />\r<br />[youtube]oFJiu5sU8wQ[/youtube]\r<br />\r<br />[youtube]W1kdKCaDVpM[/youtube][youtube]tHMOTyNH224[/youtube]\r<br />\r<br />\r<br />[u][b]UPDATE:[/b][/u][b] [url=http://www.youtube.com/watch?v=TGUKX1XtMS0]Added spell tomes[/url] that teach the various summons to the random hunter NPC&#39;s you encounter throughout the world as an alternate means to learn new companion creatures.[/b]\r<br />\r<br />Many of you may recall a similar mod I wrote for Oblivion titled &#34;Phinix Master Summon,&#34; which allowed you to learn many custom summon spells as you leveled up (just about every creature in the game), and give them commands to attack, patrol an area, teleport back to you, etc. Well, this mod picks up where that mod left off, only vastly expanding on the added features and immersion of the original, creating an entirely new and unique experience.\r<br />\r<br />This time instead of simply learning spells as you level, phiTame for Skyrim works like a true Hunter/Pet overhaul, where you actually have to encounter and &#34;tame&#34; a creature in the wild before you can command it as your companion&#33; As you level you will be able to tame and command higher level creatures, as well as command multiple companions simultaneously. Also as an added bonus, many of your tamed companions will also double as mounts&#33;\r<br />\r<br />There are many balancing steps taken to ensure maximum immersion and playability which will be discussed at length later on, but first I want to cover some of the basic features of the mod to give you an idea what you can expect.\r<br />\r<br />\r<br />[u][b]INSTALLATION:[/b][/u]\r<br />\r<br />There are no loose files to worry about. Everything is packed neatly into a .BSA archive, so installation is as simple as copying over the .ESP and .BSA files from the version you choose to use to your Skyrim Data folder and checking the .ESP in your mod list. In the latest version I have separated the versions into their own downloads so that you can use NMM to install in one click.\r<br />\r<br />There are four versions of the mod included in the main download (choose ONLY ONE of these):\r<br />\r<br />[list][*][u]1-vanilla_only[/u] – Use if you don&#39;t have either DLC.[/*]\r<br />[*][u]2-vanilla+dawnguard[/u] – Use if you have Dawnguard but not Dragonborn.[/*]\r<br />[*][u]3-vanilla+dragonborn[/u] – Use if you have Dragonborn but not Dawnguard.[/*]\r<br />[*][u]4-vanilla+dg+db[/u] – Use if you have both Dawnguard AND Dragonborn.\r<br />[/*]\r<br />[/list]\r<br />[b]NOTE[/b]: As with all new mods, please make a backup save before installing.\r<br />\r<br />\r<br />[u][b]UNINSTALL:[/b][/u]\r<br />\r<br />To completely uninstall phiTame in a clean way, you must follow the below procedure using v1.06 or newer:\r<br />\r<br />[list][*]Load your current save WITH phiTame still checked and running.[/*]\r<br />[*]Press the &#34;~&#34; key to access the console, and type the command &#34;set phitameremove to 1&#34; (without quotes) and hit enter.\r<br />[/*]\r<br />[/list]\r<br />You will get a message saying that all scripts were stopped successfully. Afterwards, create a new save and exit. Uncheck phiTame from your mod list, load this new save, and save again. The mod will now be completely removed.\r<br />\r<br />\r<br />[b]FEATURES:[/b]\r<br />\r<br />[b][i][u]Menu and Spells[/u][/i][/b]\r<br />\r<br />When you first load the mod a set of basic spells will be added to your list as lesser powers. These include:\r<br />\r<br />[u]PT – Main Menu:[/u] This will bring up the main configuration menu for the mod, where you can define the companions you want to assign to each summon slot, set the combat posture of your companions (whether you want to allow your target spell to make them attack any, or only hostile targets), as well as instantly &#34;Teleport Recall&#34; your active summons to you and reset their follow behavior, or &#34;Dismiss All&#34; active summoned companions. There is also an option to &#34;View Config&#34; which will show you a list of which companions are currently assigned to which slots, and you can &#34;Clear Slots&#34; from here as well, which will dispel all currently active summons and clear all your available slots.\r<br />\r<br />[u]PT – Summon All Active:[/u] This will summon all companions currently defined in an available slot. Each summon costs 20% of your effective Stamina (after buffs), so if you don&#39;t have enough stamina your summon will fail. This spell is intelligent and spam-able, meaning that if have three slots and a summon defined in each, but two are already active, the spell will only summon the one that is inactive and charge you a stamina penalty of only 20% for just the one. If all three were inactive, it would summon all three and charge you a 60% stamina penalty (20% x 3). Also, if you were summoning all three but only had enough stamina for two, the spell is smart enough to know this and summons however many you have the stamina for at the time.\r<br />\r<br />[u]PT – Summon Slot (1-5):[/u] Much like the above, these summon INDIVIDUAL slot summons only, for hotkey purposes. As you level more slots will become available to you; you will get a message when you level up to the required level for a new slot and these spells will be automatically added. When you start as a level 1 character, you will have only 1 slot, and you will see PT-Summon Slot 1 in your powers list.\r<br />\r<br />[u]PT – Summon Slot Horse:[/u] The mod contains a special mechanic that allows you to purchase permanent horses from each of the major holds, and summon them at will. You define the horse slot through the Main Menu just like a normal summon, however there is a separate slot and list specifically for horses, and this spell will summon your currently defined horse. To purchase a horse and add it to your list, visit the stables of a major hold and cast the Tame spell (see below) at the saddled horse standing outside, and you will get a menu to purchase them for 2000g.\r<br />\r<br />[youtube]PrpLyQqGgYI[/youtube]\r<br />\r<br />\r<br />There are two additional spells which are automatically added to your Alteration list:\r<br />\r<br />[u]PT – Creature Tame:[/u] This is the spell you will use to tame creatures you encounter (or purchase stabled horses). Simple cast this Concentration spell constantly at the target creature. You will see a spell effect play on them, indicating the tame is &#34;in progress.&#34; So long as you cast your magicka will drain, and a timer will count down 6 seconds required for a successful tame. If you stop casting for too long, select something else, or lose targeting your summon timer will reset. Also, if a particular target is too high level or cannot be tamed you will see a message to that effect.\r<br />\r<br />[u]PT – Attack Command:[/u] This is the spell you will use to tell all of your active summons that are in follow mode to attack the target of your spell. By default this spell is in &#34;Only Target Hostiles&#34; mode, meaning if you cast it at a friendly you will get a message telling you they are non-hostile and you summons will not attack them. This &#34;Combat Posture&#34; can be set to allow all targets from the main menu spell. Additionally, if you cast this spell while sneaking, you will perform a special &#34;Teleport Attack&#34; which charges you 10% of your total Magicka per active summon in follow mode that is more than 512 game units from the target to teleport instantly to that target and begin combat. If you cast while not sneaking, summons will simply run up to the target and attack as normal with no magicka penalty. Casting the spell at a target while your summons are already in combat will tell them to stop attacking their current target and go after this one instead.\r<br />\r<br />\r<br />[i][b][u]Attack Command and Crime[/u][/b][/i]\r<br />\r<br />There is an additional mechanic with the Attack Command targeting spell which relates to crime. Since you have the option to allow &#34;All Targets&#34; under Combat Posture on the main menu, the mod is intelligent enough to know if that target is a friendly that you would normally incur a crime penalty for attacking. If you are seen commanding your summons to attack such a target, you will get the appropriate crime penalty (assault, murder, etc.) just as if it was you that attacked them. HOWEVER, there is a sneak mechanic where if you tell your summons to attack a target while sneaking AND hidden, and nobody sees you do it, you will not incur ANY crime penalty&#33; Keep in mind this calculation is very intelligent, and will give you the crime not only if you are seen by the target, but ANY crime-reporting target within a radius line of sight to the target when you cast it. This creates an interesting skill dynamic for sneak types.\r<br />\r<br />\r<br />[b][i][u]Individual Summon Commands[/u][/i][/b]\r<br />\r<br />Activating any of your active summons (including horses) will bring up a summon-specific menu allowing you to issue them commands. Options for most summons include:\r<br />\r<br />[u]Dismiss[/u]: Will dismiss only the currently selected summon.\r<br />\r<br />[u]Follow Me[/u]: Puts the summon in follow mode, which is a special scripted follow-AI. They will follow you through doors, fast travel, and world space changes, and if they get too far behind will automatically teleport back near to you so you never have to worry about losing them&#33;\r<br />\r<br />[u]Wait Here[/u]: Tells this summon to remain at the current location. They will wander around the immediate area but will not stray far (no more than 512 game units which is a very small distance.) They will do their normal behaviors like sit, sleep, groom, eat, etc., and if a hostile approaches their agro radius they WILL attack to defend the area, however immediately return to the spot they were told to wait when combat ends (or dispel automatically if they die.) NOTE: Summons told to &#34;Wait Here&#34; will NOT follow you through doors/cell changes, and will NOT attack a target of your Attack Command. You CAN however recall them to you from wherever they are with the &#34;Teleport Recall&#34; spell from the main menu, which automatically puts them back in follow mode.\r<br />\r<br />\r<br />[b][i][u]Notes on Mounts[/u][/i][/b]\r<br />\r<br />[u]Ride[/u]: There is an additional option for certain special summons (bears, cats, deer, elk, chaurus reapers, giant spiders) that will allow you to &#34;Ride&#34; the selected summon as a mount&#33; Mounted combat works just as it does on a horse, and you dismount the same as you normally would.\r<br />\r<br />[u]Saddle Bags[/u]: For horses, there is another additional option for &#34;Saddle Bags.&#34; This will bring up a special shared storage which can be accessed from ANY of your horses. So, if you put a bunch of items in the saddle bags of your Black Horse, dispel it, and summon your Palomino, you will still be able to access all the same items. Also, in addition to being able to tell horses to follow you or wait in a specific spot like all mods, they will also intelligently avoid combat, and retreat to a safe area until you exit combat, at which point they will return to following you.\r<br />\r<br />\r<br />[b][i][u]Summon Lists[/u][/i][/b]\r<br />\r<br />When you first start out, all of your lists will obviously be empty, with the exception of a Dog companion available in your Novice list as a starter companion. As you travel the world and encounter creatures which can be tamed (nearly all living animal type creatures or mechanicals), and use your Creature Tame spell on them, you will get a message on successful tame indicating what list they were added to (Novice, Apprentice, Journeyman, Expert, or Master) depending on how strong the tamed creature is, and they will then be available in that list henceforth to set to an available slot through the main menu.\r<br />\r<br />Just as you will not have all 5 (the maximum number) of slots available starting out, there are also balancing limitations placed on how high of a creature you can place in a given slot. (When assigning slots you MUST assign lower slots before higher ones can be set.) So for example as level 1 you will get a message if you try assigning a Master level summon to slot 1 that you can only assign Apprentice and lower summons to this slot at your current level. As you level up, higher level summons become available to assign to higher level slots.\r<br />\r<br />You will have to experiment with combinations of available summons at each level to find a mix that works best based on what is available to you. Always try to locate and tame level-appropriate creatures as soon as possible, as you will of course want the most powerful summons available at your level&#33;\r<br />\r<br />\r<br />[b][i][u]Multiple Summons[/u][/i][/b]\r<br />\r<br />As you level up and gain more slots you will be able to assign and command multiple summons at once. You CAN set the same summon to multiple slots, assuming that each slot allows that level of creature to be assigned to it at your current level. Newly tamed creatures are highlighted white in your lists, and once they have been assigned once appear grey (game engine feature). You can still assign a grey name in your list to any slot just as normal.\r<br />\r<br />\r<br />[u][i][b]A further note on balance[/b][/i][/u]\r<br />\r<br />I realize I left out some important details up to now. I want to ensure players there are MANY painstaking balancing steps that went into the building of this mod, to ensure that it doesn&#39;t overpower your character.\r<br />\r<br />Firstly, you start the game with only one &#34;slot&#34; to assign creatures you have tamed as mentioned above. Furthermore, there are five &#34;tiers&#34; (novice, apprentice, journeyman, expert, and master) that creatures are assigned to when you tame them, based on their strength. You can only assign certain tier levels of creatures to certain slots at certain levels. This increases as you level up. You also get more slots as you level up.\r<br />\r<br />For example, at level 1 you have 1 slot and can only assign novice or apprentice level creatures to it. At level 10 you get a 2nd slot (and so can summon two things at once), and you can now assign up to journeyman level to slot 1 and up to apprentice in slot 2. This continues to increase up to a total of 5 slots, and the level of creature you can assign to each also increases even after that as you continue to level up.\r<br />\r<br />Creatures will level up with you, but only to a certain point depending on their tier. Novice level up to 8, apprentice level to 16, journeyman level to 24, expert level to 32, and master level to 54.\r<br />\r<br />At level 80 your character will be able to summon several master and expert level creatures at once, and they will level up to 54 and 32 respectively, which based on how the game scales difficulty and defensive stats makes them viable to face all content you will face at that level (particularly as most things in the game are capped and will not level past this point either).\r<br />\r<br />\r<br />[u][i][b]List of all tamable creatures[/b][/i][/u]\r<br />\r<br />[u]Novice creatures:[/u]\r<br />Dog, Fox, Deer, Husky, Skeever, Mudcrab, Elk, Netch Calf, Albino Spider, Frostbite Spiderling, Ash Hopper, Vale Deer\r<br />\r<br />[u]Apprentice creatures:[/u]\r<br />Wolf, Red Wolf, Arctic Fox, Bristleback, Jumping Frost Spider, Jumping Flame Spider, Jumping Poison Spider, Jumping Shock Spider, Snow Spiderling, Albino Skeever, Giant Mudcrab, White Stag, Horker\r<br />\r<br />[u]Journeyman creatures:[/u]\r<br />Troll, Spriggan, Sabre Cat, Black Bear, Bull Netch, Ice Wraith, Frostbite Spider, Frost Cloaked Spider, Flame Cloaked Spider, Poison Cloaked Spider, Shock Cloaked Spider, Chaurus Hunter, Snow Spider, Dwarven Spider\r<br />\r<br />[u]Expert creatures:[/u]\r<br />Chaurus, Ice Wolf, Brown Bear, Frost Troll, Betty Netch, Burnt Spriggan, Vale Sabre Cat, Snowy Sabre Cat, Spriggan Matron, Giant Frostbite Spider, Dwarven Sphere\r<br />\r<br />[u]Master creatures:[/u]\r<br />Snow Bear, Chaurus Reaper, Giant Snow Spider, Dwarven Centurion, Dwarven Ballista, Spriggan Earth Mother\r<br />\r<br />\r<br />That should cover all the basic functionality in a nutshell. \r<br />\r<br />This mod represents a significant investment of time and intellectual labor on my part, with many thousands of lines of code. While you are free to download this mod for your own personal enjoyment, you may NOT under any circumstances re-upload it anywhere or cannibalize pieces of it for your own mods. If you would like help on a similar project you are working on please PM me and I would be happy to assist you.\r<br />\r<br />Thanks, and I hope you enjoy the mod&#33;\r<br />\r<br />Mod/design © Copyright 2013, J.Keene/Phinix, All rights reserved.\r<br />(Below copyright is for the hosting website, not this mod&#33;)",
  "categoryId": "65",
  "version": "1.18c",
  "author": "Phinix",
  "createdUnix": "1372270495",
  "updatedUnix": "1414353542",
  "containsAdultContent": false,
  "uploadedBy": "phinix",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000131068",
      "name": "phiTame v1.12 (obsolete)",
      "version": "1.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1978",
      "fileName": "phiTame-37598-1-12.zip",
      "uploadedUnix": "1413339927",
      "modVersion": "1.12",
      "virusScanUrl": "https://www.virustotal.com/file/7730d396cd50f7a82bb965dc0012ee3ffa890c258e4c05a8ca6a0e36d825c535/analysis/1413340023/",
      "changelogHtml": " Modified tame script slightly to fix rare instances where a creature without a defined base object in the editor might not register as a certain race. No more &#34;target can&#39;t be tamed&#34; for tamable targets. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/phiTame-37598-1-12.zip?fid=1000131068&ttl=1535817395&ri=8192&rs=8192&setec=e90fba14839e1a77f41da1617ffda0e2"
    },
    {
      "fileId": "1000132657",
      "name": "4 - Skyrim plus Dawnguard AND Dragonborn",
      "version": "1.18c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "558",
      "fileName": "4 - Skyrim plus Dawnguard AND Dragonborn-37598-1-18c.zip",
      "uploadedUnix": "1414353457",
      "modVersion": "1.18c",
      "virusScanUrl": "https://www.virustotal.com/file/0a173b17bdb8058c941730252a021dc1b3436040cc07dcb776c9991f2c3230bb/analysis/1414353543/",
      "changelogHtml": " Main menu can now be used in combat, which means the Teleport Recall function can be used even in combat to bring pets back to you. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/4%20-%20Skyrim%20plus%20Dawnguard%20AND%20Dragonborn-37598-1-18c.zip?fid=1000132657&ttl=1535817395&ri=8192&rs=8192&setec=4b4f20faad48f79b2c901d3c7c25a4ae"
    },
    {
      "fileId": "1000132658",
      "name": "3 - Skyrim plus Dragonborn only",
      "version": "1.18c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "549",
      "fileName": "3 - Skyrim plus Dragonborn only-37598-1-18c.zip",
      "uploadedUnix": "1414353484",
      "modVersion": "1.18c",
      "virusScanUrl": "https://www.virustotal.com/file/209fc564b54ab42ee5a0dbd72e9402fe44a0b229f8a64c52ea6c394114e7f55b/analysis/1414353602/",
      "changelogHtml": " Main menu can now be used in combat, which means the Teleport Recall function can be used even in combat to bring pets back to you. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/3%20-%20Skyrim%20plus%20Dragonborn%20only-37598-1-18c.zip?fid=1000132658&ttl=1535817396&ri=8192&rs=8192&setec=61ee40600edb87e83a5038720b4fbf98"
    },
    {
      "fileId": "1000132659",
      "name": "2 - Skyrim plus Dawnguard only",
      "version": "1.18c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "530",
      "fileName": "2 - Skyrim plus Dawnguard only-37598-1-18c.zip",
      "uploadedUnix": "1414353512",
      "modVersion": "1.18c",
      "virusScanUrl": "https://www.virustotal.com/file/1015d503a8aa1fa69b12d6475305bf732d342a2f458b7ce0bef34311dc2ffe41/analysis/1414353605/",
      "changelogHtml": " Main menu can now be used in combat, which means the Teleport Recall function can be used even in combat to bring pets back to you. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/2%20-%20Skyrim%20plus%20Dawnguard%20only-37598-1-18c.zip?fid=1000132659&ttl=1535817396&ri=8192&rs=8192&setec=0c5ed6296b801e0d6c8139a46ac0fead"
    },
    {
      "fileId": "1000132660",
      "name": "1 - Skyrim only with no expansions",
      "version": "1.18c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "523",
      "fileName": "1 - Skyrim only with no expansions-37598-1-18c.zip",
      "uploadedUnix": "1414353542",
      "modVersion": "1.18c",
      "virusScanUrl": "https://www.virustotal.com/file/ed609e9465f9ac039f61c0012ade2c2d51bdf6edec7996e9293c4f0999a02257/analysis/1414353662/",
      "changelogHtml": " Main menu can now be used in combat, which means the Teleport Recall function can be used even in combat to bring pets back to you. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/1%20-%20Skyrim%20only%20with%20no%20expansions-37598-1-18c.zip?fid=1000132660&ttl=1535817397&ri=8192&rs=8192&setec=7db46e45e45c05c90da438cb8da2c5d3"
    }
  ]
}