{
  "modId": 37596.0,
  "modName": "Dwemer Village plus Companion",
  "summary": "Adds a Deep Elf Settlement next to Reachwind Eyire",
  "descriptionHtml": "THIS IS REQUIRED. Download the .ESM version as that acts as a master file for it.\r\n\r\nThe Dwemer and the Falmer by Hallgarth:\r\nhttp://skyrim.nexusmods.com/mods/34536/?\r\n\r\nThis mod also requires Race Compatibility file and Dawnguard.\r\n\r\nRace Compatibility: expired6978 for Racial Compatibility. http://skyrim.nexusmods.com/mods/10165/\r\n\r\nVersion 2 now has a near complete Dwemer styled Village. These people do not have any custom AI packages as that for me is too advanced. Anybody is welcome to create daily AI packages as well as add services to them as these are a Dwemer Village resource also.\r\n\r\nI wanted to expand on Avan and saw the opportunity to add more Dwemer by using Hallgarth\\'s Dwemer race. I *may* add a Falmer one although I actually still have such a mod in the works using the vanilla Snow Elves.\r\n\r\n----\r\n\r\nAvan Dthardanz suddenly appeared outside his old homestead next to Reachwind Eyire (a Dwemer outpost that is in near perfect condition and for strange reasons, still untouched by the inhabitants of Skyrim.\r\n\r\nAvan\\'s caste in Dwemer society was reather low, being a worker who occasionally was conscripted in the Dwarven Armies to help fight in their many wars with both the Falmer and Ancient Nords.\r\n\r\nWhen his race vanished, he disappeared with them and during his time, Skyrim and the rest of Tamriel has changed in both geography and who is in change of what territory.\r\n\r\nTowards the End of 4E 199, Avan re-appeared in front of his old homestead which was in ruins but his old faithful Dwemer Spider bot managed to keep his home free from creatures, bandits and other tresspassers over these thousands of years. Avan was lucky enough that his home only needed to remove some rubble and his ancient stonework furniture was in pristicine condition. \r\nAfter a few days wondering around, avoiding the unfamiliar savages of the Reach (Forsworn) Avan found that  Nchuand-Zel (Markarth) was now in control of a Nordic force.  Nchuand-Zel  was  where his administrative authority was based. \r\n\r\nHe cautiously approached the city (thinking that a single Deep Elf would be no threat to them) and one of the Nordic guards greeted him abiet coldy \\\"Markarth does not like outsiders meddling in their business, traveller, remember that.\\\" and \\\" Welcome Bosmer, keep your nose clean and we will treat you fairly.\\\"\r\n\r\n\\\"Bosmer?\\\" thought Avan.. and thought it best to be mistaken as a Bosmer for safety reasons.\r\n Nchuand-Zel had changed. It was no longer known as its native Dwemer name save the levels below still known as  Nchuand-Zel. Markarth was the Nordic name given to it by these nord settlers.\r\n\r\nAvan found that the Nords had lived here for thousands of years and had trouble with the \\\"natives\\\" Bretons who claimed Markarth as their own..\r\n\r\nAvan did some minor trading and immediately left back home to Reachwind Eyire...\r\nThousands of years had passed since he and his people ruled the upper part of Tamriel with their Empires streaching from High Rock, Hammerfell, Skyrim and their homeland of Dwemereth or Morrowind... \r\n\r\nOver the next two years, Avan rebuilt his ancestral home as best he could by procuring Dwemer resources and items to decorate his home as well a few other items from Nords and so forth which he could not find in other local Dwemer ruins.\r\n\r\nAvan is slighty scared that he is all alone out there next to Reachwind Eyire but his trusty Spider-Bot has managed to function these long centuries... \r\n\r\nPerhaps a potential companion may appear sometime soon?\r\n\r\n-------------------\r\n\r\nThis adds a Dwemer Companion that uses the Deep Elf Custon race found here:\r\n\r\nThe Dwemer and the Falmer by Hallgarth:\r\nhttp://skyrim.nexusmods.com/mods/34536/?\r\nTHIS IS REQUIRED. Download the .ESM version as that acts as a master file for it.\r\n\r\nThis mod also requires Race Compatability file and Dawnguard.\r\nRace Compatability: expired6978 for Racial Compatibility. http://skyrim.nexusmods.com/mods/10165/\r\n\r\nAvan has his own house, armor and is located at Reachwind Eyire (Check screenshots)\r\n\r\nI may do a female Dwemer as a neighbour for Avan + you and marriable.\r\n\r\nAvan is skilled in 1handed weapons and Heavy armor. Only spell he knows is healing.",
  "categoryId": "66",
  "version": "2",
  "author": "beth",
  "createdUnix": "1372181569",
  "updatedUnix": "1372209395",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035796",
      "name": "Avan the Deep Elf Companion",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "533",
      "fileName": "Avan the Deep Elf Companion-37596-1.rar",
      "uploadedUnix": "1372183003",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/c362a99e839650c2e8a3031709de49f1d57390fdab0aa91ba58f5ec1ddae88dc/analysis/1407616866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Avan%20the%20Deep%20Elf%20Companion-37596-1.rar?fid=1000035796&ttl=1535817392&ri=8192&rs=8192&setec=9f9678f50c29db191b636c6d834c4fd4"
    },
    {
      "fileId": "1000035841",
      "name": "Dwemer Village plus Companion",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2953",
      "fileName": "Dwemer Village plus Companion-37596-2.rar",
      "uploadedUnix": "1372209395",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/df071a0408508907fd794bef1325badb315639a3c2eec25fd0aa4f9aa39396cf/analysis/1407617227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer%20Village%20plus%20Companion-37596-2.rar?fid=1000035841&ttl=1535817393&ri=8192&rs=8192&setec=e8d36a23143c2a991bd8d61bd9a9fd0b"
    }
  ]
}