{
  "modId": 37631.0,
  "modName": "Waterstone Manor",
  "summary": "Not quite Mansion size but not small either, Waterstone Manor utilizes many aspects of all DLCs. Plantable areas, crafting areas, vaults and hidden rooms are just a few of the features of this mod. ",
  "descriptionHtml": "[center][img]http://i.imgur.com/FBdOyf7.png[/img][/center]\r<br />[color=Red]NEW: New Version (1.13BETA) General fixes, Gerran should now be voiced, General work done on manor, general work done on quest dungeon.\r<br />\r<br />WARNING: if you want Waterstone to work correctly take everything out of the house, exit Waterstone, save, uninstall Waterstone, make a different save, install new version of Waterstone. You will need to re-obtain Waterstone.\r<br />\r<br />You must now go to the Winking Skeever and talk to Gerran to get Waterstone. \r<br />\r<br />Known Bug: Skyrim 2k for Solitude causes performance hits on mid to lower end systems if used in conjunction with multiple re-textures and Waterstone Manor near the manor itself. \r<br />\r<br />Wood Mannequin plugin forthcoming. No, seriously this time. \r<br />\r<br />Floating Grass Bug: This is a problem with Skyrim itself. It occurs when you lower a landmass without the proper skyrim.ini settings. The fix is very easy, just follow the instructions here: [url=http://www.creationkit.com/Floating_Grass_Fix]Official Floating Grass Fix[/url] Remember: you must make the proper changes to BOTH .ini files&#33;[/color]\r<br />\r<br />[img]http://i.imgur.com/PF9fdx4.png[/img]\r<br />A lot of people have been getting confused regarding the hidden rooms. There are 3 of them, which I nickname Talos Room, Daedric Artifact Room, and Treasure Room. A lot of people have been messaging me saying they are getting frustrated finding them. The point of a hidden room is that it&#39;s a challenge to find, however I don&#39;t want it to get to the point of utter frustration. All three rooms are located in the vault, you need 2 keys to access all three. All keys can be found somewhere in Waterstone Manor. One is shiny, another is dark. \r<br />\r<br />I ask that you give yourself an hour worth of looking to find them, then if you can look at the readme I have uploaded which gives directions to finding all three rooms. \r<br />\r<br />[color=red][b]Note:[/b] This mod requires all Official DLC&#39;s, as well as General Stores (A non-general storage version is being worked on, although I will mention there is plenty of non-GS storage in Waterstone.)\r<br />\r<br />[b]Note2:[/b] I am releasing this as a beta simply because this is my second mod and my first really big mod. The mod was cleaned prior to release and it has been tested very thoroughly, however I am not fool enough to think that there are no improvements to make or bugs to fix. Please kindly let me know what could be worked on and I will happily take your suggestion under advisement. \r<br />\r<br />[b]Note3:[/b] The vault is located in it&#39;s own cell. Those who want the house but don&#39;t want to deal with the vault don&#39;t need to use it. The usual notes for mannequins apply: Mainly enter the cell once, leave, and then you can use the mannequins as normal.[/color] \r<br />\r<br />This mod is a labor of love which originally was just &#34;my ultimate house&#34; for both myself and my roommate. After a long while working on this I realized just how large an endeavor it was. I started this near the beginning of 2013 and am still not entirely done, with some decoration and a quest mod to do yet. (A full list of what I plan on changing/adding can be found below.)\r<br />\r<br />Located in Haafinger Hold, just off the north road through the mountains and near Pinemoon Cave. Decorated in vegetation which makes sense, as well as with fountains and waterfalls (hence the name) Waterstone Manor will be a beautiful house for you to live in that is also functional. \r<br />\r<br />[img]http://i.imgur.com/v6YHkoR.png[/img]\r<br />[list][*] A Beautiful internal Greenhouse Featuring 3 Fountains and 20 plant-able spaces. [*] A kitchen with a working Hearthfire oven, butter churner, food storage and cooking pot. [*] Multiple Hearthfire Trophies, more than you would get in a single Hearthfire Home (11 small, 7 large)[*] Over 40 plant-able spaces in total. (Not including the ten at the Cabin)[*] A large Balcony with a Fountain, sitting area, and a great view of the countryside. [*] A fully functional Daedric Artifact Room. This room is hidden, a bit of looking around will let you figure out how to open it up in the vault area. This room also includes 4 Deadric shrines which work like divine shrines. [*] Around 74 Mannequins with a script that is partially borrowed from Vanilla Mannequin Script Fix and partially scripted by myself. The mannequins may change poses a bit but they will not wander and they will not take their equipment off. They also start with clothing although it is set as a skin and you can&#39;t take the clothing they have. [*] Circlet Display for all vanilla circlets. [*] Mask Display in a hidden treasure room. [*] Claw Display in above mentioned hidden treasure room.[*] Elder Scroll Special storage/display in above mentioned hidden treasure room. (Covers all 3 Elder Scrolls)[*] Full Crafting area with smithing, alchemy, and enchanting.[*] Bedroom with bed that gives full rested bonus. (Balcony access is to the right of the bed)[*] Pond with respawnable fish and critters. [*] Many decorations which are non-standard such as wall paintings and different rugs, as well as specially constructed parts of the house. [*] Features a small and challenging quest to get the key to the manor, complete with backstory accessed via journals. (See details below.)[*]Shrines to all of the divines, with Talos being in his own hidden room to fit with the fluff. [*] Exterior of the house was built with Solitude pieces and matches the size of the two top floors of the interior. [*] Exterior Garden and Vineyard with a large fountain and lighted for nighttime atmosphere. [*]Companion Compatible - Fully Navmeshed. [*]General Stores allows easy sorting and access to your stuff and is fully compatible with any other mods that use this mod, there are also plenty of normal storage chests which do not re-spawn or &#34;eat&#34; your stuff. [*]Plenty of good loot, some of which is quite valuable. A hint though: Keep a single Soul Quartz. [*]Spider Imbue Station located in dungeon. (Lore-friendly reason for it to be there.)[*]Lots of journals containing interesting lore on Waterstone to find.[*]Alchemy sorting for each individual vanilla and DLC ingredient. [/list]\r<br />\r<br />As well as Waterstone itself, there is a small Cabin made using Stroti&#39;s Cabin Resource which was re-tailored by Tamira for Skyrim. This is designed to give you a comfortable place to get your rested bonus and store your things, and features an alchemy bench, enchanting table, and a basic smithing area in the back. It is located on a small isle on Lake Illinata. It can be easily reached after exiting Helgen, taking a small detour to the lake on the way to Riverwood. Look at the note on the lampost near the Cabin for details on obtaining it. \r<br />\r<br />[img]http://i.imgur.com/qDGHpAG.png[/img]\r<br />\r<br />(New in 1.10) You first have to go to Winking Skeever and get the quest from Gerran (He is the imperial in ebony armor) and then go through Pinemoon Cave. If you try to go through Pinemoon before getting the quest the boss with the key will not show up, he will only show up once you obtain the quest. \r<br />\r<br />Note that these enemies have high level gear on them, a few perks, and level with you so any level below 15 or so you are going to have a near impossible time getting through this (it&#39;s made to be a bit of a challenge,) with the possible exception of a sneaky character.  \r<br />\r<br />[img]http://i.imgur.com/Xbc0gBG.png[/img]\r<br />[list][*]Expanding the initial quest to get Waterstone Manor so it is not so cookie cutter.[*]Expanding Gerrans lines to flush him out more.[*]Adding functionality to the dungeon, a murder mast much like the one used for Boethiah&#39;s quest, more than one hanging lunatic, ability to trap followers in one of the cells. Maybe a side quest to lock Nazeem away so you don&#39;t have to deal with him in Whiterun, ect.[*]Additional displays for jewelry and pelts. [/list]   ﻿[*]Completely redo the vault.\r<br />[list][*]Finishing the Snow Elf Dungeon located in the mountain, and make a dungeon puzzle quest to get the large library/mage area of the home.[*]Look into making the custom displays more dynamic aka add the ability to add mod circlets, treasures, and claws. Any display type should be able to hold any anything from that type, for example any claw display should be able to hold any claw not just the single claw it currently does.[*]Fix the Golden Claw Display.[*]Additional hidden rooms.[*]I will be taking a crack at adding [url=http://www.nexusmods.com/skyrim/mods/49109/?]Zahkrii Do Dovahkiin[/url] to this mod. [/list]\r<br />\r<br />[img]http://i.imgur.com/o2SyIQj.png[/img]\r<br />I would like to take some time to thank the modders who put the wonderful resources out there for anyone to use, without them this mod would not be anywhere near as nice as it is: \r<br />[list][*][b]Tamira and Stroti,[/b] for the Cabin Resource located here: [url=http://skyrim.nexusmods.com/mods/24271//?]Cabin Resource[/url] and [url=http://www.nexusmods.com/skyrim/mods/36969/?]Stroti Resource Pack[/url][*][b]yournotsupposedtobeinhere,[/b] for his Excellent Rug Resource: [url=http://skyrim.nexusmods.com/mods/17303//?]Rug Resource[/url][*][b]Yuril,[/b] for his Barrel Resource: [url=http://skyrim.nexusmods.com/mods/26035//?]Barrel Resource[/url][*][b]SluckyD,[/b] for alternate Mannequin Script, while not technically a resource it is listed as free to use, and much of it was changed in this mod: [url=http://skyrim.nexusmods.com/mods/10652//?]Vanilla Mannequin Script Fix[/url] (Note you don&#39;t require Vanilla Mannequin Script Fix for this mod although I do suggest it if your having problems with your vanilla Mannequins)[*][b]Ztree and Elinen,[/b] for their Water Plants Resource: [url=http://skyrim.nexusmods.com/mods/29486//?]Water Plants[/url][*][b]Oaristys,[/b] for his (Vital) modders Resource pack: [url=http://skyrim.nexusmods.com/mods/16525//?]Modders Resource Pack[/url][*][b]Blary,[/b] for Ingredients Drawer Resource: [url=http://skyrim.nexusmods.com/mods/30600//?]Ingredient Drawer Resource[/url][*][b]Harvey2112,[/b] for his General Stores Resource/Utility: [url=http://skyrim.nexusmods.com/mods/18340//?]General Stores[/url][*][b]Sjogga[/b] for his tutorials on scripting: [url=http://forums.nexusmods.com/index.php?/topic/754151-tutorials-without-youtoob/]Tutorials Without Youtoob Thread[/url] (links in first post of this thread.)[*][b]The_Funktasm[/b] for this excellent morrowind resource: [url=http://www.nexusmods.com/skyrim/mods/24883/?]Morrowind Style Clutter and More[/url][*][b]BrettM[/b] for his excellent couple of mods [url=http://www.nexusmods.com/skyrim/mods/43143/?] FPI Experiment Pack 1[/url] and [url=http://www.nexusmods.com/skyrim/mods/44434/?] the FPI Aquarium Kit [/url][*][b]jaderoyale[/b] for the [url=http://www.nexusmods.com/skyrim/mods/40736/?]Pottery Recolor[/url] resource. [*][b]IsharaMeradin[/b] for their [url=http://www.nexusmods.com/skyrim/mods/25890/?]Individual Item Sorting[/url] and for allowing the use of the potion sorting scripts they created. It definitely pushes the envelope.[*][b]Subtanker[/b] for his unique potion display script that displays those potions that we hardly even look at because they rarely leave our inventories for, like, [b]ever[/b].[/list]\r<br />\r<br />[img]http://i.imgur.com/Rxbvzsp.png[/img]\r<br />\r<br />With Either version make absolutely sure both the esp file and the Mesh/Textures file are active. When NMM prompts you to upgrade or overwrite choose &#34;no.&#34;\r<br />\r<br />1) Download and Install General Stores here: [url=http://skyrim.nexusmods.com/mods/18340//?]General Stores[/url]\r<br />2) Download this mod using NMM and let it install, or if you prefer download and unpack it yourself. \r<br />3) Run Boss or Loot (Waterstone Manor has been added to the BOSS list.) It should put it somewhere in the middle of the load order depending on what mods you have. \r<br />\r<br />Non General Stores Edition: Not supported for now, I will likely change this again when I get out of BETA stage.   \r<br />\r<br />[img]http://i.imgur.com/sGDWy2I.png[/img]\r<br />\r<br />If you are updating, all you need to do is download your new esp file. For the non general stores version you [u]must[/u] remove everything from the chests, go outside, save, then update. For all versions I suggest taking all weapon and mannequin displays out and saving. GS people do not need to worry about things in GS chests (specifically) at all as it is a separate mod.\r<br />\r<br />Be sure to check my notes on the top of the page for updates that are not safe during the middle of a playthrough, I will let you know when this occurs. \r<br />\r<br />[img]http://i.imgur.com/Q9JLxHI.png[/img]\r<br />\r<br />These are the mods that I use specifically in conjunction with Waterstone Manor when I play Skyrim. Not only will they drastically improve your gaming experience in Waterstone, but your gaming experience overall. \r<br />\r<br />1) [url= http://www.nexusmods.com/skyrim/mods/24359/?] bookshelf script SKSE[/url] since unlimited bookshelves is a tad outdated. \r<br />2) [url=http://skyrim.nexusmods.com/mods/29608//?]Detailed Rugs[/url]\r<br />Instead of rugs looking like they have been handed down through a generation, they look higher res and cleaner. This mod keeps to the original look and feel of each rug it replaces the texture on. \r<br />3) [url=http://skyrim.nexusmods.com/mods/26851//?]More Plants for Hearthfire[/url]\r<br />With over 40 plant-able areas this should help fill them out quite nicely. \r<br />4) [url=http://skyrim.nexusmods.com/mods/1546//?]Hybrids HD Plants and Herbs[/url]\r<br />Makes not only your plants look better, but most of the small plants in skyrim too&#33;\r<br />5) [url=http://skyrim.nexusmods.com/mods/12308//?]Sexy Solitude[/url]\r<br />Affects not only most of skyrim, but the vast majority of Waterstone as well. ",
  "categoryId": "67",
  "version": "1.13BETA",
  "author": "SpectralDragon and Pheo3309",
  "createdUnix": "1372252465",
  "updatedUnix": "1407365751",
  "containsAdultContent": false,
  "uploadedBy": "SpectralDragon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037423",
      "name": "Waterstone Manor Meshes And Textures",
      "version": "1.04Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "47283",
      "fileName": "Waterstone Manor Meshes And Textures-37631-1-04Beta.zip",
      "uploadedUnix": "1373064834",
      "modVersion": "1.04Beta",
      "virusScanUrl": "https://www.virustotal.com/file/c5167e05f37981c8b4651fd54c5e3a6d9a9d1862bd87fb0f822cef1888c8c85e/analysis/1407632306/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Waterstone%20Manor%20Meshes%20And%20Textures-37631-1-04Beta.zip?fid=1000037423&ttl=1535817443&ri=8192&rs=8192&setec=10a37185b61eb7180ee8c1cf94c263f8"
    },
    {
      "fileId": "1000090739",
      "name": "waterstone Manor Beta 1_10 No GS",
      "version": "Beta1.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "616",
      "fileName": "waterstone Manor Beta 1_10 No GS-37631-Beta1-10.zip",
      "uploadedUnix": "1389344948",
      "modVersion": "Beta1.10",
      "virusScanUrl": "https://www.virustotal.com/file/4e46fec52dec712d207aa0d838894a48d0776c3914826ac58f70d0fdc864f14c/analysis/1407879964/",
      "changelogHtml": " General Performance increase <br/> \n Mesh Changes <br/> \n Quest Added <br/> \n New, unfinished areas <br/> \n Clutter changes/improvements <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/waterstone%20Manor%20Beta%201_10%20No%20GS-37631-Beta1-10.zip?fid=1000090739&ttl=1535817444&ri=8192&rs=8192&setec=adbac6761996ade1e6dc8f39cf00d884"
    },
    {
      "fileId": "1000091983",
      "name": "patch1",
      "version": "patch1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "patch1-37631-patch1-0.zip",
      "uploadedUnix": "1390028016",
      "modVersion": "patch1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b12c926ab02756870fd0d71b7e309d1401c4fc8be84e6c4e4007c4b4a17de013/analysis/1407890893/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/patch1-37631-patch1-0.zip?fid=1000091983&ttl=1535817444&ri=8192&rs=8192&setec=ff15660279ed0566bb8c54f21124b101"
    },
    {
      "fileId": "1000099417",
      "name": "WaterstoneManor 1-11b",
      "version": "1.11b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "636",
      "fileName": "WaterstoneManor 1-11b-37631-1-11b.zip",
      "uploadedUnix": "1393750483",
      "modVersion": "1.11b",
      "virusScanUrl": "https://www.virustotal.com/file/98281bc50a2f60e1638bf963b10d1a9bba15da30ef7bf65d2d590fbfa76c935c/analysis/1407956414/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WaterstoneManor%201-11b-37631-1-11b.zip?fid=1000099417&ttl=1535817445&ri=8192&rs=8192&setec=7bf4bdae264ffd28209c22e3905daed9"
    },
    {
      "fileId": "1000099718",
      "name": "Waterstone Manor 1_11b No General Stores",
      "version": "1.11b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "641",
      "fileName": "Waterstone Manor 1_11b No General Stores-37631-1-11b.zip",
      "uploadedUnix": "1393888043",
      "modVersion": "1.11b",
      "virusScanUrl": "https://www.virustotal.com/file/0fe64bd2737ec99aedfcefe00528eb6279fa8cfbaa7a05e675dd195272363f13/analysis/1407959059/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Waterstone%20Manor%201_11b%20No%20General%20Stores-37631-1-11b.zip?fid=1000099718&ttl=1535817445&ri=8192&rs=8192&setec=7aa33f7a704729f3be68d556bdc6a45a"
    },
    {
      "fileId": "1000105532",
      "name": "Waterstone Manor 1-12 Beta",
      "version": "1.12Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "167049",
      "fileName": "Waterstone Manor 1-12 Beta-37631-1-12Beta.zip",
      "uploadedUnix": "1397898034",
      "modVersion": "1.12Beta",
      "virusScanUrl": "https://www.virustotal.com/file/6eb7144a92db76930526d05955da8508eb42e92ae47dbfe498b0ac1c216e1541/analysis/1408029014/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Waterstone%20Manor%201-12%20Beta-37631-1-12Beta.zip?fid=1000105532&ttl=1535817446&ri=8192&rs=8192&setec=addd3adef21f4b302dc267b20465022f"
    },
    {
      "fileId": "1000111313",
      "name": "waterstonequickfix",
      "version": "1.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "150",
      "fileName": "waterstonequickfix-37631-1-12.zip",
      "uploadedUnix": "1401580008",
      "modVersion": "1.12",
      "virusScanUrl": "https://www.virustotal.com/file/55630ab0055fe41ef0a64b77553d2d0bed13921e59bbec651c15adb922d6f10d/analysis/1408106126/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/waterstonequickfix-37631-1-12.zip?fid=1000111313&ttl=1535817446&ri=8192&rs=8192&setec=8599e86ee51fac5244e602bf69a27ee8"
    },
    {
      "fileId": "1000120810",
      "name": "Waterstone Manor 1.13Beta",
      "version": "1.13BETA",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "219654",
      "fileName": "Waterstone Manor 1.13Beta-37631-1-13BETA.zip",
      "uploadedUnix": "1407301263",
      "modVersion": "1.13BETA",
      "virusScanUrl": "https://www.virustotal.com/file/74a4eb265a750d2e526393e13c8b8aed488cc82977977bac2f505a168276b45f/analysis/1408382476/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Waterstone%20Manor%201.13Beta-37631-1-13BETA.zip?fid=1000120810&ttl=1535817446&ri=8192&rs=8192&setec=0db6a3141602d3b4645eaf87069fe687"
    },
    {
      "fileId": "1000120914",
      "name": "Waterstone Manor 1.13Beta Patch",
      "version": "1.13BETA",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "754",
      "fileName": "Waterstone Manor 1.13Beta Patch-37631-1-13BETA.zip",
      "uploadedUnix": "1407365751",
      "modVersion": "1.13BETA",
      "virusScanUrl": "https://www.virustotal.com/file/aa88c8cc4544b7e8335318ddd548256738885a48b65f14c5d4de42086378d828/analysis/1407369483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Waterstone%20Manor%201.13Beta%20Patch-37631-1-13BETA.zip?fid=1000120914&ttl=1535817447&ri=8192&rs=8192&setec=0ffdbdac7a5baa497ab65b16acb34c8b"
    }
  ]
}