{
  "modId": 37644.0,
  "modName": "Teilani - High Elf Spellsword Follower",
  "summary": "This High Elf follower hates the Thalmor every bit as much as any Stormcloak!",
  "descriptionHtml": "I decided to upload my first attempt to make a follower, so here she is.\r\n\r\n==CHARACTER BACKSTORY==\r\n\r\nTeilani was a happy youth living on the Summerset Isles before the Great War.  As soon as she reached the age of consent, she became a priestess of Julianos.  However, she had grown ever worried of her father, who seemed to be growing more and more nervous with each passing day.  She would often overhear conversations between her parents over the growing aggression of the Thalmor.  \r\n\r\nThen, one day, early 4E 171, the Thalmor attacked her home, catching her father unawares.  Her mother managed to help Teilani escape the house before she was found... and from her hiding place, she witnessed the horror of the Thalmor beating, and then beheading her father.  After which, one carried the severed head and casually tossed it into a waiting cart.  The Thalmor then proceeded to arrest her mother, casually making snide remarks of her eventual rape and torture before her death, while they proceeded to burn the house down.  After they had left, Teilani tearfully ran to the headless corpse of her father and found an unusual amulet on his body... an Amulet of Talos.  She took the amulet and ran for safety as her house continued to burn.  \r\n\r\nWhen the fires had died down to embers, she returned to look for anything left of her life to salvage.  While searching, she found the remnants of an Akaviri suit of armor, as well as an enchanted Akaviri katana, which had miraculously survived the fire.  It was then that she learned the truth... her father had been a member of the Blades!  With the help of some family friends, she left the Summerset Isles and found her way to the city of Solitude in Skyrim, where lived the sisters Taarie and Endarie, who happened to be distant relatives.  \r\n\r\nLater, she would learn of the Thalmor\\'s ultimatum to the Emperor (and why they took her father\\'s head) and the start of the Great War.  It was then that she started to wear her father\\'s Amulet of Talos.  \r\n\r\nDriven by grief and vengeance, she trained under a kindly Nord warrior\\'s tutelage in the ways of the sword.  She also went to the College of Winterhold, demonstrating her skill of Restoration magic that she had learned as a former priestess, and honed her skills in Destruction and Conjuration magic. \r\n\r\nOnce she had mastered her new skills, she was preparing to join the Imperial Legion... perhaps even the Blades... to exact her revenge.  But by then it was too late.  The war was over, the Blades had been decimated, and the White-Gold Concordat had been signed.  \r\n\r\nNow all she has is her vengeance.  \r\n\r\nShe continues to hide out at the Radiant Raiment in Solitude, enjoying the irony that she\\'s hiding right under the Thalmor\\'s noses.  And she continues to wear her father\\'s Amulet of Talos and carry his sword in his memory, in spite of the treaty.  She now stands ready to face off against any Thalmor foolish enough to present himself to her... but realizes that she needs the right ally...\r\n\r\n... and then, she heard rumors of the arrival of the Dragonborn. \r\n\r\n\r\nTeilani is a very powerful spellsword who levels with the player.  She is also marriageable.  And yes, she can join the Blades.\r\n\r\n\r\nThe mods I used to give her this look as seen in the pics, but are not required are:\r\n[url=http://skyrim.nexusmods.com/mods/2666//?]Caliente\\'s Female Body Mod Big Bottom Edition[/url]\r\n[url=http://skyrim.nexusmods.com/mods/2812//?]Better Females by Bella Version 3[/url] with the no makeup texture.\r\n[url=http://skyrim.nexusmods.com/mods/36510//?]Superior Lore-Friendly Hair - HD textures[/url] by skyrimaguas.\r\n[url=http://skyrim.nexusmods.com/mods/3589//?]Natural Eyes High Res 1.3[/url] by nevenbridge.\r\n[url=http://skyrim.nexusmods.com/mods/24909//?]aMidianBorn Book of Silence[/url] by CaBaL.\r\n\r\nUPDATE:  I fixed her spell list a bit because she kept trying to use the master dual cast too often in a fight, and I changed her voice because she wasn\\'t speaking some of her dialogue with the voice I originally chose for her.\r\n\r\nNEW UPDATE:  No changes to the mod itself, but after learning that my follower can join the Blades, I decided to rewrite her background story.  This one should be much more interesting.\r\n\r\nNEWEST UPDATE:  In view of the expanded backstory, she now carries her father\\'s Akaviri Katana, and her Amulet of Talos is unique and has its own enchantment.\r\n\r\nEnjoy.",
  "categoryId": "66",
  "version": "1.2",
  "author": "CaptainRC",
  "createdUnix": "1372281259",
  "updatedUnix": "1372444550",
  "containsAdultContent": false,
  "uploadedBy": "CaptainRC",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036242",
      "name": "Teilani Expanded",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "127",
      "fileName": "Teilani Expanded-37644-1-2.rar",
      "uploadedUnix": "1372444550",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d6a0adf44eed4cc117ff6c6a5edb0a8eaf374b9a4538ae318b4424b438b64eeb/analysis/1407620704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Teilani%20Expanded-37644-1-2.rar?fid=1000036242&ttl=1535817466&ri=8192&rs=8192&setec=5c4c4b6699c9a8e3d60ba9c3fcf3b89a"
    }
  ]
}