{
  "modId": 37642.0,
  "modName": "SOS Perma Undies",
  "summary": "Adds a new Shape for Schlongs of Skyrim",
  "descriptionHtml": "Like the SOS mod for the new bulked body, but don\\'t want to see every dead bandit\\'s wang hanging out when you loot them? Or maybe you just hate seeing those nasty scaly argonian schlongs slinging around everywhere. Possibly you just want to only see your and your follower\\'s schlongs. Either way, this mod adds a new \\\"shape\\\" for the mod \\\"Schlongs of Skyrim.\\\" \r\n\r\nNow you may be thinking, \\\"But OniDeku, can\\'t I just disable the schlongification process or uninstall the addons for the same effect?\\\" No, you can\\'t, actually. If you want the underwear to still be bulged out, you\\'re going to need to use this mod. \r\n\r\nIt has it\\'s own mod menu, and shape potions for it can be bought from Bjorn. It will spawn on NPCs like any other normal addon, but if an NPC has already been \\\"schlongified,\\\" then they won\\'t spawn with it. \r\n\r\n\r\nTo make all NPCs use this addon:\r\n1. Set all other addons\\' chance of being used to 0%\r\n2. set the PermaUndies chance of being used to 100%\r\n3. Now use shape potions on NPCs that you want to be naked when, well, naked!\r\n\r\nalternatively, if you don\\'t plan on using any other addon, you can just install this one only. Just make sure when installing it that it\\'s behind all of the other SOS .esps in the load order.\r\n\r\ninstallation:\r\n1. Install Schlongs of Skyrim (http://skyrim.nexusmods.com/mods/35463//?)\r\n2. Install this mod. Make sure it comes after \\\"Schlongs of Skyrim.ESP\\\"\r\n3. When running the game for the first time you should see a message that confirms that this addon has been activated. It should also show up in the Schlongs of Skyrim mod menu.\r\n\r\nuninstallation:\r\n1. In the SOS mod menu, select the PermaUndies addon section and select \\\"remove.\\\" \r\n2. Save your game, disable the addon, \r\n3. Start the game back up.",
  "categoryId": "29",
  "version": "1.0",
  "author": "OniDeku",
  "createdUnix": "1372281370",
  "updatedUnix": "1372281362",
  "containsAdultContent": false,
  "uploadedBy": "OniDeku",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000035949",
      "name": "SOS- Perma Undies",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Perma Undies-37642-.zip",
      "uploadedUnix": "1372281362",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4e9709288c721d26681f36189906fa0da200c6bf0ecba749f94d06c4e4e6ed70/analysis/1407618242/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Perma%20Undies-37642-.zip?fid=1000035949&ttl=1535817464&ri=8192&rs=8192&setec=c5419ea9d34a6730cac9c50b0038095c"
    }
  ]
}