{
  "modId": 37662.0,
  "modName": "Project Gensokyo",
  "summary": "Trying to bring the world of Touhou into Tamriel.",
  "descriptionHtml": "**************************\r<br />ATTENTION&#33; My HDD took a dump and broke apart so I no longer have the files necessary to create the mod. I was planning on doing a big release but unfortunately all the progress is lost. If anyone wants to pick up where this mod left off you are free to do so. Especially since that one spell (power) that takes stamina instead of magicka which for some reason isn&#39;t a part of the CK. Feel free to use whatever parts in it as you wish. Maybe one day, I will return to it although, I find that highly unlikely.\r<br />***********************\r<br />\r<br />\r<br />Hey Guys, so far this has been a solo project with just me, Nohara. But I recently put a halt to the mod cause I was not home like I wanted to. But now since I am home, I am glad to announce this mod is actually underway&#33;\r<br />\r<br />This mod will so far include\r<br />-Touhou Spell Cards\r<br />If you don&#39;t know what Spell Cards are, or are new to Touhou just think of them as normal Skyrim Spells for now.\r<br />\r<br />-The Grimoire of Marisa\r<br />That&#39;s right&#33; Marisa somehow made it into Cyrodil and dropped off a book of the spells that are currently in the mod, written in her own perspective.\r<br />\r<br />-New Powers\r<br />Ever wanted to stop time like Sakuya? Well you don&#39;t have to be the dragonborn to do this. You can learn Sakuya&#39;s time stop ability and it will only drain your stamina, making you tired.\r<br />\r<br />All of these things can be found in &#39;Marisa Kirisame&#39;s Chest&#39; in the back of the Riverwood Inn.\r<br />\r<br />If you&#39;d like to contact me, cause I sometimes do have questions that often go unanswered, you can contact me on Steam.\r<br />http://steamcommunity.com/id/ConkerSe7en",
  "categoryId": "28",
  "version": "0.2",
  "author": "THNohara",
  "createdUnix": "1372333641",
  "updatedUnix": "1398655018",
  "containsAdultContent": false,
  "uploadedBy": "THNohara",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106960",
      "name": "Project Gensokyo",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1113",
      "fileName": "Project Gensokyo-37662-0-2.rar",
      "uploadedUnix": "1398655018",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/43538ffe02ac26eae3c09e8a0b2c4d51ea40dd4d29121bf79f6dc0c48ccdd79d/analysis/1408045278/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Project%20Gensokyo-37662-0-2.rar?fid=1000106960&ttl=1535817488&ri=8192&rs=8192&setec=bb9e5abc9d4e4c5c0c912b3c5be7ba81"
    }
  ]
}