{
  "modId": 37675.0,
  "modName": "Secrets of the Dwemer",
  "summary": "Have you ever wanted to discover the secrets of the dwarves and their power? Well now you can, discover Dwemer Schematics in Dwarven ruins that will allow you to craft weapons of unimaginable power. Also recreates Sunder, one of the legendary tools of Kagrenac.",
  "descriptionHtml": "Have you ever wanted to discover the secrets of the dwarves and their power? Well now you can, discover Dwemer Schematics in dwarven ruins that will allow you to craft weapons of unimaginable power. Also recreates Sunder, one of the legendary tools of Kagrenac. \r\n\r\nThe new weapons include: \r\n\r\nDwarven Staff of Charges: Absorb 20 magica per second. \r\n\r\nDwarven Saw \r\n\r\nDwarven Digger Drill: High amounts of bleeding damage. \r\n\r\nDwarven Bone Smasher: Breaks bones with ease, crippling opponents. \r\n\r\nDwarven Kinetic Mace: Collects kinetic energy from your heartbeat, allowing you to strike foes with incredible force. Has a chance to paralyze targets for 5 seconds. \r\n\r\nDwarven Lantern: Creates a floating ball of light for 60 seconds. \r\n\r\nSunder: Absorb 5 points of health and stamina. Slow target 50%. 25% critical hit chance \r\n\r\n\r\nI will continue to update this mod with new items, so be sure to check back every once in awhile. \r\nBe sure to leave a comment with any issues or ideas\r\n\r\nAlso check out my new Blessings of the Madgod Mod: http://skyrim.nexusmods.com/mods/38348/?",
  "categoryId": "55",
  "version": "V1",
  "author": "D0VAK11N",
  "createdUnix": "1372353427",
  "updatedUnix": "1372353386",
  "containsAdultContent": false,
  "uploadedBy": "D0VAK11N",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036070",
      "name": "Secrets of the Dwemer",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5674",
      "fileName": "Secrets of the Dwemer-37675-V1.zip",
      "uploadedUnix": "1372353386",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/c851f1a7cbef78550467cab606827d0785dbd820bb8e5beaad23f7fdae7aea8d/analysis/1407619222/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Secrets%20of%20the%20Dwemer-37675-V1.zip?fid=1000036070&ttl=1535817512&ri=8192&rs=8192&setec=b374ca80e562edade4020b38f02e2a7e"
    }
  ]
}