{
  "modId": 37674.0,
  "modName": "Dark Infiltrator Armour",
  "summary": "This mod add a complete armor set for assasins or thieves, which dont need any DLCs ,is only for men and is standalone and temperable.",
  "descriptionHtml": "NO MORE UPDATES, I STOPED PLAYING SKYRIM\r<br />\r<br />English version:\r<br />\r<br />This mod add an armour pack called Dark Infiltrator, it&#39;s standalone and temperable. You will need the glass perk in order to do this.\r<br />The set is made of a cuirass (=glass stats), gloves, boots, and hood (slightly better than glass stats). You also can wear circlet while wearing the hood.\r<br />I just did the retexture, the meshes aren&#39;t mine. It&#39;s only for males and does not require any DLCs\r<br />\r<br />I took the hood from Nightingale Maskless mod, made by Lord Haun, i sent him a pm asking him to use the hood, but the last time he entered in the nexus pages was a year ago, so if he don&#39;t approve it I will delete this mod.\r<br />Hood not compatible with elves, orcs, and khajiitas, if you want so use his mod: http://skyrim.nexusmods.com/mods/5130//?\r<br />\r<br />I hope you enjoy it, (this is my first armour mod, criticisms are wellcome)\r<br />\r<br />Magnalenian\r<br />\r<br />Español:\r<br />\r<br />Hola muy buenas, aqui les traigo mi primera armadura: El Infiltrado Sombrío, un pack compuesto por  armadura, capucha, botas y guantes, con unos stats algo mejores que los del cristal (mínimamente mejores). Se necesita la mejora de herrería de cristal para que aparezca para fabricar en la forja. Es completamente standalone y mejorable. Yo solo hice el re-texture, los meshes no son mios.\r<br />\r<br />La capucha la tomé prestada del mod de Lord Haun Nightingale Maskless, a quien escribí para pedirle permiso, pero la ultima vez que se conectó fue hace un año, asi que si no le gusta el uso que he hecho de su mod, borro el mio inmediatamente. La capucha no sirve en orcos, elfos y khajiitas, si vuestro personaje es uno de estos utilizad su mod: http://skyrim.nexusmods.com/mods/5130//?\r<br />\r<br />También podéis llevar coronas a la vez que la capucha. Esta armadura es solo para hombres y no se necesita ningún DLC para instalarlo\r<br />\r<br />Este es mi primer &#34;mod&#34;, espero que os guste y las críticas son bien recibidas. \r<br />\r<br />Un saludo, Magnalenian\r<br />\r<br />The sword that you can see in the pictures is Arisverd, from a mod that can be found here, and the horse is from the mod Swift Steeds.\r<br />\r<br />Installation/Instalación\r<br />Just extract the data folder in your: SteamSteamAppscommonskyrim and if you are going to use the translation replace the .esp with the optional one\r<br />Extraed la carpeta data en C:Program Files (x86)SteamSteamAppscommonskyrim, si vais a utilizar la traducción al inglés, sobrescribid el antiguo .esp con el optional\r<br />\r<br />Credits/Creditos\r<br />Thanks to Omegared for using his gauntlets and his boots. You can find his perfect mod here: http://skyrim.nexusmods.com/mods/10277/?\r<br />Thanks to bilwit and donker316 for uploading the Game of Thrones armours and make them open source, here is the link: http://skyrim.nexusmods.com/mods/27301/?\r<br />\r<br />Gracias a Omegared por dejarme usar sus guantes y sus botas. Podéis encontrar su magnífico mod aquí: http://skyrim.nexusmods.com/mods/10277/?\r<br />Gracias a bilwit y a donker316 por subir las armaduras de Juego de Tronos y permitir a cualquiera usarlas, aqui les dejo el link: http://skyrim.nexusmods.com/mods/27301/?",
  "categoryId": "54",
  "version": "1.0",
  "author": "Magnalenian",
  "createdUnix": "1372349649",
  "updatedUnix": "1372349562",
  "containsAdultContent": false,
  "uploadedBy": "Magnalenian",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036056",
      "name": "Dark Infiltrator Armour     Armadura del Infiltrado Sombrio",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7688",
      "fileName": "Dark Infiltrator Armour     Armadura del Infiltrado Sombrio-37674-1-0.rar",
      "uploadedUnix": "1372349479",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2ed769533f5cc7c896d0c042deef1432b3bdb2be8a6f35125120b3b8ddc0240e/analysis/1407619135/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Infiltrator%20Armour%20%20%20%20%20Armadura%20del%20Infiltrado%20Sombrio-37674-1-0.rar?fid=1000036056&ttl=1535817510&ri=8192&rs=8192&setec=8ba1a5ff2629814ad22dd0034561f89c"
    },
    {
      "fileId": "1000036057",
      "name": "English traslation",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "English traslation-37674-1-0.rar",
      "uploadedUnix": "1372349562",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8c656ed8bcdb458a524d965e891bb446236e31b0ff76a1dcd86535b5821307b7/analysis/1407619135/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/English%20traslation-37674-1-0.rar?fid=1000036057&ttl=1535817510&ri=8192&rs=8192&setec=0048c4df1c1193df05cac28240c5489f"
    }
  ]
}