{
  "modId": 37686.0,
  "modName": "Named Generic NPCs",
  "summary": "This mod gives names to many of the NPCs in Skyrim who never got them for whatever reason.",
  "descriptionHtml": "I recently bought Morrowind and played it for the first time. While there were many things I really loved about it, one of the things that struck me that most was that almost EVERYONE has a name. Each lowly bandit, useless farmer, everyone (okay, except for the guards). In Skyrim, almost every single named NPC is important to a quest. It took some of the fun out of the game, because you can&#39;t kill anyone with a name without it screwing you over later. I wanted to give those NPCs who weren&#39;t - from the wandering farmers who lost their home to the couriers who deliver your mail - a name.\r<br />\r<br />Now when you enter Helgen by cart, the carriage driver who tells you to SHUT UP BACK THERE has a name. The irritating Captain who REALLY wants to execute you has a name. When you enter caves and see bodies on the floor, those bodies have names - they were characters with families and who loved kittens and collected stamps. Not just &#34;Orc Adventurer&#39;s body LOOT IT.&#34;\r<br />\r<br />Now, I am seriously new to modding, and there were some limitations in the Creation Kit that have stumped me so far. I haven&#92;&#39;t figured out how to give most bandits names or soldiers in the Imperial or Stormcloak army (though several do now). Still, the changes however minor should add a bit of immersion to your game. When I get more familiar with the Creation Kit I&#39;ll see what I can do.\r<br />\r<br />Who got names? Basically, any NPC that has a single instance in the game got a name. For instance, all of the soldiers at Helgen in the beginning are named, any Bandit Chiefs that are limited to that ONE dungeon got a name, etc. Some NPCs that appear in more than one place were named, such as the blacksmiths for the Stormcloaks and Imperials. This might screw up some peoples&#39; immersion, but I like it that way - I think of the blacksmith as moving from camp to camp, doing what he/she can for his/her team.\r<br />\r<br />Installation:\r<br />Stick it in your data folder. This is a very simple mod.\r<br />\r<br />Conflicts:\r<br />This is basically the simplest and least game-destroying mod you can possibly make. It should be placed at the BEGINNING of the load order in case you have any other mods that edit these NPCs - however, in all my time playing Skyrim I haven&#39;t found one.\r<br />\r<br />Possible Issues:\r<br />- Some named NPCs may appear more than once in the world at the same time. I made sure, however, that they would never appear in the same PLACE at the same time. So you could go to Fort Dunstad and see Billy the Butthead, you might later on go to Fort Amol and see Billy the Butthead, but there should never be two of Billy the Butthead in one place at one time. If you kill one Billy, you might find him magically alive somewhere else. I like to think that he was playing dead. And like the Adoring Fan in Oblivion, sometimes it&#39;s fun to kill them over and over and over. I haven&#92;&#39;t experienced this in-game yet, but if you go to a Fort and suddenly EVERY SOLDIER IS BARBARA, let me know, this was obviously not intended. If you see two people named the same thing in one place (with the exception of one soldier in Helgen, nothing I can do for that poor guy), let me know and I&#92;&#39;ll see what I can do.\r<br />- Some of these NPCs are set to respawn, which is why Bethesda didn&#39;t give them names in the first place. But the immersion of them having names and respawning is better than the immersion of them being &#34;Forsworn Chap #8,&#34; so whatever.\r<br />\r<br />Future Plans for this mod:\r<br />- Do this for the three DLCs.\r<br />- Find ways to get more NPCs such as random bandits and conjurers named without screwing up the game.\r<br />\r<br />Changelog:\r<br />6/28/13 - Added Dawnguard support - Now all souls in the Soul Cairn should be named along with several vampires and other NPCs added by Dawnguard, such as the ones in the Redwater Den. Added Dragonborn support - named Haknir&#39;s crew and several other NPCs added in Dragonborn.",
  "categoryId": "78",
  "version": "1.0",
  "author": "Howabominable",
  "createdUnix": "1372387929",
  "updatedUnix": "1372455126",
  "containsAdultContent": false,
  "uploadedBy": "Howabominable",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036140",
      "name": "Named Generic NPCs",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "136",
      "fileName": "Named Generic NPCs-37686-1-0.rar",
      "uploadedUnix": "1372387738",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fb48818f469a9e7353169830692e7ceb7469b9ae6766a76fba746144a4ee3a41/analysis/1407619893/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Named%20Generic%20NPCs-37686-1-0.rar?fid=1000036140&ttl=1535817532&ri=8192&rs=8192&setec=25c7f8becf9da13ef80616c589e8cb94"
    },
    {
      "fileId": "1000036247",
      "name": "Named Generic NPCs - Dawnguard",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "20",
      "fileName": "Named Generic NPCs - Dawnguard-37686-1-0.rar",
      "uploadedUnix": "1372448917",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6004dc8c2fb5c2cf2e529daaef45d4b44cc200abe2d26d92eaad924c901bb544/analysis/1407620706/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Named%20Generic%20NPCs%20-%20Dawnguard-37686-1-0.rar?fid=1000036247&ttl=1535817532&ri=8192&rs=8192&setec=53233ca6a1647a7a49d3a20f07311080"
    },
    {
      "fileId": "1000036270",
      "name": "Named Generic NPCs - Dragonborn",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30",
      "fileName": "Named Generic NPCs - Dragonborn-37686-1-0.rar",
      "uploadedUnix": "1372455126",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9a61d8af03c4e096f2c9cb72bc9bf143c11609195fc8b6358ebbfe16c358c827/analysis/1407620823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Named%20Generic%20NPCs%20-%20Dragonborn-37686-1-0.rar?fid=1000036270&ttl=1535817532&ri=8192&rs=8192&setec=64fb4ffbce6af71ee2f237d4a5010cb0"
    }
  ]
}