{
  "modId": 37684.0,
  "modName": "Revamped Ghosts",
  "summary": "Ghost effect changer that makes ghosts look a little better.",
  "descriptionHtml": "Revamped Ghosts\r<br />\r<br />This mod alters the default appearance of ghosts in Skyrim, I always thought they didn&#39;t look scary enough and this mod aims at changing this.\r<br />\r<br />New forms have been created for the shader effects and the vanilla ghosts spells now reference these instead. The eye effect comes from a customisation of the Necro eye glow .nif (white instead of red), these are applied by a simple script in the spell effect to humanoid ghosts but not to animal ghosts.\r<br />\r<br />Warning, this mod will make ghosts much harder to see but you can make them out by their eyes.\r<br />\r<br />Requirements: This is compiled under V1.8, it should be compatible with V1.9\r<br />\r<br />Installation: Merge it with your data folder, NMM users it should happen automatically.\r<br />\r<br />Un-installation: I frown deeply at the removal of mods during a game play due to the potential damage the practice can do to your save file. Having said that the script applies the effect via a spell effect and the potential for damage is minimal. Definitely worth your while to make sure there are no ghosts around if you do remove it.\r<br />\r<br />Conflicts: Mods that try to do the same thing, I have not altered the vanilla actor ghosts entries or the vanilla script applied to them so there should be no problems from that side of things.\r<br />\r<br />Future plans: Release an extra esp that will add various spawn points around Skyrim so you can enjoy a bit more ghost hunting. ",
  "categoryId": "24",
  "version": "V1.0",
  "author": "Mindboggles",
  "createdUnix": "1372378592",
  "updatedUnix": "1372378362",
  "containsAdultContent": false,
  "uploadedBy": "mindboggles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036120",
      "name": "Revamped Ghosts",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Revamped Ghosts-37684-V1-0.7z",
      "uploadedUnix": "1372378362",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0d1a19c52c20cefc94a8e9afec3ab2aef59efed64ecf3787e4ae465f0051e435/analysis/1407619816/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Revamped%20Ghosts-37684-V1-0.7z?fid=1000036120&ttl=1535817529&ri=8192&rs=8192&setec=b2ffba1e1c323439ca27f4cda626d74e"
    }
  ]
}