{
  "modId": 37716.0,
  "modName": "Somber ENB",
  "summary": "Moody Cinematic ENB built on latest ENB binaries.",
  "descriptionHtml": "[center][img]http://i.imgur.com/lO9wMjm.jpg[/img][/center]\r<br />\r<br />[center][img]http://i.imgur.com/9jQKObK.png[/img][/center]\r<br />\r<br />The Somber series of ENB presets are based off of UnrealWarfare&#39;s [url=http://skyrim.nexusmods.com/mods/37202/?] Unreal Cinema ENB[/url], a powerful cinematic ENB and a source of inspiration for many ENB authors.  In the Somber series, Tansarville has integrated many advanced ENB effects such as &#34;Time of Day,&#34; Image Based LIghting and more.  This is not meant to be a [i]realistic[/i] ENB but rather one that depicts a [i]natural[/i] world, with colors and tones that reflect the harsh climates and immersive atmosphere of the province of Skyrim.\r<br />\r<br />[center][img]http://i.imgur.com/ae3A4kN.png[/img][/center]\r<br />\r<br />Before installing this or any other ENB preset, you must remove all files from previously installed ENB presets.  This is essential as not all presets use the same files or place them in the same locations.  Mixing files from different presets will almost always generate unwanted results.  \r<br />\r<br />Installation of Somber ENB is fairly straightforward.  All of the files you need are included in the archive with the exception of the ENB binaries ([b]d3d9.dll[/b]) and [b]enbhost.exe[/b].  These files must be acquired from either [url=http://beautifulskyrim.yolasite.com/enb-binaries.php]Beautiful Skyrim[/url] or the [url=http://enbdev.com/download_mod_tesskyrim.html]ENBdev site[/url]. It is recommended that you use the binaries from the &#34;wrapper&#34; folders first and only use the &#34;injector&#34; versions if you experience problems, such as with mobile graphics chipsets found on many laptops.\r<br />\r<br />[color=#c2a56b][b]Special Note:[/b][/color]  A new [color=yellowgreen]enbhelper.dll[/color] plugin is available for use with ENB binaries.  This plugin is required for underwater shadows and multiple weathers.  However, the code used by Somber Antique 2.x is [u][i]not compatible[/i][/u] with this plugin.  It must not be used with Somber Antique 2.x.  Failure to heed this warning will result in completely dark interiors during daytime hours.  There is currently no need to use this plugin with Somber Antique 2.x as there is no multiple weather support in this preset.  A future update will be released to address this incompatibility as well as add initial support for multiple weather configurations.\r<br />\r<br />The archive includes separate folders for each quality preset.  Simply copy the &#34;enbseries&#34; folder and the enblocal.ini and enbseries.ini files from your chosen quality version to your skyrim folder.  If you receive any messages about overwriting files, you haven&#39;t completely removed your previous ENB installation.  \r<br />\r<br />Optional Effects are available in a separate download.  The optional effects archive includes a snow effects plugin that must be activated as with any other plugin.  This plugin can be considered optional, but greatly improves the appearance of snow under an ENB.   The optional depth of field (DoF) files or the optional palettes have been provided to further customize the appearance of Somber ENB to individual tastes.  To use these files, simply overwrite the existing files in the enbseries folder with these files.  For the DoF options, you will copy the enbeffectprepass.fx file from the chosen folder.  For the optional palette, you will copy the enbpalette.bmp file.  \r<br />\r<br />The separate download &#34;Somber Antique 2 DATA&#34; includes files from Mindflux&#39;s particle patch for ENB.  These adjusted meshes and textures are meant to address the appearance of certain effects in-game when using an ENB.  Some examples of this are water foam being too bright, overly powerful light power of fog and other similar effects.  Although optional, it is highly recommended to use this file.  If you already have Mindflux&#39;s particle patch installed, however, you don&#39;t need this.  If  you prefer to use Nexus Mod manager to install/uninstall these files, you can simply add this archive as a mod in NMM.  Then you can install or remove it easily without having to worry about overwriting files from other mods.\r<br />\r<br />[heading][b][color=#c2a56b][u]SkyrimPrefs.ini[/u] changes[/color][/b][/heading]\r<br />The following edits must be made to the SkyrimPrefs.ini folder in your documents folder in order for this ENB to work properly:\r<br />\r<br />[color=goldenrod]bFloatPointRenderTarget=1\r<br />bEnableFileSelection=1\r<br />bDoDepthOfField=0 // or set to 1 to help with transparent water issues\r<br />bTreesReceiveShadows=1\r<br />bDrawLandShadows=1\r<br />bDrawShadows=1\r<br />bShadowsOnGrass=1\r<br />iBlurDeferredShadowMask=5 (for best shadow quality, no lower then 4)[/color]\r<br />\r<br />[heading][b][color=#c2a56b]Editing the [u]enblocal.ini[/u] file[/color][/b][/heading]\r<br />Open the [b]enblocal.ini[/b] file and enter your correct VRAM size (in MB) for the [b]VideoMemorySizeMb=[/b] parameter under the [b]MEMORY[/b] section.  This number should be equivalent to VRAM of your GPU.  For example, if you have a GPU with 2GB of VRAM, you will enter [b]VideoMemorySizeMb=2048[/b]  This number can be set higher than the physical VRAM but doing so may introduce instabilities due to buggy GPU drivers or other software running on your computer.  This and other settings found under the [MEMORY] section of the enblocal.ini are explained in a very helpful [url=http://home.comcast.net/~thunor/images/hosted/config/memory.html]document[/url] provided by [color=deepskyblue]wolfgrimdark[/color], the manager of the Somber ENB Lut Sepia page.\r<br />Note:  if you are using 0.243 or newer binaries, video memory is set automatically as long as you set [color=gray]ReduceSystemMemoryUsage=true[/color] in the enblocal.ini.\r<br />\r<br />[heading][b][color=#c2a56b]Disable all in-game and GPU driver-level anti-aliasing and anistropic filtering[/color][/b][/heading]\r<br />It is necessary to disable AA and AF in Skyrim and your GPU drivers to avoid graphical bugs when the ENB is active.  The anti-aliasing offered by the ENB is of superior quality than Skyrim&#39;s AA and comes at a much lower performance cost.\r<br />\r<br />[heading]In summary, this is what you need:[/heading]\r<br />[list]\r<br />[*]ENB Binaries from Beautiful Skyrim or ENBdev (Somber Antique 2.0 requires the latest binaries from ENBDev)\r<br />[*]enbseries folder and enbseries.ini and enblocal.ini files\r<br />[*]All files and folders from the &#34;Data&#34; folder installed into your skyrimdata folder\r<br />[*]Necessary edits to your SkyrimPrefs.ini file\r<br />[*]Set VideoMemorySizeMb in the enblocal.ini file or set ReduceSystemMemoryUsage=true so the ENB does it automatically\r<br />[*]Disable anti-aliasing (AA) and anistropic filteing (AF) in-game and in GPU drivers\r<br />[*]Make sure that you are [i][b]not using[/b][/i] the [color=yellowgreen]enbhelper.dll[/color] with Somber Antique 2.x.\r<br />[/list]\r<br />\r<br />[center][img]http://i.imgur.com/eYIQJDV.png[/img][/center]\r<br />\r<br />To uninstall Somber ENB, simply remove the files added to your skyrim folder (including the enbseries folder).  Also be sure to deactivate the snow effects plugin from the &#34;Data&#34; folder if you chose to install it.  It is important to note that ENBs in themselves do not interact with save games, so they are completely safe to add or remove.  Of course, this is not true for any plugins that are installed along with an ENB, and it is up to the user to keep track of which plugins are installed with a particular ENB.\r<br />\r<br />[center][img]http://i.imgur.com/OrweZ79.png[/img][/center]\r<br />\r<br />Somber ENB was not designed to work with lighting mods such as Enhanced Lights and FX or Realistic LIghting Overhaul.  You may use Somber ENB with these mods, but they are not supported and may likely result in odd or undesired results.  Somber ENB has been designed so that these mods are not necessary to achieve appropriate and effective lighting.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/27960//?]Blackout - Simply Darker Dungeons[/url]\r<br />\r<br />Blackout - Simply Darker Dungeons is [i]absolutely necessary[/i] for interior daytime lighting to function correctly in Somber ENB.  It is important to install all available modules of this mod (for each of the DLC).  In addition, it must be manually placed [b]last[/b] in your load order or at the very least, after ELFX if you use that mod.  Do not rely on BOSS to place these mods correctly - if you experience excessively dark interiors, you may need to manually move them in your load order.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/9930//?]Revamped Exterior Fog[/url]\r<br />The atmospheric haze effect used in this preset is best realized with the exterior fog altered by this mod.  With this mod active, exterior &#34;distance&#34; fog will be thinner and begin much further from the player, allowing for a greater level of clarity for the surrounding environment and a more distinctive shift when viewing distant objects.\r<br />\r<br />[center][img]http://i.imgur.com/rhY4Sye.png[/img][/center]\r<br />\r<br />Although not strictly required, these mods come highly recommended for use with Somber Antique.  If you want Skyrim to look like it does in some of the featured screenshots, you should consider installing at least some of these mods:\r<br />\r<br />[list]\r<br />[*][url=http://skyrim.nexusmods.com/mods/37865/?]AmidianBorn Landscape[/url] (Use with project Parallax.  Roads will respond better to direct lighting)\r<br />[*][url=http://skyrim.nexusmods.com/mods/18814/?]Project Parallax[/url] (See above)\r<br />[*][url=http://skyrim.nexusmods.com/mods/4910//?]Dramatic Clouds[/url] (Strongly recommended for sky lighting and atmosphere)\r<br />[*][url=http://skyrim.nexusmods.com/mods/39450//?]Real Clouds[/url] (quirky but beautiful; may make things darker outdoors)\r<br />[*][url=http://skyrim.nexusmods.com/mods/18916//?]Lanterns of Skyrim[/url] (try default lighting)\r<br />[*][url=http://skyrim.nexusmods.com/mods/7643//?]Real Effect Candle[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/141//?]Skyrim Flora Overhaul[/url] (make sure you pick a version designed for use with ENB)\r<br />[*][url=http://skyrim.nexusmods.com/mods/17984//?]Detailed Terrain and Tree LoD by Rennn[/url] (has SFO versions)\r<br />[*][url=http://skyrim.nexusmods.com/mods/38491//?]AmidianBorn Whiterun[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/49011/?]Quality Snow HD[/url] by Yuril ([b]Dark versions[/b])\r<br />[*][url=http://skyrim.nexusmods.com/mods/38004/?]Vivid Landscape - Rocking Stones and Mountain Parallax[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/38497/?]Vivid Landscapes - Cliff and Creeks[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/28292/?]Vivid Landscapes - High Realistic Tundra Moss[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/41198/?]Vivid Landscapes - Volcanic Areas[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/6971/?]Visible Windows[/url]\r<br />[/list]\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/mf27AMV.png[/img][/center]\r<br />Most questions will be answered in the comments section, but the most frequent problems and their solutions will be posted here.  It is encouraged that users frequently check this list to see if a solution to their problem is listed.\r<br />\r<br />[color=goldenrod]Interiors are still dark, even with the required mods installed[/color]\r<br />Make sure you don&#39;t have the [b]enb_reference.esp[/b] plugin installed.  This mod (also called the &#34;ENB helper mod&#34;) is used by other ENB presets and because of how it works, it can cause issues with interior lighting.  Similarly, the enbhelper.dll, which replaces the now-defunct enb_reference.esp, is not compatible with Somber Antique 2.x.  This dll can not be used with Somber Antique 2.x at this time without interiors becoming exceedingly dark during daytime hours.\r<br />\r<br />[color=goldenrod]A message appears at the top of my screen saying &#34;enbhost.exe was unable to start&#34;[/color]\r<br />Verify that [b]enbhost.exe[/b] is present in your skyrim folder.\r<br />\r<br />[color=goldenrod]Skyrim crashes at startup when the ENB files are present in the skyrim directory.  It starts up fine if I remove/delete them.[/color]\r<br />Some antivirus programs may detect [b]enbhost.exe[/b] as a threat and shut down the tesv.exe process as a result.  To remedy this, simply add enbhost.exe to your antivirus program&#39;s exception list.\r<br />\r<br />[color=goldenrod]There are horizontal shaded lines on grass.[/color]\r<br />Set [b]bShadowsOnGrass=1[/b] in your SkyrimPrefs.ini under the [Display} section.\r<br />\r<br />[center][img]http://i.imgur.com/EGUuFlc.png[/img][/center]\r<br />Updates will be provided when new ENB binaries are made available that include new features or bugfixes.  Typically, these updates will be to ensure that proper settings are included with this preset.  Information on updates and what they address will be found in stickied posts in the comments section.\r<br />\r<br />[center][img]http://i.imgur.com/uHuSIrY.png[/img][/center]\r<br />\r<br />Somber ENB is based on Unreal Cinema ENB code and UnrealWarfare deserves a special thanks for his inspiration and his contributions to this preset as well as his GUI code implementation, raindrops file, and sunsprite texture.\r<br />\r<br />Also many thanks to dear KYO for giving permission to use his advanced shader files.\r<br />\r<br />Somber ENB was created by Tansarville.  Tansarville is most comfortable applying her creativity and passion to creating new presets, shaders and effects rather than managing and supporting them and allowing her artistic vision to be compromised.  Management and support of this preset will fall to Maeldun0, who will provide updates to keep this preset compatible with ENB binaries and the new features that are introduced with them.\r<br />\r<br />Boris Vorontsov - ENB Series developer\r<br />HeliosDoubleSix - HD6 Shader code\r<br />Matso - Sun textures, original Depth of Field code\r<br />IndigoNeko - Active Film Grain\r<br />Confidence Man - Water Texture\r<br />Trillville - Palette file used on Somber series tweaked from his palette\r<br />Jawz - DNI, GUI coding, Sunprite texture\r<br />gp65cj04 - Tilt Shift DOF\r<br />Kyokushinoyama - Sunsprite file,Tilt Shift DOF, Cinematic DOF, Bloom code\r<br />Mindflux - Particle Patch & Further Dark Dungeons, SnowFX\r<br />Opethfeldt - Sunsprite texture\r<br />Tapioks - Shader Package Port\r<br />Ceejay.dk - SweetFX shader\r<br />Midhras - Optional DOF file\r<br />Ewi65 - DoF files\r<br />ZeroKing - for the use of [url=http://www.nexusmods.com/skyrim/mods/50638/?]Post-Process Effects Addon for ENB[/url]\r<br />Tansarville - Creator of the Somber Series\r<br />WolfGrimDark - manager and collaborator on Somber ENB Lut Sepia and a invaluable resource for information and creator of Somber ENB lantern presets\r<br />MannyGT\r<br />\r<br />[center][img]http://i.imgur.com/LgZuUfD.png[/img][/center]\r<br />\r<br />This ENB is for personal use only.  This preset or the files contained therein may not be uploaded to the Nexus or any other site by anyone other than Tansarville, WolfGrimDark and Maeldun0.  If you wish to create your own work based on this preset, please contact Tansarville directly.\r<br />\r<br />[center][img]http://i.imgur.com/c7ctoI5.png[/img][/center]\r<br />\r<br />[center]Videos made by Hodilton, thousand thanks to him[/center]\r<br />[center][youtube]SP7OGSQjKdc[/youtube]   [youtube]G3-P_qZQksM[/youtube][/center]\r<br />[center]Many thanks to Hodilton for this great video(Left one). And many thanks to Saiodin for this great video (Right one)[/center]\r<br />[center][youtube]aa7XSb6tFLA[/youtube]   [youtube]Hmm3uLJw0sE[/youtube][/center]\r<br />[center]Somber Wintage 35mm. Video made by Saio TV. Thousand thanks to him.[/center]\r<br />[center][youtube]fQoo9fkRNDY[/youtube][/center]\r<br />\r<br />[center][img]http://i.imgur.com/Z74VLqG.png[/img][/center]\r<br />\r<br />[center]These Captures Belong to &#39;&#39;Farvat&#39;&#39;. Many thanks to him for these impressive Screenshots\r<br />[img]http://i.imgur.com/Zq1TOWW.jpg[/img]\r<br />[img]http://i.imgur.com/AvjNwiv.jpg[/img]\r<br />Image captured by Djekmiami. Thanks to him.\r<br />[img]http://i.imgur.com/WeCpWHP.jpg[/img]\r<br />Image captured by flyingpikachu. Thanks to her.\r<br />[img]http://i.imgur.com/6QuQeYA.jpg[/img]\r<br />Image captured by Xantesh. Thanks to him.\r<br />[img]http://i.imgur.com/aKvYWxa.jpg[/img]\r<br />Image captured by Caelrya. Thanks to her.\r<br />[img]http://i.imgur.com/wdl7On7.jpg[/img]\r<br />Thanks to Hodilton for this great Riverwood Capture.\r<br />[img]http://i.imgur.com/tU3g5TZ.jpg[/img]\r<br />Thanks to Betterbecause for this lovely image.\r<br />[img]http://i.imgur.com/rJlXWea.jpg[/img]\r<br />Thanks to Amoebae for this artistic image.\r<br />[img]http://i.imgur.com/HK6PgDP.jpg[/img]\r<br />Image captured by Xantesh. Thanks to him.\r<br />[img]http://i.imgur.com/4p2zKVE.jpg[/img]\r<br />Image below captured by Shockero. Thanks to him.\r<br />[img]http://i.imgur.com/94a1rGA.jpg[/img]\r<br />Images below captured by moztacular. Thanks to him.\r<br />[img]http://i.imgur.com/KMy9A0k.jpg[/img]\r<br />[img]http://i.imgur.com/1mmdfrw.jpg[/img]\r<br />Image below captured by Plopandfloc. Thanks to him.\r<br />[img]http://i.imgur.com/XT43Pjs.jpg[/img]\r<br />[/center]",
  "categoryId": "62",
  "version": "2.15.254",
  "author": "Tansarville - Creator and Maeldun0 - Manager",
  "createdUnix": "1372521144",
  "updatedUnix": "1399791120",
  "containsAdultContent": false,
  "uploadedBy": "Tansarville",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000044494",
      "name": "Somber ENB - 0-199 - BETA",
      "version": "BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22999",
      "fileName": "Somber ENB - 0-199 - BETA-37716-BETA.rar",
      "uploadedUnix": "1375733278",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/639e2b90c5ccd47c67743b81bf86bc1c34db868710e61cbe01b413c9eb30fef0/analysis/1407670229/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Somber%20ENB%20-%200-199%20-%20BETA-37716-BETA.rar?fid=1000044494&ttl=1535817580&ri=8192&rs=8192&setec=5eadbf405bb9857462fb94df1e57e104"
    },
    {
      "fileId": "1000058127",
      "name": "Somber Antique 2 DATA",
      "version": "2.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8937",
      "fileName": "Somber Antique 2 DATA-37716-2-1.zip",
      "uploadedUnix": "1380130774",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/c9be22d0a610102b06813de4b669660c9fe34fab9cf34bb3c4d30fb21503f9f2/analysis/1407734288/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Somber%20Antique%202%20DATA-37716-2-1.zip?fid=1000058127&ttl=1535817580&ri=8192&rs=8192&setec=72c058686812e014afd99c08024318f2"
    },
    {
      "fileId": "1000059560",
      "name": "Somber 2 Options",
      "version": "2.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "153",
      "fileName": "Somber 2 Options-37716-2-2-2-211.zip",
      "uploadedUnix": "1380440057",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/8ca9068d45232b5f950c5671dd93fdd4da83d9f2a114b8a1af7082d0ed1a7ff3/analysis/1407738956/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Somber%202%20Options-37716-2-2-2-211.zip?fid=1000059560&ttl=1535817581&ri=8192&rs=8192&setec=eabe0fa9068e7db8cacb627aaca5f958"
    },
    {
      "fileId": "1000060725",
      "name": "Lanterns of Skyrim preset",
      "version": "2.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Lanterns of Skyrim preset-37716-.zip",
      "uploadedUnix": "1380733105",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/ce26d95327884e55970f9aeba73009b28754b903ba7ac55eb3598a4bb4c9c32b/analysis/1407742862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lanterns%20of%20Skyrim%20preset-37716-.zip?fid=1000060725&ttl=1535817581&ri=8192&rs=8192&setec=a0e6ea76e64241a1d109c6681c9f34da"
    },
    {
      "fileId": "1000060797",
      "name": "Lanterns of Skyrim - Neon Colors Somber ENB presets",
      "version": "2.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Lanterns of Skyrim - Neon Colors Somber ENB presets-37716-2-4.zip",
      "uploadedUnix": "1380744947",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/1401306337062a048884a6c478161165a73f9be1d83549af20b7877fed6f4ec4/analysis/1407742923/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lanterns%20of%20Skyrim%20-%20Neon%20Colors%20Somber%20ENB%20presets-37716-2-4.zip?fid=1000060797&ttl=1535817582&ri=8192&rs=8192&setec=eac44488c040fdbae152fe9d90e7c627"
    },
    {
      "fileId": "1000087384",
      "name": "Somber Antique 2",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3851",
      "fileName": "Somber Antique 2-37716-2-4.zip",
      "uploadedUnix": "1387441837",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/dd73510909e669e642c7197fc5ade749a0d74d823a676a5a4ed10dd665f251c2/analysis/1407848709/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Somber%20Antique%202-37716-2-4.zip?fid=1000087384&ttl=1535817582&ri=8192&rs=8192&setec=1b61a4967a608faf5a17c673fae51e5f"
    },
    {
      "fileId": "1000108673",
      "name": "Somber Antique 2",
      "version": "2.15.254",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3817",
      "fileName": "Somber Antique 2-37716-2-15-254.zip",
      "uploadedUnix": "1399776597",
      "modVersion": "2.15.254",
      "virusScanUrl": "https://www.virustotal.com/file/e19d4be13f2afe6567e1bf68207b18017b8008fc08cd5406e90a4876d8565e69/analysis/1408071907/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Somber%20Antique%202-37716-2-15-254.zip?fid=1000108673&ttl=1535817583&ri=8192&rs=8192&setec=77f00296d7acc1ed7671b6f4b3e0c6d7"
    },
    {
      "fileId": "1000108674",
      "name": "Somber Unchained",
      "version": "2.15.254",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "330",
      "fileName": "Somber Unchained-37716-.zip",
      "uploadedUnix": "1399776694",
      "modVersion": "2.15.254",
      "virusScanUrl": "https://www.virustotal.com/file/1fc68d9982998297941f46e62945ddf804d780c3ec6439bc5c46cd9c8acb34e3/analysis/1408071910/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Somber%20Unchained-37716-.zip?fid=1000108674&ttl=1535817583&ri=8192&rs=8192&setec=93fe17e4f0db8a00a8eacaa38e758ec7"
    },
    {
      "fileId": "1000108689",
      "name": "Sample enblocal",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "96",
      "fileName": "Sample enblocal-37716-.zip",
      "uploadedUnix": "1399791120",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/83b003e628a3deb73c55c8173efc7648394f06e407b1f2012bf2849a590f26ff/analysis/1408072149/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sample%20enblocal-37716-.zip?fid=1000108689&ttl=1535817584&ri=8192&rs=8192&setec=6cc236edf60c76bd40054005c612bf73"
    }
  ]
}