{
  "modId": 37726.0,
  "modName": "Corruption Poison Ingredients",
  "summary": "3 ingredients to create a very lethal and fun poison that I made for myself.",
  "descriptionHtml": "Hello to anyone who might be reading this besides myself. This mod came into birth due to a desire to create a poison with all three Damage Health effects, (Damage, Ravage, and Lingering Damage) and I realized that with three perfect ingredients I could create a poison with 6 effects instead of the original 4 I was going to go for. Pretty much this poison will drain your targets of all their health, a choke load of magicka, and cause them to go nuts and attack everything around them. Fun for tough bandits, dragons if they were able to be frenzied (I don\\'t think they are...) and other tough stuff that is susceptible to poisons. No dragur or Dewmer constructs. =( \r\n\r\nThis mod adds 3 ingredients to create a very lethal and fun poison that I made for myself. The ingredients are Rotted Heart (Damage Health, Ravage Health, Lingering Damage Health, and Frenzy), Corrupted Heart (Lingering Damage Health, Frenzy, Ravage Magicka, and Weakness to Poison), and Vile Ash (Damage Health, Weakness to Poison, Ravage Health, and Ravage Magicka). \r\n\r\nThis is my first ever mod that I am posting on here, as well as my first ingredient mod. I am a super noob at modding so they aren\\'t in any leveled lists or can be found anywhere I think. Pretty much as far as I know they can only be attained by using the Console Command. \r\n\r\nWarning, if you do end up using this, as I said, first ingredient mod, a couple of the effects are probably way overpowered, like the Frenzy and the Ravage Magicka effects are probably much stronger on these ingredients than on others. If people are actually liking this, I will look into adding it to some creatures or leveled lists or something. Either way I will probably be editing this over time to try to balance out the ingredient effects as I see fit. ",
  "categoryId": "94",
  "version": "1.1",
  "author": "KailorRangorn",
  "createdUnix": "1372472503",
  "updatedUnix": "1372533634",
  "containsAdultContent": false,
  "uploadedBy": "Rangorn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036325",
      "name": "Corruption Poison Ingredients",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Corruption Poison Ingredients-37726-1.rar",
      "uploadedUnix": "1372472497",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/a2f6051ed4fd3171fd5cee93f03d9ba9c5d16198b2749bfa549de7b28f8a0083/analysis/1407621099/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Corruption%20Poison%20Ingredients-37726-1.rar?fid=1000036325&ttl=1535817597&ri=8192&rs=8192&setec=cc3d42bf9d5297eb720eed3e549b7c10"
    },
    {
      "fileId": "1000036442",
      "name": "Corruption Poison Ingredients 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Corruption Poison Ingredients 1_1-37726-1-1.rar",
      "uploadedUnix": "1372533634",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a2f6051ed4fd3171fd5cee93f03d9ba9c5d16198b2749bfa549de7b28f8a0083/analysis/1407622266/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Corruption%20Poison%20Ingredients%201_1-37726-1-1.rar?fid=1000036442&ttl=1535817597&ri=8192&rs=8192&setec=dc006202065b08b77e7cfc7166cc9503"
    }
  ]
}