{
  "modId": 3778.0,
  "modName": "HFVS - Human Female PC Combat Voice Silencer",
  "summary": "silences all the combat grunts of the female player character from the human races",
  "descriptionHtml": "This is mostly intended as a resource.  However, it is quite playable, whether you want to not sneak up behind your enemies only to shout at the top of your lungs when you stab them, or just don\\'t like the sound of your character\\'s voice.  \r\n\r\nMy hope is that this will help other people who might be looking for player character grunt files make better mods with new voices.  A copy of the readme follows.  \r\n\r\n\r\nHFVS\r\nby: Aluminumfoil\r\nv. 0.1\r\n12/15/11\r\n\r\nIf you did not get this mod from Skyrim Nexus (www.skyrimnexus.com), you have downloaded an illegitimate copy.  \r\n\r\nThis mod silences all the combat grunts of the female player character from the human races: Redguard, Breton, Imperial, and Nord.  It does not affect elves, orcs, or beast races.  It does not affect male characters.  \r\n\r\nBecause the game uses some of the same sounds for NPCs as for PCs, this will mute some of the sounds of female human NPCs as well.  No dialog is muted, only combat grunts and gasps.  I may have been a little overzealous in my silencing, and silenced a handful of NPC-exclusive sounds, too.  \r\n\r\n\r\nTo install, drop the Sound folder in your Skyrim\\\\Data directory.\r\n\r\nTo uninstall, delete the folder ...\\\\sound\\\\voice\\\\skyrim.esm\\\\femaleeventoned\r\n\r\n\r\nIf you like it, please remember to endorse! ^.^\r\n\r\n\r\nCredits:\r\nThis would not have been possible without the work of an unknown mod author whose work showed me where to begin.  Because his mod uploaded a port of an Oblivion mod for which porting was expressly forbidden, I am not going to link to it.  \r\n\r\nVery special thanks to Agnahim and his excellent fuz extractor tool.  http://skyrimnexus.com/downloads/file.php?id=950\r\n\r\n\r\n\r\nPermissions:\r\nYou may not re-upload this mod or any mod which uses this one without my permission.  However, if you do ask permission, I will almost always say yes, so please feel free to ask.  ",
  "categoryId": "61",
  "version": "0.1",
  "author": "Aluminumfoil",
  "createdUnix": "1323999734",
  "updatedUnix": "1323999793",
  "containsAdultContent": false,
  "uploadedBy": "Aluminumfoil",
  "primaryFile": null,
  "files": [
    {
      "fileId": "10892",
      "name": "HFVS 0_1",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "HFVS 0_1-3778-0-1.zip",
      "uploadedUnix": "1323999793",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/9e3e612396a5f07c3fdba2d9a11a22e4a44e7a329265c9feeede38facd3b86d6/analysis/1406523606/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HFVS%200_1-3778-0-1.zip?fid=10892&ttl=1535759089&ri=8192&rs=8192&setec=b2fb3a3ff0d76b9ec919441cdcbc1e18"
    }
  ]
}