{
  "modId": 37810.0,
  "modName": "Player Mastery",
  "summary": "This mod gives you $1000000, all master skills, all perks, all shouts, all dragonsouls needed for shouts, and 4000 magicka, 2000 health, and 2000 stamina, and shouts don\\'t need cool down time and all spells.  ",
  "descriptionHtml": "If you\\'re like me and have played skyrim for SOOO LONG and started new characters and just got tired of entering in hundreds of console commands or wasting time mastering everything which most of you, like me, have already done!  This mod aims to master your character without breaking the game by doing something like giving you 99999999999 health or something.  It basically realistically scales up your character up to a point where you can play on legendary and still be challenged by what is supposed to be challenging like a legendary dragon.\r\n\r\nHOW THIS WORKS\r\nTHIS MOD IS A BATCH FILE.  If you aren\\'t familiar basically what this does is make it so that you can do a ton of console commands without actually typing in a ton of console commands.  When you hit download you will be given a .txt file titled \\\"playermastery\\\" you will then in skyrim open up console with ` and then access the batch file.\r\n\r\nHOW TO USE THIS\r\n1. Download the playermastery.txt file\r\n2. Simply copy the playermastery.txt file directly into your data folder!  \r\n3. Run Skyrim (You may experience a CTD but reloaded the game should work fine.)\r\n4. Open console using `\r\n5. Type without quotes, \\\"bat playermastery\\\"\r\n6. Be a badass\r\n\r\nCOMPLETE MOD DESCRIPTION:\r\nThis gives you,\r\nAll skills mastered\r\nAll perks for those skills\r\nAll shouts\r\nAll dragon souls needed to unlock shouts (you have to do this manually)\r\nAll spells (better than using the psb command because it doesn\\'t give you the tester spells and won\\'t crash your game.) \r\nSets your shout cool down time to 0.  You may see negative numbers for your cooldown, but it\\'s still no cool down time. THIS IS COMPATIBLE WITH MODS THAT ALSO MAKE SHOUT COOL DOWN 0.\r\nSets your Magicka to 4000\r\nSets your Health to 2000 \r\nSets your Stamina to 2000\r\n^These may seem broken but trust me on legendary difficulty it can still be challenging.  I\\'ve died many times even with these stats.  \r\nGives you $1000000 because I can.  \r\n\r\nNOTES\r\nThis is a simple text file.  You can open it and edit it as you wish but please if you reupload this or include it in another mod or modpack, please give me a shoutout.  You don\\'t need permission, just a shoutout.  \r\n\r\nJust because this batch file changes everything doesn\\'t mean that you can\\'t change it more.  If you want more health or more magicka etc you can use the appropriate console commands to do so and it won\\'t break anything.  \r\n\r\nTHIS MOD IS LITERALLY JUST RUNNING HUNDREDS OF CONSOLE COMMANDS IT DOESN\\'T CHANGE THE INTERNAL DATA OF THE GAME.  \r\n\r\nWARNING  With this massive of a level increase and skill increase the first time you enter whiterun you will get SLAMMED with people like couriers, wizard challengers, the ebony warrior, cultists, basically a ton of people will try to kill you at once.  You can have fun with this or just do what I do and turn on god mode just to get through that initial clusterfuck.    \r\n\r\nIt shouldn\\'t be incompatible with anything but please let me know if it is.  If you find any bugs and fix them kudos!  This is my first piece of work and I really appreciate feedback!\r\n\r\nEnjoy!\r\n\r\n- Peter\r\n\r\n\r\n",
  "categoryId": "40",
  "version": "1",
  "author": "peterbarnes",
  "createdUnix": "1372668737",
  "updatedUnix": "1372668732",
  "containsAdultContent": false,
  "uploadedBy": "peterbarnes",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036672",
      "name": "playermastery",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "playermastery-37810-1.7z",
      "uploadedUnix": "1372668732",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4ec9c53a462a7cae9fdaa022795c3af8211ceea8be6497806901696ee88318c1/analysis/1407624422/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/playermastery-37810-1.7z?fid=1000036672&ttl=1535817747&ri=8192&rs=8192&setec=d1663489090b88c166ffe0ae909ed949"
    }
  ]
}