{
  "modId": 37844.0,
  "modName": "Raw Food Alchemy",
  "summary": "This mod replaces the raw foods of Skyrim with ingredient versions.",
  "descriptionHtml": "&#34;Ingredients Galore&#34; is the intellectual heir to this mod. I suggest checking that out.\r<br />http://www.nexusmods.com/skyrim/mods/54596/?\r<br />\r<br />\r<br />This mod replaces the raw foods of Skyrim with ingredient versions.\r<br />\r<br />Every ingredient has a first effect that is the same as eating the food version. This means a lot of weak restore health abilities and one oddly strong one.\r<br />\r<br />The vanilla ingredients in Skyrim seem to hint at a much more dynamic selection of ability strengths. Only a few seemed to have made it into the final game. It&#39;s almost as though they made the system so that you would comb through things to find the combination of ingredients to get the best potency and/or duration, but they basically never used it. They are a few oddly strong ingredients that go in every potion of a type, but all the rest are identical. The raw food ingredients have more variation. You might find an oddly strong bonus with a shorter time or a weaker bonus with a longer time.\r<br />\r<br />I&#39;ve also added a few new effects. You get bored plugging the same old vanilla tricks that every other ingredient makes. So, I took some cues from the cook-able foods as to what their raw components should do. Because of this, I&#39;ve added what I call “Recover” effects. They are the “lingering restore” effects from cooked food items, but with a new name to help differentiate them in the alchemy screen. I&#39;ve also added Calm and Courage, which are basically useless without a better delivery method.\r<br />\r<br />Notes:\r<br />\r<br />The spoiler is posted as an image.\r<br />\r<br />The lack of weight isn&#39;t an accident. I use the weightless ingredients mod, so I had no interest in adding something that I&#39;d just end up removing.\r<br />\r<br />If you start from a new game, it should prevent you from encountering any of the old boring versions. If you throw this into an established save, you&#39;ll have an interesting combination of both. \r<br />\r<br />There are two possible versions of this for you to use. One requires Dawnguard, Hearthfire, and Dragonborn. The other is for the base game. If you don&#39;t have all three DCLs, you&#39;ll need to use the vanilla one unfortunately. I&#39;m not good enough at modding yet to make supplemental mods for each DLC.\r<br /> \r<br />This mod changes a lot of recipes, leveled lists, containers and locations. I&#39;m going to assume it won&#39;t play nice with a great many mods. If you want to make a compatible or combined mod using this, have fun. \r<br />\r<br />let me know about any bugs or sneaky food versions showing up.",
  "categoryId": "94",
  "version": "1.0",
  "author": "Slothen42",
  "createdUnix": "1372718104",
  "updatedUnix": "1372718030",
  "containsAdultContent": false,
  "uploadedBy": "Slothen42",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036774",
      "name": "Raw Food Alchemy",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "285",
      "fileName": "Raw Food Alchemy-37844-.rar",
      "uploadedUnix": "1372717978",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/49e19a0b5282475563d4bea22e05a94ab93efac2d33cefac7700249031180e9c/analysis/1407625271/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Raw%20Food%20Alchemy-37844-.rar?fid=1000036774&ttl=1535817810&ri=8192&rs=8192&setec=6ca675e78e79a297e11257caa5fcc694"
    },
    {
      "fileId": "1000036775",
      "name": "Raw Food Alchemy DLC",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "285",
      "fileName": "Raw Food Alchemy DLC-37844-.rar",
      "uploadedUnix": "1372718030",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/50b55e809419ef4d4f6219abdb88ed314587ebfecc4e91ed304e3c1de4d69d76/analysis/1407625272/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Raw%20Food%20Alchemy%20DLC-37844-.rar?fid=1000036775&ttl=1535817811&ri=8192&rs=8192&setec=90e4b6fd3434f1c77e4e88028d72e111"
    }
  ]
}