{
  "modId": 37846.0,
  "modName": "Ultimate Lighting Overhaul",
  "summary": "Adds new lighting and effects to Skyrim comparable to ENB without any loss of performance. If you can run Skyrim with FXAA then this mod will have almost zero impact on your performance. \r<br />\r<br />ULO has been designed to run alongside mods such as CoT, RLO and ELFX. ",
  "descriptionHtml": "_____________________________________________________________\r<br />Note \r<br />_____________________________________________________________\r<br />\r<br />Ultimate Lighting Overhaul II has been release for SkyrimSE\r<br />and features the return of the insane preset&#33;&#33; \r<br />\r<br />[url=http://www.nexusmods.com/skyrimspecialedition/mods/3956/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrimspecialedition%2Fajax%2Fmoddescription%2F%3Fid%3D3956%26preview%3D&pUp=1]Ultimate Lighting Overhaul II[/url]\r<br />_____________________________________________________________\r<br />Featured in Skyrim Mod Spotlight:\r<br />_____________________________________________________________\r<br />[youtube]bk1bGsY46dc[/youtube]\r<br />\r<br />_____________________________________________________________\r<br />\r<br />Simple Installation Instructions: \r<br />_____________________________________________________________\r<br />ULO 1.4.0 and onwards is an all-inclusive package.\r<br />\r<br />STEP 1: copy all the files from Step 1 to your main Skyrim directory (the one with the Skyrim.exe in it).\r<br /> \r<br />STEP 2: In order to switch between Enhanced, Fantasy, Grim, Lite, High, Ultra, simply copy the corresponding \r<br />SweetFX_preset.txt file from the folder in this archive to your main Skyrim directory \r<br />(the one with the Skyrim.exe in it).\r<br />\r<br />By default ULO is set to Enhanced Ultra. \r<br />\r<br />\r<br />Enjoy&#33;\r<br />\r<br />Please note: ULO makes use of SweetFX by CeeJay.dk. If you like this mod please be sure to endorse the amazing work of CeeJay.dk which makes ULO possible.\r<br />http://skyrim.nexusmods.com/mods/23364//?\r<br /> \r<br />\r<br />If you are having any problems, please make sure you have the latest version of DirectX: http://www.microsoft.com/en-us/download/details.aspx?id=35\r<br />\r<br />nVidia Laptop users will need this otherwise Optimus will not work:\r<br />http://skyrim.nexusmods.com/mods/33227/?\r<br />\r<br />Also please note:\r<br />Any overlay programs such as nVidia Injector, EVGA Precision or early versions of fraps may interfere with SweetFX.\r<br />\r<br />\r<br />_____________________________________________________________\r<br />\r<br />Latest Update: \r<br />_____________________________________________________________\r<br />\r<br />Update 12: Version 1.3.2. Better Balanced HDR for snow. Removed the Insane Preset. Insane has been made obsolete by ULO+ which gives better visuals and better performance than Insane. \r<br />Update 13: Version 1.4.0. Updated for SweetFX 1.5. Restructured files to create an All-In-One install package. \r<br />_____________________________________________________________\r<br />\r<br />Main\r<br />_____________________________________________________________\r<br />\r<br />Welcome to the Ultimate Lighting Overhaul (ULO). A new way of adding lighting effects to skyrim that will not destroy your framerate. \r<br />\r<br />While I love the overall effect of the many ENB Profiles here on the Nexus, I have always had one major problem with the shader suite and the numerous ENB community modifications:\r<br />\r<br />ENB profiles (and complex shaders) eat performance.\r<br />\r<br />I have a GTX 580 and even the lightest of ENB profiles use a significant amount of my GPU&#39;s resources. Boris has done a truly amazing job in optimizing the lighting/shadow effects of ENB and the performance cost is ridiculously light for the work they are doing (around the same cost as ULO Ultra). However, once you start turning on complex shaders or even effects like bloom, Sky effects or Depth of Field the shader suite begins to chunk away at your performance. Even if I &#34;can&#34; run an ENB profile, I have often opted to not run one in favor of higher quality Ambient Occlusion or a larger uGrids setting to render more of the game world in greater detail. \r<br />\r<br />Then a little while ago a competitor to ENB hit the scene called SweetFX. SweetFX was used as a means to easily tweak and enhance ENB without having to sort through the mess of ENB&#39;s config and shader files. However, I felt that SweetFX was capable of doing so much more. After hundreds of hours of tweaking, fine tuning and playing around in a multitude of video games I have developed a intimate knowledge of the Shader suite and its potential. \r<br />\r<br />It is with all of that invested time and knowledge that I now bring you the Ultimate Lighting Overhaul. A labor of love that will significantly enhance the lighting of Skyrim while having little to no impact on your performance. \r<br />\r<br />If you have always wanted to use ENB but could not justify the frame hit, or you have ever wished your games lighting could look stunning while cranking up other settings then this mod is for you. \r<br />\r<br />\r<br />There are 3 quality pre-sets for ULO. Lite, High, Ultra. The difference is as follows:\r<br />\r<br />Lite: Tonemap, Vibrance, Curves\r<br />High: SMAA High Quality, Sharpening, Tonemap or Sepia, Vibrance, Curves\r<br />ultra: SMAA Ultra Quality, Sharpening, Tonemap or Sepia, Vibrance, Curves, HDR\r<br />\r<br />Performance usage difference on a GTX 580:\r<br />\r<br />Lite: 2% GPU\r<br />High: 6% GPU\r<br />Ultra: 11% GPU\r<br />\r<br />For comparison:\r<br />\r<br />ULO+: 15% GPU\r<br />Just the ENB Depth of Field Shader: 23% GPU\r<br />\r<br />\r<br />I recommend High or Ultra if you can run them. If you want more bang for your buck you can always try ULO+ which is an ENB Lite. \r<br />\r<br />There are also 3 Aesthetic Styles to choose from. Enhanced. Fantasy and Grim.\r<br />\r<br />Enhanced works to improve everything about Skyrim without making any truly dramatic changes. \r<br />Shadows will be a little darker, lights will be a little brighter and colors will be slightly more colorful.\r<br />\r<br />Fantasy offers the improvements of Enhanced while making the world far more colorful.\r<br />\r<br />Grim offers the improvements of Enhanced while making the world far more dark and less colorful.\r<br />\r<br />All 4 presets will work in conjunction with any other lighting mods such as CoT, RLO and ELFX.\r<br />\r<br />_____________________________________________________________\r<br />\r<br />Recommended Mods:\r<br />_____________________________________________________________\r<br />\r<br />Ultimate Lighting Overhaul has been designed to run alongside mods such as:\r<br />\r<br />Climates of Tamriel\r<br />http://skyrim.nexusmods.com/mods/17802/?\r<br />\r<br />Real Colors, Real Nights\r<br />http://skyrim.nexusmods.com/mods/1875/?\r<br />\r<br />Enhanced Lights and FX\r<br />http://skyrim.nexusmods.com/mods/27043/? \r<br />\r<br />Realistic Lighting Overhaul\r<br />http://skyrim.nexusmods.com/mods/30450/?\r<br />\r<br />Relighting Skyrim\r<br />http://skyrim.nexusmods.com/mods/17609/?\r<br />\r<br />and mods that improve Skyrim such as:\r<br />\r<br />DYNAVISION - Dynamic Depth of Field\r<br />http://skyrim.nexusmods.com/mods/12525/?\r<br />\r<br />\r<br />Although they are not necessary in order for you to use ULO, they are highly recommended as they have next to zero impact on performance while dramatically improving the visual quality of Skyrim. \r<br />\r<br />Just be sure to install ULO last and overwrite any pre-existing files.\r<br />\r<br />_____________________________________________________________\r<br />\r<br />Compatibility:\r<br />_____________________________________________________________\r<br />\r<br />ULO is compatible with all lighting mods that make changes to Skyrims lighting in game.\r<br />ULO is a substitute for mods such as ENB.\r<br />\r<br />Users of Hailgoboost please see the Hailgoboost readme on how to get ULO and Hailgoboost running together.\r<br />\r<br />Exterior Fog Revamped (and interior fog removal) may cause the fog to look too blue with ULO. If you notice the fog looking funky you may wish to try disabling these mods.\r<br />\r<br />_____________________________________________________________\r<br />\r<br />_____________________________________________________________\r<br />\r<br />F.A.Q\r<br />_____________________________________________________________\r<br />\r<br />Q: I CTD on startup and its all your fault&#33; HALP&#33;\r<br />A: Try the files in the optional section called x64 fix. Most people shouldn&#39;t need them, but if you CTD on startup its worth shot&#33;\r<br />\r<br />Q: How do I use ENB Boost with ULO?\r<br />A: Read the ENB Boost readme and follow the instructions.  \r<br />\r<br />Q: I have really low FPS on my Laptop/Optimus is not working&#33;\r<br />A: See this mod for a solution: http://skyrim.nexusmods.com/mods/33227/?\r<br />\r<br />Q: Did you make this shader suite?\r<br />A: I did not. ULO is simply a config file for SweetFX much like most ENB mods are simply shader settings configs\r<br />for ENB. \r<br />\r<br />Q: What is SweetFX?\r<br />A: SweetFX is a shader suite designed by CeeJay.dk. ULO is just a config preset for his suite that works just like an ENB preset. \r<br />\r<br />You can find more info on SweetFX here:\r<br />http://skyrim.nexusmods.com/mods/23364/?\r<br />\r<br />Q: My everything is to light/dark&#33;\r<br />A: Adjust the in game brightness to your personal preference. \r<br />\r<br />Q: This doesn&#39;t run on my laptop with no GPU&#33; \r<br />A: Then you probably cant run the game with FXAA either. I can&#39;t guarantee that this will run perfectly for you, all I can do is release the lowest impact lighting enhancement mod to date. If you still can&#39;t use shader mods then I am sorry but there is little more I can do for you. :(\r<br />\r<br />Q: Will this work with X Mod?\r<br />A: ULO will work in tandem with any mod that attempts to adjust Skyrims lighting via in game settings such as Climates of Tamriel, Real Colors Real Nights, Darker Dungeons, Ultra Realistic World Lighting or mods that replace the lighting models such as Enhanced Lighting and FX or Realistic Lighting Overhaul. \r<br />\r<br />It will replace/overwrite any mod that attempts to alter the games effects via a .dll file such as ENB. You can make this mod run alongside ENB but you would lose any and all performance gain by doing so.\r<br />\r<br />Q: What’s the difference between ULO and RLO?\r<br />A: The spelling. \r<br />\r<br />Also RLO make changes to Skyrims in game lighting and models. ULO works like an ENB lite and adds shader filters to your entire game. ULO uses SweetFX that will work in tandem with your GPU drivers to apply those filters to what Skyrim is telling it to render, rather than attempting to force Skyrims Engine to do any more heavy lifting. \r<br />\r<br />Q: Will ULO work with RLO or do I have to choose between them?\r<br />A: ULO works with RLO, ELFX or any other mod that changes Skyrims lighting in game.\r<br />\r<br />Q: Are you absolutely sure I can use ULO and RLO together?\r<br />A: You? No... I am not absolutely sure if you can use RLO and ULO together... but everyone else should be able to just fine.\r<br />\r<br />Q: Do I still need RLO optimization patch?\r<br />A: No. 1.3.0 and onwards is a tabula rasa designed to be more focused on vanilla than on a specific set of other lighting mods. This way it will be compatible with anything that alters vanilla. ULO should now subtly enhance and work with everything.\r<br />\r<br />Q: Can I toggle this on and off like ENB?\r<br />A: Yes you can. SweetFX can be toggled on or off with the scroll lock key. \r<br />\r<br />Q: How can I make this work with Hailgoboost&#33;?\r<br />A: Please read the Hailgoboost readme. It has all the answers.\r<br />\r<br />Q: Skyrim crashes and says msvcp100.dll is missing.\r<br />A: Download it from here:\r<br />\r<br />http://www.microsoft.com/en-us/download/confirmation.aspx?id=5555\r<br />\r<br />Steam most likely did not install the 32-bit binaries (Which you still need for some 32-bit games and software).\r<br />\r<br />Q: Your mod is not working with X/Y/Z Mod&#33; I cannot get this to work&#33; Tell me how to fix it&#33;\r<br />A: I wish I could but some things are outside the scope of my ability to assist with. I just made some pretty colors using SweetFX. If you have a deeper issue with SweetFX, Skyrim or another utility that cannot be resolved by either:\r<br />\r<br />1: Checking to make sure you installed ULO into the right folder.\r<br />2: Updating DirectX: Make sure you have the latest version of DirectX: http://www.microsoft.com/en-us/download/details.aspx?id=35\r<br />3: Updating your video drivers\r<br />4: Disabling any programs that use an overlay.\r<br />5: Making sure AA is disabled in game and via drivers.\r<br />\r<br />Then I cannot help you. \r<br />\r<br />_____________________________________________________________\r<br />\r<br />Credits\r<br />_____________________________________________________________\r<br />\r<br />ULO Settings Config by VoidNull\r<br />\r<br />With special thanks to:\r<br />Billyshakers for his work and research on getting ULO to run with ENB.\r<br />Kodiak123 for his work and research on getting ULO to run with ENB. \r<br />Alantor for their tireless enthusiasm, research and support. Alanator has also been an amazing help to me in just how much they have gone out of their way to help other users with their problems. \r<br />TehKaoZ for their support of this mod both enthusiasm and in helping people with technical difficulties.\r<br />nu4nc3 for telling me know about some issues with ULO and Exterior Fog Revamped (and interior fog removal).\r<br />SnQQpyDog for helping troubleshoot users problems.\r<br />\r<br />And everyone else who has helped answer peoples questions, troubleshoot issues or helped raise awareness about ULO.\r<br />\r<br />If your name is not in the special thanks section, it is not because I do not appreciate you, its because I am bad with names.\r<br />\r<br />\r<br />Please note:\r<br />ULO uses SweetFX. SweetFX was created by CeeJayDK and Older versions of ULO made use of the modified version of SweetFX by Boulotaur2024.\r<br />\r<br />Uses SMAA. Copyright (C) 2011 by Jorge Jimenez, Jose I. Echevarria,\r<br />Belen Masia, Fernando Navarro and Diego Gutierrez.\r<br />- More info on: http://www.iryoku.com/smaa/\r<br />\r<br />Uses FXAA by Timothy Lottes (Nvidia) \r<br />- His blog: http://timothylottes.blogspot.com\r<br />\r<br />Uses InjectSMAA by Andrej Dudenhefner ( mrhaandi )\r<br />- http://mrhaandi.blogspot.dk/p/injectsmaa.html\r<br />\r<br />Uses shaders from FXAATool by Violator, [some dude], fpedace, BeetleatWar1977 and [DKT70]\r<br />- https://www.assembla.com/wiki/show/fxaa-pp-inject/ \r<br />\r<br />DPX shader by Loadus\r<br />\r<br />Border shader by Oomek - rewritten and optimized by CeeJay.dk\r<br />\r<br />Advanced CRT shader by cgwg, Themaister and DOLLS - ported to SweetFX by Boulotaur2024.\r<br />\r<br />Lift Gamma Gain shader by 3an and CeeJay.dk\r<br />\r<br />Cartoon by CeeJay.dk, but based on the Auto Toon cg shader found in the Dolphin emulator.\r<br />- http://dolphin-emu.org/\r<br />\r<br />SweetFX, LumaSharpen, Dither, Curves, Vibrance , Monochrome and Splitscreen by Christian Cann Schuldt Jensen ( CeeJay.dk )\r<br />\r<br />_____________________________________________________________\r<br />\r<br />Updates:\r<br />_____________________________________________________________\r<br />\r<br />Update 1: Due to popular demand I am now working on a more CoT optimized version of ULO. \r<br />Update 2: Version 1.1.0 By popular demand ULO has been redesigned to make better use of Climates of Tamriel.\r<br />Update 3: Version 1.1.1 should have better balanced contrast in interiors where it was a little too much, along with a very gentle taps to the brightness and saturation. Also made the Gaussian effect a tiny bit stronger. \r<br />Update 4: Due to popular demand. Work has begun on a RLO optimized version. \r<br />Update 5: version 1.2.0: Campfire Saturation Fix and RLO Optimized optional File. Startup Bug fix. \r<br />Update 6: Work has begun on an optional Insane Pre-set for those who are not so concerned about performance.\r<br />Update 7: version 1.2.1: Refined settings to better balance color and brightness for both RLO and ELFX and added Grim settings for people who wish for less saturation\r<br />Update 8: Added Alpha build of the Insane Preset for 1.2.1\r<br />Update 9: Version 1.2.2: Internal release. Overhauled ULO&#39;s file structure and reverted to SweetFX 1.4. \r<br />Update 10: Version 1.3.0: ULO has been rebuilt from the ground up to use SweetFX 1.4 instead of modified version by Boulotaur2024. This should drastically increase compatibility for people still having issues getting ULO to work for them. However, this meant getting rid of the Gaussian Blur shader so all of the settings have been retweaked and new shaders utilized to give you the best visual improvement at the lowest performance hit. Also overhauled the documentation and added the credits from the permissions and credits section on ULO&#39;s Nexus page to the readme and description. Added a special thanks section while I was at it.\r<br />Update 11: Version 1.3.1: Improved Insane and Ultra detail. Improved all settings performance. Minor enhancement tweaks to Grim and Fantasy Presets (no aesthetic changes were made, only more detail was added). Improved documentation.\r<br />Update 12: Better Balanced HDR for snow. Removed the Insane Preset. Insane has been made obsolete by ULO+ which gives better visuals and better performance than Insane. ",
  "categoryId": "62",
  "version": "1.4.0",
  "author": "VoidNull",
  "createdUnix": "1372723376",
  "updatedUnix": "1381091714",
  "containsAdultContent": false,
  "uploadedBy": "VoidNull",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039844",
      "name": "ULO v131 Enhanced",
      "version": "1.3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1927",
      "fileName": "ULO v131 Enhanced-37846-1-3-1.zip",
      "uploadedUnix": "1374351236",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/d6850eb1739b444e9851db3eed713d7c7db8d358b399dc16f25f723a7e9d72e2/analysis/1407650779/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ULO%20v131%20Enhanced-37846-1-3-1.zip?fid=1000039844&ttl=1535817814&ri=8192&rs=8192&setec=76ac74b33c23cbc7168e9bb8fb279c00"
    },
    {
      "fileId": "1000039845",
      "name": "ULO v131 Grim",
      "version": "1.3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1927",
      "fileName": "ULO v131 Grim-37846-1-3-1.zip",
      "uploadedUnix": "1374351335",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/2adcd4a7bf89fac6a70295c1006d62be59d102d51dce906cca737beabf5a6776/analysis/1407650782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ULO%20v131%20Grim-37846-1-3-1.zip?fid=1000039845&ttl=1535817815&ri=8192&rs=8192&setec=7f55711e7094b8adc3d285838b72441e"
    },
    {
      "fileId": "1000039846",
      "name": "ULO v131 Fantasy",
      "version": "1.3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1927",
      "fileName": "ULO v131 Fantasy-37846-1-3-1.zip",
      "uploadedUnix": "1374351433",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/6e902ac42027526d9943b033978d8efc281c5554ac4cbbfe037aacdeb685cddf/analysis/1407650784/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ULO%20v131%20Fantasy-37846-1-3-1.zip?fid=1000039846&ttl=1535817815&ri=8192&rs=8192&setec=81f4e75bac4e832ef1d504f00a05c314"
    },
    {
      "fileId": "1000042717",
      "name": "ULO v132 Enhanced",
      "version": "1.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1454",
      "fileName": "ULO v132 Enhanced-37846-1-3-2.zip",
      "uploadedUnix": "1375249818",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/f2e2b42d036d19f84693d35e4fcf778d256bed5812ad0926527ea188fa627abd/analysis/1407662643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ULO%20v132%20Enhanced-37846-1-3-2.zip?fid=1000042717&ttl=1535817815&ri=8192&rs=8192&setec=181a90e5ba80cb58d6b2feca4a2262d3"
    },
    {
      "fileId": "1000042719",
      "name": "ULO v132 Fantasy",
      "version": "1.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1453",
      "fileName": "ULO v132 Fantasy-37846-1-3-2.zip",
      "uploadedUnix": "1375249886",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/0095608eb277b2e5c91ff565096d9c43f1d8b44037aef8f5e49bc2aa86c88560/analysis/1407662643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ULO%20v132%20Fantasy-37846-1-3-2.zip?fid=1000042719&ttl=1535817816&ri=8192&rs=8192&setec=0a2761b2ea3df69c72bfe9342b947bd3"
    },
    {
      "fileId": "1000042721",
      "name": "ULO v132 Grim",
      "version": "1.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1453",
      "fileName": "ULO v132 Grim-37846-1-3-2.zip",
      "uploadedUnix": "1375249949",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/8628b3e168573cdb444ad49af8c77244d52f016f5a6339ffe52d0341f625b0bc/analysis/1407662648/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ULO%20v132%20Grim-37846-1-3-2.zip?fid=1000042721&ttl=1535817816&ri=8192&rs=8192&setec=7479ecd4710493d7e0cf205b3c1aae66"
    },
    {
      "fileId": "1000062553",
      "name": "ULO v140 Complete",
      "version": "1.4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "567",
      "fileName": "ULO v140 Complete-37846-1-4-0.zip",
      "uploadedUnix": "1381091714",
      "modVersion": "1.4.0",
      "virusScanUrl": "https://www.virustotal.com/file/b101eff2d5835f975aec6c56f8b93c054363834adae60ab4606df280f8933cdd/analysis/1407747939/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ULO%20v140%20Complete-37846-1-4-0.zip?fid=1000062553&ttl=1535817817&ri=8192&rs=8192&setec=524e7d82215202151d112d853fcb2303"
    }
  ]
}