{
  "modId": 37841.0,
  "modName": "Shock Cloaked Spider Companion",
  "summary": "Would you like to have a Shock Cloaked Spider that follows you around? Today\\'s your lucky day! He will attack enemies for you and even carry some items for you!",
  "descriptionHtml": "Here is my Shock Cloaked Spider follower.\r\n\r\nThis was much more challenging to create than a human follower, however this spider should be able to do most things that any other companion can do, even serve as a pack mule! Small and discrete so as to not be too annoying!\r\n\r\nYou can find him in The Retching Netch in Raven Rock.\r\n\r\nLet me know if there are any bugs, and I am also taking suggestions for a good name for him. If you think of a good name for him, post it in the comments, please!\r\n\r\nKeep in mind, you will need the Dragonborn DLC and most likely the latest update in order to use this mod.\r\n\r\nKnown Issues:\r\n\r\nI am aware of an issue where when you attack the spider, he may stop responding to your commands. (You will be able to initiate dialogue, but not be able to select an option.) I am not sure how to fix this, I have been told it is a vanilla bug, but I don\\'t believe this to be the case. If anyone happens to know what to do, I will be happy to fix it and update this mod.",
  "categoryId": "65",
  "version": "1.0",
  "author": "TearsOfCrimson",
  "createdUnix": "1372711440",
  "updatedUnix": "1372711433",
  "containsAdultContent": false,
  "uploadedBy": "TearsOfCrimson",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036763",
      "name": "Shock Cloaked Spider Companion",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Shock Cloaked Spider Companion-37841-1-0.rar",
      "uploadedUnix": "1372711433",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/195d23dc634728a112f984147187fc835da161a2e1d9013dccdb0fc60b8cedf2/analysis/1407625206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shock%20Cloaked%20Spider%20Companion-37841-1-0.rar?fid=1000036763&ttl=1535817806&ri=8192&rs=8192&setec=f9d4d701bcfa26939570bb1e7062482f"
    }
  ]
}