{
  "modId": 37855.0,
  "modName": "Lakeview Manor Town and Fort",
  "summary": "This mod adds a 3 part town to Lakeview Manor.  The first part is the home district where your home is location.  Leading down the mountains through tower access will bring you into the main town where most of the villagers will live and the market district resides.  The third part is the docks district which includes a scripted lumbermill, various",
  "descriptionHtml": "This mod adds a 3 part town to Lakeview Manor. The first part is the home district where your home is location. Leading down the mountains through tower access will bring you into the main town where most of the villagers will live and the market district resides. The third part is the docks district which includes a scripted lumbermill, various ships, a lighthouse, and a scripted drawbridge. \r\n\r\n*UPDATE* Version 1.03 is finally released. This release includes merchants, guards, and all miscellaneous NPCs. This release also includes some minor/major bug fixes that were found by people testing the mod or simply playing it. Thank you everyone for your feedback!  A heads up.  Some people have experienced lag and crashing with skyrim wildlife overhaul.  I\\'m not sure why this is.  Although this mod runs flawlessly on my computer, I cannot promise that it will do the same for yours.  If you have a lower end PC you may have to sacrifice some mods for it.  This is due to the fact that Skyrim apparently caps at 3.1GB according to S.T.E.P.  It has something to do with your VRam mirroring your memory.  I\\'ve tried to make it as user friendly as possible.  So hopefully this will work for some people.  I may eventually make another mod which is closed off from the world space, and treated as a seperate world space similar to whiterun.  This would be a more friendly mod for people running lower end rigs.\r\n\r\nNPC Routines: The merchants sell items 8am to 8pm, eat/go home 9pm to 12am, sleep 12am to 8 am. The guards have rotating schedules involved around 16 hours of work, 8 hours of eat/sleep. During the day expect there to be a lot of npc\\'s outside from 8am to 8pm, and likewise throughout the night expect the tavern to get crowded as people eat and drink. Have fun and enjoy! \r\n\r\nTo Do: 1.03.5 will contain a bit of an overhaul on the appearance of the docks. The walls appear way too jagged for my taste.  \r\n\r\nThis mod adds a 3 part town to Lakeview Manor.  The first part is the home district where your home is location.  Leading down the mountains through tower access will bring you into the main town where most of the villagers will live and the market district resides.  The third part is the docks district which includes a scripted lumbermill, various ships, a lighthouse, and a scripted drawbridge.\r\n\r\nThis first version includes all exterior work, and 100% exterior hand navmeshing.  The navmeshing is 100% working and tested.\r\n\r\nI went for a Riften architecture approach as it seemed fitting for a nature spot such as lakeview manor, coated in green and lush with flora.\r\n\r\nI won\\'t say too much about what is included in the mod because I think it\\'s important to give the player something to look foward to exploring.  That being said there are no interiors or NPC\\'s done just yet.  The mod is released in three installments to make it easier and less time consuming.  The first installment here is the exteriors and exterior navmeshing.  The second installment includes all interiors and all interior navmeshing.  The third installment will include 30-40 NPC\\'s all uniquely scripted (sorry no voice acting for now).  The fourth installment depends on how popular the mod gets and will more than likely include some voice acting, a large quest chain, and a very large dungeon with various floors of difficulty.\r\n\r\nEverything that is in the mod currently is 100% scripted and working as intended.  The only exception to this is the mannequins in one of the towers. I may have to eventually write up a new npc template and new scripting to make them work properly, if they are in akward areas and not on their pedistals, fast travel somewhere then come back and they should be in the correct location.  Currently there are too many too close together and it causes their poses to mix up.  Although you can certainly still use the mannequins, they may look a bit odd.  The drawbridge in the docks district will go up and down when you activate the levers to the left of them on the fort walkway.  The lumbermill works just like any other lumbermill and is scripted.  The new farm for your house has 21 planter soils which are also scripted and working.  There are also approximately 25-30 planter soils through town incase you wanted a certain kind of flora look and didn\\'t like mine, these are also scripted.  The farm animals are all scripted to stay within their locations.\r\n\r\nLastly I want to thank and give credit to whpsh for his work on Lakeview Flats, it gave me a flat terrain to work with and provided me with the town walls and stairs to the home (link is below).  I do have his permission to work with his mod.\r\nhttp://skyrim.nexusmods.com/mods/26289/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D26289%26preview%3D&pUp=1\r\n\r\nQ&A:\r\n\r\nQ1: Will I need to build my house before I install?\r\nA1: No, when I mod I test vigorously to make sure these kinds of things do not happen.  Everything is scripted properly to work with everything in the BYOH setup.  For example, if you built your apiary prior to installing the mod, you would still end up with three apiaries, a fish hatchery, and a grain mill on your saved game.  The same is true for uninstalling (it just reverts to what it was no problems). Just check or uncheck the mod.\r\n\r\nQ2: Can I use other lakeview terrain altering mods with this one?\r\nA2: No, this is a bad idea.  I tried this once and I ended up with 2 levels of terrain, it was frightening.\r\n\r\nQ3: Lanterns of Skyrim?\r\nA3: I use this mod aswell, and from what I can tell it is definately alright to use LoS with this mod.  The only off thing is two random lanterns in town which are not really in bad spots but their lighting looks odd compared to the other lanterns, not to mention they are completely different lamp posts.\r\n\r\nQ4: Why am I lagging?\r\nA4: Chances are if you just installed the mod you might experience a small amount of lag as it updates your cache.  This shouldn\\'t last longer than 10 seconds.  I personally have a only decent computer and I can run it flawlessly with CK opened, ultra graphics, 8xAA, and 8xAF.\r\n\r\nQ5: How long until the people and interiors are done?\r\nA5: The exteriors and hand navmeshing took me about 1 week and 2 days to do.  Interiors is just a lot of duplicating interiors except for special interiors.  So the next version likely no more than a week.  The final version with scripted npcs, maybe 2 weeks but don\\'t hold me to it.\r\n\r\nQ6: How do I report bugs?\r\nA6: Leave them in the comments below.\r\n\r\nQ7: TES5EDIT SAYS THIS!!!\r\nA7: Yep, it\\'s supposed to.  Chances are if you see navmesh deletion there\\'s a good reason for it.  If you\\'d rather I could leave it as is and have your followers trying to run through buildings/walls/mountains.  Trust me, I spent about 3 days just doing all the navmeshing by hand and you don\\'t even want to see how awful it was before that. TES5EDIT is a fantastic tool, but you have to understand why modders do what they do.\r\n\r\nQ8: Is this crashing me?\r\nA8: I run exactly 153 mods including this one.  I have yet to experience a crash to desktop.  Chances are if you\\'re crashing to desktop it\\'s likely not this mod doing it, it\\'s probably a load order issue and if that is the case I recommend nexus mod manager and BOSS.",
  "categoryId": "53",
  "version": "1.03",
  "author": "Ice9000",
  "createdUnix": "1372742125",
  "updatedUnix": "1374044230",
  "containsAdultContent": false,
  "uploadedBy": "ice9000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036825",
      "name": "Lakeview Manor Town and Fort",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1298",
      "fileName": "Lakeview Manor Town and Fort-37855-1-01.rar",
      "uploadedUnix": "1372742117",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/94a98e39a45a255469655f8c6e2a5fa91ce86a4ed7bc1552849171bdb13b0ee1/analysis/1407625578/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20Manor%20Town%20and%20Fort-37855-1-01.rar?fid=1000036825&ttl=1535817827&ri=8192&rs=8192&setec=05324f56358899f27f93d7f95b304b74"
    },
    {
      "fileId": "1000037161",
      "name": "Lakeview Manor Town and Fort",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1670",
      "fileName": "Lakeview Manor Town and Fort-37855-1-02.rar",
      "uploadedUnix": "1372904968",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/68a74992801eaccb2f1d962b2a59f40ec44aa854ce27bef97a960ee87aa459d6/analysis/1407630431/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20Manor%20Town%20and%20Fort-37855-1-02.rar?fid=1000037161&ttl=1535817827&ri=8192&rs=8192&setec=7bbcd7126ec85a6dedd459609d2094b4"
    },
    {
      "fileId": "1000039290",
      "name": "Lakeview Manor Town and Fort",
      "version": "1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11334",
      "fileName": "Lakeview Manor Town and Fort-37855-1-03.rar",
      "uploadedUnix": "1374027102",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/4ccbbcf9ebeba1bc385a0fc5b325ac775259eb491c26eab8377d46def875c8da/analysis/1407646708/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20Manor%20Town%20and%20Fort-37855-1-03.rar?fid=1000039290&ttl=1535817828&ri=8192&rs=8192&setec=3a19994e32d37f9053687ff798639260"
    },
    {
      "fileId": "1000039313",
      "name": "FelgladeFaceGenData",
      "version": "1.00",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "9576",
      "fileName": "FelgladeFaceGenData-37855-1-00.rar",
      "uploadedUnix": "1374044230",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/160c87e7b66585f1a36612e35f87196cffa22fd9d5d79a83546343baa68647c8/analysis/1407646986/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FelgladeFaceGenData-37855-1-00.rar?fid=1000039313&ttl=1535817828&ri=8192&rs=8192&setec=0d7ff173adda8e6e73ca0a37de406ed1"
    }
  ]
}