{
  "modId": 37866.0,
  "modName": "Additional Invisibility Spells",
  "summary": "Adds two more invisibility spells to the game - one to that must be continually cast (and therefore has a time limit and magicka consumption of your choosing) one to be used on NPCs (ie. to make your companions invisible as well). ",
  "descriptionHtml": "The vanilla invisibility spell is good fun, but it has its limitations for a magical thief. Ever found it odd that NPCs don\\'t notice your trespassing when you are in invisible but your companion is manifestly not so? Ever been irritated by having to use magicka for a full 30 seconds of invisibility when all you need is a quick 5 second burst? Then this mod is for you!\r\n\r\nThis mod adds two spells:\r\nInvisibility Stream: must be continually cast to take effect remain invisible (just like the very first healing spell of the game). Calculated so that casting it for 30 seconds costs the same amount of magicka as the vanilla spell. It also incidentally aids stealing, as it almost instantly recasts after activating an object breaks the spell.\r\n\r\nTargeted Invisibility: This spell is the vanilla spell but redirected to fire like the spell \\\"Soul Trap\\\" rather than applying to the player\\'s character. It can thus be used to hide one\\'s companions for greater realism and immersion when sneaking (it serves no practical use as as far as I\\'m aware NPCs do not notice your companion if you are invisible). It costs the same amount of magicka as the vanilla spell.\r\n\r\nBoth Spells are fully integrated into the game in the same way as the vanilla (i.e must be purchased from Drevis Neloren upon reaching a skill of 75 in Illusion).\r\n\r\n\r\nI had intended to make a third spell which would be a combination of the Vanilla \\\"Invisibility\\\" and \\\"Targeted Invisibility\\\" so that your entire party could become invisible with just one spell being cast, but this is either impossible to achieve using the creation kit or I simply can\\'t work out how to do so.\r\n\r\nThis is my first mod and I\\'ve tested it myself but obviously I can\\'t be sure there will be no bugs with other player\\'s saves, so obviously take care as with all other mods on the Nexus. No DLC should be needed, it should require nothing more than an updated version of Skyrim. If anyone notices any problems or has the know-how to help with the above do get in touch.",
  "categoryId": "75",
  "version": "1.0",
  "author": "g_sargent",
  "createdUnix": "1372767509",
  "updatedUnix": "1372767494",
  "containsAdultContent": false,
  "uploadedBy": "guysargent",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036898",
      "name": "Additional Invisibility Spells",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Additional Invisibility Spells-37866-1-0.zip",
      "uploadedUnix": "1372767494",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8b71ec950306af568bf7c593ea6a031e607e10a4f349a863f4f27224f8645fa3/analysis/1407625864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Additional%20Invisibility%20Spells-37866-1-0.zip?fid=1000036898&ttl=1535817865&ri=8192&rs=8192&setec=c4b7146e234795c4c291cd96cbdefb8f"
    }
  ]
}