{
  "modId": 37895.0,
  "modName": "Smithing Perks Overhaul - Remade and Updated - French - Francais",
  "summary": "Traduction du mod de kryptopyr en francais \r<br />Reorganise completement le fonctionnement de la forge pour une plus grande cohérence.\r<br />\r<br />Version 3.3",
  "descriptionHtml": "[size=6][color=blue]SMITHING[/color] PERKS [color=red]OVERHAUL\r<br />\r<br />[/color][color=#ff0000]JE CONSEILLE PLUTÔT D&#39;UTILISER CETTE TRADUCTION DU MOD QUI TRADUIT EN PLUS LES MENUS :[/color] [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/amelioration_des_atouts_de_forgeage]TRADUCTION[/url][color=red]\r<br />[/color][/size]\r<br />\r<br />[size=200][color=#6aa84f][size=5]Nouvelle version 3.3 &#33;[/size][/color][/size]\r<br />Nouveautés: Intégration des changements de la nouvelle version de WAF et correction d&#39;un problème avec l&#39;installeur.\r<br />[color=orange]\r<br />Ce mod a été conçu pour fonctionner en simultané avec [url=http://www.nexusmods.com/skyrim/mods/36956]Weapons & Armor Fixes[/url], [url=http://www.nexusmods.com/skyrim/mods/50758]Clothing & Clutter Fixes[/url], [url=http://www.nexusmods.com/skyrim/mods/50781/?]Complete Crafting Overhaul[/url]\r<br />Les autres mods ne sont pas obligatoire (sauf WAF), mais certaines fonctions de SPO peuvent ne pas fonctionner correctement sans ces mods.[/color]\r<br /> \r<br />[color=red]CE MOD NÉCCESSITE[/color] [url=http://skyrim.nexusmods.com/mods/36956/]WEAPONS AND ARMOR FIXES-REMADE[/url] [color=red]POUR FONCTIONNER[/color]\r<br />\r<br />Ceci est une traduction du mod de kryptopyr Smithing Perks Overhaul qui est basé sur celui de Headbomb, ce mod modifie l&#39;arbre de compétence du forgeage qui s&#39;adapte mieux au mod Weapons and armors fixes.\r<br />\r<br />Lien du mod original : [url=http://skyrim.nexusmods.com/mods/33959/]Smithing Perks Overhaul[/url]\r<br />N&#39;hésitez pas à aller endorser son mod &#33;\r<br />\r<br />NÉCESSITE :\r<br />Skyrim en 1.9 ou plus\r<br />Le [url=http://skyrim.wiwiland.net/spip.php?article18]PNOS[/url] est fortement recommandé mais pas obligatoire\r<br />[url=http://skyrim.nexusmods.com/mods/36956/]Weapons and armor fixes-remade[/url] lui est obligatoire.\r<br />De très bons compléments à ce mod sont [url=http://www.nexusmods.com/skyrim/mods/50781/?]Complete Crafting Overhaul[/url] (CCO) et [url=http://www.nexusmods.com/skyrim/mods/50758/?]Clothing & Clutter fixes[/url] (CCF)\r<br />\r<br />Ordre de chargement :\r<br />-USKP/PNOS\r<br />-Weapons & Armor fixes\r<br />-Clothing & Clutter fixes\r<br />-Complete Crafting Overhaul\r<br />-Smithing Perks Overhaul (son ordre de chargement n&#39;est pas primordial)\r<br />\r<br />\r<br />\r<br />Il existe plusieurs versions du mod :\r<br />[color=green]&#34;Vanilla&#34;[/color] = arbre de compétence normal et avec les changements inscrits ci-dessous.\r<br />[color=pink]vanilla improved perk tree[/color] = arbre de compétence modifié légèrement avec les changements inscrits ci-dessous.\r<br />[color=yellow]new perk tree[/color] ([color=red]traduite &#33;[/color]) = arbre de compétence très modifié.\r<br />(regardez les images pour comprendre)\r<br />\r<br />\r<br />\r<br />[color=red]CHANGEMENT DANS LES COMPÉTENCES[/color]\r<br />Les changements suivants sont dans la version [color=green]&#34;vanilla&#34;[/color] et [color=pink]&#34;Improved Vanilla perk tree&#34;[/color]\r<br />\r<br />[color=orange]FORGE BASIQUE:[/color] (Anciennement Forge d&#39;acier)\r<br />Vous permet d&#39;améliorer les armes et les armures suivantes deux fois plus : peau, cuir, fer, à bandes, impériale, sombrage, bois, falmer, argent, clouté, parjure, penitus. \r<br />Si vous possédez Dawnguard  il y a en plus : l&#39;armure vampire\r<br />\r<br />[color=orange]FORGE AVANCÉE[/color] (Anciennement Armures supérieures)\r<br />Vous permet d&#39;améliorer les armes et les armures suivantes deux fois plus : elfique dorée, draugr aiguisé, falmer aiguisé, lame, confrérie noire, guilde des voleurs, maître de guilde, rossignol, armes de forgeciel, cimeterre, armure du héros.\r<br />Si vous avez Dawnguard en plus : garde de l&#39;aube, vampire royal, falmer lourde, falmer durci, falmer antique.\r<br />Si vous utilisez Dragonborn en plus : chitine lourde et ostalium amélioré. \r<br />\r<br />[color=orange]FORGE DWEMER[/color]\r<br />Cette compétence ne permet plus d&#39;améliorer les armes Draugr aiguisées (déplacée en Forge Avancée) \r<br />\r<br />[color=orange]FORGE ELFIQUE[/color]\r<br />Cette compétence ne permet plus d&#39;améliorer l&#39;armure elfique dorée (déplacée en Forge Avancée)\r<br />Si vous avez Dragonborn cette compétence permet maintenant d&#39;améliorer l&#39;armure de la Morag Tong deux fois plus.\r<br />\r<br />\r<br />\r<br />[color=#ff0000][size=6]LA  DESCRIPTION CI-DESSOUS N&#39;EST PLUS 100% COMPLÈTE &#33;&#33;&#33;[/size][/color]\r<br />\r<br />[color=yellow]NEW PERK TREE / NOUVEL ARBRE DE COMPÉTENCE[/color]\r<br />[color=red]Version nécessitant Dawnguard et Dragonborn :[/color]\r<br />\r<br />[color=green]Pourquoi un nouvel arbre ?[/color]\r<br />La division légère / lourde de l&#39;arbre de compétence &#34;vanilla&#34; n&#39;a jamais vraiment fonctionné pour moi. Les armes ne suivent pas la division léger / lourd, et si vous jouez un personnage en armure légère, je sentais que je ne pouvais pas concevoir certaines des armes les plus haut de gamme dans le jeu sans avoir à investir un nombre incalculable de points dans l&#39;arbre de forge.\r<br />\r<br />En outre, le jeu &#34;vanilla&#34; a utilisé la division d&#39;une façon très incohérente. Pourquoi l&#39;armure de plates est sur le côté «léger» de l&#39;arbre ? Dragonborn parvient à créer encore plus de confusion ... avec une armure lourde de chitine sur le côté léger, l&#39;armure légère de Stalhrim sur le côté le plus lourd, et l&#39;armure Nordique sur le côté léger. Ce genre de volte-face ne m&#39;a tout simplement pas  convaincu.\r<br />\r<br />Le deuxième problème majeur avec la façon dont les compétences de forge &#34;vanilla&#34; fonctionnent, c&#39;est qu&#39;elles ont tendance à créer des déséquilibres entre les différentes catégories d&#39;équipements.\r<br />Les armes et armures de faibles niveaux seront souvent meilleur que des éléments de plus haut niveau jusqu&#39;à ce que vous preniez des compétences supplémentaires qui peuvent améliorer d&#39;avantage ces éléments de haut niveau.\r<br />\r<br />Pour résoudre ces problèmes, j&#39;ai fait disparaître la division légere / lourde dans les compétences et plutôt divisé l&#39;arbre entre artisanat et amélioration. Les compétences d&#39;artisanat vous permettent de créer de nouveaux types d&#39;armes et d&#39;armures, mais ils ne modifieront pas le montant auquel vous pouvez améliorer ces objets. Les compétences d&#39;amélioration s&#39;appliquent à tous les objets et s&#39;adapteront progressivement à votre capacité à améliorer les objets avec chaque compétence supplémentaire acquise. Ce qui élimine également le problème dans la tentative de comprendre quelle compétence vous permet de modifier vos objets uniques et votre équipement ... maintenant ils vont tout simplement utiliser les mêmes compétences adaptées que tout les autres éléments.\r<br />\r<br />Pour simplifier l&#39;installation, lorsque la version NEW PERK TREE de ce mod est installée, elle va supprimer toutes vos compétences de forge sauf Forge basique et Forgeron d&#39;enchantement, et vous redonner le nombre équivalent de points de compétences à redistribuer comme bon vous semble. [color=yellow]Vous devez avoir SKSE installé pour que cela fonctionne[/color]. Si vous n&#39;avez pas SKSE d&#39;installé, alors vous pouvez  ajouter / supprimer les points de compétences en utilisant la console.\r<br />\r<br />Le NEW PERK TREE existe  maintenant en 2 versions:\r<br />[color=red]New Perk Tree #1[/color] a le même nombre de compétences que l&#39;arbre vanilla. La dernière compétence a des avantages combinés, mais exige que vous remplissiez les deux branches pour débloquer les deux parties de l&#39;avantage.\r<br />[color=red]New Perk Tree #2[/color] a une compétence de plus que l&#39;arbre vanilla. Il divise la compétence Maître à la fois en un artisanat (Draconique et Daedrique) et une amélioration de compétence (Maître en forge).\r<br />[color=pink](Des images sont disponibles pour vous montrer les différences entre le 1 et 2)[/color]\r<br />\r<br />CHANGEMENTS DES COMPÉTENCES EN NEW PERK TREE\r<br />[color=orange]DÉBUTANT EN FORGE:[/color] Améliore vos équipements de 20 %.\r<br />[color=orange]APPRENTI EN FORGE:[/color] Améliore vos équipements de 40 %.\r<br />[color=orange]ADEPTE EN FORGE:[/color] Améliore vos équipements de 60 %.\r<br />[color=orange]EXPERT EN FORGE:[/color] Améliore vos équipements de 80 %.\r<br />[color=orange]MAÎTRE EN FORGE:[/color] [color=yellow]New Perk tree #2 seulement.[/color] Améliore vos équipements de 100 %.\r<br />\r<br />[color=orange]FORGE BASIQUE:[/color] Idem à Forge d&#39;acier sans les bonus d&#39;amélioration\r<br />[color=orange]FORGE ELFIQUE:[/color] Vous permet de créer les objets en Elfique, en Dwemer et en Chitine.\r<br />[color=orange]FORGE AVANCÉE:[/color] Vous permet de créer les objets en Écailles, de Plates, d&#39;Orque et Nordiques.\r<br />[color=orange]FORGE CRISTALLINE:[/color] Vous permet de créer les objets en Verre, en Ébonite et de Stalhrim.\r<br />[color=orange]DRACONIQUE ET DAEDRIQUE:[/color] [color=yellow]New Perk tree #2 seulement.[/color] Vous permet de créer les objets Draconiques et Daedriques \r<br />\r<br />[color=orange]MAÎTRE EN FORGE:[/color] [color=yellow]New Perk tree #1 seulement.[/color]  Vous permet de créer les armes Draconiques et Daedriques. Cette compétence nécessite celle de Forge Cristalline (vous ne pouvez pas l&#39;obtenir simplement en remontant le côté «amélioration» de l&#39;arbre de forgeage). Cette compétence vous permet également de multiplier par deux l&#39;efficacité de tous les objets...mais cette partie de la compétence exige que vous soyez également Expert en Forge. Ainsi, afin d&#39;obtenir la compétence elle-même, vous devez remplir le côté &#34;Amélioration&#34; de l&#39;arbre. Mais si vous remplissez le deuxième côté de l&#39;arbre, vous obtiendrez l&#39;effet supplémentaire de cette compétence.\r<br />\r<br />INFORMATION ADDITIONNELLE\r<br />Ce mod ne fait pas de corrections aux armes et armures et il ne rajoute pas les recettes manquantes d&#39;artisanat. Ce mod permet tout simplement aux compétences de s&#39;appliquer à toutes les armes et armures qui ont déjà les mots-clés appropriés et leur recette.\r<br />\r<br />\r<br />\r<br />\r<br />Logiciel utilisé  : [url=http://skyrim.nexusmods.com/mods/29457]ESP-ESM Translator[/url] d&#39;Epervier 666\r<br />\r<br />REMERCIEMENTS :\r<br />\r<br />kryptopyr, pour son superbe mod et son autorisation à le traduire\r<br />Epervier 666, pour son outil de traduction qui facilite grandement la vie...;) \r<br />Bethesda pour son jeu\r<br />Le forum Canard PC ;)",
  "categoryId": "95",
  "version": "3.3",
  "author": " kryptopyr translated by mohal",
  "createdUnix": "1372798468",
  "updatedUnix": "1426347860",
  "containsAdultContent": false,
  "uploadedBy": "mohal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000151472",
      "name": "Smithing Perks Overhaul - COMPLET",
      "version": "3.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "555",
      "fileName": "Smithing Perks Overhaul - COMPLET-37895-3-3.7z",
      "uploadedUnix": "1426347860",
      "modVersion": "3.3",
      "virusScanUrl": "https://www.virustotal.com/file/8f9222b435a1a1b305d8d77638ce149e2052316ad76bec1239b1f33792545af3/analysis/1426347904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Smithing%20Perks%20Overhaul%20-%20COMPLET-37895-3-3.7z?fid=1000151472&ttl=1535817897&ri=8192&rs=8192&setec=569257f05b27834c020a897f0b01f9e5"
    }
  ]
}