{
  "modId": 37903.0,
  "modName": "Master Blade",
  "summary": "",
  "descriptionHtml": "Requirements: skyrim.esm, update.esm\r\n\r\nDescription: This is my first mod so any feedback would be appreciated :) , I made the model and texture in my spare time during uni but now it\\'s my summer holiday so I wanted to try and put into Skyrim.\r\n\r\nStory: The story behind this weapon is it is an replica of the original master blade, the original master blade was forge by a master blacksmith who found a way to fold and sharpen metal to make it extremely durable and sharp enough to cut through armor easily. However the sword was stolen and passed through many hand before it disappeared, however one of these hands were those of a young blacksmith who learned how the blade was forged through trial and error and passed on this skill to smiths skilled enough to bend ebony.\r\n\r\nNote: my screenshots suck, anyone wanna post theirs feel free :) btw thanks grotte and FrostTech for the awesome screen shots i\\'ve added them in to the main images page, can\\'t wait to see more X)\r\n\r\nInstallation:\r\n\r\n- Extract the contents of the ZIP folder into skyrim Data folder\r\n- Use NMM to install\r\n\r\nUn-Installation:\r\n\r\n-Delete files from skyrim data folder\r\n- Use NMM to un-install\r\n\r\nThings to do: The sheath texture doesn\\'t seem to load properly which I will try and fix. If anyone finds anything that needs fixing give me a shout and i\\'ll try and fix it. Also if anyone knows how to fix the sheath please contact me because I have no clue.\r\n\r\nPERMISSION: Anyone is free to use this mod as long as they contact me first, give credit and don\\'t charge for it. Also this mod is not to be posted on any other site without permission.\r\n\r\nSpecial thanks :\r\n\r\n- Prod80\r\n- Tamira \r\n- Gunz77\r\n- CaBaL120  \r\n-  Thundersquid ",
  "categoryId": "55",
  "version": "1.1",
  "author": "Urbanshiv92",
  "createdUnix": "1372800540",
  "updatedUnix": "1372800523",
  "containsAdultContent": false,
  "uploadedBy": "urbanshiv92",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000036968",
      "name": "Master blade",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2022",
      "fileName": "Master blade-37903-1-1.zip",
      "uploadedUnix": "1372800523",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0cf8c1c28cf9f35a27b6da4da14734c849c5fab923e2099137469e3a6c76be76/analysis/1407629072/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Master%20blade-37903-1-1.zip?fid=1000036968&ttl=1535817910&ri=8192&rs=8192&setec=dd0d73a3056e27f9334e301582c30f29"
    }
  ]
}