{
  "modId": 37922.0,
  "modName": "Sword Art Online -Alpha overhaul project- -discontinued-",
  "summary": "Idea for a SAO overhaul, encompassing all 100 floors of Castle Aincrad. This is currently a start-up idea and I am only releasing floor 1 as it progresses. I will change this into a beta mod once floor 1 is completed and see how the community reacts  \\\\o/",
  "descriptionHtml": "Okay, I regret to inform everybody that I have been contacted by ASCII Media Works: Dengeki Bunko and A-1 Pictures in regards to this mod. \r\n\r\nTo cut it short, they intend to seek legal action against me if I continue production of this mod, and fail to remove the files associated to the mod, as the Sword Art Online series is in copy-write to the above mentioned companies. It has also stated that all work that has been currently done will be considered the Intellectual Property of the above mentioned companies, which effectively prevents me from using what I have already worked on and continuing it for an alternate release under a different title. \r\n\r\nIt was also explained to me that the reason my mod is being targeted, where armor and weapon mods are not, is the fact that the release of it would cut in to their profits if they wanted to release a game in America and Europe. That makes me hopeful for a SAO game, but not exceedingly so.\r\n\r\nThis saddens me greatly, to know that the work that I have done so far has been, for lack of better terms, all for not. I will continue to make mods, and I look forward to releasing mods in the future. That won\\'t change. But unfortunately for me, and all of the fans of SAO, this mod legally cannot be released now, and I must remove all files associated to it from the Nexus website. This also explains to me why no one has released a mod of this nature, which disappoints me, as we are not likely to see a SAO game in the Americas any time soon. \r\n\r\nIf you wish to contact me, feel free to do so. As I stated, I will continue to make mods, as this is a great hobby, and something to do in my spare time. So if you have a mod request let me know and pm me!\r\n\r\nAlso, I will keep this open so, with files removed, so that no other modder has to go through this if they decide they want to try to make a SAO mod in the nature that mine was based.",
  "categoryId": "79",
  "version": "n.a",
  "author": "ItsTrypp",
  "createdUnix": "1372866838",
  "updatedUnix": "1372866838",
  "containsAdultContent": false,
  "uploadedBy": "itstrypp",
  "primaryFile": null,
  "files": []
}