{
  "modId": 37936.0,
  "modName": "Eves Children 3 - Rakshasa Race - Stone Cats",
  "summary": "A daedric race from Hindu mythology; resembles the Khajiit, but are known to fight with brutal claws and a poisonous ebony armor-like cloak inspired by Boethia.  Called \\\"Stone Cats\\\" by frightened Tamriel children, they were thought to be legend only...until now.",
  "descriptionHtml": "This Khajiit-inspired race of daedric creatures has origins in Hindu mythology as a terrifying and unpredictable demonic race with fearsome claws and disposition. Only a few members of this race resolved to become forces for good, notably Vibhashana and his wife Sarma, who became forces that aided mankind in their struggles against evil. They appear as mighty Stone Cat-like creatures, and I present them here as two NPC\\'s located in Falkreath near the blacksmith\\'s home, and also as a PC race for your enjoyment. \r\n\r\nThey have terrifying unarmed claw attacks, as well as the ability to summon a Dremora Lord in times of duress. They also see in the dark as the Khajiit do, and in combat will often shield themselves with a cloak inspired by Boethia that resembles ebony armor with a poisonous defense radius. They have strong blocking skills, and inspire fear and even paralysis from their foes in combat. \r\n\r\nVibhashana is extra big, and his wife Sarma is quick and deadly as well. They are capable of being followers as well as marriagable. Because there aren\\'t enough Khajiit-looking marriage partners in Skyrim! Cuz why not. \r\n\r\nI have had some trouble with them retaining their base facial characteristics, so you may have to go into Creation Kit and upload their facegens. Perhaps I will post a link here to a youtube video that illustrates step by step how to do this. \r\n\r\nThey use the Khajiit morph base, and add some skills, as well as Argonian hornsto look gargoyle-esque, which was my aim. Enjoy them, they are fun to watch as they defend you from the rampant hostilities of Skyrim! \r\n\r\nIf you would like to recruit more than one, I suggest you also try the Amazing Follower Tweaks mod, or the Ultimate Follower Overhaul to have more than one NPC at your side.",
  "categoryId": "34",
  "version": "1.1",
  "author": "EveGK",
  "createdUnix": "1372963101",
  "updatedUnix": "1376541691",
  "containsAdultContent": false,
  "uploadedBy": "EveGK",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000047042",
      "name": "eveschildrenrakshasarace",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "eveschildrenrakshasarace-37936-1-1.zip",
      "uploadedUnix": "1376541691",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a334714b5cbd28a67960182f9cb822e96449f65705b9908d068e3d3e1cae3c5b/analysis/1407682588/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/eveschildrenrakshasarace-37936-1-1.zip?fid=1000047042&ttl=1535817960&ri=8192&rs=8192&setec=e023497bfb49318ff79328f7d0dfb258"
    }
  ]
}