{
  "modId": 37943.0,
  "modName": "Begleiter Superpack GER-ENG",
  "summary": "Ein kleines Modpaket das 9 Mods in sich vereint die man normalerweise, erst länger auf Nexus suchen muss.",
  "descriptionHtml": "Diese Mod enthält 9 unveränderte Begleiter-Mods einige davon auch als Reittiere verfügbar. Diese Datei ist wesentlich kleiner als meine vorangegangenen Modpakete und nicht so umfangreich. Das Modpaket enthält die folgenden Mods:\r\n\r\n\r\nArmored SabreCat Mount German von tumbajamba_norden\r\nDragon Fly Mod von hfiani\r\nMy Pet Werewolf von redfred296\r\nPrides of Skyrim von frankthefish\r\nSummon Big Cats Mounts and Followers von gg77\r\nSummon Werewolf and Co von gg77\r\nTame The Beasts of Skyrim von TheSkoomaKing & hfiani\r\nJango PET-MOUNT Sabrecat von rbfloat05\r\nSkyTest - Realistic Animals and Predators - deutsch von Verodor\r\n\r\nDieses Modpaket fügt dem Spiel Löwen, Panther, Tiger und Leoparden hinzu. Ebenso einen beschwörbaren Drachen(Flugfähig) den man Reiten kann, wie man ihn genau auf einem bestehenden Speicherstand freischaltet kann ich allerdings nicht sagen, weil 3 Worte der Macht dafür nötig sind die man wohl im Laufe der Graubärte-Questreihe bekommt oder so ähnlich. Alle Tiere aus Prides of Skyrim, sind auch als Begleiter bei den verschiedenen Ställen zu finden(Eines pro Stall. In Weißlauf steht hinter dem Wohngebäude der Ställe z.B. der männliche Löwe). Die Zauber zum Beschwören als Reittiere gibt es bei den Hofzauberern in Weißlauf(Drachenfeste) oder Einsamkeit(Blauer Palast). Hier eine kleine warnung, Löwen sind die am häufigsten vorkommenden Tiere, und sehr gefährlich, denn der Modersteller von Prides of Skyrim hat den Tierchen sogar eine kleine KI spendiert. Wie richtige Löwen, greifen diese auch im Rudel an, und konzentrieren sich zudem überwiegend auf ein Ziel. Die Rudel können dabei eine übliche größe von 5 - 20 Tieren haben, also vorsicht.\r\n\r\n\r\n\r\nFür ein Atmosphärisch Perfektes Spielerlebnis empfehle ich euch außerdem noch folgende Mods zu Installieren:\r\n\r\nTropical Skyrim von Soolie\r\n(ACHTUNG: Die Mod ist mit über 800 MB nicht nur groß sondern auch teilweise Leistungshungrig)\r\nDiese Mod verwandelt das ganze Game in eine Tropische Landschaft mit Palmen, Sandsturmeffekten und ähnlichem.\r\n\r\nWet and Cold von isoku\r\nDiese Mod fügt soetwas wie Kälterauch, Schnee- und Nässeeffekte auf Kleidung und Fell hinzu, was dem Spiel einen noch realistischeren Flair gibt.\r\n\r\n\r\nWie immer in meinen Modpaketen habe ich keine enthaltene Mod verändert, sondern nur zusammengefügt. Die Jeweiligen Rechte liegen also bei den angegebenen Personen.",
  "categoryId": "83",
  "version": "1.0",
  "author": "Nasrem",
  "createdUnix": "1372922359",
  "updatedUnix": "1372922353",
  "containsAdultContent": false,
  "uploadedBy": "Nasrem",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037185",
      "name": "Begleiter Superpack GER-ENG",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "51189",
      "fileName": "Begleiter Superpack GER-ENG-37943-1-0.7z",
      "uploadedUnix": "1372922353",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8ca811f2e7a2d68e7e0979b7a75cfdf62574548993ad7bd549fee929f96a7e51/analysis/1407630629/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Begleiter%20Superpack%20GER-ENG-37943-1-0.7z?fid=1000037185&ttl=1535817968&ri=8192&rs=8192&setec=0ea44fe4af517ef29bd66c7a096dbb31"
    }
  ]
}