{
  "modId": 37949.0,
  "modName": "NPC Essential to Protected",
  "summary": "All NPC\\'s that were marked Essential have now been marked Protected instead.",
  "descriptionHtml": "This sets all NPC\\'s that were set to Essential to Protected which means they\\'ll just take a knee and try to heal when they get low like followers. There were A LOT...\r\n\r\nSeveral NPCs in Skyrim are protected at some point during gameplay. This means, that, when their health depletes (usually down to 10% of its maximum, but this will occur even if the NPC\\'s health would have been reduced to zero), they enter a state called \\\"bleedout\\\", where they fall to their knees and are ignored by all hostile entities until their health regenerates. Unlike the similar essential status, they can still be killed if they are attacked by the player, where they will die as easily as non-protected NPCs.\r\n\r\nThere were plenty of mods that simply made essential NPC\\'s non-essential but I thought that making them protected instead would be better since there\\'s considerably less risk of them randomly getting killed while still giving you the ability to kill them.\r\n\r\nThis is untested and can completely mess up your game so make a save before you install and I don\\'t suggest even really using it without the knowledge that there\\'s a pretty good chance you can accidentally kill someone essential and even without that there\\'s a chance they may die and mess up quests. Use at your own risk.\r\n\r\nNo DLC NPC\\'s are included at this time.",
  "categoryId": "33",
  "version": "1.0",
  "author": "XunAmarox",
  "createdUnix": "1372954980",
  "updatedUnix": "1372954972",
  "containsAdultContent": false,
  "uploadedBy": "XunAmarox",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037237",
      "name": "Essential to Protected",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "129",
      "fileName": "Essential to Protected-37949-1-0.7z",
      "uploadedUnix": "1372954972",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/26f2f5e8ca08e73c75d381dae9d5ac5eb46064110d16d428c68b54752711aa58/analysis/1407631003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Essential%20to%20Protected-37949-1-0.7z?fid=1000037237&ttl=1535817988&ri=8192&rs=8192&setec=09f2b2f0239e1ee1efaf9e1f652a2d7d"
    }
  ]
}