{
  "modId": 37999.0,
  "modName": "Skyrim Wildlife Overhaul",
  "summary": "An overhaul of the somewhat dull wildlife of Skyrim, including behavior tweaks, improved diversity, and a few brand-new creatures, including dire wolves and lynxes!",
  "descriptionHtml": "Welcome to Skyrim Wildlife Overhaul Version 1.3 (North American Animals)\r\n\r\nUploaded a small fix, should now be able to craft leather from all new hides now. Manual installation recommended, just drop into your Data folder and overwrite.\r\n\r\nNew Animal Additions:\r\nGiant Short-Faced Bear- This massive Pleistocene mammal can rarely be found on the tundra, chasing moose and Megaloceros. The Giant Short-Faced Bear was considered a running bear, and had long legs for coursing after game. They were a plains animal, and not adapted to dense forest. To recreate this, the Giant Short-Faced Bear will spawn only on the tundra and other open areas. New model.\r\n\r\nBlack Bear- Regular bears (not cave or snow) are now black bears! Modeled after the North American black bear, a shy forest dweller. Slightly less aggressive, but will attack you if you get too close.\r\n\r\nMountain Lion- Last seen in Oblivion, the Mountain Lion has returned to Tamriel with a new model and texture. Can be found in forested regions and in the Reach. Less aggressive than a sabrecat. Uses the sabrecat rig, so the feet do that horrible sink into the ground thing.\r\n\r\nCave Lion-added the Pleistocene cave lion to Skyrim. Very big (the American cave lion, Panthera leo atrox was the largest cat to ever exist, standing over four feet tall at the shoulder). Mainly found on the tundra and other open areas. No mane yet. I am planning to add one, but the model is giving me trouble. From the cave paintings of Europe, we know that the cave lion did have a small mane, but no the big, full mane of the African lion. It apparently also had some stripes, like a tiger. The texture represents this.\r\n\r\nRaccoon- Small, shy and adorable, raccoons now dwell in Skyrim’s forests. New model and texture, uses the skeever animations.\r\n\r\nBeaver- Hand-placed around waterways, beavers are small, shy and rare. Currently, no beaver dams or lodges. I will add those later and create a few beaver ponds. New model and texture, uses the skeever rig.\r\n\r\nOther Changes:\r\nMoose are a bit bigger. Taller than a horse now.\r\nNew loot for all new animals. Includes caribou, elk, deer, lions, lynx, etc. All drops are usable in crafting and alchemy. Elk drop elk hide, deer drop deer hide, caribou drop caribou hide, etc. All fully usable in crafting.\r\nMore diversified leveled lists. Now you have a chance to encounter big, small, aggressive or cowardly versions of predators. This is still a work in progress, currently cave bears and sabrecats are done. This adds more realism, since not all animals behave exactly the same. Adds diversity as well. Planning to do this for every large predator, and some prey.\r\nChanged leveled lists so that any animal can spawn at any level. In vanilla Skyrim, you won’t see a sabrecat until around level 6, now you can encounter one at level 1. Same with bears. This does make Skyrim more dangerous for low-level characters, but it’s not too extreme. The animals are still leveled, so it’s not like Prides of Skyrim where a level 1 character gets eaten by a level 50 lion. If you’re level 1, you’ll find a level 1 sabrecat. A follower is recommended, but not necessary. This is for the sake of realism. Gameplay-wise, it makes sense to not have certain animals show up until certain levels, but it’s not very realistic. I may put out a version of this mod that does not include this if it becomes too much of a problem for people. I tested this with a level 1 character and found it not too difficult.\r\nBetter wildlife interactions. Edited factions so predators will defend their territories from other species. I came across a bear and a sabrecat chilling out together in the Reach and thought that wasn’t very real. In real life, bears and wolves will fight each other, as will bears and mountain lions. Now  they will in Skyrim too.\r\n\r\nPrevious Additions:\r\nDire Wolf\r\nLynx\r\nCaribou (name change)\r\nWhitetail Deer\r\nMegaloceros\r\nMoose\r\n\r\nFor anyone experiencing invisible animals, give the optional Wildlife Overhaul Invisible Animals Fix file a try. It is found under optional files. Let me know if this fixes the problem.\r\n\r\n\r\nI made this mod to improve upon the rather dull vanilla wildlife of Skyrim. I generally play a ranger-type character who spends most of their time out in the wilderness, and I was a bit disappointed with the lack of diversity in the Skyrim wildlife. While a number of great mods out there add diversity to Skyrim’s wildlife, like SkyTest Realistic Animals and Predators, and Real Wildlife Skyrim, I wasn\\'t completely satisfied. I\\'m a perfectionist, and if I perceive that something isn\\'t quite right, it bugs me. So I made my own mod. I like it, so I\\'m putting it out here in case anyone else might like it as well. If you don\\\\\\'t like some of my changes, feel free to let me know, or not use this mod. \r\nThis is the first release of a rather large project, as I intend to overhaul basically every aspect of Skyrim\\'s wildlife and make it a bit more interesting and realistic. My goal is to reduce the number of mods needed to diversify Skyrim by combining some of the aspects of my favorite mods and adding a few new items as well. Because Skyrim has a rather prehistoric feel to it, with Mammoths and sabre-tooth tigers roaming about, I have started adding a few more ice-age megafauna.\r\n\r\nWhat I intend to do:\r\nIncrease realism-Male and female animals, with unique models as necessary. For example, male and female wolves can share a model, but female deer need a new model (there\\'s female elk in game, but no female deer).\r\nBetter spawn points-Elk will be found primarily in the forested regions of Skyrim, while the deer (caribou) will be found mostly on the tundra and the frozen marshes.\r\nBetter behavior-Wolves and ice wolves are now non-aggressive and avoid roads. Sorry, but I don\\'t like perpetuating the stereotype of the \\\"evil\\\" wolf. They don\\'t eat people. Bears are somewhat less aggressive, but they\\'ll still come after you if you get too close.\r\nNow, wolves in Skyrim are an early source of leather and skill-ups, so it wouldn\\'t do to completely change them up without adding something in their place, which leads to:\r\nBetter Diversity-New creatures to populate the wilds of Skyrim. Currently, Dire Wolves have made their appearance. With a slightly new model, larger size, and aggressive behavior, these make the wilderness a more dangerous place. A new felid has been created as well to add diversity to the critters of Skyrim, the Lynx. This is a small, unaggressive cat (uses the fox behavior) with a shiny new model and texture. They are rare, but their pelts are quite valuable if you can get one. Currently, there is only one texture for the lynx, but more will be coming soon, once I get them done. More creatures will be added later. To be added later: Cave Lions, wild horses, Bison, mules and donkeys, birds like pheasant and grouse (why is pheasant breast a cooking mat when there are no pheasants anywhere to be found?), real deer (whitetail or mule deer, with a new model), Megaloceros (extinct Irish Elk, Google it), leopard, tiger, and snow leopard (models in progress), and a new model for the Snow Bear to make more like a polar bear. I would also like to add young versions of animals, like deer fawns, sabrecat cubs, wolf pups, and the like, with new models of course. Now that I\\'ve figured out how to get models into Skyrim and have them work, I\\'m eager to get going on this mod.\r\n\r\nVersion 1.2 (current):\r\nThis is the new version uploaded here on the Nexus. I\\'m not really familiar with packing BSAs, so if there\\'s a problem, let me know.\r\n\r\nIncluded in this version:\r\n-Moose! Currently, bull moose have been added to the leveled lists and can spawn in place of deer or elk. They are rare. No females yet (the model is giving me hell), but they are coming. Moose currently use the deer deathitem.\r\n-Megaloceros! The extinct Irish Elk has returned in all its glory. Rare, but massive.\r\n-A snowy version of the lynx, using a Canadian lynx texture. Can be found in all snowy regions of Skyrim.\r\n-Slightly altered the cave bear model to make it a bit more like a black bear.\r\n-Slightly altered the sabrecat model so it no longer looks like its on steroids. More feline, less bear. This will affect anything using the vanilla sabrecat model.\r\n\r\nVersion 1.1:\r\n-Deer overhaul\r\n-Added a new creature to the wilds of Skyrim, Whitetail Deer! Both bucks and does, with new models and textures, now populate the forests and tundra of Skyrim. They are added to the leveled lists and can appear in place of elk or caribou.\r\n-Tweaked the female elk model to better represent a real elk (removed the antlers) for the sake of greater realism.\r\n-Added female Caribou with a slightly tweaked model and smaller size.\r\n-Adjusted the loot for female elk and caribou. Small antlers are now found on female caribou and male whitetail deer. Because female elk now properly don\\'t have antlers, they cannot drop small antlers any longer.\r\n\r\nOther changes:\r\n-slightly alerted lynx model, now has a better face.\r\n-New Dire Wolf texture, now using one of StarX\\'s grey textures. That white texture stuck out way too much. Still working on getting an AV pack to work for them.\r\n\r\nVersion 1.0:\r\n-Dire Wolves added to leveled lists. Slightly tweaked model, uses the original wolf skeleton. Currently only one texture, white (One of AlienSlof\\'s fantastic ice wolf re-textures). Big, nasty and ready to eat your face. They are everywhere. I may have to change that.\r\n-Lynx added! Uses a new model based off the sabrecat. It uses the sabrecat rig, so the feet unfortunately do that horrible dip into the ground thing when doing its idle animation. I would like to fix this, but tweaking animations is different than tweaking models. If anyone knows how to mess with animations, a fix for this would be greatly appreciated. Currently, the lynx has one texture. Lynxes are quite rare and very well camoflaged. I added a couple in the hills behind Pelagia Farm for testing purposes because I actually couldn\\'t find any roaming around to get screenshots of. Your best bet to check them out in-game is to head to the cross-roads by Honningbrew Meadery. There\\'s one there.\r\n-New behaviors for wolf and ice wolf. Pit wolves remain the same.\r\nTweaked spawn points for deer (caribou) and elk. Renamed deer to Caribou.\r\n\r\n\r\n Later versions (To do list):\r\n-Add more textures/ AV pack for Dire Wolves (maybe change them to a different color instead of white)\r\n-Add more lynx textures. Currently, theres only one, based off the Eurasian Lynx. Later, I will add an Iberian Lynx and Canadian Lynx texture, with different spawn locations for each (Eurasian in pine forest and Whiterun tundra, Iberian in the Rift and Reach, Canadian in snowy regions), and several variations of each. I will also make him a bit furrier.(done)\r\n-Add wild horses\r\n-Add Cave Lions, tigers, leopards, etc., etc.\r\n-Add whitetail deer and Megaloceros (done)\r\n-Add Bison or wild cattle\r\n-Add polar bear model for snow bear\r\n-Add pheasant, grouse and other birds\r\n-Add a few wolf packs around Skyrim, with named alpha wolves. A few might be aggressive.\r\n-Add wild boar (without requiring Dragonborn, maybe)\r\n\r\nI want to keep this as lore-friendly as possible, and maintain the fantasy-feel of the game, while adding more diversity to the wild regions of Skyrim. I\\'ve been playing with this early version of the mod installed for quite a while now and I enjoy it. The edits are subtle enough (except for the dire wolves, they like to eat low-level characters) that it\\'s not too noticeable, but I miss it when I turn it off. If anyone has any suggestions for more creatures to add, I\\'m open to adding more than what I\\'ve thought of. If you don\\'t like something I\\'ve added or changed, let me know, but I\\'m not going to cater to everyone.\r\n\r\nCompatibility:\r\nWILL conflict with any other mod that changes creature behavior, i.e. SkyTest Realistic Animals and Predators, Real Wildlife Skyrim, Realistic Wolf Behavior, and the like.\r\nWorks fine with Prides of Skyrim and Birds of Skyrim. This may change as I add more stuff.\r\nLynxes and dire wolves are currently both tamable through Tame the Beasts of Skyrim and Skyrim Pets!\r\n\r\nInstallation:\r\nUse the mod manager download or manually place the .esp and .bsa files in your Data folder.\r\n\r\nKnown issues: \r\n-Newly added creatures not showing up\r\nCause: new animals are added to the leveled lists, not hand-placed (may end up doing this in the future if this becomes a problem. Any other mod that alters leveled lists will conflict.\r\nSolution: Do a clean save with no mods, then turn on SWO and save, then turn on the rest of your mods.\r\n\r\nMy recommended mods:\r\nSFO Skyrim Floral Overhaul\r\nConvenient Horses\r\nConvenient Horse Herding\r\nTame the Beasts of Skyrim\r\nSkyrim Pets\r\n\r\nEnjoy your diversified Skyrim!\r\n\r\nedit:\r\nAlso on the to-do list, a few more critters inexplicably missing from Skyrim\\'s wildlife:\r\n-squirrels, chipmunks or marmots (may have to use the skeever skeleton)\r\n-badger or raccoon dog\r\n-river otters!\r\n\r\nalso considering adding another extant felid alongside the sabrecat, Miracionyx (American cheetah, existed in the Pleistoncene in North America).\r\n\r\nPlease remember that this mod is in its infancy and bugs are likely. Please report any bugs or oddities you encounter so I can get right on fixing them :)\r\n\r\n",
  "categoryId": "83",
  "version": "1.3",
  "author": "530gothic25",
  "createdUnix": "1373576481",
  "updatedUnix": "1374611419",
  "containsAdultContent": false,
  "uploadedBy": "530gothic25",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038461",
      "name": "Skyrim Wildlife Overhaul",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7180",
      "fileName": "Skyrim Wildlife Overhaul-37999-1-1.zip",
      "uploadedUnix": "1373576464",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/cb1ed1a4908fd6c0c4af9321ac9bcfb499d55cdbe91745bbaa2a146b9248b713/analysis/1407639942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Wildlife%20Overhaul-37999-1-1.zip?fid=1000038461&ttl=1535818076&ri=8192&rs=8192&setec=c4eaddddcaabfafddb84026495e31460"
    },
    {
      "fileId": "1000038968",
      "name": "Wildlife Overhaul Invisible Animals Fix",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "19150",
      "fileName": "Wildlife Overhaul Invisible Animals Fix-37999-1-2.zip",
      "uploadedUnix": "1373847285",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/2df6dd92aea7c46a5c017b7f43dd375e16e74a7cc425fbef83acfa700471304e/analysis/1407644109/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wildlife%20Overhaul%20Invisible%20Animals%20Fix-37999-1-2.zip?fid=1000038968&ttl=1535818077&ri=8192&rs=8192&setec=403626c66d9ccc0e808288f2a6dce3c6"
    },
    {
      "fileId": "1000039861",
      "name": "Skyrim Wildlife Overhaul",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22539",
      "fileName": "Skyrim Wildlife Overhaul-37999-1-3.zip",
      "uploadedUnix": "1374360915",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/65fbf91031ecf2244c0c40c62dd1dc1198d4d403e867ea9e808884845772ddc8/analysis/1407650955/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Wildlife%20Overhaul-37999-1-3.zip?fid=1000039861&ttl=1535818077&ri=8192&rs=8192&setec=92f4c61f6d439a737a2af2242cf69668"
    },
    {
      "fileId": "1000040295",
      "name": "Skyrim Wildlife Overhaul Hide Crafting fix",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "54",
      "fileName": "Skyrim Wildlife Overhaul Hide Crafting fix-37999-1-3.zip",
      "uploadedUnix": "1374611419",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/c8e7df3b731494a7ad371b61f88b0747d16a0e789a3ad58f19772d6ab3f0a02f/analysis/1407653946/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Wildlife%20Overhaul%20Hide%20Crafting%20fix-37999-1-3.zip?fid=1000040295&ttl=1535818078&ri=8192&rs=8192&setec=3e347b25bf6efc373c34af0cfbbc1207"
    }
  ]
}