{
  "modId": 38009.0,
  "modName": "The Void Walker",
  "summary": "The void is the space that lies between the universes. Although it remains unknown to most there are some who are chosen and drawn within. These few are known as the Void Walkers. These rare souls are gifted with immense power, beyond that of the mages of Tamriel. You have been chosen, you will become a Void Walker. This mod adds the six new magica",
  "descriptionHtml": "[center][size=6][b]You have been chosen, you will become a[/b][/size][/center]\r\n\r\n[center][size=10][b][font=\\\"Impact\\\"]Void Walker[/font][/b][/size][/center]\r\n\r\n[center][color=#0066FF][size=5][b]Introduction[/b][/size][/color][/center]\r\n[line]\r\nThe void is the space that lies between the universes. Although it remains unknown to most there are some who are chosen and drawn within. These few are known as the Void Walkers. These rare souls are gifted with immense power, beyond that of the mages of Tamriel.\r\n\r\nThis mod was originally uploaded as Gifts of the Outsider to both the Steam Workshop and here. However it was removed from the Steam Workshop due to copyright reasons. Therefore I decided to rename the spells in order to avoid this happening again. Whilst I was doing this I also made a few improvements. Even though my original mod was not removed from the nexus I thought I would release the \\'revamped\\' version here as well.\r\n\r\n[center][color=#0066FF][size=5][b]Features[/b][/size][/color][/center]\r\n[line]\r\nThis mod adds the six new abilities to Skyrim through a fully voice acted quest. \r\n\r\nThe spells are as follows: \r\nVoid Leap: Blink across distances instantaneously. \r\nVoid Sight: See in darkness and detect beings through walls \r\nInfestation: Summon a horde of rats to distract or kill your opponents \r\nPossess: Take control of a being, using them to attack others before appearing directly behind them. \r\nTempest: Blast away your opponents with a powerful gust of wind. \r\nTime Shift: Slow time to a crawl for everyone but yourself. Great for escaping a difficult situation. \r\n\r\n[center][color=#0066FF][size=5][b]Walkthrough[/b][/size][/color][/center]\r\n[line]\r\nYou can begin the quest by heading to abandoned houses on the shores of Lake Honrich, west of Riften. Inside you will find a book, \\'The Void Walkers\\', pick it up and you will begin your journey. \r\n\r\nOnce you have left The Void you will be tasked with finding the runes of power. Here are their rough locations: \r\nVoid Sight - This can be found beneath the walkway to the college of Winterhold \r\nInfestation - This can be found beneath Riften, in the Ratway tunnels, after the Ragged Flagon. \r\nPossess - Is located on a hill above Falkreath cemetery. \r\nTempest - In the mountains north of Markarth \r\nTime Shift - In the hills north east of Solitude\r\n\r\n[center][youtube]http://youtu.be/TP3QfvKpzGI[/youtube][youtube]http://youtu.be/Ul_Ugr3jA-E[/youtube][/center]\r\n[center][color=#0066FF][size=5][b]Troubleshooting[/b][/size][/color][/center]\r\n[line]\r\n[color=Red]Problem:[/color] When I get to the void the Outsider just stands there and doesn\\'t talk to me. \r\n[color=Green]Solution:[/color] I\\'m not sure what causes this but if you reload the last Autosave (usually the one right before you fast travel to the abandoned house) and then re-enter the void he should begin a conversation with you. Its a strange fault that I am trying my best to fix. \r\n\r\n[center][color=#0066FF][size=5][b]Credits[/b][/size][/color][/center]\r\n[line]\r\nThanks goes to the talented Matthew Wade for voicing the outsider. Check out his [url=http://www.matthewwade.co.uk/]website[/url] if you are looking for an excellent voice actor.\r\n\r\nThanks also goes to Bethesda and Arkane Studios for making Dishonored. The inspiration behind the mod.\r\n\r\n[center][color=#0066FF][size=5][b]Miscellaneous[/b][/size][/color][/center]\r\n[line]\r\nIf you have any suggestions or problems please let me know in the comments.\r\n\r\n[center][color=#0066FF][size=5][b]Disclaimer[/b][/size][/color][/center]\r\n[line]\r\nDishonored is property of Bethesda and Arkane Studios. This mod has only been inspired by Dishonored and I do not claim ownership of it any ideas featured in it.",
  "categoryId": "75",
  "version": "1.0.1",
  "author": "Madrilous",
  "createdUnix": "1373123635",
  "updatedUnix": "1373464583",
  "containsAdultContent": false,
  "uploadedBy": "Madrilous",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037519",
      "name": "The Void Walker",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2842",
      "fileName": "The Void Walker-38009-1-0-0.rar",
      "uploadedUnix": "1373123261",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/fe39a98cc666d115ebbe3fb0d47a463cd14cb092026dbc42897422eb3706bcea/analysis/1407632886/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Void%20Walker-38009-1-0-0.rar?fid=1000037519&ttl=1535818115&ri=8192&rs=8192&setec=635c0141ab0b7a2709102899f7be6efd"
    },
    {
      "fileId": "1000038215",
      "name": "The Void Walker",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3396",
      "fileName": "The Void Walker-38009-1-0-1.rar",
      "uploadedUnix": "1373464583",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/4f27c65b1554b2c855b4e95e333ec3abacb7975c2307fd438cbd9d3893ba82a4/analysis/1407637985/",
      "changelogHtml": " Added fixes for The Outsider not talking within the Void <br/> \n Made Void Leap silent, can now be used to leap behind enemies undetected <br/> \n A few more smaller fixes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Void%20Walker-38009-1-0-1.rar?fid=1000038215&ttl=1535818115&ri=8192&rs=8192&setec=1b7b8dd758635198cd798a60af386f6a"
    }
  ]
}