{
  "modId": 38026.0,
  "modName": "Non-ENB Alternative",
  "summary": "Your PC too weak for ENBs? TRY THIS",
  "descriptionHtml": "[IMG]http://i.imgur.com/oJFlOEr.png[/IMG]\r\n\r\n-------------------------------------I-M-P-O-R-T-A-N-T: you MUST use it with these mods unless your want it to look HORRID:\r\n                                  [[[  Climates of Tamriel AND RealisticLlightingOverhaul  ]]]\r\n            OPTIONAL:\r\n [[ Imaginator - Dynavision ]] --I increase the sunlight on imaginator by 5.\r\n\r\n--------------------------The profile picture is from one of my videos----------------------------------------------------------------------------------------------\r\n\r\n[[[ CHECK THE VIDEO SAMPLE! ]]]\r\n( ultra choppy and blurry because of video recording software and my shitty pc ;[ )\r\n[youtube]STIVCy9I6nM[/youtube]\r\n[[[ You can check the original version here, since mine is a preset ]]]\r\n    http://skyrim.nexusmods.com/mods/23364//? \r\n\r\n---------------------------------------------------[[[ COMMENT PLEASE!!!!!!!! ]]]------------------------------------------------------------------------------------\r\n\r\nWell, if your are one of those who got tired of spending hours trying to get the best visuals without using ENBs, because it makes your pc struggle in agony in an endless slow motion slide show, heres a little help.\r\nMonths ago found this little piece of software that improves DRAMATICALLY the visuals without sacrificing too much fps...\r\n\r\n....\\\"yeahhh everybody\\'s saying that and when I try the ENB it makes my pc melt dude\\\"\r\n\r\n.....well, thats because our pc\\'s are too weak, in my case, I run Skyrim on a GT 240, and an Athlon II x2  with 4gb for RAM. and thats way too weak for ENBs...   ;[\r\n\r\nThe mod consists of some files and a DLL, you just drop everything on the Skyrim folder.\r\nIts called SweetFX and its FULLY customizable, you choose which shaders it applies and its intensities and stuff (really detailed).\r\nIn my system the fps cost is bwtween 4 and 6, depending on the scene.\r\nOf course this is just MY settings, you can alt-tab, change the SweetFX_settings.txt save it, and go back to your game to see its effects.\r\nIm using for those images:\r\n_The FXAA included (WAAAAY better than game AA, and IT DOESNT blur the textures!!!)\r\n_DPX , it makes the game look like a movie or something, its awesome.\r\n_Vibrance, to make it less colorful.\r\n_Curves, adds a nice contrast curve.\r\n\r\n[[[ The downside: it makes some very yellow lightsources inside caverns, taverns, houses look blue, IF YOU DONT LIKE IT YOU CAN TOGGLE THE SHADERS WITH THE KEY BETWEEN IMPR AND PAUSE (dunno how is that key called in english)]]]\r\n[[ It lacks of DOF and godrays ]]]\r\n\r\nAs I said, you can tweak any of those shaders to your like, and even try the others im not using (theres a nice vignette effect too)\r\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------",
  "categoryId": "62",
  "version": "1.0",
  "author": "ElSopa",
  "createdUnix": "1373150936",
  "updatedUnix": "1373150936",
  "containsAdultContent": false,
  "uploadedBy": "ElSopa",
  "primaryFile": null,
  "files": []
}