{
  "modId": 38027.0,
  "modName": "Gill - A Groovy Slaughterfish",
  "summary": "Ever wanted to hit people with a Slaughterfish? Well, I\\'ve something better. [b]GILL![/b]. No, not gills to breathe water with. But a fish!",
  "descriptionHtml": "Gills is a slightly larger-than-average Slaughterfish companion to join you in your hilarity, or perhaps an aquatic companion to (suspiciously) slither along the ground next to your Siren or Triton hero. Not only can he *gasp* open doors to join you in your slaying, but he\\'s quite quick so he [i]should[/i] keep up with you on foot. As for when you\\'re galloping on your house, ...ehhh, well most animal companions can\\'t keep up regardless.\r\n\r\nGills comes with his own custom script that I made (see pictures) and can be found in the river that runs through Whiterun, by Gerdur\\'s Mill. If he\\'s not there when you visit him, it\\'s possible he\\'s struggling against the current or attempting to take on the village. I\\'ve play-tested and sometimes he\\'s attacking the villagers. He\\'s set to \\\"Aggressive\\\" so he should only be attacking enemies, but his \\\"Predator\\\" combat style may be causing this. \r\n\r\nIf this is the case, simply open up the Console Command (~ on your keyboard), target Gill, and type \\\"stopcombat\\\", then \\\"setrelationshiprank player 3\\\" then \\\"disable\\\" and finally \\\"enable\\\". He should be able to be talked to and recruited.\r\nGill may be a bit weak at first and often gets knocked back, but he levels with you and should do decent enough damage.\r\n\r\nProbably non-lore friendly since it\\'s a fish that can slide around on land, but feel free to use your imagination. \r\n\r\nAfter all, you can\\'t spell Slaughterfish without Laughterfish!",
  "categoryId": "83",
  "version": "1.00",
  "author": "JainaProudmoore",
  "createdUnix": "1373151705",
  "updatedUnix": "1373151705",
  "containsAdultContent": false,
  "uploadedBy": "JainaProudmoore",
  "primaryFile": null,
  "files": []
}