{
  "modId": 38037.0,
  "modName": "Kaie - NPC Redone - Forsworn Follower",
  "summary": "A Skyrim NPC Editor makeover of Kaie, Druadach Redoubt ally of Madanach, altering her appearance and making her an eligible follower after the &#39;No One Escapes Cidhna Mine&#39; quest has been completed.",
  "descriptionHtml": "[b][u]Synopsis:[/u][/b]\r<br />\r<br />Kaie has become a potential follower\r<br />Altered appearance (less dirty and flushed, &#34;prettier&#34;)\r<br />Class change from Nightblade to more useful Spellsword\r<br />She does not affect player stealth\r<br />Found roaming her usual location, Druadach Redoubt, after completing the &#39;No One Escapes Cidhna Mine&#39; quest.\r<br />\r<br />[b][u]Description:[/u][/b]\r<br />\r<br />If, like me, you were disappointed by the lack of follow-up to the Cidhna Mine breakout and the general inability to interact peaceably with the Forsworn or align yourself with their cause, despite aiding in Madanach&#39;s escape, then this simple NPC edit of [url=http://elderscrolls.wikia.com/wiki/Kaie]Kaie[/url], ferocious Forsworn daughter of The Reach, might be for you.\r<br />\r<br />Being intrigued and enchanted by the Forsworn, after my first playthrough, I decided to create a Breton member of the Forsworn using the Alternate Start mod (link below). This was a great way to start a character to role-play as a Forsworn, but, after the first hour of gameplay, I felt like just another run-of-the-mill Breton Dovahkiin. So, after completing the Forsworn Conspiracy chain, I decided to use console commands to make Kaie, friendly female Forsworn NPC, recruitable as a follower. \r<br />\r<br />While this was a cool way to be reminded of my character&#39;s imagined origins, I found that Kaie, despite being a scary badass, was a little too ruddy and muddy (even among Forsworn) for my liking. So, I edited her appearance in the [url=http://skyrim.nexusmods.com/mods/4554/?]Skyrim NPC Editor[/url] by foretrenty. \r<br />\r<br />In my makeover of Kaie, I attempted to make her &#39;prettier&#39; and a little less dirty looking while still keeping an element of Forsworn savagery and earthiness to her appearance and leaving her original personality intact. I hope that is something which I have achieved with this edit.\r<br />\r<br />[size=4](Her appearance in the demo images was achieved through use of the official HD textures, AOF Believable Hair, Weathered Warpaint and Improved Dirt and the subtle but greatly enhancing Younger Bretons mod (both available on the Nexus, linked in Recommendations below). I suggest using these mods to compliment the changes I have made to her look.)[/size]\r<br />\r<br />While she is recruitable as a follower, I decided not to include an option for marriage. I feel that her agreeing to marry the player-character without visibly interacting with them much beyond fleeing Markarth in the same party seemed a little too implausible going by her apparent fiery and abrasive nature. Making her a candidate for marriage via console commands should be okay though.\r<br />\r<br />She uses her original &#34;FemaleSultry&#34; voice as this was the voice used in her unique quest dialogue. This means that some follower voicing is missing, but much of the dialogue is still vocalised.\r<br />\r<br />She is [u]not[/u] set to be essential as I feared this might cause problems during quest events. Feel free to use console commands or mods like AFT (link below) to make her essential later though.\r<br />\r<br />To avoid any quest obstructing problems, I would suggest waiting until after escaping Cidhna Mine to recruit Kaie as your follower. \r<br />Coming back to recruit her, having completed the quest a while ago, seems absolutely fine.\r<br />\r<br />I&#39;ve tested interacting with Kaie at various stages of the No One Escapes Cidhna Mine quest and it seems that she remains busy (and non- follower interactive) until the Markarth escape has been successful. This is probably for the best.\r<br />\r<br />[b][u]Requirements:[/u][/b]\r<br />\r<br />None (beyond not killing Madanach&#33;&#33;).\r<br />\r<br />[b][u]Compatibility:[/u][/b]\r<br />\r<br />This mod should be compatible with all other mods that do not make direct alterations to Kaie (appearence, combat style, disposition etc). Mods that change Forsworn armor and weapon textures (like [url=http://skyrim.nexusmods.com/mods/1295/?]Forsworn Bear Fur Retex[/url]) should be completely fine.\r<br />\r<br />I suggest placing this mod after any texture replacers or actor/NPC editing mods in your load order (works just fine placed at the very bottom of my load order).\r<br />\r<br />[b][u]Potential Issues:[/u][/b]\r<br />\r<br />[b]N.B.[/b] - For some reason, why I don&#39;t know, if you attempt to recruit Kaie as a follower immediately after Madanach&#39;s group return to Druadach Redoubt, then the unnamed Druadach NPCs (Forsworn Briarheart, Forsworn Forager etc) may attack you. Named NPCs such as Madanach, however, [u]will not get involved and will remain friendly[/u] with you after Kaie is recruited as your follower.\r<br />I believe this can be avoided by visiting the Redoubt once, fast-travelling away and sleeping for a few hours and then returning to recruit Kaie as a follower. (Alternatively, should they attack you, you can just turn the game difficulty down to avoid any unwanted deaths, slaughter your attackers and imagine they were simply members who mistakenly doubted your loyalty to the group&#33; Madanch and your prison bros won&#39;t care&#33;)\r<br />\r<br />Please, let me know of any issues you might come across and I will attempt to rectify them.\r<br />\r<br />[b][u]Installation:[/u][/b]\r<br />\r<br />NMM: Select download with NMM and then activate the mod in the program. \r<br />\r<br />Manual: Extract files and place them in your Skyrim [b]Data[/b] folder (typical path: Steam/steamapps/common/skyrim/Data).\r<br />\r<br />[b][u]Uninstallation:[/u][/b]\r<br />\r<br />NMM: Deactivate the mod in NMM.\r<br />\r<br />Manual: Remove the MS02Kaie.bsa and MS02Kaie.esp files from your Data folder. Load Skyrim, make a new save, reload from that save and continue playing as normal.\r<br />\r<br />[b][u]Recommended Files:[/u][/b]\r<br />\r<br />[b][url=http://skyrim.nexusmods.com/mods/2637//?]Younger Bretons[/url][/b] (Fantastic little edit mod that removes the bizarre forehead wrinkles that seem to appear on every Breton regardless of age.)\r<br />\r<br />[b][url=http://skyrim.nexusmods.com/mods/4307//?]AOF Believable Hair -Female and Male-[/url][/b]\r<br />\r<br />[b][url=http://www.nexusmods.com/skyrim/mods/4489/?]Weathered Warpaint and Improved Dirt[/url][/b]\r<br />\r<br />[b][url=http://skyrim.nexusmods.com/mods/15524//?]Amazing Follower Tweaks[/url][/b] (Allows you to make Kaie essential, change her combat style or spells and do all kinds of cool stuff&#33;)\r<br />\r<br />[b][url=http://skyrim.nexusmods.com/mods/9557//?]Alternate Start - Live Another Life[/url][/b] (Fantastic mod that allows you to start a new game as a member of the Forsworn based out of Druadach Redoubt in an immersive and interesting way. Good role-play foundation and inspiration&#33;)\r<br />\r<br />[b][u]Credits:[/u][/b]\r<br />\r<br />Bethesda - The Elder Scrolls game franchise\r<br />foretrenty - Skyrim NPC Editor",
  "categoryId": "33",
  "version": "1.0",
  "author": "Rob_the_Bob",
  "createdUnix": "1373190144",
  "updatedUnix": "1373189863",
  "containsAdultContent": false,
  "uploadedBy": "rcarass1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037659",
      "name": "Kaie - Redone - Forsworn Follower",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "391",
      "fileName": "Kaie - Redone - Forsworn Follower-38037-.zip",
      "uploadedUnix": "1373189863",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/67c9cc37a417ee0b0f1c771b9031bac2e975e2bfef6710b64839de4357a6a0a7/analysis/1407633852/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kaie%20-%20Redone%20-%20Forsworn%20Follower-38037-.zip?fid=1000037659&ttl=1535818163&ri=8192&rs=8192&setec=37e00e9c9e853c3463e49fce5927e2cb"
    }
  ]
}