{
  "modId": 38033.0,
  "modName": "Marriageable Dragon Follower Krentvensaviik",
  "summary": "Marriageable Dragon Follower Krentvensaviik",
  "descriptionHtml": "Don&#39;t like this mod? F**k off. Problem solved.\r<br />\r<br />GENERAL INSTRUCTIONS, YOU MUST READ: \r<br />\r<br />IMPORTANT EDIT: This mod is completely compatible with the female counterpart (Ziisosgein) HOWEVER, If you choose to marry him, BEFORE YOU GO INTO THE TEMPLE ON YOUR WEDDING DAY MAKE SURE BOTH ZIISOSGEIN AND KRENTVENSAVIIK ARE SMALLSCALE, Because she is a friend she will attend your wedding, if you forget to resize her too, she will glitch inside the temple at fullscale and crash your game or lag you like hell. Find Ziisosgein here: http://skyrim.nexusmods.com/mods/38044//?\r<br />\r<br />Meet Krentvensaviik, or Broken Wind Savior in language of the Dohv. He is a follower dragon, friendly, and MARRIAGEABLE. You don&#39;t need to do anything for him, he just loves you already. He &#39;&#39;lives&#39;&#39; on a small plot of land in front of the mill at ChillFurrow Farm in Whiterun&#39;s outskirts. Remember to save often when gaming, I am not liable for loss of data. Further update on this mod is currently debatable; this is my first mod ever and my first time working with the creation kit, it would take a lot for me to try and fix all bugs but please do tell me of anything you discover. Don&#39;t go overboard with him, treat the mod gently. HE IS FULL SIZE. If you wish to change his size, which at some points you WILL have to, open up the console by pressing the Tilde key, &#39;&#39;~&#39;&#39;, and click on him, then type &#39;&#39;setscale #&#39;&#39; the numbers I recommend are: Medium large &#39;&#39;setscale 0.75&#39;&#39;; Small &#39;&#39;setscale 0.25&#39;&#39;; and to reset him to normal size &#39;&#39;setscale 1.000&#39;&#39; all without quotes of course. For the most part he cannot enter buildings like taverns. if you want to try and get him into one, make sure he is SMALL scale first. IMPORTANT: If you wish to marry him, DO NOT, REPEAT DO NOT, agree to marry him then save and quit, this will corrupt your save for some reason and he will no longer have dialogue options. He&#39;ll just stand there and look pretty. If you try to enter temples and things with him, he will most likely not be there. Or he will get stuck on everything. I recommend you keep him as a follower for outdoorsy things. FOR SOME REASON, when he uses his ice breath and things, he shouts &#39;&#39;OHDAVIING&#39;&#39; I have no idea why, there&#39;s nothing scripted for that, so LOL, sorry :l. Also, NPC&#39;s HAVE to follow an invisible scripted route made of poly&#39;s. These poly&#39;s tell them they can&#39;t run up on rocks and things. So if you&#39;re wandering around and he gets stuck, just keep going, because one of two things will happen: A) He&#39;ll find a way around or (B) Should you run into danger or get too far from him, he will fly to you. I recommend most of the time you have him set to his regular size, because after a while of being unnaturally small he&#39;ll begin to get buggy like flying through the floor and never landing or moving in slow-mo. Plus he can protect you better when he&#39;s bigger. I&#39;m pretty certain he&#39;s invincible, I do not know if my attempt to make this so actually worked, I haven&#39;t tried to kill him. Sorry about the long description, I wanted to be detailed. Enjoy him&#33; \r<br />_______________________________________ \r<br />ONLY READ THIS IF YOU PLAN TO MARRY HIM: \r<br />\r<br />If you agree to marry him, MARRY HIM AS SOON AS POSSIBLE. Travel to the temple of mara, which I recommend you do with him as your FOLLOWER and set to small scale, go through all that hullaballoo and then do whatever till it&#39;s time for your wedding. It is CRUCIAL THAT YOU MAKE SURE HE IS SET TO SMALL SCALE BEFORE YOU GO INTO THE TEMPLE TO BE MARRIED. Otherwise when he appears inside, he will be huge and glitching through the walls of the temple, this is because while you can go anywhere, NPC&#39;s HAVE to follow an invisible scripted route made of poly&#39;s. These poly&#39;s tell them they can&#39;t run up on rocks and things. When you enter the temple to be married you&#39;ll probably see yourself falling through the map for like, 5 seconds, all you have to do is click/hit a directional button like forward and you should auto-walk toward the alter. At first he will be invisible but you&#39;ll hear him breathing, don&#39;t worry, he&#39;ll poof there in a few seconds. When he asks where you wish to live, DO NOT MOVE HIM IN WITH YOU. AGREE TO LIVE WITH HIM. Live in your own place on your own time. If you choose to have him move in with you, he will glitch and likely crash you. Agreeing to live with him just means he&#39;ll stay at that plot of land at Chillfurrow. You can go into your house(s) whenever, you know that. I have not TRIED, however, to bring him into my house when set to SMALLSCALE, it may work, it may not. However if you decide to try this. make sure it&#39;s a house with little clutter, as again, NPC&#39;s can only go so many places. He will still cook you food and things a regular spouse would do.\r<br />\r<br />___________________________________________________ \r<br />NEW BUG FIX: If you somehow have the amulet of mara but have not yet been to riften and spoken to maramal, the marriage option will not come up. SO, if you are not getting it, go and do that. You don&#39;t need to BUY the amulet from maramal, and he won&#39;t let you if you already have one, so just talk to him about how marriage works in skyrim and then fast travel back to Krentvensaviik.\r<br />\r<br />NEW NON-COMPATIBLE: Currently not compatible with the Amazing Follower Tweaks mod. However, totally compatible with Fixed Followers Light so far I have had no problems with that one.\r<br />\r<br />NEW NON-COMPATIBLE: Ultimate Follower Overhaul\r<br />\r<br />NON-COMPATIBLE AND COMMON ISSUE FIX: This mod seems to be commonly incompatible with follower mods. If you have follower mods like Amazing Follower Tweaks ect. Try disabling it and see if it works. If it doesn&#39;t try disabling other things, the only reason he doesn&#39;t appear is because there is a conflict. Which is caused because of the complex-ness of his script, being a dragon.\r<br />\r<br />NEW BUG FIX: On occassion, not always, there can be a glitch that after fighting, they won&#39;t stop flying, and sometimes they&#39;ll even fly up toward the sky endlessly. All you have to do is catch one of them and tell them to follow you, then tel them to wait wherever. Wait for them to circle in the air and land before telling them to part ways. They will be fine after. This only happened to me once, but still. If it happens to you you now know what to do.",
  "categoryId": "65",
  "version": "1.0",
  "author": "Vaiien",
  "createdUnix": "1373160398",
  "updatedUnix": "1373160028",
  "containsAdultContent": false,
  "uploadedBy": "Vaiien",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037589",
      "name": "KVSFollow",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "KVSFollow-38033-1-0.zip",
      "uploadedUnix": "1373160028",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/295e7b156240694a998a058bb548b6519f7ccb9f3f14cefe7cd62d4c2e44e09d/analysis/1407633426/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KVSFollow-38033-1-0.zip?fid=1000037589&ttl=1535818159&ri=8192&rs=8192&setec=75708947e99fd848185c2caa26071a23"
    }
  ]
}