{
  "modId": 38034.0,
  "modName": "Shouts and Magic Unleashed - The Legend of Colette - Shouts and Spells that Level with You",
  "summary": "Lift your hands up and shout! Throw your hands up and shout! Featuring two new shouts and rebalancing for all official shouts, so that they level up as you do!",
  "descriptionHtml": "[IMG]http://i.imgur.com/khqEmXs.png[/IMG]\r\n\r\nI would like to credit tinylampe for the incredible quality of their feedback - the Restoration portion of this mod is greatly indebted to them. This mod also owes a debt of gratitude to the wonderful [url=http://skyrim.nexusmods.com/mods/14353/?]Improved Dragon Shouts[/url] mod, which I used for a long time. That said, there are some big design philosophy differences here...\r\n\r\n[IMG]http://i.imgur.com/73VWpVh.png[/IMG]\r\nThe principles behind Shouts Unleashed are simple:\r\n- Never alter more than is necessary. This means that shouts and Spells are separate; the two will use entirely modular means, and installing one does not require the other.\r\n- Whenever possible, every ability should continue to be relevant, regardless of player level or difficulty setting.\r\n- Shouts should not have a tree devoted to their benefit; they are too broad a category of effects, and time-limited.\r\n- Shouts should not become \\'spammed\\' or part of a rotation, due to their unique combination of being cooldown-based while still being animation dependent.\r\n- Shouts also should not be on such long cooldowns that you can\\'t use most of them every skirmish if you desire.\r\n- Shouts should synergize well with every other combat skill, and not favor any one in specific.\r\n- Restoration is a perfectly valid school of magic.\r\n\r\nTo install Shouts Unleashed, you must have Skyrim 1.9. (you probably already do). DLC is no longer necessary to use this mod. If you are using Nexus Mod Manager, please use that (or a similar program) to install this mod. If you are doing a manual install, you should be able to figure out how to do it on your own. The mod isn\\'t script heavy and only uses 1 quest, so uninstallation is also very simple.\r\n\r\n[IMG]http://i.imgur.com/7LgZNR6.png[/IMG]\r\n[b]Animal Allegiance:[/b] This shout now levels with you. For every 15 levels that you gain, the maximum level you can command rises by 20, to a maximum of 120 by 75. No animal in the base game gets this high level, though. Hypnotic Gaze, Kindred Mage and Animage now affect this shout.\r\n[i]Raan:[/i] Additionally increases the attack damage of affected animals by 25%. No effect on animals without an attack mode, such as rabbits. Range doubled.\r\n[i]Mir:[/i] Adds a level scaling fortify health to affected animals. Also increases attack damage of animals by 75%. Range doubled.\r\n[i]Tah:[/i] Adds a stronger level scaling fortify health to affected animals. Also increases attack damage of animals by 150%.  Range doubled. \r\n\r\n[b]Aura Whisper:[/b] Interior and Exterior radius increased to 1000 feet. It now benefits from the Stability perk in Alteration.\r\n[i]Laas:[/i] Duration decreased to 6s. CD decreased to 5s. Essentially, you can fire the word off quickly for a quick peek at your surroundings. \r\n[i]Yah:[/i] Duration increased to 30s. CD decreased to 15s. If you want a moderate look around.\r\n[i]Nir:[/i] Duration increased to 60s. CD decreased to 30s. Have a constant idea of what\\'s going on.\r\n\r\n[b]Become Ethereal:[/b] Duration benefits from the Stability perk in Alteration. If you have chosen the \\\"Eternal Spirit\\\" meditation ability, it now increases regeneration by 200%. This value further benefits from the \\\"Regeneration\\\" perk in Restoration.\r\n\r\n[b]Call Dragon:[/b] 5s CD, but can only be cast once a day. All three words have identical effects now, to avoid getting locked out of your daily spell with a miscast of the weaker word.\r\n\r\n[b]Call of Valor:[/b] Duration doubled to 120s. CD left alone - if you have a Blessing of Talos and an Amulet of Talos, this is enough to keep one hero permanently up. without stepping too much on the toes of a conjuration specialist. All three are now protected and level with the player. It\\'s now affected by Conjuration Perks which improve undead. \r\n[i]Kaal:[/i] Felldir\\'s class has been changed to reflect his use of two-handed weapons, and he gained the dragonhide spell to make up for wearing a robe. \r\n\r\n[b]Clear Skies:[/b] Purely for roleplaying purposes, the weather duration was increased to 3 minutes on the middle shout and 5 minutes on the final. Enjoy some peace and quiet around your house.\r\n\r\n[b]Disarm:[/b]\r\n[i]Zun:[/i] The first level of the shout is no longer hostile. It increases with your level, albeit slower than your level, from 20 to 50; at level 50, you can affect enemies up to level 28 with it. I envision it as a good way to stop an NPC you don\\'t want to actually kill. CD decreased to 20.\r\n[i]Haal:[/i] Scales to magnitude 47 at level 50. CD kept the same.\r\n[i]Viik:[/i] Scales to magnitude 90 at level 50. CD increased to 50.\r\n\r\n[b]Dismay:[/b]\r\nDescription of the shout now mentions the AoE stagger which has always been present. It can now affect actors of any type as long as their level is low enough, and it benefits from Aspect of Terror, Kindred Mage and Animage.\r\n[i]Faas:[/i] Is now non-hostile. Magnitude 9 at level 1, magnitude 21 at level 50. Cooldown decreased to 30.\r\n[i]Ru:[/i] Magnitude 15 at level 1, magnitude 35 at level 50. Lasts 45 seconds. Cooldown kept the same.\r\n[i]Maar:[/i] Magnitude 20 at level 1, magnitude 47 at level 50. Lasts 60 seconds. Cooldown increased to 60.\r\n\r\n[b]Dragonrend:[/b] Utility. Untouched.\r\n\r\n[b]Elemental Fury:[/b] Untouched. Already fairly balanced, IMO, just rarely used.\r\n\r\n[b]Ice Form:[/b] Untouched.\r\n\r\n[b]Fire Breath:[/b] If you choose to meditate on Yol and are also a Destruction Mage with Augmented Flames, do not be surprised to see this shout hurt things.\r\n[i]Yol:[/i] 25s CD. Magnitude 45 at level 1. Magnitude 135 at level 40. Magnitude 225 at level 80+.\r\n[i]Toor:[/i] 50s CD. Magnitude 68 at level 1. Magnitude 203 at level 40. Magnitude 338 at level 80+.\r\n[i]Shul:[/i] 75s CD. Magnitude 90 at level 1. Magnitude 270 at level 40. Magnitude 450 at level 80+.\r\n\r\n[b]Frost Breath:[/b] Now is competitive with Fire Breath for damage, at least on things that don\\'t frost resist.\r\n[i]Fo:[/i] 25s CD. At level 1, 40 Health/Stamina damage over 10 seconds. At level 40, 120 damage over 10 seconds. At level 80, 200 damage. Dragonborn Frost effect reduced to 4 seconds.\r\n[i]Krah:[/i] 50s CD. At level 1, 78 Health/Stamina damage over 13 seconds. At level 40, 234 damage over 13 seconds. At level 80, 390 damage. Dragonborn Frost effect reduced to 8 seconds.\r\n[i]Diin:[/i] 75s CD. At level 1, 102 Health/Stamina damage over 16 seconds. At level 40, 306 damage over 16 seconds. At level 80, 510 damage. Dragonborn Frost effect reduced to 12 seconds.\r\n\r\n[b]Kyne\\'s Peace:[/b] Standardized area to 225 and duration to 180s for all three words. Affected by Animage and Hypnotic Gaze.\r\n[i]Kaan:[/i] Cooldown reduced to 30s. No other changes.\r\n[i]Drem:[/i] Cooldown reduced to 45s. Affects animals up to level 35.\r\n[i]Ov:[/i] Affects animals up to level 50.\r\n\r\n[b]Marked for Death:[/b] Armor penalty doubled. Each word now adds 33/67/100% Magic Vulnerability instead of the damage over time effect. Duration improved by Stability perk.\r\n\r\n[b]Slow Time:[/b] Durations decreased by 25%. Durations can now be increased with the Stability perk.\r\n\r\n[b]Storm Call:[/b] CDs drastically shortened, but can only use it once a day.\r\n[i]Strun:[/i] Cooldown is now 25s.\r\n[i]Bah:[/i] Cooldown is now 40s.\r\n[i]Qo:[/i] Cooldown is now 60s.\r\n\r\n[b]Whirlwind Sprint:[/b] This ability now has a 10s CD for all levels. Now use whatever\\'s most appropriate to the situation, without being penalized for it. \r\n\r\n[b]Throw Voice:[/b] Unchanged\r\n\r\n[b]Unrelenting Force Shout:[/b] The damage is purely secondary on this shout. I multiplied all damage values by 5, but it doesn\\'t level scale.\r\n[i]Fus:[/i] No other changes.\r\n[i]Ro:[/i] Added a very weak knockback.\r\n[i]Dah:[/i] Doubled knockback strength so that it is more distinct from Cyclone. With Dragonborn Force, it now deals 250 damage, which will remain respectable. CD decreased to 35.\r\n\r\n[IMG]http://i.imgur.com/BXvELxe.png[/IMG]\r\n[b]Battle Fury:[/b] While active, followers also gain +50% spell effect magnitude. Duration dropped to 30s for all three words.\r\n\r\n[b]Bend Will[/b]:\r\n[i]Hah:[/i] CD down to 60s.\r\n[i]Dov:[/i] CD down to 90s.\r\n\r\n[b]Cyclone:[/b] Strikes a nice balance between damage and juggling, in return for longer cooldowns across the board than Unrelenting Force. On the flipside, the cooldowns are more forgiving than Fire and Frost Breath, and it isn\\'t subject to elemental resistances.\r\n[i]Ven:[/i] Deals 32 damage at level 1, scales to 96 damage by level 40, and 160 damage at level 80+.\r\n[i]Gaar:[/i] Deals 48 damage at level 1, scales to 144 damage by level 40, and 240 damage at level 80+.\r\n[i]Nos:[/i] Deals 64 damage at level 1, scales to 192 damage by level 40, and 320 damage at level 80+.\r\n\r\n[b]Dragon Aspect:[/b] While active, it now additionally provides a 50% magnitude increase for spells affected by the mastery perks of the five schools - you know, Restoration Adept, Illusion Novice, etc. I know this is madness, but I felt like there needed to be a few more caster friendly shouts. Due to how it\\'s setup, it should not improve any shouts beyond how the final level of the shout already does.\r\n[i]Diiv:[/i] It improves the magnitude of this mod\\'s two new shouts by 50%.\r\n\r\n[b]Drain Vitality:[/b] You now absorb values rather than merely damaging. Though be warned that the dragons can do it right back to you... It scales from 2.5 Magnitude/sec at level 1 to 12.50 Magnitude at level 80 for all three values.\r\n\r\n[b]Soul Tear:[/b] Deals only 100 damage at level 1, scales back up to 300 damage at level 40, and reaches its maximum of 500 damage at level 80. Unaffected by absorbs or resists.\r\n\r\n[b]Summon Durnehviir:[/b] 5s CD, but can only be cast once a day. All three words have identical effects now, to avoid getting locked out of your daily spell with a miscast of the weaker word. It\\'s now affected by Conjuration Perks which improve undead. \r\n\r\n[IMG]http://i.imgur.com/mgr9ZwG.png[/IMG]\r\nTo obtain the two new shouts, there\\'s the immersive way, and the quick way. The immersive way is to find the Book of Fate in Windhelm. Though it is blank to most people, it is not to the Dragonborn. Take the pages and study them in the shadow of the Lady Stone (for Radiant Flash) or the Guardian Stones (for Symbol of Hope) once every 2½ days, at sunrise or sunset. You will learn a new word, and it will be automatically unlocked.\r\n\r\nThe quick way is to [url=http://www.uesp.net/wiki/Skyrim:Console]open the console[/url], and locate the book Cheat Your Fate. Add it to your inventory, then open it.\r\n\r\n[b]Radiant Flash:[/b] New shout with three components: an immediate self-heal, a heal over time effect, and a short-range \\\"smart targeting\\\" aoe damage with light stagger. The self-heal and regeneration will not function for undead characters. All effects (including the damage portion) are improved by the Restoration perk \\\"Regeneration.\\\" Respite does not apply. Ignores magic resistance and absorb.\r\n[i]Frin:[/i] 25s CD. At level 1, does 15 direct damage/health/stamina, and increases health regeneration by 400% for 6 seconds. Direct component improves to 45 by level 40, then 75 by level 80.\r\n[i]Viin:[/i] 50s CD. At level 1, does 30 direct damage/health/stamina, and increases health regeneration by 400% for 12 seconds. Direct component improves to 90 by level 40, then 150 by level 80.\r\n[i]Ziil:[/i] 75s CD. At level 1, does 45 direct damage/health/stamina, and increases health regeneration by 400% for 18 seconds. Direct component improves to 135 by level 40, then 225 by level 80.\r\n\r\n[b]Symbol of Hope:[/b] New shout that heals all living friendlies (but not you) within a 35 yard radius, and gives you significant stagger resistance. Improved by the Regeneration perk. Respite does not apply. \r\n[i]Hind:[/i] 25s CD. At level 1, heals 15 damage immediately, and then 23 damage over 6 seconds. Values increase to 45 and 68 by level 40, then to 75 and 105 by level 80. You resist stagger for 6 seconds.\r\n[i]Drun:[/i] 50s CD. At level 1, heals 23 damage immediately, and then 68 damage over 12 seconds. Values increase to 68 and 203 by level 40, then to 105 and 338 by level 80. You resist stagger for 15 seconds.\r\n[i]Hun:[/i] 75s CD. At level 1, heals 30 damage immediately, and then another 135 damage over 18 seconds. Values increase to 90 and 405 by level 40, then 150 and 675 by level 80. You resist stagger for 30 seconds.\r\n\r\n[IMG]http://i.imgur.com/rqcekh1.png[/IMG]\r\nThis update includes an (again, entirely optional) overhaul to the Restoration school, with the following changes:\r\n\r\n[i]All Wards:[/i] Charge is now approximately twice as fast.\r\n\r\n[i]All Wards:[/i] Spell cost dropped to 20% base, but you lose 80% of a spell\\'s base magicka cost on deflection.\r\n\r\n[i]All Wards:[/i] Casting a ward begins charging it. After 2 seconds, releasing the ward unleashes a stagger effect. After 4 seconds, releasing the ward unleashes a Mag 4 knockback. If dual-casting, the Knockback is increased to Mag 20. An auditory effect cues you in to each stage being powered up.\r\n\r\n[i]All Wards:[/i] The Ward Mastery perk (changed from Ward Absorb) halves magicka loss and allows your ward to stagger anyone who broke it via overwhelming the ward magically.\r\n\r\n[i]All Wards:[/i] Magnitude makes a jump with each Restoration Mastery perk you take.\r\n\r\n[i]Lesser Ward:[/i] Reduces incoming physical damage by 40%. Absorb Magnitudes: 40/50/65/80/95/110\r\n\r\n[i]Steadfast Ward:[/i] Reduces incoming physical damage by 50%.  Absorb Magnitudes: 60/75/90/110/130/150\r\n\r\n[i]Greater Ward:[/i] Reduces incoming physical damage by 60%. Absorb Magnitudes: 80/100/120/140/170/200\r\n\r\n[i]Selfheal Magic:[/i] Now includes a taper effect for 12 seconds, for 10% of the original spell\\'s effect every second. Also applies to Respite. This allows Restoration to be more proactive defensively by letting you precast heals.\r\n\r\n[i]Sun\\'s Fire:[/i] Reduces the target\\'s physical damage output and speed by 30%, and zeroes out the effectiveness of all drain spells, heal  spells, and heal potions for 30 seconds. This is in addition to the direct damage effect on Undead.\r\n\r\n[i]Vampire\\'s Bane:[/i] Identical, but an area effect. Has no Friend or Foe tag, so you can accidentally screw yourself over as a result! Renamed Sun\\'s Wrath. They don\\'t stack with each other.\r\n\r\n[i]Turn/Repel UD:[/i] All scale with your level (to some extent, and at differing rates).\r\n\r\n[i]Circle Spells:[/i] Include the vulnerability (but not the slow) of the Sun\\'s Fire/Sun\\'s Wrath abilities.\r\n\r\n[IMG]http://i.imgur.com/c7kY9Do.png[/IMG]\r\nv2.0 - Added Restoration school overhaul. Fixed an error with several shouts where they were accidentaly scaling with the user\\'s target rather than the user. Added a minor graphical touch-up to Radiant Flash. Nerfed Radiant Flash\\'s regeneration to 400% base, down from 600%.\r\n\r\n[IMG]http://i.imgur.com/tStxo7Z.png[/IMG]\r\nv2.1 - Finish touching up the rest of Restoration. Balance tweaks and adjustments.\r\n\r\n[IMG]http://i.imgur.com/gGpbtwE.png[/IMG]\r\nThis mod is not compatible with any other mod that modifies dragon shouts or the Restoration School. It is also of limited compatibility with mods that alter the perks Kindred Mage or Animage; there was no way to make some of these shouts Illusion Perk compatible without altering those two. If you don\\'t care about illusion perk compatibility, simply load this mod prior to the mod that alters those perks. I don\\'t recommend using this mod with any which are designed to otherwise scale or increase dragon shouts, such as through a skill system.\r\n\r\nI play on Legendary with the mod [url=http://skyrim.nexusmods.com/mods/36006//?]Ultimate Combat[/url]. I don\\'t personally use any other combat alteration or spell package mods at the moment (not even my own, old and outdated spell package).\r\n\r\nIf I\\'ve made an oversight in function or balance, please let me know. If you\\'d like to translate this mod into another language, you already have my permission. You may rehost and even alter this file as you like, as long as credit is given to me, along with a link back to this page, and you make note of any major changes done.\r\n\r\n[IMG]http://i.imgur.com/rC2UOT0.png[/IMG]",
  "categoryId": "75",
  "version": "2.0",
  "author": "AstralFire",
  "createdUnix": "1373160581",
  "updatedUnix": "1373757917",
  "containsAdultContent": false,
  "uploadedBy": "AstralFire",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037590",
      "name": "Version 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27",
      "fileName": "Version 1_0-38034-1-0.rar",
      "uploadedUnix": "1373160562",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/98995b5d321408fab7053c253570b92c9c8a44a3467e9ec18d0e8278fc29419d/analysis/1407633427/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%201_0-38034-1-0.rar?fid=1000037590&ttl=1535818160&ri=8192&rs=8192&setec=d48cc83460d418ce52fc59b12c2dc556"
    },
    {
      "fileId": "1000038807",
      "name": "Version 2_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "359",
      "fileName": "Version 2_0-38034-2-0.rar",
      "uploadedUnix": "1373757917",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/6514833b84cd1363734e2f7629453b35f6f2c1fa737580faee6790e9f3de330c/analysis/1407642788/",
      "changelogHtml": " Added Restoration school overhaul. Fixed an error with several shouts where they were accidentaly scaling with the user&#39;s target rather than the user. Added a minor graphical touch-up to Radiant Flash. Nerfed Radiant Flash&#39;s regeneration to 400% base, down from 600%. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%202_0-38034-2-0.rar?fid=1000038807&ttl=1535818161&ri=8192&rs=8192&setec=c7bc82d5c253701683d59cdeb449317d"
    }
  ]
}