{
  "modId": 38040.0,
  "modName": "Fine Young Cannibals",
  "summary": "Nord teenage twin sisters, raised by... wolves?",
  "descriptionHtml": "Fine Young Cannibals - Tonar Garth\r\n\r\nI\\'ve created many follower NPC\\'s for myself, but have never released any, mainly because I\\'m too lazy to obtain permissions for all the custom content I tend to use. These girls, tho, are almost all vanilla, so...\r\n\r\nFine Young Cannibals contains Nord teenage twin sisters, Celina and Delwen Hostnith. \r\n\r\nBack story? Who knows, but they seem to have been raised by Forsworn and, for some reason, spend a good deal of time in crypts - hence, their weapons.\r\n\r\nOverpowered? Well, maybe, but why would you want a custom follower that couldn\\'t stand up to a sabercat?\r\n\r\nStatistics - \r\nRace: Nord, scale .9, weight 0.\r\nClass: Forsworn and Forsworn Missile\r\nOutfit: Forsworn, no headdress.\r\nWeapons: Celina - Nord Hero Bow, Nord Hero Sword, Nord Hero War Axe (Forsworn Berserker style).\r\n\t Delwen - Falmer Bow,  Falmer Sword, Falmer War Axe (Forsworn Missile style).\r\nOther Kit: Assorted arrows and HMS poisons and potions.\r\nStatistics: Protected, Level 6 to 100, Level 3 Forsworn spell lists, plus self heal.\r\n\r\nYou can find them at the Riverside Shack and, as close twins, they are inseparable. In other words, a two for one deal. Ask either one to follow you, her sister will follow her.\r\n\r\nEverything, but the hair, is strictly vanilla. Of course, their appearance will vary with the body, cosmetic and Forsworn armor replacement mods you use. I use (and highly recommend):\r\n\r\nApachiiSkyHair v1.5\r\nBetter Females by Bella\r\nCover Eyes 2\r\nCover Women Look 1\r\nCute Freckles\r\nNo More Blocky Faces\r\nSporty UNP - Athletic Muscle Map\r\nUNP BASE - Main Body v1.2\r\n\r\nConflicts: None, unless the other mod also modifies cell RiversideShackExterior01.\r\n\r\nInstall: Manual only (I don\\'t use NMM, just out of personal preference). Uncompressed and place all files (minus readme) in your Skyrim data directory.\r\n\r\nUninstall: Delete all Fine Young Cannibals files.\r\n\r\nThoroughly tested, but if you find any non-cosmetic bugs, please let me know in comments. Best way to improve your modding is to learn how to fix unforeseen bugs. If the bugs are cosmetic, that\\'s on your end and there are already many excellent solutions posted on Nexus. As standard, any trolls or flames will be gleefully reported. Oh, and if they eat someone, please let me know.\r\n\r\nEnjoy and thanks for your time.\r\n\r\n\r\n\r\n",
  "categoryId": "96",
  "version": "1.1a",
  "author": "Tonar Garth",
  "createdUnix": "1373170191",
  "updatedUnix": "1421193758",
  "containsAdultContent": false,
  "uploadedBy": "tonargarth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000142744",
      "name": "FineYoungCannibals-v1p1a.rar",
      "version": "1.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4906",
      "fileName": "FineYoungCannibals-v1p1a.rar-38040-1-1a.rar",
      "uploadedUnix": "1421193758",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/4387e7b2c8ab9c6926c70eb4da66a60ee78a31d49dc8d78a7bfb1f66a7278138/analysis/1421193785/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FineYoungCannibals-v1p1a.rar-38040-1-1a.rar?fid=1000142744&ttl=1535818167&ri=8192&rs=8192&setec=f42ca2e88ba553447167e28a614621db"
    }
  ]
}