{
  "modId": 38055.0,
  "modName": "Full four item effect Alchemy and Smithing fortify skill on one ring",
  "summary": "The maximum fortify skill boost from four items for Alchemy & Smithing, as well as huge carryweight boost applied to one ring for convenience. Use for crafting, shopping, etc.",
  "descriptionHtml": "[b]Description[/b]\r<br />==========\r<br />Adds three rings that can be found in Dragonsreach on the shelf in Farengar&#39;s main room (see pictures for an arrow pointing to them).\r<br />\r<br />The enchants are new, and can be disenchanted and learnt, if you wish to put them on another item (not really necessary but if you don&#39;t like the standard jewellry and prefer another mods jewelry I thought I&#39;d give you this option).\r<br />\r<br />The enchants are as follows:-\r<br />\r<br />[b]Ring 1[/b]:  120% alchemy, 120% smithing, 6000 carryweight\r<br />[b]Ring 2[/b]:  150% alchemy, 120% smithing, 6000 carryweight\r<br />\r<br />Ring 3:  10,000% alchemy, 120% smithing, 6000 carryweight\r<br />\r<br />I based the first two enchants on having maxed my trade skill and being able to make enchant items with a fortify boost of 29% (I rounded it up to 30% for convenience) this can be applied to 4 items 4 x 30% = 120%\r<br />\r<br />For those who have used five items for alchemy if you wear a falmer helmet over a circlet, not sure if that was a glitch, there is the second ring with 150%, (use or don&#39;t use as you feel fit).\r<br />\r<br />I have seen comments on various sites you can get a higher fortify enchant with vampirism but I&#39;ve never been able to replicate it.\r<br />\r<br />\r<br />[b]Ring [/b]3.\r<br />The third ring is by request to allow the creation of a overpowered fortify enchant potion, to enable an enchanter with zero skill. To place enchants of a similar strength to items found throughout the game on to modded/crafted items. The player did not want to raise that skill at that point, and this method offered a convenient solution to getting the gear he liked the look of with a decent enchant.\r<br />To tailor an enchant to your desired amount you can disenchant to learn the enchant and then place on more than one item to boost the effect further. Or if it is to powerful you can use smaller soul gems to reduce the effect.\r<br />\r<br />\r<br />\r<br />The reason for the carryweight. I always thought there should be a porter you could hire or wheel barrow you could push your gear about with in towns etc. At the very least random spots with carriages parked up on the roads, where you could pay the driver to deliver your items to your house/selected city gate. Without anything like that in the game, it just makes selling your horde of goods, or moving house tedious and unrealistic. Hence the huge boost to carryweight on this ring, a simple solution and easy to equip/unequip.\r<br />\r<br />\r<br />\r<br />[b]Miscellaneous version 200 percent[/b]\r<br />===============================\r<br />Made by request, has all three rings as above without the carryweight boost, and has the smithing set at 200% instead of 120%. If you want to use this version you do not need the main version. However you can use both versions at the same time if you want.\r<br />\r<br />Please note unlike the main version if you disenchant the rings from the miscellaneous version to apply the enchant to a new item. Your enchanting skill will affect the percentage of the alchemy or smithing enchantment you receive on the new item.\r<br />\r<br />ie In the main version with any skill level in enchanting you can disenchant the rings and enchant new items with 120% alchemy & 120% smithing (with variable carry weight).\r<br />In the miscellaneous version your enchanting skill will affect either the alchemy or smithing percentage, so you may end up creating new items with  120% alchemy & 657% smithing.\r<br />\r<br />\r<br />\r<br />[b]Miscellaneous version 132 percent[/b]\r<br />===============================\r<br />Same as the main version but includes one additional ring that has fortify alchemy and smithing set at 132%.\r<br />\r<br />\r<br />Requirements\r<br />============\r<br />None\r<br />\r<br />\r<br />\r<br />Installation Instructions\r<br />====================\r<br />Install using NMM.\r<br />\r<br />\r<br />\r<br />Uninstallation\r<br />============\r<br />Uninstall mod using NMM.\r<br />Delete.\r<br />\r<br />\r<br />\r<br />Incompatabilities\r<br />===============\r<br />The only mod I can think of is possibly Skyre (I beleive that changes the fortify crafting enchants to a speed boost enchant, as my mod is effectively a new enchant it may work as I have described, alternatively if the effect was changed in skyre you could a ring of huge speed boost).\r<br />\r<br />\r<br />\r<br />My other Mods\r<br />=============\r<br />If you like this mod you may also like be interested in my other mod below.\r<br />\r<br />\r<br />***Alchemy and Atronach Forge Guide Books***  http://skyrim.nexusmods.com/mods/32608/?\r<br />Adds a Alchemy guide book, detailing potions I have found useful. Mainly multiple ingredient, multiple effect poisons and potions. Also gives details on ingredients for poisons with the maximum strength.\r<br />Adds two Atronach Forge Guide Books, listing all vanilla game recipes.\r<br />All these books are free and weightless available from Whiterun Dragonsreach.\r<br />\r<br />\r<br />***Improved Atronach Forge*** http://skyrim.nexusmods.com/mods/32623/?\r<br />Adds more recipes to the Atronach Forge that do not require the sigil stone. Notably this mod has more Staffs, Conjuration spell tomes, Potions and Poisons, etc.\r<br />It also amends the original fire, frost and void salts recipe to give 10 items instead of 1, making it slightly more useful for alchemy.\r<br />\r<br />\r<br />***Nightingale Hall and Twilight Sepulcher - Improved*** http://skyrim.nexusmods.com/mods/34743/?\r<br />Upgrades Nightinagle Hall upon completion of the Thieves guild questline, to a more fitting home for Karliah. Adds crafting stations, general gold silver bling, weapons racks, mannequins etc. Also adds the portal to the Inner sanctum for changing your nightingale powers.\r<br />Twilight sepulcher moved the portal door that appears after completing the thieves guild questline back to the end of the dungeon. (ie jumping down the well to get into the inner sanctum). The portal door was moved as it made no sense that it was placed at the start of the dungeon upon completion.\r<br />\r<br />\r<br />Credits and Thanks\r<br />==================\r<br />Thanks to Bethesda for creating Skyrim and the creation kit.",
  "categoryId": "27",
  "version": "1.0",
  "author": "ClackingKeys",
  "createdUnix": "1373218990",
  "updatedUnix": "1411993809",
  "containsAdultContent": false,
  "uploadedBy": "ClackingKeys",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037716",
      "name": "AlchemySmithingFortifySkillsRings1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "AlchemySmithingFortifySkillsRings1_0-38055-1-0.7z",
      "uploadedUnix": "1373218313",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/57c5447960e8286e82c06b6d0cb48043310c7e9e82d2a1dd6a121943d0df9dbe/analysis/1407634267/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AlchemySmithingFortifySkillsRings1_0-38055-1-0.7z?fid=1000037716&ttl=1535818204&ri=8192&rs=8192&setec=7d3997a0b1f5c8ee3f615830209dd0a9"
    },
    {
      "fileId": "1000058312",
      "name": "FortifySmithing200percentVersion",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1",
      "fileName": "FortifySmithing200percentVersion-38055-1-0.7z",
      "uploadedUnix": "1380152206",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0555ce4f63523b5add893c37a0efc39a33cca85b0898ab7ab6d860ed981056e2/analysis/1407734589/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FortifySmithing200percentVersion-38055-1-0.7z?fid=1000058312&ttl=1535818204&ri=8192&rs=8192&setec=60464750e9781dfec12c87abd2993b83"
    },
    {
      "fileId": "1000128916",
      "name": "FortifySmithing132percentVersion",
      "version": "1.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1",
      "fileName": "FortifySmithing132percentVersion-38055-1-1.7z",
      "uploadedUnix": "1411993809",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b27bad687658e830dc89519adfda3e8ce11717ccf950c6bf1cb8aa75fb8fd5bf/analysis/1411993922/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FortifySmithing132percentVersion-38055-1-1.7z?fid=1000128916&ttl=1535818205&ri=8192&rs=8192&setec=8d13729b7904197d2c8a9b3031f1eb33"
    }
  ]
}