{
  "modId": 38060.0,
  "modName": "SkyDye - Grow and dye your Hair and Beard",
  "summary": "Introduces dynamic hair & beard growth, beard shaving, hair cutting and hair & beard dyeing to Skyrim for your male character. Female characters can also find and use all of the new hair dyes.",
  "descriptionHtml": "[CENTER][IMG]http://i40.tinypic.com/a9px69.png[/IMG][/CENTER]\r<br />[CENTER][IMG]http://i43.tinypic.com/2ev417b.png[/IMG][/CENTER]\r<br />[CENTER][youtube]-y9X7b3_0sY[/youtube][/CENTER]\r<br />[CENTER][COLOR=#76923C]Huge thanks to [B][U][URL=http://www.youtube.com/user/nozi87]Nozi87[/URL][/B][/U] for the awesome review&#33;[/COLOR] [/CENTER]\r<br />[IMG]http://i43.tinypic.com/30xc4dc.png[/IMG]\r<br />[FONT=Franklin Gothic Medium]SkyDye introduces a dynamic hair & beard growth, hair cutting, beard shaving and hair & beard dyeing system to Skyrim.\r<br />\r<br />At the moment, this mod supports beard and hair growth for male Nords, Redguards, Imperials, Bretons, Orcs, High Elves, Dark Elves and Wood Elves. Your characters beard will grow every 12 hours (approx.) and your hair will grow every 24 hours (approx.)\r<br />\r<br />Currently, there&#39;s no hair growth system in place for females - but they can discover and use the new dyes.\r<br />\r<br />There are a wide variety of dyes included in this release: Ranging from your standard auburn, blonde, black and brown dyes to Gaia dyes, Blood dyes, Floral dyes, Rainbow dyes and Winter dyes which will colour your hair with a random colour associated with the dye name. For example, using a &#39;Gaia Dye&#39; might dye your hair and beard a sky blue colour.\r<br />\r<br />Scissors, razors and dyes have been incorporated into loot lists and can be found on defeated enemies, picked from pockets and discovered in chests.\r<br />\r<br />To speed up the hair & beard growth process for testing purposes, you can use the console command &#34;set timescale to 10000&#34; or similar.\r<br />[IMG]http://i41.tinypic.com/2eq73pv.png[/IMG]\r<br />[LIST]\r<br />[*] Dynamic beard growth over time\r<br />[*] Dynamic hair growth over time\r<br />[*] Hair dye system: A wide variety of dyes to find and use\r<br />[*] Razor to shave your beard\r<br />[*] Scissors to cut your hair\r<br />[*] Scissors, razors and dyes added to world NPC&#39;s loot tables, pockets & chests to encourage &#39;dye farming&#39;(&#33;)[/LIST]\r<br />[IMG]http://i39.tinypic.com/2i9m5v7.png[/IMG][LIST]\r<br />[*]Player defined beard & hair growth intervals [b][COLOR=#F79646]WIP[/COLOR][/b]\r<br />[*]Support for all races [i](excluding argonian and khajiit, due to lack of hair assets)[/i] [b][COLOR=#00B050]DONE[/COLOR][/b]\r<br />[*]More dyes and craftable dyes [b][COLOR=#F79646]WIP[/COLOR][/b]\r<br />[*]Barber [b][COLOR=#F79646]WIP[/COLOR][/b]\r<br />[*]Look into providing compatibility / support for the [URL=http://skyrim.nexusmods.com/mods/28363/]Beards[/URL] mod [b][COLOR=#F79646]WIP[/COLOR][/b]\r<br />[*]General tweaks, improvements and optimization [b][COLOR=#F79646]WIP[/COLOR][/b][/LIST]\r<br />[IMG]http://i40.tinypic.com/2s6sgp2.png[/IMG][LIST]\r<br />[*]The papyrus script function used to update the player mesh causes physics to implode if it&#39;s run while the character is mounted. To counteract this, I&#39;ve forced a dismount on the player if their hair or beard grow while mounted. This should prevent the physics issue. Note: This only has a chance of occurring a maximum of 2 times in a 24 hour period.\r<br />[*]Using an already existing character with SkyDye will cause newly grown hair and beards to grow over the top of your existing hair & beard, causing visible clipping. Shaving and trimming will only remove the newly grown hair / beard, the original hair will not be removed.\r<br />[*]Hair/beard growth will sometimes lead to issues with facial features; for example, when a stage of beard growth occurs, the players eyes might vanish. This seems to be related to scars and other extra features of the players face being overwritten or replaced when SkyDye attempts to create/add the new hair or beard mesh.[/LIST]\r<br />[IMG]http://i44.tinypic.com/x367vr.png[/IMG]\r<br />[LIST]\r<br />[*]SkyDye should be compatible with all expansions.\r<br />[*]SkyDye has currently been developed to work with only the standard, vanilla hairstyles and beards.\r<br />[*]If you don&#39;t already have it, you&#39;ll need [URL=http://skse.silverlock.org/]SKSE[/URL]. See Gopher&#39;s [URL=http://www.youtube.com/watch?v=xTGnQIiNVqA]SKSE installation tutorial[/URL] for assistance.\r<br />[*]When starting a new character, it&#39;s a good idea to make sure he&#39;s bald and beardless (this requirement will be removed later)[/LIST]\r<br />[IMG]http://i43.tinypic.com/2ij11e1.png[/IMG]\r<br />I&#39;ve been dabbling with the Skyrim CK and Papyrus scripting for little more than a week, so SkyDye is presented as BETA for now. At present, it&#39;s recommended that you only download this mod if you&#39;re comfortable with the BETA concept; Basically, that this is an early, &#39;bare bones&#39; release which offers basic functionality and a glimpse into the core concept of the mod. Things might not work properly and the currently implemented content isn&#39;t necessarily indicative of the content planned for the final mod. Forgive any issues or incompatibilities and keep in mind I&#39;m aware of most of these errors and that I&#39;ll be working to improve upon this mod over time. This mod was hidden from public view, but due to some requests and inquiries via PM, I&#39;ve made it public again for players to try out.[/FONT]",
  "categoryId": "78",
  "version": "3.0",
  "author": "rmmuk",
  "createdUnix": "1373223942",
  "updatedUnix": "1373328197",
  "containsAdultContent": false,
  "uploadedBy": "rmmuk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037944",
      "name": "SkyDye v3",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "635",
      "fileName": "SkyDye v3-38060-3-0.rar",
      "uploadedUnix": "1373328197",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/83883f457f7f046e6ce6020408e727f696073c7b94acb53280e069e5388867a2/analysis/1407635849/",
      "changelogHtml": " • Added more colour outcome possiblities to various dyes \r<br />\r<br />• Adjusted some of the existing dye &#39;flavour texts&#39; \r<br />\r<br />• Gave each dye its own bottle design, instead of the standard black vial they were all using previously \r<br />\r<br />• Optimized bits of scripts \r<br />\r<br />• Removed harmless, stray messages that were only meant to show while I was building & testing the mod \r<br />\r<br />• At the character creation screen, male races will default to a bald and beardless preset so you don&#39;t have to tweak the hair and beard options with each new character \r<br />\r<br />• Shortened the haircut and shaving sound effects slightly <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyDye%20v3-38060-3-0.rar?fid=1000037944&ttl=1535818211&ri=8192&rs=8192&setec=8cc251ba9c9048faed55298a84db9921"
    }
  ]
}