{
  "modId": 38098.0,
  "modName": "The Agonizer",
  "summary": "Weapon for the conscientious objectors, and sadists alike. ",
  "descriptionHtml": "For a while now i have had a \\\"pain stick\\\" mod in mind.  This weapon knocks your opponents on their butts, and puts the fear of God into them.  Most enemies will beg for mercy and/or flee after they manage to get back up off the floor.  However, if you keep running them down after hitting them, you can keep hitting them faster than they can get up, until they are dead, or you are satisfied they are out of the way.  When used on higher level creatures, this weapon causes your one handed skills to go up rapidly if you beat your opponents to death.  The effect is hilarious to say the least, especially in rooms full of creatures that can\\'t get away from you.  Also, it is quite satisfying to knock Vilkas and Tsun on their butts.  Low level creatures such as wolves and skeevers usually are vanquished on first blow.  Other creatures may require several blows to defeat.  The weapon does require recharging with soul gems, but holds a charge for a very long time.\r\n\r\nRequirements\r\n1) Skyrim (as far as i know, no DLCs or other mods are required)\r\n2) Dwarven Smithing Perk\r\n3) 2 Dwarven Ingots\r\n4) Leather Strips\r\n5) Dwarven Gyro\r\n\r\nFor Upgrading you will also need\r\nDwarven Ingot, and Centurion Dynamo Core\r\n\r\nThe downside is that this weapon can cause nearby allies to become angry with you if you accidentally smack them with it.  So, i would not use this weapon for civil war battles.  Custom companions usually forgive you for friendly fire, but companions assigned by the vanilla game might not.  Save often for situations like this, and be prepared to go back a save if you\\'ve gotten yourself into trouble with it.  Also, despite putting the fear settings really high, some creatures appear to be immune to the fear, and will go back to attacking you when they get up.  So far i have noticed that \\'sometimes\\' this fear effect does not affect draugr and vampires.  this is inconsistent, sometimes it does, sometimes it does not.  Also, it is not the greatest weapon against dragons.\r\n\r\nNow, go out and REALLY SMITE YOUR ENEMIES LIKE NEVER BEFORE!!!\r\n\r\nCredits and my gratitude go to\r\n\r\nControl Rod by Urwy (the original weapon with amazing animation that this is based on)\r\n\r\nhttp://skyrim.nexusmods.com/mods/21201//?\r\n\r\nMjolnir by Ghosu (A truly epic weapon which i borrowed the knockback effect from)\r\n\r\nhttp://skyrim.nexusmods.com/mods/9196//?\r\n\r\nLastly, this, as all my mods, derivative as they may be, are Nexus only.  Please do not upload to other sites.\r\n",
  "categoryId": "55",
  "version": "",
  "author": "kar2nz",
  "createdUnix": "1373321464",
  "updatedUnix": "1373321377",
  "containsAdultContent": false,
  "uploadedBy": "kar2nz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037930",
      "name": "The Agonizer",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5668",
      "fileName": "The Agonizer-38098-.rar",
      "uploadedUnix": "1373321377",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ac8226c31af9fd2b4ec8ddf83f00e8ef594dfd48c97163dfeb4cdbfcfd259680/analysis/1407635765/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Agonizer-38098-.rar?fid=1000037930&ttl=1535818264&ri=8192&rs=8192&setec=d46ff235712488a4a2abe4e50e86366a"
    }
  ]
}