{
  "modId": 38176.0,
  "modName": "Spanish Alquimia y cocina",
  "summary": "Este mod modifica todas las pociones, venenos , bebidas, alimentos e ingredientes del juego para conseguir un mayor equilibrio y utulidad. Tambien modifica el arbol de alquimia",
  "descriptionHtml": "[center][color=#00ff00][size=6]ESTE MOD SE INCLUYE EN SPANISH SKYRIM RECONSTRUCTION[/size][/color][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/60019/?][img]http://static-4.nexusmods.com/15/mods/110/images/60019-1-1416161168.jpg[/img][/url][/center]\r<br />\r<br />\r<br />Version 1.1\r<br />\r<br />Corregidos algunos aspectos del mod:\r<br />Correccion de 4 venenos que no aumentaban su potencia o reducian su peso.\r<br />Modificados 2 efectos de restauracion que afectaban a alimentos y bebidas (se me paso)\r<br />Corregido el peso de 3 ingredientes (que pesaban 1.0 en vez de 0.1).\r<br />\r<br />Actualizar y listo, gracias por aprobar.\r<br />\r<br />Version 1.0\r<br />\r<br />Este mod modifica todas las pociones, venenos , bebidas, alimentos e ingredientes del juego para conseguir un mayor equilibrio y utilidad.\r<br />\r<br />Introduccion: Este mod lo he creado con la intencion de modificar los elemntos anteriormente descritos y dar una utilidad a todo, incluye los mods:\r<br />Spanish Pociones Realista http://skyrim.nexusmods.com/mods/34123\r<br />Vinis Polished Alchemy Perk Tree http://skyrim.nexusmods.com/mods/13795\r<br />Algunos valores son muy parecidos a los de unleashed\r<br />\r<br />Descripcion: Este mod modifica y mejora la alquimia y los alimentos de Skyrim que pasare a describir\r<br />\r<br />Genericos\r<br />-Todas las Pociones, venenos y bebidas pasan a pesar 0.2\r<br />-Todos los ingredientes pasan a pesar 0.1\r<br />-Casi todos los venenos y pociones tienen un valor menor\r<br />-El peso de los alimentos se mantiene\r<br />(esto aumentara nuestra capacidad para cargar estos elementos)\r<br />  \r<br />Especificos:\r<br />Pociones:\r<br />-La duracion de las pociones aumenta al doble (a excepcion de las pociones que tenian como duracion 300seg) \r<br />-Las pociones de reforzar herreria o encantamientos aumentan a 300 seg (facilitara su uso) \r<br />-Las pociones de curacion curan en 5 seg y no son acumulables.\r<br />-Las pociones de invisibilidad no fueron modificadas en su duracion\r<br />\r<br />Venenos\r<br />-Los venenos de daño han sido modificados y ahora existe una gran variedad de potencias y duraciones, tanto encontrados como creados (ver fotos) \r<br />-Venenos de frenesi y miedo aumentaron su potencia y duracion al doble\r<br />-Paralisis no fue modificado\r<br />\r<br />Ingredientes\r<br />-Modificados con los mismos fundamentos que las pociones y los venenos\r<br />\r<br />Comida y bebida\r<br />-La comida ahora desempeña un papel util ya que la mayoria otroga buenos y diversos beneficios, la curacion sigue los mismos fundamentos que las pociones y la comida elaborada tendra una potencia y utilidad mucho mayor\r<br />-La bebida ahora sigue los mismos fundamentos que las pociones de curacion de aguante pero todas tienen penalizaciones (no todas regeneran aguante y no todas dañan la salud) \r<br /> \r<br />Arbol de alquimia\r<br />-Se modifica la composicion del arbol (mirar fotos)\r<br />-Experimentador ahora solo tiene un nivel y se puede obtener a lvl 25 (es un perk bastante inutil estando internet ajajaj ahora te lo puedes plantear)\r<br />-Medico aumenta su potencia a 50%\r<br />-Envenenador aumenta su potenci a 50%\r<br />-Benefactor no afecta a pociones de curacion\r<br />-Veneno concentrado aumenta los golpes a 4\r<br />\r<br />Bueno todos estos cambios intentar hacer que todo sea mas util y accesible para cada determinado roll y potencia cosas que el juego original no trato con mucho detenimiento, tambion elimina algunos bugs relacionados con estos elementos.\r<br />&#34;Nota&#34;: Hay un cambio en los efectos de restauracion que no es igual a unofficial, no modifiquen este campo, esta hecho a drede para que funcione bien\r<br />\r<br />Requerimientos: Todos los DLCs y el ultimo update.\r<br />\r<br />Compatibilidad: Compatible con cualquier otro mod que no modifique estos elementos, si usted quiere combinarlo con otros mods como necesidades reales o modificaciones mas especificas cargue ese mod por detras de este.\r<br />\r<br />Notas personales: Lo que mas me motivo de este mod fue modificar los venenos y la fabricacion de los mismos, ya que en el original esto estaba muy mal sin un sentido ni potencia logica pero decidi implementarlo todo en un solo mod y ahorrar esp \r<br />\r<br />Agradecimientos\r<br />Aunque modificar numeros y elementos del juego (que ya se incluian) no tiene copyright quiero agradecer a Vinifera7 y a Laast ya que base algunos valores en modificaciones de sus mods.\r<br />\r<br />Recopilacion de mods http://www.3djuegos.com/comunidad-foros/tema/19228710/0/mods-skyrim-02-07-2013/",
  "categoryId": "24",
  "version": "1.1",
  "author": "Incata",
  "createdUnix": "1373486032",
  "updatedUnix": "1374111110",
  "containsAdultContent": false,
  "uploadedBy": "incata",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038290",
      "name": "Alquimia y cocina",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24",
      "fileName": "Alquimia y cocina-38176-1-0.rar",
      "uploadedUnix": "1373486212",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/97f491912e33c980cdea01de75e236db8df10fd9d5c7d0619a56c6eec987cf75/analysis/1407638466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alquimia%20y%20cocina-38176-1-0.rar?fid=1000038290&ttl=1535818381&ri=8192&rs=8192&setec=f975031bfb286280b05cd36b882e76ef"
    },
    {
      "fileId": "1000039432",
      "name": "Alquimia y cocina",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24",
      "fileName": "Alquimia y cocina-38176-1-1.rar",
      "uploadedUnix": "1374111110",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/772905b5db64eddb7653d680c0ec1f378f1856bfb78b5012b5f64f3fd2a38d24/analysis/1407647524/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alquimia%20y%20cocina-38176-1-1.rar?fid=1000039432&ttl=1535818381&ri=8192&rs=8192&setec=89352044f99e1992123d8d337990457b"
    }
  ]
}