{
  "modId": 38225.0,
  "modName": "Whiterun Bunker v1",
  "summary": "",
  "descriptionHtml": "Whiterun Bunker is located directly behind Whiterun Stables.\r\n====================\r\nDuring a conflict with the Stormcloaks Commander Vladius died defending his post. While his spirit has grown used to the idea of his once glorious bunker turned tavern, he now returns to fend off any newcomers. Defeating him will award you great appreciation from those who dwell within the bunker. So be prepared to enter combat the moment you step inside.\r\nJust a side note here: The best time to enter the bunker is between 9:00pm and 5:00am. During this time Lieda (a follower) will be sleeping. If she engages in combat with Vladius she may use her shout ability which tends to make a mess of the place.\r\n====================\r\n“Whiterun Bunker” is a mod that I created that includes several things all wrapped up into one.\r\nFirst we have four different classes of followers which have several higher level perks and abilities. Each follower is different in it’s own way and style of combat.\r\nSecond we have a tavern which you can pick up several new recipes. By doing so you will be able to create a large variety of things such as companions, food, armor, and a spectral warhorse.\r\nThe bunker also includes a bed you can rent, as well as four weapon plaques, two mannequins, and two storage containers just for your use.\r\nBelow is a further description of the bunker.\r\n====================\r\nFOLLOWERS:\r\n\r\n01) All followers are set for \\\"potential marriage\\\". \r\n02) They are also set as \\\"protected\\\". So they can be killed and will not respawn.\r\n03) All follower default gear is set as \\\"unplayable\\\".\r\n04) Follower speed is set at 125.\r\n05) Some perks may have been renamed to alter conditions for followers.\r\n06)  Most characters have a sleep schedule. If they are a vendor their sleep will not stop \r\n    them from buying or selling. Just wake them up and they will deal.\r\n07) All followers have some type of ranged ability as well as close combat ability. They also have torches in their inventory.\r\n08) Some follower spells, abilities and perks have been modified to work at all levels regardless of your skill level.\r\nThe above rules only apply to the followers created for this mod.\r\n----------\r\nLIEDA:\r\nRace: Breton (female)\r\nClass: Battlemage / Spellsword\r\n\r\nArmor (light):\r\na) Warlock Hood (Spec’ed to match Thieves Guild Helm).\r\nb) Ebony Mail Cuirass (Spec’ed to match Elven Cuirass)\r\nc) Ebony Gauntlets (Spec’ed to match Elven Gauntlets)\r\nd) Ebony Boots (Spec’ed to match Elven Boots)\r\n\r\nWeapon(s): \r\na) Ebony War Axe x2\r\n\r\nInventory:\r\na) Torch x1\r\nb) Chest key x1\r\n\r\nSpells and Abilities:\r\na) Healing\r\nb) Healing Hands\r\nc) Lightning Bolt\r\nd) Conjure Storm Atronach for 5 minutes.\r\ne) Call Storm Shout\r\n\r\nPerks:\r\na) Paralyzing Strike\r\nb) Disintegrate\r\nc) Savage Strike\r\nd) Critical Charge\r\ne) Allow Shout\r\nf) Destruction 00 - 100\r\n----------\r\nRa-Kahn:\r\nRace: Argonian (male)\r\nClass: Combat Assassin\r\n\r\nArmor (light): \r\na) Dark Brotherhood Armor\r\n\r\nWeapons: \r\na) Daedric Dagger x2\r\n\r\nInventory\r\na) Torch x1\r\nb) Chest key x1\r\n\r\nSpells and Abilities:\r\na) Assassin\\'s Darts (casting ability which fires darts).\r\nb) Heal Self\r\nc) Assassin\\'s Cloak (invisibility when entering combat).\r\nd) Thieves Cloak (invisibility while sneaking).\r\ne) Lockpicking up to Master (100)\r\nf) Dual Flurry 50\r\ng) Conjure spider for 5 mins.\r\n\r\nPerks:\r\na) Stealth 00 - 100\r\nb) Silence\r\nc) Silent Roll\r\nd) Light Foot\r\ne) Backstab\r\nf) Assassin\\'s Blade\r\ng) Muffled Movement\r\nh) Shadow Warrior\r\nj) Lockpicking 00 - 100\r\n----------\r\nZohl:\r\nRace: Orc (male)\r\nClass: Barbarian\r\n\r\nArmor (heavy): \r\na) Orcish Armor\r\n\r\nWeapons: \r\na) Orcish Greatsword (2h)\r\nb) Orcish Bow with Nord Hero Arrows\r\n\r\nInventory:\r\na) Torch x1\r\nb) Chest key x1\r\nc) Nord Hero Arrows\r\n\r\nSpells and Abilities:\r\na) Heal Self\r\nb) Extra Pockets (300)\r\nc) Rally\r\nd) Conjure Chaurus Reaper for 5 minutes.\r\ne) Disarm\r\n\r\nPerks:\r\na) Devastating Blow\r\nb) Barbarian80\r\nc) Great Citical Charge\r\nd) Tower of Strength\r\ne) Juggernaut80\r\nf) Power Orc Berserk\r\ng) Sweep\r\nh) Warmaster\r\n----------\r\nZyris:\r\nRace: Imperial (male)\r\nClass: Ranger / Hunter\r\n\r\nArmor (light): \r\na) Savior\\'s Hide (not enchanted)\r\nb) Leather Helm \r\nc) Stormcloak Bear Boots\r\nd) Stormcloak Bear Gauntlets\r\ne) Spiked Shield\r\n\r\nWeapons: \r\na) Ebony Bow with Nord Hero Arrows\r\nb) Imperial Sword\r\n\r\nInventory:\r\na) Torch x1\r\nb) Chest key x1\r\n\r\nSpells and Abilities:\r\na) Heal Self\r\nb) Conjure Warhound for 5 minutes\r\nc) Resist poison by 100\r\nd) Assassin\\'s Cloak (invisibility when entering combat)\r\ne) Thieves Cloak (invisibility while sneaking)\r\nf) Detect Dead\r\ng) Detect Life\r\n\r\nPerks:\r\na) critical Shot 90\r\nb) Muffled Movement\r\nc) Light Foot\r\nd) Deflect Arrows\r\ne) Power Shot\r\nf) Ranger\r\ng) Overdraw 80\r\nh) Shield Wall 80\r\n----------\r\nDremora Valkynaz: (requires spell to summon)\r\nRace: Dremora\r\nClass: Dremora Melee\r\n\r\nArmor: Daedric Heavy Armor set\r\n\r\nWeaopns:\r\na) Daedric Sword (1) with Daedric shield\r\nb) Daedric Bow with Daedric arrows\r\n\r\nInventory:\r\na) Torch x1\r\n\r\nSpells and Abilities:\r\na) Heal Self\r\n\r\nPerks:\r\na) Paralyzing Strike\r\nb) Savage Strike\r\nc) Critical Charge\r\nd) Shield Wall\r\ne) Deflect Arrows\r\nf) Critical Shot\r\ng) Power Shot\r\nNOTE: In order to obtain the ability to summon the Valkynaz you must first purchase the book from \\\"ANOUK\\\" in the bunker titled \\\"A Warrior\\'s Request\\\". The book will explain what you need to do.\r\nOnce you complete your task you will then be able to summon the Valkynaz for 10 minutes.\r\n----------\r\nFollower End Table Keys: Each follower has their own storage. The keys can be obtained \r\nfrom their prospective owners by \\\"trading\\\" with them. As you obtain the keys you will learn \r\na new recipe that teaches how to make each key. This is a “fail safe” that I included in case \r\nthe keys are lost or sold. Each follower’s end table WILL RESPAWN. So do not store items in them. \r\nKeys can be crafted at the forge or anvil.\r\n====================\r\nOTHER CHARACTERS:\r\n\r\nRolkyr:\r\ncook and vendor.\r\nWill sell food and a recipe for \\\"Colovian Moonshine\\\".\r\n--------------------\r\nCyrean:\r\nBartender and Innkeeper.\r\nSells drinks.\r\n--------------------\r\nAnouk:\r\nFormer member of Mythic Dawn. Now holds a shop and sells alchemy related goods.\r\n--------------------\r\nJ\\'Zahn:\r\nA College of Winterhold hopeful, she sells enchanting goods to help pay her way through\r\ncollege.\r\n--------------------\r\nVoris: \r\nA Breton elder, Voris spends his time crafting armor and selling goods in his blacksmith shop.\r\n--------------------\r\nSaldis:\r\nSuch a sad case. Saldis, a disgraced member of the Thieves Guild, was dismissed for being\r\ncaught and beat up one too many times. He now drowns out his sorrows at the bar and makes\r\nwhat little money he can buying stolen items and selling goods.\r\n====================\r\nITEMS:\r\n01) The Mythic Dawn, Greybeard, Thalmor, Wedding Clothes, Noctturnal\\'s Gown, and Psijic armor sets are now playable and can be purchased from mod vendors. For this mod each new set has been altered to match that of light leather armor. Their counterparts were not changed. These pieces are NOT enchanted.\r\n\r\nBelow is a list of new recipes that are included with this mod. Each recipe\r\ncan be obtained from the various vendors (or inside a follower\\'s chest) inside the bunker.\r\nSome materials for these items may be difficult to obtain.\r\n\r\n01) Lockpicks (x10)\r\n02) Exploding Ebony Arrows (100)\r\n03) Dwarven Sphere: Learn to craft and conjure a Dwarven Sphere for \r\n    5 minutes. Once you craft the Dwarven Sphere a note will be added \r\n    to your inventory. You must read it to learn the ability.\r\n04) Thin Ebony Mail (cuirass): Weight - 19, Armor Rating - 38: Slightly weaker then it\\'s\r\n    original counter part from the quest chain \\\"Boethiah\\'s Calling\\\".\r\n05) Ice Wrath: Learn to craft and conjure an Ice Wrath for 5 minutes. \r\n    Once you craft the Ice Wrath a note will be added to your \r\n    inventory. You must read it to learn the ability.\r\n06) Reanimated Warrior: Learn to craft and conjure a one-handed melee skeleton for \r\n    5 minutes. Once you craft “Bones” a note will be added to your \r\n    inventory. You must read it to learn the ability.\r\n07) Corrupted Shade (hand to hand): Learn to craft and conjure a \\\"Corrupted Shade\\\"\r\n    for 5 minutes. Once you craft the “Corrupted Shade” a note will \r\n    be added to your inventory. You must read it to learn the ability.\r\n08) Colovian Moonshine: My favorite drink with a \\\"slight\\\" side effect. See cook for details.\r\n09) Amulet of Wars: A crafted amulet which increases some major stats.\r\n10) Woodsman: Learn to craft and conjure a one-handed melee Woodsman for \r\n    5 minutes. Once you craft your “Woodsman” a note will be added to your \r\n    inventory. You must read it to learn the ability.\r\n11) Spectral Saber: Learn to craft and conjure a Spectral Saber for \r\n    5 minutes. Once you craft the saber a note will be added to your \r\n    inventory. You must read it to learn the ability.\r\n    Please Note that this saber is very powerful, but still within default specs.\r\n12) Boiled Mammoth: Increases carry capacity by 75 for 10 minutes.\r\n13) Hard Boiled Egg: Resist magic by 25 for 2 minutes. Damage to magicka\r\n    regeneration by 50 for 1 minute. Waterbreathing for 5 minutes. Fortify\r\n    stamina by 25 for 5 minutes.\r\n14) Thunderbolt (new horse mount): Can only be summoned while in the Tamriel World. \r\n    Will not work while indoors or in closed cities. This is a spectral warhorse with a\r\n    speed of 125. Default is 100.\r\n15) Savior\\'s Hide Armor (fake): Leather chest armor without enchantment.\r\n16) Werewolf: Learn to craft and conjure a werewolf for 5 minutes. Once you craft the \r\n    werewolf a note will be added to your inventory. You must read it to learn the ability.\r\n17) Bone Crown (aka Jagged Crown). Heavy armor helm. Recipe can be purchased from\r\n    blacksmith inside the bunker. For this item only the name has been changed\r\n    from the original. The specs have been left the same.\r\nNOTE: The above abilities which summon require \\\"conjuration novice\\\".\r\n====================\r\nSPELLS and ABILITIES:\r\n\r\n01) Assassin\\'s Darts: Can be cast from either hand.\r\n    Fire darts at an enemy target. This spell can be learned by obtaining the \\\"note\\\" from\r\n    Ra-Kahn\\'s end table.",
  "categoryId": "66",
  "version": "v1",
  "author": "Zyris",
  "createdUnix": "1373575678",
  "updatedUnix": "1373574107",
  "containsAdultContent": false,
  "uploadedBy": "Zohl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038456",
      "name": "Whiterun Bunker v1",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2179",
      "fileName": "Whiterun Bunker v1-38225-v1.zip",
      "uploadedUnix": "1373574107",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/10598484069a2e5366a0cde0c4baa717bbd2022c05d6c858a918b9c9a8b4b4c3/analysis/1407639874/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whiterun%20Bunker%20v1-38225-v1.zip?fid=1000038456&ttl=1535818447&ri=8192&rs=8192&setec=eeb583f4f57690887b7ce9f7f8df5bf0"
    }
  ]
}