{
  "modId": 38251.0,
  "modName": "Silver Fang Mod",
  "summary": "Adds a boss fight with a certain red-backed bear.",
  "descriptionHtml": "On the way up to High Hrothgar, you will find yourself in a challenging battle against the giant, red-backed bear Akakabuto. You will help sereval stray dogs (including Gin and Riki) to defeat the monsterous bear. This is not a quest.\r\n\r\nAkakabuto, like an usual cave bear, will drop claws and a bear pelt. But he will also drop a leveled amount of gold, from 100 gold (lvl 1) to 2000 gold (lvl 70). Akakabuto, Gin and Riki levels with the player.\r\n\r\nRequirements:\r\nDawnguard\r\n\r\nKnown issues:\r\n-I intended to make Gin and Riki followers but I can\\'t seem to get the dialogue to work. Anyone is free to fix that then send the modified .esp to me. I would give credit of course.\r\n-The dogs will probably have killed or injured Akakabuto so much that he\\'s too easy to fight when you reach the area at lower levels.\r\n-I cannot make Aka one-eyed because of limitations with the UV-map sharing the same half.\r\n\r\nFuture plans:\r\n-To make Akakabuto a separate race and make that race\\'s damage more deadly, perhaps like Fallout\\'s Deathclaws.\r\n-Adding more named dogs from the Silver Fang anime. I would be glad if some decent modeler would provide me with custom dog meshes, I don\\'t know if there is a mesh resembling a Great Dane though.\r\n-Will make Gin and Riki\\'s textures somewhat darker as they look too bright in sunlight.\r\n-To make Aka drop a leveled amount of bolts (as if there has been many hunters who tried to shoot him with a crossbow but failed to kill him)",
  "categoryId": "83",
  "version": "1.0b",
  "author": "T3alrose",
  "createdUnix": "1373635617",
  "updatedUnix": "1373635612",
  "containsAdultContent": false,
  "uploadedBy": "T3alrose",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038555",
      "name": "Silver Fang mod",
      "version": "1.0b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6000",
      "fileName": "Silver Fang mod-38251-1-0b.rar",
      "uploadedUnix": "1373635612",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/3275b6dde93259f5810aeca27e04e1c5906b3f36d5da9f9fb842a1b54a3e7752/analysis/1407640634/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Silver%20Fang%20mod-38251-1-0b.rar?fid=1000038555&ttl=1535818488&ri=8192&rs=8192&setec=f21f6d85ce13265b883d09b4759ea969"
    }
  ]
}