{
  "modId": 3825.0,
  "modName": "7 More Companions self modification",
  "summary": "Self Modification,  7 Companions, 6 NPCs 1 Dog. \r\nNo need to download. \r\n",
  "descriptionHtml": "Self Modification, Do it yourself. \r\nW/o Mod you can get 6 total. \r\n\r\nI have 6 followers, you can get 7th follower barbas. \r\nmy goal is to get Farkas as the 2nd follower after Lydia. \r\nif multiple companions trainer work then I\\'ll get Farkas and have 8 companions  \r\n\r\n-1 Esbern \r\n-2 Delphine, from Alduin quest. (Duelwield 2 blades sword) \r\n-3 Brother Verulus from Markath: The Taste of Death quest, never bring him to Aola or he\\'ll be eaten. \r\n-4 Maurice from the whiterun shrine, don\\'t finish that quest. \r\n-5 Darkbrother Initiate from finishing assasin questline. \r\n(trick is to dismis Lydia next to Drakbrother initiate, then recruit Lydia then Initiate right away.\r\n-6 you can get Barbas dog from Falkreath quest but he keeps on pushing so I didn\\'t get him. \r\n-7 Then Jordis (or anyone u like) I click on Jordis I hit ~ then type \r\nssq 750ba \r\nforcerefintoalias animal  \r\nIF he/she is chicken out and run away,  Just hit ~ setav confidence 4 . she/he\\'ll never runaway. \r\n -8 Farkas \\\"if\\\" Multiple companions trainer works for you. \r\n\r\n**You can click ~ and type openactorcontainer 1 to give all of them gears. If it\\'s an upgrade they\\'ll wear it. \r\n**Many of them will duelwield if u give them a dagger and dwarven mace. Blade sword and Forsworn axe, or sword are common duelwield for many. \r\n\r\n* if you dont want them to cast spell, just hit ~ then\r\nclick on them then type forceav magicka 0 and they\\'ll just melee. \r\n\r\n* if you want the melee to cast magic then hit ~ click the npc u want. then type forceav magicka 1000 (whatever amount want) \r\n- Add anyspell u want them to use,  hit ~, click the npc, type addspell (spellnumber) \r\n\r\nexample : \r\nAddspell 000204c3    (enter)\r\nthey\\'ll tell you that summon familar spell just added. \r\nw/ enough magicka that npc will cast that spell randomly. \r\nget the spell list from http://www.uesp.net/wiki/Skyrim:Spells\r\n\r\n\r\nFamilar like dogs, flame, fire, lightnigh atronach will freeze your pc b/c they have very bad pathing. \r\nIF u have kick butt pc then you can make all of them cast spell, that\\'s 7x2 = 14+barbas+yourspell= 16 things + you that\\'s crazy. your pc gonna freeze. youjust watch them slay that dragon in Master setting.  \r\n\r\n====\r\n-U dont want them LOL, finish your quests, they\\'ll never get back in your party,  \r\n-Darkbrotherhood initiate is like Lydia you can dismis her normally, and she\\'ll be back at the Dawnstar Sactuary.  you can recruit her back the way from (dismis lydia then recruit lydia then Initiate rightaway)\r\n-to getrid of the npc that you used ssq 750ba.  \r\nhit ~, click on him/her  type disable , he/she will disappear.  \r\nGo to where you found him/her and spawn another copy,  from using ~ help Jordis 0  or ~help Jordis 4\r\nyou\\'ll get 000A2C8F \r\ntype in Player.placeatme 000a2c8f (enter)\r\nthere you go, she\\'s back to where you found her \r\n(Many npc have bad pathing to their home, if you place them anywhere, it might take days to getback to their original location, sometime never. so go to where you met them and spawn.  \r\n\r\nDisadvantage. \r\n\r\nThey\\'ll block your way in dungeons, use  Rus Ro Dah to push them away. or charge into them looking left,right,left,right keep going. they\\'ll move slowly after 3-5 seconds, do it fast only take you 1-2 seconds to by pass them. \r\n\r\nThe Companions that you used ssq 750ba will never sneak and give you a bounty if you killed friendly npcs. \r\nIf you have to kill someone just hit ~ click on him/her then type disable then ~ to back out, \r\nmake your kill then hit ~ then type enable.  that companion will come back. \r\n\r\nIf you\\'re using PS3/Xbos, I dont know LOL maybe 6 companions. w/ default gears and spell. ",
  "categoryId": "66",
  "version": "1",
  "author": "Targer",
  "createdUnix": "1324053849",
  "updatedUnix": "1324053849",
  "containsAdultContent": false,
  "uploadedBy": "nguyenlong311",
  "primaryFile": null,
  "files": []
}