{
  "modId": 38255.0,
  "modName": "Alte Muehle",
  "summary": "Player House auf Deutsch \r\nAutomatische Sortierung\r\nAutomatische Ausrüstung beim Schmieden\r\nEinizigartige Texturen und vieles mehr ",
  "descriptionHtml": "English Version here:  http://skyrim.nexusmods.com/mods/38295//?\r\n\r\n[heading]Update[/heading]\r\nEine Version ist hochgeladen. Diese Version behebt zwei Fehler.\r\nZum einen gab es noch zwei Container welche respawnen, zum anderen habe ich gehört das bei einigen die Leichte Rüstung und auch die Ebenerzrüstung aus dem Regal fielen.\r\nDiese Version sollte beides fixen.\r\n\r\n[heading]Beschreibung[/heading]\r\nDieses Mod fügt ein Player House hinzu welches auf der anderen Seite des Flusses in Riverwood zu finden ist. Mir hat immer ein Haus gefehlt wo ich hingehen kann, meine Sachen abladen, und wieder abhauen. Leider aber dauert das Sortieren eine Ewigkeit und irgendwann landen die Klamotten sonst wo.\r\nOder aber ich möchte eine Rüstung schmieden und ich bekomme gesagt das ich erst einmal zig Leder und jede Menge Barren brauche. Also wieder los zu den Containern und rausholen was ich brauche. \r\n[color=yellow][b]Das hat nun ein Ende.[/color][/b]\r\nDieses Haus bietet eine Auto Sortier Funktion und auch eine Auto Ausrüstungs Funktion. \r\nSoll heissen: Wann immer Ihr eine der Schmiedewerkzeuge benutzt, werdet Ihr mit den in euren Schmiede Containern befindlichen Teilen ausgerüstet. Nach getaner Arbeit wird alles wieder automatisch in die Container zurückgelegt.\r\nDas Automatische Sortieren funktioniert mit zwei Containern. Beide nennen sich \\\"Sortiertruhe\\\" und befinden sich zum einen direkt am Eingang und am Ausgang des Hauses. Dies macht es möglich alles zu sortieren ohne überhaupt das Haus zu betreten. \r\nWas immer Ihr da reinsteckt, wird automatisch in die entsprechende Kategorie sortiert und abgelegt. Die Container sind sicher weil sie nicht Respawnen. Einzig der Mülleimer vorm Haus wird sich alle drei Tage leeren. Hier könnt Ihr alles reinstecken was Ihr aus versehen mitgenommen habt.\r\nFolgende Kategorien gibt es.\r\n- Waffen\r\n- Leichte Rüstung\r\n- Schwere Rüstung\r\n- Zutaten\r\n- Seelensteine\r\n- Edelsteine\r\n- Gold\r\n- Kleidung\r\n- gekochtes Essen\r\n- rohe Nahrung\r\n- Bücher\r\n- Rollen\r\n- Sonstiges\r\n- Schilde\r\n- Schmuck\r\n- Erze\r\n- Barren\r\n- Leder / Felle\r\nVielleicht habe ich jetzt noch einen Container vergessen. Aber seht selbst nach.\r\nNatürlich findet Ihr dann im und um das Haus die entsprechenden Container um an die Dinge ran zu kommen wenn man das will. \r\nDas ganze ist hier zunächst nur für die Dinge aus Skyrim funktional. Dawnguard und Dragonborn kommt mit der nächsten Version.\r\nAchtet bitte darauf das die Container nicht wie normale Container aussehen. Also alles anschauen was da ist.\r\nIhr findet ein Gramophon welches auch funktioniert. Allerdings müsst Ihr dafür selbst tätig werden.\r\nUnd zwar:\r\n\r\n1. öffnet folgenden Ordner:\r\nC:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\music\r\n\r\ndort angekommen erstellt Ihr dort einen Neuen Ordner und nennt Ihn zzzmyhouse.\r\n\r\n2. sucht euch drei von euren Lieblingsliedern raus. \r\nIch bevorzuge die von Maluka. Die passen zum Thema und hören sich klasse an. http://malukah.com/free\r\nAnschliessend müsst Ihr die mp3 dateien in wmv Dateien umwandeln. Hierzu gibt es eine Menge Tools im Netz. Wenn die drei Dateien umgewandelt sind, benennt Sie um in  01.wav  , 02.wav  , 03.wav \r\nDiese Drei Dateien kopiert Ihr nun in den Ordner \r\nC:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\music\\\\zzzmyhouse\r\nNun funktioniert euer Gramophon und spielt nach Zufallsprinzip eure Musik.\r\n\r\nBegleiter werden euch folgen und auch die Dinge nutzen die sich in und um das Haus befinden.\r\n\r\nNicht zuletzt gibt es ein nettes Plätzchen um eure Drachenklauen und auch eure Drachenpriestermasken würdig abzustellen.\r\n\r\nEs soll zukünftig noch eine kleine Quest und Schlüssel und sowas geben. Aber dafür brauche ich noch etwas Zeit. Über Kommentare, ob postitiv oder auch negative konstruktive Kritik ist Willkommen. Natürlich freue ich mich ebenso über ein Endorsement. \r\n\r\n[heading]Installation[/heading]\r\nDas erspar ich mir jetzt. Wer es nicht weiss kann mich ja fragen.\r\n\r\n[heading]Bugs / Conflicts[/heading]\r\nDie Stufen sind ein wenig Hakelig. Das tut mir leid aber lässt sich nicht ändern.   :-)\r\nIn Konflikt wird das Mod nur mit Mods geraten die sich an der selben Stelle befinden.\r\n\r\n[heading]Credits[/heading]\r\nMeinen herzlichsten Dank an all die genialen Leute da draussen welche Stunden verbringen um so geniale Ressourcen Moddern wie mir bereit zu stellen. Ganz speziell danke ich:\r\n\r\nBlary - OpenBookRessource http://skyrim.nexusmods.com/mods/14134//?\r\nAriont50 - Arie Manor Furniture http://skyrim.nexusmods.com/mods/18566//?\r\nDarkRider - Celtic Decor for Skyrim I http://skyrim.nexusmods.com/mods/12394//?\r\nInsanity - WallCharts http://tesalliance.org/forums/index.php?/files/file/1473-insanitys-wall-charts/\r\nand lot more Stuff from Insanity\r\nLilith - Catering  http://tesalliance.org/forums/index.php?/files/file/1264-catering-by-lilith/\r\nOaristys´ Modders Ressource Pack  http://skyrim.nexusmods.com/mods/16525/?\r\nTamira  -  Strotis Outdoor Toilet Ressource  http://skyrim.nexusmods.com/mods/32056//?\r\n              Strotis Old Mill Ressource  http://skyrim.nexusmods.com/mods/37176//?\r\nund noch einige Ressourcen mehr von Tamira\r\nModders Resource - Auto sorting and auto looting when crafting by Sjogga\r\nUniversal Item Display Script (Weapons, Shields, Potions etc)\r\n\r\nIch hoffe ich habe niemanden vergessen.",
  "categoryId": "67",
  "version": "1.1",
  "author": "KuhlServ",
  "createdUnix": "1373658162",
  "updatedUnix": "1394299294",
  "containsAdultContent": false,
  "uploadedBy": "kuhlserv",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039095",
      "name": "Alte Muehle ",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "93173",
      "fileName": "Alte Muehle update-38255-1-1.rar",
      "uploadedUnix": "1373915846",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ebd9ccab4c3657c66aa2e6172d77802b632a9aeabd48f1e7110e635006aac093/analysis/1407645335/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alte%20Muehle%20update-38255-1-1.rar?fid=1000039095&ttl=1535818495&ri=8192&rs=8192&setec=c1ff432e0501628fd28b833114713465"
    },
    {
      "fileId": "1000100366",
      "name": "update ",
      "version": "",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "165",
      "fileName": "update -38255-.rar",
      "uploadedUnix": "1394299294",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/9cbe53741a164d33241c04d7c23c1b74f127c30735e64ca365c4e4a47605f3b2/analysis/1407965336/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/update%20-38255-.rar?fid=1000100366&ttl=1535818496&ri=8192&rs=8192&setec=7c1c6aa2081616533f63df11a551b991"
    }
  ]
}