{
  "modId": 38269.0,
  "modName": "CBM - Oblivion Dawn_Random Encounters",
  "summary": "The realm of Oblivion has returned and with it creatures from the pit of hell itself.",
  "descriptionHtml": "STATUS:\r\n\r\nRecieving updates.\r\n\r\n\r\nREQUIREMENTS: \r\n\r\nSkyrim official game.\r\nLatest updates.\r\nDawnguard dlc.\r\nDragonborn dlc.\r\n\r\n\r\nCOMPATIBILITY:\r\n\r\nThis mod should have little to no compatibility issues with any other mods since I have only added data entries and not changed any defaults.\r\n\r\n\r\nCONTENT GUIDE:\r\n\r\n1. Mod Details\r\n2. Planned Updates\r\n3. Install/Uninstall\r\n4. Bugs/Fixes\r\n5. Q&A\r\n6. Best Comments Wall\r\n\r\n\r\n**********************************************************************\r\nMOD DETAILS\r\n******************\r\n\r\n- Adds a \\\"survival mode\\\" to Skyrim, how this works is that \\\"tears\\\" will manifest around the Dragonborn allowing creatures to enter the realm of Skyrim and begin attacking. The gates of Oblivion were closed, but the threat is far from over, and the enemy has evolved.\r\n\r\n- For those who are familiar with classic RPG\\'s like Fallout 1/2 and Final Fantasy 7/8/9 this is VERY similar to \\\"world random encounters\\\" where a battle can suddenly approach you out of nowhere when you are least expecting it (watch the linked video).\r\n\r\n- Also for the sake of convenience it is impossible for tears to spawn while the PC is inside any interior cell. Their are 3 types of tears that will always spawn, 2 of them will spawn creatures that are always HOSTILE and 1 of them will spawn NPC\\'s who are always FRIENDLY.\r\n\r\n- The creatures that emerge from these tears vary greatly in type and number, sometimes you will fight undead who carry sword and shield and at other times you will fight creatures made up of fire who explode when killed and hurl fireballs towards you. On rare occasions you may have to face these creatures in all they\\'re variety and strength all at once making the chances of survival even more perilous, variety and replayability is what makes this mod so enjoyable as well as challenging.\r\n\r\n- All creatures that are spawned by tears are easy to beat at first, however as the PC gains in level so shall they making them even more powerful and dangerous foes. All actors that are spawned by tears will eventually move on if not killed, they will NOT stick around in the world for very long at all (for balance and stability reasons).\r\n\r\n- Here is a list of the Actors that you will encounter:\r\n\r\nPALADINS OF CAELESTIS:\r\n\r\n* Grand Wolf - A creature bred and trained for close combat.\r\nHP = Low\r\nThreat Level = None\r\nMovement = Fast\r\n\r\n* Paladin - A noble warrior equipped with heavy armor as well as a sword and shield but has no spells. Paladins are always male.\r\nHP = Moderate/High\r\nThreat Level = None\r\nMovement = Mildy Slowed\r\n\r\n* Arc Angel - A highly disciplined warrior who possesses a variety of healing and fire spells. Arc Angels are always female.\r\nHP = High\r\nThreat Level = None\r\nMovement = Normal\r\n\r\n* Guardian - A being created of electricity and unstable energy designed to protect those it serves.\r\nHP = High/Very High\r\nThreat Level = None\r\nMovement = Slightly Increased\r\n\r\n* Living Saint - A celestial entity in the form of a ghostly female who possesses powerful abilities.\r\nHP = Extremely High\r\nThreat Level = None\r\nMovement = Slightly Increased\r\n\r\nSKYNET:\r\n\r\n* Spider - A mechanical spider-like creation designed for speed and quick assaults rather than head-on attacks.\r\nHP = Low\r\nThreat Level = Low/Moderate\r\nMovement = Extremely Fast\r\n\r\n* Drone - The foot soldier of the mechanical horde.\r\nHP = Moderate\r\nThreat Level = Moderate\r\nMovement = Very Fast\r\n\r\n* Ballista - Siege engine capable of firing arrows/bolts at very long range.\r\nHP = Low/Moderate\r\nThreat Level = High\r\nMovement = Mildly Slowed\r\n\r\n* Sentinel - Flying entities that are mostly mechanical in nature but also partially alive.\r\nHP = Moderate\r\nThreat Level = Moderate/High\r\nMovement = Very Fast\r\n\r\n* Dreadnought - A being that even though is completely mechanical in nature is possessed and energized by a soul of someone who was once human.\r\nHP = Extremely High\r\nThreat Level = Extreme\r\nMovement = Very Slow\r\n\r\nNECROMORPHS:\r\n\r\n* Infestor - An insectoid creature that although weak can infect others with a virus that causes damage over time. Victims of this virus who die become hunter killers which are extremely deadly (the PC, dragons and Essential actors are immune to this virus).\r\nHP = Low\r\nThreat Level = Moderate\r\nMovement = Normal\r\n\r\n* Dead Warrior - An undead warrior equipped with heavy armor carrying a sword and shield.\r\nHP = Moderate/High\r\nThreat Level = Moderate/High\r\nMovement = Normal\r\n\r\n* Fire Banshee - A creature made of fire that hurls fireballs at its enemies causing AoE fire damage.\r\nHP = Moderate\r\nThreat Level = High\r\nMovement = Fast\r\n\r\n* Chaos Bear - A massive hulking creature with incredible strength and dexterity.\r\nHP = Very High\r\nThreat Level = High\r\nMovement = Mildly Slowed\r\n\r\n* Heretic - An undead being infused with the abilities of a powerful necromancer.\r\nHP = Extremely High\r\nThreat Level = Extreme\r\nMovement = Mildly Slowed\r\n\r\n\r\n**********************************************************************\r\nPLANNED UPDATES\r\n*************************\r\n\r\n[Official] (these are changes I will definitely include as future updates)\r\n\r\n- None so far.\r\n\r\n[Feedback] (these are changes based on feedback which I may or may not include as updates)\r\n\r\n- Toggle options so players can set they\\'re own difficulty and even switch the mod on/off while in-game.\r\n\r\n\r\n**********************************************************************\r\nINSTALL/UNINSTALL\r\n***************************\r\n\r\n[Install]\r\n\r\nSimply copy all files of from the downloaded zip folder and paste them to your Skyrim application Data folder located in the Steam root directory.\r\n\r\n[Uninstall]\r\n\r\nTo uninstall this mod just delete all installed files which should be easy due to how I have organised them.\r\n\r\n\r\n**********************************************************************\r\nBUGS/FIXES\r\n****************\r\n\r\nNone at this time.\r\n\r\n\r\n**********************************************************************\r\nQ&A\r\n******\r\n\r\nHere is where you can find the answers to the most commonly asked questions (this also means that if these questions are asked in the comments section you will be directed to this page).\r\n\r\nQ: Does this mod use the PlaceAtMe() command? If it does that function can cause save game bloating, so why use it?\r\nA: This mod does indeed use the PlaceAtMe() command, however EVERYTHING that uses this command are set to be disabled and deleted at the appropriate time to prevent save game bloating and to keep the game stable.\r\n\r\nQ: Can this mod be installed automatically with lets say Nexus Mod Manager?\r\nA: I always MANUALLY install mods that I download and this rule reflects all mods that I publish.\r\n\r\n\r\n******************************************************************************************\r\nBEST COMMENTS WALL\r\n*********************************",
  "categoryId": "77",
  "version": "1.0",
  "author": "-KC",
  "createdUnix": "1373667480",
  "updatedUnix": "1373667480",
  "containsAdultContent": false,
  "uploadedBy": "Enix031798",
  "primaryFile": null,
  "files": []
}