{
  "modId": 38266.0,
  "modName": "CBM - Serana Enhanced",
  "summary": "One of the greatest and most immersing followers, Serana, has been enhanced with innovative new features and a deeper persona. Also includes weapon, spell and apparel customization. Toggle settings are included for your personal preferences.",
  "descriptionHtml": "STATUS:\r<br />\r<br />Receiving updates.\r<br />\r<br />If this mod receives 25+ endorsements a toggle option to choose whether Serana keeps her helmet equipped while in a city.\r<br />\r<br />If this mod receives 50+ endorsements I will add a new Need stat (temperature most likely).\r<br />\r<br />If this mod receives 100+ endorsements I will allow Serana to summon her own mount.\r<br />\r<br />\r<br />REQUIREMENTS: \r<br />\r<br />Skyrim official game.\r<br />Latest updates.\r<br />Dawnguard official DLC.\r<br />\r<br />\r<br />COMPATIBILITY:\r<br />\r<br />This mod will most likely have compatibility issues with any other mod that changes the Serana NPC or any Quests related to her.\r<br />\r<br />\r<br />CONTENT GUIDE:\r<br />\r<br />1. Mod Details\r<br />2. Planned Updates\r<br />3. Install/Uninstall\r<br />4. Bugs/Fixes\r<br />5. Q&A\r<br />6. Best Comments Wall\r<br />\r<br />\r<br />**********************************************************************\r<br />MOD DETAILS\r<br />******************\r<br />\r<br />- This mod is aimed at accomplishing one thing, making Serana a more immersing and enjoyable companion... not that she isn&#39;t already. Many say that even though she is one of the most in-depth and greatest potential followers in the game shes also one of the most annoying and occasionally the most moody, I do NOT aim to change any of that simply because as far as I am concerned that is all part of her vampire mystique and her unique personality. Here are the main features of this mod branching out from her dialogue which has been altered:\r<br />\r<br />NOTE: Many of these extra features are NOT available at the moment you first encounter Serana because she simply doesn&#39;t trust you yet, you first have to make some progress through the Dawnguard questline before most features added by this mod will become available and you have to make the right choices.\r<br />\r<br />&#34;Let me check your gear&#34; (allows you to change the equipment that Serana uses, if she is in a bad mood she will most likely NOT allow you to do this).\r<br />\r<br />&#34;I need to use your extra storage&#34; (allows you access to Serana&#39;s storage container which you can use at any time to deposit/withdraw any items without the hassle of worrying whether Serana will be using them herself).\r<br />\r<br />&#34;Wait right here please&#34; (orders Serana to stand guard until you return or until her mood gets too low, this option may not be available at all if Serana is in a bad mood to begin with).\r<br />\r<br />&#34;You can relax here for a while if you want&#34; (lets Serana know she can relax and wonder around in sandbox mode, this allows her mood to slowly increase over time).\r<br />\r<br />&#34;Regarding combat...&#34; (allows you to determine what type of weapons/spells Serana uses and how she reacts to you and/or her being attacked).\r<br />\r<br />* Use Melee & Shield (will only use one-handed weapons along with a shield).\r<br />* Use a Dual-Wield combination (will only use 2x one-handed weapons simultaneously).\r<br />* Use Two-handed weapons (will only use two-handed weapons).\r<br />* Use Ranged weapons (will only use bows and crossbows).\r<br />* Use Spells (will never use weapons and only use spells).\r<br />* Use any weapon or spell combination that you want (Serana will have no restrictions on the weapons or spells that she chooses to use).\r<br />* Attack all enemies within range (will attack all enemies that are within sight).\r<br />* Only attack those who attack first (will only attack enemies who attack the PC or herself first).\r<br />* Never attack under any circumstances (will never attack even if attacked).\r<br />\r<br />&#34;I have a favor to ask of you&#34; (Serana is now able to craft additional items that you may find very useful. Of course she requires certain materials from you first. The items that can be crafted are listed below).\r<br />\r<br />* Craft Torch (requires 1x linen & 1x firewood).\r<br />* Craft Blood Arrows (requires 1x vial of blood & 10x arrows).\r<br />\r<br />&#34;Can we talk about something?&#34; (Allows you to use other bonus features added by the mod, everything that can be done is listed just below).\r<br />\r<br />* Manage primary outfit (allows you to decide what armor/clothing Serana uses for her 1st outfit).\r<br />* Manage secondary outfit (allows you to decide what armor/clothing Serana uses for her 2nd outfit).\r<br />* Manage swimwear outfit (allows you to decide what armor/clothing Serana uses while swimming).\r<br />* Manage sleepwear outfit (allows you to decide what armor/clothing Serana uses while sleeping)\r<br />\r<br />&#34;We need to discuss some serious matters&#34; (settings/options for your various customizing needs regarding Serana).\r<br />\r<br />* Toggle Immortality (essential mode on OR off).\r<br />* Toggle Needs (realism mode on OR off).\r<br />* Toggle Swimwear (Serana automatically changes into swimwear when swimming on OR off).\r<br />* Toggle Sleepwear (Serana automatically changes into sleepwear when sleeping on OR off).\r<br />\r<br />- In addition to her dialogue changes other features have also been added:\r<br />\r<br />- Needs (Realism Mode) - Serana now has her own satiation, hydration, energy and mood stats. Over time these stats will decay and you will have to support her as any leader does for their comrades. Don&#39;t worry yourself too much though as she will not pester you every few minutes asking for your precious sweetrolls, all you will need to do is add the required items to her inventory and Serana will take care of herself. Failing to satisfy these Need stats will result in severe debuffs for Serana (health, magicka and stamina regen) and not to mention a bad mood which may lead to her no longer helping you. The Needs stats are as follows:\r<br />\r<br />* Satiation (hunger) - Serana needs to eat food regularly in order to survive just like any other living being. The more this stat decays the slower Serana&#39;s health regenerates. This stat will NOT apply unless Serana is cured of her vampirism.\r<br />\r<br />* Hydration (thirst) - Serana will occasionally consume Potions of Blood in order to satisfy her vampire thirst. The more this stat decays the slower Serana&#39;s stamina regenerates. If Serana is cured of her vampirism she will instead consume Alto Wine.\r<br />\r<br />* Energy - The more this stat decays the slower Serana&#39;s magicka regenerates. This stat is automatically satisfied by Serana herself (she will let you know when and will immediately go into sandbox mode).\r<br />\r<br />* Mood - Many actions you take including dialogue will influence Serana&#39;s mood. Her mood also determines whether certain dialogue options are available to you.\r<br />\r<br />- While the PC is in combat Serana will now sometimes help you out by supplying you with restoration potions, this feature however has requirements and must first be unlocked in-game before it can be used.\r<br />\r<br />- While out of combat Serana will now sometimes find gold and add it to her inventory, this however does NOT mean you can simply go into her inventory and take it from her, you naughty devil&#33; Serana will only part with her gold while she is in a good mood and has a close relationship with the PC. She will also sometimes find ingredients while outside in the wilderness which she doesn&#39;t mind you taking at any time.\r<br />\r<br />\r<br />**********************************************************************\r<br />PLANNED UPDATES\r<br />*************************\r<br />\r<br />[Official] (these are changes I will definitely include as future updates)\r<br />\r<br />- More quest content:\r<br />\r<br />SPOILER: For example Serana&#39;s blood is required for the ritual to block out the sun in Dawnguard so I could use that by making it so vampires seek her out for the purpose of extracting samples of her blood to sell to the highest bidder and/or to hand over to Serana&#39;s father. The same could be done with vampire hunters who want to kill Serana simply because she poses a huge threat to most living beings. Their are many possibilities in this regard and you as the PC would have to decide whether to help her or stand aside.\r<br />\r<br />[Feedback] (these are changes based on feedback which I may or may not include as updates)\r<br />\r<br />- None at this time.\r<br />\r<br />\r<br />**********************************************************************\r<br />INSTALL/UNINSTALL\r<br />***************************\r<br />\r<br />[Install]\r<br />\r<br />Simply copy all files of from the downloaded zip folder and paste them to your Skyrim application Data folder located in the Steam root directory.\r<br />\r<br />[Uninstall]\r<br />\r<br />To uninstall this mod just delete all installed files which should be easy due to how I have organized them.\r<br />\r<br />\r<br />**********************************************************************\r<br />BUGS/FIXES\r<br />****************\r<br />\r<br />None at this time.\r<br />\r<br />\r<br />**********************************************************************\r<br />Q&A\r<br />******\r<br />\r<br />Here is where you can find the answers to the most commonly asked questions (this also means that if these questions are asked in the comments section you will be directed to this page).\r<br />\r<br />Q: I have another mod that only changes Serana&#39;s appearance but this seems to not work properly while your mod is active, what&#39;s wrong?\r<br />A: I changed the Serana Actor in the CK and had no choice but to do so, this means that any other mod that also changes Serana will conflict with this mod. As for mods that only change Serana&#39;s cosmetic appearance its very possible to create an additional ESP plugin with all the changes made by both mods.\r<br />\r<br />Q: Serana keeps using her hood even though I told her not to, whats wrong?\r<br />A: This and other problems like it will occur simply because the changes made with this mod will NOT take full effect if you load a save file where Dawnguard is already active. If you start from a saved game file where Dawnguard is NOT active then this mod and ALL its changes will be in full effect when you activate Dawnguard AND this mod at the same time. This is a problem with the game and its hardcoded mechanics, not the mod itself.\r<br />\r<br />Q: I&#39;ve just met Serana and we have been together for some time but her Need stats are not changing at all and shes not using any of the usual items, whats wrong?\r<br />A: Talk to Serana and select the &#34;We need to discuss some serious matters&#34; option from the dialogue list and then from the settings menu select &#34;Toggle Needs&#34;. If Needs are now in effect the overlay number will show as 1 to let you know the feature is enabled. Also while Serana is currently not a follower Need stats will not decay at all.\r<br />\r<br />Q: Does this mod include bug fixes?\r<br />A: I always include fixes from other mods (if the author allows it) and add my own adjustments to correct problems or at least a &#34;work around&#34; for bugs that just can&#39;t be squished.\r<br />\r<br />Q: Can this mod be installed automatically with lets say Nexus Mod Manager?\r<br />A: I always MANUALLY install mods that I download and this rule reflects all mods that I publish.\r<br />\r<br />\r<br />******************************************************************************************\r<br />BEST COMMENTS WALL\r<br />*********************************\r<br />\r<br />A compilation of the best quotes of user comments.\r<br />\r<br />&#34;&#34;",
  "categoryId": "66",
  "version": "1.0",
  "author": "-KC",
  "createdUnix": "1373661819",
  "updatedUnix": "1373661819",
  "containsAdultContent": false,
  "uploadedBy": "Enix031798",
  "primaryFile": null,
  "files": []
}