{
  "modId": 38272.0,
  "modName": "The Boned Dagger By Sir Vincent",
  "summary": "The Dagger Of The Ancient Dragon ",
  "descriptionHtml": "A Mod That Will Add A Dagger Made Of Dragon Bones To The Game.\r\nIn The Misc Section.\r\n\r\nCopy Right\r\n\r\nThis Is A Mod Created By Me And Me Alone No One Else.\r\nAny Other User Claiming Ownership Is Jealous I Guess. \r\nIf Some-one Would Appear Claiming Ownership Just Take A Look At The File Date It Could Have Ended Up Every Where On The Internet By Now \r\n\r\nAs Far As I Know i Have Deleted Every copy Of My Files On The Web This Would Be The Only One Of Its Kind On This Website\r\n\r\n*Information Regarding The Dagger*\r\n\r\n\r\nAn Ancient Dagger Found In The Remains On Old Skeleton Inside Of A Dragon Carcass Located In A Hidden Cave In The Dark Forrest Surrounded By Baby Dragons ( I Know It Might Not Sound That Dangerous \\'Baby Dragons\\\" Believe Me They Are Just As Vicious As Those Full Grown Flying Lizards )\r\n\r\nThe Trip Inside The Cave Wasn\\'t As Difficult As I Would Have Thought it Was Just A Breeze Venturing Trough The Cave .\r\nAs The Time Flew By I Started Wondering.\r\n\r\nHow Long Could This Cave Be ?\r\nWhen Would I Reach The End ?\r\nWill I Even Reach The End ? \r\nWhy Am I Here?\r\nHow Did I End Up Here?\r\n\r\nWhen I Was Almost At An End Of My Questions A Bright Light Appeared In Front Of Me Shaped In The Form Of A Giant Lizard.\r\nit Spoke To Me In An Language Long Forgotten By The Mortal\\'s.\r\nI Couldn\\'t Decipher What Was Said To Me .\r\nThen All Of A Sudden The Light Dashed Away From Me I Ran After It With My Last Remaining Bit Of Energy .\r\n\r\nThe Spirit Brought Me To What Seemed To Be An Ancient Altar .\r\nI Looked At The Spirit It Looked At Me With A Childish Gaze Of His Face He Lifted His Arm Pointing To The Altar I Took A Closer Look On The Altar The Smouldering Remains Of A Dragon Carcass Appeared Out Of No-Where. \r\n\r\nI Started To Approach The Altar My Eye\\'s Fell On A  Skeleton Locked In Side Of The Rib Cage Of The Dragon\\'s Smouldering Carcass When I Was Finally Close Enough At The Skeleton I Started To Examine It I Found 2 Item\\'s One Of Them Being A Strange Looking Dagger The Other Item Appeared To Be A Book Containing  The Tale Of The Dagger.\r\n\r\nWhen I Started To Read The Book My Mind Was Filled With The Stories Involving  The Dagger I Learned The Real Name Of The Dagger It Was Called The \\\"Bone Slayer\\\"\r\n\r\n\r\nWanna Comment On The Mod?\r\nBut There Is No Comment Bar?\r\n\r\nToo Bad For You Then.\r\n\r\n*Small Note*\r\n\r\nI Wont Be Reading Private Message\\'s\r\n\r\nRegards \r\n\r\nSir Vincent\r\nThe Modding Royalist",
  "categoryId": "55",
  "version": "1",
  "author": "Sir Vincent",
  "createdUnix": "1373675166",
  "updatedUnix": "1373675129",
  "containsAdultContent": false,
  "uploadedBy": "SirVincent",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038624",
      "name": "Made By Sir Vincent The Royal Modder",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "280",
      "fileName": "Made By Sir Vincent The Royal Modder-38272-1.rar",
      "uploadedUnix": "1373675129",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/042e8e7561c7623ffb29b686b0243f617d64cdcacd1837ee53bc93b040f0ec8f/analysis/1407641286/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Made%20By%20Sir%20Vincent%20The%20Royal%20Modder-38272-1.rar?fid=1000038624&ttl=1535818511&ri=8192&rs=8192&setec=e0133305d4a0d9fc49aa60453087f08b"
    }
  ]
}