{
  "modId": 38295.0,
  "modName": "Old Mill English Version",
  "summary": "A player house with Auto-Sort and Auto Loot function\r\nUnique Meshes and Textures\r\nWorking Dragonclawstand and Drogonpriestmaskdisplay\r\na working Jukebox and lot more",
  "descriptionHtml": "Eine deutsche Version findet Ihr hier: http://skyrim.nexusmods.com/mods/38255/?\r\n\r\n[heading]Description[/heading]\r\nThis Mod adds a Player home to Riverwood which you can find on the other side of the River.\r\nI was always searching for a house to easily go to, drop my goods and go my way again.\r\nBut mostly it takes time to sort everything in the right containers and it turns into work dropping the items. Or you want to craft something and get said that you need tons of leather and Ingots, too. So you go again to your containers and take what you need.\r\n[color=yellow][b]This Procedure ends now.[/color][/b]\r\nThis House comes with an Auto-Sort and Auto-Loot System.\r\nThat means that whenever you activate a crafting station you will get the items in your inventory which are in your containers. After the work is done, everything will be packed back in the correct container.\r\nThe Auto-Sort System works with help of 2 container. Both of them are called \\\"Sortchest\\\". One directly at the entry of the house, and the other one at the exit of the house. Because of that it is even possible to drop your items without entering the house. \r\nWhatever you will place in the Sortchest will be sorted in the right category. Things that doesn´t have a category ends in the Misc container. All containers are Non-Respawn container except the Waste Container near the entry. This container will loose its items every third day. This is for the items you picked accidently.\r\n\r\nFollowing Categories exist.\r\n- Heavy Armor \r\n- Light Armor\r\n- Clothing\r\n- Weapons, including Staffs and bows\r\n- Arrows, including Dawnguard Bolts \r\n- Jewelry\r\n- Gems\r\n- Books\r\n- Scrolls\r\n- Raw Food \r\n- Cooked Food \r\n- Poisons\r\n- Potions \r\n- Ingredients\r\n- Soul Gems\r\n- Keys \r\n- Ore, including dwemer scrap\r\n- Leather, including animal hides and leather stripes\r\n- Ingots\r\n- Gold coins\r\n- Misc items\r\n\r\nYou will find in and outside of the house all Containers so that you can take your items if you want to. The chests doesn´t look like the Chests in Skyrim. So take a look everywhere. :-)\r\nOnly Items from Skyrim get sorted properly. Things from other DLC´s end in the misc container. \r\nThe next version will be a version with DLC´s included.\r\nThere is a jukebox on the first floor which works but you have to do something before.\r\n\r\n1. open following folder:\r\nC:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\music\r\nOnce you opened the folder, create a new one called \\\"zzzmyhouse\\\"\r\n\r\n2. search for three of your favourite songs\r\nI preferthe songs from Maluka. They fit the Atmosphere and sound great \r\nhttp://malukah.com/free\r\n\r\n3. Convert the .mp3 files in .wmv files.  You can find tons of tools that are useful for that.\r\nOnce the files are converted you need to rename them in   01.wav  ,  02.wav  ,  03.wav.\r\n\r\n4. Place all three files here.\r\nC:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\music\\\\zzzmyhouse\r\n\r\nThe Jukebox is functional now and plays your music.\r\n\r\nFollowers will follow you in the house and use the things in and outside the house.\r\n\r\nA Place for your Dragonclaws and your Dragonpriestmasks can be found on the second floor.\r\n\r\nI am working on a quest and a key and so on but i need a little bit more time with that.\r\nComments are welcome. Good or bad --> tell me what you think. \r\nAnd if you like, endorse.  :-))\r\n\r\n\r\n[heading]Installation[/heading]\r\nIf somebody doesn´t know. Ask me.\r\n\r\n[heading]Bugs / Conflicts[/heading]\r\nWalking the Steps is a little bit tricky. I am Sorry for that but i can´t change it.\r\n\r\nConflicts are possible with mods which use the same location.\r\n\r\n[heading]Credits[/heading]\r\nMy biggest thank you to all the genius people who upload such great ressources, so that a modder like me can work with it. \r\nSpecial thanks to:\r\n\r\nBlary - OpenBookRessource http://skyrim.nexusmods.com/mods/14134//?\r\nAriont50 - Arie Manor Furniture http://skyrim.nexusmods.com/mods/18566//?\r\nDarkRider - Celtic Decor for Skyrim I http://skyrim.nexusmods.com/mods/12394//?\r\nInsanity - WallCharts http://tesalliance.org/forums/index.php?/files/file/1473-insanitys-wall-charts/\r\nand lot more Stuff from Insanity\r\nLilith - Catering  http://tesalliance.org/forums/index.php?/files/file/1264-catering-by-lilith/\r\nOaristys´ Modders Ressource Pack  http://skyrim.nexusmods.com/mods/16525/?\r\nTamira  -  Strotis Outdoor Toilet Ressource  http://skyrim.nexusmods.com/mods/32056//?\r\n              Strotis Old Mill Ressource  http://skyrim.nexusmods.com/mods/37176//?\r\nand a lot more Stuff from Tamira\r\nModders Resource - Auto sorting and auto looting when crafting by Sjogga\r\nUniversal Item Display Script (Weapons, Shields, Potions etc)\r\n\r\nI hope i didn´t forget anybody",
  "categoryId": "67",
  "version": "1.0",
  "author": "KuhlServ",
  "createdUnix": "1373726484",
  "updatedUnix": "1373726476",
  "containsAdultContent": false,
  "uploadedBy": "kuhlserv",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038735",
      "name": "Old Mill ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "93173",
      "fileName": "Old Mill -38295-1-0.rar",
      "uploadedUnix": "1373726476",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7c74c842f315f33a28d4139c6134cfae03e5a08ad917e5a125b9000357fbd48c/analysis/1407642147/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Old%20Mill%20-38295-1-0.rar?fid=1000038735&ttl=1535818544&ri=8192&rs=8192&setec=c783ead202ccdf459f3386da3151b450"
    }
  ]
}