{
  "modId": 38309.0,
  "modName": "Parousia - Player Home",
  "summary": "A house located east of Whiterun, nearby Darkshade. Features auto-sort.",
  "descriptionHtml": "This is the first thing I\\'ve ever attempted to do using the Creation Kit. I wanted a cozy semi-realistic home that also allowed for convenience. It\\'s the same size on the inside as it is on the outside, it isn\\'t extravagant or fancy, and it isn\\'t cramped or difficult to navigate. \r\n\r\nIt includes an enchanting table, an alchemy table, a forge/smelter/tanning rack, various ingredients, and a non-respawning dead thing. \r\nAll containers are connected to the autosort mechanism, except for the extra ingredient/soul gem containers (although there are still the primary containers), extra wardrobes, and the daedric artifact/artifact containers (as well as the non-respawning dead thing).\r\n\r\nThe bag titled \\\\\\\"The Goods\\\\\\\" is the primary sorting mechanism. Dump your items and they should be sorted automatically. All other containers will still sort if the items you place don\\\\\\'t belong there; however, it may not work the best.\r\n\r\n- Problems -\r\nThe navmesh is a disaster.\r\nI may get around to fixing it, but...\r\nAlso, had originally intended this to have a quest and potential follower. I also intended this to be a lumber mill. Sometimes, stuff just doesn\\'t happen.\r\nWith that said, despite this being my first attempt at messing with the creation kit, it may just be my last. All in all, I just wanted to submit something towards a game that I\\'ve enjoyed. \r\n\r\nCredit:\r\nAutosort scripts and tutorial: Modders Resource - Auto sorting and auto looting when crafting - by Sjogga",
  "categoryId": "67",
  "version": "",
  "author": "Zathrael",
  "createdUnix": "1373745509",
  "updatedUnix": "1373745177",
  "containsAdultContent": false,
  "uploadedBy": "Zathrael",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038770",
      "name": "Parousia-PlayerHome",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "201",
      "fileName": "Paousia-PlayerHome-38309-.zip",
      "uploadedUnix": "1373745177",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/331873042631befe5968f02afbc68fe7e4cbb414442bed68ed3e377b2a411635/analysis/1407642401/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paousia-PlayerHome-38309-.zip?fid=1000038770&ttl=1535818566&ri=8192&rs=8192&setec=62d708264700177f54f84dc70b61ba38"
    }
  ]
}