{
  "modId": 38306.0,
  "modName": "Dragon Point Manor - Expansion",
  "summary": "Beautiful two story stone manor located just east of Solitude Sawmill. Quiet, secluded location with splendid views of the harbour and Blue Palace.  Custom interactive display storage and furniture throughout.  Features all crafting amenities.  Expansion Includes additional interactive displays.",
  "descriptionHtml": "Dragon Point Manor Expansion - still requires all DLC\r\n\r\nAdds display places for Daedric artifacts, Honorary Thane Weapons and Dragonborn Claws and Masks.  Also adds some much \r\n\r\nneeded storage by the forge and a few more containers in the armoury.\r\n\r\nThis upgrade includes a bug fix for the mask wall and a few requested additions. There is now an open bookcase in the \r\n\r\nlibrary to display books.  The previous bookcase has been moved to the bottom of the stairs leading to the attic. \r\n\r\nThe armoury has been slightly enlarged and now includes display areas for the honorary hold weapons.  There were a \r\n\r\ncouple of containers added and pre-existing containers may have been moved, but not deleted or replaced.  Contents \r\n\r\nshould be safe.  \r\n\r\nThere is an additional room for the Daedric quest items.  Several of them are weapons, so the display is a standard \r\n\r\nweapon rack.  Time to test your Daedric artifact knowledge. :)  There are item specific storage displays for things that \r\n\r\nwere not weapons.  There is also space for both in the event there is a choice of reward items.  If you want to complete \r\n\r\nyour collection, here are the codes for all Daedric artifacts:\r\n\r\nArtifact\t\tCode\t\r\nMasque of Clavicus Vile\t000d2846\t\r\nThe Rueful Axe\t0001c4e6\r\nSanguine Rose\t0001cb36\t\t\r\nEbony Mail\t\t00052794\t\t\r\nSkeleton Key\t0003a070\t\t\r\nOghma Infinium\t0001A332\t\t\r\nSavior\\'s Hide\t0002ac61\t\r\nRing of Hircine\t0002ac60\r\nMehrune\\'s Razor\t000240d2\t\t\r\nAzura\\'s Star\t\t00063b27\t\r\nThe Black Star\t00063b29\r\nDawnbreaker\t0004e4ee\t\t\r\nVolendrung\t\t0002acd2\t\t\r\nMace of Molag Bal\t000233e3\t\t\r\nWabbajack\t\t0002ac6f\t\t\r\nSpellbreaker\t00045f96\t\t\r\nRing of Namira\t0002c37b\t\t\r\nEbony Blade\t0004a38f\t\t\r\nSkull of Coruption\t00035066\t\t\r\n\r\nFor those of us who might need the hint, to use the codes, open a command prompt using the tilde key (~) usually beside \r\n\r\nthe 1 key.  Type in the following and press enter.  Use the tilde to exit the command prompt.\r\n\r\nplayer.additem ###### 1\r\n\r\nSome meshes have been cleaned and optimized.  Should help with the load.  \r\n\r\nPlease endorse if you like it.  It encourages me to move forward with additional content.\r\n\r\n***************************** \r\nOriginal Listing\r\n\r\nBeautiful two story stone manor located just east of Solitude Sawmill. Quiet, secluded location with splendid views of the harbour and Blue Palace.  Custom interactive display storage and furniture throughout.  Features all crafting amenities.\r\n\r\nNotes and Features:\r\n\r\nThis does require all DLC.\r\n\r\nCustom book shelves for journals and smaller size books.  \r\n\r\nCold storage for meats and dairy.  Check everything.  Things like crates and desks that are not normally storage containers have  been made so.\r\n\r\nCeller with additional food storage and Enchanting workbenches.\r\n\r\nLibrary, dining room, three bedrooms with custom furnishings throughout.\r\n\r\nAttic with alchemy workbench.  (If you don\\'t want to steal the Golden Claw back from Lucan to complete your display plaques, there is one hidden in the corner with the artifacts.)\r\n\r\nQuick acccess to the Armoury from the north side of the house lets you drop off things without having to go through the house.  The door is under the patio and behind the stable.  Includes 7 mannequins and several storage containers, as well as some raw materials.\r\n\r\nOpen air forge with smelter and workbenches.\r\n\r\nAdd the Spouses Can Live Everywhere mod (http://skyrim.nexusmods.com/mods/11370) to use this as a base home.  Thank you to Amgepo and Emma who created this. \r\n\r\nChayification made a really cool video.  Check it out http://www.youtube.com/watch?v=sf0_Lp3hZzo &feature=youtu.be\r\n\r\nSpecial note:  if you are using body replacement mods, it will impact Sheogorath and Sanguine.  One person actually had them show up wearing only their underwear!\r\n\r\nPlease remember to endorse if you like it.",
  "categoryId": "67",
  "version": "2.1",
  "author": "Psylvermon",
  "createdUnix": "1373745319",
  "updatedUnix": "1378938613",
  "containsAdultContent": false,
  "uploadedBy": "psylvermom",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000054344",
      "name": "Dragon Point Manor - Expansion - Texture Reload",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14324",
      "fileName": "Dragon Point Manor - Expansion - Texture Reload-38306-2-1.zip",
      "uploadedUnix": "1378938613",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/49ebcba532621cb267519992ca755f499f7335293368eb05a87178c4ba5b9fc1/analysis/1407719832/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Point%20Manor%20-%20Expansion%20-%20Texture%20Reload-38306-2-1.zip?fid=1000054344&ttl=1535818563&ri=8192&rs=8192&setec=092770ad92fe41c49fa09c2c46f58892"
    }
  ]
}