{
  "modId": 38315.0,
  "modName": "Scholarly Adventures - Gelehrte Abenteuer DV",
  "summary": "Deutsche Übersetzung der Abenteuer-, Rätsel - und Schatzsuchermod von wetwire",
  "descriptionHtml": "Scholarly Adventures - Gelehrte Abenteuer\r\n\r\nOriginal von wetwire:\r\nhttp://skyrim.nexusmods.com/mods/38000\r\nDV von Stefanu\r\n\r\nDie Gelehrten Abenteuer wurden erweitert. Die neueste Version zum Download, welche die alte Version, die wir kennen und lieben gelernt haben, aktualisiert, indem sie drei weitere einzigartige Abenteuer hinzufügt.\r\n\r\nDen Schriften eines einsamen Gelehrten folgend, taucht das Drachenblut in eine Sammlung von Büchern ein und muss seinen/ihren Verstand anstrengen, um aus Überlieferungen und vergessenen Legenden die Hinweise zu sammeln, die zu großem Reichtum, Relikten und Wissen führen. \r\n\r\nAbgelegen im fernen Nordosten der Küste Himmelsrands hatte ein Gelehrter namens Alaves Ravel damit begonnen, alte Mythen und Geschichten zu sammeln und zu ordnen. Diese Bücher scheinen nur Überlieferungen zu enthalten, aber nach näherer Betrachtung und mit etwas Schlauheit kann man damit anfangen, die Hinweise zu entschlüsseln, die zu großen Schätzen führen. \r\nMach dich auf in ein Abenteuer, bei dem du staubige Grüfte erforschst. Löse Rätsel, die in den Buchseiten verborgen liegen und überprüfe deine Hypothesen in den Weiten Himmelsrands. Du deckst Geheimnisse auf und findest verlorene Schätze. Man wird sehen, ob das Drachenblut das Zeug dazu hat, ein gelehrter Abenteuer zu sein.  \r\n\r\n1. Dies Mod benötigt lediglich Skyrim, keine DLCs nötig. \r\n2. AKTUALISIERT: Im Moment sind sechs einzelne Abenteuer fertiggestellt.\r\n3. Es wird das übliche Questsystem nicht benutzt, keine Wegmarker und kein Händchenhalten. Du bekommst das Gefühl, wirklich etwas erreicht zu haben, wenn du die Hinweise entschlüsselst.\r\n4. Alaves Ravels Heim, wo alle Abenteuer beginnen, befindet sich nordöstlich von Windhelm nahe der Küste. Auf den Bildern sieht man einen dementsprechenden Screenshot.\r\n5. AKTUALISIERT: Ein neuer Ort zu meistern, der auf geschichtliche Daten des Elder Scroll-Spiels \\\"Shadowkey\\\"basiert. http://www.uesp.net/wiki/Shadowkey:Shadowkey\r\n6.AKTUALISIERT: Die letzte Version wurde durch den TES5EDIT gejact, um eineige \\\"dirty edits\\\" zu bereinigen. Danke, Karios525.\r\n7. Gelehrte Anmerkung: Andere Mods benutzen, die die Schwierigkeit erhöhen, so wie Wetter/Überlebens-Mods oder Hunger/Durst-Bedürfnisse werden diese Mod \\\"intensiver\\\" machen. Ich persönlich empfehle, welche auszuprobieren, während man ein Gelehrter Abenteurer ist. \r\n\r\n\r\nIch danke wetwire für die Erlaubnis und seine geduldige Beantwortung einiger für die Übersetzung wichtiger Fragen!\r\n\r\nPROBLEMBEHANDLUNG\r\n1: Wenn einem etwas falsch erschient, wie etwa Türen und Tore, die sich nicht öffnen, aktivierbare Gegenstände, aber nichts passiert: Der Mod fehlen wahrscheinlich Scripts. \r\n- v0.3 hatte dieses Problem, ein Update wurde geliefert, das die script directory und funktionierenden custom scripts zu einem Upload mit der originalen v0.3 beinhaltet.\r\n- Man kann dies in Alaves Ravels Heim testen. Dort gibt es ein Modellschiff mit einem Aktivierungsskript, der einen einfachen Dialog liefert. Wenn das nicht funktioniert, holt Euch das Update. (Anm. des Übersetzers: In der vorliegenden Form habe ich das Update bereits eingeschlossen, wird also nicht benötigt.)",
  "categoryId": "35",
  "version": "0.3",
  "author": "wetwire      DV von Stefanu",
  "createdUnix": "1373753897",
  "updatedUnix": "1378065024",
  "containsAdultContent": false,
  "uploadedBy": "Stefanu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038800",
      "name": "Scholarly Adventures - Gelehrte Abenteuer DV",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "286",
      "fileName": "Scholarly Adventures - Gelehrte Abenteuer DV-38315-0-2.7z",
      "uploadedUnix": "1373753892",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/3d957b9d476f42fefd859a65538ff6d19c87bdaa6c7de17f06bba5ee6709d120/analysis/1407642666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scholarly%20Adventures%20-%20Gelehrte%20Abenteuer%20DV-38315-0-2.7z?fid=1000038800&ttl=1535818576&ri=8192&rs=8192&setec=4e89ea4603a2b9ea1e9bc3ab928c3403"
    },
    {
      "fileId": "1000051518",
      "name": "Scholarly Adventures - Gelehrte Abenteuer DV 0-3",
      "version": "0.3",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "17297",
      "fileName": "Scholarla Adventures - Gelehrte Abenteuer DV 0-3-38315-0-3.7z",
      "uploadedUnix": "1378065024",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/07388b63e4f85ce3cf2fc27e3baf32bf683e37b02a0e8c9b968caa99d92a2b7d/analysis/1407705328/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scholarla%20Adventures%20-%20Gelehrte%20Abenteuer%20DV%200-3-38315-0-3.7z?fid=1000051518&ttl=1535818577&ri=8192&rs=8192&setec=93a8892251c62cfc1ea31181b006826b"
    }
  ]
}