{
  "modId": 38329.0,
  "modName": "Timing is Everything - Quest Timing Control - Kryptopyr - Le moment choisi fait tout",
  "summary": "Ceci est la traduction francaise de [url=http://skyrim.nexusmods.com/mods/38151//?]Timing is everything - Quest time control[/url].\r<br />This is the french translation of [url=http://skyrim.nexusmods.com/mods/38151//?]Timing is everything - Quest time control[/url].",
  "descriptionHtml": "Ceci est la traduction francaise de [url=http://skyrim.nexusmods.com/mods/38151//?]Timing is everything - Quest time control[/url].\r<br />This is the french translation of [url=http://skyrim.nexusmods.com/mods/38151//?]Timing is everything - Quest time control[/url].\r<br />\r<br />Si son travail vous plait, allez lui donner un petit &#34;Endorsement&#34; pour l&#39;encourager à continuer.\r<br />\r<br />\r<br />[u][color=#FFFF00]Description :[/color][/u]\r<br />\r<br />Ce mod vous permet de personnaliser les conditions de départ pour diverses quêtes. Vous pouvez choisir de retarder une quête à plus tard ou la faire commencer plus tôt que normalement.\r<br />\r<br />[b][color=#FF0000]** Nécessite SkyUI, Dawnguard, Hearthfire, Dragonborn, SkyUI. **[/color][/b]\r<br />Non, Kryptopyr n&#39;a pas l&#39;intention de faire une version vanilla ou une version supportant seulement un ou deux des DLC. La fonction principale de ce mod est d&#39;ajuster les exigences de base pour l&#39;initialisation des quêtes qui ne se déclenche qu&#39;une fois que le joueur a atteint un certain niveau. Cela sert à plusieurs titres. Par exemple, vous pourriez vouloir retarder le début de Dragonborn ou de Dawnguard à plus tard dans le jeu, peut-être trouvez-vous bizarre le fait de recevoir une lettre d&#39;un Jarl parlant de vos exploits en Bordeciel alors que votre personnage n&#39;a pas encore accompli de hauts faits.\r<br />\r<br />- Retardez le début de Dragonborn. Choisissez parmi 9 points de départs différents pendant la quête principale ou sélectionnez un &#34;moment inconnu&#34; pour avoir un début aléaroire. Vous pouvez également déterminer un niveau requis minimum qui doit être satisfait en plus du moment choisi pour la quête principale.\r<br />\r<br />- * Retardez le début de Dawnguard. Arrêter les attaques de vampires aléatoires qui déciment la population ou laissez la crise s&#39;abattre en augmentant l&#39;écart entre le niveau à partir duquel les attaques de vampires commencent et le début du recrutement par la garde de l&#39;aube.\r<br />\r<br />- * Retardez le début d&#39;Hearthfire jusqu&#39;à ce que vous ayez réellement accompli quelque chose digne d&#39;être reconnu par les Jarls ou qui permet d&#39;acheter des terres dans le Clos plus rapidement en diminuant les exigences de niveau pour la quête &#34;Tuez le Géant&#34;.\r<br />\r<br />- * Diminution de la fréquence des rencontres aléatoires avec les dragons. Modifiez le nombre de jours entre les attaques et / ou modifier la chance en pourcentage qu&#39;ils vont se produire.\r<br />\r<br />- * Retarder le début de la plupart des quêtes daedrique ou choisissez de les faire plus tôt.\r<br />\r<br />Soyez avertis qu&#39;une fois qu&#39;une quête a été déclenchée, changer les réglages ne l&#39;arrêtera pas. Vous devez faire les modification avant le début de la quête. Il y a quelques exceptions où les valeurs ont encore une certaine utilité, même après qu&#39;une quête ait été déclenchée. C&#39;est le cas avec les attaques de vampire de Dawnguard. Même si vous avez déjà commencé la quête, vous pouvez arrêter les nouvelles attaques en définissant cette valeur à quelque chose de supérieur à votre niveau actuel. Toutefois Kryptopyr a aussi inclus les paramètres pour ajuster la fréquence des attaques de vampires aléatoires, qui peuvent également être utilisés pour prévenir de nouvelles attaques.\r<br />\r<br />[u][color=#FFFF00]Installation:[/color][/u]\r<br />\r<br />Copier le dossier &#34;Data&#34; du mod là où votre jeu est installé (là où vous avez mis Steam).\r<br />Soit: ...SteamSteamAppscommonskyrim.\r<br />Activer les plugins via le mod manager.\r<br />\r<br />Je vous conseille d&#39;utiliser Nexus Mod Manager pour faciliter l&#39;installation/désinstallation des mods.\r<br />Un tutoriel entièrement en français est disponible ici: \r<br />http://www.confrerie-des-traducteurs.fr/forum/viewtopic.php?f=183&t=10216\r<br />\r<br />\r<br />[u][color=#FFFF00]Désinstallation:[/color][/u]\r<br />\r<br />1. Désactiver le mod dans le mod manager.\r<br />2. Supprimer manuellement les fichiers dans data.\r<br />3. Votre mod est bien désinstallé.\r<br />\r<br />\r<br />[u][color=#FFFF00]Remerciements:[/color][/u]\r<br />\r<br />Merci à Kryptopyr pour ce mod ainsi que pour son autorisation à le traduire.\r<br />Merci à Bethesda pour ce jeu ainsi que l&#39;univers &#34;The Elder Scrolls&#34;.\r<br />Merci à Epervier666 pour son logiciel de traduction Esp/Esm translation\r<br />Merci à McGuffin pour son logiciel de traduction TESVTTranslator.\r<br />\r<br />\r<br />[u][color=#FFFF00]La Confrérie des Traducteurs:[/color][/u]\r<br />Site Skyrim: http://www.confrerie-des-traducteurs.fr/skyrim/index.php\r<br />Forum: http://www.confrerie-des-traducteurs.fr/forum/index.php",
  "categoryId": "24",
  "version": "1.1",
  "author": "Kryptopyr",
  "createdUnix": "1373781319",
  "updatedUnix": "1373781174",
  "containsAdultContent": false,
  "uploadedBy": "bombeyte",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038844",
      "name": "Le moment fait tout",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4826",
      "fileName": "Le moment fait tout-38329-1-1.7z",
      "uploadedUnix": "1373781174",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c055bc2e77b60928893db35061696a4e94d617d369967066423c18808aa03b4d/analysis/1407643056/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Le%20moment%20fait%20tout-38329-1-1.7z?fid=1000038844&ttl=1535818602&ri=8192&rs=8192&setec=7a96074fc0d08a4fbc63b1b9e84b168d"
    }
  ]
}