{
  "modId": 38338.0,
  "modName": "Zenona - The High Elf Vampire Witch",
  "summary": "I made this save game after my exams, roughly 1 month ago, I really enjoyed playing as this character so I thought I\\'d share it with you guys.",
  "descriptionHtml": "I\\'ve started this game as soon as I finished my exams, it\\'s been about a month, and I\\'ve made it a really powerful character that any difficulty below legendary makes it too easy. And if you want to play it, please choose Master difficulty as least, anything below and it\\'s basically a walk in the park.\r\n\r\nStats: \r\nRace: High Elf.\r\nGender: Female.\r\nName: Zenona (just a random high elf name)\r\nProgress: Main quest, College of Winterhold, Dark Brotherhood, Thieves Guild, Civil War, Dragonborn and Dawnguard complete. Accepted into the bards college, but have not started the Companions, didn\\'t feel like signing up for them as a witch. Thane in 8 holds (except Winterhold), all houses purchased, all lands purchased and manors built and furnished.\r\nCivil War side: Imperials (long live the Empire!)\r\nDawnguard side: Vampires (obviously).\r\nMarital Status: Married, to Marcurio of Riften, with 2 adopted children.\r\nSkills:\r\nLevel: 59\r\nDestruction, Illusion, Enchanting, Restoration at 100, Alteration at 100 (legendary), Conjuration at 92, most perks of all schools of magic and Enchanting taken, Speech, Lock-picking, Sneak and Smiting are above 70 (been making a lot of nails :D), Alchemy is 57-8 something, but none have any perks. Also, forgot to mention, all Vampire Lord perks are taken.\r\n\r\nMods used: I add this because not having some of the mods may cause incompatibility, and lack of some of the mods will prevent you from enjoying this save.\r\n\r\nUnofficial Skyrim Patch: Why don\\'t you have it? :O\r\nHelgen Reborn: Completed, you may need this to play. \r\nConvenient Horses: Not sure if it will cause incompatibility, but use it, it\\'s awesome.\r\nMy home is your home: Marcurio, who is in the Blades, was refusing to move into my house, so I fixed it with this mod.\r\nRealistic Needs and Diseases: Not sure if it will cause incompatibility.\r\nFrostfall: Same as above.\r\nBetter Archmage\\'s Robes: Will probably not cause incompatibility, but I don\\'t think this save will be as fun without it.\r\nEnchanting Freedom: One of the downsides of playing as a pure mage, is that you\\'ll always run out of Magicka. Even if you\\'re a High Elf. so I used this mod to enchant ALL my equipment to add Magicka and Magicka Regen. Without it, you\\'ll probably have to look at more powerful enemies with a poker-face on while waiting for your small pool of Magicka to be regenerated, and most probably die.\r\nClimates Of Tamriel: Not sure if it will cause incompatibility.\r\nMods to achieve this current look:\r\nFace Masks of Skyrim - Cloaks of Skyrim - Frostfall (backpack), Archmage of Winterhold robes retexture, and Left Hand Rings, and Better Fitting Gloves, if you don\\'t want them to clip out of your robes.\r\n\r\nI also have another save game, my first ever play-through, an Imperial Thief, so tell me if you want that one as well. ",
  "categoryId": "43",
  "version": "1",
  "author": "m1l4droid",
  "createdUnix": "1373810599",
  "updatedUnix": "1373810532",
  "containsAdultContent": false,
  "uploadedBy": "m1l4droid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038896",
      "name": "Zenona - Proudspire Manor",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5878",
      "fileName": "Zenona - Proudspire Manor-38338-1.rar",
      "uploadedUnix": "1373810532",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8defc8d98e4b884c30d59a4bae09c84c7bb9ccc74a15558dfac6b6fe3db23c97/analysis/1407643408/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Zenona%20-%20Proudspire%20Manor-38338-1.rar?fid=1000038896&ttl=1535818616&ri=8192&rs=8192&setec=f5f7a12217d702513374c4183cc66ac8"
    }
  ]
}