{
  "modId": 38337.0,
  "modName": "Good Start for Mages Savegame - Dunmer lvl 1 EN-DV",
  "summary": "I Played the Main questline till after the Greybeards accept me as Dovahkiin. I was bored to do this for every Character again Made with german Version and without any Mods.",
  "descriptionHtml": "Hello to all.\r\n\r\nFirst, i am german and have made this Savegame with the german Game-Version. The discription is in english and german. For german scroll down. It should work for any other Languageversion too, but i can\\\\\\'t make a discription in so many languages.\r\n\r\nEnglish:\r\nI was bored about the fact, that every new made Character have to do the first Main Quests ever and ever again. So i thought about the point, from where i want to start in the Game with a new character. I think, the perfect point is after the Greybeards received the horn and we become official Dovahkiin. \r\nI played just the main questline till i reach this point. Directly after this, i left High Hrothgar and went to Whiterun to save. \r\nIt is just to save some hours of playtime. You can start directly with whatever you want...\r\nDo mainquest, become a mage or a thief, go and make civil war for your prefered side. \r\nREALLY ALL IS OPEN, there is just a little boost for destruction...and Stuff to keep or sell it.\r\n\r\nHere some facts about this save:\r\n- Just the poor Skyrim was used, no DLCs no ESPs, nothing, so there should be no loadingfailures in any other game.\r\n- I went with Ralof out of Helgen, cause then i can kill the imperial bitch, which send me reasonless in death...\r\n- The charakter is a basic male Dunmer and still level 1. so you can use \\\\\\\"showracemenu\\\\\\\" and change race and all other things. In my Game on second PC it works perfect. So make a female Orc or whatever you want. Its all up to your choice.\r\n- If you open Skillmenu, you will levelup, so do it after recreating the character.\r\n- this save is good for mages, cause destruction is nearly 35. Or grab a weapon and make a worrior.\r\n- Lydia and Meeko are already nearby the player. Travel with them, or send them away, your choice.\r\n- No eaten foods, no eaten incredientses, no crafted armor, no crafted or drunk potions, no bought spells, no dis/entchanting (important for archive that)\r\n- I have to use the console to higher the carryweight. In short, i have cheaten a bit. So the character has a full bag of things to sell. Some complete Sets of light armors, heavy armors, food, potions, scrolls, a lot rubbish and many more. It should be enough to buy Breezehome after selling the unneeded stuff.\r\n\r\nSo have Fun with this savegame and next time there will come some BAT Cheats for ingame console.\r\n\r\nGerman:\r\nEs nervte mich für jeden neuen Charakter immer wieder die ersten Hauptquests zu machen. Ich dachte drüber nach, welches wohl der beste punkt wäre, ins Spiel einzusteigen. Für mich ist es nachdem die Graubärte mich zum Dovahkiin ernannt haben. Also habe ich bis zu diesem Punkt gespielt, und bin danach nur noch nach Weißlauf runter, um zu speichern.\r\nDieses Savegame soll einfach nur ein paar Stunden Spielzeit sparen. Man kann sofort loslegen, mit was auch immer man machen will. Weiter in der Hauptquest, oder werde Magier oder Dieb, mach den Bürgerkrieg für Deine favorisierte Seite, \r\nWIRKLICH, ES IST NOCH ALLES OFFEN! Zerstörung ist halt schon auf knapp 35, und man hat schon eine menge startkapital, falls man die ganzen Sachen verkauft.\r\n\r\nHier einige Fakten des Savegames:\r\n- Nur das Grundspiel war aktiv, keine DLCs, keine Mods, alles nur damit es keine probleme in anderen Spielen gibt.\r\n- Ich bin mit Ralof aus Helgen gegangen, damit ich die kaiserliche Schlampe erschlagen kann, die mich grundlos in den Tod geschickt hat.\r\n- Der Charakter ist ein Männlicher basic Dunmer, und noch lvl 1. Daher könnt ihr mit \\\\\\\"showracemenu\\\\\\\" alles überarbeiten. Bei mir funktioniert es perfekt. Also macht ruhig einen weiblichen Ork oder was auch immer. Ist Eure Entscheidung.\r\n- Öffnet das Skillmenu und es kommt ein Levelup, aber erst, nachdem ihr den Char umgestaltet habt.\r\n- Dieser Savegame ist gut für Magier, da Zerstörung schon auf ca 35 ist. Oder greift eine Waffe und macht einen Kämpfer.\r\n- Lydia und Meeko sind schon beim Spieler. Behalte sie, oder schicke sie weg.\r\n- Kein Essen oder Zutaten verzehrt, keine Rüstung / Tränke erstellt oder getrunken, keine Zauber gekauft, nichts ent/verzaubert (wichtig für Archive That)\r\n- Ich musste ein bisschen cheaten mit der Console, um die Traglast zu erhöhen. Dafür hat der Charakter nun einen vollen Beutel. komplette leichte Rüstungen, schwere Rüstungen, Essen, Tränke, Schriftrollen, ein bisschen Ramsch. Es sollte beim Verkauf genug rausspringen, dass man Briesenheim kaufen kann.\r\n\r\nDann habt viel Spaß mit dem Savegame und demnächst kommen ein paar BAT Cheats für die ingame-Console. ",
  "categoryId": "43",
  "version": "1",
  "author": "alucard_hh",
  "createdUnix": "1373807277",
  "updatedUnix": "1373807264",
  "containsAdultContent": false,
  "uploadedBy": "Alucard_hh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038890",
      "name": "Good Start for Mages and others",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1598",
      "fileName": "Good Start for Mages and others-38337-1.rar",
      "uploadedUnix": "1373807264",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/57d5171078465b79749c3bd824c23a06624e941159abb3c2b414d4238ec40999/analysis/1407643356/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Good%20Start%20for%20Mages%20and%20others-38337-1.rar?fid=1000038890&ttl=1535818615&ri=8192&rs=8192&setec=104cd71f96e707ee67ceffd1b8f4fb3e"
    }
  ]
}