{
  "modId": 38343.0,
  "modName": "Elves without muscles",
  "summary": "replaces the body of the elves to be viewed without muscles",
  "descriptionHtml": "Warning : these textures just replace the standard texture maps of the elves, and wood elves , dark elves and high elves . When I miss the mod in my Spanish skyrim , it may be that in skyrim other languages ​​replace some description when choosing character and is not fully compatible with other mods of bodies of men , and the mod UNP / Better Males Nudes / Windsong Skyrim Beauty Project. Anyway , I hope later to fix these types of problems doing a better mod adjusting meshes elves to really look thinner, as this does not change the maya the character ( elf ) just changes the normal texture map , that what is stumping to create the effect so that the muscle can not see\r<br />\r<br />This mod replaces the textures and normal map of elves, normal map also replaces the orcs and the Red Guards muscles leaving them with more marked than the Nords and Bretons. My idea is to do in the future CBBE a distinct body of each race and sex so that there is a great distinction between races, including going to modify the legs of the Khajiit and Argonians so they are like Morrowind, but it will take a while , and I have not gotten up any mesh of any body Skyrim gives me error when choosing the breed changed. Of course, if anyone knows why when editing a mesh of bethesda and put it in a race is nothing more off the game choose the character go a long way to achieve the end goal of Mod ... For now I leave this mod, it is very simple. And please who seem silly this mod do not bother to look at him as this mod is designed for people who believe that the elves, as they say in the game almost all are wizards and are weaker, to make sense of that , I do not need many muscles, therefore, all the elves you see in Skyrin with this mod will be weaklings without muscles.\r<br />To enjoy Skyrim&#33;",
  "categoryId": "29",
  "version": "E.m.v1.41",
  "author": "Alvenon",
  "createdUnix": "1373891019",
  "updatedUnix": "1373887859",
  "containsAdultContent": false,
  "uploadedBy": "alvenon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039047",
      "name": "Elves Without muscles",
      "version": "E.m.v1.41",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4128",
      "fileName": "Elves Without muscles-38343-E-m-v1-41.rar",
      "uploadedUnix": "1373887859",
      "modVersion": "E.m.v1.41",
      "virusScanUrl": "https://www.virustotal.com/file/5062a85e79fd21c5d3dd0c81f44006cca70b359f3fdd70d57192eeda7903ec1d/analysis/1407645017/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elves%20Without%20muscles-38343-E-m-v1-41.rar?fid=1000039047&ttl=1535818623&ri=8192&rs=8192&setec=ca79975e3baee35b252902fb0ad1f0c7"
    }
  ]
}