{
  "modId": 38359.0,
  "modName": "Oblivion Racial Power and Ability Replacer Beta",
  "summary": "Replaces the racial powers and abilities of default Skyrim races with ones from Oblivion.",
  "descriptionHtml": "Replaces the racial powers and abilities of default Skyrim races. Please report any bugs you find, I\\'ve only had one chance to test this mod. Also, add some screenshots if you like, it would be helpful because I\\'ve been creating this mod for two days straight and I just finished.\r\n\r\nRacial Powers and Abilities:\r\n\r\nAltmer:\r\n-High Elf Enhanced Magicka ability: 100 points of extra magicka\r\n-High Elf Disease Resistance ability: 75% disease resistance\r\n-High Elf Elemental Weakness ability: Weakness to Fire, Frost & Shock 25%\r\n\r\nArgonian:\r\n-Argonian Disease Resistance ability: Resist Disease 75%\r\n-Argonian Poison Immunity ability: Resist Poison 100%\r\n-Argonian Water Breathing ability: Water Breathing (Unchanged from Skyrim)\r\n\r\nBosmer:\r\n-Beast Tongue greater power: Command Creature up to level  for 60 seconds, once per day\r\n-Wood Elf Disease Resistance ability: Resist Disease 75%\r\n\r\nBreton:\r\n-Breton Enhanced Magicka ability: Start with 50 extra magicka\r\n-Breton Magic Resistance ability: Resist Magic 50%\r\n-Dragon Skin greater power: Resist 50% of physical damage for 60 seconds, once per day\r\n\r\nDunmer:\r\n-Ancestor Guardian greater power: Summon Ancestor Guardian for 60 seconds, once per day\r\n-Dark Elf Fire Resistance ability: Resist Fire 75%\r\n\r\nImperial:\r\n-Star of the West greater power: Absorb 1000 points of stamina and paralyze for 5 seconds, once per day\r\n-Voice of the Emperor greater power: Charm 30 points for 30 seconds, once per day\r\n\r\nKhajiit:\r\n-Eye of Fear greater power: Demoralize up to level 25for 30 seconds, once per day\r\n-Eye of Night lesser power: Night-Eye for 30 seconds\r\n\r\nNord:\r\n-Nordic Frost greater power: Frost Damage 1000 points, once per day\r\n-Woad greater power: Resist 30% of physical damage for 60 seconds, once per day\r\n-Nord Frost Resistance ability: Resist Frost 50%\r\n\r\nOrc:\r\n-Berserk greater power: Fortify stamina 200 points, fortify health 20 points, fortify one-handed and two-handed 50 points, slow user\r\n\r\nRedguard:\r\n-Adrenaline Rush greater power: Fortify Stamina 50 points, Fortify One-Handed and Two-Handed 50 points, Fortify Health 25 points, once per day\r\n-Redguard Disease Resistance ability: Resist Disease 75% on Self, constant\r\n-Redguard Poison Resistance ability: Resist Poison 75%\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "75",
  "version": "Beta",
  "author": "REDxHOSS88",
  "createdUnix": "1373852808",
  "updatedUnix": "1373852797",
  "containsAdultContent": false,
  "uploadedBy": "REDxHOSS88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038971",
      "name": "Oblivion Racial Power and Ability Replacer",
      "version": "Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "Oblivion Racial Power and Ability Replacer-38359-.7z",
      "uploadedUnix": "1373852797",
      "modVersion": "Beta",
      "virusScanUrl": "https://www.virustotal.com/file/c3bf1da61bc56d3d0bccb1ed783b2c198bdf4c6d97675bb087d0846c3d38f72f/analysis/1407644110/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Oblivion%20Racial%20Power%20and%20Ability%20Replacer-38359-.7z?fid=1000038971&ttl=1535818643&ri=8192&rs=8192&setec=76fb723e9da66c378732962593ceccb9"
    }
  ]
}