{
  "modId": 38364.0,
  "modName": "Dwemercycle W I P Standstill Don&#39;t Download Until Fix",
  "summary": "This is a custom mesh Dwarven motorcycle made from scratch. ",
  "descriptionHtml": "UPDATE: 3/8/2015. Do not download this mod it is standstill until I can get some professional help. If any of you are willing to lend me a hand with this mod you&#39;re more than welcomed. Thanks. \r<br />\r<br />Update 11/16/2013: This is a work in progress. I am currently working on correcting sound issues for the bike. \r<br />\r<br />This is not done quite yet but if any of you know sound scripting or how to work with sound. Be sure you know what you are doing. Please send me an inbox to offer me help.\r<br />I would love for everyone to have a bikers club going in Skyrim since there&#39;s tattoo mods going around. Thanks\r<br />\r<br />Custom made from scratch using the best technology Blender and 3DS Max offers. \r<br />\r<br />Get your leather jackets, sunglasses, and your best biker gear together. This Dwemer built motorcycle of every man and woman&#39;s dreams is now yours. Ride in style as you zip across the countryside as a Skyrim biker&#33; Start your own biker club and make those bandits and other punks keep their hands off your bike. You&#39;re b-b-b-b-b-b-baaaaad to tha bone&#33;\r<br />\r<br />Update: The bike is smaller and is the size for a normal motorcycle. The player&#39;s legs will clip a little bit but the rest still looks good. \r<br />\r<br />The bike is found at Whiterun&#39;s stables. You can&#39;t miss it. \r<br />\r<br />This Dwarven bike is powered by a Grand Soul Gem. You cannot remove it as it is decoration. The hood ornament is a dragon skull scaled down to size to fit the head of the bike. \r<br />\r<br />This is a mesh replacement and you&#39;ll hear some of the horses original sounds. I will be fixing that in the later update. \r<br />\r<br />The wheels are not animated so I made them a black color to give the illusion as if they were moving. \r<br />\r<br />This motorcycle comes with a start up sound when you mount the bike and a turn off sound when you dismount. When you speed across the land there is no speed sound fx just yet. I am currently working on adding those as I am figuring out how to add them. \r<br />\r<br />I am learning how to create the animation for the player to grab the handle bars. In the next update, a seat will become available.\r<br />\r<br />Now I had to rename horse as horse2 to keep all of your other horses the same throughout Skyrim because the original horse file contains the Dwemcycle mesh. If this hadn&#39;t been the case, then all horses will be Dwemercycles. \r<br />\r<br />Thank you Bethesda for your awesome Dwarven textures.\r<br /> \r<br />To install: Use NMM or just drag and drop into your Skyrim data folder.\r<br />To uninstall: Go to your Data folder and delete Dwemcercycle.esp, then Sound folder, Sound--&gt;fx--&gt;npc. Mesh and Textures under Actors and Character Assets, then dwemercycle.\r<br />\r<br />Compatibility Issues: None as far as I know. If anything please let me know and I&#39;ll consult with other modders.\r<br />\r<br />Thank you and enjoy&#33;",
  "categoryId": "83",
  "version": "V2.0",
  "author": "Valus34",
  "createdUnix": "1373860209",
  "updatedUnix": "1374394347",
  "containsAdultContent": false,
  "uploadedBy": "Valus34",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000038982",
      "name": "Dwemercycle",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25580",
      "fileName": "Dwemercycle-38364-V1-0.rar",
      "uploadedUnix": "1373860191",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/44ab7be8e618ec3ff94ecc7836e6c999abac95d9aada1cc7b3c974ec71ea8048/analysis/1407644279/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemercycle-38364-V1-0.rar?fid=1000038982&ttl=1535818661&ri=8192&rs=8192&setec=4198dab3cdc39b5a5a4c6af0522cf7c5"
    },
    {
      "fileId": "1000039916",
      "name": "Dwemercycle with no Blocks on Base",
      "version": "2.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "49182",
      "fileName": "Dwemercycle with no Blocks on Base-38364-2-0.rar",
      "uploadedUnix": "1374394347",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/40d4eed596042623cba21c4ec6b0cd5c55cf15d85a5c71babd422f15d0e510d6/analysis/1407651341/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemercycle%20with%20no%20Blocks%20on%20Base-38364-2-0.rar?fid=1000039916&ttl=1535818661&ri=8192&rs=8192&setec=4b2a84657e79a75df9191f49b8de263f"
    }
  ]
}