{
  "modId": 38377.0,
  "modName": "Even Better Quest Objectives in Russian",
  "summary": "Russian translation of famous Even Better Quest Objectives mod by William Imm.",
  "descriptionHtml": "THIS IS ALPHA VERSION of EBQO translation in Russian language.\r\nOriginal mod: http://skyrim.nexusmods.com/mods/32695/\r\n\r\nTranslation status:\r\n* Not translated (.strings): 62 / 1086 (6%)\r\n* Not translated (.dlstrings): 0 / 465 (0%)\r\n* Not translated (Total): 62 / 1551 (4%)\r\n* All compatibility patches is translated.\r\n* Installation wizard is NOT translated yet.\r\n\r\n-- Original description --\r\nThis mod enhances the quest descriptions in the vanilla game so that you have a clear sense of where your are supposed to go and what you are supposed to do besides looking at the quest markers. Let\\\\\\'s face it - the quest descriptions were quite bad, not specifying where you are supposed to go by themselves, and forcing you to play with the quest markers on all the time. This affects nearly 250 quest objectives/descriptions, spanning over 160 quests, editing descriptions that were either really vague or didn\\\\\\'t exist at all.\r\n\r\nIf you recognize the concept, then you\\\\\\'ve probably seen Better Quest Objectives by whickus, and this mod is mostly inspired by that. However, due to whickus\\\\\\'s disappearance from the Nexus, his mod was left unmaintained and became more and more outdated over time - not including fixes from the unofficial patches, changes by the DLC, and even official updates from Bethesda. Making reviving this mod harder was the fact that the author did not include the source code for the scripts, making changes to them really difficult.\r\n\r\nEnter this mod. A updated revival of whickus\\\\\\'s mod, it includes fixes from the unofficial patches and official updates, so it will not undo fixes any more from both, while also enhancing the quest descriptions and objectives.\r\n\r\nA few things to consider: Some quests with ambiguous descriptions are left alone because they are meant to be riddles. They will not be modified - it\\\\\\'s as likely as me cutting myself on a sharply observed portrait. Also, quests with journals that give information about the locations have the journals themselves edited instead of the descriptions.\r\n\r\nAlso, this mod does modify some of the vanilla scripts relating to some of the radiant quests. This is done so that the location would be properly displayed in the quest objectives. For now, only the scripts relating to DA09, DA10, MGR20, MGR20b, MGR21, MGRArniel04, and MGRitual05 are modified - more might come soon.",
  "categoryId": "42",
  "version": "1.3.3.1a",
  "author": "lainverse",
  "createdUnix": "1373903418",
  "updatedUnix": "1373903895",
  "containsAdultContent": false,
  "uploadedBy": "lainverse",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039068",
      "name": "Even Better Quest Objectives in Russian",
      "version": "1.3.3.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8183",
      "fileName": "Even Better Quest Objectives in Russian-38377-1-3-3-1a.7z",
      "uploadedUnix": "1373903895",
      "modVersion": "1.3.3.1a",
      "virusScanUrl": "https://www.virustotal.com/file/e63bcbd32fc1f1380d6da4590a65b097a1a5aa4a6e50ee1eedb5002ceb27015b/analysis/1407645134/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Even%20Better%20Quest%20Objectives%20in%20Russian-38377-1-3-3-1a.7z?fid=1000039068&ttl=1535818679&ri=8192&rs=8192&setec=6e26f7c9424b1b4b473f5f727ba032fd"
    }
  ]
}