{
  "modId": 38394.0,
  "modName": "HearthFire Tweaks",
  "summary": "This small (currently) mod adds a few features to the HearthFire DLC (small meaning currently a grand total of *drumroll please*…2 additions). I hope to increase the amount of content in this mod purely to enhance the quality of the HearthFire experience.",
  "descriptionHtml": "This small (currently) mod adds a few features to the HearthFire DLC (small meaning currently a grand total of *drumroll please*…2 additions). I hope to increase the amount of content in this mod purely to enhance the quality of the HearthFire experience. If I receive any suggestions that I like and / or have the ability to implement in a way which will not upset the balance of the game too much I shall endeavour to get them in as soon as possible. Please note, since this is a ‘HearthFire Tweaks’ mod I will only be adding content which requires HearthFire in addition to the Vanilla data; I should be releasing additional mods (you guessed it, ‘Dawnguard Tweaks’ and ‘Dragonborn Tweaks’) at a later date.\r\n\tNow, if you made it this far, congratulations are in order! We shall now cover the actual existing content:\r\n\r\n[b][u]Shore Salmon[/u][/b] - The first thing this mod currently does is replace the Salmon in the Fish Hatchery at Windstad Manor. The Fish Hatchery will now produce a new kind of fish; Shore Salmon. These look the same as regular Salmon, however when you harvest them, you will get ‘Shore Salmon Meat’ and ‘Salmon Roe’. Firstly, this means no more jumping around in waterfalls trying to get Salmon Roe (unless you enjoy doing that, in which case feel free to continue your leaping shenanigans; you’ll probably need to do that anyway to get the first set of Roe to put in the Hatchery). Shore Salmon Meat is considerably more nutritious than normal Salmon Meat and as such, can be used to create ‘Shore Salmon Steak’ with a little butter and salt (hint, hint). The created steaks will heal a considerable amount of health compared with other food, meaning it should have some use in the game.\r\n\r\n[b][u]Icebark Root[/u][/b] – The Jarrin Root is now a plantable ingredient (sort of)! It always bothered me the way you only ever got one Jarrin Root in the game; yes, it made a truly lethal poison but there were too many situations in which I found myself wishing I hadn’t put it in that Potage le Magnifique just to feel like a proper assassin. With that in mind, this mod introduces the Icebark Root. It is designed as a variant of the Jarrin Root but since I’m a stickler for lore-friendliness and Jarrin Root can only be found on Stros M’Kai, I had to come up with a variant more suited to the harsh, unforgiving Skyrim climate. Its effects upon consumption have been re-balanced from the original Jarrin Root to account for the fact that there are more of them in-game now and should not create a stupidly over-powered damage health effect when made into a venom (certain combinations will still, as the game is set up to do, produce more potent venoms than others). You will only harvest one Icebark Root from each plant at a time, so you’ll need a lot of plants if you plan on using them effectively.\r\n\tIn order to begin using Icebark Roots, you need to purchase the seeds with which you will create your deadly flora. ‘Icebark Plant Seeds’ are now occasionally available from Alchemy shops, so stop by your local Apothecary from time to time and they may just have them stocked. These seeds have the same effects as Icebark Root, albeit considerably less potent.\r\n\r\n\r\n\tI have tested this mod under various conditions including its implementation via the NMM and it doesn’t seem to have any unintended, undesirable knock-on effects. Nevertheless, if anyone discovers any problems attributed to this mod, please inform me and I shall endeavour to resolve such issues in as timely a manner as possible.\r\n\r\nCurrent known issues and workarounds:\r\n\r\n-\tAfter the mod has been installed, the Salmon at the Fish Hatchery will sometimes still be Salmon; since the game draws the fish to spawn from a FormList as an event, clear the Fish Hatchery of existing fish and then wait for the normal respawn period; once the Hatchery refreshes itself, the Salmon should have changed.\r\n-\tAfter uninstalling the mod, the Fish Hatchery is sometimes cleared of all fish; the game still accepts what has already been placed into the Hatchery, so again, simply wait for the respawn interval to elapse.\r\n-\tIf any Icebark Plants are grown in patches when the mod is removed, there will no longer be a plant there but the game will still think there is. Simply activate the spot and select ‘Remove Plant’.\r\n\r\nCurrent WIP:\r\n\r\n-\tThe mod itself works (which I’m sure you’ll be pleased to know) but I’m currently working on re-doing the texture for the Icebark Plant; I think I’d like it to look a little less…glowing mushroom-y.\r\n\r\n\r\n\tThis is only the second mod I have released on to the Nexus but if it goes down well I hope to release some more in the future (I already have some in the pipeline but since I’m an absolute genius I developed them all in the same .esp file; cue the long and arduous process of separating and isolating each individual mod).\r\n\r\n\r\nRequirements:\r\n\r\n-\tHearthFire is required for this mod.\r\n\r\n\r\nInstallation instructions\r\n\r\nFor NMM users (auto):\r\n\r\n-\tDownload the .rar file using the manager.\r\n-\tFind the mod in the list and activate it by using the appropriate button on the side panel.\r\n\r\nFor NMM users (manual):\r\n\r\n-\tDownload the .rar file.\r\n-\tLaunch NMM.\r\n-\tNavigate to ‘Add Mod from File’.\r\n-\tFind the .rar file using the browser, left click it and then select ‘Open’.\r\n-\tThe NMM should then add the mod to the list and create a copy of the .rar file in folder it uses to reference the mod list.\r\n\r\nFor manual download:\r\n\r\n-\tDownload the .rar file.\r\n-\tExtract the folders to the appropriate location (…\\\\Skyrim\\\\Data\\\\); if the folders inside the .rar file already exist inside the Data folder (meshes, textures) then the sub-folders should be added without interfering with the rest of the files in their respective folders.\r\n\r\n\r\nUninstallation instructions\r\n\r\nFor NMM users:\r\n\r\n-\tRemove the mod by navigating to the ‘Deactivates the selected mod.’ button. This should remove all files used by the mod.\r\n\r\nFor manual additions:\r\n\r\n-\tRemove ‘HearthFire Tweaks.esp’ from \\\\Skyrim\\\\Data\\\\.\r\n-\tIf desired, remove the files used by the mod:\r\n            o\t\\\\Skyrim\\\\Data\\\\meshes\\\\_byoh\\\\plants\\\\byohhouseingrdjarrinroot01.nif\r\n            o\t\\\\Skyrim\\\\Data\\\\meshes\\\\clutter\\\\plants\\\\icebarkseedsbag.nif\r\n            o\t\\\\Skyrim\\\\Data\\\\meshes\\\\plants\\\\icebarkroot01.nif\r\n            o\t\\\\Skyrim\\\\Data\\\\textures\\\\plants\\\\floraicebarkroot01.dds\r\n            o\t\\\\Skyrim\\\\Data\\\\textures\\\\plants\\\\floraicebarkroot01_n.dds\r\n            o\t\\\\Skyrim\\\\Data\\\\textures\\\\plants\\\\icebarkroot01.dds\r\n\r\n\r\nAdditional Information:\r\n\r\nThis mod uses only scripts used in the main game and even then, no new instances of them; I try to keep scripting to a minimum in as many mods as possible to maximise compatibility (but mostly to avoid the number of things that can go wrong ;-) )\r\n\r\nAs far as I am aware, SKSE is not required to run this mod; should I be proven wrong, however, the latest edition can be found at:\r\n\thttp://skse.silverlock.org/\r\n\r\nMods featured in screenshots of this mod:\r\n\r\n[url=http://skyrim.nexusmods.com/mods/95/?]Main Font Replacement[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/35154/?]Less Intrusive HUD II[/url]",
  "categoryId": "28",
  "version": "1.0",
  "author": "YourUnequal",
  "createdUnix": "1373958972",
  "updatedUnix": "1373958886",
  "containsAdultContent": false,
  "uploadedBy": "YourUnequal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039177",
      "name": "HearthFire Tweaks v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "269",
      "fileName": "HearthFire Tweaks v1_0-38394-1-0.rar",
      "uploadedUnix": "1373958886",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/59b1c3535bfa109b232fb66a10f41ce0a36a82204137197ea0058d1c271257f9/analysis/1407645965/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthFire%20Tweaks%20v1_0-38394-1-0.rar?fid=1000039177&ttl=1535818713&ri=8192&rs=8192&setec=5748e9d337b709218ff8f9fcd94c8cc0"
    }
  ]
}