{
  "modId": 38413.0,
  "modName": "Slightly Dangerous Legendary Creatures",
  "summary": "This adds a variety of \\\"Legendary\\\" creatures to Skyrim. This aims to increase the difficulty of the game.  ",
  "descriptionHtml": "Slightly dangerous legendary Creatures - A Description:\r\n\r\nFirst off - the 1.1 update is here, I know all you kids are so very excited about it.\r\nThis update adds:\r\n\r\nBlizzard Wraith - Patrols an edge of the tundra with two of it\\'s kin, be very cautious when battling it.\r\nDemonic Wolf - A huge wolf that is ablaze with fire. Hiding somewhere in the rift, it burns any prey.\r\nGrendal - What is described as a giant Troll, he has a tremendous amount of strength and speed. However, his location is unknown. :(\r\nDoomsday Hare - This piece of shit has been reported many times, a hare that is bigger than a man, it\\'s eyes are darker than the void. Strangely, there have been no reports of this thing attacking anyone, it just silently follows. It\\'s been seen around the green forests of Eastmarch.\r\n\r\nWhat this mod is:\r\n\r\nThis mod I have created -  with my bare hands and pure love - unleashes a variety of huge beasts, creatures and all manner of hateful things upon the land of Skyrim. Each beast is unique, which means you\\'ll only have to fight them once. \r\n\r\nThe creatures added are all level 81 (the title gives it away really). They\\'ll have a decent amount of gold on them - some even have special items on them!\r\n\r\nSo, I bet you\\'re wondering what these evil things are, well here is just a few of the things you\\'ll be fighting:\r\n\r\nAncient Mammoth - As you can tell, he is a very old Mammoth, and he never forgets... to kill! He can be seen killing his brethren on the road to Dawnstar, going out of Whiterun Hold.\r\n\r\nWispmother Matron - This crazed bitch of a spectral form lurks deep within the forests of the Rift. Unlike other Wispmothers, this one is a she devil - and will kill anything near it, especially men...\r\n\r\nAlpha Sabre Cat - This monster is feral, and should not be underestimated. There are reports of a local mage going missing in the area - no doubt he has been mauled and eaten by this cool cat. It can be found off the road going towards Windhelm, from The Pale.\r\n\r\nThe list could go on. But it won\\'t.\r\nYou have to discover the others for yourself.\r\n\r\nIf you find the Man-Eater Slaughterfish, good luck :3\r\n\r\nINSTALLATION:\r\nSlap the .esp file into your Skyrim data folder, or you could use the Nexus Mod Manager - I love that thing.\r\n\r\nIf there are any problems, post in the comments. I will read them.\r\n\r\n\r\nAll the best,\r\nPorkiousMaximus\r\n ",
  "categoryId": "83",
  "version": "v1.1",
  "author": "PorkiousMaximus",
  "createdUnix": "1374009314",
  "updatedUnix": "1374336825",
  "containsAdultContent": false,
  "uploadedBy": "PorkiousMaximus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039261",
      "name": "SDLC",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "SDLC-38413-v1-0.rar",
      "uploadedUnix": "1374009294",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7af69631c4ea521e5c871b5ef09230dc17f77e9eaa99aab2f74c3d4f45ee921c/analysis/1407646562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SDLC-38413-v1-0.rar?fid=1000039261&ttl=1535818749&ri=8192&rs=8192&setec=cdeb7b923a02b7a7bc1abc14dafc4b1a"
    },
    {
      "fileId": "1000039819",
      "name": "SDLC",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "SDLC-38413-v1-1.rar",
      "uploadedUnix": "1374336825",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/27b77d1a80c5be5da22d92088445ee64adf4f6264cfeb28bf5d6946bc5548db1/analysis/1407650583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SDLC-38413-v1-1.rar?fid=1000039819&ttl=1535818749&ri=8192&rs=8192&setec=05c78b34bbf7155643c28a2dc9e46dea"
    }
  ]
}