{
  "modId": 38430.0,
  "modName": "Teddybears in Skyrim DV",
  "summary": "Teddybears for Skyrim\\'s childs!\r\nThis is a small plugin and a Modders Resource!\r\nGERMAN VERSION!!!\r\n",
  "descriptionHtml": "Kleine Teddybären-Mod und Ressource für Modder!\r\n\r\n\r\nDownload via MIRROR!\r\n\r\n\r\nTeddybären für Skyrim - Modders Ressource:\t\r\n==========================================\r\n20 verschieden texturierte \\\"Bärchen\\\" (Clutter), basierend auf drei verschiedenen Felltexturen. Außerdem gibt es alle 20 Teddybären auch als \\\"statische\\\" Objekte. \r\nDiese Teddybären sind Inhalt der nächsten Version meiner \\\"Verbesserten Spielerhäuser\\\".\r\n\r\n\r\nKleine Teddybären-Mod:\r\n=======================\r\nIn dieser Ressource befindet sich außerdem eine ESP mit folgendem Inhalt:\r\nAlle Teddybären können bei einigen Händlern in den größeren Orten gekauft werden. Ein paar von ihnen habe ich in den Häusern der NPC\\'s verteilt. Vor allem habe ich mir dabei die Schlafbereiche der Kinder vorgenommen - und hier passend die Teddys verteilt.\r\nEinige von diesen \\\"verteilten\\\" Bären sind statisch und können nicht mitgenommen werden!\r\n\r\nLeider konnte ich es bisher nicht testen, aber generell dürften, im Falle dass ihr Hearthfires spielt, eure adoptierten Kinder die Teddybären als Geschenk annehmen, da ich sie mit dem entsprechenden \\\"Keyword\\\" versehen habe.\r\n\r\n\r\nShort description in English:\r\n==========================\r\nThis is a modders resource and a small pugin, which adds 20 different Teddys to Skyrim.\r\n(The Teddys are also added as static objects!)\r\nI\\'ve distributed the bears to the children of Skyrim but they can also be bought by some of the merchants in the villages. \r\nAny bears, which you can find in the NPC\\'s homes, are cannot be picked up, that\\'s ok... they belongs to the children.;)\r\n\r\n\r\n\r\nInstallation:\r\n===========\r\n- Die gezippte Datei an einen externen Ort entzippen.\r\n- Esp und dazugehörige Dateien in den Ordner: entsprechendes Laufwerk (...meistens   C)/Programme/Steam/SteamApps/common/skyrim/Data kopieren\r\n- Esp im Skyrim-Launcher aktivieren\r\n\r\n\r\n\r\nInkompatibilität:\r\n===============\r\nKeine bekannt\r\n\r\n\r\nVerwendete Tools:\r\n=================\r\n- Creation Kit\r\n- Nifskope\r\n- Blender\r\n- The Gimp\r\n- Texture Optimizer\r\n\r\n\r\nLizenz:\r\n=======\r\nInhalte dieses Plugin können gerne weiterverwendet werden, allerdings nur mit Credits an alle Beteiligten, und ohne Verfolgung kommerzieller Zwecke. Diese Mod darf nicht ohne meine ausdrückliche Erlaubnis auf anderen Seiten hochgeladen werden!\r\n\r\nFeel free to use the content of this mod as you wish, as long as credit is given (also to the people below in my credits) and do not upload this mod to any other sites. This plugin is not intended for commercial use and should not be used as such.\r\n\r\n\r\nDanksagung an:\r\n==============\r\n- Bethesda - für dieses wundervolle Spiel und das Creation Kit!\r\n- Dem \\\"Niftools-Team\\\", den Leuten von \\\"Blender\\\" und \\\"The Gimp\\\" für ihre unermüdliche Arbeit an diesen freien Tools\r\n- Matt Smith - für das originale 3d-Modell des Bären\r\n- Snusmumriken - für seine Oblivion-Version des Bären, den ich für Skyrim konvertiert habe\r\n- West Ninja - für die Schaffell-Textur und in diesem Sinn auch ein Danke den Leuten von \\\"StockFreeImages.com\\\", von wo ich meine anderen Felltexturen heruntergeladen habe\r\n- Atomec - für seine hilfreichen Tipps bezüglich des Konvertierens im Nifskope\r\n\r\n\r\nViel Spass mit dem Plugin! / Much fun!\r\nLilaMue\r\n",
  "categoryId": "28",
  "version": "1.0",
  "author": "Lila Mue",
  "createdUnix": "1374049547",
  "updatedUnix": "1374051172",
  "containsAdultContent": false,
  "uploadedBy": "LilaMue",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039323",
      "name": "LMTeddybears",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7193",
      "fileName": "LMTeddybears-38430-1-0.7z",
      "uploadedUnix": "1374051172",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/863b91edb0302f2efc63e322498c516ca0885049a3c879252dc4328393451cb5/analysis/1407647065/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LMTeddybears-38430-1-0.7z?fid=1000039323&ttl=1535818768&ri=8192&rs=8192&setec=580ca0a46aad3b551793dd5a4f414b3b"
    }
  ]
}