{
  "modId": 38449.0,
  "modName": "Ebony Weapons Pack for Ebony Armor and Mail Mod",
  "summary": "This is the weapons pack for ebony weapons to go with my Ebony and Plate Ebony Armor Mail mod. Increased resolution and custom textures for ebony weapons including blade of sacrifice but not ebony blade. Changed the ebony sword mesh to use smaller greatsword mesh. No more grungy too dark to see ebony weapons!\r\n",
  "descriptionHtml": "This is the weapons pack that goes with my other ebony mod here: http://skyrim.nexusmods.com/mods/24960/?\r\n\r\nUPDATED\r\n\r\nI finally finished working on the other weapons and removed that split line in the textures by re arranging the uv maps for the models and reworking the textures. Now all ebony weapons have a nice sharp edge:-) Check the images section for more details. The battle axe took the longest time ever but it looks great now. Went back to the default handles but changed the leather textures on those handles so they are not boring dark grey anymore. The ebony bow stays the same, that handle looks good on the bow so it is staying there it just looked bad on everything else. The ebony mace appears to have a blunt edge because it is a blunt weapon:-)  Maces do damage with force more than an edge. The war axe finally looks great! \r\n\r\n\r\nI replaced the ebony sword mesh with a smaller greatsword mesh and managed to fit it into the scabbard properly. Custom textures with 2k resolution and better details like handles that you can actually see and details that are clean and visible. \r\n\r\nThe ebony sword and greatsword have different textures so they don't look the same. I changed the blade of sacrifice to custom textures and put a scabbard on it. The only thing not changed is the ebony blade because some people actually like the default (not me) and some people already have replacers for it. I want to find a good replacer for it later though. \r\n\r\nThe meshes included are needed because some cubemap settings are required to get the weapons to match my other mod and these weapons use the same or similar cubemaps to my other mod too which is included in this mod. Also all ebony weapons now use the high poly models for everything no more low poly stuff.\r\n\r\nThere is no esp file because it is not needed just use nexus mod manager or manually copy meshes and textures to game folders.\r\n\r\nFind any bugs? Please post them in the comments section so I can fix them thanks.",
  "categoryId": "55",
  "version": "v1.1",
  "author": "Dragonslayer2k12",
  "createdUnix": "1374108377",
  "updatedUnix": "1383647308",
  "containsAdultContent": false,
  "uploadedBy": "dragonslayer2k12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000075357",
      "name": "Ebony Mod Weapons",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "41959",
      "fileName": "Ebony Mod Weapons-38449-v1-1.rar",
      "uploadedUnix": "1383647308",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3cfc98a2ddea3ed4c88b759d36b0034686facccfdc8896b92fe3aeaa3c0e7864/analysis/1407781673/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ebony%20Mod%20Weapons-38449-v1-1.rar?fid=1000075357&ttl=1535818792&ri=8192&rs=8192&setec=f37d2bd01b85f42d9d5db84a9a14c94e"
    }
  ]
}