{
  "modId": 38444.0,
  "modName": "Skaal Igloo",
  "summary": "A small igloo player home near the Skaal village.",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center]\r<br />\r<br />\r<br />This mod was a rather unique request, for a small igloo player home near the Skaal village, in Solstheim. Therefore, this mod requires the Dragonborn DLC.\r<br />\r<br />I tried my best to assemble a nice, cozy hideout with items already in the game to avoid size bloat (there&#39;s some nice custom content around the internet), and I&#39;m quite pleased with the results, so here it is. And yes, I am aware that this may be more of a cave than an igloo.\r<br />\r<br />Located by the edge of the Skaal village, this little igloo has some basic amenities for the reclusive invididual. The house is geared towards a fishing or hunter aficionado, with plenty of meat and by-products such as eggs or scales. There is a hanging horker in a corner you can harvest for meat, frost mirriam and garlic over the fire, and some slices of ready-to-cook horker hanging over the table.\r<br />\r<br />About furniture, there&#39;s a table, a chair, a cooking spit and a bedroll. You have some storage - a satchel, a knapsack, a sack and a barrel, none of which respawn so they&#39;re safe. And, to fight off the cold, you have some wine and mead warming by the fire, and a pot of charcoal alongside the firewood pile. The room is fully navmeshed, so your followers can come in for a visit, too.\r<br />\r<br />Now, for some technicalities:\r<br />- Since the area is rather small, I had a bit of trouble fitting in the hanging horker. You should not hit it with any weapon, or it will twitch around and wrap around its pole, and I&#39;m not sure if that glitching could be reverted.\r<br />- Due to personal tastes, I fixed it up so, when you harvest the horker meat from the ring, some bones are left behind. I just thought the ring looked kind of empty afterwards.\r<br />- The axe on top of the firewood pile is static and cannot be taken. Again, this was mostly because of lack of space - most items are static to avoid going in an causing an explosion of assorted clutter, especially if you&#39;ve got followers with you.\r<br />\r<br />To install, extract the contents of your downloaded file to your &#39;SteamSteamAppsCommonSkyrimData&#39; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp. Let me know if there are any problems&#33;\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "67",
  "version": "1.00",
  "author": "Jokerine",
  "createdUnix": "1374093480",
  "updatedUnix": "1374093100",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039394",
      "name": "Skaal Igloo v1",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "69",
      "fileName": "Skaal Igloo v1-38444-1-00.rar",
      "uploadedUnix": "1374093100",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/f5eed6b9ef11e38050996697de718609e9e6fedacdce4b8eae288e8a6596488f/analysis/1407647356/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skaal%20Igloo%20v1-38444-1-00.rar?fid=1000039394&ttl=1535818786&ri=8192&rs=8192&setec=e3a5faaea582935315122c5baec4f8e4"
    }
  ]
}