{
  "modId": 38441.0,
  "modName": "Loners Armor",
  "summary": "An intriguing re-texture.",
  "descriptionHtml": "[color=#ff0000]=======================================================================================================================================================\r<br />Update - Abandonment of Mod\r<br />=======================================================================================================================================================\r<br />[color=#dd7e6b]Given the upcoming release of the Special Edition, I&#39;d figure I should say this.\r<br />\r<br />I&#39;d like to give a formal apology to all fans of this mod and have been checking in over the months or even years for updates. This mod was actually abandoned a couple years ago and this update is overdue as such. I actually have been physically incapable of continuing this mod, even if I wanted to, due to college and other interests I&#39;ve gained from other games, and one major issue to which I will not disclose (think spoiled white kid problems). But I definitely owe it to this community to at least make it official and clear that this has been abandoned.\r<br />\r<br />If I ever pick up the game again and get back into the thick of modding and start using my own mod again, I&#39;ll definitely update it to at least contain the new features and fixes from the original Armor of Intrigue mod. And I might do a few of the requests I got.\r<br />\r<br />That said, consider the rest of the mod description outdated.[/color][/color]\r<br />\r<br />\r<br />=======================================================================================================================================================\r<br />Description\r<br />=======================================================================================================================================================\r<br />My friends, I give you the Loner&#39;s Armor.\r<br />\r<br />This is my personal re-texturing of Patobek&#39;s Armor Of Intrigue. I never did much like the color scheme he used for the armor. It just screamed Thalmor. And with me being a Nord, you can see how that kinda ruins the armor for me. So I opened up Photoshop and got to work.\r<br />And not only are the texture re-done, I went into the Creation Kit and personally renamed all the items and edited the meshes to use different texture origins. So you can use this mod right along side with the Armor Of Intrigue. Also, the names are now shorter, the satchels are grouped together in the inventory, and the names won&#39;t be bunched up like, &#34;ArmorOfIntrigue AdventureSatchel&#34;.\r<br />\r<br />\r<br />=======================================================================================================================================================\r<br />Features\r<br />=======================================================================================================================================================\r<br />+ Retextured armor to a more comfortable color scheme suitable for more people.\r<br />+ Renamed items to be more lore friendly/easier to navigate through in the menus.\r<br />+ Standalone from original mod (You will not need Armor Of Intrigue).\r<br />\r<br />\r<br />=======================================================================================================================================================\r<br />Planned Updates\r<br />=======================================================================================================================================================\r<br />+ Female meshes.*\r<br />+ Heavy variant.*\r<br />+ Beast Races.*\r<br />\r<br />*These features will be implemented as soon as I can obtain and setup the assets when they are released from the Armor Of Intrigue mod page.\r<br />\r<br />=======================================================================================================================================================\r<br />Compatibility\r<br />=======================================================================================================================================================\r<br />The armor cannot be worn with other apparel items that use the same slots, which means a lot of the armor pieces can&#39;t be worn with specific pieces from mods like Bandolier, or some backpack mods.\r<br />\r<br />\r<br />=======================================================================================================================================================\r<br />FAQ\r<br />=======================================================================================================================================================\r<br />Q: Did you even get permissions to upload this?\r<br />A: Yes. I have permissions from Patobek. If you wish to not believe my word, ask a site moderator/administrator to check my inbox on the Nexus framework for messages between me and Patobek.\r<br />\r<br />Q: Will you retexture &lt;insert armor set/mod here&gt; armor for me?\r<br />A: No. I don&#39;t do requests. I&#39;m not a modder, I&#39;m a gamer. I uploaded this file because I retextured it for myself, and uploaded it to share my efforts, and have a backup I can obtain in-case of emergencies. Now, if I happen to retexture the armor you wanted me to, I might upload it due to coincidence.\r<br />\r<br />Q: Will you make it in this color scheme.\r<br />A: As I said before, I don&#39;t do requests. Again, if I decide to make it those colors, I will upload it.\r<br />\r<br />Q: I have a bug/issue&#33; Help please?&#33;\r<br />A: Refer to Troubleshooting/Issues section below. If that doesn&#39;t help, post a reply to the bug report sticky in the comments. Also, spell correctly, type in English, and be calm. If you through in a bunch of &#39;&#33;&#39;s and caps, I will not respond to you.\r<br />\r<br />Q: Why you no update?\r<br />A: I am not a hardcore modder. I spend little time making actual mods for public use. Most of my modding is to simply make my game more comfgotable for me. Also, I won&#39;t make mods for a game I&#39;m not currently playing, let alone update one. But don&#39;t worry, Skyrim is a one of a kind game I will defenitely come back and play numerous times.\r<br />Also, this mod heavily depends on Patobek&#39;s Armor of Intrigue directly. I can&#39;t update certain things until he updates them.\r<br />\r<br />Q: bluh&#33; you talentless l0zr. you just recolor textures. any1 can do dat. get a life.\r<br />A: Considering I have had people beg me to upload my retexture work before, it&#39;s safe to assume not just anyone can retexture this stuff quite like I can. Also, if you&#39;re gonna be unfriendly, I want you to closely examine the exit sign above the door behind you as I walk you out as my shoe with my foot up your sorry a**.\r<br />P.S. Learn to spell.\r<br />\r<br />\r<br />=======================================================================================================================================================\r<br />Troubleshooting/Issues\r<br />=======================================================================================================================================================\r<br />+ Someone has reported that the armor was invisible for them. This could be due to the texture directories I assigned for the .nif meshes. If you experience the same problem, please post a comment stating so along with what type of OS bit system (32-bit or 64-bit) and what your Program Files(x##) you have.\r<br />My theory is that since I run a 64-bit Windows 7 OS, and my Program Files(x##) is Program Files(x86), anyone who has the that specific type of Program Files(x##) folder with the same Skyrim install directory will have the mod work for them. If this is the case, I can fix this easily. But I can&#39;t tell until the issue is confirmed or not.\r<br />\r<br />+ If you&#39;re playing with a beast race, and the armor is either clipping, or using different meshes and textures than they should be, there may be a workaround fix using Patobek&#39;s beast race patch for his Armor of Intrigue. This is not garunteed to work at all. But he does have the meshes for the fix. If you have slight modding experience, you could tinker/ move some files to possible make it work. As for an official patch for the Loner&#39;s armor, you will have to wait until  the next update.\r<br />\r<br />+ If you can&#39;t access the armor, check if it is added in game by opening the console and typing in help &#34;Loner&#39;s&#34;. If no items come up, then it isn&#39;t installed properly, or the .esp isn&#39;t checked in the load order.\r<br />\r<br />\r<br />=======================================================================================================================================================\r<br />Change Log\r<br />=======================================================================================================================================================\r<br />1.0.0 - 07/17/2013:\r<br />+ Initial release.\r<br />\r<br />\r<br />=======================================================================================================================================================\r<br />Note from Ideal Logic\r<br />=======================================================================================================================================================\r<br />If you like the armor, please endorse. It&#39;s what motivates me further. Also, if you like my work, or just me in general, please take the time to give me kudos here on the Nexus. It makes me happy to know that others appreciate me. It would mean a lot to me.\r<br />P.S. Endorsements might even get you all some extra content/mods/features made by me. Not saying it always will. But who knows. ;)\r<br />\r<br />\r<br />=======================================================================================================================================================\r<br />=======================================================================================================================================================",
  "categoryId": "54",
  "version": "1.0.0",
  "author": "IdealLogic",
  "createdUnix": "1374095726",
  "updatedUnix": "1374090530",
  "containsAdultContent": false,
  "uploadedBy": "IdealLogic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039388",
      "name": "Loners Armor",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "90047",
      "fileName": "Loners Armor-38441-1-0-0.rar",
      "uploadedUnix": "1374090530",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/cad58646533d9f9856091ca697c9e72bd9b606be28f2fabc654dae21780b9852/analysis/1407647337/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Loners%20Armor-38441-1-0-0.rar?fid=1000039388&ttl=1535818784&ri=8192&rs=8192&setec=47502f61764ffc9c22ad0401de4b4704"
    }
  ]
}