{
  "modId": 38470.0,
  "modName": "Farmers Sell Produce",
  "summary": "This is a simple and unobtrusive mod that allows the purchase of goods like wheat, cabbage, leeks, potatoes, gourds, chicken\\'s eggs, and in rare cases even snowberries or nirnroot directly from the farmers who produce them. It gives you a reliable source of alchemical ingredients like wheat or nirnroot, without having to \\\"steal\\\" them from the ",
  "descriptionHtml": "[heading][color=green]WHAT THIS MOD IS AND WHAT IT DOES[/heading][/color]\r\n[color=yellow]This is a simple and unobtrusive mod that allows the purchase of goods like wheat, cabbage, leeks, potatoes, gourds, chicken\\'s eggs, and in rare cases even snowberries or nirnroot directly from the farmers who produce them. It gives you a reliable source of alchemical ingredients like wheat or nirnroot, without having to \\\"steal\\\" them from the farmer\\'s fields and gardens.\r\n[/color]\r\n[heading][color=green]GOOD TO KNOW[/heading][/color]\r\n[color=yellow][list][*]Vantus and Curwe from Loreius farm will only sell you their produce after you convince Vantus to help the distressed jester.\r\n[*]You won\\'t be able to purchase produce from the Snow Shod farm, since Addvild tells you that he has nothing to sell, and directs you to Riften for your produce needs. I did not want my mod to contradict this, so I didn\\'t make him a merchant.\r\n[*]The Sarethi Farm is unique in that it\\'s the only place in Skyrim where Nirnroot is mass produced. You can purchase and sell it here, but not at any of the other farms[/list][/color]\r\n[heading][color=green]WHO SELLS WHAT AND WHERE[/heading][/color]\r\n[color=yellow][b]In Whiterun Hold (Including Rorikstead):[/b]\r\n[list][*]Pelagia\\'s Farm: Gloth and Nimriel will sell you cabbage, leeks, potatoes, and eggs.\r\n[*]Loreius Farm: After completing Delayed Burial and waiting a few in game hours, Vantus and Curwe will sell you cabbage, wheat, eggs, leeks, and potatoes\r\n[*]Battleborn Farm: Gwendolyn will sell you leeks, eggs, gourds, and wheat\r\n[*]Chillfurrow Farm: You will be able to purchase cabbage, wheat, and eggs from Wilmuth\r\n[*]Lemkil\\'s Farm in Rorikstead: Lemkil will sell you cabbage, potatoes, and leek\r\n[*]Cowflop Farm, also in Rorikstead: You can buy wheat, cabbage, potatoes, and eggs from Ennis and Reldith[/list]\r\n[b]Falkreath Hold:[/b][list]\r\n[*]Corpselight Farm: Mathies and Indara will sell you gourds, eggs, cabbage, and potatoes[/list]\r\n[b]The Rift:[/b][list]\r\n[*]Fellstar Farm in Ivarstead: Jofthor and Boti sell wheat, cabbage, potatoes, and eggs\r\n[*]Sarethi Farm: Avrusa and Aduri will sell you gourd, potatoes, and nirnroot\r\n[*]Merryfair Farm: Dravin and Synda sell gourd, eggs, cabbage, and wheat[/list]\r\n[b]Haafingar[/b][list]\r\n[*]Katla\\'s Farm: Katla sells wheat, leek, cabbage, potatoes, and eggs\r\n[*]The Lylvieve Farm in Dragonbridge: Azzada, Julienne, and Michel will sell you wheat, cabbage, gourd, potato, and eggs[/list]\r\n[b]Eastmarch[/b]\r\n[list][*]Hlaalu farm: Adisla will sell wheat and eggs\r\n[*]Hollyfrost farm: Tulvur will sell wheat and snowberries (he is the only farmer who grows and sells snowberries)[/list]\r\n[/color]",
  "categoryId": "78",
  "version": "1.0",
  "author": "Rajti15",
  "createdUnix": "1374153868",
  "updatedUnix": "1374153446",
  "containsAdultContent": false,
  "uploadedBy": "rajti15",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039508",
      "name": "Farmers Sell Produce",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27",
      "fileName": "Farmers Sell Produce-38470-1-0.rar",
      "uploadedUnix": "1374153446",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/311ea0bfa12c97b15032341199c64e1922b51199b9331f41b6ffc59adf428b4e/analysis/1407648011/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Farmers%20Sell%20Produce-38470-1-0.rar?fid=1000039508&ttl=1535818827&ri=8192&rs=8192&setec=3c081023aaf0c45d5d5c0108df6a0785"
    }
  ]
}