{
  "modId": 38471.0,
  "modName": "Guard Followers",
  "summary": "Adds a total of 9 followers, one from each hold, wearing their uniforms but no helmets. ",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center]\r<br />\r<br />\r<br />This mod was a request for a group of followers, one from each hold, wearing their uniforms but no helmets. Here are the finest soldiers each hold has to offer&#33;\r<br />\r<br />All of these people are essential and have skills on a particular weapon. They can be found right outside their hold capital&#39;s gates. The guards from holds lacking walls (like Falkreath) can be found outside their Jarl&#39;s residence.\r<br />\r<br />Here&#39;s the list of followers available:\r<br />\r<br />- Fralvia, an Imperial in Windhelm (Eastmarch hold), unique in the fact that I tried to make her a dual-wielder, currently has daggers.\r<br />- Tralen, a Redguard in Markarth (The Reach hold), uses warhammers.\r<br />- Ergnin, a Nord in Winterhold (Winterhold hold), uses greatswords.\r<br />- Ulfgard, a Nord in Solitude (Haafingar hold), uses battleaxes.\r<br />- Ernand, a Breton in Morthal (Hjaalmarch hold), uses war axes.\r<br />- Dandre, a Breton in Riften (The Rift hold), uses bows.\r<br />- Svogre, a Nord in Dawnstar (The Pale hold), uses swords.\r<br />- Iulus, an Imperial in Falkreath (Falkreath hold), uses bows.\r<br />- Alfhed, a Nord in Whiterun (Whiterun hold), uses maces.\r<br />\r<br />For some reason, while testing, the followers from Winterhold and Riften could cower in a corner if a dragon or any enemy appeared. I don&#39;t know why, since their aggression levels and everything else is set correctly. They will defend you and fight alongside you once you take them with you, however.\r<br />\r<br />To install, extract the contents of your downloaded file to your &#39;SteamSteamAppsCommonSkyrimData&#39; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp. Let me know if there are any problems&#33;\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "96",
  "version": "1.00",
  "author": "Jokerine",
  "createdUnix": "1374165054",
  "updatedUnix": "1374164981",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039528",
      "name": "Guard Followers v1",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1389",
      "fileName": "Guard Followers v1-38471-1-00.rar",
      "uploadedUnix": "1374164981",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/353f16c8a64473e664a39afcf4250bc538acba249f83debe32da11e870766ad1/analysis/1407648095/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guard%20Followers%20v1-38471-1-00.rar?fid=1000039528&ttl=1535818829&ri=8192&rs=8192&setec=356045d14b121462c773e38ab946db99"
    }
  ]
}