{
  "modId": 38476.0,
  "modName": "Summon This - Redux",
  "summary": "Summon an Undead Dragon (or two).",
  "descriptionHtml": "SUMMON THIS (Redux)\r\nBy:\r\nZYRIS\r\nJuly 19, 2013\r\n====================\r\nSo there you are roaming around Tamriel and come across a dragon. You chase it down, \r\nkill it and watch it burn. The only problem is….. it didn’t stay dead. And now he wants to fight beside you.\r\n====================\r\nThis is an updated version for my original “Summon This v1” mod. This file includes updates for Version 1 plus a second version which is listed below. These are two separate mods, both of which you can use at the same time if you wish.\r\n====================\r\nUpdate (July 27, 2013): For those who may interested I have released a more powerful version of this same dragon mod. Some may consider it over powered with it\\'s many more abilities. It can be found under the \\\"Cheats and God Items\\\" section of this site. Mod is titled: Summon This - Bad to the Bone.\r\n====================\r\nINSTALLATION:\r\nWindows 7 path:\r\nMy computer / Local Disk (c:) / Program Files (x86) / Steam / Steamapps / Common / Skyrim / Data\r\n====================\r\nSUMMON THIS v1a\r\n--------------------\r\nDragon’s Abilities:\r\n01) It will fly during combat\r\n02) Fire Breath\r\n03) Chaurus Poison Bite\r\n04) Flight speed increased to 100. Default was 80.\r\n\r\nI also gave it a type of flame effects to add to the coolness.\r\n\r\nThis is a full scale undead dragon. \r\nWhat started out to be a simple idea turned out to be a nightmare of a project. And since I \r\nhaven’t seen too many skeletal dragons I thought it would be cool give it a shot.\r\nTo learn this spell just pick up a note lying on the floor in Breezehome. You will find the \r\nnote just inside to the left as you enter. It will be laying on the floor between the cupboard \r\nand the table in the corner.\r\n\r\nThe summoned dragon will last for 2 minutes and the casting ability has a range of 500.\r\nThis mod will now work within the walls of the following closed cities:\r\n\r\n01) Markarth\r\n02) Riften\r\n03) Solitude\r\n04) Whiterun\r\n05) Windhelm\r\n\r\nKnown Issues: May not work inside buildings, caves, dungeons.\r\nAlso, because of his size he may get stuck in thick wooded areas. Just resummon him and you  should be fine.\r\nIf you find that you are unable to summon the dragon inside closed cities it may be because it does not have enough room to spawn.\r\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\r\nSUMMON THIS v2.0\r\n--------------------\r\nThis is the second version of my \\\"SUMMON THIS\\\" mod. With this version the dragon pretty much remains unchanged in regards to abilities and specs. With this version there is NO NEED to summon him. Thus you don\\'t have to hunt for a book or scroll to learn any spells or shouts. In this case all you have to is enter combat and he swoops down from \\\"The Throat of the World\\\" to join you. After the battle is over and all is clear he heads back home.\r\nIf you climb to the very highest peak of \\\"The Throat of the World\\\" you may find him laying  down on the rocks.\r\nAlso, with this version the dragon will enter closed cities and fight. So if you decide to beat up on Whiterun he\\'ll be right there with you.\r\n\r\nWith this version I gave the dragon it\\'s own REF. ID (from that of the one in v1).\r\nThus allowing you to use it with version one. With the two mods working together and the default \\\"Call Dragon\\\" shout you can have 3 dragons fighting for you at the same time. \r\nThis has been tested and found to be clear of conflicts.\r\n\r\nDragon’s Abilities:\r\n01) It will fly during combat\r\n02) Fire Breath\r\n03) Chaurus Poison Bite\r\n04) Flight speed increased to 100. Default was 80.\r\n05) Set as essential. Cannot be killed (v1.0 is not set as essential).\r\n06) I also gave it a type of flame effect to add to the coolness.\r\n\r\nKnown Issues: May not work inside buildings, caves, dungeons.",
  "categoryId": "65",
  "version": "Redux",
  "author": "Zyris",
  "createdUnix": "1374171086",
  "updatedUnix": "1374242163",
  "containsAdultContent": false,
  "uploadedBy": "Zyris",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039659",
      "name": "Summon This Redux",
      "version": "Redux",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "127",
      "fileName": "Summon This Redux-38476-Redux.zip",
      "uploadedUnix": "1374242163",
      "modVersion": "Redux",
      "virusScanUrl": "https://www.virustotal.com/file/bc7a8988fece3e626881c691894f2d872643d784f9443035d7d210084e49f923/analysis/1407649172/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20This%20Redux-38476-Redux.zip?fid=1000039659&ttl=1535818834&ri=8192&rs=8192&setec=df89c3a48c2a11b61c223708cdb9b17c"
    }
  ]
}