{
  "modId": 38484.0,
  "modName": "The Midden - Expanded",
  "summary": "A quality dungeon and house mod that greatly expands the College Midden, with minimal changes to existing areas. A new lore-friendly player home serves as a hub for new dungeons. Should be fully compatible with most mods; doesn&#39;t require dawnguard, hearthfire, or dragonborn dlcs. 100% compatible with Immersive College of Winterhold.",
  "descriptionHtml": "[size=4][b]Overview[/b][/size]\r<br />\r<br />A quality dungeon and house mod that greatly expands the College Midden, with minimal changes to existing areas. A new lore-friendly player home serves as a hub for new dungeons. Should be fully compatible with most mods; doesn&#39;t require Dawnguard, Hearthfire, or Dragonborn DLCs. 100% compatible with Immersive College of Winterhold&#33;\r<br />[b]\r<br />UPDATE:\r<br />[/b]\r<br />A new update has just been released for the Lite Version (v1.04A). This is a scriptless, compatibility version that also \r<br />forms the base for the SSE version of this mod. The v1.04 update for the main version (non-SSE) is also pending launch.\r<br />-ER 9/7/17\r<br />\r<br />____________________\r<br />[size=4][b]Highlights:\r<br />[/b][/size]\r<br />-Delve into immersive new dungeons beneath the College of Winterhold and the Sea of Ghosts\r<br />-Lore-friendly, and carefully integrated into existing areas, characters, and histories\r<br />-A new, upgradable player home for the aspiring conjurer, wayward student, and clandestine researcher in all of us&#33; \r<br />-Adds much more depth to the College of Winterhold, especially for those roleplaying a dark wizard or master of the dark arts\r<br />-Challenging gameplay (2.5-3 hours) that rewards exploration, puzzle-solving, and determination\r<br />-New, balanced weapons, armor, and spells\r<br />-Fully navmeshed, hand-cleaned, and polished with TES5Edit\r<br />\r<br />____________________\r<br />[size=4][b]Housing Features:[/b][/size]\r<br />\r<br />-Ample storage space (13 chests, 5 strongboxes, 1 safe, and many other containers)\r<br />-2 mannequins\r<br />-Cliff-side library/study space\r<br />-Alchemy nook\r<br />-Bedroom\r<br />-Crafting area\r<br />-Hatchery\r<br />-Enchanting cave (upgradable)\r<br />-Garden area (upgradable)\r<br />-Summoning circle (upgradable)\r<br />-Shrine area (upgradable)\r<br />-A custom-built &#39;&#39;Dwarven Transmuter&#39;&#39; that converts iron ingots to gold ingots using Dwarven oil (upgradable)\r<br />-Access to new dungeon areas, as well as the college midden\r<br />\r<br />Players can leave quickly by fast-travel, and return instantly using a custom Arcane Recall spell (works for followers as well)\r<br />\r<br />____________________\r<br />[size=4][b]v1.03 Patch Notes:[/b][/size]\r<br />\r<br />[b]I. Major overhaul/expansion of the Arcane Grotto player home[/b]\r<br />   -New and improved aesthetics   \r<br />   -NO CHANGES TO EXISTING CHESTS/CONTAINERS (so your loot should be safe)\r<br />   -The invisible walls have been removed; the entire cavern has been opened up for exploring&#33;\r<br />   -New and improved aesthetics\r<br />   -Added an enchanting cave at the waterline, accessible from a trapdoor in the new drains (near the dining area)\r<br />   -Added the ability to purchase home decorations and improvements from Nelacar upon completion of a short quest (&#34;Moving In&#34;), including:\r<br />                1. A smelter\r<br />                2. 3 different types of guards (Skeletons, Draugr, or Wraiths)\r<br />                3. A garden area \r<br />                4. Improvements to the enchanting cave\r<br />                5. Your own personal Acolyte (A new mage-follower)\r<br />                6. A summoning circle\r<br />                7. A customizable shrine, with different options depending on the players race/quest progress\r<br />[b]\r<br />II. NEW QUEST: Upgrading the Transmuter[/b]\r<br />   -Started by reading Drelas&#39; logbook, which can be found on a new table next to the transmuter\r<br />   -Delve into the lost Winterhold Astronomy Tower, a new dungeon beneath the Sea of Ghosts, in search of an artifact to augment the transmuter&#39;s    capabilities\r<br />   -The New dungeon is accessible through new areas in the Midden Depths\r<br />   -Once completed, will allow you  to transmute iron ore to gold ore without the need for Dwarven oil\r<br />[b]\r<br />III. Dungeon remodeling[/b]\r<br />   -The Arcane Grotto (major changes)\r<br />   -The Midden Depths (major changes)\r<br />   -The Icy Passage (minor changes)\r<br />   -The Hatchery (minor changes)\r<br />   -The Ruined Fane (secrets&#33;)\r<br />   -The Dark Passage (more secrets&#33;)\r<br /> \r<br />____________________\r<br />[b][size=4]Installation:[/size][/b]\r<br />\r<br />Manual installation should be very straight forward. Simply download the zip-file, extract the contents, and place the files &#34;middenexpanded.esp&#34; and &#34;middenexpanded.bsa&#34; into your Skyrim data folder. For Steam users, this can be found under the following path:\r<br />\r<br />Program Files (x86)SteamSteamAppscommonskyrimdata\r<br />\r<br />If you&#39;ve installed Skyrim through other means, than you might have to do some sleuthing on whatever drive it&#39;s installed on.\r<br />\r<br />\r<br />Installation with the Nexus Mod Manager should also be fairly straight forward, as the uploaded files consist of the standard .esp and .bsa files compressed in a .zip file. As I haven&#39;t installed this mod from NMM as-of publishing, I am assuming that it works fine unless told otherwise. So please, if this doesn&#39;t work, let me know so I can fix it&#33;\r<br />\r<br />This mod has been up and stable on the Steam Workshop for nearly a month now, so if all else fails you can play it that way.\r<br />\r<br />____________________\r<br />[size=4][b]User&#39;s Guide (SPOILER WARNING):[/b][/size]\r<br />\r<br />Personally, I recommend that the player (especially if they&#39;re looking for a new, immersive play-through) discover these areas on their own, but if you want to jump right in or need a little help, then please read on.\r<br />\r<br />If you poke around in Nelacar&#39;s room at the Inn, the Archmage&#39;s Quarters, or Phinis Gestor&#39;s room, you can find notes and an old history that will point you in the right direction. There are basically two routes to the Grotto, and you can take 1 or both of them depending on what best suits your play style.\r<br />\r<br /> Notes in Nelacar&#39;s room will point you in the direction of a cliff-side cave on the Winterhold side of the Great Divide. This area can be a bit tricky to find, so look around&#33; A running theme of this mod is &#39;&#39;exploration is fun&#39;&#39;, but if you feel otherwise, just walk the cliff-line to the RIGHT of the bridge (facing the college) and keep going until you see a set of footprints in the snow, leading to a platform with a lantern. From here, just follow the ladder down to the entrance of &#39;&#39;The Icy Passage.&#39;&#39; Inside, you&#39;ll have to navigate several dungeons to gain access to the Grotto. All of the dungeons--especially the Ruined Fane--are very free-form, in keeping with the non-linear layout of the original midden sections. However, these dungeons are not especially large, so it&#39;s very unlikely that you&#39;ll get lost. \r<br />\r<br />The Grotto can also be accessed more directly from the first area of the college midden. There&#39;s a pull-chain under some falling water under the overhang where the Draugr is. From there, you will have to enter the &#39;&#39;Dark Passage&#39;&#39;, and solve a difficult 4-pillar puzzle to gain entry to the Grotto itself. The solution to this puzzle is hidden in the pages of &#39;&#39;The Chronicles of Thingol,&#39;&#39; a copy of which can be obtained either from Phinis Gestor&#39;s bookshelf, or on a corpse in the second midden area (near the exit). Even then, there are still 4 possibilities for the solution: 3 Eagles and 1 Snake. Try all the combinations to find the right one. Again, this puzzle is made to be intentionally hard. I think it adds to the sense of achievement in the spirit of older, more challenging RPGs before the invention of the quest-compass.\r<br />\r<br />Before the Grotto is yours however, 1 obstacle remains. You must dethrone and defeat the current occupant--a conjurer named Drelas Var--in mortal combat before you can claim your new player home. Don&#39;t worry, it&#39;s totally worth it&#33; And there are still plenty of secrets hidden throughout the dungeons to find, so look carefully, and check for secret walls&#33;\r<br />\r<br />You will need to complete the new &#34;Moving In&#34; quest in order to purchase decorations for the Arcane Grotto. This quest is delivered by the courier, who will seek out the player in major cities after the player defeats Drelas Var. In saves where Drelas Var has already been killed, the quest can be triggered simply by returning to the Arcane Grotto.\r<br />\r<br />Upgrades to existing areas, including the Undergarden, the Enchanting Cave, and the Customizable Statue, can only be ordered from Nelacar once they have been discovered. If some parts of the purchased upgrades fail to appear (such as plants, lights, etc.), don&#39;t worry. This happens occasionally, and is merely a temporary graphics glitch. If you save you game and restart Skyrim, the objects will reappear when the cell is reloaded.\r<br />\r<br />____________________\r<br />And lastly, a word from the author:\r<br />\r<br />Many thanks to everyone who has subscribed to, Favorited, or played this mod&#33; This is my first-ever published mod, built entirely by myself using online tutorials and a great deal of trial-and-error. As of now, I regard this mod as more-or-less complete, but I will continue to add to it in the coming months to improve functionality, fix bugs, and add new content. Please feel free to send me any constructive comments, suggestions, or goodwill&#33; Also, if anyone wants to tinker around with this mod, feel free to do so--provided that you credit me if you publish your alterations. Basically, just play nice&#33;\r<br />\r<br />Special thanks are also in order for Barry Cogan (for his invaluable tutorial on puzzle-pillars), DarkFox127 (for his excellent tutorial on teleport spells), Skyrimnut (for troubleshooting), Porcubot (for his great upgrade suggestions), and the ever-helpful CreationKit Wiki&#33;\r<br />\r<br />-EasierRider",
  "categoryId": "91",
  "version": "v1.04A",
  "author": "EasierRider",
  "createdUnix": "1374190725",
  "updatedUnix": "1512176615",
  "containsAdultContent": false,
  "uploadedBy": "EasierRider",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093182",
      "name": "The Midden Expanded",
      "version": "v1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "655",
      "fileName": "The Midden Expanded-38484-v1-03.zip",
      "uploadedUnix": "1390596414",
      "modVersion": "v1.03",
      "virusScanUrl": "https://www.virustotal.com/file/f2f1a294250dec89a19e40b894e04ada90f6b240dba5b93b5c17195e51a84a75/analysis/1407900198/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Midden%20Expanded-38484-v1-03.zip?fid=1000093182&ttl=1535818847&ri=8192&rs=8192&setec=e7cd59c27c51e0587e95302e064e3c81"
    },
    {
      "fileId": "1000254126",
      "name": "The Midden Expanded - Lite Version v1.04A",
      "version": "v1.04A",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "611",
      "fileName": "The Midden Expanded - Lite Version v1.04A-38484-v1-04A.zip",
      "uploadedUnix": "1504833687",
      "modVersion": "v1.04A",
      "virusScanUrl": "https://www.virustotal.com/file/07cb0da2b34946cba132c41f956818baef1a8789e593ee22231c6f1d333f2ba5/analysis/1504833244/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Midden%20Expanded%20-%20Lite%20Version%20v1.04A-38484-v1-04A.zip?fid=1000254126&ttl=1535818847&ri=8192&rs=8192&setec=09dc11cf06c787eaf084864d5cfbc403"
    },
    {
      "fileId": "1000261035",
      "name": "The Midden Expanded - Lite Version v1.05A",
      "version": "v1.05A",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "611",
      "fileName": "The Midden Expanded - v1.05A.zip-38484-v1-05A.zip",
      "uploadedUnix": "1512176615",
      "modVersion": "v1.05A",
      "virusScanUrl": "https://www.virustotal.com/file/ae363bbe13d444498d799518ad29769e03173eab0ef00130cac8eb1cbe9e5690/analysis/1512176644/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Midden%20Expanded%20-%20v1.05A.zip-38484-v1-05A.zip?fid=1000261035&ttl=1535818847&ri=8192&rs=8192&setec=bd1fcbaa1c0ac459ef1bcff4973e9805"
    }
  ]
}