{
  "modId": 38513.0,
  "modName": "MEAP - Mass Effect Addon Pack",
  "summary": "As in title, ME&gt;Skyrim modpack, which contains the best (in my opinion) of ME. HELP NEEDED",
  "descriptionHtml": "&#33; === Please do not download. That&#39;s just a apha version. Any support would be appreciated and credited properly === &#33;\r<br />First and the most ambitious project for Skyrim of mine. My aim is to make a huge modpack including:\r<br />\r<br />Plans:\r<br /> - New race: Asari\r<br /> - Asari follower: Liara T&#39;Soni (propably to be found in some dwarwen ruins)\r<br /> - Asari city (Jarl: Aria T&#39;Loak)\r<br /> - New race: Turian\r<br /> - Turian follower: Garrus Vakarian (propably to be found making some &#34;criminal cleaning up&#34; in asari city)\r<br /> - Turian city (Jarl: Adrien Victus)\r<br /> - New materials:\r<br /> ? - Spectre arms alloy (used to make different materials, made of 1xSteel ingot 1xDwarwen metal ingot 1xOrhalzium ingot)\r<br /> ? - Spectre arms Silicon-Carbide projector (used to make Omni-Blade/Shield made of 2xSA alloy and 1xFawless diamond)\r<br /> ? - Spectre arms Hologram projector (used to make Omni-Blade/Shield made of 2xSA alloy, 1xF ruby, 1xF sapphire 1xF emerald)\r<br /> - New armors:\r<br /> ? - N7 armor (ME1/2/3)\r<br /> ? - Armax Arsenal armor (ME3)\r<br /> ? - Terminus armor (ME2/3)\r<br /> ? - Blood Dragons armor (ME2/3)\r<br /> ? - Cerberus Shadow armor (ME3)\r<br /> - New weapons/combat spells\r<br /> ? - Weapon: Omni-Blade (ME3)\r<br /> ? - Spell: Kinetic barrier (ME1/2/3)\r<br /> ? - Weapon: Omni-Shield (ME2 Shadow Broker&#39;s lair DLC)\r<br />\r<br />Additional plans (If I have enough time):\r<br /> - New race: Quarians\r<br /> - Quarian city (Jarl: Admiral Raan)\r<br /> - Quarian follower: Tali Zorah vas Rannoch\r<br /> - New race: Krogan\r<br /> - Krogan city (Jarl: Urdnot Wrex/Wreav configurable?) ???\r<br /> - Krogan follower: Grunt\r<br /> - Krogan follower: Wrex (If Wreav is the jarl) ???\r<br /> - New race: Salarian\r<br /> - Salarian city (Jarl: Dalatrass Linron)\r<br /> - Salarian follower: Mordin Solus\r<br /> - New race: Geth\r<br /> - Geth spacestation (Jarl: Consensus/Geth)\r<br /> - Geth follower: Geth Prime\r<br /> - New race: Drell (Won&#39;t introduce their race completely as there is not enough data on &#39;em, just for Drell follower purposes)\r<br /> - Drell follower Thane/Kolyat Krios (Configurable, for those who want to honor Thane&#39; wish to be in a better place, his son is available.)\r<br /> - Citadel with storyline and quests (Once all council races are completed)\r<br /> - Energy of universe shout (Replenishes your and your follower&#39;s stats and also used to activate the conduit; downside: loads a long time. You&#39;ll be able to get it by console or Citadel storyline)\r<br /> - Conduit (Teleport to the Citadel)\r<br /> - Additional storyline for Citadel allowing to get spectre status (As effect your crimes will always be ignored and you&#39;ll have the honor of becoming 3&#39;rd human spectre after Commander Shepard and Ashley Williams... Even if yo&#39;re an Orc)\r<br /> - New race: Keepers (After the citadel)\r<br /> - Keeper follower: Nameless/You can suggest the name (only if requested)\r<br /> - Human follower: James Vega\r<br /> - Human follower: Ashley Williams (Available only after finishing the Citadel Spectre storyline)\r<br /> - Human follower: Miranda Lawson\r<br /> - Human follower: Kaidan Allenko (Configurable? whether instead of Ashley) ???\r<br /> - Different governal structures in Space races (e.g. Primarch for Turians and Admirality board for Quarians)\r<br /> - HVP: High-Velocity Projectile weapons form ME2/3\r<br /> ? - Assault rifle: Collector Assault rifle\r<br /> ? - Sniper rifle: Black widow\r<br /> ? - Shotgun: Claymore\r<br /> ? - Heavy pistol: M-11 Suppressor\r<br /> - Voices for new races (Will require help on this one, a lot of help ;)\r<br /> - Worship of Council races (Because they come from space and stuff Vote in comments: YES/NO optionally: WHY?)\r<br /> - Renaming Dwarwes for Protheans (Vote in comments: YES/NO optionally: WHY?/Other sollution)\r<br /> - ME, ME2 and ME3 save processing to config (It would determine whether you have Ashley or Kaidan; Wrex or Wreav etc.)\r<br /> - Your idea might be here&#33;\r<br />\r<br />Already in progress:\r<br /> - Asari follower (Model textured, need an NPC model template though so it&#39;s not NIF ready)\r<br /> - Turian follower (Model textured, need an NPC model template though, not NIF ready)\r<br />\r<br />Done (For now I&#39;ll just make some placeholders but soon placeholders will be turned into standalone stuff):\r<br /> - Omni-Blade (Done, but has a texture problem)\r<br /> - Spectre Arms alloy (Made a working one with model and texture placeholder)\r<br /> - Spectre Arms Hologram/Silicon-Carbide projector (Made a working one with placeholder model and texture)\r<br /> - Made placeholders for following races:\r<br /> ? - Asari (Models / Textures)\r<br /> ? - Turian (Model / Textures)\r<br /> - Made complete races:\r<br /> ? - None so far :(\r<br />\r<br />Requirements:\r<br /> - The Elder Scrolls V: Skyrim (obviusly - for those who want only the models, just notify me and I&#39;ll give a link)\r<br /> - None. Trying to make this mod standalone. (Succes rate so far: 100%)\r<br />\r<br />Problems:\r<br /> - Lack of knowledge on how to prepare model from 3ds max to be imported to Skyrim\r<br /> - Lack of voice actors for following species (Sorted by urgency):\r<br /> ? - Asari (Female voice) &#33;&#33;&#33;\r<br /> ? - Turian (Male voice and female voice) &#33;&#33;&#33;\r<br /> ? - Quarian (Female voice and male voice) &#33;&#33;\r<br /> ? - Krogan (Strong male voice required and elderly female voice) &#33;\r<br /> ? - Geth (Here it&#39;s not really voice requirement but somebody with good microphone and sound editing experience, I can process these myself but I&#39;ve got plenty other things to do) &#33;\r<br /> - Minor problem: I made the ReadMe in notepad++ so in standard Windows notepad it looks like... a big mess. Open it with notepad++ if you have it.\r<br />\r<br />Most of models are not made by myself but exported from Mass Effect series games so I do not own or claim any legal right to &#39;em or the trilogy itself. However BIOware does allow to use their models without any legal problems.\r<br />\r<br />If you&#39;ve got nothing else to do and you&#39;d like to help me let me know and I&#39;ll add you to the editor&#39;s list.\r<br />\r<br />Sorry for my bad English. If you see any mistakes don&#39;t hesitate to notify me.",
  "categoryId": "24",
  "version": "0.1.1a",
  "author": "LeeJohnJunior",
  "createdUnix": "1374260191",
  "updatedUnix": "1374260191",
  "containsAdultContent": false,
  "uploadedBy": "leejohnjunior",
  "primaryFile": null,
  "files": []
}