{
  "modId": 38512.0,
  "modName": "BAD NEWS BEARS - 2K Enhanced Textures",
  "summary": "BAD NEWS BEARS - 2K Enhanced Textures replaces the three Skyrim default bear textures with enhanced versions of the Bethesda 2K textures. The clarity and depth of the textures have been enhanced, and the colors have been improved.",
  "descriptionHtml": "BAD NEWS BEARS - 2K Enhanced Textures replaces the three Skyrim default bear textures with enhanced versions of the Bethesda 2K textures.\r\n\r\nTwo things I learned in making this mod:\r\n\r\n1. The Bethesda hi-res textures are good quality.\r\n2. Bears do not like to have their picture taken.\r\n\r\n[URL=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/Bad-News-Bears-title.jpg.html][IMG]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/Bad-News-Bears-title.jpg~original[/IMG][/URL]\r\n\r\nThe bear textures in the Bethesda hi-resolution texture packs are well done, so there was no reason to reinvent the wheel, so to speak. The problem with the bear textures is the size of the mesh, not the lack of detail. Fur is probably the hardest texture to render realistically to begin with, and the bear is just a very big animal, so the textures end up looking blurry in-game. The default colors are also washed-out in the bear and cave bear, and grayed-out, in the case of the polar bear.\r\n\r\nWhat I\\'ve done is maximize the detail of the textures by increasing the clarity of the detail, and the depth of the textures... enhancing the normal map as well. The colors have also been improved, making the bear and cave bear richer and darker, while the polar bear is now whiter and brighter.\r\n\r\nWith the 3.1GB Ram hard cap with Skyrim, it didn\\'t make sense to make a bigger texture than the 2K version. I also didn\\'t want to make a retexture that only people with hi-end rigs could use. This version is optimized to keep the file size to a minimum, while getting the maximum in appearance.\r\n\r\nIt\\'s hard to appreciate the differences in screenshots, so I added a comparison picture of the Bethesda hi-res pack 2K polar bear texture next to my Bad News Bears 2K polar bear texture. Since the other two bears are fairly dark textures, it\\'s easier to illustrate the differences using the polar bear texture. The Bethesda 2k Textures are saved as DXT5, even though they have a simple \\\"knockout\\\" alpha layer. They don\\'t have transparency, so they are much bigger files than they need to be. My textures are 2K as well, but are only 1/2 the file size. Better detail and better performance is what my mod offers.\r\n\r\n[URL=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/2K-bear_comparision_small.jpg.html][IMG]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/2K-bear_comparision_small.jpg~original[/IMG][/URL]\r\n• See gallery pictures for larger version\r\n\r\n[URL=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/Installation.jpg.html][IMG]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/Installation.jpg~original[/IMG][/URL]\r\n1. Use NMM to download the textures and activate.\r\n2. Start the Skyrim Launcher and play.\r\n3. Enjoy!\r\n\r\nOR\r\n\r\n1. Use the manual download link, and extract the files to a temporary location.\r\n2. Copy file to your Skyrim Data folder. The file path is [C]Windows > Programs Files or Program Files (x86) > Steam > SteamApps > Common > Skyrim > Data > Textures > Actors > Bear\r\n3. If prompted to overwrite the textures select yes to overwrite the default textures.\r\n4. Start the Skyrim Launcher and play.\r\n5. Enjoy!\r\n\r\n\r\nUninstallation\r\n\r\nNMM users, just deactivate the file.\r\nManual installers, just delete (or overwrite) the bear_n.dds, bear.dds, bearcave.dds, and bearpolar.dds files.\r\n\r\n\r\nIncompatibility\r\n\r\nSince it\\'s just a simple texture replacement, it shouldn\\'t conflict with any mods that don\\'t change the default bear textures.\r\n\r\n\r\nCredits\r\n\r\nThanks to Bethesda for creating Skyrim, and making the high-resolution packs available, which these textures are based on.\r\n\r\nThanks to Nexus for providing an invaluable resource to mod authors. \r\n\r\nI hope everyone enjoys this mod as much as I enjoyed making it.",
  "categoryId": "83",
  "version": "Version1.1",
  "author": "Gamwich",
  "createdUnix": "1374276187",
  "updatedUnix": "1374452028",
  "containsAdultContent": false,
  "uploadedBy": "Gamwich",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039995",
      "name": "Bad News Bears",
      "version": "Version1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7530",
      "fileName": "Bad News Bears-38512-Version1-1.zip",
      "uploadedUnix": "1374452028",
      "modVersion": "Version1.1",
      "virusScanUrl": "https://www.virustotal.com/file/505c600146d185c18a8fe74b834d86760ac83cbcb90e98045e0ad0ff7809edea/analysis/1407651848/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bad%20News%20Bears-38512-Version1-1.zip?fid=1000039995&ttl=1535818885&ri=8192&rs=8192&setec=3990200dd84bd837fc64f95196a25872"
    }
  ]
}