{
  "modId": 38515.0,
  "modName": "Balbor and Steelsouls SkyRe ReProccer - SkyRe Spanish Translation Project",
  "summary": "ReProccer Stats.xml conteniendo datas e informacion para una integración mas correcta de un enorme número de Mods para el SkyRe",
  "descriptionHtml": "[center][img]http://skyrim.nexusmods.com/mods/images/38515-1-1374275237.png[/img][/center]\r\n\r\n[color=orange][SIZE=4][B]¿QUE ES ESTO?[/b][/Size]\r\n\r\n[SIZE=3]Esto es una actualización de varios elementos del ReProccer, empezando por el archivo stats.xml que regula la lectura de datos por parte del ReProccer, y que permite al ReProccer parchear correctamente un montón de Mods para poderlos jugar sin problemas con el SkyRe.[/Size][/color]\r\n\r\n\r\n[center][SIZE=4][B][color=orange]Hay tres cosas incluidas aquí[/b][/center][/color]\r\n\r\n1- [color=orange]El archivo stats.xml del ReProccer mejorado[/color], preparado para jugar con todo.\r\n\r\n2- [color=orange]Los complementos[/color], que ayudan a corregir aspectos en los que el ReProccer aún no es perfecto parcheando.\r\n\r\n3- [color=orange]Los Mods[/color], completa nombres, keywords e información general de los datos contenidos en los .esp de varios Mod para que sea mas fácil parchearlos y jugar con ellos.\r\n[color=orange]No te olvides de mirar en la seccion de descargas adicionales, hemos puesto algunos mods extra como Jaysus Swords y Fur Hoods[/color]\r\n\r\nTODO esto esta basado en el original, editado por BALBOR en [url=http://skyrim.nexusmods.com/mods/27092]Balbor and Steelsouls SkyRe ReProccer[/url], siendo esta de aqui la version en español de dicho Mod, con algunas sorpresas extras adicionales.\r\n\r\nVamos a verlos uno a uno[/SIZE]\r\n\r\n[Line]\r\n[SIZE=4][B][center][color=orange]REQUERIMIENTOS[/B][/color][/center][/size]\r\n\r\n\r\n[SIZE=3][color=orange][b]SKYRIM REDONE[/b][/color]\r\n\r\n[B]Mod Original Skyrim Redone: [/B][url=http://skyrim.nexusmods.com/mods/9286]Skyrim Redone[/url]\r\n\r\n[B]Su Traducción: [/B][url=http://skyrim.nexusmods.com/mods/24596]Skyrim Redone Español[/url]\r\n\r\n[B]Su parche: [/B][url=http://skyrim.nexusmods.com/mods/38177]Unofficial Skyrim Redone Patch Español[/url]\r\n\r\n\r\n[color=orange][b]REPROCCER[/b][/color]\r\n\r\nPara compatibilizar Armas, Armaduras y Proyectiles, el parcheador de Mod para jugar con el skyrim Redone lo puedes encontrar aquí:\r\n\r\n[B]Generador Automatico de Parche para Mods para el Skyrim Redone: [/B][url=http://skyrim.nexusmods.com/mods/28467]ReProccer – Automated Patch Generator[/url]\r\n\r\n[B]Su Traducción: [/B][url=http://skyrim.nexusmods.com/mods/28467]ReProccer – Generador automático de Parches en Español[/url]\r\n\r\n\r\n[color=orange][b]PROYECTO DE MEJORA DE COMPATIBILIDAD DE BALBOR[/b] (No es necesario descargarse el original, ya incluído)[/color]\r\n\r\n[B]Que es lo que tenemos en este Mod. Ha sido traducido y adaptado a partir del Mod original: [/B][url=http://skyrim.nexusmods.com/mods/27092]Proyecto de Balbor Original[/url] (no necesario descargartelo, todo esta incluído aquí)[/SIZE]\r\n\r\n[line]\r\n\r\n[center][img]http://skyrim.nexusmods.com/mods/images/34423-1-1365237793.png[/img][/center]\r\n[center][SIZE=4][color=orange]Si no sabes muy bien para que sirve y como se utiliza, tienes en la página del Generador Automatico de Parches - ReProccer en español [url=http://skyrim.nexusmods.com/mods/28467]Aquí[/url] y en ella hay una guía explicativa.[/center] \r\n[center]Usar el ReProccer es muy sencillo. Échale un vistazo, y cuando lo tengas instalado, vuelve.[/color][/SIZE][/center] \r\n\r\n[LINE]\r\n\r\n[center][SIZE=3][B]¡FIRMA LA PETICIÓN![/B][/SIZE]\r\n[url=http://skyrim.nexusmods.com/articles/1152/][img]http://oi45.tinypic.com/116svaf.jpg[/img][/url][/center]\r\n\r\n[LINE]\r\n\r\n[center][img]http://skyrim.nexusmods.com/mods/images/38515-1-1374277285.png[/img][/center]\r\n[SIZE=4][color=Orange]>>>STATS.XML [/color][/SIZE]\r\n\r\n[SIZE=3]Aquí lo que publicamos es la versión traducida de los COMPLEMENTOS que ha realizado Balbor (en su versión 3.7) para el ReProccer 2.2 y que deberían ayudar al ReProccer a reconocer y a funcionar al ReProccer con casi cualquier Mod correctamente (tanto en español como en inglés).\r\nBalbor ha revisado y perfeccionado su uso para todos estos Mods. [/size]\r\n\r\nOmegared099 Weapons\r\nOmegared099 Armor Compilation \r\nImmersive Armor V6 por Hothtrooper*\r\nImmersive Weapons 1.5 por Hothtrooper & Ironman5000*\r\nLOTR Weapons por Isilmeriel\r\nNicoroshi\\'s Weapons\r\nWeapon Variant Expansion\r\nARMONIZER Armors 2.3 por Ketaroz\r\nRandom Alternate Start por Syclonix\r\nDeadly Dragon Armory \r\nWinter Is Coming 2.3 Cloaks \r\nDragon Knight por Hothtrooper\r\nLustmord Vampire Armor por AmethystDeceiver SkyRe ReProccer Compatibility Patches\r\nCleric Armours of the Nine Devines\r\nJaysus Swords (Mejor usar el [url=http://skyrim.nexusmods.com/mods/26230]Parche de Sharlikran[/url] con el Mod original, el autor no lo ha actualizado en Eones)\r\nArise - Chapter 1 - The Black Sacrament por AmethystDeceiver\r\nScoiatael Weapons v3 por insaneplumber\r\nSilver Armor por Acolyte598\r\nLost Paladins of the Divines Wrath Armor por Jerros\r\nBucklers - Shields and Other Armours por VincentIcarus*\r\nAetherium Armor and Weapons Compilation By lautasantenni\r\nDragonbone Ebonsteel Armor por Dreogan\r\nDragonborn DLC\r\nStormcloak Explorer Armor por Frankdema and samv96UK\r\nScout Armor por DoODABoOM\r\nNordic Conqueror Armor por FrankDema\r\nSkaal heavy Armor Mod por TumbaJamba and DVAted\r\nTribunal Robes Mod - require [url=http://skyrim.nexusmods.com/mods/34095]Tribunal Robes Patch - Arreglos para la compatibilidad con el SkyRe Reproccer[/url]\r\n\r\n[size=3]Por supuesto, es para sus versiones en inglés, desafortunadamente no todos están traducidos al español (seguid leyendo más abajo, y os comento sobre sus traducciones), pero hemos revisado los términos más usados y podemos garantizar la compatibilidad completa de todos estos.\r\n ¡Disfrutadla!\r\n\r\nAun mas versiones con mas correcciones, abarcando otros Mods como el ASIS, el Mighty Magic, etc.. Podeis encontrarlo en la expansión de este proyecto en: [url=http://skyrim.nexusmods.com/mods/29375] Qotsafan - SkyRe ReProccer Compatibility Patches [/url][/size]\r\n?\r\n[LINE]\r\n\r\n\r\n[center][img]http://skyrim.nexusmods.com/mods/images/34423-1-1365454117.png[/img][/center]\r\n[SIZE=4][color=Orange]>>>COMPLEMENTOS [/color][/SIZE]\r\n\r\n[SIZE=4][B] [color=Orange] [u] Hay unas únicas pocas excepciones que sí que necesitan un parche especial [/u] para funcionar con el ReProccer, porque el ReProccer aún no es perfecto, en general no son fallos grandes, pero es recomendable usarlos para no tener problemas en la experiencia de juego. [/color] [/B][/SIZE]\r\n\r\n[SIZE=3][B] [color=Red] Hay dos parches internos que van [u]ANTES[/u] del reproccer.esp y que pueden (y deben) estar presentes mientras se parchea[/color] [/B]\r\nSkyRe_CraftingFix.esp que va después del SkyRe_main.esp\\'\r\nDragonbornArmorFix.esp que va después del Unofficial Dragonborn Patch[/SIZE]\r\n\r\n[SIZE=3][B] [color=Red] Parches internos que van [u]DESPUES[/u]  del reproccer.esp y que [u]no deben estar presentes o activados[/u] mientras se parchea[/color] [/B]\r\nReProccerNONPLAYERfix.esp  que va después Reproccer.esp\r\nReProccerDragonborn.esp que va después Reproccer.esp\r\n\r\nEstos pluggins NO deben estar activados mientras haces funcionar el ReProccer.esp (no vaya a ser que también te los parchee junto a todos los demás)\r\n\r\nLa forma mas sencilla de evitarlo es:\r\n\r\n[COLOR=YELLOW]Añade su nombre a la lista que encontraras en el archive [b]Blocklist.txt[/b], documento localizado en Data/SkyProc Patchers/T3nd0_ReProccer/Files folder, y así serán ignorados por el ReProccer y evitaras que sea parcheado por error.[/COLOR][/SIZE]\r\n\r\n\r\n\r\n[SIZE=5][CENTER]COMPLEMENTOS [/CENTER][/SIZE]\r\n[center][img]http://skyrim.nexusmods.com/mods/images/38515-1-1374268747.png[/img][/center]\r\n[u][b]¡INSTÁLALO SOLO SI TIENES DRAGONBORN DLC![/b][/u]\r\n\r\nPequeño mini-mod que arregla algunas armaduras del nuevo DLC.\r\nAñade recetas para templar la armadura Skaal\r\nAñade recetas para crear la armadura Skaal\r\nañade la palabra \\'Falx\\'  al set de armadura imperial que no es jugable.\r\nCambia la Keyword para la armadura del General Cario Armor\r\nAñade ArmorMaterial Keywords a las armaduras Nórdica y Stalhrim (versiones ligera y pesada)\r\n\r\n[u][b]DragonbornArmorFix.esp se coloca en el orden de carga tras el Unofficial Dragonborn Patch[/b][/u]\r\n\r\n[center][img]http://skyrim.nexusmods.com/mods/images/38515-2-1374268748.png[/img][/center]\r\nArregla problemas con las ballestas del Dawnguard y con azote de ortigas.\r\n\r\n[B]Este pluggin NO debe de ser importado cuando se genera el reproccer.esp,  así que para evitarlo, o bien desactívalo durante todo el proceso, o mejor añade su nombre a la lista que encontraras en el archive Blocklist.txt documento localizado en Data/SkyProc Patchers/T3nd0_ReProccer/Files folder, y así evitaras que sea parcheado por error.\r\n\r\nEl ReProccerNONPLAYERfix.esp debe colocarse en el orden de carga despues del Reproccer.esp [/B]\r\n\r\n[center][img]http://skyrim.nexusmods.com/mods/images/38515-1-1374271624.png[/img][/center]\r\nArregla las recetas de fundir armadura de Acero, botas de Shin, amadura vampírica, armaduras ligera y pesada de la guardia del alba, armadura de pieles, la capucha de Verdugo, etc..\r\n\r\nAñade las recetas de fabricación de la armadura del lobo para ser construida en la forja del cielo tras completar la quest de “La Mano de Plata”.\r\n\r\nAñade las recetas de fabricación de las armas de forja del cielo para ser construida en la forja del cielo tras completar la quest de “La Mano de Plata”.\r\n\r\nAñade las recetas para la armadura no-mágica del gremio de ladrones que puede ser fabricada en la forja del cielo tras la quest “Cuidar los Negocios” (Taking Care Businessnes)\r\n\r\nCambia la keyword de material de la armadura imperial de cuero tachonado por la de  ArmorMaterialImperialLight para que aparezca en la sección de armaduras imperiales en la forja y ahora ya posee la receta apropiada para ser fundida.\r\n\r\n[u][b]SkyRe_CraftingFix.esp debe situarse en el orden de carga después de  SkyRe_main.esp[/b][/u]\r\n\r\n\r\n[center][img]http://skyrim.nexusmods.com/mods/images/38515-4-1374268748.png[/img][/center]\r\nArregla los problemas causados por el ReProccer al parchear tales como valores de algunas Armaduras que son 0 y perdida de algunas texturas.\r\nArregla perdidas de texturas de las armaduras de Ahzidal y Dukaan\r\nArregla algunos problemas menores con las armaduras de Miraak\r\n-Úsalo solo si tienes instalado en DLC\r\n-Sitúalo en el orden de carga tras el ReProccer.esp\r\n\r\n[B]Este pluggin NO debe de ser importado cuando se genera el ReProccer.esp,  así que para evitarlo, o bien desactívalo durante todo el proceso, o mejor añade su nombre a la lista que encontraras en el archive Blocklist.txt documento localizado en Data/SkyProc Patchers/T3nd0_ReProccer/Files folder, y así evitaras que sea parcheado por error.\r\nEl Dragonbornfix.esp debe colocarse en el orden de carga despues del Reproccer.esp [/B]\r\n\r\n[Line]\r\n\r\n[center][img]http://skyrim.nexusmods.com/mods/images/38515-1-1374280041.png[/img][/center]\r\n[color=Orange][SIZE=4]>>>MODS [/SIZE]\r\n\r\n[SIZE=3][B]- Si quieres ayudar a tus Mods a ser mejor identificados, leídos, integrados y parcheados[/B][/SIZE][/color]\r\n\r\n[SIZE=2]Existe una cierta confusión sobre este punto. Lo primero que debéis de saber es que [u]TENÉIS que instalar los Mods originales[/u]. Y después sobre ellos aplicaremos estos complementos con los que sustituiremos una parte del contenido (Normalmente el pluggin.esp que venía con el mod original), por otro que cambia o arregla alguna cosa que otra. Son muy parecidos a los Mods originales.\r\n\r\n¿Por qué hacen falta?\r\n\r\nRecuerda, El ReProccer.jar es un Mini-Programa que lo que hace es leer ciertas palabras de la descripción del arma (p.ej espada élfica de cristal) y asignarle nuevos valores de juego en función de los materiales que tiene (en este caso: cristal) y del tipo de arma (espada) y la clase (élfica).\r\nEn estos otros Mods tales como p.ej el Immersive Armors, ya eran defectuosos en inglés porque no todas las armas llevaban completos sus datos, nombres o descripciones y el ReProccer.jar \\\"se pierde\\\" al intentar parchearlos. Así que las versiones que hay colgadas en la sección de descargas de esta página tienen – casi exactamente los mismo contenidos que los originales - de hecho se pueden usar tranquilamente sin el Skyrim Redone, y sin el ReProccer ni nada, y sólo se diferencian en que tienen modificados algunos datos que hacen más fácil para el ReProccer identificar los objetos (Excepción es el Immersive Weapons, del que se han retirado algunas armas del Heavy Armory porque ya estaban incluidas en el SkyRe y para evitar duplicidades). En pocas palabras aunque “hubo un tiempo” en que era necesario tener parches “especiales”, estos NO son parches como tales sino solo pequeñas modificaciones del original así que no os confundáis. Son casi iguales a los originales pero un poco mejorados incluyendo datos que les faltaban, por lo tanto, INSTALARLOS POR SI SOLOS NO TE PARCHEA EL JUEGO NI SUS DATOS PARA EL SKYRE.\r\nESO SI, SON ALTAMENTE RECOMENDABLES. Son una ayudita para el ReProccer.\r\n\r\n[B]Necesitareis las carpetas de los Mods originales (Meshes, Textures o Bsa).[/b]\r\n\r\nAquí vamos a integrar 4 de ellos (y dos mas que ponemos en la seccion de opcionales), lo que ves contenido aquí está basado en el trabajo que ya han hecho otros traductores, por tanto, aunque NO necesitas descargarte nada más excepto el MOD ORIGINAL porque las traducciones ya viene incluidas aquí, les incluyo con links porque su trabajo merece el crédito apropiado.\r\n¡Gracias chicos por permitirme incluir y modificar vuestro trabajo![/SIZE]\r\n\r\n[SIZE=3]NECESITAS EL MOD ORIGINAL PERO NO LA TRADUCCION\r\n\r\n[color=orange]Immersive Armors [/color][url=http://skyrim.nexusmods.com/mods/19733]Original[/url] por hothtrooper44 - Traducción (no necesitas descargarla, Ya incluida aquí) [url=http://skyrim.nexusmods.com/mods/28467]Traducción por Gardion[/url]\r\n[color=orange]Immersive Weapons [/color][url=http://skyrim.nexusmods.com/mods/ 27644]Original[/url] por hothtrooper44 - Traducción (no necesitas descargarla, Ya incluida aquí) [url=http://skyrim.nexusmods.com/mods/ 34933]Traducción por xlwarrior[/url]\r\n[color=orange]Armonizer Armor Pack [/color][url=http://skyrim.nexusmods.com/mods/27028]Original[/url] por Ketaroz - Traducción (no necesitas descargarla, Ya incluida aquí) [url=http://skyrim.nexusmods.com/mods/33549]Traducción por Rehims [/url]\r\n[color=orange]Wanderer Cuirass [/color][url=http://skyrim.nexusmods.com/mods/ 29815]Original[/url] por FrankDema and Cabal120\r\n\r\n\r\nNo pertenecientes directamente a este proyecto pero incluidos en descargas opcionales:\r\n\r\n[color=orange]Jaysus Swords[/color][url=http://skyrim.nexusmods.com/mods/ 1002]Original[/url] por jaysus - Traducción (no necesitas descargarla, Ya incluida aquí) [url=http://skyrim.nexusmods.com/mods/ 11819]Traducción por tonnyhammet [/url]\r\n[color=orange]Fur Hoods [/color][url=http://skyrim.nexusmods.com/mods/ 3201]Original[/url] por Northborn - Traducción (no necesitas descargarla, Ya incluida aquí) [url=http://skyrim.nexusmods.com/mods/ 14518]Traducción por Obla[/url][/SIZe]\r\n\r\n\r\n\r\n[SIZE=5][CENTER]MODS – NO INSTALAR A MENOS QUE ESTES USANDO ESTOS MODS[/CENTER][/SIZE]\r\n\r\n \r\n[center][img]http://skyrim.nexusmods.com/mods/images/38515-5-1374268748.png[/img][/center]\r\nUso únicamente para el Immersive Weapons 1.5\r\nInstala el Mod completo de manera normal. Reemplaza el .esp que viene con el Mod por este otro.\r\nEste es una versión editada:\r\nHa eliminado las armas del WOT3E. \r\nElimina armas duplicadas (como el heavy armory, ya incluida en el skyre)\r\nCambia las espadas larga de dos manos a espadas bastardas.\r\nSe han cambiado algunas palabras y modificado varios nombres.\r\n\r\n \r\n[center][img]http://skyrim.nexusmods.com/mods/images/38515-1-1374268792.png[/img][/center]\r\nUso únicamente para el Immersive Armors 6\r\nInstala el Mod completo de manera normal. Reemplaza el .esp que viene con el Mod por este otro.\r\nContiene arreglos diversos, añade materialkeywords y cambia algunos nombres.\r\n\r\nDebido al modo en que el ReProccer genera los nuevos valores de juego de las armaduras, los nombres de algunas armaduras han tenido que ser ligeramente alterados. Este “esp alternativo” no cambia nada más excepto algunos aspectos menores de las armaduras, algunas armaduras que no podían ser vendidas (como la armadura de guardia rojo y las piezas del set de la armadura del vagabundo). No cambia los valores de armadura, eso es algo que ya hará el Reproccer por ti. Incluso aquellos que no estén utilizando el ReProccer, pueden reemplazar el hothtrooper44_ArmorCompilation.espoficial por este otro modificado sin ningún problema y sin notar ningún cambio aparente en el juego. \r\nAñade \\'ArmorMaterial\\' keyword para todas las armaduras para permitir al ReProccer manejarlas correctamente – Todas las armaduras aparecerán en la forja bajo el epígrafe de ARMADURAS AUXILIARES.\r\nRenombra múltiples armaduras para evitar conflictos y confusiones en su clasificación.\r\n\r\nWarchielf Armour (Light & Heavy) Require Orc Smithing\r\nViking Armour (Light & Heavy) Require Steel Smithing\r\nRedguard Armour (Light & Heavy) Require Elven Smithing\r\nEinherjar Armour (Light & Heavy) Require Advanced Smithing\r\n\r\n \r\n[center][img]http://skyrim.nexusmods.com/mods/images/38515-2-1374268793.png[/img][/center]\r\nUso únicamente para el Wanderer Cuirass 1\r\nInstala el Mod completo de manera normal. Reemplaza el .esp que viene con el Mod por este otro. Este únicamente reemplaza el .esp por otra versión del mismo editada que cambia los nombres de la armadura y añade las recetas de fabricación para que encajen con el SkyRe. Wanderer Cuirass v1\r\n\r\n \r\n[center][img]http://skyrim.nexusmods.com/mods/images/38515-3-1374268793.png[/img][/center]\r\nUso únicamente para el 2.3\r\nInstala el Mod completo de manera normal. Reemplaza el .esp que viene con el Mod por este otro.\r\nReemplaza el Ket_ARMONIZER_v2.esm y el Ket_ARMONIZER_LListsNPC.esp por una version editada que cambia los nombres de algunas armaduras, y las añade a las leveled lists para que sea más compatible con otros Mods de armaduras. For ARMONIZER Armors Pack v2.3 \r\nEdita NPC Leveled lists y elimina algunos Outfits para hacerlos mas compatible con otros mods, incluyendo el Immersive Armors, funciona estupendamente incluso aunque no estes usando el Skyre. \r\nCambia la categoría de armadura imperial real a la de ArmorMaterialLightImperial\r\nCambia la categoría de las armaduras de hueso de troll a la de ArmorMaterialSteel\r\n\r\n\r\n[img]http://skyrim.nexusmods.com/mods/images/38515-1-1374281396.png[/img]\r\nComprueba la seccion de descargas opcionales para otros Mods ajustados al Reproccer (de momento Jaysus y Fur Hoods)\r\n\r\n[line]\r\n\r\n[SIZE=4][color=orange][B]CREDITOS[/b][/color]\r\n\r\nCreditos para todos los autores y traductores de los Mods\r\nGracias especialmente a BALBOR y STEELSOULS, podeis encontrar su trabajo original [url=http://skyrim.nexusmods.com/mods/27092]Proyecto de Balbor Original[/url]\r\nSi te ha gustado, visita su página y endorsale por su trabajo\r\n\r\nA todos los compañeros y compañeras del Nexus, por su apoyo\r\n\r\nA ti, por jugarlo. [/Size]\r\n\r\n",
  "categoryId": "79",
  "version": "3.7",
  "author": "Balbor and Steelsouls traducido por Khamuy",
  "createdUnix": "1374307806",
  "updatedUnix": "1376517179",
  "containsAdultContent": false,
  "uploadedBy": "khamuy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039763",
      "name": "Balbor-and-Steelsouls ReProccer Patch V3_7 - Spanish Project",
      "version": "3.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "259",
      "fileName": "Balbor-and-Steelsouls ReProccer Patch V3_7 - Spanish Project-38515-3-7.rar",
      "uploadedUnix": "1374306900",
      "modVersion": "3.7",
      "virusScanUrl": "https://www.virustotal.com/file/328910abf65aba2ed570a4cc78474484c60460113dd600b0dd6918622b0dd203/analysis/1407650057/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balbor-and-Steelsouls%20ReProccer%20Patch%20V3_7%20-%20Spanish%20Project-38515-3-7.rar?fid=1000039763&ttl=1535818892&ri=8192&rs=8192&setec=83036bd4877cec0a9be461514513bfe7"
    },
    {
      "fileId": "1000039764",
      "name": "Balbor-and-Steelsouls ReProccer Patch V3_7E1 - Spanish Project - EXPANDED",
      "version": "3.7E1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "281",
      "fileName": "Balbor-and-Steelsouls ReProccer Patch V3_7 - Spanish Project - EXPANDED-38515-3-7E1.rar",
      "uploadedUnix": "1374307049",
      "modVersion": "3.7E1",
      "virusScanUrl": "https://www.virustotal.com/file/2e9ff13a546d261694fad711031f5aee19ed586947f1e5cae70d7390b4a99ed1/analysis/1407650058/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balbor-and-Steelsouls%20ReProccer%20Patch%20V3_7%20-%20Spanish%20Project%20-%20EXPANDED-38515-3-7E1.rar?fid=1000039764&ttl=1535818892&ri=8192&rs=8192&setec=fab9d1c2347312e5b760d6f3b333a678"
    },
    {
      "fileId": "1000046968",
      "name": "Balbor-and-Steelsouls ReProccer Patch V3_7 - Spanish Project - Update",
      "version": "3.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "259",
      "fileName": "Balbor-and-Steelsouls ReProccer Patch V3_7 - Spanish Project - Update-38515-3-7.rar",
      "uploadedUnix": "1376517118",
      "modVersion": "3.7",
      "virusScanUrl": "https://www.virustotal.com/file/e3226ae020971751e042950b567e827419395b5c00b1f15ac16271ff07578d81/analysis/1407682146/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balbor-and-Steelsouls%20ReProccer%20Patch%20V3_7%20-%20Spanish%20Project%20-%20Update-38515-3-7.rar?fid=1000046968&ttl=1535818893&ri=8192&rs=8192&setec=30466bcab69899ca3821e0e97b3fca6b"
    },
    {
      "fileId": "1000046969",
      "name": "Balbor-and-Steelsouls ReProccer Patch V3_7E1 - Spanish Project - EXPANDED - Updated",
      "version": "3.7E1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "281",
      "fileName": "Balbor-and-Steelsouls ReProccer Patch V3_7E1 - Spanish Project - EXPANDED - Updated-38515-3-7E1.rar",
      "uploadedUnix": "1376517179",
      "modVersion": "3.7E1",
      "virusScanUrl": "https://www.virustotal.com/file/2e9ff13a546d261694fad711031f5aee19ed586947f1e5cae70d7390b4a99ed1/analysis/1407682146/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balbor-and-Steelsouls%20ReProccer%20Patch%20V3_7E1%20-%20Spanish%20Project%20-%20EXPANDED%20-%20Updated-38515-3-7E1.rar?fid=1000046969&ttl=1535818893&ri=8192&rs=8192&setec=654486e23562069fe9bdd28e51719ecd"
    }
  ]
}