{
  "modId": 38517.0,
  "modName": "Tienda de Alquimia mas entrenador maestro",
  "summary": "Tienda de Alquima en Cauce Boscoso con un entrenador Maestro de alquimia y otro de Arqueria",
  "descriptionHtml": "100% Español, no tendria porque tener ningun objeto en Ingles ni ninguna zona de skyrim en ingles (como me a sucedido con varios MODs.)\r\n\r\nPequeña tienda de alquimia en Cauce Boscoso situada justo detrás de el Gigante Dormido.\r\nCuenta con una Maestra de Alquimia ( ya no tienes que unirte a la Hermandad Oscura para poder tener un entrenador Maestro en alquimia) y con su hija, una exploradora Maestra en Arqueria.\r\n\r\nLa hija también puede usarse como seguidor, el diario de la hija puede ayudarte a mejorar tu habilidad alquímica, solo tienes que investigar un poco.\r\n\r\nEn la puerta de la tienda encontraras un pequeño jardín con ingredientes de alquimia. Dentro de la tienda hay varios libros para aumentar la habilidad de alquimia.\r\n\r\nLos NPCs (madre e hija) no son personajes estáticos, la madre por las tardes se dedica a crear pociones mientras su hija cuida del jardín y recolecta ingredientes. Puedes encontrarte a la hija todas las noches en la taberna :P\r\n\r\nLa puerta de la tienda funciona correctamente, se cierra por las noches y se abre por la mañana. Tus seguidores o NPCs pueden entrar a la tienda sin ningún problema.\r\n\r\nNo tienes porque tener problemas pero si encontráis alguno dejar comentario.\r\n\r\nEspero que os guste.",
  "categoryId": "69",
  "version": "1.0",
  "author": "FerayFY",
  "createdUnix": "1374270598",
  "updatedUnix": "1374270589",
  "containsAdultContent": false,
  "uploadedBy": "ferayfy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039713",
      "name": "Tienda Alquimica",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "97",
      "fileName": "Tienda Alquimica-38517-1-0.rar",
      "uploadedUnix": "1374270589",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/12bbde2b1566fd73e5331a91971d6c10f63df31bb92ae9b5145a50fa3bc696c9/analysis/1407649630/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tienda%20Alquimica-38517-1-0.rar?fid=1000039713&ttl=1535818896&ri=8192&rs=8192&setec=f9140d4fa23b5bbce66ba5e4e6a0c153"
    }
  ]
}