{
  "modId": 38521.0,
  "modName": "Enhanced Skyrim Followers - Aela the Huntress - German",
  "summary": "German Translation of ESF - Aela the Huntress\r<br />\r<br />ESF: Aela ist ein Projekt um Aela der Jaegerin von den Gefaehrten Storyinhalte und neue Begleiter-Funktionen hinzuzufuegen. Der Mod beginnt nach Beendigung der Standard-Questreihe der Gefaehrten.",
  "descriptionHtml": "[color=SpringGreen]Enhanced Skyrim Followers: Aela the Huntress V 0.4.7 von DreamKingMods[/color]\r<br />\r<br />This is only a German translation&#33;\r<br />The original mod can be found here: [url=http://skyrim.nexusmods.com/mods/11450/]Enhanced Skyrim Followers - Aela the Huntress[/url]\r<br />\r<br />ESF: Aela ist ein Projekt um Aela der Jägerin von den Gefährten neue Storyinhalte und Begleiter-Funktionen hinzuzufügen. Der Mod beginnt nach Beendigung der Standard-Questreihe der Gefährten.\r<br />\r<br />Bitte beachtet, dass das kein Adult Mod, aber auch nicht für Kinder gedacht ist, da er Anspielungen auf Sex und Gewalt enthält.\r<br />\r<br />[color=SpringGreen]Hinweise:[/color]\r<br />Wenn euch Aela gefällt vergesst nicht den Original Mod zu bewerten. :)\r<br />Aela ist noch nicht abgeschlossen. Zur Zeit arbeitet der Autor an einer Romanze-Option inklusive Heirat.\r<br />\r<br />[color=SpringGreen]Benötigt:[/color]\r<br />Skyrim V 1.9 oder höher\r<br />Den Original Mod ESF: Aela the Huntress V 0.4.7\r<br />\r<br />[color=SpringGreen]Installation:[/color]\r<br />Wenn ihr bereits mitten im Spiel seid müssen folgende Voraussetzungen gegeben sein um die neue Aela anzuheuern:\r<br />1. Aela begleitet euch nicht. Falls doch, müsst ihr sie feuern bevor ihr den Mod installiert.\r<br />2. Aela ist nicht euer Eheweib.\r<br />3. Aela wurde nicht bei den Klingen eingeführt.\r<br />4. Aela ist keine Verwalterin (Hearthfire).\r<br />\r<br />Dieser Mod ist mit Wrye Bash (Bain Mod-Installer) und dem Nexus Mod Manager kompatibel.\r<br />Wenn ihr lieber manuell installieren wollt, entpackt das Archiv und kopiert eine der beiden ESFAela.esp, die ESFAela.bsa (vom Original-Mod) und den Scripts Ordner in euren SkyrimData Ordner.\r<br />\r<br />[color=SpringGreen]Empfohlene Mods:[/color]\r<br />[url=http://skyrim.nexusmods.com/mods/22650]Enhanced Skyrim Factions - The Companions Guild[/url]\r<br />\r<br />Um die Gefährten-Questreihe zu bestehen und Herold zu werden müsst ihr erst neue Missionen bewältigen, passende Kampffertigkeiten erlangen, usw.\r<br />\r<br />[line]\r<br />\r<br />[size=4][color=SpringGreen]Kurze Übersicht[/color][/size] (in der Anleitung im Download findet ihr eine genauere Beschreibung)\r<br />\r<br />* Änderungen:\r<br />- Aela wurde vom Standard-Begleitersystem entfernt, das bedeutet unter anderem, dass ihr sie zusätzlich zu einem anderen (Standardbegleiter) mitnehmen könnt.\r<br />- Sie wurde ebenfalls als mögliche Heiratskandidatin entfernt (für den Moment, für zukünftige Versionen ist eine erweiterte Romanze/Heirat Option geplant).\r<br />- Sie hat nun sowohl ein griffbereites Ausrüstungsinventar (alles was sie am Körper trägt) und einen Beutesack in dem die Dinge sind die sie tragen, aber nicht benutzen soll. Die Kapazität des Beutesacks ist mit SkyUI MCM einstellbar.\r<br />- Sie hat eine realistische Reihe von mittleren Perks in leichter Rüstung, Bogenschießen und Schleichen, einschließlich Leichtfüßigkeit, so dass sie nie Fallen auslösen wird.\r<br />- Ihre Statistiken (Gesundheit und Fertigkeiten) werden nun mit eurem Spielcharakter bis maximal 9999 steigen.\r<br />- Sie hat eine eigene Klasse um Probleme mit Mods wie dem Unofficial Skyrim Patch zu vermeiden, der unter anderem ihre Klassen-Fertigkeiten ändert.\r<br />- Sie sollte durch Aktionen die ihr als Werwolf durchführt nicht länger feindlich werden.\r<br />- Sie hat eine &#34;Warp&#34; Funktion die ihre Geschwindigkeit um 2.5x erhöht wenn sie zu weit zurückbleibt, und eine Teleportfunktion die sie zu euch bringt falls sie wirklich einmal verloren gehen sollte.\r<br />- Wenn ihr stehen bleibt wird sie ein ähnliches Wanderverhalten wie Serana aus Dawnguard annehmen, aber nur in Städten, und nur wenn ihr nicht gerade schleicht oder die Waffe gezogen habt. Das kann per Dialog ein- und ausgeschaltet werden.\r<br />- Der ständig wiederkehrende Jagdbogen und der endlose Vorrat an Pfeilen wie bei den Standard-Begleitern ist nun vorbei. Das bedeutet natürlich auch, dass ihr sie jetzt mit Pfeilen versorgen müsst.\r<br />- Sie setzt sich, wenn ihr sitzt (sie wird sich dort wo sie gerade steht, den nächsten Stuhl oder Bank aussuchen).\r<br />\r<br />* Respekt\r<br />Bevor Aela bestimmte Dinge für euch tun wird, müsst ihr euch erst ihren Respekt verdienen. Den Respekt verdient ihr euch durch glorreiche Siege im Kampf, die Erforschung von Himmelsrand, und das Erfüllen von Missionen. Allerdings nur wenn Aela euch dabei begleitet... Siege die ihr erringt während sie nicht dabei ist zählen nicht.\r<br />Ihr könnt außerdem Respekt verlieren wenn ihr zuviel Interesse am Lernen von neuen Zaubern zeigt oder Verbrechen begeht während Aela in eurer Begleitung ist. Oder wenn ihr sie bittet auf euch zu warten und dann zu lange nicht zu ihr zurückkehrt. Natürlich kann ihr Respekt auch steigen oder sinken je nachdem wie ihr mit ihr sprecht.\r<br />\r<br />* Erweiterte Dialoge\r<br />\r<br />ESF: Aela verfügt ab V 0.4.7 über 1.000 Zeilen neuer Dialoge. Diese beinhalten:\r<br />\r<br />- Neue, situationsabhängige Begrüßungen und Verabschiedungen (Sprachausgabe).\r<br />- Neue und erweiterte situationsabhängige Kommentare wenn ihr auf Dungeons stoßt, nach dem Kampf, usw. (Sprachausgabe).\r<br />- Ihr könnt nun Aela über eine Vielzahl von Themen fragen (teilweise mit und ohne Sprachausgabe). Allerdings ist sie niemand der sich besonders gerne unterhält...sie wird es bald leid eure Fragen zu beantworten. Sobald sie aber erst mehr Respekt vor euch hat, könnt ihr sie über mehr Themen pro Tag fragen.\r<br />- Neue Kommentare und erweiterte Gespräche über verschiedene Spielmissionen, Orte und Situationen (hauptsächlich ohne Sprachausgabe).\r<br />\r<br />Wenn Aela ein Gespräch beginnt bedeutet das, dass sie mit euch über aktuelle oder jüngste Ereignisse sprechen will. Bitte blockt diese Gespräche nicht per TAB ab (außer natürlich ihr werdet gerade angegriffen). Dieser Punkt des Mods ist noch in Arbeit, und bisher gibt es nur einen kleinen Teil von dem, was geplant ist. Versucht die &#34;Schicksalstreffen im Mondschein&#34; Mission in Falkenring mit Aela in Begleitung als Beispiel dafür, was der Autor mit diesen Gesprächen beabsichtigt.\r<br />\r<br />Ihr müsst die Dialog- und die Sonstigen Untertitel einschalten (Einstellungen/Anzeige) um die unvertonten Dialoge lesen zu können. Der Autor plant alle neuen Dialoge zu vertonen, aber das wird Zeit brauchen.\r<br />\r<br />* Erweiterte taktische Möglichkeiten\r<br />\r<br />- Ihr könnt ihr sagen, dass sie nur Fernkampfwaffen, nur Nahkampfwaffen, selbst entscheiden (Standard), oder eurem Beispiel folgen soll.\r<br />- Sie kann selbstständig angreifen (Standard), nur nachdem sie oder der Spieler getroffen wurde (gut wenn man schleichen will), oder niemals angreifen (wovon sie überhaupt nicht begeistert ist ;)\r<br />- Entscheidet ob sie während des Reitens Kämpfe ignorieren soll, oder absteigen um zu kämpfen.\r<br />- Sagt ihr in welchem Abstand sie euch folgen soll. Gering (Standard), mittel oder groß.\r<br />- Stellt sie als unsterblich (essential) ein. Beachtet dabei, dass es einige Missionen gibt in denen sie automatisch als unsterblich eingestuft wird. Wenn sie sterblich ist kann sie Heiltränke in ihrem Gepäck benutzen (Ausrüstungsinventar, nicht der Beutesack).\r<br />- Sie kann selbstständig Fackeln benutzen wenn es dunkel wird (Spiel-Standard), bei Dunkelheit außer beim schleichen (Mod-Standard), nur wenn ihr eine Fackel benutzt, oder nur wenn ihr es sagt.\r<br />\r<br />* Wolfsgestalt\r<br />\r<br />- Standardmäßig benutzt Aela ihre Tierform wenn ihr eure benutzt, vorausgesetzt natürlich ihr seid ein Werwolf. Sobald sie euch genügend respektiert könnt ihr ihr auch sagen, dass sie das nicht tun soll.\r<br />- Ihr könnt Aela mit der Kraft &#34;Aela-Anweisungen&#34; jederzeit befehlen ihre Wolfsgestalt anzunehmen (das müsst ihr ihr vorher im Dialogthema &#34;Kampftaktik&#34; sagen). Sie wird aber nur damit einverstanden sein wenn ihr weit genug von der Zivilisation entfernt seid. Sobald sie sich verwandelt hat wird sie eine Stunde Spielzeit in ihrer Tiergestalt bleiben.\r<br />- In Dungeons wie Ruinen, Höhlen, usw., wird sie sich auch von selbst verwandeln wenn sie schwer verletzt wird (wenn ihre Gesundheit unter 33% fällt). Auch hier könnt ihr ihr sagen, dass sie das nicht tun soll, sobald sie genügend Respekt vor euch hat.\r<br />- Während ihrer Verwandlung regeneriert sich ihre Gesundheit. Der Standard ist 2 Gesundheitspunkte pro Sekunde, ihr könnt das mit SkyUI MCM ändern oder auch ausschalten.\r<br />- So wie ihr kann sich Aela nur einmal in 24 Stunden verwandeln, außer ihr findet eine Möglichkeit diese Begrenzung zu erhöhen...\r<br />- Schnellreise, Gespräche, und die meisten &#34;Aela-Anweisungen&#34; sind nicht verfügbar während Aela in ihrer Tiergestalt ist (ihr könnt ihr aber immer noch sagen, dass sie warten soll).\r<br />\r<br />* Kleidung und Ausrüstung\r<br />\r<br />- Aela hat nun drei verschiedene Ausstattungen, Kampf, Reisen & Erkundungen, und Stadt. Wenn sie mehr Respekt vor euch hat, könnt ihr ihr mit dem Dialogthema &#34;Unsere Reise&#34; für diese Anlässe die passenden Kleidungen geben. Ihr könnt ihr sagen, dass sie die Ausstattung selbst je nach Anlass ändern soll, oder nur wenn ihr es sagt. Wenn ihr ihr bessere Rüstungen in ihr Ausrüstungsinventar (da wo auch ihre Waffen sind) gebt, als ihr ihr bei der Ausstattung zugewiesen habt, wird die Rüstung aus der Ausstattung überschrieben und stattdessen die neue verwendet.\r<br />- Ihr müsst ihr aber nicht alle drei Ausstattungen zuweisen. Ihr könnt ihr z.B. nur Kampf und Stadtkleidung geben, und sie wird dann während Erkundungen ihre Kampfkleidung tragen.\r<br />- Aela wird sich weigern Elfenausrüstung zu verwenden... (denkt an die Geschichte der Gefährten, ganz zu schweigen von den Ereignissen in Tamriel) Sie wird auch alle schweren Rüstungen und Zweihand-Nahkampfwaffen ablehnen, da diese nicht ihren Fertigkeiten entsprechen.\r<br />- Aus diesem Grund ist ihre Standard-Kampfkleidung jetzt eine &#34;Leichtversion&#34; der alten Nordrüstung. Und um ehrlich zu sein, ihre Rüstung sieht auch nicht wirklich wie eine schwere Vollrüstung aus, oder?\r<br />\r<br />* Teleportation und Standort\r<br />\r<br />- Standardmäßig wird sich Aela zu euch teleportieren wenn sie zu weit zurückbleibt. Ihr könnt das im Dialogthema &#34;Unsere Reise&#34; ändern, was vor einigen Missionen durchaus ratsam wäre.\r<br />- Falls Aela verloren gehen sollte während ihre Teleport-Funktion ausgeschaltet ist, oder wenn ihr sie braucht während sie irgendwo auf euch wartet, könnt ihr den &#34;Ring des Blutrufs&#34; benutzen (falls sie ihn euch noch nicht gegeben hat sollte er in ihrem Inventar sein) um sie auf Kosten von 20 Gesundheitspunkten zu euch zu teleportieren. Wenn ihr ein Werwolf seid könnt ihr euch mit dem Ring auch zu Aela teleportieren.\r<br />- Wenn ihr den Ring ansteckt und wieder abnehmt ohne euch/Aela zu teleportieren, verbleibt euch die Erkenntnis über Aelas Standort noch für weitere 30 Sekunden.\r<br />\r<br />* Reittiere und reiten\r<br />\r<br />Aela kann Pferde und andere (Mod) Reittiere reiten.\r<br />\r<br />- Zuerst braucht ihr natürlich ein Reittier das ihr Aela geben könnt. Der leichteste Weg dazu ist ein Pferd zu kaufen, ihr könnt aber auch Mods benutzen die Reittiere hinzufügen. Ihr braucht jedenfalls ein Reittier das euch gehört, euren Begleitern, oder niemanden.\r<br />- Ihr besitzt eine neue Kraft &#34;Aela-Reittier&#34;. Aktiviert diese Kraft, zielt auf das Reittier und benutzt die Kraft wie einen Zauber.\r<br />- Das Reittier gehört nun Aela und ihr müsst für euch ein anderes finden.\r<br />- Aelas Reittier befindet sich normalerweise gleich neben eurem. Wann immer ihr reitet wird Aelas Reittier neben ihr auftauchen (falls es nicht bereits da ist) und sie wird aufsteigen und euch folgen. Wenn ihr absteigt wird sie es ebenfalls tun.\r<br />- Aela kann immer nur ein Reittier haben. Wenn ihr versucht ihr ein zweites zu geben, wird das erste wieder zu eurem Reittier. Ihr könnt auch die &#34;Aela-Reittier&#34; Kraft an einem Reittier das Aela gehört benutzen damit es wieder euch oder euren anderen Begleitern gehört.\r<br />- Beachtet das viele Spielfunktionen deaktiviert sind während ihr reitet. Vor allem könnt ihr die Schnellreise-Funktion nicht benutzen während Aela mit euch reitet. Ihr könnt auch die Aela-Anweisungen Kraft nicht einsetzen, und sie wird ihre Kleidung nicht wechseln.\r<br />- Aela kann nicht kämpfen während sie reitet. Im Dialogthema &#34;Kampftaktik&#34; könnt ihr entscheiden ob sie bei einem Angriff auf dem Pferd bleiben, oder absteigen soll um mit euch zu kämpfen.\r<br />\r<br />* Kampieren, Schlafen, und Heilung\r<br />\r<br />- Aela besitzt ein einfaches Bettzeug. Wenn ihr an einer geeigneten Stelle seid könnt ihr Aela mit dem Dialogthema &#34;Über diesen Ort&#34; sagen, dass sie dort etwas schlafen soll. Sie wird ihr Bettzeug dort ausbreiten wo sie gerade steht (falls es regnet oder schneit wird sie ihr Zelt aufstellen) und schlafen gehen. Sie wird 8 Stunden schlafen, außer ihr weckt sie vorher auf. &#34;Geeignete Stellen&#34; sind üblicherweise Orte die niemanden gehören (im Freien weg von den Städten, oder in Dungeons), oder in einem Haus das euch gehört. Achtet darauf, dass der Boden sehr flach sein muss damit Aela dort lagern kann.\r<br />- Wenn Aela nur wenige Schritte von einem herrenlosen Bett oder Bettzeug entfernt ist (einschließlich freiem Bettzeug vom Frostfall-Mod) erscheint im Dialogthema &#34;Über diesen Ort&#34; ein neuer Dialog mit dem ihr ihr sagen könnt, dass sie darin schlafen soll.\r<br />- Wenn Aela schläft und nicht unsterblich ist, wird sie sich während des Schlafens regenerieren.\r<br />- Wenn ihr nach einem Ort zum lagern sucht vergesst nicht das Aela in der Wildnis Himmelsrands aufgewachsen ist und einige Lagerplätze kennt, wenn auch nicht alle. Wenn ihr in der Nähe eines guten Lagerplatzes seid den sie kennt, wird sie es euch (nur zwischen 8 Uhr Abends und 2:30 Uhr Morgens) sagen (das kann im Dialogthema &#34;Unsere Reise&#34; ausgeschaltet werden), und ihr habt die Möglichkeit euch mit dem Dialogthema &#34;Über diesen Ort&#34; von Aela dorthin führen zu lassen (falls jemand von euch noch weitere gute Lagerplätze kennt, könnt ihr dem Autor oder mir gerne den genauen Standort schicken damit sie dem Mod hinzugefügt werden).\r<br />- Wenn sie als sterblich gesetzt ist habt ihr im Dialogthema &#34;Kampftaktik&#34; die Möglichkeit ihr zu sagen ob sie während oder außerhalb des Kampfes Heiltränke trinken soll. Ihr könnt ihr auch Heiltränke geben wenn ihr sie nach ihrem Befinden fragt und ihre Gesundheit unter 100% ist.\r<br />\r<br />* Halte die Stellung, Vertreib dir die Zeit, Wir treffen uns in...\r<br />\r<br />- Zusätzlich zu der Standard &#34;Warte&#34; Option gibt es auch eine &#34;Entspannen&#34; Option, die Aela in den &#34;Sandkasten-Modus&#34; versetzt in dem sie ihre Waffen verstauen, sitzen, essen, herumwandern, und auch sonst mit ihrer näheren Umgebung interagieren wird.\r<br />- Wenn ihr sie warten oder entspannen lasst wird Aela bereits nach 1 Tag (24 Stunden) aufhören auf euch zu warten und nach Jorrvaskr zurückkehren. Andere Begleiter warten zwar 3 Tage, aber Aela ist nicht so geduldig.\r<br />- Ihr könnt Aela zurück nach Jorrvaskr schicken wo sie ihre üblichen Pflichten wieder aufnehmen wird. Ihr könnt sie auch in eines eurer (Standard) Häuser schicken, oder in eines der Gasthäuser in denen ihr bereits wart. Sie wird dort 7 Tage auf euch warten bis sie es leid wird und wieder ihre normalen Tätigkeiten in Jorrvaskr aufnimmt.\r<br />- Die Spielerhäuser von den Hearthfire und Dragonborn DLCs funktionieren, allerdings müsst ihr, nachdem ihr eines bekommen habt, erst speichern und wieder laden damit sie es &#34;wahrnimmt&#34;.\r<br />- Ihr habt die Möglichkeit der Liste der Häuser die ihr besitzt, bis zu 3 Häuser aus anderen Mods hinzuzufügen und Aela dorthin zu schicken. In solchen Häusern könnt ihr Aela im Dialogthema &#34;Über diesen Ort&#34; sagen, dass es euch gehört.\r<br />\r<br />* Schnellbefehle\r<br />\r<br />Sobald Aela euch folgt erhaltet ihr eine neue Kraft namens &#34;Aela-Anweisungen&#34;. Ihr könnt sie zu euren Favoriten hinzufügen und &#34;Y&#34; drücken um sie zu aktivieren. Die genauen Befehle hängen davon ab wie weit Aela entfernt ist, welche Taktiken ihr ihr zugewiesen habt, und ob ihr im Kampf seid.\r<br />\r<br />[color=SpringGreen]Credits:[/color]\r<br />Danke an DreamKingMods für seine Erlaubnis eine deutsche Version seines Mods zum Download bereitzustellen.\r<br />\r<br />[line]\r<br />\r<br />Viel Spaß damit&#33;\r<br />Merkur\r<br />\r<br />[url=http://skyrim.nexusmods.com/users/1391109]Übersetzungen für Skyrim[/url]\r<br />\r<br />[url=http://oblivion.nexusmods.com/users/1391109]Übersetzungen für Oblivion[/url]\r<br />\r<br />[url=http://fallout3.nexusmods.com/users/1391109]Übersetzungen für Fallout 3[/url]",
  "categoryId": "96",
  "version": "0.4.7",
  "author": "DreamKingMods",
  "createdUnix": "1374277281",
  "updatedUnix": "1374277273",
  "containsAdultContent": false,
  "uploadedBy": "Merkur67",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039725",
      "name": "Aela die Jaegerin",
      "version": "0.4.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "574",
      "fileName": "Aela die Jaegerin-38521-0-4-7.rar",
      "uploadedUnix": "1374277273",
      "modVersion": "0.4.7",
      "virusScanUrl": "https://www.virustotal.com/file/d1aa1c6332e99a5ec226845ae21fc4670e81fdc52578e863012e6fe331c6091d/analysis/1407649862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aela%20die%20Jaegerin-38521-0-4-7.rar?fid=1000039725&ttl=1535818901&ri=8192&rs=8192&setec=19e543b06ad0c7f0b16cd40faffc3582"
    }
  ]
}