{
  "modId": 38528.0,
  "modName": "Dragon Priest Unique Spells- Dragonborn",
  "summary": "This mod adds three master level destruction spells to Skyrim. It adds the three elemental spells used exclusively by Zahkriisos, Dukaan, and Ahzidal. REQUIRES DRAGONBORN. Currently working on making them compatible with vanilla Skyrim. ",
  "descriptionHtml": "Hello fellow Nexus fans. This is my first mod, well the first one I have uploaded here to the Nexus. It is a simple spell pack which adds three very powerful Master level destruction spells into the game for the player to access without the need for console use. Spelltomes are scattered through each named priest\\'s tomb, and also added to their droppable inventory!\r\n\r\nThe Spell package adds three uniquely named spells to game, each one is used by the three masked priests in Dragonborn. I\\'m sure in the course of your travels you thought it was pretty sweet watching Zahkriisos float around dual casting Lightning Storm, or Dukaan and Ahzidal dual casting unique frost and fire breath spells. I sure thought so. After clearing everything Solstheim related I was slightly bummed out to see that the three spells they used with devastating effect I might add, were not obtainable by the player. We eradicated these guys, but yet can\\'t cast the same awesome spells.\r\n\r\nSo I decided to change that, now without further delay I give you the three Destruction spells that should have been made player obtainable. Each spell is very powerful, but fairly well balanced with damage/mana cost ratio. The spells are meant for a powerfull Destuction master mage, and as an alternative to the master level Destruction spells already in game(which in my view are lacking). Each corresponding spell is dual casting tested and ready to rock. Each spell allows you to remain mobile.\r\n\r\n1. Ahzidal\\'s Burning Rage- 150pts Fire damage. Stagger.Targets on fire take more damage. Chance of burning enemies fleeing in terror. (A CK lack of resources prevents the spell text from changing with Augmented Flames, however upon much testing the game recognizes the perk and the damage does indeed scale.) Also affected by Ahzidal mask.\r\n\r\n\r\n2. Dukaan\\'s Icy Hate- 70pts Frost damage each second for 5 seconds. Stagger. Slow. Chance to Paralyze/Freeze. (A CK lack of resources prevents the spell text from changing with Augmented Frost, however upon much testing the game recognizes the perk and the damage does indeed scale.) Also affected by Dukaan mask.\r\n\r\n3. Zahkriisos\\'s Crackling Spite- 75 points of shocking damage per second. Disintegrate.Channeled spell. With Augmented Shock the damage jumps quite high. Also Affected by Zahkriisos mask.\r\n\r\nWHERE TO FIND? Each spell tome is scattered somewhere  in the corresponding tomb where the Dragon Priest is found. They are on the floor, in a visible location, so keep your eyes open. No arrows or checkmarks on the map. It\\'s an RPG find them the old fashioned way! :)\r\n\r\nIf you don\\'t want to spend the time searching for the tomes, they can be accessed through the console by simply typing help \\\"insert dragon priest name here\\\". The spelltomes have been added to the inventory for each dragon priest, and will now drop upon their defeat. So loot away!!!\r\n\r\nINSTALLATION\r\nSimply extract the file to your Skyrim DATA folder.\r\n\r\nUNINSTALLATION\r\nDelete DPspellpack.esp from your Skyrim DATA folder.\r\n\r\nThanks for the download! Endorse me if you enjoy the mod! Screenshots on the way.\r\n\r\n \r\n\r\n",
  "categoryId": "75",
  "version": "1.1",
  "author": "Saren101",
  "createdUnix": "1374295610",
  "updatedUnix": "1374331581",
  "containsAdultContent": false,
  "uploadedBy": "saren101",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039756",
      "name": "Dragon Priest Spell Pack",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Dragon Priest Spell Pack-38528-1-0.zip",
      "uploadedUnix": "1374295567",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/50f3ce144c17581cc6cf48965e2eb5bda650b189c2d0a6dfd2840ad5dd1b2087/analysis/1407650041/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Priest%20Spell%20Pack-38528-1-0.zip?fid=1000039756&ttl=1535818912&ri=8192&rs=8192&setec=6015f02f7c42bc4b0d59d4d12b9af483"
    },
    {
      "fileId": "1000039814",
      "name": "Dragon Priest Spell Pack-Dragonborn",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Dragon Priest Spell Pack-Dragonborn-38528-1-1.zip",
      "uploadedUnix": "1374331581",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/24a0284ac82e9876677eb8f4fba6558a7909a4a4e2711e810134bd874aa4bfbe/analysis/1407650522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Priest%20Spell%20Pack-Dragonborn-38528-1-1.zip?fid=1000039814&ttl=1535818912&ri=8192&rs=8192&setec=1559a5e726821839b3d72c461f342221"
    }
  ]
}