{
  "modId": 38559.0,
  "modName": "The dragonborns eventful travels",
  "summary": "Except with this you will find monk\\'s at various shrines, Dragonslayers at Dragon sightings, Adventurers outside or entering dungeons/bandit camps, lumberjack\\'s in the cities and mill\\'s, couriers that aren’t looking for the Dragonborn, bards looking for stories to tell, assassins that are tougher with differences, Thief\\'s that are tougher wit",
  "descriptionHtml": "[center][FONT=Tahoma][SIZE=7][COLOR=#00b0f0]The Dragonborn\\'s Eventful Travels[/COLOR][/SIZE][/FONT]\r\n[img]http://static2.nexusmods.com/110/images/3421441-1376299410.gif[/img][/center]\r\nRead the Comment\\'s section for updates on whats going on. i a now taking in user suggestion\\'s, and putting my own twist on them. SATURDAY, AUGUST 31ST How about some Traps near mountain roads and Up the 7000 steps, one man one said it was dangerous, and i don\\'t find a few wolves a bear and a troll that intimidating. So im going to place traps. not only on these steps but in any other mountain ridge type thing with a path below it.\r\n[b]What this does;[/b] \r\nWell this mod adds lots of new npc\\'s that have various job\\'s and professions. Something that should have been in skyrim.\r\n\r\nIf you read below you will see that there is quite a few npc\\'s included in the game form this mod yet you won\\'t see them often, (wild dogs are not included in this, they are from another Mod). Which means they act like encounters that you run into in skyrim. Except with this you will find monk\\'s at various shrines, Dragonslayers at Dragon sightings, Adventurers outside or entering dungeons/bandit camps, lumberjack\\'s in the cities and mill\\'s, couriers that aren’t looking for the Dragonborn, bards looking for stories to tell, assassins that are tougher with differences, Thief\\'s that are tougher with differences and Barbarians and scavengers hiding on the roads to avail them self\\'s of your goods.\r\n\r\nAll the locations I have used for the npc\\'s packages have some sort of interactive furniture, so they wont be standing there like dummies.\r\n[center][img]http://static2.nexusmods.com/110/images/3421441-1376299410.gif[/img][/center]\r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Install/Uninstall/Upgrade?;[/b][/COLOR][/FONT]\r\nNote! This mod should not be uninstalled or it will wreck your save, as it affect\\'s vanilla leveled lists which will make npc\\'s appear nude with no head like a floating headless statue.\r\n\r\nDownload with nexus mod manager, and activate it using the program.\r\nDownload manually and open the .rar and drag and drop the contents into you\\'re Skyrim directory.\r\n\r\nUse NMM to deactivate the mod.\r\nDelete the contents of the .rar that have been placed in your skyrim/data directory.\r\n\r\nIf using NMM to install/upgrade be sure to deactivate the initial prior version first then install the latest.\r\nIf manually delete all of the old files first then extract the files from this one into your skyrim/data folder.\r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Lumberjack\\'s;[/b][/COLOR][/FONT]\r\nThere is four Unique lumberjacks that live in Skyrim, they are;\r\nKambujiya Lumberjack – Anga\\'s mill\r\nDagmar Lumberjack – Riften/Heartwood mill\r\nZeferino Lumberjack – Riverwood\r\nVittorio Lumberjack – Solitude sawmill and on the road north of the mill.\r\n\r\nThere is also many (5) non unique lumberjacks. Which will sandbox at all the sawmills and taverns/towns. They will be at 18 various locations in skyrim mainly mill\\'s and cities.\r\n\r\nOh and They also sell firewood, for all you [url=http://skyrim.nexusmods.com/mods/11163/?]Frostfall[/url] fan\\'s!\r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Dragon slayers;[/b][/COLOR][/FONT]\r\nThere is three unique dragonslayers that will travel as a group, they are;\r\nMaxim Steelslayer – Boss dragonslayer\r\nArcana Scale Shield – Dragonslayer\r\nVictor Scorched Scales - Dragonslayer\r\nalso there is allot of not unique dragonslayers that are just called dragonslayer. Both unique and not unique will travel to 13 dragon locations (like mountains and mounds) and 5 other locations (taverns and cities).\r\n\r\nThese are also implemented with an encounter quest, (see Adventurer\\'s for more info) this quest will place them at dragon locations.\r\n\r\nAlso i have noticed something where the Dragonslayers won\\'t attack the dragon if the player is to far away from them, which kinda does happen allot when the dragon comes roaring fire down a mountain.\r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Couriers;[/b][/COLOR][/FONT]\r\nI have made two new courier templates, and I have included these into the courier leveled list.\r\nI have changed the outfit\\'s of the couriers, so now they will wear farm clothes(cuirass) and armored boots/gauntlets, the hat/hood will either be nothing, various farm hats or some armored helms.\r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Monks/worshipers;[/b][/COLOR][/FONT]\r\nThese have a package that has them sandbox at various Shrine locations in the wilderness.\r\nThere is only nine of them so they wont be found often.\r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Bards;[/b][/COLOR][/FONT]\r\nThere is a group of people, one is a bard, one is a merchant, and one is a warrior. These npc\\'s will travel as a group to various dragon areas on Tuesday, Thursday, Saturday and Sunday and cities on the other days.\r\nGeirný Song Maiden – Bard\r\nHarland Hairy Visage – Merchant\r\nLorena – Guard/warrior\r\n\r\nThere will also be four of other bards that you will find in various locations. Like Dragonslayer skald of which will be sandboxing where the usual Dragonslayers sandbox. And normal bard\\'s/skald\\'s, depending on levels, of which will be at places like bandit camps and dungeons.\r\n\r\nI have tried making traveling bards before and to my efforts it wrecked my game twice... But no worries I have fixed this and I have made it in a clean manner, And it is INCLUDING VOICES (sure, what would you like to hear?)\r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Adventurer\\'s;[/b][/COLOR][/FONT]\r\nWell these not unique people will mainly be implemented with a encounter quest that scripts them into the skyrim world randomly, just like the scavenger that you see around and the odd mercenary or Nord that you find on your travels. These Encounter quests, containing adventurers will be placed at dungeons and bandit camps.\r\n\r\nThese npc\\'s will have a range of levels and they are randomly generated through a leveled list that I have made.\r\nThere is also a few that are manually placed in the world that have packages that place them  at various hand picked locations that I had chosen. \r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Barbarians and scavengers;[/b][/COLOR][/FONT]\r\nAre npc\\'s that are barbarians and scavengers. They will trick and fool you. You will find them in various hand picked locations and they will attack when the Dragonborn come\\'s within range without warning.\r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Thief’s and Dark Brotherhood Encounters;[/b][/COLOR][/FONT]\r\nThief’s,\r\nOutfits and levels have been changed, they are now stronger.\r\nI have also created Four new templates that are added to the vanilla leveled lists, which means you wont always see the same thief attempting to rob you. And they have varying abilities, like there is now thief archers. So it will be a bit different.\r\n\r\nDark brotherhood,\r\nOutfits and levels have been changed, they are now stronger.\r\nI have also created Four new templates that are added to the vanilla leveled lists, which means you wont always see the same Assassin trying to kill you. And they have varying abilities, like there is now assassin archers, and some of them have some magic skill. So it will be a bit different.\r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Bridges;[/b][/COLOR][/FONT]\r\nYes now you may encounter someone or something Cough*cough* \\'Trolls\\' on bridges.\r\nNah, not only trolls but on most/some of the bridges in skyrim there is a chance to spawn one of my created npc\\'s or a troll, they may be hidden, or they may be in plain sight, yet most of the time they won\\'t be in the same place.\r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Other Misc People added;[/b][/COLOR][/FONT]\r\nFriar Heran – A follower he is a 2 handed monk. (deleted and removed for the time being as i cannot get his dialogue to work)\r\n\r\nAnd if your still reading WOW, good for you, and thanks =) please download and endorse, it only takes a few seconds and it won\\'t wreck you\\'re game unless you remove it.\r\n\r\n[FONT=Tahoma][COLOR=#00b0f0][b]Mod\\'s that go well with this of my own making;[/b][/COLOR][/FONT]\r\nShrines, worshipers & pilgrims - [url=http://steamcommunity.com/sharedfiles/filedetails/?id=133458142]Steam[/url] [url=http://skyrim.nexusmods.com/mods/40538/?]Nexus[/url]\r\nAdds Items, tents and other things that make the shrines look used, along with  worshipers & pilgrims\r\nThe nine traveling bards of Skyrim - [url=http://skyrim.nexusmods.com/mods/27510/]Nexus[/url]  [url=http://steamcommunity.com/sharedfiles/filedetails/?id=110609916 ]Steam[/url]  \r\nAdds nine bards to Skyrim that will sandbox around their respected hold, these bards are also followers.\r\n[center][img]http://static2.nexusmods.com/110/images/3421441-1376299410.gif[/img][/center]\r\n\r\nCredits;\r\nA big Thank you to;\r\nAsguard Viking for allowing me to use his weapons in this mod, they are placed on various npc\\'s that have been made with this mod. [url=http://skyrim.nexusmods.com/mods/26634]mod is here[/url]   (btw I did make custom texture so it is now black/blackened steel)\r\n\r\nDlobo1999 for the hook and saw that are included on the lumberjack\\'s and assassin\\'s. - [url=http://skyrim.nexusmods.com/mods/36489]mod is here[/url]",
  "categoryId": "78",
  "version": "V2",
  "author": "JiubiIzeekk",
  "createdUnix": "1374364724",
  "updatedUnix": "1376348449",
  "containsAdultContent": false,
  "uploadedBy": "jiubiizeekk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000039871",
      "name": "The dragonborns eventful travels Initial release",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29588",
      "fileName": "The dragonborns eventful travels Initial release-38559-1.rar",
      "uploadedUnix": "1374363844",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/daca9225d564b5af5fe717e29d66e9c316776496d92d4054ecb6b5477a74769b/analysis/1407650992/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20dragonborns%20eventful%20travels%20Initial%20release-38559-1.rar?fid=1000039871&ttl=1535818953&ri=8192&rs=8192&setec=1041e81cac0ec5154578f8d054e39dbf"
    },
    {
      "fileId": "1000046446",
      "name": "The dragonborns eventful travels Version 2",
      "version": "V2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31127",
      "fileName": "The dragonborns eventful travels Version 2-38559-V2.rar",
      "uploadedUnix": "1376348449",
      "modVersion": "V2",
      "virusScanUrl": "https://www.virustotal.com/file/692005a8d6cb2fecf028482767eb4cd7b3ab5e7b89b45b7f1acbf9682ef5ad1e/analysis/1407680304/",
      "changelogHtml": " New dialogues all over.\r<br />\r<br />Monks now have two/one spells that either cure diseases or heal you, depending on their voice types.\r<br />\r<br />Friar Haran is now removed until further notice, bugs...\r<br />\r<br />Enemies/allies on some bridges, randomly generated. They should respawn after a few days. and they could and should be something different.\r<br />\r<br />Some new enemies.\r<br />\r<br />Fort Hunters, yes now when the bandits(or warlock, forsworn Ect) are at a fort there will be a bandit (or warlock, forsworn Ect) hunter, they will travel to around three places within that forts hold. Usually places with animals.\r<br />And yes when the fort is taken over or already owned by the stormcloaks or legion there will also be a hunter, that will also travel to 3 locations in the hold. \r<br />The soldiers have got to eat too.\r<br />  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20dragonborns%20eventful%20travels%20Version%202-38559-V2.rar?fid=1000046446&ttl=1535818953&ri=8192&rs=8192&setec=3348d2c92d83464b1549dab51f0360b7"
    }
  ]
}