{
  "modId": 38564.0,
  "modName": "Trade and barter by Kryptopyr - Commerce et troc",
  "summary": "Ceci est la traduction française de [url=http://skyrim.nexusmods.com/mods/34612/?]Trade & Barter[/url].\r<br />\r<br />This is the french translation of [url=http://skyrim.nexusmods.com/mods/34612/?]Trade & Barter[/url].",
  "descriptionHtml": "Ceci est la traduction française de [url=http://skyrim.nexusmods.com/mods/34612/?]Trade & Barter[/url].\r<br />\r<br />This is the french translation of [url=http://skyrim.nexusmods.com/mods/34612/?]Trade & Barter[/url].\r<br />\r<br />Si son travail vous plait, allez lui donner un petit &#34;Endorsement&#34; pour l&#39;encourager à continuer.\r<br />\r<br />[b][color=#FF0000]Version finale[/color][/b]\r<br />\r<br />[color=#FFFF00][u]Description :[/u][/color]\r<br />Kryptopyr a fait tous les efforts pour faire que ce mod soit autant compatible que possible avec tous les autres mods, et il devrait être pleinement compatible avec presque tous les mod. Il y a quelques fonctionnalités qui peuvent entrer en conflit, mais elles peuvent être désactivées pour maintenir la compatibilité. Ces fonctionnalités fonctionneront parfaitement avec les commerçants ajoutés par d&#39;autres mods (en supposant qu&#39;ils ont été placés dans les bonnes factions). En fait, ce mod se suffit à lui-même, l&#39;intention première de Kryptopyr était de créer un mod qui viendrait compléter et renforcer les mods existants révisant déjà l&#39;économie de Skyrim.\r<br />\r<br />Ce mod modifie les listes &#34;VendorGold&#34; qui déterminent le montant d&#39;or de base des marchands. Il modifie également l&#39;atout &#34;Investisseur&#34;. Si vous utilisez un mod qui modifie ces &#34;leveled lists&#34;, vous devrez alors choisir de les placer avant ou après &#34;Commerce et troc&#34;. Si ce mod est chargé à la fin, il écrasera alors toutes les modifications apportées par d&#39;autres mods à ces &#34;leveled lists&#34;. Si la &#34;leveled list&#34; de &#34;Commerce & troc&#34; est écrasée, alors les options d&#39;altération d&#39;or des marchands et le renouvellement de leur inventaire lorsque vous investirez chez eux ne fonctionneront pas.\r<br />\r<br />Économie de Bordeciel est entièrement compatible avec &#34;Commerce & troc&#34;.\r<br />Toutefois, si vous l&#39;utilisez, il doit être chargé après Commerce & troc.\r<br />\r<br />Ce mod modifie également les conteneurs des marchands des caravanes Khajiit ainsi que les coffres des épouses qui seraient commerçantes. Il entrera en conflit avec d&#39;autres mods qui modifient directement ces conteneurs marchands spécifiques.\r<br />\r<br />[color=#FFFF00]Or des marchands :[/color]\r<br />Commerce & troc vous donne la possibilité d&#39;augmenter le montant d&#39;or initial pour chacun des différents types de marchands. Si vous avez un autre mod qui modifie la &#34;VendorGold list&#34;, vous devrez choisir de placer &#34;Commerce & troc&#34; avant ou après ce mod. Dans la plupart des cas, Kryptopyr recommande le chargement de &#34;Commerce & Troc&#34; après l&#39;autre mod afin de profiter de la flexibilité et des options fournies par son mod. Cependant, certains mods, comme &#34;Économie de Bordeciel&#34;, doivent être chargés après &#34;Commerce & troc&#34;, afin que son mod ne remplace pas les changements. Les options : 1500 pièces d&#39;or maximum pour les aubergistes et vendeurs des rues et 5000 pièces d&#39;or maximum pour tous les autres marchands.\r<br />\r<br />[color=#FFFF00]Variation d&#39;or des marchands :[/color]\r<br />Ajoute plus d&#39;or aux commerçants sélectionné en fonction de leur localisation et de leurs caractéristiques individuelles. En particulier, ces options donnent aux marchands des grandes villes et des centres commerciaux plus d&#39;or que ceux des régions rurales. Kryptopyr recommande de laisser le montant initial d&#39;or des commerçants aux valeurs  &#34;Vanilla&#34; et de choisir l&#39;une des variables à la place.\r<br />\r<br />[color=#FFFF00]Or de base des marchands :[/color]\r<br />Cette option ajoutera un montant d&#39;or aléatoire à l&#39;inventaire des marchands pour qu&#39;ils n&#39;aient pas un pécule fixe. Ceci s&#39;ajoutera à leur montant initial pour qu&#39;ils aient toujours au moins leur montant initial disponible. Ces montants aléatoires ont été fixés vis-à-vis des montants &#34;Vanilla&#34; et n&#39;augmenteront pas de façon considérable l&#39;or des marchands au-dessus des valeurs &#34;Vanilla&#34;.\r<br />\r<br />Si vous rencontrez des montants bizarres ou inexpliqués d&#39;or des marchands, même après que le commerçant se soit réapprovisionné, c&#39;est que vous avez probablement un autre mod chargé après &#34;Commerce & troc&#34; qui a modifié les listes &#34;Vendergold&#34;. Pour résoudre ce problème, soit :\r<br />- 1) Vous modifiez le &#34;Load order&#34; de sorte que &#34;Commerce & troc&#34; soit placé après l&#39;autre mod.\r<br />- 2) Vous cliquez sur l&#39;option &#34;Réinitialiser l&#39;or par défaut des marchands&#34; dans le menu. Ceci permet de réinitialiser les options d&#39;or des marchands et permet au changement de l&#39;autre mod de prévaloir même sans intervention de &#34;Commerce & troc&#34;.\r<br />- 3) Utilisez Wrye bash pour fusionner les listes.\r<br />\r<br />[color=#FFFF00]Délai de renouvellement :[/color]\r<br />Vous pouvez choisir le nombre de jours qu&#39;il faut pour que les stocks des marchands se renouvellent. les options sont :\r<br />- 1-30 jours : cette option est désactivée par défaut. Lorsque vous chargez le menu du mod, la valeur que vous voyez affiché est le paramètre actuellement utilisé dans votre partie. La valeur &#34;Vanilla&#34; est 2.0, donc tout autre nombre indique qu&#39;un autre mod est déjà en train de changer ce paramètre. Si vous décidez d&#39;activer cette option, les paramètres de &#34;Commerce & troc&#34; remplaceront toutes les modifications apportées à cette valeur par d&#39;autres mods. Si à tout moment vous voulez annuler les paramètres pour ceux faits par un autre mod, il vous suffit de désactiver cette option et de recharger votre partie. Vous devrez recharger votre partie avant que les modifications de &#34;Commerce & troc&#34; soient intégralement annulées.\r<br />\r<br />[color=#FFFF00]Taux de troc :[/color]\r<br />Ajustez le taux de troc en fonction de vos goûts. Voulez-vous rendre plus difficile le fait d&#39;accumuler de grandes quantités d&#39;argent en vendant des articles . Voulez-vous diminuer l&#39;effet que votre compétence &#34;éloquence&#34; a sur les prix et prêter plus d&#39;importance aux atouts relatif à l&#39;éloquence ? Cependant, c&#39;est l&#39;une des caractéristiques qui peuvent entrer en conflit avec d&#39;autres mods, donc si vous ne voulez pas que &#34;commerce & troc&#34; remplace ces valeurs définies par un autre mod, il vous suffit de vous assurer que cette fonction est désactivée. Par défaut, elle l&#39;est déjà.\r<br />\r<br />Commerce & Troc vous permet de personnaliser les valeurs de &#34;fBarterMax&#34; et &#34;fBarterMin&#34;. Ces deux paramètres déterminent combien les prix sont élevés ou bas selon votre compétence &#34;Éloquence&#34;. Plus ce chiffre est élevé plus les articles sont chers à l&#39;achat et moins vous serez payé lorsque vous les revendrez. La différence entre ces chiffre décidera combien votre compétence en &#34;Éloquence&#34; aura sur les prix. Si ces chiffres sont proches, alors votre compétence &#34;Éloquence&#34; aura peu d&#39;effet sur les prix, au contraire, si ces chiffres sont plus éloignés, alors votre compétence &#34;Éloquence&#34; aura une grande incidence sur les prix.\r<br />\r<br />Cette option est désactivée par défaut. Ces deux paramètres sont souvent modifiés par d&#39;autres mods qui améliorent le commerce ou les marchands,  donc si vous ne voulez pas que &#34;Commerce & troc&#34; écrase ces valeurs laisser cette option comme elle est.\r<br />\r<br />Lorsque vous chargez le menu, les valeurs que vous voyez affichées seront les valeurs actuellement utilisées par votre partie. Les valeurs &#34;Vanilla&#34; sont 3.3 et 2.0. Si le menu affiche des valeurs différentes, vous possédez un déjà un mod qui altère ces réglages. Si vous décidez de choisir de nouvelles valeurs, &#34;Commerce & troc&#34; écrasera les réglages de l&#39;autre mod. Si vous désirez d&#39;annuler ces paramètres pour ceux de l&#39;autre mod, désélectionner ce paramètre et rechargez votre partie. Vous devrez recharger votre partie avant que les modifications de &#34;Commerce & troc&#34; soient intégralement annulées.\r<br />\r<br />[color=#FFFF00]Ajustement indépendant :[/color]\r<br />Avec toutes ces différentes variables, vous vous demandez peut-être quels sont les meilleurs réglages  pour obtenir un bon équilibre dans votre partie. Bien sûr, cela dépendra de ce que vous voulez. Beaucoup de gens (Kryptopyr y compris) aiment rendre le commerce plus difficile. Kryptopyr aime également définir les paramètres de troc relativement proche de façon à minimiser l&#39;importance de la compétence &#34;éloquence&#34; pour accorder plus d&#39;importance aux atouts relatif à celle-ci.\r<br />\r<br />Voici quelques suggestions de réglages basés sur la difficulté que vous pourriez souhaiter pour vos négociations. Les chiffres renvoient aux fbartermax, fbartermin et l&#39;ajustement du prix d&#39;achat.\r<br />\r<br />- Facile : 5.0, 3.5, -40% : Ceci réduit les prix de vente ( la réduction est plus grande à haut niveau). Rends la compétence &#34;éloquence&#34; moins importante et rend l&#39;achat des choses un peu meilleur marché que dans des niveaux &#34;vanilla&#34; peu élevés et un peu plus cher à des niveaux &#34;vanilla&#34; élevés .\r<br />\r<br />- Moyen : 6.5, 4.0, -50% : Ceci réduit les prix de vente encore plus, rends la compétence &#34;éloquence&#34;moins importante que dans le jeu &#34;vanilla&#34; (mais sur le même rapport aux paramètres ci-dessus), et conservent les coûts proches des valeurs &#34;vanilla&#34; pour l&#39;achat d&#39;articles.\r<br />\r<br />- Difficile : 10.0, 6.5, -60% : Ceci réduit encore les prix de vente et donne à l&#39;éloquence encore moins d&#39;importance. Vous aurez certainement besoin de prendre des atouts et / ou utiliser des  enchantements avec ce paramètre. Les articles seront plus chers à l&#39;achat, mais pas outrageusement.\r<br />\r<br />- Hardcore : 15.0, 10.0, -70% : Ceci réduit drastiquement les prix de vente et donne à l&#39;éloquence encore moins d&#39;importance. Vous devrez prendre des atouts et/ou des enchantements si vous espérez avoir plus d&#39;or. Les articles seront plus chers à l&#39;achat.\r<br />\r<br />Si vous essayez l&#39;un des paramètres suggérés ci-dessus, et que vous voulez payer davantage pour des articles que vous achetez. Ensuite, réduisez simplement le réglage du prix d&#39;achat ou remettez-les à zéro.\r<br />\r<br />Si vous pensez que votre compétence &#34;Éloquence&#34; devrait avoir un effet plus important sur ??les prix, de manière à ce que vous obteniez de bien meilleurs prix en rapport à votre niveau dans cette compétence. Réduisez le réglage de fBarterMin de 1,0 à 3,0 (ou peut-être même de 4 ou 5 si fBarterMax est assez élevé).\r<br />\r<br />[color=#FFFF00]Installation:[/color]\r<br />Copier le dossier &#34;Data&#34; du mod là où votre jeu est installé (là où vous avez mis Steam).\r<br />Soit: ...SteamSteamAppscommonskyrim.\r<br />Activer les plugins via le mod manager.\r<br />\r<br />Je vous conseille d&#39;utiliser Nexus Mod Manager pour faciliter l&#39;installation/désinstallation des mods.\r<br />Un tutoriel entièrement en français est disponible ici: \r<br />http://www.confrerie-des-traducteurs.fr/forum/viewtopic.php?f=183&t=10216\r<br />\r<br />[color=#FFFF00]Désinstallation:[/color]\r<br />1. Désactiver le mod dans le mod manager.\r<br />2. Supprimer manuellement les fichiers dans data.\r<br />3. Votre mod est bien désinstallé.\r<br />\r<br />[color=#FFFF00]Remerciements:[/color]\r<br />Merci à Kryptopyr pour ce mod ainsi que son autorisation à le traduire.\r<br />Merci à Bethesda pour ce jeu ainsi que l&#39;univers &#34;The Elder Scrolls&#34;.\r<br />Merci à Epervier666 pour son logiciel de traduction : [url=http://skyrim.nexusmods.com/mods/29457//?]Esp/Esm translation[/url].\r<br />Merci à McGuffin pour son logiciel de traduction : [url=http://skyrim.nexusmods.com/mods/29148//?]TESVTTranslator[/url]\r<br />\r<br />[color=#FFFF00]La Confrérie des Traducteurs:[/color]\r<br />Site Skyrim: http://www.confrerie-des-traducteurs.fr/skyrim/index.php\r<br />Forum: http://www.confrerie-des-traducteurs.fr/forum/index.php",
  "categoryId": "24",
  "version": "1.2.1",
  "author": "Kryptopyr",
  "createdUnix": "1374379065",
  "updatedUnix": "1375510747",
  "containsAdultContent": false,
  "uploadedBy": "bombeyte",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000043730",
      "name": "Commerce et troc",
      "version": "1.2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8864",
      "fileName": "Commerce et troc-38564-1-2-1.7z",
      "uploadedUnix": "1375510747",
      "modVersion": "1.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/c2a96984439187b720f4d25db3c80bac0217fafbd5f9183399ee25db31903099/analysis/1407667089/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Commerce%20et%20troc-38564-1-2-1.7z?fid=1000043730&ttl=1535818958&ri=8192&rs=8192&setec=712297d8a7c6d7b24f71c6c70390986f"
    }
  ]
}