{
  "modId": 38584.0,
  "modName": "skySense - Better Inventory Names",
  "summary": "The mod that makes sense of your inventory! Completely customizable and semi-modular!",
  "descriptionHtml": "[heading][color=green]-Introduction-[/color][/heading]\r\nThis is skySense, the mod that makes sense of your Inventory. With the help of the [url=http://www.uesp.net/wiki/Skyrim:Skyrim]UESPWiki[/url], and [url=http://skyrim.nexusmods.com/mods/25859/?]TES5Edit[/url], I\\'ve examined each and every item and spell (currently excluding Armor and Weapons) and renamed it to something that makes a bit more sense, and, more importantly, sorts better in your inventory.\r\n\r\n[heading][color=red][b]- PLEASE READ THE ENTIRE DESCRIPTION BEFORE DOWNLOADING -[/b][/color][/heading]\r\nYou should always know exactly what you\\'re downloading and putting into your savegames. \r\n\r\n[heading][color=green]-But, why?-[/color][/heading]\r\nMany items have names that don\\'t easily tell you what they are, or what they do, and nearly none of them sort very well. With my mod, almost every item and spell has had a name change (Excluding only items or spells which cannot normally be obtained, or dynamic items such as The White Phial). Now most items start with a categorization name, based on the categories in the [url=http://www.uesp.net/wiki/Skyrim:Skyrim]UESPWiki[/url] (and some personal creativity), to improve sorting, and to identify ambiguous items. This is more specific than just adding \\\"Food\\\" to the front of the name, as one might expect. I use [url=http://skyrim.nexusmods.com/mods/3863/?]SkyUI[/url], (and it seems most Nexus users do) so making such a broad categorization is simply unnecessary considering the sorting function in place in that mod. My mod aims to to improve on that sorting functionality by being more specific.\r\n\r\n[heading][color=green]-Don\\'t we already have other sorting mods?-[/color][/heading]\r\nYes, but I didn\\'t like their style. I want mine to be more customizable, based on my own tastes, and modular. Don\\'t like my style? I won\\'t be offended of you use another sorting mod; that\\'s the entire reason I\\'m making it is because I didn\\'t like the style of the ones available. If you don\\'t mind, though, please drop a comment on what you didn\\'t like about it. I might just change it (or add an optional file) if your tastes make more sense than what I\\'ve made.\r\n\r\n[heading][color=green]-History of the Mod-[/color][/heading]\r\nI originally started on releasing this mod in portions, but I quickly realized that not only did that make distribution of the mod difficult, it made it so that there would be many, many .esp files if you downloaded the whole mod. So I decided to take the last couple of weeks gathering all of the components together, merging most of them, and writing a very lengthy fomod install script to reduce the .esp count. Before I merged the components, I had nearly 40 .esp\\'s. Now there\\'s only 18 total, and you, as a user, wont use even half that many.\r\nIf you used any of my previous skySense releases, you should remove them before using this mod. No new/\\'clean\\' saves are required, as this mod makes no permanent changes to your save.\r\n\r\n[heading][color=green]-Changes Made-[/color][/heading]\r\nThis is a lengthy sample list of all of the changes I\\'ve made to the inventory.\r\n\r\n[b][u][color=skyblue]Food and Drink[/color][/u][/b]: Most food items had names that already made sense. The drinks were a bit more ambiguous. Changes to these items are more minor. Examples include: \r\n[list]\r\n[*]\\\"Mammoth Snout\\\" --> \\\"Raw Food - Mammoth Snout\\\"\r\n[*]\\\"Apple Cabbage Stew\\\" --> \\\"Cooked Food - Apple Cabbage Stew\\\"\r\n[*]\\\"Apple Pie\\\" --> \\\"Prepared Food - Apple Pie\\\"\r\n[*]\\\"Black-Briar Reserve\\\" --> \\\"Mead - Black Briar Reserve\\\"\r\n[*]\\\"Velvet LeChance\\\" --> \\\"Wine - Velvet Lechance\\\"\r\n[/list]\r\n\r\n[b][u][color=skyblue]Potions and Poisons[/color][/u][/b]: These items have had a complete name overhaul. Potion names were unsortable at best, and unidentifiable at worst. Now all potions and poisons, with the exception of special potions (as classified by the UESPWiki, and a little of my own opinion), have had a complete name change. Each potion is now named after its effects, and magnitudes have been moved to the end of the name (Customization is available, continue reading for options).\r\nExamples include:\r\n[list]\r\n[*]\\\"Weak Recovery Poison\\\" --> \\\"Damage Magicka Recovery - I\\\" or \\\"Damage Magicka Recovery - Weak\\\"\r\n[*]\\\"Draught of the Berserker\\\" --> \\\"Fortify Two Handed - II\\\" or \\\"Fortify Two Handed - Draught\\\"\r\n[*]\\\"Elixir of Vigor\\\" --> \\\"Fortify Stamina Regen - V\\\" or \\\"Fortify Stamina Regen - Elixir\\\"\r\n[/list]\r\nSome potions or poisons are unique and/or only have one magnitude; these potions have been categorized similar to the food and drinks.\r\nExamples Include:\r\n[list]\r\n[*]\\\"Esbern\\'s Potion\\\" --> \\\"Special Potion - Esbern\\'s Potion\\\" \r\n[*]\\\"Lotus Extract\\\" --> \\\"Special Poison - Lotus Extract\\\"\r\n[*]\\\"Potion of Cure Disease\\\" --> \\\"Other Potion - Cure Disease\\\"\r\n[/list]\r\n\r\n[b][u][color=skyblue]Books[/color][/u][/b]: Books were wildly unorganized. Different books used different volume counting styles, sometimes even in the same book series. Some books had capitalization errors, and most importantly, notes and journals sorted right along with more novel-like books. Notes have been prefaced with the \\\"Note\\\" category, and renamed where applicable. Journals have been prefaced with \\\"Journal\\\" and renamed, where applicable, any book which had a capitalization error or typo has been fixed (USKP caught most of those, but not all), and every book which has more than one in a series uses the same incremental style. Books pertaining to quests are prefixed with \\\"Quest Book\\\", nearly all of which will start the quest upon reading it, if the quest has not already been started.\r\nExamples Include:\r\n[list]\r\n[*]\\\"2920, Morning Star, v1\\\" --> \\\"2920 Vol. I - Morning Star\\\"\r\n[*]\\\"Riften Home Decorating Guide\\\" --> \\\"Home Decorating Guide - Riften\r\n[*]\\\"Diary of Faire Agarwen\\\" --> \\\"Journal - Diary of Faire Agarwen\\\"\r\n[*]\\\"Amaund Motierre\\'s Sealed Letter\\\" --> \\\"Note - Amaund Motierre\\'s Sealed Letter\\\"\r\n[/list]\r\n\r\n[b][u][color=skyblue]Ingredients[/color][/u][/b]: Almost all ingredients have been prefaced with a category which describes what they are, or where they come from.\r\nExamples Include:\r\n[list]\r\n[*]\\\"Chaurus Eggs\\\" --> \\\"Egg - Chaurus\\\"\r\n[*]\\\"Bleeding Crown\\\" --> \\\"Mushroom - Bleeding Crown\\\"\r\n[*]\\\"Eye of Sabre Cat\\\" --> \\\"Remains - Eye of Sabre Cat\\\"\r\n[/list]\r\n\r\n[b][u][color=skyblue]Misc[/color][/u][/b]: Many miscellaneous items had names that did not let you know what they were or what they were for. Now they not only have their category attached so you can tell if it has a function, but it also has a more descriptive name. Items which are prefaced with \\\"Smithing\\\" can be used to make or improve items. \\\"Dwemer Metal\\\" can be smelted, but \\\"Dwemer Clutter\\\" cannot without a mod like [url=http://skyrim.nexusmods.com/mods/24737/?]Melt Down Everything[/url]. Clutter is nearly useless, although some clutter can be used in Atronach Forge recipes. Collectible Clutter is just as useless as regular clutter, but they are rare. Quest Clutter is like regular clutter, but they\\'re needed for quests.\r\nExamples include: \r\n[list]\r\n[*]\\\"Bowl\\\" --> \\\"Clutter - Nordic Glazed Bowl\\\" or \\\"Clutter - Silver Bowl\\\"\r\n[*]\\\"Glass Dragon Claw\\\" --> \\\"Dragon Claw - Glass\\\"\r\n[*]\\\"Large Dwemer Strut\\\" --> \\\"Dwemer Metal - Large Strut\\\"\r\n[/list]\r\n\r\n[b][u][color=skyblue]Soulgems[/color][/u][/b]: Soulgems are pretty straightforward.\r\nExamples include:\r\n[list]\r\n[*]\\\"Petty Soul Gem\\\" --> \\\"Soul Gem - Petty\\\" or \\\"Soul Gem I\\\"\r\n[*]\\\"The Black Star\\\" --> \\\"Soul Gem - The Black Star\\\"\r\n[/list]\r\n\r\n[b][u][color=skyblue]Scrolls[/color][/u][/b]: Scrolls names now reflect their uses more easily, and sort better.\r\nExamples Include:\r\n[list]\r\n[*]\\\"Scroll of Fireball\\\" --> \\\"Flame Scroll - Fireball\\\"\r\n[*]\\\"Scroll of Bane of the Undead\\\" --> \\\"Turn Undead Scroll - Bane of the Undead\\\"\r\n[*]\\\"Scroll of Grand Healing\\\" --> \\\"Restore Health Scroll - Grand Healing\\\"\r\n[/list]\r\n\r\n[b][u][color=skyblue]Spells and Powers[/color][/u][/b]:Spells have been prefaced with their respective schools, and given better names where applicable, and Spell Tomes have been changed to reflect their new names. Powers are similarly more descriptive.\r\nExamples Include:\r\n[list]\r\n[*]\\\"Soul Trap\\\" --> \\\"Conjuration - Soul Trap\\\"\r\n[*]\\\"Fire Rune\\\" --> \\\"Destruction - Flame - Fire Rune\\\"\r\n[*]\\\"Battle Cry\\\" --> \\\"Racial - Battle Cry\\\"\r\n[*]\\\"Beast Form\\\" --> \\\"Werewolf - Beast Form\\\"\r\n[/list]\r\n\r\nAll of the categories I use are based on the [url=http://www.uesp.net/wiki/Skyrim:Skyrim]UESPWiki[/url]\\'s categories, with some deviations based on personal taste.\r\n\r\n[heading][color=green]-Customization-[/color][/heading]\r\nThis mod was created with customization in mind. As of version 1.0, there are three Styles, and one optional plugin.\r\n[b][color=yellow]Feel free to reccomend a Style or optional Plugin in the comments![/color][/b]\r\n\r\n[b][u][color=limegreen]Styles[/color][/u][/b]:\r\n[list]\r\n[*][b][u][color=skyblue]Roman Numeral Style[/color][/u][/b]: This is the main style: it is the most accurate at sorting, and will probably be the most used Style. In this Style all magnitudes are listed in Roman Numeral Format. Also, this Style makes the most drastic changes to item names. Drawbacks: Alphabetization will put \\\"IX\\\" before \\\"V\\\" and similar, so anything with more than nine levels will sort oddly (Very few items have that many magnitudes.) This Style should be considered not lore-friendly.\r\n\r\n[*][b][u][color=skyblue]Vanilla Style[/color][/u][/b]: This is the most lore-friendly Style. Most names have been preserved, although still using my sorting behavior. Magnitudes are listed using keywords from the Vanilla name (if no magnitude was listed in the name, it uses the magnitude \\\"standard\\\") An example would be \\\"Weak poison\\\" --> \\\"Damage Health - Weak\\\". Drawbacks: Doesn\\'t sort as well as Roman Numeral Style, but still better than true Vanilla by far.\r\n\r\n[*][b][u][color=skyblue]Morrowind Style[/color][/u][/b]: This style aims to bring some nostalgia from TESIII into Skyrim by using Morrowind-inspired magnitudes. Anything not converted to Morrowind Style uses Vanilla Style to fill in gaps. For right now, this mostly just converts potions to Morrowind themes, however, I plan on expanding it. An example would be \\\"Weak Poison\\\" --> \\\"Damage Health - Bargain\\\". Drawbacks: Same as Vanilla Style.\r\n\r\n[/list]\r\n[b][u][color=limegreen]Optional Plugins[/color][/u][/b]:\r\n[list]\r\n[*][b][u][color=skyblue]Skill and Map Names for Books[/color][/u][/b]: This optional plugin appends a word or two to the end of books which add map markers or raise Skills. The indicators are \\\"Map Marker\\\" and \\\"<Name of Skill>\\\" respectively.\r\n[/list]\r\n\r\n[heading][color=green]-Compatibility-[/color][/heading]\r\nSo far, the following Patches have been made for compatibility:\r\n[list]\r\n[*][b][u][color=skyblue]DLC[/color][/u][/b]:Thanks to the Steam Summer sale, I was able to get all of the DLC, and I\\'ve made patches accordingly. All official DLC are supported.\r\n[*][url=http://skyrim.nexusmods.com/mods/30348/?][b][u]Morrowind-Like Soul Gems[/url][/b][color=skyblue] by thurderan[/u][/color]: With this patch, Soul Gems will use my names, and MLSG\\'s models/textures. Requires the original mod.\r\n[*][url=http://skyrim.nexusmods.com/mods/4955/?][u]101 Bugs HD[/url][color=skyblue] by 83Willow[/color][/u]:This patch renames the new ingredients to match the sorting in my mod. Requires the original mod.\r\n[/list]\r\n\r\n[b][color=yellow]-I do not claim, own, or have any rights to the content of any mod for which I\\'ve made a patch. All patches require the original mod to work unless otherwise specified.[/color][/b]\r\n\r\n[b][color=orange]-Note to mod authors: If you are the author of a Mod which I\\'ve made a patch for, and you want me to take it down, just PM me, and I\\'ll remove it immediately.[/color][/b]\r\n\r\n[heading][color=green]-Future of the Mod-[/color][/heading]\r\nFor the foreseeable future, I plan on continuing support for this mod, including both compatibility patches and content updates.\r\n\r\n[b][color=limegreen]Compatibility Patches[/color][/b]: I have a small list of mods which I plan on adding patches for, listed below and in a sticky post in the comments section. \r\n[color=yellow]If you want to see a patch for a mod not listed or already patched, let me know in the comments.[/color]\r\n[list]\r\n[*][url=http://skyrim.nexusmods.com/mods/33201/?][u]HunterBorn[/url][color=skyblue] by unuroboros[/color][/u]: While compatible, this mod adds more foods, misc, and ingredients which I will rename in a patch.\r\n[*][url=http://skyrim.nexusmods.com/mods/18799//?][u]Radiant and Unique Potions and Poisons[/url] [color=skyblue]by exray catt[/color][/u]: While already mostly compatible, I\\'d like to make a patch just to make sure there aren\\'t any conflicts. This mod changes the textures of objects which I\\'ve renamed.\r\n[*][url=http://skyrim.nexusmods.com/mods/24737//?][u]Melt Down Everything[/url] [color=skyblue]by ogerboss[/color][/u]: While mostly compatible, this mod adds some new items, and makes changes to some misc items.\r\n[/list]\r\n\r\n[b][color=limegreen]Bugfixes[/color][/b]: I\\'m sure I made a spelling error somewhere, or perhaps missed an item. or even mis-categorized something. I will continue updating this mod with fixes as these errors come up.\r\n[b][color=yellow]I need your input! Please report any bugs to me in the comments section so that I can fix them. I cannot test every single item in every single style, so I might not catch an error in my own testing.[/color][/b]\r\n\r\n[heading][color=green]-Conflicts-[/color][/heading]\r\nThis mod will conflict with any mod that makes changes to the items I\\'ve renamed, however, any such conflict is harmless, and as long as the conflicting mod comes last, it\\'s changes will be the ones used.\r\nA list of conflicting mods will not be maintained because any mod which is not fundamentally incompatible (another sorting mod, for example) will be tracked above in the patches section.\r\n[color=yellow]If you know how to use TES5Edit, making a patch is really easy. Just load up my mod and the conflicting mod, and open the drop-down tree to see the list of all the changes one of the mods makes (doesn\\'t matter which). Then, select anything that\\'s not green, right-click it, and select \\'copy as override\\' and choose new plugin. Then close the drop-down tree you had open, and open the tree for the new plugin. Go through each item one-by-one and see what conflicts there are. (conflicts will be shown in the right-hand box in red). Simply drag-and-drop any changes made into the new plugin\\'s column to make sure that change is kept. Mostly you should only see conflicts in name, but if you don\\'t use USKP, or the mod wasn\\'t built around it, you may see some description changes that conflict.[/color]\r\n\r\n[heading][color=green]-Installation-[/color][/heading] \r\nThis mod comes packaged in a fomod installer. It is strongly recommended that you use NMM, or a fomod compatible mod installer. The fomod script will scan your load order, and detect any DLC you have, and any mods for which I have made compatibility patches. You will only see the optional pages for mods you have installed. If you have no DLC or mods I\\'ve made a patch for, you\\'ll just see the pages to select Style and Optionals.\r\n[b][u][color=yellow]If you\\'re hellbent on doing it manually, read the following, otherwise, you can skip this paragraph.[/color][/u][/b]: The folders are named after what they contain. Main is required, unless you have all DLC, in which case you can use Full instead. Only one Style will work at a time, and DLC patches require the DLC to work. Do not use a DLC patch if you use Full. Each style has a Dragonborn \\\"DB\\\" patch which requires that DLC (works over the top of Full). Optionals are just that. Patches require the original mod, and you must select the patch for the Style you\\'re using.\r\n\r\n[heading][color=green]-Uninstallation-[/color][/heading]\r\nSimply deactivate using your mod install software, or delete any .esp\\'s you manually installed. All of my esp\\'s for this mod should start with NK. \r\n[color=yellow]This mod does NOT make gamesave changes, add scripts, or anything else that meddles with save files. It is [u]absolutely[/u] safe to remove my mod at any time.[/color]\r\n\r\n[heading][color=green]-Compatibility and Requirements-[/color][/heading]\r\nThis mod was made merging changes made by the USKP. USKP is not a masterfile, and so is not specifically required, but you should still probably use it anyway. It\\'s about as essential as SkyUI, in my opinion.\r\nAll DLC patches require the DLC to work, however, the main mod will work without the DLC patch if you have the DLC, you just wont get the name changes I made for the DLC-added items.\r\n\r\n[heading][color=green]-Version History-[/color][/heading]\r\n1.1 - \r\nFixed: \r\n[list]\r\n[*]Cicero\\'s Journal was missing the Journal prefix. \r\n[*]Several items were updated to use the latest USKP fixes.\r\n[*]Some Ingredients have been given more descriptive names, specifically the insects.\r\n[/list]Added:\r\n[list]\r\n[*]Patch for [url=http://skyrim.nexusmods.com/mods/4955/?][u]101 Bugs HD[/url][color=skyblue] by 83Willow[/color][/u]\r\n[/list]\r\n1.0 - Initial Release. Includes fomod script, DLC patches, MLSG patch, and Skill/Map Book optional plugin.\r\n\r\n[heading][color=green]-Recommended Mods-[/color][/heading]\r\n[list]\r\n[*][url=http://skyrim.nexusmods.com/mods/3863/?][u]SkyUI[/u][/url] (Honestly, if you haven\\'t heard of this, I would like to know what rock you\\'ve been living under)\r\n[*][url=http://skyrim.nexusmods.com/mods/19/?][u]USKP[/u][/url] (and their patches for any DLC) \r\n[/list]\r\n\r\n[heading][color=green]-Permissions-[/color][/heading]\r\nDo [b]not[/b] upload this mod to any other site, or to the Steam Workshop. Steam Workshop is great for other games, but with a game as complicated and easy-to-crash as Skyrim, the Workshop is shoddy at best, and I do not support modding through it.\r\nPlease ask before using my work in another mod. I would prefer my work to remain in my own hands, but I might make an exception if I like what you propose.\r\nYou can make compatibility patches for other mods without permission, but [b]PLEASE[/b] give credit where credit is due, and send me a PM about it.\r\nIf I am offline, and don\\'t reply to PM\\'s for more than 3 months, I give my full consent to do anything with this mod that you wish.\r\n\r\n[heading][color=green]-Credits-[/color][/heading]\r\n[b][u]Bethesda[/b][/u] - For making Skyrim\r\n[b][u]Nexus Mods[/b][/u] - For hosting such a great community of modders.\r\n[b][u]The team working on TES5Edit[/b][/u] - My plugin was made entirely through that program.\r\n[b][u]The team working on USKP[/b][/u] - My plugin merges their changes.\r\n[b][u]Nexus User AmadanBezerk[/b][/u] - Suggested the \\\"Prepared Food\\\" category name. In an earlier file upload, it used to be \\\"Other Food\\\"\r\n[b][u]My mom[/b][/u] - You know why.",
  "categoryId": "27",
  "version": "1.1",
  "author": "NerevarineKhajiit",
  "createdUnix": "1374978526",
  "updatedUnix": "1375051527",
  "containsAdultContent": false,
  "uploadedBy": "NerevarineKhajiit",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000041545",
      "name": "skySense - BetterInventoryNames v1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4125",
      "fileName": "NKBetterInventoryNames v1_0-38584-1-0.7z",
      "uploadedUnix": "1374978364",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/70fbfe244b81de37cbbe9aa7ffe61e545449b8c10ee5f4021c3d9095748eba77/analysis/1407657978/",
      "changelogHtml": " Initial Release <br/> \n Styles Added: Roman Numeral, Vanilla, Morrowind <br/> \n Optionals Added: Skill and Map names for Books <br/> \n Compatibility Patches added: All DLC, Morrowind Like Soul Gems <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NKBetterInventoryNames%20v1_0-38584-1-0.7z?fid=1000041545&ttl=1535818982&ri=8192&rs=8192&setec=3b775118b0e09c1ee29bf56b2637d8a1"
    },
    {
      "fileId": "1000041890",
      "name": "skySense - BetterInventoryNames v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4127",
      "fileName": "skySense - BetterInventoryNames v1_1-38584-1-1.7z",
      "uploadedUnix": "1375051527",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/09372fc840c1fa9cf9f420c8d89cd00fea1b1ac80e1b82a1d9911e16266cf2b4/analysis/1407658811/",
      "changelogHtml": " Fixed: Cicero&#39;s Journal did not have the proper prefix. <br/> \n Fixed: Updated items to use USKP&#39;s latest changes <br/> \n Fixed: Renamed insect ingredients to be more specific. <br/> \n Added: Patch for 101 Bugs HD by 83Willow <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/skySense%20-%20BetterInventoryNames%20v1_1-38584-1-1.7z?fid=1000041890&ttl=1535818983&ri=8192&rs=8192&setec=0b8dcb144cba6a94b638304a9185f5b2"
    }
  ]
}