{
  "modId": 38633.0,
  "modName": "Dwarven Mechanical Dragons - Guardians of Kagrenzel Edition",
  "summary": "Renovates the original \"Dwarven Mechanical Dragons\" mod to make Dwarven Dragons more lore-immersive, mysterious, and exciting. Now Prepare to be ambushed by hidden Mecha Dragons as you approach abandoned Dwemer ruins! More than 40 unique dragon perch points added to battle locations for more exhilarating battles.",
  "descriptionHtml": "[img]http://i.imgur.com/XwBKIxX.jpg[/img]\n<br />\n<br />\n<br />[color=MediumSlateBlue][i][b]\n<br />[center]Long before our time, the dwarves harnessed the power of the earth, and\n<br />wielded fire and hammers to reshape steel and bronze with a mechanical\n<br />brilliance that breathed life into these ancient constructs of metal and magic...\n<br />amid the ceasless droning of grinding gears and venting steam, they lie in wait\n<br />to confound or destroy would-be plunderers of the dwarven sanctums, as the\n<br />grim watchmen of the last vestiges of culture from a dead race.\n<br />\n<br />~ Herbane's Bestiary: Dwarven Automatons[/center][/b][/i][/color]\n<br />\n<br />\n<br />\n<br />\n<br />Kagrenzel has always, in my opinion, been one of the most awe-inspiring Dwemer destinations in Skyrim. The memory of my first time entering the place is stamped into my mind -- not knowing what to expect, gasping with surprise as I fell for thousands upon thousands of feet through a glimmering tube of rock towards the unknown.\n<br />\n<br />It is in the spirit of Kagrenzel, and Skyrim's Dwemer Lore, that I offer this mod, built from Grohiik's amazing and original creation, [i]Dwarven Mechanical Dragons[/i]. Those who've seen his Mecha Dragons before know how amazing they look, and how well-attuned they are to Skyrim's existing Dwemer Aesthetic.\n<br />\n<br />[b][color=DarkOrchid]Dwarven Mechanical Dragons: Guardians of Kagrenzel Edition[/color][/b] has the goal, above all, to make Dwarven Mechanical Dragons more lore-immersive, mysterious, and exciting. Now, prepare to be ambushed by Mecha Dragons as you approach the entrances of abandoned Dwemer Ruins! It is my hope that, like Centurions and other rare Dwemer Animunculi, the Dragons of this mod will seem to be acting as powerful guardians who await their chance to attack potential intruders. In the process of making this mod I have also made numerous improvements to the dragons themselves, which should now scale much better with the player thanks to a greatly expanded leveled encounter list. Enough rambling though, on to the details.\n<br />\n<br />\n<br />[img]http://i.imgur.com/Ok52ZMt.jpg[/img]\n<br />\n<br />\n<br />\n<br />[b][u][color=DeepSkyBlue]Features:[/color][/u][/b]\n<br />\n<br />\n<br />[b][color=DarkOrchid]The Encounters[/color][/b]\n<br />[list]\n<br />[*]The number of dragons has been decreased. You'll only find nine dragons in total, and one is already dead.\n<br />[*]Only one dragon guards each ruin now, with the exception of Kagrenzel.\n<br />[*]Dragons now stay perched until approached.\n<br />[*]Entirely new placement. Dragons will no longer be found in locations that don't make sense--like Dwarven Ruins that have an encampment of bandits or other human NPCs living outside them. They will also now be found near some of the \"lesser\" ruins without interiors.\n<br />[*]Each encounter area has been carefully prepared and tested for battle. More than 40 unique dragon perch points have been added, meaning dragons will now land on towers, arches, bridges, rocks, rubble, cliffs, and overhangs as they try to kill you, making for some very exciting battles!\n<br />[/list]\n<br />\n<br />[b][color=DarkOrchid]The Dragons[/color][/b]\n<br />[list]\n<br />[*]An extensive new leveled list for Mechanical Dragon encounters that is even more comprehensive than vanilla dragon encounter lists. Seven different leveled dragons with increasingly powerful shouts and bite attacks, and new stats to go along with them.\n<br />[*]As a result, dragons will now scale much better with players, making battle exciting at all levels. Dragons should scale well for characters at least up to level 70.\n<br />[*]Fire resistance was scaled back for lower leveled dragon encounters, but will now increase to full immunity at higher levels (dragons are already immune to frost and poison, and resistant to magic, like all Dwemer Animunculi).\n<br />[*]Made dragons slightly more vulnerable to shock damage to balance their other resistances.\n<br />[*]Removed a perk that Mecha Dragons shared with normal dragons, which previously granted them the ability to resist 50% of all damage dealt to them by anyone besides the Dragonborn.\n<br />[/list]\n<br />\n<br />\n<br />[b][color=DarkOrchid]Additional Notes[/color][/b]\n<br />[list]\n<br />[*]Dragons WILL respawn during normal cell reset.\n<br />[*]Fair Warning: Be prepared before heading to Kagrenzel (and have fun once you get there!)\n<br />[*]If you would like, you can summon your own Dwarven Dragon by crafting a \"Dragon Automaton Cube\" from the Mecha Dynamo Core you will find on any that you kill. Head to your nearest smelter. (I have also updated this summon spell from the original mod to require two hands to cast--summoning a giant dragon with the effortless wave of one hand just looked... awkward :-D).\n<br />[/list]\n<br />\n<br />\n<br />[b][u][color=DeepSkyBlue]Compatability &amp; Notes:[/color][/u][/b]\n<br />[list]\n<br />This mod has no known conflicts.[*]Fully Compatible with DEADLY DRAGONS\n<br />[*]Fully Compatible with IMMERSIVE CREATURES\n<br />[*]Fully Compatible with the original Dwarven Mechanical Dragons mod (use the patch)\n<br />[/list]If you are running any mod that modifies terrain or the exterior of any Dwemer Ruin sites, you may encounter visual peculiarities. Three or four small rocks have been added for the dragons to perch on. There will also undoubtedly be a few clipping issues here and there with wings passing through rocks or walls, this is sort of unavoidable when placing gigantic creatures in the world, but it shouldn't be too noticeable.\n<br />\n<br />If you'd like to know the locations of all the dragons, take a look at the readme. It's always fun to be surprised, though.\n<br />\n<br />\n<br />[b][u][color=DeepSkyBlue]Installation/Uninstallation[/color][/u][/b]\n<br />\n<br />This is a stand-alone mod. The original DMD is not required. If you'd like to use them both, just snag the compatibility patch.\n<br />\n<br />To install, unpack to your Skyrim/Data directory, or just use NMM. Or if uninstalling, do the reverse.\n<br />\n<br />This mod should be safe to install or uninstall on a pre-existing save; though you may want to make sure you're not near any of the ruin exteriors.\n<br />\n<br />\n<br />[b][u][color=DeepSkyBlue]Credits, Permissions, Recommendations[/color][/u][/b]\n<br />\n<br />A thousand thanks to Grohiik for creating the Dwarven Dragon model, and the original mod which inspired this one! Be sure to visit his mod page if you're not yet familiar with the dragons, and please seek out his permission if you'd like to include or alter these dragons in your own project.\n<br />\n<br />These fantastic mods also include versions of the Dwarven Mechanical Dragons:\n<br /> [url=http://skyrim.nexusmods.com/mods/24587]Dwarven Mechanical Dragons--the original![/url]\n<br /> [url=http://skyrim.nexusmods.com/mods/24913]Immersive Creatures[/url]\n<br /> [url=http://skyrim.nexusmods.com/mods/3829]Deadly Dragons[/url]\n<br />Grohiik's other Mods:\n<br /> [url=http://skyrim.nexusmods.com/mods/16659]Draman Skeleton[/url]\n<br /> [url=http://skyrim.nexusmods.com/mods/23911]Perfect Blood Hybrids[/url]\n<br />Enhance your Dwemer Experience:\n<br /> [url=http://skyrim.nexusmods.com/mods/34399]Animated Dwemer Lift Load Doors[/url]",
  "categoryId": "83",
  "version": "1.01",
  "author": "egocarib",
  "createdUnix": "1374525420",
  "updatedUnix": "1377033787",
  "containsAdultContent": false,
  "uploadedBy": "egocarib",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040611",
      "name": "Guardians of Kagrenzel  v1-01",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8000",
      "fileName": "Dwarven Mechanical Dragons - Guardians of Kagrenzel Edition-38633-1-01.7z",
      "uploadedUnix": "1374726895",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/81265a57bac4d93bd736633946decb462ed4d20d733d8ae7c2c69e634039985c/analysis/1407655235/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwarven%20Mechanical%20Dragons%20-%20Guardians%20of%20Kagrenzel%20Edition-38633-1-01.7z?fid=1000040611&ttl=1535819008&ri=8192&rs=8192&setec=b21032cb29dda24df443fb5d1d08f21d"
    },
    {
      "fileId": "1000048438",
      "name": "Original DMD Compatibility Patch",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "24",
      "fileName": "Original DMD Compatibility Patch-38633-.7z",
      "uploadedUnix": "1377033787",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/9c1fcfaa0259768ca6ec2c52d010f2b81bcf936757dcefbda74ba7801dfe82ef/analysis/1407690851/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Original%20DMD%20Compatibility%20Patch-38633-.7z?fid=1000048438&ttl=1535819008&ri=8192&rs=8192&setec=7532e3c7a78fc6e8a3dcf09b2b2748d6"
    }
  ]
}