{
  "modId": 38648.0,
  "modName": "Incarnums Pretty Followers and Friends",
  "summary": "This mod remodels the faces and changes the hairs of all the followers in vanilla skyrim to make them more attractive or better suit their voice and personality.",
  "descriptionHtml": "Please Read:\r\n\r\nAnd scroll down for full information of what mod does:\r\n\r\nThis mod is built to be flexible. Allowing you to use it in unison with any body mods, textures etc that you find to be to your tastes, and that is why I have not made these followers stand alone.\r\n\r\n These changes are made with tktk\\'s Pretty Face mod (http://skyrim.nexusmods.com/mods/7887//?) as the ground work, so I HIGHLY recommend having that mod installed if you use my mod.\r\n\r\nPlease note that the pretty face mod comes with textures.  so when installing the mod, say no when it asks to re write your current textures (unless you want to use the new ones of course)  OR re install the textures you like, after installing pretty faces.\r\n\r\nlike I said, I left this mod as an open canvas for you to use any face, body, skin, texture mods you like.  \r\n\r\nMUST HAVE:\r\n\r\nThe only Mandatory mod is Hair Packs of Oblivion: http://skyrim.nexusmods.com/mods/searchresults//?\r\n\r\nHighly Recommended mod:\r\n\r\nPretty Face:  (in order to get the look in the screen shots)\r\nhttp://skyrim.nexusmods.com/mods/7887//?\r\n\r\nHigh Quality Eyes: (because my mod uses only stock eyes so this helps)\r\nhttp://skyrim.nexusmods.com/mods/498//?\r\n\r\nFAQ:\r\n\r\nQ: Why is lydia naked?  \r\nA:Well I did that for myself so i could put light armor on her and she wouldnt try and where her defualt shit instead... just toss armor on her, problem solved.\r\n\r\nQ: there is suddenly a gap between the neck and the body!\r\nA: not sure if this only happens when the mod is introduced to a save game, or if it happens on a new game too but never fear, all you do is open the console command  click on the npc and type \\\"setnpcweight 20\\\" then hit enter\r\n\r\nQ: omg you just fixed the neck seem but now the face is ugly!\r\nA: dont worry, thats just a one time deal, save your game, close skyrim, uncheck then recheck the mod in your launcher or in mod manager, your choice, then load up your game again, and walla, fixed forever.\r\n\r\nQ: all that sounds like a whole lot of work...\r\nA: not really... a minute tops, unless you make a habit of eating glue.  besides, making the mod took lots of work. so hah.  Anyway, the mod is cool, and it\\'s worth it :)  please enjoy.\r\n\r\nSo Finally, the meat.  What does this mod do?\r\n\r\nWell I re designed all of the female followers in vanilla skyrim (none of the DLC\\'s - coming soon) by re modeling their faces and choosing new hairs.  In some cases better suited tattoos and even made some characters marriageable who were not before.\r\n\r\nThey are now either more attractive *(my tastes obviously)* or more interesting, or better suiting of their voice or personality.)   To be specific which characters did I change and where do you find them?\r\n\r\nCompanions:\r\nNjada (whiterun)\r\nAela (whiterun\r\nRia <--- (whiterun)\r\nHousecarles:\r\nLydia (whiterun)\r\nIona (Riften)\r\nJordis (Solitude)\r\nDarkBrotherHood:\r\nFemale Initiate (dawnstar sanctuary after darkbrotherhood quest)\r\nDungeon Followers:\r\nIllia <-- made her marriable (darklight tower)\r\nHirelings\r\nJenassa <-- (whiterun)\r\nMiscellaneous\r\nAnnekke Crag-Jumper (darkwater crossing)\r\nAranea Ienith (shrine of Azura)\r\nEola (hall of the dead in Markarth)\r\nMjoll the Lioness (riften)\r\ncarlotta (whiterun)\r\nArcadia <--- youngafied! in order to better suit her voice, you\\'ll see! (whiterun)\r\nysolda (whiterun)\r\n\r\nMore screen shots coming soon, send me yours or ask questions via my email\r\n\r\nMvisioning@gmail.com\r\n",
  "categoryId": "96",
  "version": "1.0",
  "author": "Incarnum aka Matt Beer",
  "createdUnix": "1374557183",
  "updatedUnix": "1374556762",
  "containsAdultContent": false,
  "uploadedBy": "mattbeer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040116",
      "name": "Incarnums Pretty Followers and Friends",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "920",
      "fileName": "Incarnums Pretty Followers and Friends-38648-1-0.zip",
      "uploadedUnix": "1374556762",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8e8a7d503c785a93b925badaff759c5ef969b65353973822a7db23fcc09fba0a/analysis/1407653044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Incarnums%20Pretty%20Followers%20and%20Friends-38648-1-0.zip?fid=1000040116&ttl=1535819045&ri=8192&rs=8192&setec=5ee4cf9f1328db4419d3bd9143f75c36"
    }
  ]
}