{
  "modId": 38640.0,
  "modName": "Gnisis Cornerclub Rentable Bed",
  "summary": "This mod adds a rentable bed to The Gnisis Cornerclub, in Windhelm.",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center]\r<br />\r<br />Are you a Dark Elf looking for kinship in Skyrim&#39;s harsh lands? Are you just an adventurer who dislikes overcrowded inns? Whoever you are, welcome to The Gnisis Cornerclub&#39;s latest acquisition - a bed they can actually rent&#33;\r<br />\r<br />I admit I never really went to The Gnisis Cornerclub during my playthroughs, but today I set about to change that. And, turns out, there&#39;s no bed there to rent. Ambarys has the right factions but, for some reason, does not rent the bed listed. I was worried about breaking something if I forced him, so I made a new NPC who will handle it. \r<br />\r<br />Kathe will hang around behind the counter, where you can approach her. She is, I admit, a bit buggy - mostly in the fact that she stops midway whenever she has to show you the bed you&#39;re paying for, and the option to rent a bed will stay even after you pay. But it works just fine - the bed will be yours for a day. As you can see in the pictures, the new guest area is under the stairs that lead to the first floor. There&#39;s some safe storage (a sack and a dresser) and some items for you to take. I removed the static barrels that were around, and moved the skill book to a corner.\r<br />\r<br />A bit of warning, however - due to the position of the bed under the stairs, followers may not be able to get in it, and I guess mods that add sleeping animations may have trouble too. I don&#39;t have any to test, but with the vanilla game, there should be no problem for the player character.\r<br />\r<br />To install, extract the contents of your downloaded file to your &#39;Steam-SteamApps-Common-Skyrim-Data&#39; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp. Have fun&#33;\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "69",
  "version": "1.00",
  "author": "Jokerine",
  "createdUnix": "1374536148",
  "updatedUnix": "1374536134",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040082",
      "name": "Gnisis Cornerclub Bed",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "155",
      "fileName": "Gnisis Cornerclub Bed-38640-1-00.rar",
      "uploadedUnix": "1374536134",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/3e88feb626baf8161f735e5eb84d6104543c2e08b69e0c8284e4365c26aa9e9f/analysis/1407652684/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gnisis%20Cornerclub%20Bed-38640-1-00.rar?fid=1000040082&ttl=1535819027&ri=8192&rs=8192&setec=8fc90f3de38fc6bd3380304b1bfba443"
    }
  ]
}