{
  "modId": 38656.0,
  "modName": "Saphirion - Male Khajiit mage Follower",
  "summary": "Adds a new Follower to the game. He is a Mage Character with long range spells made to suit Legendary difficulty.",
  "descriptionHtml": "This Mod will add a new Character you can recruit as a follower.\r\nSaphirion is a Male Khajiit who usually wanders around the Candlehall Tavern in Windhelm. He may also wander around the Tavern but should not run around the whole city.\r\n\r\nHe is supposed to be used on legendary only, if you use him on any difficulty below that you may end up bored ashe roasts his enemies on anything below expert before you reach them.\r\n\r\nHis combat class, combat style and spells are a dublicate of an existing version, not an alteration. This means any changes you did to those should basically not effect him so he should be pretty much working with any other mod you have. I mainly did this to make sure that he wont be unable to use his spells when you changed them with mods. You may add spells to him with the console or with the Follower Overhaul Ultimate mod. Keep in mind that the more spells you give him, the more likely he uses those that won help you right now.\r\n\r\nSpells:\r\n\r\nAs default he uses ThunderBolt and Incinerate. He also knows FireStorm but will rarely use it unless surrounded by several foes (which should not happen since I made him strafe alot instead of standing still or trying to move backwards)\r\nHe will open battle with conjure Dremora Lord and also uses GrandHealing occasionally but you shouldnt rely on this as I set usage of defensive spells to a rare probability. (keep this in mind when adding spells).\r\n\r\nPerks:\r\n\r\nAt present I gave him dual cast perks of destruction (no he does NOT have impact) and restoration, the mana saving perks of destruction, restoration and Conuration. Twin Souls (although he summonded a second Dremora once so far while testing for 6h) and Conditioning for heavy armor (so he can still carry your stuff without having to worry about the weight of current heavy armor gear).\r\nSince those perks all have only passive benefits i kept the vanilla ones to him as changes to those perks shouldnt be a problem to work on him but I will change that if I receive messages from users that he wont work with the changes of those perks)\r\n\r\nGear:\r\n\r\nHe comes with an optical Greybeard outfit. Please note that even though I added it to his Inventory with the ID of the ClothesArmorGreybeardRobe and Hood he does not really \\\"carry\\\" it. So removing his hidden gear will make him become naked. Because of the stats of theGreybeard Gear he should basically carry anything you give him so it\\'s only for cosmetic reasons.\r\n\r\nWeapon Usage:\r\n\r\nHe does have skill in 1Hand as he is based on the CombatMage class but he will rarely use them when not forced to melee. In the open world this will basically never happen unless he runs out of mana. In caves where he cant run around he tends to use them regulary and can also use dual wield. Staffs and Bows will not be used at all and Unarmed only when he doesn\\'t have weapons when forced to go melee. Due to the High Skill and his setup he will usually equip his weapon(s) when traveling through areas. \r\n\r\n\r\nOh and about the Face, actually he should have blood red markings on his face but after installing the \\\"Better beast races\\\" mod they dissapeared sadly, yet still making his facial parts looking alot better - I believe this is because I used colours not actually available for selection in the normal creation, hence why the author of this mod most likely didnt bother to add them to the improved version. I will see if I can work around that.\r\n\r\nRecommended Mods: (none of them are recommented)\r\n\r\nUltimate Follower Overhaul\r\nhttp://skyrim.nexusmods.com/mods/14037\r\nBetter Beast Races\r\nhttp://skyrim.nexusmods.com/mods/944//?#\r\n\r\n\r\nThise Character has been made loading only the Skyrim.esm masterfile and not any other dlc\\'s or mods, so it should run without any DLC and will run with all of them installed. No spell, perk or gear from any mods has been used for the creation\r\n",
  "categoryId": "96",
  "version": "",
  "author": "09Striker",
  "createdUnix": "1374599238",
  "updatedUnix": "1374599225",
  "containsAdultContent": false,
  "uploadedBy": "09Striker",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040205",
      "name": "SaphirionFollower",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "SaphirionFollower-38656-.zip",
      "uploadedUnix": "1374599225",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/23b87c4905bd730b86a8efc885ee1ae17150402cc9e65149775a38e1b96174fe/analysis/1407653464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SaphirionFollower-38656-.zip?fid=1000040205&ttl=1535819058&ri=8192&rs=8192&setec=8497914db6a5354cf1d99770c6647132"
    }
  ]
}