{
  "modId": 3869.0,
  "modName": "Spekky Bandits Overhaul",
  "summary": "A difficult increasement mod specifically focussed around making those useless rogue type perks useful.",
  "descriptionHtml": "Basically the idea is to overhaul the way sneak, pickpocket, lockpicking and bartering work, along with providing a greater combat challenge. My overall goal is to extend gameplay, preventing the challenge from being lost until a much higher level. I also include other mods that I find uselful or move the game more towards the way I like to play it. All mods are seperate .esp files to allow for better customisation.\r\n\r\n\r\nFeatures:\r\n\r\nPickpocket Mod - Simply put this makes pickpocketing far harder, esspecially for highly valuable items. By skill level 100 most things should be easily obtained but without those pickpocketing perks there will still be those occasional enchanted rings that steal impossible to obtain. (Needs some more testing so specific feedback would be great).\r\n\r\nSneak Mod - This basically changes the effectiveness of sneaking making lower levels/unperked characters more challenging. The main effects are to increase noise and light sensitivity. You will always been seen in daylight when an enemy has line of sight and will require a very high unperked level to assure an alert enemy will just walk past you standing in the shadows. In regards to noise, a low sneak level or un muffled character will prevent anything more than a tiptoe around a sleeping character, even more so if you are in the same room as them. \r\n\r\nSneak Dagger Mod - Cahges the base dagger sneak damage from 3x to 5x.\r\n\r\nLoot Mod - Essentially this increases the max level of loot available (2x original level) while decreasing the probability of finding it (not sure what the factor is exactely), thus making each treasure all the more exciting.\r\n\r\nSprint Mod - Small increase to sprint duration.\r\n\r\nTraining mod - Huge increase to training cost (30 gold increase per level instead of 10). Designed for those who value every skill gain and are only willing to pay for that last boy required for that essential perk.\r\n\r\nLockpick Mod - If your like me then lockpicking is a joke. I can pick an expert lock at first level in 1 or 2 picks most of the time and master locks in less than 5. I don\\'t want my fully trained thief to be on par with my warrior in this regard. This mod dramatically increases dificulty and makes the master perk near essential at the very least. Not reccomended unless lockpicking really has become a joke.\r\n\r\nLevel Scaling Mod - Essentially this increases the maximum possible level of enemy at any given point. This won\\'t make all enemies super badass but will provide a consistantly larger challenge. Once the CK is available I intend to introduce some higher level enemies to keep the challenge fresh.\r\n\r\nBartering Mod - Basically this increases buying price dramatically and decreases selling price dramatically, as well as de-leveling vendors (making any item appear in there inventory at any level with a fixed chance). This gives you the option to save up for that special item if thats your play style. Original design is to support crafting rather than buying all you need.\r\n\r\nJump Mod - Small increase to jump height (it was something that annoyed me from time to time so I thought why not fix it?)\r\n\r\nCrafting Mod - This basically doubles the required resources for most recipes making the resulting product a far more rewarding outcome. Jewelery remains untouched as this would remove a reasonable source of income (esspecially if used in conjunction to bartering mod). I suggest other mods such as \\\"The Lost Art of Blacksmith\\\" but I would steer clear of new recipes as they would require far less resources.\r\n\r\nSkill and Leveling Mod - This makes all skills require more experience to lvel (~20% I think at max level) as well as changing the max level to around 100 (I haven\\'t actually checked yet).\r\n\r\n\r\n\r\n\r\nI would like to openly recognise the hard work of many other authors within the Nexus who have published other mods. While I have not directly taken any material from other authors it is clear that I have taken some of their ideas and reworked them to my preference. So basically a general thanks guys.\r\n\r\n\r\nPlease feel free to leave feedback - this is a work in progress and I will attempt to correct any problems/acknowledge other possible ideas. At the very least when the CK is available I have other thigs I would like to fix that I will make available.\r\n\r\nEnjoy.\r\n\r\n\r\n",
  "categoryId": "79",
  "version": "1.0",
  "author": "Spekky Bandit",
  "createdUnix": "1324086898",
  "updatedUnix": "1324733133",
  "containsAdultContent": false,
  "uploadedBy": "spekkybandit",
  "primaryFile": null,
  "files": [
    {
      "fileId": "13513",
      "name": "Spekky Bandits Overhaul",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Spekky Bandits Overhaul-3869-1.rar",
      "uploadedUnix": "1324733133",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1cc4ad5dc8555821d1630eb759e1e60fb4873ae75b1f58f4278582ed8fe105bf/analysis/1406554503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spekky%20Bandits%20Overhaul-3869-1.rar?fid=13513&ttl=1535759238&ri=8192&rs=8192&setec=590ce4273c2c01a5c3cf1753f8a7e05e"
    }
  ]
}