{
  "modId": 38725.0,
  "modName": "Extra Encounters - Dragonborn",
  "summary": "The island of Solstheim is supposed to seem like a rather empty place due to its small size, but sometimes it just seems TOO empty. Have you ever wandered across the island and wished that it wasn\\'t so lifeless? If so then this mod might be for you.",
  "descriptionHtml": "The island of Solstheim is supposed to seem like a rather empty place due to its small size, but sometimes it just seems TOO empty. Have you ever wandered across the island and wished that it wasn\\'t so lifeless? If so then this mod might be for you.\r\n\r\n\r\n[b]PLEASE READ EVERYTHING BEFORE ASKING A QUESTION IN THE COMMENTS SECTION OR ELSE YOU MAY LOOK SILLY :P . ALSO PLEASE DON\\'T FORGET TO RATE/ENDORSE THE MOD AS DOING SO HELPS TO RAISE AWARENESS. THANK YOU.[/b]\r\n\r\n\r\n[b]INFORMATION[/b]\r\nIf you\\'ve tried any of the previous versions of Extra Encounters then you\\'ll know pretty much what to expect in this version. Basically this mod adds a whole bunch of levelled encounters around the island of Solstheim. \r\n\r\nThe encounters are randomised which means they\\'re different everytime. After a while the encounters will respawn, so there will always be something interesting going on. The encounters themselves have a 1 in 5 chance of spawning, meaning you\\'ll never feel like there\\'s an unrealistic amount of NPCs on the island at one time.\r\n\r\nThe encounters are also lore friendly and have been designed so that you should barely be able to tell the difference between the standard encounters and mine. \r\n\r\nThe encounters also change depending on your location. For example you\\'ll never see a Riekling patrol in the ashes, and you\\'ll never find Ash Hoppers in the snow. Some encounters may even only appear during or after the completion of a certain quest.\r\n\r\n\r\n[b]DETAILS[/b]\r\nThere are four versions of the mod in total: Basic, H.S.R., Dawnguard, and Dragonborn. \r\n\r\nThis is the page of the Dragonborn version. This version can be found both on the Steam Workshop and the Skyrim Nexus.\r\n- [url=http://steamcommunity.com/sharedfiles/filedetails/?id=163213407] Steam Workshop Link [/url]\r\n- [url=http://skyrim.nexusmods.com/mods/38725//?] Skyrim Nexus Link (look under \\'Files\\' tab) [/url]   \r\n\r\n\r\nTo find out more about the other versions, please read the information on the Extra Encounters Basic page.\r\n- [url=http://steamcommunity.com/sharedfiles/filedetails/?id=119098264] Steam Workshop Link [/url]\r\n- [url=http://skyrim.nexusmods.com/mods/29688/] Skyrim Nexus Link [/url]\r\n\r\n\r\n[b]INSTALLATION[/b]\r\nOn the steam workshop, all you need to do is subscribe and the mod will download for you. Activate it under \\'Data Files\\' and away you go. Should you want to uninstall, simply deactivate the mod (see the FAQ for concerns about loading recent saved games after deactivation).\r\n\r\nIf downloading from the nexus, you\\'ll need to copy both the esp and bsa file into your skyrim\\\\data folder. Uninstall by deleting them (see the FAQ for concerns about loading recent saved games after deactivation).\r\n\r\n\r\n[b]FEATURES[/b]\r\nSOME of the encounters you may come across include (but are not limited to): Adventurers, Reavers, Rieklings, Merchants, Hunters, Skaal, Miners, Ash Spawn, Cultists, Lurkers, Werewolves, and many more!!! \r\n\r\nNote: All encounters are my own. I have not edited ANY of Bethesda\\'s existing encounters. Also keep in mind that some encounters (like Cultists and Lurkers) only spawn during or after certain quests.\r\n\r\n\r\n[b]COMPATIBILITY / LOAD ORDER[/b]\r\nThis mod may conflict with any mod that alters the landscape of Solstheim (since this mod adds spawn points across the island). Because of this when it comes to load order, this mod must be placed BELOW those other mods, which will result in this mod taking priority (hopefully). \r\n\r\nMods that change \\'The Retching Netch\\' may also conflict.\r\n\r\nAt the moment I am unaware of any specific mods that are not compatible with this mod.\r\n\r\n\r\n[b]KNOWN BUGS[/b]\r\nSometimes, Hunters and Merchants cannot be traded with for unknown reasons. Quitting and re-entering the game will not fix the issue immediately, but should correct the Merchants and Hunters dialogue in future encounters.\r\n\r\nIf you are experienceing CTDs, it is most likely a confliction which you will need to correct.\r\n\r\n\r\n[b]FEEDBACK[/b]\r\nIf you have any bugs to report, please let me know in the comments. \r\n\r\n\r\n[b]FUTURE PLANS[/b]\r\nThis mod is mostly finished. Future releases will include bug fixes and maybe some new encounters.\r\n\r\n\r\n[b]FAQs[/b]\r\n[b]Q- Is this compatiable with (insert mod here)?[/b]\r\n\r\nA- If the mod in question is not mentioned under the \\'COMPATIBILITY/LOAD ORDER\\' section then I\\'m afraid I can\\'t help you - you\\'ll need to test the combination yourselves. If you do test it, please let me know the results in the comments so I can add the mod to the list of compatible or non-compatible mods.\r\n\r\n[b]Q- If I uninstall this mod, will it cause issues with my recent saves?[/b]\r\n\r\nA- I tried it and nothing bad happened. That being said, you should always backup your saves just in case.\r\n\r\n[b]Q- TES5Edit says that there are errors with this mod. Can I ignore them?[/b]\r\n\r\nA- Don\\'t know, don\\'t care. I do not use TES5Edit and as a result, I have no idea what it\\'s complaining about.\r\n\r\n[b]Q- Can you make the spawn chance customisable?[/b]\r\n\r\nA- No. Unfortunately my knowledge with the Creation Kit is only of an average level - I am unaware of how to create customisation menus. Also given how my encounters actually spawn, I doubt it would work anyway.",
  "categoryId": "24",
  "version": "1.3",
  "author": "SayHelloToMrBullet",
  "createdUnix": "1374651514",
  "updatedUnix": "1374651031",
  "containsAdultContent": false,
  "uploadedBy": "SayHelloToMrBullet",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040423",
      "name": "Extra Encounters - Dragonborn",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "94",
      "fileName": "Extra Encounters - Dragonborn-38725-1-3.zip",
      "uploadedUnix": "1374651031",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/7dd728048af5ab69c889a3b8cd66f4408b2869a105b6e48f84db7886f4270bd9/analysis/1407654488/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extra%20Encounters%20-%20Dragonborn-38725-1-3.zip?fid=1000040423&ttl=1535819154&ri=8192&rs=8192&setec=5d3d880a3964176cb7e554c2ac551d14"
    }
  ]
}