{
  "modId": 38733.0,
  "modName": "Lamaes Retreat",
  "summary": "Lamae\\'s Retreat is a medium sized player home with all of the necessities. It is currently a work in progress.",
  "descriptionHtml": "[color=red][b]WARNING[/b][/color]\r\n[i]This is a >work in progress< mod. There are missing parts, and there may be bugs. However, this mod is very much playable. Please report these bugs in the comments with as much information as possible so that I can fix them as soon as possible. [/i]\r\n\r\n[color=red][b]Requires Dawnguard[/b][/color]\r\n\r\nLamae\\'s Retreat is a medium sized player home with all of the necessities. It includes a crafting area with storage near each crafting station, a bedroom, a storage room, a dining room, a torture and cattle room, and a sanctuary with plants and low sunlight. The entrance to Lamae\\'s Retreat can be found South-West of Falkreath. The exact location is shown in the images section on the map.\r\n\r\n[b]Notes:[/b][list]\r\n[*]The lighting may need improved. I developed this with and without an ENB and lighting mods. Please provide feedback on how lighting is within the cave, too low, too bright, certain areas are too much or too little, and so on, as well as what modifications and/or ENB you are currently using. Screenshots also help.\r\n[*]The distance fog within the cave might need adjusted. Please provide feedback on how distant parts of the cave look in areas of long views such as the main cavern. Screenshots also help.[/list]\r\n\r\n[b]Unfinished:[/b][list]\r\n[*]Bookshelves are being worked on. Books will be stored in piles and rows on top of flat rocks around the lair.\r\n[*]Weapon racks have not been added yet. I am looking into creating weapon racks that fit the scenery more than the current racks.\r\n[*]There are three mannequins, but I am working on changing these into skeletons to better fit the atmosphere.\r\n[*]The sanctuary currently serves no purpose. There will later be a Hearthfire version that includes farm patches for growing plants within the sanctuary, but open to suggestions on making this area useful for those without Hearthfire.\r\n[*]Storage containers do not have the Automatic Item Storage script yet, but will in the near future.[/list]\r\n\r\n\r\nThis mod contains resources from the following mods:\r\n[url=\\\"http://skyrim.nexusmods.com/mods/16525/?\\\"]Modders Resource Pack[/url] by Qaristys\r\n",
  "categoryId": "67",
  "version": "1.0b",
  "author": "Veltoss",
  "createdUnix": "1374672308",
  "updatedUnix": "1374672203",
  "containsAdultContent": false,
  "uploadedBy": "Veltoss",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040462",
      "name": "Lamaes Retreat WIP",
      "version": "1.0b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2572",
      "fileName": "Lamaes Retreat WIP-38733-1-0b.zip",
      "uploadedUnix": "1374672203",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/c4b9e7a1490c443e785d75e395e607abfa8a51c8b59f36e8a0b0468d04211739/analysis/1407654696/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lamaes%20Retreat%20WIP-38733-1-0b.zip?fid=1000040462&ttl=1535819167&ri=8192&rs=8192&setec=bc4a0c6472c8271e1b3651d1486a1c94"
    }
  ]
}