{
  "modId": 38748.0,
  "modName": "Ashenguard",
  "summary": "Ashenguard Circa 4E 201\r<br />\r<br />During the Red Year of 4E 5, with Red Mountain&#39;s erruption causing cataclysmic devastation across Solstheim, leaving the land scarred with ash and changing the geological landscape forever. the land breaking apart had a big effect on the wildlife making some species extinct, whilst creating whole new ones al",
  "descriptionHtml": "ASHENGUARD\r<br />\r<br />By Clint M. Chapman  \r<br />\r<br />************  UPDATE 2 INFO ***************\r<br />\r<br />I&#39;ve fleshed out the Ashenguard Crypt area much better, darker, and now with a second exit which means you don&#39;t have to ~tcl out of the area again.\r<br />\r<br />I&#39;ve made my hidden Stilshrine Lava area which is roughly 80% complete, Also I&#39;ve added a frozen ravine beyond the docks, you cant miss it, the cloud covered mountains past the Coast location.. Don&#39;t worry about that epic bridge right now, you cant get up there yet&#33;&#33; however i&#39;m quite pleased with my Spooky little cottage in that area.. ( there&#39;s a trapdoor you cant use yet either, But it will have a very spooky feel to it&#33;&#33;\r<br />\r<br />I&#39;m sure I&#39;ve added afew other pieces as well but mostly just set dressing, like new weather, and a map marker or two.\r<br />\r<br />And don&#39;t forget the new Wintertooth Imperial Camp.. it has all the needs you could ask for. thou it is the latest area in progress.. around 40%.. Im pleased with the results. and I hope that you will be too. \r<br />\r<br />******************************************************************************************************************************\r<br />******************************************************************************************************************************\r<br />MY BETHESDA FORUMS PAGE:  http://forums.bethsoft.com/topic/1467561-ashenguard/\r<br />\r<br />\r<br />What is Ashenguard?\r<br />\r<br />Ashenguard is a new lands mod that adds an entirely new worldspace to The Elder Scrolls: V Skyrim*. It&#39;s accessed by getting the new docked Ship at the Raven Rock* Docks, then by that same boat [ in Ashenguard ] back to Solstheim. Ashenguard&#39;s goal is to be a simple DLC style add-on, adding various content that you&#39;d expect to see in something like this. There is a new Continent, settlements, books, places, and NPC&#39;s to name just afew that player can see. It adds a good Hour to the game at least. More in depth parts to follow [ such as quests ] will greatly enhance the value. You can be anyone that you want to be when you visit Ashenguard* However naturally Werewolves are to be considered an enemy to everyone. [ Funny that they tolerate Vampires though. ]\r<br />\r<br />Features\r<br />- A new land independent of Skyrim*, about the size of Falkreath.\r<br />- An Hour + longer if you like to take your time, worth of gameplay [MORE TO FOLLOW*.]\r<br />- New items including new books, food, poisons, drinks.\r<br />- LOD [ &#34;in progress&#34;, some Landscape &#34;MAP&#34; lod exists and there is decent gameplay lod as well. ]\r<br />- Trainers in Sneaking, Lockpicking and more.\r<br />\r<br />What does Ashenguard require?\r<br />\r<br />Ashenguard requires the latest version of Skyrim. (As of July 12th, 1.9.32.0.8) It also requires that you own and have ALL DLC in the load order. No additional mods are required.\r<br />\r<br />INSTALLING ASHENGUARD [ PLEASE READ BEFORE YOU DOWNLOAD THIS MOD ] \r<br />\r<br />To install Ashenguard extract all items into your Skyrim/Data folder. The Folder should contain these files. A Meshes folder, a scripts folder, and a Textures folder, Also the .ESP file & Ashenguard.lod file with Finally a short Readme txt. I&#39;m not currently sure if you need the scripts, nor the Character folders for Meshes/Textures regarding FaceGen Etc..? I added these anyway.\r<br />\r<br />[  PLACE THE FOLDERS LIKE THIS. IN SKYRIM/DATA PLACE THE MESHES AND TEXTURES FOLDERS, ALSO ADD THE SCRIPTS INTO THE SCRIPTS FOLDER UNDER SKYRIM/DATA. WITH ASHENGUARD.LOD FILE PLACE IT INTO THE Lodsettings folder, if you DONT have this, then in skyrim/data, place a NEW FOLDER in there called Lodsettings, and then place the ASHENGUARD.LOD FILE INTO THAT. \r<br />\r<br /> Place Ashenguard.esp into your load order, As close to the DLC as possible. (close to top) Exact order may not matter, as Ashenguard shouldn&#39;t conflict with alot of things, but it should be close to the top as other mods may later edit Ashenguard.\r<br />\r<br />How to Begin Ashenguard, & does Leveling matter?\r<br />\r<br />To start Ashenguard, go to the Raven Rock Dock in Solstheim. There, look out to sea, and see the new ship docked there? well you can&#39;t miss it really&#33; its at the end of the main wharf in the opposite direction of the other boats already there in Solstheim.\r<br />Get on the boat and then you can either enter the trapdoor to go into the ship for a new interior* or you can skip this if you really want to though I advise that you give it a look :)  then enter the main door on the ship.\r<br />\r<br />this will instantly Load you into Ashenguard [ it&#39;s the best way i could make this work for now until I learn the more savvy Bethesda ways*. ]  Also Note that to return to Solstheim you just re-use the same door.  I’ve left &#34;Clues&#34; as to why you can’t go from the exterior door [ into the ship directly ]... for now that&#39;s what the trapdoor in the middle of the exterior of the ship is for.  :)\r<br />\r<br />You can be at any level that you wish. However note that a Lvl #1 character is bound to die in the Crypt and various other areas too, you will want a decent leveled player i&#39;d suggest a Minimum of Lvl #15 but you can always ~TGM if you want to explore it at lower levels, and of course if you’re an Lvl #80+ expect the enemies to be a cakewalk.\r<br />\r<br />Ashenguard has a whole range of things to do:\r<br />\r<br />INTERIORS.\r<br />-----------\r<br />\r<br />&bull;   Blacksmith&#39; Jerral&#39;s house\r<br />&bull;   Players Hearth [ yours to own for free - just grab the note & Key on the crate to the left of the door ]\r<br />&bull;   General Store&#39; Serek & Annette&#39;s\r<br />&bull;   Bulwark Guard House\r<br />&bull;   Bulwark Jails [ includes an escape route.. ]\r<br />&bull;   Ashenguard Crypts [ Enter this at your own risk.. :) ]\r<br />&bull;   Ashenguard Temple [ includes lower level interior ]\r<br />&bull;   Alchemy hub&#39; Dorothy&#39;s House [ items sold at the front during the day ]\r<br />&bull;   The Floating Barnicle [ Interior of &#34;Ship&#34; used from Solstheim / Ashenguard MUST USE TRAPDOOR ON BOAT EXTERIOR ]\r<br />&bull;   Foamdrinker Tavern [ the local mead hall of the nords ]\r<br />\r<br />EXTERIORS.\r<br />-----------\r<br />Artic Rim: The North-eastern edge of Ashenguard is home to the coastal docks and guard Outpost. It is also the region where you will most likely find horkers due to the climate and conditions that they most favour. \r<br />\r<br />Dawnguard Towers: Also on the Northern side of the continent are the Dawnguard Towers&#39; a sight to behold to be sure yet ancient and left abandoned for centuries..\r<br />\r<br />Hammershield Coast: On the Southern side of Ashenguard lays the Hammershield Coast, a perfect spot for finding treasure and fishing at the waters edge. Khajjit caravans regularly setup shop here and trade their wares, it is also home to various fauna and variants of the humble mudcrab. Not to mention out in the ice fields to the south West is home to the Netch. and beyond that.. past the cataracts is said to be mammoths.\r<br />\r<br />The Cataracts: These frozen glaciers spout impressive waterfalls, and are known to be the areas that fish seem to breed in and around it&#39;s icy lakes. Mammoth&#39;s can be seen on the far southwest of the giant frozen peaks. Many ships have crashed around these icy rocks and remains of afew can be seen frozen in time..\r<br />\r<br />The Redoran Docks: Here is the beating heart of the town, where the ships from all over come to dock. This area is home to the general store, your player hearth, the Blacksmith&#39;s, and a comforting view of the seas..\r<br />\r<br />Statue of Colossus: Out to the east of the general store, you can see the massive golden statue being constructed out to sea.. the icy winds and chilly conditions add the workload by freezing up the statue as it&#39;s construction goes on, and thus you will see workers out there fighting off the ice as well as constructing the Collossus.\r<br />\r<br />The town Square: Here is the small terrace district of the city where the Jarl&#39;s meet up to discuss matters of policy under the protection of the Guard. It also houses the main entrance into Ashenguard which is in need of major repair as rocks from the mountains have collapsed, nearly closing off entrance into the city from the northern side. Not to mention the Bulwark that has been placed around the northern entrance of the city to shield the terrace from the constant ash storms that would otherwise engulf Ashenguard.\r<br />\r<br />More is planned to be added, yet I want to stress that I’m keeping this mod as simple as I can and not overdo it. Areas that will be added will be required add - ons from the lore I’ve created. Also in the town square* there are two interior hearth areas yet to be created, and a few small other matters are needing my attention. But as is, this stands up as a nice little add - on to the main game. Where you can...\r<br />\r<br />visit, and shop at the markets, get training from the local trainers, use the various blacksmith shops to buy & sell your wares, see the sights, kill a bunch of monsters of various degrees of difficulty, find hidden areas and Easter eggs..  and even take a boat from here back to solstheim & visa versa..\r<br />\r<br />\r<br />ASHENGUARD LORE::::\r<br />\r<br />During the Red Year of 4E 5, with Red Mountain&#39;s erruption causing cataclysmic devastation across Solstheim, leaving the land scarred with ash and changing the geological landscape forever. the land breaking apart had a big effect on the wildlife making some species extinct, whilst creating whole new ones almost overnight. The Ash Spawn being just one of the new dominant creatures to walk the lands. Red Mountain&#39;s erruption split apart the natural landscape, shifting masses of underwater land hundreds of leagues away from both Solstheim and Skyrim, not up for the debate was the fact that the most sizable pieces of land broke off from Solsthiem&#39;s exterior&#39; that this new landmass was aptly named &#34;Ashenguard&#34; by the local nords and dunmer alike due to the exccess of ash that covered it&#39;s birth after it rose up from the icy waters and surrounding glacier cataracts.\r<br />\r<br />4E 10~\r<br />\r<br />The land itself is a sight to see, surrounded by icy cataracts and glaciers on all four sides of the continent the sleeply little fishing villages grew and grew, over time the nords began constructing a shipping dock on the Western side of the land. Now it stands as the local shipping supply center for the East Empire\r<br /> Company&#39;s sail fleet. Ashenguard&#39;s coast harbours the like of Horkers and rabbits, while more inland the effects of the ash storms and earthquakes have awakened the Ash Spawn and burnt spriggans.. The dunmer settlers here have learned to wall up the docks to keep out the feral creatures roaming the settlements outskirts.\r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />4E 17~ \r<br />\r<br />The Ashspawn began to show themselves as a threat to the locals after the eruptions of red mountain&#39;s smaller cousins on ashenguard covered portions of the land in thick ash. The general consensus is that fallen warriors from the red year* had been brought back to life in this horrifying state by a terrible force unknown..\r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />4E 83~ \r<br />\r<br />4E 83~\r<br />The worship of Talos in Ashenguard built a beacon of light for the waring races to turn to for guidance, peace & prayer. it would over be another 100 years before this holy Shrine of hope would be chained down by the Thalmor&#39;s ban on his worship..\r<br />\r<br />  \r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />4E 112~\r<br />\r<br />a year prior to the Chapel of Talos being built the Jarls of ashenguard brought together a council of all the major heads of state, to force a truce amongst the races in order to save the land from being torn apart by war. Although the hatred brewed strong within the clans still, over time they began to work together and come to appreciate the combined strength they had found in being united, which for all intents and purposes saved ashenguard from  suffering the same fate of other lands that couldn&#39;t or wouldn&#39;t work together. \r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />4E 113~\r<br />\r<br />the Chapel of Talos was built, a haven for those all over Tamriel who worship Talos, for priests, monks & worshippers of talos yes, but also for victims of the local wars and pilgrims taking the long journey from the shores of Blackmarsh & Elsweyr. \r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />4E 162~\r<br />\r<br />Vampires had been scarcely begun to show themselves from time to time, taking victims in the middle of the darkest nights, usually women and children from the local villages. It is rumoured that an ancient clan of vampires have always lived here, presumably awaken by the eruptions of Red Mountain.\r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />4E 164~ \r<br />\r<br />Local scouts from the tribes surrounding ashenguard have been reporting kidnappings and strange & terrible, brutal killings of travellers who have ventured into the forests in search of food. no more than weeks later began the sightings of the werewolf’s, a fierce and deadly clan of cunning creatures who would attack without thought or mercy. Every attempt to find their nest and weed them out has met with foul play.. \r<br />\r<br /> \r<br />\r<br />4E 174~ \r<br />\r<br />The Dawnguard arrived in ashenguard, after rumours of increased vampire activity.. Seeking to regain lost honour for Fort Dawnguard in the Rift*.\r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />4E 175~\r<br />\r<br />In the wake of the Empire wide ban on His worship, priests, monks, & worshippers from all over Tamriel came to pray in the chapel of Talos. Here the ever reaching grasp of the Concordat didn&#39;t apply, mainly due to the fact that the continent of Ashenguard was void of &#34;High Elf&#34; presence. And no other race wished to ruin the one last remaining place of &#34;Talos&#34; worship in the land. Of course the Thalmor would get wind of this place eventually...\r<br />\r<br /> \r<br />\r<br />4E 196~\r<br />\r<br />After over two decades of serving as one of the last bastions of free Talos worship, the chapel of Ashenguard is discovered by thalmor spies under the guise of travelling monks report back to their masters of the &#34;lawlessness&#34; of ashenguard&#39;s worship of talos. Soon the thalmor embassy brought forth a small army to bring the locals under their thumb and remove the statues of talos. Although the Embassy didn&#39;t leave a detachment of troops stationed in Ashenguard they did have a stern warning for the local jarl&#39;s court. And to make matters worse they kidnapped the jarls only daughter..\r<br />\r<br /> \r<br />\r<br />4E 199~\r<br />\r<br />Jarl Bergenolff had report of where the thalmor had taken his daughter Nimideia. He knew that sending in armies of soldiers would not be option, and decided to hire the services of the one who had been prophesized to return the land and his daughter to him, his scouts searched for months but could not find and leads.\r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />4E 201~202,\r<br />\r<br />Whilst the continent of Ashenguard was relatively safe above ground, the caves, sewers and crypt&#39;s still were teeming with deadly adversaries. everyone feared that soon the monsters would rise up and take the highlands too. But not long after all hope seemed lost that jarl Bergenolff got word of  one who was told to be roaming Skyrim, slaying dragons and using the Th&#39;um. Now Bernenolff got word out to all the major cities in Skyrim for this &#34;Dragonborn&#34; to aid him in finding his daughter, it surely wouldn&#39;t be long before he would be re-united with his kin.\r<br />\r<br /> \r<br />\r<br />Written by  Clint Chapman & Todd Damrath..  &#34;Many thanks Todd&#33;&#34;.\r<br />\r<br />\r<br />\r<br />FAQ&#39;S SECTION.\r<br />---------------\r<br />\r<br />ARE THERE ANY QUESTS?\r<br />\r<br />No. As of this moment i haven’t laid out the groundwork for these but &#34;Lore&#34; and the fact that I Want a few quests means that I will endeavour to make a few of these to tie in with &#34;Ashenguard&#34;.\r<br />\r<br />WHEN DID I START THIS MOD?\r<br />\r<br />From the details in the Creation Kit it reads as: Date Created: 6/5/2013 11:08 PM  last Modified: 7/21/2013 7:55 AM. And I’ve spend anywhere from 2 hours a day on this to 12 hours depending.\r<br />\r<br />IS THIS MOD FOLLOWER FRIENDLY?\r<br />\r<br />Right now I haven&#39;t tested that. But I do have a generous amount of Navmeshing done. that said i wouldn&#39;t&#92;exactly call this mod &#34;Follower friendly&#34; just yet.\r<br />\r<br />WHY AM I DOING THIS?\r<br />\r<br />Because it&#39;s what I absolutely love to do. Creating places, town&#39;s, cities and world&#39;s is a joy to do. It&#39;s not always easy, especially the really good stuff comes from a lot of planning and details. Which a few small ideas on paper may look exciting can be a task and a half to actually put together, but what I’m getting at is that there&#39;s joy in doing something that&#39;s a challenge and seeing it work, and come to life is something truly fascinating. That it&#39;s not just something in my head, I actually made it, and it&#39;s available for not just myself but for all the fans of Skyrim to enjoy :)\r<br />\r<br />DOES THIS MOD REQUIRE THE DLC/S?\r<br />\r<br />YES.\r<br />You will need to own all of Bethesda&#39;s Skyrim* DLC&#39;s Dawnguard, Hearthfire & Dragonborn and have them all in your load order as well as &#39;Ashenguard&#34; to play this properly. While some of you don&#39;t have DLC* it wasn&#39;t my intention to cut you out of the experience. It&#39;s just that I really wanting with this to use all of the new gizmo&#39;s at my disposal. Which opens up a much larger set of things to add to the world. Making for more Variation than a mod without DLC.\r<br />\r<br />HOW LONG DO YOU EXPECT TO NEED TO FINISH THIS MOD 100%?\r<br />I foresee at least a month of solid [ In Creation Kit ] work to go. that&#39;s 720 Hours. Of course spread out over time, with a busy life, and things to do my time using the kit from day to day will vary. I’m&#39; a 31 year old father with a family to consider. So please bear with me as I release updates to this as I go. Of which I’ll only make a major update every month or so. For those of you who know my work and skill I hope to see you download and enjoy this as the creation rolls along.  :)\r<br />\r<br />\r<br />WHAT ARE YOUR LIMITATIONS?\r<br />\r<br />Well to be frank most of what I can do has come from tutorials, and a lot of trial and error. I’m happy with my skill on the &#34;LEVEL DESIGNER&#34; side of things but I’ll admit I cannot script to save my life. Thus Quests are a real challenge&#33; But there are a few quest tutorials I intend to learn from. However there is still a ton of things that I’d like to add that is complex beyond me..\r<br />\r<br /> such as making SIGNS for ashenguard, questing anything that isn’t TO THE LETTER&#39; used from a tutorial, adding Bik. videos? I know AV* mentioned about how he did it but for me I’d need a slow step by step YouTube video tutorial on the thing that doesn’t skip Anything and holds my hand the whole way. and a sleuth of other things I’m sure.   What I’d like to see out there is a dedicated site that has tons of CHALLENGING TUTORIALS, that cover the hard to do things. \r<br />\r<br />But ones that don’t skip things, make them the hardest things to do, and bit by bit I can follow them and learn how to do all of the cool stuff&#33;&#33; That’s personally how I learn the best. so I hope to see a fuller tutorial experience out there in the future.\r<br />On a note since I’m on the subject  Alexander J Velicky Your tutorials are great & I hope to see more of them&#33;&#33;\r<br />\r<br />Cheers.\r<br />Clint M. Chapman.",
  "categoryId": "30",
  "version": "2",
  "author": "clint mathew chapman",
  "createdUnix": "1374694589",
  "updatedUnix": "1378295766",
  "containsAdultContent": false,
  "uploadedBy": "coheed82",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052176",
      "name": "Ashenguard",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9590",
      "fileName": "Ashenguard-38748-2.rar",
      "uploadedUnix": "1378295766",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/1cfcd23025818a0405c459b07290c92d6e1ba4a5c7af7785c94ae0cd010347e7/analysis/1407708371/",
      "changelogHtml": " Added first side quest complete with all the \"what if&#39;s\"&#33;&#33; <br/> \n added a sizable new chunk of land and places to see.. The Feylon Priory is a must see&#33; <br/> \n more navmeshing especially in low leveled watery areas <br/> \n Added a Companion NPC <br/> \n Added a working Stable,  { these changes will be in update 3 } <br/> \n new hold to the world.\r<br />85% completed first side quest. [need voice actors for \"Male Khajiit\" & \"Male Nord\" type & slight script editing]\r<br />over 10 new important npcs.\r<br />new quest items.\r<br />99% completed first \"Freeform\" Quest. [Just need voice actor for \"Male Nord Commander\" type] took me 6 hours & 50 minutes&#33;\r<br />added 12 new Misc* Tab [Quest] Dialogue lines for Jarl Bronvuld.\r<br />Bronvuld now has 22 dialogue lines to say in total so far.\r<br />added interiors for Bronvuld&#39;s Jarl&#39;s Longhouse. Fully furnished & navmeshed.\r<br />added interior for building near the Bulwark [adjacent to the small horse stable there].\r<br />added over 22 new Loadscreens specific to *Ashenguard&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ashenguard-38748-2.rar?fid=1000052176&ttl=1535819179&ri=8192&rs=8192&setec=5106e48e7d375e8f6263b2e60b4cb91c"
    }
  ]
}