{
  "modId": 38755.0,
  "modName": "Fury Weapons - A Fully Integrated Enchantment",
  "summary": "A fully integrated fury weapon enchantment. Great for bows!\r\n\r\n\r\n",
  "descriptionHtml": "\r\nPreviously a Workshop exclusive.\r\n\r\nOne night I was waiting to fall asleep and suddenly asked myself, \\\"Self, where are the weapons enchanted with Fury effects in Skyrim?\\\" I wrote the thought down and went to sleep.\r\n\r\nThe next day I took it upon myself to make a fully integrated Fury enchantment for Skyrim, for every material type, and with 9 tiers of ranks. \r\n\r\nThe Fury weapons can be found in shops, loot, on NPCs, et cetera, and are ranked thusly:\r\n\r\nRank 1: Discord - Enemies level 5 and under attack anyone for 30 seconds. Found on Iron, Steel and Imperial weapons\r\n\r\nRank 2: Fury - Enemies level 7 and under attack anyone for 30 seconds. Found on Steel, Iron, Orcish and Imperial Weapons\r\n\r\nRank 3: Frenzy - Enemies level 10 and under attack anyone for 30 seconds. Found on Steel, Iron, Orcish and Imperial weapons.\r\n\r\nRank 4: Turmoil - Enemies level 13 and under attack anyone for 30 seconds. Found on Honed Ancient Nord, Orcish, Dwarven and Imperial weapons.\r\n\r\nRank 5: Melée - Enemies level 16 and under attack anyone for 30 seconds. Found on Honed Ancient Nord, Dwarven and Elven weapons.\r\n\r\nRank 6: Mayhem - Enemies level 20 and under attack anyone for 30 seconds. Found on Honed Ancient Nord, Dwarven, Elven and Glass weapons.\r\n\r\nRank 7: Aberration - Enemies level 25 and under attack anyone for 30 seconds. Found on Elven, Glass and Ebony weapons\r\n\r\nRank 8: Anarchy - Enemies level 42 and under attack anyone for 30 seconds. Found on Glass, Ebony and Daedric weapons.\r\n\r\nRank 9: Mass Hysteria - Enemies of any level will attack anyone for 60 seconds. Found only on Daedric weapons and a uniquely named weapon hidden somewhere in the palace at Solitude.\r\n\r\nThese weapons are integrated into leveled lists, so WryeBash is highly recommended! There is a chance that a Daedric weapon spawned at the Atronach Forge will have this enchantment!\r\nThe enchantment can be removed and applied like any other enchantment, and changes strength with Enchanting skill.\r\n\r\nAlso, bows are awesome with it. :D\r\n\r\nNOTE: The fury effect makes enemies attack anything within reach, and yes, that does mean the player, but it also means everybody else. So if you hit a bandit with your Orcish Mace of Turmoil, and move back, the bandit could very well start attacking other bandits. The effect works best in large groups if it is on a melée weapon. ",
  "categoryId": "75",
  "version": "1.12",
  "author": "JKalenad",
  "createdUnix": "1374702419",
  "updatedUnix": "1374702416",
  "containsAdultContent": false,
  "uploadedBy": "JKalenad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040543",
      "name": "Weapons of Fury",
      "version": "1.12",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Weapons of Fury-38755-1-12.rar",
      "uploadedUnix": "1374702416",
      "modVersion": "1.12",
      "virusScanUrl": "https://www.virustotal.com/file/2944005696d0aed3ee8afc22e4dab157ef076b227c7bf3c7855f40de487e7831/analysis/1407655036/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weapons%20of%20Fury-38755-1-12.rar?fid=1000040543&ttl=1535819186&ri=8192&rs=8192&setec=4b4b83362bbadca4cebdaf0d28c2c005"
    }
  ]
}