{
  "modId": 38803.0,
  "modName": "Personal Cheat ESP With super shouts and super enchants",
  "summary": "Just something I made for myself since I\\'ve already beaten the game multiple times.",
  "descriptionHtml": "Current features:\r\n- a super enchant that damages all actors hostile to you regardless of distance. you have to add this with console and I am unsure if enchanting skill affects its real damage, but it does affect the description. (ID: D62)\r\n- Fire Breath with all 3 words will cause a dragon fire breath that instantly kills pretty much anything on legendary difficulty.\r\n- Frost Breath cannot be resisted and deals increased damage\r\n- Ice Form cannot be resisted, lasts an entire day, and cannot be broken by damage.\r\n- Unrelenting Force cannot be resisted, and is more powerful on the third word.\r\n- Lightning storm is more powerful, but costs the same.\r\n\r\nSo yea apart from being able to kill everything, you can also freeze greybeards, or send them flying across the room with your unrelenting force.\r\n\r\n0.3 update:\r\n- Unrelenting Force is even stronger and will shoot people straight into the air\r\n- dragons can be frozen when on the ground\r\n- player and followers are immune to fire breath, in case Mirak kills you with it.\r\n- Constant invisibility effect, cannot be int erupted by attacking or doing anything basically.  But I think enemies can still find you if you attack them. ID: 4338\r\n- Ebony Blade enchantment is stronger\r\n- Staff of Magnus enchantment is stronger",
  "categoryId": "104",
  "version": "0.3",
  "author": "1096bimu",
  "createdUnix": "1374795141",
  "updatedUnix": "1375076766",
  "containsAdultContent": false,
  "uploadedBy": "1096bimu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000041923",
      "name": "Main ESP file",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Main ESP file-38803-0-3.7z",
      "uploadedUnix": "1375076766",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/2889dc3f0ac12712ca9415b9d9b8771ba46f86821f3e44b093e268e6ac524de3/analysis/1407659076/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20ESP%20file-38803-0-3.7z?fid=1000041923&ttl=1535819224&ri=8192&rs=8192&setec=1f884421f9bf5dcd73e486e580358ee8"
    }
  ]
}