{
  "modId": 38806.0,
  "modName": "AnAdventurersAbode",
  "summary": "Hello to all&#33;&#33;\r<br />This is an ambitious player home/ cave mod located in and below Whiterun.\r<br />This is my first Skyrim Creation Kit creation and was designed with the intent of giving a little more to look at when inside a player home. This mod features an ambitious 7+story home in south Whiterun ",
  "descriptionHtml": "Hello to all&#33;&#33;\r<br />This is an ambitious player home/ cave mod located in and below Whiterun.\r<br />\r<br />This is my first Skyrim Creation Kit creation and was designed with the intent of giving a little more to look at when inside a player home. This mod features an ambitious 7+story home in south Whiterun and a 10 part Adventurer&#39;s Journal series. Alianah&#39;s Note which is sitting on the bench on the porch will give a direction to locate a way inside the home. Note: I wrote quite a bit to make all these journals and they tell the story as well as tell important details to get inside. 2 stories above ground with 5+ underneath and a great view of the mountains as well as an overlook of Whiterun to Dragonsreach await. I intended on this being a quest mod but for the simplicity of everything that&#39;s gone in to it I knocked it down to just the home so it should still give some cool things to look at and maybe give a bit of adventure never the less.\r<br />\r<br />Features of Alianah&#39;s Abode are: 14 weapon racks, 4 small display cases, 1 large display case, and 2 weapon plaques. Also there is everything associated with weapon forging and upgrading: such as forge, tanning rack, workbench, smelter ect. As well there&#39;s a ton of books, lots of custom spiral staircases, a place for dinner and alots of storage for as much treasures/weapons as you can store. A fully stocked bar, huge dinner table, your own personal shrine room and grotto are at your leisure. There&#39;s alot more than meets the eye in this house, but you will have to explore and discover the secret that lies beneath for yourself. (by the way there&#39;s a secret room full of treasure)\r<br />\r<br />Known Issues: (First things first&#33;&#33;&#33; ALWAYS MAKE A SAVE FILE BEFORE THE MOD AND KEEP IT UNTOUCHED)\r<br />I LEARNED THIS THE HARD WAY\r<br />\r<br />After going completely through the home and fast traveling around a few times, some items may fall from where they are sitting in the house. Such as books and sometimes when all the racks have weapons on them one or two swords will fall to the floor. I&#39;ve scripted almost everything in the house with defaultdisablehavokonload but sometime things just do what they want in this game.\r<br />I&#39;ve gotten stuck on the stairs a few times but reloading will fix it.\r<br />The weapon rack in the first room will place the shield on the floor for 3 seconds but then it will go to where it belongs.\r<br />NOTE: (And It may just be because I&#39;m a noob but)The way the game works as far as the creation kit is fidgity at best when trying to think outside the box, IE: when placing dagger cases vertically they do not perform as if they would horizontally. With that said, the 2 display cases over the enchantment table will except daggers but tcl will need to be used to retrieve them. So, use those 2 as display only. There&#39;s 2 glass daggers on the shelf right there for them.\r<br />Ultimately I think everything should work on a normal basis fine though.\r<br />\r<br />NOTE::: This mod is intended to use with color mods that add more saturation such as (Suggestions) Realistic Lighting With Customization by rgabriel15 or zoners enb or something\r<br />\r<br />NOTE::: Wearable lanterns or torches or any kind of player added light will make almost all the walls flicker so do not use any external light source&#33;&#33;\r<br />\r<br />Otherwise the colors do not look right&#33;&#33; Pretty much any color enhancing mod that adds saturation will go good as well but for a base line you need to have at least the Realistic Lighting With Customization by rgabriel15.\r<br />\r<br />I&#39;m not sure but I will mention also Multi -- House Map Markers by Smakit - English Map Markers PLUS by Smakit\r<br />you should have that mod anyway, it makes fast traveling alot faster&#33;&#33;\r<br />\r<br />Much love to everyone who&#39;s checking out my mod. I put alot of though and ALOT of time into making something for all of us to enjoy. I&#39;ve never done this before so please show some love back. Rate it please and All comments are welcome. If you find a problem with the house or any bugs/glitches please let me know and I will do my best to remedy it. Thanks again.....SlacksNawfside",
  "categoryId": "67",
  "version": "v666.1",
  "author": "SlacksNawfside",
  "createdUnix": "1374797033",
  "updatedUnix": "1374797029",
  "containsAdultContent": true,
  "uploadedBy": "SlacksNawfside",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040786",
      "name": "An Adventurers Abode",
      "version": "v666.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "410",
      "fileName": "An Adventurers Abode-38806-v666-1.rar",
      "uploadedUnix": "1374797029",
      "modVersion": "v666.1",
      "virusScanUrl": "https://www.virustotal.com/file/a10f578b237dcce21504ba38a3e506c134bc648d36165f4ef8d35af7b8693516/analysis/1407655748/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/An%20Adventurers%20Abode-38806-v666-1.rar?fid=1000040786&ttl=1535819229&ri=8192&rs=8192&setec=c071f28cfb0770ba1e21a7875ed56413"
    }
  ]
}