{
  "modId": 38814.0,
  "modName": "Max skills",
  "summary": "A simple text file you can run through the console to max out all your skills normally and leave the choice of perks/attribute distribution in your hands.",
  "descriptionHtml": "If you\\'re like me and you like to test the viability of specific character build ideas at high levels or if you simply lost a savegame and don\\'t want to start all over then this file is for you! I created and decided to upload this file because it seems all of the max level files here on the Nexus seem to include all perks as well as predetermined attribute distribution. When testing out specific character builds this is not a positive.\r\n\r\nInstallation: Download the file manually, extract the zip folder into your Skyrim directory normally at C:\\\\Program files\\\\Steam\\\\Steamapps\\\\Common\\\\Skyrim\r\n\r\nUsage: All you gotta do is open up the console and type \\\"bat MaxSkills\\\" without quotations and hit enter. This will run the text file as a .bat file and all of your skills will then be leveled to maximum just the same as if you leveled them normally. You can then level up and choose your attribute and perk distribution how you want. \r\n\r\nNote: You will get the skill increase popup and sound for about the first 40-50 Alchemy skill increases, which can be slightly annoying.",
  "categoryId": "73",
  "version": "1.0",
  "author": "BranKC",
  "createdUnix": "1374804866",
  "updatedUnix": "1374804858",
  "containsAdultContent": false,
  "uploadedBy": "BranKC",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040804",
      "name": "MaxSkills",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "MaxSkills-38814-.zip",
      "uploadedUnix": "1374804858",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/37a3e1667b6edbcb71c0efb17fbd88965c78fb08d968aa86b2ccd8bd29937fc5/analysis/1407655937/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MaxSkills-38814-.zip?fid=1000040804&ttl=1535819236&ri=8192&rs=8192&setec=51eed862eae950148db21426a1934a85"
    }
  ]
}