{
  "modId": 38824.0,
  "modName": "Roaring Sun - A counterpart to Silent Moons",
  "summary": "This mod adds the Roaring Sun enchantment, which is a counterpart to the Silent Moons enchant (from the Lunar Forge weapons). The difference is that it procs during the day instead of the night.",
  "descriptionHtml": "This mod adds the Roaring Sun enchantment, which is a counterpart to the Silent Moons enchant (from the Lunar Forge weapons). The difference is that it procs during the day instead of the night. That, and it uses the fire enchantement shader instead of the green one. To get the enchantment you have to craft a Solar Iron Sword which has the same requirements as a regular iron sword with the addition of a single pinch of fire salts.\r\n\r\nI made this mod entirely for myself, since I couldn\\\\\\'t find something similar already up. Therefore, it may not appeal to everyone. Regardless, I\\\\\\'m not going to be changing it unless I feel like it.\r\n\r\nThis mod does NOT require Dawngaurd. I toyed around with the idea of using the sun damage style as can be seen on Auriel\\\\\\'s Bow, but when you enchant only one effect is modified by the slider, so it wouldn\\\\\\'t really work out.",
  "categoryId": "75",
  "version": "1",
  "author": "Machina Ex Deo",
  "createdUnix": "1374812957",
  "updatedUnix": "1374812862",
  "containsAdultContent": false,
  "uploadedBy": "Machina Ex deo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040821",
      "name": "Roaring Sun Enchantment",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Roaring Sun Enchantment-38824-1.7z",
      "uploadedUnix": "1374812862",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ce5e713d1ea13eef934325218f0e3494e51d290ec671779804fe6f620cf82a7c/analysis/1407655997/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Roaring%20Sun%20Enchantment-38824-1.7z?fid=1000040821&ttl=1535819243&ri=8192&rs=8192&setec=affdeafde68c6b248d1fa8b49c842f1b"
    }
  ]
}