{
  "modId": 3887.0,
  "modName": "Ermil Harker - Male Dark Elf-Orc Hybrid",
  "summary": "Level 19 mixed Dark Elf/Orc savegame.",
  "descriptionHtml": "Since my first savegame got quite a few (or at least more than expected by me) downloads I decided to upload another one of my characters. This time it\\'s the fourth character I created, using the awesome art of race mixing. He\\'s a result of a mix between a Dark Elf and an Orc as stated, and he is also a werewolf. He has finished the Dark Brotherhood, Companions and Winterhold College questlines and is married to the College student Brelyna Maryon.\r\n\r\nHe is a Battlemage, for the moment equipped with a Blades Sword (katana) in his left hand, and Fireball in his right. He\\'s wearing Dragonscale armor, boots and gauntlets for the moment, and he\\'s got several rings and amulets in his inventory which makes it easy to choose which skill you want to favor for the moment.\r\n He doesn\\'t really have any specializations other than Destruction (62), but as the Battlemage he is he\\'s got skills like One Handed, Light Armor, Heavy Armor and such around 30-40, being a little bit higher than the other skills.\r\n\r\nAs with my last character, no mods are needed.\r\nAlso note that while he doesn\\'t have any warpaint, there seems to be a bug (possibly because of the race mixing) that makes a black hand-like warpaint appear on his forehead from time to time. Please look at screenshot 4. If this bugs you, you might not want to download this savegame.\r\n",
  "categoryId": "43",
  "version": "1",
  "author": "skywarder",
  "createdUnix": "1324125658",
  "updatedUnix": "1324126405",
  "containsAdultContent": false,
  "uploadedBy": "skywarder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "11315",
      "name": "ErmilHarker1909",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3821",
      "fileName": "ErmilHarker1909-3887-1.rar",
      "uploadedUnix": "1324126405",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/127b517d75ddab5f8cf89f6e9a7d90b77c706a27918d2d9b5e457b91d8b5c22b/analysis/1406529065/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ErmilHarker1909-3887-1.rar?fid=11315&ttl=1535759268&ri=8192&rs=8192&setec=779f43f5571f065a2f3cd0811bb8052d"
    }
  ]
}