{
  "modId": 38871.0,
  "modName": "Spanish Piedras Guardianas Mejoradas",
  "summary": "Este mod equilibra los efectos de las piedras guardianas y los vuelve mas utiles",
  "descriptionHtml": "[center][color=#00ff00][size=6]ESTE MOD SE INCLUYE EN SPANISH SKYRIM RECONSTRUCTION[/size][/color][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/60019/?][img]http://static-4.nexusmods.com/15/mods/110/images/60019-1-1416161168.jpg[/img][/url][/center]\r<br />\r<br />\r<br />INTRODUCCION\r<br />\r<br />Este mod equilibra los efectos de las piedras guardianas y las vuelve mas utiles.\r<br />\r<br />DESCRIPCION\r<br />\r<br />Las piedras del mago el guerrero y el ladron no fueron modificadas\r<br />\r<br />La piedra del aprendiz: La magia se regenera un 150% más rápido, aumenta en 50 la magia y aumenta la resistencia magica un 5%.\r<br />\r<br />La piedra del atronach: Permite tener un atronach adicional.\r<br />\r<br />La piedra de la dama: Salud, aguante y magia se regeneran un 50% más rápido.\r<br />\r<br />La piedra del noble: Aumenta el índice de armadura en 100 puntos y aumenta la resistencia a la magia en un 25%.\r<br />\r<br />La piedra del amante: Todas las habilidades mejoran un 20% más rápido.\r<br />\r<br />La piedra del Corcel: Aumenta la capacidad de carga en 150 y un 10% la velocidad de movimiento.\r<br />\r<br />La piedra ofidia: Aumenta la resistencia a venenos y enfermedades en un 50%.\r<br />\r<br />La piedra de la torre: Aumenta en 70 el aguante, salud y magia.\r<br />\r<br />La piedra ritual: Permite tener un reanimado o familiar adicional.\r<br />\r<br />La piedra sombría: Tus ataques sigilosos hacen un 50% mas de daño.\r<br />\r<br />Modificadas las descripciones de pantallas de carga, activadores de piedras (esto permite ver sus efectos exactos antes de activarlas) y efectos (para que todo concuerde)\r<br />\r<br />Requerimientos: Ninguno\r<br />\r<br />Compatibilidad: es compatible con cualquier mod que no modifique estos mismos elementos, si usted duda de si otro mod modifica algun elemento de las piedras cargue mi mod por detras de este (orden de carga inferior) por ejemplo Stealth Skills Rebalanced - Sneak - Lockpicking - Pickpocket ya que modifica la piedra del corcel.\r<br />\r<br />Cualquier duda o idea sobre los efectos comenten.\r<br />\r<br />\r<br />ESPECTATIVAS\r<br />\r<br />Mi intencion era modificar muchas mas cosas entre ellas los nombres de las piedras y usar nombres mas apropiados pero me estrelle al ver que para conseguir que todos los nombres concordasen tenia que modificar muchisimas entradas y algunas de ellas conflictivas con otros mods o dlcs, por lo tanto baje un poco mis espectativas y cree esta version reducida (sin modificar normbres) pero totalmente funcional. Para que os hagais una idea la piedra del amante la hubiera cambiado por la del bardo (hombre para todo) y la del noble por la del titan (solo son unos ejemplos)\r<br />\r<br />\r<br />Recopilacion de mods http://www.3djuegos.com/comunidad-foros/tema/19228710/0/mods-skyrim-14-07-2013/",
  "categoryId": "24",
  "version": "1.0",
  "author": "Incata",
  "createdUnix": "1374857614",
  "updatedUnix": "1374857597",
  "containsAdultContent": false,
  "uploadedBy": "incata",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000040983",
      "name": "Piedras Guardianas Mejoradas",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Piedras Guardianas Mejoradas-38871-1-0.rar",
      "uploadedUnix": "1374857597",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a4bf302a9e735004140cfa84a8c5d4b16dc7c1d9c9c7bcf5020602cb4c5db667/analysis/1407656462/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Piedras%20Guardianas%20Mejoradas-38871-1-0.rar?fid=1000040983&ttl=1535819293&ri=8192&rs=8192&setec=a12997b3ca9d8a562813ffcf29581bef"
    }
  ]
}