{
  "modId": 38875.0,
  "modName": "Zodiac",
  "summary": "12 portals to find across skyrim world, giving access to 12 quests. Each of these quest is rewarded with a player house, a companion + custom made armors, weapons outfits etc. French and english version available. Disponible en français et en anglais. Corrected version",
  "descriptionHtml": "Warning. I made a stupid mistake when creating the archive of this mod (corrected), but if you ever download you just have to move a file named \\\"quetem\\\" from your data folder to the meshs file into this data folder and a file named \\\"quete\\\" in your texture data folder file. Sorry again.\r\n\r\nSomething else. if you have any problem, suggest or question about this mod please contact me directly. Because i never read comments, i never partcipate to forums, steamcommunity, social networks etc and i have no intention to do it.\r\n\r\n12 portals to find across Skyrim world, giving access to 12 quests. Each of these quests have a specific atmosphere, from ancient japan, alik\\'r desert to dark, gore oblivion, and is rewarded with a player house, a summonable companion + outfits, armours and weapons, in the same style (see pictures). After finishing a quest you can access corresponding player house from a hub where you can teleport yourself. + A lot of surprises.\r\n\r\nAcquisition : You\\'ll find a book explaining the quest in your bedroom (solitude), but this step is not necessary to access the portals (if you find these)\r\n\r\nOther mods requested : none.\r\nIssues : Please contact me if you have any problem. You could have a problem with floating grass when you\\'ll arrive in japan style player house. Open console, Type \\\"tg\\\" + enter. close console.\r\nFeel free to use and change any part of this mod.\r\n\r\n12 portails disséminés dans le monde de Skyrim et qui donnent accès à 12 quêtes. Chacune de ces quêtes possède sa propre atmosphère, depuis le japon médiéval jusqu\\'à une ambiance Oblivion/gore, en passant par une ambiance arabisante \\\"mille et une nuits\\\" et est récompensée par une habitation, un compagnon à conjurer ainsi que par des vêtements, des éléments d\\'armure et des armes dans le même style (voir photos). Une fois conquises vous pouvez accéder à vos habitations via un hub où vous pouvez vous téléporter. + Toutes sortes de surprises.\r\n\r\nAcquisition : Vous trouverez un livre expliquant la quête, ainsi que quelques objets utiles, dans votre chambre à Solitude, mais cette étape n\\'est pas nécessaire pour accéder aux portails (si vous les trouvez)\r\n\r\nAucun autre mod requis.\r\nVous pourriez avoir un problème d\\'herbe flottante en arrivant dans la \\\"maison des poissons\\\" (style japonais), dans ce cas ouvrez la console et tapez \\\"tg\\\" + entrée puis fermez la console. Si vous rencontrez d\\'autres difficultés contactez-moi.\r\nJe laisse ce mod en libre accès. Vous pouvez le modifier, en reprendre les éléments à votre guise sans me demander la permission, mais ça ne coûte rien de me créditer.\r\n",
  "categoryId": "35",
  "version": "8",
  "author": "Leucippe",
  "createdUnix": "1374869124",
  "updatedUnix": "1376060579",
  "containsAdultContent": false,
  "uploadedBy": "leucippe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000045545",
      "name": "zodiac english",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "181488",
      "fileName": "zodiac english-38875-.7z",
      "uploadedUnix": "1376054560",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/8b436cb855d42fe6b9d73c60ad78fcc63e2f2c439bd1ef62fce3769cf706341f/analysis/1407675498/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/zodiac%20english-38875-.7z?fid=1000045545&ttl=1535819295&ri=8192&rs=8192&setec=d349bdc7d83e184edeac4c3acbedd046"
    },
    {
      "fileId": "1000045569",
      "name": "F",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91747",
      "fileName": "F-38875-.7z",
      "uploadedUnix": "1376060579",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7493244d30b52d3535256bad9272f20530590bf3718f65700a241a06e61cf465/analysis/1407675741/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/F-38875-.7z?fid=1000045569&ttl=1535819297&ri=8192&rs=8192&setec=d5713aab230234b9bb9f0c840cfa4296"
    }
  ]
}