{
  "modId": 3890.0,
  "modName": "The Retro Project 8-16 Bit Textures for the Environment",
  "summary": "Last Updated: 12-18-2012\r\nMy main goals are done and everything I wanted to retexture (mainly the environments) has been pixelated. The only other update will be the work of Cebius2 when hes done.",
  "descriptionHtml": "Ever wonder what those 2D characters from yesteryear where looking at while you were viewing them from the Top or Side the entire time? Well, get a glimpse of what they see! Criticism welcome, and feel free to recommend different sprites. Got a whole bunch on standby. \r\nWord of advice: If you see ANY one bright colored textures (for example, a red door or a pink wall), notify me with a screenshot and location please. Its the way I can quickly identify the textures in game.\r\nWe have reached 1500 unique downloads, yay! Checkout the mod in action with this spiffy video.\r\n[youtube]Ww2cPPlnjG8[/youtube]\r\n\r\nTHIS TEXTURE RE-PLACER DOES NOT SPEED UP PERFORMANCE. It just looks crappier. :)\r\n\r\nUpdate #10 Includes:\r\nCompleted Landscapes \r\nCompleted Weapons\r\nCompleted Armor\r\nCompleted Architecture\r\nCompleted Dungeons\r\n\r\n\r\n And so ends this project. What started as a mere quick retexture of the stone wall near the entrance of Riverwood as a joke exploded into a full blown project. Once I saw that wall, it made me realize that giant squares in the textures could actually work. I am fully aware that not everything is pixelated, but my main objective was the environments anyway. Maybe someday I will do the objects as well. :)\r\n I find it awesome that I actually completed this around Christmas. I wish I could update the pictures right now, but my big computer did not survive the trip from South Korea to the US. Until that gets fixed, I cant even test it out. But the Construction Kit and paint programs work perfectly well on my laptop and I was smart enough to back up my work before I left, so no biggy.\r\n I have been purposely holding myself back from downloading any other peoples mods before this one was finished, and I have not seriously played this for almost 10 months. I think its time for some overload. :D\r\n I want to thank Cebius2 for helping me on this and for providing the programs for my Music Project as well. The only other update will be when he gets done with his stuff. And thanks to all for the positive reviews as well. \r\n\r\nEnter this in the console command to lower the bloom:\r\nSHP 1000 7 7 0.7 3 1 4 1 0.05 \r\n\r\nHow to install; Stick the \\\"textures\\\" folder into your \\\"Data\\\" folder and enjoy. The game reads from both the .bsa AND the folder.\r\nHow to Uninstall; Simply delete the \\\"textures\\\" folder. (Yes, its that easy) :) \r\n\r\nWork Status;\r\nLandscape- COMPLETE\r\nArchitecture- COMPLETE\r\nDungeons- COMPLETE\r\nWeapons- COMPLETE\r\nArmor- COMPLETE\r\nParticle Effects- Working on (Cebius2)\r\nClothes- Cebius2 (working on)\r\n\r\nTired of the overly epic sounding, grade A orchestrations? Then turn that music into old school midi tunes with my second favorite mod, The Retro Project Music!\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11399",
  "categoryId": "62",
  "version": "v1.0",
  "author": "Astal",
  "createdUnix": "1324130305",
  "updatedUnix": "1355897477",
  "containsAdultContent": false,
  "uploadedBy": "Astal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106123",
      "name": "The Retro Project",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "316049",
      "fileName": "The Retro Project-3890-v1-0.zip",
      "uploadedUnix": "1355897477",
      "modVersion": "v1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Retro%20Project-3890-v1-0.zip?fid=106123&ttl=1535759271&ri=8192&rs=8192&setec=57bd58223578473a97009f63aef7138b"
    }
  ]
}