{
  "modId": 38901.0,
  "modName": "Item Recycling",
  "summary": "The Item Recycling mod adds 168 new recipes for crafting ingots at smelters. Virtually every metal item in Skyrim can now be melted down into an ingot. This mod is perfect for thieves and blacksmiths alike. Worthless items like goblets and silver platters can now be melted down into silver ingots and sold to vendors. Blacksmiths who need a way of i",
  "descriptionHtml": "The Item Recycling mod adds 168 new recipes for crafting ingots at smelters. Virtually every metal item in Skyrim can now be melted down into an ingot. This mod is perfect for thieves and blacksmiths alike. Worthless items like goblets and silver platters can now be melted down into silver ingots and sold to vendors. Blacksmiths who need a way of improving their smithing skill but have trouble finding enough ingots can simply melt down any iron they can find and then forge that iron into daggers. This mod gives meaning to alot of the seemingly benign clutter around Skyrim.\r\n\r\nIMPORTANT NOTE: As of version 1.2 (Most Recent) a new feature has been added that prevents you from melting down an item that you have equipped. This however will not prevent you from melting down weapons equipped in the left hand due to a limitation with the GetEquipped function of the creation kit. All other weapons, armor and shields are protected from meltdown when equipped.\r\n\r\nWARNING: Weapons but not shields, held in the left hand are NOT protected from being melted down. Everything else is safe.\r\n\r\nIMPORTANT NOTE: As of version 1.1 the smelting menu is no longer massive and only shows items that can be crafted. If you do not have the items necessary to smelt an ingot then the ingot recipe will not be visible. For those of you that don\\'t know this is in response to comments that the menu was to large and took to long to scroll through.\r\n\r\nRecipes:\r\n\r\n\t2  Daggers        = 1 ingot\r\n\t1  Sword            = 1 ingot\r\n\t1  Mace             = 1 ingot\r\n\t1  War Axe        = 1 ingot\r\n\t1  Warhammer  = 2 ingots\r\n\t1  Battle Axe      = 2 ingots\r\n\t1  Greatsword   = 3 ingots\r\n\t1  Bow               = 2 ingots\r\n        10 Arrows          = 1 ingot\r\n\r\n\t1  Chest Piece  = 3 ingots\r\n\t1  Gauntlet Set  = 1 ingot\r\n\t1  Boot Set        = 2 ingots\r\n\t1  Shield            = 2 ingots\r\n\t1  helmet           = 2 ingots\r\n\r\nAs stated earlier this mod adds 168 new smelting recipes, this includes alot more than armor and weapons. Items such as Kettles and Silverware can now be melted down.\r\n\r\nNotes:\r\n\r\n\r\nDragon armor can not be melted down.\r\n\r\nThis mod does not include certain dwarven items because several can already be melted down as part of the vanilla game. (This will be changed with my next update)\r\n\r\nScaled and studded armors can not be melted down. (This will be changed with my next update)\r\n\r\nThis mod does not include armor and weapons that are part of the Dragonborn DLC or the Dawngaurd DLC.\r\n\r\nThis mod does include Arrows.\r\n\r\nI have all of the smelting recipes set to yield slightly less metal than was originally put into the weapon/armor. This is meant to add some challenge for blacksmiths who want to improve their skill. (so they can\\'t repeatedly smelt and reforge daggers)\r\n\r\nIf you find any metal items in Skyrim (other than those listed above) that cannot be melted down then please leave a note in the comments. I probably missed a few.\r\n\r\nCertain glazed jugs and bowls can be melted down into malachite.\r\n\r\nEnchanted items can not be melted down.\r\n\r\nImproved items can be melted down.\r\n\r\n\r\nAny suggestions, comments, and/or constructive criticism are welcome.\r\n\r\nPlease give me as much feedback as possible.\r\nI want to make this mod enjoyable for everyone.\r\n\r\nPlease visit my Projected changes for subsequent updates discussion if you want to have a say in the changes in the next update.\r\n\r\nI am going to make a second version of this mod that allows for items from the dragonborn DLC to be melted down. It will take quite a while so don\\'t expect it to be released for at least four more days.\r\n\r\nPlease give me a thumbs up if you like the mod.",
  "categoryId": "100",
  "version": "1.3",
  "author": "Derangedhk417 robinsonadam83 on steam",
  "createdUnix": "1374889913",
  "updatedUnix": "1374889903",
  "containsAdultContent": false,
  "uploadedBy": "derangedhk417",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000041104",
      "name": "Item Recycling",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Item Recycling-38901-1-3.zip",
      "uploadedUnix": "1374889903",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/68edbc9fcb80fb5fe2f60fff51d5e843c42aaa5d9fd91628c51a5bfaa37f95ea/analysis/1407656768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Item%20Recycling-38901-1-3.zip?fid=1000041104&ttl=1535819327&ri=8192&rs=8192&setec=df465f1e2165586709c7837b1d9dc22a"
    }
  ]
}