{
  "modId": 38928.0,
  "modName": "Skyrim Shodow Bug Fix",
  "summary": "FIx for Shadow Problem",
  "descriptionHtml": "In some cases happens that the game gives problems with shadows, or the shadows cast onto the personage instead of projecting on the world by creating an annoying effect. Instead of removing the shadows, at least with me, it was enough to pass this file, depending on your video card, and the problem is fixed. :)\r\nI noticed that these files are not present on the site and in good faith, I load them on another to not have problems with the site. :)\r\nIt\\'s not exactly a mod.\r\nBasically it is a file that increases the performance of the video card by adjusting the problem.\r\nBy installing the new patch, or updates, this file may be lost and with it the shadows are not cast on the character.\r\nFor example, if you like me you have done mission to repair the tree in the square of Whiterun passing them under the shadows of the leaves will not be projected on your back but all over the world giving a continuous color change.\r\nThis dll file makes sure that does not happen. :)\r\n\r\nI did not create these files. I\\'ve just downloaded from mediafire.com and dll-files.com\r\n\r\nYou pass the file on the Data folder of Skyrim. :)\r\n\r\nREMEMBER: IS A .dll FILE!\r\n\r\nDOWNLOAD: Since many people are complaining about the file format or another, I upload them to the third party websites and you can find below the link:\r\n\r\nFor ATI: https://www.4shared.com/zip/hFGl7Q22/Skrim_FPS_Increase_AMD_GPU_Ver.html?\r\n\r\nFor nVidia: https://www.4shared.com/zip/aHnMls9Q/Skyrim_FPS_Increase_nVidia_GPU.html?\r\n\r\nThis is a site that I use often, simply register with facebook or twitter and you will do the download.\r\nI\\'m sorry, but rules are rules.",
  "categoryId": "95",
  "version": "1.0",
  "author": "Torllay",
  "createdUnix": "1374918992",
  "updatedUnix": "1374918992",
  "containsAdultContent": false,
  "uploadedBy": "Torllay",
  "primaryFile": null,
  "files": []
}