{
  "modId": 38955.0,
  "modName": "The Shadow of The Underking",
  "summary": "&#34;Ages ago a Hero entered the Sanctum of Sancre Tor to recover the blood of a God, now you are called to finish what he started&#33; An ancient evil is sneaked back in these old ruins and his power is growing once again to invade the living&#39;s world with death and terror..The Underking has to be stopped&#33;&#33;&#33;&#33;\r<br />Claim his ash",
  "descriptionHtml": "[color=#FF0000]HERE IS A WIKI OF THE WHOLE DUNGEON PERFECTLY DESCRIBED BY ICECREAMASSASSIN: http://legacy-of-the-dragonborne.wikia.com/wiki/Sancre_Tor\r<br />it contains descriptions and many screens of the place..enjoy ;)\r<br />\r<br />VERY IMPORTANT UPDATE&#33;&#33;&#33; 20/06/2014:[/color]\r<br />I started a cooperation with Icecreamassassin to level design some of the main quest dungeons of his massive mod: &#34;Dragonborn Gallery&#34;. All level design of Pale Pass, Numidium Glade and Sancre Tor&#39;s dungeons and worldspaces are designed by me, the rest of the stuff included in the mod are credited to him and the other cooperative members of the community&#33;\r<br />here is the link: http://www.nexusmods.com/skyrim/mods/52248/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D52248%26preview%3D&pUp=1\r<br />\r<br />download it in V8 BETA and help us with feedbacks and bugfix signalations&#33;&#33;&#33;thanks&#33;&#33;&#33;&#33;\r<br />\r<br />[color=#FF0000]UPDATE  13/08/2013:[/color]\r<br />we were planning to release in the next weeks an optimized version to improve gamplay fluidity, more intuitive installation and adding more content: new stuff, main quest, better balanced monsters, bugfixes and lights overhaul, navmesh fixing (now the catacombs won&#39;t have already awaken mummies standing senseless near their tombs)&#33; the work is almost finished but needs a bit of testing before release so please be patient :) \r<br />\r<br />[color=#FF0000]UPDATE 08/08/2013:[/color]\r<br />Me and Hebrock are working on a main quest adding semi-cinematics dialogues and much more stay tuned ;)\r<br />\r<br />my page on ModDB: http://www.moddb.com/mods/the-shadow-of-the-underking \r<br />\r<br />[color=#00FF40]- A Bit Of Lore:[/color]\r<br />&#34;Zurin Arctus was the Imperial Battlemage of Tiber Septim. He was responsible for resurrecting the Numidium, a powerful golem that helped Tiber Septim to conquer Tamriel. Upon the destruction of the Numidium, Arctus was either killed by or transformed into the Underking, according to different accounts.\r<br />The Numidium was powered by the Mantella, a powerful gem infused with the heart (life force) of a person. According to one account, Zurin Arctus sacrificed his own heart to the Mantella. After using the Numidium to conquer Tamriel, Zurin and Tiber Septim disagreed over how to continue using the Numidium. When Zurin tried to reclaim his heart, it was blown into Aetherius, destroying both the Numidium and Zurin. Zurin was left in a semi-slumber in a subterranean vault, waiting for an opportunity to reclaim his heart. In his undead shape, Zurin Arctus became known as the Underking, and from time to time he sent out his forces to find the Mantella throughout Tamriel. During the events of The Warp in the West, the Underking was able to retrieve his heart, and finally passed into true death.\r<br />However, in another account (see The Arcturian Heresy), it is written that the Underking was, in fact, King Wulfharth of Skyrim, a powerful undead being from the First Era. He was tricked by Tiber Septim and Zurin Arctus, and his soul was trapped into the Mantella to fuel the Numidium. Zurin Arctus himself was killed in the process. To prevent some political unrest, Tiber Septim stated that Zurin Arctus tried to assassinate him.\r<br />It is rumored that the Underking assisted Almalexia in destroying Kamal&#39;s king Ada&#39;Soom Dir-Kamal at Red Mountain, when he attempted to conquer Morrowind. It is also speculated in the West that Zurin Arctus brokered the agreement between Tiber Septim and Vivec over the fate of Morrowind, and enchanted the famous Dragonbone cuirass.\r<br />He is mentioned by one of four former Blades, Rielus (who was sent to the catacombs of Sancre Tor by Tiber Septim to discover the source of the evil infestation), as his captor who made him haunt the catacombs after death, and the one who sealed off the room containing Septim&#39;s armor and populated the site with undead minions. Mannimarco, the King of Worms, also claims that he had a long, ineffective conflict with the Underking.&#34;\r<br />\r<br />from http://www.uesp.net/wiki/Lore:Zurin_Arctus\r<br />\r<br />&#34;But after nine months that mound of mud became as a small mountain, and there were whispers among the shepherds and bulls. A small community of believers gathered around that growing hill during the days of its first churning, and they were the first to name it the Golden Hill, Sancre Tor. And it was the shepherdess Sed-Yenna who dared climb the hill when she heard his first cry, and at its peak she saw what it had yielded, an infant she named Reman, which is &#39;Light of Man.&#39;&#34; — Remanada \r<br />Sancre Tor was a fortified city once conquered by Tiber Septim that later fell into ruins. The mythical birthplace and final resting place of Reman Cyrodiil,it is located in the Jerall Mountains in Colovia, north of the city of Chorrol.In 2E 852, the city was captured by invading forces from High Rock and Skyrim. General Talos, who would later become Tiber Septim, recaptured the city that winter,however as the city was in a strategically inconvenient position it was then abandoned. The old fortress of Sancre Tor was later corrupted by the Underking, prompting it to be sealed shut by the Grandmaster of the Blades in the 36th Year of the Reign of Tiber Septim.In the years after Tiber Septim&#39;s reign it was gradually forgotten, decaying into a haunted ruin. The Champion of Cyrodiil would visit the ruins in the year 3E 433 to recover the armor of Tiber Septim.&#34; \r<br />\r<br />from http://www.uesp.net/wiki/Lore:Sancre_Tor \r<br />\r<br />[color=#00FF40]- The Lore Nowadays:[/color]\r<br />&#34;Ages ago a Hero entered the Sanctum of Sancre Tor to recover the blood of a God, now you are called to finish what he started&#33; An ancient evil is sneaked back in these old ruins and his power is growing once again to invade the living&#39;s world with death and terror..The Underking has to be stopped&#33;&#33;&#33;&#33;\r<br />Claim his ashes from the darkest burials you&#39;ve ever seen and save the Nord from his spectre&#33;&#34;\r<br />(from http://www.uesp.net/wiki/Lore:Zurin_Arctus)\r<br />\r<br />[color=#00FF40]-Introduction:[/color]\r<br />this is a long time planned mod to take back in TES V the scariest atmospheres of the TES IV: Oblivion dungeons...\r<br />i&#39;ve worked hard, very hard and for tens of hours so, please, if you enjoyed the mod or part of it take 2 minutes to leave a feedback and/or an endorsement&#33;thanks for your support ;)\r<br />This file (quiet heavy with his &gt;200MB...) includes new retextures, new models and some new creatures types...a new world location accessible from the main map of skyrim\r<br />\r<br />at this stage the release is a BETA, because i&#39;ve only tested it on my own PC, the compatibility shold be almost total with any mod that does not modify the sape portal spot to the new world location&#33; during the development i&#39;ve fixed the issues that i found but this does not mean that there are no more glitches or navmesh holes...i will release fixed versions accoriding to users segnalations ;)\r<br />I used 2 mods really useful to expand the content of this mod so please tak a look to their creators&#39; other works too ;) highly reccomanded&#33;&#33;&#33;\r<br />\r<br />all doors locked by keys require a specific key you may recover in chests, bodies or in altars &#33;they are not hidden but you won&#39;t stumble on it :D good luck and have fun&#33;&#33;&#33;&#33;\r<br />\r<br />[color=#00FF40]- Summary:[/color]\r<br />- New Location, including a small scale new world space of a fortress south of helgen, along the street that goes to the skyrim-cyrodiil&#39;s border\r<br />- New retextures of almost any model i used so you won&#39;t find the normal boring textures but improved ones&#33;\r<br />- New undead creatures, with new effects and with unusual equipments&#33;&#33;\r<br />- New powerfull retextured weapons resides in the undeads&#39; hands, rip them out from their frozen bodies&#33;&#33;&#33;\r<br />- Totally new architectonic styles studied for a more deep immersion in the lore\r<br />- No Quest have been added because of my luck of time and skill in scripting :( i&#39;ve planned in second times to learn and add new content or cooperate with someone much more skilled ;)\r<br />\r<br />[color=#00FF40]- Requires:[/color]\r<br />ONLY DAWNGUARD, the other 2 modes are included but its appreciated if u go on the link and give the endorsements because they are really incredible&#33;&#33;&#33;\r<br />\r<br />[color=#00FF40]- Compatibilities:[/color]\r<br />I guess uncompatibility may occur modifying the same location spot of the gate of Sancre Tor :( reports says that my mod won&#39;t be compatible with &#34;The Frontier to Cyrodiil&#34;, i&#39;m sorry but these 2 mods are defenitely NOT compatible and WON&#39;T be compatible in the future (thanks to FallenTormentor for the report).\r<br />\r<br />[color=#00FF40]- Credits:[/color]\r<br />credits to aBaDmAn91 for his permission and collaboration using Dai-Katans&#33; (link to his page http://skyrim.nexusmods.com/users/543308 and the link to his mod for Dai-Katanas http://skyrim.nexusmods.com/mods/10158 )\r<br />credits to skyrimaguas  for his permission and collaboration using Mountains High Quality Retextures&#33; (link to his page http://forums.nexusmods.com/index.php?/user/6256260-skyrimaguas/ and link to his mod http://skyrim.nexusmods.com/mods/37256/ )\r<br />\r<br />[color=#00FF40]- Installation:[/color]\r<br />unpack the .7z file then place in your skyrim/data folder all the material you&#39;ll find in it, if required click &#34;yes&#34; to overwrite&#33;the only thing that will require overwrite is the  skyrimaguas  texture mod that sobstitute textures of all mountains&#33;\r<br />\r<br />[color=#00FF40]- Permissions:[/color]\r<br />ALWAYS ask me for anything you want to make with my and the others collaborators&#39; work, is prohibited to upload or modify this mod&#33;any other copies on other sites are not allowed..respect my choise please&#33;",
  "categoryId": "88",
  "version": "1",
  "author": "mybad",
  "createdUnix": "1375638460",
  "updatedUnix": "1375617773",
  "containsAdultContent": false,
  "uploadedBy": "mybad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000044068",
      "name": "version 1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "123123",
      "fileName": "version 1-38955-1.7z",
      "uploadedUnix": "1375617773",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0bc5a8351774c19801cf5ecb2aa8e2a867df131fbea48f5a381afba362f81f17/analysis/1407668558/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/version%201-38955-1.7z?fid=1000044068&ttl=1535819365&ri=8192&rs=8192&setec=ccba2fdc8f5af2863caeaced30a38c1d"
    }
  ]
}