{
  "modId": 3897.0,
  "modName": "FluxMOD - Destruction Tree Reloaded",
  "summary": "This mod dramatically changes the Destruction tree but it does not ruin it. It makes it unique and REALLY USABLE only for Mage characters. Melee will have use of the spells also of course, but main spells (projectiles and dps spells) are adjusted for Mage play. Cloaks, Runes and similar can be used by Melee without any problems, spells too if you h",
  "descriptionHtml": "// IMPORTANT NOTE\r\n\r\nTHIS MOD IS FOR SERIOUS MAGE PLAYERS ONLY. ANYONE WHO GOES FOR ZERO MAGICKA COST - THIS MOD IS NOT MEANT FOR YOU.\r\n\r\n--- VERY IMPORTANT: THIS MOD IS FOR PLAYERS THAT ARE ATLEAST ADEPT LEVEL DESTRUCTION AND MAGICKA RICH! BUT EXPERT IS PREFERABLE! IDEALLY MASTER. SPELLS HAVE BEEN GRANTED HIGH DAMAGE, BUT ALSO THEY COST A LOT. LIKE STAMINA IN MELEE.\r\n-- AGAIN - THIS MOD IS FOR MAGES AND CHARACTERS WITH OVER 70% MAGICKA INVESTMENT WHILE LEVELING UP! OTHERS CAN JUST GET A TASTE OF IT USING CLOAKS, RUNES AND SPELL HERE AND THERE.\r\n\r\nI will make a Remake that will fix magicka cost scaling, but for now this is what it is. This is because game is very stubborn with values so they had to be hardcoded. I will have Auto Calculation of Magicka fixed. So, same spell will cost same at level 1 or 50. Only thing to bring it down are perks. But as said, it will be fixed ASAP! This is a known issue.\r\n\r\n// MOD INFO / ABOUT / CHANGE\r\n\r\nThis mod dramatically changes the Destruction tree but it does not ruin it. It makes it unique and REALLY USABLE only for Mage characters. Melee will have use of the spells also of course, but main spells (projectiles and dps spells) are adjusted for Mage play. Cloaks, Runes and similar can be used by Melee without any problems, spells too if you have the magicka. Read the changes below and try the mod if you want more realistic and more rewarding Destruction Magic.\r\n\r\nWHY HAVE A BOW WITH 500 DMG AND NOT A SINGLE SPELL THAT CAN CAUSE THAT DAMAGE? EVEN IN 2-3 BLOWS? NOW YOU CAN!\r\n\r\n// ADDITIONAL INFORMATION\r\n\r\nThis is just a BETA Release. Based on your feedback and my continued work, I hope we can make a great mod together.\r\nSome credits go to authors of existing Destruction modifications for ideas and their work that made some changes possible.\r\n\r\nMod is still in heavy development. Any feedback will be carefully reviewed and any bugs will be corrected. And of course, new features will come. This is Version 0.1.\r\nIf you like it but don\\'t like some feature or how the setup is made, please comment and I will take it into consideration when making an update. Especially if more players agree!\r\n\r\n// MAIN MOD INFO - MODIFICATIONS MADE IN THIS BUILD\r\n\r\n--- // PERKS\r\n\r\nNovice Destruction - Cast Expert level Destruction spells for half magicka and increases the damage of all Destruction spells by 5%.\r\nApprentice Destruction - Cast Expert level Destruction spells for half magicka and increases the damage of all Destruction spells by 10%.\r\nAdept Destruction - Cast Expert level Destruction spells for half magicka and increases the damage of all Destruction spells by 15%.\r\nExpert Destruction - Cast Expert level Destruction spells for half magicka and increases the damage of all Destruction spells by 20%.\r\nMaster Destruction - Cast Master level Destruction spells for half magicka and increases the damage of all Destruction spells by 25%.\r\n\r\nAugmented Flames - Now instead Rank1: 25%, Rank2: 50%, you get Rank1: 50%, Rank2 :100%\r\nAugmented Flames - Now instead Rank1: 25%, Rank2: 50%, you get Rank1:50%, Rank2 :100%\r\nAugmented Flames - Now instead Rank1: 25%, Rank2: 50%, you get Rank1:50%, Rank2 :100%\r\n\r\n--- // RUNES\r\n\r\n- Increased damage to all Runes by 50% and increased base Magicka cost by 20% to compensate.\r\n- Added ability to drop 3 Runes at the same time. You can drop any type of rune. Either 3 Fire Rune, 2 Fire and 1 Frost or 1 Fire, 1 Frost and 1 Shock. It is your choice, but maximum is 3.\r\n\r\n--- // CLOAKS\r\n\r\n- Increased damage to all Cloaks by 50% and increased base Magicka cost by 20-25% to compensate.\r\n\r\n--- //  SPELLS\r\n\r\n--- Novice Spells\r\n\r\n- Damage increased for all Novice spells\r\n- Mana cost incresed for all Novice spells\r\n\r\n--- Apprentice Spells\r\n\r\n- Damage increased for all Apprentice spells\r\n- Mana cost incresed for all Aprentice spells\r\n- Some Tweaks were made\r\n\r\n--- Adept Spells\r\n\r\n- Damage increased for all Adept spells\r\n- Mana cost incresed for all Adept spells\r\n- Some Tweaks were made\r\n\r\n--- Expert Spells\r\n\r\n- Damage increased for all Expert spells\r\n- Mana cost incresed for all Expert spells\r\n- Some Tweaks were made\r\n\r\n--- Master Spells\r\n\r\nTo make Master Spells interesting and appealing to use, there have been modifications. Now Master Spells are well worth the use if for nothing else - the new effects.\r\n\r\n--- Blizzard -\r\n\r\n- Slightly increased Blizzard damage.\r\n- Increased Blizzard Magicka cost. Now, Melee cannot use it without at least 1 item with serious % Destruction Reduction enchant. Even then, they can cast it once or maybe twice depending on their Magicka.\r\n- Added a new feature to Blizzard to make it more appealing and realistic. Targets caught inside Blizzard are paralyzed from the cold for 3 seconds.\r\n\r\n--- Fire Storm -\r\n\r\n- Increased damage by 50%. Damage scales. Spell still does most damage to closest targets but damage to farther targets has also been increased by a quarter of Maximum damage. Closest recieve 100% of the damage. Targets that are farther from the center 75% and targets on the outer edge 50% of Total Damage.\r\n- Increased Fire Storm Magicka cost. Now, Melee cannot use it without at least 1 item with serious % Destruction Reduction enchant. Even then, they can cast it once or maybe twice depending on their Magicka.\r\n- Added a new feature to Blizzard to make it more appealing. Targets that are caught by Fire Storm will be knocked down for 3 seconds.\r\n\r\n--- Lightning Storm\r\n\r\n- Increased damage of Lightning Storm by 25%\r\n- Increased Magicka cost of Lightning Storm by 50%\r\n- Added a new feature to Blizzard to make it more appealing and better. Targets that are hit by Lightning Storm will be staggered for 3 seconds (2-3, depends on the mob) so they won\\'t rush you immediately.\r\n- Melee can still use Lightning Storm, but it is a question of Magicka how much damage will be they able to do.\r\n\r\nTHERE ARE MORE CHANGES THAT YOU WILL NOTICE WHEN PLAYING. I WILL INCLUDE THEM IN THE CHANGELOG SO YOU KNOW ALL.",
  "categoryId": "93",
  "version": "0.1",
  "author": "argie",
  "createdUnix": "1324138254",
  "updatedUnix": "1324138374",
  "containsAdultContent": false,
  "uploadedBy": "argie84",
  "primaryFile": null,
  "files": [
    {
      "fileId": "11348",
      "name": "FluxMOD_DestructionTreeReloaded_v01",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "FluxMOD_DestructionTreeReloaded_v01-3897.rar",
      "uploadedUnix": "1324138374",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/0e3831ad55672dc866ea88091d2edd2b40a319713109ea18243fbd4d7ed56855/analysis/1406529493/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FluxMOD_DestructionTreeReloaded_v01-3897.rar?fid=11348&ttl=1535759284&ri=8192&rs=8192&setec=dc366459f79997658dfd30e126ebedde"
    }
  ]
}