{
  "modId": 38988.0,
  "modName": "FRK",
  "summary": "Far Reach Keep, an ongoing personal work in progress.",
  "descriptionHtml": "Far Reach Keep is a personal custom player home built to fit my personal play style. But I figured that other players may enjoy this home so I am posting it here :)\r\n\r\nI basically wanted a player home that offered more than Hearthfire, but was not as extravagant as the majority of the good player homes on Nexus. This player home is pretty much empty and ready for the dragonborne to move in, you will not find shelves full of rare items or armor or pots of gold, its just a bare bones (but kinda cool in my opinion) keep. \r\n\r\n\r\n*Requires Hearthfires*\r\n\r\nLaw friendly.\r\nTrophy Stands for every type of trophy in the game.\r\nLoads of mannequins and weapon displays to show off loot.\r\nA library for all the books you collect.\r\nCrafting facilities.\r\nDedicated staff including a bard and trainers (WIP).\r\nLocation, West of Whiterun, you cant miss it.\r\n\r\n\r\nCurrent things that need fixing:\r\nWrite the keeps history and weave it into existing lore.\r\nSort out the Dragonsworn relationships and factions to make them all potential followers.\r\nFix the dragon so that it actually helps the dragonsworn when in range of the keep.\r\nBuild the quest (outline already done) so that the keep is constantly under siege.\r\n\r\n\r\nPlanned updates:\r\nAdd a dungeon that will hold displays for dragon priest masks and claws, and other special artifacts.\r\nAdd one or two fast travel portals (as I normally play with fast travel disabled)\r\nAdd a quest that makes the keep available to the player rather than just a freebie download as it is now :)\r\n\r\nRecommended Mods to go with Far Reach Keep (personal preference)\r\nFrostfall - http://skyrim.nexusmods.com/mods/11163/?\r\n\r\n\r\nAll comments and suggestions welcome, but please keep in mind that I made this player home for personal use.\r\n\r\n",
  "categoryId": "67",
  "version": "0.9",
  "author": "nobrot",
  "createdUnix": "1374968957",
  "updatedUnix": "1374968844",
  "containsAdultContent": false,
  "uploadedBy": "nobrot",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000041511",
      "name": "Far Reach Keep",
      "version": ".9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "371",
      "fileName": "Far Reach Keep-38988--9.zip",
      "uploadedUnix": "1374968844",
      "modVersion": ".9",
      "virusScanUrl": "https://www.virustotal.com/file/87c6af35de35031d4c54a0bedc6c1e39343897daf206e8aaa3fd04566dab42ad/analysis/1407657905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Far%20Reach%20Keep-38988--9.zip?fid=1000041511&ttl=1535819395&ri=8192&rs=8192&setec=f29213e5a7cab474e00faaf9dbb1a58e"
    }
  ]
}