{
  "modId": 39024.0,
  "modName": "Forestway Reststop",
  "summary": "A tiny immersion mod which adds a small tavern, general store and cottage into the Falkreath forest, a short distance up the road from Half-Moon Mill.",
  "descriptionHtml": "UPDATE v1.2\r\n===========\r\nOkay. Hopefully this will be the last for a few days at least. If you do find any other oddities or problems though, please do let me know!\r\n\r\nFixed:\r\n\r\n- Re-finalised interior navmeshes so NPCs/followers will exit on leaving.\r\n- Corrected selling hours for general store. This was also slightly wrong. -_-\r\n\r\nAdded:\r\n\r\n- Two tavern patrons. One Redguard male hunter and one Nord male hunter. They are there day and night and will trade as normal.\r\n\r\n(See Change Log below for full details of all updates) \r\n----------\r\n\r\nDescription\r\n--------------\r\n\r\nThis mod adds a small tavern, general store and cottage into the Falkreath forest, a short distance up the road from Half-Moon Mill. \r\n\r\nIt took about ten hours to make and is really very simple, with a low impact on the game. I made it simply because I felt that there was a big gap along the road between Falkreath and Rorikstead and wanted to add a simple trading and stop over spot for my personal use. As it was, I then decided that others might find it useful as well. So, here it is...\r\n\r\nThe general store is run by Jasmi, who buys and sell just about anything. She has 1500 gold by default. The store is open from 7am until 10pm. Jasmi will sandbox around the store between 7-8am before staying behind the counter for the rest of the day.\r\n\r\nThe tavern is run by sisters Kathia and Gisela. They sell a decent amount of standard tavern fare. Kathia works behind the bar between midday and midnight. She sleeps between midnight and 6am, then sandboxes until midday. Gisela works behind the bar between midnight and midday. She sleeps between midday and 6pm, then sandboxes until midnight.\r\n\r\nThere are, currently,  two beds in the back. The left one belongs to the sisters. The right hand one is free for you to use, no charge. I may change this at some later stage. There is also a chest on the floor near the bed which is marked \\'safe\\' to use (if you so wish) and does not respawn.\r\n\r\nThere are also two patrons in the tavern. A Redguard hunter and a Nord hunter. Both will be hanging around in there all day, and provide the normal hunter trading dialogue.\r\n\r\nAt the moment, the cottage is not populated and has no interior. This will change at some point, possibly adding another merchant.\r\n\r\nThe area has been cleanly renavmeshed, so you should have no general issues with NPCs. The only area I have left free of nvmeshing is a small area behind the general store and cottage for some additions I have planned there. But that will not affect you unless you try to get your followers to walk around in that small area.\r\n\r\nI have also fully cleaned the ESP with TES5edit, so you will have no issues with other content changing elsewhere. Any items (trees, rocks, etc) that I removed have been marked \\'initially disabled\\', and not \\'deleted\\'.\r\n\r\nChange Log\r\n-----------------\r\n\r\nv1.2\r\n\r\n- Fixed: Re-finalised interior navmeshes so NPCs/followers will exit on leaving.\r\n- Fixed: Corrected selling hours for general store. Jasmi was not trading between 7-9am.\r\n- Added: Two tavern patrons. One Redguard male hunter and one Nord male hunter. They are there day and night and will trade as normal.\r\n\r\nv1.1\r\n\r\n- Fixed: Corrected trading times for tavern as they were not trading after dark.\r\n- Added: Three external candle lanterns. One on the tavern sign and one each next to the tavern and general store doors.\r\n\r\nv1.0\r\n\r\n- Initial version.\r\n\r\n\r\nRequirements\r\n-----------------\r\nThis mod is tiny and requires nothing more than Skyrim. It uses no additional scripts or custom content.\r\n\r\nInstallation\r\n--------------\r\nExtract the archive to your Skyrim Data folder. It will not overwrite any other files (other than it\\'s own, should it be updated).\r\n\r\nUninstallation\r\n-----------------\r\nSave your game outside of the area the mod changes. Then untick the mod in your mod manager and delete the mods files. These are:\r\n\r\nMoirai - Forest Way Reststop.esp (file)\r\n\r\nData\\\\meshes\\\\actors\\\\character\\\\FaceGenData\\\\FaceGeom\\\\Moirai - Forest Way Reststop.esp (folder)\r\n\r\nData\\\\textures\\\\actors\\\\character\\\\FaceGenData\\\\FaceTint\\\\Moirai - Forest Way Reststop.esp (folder)\r\n\r\nCompatibility\r\n----------------\r\nWill only conflict with any other mod which changes this specific area of forest. Other than that, the mod is way too simple to clash with anything.\r\n\r\nLegal\r\n-------\r\nDo not redistribute this mod as it is, or in any modified form. Thanks.\r\n",
  "categoryId": "53",
  "version": "1.2",
  "author": "Moirai",
  "createdUnix": "1375034379",
  "updatedUnix": "1375104632",
  "containsAdultContent": false,
  "uploadedBy": "moirai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000041820",
      "name": "Forestway Reststop",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "729",
      "fileName": "Forestway Reststop-39024-1-0.zip",
      "uploadedUnix": "1375034369",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/500124597e4ba92bdfd1f4cc50785c73eeb540649b6e04a767e74a1ed56b5ead/analysis/1407658565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forestway%20Reststop-39024-1-0.zip?fid=1000041820&ttl=1535819427&ri=8192&rs=8192&setec=83b81b106ed88499d6757b72b9f04622"
    },
    {
      "fileId": "1000041960",
      "name": "Forestway Reststop",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "730",
      "fileName": "Forestway Reststop-39024-1-1.zip",
      "uploadedUnix": "1375097512",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a5c7fd2f69a90466dc28df892374c8458a0dc8616da6eaa56c4efa45c33179df/analysis/1407659233/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forestway%20Reststop-39024-1-1.zip?fid=1000041960&ttl=1535819427&ri=8192&rs=8192&setec=eeaf17e4167bda77ca00743734407516"
    },
    {
      "fileId": "1000041983",
      "name": "Forestway Reststop",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1235",
      "fileName": "Forestway Reststop-39024-1-2.zip",
      "uploadedUnix": "1375104632",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/28b8c3e358ea184b604d6a0ffe3129327cfb1392dd4bbb965589ae3866f1a81a/analysis/1407659348/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forestway%20Reststop-39024-1-2.zip?fid=1000041983&ttl=1535819427&ri=8192&rs=8192&setec=5f443249440427163a286d7a408c785f"
    }
  ]
}