{
  "modId": 39055.0,
  "modName": "Aerith and Yuffie Staffs and Weapons",
  "summary": "Adds Aerith&#39;s Fairy Tale, Guard Staff, Princess Guard, and a weaponized flower basket. Also adds Yuffie&#39;s shuriken, razor ring, and pinwheel. Last but not least: moogles&#33;",
  "descriptionHtml": "Update V1.6 - Final&#33;\r<br />\r<br />&#34;Probably&#34; won&#39;t update this again . . . so enjoy the final spoils:\r<br />\r<br />[melee]\r<br />. Yuffie&#39;s pinwheel weapon - wielded like a sword\r<br />. Yuffie&#39;s razor ring - wielded like a dagger (work well for dual wield).\r<br />. Combat moogle - Yes, you can pummel your enemies to death with a moogle&#33;  Betcha always wanted to that? =P  Wields like an axe.  I chose to offset it a bit so it wouldn&#39;t be &#34;half emerged into your leg&#34; when sheathed.  So now it sorta &#34;floats&#34; next to you when not in use.  Which could be cool if you want a little moogle levitating right next to you.\r<br />\r<br />[staff]\r<br />. Fire Moogle - Your fiery pal.   Sits on your hand--I sorta thought of Lulu&#39;s dolls from FF-X as inspiration.  Unfortunately the magic effect is way out in front like it&#39;s a staff you&#39;re holding\r<br />. Frost Moogle - Frosty&#33;\r<br />. Sparks Moogle - Electrifying\r<br />\r<br />[shield]\r<br />. Something called a &#34;Moogle Booster Shield.&#34;  What does it do? It speeds up stamina regeneration by 50%.  Wield with the combat moogle for a balanced set. =P\r<br />\r<br />[props]\r<br />. A useless doll\r<br />. An even more useless statue--for amusement factor only.  Crouch (sneak) for the best odds of it &#34;landing&#34; upright.\r<br />\r<br />--One additional change is an adjustment to the hand position for the shuriken, which was a bit too close to the center I thought before.\r<br />\r<br />***\r<br />\r<br />Update V1.5 - Mod known now as &#34;Aerith and Yuffie Staffs and Weapons.&#34;\r<br />. Add&#39;s Yuffie&#39;s shuriken.  For now that&#39;s the only Yuffie item, but I may add more later.\r<br />. Wielded like one-handed sword--which was in part necessity since because when I originally had it as an axe, it clipped badly when not wielded (due to some axis adjustments required so it didn&#39;t clip the arm when wielded).\r<br />\r<br />***\r<br />\r<br />\r<br />Update V1.4 - Small (weaponized) flower basket:\r<br />. One of Aerith&#39;s signature items is her beloved flower basket.  So I created a small one that can be equipped either as a shield or a one-handed weapon, based on an axe--don&#39;t expect it to sit well on the hip when not wielded.  ^^&#39;&#39;&#39;&#39;\r<br />. I also tweaked the textures of the Fairy Tale staff, specifically with the gold metal and wood.\r<br />\r<br />Before you install I would unequip any of the staffs in this mod and do a new save--just in case you get a CTD (it would be mainly due to the texture changes to the Fairy Tale).\r<br />\r<br />The basket mesh is my own creation, but the flowers inside the flower basket are vanilla Skyrim ones.\r<br />\r<br />\r<br />****\r<br />\r<br />Update V1.3 - Fairy Tale Staff:\r<br />. Finally the mysterious staff is revealed&#33;  *Listens for an appreciative crescendo of applause*  *Hears only silence*  Well, I&#39;m sure everyone is just off doing something else at the moment. =P  *ahem*\r<br />\r<br />** IMPORTANT **\r<br />. Make a new game save before you install--just to be on the safe side.\r<br />. See the note about the EX version of the staff (invisibility and funky eyes) before you use the EX version.\r<br />\r<br />The following staffs are are added to the game:\r<br />. Fairy Tale Ultimate: A shield-based staff that has three levels of enchantment (which I call the &#34;Great Gospel&#34;): fortify health (50), magicka (100), and stamina (25) [active effect]; Regenerate health, magicka, stamina twice as fast while blocking; cast Guardian Circle when a power bash is done (related power bash perk for Blocking must be unlocked).\r<br />. Fairy Tale of Paralysis: Standard staff that casts Paralyze.\r<br />. Fairy Tale of Shiva: Standard staff that casts Icy Spear.\r<br />. Fairy Tale EX (caution if using&#33;): A shield-based staff that boosts health and magicka, and when blocking makes you invisible.  WARNING: your eyes may go &#34;funky&#34; after using the invisibility, restarting your game should fix it.  I&#39;m not sure why it does that, it&#39;s just using a normal invisibility effect--albeit in a way not intended . . . (seems to be a known game bug with invisibility)\r<br />\r<br />****\r<br />\r<br />Update V1.2 - Metal texture tweak & 2-handed Melee version of the Guard Staff:\r<br />The mysterious new staff (mentioned in my post) is not included in this update (still have a ways to go on that).  I thought, though, with the addition of a two-handed melee staff (three versions), an update was warranted.  If, however, you prefer the more plastic-like (IMO) texture of the Guard Staff, you may wish to skip the update, or revert to V1.1\r<br />\r<br />New Guard Staffs:\r<br />. Guard Staff 2H: Unechanted; 50 base value for damage (will vary by perk or other active affects).\r<br />. Guard Staff 2H Chill: Enchanted; deals 30 points frost damage with a chance to paralyze target for 2 seconds\r<br />. Guard Staff 2H Fury: Boosts Elemental Fury by 10+ (the staff has a swirling effect when wielded).\r<br />\r<br />[Highly recommended to make an extra save before you install the mod] \r<br />\r<br />****\r<br />\r<br />UPDATE V1.1 - Guard Staff:\r<br />Before you install I HIGHLY recommend making a new save.  I&#39;ve found even the most minor of changes can cause CTDs when you install from your last save (even a simple texture update has done this for me @_X).\r<br />\r<br />WHAT&#39;S NEW:\r<br />Adds Aerith&#39;s Guard Staff to the game in five versions:\r<br />. Guard Staff: Shield staff that boosts your health.\r<br />. Guard Staff of Smite: Shield staff that boosts destruction magic (I think . . . I set it, but there doesn&#39;t seem to be any obvious way of telling if it actually is)\r<br />. Guard Staff of Fire: Enchanted staff with Fireball.\r<br />. Guard Staff of Frost: Enchanted staff with Frostbite.\r<br />. Guard Staff of Light: Enchanted staff with Magelight (I actually itended this to be a heal self staff, but there doesn&#39;t appear to be any staff echantments like that.  Perhaps when I get more adept at the CK I&#39;ll make one--but my attempts to turn the Guardian Circle spell into a staff enchantment failed miserably T_T).\r<br />\r<br />As with the Princess Guard you can either get these with console commands (help &#34;Guard Staff&#34;) or by forging.\r<br />\r<br />This is a FULL update, so it will replace the original version (V1).\r<br />\r<br />I probably won&#39;t update this mod again.  If I do another mod (no promises) it may or may not be Aerith related. =P\r<br />\r<br />****\r<br />\r<br />ABOUT V1: \r<br />Adds Aerith&#39;s Princess Guard staff to the game.  Two are shield-based, and two normal staves:\r<br />. Princess Guard: Shield enchanted to boost recovery rate (50%)\r<br />. Princess Guard EX: A clone of the Spellbreaker--when blocking an added magic effect of a ward is added.\r<br />. Princess Prayer: Enchanted staff with Heal Other\r<br />. Princess Smite: Enchanted staff with Wall of Storms\r<br />\r<br />\r<br />****\r<br />\r<br />Items can be acquired either by the ever omnipotent command console (use the above names for searching) or crafted at a blacksmith forge, under the MISC category.\r<br />\r<br />****\r<br />\r<br />This is my first game mod--ever, so no doubt I could have done this or that better.  Hopefully you&#39;ll find it &#34;passible.&#34; =P\r<br />\r<br />Also, I highly recommend Hardarg&#39;s Aerith Clothing mod to complete the Aerith Gainsborough experience: http://skyrim.nexusmods.com/mods/30977\r<br />\r<br />~ Credits & Thanks ~\r<br />. Hardarg for the Aerith outfit which inspired me to make the staffs\r<br />. Mr Dave for his Texture Resource (http://skyrim.nexusmods.com/mods/2324)",
  "categoryId": "36",
  "version": "1.6",
  "author": "Denki Groove",
  "createdUnix": "1375069294",
  "updatedUnix": "1401505038",
  "containsAdultContent": false,
  "uploadedBy": "denkigroove",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052659",
      "name": "Aerith Staff V1_4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6437",
      "fileName": "Aerith Staff V1_4-39055-1-4.zip",
      "uploadedUnix": "1378435227",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/9f32032661be0100f14ddd1e7fa9858dc3363f0e77957c3f530d37846b683033/analysis/1407710916/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aerith%20Staff%20V1_4-39055-1-4.zip?fid=1000052659&ttl=1535819475&ri=8192&rs=8192&setec=9424ed6a73d08bfe38dd20fdbbc901d0"
    },
    {
      "fileId": "1000110352",
      "name": "Aerith and Yuffie weapons V1_5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8616",
      "fileName": "Aerith and Yuffie weapons V1_5-39055-1-5.zip",
      "uploadedUnix": "1400974110",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/99ac6974f17748400e1b91717efea2bcca241b00bd83c9dc93a4781453ebc6d0/analysis/1408095546/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aerith%20and%20Yuffie%20weapons%20V1_5-39055-1-5.zip?fid=1000110352&ttl=1535819475&ri=8192&rs=8192&setec=6c7ac088f6fccd8c04033b987f4f1133"
    },
    {
      "fileId": "1000111169",
      "name": "Aerith and Yuffie weapons V1_6",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12107",
      "fileName": "Aerith and Yuffie weapons V1_6-39055-1-6.zip",
      "uploadedUnix": "1401505038",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/429cd55e538a6b2f830b73e6c786e453d2aaa33bd94f16b28be0f9a15c531b26/analysis/1408103477/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aerith%20and%20Yuffie%20weapons%20V1_6-39055-1-6.zip?fid=1000111169&ttl=1535819476&ri=8192&rs=8192&setec=71be7d1f7cb2043cc1927cc928274999"
    }
  ]
}