{
  "modId": 39054.0,
  "modName": "Simple Melee Tweaks",
  "summary": "Script-based, player-centric combat overhaul for TESV Skyrim. Requirements: Skyrim 1.9, SKSE 1.06.16, MCM. The mod includes: stagger system, new AI behaviors, stamina changes, dodging, and timed blocking. \r\n",
  "descriptionHtml": "Simple Melee Tweaks\r\nby Tiny Lampe\r\nversion: 2.7b\r\n\r\nThis mod is a script-based, player-centric combat overhaul for TESV Skyrim. \r\n\r\nRequirements: \r\n-----------------\r\nSkyrim 1.9, SKSE 1.6.16, SkyUI (for the MCM)\r\n\r\nImportant technical note and mod limitations: \r\n--------------------------------------------------------\r\nScripts are spread using a cloak spell. Although care has been taken to avoid conflicts with brawl-related quests, please use http://skyrim.nexusmods.com/mods/24020/? if you still have any.\r\n\r\nThis mod only affect fights where the player is one of the contenders. Meaning: if the player fights a wolf, the fight will be enchanced by my mod. If any other actor (Lydia, a mudcrab...) fights the same wolf, then the fight will remain 100% vanilla. That\\'s why I call this mod \\'player-centric\\'. That\\'s a limitation I\\'d like to address, but I need new SKSE functions for that. \r\n\r\n\r\nFeatures\r\n-----------\r\n\r\n----- 1. Player staggers when hit. If the player fails to block a physical attack with a shield/weapon or a magic attack with a ward, then he will stagger. \r\n--The intensity of the stagger depends on the strength of whatever hit the player. A hit from a large creature will make the player touch the floor with his knee while a hit from a 1H weapon will only make him lose balance for an instant. \r\n--Since the purpose of the staggers is immersion instead of frustration, most staggers are only cosmetic. Meaning: they do not impede movement. Any attacks started before getting staggered will be interrupted however. This is to discourage button mashing and to prevent unrealistic behaviors like being able to draw a bow while roasted by a flames spell. \r\n--The only staggers that prevent movement and will leave you defenseless are those that come from arrows and projectile spells. There are ways to turn those \\'full-body\\' staggers into cosmetic staggers however: against arrows, it\\'s enough to wear a heavy cuirass. Against spells, it\\'s enough to have a magic/elemental resistance that is at least equal to the magnitude of the incoming spell (exampple: if you have a magic resistance or fire resistance of 25%, firebolts (that has a magnitude of 25) will only cause cosmetic stagger while fireballs (that has a magnitude of 50) will cause full-body stagger).\r\n\r\n\r\n----- 2. Opponents stagger when hit if hit hard enough.\r\n--In general, if you manage to take 25% of the opponent\\'s CURRENT health with one hit, that opponent will stagger. This system ensures that staggering a weakened opponent is much easier than staggering one in full health. Example: opponent has 300HP. To stagger him you need to deal 75 damage in one hit (0.25*300). After a bit of fighting, the opponent has only 50 HP. Now you only need to deal 12.5 damage in one hit (0.25*50) in order to stagger him. \r\n-- It doesn\\'t matter what you use to hit the opponent; tt can be melee weapons, arrows, spells or shouts.  \r\n-- Since the script only cares about whether you take 25% of an opponent\\'s remaining HP or not, any thing that reduces incoming damage (armor, spell resistances...) are automatically taken into account. This means that staggering an opponent in heavy armor will be harder than staggering an unarmored opponent. Similarly, staggering a Dunmer using fire spells will be harder than staggering a Nord.  \r\n-- there is a special reward for taking away 50% of an NPC\\'s current health in one hit: they will briefly kneel on the ground and, if you activate them at that moment, you will perform a weapon-dependent finishng move (impale for swords, decapitation for axes). \r\n \r\n\r\n------ 3. NPCs (but not creatures) try to avoid getting hit.\r\n-- NPcs that wear no heavy armor will dodge left or right when you throw arrows or spells at them. This behavior only occurs if they have line of sight with the player. The further away the NPC is, the more likely are his dodges to effectively evade incoming arrows and spells. \r\n-- NPCs that use a shield and are close enough will charge at you if you are in the process of drawing a bow or charging a spell. This is the same animation unlocked by the level-100 block perk \\'shield charge\\'. Unlike shield charge though, if the player gets hit we won\\'t be knocked down. He will be disarmed instead. As before, the NPC needs line of sight with the player in order to perform a charge. \r\n-- If you stagger a NPC with a melee weapon and that NPC is not wearing heavy armor, the NPC will perform a backwards dodge in an attempt to avoid being hit a second time. \r\n-- If you stagger a NPC with a melee weapon and that NPC is wearing heavy armor, the NPC will block and, sometimes, perform a bash in an attmept to neutralize any further attack from the player\r\n-- If you stagger a NPC who has a spell or staff equipped in his left hand, the NPC will teleport away from the player and reappear somewhere nearby. If the NPC knows how to heal himself, he is likley to do so now that he has created some distance between he and the player. \r\n\r\n\r\n------ 4. Player skill matters\r\n--Timed Blocking: By blokcing a swing right before getting hit you perform a timed block. Advantage: blocking effectiveness is doubled. Example: if a hit would normally deal 20 damage through a block, it will only deal 10 damage through a timed block. Stacks with shield wall perks. \r\n--Dodging: the player can perform a backwards dodge by pressing a user-configurable button (default K). 3 requirements need to be fulfilled in order to dodge: 1) weapons must be drawn, 2) you can\\'t wear a heavy cuirass, 3) you must be moving backwards while you press the dodge key. Dodging while wearing a light cuirass increases your light armor skill. For reasons beyond my control, dodging doesn\\'t work when both hand are empty or a spell or staff is equipped in either hand. \r\n--Stamina Management: if your stamina is above 75% your physical attacks deal 25% more damage. If you let your stamina drop below 25% then they deal 50% less damage. If you let your stamina drop to 0 then you will kneel on the ground for several seconds out of exhaustion. When in combat, stamina regenerates as fast as when out of combat provided that you are neither attacking nor blocking.  \r\n\r\n\r\nCompatibility\r\n-------------\r\n\r\nIf it has nothing to do with combat: compatible\r\nIf it has something to do with combat: it depends\r\n\tPerk mods: all compatible but one consideration: perks that increase weapon speeds should be avoided in order not to unbalance my stagger durations\r\n\tMods that alter combat styles (like enchanced enemy AI): compatible\r\n\tOther combat overhauls (deadly combat, DukePatrick\\'s...): not compatible \r\n\r\n\r\nInstallation, Uninstallation and upgrading\r\n------------------------------------------\r\n\r\nTo install place the script folder and the .esp file inside your data folder. Check the .esp file to activate the mod. Or install with a mod manager. For those who use WryeBash, mod is bain-ready\r\n\r\nUninstallation: this is a script mod so the only way to fully uninstall it is to remove all the files AND revert to a save file that has never seen the mod. \r\n\r\nUpgrading: simple install over and say yes when asked to overwrite. \r\n",
  "categoryId": "77",
  "version": "2.7b",
  "author": "Tiny Lampe",
  "createdUnix": "1375052727",
  "updatedUnix": "1377860656",
  "containsAdultContent": false,
  "uploadedBy": "tiny lampe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000041891",
      "name": "Simple Melee Tweaks",
      "version": "1.2a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "Simple Melee Tweaks-39054-1-2a.7z",
      "uploadedUnix": "1375051682",
      "modVersion": "1.2a",
      "virusScanUrl": "https://www.virustotal.com/file/de51058786ac4e8cbd220c44e6d5bd13dc4886c28573d87256074fe7cf5fff6f/analysis/1407658863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Melee%20Tweaks-39054-1-2a.7z?fid=1000041891&ttl=1535819471&ri=8192&rs=8192&setec=89357f0cdf87e0822f62978441209235"
    },
    {
      "fileId": "1000042853",
      "name": "SimpleMeleeTweaks_v1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "SimpleMeleeTweaks_v1_3-39054-1-3.7z",
      "uploadedUnix": "1375290294",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/24a59048c61b60b68deecafd0e3f5f3cc12f4e5df4ffba67d1f0a8f8e44b078c/analysis/1407663182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SimpleMeleeTweaks_v1_3-39054-1-3.7z?fid=1000042853&ttl=1535819472&ri=8192&rs=8192&setec=3fb5b4e6699242d452fa120f86a3b4a7"
    },
    {
      "fileId": "1000043519",
      "name": "SimpleMeleeTweaks_v1_3a",
      "version": "1.3a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "SimpleMeleeTweaks_v1_3a-39054-1-3a.7z",
      "uploadedUnix": "1375451025",
      "modVersion": "1.3a",
      "virusScanUrl": "https://www.virustotal.com/file/984be1734c51151fc7c85fe1965339bf03f93ddf0f800d2d10c2ef3b99495fb5/analysis/1407666436/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SimpleMeleeTweaks_v1_3a-39054-1-3a.7z?fid=1000043519&ttl=1535819472&ri=8192&rs=8192&setec=36cc888b66b52b96dd74d963eb5ab419"
    },
    {
      "fileId": "1000050778",
      "name": "SMT_v2_7b",
      "version": "2.7b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "SMT_v2_7b-39054-2-7b.7z",
      "uploadedUnix": "1377860656",
      "modVersion": "2.7b",
      "virusScanUrl": "https://www.virustotal.com/file/8e73b038146ab32e1e19928b7f0de2c445f8f8bc004595c2971f0499d324c3a9/analysis/1407702084/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SMT_v2_7b-39054-2-7b.7z?fid=1000050778&ttl=1535819473&ri=8192&rs=8192&setec=4edde6bf57ac6c88dd85b44a021685d1"
    }
  ]
}