{
  "modId": 39134.0,
  "modName": "The Legend of Zelda - Golden Goddess Spells",
  "summary": "Includes Din&#39;s Fire, Nayru&#39;s Love and Farore&#39;s Wind as well as two variants.",
  "descriptionHtml": "[url=http://www.nexusmods.com/skyrim/mods/40615]Included in Relics of Hyrule[/url]\r<br />This mod is no longer being maintained, as is provided &#34;as-is&#34;\r<br />\r<br />&#34;She made this sacrifice, as you have likely guessed, so that the supreme power created by the old gods could one day be used.&#34;\r<br />\r<br />Three gems are scattered throughout Skyrim that hold the knowledge needed to cast powerful spells blessed by the three Golden Goddesses: Din, Nayru and Farore. \r<br />Once these spells are known, two additional spells can be learned that increase the versatility of the spells.\r<br />\r<br />To learn the spells, first search in the Midden under the College of Winterhold for a long-forgotten Enchanting Table. The three gems must be returned to the table in order to learn the spells. The jewels are very difficult to find.\r<br />(see spoiler below, or the location video for more information)\r<br />\r<br />The spells are as follows:\r<br />--Din&#39;s Fire--\r<br />Similar to Fire Storm, the caster summons a conflagration that engulfs their surroundings, knocking foes back.\r<br />\r<br />--Nayru&#39;s Love--\r<br />Similar to Ebonyflesh, the caster is protected from magic and physical attacks for 60 seconds, while absorbing and occasionally reflecting magical attacks.\r<br />\r<br />--Farore&#39;s Wind--\r<br />A shockwave erupts from the caster, staggering foes. Time is slowed and the caster is rendered invisible, silent and ethereal for 12 seconds, allowing for escape from the fray of battle.\r<br />\r<br />You may be wondering why Farore&#39;s Wind is not strictly speaking teleportation spell. The reason is that I did not want to simply copy an already existing spell with little change. I also do not have the skills to make one from scratch. I wanted a relatively simple version that was similar to Zelda&#39;s ability in Super Smash Bros., but from the point of view of the caster. \r<br />The slowing of time accomplishes that, and the initial staggering blast makes the spell much more dramatic and useful for escape.\r<br />\r<br />\r<br />Once Nayru&#39;s Love and Din&#39;s Fire are learned, you can visit the Ancient Enchanter in the Midden to combine filled Grand soul gems with ruined books to create spell tomes of two additional spells:\r<br />\r<br />\r<br />--Din&#39;s Fireball--\r<br />The caster launches a fireball that engulfs its surroundings in flames, staggering and knocking foes to the ground.\r<br />\r<br />--Nayru&#39;s Ward--\r<br />The caster shields themselves from harm, reflecting magical attacks and reducing physical damage as long as the ward is held.\r<br />\r<br />\r<br />NOTE: Farore&#39;s Wind is listed as a Novice Spell by the game, despite its high Magicka requirement. If I can figure out how to fix this I will.\r<br />\r<br />\r<br />A video demonstrating all five spells:\r<br />[youtube]_02uQxucjKE[/youtube]\r<br />\r<br />\r<br />A video explaining the locations of the spells as well as the crafting of Din&#39;s Fireball and Nayru&#39;s Ward:\r<br />[youtube]gmfvItaCEXo[/youtube]\r<br />\r<br />\r<br />Below are detailed explanations of the locations of each jewel. In general, look for toppled and out of place soul gem holders.\r<br />[spoiler] Din&#39;s Ruby can be found in Silverdrift Lair, in the room past the word wall, behind a large burial urn.\r<br />Nayru&#39;s Sapphire can be found in Shroud Hearth Barrow, on a ledge in the boss room. Requires Whirlwind Sprint to reach.\r<br />Farore&#39;s Emerald can be found in a pond in Lost Valley Redoubt. It is the first pond you come across after walking up outdoor stairs. There are Forsworn tents nearby and a large cooking spit as well as hanging fish. The jewel is underwater, pushed into a corner by the currents of the waterfall. [/spoiler]",
  "categoryId": "75",
  "version": "1.1",
  "author": "JKalenad",
  "createdUnix": "1375144478",
  "updatedUnix": "1381266204",
  "containsAdultContent": false,
  "uploadedBy": "JKalenad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000042220",
      "name": "Spells of the Golden Goddesses",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Spells of the Golden Goddesses-39134-1.rar",
      "uploadedUnix": "1375141488",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6da986486b89e03d77402af3f210d94181ade99fe17326c890d6d01f2a8683a6/analysis/1407660624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spells%20of%20the%20Golden%20Goddesses-39134-1.rar?fid=1000042220&ttl=1535819559&ri=8192&rs=8192&setec=fcd5b59e8c566817df474ecd395cdf9d"
    },
    {
      "fileId": "1000047403",
      "name": "Spells of the Golden Goddesses 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Spells of the Golden Goddesses 1_1-39134-1-1.rar",
      "uploadedUnix": "1376702770",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2130efbed9b635cff299df105389a6c99fada3536bf41a077be0631918f7416d/analysis/1407684545/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spells%20of%20the%20Golden%20Goddesses%201_1-39134-1-1.rar?fid=1000047403&ttl=1535819559&ri=8192&rs=8192&setec=2cffe645f4db9059252fc41c9071d919"
    },
    {
      "fileId": "1000063377",
      "name": "Enchanter Mesh Fix",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58",
      "fileName": "Enchanter Mesh Fix-39134-.rar",
      "uploadedUnix": "1381266204",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/655c2a71502b9ce6c4f1cdacdfec6b1e24e7427f5bb135446685ad65933f2600/analysis/1407749886/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanter%20Mesh%20Fix-39134-.rar?fid=1000063377&ttl=1535819560&ri=8192&rs=8192&setec=dd8320692e0dd8677bd14e4bba803ee1"
    }
  ]
}