{
  "modId": 39193.0,
  "modName": "Assassins Whiterun Hideout",
  "summary": "When Whiterun was still under construction an old assassin was part of the designers. He made himself a hideout in the sewers beneith Whiterun. Since he died no one has found the entrence or the key to it. Now it is your turn to try and find it. The myth tels us the Old assassin went to solstheim many times when he lived.",
  "descriptionHtml": "Someone asked me to make an assassin themed player house with a way of getting in and out of whiterun without the guard noticing you so here it is.\r\n----------------------------------------------------------------------------------------------\r\n\r\nIn the early beginning of the holds whiterun was constructed.\r\nIn the design team was an old mysterious man. He drew the plans for the sewers.\r\nIn these plans was his new home. A hidden hideout. To get in and out of whiterun\r\nunnoticed.\r\n\r\nOnes construction of Whiterun was completed. The old man dissapeared.\r\nAnd so dis every other man that new of the sewers with him.\r\nMyths started to rise in the following centuries around this old man.\r\nOne of these was partionally confirmed by a letter from the old man,\r\nhe was an old assassin that tried to do justice for the poor, he confessed to the murders \r\nof all the other man that worked on whiterun but he didn\\'t confirm nor denied the excistence\r\nof the sewer hideout.\r\n\r\nNow centuries later no one knows if the old man did excist or that the sewerd do contain some sort of hideout. No one has found any entrence or evidence and the key that should open the entrence hasn\\'t been found either, speculation suggest it might be found in solstheim since most workers came from the island.\r\n----------------------------------------------------------------------------------------------\r\n\r\n",
  "categoryId": "67",
  "version": "1.00",
  "author": "Superstienos",
  "createdUnix": "1375209723",
  "updatedUnix": "1375209720",
  "containsAdultContent": false,
  "uploadedBy": "superstienos",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000042484",
      "name": "Whiterun Assassin Hideout",
      "version": "01.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37",
      "fileName": "Whiterun Assassin Hideout-39193-01-00.7z",
      "uploadedUnix": "1375209720",
      "modVersion": "01.00",
      "virusScanUrl": "https://www.virustotal.com/file/f818a8ae0850c8ace968166efec274311662f77e631a1261a4ea18bb6d215e53/analysis/1407661689/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whiterun%20Assassin%20Hideout-39193-01-00.7z?fid=1000042484&ttl=1535819624&ri=8192&rs=8192&setec=aebc944b80ea685ac589ba47f1d9302c"
    }
  ]
}