{
  "modId": 39221.0,
  "modName": "Sleeth the Magnificent -- Storm Dragons come to Skyrim",
  "summary": "Ah, what to do when you\\'re incredibly powerful and have no dragons left to conquer and enslave... \r\n\r\nLOOK OUT! RUN FOR COVER! STORM DRAGONS!!!!!!!! \r\n\r\nThis is the legacy of Sleeth the Magnificent, your first encounter with a Storm Dragon. \r\n",
  "descriptionHtml": "Ah, WHAT TO DO when you\\'re incredibly powerful and have no dragons left to conquer and enslave...or at least past the majority of the main quest line so you don\\'t get killed with every dragon encounter, including the intro scenario with \\\"Alduin the Wimpy\\\"... \r\n\r\nLOOK OUT! RUN FOR COVER! STORM DRAGONS!!!!!!!! \r\n\r\nThis is the legacy of Sleeth the Magnificent, your first encounter with a Storm Dragon. \r\n\r\nThese arrogant, vengeful, respawning terrors of the sky are here to RAIN holy hell down on your peaceful Skyrim world just when you thought you were invincible. As their name suggests, they have STORM bringing abilities, not ordinary fire or frost. They bring new meaning to the use of Dragon Shouts! These massive reptiles of doom come in various colors, races and even return from the dead as Skeletal dragons to kick the crap out of peaceful places in Skyrim. Lucky you, a worthy opponent! They level up with you, so get ready to die a couple of times when they stomp the mud out of you, steamblast you until you\\'re parboiled, zap you with lightning from the sky, bite you in half or blast you against the wall a few times. And they have plenty of hit points so they get a fair shot at you before you beat them into submission and try to ride them around like a pony. Yes, Dragonborn, ride them around. This mod is compatible with the Dragonborn DLC, but does not require it or any other DLC to run. And yes, we rode them around a bit, so they are wary of you and your humiliating acts of submission. \r\n\r\nMeet Sleeth the Magnificent both in young and Elder form. He is the first to establish his domain in Helgen after Alduin decimated it, and you can arrive on the scene to see him pounding those unwashed carpetbagging bandits with lightning and Unrelenting Force dragon sized shouts. OH, yeah. Resist that, you Fire and Ice renegades! ALMOST makes you feel sorry for them. I will warn you, though, he\\'ll be there if you are starting a new character in Helgen, so just wait until AFTER you get outta the mousehole and on your way to Riverwood before you check this mod or Sleeth MAY prevent you from venturing beyond the safe cocoon of Helgen in the first scenario. Yes, he does interfere with Alduin and his wrath. \r\n\r\nI placed Storm Dragons all over Skyrim, especially in city areas. They all use various Dragon Shouts, because who do you think invented them in the first place? Old men on mountaintops? Guess. Again. Steam. Unrelenting Force. Call Lightning. Zoinks! \r\n\r\nYou may run into a few that are in Dragon Skeleton form as well. I have a teaser shot of Veevass The Deathbringer for you, outside of Riften. You\\'ll find him. He may find you first. \r\n\r\nI would like to encourage you to find, screenshot and post your encounters with them here. \r\n\r\nNow go out there and kick some reptile ???.",
  "categoryId": "83",
  "version": "1.0",
  "author": "EveGK",
  "createdUnix": "1375220944",
  "updatedUnix": "1375220832",
  "containsAdultContent": false,
  "uploadedBy": "EveGK",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000042579",
      "name": "Storm Dragons -- Sleeth The Magnificent",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30",
      "fileName": "Storm Dragons -- Sleeth The Magnificent-39221-1-0.zip",
      "uploadedUnix": "1375220832",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d242cffa9a74f197097456a1c644e265c28217594e4f4790b63e878f95d6cf8c/analysis/1407662229/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Storm%20Dragons%20--%20Sleeth%20The%20Magnificent-39221-1-0.zip?fid=1000042579&ttl=1535819654&ri=8192&rs=8192&setec=5ea752e73e3847d0aa995c0d25b31e96"
    }
  ]
}