{
  "modId": 39299.0,
  "modName": "Just another Arena - with random enemies",
  "summary": "An Arena in a remote island with randomly generated enemies (infinite number of waves, until disabled). Plus everything from the previous versions. MCM support. SKSE required for full capabilities, but will work without it.",
  "descriptionHtml": "Just another Arena (with random enemies)\r<br />========================================\r<br />\r<br />[color=red]\r<br />If you have problems with low framerates then disable the official high resolution texture packs. \r<br />This mod uses a lot of armor and other textures for a lot of gladiators. If the mod freezes or runs laggy please try this for better performance if you want. \r<br />Maybe there are other mods using high res textures making the same problems.\r<br />Also keep in mind this mod is aimed for higher-end PC&#39;s. You can spawn almost infinite number of enemies (except dragons) but the more you do, the more likely your game will crash to desktop. So test it slowly.\r<br />[/color]\r<br />\r<br />If you like this mod, please head over to the [url=http://skyrim.nexusmods.com/mods/29868/?]original[/url] and endorse it.\r<br />\r<br />[youtube]9QFC8BV1ilI[/youtube]:\r<br />\r<br />[youtube]rXDhPo4kAZo[/youtube]\r<br />\r<br />Installation\r<br />============\r<br />\r<br />Extract the .esp and .bsa to your Skyrim directory.  \r<br />(It will be something like *Installation directory*&#92;&#92;Skyrim&#92;&#92;SteamApps&#92;&#92;common&#92;&#92;Skyrim&#92;&#92;Data)\r<br />Mark the box next to the &#34;arenaisland01&#34; plugin in your mod manager or the Skyrim Launcher&#39;s Data Files menu.\r<br />\r<br />Uninstallation\r<br />==============\r<br />\r<br />Uncheck the &#34;arenaisland01&#34; plugin in your mod manager or the Skyrim Launcher&#39;s Data Files menu.\r<br />Delete the .esp and .bsa from your Skyrim directory.\r<br />\r<br />Changes from (the original) v 1.5\r<br />==================================\r<br />\r<br />Fixed some quest and scripting bugs. Some general optimiziations.\r<br />Added the option to spawn random enemies infinitely (made upon request). Of course you can disable this with the same button if you want to stop fighting. :)\r<br />Added Mod Configuration Options if you have SkyUI installed. SKSE required for full capabilities, but will work without it.\r<br />Added the Blacksmith Forge water fix by RolloLG.\r<br />Tried to clean the mod with TES5Edit v3.0.30, but at some point it became unsaveable in CK so I decided to leave those 3 dirty edits alone.\r<br />\r<br />How to get to Arena island\r<br />==========================\r<br />\r<br />A note will be given to you once you load your game. Activate the quest and it will guide you there.\r<br />\r<br />Near the Arena there is a marketplace with merchants, trainers and followers.\r<br />At the south side is a small town with blacksmith and merchants too.\r<br />At south east is a very small playerhome, but it&#39;s yours.\r<br />\r<br />In the middle of the island there is a large Arena.\r<br />\r<br />How to use the Arena\r<br />====================\r<br />\r<br />There are two ways of using this arena. One is to use it as a spectator from the table above.\r<br />Sit down on the chair, pull the central button, then the gladiator buttons appear by magic.\r<br />Every button has his own faction. Pulling one of them spawnes fighters. \r<br />You are free to pull different bars, but be warned...\r<br />\r<br />[color=red]THE BUTTONS ARE NOT LIMITED, SO YOU CAN SPAWN HUNDREDS OF FIGHTERS. \r<br />TEST IT SLOWLY, TO PREVENT A CRASH ON YOUR SYSTEM&#33;\r<br />WITHOUT HIRES TEXTURE PACKS YOU CAN SPAWN UP TO 50% MORE GLADIATORS.[/color]\r<br />\r<br />The second way to use is to press the middle button again (so the doors will open, and you can walk in). Take one (or more) of the followers with you, if you like. Go down the stairs into the arena, where other tables are waiting for you. The door behind you closes if you push the middle button. Now if you spawn enemies, and they see you, you will have to fight.\r<br />\r<br />There is a &#39;Random enemies&#39; button next to the middle button. If you press it, you will start an infinite fight with randomly generated enemies. If you have SkyUI installed, you can configure this in the Mod Configuration Menu (basically the difficulty and how much enemies may appear at once). Pressing the button again will cancel the fight (after all remaining enemies have been killed).\r<br />\r<br />You can start a quest by talking to the Arena Master (who is standing near the spectator table).\r<br />\r<br />You can request help anytime by pulling the Arena Chief Refuse Disposalnix button. A guard will appear and kill everybody in the Arena who attacks him. This will break the Arena Master&#92;&#92;&#92;&#39;s quest though, so you will have to restart it.\r<br />\r<br />How to avoid CTD&#39;s\r<br />==================\r<br />\r<br />Obviously, do not summon too many fighters in the Arena. However the random enemies are generated on the fly, and the user has not much input on the number of enemies (aside from not using the expanded lists in MCM), but there are mods on the Nexus that can help with Skyrim instability.\r<br />\r<br />http://skyrim.nexusmods.com/mods/32363/?\r<br />http://skyrim.nexusmods.com/mods/38649/?\r<br />ENB download link:\r<br />http://enbdev.com/download_mod_tesskyrim.htm\r<br />\r<br />Credits\r<br />=======\r<br />\r<br />Thanks to AluCard, Irikedownroading and grilli for the original Arena Island.\r<br />Thanks to Tamriel Rebuilt for their random name generator.\r<br />Thanks to fantasynamegenerators.com for their random name generator.\r<br />Thanks to the Unofficial Elder Scrolls Pages for their Elder Scrolls NPC name compilation.\r<br />Thanks to the editors of Creation Kit wiki.\r<br />Thanks to Bethesda for creating such a great (unfortunately pretty buggy) game.",
  "categoryId": "88",
  "version": "1.0",
  "author": "Vik",
  "createdUnix": "1375306256",
  "updatedUnix": "1375305315",
  "containsAdultContent": false,
  "uploadedBy": "Luke2135",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000042928",
      "name": "Just another Arena - with random enemies",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "46855",
      "fileName": "Just another Arena - with random enemies-39299-1-0.7z",
      "uploadedUnix": "1375305315",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1cfb152e664606e6829937dc9cd95fb39bc2caa9dfac558b11ef539f1a28f1f9/analysis/1407663503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Just%20another%20Arena%20-%20with%20random%20enemies-39299-1-0.7z?fid=1000042928&ttl=1535819711&ri=8192&rs=8192&setec=656a489b48b555ecae0a4fbf3aace264"
    }
  ]
}