{
  "modId": 39314.0,
  "modName": "Self Filling Bookshelves",
  "summary": "Sick of trawling through your inventory looking for the books you want to display?\r<br />Well, no more&#33;\r<br />Self Filling Bookshelves&#33;\r<br />With just a couple of clicks you can fill an entire shelf with just the books you want&#33;\r<br />Standard books, Spell Tomes, Skill Books, small, large, alphabetical or colour coded, the choice is yo",
  "descriptionHtml": "Self Filling Bookshelves\r<br />Skyrim SE version available [url=http://www.nexusmods.com/skyrim/mods/39314/]HERE[/url]\r<br />\r<br />This mod adds a small menu system to any bookshelves using the standard (vanilla) bookshelf containers and any mods that use the standard bookshelf containers allowing you to select which type of book you wish placed on the current bookshelf.\r<br />To access the menu crouch first, then activate any bookshelf, you can then choose between various categories to immediately fill the shelf with the chosen type.\r<br />Once a choice is made any books already in the shelf will be removed and placed in your inventory and the shelf will be filled from scratch from the books available in your inventory.\r<br />\r<br />Menu Options:\r<br />\r<br />Standard Books - (Regular, everyday books)\r<br />........|-Small\r<br />........|-Large\r<br />........|....|-Green Only\r<br />........|....|-Brown Only\r<br />........|....|-Mixed\r<br />........|\r<br />........|-Mixed\r<br />...............|-Large First\r<br />...............|-Alphabetical\r<br />\r<br />Spell Tomes - (The books you learn new spells from)\r<br />........|-Alphabetical\r<br />........|-Colour Coded\r<br />\r<br />Skill Books - (The books that increase your stats such as Block, Destruction Magic etc.)\r<br />........|-Large Only\r<br />........|-Small Only\r<br />........|-Mixed\r<br />..............|-Large First\r<br />..............|-Alphabetical\r<br />\r<br />With as little as two clicks of your mouse (or XBox controller) you can have a shelf filled with nothing but spell tomes, arranged by colour code or skill books arranged alphabetically&#33; No need to go trawling through the hundreds of books in your inventory looking for the few you want to display&#33;\r<br />\r<br />Only one of each book will be placed on the shelf unless there is still space once the list has been run through, at which point the process will repeat untill the shelf is full or you have no books of the chosen type left in your inventory&#33;\r<br />\r<br />Once a choice is made you will be notified: &#34;Moving Books, Please Wait...&#34;, it is HIGHLY recommended that you do NOT exit the bookshelf untill you receive the &#34;Done&#33; Exit To Update Bookshelf&#33;&#34; message as messing with your inventory or leaving the cell before the transfer is complete may have strange or unwanted consequences&#33; The transfer usually only takes 4-5 seconds.\r<br />\r<br />I have not included any journals or uniquely named books as these tend to be mission objects which cannot be removed from your inventory, attempting to remove mission books would cause the script to break&#33;\r<br />Nor have I included any notes as these look kinda stoopid on bookshelves&#33;-)\r<br />\r<br />It is most likely that some books may have been missed or may be out of alphabetical order (the ID&#39;s for books in the Creation Kit do not necessarily conform to the name of the book in-game and there are a LOT&#33;&#33;), if you do see something that isn&#39;t as it should be, please contact me and I&#39;ll be making a list so if/when there are enough items to warrant it I&#39;ll do an update to rectify this&#33;\r<br />\r<br />Installing:\r<br />I recommend installing with Nexus Mod Manager (NMM) for ease&#33;\r<br />To install by hand simply copy the three files:\r<br />_001_SelfFillingBookshelves.esp\r<br />_001_SelfFillingBookshelves.bsa\r<br />_001_SelfFillingBookshelves.bsl\r<br />Into the &lt;Data&gt; folder of your Skyrim install directory.\r<br />\r<br />To Uninstall either use NMM if you installed using that or if you installed manually just delete the three files named above.\r<br />\r<br />As with any mod it is advised to make a full save before installing then install and have a good test&#33; If you then decide it&#39;s not for you, uninstall and reload from your safe save.\r<br />\r<br />If you are unistalling after using the mod for a while exit any building that has book shelves that you have used, make a full save, quit and uninstall then go adventuring for 3-4 game days before returning and checking your bookshelves. Though not 100% necessary it is advised for safety&#33;\r<br />\r<br />If you are using any of my full house mods that have their own self-filling bookshelves this mod will automatically not run to avoid conflicts&#33;\r<br />\r<br />berticus0001\r<br />[url=http://www.nexusmods.com/skyrim/mods/searchresults/?src_order=2&src_sort=0&src_view=1&src_tab=1&src_game=0&src_language=0&src_auth=berticus0001&src_upldr=berticus0001&src_showadult=1&page=1&pUp=1]Other mods by me.[/url]",
  "categoryId": "78",
  "version": "1.0",
  "author": "berticus0001",
  "createdUnix": "1375313728",
  "updatedUnix": "1375311958",
  "containsAdultContent": false,
  "uploadedBy": "berticus0001",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000042955",
      "name": "Self Filling Bookshelves",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Self Filling Bookshelves-39314-1-0.7z",
      "uploadedUnix": "1375311958",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8485a9fbd67beb819daf5e8a9c0d6db5da37c4a23031e1a6065ad16d308f3327/analysis/1407663543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Self%20Filling%20Bookshelves-39314-1-0.7z?fid=1000042955&ttl=1535819732&ri=8192&rs=8192&setec=53995c1bd4f58206c114618c5bfa2c6f"
    }
  ]
}