{
  "modId": 39317.0,
  "modName": "Self Dressing Mannequins",
  "summary": "Sick of having to trawl through your inventory looking for those elusive gauntlets or helmet to dress your mannequins?\r<br />Well, no more&#33;\r<br />Self Dressing Mannequins&#33;\r<br />Instantly equip your mannequin with a full set in just a couple of mouse-clicks&#33;",
  "descriptionHtml": "Self Dressing Mannequins\r<br />Skyrim SE version available [url=http://www.nexusmods.com/skyrimspecialedition/mods/2051?]HERE[/url]\r<br />\r<br />This mod adds a small menu system to all standard (vanilla) mannequins and any mods that use the standard mannequins allowing you to instantly equip your mannequin with any of 10 default armour types (5 light & 5 heavy) or you can use any of the 10 user slots to allocate armours from the DLC&#39;s or mods or choose your own set which can be a combination of any armour type&#33;\r<br />To access the menu crouch first then activate any mannequin.\r<br />Once a choice is made any armour already on the mannequin will be transfered to your inventory and the armour you chose will be automatically transfered from your inventory to the mannequin.\r<br />\r<br />To create your own unique set select the &lt;User&gt; option, then in the following menu you will have the options: &lt;Use Set&gt; & &lt;Create New Set&gt;, select &lt;Creat New Set&gt;, you will then be asked to exit the mannequin, do this and another, hidden, chest will open for you to place each of the parts of your new set in it (armour, boots, gauntlets, helm & shield), place each piece, one at a time, into the chest, you will be notified &#34;Item Added To List&#33;&#34; and the item will be returned to your inventory, once you&#39;ve added all the pieces of the set exit the chest and the mannequin will be updated with the new armour, from then on if you want to use the same set on any other mannequin simply select the &lt;Use Set&gt; option. If you wish to replace any user set with a new one select the &lt;Create New Set&gt; option again and the current set for that slot will be wiped, ready for the new items you want.\r<br />Notes:\r<br />Unfortunately the game works on a &#34;first in, first out&#34; system, so if you are wearing, say, ebony armour and you pick up some new ebony armour and want it placed on a mannequin, selecting this option will most likely remove the set you are wearing&#33;\r<br />If you select a set of armour that is not in your inventory you will be notified of this and asked if you wish to leave the current armour the mannequin is wearing on it (even if it is wearing none&#33;). Only one piece of an armour set is necessary for the option to be accepted&#33;\r<br />\r<br />Installing:\r<br />I recommend installing with Nexus Mod Manager (NMM) for ease&#33;\r<br />To install by hand simply copy the three files:\r<br />_001_SelfDressingMannequins.esp\r<br />_001_SelfDressingMannequins.bsa\r<br />_001_SelfDressingMannequins.bsl\r<br />Into the &lt;Data&gt; folder of your Skyrim install directory.\r<br />\r<br />To Uninstall either use NMM if you installed using that or if you installed manually just delete the three files named above.\r<br />\r<br />As with any mod it is advised to make a full save before installing then install and have a good test&#33; If you then decide it&#39;s not for you, uninstall and reload from your safe save.\r<br />\r<br />If you are unistalling after using the mod for a while exit any building that has mannequins that you have used, make a full save, quit and uninstall then go adventuring for 3-4 game days before returning and checking your mannequins. Though not 100% necassary it is advised for safety&#33;\r<br />\r<br />If you are using any of my full house mods that have their own self-dressing mannequins this mod will automatically not run to avoid conflicts&#33;\r<br />\r<br />berticus0001\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/searchresults/?src_order=2&src_sort=0&src_view=1&src_tab=1&src_auth=berticus0001&page=1&pUp=1]Other mods by me&#33;[/url]",
  "categoryId": "78",
  "version": "1.0",
  "author": "berticus0001",
  "createdUnix": "1375313735",
  "updatedUnix": "1375313568",
  "containsAdultContent": false,
  "uploadedBy": "berticus0001",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000042964",
      "name": "Self Dressing Mannequins",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Self Dressing Mannequins-39317-1-0.7z",
      "uploadedUnix": "1375313568",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d4ea1bbad5bd0c3c1210c0ed30af5f4dba4fa13b4805ede07849293daadf1b84/analysis/1407663549/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Self%20Dressing%20Mannequins-39317-1-0.7z?fid=1000042964&ttl=1535819734&ri=8192&rs=8192&setec=8d49b7a371fc9968e825ac8468edaa96"
    }
  ]
}