{
  "modId": 39404.0,
  "modName": "Darkwater Lodge",
  "summary": "A home for children and family in the Darkwater Pass area of the Rift",
  "descriptionHtml": "[b][color=#ff0000]In light of recent changes to Valve and Steam workshop and Paying for mods.[/color]\n<br />[color=#ff0000]My mods are free to download and will remain so. [/color]\n<br />[color=#ff0000]I do not  give my permission for my mods to be uploaded to Steam Workshop or uploaded for Gaming Consols. This is not me being PC elitist. I don't own a gaming consol so I can't troubleshoot, maintain the mod or in any way be helpful to a user - if someone wants to do all that they are welcome to get in touch with me and ask to do so. [/color]\n<br />[color=#ff0000]I do not under any circumstances give my permission for any assets I personally have made for this mod to be used in a mod which then charges users money to download them.[/color]\n<br />[color=#ff0000]Other permissions remain as listed at the bottom of this page. [/color][/b]\n<br />\n<br />Darkwater Lodge\n<br />\n<br />A home for children and family\n<br />by Gentester\n<br />\n<br />Your children will live here\n<br />This mod requires Hearthfire DLC, it will not operate without it. \n<br />This mod has been cleaned with Tes5edit.\n<br />\n<br />This is a small home in the Darkwater pass area of the Rift to the north east of Ivarstead\n<br />\n<br />The home is purchaseable for 18,000 septims, see the notice on the gate.\n<br />\n<br />[youtube]6Sbhac-St98[/youtube] Thanks to Nozi87\n<br />\n<br />Fast travel is to the road nearby (beware - the road is the haunt of a sabre cat - he will attack!). Once purchased fast travel is enabled to within the garden, however the landing site is fairly small and only suitable for yourself and possibly 2 or 3 followers. If you are bringing more in by fast travel then use the road landing site.\n<br />\n<br />The house is built into the side of the hillside and sleeps 4 children and 4 followers. I am releasing a larger mod - Aspen manor - that will sleep 6 children and has follower accomodation for 12 to give people more choice.\n<br />It will work perfectly well as a stand alone mod but if you want to move your children to the house then you MUST use TMPhoenix's mod (that mod also takes care of the spouse moving in and ensures that the spouse sleeps in the master bed and sandboxes correctly the rest of the time) at http://skyrim.nexusmods.com/mods/29249. Please note that if you already have a game running where you have adopted a child already using the vanilla adoption TMPhoenix's mod will only allow you to move the original hearthfire 2 children and your spouse to Darkwater. If you wanted more children to live here you would have to start a new game and use his mod from the beginning in place of the vanilla adoption system.\n<br />\n<br />Outside there is a stable area, gardens, terraces, a second stable area which houses chickens and milkable cows (and can also take a horse or two), a covered outdoor dining area and bbq, further seating, a well and hot tub.  There are only two cows so to save having to wait for them to respawn I have made them essential in case anything attacks.\n<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/Darkwater%20Lodge/TESV2013-07-0213-53-16-51_zps4b68c27e.jpg[/img]\n<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/Darkwater%20Lodge/TESV2013-07-0213-49-43-44_zpsa46ef42d.jpg[/img]\n<br />Inside the lighting changes with the time of day and it gets dark at night when the house is lit by candles and firelight, \n<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/Darkwater%20Lodge/TESV2013-06-3021-31-40-96_zps07c9b1be.jpg[/img]\n<br />in the day the sunshine streams in through the windows which back onto the indoor garden.\n<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/Darkwater%20Lodge/TESV2013-06-3021-41-48-23_zps35c4442e.jpg[/img]\n<br />It is a comfortable family home and although it has all the storage you could want it is not suitable for those who want all their weapons and armor on display, it has just one mannequin, 2 weapon racks and one display case.\n<br />The upstairs master bedroom has a large number of interactive and winterhold bookcases to store your books alongside plenty of wardrobes. On the small landing is storage for documents.\n<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/Darkwater%20Lodge/TESV2013-06-3023-41-38-11_zpsb1ace308.jpg[/img]\n<br />On the main floor the kitchen has a hearthfire oven, chilled storage and tailored storage for all catering needs. \n<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/Darkwater%20Lodge/TESV2013-06-3021-18-04-69_zps9491f33b.jpg[/img]\n<br />The enchanting and alchemy areas both have designated and labelled storage.\n<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/Darkwater%20Lodge/TESV2013-06-3021-18-10-57_zps9351914d.jpg[/img]\n<br />China and crockery storage is in the dresser next to the dining table.\n<br />The sitting area has three sofas seating 8 people and there is also a bench seating one.\n<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/Darkwater%20Lodge/TESV2013-06-3021-03-11-79_zps381b3369.jpg[/img]\n<br />The childrens room sleeps 4 with all the toys and books they could want.\n<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/Darkwater%20Lodge/TESV2013-06-3023-41-57-08_zpsab914b9e.jpg[/img]\n<br />\n<br />The indoor garden has the follower accomodation (4 beds) with their own catering facilities and all the crafting is here from a forge to a grain mill, from butter churns to a well.\n<br />Also in the garden is a natural swimming hole and plenty of occasional seating.\n<br />\n<br />Both the outside hot tub and the indoor pool will act as heat sources for frost fall users and there are also braziers outdoors in the main relaxation areas.\n<br />The pool and hot tub are scripted so that your followers will undress to bathe or swim. When they leave the area their inventory will be replaced and your followers will redress, The children will not undress but will remove their shoes, and wooden swords, and get them back when they leave the area. In the event of a hiccup with the redressing the lockers, in which the inventory was stored, are accessible and so inventory can be recovered manually. (The Hot tub lockers are under the edge of the deck on which it sits and the pool lockers are clearly visible by the waterside). This can also be a way to alter your followers inventory if you don't run a mod which allows you to do so, just add new items into the changing locker containing their existing gear and they will take it with their normal inventory.\n<br />\n<br />The cows are milkable, hovver the cursor over their bodies on their left flank and click e, the milking animation will take over. The cows produce milk and cream daily.\n<br />The property has 30 hearthfire planting mounds, some are inside in the indoor garden area and some are on the outdoor terraces.\n<br />\n<br />Known issues\n<br />The house will conflict with any mod which alters the same area (I know there are a few)\n<br />If you are using a mod which alters the childrens body or has their clothing in different slots from vanilla the children may remove their clothing in the hot tub or pool, I can't guarantee they will redress automatically when leaving it. \n<br />\n<br />Credits\n<br />Tamriel Real Estate modders http://www.skyrimrealestate.com\n<br />\n<br />Umm quite a list, if I have missed anyone out my apologies, let me know and I will correct the list.\n<br />Most of the modders listed below are for meshes and textures except where otherwise marked\n<br />AARS Blary\n<br />Berticus0001 (milking scripts, house purchase scripts, and endless help and advice)\n<br />Bond\n<br />Brendan62\n<br />Breti\n<br />Clintster (for new housefire oven decals, some other bits and massive amounts of help, advice and tutoring with retextures)\n<br />Daemonjax (lighting ball scripts)\n<br />Dark Rider\n<br />Elinen and Ztree\n<br />Ga-Knomboe Boy\n<br />Insanity Sorrow\n<br />Langley\n<br />Lilith\n<br />Merilia\n<br />MJY\n<br />Oaristy's\n<br />Phaedra\n<br />Runspect\n<br />Stroti\n<br />Tamira\n<br />WillieSea\n<br />\n<br />\n<br />You may use anything from this mod provided it was made by me although credit would be nice. \n<br />For all other resources please check with the modders concerned (unless it is a modders resource in the first place).\n<br />You may not upload this to SteamWorkshop (or to any other site) without my permission or do anything to change the esp and reupload it.\n<br />If you want to translate the mod that's fine, but please let me know first.\n<br />\n<br />\n<br />Manual installation\n<br />Place Darkwater Lodge.esp and Darkwater lodge.bsa in your data folder at steam/steamapps/common/skyrim.  Check that Darkwater Lodge is ticked in the launcher.\n<br />\n<br />Manual Uninstallation\n<br />Move your spouse, followers and children out of the house and set another house as their home, remove all goods that you want to keep. Remove Darkwater Lodge.esp and Darkwater Lodge.bsa from your data folder.\n<br />\n<br />I recommend the following mods:\n<br />More plants and recipes for Hearthfire by numberland  http://skyrim.nexusmods.com/mods/26851 \n<br />Gives the choice of more plants for the hearthfire planting mounds, things like tomatoes and apple trees can now be grown and a lot of extras depending on which version you use.\n<br />Another Mannequin Script Fix by Berticus0001  http://skyrim.nexusmods.com/mods/36301 \n<br />Stops the annoying unequiping of a mannequin's inventory if you are absent from the house for more than a day or two and fixes them in place. Berts installation instructions have to be followed completely for it to work correctly.\n<br />Hearthfire Dolls are Ugly by Berticus0001  http://skyrim.nexusmods.com/mods/39377   Replacer for the fairly horrid hearthfire dolls that allows you to choose between various teddy bears or elf dolls",
  "categoryId": "67",
  "version": "1.3",
  "author": "Gentester",
  "createdUnix": "1375396305",
  "updatedUnix": "1417014903",
  "containsAdultContent": false,
  "uploadedBy": "gentester",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000043311",
      "name": "Darkwater Lodge",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91409",
      "fileName": "Darkwater Lodge-39404-1-0.rar",
      "uploadedUnix": "1375396187",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b0a4d174c30865b937b6105ed3c64bfd525f8912cb8200091b7abd1a498794a6/analysis/1407665842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkwater%20Lodge-39404-1-0.rar?fid=1000043311&ttl=1535819832&ri=8192&rs=8192&setec=e4c542f3630abae15a968f1c60de8e31"
    },
    {
      "fileId": "1000044722",
      "name": "Darkwater Lodge",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91409",
      "fileName": "Darkwater Lodge-39404-1-1.rar",
      "uploadedUnix": "1375810137",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f74bb6d5268336e918f9b6e7c0a8b5e85ed4164e1d4d831d0ef21916fdbd063a/analysis/1407671536/",
      "changelogHtml": " Changed the undressing script to take players out of it so that hot keyed items aren&#39;t affected by it all it. Safe to overwrite without moving out  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkwater%20Lodge-39404-1-1.rar?fid=1000044722&ttl=1535819832&ri=8192&rs=8192&setec=462fada7aadb4ef084fdcbe5f27065be"
    },
    {
      "fileId": "1000101341",
      "name": "Darkwater Lodge",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91409",
      "fileName": "Darkwater Lodge-39404-1-2.rar",
      "uploadedUnix": "1394930152",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/42d2ea5a0440a71d0cc156a00ed7196de622bfd2ae7970653678575f43e9bd4f/analysis/1407983663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkwater%20Lodge-39404-1-2.rar?fid=1000101341&ttl=1535819833&ri=8192&rs=8192&setec=04a9bebf8cb83f7dc4defad0fdcb5a40"
    },
    {
      "fileId": "1000136831",
      "name": "Darkwater Lodge",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "92100",
      "fileName": "Darkwater Lodge-39404-1-3.rar",
      "uploadedUnix": "1417013933",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/3df018054aeec6f07897623ebacf8694e040982316b19191e43d239c3ac36cb7/analysis/1417014021/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkwater%20Lodge-39404-1-3.rar?fid=1000136831&ttl=1535819834&ri=8192&rs=8192&setec=ab81ea55d65600d5b69ad99a9fb9f7bf"
    },
    {
      "fileId": "1000136832",
      "name": "Darkwater Lodge  Loose Files version",
      "version": "1.3a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "89282",
      "fileName": "Darkwater Lodge  Loose Files version-39404-1-3a.rar",
      "uploadedUnix": "1417014903",
      "modVersion": "1.3a",
      "virusScanUrl": "https://www.virustotal.com/file/6faf322dda07f6b45c054d90ed00e52ba9d80c2d0eb17a3823eaa783d4cd11cd/analysis/1417015050/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darkwater%20Lodge%20%20Loose%20Files%20version-39404-1-3a.rar?fid=1000136832&ttl=1535819834&ri=8192&rs=8192&setec=e7a4e34d20a4722289f78028a7a4b1cf"
    }
  ]
}