{
  "modId": 39400.0,
  "modName": "Aspen Manor",
  "summary": "A large manor outside Riften. Your children can live here along with followers.",
  "descriptionHtml": "[b][color=#ff0000]In light of recent changes to Valve and Steam workshop and Paying for mods.[/color]\r<br />[color=#ff0000]My mods are free to download and will remain so. [/color]\r<br />[color=#ff0000]I do not  give my permission for my mods to be uploaded to Steam Workshop or uploaded for Gaming Consols. This is not me being PC elitist. I don&#39;t own a gaming consol so I can&#39;t troubleshoot, maintain the mod or in any way be helpful to a user - if someone wants to do all that they are welcome to get in touch with me and ask to do so. [/color]\r<br />[color=#ff0000]I do not under any circumstances give my permission for any assets I personally have made for this mod to be used in a mod which then charges users money to download them.[/color]\r<br />[color=#ff0000]Other permissions remain as listed at the bottom of this page. [/color][/b]\r<br />\r<br />Aspen Manor\r<br />\r<br />A Home for family and followers by Gentester\r<br />\r<br />Your children will live here\r<br />This mod requires Hearthfire DLC, it will not operate without it. Please read the known issues section if nothing else.\r<br />This mod has been cleaned with Tes5edit.\r<br />\r<br />Aspen Manor is next to Merryfair farm outside Riften. Turn left at the stables as you leave Riften.\r<br />Fast travel once discovered.\r<br /> \r<br />Purchasable 20k septims, see notice on gate.\r<br />\r<br />The house sleep 6 children and 12 followers. It will work perfectly well as a stand alone mod in which case the childrens room will be unused. If you want to move your children to the house then you MUST use TMPhoenix&#39;s mod (that mod also takes care of the spouse moving in and ensures that the spouse sleeps in the master bed and sandboxes correctly the rest of the time) at http://skyrim.nexusmods.com/mods/29249. \r<br />Please note that if you already have a game running where you have adopted a child already using the vanilla adoption TMPhoenix&#39;s mod will only allow you to move the original hearthfire 2 children and your spouse to Aspen. If you wanted more children to live here you would have to start a new game and use his mod from the beginning in place of the vanilla adoption system.\r<br />Thanks to CopiousGaming for the vid\r<br />[youtube]cGZKwo1lNvs[/youtube]\r<br /> [img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/3AspenManorfromtheLake_zps0eb1d3fc.jpg[/img]\r<br /> [img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/TESV2013-06-1203-10-34-92_zps0104010f.jpg[/img]\r<br />The house and grounds have guards. There are a couple of levelled beasties that may need to be killed before the guards will properly patrol, until the critters are dead they tend to cluster at the point inside the wall closest to the critters - as they want to kill them but can&#39;t see them, the beastie in this case is up the hill behind Merryfair farm and near to the corner of the wall surounding Aspen Manor. There may also be something inside the grounds but the guards will probably take care of this themselves whilst you kill the one outside. Think of it as a quest to get the house lol.\r<br />Once killed the critters should not respawn. The guards have schedules and will patrol 24 hours a day with rest breaks and sleep breaks, they are all essential, are recruitable as followers, and marriageable, but will obviously no longer guard in the event you take them away from their schedule. They are there to protect your family, all sixteen of the adoptable children in the game have been set as friends to the guards.\r<br />\r<br />\r<br />Master bedroom and childs bedroom are on main entry floor. \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/19AspenManorMasterBedroom_zps800caee7.jpg[/img]\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/20AspenManorChildsBedroom_zpsb19026e8.jpg[/img]\r<br />There are masses of bookcases and custom bookshelves to store all the books you have acquired throughout the top floor and also downstairs.\r<br />Ladder up to a mezzanine floor with more storage and a door out to a small roof terrace with seating.\r<br />All other amenities are downstairs including a lounge; alchemy and enchanting stations with more bookcases, scroll storage, recipe storage and shelves for your spell books; a small armoury with a custom made mask storage shelving unit; kitchen with hearthfire oven, butter churns and custom storage; dining area; toilet; and an indoor pool room with shower, bar and lounging area. \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/TESV2013-06-1203-18-00-88_zpsa20a0458.jpg[/img]\r<br />You and your followers can sit on the benches in the pool (get onto the step below the benches to do so), sit on the edge of the pool or on the steps down into the water. \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/14AspenManorPool2_zpse1110281.jpg[/img]\r<br />There are two large follower bedrooms each sleeping 6.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/15AspenManorFollowerBedroom_zps019980ba.jpg[/img]\r<br />There are 14 mannequins, a lot of weapon racks and storage for armour, display cases and dagger racks, and a place to practise archery.\r<br /> \r<br />Pool area will undress your followers and redress them as they leave the room.  If you run a nude body mod then your followers will be nude. The children will not undress but will remove their shoes and wooden swords and will get them back when they leave (see known issues).\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/ScreenShot125_zpsbed48a31.jpg[/img]\r<br />\r<br />Outside near the house is the no load door guards quarters with a covered area in between this and the house containing the grain mill and wood chopping. There is a smelter and the ground floor of the guards area has the forge and other crafting needs including plenty of storage. It won&#39;t rain on you.\r<br />Large outdoor conservatory with hearthfire planting containers and more hearthfire planting mounds just outside.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/ScreenShot95_zps3391dc6f.jpg[/img]\r<br />Bee hives\r<br />Stables for your horses.\r<br />Two milkable cows, hovver the mouse over them click E and the animation will take over. They produce hearthfire milk and cream daily. As there are only two I made them essential so your milk supply won&#39;t run out in case anything attacks them\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/28AspenManorLivestockusinggrassmods_zpse640325e.jpg[/img]\r<br />A chicken run with 4 hens.\r<br />Well and laundry area.\r<br />Outside seating with gorgeous views of the gardens and lake\r<br />There is a picnic area down by the lake.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Aspen%20Manor/TESV2013-06-3006-01-22-13_zps1a551177.jpg[/img]\r<br />Fish Hatchery on the lake. You may find the tame mudcrabs have been killed by the critters that initially spawn. Consol users can revive them but they will respawn in any case.\r<br />\r<br /> \r<br />Some of the lighting, including the main room central lights and the bedroom central lights are on timers to come on in the day. \r<br />\r<br />Known Issues\r<br />\r<br />The Guards and Shadowmere\r<br />The reason they may attack is that Shadowmere is in Dark brotherhood faction. Its a known issue with guards of any type and this horse.You may also get it with NPC&#39;s set to guard anywhere using the old MyHomeIsYourHome.Workaround would be to remove Dark Brotherhood faction from Shadowmere.Do the following at a point when the guards are either not there or not hostile.\r<br />1) Open console while standing in front of Shadowmere\r<br />2) Click on Shadowmere.\r<br />3) Type: addfac 1bdb3 -1 \r<br />4) Hit enter and exit the console.\r<br />Some modded versions of Shadowmere don&#39;t have the horse in that faction, those should be fine &#34;out of the box&#34;.\r<br />\r<br />If you leave the house for 31 days or more it is possible that your claws may be stuck to the display or vanish altogether (in testing this hasn’t happened but it’s a known game bug) to reclaim any missing items – for the claws look to the dragon skull above the claw display shelf, hover cursor over it – make sure you are looking at the skull and not the wall or the flames - open the consol (the tilde key to the left of the 1) and type removeallitems player 1. The claws will return to your inventory. With the masks just click on the bust itself and follow the same procedure.\r<br />\r<br />Reported conflict with one of the Dark Brotherhood quests.  I can&#39;t recreate it myself although I have tried. This quest causes no problems for me. However in case you do get a problem - The quest is &#34;Take the Hidden Treasure&#34; and the reported conflict occurs with the variation called Cancelled Wedding which requires the treasure to be taken from the a tree stump within the grounds of Aspen Manor.  If you play this questline and get this particular quest and then get a problem - it would be probably  be better to complete it using the consol (its only getting treasure out of a tree stump so not really going to involve much in any case). After receiving the quest open the consol and type in SetStage DBTortureTreasureMiscObjective2 200.\r<br />\r<br />It will conflict with any mod in the same area - this includes the cells it covers (39/-21; 39/-22; 39/-23) and also any cells with shared boundaries (where I have had to connect the navmesh). A mod on a shared boundary cell may run perfectly well but I can&#39;t guarantee it.\r<br />If you are using a mod which alters the childrens body or has their clothing in different slots from vanilla the children may remove their clothing in the pool area, I can&#39;t guarantee they will redress automatically when leaving it. \r<br />\r<br />Please note this is a large mod with a lot of detail which will require a high end machine to run it. The house has no internal load doors and has a lot of retextures and recolours and will take a while to load when you go in and out the exterior doors. The best advice I can give is to stand still when you go in either door until the house music comes on and the room is loaded (a matter of a few seconds), similarly you may have problems on the stairs as the next floor comes into view, again just don&#39;t race up and down the stairs and it should be fine. Doors into house are double load to help with lag on load. House has occlusion planes etc to try to keep fps down. The design dosen&#39;t lend itself to room bounds. On my rig I get 60 fps throughout the house but I take my time on the staircase and allow things to load properly.\r<br />If all else fails try disabling backgound processes when you are playing, this would help gameplay in any event. \r<br />However if you are running a lot of high end texture mods you simply may not have the space left to run this home - given the Bethesda 4gb limit. I am releasing a smaller mod - Darkwater Lodge - that will sleep 4 children and has follower accomodation for just 4 followers to give people more choice.\r<br />\r<br />\r<br />\r<br />Credits\r<br />Tamriel Real Estate modders http://www.skyrimrealestate.com\r<br />\r<br />Umm quite a list, if I have missed anyone out my apologies, let me know and I will correct the list.\r<br />Most of the modders listed below are for meshes and textures except where otherwise marked\r<br />AARS\r<br />Arion\r<br />Berticus0001 (milking scripts, house purchase, and endless help and advice)\r<br />Bond\r<br />Breti\r<br />ChickenDownUnder\r<br />Clintster (for new housefire oven decals, some other bits and massive amounts of help, advice and tutoring with retextures)\r<br />Daemonjax (lighting ball scripts)\r<br />Dark Rider\r<br />Eraitico\r<br />J2547\r<br />Insanity\r<br />Langley\r<br />Lilith\r<br />Merilia\r<br />MJY\r<br />Oaristy&#39;s\r<br />RIP88 (pool furniture scripts)\r<br />Runspect\r<br />Stroti\r<br />T_F\r<br />Tamira\r<br />Varlaisaran\r<br />WillieSea\r<br />\r<br />\r<br />You may use anything from this mod provided it was made by me although credit would be nice. \r<br />For all other resources please check with the modders concerned (unless it is a modders resource in the first place).\r<br />You may not upload this to SteamWorkshop (or to any other site) without my permission or do anything to change the esp and reupload it.\r<br />If you want to translate the mod that&#39;s fine, but please let me know first.\r<br />\r<br />\r<br />Manual installation\r<br />Place Aspen Manor.esp and Aspen Manor.bsa in your data folder at steam/steamapps/common/skyrim.  Check that Aspen Manor is ticked in the launcher.\r<br />\r<br />Manual Uninstallation\r<br />Move your spouse, followers and children out of the house and set another house as their home, remove all goods that you want to keep. Remove Aspen Manor.esp and Aspen Manor.bsa from your data folder.\r<br />\r<br />I recommend the following mods:\r<br />More plants and recipes for Hearthfire by numberland   http://skyrim.nexusmods.com/mods/26851 \r<br />Gives the choice of more plants for the hearthfire planting mounds, things like tomatoes and apple trees can now be grown and a lot of extras depending on which version you use.\r<br />Another Mannequin Script Fix by Berticus0001   http://skyrim.nexusmods.com/mods/36301 \r<br />Stops the annoying unequiping of a mannequin&#39;s inventory if you are absent from the house for more than a day or two and fixes them in place. Please follow his installation instructions completely if you want it to run correctly.\r<br />Hearthfire Dolls are Ugly by Berticus0001  http://skyrim.nexusmods.com/mods/39377   Replacer for the fairly horrid hearthfire dolls that allows you to choose between various teddy bears or elf dolls",
  "categoryId": "99",
  "version": "2.0",
  "author": "Gentester",
  "createdUnix": "1375394519",
  "updatedUnix": "1406118861",
  "containsAdultContent": false,
  "uploadedBy": "gentester",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000043302",
      "name": "Aspen Manor",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "115674",
      "fileName": "Aspen Manor-39400-1-0.rar",
      "uploadedUnix": "1375394289",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6e3364affb50469d14d6be6b9a3e9f57f4c892c49a913e8596ecaeef97dcfbc6/analysis/1407665786/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-0.rar?fid=1000043302&ttl=1535819816&ri=8192&rs=8192&setec=a32ed9bc063a6e2c4f8abd207998f994"
    },
    {
      "fileId": "1000045365",
      "name": "Aspen Manor",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "115674",
      "fileName": "Aspen Manor-39400-1-1.rar",
      "uploadedUnix": "1376000116",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9db1685976c932125b116252e21307dfb15705fd67eaea1474d017c84c53a41f/analysis/1407674847/",
      "changelogHtml": " added new file to take player out of the stripping altogether <br/> \n 9th Aug. Added a note to Known Issues to mention a reported conflict <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-1.rar?fid=1000045365&ttl=1535819817&ri=8192&rs=8192&setec=ae9705a590c302089405e3ba37ddb88e"
    },
    {
      "fileId": "1000046141",
      "name": "Aspen Manor",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "474",
      "fileName": "Aspen Manor-39400-.rar",
      "uploadedUnix": "1376248618",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/09a8029e765d341f27cabee43583ac7ad728e1b83d85bc5ad1c21d7c1f722b8d/analysis/1407678663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-.rar?fid=1000046141&ttl=1535819817&ri=8192&rs=8192&setec=8b1b4429f8d10e60ec37a15dd80feeed"
    },
    {
      "fileId": "1000046146",
      "name": "Aspen Manor",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "115694",
      "fileName": "Aspen Manor-39400-1-2.rar",
      "uploadedUnix": "1376249975",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/1f13a6b6ac1690657e16693b6760bb5a0a2d783446c722d7566c3e1868f525e2/analysis/1407678696/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-2.rar?fid=1000046146&ttl=1535819818&ri=8192&rs=8192&setec=ba4a69893ff05aa983761267d7090787"
    },
    {
      "fileId": "1000049231",
      "name": "Aspen Manor",
      "version": "1.1a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "112609",
      "fileName": "Aspen Manor-39400-1-1a.rar",
      "uploadedUnix": "1377354622",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/7835cddea97b87d427301e28f022ad1253826e4f1309f1c06266b363b8743695/analysis/1407695037/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-1a.rar?fid=1000049231&ttl=1535819818&ri=8192&rs=8192&setec=d2129a314ffae953c219909857703429"
    },
    {
      "fileId": "1000050729",
      "name": "Aspen Manor",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "115690",
      "fileName": "Aspen Manor-39400-1-3.rar",
      "uploadedUnix": "1377834667",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/7c1b71d0f13614afcc428b268652746bdeff48efd191d257869d12ab9b43e6d5/analysis/1407701860/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-3.rar?fid=1000050729&ttl=1535819819&ri=8192&rs=8192&setec=56a2fed20f99b64c170f7ed279d5f667"
    },
    {
      "fileId": "1000050731",
      "name": "Aspen Manor",
      "version": "1.3a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "472",
      "fileName": "Aspen Manor-39400-1-3a.rar",
      "uploadedUnix": "1377834890",
      "modVersion": "1.3a",
      "virusScanUrl": "https://www.virustotal.com/file/e798c39d04d822788252eec2043809dfdbf8ed8549d936dafad022b8c350edf1/analysis/1407701862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-3a.rar?fid=1000050731&ttl=1535819819&ri=8192&rs=8192&setec=9d2b0c86870ff58dc505de873612217b"
    },
    {
      "fileId": "1000050816",
      "name": "Aspen Manor",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "106781",
      "fileName": "Aspen Manor-39400-1-4.rar",
      "uploadedUnix": "1377876602",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/05ca13f67e5708357684f08866aec32f3ea0011cd0c702a7b56088525a34b4bd/analysis/1407702411/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-4.rar?fid=1000050816&ttl=1535819820&ri=8192&rs=8192&setec=b39eed9c5dd2300b0543a80f361a5271"
    },
    {
      "fileId": "1000050819",
      "name": "Aspen Manor",
      "version": "1.4a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "103016",
      "fileName": "Aspen Manor-39400-1-4a.rar",
      "uploadedUnix": "1377878092",
      "modVersion": "1.4a",
      "virusScanUrl": "https://www.virustotal.com/file/2401f509746c381723bb60a8e83c26606505963f13dd61f70e0d4539d8c64035/analysis/1407702439/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-4a.rar?fid=1000050819&ttl=1535819820&ri=8192&rs=8192&setec=7063787bfbe3d82a911865e142712869"
    },
    {
      "fileId": "1000056232",
      "name": "Aspen Manor",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "107274",
      "fileName": "Aspen Manor-39400-1-5.rar",
      "uploadedUnix": "1379456295",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/dda53ecfaa534d30c77f0b3e355d2f916829ca45c08ebe7423c2f8e041232b78/analysis/1407726812/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-5.rar?fid=1000056232&ttl=1535819821&ri=8192&rs=8192&setec=89a5c2cb6543fd6f051f1905d12a9929"
    },
    {
      "fileId": "1000056238",
      "name": "Aspen Manor",
      "version": "1.5a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "103019",
      "fileName": "Aspen Manor-39400-1-5a.rar",
      "uploadedUnix": "1379457400",
      "modVersion": "1.5a",
      "virusScanUrl": "https://www.virustotal.com/file/4a6731a970f053698b93816776d12fa1cf8560b817f97eec4491e42109d83bc7/analysis/1407726854/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-5a.rar?fid=1000056238&ttl=1535819821&ri=8192&rs=8192&setec=0e68ecb0eaaf7fd4f7d9b1923de34b1f"
    },
    {
      "fileId": "1000059037",
      "name": "Aspen Manor",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "106783",
      "fileName": "Aspen Manor-39400-1-6.rar",
      "uploadedUnix": "1380235965",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/8f940481a02793f6f680ac42799445fa2d6f37cb6b2804312470c9ba13aa2984/analysis/1407736582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-6.rar?fid=1000059037&ttl=1535819822&ri=8192&rs=8192&setec=ba5184ca7a6a6e113c6497d06669533b"
    },
    {
      "fileId": "1000059067",
      "name": "Aspen Manor",
      "version": "1.6a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "103018",
      "fileName": "Aspen Manor-39400-1-6a.rar",
      "uploadedUnix": "1380237081",
      "modVersion": "1.6a",
      "virusScanUrl": "https://www.virustotal.com/file/38d265391b6176be88763aa4ad81169fa08072a2749019d8e59f4ddd8e907479/analysis/1407736672/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-6a.rar?fid=1000059067&ttl=1535819823&ri=8192&rs=8192&setec=f0d14eaad7cc4b9ca2ad4db7ac37a9c0"
    },
    {
      "fileId": "1000101289",
      "name": "Aspen Manor",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "105875",
      "fileName": "Aspen Manor-39400-1-7.rar",
      "uploadedUnix": "1394904685",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/fed482e1d00bc9619581bd43f6f389bc98f779683188d5a07c524ae137dff8fa/analysis/1407983068/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-7.rar?fid=1000101289&ttl=1535819823&ri=8192&rs=8192&setec=ec7094d467af4e14bce48bba7781222d"
    },
    {
      "fileId": "1000101293",
      "name": "Aspen Manor Loose Files Version",
      "version": "1.7a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "102130",
      "fileName": "Aspen Manor Loose Files Version-39400-1-7a.rar",
      "uploadedUnix": "1394907164",
      "modVersion": "1.7a",
      "virusScanUrl": "https://www.virustotal.com/file/f27e0060d450938e52154f72b388765756364c5f5ad6bf4edf992ca022e48da6/analysis/1407983190/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor%20Loose%20Files%20Version-39400-1-7a.rar?fid=1000101293&ttl=1535819824&ri=8192&rs=8192&setec=f495ac45c3a128c830bc98826d704ef8"
    },
    {
      "fileId": "1000101442",
      "name": "Aspen Manor",
      "version": "1.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "106782",
      "fileName": "Aspen Manor-39400-1-8.rar",
      "uploadedUnix": "1395004587",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/1a19d20c454c2480f4920dd05a418fed4e055a5f14ae7e812b74807062fe11df/analysis/1407984871/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-8.rar?fid=1000101442&ttl=1535819824&ri=8192&rs=8192&setec=a1dbd36a015f0dbd8657d15a05c8099a"
    },
    {
      "fileId": "1000101448",
      "name": "Aspen Manor Loose Files Version",
      "version": "1.8a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "103018",
      "fileName": "Aspen Manor Loose Files Version-39400-1-8a.rar",
      "uploadedUnix": "1395005665",
      "modVersion": "1.8a",
      "virusScanUrl": "https://www.virustotal.com/file/5675beda949fc9973c2c44c5c37f05cd7e27e24478e658d90e85b83452b91007/analysis/1407985011/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor%20Loose%20Files%20Version-39400-1-8a.rar?fid=1000101448&ttl=1535819825&ri=8192&rs=8192&setec=c65a197e0a3990d7b76edc27111a5073"
    },
    {
      "fileId": "1000103656",
      "name": "Aspen Manor",
      "version": "1.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "93727",
      "fileName": "Aspen Manor-39400-1-9.rar",
      "uploadedUnix": "1396638486",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/10c80357c5131fcaba098712da4f5f4fd37f626ff5959142a70045b6a91fea1e/analysis/1408007178/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor-39400-1-9.rar?fid=1000103656&ttl=1535819825&ri=8192&rs=8192&setec=f9e8baa38b15ac6ebc9ccd5e42070d52"
    },
    {
      "fileId": "1000103658",
      "name": "Aspen Manor Loose Files Version",
      "version": "1.9a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "88902",
      "fileName": "Aspen Manor Loose Files Version-39400-1-9a.rar",
      "uploadedUnix": "1396640561",
      "modVersion": "1.9a",
      "virusScanUrl": "https://www.virustotal.com/file/d1457f866f8b8cc016453c9806c2ecfcaa48d7b2734ea64ebf267698274f6034/analysis/1408007193/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor%20Loose%20Files%20Version-39400-1-9a.rar?fid=1000103658&ttl=1535819826&ri=8192&rs=8192&setec=ea82bb230099612b5a253e6c21087b40"
    },
    {
      "fileId": "1000118889",
      "name": "Aspen Manor. Follower and Spouse Bed and Pool Undress BSA version ",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "92775",
      "fileName": "Aspen Manor. Follower and Spouse Bed and Pool Undress BSA version -39400-2-0.rar",
      "uploadedUnix": "1406115766",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/d3a4440ba7ca8b6d765971854a235371343b8ef6c2c1017ac09479d5e92d9a55/analysis/1406115817/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor.%20Follower%20and%20Spouse%20Bed%20and%20Pool%20Undress%20BSA%20version%20-39400-2-0.rar?fid=1000118889&ttl=1535819826&ri=8192&rs=8192&setec=d0da3341a881e0f54bca42cc29e03548"
    },
    {
      "fileId": "1000118890",
      "name": "Aspen Manor. Follower and Spouse Bed and Pool Undress Loose files version ",
      "version": "2.0alt",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "87929",
      "fileName": "Aspen Manor. Follower and Spouse Bed and Pool Undress Loose files version -39400-2-0alt.rar",
      "uploadedUnix": "1406116827",
      "modVersion": "2.0alt",
      "virusScanUrl": "https://www.virustotal.com/file/634040d7e7c300be5b72284767c0472d3ba3de348ae228443a9aee896aa986f6/analysis/1406116901/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor.%20Follower%20and%20Spouse%20Bed%20and%20Pool%20Undress%20Loose%20files%20version%20-39400-2-0alt.rar?fid=1000118890&ttl=1535819827&ri=8192&rs=8192&setec=aaf3ce317652b1361c031485bbce857f"
    },
    {
      "fileId": "1000118894",
      "name": "Aspen Manor. Follower and Spouse Pool Undress Only BSA version ",
      "version": "2.0B",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "92774",
      "fileName": "Aspen Manor. Follower and Spouse Pool Undress Only BSA version -39400-2-0B.rar",
      "uploadedUnix": "1406117904",
      "modVersion": "2.0B",
      "virusScanUrl": "https://www.virustotal.com/file/4bc6ec4eb4b95e5e95dd8a4457ad24929e33be1d8f2726beac4ba1b15f167a74/analysis/1406118004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor.%20Follower%20and%20Spouse%20Pool%20Undress%20Only%20BSA%20version%20-39400-2-0B.rar?fid=1000118894&ttl=1535819827&ri=8192&rs=8192&setec=4153ec53d64343ee7da08d971214ee5e"
    },
    {
      "fileId": "1000118897",
      "name": "Aspen Manor. Follower and Spouse Pool Undress Only Loose Files version ",
      "version": "2.0Balt",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "87927",
      "fileName": "Aspen Manor. Follower and Spouse Pool Undress Only Loose Files version -39400-2-0Balt.rar",
      "uploadedUnix": "1406118861",
      "modVersion": "2.0Balt",
      "virusScanUrl": "https://www.virustotal.com/file/06b5129d1888703b4ce938b7978cd7377c6ceba0e906b6193a582d30daf2f279/analysis/1406118979/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspen%20Manor.%20Follower%20and%20Spouse%20Pool%20Undress%20Only%20Loose%20Files%20version%20-39400-2-0Balt.rar?fid=1000118897&ttl=1535819827&ri=8192&rs=8192&setec=fe179292f3c6e8c20e14eb5ed18a5a08"
    }
  ]
}