{
  "modId": 39471.0,
  "modName": "Dragonslayers",
  "summary": "Features a unique quest that requires you to kill 10 powerful enemies across Skyrim!",
  "descriptionHtml": "[center][heading][b]Dragonslayers[/b][/heading][/center]\r\n[center][heading][i]A quest with difficulty[/i][/heading][/center]\r\n[line]\r\n\r\n[color=yellow]This is my first mod(don\\'t be scared by that) so feedback GREATLY appreciated! If you have any nerfs in mind, bugs to report, anything, please post it! I can use all the feedback, either good or bad![/color]\r\n\r\nYou initiate the quest by going to Sky Haven Temple, and reading a note that\\'s in the same chamber as where you find Dragonbane!\r\n\r\n[b][i]Why should I download this mod?[/i][/b]\r\nWhy not? It adds a new challenging quest that even high-leveled characters will have to approach with caution. This quest is like 10 boss fights ready for whenever you need one! And you can download it but never play the quest, just for fun!\r\n\r\n[b][i]But exactly what does this mod do?[/i][/b]\r\nThis mod adds a new quest that requires the Dragonborn to kill 10 powerful enemies spread across Skyrim. But when I say powerful, I don\\'t mean that as a decorative adjective; these guys are TOUGH! Each of them also has unique loot you can\\'t find anywhere else!\r\n\r\n[heading]Feature list:[/heading]\r\n[b]*A brand new quest.\r\n*9 NPC\\'s that are all ready to decapitate you the moment you dare strike them.\r\n*New weapons, armor pieces and jewelry. All are retextured vanilla items with unique enchantments.\r\n*A boss dragon with a ton of health.\r\n*A spell that summons an ethereal dragon to fight on your side.[/b]\r\n\r\n\r\n\r\n[heading]General tips:[/heading]\r\n[b]*The difficulty guideline is \\'slightly challenging on Adept\\'. If you\\'re used to playing on Master, don\\'t set it any easier, you won\\'t get the satisfaction this way.\r\n*Don\\'t rush through this quest. It\\'s already considerably short, and it takes away the fun of this quest. The entire goal is prepare for 1 specific target, have an epic battle, and then do some other quests while at the same time preparing for the next target.\r\n*Hotkey Restore Health/Restore Magicka Potions. I personally create a lot of health potions and hotkey them on 1. Trust me, you\\'re gonna want to heal a lot.\r\n*The key is to have a distraction. Now I know what you\\'re thinking; but don\\'t sacrifice Lydia! Even if you\\'re a Two-handed Nord character, conjure up a distraction! Use a powerful sommoning spell because you won\\'t be able to take too many hits yourself.\r\n*If you\\'re [i]really[/i] having trouble with 1 specific enemy, sneak up on him and use daggers. That\\'ll take at least 1/3th away from it\\'s health when the battle starts.[/b]\r\n\r\n[heading]Known bugs:[/heading]\r\n[b]*Technically speaking, although unlikely, it\\'s possible for the targets to be killed before you arive. If this for some reason doesn\\'t advance the quest(which it should), open the console and resurrect them, then kill them again.\r\n*The Drainfang armor set may cause some visible seams between bodyparts with some races. There is currently no fix for this.\r\n*When summoning a dragon it might appear a few miles into the distance, this is usually no problem.\r\n*[color=red]The armor sets only work for male characters at the moment. I might fix this in the near future.[/color][/b]\r\n",
  "categoryId": "35",
  "version": "1.0",
  "author": "Rickvs",
  "createdUnix": "1375478158",
  "updatedUnix": "1375478072",
  "containsAdultContent": false,
  "uploadedBy": "Rickvs64",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000043621",
      "name": "Main mod file",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11886",
      "fileName": "Main mod file-39471-1-0.zip",
      "uploadedUnix": "1375478072",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e5d8d7c61f54a609a6758f043fa86f8a3f3d7edc24d96c104622f5785f924d54/analysis/1407666730/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20mod%20file-39471-1-0.zip?fid=1000043621&ttl=1535819898&ri=8192&rs=8192&setec=b55a62a03ee6235b80cd85acb5375dd6"
    }
  ]
}