{
  "modId": 39492.0,
  "modName": "Disable Tutorials - INI Tweaks for Wrye Bash",
  "summary": "Two INI Tweaks for Wrye Bash that allow one to select whether or not in-game tutorials are active.",
  "descriptionHtml": "It took me a rather inordinate amount of time to find this simple change whilst Googling for it the first time, and I was rather miffed that this simple change wasn\\'t (and isn\\'t) included in Wrye Bash already as of this writing. It\\'s easy enough to do yourself once you know what to add but for visibility\\'s sake I\\'m posting the tweaks here.\r\n\r\nThis simple change will disable or enable the tutorial messages for low stamina, health, bartering, walking, breathing, tying the dovakiin\\'s shoes, etc. that one needs to slog through for every new character. With the number of new characters I\\'ve made recently for modding\\'s sake, it drove me up a wall.\r\n\r\nSo, here, yay. Two easy-peasy tweak files for Wrye Bash that\\'ll let you turn-off the thrice-damned tutorial messages you get for every new game.\r\n\r\nDownload the archive and extract into your main Skyrim directory (not the data folder). Wrye Bash is required (though if you didn\\'t suspect that by now you should be twhacked across the head with a sweetroll >.> ). \r\n\r\nNo, don\\'t use NMM to install these, as NMM puts everything in the Data folder (a rather sad limitation but one we must live with for now).\r\n\r\nNo, this does not affect the equally annoying tutorial quests for alchemy, smithing, and enchanting.\r\n\r\nEdit (03/08/2013): chinagreenelvis made a similar upload a while ago ( http://skyrim.nexusmods.com/mods/29640/? ) which I missed when searching earlier. It\\'s a guide for how to do this manually rather than INI tweaks for WB, but worth mentioning regardless, as it doesn\\'t show up on a Nexus search if you search for \\\"tutorials\\\" rather than \\\"tutorial\\\". If you don\\'t have nor want to use Wrye Bash look there.",
  "categoryId": "42",
  "version": "1",
  "author": "TW2",
  "createdUnix": "1375500001",
  "updatedUnix": "1375499857",
  "containsAdultContent": false,
  "uploadedBy": "TW2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000043707",
      "name": "Disable Tutorials - INI Tweaks for Wrye Bash",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Disable Tutorials - INI Tweaks for Wrye Bash-39492-.7z",
      "uploadedUnix": "1375499857",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f4dc2fa28eae99ed6c8ea8724b475a4c80f27f061a1a399edc575010bff76271/analysis/1407667027/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Disable%20Tutorials%20-%20INI%20Tweaks%20for%20Wrye%20Bash-39492-.7z?fid=1000043707&ttl=1535819918&ri=8192&rs=8192&setec=58acecdda498e28bdf75ce4172288a7e"
    }
  ]
}