{
  "modId": 39508.0,
  "modName": "Dawnguard enhancment mod",
  "summary": "This mod actually enhances a few things besides vampire and werewolf play, read further for more information.",
  "descriptionHtml": "This mod is intented to enhance play with vampires, werewolfs and the Dawngaurd faction but also adds some new spells and some enhancements to spells and armor.  My current computer is a bit low-tier so playing Skyrim on it is really slow so I haven\\'t been able to personally check to see if how well all the aspects of the mod work.  If you find any bugs or errors you can notify me or attempt to fix them yourself, I have to wait until I can get Skyrim running at a decent speed to inspect it for myself.  Also this is still a work in progress so not everything is complete, as I said before feel free to edit it yourself if you wish.\r\n\r\nRequirements:\r\nSkyrim\r\nDawngaurd\r\n\r\nVampire Enhancements:\r\n\r\nEnhanced strength:  Vampires now gain a plus 5 bonus to hand-to-hand, one-handed, and two-handed per vampire stage.\r\nSun-damage:  Stage 1 vampires only get a -5 reduction in health, magicka, and stamina, regeneration has also been allowed in the sun.  Stage 2-4 vampires are mostly unchanged with the exception that they will take constant sun damage with each stage increasing the amount.\r\nNatural Armor:  Vampires now get a plus 25 AR bonus for each vampire stage.\r\n\r\nWerewolf Enhancements:\r\n\r\nEnhanced strength:  Even in human form you get attack bonus\\', primarily a 20 plus bonus to hand-to-hand, and a 10 plus bonus to one and two-handed.\r\nNatural Armor:  Even in human form you will get a 50 AR bonus.\r\n\r\nTemperable Silver-Weapons and Skyforge Steel Dagger:\r\n\r\nYou can now improve Silver weapons and the Skyforge Steel Dagger at grindstones.\r\n\r\nGunmar\\'s Armory:\r\n\r\nGunmar now sells Dawngaurd and Silver weapons for those fighting the undead.\r\n\r\nEnhanced Shouts and Spells:\r\n\r\nThe Unrelenting Force shout now has increased damage for all levels.  Some vanilla spells have altered damage outputs and magicka costs now and some new spells can be bought from the various court mages (note:  I haven\\'t added the new spells to all the Court Mages inventories as of yet).  There are a few new Master level spells as well which can only be bought from Faralda at the College of Winterhold.\r\nThere are also some test spells for those joining the Volkihar, I\\'m not sure if they will work properly or not as of yet so save before-hand.  They can be bought from Ronthil at Volkihar Castle.\r\nTest Vampire Spells:\r\nVampiric Grip (Human-form)\r\nMist Form (Human-form)\r\nBeast Form (For those of you who don\\'t want to become werewolves but want the ability to transform into one anyway)\r\n\r\nEnhanced Equipment:\r\n\r\nAmulet of Talos:  I slightly upgraded the shout reduction enchantment, it may or may not be still to low to make shouts more viable but still balanced.\r\nEbony Mail:  I added two of the Morrowind enchantments to it, it still has the vanilla enchantments but also gives a 75% resistance to fire and a 10% resistance to magic.\r\nNamira\\'s Ring:  I add a plus 10 bonus for AR and magic resistance to the ring.\r\nEbony Blade:  It\\'s base damage is equal to a Daedric Greatsword now.\r\n\r\n\r\n\r\nThis mod has no scripts, only some altered and new spells, abilities and equipment.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Demon Chorus",
  "createdUnix": "1375525652",
  "updatedUnix": "1375525652",
  "containsAdultContent": false,
  "uploadedBy": "DemonChorus",
  "primaryFile": null,
  "files": []
}