{
  "modId": 39517.0,
  "modName": "Aretino Residence Player Home",
  "summary": "Turns the Aretino Residence in Windhelm into a player home. ",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center]\r<br />\r<br />This mod turns the [url=http://www.uesp.net/wiki/Skyrim:Aretino_Residence]Aretino Residence[/url] in Windhelm (spoilers on that link to the quest Innocence Lost) into a player home. \r<br />\r<br />This brings me back... When I was just starting out with modding I wanted to turn this into a player home, since by the time I was level 50 I still had not started the main quest and did not have access to Hjerim. Of course, being dumb and silly, I started working on the cell itself, removing all the quest triggers, and it broke my game beyond repair. But now that I know better, and after I sucessfully managed to turn [url=http://skyrim.nexusmods.com/mods/39119//?]Frostflow Lighthouse[/url] into a player home without breaking anything, I decided to revisit this project. \r<br />\r<br />The Aretino Residence is a rather small building to start with. I moved some walls a bit to open up enough space for a small armory. There are smithing, enchanting and alchemy amenities, weapon racks and plaques, a destruction skill book that was included in the original cell, some modest storage, two mannequins, three display cases and some bookshelves, as well as a bathing room with a bathrub to stay clean if you&#39;re using a mod such as [url=http://skyrim.nexusmods.com/mods/29025//?]Drink Eat Sleep Bathe[/url] (and yes, the bathroom is based on the one I made for Frostflow Lighthouse). I also left a little static memento on the mantelpiece that people who have finished Innocence Lost may recognize ;) All containers, including the sacks, are safe and will not respawn. The place is also fully navmeshed and has some idle markers for your companions.\r<br />\r<br />Just as I did with Frostflow Lighthouse, you can actually enable the mod without having done the quest Innocence Lost, since all the triggers have been left intact and the door simply links to a different cell, instead of the original one. And this means that, if you have not done the quest, you will hear gossip from the neighbors even if you are the one living in the house and not some silly NPC. \r<br />\r<br />But, you may be wondering, what if you want to do the quest later and have the house now? Or even have the house and do the quest at the same time? Well, the console is your friend&#33; In order to access the original Aretino Residence, type [i]coc WindhelmAretinoResidence[/i] into the console and press enter. And once you are done there, type [i]coc Riverwood[/i] into the console to be taken back into Skyrim. [b]DO NOT use the door in the original cell[/b] - it may say it will take you to Windhelm, but it will leave you stuck under the city with no way to get back to the surface. And, if you are using version 1.2.3 of the Unofficial Skyrim Patch or older, Angrenor Once-Honored will be scripted to move into the Aretino Residence, which could cause trouble for some users. I don&#39;t use the Unofficial Skyrim Patch (gasp&#33;) so I won&#39;t be able to help.\r<br />\r<br />Custom content (scrolls and food plates on the table) from [url= http://skyrim.nexusmods.com/mods/16525/]Modders Resource Pack[/url] by Oaristys and Tony67.\r<br />\r<br />To install, extract the contents of your downloaded file to your &#39;SteamSteamAppsCommonSkyrimData&#39; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp. And if you ever want to uninstall it, the few pieces of custom content I used are located in a folder named &#39;Aretino&#39; in your &#39;meshes&#39; folder for easy removal. Have fun&#33; \r<br />\r<br />\r<br />[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "67",
  "version": "1.00",
  "author": "Jokerine",
  "createdUnix": "1375535838",
  "updatedUnix": "1375535763",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000043813",
      "name": "Aretino Home v1",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "136",
      "fileName": "Aretino Home v1-39517-1-00.rar",
      "uploadedUnix": "1375535763",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/ac09d30831cdebfc28e59cb9b5b374ff4c888bd9a8884901a0c94c9351ebe815/analysis/1407667434/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aretino%20Home%20v1-39517-1-00.rar?fid=1000043813&ttl=1535819941&ri=8192&rs=8192&setec=c28e6fac9b3795e16caf66e04e202de3"
    }
  ]
}