{
  "modId": 39555.0,
  "modName": "Innocence Lost Alternative",
  "summary": "Are you playing as a good hero in Skyrim and want to destroy the Dark Brotherhood, but you refuse to kill Grelod for Aventus, no matter how nasty she is? Well this mod allows you to report it to the guards for them to arrest her! However, she refuses to be taken in, and attacks the guard, forcing the guard to retaliate and kill her. ",
  "descriptionHtml": "Are you playing as a good hero in Skyrim and want to destroy the Dark Brotherhood, but you refuse to kill Grelod for Aventus, no matter how nasty she is? Well this mod allows you to report it to the guards for them to arrest her! However, she refuses to be taken in, and attacks the guard, forcing the guard to retaliate and kill her.\r\n\r\nDetails\r\n============================================================================================\r\nWhen you install this mod, there will be a new guard NPC outside of the Honorhall Orphanage (look at pictures in the description for exact location). When you start the Innocence Lost quest, you will be able to talk to the guard and report her in. He will then run into the orphanage, where you must speak to him again to initiate the scene where he attempts to arrest her, but she resists and attacks.\r\n\r\nAs for the actual Innocence Lost quest, I did not touch or change any part of the quest except for the objective which states you can report Grelod to the guard. So when you talk to Aventus after the fact and when you get captured by Astrid, the dialogue still slightly reflects that you murdered her. In my opinion, the dialogue options available to you are good enough.\r\n\r\nIMPORTANT\r\n============================================================================================\r\nSAVE BEFORE YOU START TALKING TO THE GUARD!!!!!!!!!!\r\nThere are small issues that occur randomly sometimes when initiating the dialogue and once inside the orphanage (see below). Save before activating him, and if you do come upon a problem, just reload your save and it should all work.\r\n\r\nSmall Issues\r\n============================================================================================\r\n*If you talk to him without letting him say his lines, or move too quickly from one location to the other without letting the scripts perform, the guard could simply walk away and not run into the orphanage.\r\n*It would be a good idea to go inside the orphanage first and watch the scene where Grelod talks to the kids. This scene only happens the first time you enter the orphanage, so after you watch it, then it would be safe to go back out and talk to the guard. If not, both scenes could conflict with each other and cause some weird bugs. You can talk to the guard without going into the orphanage at all in the past, but be careful not to walk too far into the orphanage. That is how the Grelod talking scene starts and you DO NOT want it to start before you initiate the second line of dialogue with the guard.\r\n*No matter how much I tried, I could not get a quest marker on the guard himself. You will just have to find him. Don\\'t worry, he doesn\\'t go more than 5 feet away from his original position.",
  "categoryId": "35",
  "version": "2.0",
  "author": "mvplayer277",
  "createdUnix": "1375561059",
  "updatedUnix": "1375561052",
  "containsAdultContent": false,
  "uploadedBy": "mvplayer277",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000043912",
      "name": "Innocence Lost Alternative",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1371",
      "fileName": "Innocence Lost Alternative-39555-2-0.7z",
      "uploadedUnix": "1375561052",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/855b1ee21c53f6379ebb8cc0ceafc9400783e73ff8e8e48970916fc3d36caddd/analysis/1407667811/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Innocence%20Lost%20Alternative-39555-2-0.7z?fid=1000043912&ttl=1535819980&ri=8192&rs=8192&setec=6b1d0c7eb04d2b43db8b3ae6fc57ec88"
    }
  ]
}