{
  "modId": 39570.0,
  "modName": "Drinks for the Thirsty",
  "summary": "Tired of ale and mead? Had enough of wine and alcohol? Treat your teetotaler to a choice berry juice, or a fresh-brewed pot of tea!\r\nPLUS: fix for vanilla \\'potion drinks\\', and new: GREEN PACT drinks!",
  "descriptionHtml": "Mead mead mead. Would it kill them to get some milk now and then? (Stupid bees and their stupid honey...)\r\nNow with an updated version!\r\n--Hearthfires version on the way!-- (Standard version is still compatible, it just uses its own milk and changes goat drop list.)\r\n\r\nIt is a mystery how anyone in Skyrim stays hydrated when all they have available is alcohol. That\\'s like putting out fire with MORE FIRE.\r\nIf your character doesn\\'t like alcohol, is trying to recover from an addiction, or is just a plain ol\\' milkdrinker, wouldn\\'t it be nice to have something else to drink?\r\n\r\nOr perhaps you are a bosmer, following the Green Pact. You aren\\'t allowed to eat or use anything derived from plants, so meat is where it is at. Where are your own culture\\'s classic fermented drinks? HERE THEY ARE.\r\n\r\nInnkeepers will now (occassionally!) sell these (you milkdrinkin\\' wuss) but this mod adds several drinks you can make yourself or find in the wild. All drinks are made at a standard crafting pot using vanilla resources so NO MODS NEEDED!\r\nDrinks that are non-alcoholic do not come with a stamina regeneration debuff.\r\n\r\n\r\n\r\n\r\n\r\n======REQUIRES=====\r\nSkyrim. No mods, no DLC, no scripts!\r\n\r\n\r\n======INSTALLATION=====\r\nSame as other basic mods. Plop the .esp in your data folder, and enable at your launcher. Then enjoy!\r\nBUT WAIT, there\\'s four files in here? Choose one!\r\n\r\nDftT.esp: The standard version, with full content.\r\n\r\nDftT-WTLS.esp: What\\'s that, you say? You use weightless ingredient/food mods and now these things are weighing you down? BEHOLD! All the drinks (and any added ingredients/foods) are now WEIGHTLESS.\r\n\r\nDftT-NoGreenPact: Not a bosmer? Disgusted by the idea of fermenting meats and milk into so-called \\'forest friendly wines\\'? Pish-posh! Use this version.\r\n\r\nDftT-NGP-WTLS: None of the bosmeri drinks, AND it is all weightless!\r\n\r\n\r\n\r\n\r\n=====WHAT THIS MOD DOES======\r\n1> Fixes special drinks Cliff Racer, Velvet LeChance, White-Gold Tower and Cyrodilic Brandy so they appear as drinks in the food section (and not under potions, wut)\r\n\r\n2> Several new drinks added, obtained primarily through crafting (innkeepers will sometimes have some of the stronger stuff, though the bosmeri drinks are usually only bought from Drunken Huntsman). All drinks restore stamina, some will restore slightly less stamina in return for other properties depending on drink type. All crafted drinks are at a cooking pot (so you don\\'t need Hearthfire\\'s oven).\r\nAlcoholic drinks will have the standard debuff to stamina regeneration (which I see as inebriation) - any non-alcoholic drinks will not have this.\r\n\r\n3> Modifies the on-death drop list for cows and goats to drop milk (goats and cows themselves are unchanged)\r\n\r\n\r\n\r\n\r\n\r\n\r\n======DRINKS AND HOW TO GET THEM=====\r\n(Ingredient) Coffee Grounds\r\n---bought: commonly Khajiit merchants\r\n---bought: rarely alchemists\r\n\r\nApple Cider\r\n---crafted: 3 green apples\r\nSlightly alcoholic: mild stamina debuff\r\nfinally a use for green apples!\r\n\r\nApple Juice\r\n---crafted: 1 red apple, 2 green apple\r\noh look another use!\r\n\r\nAppleberry Punch\r\n---crafted: 2 red apples, 2 snowberry\r\n\r\nCarrot Juice\r\n---crafted: 3 carrots\r\nFinally good way to use up all those damn carrots.\r\n\r\nElsweyr Coffee\r\n---bought: rarely khajiit merchants\r\n---crafted: 1 moon sugar, 1 coffee grounds (DftT), 1 milk (DftT, Hearthfire NOT required)\r\nDue to the scarcity and value of the ingredients, coffee has stronger bonuses than most other drinks and higher value.\r\n\r\nMilk\r\n---dropped: large chance to drop from goats and cows. Cows have small chance to drop two.\r\n---bought: commonly Elrindr in the Drunken Hunstman\r\n---bought: rarely from some innkeepers\r\nGood for bosmer players that follow the Green Pact\r\nUsed as base ingredient in bosmeri fermented Green Pact wines/mead\r\n\r\nMixed Berry Juice\r\n---crafted: 3 snowberry, 1 jazbay, 2 juniper\r\n---bought: rarely from some innkeepers\r\nFunctions like a weak well-being potion.\r\n\r\nTea (Canis)\r\n---crafted: 3 canis root (Just like Varona used to make - Dragonborn NOT required)\r\n---bought: sometimes from innkeepers\r\nDue to Canis Root\\'s damage stamina property, canis tea does not restore as much stamina as other teas.\r\n\r\nTea (Elf\\'s Ear)\r\n---crafted: 3 elf\\'s ear\r\n---bought: sometimes from innkeepers\r\nmild magicka restoration.\r\n\r\nTea (Medicinal)\r\n---crafted: 1 grass pod, 1 tundra cotton, taproot\r\nThough this tea both cures disease and detoxes poisons (if your PC doesn\\'t want to pray to remove them), it makes your character sick with a stamina drain debuff for 5sec.\r\n\r\nTea (Red Berry)\r\n---crafted: 3 snowberry\r\n---bought: sometimes from innkeepers\r\nTINY bit of health bonus.\r\n\r\nTea (Thistle)\r\n---bought: sometimes from innkeepers\r\n---crafted: 3 thistle. Slightly weaker than other teas.\r\n\r\nTomato Juice\r\n---crafted: 3 tomatos\r\n---bought: rarely from some innkeepers\r\n\r\n\r\n\r\n....aaaaand now the Green Pact drinks. Milk can also be drunk under the Green Pact, but is included in the NoGreenPact version regardless. These drinks are not available in the NoGreenPact version.\r\nGreen Pact drinks are typically crafted, but can be bought from the Drunken Hunstman, and may (occasionally!) be found at the Gnis Cornerclub or Ragged Flagon.\r\n\r\nBosmeri Mead\r\n---crafted: 1 honeycomb, 1 milk (DftT)\r\nAlcoholic, therefore has stamina regen debuff\r\n\r\nBosmeri Bloodwine (Wild)\r\n---crafted: 1 milk, 1 raw beef\r\n---crafted: 1 milk, 1 raw venison\r\n---crafted: 1 milk, 1 leg of goat\r\n---crafted: 1 milk, 1 dog meat\r\nAlcoholic, therefore has stamina regen debuff\r\n\r\nBosmeri Bloodwine (Dark)\r\n---crafted: 1 milk, 1 human flesh\r\n---crafted: 1 milk, 1 human heart\r\nYep, the Green Pact supports - nay, encourages - cannibalism.\r\nAlcoholic, therefore has stamina regen debuff\r\n\r\nBosmeri Bloodwine (Rich)\r\n---crafted: 1 milk, 1 raw horker\r\n---crafted: 1 milk, 1 mammoth snout\r\nAlcoholic, therefore has stamina regen debuff\r\n\r\nBosmeri Wine (2)\r\n----crafted: 3 milk (DftT)\r\nNow your bosmer can follow the Green Pact!\r\nAlcoholic, therefore has stamina regen debuff\r\n\r\n\r\n\r\n\r\n\r\n===== PLANS FOR THE FUTURE? =====\r\nCurrently looking to make wells activated to receive water. (No known way to get water from the world without scripts however.)\r\nHoping to make a \\\"Food for the Hungry\\\" module to use up \\'floating\\' cooking ingredients (eg Dog Meat, Clam Meat, Gourds, and other nigh-useless items) that MAY use milk from this mod.\r\n\r\nHopefully a compatibility version with Realistic Needs and Diseases soon!\r\n\r\nWorking on a Hearthfires version to fix drop lists and prevent ingredient overlap (eg milk). May require a bit of work getting different iterations of Drinks for the Thirsty (released) and Food for the Hungry (in progress) to work with each other.\r\n\r\nHave any drinks to suggest? Move over to the forums tab, and post your idea in the Suggested Drinks thread. Anything plausible could be made for the next version!",
  "categoryId": "94",
  "version": "1.1.1",
  "author": "Karsciyin",
  "createdUnix": "1375587237",
  "updatedUnix": "1375620388",
  "containsAdultContent": false,
  "uploadedBy": "Karsciyin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000044082",
      "name": "Drinks for the Thirsty 1-1-1",
      "version": "1.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Drinks for the Thirsty 1-1-1-39570-1-1-1.rar",
      "uploadedUnix": "1375620388",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/415ff5c3d1aebb89d680e50670e4a8a69d6bedccd4801711dbb3936920f64eeb/analysis/1407668587/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Drinks%20for%20the%20Thirsty%201-1-1-39570-1-1-1.rar?fid=1000044082&ttl=1535819993&ri=8192&rs=8192&setec=1ca28d942ee19ef8be91139af54695cd"
    }
  ]
}