{
  "modId": 39677.0,
  "modName": "Mage Shield V1",
  "summary": "Adds a shield geared towards a mage to the game.",
  "descriptionHtml": "While working with the customization of some enchantments in the CK, I thought what kind of shield might work well with a mage.  Thus I created this mage shield as a sort of test of that.  I know it\\'s a bit on the shiny side, but I was more interested in the enchantment of the shield than textures (a bit lazy on that part, I admit).\r\n\r\nThe official name of the shield is, \\\"Mage Shield of Flames.\\\"  You can get it either through the command console or by forging (in the STUDDED category).\r\n\r\nHow it works: Equipped it will boost your magic resistance by 25%.  Blocking will double the rate of magicka regeneration.  And a power bash (the related perk must be unlocked to work) will unleash a temporary flame cloak spell (the duration is only a couple seconds--I couldn\\'t get it to work beyond that).\r\n\r\nFor a mage willing to sacrifice dual casting, even temporarily, this could be used when magicka is low and enemies are all around.  The mage can block and recharge magicka, and use the power bash to deal with especially feisty creepies. =P\r\n\r\n\r\n~ Credits & Thanks ~\r\n. Mr Dave for his Texture Resource (http://skyrim.nexusmods.com/mods/2324) ",
  "categoryId": "54",
  "version": "V1",
  "author": "Denki Groove",
  "createdUnix": "1375715793",
  "updatedUnix": "1375715784",
  "containsAdultContent": false,
  "uploadedBy": "denkigroove",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000044420",
      "name": "Mage Shield V1",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1547",
      "fileName": "Mage Shield V1-39677-V1.zip",
      "uploadedUnix": "1375715784",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/696fb84fc1255869bc62e1a6eedcc8db4edb1718937f1fed274187a97a2608d2/analysis/1407669850/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mage%20Shield%20V1-39677-V1.zip?fid=1000044420&ttl=1535820128&ri=8192&rs=8192&setec=9aa677d504fba943ce87442086d1e459"
    }
  ]
}