{
  "modId": 39690.0,
  "modName": "Ancient Dovahkiin Armor by agentspoon",
  "summary": "Adds a new set of armour with a custom meshed based upon the Blades Armor and Ancient Nord Armor.",
  "descriptionHtml": "\\\"Once upon a time, a young Imperial Dovahkiin sat pondering a simple question....For he wanted to show allegiance to the people of Skyrim but also to the Blades and wished he could have an armour that showed both allegiances.\\\" \r\n\r\n[DESCRIPTION]\r\n\r\n(THIS ARMOUR IS MALE ONLY, WILL SHOW UP AS IRON ON FEMALES)\r\n\r\nSorry of the low quality screen shot, had to lower a few settings so stop my PC blowing up with all the programs running at the same time.\r\n\r\nSimply adds a new Blades/Ancient Nordic themed armour created to my own personal tastes.\r\n\r\nIt may only be a mash-up but this is my first armour/first attempt at ever doing anything like this, so advice is welcome.\r\n\r\nThere may be some clipping but its not very noticeable and will be addressed in future updates.\r\n\r\nI\\'m not too sure if I got everything right so please make a fresh save before you download just incase.\r\n\r\nOne thing I do like about this armour is that it adds Ancient Nord Armor with pants AND sleeves without loosing any armour.\r\n\r\nConsider this an open test, feedback is very welcome and I will try to correct the problems if possible but I am still learning. \r\n\r\nHelp and guidance is very welcome.\r\n\r\nIf all goes well more armour mods will follow.\r\n\r\n[INSTALLATION]\r\n\r\nDownload with NMM or extract to Data Folder.]\r\n\r\n[HOW TO OBTAIN]\r\n\r\nSorry folks but Console Commands again :(\r\n\r\nType in Help \\\"Ancient Dovahkiin\\\" and four armour entries will appear, boots, helmet, armor and Gauntlets.\r\n\r\nUse the player.additem commands to add them to your inventory.\r\n\r\nOnly the Helmet and Armour have a custom Mesh.",
  "categoryId": "54",
  "version": "0.5",
  "author": "agentspoon",
  "createdUnix": "1375726672",
  "updatedUnix": "1375726059",
  "containsAdultContent": false,
  "uploadedBy": "agentspoon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000044455",
      "name": "Ancient Dovahkiin Armor 0-5",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "241",
      "fileName": "Ancient Dovahkiin Armor 0-5-39690-0-5.rar",
      "uploadedUnix": "1375726059",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/97e13a2eb96ca3d0fd4f85fb1d9fae2a716a03cf67bb1f881c96a05d4dc29146/analysis/1407670143/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ancient%20Dovahkiin%20Armor%200-5-39690-0-5.rar?fid=1000044455&ttl=1535820143&ri=8192&rs=8192&setec=36f8813aebd01790f84ee15540455b8e"
    }
  ]
}