{
  "modId": 39780.0,
  "modName": "College Visitor Pass",
  "summary": "Allows you to donate money to gain access to the College without becoming a full member, allowing you to progress quests that shouldn\\'t require membership but did because the person you need to talk to never leaves the college.",
  "descriptionHtml": "Have you ever been bothered that to finish the main story, or just to use any of the facilities of the College you had to be a fuly fledged member of the guild? Bothered that a warrior can join just by shouting at the floor? \r\n\r\nWell I was, so I made this mod. \r\n\r\nThis mod changes the conversation with Faralda so that you can bri- donate money to the college to help further its research goals. This of course brings you special benefits, such as the ability to use the college\\'s facilities without being a member. You will not gain access to member exclusive services such as skill training. \r\nThis allows you to complete quests that would otherwise require you to join the College to complete, despite being otherwise un-related to the College. Some quests however do require membership, I do not have a definitive list however. \r\n\r\nWhilst doing this I remembered how you could become a member by proving that you are the Dragonborn, I was bothered by this and turned that into another way of gaining a visitor\\'s pass. The shouting to get in route no longer makes you a full member of the college. \r\n\r\nTo become a full member after gaining a visitor\\'s pass you must go back to Faralda and either persuade, or complete the test. \r\n\r\n\r\nCompatibility issues and other minor strangeness: \r\nAny mod that edits Faralda may be incompatible with this mod, I have not got any of those myself so feedback is welcome. \r\n\r\nAny mods that add new people to the College who acknowledge your membership will, of course, not acknowledge that you are only a visitor. \r\nAncano, and other base game people, will occasionally mention you being a new member etc. I don\\'t mind this because it is reasonable that they would mistake you for a member instead of a visitor. Adding new lines to change this would be terrible and removing existing lines may introduce more bugs. Certain people within the guild have their AI halted until you join fully, Ancano, Mirabelle, Tolfdir and the three students. These guys rely on you moving through the quest to start up, so they will just hang out where they start till then.\r\n\r\nAlso available on the Steam Workshop:\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=165340534",
  "categoryId": "25",
  "version": "1.0.1",
  "author": "Jokiros",
  "createdUnix": "1375816564",
  "updatedUnix": "1375816913",
  "containsAdultContent": false,
  "uploadedBy": "Jokiros",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000044742",
      "name": "College Visitors Pass",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "College Visitors Pass-39780-1-0.rar",
      "uploadedUnix": "1375816560",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1ef678e14b4c40c9225204ee25a09d43202f7ce4e544199a9d06db48d7d24558/analysis/1407671783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/College%20Visitors%20Pass-39780-1-0.rar?fid=1000044742&ttl=1535820229&ri=8192&rs=8192&setec=e42dabd2083de5bdd9e55a032cfa931f"
    },
    {
      "fileId": "1000044745",
      "name": "College Visitors Pass",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "College Visitors Pass-39780-1-0-1.rar",
      "uploadedUnix": "1375816913",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/618a9f53b933e701011344b002c54e6e89f9dbdb4753e74440fde4b44168ce10/analysis/1407671783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/College%20Visitors%20Pass-39780-1-0-1.rar?fid=1000044745&ttl=1535820229&ri=8192&rs=8192&setec=81503f1426406e4c2b85771086912493"
    }
  ]
}