{
  "modId": 3986.0,
  "modName": "Dalls_Draugr_n_Nord_Hero_Weapons",
  "summary": "Draugr_n_Nord_Hero_Weapons is arms custom re-texturing (n not simple recolour) mod which changes how Draugr n Nord Hero weapons look.",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - Draugr_n_Nord_Hero_Weapons\r\n\r\nv1.2\r\n\r\n17/01/2012\r\nDraugr_n_Nord_Hero_Weapons is arms custom re-texturing (n not simple recolor) mod which changes how Draugr n Nord Hero weapons look.*\r\n\r\n* Word of warning - my work actually do changes how these items look - rather then \\\"polishes\\\" same / boring game \\\"apple\\\" a bit further as many other popular mods do - so it might not be fit for casual modders or more-of-same seekers.\r\n\r\nWhy my game textures look as they do: All textures I make are closer to original game Art / Game Art concept (short of some minor technical n aesthetic changes) then are those you have in your game. How is that possible? If you know process of texture (game Art) making that will be obvious but if you don\\'t it will suffice to say that this process (like any other) has various stages which serve different purposes. Brilliantly done - Original Art in game is \\\"covered\\\" in \\\"immersion\\\" grime n dirt probably out of necessity - as quite lot users / potential game buyers insist on low-key (dark) games - which they (users) find as more interesting / much more \\\"realistic\\\" (immersive). So if you want to \\\"see\\\", what you think is there you better avoid my re-texture mods - on other hand if you want to see what original Artists and I have (really) done there - go for them. ;)\r\n\r\nModels used for these weapons are among Skyrim best but their game version / their textures - being very dark and murky - make them - in my opinion - quite drab and un-appealing. As they are quite reasonably specified game weapons - especially at the beginning and as you\\'ll be, collecting quite a lot of them throughout game - they can be at least nice to look at. Unfortunately, (price-wise) they are undervalued and you won\\'t get rich collecting / selling them - as you probably should - but that is another story. ;) And finally if you are wondering, why they look (in my version) as fine and quite expensive weapons - know (if you don\\'t) - real / historical fighters / warriors were traditionally buried / entombed - usually - with their best or favourite weapons and not with their worst or broken ones and underground catacombs (like Draugr ones) indeed do preserve things in good / useable condition for quite while.  \r\n\r\nTo install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like this new look, simply delete / remove my (check for names my mod) texture files from Data/textures/weapons/draugr and nordhero - and original look will be restored to your game.\r\n\r\nBugs/conflicts: none known - but take care not to overwrite them by accident!\r\n\r\nNote on v1.1: No changes in my main Draugr weapons but as there is (in-game) one more playable version of these nice arms (with same models n textures but with different names and arms statistics) named Nord-Hero-Arms new / specially for them made files have been added - so they / their users can benefit from these re-textures as well.\r\n\r\nNote on v1.2: Important technical update which changes level of \\\"metal\\\" shine and consequently lovers \\\"gold\\\" trim prominence / its colour strength - read shines better n is less (obvious) yellow. ;) Both sets updated.\r\n\r\n  \r\nUse:\r\nFree to use but if any files included (therein) are to be used for modding ask me for permission!\r\n\r\nEnjoy and try to remember - if you like it even in a part - to give endorsement! \r\n\r\nThanks to Bethesda for really great game.\r\n\r\n",
  "categoryId": "55",
  "version": "1.2",
  "author": "Dall",
  "createdUnix": "1324193153",
  "updatedUnix": "1326834773",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "11596",
      "name": "Dalls_Draugr_Weapons",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7164",
      "fileName": "Dalls_Draugr_Weapons-3986.7z",
      "uploadedUnix": "1324193384",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d05d817a6f53d888a1645e0f03d654c67ff6ec7330827e235a9d0020c152d860/analysis/1406532550/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Draugr_Weapons-3986.7z?fid=11596&ttl=1535759407&ri=8192&rs=8192&setec=dce9a6b8dec1fd3af0c17607e905a59b"
    },
    {
      "fileId": "12737",
      "name": "Dalls_Draugr_Weapons_v11",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7435",
      "fileName": "Dalls_Draugr_Weapons_v11-3986.7z",
      "uploadedUnix": "1324506536",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3db483c392502195ed85be2784b6fd67cc51f6ca15d0976f26320c63bdb02ed7/analysis/1406544909/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Draugr_Weapons_v11-3986.7z?fid=12737&ttl=1535759408&ri=8192&rs=8192&setec=656b13bda25ecda88f7cb181d9011b47"
    },
    {
      "fileId": "20734",
      "name": "Dalls_Draugr_Weapons_v12",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7236",
      "fileName": "Dalls_Draugr_Weapons_v12-3986.7z",
      "uploadedUnix": "1326834773",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0bea8a867e704f5b6303f2b10a4948c5c3a807da56a4893113a79d81615038a4/analysis/1406619495/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Draugr_Weapons_v12-3986.7z?fid=20734&ttl=1535759408&ri=8192&rs=8192&setec=a4973a5c3b73277a32470cd7b73322ba"
    }
  ]
}