{
  "modId": 3987.0,
  "modName": "Celtic Enchanting Table",
  "summary": "This is a simple modification of the textures submitted by css0101. ",
  "descriptionHtml": "The original mod was created by css0101 and can be found at: http://www.skyrimnexus.com/downloads/file.php?id=2043\r\n\r\nThe changes I made were: \r\n\r\n1. I took off the dark lines on the top of the table. To accomplish this I had to use use overlapping wood textures. I would rather have used an independent source texture, but after trying several, the original was not only adequate, it was perfect for what I had in mind, so I just used what I had. \r\n\r\n2. I replaced the vanilla symbols with a centralized, simple Celtic knot pattern. This gave the the table the Celtic style I was looking for. \r\n\r\n3. I replaced the horn textures around the skull with an actual photo of a rams horn. I was pleasantly surprised at the effect this created. \r\n\r\nI made this for myself, but thought I would upload it just in case anyone else might want to use it as well. \r\n\r\n*********************************************************************************************************************\r\n\r\nThe easiest way to get these files to the right place is to use the Nexus Mod Manager, but if you still want to use the manual install method, you should just merge (drag and drop or cut and paste) the data folder I have provided with your data folder in your game directory. \r\n\r\nFor me it is as follows: \r\n\r\nC:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\data\r\n\r\nFinal resting place for the three files are: \r\n\r\nC:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\data\\\\textures\\\\clutter\r\n\r\nThis is where they go on my setup - I\\'m not sure what the different install directories are for other machines - so do a bit of sniffing around on Google, and you should find the info pretty quick. \r\n\r\nGood Luck!!\r\n\r\n\r\nGM\r\n ",
  "categoryId": "29",
  "version": "1.2",
  "author": "Gatormeat",
  "createdUnix": "1324193174",
  "updatedUnix": "1324193338",
  "containsAdultContent": false,
  "uploadedBy": "Gatormeat1970",
  "primaryFile": null,
  "files": [
    {
      "fileId": "11595",
      "name": "Celtic Enchanting Table",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6457",
      "fileName": "Celtic Enchanting Table-3987-1-2.zip",
      "uploadedUnix": "1324193338",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e67b954a676f933035d5ce1a103d7474c0ce1063fb421fa64a540c0e3e9e8f9c/analysis/1406532546/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celtic%20Enchanting%20Table-3987-1-2.zip?fid=11595&ttl=1535759410&ri=8192&rs=8192&setec=01b21f904e427ef1b2e9347b2fc337d6"
    }
  ]
}