{
  "modId": 39889.0,
  "modName": "Forsworn Faction and Follower",
  "summary": "This light mod combines 3 of the top 4 most requested Forsworn modifications in one simple format. Unlike other mods, this does not alter vanilla scripts or add you to the Forsworn faction automatically, meaning the player is always in control.",
  "descriptionHtml": "Originally, I supported the Empire in Skyrim. However, they\\'re puppets of the Aldmeri Dominion, so I switched to the Stormcloaks. Then, I read \\\"The Bear of Markarth\\\" and realized that Ulfric is just as bad as the Thalmor. Not only that, but I learned that according to lore, the Forsworn were fair and peaceful rulers of the Reach before Ulfric unjustly slaughtered them. I decided to side with the Forsworn, and attack both the Empire and the Stormcloaks, because despite their flaws, they\\'re the only faction that still fights for the right reasons (and also because I have a crush on Kaie). I created this mod for personal use, because the others are either incomplete or they\\'re bundled with complicated features I don\\'t want.\r\n\r\nThis mod does a few things. It\\'s simple, but it works and it\\'s an effective method of joining the Forsworn and gaining a follower.\r\n\r\n1) It makes Kaie a protected follower with limited romance options after the escape from Cidhna Mine. You can ask to join the Forsworn faction at any time by talking to her, regardless of whether or not you become her lover.\r\n\r\n2) You\\'re able to perform an optional mini-quest after the completion of the Cidhna Mine. In this mini-quest, you agree to become Kaie\\'s lover, and you sacrifice a goat to the Old Gods to seal the deal. This will set your relationship rank with Kaie, and it also adds you to the Forsworn faction automatically. The quest is also voiced with recycled vanilla lines from the correct voice actor, so you won\\'t have to deal with silent dialogue.\r\n\r\n3) It removes the 50/50 chance of Kaie\\'s headdress spawning. Before, it was part of her outfit and she was permanently stuck wearing the headdress if it spawned, which obscured some of her head and prevented her real hair from showing. Now, the player is free to give her a headdress or take it away.\r\n\r\n4) There is now an optional file containing Bethesda\\'s free HD DLC textures for Forsworn armor and weapons. It\\'s for people who either don\\'t want or can\\'t run the full HD DLC, but who still want HD Forsworn equipment, since their vanilla gear is quite blurred, even compared to other equipment in Skyrim.\r\n\r\n____________________________________________________________________________________________\r\n\r\nIt\\'s recommended that you install this AFTER completing the escape from Cidhna Mine. That\\'s easiest.\r\n\r\nIf you install it BEFORE the escape from Cidhna Mine, you will need to save and reload your game once you finish the escape. Until the first time you save and reload, the new dialogue options will not appear. That\\'s a limitation of Skyrim\\'s ability to dynamically fill quest aliases, and is not a problem with this mod.\r\n\r\nThis is my second scripted mod, and the first was a practice run. I don\\'t think you\\'ll run into problems, but it\\'s possible because of my inexperience with scripts. This was made entirely for personal use, and it works perfectly for me.",
  "categoryId": "96",
  "version": "1.2",
  "author": "Rennn",
  "createdUnix": "1375994841",
  "updatedUnix": "1376167251",
  "containsAdultContent": false,
  "uploadedBy": "Rennn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000045458",
      "name": "Forsworn Faction and Follower 1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "221",
      "fileName": "Forsworn Faction and Follower-39889-1-1.zip",
      "uploadedUnix": "1376035708",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/17eff52fd219fb6aab0707ed6fe617795ac06d89301eb9b2f2da8a773bde804f/analysis/1407675305/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forsworn%20Faction%20and%20Follower-39889-1-1.zip?fid=1000045458&ttl=1535820368&ri=8192&rs=8192&setec=f7bd1999aa70b81a1aef2794f733b243"
    },
    {
      "fileId": "1000045736",
      "name": "Forsworn Faction and Follower 1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "221",
      "fileName": "Forsworn Faction and Follower 1_2-39889-1-2.zip",
      "uploadedUnix": "1376099440",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/4f07bcc57eaa71e52eb43efee2107e7a6d0fdf92b3631e097f835d89eb2f3d37/analysis/1407676443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forsworn%20Faction%20and%20Follower%201_2-39889-1-2.zip?fid=1000045736&ttl=1535820368&ri=8192&rs=8192&setec=dcda9c42b1b80ac76e5563b2151d12be"
    },
    {
      "fileId": "1000045922",
      "name": "HD Forsworn Armor and Weapons",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "22002",
      "fileName": "HD Forsworn Armor and Weapons-39889-1-0.zip",
      "uploadedUnix": "1376167251",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b68fdd958535d07204750e77aaa14b039fbe1628cd0d4bafb01f6837360c7924/analysis/1407677535/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HD%20Forsworn%20Armor%20and%20Weapons-39889-1-0.zip?fid=1000045922&ttl=1535820369&ri=8192&rs=8192&setec=ef479548111bcdb15dd98d1a5c99b687"
    }
  ]
}