{
  "modId": 3991.0,
  "modName": "Evil Dead Army Of Darkness Mod - Weapons and Army Re-Texture",
  "summary": "Evil Dead Army Of Darkness Mod - Weapons and Army Re-textures",
  "descriptionHtml": "This is part of my Army Of Darkness mod for Skyrim based on the movie \\'Evil Dead Army Of Darkness\\' (1992). \r\n\r\nThis download will include several files of the weapons I aim to Implement into the game, and will be part of my quest line I will create when the DK is out.\r\n\r\nThe object of this mod is to create a quest line, where you be Ash, with his weapons/armour etc and you have to go to the Graveyard and retrieve the Necronomicon, but ofcourse like the movie, you will forget the words and say them incorrectly, thus raising the army of the dead. \r\n\r\nDo you have what it takes to retrieve the Necronomicon and defeat the army of the undead which is lead by your evil self?\r\n\r\nThe Mod is still a WIP but I thought I would upload it now for users to have a look of what I\\'ve currently down and to gain some feedback.\r\n\r\nThis mod will feature several things including:\r\nNecronomicon Pages (Craftable) - There will be 4 of these pages in total, each performing their own ability and to be used as a useable scroll. Effects include; Soul trap, frenzy, Raise Undead, Bound weapon, reanimate corpse, etc. (Exact effects of pages are yet to be determined.)\r\n\r\nNecronomicon Ex Mortis - The book of the dead (Craftable) - This book will be crafted using 4x Necronomicon pages, it will be a useable scroll that will do such things as; Soul Capture, Frenzy, Raise Undead, create a healing spell ward, etc. (Exactly what it will do yet is not decided as I don\\'t want to make it overpowered) The reason for combining the pages into a book is that the book will give the same effect as the 4x pages + more.\r\n\r\nAsh\\'s Gauntlets - (Increase hand-to-hand damage and increases carrying capacity)\r\n\r\nExplosive Arrows (Craftable using charcoal, sulfur and satpeter which will be implemented to the game) The arrows are pretty straight forward, Add gunpowder to existing arrow, fire and watch things go boom.\r\n\r\nImperial Army textured to mimic the castle guards from the movie. Gold + Blue themed with Griffin Insignia.\r\n\r\nHenry The Red\\'s Rebel Army textured to mimic Henry The Red\\'s men from the movie. Red themed with yellow cross\r\n\r\nIf anyone has any feedback, ideas or (constructive) criticism please be my guest.\r\n\r\n\r\n                                     -= WILL ADD MORE FILES WHEN THEY ARE COMPLETED =-\r\n\r\nVersion: 0.2 Necronomicon, Ash\\'s Gauntlets, Imperial + Stormcloak Army Re-Texture, Bloody Hand Scroll\r\n\r\nBugs: The symbol for the spell tomes are still showing when viewed in menu, working on a fix for this.\r\n\r\nNote: I am very poor at photoshop so the textures may not be the greatest but I am working on improving that.\r\n\r\n-= There are images on my blog which are not yet shown here check there to                                                                                                   see the latest textures! =-\r\n\r\nCurrent textures displayed on blog but not yet here are:\r\nGunpowder Craft Table\r\n\r\nFollow my blog  [url=http://www.mgc-home.com/entry.php?27-Evil-Dead-Army-Of-Darkness-Skyrim-Mod]here[/url]\r\n\r\nI will add screens/videos of the upcoming parts of the mod there first, so that all the WIP screens will be there and the finished product can be here, so If you want to keep an eye on this mod or see what Im currently working on and to get a sneak peak of whats coming up, please check out there.\r\n",
  "categoryId": "27",
  "version": "0.2",
  "author": "Japer Maginn",
  "createdUnix": "1324201468",
  "updatedUnix": "1325137485",
  "containsAdultContent": false,
  "uploadedBy": "Japer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "14732",
      "name": "Army Of Darkness Mod 0_2",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4741",
      "fileName": "Army Of Darkness Mod 0_2-3991-0-2.zip",
      "uploadedUnix": "1325137485",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/3c5dd6d27e705c695744732fb10644ea65a40ec01a94b7ed649a2df68e4b5e73/analysis/1406566972/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Army%20Of%20Darkness%20Mod%200_2-3991-0-2.zip?fid=14732&ttl=1535759419&ri=8192&rs=8192&setec=f2e6ce536c78d90bada292776a609aaf"
    }
  ]
}