{
  "modId": 39914.0,
  "modName": "Assassinate all of Skyrim",
  "summary": "Features:\r\nHire a hitman to kill NPC\\'s you hate!\r\nA fun bounty hunting quest in which you assassinate those pesky \\\"Essentials\\\"! \r\nMakes everyone killable!\r\n",
  "descriptionHtml": "[color=orange]IMPORTANT: Please download the latest file as the old one would not start the quest due to an alias bug.[/color]\r\n\r\nChangelog:\r\nv1b - added SEQ. Forgot to include it the first time around.\r\nv1a - [color=red]Fixed the quest not starting.[/color] Made more NPC nonessential. You should be able to kill much more of them (I\\'m closing to making everyone killable).\r\n\r\n\r\n[color=yellow]\r\nDo you...\r\n...hate that the Dark Brotherhood quest did not allow you kill more important targets?\r\n...hate that you never get to really feel powerful when 1 in 3 NPC\\'s you try to kill are \\\"essential\\\"?\r\n...hate that you bored to hell of skyrim and there is nothing left to do?\r\n...want to feel like Arya in GoT and hire a Faceless Man to kill your enemies for you?\r\n...want to slaughter everyone as final \\\"challenge\\\"/level for Skyrim?\r\n...want to get disgustingly rich by performing dirty jobs?\r\n...want to Roleplay as Jarl but need to get rid of the current occupants?\r\nWell if you said yes to any of the above, and even if you said no, this mod is for you!\r\n[/color]\r\n\r\nLet\\'s face it guys, Skyrim is nearing it\\'s end. Why don\\'t we go out with a bang? And how do we do that? Why don\\'t we ASSASSINATE ALL OF SKYRIM! This is what this mod is all about! \r\n\r\nThis roleplaying mod gives you the opportunity to assassinate the most powerful and respected people in Skyrim. Why? Just because I hate their smug faces and I hate being powerless to do anything about it due to their \\\"essential\\\" status. This mod strips them of their essential status and provides an unmarked quest that allows you to collect bounty for killing these \\\"essentials\\\". \r\n\r\nQ: But but but what about my MAIN QUEST and SUB QUESTS? Won\\'t they get ruined?\r\nA: Who the hell cares about those anymore! We\\'ve all done those a couple of times already. Now it\\'s time for something new before we get tired of skyrim!\r\n\r\nThis obviously ruins the main quest and sub quests, so disregard those already! Play the game as if it were an assassination game.\r\n\r\n[color= #FDD017]\r\nSO HOW DOES THIS WORK?[/color]\r\n\r\nMost of the mod functionality is tied to a brand spanking new NPC named \\\"Faceless One\\\" (an ode to GoT\\'s Faceless Man). You can find him in The Warrens area of Markath. Talk to him to begin the quest.\r\n\r\n[color= #FDD017]\r\nFEATURES![/color]\r\n\r\nAssassinate over 14 important essential characters in the world of Skyrim! Simply talk to the Faceless One NPC to begin the unmarked quest and then start killing. Once you have killed a target loot their body for their Skulls which will be proof of the kill.\r\n\r\nLeaders:\r\n- Elisif, the Imperial Puppet\r\n- Ulfric, the Rebel King\r\n- Kodlak Whitemane, the Werewolf\r\n- Mercer Frey, the Theif\r\n- Savos Aren, the Archmage\r\n- Astrid, the False Harbringer\r\n- Arngeir, the Senile\r\nEach Leader kill nets 5000 gold!\r\n\r\nJarls:\r\n- Skald, of Dawnstar\r\n- Siddgeir, of Falkreath\r\n- Igmund, of Markath\r\n- Idgrod, of Morthal\r\n- Laila Law-Giver, of Riften\r\n- Korir, of Winterhold\r\n- Jarl Balgruuf, of Whiterun\r\nEach Jarl kill nets 3000 gold!\r\n\r\nKill all the children in Skyrim! Why? Because they used to be essential too and don\\'t you just hate that?\r\nEach Child killed nets 500 gold!\r\n\r\nThe tables have turned! Don\\'t you hate being in a guild of assassins only to do all the legwork yourself? Not only can you perform the assassinations yourself, you can also order a hit on -ANY- unique NPC you wish! The Faceless One will then arrange for that target\\'s death! This is where Assassinate All of Skyrim comes from, the ability to order an assassination on anyone you wish! Heck you can even order a hit on the quest bounties and pick up the bounty yourself! \r\n\r\nHow does it work? Simple. Walk up to target you hate and talk to them. Select \\\"Mark for Death\\\" and an attempt will be made to mark them. A prompt will tell you if a target has been successfully marked. However, be warned! The marking is not as accurate as can be! You may accidentally mark the wrong target when the place is crowded. So make sure you and your target is alone so they can be marked properly. Go back to the Faceless One NPC and pay 1500 gold for the contract price. As simple as that and your target is dead. Perfect for roleplaying opportunities!\r\n\r\n[color= #FDD017]\r\nTHE FUTURE![/color]\r\nIf enough interest arises, I plan to expand the contracts to include Nobles and Military Captains in Skyrim. I also plan to give RPG-like bonuses for each kill. For example, gaining a +1 permanent bonus to hp regen for every child bounty killed. I plan to also make sure that everyone is killable the manual way, I did not do that for this mod (only those included in the quest and their cohorts, I\\'ve modded to be killable).\r\n\r\nSo you\\'ve emptied out the Jarl houses and there is no one to sit in the throne... Well, why can\\'t you? Heck why can\\'t you straight up kill Ulfric and claim the throne same way he did to the last king? This is an idea I\\'ve toying about for awhile and something I might pursue as the future of this mod. I also plan to be able to do something with all that money that you earn. \r\n\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "35",
  "version": "v1b",
  "author": "Solarcow",
  "createdUnix": "1375980267",
  "updatedUnix": "1376035648",
  "containsAdultContent": false,
  "uploadedBy": "aysigago",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000045244",
      "name": "AssassinateAllofSkyrim_v1",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "138",
      "fileName": "AssassinateAllofSkyrim_v1-39914-v1-0.zip",
      "uploadedUnix": "1375980124",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0ea133693537a657182c643b4b1153658ed5c8517aaf6f47afea950c68f66dfe/analysis/1407674345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AssassinateAllofSkyrim_v1-39914-v1-0.zip?fid=1000045244&ttl=1535820388&ri=8192&rs=8192&setec=bd6ce661c0c9967f489cba63639d7546"
    },
    {
      "fileId": "1000045451",
      "name": "AssassinateAllofSkyrim_v1a",
      "version": "v1a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "212",
      "fileName": "AssassinateAllofSkyrim_v1a-39914-v1a.zip",
      "uploadedUnix": "1376033293",
      "modVersion": "v1a",
      "virusScanUrl": "https://www.virustotal.com/file/b166f3201eb1e59fa021be88386ed2556755d94c702b6527a05e5b3d0307c4bb/analysis/1407675303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AssassinateAllofSkyrim_v1a-39914-v1a.zip?fid=1000045451&ttl=1535820388&ri=8192&rs=8192&setec=7da1a0b67a6181302cb433caf615c59a"
    },
    {
      "fileId": "1000045455",
      "name": "AssassinateAllofSkyrim_v1b",
      "version": "v1b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "213",
      "fileName": "AssassinateAllofSkyrim_v1b-39914-v1b.zip",
      "uploadedUnix": "1376035648",
      "modVersion": "v1b",
      "virusScanUrl": "https://www.virustotal.com/file/0ce11a77d2043f57e49aee1270f559bc59f42d8bd13ee4e0eaf96c971f7ed584/analysis/1407675304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AssassinateAllofSkyrim_v1b-39914-v1b.zip?fid=1000045455&ttl=1535820389&ri=8192&rs=8192&setec=c6a0d75d68dda2b9234cac7341b971f1"
    }
  ]
}