{
  "modId": 39919.0,
  "modName": "Boromir Companion",
  "summary": "This is the exact same mod as the one on the Steam Workshop, I wanted to put it in both locations to allow for more people to see the mod and hopefully enjoy it.",
  "descriptionHtml": "Welcome folks, to my first mod with Skyrim\\'s Creation Kit. Obviously by the title you can tell what kind of mod this is and of course, what it probably does. If you guessed anything other than Sean Bean\\'s character \\\"Boromir\\\" from Lord of the Rings, then I pity you. Otherwise you\\'re in the right place! Also please be aware that this is a STANDALONE mod, basically that means that this mod does not require anything other than Skyrim.esm and obviously and custom textures/meshes/sounds and whatnot that might be added at later dates, so please enjoy knowing that this mod won\\'t do horrible, horrible things to your already heavily modded Skyrim (hopefully). \r\n\r\nFirst and foremost I want to be clear, this is a WIP mod, for those of you that are unfamiliar with the terminology WIP stands for Work In Progress. That means that there will be changes, bug fixes, idiocy-causing bugs, more bug fixes, and well, everything that can go wrong might go wrong but hey! We\\'re only at version 0.1a! That\\'s pretty early in the development cycle, actually it\\'s the first part of that cycle so please bare with me and if you have some feedback to the current state or any changes that might happen, I\\'m all ears! Lets be clear, the comment section is really just that, a section of this page where people come to type down their thoughts and issues, where they might make me aware of an issue or say \\\"hey, loving it so far!\\\". But please, let\\'s keep the hate down to a minimum, if there\\'s an issue I\\'ll be glad to help you out, but if you\\'re comment goes something like this:\\\"HEY @#%#@% YOUR !$@!$ MOD SUCKS DONKEY !$!#$!! FIX MY ISSUE\\\", I\\'m probably not going to respond. So lets try and keep it a little civilized, sounds good? \r\n\r\nLast but not least the disclaimer! I do not claim to have invented the character Boromir or any and all references to J.R.R Tolkien\\'s LoTR. The only creative claim I have to this character rests purely in Skyrim and in the quests and NPC\\'s created for the sole purpose of this mod.\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nNow here\\'s where we stand: \r\n\r\n1) To start the quest for Boromir, visit the NPC Vergo the Farmhand in Riverwood\r\n\r\n2) Boromir currently has two quests related to him, the starting quest which points the player towards Boromir, and the second quest, which is Boromir\\'s main quest. That is currently a WIP.\r\n\r\n3) Boromir now has over 70 lines of unique dialogue, roughly 5-10 of those lines are currently quest-only lines however, the other 60 or so are purely topic lines. Boromir will have things to say about topics such as Dragons, Jarls/Civil War (WIP), Factions (right now only DB and Comp.), and more. \r\n\r\n4) More content is coming soon in version 1.0, please keep me informed of any bugs or issues that you stumble across. \r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nAlso folks, as of today 8/8/13 I am hosting two competitions on the Steam Workshop version of this mod. They are purely for fun but both have their own rules and rewards, so please visit if you\\'ve time to spare ^^. Here\\'s the link: http://steamcommunity.com/sharedfiles/filedetails/?id=160859973\r\n",
  "categoryId": "96",
  "version": "0.1c",
  "author": "Silicoln",
  "createdUnix": "1375986499",
  "updatedUnix": "1375985949",
  "containsAdultContent": false,
  "uploadedBy": "Silicoln",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000045270",
      "name": "Boromir Companion 0-1c",
      "version": "0.1c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "483",
      "fileName": "Boromir Companion 0-1c-39919-0-1c.7z",
      "uploadedUnix": "1375985949",
      "modVersion": "0.1c",
      "virusScanUrl": "https://www.virustotal.com/file/441799a2b7754f6f4a381ba1290de56258f7276ffe597cf82fa8e07e19cb33b3/analysis/1407674483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Boromir%20Companion%200-1c-39919-0-1c.7z?fid=1000045270&ttl=1535820396&ri=8192&rs=8192&setec=e0f8b1668611fe79c29b82db94dc94c7"
    }
  ]
}