{
  "modId": 39945.0,
  "modName": "Skyrim Unbound - Alternate Starts With No Main Quest",
  "summary": "Alternate starting points, no forced main questline, the ability to toggle dragons, soul absorption, word walls, and starting spells.",
  "descriptionHtml": "[center]MODS BY INTARWEBZ\r\n[url=http://skyrim.nexusmods.com/mods/39945/?]SKYRIM UNBOUND[/url] • [url=http://skyrim.nexusmods.com/mods/40215/?]PLAYER KNOCKOUT[/url][/center]\r\n\r\n[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/sSbds.png[/img][/url]\r\nFUCK YEAH, BECAUSE WHEN I SEE \\\"FEATURED ON G.E.M.S.\\\", I DOWNLOAD WITHOUT EVEN READING ANYTHING ELSE.\r\n[/center]\r\n\r\n[color=#83dcd9]I am currently seeking mod authors or aspiring mod authors for collaboration on improving and adding starting paths and locations. Message me if interested.[/color]\r\n\r\nWelcome to Skyrim Unbound, where you the player are given the ability to choose your own destiny or leave it to chance. Looking to skip that ridiculously long intro sequence at Helgen? Good. Don\\'t want to be the Dragonborn every time you play? Not a problem. Rather not have to deal with dragons at all? We\\'ve got you covered. Feel like turning them back on halfway through your game and being a soul-sucking Dovakhiin after all? Easily done. The best part? It\\'s all in the name: you aren\\'t bound to the main quest. That\\'s right, Skyrim is yours, free to explore as you please with zero obligations to save it from a horrible, impending doom.\r\n\r\n[center]\r\n[youtube]j6hwien3fE0[/youtube]\r\n\r\nSomething I made is being talked about by a man with an indistinguishable U.K. accent. I can now die happy.[/center]\r\n\r\n[heading][color=#83dcd9]I CAN HAZ SYSTEM REQUIREMENTS[/color][/heading]\r\nYou\\'re going to need [url=http://skyrim.nexusmods.com/mods/3863/?]SkyUI[/url] or, at the very least, a standalone [url=http://skyrim.nexusmods.com/news/280//?]Mod Configuration Menu[/url]. Really, though, if you aren\\'t already using SkyUI, you\\'re doing it wrong, because you should be. Withouth the MCM, you won\\'t be able to start your adventure in Skyrim Unbound, and you\\'ll find that staring into the woods for hours will either bore you to death or produce hallucinations which may or may not be more fun than the game itself.\r\n\r\nLOAD ORDER: Just use [url=http://skyrim.nexusmods.com/mods/6/?]BOSS[/url] and make a custom rule that sorts this at the bottom of the Alternate Start mods section until the authors catch onto how fantastic it is and do it themselves. It should be pretty far down your list. I can\\'t stress this enough. Again, if you\\'re not using BOSS to sort your mods, you\\'re doing it wrong and even though I admire your zeal, you may as well slit your wrists right now. Trust me, I\\'ve been there, I tried to sort my own mods with \\\"logical thinking\\\" for at least a year before I realized I was caught in a cycle of masturbatory self-defeat. Do yourself a favor and don\\'t try to be smarter than people who make it their business to know what order the mods should be loaded in. There\\'s a reason it\\'s only #6 on the Nexus.\r\n\r\n[heading][color=#83dcd9]BEGINNING A NEW GAME, OR: HOW I LEARNED TO STOP WORRYING AND LOVE THE MOD[/color][/heading]\r\nAs previously stated, you will need access to the MCM in order to begin your adventure. Skyrim Unbound doesn\\'t [url=http://www.youtube.com/watch?v=P6vjLoLtmig&t=0m27s]jump right into character creation[/url] like most other alternate starts -- it gives you time to set up all of your other stuff so you can create a save point before you get started. I don\\'t know about you, but I sure as heck get tired of configuring two hundred and fifty four other mods every time I start a new game. After the Skyrim Unbound quest begins, you will have access to the MCM as well as your character inventory and magic menu, so you can access the settings for mods authored by people who still do things the old-fashioned (read: annoying) way.\r\n\r\nMost of the options should be self-explanatory, but just in case, let\\'s go over them.\r\n\r\n[color=#83dcd9]Path:[/color] This is where you pick how you\\'d like your game to begin, what kind of character you think you might want to play. Leaving it at \\\"Undecided\\\" will let the game pick one for you at random. Most starts have additional randomly chosen variants of their own, which you aren\\'t allowed to pick because you simply can\\'t be trusted with that kind of decision.\r\n\r\n[i]None of the paths should have any permanent effect on your game and you can choose to completely ignore the quest info/character backstory if you like. I only wrote them for role-playing purposes because I didn\\'t want the alternate starts to be completely generic. You don\\'t want to play as a thief but you selected the random start and got \\\"Villain\\\"? Fuck it, you had a change of heart at the bar. Exit the Ragged Flagon and go help some old ladies cross the street.[/i]\r\n\r\n[color=#83dcd9]Start Your Adventure:[/color] This should be your absolute final stop. This is what triggers the character creation menu and teleports you to wherever it is you chose to go.\r\n\r\n[color=#83dcd9]Create Your Character:[/color] For those of you who want to know what your character is going to look like (race, sex, nose-size) before you pick a path, this option will let you enter the character creation menu first. You can use it as many times as you like.\r\n\r\n[color=#83dcd9]Starting Spells:[/color] This will toggle the three racial spells that Bethesda bothered to put into the game (racists) as well as the universally hated healing and flame spells that apparently everyone in Skyrim starts out life with. (If you use any mods that alter the player form, they will be incompatible because of this feature. I\\'ve only ever seen one that does it, and it\\'s the one that [url=http://www.skyrim.nexusmods.com/mods/13994/]removes the starting spells[/url].)\r\n\r\nSUPER FUNTIME BONUS FEATURE: If you use mods like [url=http://skyrim.nexusmods.com/mods/29624//?]RaceMenu[/url] which have the lovely feature of auto-filling your character name for those of us too lazy to reach for the keyboard, you\\'ll notice that you are no longer \\\"Prisoner\\\", but \\\"Adventurer\\\"! Because being a prisoner is completely fucking depressing. You\\'re welcome.\r\n\r\n[heading][color=#83dcd9]OMG I NEED TO KNOW WHAT EVERY START IS BEFORE I DOWNLOAD[/color][/heading]\r\n[i]Starts marked with an *asterisktskstksk have additional random starting points.[/i]\r\n\r\n*[color=#83dcd9]Vagrant:[/color] You are poor. You have no money and no good clothes. You wear rags and you smell like shit. How you could possibly ever be the Dragonborn is beyond my comprehension. You are dirt. You are scum. Fuck you.\r\n\r\n*[color=#83dcd9]Lawbreaker:[/color] Get ready to land in a jail cell. Sure, you can sleep through your sentence, but what fun is that compared to breaking out and getting killed on the spot by local guards?\r\n\r\n*[color=#83dcd9]Recruit:[/color] You sympathize with the Imperials and have been hanging out at a camp. Your favorite color is red.\r\n\r\n*[color=#83dcd9]Rebel:[/color] You sympathize with the Stormcloaks and have been hanging out at one of their camps. Your favorite color is blue.\r\n\r\n*[color=#83dcd9]Voyager:[/color] You\\'re a newbie in Skyrim and have just arrived at some city by boat. Your next step is to fuck some people over by being a total capitalist. Too bad you don\\'t get any more starting gold than the other starts. Work a corner or something. Titty sprinkles.\r\n\r\n*[color=#83dcd9]Traveler:[/color] You\\'re moving from place to place and something went wrong. You wound up at an inn. Do yourself a favor and kill a bard or [url=http://skyrim.nexusmods.com/mods/29968/?]download a mod that stops him from singing so fucking much[/url].\r\n\r\n*[color=#83dcd9]Explorer:[/color] You hunt and kill living things that are more stupid than you for food and profit. Unfortunately, you\\'ve run out of things to eat and you\\'ve gotten yourself lost in the wilderness. Find a campfire and regroup.\r\n\r\n[color=#83dcd9]Mercenary:[/color] You\\'ve come to join the companions. Spoiler alert: they\\'re assholes.\r\n\r\n[color=#83dcd9]Minstrel:[/color] You\\'re an aspiring bard. I guess that\\'s about it. Good pluck.\r\n\r\n[color=#83dcd9]Villain:[/color] Hanging out in the lowest parts of Riften, you find yourself in a place that was never meant for your face. Go back into town and lift a couple of potatoes and maybe you\\'ll impress this group of pocket-pickers.\r\n\r\nI know some of these starts might sound kind of lame because I\\'m being an dick about describing them, but if you know how to work the Creation Kit and you can recommend a few good teleport spots and a backstory that makes sense for them, I\\'m open to suggestions for a future release. Concordantly, if you want to take this mod and make your own in-depth start for a particular type of character by using it as a base, feel the fuck free. You don\\'t need my permission, just do it. I might even take your work and integrate it into this one with your blessing if I like it.\r\n\r\n[heading][color=#83dcd9]JUST IN CASE YOU GET TIRED OF NOT CONSTANTLY FIGHTING DRAGONS[/color][/heading]\r\nBy default, dragons are turned off. Disabled, nonexistant, nowhere to be found. (Unless, of course, you\\'re using another mod that spawns them, which this one won\\'t stop.) If you want them back in the game, it\\'s really very simple: check the box marked \\\"Scripted Dragon Encounters\\\", and they\\'ll magically appear at word walls, dragon graves, etc. Random dragon spawns can be enabled at any time as well, but they require that the scripted encounters be enabled. Sorry, folks, I can\\'t stop it, I don\\'t know how it works.\r\n\r\n[heading][color=#83dcd9]I\\'LL (NOT) SWALLOW YOUR SOUL[/color][/heading]\r\nAgain, by default, soul-stealing from dead dragons is also turned off since if you\\'re using an alternate start mod, you probably don\\'t want to play as the Dragonborn every single time. Slaying one of the beasts will drop a dead body that you can loot and walk away from, proud of your accomplishment as a mundane Dirk the Daring. Turning on soul absorption is required to unlock the main quest.\r\n\r\n[heading][color=#83dcd9]FINE, HAVE YOUR DAMN MAIN QUEST ANYWAY[/color][/heading]\r\nKilling a dragon and absorbing its delicious soul will unlock High Hrothgar but will [i]still[/i] not force the player into a questline with The Way of the Voice. (If you haven\\'t learned the word \\\"Fus\\\" by visiting the word wall in Bleak Falls Barrow, it will be automatically taught to you and unlocked the first time you steal a dragon soul.) Willfully entering the monastery on your own accord and hanging out with the monks to learn about old man things like shouting and being on your knees all day will finally open up the Dragonborn\\'s questline with The Horn of Jurgen Windcaller, complete with objectives and everything. (Note: starting the main quest will permanently enable scripted dragons, soul absorption, and word walls. It also activates and de-activates random dragon spawns at various points on its own accord. I suggest you don\\'t screw with it much once you\\'ve started it.)\r\n\r\n[heading][color=#83dcd9]I\\'M NOT YOUR MONKEY, JARL LUMBERGH[/color][/heading]\r\nThe quests Unbound, Before the Storm, Bleak Falls Barrow, and Dragon Rising have all been bypassed (The Golden Claw is still available), allowing the player to do as he pleases in Whiterun without Balgruuf making him do a billion errands, the not least of which is murdering a giant flying lizard. \\\"You say an enormous ancient magical creature has risen from the dead, leveled a castle, ate a garrison of the emperor\\'s best men and is heading this way? Yeah, if you could just go out and take care of that for me, that\\'d be great, thanks. Also, I\\'m going to need you to come in on Sunday.\\\"\r\n\r\n[heading][color=#83dcd9]BEING A HOMEOWNER IS AS EASY AS SHOUTING AT GOATS[/color][/heading]\r\nBreezehome can be purchased from Proventius in Dragonsreach right from the beginning of your game. After purchasing the home, you become Thane of Whiterun and receive Lydia as your housecarl. Your extremely [i]personal[/i] housecarl. (Yes, I realize it\\'s a bit early in the game to get such a reward for not having to work for it, but let\\'s just say that Balgruff is a nice guy who appreciates smart real-estate investments in his hold. Plus, the price of Breezehome has been doubled in cost. Does that make you feel like you earned it?)\r\n\r\n[heading][color=#83dcd9]IT\\'S COOL HOW YOU REMEMBER ME FROM THE OPENING WE JUST SKIPPED[/color][/heading]\r\nGuards won\\'t run around talking about the Dragonborn until you get in good with the Greybeards and Helgen-centric dialogue which no longer makes sense has been removed from recruiting interactions with the Imperials and the Stormcloaks. The civil war quests can now be started immediately without having to act as Balgruuf\\'s personal exterminator before ruthlessly taking over his entire city and laying waste to his people.\r\n\r\n[heading][color=#83dcd9]YOU DIDN\\'T GET CAUGHT CROSSING THE BORDER, OKAY?[/color][/heading]\r\nI didn\\'t include a vanilla starting option because I had to take a butcher knife to the first five quests in order to make everybody in the province pretend you\\'re not a guy who steals the souls of dragons. I\\'m pretty sure it would have buggered a vanilla start game, and if you wanted to play a vanilla start game, you shouldn\\'t be installing this mod in the first place. Just kidding, you\\'re awesome and that\\'s a perfectly reasonable request. Get smoked.\r\n\r\n[heading][color=#83dcd9]COMPERTABERLITY[/color][/heading]\r\nMost (if not all) of the popular mods don\\'t mess with anything that would cause problems: the first five quests and the scripts that drive them, word wall scripts and the dragon death script, guard dialogue and the civil war recruiting dialogue. It\\'s fully compatible with Deadly Dragons, Mighty Dragons, Dragon Combat Overhaul, Civil War Overhaul, Helgen Reborn, and Timing is Everything.\r\n\r\nTIMING IS EVERYTHING: Set the Dragonborn quest to wait until at least after The Horn of Jurgen Windcaller. Otherwise you\\'ll get cultists coming after you from the get-go.\r\n\r\nThis mod is not compatible with other alternate start mods, because that would be stupid.\r\n\r\n[heading][color=#83dcd9]WHAT THE HELL IS UP WITH THE FILE VERSIONS[/color][/heading]\r\nYou\\'ll notice that the main mod keeps being bumped up from 1.0 to 1.01 to 1.02 and so forth while the DLC patches will rarely (if ever) get updates. This is because the file versions are unique to each file and only represent changes made to that particular file. The latest versions of the DLC patches will always be compatible with the latest version of the main mod and the file versions do not need to match up. \r\n\r\nThe whole reason I have three different .esp files in the first place is so I don\\'t have to update three files every time I need to make changes to the base mod. It sucks for you, but trust me, I know what it\\'s like to want to save on precious space in the mod list, I am quite literally at 253 as I type this and two of those are my own DLC patches. It\\'s time to ask yourself if you really [i]need[/i] those twelve different cooking mods.\r\n\r\n[heading][color=#83dcd9]JUST DOWNLOAD IT ALREADY[/color][/heading]\r\nThere are some great alternate start mods out there, but I wanted to reinforce that idea that the player can be whoever they want in this vast and beautiful world of doing mostly odd jobs for peasants. Having to investigate Helgen no matter who you choose to play always struck me as silly; now you can finally live that dream of being some random schmuck, camping out in the woods, scalping bears, picking flowers, and salting meats without the nagging urge to accompany some old man to Alderaan and learn the ways of the Force to become a Jedi like your father before you!\r\n\r\nSorry, wrong story. Whatever.",
  "categoryId": "24",
  "version": "1.02",
  "author": "Intarwebz",
  "createdUnix": "1376003714",
  "updatedUnix": "1376180122",
  "containsAdultContent": false,
  "uploadedBy": "IntarwebzDotNet",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000045380",
      "name": "Skyrim Unbound - Dawnguard Patch",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "9",
      "fileName": "Skyrim Unbound - Dawnguard Patch-39945-1-0.zip",
      "uploadedUnix": "1376003680",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cad9e6640a8f17eca778676042c7875b3aa906c598c25e3ebb8374fbb6e32aa3/analysis/1407674875/",
      "changelogHtml": " Initial release. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Unbound%20-%20Dawnguard%20Patch-39945-1-0.zip?fid=1000045380&ttl=1535820426&ri=8192&rs=8192&setec=da4d8da03cc265f8348236fd033451b1"
    },
    {
      "fileId": "1000045382",
      "name": "Skyrim Unbound - Dragonborn Patch",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "18",
      "fileName": "Skyrim Unbound - Dragonborn Patch-39945-1-0.zip",
      "uploadedUnix": "1376003700",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/941970d7bfc241f990630263f022d7df44966307f2639131d53fdda4d67ea981/analysis/1407674876/",
      "changelogHtml": " Initial release. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Unbound%20-%20Dragonborn%20Patch-39945-1-0.zip?fid=1000045382&ttl=1535820427&ri=8192&rs=8192&setec=3ed9be96690afb28e62f914c94cf632b"
    },
    {
      "fileId": "1000045955",
      "name": "Skyrim Unbound 1-02",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "178",
      "fileName": "Skyrim Unbound 1-02-39945-1-02.zip",
      "uploadedUnix": "1376180122",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/256d9ce62c4ab5a916bae1966a28b0bf446ea9bb1cf548785d4def5a1d37c255/analysis/1407677681/",
      "changelogHtml": " Dialogue fix for Whiterun gate guard. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Unbound%201-02-39945-1-02.zip?fid=1000045955&ttl=1535820427&ri=8192&rs=8192&setec=2682908786908ebbf45478f9a355a697"
    }
  ]
}