{
  "modId": 39952.0,
  "modName": "Goobles- Master Smither and Merchant",
  "summary": "Goobles is a trader in Dragonsreach that sells extremely strong weapons and armor for people who don\\'t want to spend perk points on smithing. ",
  "descriptionHtml": "This is Dr. Goobles the Smithy. This is my first mod.\r\n\r\nTHE WHY: I made him to cater to people who do not want to spend perk points on smithing but still want good weapons and armor. \r\n\r\nTHE WHERE: Due to his smithing skill, the Jarl lets him wander around Dragonsreach eating and drinking anything he pleases. So, he\\'s located around the dining tables.\r\n\r\nTHE HOW: Bring your coin, and Goobles shall deal you the best armor and weapons you\\'ve ever seen. Due to varying days of interest (maybe he was having an off day) some armor pieces may be weaker or stronger than other armor pieces. \r\n\r\nMISC INFO: He sells a ripoff of Auriel\\'s Bow. Think of it as cheap and good. But no effects. Cursed Scimitar has 100 crit damage but is massively expensive. YOU GOTTA PAY TO PLAY :). He does not sell Dawnguard or Dragonborn items in order to cater to a bigger mass. His trader gold is set at 10,000 which should be more than enough to sell him any of your useless junk you might have. \r\n\r\n\r\nIf you have comments or suggestions or criticisms please feel free to post them up in the comments section ",
  "categoryId": "33",
  "version": "1.00",
  "author": "srsparky32",
  "createdUnix": "1376009507",
  "updatedUnix": "1376009502",
  "containsAdultContent": false,
  "uploadedBy": "srsparky32",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000045398",
      "name": "goobles_esp",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "goobles_esp-39952-1-00.rar",
      "uploadedUnix": "1376009502",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/903f19ff76440bb6008eeb3f5311226ed380582ef3ffec9f99aa583aa32b14ed/analysis/1407675068/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/goobles_esp-39952-1-00.rar?fid=1000045398&ttl=1535820435&ri=8192&rs=8192&setec=c7143e5a4e52e08f6b81bb137c0cbd06"
    }
  ]
}