{
  "modId": 39955.0,
  "modName": "Talkative Khajiit Spouses",
  "summary": "Gives your  khajiit spouse many random things to say at home, or as a follower when relaxing - using original khajiit voice files extracted from Skyrim bsa. \r<br />Requires MFVM=  More follower voices plus Khajiit Marriage esm. by mysticentity to marry any Khajiit with real khajiit voice.",
  "descriptionHtml": " Latest news: \r<br />\r<br />______________________________________________________________________________________\r<br />THIS IS NOW INTEGRATED IN VVE - Vanilla Voice Expansion (Formerly MFVM) by MysticEntity&#33;&#33; \r<br />here: \r<br />http://www.nexusmods.com/skyrim/mods/36913/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D36913%26preview%3D&pUp=1\r<br /> So that makes my mod obsolete, YOU DO NOT NEED THIS MOD, unless you use\r<br /> an old version of MFVM or want to download my mod  to give endorsment, sweetrolls or kudos for my original work.Thanks ;). \r<br />\r<br />Adds many new married Khajiit lines with original voice files extracted from Skyrim bsa. \r<br />Requires MFVM= &#34; More follower voices plus Khajiit Marriage&#34; esm. by mysticentity to marry any khajiit with the khajiit voice. \r<br />\r<br />DESCRIPTION\r<br />******************\r<br />When your spouse is at home or relaxing, they will have many new random things to say. \r<br />Screens have spoilers of some of the lines you`ll find :) . The mod adds 16 new lines for males and 9 for females.\r<br />Huspands have a lot more &#34;world commentary and advice-type&#34; dialogue than wives cause of lack of fitting voice files for females.\r<br />-No scripts are added.\r<br />-Does not alter the proposal/wedding ceremony quests at all, if questions regarding those go to the MFVM mods page. (link found below.) \r<br />-Compatible with all follower mods, does not alter follower or other quest/greetings dialogue, only spouse greetings with khajiit voice.\r<br />-Custom race npcs that use vanilla Khajiit voice also compatible, cause the lines only check for voice type, not race. \r<br />\r<br />If using AFT mod for followers the spouse greetings will also trigger if your spouse is a follower and\r<br />relaxing or dismissed to hang out some other place than home.  (That may work with some other follower &#34;relax&#34; mods too. Depends if the followers in the mod when told to relax revert to the same greetings they`d use at home. )\r<br />\r<br />******************************************************************************************************************************\r<br />REQUIRED files :  MFVM by mysticentity at: http://skyrim.nexusmods.com/mods/36913/?\r<br />\r<br />******************************************************************************************************************************\r<br />RECOMMENDED files: \r<br />AFT by Dheuster at: http://skyrim.nexusmods.com/mods/15524//?   -or other follower mod that lets spouses speak their married dialogue in more places than just your home.\r<br />Khajiit Speak by mjharper at:  http://skyrim.nexusmods.com/mods/14513//?  - if your character is a khajiit as well, a wonderfull player dialogue/immersion overhaulfor for khajiit players .\r<br />\r<br />CREDITS: mysticentity for the exellent MFVM mod and khajiit marriage&#33; Thankyou :)\r<br />Kharjo for his patience with testing and allowing me to briefly morph him to to a she to test female voice ;)\r<br />\r<br />\r<br />********************************************************************************************************************************************************************************************************************\r<br />&#34;FAQ&#34; with small spoilers ahead:\r<br />\r<br />-Some male lines speak of trade opportunities in Skyrim, I tought it fits well cause spouses do keep shops- using MFVM my Kharjo started a shop right after the marriage.\r<br />\r<br />-Couple of male lines are from Mai`q the Liar (= The mysterious khajiit wondering all across Tamriel with random dialogue) , so if you badly want ONLY M`aiq to ever say those things, don`t use this mod.\r<br />I only used such Maiq talks as I tought fitting for another khajiit to say too, and of course not those referring to himself as Maiq... Still I could not resist putting in the  &#34;Some say Alduin is Akatosh, some say Maiq is a liar...etc..&#34; line - but in this case it should be obvious the khajiit is speaking about Maiq the Liar whom he has met or heard of, not referring to himself. Maiq is a legend among khajiits after all ;D \r<br />\r<br /> In very tight quarters like Breezehome the spouses may become quite chatty , \r<br />but at least not as repetitive as some human spouse for instance might :)\r<br />Hope You enjoy the mod, have fun&#33;",
  "categoryId": "33",
  "version": "1.00",
  "author": "mistress miaura",
  "createdUnix": "1376017754",
  "updatedUnix": "1376016126",
  "containsAdultContent": false,
  "uploadedBy": "mistress miaura",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000045428",
      "name": "Talkative Khajiit Spouses",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "742",
      "fileName": "Talkative Khajiit Spouses-39955-1-00.zip",
      "uploadedUnix": "1376016126",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/6b3335592852a073250326746635869b5952b0adeb864dcf1e7f467ed4462b79/analysis/1407675127/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Talkative%20Khajiit%20Spouses-39955-1-00.zip?fid=1000045428&ttl=1535820438&ri=8192&rs=8192&setec=48d794981bc9b2e27c0e74d2e942017c"
    }
  ]
}