{
  "modId": 39962.0,
  "modName": "Dreamcatcher Shield",
  "summary": "An enchanted dreamcatcher style shield, with several variants geared toward mages.  One version is un-enchanted for a non-mage.",
  "descriptionHtml": "Version 1.2\r\n\r\nAfter some feedback on the dreamcatcher shield (thank you all, btw), I have decided to release an update.  Firstly I added a non-enchanted version for those players who wish to stick with \\\"the basics\\\" (as requested by StayFrosty05).  And I put more thought into the crafting recipes (based on comments by mistress miaura).\r\n\r\n*** IMPORTANT: Read/Do First! ***\r\n. Make an extra save, just to be safe (in case of CTD, you have a fall back).\r\n. The Nocturnal shield can cause \\\"wonky eyes.\\\"  There is a known bug (in general with Skyrim) with invisibility where your character\\'s eyes can become wonky/messed up after using invisibility.  If you restart the game, it should clear it.  But I want you to be aware of that in case it troubles you (in which case, just skip that shield).\r\n\r\n[6] Dreamcatcher of Nocturnal: Intended for a stealthy mage.\r\n. [basic stats] - Heavy armor; 50 point base.\r\n. [active effect] - Increase muffled movement perk; Ability to fence items at a regular (relevant) vendor.\r\n. [blocking effect] - Invisibility cloak (Nightingale version).\r\n. [power bash effect] - *None.\r\n\r\n\r\n[7] Dreamcatcher Champion: A no-nonsense shield for a champion who doesn\\'t wish to rely on extra enchantments\r\n. [basic stats] - Light armor; 30 points base.\r\n. [active effect] - *None.\r\n. [blocking effect] - *None.\r\n. [power bash effect] - *None.\r\n\r\n\r\n**************************\r\n\r\nVersion 1.1 \r\n\r\n*** Before you install, I recommend an extra save--and probably a good idea to not have the Dreamcatcher of Divines equipped (some tweaking was done to it).  This just to help prevent any potential CTD issues ***\r\n\r\nWhat\\'s new?\r\n. By popular demand--or rather the suggestion of one person--okay someone who indicated no personal interest in this particular shield (minor details!), I have added a shield based on the spellbreaker enchantment: Dreamcatcher of Azura (see below for details).  Also I added a more offense-minded shield (after spending a ridiculous amount of time in the CK \\\"trying\\\" to get various things to work--destruction magic effects were just not intended for shields, folks): Dreamcatcher of Talos.\r\n. The Talos variant comes in two versions: standard and EX.  Why?  Because the power bash effect on the EX version can be considered \\\"too cheap.\\\"  So in order to try and balance things out, the normal (non-EX) version will also knock the player to the ground (different effect, same result)--that to avoid repeatedly knocking your enemies down and nailing them with magic missiles.  Of course if you\\'re still unscrupulous to do that . . .  EX version!  See additional notes on this shield below.\r\n. Also added a few FX visuals for some of the effects to jazz it up, and to let you know something is happening that is otherwise unseen (e.g. restoration rate accelerated with the Divines shield when blocking).\r\n\r\n[3] Dreamcatcher of Azura: Intended for an enchanter type mage.\r\n. [basic stats] - Heavy armor; 50 point base.\r\n. [active effect] - Regenerate health twice as fast; regenerate magicka 50% faster.\r\n. [blocking effect] - Spellbreaker ward.\r\n. [power bash effect] - Heal self.\r\n\r\n[4] Dreamcatcher of Talos: Geared toward a battle mage type.\r\n. [basic stats] - Heavy armor; 50 point base.\r\n. [active effect] - Disease resistance 100%, fortify carry weight by 250 points\r\n. [blocking effect] - Lightning cloak.\r\n. [power bash effect] - Shield Charge; Self paralysis (*refer to comparison notes between the normal and EX version of the Talos shield).\r\n\r\n[5] Dreamcatcher of Talos EX: Geared toward a battle mage type (who isn\\'t above taking a cheap shot).\r\n. [basic stats] - Heavy armor; 50 point base.\r\n. [active effect] - Disease resistance 100%, fortify carry weight by 250 points\r\n. [blocking effect] - Lightning cloak.\r\n. [power bash effect] - Shield Charge; (*refer to comparison notes between the normal and EX version of the Talos shield).\r\n\r\n** Talos shields comparison **\r\n. The shield charge is normally an effect awarded when you unlock it as a perk (top of the tree).  I have not used it myself (in its intended way), but based on what I read it is used when you do a sprint.  Here, you do a shield bash.  What it does is knock anyone or anything in your way (except for Giants and Dragons) to the ground.  Be aware that using this in a public place (e.g. city), will result in a bounty awarded if you hit any NPCs or guards.  But if you hit your follower, he/she will just dust himself/herself off and get up without a word.\r\n. Because it can take seconds before the fallen foe gets up, I felt it was too cheap without also inhibiting the player as well.  In this regard I felt this effect should be used when you\\'re surrounded and need a little \\\"breathing space.\\\"\r\n. But as I mentioned, for those who find the self knockdown an annoyance, there is the EX.  But the EX I feel is just too powerful.  I personally don\\'t use that one.  But I just knew . . . someone would feel they wanted the \\\"full power.\\\"  EX it then, baby!\r\n\r\n**************************\r\n\r\nThis is my second attempt at a mage-based shield.  My first one was more of an exercise with custom enchantments, rather than the actual physical design.  It wasn\\'t well-conceived (from a mesh and texture standpoint), and the lack of DLs is evidence of that--not that is important to me or anything =P\r\n\r\nWith the Dreamcatcher Shield, I tried to think of a unique design that would be more akin to what a mage might actually use.  And in a first for one of my mods, I actually put thought into making it more lore-friendly--not that this wholly accomplishes that (I think perhaps the closest it comes to is the Forsworn).\r\n\r\nAs with my original Mage Shield (http://skyrim.nexusmods.com/mods/39677), I considered what a mage would sacrifice (e.g. loss of dual casting) to use a shield, and what benefit using said shield should offer..\r\n\r\nThe following variations of the Dreamcatcher will be added to the game.  Please note the appropriate power bash perk must be unlocked in the Blocking tree for the power bash effect to trigger. \r\n\r\n[1] Dreamcatcher:  Standard mage shield (few enchantments) \r\n. [basic stats] - Heavy armor; 50 point armor base (actual armor rating will vary with perks and other stats).\r\n. [active effect] - health, magicka, and stamina regenerate 50% faster.\r\n. [blocking effect] - *none\r\n. [power bash effect] - *none\r\n\r\n\r\n[2] Dreamcatcher of Divines: Intended for a priest/priestess type mage.\r\n. [basic stats] - Light armor; 25 point base.\r\n. [active effect] - Disease resistance 100%, fortify health 100, fortify magicka 100\r\n. [blocking effect] - Health, magicka, and stamina regenerate twice as fast\r\n. [power bash effect] - heals self\r\n\r\nI had intended other variations of the shield for a battle-mage type, but none of the enchantments (mostly Destruction magic based) I created, worked properly.  Basically I got the FX, but . . . nothing actually happened spell wise.  Perhaps later when I get that figured I\\'ll add another shield.\r\n\r\n~ Credits & Thanks ~\r\n. Mr Dave for his Texture Resource (http://skyrim.nexusmods.com/mods/2324) ",
  "categoryId": "54",
  "version": "1.2",
  "author": "Denki Groove",
  "createdUnix": "1376025704",
  "updatedUnix": "1376527830",
  "containsAdultContent": false,
  "uploadedBy": "denkigroove",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000045435",
      "name": "Dreamcatcher Shield",
      "version": "1.oo",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3387",
      "fileName": "Dreamcatcher Shield-39962-1-oo.zip",
      "uploadedUnix": "1376025699",
      "modVersion": "1.oo",
      "virusScanUrl": "https://www.virustotal.com/file/78b63d0ccc70cdcef711449aa60e39d8a7bafdcf9fcad0e765ab22a3c2751c31/analysis/1407675187/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dreamcatcher%20Shield-39962-1-oo.zip?fid=1000045435&ttl=1535820443&ri=8192&rs=8192&setec=0c3f901cdb6fa03ee051abd487a2b71d"
    },
    {
      "fileId": "1000045962",
      "name": "Dreamcatcher Shield 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3387",
      "fileName": "Dreamcatcher Shield 1_1-39962-1-1.zip",
      "uploadedUnix": "1376185929",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/15a583093975170822d93d196ae1696f0c331723b3ae7c880ff7c763e14ce4cd/analysis/1407677707/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dreamcatcher%20Shield%201_1-39962-1-1.zip?fid=1000045962&ttl=1535820444&ri=8192&rs=8192&setec=4ac41d5e54400730b938d53b2e262b4a"
    },
    {
      "fileId": "1000047025",
      "name": "Dreamcatcher Shield 1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3388",
      "fileName": "Dreamcatcher Shield 1_2-39962-1-2.zip",
      "uploadedUnix": "1376527830",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/29b5cdd21d6dbc0f427053fee277b728eff151d13408bce3b92b0aead905dde9/analysis/1407682457/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dreamcatcher%20Shield%201_2-39962-1-2.zip?fid=1000047025&ttl=1535820444&ri=8192&rs=8192&setec=76549283a324a34fce30d8f8ba544629"
    }
  ]
}