{
  "modId": 39977.0,
  "modName": "Project Soundscape",
  "summary": "Sound Overhaul\r<br />Come in, grab a coffee, take a seat..",
  "descriptionHtml": "In case of bad english: please excuse.. it&#39;s not my native language\r<br />\r<br />Future plans:\r<br />- beyond skyrim patch\r<br />- samples: creatures, especially the heavy ones, finish ambience and magic, add missing footsteps\r<br />- impact data for clutter\r<br />\r<br />\r<br />\r<br />\r<br />[list]\r<br />[*] All Dlcs (including Hearthfires) are fully supported.... all record changes included\r<br />[*] Fully compatible with the Unofficial Patches.\r<br />[*] The mod is completely modular, all modules work independently from each other. Either the full version can be used, or a custom combination can be created as single file with Tes5Edit in a few minutes.\r<br />[*] The MCM-scripts have no impact on performance and don&#39;t make any permanent changes to the game data.\r<br />[*] Other mods can make use of the MCM with simple patches.\r<br />[*] User friendly (not to be confused with simple)\r<br />[/list]\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Index[/b][/color][/size]\r<br /># REQUIREMENTS\r<br /># DESCRIPTION\r<br /># CONTENT\r<br />### Source File\r<br />### Modules\r<br />### Samples\r<br />### Addons\r<br /># TECHNICAL STUFF\r<br />### Issues\r<br />### Performance\r<br />### Compatibility\r<br />### Installation/Uninstallation/Updating\r<br /># PATCHES\r<br />### Recommended Mods\r<br /># ADDITIONAL INFO\r<br /># CREDITS\r<br />\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/39977-1-1381361563.png[/img]\r<br />\r<br />\r<br />[size=7][color=DarkOrange][b]Requirements[/b][/color][/size]\r<br />\r<br />[size=4][color=DarkOrange][b]Necessary[/b][/color][/size]\r<br />[size=3][u]Samples[/u]\r<br />none\r<br />\r<br />[u]Source File and MCM[/u]\r<br />[url=http://skse.silverlock.org/]Skse[/url] v1.6.16+\r<br />[url=http://skyrim.nexusmods.com/mods/3863]SkyUI[/url] v3.4+\r<br />\r<br />[u]Modules[/u]\r<br />Dawnguard Dlc\r<br />Dragonborn Dlc\r<br />*Note: all modules require the source file\r<br />*Note: mention mixer and footsteps\r<br />\r<br />[u]Addons and Patches[/u]\r<br />Depends on the file. Refer to description\r<br />[/size]\r<br />\r<br />[size=4][color=DarkOrange][b]Recommended[/b][/color][/size]\r<br />[size=3][url=http://skyrim.nexusmods.com/mods/48265]Fiss[/url] - is required for the save/load functions of the MCM to be accesible\r<br />[url=http://skyrim.nexusmods.com/mods/19]Unofficial Patches[/url] - fixes some bugs that are not adressed by Project Soundscape\r<br />[url=http://skyrim.nexusmods.com/mods/25859]Tes5Edit[/url] - required for merging the esps and in general very useful for finding conflicts in the load order\r<br />[url=http://skyrim.nexusmods.com/mods/37981]Merge Plugins TES5Edit Script[/url] - allows to merge the many esps of Project Soundscape in no time\r<br />[url=http://skyrim.nexusmods.com/mods/1840]Wrye Bash[/url] - &#34;explain why wrye bash is superior&#34;????\r<br />[/size]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center][size=7][color=DarkOrange][b][u]Description[/u][/b][/color][/size][/center]\r<br />\r<br />This is project that aims to overhaul all of skyrims sound.\r<br />It&#39;s main features are fixing all issues that bethesda left in, offering more options to configure the game sound, rebalancing/remixing all sounds, altering sound implementation, adding new sounds and variations, make me coffee....\r<br />I just wanted to create my own interpretation on how this game should sound. How to describe this? No idea.. I could tell you now that this mod makes the game sound more realistic, immersive, how advanced it is  ...but screw that. Instead i give you a long and boring list of features.\r<br />\r<br />\r<br />[size=4][color=Red][b]This mod is currently in beta[/b][/color][/size]\r<br />This project got way bigger than i imagined when i started it. I have tons of plans, ideas, things to tweak, to balance, implement, and i announced this mod month ago thinking i could finish it in time. But i didn&#39;t. Also i haven&#39;t much time left for modding right now. So, before further delaying this release until everything is done, which will take several more month for sure, i&#39;ll do it now as beta.\r<br />But this is not about stability. The mod has been developed and tested for more than eight month, and everything implemented so far is working. (Except, well, every mod has some bugs, i guess..)\r<br />For further information see the Beta Info at the end of the modules description.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center][size=7][color=DarkOrange][b][u]Content[/u][/b][/color][/size][/center]\r<br />\r<br />[size=6][color=DarkOrange][b][u]Source File[/u][/b][/color][/size]\r<br />[size=3][b]Soundscape_Source.esm[/b][/size] - This files purpose is to load all content required by the different modules and ensure communication between them. It will start the basic MCM, load new sound-records, the main bsa with samples and scripts and the ini file required for some of the MCM&#39;s options.\r<br />[u]It will not change any content by itself and does not require any Dlcs&#33;[/u]\r<br />\r<br />[size=3][b][u]MCM[/u][/b][/size]\r<br />The mod has it&#39;s own Menu to configure the game-sound that is replacing the vanilla one. (see screenshots)\r<br />The vanilla audio menu is unable to save the settings for more than 8 sliders. With the MCM as many sliders as needed can be saved and porting all vanilla slider into it offers room for other mods to use the previously occupied slots (like [url=http://skyrim.nexusmods.com/mods/36312]this one[/url]).\r<br />\r<br />[list]\r<br />[*] Vanilla and new sliders for volume and pitch. Sliders can be set in 1% steps instead of the 5% in the vanilla Audio-Menu.\r<br />[*] Buttons for muting some selected sounds.\r<br />[*] AMAZING INI SETTINGS\r<br />[*] The script will check for installed modules. The sliders and buttons will be accesible depending on the installed modules.\r<br />[*] Possibility to save and reload custom slider settings. If you want to try a different mix and it doesn&#39;t work out, just reload your previous settings.\r<br />[/list]\r<br />*NOTE: Pitch sliders seem a bit useless, because strong changes will ruin the game-sound. Nonetheless i added them, because i can... try out the voice-pitch&#33;\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=6][color=DarkOrange][b][u]Modules[/u][/b][/color][/size]\r<br />The main reason for the seperation of modules is compatibility. Some mods, especially sound mods are conflicting in a way that can not be patched.\r<br />(Improved combat sounds is a good example. This mod has a completely different philosophy on how a game should sound. It&#39;s samples have a different character than bethesdas, and it can only work if these are not mixed together. But that&#39;s what a patch would do. So in order to not force people to choose between Project Soundscape and Improved Combat Sounds, one can just pick every module except Weapons, merge them into a single file and use it in combination with ICS.)\r<br />\r<br />shared content:\r<br />remix\r<br />sound category overhaul\r<br />output model variation\r<br />\r<br />\r<br />\r<br />[size=4][u][b]Remix[/u][/b][/size] (I&#39;ll just call it that way)\r<br />The mod features a extensive handmade remix of more than 700 sounds (of 2000 sounds total) which is split among the modules, depending on the sounds these refer to. Most of it is currently part of the sounds-module, and will be split up into different modules over time.\r<br />*Part of the remix so far: Weapons (full), footsteps (full), animals, creatures, waters, fires, magic, static objects and some misc edits\r<br />\r<br />[b][u]Included changes:[/u][/b]\r<br />[list]\r<br />[*] Adjusted/changed volume, distance and pitch.\r<br />[*] Added/tweaked random pitch- and volume-variation.\r<br />[*] Adjusted &#34;reverb-intensity&#34;.\r<br />[*] Changed some sounds to be placed in the game world instead of &#34;in the players head&#34;, like firing crossbow, arrow impact, npcs casting magic, distant giant footsteps,...\r<br />[*] Removed alternate(generic) sounds that often played instead of the correct sounds. This has an effect on weapon impacts, footsteps and picking up items/ingredients.\r<br />[*] Changed referenced sound categorys to attach sounds to the new sliders and tweaked menu behavior. Most sounds that are related to animations/visual effects will pause during menus and finish with the animation when menu is closed. (eg Weapons and Magic)\r<br />[*] During dialogue-mode only ambient- and environment-sounds are lowered instead of most of the sounds around the player.\r<br />[/list]\r<br />\r<br />[b][u]Examples[/u][/b] (because i can&#39;t list every single change in detail...  similar changes are done to many sounds)\r<br />[list]\r<br />[*] Increased audible distance (and volume) for saw-/windmills, ship bells, hammering, dog barks, netch-loop, catapult impacts...\r<br />[*] Dwarven spiders can be heard as far as wolves instead of dwarven centurions. Their attacks frequency is slightly random instead of static.\r<br />[*] &#34;Conscious-loops&#34; of dwarven-spiders and -spheres have slight frequency variation, so every one has it&#39;s &#34;unique&#34; frequency. (This is added to all creature- or object-loops so the brain identifies them as seperate soundsources)\r<br />[*] Creature death-sounds will not be be heard further/louder than the rest of the creatures sounds.\r<br />[*] Dragon sounds volume and distance are brought in line with each other. Spoken words have adjusted range and attenuation.\r<br />[*] When hitting a target with an arrow, the impact-sound will be played at the targets position instead of &#34;the players head&#34;.\r<br />[*] Nirnroot is more silent, but can be heard over a greater distance.\r<br />[*] Drawing and swinging weapons is not as loud as the impact anymore.\r<br />[*] Less intense reverb on noisy sounds like steam and water (to much reverb on sounds like these will clutter the soundscape) and more reverb on &#34;short&#34; sounds like water splatters or impacts. \r<br />[*] Silt strider call is louder, but only plays half as often as before.\r<br />[*] Draugr-voices have stronger reverb than before. (For more scary-feelings..)\r<br />[*] A sabre-cats aggro warning can be heard in a distance outside of it&#39;s attacking-radius. But the footsteps might only be heard if it&#39;s already to late..\r<br />[*] Lowered frequency on dog barks to make them sound more like big dogs instead of a puppy.\r<br />[*] Reduced random volume on weapon impacts from 90% to 50%. Such big volume changes make sense if linked to impact-force (damage dealt for example), but not if it&#39;s completely random..\r<br />[*] Random bird-/cricket-noises increased in distance and reverb volume so they stick out more of the overall ambient soundscape.\r<br />[*] ....\r<br />PHYSIX\r<br />[/list]\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Core[/b][/color][/size]\r<br />Does global changes to sound/sound processing.\r<br />\r<br />[list]\r<br />[*] Increased audible distance. Doubled radius and changed attenuation for smoother, more natural fadeout (see image). Some output-models have unique, even longer distances. (This is a global change and affects all sounds, independent from distance changes to single sounds.)\r<br />[*] Reduced the volume for &#34;defined speaker output&#34; (sounds that are not placed in the game world). This fixes many (known) issues with sounds beeing to loud like some magic sounds, ambient sounds, daedra voices, player footsteps (compared to 3rd person), potions and ingredients,....basically everything that used this kind of output before. (Take a look at [url=http://skyrim.nexusmods.com/mods/41982]this mod[/url] for further explanation.)\r<br />[*] DYNAMIC REVERB Reworked amount of sound &#34;send to reverb&#34; in the output-models. Increased reverb-volume for sounds that didn&#39;t use much, and lowered for sound that previously used to much. The room now will appropriately react to sound sources, instead of being either lazy or hysterical... (This, too, is a global change)\r<br />[*] Focussed player/ingredient/potion sounds more on the front speakers, and ambient sounds more on the rear ones. This will have a slight effect on 2.0/2.1 setups, too. This will help seperating sound sources and prevent them from covering each other.\r<br />[/list]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Mixer[/b][/color][/size]\r<br />[list]\r<br />[*] Removed Vanilla sliders from the Audio-Settings-Menu and added them to the MCM. Sliders for killmoves and interface are added, too. (Those were fully functional and part of the vanilla game, but hidden by default.) As a side effect, some sliders allow to increase volume further than before.\r<br />[*] All sounds except music now stop playing during loading menus.\r<br />[/list]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Reverb[/b][/color][/size]\r<br />Skyrim by default uses only 7 different reverbs for all locations. Four sizes of stone rooms, two wooden rooms and ships. These are used by all types of interior locations, regardless their structure. Exterior areas use no reverb at all. Besides the fact that this has nothing to do with realism, it also doesn&#39;t build an atmospheric soundscape..\r<br />This module uses 40+ new unique sounding reverbs and spreads them across all interiors and many exterior areas. The default reverb is used for the areas not covered by the mod, so that the player always has the impression that there is some environment around him.\r<br />\r<br />[u]Changes[/u]\r<br />[list]\r<br />[*] All different types of interior locations (caves, dwemer ruins, catacombs, forts, mines,...) have their own reverbs with unique sound and variable sizes.\r<br />[*] Created a third reverb type for inhabitat rooms: While vanilla skyrim only has reverbs for wooden and stone rooms, many interiors are build of stone walls and wooden floors etc. These now use their own reverb (Early reflections are close to stone, decay closer to wood).\r<br />[*] [s]Corrected many interior cells that used the wrong reverb (for example the jarls house in winterhold used large stone, but it actually is not that large and only has a stone floor..)[/s] *WIP\r<br />[*] Exterior reverbs (these are more like echoes) for all cities, city exteriors and villages (all dlcs) as well as High Hrothgar, Throat of the world (Path), Castle Volkihar and Fort Dawnguard (Dlc1), Temple of Miraak (Dlc2).\r<br />[*] Made use of the default reverb. If no reverb is referenced by a cell, this one will be used. This happens mainly in exterior areas. It&#39;s the most subtle of the exterior revebs.\r<br />[*] Missing reverb added to Dark Brotherhood Sanctuary and some other cells i&#39;ve forgotten.\r<br />[*] Unique reverbs for: Dragonsreach balcony, Blackreach, some glacier areas (the ones that already used an acoustic space), Vyrthur (Dlc1), Volkihar Courtyard (Dlc1), Apocrypha (Dlc2), Telvanni Mushrooms Interior (Dlc2)\r<br />[/list]\r<br />[u]The new reverbs can be classified in 4 different types:[/u]\r<br />[list]\r<br />[*] Rooms, inhabitat by humanoids with lots of furnishings or carpets sucking up reverb: Medium reverb decay, medium early reflections\r<br />[*] Dungeons, empty closed rooms: Long reverb decay, strong early reflections\r<br />[*] Semi exteriors, opened caves for example. Reflecting surrounding walls but less capability to trap the sound: Medium reverb decay, strong early reflections\r<br />[*] Exteriors, only directly reflecting structures, no chance to trap sound at all: Short reverb decay, medium early reflections\r<br />[/list]\r<br />*Note: Music is masking the reverb. I recommend to disable it.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Weapons[/b][/color][/size]\r<br />[list]\r<br />[*] Remix of all melee and ranged weapon-sounds. Adds sliders for weapons to the MCM.\r<br />[*] Removed alternate weapon sounds, so the different impacts for surfaces/objects/npcs are used instead of the always same generic sound.\r<br />[*] Added impact-sounds that haven&#39;t been used by the game.\r<br />[*] Increased volume and distance for all weapon impacts.\r<br />[*] Added variations of sounds to weapons-types that didn&#39;t use unique sounds for a specific material. (eg arrows/bolts will now play a metal-impact when hitting metal)\r<br />[*] Generally less random frequency and volume on weapon impacts. Similar weapon types have their own unique consistent frequency with subtle variation (eg all blade-sounds have similar pitch, different from axes). If weapon-impacts shared the same sample, the mod adds different sounds with unique frequency, instead of all weapons using the same random frequency. (eg Shields or ice hit with a warhammer have a lower pitch than with a dagger)\r<br />[*] Weapon impacts will sparkle appropriatly depending on the objects material.\r<br />[*] Added new sample for flying arrows/bolts.\r<br />[*] Edited bone and carpet material so arrows/bolts stick in them.\r<br />[/list]\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Footsteps[/b][/color][/size]\r<br />Bethesda didn&#39;t add the footstep sounds they created for the different armor types. Most of them are not used by the game that instead uses the sounds for no armor. Also some sounds are used only for the player, others only for npcs. The module adds the not used sounds to player and npcs, as well as it fixes some issues. \r<br />\r<br />[list]\r<br />[*] Remix of all human footstep-sounds. Adds slider for player- and npc-footsteps to MCM.\r<br />[*] Unique footstep-sounds for Light Armor, Heavy Armor and no Armor for Player and NPCs for different speeds and surfaces.\r<br />[*] Npcs now use sneak-sounds instead of walking-sounds.\r<br />[*] Sprinting in skaal-armor has unique sounds only for the player. Npcs now use these, too.\r<br />[*] Added the missing player sounds for jumping up. Before jump up sounds in 3rdperson didn&#39;t properly switch to HRTF (instead they were played &#34;in the players head&#34;) as well as npc jump-sounds were not played on HRTF. Sound categorys (volume-sliders) are fixed too.\r<br />[*] Removed alternate footsteps/jump-sounds which were sometimes played instead of the correct ones.\r<br />[*] Changed material for some ground textures, to play appropriate sounds and add more frequent variation.\r<br />[/list]\r<br />*Note: The footstep-sounds are attached to the boot-records, not the cuirass, so the sound depends on the boots the player/npc is wearing. This is how the game handles footsteps for humans... changing this would require a lot of new samples, which i don&#39;t have.\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Magic[/b][/color][/size]\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Creatures[/b][/color][/size]\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Humans[/b][/color][/size]\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Environment[/b][/color][/size]\r<br />\r<br />[*] Added missing sounds to flapping Banners.\r<br />\r<br />\r<br />\r<br />[u]Additional sounds added to:[/u]\r<br />[list]\r<br />[*] Nordic Waterways\r<br />[*] Fires with large smoke trails (appearing during the Japhets Folly- or Civil War Quests)\r<br />[*] Blackreach Mushrooms and Tentacles (the latter is only audible close to the point they touch the surface)\r<br />[*] Dwemer Lift\r<br />[*] Sewer Doors\r<br />[*] Night Mother Coffin (Only if player is &#34;the Listener&#34;)\r<br />[*] Windmill and Sawmill\r<br />[*] Volcanic Mineral Pools\r<br />[*] Dark Elf Lanterns (DLC2)\r<br />[*] Smoking shrubs and small flaming rocks (DLC2)\r<br />[*] Apocrypha Tentacle Clusters (DLC2)\r<br />[/list]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Ambience[/b][/color][/size]\r<br />\r<br />DYNAMIC WIND\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Interface[/b][/color][/size]\r<br />[*] Removed alternate(generic) sounds for picking up items/ingredients.\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]MenuBehavior[/b][/color][/size]\r<br />Ambient sounds (region/local sounds) will be muted during Map-/Skill-menus. No more cicadas or rain drops when &#34;hovering above skyrim or looking at the stars&#34;. This feature can be deactivated. (Works with the vanilla game as well, but some sounds are not affected by default and require the modules to be muted.)\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Sounds[/b][/color][/size]\r<br />Contains all edits that are not part of a specific module yet.\r<br />\r<br />[list]\r<br />[*] Remix of all sounds that are not part of the weapons or footsteps modules.\r<br />[*] Enables the MCM to mute Nirnroot, Critical Hit-Sound, Soultrap, LevelUp and ActivateFail\r<br />[*] Added new output models with bigger attenuation start radius.. the player needs to move further away from the object before it starts to get silent. This is mainly used for rivers/waterfalls (so the fadeout doesn&#39;t start when the player is still in the river)\r<br />[*] Changed sound for firebolts, (spider-/chaurus-)spit and addded sound to frost projectile. New samples are continous loops, the projectiles can be heard flying by.\r<br />[/list]\r<br />[b][u]Misc Changes[/u][/b]\r<br />[list]\r<br />[*] Added a sonar-like sound to Aura Whisper shout. The auras of npcs are not only visible anymore.. (can be disabled in the MCM)\r<br />[/list]\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Objects[/b][/color][/size]\r<br />This adds sounds to record types that allow adding them, for example moveable statics, doors and lights. The purpose is to enrichen skyrims soundscape with more soundsources that can be seen and tracked down instead of adding more ambient sounds without &#34;real&#34; source.\r<br />All used samples are edited versions of vanilla sounds. The module has it&#39;s own volume slider.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=6][color=DarkOrange][b][u]Samples[/u][/b][/color][/size]\r<br />\r<br />[u]The samples do not require any, but cover all Dlcs.[/u] Weapons include crossbows/bolts (Dawnguard) and wooden swords (Hearthfires), footsteps include ash (Dragonborn), etc.\r<br />\r<br />REMOVE:Some samples so far have been edited either to remove technical bugs or for improvement reaons.. These are highly recommended to be used if the other modules are used because the mod is mixed with these samples, but technically they&#39;re not required. \r<br />On all edited samples useless silence has been removed and proper fade in/out added if necessary to avoid clipping (fades are not audible). This will slightly reduce memory usage and lower the chance that sounds don&#39;t play due to engine limitations on max simulatanious sounds.\r<br />\r<br />\r<br />[list]\r<br />[*] Removed the introduction-sounds in front of arrow and bolt impacts. This caused an incorrect attenuation and timing on the impacts, and was also kind of unrealistic because it&#39;s only a simulated incoming-projectile sound. A similar sound was added to the bow-fire samples and is at removed, too. More accurate projectile sounds are added to the projectiles themselves by the weapons-module.\r<br />[*] Some Weapon samples (blade on wood impact for example) had a small amount of silence in front of the impact, and in result played a delayed impact sound compared to other impact sounds. This has been removed.\r<br />[*] Filtered the high/hurting frequencys of the blade vs other sample (is used as blade/axe vs small metal when using the weapons module).\r<br />[*] Reduced volume on one netch-sample, to make it more equal with the second(silent) one. (Both are used by the same sound descriptor.)\r<br />[*] Shortened Hrtf catapult projectile explosion to prevent the sample beeing cut off by the engine when the impact-event is finished.\r<br />[/list]\r<br />\r<br />*The samples are loose files and don&#39;t have a plugin....unless full version is used\r<br />\r<br />\r<br />\r<br />\r<br />[size=6][color=DarkOrange][b][u]Addons[/u][/b][/color][/size]\r<br />\r<br />[size=4][color=DarkOrange][b]Hearthfires_Weapons[/b][/color][/size] and [size=4][color=DarkOrange][b]Hearthfires_Humans[/b][/color][/size]\r<br />[u]Requires Soundscape_Source.[/u] Use these if you own Hearthfires and use the Weapons and/or the Humans Modules.\r<br />This files only reduces the volume of the wooden-sword sounds, removes generic weapon impact and increases audible distance on the workbench hammer, to adjust them to the remix as well as adding the sounds to the sliders. All in all just 8 records. For these i won&#39;t add another master-file to the main mod, so it&#39;s an optional file.\r<br />\r<br />[size=4][color=DarkOrange][b]Armors[/b][/color][/size]\r<br />[u]Does NOT require the main mod, but requires dawnguard and dragonborn.[/u]\r<br />Changes the footstep-sets used by the armors.\r<br />In the vanilla game every light armor is supposed to use footsteps-sounds for light armor, heavy armor uses heavy footsteps, and cloth uses default footsteps.. (these are not always used correctly, but the uskp fixes these issues) While this is okay with the vanilla footstep-sounds, it might get weird when using my footsteps module. Suddenly, iron-armor sounds like someone is carrying a bag of scrap-metal, and thieves- or dark brotherhood-armor sounds like chainmail. This plugin changes the used footstep-sounds for all armors depending on the look/material of the armor instead of their category. For example thieves-armor and other leather-based armors will use the default footsteps, iron and steel use the light-armor/chainmail sounds (because no metal-plates are directly touching each other) and glass, steelplate and ebony use the heavy/plate-sounds.\r<br />\r<br />[size=4][color=DarkOrange][b]Shields[/b][/color][/size]\r<br />Same as armors, but adjusts the impact sounds for light and heavy shields depending to the material-look.\r<br />\r<br />[size=4][color=DarkOrange][b]City Sounds[/b][/color][/size]\r<br />[u]Does NOT require the main mod or the Dlcs.\r<br />This was part of the environment module, but is removed because it&#39;s not compatible with [url=http://skyrim.nexusmods.com/mods/8058]Open Cities[/url]. Should be compatible with every other mod.[/u]\r<br />Adds sound markers to the areas behind the main citys walls in the tamriel worldspace.\r<br />It was kind of strange that the waterfalls inside markarth could not be heard outside the city walls. This plugin adds all sounds to the game that are loud enough to be heard outside.\r<br />RELEASE AS SEPERATE MOD????\r<br />\r<br />\r<br />[size=4][color=DarkOrange][b]Mute Background Music[/b][/color][/size]\r<br />[u]Requires Dawnguard and Dragonborn.[/u]\r<br />This will disable all music except sounds for special events like exploration. \r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />*REMOVE\r<br />[size=6][color=Red][b]Beta Information[/b][/color][/size]\r<br />[list]\r<br />[*] Many sounds are still only roughly or not mixed at all. Due to the 2000+ sound descriptors this is a slow process. (Especially many quest-related sounds will need some time because they require a savegame with the specific quest active in order to test them ingame.)\r<br />[*] The edited samples don&#39;t offer any noticeable performance improvement. Way to few samples are currently done. The game has more than 5000 vanilla samples..\r<br />[*] Waterfalls...to silent....i know.\r<br />[*] Only preset 1 is working.\r<br />[*] Increasing pitch to a value higher than 2.0 has no effect on most sounds.\r<br />[*] Ambient sounds are not touched at all, so the volume is kept slightly lower to avoid distraction\r<br />[/list]\r<br />*Things like the remix or editing vanilla samples will be a WIP for quite a while. There is always something to tweak or implement, and this will stay a WIP even after the beta..\r<br />\r<br />\r<br />The sounds module is a temporary module and will be split up into seperate modules including new sliders. The objects-module might get merged into these.\r<br />Planned modules so far are:\r<br />[list]\r<br />[*] Magic\r<br />[*] Animals/Creatures\r<br />[*] Environment (Static objects and ambient-sounds, including sounds from objects module)\r<br />[*] Interface\r<br />[/list]\r<br />\r<br />[color=Red]If you want to use the master file as resource for your own mod, please keep in mind that some structural changes will be done during the beta, especially to sound categorys.[/color]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center][size=7][color=DarkOrange][b][u]Technical Stuff[/u][/b][/color][/size][/center]\r<br />\r<br />[size=6][color=DarkOrange][b][u]Issues[/u][/b][/color][/size]\r<br />[list]\r<br />[*] The Master-slider can&#39;t be removed from the vanilla audio-menu. Just leave it at full volume.\r<br />[*] Changes to pitch in the MCM only apply to sounds that start playing after the pitch-change is made. In other words, loops like fire and water will only be changed after the sound is stopped and restarted (for example by changing the cell)\r<br />[*] Reverb is not working if a savegame in an exterior area is loaded. Enter and leave an interior cell to fix.\r<br />[*] Interior weather sounds are not working on loading a savegame. Exit and reenter interior cell to fix.\r<br />[/list]\r<br />\r<br />[b][u]Vanilla issues that the mod doesn&#39;t fix[/b][/u]\r<br />[list]\r<br />[*] Dialogues often are not referencing the correct output model, making them to loud or to silent over distance.\r<br />[*] Some objects/surfaces emit the wrong or no impact sounds (foosteps, weapons, etc).\r<br />[*] Many creature/npc animations are missing sounds.\r<br />[*] Many sound markers are missing in the game world. (Rivers, Waterfalls, Windmills,...)\r<br />[/list]\r<br />\r<br />\r<br />\r<br />[size=6][color=DarkOrange][b][u]Performance[/u][/b][/color][/size]\r<br />As far as i can tell this mod has no impact on performance.\r<br />In theory some of the changes (removing generic sounds, adding new sounds) should increase memory usage, but it&#39;s a minor impact compared to texture replacers or armor mods. (All vanilla weapon samples loaded at the same time have a smaller impact/size than a single hd body-texture)\r<br />If any performance issues occur in your game, please report. Furthermore, the ini file has some lines that might help with memory issues.\r<br />\r<br />\r<br />\r<br />\r<br />[size=6][color=DarkOrange][b][u]Compatibility[/u][/b][/color][/size]\r<br />Compatibility is a bit unique, in some way similar to the way the uskp ensures compatibility with other mods.\r<br />There are some simple rules:\r<br />[list]\r<br />[*] Read the features of the mod carefully and check the compatibility list. A lot of sound-mods include similar features. Do not combine this mod with another mod that does the same.\r<br />[*] Mods that edit sounds (sound descriptors) might break the routing. If a mod for example edits weapon-sound records, these sounds won&#39;t be controlled by the weapons-slider anymore. If a mod adds new sounds, they too might(&#33;) not use the correct sliders.. In both cases patching is recommended.\r<br />[*] The edited Sound-Categorys and Output-Models of the Core-Module should never be overwritten by any other mod&#33; This could break the menu functions or big parts of the sound. (luckily i don&#39;t know of any mods editing those except other sound overhauls)\r<br />[/list]\r<br />(If you ignore these, it will NOT crash the game, damage your saves, make cows fly, let giant chickens rush into whiterun or anything else.. The worst that can happen is that something sounds odd..)\r<br />\r<br />\r<br />But there is a chance that some records that are not only related to sound conflict with other mods. These records mainly add more variation to the soundscape, like editing impacts for the weapons, or the surfaces themselves for the footsteps. I had to decide if i implement those and risk conflicts, or don&#39;t implement them at all. The simple solution to this problem: Load the modules [u]early[/u] in the load order, and let other mods overwrite these records. In result you might loose single features, but it will never break the whole mod/module. The rest will still work fine.\r<br />(If my mod overwrites another one, i can not guarantee that this mod will not be broken. It depends on how the other mod is made..)\r<br />\r<br />[u]Exception[/u]\r<br />The reverb module should be loaded late. It contains a lot of cell edits, and therefore needs to be loaded after every mod that edits the content of cells, for example Lanterns of Skyrim, Realistic Lightning, Helgen Reborn, mods that add armor-chests, etc.  (Editing the cells themselves and editing the cell-content are two different things considering record hierarchy. Cell editing mods should always be loaded after content adding/removing mods.)\r<br />For other cell editing mods, like Realistic Water Two, we&#39;re back to the way mentioned above. Let the reverb module be overwritten.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/25859]Tes5Edit[/url] is very usefull for conflict checking.\r<br />*Use Patches if available.\r<br />\r<br />\r<br />[u]One fair warning[/u]\r<br />Even if this mod has technically good compatibility, it is designed as standalone mod. Project Soundscape offers a more detailed implementation and mix of the game sounds. Some other mods, especially sample replacers, have intended or unintended changes on volume and balance that is changing the intention of the remix or just don&#39;t fit into the overall soundscape and balancing issues might stick out more obvious than with the vanilla game.\r<br />Because in the end it&#39;s a matter of taste, you&#39;re free to combine this mod with whatever compatible mod you choose, but if it sounds odd, it&#39;s not my responsibility.. That&#39;s the price for freedom..\r<br />\r<br />\r<br />[size=3][color=DarkOrange][b]Load Order[/b][/color][/size]\r<br />The mods files do not require a specific load order compared to each other, but the Source-file needs to be loaded first (because it&#39;s a .esm).\r<br />\r<br />Skyrim.esm\r<br />Update.esm\r<br />Dawnguard.esm\r<br />HearthFires.esm\r<br />Dragonborn.esm\r<br />(Unofficial Patches)\r<br />Soundscape_Source.esm\r<br />#Masters\r<br />Soundscape_Addons\r<br />Soundscape_Modules\r<br />#Other Mods\r<br />#Lightning Mods\r<br />Soundscape_Reverb\r<br />#Other Mods - Cell editing\r<br />Soundscape_Patches\r<br />Bashed Patch\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=6][color=DarkOrange][b][u]Installation[/u][/b][/color][/size]\r<br />Use your favorite mod manager to install, or install manually (Copy all files into skyrim/data)\r<br />Check plugins you want active and start the game.\r<br />*After installation start the game and make a new savegame. Then quit the game, restart it and load the new save. Changes to outputmodels sometimes don&#39;t work on first load..\r<br />\r<br />[size=4][b][u]First Startup[/u][/b][/size]\r<br />The mod will start with all sound categorys using their vanilla volume. You can either start adjusting the sliders to your preferences, or load one of the presets.\r<br />\r<br />[size=6][color=DarkOrange][b][u]Uninstallation[/u][/b][/color][/size]\r<br />Use the mod manager to uninstall, or remove files manually. The mod/scripts don&#39;t make any permanent changes, no special procedure is required.\r<br />*If you&#39;re not comfortable with removing scripted mods, or want to temporary uninstall the mod, remove the esps and keep the esm in the load order. Without modules the scripts won&#39;t do anything on game load and no settings will be lost.\r<br />\r<br />[size=6][color=DarkOrange][b][u]Updating[/u][/b][/color][/size]\r<br />Just uninstall old version and install new one. Do NOT make a cleansave or your menu-settings will be lost&#33;\r<br />Some future updates might reset the settings. To be save, make screenshots of them before updating. But i&#39;ll put up a notification if this is necessary.\r<br />\r<br />\r<br />*Note: I know about the &#34;rumor&#34; that one should never remove any mod during playthrough, and i&#39;m aware of the fact that this statement comes from bethesda themself. Yes, certain mods will cause small to heavy issues if removed, quest related mods, leveled list mods, or scripted mods. The latter at least always leaves a error message in the papyrus log.\r<br />But many mods, and this is one of them, do not cause any issues if removed. Even removing the scripts will not do anything more than giving this small, meaningless message. I have it removed and readded, updated and renamed files/scripts dozens of times during development on my current savegame without running into a single issue (and i&#39;ve done the same for many other mods).\r<br />If i&#39;m wrong about this please correct me.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center][size=7][color=DarkOrange][b][u]Patches[/u][/b][/color][/size][/center]\r<br />\r<br />[color=red][list]\r<br />[*] Patches often require dlc-addons of the mods to be active in the load order. Make sure you have all available addons installed. Otherwise your game might crash on startup.\r<br />[*] Unless further information is given, load order between the patches does not matter, but they always need to be loaded after the mods they&#39;re patching.\r<br />[/list][/color]\r<br />\r<br />*The version info behind the mods name means that patches were created with this version of the mod. It does not necessarily mean that higher or lower versions are incompatible. If the patches are outdated, please report.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/17802]Climates of Tamriel[/url] v3.1\r<br />[u]Ambience[/u] - ...................\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/60]Enhanced Blood Textures[/url] v3.5d\r<br />[u]Weapons[/u] - Patch for the conflicting weapon impacts.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/31039]Improved Horse Step Sounds[/url] v2\r<br />The horse footsteps are audible over a longer distance and the volume is adjusted. (It changes the output model used by the horse-footsteps to a different one with higher radius (from 1400 to 3000 in game units). The longer global-attenuation of the sound module will be applied if the sound module is used.)\r<br />*Overwrite original ihss.esp. Load after the sound-module (if used). The original IHSS-Mod is still required for the samples. My mod is not required.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/41076]Realistic Water Two[/url] v1.10\r<br />The reverb patch ensures that new (exterior) reverbs as well as new waters will be loaded in conflicting cells, and the sounds-patch adds the new water sounds to the water sliders.\r<br />\r<br />\r<br />\r<br />[size=3][color=DarkOrange][b]Optional[/b][/color][/size]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/37994]Falskaar[/url] v1.1.2\r<br />Adds the new exterior reverbs to falskaars landscape.\r<br />\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/9782]Moonpath to Elsweyr[/url] v9.5\r<br />The moonpath-mod uses only one new acoustic space for all it&#39;s cells. The used reverb has been set to urban exterior instead of skyrims medium wooden room that is used by default.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=6][color=DarkOrange][b]Recommended Mods[/b][/color][/size]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/31039]Improved Horse Step Sounds[/url] (use patch)\r<br />The variation on horse footsteps is a great addition to the mod.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/1117]Smooth blade draw and Sheathe[/url]\r<br />I highly recommend to use the sample replacers from this mod (except the ones for left-handed weapons) in combination with my samples.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center][size=7][color=DarkOrange][b][u]Additional Information[/u][/b][/color][/size][/center]\r<br />\r<br />\r<br />[color=DarkOrange][size=5][b]Basic Knowledge[/b][/size][/color]\r<br />[url=http://www.creationkit.com/Reverb_Parameters]Skyrims Reverb[/url] and [url=http://audacity.sourceforge.net/manual-1.2/effects_reverb.html]Reverb[/url] in common\r<br />[url=http://www.creationkit.com/Sound_Output_Model]Output Model[/url], explains defined speaker output, [url=http://www.tech-faq.com/hrtf.html]HRTF[/url] and reverb send\r<br />[url=http://www.creationkit.com/Sound_Descriptor]Sound Descriptor[/url], explains alternate(generic) sounds\r<br />[url=http://www.creationkit.com/Sound_Category]Sound Category[/url] (Slider)\r<br />[url=http://www.creationkit.com/Acoustic_Space]Acoustic Space[/url]\r<br />\r<br />\r<br />\r<br />[color=DarkOrange][size=5][b]Music[/b][/size][/color]\r<br />Project Soundscape is designed to be used without music. It features a dynamic, detailed remix and many sounds like crickets, small water streams, distant sounds in general and also some reverbs can be subtle and not always as present as in vanilla skyrim or other games. In fact, most games are mixed specifically to work with music at the cost of immersion and realism as soon as the music is disabled. But in return Project Soundscape does not rely on music to cover up holes in the soundscape. \r<br />I recommend using Project Soundscape without constant music to be able to get every detail of what the mod is doing. If you don&#39;t want to play without it, that&#39;s okay. But it would be like going into nature with your ipod and trying to listen to the birds, echos, or whatever is going on out there...\r<br />\r<br />\r<br />\r<br />\r<br />[color=DarkOrange][size=5][b]Volume[/b][/size][/color]\r<br />The mod overall increases the game volume by 10%-50%, depending on the sound, the slider and the mix. While this offers some volume boost, it is not enough to compensate skyrims low volume. Keep in mind that this is a engine issue, so there is nothing i can do about it..\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]How the MCM/Scripts work[/b][/color][/size]\r<br />For people worried about script performance, or wondering why music plays at full volume when loading a savegame after starting skyrim:\r<br />The script is not permanently running during the play session. It will only change something when the user makes a change in the MCM or when a game is loaded. The latter is necessary because the volume changes to sound categorys done by the script are not saved with the savegame or the the skyrimprefs.ini (wich is used by the vanilla menu). The changes are only persistent during the game-session, and will be lost as soon as the game is closed. Only the settings themselves are saved as MCM-internal values and therefor need to be reapplied on every game load (done automatically by the script). In result sound-settings of Project Soundscape are &#34;unique&#34; for every saved character, and music will play at full volume on first save-load after starting the game and is set to it&#39;s saved value when the game finished loading.\r<br />Also, this mod has a second, smaller script thats responsible for muting ambience during map- and skill-menus. This will only be triggered if one of these menus is opened and then mute the main sound category used by all ambient sounds (and unmute on menu close), or do nothing if this feature is deactivated. \r<br />\r<br />\r<br />\r<br />\r<br />[size=5][color=DarkOrange][b]Merging Modules[/b][/color][/size]\r<br />For people who like to use their own combination of modules, but don&#39;t want to load many plugins, this mods files can be easily merged into one file using [url=http://skyrim.nexusmods.com/mods/25859]Tes5Edit[/url]. In theory all main modules, optional files and patches can be merged together, but i recommend to at least merge the patches into a seperate file as well as not merging the reverb for load order reasons.\r<br />*Do not merge the master file&#33;\r<br />\r<br />Beginners:\r<br />Take a look at [url=http://forums.nexusmods.com/index.php?/topic/904953-how-to-merge-multiple-mods-with-multiple-master-files/]this[/url] guide how to merge mods in general.\r<br />For this mod it works exactly the same way, but with two exceptions:\r<br />- You don&#39;t need to renumber the form-id&#39;s. If you follow the guide, skip pictures 3-6.\r<br />- You don&#39;t need to continue after adding the masterfiles. Picture 11 is the last one for this mod. (It will not ask you to add one of the esps as master..)\r<br />\r<br />Advanced users:\r<br />The modules don&#39;t have any new records included. This makes merging extremely simple, because one can ignore the whole issue on duplicated form id&#39;s.\r<br />Load all wanted modules with Tes5Edit. Use &#34;copy as override&#34; or &#34;deep copy as override&#34; (makes no difference) to copy the group tabs into a new file and save. Done.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=6][color=DarkOrange][b]Compatibility List[/b][/color][/size]\r<br />This list only shows some popular mods that might have conflicts. I cannot check compatibility for every mod available or keep track of every update, so how accurate this gets depends on people reporting conflicts/issues.\r<br />I will not add mods here that are obviously compatible, like armor mods or texture replacers.\r<br />\r<br />[list]\r<br />[*] Ambient Seagulls - Compatible\r<br />[*] Better Animal Footsteps - Technically compatible, but samples have their own (intended) balance that is conflicting with the remix\r<br />[*] Better Weapon Swings - Compatible\r<br />[*] Clanking Armor - Obsolete with Footsteps-Module\r<br />[*] Climates of Tamriel - Compatible\r<br />[*] Climates of Tamriel Sounds - Conflicting with sounds-module - New sounds don&#39;t use the AmbienLoops slider, patch available\r<br />[*] Enhanced Blood Textures - Conflicting with weapons-module, patch available\r<br />[*] Falskaar - Compatible *Optional Patch available\r<br />[*] FSS Better Bards - Compatible\r<br />[*] Helgen Reborn - Compatible\r<br />[*] Icebreakers Improved Reverb - Incompatible with reverb-module\r<br />[*] Immersive Sounds Magic v1- Compatible, but don&#39;t use esp (this hinders magic sounds used by npcs to be played on hrtf)\r<br />[*] Immersive Thunder - Compatible\r<br />[*] Improved Combat Sounds - Incompatible with weapons-module\r<br />[*] Improved Dragon Shouts - Compatible\r<br />[*] Improved Horse Step Sounds - Conflicting with sounds-module, patch available\r<br />[*] Improved Weapon Impact Effects Correct Metal - Similar changes included in Weapons-module\r<br />[*] Muffle the Nirnroots/Nirnroots silenced - Obsolete\r<br />[*] Moonpath to Elsweyr - Compatible *Optional patch available\r<br />[*] Pure Waters - Compatible\r<br />[*] Realistic Water Two - Conflicting with reverb- and sounds-module, patches available\r<br />[*] Roosters at dawn - Compatible\r<br />[*] Silent Skyrim - Partially included\r<br />[*] Soultrap Sound Edit Calm Wind - Compatible\r<br />[*] Sounds of Skyrim - Conflicting with reverb-module, Patch Available\r<br />[*] Thundering Shouts - Compatible\r<br />[*] Ultra Realistic Bow Shoot Sounds - Compatible\r<br />[*] Ultra Realistic Crossbow Shoot Sounds - Incompatible with weapons-module, similar changes included\r<br />[*] Unofficial Skyrim/Dawnguard/Hearthfire/Dragonborn Patch - Compatible\r<br />[*] Water - Compatible\r<br />[*] Wyrmstooth - Compatible\r<br />[/list]\r<br />\r<br />*Note: I&#39;m i responsible for the audio/audio implementation of other mods. If another mod uses the wrong footstep sounds on new armors, doesn&#39;t add necessary sound-markers to new landscapes, offers new samples with unbalanced volume or has any other similar issues, i will still mark it as compatible as long as it technically runs without conflicts. Which mods you choose is up to you.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center][size=7][color=DarkOrange][b][u]CREDITS[/u][/b][/color][/size][/center]\r<br />\r<br />[url=http://skyrim.nexusmods.com/users/2348879/?]Crystan[/url] - for granting me permission to upload modified IHSS.esp\r<br />\r<br />\r<br />[size=4][b][u]Samples[/u][/b][/size]\r<br />[size=2]All samples except the mentioned ones are custom edits based on Skyrims samples. All credit goes to Bethesda Softworks.[/size]\r<br />\r<br />\r<br />[size=4][b][u]Software[/u][/b][/size]\r<br />[size=2]All people involved in the development of the following software:[/size]\r<br />\r<br />[size=3]Skyrim and the Creation Kit\r<br />Tes5Edit\r<br />WryeBash\r<br />SkyUI - especially for the MCM and the excellent documentation on how to make Mod-Menus\r<br />Audacity\r<br />Wavosaur\r<br />Studio One\r<br />[/size]\r<br />\r<br />",
  "categoryId": "61",
  "version": "v2beta1",
  "author": "someguy",
  "createdUnix": "1376050524",
  "updatedUnix": "1376050524",
  "containsAdultContent": false,
  "uploadedBy": "ffe3214",
  "primaryFile": null,
  "files": []
}