{
  "modId": 39988.0,
  "modName": "Improved Closefaced helmets with Circlets - legendary edition",
  "summary": "A quick merging of &#34;Circlets with helms legendary edition&#34; and &#34;improved Closefaced Helmets&#34; through tes5edit. You still need both mods.",
  "descriptionHtml": "[center][size=4]Dragonborn Helmets have been added&#33; \r<br />When Navida1 releases the dragonpriest masks, they&#39;ll also be merged and then this will likely be considered final and unlikely to get any more updates after that.[/size]\r<br />\r<br />Falskaar patch added. Immersive Armors patch being worked on. Added an optional version with Heavy imperial helmet meshes for khajiits by Izea[/center]\r<br />\r<br />\r<br />I always liked the added detail of a circlet under your bigger headgear. Adds some more character customization with vanilla items. Actually, with almost any circlet-flagged item and vanilla helmets. That&#39;s what Circlets with helms legendary edition does.\r<br />\r<br />Still there was a problem. Specifically, for the beast races. I found it horrible how the closed helmets didn&#39;t fit on them at all, there was no specific model for them.\r<br />Thankfully, Improved closefaced helmets fixes that, and adds much more, opening most closed helmets for the humans and elves too.\r<br />\r<br />As this is only a merging of all the files, you&#39;ll still need likely both mods for this esp to work - but you only need to turn on this one&#33;\r<br />\r<br />[center][size=6][color=#ffff00]==INSTALL METHOD==[/color][/size]\r<br />I seriously hope you&#39;re reading this&#33;[/center]\r<br />\r<br />1: Follow the link to [url=http://skyrim.nexusmods.com/mods/15927/]Improved closefaced helmets[/url] and Install the three files - Main module v0.9, Dawnguard helmets, Dragonborn helmets. Remember to follow instructions on the mod page.\r<br />\r<br />1b: [Outdated] [s]Download and install, manually or through a mod manager, [url=http://skyrim.nexusmods.com/mods/35950]Circlets with helmets legendary edition[/url] for immersive armors if you have that. No need for the main esp, as it was fully merged in this mod. [/s][Immersive armors has been updated, this means that mod may not work or only work partially]\r<br />\r<br />1c: Install any of the available patches for whatever you use. Falskaar and Immersive armors planned.\r<br />\r<br />2: Turn off ALL esps related to Improved Closefaced helmets [usually named as imp_xxx.esp]\r<br />\r<br />3: Turn on Closefaced Helmets with Circlets.esp [mod manager or the skyrim launcher] \r<br />[b]The mod is now recognized by BOSS&#33; :D Just run boss to make sure it is in the right place&#33;[/b]\r<br />\r<br />4:???\r<br />\r<br />5: PROFIT&#33;\r<br />\r<br />[center][size=6][color=#ffff00]==LOAD ORDER==[/color][/size][/center]\r<br />[how my load order is as of 01/03/2014]\r<br />Closefaced Helmets with Circlets.esp ACTIVE\r<br />---\r<br />helmetwithcirlcet.esp [color=#ff0000]INACTIVE[/color] [grimfandang0]\r<br />imp_helm.esp [color=#ff0000]INACTIVE[/color] [main]\r<br />imp_helm_imp.esp [color=#ff0000]INACTIVE[/color] [no cloth on imperial helmet]\r<br />imp_helm_dawn.esp [color=#ff0000]INACTIVE[/color] [dawnguard helmets]\r<br />imp_helm_dbrn.esp [color=#ff0000]INACTIVE[/color] [dragonborn helmets]\r<br />imp_guard_helm.esp [color=#ff0000]INACTIVE[/color] [tighter guard eyesockets]\r<br />\r<br />\r<br />this is only to show how i installed everything [and endorsed everything, like you should&#39;ve done] to have the files. Grimfandang0&#39;s file has no meshes, but once installed, you can remove all these esps. My esp replaces them, if you didn&#39;t understand that yet. O_O\r<br />\r<br />[center][size=6][color=#ffff00]==COMPATIBILITY==[/color][/size][/center]\r<br />\r<br />This mod should be compatible with any circlet, mod or not.\r<br />All vanilla and DLC helmets can be used with any circlets, and most of the closed ones are now open.\r<br />Any mod that tweaks any helmet, circlet or mask should be loaded BEFORE this mod, and therefore, should be compatible. [sneak tools tweaks the vanilla masks, including nightingale and dark brotherhood. Those got the tweaked enchant, the new model if any, and can be used with circlets.]\r<br />NO other mod-added helmet or hood added by mods should be compatible with circlets, unless they are intended to in the first place. [hoods from tribunal robes, for example] You can still try to use [url=http://skyrim.nexusmods.com/mods/9457/?]this older iteration of circlets with helmets[/url] that is made by a different person. It has an esp to equip circlets with ANY helmet, modded or not, but they won&#39;t show when equipped. Also untested if used with this patch.\r<br />[color=ffff00]If using this mod with Sneak Tools or Sneak Tools Patch, place it AFTER sneak tools.esp and both masks/hoods addons- this should keep edits to the enchantments and use Navida1&#39;s meshes, with my tweaks to headgears like the nightingale hood for beast races. Keep in mind that the available model does NOT have a mask for beasts. I recommend the [url=http://www.nexusmods.com/skyrim/mods/33391/]Face Masks of Skyrim[/url] mod so you can cover yours with a black fabric at least :3 Yes, it works. Nice, isn&#39;t it? Screenshot added as proof.[/color]\r<br />\r<br />\r<br />[color=00aaff]There seems to be a bug with Grimdandang0&#39;s circlets with helmets mod. It seems to change the glass helmet to the nightingale hood. I&#39;m not sure if that is true, but i did notice some stray nightingale hoods in the testing hall. This was supposedly fixed in this mod as I didn&#39;t experience it.[/color]\r<br />\r<br />I strongly recommend the mod [url=http://skyrim.nexusmods.com/mods/27064/]KDCirclets Redone by zzjay[/url], since it adds many new circlets originally created for TESIV Oblivion and they also seem to work properly with this merged esp. Just be sure to put it above this esp, to be on the safe side.\r<br />\r<br />\r<br />[center][size=6][color=#ffff00]==FAQ==[/color][/size][/center]\r<br />\r<br />\r<br />Q: My head is invisible when i equip the closed helmets&#33; [steel plate helmet, guard helmet, dwarven helmet...]\r<br />A: You probably have activated in your load order either Grimfandang0&#39;s main esp or any of the Improved closefaced helmets esps, recognized by the prefix &#34;imp_&#34;. You don&#39;t need them, JUST the meshes from improved closefaced helmets. Install the mod like i explained a few lines up and you should be fine.\r<br />\r<br />Q: Why are the circlets unequipping my helmet?\r<br />A: Again, you probably have activated navida1&#39;s esps. Read the instalation guide, and ask in the comments page if you have any doubts. I keep a close eye on them.\r<br />\r<br />Q: Why am i downloading other mods for this to work?\r<br />A: Because while navida1 gave permission for her mod to be merged, i don&#39;t want to steal any of the attention her mod deserves. Go there, get the files, endorse it. It&#39;s a great work and deserves at least that much.\r<br />\r<br />Q: But this is increasing my already bloated load order&#33;\r<br />A: No it is not. Did you read the instalation process? You can even delete the turned off esps from your skyrim data folder. I know, i already had about 300 esps in my skyrim folder, a handful of them turned off thanks to merging, and skyrim and wrye bash were complaining.\r<br />\r<br />Q: Why can&#39;t i see the circlets?? Whasn&#39;t this supposed to show circlets??\r<br />A: They are showing, believe it or not. I checked when making the esp. Some circlets won&#39;t show because they are fully hidden below the helmet, but you can check that by using TFC console command and getting the camera to clip past the helmet mesh. You&#39;ll see the character&#39;s head, some hair depending on your haircut, the circlet, and the helmet covering it all. Also, it&#39;ll show as equipped in the item menu anyway. If you use any other replacer for the non-closed helmets, they should show up normally with circlets.\r<br />\r<br />Q: Isn&#39;t this overpowered?\r<br />A: It only depends on how you play the game. Set it to legendary and use extra difficulty mods, like dragon combat overhaul, if you need to :) It is primarly for roleplaying and eyecandy purposes.\r<br />\r<br />\r<br />[center][size=6][color=#ffff00]==CHANGELOG==[/color][/size][/center]\r<br />\r<br />0.3 Added Dragonborn helmets - all dragonpriest and dragonpriest-like helmets left to finish.\r<br />\r<br />0.2 includes version 0.9 of Closefaced helmets and version 1.1 of legendary circlets with helms.\r<br />\r<br />\r<br />What does this patch do:\r<br />\r<br />*Make circlets work with opened up helmets that were originally closed. [steel plate, ebony, guards...]\r<br />*Make dragonpriest masks work with both helmets and circlets [at least the vanilla ones. The dragonborn ones weren&#39;t tested. A lot of clipping happens if you&#39;re not playing a beast race, tho.]\r<br />*Lets followers use circlets with general headgear\r<br />\r<br />\r<br />What this patch DOESN&#39;T do:\r<br />\r<br />*Add circlets + helms option for the mod Immersive Armors. You still need this esp from Circlets with helms and place it ABOVE this esp.\r<br />*Adds open open masks, dragonpriest or not. [this is Navida1&#39;s work. There is an update coming up eventually, be sure of that]\r<br />*Add any meshes to your data folder. You still need all the meshes from Improved closefaced helmets installed. For the options [imperial helmet wihout cloth, tight holes for guard helmets and others], you can install them over the main ICH mod and overwrite the installed models. No, you shouldn&#39;t need an extra esp for that.\r<br />\r<br />\r<br />[center][size=6][color=#ffff00]==CREDITS==[/color][/size][/center]\r<br />\r<br />Thanks to Navida1 for the open helmet models and the mod Improved Closefaced Helmets.\r<br />Thanks to grimfandang0 for the tweaks in both skyrim&#39;s and its dlcs helmets, and the helmets from immersive armors.\r<br />Thanks to hothtrooper44 and anyone who helped him in the immersive armors mod for putting that collection together.\r<br />Thanks to tes5edit and its creators for letting me merge those mods.\r<br />Thanks to bethesda for making Skyrim and making sure it is a modable game.\r<br />Thanks to Izea for imperial full helmet meshes for khajiits from the mod [url=http://www.nexusmods.com/skyrim/mods/37259/]Open Imperial Full Helmet[/url]\r<br />\r<br />I own none of the used meshes or esps, and got permission from both navida1 and grimfandang0 to use their esps.\r<br />Immersive Armors and Falskaar have their own patches, but rely on the main mod for keywords, armor addons and maybe more. Some meshes were included for the IAv7 patch with permissions from Navida1 - You still need to download meshes from Improved Closefaced Helmets to make this work and it&#39;ll stay like so for a good time. Go endorse Navida&#39;1&#39;s work&#33;\r<br />\r<br />[quote] [size=1]FOR POSTERITY:\r<br />This was done in the following way;\r<br />Loaded all related esps in tes5edit, first circlets with helms, then improved closefaced helms SPECIFICALLY IN THIS ORDER.\r<br />Edited the &#34;closed&#34; helms in all esps the BOD2 area, leaving only &#34;hair&#34; and &#34;body addon 2&#34; for all of them in every esp, removing any other setting there.\r<br />Merged them all with the merging plugin.\r<br />This was done through trial and error on my first tes5edit use. If anyone has any suggestion to improve this, please say it.\r<br />\r<br />Sometimes the Armor Addon also needs to be checked for the circlet flag - if only the ARMO entry is checked, the circlet will be equiped but won&#39;t appear under the helmet.[/size][/quote]\r<br />\r<br />\r<br />[size=1]\r<br />How it works:\r<br />Yes, i&#39;ve been learning more and more about how Skyrim and modding it works.\r<br />Basically, most helmets will be fine with a simple edit on the CK/tes5Edit and removing the circlet flag on the helmet in question. Other times it&#39;s not that easy. You need to open up the mesh in nifskope and make sure that its slot is also stated there to be just a helmet. if it covers something else too/entirely, it might not display properly in-game. Believe me, i had one heck of a headache fixing some dragonpriest masks. You do that by selecting a mesh, clicking on &#34;BSDismemberSkinInstance&#34;, and then Partitions on the lower part of the window. There, you&#39;ll see the line &#34;BODYPART&#34;, and you need to make sure it&#39;s NOT linked to the circlet slot [unless it IS a circlet or mask or something] and neither to something too random (slot 52 is a bad choice for head accessories. Just saying. There is a guide out there for making things more compatible by giving each unused slot a proper &#34;position&#34;) [/size]",
  "categoryId": "84",
  "version": "0.3",
  "author": "emieri00",
  "createdUnix": "1376060185",
  "updatedUnix": "1398443210",
  "containsAdultContent": false,
  "uploadedBy": "emieri00",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000045563",
      "name": "Improved Closefaced Helmets with circlets - Legendary Edition",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Improved Closefaced Helmets with circlets - Legendary Edition-39988-0-1.7z",
      "uploadedUnix": "1376059717",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/3a16641c97d0c49ee262b7fe62b0904205849544834c5f39475c471f87f8ab45/analysis/1407675549/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Closefaced%20Helmets%20with%20circlets%20-%20Legendary%20Edition-39988-0-1.7z?fid=1000045563&ttl=1535820473&ri=8192&rs=8192&setec=df29b3dbeed435e4509e16279948b311"
    },
    {
      "fileId": "1000048326",
      "name": "Improved Closefaced Helmets with Circlets - Legendary Edition",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Improved Closefaced Helmets with Circlets - Legendary Edition-39988-0-2.7z",
      "uploadedUnix": "1377003163",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/aee142a31a1b5fade94b9e7e6ac5850a7590ddcd4640a44f7a5e6a6d3604bf4a/analysis/1407690255/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Closefaced%20Helmets%20with%20Circlets%20-%20Legendary%20Edition-39988-0-2.7z?fid=1000048326&ttl=1535820474&ri=8192&rs=8192&setec=029ab0f4c1998b24e61f94c4425ee4f4"
    },
    {
      "fileId": "1000092445",
      "name": "Improved Closefaced Helmets with Circlets - Legendary Edition",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Improved Closefaced Helmets with Circlets - Legendary Edition-39988-0-3.7z",
      "uploadedUnix": "1390249948",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/e56a5b4155177603d6f7f950331b935a8c78b1fbdab962bd537c023bfcc90b98/analysis/1407894485/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Closefaced%20Helmets%20with%20Circlets%20-%20Legendary%20Edition-39988-0-3.7z?fid=1000092445&ttl=1535820474&ri=8192&rs=8192&setec=d083c4577f194db6430af4f5a57a9bb6"
    },
    {
      "fileId": "1000105431",
      "name": "Improved Closefaced Helmets with Circlets - Falskaar Patch",
      "version": "0.1FS",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Improved Closefaced Helmets with Circlets - Falskaar Patch-39988-0-1FS.rar",
      "uploadedUnix": "1397835301",
      "modVersion": "0.1FS",
      "virusScanUrl": "https://www.virustotal.com/file/a8034b8265efa3537dd8cd458ef24d6a1855a083ea64901c0f62dce2f966c113/analysis/1408028012/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Closefaced%20Helmets%20with%20Circlets%20-%20Falskaar%20Patch-39988-0-1FS.rar?fid=1000105431&ttl=1535820475&ri=8192&rs=8192&setec=18cc45771f2ab816f2cb955566aecbcf"
    },
    {
      "fileId": "1000106088",
      "name": "Improved Closefaced Helmets with circlets - Khajiit addon",
      "version": "0.3K",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "44",
      "fileName": "Improved Closefaced Helmets with circlets - Khajiit addon-39988-0-3K.7z",
      "uploadedUnix": "1398173670",
      "modVersion": "0.3K",
      "virusScanUrl": "https://www.virustotal.com/file/b5c5e5d77950cbbb27d33d04a41d79873a02e499b46b9dd8014aa997706d31b4/analysis/1408035003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Closefaced%20Helmets%20with%20circlets%20-%20Khajiit%20addon-39988-0-3K.7z?fid=1000106088&ttl=1535820475&ri=8192&rs=8192&setec=52c483a6efcd624e047cb4f2aed5877c"
    },
    {
      "fileId": "1000106432",
      "name": "Improved Closefaced Helmets - Immersive Armors",
      "version": "0.1IAv7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "609",
      "fileName": "Improved Closefaced Helmets - Immersive Armors-39988-0-1IAv7.rar",
      "uploadedUnix": "1398392706",
      "modVersion": "0.1IAv7",
      "virusScanUrl": "https://www.virustotal.com/file/d9cb5b79c9c705ff44e8e9b35d4fb5007881f051c7e56c017aca36ac94042e6b/analysis/1408039684/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Closefaced%20Helmets%20-%20Immersive%20Armors-39988-0-1IAv7.rar?fid=1000106432&ttl=1535820476&ri=8192&rs=8192&setec=ebbe3f9ec2df012d3e0ae5c31dcf9ed9"
    },
    {
      "fileId": "1000106523",
      "name": "Improved Closefaced Helmets - Immersive Armors v7",
      "version": "0.2IAv7",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "609",
      "fileName": "Improved Closefaced Helmets - Immersive Armors v7-39988-0-2IAv7.rar",
      "uploadedUnix": "1398443210",
      "modVersion": "0.2IAv7",
      "virusScanUrl": "https://www.virustotal.com/file/164f5a55258f07d6188be50a2bad4c5f6989d4aff26a5d4fd17ca822a27e2308/analysis/1408040825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Closefaced%20Helmets%20-%20Immersive%20Armors%20v7-39988-0-2IAv7.rar?fid=1000106523&ttl=1535820476&ri=8192&rs=8192&setec=c53768a1231228f111578adfbbee0528"
    }
  ]
}