{
  "modId": 40014.0,
  "modName": "Save before Battle with Tsun and Alduin",
  "summary": "An Orc saved before fighting Tsun and Alduin.",
  "descriptionHtml": "EDIT: My choices in Season Unending favored the Empire, but you can side with the Stormcloaks if you wish.\r\n\r\nAn Orc saved before fighting Alduin. No other quests done that I\\'m aware of. After leaving Sovngarde, you are free to side with anyone in the civil war, Destroy or Restore the Dark Brotherhood, etc.  \r\nDisclaimer:\r\nElder Scrolls (Dragon) was spawned, not taken, and a few quests were skipped using the console, because I did the College of Winterhold questline before I lost my savegame and had no wish to do it again. Other than that, if there are any problems, please let me know.\r\n\r\nEnjoy!\r\n\r\nRequirements (or rather optional):\r\nDragonborn DLC (killed the Cultists and have Cultists\\' Orders)\r\nSKSE (.skse file included)\r\n\r\nName of Character: Xenoxage\r\nRace: Orc\r\nConsole Commands used: psb, player.advskill and player.additem f (Spells, Skills and Gold). I recommend using SkyUI, found here:\r\nhttp://skyrim.nexusmods.com/mods/3863//?\r\n\r\nFAQ:\r\nWhy post a save before fighting Alduin?\r\nI found the story quests boring. Only liking the fight with Tsun and Alduin. So I uploaded this.\r\n\r\nWhy skip the quest where you get the Elder Scroll?\r\nLike I said above, the Main Quest was boring and I didn\\'t want to be a College of Winterhold student yet.\r\n\r\nI hate your character\\'s name and/or I hate the orc race.\r\nNot a problem. Just type showracemenu in the console. Changing race WILL change your skills back. Using the player.advskill codes will change it back to normal.\r\n\r\nIn a way, this is a God Save and I had (very little, but still) fun making this save. Enjoy and have fun!",
  "categoryId": "43",
  "version": "1.0",
  "author": "guguy00",
  "createdUnix": "1376117156",
  "updatedUnix": "1376117144",
  "containsAdultContent": false,
  "uploadedBy": "guguy00",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000045794",
      "name": "Xenoxage",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2139",
      "fileName": "Xenoxage-40014-1-0.rar",
      "uploadedUnix": "1376117144",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c520c79b59e3c381e4b56c93597ab5cc053f1c2c02438689c8bddf80105c10bf/analysis/1407676700/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Xenoxage-40014-1-0.rar?fid=1000045794&ttl=1535820513&ri=8192&rs=8192&setec=e411813a3f380617ac7d8501b6140150"
    }
  ]
}