{
  "modId": 40056.0,
  "modName": "Nilheim as a Player Home",
  "summary": "Nilheim is a non-respawning, Nordic tower on a ridge in the northern Rift.  It is situated between  Lake Gear and the spectacular cliffs and waterfalls that plunge down to Darkwater Crossing.  Since it\\'s time as a haven for bandits it\\'s been spruced up and can provide a nice home for the Dovahkiin with some of Skyrim\\'s most beautiful views",
  "descriptionHtml": "NILHEIM AS A PLAYER HOME\r\n\r\nNilheim is a Nordic Tower on a high ridge in the north Rift.  It has a small non-repeatable dungeon quest and does not respawn afterwards.  I had been looking for a nice attractive spot with good views to make a house mod in the area.  I finally decided that Nilheim was really one of the best spots.  It’s between a lake and cliffs with waterfalls and has fantastic views all around.  I decided to add some elements to convert the tower to a useful and comfortable player abode.\r\n\r\nWarning:  If you have not done the Nilheim quest this mod will alter that quest.  I did not mess with the bad guys, so downloading this to avoid the quest probably won’t work.  I have replaced all the containers though to make sure they will not respawn and are safe for storage.   If you haven’t already, I recommend you do the original quest, then leave to a nearby area, save\tyour game, then load this up.  \r\n\r\nNilheim was and still is a no-load location. I have added all crafting areas to either the tower (alchemy and enchanting) or the nearby eating area. I added two more floors to the tower (along with insane navemesh) for the bedroom and high viewing deck.  There is also a hot shower/tub created using scavenged dwemer technology (thank the gods for the dwemer, who, if nothing else, keep the people of  Skyrim a much cleaner race).   Other features are a covered cliff-side deck, a dock and boat on the lake, and a jumble of logs across the stream outlet to the west for you Frostfall types for a quick jog to Ivarstead.\r\n\r\nNote: Nilheim might be a destination in the occasional radiant quest.  It would probably be best to reload a saved game and ask for the quest again to get a different location.  These quests are notorious for screw-ups even in the vanilla game.\r\n\r\nIf you like this you might like to check out my other mod:\r\n[url=http://skyrim.nexusmods.com/mods/38779/] Riverwood Tower and Tunnels [/url]\r\n\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "scon27",
  "createdUnix": "1376217864",
  "updatedUnix": "1376178176",
  "containsAdultContent": false,
  "uploadedBy": "scon27",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000045949",
      "name": "Nilheim as a Player Home",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "82",
      "fileName": "Nilheim as a Player Home-40056-1-0.rar",
      "uploadedUnix": "1376178176",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6a411fdab63e16d0b11e1915be6c97dd1d1eda513d88f600531d3841b19bd543/analysis/1407677659/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nilheim%20as%20a%20Player%20Home-40056-1-0.rar?fid=1000045949&ttl=1535820554&ri=8192&rs=8192&setec=f2bd8dab8f14381175138f15476dd7e0"
    }
  ]
}