{
  "modId": 40109.0,
  "modName": "Skyforge weapons compatibility patch",
  "summary": "A compatibility patch so the mod \\'\\'Skyforge weapons\\'\\' is balanced with all other weapons when Sky-Re is installed.\r\n\r\n- NOT GUARANTEED TO INSTALL CORRECTLY VIA NEXUS MOD MANAGER!!!",
  "descriptionHtml": "A compatibility patch so the mod \\'\\'Skyforge weapons\\'\\' is balanced with all other weapons when Sky-Re is installed. This is quite simple really, it doubles the damage value for all Skyforge weapons when Sky-Re is installed so that they are balanced with other weapon types. Now they have more damage out than Steel weapons, but are in the category they would be without Sky-Re installed. I merely did this for myself as I found it irritating to have such beautiful weapons weaker than Iron, and decided to upload it as I could not find any other mods doing the same. \r\n\r\nNote: You may or may not have to install this, it was merely a fix for myself as Skyforge weapons were incredibly weak, you may also have this problem - if so, install. If not, then you\\'re indeed lucky or I am unlucky, and you need not install this as it will most likely change nothing. \r\n\r\nRecommendations: I highly suggest you download Skyforge weapons (Created by Dreogan) and Skyrim Redone (Created by T3ndo and all authors that helped in providing mods) if you haven\\'t already! Another great mod that goes with this is AMidianBorn Book of Silence (Created by CaBaL120), just make sure not to install the Skyforge weapons re-texture!\r\n\r\nCopyright: I did not claim to have created the mods \\'\\'Skyforge weapons\\'\\' and \\'\\'T3nd0\\'s Skyrim Redone\\'\\' nor do I claim to have helped in its making in any way, all I have done is changed the damage input for the \\'\\'Skyforge weapons\\'\\' weapons. You can find the mod either on Skyrim nexus here http://skyrim.nexusmods.com/mods/36815//? and Skyrim redone at http://skyrim.nexusmods.com/mods/9286/? or at the Skyrim workshop. I highly suggest you download both mods!\r\n\r\n- NOT GUARANTEED TO INSTALL CORRECTLY VIA NEXUS MOD MANAGER!!!",
  "categoryId": "84",
  "version": "1.0",
  "author": "Mini Mongo",
  "createdUnix": "1376258079",
  "updatedUnix": "1376258070",
  "containsAdultContent": false,
  "uploadedBy": "minimongo7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000046192",
      "name": "Skyforge weapons compatibility patch",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Skyforge weapons compatibility patch-40109-1-0.zip",
      "uploadedUnix": "1376258070",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5a082294c6eea59d8f7b5e7bd89dc5e216a72908c50c8b925fe34f0acde279ff/analysis/1407678855/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyforge%20weapons%20compatibility%20patch-40109-1-0.zip?fid=1000046192&ttl=1535820701&ri=8192&rs=8192&setec=06b7f19fe8b5746bb8b289bf7415c465"
    }
  ]
}