{
  "modId": 4016.0,
  "modName": "Character Magicka and Destruction Model",
  "summary": "Excel spreadsheet to guide choices on magicka vs regen vs reduced cost. Spell efficiency and DPS, and generally providing a workup of all magicka related effects and destruction damage for your character.\r\n\r\nBased on an old version of Skyrim - newer patches may, or may not, have changed these mechanics (I don\\'t know)\r\n\r\nIt answers questions like \r",
  "descriptionHtml": "Warning: Based on an old version of Skyrim - newer patches may, or may not, have changed these mechanics (I don\\'t know)\r\n\r\n**The Questions**\r\n\r\n 1. What are my character\\'s derived stats? (regen time etc)\r\n 2. What will each magicka and destruction enchanting effect do to my overall character?\r\n 3. How is my damage output effected by choosing different spells?\r\n 4. How does cast speed effect my damage? (very important at -100% cost)\r\n 5. What is my effective spell cost after perks, equipment and skills?\r\n\r\n\r\nSoon after I started playing Skyrim I wondered whether it was more efficient to get more magicka or more magicka regen.\r\n\r\n***How should I balance them? Ahhhhh***\r\n\r\nI then started delving more deeply into it, and started also considering issues like sustainable damage output (from regen) vs. high initial damage output (from a large magicka pool). I also was no way near being able to enchant -100% cost equipment, and so I still had a major trade-off to decide on.\r\n\r\nHigher ranked Spells get more magicka inefficient. I then had to try and see how much additional DPS that extra cost was worth, and how it effects my sustainable effectiveness.\r\n\r\n***Choices, choices and choices.***\r\n\r\nI attempted to answer these questions. In the spirit of sharing useful information, I have uploaded my spreadsheet where you can see how your own character is doing - what her vitals are!\r\n\r\nAnd dispelling myths over destruction: DPS with Thunderbolt is ~187/s, at range - not too bad, eh?\r\n\r\nThe sheet is locked with no password to protect formulas. Unlock through the \\\"Review Tab\\\".\r\n",
  "categoryId": "39",
  "version": "1",
  "author": "Mallard7",
  "createdUnix": "1324223242",
  "updatedUnix": "1324223338",
  "containsAdultContent": false,
  "uploadedBy": "mallard7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "11711",
      "name": "V1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45",
      "fileName": "V1-4016-1.7z",
      "uploadedUnix": "1324223338",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/7948b60e646542512a87fd8afa738019b896b1339edd358f647edede37e292f8/analysis/1406533691/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/V1-4016-1.7z?fid=11711&ttl=1535759495&ri=8192&rs=8192&setec=e81a31c01f72e0da03ad4005f68f17bb"
    }
  ]
}