{
  "modId": 40171.0,
  "modName": "Druid Spells - Sun Moon and Star",
  "summary": "Adds a collection of Druid Alteration spells, one Conjuration and one Illusion spell to the game.",
  "descriptionHtml": "[center][color=darkorchid][size=10] Sun, Moon and Star\r<br />\r<br />Druid Spells\r<br />\r<br />Starlight, Moonlight and Sunlight[/size][/color]\r<br />\r<br />by\r<br />\r<br />[b]Shadowblade001[/b]\r<br />\r<br />Ver 2.01\r<br />\r<br />Updated 24th December, 2013\r<br />\r<br />\r<br />[color=yellow][size=5]This mod is a Nexus Exclusive[/size][/color]\r<br />\r<br />\r<br />\r<br />This is a Mini Quest and Spell mod\r<br />\r<br />Compatible with Dawnguard, but does not require it.\r<br />\r<br />\r<br />This is the first mod I ever made for Skyrim, for my Nordic Rune Witch Druid character Ansfrida Eyowulfsdottir.\r<br />\r<br />[url=http://www.youtube.com/watch?v=tHGtpRsLAEA]See a version the mod in action here.[/url]\r<br />\r<br />This is an updated overhaul of the original mod.\r<br />\r<br />Please report any errors or bugs as well as any opinions on power and balance. If you like it, let me know, if you don’t, let me know why.\r<br />[/center]\r<br />\r<br />\r<br />\r<br />\r<br />[color=Steelblue][size=2]Introduction[/color][/size]\r<br />Druids have no power over Undead and other vile abominations of Unlife, except for those things found in the natural world - the power of Fire and Lightning from ground and sky, a sturdy stake from the heart of a mighty oak, running water from the skies and ground, silver and garlic from the clean, deep Nirn and light from the cleansing Sun.\r<br />\r<br />So for those playing a priest or priestess of Nature with no Perks in Restoration and no Necromantic powers from Conjuration, these spells complement the Druid&#39;s arsenal.\r<br />\r<br />One of my other mods, [url= http://skyrim.nexusmods.com/mods/41861/]&#34;The Ancient Art of Silver weaponsmithing&#34;[/url] also allows you to smith weapons of silver and mithril, including scimitars (and crossbows with the DG add-on), so your Druids will have some more traditional items at their disposal.\r<br />\r<br />\r<br />**IMPORTANT**\r<br />If you want Magelight to be multi-castable, you will need [url=http://skyrim.nexusmods.com/mods/12845/]Magelight Multi Cast[/url] by Touriste. Moonlight is no longer multi-castable as it’s power has been increased in other ways.\r<br />**IMPORTANT**\r<br />\r<br />\r<br />[color=Steelblue][size=2]Spells[/color][/size]\r<br />[color=orangered]Location of Tomes[/color]\r<br />The spell tomes have been placed in the game via two mini-quests.\r<br />\r<br />The location of the [i]Summon Spirit Wolf[/i] tome can be found by investigating a corpse on the side of the road as you approach the Guardian Stones after leaving Helgen and reading her journal. She also has a few items useful to a Ranger type, especially anyone using the &#34;Camping in the Woods&#34; start with [url=http://www.nexusmods.com/skyrim/mods/9557/]Live Another Life[/url] by Arthmoor.\r<br />\r<br />The locations of the [i]Starlight[/i], [i]Moonlight[/i] and [i]Sunlight[/i] Tomes can be found by locating a corpse on a dangerous path outside Riverwood and reading their journal (yes, I recycle a lot of my plot-lines until I can develop new modding skills&#33;)\r<br />\r<br />\r<br />[color=orangered]Improvements[/color]\r<br />Amongst other improvements, the levels of Moonlight and Starlight have been switched compared with version 1.0 and the effects changed.\r<br />\r<br />[font=&#34;courier&#34;][b]\r<br />Spell _ _ _ _ _ _ _ _School _ _ _ Level _ _ SP _ MAG _Area _ _DUR _ _Casting Time _ Cost[/b]\r<br />Starlight _ _ _ _ _ _Alteration _ Adept _ _225 _ _1 _ _120 _ _ 60 _ _ _ _1.5 _ _ _ _ 350 gp\r<br />Moonlight _ _ _ _ _ _Alteration _ Expert _ 450 _ 44 _ _ 90 _ _ 30 _ _ _ _2.0 _ _ _ _ 650 gp\r<br />Sunlight _ _ _ _ _ _ Alteration _ Master _ 900 _ 50 _ _ 60 _ _ _4 _ _ _ _3.0 _ _ _ _1000 gp\r<br />Summon Spirit Wolf _ Conjuration _Expert _ 500 _ _0 _ _ _0 _ _ 60 _ _ _ _2.0 _ _ _ _ 750 gp\r<br />[/Font] \r<br />\r<br />\r<br />[color=orangered]Improvements to Spell Effects[/color]\r<br />Various effects and re-colourations have been used to distinguish the spells from Vanilla effects and make them more interesting and in keeping with what they do. I’d like to thank various people at Bethesda forums who helped with this, including Blacky and mojo22 . If I have forgotten anyone, please let me know&#33;\r<br />\r<br />[size=2][color=Lightsteelblue][i]Starlight[/i][/color][/size] (Adept)\r<br />The stars of the firmament illuminate all creatures within 120 feet for 60 seconds. Undead will slowly burn in the light.\r<br />\r<br />This spell now not only lights up all living and non-living creatures in range but will also slowly burn any Undead in it’s silvery light with low level damage per second. While useful for nocturnal Rangers and Hunters in the Wilderness, care must be taken with this spell&#33; It will also light up your followers and will turn any Undead in range hostile as against Undead it is considered an attack. It will not do any damage to living creatures, animals or NPCs.\r<br />\r<br />\r<br />[size=2][color=Skyblue][i]Moonlight[/i][/color][/size] (Expert)\r<br />Meridia&#39;s wrath bathes the area for 30 seconds. All but the most powerful Undead are transfixed by Meridia&#39;s beauty.\r<br />\r<br />[i]Moonlight[/i] now Fascinates Undead. Instead of just a longer-lasting [i]Magelight[/i], this spell will hold Undead in place until the spell wears off unless they are attacked first.\r<br />\r<br />Thanks to various people at Bethesda forums for help with the scripts to transfix the targets, including Chesko and Cruelflames\r<br />\r<br />Undead will also turn to face the Moonlight Orb when Fascinated.\r<br />Thanks to hypno88 at the Bethesda forums for helping create the spell marker for this.\r<br />\r<br />[i]Moonlight[/i] is not multi-castable in version 2.0 and is designed to dispel [i]Starlight[/i] and [i]vice versa[/i]\r<br />\r<br />\r<br />[size=2][color=Yellow][i]Sunlight[/i][/color][/size] (Master)\r<br />The power of the Sun cleanses even the deepest dungeon recesses of the vile Undead, which burn in the light of it&#39;s purifying rays for 4 seconds.\r<br />\r<br />The effect will not shine through walls, coffins etc, but will affect Undead behind you if you are surrounded. Low level Undead will be turned to ash, high level Draugr Death Overlords and Vampires will be damaged but will keep on coming (does not Turn Undead). The spell also has some new burning effects added.\r<br />\r<br />\r<br />[color=Forestgreen][size=2][i]Summon Spirit Wolf[/i][/size][/color] (Expert)\r<br />A mighty Spirit Wolf is summoned to your aid.\r<br />The Spirit Wolf is not incredibly damaging to enemies, but it is invulnerable to attack and so is dispelled only at the end of the spell’s Duration. It is therefore a very effective decoy.\r<br />\r<br />\r<br />\r<br />[color=Steelblue][size=2]Installation – First Time using this Mod[/color][/size]\r<br />This is a complete overhaul of the original mod (the first I ever did, so the original was a bit simple).\r<br />\r<br />If you never used the original, just install the mod as usual:\r<br />\r<br />Download [color=Forestgreen]_shb_Sunray_v2[/color], unzip and copy the contents of the _shb_Sunray folder to:\r<br />\r<br />...Steam/SteamApps/common/skyrim/Data\r<br />\r<br />The [color=Forestgreen]_shb_Sunray_v2[/color] folder contains the _shb_Sunray.esp and a Mesh and Texture folder for the spell effects and a Scripts folder for the spells and mini-quests.\r<br />\r<br />Load order does not matter as each item in the mod is unique, but it should probably go near the end after any other spell mods.\r<br />\r<br />\r<br />The new Tomes will be available for you to find or to console in as you choose. I would suggest that finding them is more fun, however.\r<br />\r<br />\r<br />[color=Steelblue][size=2]Uninstalling[/color][/size]\r<br />Delete the  [color=Forestgreen]_shb_Sunray.esp[/color]\r<br />Delete all folders in Meshes and Textures starting with [color=Forestgreen]_shb_Sunray[/color]\r<br />Delete all scripts in the Scripts folder beginning with the prefix [color=Forestgreen]_shb_SUN_[/color]\r<br />Delete all Source files in ScriptsSource starting with  [color=Forestgreen]_shb_SUN_[/color]\r<br />\r<br />\r<br />[color=Steelblue][size=2]Known Issues[/color][/size]\r<br />For some reason the Vanilla spell [i]Magelight[/i] does not have it’s duration increased by the Alteration perk Stability. However, other Alteration spell effects associated with duplicates of the [i]Magelight[/i] MGEF ARE increased in duration. Therefore, the visual effects may wear off before other affects.\r<br />\r<br />E.G., the visual effects of the [i]Moonlight[/i] spell will wear off after 30 seconds, but if you have the Stability perk, the Fascination effect will wear off after 45 seconds. I cannot find a work-around for this as yet.\r<br />\r<br />As intended, the [i]Fascinate[/i] effect WILL be dispelled as soon as you attack any Fascinated Undead.\r<br />\r<br />[i]Moonlight[/i] is designed to dispel itself if cast when another casting of the spell is already in effect. However, as intended, the new casting will simply replace the original casting.\r<br />\r<br />[i]Moonlight[/i] will dispel [i]Starlight[/i] and [i]Starlight[/i] will dispel [i]Moonlight[/i] in order not to stack their visual effects or to be able to immobilise undead as they slowly burn. This works as intended. However, multiple castings of [i]Starlight[/i] do not dispel each other as intended so the smouldering effects and damage will stack.\r<br />\r<br />Any suggestions to get around this are highly appreciated.\r<br />\r<br />\r<br />~.~",
  "categoryId": "75",
  "version": "2.03",
  "author": "Shadowblade001",
  "createdUnix": "1376340412",
  "updatedUnix": "1388867077",
  "containsAdultContent": false,
  "uploadedBy": "Shadeybladey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087232",
      "name": "_shb_Sunray_v2",
      "version": "2.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8716",
      "fileName": "_shb_Sunray_v2-40171-2-00.rar",
      "uploadedUnix": "1387347435",
      "modVersion": "2.00",
      "virusScanUrl": "https://www.virustotal.com/file/9ac574521bc66691383086892abc7d5d7f9c3981070814e017d67b7a6eb4a403/analysis/1407847454/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/_shb_Sunray_v2-40171-2-00.rar?fid=1000087232&ttl=1535820770&ri=8192&rs=8192&setec=50cb48cd25b3e8fdf17c750677a96195"
    },
    {
      "fileId": "1000089909",
      "name": "_shb_Sunray_v2_03",
      "version": "2.03",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "880",
      "fileName": "_shb_Sunray_v2_03-40171-2-03.rar",
      "uploadedUnix": "1388867077",
      "modVersion": "2.03",
      "virusScanUrl": "https://www.virustotal.com/file/cf2aea58ed14182051d38384ec5d521f979d86eea78e02ea1261eb847ec7833f/analysis/1407872147/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/_shb_Sunray_v2_03-40171-2-03.rar?fid=1000089909&ttl=1535820771&ri=8192&rs=8192&setec=6586398c7db95834c96ad91ee2ad83b1"
    }
  ]
}