{
  "modId": 40194.0,
  "modName": "SAO Kirito",
  "summary": "Kirito from Sword Art Online",
  "descriptionHtml": "For your sake, you\\'d better read the whole description if you plan on downloading this save file\r\n\r\n\r\n\r\nAdds the closest thing to Kirito that I could make with everything that was available to me as a save game. This is by no means perfect, partly because I could not find a mod that contained Kirito\\'s outfit from mid to end SAO story arch and was carried over to the Alfheim Online story arch. Please note, you will need several mods to get this save to work. Start beginning game, outside Embershard Mine.\r\n\r\nMods that are definitely required are: RaceCompatibility (should come with one of the other mods), Hair packs of TES IV Oblivion for Male Only - OblivionMaleHairs 01 by Radioragae, The Ashen Race - HD (I used the CBBEv3 file but it should work with any of them) by Seren4xx and RadioRagae, Sword Art Online Weapons Pack by Jennifur68, Duelists Longcoat by str8maverick, and the XP32 Maximum Skeleton mod by xp32 (please note that I used the NMM and Bain version of this skeleton mod)\r\n\r\nRaceCompatibility by TMPhoenix:\r\nhttp://skyrim.nexusmods.com/mods/24168\r\n\r\nTES IV Oblivion for Male Only by Radioragae:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=17993\r\n\r\nThe Ashen Race - HD by Seren4xx and RadioRagae:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=8583\r\n\r\nSword Art Online Weapons Pack by Jennifur68:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=26382\r\n\r\nDuelists Longcoat by str8maverick:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=34051\r\n\r\nXP32 Maximum Skeleton mod by xp32:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=26800\r\n\r\nAll rights for the mods go to their respective owners/creators. All rights to Sword Art Online, it\\'s logo, characters, weapons, etc. goes to it\\'s respective copyright owners. All I am is a fan of the anime wanting to bring a character into Skyrim. If for some reason this save is taken off of the Nexus then it will be because one of the owners of either the mods or Sword Art Online or a member of the Nexus staff wish it to be removed. I will never argue with the respective owners of any material used or with a member of the Nexus staff. If it is what they wish, then it shall be done.\r\n\r\nPlease note: I use the Dawnguard DLC, but I am not entirely certain that it will affect the save if all the mods mentioned above are installed properly.\r\n\r\n\r\nEdit: Because the question was rightly brought up in the comments, this attempt of creating Kirito is based off of the Sword Art version of the character. Hence, my use of the Ashen race as opposed to one of the Bethesda made Elven races or one off of the Nexus. Sorry if this has caused any confusion.",
  "categoryId": "43",
  "version": "1.0",
  "author": "frakker15",
  "createdUnix": "1376357808",
  "updatedUnix": "1376357798",
  "containsAdultContent": false,
  "uploadedBy": "frakker15",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000046466",
      "name": "Sword Art Online Kirito Save",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Sword Art Online Kirito Save-40194-1-0.rar",
      "uploadedUnix": "1376357798",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5dcaeafae1db66e2896d7fd024b738ad002f0eeec2159d1fc9cd0d5faa294b86/analysis/1407680439/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sword%20Art%20Online%20Kirito%20Save-40194-1-0.rar?fid=1000046466&ttl=1535820795&ri=8192&rs=8192&setec=5f48821b3853ac97619f57707a0af2b9"
    }
  ]
}