{
  "modId": 40199.0,
  "modName": "Wearable Greybeards Robes",
  "summary": "This mod adds a full set (Hood, tunic, boots, and bandages) of Greybeard robes.  Excluding the bandage, they all have the blessing of Talos, and decrease shout cool-down time by 20% each.",
  "descriptionHtml": "This mod adds a full set (Hood, tunic, boots, and bandages) of Greybeard robes.  Excluding the bandage, they all have the blessing of Talos, and decrease shout cool-down time by 20% each.  These spawn in High Hrothgar in the room where the four Greybeards sleep.  There is a container that doesn\\'t say steal from, but rather search.  You will find the robes in there.  The robes can not be disenchanted,sold, or crafted.  This works for both male and female characters.\r\n\r\nWARNING: For all Greybeard hunters out there, these robes are not unique, and I\\'m pretty sure that the enchantments affects them too, they are extremely deadly with this mod enabled, if the mod is successful enough I will fix this in a later patch.\r\n\r\nDisclaimer: All original file credits go to Bethesda, I take no ownership over these files.  If there is a problem with my registration, please contact me immediately, thank you.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Tunnelunder",
  "createdUnix": "1376374621",
  "updatedUnix": "1376374618",
  "containsAdultContent": false,
  "uploadedBy": "Tunnelunder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000046504",
      "name": "Playablegreybeardrobes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Playablegreybeardrobes-40199-1-0.zip",
      "uploadedUnix": "1376374618",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/14b079383b37fe1a20755fffae6261b7f2d923544ebde95114b9dac61dbdb065/analysis/1407680703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Playablegreybeardrobes-40199-1-0.zip?fid=1000046504&ttl=1535820806&ri=8192&rs=8192&setec=cef750c4a00b33c2b9059fd01ee4bb35"
    }
  ]
}