{
  "modId": 40215.0,
  "modName": "Player Knockout",
  "summary": "Players don\\'t die; they get knocked out.",
  "descriptionHtml": "[center]MODS BY INTARWEBZ\r\n[url=http://skyrim.nexusmods.com/mods/39945/?]SKYRIM UNBOUND[/url] • [url=http://skyrim.nexusmods.com/mods/40215/?]PLAYER KNOCKOUT[/url][/center]\r\n\r\nThe era of dying and loading from save games is over. Nobody wants that shit anymore. It\\'s not a \\\"challenge\\\", it\\'s \\\"immersion-breaking\\\". Thus, a new mod is born: Player Knockout.\r\n\r\n[heading][color=#83dcd9]I STILL DON\\'T GET IT YET[/color][/heading]\r\nPlayer Knockout prevents the player from dying. Instead, you ragdoll to the floor and take a seven-second nap during which you dream about shouting goats off of cliffs. You don\\'t get teleported anywhere, you don\\'t turn into a ghost. You just [url=http://www.youtube.com/watch?v=q36uaSlf0ck&t=1m27s]get knocked the fuck out.[/url]\r\n\r\n[heading][color=#83dcd9]I BET THIS MOD REQUIRES THE MCM[/color][/heading]\r\nYou\\'re damn right it does. Download [url=http://skyrim.nexusmods.com/mods/3863/?]SkyUI[/url] right now and don\\'t ask any more questions.\r\n\r\nYou\\'ll need to access the Mod Configuration Menu to enable Player Knockout. Once you do, the options become immediately available.\r\n\r\n[heading][color=#83dcd9]IS THIS THE PART WHERE YOU EXPLAIN WHAT THE OPTIONS ARE[/color][/heading]\r\nYes, it is.\r\n\r\n[color=#83dcd9]Calm Attackers[/color]: If you get into a fight with townies or guards or anyone who is not hostile towards you by default, they\\'ll walk away after kicking your ass, confident they taught you a swift lesson. Otherwise, they\\'ll try to teach you twice. (By twice I mean they\\'ll never stop until you kill them. Kill them.)\r\n\r\n[color=#83dcd9]Equipment Drop[/color]: When you get a proper beatdown, you have a 50% chance of dropping an equipped item from either hand and a 25% chance of dropping both. I\\'m also pretty sure that means you have a 75% chance of losing a two-handed weapon. I don\\'t know, I\\'m kind of retarded when it comes to maths. Anyway, the items will fall to the ground, so you can pick them right back up when you recover.\r\n\r\n[i]I wanted to include a drop gold function, but losing a bunch of coins at once only drops a single coin worth whatever you lost and that\\'s no fun. What I really want to do is [url=http://www.youtube.com/watch?v=pI8esTEElrQ]make it rain[/url]. Once I figure out how to make the player up-chuck money like Sonic the Hedgehog, I\\'ll do it.[/i]\r\n\r\n[color=#83dcd9]Temporary Immunity[/color]: When you recover from being knocked out, you\\'ll have about seven seconds where weapons and projectiles will go in and out of you like alcohol through Lindsay Lohan. This puts a stop to the knockout spamming you get with some other anti-death mods that think the obvious solution is to make the player a ghost who inexplicably turns back into a person after spawning an extra dead body on the ground which is naked but somehow holds all of your possessions. I think my way of doing things is a hell of a lot less complicated. Still, if pain is your friend and you actually like getting bitch-slapped over and over again, feel free to disable this.\r\n\r\n[color=#83dcd9]Go to Jail[/color]: This will make it so people who have the authority to send you to prison will do so if they best you in a fight. Be aware this isn\\'t limited to guards; a lot of other people around Skyrim can apparently perform citizens arrests because the game authors put them into crime factions for whatever reason. This will probably result in some tricky situations during civil war quests, but you can enable or disable it at your whim, so just leave it off when you\\'re on an important mission that requires you to run the risk of pissing off city folk if you think winding up in prison might have a detrimental effect on your current goal.\r\n\r\n[color=#83dcd9]Knockout Force[/color]: This determines how extreme the ragdoll physics are. Crank it up to full volume to get tossed around like a hackey-sack. (Even with it set to the highest level, you\\'ll still just crumple to the floor if your health runs out and there wasn\\'t a killing blow (poison, fatigue, bleeding, etc.).)\r\n\r\n[heading][color=#83dcd9]I TRIED OUT THE MOD AND I HATE IT AND I HATE YOU[/color][/heading]\r\nThe same menu toggle that started the mod can be used to turn it off. [color=#ff0000]FOR THE LOVE OF GOD, DISABLE THE MOD IN THE MCM BEFORE YOU UNINSTALL IT.[/color] Otherwise, your character will never die, he or she will just continue to take damage until you get sick of your own life and decide to take it in a fit of rage and amphetamines. Successful disabling will result in a message that tells you to save your game and then quit.\r\n\r\n[heading][color=#83dcd9]I CAN\\'T THINK OF ANYTHING ELSE TO COVER, ALSO IT\\'S 7:50 A.M. AND I HAVEN\\'T SLEPT YET[/color][/heading]\r\nIf you find any bugs or can think of anything else this mod needs, let me know. If you feel like giving me virtual handjobs by telling me how awesome I am for making it, do that too.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Intarwebz",
  "createdUnix": "1376395362",
  "updatedUnix": "1376395360",
  "containsAdultContent": false,
  "uploadedBy": "IntarwebzDotNet",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000046548",
      "name": "Player Knockout",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Player Knockout-40215-1-0.zip",
      "uploadedUnix": "1376395360",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d768a1c0c06bdc04e3f1fe6f8c153d4f183297adef6b653d11494c0ad110f7ed/analysis/1407680774/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Player%20Knockout-40215-1-0.zip?fid=1000046548&ttl=1535820825&ri=8192&rs=8192&setec=f72f4abbbc85d0406736c95ffa8487de"
    }
  ]
}