{
  "modId": 40219.0,
  "modName": "The SUMMER Project",
  "summary": "Think Skyrim Is Awesome? With this guide, it will become even more fascinating! Read, download, install and enjoy a completely overhauled game!",
  "descriptionHtml": "                                                      The S.U.M.M.E.R. Project \r\n                           (Skyrim Ultimate Mod Managing, Enhancement and Recreation) \r\n \r\n\r\n\r\nTable of Contents: \r\n1. Description\r\n2. Installation and Usage\r\n3. Compatibility and Requirements\r\n4. Categories List\r\n5. Mod List under Categories.\r\n6. Tanks to...\r\n\r\n                                                     ////.Description.////\r\nGood day, Ladies and Gentlemen! I am happy to finally present this \\\"Guide\\\", or Ultimate Mod List, on how to transform your game into almost real-life experience! We all know that Skyrim is a wonderful game where combat and quest-completion plays a great role, but we also understand, that this game could be a little bit more \\\"sandbox\\\". Skyrim already has an open world, which is a huge +plus+ to the gameplay itself. Bethesda did a awesome job on creating TES. V, but most people think (Including me, of course), that there is a relatively easy way on how to make TES. V much more charming. Gamers choose mods chaotic, mixing up lore-friendly and lore-unfriendly mods. This guide will help you choose the best mods for making your game more realistic and hardcore (people, who like the crab in the top-hat and monocle type of mods may leave the room right now, and don\\'t even come back here again!), it will combine different types of mods, but be sure, that with all of them installed, Skyrim will fascinate you with its new look and features.\r\nI\\'ve worked on the idea for a few months, finding, downloading (Oh, don\\'t think that this work is easy!) and testing different mods that are presented in this guide. More then 10 defective and useless mods were thrown out to my recycle bin, and more then 60 (65 mods installed, to be accurate) mods left, installed and enjoyed. \r\nThe guide is made not only for novice players, as I realize that something like this would be useful for anybody.At least if somebody helped me to find everything I needed, I would be not only happy, but would even buy a big-big cake for that person!=)\r\nAll mods are provided with links and short descriptions, and are totally downloadable from the nexus server. If somebody has problems with skyrim.nexusmods.com, google.com will definitely do the job! All of these mods are found just by their names. ;-)\r\n\r\n                                         Installation and Usage. Read damn it!!!\r\nI strongly recomend using NMM (Nexus Mod Manager) for installing mods. PLEASE LISTEN TO THIS - I\\'ve learnt it the hard way. In my early experience (When I only started playing the game), I installed mods manually (You throw files from your mod into Skyrim/data), which ment, that in case I wanted to delete some mod completely - I didn\\'t only need to deactivate the esp. file of the mod (This is possible, ofcourse, but some effects of different mods still remain after this), I needed to go to the /data directory and search for hours for the necessary files that had to go in the bin. In the end this all ended with a full re-install of the game and downloading all the mods again... Really, NMM makes life easier. Download link: http://skyrim.nexusmods.com/mods/modmanager//?\r\n\r\nUSE BOSS and BUM (Description will be somewhere down there) to organize your esp. files correctly, so everything goes nice and smooth. Download link: \r\n\r\nUSE SKSE - (Skyrim Script Extendor). This is a wonderful tool that makes a lot of mods run properly. Some mods just require SKSE, and there\\'s nothing we can do about it. Download link:\r\n\r\nUSE Script Dragon (Pretty much the same as SKSE, but more scripts). Some mods run only with SD. This is not necessary - I don\\'t remember any mods from my list that would require that... Anyway, it\\'s a useful tool. Download link:\r\n\r\nLast rule - BACKUP, BACKUP, BACKUP. My poor zombo-box crashed once, you don\\'t need that...\r\n\r\n                                     ////.Compatibility and Requirements.////\r\nAll mods fully compatible with each other, or have compatibility patches available.  Tested on my box! =)\r\n1). Latest Skyrim version Required (Almost for all mods, though there are some exclusions)\r\n2). SKSE. Will be marked as [SKSE] beside mods that require it.\r\n3). DLC\\'s - Dawngaurd (Marked as [DWN]), Dragonborn - [DGB] , Heartfire - [HRT]. Nothing critical if you don\\'t have all DLC\\'s - most of the mods are available for the Standard Skyrim Configuration.",
  "categoryId": "79",
  "version": "1.01",
  "author": "VOppressorV",
  "createdUnix": "1376402247",
  "updatedUnix": "1376402247",
  "containsAdultContent": false,
  "uploadedBy": "VOppressorV",
  "primaryFile": null,
  "files": []
}