{
  "modId": 40254.0,
  "modName": "Rakiir Manor",
  "summary": "A simple player house idyllically situated by a waterfall near Riverwood. Remember? Riverwood, the lovely town you pass after having escaped Helgen at the very beginning and where I had fallen in love with Skyrim. Which is why I chose this location to place my house mod.                          ",
  "descriptionHtml": "A simple player house idyllically situated by a waterfall near Riverwood. Remember? Riverwood, the lovely town you pass after having escaped Helgen at the very beginning and where I had fallen in love with Skyrim.                              \r\nWhich is why I chose this location to place my house mod.\r\nThe house features some pretty valuable stuff that can be discovered quite easily.                    For instance: A Spell Tome for summoning an armored Battle Troll! \r\nThere are two basic characters and further ones in the hidden bath. Including Sauron the Deer :) Also, when you take a look at the waterfall to your left, you\\'ll discover a diving board like the one at the Bard\\'s Leap Summit.\r\nBTW this is my very first mod, so be lenient with me :)\r\n\r\n\r\nIMPORTANT: The Mod doesn\\'t work at all if Hearthfire is not installed. \r\n\r\n\r\nNotes:\r\n\r\nWorks just fine with Dawnguard, Dragonborn and also Hearthfire, but there might be an issue if Dawnguard isn\\'t installed for the house features a Dawnguard exclusive weapon.\r\n\r\nBest combined with http://skyrim.nexusmods.com/mods/34566//? (adult content, nudity) :)\r\n\r\nUpdate Version 1.10: Big Update with lots of clutter and an internal dungeon inhabited by Sauron the Deer\r\nUpdate Version 1.11: Bug Fixes incl. Dark Face Bug and added some small stuff, Effects, Ambient etc\r\nUpdate Version 1.12: Bug Fixes and Enhancements + enhanced Bard (tell me if there is an issue with him)\r\nUpdate Version 1.13: Enhancements + New: Summonable Battle Troll, Book can be found in the house itself (sorry forgot to pack the bsa file :S, gonna reupload version 1.13 properly)\r\nUpdate Version 1.20: Exciting update with Sauron the Deer now being able to follow you!\r\nUpdate: Again forgot to pack something and I cannot access my PC this Weekend, I\\'m very sorry...\r\nUpdate Version 1.21: Small stuff and still working on the issue of Sauron not being able to follow you through doors...\r\n\r\n\r\nInstallation:\r\n\r\nJust download the file, extract it and copy the rakiir.esp as well as the rakiir.bsa into the Skyrim Data Folder and you\\'re good to go.\r\n\r\n\r\n\r\nPS: Don\\'t know how to open the gate and/or find the hidden trap door? Check out the images above (seven last ones)",
  "categoryId": "68",
  "version": "1.21",
  "author": "Paludis",
  "createdUnix": "1376436191",
  "updatedUnix": "1380661708",
  "containsAdultContent": false,
  "uploadedBy": "Paludis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000060433",
      "name": "Rakiir",
      "version": "1.21",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "794",
      "fileName": "Rakiir-40254-1-21.rar",
      "uploadedUnix": "1380661708",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/7934874ded13c59c8f36f70bc2ca3e8d6ae8bda07da3bef28b6699b0295a4794/analysis/1407741860/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rakiir-40254-1-21.rar?fid=1000060433&ttl=1535820859&ri=8192&rs=8192&setec=67c3f0e667c733a208c6ee743f17e4e6"
    }
  ]
}