{
  "modId": 40329.0,
  "modName": "Races Expanded",
  "summary": "A mod that expands the abilities of the player races, such as adding scent abilities and night vision to Khajiit",
  "descriptionHtml": "[b][size=20]Current Status[/size][/b]\r<br />We are not dead&#33; I have been working, tweaking the main mod, cleaning it. And even got the go ahead to add a trio of new quality of life mods by IsharaMeradin, notable Drop That Gold&#33;, In game time hotkey, and Wood chopping to max carry wieight. I am also trying to get a MCM menu working for the mod for better control of the racial powers and a number of other smaller QOL features (like a bullet time/adreniline/VATs like system). But i&#39;m holding off on releasing the next build until i can get Papayrus and the MCM working. If any of you are skilled with Papayrus and want to lend a hand toss me a note \r<br />\r<br />[b][size=20]Mod Origins[/size][/b]\r<br />While looking for mod for my own game I came upon a series of mods for the Khajiit, what this mod does is combine several of those into one mod, as well as a few new ones (for all races) not found on the nexus, all (eventually) controlled by a MCM menu.\r<br />\r<br />[b][color=6A5ACD][size=30]Compatability[/size][/color][/b]\r<br />This Mod only add or changes racial skill so it should be compatible with any other mod, and the only thing you really need to worry about is making sure it&#39;s loaded after any mods that change Khajiit innate abilities and powers.\r<br />Once the MCM menu is complete I would actually advice loading it BEFORE other race changing mods so they overwrite the base races since all the new skills will be added via the menu.\r<br />\r<br />[b][color=6A5ACD][size=30]What This Mod Does[/size][/color][/b]\r<br />For Khajiit it combines the functionality of:\r<br />[url=http://skyrim.nexusmods.com/mods/22909]Khajiit Claws Fix by Yetu[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/22283]Khajiit Sense of Smell by Edg3[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/17438]Adaptive Night Eye by Estioarem[/url]\r<br />All used with permission.\r<br />Acute Hearing power (exclusive to this mod)\r<br />\r<br />[b][color=6A5ACD][size=30]What This Mod Has Planned[/size][/color][/b]\r<br />For Quality of Life:\r<br />[url=http://skyrim.nexusmods.com/mods/26698]Craftable Iron Lockpicks by KennyBall[/url] to the Quality of Life Menu (addition  approved by author, will be incorperated into a future build)\r<br />[url=http://skyrim.nexusmods.com/mods/4020]Move it Damn it by Apogee777[/url] to the Quality of Life Menu (addition  approved by author, will be incorperated into a future build)\r<br />[url=http://skyrim.nexusmods.com/mods/7169]La Femme Lycana Female Werewolf Body by Madcat221[/url] to the Quality of Life Menu (addition  approved by author, will be incorperated into a future build)\r<br />...\r<br />Plus several more QoL Mods I Am currently putting my feelers out for approval to incorporate, this list will be updated once I have those approvals.\r<br />\r<br />Nord:\r<br />“The natives of Skyrim the hearty Nords are well adapted and knowledgeable of their home.”\r<br />(No change) 50% Resistance to Frost\r<br />Battle Cry: can be use as often as you like, last 1/3 as long (10 seconds) but will fear anything irregardless of level\r<br />Wayfarer: The Nords know their home, they have lived here all their lives and thus have a easier time finding their way from place to place (Free toggle Clairvoyance)\r<br />Power On High: This is the home of the Greybeards and the way of the voice is well know among Nord, giving them an advantage over other races when it comes to the th&#39;um (Shouts recharge 10% faster)\r<br />\r<br />Redguard\r<br />“The most naturally talented warriors in Tamriel.” - Skyrim Wiki\r<br />(no change) 50% Resistance to Poison\r<br />Adrenaline Rush: Stamina Regenerates 10x Faster in combat but then 10x slower after combat for 120 seconds as the high crashes.\r<br />Base Armor of 10 even without any armor\r<br />Armor and Weapon Perks have 10% lower requirements\r<br />\r<br />Breton\r<br />“In addition to their quick and perceptive grasp of spellcraft, even the humblest of High Rock&#39;s Bretons can boast a resistance to magic.” - Skyrim Wiki\r<br />(no change) 25% Resistance to Magic\r<br />Dragonskin: Absorb 10% of Magika of all incoming spells (always on)\r<br />Base Armor (but only for magic) of 10\r<br />Magic and Alchemy Perks have 10% lower requirements\r<br />\r<br />Imperial\r<br />“Imperials are also known for the discipline and training of their citizen armies, and their respect for the rule of law. Though physically less imposing than the other races, the Imperials have proved to be shrewd diplomats and traders, and these traits, along with their remarkable skill and training as light infantry, have enabled them to subdue all the other nations and races and erect the monument to peace and prosperity that comprises the Glorious Empire.” - Skyrim Wiki\r<br />(no change) Find more gold then usual\r<br />Voice of the Emperor: Out of combat: all nearby people are calmed for 30 seconds, in combat reduces threat, auto activates when shouting.\r<br />Bonus to all skills for all companions or followers with you of +2 per followers, to a max of +10\r<br />Inspiring Mantra: Targets in arc in front is buffed by Courage for 30 seconds.\r<br />\r<br />Altmer/High Elves\r<br />“The high elves are the most strongly gifted in the arcane arts of all the races.” - Skyrim Wiki\r<br />Highborn: Magicka regenerates 10x faster in combat but then 10x slower after combat for 120 seconds as the high crashes.\r<br />+50 Magicka\r<br />Magika regenerates 50% faster\r<br />Start with Novice Spellcasting Perk in a preferred circle.\r<br />\r<br />Bosmer/Wood Elves\r<br />“Wood elves make good scouts and thieves, and there are no finer archers in all of Tamriel.” - Skyrim Wiki\r<br />(no change) 50% resistance to Poison and Disease\r<br />Friend of Nature: All normal (non predator) animals are your allies.\r<br />Command Animal: Makes all animals, even predators, your allies for 60 seconds.\r<br />Archery and Thievery Skills have 10% lower requirements\r<br />\r<br />Dunmer/Dark Elves\r<br />“Dark elves are noted for their stealth and magic skills.” - Skyrim Wiki\r<br />(no change) 50% Resistance to Fire\r<br />(toggle) Ancestor&#39;s Wrath: Surrounds the Dark Elf with Fire\r<br />Magic and Sneak Skills have 10% lower requirements\r<br />Magika regens 20% faster, +20 Magika\r<br />\r<br />Orc\r<br />“Orcish smiths are prized for their craftsmanship. Orc troops in Heavy Armor are among the finest in the Empire.” - Skyrim Wiki\r<br />(no change) Berserker Rage: Take half damage and do double physical damage for 60 seconds. \r<br />Berserker Fury (toggle):  Take half damage and do double physical damage but stamina and Magika regen at half speed.\r<br />Smithing and Heavy armor perks have 10% lower requirements.\r<br />Heavy Armor worn or crafted by orcs is 25% better. \r<br />\r<br />Argonian\r<br />“This reptilian race, well-suited for the treacherous swamps of their Black Marsh homeland, has developed a natural resistance to diseases and the ability to breathe underwater.” - Skyrim Wiki\r<br />(no change) %50 Disease Resistance\r<br />Water breathing\r<br />Histskin: Health regenerates 10x faster in combat but then 10x slower after combat for 120 seconds as the high crashes.\r<br />Swimming speed is 50% faster\r<br />\r<br />Vampires\r<br />Scent and Sight abilities bundled into one, sound ability also included, same red glow and edge blur with a bit of desatuaration by default.\r<br />\r<br />Werewolves\r<br />Same Scent, Sight and Sound abilities as Khajit but with a toglable red glow and edge blur\r<br />\r<br />Misc Player Options\r<br />A set of miscellaneous options to customize your character.\r<br />Options to set starting values for all skills\r<br />Option to set starting level, dragon souls, and perk points\r<br />Option to set starting spells and equipment\r<br />Options to enable any of the other Race Abilities\r<br />Option to set default range for melee, spells, spell duration, etc\r<br />Option to set world time scale\r<br />\r<br />[b][color=6A5ACD][size=30]Update history[/size][/color][/b]\r<br />Version 1.3.0: Incremental Build - With Dagi-Rhat being pulled for an overhaul the buggy support for them was removed, as was the leveled unarmed boost as Skyre does it better.\r<br />A new ability is added to Khajiit and Werewolves: Acute Hearing, this power is activated like Smell and has the same duration and range but will work on everything, Dwemmer, Dramora, but it can not determine their hostility only that there is SOMETHING moving about.\r<br />\r<br />Version 1.0.0: Initial Build - combines the functionality of the above 3 mods as well as some prep work for other things like incorporating unarmed level boost, and Dagi Rhat support. \r<br />\r<br />[b][color=6A5ACD][size=30]Requirements[/size][/color][/b]\r<br />You will need these files/mods\r<br />Skyrim (Obviously)\r<br />Update.esm\r<br />Dawnguard expansion\r<br />And [url=http://skyrim.nexusmods.com/mods/24168]Race Compatability[/url]\r<br />\r<br />[b][color=6A5ACD][size=30]Expanded Description[/size][/color][/b]\r<br />Khajiit:\r<br />Fixes the Khajiit claws to do their listed 15 points not 12\r<br />Adds a Sense of Smell Power (shout) that when activated will highlight friends in blue and enemies in red as detect life. Does not work on undead and mechanical enemies who don&#39;t have a normal scent.\r<br />Adds a Night Vision power that will activate automatically as the light fades\r<br />Adds a Acute Hearing Power, similar to detect life but detects everything though it wont tell you hostility just that there is SOMETHING out there.\r<br />\r<br />[b][color=6A5ACD][size=30]Installation[/size][/color][/b]\r<br />Painfully easy, it&#39;s a single ESP, download and drop in Data or let the Nexus Mod Manager do the work.\r<br />\r<br />\r<br />My Skyrim Mods\r<br />[url=http://www.nexusmods.com/skyrim/mods/68539/?]Guard Armor Overhaul[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/40329/?]Races Expanded[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/68696/?]Female Prisoner Clothes Overhaul[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/69514]Chesko Frostfall Tail Patch[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/69540/?]Cloaks of Skyrim Tail Patch[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/69554/?]Winter is Coming Tail Patch[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/69760/?]Immersive Armor - Tail and Circlet Patch[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/70880?]Female Armor Overhaul[/url]\r<br />more coming soon as need rises",
  "categoryId": "34",
  "version": "1.3.0",
  "author": "NekoLLX",
  "createdUnix": "1376520334",
  "updatedUnix": "1377982999",
  "containsAdultContent": false,
  "uploadedBy": "nekollx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000046994",
      "name": "Khajiit Expanded",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "70",
      "fileName": "Khajiit Expanded-40329-1-0-0.zip",
      "uploadedUnix": "1376520329",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/b762c365546c4a5926ac9b2e7b1e3f5a53f67506aac3712735728b30e2a49278/analysis/1407682207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Khajiit%20Expanded-40329-1-0-0.zip?fid=1000046994&ttl=1535820922&ri=8192&rs=8192&setec=bf115b4dcb6db22974e70be0e680eb91"
    },
    {
      "fileId": "1000051182",
      "name": "Khajit Expanded",
      "version": "1.3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "Khajit Expanded-40329-1-3-0.rar",
      "uploadedUnix": "1377982999",
      "modVersion": "1.3.0",
      "virusScanUrl": "https://www.virustotal.com/file/a11f44f85c80be7d5e6184a5b5e6fc94c5f4d199e70f06af33c83d8598a636f2/analysis/1407704181/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Khajit%20Expanded-40329-1-3-0.rar?fid=1000051182&ttl=1535820923&ri=8192&rs=8192&setec=4663493df4e03bcf44d395d04e700c31"
    }
  ]
}