{
  "modId": 40353.0,
  "modName": "Vlindrel Hall - Forsworn Shrine to the Old Gods",
  "summary": "Replaces the otherwise uninteresting decorations in the housecarl\\'s room with a secret shrine celebrating the Old Ways of The Reach. (Bed still there to avoid complications.)",
  "descriptionHtml": "[b][u]Description:[/u][/b]\r\n\r\nSummary:\r\n\r\n-Discreet [b]Forsworn shrine[/b] in the [b]Vlindrel Hall[/b] housecarl\\'s room\r\n-[b]Bed still there[/b], worked into the motif, so as not to break Argis\\' AI package if players choose to become Thane of the Reach.\r\n-Although, what kind of self-respecting Reach Native or Forsworn would seek the approval and awards of Nord Jarls and have a Nord invader living in their home!\r\n\r\nI always felt that what Vlindrel Hall lacked in convenience, it could have made up for in atmosphere and implicit and interesting lore, but sadly it just seems to be another home carved out of the ancient city of stone.\r\n\r\nWell, with this mod, I wanted to add a little spice to that patch of derelict, Dwemer real-estate and capture some of that romantic, violent and dark nature that gives The Reach its unique atmosphere. I also wanted to give players, like myself, who enjoy the story of the Forsworn and perhaps roleplay a Reach-Native Breton or Forsworn sympathiser a reflection of that roleplay background in a player-owned home to create a deeper and more immersive experience while rolling with that motivation angle for their Dovahkiin.\r\n\r\nSo, in that dingy back-room that might otherwise only serve as Argis the Bulwark\\'s quarters I have replaced the otherwise uninteresting and predictable furnishings with an unobtrusive sanctuary dedicated to the practice of the Old Ways and the worship of the mysterious Old Gods.\r\n\r\nThe shrine features a decorated [b]alter[/b] for blood sacrifices and the channelling of twisted nature-magic, a [b]gory monument[/b] erected in the Forsworn fashion with the imposing bone idol and twig-impaled heads on spikes and various bits of [b]flavour decoration[/b] such as alchemical ingredients that might be useful to a Forsworn conspirator and a morale-boosting book that tells the tale of the Forsworn hero, Faolan (The \\'Red Eagle\\').\r\n\r\nArgis\\' bed has been left in the room as a precaution so as not to mess up his AI packages for anyone who might be a Thane of the Reach and has him occupying Vlindrel Hall.\r\n\r\nI hope those who like the Forsworn or Reach Native lore will appreciate this little refurbishment that hopefully makes a big difference.\r\n\r\n[b][u]Requirements:[/u][/b]\r\n\r\nThe only requirements are that you have the most recent version of the vanilla game installed (1.9.32~).\r\n\r\n \r\n[b][u]Load Order:[/u][/b]\r\n\r\nI don\\'t currently use any lighting mods myself, but I would suggest this mod be placed below any texture changes to vanilla resources and above any lighting overhauls in your mod load order.\r\n\r\n[b][u]Installation/Uninstallation:[/u][/b]\r\n\r\nNMM: Install - Click the download button, activate the mod in the NMM programme, edit load order when necessary.\r\nUninstall - Deactivate the mod in NMM, make a new save and play as normal.\r\n\r\nManual: Install - Unzip the file, drag the folder into your Skyrim folder (typical path: Steam/steamapps/common/skyrim)\r\nUninstall - Delete the \\\"Vlindrel Hall - Forsworn Shrine\\\".esp from your Data folder, make a new save and play as normal.\r\n\r\n[b]If you have any issues with this mod, please, let me know and I will do my best to resolve them.[/b]\r\n\r\nThanks! I hope you like it! \\\\o/",
  "categoryId": "90",
  "version": "1.0",
  "author": "Rob_the_Bob",
  "createdUnix": "1376582539",
  "updatedUnix": "1376581974",
  "containsAdultContent": false,
  "uploadedBy": "rcarass1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000047110",
      "name": "Vlindrel Hall - Forsworn Shrine",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Vlindrel Hall - Forsworn Shrine-40353-1-0.zip",
      "uploadedUnix": "1376581974",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/97293ea5727d7ee32e241f697df2aef9f560a257830e011a0bfe10ff6266acda/analysis/1407682941/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vlindrel%20Hall%20-%20Forsworn%20Shrine-40353-1-0.zip?fid=1000047110&ttl=1535820944&ri=8192&rs=8192&setec=7ec9071c3cdedc2801f421d84807963c"
    }
  ]
}