{
  "modId": 40369.0,
  "modName": "mthralling",
  "summary": "Brings vampires to the towns and cities and effectively enslave the population of Skyrim possibly enslaving the player in the process.",
  "descriptionHtml": "The Thralling of Skyrim\r<br />\r<br />Version 1.4e stops a problem you might encounter if you get a business proposition from a fellow near Morthal and take a nap before ever visiting Morthal.\r<br />\r<br />Version 1.4d cancels a tiny bit of scripting which was redundant and forgotten that might inadvertently cure a player with an unpleasant, reductive condition. It also arranges for the \r<br />possibility of finding a stray bloody bone in a city vampires have come to dominate.\r<br />\r<br />Version 1.4 fixed a misplaced faction assignment, so that vanilla vampires should be less friendly early on in a new game. This change won&#39;t affect an existing playthrough. 1.4 also \r<br />manages to move much of the campaign to thrallify Skyrim off-screen, so that npcs will be seen playing a certain game a little less frequently. These changes should make a small \r<br />difference in an existing game. Haven&#39;t tested the changes with a long lasting character, so thing may be adjusted more in the future.\r<br />\r<br />You can cure cows. Most cows created by other vampires than the player can be throughly cured. Cows created by the player or when the player is watching are \r<br />more damaged than others, but all cows can resume their earlier life to a large degree. The important thing is that a cure is available. That will be easier to obtain if you are a \r<br />vampire, but a few vampires opposed to the whole idea of cowing will be willing to sell the required potion to the cured player cow.\r<br />\r<br />As a vampire, you will also receive orders for particular humans. Delivery will result in a modest payment, but that doesn&#39;t really matter to your player. She has plenty of money, and \r<br />really does this sort of work for fun. He gets a kick out of destroying lives once in a while.\r<br />\r<br />There is a substantial change in version 1.3 of thralling. Mutated versions of the mugging spell and training rod which were created in Cryodiil at the time of the Oblivion Crisis \r<br />appear in Skyrim. The creation of a different kind of &#39;thrall&#39; who has not been seduced becomes possible. Almost all vampire thralls are volunteers. The player now has the chance to \r<br />add to the small number of involuntary cows in Skyrim working as a vampire training and destroying npcs or as a non-vampire becoming one of those cows. As a vampire the player can \r<br />take requests to deliver particular npcs to particular vampires as trained cows. As a  cow, the player can work with a trainer to take orders for particular npcs the trainer with \r<br />gather and deliver to the vampire lairs. In either case you have an excellent chance of completely destroying your game. Playing as a cow, in particular, you can break many quests \r<br />even though you have no control over events. It may be that this will not matter, because as a vampire cow, you could not complete those quests anyway. At the present time, there can \r<br />be fifty cows brought into the world of Skyrim by the player or other vampires who have figured out how to make cows.  Cows often don&#39;t live very long. A very few die in dispair almost immediately and all die if neglected for a few days. \r<br />\r<br />(Cows are a crippled, less capable version of thralls which provide more healing and generalized restoration to vampires than the more independent thralls.)\r<br />\r<br />In addition, vanilla healing spells and potions will no longer affect the player/vampire. There are venders who will sell a healing spell, and potions of blood which can work as \r<br />healing potions without changing a vampire&#39;s stage.\r<br />\r<br />This mod examines the relationship of vampires and their thralls in Skyrim, and allows the player and npc vampires to create thralls, voluntary and involuntary, like the ones found in \r<br />caves around Skyrim. The vampire thralls found in vanilla vampire lairs were not under duress. They did not seem to be enslaved or handicapped. A sneaky player character might spy on \r<br />them and discover that though they don&#39;t talk much, Skyrim vampire thralls are certainly not oppressed apart from very limited exceptions. Most of the vampire thralls look like semi-retired bandits who are perfectly capable of plying their old trade. Dawnguard introduced another version of thrall which is a victim of abuse.\r<br />\r<br />A little history: Morrowind vampires had cattle. The npcs who had been turned into cattle  had lost the ability to do much of anything but stand around and shuffle. In Cryodiil, the \r<br />vampires didn&#39;t keep livestock. They apparently believed that it was necessary to kill to feed. One prominent, though rarely seen npc, sought death rather than feeding/killing. The \r<br />mod _Training Cattle_ introduced animal husbandry and allowed the existing vampires to gather herds of npcs and to feed without killing. Vampire npcs promoted the idea and used the \r<br />player as an agent in implementing both the training and an educational program among the vanila vampires. In the process, it was discovered that npcs didn&#39;t need to be abused to be \r<br />exploited. Seduced, they would remain stong and useful to themselves and to the vampires they would willingly serve. The vampires responsible for that program in Cryodyll, brought and \r<br />popularized their technique in Skyrim after The Great War. Aside from one particular, very old-fashioned lair which still clings to the Morrowind style of thrall. Semi-independent, \r<br />capable thralls are common in Skyrim&#39;s vampire lairs. \r<br />\r<br />With Mthralling, vampires are expanding the program beyond the bandit population to the towns and villages and will eventually enslave the non-vampire population of Skyrim.\r<br />\r<br />The player is not significant. The vampires spreading thralldom won&#39;t care and the vampires who may begin creating cows are not interested in the player. If you are not a vampire, you \r<br />may be a target for thralling or cowing, but the player is, in the view of the vampires running the show, a negligible factor. \r<br />\r<br />Unique npcs in towns and cities are protected during vampire attacks and during dragon attacks. Both sorts of attacks are used as cover for vampires to sneak into town and temporarily take up residence among the residents. Occasionally, the disguised vampires will even get involved fighting the attackers or their companions, but most of the time they will avoid combat and wait for a chance to give an unsuspecting citizen an introductiory bite. As vampires become more popular in a given city and throughout Skyrim, more will be found roaming the streets of cities and towns.Townspeople may occasionally be seen seeking them out and even defending them if a vampire should happen to be attacked by an npc who is not accepting of the vampires. Eventually, Skyrim will be quietly controlled by vampires. \r<br />\r<br />It needs Skse to support _Fuz Ro D-oh_ which will allow you to read what was said.  Some of what happens to change the world, depends on random converstations, but you won&#39;t miss much if you don&#39;t has _Fuz Ro D-oh_. Scripts also use a few of the SKSE \r<br />functions. The mod also requires Dawnguard.\r<br />\r<br />Vampires gain a little bit of protection from the sun. Their magicka and stamina will continue to regenerate in the sunshine, if they have fed from a cooperative thrall recently. \r<br />\r<br />Feeding on cows, gives a substantial boost to vampires after sundown.\r<br />\r<br />Thralls also receive a boon from the feedings which protect vampires from the effects of the sun: their health and stamina will regenerate faster than normal. These effects are not \r<br />dependent on sunshine. A thrall may also receive a mild punishment after going too long without being fed upon. After all, thralls are supposed to hang out with vampires most of the \r<br />time. If the player should happen to become a thrall, there are a few circumstances where the player-thrall may be asked to assist a vampire.\r<br />What&#39;s happening is that the act of cooperative feeding functions as a kind of shrine to Molag Bal: blessings are granted and, sometimes diseases are cured. Both the vampire and the \r<br />willing thrall benefit. When the vampire feeds on a cow, the benefits are all one way.\r<br />You can play the mod as a vampire or a non-vampire. As a vampire thrall, you may get a little work protecting or warning vampires. As a cow, you have the chance eventually to choose \r<br />which Master you will assist in selling Skyrim&#39;s npcs to particular vampires as cows. As a vampire, you may choose to turn npcs. Occasionally, an npc may ask to be embraced, but you \r<br />can also surprise them after feeding gently a few tiems. Most thralls can become followers. Thralls will be willing to share inventory with the vampire. In either case, the player is \r<br />just another npc of no special significance. You may also turn npcs who are not vampire thralls into vampire cows.\r<br />\r<br />Mthrallling modifies vampire life in Skyrim over time. The player can advance the vampire program by visiting the Jarls, by hanging around the city after on of the random vampire \r<br />attacks, or by being around vampires, and by playing the vampire game. Mods such as _Interesing Npcs_ adds some very pleasant vampires who are happy joining in the program. Vampire npcs such as Vlad or Claudia will work industriously if they get a chance. Because little happens without the player being present, npcs require the presence of the player if they are going to interact with each other.",
  "categoryId": "79",
  "version": "1.4e",
  "author": "pihwht",
  "createdUnix": "1376598596",
  "updatedUnix": "1407360218",
  "containsAdultContent": false,
  "uploadedBy": "pihwht",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000047155",
      "name": "mthralling_zip",
      "version": ".99f",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "166",
      "fileName": "mthralling_zip-40369--99f.zip",
      "uploadedUnix": "1376598474",
      "modVersion": ".99f",
      "virusScanUrl": "https://www.virustotal.com/file/ac33163d21f3c8d2fefa31d2d5b2f3ef70b774d52c83c0e6ce6366f52d08e553/analysis/1407683394/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mthralling_zip-40369--99f.zip?fid=1000047155&ttl=1535820956&ri=8192&rs=8192&setec=c70d763c452d03253a5096051d0820ba"
    },
    {
      "fileId": "1000048212",
      "name": "Mthralling",
      "version": ".99g",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "166",
      "fileName": "Mthralling-40369--99g.zip",
      "uploadedUnix": "1376960091",
      "modVersion": ".99g",
      "virusScanUrl": "https://www.virustotal.com/file/a3273f6e31b86433e7e40224142947efdb960fa0c0cd31055b22136124780037/analysis/1407689886/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mthralling-40369--99g.zip?fid=1000048212&ttl=1535820956&ri=8192&rs=8192&setec=6abe4e70360f6c35f109741e256ebb49"
    },
    {
      "fileId": "1000049601",
      "name": "Mthralling",
      "version": ".99h",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "169",
      "fileName": "Mthralling-40369--99h.zip",
      "uploadedUnix": "1377482159",
      "modVersion": ".99h",
      "virusScanUrl": "https://www.virustotal.com/file/a34ca95b15972a48a5163af27dbc1f09e640a1ce86ef88795b63c76189705fae/analysis/1407696782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mthralling-40369--99h.zip?fid=1000049601&ttl=1535820957&ri=8192&rs=8192&setec=79fe157496cf22790ebfaca406310a6d"
    },
    {
      "fileId": "1000078265",
      "name": "mthralling",
      "version": ".99j",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "180",
      "fileName": "mthralling-40369--99j.zip",
      "uploadedUnix": "1384293235",
      "modVersion": ".99j",
      "virusScanUrl": "https://www.virustotal.com/file/89b3a6723c16215fa3d58d5102ee4d5d4827c758d41ca8889e805df1d487a217/analysis/1407790506/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mthralling-40369--99j.zip?fid=1000078265&ttl=1535820957&ri=8192&rs=8192&setec=fbec0004138151091a3108378d72b049"
    },
    {
      "fileId": "1000105073",
      "name": "mthralling",
      "version": ".99t",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "395",
      "fileName": "mthralling_V-40369-.zip",
      "uploadedUnix": "1397580775",
      "modVersion": ".99t",
      "virusScanUrl": "https://www.virustotal.com/file/6553261114421639fd0393bdc2a31491820bae4a517272368d0966d810dd175b/analysis/1408022122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mthralling_V-40369-.zip?fid=1000105073&ttl=1535820958&ri=8192&rs=8192&setec=f7922fafe2882ea7846eecc5e9128626"
    },
    {
      "fileId": "1000105310",
      "name": "mthralling99u",
      "version": ".99u",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "400",
      "fileName": "mthralling99u-40369--99u.zip",
      "uploadedUnix": "1397752584",
      "modVersion": ".99u",
      "virusScanUrl": "https://www.virustotal.com/file/c827b9c4050da57404a5e8b1d300462fd9c8dceef5b081f9d18a60920c90e96b/analysis/1408026246/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mthralling99u-40369--99u.zip?fid=1000105310&ttl=1535820958&ri=8192&rs=8192&setec=d08263094178d89a3a6feb6c95983cbe"
    },
    {
      "fileId": "1000106178",
      "name": "mthralling_1a",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "411",
      "fileName": "mthralling_1a-40369-1-1.zip",
      "uploadedUnix": "1398224074",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/98d54ae68cf9390b6a0dc8a972730508462e589e690a2b48e2519f8c2848633c/analysis/1408036211/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mthralling_1a-40369-1-1.zip?fid=1000106178&ttl=1535820959&ri=8192&rs=8192&setec=06a1f468c06422913ce7a71bae9f7e11"
    },
    {
      "fileId": "1000107575",
      "name": "mthralling_1aa",
      "version": "1.1a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "410",
      "fileName": "mthralling_1aa-40369-.zip",
      "uploadedUnix": "1399085625",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/e5b1b3218c512c4d76a3eb94338c87484ff458e0311e6922ae97b6e4599c2436/analysis/1408052283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mthralling_1aa-40369-.zip?fid=1000107575&ttl=1535820959&ri=8192&rs=8192&setec=eb00eb132b624d6b2e8502e32ed2d717"
    },
    {
      "fileId": "1000117613",
      "name": "Mthralling_1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "424",
      "fileName": "Mthralling_1_3-40369-1-3.zip",
      "uploadedUnix": "1405429711",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/465ef20ef3b775df23624dff6ad961a8e3124533bca76c941e98ff146728caf5/analysis/1405429956/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mthralling_1_3-40369-1-3.zip?fid=1000117613&ttl=1535820960&ri=8192&rs=8192&setec=9a9231b9dd5113fd3e5e908bfbbce655"
    },
    {
      "fileId": "1000119582",
      "name": "mthralling_1_4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "438",
      "fileName": "mthralling_1_4-40369-.zip",
      "uploadedUnix": "1406498232",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/2506ba3c3962294e8e6f4ebf0ccbbc8dc6353b8832df12759ec2fd7d2dde3132/analysis/1406498290/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mthralling_1_4-40369-.zip?fid=1000119582&ttl=1535820960&ri=8192&rs=8192&setec=cde981d62d2878edbfb569b952baf993"
    },
    {
      "fileId": "1000120670",
      "name": "mthrallint_1_4d",
      "version": "1.4d",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "441",
      "fileName": "mthrallint_1_4d-40369-1-4d.zip",
      "uploadedUnix": "1407203429",
      "modVersion": "1.4d",
      "virusScanUrl": "https://www.virustotal.com/file/0a521a1df7bf17c3cd6cf7f6738398f9ffefaf0bfab8ef74c02b40e3ed5f273f/analysis/1407203567/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mthrallint_1_4d-40369-1-4d.zip?fid=1000120670&ttl=1535820961&ri=8192&rs=8192&setec=12161c27846c05dc18c6134703ef5fc5"
    },
    {
      "fileId": "1000120896",
      "name": "mthralling_1_4e",
      "version": "1.4e",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "441",
      "fileName": "mthralling_1_4e-40369-1-4e.zip",
      "uploadedUnix": "1407360218",
      "modVersion": "1.4e",
      "virusScanUrl": "https://www.virustotal.com/file/d2b8f1e65233ac0a1c5505da98226c9801fbbd3c41070fc4f9b0db56da654a1e/analysis/1407360311/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mthralling_1_4e-40369-1-4e.zip?fid=1000120896&ttl=1535820961&ri=8192&rs=8192&setec=41a14a0fbbbb9b7195f6f737bb067036"
    }
  ]
}