{
  "modId": 40372.0,
  "modName": "Fort Winstad",
  "summary": "A village and Fort built up around Windstad Manor, from Hearthfire DLC.",
  "descriptionHtml": "[B]NOTICE: Recommended that you build Winstad Manor before Subbing to the Fort.[/B]\r\n\r\n+++++++++++++++++++++++++++++ \r\n\r\nFort Winstad Features: \r\n-Walkable perimeter wall with 4 Gated Entrances. \r\n-Cleared out all the Dead, Ugly trees and Grass and Planted fresh Aspens and Lush Grass! \r\n-LOTS of Landscaping and Backfilling to accomodate the amount of construction. As a result, the Marsh is now a Lake; Go for a Swim! \r\n-Full Black Smith\r\n-6 Guards on Scheduled Patrol (Eat, Drink, Sleep) \r\n-Town Hall (with a Golden Throne just for YOU!) \r\n-Guard House \r\n-Ocean Breeze Pub &amp; Rest \r\n-3 Towers for Surveylance (and jumping off of into the Lake ...) Lakewatch Tower, Swampwatch Tower &amp; Mountainwatch Tower. \r\n-Gated Lake Entrance \r\n-Dock \r\n-Thriving population of NPCs \r\n\r\n*************************************** \r\nSteam Update History\r\n*************************************** \r\nUpdate 1.1 \r\n-Black Smith area added \r\n-Several Navmesh issues resolved \r\n-Crashing fix for those without Dawnguard \r\n-Wall access added near Lakewatch Tower. \r\nUpdate 1.1.1 \r\n-Minor bug fix - Duplicated Log Pile/Stable. \r\n\r\nUpdate 1.2 \r\n-Lakewatch Tower converted into Lighthouse. \r\n-Balder the Blacksmith and his lovely wife Olana, who has taken charge of the local Farmers Market, have become the first inhabitants of Winstad! Please welcome them with open arms! \r\n-Olana has made some drastic changes to the market. Must say, I like what shes done with the place! \r\n-Minor improvements throughout (lighting, clutter etc.) \r\n\r\n**Update 2.0** \r\n-Balder and Olana have returned!! And they\\'ve brought company! \r\n-Stella will be watching over the newly minted \\\"Winstad Fox in Fort - Pub & Res\\\" (that\\'s right, the \\'Fox in Fort\\' brand of Pubs is Franchising!). You will notice that the pub is now generally quite packed in the evening, so they are now currently looking to hire some entertainment! Also if you\\'re too drunk to wander back to the house, you can always rent a room - directly left of the bar. \r\n-The Hunter has taken up residence in the house furthest to back of the Fort, and made it quite comfortably his own. He spends the day out in the Woods.. hunting.. but he will always be back to the pub to finish up his night. \r\n-Lord Commander Ulrich was hired to transform the motley-crew of Merceneries that were protecting the fort, into a more organized Force.. the DragonGuard; a highly skilled, highly trained fleet of Guards hell bent on protecting these walls. They\\'ll all be into the pub after their respective shifts for Pint. \r\n-Have also made some minor adjustments/improvements near the front gate. \r\n\r\n*********************************** \r\n\r\nUpon purchasing the land from the Jarl of Morthal, the Dragonborn knew exactly what he wanted to do with it. \r\nStarting by tearing up all the existing sod and trees, he tediously transformed the terrain from an uninhabitable wasteland, to the rolling, majestic village you now see before you. \r\n\r\nRock and Stones were in large supply, once the Dragonborn started dredging up the Marsh, so the Walls and towers were only a matter of labor, as the materials were readily available. \r\n\r\nThe wood and thatch for the buildings was also quite abundant having chopped down numerous trees and dried grass. \r\n\r\nFinding Guards to secure the Fort wasn\\'t to be a problem, as Mercenaries around Skyrim are a dime-a-dozen. Give them somewhere to Eat & Sleep.. and Drink, and they\\'ll give you their life. \r\n\r\nThis Town is young, but it is growing. And thriving. And can provide Protection from the growing threat of Dragons unlike any other. \\\"If you build it; they will come.\\\" The population will flock to Fort Winstad in due time. And they will look to you as their new Ruler. For their lives may depend on it. \r\n\r\nHope you All Enjoy! \r\n\r\n-Alpha \r\n\r\n**************************************** \r\n\r\nIncompatibilities \r\nThis has nothing to do with my Mod, but \\\"Birds and Flocks\\\" has known bugs with Windstad Manor. Be sure to get the Hearthfire Version of \\\"Birds and Flocks\\\" \r\n\r\nFrequently Asked Questions \r\nQ1: Do you built the Fort with the Workbench, like the Hearthfire homes? \r\nA1: Nope. Once you sub, it is there. \r\n\r\nQ2: Can you make it so you can craft the entire Fort ala Hearthfire? \r\nA2: No, sorry. I don\\'t know how, and there\\'s too much else to do on the Fort. \r\n\r\nQ3: Can you make it so we can choose the Guards Armor? Or have the Armor change depending on Allegiance within the game ie Empire, Stormcloak etc. \r\nA3: No, again. I don\\'t know how. \r\n\r\nQ4: My house doesn\\'t show up when I build it. Whats happening? \r\nA4: You likely subbed to the Fort before building the House. Just a) unsub the Fort, b) Load from a point before you started building the home, c) Build home (I only had to partially build) and Hire Steward, d) Subscribe to Fort and Enjoy! \r\n\r\nQ5: Fort Lakeview?? \r\nA5: Perhaps. I\\'d love to do it, as theres alot of cool things I could do with it, BUT its a lot of work to make these things, and a lot more work supporting them and building on them once I\\'ve up\\'ed it to Steam. We\\'ll see! Never say never!",
  "categoryId": "89",
  "version": "",
  "author": "AlphaJoe",
  "createdUnix": "1376602508",
  "updatedUnix": "1376602502",
  "containsAdultContent": false,
  "uploadedBy": "joeyhesketh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000047168",
      "name": "Fort Winstad",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6440",
      "fileName": "Fort Winstad-40372-.rar",
      "uploadedUnix": "1376602502",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/40da6fca131efa967e059182a748b5b913d4197d25c296262ca25a35acc6cd72/analysis/1407683504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fort%20Winstad-40372-.rar?fid=1000047168&ttl=1535820965&ri=8192&rs=8192&setec=4223fbb62c310dc493c9dd64aac5ad65"
    }
  ]
}