{
  "modId": 40384.0,
  "modName": "Enchantment",
  "summary": "Enchantment!\r\nan overhaul for the de-nerfing of weapons and armors, the enchantment system, and adding new and correct effects to items",
  "descriptionHtml": "Enchantment?\r\nYes.\r\nENCHANTMENT!\r\nNO, wait. no enchantment.\r\n\r\nI took a hiatus. I got distracted. Sorry. I\\'ll get around to doing this again when I start playing Skyrim again.\r\n\r\nI. Introduction\r\nII. What It Does\r\nIII. What It Does, Currently\r\nIV. Requirements\r\nV. Q n\\' A\r\nVI. Things I, as a User, Should Know?\r\nVI. Bugs that Bug Me because they are Bugs.\r\n\r\nI. INTRODUCTION\r\n\r\nSo the enchantment system is lackluster, and the effects are often negligible, especially on Legendary.\r\n\r\nDaedric artifacts are worthless and have little use in a world where you can just make better stuff.\r\n\r\nBethesda likes to limit you because this appeals to the casual gamer.\r\nFortunately, there are some gamers that can fix this :D\r\n\r\n\r\nII. WHAT IT DOES.\r\n\r\nDisenchanting:------------ Enables you to disenchant all the weapons and armors/jewelry.\r\n(EXCLUDES: Staffs, Items without real enchantments [ex. Long hammer], Quest enchantments, etc.)\r\n\r\nRemove Restrictions:---- Enchant any armor enchantment on any piece of armor.\r\n\r\nInfinite Charges:---------- All weapons, even those YOU make, will have Infinite charge. \r\n                    (these things use the souls of living things, not cell phone batteries!)\r\n\r\nDaedric Re-buff----------- Daedric artifacts used to be worth upwards 25,000 gold in Morrowind,\r\n                                                   and strong to boot. Bethesda, tisk, tisk. no. bad. This does that.\r\n\r\nBuff Other Stuff----------- \\\"Man, I need to get that cool dagger, the NETTLEBANE!\\\" -said no-one ever.\r\nI thought that some items could use a touch of the Badassness you hear so much about from the people and lore of the Elder Scrolls. So I made some things better.\r\n\r\nAppraisals!----------------- Makes a lot of the Unique items worth a pretty penny. After all, they are one of a kind!\r\n\r\nWear those Chains!------ Because you are a classy Dragonborn, and like to wear every piece of fancy enchanted jewelry you come across. Sure it gets heavy, but does that mean you\\'re not allowed to wear it?\r\n\r\n \r\n\r\nIII. WHAT IT DOES, CURRENTLY:\r\n\r\nInfinite charges for all weapons (MOSTLY WORKING. PLEASE ALPHA/BETA TEST THIS)\r\n\r\ndisenchant all items (excluding staffs) (PARTIALLY WORKING, PLEASE TEST WITH WEAPONS)\r\n\r\nde-nerf and revalue all the daedric artifacts (PARTIALLY DONE. WEAPONS ONLY)\r\n\r\nrevalued other unique items (PARTIALLY DONE, WEAPONS ONLY.)\r\n\r\nremove enchanting restrictions on armor enchants (PENDING)\r\n\r\nwear infinite rings and amulets  (PENDING)\r\n\r\nPlease test the mod, and tell me about any issues you find.\r\n\r\n\r\nIV. REQUIREMENTS\r\n\r\nSkyrim.esm\r\nUpdate.esm\r\nDawnguard.esm\r\nDragonborn.esm\r\n\r\neasy-peasy right?\r\n\r\n\r\nV. Q N\\' A\r\n\r\nQ: The Simpsons did it. Why are you doing it when its already been done by other mods?\r\nA: Compatibility. I used several of these mods, but when things were not covered and didn\\'t mesh together, I felt the need to do it my way, that way it works together, and I save space on my Load Order with one .ESP file.\r\n\r\nQ: Does it affect things I enchant, and things I enchanted before?\r\nA: Yes, assuming you have used enchantments that are from the vanilla game and the DLCs.\r\nOtherwise, no. It doesn\\'t cover mod added stuff if they don\\'t use vanilla enchantments.\r\n\r\nQ: Can you disenchant mod added weapons and use mod added enchantments?\r\nA: Nope, the C.K. doesn\\'t work like that. If the item uses vanilla enchantments, then maybe, but no guarantee.\r\n\r\nQ: You used Sandal on this! He is the Best! I love you!\r\nA: And I love you, random citizen!\r\n\r\n\r\nVI. THINGS I, AS A USER, SHOULD KNOW?\r\nYes, there are a few things you should know to use this.\r\n\r\n1.    ENCHANTING ITEMS TO USE INFINITE CHARGE.\r\nwhen you enchant your own item, you may notice two things.\r\nA: the count on the enchantment slider, when enchanting, will say \\\"000\\\" number of charges.\r\nB: the slider will not exist at all and I can not do anything to change the effect.\r\nBoth of these are normal. Do not concern yourself with these things. These are not the droids you are looking for. Move along.\r\nDO NOT: \r\nA: change the slider in any way, its already infinite and as strong as possible, there is no fix. \r\nB: worry about it in any way, there are just no variable strengths to the enchantment.\r\n\r\n2. Nothing comes to mind. The whole thing is pretty strait forward, just play the game normally.\r\n\r\n\r\nVII. BUGS THAT BUG ME BECAUSE THEY ARE BUGS.\r\n\r\n1.The whole mod doesn\\'t work.\r\n\r\nNo duh, Its an alpha. theres a lot of work to be done, give me five minutes, kay? jeeze...\r\n\r\n2.The Staff of Magnus doesn\\'t work right.\r\n\r\nYeah. I came across this, maybe it\\'s just me, but the thing breaks as a vanilla bug, and I probably made the problem worse. I\\'m working on it. A little help would be nice. Maybe one of you not complain about this and help fix it? Would be cool. It\\'s not like I don\\'t have a lot of other work to do or anything.\r\n\r\n",
  "categoryId": "75",
  "version": "A1",
  "author": "Dnxyken",
  "createdUnix": "1376623960",
  "updatedUnix": "1376623955",
  "containsAdultContent": false,
  "uploadedBy": "Dnxyken",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000047217",
      "name": "Enchantment Release A1",
      "version": "A1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "46",
      "fileName": "Enchantment Release A1-40384-A1.rar",
      "uploadedUnix": "1376623955",
      "modVersion": "A1",
      "virusScanUrl": "https://www.virustotal.com/file/aeb2264d600facdee588d097b178ab3f7070aaef03cbf14965d53753e0d3fb8c/analysis/1407683822/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchantment%20Release%20A1-40384-A1.rar?fid=1000047217&ttl=1535820980&ri=8192&rs=8192&setec=5d192b561e3e3d82999a7cc280291416"
    }
  ]
}