{
  "modId": 40391.0,
  "modName": "Better Flaming Familiar",
  "summary": "A bit of a buff the the Summon Flaming Familiar spell, as the vanilla spell was very underpowered.",
  "descriptionHtml": "My first Mod! Probably not the last....\r\n\r\nI thought the Flaming Familiar Spell was a good idea for something different to the usual Atronach/Daedra spam, but a little poorly implement as the damage was VERY underpowered. You were better off spamming flame atronachs as a summoner, given that the wolf was too slow, didn\\'t last long enough and didn\\'t do a lot of damage. \r\n\r\nSo here\\'s an improved version! \r\n\r\nChanges to summon:\r\n\r\nWolf now has a Flame Cloak when summoned. This naturally does a little damage by setting enemies on fire and making them more vulnerable to damage than normal.\r\nWolf speed tripled, so he\\'ll reach enemies very quickly.\r\nWolf summon will last for up to 60 seconds if not hit or killed. He fights like a regular familiar with the added bonus of the Flame Cloak.\r\nWolf AI changed to the same settings as the regular familiar, so hopefully is slightly less stupid about choosing enemies to attack.\r\nWolf summon cost increased to base of 324, the same as the Storm Atronach to balance greater effectiveness.\r\nWolf no longer absorbed by Spell Absorption.\r\n\r\nChanges to explosion damage:\r\n\r\nTwo layers of damage. \r\n1. An explosion that may hit the enemy who hit the wolf in melee. It causes 150 Fire damage, and can potentially cause stagger or knockdown.\r\n\r\n2. An explosion that has an AOE effect the same as the Fireball AOE, and causes 120 Fire damage, ignoring LOS (can go through walls/obstacles, no using him in narrow passages!)  and may stagger enemies.\r\n\r\nOn a bit of testing he\\'s a lot more more effective than before, without being OP. He\\'s still a bit of a gimmick, but could be fun for conjurers who want an alternative to destruction magic for more direct damage.\r\n\r\nThe mod is based off of Vanilla Skyrim, no DLC\\'s or other mods required. Should have no compatibility issues with any other mod\\'s, as I don\\'t believe any others actually make any changes to the spell.\r\n\r\nLet me know if you like it, or if there\\'s any tweaks you think Wolfy needs! I may also make a similar one for Ahzidal\\'s Ring of Necromancy in Dragonborn which has a similar effect, with similarly lame damage output.\r\n\r\nChangelog: As requested, have made the Wolf just quietly despawn when the player isn\\'t in combat, so he won\\'t run back to you and blow up in your face anymore. ",
  "categoryId": "65",
  "version": "1.3",
  "author": "lowkey1979",
  "createdUnix": "1376664648",
  "updatedUnix": "1376905054",
  "containsAdultContent": false,
  "uploadedBy": "lowkey1979",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048037",
      "name": "Better Flaming Familiar ",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Better Flaming Familiar -40391-1-3.zip",
      "uploadedUnix": "1376905054",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/f53aa34c2f054e9f34d80eda47f542f26289ea1f3bfbf2a33c57d739a99ab3ef/analysis/1407688570/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Flaming%20Familiar%20-40391-1-3.zip?fid=1000048037&ttl=1535820992&ri=8192&rs=8192&setec=d9920ba5322a08ea54c9ce8286081bfa"
    }
  ]
}