{
  "modId": 40444.0,
  "modName": "Die Haengenden Gaerten Deutsch",
  "summary": "Einführung & Features\r<br />\r<br />Werfen wir die Katze aus dem Sack - Ich möchte die Mod als Geheimnis bewahren indem ich nicht tonnenweise Bilder hinzufüge aber\r<br />aber dies insaneOhflex Video war zu gut um wegzulassen. Es ist ein fantastisches Video welches einige der Highlights der Quest aufzeigen\r<br />aber nicht den Inhalt der Quest sel",
  "descriptionHtml": "Einführung & Features\r<br />\r<br />Werfen wir die Katze aus dem Sack - Ich möchte die Mod als Geheimnis bewahren indem ich nicht tonnenweise Bilder hinzufüge aber\r<br />aber dies insaneOhflex Video war zu gut um wegzulassen. Es ist ein fantastisches Video welches einige der Highlights der Quest aufzeigen\r<br />aber nicht den Inhalt der Quest selber verraten. Aber sei gewarnt, es zeigt eine Menge des Ortes. Screenshots sind mehr willkommen.\r<br />\r<br />&#34;führte die Altmer auf flammenden Spuren zur Mitte der Stadt, wo sie dem Tode fanden in dem quadratischen Garten...&#34;\r<br />(aus dem Buch &#34;Die Hängenden Gärten&#34;, geschrieben in der Sprache der Dwemer und übersetzt ins aldmerische)\r<br />\r<br />Es scheint so als hätte Calcelmo einige neue Gegenstände in den Ruinen der Dwemer gefunden (oder hat eher seine Studien darüber betrieben). Es ermöglichte ihm weitere Teile des Buches Die Hängenden Gärten zu übersetzen. Waren diese Korridore nur eine blasse Kopie, eine Nachahmung eines mächtigen Bauwerkes der Dwemer?\r<br />\r<br />Eine Questmod welche auf einer verlassenen Insel der Dwemer liegt, darunter ein Geheimnis, enthält eine von der Länge her mittlere Quest für mittlere bzw. höhere Chars mit Interesse am Erkunden, neuen Umgebungen und gutem Kampfstiel. Enthält einen vertonten NPC, einzigartige Gegenstände & Zutaten welche nur auf der Insel gefunden werden können, 2 kleinere Worldspaces, 14 Interior-Zellen, eine Seereise mit Piratemüberfall [...]\r<br />Finde die Insel, deinen Weg dorthin und erobere sie... sofern du es schaffst. Oh und eins noch, Seereisen sind gefährlich. Du weißt nie was du finden wirst....oder es dich.\r<br />\r<br />Diese Mod ist meiner Schritt in Richtung Quest & vertonten NPC. [...]. Ich wollte wirklich eine coole Insel erstellen. Die Quest führt dich überall hin. Ich denke es war gute Arbeit. Eins noch, was du wissen solltest: Ich gebe meistens keine Questmarker heraus solange dir bewusst ist wohin du gehen musst (z.B. jemand sagt dir du sollst zu Platz X geben und er gibt dir die Richtung vor). Ich erwarte von dir das du es findest.\r<br />\r<br />Bitte beachte das diese Mod nicht für schwächere PC&#39;s konstruiert wurde, und ich unglücklicherweise nicht in der Lage bin es für alle zugänglich zu machen. Das heißt ich habe es unter einer ATI 5770 laufen lassen und es lief rund. Ebenso sind beide Worldspaces sehr Ressourcen lastig. Auch empfehle ich es auf &#34;Hoch&#34; oder &#34;Ultra&#34; laufen zu lassen - einige der Dwemer Teile haben kein &#34;distant LOD&#34; und ich mag es nicht wenn Dinge ihren Glanz verlieren.\r<br />Starten der Quest\r<br />\r<br />Die Quest startet mit einer Nachricht von Calcelmo, welche dir ein Bote bringen wird. Ich weiß altbekannter Anfang.\r<br />Der Kurier wird nach dir suchen (von Zelle zu Zelle) nachdem du auf Level 25 bist und Nihme für Calcelmo getötet hast.\r<br />Im meinem Test war es am Besten nach Weißlauf zu gehen, das Betreten und Verlassen eines Gebäudes hat den Kurier jedes Mal durcheinander gebracht.\r<br />Lese die Nachricht und folge ihr. Die Quest wird beginnen sobald du den dazugehörigen Gegenstand gefunden hast.\r<br />Du solltest es und weitere Gegenstände in der Nähe mit dir nehmen.\r<br />Auch wenn die Quest startet und du auf Level 25 bist, könntest du besser warten bis du auf Level 40-50 Level bist. Oder auch nicht, es liegt an dir.\r<br />\r<br />\r<br />BEACHTE: Falls du nicht die Nachricht des Questanfanges &#34;Die Hängenden Gärten&#34; bekommen hast, nachdem du das Buch in Calcelmo&#39;s Dwemermuseum\r<br />gelesen hast, dann ist die Quest gescheitert. In 100% der Fälle liegt das (a) an Savegame Fehlern (b) Modkonflikten (c) Raubkopie.\r<br />Falls dir dies passiert ist, kann ich dir nur raten die Mod beim nächsten neuen Durchlauf versuchen zu starten.\r<br />Modkonflikte können immer wieder auftauchen, bei all den einzigartigen Worldspaces und Gegenständen, Savegame Fehler sind auch ein Grund hierfür.\r<br />Überprüfe auch dein Tagebuch. Wie ich bereits sagte wirst du wissen wohin du gehen musst, du wirst keinen Questmarker bekommmen.\r<br />Falls du einen Questmarker BEKOMMST, folge ihm. Ich hoffe der Tagebucheintrag ist deutlich genug, du wirst dein Hirn benutzen müssen und es erforschen.\r<br />Oh und du wirst Zugang zu Schwarzweite benötigen. Wie ich es bereits sagte.\r<br />FAQ - bitte lesen. Eine gestellte Frage in den Kommentaren welche hier beantwortet wird, wird dich zum lachen bringen oder auch nicht. Vielleicht auch beides.\r<br />\r<br />Q. Brauche ich irgendwas anderes?\r<br />A. Nein, diese Mod enthält alles nötige und sollte auf einem Vanilla Skyrim laufen. Jedoch gibt es Mods die du installieren kannst, welche das Spielerlebnis interessanter machen. Zum Beispiel ist die Mod SkyBirds-freundlich, was bedeutet das sie Marker enthält welche SkyBirds erkennen wird und Vögel spwanen wird. Du könntest auch Texturverbessernde Mods benutzen, da die meisten Dwemer Konstrukte und Pflanzen normale Texturen benutzen. Mods die die Kampf-AI verbessern. Die Möglichkeiten sind endlos.\r<br />\r<br />Q. Ist diese Mod sauber?\r<br />A. So sauber wie nur möglich. Ich hielt die Änderungen an der Vanilla Worldspace & deren Zellen so gering wie nur möglich und ging nochmals mit tes5edit am Schluss darüber.\r<br />\r<br />Q. Ich komme nicht weiter/ ich kann X nicht finden/ich habe verschiedene Fragen. Kann ich Fragen über X stellen?\r<br />A. Ja aber bitte behalte im Kopfe das (a) keine Spoiler in den Kommentaren zu finden sein wird (b) ich werde nicht bezahlt um dein Techniker zu sein [...] Es gibt einen kompletten Walkthrough auf dem Nexus, allerdings auf Englisch\r<br />Dies ist ein Auszug, die komplette FAQ findet ihr auf dem Nexus in Orginalsprache. Falls Bedarf einer kompletten Übersetzung dieser besteht, so schreibt mir dies bitte unten rein, dann werde ich dies bei Gelegenheit für euch erledigen...\r<br />\r<br />Troubleshooting/Bugs/Inkompatibiltäten\r<br />\r<br />- das LOD der Insel ist durcheinander geraten. Es passierte als ich erstmals die Insel erschuf. Ich fing an zu arbeiten. Dann passierte es wieder, gerade als ich zu 90% fertig war und dann sagte ich &#34;lass es&#34;. Also befindet es sich nicht an Ort und Stelle, du wirst damit leben müssen.\r<br />- es gibt einen seltsamen Bug welches die Wolken der Himmelsrand-Karte mit dem Worldspace der Insel überlappen lässt, nachdem man sich auf der Insel befindet und auf die Karte schaut. Ich habe keine Idee um dieses Problem zu lösen.\r<br />- die Sprachwahl könnte ein wenig zu soft ausgefallen sein im Vergleich zu der Sprache der Vanilla Version, wir gingen auf schmalen Grade zwischen dem Hören des Sprechers und der Hintergrundmusik.\r<br />- Die Untertitel können von dem Gesprochenen abweichen, wegen Limitationen des CK.\r<br />- für Leute die Beleuchtungsmods nutzen: Ich kenne und liebe viele von ihnen (und das sind schon einige), aber ich erschuf dies in Vanilla für Vanilla. Ich musste eine Entscheidung treffen, ich entschied dem Mainstrem zu folgen. Falls die Gebiete zu dunkel, zu hell sind oder die falschen Farben haben, tut es mir leid. (Sorry wenn ein Satz in der Liesmich nicht in Deutsch dasteht..)\r<br />- es gibt ein paar wenige Leute bei denen die Quest scheitert oder nicht korrekt abläuft. Ich versuche noch immer herauszufinden warum.\r<br />\r<br />Entstehungsgeschichte\r<br />\r<br />Ich wurde inspiriert von (sehr offensichtlich hoffe ich) den Hängenden Gärten von Babylon. Ein Blick auf das CK, und die Wahl viel auf Dwemer Kit.\r<br />Welch schöner Untergrund. Dies fing an mit einer Erkundung von Scharzweite. Die Flora von Schwarzweite ist limitiert und ich wollte mehr grün. Also entfernte ich mich von der Höhle und entwarf eine Insel. Na wie kommt der Spieler zur Insel? Also entwarf ich ein Schiff. Aber ich konnte dir dies nicht einfach so geben. Und so entstand ganz von alleine die Quest nach und nach. Ich hatte viel Spass beim entwerfen und ich hoffe ihr habt Spass beim spielen. [...]\r<br />Auszug aus der Entstehungsgeschichte. Die letzten Zeilen können nach Bedarf hinzugefügt werden...\r<br />\r<br />Credits (keine bestimmte Reihenfolge)\r<br />\r<br />- Bethesda für das großartige Spiel. Für die Interiorzellen, von denen ich Teile der Vanilla Version übernahm, weil sie einfach großartig sind und ich faul bin.\r<br />- Für die wunderbare Sprecheinlage von RainsfordXY, welcher schon viel für Fallout getan hat und nun sich als Sprecher für Skyrim interessiert. Du solltest ihn unbedingt kontaktieren, mit diesem Typen lässt es sich wunderbar arbeiten, ist begabt im Aufnehmen und kann gut improvisieren.\r<br />- InsanitySorrow von TES alliance dessen Mod-Ressourcen unersetzbar waren. Für diese Mod nutzte ich Tränke aus Morrowind, Seelensteine und die Springbrunnen und Ayleid clutter, welche ich in TESA&#39;s skyrim Ressourcen-Kit gefunden habe.\r<br />- GKB grüne Bäume Ressourcen von Ga-Knomboe Boy, die wahrlich besten Baum-Mod-Ressourcen für Skyrim.\r<br />- ChickenDownUnder&#39;s erntebaren Ressourcen.\r<br />- TrainWiz welcher freundlich genug war mir zu erlauben seine Dwemerspähren zu nutzen.\r<br />- volvaga0 welcher freundlich genug war mir zu erlauben seine Dwemer Goggles zu nutzen.\r<br />- Hothtrooper44 welcher freundlich genug war mir zu erlauben seine Seebären Piratenrüstung zu nutzen.\r<br />- ElSte17 welche freundlich genug war mir zu erlauben seine Seekreaturen Ported, aus dem Oblivion Modder-Ressourcen, Oblivion Salzwasserfische von Sjors Boomschors (nicht länger auf dem Nexus) zu nutzen, das Benutzen freier 3D Modelle aus dem &#34;Toucan Virtual Museum&#34;.\r<br />- Elinen and Ztrees wunderbaren Wasserplanzen Mod-Ressourcen.\r<br />- Elinen&#39;s Frühlingspflanzen II und Bodentexturen Mod-Ressourcen.\r<br />- Der_Funktasm&#39;s Morrowind-Style Clutter Mod-Ressourcen.\r<br />- Oaristys & Tony67&#39;s Modder&#39;s Ressourcen Pack.\r<br />- Soolie welcher mir bei einigen spastischen Palmen geholfen hat\r<br />- UESP, dessen Inhalt unter einer &#34;Creative Commons by-sa license&#34; erhältlich ist, für einen Teil der Karte eines von Bethesda&#39;s Entwicklern (Hugh Riley) welches hier gefunden werden kann\r<br />- die Akademie für Dwemer Studien welches im Dwemeris Font als Logo benutzt wurde.\r<br />\r<br />Dank euch allen, ohne euch wäre diese Mod viel langweiliger.\r<br />Was User darüber sagen\r<br />\r<br />&#34;ein weiteres Dankeschön für diese Mod&#34;. &#34;Ich kann die Karte nicht finden&#34;\r<br />....\r<br />\r<br />&#34;Was möchte ich dazu sagen? Nach stundenlangem Übersetzen von endlosen Texten bin ich endlich am Ende. Wer Rechtschreibfehler findet darf sie behalten und sollte mein Geist ausgeruhter sein so werde ich diese entfernen. Da ich jetzt gefühlt eine Ewigkeit an der Readme und an diesem Thread saß, ist es nicht auszuschließen das sich Rechtschreibfehler eingeschlichen haben. Ich bitte dies in Anbetracht der Fülle der Informationen zu berücksichtigen und gerne werde ich diese entfernen sollte Bedarf dazu bestehen. Ich glaube der Autor der Mod ist auch leicht gaga\r<br />So und jetzt lasse ich euch los auf diese Mod und wünsche ich erstmal viel Spass mit dem Lesen der Informationen. Ich habe jetzt erst gesehen das sich kleinere Rechtschreibfehler in der Readme eingeschlichen haben, ich hoffe ihr könnt mir dies verzeihen...dafür war es jetzt dann zu spät...&#34;\r<br />SPOILER   (Anzeigen)\r<br />\r<br />\r<br />Alle Rechte obliegen dem Autor der Mod &lt;acidzebra&gt;\r<br />Alle Rechte der Übersetzung obliegen dem Übersetzer &lt;Oblvion_Member&gt;\r<br />\r<br />Viel Spass wünsche ich euch \r<br />\r<br />Orginal findet ihr hier: http://skyrim.nexusmods.com/mods/30279/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D30279%26preview%3D&pUp=1",
  "categoryId": "35",
  "version": "1.1",
  "author": "acidzebra",
  "createdUnix": "1376698460",
  "updatedUnix": "1415399425",
  "containsAdultContent": false,
  "uploadedBy": "Gunter525",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052715",
      "name": "Die Haengenden Gaerten-DV",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "147191",
      "fileName": "Die Haengenden Gaerten-DV-40444-1-1.7z",
      "uploadedUnix": "1378477315",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f036b454ce4bbf0d07bf8442cf2fe67b4299ebdb9d248d7ff4f9874f6a644570/analysis/1407711147/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Die%20Haengenden%20Gaerten-DV-40444-1-1.7z?fid=1000052715&ttl=1535821046&ri=8192&rs=8192&setec=5f5b1b06afdfbb686bd441fc3dd744e0"
    },
    {
      "fileId": "1000134345",
      "name": " Die Haengenden Gaerten-DV - Fix",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "3160",
      "fileName": " Die Haengenden Gaerten-DV - Fix-40444-1-1.7z",
      "uploadedUnix": "1415399425",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/31de6d20a965a5f4df681755b5e3692f2f401317692e50b65810715025a201c1/analysis/1415399526/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/%20Die%20Haengenden%20Gaerten-DV%20-%20Fix-40444-1-1.7z?fid=1000134345&ttl=1535821046&ri=8192&rs=8192&setec=372c688ab906b50f8fbc43af89b2fea6"
    }
  ]
}