{
  "modId": 40498.0,
  "modName": "The Imperial Empire Storyline Word Document",
  "summary": "A word document I created myself about a storyline I would wish to see created",
  "descriptionHtml": "Hello! I found an old document on my computer I made one year ago, I looked at it, decided the project wasn\\'t dead yet and expanded it a bit and found my English has improved since last year and correct some errors.\r\n\r\nWell, you might wonder, What is this? What is it about? And why is this not in the mod-request section of the forums? \r\n\r\nWhat it is and what is about:\r\nThis a long word document with a not yet complete questline. This questline is meant to let the player feel that he or she actually plays a role in the politics of the Empire (I will make a version for those who side with the stormcloaks). This is what I got so far in the story line. Later on I will add a script about what everyone exactly says, does and act like. I will also make a Stormcloak story that is completely unique to this one. And I will add a villain TG version if you also want to be in the thieves guild, a villain DB version if you want to be in the Dark Brotherhood and villain TG & DB version if you want to be in the DB and the TG both. \r\nIn the regual version you will step by step climb up the ladder in the hiarchy of the Empire (or Stormcloaks) and practicly make the dark brotherhood and the thieves guild damageless, deal with the foresworn, raid bandit hide outs with the legion or the storm cloaks and eventually be crowned the new High King of Skyrim. Like I said before, the stormcloak and the imperial versions will be unique to each other, by wich I mean, the path to power will be a diffrent one. However that will be of later concern since I\\'m not even finished with the regualar imperial version.\r\n\r\nWhy not on mod request forum?\r\nWell, honestly... I tried. there wasn\\'t really a reaction. Then I realised that what I did was a request, now I\\'m just making a resource for am modder who wants to make questline, and besides, I turned into my own persenal project.\r\n\r\nHope you\\'ll enjoy!\r\n- YsmirNord",
  "categoryId": "28",
  "version": "V0.1",
  "author": "YsmirNord",
  "createdUnix": "1376760463",
  "updatedUnix": "1376760463",
  "containsAdultContent": false,
  "uploadedBy": "YsmirNord",
  "primaryFile": null,
  "files": []
}