{
  "modId": 40537.0,
  "modName": "Stendarrs Beacon Enhanced",
  "summary": "A small but elegant mod that expands, restructures, and dramaticaly improves Stendarr's Beacon. This mod aims to make this location more functional for those playing as Vigilants (or fighting against them), adding a new interior zone, outbuildings, and decor to complement the Vigil's grim, uncompromising aesthetic.",
  "descriptionHtml": "A small but elegant mod that expands, restructures, and dramatically improves Stendarr's Beacon. This mod aims to make this location more functional for those playing as Vigilants (or fighting against them), adding a new interior zone, outbuildings, and decor to complement the Vigil's grim, uncompromising aesthetic.\n<br />\n<br />Also available on SteamWorkshop! Installation should be easy: simply use NMM, or download the zip, extract the .esp file, and place it into your Skyrim data folder.\n<br />\n<br />[UPDATE: Ruhadre and I have been working on a major update, which includes new content and improved compatibility, as part of a port to SSE. Coming soon! Glad to be revisiting this mod after a long time.]\n<br />-ER 3/30/18\n<br />\n<br />     _____\n<br />\n<br />Features:\n<br />-A re-touched exterior for the beacon-proper, including an *actual* beacon and a usable stable\n<br />-A new interior zone, containing sleeping quarters, a kitchen, a shrine, storage areas, and a prison for suspected daedra worshipers\n<br />-An unowned bed and accompanying storage areas for visiting dragonborn\n<br />-Lore-friendly and stylistically consistent with Vanilla Skyrim\n<br />-No DLCs required!\n<br />\n<br />     _____\n<br />\n<br />User's Guide:\n<br />-All items inside Stendarr's Beacon (with the exception of those by the left-most bed) are property of the Vigil, so hands to yourself sneak-thief!\n<br />\n<br />-While you can use the left-most bed and accompanying storage containers, DO NOT USE THEM FOR LONG-TERM STORAGE! This area is not currently configured as a player home, and any items you store there will eventually disappear. I might change this in the future, but for the time being consider yourself a guest rather than an owner\n<br />\n<br />-Crafting stations: Cooking pot (kitchen), alchemy table (kitchen), tanning rack (basement storage room), armor worktable (basement storage room), grindstone (prison)\n<br />\n<br />-The EditorID of the new interior zone is ''stendarrsbeaconinterior01''\n<br />\n<br />     _____\n<br />\n<br />Feel free to tinker around with this mod! Just be sure to credit me if you use any of my work in something you publish. Many thanks to Krisjay (from the Nexus forums) for his helpful post on stables and horses, and to Bethesda for making and supporting this incredible game!\n<br />\n<br />     Enjoy!\n<br />        -Easier_Rider",
  "categoryId": "25",
  "version": "v1.00",
  "author": "EasierRider",
  "createdUnix": "1376792973",
  "updatedUnix": "1376792668",
  "containsAdultContent": false,
  "uploadedBy": "EasierRider",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000047686",
      "name": "Stendarrs Beacon Enhanced",
      "version": "v1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "116",
      "fileName": "Stendarrs Beacon Enhanced-40537-v1-00.zip",
      "uploadedUnix": "1376792668",
      "modVersion": "v1.00",
      "virusScanUrl": "https://www.virustotal.com/file/20814c66b9eb2a4531bb7eb8dd9921e6be0421cbf57edbc975342a705ebf9d3f/analysis/1407685983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stendarrs%20Beacon%20Enhanced-40537-v1-00.zip?fid=1000047686&ttl=1535821165&ri=8192&rs=8192&setec=07608a119aaf57692fa4e6013f6a175c"
    }
  ]
}