{
  "modId": 40533.0,
  "modName": "BattleMage_Eve",
  "summary": "etheral elven overhaul is needed for the look in my screenshot",
  "descriptionHtml": "Eve is a special case.  the Vilgilant of Stendar got their eyes on her when they found out her father was daedric Prince in disguise.  She realize she had amazing magical abilities 1 day she was n Markarth when she started hearing this voice and feeling her blood get hotter... she feel like someone was leading her by her hand then their she was in front of a abandon house she enter and found armor lying on the ground.  She then heard a whisper this is my final gift for you then her blood felt normal and she did not hear any more voices.  She grab the armor and ran out as fast as she could since her mother died giving birth she never knew anything bout her father; she was taken in by a retired imperial soldier.\r\n\r\nShe is a tad bit overpower.  she willl not equip her armor unless you tell her if u have UFO cant you dress better.\r\n\r\n\r\nPS: I open for ideas on follower making for others if u have idea for 1 that you want made for personal use pm me\r\nRequire Mods: AppachiiSkyhair",
  "categoryId": "96",
  "version": "1.0a",
  "author": "OZZY",
  "createdUnix": "1376790149",
  "updatedUnix": "1376790141",
  "containsAdultContent": false,
  "uploadedBy": "ozzy1983rocks",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000047681",
      "name": "BattleMage_Eve",
      "version": "1.0a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "BattleMage_Eve-40533-1-0a.rar",
      "uploadedUnix": "1376790141",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/329b46b37850fcfc0bb80fac7b8c0a5f6702af08d5d36c3538a1b4ae2e288bda/analysis/1407685903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BattleMage_Eve-40533-1-0a.rar?fid=1000047681&ttl=1535821160&ri=8192&rs=8192&setec=1dd6abcc5a3cfefe685e28717b3e1bb2"
    }
  ]
}