{
  "modId": 4054.0,
  "modName": "Elven Parade Armor",
  "summary": "Elven Armor retexture. An armor decorated with a variety of rare and elegant materials, making it look worthy of an elven lord. A different helmet model included.",
  "descriptionHtml": "I aimed to created a distinctive new appearance for the elven armor to make it stand out more. I really like the original armor model and i felt it has too much potential to just slap golden hue all over it and call it a day. I used rich and decorative materials like snow leopard skin, eagle feathers, royal red fabric and gems. The original helmet model looked like an egg to me so i swapped it for an orcish helmet. With its top resembling the shape of an eagle\\'s beak it looks to fit perfectly. I tampered it a little using alpha channels to add a little of a gentle curve to the front plates. I left the scratches and dents in the normal maps to make it little more antique. \r\n\r\nThe mod currently replaces the original elven armor. If someone is willing to change it into a new craftable, you have my full support. Just credit me where needed. \r\n\r\n\r\nHope you guys will enjoy it. ",
  "categoryId": "54",
  "version": "1.0",
  "author": "enzero1",
  "createdUnix": "1324250870",
  "updatedUnix": "1324252849",
  "containsAdultContent": false,
  "uploadedBy": "enzero1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "11854",
      "name": "Elven Parade Armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4822",
      "fileName": "Elven Parade Armor-4054-1-0.rar",
      "uploadedUnix": "1324252849",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3020763f0fa74557f332bf101b0e10df0d2f4cb5b39edfdd2ff5294486b5cfc4/analysis/1406535245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elven%20Parade%20Armor-4054-1-0.rar?fid=11854&ttl=1535759572&ri=8192&rs=8192&setec=829b73482496d341e92072a177690ad5"
    }
  ]
}