{
  "modId": 40607.0,
  "modName": "Undeath",
  "summary": "When a powerful necromancer and his followers seek out the forbidden secrets of immortality that could threaten Skyrim, will you defeat him to stop his evil quest, or continue it yourself?",
  "descriptionHtml": "[img]http://i.imgur.com/m3RrnKn.jpg[/img]\r<br />\r<br />[center][youtube]Tzm8kfoqZBk[/youtube][/center]\r<br />[center][youtube]zoIC2SrUTHM[/youtube][youtube]mX1OYD93504[/youtube][/center]\r<br />[center]Special thanks to Saiodin & Brodual for the feature videos&#33;\r<br />\r<br />[b][size=5][url=http://www.nexusmods.com/skyrimspecialedition/mods/6180/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrimspecialedition%2Fajax%2Fmoddescription%2F%3Fid%3D6180%26preview%3D&pUp=1]Now Available for Skyrim Special Edition&#33;[/url][/size][/b][/center]\r<br /> \r<br />[center][size=6][color=#0099ff][b]Skyrim - Undeath[/b][/color][/size][/center]\r<br />[center][size=5][color=#0099ff][b]Storyline[/b][/color][/size][/center]\r<br />\r<br />When a powerful necromancer and his followers seek out the forbidden secrets of immortality that could threaten Skyrim, will you defeat him to stop his evil quest, or continue it yourself? \r<br />\r<br />Uncover a small new questline that will take you to the frigid peaks of the Dragontail Mountains themselves, and beyond, as you pursue a powerful necromancer and his followers, and thwart their plans to acquire powerful artifacts and ingredients for an unholy ritual. What you choose to do with those reagents, and the forbidden knowledge they have stolen however, is up to you...\r<br />\r<br />[center][url=http://skyrim.nexusmods.com/mods/41291/?][b]German Translation[/b][/url] [b]|[/b] [url=http://tes.riotpixels.com/mods/skyrim/quests/undeath][b]Russian Translation[/b][/url][/center]\r<br />\r<br />[center][b][color=#0099ff][size=5]Features[/size][/color][/b][/center]\r<br />[center][color=#0099ff][b][size=4]Current Version: 1.3[/size][/b][/color][/center]\r<br />\r<br />[b][size=2][color=red]When updating to the latest version, be sure to use a fresh save state (before previous Undeath versions were installed) to prevent any conflicts&#33; As with installing ANY mod, be sure to keep a backup save just in case.[/color][/size][/b]\r<br />\r<br />[color=#0099ff][b][size=3]Version 1.3 - Bug fixes and music re-added[/size][/b][/color]\r<br />[list]\r<br />[*]Custom music re-added as loose files to prevent the CTD issue where it couldn&#39;t be read from the .bsa.\r<br />[*]Reworked the transformation ritual so that it should no longer kill - or fail to trigger for players even if they completed it successfully.\r<br />[*]The players race is now stored immediately before the first ritual transformation to prevent issues where the players race wasn&#39;t stored correctly due to alternative start mods.\r<br />[*]More clouds added to Dragontail Mountains.\r<br />[/list]\r<br />\r<br />[color=#0099ff][b][size=3]Version 1.2 - Crash Hotfix[/size][/b][/color]\r<br />[list]\r<br />[*]Custom music removed / disabled to attempt to prevent CTD&#39;s in all added locations.\r<br />[*]Fixed an issue with Lich form duplicating staves it equipped.\r<br />[*]Fixed an issue with Lich form re-equipping previously equipped staves, even if the player wasn&#39;t currently using one when they transformed.\r<br />[*]Fixed an issue with the Broker&#39;s dialogue where she wouldn&#39;t give the player the book &#39;Necromancer&#39;s Moon&#39;.\r<br />[/list]\r<br />\r<br />[color=#0099ff][b][size=3]Version 1.1 - Bugfixes and music / voice over content update[/size][/b][/color]\r<br />[list]\r<br />[*]Fixed an issue with E3 demo content reappearing while Undeath was active.\r<br />[*]Players can no longer be a Vampire Lord or Werewolf AND a Lich at the same time: becoming one will cure the player of their diseases and remove the associated transformations.\r<br />[*]Fixed an issue with a conflict which was preventing &#39;Hitting the Books&#39; from starting.\r<br />[*]If a staff is equipped in your right hand it will now be used after transforming into a Lich.\r<br />[*]Increased the speed of the Lich whilst transformed.\r<br />[*]Shade of the Revenant changed from 6 days back up to 8 as it was in Oblivion.\r<br />[*]Undeath passive now provides immunity to diseases.\r<br />[*]Dark Pact can now be removed by recieving other blessings.\r<br />[*]Ravenscorn Map marker moved closer to the tower to ensure it is triggered.\r<br />[*]Tome of Unlife graphical bug fixed.\r<br />[*]Ravenscorn Spire has been optimised with room bounds.\r<br />[*]Solitude Sewer music tracks added.\r<br />[*]Ravenscorn Spire music tracks added.\r<br />[*]Brokers Shack music tracks added.\r<br />[*]Dragontail Mountains music tracks added.\r<br />[*]Scourg Barrow music tracks added.\r<br />[*]Apocrypha music tracks added.\r<br />[*]The Broker now has fully custom dialogue and can be asked about a number of topics.\r<br />[/list]\r<br />\r<br />[color=#0099ff][b][size=3]Version 1.0 - Initial Release.[/size][/b][/color]\r<br />[list]\r<br />[*]Undeath released.\r<br />[/list]\r<br />\r<br />&#39;Skyrim: Undeath&#39; is an add-on for TESV: Skyrim that will give the player the opportunity to become, through the course of their long and arduous journey of exploration and study, a terrifying and destructive undead Lich. &#39;Undeath&#39; also adds a host of necromancy themed content, both new and old, which does not modify existing perks in any way.\r<br />\r<br />[color=#ffffff][b]Dawnguard AND Dragonborn add-ons are required in order to play.[/b][/color]\r<br />\r<br />[list]\r<br />[*][color=#0099ff][b]Undeath Questline:[/b][/color] A fully featured questline that allows the player to discover and obtain the necessary components for the ritual of undeath.[/*]\r<br />[*][color=#0099ff][b]3 new dungeons:[/b][/color] Delve into the sewer network beneath Skyrim&#39;s capital of Solitude and root out its unseemly resident. Explore Hermaeus-Mora&#39;s Daedric realm of Oblivion in search of dark and buried secrets, and for those familiar with TES: Daggerfall, return to the Dragontail Mountains and the infamous crypt network that the King of Worms and his sinister followers once called home at Scourg Barrow.[/*]\r<br />[*][color=#0099ff][b]2 necromancer lairs: [/b][/color]Claim two new fittingly desolate lairs for necromancer or dark themed characters to call their own, and upgrade as they see fit.[/*]\r<br />[*][color=#0099ff][b]New Vendor: [/b][/color]Seek out the mysterious &#39;Broker&#39; and barter for poisons, black soul gems, flesh and hearts. A purveyor of resources other merchants would not dare to provide&#33;[/*]\r<br />[*][color=#0099ff][b]Shade of the Revenant: [/b][/color]Show your devotion to the Black Arts by offering grand soul gems to the forgotten patron of Necromancy at his altars. Evoke dark magic to blacken Grand and greater soul gems for your use&#33;[/*]\r<br />[*][color=#0099ff][b]Poison Spells: [/b][/color]A range of virulent poison and decay spells have been added to magical vendors across Skyrim as would befit the arsenal of a necromage.[/*]\r<br />[*][color=#0099ff][b]Dark Pact: [/b][/color]There is great power in the spilling of blood. Make an offering of your own at certain altars and gain the power to control up to five reanimated creatures at once.[/*]\r<br />[*][color=#0099ff][b]Imported Books: [/b][/color]A range of necromantic lore, new and old has been imported from past TES titles.[/*]\r<br />[*][color=#0099ff][b]Custom Soundtrack: [/b][/color][url=https://www.youtube.com/watch?v=uT8IWuCuSY8&feature=c4-overview&list=UU-PyKXixq5mnjcAv_fOhs4g]Full custom soundtrack for all new areas composed by León van der Stadt.[/url][/*]   \r<br />[*][color=#0099ff][b]Voiced NPCs:[/b][/color] Fully voiced new vendor and possibly more&#33;[/*]\r<br />[/list]\r<br />\r<br />[center][color=#0099ff][b][size=4]About[/size][/b][/color][/center]\r<br />\r<br />Skyrim - Undeath is my (one of many in Skyrim&#39;s modding history) attempt to create an immersive Lichdom mod for The Elder Scrolls V: Skyrim. It will have a questline that sees the player track down and stop a powerful necromancer and his followers who are seeking the lost secrets of this heretical transformation, and ensure they remain hidden... or claim them for themselves. This mod [color=#ffffff][b]will [/b][/color]require both Dawnguard AND Dragonborn.\r<br /> \r<br />This was a personal project I began a while back, and I&#39;ve been working on it whenever I&#39;ve had the chance for a very long time. The ability for a character to transcend their mortality and become an immortal undead Lich is always a concept that has fascinated and excited me, but actually making this a reality in Skyrim has taken a lot of work.\r<br /> \r<br />In many ways, the path to modifying Skyrim to allow the player to become a Lich has felt like the actual elusive, and arcane process of Lichdom itself. I&#39;ve researched and studied necromancy and lore for years to implement it in a sensible way, and had to learn the esoteric Black Arts of scripting, modelling and texturing to fulfill my ambitions. I&#39;ve seen many great projects filled with passion and great ideas rise and fall around this concept, with others attempting the process giving up in frustration or lack of time. But through determination, perseverance and many months of insane experiments that has driven me almost to the very brink of my sanity, I have almost finally achieved my goal.\r<br />\r<br />[b][size=3][color=red]Please note this is only version 1.0.0 and no compatibility testing with other mods has been done yet&#33; Please PM any major issues to me, and I will endeavor to fix these for the next update. Install at your own peril&#33;[/color][/size][/b]\r<br />\r<br />[center][color=#0099ff][b][size=4]FAQ[/size][/b][/color][/center]\r<br />\r<br />Q: How do I start the first quest?\r<br />A: The first quest of Undeath will begin automatically when you have reached level 30 or higher.\r<br />\r<br />Q: How can I enter the Solitude Sewers?\r<br />A: The sewers have access holes in the basements of The Winking Skeever, The Bard&#39;s College and Castle Dour. You can also find entrances to the southeast and northeast of the city.\r<br />\r<br />Q: I have killed Antioch, but what do I do now?\r<br />A: Make sure that you explore and perhaps you&#39;ll come across what he was looking for&#33; The items you&#39;ve collected may come in handy as well...\r<br />\r<br />Q: I&#39;ve started &#39;The Path of Transcendence&#39;, but where do I go now?\r<br />A: Fast travel back to any of the cities in Skyrim, and keep an eye open for a message...\r<br />\r<br />Q: I can&#39;t use the Necromantic Altars?\r<br />A: The Necromantic Altars require maximum Enchanting skill in order to use.\r<br />\r<br />Q: How do I customise the final appearance of my Lich form?\r<br />A: The items you collect over the course of the questline are important and will impact your final appearance as a Lich. Make sure that you take note of their significance and choose (or create) ones which will combine for the final appearance you want. For instance: Radiant Raiment in Solitude are tailors, they probably have some dye lying around...\r<br />\r<br />Q: I keep dying during the Lich ritual&#33;\r<br />A: Make sure that you have read the Ritual Notes very carefully&#33; Becoming a Lich is a complex process, and a single missing component can spell doom for you. Make sure that you have all the items it requires, and that you&#39;re performing the ritual in the correct location. If your UI disappears during the ritual, then you&#39;ve done everything correctly.\r<br />\r<br />Q: I&#39;m performing the ritual correctly, but I keep dying still?\r<br />A: This seems to be an issue with the amount of health you have. Make sure that you have more than 100 health before beginning the ritual, as it may kill you anyway if you are too weak&#33;\r<br />\r<br />Q: I&#39;m performing the ritual correctly, but I&#39;m NOT dying?\r<br />A: Again this is an issue with the amount of health you have, or possibly your difficulty settings (as this will increase / decrease damage accordingly). Try lowering your health using the Equillibrium spell or similar before attempting the ritual again.\r<br />\r<br />Q: How do I change spells as a Lich?\r<br />A: Press the sneak button, and the spell select menu will come up after a short animation.\r<br />\r<br />Q: The spell select menu isn&#39;t coming up even after the animation...\r<br />A: This seems to vary across computers, but I think it may have something to do with a script event not registering correctly. Transforming back to human form, and then to Lich form again should solve the issue.\r<br />\r<br />Q: How do I change back to human form?\r<br />A: Press the shout / power button again whilst in Lich form to transform back. Note that there will be a short cooldown before you can transform back into Lich form, so be sure to use this carefully.",
  "categoryId": "35",
  "version": "1.3",
  "author": "Antioch08",
  "createdUnix": "1376878380",
  "updatedUnix": "1380059055",
  "containsAdultContent": false,
  "uploadedBy": "Antioch08",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000047994",
      "name": "Skyrim - Undeath v1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91109",
      "fileName": "Skyrim - Undeath-40607-1-0-0.rar",
      "uploadedUnix": "1376877227",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/237e9485e086635ed6810963ae337d9bc6802ddc5b0b6d279e46349c2af18957/analysis/1407688110/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20-%20Undeath-40607-1-0-0.rar?fid=1000047994&ttl=1535821255&ri=8192&rs=8192&setec=ddb83aac476aead7df5b25bb62cf6c21"
    },
    {
      "fileId": "1000056988",
      "name": "Skyrim - Undeath v1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "105774",
      "fileName": "Skyrim - Undeath v1-1-40607-1-1.rar",
      "uploadedUnix": "1379802019",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/db5436887c8971a1ad5042e0d661b71c7276d040a403aa817e245fcaf9561d7d/analysis/1407730589/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20-%20Undeath%20v1-1-40607-1-1.rar?fid=1000056988&ttl=1535821256&ri=8192&rs=8192&setec=4693f1fbfedcc9aed1fc417c9fad4b2a"
    },
    {
      "fileId": "1000057156",
      "name": "Skyrim - Undeath 1-2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "105773",
      "fileName": "Skyrim - Undeath 1-2-40607-1-2.rar",
      "uploadedUnix": "1379865752",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/0203c7cb53d696b3fa1db6159121a6ba4c6f95fd4f16a989942a32e9fecde78e/analysis/1407731460/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20-%20Undeath%201-2-40607-1-2.rar?fid=1000057156&ttl=1535821256&ri=8192&rs=8192&setec=c77efe345961af93d818678c911ed5c3"
    },
    {
      "fileId": "1000057875",
      "name": "Skyrim - Undeath 1-3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "106276",
      "fileName": "Skyrim - Undeath 1-3-40607-1-3.rar",
      "uploadedUnix": "1380059055",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/127a3e3c055b5e8030315cd454b3b2b0ef7c1dad98386eee5270dca53784bba9/analysis/1407733722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20-%20Undeath%201-3-40607-1-3.rar?fid=1000057875&ttl=1535821257&ri=8192&rs=8192&setec=c3246f614c64a9839a314f1a9d588ca1"
    }
  ]
}