{
  "modId": 40627.0,
  "modName": "Balamichs Armor",
  "summary": "Balamich\\'s Armor is my first mod I ever made cone try it out!",
  "descriptionHtml": "Balamich Has given you the right to his Treasure at skyforge now you must fight him! there is a location near one of the shrines in white run with a note and locked chest (if the note is not there the location to Balamich is in wolf skull cave) the armor isnt really much a armor its more of a cover that gives you a cool look and stats.\r\nBalamichs Start- Is a blade with a whole new enchantment yes it can be disenchanted but it cannot me crafted or sharped\r\nBalamich\\'s Soul- is a plate that goes over your body that gives you a ghost like effect while keeping the armor you had currently on, on  (I am not sure if this will work with other armor mods)\r\nBalamich\\'s Sight- is a helmet with frost clock, dragon priest ultra mask and a few other things on it\r\n\r\nHAPPY HUNTING EVERY ONE (Please i can\\'t stress enough if there is any bugs or glitches tell me I found a few already that i am trying to fix but so far I can\\'t)\r\n\r\nUpdated got rid of the .9.bak thanks you for pointing that out to me and still looking for bugs please again i know i\\'m annoying tell me if you see any bugs thanks you\r\n\r\nFuture updates- Making Balamich stronger, Story line, New Npcs, New locations, New weapons and armor and new Followers. \r\n\r\nHi everyone I would like some help on a small project I am doing called The Span It comes with a new Playable Character, New Npc, Ne Followers, New weapons and armor and new Story line I have Followers, Playable Character,  and weapons/armor I just need to make the story line and npc. The followers for some reason I made a location for them and when I walk out of that location they dont fallow so I need help with that, Some times the playable character body doesn\\'t show only the head will so I need help with that and for the rest I need a good story line and I need some people to help me write it out and make the right Npcs for it. \r\n\r\nNew-\r\nTime Shifter Race\r\nTime shifter armor\r\nBow of Time\r\nShifter Followers \r\nLocation: The Span \r\n\r\nPlease message me at  https://www.facebook.com/DeadMansVillage, or if you dont have a facebook here or skype my skype name is deammansvillage but try to get me on here or facebook thank you ",
  "categoryId": "36",
  "version": "0.0.2",
  "author": "deadmansvillage",
  "createdUnix": "1376914595",
  "updatedUnix": "1377062623",
  "containsAdultContent": false,
  "uploadedBy": "deadmansvillage",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048070",
      "name": "Balamich",
      "version": "0.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "82",
      "fileName": "Balamich-40627-0-0-1.zip",
      "uploadedUnix": "1376914589",
      "modVersion": "0.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/0231e32176eb888ff4fc152d490a440da19b7f3db8696c0633429c18125b454c/analysis/1407688756/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balamich-40627-0-0-1.zip?fid=1000048070&ttl=1535821275&ri=8192&rs=8192&setec=580c327c553e650eaeefa7901d378368"
    },
    {
      "fileId": "1000048524",
      "name": "Balamichs armor",
      "version": "",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "82",
      "fileName": "Balamichs armor-40627-.zip",
      "uploadedUnix": "1377062623",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/dd450a823502a9130421e7a65574d039b72daffc0ad84c0176896e63d17dccf3/analysis/1407691445/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balamichs%20armor-40627-.zip?fid=1000048524&ttl=1535821276&ri=8192&rs=8192&setec=28ed5d9ad007670e589a0a3496d10b54"
    }
  ]
}