{
  "modId": 40624.0,
  "modName": "Race - Furians",
  "summary": "The combination of Khajiit and Nord background and abilities.",
  "descriptionHtml": "This isn&#39;t really anything special just started modding so unfortunately there&#39;s no tails or ears (Not that I was going to add them but still). Just wanted to create my own race for my own purposes, if you were looking for something flashy then this is definitely NOT the race mod for you. Still working on my  skills with the intent of getting bigger and bigger as I progress. So when and if the day comes, I will definitely return to this mod and create some eye-shine and cat-like eyes for the character. This should work fine without any problems at all but if there are plz message me.\r<br />\r<br />Also if someone is nice enough I&#39;d like to know how to makes the vampire eyes work for the Furians.\r<br />\r<br />- If you really want the experience of playing a Furian with the aesthetic look, I would download Flans Eyes for Skyrim by DarNilavu, he makes some great eyes. Nearly dead on what I want to do with the Furians.\r<br />\r<br />- I should say that even if this is only a small mod that&#39;s just starting out, it wouldn&#39;t have at all been possible without the tutorial put up by expired6978. As this is by the tutorial that means having the latest compatibility patch by him.\r<br />- Those of you who are wondering, he&#39;s wearing the Town Guards armor retexture by Gulchanar.\r<br />- I use only two ENB&#39;s from the same person in this case it&#39;s Stakado Cinemascope ENB, Classic by stakado.\r<br />\r<br />On a side note, if you&#39;re interested and wondering how this could possibly be lore-friendly mmm..well I guess it&#39;s debatable. The thing is that there&#39;s no real explanation of what comes of the union of a Nord or a Khajiit or a Imperial with an Argonian, you just don&#39;t know&#33; The Furians were my interpretation of it. My own story for the Furians being that they are outcasts, simply for being what they are as the birth of a Furian is EXTREMELY RARE. They are in another light also my view of the primal side of human nature. Trust me I&#39;ve the whole story worked out but whether or not you&#39;re actually interested just let me know. By the by, that sexy guy in the pics his name is J&#39;Kiro all ye look upon him and fear&#33;&#33;&#33; Bwahahahahahahaaa&#33;&#33;&#33; JKJK, on the inside he&#39;s a cuddly bipolar bear.",
  "categoryId": "34",
  "version": "V1.0",
  "author": "Amberlyn0007",
  "createdUnix": "1377265962",
  "updatedUnix": "1377265505",
  "containsAdultContent": false,
  "uploadedBy": "Amberlyn0007",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048972",
      "name": "FurianRace",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "FurianRace-40624-V1-0.zip",
      "uploadedUnix": "1377265505",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4d786a8869000a0333f8f3f03db2441114287e1b218bea1f830ce31705d37088/analysis/1407693739/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FurianRace-40624-V1-0.zip?fid=1000048972&ttl=1535821271&ri=8192&rs=8192&setec=628343b79f36af6fed2cc967b041d898"
    }
  ]
}