{
  "modId": 40651.0,
  "modName": "Mask Of Corvo",
  "summary": "Adds a new 2k hi-res, craftable, Corvo-style mask with built-in thermal NPC positioning (Dark Vision) and heartbeat sensing abilities + more.\r<br />\r<br />Includes a mask variant without Dark Vision.",
  "descriptionHtml": "[center][/center][center][color=grey][/color][img]http://i.imgur.com/mSNrnNK.png[/img][/center]\r<br />[center][color=grey]\r<br />If you like any mod and have a spare moment, why not hit that [img]http://i.imgur.com/avH9qSO.png[/img] button? It helps more than you might think&#33;[/color][/center]\r<br />[center][b][color=yellow]Release Trailer[/color][/b][/center]\r<br />\r<br />[img]http://i.imgur.com/FvBOCzp.jpg[/img][youtube]gjvCjQhtD8g[/youtube][img]http://i.imgur.com/2uqNluy.jpg[/img]\r<br />[font=Courier New][size=4]\r<br />[/size][/font]\r<br />[center][b][color=yellow]Description[/color][/b]\r<br />\r<br />\r<br />This is a retexture mod at its core, but with many other unique features and more planned. This mod adds a semi lore-friendly, standalone craftable new mask to the game, which was inspired by the infamous mask of Corvo Attano in the great Bethesda game, Dishonored. It also features a small backstory where you can find the mask without having to craft it. Currently, it uses the same vanilla mesh as all of the other Dragon Priest Masks, but features a unique texture every stealthy player out there should enjoy. It uses high quality 2k diffuse texture maps with custom made enhanced normal maps for both the hood and the mask.\r<br />\r<br />It is light armor only and has the same base armor rating as the ebony Dragon Priest Mask Nahkriin (23) but also features several built-in enchantments, one of which is a unique ability only to this mask and caters for the stealth approach in combat, especially at night.\r<br />\r<br />[u]The enchantments are as follows:[/u]\r<br />\r<br />[i]&bull;&#34;+20% Sneak&#34;\r<br />&bull;&#34;+20% Archery&#34;\r<br />&bull;&#34;Double sneak attack damage with one-handed weapons.&#34;[/i]\r<br />[i][b]&bull; Dark Vision[/b] - &#34;Built-in spyglass provides real-time thermal positioning and heartbeat sensing when sneaking including information on the direction NPCs face.&#34;[/i][/center]\r<br />\r<br />[img]http://i.imgur.com/cFLvD1c.jpg[/img][img]http://i.imgur.com/TmUqHF9.jpg[/img]\r<br />[center]Dark Vision is a unique detect life ability which does not use mana or stamina but is activated when crouching/sneaking. The orange spyglass detects the thermal sources of lifeforms. Simultaneously, the blue spyglass provides information on the direction NPCs are facing. Note that the blue spyglass only picks up this information when the target is in in clear sight unobstructed by anything like walls. The orange thermal detection spyglass on the other hand, is able to detect through obstacles such as walls. \r<br />\r<br />Its power is balanced out by the fact that unlike the Detect Life spell and Aura Whisper shout, the range of Dark Vision life detection is only 120 outdoors (approx. 22 running paces worth) and 80 indoors (approx. 15 running paces worth), both of which are significantly shorter ranges than the Detect Life spell or shout. \r<br />\r<br />Lastly, Dark Vision features a heartbeat sensing algorithm which relays heartbeat audio back to the player whenever a lifeform is detected and in range. This is particularly useful when hunting at night since the lifeform does not have to actually be in sight, just in range, so you may crouch at any given time and receive an audio signal if a lifeform is within the range of the life detection system.\r<br />\r<br />[u]Important:[/u]\r<br />\r<br />For those who do not like this ability, and who just want the retextured mask with all of the same other standard enchantments, I have created another mask variant with [b]No Dark Vision (NDV)[/b]. The mask has the same base armor rating and similar crafting/tempering recipes, except you do not need Fire Salts and Glow Dust to craft this simpler variant. You [i]do[/i] still need the Arcane Blacksmith perk and the Skyforge to forge the mask though.\r<br />\r<br />\r<br />[u]How do I get Mask Of Corvo?[/u]\r<br />\r<br />You can only craft the mask at the Skyforge in Whiterun. I did this in order to avoid cluttering every forge in the game and also because I felt that as the Skyforge is the most powerful forge in all of Skyrim, it would make sense that a powerful item like Mask Of Corvo could only be forged there.\r<br />\r<br />You need the Arcane Blacksmith perk in order to forge the mask. The mask should be found under &#34;Steel&#34; in the forge menu.\r<br />\r<br />You can also upgrade the armor rating of the mask at any workbench thereafter.\r<br />\r<br />[b][color=red]Alternatively, new to v1.1, if you do not wish to craft the mask, look opposite the road to the north of the Dark Brotherhood Sanctuary in the spriggan ruined barrow named &#39;Roadside Ruins&#39; on your map. It is located just northwest of Falkreath. You will find a certain Sareth..[/color][/b][/center]\r<br />\r<br />[center][u]Recipe:[/u]\r<br />\r<br />[b]&bull;Leather x5[/b] .... (for the hood, the under-netting of the mask and the neck-cover)\r<br />[b]&bull;Leather strips x7[/b] .... (for the connective threads of the mask and the hood threading)\r<br />[b]&bull;Steel Ingot x2[/b] .... (for the hood buckles, the chainmail collar and the alloyed mask plate armor)\r<br />[b]&bull;Small Dwarven Metal Plate x1[/b] .... (for the electromagnetic round central bracket on the forehead)\r<br />[b]&bull;Glow Dust x1[/b] .... (for the blue spyglass)\r<br />[b]&bull;Fire Salts x1[/b] .... (for the orange spyglass)[/center]\r<br />\r<br />[center][u]Note:[/u]\r<br />\r<br />&bull;Glow Dust can be found on Wisps/Wispmothers and can be purchased from relevant vendors or stolen.\r<br />&bull;Fire Salts can be found on Flame Atronachs and can be purchased from relevant vendors or stolen.\r<br />&bull;Small Dwarven Metal Plates can be found on Animunculi or in any of the numerous Dwemer Ruins.\r<br />\r<br />\r<br />[b][color=yellow]Version History[/color][/b]\r<br />\r<br />[u]VERSION 1.1 (25/08/2013)[/u]\r<br />\r<br />&bull; Added a small backstory to the mask via a mini search and learn quest \r<br />plus a way of obtaining the mask without crafting it. Look opposite the \r<br />road to the north of the Dark Brotherhood Sanctuary in the spriggan \r<br />ruined barrow named &#39;Roadside Ruins&#39; on your map. It is located just \r<br />northwest of Falkreath. You will find a certain Sareth..\r<br />&bull; Edited the orange eye of the mask slightly to make more pronounced.\r<br />&bull; Lowered the volume of the heartbeat sensing very slightly.\r<br />\r<br />[u]VERSION 1.0 (24/08/2013)[/u]\r<br />\r<br />&bull; Initial release.[/center]\r<br />\r<br />[center][color=yellow][b]Compatibility[/b][/color]\r<br />\r<br />The mod is fully compatible with [url=http://skyrim.nexusmods.com/mods/35117//?]Unique Dragon Priest Masks - HD textures[/url] by skyrimaguas and should not overwrite anything.\r<br />\r<br />The mod is also fully compatible with [url=http://skyrim.nexusmods.com/mods/35564/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D35564%26preview%3D&pUp=1]Gifts of the Outsider - Dishonored in Skyrim[/url] by Madrilous. I actually recommend using both mods together for the ultimate Dishonored experience in the Skyrim world&#33;\r<br />\r<br />[color=yellow][b]Requirements[/b][/color]\r<br />\r<br />None. Plug and play. This mod has no master file dependencies and does not require SKSE. Just make sure you have the latest edition of Skyrim installed and you are good to go.\r<br />\r<br />[b][color=yellow]Installation[/color][/b]\r<br />\r<br />Download and install using Nexus Mod Manager and activate the mod in the manager.\r<br />\r<br />If you wish to manually install, download manually and extract the Data folder to the root Skyrim folder and say yes to the &#39;merge folder&#39; notifications. Nothing should be overwritten.\r<br />\r<br />Uninstallation is as easy as deactivating the mod in the manager, or manually removing all of the files which you installed in your Skyrim folder from the archive.\r<br />\r<br />[b][color=yellow]Permissions[/color][/b]\r<br />\r<br />You must get permission from me before you are allowed to modify my files to improve it. Send me a PM. \r<br />\r<br />Please do not upload this mod to any other site - I would like to keep this Nexus-exclusive.\r<br />\r<br />[b][color=yellow]Frequently Asked Questions[/color][/b]\r<br />\r<br />\r<br />[u][i]Why does the mask look like it has a Dragon Priest Mask from the side near the lower section?[/i][/u]\r<br />\r<br />Because it uses the same vanilla mesh as all the other Dragon Priest Masks. This will be fixed in the next update though, when I edit the mesh itself, instead of just retexturing.\r<br />\r<br />[u][i]The mask does not look like that from DIshonored, the game. Please change it.[/i][/u]\r<br />\r<br />As the saying goes, haters gonna hate. This is obviously a matter of opinion and taste, which varies from person to person. Personally I think it is very clearly inspired by the mask from Dishonored, but not necessarily anything more than that. It is my own creation which I built from scratch and which I have decided to share with everyone else. As I have said before, if you want an exact replica of the mask from Dishonored, then you can just port over the relevant textures and meshes over to Skyrim, if you own the PC versions. But be warned that not only is this illegal but the assets just look completely out of place in the Skyrim world (if you check the videos, the mesh of the mask is very oddly shaped on the player in-game, and the textures just look plain and completely non-immersive in the Skyrim universe). I am overall satisfied with my final texture result, so I don&#39;t think I will change it too much, but the mesh will be the next project, certainly.\r<br />\r<br />[u][i]What programs did you use to retexture?[/i][/u]\r<br />\r<br />Adobe Photoshop, GIMP and CrazyBump.\r<br />\r<br />[u][i]How long did this take to make?[/i][/u]\r<br />\r<br />About a month overall. But it was just a little personal mod that I worked on for fun and tweaked every so often in my free time.\r<br />\r<br />[u][i]What armor are you wearing in the screenshots?[/i][/u]\r<br />The Aesir Armor by Omesean. You can find it [url=http://skyrim.nexusmods.com/mods/35094//?]here[/url].\r<br />\r<br />[u][i]This mod is not exactly lore-friendly..[/i][/u]\r<br />\r<br />Correct, however I never claimed it was. But it should be fun to use. Sometimes fun wins over lore-friendliness. There are plenty of other great mods which are totally not lore-friendly. It also pays homage to another much-loved Bethesda game and character.\r<br />\r<br />[u][i]Is this type of mod allowed? (related to porting)[/i][/u]\r<br />\r<br />[b]Yes. Zero assets from the Bethesda game, Dishonored, or any other game, are featured in this mod. Assets include things such as textures, meshes, sounds and scripts. All of the textures in this mod were made from scratch using Photoshop, GIMP, CrazyBump, public domain image resources and my graphics tablet.[/b] There are many similar mods available on the Nexus which draw inspiration from another game and attempt to bring something from that game into the world of Skyrim but all of which is original work by the author, using no assets from that game. I remember seeing a mod which ported over all of the assets of the Dishonored Lord Protector armor set which was later (rightly) taken down as this is not allowed as the act of distributing ported content from a game for use in another game is copyright infringement and piracy. That is not the case with this mod. Everything is original work by the mod author.\r<br />\r<br />Visit [url=http://forums.nexusmods.com/index.php?/topic/377405-porting-content-from-other-games/]this thread[/url] for more in-depth info on porting, courtesy of Dark0ne.[/center]",
  "categoryId": "54",
  "version": "1.1",
  "author": "CovertKish",
  "createdUnix": "1377372891",
  "updatedUnix": "1377398094",
  "containsAdultContent": false,
  "uploadedBy": "CovertKish",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049264",
      "name": "Mask Of Corvo - v1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "21909",
      "fileName": "Mask Of Corvo - v1_0-40651-1-0.rar",
      "uploadedUnix": "1377364975",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4d49010e18139633eb58a79a04179a6e45d44011ab1c6d8e824fbac7bf0a11f3/analysis/1407695175/",
      "changelogHtml": " • Initial Release. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mask%20Of%20Corvo%20-%20v1_0-40651-1-0.rar?fid=1000049264&ttl=1535821306&ri=8192&rs=8192&setec=e80af6013ea0c3351613b23e8193ff32"
    },
    {
      "fileId": "1000049365",
      "name": "Mask Of Corvo - v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22202",
      "fileName": "Mask Of Corvo - v1_1-40651-1-1.rar",
      "uploadedUnix": "1377398094",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e6e4d0eb5dbef6caada5e22f1201752c159dfd8e2534f7b7ab0c6a9847ea7807/analysis/1407695758/",
      "changelogHtml": " • Added a small backstory to the mask via a mini search and learn quest plus a way of obtaining the mask without crafting it. Look opposite the road to the north of the Dark Brotherhood Sanctuary in the spriggan ruined barrow named &#39;Roadside Ruins&#39; on your map. It is located just northwest of Falkreath. You will find a certain Sareth..\r<br />• Edited the orange eye of the mask slightly to make more pronounced.\r<br />• Lowered the volume of the heartbeat sensing very slightly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mask%20Of%20Corvo%20-%20v1_1-40651-1-1.rar?fid=1000049365&ttl=1535821306&ri=8192&rs=8192&setec=2d6a0a8669706313b8a62d09e47b5f1d"
    }
  ]
}