{
  "modId": 4065.0,
  "modName": "ZyrephEndor Save Game",
  "summary": "This is a unique save game file that involves a story and a heavly modified gameplay",
  "descriptionHtml": "----News-----\r\nNow that the Creation Kit is out, i can finaly evolve this save into something much larger.\r\nStay tuned everyone!\r\n------\r\n\r\nAfter playing Skyrim alot and created almost over 7 characters, i wanted to share a specific character that i feel proud of making.\r\nUnlike other save game files you download, this one comes with a story, and a heavly modified gameplay, higher difficulty and a unique RPG experience like no other.\r\n\r\n---Installation----\r\n\r\nExtract the saves folder into the C:\\\\Users\\\\your name\\\\Documents\\\\My Games\\\\Skyrim folder.\r\n\r\nThen extract the textures folder into the Skyrim Data folder.\r\n\r\nWARNING: Remember to backup your old save game files before extracting.\r\n\r\n-----Story-----\r\n\r\nA Jarl has been killed, by whom, is not known, but everyone sees you as the murdurer. Whomever who managed to kill a jarl and put the guilt on you, is a mystery. The Whiterun guards found you and took you to their Jarl. He ordered the guards to knock you cold and leave you out in the wilds to die, either by Sabrecats or worse.\r\n\r\nIt was a rainy day, your cold body is on the ground, letting the soft drops of rain touch you without you notice. A group of wolves came by,\r\nand they thought you as a easy pray. Before they managed to bite fataly on you, a giant got to you and killed the wolves, saving you.\r\n\r\nThe Giant took you to their camp, Bleakwind Basin, tending to your wounds. When you woke up, your memories where just a mist. You have no memory of your real name, your past, your family, everything, has been forgotten, all your memories that all remains, is with the giants who saved you.\r\n\r\nYou became a member of their family, and they named you ZyrephEndor, The Engulfing Sister. As a part of their family, they painted you with their family signs, and grants you a GreatSword, potions and some ingredients near the bowl. Your safe heaven and home, is in this camp, BleakWind Basin, but elsewhere, everyone sees you as a criminal for a murder that you did not commite.\r\n\r\nSomehow, you must regain your memories, and redeem yourself and prove that you are innocent, and find the real killer, whomever that might be.\r\n\r\n\r\nYou are ZyrephEndor, The Engulfing Sister from BleakWind Basin.\r\n\r\n---\r\n\r\n\r\n--Advantages--\r\n\r\n1:Most Giants in Skyrim are your allies, and will protect you from dragons and other enemies that could kill you.\r\n\r\n2:After spending time with the Giants, you have some improvements in Two-Handed Weapons and Alchemy, and also with some Melee Hand to Hand damage.\r\n\r\n3:Some extra perks has been added for Two-Handed and Alchemy. \r\n---Disadvantages---\r\n\r\n1: Due to your violent past with the guards and the Jarl when you where knocked cold and lost almost all your memories, allmost all your spellcasting skills are at Zero, and your Magicka is only at 10 PTS.\r\n\r\n2: Due to the murder pointed you as the murderer, a very large bounty are placed at you in most towns such as Whiterun and Rorikstead.\r\n----\r\n\r\n\r\nAny console code that removes bounty from you can break the RPG feeling to this story, so i recommend that you DONT use that code.\r\n\r\nRemember that you cant just go to any city or town and buy items as you please, so you need to find items in the fields, such as potions, weapons and armors and more from bandits, vampires and other type of enemies.\r\n\r\nTo follow the story at its best, try to avoid Whiterun and most other larger cities at all cost. Smaller towns, such as Riverwood, are alright to visit.\r\n\r\nRemember that this save game file and story is meant for an Argonian.\r\n\r\n----To do list----\r\n\r\nAdd more bounty to all the large cities in the game.\r\n\r\nDONE: Add more Giants as friendlies.\r\n\r\nDONE: Modify The Argonian Warpaint on the PC character with matching Giant painting.\r\n\r\nFine tune all the skills better.\r\n\r\nTry to add the player character to the Giant Faction so all giants will be allies.\r\n\r\n----\r\n\r\nLike usual, critics are wellcome and ideas are also wellcome.",
  "categoryId": "43",
  "version": "0.5",
  "author": "Cebius2",
  "createdUnix": "1324258760",
  "updatedUnix": "1324313677",
  "containsAdultContent": false,
  "uploadedBy": "cebius2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "12049",
      "name": "ZyrephEndor v05",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1459",
      "fileName": "ZyrephEndor v05-4065-0-5.zip",
      "uploadedUnix": "1324313677",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/28f8c7b2fb537f35c855383028d695f4f23f00f311872388941e0fada01883d3/analysis/1406536986/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ZyrephEndor%20v05-4065-0-5.zip?fid=12049&ttl=1535759587&ri=8192&rs=8192&setec=71f791cd50b1b624916935effb9ff5fe"
    }
  ]
}