{
  "modId": 40672.0,
  "modName": "Dovahkiins Retreat",
  "summary": "This is a simple house mod made for the buddying Dovahkiin, it is located on the waterfall close to the road that connects Riverwood and Whiterun. It includes an outdoor are with smithy, alchemy, enchanting and sort of camp while the interior includes everything a house should include and more.",
  "descriptionHtml": "I realised in Skyrim that the player homes that Bethesda provided did not include everything you could ever want or need in one home, it made you compromise on some parts and most of the time did not have enough of some things such as chest and mannequins. So, I decided to create my own player home that includes everything a Dovahkiin could ever need.\r\n\r\nThis house, called Dovahkiin\\\\\\'s Retreat, is located on the waterfall next to the road that connects Riverwood with Whiterun, the house is absolutely free all you need to do is find it and it\\\\\\'s yours.\r\n\r\nFeatures\r\nThe exterior of the house includes:\r\nBlacksmith Forge\r\nGrindstone\r\nWorkbench\r\nSmelter\r\nTanning Rack\r\nAlchemy Lab\r\nEnchanting Table\r\nCooking Pot\r\nBedroll\r\nStorage for ore, ingots, soul gems, ingredients, potions, poisons and leather\r\nGeneral Storage\r\n\r\nThe Interior of the house includes:\r\n2 Alchemy Labs\r\n2 Enchanting tables\r\nSmelter\r\nForge\r\nWorkbench\r\nGrindstone\r\nTanning Rack\r\nWood cutters block\r\nAlchemy Garden\r\nKitchen with Oven and Cooking pot\r\n27 Book shelves\r\n21 Display cases\r\n12 dagger display cases\r\n24 Mannequins\r\n63 Weapon racks\r\n12 Sword and shield plaques\r\n12 weapon plaques\r\nLots of Storage\r\n\r\nRequirements\r\nThis mod requires the latest version of Skyrim as well as the Dawnguard and Hearthfire DLCs.\r\n\r\nInstalling Dovahkiin\\\\\\'s Retreat\r\nTo install Dovahkiin\\\\\\'s retreat simply copy the .esp file into the Skyrim Data folder and it should run fine. For a simple installation simply use the nexus mod manager, the link to that is here: http://skyrim.nexusmods.com/mods/modmanager//? \r\n\r\nUpdating Dovahkiin\\\\\\'s Retreat\r\nWhen updating Dovahkiin\\\\\\'s Retreat be sure to remove all your items from the interior and exterior of the house before copying the latest .esp file into the Skyrim Data folder. When updating simply delete the original .esp file and replace it with the new one. \r\n\r\nUninstalling Dovahkiin\\\\\\'s Retreat\r\nWhen uninstalling Dovahkiin\\\\\\'s Retreat be sure to remove all you items from the interior and exterior of the house. When that is done exit the game and delete the .esp file from the Skyrim Data folder. \r\n\r\nCompatability\r\nThis mod should be compatible with most mods out there, the only exception are other mods that are located in the same area as my mod. This will most likely cause lots of glitches and screw up the textures. \r\n\r\nKnown Bugs\r\nThere aren\\\\\\'t that many bugs that I have found in this mod, the only one bug that I found concerns the mannequins. Most of the time the mannequins will be floating in the air, disappear or be in a strange pose, although you will still be able to activate them. To fix this simply put something on a mannequin or if it already has something take it off, exit the mannequin menu and then put it back on.\r\n\r\nNotes/future updates\r\nThis is my very first mod so try not to criticise me too much however, I am open to constructive criticism. For a future update I am going to add a top floor to the house probably in a few weeks and (spoilers) in both the rooms with the daedric shrines I would like to make them interact able so that they give you a blessing like the ones of the divines. I don\\'t know how to do this at the moment so if anyone can send me any links to a good tutorial on how to do this I will implement it straight away. ",
  "categoryId": "67",
  "version": "1",
  "author": "Joel G",
  "createdUnix": "1376945902",
  "updatedUnix": "1376945721",
  "containsAdultContent": false,
  "uploadedBy": "slayer217",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048159",
      "name": "Dovahkiins Retreat",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "120",
      "fileName": "Dovahkiins Retreat-40672-1.zip",
      "uploadedUnix": "1376945721",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/34f672c618de8e84cdf6735c742a184b15592a3087ad8ff98ba25ec71cefeb5a/analysis/1407689587/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovahkiins%20Retreat-40672-1.zip?fid=1000048159&ttl=1535821324&ri=8192&rs=8192&setec=4399b10680aca9790124d36f9320e6b0"
    }
  ]
}