{
  "modId": 40683.0,
  "modName": "Clean Save After Intro Before Character Creation",
  "summary": "There\\'s a lot of saves similar to this but not quite what I was after so I did this for myself. Only uses Skyrim.esm & Update.esm.",
  "descriptionHtml": "There\\'s a lot of saves similar to this but not quite what I was after so I did this for myself. Only uses Skyrim.esm & Update.esm on version 1.9.whatever with no DLC\\'s enabled.\r\n\r\n[color=#5ea2e5][b][size=6]Why:[/size][/b][/color]\r\nI decided that as much as I make new characters I really need a clean save to save myself some time. Sure, I have Alternate Headstart but I found out today that it breaks Bridge Farm and I kinda want to try that out. Besides, what\\'s it really do besides give you a start? Anyways, I usually want to go through the default start anyways and I\\'d have to sit through the stupid intro no matter what if I did that. It just gives me a better immersive feel of what my character should be feeling that I don\\'t quite get if I start somewhere else then just run in the cave and give one of the guys a potion. It\\'s easier to not have my head nearly being chopped off fresh in my mind but I think it\\'s important that you make your decisions with that in mind and perhaps despite of that. Anywho, enough of my rambling!\r\n\r\n[color=#5ea2e5][b][size=6]What:[/size][/b][/color]\r\nThis save is right after you get off the carriage at the point the game enables saving. But it gives you a good 20-30 second leeway while calling up Ulfric, Ralof, and Lokir before forcing you to make your character so you can load in with this save with ONLY your essential MCM mods you need to adjust settings of and make your own clean save with your main mods set so you don\\'t have to do it again. After that you can re-enable all your mods and it\\'ll be much easier when you need to make a new character from now on.\r\n\r\n[color=#5ea2e5][b][size=6]How:[/size][/b][/color]\r\nWhat you need to do is open NMM and click the Plugins tab then at the bottom left hand side there\\'s a little sheet of paper icon thingy with a right arrow to export your load order to a txt file - do that! Once you do that then you can click the  [color=red](/)[/color] no smoking looking symbol thing to disable all your mods, then check Update.esm. From this point if you load up skyrim and start a new game then save where I did (open console and type: save \\\"save name here\\\") you will have reproduced what I\\'ve done.\r\n\r\n[color=#5ea2e5][b][size=6]Recommended:[/size][/b][/color]\r\nBut to go a step further you can then enable [u]only[/u] the specific big MCM mods that you know you aren\\'t going to remove and you hate having to set up every time you make a new character. Then you make a save that has those all set up but no other mods. That way you have a 100% clean save and a mostly clean save with all your big mods set up. You\\'d probably start most your new saves from the latter one for your own convenience.\r\n\r\nAfter you make that then just go back to NMM and click the little paper sheet icon with the left arrow and import your load order\\'s txt file that you saved and you\\'re right back where you were before but now with some nice clean saves to start your game with.\r\n\r\nAnyways, I highly recommend doing this. It\\'s made my life much easier and hopefully it can make yours easier too.",
  "categoryId": "43",
  "version": "1.0",
  "author": "XunAmarox",
  "createdUnix": "1376953952",
  "updatedUnix": "1376953579",
  "containsAdultContent": false,
  "uploadedBy": "XunAmarox",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048195",
      "name": "Clean Save After Intro Before Character Creation",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1021",
      "fileName": "Clean Save After Intro Before Character Creation-40683-1-0.7z",
      "uploadedUnix": "1376953579",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9968d3e9e84ec62d1a36827f74168fb717102d90fd646d6d9f107a05d2328fbe/analysis/1407689770/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clean%20Save%20After%20Intro%20Before%20Character%20Creation-40683-1-0.7z?fid=1000048195&ttl=1535821339&ri=8192&rs=8192&setec=f8ca119a2faadc3810838af09a5bf9ee"
    }
  ]
}