{
  "modId": 40752.0,
  "modName": "Balanced Magic -French Translation-",
  "summary": "Équilibre la magie pour quel devienne aussi puissante que les autres spécialisation à haut niveau",
  "descriptionHtml": "Mod NON TESTÉ (peut contenir quelque bug de traduction ou/et des fautes)\r\nSignalé les fautes si vous voulez\r\n\r\nRequiert Dawnguard (ou enlevé balanced magic dawngaurd.bsa )\r\n\r\nMod Vo ici : http://skyrim.nexusmods.com/mods/2275//?\r\n\r\nGénéral\r\n- La magie se régénère plus vite au combat (60% au lieu de 33%)\r\n- Les coûts des « double sort » est inférieur (2,4 x au lieu de 2,8 x) et est plus efficace (2,6 x au lieu de 2,2)\r\n- Les coûts des sorts ont été calculés de sorte à ce qu\\'ils ne diminuent pas à mesure que votre compétence s\\'améliore, mais plutôt que vos sorts deviennent plus puissants à mesure que votre compétence augmente.\r\n- Pas d’augmentation des coûts des sorts si une armure légère ou lourde est équipée, cependant, les coûts sont réduits si l\\'armure est enlevée, car les mouvements sont moins restreints, ce qui est  plus facile de lancer des sorts. Chaque emplacement (tête, corps, mains et pieds) qui est sans armure réduira le coût des sorts de 8%.\r\n\r\nAltération\r\n- Les sorts d\\'altération deviennent plus puissants à mesure  que votre compétence augmente (automatiquement)\r\n- Les points de talent « Altération Novice, Apprentie, Adepte(Spécialiste), Expert, et Maître » augmente la durée des sorts altération par rapport à votre niveau de compétence.\r\n(Par ex : si vous avez 100 d’altération et le point de talent « altération novice » la durée des sorts novices est doublée)\r\n- Chaque point de talent réduit le coût en Mana de 25% au lieu de 50%\r\n- Paralysie a été réduit à 6 secondes (au lieu de 10)\r\n- Paralysie de masse a été réduite à 10 secondes (était 15)\r\n- *À haut niveau les sorts de protection ne sont pas assez puissant, donc je les ai ajusté pour qu\\'il résistent à un élément en particulier. Corps de pierre augmente votre armure (plus que le fait le sort d\\'origine), et Corps de feu, Corps de glace, Corps de foudre octroient moins d\\'armure, mais offre une résistance à l\\'élément associé.\r\n- Lancer un sort d’armure permettra de dissiper tout autre sort actif d’armure de sorte que vous pouvez changer entre les sorts à volonté.\r\n- Cuirasse de dragon se cumule avec les sorts d’armure.\r\n- (Point de talent) Armure du mage Rang 1: L’armure octroyer par les sorts sera plus importante si vous ne portez pas d’armure (calculé pour chaque emplacement d\\'armure)\r\n- (Point de talent) Armure du mage Rang 2: L’armure octroyer par les sorts sera plus importante si vous ne portez pas d’armure (calculé pour chaque emplacement d\\'armure)\r\n- (Point de talent) Armure du mage Rang 3: L’armure octroyer par les sorts sera plus importante si vous ne portez pas d’armure (calculé pour chaque emplacement d\\'armure).Augmente également la durée des sorts d’armure et de \\\"Cuirasse de dragon\\\" de 50%\r\n- Réduction du temps d\\'incantation de sorts rituels à 2 secondes (les sorts de rang maître)\r\n\r\nConjuration\r\n- La durée du sort augmente à mesure que votre compétence augmente (automatiquement). Les sorts peuvent être quelques secondes plus courtes au bas niveau, mais augmenteront à 150% de la durée d’origine (vanilla) au moment où vous augmenter votre compétence.\r\n- - Les points de talent « Conjuration Novice, Apprentie, Adepte(Spécialiste), Expert, et Maître »  augmentent les dégâts des armes liées (épée, hache, et arc), augmenter le niveau des invocations Daedras (Atronach), et permettent aux nécromanciens de réanimer les cadavres de plus haut niveau.\r\n- Chaque point de talent réduit le coût en mana de 25% au lieu de 50%.\r\n- Les dégâts de base de l\\'arc lié a été réduit et les dégâts de base de la hache lié ont été augmenté\r\n- Corrige  \\\"Golem de Foudre\\\" pour que le sort invoque un \\\"Golem de foudre\\\" au lieu d’un Atronach de foudre. C’est maintenant un sort de rituel\r\n- Réduction du temps d\\'incantation de sorts rituels à 2 secondes\r\n\r\nDestruction\r\n- Les sorts de Destruction deviennent plus puissants à mesure  que votre compétence augmente (automatiquement)\r\n- Les points de talent « Destruction Novice, Apprentie, Adepte(Spécialiste), Expert, et Maître » augmente les dégâts des sorts du rang qui lui correspond et tous les sorts du rang en-dessous de 10% en plus de réduire le coût en mana.\r\nJe m’explique, si vous avez « destruction novice » les sorts  novice on leur dégâts augmenter de 10%\r\nSi vous avez destruction « novice, apprentie et adepte(Spécialiste) » les sorts novices ont leurs dégâts augmentés de 30 %\r\n- *To keep damage to magicka cost ratios balanced, I had to scale cost up along with the extra damage. I also reduced the cost of Adept, Expert, and Master spells more than the 25% stated.*\r\nTraduction non trouvé\r\n- Chaque point de talent réduit le coût en mana de 25% au lieu de 50%.\r\n- Incinération, Stalactite, Éclair Foudroyant font des dommages additionnel. (Tapered, Tous les dommages sont a peu près doublé)\r\n- Le point de talent \\\"Impact\\\" renverse la cible à 25 % pour les sorts apprentie, 50% ceux de Spécialiste et 75% ceux Expert.\r\n- Les points de talents des « Rune » permettent désormais de placer plusieurs runes (jusqu\\'à 4)\r\n- Réduction du temps d\\'incantation de sorts rituels à 2 secondes\r\n\r\nEnchantement\r\n- Cape les enchantements de fortification Altération, Conjuration, Destruction, Illusion, et Guérison. Vous ne pouvez plus avoir 100% de réduction du coût des sorts.\r\n*Soft cap is 50%, hard cap is 72% (depending on strength of enchantments and order in which you equip items.)* (Traduction non trouvé)\r\n\r\nIllusion\r\n- Les sorts d\\'illusion affectent les créatures de niveau plus élevé par rapport au niveau de votre compétence (automatiquement)\r\n- Le point de talent \\\"Épouvante\\\" n’augmente plus les dégâts des sorts de Feu de destruction\r\n- Les points de talents \\\"Regard Hypnotique, Épouvante, et Rage\\\" augmente le niveau des créatures contrôlé par rapport au niveau de votre compétence\r\n- Chaque point de talent réduit le coût en mana de 25% au lieu de 50%\r\n- Réduction du temps d\\'incantation de sorts rituels à 2 secondes\r\n\r\nRestauration\r\n- Les sorts de guérison deviennent plus puissants à mesure que votre compétence augmente (automatiquement)\r\n- Barrière chargent plus rapidement et fournir de l’expérience à chaque fois qu\\'ils protègent le lanceur avec succés. Il est libres de maintenir mais du mana est drainé lors de l\\'impact.\r\n- Le bonus d’armure de barrière a été fixé à 40 pour les 3 barrières. Ce bonus d’armure augmente à mesure que votre compétence augmente, à 100 vous obtiendrais un bonus d’armure de 80.\r\n- Chaque avantage réduit le coût en mana de 25% au lieu de 50%\r\n- Réduction du temps d\\'incantation de sorts rituels à 2 secondes",
  "categoryId": "75",
  "version": "3.0.5",
  "author": "Mysty",
  "createdUnix": "1377080583",
  "updatedUnix": "1377080578",
  "containsAdultContent": false,
  "uploadedBy": "kerog6",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048552",
      "name": "Balenced Magic fr",
      "version": "3.0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "Balenced Magic fr-40752-3-0-5.rar",
      "uploadedUnix": "1377080578",
      "modVersion": "3.0.5",
      "virusScanUrl": "https://www.virustotal.com/file/bf6f2ef97725bdc05312c89c7ebacade1c8a22681b9da5d37396688bbe020f9e/analysis/1407691600/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balenced%20Magic%20fr-40752-3-0-5.rar?fid=1000048552&ttl=1535821422&ri=8192&rs=8192&setec=0e320e4e64ed687636ba2d4d37a2c758"
    }
  ]
}