{
  "modId": 40753.0,
  "modName": "Civil War Enhancement-Guarded Borders",
  "summary": "Adds two Stormcloak border camps to the Dawnstar/Morthal and Falkreath/Riften hold borders. Also adds three Imperial scout camps near Markarth, Dragonbridge and Stonehills.",
  "descriptionHtml": "Description \r\n============================= \r\nCivil War Enhancement: Guarded Borders adds two border camps and three small Imperial outposts.This mod is my attempt to create a better feeling of civil war in Skyrim by adding border camps at the hold borders between Dawnstar and Morthal and also between Riften and Falkreath. Both the border camps are held by the Stormcloaks to show that their is a rift between the Imperial holds and the Stormcloaks holds. \r\nThis mod also adds three small Imperial camps at Markarth, Dragonsbridge and Stonehills because you would think that the Imperials would have some sort of warning system if the Stormcloaks attempt to attack them. \r\n============================= \r\nWarning! \r\n============================= \r\nThis is my first mod for Skyrim and due to this it may be a bit glitchy but I did spend quite awhile bug testing it, so it shouldn\\'t set your game on fire... hopefully. \r\n============================= \r\nKnown bugs/problems \r\n============================= \r\n-The camps are not currently affected by the Civil war, so winning as one side won\\'t make the other sides camps disappear or become occupied by the winning side.(Probably won\\'t be fixed until I learn more about scripting and fiddling with the civil war quests.)\r\n-Npcs and followers may get stuck by the bridge near the Markarth Legion Camp(Possibly navmesh glitch, patch coming soon)\r\n============================= \r\nCompatibility \r\n============================= \r\n-Designed to work well with mods like Immersive patrols\r\n-This mod is compatible with any mod that alters the leveled lists or appearance of the civil war factions \r\n-May cause problems if used alongside another mod that alters the same area\r\n-Lanterns of Skyrim is fully compatible\r\n-Immersive Settlements is fully compatible\r\n-Civil War Overhaul is fully compatible but the enemy faction units at the new camps won\\'t disappear/change when you win the civil war\r\n=============================\r\nIf you enjoyed my mod, then please endorse so I can make more mods for the community\r\n============================= ",
  "categoryId": "78",
  "version": "1.0",
  "author": "Goblinfire",
  "createdUnix": "1377097118",
  "updatedUnix": "1377097063",
  "containsAdultContent": false,
  "uploadedBy": "Goblinfire",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048589",
      "name": "Civil War Enhancement-Guarded Borders",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "345",
      "fileName": "Civil War Enhancement-Guarded Borders-40753-1-0.zip",
      "uploadedUnix": "1377097063",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/977a4b90dc7f2bb32cc77be7b1679429ab7ab7b9f94f229973e097a0b453354c/analysis/1407691816/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Civil%20War%20Enhancement-Guarded%20Borders-40753-1-0.zip?fid=1000048589&ttl=1535821424&ri=8192&rs=8192&setec=1c943fdf32b9ea1f0a0747211373c65d"
    }
  ]
}