{
  "modId": 40767.0,
  "modName": "A Dark Elfs Story",
  "summary": "You were visiting Whiterun when you met another Dark Elf, but you knew you could not run away with her for she was the housecarl of the Jarl. ",
  "descriptionHtml": "This Dark Elfs story begins in the Whiterun Dungeon, where he is in the cell right next to the Jarls Fired housecarl who is in the cell beside him, you have to break out, get her out and grab you stuff.\r\nThe Pictures will show you where.\r\nYou have 999 lock picks in the barrel next to your bed in the cell.\r\nLockpicking 100\r\nEtc...\r\nThe Jarls Housecarl is ONLY a follower if you have\r\nAmazing Follower Tweaks\r\nLocated on Steam Or Nexus.\r\n-----------------------------------------------------------\r\nBACKSTORY\r\n-----------------------------------------------------------\r\nNeviaio is a Thief, A Dark Elf, he was imprisoned in the Dragonsreach Dungeon along with the Jarls Housecarl, they tried to run away, to Riften to catch a Ship, and sail away but that did not go as planned, the Jarl figured out that Irileth had been sneaking out after the Jarl had gotten back from sneaking out to the Bannered Mare. Irileth and Neviaio were deeply in love, but their plans were far from perfect, the Jarl hired a few spys from Neviaios guild, he was not from where most Dunmer were, he was from a place called Nai\\'gishei a purely completely destoried Dumner rebel town, the spys reported to the Jarl night after night but when they went to the gates, Irileth and Neviaio where getting onto the horses, the Jarl called the guards to arrest Neviaio, Irileth was taken back to dragonsreach and resumed her postion, Neviaio was sent to prison. Everyday Irileth would vist him, one day she had bought almost 1000 Lockpicks, but had lost 1 and had 999, Neviaio is a master at lockpicking and pickpocket and a few other skills, but the Jarl Figured out what she had been doing, the jarl arrested her aswell.\r\n-------------------------------------------------------------------------------------------------------------------------------------------\r\nMain Quest Done\r\nIrileth Only the one in the prison cell.\r\nOnly MAIN QUEST\r\nNO OTHERS\r\n\r\n",
  "categoryId": "43",
  "version": "Newest",
  "author": "Fusion",
  "createdUnix": "1377118421",
  "updatedUnix": "1377118402",
  "containsAdultContent": false,
  "uploadedBy": "FusionDent",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048650",
      "name": "Dark Elfs Save",
      "version": "Newest",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1958",
      "fileName": "Dark Elfs Save-40767-Newest.rar",
      "uploadedUnix": "1377118402",
      "modVersion": "Newest",
      "virusScanUrl": "https://www.virustotal.com/file/14e16f7a9e16d5180c2ab123c569529fa092afa6c1d0eb862e025c693a42935a/analysis/1407692106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Elfs%20Save-40767-Newest.rar?fid=1000048650&ttl=1535821439&ri=8192&rs=8192&setec=5810f3cef405ec88d9d7d16e5bbb634b"
    }
  ]
}