{
  "modId": 40777.0,
  "modName": "Big Fish Follower -My nickname-",
  "summary": "THIS IS NOT A HIGH QUALITY MOD.. This is My first ever mod & I made it as sort of a friendly prank for a friend to install into his game.. With that said IT IS a basic fully functional follower though..",
  "descriptionHtml": "ATTENTION: I just realized that the title might have been alittle misleading so I need to explain that.. My nickname is Big Fish...While it translated well to my friend I made the mod to I realize now that people are viewing the mod thinking its a actual \\\"Fish\\\" follower and I did not intend on trying to fool anyone into viewing the mod with a misleading title.. Since I feel bad Now I will actually try to make a legit \\\"Fish\\\" follower though lol (IF its even possible)\r\n\r\nBig Fish Follower, The follower is meant to be Me so it is Voice acted by me.( PLEASE READ BELLOW) I made this Mod as a friendly joke for a friend so it was not made to fit into the lore of the game.. ( I do plan on making more mods now that I got my feet wet and those mods will be Legit real mods that fit into the game well) \r\n\r\nI Want to make sure you know not to expect a polished professionally voice acted follower here, this is the FIRST mod I\\'ve ever made and I made it in 1 day after installing the creation kit the night before for the first time. \r\n\r\nBUT It is a fully functional although basic Follower, that is Custom Voiced.. ( The voice acting is horrible lol.. Its my voice recorded with the ingame recording part of the Creation Kit and I am no voice actor so don\\\\\\'t expect professional quality voice acting at all) \r\n\r\nThe Follower Big Fish has all the normal basic Voice acting dialogue like hellos, inventory, wait, and most all the combat voices.. His starts at level 5 I think and will level up to level 70 with you.. In the Creation kit I picked his class as tank so he is using tank stat weights so I also gave him some \\\\\\\"tanky\\\\\\\" perks.. I gave him the perks Shield bash, and a few other basic tanky perks along with a Heal spell.. While he is not really Overpowered completely he is a little to powerful for his level maybe because of the heal spell. Also You can find Big Fish near the lumber mill in Riverwood.\r\n\r\nREAD BELOW!!!! <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<\r\n\r\nI made this as a friendly sort of prank for a friend to have him install it in his game and get a few laughs out of it. \r\n\r\nThe Follower is supposed to be ME so I can be there is his game and annoy him more then I usually can lol. I used my voice to voice act the follower. It has some vulgar language so please be aware of that..\r\n\r\n I figured I would release it here Just incase anyone for some Crazy fricking reason wanted to use it..( And you would probably have to be crazy to want to use it but hey you never know )\r\n\r\nNow Again this was my first ever mod made in in 1 day with no prior Creation Kit experience so Please do not bash it I\\'m only uploading it here Incase someone is bored and wants to mess around with it OR use it as a base to make their own follower.. If you are new to modding also and would like to use this to use as a base for your own follower mod go for it.. If you need any help while I am still a newb I will try to help you.",
  "categoryId": "96",
  "version": "1.0.0",
  "author": "Furnaps",
  "createdUnix": "1377133743",
  "updatedUnix": "1377133732",
  "containsAdultContent": true,
  "uploadedBy": "furnaps",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048693",
      "name": "BigFish_FollowerMod",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8547",
      "fileName": "BigFish_FollowerMod-40777-1-0-0.rar",
      "uploadedUnix": "1377133732",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/f843738ec84e8c5ea31f6a0bda21c01808bcc228a53ec28bfbca9475769246a3/analysis/1407692182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BigFish_FollowerMod-40777-1-0-0.rar?fid=1000048693&ttl=1535821449&ri=8192&rs=8192&setec=bd66b2f1e4fb9164e422d42c2fe28f31"
    }
  ]
}