{
  "modId": 40809.0,
  "modName": "Skywind Project Release Updated 31 July 2013",
  "summary": "1. Q: What IS Skywind exactly?\r\n\r\nA: It is a non-commercial, fan made modification for The Elder Scrolls V: Skyrim that seeks to merge the amazing world of The Elder Scrolls III: Morrowind with the enhanced graphics and capabilities of Skyrim\\'s engine.",
  "descriptionHtml": "Skywind is a remake of Morrowind in the Skyrim game. It is a large mod that really plays like an entirely new game. As such it is a very large download at about 3.5GB. It has several plugins (a master file and patch) and all the graphics and sounds to make up the world of Morrowind. Skywind is in an Alpha state, meaning you can move around the world, interact with a few things, but the full content of questing, gameplay and many other various elements are not part of the game yet. These Alpha releases are more for getting people interested, inspired and up-to-date with development so they can help with the project. This is truly one of the most open public forums for developing an Elder Scrolls mod and we rely on the the continuous addition of contributors for the success of a playable game. When you can finish the main quest line with much of the game elements in use, we will update the status of Skywind to Beta. Please consider how you can contribute in any small way when you see the potential of one of the best games being developed for 2013/2014.\r\n\r\nBecause we are introducing expanding content and code, bugs will occur between releases. You are as much our testers as anyone, so please report anything but be specific, otherwise your posts will be ignored.\r\n\r\nImportant Notes\r\n\r\nREQUIRED: Skyrim and Morrowind Game of the Year (GOTY), or Morrowind plus the Tribunal and Bloodmoon expansions. These can be installed in any location of your choice, but they must be installed on your computer.\r\n \r\nOriginally, Morrowind had almost no voice acting, however if you wish to experience Skywind with voices, head on over to the Voice Acting Thread(http://morroblivion.com/forums/skywind/skywind-development/3022) where you can download (or help create) some quality voices!\r\n \r\nThe changelog for all versions can be found on the Skywind Project History Thread. (http://morroblivion.com/forums/skyrim/skywind-development/4159)\r\n\r\nInstallation Steps\r\n\r\nThe Complete Installation Pack will be updated about once a month and the date of update will be displayed,so make sure you have the latest update by checking the date shown below.\r\n\r\nThe current file is dated 31 July 2013.\r\n\r\n1: Download the Complete Skywind Installation Pack ( 0.8.0 )\r\n\r\nIt is about 3 GB.\r\n\r\n\r\n2. Download the update packs that have fixes, changes and additions.\r\n\r\nCurrently we have one update:\r\n\r\nExtract the content (\\\"textures\\\", \\\"meshes\\\" etc...) of the both the complete installation and any update packs directly to your Skyrim/data folder.  All files should be placed in the same directory structure as the downloaded file, so look for the \\\"Data\\\" folder in the download and copy/merge to your Skyrim Data subfolders.\r\n\r\nIf you have \\\"free-falling\\\" issues its because you have not put the files in the correct place. You must have \\\"...\\\\data\\\\meshes\\\\morrowind\\\\...\\\" and \\\"...\\\\data\\\\textures\\\\morrowind\\\\...\\\" in your Skyrim folder.\r\n\r\nUpgrading: The complete installation is now at v0.8.0. If you have previously installed an earlier complete install, please download the latest version and just let it overwrite your current install.\r\n\r\n3: Download the latest Skywind Installer and run the contained SkywindInstaller.exe, then follow the onscreen instructions.\r\n\r\nYou may have to run the program as an administrator. This copies the required plugins to your Skyrim folder that you want to install Skywind to. They are separate from the Complete Skywind Installation Pack, because you are required to have Morrowind already installed on your PC.\r\n \r\n\r\n4: Enable Skywind.esm and Skywind - Patch.esp in your launcher or mod manager, and please make sure the Skywind - Patch.esp is at the bottom of your load order.\r\n\r\nYou can either start a new game where you will be given the option of beginning in Skyrim or Morrowind, or you can Download the fast travel mod, which will place a Dragonborn style mapmarkers to allow you to travel back and forth between Morrowind and Skyrim\r\n\r\n\r\nNotes on Future Updates\r\n\r\nAs updates happen over the course of the project we will have patches that you can download and install in sequence as they become available. Our complete package will be updated to include these updates, but for most users because it is such a large download, the patches will be more desirable. These patches will be based lined from Skywind 0.8.0 onwards. They will include the change log of what has been added or changed.\r\n\r\nKeep in mind that this is an extreme alpha, and many things do not work at all. Right now what we can do is limited, so if you are good with anything in the CK, please let us know, and start working on something.  And once again, if you have a bug and wish to report it, please be as specific as possible, or your posts will be ignored.\r\n\r\nThat’s it!  Have fun.\r\n\r\nInstallation video tutorial: https://www.youtube.com/watch?v=fZyukMSzwf0\r\n\r\n ",
  "categoryId": "74",
  "version": "v1.04",
  "author": "Skywind team ",
  "createdUnix": "1377183750",
  "updatedUnix": "1377183750",
  "containsAdultContent": false,
  "uploadedBy": "toxikshot",
  "primaryFile": null,
  "files": []
}