{
  "modId": 40817.0,
  "modName": "Fine Goods from Morrowind - Dragonborn",
  "summary": "\\\"If you\\'re ever in the market, I deal in specialty goods from Morrowind at one of the stands.\\\"",
  "descriptionHtml": "On Steam: http://steamcommunity.com/sharedfiles/filedetails/?id=170624064\r\n\r\n\\\"Can I interest you in some fine goods from Morrowind?\\\" I hear a friendly Dunmer\\'s voice greet me, as I stroll the marketplace on my first visit to the captial of the Rift. I immediately turn my head in interest; but as I browse the display crates, I find nothing remarkable that I hadn\\'t seen all before. I say goodbye and pass with great disappointment. \r\n\r\nThis is the situation that the mod aims to fix. It does no more, no less than making Brand-Shei\\'s advertisement true: he now actually sells Morrowind goods. Also, it seems he has pimped out his stall a bit with some decoration from back home. I bet the other shopkeepers are jellier than a herd of Netches now. \r\n\r\nThe man sells everything he has previously sold, but in addition to that, he is now\r\n50% LIKELY TO SELL a bundle of 10 arrows or spears; \r\na piece of unenchanted clothing, armor or weapon; \r\n1-20 ingredients and/or Netch poison;\r\n1-20 food items and/or alcoholic drinks;\r\n1-15 crafting materials;\r\n25% LIKELY TO SELL 1-6 pieces of clothing, armor or weapons, may or may not be enchanted (some items were left out of this list that seemed unique, like Miraak\\'s robes and such)\r\n1-5 Wellbeing potions (only if made available by the appropriate quest) and Potion of Waterwalking;\r\n1-3 cheap or common books,\r\n20% LIKELY TO SELL 1-3 valuable or rare books,\r\nan East Empire Company amulet,\r\n10% LIKELY TO SELL a spell tome.\r\n\r\nThe lists are leveled, so you have to be higher level to get the good stuff. Bonemold and Chitin is more likely to appear than Nordic and Stalhrim.\r\n\r\nIf you\\'ve helped Brynjolf trap Brand-Shei in his scheme, this mod will not do much... other than leaving a meticulously decorated stall ring empty, silently yearning for its owner, reminding you of your heinous act every time you pass it by. \r\n\r\nEDIT: IMPORTANT NOTES for the naughty little thieves who would like to use this mod,\r\nThe mod will always work as long as Brand-Shei is at his stall selling stuff; however there is a bit of a problem. Thanks to the TG initiation quest being bugged out, the guards forget to release him from jail after his one week sentence. I\\'ve done a bit of research however and there are several ways to fix this.\r\nIF YOU ARE NOT A TG MEMBER YET: 1. While lockpicking Madesi\\'s stuff, fuddle around a little with your clinking picks while grumbling the nastiest of Nord curses aloud, preferably involving Mara\\'s ever-loving name as often as possible (if you don\\'t know any curses, the locals will gladly oblige) The guards will notice you and make you pay a fine/drop you in jail. Go back to Brynjolf who will be very forgiving and will not blame you at all. Talking to him will start the next quest.\r\n2. If you don\\'t want to go to jail: steal the ring, take it into your shaky little hands, sneak behind Brynjolf\\'s back and accidentally drop it in the sewers. Wail in misery. Walk up to Brynjolf with a hung head and admit your pathetic failure. Brynjolf might be grudging enough that you need to talk to him a second time before the proper dialogue shows up but eventually he\\'ll soften up and you can start the next quest.\r\nIF IT`S ALREADY TOO LATE: 3. The Unofficial Skyrim Patch is said to fix this problem. Mind that he still must complete his one week sentence. \r\n4. If you don\\'t want the entire patch, here is a mod for you that does the same thing: \\\"Brand-Shei Prison fix\\\" http://steamcommunity.com/sharedfiles/filedetails/?id=11024 I haven\\'t tried it but it\\'s said to be working perfectly.\r\n5. You can also remind the forgetful guards yourself to release him, but a bit of console magic is needed. Mind that the poor guy MUST complete his sentence before you release him or else you might bug him out. You can wait an in-game week to make sure; but one way I\\'ve discovered to tell the difference is whether he\\'s wearing prisoner robes or merchant clothes in his cell. If he\\'s dressed like what you see on the screenshot/illustration, you should be good to go. \r\nThen open the console and type: set TG00BrandSheiJail to 0\r\nLet him walk out of prison on his own. This may not happen immediately. You don\\'t have to stay around and watch, but you might want to, just to make sure you\\'ve done it right. This solution seemed to work for me flawlessly, but with console codes one should always be careful so let me know if something is off after using this method.\r\n\r\nINSTALLATION\r\nDrag \\\"fine goods from morrowind.esp\\\" into your Data folder. \r\n\r\nBUGS\r\nHonestly, I would be surprised if this mod caused any problems for anyone. Nevertheless, if you encounter something weird, please do let me know.\r\nEDIT: Silariel experienced a really weird bug in which Shouts became uncharged. Pushing the mod downwards in the load order seemed to fix the issue.\r\n\r\nCOMPATIBILITY\r\nDragonborn required. If you have a mod such as \\\"Open Cities\\\", a few tiny cosmetic changes will not display properly (the stall will be bare and not pimped out) but otherwise it will work just fine.\r\n\r\nEDIT: If my mod is not what you were looking for, check out \\\"Morrowind Imports\\\" http://skyrim.nexusmods.com/mods/31491 that encompasses the same idea slightly differently. (If this mod and my mod are compatible and what happens if you have both, I\\\"ll find out soon. Until then, I recommend that you don\\'t have both of them activated at the same time.) EDIT2: HavocAngel suggests loading Prison fix first, Morrowind Imports second and this mod third; and all three will work smoothly.\r\n\r\nCHANGES\r\nBrand-Shei is extremely humbled by the attention that his stall has received. He has noted to himself that investing in those expensive lanterns was a great idea, after all. \r\nAfter making sure that they are accident-proof, he now leaves them on even when he doesn\\'t accompany the stall. The lanterns give off actual light, thus contributing to a slightly less dangerous city at night. (requested by dave991199) \r\nA Dragonborn on their way has informed him that soaked taproot is a quest item. Therefore, if he finds any in the arriving shipments, he immediately throws them away. (thanks Sophisa) \r\nHe has also overheard an intriguing conversation at his stall, whether it is more profitable to import clothes or food items -.and since he was convinced by both arguments, he increased the maximum possible food items in his inventory to 30 and he is +20% more likely to sell Dunmeri clothing. (thanks to Rainbow Cat and ninthguardian) \r\nFor those who like realism, there now exists a version in which no Stalhrim items are sold. You can find it among the downloadables. \r\n\r\nSUGGESTIONS\r\nAre welcome. Leave your comments below.",
  "categoryId": "69",
  "version": "1.1",
  "author": "felroki",
  "createdUnix": "1377198735",
  "updatedUnix": "1379932332",
  "containsAdultContent": false,
  "uploadedBy": "felroki",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048813",
      "name": "Fine Goods from Morrowind 1-0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Fine Goods from Morrowind 1-0-40817-1-0.rar",
      "uploadedUnix": "1377197582",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6f75899bf5bfc70bb850115c15610b2c3a4023d4f4909db6a70e442885fc6600/analysis/1407692900/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20Goods%20from%20Morrowind%201-0-40817-1-0.rar?fid=1000048813&ttl=1535821491&ri=8192&rs=8192&setec=92aa32c1bd64ab976aebf3d99b9ce27e"
    },
    {
      "fileId": "1000057348",
      "name": "Fine Goods from Morrowind 1-1 ",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Fine Goods from Morrowind 1-1 -40817-1-1.rar",
      "uploadedUnix": "1379932186",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/17142d0bd70c8b5c1ad8a052bee874e3edac75c5917c876d72297ac51e4aa361/analysis/1407732424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20Goods%20from%20Morrowind%201-1%20-40817-1-1.rar?fid=1000057348&ttl=1535821492&ri=8192&rs=8192&setec=c05f346870c60fd18175f04f5c910af6"
    },
    {
      "fileId": "1000057350",
      "name": "Fine Goods from Morrowind 1-1 No Stalhrim",
      "version": "1.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Fine Goods from Morrowind 1-1 No Stalhrim-40817-1-1a.rar",
      "uploadedUnix": "1379932332",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/003b5ee188193a5eea6b09afba70b54f556d2d9a7e8af92e9c38478d8e9dde56/analysis/1407732482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20Goods%20from%20Morrowind%201-1%20No%20Stalhrim-40817-1-1a.rar?fid=1000057350&ttl=1535821492&ri=8192&rs=8192&setec=55565530315ed1ccdb09b45b73aeccf4"
    }
  ]
}