{
  "modId": 40825.0,
  "modName": "Unarmed Helper",
  "summary": "Makes a few changes to make Unarmed combat more viable and fun.",
  "descriptionHtml": "[center][IMG]http://i46.photobucket.com/albums/f101/iwatson/unarmed_splash_zps6d709e4d.jpg[/IMG][/center]\r\n\r\n[center]==========================\r\n[size=5][b]Unarmed Helper\r\n1.0[/b][/size]\r\nby Pimpskinny\r\n==========================[/center]\r\n\r\n\r\n\r\n==============\r\n[size=3][b]Requirements[/b][/size]\r\n==============\r\nThe latest version of Base Skyrim. No DLC is necessary.\r\n\r\n\r\n[center][IMG]http://i46.photobucket.com/albums/f101/iwatson/gauntlets_80_zpse2b5de5c.jpg[/IMG][/center]\r\n============\r\n[size=3][b]Description[/b][/size]\r\n============\r\n\r\nThis mod enhances the unarmed experience in a few different ways. Some of these strategies have already been done by other modders, and the rest I came up with myself. I though it helpful to put them all together into one mod, so here it is. I\\'ve used this mod myself up to level 50 and beyond and it\\'s been an absolute blast. I love Unarmed!\r\n\r\nI shy away from mods that make major changes or include complicated scripts, so these changes are very simple, and hence, safe. Specifically ...\r\n\r\n\r\n---------------------------------\r\n[color=#FFCC00]Scaling Unarmed Damage with Level[/color]\r\n---------------------------------\r\nAt the Riverwood Trader (in Riverwood :) Lucan will sell a spell tomb called \\\"Brawler.\\\" If you buy this book and learn it, it will add an ability to your character that boosts your Unarmed Damage by the same number of points as your level. For example, at Level 6, the Brawler Ability will boost your Unarmed Damage by 6 points. This is capped at Level 50.\r\n\r\n\r\n--------------------------------------------------------\r\n[color=#FFCC00]Craftable Brawler Gauntlets (including Light Gauntlets!)[/color]\r\n--------------------------------------------------------\r\nIn Vanilla Skyrim, the Heavy Armor perk Fists of Steel means you will have an Unarmed Damage boost equal to the BASE VALUE of the heavy armor gauntlets you are wearing. For example, if you have Fists of Steel, and you\\'re wearing Orcish Gantlets, you will get an Unarmed Damage boost of 15 points. Even if you temper the gauntlets to have a greater armor value, the Unarmed Damage boost will always be 15.\r\n\r\nWith this mod, if you have the appropriate Smithing perk points, you can craft \\\"Brawler\\\" versions of gauntlets that carry a greater Unarmed Damage boost than the Vanilla versions. Specifically, the boost is equal to TWICE the base armor value. As with Vanilla Skyrim, [u]you must have the Heavy Armor perk Fists of Steel[/u] for this to do you any good. But also with this mod, you can craft light armor gauntlets that have a Fists of Steel boost to Unarmed Damage.\r\n\r\nFor example, with the Elven Smithing perk, you can craft \\\"Elven Brawlers.\\\" These gauntlets are completely identical to \\\"Elven Gauntlets,\\\" except they require slightly more materials to make and come with an Unarmed Damage boost of 16 points (equal to twice the base armor value of Elven Gauntlets).\r\n\r\nAlso, this mod allows you to craft Spiked Gauntlets with the Advanced Armor Smithing perk. These gauntlets look like Stormcloak Officer Gauntlets (with the spikes). They come in both light and heavy versions.\r\n\r\n\r\n------------------------------------------------------\r\n[color=#FFCC00]Stronger and more Versatile Unarmed Damage Enchantment[/color]\r\n------------------------------------------------------\r\nIn Vanilla Skyrim, the Unarmed Damage enchantment is rather weak, with a base value of only 5 additional damage points. Also, you are only permitted to place this enchantment on the hand slot and ring slot. This mod doubles the base enchantment to 10 points, and allows you to place the enchantment on hands, rings, amulets, and feet.\r\n\r\nThe result is that in Vanilla Skyrim, you were only able to boost Unarmed Damage by 25 points with enchantments (with 100 Enchanting skill, 5/5 points in the Enchanter Perk, but without the aid of potions). But with this mod, you are able to boost it by 100 points (again, without potions).\r\n\r\n\r\n-----------------------------\r\n[color=#FFCC00]No need to go into the Ratway[/color]\r\n-----------------------------\r\nIn Vanilla Skyrim, the only way to find the enchantment to boost Unarmed Damage was by going into the Ratway in Riften and getting the Gloves of the Pugilist. With this mod, you can buy \\\"Boxing Gloves\\\" from Belethor\\'s Trade Goods in Whiterun.\r\n\r\n\r\n--------------------------------------------\r\n[color=#FFCC00]Alteration Flesh Spells boost Unarmed Damage[/color]\r\n--------------------------------------------\r\nWith this mod, Alteration Flesh Spells will grant an Unarmed Damage boost equal to 1/4 of the armor boost given. For example, the spell Iron Flesh grants the caster 80 points of additional armor. With this mod, it also grants 20 additional points of Unarmed Damage.\r\n\r\n\r\n[center][IMG]http://i46.photobucket.com/albums/f101/iwatson/gauntlets_80_zpse2b5de5c.jpg[/IMG][/center]\r\n================\r\n[size=3][b]Install/Uninstall[/b][/size]\r\n================\r\n\r\nIt is highly recommended that you use the Nexus Mod Manager to install this mod. NMM is a great tool for clean, correct installation and also clean, correct de-installation. If you want to do it manually, I\\'ll let you figure it out because I\\'ll assume you know how it all works with correct folder structure, etc.\r\n\r\n\r\n\r\n=============================\r\n[size=3][b]Known Issues and Conflicts[/b][/size]\r\n=============================\r\n\r\n1. If you have any other mod that changes the same things that this mod does, then this mod must be loaded AFTER those other mods in your Load Order. This includes mods that might change the Alteration Flesh Spells, and also mods that add or change the items sold by the Riverwood Trader or Belethor\\'s Trade Goods. But once you buy the items from the Riverwood Trader and Belethor, then this particular point is no longer an issue. \r\n\r\n\r\n\r\n================\r\n[size=3][b]Version History[/b][/size]\r\n================\r\n\r\n1.0: Initial Release.\r\n\r\n\r\n\r\n========\r\n[size=3][b]Credits[/b][/size]\r\n========\r\n\r\n----------\r\nTools Used\r\n----------\r\nThe Skyrim Construction Kit and Notepad.\r\n\r\n\r\n\r\n================\r\n[size=3][b]Licensing/Legal[/b][/size]\r\n================\r\nPlease contact me before-hand if you want to release anything in this mod.\r\n\r\n\r\n[center][IMG]http://i46.photobucket.com/albums/f101/iwatson/gauntlets_80_zpse2b5de5c.jpg[/IMG][/center]",
  "categoryId": "24",
  "version": "1.0",
  "author": "Pimpskinny",
  "createdUnix": "1377198937",
  "updatedUnix": "1377198378",
  "containsAdultContent": false,
  "uploadedBy": "pimpskinny",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048815",
      "name": "Unarmed Helper",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Unarmed Helper-40825-1-0.zip",
      "uploadedUnix": "1377198378",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d9f5b57eead57abd44af449ffbc26ec98baedaf3800e90a7415f80b3013a8521/analysis/1407692900/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unarmed%20Helper-40825-1-0.zip?fid=1000048815&ttl=1535821499&ri=8192&rs=8192&setec=48f124dc3d2c69bbde1b88ae1000de3e"
    }
  ]
}