{
  "modId": 40832.0,
  "modName": "Skyrim Robes Redux",
  "summary": "Add a little colour with some much needed brightness into Skyrim&#39;s dull dark and dreary robes...  ",
  "descriptionHtml": "Sick and tired of seeing the same old and tattered textures for Skyrim&#39;s robes? Then this is for you&#33; The files in the download add a brightener to Skyrim&#39;s robes making them look more saturated and unique, however they look even better with an ENB mod... with this added extra, robes such as Thalmor, Archmage, Apprentice, Monk and much more look 10 times better than the dull originals&#33;\r<br />\r<br />Requirements?\r<br />Nothing is required other than: Skyrim&#39;s main texture files being in BSA form&#33;\r<br />\r<br />Installation?\r<br />Simply download the main file, unzip it using winrar/ 7zip (or any other archive program) and copy the contents (Data) to you Skyrim directory usually: Local DiskC, program files, The Elder Scrolls Skyrim... ([sorry no nexus mod manager])\r<br />\r<br />Update?\r<br />When Gear4ce brings out an update it will be a separate download eg. for clothes or armour. If there is an update (which there probably will be) it will be in the main file so a simple copy and replace is all that&#39;s needed&#33; \r<br />\r<br />Help? Requests? Addition info? Design ideas?\r<br />Feel free to message us on the nexus website or email gear4cedesigns@outlook.com we are always looking for new ideas to improve and liven Skyrim&#33;\r<br />\r<br />~Please note that the first two images (Adept and Psiijic Robes) are computer illustrated and therefore will not look exactly like they do in game, the reason they are computer illustrated is to show an exaggerated comparison of the original and modified.~ ",
  "categoryId": "60",
  "version": "2.0",
  "author": "Gear4ce Designing",
  "createdUnix": "1377434428",
  "updatedUnix": "1377521225",
  "containsAdultContent": false,
  "uploadedBy": "Dangear",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049694",
      "name": "Skyrim Robes Redux 2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "43027",
      "fileName": "Skyrim Robes Redux 2-40832-2-0.rar",
      "uploadedUnix": "1377521225",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/85369b124717cd4cf21cd8e9f4151d22ca6aa80d1dd979d0c57bec6891433451/analysis/1407697174/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Robes%20Redux%202-40832-2-0.rar?fid=1000049694&ttl=1535821503&ri=8192&rs=8192&setec=be17333751400472c769783d06f8921d"
    }
  ]
}