{
  "modId": 40834.0,
  "modName": "Chapel of the Dawn",
  "summary": "A reinvention of the Chapel of Divines from the Elder Scrolls IV Oblivion.",
  "descriptionHtml": "CHAPEL OF THE DAWN\r\n\r\n\r\nThis here is my attempt to make something beautiful. I loved the old Gothic temples of Oblivion, and wondered if I could make one in Skyrim. It seemed successful in a way, though themed to be a Nordic variant. I took it further, made it into a lovely player home and dedicated temple to Mortalkind, with nods to the Mythic Dawn, and added a whole new external area. Not a lot is crazy functional, a lot being purely aesthetic, but I like it that way, and I hope you do too. \r\n\r\nThe cavern to the Chapel is located south of Falkreath, on the road to Hammerfell. It adds a functional forge and mill outdoors, with the other crafting sorts inside. Bookshelves, weapon racks, manikins, etc. Should not be glitchy, but inform me if anything doesn\\'t work or if things seem off. The place is ready to travel to. I might add a dungeon and quest later to it if everyone seems to like the theme of the place.\r\n\r\nIf your Dragonborn is either a darker sort, or enjoys peace and quiet, or religious enough to live in their own Chapel, or felt out of place with the world, this might be for them. \r\n\r\n\r\nINSTALLATION: \r\nFile attached should be extracted, and placed in your Skyrim Data folder. Included are meshes and textures that handle paintings and static shelf decorum. \r\n\r\nEverything here was made with vanilla parts, except those from other Skyrim Nexus mod sources. Included here are some meshes from the famed and wonderful RealitySpectre and Artisanix. It\\'s a royal mess in my meshes folder, so if I missed anything, I do not take credit for anyone\\'s work beyond the arrangement of the vanilla bits and pieces towards this endeavor. Please be patient as the work is still a work in progress! \r\n\r\n\r\nI hope you enjoy this as much as I do, and check out the showcase made by [b]Nozi87[/b]! 8D\r\n\r\nhttp://www.youtube.com/watch?v=j1d6pqJW7eY\r\n\r\n\r\nVer. 1.1 Arrived, including a nondescript npc outside by the lake, and a new follower inside the chapel. I\\'m not too skilled at making them, but seems to work fine. Everything is / should be navmeshed properly now. \r\n\r\n",
  "categoryId": "68",
  "version": "1.1",
  "author": "ClefJ",
  "createdUnix": "1377205998",
  "updatedUnix": "1377825400",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000050716",
      "name": "Chapel of the Dawn",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19849",
      "fileName": "Chapel of the Dawn-40834-1-1.zip",
      "uploadedUnix": "1377825400",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f4aaf06d0bd151d8d5d0f30640ae1d77c29191ad184b3575b36a7a505bbad95b/analysis/1407701770/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chapel%20of%20the%20Dawn-40834-1-1.zip?fid=1000050716&ttl=1535821505&ri=8192&rs=8192&setec=4203ccf8859ff5e7c8a6bf8ea2520748"
    }
  ]
}