{
  "modId": 40852.0,
  "modName": "Robed Armor with Additional Prefixes",
  "summary": "Expands on the fantastic mod by Madcat221 by adding prefixes of all kinds to his brilliant Steel Plate Armour. ",
  "descriptionHtml": "Installation -\r<br />\r<br />This mod requires Madcat221&#39;s Robed Steel Plate Armour & Robed Ebony Armour. Please read the installation instructions for these mods&#33; They&#39;re not as simple to install together as you might think.\r<br />http://skyrim.nexusmods.com/mods/10506\r<br />http://skyrim.nexusmods.com/mods/28190\r<br />\r<br />Once you&#39;ve installed the aforementioned mods PROPERLY, simply drag the file into your Data folder and replace your existing file and you&#39;re good to go&#33;\r<br />\r<br />What this mod does as of V4 - \r<br />\r<br />Every Novice, Apprentice and Adept Robe can now be combined with a Steel Plate Armor to produce a Heavy Robe with the previous Robe&#39;s Enchantments via the Forge, once you have the relevant perk. So, if you combined an Apprentice Robe of Destruction with a Steel Plate Armour, you&#39;d get an Apprentice Robed Steel Plate Armor of Destruction&#33;\r<br />\r<br />Adept Robes can be combined with an Ebony Armor and a Frostbite Spider Venom to produce a Heavy Robe with the previous Robe&#39;s Enchantments via the forge, once you have the relevant perk. So, if you combined an Adept Robe of Destruction with an Ebony Armor, you&#39;d get a Robed Ebony Armor of Destruction&#33;\r<br />\r<br />All Robes can be crafted at a Smithy as soon as you&#39;ve acquired the &#34;Advanced Armours&#34; perk. They can also be improved at a workbench.\r<br />\r<br />The Robes added by this mod have been sparingly added to NPCs, where it makes sense. Faralda no longer sells the Robes added by this mod. \r<br />\r<br />If you like this mod, you may also like Mage Apparel Overhaul:\r<br />http://skyrim.nexusmods.com/mods/34543/?",
  "categoryId": "54",
  "version": "V4",
  "author": "Kozoi",
  "createdUnix": "1377251585",
  "updatedUnix": "1387231068",
  "containsAdultContent": false,
  "uploadedBy": "Kozoi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087092",
      "name": "Robed Armor with Additional Prefixes",
      "version": "V4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Robed Armor with Additional Prefixes-40852-V4.rar",
      "uploadedUnix": "1387231068",
      "modVersion": "V4",
      "virusScanUrl": "https://www.virustotal.com/file/7350405bf0ccd6013627ff105707adce1da8996b5c29bddec74910801af0d9f5/analysis/1407845763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Robed%20Armor%20with%20Additional%20Prefixes-40852-V4.rar?fid=1000087092&ttl=1535821527&ri=8192&rs=8192&setec=aaa50ed5590da9bff245f9c7c608196f"
    }
  ]
}