{
  "modId": 40886.0,
  "modName": "Requiem and Deadly Mutilation Compatibility Fix",
  "summary": "I&#39;ve made a fix that allows DeadlyMutilation by Lamer1000 to work properly \r<br />with Requiem The Roleplaying Overhaul by Xarrian & Ogerboss.\r<br />",
  "descriptionHtml": "UPDATE 03.12.2013\r<br />\r<br />Description:\r<br />\r<br />1.Download the PDF file\r<br /> \r<br />2.Read\r<br /> \r<br />3.Fix\r<br /> \r<br />4.Enjoy\r<br /> \r<br />UPDATE: \r<br />Hello , Requiem has updated lately so remeber to update our fix again&#33; Just read sticky post in comments section, or:\r<br />\r<br />After Requiem has updated since this fix was uploaded, You will need to make small corrections again too (it may be a culprit of not working for some people), this time much less time demanding (just update Requiem.esp and DM.esp to have same values [especially take attention to have SPCT-Count variable value at same value in Requiem.esp and DM.esp -&gt; should be like in DM.esp at it contains more &#34;info&#34;] , after update of Requiem mod -&gt; it should have value =5 in requiem.esp and in dm.esp now).\r<br />Be sure to look at other variables and sections from left window in TES5EDIT than RACE (armours, etc.).\r<br />And remember to read whole FIX with attention, you need to INSTALL and ENABLE DM very carefully, making TES5EDIT tweaks is only half way to do&#33;\r<br />\r<br />[Always if You are not sure if tweaks are working good at Your config, start a New Game (just for testing purposes) using Alternate Start mod by Arthmoor, and set all DM sliders from MCM menu to 100 (naturally after proper installing and enablig it -&gt; read the fix) , also change damage taken in advanced Requiem mcm menu settings to 10% and dmg dealt to 150 % (or more) . \r<br />Then Equip Sword, Warhammer, Mace or Axe and go for testing [ouuch; ].\r<br />\r<br />AND KEEP IN MIND THAT&#33; :\r<br />Remember about general Deadly Mutilation limits as DM readme says (citation) :\r<br />\r<br />&#34; The chance of the mutilation is configurable through MCM menu, yet there are certain limitations and conditions to fill. All depend from weapon you carry and movement you execute. \r<br />\r<br />Moving power attack:\r<br />- Sword, axe, dagger, mace, war hammer –&gt; cut off arm\r<br />- Great sword, great axe –&gt; cut in half horizontally\r<br />- Werewolf –&gt; everything is possible\r<br /> \r<br />Stand power attack:\r<br />- Sword, axe, dagger, great sword, great axe –&gt; eviscerate vertically\r<br />- mace, war hammer –&gt; eviscerate vertically or/and crush head\r<br />- Werewolf –&gt; everything is possible\r<br />\r<br />Normal attack:\r<br />- Any melee weapon –&gt; cut off arm\r<br />\r<br />* Moving and standing attack detection system is not yet 100% certain. You may trigger moving power attack effect when execute standing power attack and inverse. However it works correctly in most cases. It takes a little second for script to realize that actor is not moving.\r<br />* Enchanted weapons will diminish a bit your chances to trigger mutilation. Because enchantment can kill the actor before physical damage and prevent script executing.\r<br />* Any actor equipped with matching weapon can cause gory death. But player must be near.\r<br />* Magic is not affected by random chance and works all the time if possible.\r<br />\r<br />Other useful information and functionality:\r<br />- Works for all NPCs of all humanoid races except old people, children, essential and protected.\r<br />- Player is immunised to all kind of effects(for being too buggy)\r<br />- Cut in half, evisceration and dismemberment may occur only on NPCs wearing one of the \r<br />supported armors such as:Fur, Elven, Forsworn, Hide, Studded, Imperial, Iron, Stormcloaks\r<br /> and guards armors, Necromancer and Warlock robes.\r<br />- Some of the effects can stack and replace one each other.\r<br />- Bodies cut in half or smashed in pieces can not be reanimated.\r<br />- Head crush works on any character &#34;\r<br /> \r<br />I&#39;ve made a fix that allows Deadly Mutilation by Lamer1000 to work properly with Requiem (also, my method should work with SkyRE too).\r<br />\r<br />---------------------------------------------- IDEA -------------------------------------------------------------\r<br />When I found compatibility is a problem for many of us, I made this primarily for myself, just for personal use, but I think it could help someone else too. \r<br /> \r<br />It&#39;s a very simple &#34;mod&#34; to do. I got this idea while searching many forums and the depths of the internet with no luck for any compatibility trick between these two mods, then I decided to do it by myself .\r<br />-----------------------------------HOW IT WORKS ----------------------------------------------------------------------- \r<br />1. No more race overwriting by DM - you play each of the Requiem races like it should be\r<br /> [all stats - like stamina, health, magicka, damage, skills, racial abilities, etc. - are the same as in\r<br /> \r<br />Requiem, race descriptions too] including normal races, vampire races, werewolf race, etc.\r<br /> \r<br />2. Requiem works as intended, while keeping Deadly Mutilation features\r<br /> \r<br />[chopping off arms, crushing heads, evisceration, cutting in half, bringing intensities out, etc. yummy&#33;].\r<br /> \r<br />3. Also, a few guard&#39;s armour classifications and weights which are changed by DM have requiem\r<br /> values back.\r<br /> \r<br />4. Took me 4 hours of editing and testing in-game after which it is all working very well.\r<br /> Also, other users found it working well.\r<br /> \r<br />5. I&#39;ve NOT modified any of the default Requium settings.\r<br /> \r<br />6. Im not using any custom skeletons or bodies, just vanilla, also I&#39;m not using the &#34;Realistic Ragdolls&#34;\r<br />mod.\r<br /> \r<br />7. For now the fix is ONLY as a PDF file that contains detailed instructions and tips, because to upload a proper fix file I must have permission from Lamer1000, author of DeadlyMutilation, and he has been missing for some time (or so I was told, I also already sent him a request for permission to upload a proper .esp file). When i get permission i will upload an .esp file.\r<br />I decided to share my fix method because I know a lot of people want to make it compatible, and there is no other fix for it.\r<br />-----------------------------------------------------------------------------------------------------------------------------\r<br />Have a nice reading, in case of any questions feel free to ask, I will try to help at my best when I have some time&#33;\r<br /> \r<br />Truly Yours, \r<br /> \r<br />Umbrecht (previous nick raf1981)\r<br /> \r<br />P.S. Don&#39;t be afraid, it works; it&#39;s already confirmed.\r<br /> \r<br />C R E D I T S:\r<br />This is a pdf file which gives instructions for how to easily make these two great mods compatible &#34;at home.&#34;\r<br />It does not contain any modified file(s) from the orginal mods.\r<br /> \r<br />If you are the author of any of these mods or a user of skyrim nexus and you feel offended please let me know and i will remove this file. I&#39;m not an experienced modder.\r<br /> \r<br />\r<br />Deadly Mutilation is a great mod by Lamer1000\r<br /> \r<br />Requiem The Roleplaying Overhaul is by Xarrian & Ogerboss\r<br />\r<br />TES5EDIT by ElminsterAU. Updated for Skyrim by Hlp, Zilav and Sharlikran.\r<br />\r<br />I want to thank very much to the Lilliputian for correcting my grammar and spelling errors in this description&#33;",
  "categoryId": "84",
  "version": "1.2",
  "author": "Umbrecht",
  "createdUnix": "1377292497",
  "updatedUnix": "1377294337",
  "containsAdultContent": false,
  "uploadedBy": "raf1981",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049047",
      "name": "Requiem and Deadly Mutilation compatibility Fix ",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "93",
      "fileName": "Requiem and Deadly Mutilation compatibility Fix-40886-1-1.rar",
      "uploadedUnix": "1377294337",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/fc11088bcef601e5b55f90d2f2e276466f08e53379ac00914dd95e2e5b42b4aa/analysis/1407694280/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20and%20Deadly%20Mutilation%20compatibility%20Fix-40886-1-1.rar?fid=1000049047&ttl=1535821566&ri=8192&rs=8192&setec=d7c41fe4071adea8326f1c16a71a0b43"
    }
  ]
}