{
  "modId": 40889.0,
  "modName": "Kaamelott Mod - La Legende de Perceval",
  "summary": "Le Seigneur Provencal le Gaullois vient vous donner un coup de main dans votre quete du Graal.",
  "descriptionHtml": "English user : this mod is entirely based on a character of a french humorous series, Kaamelott, so I don\\'t think you\\'ll find anything interesting unless you want to learn French :)\r\n\r\nHello! \r\nVous avez du mal à trouver le Graal, même en étant le grand chevalier Arthur ? Pas de panique! Le Seigneur Perceval le Gallois (ou Perciflette) est là pour vous donnez un coup de main.\r\n\r\nVous le trouverez en plein travail dans son quartier général, c\\'est à dire bien sûr dans la Taverne du Géant Endormi, à Rivebois. Vous pourrez tout simplement l\\'embauché comme tout autre compagnion. J\\'ai aussi ajouté la voix du brillant acteur Franck Pitiot, qui l’interprète dans la série, pour que Perceval parle pendant certains évènements (je ne vous en dit pas plus, je vous laisse découvrir tout seul :) ). \r\n\r\nEt c\\'est là que j\\'ai besoin de votre aide !\r\nEn effet, on peut ajouter une voix pour pratiquement tout les évènements que Perceval va vivre,\r\ncomme par exemple :\r\n\r\n- Entre en combat\r\n- Sort d\\'un combat\r\n- Trouve un corp\r\n- Entre dans un certain batiment ou un certain type de batiment (auberge, magasin de potion...)\r\n- Et énormément d\\'autres ! Comme par exemple ceci : http://www.creationkit.com/Detection_Tab\r\n\r\nDonc ce qui serait sympa c\\'est que vous me donniez des citations de Perceval qui pourrait correspondre à un évènement, comme par exemple il crie pendant un combat, où dit une phrase quand il s\\'enfuit. Il faudrait me donner l\\'évènement, la citation et enfin l\\'épisode dans lequel il dit cette phrase.  \r\n\r\nPour amélioré Perceval en me suggérant des répliques rendez vous dans la section commentaire, tout vous sera expliqué! :) \r\n \r\nMerci pour votre aide! :)\r\n\r\n\r\nCeci est un mod que j\\'ai réalisé il y a plusieurs mois, mais je suis resté bloqué depuis, car je n\\'ai plus d\\'idée ajouter des voix et le rendre plus vivant... Le mod n\\'en est donc qu\\'à ses débuts, mais je crois qu\\'il soit possible de bien rigolé en le retrouvant à nos côté dans Skyrim!\r\n\r\nInstallation\r\n- Télécharger et désarchiver le mod\r\n- Copier le dossier Data dans le répertoire du jeu (là où il y a TESV.exe)\r\n- Activer le mod \\\"test\\\" avec le launcher\r\n\r\nNOTE\r\nLe nom du mod est \\\"test\\\" car il n\\'est pas fini. NE CHANGEZ PAS LE NOM sinon plus rien ne marchera :)\r\n\r\nMerci!",
  "categoryId": "66",
  "version": "0.1",
  "author": "AlexP4",
  "createdUnix": "1377303521",
  "updatedUnix": "1377303502",
  "containsAdultContent": false,
  "uploadedBy": "AlexP4",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049077",
      "name": "Perceval",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2835",
      "fileName": "Perceval-40889-0-1.rar",
      "uploadedUnix": "1377303502",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/418b21cdfb15cbe4183c7c4c46430316a82c537f138f37e8a0ccc55e421ca1e7/analysis/1407694329/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Perceval-40889-0-1.rar?fid=1000049077&ttl=1535821570&ri=8192&rs=8192&setec=9acf83b0f08a02aae90695c2b9d667c6"
    }
  ]
}