{
  "modId": 40905.0,
  "modName": "Musical Mayhem",
  "summary": "Adds guitar, vintage mic, and speaker to the game in the form of weapons, shield, and props.",
  "descriptionHtml": "*** Version 1.1 ***\r\n\r\n-- WHAT\\'S NEW --\r\n\r\nThis is a small update; in fact you may wish to skip it--unless you want to make a custom faceplate for the black guitar.  Basically I removed the reflection map from the gothic guitar\\'s NIF (which wasn\\'t working the way I intended anyway), so if anyone wishes to update that faceplate (see the optional file I uploaded), it wouldn\\'t match.\r\n\r\nAs an option I uploaded the \\\"blank\\\" templates I used for the guitar faceplates.  You can change them if you like--though you\\'ll need to know how to edit image files and export to .dds (see the readme file for additional info).  If you do make a new faceplate, please share it so I can see your handiwork. ;)\r\n\r\n\r\n*** Version 1.00 ***\r\n\r\n-- ABOUT --\r\n\r\n\\\"Musical Mayhem\\\" began late one night after I had just completed my Dreamcatcher shield.  I was watching some of my favorite music videos, including Lexy\\'s \\\"Ma People.\\\"  In that video a wall of speakers is featured as a backdrop, and that got me thinking . . .  Why not a speaker shield?\r\n\r\nBut I didn\\'t think the shield by itself was enough for \\\"Musical Mayhem.\\\"  I needed something else.  The first idea was an electric guitar; Gibson\\'s Les Paul seemed to inspire me most.  Then the idea of a vintage microphone came to mind.\r\n\r\nBut how to use it all? Combat of course! (with a couple prop versions).\r\n\r\n\r\n-- WHAT\\'S INCLUDED --\r\n\r\n[Gibson Guitar] - Based on the Les Paul style.  Two-handed (great sword combat style), with a 25 base point for damage.\r\n[Gibson Guitar B] - Blue variant with a 35 point base damage.\r\n[Gibson Guitar G] - Gothic variant with 45 point base damage.\r\n[Gibson Guitar L] - Lexy (pink) variant with 55 points base damage.  Homage to the inspiration for the mod.\r\n[Speaker Shield] - Heavy armor; 50 point base.\r\n[Mega Speaker Prop] - Huge prop version of the speaker shield.  Marty McFly approved!\r\n[Vintage Mic 1H] - One-Handed vintage microphone weapon, based on an axe.\r\n[Vintage Mic 2H] - Two-Handed vintage microphone weapon, based on a war hammer.\r\n[Vintage Mic Stand] - Prop version of the 2H microphone.  NOTE: if you are having trouble placing it in the world space (keeps tipping over), I suggest sneaking/crouching first before dropping.\r\n\r\n\r\n-- HOW TO GET --\r\n\r\nEither craft at the Skyforge in Whiterun (steel & misc categories) or use the command console (search on \\\"mayhem\\\" or \\\"musical mayhem\\\").\r\n\r\n\r\n\r\n-- KNOWN ISSUES --\r\n\r\n[Hand clipping] - This was unavoidable since the neck of the guitar was always going to be wider than  the typical hilt of a weapon (but also much thinner).  Add to that the fact the neck is also angled . . .  It was either that, or a ridiculously thin neck that no one would believe could stand up to even a single whack of a skeever. =P\r\n\r\n[Havoc Havoc] - This was especially an issue for the prop versions.  With the mega speaker, due to the size, I had to use a smaller (than actual object) havoc bounding box so you could place it in a confined space without it going berserk and playing \\\"violent pinball\\\" all around.  And the mic stand . . . that one I especially struggled with.  I created three different types of havoc setups for the stand, and all had issues--mainly getting it to stay upright (definitely not a Weeble--wobbled and fell right down T_T).  In the end I settled for a \\\"bottom weighted\\\" solution.  Basically the havoc bounding box encompasses only the base of the stand, so that it will tend to stand up--but at the same time it may behave oddly if knocked over (if I can find a better way to do this, I will update later).  Sneak/Crouch before dropping if you can\\'t get it to drop and stay upright.\r\n\r\n[Weapon back sit distance] - This can be an issue with any weapon and custom armors (vanilla armors worked fine for me).  Body replacements are another factor (due to shape and skeleton).  Thankfully there is a way to deal with this--albeit with the requirement of Creation Kit adjustments.  You will need to adjust the armor (armor addon) you want to wear in the CK; the setting is \\\"Weapon Distance\\\" (1.5 was a good general setting for me).  You only need to mess with this if you don\\'t find the guitar sitting on the back the way you\\'d like (should only be on a custom armor).\r\n\r\n\r\n-- RECOMMENDED --\r\n. West Wind Combat Series - Misfit Mage UNP [http://skyrim.nexusmods.com/mods/36780] - The rope can serve the purpose as a strap for (the appearance of) holding the guitar on your back.\r\n\r\n\r\n-- ACKNOWLEDGEMENTS --\r\n\r\n[Lexy - Ma People] - The inspiration for the mod: http://www.youtube.com/watch?v=ql4G5f8zmt8\r\n\r\n[Mr Dave\\'s resources] - Always some texture or pattern in his collection I can use (much of it tileable).  If you texture, I highly recommend checking his mod out: http://skyrim.nexusmods.com/mods/2324 \r\n\r\n[Gothic Faceplate] - A composite of images were mined from a Google image search and found on various wallpaper sites--none of which informed the origin of.  I tried to find the original sources, but alas, I could not.  So if anyone knows who created it, please let me know and I\\'ll update the acknowledgement appropriately.\r\n. Skull Clock [file: 4933_Dark_Dark_-_Skull_Wallpaper.jpg] - Found many variations of it in different color schemes.\r\n. 2 x Flower designs [file: gray-flowers-white-design.jpg] - One had www.zoodu.com embedded in it, but that site seems to be just another image/layout repository/miner.",
  "categoryId": "36",
  "version": "1.1",
  "author": "Denki Groove",
  "createdUnix": "1377320134",
  "updatedUnix": "1377568460",
  "containsAdultContent": false,
  "uploadedBy": "denkigroove",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049120",
      "name": "Musical Mayhem",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10621",
      "fileName": "Musical Mayhem-40905-1-00.zip",
      "uploadedUnix": "1377319986",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/1c922388c3d6ad8c6e4f027cb94e380f22800de13635fc5130fb6235e752c955/analysis/1407694469/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Musical%20Mayhem-40905-1-00.zip?fid=1000049120&ttl=1535821592&ri=8192&rs=8192&setec=80b92a9fd4eaa0d659a433e3f5f05d7d"
    },
    {
      "fileId": "1000049863",
      "name": "Guitar Face Plate Templates",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "11441",
      "fileName": "Guitar Face Plate Templates-40905-.zip",
      "uploadedUnix": "1377568211",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/034aae4f59a2ccf50c39360bbb969b7016dce1095dae59b1248a03f48eca8827/analysis/1407698112/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guitar%20Face%20Plate%20Templates-40905-.zip?fid=1000049863&ttl=1535821592&ri=8192&rs=8192&setec=7346e0fa602cc494cf2cfd3000b12571"
    },
    {
      "fileId": "1000049865",
      "name": "Musical Mayhem V1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10621",
      "fileName": "Musical Mayhem V1-1-40905-1-1.zip",
      "uploadedUnix": "1377568460",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/99b5b9ada2caae391fada030e02567ffb2f82ce224e677b39f735393cbdb0044/analysis/1407698118/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Musical%20Mayhem%20V1-1-40905-1-1.zip?fid=1000049865&ttl=1535821593&ri=8192&rs=8192&setec=9d1319bf162faa48dbcef80650f23474"
    }
  ]
}