{
  "modId": 40914.0,
  "modName": "CONAN Hyborian Age",
  "summary": "-----Conan Hyborian Age-----\r<br />QUEST\r<br />DUNGEON\r<br />NEW CREATURES\r<br />NEW WEAPONS\r<br />NEW ARMORS\r<br />NEW TRAPS\r<br />VOICE ACTED\r<br />Custom Unique new Models based on the Conan The Barbarian Movie of John Milius with Arnold Schwarzenegger.",
  "descriptionHtml": "[center][img]http://i.imgur.com/IQ9OXnc.png[/img]\r<br />[youtube]QdbTFeR4FWg[/youtube]\r<br />\r<br />-------- Dedicated to All Conan and Arnold Schwarzenegger Fans --------\r<br />\r<br />\r<br />[font=Comic Sans MS][size=5][i][b]To crush your enemies, see them driven before you, and to hear the lamentation of the women&#33; [/b][/i][/size][/font]\r<br />\r<br />[size=4]--------Description --------[/size]\r<br />\r<br />\r<br />[size=3]Conan Hyborian Age is a Massive Dungeon with a Quest. It was designed to introduce in the most possible lore friendly way the Items of Conan the Barbarian Movie 1982 by John Milius and Oliver Stone.\r<br />\r<br />Its a quest mod that features a huge dungeon and an incredible amount of Custom Unique new Models based on the Conan The Barbarian Movie of John Milius with Arnold Schwarzenegger.\r<br />\r<br />It features also a lot of new innovative elements and dungeon realizations as well as innovative and unique scripting.\r<br />\r<br />An Incredible number of High level reproductions of Conan The Barbarian 1982 movie props are reproduced in this mod as a Tribute to that great Movie.[/size]\r<br />\r<br />\r<br />[size=2]-----Gameplay Videos and Reviews -----[/size]\r<br />Might Contain Spoilers\r<br />[youtube]kgX_iJNcjog[/youtube][youtube]hnyX4AF5DcM[/youtube][youtube]uuGdwOqp6aA[/youtube]\r<br />Videos Courtesy by [/center]\r<br />[center]-[url=http://forums.nexusmods.com/index.php?/user/6247421-dptheslothking/]dptheslothking[/url]-[url=http://forums.nexusmods.com/index.php?/user/2823671-preykousis/]Preykousis[/url]-[url=http://forums.nexusmods.com/index.php?/user/38219-gopher//]Gopher[/url]-[/center] \r<br />\r<br />\r<br />\r<br />\r<br />[color=#99ff99][size=3][b] :) A BIG Thankyou to all Supporters and voters\r<br />A special thankyou for the Donators You are amazing with your generous, kind and very much appreciated contribute and support :) .[/b][/size][/color]\r<br />\r<br />\r<br />\r<br />[size=3]--------Unique Features--------[/size]\r<br />\r<br />[size=2]- An entirely new dungeon of 3 levels.\r<br />- 1+ hours of gameplay.\r<br />- 1 quests\r<br />- Lots of new items professionally crafted in high detail from the Movie Conan the Barbarian 1982.\r<br />- New scripts and gameplay features like lightening embers with torches , dark dungeon , new traps etc .\r<br />- A Unique Battle soundtrack containing 3 new tracks composed by Christian Andersson.\r<br />- Fully voiced CONAN by Guinolas.\r<br />- It introduces a new Ore type that will be fully featured in Issgard mod .[/size]\r<br />- Fading warpaints over time and in water or under atmospheric effects .\r<br />- unlit torches and lighteable embers to lighten dark dungeons. \r<br />\r<br />\r<br />\r<br />[size=3]--------How to Start--------[/size]\r<br />\r<br />\r<br />[size=2]- To start the mod, you must search for a mysterious book in the Graymanes manor in Whiterun entitled , &#34;The Secret of Steel&#34;.\r<br />- There is no level requirement for this mod. but Its recomended to start the quest with a moderately advanced character ( around 10 )\r<br />- I have tested with a level 1 but some encounters woudl be extremely hard at low levels.\r<br />- Do not use console command to set up advanced stages or perks requirements as it could break the flow of the mod .\r<br />\r<br />- To craft some Items its required the ability to craft at skyforge or eventually Arcane smithing or other types of smithing .[/size]\r<br />\r<br />\r<br />[size=3]--------Tips--------[/size]\r<br />\r<br />[size=2]- Better bring some torches, I&#39;ts dark in the dungeons.\r<br />- to Lighten Embers in first person , set on defence stance and hit with the torch them untill the fire starts up\r<br />- Lightening up embers might keep you in light when the torches are consumed\r<br />- Looking around might bring up some surprsing rewards\r<br />- Keep an eye to health potions , they might become very usefull in some situations\r<br />\r<br />- It introduces a new Ore type that will be fully featured in Issgard mod .[/size]\r<br /> \r<br />\r<br />[size=3]--------Compatibility--------[/size]\r<br />\r<br />[size=2]- Conan Hyborian Age was designed to edit as few vanilla assets and places as possible. However, still, There are some Areas Edited for Mod reasons:\r<br />1) The area just west of Graymoor keep On the little hill near the &#34;failed Necromancer&#39;s experiment&#34; .\r<br />Adding the two dungeons entrances to Hyborian mound.\r<br />2) The Graymane Manor adding a notecard at the entrance table and the Secret of Steel Book on the upper level shelves.\r<br />3) Added some Ore and fulgurites in the following places:\r<br />Just East of Dawnstar in the Large ship wreck\r<br />In Solitude Smith home\r<br />Near the Whiterun Skyforge .\r<br />4) A folder ( meshes/Animobjects) Replaces two vanilla assets for the Smithing works so those will appear always different , if you want to have the normal Vanilla items then just delete those new items \r<br />- Mods that conflict with these areas may cause you problems. Otherwise there are no major compatability concerns.\r<br />- Conan Hyborian Age Is fully compatible with all Body or Texture body mods as long as they will use a Vanilla named convention.\r<br /> \r<br />Conan not talking\r<br />\r<br />[color=#ff0000]You need to load the mod above all others. [/color]\r<br />\r<br />CTDs of few of the players experiencedI am investigating on that :\r<br />Possible Candidates :\r<br />[color=#ff0000]other mods akltering bosses[/color]\r<br />[color=#ff0000]Other mods altering the main Skeleton[/color]\r<br />\r<br />during experiments on the CTD I only got once .\r<br />I reloaded the same passage for 35 times and I never got anymore the CTD ... I still don&#39;t know what it could have been caused from .[/size]\r<br />\r<br />\r<br />[size=3]----------CONAN Look---------[/size]\r<br />\r<br />[size=2]If you want to play with a Character similar to Conan you can Download the optional files of this mod that Includes a Savegame and some extra content .\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/4793/?]http://skyrim.nexusmods.com/mods/4793/?[/url]\r<br />\r<br />This mod was the original prequel of the Conan Hyborian Age Mod and you do not need it to get the same items , just limit yourself to download the :\r<br />\r<br />-Conan Face save game\r<br />-Conan Skin\r<br />\r<br />to be mounted after any other body texture mods.\r<br />Unless you prefer differently of course.[/size]\r<br />\r<br />\r<br />[size=3]--------Installation--------[/size]\r<br />\r<br />[size=2]- Extract the archives contents into &#34;Skyrim/Data&#34; and activate Conan_Hyborian_Age.esp\r<br />- Place above all .ESP files, and below any official plugins. (Update.esm & DLC)\r<br />- Other than that, load order shouldn&#39;t matter. [/size]\r<br />\r<br />\r<br />[size=3]--------Uninstallation--------[/size]\r<br />\r<br />[size=2]- The uninstallation of Conan Hyborian Age is NOT supported but you can Simply remove The Conan_Hyborian_age.esp and Bsa , but it could break some saved games .\r<br />- Treat Conan Hyborian Age like a DLC, and do NOT remove it during a playthrough. Only remove if you are starting a new game.\r<br />- To remove (Only for new game) simply delete &#34;Conan_Hyborian_age.esp&#34;, &#34;Conan_Hyborian_age.bsa&#34;.\r<br />- Failure to follow the above conditions could corrupt your saves and is not recommended or supported.\r<br />- There are no known issues or Bugs in this mod as it had been extensively tested.\r<br />- Some have reported with my mods some compatibility issues due to the version of ( Italian ) CK I am using , it shouln&#39;t create any problems but it might be recognized as a problem by some cleaning tools .[/size]\r<br />\r<br />\r<br />[size=3]--------Spoilers---------[/size]\r<br />\r<br />[size=1]Carefull this information is not intended for a normal flow of the game mod , it will deprive the experience by getting quickly and fast informationto complete the mod and get all the items without playing the quest and so ruining the experience .\r<br />\r<br />- The Trolls Cave Grate is opened by the Lever in the Doom&#39;s Room .\r<br />- Some pressure plates around need to feel the weight of the player and so drop something heavy to open doors \r<br />- The Doom entrance room is triggered with a pressur eplate , be sure to drop something heavy on it\r<br />- The Doom Room holds a secret fulgurite ore\r<br />- To enlighten the embers is better to hit them with fire in first person mode\r<br />- The mummification Chamber key is located on a Draugr on level one of the dungeon\r<br />- The hyborian mound level 2 gate is opened with the key that Conan will give you \r<br />- The Grate of Conan Throne is opened with the right side tunnel end pull.\r<br />- The Book The Secret of Steel is located on the upper shelves in Graymanes house\r<br />- There is a secret load of Fulgurite ingots , look for a note in the Graymanes house.\r<br />- Other fulgurite ore can be found in Solitude Smith room and near the Skyforge in Whiterun\r<br />- to reforge weapons you need skysteel forging ability and arcane smithing.\r<br />- To Get all the items quickly and fast You can teleport yourself to the testing room by:\r<br />1) press tab to recall the console functionality\r<br />2) type : &#34;coc Hyborian_Inventorycell&#34;[/size]\r<br />\r<br />[size=3]--------Unique Playable New Items--------[/size]\r<br />\r<br />[size=1][color=green]Conan Cimmerian Outfit [/color]\r<br />[color=green]Conan Pitfight Outfit [/color]\r<br />[color=green]Conan Pitfight Fur Outfit [/color]\r<br />[color=green]Valeria Cimmerian Outfit [/color]\r<br />[color=green]Conan Warpaint Outfit [/color]\r<br />[color=green]Valeria Pitfight Outfit [/color]\r<br />[color=green]Valeria Pitfight Fur Outfit [/color]\r<br />[color=green]Valeria Warpaint Outfit [/color]\r<br />\r<br />Weapons\r<br />\r<br />[color=green]Atlantean Sword + Scabbard [/color]( equipped 1 or 2 hands )(Ancient , Steel and Bronze )\r<br />[color=green]Valeria Sword + Scabbard[/color]( equipped 1 or 2 hands )(Ancient , Steel and Bronze )\r<br />[color=green]Father&#39;s Sword + Scabbard [/color]( equipped 1 or 2 hands )(Ancient , Steel and Bronze )\r<br />[color=green]Rexor Triple Axe[/color]\r<br />[color=green]Thorgrim Hammer[/color]\r<br />[color=green]Thulsa Doom Staff[/color]\r<br />[color=green]Battle of the Mounds Axe[/color]\r<br />[color=green]Pitfighter&#39;s Gloves [/color]\r<br />\r<br />Armors:\r<br />\r<br />[color=green]Thulsa Doom Helmet[/color]\r<br />[color=green]Thulsa Doom Shield[/color]\r<br />[color=green]Rexor Helmet[/color]\r<br />[color=green]Battle of the Mounds Shield[/color] (Ancient and Bronze )\r<br />[color=green]Battle of the Mounds Helmet[/color]\r<br />\r<br />Clothing:\r<br />\r<br />[color=green ]Barbarian Fur Pants [/color]\r<br />[color=green]Amulet Wheel of Pain Gold[/color]\r<br />[color=green]Amulet of Doom[/color][/size]\r<br />\r<br />\r<br />[size=3]--------Permissions--------[/size]\r<br />\r<br />[size=2]Conan Hyborian Age may NOT be translated into another language without my permission.\r<br />Conan Hyborian Age may NOT under any circumstances be hosted or uploaded by anyone but me, anywhere ever.\r<br />\r<br />Conan Hyborian Age elements, items, music and scripts are all property of the relative authors and Collaborators of this mod and it is forbidden any different use\r<br />unless differently stated by the relative authors .\r<br />\r<br />- No files that are packaged as part of Conan Hyborian Age may be redistributed in any way shape or form. This includes the ESM, Music files,\r<br />and any files contained within the BSA. [/size]\r<br />\r<br />\r<br />\r<br />[size=3]--------Credits--------[/size]\r<br />\r<br />[size=2]3d models/textures\r<br />Design and Ideation Prometheus\r<br />\r<br />Music Soundtracks Chsristian Andersson\r<br />Scripting and Technical\r<br />and problem solving Ttl269\r<br />\r<br />Voice Acting Guinolas asConan\r<br />\r<br />Tips for texturing : jmenaru, CaBaL120\r<br />\r<br />Betatesting : Kalel\r<br />Serindas\r<br />Guinolas\r<br />Tomaraya\r<br />Tt269\r<br />\r<br />Picture taking : Tomaraya\r<br />\r<br />Sources of Informations; The Conan Completist Forum [url=http://conancompletist.forumactif.com/]http://conancompletist.forumactif.com/[/url][/size]\r<br /> \r<br /> \r<br />\r<br />-----------------------------------------------------------------------------------------------------------------------------\r<br />If you like and enjoy please endorse it don&#39;t forget ...\r<br />\r<br />All the content of this mod is original and made from scratch , doesn&#39;t takes anything from the original Game ...\r<br />\r<br />-Any item in this Mod is made completely from scratch and makes no use of anything by Bethesda or Third party ...\r<br />- Some few Items ( 1-2 ) might be recalling to a Vanilla texture ant if other mods installed altered some this might be the source of differing texture showed onthose.\r<br />-Do not sell any of the contents of this archive or the archive as a whole.\r<br />-Do not share or otherwise redistribute any of the archive&#39;s contents or the archive as a whole without permission form the author.",
  "categoryId": "35",
  "version": "2.8",
  "author": "PROMETHEUS",
  "createdUnix": "1377390215",
  "updatedUnix": "1420046079",
  "containsAdultContent": false,
  "uploadedBy": "PROMETHEUS_ts",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000057465",
      "name": "Conan Hyborian Age 2_7",
      "version": "2.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "243922",
      "fileName": "Conan Hyborian Age 2_7-40914-2-7.7z",
      "uploadedUnix": "1379969124",
      "modVersion": "2.7",
      "virusScanUrl": null,
      "changelogHtml": " - added alternative way to finish the quest \"The Riddle of Steel\" without necessity of having completed vanilla Companion quest. The way consists in contacting any smith...\r<br />- added open/close sound to lever in Doom room\r<br />- decreased intensity (added some transparency) of black color in first phase of warpaint\r<br />- fixed mesh of book The Secret of Steel\r<br />- deleted forgotten book \"Secret of Steel\" in exterior on table near the Hyborian mound entrance\r<br />- deleted forgotten armor \"Pitfight Cuirass\" in exterior on table near the Hyborian mound entrance\r<br />- fixed a list of weapons which being forged, complete the quest The Riddle of Steel (in list there were missing all Cimmerian swords and also steel versions of Hyborian Sabres)\r<br />- fixed conditions in recipes of Cimmerian swords (reforging of ancient Broken sword and blade required having also Ancient Atmorean Sword)\r<br />- added \"Bronze\" or \"Steel\" to names of sabres for better distinguishing them in forging or inventory list\r<br />- fixed conditions in recipes of ancient weapons to not showing double weapons in forging list\r<br />- added recipes for forging steel versions of sabres (these recipes was completely missing)\r<br />- added recipes for tempering steel versions of sabres (these recipes was completely missing)\r<br />- added \"Steel Ingot\"/\"Dwarven Ingot\" to recipes of Steel/Bronze Sabres created from Ancient Sabre - to be same Steel/Bronze differentiation as have Atmorean or Cimmerian swords\r<br />- minor typographic corrections made in texts of Warpaint note, Fulgurite note and book The Secret of Steel\r<br />- added information about \"breaking the raw coal\" to get coal sticks in Warpaint note\r<br />- added raw coal vein to have possibility of getting more \"Coal\" items - the coal can be mined in same way as other ore in Skyrim. This vein is located in second dungeon.\r<br />- added recipe for getting coal stick - 3 coal sticks are made from one piece of coal\r<br />- fixed race settings for Banded and Studded Bracers and Banded Wristguards (bracers didn&#39;t show up on character of Breton race)\r<br />- fixed graphics glitch (missing part of forehand) when wearing Banded Wristguards on female body with Fur Pants cuirasses\r<br />- added meshes of Banded Wristguards for Argonian and Khajiit races\r<br />- added a map marker pointing to Skyforge at Whiterun for Riddle of Steel quest objective \"Reforge Ancient Weapon\"\r<br />- added journal entries to quest The Riddle of Steel (log entry for stages 10, 22, 30 and 40). Stage 30 have two versions of log entry - one for players with skyforgesmithing ability and one for others - these have one more sentece at end of entry.\r<br />- Improved quality of weapons for Ancient Atmorean blades, reaching ultimate peak of power above dragonbone . <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Conan%20Hyborian%20Age%202_7-40914-2-7.7z?fid=1000057465&ttl=1535821605&ri=8192&rs=8192&setec=904eb7850d4caf081231a8c53039b998"
    },
    {
      "fileId": "1000064852",
      "name": "Conan Hyborian Age 2_8",
      "version": "2.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "244963",
      "fileName": "Conan Hyborian Age 2_8-40914-2-8.7z",
      "uploadedUnix": "1381598812",
      "modVersion": "2.8",
      "virusScanUrl": null,
      "changelogHtml": " - fixed: armor setting of Helmet of the Mounds (it is Heavy armor now)\r<br />- added: the recipe for tempering of Helmet of the Mounds (recipe was missing)\r<br />- changed: lever in the Doom Room can be pulled only once\r<br />- fixed: mesh of Pitfight Cuirass ground/inventory object\r<br />- changed: female warpaint textures are in hi-res 2048x2048 (same as male textures)\r<br />- fixed: model path for Cimmerian Sword Steel\r<br />- fixed: texture path for handle of Shield of Doom <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Conan%20Hyborian%20Age%202_8-40914-2-8.7z?fid=1000064852&ttl=1535821606&ri=8192&rs=8192&setec=21058b74f5f177a2b53738702c82850f"
    },
    {
      "fileId": "1000064853",
      "name": "Conan Hyborian Age 2_8 Dual Sheath Redux Addon",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "897",
      "fileName": "Conan Hyborian Age 2_8 Dual Sheath Redux Addon-40914-.7z",
      "uploadedUnix": "1381599199",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4c5451c828f84296995484847e22832c408faf60546fd27789b7db58736c1abf/analysis/1407753664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Conan%20Hyborian%20Age%202_8%20Dual%20Sheath%20Redux%20Addon-40914-.7z?fid=1000064853&ttl=1535821607&ri=8192&rs=8192&setec=b189e666a784eba61f51c983fa17ddaa"
    },
    {
      "fileId": "1000140834",
      "name": "Conan Hyborian Age 2_81",
      "version": "2.81",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "189",
      "fileName": "Conan Hyborian Age 2_81-40914-2-81.7z",
      "uploadedUnix": "1420046079",
      "modVersion": "2.81",
      "virusScanUrl": "https://www.virustotal.com/file/fe4bc33ec0274d504c6ee55c2b8c6a0778214a91d7ec9bc08f25b9fddea7c28c/analysis/1420046103/",
      "changelogHtml": " - added: Possibility to disable/enable loadscreens.\r<br />To disable loadscreens switch to console and type &#34;set prom_disablels to 1&#34; (without quotes).\r<br />To enable loadscreens switch to console and type &#34;set prom_disablels to 0&#34; (without quotes). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Conan%20Hyborian%20Age%202_81-40914-2-81.7z?fid=1000140834&ttl=1535821607&ri=8192&rs=8192&setec=51d9e1eceac1347c573255ac6a300097"
    }
  ]
}