{
  "modId": 40951.0,
  "modName": "Akademie von Winterfeste- Ruhmreiche Tage",
  "summary": "Diese Mod verändert die Akademie von Winterfeste, fügt neue Gegenstände hinzu, räumt es auf und fügt einige neue NPCs, magische Sigilsteine, Brückenfix, Pflanzen und ein paar Schreine ein!",
  "descriptionHtml": "Diese Mod verändert die Akademie von Winterfeste, fügt neue Gegenstände hinzu, räumt es auf und fügt einige neue NPCs, magische Sigilsteine, Brückenfix, Pflanzen und ein paar Schreine ein!Chancelog:\r\nV 1.6: Alle Klassenräume sind nun funktionstüchtig. NPCs stellen Zaubersprüche her wann sie wollen und sie haben alle einzigartige Begleiter. Fügt vier Händler der Halle des Reichtums hinzu. Fügt eine Sternwarte auf der Spitze eines der rückwärtigen Türme hinzu.\r\nProbleme mit Questen gefixed und Gegenstände welche einen Bezug zum Ende der Questline der Akademie besitzen, werden erst nach Abschluss der Questreihe erscheinen.\r\nV 1.5: Erste große Änderungen. Fügt 4 Klassenräume hinzu, die Halle des Reichtums und die Halle des Arkanen. Fügt 12 neue NPCs, Professoren und Studenten ein. Fügt jeder Klasse einen Sigilstein hinzu, welcher dir einen Segen geben wird.\r\nFügt 5 neue Türme zum Exterior der Akademie hinzu. Siehe Mod-Seite für mehr Details.\r\nV 1.4: Fügt eine Menge neue Pflanzen ein und fügt der Halle der Elemente einige neue Gegenstände hinzu, beginn die Dorms aufzuräumen.\r\nV 1.3 Anpassung der Musik an verschiedene Teile der Akademie außer der Halle der Elemente um die Quest nicht zu unterbrechen. Fügt einen Schrein Julianos dem Außenbereich hinzu und entfernt die nervigen Windgeräusche in den Quartieren des Erzmagiers.\r\nv 1.2: Brücke von winterfeste gefixed. Die Texturen sind nicht genau die selben, aber ich tat mein bestes. Es war nicht einfach!\r\nV.1: Die Beleuchtung der Akademie komplett überarbeitet mit weiteren Lichtern und mehr!!\r\n\r\nKompatibilität:\r\nAlle Mods sollten mit meiner funktionieren, aber Mods die die Akademie verändern könnten Fehler verursachen... Falls ihr etwas dergleichen entdeckt, teilt es mir mit dann gebe ich das so weiter.\r\n\\\"Sexy Winterhold college\\\" ist kompatibel.\r\nBenötigt:\r\n\r\nDawnguard DLC und Skyrim auf neuestem Stand.\r\n\r\nEmpfohlene Mods:\r\n\r\nArchmage of Winterhold HD Retexture von Rafuel.\r\n\r\nMagic Duel - Reborn von Seb263.\r\n\r\nCredits:\r\n\r\nDanke an Blary für seine großartigen Modder Ressourcen.\r\nDanke an Runspect für seine großartigen Modder Ressourcen.\r\nDanke für Stroti Resource Pack von Stroti und Tamira.\r\nDanke an TheFlamingDaedra für die Hilfe bei den Namen der NPCs.\r\nDanke an Gopher für seine \\\"Immersive HUD\\\" Mod.\r\n\r\nDas Orginal findet ihr hier: http://skyrim.nexusmods.com/mods/32917//?",
  "categoryId": "25",
  "version": "1.65",
  "author": "devil0929 -DV von Gunter525 -OM-",
  "createdUnix": "1377427974",
  "updatedUnix": "1377427792",
  "containsAdultContent": false,
  "uploadedBy": "Gunter525",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049437",
      "name": "College Of Winterhold Glory days -DV",
      "version": "1.65",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "105424",
      "fileName": "College Of Winterhold Glory days -DV-40951-1-65.7z",
      "uploadedUnix": "1377427792",
      "modVersion": "1.65",
      "virusScanUrl": "https://www.virustotal.com/file/cdf959a8c739cf55e87211aaf50791fa4cb9b7e2a5dd7c3ccfd91b4345a0dbda/analysis/1407695971/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/College%20Of%20Winterhold%20Glory%20days%20-DV-40951-1-65.7z?fid=1000049437&ttl=1535821653&ri=8192&rs=8192&setec=69bb3a667a158c8fd6eb4650737797f6"
    }
  ]
}