{
  "modId": 40953.0,
  "modName": "All Geared Up",
  "summary": "Fixes issues caused by using the bDisableGearedUp=0 INI tweak.\r<br />\r<br />Read the readme&#33;",
  "descriptionHtml": "[center]\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/40953-1-1377624393.png[/img][/center]\r<br />Table of contents\r<br />- Description\r<br />- Requirements\r<br />- Compatibility\r<br />- How to install\r<br />- How to uninstall\r<br />- Known issues\r<br />- Credits\r<br />- How to contact the author\r<br />- Changelog\r<br />\r<br />\r<br />--Description--\r<br />All Geared Up displays unequipped favorited weapons and shields on the player character, and can also display weapons equipped in the left hand. Bows and crossbows are not currently supported due to technical issues.\r<br />\r<br />Models of unequipped weapons on the right-hand side have to be removed before equipping said weapons due to technical reasons. If one doesn&#39;t do that, then one may end up with an invisible weapon in the player character&#39;s hand(s). You can either always enter the Favorites menu when switching weapons or use the custom hotkeys provided by the mod in order to remove the model(s) before equipping a weapon in the right hand. Also applies to two-handed melee weapons.\r<br />\r<br />The All Geared Up mod configuration menu allows you to set which items you want to show up on the player character and which biped slots those items should use. The default slots are set up to be compatible with most cloak (slots 40 and 46) and backpack (slot 47) mods, but you may have to adjust the slots depending on the mods you are using. Shields can be set to accomodate (move further away from the player character) for cloaks and/or backpacks in order to minimize clipping. You can also enable/disable hotkeys and rebind those hotkeys. Quick slots 1-8 also have an alternative method that can be used in case the regular mode has issues.\r<br />\r<br />The custom hotkeys for Quick slot 1-8 require modification of controlmap.txt, which can be done manually, with the optional download, or software like Skyrim Key Helper (part of Interface Hard Coded Key Tweaks, which is available on Skyrim Nexus). Quick slot 1-8 are by default bound to two sets of buttons (1-8 and Numpad 1-8). Unbind the keys you want to use (the custom hotkeys can be bound to those) and leave the other set of keys bound or rebind to another set of keys you will not be using. The custom Quick slot hotkeys are disabled by default and need to be enabled via MCM or the console before they can be used.\r<br />\r<br />The custom SkyUI group 1-8 hotkeys do not need any modifications to the controlmap.txt file. Enabling these custom hotkeys will detect and hijack the keys you&#39;ve set in SkyUI&#39;s mod configuration menu, and the hotkeys for the groups should then be rebound via AGU&#39;s menu. Disabling will reset the hotkeys and the hotkeys for the groups should then be rebound via SkyUI&#39;s menu again. The custom SkyUI group hotkeys are disabled by default and need to be enabled via MCM or the console before they can be used.\r<br />\r<br />At the moment (version 2.1.1) the recommended way of (un)equipping weapons and shields is to use the inventory menu, the favorites menu, or the custom SkyUI group hotkeys. See the &#34;Known issues&#34; section for more information.\r<br />\r<br />Certain items can also be displayed on the player character as long as the player has the item:\r<br />- Gold is represented by a coin purse that grows and shrinks (within certain limits, which can be adjusted) according to the amount of gold in the player&#39;s possession.\r<br />- Torch in a strap. Equipping a torch will remove the torch and leave the strap in place.\r<br />- Potions that restore health, magicka, or stamina are represented by three potions, each of them represents one of the three categories.\r<br />- Scrolls show up as a single scroll.\r<br />- A satchel for alchemical ingredients.\r<br />- Lute and/or flute for those playing as bard characters.\r<br />- Certain quest items like the package of the fragments of Wuuthrad, Elder Scrolls, etc.\r<br />\r<br />All of the items can be enabled/disabled at will. The placement of some of these items can also be adjusted.\r<br />\r<br />\r<br />--Requirements--\r<br />Skyrim (&gt;= 1.9.32.0.8)\r<br />SKSE (&gt;= 1.7.0 alpha)\r<br />\r<br />-Optional, but highly recommended-\r<br />SkyUI (&gt;= 4.1) for configuring the mod and rebinding hotkeys.\r<br />XPMS (xp32&#39;s Maximum Skeleton) (&gt;= 1.92) or another skeleton with the necessary nodes to support left-hand side weapons and/or weapons/shields on the player character&#39;s back.\r<br />Mesh packs using the standard set by Dual Sheath Redux. Necessary only for shields on back, staves, and left-hand side weapons. For example: [url=http://www.nexusmods.com/skyrim/mods/64647/]A Lot of Dual Sheath Redux Patches[/url].\r<br />\r<br />\r<br />--Compatibility--\r<br />The custom Quick slot 1-8 hotkeys are not compatible with gamepads due to the lack of available buttons. The custom SkyUI group 1-8 hotkeys can be used with gamepads.\r<br />\r<br />The weapons and shield may be incompatible with some items added by mods, if the conflicting items use the same biped slot(s). The biped slots used by this mod can be set via MCM in order to reduce or eliminate incompatibility.\r<br />\r<br />\r<br />--How to install--\r<br />1. Extract all files to &#34;&#92;Skyrim&#92;Data&#34; or install with your favorite mod manager.\r<br />2. Activate All Geared Up.esp.\r<br />\r<br />Once you&#39;ve loaded Skyrim with the mod installed, then you can modify the settings either via MCM or the console. The settings available via the console can be found by typing in \r<br />\r<br />help &#34;_agu_glob&#34;\r<br />\r<br />in the console. You can then set the values of those Global Variables:\r<br />\r<br />set GLOBALVARIABLENAME to VALUE\r<br />\r<br />where VALUE can be 0 (off/disabled) or 1 (on/enabled).\r<br />\r<br />If you change a setting via the console, then you need to save and reload for the change to take effect. Using the MCM does not require you to save and reload.\r<br />\r<br />If are going to use the custom Quick slot 1-8 hotkeys, then you need to modify controlmap.txt. Have the actual hotkeys for Quick slots 1-8 bound to keys you will not be using. The custom hotkeys will then inject the necessary scripting before tapping the actual hotkeys.\r<br />\r<br />\r<br />--How to uninstall--\r<br />Uninstalling this mod in the middle of a playthrough is not officially supported. Once the files have been removed, then you should either start a new game\r<br />or revert to a save that has not seen this mod.\r<br />\r<br />Remove the following files:\r<br />&#92;Skyrim&#92;Data&#92;All Geared Up.esp\r<br />&#92;Skyrim&#92;Data&#92;All Geared Up.bsa\r<br />\r<br />\r<br />--Known issues--\r<br />Animations from the previous weapon may carry over for a while when switching between weapons while using the 3rd person camera. This resolves itself once the player character plays an animation (for example performs an attack or blocks).\r<br />\r<br />Scabbards and sheaths may remain on the right-hand side of the player character at times. Manually equipping and unequipping the weapon should remove them, if it bothers you. This is most likely due to the way the game handles models.\r<br />\r<br />The custom Quick slot hotkeys can sometimes fail to show the weapon that was unequipped in favor of another weapon. Opening a menu (for example the inventory or favorites menu) forces weapons, which should be visible on the player character, to show up. The problem has been intermittent during testing and no obvious pattern has emerged. The custom SkyUI hotkeys do not seem to exhibit this problem.\r<br />\r<br />\r<br />--Credits--\r<br />charon711 for the mod name, feedback and help with testing.\r<br />SKSE team for all their hard work, which has made this mod possible.\r<br />bla08 for figuring out a bug involving meshes.\r<br />Thanks to everybody who helped with testing the release candidates and/or provided feedback to fix or improve the mod.\r<br />\r<br />\r<br />--How to contact the author--\r<br />PM MrJack on the official Bethesda forums or mrpwn on Nexus.\r<br />\r<br />Other mods:\r<br />[url=http://www.nexusmods.com/skyrim/mods/57873/]Extended UI[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27153]Field Alchemy[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/49994/]Five O&#39;Clock Shadow[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/55834/]Tangible Gold[/url]",
  "categoryId": "24",
  "version": "2.1.1",
  "author": "MrJack",
  "createdUnix": "1377432029",
  "updatedUnix": "1405617267",
  "containsAdultContent": false,
  "uploadedBy": "mrpwn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087153",
      "name": "All Geared Up",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "41",
      "fileName": "All Geared Up-40953-1-0-0.zip",
      "uploadedUnix": "1387290456",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/231426150a2bf97624c87f21c5cfcfc2774bb600c6f032103c4a27a75d500bb6/analysis/1407846423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Geared%20Up-40953-1-0-0.zip?fid=1000087153&ttl=1535821657&ri=8192&rs=8192&setec=334d889ff100307b634b8eaaf3ed71fc"
    },
    {
      "fileId": "1000089682",
      "name": "All Geared Up",
      "version": "1.1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "62",
      "fileName": "All Geared Up-40953-1-1-0.zip",
      "uploadedUnix": "1388760620",
      "modVersion": "1.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/478440a80c1feda720d742902c32bb07844e4f8729f8efd58f596f4ca77e186a/analysis/1407870173/",
      "changelogHtml": " - Fixed the source of stack dumps in two scripts: &#34;_agu_containers&#34; and &#34;_agu_npc_alias&#34;.\r<br />\r<br />- Fixed a bug where switching from a two-handed weapon to a shield via the 1-8 hotkeys would result in the two-handed weapon getting stuck in the right hand.\r<br />\r<br />- A new, optional and highly configurable feature. It combines and extends the underlying ideas of All Geared Up and Dual Sheath Redux. The following items can be shown on the player character at the same time:\r<br /> - 2 daggers\r<br /> - 2 maces\r<br /> - 2 staffs\r<br /> - 2 swords\r<br /> - 2 war axes\r<br /> - 1 battleaxe, greatsword or warhammer\r<br /> - 1 bow\r<br /> - 1 crossbow\r<br /> - 1 shield\r<br /> - 1 arrow quiver\r<br /> - 1 bolt quiver\r<br />Equipped and favorited items are shown automatically. Unequipping a non-favorite item or unfavoriting an item that is not equipped will remove the item from the player character&#39;s model. The feature comes with a SkyProc patcher that generates everything that is needed for items in the load order, allows you to select which types of items you want to show up on the body and which biped slot they should use. The provided options should make it easy to make the new feature suit your tastes/needs and make the feature compatible with other mods that may use some of those biped slots for their own items (Frostfall, Wearable Lanterns, Bandolier - Bags and pouches, and many more). The feature is compatible with the meshes used by/made for Dual Sheath Redux and as such supports all the mods that have a mesh pack for Dual Sheath Redux. The feature is incompatible with the core of Dual Sheath Redux, but will not interfere with Dual Sheath Redux unless the feature is activated, which is done by generating a patch with the new patcher. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Geared%20Up-40953-1-1-0.zip?fid=1000089682&ttl=1535821657&ri=8192&rs=8192&setec=832ae85e39656713d33b47d322bc1586"
    },
    {
      "fileId": "1000089683",
      "name": "All Geared Up - Walking Armory Patcher",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3708",
      "fileName": "All Geared Up - Walking Armory Patcher-40953-1-0.zip",
      "uploadedUnix": "1388760675",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e08d119fdc21adfa9c16a30e347ab36c5ab559245520ad579c25365e9a82a5e5/analysis/1407870186/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Geared%20Up%20-%20Walking%20Armory%20Patcher-40953-1-0.zip?fid=1000089683&ttl=1535821658&ri=8192&rs=8192&setec=f0cf22ca45d73815d89f67491b43607f"
    },
    {
      "fileId": "1000092899",
      "name": "All Geared Up",
      "version": "1.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "62",
      "fileName": "All Geared Up-40953-1-1-1.zip",
      "uploadedUnix": "1390479643",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e860bb297f4e19cb36d7bcb1245dea367d8ab56ec1c9d671fe3fbb3ec322af63/analysis/1407898146/",
      "changelogHtml": " - Fixed a bug where weapons would get stuck in the player&#39;s hands because the automated sheathing/unsheathing mechanism didn&#39;t work when the player was on a mount. As a result the automated sheathing/unsheathing is replaced by disabling and enabling the INI tweak when the player is on a mount. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Geared%20Up-40953-1-1-1.zip?fid=1000092899&ttl=1535821658&ri=8192&rs=8192&setec=bffecd0d8542e91d9db80ca0d5185c08"
    },
    {
      "fileId": "1000107381",
      "name": "All Geared Up",
      "version": "1.1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "62",
      "fileName": "All Geared Up-40953-1-1-2.zip",
      "uploadedUnix": "1398951403",
      "modVersion": "1.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/aab413cf648782842e2d6353c6ffd3e30f18549f28021c15fb8811e7661a437c/analysis/1408050316/",
      "changelogHtml": " - Changed the behavior that determined if the weapons should be shown or hidden when the player switches races (transforms into a werewolf or Vampire Lord). Should fix the issue causing weapons to become hidden when the player becomes a regular vampire. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Geared%20Up-40953-1-1-2.zip?fid=1000107381&ttl=1535821659&ri=8192&rs=8192&setec=5034512fc68af363dc79bd4b9b96bd82"
    },
    {
      "fileId": "1000114071",
      "name": "All Geared Up",
      "version": "2.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32",
      "fileName": "All Geared Up-40953-2-0-0.zip",
      "uploadedUnix": "1403446240",
      "modVersion": "2.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/45c2ced4b0dba52eeb1e89275b8cd2d7142e10556b7b233f4801a98b995d195e/analysis/1408138034/",
      "changelogHtml": " - Complete overhaul of the mod.\r<br />\r<br />- The bDisableGearedUp=0 tweak has been abandoned in favor of an approach more akin to what Dual Sheath Redux does. This change also means that this mod no longer needs to fix the various bugs caused by the INI tweak.\r<br />\r<br />- The need for a SkyProc patcher has been replaced with a system that uses SKSE to modify ARMO forms, and their associated ARMA forms, at runtime instead of creating ARMO and ARMA forms in advance based on the load order.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Geared%20Up-40953-2-0-0.zip?fid=1000114071&ttl=1535821659&ri=8192&rs=8192&setec=44bd55271c46b06884f86b2156d0f5d9"
    },
    {
      "fileId": "1000115802",
      "name": "All Geared Up",
      "version": "2.1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1668",
      "fileName": "All Geared Up-40953-2-1-0.zip",
      "uploadedUnix": "1404469182",
      "modVersion": "2.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/46717061df5ff6bc08d1a4c8f64bacb1c482c272f31c052c007ad306f3ac1874/analysis/1408160022/",
      "changelogHtml": " - Fixed bug that caused items to not show up when loading a game.\r<br />\r<br />- Fixed bug where items might not show up, if the armor forms, which are used to display weapons/shields, are removed from the player.\r<br />\r<br />- Added a new feature that displays certain non-weapon/shield items like a reactive coin purse, potions, scrolls, etc. on the player character. A reactive coin purse and torch can also be displayed on NPCs. The placement of certain items can be modified.\r<br />\r<br />- Merged the accomodate cloak and accomodate backpack options for shield.\r<br />\r<br />- Added a new option to hide shields when a backpack and/or cloak is detected. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Geared%20Up-40953-2-1-0.zip?fid=1000115802&ttl=1535821659&ri=8192&rs=8192&setec=cdd0e5e1f91b22dc8ccd1860bd3f2e7f"
    },
    {
      "fileId": "1000118007",
      "name": "All Geared Up",
      "version": "2.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1669",
      "fileName": "All Geared Up-40953-2-1-1.zip",
      "uploadedUnix": "1405617267",
      "modVersion": "2.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/45f360e55f8ff266417762af06615160a84feff0bc5450f3836088a9e34d8507/analysis/1405617322/",
      "changelogHtml": " - Fixed a bug where changing the slotmask of item slots doesn&#39;t stick after loading a save game.\r<br />\r<br />- Fixed an issue where the correct lighting wasn&#39;t applied to certain meshes when they were in the shadows.\r<br />\r<br />- Corrected a page name in MCM (&#34;Follower&#34; is now &#34;NPC&#34;)\r<br />\r<br />- Fixed a bug that caused coin purse stage limits in MCM to not correctly reflect the set value. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Geared%20Up-40953-2-1-1.zip?fid=1000118007&ttl=1535821660&ri=8192&rs=8192&setec=77e122bcadbe0a837f420b0561ea4b13"
    }
  ]
}