{
  "modId": 40962.0,
  "modName": "Archagruhn - WIP",
  "summary": "Discover the stronghold of Archagruhn in the ash wastes of Solstheim, uncover its secrets and claim it for your own. A unique player home worthy of a famous adventurer.\r<br />\r<br />Navmeshed and follower-friendly.",
  "descriptionHtml": "[b][size=+2][center]ARCHAGRUHN[/center][/size][/b]\r<br />\r<br />The mod adds a stronghold of Archagruhn to the ashlands of southern Solstheim to serve as a player house. I made the mod because Severin Manor and other house mods never suited me. I needed a place I could call home on this inhospitable island. It sometimes reminds me of the old days in Morrowind, and I hope it&#39;ll suit your tastes. Archagruhn is located north of Sun Stone, close to Ashfallow Citadel.\r<br />\r<br />[b]Velar was once a powerful mage of House Telvanni in Second and Third Eras. He was infected with Corprus during one of his travels, but he managed to reach his long-lost ancestral tomb and learnt that he was the heir of the accursed Sixth House, House Dagoth. This, along with Corprus, contributed to his insanity. Velar tried to learn more about his past since then.\r<br />Sometime after Red Mountain erupted in 4E 5, Velar departed to the island of Solstheim, now covered in ash. 200 years have passed in search of answers, as Velar traveled beyond Mundus, to the realms of Oblivion. During his visit to Apocrypha, the realm of Hermaeus Mora, the Daedric Prince of Fate and Knowledge, Velar came to know the whereabouts of Eldritch Tomes, strange artifacts which he soon found. With the power of Eldritch Tomes, Velar shaped his own little plane of Oblivion, known as Velar Ceysel, the way Mankar Camoran did with Mysterium Xarxes, and thus Velar received Daedra-like immortality.\r<br />Velar then built the stronghold of Archagruhn to serve as shelter during his seemingly unending search for clues about his past and his ancestors. He also started his ash spawn research, as well as the research of southern Solstheim&#39;s flora. During his research of trama roots, Velar has succeeded in growing huge ones. Unfortunately for him, something had gone awry and he lost control, resulting in partial damage roots did to the stronghold. By 4E 201, he traveled to Velar Ceysel, never to be seen again. Archagruhn still stands in the ash wastes of Solstheim, destroyed by the ashfall, but many parts of the stronghold remained surprisingly intact. Soon the Dragonborn will discover the stronghold...[/b]\r<br />\r<br />[b][center]---Features---[/center][/b]\r<br />-- Your very own place to stay on Solstheim, which has a small backstory in a form of notes of Velar, a powerful but insane mage who once resided here. Lots of new meshes similar to those of Castle Volkihar but with different colors, as well as overgrown trama roots around and inside the stronghold. Interior is navmeshed and follower-friendly.\r<br />-- Everything an adventurer would ever need, some basic necessities like smithy, arcane enchanter, alchemy lab as well as your own staff enchanter. 6 mannequins and 6 weapon plaques. \r<br />-- Ash spawn research wing, with one captive ash spawn. No real purpose, just for fun.\r<br />-- A shrine to the Reclamations.\r<br />-- A large central tower, serves as the watchtower. There&#39;s a good sight at the Red Mountain and the ash wastes of Solstheim.\r<br />-- Velar Ceysel, your little plane of Oblivion, made for fun and to store your most valuable loot. The altar that transports you to the plane is near the shrine. Followers will not follow you into the plane. It is inhabited by Velar&#39;s foul Soul Servants.\r<br />-- A treasury, with more mannequins, gold piles and weapon plaques. It&#39;s not navmeshed and won&#39;t be, since it&#39;s the place for the Dragonborn only.\r<br />\r<br />Be careful when approaching Archagruhn, though. The stronghold is guarded by four ash spawn (one ash spawn, two skirmishers and one immolator), which can be quite a challenge. One ash spawn also resides inside the stronghold, in the research wing, who possibly broke free. This one is easy to kill.\r<br />\r<br />[center][b]---Requirements---[/b][/center]\r<br />-- Skyrim with the latest patch (the later the better)\r<br />-- Dawnguard DLC\r<br />-- Dragonborn DLC\r<br />\r<br />[center][b]---Bugs/Problems---[/b][/center]\r<br />-- The books and paintings problem was not addressed yet. If you have a problem where the textures for those don&#39;t show up, simply bring up the console, click on these items and type &#34;disable&#34; without the quotes.\r<br />-- Velar Ceysel is not navmeshed, and thus the enemies encountered there will not move and attack. This is due to my CK crashing during attempts to navmesh the place.\r<br />-- The three out of six mannequins in the treasury don&#39;t work. I don&#39;t know what causes this problem, as I did everything properly (hopefully).\r<br />\r<br />[center][b]---Installation---[/b][/center]\r<br />-- You should place everything in plug-in&#39;s &#34;Data&#34; folder (Archagruhn.bsa, Archagruhn,bsl and Archagruhn.esp) to Skyrim&#39;s one.\r<br />\r<br />[center][b]---Credits---[/b][/center]\r<br />-- Bethesda, for making such great games like Skyrim and allowing everyone to mod them;\r<br />-- Blary, for the OpenBooks Resource;\r<br />-- Artisanix, for Paintings and Frames Resource;\r<br />-- And, of course, me, AncientNightblade, as I&#39;m the creator of this mod.\r<br />\r<br />And, if your Dragonborn needs some ash-themed spells, check [url=http://www.skyrim.nexusmods.com/mods/33469]Ash Magic[/url].\r<br />\r<br />[center]﻿---[b]Author&#39;s Note[/b]---\r<br />[/center]I hate to acknowledge that it&#39;s not what I originally wanted it to be. There are many bugs that I don&#39;t want to fix as I&#39;m really tired and think that all the work I did proved to be counter-productive in the end. I&#39;d be glad if someone could lend a helping hand, so that this mod would become something you want. Otherwise, I think I&#39;m close to abandoning this mod. If you can help, please PM me. Thanks in advance, and I hope you&#39;ll enjoy the mod in its still unfinished state.",
  "categoryId": "67",
  "version": "1.2",
  "author": "Ancient Nightblade",
  "createdUnix": "1377524203",
  "updatedUnix": "1408266383",
  "containsAdultContent": false,
  "uploadedBy": "AncientNightblade",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049647",
      "name": "Archagruhn",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14383",
      "fileName": "Archagruhn-40962-1-0.zip",
      "uploadedUnix": "1377503812",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/76714c39d3347ea9216f55c6ec4eade7de1f1dcb5dcd87899aa6d0e380651adc/analysis/1407697033/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Archagruhn-40962-1-0.zip?fid=1000049647&ttl=1535821666&ri=8192&rs=8192&setec=d3f63aa806e4d4bdfcf0a5c86fcf0227"
    },
    {
      "fileId": "1000111525",
      "name": "Archagruhn",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14323",
      "fileName": "Archagruhn-40962-1-1.zip",
      "uploadedUnix": "1401715423",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d20e4a50beea31fcba588c8132becc5867d72d67f77e374bd4c7cde132a25036/analysis/1408109102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Archagruhn-40962-1-1.zip?fid=1000111525&ttl=1535821666&ri=8192&rs=8192&setec=27161d3b7d1c729ce81e2c534dd8cedf"
    },
    {
      "fileId": "1000122451",
      "name": "Archagruhn",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15737",
      "fileName": "Archagruhn-40962-.zip",
      "uploadedUnix": "1408266383",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/74451bf4f2632a58742ed0e069c82178d08f25aa8e47d17d65a5cd8d62d2b908/analysis/1408266432/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Archagruhn-40962-.zip?fid=1000122451&ttl=1535821667&ri=8192&rs=8192&setec=ddaa58b8c730e7524254d34e2ea50971"
    }
  ]
}