{
  "modId": 40976.0,
  "modName": "Stiv Gro Fur",
  "summary": "A Work in Progress. This is a follower mod based around Gopher\\'s Orc Warlock Let\\'s Play (ended due to save bloat issues). I really enjoyed that LP and thought the idea of a Stiv Follower Mod would be really cool. As Gopher is apparently too busy to do this or not interested, I decided that I would try something like this myself. As I am rather ne",
  "descriptionHtml": "A longtime modder and mod maker named Gopher started a let\\'s play a while back. The character in that LP was an Orc Warlock who wanted to rule the Empire and the Orcs. It was a lot of fun to watch and I enjoyed it a lot. Sadly, that LP ended a little bit over a year ago due to some problems with save game bloat. Although he has started a new LP since then, I enjoyed watching Stiv\\'s adventures and wanted to do something as a sort of memento for Stiv the Mighty (strange as it may seem to want to do something like this for a video game character). After some thought and a bit of practice with the Creation Kit, I decided to work on a Stiv Follower mod. I recently finished it to the point where Stiv has a decent number of the spells he did during the LP and a similar suit of armor. One thing I should mention, however, is that due to the unique nature of his weapon, I had to swap it out for an Ebony Mace.\r\n\r\nThis mod is fairly basic at the moment as I am pretty new with the Creation Kit. As a result, this is a simple follower mod right now. You will find Stiv waiting in Dragonsreach, inside the Jarl\\'s throne room.\r\n\r\nA couple of warnings before you go off and download him. Stiv is a level 40 follower with a great many of the spells that he had at the beginning of Chapter 4 of the LP. As a result, he is extremely powerful and can be considered overpowered at the moment. Not only does he possess many of the spells he did in the LP, but he also has about five Shouts that he is capable of performing. I will be adding more as I come up with them. Also, I am unsure how compatible he is with Skyre as I made him with that mod uninstalled, so you\\'ll have to figure that out yourself.\r\n\r\nI am aware that Stiv is overpowered as he is now. Please do not complain about him being too strong. I plan to eventually create a voice acted questline around obtaining Stiv as a follower. That will take some time, though. As I said, I am a beginner with the Creation Kit, so I\\'m still working out how to do a lot of the stuff with it. In addition, I am attending college right now so my free time is limited.\r\n\r\nIf anyone has any ideas about what to do with this mod, or can point me to some good creation kit tutorials, I would appreciate it.",
  "categoryId": "96",
  "version": "1.0",
  "author": "DarkPhoenix92",
  "createdUnix": "1377459910",
  "updatedUnix": "1377459886",
  "containsAdultContent": false,
  "uploadedBy": "DarkPhoenix92",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049548",
      "name": "Stiv the Mighty - Warlock of Doom",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "Stiv the Mighty - Warlock of Doom-40976-1-0.7z",
      "uploadedUnix": "1377459886",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/41b04cd98ccf4621766778dc5b8b7419f30f4aa2cb8fffa65717124ce5a38264/analysis/1407696516/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stiv%20the%20Mighty%20-%20Warlock%20of%20Doom-40976-1-0.7z?fid=1000049548&ttl=1535821688&ri=8192&rs=8192&setec=6570ab252fee93e7cb1ba8b86bfad35d"
    }
  ]
}