{
  "modId": 40988.0,
  "modName": "Ulfrics Destruction Perk Overhaul",
  "summary": "This mod alters the useless Novice/Apprentice/Adept/Expert/Master perks to provide a more useful bonus.",
  "descriptionHtml": "This mod changes the novice, apprentice, adept, expert, and master destruction to boost the damage you do with destruction spells as opposed to the useless 50% off casting cost in Vanilla Skyrim. Once taken, these perks will cause the damage of destruction spells to level with your destruction skill.\r\nI set this up so that each point of destruction skill will increase damage by 3%, I’m happy with this so far. \r\nTo compensate for this chchange, the impact perk has been replaced by the “powerful casting” perk. This causes a slightly weakened cloak spell to form around the caster whenever casting a spell that was formerly affected by impact. \r\nThe amount of Magicka used to cast spells is also noticeably lower as you level your destruction skill, and NPCs now have the same modifier in this as the player does. As an example: at skill rank 20, with no modifiers, flames costs 12 magicka per second to cast. \r\n\r\nI plan on doing changes to conjuration, speech, and even weapon skills once I develop a better idea of whats possible and what would fit well with existing skills. Give me suggestions and I\\'ll try to add them in if I believe its plausible. This is my first mod, hope everyone likes it!\r\n\r\nInstalling:\r\n1. Back-up saved games.\r\n2. Extract the esp file to your Data Folder(typically located within your Steamapps Folder)\r\n3. Run the Nexus Mod Manager or Skyrim and check the box next to UlfricsPerkOverhaul - Destruction.esp.\r\n4. PANIC!!! No wait…I mean play Skyrim! Enjoy the mod! ?\r\n\r\nUninstalling:\r\n1. Delete UlfricsPerkOverhaul - Destruction.esp.\r\n2. Aren’t you glad you backed up your saves now? ;-)\r\n\r\nFAQ\r\n1. Can I use this with old saved games?\r\nYes. However, the powerful casting perk won’t work if you already have the impact perk before installing this mod.\r\n2. My computer exploded!\r\nNot my fault.",
  "categoryId": "73",
  "version": "1.0",
  "author": "Ulfric1",
  "createdUnix": "1377474830",
  "updatedUnix": "1377474824",
  "containsAdultContent": false,
  "uploadedBy": "Ulfric1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049579",
      "name": "UlfricsPerkOverhaul",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "UlfricsPerkOverhaul-40988-1-0.rar",
      "uploadedUnix": "1377474824",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8db0ac37187c3cf28d5ac9a07e7544f1c359afec582646181a8e94e4726559e1/analysis/1407696662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UlfricsPerkOverhaul-40988-1-0.rar?fid=1000049579&ttl=1535821708&ri=8192&rs=8192&setec=47beafd07c028373097da04b18b59ca9"
    }
  ]
}