{
  "modId": 40990.0,
  "modName": "Additional Child Beds For Major Hold Vanilla Homes",
  "summary": "",
  "descriptionHtml": "WARNING: If you have anything stored in the Alchemy/Enchanting rooms in any of these houses, you will need to move them out first!\r\n\r\nThis file is in development so it won\\'t work exceptionally well-I\\'m getting help from others it will gut all of the 5 vanilla houses in the major holds and allow for 6 children to live in each of them in conjunction with the multiple adoption mod.\r\n\r\nHoneyside redo is now complete, I will be working on Proudspire Manor next. Usual rules of moving family and reloading multiple times applies.\r\n\r\nProudspire Manor redo is now complete I will be working on Hjerm next. Usual rules of moving family and reloading multiple times applies. \r\n\r\nHjerm redo is now complete I will be working on Breezehome next. Usual rules of moving family and reloading multiple times applies. \r\n\r\nBreezehome redo is now complete I will be working on Vlindrel Hall next. Usual rules of moving family and reloading multiple times applies. \r\n\r\nVlindrel Hall redo is now complete I will be working on improvements next. Usual rules of moving family and reloading multiple times applies. \r\n\r\nI am aware that the pathing is not efficient and the sixth child sometimes just stands next to a bed. Also, in the future I will make updates so that as few items as possible are moved/deleted to make room for the beds.",
  "categoryId": "67",
  "version": "",
  "author": "Fusiontron",
  "createdUnix": "1377478555",
  "updatedUnix": "1379487238",
  "containsAdultContent": false,
  "uploadedBy": "Fusiontron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000056284",
      "name": "ChildBeds",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "ChildBeds-40990-.zip",
      "uploadedUnix": "1379487238",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b59f20861ef98adfc322d436ff142231554dc90fb71cf620fa258939e8366bde/analysis/1407727147/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ChildBeds-40990-.zip?fid=1000056284&ttl=1535821710&ri=8192&rs=8192&setec=c5f87563c920c7404963d8c726bd2a65"
    }
  ]
}