{
  "modId": 41014.0,
  "modName": "Kankaraya - Oriental House and Clothing",
  "summary": "A very rare Japanese mod containing an elegant oriental three-story house with a shop on the first floor that contains essential kawaii-type toys and clothing. Along with steampunk styled goggles!",
  "descriptionHtml": "First off, I am NOT the creator of this mod. The original creator of this mod is nowhere to be seen. But whoever is the maker of this well-done mod, ALL credit goes to them. This is only a translate.\r\n\r\nThe reason I bring you this mod is because it is so rare, I spent a very long time trying to figure out what this mod was and who the creator is. So, I have decided to bring it here to you on Nexus. The reason being, I do not want anyone else to suffer while trying to find this mod, no one should go through as much research and translating as I have done this past week. Here you go, kankaraya, all given with below instructions!\r\n\r\nREQUIREMENTS: None!\r\n\r\nINSTALLATION: Through NMM or manual download. (when downloading manually, put the zipped file in your Nexus Mod Manager mods tab, I tested this six times)\r\n\r\nHOW TO USE IN THE GAME: Remember, most of the clothing options are for female characters.\r\n\r\nStep 1: When it has installed properly, go to Riverwood and head west until you see an elegant Victorian style home across from the river. It should have four orange lanterns hanging on the porch.\r\n \r\nStep 2: Enter the commands console by using the ~ key, then type TCL and press enter. You should now be able to walk through the floor by facing down. To get back up, face up.\r\n \r\nStep 3: There is a hidden chest under the floor that contains the items required for you to get the Dwarven goggles. Take everything out of that chest. After that, leave the house and type TCL into the commands console in order to disable it, allowing you to walk on the ground.\r\n \r\nStep 4: Enter the house again and right next to the store counter will be a poster with a bunny in it. Below it is a valve, turn the valve and an item will come out, these items are part of the mod and in order to obtain the Dwarven goggles you must continue turning the red valve located under the poster on the first floor.\r\n\r\n(Or you can obtain the goodies at the oriental shop(victorian style house) just west of Riverwood)\r\n\r\nThank you!",
  "categoryId": "60",
  "version": "1",
  "author": "randomguy36",
  "createdUnix": "1377501596",
  "updatedUnix": "1377501591",
  "containsAdultContent": false,
  "uploadedBy": "randomguy36",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049641",
      "name": "KankarayaEnglish",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20433",
      "fileName": "KankarayaEnglish-41014-1.7z",
      "uploadedUnix": "1377501591",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b5749bedff1bb7dbdfe09d578a2248c7c586bc76e09212848b20a1ed6b33ef2e/analysis/1407697029/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KankarayaEnglish-41014-1.7z?fid=1000049641&ttl=1535821737&ri=8192&rs=8192&setec=5af69392efd523e149e2d0c3280acf42"
    }
  ]
}