{
  "modId": 41020.0,
  "modName": "Breezehome Crafting Tools",
  "summary": "Adds a (modified) smelter, a workbench, an anvil, a tanning rack, an alchemy workbank (for the Hearthfire players) and an enchantment workbench to a new room in breezehome (no loaddoor)",
  "descriptionHtml": "Have you ever wondered, why the thane of Whiterun has to leave his house to craft things? Why you have to beg Adrianne Avenicci for using her smithing tools or Farengar for his enchantment table? Does it annoy you that your kids steal your alchemy workbench and there isn\\'t another in a three miles radius?\r\n\r\nWorry no more, your savior has come. While you were grocery shopping (or dragonhunting) some Gnomes snuk into your house and built you a new room with all crafting tools you need. (They also robbed you but this doesn\\'t really matter, does it?)\r\n\r\nIf you didn\\'t worry at all it doesn\\'t matter you could still use the mod to save time, shoes (lesser walking (save the shoes)) and loading screens.\r\n\r\nThis mod adds a (modified) smelter, a workbench, an anvil, a tanning rack, an alchemy workbank (for the Hearthfire players) and an enchantment workbench to a new room in breezehome. The furniture in the room appears when you buy the living room upgrade from Proventus Avenicci.\r\n\r\nIt\\'s in a seperate room but accessible without a loadscreen.\r\n\r\nCOMPATIBILITY:\r\nIs NOT compatible with mods editing the same wall in Breezehome.\r\nIf you have Skyrim Project Optimization the Room isn\\'t rendered correctly until you enter it, because of a occlusion plane it adds. If you don\\'t want this to happen you will have to delete the plane (Via TES5Edit or the Creation Kit.\r\n\r\nNOTE:\r\nI\\'m not responsible for any harm or damage cause by ravaging gnomes (just kill them).\r\n\r\n*sorry for my bad english, it\\'s not my native language*\r\n\r\nThanks to:\r\n- Bethesda for Skyrim and the Creation Kit\r\n",
  "categoryId": "85",
  "version": "1.2",
  "author": "xMaster2072",
  "createdUnix": "1377516309",
  "updatedUnix": "1378016869",
  "containsAdultContent": false,
  "uploadedBy": "xMaster2072",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000051307",
      "name": "Breezehome Crafting Tools - Updated",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Breezehome Crafting Tools - Updated-41020-1-2.zip",
      "uploadedUnix": "1378016869",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b253705a687d2bcbf49a0dc0b7c82911e1bb1c94b922c52d67bdea9df129583a/analysis/1407704577/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20Crafting%20Tools%20-%20Updated-41020-1-2.zip?fid=1000051307&ttl=1535821744&ri=8192&rs=8192&setec=066aee12ab5040e478ba05fa5725f0bb"
    }
  ]
}