{
  "modId": 41047.0,
  "modName": "Savegame - Nord Level 11 - Main Quest Completed",
  "summary": "Savegame of a level 11 Nord. Main Quest is finished (legit playthrough). No perks taken. Owns horse and Breezehome is fully upgraded with a lot of weapons, armors, gems etc. inside. No mods used.   ",
  "descriptionHtml": "Made a rather quick playthrough of the game for future use, so I don\\\\\\'t have to do the main quest again. \r\nI only did 2-3 minor side quests, so most of the world is untouched. Only traveled to locations that are related to the main quest. \r\nThe character is a Nord named Rhys. He is level 11 (I always chose health on level up) without any perks so you have 10 free perk points to distribute. \r\nInside Breezehome you will find all the stuff I collected during the playthrough.\r\n\r\nHe has 30+ skill in Onehanded, Archery and Twohanded. \r\nIf you don\\'t want to play with Rhys you can use the \\\"showracemenu\\\" command to change his sex and appearance, but it will probanly mess up your skills if you change his race. \r\nTo prevent this open up the console, click on the player character and type in \\\"player.setrace highelfrace\\\" which will turn him into an highelf for example. After this you can use showracemenu to change his sex and appearance. Your skills will not change, only the race related powers and perks will change according to the race you have chosen.  \r\n\r\nIf you have any questions please write a comment.  ",
  "categoryId": "43",
  "version": "",
  "author": "Laufknoten2",
  "createdUnix": "1377549570",
  "updatedUnix": "1377549557",
  "containsAdultContent": false,
  "uploadedBy": "Laufknoten2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000049793",
      "name": "Rhys - Level 11 - MQ completed",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1562",
      "fileName": "Rhys - Level 11 - MQ completed-41047-.7z",
      "uploadedUnix": "1377549557",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d165adface466b70da3ae56d785951ad5ce8d282c17bcf0946fd79da8ffe778e/analysis/1407697751/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rhys%20-%20Level%2011%20-%20MQ%20completed-41047-.7z?fid=1000049793&ttl=1535821773&ri=8192&rs=8192&setec=a8a522f05990f26f69588f673e10754c"
    }
  ]
}