{
  "modId": 41101.0,
  "modName": "Argonian Assemblage and Argonian Children Overhaul",
  "summary": "",
  "descriptionHtml": "Adds 6 adoptable children right outside the Argonian Assemblage in Windhelm. I plan to do a storyline involving them eventually as a continuation of the Argonian Ebonheart Mission/Twin Lamps sub-plot of Morrowind.\r<br />\r<br />Credit to NyessaX for this idea, this expands upon her file. Chases-Starlight is her character and I also copied the character Shines-Like-Silver from Quetzalverde. They are popular characters on the Nexus so I included them in this mod.\r<br />\r<br />This is an immersion mod and a player house mod. It adds over 60 Argonians to live in the Assemblage and who work the docks. These Argonians include 18 children who are not orphans. The Assemblage cell has not been changed in terms of size for this mod. The Assemblage and all Argonians are cramped into an even tighter space for living and working. They must do things like eat standing, sleep on the floor, etc.\r<br />\r<br />To use the player house, I recommend using TMPhoenix&#39;s multiple adoptions mod as I used it to design this. Just use the &#34;Bless Home&#34; spell inside the Assemblage and it will work.\r<br />\r<br />Bugs:\r<br />The Assemblage shares the same exterior location as Hjerm. So when you move to the Assemblage with your family (and since you&#39;re using this mod, why not just have the children I included as your children?) the children may sandbox either inside Windhelm or at the docks, this is random. So if the children are inside Windhelm, just redo the move.\r<br />\r<br />Recommended files: \r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=122852220\r<br />\r<br />These children have been orphaned as a result of former Argonian slaves leaving Morrowind and not being able to make it. They were only able to make it as far as Windhelm where they face challenges from both Ulfric and the Dunmer. Or alternatively their are your character&#39;s own biological children. Just headcanon it.\r<br />\r<br />Credit to Natterforme for letting me use a scarf from the Scarves of Skyrim mod. It is on the children so that can wear the vanilla child clothes without having their heads floating above their shoulders with no neck.",
  "categoryId": "33",
  "version": "",
  "author": "Fusiontron",
  "createdUnix": "1377629891",
  "updatedUnix": "1418151527",
  "containsAdultContent": false,
  "uploadedBy": "Fusiontron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138279",
      "name": "ArgonianOverhaul",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10072",
      "fileName": "ArgonianOverhaul-41101-.zip",
      "uploadedUnix": "1418151527",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7e6046f73b007c6fc5f70c6c7651a157e44a5d79b0b8b095cbcd589b7b18a714/analysis/1418151555/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArgonianOverhaul-41101-.zip?fid=1000138279&ttl=1535821853&ri=8192&rs=8192&setec=db0d27eb9e4c65ae31c0dc663c70a0e6"
    }
  ]
}