{
  "modId": 41129.0,
  "modName": "Better Item Names",
  "summary": "Stop going through your ABC\\'s in your head. Find what you\\'re looking for - Quickly!",
  "descriptionHtml": "Ever get tired of looking for items in your inventory? I know I do. How many times have you had this conversation with yourself..\r\n\r\n[I]\\\"OK, I need arrows.. Let\\'s see... Iron? no.. Keep going... Steel? No.. I thought I had some Ebony... Lemme go back up..\\\"[/I]\r\n\r\n.. Admit it, you\\'ve done it... Don\\'t lie to me. I can see that expression on your face right now.. Yes.. That one. You\\'re lying.\r\n\r\nNow, even though great mods like SkyUI add a search option, I\\'m just too darn lazy to use it. And other mods like SkyRe do this in some fashion, but you have to... you know.. Use the rest of the mod to get it. And while SkyRe is very popular (And for good reason!), I prefer my perk trees the way they are, thank you very much!\r\n\r\nSo I decided to get off my lazy backside, and make a mod everyone can enjoy and build on! So after all the blood, sweat, and tears (Read: 2-4 hours of discretionary time.. Would have been less if I could spell without spellcheck... And I did get quite a beating from my wife for wasting time in game \\\"testing\\\" my complicated mod... That covers the blood and tears, and I\\'m sure she worked up a sweat swinging those skinny arms... Oh.. HI DEAR! XOXOX)\r\n\r\nAhem... As I...\r\n\r\n(Come to think of it, I put more effort into this description than the actual..)\r\n\r\nAAAHHEEEEEEMMMMM! .... AS I WAS SAYING...........\r\n\r\n... I give to you:\r\n\r\n\r\n[center][b][u][size=11]Better Item Names[/size][/u][/b][/center]\r\n\r\n\r\nCatchy title, no?\r\n\r\nIt\\'s really just that simple. I\\'ve gone through all the common items I could think of that bother me to search for, and I named them in intuitive ways. What items, might you ask? Great question!\r\n\r\nArrows\r\nBolts\r\nClaws\r\nGems\r\nIngots\r\nOres\r\nPelts\r\nSoul Gems\r\n\r\nThey\\'re named in a way that makes them easy to find, and in some cases, easy to evaluate their effectiveness. Arrows all start with the word \\\"Arrows\\\"!  Pelts all start with \\\"Pelt\\\"! Ores all start with (You guessed it!) \\\"Ore\\\"! Even Soul Gems, for example, have a I-VI rank to determine their effectiveness.\r\n\r\nThe one liiiiitttttlllleee tricky thing I did? Potions. EVERYTHING in potions is technically a potion. How do you organize THAT?  Well here\\'s how I did it, and I think it\\'s pretty darn neat. Here\\'s the explanation behind the prefix\\'s:\r\n\r\nPotions (Explained)\r\n\t- Poison \t- Same as vanilla It\\'s a poison. \r\n\t- Potion \t- Stat recovery and adjustments like Health, Carry Weight, Regeneration, etc. The stuff you\\'re probably ACTUALLY using potions for.\r\n\t- Elixir \t- Skill augmentation (Fortify [Skill Name])\r\n\t- Draught \t- Resist [Fire/Frost/Magic/Shock]\r\n\t- Solution\t- Combination of Potion and Elixir, usually has 1 stat adjustment and 1 skill augmentation.\r\n\t- Bane\t\t- Weakness to [Fire/Frost/Magic/Shock]\r\n\r\nNote: This only affects store/found potions.. I have no idea how to go about changing crafted potions, but I may look into it in the future.\r\n\r\nAnd that\\'s it! No renaming of weapons, armor, etc., just a few small things that I thought needed it the most... For now. I hope you enjoy! If you have any requests, I\\'ll make seperate files as needed based on demand.\r\n\r\n[b]---------------------------------------\r\nInstallation Instructions:\r\n---------------------------------------[/b]\r\nInstall with Nexus Mod Manager (NMM) or simply extract to your Skyrim Data folder.\r\nThis has separate .esp files for the core Skyrim game and each expansion. Simply delete the ESP\\'s for the DLC you don\\'t have, or uncheck them in the data files.\r\n\r\nThe files also have a number in their name denoting load order, but I\\'m fairly certain no harm will come if they are out of order.\r\n\r\n[b]---------------------------------------\r\nUn-Install:\r\n---------------------------------------[/b]\r\nA) Uninstall with NMM\r\nB) Delete all files that start with \\\"Better_Item_Names\\\" from your Skyrim Data Folder\r\n\r\n[b]---------------------------------------\r\nKnown Issues\r\n---------------------------------------[/b]\r\nAugust 27th, 2013: None.\r\nI have not tested this with very may mods, or with SkyRe, since it pretty much does this in some fashion. If you encounter any issues, please let me know, though chances are good if something happens, it\\'s the other mod\\'s fault. Who writes anything for a mod based on item NAME, when you have an item ID unique to your item and readily available? Sloppy, lazy coders, that\\'s who!\r\n\r\n[b]---------------------------------------\r\nTechnical Explaination:\r\n---------------------------------------[/b]\r\nThis mod ONLY changes the name property for each of it\\'s entries. \r\nIt does not change any effects, EditorID\\'s or FormID\\'s.. Just the name. \r\nSuper technical, I know.\r\n\r\nOh, and it\\'s TES5Edit cleaned! You wouldn\\'t BELIEVE the conflicts it had, since it was so complicated...\r\n\r\n[b]---------------------------------------\r\nTerms of Use:\r\n---------------------------------------[/b]\r\nTake it! Translate it! Use it in  your mod! Upload to your favorite forum, or rename it to \\\"ICantBelieveThisIsAMod.esp\\\"! Go wild, ladies and gentlemen! I know I\\'m too lazy to!\r\n\r\nBut if you could, please just give a nod in my direction. It\\'s appreciated. [i](Unless your mod/changes suck. And you know when it sucks. Then don\\'t put my name on it. I don\\'t need any more bad info about me on the intertubes.)[/i]",
  "categoryId": "85",
  "version": "1.0",
  "author": "Thayn",
  "createdUnix": "1377653210",
  "updatedUnix": "1377652508",
  "containsAdultContent": false,
  "uploadedBy": "Thayn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000050177",
      "name": "Better Item Names",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Better Item Names-41129-1-0.7z",
      "uploadedUnix": "1377652508",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/777519c3b5a75e823ec2aff69b95a61936d4daee8d9a088de712193f5d52285d/analysis/1407699484/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Item%20Names-41129-1-0.7z?fid=1000050177&ttl=1535821876&ri=8192&rs=8192&setec=6520b1b657fa7553eec70f412b02cf5f"
    }
  ]
}