{
  "modId": 41132.0,
  "modName": "Children Of Honorhall Orphanage",
  "summary": "Two simple little adoptable children replacers.  One for Daughters, and another for Sons.  It is VERY IMPORTANT THAT YOU READ THE INSTRUCTIONS BEFORE INSTALLATION.",
  "descriptionHtml": "I will have no sympathy for anyone who does not read the instructions below, letter for letter, word for word.  My only response to such posts is going to be \\\"read the instructions again\\\"  I will however be as helpful as possible if problems come up which i did not anticipate.\r\n\r\nFirst, lets get over the limitations/requirements.  These files require Hearthfires.  I strenuously recommend that you start a new game for this.  At the very least, go back to a save before you approached ANYONE about adoption.  This last method has worked for me.  These mods MUST NOT BE INSTALLED TOGETHER.  Choose one or the other, not both.\r\n\r\nThese mods are intended as companion mods for the \\\"Hearthfires Multiple Adoption Mod\\\"\r\n\r\nhttp://skyrim.nexusmods.com/mods/29249/?\r\n\r\nTo make it clear, Hearthfires Multiple Adoptions is not actually required to use this mod.  It is just that you will be restricted to two children, instead of six.  i did design this specifically to go with HMA, but it is not required.\r\n\r\nAbout the children...\r\n\r\nFirst, about the girls.  The replacements for all the girls used to be boys, so they will still think they are the person they used to be, before when you instruct them to tell you about themselves.  Haelyn for example will give you some text lines about being Hroar.  Everything else seems to work pretty well, they interact with you as if they were always girls.  Also, I did not alter Runa Fair-Shield, and she is still going to complain about being the only girl in the orphanage, even though the only boy is Aventus Arentino at this point.  Each of these packs contains a Vampire child for adoption.  Be warned, adopting the vampire child seems to mark the end of your adopting, so always adopt the vampire child last.  If you want all six daughters, (bless your house first if you are using HMA) go to constance michel after getting the letter \\\"consider adoption\\\" and apply for the adoption process.  This can not happen until Grelod is dead, and Aventus Arentino has been informed of this.  Whether you kill grelod first, or talk to aventus first is irrelevant.  You must have one of three titles bestowed upon you before constance michel will take you seriously, and allow you to adopt.  You must be any one of these A) Dragonborn B) Harbinger of the Companions, or C) Archmage of the college of Winterhold.  \r\n\r\nFirst, adopt the three non vampire girls in the orphange, leaving Victoria Vine behind for the time being.  Next, go to Windhelm, and go around the inner side of the city walls between 11 and noon until you run across a little girl with flowers, and talk to her.  This is daughter number 4.\r\n\r\nNext, fast travel to Dragonsreach, and go down the stairs to the next circular area until you find a beggar girl sitting on one of the benches.  talk to her, its that simple.\r\n\r\nLastly, go back to the honorhall orphanage, and go adopt the vampire child, Victoria Vine.\r\n\r\nNow about the boys.  Some of this was covered with the girls, and i am not going to repeat myself as much as i probably should, so be sure you read about the girls first, even if you are going to opt for the boys.\r\n\r\nTo adopt only sons.\r\nFirst, go to the honorhall orphanage, and adopt all the non vampire boys.  (Avoid Victor Vine at this point, as adopting the vampire child seems to disable further adoptions.)\r\n\r\nNext, go to Katla\\'s Farm, just outside the door to Solitude.  Look for a boy who seems disgusted working on the farm.  Talk to him, and the adoption dialogue will pop up pretty soon.\r\n\r\nNext, go to Dawnstar.  Look around for this one all over town.  He might be helping at one of the farms, or taking lunch to the mine workers near one of the two mines.  This one can be pretty difficult to locate, but he is there, so don\\'t think this mod did away with him.  I have tested this, and he is there, but just difficult to find.\r\n\r\nLastly, go back to the honorhall orphanage, and adopt the vampire child, Victor Vine.\r\n\r\nMost of the Children have had their races/appearance changed.  Hairstyles, race, gender, identities, and clothing are changed. \r\n\r\nDon\\'t know if this is important, but i have a habit of sleeping somewhere far away  from where i am going to send my children to live.  I sleep for several days, at least 3 and a half before i go to see if my children are all there.  as long as you followed the instructions above, your children should all be where they are supposed to be.  (recently discovered this is not an issue)\r\n\r\nIncompatibilities\r\nProbably any other mod which does exactly the same thing this one does.  (i have not seen one available, which is one reason i am doing this, but that is not to say that it will not happen.)  In fact, these two mods are incompatible with each other for that reason.  Choose one or the other, not both.\r\n\r\nThese mods may, or may not be compatible with the Adopt Aventus mod, since that mod changes the adoptability of Samuel, who is one of the children replaced in both mods.  This is not tested, yet.\r\nhttp://skyrim.nexusmods.com/mods/30349/?\r\n\r\nI have recently been informed that there is most likely a conflict with a mod called xvision children.  i had a look at that mod, and after reading the description decided it was not for me.  Besides, Apachii, author of the incredible SkyHair mods, is working on a better looking children mod with new skin textures and skyhair.  the screenshots he showed me were breathtaking.  truly beautiful children.  stay tuned for that mod to be released, as i will be incorporating it into this mod as soon as it is.\r\n\r\nI am labeling these as .5 betas, (just updated to .6) because although i thoroughly tested them myself, i have yet to get a lot of feedback.  They will remain in beta state until i a certain there are not any problems which i did not mention uncovered by other people.\r\n\r\nIf anyone has any knowledge about creating new children, or simply making altered copies of an existing child please contact me.  I did a mega fail on that attempt, which is one reason these are replacers.  These mods are simple stupid to make, as long as your know a few ground rules.  I am willing to put more effort into it to create a new children alternative if someone will just point me in the right direction.",
  "categoryId": "66",
  "version": "0.6",
  "author": "kar2nz",
  "createdUnix": "1377655059",
  "updatedUnix": "1377739115",
  "containsAdultContent": false,
  "uploadedBy": "kar2nz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000050186",
      "name": "Children Of Honorhall Orphanage _ The Sons - grey face bug",
      "version": ".5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Children Of Honorhall Orphanage _ The Sons-41132--5.zip",
      "uploadedUnix": "1377654761",
      "modVersion": ".5",
      "virusScanUrl": "https://www.virustotal.com/file/0f8bc69624ac5306e0d9d7c61f2c55a04f962b3333e87e372690b1e1d692b8b4/analysis/1407699485/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Children%20Of%20Honorhall%20Orphanage%20_%20The%20Sons-41132--5.zip?fid=1000050186&ttl=1535821878&ri=8192&rs=8192&setec=01695aa677a12ea4d62519b753598e03"
    },
    {
      "fileId": "1000050193",
      "name": "Children Of Honorhall Orphanage _ The Daughters - grey face bug",
      "version": ".5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Children Of Honorhall Orphanage _ The Daughters-41132--5.zip",
      "uploadedUnix": "1377655035",
      "modVersion": ".5",
      "virusScanUrl": "https://www.virustotal.com/file/efdb880ca6ff6eada06213cafe540a52e0908671991a97c17046bb3828ec0c18/analysis/1407699490/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Children%20Of%20Honorhall%20Orphanage%20_%20The%20Daughters-41132--5.zip?fid=1000050193&ttl=1535821878&ri=8192&rs=8192&setec=dd3f8bd454e7068f322706af1c8d80b3"
    },
    {
      "fileId": "1000050542",
      "name": "COHO _ Children Of Honorhall Orphanage _ The Daughters",
      "version": ".6",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2437",
      "fileName": "COHO _ Children Of Honorhall Orphanage _ The daughters-41132--6.zip",
      "uploadedUnix": "1377738559",
      "modVersion": ".6",
      "virusScanUrl": "https://www.virustotal.com/file/bddb5ecd02d42a7905785be92237ef9e21a1f7a61190cb41645e59b623bc794c/analysis/1407700563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/COHO%20_%20Children%20Of%20Honorhall%20Orphanage%20_%20The%20daughters-41132--6.zip?fid=1000050542&ttl=1535821879&ri=8192&rs=8192&setec=717eec5f28b90911f9b760b15375d698"
    },
    {
      "fileId": "1000050544",
      "name": "COHO _ Children Of Honorhall Orphanage _ The Sons",
      "version": ".6",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4837",
      "fileName": "COHO _ Children Of Honorhall Orphanage _ The Sons-41132--6.zip",
      "uploadedUnix": "1377739115",
      "modVersion": ".6",
      "virusScanUrl": "https://www.virustotal.com/file/fc6dea2e1705ad692a981efdee839402f63eb406e34ab88eb9b2e2f132e6b98e/analysis/1407700566/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/COHO%20_%20Children%20Of%20Honorhall%20Orphanage%20_%20The%20Sons-41132--6.zip?fid=1000050544&ttl=1535821879&ri=8192&rs=8192&setec=65fdd25964b1f30a1751e149322b0679"
    }
  ]
}