{
  "modId": 41150.0,
  "modName": "Clansey - Redguard Follower_Block Master_Marriage Partner",
  "summary": "Clansey is a Redguard warrior with a storied past, stuck in Skyrim thanks to the Stormcloak Rebellion. Recruit his services, pay him to level your blocking skill (all the way to 100!), or just listen to his compelling life story. And, for players wearing an Amulet of Mara, Clansey can even become your marriage partner! \r\n",
  "descriptionHtml": "Clansey is a Redguard warrior with a storied past, stuck in Skyrim thanks to the Stormcloak Rebellion. Recruit his services, pay him to level your blocking skill (all the way to 100!), or just listen to his compelling life story. And, for players wearing an Amulet of Mara, Clansey can even become your marriage partner! \r\n\r\nRequirements: \r\n- Hearthfire DLC, as Clansey\\'s default armor is the same as Rayya\\'s. If there\\'s enough demand, I\\'ll change it to something compatible with classic Skyrim. \r\n\r\nLocation: Dead Man\\'s Drink in Falkreath \r\n\r\nFeatures: \r\n- Dynamic Follower that levels with you (up to 80). In fact, he actually levels 20% faster, making him an always tough and gritty companion ready for the next challenge. Clansey also has the Light Foot perk -- no more setting off traps! \r\n- Complete with a (hopefully) compelling and well-written back story, one that will have you voraciously clicking to hear more! \r\n- Clansey\\'s life story is canon-friendly, and fits nicely into the lore of The Elder Scrolls Universe. \r\n- All dialogue is custom voiced, albeit by an amateur (don\\'t make fun of me, I tried!). \r\n- Can train Block all the way up to 100, the only NPC in game to do so (other Master trainers stop at 90) \r\n\r\n\r\nKnown Issues: \r\n- Will not say \\'I do\\' during marriage ceremony, as this dialogue file is both a float and shared. Also, this part of the ceremony may lock-out during the part where Clansey should say \\'I do\\'. Hard and quick save before the ceremony. Eventually, it will work. \r\n- If you dismiss Clansey at any time -- even if you married him -- he will return to Dead Man\\'s Drink in Falkreath. I\\'m not sure how to make Clansey return to one of your many homes. If anyone knows, drop me a line. \r\n- Also: after marriage, Clansey may only have the two dialogue options \\'Come live with me at X home\\' or \\'Let\\'s stay at your place\\'. The rest of Clansey\\'s dialogue will not open back up until you\\'ve selected BOTH of these options and \\'Visited Your Spouses\\'s Home\\' (at Dead Man Drink). \r\n- Shared in-home dialogue such as \\'We have a skeever problem\\' and \\'Deal with the wolves, please\\' have not been recorded and will probably not appear. This shouldn\\'t be a problem, however, since Clansey will never return to one of your houses. \r\n- If you try to recruit Clansey with another party member, his backstory dialogue option \\'So what\\'s your story?\\' will not be available. Dismiss your companion, quicksave, then quickload. It should be avaibable upon the reload. \r\n- Cannot become a Blade. \r\n\r\nPotential Issues: \r\n- All of Clansey\\'s base float dialogue was copied form Mjoll (before it was customized). Mjoll\\'s dialogue should be intact, but if it\\'s not for some reason, please let me know. \r\n- May or may not work with other Companion Mods (untested). \r\n- Clansey may be hard to hear in large cities or loud areas. Try turning down sounds not associated with voice. \r\n\r\n\r\nSpecial Thanks to: \r\n- PCGamersAnonymous\\'s Companion Tutorial, as found on Youtube. It literally walked me through nearly every step for this character. Well done, and thank you kindly. \r\n\r\n\r\nDrop me a comment if you like or dislike, and thumbs up if you like! \r\n\r\n\r\n***COMING SOON*** Fallout: NV style Follower Quests! ",
  "categoryId": "96",
  "version": "",
  "author": "AngryPorto",
  "createdUnix": "1377688407",
  "updatedUnix": "1377688407",
  "containsAdultContent": false,
  "uploadedBy": "AngryPorto",
  "primaryFile": null,
  "files": []
}