{
  "modId": 41255.0,
  "modName": "Black Against Night - Enchantments for the Discerning Adventurer",
  "summary": "A small collection of dark and vampire-themed enchantments for a variety of players.",
  "descriptionHtml": "Black Against Night\r<br />Enchantments for the Discerning Adventurer\r<br />Version 2.3\r<br />by xunderxdosedx\r<br />\r<br />\r<br />\r<br />What it does:\r<br />Adds some custom enchantments geared towards vampires and other &#34;dark&#34; characters like assassins or necromancers. I did this partially for role-playing purposes and partially due to the lack of useful enchantments in vanilla Skyrim. \r<br />Each one has been specifically designed to help increase your character&#39;s overall survivability in visually unique ways, and to offer some options lacking in the vanilla assortment of enchantments.\r<br />These enchantments are best combined with your favorite armor/weapon mods.\r<br />Please remember to endorse the mod if you like it, it&#39;s been a pleasure working on it and feedback from the community is always appreciated.\r<br />\r<br />\r<br />UPDATE: Version 2.3\r<br />-Slightly increased the chance for Night&#39;s Boon to use its&#39; summoning spell. \r<br />-The Corrupted Priest summoning has been given a new Conjuration spell which allows him to summon a Corrupted Shade. The Shade uses a Bound Bow/Arrows and the Marked For Death shout.\r<br />-Finished up some final tweaks to the magic effects I created, most notably the new spells used by the Corrupted Priest. Everything should be more or less silent now so as to interfere with your stealth as little as possible.\r<br />-Made a minor change to the bat cloak effect in order maximize compatibility with other mods. You won&#39;t even notice the difference.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />The enchantments:\r<br />\r<br />\r<br />\r<br />\r<br />- Night&#39;s Protection, placed on Volkihar Enforcer Armor [can be placed on any item which can hold Fortify Healing Rate enchantments]\r<br />In combat, the player is surrounded by a cloak of bats similar to the ability granted by the Night Cloak Vampire Lord perk, but this one absorbs 10 health per second as opposed to NC&#39;s default 4 points. It is functionally like a cross between the NC perk and the Ebony Mail&#39;s automatic shadow cloak with a few addition refinements. This effect is inactive when brawling, sneaking, swimming, or sparring with Vilkas early in the Companions questline.\r<br />In addition, Night&#39;s Protection also grants a small chance to paralyze enemies who hit the player with a melee attack. If the enemy fails to resist, they are paralyzed for five seconds. Almost identical to the scripted effect on Ahzidal&#39;s Armor of Retribution, but with the red Charmed Vigilant visual instead of normal green paralysis one, and a slightly reduced time on the effect [7s to 5s]. \r<br />The rate at which the cloak spell heals you gets noticeably higher against groups of enemies, at times healing the player rather rapidly as it absorbs 10 hps from each enemy within range. It will also leave the bodies of your foes looking like a bloodied mess, and is ineffective against Daedra, Dwemer Centurions, and Undead.\r<br />The Paralaysis effect is intended as a little extra deterrent against melee attackers. It only triggers very rarely, only in melee, and many foes are resistant to it. I also tuned the duration down from the effect duration on Ahzidal&#39;s armor to help balance it out a little better. I found it&#39;s a nice compliment to difficulty-enhancing mods such as Revenge of the Enemies and DUEL: Combat Realism.\r<br />\r<br />\r<br />- Night&#39;s Embrace, placed on Volkihar Enforcer Ring [can be placed on any item which can hold a Fortify Health enchantment]\r<br />Reduces incoming damage from bows/crossbows, Animals, and Dwarven enemies by 10%.\r<br />This makes for a slightly useful bonus to your physical protection against archers and Centurions, with an added bonus that parallels [and stacks with] the animal damage resistance of Kyne&#39;s Token.\r<br />\r<br />\r<br />- Night&#39;s Renewal, placed on Volkihar Enforcer Ring of Renewal [can be placed on any item which can hold a Resist Shock enchantment]\r<br />Grants the player 20% Spell Absorption. I intended this to stack with the Atronach stone/perk, or Miraak&#39;s gear. It is also useful [but not overly so] on its own.\r<br />Necromage vampires using both the Atronach stone and perk will probably find it to be of little use, as their Spell Absorption is likely already 100%.\r<br />\r<br />\r<br />- Night&#39;s Vengeance, placed on Volkihar Enforcer Ring of Vengeance [can be placed on any item which can hold a Fortify Health enchantment]\r<br />Creates a chance to spawn a vampiric explosion when the player is hit by something. The explosion deals 100 points of non-elemental magical damage to enemies within range and carries a mild stagger effect. This is sort of my own version of the tentacle explosion from Miraak&#39;s Robes, only much less ugly and visually intrusive [the vanilla effect, while I find it useful, is also distracting and hideous].\r<br />Like Night&#39;s Protection&#39;s cloak, this effect will deactivate when sparring with Vilkas or brawling with other NPC&#39;s. This effect may seem unbalanced or annoying to some players, so it&#39;s not for everyone. I&#39;m including it so the player has the option to use it if they want.\r<br />\r<br />\r<br />- Night&#39;s Thirst, placed on Reaper&#39;s Axe [can be placed on any weapon]\r<br />Absorb 15 points of health, magicka, and stamina per hit, almost exactly like the enchantment on Harkon&#39;s Sword but with the vampirism requirement removed, infinite uses, and it will now be effective against any enemy except Centurions. I chose this for its usefulness to all character types, as well as its dual offensive/defensive properties.\r<br />I also made custom absorb magicka/stamina effects which use red shaders instead of blue/green, respectively. This helps makes the effect look more vampiric in nature and helps to avoid the effect looking like Christmas lights.\r<br />\r<br />\r<br />- Night&#39;s Rejuvenation, placed on Volkihar Enforcer Amulet [can be placed on any item which can hold Fortify Magicka enchantments]\r<br />Gives the player 50% health, stamina and magicka regeneration, in addition to reducing Shout cooldown by 20%. Healing spells are also 10% more powerful, which stacks with the similar Sailor&#39;s Repose perk.\r<br />The idea here is that it&#39;s replenishing your character&#39;s vital essence in every way, including all attributes and Shout cooldown, in addition to a small boost for healing magic. As a result, it&#39;s fun for the whole family. Every character can get some use out of this one.\r<br />\r<br />\r<br />- Night&#39;s Shadow, placed on Volkihar Enforcer Boots [can be placed on any item which can hold Fortify Stamina Regeneration enchantments]\r<br />When sneaking, the player becomes invisible. The spell breaks upon looting/interacting with anything, at which point going in and out of sneak or casting another invisibility spell may be necessary. Similar to Nightingale Shadow except the effect is constant.\r<br />Also grants Waterwalking and 100% Muffle effect. The Waterwalking effect will not engage if you are already swimming, which resolves a tiny glitch that can happen otherwise.\r<br />An all-in-one enchantment for stealth and evasion, providing the player with the means to move silently and invisibly, as well as move across water for the sake of convenience. You should find this a nice compliment to your own sneaking abilities, whether you&#39;re a warrior who wants to be a little quieter or an accomplished assassin who finds constantly recasting Invisibility to be tedious.\r<br />\r<br />\r<br />- Night&#39;s Talon, placed on Volkihar Enforcer Gauntlets [can be placed on any item which can hold a Fortify One-Handed enchantment]\r<br />Doubles sneak attack damage. Similar to the Backstab effect from the Shrouded Armor gauntlets, but with the stipulation for one-handed weaponry removed so it works for Archery, Two-Handed, and Unarmed as well. Extremely useful for bows/crossbows [if you have the right perks], not so much for Two-Handed weapons or Unarmed combat.\r<br />Since sneak damage doesn&#39;t apply to spells [it&#39;s come to my attention that there are several mods rectifying this problem], Night&#39;s Talon also grants a 10% magnitude bonus to Destruction spells [damage, not spell cost], which should help make this enchantment more appealing to mage builds.\r<br />Also grants +15 points of extra damage to Unarmed strikes.\r<br />This is intended to be somewhat of a &#34;Swiss Army Knife&#34; enchantment for gloves/gauntlets, increasing your overall damage in several ways but allowing you the freedom of using your own Fortify Skill enchantments or Smithing skills to decide how you implement it.\r<br />\r<br />\r<br />- Night&#39;s Boon, placed on Volkihar Enforcer Helmet [can be placed on any item which can hold Fortify Magic Skill enchantments]\r<br />Based on the Konahrik mask enchantment, if the player has low health there is a small chance to trigger a unique 300 point healing spell, a poisonous Shadow Cloak like that of the Ebony Mail which lasts a short time [12 seconds], and summon a &#34;Corrupted Dragon Priest&#34;.\r<br />Also grants waterbreathing and a 20% shout time reduction.\r<br />The Corrupted Priest is essentially a standard Dragon Priest that looks aesthetically like Malkoran&#39;s Shade from the Meridia quest, with his own set of unique spells. He will also count against your summon limit so he has a summoning spell of his own. He casts Lurker-style poison spells [non-elemental, damages everything, also leaves tentacle hazards lying around to inhibit enemy movement], a non-elemental Shadow Cloak [does 10hps of damage], a specialized version of Ebonyflesh, Greater Ward, Command Daedra, Dread Zombie, and he can summon a Corrupted Shade.\r<br />The Corrupted Shade wields a Bound Bow and knows the Marked For Death shout. \r<br />If you thought Konahrik was cool but could have used a constant-effect use like a waterbreathing effect to round it out, or want something that will help increase the overall survivability and usefulness of your followers, you might like this.\r<br />\r<br />\r<br />- Night&#39;s Ward, placed on Volkihar Enforcer Shield [can be placed on any item which can hold Fortify Block enchantments]\r<br />This enchantment produces a 100 point ward spell while blocking, stronger than Spellbreaker but not wholly unbalanced. The Ward is invisible, think of it like the cloak spell is what&#39;s blocking the magic.\r<br />It also surrounds the player in a shadow cloak like the Ebony Mail&#39;s while blocking, which does 10 points of non-elemental magical damage to opponents in range. This effect can be used in tandem with the armor&#39;s cloak or any cloak spells the player decides to acast in addition.\r<br />Bashing attacks absorb 15 points of health, magicka, and stamina, similar to the weapon effect.\r<br />This enchantment works beautifully with Revenge of the Enemies and DUEL: Combat Realism, and when placed on a ring works remarkably well with two-handed weapons, a single one-handed weapon, or one of the various mods that allows you to block while dual-wielding. \r<br />\r<br />\r<br />- Night&#39;s Hunger, placed on Volkihar Enforcer Shield of Hunger [can be placed on any item which can hold a Fortify Block enchantment]\r<br />Absorb 15 points of health, magic, and stamina with bash attacks.\r<br />Consider this an optional buff for Night&#39;s Ward, or a lighter version if you didn&#39;t like the cloak spell.\r<br />\r<br />\r<br />How to get the enchantments:\r<br />\r<br />\r<br />The enchantments are placed on a suit of armor, some jewelry, and a battleaxe. You must disenchant them to get the enchantments.\r<br />The items have been added to the inventory of the hidden Reaper boss, found in the Reaper&#39;s Lair area of the Soul Cairn. You must kill him to obtain them. If you don&#39;t know how to find him, numerous walkthroughs are available online.\r<br />In the event you&#39;ve already killed him, or can&#39;t get to the Soul Cairn for whatever reason, you can still give yourself the items via console by looking for the &#34;Volkihar Enforcer&#34; armor pieces listed above, and the &#34;Reaper&#39;s Axe&#34;.\r<br />\r<br />\r<br />\r<br />Known bugs/issues:\r<br />The cloak effects from the Night&#39;s Protection, Night&#39;s Boon, and Night&#39;s Ward enchantments might damage allies [like during the Civil War], but in most cases should work fine.\r<br />The summonings from Night&#39;s Boon will leave behind ash piles, but they should clean up automatically after a certain amount of time in-game so I wouldn&#39;t worry too much about it.\r<br />The Bat Cloak may fail to disengage properly when a brawl begins, so save first before fist-fighting with random NPC&#39;s. This hasn&#39;t happened during any of my testing though. I&#39;m only passing the warning on because I was told the method I used to disable the cloaks during brawls is imperfect. 99.9% of the time it should work without a problem, however. I can&#39;t say the same for brawls added by mods, so use a little common sense and save often.\r<br />The Paralysis effect on Night&#39;s Protection works in brawls, but doesn&#39;t count as a hostile action for whatever reason, and won&#39;t count as an assault. I don&#39;t really plan on changing that as I consider it a happy accident.\r<br />The explosion from Night&#39;s Vengeance may accidentally displace items in the immediate area, so try to be conscious of your surroundings when using it. It might also damage allies, but it shouldn&#39;t. It&#39;s set to damage hostiles exclusively. \r<br />\r<br />\r<br />\r<br />Requirements: Dawnguard DLC, Dragonborn DLC\r<br />\r<br />\r<br />If you enjoyed this mod remember to check out another project of mine, From the Ashes, a collection of enchantments thematically revolving around the now-extinct House Dagoth of Morrowind.\r<br />http://skyrim.nexusmods.com/mods/45652\r<br />\r<br />I&#39;ve also recently added a collection of good-guy themed enchantments for people who might not like these:\r<br />http://skyrim.nexusmods.com/mods/47988\r<br />\r<br />I also have a simple retexture of the vanilla Dragonbone weapons from Dawnguard if you&#39;re interested.\r<br />http://skyrim.nexusmods.com/mods/31430\r<br />\r<br />I&#39;ve also done an overhaul for Serana\r<br />http://www.nexusmods.com/skyrim/mods/49465\r<br />\r<br />\r<br />\r<br />\r<br />Use: Feel free to use these in your own mods, or modify them in any way you see fit. I simply ask that you give me some credit, as creating and testing these turned into an exhaustive process. \r<br /> [youtube]ky9JpsKIOVg[/youtube]",
  "categoryId": "75",
  "version": "2.3",
  "author": "xunderxdosedx",
  "createdUnix": "1377808704",
  "updatedUnix": "1387340605",
  "containsAdultContent": false,
  "uploadedBy": "xunderxdosedx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000050673",
      "name": "Black Against Night 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Black Against Night - Enchantments for the Discerning Adventurer-41255-1-0.zip",
      "uploadedUnix": "1377808700",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a575ef4d589a5b8c9968b28d0d157c444927d7714c367a46a43343734ba2a5f4/analysis/1407701464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Against%20Night%20-%20Enchantments%20for%20the%20Discerning%20Adventurer-41255-1-0.zip?fid=1000050673&ttl=1535822005&ri=8192&rs=8192&setec=eb597da1bca4b0695f813fae211819f1"
    },
    {
      "fileId": "1000051885",
      "name": "Black Against Night 1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Black Against Night 1-1-41255-1-1.zip",
      "uploadedUnix": "1378176890",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/37aac6915c3acd7922c1d53059e9c180bc528d30a845ccfbdb4e06e84627b54f/analysis/1407707103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Against%20Night%201-1-41255-1-1.zip?fid=1000051885&ttl=1535822005&ri=8192&rs=8192&setec=1f5d3be55425aa902c38caaf17ee5b21"
    },
    {
      "fileId": "1000062885",
      "name": "Black Against Night 2-0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Black Against Night - Enchantments for the Discerning Adventurer version 2-0-41255-2-0.zip",
      "uploadedUnix": "1381145138",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/4373b7305d97adbb43c178ed44291a8aadfca6dd5a6c1a4d7d57726c0b19504b/analysis/1407748570/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Against%20Night%20-%20Enchantments%20for%20the%20Discerning%20Adventurer%20version%202-0-41255-2-0.zip?fid=1000062885&ttl=1535822005&ri=8192&rs=8192&setec=47891e703c4c33191cd49ff22a81a9e7"
    },
    {
      "fileId": "1000071659",
      "name": "Black Against Night 2-1",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Black Against Night 2-1-41255-2-1.zip",
      "uploadedUnix": "1382927929",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/d084310d1c5a297542c949024182d382f67c556499e5d812f1bd3bbcd074aaaa/analysis/1407772343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Against%20Night%202-1-41255-2-1.zip?fid=1000071659&ttl=1535822006&ri=8192&rs=8192&setec=9e35091970a175cf96118f290275fe13"
    },
    {
      "fileId": "1000085204",
      "name": "Black Against Night 2-2",
      "version": "2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "Black Against Night 2-2-41255-2-2.zip",
      "uploadedUnix": "1386031631",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/6f1c199257c599f94da2cd49ad51cd795fa8c2a9b94597cbfe1da2679eeacc92/analysis/1407817775/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Against%20Night%202-2-41255-2-2.zip?fid=1000085204&ttl=1535822006&ri=8192&rs=8192&setec=df19dc60627695242d3b8f6eacbced4f"
    },
    {
      "fileId": "1000087223",
      "name": "Black Against Night 2-3",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Black Against Night 2-3-41255-2-3.zip",
      "uploadedUnix": "1387340605",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/2ef8503b8bf6e51278f65cb24f00178b3ec5de62cdf932314b0894e305cec80b/analysis/1407847322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Against%20Night%202-3-41255-2-3.zip?fid=1000087223&ttl=1535822007&ri=8192&rs=8192&setec=d6066a40e9b3bab2fb59af9fd061625c"
    }
  ]
}