{
  "modId": 41279.0,
  "modName": "Transportato Real Time Ships n Trains",
  "summary": "Adds ships and more that travel across Skyrim in real time, improving your immersion experience a billionfold&#33;",
  "descriptionHtml": "DISCLAIMER: I did get permission to upload this mod from Trainwiz himself because we&#39;re butt buddies.\r<br />\r<br />[youtube]2kip-F7gT4Y[/youtube]\r<br />\r<br />DESCRIPTION\r<br />_____________________________________________________________________\r<br />You ever find it strange that despite all these boats and trains sitting in harbors and stuff around Skyrim, that you never see any of them actually out and about?\r<br />I mean, I understand that nords aren&#39;t the smartest or most civilized people, but there should still be *some* semblance of trade going on.\r<br />This mod attempts to rectify that, and add a level of immersion in Skyrim not seen since the days of ole. As you travel along the coast, occasionally you will see ships sailing along from port to port, trading their wares and waring their trades. In the high mountains, you will see the occasional glimpse and the fornlorn whistle of a dwemer train, its masters long dead but its cargo still fresh and ready to be shipped. Special trains and boats will also be found\r<br />Further more, if the player activates certain boats or trains, they will be able to board these, raid them, and take their cargo. However, you cannot physically ride either the boats or trains, this is not the goal of this mod.\r<br />\r<br />STARTING AND INSTALLING THE MOD\r<br />_____________________________________________________________________\r<br />After activating the mod, wait six hours in game for the scripts to start up, from there, the player can encounter ships every six hours in game-time along the following routes:\r<br />Dawnstar to Solitude (and Solitude to Dawnstar)\r<br />Solitude to the west border (and the west border to Solitude)\r<br />Windhelm to Solstheim (and Solstheim to Windhelm)\r<br />Windhelm to the North Border\r<br />Winterhold to the Wreck of the Pride of Tel Vos (ghost ship, only encountered from midnight to 2AM)\r<br />\r<br />Trains can be found near the following places, while the DOOM TRAIN appears between 12AM to 3AM on the tracks near Southfringe and Lost Tongue:\r<br />Dead Crone Rock\r<br />Dunkash Ya&#39;ll\r<br />Twilight Specolscrewiticantspellthis\r<br />Bloodlet Throne\r<br />South of Southfringe Sanctum, near the border gate. (It is possible to get on the tracks here.)\r<br />Arcwind Point\r<br />East of Lost Tongue Overlook, on the hill overlooking the burned-down cottage. (Also possible to get on the tracks here.)\r<br />Kagrenzel\r<br />\r<br />CONFLICTS and ISSUES\r<br />_____________________________________________________________________\r<br />As for CONFLICTS: The mod is compatible with Dawnstar Expanded and Solitude Docks District. In fact, it is technically compatible with almost all mods. *However* some mods may place objects in the paths of the ships. No errors will occur, but you might find it weird when a ship passes through a solid objects.\r<br />As previously stated, you&#39;re not meant ride the ships in real time. Hopping on top of them will have you encounter some rather unusual collision issues, these are expected, and not considered an error, more like you ignoring what I just told you.\r<br />On the subject of raiding ships: Be aware that the sailors and cargo on board respawn normally, so it&#39;s best to raid a ship every 73 hours, to avoid wandering into a ship full of dead people.\r<br />On the subject being hit by a train: It won&#39;t kill you. Sorry.\r<br />\r<br />CREDITS\r<br />_____________________________________________________________________\r<br />To DeepSpaceBass, for routing things.\r<br />To Haishao and Bagserk, for help with the models.\r<br />To Guardly, Fuma, and Arurun, for help with testing.\r<br />To Fyuri, for lending his voice to the doom train.\r<br />To Prometheus, for the unfolded ship sails.\r<br />To Guardly again for making the trailer video.",
  "categoryId": "78",
  "version": "2.0",
  "author": "Traniwz",
  "createdUnix": "1377835737",
  "updatedUnix": "1377835733",
  "containsAdultContent": false,
  "uploadedBy": "Guardly",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000050737",
      "name": "Transportato 2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35288",
      "fileName": "Transportato 2-41279-2-0.rar",
      "uploadedUnix": "1377835733",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/f6a9e3194529a2e30aa0b9516c75c24dba06c5e08d7e86b2b5c8bd34203b1016/analysis/1407701870/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Transportato%202-41279-2-0.rar?fid=1000050737&ttl=1535822035&ri=8192&rs=8192&setec=cdabd9027a63e07d1ecca1ac05efbcb3"
    }
  ]
}