{
  "modId": 41280.0,
  "modName": "Handbag Addicts",
  "summary": "Handbags, umbrellas, and briefcases that are wield-able as shields or melee weapons. Also includes a small flower basket, sun hat, magnifying glass, tesla coil (yes&#33;), ghost hunter staff, and other misc items.",
  "descriptionHtml": "*** Version 1.4 ***\r<br />\r<br />Adds a sun hat in four colors: black, blue, pink, and white.  This best fits a &#34;flat&#34; hair-style, so if you have &#34;poofy&#34; hair, it&#39;s going to clip.  You can however (if technically inclined) adjust the hat position using NifSkope (see image section for what node/setting specifically needs to be altered).  The hair style in particular I tailored the hat position for was from ApachiiSkyHair #20 from v1.4 [http://www.nexusmods.com/skyrim/mods/10168]--also available in the Apachii SkyHair Wigs [http://www.nexusmods.com/skyrim/mods/43673].  Any hair/wig that lies flat, though, should be fine.\r<br />\r<br />\r<br />*** Version 1.3 ***\r<br />\r<br />-- WHAT&#39;S NEW --\r<br />\r<br />This update includes a new handbag (finally), as well as many other items I associate with an &#34;inspector&#34; theme: trowel, soul cell battery, ghost hunter staff, and a tesla coil (yes&#33;).  They can all be created at the forge (see below for category).\r<br />\r<br />You could say this has become a 2-in-1 mod with the handbags and the inspector tools.  I had at one time planned a separate &#34;Inspector&#39;s Kit&#34; mod, but I didn&#39;t have what I felt was enough to justify a separate mod (I know for me, I already have way too many mods activated).  And so piece by piece the inspector theme worked its way into this mod.  Hopefully you&#39;ll forgive me. ^^&#39;&#39;&#39;\r<br />\r<br />And as always, an extra save is recommended before you install the latest version.\r<br />\r<br />\r<br />[NEW ITEMS]\r<br />. Handbag V2 [hide] - Wield as shield or axe.  Variants include: blue, green, dark green, leather, and pink.\r<br />. Trowel [iron] - A tool to go with the magnifying glass (included in last update).  I felt that it looked odd to not have something in the right hand to go with the magnifying glass, so I created this in two variants: dagger and axe wield type.\r<br />. Soul Cell Battery [misc] - A soul gem that resembles a battery.  It is reusable, and should work like a black soul gem.  I created this specifically to go with the tesla coil also included in the mod update.\r<br />. Ghost Hunter staff [misc] - A last minute addition, which I felt would complement the soul cell battery--as a way to &#34;recharge.&#34;  There is a soul trap version, as well as an icy spike and flames versions.  In addition I included a 2-handed melee version (great sword wield); you may wish to change the &#34;weapon adjust&#34; for custom armors if you find it sitting too close on the back (this is done with the CK for the &#34;armorAddon.&#34; A value of .50 works well).\r<br />. Tesla Coil [iron/misc] - What adventurous inspector doesn&#39;t need a tesla coil to brave a hostile environment?  The original idea I had was a Colt .45 revolver.  So how did I arrive at a tesla coil?  There are already gun mods.  So I thought why not a cattle prod instead? Hey, that&#39;s a perfectly logical progression of thought&#33;  Err...  Anyway, I thought a cattle prod was too mundane and simple.  I wanted something bigger and more bodacious.  And thus the tesla coil concept was born.  *trumpets blare*  There are three staff variants of the tesla coil: sparks, chain lightning, and wall of lightning.  In addition there is a one-handed melee version (wield as axe) that is intended more for posing/3rd person use (it will take up a significant portion of 1st person perspective); I did this so you could have the tesla coil in-game without the FX lighting.\r<br />\r<br />So . . . something for everyone? =P  Enjoy&#33;\r<br />\r<br />\r<br />*** Version 1.2 ***\r<br />\r<br />-- WHAT&#39;S NEW --\r<br />\r<br />The addition of a magnifying glass.  I had always wanted to create one to go along with an &#34;Investigator&#39;s Kit,&#34; concept.  But I never could get the refraction to work, and also I never fully got the inspiration or enough ideas to create an investigator&#39;s kit.  Then I saw a refracting glass armor mod: http://skyrim.nexusmods.com/mods/29123, and decided to try again.  I managed to get refraction working after taking a &#34;peek&#34; inside one of the NIFs from that mod, and thus could make the magnifying glass.  And since I had already created a couple items I felt followed the investigator theme to this mod (umbrella and briefcase), I decided to add it here.\r<br />\r<br />You can forge this from the hide category (even though I&#39;m using metal and a soul gem to craft).\r<br />\r<br />The lens is a bit exaggerated (bulging out--not even visible unless looking from the side), but it provided a better/smoother refraction effect over the flatter alternative I tried.  You may want to put a dagger or some tool/accessory in your right hand, so when you are walking around in third person and the magnifying glass is raised, it looks more &#34;detective-like.&#34; ;)\r<br />\r<br />The next update should be an actual handbag. *gasps*  I have one about half done, but I&#39;m taking my time on it so it doesn&#39;t turn into %&#036;#@ like my previous attempt . . .\r<br />\r<br />*** Version 1.1 ***\r<br />\r<br />-- WHAT&#39;S NEW --\r<br />\r<br />The &#34;much anticipated,&#34; AKA &#34;much dreaded&#34; by the lore-friendly, update to Handbag Addicts has arrived--and ironically so without an actual handbag. . . .  I had crafted a new bag, but it turned out so hideous that I decided against including it; in fact I spent a great deal of time on it--mostly trying to make it look presentable.  Alas, I failed.  The more I tried to improve it, the worse it got; that included the polygon count, which I had kept impressively low on the original model thanks to the use of NURBs.  \r<br />\r<br />But a little voice, which sounded suspiciously like Tim Gunn, told me that if I had to embellish it THAT much, it was probably a bad design to start with.  It was.  No doubt if I ever run for public office someone will leak photos of it in order to shame me. =P\r<br />\r<br />And if that&#39;s not enough to keep the hordes of disappointed handbag addicts at bay, with their chants of &#34;Handbag&#33; Handbag&#33; We want a new handbag&#33;&#34;  I may be forced to resort to extreme countermeasures.  *cues up Crayon Pop&#39;s &#34;Bar Bar Bar&#34; MV*  Don&#39;t make me hit play&#33;  I&#39;ll do it, I swear&#33; =P\r<br />\r<br />All of these are found with a &#34;Handbag -&#34; prefix, so you won&#39;t confuse my mod with any other umbrella or briefcase mod.  It could happen&#33; Someday . . .\r<br />\r<br />\r<br />[WHAT IS INCLUDED]\r<br />. One-handed umbrella (closed) weapons, in blue, black, and pink (to match the lore-offensive pink Hello Kitty handbag).\r<br />. A small flower basket, wieldable as a shield.  This is based on the one I included in my last Aerith Staff&#39;s update, only with a slight retexture (lighter color for the basket weave).  If you&#39;re disappointed there isn&#39;t the weaponized version, then go DL my Aerith mod you big baby&#33; err... I mean nice, kind potential user of my mod. =P\r<br />. And finally a brown briefcase (shield or 1H weapon) that has two custom versions. The two custom versions basically have an art decal on the top of the briefcase.  I didn&#39;t include a template to DL for that, since it&#39;s just a square texture without any tricky UV mapping.  Just replace custom01 or custom02 .dds in the handbagAddicts folder, and you&#39;ll be all set (knowledge of graphic editing and DDS creation required).\r<br />\r<br />[ACKNOWLEDGEMENTS -- NEW]\r<br />. One of the custom images is from Darkside Blues (a Japanese anime movie).\r<br />. The other custom art is a composite I created from various free clip art sites I found via a Google image search.\r<br />\r<br />** Handbag Addicts - Version 1.0 **\r<br />\r<br />-- ABOUT --\r<br />Due to overwhelming *ahem* public support . . .  In other words, &#34;It was done.  What the heck?&#34; =P\r<br />\r<br />This is intended as much as a prop as a useable item.  You can use them in combat as either a shield or one-handed weapon, but the weapon version will look a bit odd when sheathed (sitting sideways on the hip).  A fortify carry weight (250 points) enchantment is applied to all shield versions of the handbags--you know since you have that extra storage available to you. =P\r<br />\r<br />You can get these either by crafting at a forge, or using the omnipotent power of the command console.\r<br />\r<br />-- WHAT&#39;S INCLUDED --\r<br />\r<br />[Green HK] - Green Hello Kitty handbag (wielded as shield). Fortifies carry weight  by 250 points. \r<br />[Leather] - Brown leather handbag (wielded as shield). Fortifies carry weight  by 250 points.\r<br />[Pink HK] - Pink Hello Kitty handbag (wielded as shield). Fortifies carry weight  by 250 points.\r<br />[Plaid] - Plaid handbag (wielded as shield). Fortifies carry weight  by 250 points.\r<br />[Black Leather] - Black leather handbag (wielded as shield). Fortifies carry weight  by 250 points.\r<br />[Bamboo] - Bamboo handbag (wielded as shield). Fortifies carry weight  by 250 points.\r<br />[Metallic] - Metallic handbag (wielded as shield). Fortifies carry weight  by 250 points.\r<br />\r<br />[Leather 1H] - Leather handbag (wielded as one-handed axe).\r<br />[Pink HK 1H] - Pink Hello Kitty handbag (wielded as one-handed axe).\r<br />\r<br />-- KNOWN ISSUES --\r<br />Does this really matter with something so *ahem* lore-challenged? =P\r<br />\r<br />Firstly the Hello Kitty versions are a bit nutso on the poly count, so unless you REALLY like HK, you may wish to skip those two.  But the main thing to note is the non-standard way the 1H handbag weapon will sit on the hip when sheathed.  Blame Bethesda for not incorporating proper handbag placement when not being used in the combat stance.  =P\r<br />\r<br />-- ACKNOWLEDGEMENTS --\r<br />. Sanrio for creating Hello Kitty.  \r<br />. Bamboo texture [img1349904921.jpg]: http://bgfons.com/download/1599\r<br />. Mr Dave as always for his Texture Resource: http://skyrim.nexusmods.com/mods/2324\r<br />. SpectralDragon&#39;s Waterstone Manor (for screen shot location): http://skyrim.nexusmods.com/mods/37631\r<br />\r<br />\r<br />-- POTENTIAL LORE TIE-IN --\r<br />\r<br />[just a joke, lore-minded folks&#33;]\r<br />\r<br />Brave men and women fought on opposing sides of the law--as much a gray area as it often was in the untamed lands of Skyrim.  General Tullius, ever growing weary of unabashed bandits and persistent rebel Stormcloaks, decided to unleash the greatest weapon ever conceived: The &#34;fearsome&#34; pink Hello Kitty handbag.\r<br />\r<br />To an outsider, that may seem the most ridiculous of armaments, until you consider the shame it brought to all those defeated by the genki neko.  For who would want inscribed on their tombstone: Death by Hello Kitty handbag?  No sentient human.\r<br />\r<br />And so the tide against the outlaws finally seemed to be tipping in the Empire&#39;s favor.  But it was only a partial victory.  Many other (non-human) forces of evil in Skyrim could care less if they perished by the sharp blade of a great sword, or the dreaded Hello Kitty handbag.\r<br />\r<br />But in an age of chaos, any glimmer of hope was welcome.  So choose your side.  Your armament.  And ask yourself: what do I want engraved on my foes tombstones?  I choose, &#34;Death by hello kitty handbag.&#34;  Besides, what could be more handy to carry all those coins and gemstones you find along your adventures?",
  "categoryId": "36",
  "version": "1.4",
  "author": "Denki Groove",
  "createdUnix": "1377836406",
  "updatedUnix": "1402106527",
  "containsAdultContent": false,
  "uploadedBy": "denkigroove",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000062789",
      "name": "Handbag Addicts V1-3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28035",
      "fileName": "Handbag Addicts V1-3-41280-1-3.zip",
      "uploadedUnix": "1381115677",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/57c5fc55046a2a801681d973e2a6ba59c403c9a960183d0abab80578af2dd024/analysis/1407748376/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Handbag%20Addicts%20V1-3-41280-1-3.zip?fid=1000062789&ttl=1535822036&ri=8192&rs=8192&setec=2da05594132c66d64bbfadf5b704af52"
    },
    {
      "fileId": "1000112062",
      "name": "Handbag Addicts V1-4",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38392",
      "fileName": "Handbag Addicts V1-4-41280-1-4.zip",
      "uploadedUnix": "1402106527",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/e15da9b79a22b9491b52f98a2b544f60fc0ce44368c159f182f3228e14543542/analysis/1408115675/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Handbag%20Addicts%20V1-4-41280-1-4.zip?fid=1000112062&ttl=1535822036&ri=8192&rs=8192&setec=5fd77076529f9f8ff35dcfc6df0c3a33"
    }
  ]
}