{
  "modId": 41291.0,
  "modName": "Undeath DV - Das untote Leben",
  "summary": "Das ist die deutsche Übersetzung der Mod \\\"Undeath\\\" von Antioch08 in der Version 1.0.0\r\nDAWNGUARD UND DRAGONBORN werden benötigt!",
  "descriptionHtml": "Skyrim - Undeath DV: Das untote Leben  \r\n\r\nvon Antioch08, DV von Stefanu\r\nOriginal hier: http://skyrim.nexusmods.com/mods/40607/\r\n\r\n\r\nDie Geschichte\r\n\r\n\r\nWenn ein mächtiger Totenbeschwörer und seine Anhänger nach den verbotenen Geheimnissen der Unsterblichkeit suchen, welche Himmelsrand bedrohen könnten, werdet Ihr ihn dann bezwingen, um sein böses Unterfangen zu beenden oder es selbst fortführen?  \r\n\r\nEntdeckt eine kleine neue Questreihe, die Euch auf der Jagd nach einem mächtigen Totenbeschwörer und seinen Anhängern zu den eisigen Gipfeln der Drachenschwanzberge und darüber hinaus führen wird, während Ihr deren Pläne, mächtige Artefakte und Zutaten für ein unheiliges Ritual zu erlangen, vereitelt. Was Ihr aber mit diesen Zutaten und dem verbotenen Wissen anstellen wollt, liegt ganz bei Euch... \r\n\r\n\r\nInhalt\r\n\r\n\r\nAktuelle Version: 1.3\r\n\r\n\r\n\\\"Skyrim - Undeath DV: Das untote Leben\\\" ist eine Erweiterung für TESV: Skyrim, die dem Spieler die Möglichkeit gibt, im Verlauf einer langen und mühsamen Reise des Forschens und Lernens ein schrecklicher und zerstörerischer untoter Lich zu werden. \\\"Undeath\\\" fügt außerdem eine Menge von Inhalten rund um das Thema \\\"Totenbeschwörung\\\" hinzu, alte als auch neue, die in keinster Weise die schon existierenden Perks verändern. \r\n\r\nUm spielen zu können, werden die Add-Ons Dawnguard UND Dragonborn benötigt. \r\n\r\n•Undeath-Questfolge: Ein komplette Questfolge erlaubt dem Spieler, die Bestandteile zu finden und zu erhalten, die für das Ritual des untoten Lebens benötigt werden.  \r\n•3 neue Dungeons: Taucht ein in das Netzwerk der Abwasserkanäle unter Einsamkeit, der Hauptstadt Himmelsrands und vernichtet dessen unziemlichen Bewohner. Erkundet Hermaeus Moras daedrisches Reich in Oblivion auf der Suche nach dunklen und verborgenen Mysterien und kehrt in das Geißelgrab in den aus TES: Daggerfall bekannten Drachenschwanzbergen zurück samt seinem berüchtigten Netzwerk aus Krypten, das dem Wurmkönig und seiner sinistren Gefolgschaft einst Zuflucht bot. \r\n•2 Totenbeschwörer-Zufluchten: Macht Euch zwei neue geeignete und verlassene Zufluchten für Totenbeschwörer und dunkle Charaktere zu eigen und baut sie nach Eurem Ermessen aus. \r\n•Ein neuer Händler: Findet den mysteriösen \\\"Mittler\\\" und handelt mit ihm um Gifte, Schwarze Seelensteine, Fleisch und Herzen. Er stellt Materialien zur Verfügung, an die sie andere Händler nicht heranwagen! \r\n•Schatten des Wiedergängers: Beweist Eure Hingabe an die Schwarzen Künste, indem Ihr dem vergessenen Oberherrn der Totenbeschwörung große Seelensteine auf seinen Altären darbringt. Ruft dunkle Magie an, um zum eigenen Gebrauch große und mächtige Seelensteine in schwarze zu verwandeln!\r\n•Giftzauber: Eine Reihe von wirkungsvollen Gift- und Zersetzungszaubern, wie sie zum Arsenal eines Schwarzmagiers passen, wurde den entsprechenden Händlern in Himmelsrand hinzugefügt. \r\n•Dunkler Pakt: Große Macht liegt im Blutvergießen. Bringt selbst an bestimmten Altären ein Opfer dar und erhaltet die Macht, bis zu fünf wiederbelebte Kreaturen gleichzeitig zu beherrschen. \r\n•Importierte Bücher: Eine Reihe von nekromantischen Überlieferungen, neuen und alten, wurde aus vergangenen TES-Titeln eingeführt. \r\n\r\n\r\n\r\nWas im kommenden Update folgen wird!\r\n\r\n•Eigener Soundtrack: Ein komplett eigener Soundtrack für alle neuen Bereiche wurde von León van der Stadt komponiert.\r\n•Vertonte NPCs: Ein komplett vertonter neuer Händler und vielleicht noch mehr!\r\n\r\n\r\n\r\nÜber \\\"Undeath\\\"\r\n\r\n\r\nSkyrim - Undeath ist mein Versuch (unter vielen anderen in der Modding-Geschichte Skyrims), eine eindringliche Mod zum Thema Lich-Sein für The Elder Scrolls V: Skyrim zu erschaffen. In Verlauf der Questreihe wird der Spieler einen mächtigen Totenbeschwörer und seine Anhänger aufspüren und aufhalten, die nach den verlorenen Geheimnissen dieser häretischen Verwandlung suchen und dafür sorgen, dass sie verborgen bleiben... oder sie sich selbst aneignen. Diese Mod benötigt SOWOHL Dawnguard ALS AUCH Dragonborn.\r\n \r\nEs war dies ein persönliches Projekt, mit dem ich vor einer Weile begonnen hatte und ich habe daran bei jeder Gelegenheit über sehr lange Zeit hinweg gearbeitet. Die Fähigkeit eines Charakters, die Sterblichkeit zu überwinden und ein untoter unsterblicher Lich zu werden, war immer schon eine Idee, die mich faszinierte und erregte, aber sie in Skyrim Wirklichkeit werden zu lassen, war viel Arbeit. \r\n \r\nIn vieler Hinsicht fühlte sich der Vorgang, Skyrim so zu modifizieren, dass der Spieler ein Lich werden kann, wie der schwer zu fassende, geheime Prozess des Lich-Seins selbst an. Ich habe Totenbeschwörung und die Lore jahrelang erforscht und untersucht, um sie auf feinfühlige Art einzufügen und musste die esoterische Schwarze Kunst des Skriptens, Modellerstellens und Texturierens erlernen, um meine Absichten zu verwirklichen. Ich habe zu dieser Idee viele großartige Projekte voller Leidenschaft und guter Ideen kommen und gehen sehen, bei denen andere diesen Versuch unternahmen und aus Frustration oder Zeitmangel aufgaben. Aber durch Entschlossenheit, Ausdauer und viele Monate aberwitziger Experimente, die mich fast an den Rand des Wahnsinns brachten, habe ich mein Ziel schließlich beinahe erreicht.   \r\n\r\nBitte zu beachten, dass dies lediglich die Version 1.0.0 darstellt und bisher noch keine Kompatibilitätstests mit anderen Mods durchgeführt wurden! Bitte schickt mir eine PN bei größeren Problemen und ich werde mich bemühen, sie beim nächsten Update zu beheben. Installiert auf eigene Gefahr! \r\n\r\n\r\nFragen und Antworten\r\n\r\n\r\nF: Wie starte ich die erste Aufgabe?\r\nA: Die erste Aufgabe in \\\"Undeath - Untotes Leben\\\" wird automatisch starten, wenn du Level 30 oder höher erreicht hast.  \r\n\r\nF: Wie komme ich in die Abwasserkanäle von Einsamkeit?\r\nA: Die Kanäle haben Zugänge im Keller des Zwinkernden Skeevers, in der Bardenakademie und in Schloss Elend. Man findet auch Eingänge im Südosten und Nordosten der Stadt. \r\n\r\nF: Ich habe Antioch getötet, aber was soll ich jetzt machen?\r\nA: Alles genau erforschen und du stolperst vielleicht über das, wonach er suchte! Die gesammelten Gegenstände könnten sich vielleicht auch als nützlich erweisen... \r\n\r\nF: Ich habe den \\\"Weg der Transzendenz\\\" begonnen, aber wo soll ich jetzt hin?\r\nA: Benutze die Schnellreise in eine beliebige Stadt Himmelsrands und halte die Augen offen bezüglich einer Nachricht... \r\n\r\nF: Ich kann die Altäre der Totenbeschwörer nicht benutzen.  \r\nA: Die Altäre erfordern die höchste Verzauberungsfähigkeit, um sie zu benutzen. \r\n\r\nF: Wie passe ich die endgültige Erscheinung meiner Lichgestalt an? \r\nA: Die Gegenstände, die du im Verlauf der Questreihe sammelst, sind wichtig und werden Einfluss auf die letztliche Gestalt des Lichs haben. Vergewissere dich über ihre Bedeutung und wähle (oder erschaffe) solche, die sich in die gewünschte Endform fügen. Zum Beispiel: Gltzernde Gewänder in Einsamkeit ist eine Schneiderei, vielleicht haben sie etwas Farbstoff herumliegen...  \r\n\r\nF: Ich sterbe immer während des Lich-Rituals!\r\nA: Vergewissere dich, dass du die Notizen zum Ritual genau gelesen hast! Ein Lich zu werden ist ein komplexer Vorgang und eine einzige fehlende Komponente kann deinen Untergang heraufbeschwören. Du musst alle erforderlichen Gegenstände besitzen und das Ritual am richtigen Ort durchführen. Wenn während des Rituals deine Benutzeroberfläche verschwindet, hast du alles richtig gemacht. \r\n\r\nF: Ich führe das Ritual richtig aus, sterbe aber trotzdem ständig. \r\nA: Das scheint ein Problem mit der dir zur Verfügung stehenden Gesundheit zu sein. Vergewissere dich, dass du mehr als 100 Gesundheitspunkte hast, bevor du das Ritual beginnst, da es dich sowieso umbringen wird, wenn du zu schwach bist!\r\n\r\nF: Ich führe das Ritual korrekt durch, sterbe aber NICHT!\r\nA: Auch das ist ein Problem des Maßes deiner Gesundheit oder evtl. der Schwierigkeitseinstellungen (Da sie den Schaden entsprechend erhöhen oder verringern). Versuche durch den Gleichgewichtszauber oder ähnliches deine Gesundheit zu verringern, bevor du dich erneut an das Ritual wagst. \r\n\r\nF: Wie wechsle ich als Lich die Zaubersprüche?\r\nA: Drücke die Schleichtaste und nach einer kurzen Animation erscheint das Magiemenü.\r\n\r\nF: Das Magiemenu erscheint auch nach der Animation nicht...\r\nA: Das scheint von Rechner zu Rechner unterschiedlich zu sein, aber ich glaube, dass ein Skriptereignis nicht richtig registriert wird. Indem man sich in die menschliche Form verwandelt und dann wieder zurück in die Lichgestalt, sollte man das Problem lösen können. \r\n\r\nF: Wie wechsle ich in die menschliche Gestalt zurück?\r\nA: Drücke die Schrei/Kraft-Taste noch einmal, während du in der Lichgestalt bist, um dich zurück zu verwandeln. Beachte, dass es eine kurze Abkühlungsphase gibt, bevor du wieder in die Lichform wechseln kannst, also nutze sie mit Vorsicht. ",
  "categoryId": "35",
  "version": "1.3",
  "author": "Antioch08   DV von Stefanu",
  "createdUnix": "1377848098",
  "updatedUnix": "1380367611",
  "containsAdultContent": false,
  "uploadedBy": "Stefanu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000050755",
      "name": "Undeath DV- Das untote Leben",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91169",
      "fileName": "Undeath Dv- Das untote Leben-41291-1-0-0.7z",
      "uploadedUnix": "1377848000",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/141c7985b323b8360c5352148e495da02f8dc45204e397a50658243933b4a60a/analysis/1407701923/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Undeath%20Dv-%20Das%20untote%20Leben-41291-1-0-0.7z?fid=1000050755&ttl=1535822045&ri=8192&rs=8192&setec=e949b58bfa65f7aca75d973adafeabaa"
    },
    {
      "fileId": "1000059412",
      "name": "Undeath DV-Das untote Leben 1_3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "106351",
      "fileName": "Undeath DV 1_3-41291-1-3.7z",
      "uploadedUnix": "1380367611",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/877c0d77893e767a18d454eff55ab283d0e35832d94dd3d6aa008564d9249dd5/analysis/1407737842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Undeath%20DV%201_3-41291-1-3.7z?fid=1000059412&ttl=1535822045&ri=8192&rs=8192&setec=01d366ca2b5e1962c1a6d27b7b078662"
    }
  ]
}