{
  "modId": 41303.0,
  "modName": "The Hunted",
  "summary": "The Hunted - The first chapter in the Thuringen family saga. My first mod.",
  "descriptionHtml": "Wait. What are these Stormcloaks doing here? This is an abandoned Imperial Outpost. \r<br />\r<br />Who are these Thuringens? Are they some sort of Imperial spies? Why everyone seems to be hunting them?\r<br />\r<br />And why on Oblivion there are dead Thalmor soldiers here?\r<br />\r<br />---\r<br />[youtube]e7HgkiIGwyI[/youtube]\r<br />\r<br />The Hunted - The first chapter in the Thuringen family saga.\r<br />\r<br />This mod starts a new questline and adds a new quest called The Hunted to Skyrim. It adds 30 to 120 minutes of gameplay depending on your character&#39;s level and playing style. This mod does not require any other mods or DLC&#39;s nor does it alter any gameplay mechanics. \r<br />\r<br />I hope you try it out and - most of all - you enjoy the experience. All kinds of feedback is welcome, the more detailed the better. I would also very much appreciate if you would let me know what you liked and did not like in the mod. This is my first mod so suggestions to better the mod are more than welcome&#33; Especially if you note any bugs or random behaviour during the quest, please let me know. There are some &#39;known bugs&#39; and they are covered in the readme.txt.\r<br />\r<br />As the &#39;first chapter&#39; in the title indicates, The Hunted is meant to be the first chapter of a longer questline. The second one &#39;Thur&#39; is written but nothing concrete has been done in Creation Kit. I hope to finish &#39;Thur&#39; sometime during the winter. \r<br />\r<br />-----\r<br />Your character must be at least on level 15 before you can start the quest.\r<br />To start the quest cross the Dragonbridge from the north and head west along the river...\r<br />-----\r<br />\r<br />Special thanks to Bethesda for a great game and a great tool&#33;\r<br />Other tools I used were Audacity, Unfuzer, Ezvid and Windows Movies Maker.\r<br />\r<br />Last but not least thanks go to my wife for support and playtesting.\r<br />\r<br />Feel free to contact me via mail juri.surakka@gmail.com or via Twitter @jxs_marble. Or leave a comment below. \r<br />\r<br />Version 1.0 30082013\r<br />\r<br />Installation:\r<br />Download the Thuringen.7z archive and unpack it. It consist of three different files: Thuringen.bsa, Thuringen.esp and a new folder Seq with a file Thuringen.seq in it.\r<br />\r<br />Put the Thuringen.esp and Thuringen.bsa to the ...common/skyrim/data/ folder where all the esp- and bsa-files are. \r<br />Also put the Seq-folder to the same ...common/skyrim/data/\r<br />\r<br />omnijxs",
  "categoryId": "35",
  "version": "300813",
  "author": "omnijxs",
  "createdUnix": "1377869524",
  "updatedUnix": "1377869293",
  "containsAdultContent": false,
  "uploadedBy": "omnijxs",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000050798",
      "name": "Thuringen",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9404",
      "fileName": "Thuringen-41303-.7z",
      "uploadedUnix": "1377869293",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a1dcef19949b304015f48d7aa1c8b74f8a0b27799cac43671efd736f731df43c/analysis/1407702260/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thuringen-41303-.7z?fid=1000050798&ttl=1535822056&ri=8192&rs=8192&setec=73aca7d46c67a4e5379d1b86de02083b"
    }
  ]
}