{
  "modId": 41311.0,
  "modName": "Edward Teach AKA Blackbeard The Pirate",
  "summary": "as faithful a recreation of blackbeard as i could accomplish in the creation kit.",
  "descriptionHtml": "Requires Dawnguard.  Pictures above show Blackbeard aboard the Okaazah, available right here on nexus.  You won\\'t find a finer sailing vessel in all of Tamriel.  Has a travel system, and even has functional cannons!  http://skyrim.nexusmods.com/mods/16017/?\r\n\r\nComes equipped with everything you see in the screenshots. (except the ship of course) He dual wields with a Cutlass in one hand, and a flintlock pistol in the other.  The green woman you see next to him in one of the shots is my favorite Half Dryad-Elf character, Poison Ivy, whom I also want to turn into a follower someday.\r\n\r\nAllow me to introduce Edward Teach, more commonly known as Blackbeard The Pirate.  Blackbeard is probably the most famous pirate in history.  Ask anyone about a pirate, and they are either gonna say Captain Jack Sparrow, or Blackbeard.  Blackbeard has a much worse reputation than history really paints.  One thing about Blackbeard was that he would rather frighten someone to death than to resort to actual violence.  Not to say that violence was out of the question, but Blackbeard preferred intimidation.  One thing he was famous for doing was putting lit fuses in his cap during interrogations.  Lets just say he enjoyed messing with peoples\\' heads.  Another thing many people don\\'t know about Blackbeard is that he would generally only attack ships captained by his enemies.  This made him unpopular with the captains of the other ships he commanded.  Yes, Blackbeard commanded a fleet.  It was his practice to attack a ship, board her, and convince her captain to join his cause, probably through intimdation at first, until they were guilty of too many crimes to sail home.  \r\n\r\nBlackbeard also maintained a certain amount of loyalty to the crown.  He named his first captured vessel, the one he commanded himself, \\\"Queen Anne\\'s Revenge.\\\"  This is also made evident by the fact that at one point, he did try to go straight.  He was so determined to go straight, that he marooned around 25 members of his own crew prior to sailing to North Carolina for a pardon from the governor.  One of the other captains in his fleet rescued them a day or two later.  After recieving his pardon, Blackbeard settled down in Bath.  Unfortunately for him, the Governor of Virginia was not satisfied that Blackbeard had retired, and considered him too dangerous to allow to live. Governor Spotwood then sent Lieutenant Robert Maynard in command of two ships to kill Edward Teach.  Blackbeard\\'s head adorned the bow of Lieutenant Maynard\\'s vessel on his way back to Virginia.  Blackbeard was somewhere between 30 and 35 years old when he was killed.\r\n\r\n\r\nHe is not overpowered.  I left the weapons and the armor in the original state the authors had them in.  I didn\\'t make anything deadlier, or faster, or anything like that.  He is pleasant company.  Not whiny, but occasionally disgusted, and a bit grumpy.  I agonized over which voice to use.  On the one hand, I wanted him to sound British, but on the other hand, I wanted him to sound gruff.  Gruff won out, as the accented voice available for a male sounded too Australian for me, and also was not nearly as intimidating.  So, Edward Teach sports a MaleBrute voice.  Delvin Mallory\\'s voice would have been near perfect.  If anyone knows how to make something like that happen, please let me know.  Blackbeard is also a fence.  You can sell things you pick up to him for extra cash, thus reducing the need to carry things as well.\r\n\r\nHe can be found wandering the Riften marketplace in the afternoon.  I wait until between 1 and 2 pm, and he usually comes right in the main gate to Riften about then.  I may decide to park him in Dead Man\\'s Drink later.\r\n\r\nFair warning, he appears in the game as Edward Teach, not Blackbeard.  So if you say you can\\'t find him, first, you have to be blind to miss this guy, and second, you didn\\'t read the instructions...\r\n\r\nRecommended mods for use with this one.\r\n\r\nDual Wield For Followers - which will allow Blackbeard to swing a cutlass in one hand, and fire a flintlock with the other.\r\nhttp://skyrim.nexusmods.com/mods/13571/?\r\n\r\nFast Respawns and Rich Merchants - which will drastically increase the amount of things you can sell to Blackbeard, and make it happen every 24 hours of game time.  (simply wait or sleep 24 hours, and Blackbeard is loaded with money to buy things from you again, even stolen things.)\r\nskyrim.nexusmods.com/mods/15574/?\r\n\r\nFuture plans for Blackbeard include making him a trainer.  I have been trying to get him to be a trainer in several areas, with the permission of Elys, author of Yuri The Elder Trainer.\r\nhttp://skyrim.nexusmods.com/mods/36491/?\r\n\r\nIf i fail on that point, I will simply make him a trainer in Speechcraft, as that seems most appropriate for his character.  I may also look seriously into exporting, and importing Delvin Mallory\\'s dialogue, to see if i can piece something together that works for a follower.\r\n\r\n\r\n\r\nMy other mods\r\n\r\nAutomatic Crossbow Collection (overpowered)\r\nhttp://skyrim.nexusmods.com/mods/36766/?\r\n\r\nThe Agonizer (a pain stick, also overpowered, in an odd sort of way)\r\nhttp://skyrim.nexusmods.com/mods/38098/?\r\n\r\nCOHO - Children Of Honorhall Orphanage (adoptable child replacers, one for adopting 6 boys, and one for adopting six girls, each set with an adoptable vampire child.)\r\nhttp://skyrim.nexusmods.com/mods/41132/?\r\n\r\nComing very soon, like today or tomorrow - Hearthfires Female Housecarl Replacer.  Replaces the two male housecarls with pretty ladies, and gives Rayya a new look removing the scar and warpaint, and giving her actual redguard clothing.  All three ladies will be wearing Apachii SkyHair.\r\n\r\nI want to thank the very nice people who allowed me to use their awesome work to make this happen.  I am seriously grateful to all of them.\r\n\r\nShadowtigers - For Ren Wolf, from whom Blackbeard was born.  Blackbeard is a modified version of Ren Wolf.  If Shadowtigers had not allowed me to mess around with Ren Wolf, I would probably have never gotten into NPCs, which are now my favorite thing to work on.\r\nhttp://skyrim.nexusmods.com/mods/32864/?\r\n\r\nMikloud - For allowing me to use his flintlock pistols.\r\nhttp://skyrim.nexusmods.com/mods/8533/?\r\n\r\nHigeyosi - For allowing me to use his cutlass.\r\nhttp://skyrim.nexusmods.com/mods/23814/?\r\n\r\nhothtrooper44 - For allowing me to use his seadog armor.\r\nhttp://skyrim.nexusmods.com/mods/20911//?\r\n\r\nI have recently been informed that i inadvertently left someone out of the credits.  Credit for that fabulous hat goes to Mr. Dave, who says the original came from a mod called Bob\\'s Armory.  Mr. Dave has been kind enough to allow me to keep this file online if i give him the credit he is rightly due.  (i\\'ve had material stolen from me before, and someone else took credit for my work.  would not have been such a big deal to me except that someone messaged me, and accused me of being the plagiarist.  i certainly don\\'t blame Mr. Dave for wanting credit for his work.)  thank you very much Mr. Dave for allowing me to proceed instead of just reporting me.",
  "categoryId": "66",
  "version": "1.9.1",
  "author": "kar2nz",
  "createdUnix": "1377887139",
  "updatedUnix": "1379279461",
  "containsAdultContent": false,
  "uploadedBy": "kar2nz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000050850",
      "name": "Blackbeard",
      "version": ".8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21312",
      "fileName": "Blackbeard-41311--8.zip",
      "uploadedUnix": "1377886667",
      "modVersion": ".8",
      "virusScanUrl": "https://www.virustotal.com/file/aa12d67e6f0413e0f7bea8ff62760ee0073e5ff82a600276407cb6a078efa5cd/analysis/1407702435/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blackbeard-41311--8.zip?fid=1000050850&ttl=1535822062&ri=8192&rs=8192&setec=c7357b0754f5d11821d717d1d723cedb"
    },
    {
      "fileId": "1000055740",
      "name": "Half Dryad Elf Crossbow Patch",
      "version": "1.9.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "267",
      "fileName": "Half Dryad Elf Crossbow Patch-41311-1-9-1.7z",
      "uploadedUnix": "1379279461",
      "modVersion": "1.9.1",
      "virusScanUrl": "https://www.virustotal.com/file/fe76929c145d42fa8c8ba1cb5207a32151d543a8220fb9e2c59d9ed81d861f88/analysis/1407724341/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Half%20Dryad%20Elf%20Crossbow%20Patch-41311-1-9-1.7z?fid=1000055740&ttl=1535822062&ri=8192&rs=8192&setec=8b63ae3c542127678255eb2421b24952"
    }
  ]
}