{
  "modId": 41469.0,
  "modName": "Brimstone Manor",
  "summary": "a vampiric manor",
  "descriptionHtml": "Dawnguard DLC & Dragonborn DLC needed, this mod is stand alone besides that.\r<br />\r<br />i know i made eerie elegance which is a redo of Castle Volkihar so why did i make this mod?\r<br />well 1st of all i made this mod long before dawnguard was even a rumor, i just didnt like to post my mods back then. i did however clean up the file and added new things to it. the manor isnt like eerie elegance, meaning that its not dirty. the manor is kept pretty clean and neat. it has a classy elegance to it aswell though. \r<br />it has a master bedroom, a bed room right near it which i used to use for my child. there are also 4 smaller rooms which i used for maids and a cheif, however you can use them for whomever. the top floors are all of the bed rooms, as for the main floor there is the grandhall, a kitchen, a dinning room and a lab. there is a little hidden zone i guess you can say but its only to get around and to store stuff.\r<br />if people end up liking this mod i guess i&#39;ll do the lower level i was plaining too which is the locked door by the kitchen.\r<br />\r<br />the teleport to the manor is just infront of castle volkihar, like the good old days in morrowind where there are mage ports. so i opened a portol to my house just infront of my brotherns home.\r<br />i would place my manor in the real world if someone would make me 100% the right model for it but thats not going to happen.\r<br />\r<br />as for bugs, i havent found any. if you run into anything let me know and ill try to fix it.\r<br />\r<br />updated: the 1st time I left the house empty so everyone could do there own thing with the house I made,  but I guess most people didn&#39;t like that idea. so once I came back around to this house and filled it up a bit for my self I thought why not allow others to use it aswell. I changed the lighting to make it darker, I changed the décor around in the master bedroom as it was very crapy before. I also added suits of armor, gargoyles, paintings and so on around the house. I moved the cooking pot to the kitchen and made it look blood filled as this is a vampire themed home and vampires don&#39;t really eat much else. \r<br />anyway if you have problems or ideas let me know.\r<br />\r<br />Credits\r<br />oaristys - Modders Resource Pack\r<br />Stroti - Organ Resource\r<br />runspect - Resources for modders\r<br />Blary - Alchemy Clutter Resource\r<br />Artisanix - Paintings and Frames\r<br />Breti - New Buildings Modder&#39;s Resources\r<br />bond123 - draps & pillow\r<br />mjy - mjy castle mod\r<br />\r<br />anythning i didnt ask to use is a resources so that should be no problem and i dont think ive used anything from any other mods besides those, other clutter and such should be from the game it self unless im mistaken. some textures I made, you can use them if you want.",
  "categoryId": "67",
  "version": "",
  "author": "Jackalx137",
  "createdUnix": "1378074009",
  "updatedUnix": "1386615405",
  "containsAdultContent": true,
  "uploadedBy": "jackalx137",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000069424",
      "name": "Brimstone-Manor ",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34679",
      "fileName": "Brimstone-Manor -41469-.zip",
      "uploadedUnix": "1382486073",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/57f2e2b21484a545980a9a0e3a28c4ebb8977f959f62a121bb4c483bcbfc9134/analysis/1407765388/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brimstone-Manor%20-41469-.zip?fid=1000069424&ttl=1535822234&ri=8192&rs=8192&setec=4c6ea8c173efc3e052ff0ba0280de059"
    },
    {
      "fileId": "1000086059",
      "name": "Brimstone Manor update",
      "version": "",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "6811",
      "fileName": "Brimstone Manor update-41469-.zip",
      "uploadedUnix": "1386615405",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/853fbec9240525eaa825986b9b14e003c809c70692e9fa28b0643b5d39c72bd7/analysis/1407827828/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brimstone%20Manor%20update-41469-.zip?fid=1000086059&ttl=1535822234&ri=8192&rs=8192&setec=5524f592a22abc7daba701b27cc65d70"
    }
  ]
}