{
  "modId": 41465.0,
  "modName": "Somber Lut Sepia ENB and Grims Vintage Somber ENB",
  "summary": "Somber Lut Sepia aims at heavily creating a unique atmosphere in all over the Tamriel using IBL and other high-end effects.  Grims Vintage Somber aims for a cinematic vintage film look with vertical film flares, rounded corners, and rustic coloring.",
  "descriptionHtml": "This ENB has been disabled and is no longer supported.  It has moved to its new nexus home as the [url=http://www.nexusmods.com/skyrim/mods/50501/?]Grim and Somber ENBS[/url].  Thanks for all the support&#33;\r<br />\r<br />",
  "categoryId": "62",
  "version": "5.9",
  "author": "Tansarville and Wolfgrimdark",
  "createdUnix": "1378144872",
  "updatedUnix": "1381060801",
  "containsAdultContent": false,
  "uploadedBy": "Tansarville",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000062321",
      "name": "Somber ENB Lut Sepia Vanilla ENB 221 - Final Cut",
      "version": "3.4.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27958",
      "fileName": "Somber ENB Lut Sepia Vanilla ENB 221-41465-3-4-7.zip",
      "uploadedUnix": "1381060801",
      "modVersion": "3.4.7",
      "virusScanUrl": "https://www.virustotal.com/file/d2b2f7fb61fa529e9b3a65d379f3bec945a24e90a25786f6397097be241be9bb/analysis/1407747253/",
      "changelogHtml": " UPDATE 2013-10-6:\r<br />- Made a lot of organizational changes to the page and files. Uploaded the final cut version of Somber Lut Sepia for use with ENB Binary v221.\r<br />- The last stable version of the ENB Binaries by Boris is ENB v221. I have updated both Vanilla and ELFX versions of Somber Lut Sepia to work with v221 and released them as final cuts. These should be considered the best and official versions for now.\r<br />- Released a BETA version of the main (vanilla) version of Somber Lut Sepia that works with ENB 226. I will work on this as time permits but since there is no guarantee whether a particular ENB version will be available for download I consider it BETA and unsupported.\r<br />- I released final cut versions because I have to start working overtime at my real life job and don&#39;t wish to spend every Sunday updating to a constantly changing ENB. Version 221 is a great ENB and a good point to provide an official release. It doesn&#39;t mean I won&#39;t be updating again but probably not till there is another locked down version. However if I do work on a BETA version I will update it for those who wish to use it. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Somber%20ENB%20Lut%20Sepia%20Vanilla%20ENB%20221-41465-3-4-7.zip?fid=1000062321&ttl=1535822230&ri=8192&rs=8192&setec=a182a6a394daea40523f99e1d256e045"
    }
  ]
}