{
  "modId": 41468.0,
  "modName": "SkyHigh - Improved Content for High-Level Characters",
  "summary": "New and improved content for high level players! SkyHigh offers an improved experience for those wanting more out of their high level characters without unbalancing the gameplay. See description for more details.",
  "descriptionHtml": "Update: There will be a modular version of this mod coming out hopefully within the week. It will allow the player to choose which elements of the mod they wish to add into their game.\r\n\r\nNote: This mod is a work in progress, please feel free to offer any advice or additions you would like in the comments. If you like the mod and want to see it continue please help by endorsing it and sharing it with others. Thanks.\r\n\r\nFor troubleshooting or error reporting please feel free to leave a comment and I\\'ll try to get to it as soon as possible.\r\n\r\nWhat is SkyHigh?\r\n\r\nSkyHigh is a minor overhaul that aims to deliver a better and more balanced game experience for high level characters. I am constantly working to improve and add more content based on requests and advice, so please check back for more updates. The idea is to continue playing Skyrim with the subtle changes and additions improving your overall game experience. This overhaul will include changes and improvements for vanilla Skyrim as well as the Dawnguard and Dragonborn DLC.\r\n\r\nImprovements & Additions:\r\n\r\n- Removed enchantment from Thalmor robes so players can choose to enchant them as they please.\r\n- Added playable Greybeard gear to High Hrothgar unenchanted.\r\n- Added a Dragonpriest mask journal to the dead scholar with the wooden mask (thanks to whickus for his permission to use and modify it).\r\n- Restored the dragonpriest sanctuary to include treasures as well as a new summon dragonpriest spell.\r\n- Improved the final dragonpriest mask, Konahrik, to include a more worthy enchantment.\r\n- Daedric artifacts carry unlimited charge to make them more useful and rare.\r\n- Killable children (although you probably shouldn\\'t).\r\n- All merchants carry five times more gold to make trading easier for higher levels without breaking it.\r\n- Renovated and improved the Archmage\\'s quarters to make it into a full player home.\r\n- Renovated and improved the vampire lord Harkon\\'s chambers.\r\n- Added a new spell, Blood Strike, to Harkon with a spelltome found in the castle.\r\n- Added high value vampire rings found in the castle.\r\n- Improved Harkon\\'s armor and sword to make them more balanced at higher levels.\r\n- Miraak\\'s clothes are now all light armor that can be improved.\r\n- Unique and balanced enchant for Miraak\\'s mask and robes. Gloves and Boots are left unenchanted for player.\r\n- Improved Miraak\\'s sword and staff for increased balance.\r\n- Added crafting improvements for all unique items in game that were left out.\r\n- Increased the time of Dragon Aspect without overpowering.\r\n- Balanced the prices and power of these items to not break the game for my level 81 character, but still offer a reason to use them.\r\n- Vampire Lord can now fit through doors properly without sacrifice too much height like other mods (1.08 vs 1.025).\r\n\r\nWork-in-Progress additions:\r\n\r\n- Add a playable Psiijic Monk outfit that fits with the Skyrim lore (suggestions of where and how are welcome).\r\n- Add a secret cult of Konahrik followers who wish to revive him (already have a lore-friendly story ready).\r\n- add some forts with unique and powerful warlords who split from the rebellion.\r\n- improve reaper boss as well as offer reward item.\r\n- overhaul the main bosses in skyrim.\r\n- adjust the value of daedric artifacts to match player made weapons.\r\n- convert all the main guild hall into complete player homes.\r\n- add an elite thalmor guard set up to confront the dragonborn.\r\n- whatever else you guys want and feel will improve the game.\r\n\r\nChangelog:\r\n\r\nv1.01- minor fixes to a few misplaced items, stolen flags, and added tempering to wooden mask.\r\nv1.02- fixed vampire lord to maximum possible size while fitting through doors, minor fixes\r\n\r\nRequirements:\r\n\r\nThis is a overhaul for the complete official Skyrim game (excluding Hearthfire). It includes content from the entire game, therefore Dawnguard and Dragonborn are both needed for SkyHigh to work.\r\n\r\nInstallation:\r\n\r\nSimply place the \\\"SkyHigh - Improved Content.ESP\\\" in the data folder of the game installation folder then load it with BOSS or the default loader.\r\n\r\nUpdates or Uninstallation:\r\n\r\nIf you wish to update SkyHigh in the future or simply remove it, it should be as easy as simply deleting the ESP file in the data folder or replacing it with the updated file.\r\n\r\nWARNING: be sure to remove any items you may have from one of the new player homes (archmage quarters and harkon\\'s chamber) before removing or updating the mod (updating should be fine but wait for me to confirm).\r\n\r\nCompatibility:\r\n\r\nSkyHigh should be completely compatible with all the mods out there that don\\'t modify directly the locations or files listed. If there are any problems or requests, please feel free to leave a comment and I\\'ll try my best to address them.\r\n\r\nKnown bugs:\r\n\r\n- A common bug with the mannequin script may cause them to move slightly. This can be solved by equipping them armor (this seems to solve the issue), or sometimes leaving the room and re-entering.\r\n- The weapon racks in the Archmage quarters\\' entrance will only activate for weapons after removing the included spell tomes and re-entering the room.\r\n\r\nRecommended mods:\r\n\r\nAlternate Start\r\nBFT Ships and Carriages\r\nCloaks of Skyrim\r\nDaedric Lord Armor\r\nImmersive Armors and Weapons\r\nImproved Combat Sounds\r\niHUD\r\nDeadly Dragons\r\nEnhanced Blood\r\nRealistic Ragdoll Force\r\nRun for your lives + when vampires attack\r\nSkyUI\r\nSKSE\r\nSkyFalls\r\nUltimate Follower Overhaul\r\nUnofficial patches\r\nVampire Lord Royal",
  "categoryId": "79",
  "version": "1.02",
  "author": "Abuabdillah3",
  "createdUnix": "1378075149",
  "updatedUnix": "1378169727",
  "containsAdultContent": false,
  "uploadedBy": "abuabdillah3",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000051859",
      "name": "SkyHigh - Improved Content",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48",
      "fileName": "SkyHigh - Improved Content-41468-1-02.zip",
      "uploadedUnix": "1378169727",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/af5f660525880dfd95e89b0fb85a80394cedee3d1c3a1dcdaaa5db163c823ef2/analysis/1407706933/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyHigh%20-%20Improved%20Content-41468-1-02.zip?fid=1000051859&ttl=1535822232&ri=8192&rs=8192&setec=13d45afd3b621ae1cd3cb3f2bf44d13e"
    }
  ]
}