{
  "modId": 41494.0,
  "modName": "TMNT Expanded",
  "summary": "An expansion on Titan&#39;s TMNT mod.  You can find the original here - http://skyrim.nexusmods.com/mods/35105/?",
  "descriptionHtml": "First off, the orginal mod by Titan is REQUIRED for this to work.  This mod is based on version 8.1 of Titan&#39;s mod.  You can find the original here - http://skyrim.nexusmods.com/mods/35105/?\r<br />\r<br />What this mod does -\r<br />\r<br />Simply, it expands on the options for a Turtle Character in regards to armours (Shell) and helms (masks).  The orginal mod only has a single tier, equivalent to Dragonplate.  That wasn&#39;t very usefull to me as a level 1 toon.  So I have expanded this to well over a dozen.  There are light and heavy versions throughout the craftable tiers.  I even have one that is simple clothing for the Turtle mages out there&#33;  I focused primarily on armour that can 1. be crafted at the forge and 2. only sets that could use the matching armour perk, although I did include Imperial Light and Stormcloak for those into the civil war. This way I can wear gauntlets and boots and have a matching set.  All shells and masks have the same keywords as the armour they are replacing. \r<br />\r<br />How to obtain -\r<br />\r<br />Simple.  Either loot/buy/craft the armour you want to wear, then convert it into a Turtle part.  For instance, go to any forge or anvil and create the standard armour you want a shell/mask for.  For a shell make a curaiss and for a mask make a helm.  Then, under the same folder you just used, find the TMNT recipe and exchange it for a turtle part.  For example, say I want to wear leather.  I would go under leather and make a leather curaiss and a leather helm.  Then I would find the recipe that read TMNT Leather Shell and TMNT Leather (color) mask.  All shells and masks can be tempered with the same ingot that the original uses.  \r<br />\r<br />Basically, this is simply a graphic replacer.  A normal curaiss and helm for a shell and mask.  All shells/masks have the same keywords as the original.\r<br />\r<br />This is similar to what I did with Magicka Sabers.  Yes, shameless plug for http://skyrim.nexusmods.com/mods/10517/?\r<br />\r<br />Come on, you know you want to make a Turtle Jedi now ... yes you do&#33;\r<br />\r<br />Completed materials -\r<br />\r<br />Light\r<br />DragonScale, Elven, Gilded, Glass, Imperial Light, Leather, Scaled, Stormcloak (Fur)\r<br />\r<br />Heavy\r<br />Daedric, DragonPlate, Dwemer, Ebony, Imperial, Iron, Banded, Orc, Steel, Steel Plate\r<br />\r<br />Not inluded because originals lack proper tags for matching perks\r<br />Blades, Shrouded, Falmer (Steel in the CK), Forsworn, Thieves Guild, Wolf (steel in the CK)\r<br />\r<br />Included with the Dawnguard/Dragonborn version -\r<br />\r<br />Light\r<br />Dawnguard, Morag Tong, Stalhrim, Chitin\r<br />\r<br />Heavy\r<br />Dawnguard, Falmer (mask fixed to be heavy), Stalhrim, Nordic Carved, Chitin, Bonemold, Improved Bonemold\r<br />\r<br />Not included\r<br />Ancient Falmer (Elven in CK), Skaal (Hide in CK), Ahzidal (unique), Blackguard (unique), Deathbrand (unique)\r<br />\r<br />Fixes -\r<br />2.0 Some of the Elven masks were tagged as leather.  \r<br />\r<br />Installation -\r<br />\r<br />Just download this mod and replace Titan&#39;s original file with this one.  Remember you NEED Titan&#39;s original mod for this too work.\r<br />\r<br />Permissions - \r<br />\r<br />I really just made this for myself, but then thought that others would enjoy it so here you go.  I in no way want to infringe on Titan&#39;s work.  In fact, Titan feel free to incorporate this mod into your own. ",
  "categoryId": "54",
  "version": "2",
  "author": "Aberation",
  "createdUnix": "1378100657",
  "updatedUnix": "1378168058",
  "containsAdultContent": false,
  "uploadedBy": "aberation",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000051609",
      "name": "TMNT expanded",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "TMNT expanded-41494-1.7z",
      "uploadedUnix": "1378100491",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8414171236b1cfb98fd279d252b2a5f55c1f45890e8e37434498944e65a15c25/analysis/1407705811/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TMNT%20expanded-41494-1.7z?fid=1000051609&ttl=1535822272&ri=8192&rs=8192&setec=b870d6944644ae0077bacdb9c24ba5b4"
    },
    {
      "fileId": "1000051840",
      "name": "TMNT Expanded - Dawnguard and Dragonborn version",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Dawnguard and Dragonborn version-41494-2.7z",
      "uploadedUnix": "1378168058",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/ab81d8648d54268f69de0f119c024ee6f4b4f231fdfdf2d1f4ffa429e558a446/analysis/1407706862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnguard%20and%20Dragonborn%20version-41494-2.7z?fid=1000051840&ttl=1535822273&ri=8192&rs=8192&setec=b074af2e15318fb3be3b23c61141a668"
    }
  ]
}