{
  "modId": 41569.0,
  "modName": "Amulet of Ysmir",
  "summary": "A more powerful version of the existing Amulet of Talos.",
  "descriptionHtml": "1. Introduction\r\n\r\nRecently I started a new character on Skyrim, and I was roleplaying a true Nord warrior, the standard Dragonborn in other words, heavily relying on Shouts (other than my trusty sword).\r\n\r\nI found myself a bit sad when I realized that, not only Shouts are underpowered (except a couple of them), but they also have an extensive cooldown.\r\nWhile it could be acceptable for a novice Dragonborn, who doesn\\'t know how to use his power yet, this fact doesn\\'t change at all when you finally reach the official status of Ysmir, Dragon of the North, even passing a test from the Greybeards (the former High King of Skyrim blew up after a Shout from Ulfric, you are whitstanding four legendary monks that make the whole nation tremble when they speak... this implies your power).\r\n\r\nTiber Septim himself was named Ysmir, Dragon of the North, and he became a God. I wanted to taste the feeling of mastering my voice.\r\nGranted, the quests to complete to become Ysmir are simple, but you still completed your training.\r\n\r\nAnd, avoiding spoilers, you are probably the most powerful Dragonborn, except the Septims dinasty, ever lived, even more powerful than Miraak.\r\n\r\n2. The Mod\r\n\r\nNot much to say on it, this mod adds an Amulet into the game, known as Amulet of Ysmir. It reduces the cooldown between Shouts to 0. Yes, you can achieve the same result by activating God Mode, but that takes a bit away from Immersion I think.\r\n\r\nAt the moment I\\'m not able to create a full quest to retrieve this item, so I\\'m placing this under Cheats and God Items, since it\\'s free.\r\n\r\nThere\\'s also a Lesser version available that decreases the cooldown by 85%.\r\n\r\nYou can find the Amulets in High Hrothgar, on the little altar by the entrance (behind the pillar), where usually a member of the Greybeards is praying. If you have troubles finding them, I\\'ll add a screenshot.\r\n\r\n\r\nCheck out my other mod!\r\n\r\nWarriors Ki:\r\nhttp://skyrim.nexusmods.com/mods/41582/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D41582%26preview%3D&pUp=1",
  "categoryId": "40",
  "version": "1.1",
  "author": "Nattens_Madrigal",
  "createdUnix": "1378216242",
  "updatedUnix": "1378260488",
  "containsAdultContent": false,
  "uploadedBy": "Nattens_Madrigal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052107",
      "name": "Amulet of Ysmir",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Amulet of Ysmir-41569-1-1.rar",
      "uploadedUnix": "1378260488",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/cae43bed4d0babe1dc7c80903fdade0da901c51178a1306bd6c7a13024c92670/analysis/1407708073/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Amulet%20of%20Ysmir-41569-1-1.rar?fid=1000052107&ttl=1535822360&ri=8192&rs=8192&setec=badca7293636116f6503f2db24661f41"
    }
  ]
}