{
  "modId": 41597.0,
  "modName": "Raanan the Silencer - Dark Brotherhood Initiate Replacer",
  "summary": "Not happy with the looks of the male Dark Brotherhood Initiate?  (Another Nord-yawn-no thank you) So how about a very rough and hopefully sexy around the edges Wood Elf Assassin. Now giggle happily whenever he calls you his Mistress/Master.",
  "descriptionHtml": "Not happy with the looks of the male Dark Brotherhood Initiate?  \r\n\r\nOh boy, another Nord... yawn No thank you.  \r\n\r\nHow about a very rough and hopefully sexy around the edges Wood Elf Assassin instead?\r\n\r\n[center][b]\\\"I\\'m yours to command, Mistress.\\\"\r\n\r\n*gives a slow devious grin*[/center]\r\n\r\n[size=+2]Recommendations:[/size][/b]\r\n\r\nFor marriage, it might be a good idea to get Honeyside in Riften first as a home.  Then as soon as the ceremony is over with run after him and suggest you live there.\r\n\r\nPlease note: I have yet to test out the marriage part of this mod.  I\\'ve only gone through the dark brotherhood quest once and had my Listener marry someone else. ( Cicero-yes Cicero XD )\r\n\r\nAlso…\r\nUltimate Follower Overhaul by by fLokii \r\nDovahkiin Relaxes Too by wgstein\r\nFollowers can Relax by King Coin\r\nMy Home Is Your Home - a mod for followers by Volek  \r\n\r\n[size=+2]Mods found in screen shots and video:[/size]\r\nRiverside Lodge with Sauna by Lupus\r\n(To get him nakie...)\r\n\r\nBlades Armor (To get more than one color/look use)\r\nBlades Light Armor -CRAFTABLE- Non-Replacer by SluggoV2 \r\nand\r\nRed Blades armor by Didier47\r\n\r\nThe Wanderers Surcoat by DaedalusAI\r\n\r\nStraight hair retexture by navetsea \r\n(I like this one because it doesn’t change the vanilla hair colors so much)\r\n\r\nAlexScorpions SnakeBows standalone version by AlexScorpion\r\n(Best Bow EVER!)\r\n\r\nScout Armor by DoODABoOM\r\nrecolor - Scout Armor - Black Leather-Dark Green clothes by Gunvarian and doodaboom\r\n(Quiver and Arrows)\r\n\r\nBetter males - Beautiful nudes and faces - New hairstyles by Chris57 and FavoredSoul\r\n(YoungerFaces & Geonox option)\r\n\r\nor \r\n\r\nSmooth Faces for Ladies and Gents by pikkatze\r\n(Smooth for Gents is a great performance alternative if you\\'re having problems with Younger Faces & Geonox textures glitching.) \r\n\r\n[b][size=+2]Bugs?[/size][/b]\r\n\r\nIf you knock him down (hurt him pretty bad) he may stay that way and crawl about.  For how long?  No clue and didn\\'t want to loose additional game play to find out.  This might be a vanilla bug as I remember watching a video on youtube about it ages ago.  I did a little bit of research and found out some followers just do this and to fix the problem you need to FUS them. (Force Shout but obviously not a good idea to do near a cliff unless you want to be widowed.)  If anyone who can confirm a better solution to this glitch please let me know.  Till then if this happens it might be best to go back to a previous save.  \r\n\r\nAny other problems, please let me know.\r\n\r\n[b][size=+2]Enhancements?[/size][/b]\r\n\r\nI did tweak a few of his stats by giving him the following perks to fit with his skills: Overdraw, Overdraw 20%, Agile Defender,  Agile Defender 20%, Stealth, Stealth 20%, Light Foot, Alteration Novice, Restoration Novice and Conjuration Novice.  \r\n\r\nHe also comes with a few spells (BoundBow, Healing LeftHand, LightningBolt, Sparks and Oakflesh) but so far I\\'ve only seen him use Oakflesh.  He prefers using One Handed attacks with Shield or staffs.\r\n\r\n(His fighting style is very similar to Cicero\\'s in that he\\'s Very Aggressive and Foolhardy)\r\n\r\nYou may want to use Alternate Actors by Iceburg to set up more perks points he has earned while leveling up by your side.\r\n\r\nI\\'m up for more suggestions in the department of his combat style.  Originally he was what\\'s called a csWEAssassinMissile but now csWEAssassinMelee.  When he was csWEAssassinMissile he stayed out of the way, used his bow and arrows more but seems to have trouble getting a clear shoot and doing any real damage but this might have been due to Cicero getting in his way. -.-\r\n\r\nI\\'m thinking of testing out and offering csWEBattlemage combat option so perhaps he\\'ll use his spells more often.\r\n\r\n[b][size=+2]FAQ:[/size]\r\n\r\nWhy did you do this?[/b]\r\nAgain wasn\\'t impressed with the original Male Dark Brotherhood Initiate.  I like Bosmer.  Lastly I think Raanan really fits his voice now and hopefully he\\'ll have you grinning too.\r\n\r\n[b]Is he still essential?[/b]\r\nHe should be.  \r\n\r\nTo turn off essential open the console menu with ~ key click on Raanan to bring up his ID number then enter the following:  setessential 0  This should make him mortal.  \r\n\r\nEntering:  setessential 1  Will set him immortal \r\n\r\n[b]Can you make him at lease have this _____ hair style, pretty please?[/b]\r\nI’ll [i]consider[/i] it only if it’s any ApachiiSkyHair or Vanilla one.  (Consider only because I don’t want to put up dozens of variations of this mod.)  Will need a photo or link to the style you want.  Or check out Apachii SkyHair Wigs by EvenstarGW\r\n\r\n[b]Can you make him stand alone?[/b]\r\n*blushes* I don\\'t know how! *sobs* But!  If you know how you\\'re welcome to do it and post it on Nexus.  All I ask is for a link on your mod to this one and I\\'d be happy to put a link for your mod on mine.  :)\r\n\r\n[b][size=+2]Distribution Permissions:[/size][/b]  \r\nPlease do not upload this anywhere without my consent.  \r\nFor posting in other languages again please contact me [u]first[/u] so I may link you on my page. :)\r\n\r\n[center][b][size=+2]Lastly, a BIG thank you to...[/size]\r\nSkyrim NPC Editor 0_75_1 by foretrenty\r\n\r\nEnjoy and please let me know of any issues. :) \r\nIf you like this please remember to endorse and send photos\r\n(Photos of you being happy with him gives me warm fuzzies and encourages me to keep making more mods)[/center][/b]\r\n\r\nVersion Log:\r\n1.0\r\n1.1",
  "categoryId": "96",
  "version": "1.1",
  "author": "CeaseSphire",
  "createdUnix": "1378516252",
  "updatedUnix": "1378524079",
  "containsAdultContent": false,
  "uploadedBy": "CeaseSphire",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052816",
      "name": "Raanan the Silencer - Dark Brotherhood Initiate Replacer",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "154",
      "fileName": "Raanan the Silencer - Dark Brotherhood Initiate Replacer-41597-1-0.zip",
      "uploadedUnix": "1378515530",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6941ecb64c8a7b483f3d7f4b528c56d7f316b8467b948e1cf89051060ee5f631/analysis/1407711679/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Raanan%20the%20Silencer%20-%20Dark%20Brotherhood%20Initiate%20Replacer-41597-1-0.zip?fid=1000052816&ttl=1535822390&ri=8192&rs=8192&setec=e4e94a88b58ab1def5d0951e29e51ca9"
    },
    {
      "fileId": "1000052824",
      "name": "Raanan the Silencer - DB Initiate Replacer",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "158",
      "fileName": "Raanan the Silencer - DB Initiate Replacer-41597-1-1.zip",
      "uploadedUnix": "1378524079",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7e42babec36ee8da265a9769028927149459cb5bff95962df1f6058af77f6844/analysis/1407711722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Raanan%20the%20Silencer%20-%20DB%20Initiate%20Replacer-41597-1-1.zip?fid=1000052824&ttl=1535822390&ri=8192&rs=8192&setec=a824c83d322cffe0580adb1596695d11"
    }
  ]
}