{
  "modId": 41609.0,
  "modName": "SPERG Weapon Styles",
  "summary": "An add-on for SPERG that adds additional One-handed perks that allow the player to pursue two combat styles: single-wielding and dual-wielding.",
  "descriptionHtml": "[size=32]SPERG Weapon Styles[/size]\r<br />\r<br />[color=red][b]REQUIREMENTS:[/b][/color]\r<br />[url=http://skyrim.nexusmods.com/mods/24445]SPERG 4.0 or above[/url]\r<br />\r<br />[color=red][b]WHAT IT DOES:[/b][/color]\r<br />This small mod is an add-on for seorin&#39;s Skyrim Perk Enhancements and Rebalanced Gameplay (SPERG). It modifies SPERG&#39;s One-handed perk tree to include additional perks that allow the players to pursue &#34;combat styles.&#34; One of the styles, dual-wielding, already exists in Vanilla and SPERG, and has merely been given some additional perks. The second, single-wielding, is new. It&#39;s perks only function when wielding a one-handed weapon and nothing else (torches are allowed, with special rules, but not spells). It started off as a mod that let me play as an agility and speed oriented fighter, but it&#39;s grown a bit, fleshing out the two combat styles that are possible with one-handed weapons. Some of the new perks are shared between the two styles, while other are exclusive to one.\r<br />\r<br />Additionally, this mod renames SPERG&#39;s &#34;Weapon Master&#34; perk to &#34;Dual Weapon Style,&#34; and &#34;Dual Savagery&#34; to simply &#34;Savagery.&#34;\r<br />\r<br />[color=red][b]THE PERKS:[/b][/color]\r<br />[color=green][b]Single Weapon Style[/b][/color]\r<br />[i]One-handed 60[/i]\r<br />When wielding a one-handed weapon in one hand and nothing in the other, attack speed increases by 45%\r<br />[color=green][b]Dual Weapon Style[/b][/color] [color=red](Included in SPERG, originally named Weapon Master)[/color]\r<br />[i]One-handed 60[/i]\r<br />Melee attacks gain unique bonuses based on weapon type. These bonuses are listed with active magic effects.\r<br />[color=green][b]Vigorous[/b][/color]\r<br />[i]One-handed 70, Single Weapon Style[/i]\r<br />Reduces Stamina cost for power attacks by 30% when single wielding. Skirmish Tactics increases damage by 25% when single wielding.\r<br />[color=green][b]Dual Savagery[/b][/color] [color=red](Included in SPERG)[/color]\r<br />[i]One-handed 70, Dual Weapon Style[/i]\r<br />Dual wielding power attacks do 25% bonus damage and dual wielding attacks are 25% faster.\r<br />[color=green][b]Agility[/b][/color]\r<br />[i]One-handed 90, Tireless[/i]\r<br />When wielding a one-handed weapon in one hand and nothing in the other, there is a 10% chance to slow time during an enemy&#39;s power attack, with a 20% chance to deal lethal damage while slowed.\r<br />[color=green][b]Celerity[/b][/color]\r<br />[i]One-handed 80, Tireless or Savagery[/i]\r<br />Increases run speed by 20% while wielding one-handed weapons (single or dual).\r<br />[color=green][b]Unburdened[/b][/color]\r<br />[i]One-handed 75, Single Weapon Style or Dual Weapon Style[/i]\r<br />When wielding one-handed weapons (dual or single) and nothing else, armor rating increases by 20%.\r<br />[color=green][b]Inexorable[/b][/color]\r<br />[i]One-handed 90, Savagery[/i]\r<br />After performing a critical hit while dual wielding, each hit that follows within five seconds results in another critical hit.\r<br />[color=green][b]Brutality[/b][/color]\r<br />[i]One-handed 100, Agility or Inexorable[/i]\r<br />When wielding a single one-handed weapon and nothing else or two one-handed weapons, there is a small chance of doing lethal damage or staggering the opponent.\r<br />\r<br />Additionally, the following perk is not contained within the weapon style perk trees, but can be taken at any time (preferably after exhausting the weapon style perks in order to maximize its benefit).\r<br />\r<br />[color=green][b]Sagacious Warrior[/b][/color]\r<br />[i]One-handed 60, Armsman[/i]\r<br />Grants bonuses based on chosen weapon style perks (dual or single) while wielding one-handed weapons in any configuration (including one-handed weapons and shields). \r<br />\r<br />Consult the following chart for Sagacious Warrior bonuses. These effects are not cumulative.\r<br />\r<br />[b][i]Single Weapon Style - Increased Weapon Speed[/i][/b]\r<br />Single Weapon Style and Dual Weapon Style: +5%\r<br />Single Weapon Style and Savagery: +10%\r<br />Single Weapon Style and Inexorable: +15%\r<br />\r<br />[b][i]Dual Weapon Style - Increased Attack Damage[/i][/b]\r<br />Dual Weapon Style and Single Weapon Style: +5%\r<br />Dual Weapon Style and Vigorous: +10%\r<br />Dual Weapon Style and Agility: +15%\r<br />\r<br />[b][i]Single Weapon Style and Dual Weapon Style - Increased Critical Chance[/i][/b]\r<br />Dual Weapon Style and Single Weapon Style: +5%\r<br />Single Weapon Style, Dual Weapon Style and Savagery: +7%\r<br />Single Weapon Style, Dual Weapon Style and Vigorous: +7%\r<br />Single Weapon Style, Dual Weapon Style, Savagery, and Vigorous: +9%\r<br />Single Weapon Style, Dual Weapon Style, Savagery, Vigorous, and Inexorable: +11%\r<br />Single Weapon Style, Dual Weapon Style, Savagery, Vigorous, and Agility: +11%\r<br />Single Weapon Style, Dual Weapon Style, Savagery, Vigorous, Inexorable, and Agility: +15%\r<br />\r<br />[color=red][b]INSTALLATION:[/b][/color]\r<br />Either use [url=http://skyrim.nexusmods.com/mods/1334/]Mod Organizer[/url] (the best program ever) or Nexus Mod Manager (better than nothing). You can also manually extract it to your Skyrim directory. Load SPERG Weapon Styles.esp after SPERG.esp.\r<br />\r<br />[color=red][b]UNINSTALLATION:[/b][/color]\r<br />Just unclick the .esp. This mod uses no scripts, so it should be OK to remove without screwing with your save files. Remember to do a Perk Reset in the SPERG MCM menu before uninstalling if you&#39;ve taken any of my new perks, so you get back the perk points.\r<br />\r<br />[color=red][b]COMPATIBILITY:[/b][/color]\r<br />This mod modifies the One-handed tree and two SPERG perk names. Since it requires SPERG and SPERG already overwrites these assets, it should be compatible with everything.\r<br />\r<br />[color=red][b]UPDATES:[/b][/color]\r<br />Version 1.10\r<br />Fixes:\r<br />Agility apparently only had a 1% chance to slow time, since the spell itself and the perk entry both occurred 10% of the time. This has been fixed.\r<br />\r<br />Changes:\r<br />It is now possible to carry a torch and benefit from single-wielding perks. However, to preserve the feeling of the single weapon style, the 45% weapon speed bonus from the Single Weapon Style perk is reduced by 20% while holding a torch. Taking the Vigorous perk will reduce this penalty by 10%, and taking the Agility perk will remove it altogether.\r<br />\r<br />Celerity now grants a 10% movement speed bonus when single or dual-wielding and the Whirlwind lesser power, which increases your weapon speed by 150% but reduces your armor rating by half for 10 seconds.\r<br />\r<br />Renamed Tireless to Vigorous, since Tireless was already a perk in SPERG.\r<br />\r<br />Added the Sagacious Warrior perk. This perk is meant to reward people who embrace both single and dual-wielding styles by granting small bonuses to damage, weapon speed and critical hit chance based on what weapon style perks the player has taken. These bonuses are granted with any one-handed configuration (single-wield, dual-wield, weapon and shield).\r<br />\r<br />1.06\r<br />Changed Savagery to require One-Handed 70 (it was 90, not sure why).\r<br />\r<br />1.05\r<br />Fixed Tireless to require both One-handed 70 and Single Weapon Style. Fixed Weapon Master to only need One-handed 55 as per SPERG (it was 60).\r<br />\r<br />[color=red][b]KNOWN ISSUES:[/b][/color]\r<br />Originally, I intended this mod to focus on speed and agility. In the course of developing this, however, I realized that it provides a different experience depending on which hand the weapon is in. As I learned, this is because equipping a one-handed weapon in the left hand and nothing in the right hand does not allow you to block, but instead allows you to punch with the right hand. Additionally, you only get one type of attack, a left to right swipe. This has the effect of slowing your attacks. Keep in mind that this does not slow your attack speed, and here&#39;s why. When a weapon is equipped in the right hand, the normal animation sequence is a right to left swipe, then a left to right swipe, then a right to left swipe, then a left to right swipe, and so on. Although your weapons are moving at the same speed, the animation sequence itself is faster when you have both of these attacks following each other in sequence. When you only have one, the animation sequence is slower (noticeably). There&#39;s nothing I can do about this, so my suggestion is to simply use your one-handed weapon in your right hand if you&#39;re going for absolute speed (which, as stated, was the original intent of this mod, but by no means the only way to play and enjoy it).\r<br />\r<br />It might be interesting to play this way if your unarmed damage is high (SPERG ties unarmed damage to the Pickpocket tree, so a combat-oriented thief build comes to mind). I haven&#39;t tested this, however, so I can&#39;t make any promises about how effective it will be.\r<br />\r<br />So you end up with two options: the right-handed fighter, who is faster and can block, or the left-handed fighter who can throw a punch and swing a sword. This is really an unexpected but pleasant result, since I love more options in character building. If people report favorably on the left-handed build, I might add some abilities to improve unarmed combat while wielding a one-handed weapon.\r<br />\r<br />Along the same lines, when I was using the Joy of Perspective, I noticed that the left to right attack wouldn&#39;t play in first person when wielding a one-handed weapon in the right hand. I tested this on a vanilla game, and both animations played fine. On a game with the ONLY mod being the Joy of Perspective, the left to right attack failed to play in first person. Outside of first person, the animation played fine. This causes attacks in first person to seem slower, as described above. I notified the JoP team about this, but received no response. Let me know if this issue exists for you&#33;\r<br />\r<br />[color=red][b]THANKS:[/b][/color]\r<br />seorin, for his incredible work on SPERG&#33;",
  "categoryId": "24",
  "version": "1.10",
  "author": "Alasyre",
  "createdUnix": "1378327132",
  "updatedUnix": "1400785560",
  "containsAdultContent": false,
  "uploadedBy": "Alasyre",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097883",
      "name": "SPERG Weapon Styles",
      "version": "1.06",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "SPERG Weapon Styles-41609-1-06.rar",
      "uploadedUnix": "1392870044",
      "modVersion": "1.06",
      "virusScanUrl": "https://www.virustotal.com/file/70af697ed5800a00bf26ea598e655ef993c5e8439cc019afecce29d77131584e/analysis/1407941590/",
      "changelogHtml": " Changed Savagery to require One-Handed 70 (it was 90, not sure why). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%20Weapon%20Styles-41609-1-06.rar?fid=1000097883&ttl=1535822404&ri=8192&rs=8192&setec=edada381be636b527cef7d7338523a60"
    },
    {
      "fileId": "1000109994",
      "name": "SPERG Weapon Styles",
      "version": "1.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "SPERG Weapon Styles-41609-1-10.rar",
      "uploadedUnix": "1400785560",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/473ad1006389371dc89254265704ca50ec6dcd54fd84de9937d81fefa4d574b3/analysis/1408089967/",
      "changelogHtml": " Fixes:\r<br />Agility apprently only had a 1 chance to slow time, since the spell itself and the perk entry both occured 10% of the time. This has been fixed.\r<br />\r<br />Changes:\r<br />It is now possible to carry a torch and benefit from single-wielding perks. However, to preserve the feeling of the single weapon style, the 45% weapon speed bonus from the Single Weapon Style perk is reduced by 20% while holding a torch. Taking the Vigorous perk will reduce this penalty by 10%, and taking the Agility perk will remove it altogether.\r<br />\r<br />Celerity now grants a 10% movement speed bonus when single or dual-wielding and the Whirlwind lesser power, which increases your weapon speed by 150% but reduces your armor rating by half for 10 seconds.\r<br />\r<br />Renamed Tireless to Vigorous, since Tireless was already a perk in SPERG.\r<br />\r<br />Added the Sagacious Warrior perk. This perk is meant to reward people who embrace both single and dual-wielding styles by granting small bonuses to damage, weapon speed and critical hit chance based on what weapon style perks the player has taken. These bonuses are granted with any one-handed configuration (single-wield, dual-wield, weapon and shield). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%20Weapon%20Styles-41609-1-10.rar?fid=1000109994&ttl=1535822405&ri=8192&rs=8192&setec=c30930d414df45b00d47f59719e6c71f"
    }
  ]
}