{
  "modId": 41617.0,
  "modName": "Fallow Keep",
  "summary": "A player home fit for a necromancer. With, one or two extras.",
  "descriptionHtml": "[font=&#34;Impact&#34;][size=6][b]Fallow Keep - by Borjoyzee\r<br />Category - Homes and Abodes[/b][/size][/font]\r<br />\r<br />[size=5][color=red][u][b]ATTENTION[/b][/u][/color] --- Requires Dawnguard.[/size]\r<br />[line]\r<br />[color=lightgreen][font=&#34;Impact&#34;][center][size=5][b][u]- Description -[/u][/b][/size][/center][/font][/color]\r<br />\r<br />Adds a tower and a keep as a player home, primarily designed for a Necromancer, vampire, evil mage or any evil type character. Though I suppose you don&#39;t have to be evil to live there, but it helps ;) It has been given particular attention to the dark side. So expect darkness, dirt, skulls, candles, skeletons, cobwebs, spiders, corpses hanging from ropes, echo-y sounds...you know, all that stuff.\r<br />\r<br />The entrance is nearest to Riverwood, but on the way to Whiterun. On the other side of the river, at the bottom of the mountain. Just go to Whiterun from Riverwood, keeping an eye on the other side of the river. There are map markers anyway, visible to show you where, but you can&#39;t fast travel to them until you&#39;ve discovered them.\r<br />\r<br />The black tower is locked, but there is a key very nearby, you&#39;ll have to find it. The large gate can only be opened by a nearby lever, but it&#39;s not hard to find, and can be shut again once inside the grounds to keep out intruders. Once inside the tower it is purposfully dark, but if it&#39;s too dark for some I may make a slightly lighter version. Conversely if it&#39;s not dark enough, I like the way you think. Frankly I don&#39;t think it&#39;s dark enough personally, but I had to make it a bit lighter for others who might find it too dark.\r<br />\r<br />The tower mostly contains the homely things, big chair next to a roaring fire, kitchen, bedroom etc. It also has 3 bookshelves, a few weapon plaques, 2 mannequins, and auto sorters for food, drink and a safe for jewelry and gems. Containers are safe.\r<br />\r<br />But head on up and out onto the roof, here you will find an altar which can change the weather. 4 to choose from, clear sunny weather, cool foggy weather, cold snowy weather, and rain-stormy weather. It takes a while for the weather to transition, anything up to a minute so just wait. If you don&#39;t want to wait, &#34;wait&#34; an hour...to see the result faster. That doesn&#39;t make sense does it. It&#39;s not permanent either, the weather will change again normally eventually.\r<br />\r<br />Main part of the mod is the keep. Go on inside, which is the ruins and acts as a hub to access the rest of the rooms, into:\r<br />\r<br />[font=&#34;Impact&#34;][size=3]1: Library.[/size][/font] Here are 10 bookshelves, each with 18 books storable.\r<br />\r<br />[font=&#34;Impact&#34;][size=3]2: Smithy.[/size][/font] Contains what you might expect. You can auto store crafting items in the big cupboard. Contains 2 mannequins and some weapon plaques.\r<br />\r<br />[font=&#34;Impact&#34;][size=3]3: Hallway.[/size][/font] From the ruins you can head upstairs into the hallway, from which you can get to the:\r<br />\r<br />[font=&#34;Impact&#34;][size=3]4: Study.[/size][/font] Arcane enchanter, with auto storage for empty and full soul gems. And a crafting station for scrolls so you can make your own but you&#39;ll need an inkwell and quill in your inventory, with an auto sorter for them too. Includes a soul gem fuser, to combine soul gems. Example 2 petty gems can be combined to create a lesser gem. Using Hanaisse&#39;s Skeleton staff model, you can assemble various skeleton staves using skeletal parts and the appropiate spell tome. (Skeleton parts can be found in the catacombs.) Additionally there is a bookshelf for another 18 books.\r<br />\r<br />[font=&#34;Impact&#34;][size=3]5: Alchemy Hollow.[/size][/font] Create your potions/poisons here. Also from a new crafting station for each, you can combine potions and poisons to the next strength. Example, 2 weak poisons can be combined to create the next strength. Then 2 of that strength can be combined to the next, and the next etc etc, right up to deadly. Same principal for potions. And you can auto store all ingredients, poisons and potions.\r<br />\r<br />[font=&#34;Impact&#34;][size=3]6: Attic Space.[/size][/font] This place has been partly destroyed, but if I were you, I&#39;d stay out of here for now. Or at least don&#39;t approach the altar at the rear of the room, until you are strong enough to take on a dragon priest. Because if you wake him up, he won&#39;t be a happy bunny. I&#39;m a bit like that in the morning too.\r<br />\r<br />Last but not least, and if you can find it:\r<br />\r<br />[font=&#34;Impact&#34;][size=3]7: The Catacombs.[/size][/font] This is where the master used to perform his experiments on the dead. He got quite good at it too, and left instructions on how you might create your very own zombie follower. However it&#39;s not easy, but most of the components can be found in the catacombs themselves. Most are hidden or otherwise difficult to obtain to give you a challenge finding them so you must search around thoroughly. But, it&#39;s nasty down there and you won&#39;t be alone. If you need help I&#39;ll mention the items at the bottom here in a FAQ.\r<br />[line]\r<br />[center][youtube]F6HEGoODIkM[/youtube][/center]\r<br />[line]\r<br />[color=lightgreen][font=&#34;Impact&#34;][center][size=5][b][u]Recommended Mods[/u][/b][/size][/center][/font][/color]\r<br />\r<br />To fully embrace your inner-necro, I highly recommend these mods:\r<br />\r<br />[font=&#34;Impact&#34;][size=3][url=http://skyrim.nexusmods.com/mods/38386/?]Contractor and Mavari armor:[/url][/size][/font] (Great robes for a necro, only for males though I think)\r<br />\r<br />[font=&#34;Impact&#34;][size=3][url=http://skyrim.nexusmods.com/mods/35378/?]Corpse Preparation:[/url][/size][/font] (The make-your-own-zombie part of my mod was inspired by, but is not better than (though is pretty good :^D), Corpse Preparation)\r<br />\r<br />[font=&#34;Impact&#34;][size=3][url=http://skyrim.nexusmods.com/mods/23625/?]Forgotten Magic:[/url][/size][/font] (Has great spells for a necro, and great spells in general. And a unique way of leveling them up)\r<br />\r<br />[font=&#34;Impact&#34;][size=3][url=http://skyrim.nexusmods.com/mods/14009/?]Necromancer Spell Set:[/url][/size][/font] (More great spells, including actually raising a skeleton from a humanoid body)\r<br />\r<br />And a special mention to [font=&#34;Impact&#34;][size=3][url=http://skyrim.nexusmods.com/mods/40607/?]&#34;Undeath&#34;:[/url][/size][/font] (Though I&#39;m afraid in it&#39;s current state, it does break some quests and does some other wierd things which is highly unfortunate, but I must give it a mention in the hopes that the author will fix those issues, because what a boon it could be for a necro...)\r<br />[line]\r<br />[color=lightgreen][font=&#34;Impact&#34;][center][size=5][b][u]Bugs/Incompatibilities[/u][/b][/size][/center][/font][/color]\r<br />\r<br />As with all new mods, make a main save before using. You just never know with Skyrim. It IS clean, (checked with TES5Edit) and I&#39;ve not had any problems so far, although I like to keep the number of mods at a minimum. The only vanilla edits are the entrance and the navmesh, of which nothing has been deleted, only moved or added to. And no vanilla item lists have been touched, so no problems there. Never uninstall any mod that has established itself in a save, if there&#39;s a problem and you need to uninstall, do so but then go back to your save before installing it. With this mod though, I&#39;m not sure. There won&#39;t be any lingering scripts running, they are only simple one-shot-do-something-and-stop scripts. Who knows, just be careful. Will probably be incompatible with any mod that adds something in the same place, maybe. Depends how close. If it&#39;s a house mod, use one or the other, though you&#39;re probably not going to use 2 house mods for one character anyway. Any problems, try altering it in your load-order first.\r<br />[line]\r<br />[color=lightgreen][font=&#34;Impact&#34;][center][size=5][b][u]Credits[/u][/b][/size][/center][/font][/color]\r<br />\r<br />Blary, Oaristys, Tony67, and Runspect. For some amazing resources.\r<br />Hanaisse for the [url=http://skyrim.nexusmods.com/mods/27337/?]skeleton staff[/url] model.\r<br />TomHart for the sorting script.\r<br />Nexus for a good place to upload mods.\r<br />Bethesda for the game and CK.\r<br />\r<br />Anyone I may have missed.\r<br />[line]\r<br />[color=lightgreen][font=&#34;Impact&#34;][center][size=5][b][u]FAQ (And spoilers) - Only read if you&#39;re stuck.[/u][/b][/size][/center][/font][/color]\r<br />\r<br />Q: How do I open the front gate?\r<br />A: The switch to open the front gate is located near the rock in front of the gate. The rock has a pillar on in, you literally can&#39;t miss it.\r<br />\r<br />Q: Where is the key to the tower?\r<br />A: The key to the front door is located in a knapsack held by a skeleton, who was once a robber. It&#39;s on the left side of the grounds.\r<br />\r<br />Q: Catacombs? What...how...where...?\r<br />A: The Catacombs is a location deep underground where the master performed his experiments. You yourself may be able to create your very own zombie follower. The key to the catacombs is, unfortunately, held by a Dragon Priest by the name of Rammaq. If you know where I got the name for him congrats. Yes I&#39;m rubbish at thinking up good names. Make sure you are strong enough to take on a dragon priest.\r<br />\r<br />Q: How do I create my own skeleton staff?\r<br />A: You&#39;ll need 5 bloody skeletal arms bones and one hand, and the appropiate spell tome. All the parts can be found in the catacombs. But apart from the Conjure Gargoyle spell tome, you&#39;ll need to get the other needed spell tome elsewhere.\r<br />\r<br />Q: Create your very own zombie? &lt;3 Cool, what do I need to do?\r<br />A: Lotsa stuff. More or less everything you need to create it is located in the catacombs. Other things you could find elsewhere, usually in nordic ruins.\r<br />\r<br />The full list of items are:\r<br />\r<br />Zombie Head\r<br />Zombie Torso\r<br />Zombie Arm x2\r<br />Zombie Leg x2\r<br />Daedra Heart\r<br />Filled Black Soul Gem\r<br />Leather Strip x9\r<br />Linen Wrap x2\r<br />Lingering Damage Health (This gives the zombie an ability)\r<br />\r<br />Once you have all those, you&#39;ll also need a full set of embalming tools. Then use the altar to create the zombie. It will appear in the cage near the altar, and you get a spell that will summon it to you, purely for convenience, save you going back for it every-time (and when it gets stuck). You can tell it to follow and wait. Dismissing it teleports it directly back into the cage instead, I thought that would be quicker and easier than having it walk all the way back. It&#39;s classed as an animal however, so will take the place of a dog.\r<br />\r<br />Any other questions just ask.",
  "categoryId": "67",
  "version": "1.2",
  "author": "Borjoyzee",
  "createdUnix": "1378324597",
  "updatedUnix": "1378998232",
  "containsAdultContent": false,
  "uploadedBy": "borjoyzee",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052322",
      "name": "Fallow Keep",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6284",
      "fileName": "Fallow Keep-41617-1.7z",
      "uploadedUnix": "1378331117",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ad6b7adb36e66158c5f6ebf4af807e7d8eb28ef48aeba47885dd62c8d7f84a48/analysis/1407708852/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fallow%20Keep-41617-1.7z?fid=1000052322&ttl=1535822411&ri=8192&rs=8192&setec=28e57a4a0be76f9b853b96eca8c44ab7"
    },
    {
      "fileId": "1000054578",
      "name": "Fallow Keep 1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6352",
      "fileName": "Fallow Keep 1_2-41617-1-2.7z",
      "uploadedUnix": "1378998232",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/46bd779fa3bfdb5995baf17c430e9bc424b72615f01db3844de23cb8e6e3414a/analysis/1407720376/",
      "changelogHtml": " Added a few more weapon racks and 2 more mannquins <br/> \n Added a soul gem fuser for combining gems <br/> \n Added a skeleton staff assembler to create your own skeleton staff <br/> \n New spell: Conjure Gargoyle <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fallow%20Keep%201_2-41617-1-2.7z?fid=1000054578&ttl=1535822411&ri=8192&rs=8192&setec=3db40b841ccd818e2274571f77bfcbda"
    }
  ]
}