{
  "modId": 41625.0,
  "modName": "Sylvia - Follower",
  "summary": "A simple female follower.",
  "descriptionHtml": "!!Important!! ApachiiSkyHair_v_1_5_Full is required!!\r\nIf you don\\'t have it bad things will happen, most likely a crash :/\r\n\r\nAlso, I\\'d recommend using CBBE, the curvy version, because that\\'s what I was using when I made her.\r\n\r\n!!!!SHOULD WORK NOW!!!! [s]Oh, and if the head is darker than the body, open up console commands, click on Sylvia and enter this: setnpcweight 50\r\nYou may have to do this every time you load up a save. If anyone knows how to fix this, please tell me![/s]\r\n\r\nInstallation: Dump all files in Data and click yes/yes to all for anything that pops up, or use NMM\r\nUninstall: Deleting the ESP should do the job, or use NMM\r\n\r\nAbout: Sylvia is a Nord whom prefers one-handed weapons, she can do dual wielding, she\\'s is also rather good at restoration. She is better with light armour than she is with heavy armour.\r\nShe comes with low level armour so that it can be replaced with pretty much anything. She has two imperial swords, 250 gold, 22 pieces of leather, 20 leather strips, 2 rubies, a hunting bow, 50 iron arrows, 2 iron ore. She is level 20.\r\n\r\nYou can probably find her wandering around Whiterun, probably behind Olava the Feeble\\'s house because that\\'s where I placed her in the world.\r\n\r\nShe can also be married! Aw yiss\r\n\r\nWhy I made her? Because there were no follower mods that had quite what I was looking for so I made one myself. I tried to go for pretty but not OTT.\r\n\r\nIf you encounter any problems, please tell me! This is my first mod!\r\n\r\nIf anyone gets some rad screenshots while playing with her, please submit them or whatever!\r\n\r\nAll feedback welcome!\r\nIf you like it, endorse it!\r\nThanks ouo",
  "categoryId": "96",
  "version": "v.3",
  "author": "penguinhaha",
  "createdUnix": "1378330030",
  "updatedUnix": "1378335385",
  "containsAdultContent": false,
  "uploadedBy": "penguinhaha",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052335",
      "name": "SylviaFollower-Fixed",
      "version": "v.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "319",
      "fileName": "SylviaFollower-Fixed-41625-.zip",
      "uploadedUnix": "1378335385",
      "modVersion": "v.3",
      "virusScanUrl": "https://www.virustotal.com/file/adec7ac03aa14a9a86cebc28c1825e7647f274a2fa9f378ed892766ab23fffc0/analysis/1407712562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SylviaFollower-Fixed-41625-.zip?fid=1000052335&ttl=1535822422&ri=8192&rs=8192&setec=94fff6d3f2460c19438dd9a3f28547d2"
    }
  ]
}