{
  "modId": 41629.0,
  "modName": "Almost Everyone is An Adventurer",
  "summary": "This allows you to turn most NPCs into useful, recruitable followers for you to use and abuse. Walk up to your favorite (or least favorite) NPC, pick a class and start questing with them today&#33;",
  "descriptionHtml": "&#34;Almost Everyone is An Adventurer&#34; is a mod that allows you to turn most NPCs into useful, recruitable followers for you to use and abuse. Walk up to your favorite (or least favorite) NPC, pick a class and start questing with them today&#33;\r<br />\r<br />\r<br />[color=yellow][b]Requirements:[/b][/color]\r<br />[list][*]The latest Skyrim patch (Version 1.9.32.0.8)[/*]\r<br />[*][url=http://skse.silverlock.org/]Skyrim Script Extender[/url] (SKSE)[/*]\r<br />[*]Optional: [url=http://skyrim.nexusmods.com/mods/3863/]SkyUI[/url] for its Mod Configuration Menu (MCM)[/*]\r<br />[/list]\r<br />\r<br />\r<br />[color=yellow][b]Installation and Updating:[/b][/color]\r<br />[list][*][b]With Nexus Mod Manager[/b]: Simply click on the &#34;Download with Manager&#34; button.[/*]\r<br />[*][b]Manual Installation[/b]: Extract both files (the .bsa and the .esp) to your Skyrim data folder.[/*]\r<br />[*][b]Updating:[/b]: Install over the previous version. Do not make a &#34;clean save&#34;.[/*]\r<br />[/list]\r<br />\r<br />\r<br />[color=yellow][b]How to Use:[/b][/color]\r<br />[list][*]A book called &#34;Adventuring for Dummies&#34; should be automatically added to your inventory.[/*]\r<br />[*]Walk up to an NPC and try to talk. If he/she (1) is a unique NPC (for example, Ralof and Hadvar are unique; Bandit Thug and Forsworn Briarheart are not), (2) is not a Jarl, (3) is not a child, (4) has a voice used by standard followers there will be an option to say &#34;I want you to join me on adventures&#33;&#34; (If you have the Mod Configuration Menu, you can allow Jarls, children and more allowed voice types).[/*]\r<br />[*]If the NPC is your friend, you will be asked to select a class. If you make a mistake or change your mind later, you can change their class whenever they are not actively following you.[/*]\r<br />[*]If the NPC is not your friend, you can bribe, intimidate or persuade them into becoming an adventurer anyway.[/*]\r<br />[*]Note that turning someone into an adventurer will cost gold (by default 1000. The amount can be changed in the Mod Configuration Menu).[/*]\r<br />[*]After class selection, the NPC will receive stats appropriate for his/her class, basic equipment for that class, changes to his/her combat style and will become more willing to commit crimes, will be braver in combat, will engage enemies and will assist his/her friends and allies.[/*]\r<br />[*]Using the &#34;setlevel&#34; console command is recommended to allow them to level with you. I personally recommend entering &#34;setlevel 1000 0 1 100&#34;.[/*]\r<br />[*]Should you no longer wish to say to anyone &#34;I want you to join me on adventures&#33;&#34;, simply drop or sell the book and the dialogue option will no longer appear. To obtain another copy of the book, go to any tanning rack and craft it.[/*]\r<br />[/list]\r<br />\r<br />\r<br />[color=yellow][b]Changelog:[/b][/color]\r<br />[b]Version 1.1[/b]\r<br />[list][*]Now compatible with AFT.[/*]\r<br />[*]Now mostly compatible with UFO.[/*]\r<br />[*]Removed necromancy spells from conjuration mages to prevent them from doing stupid things like summoning a dremora lord, letting it kill a bandit then raising that bandit.[/*]\r<br />[*]Necromancer class added so that you will have an option if you like having followers raise the dead.[/*]\r<br />[*]Sorcerer class added. Similar to destruction mages but with less varied spells, heavy armor and decent onehanded skill.[/*]\r<br />[*]Barbarians, rogues, rangers and warriors should no longer cast spells.[/*]\r<br />[*]Changes to how the mod handles dead adventurers to avoid problems with &#34;resurrect&#34;.[/*]\r<br />[*]Recruiting now ends dialog in order to fix a dialog bug.[/*]\r<br />[*]Minor changes to &#34;combat styles&#34;.[/*]\r<br />[/list]\r<br />[b]Version 1.0[/b]\r<br />[list][*]Initial release[/*]\r<br />[/list]\r<br />\r<br />\r<br />[color=yellow][b]Frequently Asked Questions / Known Issues / Troubleshooting:[/b][/color]\r<br />[b]Q: In the MCM menu, I saw a setting called &#34;More Allowed Voice Types&#34;. What does this do exactly?[/b]\r<br />A: By default, only NPC with voices in the &#34;VoicesFollowerAll&#34; group can be recruited. &#34;More Allowed Voice Types&#34; expands it to include &#34;DefaultNPCVoiceTypes&#34;.\r<br />\r<br />VoicesFollowerAll:\r<br />[list][*]MaleEvenTonedAccented[/*]\r<br />[*]FemaleSultry[/*]\r<br />[*]MaleDrunk[/*]\r<br />[*]FemaleDarkElf[/*]\r<br />[*]MaleDarkElf[/*]\r<br />[*]MaleNord[/*]\r<br />[*]FemaleCommander[/*]\r<br />[*]MaleBrute[/*]\r<br />[*]MaleArgonian[/*]\r<br />[*]MaleKhajiit[/*]\r<br />[*]FemaleOrc[/*]\r<br />[*]MaleOrc[/*]\r<br />[*]FemaleCondescending[/*]\r<br />[*]MaleEvenToned[/*]\r<br />[*]FemaleEvenToned[/*]\r<br />[*]MaleYoungEager[/*]\r<br />[*]FemaleYoungEager[/*]\r<br />[/list]\r<br />\r<br />DefaultNPCVoiceTypes (as above plus the following):\r<br />[list][*]MaleCommonerAccented[/*]\r<br />[*]MaleForsworn[/*]\r<br />[*]MaleBandit[/*]\r<br />[*]MaleGuard[/*]\r<br />[*]MaleNordCommander[/*]\r<br />[*]MaleSlyCynical[/*]\r<br />[*]MaleSoldier[/*]\r<br />[*]MaleOrcKindly[/*]\r<br />[*]MaleOrcGrumpy[/*]\r<br />[*]MaleElfHaughty[/*]\r<br />[*]MaleCoward[/*]\r<br />[*]MaleCondescending[/*]\r<br />[*]MaleCommoner[/*]\r<br />[*]MaleCommander[/*]\r<br />[*]MaleChild[/*]\r<br />[*]FemaleOrcKindly[/*]\r<br />[*]FemaleOrcGrumpy[/*]\r<br />[*]FemaleNord[/*]\r<br />[*]FemaleKhajiit[/*]\r<br />[*]FemaleElfHaughty[/*]\r<br />[*]FemaleCoward[/*]\r<br />[*]FemaleCommoner[/*]\r<br />[*]FemaleChild[/*]\r<br />[*]FemaleArgonian[/*]\r<br />[/list]\r<br />\r<br />[b]Q: My follower feels really weak and I already used the &#34;setlevel&#34; command. Did something go wrong?[/b]\r<br />A: Some NPCs in the game have &#34;auto calculate stats&#34; disabled. This means that class, level, etc. will not affect their static stats. Two examples I have managed to encounter while testing are Hroki and Mulush gro-Shugurz (both coincidentally at Markarth).\r<br />\r<br />[b]Q: Sometimes after turning someone into an adventurer, I can&#39;t talk to or touch them&#33;[/b]\r<br />A: I apologize for that. I have been unable to figure out why that occurs. Leaving the area and coming back fixes it though. Another way is to use &#34;disable&#34; and &#34;enable&#34; on them using the console.\r<br />\r<br />[b]Q: What&#39;s the maximum number of NPCs I can ask to become adventurers?[/b]\r<br />A: 120 NPCs. Take note I just mean picking a class for them and turning them into potential followers. They won&#39;t all follow you around simultaneously. If one of them dies, they&#39;re removed from the list next time you (1) save and load that save or (2) turn someone else into an adventurer. This is to help keep the 120 limit from being reached.\r<br />\r<br />[b]Q: I used the &#34;resurrect&#34; console command on a dead adventurer. Will that be a problem?[/b]\r<br />A: [s]All you need to know is, if you did not (1) save then load or (2) turn someone else into an adventurer after they died, there shouldn&#39;t be a problem. If you did however, as mentioned in the question before this, the mod forgets about them to make room for more adventurers and no longer tracks what class or combat style they&#39;re supposed to have. Changing the class of your resurrected follower will give them the right class and combat style but this data will not be stored and will be lost next time you run Skyrim. A workaround is to remove them from the &#34;AEIAAdventurer&#34; faction, which flags them as already recruited, and the &#34;PotentialFollowerFaction&#34; using console commands and then recruiting them again.[/s]\r<br />As of version 1.1, the mod automatically removes the relevant factions when it &#34;forgets&#34; dead adventurers and this should no longer be problem if your adventurer died after installing version 1.1.\r<br />\r<br />[b]Q: Is this compatible with follower overhauls like UFO, AFT or EFF?[/b]\r<br />A: [s]Mostly. With UFO, followers that require the &#34;More Allowed Voice Types&#34; enabled can only be recruited if you have no other followers following you. With AFT, I was unable to get followers that require &#34;More Allowed Voice Types&#34; enabled to use the Pillar in the Boethiah&#39;s Calling quest when using AFT. Basically, keep the &#34;More Allowed Voice Types&#34; option disabled if you use a follower overhaul. UFO and AFT both seemed to work better placed below this mod in the mod order.[/s]\r<br />As of version 1.1, the mod should now be fully compatible with AFT. With UFO, it&#39;s now mostly compatible but followers that require the &#34;More Allowed Voice Types&#34; enabled still cannot be dismissed (except by attacking them) and they will wait indefinitely. With EFF, you can only recruit one follower that requires &#34;More Allowed Voice Types&#34; enabled but everyone else will join no problem.\r<br />\r<br />[b]Q: Can I induct my new adventurers into the Blades?[/b]\r<br />A: Followers you get from the mod with its default settings will join with no problem. They also stayed at Skyhaven Temple and they also joined me on dragon hunts. Followers that require &#34;More Allowed Voice Types&#34; enabled are silent when using Blades greetings and are also silent during the oath preventing that dialogue from finishing. Simply fast travel away and they&#39;ll be Blades when you get back. If the inducted NPC was a shopkeeper, then he/she loses the ability to sell to you. Children can be made Blades members but it attempts to give them Blades Armor and ends up making them look like their in their underwear.\r<br />\r<br />[b]Q: Heimskr keeps running back to the Shrine of Talos and never stops preaching.[/b]\r<br />A: Ask him to follow you when he isn&#39;t preaching (8PM - 5AM) and never go near that shrine with him.\r<br />\r<br />[b]Q: My new follower is using a spell that his/her class shouldn&#39;t be casting.[/b]\r<br />A: That is probably a spell the NPC has by default (just like you know Flames and Healing by default). When a class is assigned, the script removes other spells the NPC knows but I cannot remove these default spells. As of version 1.1, this issue should no longer occur with barbarians, rangers, rogues and warriors.\r<br />\r<br />[b]Q: Some NPCs say &#34;I suppose Master Neloth won&#39;t mind. He&#39;s always telling me to get out of the way.&#34; when I ask them to follow me. Is that supposed to happen?[/b]\r<br />A: It&#39;s a bug with the Dragonborn DLC. Talvas Fathryon is the only one who is supposed to say that.\r<br />\r<br />[b]Q: I found a bug. What should I do?[/b]\r<br />A: Please write a post about it. Include as many details as you deem relevant. If you&#39;re a modder, the source scripts are packed in the .bsa should you wish to try and figure out where I went wrong.\r<br />\r<br />\r<br />[color=yellow][b]Uninstallation:[/b][/color]\r<br />I recommend uninstalling only if dropping the book isn&#39;t enough. To remove, simply delete the .bsa and the .esp files in your Skyrim data folder. Uninstalling, however, does not undo the following:\r<br />[list][*]changes to their confidence, aggression, assistance and morality.[/*]\r<br />[*]if their outfit was changed, they will now be naked.[/*]\r<br />[/list]\r<br />\r<br />I hope you will enjoy the mod&#33; If you do, please endorse and/or track. Also, feel free to check out my other completed mod[s]s[/s] and my blog:\r<br />[list][*][b][url=http://skyrim.nexusmods.com/mods/43529/]Miraak - Dragonborn Follower[/url][/b] = Have the antagonist of the Dragonborn DLC as your follower&#33; In addition to weapons and spells, he also uses a variety of shouts semi-intelligently. His in-game dialogue has also been copied and edited in order to make him a &#34;fully voiced&#34; follower. The mod also comes with two regular, boring followers.[/*]\r<br />[*][b][url=http://skyrim.nexusmods.com/mods/57393/]Stray Khajiit - Transforming Follower[/url][/b] = Travel with a Khajiit with the power to transform into several different creatures each with its own unique abilities.[/*]\r<br />[*][b][url=http://www.nexusmods.com/skyrim/mods/58069/]Better Dead Thralls[/url][/b] = Improves the Dead Thrall spell to give you greater control over your thralls and make the use of thralls more convenient.[/*]\r<br />[/list][url=http://tfskyrim.drupalgardens.com/content/my-completed-mods][img]http://i.imgur.com/FoPztus.png[/img][/url]\r<br />\r<br />Finally, not my mod but [url=http://www.nexusmods.com/skyrim/mods/36913]MFVM - More Follower Voices Mod Plus Khajiit Marriage[/url] combos quite well with this.",
  "categoryId": "96",
  "version": "1.1",
  "author": "transientfaith",
  "createdUnix": "1378355106",
  "updatedUnix": "1378821503",
  "containsAdultContent": false,
  "uploadedBy": "transientfaith",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052350",
      "name": "Almost Everyone is An Adventurer -version 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28",
      "fileName": "Almost Everyone is An Adventurer-41629-1-0.zip",
      "uploadedUnix": "1378348777",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/01893c6bbf635edb53426ffa9785c99e7a05b13275a49e2159cc53d83cb7eb4e/analysis/1407709397/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Almost%20Everyone%20is%20An%20Adventurer-41629-1-0.zip?fid=1000052350&ttl=1535822426&ri=8192&rs=8192&setec=88cb0ce107a5806c9e1890cc60d93631"
    },
    {
      "fileId": "1000053712",
      "name": "Almost Everyone is An Adventurer -version 1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30",
      "fileName": "Almost Everyone is An Adventurer-41629-1-1.zip",
      "uploadedUnix": "1378821503",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8925d7640f26649b29f9fe62f49e639d31a410b410631743c83f82023d9aa84a/analysis/1407717488/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Almost%20Everyone%20is%20An%20Adventurer-41629-1-1.zip?fid=1000053712&ttl=1535822427&ri=8192&rs=8192&setec=c7766713c569eccff78b37a3fc101616"
    }
  ]
}