{
  "modId": 41631.0,
  "modName": "Alora of Yngvild",
  "summary": "Adds a cheerful and peppy draugr female who can be picked up as a follower.  She is also a candidate for marriage.  Lore-friendly.  No, really - it\\'s lore-friendly.",
  "descriptionHtml": "\\\"Alora was once just an ordinary draugr in Yngvild until Arondil the necrophiliac necromancer came along.  As is recorded in his journals, Alora was his greatest success before he managed to figure out how to create his ghost slave-girls, who are (according to his journals) more enjoyable.  Alora was then delegated handle the bodies of Arondil\\'s victims while he enjoyed the company of their much more attractive ghosts.\\\"\r\n\r\nLore friendly - the character\\'s existence is now mentioned in Arondil\\'s journals, and fits well with the necromantic experiments he was already established as doing.  She is found precisely where Arondil\\'s journals now say she is - in the last room of Yngvild, tending to the three corpses there.\r\n\r\nFollower - Though she\\'s not all that good at it (she is, in the end, still a draugr), she can accompany the dragonborn.  She\\'s not stealthy, but she\\'ll hang back when you\\'re being stealthy and is quick on her feet when she needs to run up and scrap something - or just keep up with your horse-riding character.\r\n\r\nMarriable - For those who want to, yes, you can marry her.  Please note, however, that you need to CATCH her before she runs out the church at the end of the wedding and tell her you want to live in YOUR house.  As soon as Maramal pronounces you married and she turns to run off, tab out of the conversation and run after her.  Why?  Hey, HER home, such as it is, is the room in Yngvild where you first found her.  You don\\'t wanna have to chase her all the way back there, and she really is quick on her feet.  As either wife or simply companion, she will occasionally give you gifts.  Alora, however, is a total sweetheart and always gives you flowers.\r\n\r\nMod and DLC Compatiblity:  As the character was built entirely using the base game data for Draugr, there should be no conflicts with any mods or DLC.  If you have a mod that changes how draugr look or whatever, well, it will change her, too - she\\'s basically a draugr who interacts with you instead of trying to kill you.  For those using Dawnguard, the quest-excluding \\'vampire\\' keyword was added to her - this is so Vingalmo won\\'t pop the quest for you to turn her into a vampire, which you couldn\\'t do anyway.\r\n\r\nIssues:  Though you can give her armor and she\\'ll equip it, it won\\'t appear on the character.  This is because it would have required me making a huge amount of new meshes for draugr to wear, and that wasn\\'t happening.  Also, if you give her a hat or helmet, her hair disappears but the hat or helmet doesn\\'t show.  Sorry, I\\'ll leave that to someone else to tinker with.\r\n\r\n------------------------------\r\n\r\nCopyleft:  So long as you give me credit for the original creation, feel free to alter this upload for your own work in any way you wish.\r\n\r\n------------------------------\r\n\r\nJim Farris\r\nxaa@3lefties.com",
  "categoryId": "96",
  "version": "1.0",
  "author": "Jim Farris",
  "createdUnix": "1378355376",
  "updatedUnix": "1378355317",
  "containsAdultContent": false,
  "uploadedBy": "Xaa1962",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052359",
      "name": "Alora of Yngvild",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Alora of Yngvild-41631-1-0.zip",
      "uploadedUnix": "1378355317",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/48b99a3a9dbcde12659dd872e9d6a2beaa0d1837d0ce62da5f895aa4850a83f6/analysis/1407709513/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alora%20of%20Yngvild-41631-1-0.zip?fid=1000052359&ttl=1535822429&ri=8192&rs=8192&setec=404c36e055d4bb972c3205d9f53fe731"
    }
  ]
}