{
  "modId": 41643.0,
  "modName": "-ISI- Staves of Skyrim - Bastones de Skyrim SPANISH",
  "summary": "Traduccion del Mod Staves of Skyrim",
  "descriptionHtml": "[center][font=GungsuhChe][b][size=30][color=blue][u]MODS ISIDOROJO[/u][/color][/size][/b][/font]\r\n\r\n\r\n\r\n[size=+1]Un endorse siempre es de agradecer ^^\r\n\r\n[u]Es necesario descargar el mod original:[/u]\r\nhttp://skyrim.nexusmods.com/mods/22691/?\r\n\r\nÉsta es la traducción completa del mod de Kearsage \\\"Staves of Skyrim\\\". Éste mod añade gran cantidad de bastones y varas de diversas formas y materiales, además de texturas. Lo que más llama la atención de éste mod es la modificación del estilo de lucha con los bastones. Ahora, son como escudos, pudiendo parar golpes con ellos, y usarlos además con su magia.\r\nTambién, para dar mayor emoción al uso de los bastones, se ha creado una nueva rama de habilidades conjunta con el Bloqueo para mejorar la potencia de los hechizos de Bastón y mejorar la capacidad de bloquea con los mismos.\r\nHe aquí la descripción del mod por el autor:[/size]\r\n\r\n---------------------------------------------------------------------------\r\n\r\n? ? Características\r\n\r\n30 Nuevos bastones añadidos al juego! 15 nuevos modelos y texturas , además de nuevas texturas para los modelos por defecto\r\nBastones defensivos! Tu mago ya no tiene que llevar un escudo para defenderse contra espadachines\r\nConversión personal! Podrás transformar tu bastón entre un bastón defensivo y un bastón mágico sobre la marcha. Cargue tu bastón con tu mana en vez de con gemas de alma\r\nNuevos Perks ! Mejorar la capacidad defensiva de tu mago con nuevos Perks en el Árbol Bloquear\r\nCapacidades mejoradas para bastones daédricos y especiales! Convertir a un equipo defensivo, iluminar o recargar de nuevo a un bastón mágico a voluntad\r\n\r\n\r\n? ¿Dónde conseguir los nuevos bastones? ?\r\n\r\n1 - Matar hechiceros enemigos. Las varas se han añadido a las listas formuladas de magos enemigos, brujos y otras ruedas, así como algunos cofres.\r\n2 - Elaboración. Todos los bastones se pueden crear en la forja, y se desbloquearán a medida que mejores las habilidades de herrería.\r\n3 - Los vendedores. Los bastones se han añadido a las listas formuladas de Wizards Corte.  Además, Rindirsen, un proveedor personal que se desplaza, se ha establecido un campamento en las afueras del puente a la universidad del mago en Hibernalida para vender sus varas a los magos aspirantes. Las varas disponibles aumentarán a medida que subes de nivel .\r\n\r\nRequisitos ? ?\r\nBastones de Skyrim requiere Skyrim Script Extender ( SKSE ) desde la versión 1.6 . Esto es necesario para procesar los nuevos scripts de conversión personal.\r\nUsted puede obtener SKSE aquí: http://skse.silverlock.org\r\n\r\nSi no deseas utilizar SKSE, no tienes porque descargarlo, sin embargo, no serás capaz de cambiar entre magia enfocada y salvaje, y todos los bastones convertidos se volverán por defecto en la bola de fuego / Icespike / Descarga de relámpagos.\r\n\r\nPor lo tanto, si no deseas conseguir SKSE, y no les importa usar palos predeterminadas - todo lo demás en el mod funciona muy bien!\r\n\r\n? ? Bastones defensivos\r\nLos Bastones defensivos vienen en variantes armaduras tanto ligeros como pesados.\r\n\r\nLos Bastones son más o menos equivalente a la del escudo del mismo material. Por lo tanto, el Bastón élfico tiene aproximadamente los mismos stats como un escudo élfico, y los bastones de madera, son aproximadamente como el cuero.\r\n\r\nTodos los bastones han elaboración recetas que abren con las ventajas en el Árbol de herrería .\r\n\r\n\r\n? Nuevos Perks ?\r\nUn nuevo beneficio ahora se sienta al lado del árbol de bloque (y es parte de la habilidad Bloquear ) .\r\nAlgunas de las ventajas básicas del bloque trabajará con bastones (y viceversa ) , pero la mayoría requieren el uso de uno u otro . Además de bloquear beneficios específicamente para tu bastón, el árbol desbloquea nuevos hechizos para que tu bastón sea aún más versátil. Estos ataques también se pueden aprender mediante Tomos que vende Rindirsen, el vendedor de bastones en Hibernalia, a pesar de que son muy caros para comprar.\r\n\r\nBastones Iluminación :\r\nIlumine su personal para iluminar las zonas oscuras echando Ilumine Personal . Moldeada Ilumine personal nuevo para desactivarla. Un personal iluminado no es una antorcha re -pelado , y todavía se puede utilizar para bloquear / bash como un escudo.\r\n\r\nBastones cargados :\r\nConvertir su personal para disparar Fuego / Hielo / magic choque para 300 mana . Nuevamente el hechizo para recargar su personal. No es necesario usar gemas de alma para recargar : recarga la Magia del personal. Para convertir una plantilla cargada de nuevo a un personal Defensivo , utilice el \\\"Staff Descarga\\\" menor poder . Esto no cuesta mana para lanzar , ya que se aprende cuando se aprende el poder \\\" Iluminar personal\\\" .\r\nAdemás , Bastones cargadas sinergia tanto con habilidad destrucción ( para aumentar su daño hecho ) y el Bonus de alteración (que disminuye el costo de carga de lanzar ) .\r\nNo se puede vender un personal encargado . Ningún vendedor quiere tener un personal que está erizada de energía elemental . Aprobación de la gestión en primer lugar y convertir de nuevo a un personal Defensivo venderlo .\r\n\r\n\r\nCompatibilidad ? ?\r\nEste mod puede entrar en conflicto con otros mods que suceden a modificar las mismas listas niveladas . También entrará en conflicto con mods que cambian el árbol Perk Block. Basta con ajustar el orden de carga para cambiar el mod recibe prioridad.\r\n\r\n\r\n? ? Archivos opcionales disponibles\r\nSkyre versión Compatibilidad - Fusiona Bloque Perks árbol de habilidades tanto de Skyre y Pentagramas de bloque Perks árbol de habilidades de Skyrim para lograr que el mejor de ambos. Tenga en cuenta que algunos de los beneficios del bloque de Skyre no puede trabajar con bastones .\r\nSkyre defensa Compatibilidad modificado - Igual que el parche de compatibilidad Skyre , pero modifica los valores de las armaduras bastones defensiva \\\" para estar más en línea con los valores de la armadura de Skyre . Gracias a Steelsouls para poner esto juntos !\r\nNinguna versión Perk - No agrega los nuevos Perks bloque o cambiar el árbol de Block. Ventajas de vainilla se modifican para ser compatible con los nuevos duelas . Ventajas Personal del lado / hechizos / habilidades están a la venta a partir Rindirsen .\r\n\r\nAgradecimientos ? ?\r\nUn agradecimiento especial a 747,823 para hacer sus modelos de personal disponible para su uso . Ellos formaron la base para varios de los nuevos modelos de este mod .\r\n\r\n-----------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n\r\n[size=+1]Intentaré mantener la traducción actualizada según se actualize el mod.\r\n\r\nMuchas gracias.\r\n\r\nP.D.: Si detectan un error en la traducción, comentármelo e intentaré arreglarlo con la mayor brevedad posible.\r\nP.D.2: Si quieres que traduzca un mod en concreto, mándame un mensaje y lo estudiaremos.[/size]\r\n\r\n[b]---------------CREDITS---------------------\r\nMod´s author: Kearsage \r\nTranslate´s author: Isidorojo\r\n-----------------------------------------------[/b]\r\n\r\n\r\n\r\n\r\n[font=GungsuhChe][b][size=+3][color=blue][u]OTROS MODS TRADUCIDOS POR MI[/u][/color][/size][/b][/font]\r\n\r\n\r\n[size=+1][b][color=yellow][u]ARMADURAS Y ARMAS[/u][/color][/b][/size]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/42556/?][b][color=yellow]-ISI- Aesir Armor - Armadura Aesir SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/41556/?][b][color=yellow]-ISI- Alduins Wings - Alas de Alduin SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/41717//?][b][color=yellow]-ISI- Avatar of Balthazar - Adalid de Balthazar SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/42566/?][b][color=yellow]-ISI- Berserk armor and weapon - Armadura y arma Berserk SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/42428/?][b][color=yellow]-ISI- Demon Hunter Armor - Armadura Cazador de Demonios SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/42829/?][b][color=yellow]-ISI- Devilmaid by Neo - Doncellas del Diablo SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/42572/?][b][color=yellow]-ISI- Knight Of Thorns armor - Armadura Caballeros del Dolor SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/41689/?][b][color=yellow]-ISI- Raven witch armor - Armadura de la Bruja Cuervo SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/42138/?][b][color=yellow]-ISI- StormLord - Jarl de Tormenta SPANISH[/color][/b][/url]\r\n\r\n\r\n[size=+1][b][color=yellow][u]PUEBLOS, CASTILLOS, LUGARES[/u][/color][/b][/size]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/41980/?][b][color=yellow]-ISI- Ebonvale - Traduccion SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/43461/?][b][color=yellow]-ISI- Sjel Blad Castle - Castillo de Sjel Blad SPANISH[/color][/b][/url]\r\n\r\n\r\n[size=+1][b][color=yellow][u]RAZAS, SEGUIDORES, MONTURAS[/u][/color][/b][/size]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/42776/?][b][color=yellow]-ISI- Black Armored Unicorn - Unicornio Negro Acorazado SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/42576/?][b][color=yellow]-ISI- Gnome playable race - Raza Gnomos SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/43369/?][b][color=yellow]-ISI- Healing Spriggan Pet - Mascota Spriggan Curandero SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/42660/?][b][color=yellow]-ISI- Skeleton Demonic Horse - Caballo Esquelético Demoníaco SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/42942/?][b][color=yellow]-ISI- Succubus Race - Raza de Súcubos SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/41623/?][b][color=yellow]-ISI- Temptress Race - Raza Tentadoras SPANISH[/color][/b][/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/43285/?][b][color=yellow]-ISI- The Dryad - Raza Dríadas SPANISH[/color][/b][/url]\r\n\r\n\r\n[size=+1][b][color=yellow][u]INMERSIONES A GRAN ESCALA[/u][/color][/b][/size]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/40879//? ][b][color=yellow]-ISI- Vile art of Necromancy - Vil arte de la Nigromancia SPANISH[/color][/b][/url]\r\n[/center]",
  "categoryId": "54",
  "version": "",
  "author": "Isidorojo",
  "createdUnix": "1378403932",
  "updatedUnix": "1378403896",
  "containsAdultContent": false,
  "uploadedBy": "Isidorojo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052476",
      "name": "Staves of Skyrim - Bastones de Skyrim SPANISH",
      "version": "v1.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40",
      "fileName": "Staves of Skyrim - Bastones de Skyrim SPANISH-41643-.rar",
      "uploadedUnix": "1378403896",
      "modVersion": "v1.8",
      "virusScanUrl": "https://www.virustotal.com/file/ff6ecf358fe2aab557db607178e510e05e02acc716959e9230d0214d70b9c7d1/analysis/1407710195/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Staves%20of%20Skyrim%20-%20Bastones%20de%20Skyrim%20SPANISH-41643-.rar?fid=1000052476&ttl=1535822451&ri=8192&rs=8192&setec=2777c5d72aabbbbf7163baf0867cf408"
    }
  ]
}