{
  "modId": 41641.0,
  "modName": "Mans1ay3r Ass Bandit War",
  "summary": "This is a mod I put onto steam a while back and thought it deserved the right to have it\\'s hold on the nexus",
  "descriptionHtml": "In the Skyrim Gamer Poop Man1slay3r references such perveted people called the ??? bandits, so i took the time to create an army of these so called ??? Bandits attacking each major town (WARNING MAKE SURE YOU ARE READY TO FIGHT THESE GUYS FOR THEY HAVE REALLY OP WEPS) and for fun i added in four Bosses hidden throughout the tundra of Skyrim can you find them all? \r\n\r\nThis Mod includes \r\n- 4 new weapons and a new arrow brand \r\n- 6 types of ??? Bandits each a different rank \r\n- A new spell \r\n- Even a backstory to these creepy ??? lovers \r\n-2 New races: ??? Slayer and Ex ??? Bandit \r\n-Winterhold and Morthal are under attack better get to saving, also there are mini wars outside Windhelm and Whiterun, can you find them? \r\n-Fixed the A.I.D.S Needle bug \r\n-New NPC ???-assin \r\n-Man1slay3r Follower \r\n-??? Slayer Follower \r\n-Even more varients for the ??? Bandit Army! \r\n-Rorikstead and the Shrine to Azura seem to have some very special visitors pay them a visit to see whats going on \r\n-An ??? Slayer in Whiterun now how has some dialogue options (Which eventually will be a quest) \r\n\r\nUpdate \r\n-2 New Races: Cockblocker and A.I.D.S Core Warrior \r\n-Rubbing of the Nipples Shout is added to the game \r\n-Island of the ???\\' is now added to the world of Skyrim up the in the north-west \r\n-Left Nipple Island is now visitable (sorry if enemies are idiots, but i can\\'t help that :P ) \r\n-???-assin race is now added \r\n-Right Nipple Island is now visitable go there and Slay the ??? Bandit King the Assokhiin! \r\n-??? Bandits have now invaded Aftand and Sovenguard can you kill them? \r\n-Fixed the ???? Mongers glitch \r\n\r\nComing Soon \r\n-War quest line \r\n\r\n(If you want to know the story i have given the ??? bandits there are 2 books; One is on Aela the Huntress so pickpocket it off her or something and the second is in the Sleeping Giant Inn in Riverwood) \r\n\r\nGive me some feedback and if i get some good feedback i will make more to this if you guys want, and if you guys want something done tell me and i will get right on it \r\n\r\nUpdate 2013: Yeah I am sorry my dear fans of this mod I decided to make, but there is a big problem....I can\\'t make the storyline because the creation kit is an ??? clown and you need a specific resolution to even think of making a quest, so sorry I had to announce this, but I might continue updating this mod every now and agin",
  "categoryId": "79",
  "version": "1.0",
  "author": "Officer Daybook",
  "createdUnix": "1378376682",
  "updatedUnix": "1378376682",
  "containsAdultContent": true,
  "uploadedBy": "Daybook",
  "primaryFile": null,
  "files": []
}