{
  "modId": 41653.0,
  "modName": "Destruction Revamped",
  "summary": "Three new perks and nine new spells.",
  "descriptionHtml": "Three new Perks added to Augmented Flames, Augmented Frost and Augmented Shock. \r<br />\r<br />Nine new spells \r<br />\r<br />Sub Zero Blizzard \r<br />Sub Zero Frostbite \r<br />Sub Zero Ice Storm \r<br />Sub Zero Icy Spear \r<br />Sub Zero Wall of Frost \r<br />\r<br />Aetherius Flames \r<br />Wall of Aetherius Flames \r<br />\r<br />Magnus&#39;s Sparks \r<br />Magnus&#39;s Wall of Storms \r<br />\r<br />This is the new version of my original mod Frost Spells Revamped. All revamped perks and revamped frost spells remain the same. The four new spells added complete this mod. Like all my mods, this one offers better gameplay experience, progression of a char, the desired look and most importantly of all...balance. You can use this mod in two ways. You can progress a new char since no original spells have been touched and you&#39;ll still need 80 points in destruction for each of the new perks, or you can use your old char and switch it up to legendary game play settings. \r<br />Don&#39;t be fooled by other milk drinker mods, this mod has been tested, retested and then tested again for quality assurance. This is another mod from my personal collection. \r<br />\r<br />=========================================================================================== \r<br />\r<br />New Frost Spells Features \r<br />\r<br />Like I stated above, these spells remain the same from the the original version. For the new visitors. Some spells look the same, some spells look differant but all are unique in there own way and kick @ss. Use the old frost spells then use these. You&#39;ll see the differance. They have been Revamped &#33;\r<br />\r<br />=========================================================================================== \r<br />\r<br />New Flame Spells \r<br />\r<br />If you have ever dabbled with the creation kit or didn&#39;t know, know that modifying spells confined to the creation kit is in a small degree, limited. Anyways, fire is hot and hurts correct ? Well now you have a new spell. A Wall of Aetherius Flames that will actually burn your opponents much much better. And for an added graphic bonus, after the b@stards are dead, they remain on fire for a little bit, check that out, neat stuff. Aetherius Flames has the same burning effect and feels the same as normals flames but is much much better. The goal here for both new spells was to add power to a spell that looked good but lacked power. \r<br />\r<br />=========================================================================================== \r<br />\r<br />New Shock Spells \r<br />\r<br />These two new spells are actually pretty cool. They look and feel like the original vanilla spells but they absorb magicka to you aswell. Compare these new spells with the old vanilla spells, you will not be disappointed. \r<br />\r<br />=========================================================================================== \r<br />\r<br />Where do I get these amazing perks and spells ? \r<br />\r<br />Jump on your horse, head over to the College of Winterhold and speak to Faralda. \r<br />\r<br />Check out my other mods, please endorse and send me feedback.",
  "categoryId": "75",
  "version": "1.4",
  "author": "Revamped",
  "createdUnix": "1378396877",
  "updatedUnix": "1378396568",
  "containsAdultContent": false,
  "uploadedBy": "colinsnexus76",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052440",
      "name": "Destruction_Revamped",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Destruction_Revamped-41653-1-4.rar",
      "uploadedUnix": "1378396568",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/a4ecebf87779d0f9cafdbc7326a31f709eea2bf8e02450cb0525119ae43c7a6c/analysis/1407709936/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Destruction_Revamped-41653-1-4.rar?fid=1000052440&ttl=1535822459&ri=8192&rs=8192&setec=ef89ba360f1032069985d583bdc62149"
    }
  ]
}