{
  "modId": 41670.0,
  "modName": "Grey Palace",
  "summary": "This mod is a massive d&d styled like dungeon/player home i am focusing this on 2 custom races and dwemer in how i perceive them, it contains some sweet loot, interesting enemies, and coming soon a massive palace for the dragonborn.",
  "descriptionHtml": "[center]\r<br />[color=#0d0e6e]This is my first mod.[/color]\r<br />\r<br />[color=red]W.I.P[/color]\r<br />\r<br />[color=red]This is currently released in developer mode. It isn&#39;t ready for full release yet, aswell as being in hibernation for quite awhile. \r<br />I&#39;ll be joining the army really soon and won&#39;t have time to put into this, i&#39;ve made a couple updates since i lost a years worth of bug fixes and changes to the palace and will upload that to showcase the little bit i did get to do, it&#39;s not much and needs alot more work but is the beginning. It&#39;s far from dead lol[/color]\r<br />\r<br />[color=green]Only High level Characters, due to the difficulty of the enemies.[/color]\r<br />\r<br />This mod adds a player castle/cave home next to winterhold that will contain 3 entrance areas to reach the palace and will have player guards that will help the player via selling and buying items, special spells, weapons, armor and protecting them when in trouble. It will have a special area that contains all the main stones and shrines, it will contain a big dungeon that will eventually lead you to the main chamber of the grey palace which will be the players home.  The dwemer will be based from what i percieve them as, for now it is 3 standalone entrances to reach a massive dungeon/palace, it has a kinda d&d type feel. when im free again i will be changing this massively and will end up making it a whole new quest leading to the underground cities of the last remaining dwemer, that were a split faction from when most of them were wiped out and i&#39;m also working on a specific disease dealing with dwemer and votmer that will be exclusively awesome&#33;\r<br />\r<br />[color=red]Needs; Dawnguard.esm / Dragonborn.esm / Update.esm / Hearthfire.esm[/color]\r<br />\r<br />I will be giving credits to those that test it and would like their name to be mentioned, if so please message me and i will add you to the credits when i get time to create them.\r<br />\r<br />if anyone finds a bug or two please feel free to either help me fix it or point it out&#33; :) thanks in advance.[/center]\r<br />---------------------------------------\r<br />ChangeLog:\r<br />\r<br />v1.0.0\r<br />[x] make a custom race of enemies\r<br />[x] finish the custom race\r<br />[x] make a disease that were made from dwemer experiments\r<br />^&#34;[u]info will be disclosed upon full release of beta[/u]&#34;^\r<br />[x] add a secret area near the skyrim entrance\r<br />[x] finish the secret area next to the skyrim entrance\r<br />[x] add guards in the grey palace\r<br />[x] add a mini boss in the magma chamber\r<br />[x] add Three Entrance Areas\r<br />[x] add the Skyrim Entrance next to Winterhold\r<br />[x] add guards in the 1st main entrance\r<br />[x] add the Grey Palace\r<br />[x] Add conjuration spells for the dwarven sphere, dwarven centurion, dwarven spider, lurker, werewolf, armored frost troll, seeker, vampire lord, chaurus hunter, chaurus reaper, dragon lord, dwarven ballista, and gargoyle\r<br />[x] add a big alchemy based area in the 3rd entrance\r<br />[x]add a volcanic area that is made by a dwemer rig that sucks up magma from below and releases it into the area, while protecting everyone from the heat using Ancient Dwemer Magic\r<br />[x] add a shrine/stone place near the magma area\r<br />[x] update glitches and fixed a good chunk of it\r<br />[x] cleaned greypalace with TES5Edit v3.0.30  3x\r<br />[x] cleaned greypalace with TES5Edit v3.0.31\r<br />[x] fixed some missplacements\r<br />[x] connected the water chamber with the main stairs in the 1st entrance\r<br />[x] updated some of the enemies\r<br />[x] release a dev preview\r<br />--------------------------------------------\r<br />[TBA] finalized all navmeshes\r<br />[TBA] finish the entrance areas\r<br />[TBA] add Ragnorok, Vieljyn, and Ignis Spiritus. Wich are a Greatsword, a Crossbow, and a Battleaxe\r<br />[TBA] add a book to tell of the lore of the weapons\r<br />[TBA] add a room that contains the chests from the developers room qasmoke and a couple extras\r<br />[TBA] finish the palace\r<br />[TBA] finish the disease\r<br />----------------------------------------------------\r<br />[color=red]Dev Note: i&#39;m needing help with the disease, patrols, the navmesh cause my ck only allows me to do the minimum, and debugging.[/color]",
  "categoryId": "68",
  "version": "1.0.0",
  "author": "GhostTech",
  "createdUnix": "1378405308",
  "updatedUnix": "1386748427",
  "containsAdultContent": false,
  "uploadedBy": "GhostTech",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086291",
      "name": "GreyPalaceDevPreview",
      "version": "1.0.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "717",
      "fileName": "GreyPalaceDevPreview-41670-1-0-0.7z",
      "uploadedUnix": "1386748427",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/65c380d002a3c494ea7f6165b09c4dd2921d44d73a3ea54780a0996a81b2f106/analysis/1407830824/",
      "changelogHtml": " Added Three Entrance Areas <br/> \n Added the Skyrim Entrance next to Winterhold <br/> \n updated glitches and fixed a good chunk of it <br/> \n fixed a couple duplicates and disabled the objects i originally deleted for better mod compatability <br/> \n added the dwemer magick seal that ensures you don&#39;t die in the magma chamber <br/> \n fixed some more glitches <br/> \n finished the dwemer magma pump <br/> \n added a volcanic area that is made by a dwemer rig that sucks up magma from deep below and releases it below the area <br/> \n added a shrine/stone place in the magma chamber <br/> \n cleaned greypalace with TES5Edit v3.0.30  3x <br/> \n added a secret area next to the skyrim entrance <br/> \n added guards to the 1st main entrance and the greypalace <br/> \n made a custom race of enemies that were made from dwemer experiments <br/> \n added a mini boss in the magma chamber <br/> \n added ragnorok and vieljyn <br/> \n Added conjuration spells for the dwarven sphere, centurion, spider, lurker, werewolf, armored frost troll, seeker, vampire lord, chaurus hunter, chaurus reaper, dragon lord, dwarven ballista, and gargoyle. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GreyPalaceDevPreview-41670-1-0-0.7z?fid=1000086291&ttl=1535822492&ri=8192&rs=8192&setec=45387051715e8bcc1293ebf08522c155"
    }
  ]
}