{
  "modId": 41677.0,
  "modName": "Dovahkiin Gear Revamped",
  "summary": "Three new sets of light armor designed for combat mages.",
  "descriptionHtml": "With so many mods out there with improved this and improved that, what makes this mod so special ? Well nothing lmao, this is a mod from my personal collection, so I can tell you its awesome already =). Like all my mods, this one offers better gameplay experience, progression of a char, the desired look and most importantly of all...balance. If you like playing a mage, then this is the mod for you. Have you always wanted greybeard robes or Psijic Order robes and better starting mage gear but unable to figure out the creation kit or have no time ? I made this mod for me and for you. Enjoy fellow mages. \r<br />\r<br />=========================================================================================== \r<br />\r<br />New Armor Features \r<br />\r<br />Life as a mage can get rough, you can be one shotted. Solution, light armor. The ideal that mages have to wear pajamas is rubbish. You can improve all seven pieces all the way up to legendary. The robes, the hood, the gloves and the boots. Each piece has amazing enchants on them but yet still balanced for progression. \r<br />\r<br />=========================================================================================== \r<br />\r<br />Jewelry Features \r<br />\r<br />Going with my Jewelry Revamped mod ideal, I incorporated six pieces of jewelry, three rings, three necklaces and three circlets. Again, all these pieces have proper enchantments and can also be improved to legendary at the workbench except the starting gear.\r<br />\r<br />=========================================================================================== \r<br />\r<br />Reforge Features\r<br />\r<br />As your progress your char and seek more power you can reforge the two sets using the gear you already have at the blacksmiting forge. What this does is frees all the enchantments and creates a whole new set with there base armor value increased. Once that is done, you can custom fit or retemper the set at the workbench and put whatever enchantments you want on. Sounds silly ? , well not really. Its all about progression with skills isn&#39;t it ? To create a powerful set like this you will need the Dragon Armor perk.\r<br />\r<br />Ok, I like playing a mage, I play a mage already...wheres the loot ? \r<br />\r<br />You can only obtain the Ancient Dovahkiin loot from the ancient chest in High Hrothgar&#39;s courtyard. \r<br />\r<br />You can only obtain the Psijic Order loot from the coffin in the second level of the midden at the College of Winterhold.\r<br />\r<br />You can only obtain the Black Mage starting loot from the chest in Helgen Keep.\r<br />\r<br />If your play style is like me and you use combos with weapons and shields along with magic, theres  a hidden chest along the wall of Whiterun. Inside it has a neat shield =)\r<br />\r<br />Check out my other mods, please endorse and send me feedback.",
  "categoryId": "54",
  "version": "2.3",
  "author": "Revamped",
  "createdUnix": "1378416276",
  "updatedUnix": "1378415543",
  "containsAdultContent": false,
  "uploadedBy": "colinsnexus76",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052522",
      "name": "Dovahkiin Gear Revamped",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "324",
      "fileName": "Dovahkiin Gear Revamped-41677-2-3.rar",
      "uploadedUnix": "1378415543",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/22ba7f72e6987a20c27edecd323974e229582d7f630bd35b52b977a27a0c4c35/analysis/1407710466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovahkiin%20Gear%20Revamped-41677-2-3.rar?fid=1000052522&ttl=1535822497&ri=8192&rs=8192&setec=2d209e69ae17ce99a1d5c99b3e45a32a"
    }
  ]
}