{
  "modId": 41704.0,
  "modName": "Just More Blades for Sky Haven Temple",
  "summary": "Recruit any 30 followers to become a Blade. Uses the vanilla Sky Haven Temple. There are no changes or additions to Sky Haven Temple except that you can now recruit any 30 followers to become a Blade. No DLC required.",
  "descriptionHtml": "Just More Blades for Sky Haven Temple\r\n 5Sept2013\r\n\r\nRecruit any 30 followers to become a Blade. Uses the vanilla Sky Haven Temple. There are no changes or additions to Sky Haven Temple except that you can now recruit any 30 followers to become a Blade. No DLC required.\r\n\r\nREQUIRED MODS\r\nNone, not even any DLCs.\r\nJust make sure that you have a legal version of Skyrim with all the updates.\r\n\r\n\r\nMAKE SURE THAT, Just More Blades, IS THE LAST MOD LOADED IN THE LOAD ORDER.\r\n\r\n100% Compatible with UFO and AFT. I have not checked this with other multi follower mods. That will be your task, if you use one of them.\r\n\r\n\r\nAfter the first 3 Blade Recruits, Delphine will tell you to talk to Esbern about Dragon Lairs, just like in the vanilla game. If this doesn’t happen or you can’t go Dragon Hunting, then you have a corrupted save game that happened before you installed my mod or a mod conflict. This is your problem to resolve, not mine.\r\n\r\nYou can keep getting Blade Recruits, go talk to Esbern and go Dragon Hunting (only the first three will go Dragon Hunting), or do something else.\r\n\r\nLeaving the cell and coming back to Sky Haven Temple will cause the new Blade Recruit to get into their Blade Armor.\r\n\r\nYou can keep going dragon hunting just like in the vanilla game. I didn\\'t change anything about that quest. Recruit as many Blades as you want, up to 30 maximum. Using console commands can break mods, don\\'t blame mod authors if their mods stop working for you or your game stops working. Use mods and console commands at your own risk. If you uninstall my mod, you\\'ll lose all your Blades. \r\n\r\nWill those NPCs return to the game like they were before you recruited them into the Blades? I don\\'t know.\r\n\r\nThe mod does what it says it will do.\r\n\r\nAll Blade Recruits are still followers you can use.\r\n\r\nBlade Recruits 1 through 3 are set to essential just like in the vanilla game, which means they can’t be killed. Bethesda did this so that quests and scripts would not stop working if one of those recruits died. These Blades have schedules for training, guard duty, and sleeping at Sky Haven Temple.\r\n\r\nBlade Recruits 4 through 30 can be killed.\r\n\r\nRemember, once you reach your maximum number of Blade Recruits, you will not get any more.\r\n\r\n\r\nFor a list of Bethesda Followers go here,\r\nhttp://www.uesp.net/wiki/Skyrim:Followers\r\n\r\n\r\nCustom Followers should work if the mod author created them like Bethesda intended followers to work. The best way to know, is to try them out.\r\n\r\n\r\nSTART OF UFO SPECIFIC INFO\r\n\r\nAll UFO users – You might not need to uninstall UFO, but you need to at least dismiss all of your followers. I\\'ve found out that the original Bethesda Rebuilding The Blade Quest doesn\\'t work with more than one follower at a time and my mod was built from that script. (Note: They might leave and head back to where you recruited them.)\r\n\r\nThe best way that I know is, if you haven\\'t started the Recruit More Blades Quest, then just dismiss all of your followers, install Just More Blades for Sky Haven Temple, activate it, recruit followers (one at a time, bring each one to Delphine one at a time like in the original game), dismiss each new recruit after you talk to Delphine. They will stay at Sky Haven Temple. Leaving the cell and coming back to Sky Haven Temple will cause the new Blade Recruit to get into their Blade Armor. After you’re through recruiting for a while, or have reached the maximum number of recruits I have set for this mod version, go get your followers and have fun with your new Blade Army. The number of followers and their dialog options are now controlled by UFO.\r\n\r\nTo get your Blade follower to give up their Blade Armor and wear something else, do the following,\r\n\r\n1) Have them as a follower.\r\n2) Tell them that they can dress better. This will put the Blade Armor into their inventory so that you can see and take it. They will still be wearing their Blade Armor.\r\n3) Take their Blade Armor and then give them the new armor that you want them to wear.\r\n\r\nEND OF UFO SPECIFIC INFO\r\n\r\n\r\nSTART OF AFT SPECIFIC INFO\r\n\r\nThis mod is 100% compatible with AFT if you follow the following steps.\r\n\r\nNOTE: Disable AFT’s Inventory Management before recruiting the follower into the Blades, so that it\\'s disabled when the follower gets its Blade armor. Re-enable it afterwards, then the armor will correctly appear in its inventory and can be improved at the forge or changed. If you don’t Disable AFT’s Inventory Management before you recruit the follower into the Blades, they will lose their weapons and armor, which you will not be able to get back.\r\n\r\n1) Have no followers before talking to Delphine to Recruit More Blades for the first time. This quest starts after Alduin’s Wall Quest completes.\r\n2) Go get a follower, (Only one at a time).\r\n3) After you have the follower, type the following in the console; Set playerfollowercount to 1\r\n4) Talk to Delphine about having a new recruit.\r\n5) Repeat steps 2, 3, and 4 for each follower.\r\n6) When you are finished recruiting all the followers you want for now, type the following in the console; Set playerfollowercount to 0\r\n7) Enjoy your new Blade Army.\r\n\r\nEND OF AFT SPECIFIC INFO\r\n\r\n\r\nKnown Issues\r\n\r\nnone\r\n\r\nEnd of Known Issues\r\n\r\nFAQ\r\n\r\nQ. When should I load the mod?\r\nA. As long as you haven’t entered Sky Haven Temple for the first time, you should be okay.\r\n\r\nQ. Is there a Paarthurnax solution, in this mod, where you don’t have to kill Paarthurnax?\r\nA. Not at this time.\r\n\r\nQ. Is this mod compatible with Recruit More Blades – SkyHavenTempleEnhanced?\r\nA. No, only use one. Just More Blades for Sky Haven Temple or Recruit More Blades – SkyHavenTempleEnhanced.\r\n\r\nQ. Why are only the first three Blades going outside Sky Haven Temple?\r\nA. Because, that is the way it’s designed. The other Blades will just stay in Sky Haven Temple until you take them as followers.\r\n\r\nEnd of FAQ\r\n\r\n\r\nUpdate History -\r\n\r\n5Sept2013 – Initial Release\r\n\r\n",
  "categoryId": "25",
  "version": "5Sept2013",
  "author": "ItsMeToo on Nexus and klcjr on Steam",
  "createdUnix": "1378431064",
  "updatedUnix": "1378429840",
  "containsAdultContent": false,
  "uploadedBy": "ItsMeToo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052625",
      "name": "JustMoreBlades",
      "version": "5Sept2013",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "JustMoreBlades-41704-5Sept2013.zip",
      "uploadedUnix": "1378429840",
      "modVersion": "5Sept2013",
      "virusScanUrl": "https://www.virustotal.com/file/8514567ddd70fd8342576ccbc8094ec79a6341ede761118aa97759db8b56d3ed/analysis/1407710823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/JustMoreBlades-41704-5Sept2013.zip?fid=1000052625&ttl=1535822521&ri=8192&rs=8192&setec=18fec1040bf1dbf6a9efd3021f0fde1b"
    }
  ]
}