{
  "modId": 41702.0,
  "modName": "Merchants Revamped",
  "summary": "Is your house or backpack full of misc items collected from your adventures. Is your chest full of swords and armor taken from slain enemies to the point where you can&#39;t even close the lid ? Do you think to yourself how am I supposed to gain fortune when I can only sell a few items at a time due to merchants only holding a few septims on hand. ",
  "descriptionHtml": "Is your house or backpack full of misc items collected from your adventures. Is your chest full of swords and armor taken from slain enemies to the point where you can&#39;t even close the lid ? Do you think to yourself how am I supposed to gain fortune when I can only sell a few items at a time due to merchants only holding a few septims on hand. Have you ever walked into the Riverwood Trader and thought to yourself, how does Lucan Valerius even stay in \r<br />business ? \r<br />\r<br />=========================================================================================== \r<br />\r<br />Merchants Features \r<br />\r<br />Simply adds more septims to most vanilla merchants. General Stores tweaked from between 3500 to no more then 9000 gold. No major changes on items or leveled items to keep the game balanced. \r<br />\r<br />=========================================================================================== \r<br />\r<br />Do you want to become a blacksmith for personal glory and actually master it in your life time ? Shouldn&#39;t you be taking the good fight to all the dragons and cut throat bandits all across Skyrim and not spend countless hours in a mine searching for ore ? You want to master you&#39;re skill as you see fit and leave the mining / farming for the simple folk. \r<br />\r<br />=========================================================================================== \r<br />\r<br />Blacksmith Features \r<br />\r<br />Again added more septims to most vanilla blacksmiths. Mineral ore was increased but nothing out of place. Ingots were also increased and again, nothing out of balance. Gold increased between 6000 to around 12000 depending on who it is. Also some blacksmiths have more or less ore / ingots depending on which city / town. All leveled items are left as is except leveled arrows to keep game balance. Visit you&#39;re local fletchers for hunter / ranger needs, they have been revamped &#33; \r<br />\r<br />=========================================================================================== \r<br />\r<br />Have you rode for hours or even days in search for alchemical ingredients. You finally reached the city on horseback, walk up the stairs with you&#39;re fingers crossed she will have atleast a few items. One bee, a few mushrooms and a healing potion &#33; For the love of Talos , WHY.....WHY. \r<br />\r<br />=========================================================================================== \r<br />\r<br />Alchemist&#39;s Features \r<br />\r<br />Another rework of septims adding gold to roughly 7500 to most. Three vendors have every vanilla ingredient with a very nice stock pile that I thought was pretty balanced. A few vendors stock pile are pretty much left as is but gold was slightly increased. Some vendors feel a little more random with there stock pile and again gold increased. \r<br />\r<br />=========================================================================================== \r<br />\r<br />Enchanter Features \r<br />\r<br />Added filled soul gems and empty soul gems to some court wizards with a slight increase to there gold aswell. \r<br />\r<br />=========================================================================================== \r<br />\r<br />FAQ \r<br />\r<br />Question: After I installed this mod , all or some of the vendors don&#39;t seem to have any increase in gold or items at all. \r<br />Answer: Wait 24 hours in skyrim game time and then go back to that paticular vendor. \r<br />\r<br />Question: I waited 24 hours and still no increase in gold. \r<br />Answer: Not every vendor in vanilla skyrim have an item or gold increase, check general stores and other major shops. The smaller vendors just outside in towns and cities have no modifications. I did modify the Khajiit caravans. \r<br />\r<br />Question: Is this mod compatible with most other mods. \r<br />Answer: Yes, this mod is a very straight forward basic modification of merchants chests. If your running other mods that modify merchants chests then you&#39;ll have to make your choice on which mod you want. \r<br />\r<br />Question: I only have a few mods and did everything that is listed above and still have problems. \r<br />Answer: I recommend a program called BOSS, this is a program that will set the correct load order for all your mods. \r<br />\r<br />Question: I have BOSS and did everything you said and I am still having problems. \r<br />Answer: Talos help you then, my hands are tied because this mod works perfectly fine. \r<br />\r<br />=========================================================================================== \r<br />\r<br />More Notes \r<br />\r<br />All changes to merchants and vendors are inventory based items only, no cosmetics or clothes or names changed. Its all strickly vanilla. The very few ingredients that were added to DG , HF and DB add on are not included in this mod. You can reach master level skills without using console commands, just use my mod =) \r<br />\r<br />Final Notes \r<br />\r<br />Merchants have a 30k limit, I will give a small example. For reasons of your own, you decide to purchase almost every item they have and now there gold is well over 30k. If you continue to purchase more items from them, there gold will increase. However, if you need to sell your other items to them, you will not receive the gold in the exchange. Plan ahead, if you need to purchase more then 30k worth of items from a merchant and sell your items aswell, sell your items first. Do not mistake this minor flaw as permanent, the merchants reset as they normally do. \r<br />\r<br />Check out my other mods, please endorse and send me feedback. ",
  "categoryId": "79",
  "version": "1.3",
  "author": "Revamped",
  "createdUnix": "1378428191",
  "updatedUnix": "1378427063",
  "containsAdultContent": false,
  "uploadedBy": "colinsnexus76",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052610",
      "name": "Merchants Revamped ",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Merchants Revamped -41702-1-3.rar",
      "uploadedUnix": "1378427063",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/c4907ca3477546b8d3c5c66aaf0da1723360cc59feb2602d37d98ce273247112/analysis/1407710720/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Merchants%20Revamped%20-41702-1-3.rar?fid=1000052610&ttl=1535822519&ri=8192&rs=8192&setec=711ba7fcb94eecb2c12c12d0192cc74a"
    }
  ]
}