{
  "modId": 41729.0,
  "modName": "Lyrah Kharin",
  "summary": "A cute Khajiit young follower that fights with dual swords and magic, also has god stealth skills ",
  "descriptionHtml": "[img]http://static1.nexusmods.com/110/mods/images/41729-1-1378477969.jpg[/img]\r\n\r\nThis Mod adds an \\\"Ancient Dwemer Fortress\\\" that intent to be an ultimate legacy player home for the Dragonborn.\r\n\r\n=========================================================================================\r\nShort Back Story::\r\n\r\nAges ago the powerful dwemer lord Halerus Q\\'raz build a fortress to hold his possessions and keep him away from the underground cities. Wile time passes he got very old and fearsome of other dwemer opportunists thats were already looking to keep his state after his death.\r\nHe managed to marry his only son Haegord with falkreath\\'s lord daughter as soon as she had age enough.....\r\nHaegord other way were not the kind of man to have a single woman and the marriage was denied by her father.\r\nHalerus suffered a premature death few years later, that his son Haegord guilt and subversive lord of underground city that owned his father a vast amount of money but still greed and wanted the rest.\r\nOne day the Lord attack the fortress with two thousand man and lots more automatons.\r\nHaegord and few brave man he had has resisted for long weeks but the numbers and greed prevailed over justice......\r\nHaegord got killed and his father fortress were ransacked and destroyed.....\r\n\r\nFew hundred years passed only ruins had last, and those ruins were found by an explorer making his way to High Hrothgar, this explorer camp on the ruins and continued his journey. But he returned, and at this occasion he was already known as one of the firsts Dragonborn destined to be a hero among the man.\r\nMany times he have returned to that ruins before decide that the place should be rebuilt and for the job he brought a friend, an expert constructor and his family to take the place as home and slowly restore those ruins to is glory days..\r\nReconstruct the old architecture were hard but possible with dragonborn\\'s help, scavenging old remains under lost dwemer underground ruins the materials and inspiration could be retrieved and applied.\r\n\r\nBut the Reconstruction took to long, The dragonborn of that age lived there for not many years before his final adventure that guide him to oblivion.\r\n\r\nThe Halerus fortress refereed only by Ancient Fortress by the nords were passed generations after generation of 1st constructor family but not habited only by them, some times used as safe house by peregrines or merchants caravans, during the generations passed every habitant has left his contribution for the place.\r\n\r\nNow days the old man Arthur that live at fortress claims to be the last member of first constructor bloodline,\r\ntogether with him few more people leave at the place and keep the things proper while take care of their own business.\r\n\r\nOnce Arthur heard the rumors about a new dragonborn has emerged on Skyrim he known that this new adventure should be presented to this place, because live at the fortress is on his fate as much as become the new Skyrim\\'s hero ....\r\n\r\nWelcome Home Dragonborn !!!!!!\r\n\r\n\r\n====================================================================================\r\n:: Features ::\r\n\r\n- Player Room\r\n- Office\r\n- Bath House\r\n- Kitchen\r\n- Library\r\n- Temple\r\n- Workshop\r\n- Laboratory\r\n- Npc Rooms\r\n- Stables\r\n- Vendor General shop\r\n- Throne room\r\n- Lots of weapons racks and manikins (some special)\r\n- Dungeons\r\n- Brewery\r\n- Arena\r\n- Special SECRET safe room (try to find you will be surprised )\r\n- Sky View Tower\r\n- All Navimeshed and tested exhaustively\r\n\r\n======================================================================================\r\n:: Installation ::\r\nSame as use to be, via NNM or manual stract at Skyrim\\'s folder\r\nactivate the \\\"ancient_fortress.eps\\\" at NMM or your loader\r\n\r\n:: How to find the place on game ??\r\nwell for now, open your map and find \\\"Ancient Fortress\\\" about right side of High Hrothgar\r\n(later you will have to do a quest and have some more requirements)\r\n\r\n:: UnInstallation and UPDATE\r\n1), Remove ALL your items from Ancient Fortress, (use console command \\\"tgm\\\" help with the weight)\r\nleave the place go to inside other house on preference\r\n2) save game and exit\r\n3) deactivate the Ancient_fort.eps\r\n4) Re-Rum skyrim and save just after\r\n\r\n===============================================================================\r\n\r\n:: Compatibility ::\r\nUntil now never found a mod that conflict,\r\nthis mod is full vanila, and was tested on clean installation also with my personal mod setup .. More than 100 mods including all DLCs, lights, ufo, \\\"my home is your home\\\" etc etc......\r\n\r\n==============================================================================\r\n\r\n:: About the mod ::\r\nI did this mod because i think i need a better place to live\r\ni don\\'t like to hide underground, don\\'t like to live in a big city with 2 long load doors every time\r\ni don\\'t think as a world hero i should live in a cottage forever i\\'m a collector i need space\r\n\r\n=================================================================================\r\n:: Future Plans:: NOT implemented yet !\r\n- Portals room to teleport player to different important places\r\n- NPCs and Quests (\\\"i\\'m not good on this i will try to find help\\\")\r\n- Heart Fire version\r\n- Spell to teleport the target a dungeons cell\r\n- Add some ghost or other mob to be spawned at arena\r\n====================================================================================",
  "categoryId": "96",
  "version": "1",
  "author": "Lynkx",
  "createdUnix": "1378476339",
  "updatedUnix": "1378476339",
  "containsAdultContent": false,
  "uploadedBy": "Lynkx",
  "primaryFile": null,
  "files": []
}