{
  "modId": 4172.0,
  "modName": "Breezehome Remodel - Workshop",
  "summary": "Optionally add crafting stations and storage containers to individual character\\'s Breezhome",
  "descriptionHtml": "Now compatible with fully furnished Breezehome!\r\n\r\nThank you for your interest in the Breezhome Remodel - Workshop mod!\r\n\r\nOptionally add crafting stations and extra storage to a character\\'s Breezhome house.\r\n\r\nThis mod does not work like most other modifications for Skyrim. Rather than adding a file to your Data folder, or running a background script or task everytime you play, this mod is run only when you want to make the changes to your character\\'s Breezhome (purchasable home in Whiterun).\r\n\r\nYou can use this to make custom changes for each of your characters, and their homes will stay as you create them even when this mod is no longer needed or running.\r\n\r\nThis mod is self contained, and does not require an outside script-engine for use.\r\n\r\nYou do not need Auto-Hotkey to use this mod--simply run the executable file from the download. But, this mod was made by and for Auto-Hotkey, and there is also a standard text-file script for folks who do already use this phenomenally useful utility.\r\n\r\nThis mod requires a certain ceramic pot from the default furnishings still be present in the Breezehome location. If you have removed the right side pot from the table under the weapon plaque in the loft, then you will need to reset the interior of Breezehome to use this mod. Instructions for this follow the general use instructions.\r\n\r\nPLEASE MAKE A NAMED-FILE SAVE OF YOUR GAME BEFORE ATTEMPTING THESE CHANGES. You have been warned, in ALL CAPS!\r\nThis script floods commands to the Skyrim console, keystroke by keystroke. It usually works, but can easily get off track, so SAVE A BACKUP FIRST.\r\n\r\nUsing the Breezhome Workshop Script for Auto-Hotkey\r\n1. Start the script using either the executable or text-file.\r\n2. In game, enter the Breezehome location.\r\n3. With the console closed (unopened), type the keystroke assigned to your desired changes.\r\n4. Wait for the script to complete, then quicksave and quickload the game to finalize the requested modifications.\r\n5. Exit the running script. You don\\'t need it anymore.\r\n\r\nBreezhome Workshop Options\r\nWhile standing inside Breezehome and this script running in the background, press these keys for these effects.\r\n[Ctrl+Shift+1] Add Enchanter and storage to the Alchemy alcove\r\n[Ctrl+Shift+2] Add storage barrels underneath stairs\r\n[Ctrl+Shift+3] Add a full Smithing workshop to the main living area (no smelter)\r\nWhen the script finishes, save and reload your game.\r\n\r\n\r\nThe right side jug from the table under the weapon plaque in the upstairs loft area must exist in Breezhome for this script to work. If it has been removed, you can recreate it through these steps.\r\n\r\n1. Collect all your items from inside the home that you wish to keep. Everything off the floor, shelves, and inside all containers. Some items and containers may survive this reset, but if you have everything in your personal inventory, temporarily, you will be safest.\r\n2. Go outside (in game). Open the console with the tilde key, then enter this command and hit enter, \\\"resetinterior WhiterunBreezehome\\\".\r\n3. Close console, quicksave then quickload, and reenter the home.\r\nYou can now use this mod, and re-sort your items into the conveniently added storage containers.\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "usenametaken",
  "createdUnix": "1324355911",
  "updatedUnix": "1325212381",
  "containsAdultContent": false,
  "uploadedBy": "UsenameTaken",
  "primaryFile": null,
  "files": [
    {
      "fileId": "12246",
      "name": "BreezehomeWorkshop",
      "version": "0.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "BreezehomeWorkshop-4172.zip",
      "uploadedUnix": "1324356134",
      "modVersion": "0.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/53e380005e9891f60cd559add60c8d0d8d61c7fa3ff1f5211dbf2ec7b2dc7b42/analysis/1406539024/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BreezehomeWorkshop-4172.zip?fid=12246&ttl=1535759751&ri=8192&rs=8192&setec=113b181840de681f9bfda077c8dfd5e6"
    },
    {
      "fileId": "12425",
      "name": "BreezehomeWorkshopViaAHK",
      "version": "0.2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "BreezehomeWorkshopViaAHK-4172.zip",
      "uploadedUnix": "1324415649",
      "modVersion": "0.2.0",
      "virusScanUrl": "https://www.virustotal.com/file/3ab7d1fdffe5d5141134f9c17f299ac854252d3a4852cc182d31ce5fd04ed35b/analysis/1406541125/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BreezehomeWorkshopViaAHK-4172.zip?fid=12425&ttl=1535759751&ri=8192&rs=8192&setec=a3f7c15fce9a4faf948a82ef5ec6cf2e"
    },
    {
      "fileId": "15009",
      "name": "Brezehome Remodel - Workshop",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "299",
      "fileName": "Brezehome Remodel - Workshop-4172.zip",
      "uploadedUnix": "1325212381",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/272da9ce6c76d3092f85626e93532bbec6c02926c5141324db8d69e62894f2d4/analysis/1406569343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brezehome%20Remodel%20-%20Workshop-4172.zip?fid=15009&ttl=1535759752&ri=8192&rs=8192&setec=ad44aa306d162b582f3bc0fb24eeae24"
    }
  ]
}