{
  "modId": 41754.0,
  "modName": "Aethernautics- A Space Travel Mod",
  "summary": "Your favorite space mod is back&#33; This is a quest mod that adds several new areas, a new weapon type, new armors, new enemies, and of course, a spaceship that has space travel&#33; Now with extra features and fixes by me&#33;\r<br />",
  "descriptionHtml": "DISCLAIMER: I did get permission to upload this mod from Trainwiz himself because we&#39;re butt buddies.  New features and bug fixes were also added by me&#33;&#33;&#33; Also with permission YAY&#33;&#33;&#33;\r<br />\r<br />[youtube]awFOC7-YdRM[/youtube]        [youtube]zIFVbd88_PY[/youtube]        \r<br />\r<br />&#34;Visit to Aetherius occur even less frequently than to Oblivion, for the void is a long expanse and only the stars offer portal for aetherial travel, or the judicious use of magic. The expeditions of the Reman Dynasty and the Sun Birds of Alinor are the most famous attempts in our histories, and it is a cosmic irony that both of them were eventually dissolved for the same reason: the untenable expenditures required to reach magic by magicka.&#34; \r<br />-Imperial Geographical Society \r<br />\r<br />Though thought impossible by lesser minds, the study and practice of travels to other realms via physical travel was long ago practiced by the great races of old. To them, it was known as mananautics, aethernautics, and &#34;Screw this, this rocketry stuff is too hard let&#39;s go kill babies&#34;. To us, it is known as space travel. While time has done its work on the Altmer and Imperials, their ancient starships lost to history and apathy, there have emerged rumors of the third race, the Dwemer, and their lost practices. They say in the deep mountains lies an enormous ruin, holding within a fantastic ship capable of traveling to other worlds, and to an adventure worthy enough to fight their way through the defenses of this lost complex and reactivate this machine, it would be an unimaginable treasure. The last Aethership&#33; A worthy prize for mage and warrior and thief alike&#33; \r<br />\r<br />NEW FEATURES AND BUG FIXES\r<br />____________________________________________________ \r<br />\r<br />-Added NPCs to the Clockwork City\r<br />-The ship can be your home now&#33;\r<br />-Stopped respawning chests in the player house\r<br />-Fixed clipping issues in the maintenance shafts\r<br />-Fixed harquebus speed\r<br />\r<br />\r<br />FEATURES \r<br />____________________________________________________ \r<br />\r<br />-A large, open dungeon for the player to explore, filled with traps, lava, and a new type of centurion \r<br />-An unmarked quest to discover and reactivate the lost Aethership \r<br />-A new type of weapon, harquebuses (guns)&#33; Five available types can be found, and come complete with rifle sounds and effects. The available types are the Ohmic Harquebus, the Heavy Harquebus, the standard rifle, the Magmatic Harquebus, and the Aetherial Arquebus. \r<br />-Once you reactivate it, the player may use the aethership as their own. It comes complete with cargo and docking bays, engineering and maintainence shafts, weapon systems, and even a full bridge with a captain&#39;s chair. The ship may also be used as a player home, and quarters are provided with basic services. \r<br />-The ability to use your ship to call down orbital strikes. \r<br />-The ability to use your ship to travel to other planes, such as Sotha Sil and Masser, one of Nirn&#39;s moons. \r<br />-Your very own space helmet and space suit, courtesy of the last Dwemer aethernauts. \r<br />\r<br />TROUBLESHOOTING, COMPATABILITY AND TIPS \r<br />_____________________________________________________ \r<br />-Read the notes and pay attention&#33; This quest is unmarked, and as such you&#39;re going to actually have to use that thing you call a brain&#33; Shocking I know, and it might be difficult, but I believe in you (I don&#39;t actually). \r<br />-As far as I know, this mod doesn&#39;t conflict with anything, and the changes to the vanilla world are minimal. \r<br />-As you might expect, this does in fact, require Dawnguard, so if you yell in the comments how you&#39;re missing a &#39;mod clled dwgnard&#39; you will be ignored. Don&#39;t try it, because I know you want to. Don&#39;t ask me to make a non-dawnguard version because I will rip on you for being one of the dumbest people in existence, which you will be if you make a comment like that. \r<br />-Be sure to save often, many times you&#39;ll find yourself in difficult or precarious positions, and it might help to reload earlier saves&#33; \r<br />--Other areas in the ship, such as the maintenance shaft and captain&#39;s quarters, only open after you&#39;ve launched the ship. \r<br />-I recommend finding how to fix navigation before leaving the ship (the tonal pad platform) to go back to Tamriel. Other than that you&#39;re fine. If you do end up leaving the ship, you&#39;ll have to open the console and type &#39;player.coc _an_aethership_bridge&#39; to get back. \r<br />-Followers won&#39;t work in the dungeon or aboard the ship, the platforming sections are just too nuts for them. However they may still run around on the bridge. \r<br />-Currently, Masser and Sotha Sil are just there for the sake of being there, they don&#39;t do anything cool or special, besides being moons. \r<br />-Those levers are the bridge don&#39;t do much. Well a few do, but I&#39;m not saying which. Have fun. \r<br />\r<br />SPECIAL THANKS AND CREDITS \r<br />_____________________________________________________ \r<br />To Guardly for re-uploading and adding fixes\r<br />To Dem Waifus, for testing \r<br />To mahty, for the base harquebus mesh and also for figuring out how to cleverly make these things \r<br />To Neil Armstrong, because space is something associated with you and also you died soon before I released this, which kind of makes me sad and also sort of makes this a tribute I guess? \r<br />To Star Trek, for some sounds \r<br />To Riddle, for helping with the Aethernaut helm \r<br />To somevagrant, for the Aethernaut symbol. \r<br />To rahman530, for his dwemer robes, which became the base for the aethernaut suit \r<br />\r<br />CLOSING WORDS \r<br />_____________________________________________________ \r<br />While making this mod, I had to undergo serious bonegrafting surgery and pretty much ended up on medications for the entire first week I made this, then I had to suddenly have my appendix removed. So I had two major surgeries, and their subsequent recoveries, and I still finished this in less than two weeks. \r<br />Other modders, get on my level.",
  "categoryId": "88",
  "version": "1.2",
  "author": "Trainwiz",
  "createdUnix": "1378524877",
  "updatedUnix": "1429230763",
  "containsAdultContent": false,
  "uploadedBy": "Guardly",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052829",
      "name": "Aethernautics- A Space Travel Mod",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15353",
      "fileName": "Aethernautics- A Space Travel Mod-41754-1-2.rar",
      "uploadedUnix": "1378524873",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/9b9398812f3c1fa63c67b73af35cc667d3977ad133148759a76e71cb7515d6eb/analysis/1407711733/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aethernautics-%20A%20Space%20Travel%20Mod-41754-1-2.rar?fid=1000052829&ttl=1535822585&ri=8192&rs=8192&setec=23df66c3a4758ca1ee657622db947f38"
    },
    {
      "fileId": "1000155923",
      "name": "Aethernautics-Wheels of Lull integration patch.",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "163",
      "fileName": "Aethernautics-Wheels of Lull integration patch.-41754-1-2.rar",
      "uploadedUnix": "1429230763",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/f4980385e3ef074c91dd9dd5c6fdfb4525d4dc3dd5df2eae602720dcbe438a22/analysis/1429230783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aethernautics-Wheels%20of%20Lull%20integration%20patch.-41754-1-2.rar?fid=1000155923&ttl=1535822586&ri=8192&rs=8192&setec=d31f7cb24ff27a97b35cf8f17d2a7197"
    }
  ]
}