{
  "modId": 41784.0,
  "modName": "Fake Fullscreen",
  "summary": "Utility which allows running Skyrim in fake fullscreen mode. Works with SKSE, Steam or basically anything else! Also supports Fallout 3 and other games in near future.",
  "descriptionHtml": "[size=4][color=#9db13f][b]IS THIS FOR ME?[/b][/color][/size]\r\nThis simple utility will be of great help to you if you:\r\n[list]\r\n[*]Alt-Tab a lot;\r\n[*]Have performance issues/experience mini-stutters;\r\n[*]Use SKSE, LARGEADDRESSAWARE, Steam or any other functionality which involves linking to/tampering with game\\'s executable files.\r\n[/list]\r\n\r\n[size=4][color=#9db13f][b]BUT SUCH TOOL ALREADY EXISTS![/b][/color][/size]\r\nWell, yes, it does, and not quite so! The tool was created because of the problems while trying to get other similar utilities to work with Steam. The process involved in setting up these tools to work with Steam is somewhat complicated, and that\\'s not how it\\'s supposed to be.\r\n\r\nFurthermore, [i]Fake Fullscreen[/i] is foolproof to any other modifications you make to your game.\r\n\r\nIn short - [color=#ff8888][b][i]Fake Fullscreen[/i] will work on any game setup with any modifications applied![/b][/color]\r\n\r\n\r\n[size=4][color=#9db13f][b]DOES IT SUPPORT OTHER GAMES?[/b][/color][/size]\r\nIndeed it does! Not so many yet, but still...\r\nSupported games as of the latest version:\r\n[list]\r\n[*][url=http://fallout3.nexusmods.com/mods/19376/]Fallout 3[/url]\r\n[*]Skyrim\r\n[/list]\r\nI hope to bring more in the future.\r\n\r\n\r\n[size=4][color=#9db13f][b]IS IT COMPLICATED TO USE?[/b][/color][/size]\r\nAbsolutely not! After initial setup (can be slightly demanding because of UAC on recent operating systems), you can forget that the utility exists.\r\n\r\n[color=#ff8888][b]Once you set the utility up, you can forget about it. Even better: you will![/b][/color]\r\n\r\n\r\n[size=4][color=#9db13f][b]HOW TO USE IT?[/b][/color][/size]\r\nThe utility consists of a single executable file. You need to blindly follow the following steps in order to make it work.\r\n\r\nFirst and foremost, make sure you are running your game in windowed mode.\r\n[list]\r\n[*]Open the launcher by going to game installation folder and running the launcher (for example: [i]FalloutLauncher.exe[/i]).\r\n[*]Select Options.\r\n[*]Make sure [i]Windowed[/i] mode is checked.\r\n[*]Select desired resolution. Selecting current display resolution (see it in Windows settings) is much recommended. [color=#ff8888][b]Any other resolution will result in distorted in-game image.[/b][/color] This is something that cannot be solved without matching game resolution to display resolution.\r\n[*] Click OK and close the launcher.\r\n[/list]\r\nNow go get that tool!\r\n[list]\r\n[*]Download the file here at Nexus.\r\n[*]Extract the archive.\r\n[*]Place a single executable file in a folder of your choice. I suggest placing it in the game installation folder, but this is in no way a requirement.\r\n[*][color=#ff8888][b]Do not remove the file from its location[/b][/color] as the shortcut/task you create in the next step will get broken if you do so!\r\n[*]Create a shortcut or task to run application on Windows startup. This will depend on your operating system (see below) because utility has to have administrative rights to please UAC.\r\n[/list]\r\n\r\n[size=3][color=#9db13f][b]I\\'m using Windows XP or Windows Vista/7/8 with UAC disabled[/b][/color][/size]\r\n[list]\r\n[*]Right click the executable file (which you placed in the folder of your choice) and select [i]Copy[/i].\r\n[*]Go to [i]Start -> Run...[/i].\r\n[*]Write [i]shell:startup[/i] and hit Enter. [i]Startup[/i] folder will open up.\r\n[*]Right-click anywhere inside the folder (on an empty space), select [i]Paste shortcut[/i].\r\n[/list]\r\n\r\n[size=3][color=#9db13f][b]I\\'m using Windows Vista/7/8 with UAC enabled[/b][/color][/size]\r\n[list]\r\n[*]Go to [i]Start -> All Programs -> Accessories -> System Tools -> Task Scheduler[/i].\r\n[*]Click [i]Create Basic Task...[/i] on the right side.\r\n[*]Set name as [i]Fake Fullscreen[/i]. You can leave description empty. Click [i]Next[/i].\r\n[*]Choose [i]When I log in[/i] option. Click [i]Next[/i].\r\n[*]Choose [i]Start a program[/i] option. Click [i]Next[/i].\r\n[*]Click [i]Browse...[/i] to find utility\\'s executable file (which you placed in the folder of your choice). Click [i]Next[/i].\r\n[*]Check [i]Open the Properties dialog for this task when I click Finish[/i]. Click [i]Finish[/i].\r\n[*]Check [i]Run with highest privileges[/i]. Click [i]OK[/i].\r\n[*]Close Task Scheduler.\r\n[/list]\r\n\r\nNow, all you need to do is run the program manually for the first time so that you don\\'t have to wait for next Windows start-up. [color=#ff8888][b]Users with UAC enabled must run the application as administrators[/b][/color] by right-clicking it and selecting [i]Run as administrator[/i].\r\n\r\nYou can now forget about the utility and never run it again. It will work in the background and you will not get any notification after starting it. Rest assured that it\\'s working, though. Even better, fire up your game and check it for yourself.\r\n\r\nUpon initial startup, the utility will create configuration file. You can find the folder where it lives by going to [i]My Documents\\\\My Games[/i]. Inside you will find file named [i]FakeFullscreen.ini[/i].\r\n\r\n\r\n[size=3][color=#9db13f][b]How to enable/disable specific game?[/b][/color][/size]\r\nInside the configuration file, you will find a list of supported games, each followed by a number. Set the number to 0 to disable the game, set it to 1 to enable it. For example, to use [i]Fake Fullscreen[/i] with Skyrim, but not with Fallout 3, change the section to :\r\n\r\n[code][GameEnabled]\r\nFallout3=0\r\nSkyrim=1[/code]\r\n\r\nYou can change these values in between game sessions - computer restart or utility relaunch is not needed. \r\n\r\n\r\n[size=3][color=#9db13f][b]How to select custom display?[/b][/color][/size]\r\nIf you have multiple displays on your PC setup, fear not!\r\nFind this section in the configuration file:\r\n\r\n[code][Display]\r\nScreenIndex=0[/code]\r\n\r\nChange the value of ScreenIndex to match your desired display. Note that this index is zero-based, that is, your first display is indexed with 0, the second one with 1, and so on.\r\n\r\nYou can change these values in between game sessions - computer restart or utility relaunch is not needed. Just make sure you match resolution in game settings to the selected monitor in order to get the best results. Should you select a value to high, the utility will revert to the last display on your PC setup.\r\n\r\n\r\n[size=4][color=#9db13f][b]HOW DOES IT WORK?[/b][/color][/size]\r\nNow there\\'s no need to hide anything here. When the utility is launched (either manually or automatically with Windows), it sets up a timer to monitor game activity. When the utility detects that the game has launched, it makes changes to the window the game is running in in order to mimic the fullscreen mode. That\\'s why it\\'s called fake fullscreen mode. This is done only once per game startup.\r\n\r\nYou can close and relaunch your games as many times as you wish.\r\n\r\n\r\n[size=4][color=#9db13f][b]I DON\\'T WANT SOME FREAKING APP RUNNING IN THE BACKGROUND ALL THE TIME![/b][/color][/size]\r\nSuit yourself. . . . But if you\\'re still reading this, some facts for you:\r\nThe application will make sure it detects the game every time and change the window only once per game session in order to not use unneeded resources. Speaking of system resources, you can rest assured that the application will not use any noticeable CPU time (you can check it in Task Manager).\r\n\r\nYou are also free to scan the utility with an Anti-Virus scanner of your choice. Might I recommend Kaspersky?\r\n\r\n\r\n[size=4][color=#9db13f][b]THERE HAS TO BE A CATCH![/b][/color][/size]\r\nThere is, actually. The application will use 6.664 KB* of your memory (that\\'s more than 6.5 MB!). If you have less than 1 GB of RAM, it is not recommended to use this utility.\r\n\r\n[b]Oh, wait, you have so much more![/b]\r\n\r\n[size=1][i]Might vary up to 30% depending on your operating system configuration.[/i][/size]\r\n\r\n\r\n[size=4][color=#9db13f][b]ARE THERE ANY [/color][color=#ff8888]KNOWN ISSUES[/color][color=#9db13f]?[/b][/color][/size]\r\n[list]\r\n[*]In-game brightness settings are ineffective when playing the game in windowed mode. There are ton of Windows applications that can help you adjust your display\\'s gamma.\r\n[/list]\r\n\r\n[size=4][color=#9db13f][b]I\\'VE TRIED IT AND IT\\'S NOT WORKING![/b][/color][/size]\r\nIf you have any problems with the utility, please post a comment here at Nexus. I\\'ll be delighted to hear your thoughts about it and help you if I can.\r\n",
  "categoryId": "39",
  "version": "2.0",
  "author": "Witchunter",
  "createdUnix": "1378562240",
  "updatedUnix": "1378562194",
  "containsAdultContent": false,
  "uploadedBy": "Witchunter",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000052931",
      "name": "Fake Fullscreen",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Fake Fullscreen-41784-2-0.rar",
      "uploadedUnix": "1378562194",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/c48716418438058330e85ae63c78bcf80a31d333bf124d86c6e4ff2c6871ed47/analysis/1407712322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fake%20Fullscreen-41784-2-0.rar?fid=1000052931&ttl=1535822621&ri=8192&rs=8192&setec=d0304fde4b902eb4f0622b95b9d0e741"
    }
  ]
}