{
  "modId": 41802.0,
  "modName": "Dawnguard Arrow Crafting for Vanilla Skyrim",
  "summary": "A small plugin that allows players who don&#39;t have Dawnguard to craft arrows with the official Bethesda recipes. Compatible with Hearthfire and Dragonborn.",
  "descriptionHtml": "[url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i1368.photobucket.com/albums/ag172/Daiyus37/Modding/Mod%20Page%20Description%20Banners/Forever%20Free_zpsmzwanqbn.jpg[/img][/url]\r<br />\r<br />This was a module I made for a different project which I had to abandon when my first child was born. I&#39;ve since been able to get back into modding, but am now working on a  much bigger project (that will incorporate the ideas of the original mod). As it&#39;s useful little plugin, and it&#39;s hard to find this if you&#39;re looking for something like it when it was buried with the old project, I thought I&#39;d upload it separately for anyone who wants it.\r<br />\r<br />Basically, the problem I saw was that if you don&#39;t have Dawnguard you can&#39;t craft arrows (unless you use a mod). It was a silly thing for Bethesda to leave out in the first place. If you&#39;ve got Dawnguard you don&#39;t need this module.\r<br />\r<br />All I&#39;ve done is replicated Dawnguard&#39;s recipes in the Vanilla game. You will find the recipes in their corresponding categories. 1 Firewood + 1 *material* Ingot = 24 Arrows. Daedric Arrows require an Ebony Ingot and a Daedra Heart. You will need the corresponding Perks to craft the arrows of that tier, so Dwarven Smithing to make Dwarven Arrows, etc.\r<br />\r<br />As far as my searches have found, there&#39;s no other plugin that provides the original Bethesda recipes on the Nexus. This is completely compatible with Hearthfire and Dragonborn. It&#39;s a very small, simple plugin do the only incompatibilities I can foresee are with other Arrow Crafting mods. That said, if there are any issues, please just ask, and I&#39;ll see what I can do.\r<br />\r<br />Hope this helps some people out.\r<br />\r<br />Oh yes, permissions. I have a very simple permissions policy; if it’s my own work then it’s open source. You may do what you like with it. Any part of my work that belongs to somebody else, you must gain their permission to use that part (check the credits). I have two stipulations: Firstly, any work you release that incorporates any of my work must be released as open source as well (that means you MUST NOT charge money for it). Secondly, any credits given on my work must be given on yours as well. ",
  "categoryId": "55",
  "version": "1.0",
  "author": "Daiyus",
  "createdUnix": "1378579789",
  "updatedUnix": "1378585566",
  "containsAdultContent": false,
  "uploadedBy": "Daiyus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000053005",
      "name": "Dawnguard Arrow Crafting for Vanilla Skyrim",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dawnguard Arrow Crafting for Vanilla Skyrim-41802-1-0.rar",
      "uploadedUnix": "1378585566",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9bbf35e4180b730b650226c8dd7d40257425fb1e63828e338d00479f43451378/analysis/1407712861/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnguard%20Arrow%20Crafting%20for%20Vanilla%20Skyrim-41802-1-0.rar?fid=1000053005&ttl=1535822643&ri=8192&rs=8192&setec=35cdc448b12a38d454e07f6dd332c08d"
    }
  ]
}