{
  "modId": 41861.0,
  "modName": "The Ancient Art of Silver Weaponsmithing",
  "summary": "A mini-quest that locates two ancient tomes which allow you to forge Ancient Silver weapons and Legendary Mithril weapons.",
  "descriptionHtml": "[center][color=darkorchid][size=10]Ancient Silver and Legendary Mithril Weaponsmithing[/size][/color]\r<br />\r<br />by\r<br />[b]Shadowblade001[/b]\r<br />\r<br />Ver 1.00\r<br />\r<br />Uploaded 11th September, 2013\r<br />\r<br />\r<br />[color=yellow][size=5]This mod is a Nexus Exclusive[/size]\r<br />\r<br />\r<br />[size=4]Note that this mod may have conflicts with radical overhauls that change the perk tree system, such as Requiem and SPERG[/size][/color]\r<br />\r<br />\r<br />\r<br />This is a Crafting and Smithing mod.\r<br />\r<br />This is the second mod I ever made for Skyrim and the fourth to be released (excluding my colour scheme for Legwon’s Coloured Map Markers).\r<br />\r<br />I doubt there are any, but please report any errors or bugs as well as any opinions on power and balance.\r<br />[/center]\r<br />\r<br />\r<br />[color=Steelblue][size=2]Description[/color][/size]\r<br />All standard weapon types can be crafted in Silver and Mithril, including scimitars and arrows.\r<br />\r<br />[color=Forestgreen]Crossbows and bolts can be crafted with the Dawnguard Add-on.[/color]\r<br />\r<br />In addition to the pre-requisite skill score and perk requirements, the knowledge of the two processes is gained by discovering and reading some ancient, very rare books. Therefore, it is not possible to forge these weapons just by having the required perks without also reading the books, and [i]vice versa[/i].\r<br />\r<br />The books are Lore-friendly and I think worth reading in themselves.\r<br />\r<br />To get the books, you need to read some private letters and start some simple mini-quests.\r<br />\r<br />One letter is under the shield at Alvor’s forge in Riverwood, while the other is within the pages of a book on the desk in Farengar’s library at Dragonreach.\r<br />\r<br />These will start the quests, update the journal and add the map markers to the world map. The locations still have to be travelled to and discovered as normal in order to activate fast travel.\r<br />\r<br />[color=yellowgreen]Beware, Traveller&#33; For such ancient knowledge does not come easily, and the journey to find the books may be just as hazardous as the destinations themselves&#33;[/color]\r<br />\r<br />It is easily possible to get the required perks and Tome to learn the rudiments of Ancient Silver Weaponsmithing at very low character level. Whether you will survive the journey is another matter.\r<br />\r<br />For Legendary Mithril smithing it is possible to get the skill scores and perks by level 12 to 15 if you spam those skills. Realistically, if you role-play, you will be level 22 to 25 to get both Alchemy and Smithing to 60 and four other skills to 50 to 60 points, EG two weapons, one armour type and one other.\r<br />\r<br />This is balanced against the power of the weapons as Ancient Silver is the same as Steel except Ancient Silver weighs 30% less and gives a bonus vs Undead and Lycanthropes, while Mithril weapons rank  between Elven and Glass, weigh half as much as Steel, are 15% faster to use and have a higher bonus against Undead and Lycanthropes.\r<br />\r<br />Both types of weapons can be enchanted with two effects when you have the perks without losing the special powers of the metal.\r<br />\r<br />\r<br />[color=Steelblue][size=2]Installation[/color][/size]\r<br />Download the Main File, [color=Forestgreen]_shb_SWSQ_SilverSmithing[/color]\r<br />Unzip\r<br />Copy the contents of the [color=Forestgreen]_shb_SWSQ_SilverSmithing[/color] folder to the\r<br />…Steam/SteamApps/common/skyrim/DATA folder\r<br />\r<br />Activate as normal.\r<br />\r<br />[color=Steelblue][size=2]In order to use the Dawnguard add-on:[/color][/size]\r<br />Download the Add-on file, [color=Forestgreen]_shb_SWSQ_SilverSmithing_DG[/color]\r<br />Unzip\r<br />Copy the contents of the [color=Forestgreen]_shb_SWSQ_SilverSmithing_DG[/color] folder to the DATA folder to add the extra meshes and textures and let Windows overwrite the original [color=Forestgreen]_shb_SWSQ_SilverSmithing.esp.[/color]\r<br />This will update you to the DG version.\r<br />If you have been playing with the Main File and Classic Skyrim and already have the ability to craft Ancient Silver and Legendary Mithril weapons and then install the Dawnguard DLC, the crossbow and bolt recipes will now also appear at the forge.\r<br />\r<br />\r<br />[color=Steelblue][size=2]Uninstallation[/color][/size]\r<br />Delete [color=Forestgreen]_shb_SWSQ_SilverSmithing.esp[/color]\r<br />Delete the [color=Forestgreen]_shb_SWSQ_Silversmith[/color] folders in Meshes and Textures\r<br />Delete the [color=Forestgreen]_shb_SWSQ_Silversmith_DG[/color] folders in Meshes and Textures\r<br />Delete any pex and psc files starting with [color=Forestgreen]_shb_SWSQ_[/color] or [color=Forestgreen]QF__shb_SWSQ_[/color] in the Scripts and Source folders.\r<br />\r<br />The scripts are quite safe and will not bloat your saves.\r<br />\r<br />\r<br />[size=4][color=orangered]The Ancient Art of Silver Weaponsmithing[/color][/size]\r<br />If you read a letter to Alvor located under the shield at his forge in Riverwood, a quest will start for you to find an ancient book mentioned in the letter.\r<br />When you find the book and read it, a hidden perk is added to the player which allows you to craft Ancient Silver weapons provided you have the correct perks.\r<br />The recipes for crafting Ancient Silver weapons will appear at the forge under Steel once you have read the book and have the perks:\r<br />\r<br />* Steel Smithing\r<br />* Enchanting I\r<br />\r<br />You can get the perks first, then read the book, or read the book and then get the perks. Order does not matter.\r<br />\r<br />* All standard weapons can be crafted, including scimitars and arrows.\r<br />* Crossbows and bolts can be crafted with the DG add-on.\r<br />* Ancient Silver weapons can be tempered at the sharpening stone using Quicksilver ingots.\r<br />* Ancient Silver weapons can be enchanted as normal without losing the special powers of the metal.\r<br />* Once an Ancient Silver weapon has been enchanted, the Arcane Smithing perk is required to temper it further.\r<br />\r<br />[color=orangered]Ancient Silver weapons compared with Steel weapons:[/color]\r<br />* same base damage\r<br />* 70% of the weight\r<br />* same speed to use\r<br />* cost approximately 3.25x as much\r<br />* 30 bonus damage against Undead, Ghosts and Lycanthropes\r<br />\r<br />\r<br />[size=4][color=orangered]Legendary Mithril[/color][/size]\r<br />If you read a letter to Farengar located within a book on the desk in his study at Dragonreach, a quest will start for you to find an ancient book mentioned in the letter.\r<br />When you find the book and read it, a hidden perk is added to the player which allows you to craft Mithril weapons in the ancient style provided you have the correct perks.\r<br />\r<br />The recipes to smelt Mithril alloy will appear at the smelter and the recipes to forge weapons will appear at the forge under Elven once you have read the book and have the perks:\r<br />* Elven Smithing\r<br />* Arcane Smithing\r<br />* Alchemy IV\r<br />\r<br />You can get the perks first, then read the book, or read the book and then get the perks, or mix it up. Order does not matter.\r<br />\r<br />* All standard weapons can be crafted, including scimitars and arrows.\r<br />* Crossbows and bolts can be crafted with the DG add-on.\r<br />* Mithril weapons can be tempered at the sharpening stone using Mithril alloy.\r<br />* Mithril weapons can be enchanted as normal without losing the special powers of the metal.\r<br />\r<br />[color=orangered]Legendary Mithril weapon properties:[/color]\r<br />* +1 point of base damage compared with Elven weapons (Vanilla values - between Elven and Glass).\r<br />* 50% of the weight of Steel\r<br />* 15% faster to use than Steel\r<br />* cost  approximately 20x as much as Steel (between Ebony and Daedric).\r<br />* 75 bonus damage against Undead, Ghosts and Lycanthropes\r<br />\r<br />[size=2][color=orangered]Mithril Alloy[/size][/color]\r<br />This ancient and mysterious process also requires some rare and very rare alchemical ingredients, so the total number of ingots available is limited without using the console to cheat in more ingredients. Most of these ingredients have to be gathered in the field and can be purchased from most traders only rarely.\r<br />You do get two ingots when you smelt the ingredients, however, and enough to make a set of your chosen weapons, if not all weapons. EG, two swords and a bow and a lot of arrows.\r<br />Some especially rare ingredients are included when you find the book.\r<br />It is advisable to save some mithril ingots for the final tempering until you have any items and potions you need to get maximum Smithing bonuses from the tempering.\r<br />\r<br />Smelting Mithril alloy requires the Steel, Elven, Arcane Smithing and Alchemy IV perks (so you need a skill score of 60 in both Smithing and Alchemy).\r<br />\r<br />\r<br />[size=2][color=orangered]Arrows and Bolts[/size][/color]\r<br />Due to the way the bonus vs Undead/Lycanthropes works in Skyrim, this bonus is applied by the launcher (IE from having the bow/crossbow equipped when you loose the arrow/bolt), not from the impact of the missile itself.\r<br />\r<br />You still get the bonus when using these bows and crossbows with arrows or bolts of any material, so there is no need to waste Mithril ingots on making arrows and bolts if you can make steel bolts or arrows of Glass or ebony.\r<br />\r<br />\r<br />[size=2][color=orangered]Scimitars[/size][/color]\r<br />The base cost of the Scimitars has been left at 5, 16 and 100 in this mod but the price of Vanilla Scimitars may be changed by other mods.\r<br />\r<br />5 gp is the same price as in USKP as the low price of scimitars is believed to be a design decision based on cultural imperatives rather than an error that needed to be fixed. I also have to make this mod compatible with Vanilla Skyrim and Dawnguard and cannot take account of every smithing and crafting overhaul in existance, mods that radically change perk trees etc.\r<br />\r<br />Nevertheless, this mod will NOT overwrite anything in other mods as all the recipes, meshes and textures are unique to this mod.\r<br />\r<br />Despite being excellent weapons, the rationale for the low price of scimitars in Skyrim is that:\r<br />\r<br />* Scimitars cannot be forged or purchased in Vanilla Skyrim anyway\r<br />* they are native to Alkiv&#39;r and disliked by the Nords\r<br />* they are of alien design and represent foreign influence\r<br />* they are therefore not highly valued in Skyrim at this point in the 4th Era (Curved? Swords?)\r<br />* Nordic smiths lack the skill and desire to make them.\r<br />* Skyrim merchants of any race do not pay much for them as there is no local market\r<br />* Redguards and Khajiits are the most interested in curved swords, and they prefer their own scimitars made by expert smiths in their homelands.\r<br />* And Khajiits are well-known for offering poor prices anyway.\r<br />\r<br />Therefore, you cannot spam forging scimitars as you will waste resources and lose a lot of money.\r<br />\r<br />If you want to revert the prices of vanilla Scimitars that may be changed by other mods, you can use the optional file, [color=forestgreen]_shb_SWSQ_ScimitarPriceReset.esp[/color]. It’s entirely up to you.\r<br />\r<br />\r<br />[size=2][color=orangered]Optional Files[/size][/color]\r<br />[color=forestgreen]_shb_SWSQ_ScimitarPriceReset.esp[/color]\r<br />\r<br />Adding this to the DATA folder and loading it after the main esp allows you to craft Steel Scimitars (the main esp does not) but the selling price will be the same as Vanilla in order to prevent abuse of spam-crafting them and selling them for a massive profit.\r<br />\r<br />The entirely optional [color=forestgreen]_shb_SWSQ_ScimitarPriceReset.esp[/color] reverts any mod that increases vanilla scimitar prices back to the Vanilla and USKP prices. It does not affect any pseudo-magickal scimitars like [color=goldenrod][i]Windshear[/i][/color], which probably justifies a higher price.\r<br />\r<br />I made this as a separate esp because some excellent mods I use change the selling price to what I feel is far too high. Those who like it can have it, those who prefer a low price and want to craft scimitars for personal use, rather than as a way of making cash, can use this optional add-on.\r<br />\r<br />If you prefer a higher scimitar price and think there’s nothing wrong with a non-magickal scimitar selling in Skyrim for three times as much as a greatsword, DO NOT USE THIS OPTIONAL FILE. It’s entirely up to you. However, your Silver and Mithril Scimitars will then be worth a LOT less than steel scimitars if you do not use this add-on patch.\r<br />\r<br />Whether you use the price fix or not, you can still craft scimitars in silver and mithril for dual wielding against undead etc but without the patch you will not be able to craft the steel versions unless another mod allows it. Either way, you will still lose money by crafting them in silver or mithril just to sell. This is part of the balance of being able to make a pair of such excellent one-handed weapons which can be dual-wielded. There’s no need to boost your coffers and Speech skill as well.\r<br />\r<br />\r<br />[size=2][color=orangered]Compatibility[/size][/color]\r<br />This mod is compatible with other Smithing and Crafting Overhaul mods but you will get two versions of the Swords and Greatswords if those mods allow smithing of Vanilla silver weapons. These will be the normal Silver Swords/Greatswords from that mod and Ancient Silver Swords/Greatswords from this mod.\r<br />\r<br />The Silver swords in my mod are Silver Sword (Ancient) and Silver Greatsword (Ancient) and also look different from Vanilla.\r<br />\r<br />This mod was originally made with Headbomb’s superb Smithing Perks Overhaul, Weapons and Armour Fix and Complete Crafting Overhaul in mind. It also works with the excellent Remade versions of those mods but will probably be incongruent with the WIP version of CCO which renames certain ores and ingots (for example changing quicksilver to mithril, which makes a recipe to create a Legendary Mithril Alloy with Mithril as an ingredient rather redundant, not to mention tempering Silver with Mithril).\r<br />\r<br />\r<br />[size=2][color=orangered]Load Order[/size][/color]\r<br />Place this mod after any other mods which affect Smithing perks and recipes.\r<br />All the recipes in this mod are unique and will not take priority over anything in another mod, with the exception of the Steel Scimitars in [color=forestgreen]_shb_SWSQ_ScimitarPriceReset.esp.[/color]\r<br />\r<br />This is my own load order:\r<br />\r<br />Weapons & Armor Fixes_Remade.esp\r<br />Weapons & Armor Fixes_Dawnguard.esp\r<br />Smithing Perks Overhaul_Remade.esp\r<br />Smithing Perks Overhaul_Dawnguard.esp\r<br />Complete Crafting Overhaul.esp (Sharlikran’s Patch http://skyrim.nexusmods.com/mods/26230/)\r<br />_shb_SWSQ_SilverSmithing.esp\r<br />_shb_SWSQ_ScimitarPriceReset.esp (entirely optional)\r<br />\r<br />As this mod will not inherit anything from the other mods and will not influence anything in those mods (except the price fix patch), load order of my mod probably does not matter, as long as the price fix patch comes last if you want to use it.\r<br />\r<br />\r<br />[size=2][color=orangered]Known Issues[/size][/color]\r<br />I have tested this mod thoroughly with a fresh start for several new characters and it is working as intended.\r<br />\r<br />The only minor problem is updating the final journal entry correctly if you do the Legendary Mithril quest backwards. That is, if you do not go to Whiterun and find the letter to Farengar but come across the final Boss by wandering and exploring. Killing the Boss and taking the book will start the quest and reading the book will complete the quest and add the perks. You can then make the weapons as intended. But for some reason the quest stage in the journal does not update correctly to the alternate final stage. This is a purely cosmetic journal text entry and causes no problems, but just looks a little sloppy to me. But if you read the letter first there is no problem at all.\r<br />\r<br />If any gifted scripters have any suggestions for fixing this, I’d be very happy to hear from them.\r<br />\r<br />I&#39;d like to thank everyone at Bethesda, Nexus and TESAlliance who helped me try to sort this problem out and also helped with early versions of the scripts. I shall try to name them personally when I have time to check my old forum posts.\r<br />\r<br />Another minor cosmetic issue is that when dual-wielding, sometimes the left-hand scimitar is upside down and sometimes it is not (at least in my game with Dual Sheath Redux active). I have a tutorial to make left-hand meshes but very little knowledge in this area. If anyone would like to help or advise me, please feel free to PM me.\r<br />\r<br />\r<br />[size=2][color=orangered]Meshes and Textures[/size][/color]\r<br />I just adapted existing Vanilla meshes and textures for this mod using NifSkope and GIMP. They do not look all that spectacular, but they look fine and they do the job. They are all renamed and unique and do not overwrite anything, as are the STAT, WEAP, COBJ and other elements in the CK.\r<br />\r<br />I would like to have unique meshes but making them is a highly specialised business and the software extremely expensive, so I had to make do with modified Vanilla meshes and textures. The important thing I think is the special effects of the weapons and the fact they can be visually distinguished quite easily. Perhaps I should have used Draugr meshes for the Mithril, but it is what it is.\r<br />\r<br />\r<br />[size=2][color=orangered]Future Plans[/size][/color]\r<br />I’d like Vigilants of Stendarr to start appearing with Silver and eventually Mithril maces in a levelled manner.\r<br />\r<br />~.~",
  "categoryId": "100",
  "version": "1.00",
  "author": "Shadowblade001",
  "createdUnix": "1378868537",
  "updatedUnix": "1389726247",
  "containsAdultContent": false,
  "uploadedBy": "Shadeybladey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000053915",
      "name": "_shb_SWSQ_SilverSmithing",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "47014",
      "fileName": "_shb_SWSQ_SilverSmithing-41861-1-00.7z",
      "uploadedUnix": "1378868025",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/ed9f148265cb79d784bd2be422819ac58f099d2ab1956d74ad3cacd938ccbedb/analysis/1407718126/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/_shb_SWSQ_SilverSmithing-41861-1-00.7z?fid=1000053915&ttl=1535822711&ri=8192&rs=8192&setec=6eef671876f0e9683bd00a46dcef40c4"
    },
    {
      "fileId": "1000053918",
      "name": "_shb_SWSQ_SilverSmithing_DG",
      "version": "1.00",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2969",
      "fileName": "_shb_SWSQ_SilverSmithing_DG-41861-1-00.7z",
      "uploadedUnix": "1378868264",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/4827a9197d783c4fb8c395ebf570208316b8102d1fb8f4526b2477484384b2db/analysis/1407718129/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/_shb_SWSQ_SilverSmithing_DG-41861-1-00.7z?fid=1000053918&ttl=1535822711&ri=8192&rs=8192&setec=ac2e926dc7e6a48560f5fd71dba07fc0"
    },
    {
      "fileId": "1000053921",
      "name": "_shb_SWSQ_ScimitarPriceReset Patch",
      "version": "1.00",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "_shb_SWSQ_ScimitarPriceReset Patch-41861-1-00.7z",
      "uploadedUnix": "1378868466",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/88573cadb0265a16844e078490a0f353a060447fded9f189df1e01f2b986cb56/analysis/1407718129/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/_shb_SWSQ_ScimitarPriceReset%20Patch-41861-1-00.7z?fid=1000053921&ttl=1535822712&ri=8192&rs=8192&setec=c925f253e1cc432bb161dffe7bdfe866"
    },
    {
      "fileId": "1000087431",
      "name": "_shb_SWSQ_SilverSmithing_TD2",
      "version": "1.01",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "14",
      "fileName": "_shb_SWSQ_SilverSmithing_TD2-41861-1-01.rar",
      "uploadedUnix": "1387469042",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/b6015ef99bdd47faf424f746a2bcfaa83da3f7a74cf5bd1b12b089da74a170b8/analysis/1407848886/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/_shb_SWSQ_SilverSmithing_TD2-41861-1-01.rar?fid=1000087431&ttl=1535822712&ri=8192&rs=8192&setec=ad61255cc555fca1f1fe3ff5f8ad9483"
    },
    {
      "fileId": "1000091486",
      "name": "_shb_SWSQ_SilverSmithing_TD3",
      "version": "1.02",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "16",
      "fileName": "_shb_SWSQ_SilverSmithing_TD3-41861-1-02.rar",
      "uploadedUnix": "1389726247",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/60c151be3a73c7d33490959e9e1f90051960855afa9b21cdc30b459f6c48747f/analysis/1407886131/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/_shb_SWSQ_SilverSmithing_TD3-41861-1-02.rar?fid=1000091486&ttl=1535822713&ri=8192&rs=8192&setec=826f9f870b7fd1de9e1cd644dec0cba8"
    }
  ]
}