{
  "modId": 4192.0,
  "modName": "FIX for CTDs and Missing Textures- 32bit Large Memory Access",
  "summary": "Force Windows XP, Vista or 7 to provide 3Gb to User Applications on 32 Bit Editions. LAA patches alone are NOT enough. Not applicable to 64 Bit Editions.\r\n",
  "descriptionHtml": "[b]FIX for CTDs / Missing Textures : 32bit Large Memory Access[/b]\r\n\r\nIf you\\'re on a 64 bit version of Windows, this does NOT apply to you so save yourself some eyeball wear and tear. The commands have no effect, they are ignored so don\\'t even bother trying.\r\n\r\nComments seem broken for this so please discuss on the forum :\r\n\r\nhttp://www.thenexusforums.com/index.php?/topic/503105-fix-for-ctds-and-missing-textures-32bit-large-memory-access/\r\n\r\n[b]My machine :[/b]\r\n- Core 2 Duo E8500 3.12 Ghz\r\n- ASUS P5K-SE\r\n- 4Gb RAM\r\n- MSI N560GTX-Ti Twin Frozr 2Gb\r\n+ Dual-booting OSX and Windows 7 Ultimate 32 Bit\r\n+ Playing at Ultra, 1080p.\r\n\r\nPrior to taking these steps, I was frequently crashing to desktop and experiencing missing textures. It got to the stage I generally spammed the quicksave button and kept a recent save in a different area.\r\n\r\nNo more. In the past 4 hours of play, no missing textures and not one CTD. I\\'ve installed all the texture packs I was too scared to before and Skyrim looks glorious. I\\'ve fast travelled all over the place without a hitch, cast spells, dual wielded, shouted, killed dragons... all with another app thrashing my drive in the background. Not too shabby for my aged rig.\r\n\r\nNow, I still have problems saving and loading in Whiterun from a fresh start - it won\\'t - but I suspect something else is broken there and is unrelated.\r\n\r\nI applied this on my machine last night, circa 24 hours ago. I\\'ve played Skyrim for about 8 hours since then, did some Photoshopping, alot of browsing (Opera and Palemoon), Perl coding, HD tv episode watching, played Shogun 2 for a bit as well as Dead Rising (my gfx card is brand new, still fapping over the upgrade from my 8800gt).\r\n\r\nAnyway.\r\n\r\nBefore we continue, doing this *should* be OK on most systems. However, badly written drivers that assume they have access to 2Gb will likely crash and burn. Write down the fallback instructions just in case.\r\n\r\nAs it turns out, toggling the LAA flag in executables is NOT ENOUGH on 32bit Windows. Being 32bit, Windows is limited to 4Gb of \\'address space\\', no more. It can\\'t even *see* an entire 4Gb of physical RAM - only 3.25Gb is accessible. Don\\'t believe me? Right-click My Computer, click Properties and look under Installed Memory (RAM).\r\n\r\nIt turns out that Windows splits that 4Gb of virtual address space in two - 2Gb for the Kernel (Windows core, drivers, yada yada yada), and 2Gb for User Applications.\r\n\r\nIn order for Skyrim (and others) to actually benefit from the LAA switch without crashing every time you breath wrong, that sharing balance must be shifted. Windows will not let you give more than 3Gb for User Applications, but, as it turns out, that\\'s enough.\r\n\r\n[b]Configuring Windows XP for 3Gb User Memory :[/b]\r\n\r\n[b]1)[/b] Open [b]boot.ini[/b]\r\n[b]2)[/b] Find (usually only one exists) your boot line, which looks something like this :\r\n   [b]multi(0)disk(0)rdisk(0)partition(1)\\\\WINDOWS=\\\"Microsoft Windows XP Professional\\\" /fastdetect[/b]\r\n\r\n[b]3)[/b] Duplicate that line, and edit it so it includes \\\"[b]/3GB[/b]\\\" somewhere after the label. Also edit the label to reflect this change :\r\n   [b]multi(0)disk(0)rdisk(0)partition(1)\\\\WINDOWS=\\\"Microsoft Windows XP Professional 3GB\\\" /3GB /fastdetect[/b]\r\n\r\n[b]4)[/b] Reboot. If things go pear shaped if you use that boot option, use the original and remove that line from boot.ini.\r\n\r\n\r\n\r\n[b]Configuring Windows Vista and 7 for 3Gb User Memory :[/b]\r\n\r\n[b]1)[/b] Open an elevated (ie, with Administrator rights) cmd prompt (type CMD in the start menu, then CTRL-Shift-Enter)\r\n\r\n[b]2.1)[/b] Without the quotes, type \\\"bcdedit /set IncreaseUserVa 3072\\\", then press Enter/Return.\r\n\r\n[b]2.2)[/b] If you are on a multiboot machine, it may fail. If so, add \\\"/store C:\\\\Boot\\\\BCD\\\" to the command, changing the BCD store location accordingly.\r\n\r\n[b]2.3)[/b] If you\\'re on a machine using Windows Deployment Services (At home? You\\'re 99.99% probably not), you\\'ll need to force regeneration of the BCD store.\r\n   Again without quotes: \\\"sc control wdsserver 129\\\"\r\n\r\n[b]3)[/b] Reboot.\r\n\r\n[b]4)[/b] To undo this, at an elevated cmd prompt type \\\"bcdedit /deletevalue IncreaseUserVa\\\" and reboot.\r\n\r\n\r\nFollowing this, you\\'ll find the 4Gb patch actually has an effect and Skyrim will no longer crash anywhere near as often.\r\n\r\nTo improve things further, open [b]Skyrim.ini[/b] in your Mydocs/Mygames folder and match the following settings :\r\n[code]\r\n[Papyrus]\r\niMaxAllocatedMemoryBytes=3221225472\r\n[/code]\r\n\r\nThis next part of [b]Skyrim.ini[/b] is optional. The uGridsToLoad variable is apparently set semi-permanently and cannot be reduced, only increased. The default is 5, I believe.\r\n[code]\r\n[General]\r\nuGridsToLoad=7\r\nuInterior Cell Buffer=12\r\nuExterior Cell Buffer=142\r\nfMasterFilePreLoadMB=128.0000\r\niPreloadSizeLimit=268435456\r\n[/code]\r\n\r\nGood luck. If it doesn\\'t work, I dunnolol.\r\n\r\nPlease endorse if it does work for you so others can gain confidence and benefit.\r\n\r\nThe files are merely my Skyrim INI files in case you want to eyeball them.\r\n\r\nPS: Stone-D is me, its my preferred moniker on sites that allow hyphenated usernames.",
  "categoryId": "84",
  "version": "1.0",
  "author": "Stone-D",
  "createdUnix": "1324387707",
  "updatedUnix": "1324387810",
  "containsAdultContent": false,
  "uploadedBy": "LMahesa",
  "primaryFile": null,
  "files": [
    {
      "fileId": "12333",
      "name": "Skyrim INI Files",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "3",
      "fileName": "Skyrim INI Files-4192-1-0.zip",
      "uploadedUnix": "1324387810",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/12a5c083f9d870aac3f388767a78c66e2d6c0aaa4b361dcdd0d2ccd5d830fa0a/analysis/1406539822/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20INI%20Files-4192-1-0.zip?fid=12333&ttl=1535759788&ri=8192&rs=8192&setec=f64484ac7eb653dc98f5cb646eeb410d"
    }
  ]
}