{
  "modId": 41931.0,
  "modName": "Skyrim Followers Plus",
  "summary": "Enhances Skyrim\\'s Followers with Perks, New Spells, Abilities, and Combat Classes in a lore friendly way.",
  "descriptionHtml": "Description:\r\n\r\nSkyrim Followers Plus is a mod designed to enhance many of Skyrim\\'s followers by adding Perks, New Spells, Abilities, and Combat behavior in a lore and balance friendly way.\r\n\r\nList of Followers this Mod changes (so far)-\r\n\r\nLydia\r\nAdelaisa Vendicci\r\nIllia\r\n\r\nSpecifics:\r\n\r\nLydia-  Lydia is now a Paladin.  She has her own custom NPC class that allows her Restoration and Magicka to level up with the player.  Her max level is 60.  Restoration, One-Handed, Block, and Heavy Armor perks have been added as well (she also now has female animations - no need for separate fix).\r\n\r\nLydia will use Healing, Fast Healing, and Close Wounds at the appropriate levels.\r\n\r\nAlso added is a custom spell called Divine Aura that will burn undead that Lydia will begin to use at level 25.  At level 41 she will use Greater Divine Aura to keep the spell relevant as she levels.  She will not cast the spell if she is facing non-undead enemies.\r\n\r\nHer appearance has also been slightly changed to make her more attractive looking (in my opinion, anyway).\r\n\r\nAdelaisa Vendicci-  Adelaisa is now a Centurion.  She has been given a custom class that changes how she levels (Illusion and Magicka).  Her max level is 60.  Whereas before she was a useless follower because her class was \\\"Civilian,\\\" she is now a valuable follower. \r\n\r\nAdelaisa\\'s appearance has been moderately altered.  Gone are the wrinkles of a old woman.  She now looks to be in her 40\\'s.\r\n\r\nBefitting a veteran of the Imperial Legion she will now cast a custom spell that buffs friendly actors\\' (players and NPCs) Magicka, Health, and Stamina called Discipline.  She will cast a higher level version of this spell at level",
  "categoryId": "66",
  "version": "1.0",
  "author": "AidenPryde",
  "createdUnix": "1378776550",
  "updatedUnix": "1378779623",
  "containsAdultContent": false,
  "uploadedBy": "AidenPryde",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000053594",
      "name": "lydiapaladin",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "171",
      "fileName": "lydiapaladin-41931-1-0.rar",
      "uploadedUnix": "1378779623",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e998234cd6b360ee2ef477f309fc3de03d8cd3ec82769403edb2ae0a5117c208/analysis/1407717140/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/lydiapaladin-41931-1-0.rar?fid=1000053594&ttl=1535822800&ri=8192&rs=8192&setec=8fed94c5b0d5f5cbbfe29f027ff3ffb9"
    }
  ]
}