{
  "modId": 41969.0,
  "modName": "Elemental Potency Master - Power to the Atronachs",
  "summary": "Adding additional levels, to the Elemental Potency perk. And Thus, giving more power to the conjurer and his/her minions",
  "descriptionHtml": "[b]News (check by here now and then.)\r\n[list]\r\n[*] - 9/13/2013 @ 2:52 PM - [COLOR=\\\"#00FF00\\\"]Looking for a Scripter to insist in the development in this mod. I\\'m at a lost and have no knowledge of scripting. Looking for a Volunteer scriptor.[/COLOR]\r\n---\r\n[*] - 9/12/2013 @ 6:03 PM - Welp, I am at a lost as to what the cause is. This may take some scripting no doubt. So I\\'m looking for a scripter who\\'d like to participate in the development. I may know a off-fix for now but I\\'m not too happy about it. I\\'ll let that be a surprise once I do some Google searchs for a simple script format to take advantage of... Well if I can pull it off. Or this mod development is coming to a halt till I have the help I need. Send me a Note or let me know in the Comments section if you\\'d like to help with scripting.\r\n---\r\n[*] - 9/11/2013 @ 1:31 PM - It would appear when conjuring Atronachs when you have acquired the Third rank of Elemental Potency, Ultimate Atronachs will always be summoned, sometimes a Potent or empowered variation will come forth as well. I\\'m at a lost here why it does this... My best guess its cycling through all 4 variations of normal, potent, empowered and Ultimate. How to stop this is beyond me... Its rather aggravating. There has to be a way to force it to use its respective Prefix and effectiveness when the proper rank of Elemental Potency has been achieved... (Rank 1 - Only Potent, Rank 2 - Only Empowered, Rank 3 - Only Ultimate, etc).\r\n---\r\n[*] Also I put up some pictures, I apologize if they are not professional and look generic, I thought maybe having the Atronachs posed like they are watching the view from a mountain top would make them adequate and pleasing enough to over look, if I had the material I could make more professional pictures. Perhaps if someone can help me make some custom Magical-looking Nordic font to use for putting up messages in Screenshots taken.\r\n---\r\n[*] As always, feel free to poke in, Experiment, fiddle around with the mechanism and get back to me with any answers/suggestions/fixes, cause I\\'ll be doing the same and I think I might have several theories on making it work. Enjoy!\r\n[/list][/b]\r\n\r\nYou know? I\\'m quite the avid conjurer who loves to summon very powerful/very strong minions. To do my bidding in combat as a meat shield, as support or in aid of the defense.\r\n\r\nI felt the Atronachs ought to be a lot more powerful and/or be a lot more stronger then they appear. Sure, it takes strategy when using summons. But now and then a Conjurer ought to feel treated to a Atronach being capable of downing one strong foe or a plethora of weak enemies with relative ease, saving the Strategy for very/extremely/ultimately more challenging enemies, thus allowing the conjurer to deal with the tedious and occasional Hot head or groups of enemies with ease and keep up the momentum.\r\n\r\nThis however is a test, and I would appreciate a lot of input, guidance and fixes that can be contributed to make this happen. Download at your on convenience if you insist on testing. So far, the idea behind this Modification is as follows:\r\n\r\n[LIST]\r\n[*] Elemental Potency will have additional ranks of 3, allowing Atronachs to become stronger for each point applied. Flame, Frost & Storm has been added.\r\n[*] Each Rank applied adds a new prefix to the summoned Atronachs name, to indicated that is significantly stronger/ more powerful.\r\n[*] The current prefixs for the Atronachs are as followed: [U]Normal[/U], [U]Potent[/U], [U]Empowered[/U] and [U]Ultimate[/U]. They have only a five level increase from their default. This will be tweaked to avoid becoming over powered, while keeping the immersion that even if your summons are capable in a fight, you need to tend to their needs and watch out for them, assisting them in the fight. While still making sure that they are plenty strong, and plenty powerful to sweep away the tedious, common and garish bandits, thieves and reasonably strong warriors.\r\n[/LIST]\r\n\r\nAverage and Seasoned Modders are welcome to give out pointers and/or help contribute. I\\'d like to make additions to the Conjurer perk tree for a plethora of summon ideas... Well, assuming I\\'ll keep enthusiastic to my work. For now it will be in work build, and will be uploaded for use.\r\n\r\n--Q \\'n\\' A--\r\n---\r\n[LIST]\r\n[*] Why did you upload this now, rather then get a better working product, then making the submission?\r\n\r\nA). Well, Most Mod developers have their own way of letting the community take part in both development, and teaching each other new things. I suffer from Autism and I have a 1000 things (exaggeration) running through my head at once, I can\\'t look at this Creation Kit without a clear mind. I hesitate and I make mental screams about \\\"Why am I not quickly knowing what to do right now!?\\\" Or \\\"I can\\'t do this! I have not done scripting, or was not taught any! This Creation kit is different from the one I used for TESIV Oblivion!\\\". Its bugging me right now and I think I will want to learn from Adept, Experienced and Seasoned Mod developers that can teach me, give me pointers and show me a thing or two how to get this, or that working. I tried learning on my own but... Its like your mind goes completely quiet and shuts up your mental processes, in an effort to keep you from experimenting and trying new things. I\\'d prefer to learn under the wing from someone and find my own take on developing new things.\r\n---\r\n\r\n[*] Lol, you got autism!?\r\n\r\nA). Yes, lets not make fun of it. Be respectful. However, I would be interested to know if there is anyone who has autism in this community! =)\r\n---\r\n\r\n[*] Will there be more mods like this?\r\n\r\nA). Sadly I\\'ll work on them on my own time. I\\'d love to know that any works I make are appreciated by the community. But I am lazy, as well as I like to work on something when I want to, having all the time I need to pick out bugs, tedious glitches and such so it works perfectly for... Oh say, an indefinite time, rather then keep going back because a player discovered a glitch/bug/etc that suddenly unleashes a Magical nuclear explosion, eclipsing Cyrodill in eternal death and darkness. I know perfect is impossible to humans, but I\\'d like to make sure it works perfectly, stays that way. Kinda like the difference between something grown by hand, and something produced out of a factory. Hand grown is at its best, sweet/sour/tangy, healthy and fully grown. It make take a time and more patience but its more satisfying. Where Factory is average quality in every aspect, for the sake of quantity and convenience. There\\'s more to eat, but its not as healthy or tasty as being grown by hand from the earth.\r\nOf course for there being more, only if I find some inspiration, I am thinking upon the \\\"Dremora Lord\\\" spell and adding Equally strong/powerful variations, Like \\\"Dremora knight\\\", \\\"Dremoa Archer\\\", and \\\"Dremora Mage\\\".\r\n---\r\n[*] Would you make the Flame Atronachs summonable through Spell books?\r\nA). I may consider if people ask. Leave a comment on where the spell books ought to be at!\r\n---\r\n[*]Hey, will you give credit to me?\r\nA). Only if you can contribute towards a answer to whatever problems ensue. Feel free to take a poke inside and see what you can do! Just don\\'t be a thief! Just let me know if you want to take part. (I will make a list of the testers, scripters and experienced Creation Kit users. Credit will be given.) Just contact me over a Private message with the fix and it will be applied. Same for if you would like to assist.\r\n[/LIST]\r\n---\r\n\r\nSo far, I\\'m having trouble gaining both understanding and experience on Mod development just sitting here with the creation kit by myself. So instead I will learn from those more capable then I am, and have fun in the process! Interacting with the community, let each step be something new and exciting to learn, and make some great mods!\r\n\r\n\r\nHave a nice day! (And my apologies if my typing is confusing or if I sound like I\\'m full of myself!)",
  "categoryId": "73",
  "version": "Alpha",
  "author": "Huglarh",
  "createdUnix": "1378833402",
  "updatedUnix": "1378922344",
  "containsAdultContent": false,
  "uploadedBy": "Huglarh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000054236",
      "name": "EPM _ Esp build 02 Alpha",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "EPM _ Esp build 02 Alpha-41969-2.rar",
      "uploadedUnix": "1378922344",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/65c1de0a45068b8cdeca823e3d9e99a721534e93bb239f901dff29e372ba8c1f/analysis/1407719345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EPM%20_%20Esp%20build%2002%20Alpha-41969-2.rar?fid=1000054236&ttl=1535822834&ri=8192&rs=8192&setec=ec4ffeeff8926a8f12398e6dd06b916d"
    }
  ]
}