{
  "modId": 41967.0,
  "modName": "No Ambient Sounds",
  "summary": "Disables persistent, looping ambient sounds such as non-stop moaning in crypts. Optional version to remove ALL ambiance. (Vanilla & DLC versions available).",
  "descriptionHtml": "USE EITHER THE VANILLA VERSION OR THE DLC VERSION. NOT BOTH! Hearthfires didn\\'t add any new sounds, so it\\'s compatible with all versions of the mod.\r\n\r\nThere are 3 flavors available. \r\n\r\n1.) Disable Looping Ambient Tracks - Dawnguard and Dragonborn Required.\r\nThis mod disables looping audio tracks (358 total). This gets rid of most ambient audio clutter. Dwemer machinery, rocks crumbling, water splashing, spider webs tearing, and individual instances of sounds that only show up every few minutes are still in the game, as to maintain some ambiance and lore. The effect is, you could say, about a 50% drop in audio clutter and, more importantly, gets rid of the annoying looped tracks. The previously looped track will play through once - typically 15 seconds or so - then stop, instead of repeating. So you\\'ll hear a bit of racket as usual when you first enter an area, then it quiets down.\r\n\r\n2.) Disable ALL Ambient Sounds - Dawnguard and Dragonborn Required. (TESTING. BUG REPORTS APPRECIATED/)\r\nFor the minimalist gamer, this version removes ALL ambient sounds - around 600. (as well as the associated controller rumble). This removes any sound effect that does not have a visible source (traps, creeks, waterfalls, bonfires and such are still audible). This version modifies about 600 Sound Descriptors with dubious ID\\'s. A run through Bleak Falls Barrow showed great results, and a sweet iron axe of shocking. But there\\'s hundreds of dungeons in the game, so who knows? Can\\'t test them all. Might be a sound effect or two that slipped through.\r\n\r\n3.) Disable Looping Ambient Tracks (for Vanilla Skyrim only)\r\nThis optional file is the same as the first version that only disables looping tracks, except for Vanilla. No DLC Required\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nTo get technical - Every dungeon will have 1 looping sound track. For crypts, it\\'s that ghostly moaning that repeats every 15 seconds or so (which inspired me to make this - that one drives me nuts). On top of that, there are 20+ individual sound tracks such as thunder rumbling, glasses clanking, water dripping, etc. This file disables that 1 looping track in every dungeon (which varies from dungeon to dungeon) and leaves the multitude of other tracks that occur seemingly at random ... The version that removes all the ambient sound simply turns down the volume on the 600 or so ambient tracks so you can\\'t hear them.\r\n\r\nA bonus of this is that the game is actually quiet when paused, which always puzzled me. The audio should stop when a game is paused. Now it does. \r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nTechnicals: This mod changes the \\'Loop\\' field in the Sound Descriptors of all the sounds that were set to \\'Loop\\' by default. Changed to \\\"No Loop,\\\" needless to say. The screenshot shows what it looks like in the background. The version that removes all ambiance changes the \\\"Static Attentuation\\\" of all ambient sound files to 99 (also in Sound Descriptors). This mod does not effect any cells or actors. It only modifies the sounds directly.\r\n\r\nCompatibility: I don\\'t use sound mods at all. But I recon that anything that changes sound effects has a solid chance of not getting along with this. Sounds of Skyrim or such? I have not tested any sound mods against this or seen any reports of conflicts. Are you seriously still reading this wall of text? Kudos on your determination.\r\n\r\nDevelopment: The mod was created with TES5Edit 3.0.3, Creation Kit 1.9.32, tested on Skyrim 1.9.32 (Legendary Edition) with Dawnguard, Hearthfire, Dragonborn, and High Resolution Texture Pack.",
  "categoryId": "61",
  "version": "1",
  "author": "jpsimonetti",
  "createdUnix": "1378828954",
  "updatedUnix": "1379234483",
  "containsAdultContent": false,
  "uploadedBy": "jpsimonetti",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000053750",
      "name": "No Looping Ambient Sounds - Vanilla",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "Sounds - No Looping Ambient Sounds-41967-1.rar",
      "uploadedUnix": "1378828942",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/14ccaef23b253a986600bf276cd5a9c8a860edc3bc775e09876ec04424e1ca55/analysis/1407717683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sounds%20-%20No%20Looping%20Ambient%20Sounds-41967-1.rar?fid=1000053750&ttl=1535822831&ri=8192&rs=8192&setec=d4587a867e506a33b483ef1f0a4bc337"
    },
    {
      "fileId": "1000055493",
      "name": "No Looping Ambient Sounds - All DLC - RECOMMENDED",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "No Looping Ambient Sounds - All DLC-41967-2.rar",
      "uploadedUnix": "1379201191",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/2fe35d38d2075ed7274c5e363324e71ae6e4d5d99bd861e2771a183da578b7be/analysis/1407722715/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Looping%20Ambient%20Sounds%20-%20All%20DLC-41967-2.rar?fid=1000055493&ttl=1535822831&ri=8192&rs=8192&setec=b2b662d3fa2073a362bf2ae692f2a861"
    },
    {
      "fileId": "1000055591",
      "name": "No Ambient Sounds - Period - All DLC",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "No Ambient Sounds - Period - All DLC-41967-3.rar",
      "uploadedUnix": "1379234483",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/5e23853d2c682b83505069fda761ead18ea9e29d63ec0c358f954265560759fd/analysis/1407723244/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Ambient%20Sounds%20-%20Period%20-%20All%20DLC-41967-3.rar?fid=1000055591&ttl=1535822832&ri=8192&rs=8192&setec=f1d524529ce8cdb8b5872a0008ef365d"
    }
  ]
}