{
  "modId": 41982.0,
  "modName": "Stereo Playback Fix",
  "summary": "A workaround for the volume-issues with too loud magic, wind, ambient, etc..",
  "descriptionHtml": "This is part of my upcoming sound overhaul. I&#39;m releasing this seperatly, because it fixes a in my opinion severe &#34;bug&#34; in skyrims sound implementation, that seems to be unknown to most people..  \r<br />\r<br />\r<br />[size=4][u]Introduction[/u][/size]\r<br />Skyrim has two basic ways of playback. Hrtf, sounds that are placed directional in the game world, and Defined Speaker Output (Dso), sounds that appear &#34;in the players head&#34; regardless of which direction he looks.\r<br />(Because of their record-names in the skyrim.esm/creation kit they are often called &#34;mono&#34; and &#34;stereo&#34;, which is not incorrect, but leads to confusion about their purpose. While Dso-sounds can be played back in stereo and Hrtf-sounds are played in mono, this is not related to the samples channels. Mono and stereo samples can be played on both types of output-models..)\r<br />\r<br />[u]Links[/u]\r<br />[url=http://www.creationkit.com/Sound_Output_Model]Output Model[/url], explains defined speaker output and [url=http://www.tech-faq.com/hrtf.html]HRTF[/url]\r<br />\r<br />\r<br />\r<br />\r<br />[size=4][u]The issue[/u][/size]\r<br />Many people complain about the same things: To loud ambient sounds, winds, magic, devine/daedra voices, interface sounds... All the particular sounds that are considered to be too loud have one thing in common: they&#39;re played back using Defined Speaker Output. (Keep in mind that not every magic, ambient, etc sound is played back this way&#33;)\r<br />The popular ways used by modders to fix these issues are samples with reduced volume, lowering volume of sounds or sound categorys in the ck, adding menu sliders (i&#39;ve done it myself) or muting these sounds completely. Sadly these ways are a lot of work and cause incompatibilitys with other mods, as well as they don&#39;t cover all affected sounds.\r<br />But the problem is not that these sounds are mixed to loud. Due to a bug in the output-models the Dso-sounds are played at twice the volume compared to the Hrtf sounds.\r<br />The best example: player footsteps are much louder in 1st-person compared to 3rd-person. (these are exactly the same sounds with the same volume, they just switch the playback mode...) Compared to npcs, the players 3rd-person footsteps are hard to hear, which doesn&#39;t make much sense. If you now increase the volume (with the footsteps-slider) until they&#39;re equal, 1st-person would be way to loud...\r<br />\r<br />\r<br />\r<br />\r<br />[size=2][u]Testing for the issue[/u][/size]\r<br />[list]\r<br />[*] Deactivate Loudness Equalization or any other &#34;low volume fix&#34; that is more than just pure amplification.\r<br />[*] Start the game without this mod and any other mod editing footsteps or output models.\r<br />[*] Test if player-footsteps are approximately at the same volume in 1st- and 3rd-person.\r<br />[/list]\r<br />(One can also test this in the creation kit and opening the &#34;tstLoopMonoLPSD&#34; sound descriptor. Click the play button. Afterwards, switch the used output-model to stereo, and play again. This will work on every sound descriptor.)\r<br />\r<br />[color=red]Note:[/color] Using with 2.0/headphones and choosing 5.1 playback in the audio-driver is completely masking (not fixing) this issue. (In this case this mod will have the opposite effect and Hrtf-sounds will play at twice the volume as the Dso-Sounds.) More info at the end of the description.\r<br />If for some reason sounds have the same volume and you don&#39;t use the above setting, please leave a comment, including your speaker setup. Thx&#33;\r<br />\r<br />\r<br />\r<br />[size=4][u]What this mod does[/u][/size]\r<br />[list]\r<br />[*] This mod lowers the volume on all Dso/Stereo sounds, and only these, by 50%. The goal is to bring them to the same volume as the Hrtf sound.\r<br />[*] It does not fix every balancing/mixing issue, it just sets the output for all sounds to equal volume. This is a mod to fix a single issue, not a sound overhaul..\r<br />[*] With this mod the overall sound is slightly more balanced than before.\r<br />[*] It has an impact on every speaker setup.\r<br />[*] It does not increase the game volume.\r<br />[/list]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=4][u]What&#39;s causing these issues?[/u][/size]\r<br />The loud volume is a result of all Dso-Sounds playing at twice the possible volume that is available for the Hrtf-sounds.\r<br />The creation kit gives the possibility to configure the volume on each speaker-channel seperatly for the Dso in the output models. All channels are by default set to 100%, front speakers (left and right) and the rear speakers. On a 2.0 setup the rear ones are not disabled, and instead their volume is added to the stereo(front) channels. So Dso-sounds play at 200%(Front)+200%(Rear)=400% volume, compared to the Hrtf sound which only play at 200%(Front or Rear). \r<br />\r<br />[size=4][u]Solution[/u][/size]\r<br />Reducing volume to 50% on all channels fixed all issues with too loud/unbalanced sounds, which leads to the point that these sounds have never been too loud, at least if looking at the volume in the sound descriptors. These have been mixed correctly, but are played with the wrong volume.\r<br />But this fix comes at the price of the game appearing(&#33;) to be more silent. In fact it isn&#39;t, only the sounds constantly cluttering the soundscape are lowered, but one might get the impression.\r<br />Obviously this fix is just a workaround. Increasing the volume on the Hrtf-Outputs would be the right thing to do, but the Creation Kit does not offer any option to do this.\r<br />And maybe this bug plays a big role in why this game is too silent compared to other games....\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=4][u]Compatibility[/u][/size]\r<br />This is compatible with every mod except those which edit vanilla output models like Spo or [url=http://skyrim.nexusmods.com/mods/43773]AOS[/url].\r<br />The sound module of [url=http://skyrim.nexusmods.com/mods/35957]Reverb and Sound[/url] is incompatible too, v2 will include this fix.\r<br />[url=http://skyrim.nexusmods.com/mods/40912] More sound options[/url] is compatible.\r<br />\r<br />\r<br />[size=4][u]Files[/u][/size]\r<br />The mod has two versions:\r<br />Seperate Dlcs: Seperate files for Skyrim, Dawnguard and Dragonborn\r<br />All Dlcs: All dlcs combined in one file\r<br />\r<br />*Hearthfires.esm has no new output models and doesn&#39;t need this fix..\r<br />\r<br />\r<br />[size=4][u]Installation/Uninstallation[/u][/size]\r<br />[url=http://wiki.tesnexus.com/index.php/How_to_install_Skyrim_mods]How to install Skyrim mods[/url]\r<br />[list]\r<br />[*]The mods changes might not work if loading it for the first time. In this case make a new savegane, exit skyrim, restart and load the last save.\r<br />[*]The mod doesn&#39;t make permanent changes and can be removed anytime.\r<br />[/list]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Fyi...\r<br />[size=4][u][b]What can be done about the silent game?[/b][/u][/size]\r<br />Not much except getting audio-hardware capable of offering enough amplification to compensate for this volume loss. There are a lot of fixes mentioned in the different forums, but these have issues or don&#39;t work at all:\r<br />[list]\r<br />[*] Set 2.0/stereo speakers to play back at 5.1/surround (in the audio-driver-settings): While this for some reason increases volume on the front channels, it drastically reduces volume on the rear ones. On the one hand, sounds behind the player are that silent that it&#39;s nearly impossible to hear them. On the other, without the rear channels the issue this mod tries to fix is masked completely because their signals are not added to the stereo channels anymore.\r<br />[*] Loudness equalization: Makes everything equally loud (surprise&#33;). With this option enabled the output volume of the system is always at the same level, no matter how loud the currently played sounds are. While this increases volume for skyrim, it imho breaks immersion, too.\r<br />[*] Increase master-volume in the skyrimprefs.ini to a value bigger than 1.0: This does not work. Skyrim can&#39;t read higher values..\r<br />[/list]\r<br />But there is one thing that works, at least if the audio-software offers this option (surprisingly, i&#39;ve only found one single comment recommending this)\r<br />Go to the audio-driver-menu (same place where loudness-equalization is). There you&#39;ll find a setting called EQUALIZER. Open it and increase every frequency by the same amount. This will increase volume without any side-effects..\r<br />Another solution might be to get alternative driver software, like Razer Surround. (It is free, but needs registration. I don&#39;t know of any similar software that is free to use..) This has a slight increase in volume on my system, and some simple options to configure sound. (The surround-function is of limited use. Skyrim, as well as all other games i know, support this feature by default)",
  "categoryId": "95",
  "version": "1.0",
  "author": "someguy",
  "createdUnix": "1379422095",
  "updatedUnix": "1379272554",
  "containsAdultContent": false,
  "uploadedBy": "ffe3214",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000055716",
      "name": "Stereo Volume Fix AllDlc",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Stereo Volume Fix AllDlc-41982-1-0.7z",
      "uploadedUnix": "1379272508",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7c2615e07a3002e169256e5a842eff41d2d65a8a42189cf1996be40792051d07/analysis/1407724145/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stereo%20Volume%20Fix%20AllDlc-41982-1-0.7z?fid=1000055716&ttl=1535822842&ri=8192&rs=8192&setec=3de6a933d5808b080e9dc781aade6ce2"
    },
    {
      "fileId": "1000055717",
      "name": "Stereo Volume Fix Seperate",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Stereo Volume Fix Seperate-41982-1-0.7z",
      "uploadedUnix": "1379272554",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f7a7abc873884df6463727ce428964f59194642425d4fe82ccc80a80430f3f25/analysis/1407724146/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stereo%20Volume%20Fix%20Seperate-41982-1-0.7z?fid=1000055717&ttl=1535822843&ri=8192&rs=8192&setec=a6a2fa09958b02007bbf5f667646b982"
    }
  ]
}