{
  "modId": 42026.0,
  "modName": "Khajiit Prowress Overhaul",
  "summary": "Tired of your favorite furry race be nothing special except for night-vision? This overhaul revamps the homo-panthera pardus and turns it into a true feline.",
  "descriptionHtml": "I love the Khajiit, but I was always depressed by how there was nothing special besides their unarmed combat bonus, and who even uses that? Any race can easily acquire night-vision so the Khajiit really are just a basic race with claws. This mod aims to change that.\r\n\r\nI have seen my house cats leap eight times their height. I have seen them jump from twenty feet high in a tree to catch birds, land, and just trot off like it was nothing, bird in their mouth. The average outdoor cat kills dozens of creatures daily  using their spectacular abilities, they are the deities of their own little worlds.\r\n\r\nNow obviously the Khajiit are bigger than house cats, they are the size of people so shouldn\\\\\\\\\\\\\\'t those incredible abilities be proportionally greater? The cat closest to the weight/size ration of humans is the Panthera Pardus or the leopard. They are known for their rosette spots and are classified as one of the most efficient big cat hunters. So I thought Khajiits should be about as powerful as the similarly sized leopard. This mod aims to turn the Khajiit into a force to be reckoned with like the leopard, and to give an actual reason to play as one.\r\n\r\nThe leopard has exceptionally strong muscles attached to the scapula to aid in their ability to climb trees, and have been seen carrying enormous loads vertically up trees. One leopard has been seen carrying a young giraffe estimated to be twice the hunter\\\\\\\\\\\\\\'s weight up into a tree, so I greatly increased the Khajiit\\\\\\\\\\\\\\'s strength and stamina.\r\nLeopards are very agile, and can run at over 58 kilometres per hour, leap over 6 metres horizontally, and jump up to 3 metres vertically, so I increased their sprinting speed quite a bit, but not so much as to be absurd, they are bipedal after all. I also increased their jump height to about twice the Khajiit in-game size and greatly minimized their fall damage. You can\\\\\\\\\\\\\\'t survive a jump off the Throat of the World, but leaping from a cliff the the ground below will do much less harm to these felines.\r\n",
  "categoryId": "78",
  "version": "1.0",
  "author": "vAbiss",
  "createdUnix": "1378913309",
  "updatedUnix": "1378913309",
  "containsAdultContent": false,
  "uploadedBy": "vAbiss",
  "primaryFile": null,
  "files": []
}