{
  "modId": 42036.0,
  "modName": "Dustveil Tower - Vamp Home",
  "summary": "A Tower located just North East of Falkreath",
  "descriptionHtml": "Dustveil Tower - A Vampire/Necronancer or NecroVamp home for your Dovahkiin.\r\n\r\nZolh lived in seclusion, away from the rest of Falkreath hold up in his tower just past the small ravine where the lumber mill is based. Zolh was rumoured to practise all manner of strange and frightful arcane powers but since he was a Nord, the people of Falkreath let him be. Usually those who are magic users are typically not of Nordic decent but most just let Zolh alone as he was a withered old man.\r\n\r\nZolh actually was a vampire. he wish to unravel the mysteries of Vampireness by exploring the link between the Vampire condition and blood of all living things. More info can be found in his journal.\r\n\r\nZolh became weaker and weaker as he simply got too immersed into his works, then one day, he just collapsed outside his tower\\'s front door in a seat and stopped moving. Now, a few years have pasted but the people of Falkreath let the tower be as the place just gives off bad vibes. The Jarl of Falkreath has even put up a order, stating to all Falkreath citizens and visitors to stay away from Dustveil Tower until further notice.\r\n\r\nThe Dovahkiin though.. s/he is above such rules set by mere motals.... with a soul of a Dragon and a thirst for adventure... such a place is too alluring to miss! \r\n\r\nDustveil Tower has:\r\n\r\n - Large storage capacity\r\n - Enchanting Table\r\n - Alchemy Table\r\n - Should be Follower Friendly\r\n - Sleeping Area designed for Vampires\r\n - Allround nice place to squat in!\r\n\r\nCompletely Skryim Vanilla with no DLCs required!\r\nI plan to make full use of Dawnguard aspects and perks after I see the feedback from those who download this. \r\n\r\nLocation: North East of Falkreath, near the Falkreath Necromancer tower.\r\n\r\nNote: Interior lighting may glitch due to the large number of light sources in side so if your cpu does not like lots of close lighting, there may be flickering. I have this problem but I add lots of light sources regardless so one day I can fix this problem by getting a better cpu or something to tweak it with.",
  "categoryId": "67",
  "version": "1",
  "author": "Beth",
  "createdUnix": "1378928774",
  "updatedUnix": "1378928760",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000054294",
      "name": "Dustveil Tower",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48",
      "fileName": "Dustveil Tower-42036-1.rar",
      "uploadedUnix": "1378928760",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/2f6854fb6f34c4983086e8c634e4d161ffbfff827ebe541861e185e35653ec55/analysis/1407719642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dustveil%20Tower-42036-1.rar?fid=1000054294&ttl=1535822902&ri=8192&rs=8192&setec=c2c7b919cf17e60b2685267ec92ef768"
    }
  ]
}