{
  "modId": 42178.0,
  "modName": "Imperial Paladins",
  "summary": "Adds armors, weapons and teleportation to the game.",
  "descriptionHtml": "[CENTER][COLOR=#c0504d][SIZE=7][FONT=Impact][B]Imperial Paladins[/B][/FONT][/SIZE][/COLOR][/CENTER]\r\n[SIZE=4][COLOR=#4f81bd][B]\r\n[/B][/COLOR][/SIZE]\r\n[line]\r\nA ReadMe has been added with in depth details on acquiring the items of this mod.\r\n[line]\r\n[SIZE=4][COLOR=#4f81bd][B]Description:[/B][/COLOR][/SIZE]\r\nThis mod adds 2 NPCs(potential followers and spouses), 3 new armors, 5 new weapons, a new arrow type(though only visually different), 2 shields, a new ore and ingot type, 16 teleportation spells and a few more spells and spell effect changes strongly based on the German RPG Gothic II into Skyrim.\r\n\r\nIn order to have access to the unique armors you HAVE to join the Imperial Legion and reach a certain level.\r\n\r\nThe new ore is only obtainable after you reach a certain level, and may be found in all the mining nodes around Skyrim, much like gems. As you increase in level, the chance of finding this ore increases. The two Paladins will start selling the Ingots needed for Paladin gear after you reach a certain level.\r\n\r\nThe teleportation runes may be found near all the large cities and smaller settlements of Skyrim, they have no requirements and have no spell cost.\r\n\r\n[COLOR=#4f81bd][SIZE=4][B]Contents:[/B][/SIZE][/COLOR]\r\n[LIST]\r\n[*]Two new NPCs, Knight-Paladin Daren and Knight-Paladin Revelas, Daren is an Expert Heavy Armor trainer while Revelas is an Expert Restoration trainer. Further more they both sell restoration spells and their prefered silver weapon. (at level 10 you can buy the Holy Light spell tome from either. They both have custom AI packages and can be found in the Castle Dour Courtyard or the Guard quarters at night.\r\n[*]New Solitude Guard armor (obtainable if you choose medium when getting equipped by Beirand, otherwise craftable with steel smithing)\r\n[*]Knight armor and shield. (Steel smithing required, comes pre enchanted, but can be tempered without the Arcane Smithing perk)\r\n[*]Paladin armor and shields. (Arcane Smithing required, comes pre enchanted)\r\n[*]Paladin and Knight weapons.\r\n[*]Silver Bow and Arrows, obtainable from the Silverhand.\r\n[*]Silver weaponry can now be tempered.\r\n[*]Imperial Sword can now be crafted.\r\n[*]Teleportation spells to all large cities and small settlements, (including Lakeview Manor)\r\n[*]New color for healing spells.\r\n[*]Healing Potions now have a red effect, instead of matching that of restoration spells.\r\n[*]Holy Light, an all blue personal light spell that lasts 5 minutes, has no cost and awards no experience.[/LIST]\r\n\r\n\r\nThere may be other things I\\'ve added in there, but none come to mind.\r\n\r\n[SIZE=4][COLOR=#4f81bd][B]Important Note:[/B][/COLOR][/SIZE]\r\nThis mod changes one of the quests in the Civil War (Jagged Crown) for the empire, changing the disposition of the two added NPCs, thus making them possible followers and spouses.\r\n\r\n[COLOR=#4f81bd][SIZE=4][B]Installation:[/B][/SIZE][/COLOR]\r\nUnpack the files into your Skyrim folder and replace existing files and folders, if any, tick the Imperial Paladins.esp when booting Skyrim.\r\n\r\n[B][COLOR=#4f81bd][SIZE=4]Conflicts:[/SIZE][/COLOR][/B]\r\nNone that I know of, though if you have mods that alter healing spell effects or the Silverhand it may get buggy.\r\n\r\n[SIZE=4][COLOR=#4f81bd][B]Credits:[/B][/COLOR][/SIZE]\r\nA big thank you goes out to the following three users:\r\n[B][COLOR=#c00000]xxxNEOxxx[/COLOR][/B] - The creator of JackoOs Knightly Armory, a set of armors based on the german RPG Gothic. Full credits goes to him for creating the male Paladin armor I use in this mod. Thank you for letting me use it and reupload the files with my mod!\r\n[B][COLOR=#c00000]redxavier[/COLOR][/B] - The creator of Witcher 2 Shield Pack, a shield pack he\\'s ported from the Witcher 2 into Skyrim. Thank you for letting me use your work!\r\n[B][COLOR=#c00000]Dreogan[/COLOR][/B] - The creator of Skyforge Weapons. Thank you for letting me use and reupload your weapons!\r\n\r\nI highly encourage people to check out these great mods and modders.\r\n[URL=http://skyrim.nexusmods.com/mods/20618/?]Knightly Armory[/URL]\r\n[URL=http://skyrim.nexusmods.com/mods/7328/?]Witcher 2 Shields[/URL]\r\n[URL=http://skyrim.nexusmods.com/mods/36815/?]Skyforge Weapons[/URL]\r\n\r\n[B][COLOR=#4f81bd][SIZE=4]Random Stuff:[/SIZE][/COLOR][/B]\r\nI have created custom textures and NIFs for all the items added in this mod, using the above mods as resources. So this mod should conflict with none of the above. I am by no means a great texturer or modder, and this is my very first released mod. That said I hope you enjoy this mod as much as I am.\r\n\r\n[B][COLOR=#4f81bd][SIZE=4]Permissions:[/SIZE][/COLOR][/B]\r\nPlease ask me if you wish to use any of my work, and remember to ask the above modders aswell if you wish to use theirs.",
  "categoryId": "29",
  "version": "1.0",
  "author": "Adinirth",
  "createdUnix": "1379086607",
  "updatedUnix": "1379279046",
  "containsAdultContent": false,
  "uploadedBy": "Adinirith",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000055734",
      "name": "Imperial Paladins",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "46658",
      "fileName": "Imperial Paladins-42178-1-0.7z",
      "uploadedUnix": "1379279046",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0ea3709fd7823ce92f6f37f4cf35e68152f443899ad808aae27e7ab4fb36de1d/analysis/1407724340/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Paladins-42178-1-0.7z?fid=1000055734&ttl=1535823043&ri=8192&rs=8192&setec=cc5ca14f4ddb0f3988bf4dbabdfcdb0d"
    }
  ]
}