{
  "modId": 4221.0,
  "modName": "Conan the Cimmerian",
  "summary": "Conan the Cimmerian - Nord Male saves, batch file, and screenshots",
  "descriptionHtml": "Description:\r\n-------------\r\n\r\nMy interpretaion of Robert E. Howard\\'s Conan. He is not an Arnold or a Momoa clone (there are already files on the site for those if you prefer).\r\n \r\nHis look is derived from his description found here : http://en.wikipedia.org/wiki/Conan_the_Barbarian\r\n\r\nNot happy with the look, use console command \\\"showracemenu\\\" and change him up to your liking, or just don\\'t download :P.\r\n\r\nWhat this includes :\r\n\r\nGame save 2 - Immediately after gaining control of your character in the tower with Raloff and Ulfric. Character will look a little different from the screenshots, got some dirt and scars on his face, but for the most part identical. This allows you to choose your path, Imperial or Stormcloak.\r\n\r\nGame save 3 - After entering Helgen Keep with Raloff (think about it, would you follow someone who was going to lop off your head ?) First 2 Imperial Guards are dead, looted their bodies, first gate locked, key in inventory, character located in the room where you would enter the keep with Hadvar. This is the character the screenshots were taken from inside the keep, face has no dirt or scars.\r\n\r\nConan.txt file - Included this for the Role Players. I only recommend using this if you have the difficulty cranked up, gives you permanent buffs to health, stam, carry weight, movement speed, poison and disease resistance, Imperial Luck spell from Imperials and Adrenaline Rush spell from Redguards. Base Nord stats are unchanged. Also gives you a good head start on skills, perks, and some items and gold. It\\'s easy enough to take out or edit what you don\\'t want to use, just go to the line entry you want to remove and delete it, or edit the value, save and exit. My explanation of this : Well IT IS Conan ! You haven\\'t got to use the batch file, just dont install it. \r\n                 \r\nScreenshots - 11 Screenshots taken during character creation.\r\n\r\nInstall:\r\n-------------\r\n\r\nUse 7zip or WinRar to extract the files.\r\n\r\nPlace save file of your choice in C:\\\\Users\\\\Username\\\\My Documents\\\\My Games\\\\Skyrim\\\\Saves (click \\'yes to overwrite\\' if needed)\r\n\r\nPlace the Conan.txt file to your Skyrim install folder where your TESV.exe file is located ex: c:\\\\Program files (x86)\\\\Steam\\\\SteamApps\\\\Common\\\\Skyrim (Click \\'yes to overite\\' if needed)\r\nTo use this open the console in game, type in \\\"bat Conan\\\" without the quotation marks, hit enter, and exit the console.\r\n\r\nUninstall:\r\n---------------\r\n\r\nJust delete the files from where you installed them. No Textures or Meshes to worry about.\r\n\r\n\r\nTo get the exact look of the character in the screenshots see mods used below listed in credits. Without those mods your character will not look like the screenshots. It will be similar, but not an exact copy.\r\n\r\nUsed mods:\r\n-----------\r\nCharacter creation:\r\nNo More Blocky Faces by Xenius - http://www.skyrimnexus.com/downloads/file.php?id=30\r\nHigh Quality Eyes by Xenius - http://www.skyrimnexus.com/downloads/file.php?id=498\r\nYounger Looking Men - Optional 2048x2048 and now for Elves by Emerj - http://www.skyrimnexus.com/downloads/file.php?id=1804\r\nHair Retexture - Telthalions Finer Hair by Telthalion - http://www.skyrimnexus.com/downloads/file.php?id=2207\r\nBody Mesh and Texture - Nude Male with Import from Roberts new vegas male by Sundracon - http://www.skyrimnexus.com/downloads/file.php?id=3421\r\n\r\nArmor and Weapons seen in screenshots:\r\nLight Imperial Bracers and Boots, Imperial Sword - Imperial Armor by Aremeta - http://www.skyrimnexus.com/downloads/file.php?id=2492\r\nDarkened Hide armor - Rangers Armor_Leather Replacement by rahman530 - http://www.skyrimnexus.com/downloads/file.php?id=3994\r\nIron Greatsword retexture - Weapon Retexture Project WRP by Millenia - http://www.skyrimnexus.com/downloads/file.php?id=1754\r\nDraugr Armor - Draugr Armor replacement by Prometheus - http://www.skyrimnexus.com/downloads/file.php?id=2794 \r\n\r\n*** You can make the Draugr Armor Light Armor by using Omegared99\\'s esp file found here : http://www.skyrimnexus.com/downloads/file.php?id=2624 ***\r\n\r\n\r\nCredits\r\n-------\r\nThanks Bethesda for creating Skyrim !\r\nThanks to all the above mentioned mod authors for making my journey through Skyrim more enjoyable !",
  "categoryId": "43",
  "version": "",
  "author": "Badger375",
  "createdUnix": "1324417070",
  "updatedUnix": "1324418450",
  "containsAdultContent": true,
  "uploadedBy": "r_enoch2000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "12438",
      "name": "Conan the Cimmerian",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6785",
      "fileName": "Conan the Cimmerian-4221-1.7z",
      "uploadedUnix": "1324418450",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7ca5153f7b8d6a945cfeb79e1924f6f4dd4d964e9dbe1b0d87ca4ede2b4040b5/analysis/1406541376/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Conan%20the%20Cimmerian-4221-1.7z?fid=12438&ttl=1535759841&ri=8192&rs=8192&setec=00def5f510dc833e6d132a16dc43d2c2"
    }
  ]
}