{
  "modId": 42318.0,
  "modName": "Carlotta Valentia - Happy Ending",
  "summary": "A small mod that adds an immersive way to marry Carlotta Valentia and adopt her daughter Mila.",
  "descriptionHtml": "  A small mod that adds a more immersive way to marry Carlotta Valentia than just making her available to marry right away since that would break her character,  it\\'s also filled with cheesy dialogue. It requires Hearthfire.\r\n\r\n  Since Carlotta only cares for her daughter she doesn\\'t want just any lowlife in her life so for the Dragonborn to have a chance he or she must first become the Thane of Whiterun and of course help her with that Bard problem.  Also you must finish the regular marriage prerequisites (visit the Temple of Mara in Riften and speak with that priest guy and be wearing the amulet).  After you propose to Carlotta you can speak with her daughter Mila to adopt her through a short dialogue.\r\n\r\n  This mod uses scripts during the dialogues which enable the player to marry Carlotta and adopt Mila so as not to break immersion when interacting normally with them. It\\'s assumed that once the relevant dialogues are started you mean to go through with marrying Carlotta and adopting Mila. If you abort for some reason you might break something regarding the two characters.  I\\'m not proficient enough to be able to make a completely custom marriage and adoption dialogue so I link to the vanilla ones. This works well in all the tests I ran but the final step for adopting Mila is a little coarse (the standard urchin dialogue pops up and Mila acts like an urchin until she moves to her new home).\r\n\r\n Be warned that this is my first Skyrim mod so there might be some bugs, feel free to let me know if you find any or if you\\\\\\'d like to give pointers on how to improve upon this.\r\n\r\n---------------------------------------\r\n\r\nThis mod adds an immersive way to marry Carlotta Valentia and adopt her daughter Mila.\r\n\r\n > Requires Hearthfire!\r\n > This mod links to the vanilla Adoption and Marriage dialogues/scripts, so it should work\r\n   with multiple adoption mods as long as they don\\'t change the vanilla adoption process. \r\n   Be warned that there has been no compatability testing done with any of those mods so use\r\n   this together with them at your own risk (at least keep a backup of your save).\r\n\r\nTo initiate the additional dialogue :\r\n * Finish regular marriage pre-requisites.\r\n * Finish Carlottas personal quest and have a free children\\'s bedroom in your home.\r\n * If the player is not the Thane of Whiterun he will be rejected by Carlotta.\r\n * After the player has married Carlotta he needs to talk to Mila to officially adopt her.\r\n\r\nRecommended actions :\r\n -- The newlyweds should move to the Players home and NOT Carlottas home --\r\n -- The dialogue to get her house keys should be finished directly after choosing a home --\r\n\r\nChangelog :\r\n\r\n0.3 / 17.9.2013 :\r\n * Added a readme file (this file).\r\n * Changed Dialogue Conditions;\r\n  - The player must now own a house with a free children\\'s bed before he can talk to Carlotta\r\n  - The player must now finish the marriage ceremony before talking to Mila\r\n * Added a workaround to a problem were Carlotta wouldn\\'t give her keys to the player and the player wouldn\\'t be added to her home faction.\r\n  - This is done via an additional dialogue that\\'s accessible after the marriage,\r\n  - It\\'s reccomended that the player finishes that dialogue as soon as the home is chosen (which should be the players home and NOT carlottas).\r\n * Fixed an issue with the adoption where Mila would stay in an endless loop and not move to her home (hopefully)\r\n * Changed AI Package conditions for Mila Valentia, she should now have the same AI packages as Lucia after she is adopted.\r\n * Fixed spelling and grammar errors.\r\n * Changed author name to reflect my username on Nexusmods (sorry if this caused some confusion).\r\n\r\n0.2 / 15.9.2013 :\r\n * Initial public release.\r\n\r\n0.1 :\r\n * Private first release.\r\n\r\nAuthor : Sicarius100",
  "categoryId": "24",
  "version": "0.3",
  "author": "Sicarius100",
  "createdUnix": "1379224255",
  "updatedUnix": "1379379175",
  "containsAdultContent": false,
  "uploadedBy": "sicarius100",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000055568",
      "name": "CV-HE 0_2",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Carlotta Valentia - Happy Ending-42318-0-2.zip",
      "uploadedUnix": "1379223995",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/0db0b05455baed5f853126979b38f6e177ca5d83763cbc0c690b570c3d21cd42/analysis/1407723134/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Carlotta%20Valentia%20-%20Happy%20Ending-42318-0-2.zip?fid=1000055568&ttl=1535823177&ri=8192&rs=8192&setec=b4766d0f7074556caaf18cd84d9f649c"
    },
    {
      "fileId": "1000056002",
      "name": "CV-HE 0_3",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "CV-HE 0_3-42318-0-3.zip",
      "uploadedUnix": "1379379175",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/6b2e132258e9f0bba41d3cb5700c4a2224267a847af1c462fb5eebcd3ca34801/analysis/1407725684/",
      "changelogHtml": "  * Added a readme file.\r<br /> * Changed Dialogue Conditions;\r<br />  - The player must now own a house with a free children&#39;s bed before he can talk to Carlotta\r<br />  - The player must now finish the marriage ceremony before talking to Mila\r<br /> * Added a workaround to a problem were Carlotta wouldn&#39;t give her keys to the player and the player wouldn&#39;t be added to her home faction.\r<br />  - This is done via an additional dialogue that&#39;s accessible after the marriage,\r<br />  - It&#39;s reccomended that the player finishes that dialogue as soon as the home is chosen (which should be the players home and NOT carlottas).\r<br /> * Fixed an issue with the adoption where Mila would stay in an endless loop and not move to her home (hopefully)\r<br /> * Changed AI Package conditions for Mila Valentia, she should now have the same AI packages as Lucia after she is adopted.\r<br /> * Fixed spelling and grammar errors.\r<br /> * Changed author name to reflect my username on Nexusmods (sorry if this caused some confusion). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CV-HE%200_3-42318-0-3.zip?fid=1000056002&ttl=1535823178&ri=8192&rs=8192&setec=07a0f1a3b759a0b6caf4e60c57155a02"
    }
  ]
}