{
  "modId": 42324.0,
  "modName": "WIP-Mage-Light Underground",
  "summary": "WIP; An underground club, lit by mage-light selling &#39;illegal&#39; spells and artifacts. Accompanied by unique NPC&#39;s with different personalities and back-stories.",
  "descriptionHtml": "Just going with the description I put up in the forums, I&#39;ll repeat it here and when I say repeat I mean copy & paste then read through it all altering bits and pieces here and there.\r<br />\r<br />Inspired by the Ningheim Race and this train of thought that wouldn&#39;t leave me alone:\r<br />\r<br />It always bothered me that conjuration was the only class of magic that inherently had little hidden &#39;illegal&#39; groups all over skyrim. Like it&#39;s the only real bad magic out there but I can understand how it would be considered the worst. Raising the dead is after all frowned upon. Yet what about Illusion magic? No one seems to really notice how incredibly devious and dangerous it is. As one guard quotes “Those illusions are impressive&#33;” Probably the biggest one I have beef with though is destruction. Now I&#39;ll give this that guards are wary of you but...isn&#39;t burning someone alive just as bad as raising the dead? That&#39;s a very cruel death. It seems like there should be a place out there for all the schools of magic not really to learn spells but sell them, forbidden magical tombs and artifacts and the like. A club of &#39;Illegal&#39; mages lit by Mage-light. Having a small arena for magic duels that people can watch from above, bars with unique drinks, and pretty much filled with unique &#39;rebel&#39; mages.\r<br />\r<br />- Alot of the meshes and textures seen are by Oaristys, so *high-five* for her, seriously.\r<br />- REQUIRED:\r<br />                * Dawnguard\r<br />\r<br />Now as a learning modder, I cannot guarantee perfection and there are some things I will have to make changes to because I have no way of getting it done or *ahem* there&#39;s no tutorial for me to learn from. I would appreciate any help or person willing to pitch in adding their own kick and flare whether it be by suggestions, texturing, or modding itself. If that latter two are what you wish I&#39;ll hook you up with a download. The best mods are usually those with more than one mind working.",
  "categoryId": "89",
  "version": "V1.0",
  "author": "Amberlyn0007",
  "createdUnix": "1379233649",
  "updatedUnix": "1379233649",
  "containsAdultContent": false,
  "uploadedBy": "Amberlyn0007",
  "primaryFile": null,
  "files": []
}