{
  "modId": 42360.0,
  "modName": "Bethesda Performance Textures - Armor - Clothes - Weapons",
  "summary": "This mod takes the Bethesda hi-resolution armor, clothes, and weapons textures, and enhances them for maximum performance while maintaining as much detail as possible before resizing them. It was designed for people who run on 1GB of VRAM or less. ",
  "descriptionHtml": "[url=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/BPT-title-01.jpg.html][img]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/BPT-title-01.jpg~original[/img][/url]\r<br />Bethesda Performance Textures - Armor + Clothes + Weapons is a mod that takes the Bethesda hi-resolution textures for these three categories and resizes and enhances them for maximum performance while maintaining as much detail as possible. It was primarily designed for people who run on 1GB of VRAM or less, but also provides resource savings for those with beefier video cards. If you&#39;re running an ENB, and not getting the FPS you want in combat, then you might try trying these textures together with my Bethesda Performance Textures - Animals and Creatures mod. Skyrim, Dawnguard, and Dragonborn texture sets are included.\r<br />\r<br />The main goal was to improve the appearance at a smaller file size (to save resources), and to get a consistent level of detail across the board. Textures are scaled appropriately to the size of the item. Armors and clothes are resized to 1024x1024, while helmets/hats, boots/shoes, gauntlets/gloves are resized to 512x512. Most shields are 1024x1024 (some odd sizes due to texture dimensions). Large weapons (longswords, warhammers, daedric artifacts, etc.) are 1024x1024, while everything else is 512x512.\r<br />\r<br />If you can run the Skyrim vanilla textures, then you can run my textures just fine. The overall combined file size of these textures is actually slightly less than the default. The mod is standalone, so you don&#39;t need the hi-res packs to run my textures. But, since mine are loose files, they will overwrite the same textures in the Bethesda hi-res packs if they are active. That way, you can still get the other textures that aren&#39;t covered by this mod.\r<br />\r<br />[heading]NEW OPTION: 7/12/14 - Added an optional download for users with 1GB of VRAM or more. This add-on to the main mod, are 2K diffuse (color) textures of all the main armor and clothing textures. That&#39;s ONLY the main pieces, not the helmets, gauntlets, boots, etc. This will give you the added detail of a 2K texture, but they have all been enhanced and saved as DXT1A (with one exception, the Miraak robes), to reduce the file size. The normal Bethesda 2K hi-res pack armor and clothes that have an alpha layer are 5.6MB in size. Mine are only 2.8MB. Couple this with my reduced sized normal maps, and you have significant resource savings over the hi-res pack textures.\r<br />\r<br />I&#39;m offering this option to people who can handle bigger textures, but who want better performance as well. The 2K option added to the regular mod will give you the best combination of performance and visual quality.\r<br />\r<br />I should note, that people who are using the Bethesda Hi-res packs can still use this optional download to improve the performance and appearance of the main armor and clothing textures.[/heading]\r<br />\r<br />[b]ATTENTION:[/b] All users should update to version 3.0 to get all the prior fixes, plus a complete overhaul of the textures. Yep, I went back and revised all the textures. I decided to include all the relevant textures, not just the ones from the hi-res packs. I discovered that a number of normal maps were missing their spectral layer, or had a blank (pure white) spectral map. That means these textures were originally 100% reflective. Just what you don&#39;t want with a clothing or armor texture. In bright sunlight, those textures would look very washed out.\r<br />\r<br />So, I added any missing textures, and revised all the spectral layers of the the normal maps. I then further refined all the diffuse (color) textures to give them added dimensionality. Folds in clothing, and details in armor and weapons are more distinct now. This is a complete overhaul, as every single texture was enhanced in some way.\r<br />\r<br />I also went back and altered a few textures that always bothered me. The Orcish shield now properly matches the color of its armor, as does the Stalhrim shield. A few of the armors that had terrible fur textures have been revised to give them a softer, more realistic appearance (Hide and Steel were particularly bad originally). Black robes now look black, rather than a dirty brown, etc.\r<br />\r<br />There were too many changes to list them all, but rest assured, that this is a worthwhile update, so all users are urged to download version 3.0.\r<br />[url=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/Update_3_0.jpg.html][img]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/Update_3_0.jpg~original[/img][/url]\r<br />\r<br />OPTIONAL: Children clothes retextured in a lore-friendly Nord fashion. I kept the default color scheme, but added Nord style appliqué and embroidery designs to the children clothes to give them more visual interest and style. An option for those people who are bored by the vanilla children clothes, but want something that sticks with the Nord style.\r<br />\r<br />BONUS: Added BPT - Tamriel Objects textures for download. This may be the single most used texture in the game. It&#39;s the object LOD file for all the architecture in the game. Bethesda never made a hi-res version of the file, so a single 2048x2048 texture has all the distant LOD art for every city, town, and fort in the game. The original texture is 5.6 MB with a 699 MB normal map. I enhanced the texture to define the tiny details better, and added more detail to the normal map. But, being a BPT mod, I also cut the file size in half by using a DXTA compression. What you get is better appearance and performance.\r<br />\r<br />UPDATE: Tamriel Objects now version 2.0 with Dawnguard castle added, and further enhanced detail. All users should update to version 2.0.\r<br />\r<br />OPTIONAL: Added male and female body msn (normal map) textures for further performance boost. The Bethesda hi-res 2K body model-space normal maps are 16.8 MB in size. That&#39;s a big file, for every NPC in the game, so it does affect performance. I&#39;ve added an optional download of a 1K body msn that&#39;s only 2.8 MB in size. That&#39;s a 14 MB of resource savings per NPC.  This should give a noticeable boost to FPS when in battle with multiple NPCs.\r<br />\r<br />[heading]This mod was designed to compliment my [url=http://skyrim.nexusmods.com/mods/43921/?] Bethesda Performance Textures - Animals and Creatures [/url] mod.[/heading]\r<br />\r<br />[url=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/BPT-Slides-Ver3_title.jpg.html][img]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/BPT-Slides-Ver3_title.jpg~original[/img][/url]\r<br />[url=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/BPT-title-02.jpg.html][img]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/BPT-title-02.jpg~original[/img][/url]\r<br />\r<br />I originally created this mod for myself, since I had only 1GB of VRAM in my setup, so using Bethesda hi-resolution textures was out of the question. Even with mods like Bethesda Hi-Res Optimized, the 2K textures were too much for my limited graphics memory. I&#39;ve added a lot of nice texture replacers to my Skyrim, but what I ended up with was a beautiful by nearly unplayable game. Frequent infinite loading screens and CTDs while entering new cells is not a fun experience, no matter how nice the game might look. So, what I did was go through all my textures, one by one and optimize them - both in file size, and appearance.\r<br />\r<br />This is not a simple resizing of the Bethesda hi-resolution textures. I examined each texture and enhanced the detail, color balance, and contrast before resizing and saving them to get the maximum performance and appearance possible (using the main armor/clothes as the reference to match the other pieces to). I no longer suffer loading screen loops and CTDs whenever I enter a texture heavy cell. My FPS has increased greatly, as has my enjoyment of Skyrim.\r<br />\r<br />[url=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/BPT-title-03.jpg.html][img]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/BPT-title-03.jpg~original[/img][/url]\r<br />\r<br />Though this mod is mainly intended for people like myself who have a limited amount of VRAM, it can also benefit those who have more graphics memory available. Now that we&#39;ve learned that Skyrim has a 3.1GB hard memory cap, it makes sense to save resources where you can. Any memory saved, can be used to either improve performance (FPS), or allow the use of bigger textures where they will be most useful.... on large textures. Does anyone really care if every bandit or forsworn is wearing 2K armors sets? Why not save the 2K textures for the armors your character of followers are wearing?\r<br />\r<br />By limiting the resource hit of the armors, clothes and weapons of NPCs in the game, You have more memory available to improve larger textures, like the city environs, or landscape textures. In my view, the smaller the object, the smaller the texture can be, and still look acceptable in game (provided it is optimized for clarity and color/contrast). When you&#39;re in a battle with numerous forsworn, bandits, or necromancers, you should get a higher FPS with this mod. So, even though this mod was originally intended for gamers with 1GB of VRAM (or less), it will give a performance boost to those who have more video memory at their disposal.\r<br />\r<br />[url=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/BPT-title-06.jpg.html][img]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/BPT-title-06.jpg~original[/img][/url]\r<br />\r<br />What I learned in reworking the Bethesda hi-resolution textures was surprising to me. You&#39;d think that a big game studio like Bethesda would have clear standards for how textures were created (and saved). Sadly, there doesn&#39;t appear to be a real standard for sizing or compression with the hi-res textures. And not all 2K textures are created equal. A high pixel count doesn&#39;t necessarily mean it&#39;s a quality texture.\r<br />\r<br />Many of the hi-res textures are saved as DXT3 or DXT5, when they only have a simple &#34;knockout&#34; alpha, or sometimes, when they have no alpha at all. A 2K texture that should be 2.8 MB is therefore  doubled to 5.6 MB. That&#39;s an enormous waste of resources, when you multiply it by all the armor, clothes, and weapons in the game. My textures maintain as much detail as possible while most 1K armors and clothes are only 699 KB in size (1K normal maps are 1.4 MB).... smaller pieces are even smaller in file size. That&#39;s quite a big savings in graphics memory.\r<br />\r<br />For a general file size comparison, the armor, clothes, and weapons of the Bethesda hi-resolution textures take up just over 2 GB of storage (for just the Skyrim textures - DLCs not included). My optimized version of the same textures take up 586 MB of storage. You get the same type of resource savings for the DLC textures. For all the armor/clothes/weapons (Skyrim plus both DLCs), my revamped textures total 761 MB. That lightens the load on your graphics card quite a bit.\r<br />\r<br />There&#39;s no consistency when it comes to the size of Bethesda&#39;s hi-res textures. Some armor sets have 2K textures for every piece... cuirass, helmet, boots and gauntlets. If they are 5.6MB textures, that&#39;s a bunch of memory wasted on one set of armor. There are other sets that have 2K cuirass, but 1K textures for the other pieces. And then, you have some armor/clothes sets that are missing hi-res textures for some pieces. So, for example, you&#39;ll have a 2K cuirass, paired with a vanilla 512x512 boot (or shoe/hat for clothing sets). In some cases, my textures are superior to the Bethesda hi-res versions, because either they were 1K to begin with, or some textures were overlooked by Bethesda. In those cases, I am including enhanced versions of the vanilla pieces.\r<br />\r<br />Lastly, you&#39;ll have armor, clothes, and weapon sets that are drawn by different artists. For example, the cuirass will be in one style, while the gauntlets, helmet, or boots will be in another. Sometimes, the stylistic differences are quite noticeable. And the worst of all, you have &#34;hi-res&#34; textures that are just poor quality textures - ill-defined, or just plain ugly. A few, are frankly embarrassingly bad, and I don&#39;t know why Bethesda ever bothered including them (luckily, these are rare).\r<br />\r<br />What I did, was enhance the overall detail, color balance, and contrast levels, while matching the individual pieces to each other as best as possible. Textures are sized according to the size of the object, so the level of detail is consistent (unlike Bethesda&#39;s &#34;anything goes&#34; approach). With the really poor textures, there was only so much I could do to improve them.... this isn&#39;t a full-on retexture mod, just a texture enhancement and performance mod. I did do extra &#34;burning and dodging&#34; of the worst textures to improve them as much as I could... short of redoing them entirely.\r<br />\r<br />[url=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/BPT-title-04.jpg.html][img]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/BPT-title-04.jpg~original[/img][/url]\r<br />\r<br />NMM or manual installation. To install the textures, you have to choose which option is for you. If you have Skyrim and all the DLCs, then you can use the BPT - All option. If you just have Skyrim, use the BPT - Skyrim option. I also have the Dawnguard and Dragonborn sets as seperate options, so if you have one and not the other, just pair the one you have with the BPT - Skyrim option.\r<br />\r<br />For manual installation, just download the appropriate options and drag, drop, and overwrite (if needed) the textures in your Skyrim Data folder.\r<br />\r<br />* Installation for BPT - Tamriel Objects\r<br />\r<br />File path is Data &gt; Textures &gt; Terrain &gt; Tamriel &gt; Objects for manual installation.\r<br />\r<br />[center][youtube]ygrE4TjAZ1E[/youtube][/center]\r<br />\r<br />[url=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/BPT-Tamriel-Objects.jpg.html][img]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/BPT-Tamriel-Objects.jpg~original[/img][/url]",
  "categoryId": "36",
  "version": "3.0",
  "author": "Gamwich",
  "createdUnix": "1379461814",
  "updatedUnix": "1405192137",
  "containsAdultContent": false,
  "uploadedBy": "Gamwich",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000057865",
      "name": "BPT_ALL_ver2",
      "version": "Ver2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "519179",
      "fileName": "BPT_ALL_ver2-42360-Ver2-0.zip",
      "uploadedUnix": "1380057122",
      "modVersion": "Ver2.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_ALL_ver2-42360-Ver2-0.zip?fid=1000057865&ttl=1535823214&ri=8192&rs=8192&setec=9c9a36733a79691b6ee74027321c4e8b"
    },
    {
      "fileId": "1000057879",
      "name": "BPT_Skyrim_ver2",
      "version": "Ver2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "393256",
      "fileName": "BPT_Skyrim_ver2-42360-Ver2-0.zip",
      "uploadedUnix": "1380059241",
      "modVersion": "Ver2.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_Skyrim_ver2-42360-Ver2-0.zip?fid=1000057879&ttl=1535823214&ri=8192&rs=8192&setec=c6c5dd115baddf224d96ee2bab6433be"
    },
    {
      "fileId": "1000057884",
      "name": "BPT_DLC01_ver2",
      "version": "Ver2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "46400",
      "fileName": "BPT_DLC01_ver2-42360-Ver2-0.zip",
      "uploadedUnix": "1380059982",
      "modVersion": "Ver2.0",
      "virusScanUrl": "https://www.virustotal.com/file/7746f3c56a518e952f66b180e4667edd7a7f07ff3ff638d2f671ccf6fb1b6bb1/analysis/1407733747/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_DLC01_ver2-42360-Ver2-0.zip?fid=1000057884&ttl=1535823215&ri=8192&rs=8192&setec=3a75550f9b8e6b4cc8fcfbb513261cf2"
    },
    {
      "fileId": "1000057897",
      "name": "BPT_DLC02_ver2",
      "version": "Ver2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "79535",
      "fileName": "BPT_DLC02_ver2-42360-Ver2-0.zip",
      "uploadedUnix": "1380064085",
      "modVersion": "Ver2.0",
      "virusScanUrl": "https://www.virustotal.com/file/15c6d8a4f47ad4bc54789e85f61472ac35bc967a26a78cfe7e228995d40d775f/analysis/1407733874/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_DLC02_ver2-42360-Ver2-0.zip?fid=1000057897&ttl=1535823215&ri=8192&rs=8192&setec=8442eff6c5114f3eeb7353ea94aba8a5"
    },
    {
      "fileId": "1000059448",
      "name": "BPT -Tamriel Objects_ver2",
      "version": "Ver2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2310",
      "fileName": "BPT -Tamriel Objects-42360-Ver2-0.zip",
      "uploadedUnix": "1380390614",
      "modVersion": "Ver2.0",
      "virusScanUrl": "https://www.virustotal.com/file/680cb4a35ab01b5044fb907a79419f040f7514ebc3536cfe9f62e9ca70a3099a/analysis/1407738110/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT%20-Tamriel%20Objects-42360-Ver2-0.zip?fid=1000059448&ttl=1535823216&ri=8192&rs=8192&setec=8adacb406154975fede626ef5c4a18b2"
    },
    {
      "fileId": "1000065482",
      "name": "BPT_Character",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2466",
      "fileName": "BPT_Character-42360-1-0.zip",
      "uploadedUnix": "1381711534",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e57da36cbd83d1734758deb1b606f796c10b54eb02667ad2e8bb4a2cc195a4d2/analysis/1407755304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_Character-42360-1-0.zip?fid=1000065482&ttl=1535823216&ri=8192&rs=8192&setec=afaf55ae646022f365be31c761bf6eae"
    },
    {
      "fileId": "1000065887",
      "name": "BPT_Character_1_1",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3288",
      "fileName": "BPT_Character_1_1-42360-1-1.zip",
      "uploadedUnix": "1381787334",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ab9c4c0bc6ca97d084af59fb2f9ad984d13b32684de3dbf64dafa6927205e361/analysis/1407756374/",
      "changelogHtml": " BPT - Character - Optimized 2K body model-space normal maps at 2.8 MB file size. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_Character_1_1-42360-1-1.zip?fid=1000065887&ttl=1535823217&ri=8192&rs=8192&setec=d5ee223ae7ebb4d8388d557217429ae7"
    },
    {
      "fileId": "1000066926",
      "name": "Farmclothes03 Patch",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2141",
      "fileName": "Farmclothes03 Patch-42360-1-0.zip",
      "uploadedUnix": "1381973638",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f072e2b7fc8c1c1104881a520931a1a5a74fdb3abeb9e3557b419ab115d690a6/analysis/1407758584/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Farmclothes03%20Patch-42360-1-0.zip?fid=1000066926&ttl=1535823217&ri=8192&rs=8192&setec=2320bb38f8d3bf27994ed74bc5629c81"
    },
    {
      "fileId": "1000073117",
      "name": "BPT_Glass_Cuirass_Fix",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "699",
      "fileName": "BPT_Glass_Cuirass_Fix-42360-1-0.zip",
      "uploadedUnix": "1383198123",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a56881773a4a5cd187016526f6f5599cd44bc673ff1a57b84d8daf525a195bee/analysis/1407776009/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_Glass_Cuirass_Fix-42360-1-0.zip?fid=1000073117&ttl=1535823217&ri=8192&rs=8192&setec=338bc1d0acc57748b09d25481ad04aed"
    },
    {
      "fileId": "1000074315",
      "name": "Children Nord Clothes",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4396",
      "fileName": "Children Nord Clothes-42360-1-1.zip",
      "uploadedUnix": "1383443294",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/eda43f206412dfb777fed309589bcdffc08cd6bf082fac287de835cb8661d02d/analysis/1407779001/",
      "changelogHtml": " BPT - Character - Optimized 2K body model-space normal maps at 2.8 MB file size. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Children%20Nord%20Clothes-42360-1-1.zip?fid=1000074315&ttl=1535823218&ri=8192&rs=8192&setec=5e63d745cec8afbc2c4286895a5f094f"
    },
    {
      "fileId": "1000087344",
      "name": "BPT_Misc",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "701",
      "fileName": "BPT_Misc-42360-1-0.zip",
      "uploadedUnix": "1387411961",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/eaece3311b635d01810af045353a7b5f0a01e892a4335a276d52ef63f4c9b672/analysis/1407848347/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_Misc-42360-1-0.zip?fid=1000087344&ttl=1535823218&ri=8192&rs=8192&setec=55ab09a248ed2b0238402dc3b71b038b"
    },
    {
      "fileId": "1000101018",
      "name": "Falmer_Arrow_Fix",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "119",
      "fileName": "Falmer_Arrow_Fix-42360-1-0.zip",
      "uploadedUnix": "1394680511",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0fe5744fa44efbdd0b825e4e2ad0977ff17526cd21e822436c0177145a40c792/analysis/1407980347/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Falmer_Arrow_Fix-42360-1-0.zip?fid=1000101018&ttl=1535823219&ri=8192&rs=8192&setec=3305e3a93eda2ff7d3a577957abf4cfe"
    },
    {
      "fileId": "1000112455",
      "name": "BPT_DLC01_3_0",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45717",
      "fileName": "BPT_DLC01_3_0-42360-3-0.zip",
      "uploadedUnix": "1402355326",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/01a76537dba43892002cbad6022bcee56498c92f0450c950aa9c467d18b6880a/analysis/1408120096/",
      "changelogHtml": " Revised all the textures, added all previous fixes and any relevant textures left out of the hi-res pack. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_DLC01_3_0-42360-3-0.zip?fid=1000112455&ttl=1535823219&ri=8192&rs=8192&setec=d2a3b58b3c3471bd0351fbd128ce61d5"
    },
    {
      "fileId": "1000112456",
      "name": "BPT_DLC02_3_0",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "80086",
      "fileName": "BPT_DLC02_3_0-42360-3-0.zip",
      "uploadedUnix": "1402355687",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/2dc0fbdcf97ced5139335967179df2b5a210127ea949d8982504791f2d6cf349/analysis/1408120110/",
      "changelogHtml": " Revised all the textures, added all previous fixes and any relevant textures left out of the hi-res pack. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_DLC02_3_0-42360-3-0.zip?fid=1000112456&ttl=1535823220&ri=8192&rs=8192&setec=98e2e6d3847386301652a58843eb0660"
    },
    {
      "fileId": "1000112458",
      "name": "BPT_Skyrim_3_0",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "406351",
      "fileName": "BPT_Skyrim_3_0-42360-3-0.zip",
      "uploadedUnix": "1402357226",
      "modVersion": "3.0",
      "virusScanUrl": null,
      "changelogHtml": " Revised all the textures, added all previous fixes and any relevant textures left out of the hi-res pack. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_Skyrim_3_0-42360-3-0.zip?fid=1000112458&ttl=1535823220&ri=8192&rs=8192&setec=bcbfa05ce79587b0548823bf018e5563"
    },
    {
      "fileId": "1000112461",
      "name": "BPT_ALL_3_0",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "532152",
      "fileName": "BPT_ALL_3_0-42360-3-0.zip",
      "uploadedUnix": "1402358236",
      "modVersion": "3.0",
      "virusScanUrl": null,
      "changelogHtml": " Revised all the textures, added all previous fixes and any relevant textures left out of the hi-res pack. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_ALL_3_0-42360-3-0.zip?fid=1000112461&ttl=1535823221&ri=8192&rs=8192&setec=cb82b8400cbdd513fa80274545ef664a"
    },
    {
      "fileId": "1000113347",
      "name": "BPT - Steel Boot Fix",
      "version": "1.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "138",
      "fileName": "BPT - Steel Boot Fix-42360-1-0.zip",
      "uploadedUnix": "1403023616",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a74e6bef4b855af397de3ee17aef0aab4fd5977d23d462695d7461e30c0b392a/analysis/1408130825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT%20-%20Steel%20Boot%20Fix-42360-1-0.zip?fid=1000113347&ttl=1535823221&ri=8192&rs=8192&setec=336c1d0095e62fda009e9d77874786e2"
    },
    {
      "fileId": "1000117167",
      "name": "BPT_2K_ALL",
      "version": "3.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "382764",
      "fileName": "BPT_2K_ALL-42360-1-0.zip",
      "uploadedUnix": "1405190102",
      "modVersion": "3.0",
      "virusScanUrl": null,
      "changelogHtml": " Revised all the textures, added all previous fixes and any relevant textures left out of the hi-res pack. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_2K_ALL-42360-1-0.zip?fid=1000117167&ttl=1535823222&ri=8192&rs=8192&setec=0f316d83faedb2760d3fa1a570d6f67c"
    },
    {
      "fileId": "1000117174",
      "name": "BPT_2K_SKYRIM",
      "version": "3.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "293700",
      "fileName": "BPT_2K_SKYRIM-42360-1-0.zip",
      "uploadedUnix": "1405192137",
      "modVersion": "3.0",
      "virusScanUrl": null,
      "changelogHtml": " Revised all the textures, added all previous fixes and any relevant textures left out of the hi-res pack. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BPT_2K_SKYRIM-42360-1-0.zip?fid=1000117174&ttl=1535823222&ri=8192&rs=8192&setec=2a1bf220b308666b18337a1242e0a4ec"
    }
  ]
}