{
  "modId": 42388.0,
  "modName": "Better Journal Mesh - Modders Resource",
  "summary": "An optimised and accurately UV-mapped version of the Skyrim Journal mesh. Contains both World and Inventory versions of the Journal. Allows easy use of a single 1024x512 wrap-around cover.",
  "descriptionHtml": "[img]http://www.dcoffey.co.uk/images/betterjournalmesh/BJM_Banner_Large.jpg[/img]\r<br />\r<br />Dissatisfied with the atrocious and distorted UV-mapping in the vanilla Skyrim Journal mesh? Frustrated that you cannot create a true wrap-around cover like you could in Oblivion when creating a new Journal for your mod? Concerned that visitors to your in-game Library will find their computers struggling to display all those Journals and Books? This is the resource for you.\r<br />\r<br />This mod contains optimised and accurately UV-mapped versions of the Skyrim Journal meshes ready for you to add your own custom Journal cover texture.\r<br />\r<br />SEE ALSO : [url=http://skyrim.nexusmods.com/mods/37113]Better BOOK Mesh - Modders Resource[/url] AND [url=http://www.nexusmods.com/skyrim/mods/48471]Better NOTES Mesh - Modders Resource[/url]\r<br />\r<br />\r<br />[img]http://www.dcoffey.co.uk/images/betterjournalmesh/BJM_MeshesTextures.jpg[/img]\r<br />\r<br />There is just one type of Journal in Skyrim and this mod provides a new Mesh for that model.\r<br />\r<br />There are two meshes... the lower detail one (now around 300 triangles) which you see in the world of Skyrim and the more detailed one (now around 900 triangles) which you see in your inventory.\r<br />\r<br />The world view mesh consists of a simple fixed model of a Journal with no skeleton. The inventory view contains a more complex skeleton and a script since there is that page-turning animation to be played and text to be laid out onto the pages. The skeleton and Havok physics of the Journal have not been altered from Vanilla in any way.\r<br />\r<br />Instead of the Vanilla Journal making do with a single square 256x256 texture that is distorted and inaccurately mapped to its mesh, you can now use a single rectangular texture to cover your Journal.\r<br />\r<br />These meshes are based around a single 2:1 rectangular texture of say 512x256 or 1024x512 which wraps right around the Journal edge to edge. Included in the resource is a Photoshop template with helpful guide lines so that you can easily create custom textures for all your own Journals. All you have to do is choose your own leather stock, design a button and apply any dirt or scratches to your texture.\r<br />\r<br />The template includes a bleed area where the texture will be wrapped around the sides of the cover of your Journal. Remember that the flap will partly obscure the front cover when the Journal is closed. The texture on the outside of the Journal is repeated on the inside.\r<br />\r<br />Remember to save your visible texture file (*.dds) as DXT1 with mipmaps. The Normal/Specular map (*_n.dds) should be saved as DXT5 with mipmaps.\r<br />\r<br />To view your textures in-game you need to reference them in the meshes. Use NIFskope to open a copy of one of the meshes and refer to the pictures posted above to locate the correct BSShaderTextureSet group in which to declare the name of your texture. The texture itself goes first, followed by the normal/specular map. Remember to use relative paths from the Skyrim textures folder before publishing your mod.\r<br />\r<br />So that your Journals stack nicely on a bookshelf, don&#39;t forget to set the OBND Object Bounds for them. Suggested OBND settings are -6, -9, 0, 6, 8, 1.\r<br />\r<br />\r<br />[img]http://www.dcoffey.co.uk/images/betterjournalmesh/BJM_Optimisation.jpg[/img]\r<br />\r<br />The main change I have made to the Journal mesh is to dramatically reduce the number of polygons used by culling minuscule or out of sight triangles. The World view of a Journal goes down from 514 polygons to just 318 (38% fewer) and the Inventory view is down from 1136 polygons to 890 (22% reduction). Most of these savings have come from simplifying the ridiculous detail in the button on the cover of the Journal as well as filling in a few needless holes in the leather.\r<br />\r<br />I was able to dramatically increase the scope for detail in the button on a Journal without needing another texture for it since there was a strip of about 10% of the width of the texture left over when the cover was mapped and I used this to allow an enlarged area for the button texture which will be scaled appropriately on the actual model.\r<br />\r<br />I sewed up some holes in the model too which cleared a lot of redundant triangles. If you look at the left hand side of an open vanilla Journal in your inventory you will see a jagged hole. That is now gone in my new mesh. It is supposed to represent a &#34;button hole&#34; that the button would go through. If you think about it though, it is in the wrong place anyway. The button would be attached to the cover and the hole would be in the flap if there was one. Leather is a very inflexible material for button holes so it is far more likely that the button would stay on the flap and a cord or ribbon would be attached to the cover and wrapped round the post of the button to hold the Journal closed. Let&#39;s assume poppers haven&#39;t been invented yet. Long story short, the jagged hole is now gone.\r<br />\r<br />I tidied up the way the pages met on the lower edge and closed holes where you could see through to the back cover on the lower edge of the right page.\r<br />\r<br />There are still two issues with the Journal that I wish I could address but I cannot do anything about them. First is that when the Journal is open in your inventory, the texture is distorted and stretched on the inside of the flap on the right hand side. It is the skeleton of the model doing this and without adding a lot more bones to it, we are stuck with it. Secondly, in the same area, there are some triangular shadows clearly visible on lighter coloured Journals. It is present in the vanilla Journal mesh so is likely to be caused by the skeleton distorting triangles again. It is less obvious on darker leathers with low Specularity.\r<br />\r<br />\r<br />[img]http://www.dcoffey.co.uk/images/betterjournalmesh/BJM_FilesIncluded.jpg[/img]\r<br />\r<br />BJM_JournalWorld.nif - World mesh for the Journal\r<br />BJM_JournalInventoryCA.nif - Inventory mesh for the Journal\r<br />\r<br />BJM_JournalTemplate.psd - Photoshop template from which to create your own textures\r<br />BJM_JournalTemplate.dds - sample texture so that you can see what goes where on the cover\r<br />BJM_JournalTemplate_n.dds - sample normal/specular map\r<br />\r<br />BJM_JournalSample.dds - sample texture\r<br />BJM_JournalSample_n.dds - sample normal/specular map\r<br />BJM_JournalSample.png - sample texture in PNG format for easy viewing\r<br />\r<br />\r<br />[img]http://www.dcoffey.co.uk/images/betterjournalmesh/BJM_Permission.jpg[/img]\r<br />\r<br />You can use, modify or redistribute these files for any purpose without asking. Feel free to use the template to create your own textures and apply the meshes to Journals in your own (or any other) mod.\r<br />\r<br />\r<br />[img]http://www.dcoffey.co.uk/images/betterjournalmesh/BJM_Credits.jpg[/img]\r<br />\r<br />Hanaisse from TES Alliance (tesalliance.org) for extensive coaching in Blender and NIFskope.\r<br />Doccdr who was the original author of the [url=http://skyrim.nexusmods.com/mods/35399]Book Covers Skyrim[/url] mod for getting me started on this journey.",
  "categoryId": "82",
  "version": "1.2",
  "author": "DanielCoffey",
  "createdUnix": "1379358537",
  "updatedUnix": "1391708829",
  "containsAdultContent": false,
  "uploadedBy": "DanielCoffey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095624",
      "name": "Better Journal Mesh",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2069",
      "fileName": "Better Journal Mesh-42388-1-2.7z",
      "uploadedUnix": "1391708829",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/bcc44f99a9d08ee311383b190bd042230fbcbfdb4f46cea8422ad50179896be3/analysis/1407921134/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Journal%20Mesh-42388-1-2.7z?fid=1000095624&ttl=1535823259&ri=8192&rs=8192&setec=783d084b083c0c6f593574729b59d39b"
    }
  ]
}