{
  "modId": 42498.0,
  "modName": "Vanilla No DLC - Companions_ThievesGuild_Archmage_Thanes",
  "summary": "Complete save history, Vanilla no DLC or mods. Male Nord - kept at Level 1 (never leveled or perked.) Fairly clean map locations, only used TGM and COC to often get around when needed. Completed Companions, Thieves Guild, Archmage, and Thanes of all but WIndhelm. No Civil War, and Main Quest completed only to poin",
  "descriptionHtml": "[b]IMPORTANT!:[/b]\r\n10/27/2013: For those of you who are having problems with these saves crashing (CTD), try increasing the value of uGridsToLoad to at least 6 or 7 in your skyrim.ini under the GENERAL section. As these saves are vanilla, no mods are needed.\r\n\r\nAs a side note, I have found that by changing these three simple values can help make Skyrim more crash proof:\r\n[General]\r\nuExterior Cell Buffer=64\r\nuGridsToLoad=7\r\niPreloadSizeLimit=51380224\r\n\r\nYou can read more about it here:\r\nhttp://forums.bethsoft.com/topic/1274926-ugridstoload-skyrimini-comparisons-and-explanation-default-57911/\r\n\r\n[b]Updates:[/b]\r\n===========\r\n9/19/2013: Added additional Final Nord male save 78 but converted to my pretty vanilla Imperial female character. Raven looks especially pretty with any face smoothing mods such as Caliente, Bella, etc. In my third screenshot I used Caliente 3.2 with SG Female Textures Renewal and Ponytail Hairstyles 2.5. Wearing Linwe's Thieve's Guild armor with black re-texture mod. And with that jet-black hair she looks great as a vampire. ;)\r\n\r\n9/20/2013: Saves 79-93 added Thaneship for Falkreath, Morthal & Winterhold. Did Innocence Lost (got rid of Grelod), Destory Dark Brotherhood, Dawnstar's Waking Nightmare and full completion of Blood on the Ice in Windhelm. Added Aranea as a follower by doing Azura's Star to lend me a hand, as she is arguably the most powerful follower (maybe Erandur in Dawnstar is her equal). Note: all of these are doable prior to Hearthfire DLC. By the time you add Hearthfire, you're already 'Thaned', just need to buy your house and get your Housecarl. Can't do Thane of the Pale, as that requires a min. Level 22 or something to activate. Also, the last save in this batch is once again a conversion of my male Nord character to female Imperial Raven character.\r\n\r\n9/21/2013: Saves 94-120 is complete Dawnguard. Sided with Dawnguard, friendly with Serana. Never vamped - can always ask Serana to vamp you at any time. Once again, Raven conversion added as last save. (Yes, it is possible to initiate Dawnguard at Level 1 - just have to manually make your way to Fort Dawnguard and it will trigger.) Now you can get vamped, build your vamp castle with a vamp spouse and adopt your little vampettes.\r\n\r\n[b]Description:[/b]\r\n===========\r\nComplete save history - 78 save games from the beginning - that way you can jump into the game at any point. Vanilla no DLC or mods. Male Nord - kept at Level 1 (never leveled or perked*.) \r\n\r\nWhy? So you can level/perk to your own custom preferences. I did this for myself so I could have a clean point to test and play around with various mods, homes, Heathfire and the like, and because I held off on visiting the Greybeards, I could freely explore Skyrim for fun without having to worry about battling dragons at every turn.\r\n\r\nFairly clean map locations, only used TGM and COC to get around when needed. Completed Companions, Thieves Guild, Archmage, and Thanes of all but WIndhelm. No Civil War, and Main Quest progressed only to point of becoming Thane and purchasing Breezehome. None of the houses are decorated, so you can use house mods. \r\n\r\nGave myself ebony weapons to speed up and make possible running these quests at Level 1. Dump them in a river if you don't want them. All my stuff is in Breezehome chest. Give all my gold to a beggar if you don't want to keep it. Change character as you desire with RaceMenu.\r\n\r\nOne last thing: upon first meeting each of the Housecarls (and Mjoll), I temporarily loaded a mod (Bijin Warmaidens) to give each of them a permanent feminine stance and then immediately unloaded the mod to continue. I've never cared for Bethseda's take on giving the girls a male gunslinger stance and walk. Once you first meet each character, that is the permanent stance they have for the rest of the game as it is permanently stored in your save game. This way, all of the vanilla girls walk and stand like normal vanilla girls instead of men and without the need of mods. The only time you'll get a warning notice about a missing mod is if you load the save game right at the point of initially meeting the housecarl.\r\n\r\nP.S. Will eventually be adding Main Quest and both sides of Civil War as separate downloads.\r\n\r\n*Minor correction: I did manually add one perk: Speech - Investor. This was towards the end when I was Thaning myself. It allowed me to purchase Thaneship favors by investing in stores without having to run a gazillion favor errands. You can still run those quests at your whim and leisure. To remove the perk, open console and type player.removeperk 58f7b\r\n\r\n[b]Credits:[/b]\r\n===========\r\nBijin Warmaidens by rxkx22\r\n[url=http://skyrim.nexusmods.com/mods/40038/] http://skyrim.nexusmods.com/mods/40038/[/url]\r\n\r\nPonytail Hairstyles 2.5 by azarkiowa\r\n[url=http://skyrim.nexusmods.com/mods/31797/] http://skyrim.nexusmods.com/mods/31797/[/url]\r\n\r\nCalientes face texture from 3.2 by Caliente\r\n[url=http://skyrim.nexusmods.com/mods/2666/] http://skyrim.nexusmods.com/mods/2666/[/url]\r\n\r\nSG Female Textures Renewal by Hello Santa\r\n[url=http://skyrim.nexusmods.com/mods/35267/] http://skyrim.nexusmods.com/mods/35267/[/url]\r\n\r\nAnother Black Thieves Guild Armor by Shaft28\r\n[url=http://skyrim.nexusmods.com/mods/7163/] http://skyrim.nexusmods.com/mods/7163/[/url]",
  "categoryId": "43",
  "version": "1.0",
  "author": "Authorman",
  "createdUnix": "1379525014",
  "updatedUnix": "1379780360",
  "containsAdultContent": false,
  "uploadedBy": "authorman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000056377",
      "name": "Saves 1-78 - Vanilla NoDLC Companions_ThievesGuild_Archmage_Thanes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "145937",
      "fileName": "VanillaNoDLC_Companions_ThievesGuild_Archmage_Thanes-42498-1-0.zip",
      "uploadedUnix": "1379524686",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a0c1b293183394d086c0c31132d26cb380f08344428027fc4dff95a81cb3bc8a/analysis/1407727569/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VanillaNoDLC_Companions_ThievesGuild_Archmage_Thanes-42498-1-0.zip?fid=1000056377&ttl=1535823366&ri=8192&rs=8192&setec=39bab801b200ff35bcd1ceef20447d29"
    },
    {
      "fileId": "1000056448",
      "name": "Save 79 - Raven Imperial Female conversion",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2259",
      "fileName": "Save79_Raven_ImperialFemail-42498-1-0.zip",
      "uploadedUnix": "1379557029",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d6b73c0ed8f60f55ded3e24a7858ffdafce166f7f2732b34c6a6264383de74de/analysis/1407727866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Save79_Raven_ImperialFemail-42498-1-0.zip?fid=1000056448&ttl=1535823366&ri=8192&rs=8192&setec=9dc48aba7a93c60a7ca32038495a4b51"
    },
    {
      "fileId": "1000056776",
      "name": "Saves 79-93 - Vanilla NoDLC - added Thanes of Falkreath-Morthal-Winterhold plus Misc Quests",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "44058",
      "fileName": "VanillaNoDLC_ThanesFalkreathMorthalWinterhold_MiscQuests-42498-1-0.zip",
      "uploadedUnix": "1379719464",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7e6d2ecf14f4cddf29e791b676ce8eb0607c100cdaec5a6f19a7837c23f13f63/analysis/1407729556/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VanillaNoDLC_ThanesFalkreathMorthalWinterhold_MiscQuests-42498-1-0.zip?fid=1000056776&ttl=1535823366&ri=8192&rs=8192&setec=eb386456c2204630aa719d6aec46f44a"
    },
    {
      "fileId": "1000056909",
      "name": "Saves 94-120 - Vanilla Dawnguard",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "87683",
      "fileName": "Vanilla_Dawnguard_94-120-42498-1-0.zip",
      "uploadedUnix": "1379780360",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/52438504fcd670dce98fb0369f6202796c5aeca53bf996a69ab0d8506f5eff26/analysis/1407730154/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vanilla_Dawnguard_94-120-42498-1-0.zip?fid=1000056909&ttl=1535823367&ri=8192&rs=8192&setec=cdaa77900c175511e44a87c8554ca7da"
    }
  ]
}