{
  "modId": 42564.0,
  "modName": "Rings of Old - Morrowind Artifacts for Skyrim",
  "summary": "Adds 5 rings from TES:3 Morrowind to Skyrim. Follow a small undocumented quest to obtain them. For players who enjoy treasure hunts and who like a bit of Morrowind returned to their game!",
  "descriptionHtml": "[url=http://skyrim.nexusmods.com/users/887024/?tb=mods&pUp=1][img]http://i.imgur.com/zEzaLex.jpg[/img][/url]\r\n[img]http://i.imgur.com/FhrHjsz.png[/img]\r\n\r\n\r\n[size=6]Description[/size]\r\n\r\nThis mod adds 5 legendary rings to Skyrim that previously appeared in Morrowind. I thought Skyrim severely lacked in powerful magic jewelry and this mod goes some length to remedy that problem;)\r\n\r\nIn Morrowind all the “unique” rings just used the same model with some texture variations, making them not so unique at all. That’s why I tried my hand at some brand new models, fitting to the lore behind each artifact! Only one of the rings is modeled after the Morrowind original, so there’s a lot more visual difference between them. Also the model for the Ring of Khajiit was actually made by bethesda. The model and textures were present in the games .BSA files, but were never put in game. I just added it to this mod because it seemed like a fitting addition.\r\n\r\n[b]There’s a vanilla and Dawnguard version available for this mod! Obviously, you should only get the Dawnguard version if you have Dawnguard. There’s actually not much difference between the two. The Danwguard version adds another function to the Vampiric Ring (read more below).[/b]\r\n\r\n[IMG]http://i.imgur.com/HgPtZJN.png[/IMG]\r\n[size=1][i]The [b]Mentor\\'s Ring[/b] is a prized possession for any apprentice to magic. It lends the wearer the ability to increase their intelligence and wisdom, thus making their use of magic more efficient. The High Wizard Carni Asron is said to be the creator of the Ring. It was a construct for his young apprentices while studying under his guidance. After Asron\\'s death, the Ring and several other possessions vanished and have been circulated throughout Tamriel.[/i][/size]\r\n\r\n\r\n[IMG]http://i.imgur.com/SxZIp2s.png[/IMG]\r\n[size=1][i]The [b]Ring of the Khajiit[/b] is an ancient relic, hundreds of years older than Rajhin, the thief that made the Ring famous. It was Rajhin who used the Ring\\'s powers to make himself invisible and as quick as the breath of wind. Using the Ring, he became the most successful burglar in Elsweyr\\'s history. Rajhin\\'s eventual fate is a mystery, but according to legend, the Ring rebelled against such constant use and disappeared, leaving Rajhin helpless before his enemies.[/i][/size]\r\n—Yagrum Bagarn, Tamrielic Lore\r\n\r\n\r\n[IMG]http://i.imgur.com/NPbkRsl.png[/IMG]\r\n[size=1][i]The [b]Ring of Phynaster[/b] was made hundreds of years ago by a man who needed good defenses to survive his adventurous life. Thanks to the Ring, Phynaster lived for hundreds of years, and since then it has passed from person to person. The Ring improves its wearer\\'s overall resistance to poison, magicka, and shock. Still, Phynaster was cunning and cursed the ring so that it eventually disappears from its holder\\'s possessions and returns to another resting place, discontent to stay anywhere but with Phynaster himself.[/i][/size]\r\n—Yagrum Bagarn, Tamrielic Lore\r\n\r\n\r\n[IMG]http://i.imgur.com/npF0YQ2.png[/IMG]\r\n[size=1][i]One of the more deadly and rare artifacts in Tamriel is the [b]Vampiric Ring[/b]. It is said that the Ring has the power to steal its victim\\'s health and grant it to the wearer. The exact nature and origin of the Ring is wholly unknown, but many elders speak of its evil creation in Morrowind long, long ago by a cult of Vampire followers. The Vampiric Ring is an extremely rare artifact and is only seen every few hundred cycles of the moons..[/i][/size]\r\n\r\n\r\n[IMG]http://i.imgur.com/RgHxn0g.png[/IMG]\r\n[size=1][i]The [b]Warlock\\'s Ring[/b] of the Archmage Syrabane is one of the most popular relics of myth and fable. In Tamriel\\'s ancient history, Syrabane saved all of the continent by judicious use of his Ring, and ever since, it has helped adventurers with less lofty goals. It is best known for its ability to reflect spells cast at its wearer and to improve his or her speed and to restore health. No adventurer can wear the Warlock\\'s Ring for long, for it is said that the Ring is Syrabane\\'s alone to command.[/i][/size]\r\n—Yagrum Bagarn, Tamrielic Lore\r\n\r\n[center][img]http://i.imgur.com/eAH1wVp.png[/img][/center]\r\n\r\n\r\n[size=6]How to get it?[/size]\r\n\r\nAll rings can be acquired throughout a small undocumented quest. In Morrowind, legendary items were usually scattered throughout the world. They could be obtained by the player at any time (if you knew where to look), though they were usually heavily guarded. I want to return a bit of that feeling to Skyrim.\r\n\r\nA wealthy collector has set his eyes on these special rings. He has hired a mercenary to find and collect them. This enthusiastic (but maybe not too bright) adventurer has started his mission in Whiterun but forgotten his personal journal at the Bannered Mare. Look for it there and read the journal for clues on what to do next.\r\n\r\nThe rings are scattered through Skyrim so you’ll have to go on a  little treasure hunt. You’ll find further clues here and there so keep an eye out for notes.\r\n\r\nI did include some hints below for people who get stuck. Try figuring it out yourself first though!:)\r\n\r\n[center][img]http://i.imgur.com/eAH1wVp.png[/img][/center]\r\n\r\n\r\n[size=6]Usage permission[/size]\r\n\r\nUsually I don’t have a problem with people using my meshes/textures, etc. as resource for their own mods. I do have 2 conditions:\r\n\r\n- You only use these assets for your own mod in Skyrim. I don’t want my work used in other games or programs!\r\n\r\n- You notify me by mail that you want to use the mod. You don’t really need to ask for my permission, I just want to know when and where my work gets use. I see it as simple common courtesy.\r\n\r\n- You credit me as author of my assets in your mod.\r\n\r\n[center][img]http://i.imgur.com/eAH1wVp.png[/img][/center]\r\n\r\n\r\n[size=6]Installation[/size]\r\n\r\nI recommend using NMM to install the mod for you. It’s the easiest way.\r\n\r\nTo manually install, just drop the data folder from the archive into your main Skyrim directory. For most (Steam) players this will be at:\r\n\r\n(Drive letter:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim)\r\n\r\n[center][img]http://i.imgur.com/eAH1wVp.png[/img][/center]\r\n\r\n\r\n[size=6]Compatibility[/size]\r\n\r\nThis mod might conflict with mods that change the same locations or characters. I mostly used obscure locations but I also added objects to a few popular places. Biggest chance for conflicts will be with mods that greatly change the Bannered Mare and/or the Prison Dungeons in Whiterun. Also mods that change the Vampire Movarth Piquine might conflict. \r\n\r\n[center][img]http://i.imgur.com/eAH1wVp.png[/img][/center]\r\n\r\n\r\n[size=6]Versions and changes[/size]\r\n\r\nV 1.0\r\nInitial release\r\n\r\nV 1.1\r\nPlugins cleaned\r\n\r\n[center][img]http://i.imgur.com/eAH1wVp.png[/img][/center]\r\n\r\n\r\n[size=6]Hints[/size]\r\n\r\nSo you’re stuck and think my clues are too vague? Maybe one or two hints will help you!\r\nNote that this section can spoil the entire hunt for you! Just check the first hint to start with, then another only if you’re still stuck! Keep it fun for yourself:)\r\n\r\n[b]Read the journal and unsure where to go next?[/b]\r\n[spoiler]- The first ring and clues are in a tunnel underneath the Whiterun dungeon.[/spoiler]\r\n[spoiler]- The tunnel can be accessed from a cell in the dungeon and through the guards barrack.[/spoiler]\r\n[spoiler]- Look for a bucket! You’ll find both the first ring and locations for the others![/spoiler]\r\n\r\n[b]Where do I find the character with the Vampiric Ring? It says he’s dead![/b]\r\n[spoiler]- You may recognise the name of this character if you played through Skyrim before. He’s not dead, but a boss character in one of the side quests.[/spoiler]\r\n[spoiler]- The quest is called Laid to Rest. You can start it in Morthal. The character respawns, so you’ll even find him in his lair after you already completed the quest.[/spoiler]\r\n\r\n[b]I read the Thief’s note and know the locations of the ring but can’t find them there![/b]\r\n[spoiler]- The rings are always in a Jewelry chest or strongbox. Some of these are in open locations, other more hidden (never behind a rock or something, but put away on a shelf for example). Look around carefully, they shouldn’t be too hard to find.[/spoiler]\r\n\r\n[b]There’s still one ring whose location is noted as unknown. How do I find it?[/b]\r\n[spoiler]- You’ll find a note in the same place where you find Phynasters Ring. It will tell you where to go.[/spoiler]\r\n\r\n[b]Where are all the locations where the rings are hidden!? I’ve not discovered these yet![/b]\r\nUse this one as a last resort only! It spoils the entire treasure hunt (though you could just as well google all the locations).\r\n[spoiler]These are all the hiding places of the rings (besides the Ring of Khajiit):\r\n-[url=http://i.imgur.com/z4zOdUp.jpg]Cragwallow Slope[/url]\r\n-[url=http://i.imgur.com/pbvvGCE.jpg]Movarth’s Lair[/url]\r\n-[url=http://i.imgur.com/dPXAPtS.jpg]Northwatch Keep[/url]\r\n-[url=http://i.imgur.com/MEZvUEi.jpg]Driftshade Refuge[/url]\r\n[/spoiler]\r\n\r\n[center][img]http://i.imgur.com/eAH1wVp.png[/img][/center]\r\n\r\n\r\n[size=6]Reviews[/size]\r\n\r\nMuch thanks to Brodual and Misalen for these mod reviews\r\n\r\n[youtube]CcmtpRpIDy8[/youtube][youtube]k_X5SWsB9NE[/youtube]\r\n\r\n\r\n[url=https://twitter.com/PrvtIPrivateEye][img]http://i.imgur.com/jn5Gp4X.png[/img][/url]\r\n\r\n\r\nPlease also have a look at some of my other mods:\r\n\r\n[url=http://skyrim.nexusmods.com/mods/30069][img]http://static1.nexusmods.com/110/mods/110/images/30069-1-1358501882.jpg[/img][/url]\r\n\r\n\r\nFor more, check [url=http://skyrim.nexusmods.com/modules/members/index.php?id=887024]my profile[/url]\r\n\r\n\r\n",
  "categoryId": "54",
  "version": "1.1",
  "author": "PrivateEye",
  "createdUnix": "1379590286",
  "updatedUnix": "1379614869",
  "containsAdultContent": false,
  "uploadedBy": "PrivateEye",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000056555",
      "name": "TRoO_Vanilla",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13246",
      "fileName": "TRoO_Vanilla-42564-1-1.7z",
      "uploadedUnix": "1379614630",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ad26399d57892918cca657382e5d0bc695eeca51faa6af96fa4e484a061ee060/analysis/1407728544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TRoO_Vanilla-42564-1-1.7z?fid=1000056555&ttl=1535823421&ri=8192&rs=8192&setec=98d92c130cd0a27e745aff30fca54d03"
    },
    {
      "fileId": "1000056557",
      "name": "TRoO_Dawnguard",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13248",
      "fileName": "TRoO_Dawnguard-42564-1-1.7z",
      "uploadedUnix": "1379614869",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/28598b98b3871775cf4a795076124270a4f8bb68093837f64a9d98e8ad01fa62/analysis/1407728559/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TRoO_Dawnguard-42564-1-1.7z?fid=1000056557&ttl=1535823422&ri=8192&rs=8192&setec=0b22e2f26dae4e77dcacb1946abc3c86"
    }
  ]
}