{
  "modId": 42608.0,
  "modName": "Orc Berserker-Clean Save-After going to High Hrothgar for 1st time",
  "summary": "This is a clean save file for an Orc Berseker. I have completed the initial quest to slay the dragon at the west tower. I have gone to High Hrothgar and gotten the quest for the Horn of Jurgen Windcaller. Completed a couple side quest in and around Whiterun, but nothing major.",
  "descriptionHtml": "I didn\\\\\\'t see many saved games for Orc\\\\\\'s so i decided to create one of my own. I have completed the initial quest in Riverwood for the golden claw and obtain the dragonstone. Killed the dragon at the west tower outside of Whiterun. Completed a couple minor quest in and around Whiterun, and obtained the quest for the Horn of Jurgen windcaller. \r\n\r\nThe Breezehome in Whiterun is paid for and only decorated the bedroom and loft. Un\\\\\\'thar currently has Faendal from Riverwood as a follower, but since you are a Thane of Whiterun you can get Lydia instead if you wish. \r\n\r\nYou start with some minor equipment. A mix of iron and steel armor, a steel greatsword, and enough ingots to get started on smithing. I did increase health and stamina, but did not spend any of the perk points yet. Currently Un\\\\\\'thar is level 4. The chest in the bedroom upstairs in Breezhome contains the ingots, and dragonscales. And some extra gold if you need it.\r\n\r\nI will update this file as I play.\r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "nico86326",
  "createdUnix": "1379701692",
  "updatedUnix": "1379701689",
  "containsAdultContent": false,
  "uploadedBy": "nico86326",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000056734",
      "name": "Orc Berserker Clean Save ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1682",
      "fileName": "Orc Berserker Clean Save -42608-1-0.rar",
      "uploadedUnix": "1379701689",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f4055afc5ae4689cddc791d70a8be33bf73c1199a5e34ae2c1c3107759833a60/analysis/1407729325/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Orc%20Berserker%20Clean%20Save%20-42608-1-0.rar?fid=1000056734&ttl=1535823462&ri=8192&rs=8192&setec=147b8a8ccb4f7a814022c8d2149535c3"
    }
  ]
}