{
  "modId": 42606.0,
  "modName": "DUT - Adornments of Power",
  "summary": "A new system for crafting and upgrading a handful of specific enchanted items, each with a combination of default and \\\"non-standard\\\" enchants -- designed to provide powerful items that you can work towards making more powerful over time, while still using \\\"what you\\'ve got\\\" along the way.",
  "descriptionHtml": "[CENTER][SIZE=6][B]Dark Uncle\\'s Tweaks -- Adornments of Power[/B][/SIZE][/CENTER]\r\n\r\nGo [URL=http://forums.bethsoft.com/topic/1473964-relz-dut-adornments-of-power/]here[/URL] for the discussion thread on the Bethesda Forums\r\n \r\n[SIZE=4][COLOR=#ff0000][B]What this mod is:[/B][/COLOR][/SIZE]\r\nThis mod adds multiple powerful magic items, that are both craftable and upgradable by use of farmable materials. As it stands in the vanilla game, I\\'ve often been frustrated with the way the enchanting skill works... I always find myself saving up, then eventually training and grinding out till I have it maxed with all the perks I want, and only [I]then[/I] do I actually enchant any of my equipment myself. The results, for me at least, are boring - and I usually lose interest in that character once that happens, due in no small part due to the reduced feeling of \\\"goals to work for\\\".\r\n\r\nThis is where the idea of this mod came in. I wanted something to work for, that I wasn\\'t going to \\\"finish\\\" in short order, yet that allowed me to get use out of it along the way.\r\n\r\n[SIZE=4][COLOR=#ff0000][B]How does all this work?[/B][/COLOR][/SIZE]\r\nAs an example... I\\'m playing a mage character. I take some gems that I\\'ve found, and grind them down into \\\"gem dust\\\". Then I do the same with some dragon bone and scales, into \\\"dragon dust\\\"... finally I grind down some (filled) soul gems into \\\"soul dust\\\". Then I go to a forge, and under jewlery I see the listing for \\\"Ring of Desolation I\\\" along with the gem/dragon/soul dust requirements to forge it. So... I forge it. Suddenly the option to forge \\\"Ring of Desolation I\\\" is replaced by the option to forge \\\"Ring of Desolation II\\\", along with the listing of the (larger) number of dusts required.\r\n\r\nAs long as I have enough gem/dragon/soul dust, I can keep on going... all the way to \\\"Ring of Desolation X\\\". Or if I\\'d rather, I can hang onto the first version, but then also craft \\\"Amulet of the Aegis I\\\" or the \\\"Circlet of Rumination I\\\"... all depending on where I want to use the dusts I\\'ve managed to get my hands on thus far.\r\n\r\n\r\n[B][SIZE=4][COLOR=#ff0000]IMPORTANT NOTE ABOUT THIS MOD:[/COLOR][/SIZE][/B]\r\nThe items here are designed to be powerful, but they are also designed to take a fair amount of work and resource gathering to make the most powerful versions of them. They are also designed to be unique, with some enchantments on them that are outside of \\\"normal\\\" enchants you can place on items yourself.\r\n \r\n[B][SIZE=4][COLOR=#ff0000]Required to run this mod:[/COLOR][/SIZE][/B]\r\n[LIST]\r\n[*]Just the latest version of Skyrim - no DLC or other mods required.\r\n[/LIST]\r\n\r\n[B][SIZE=4][COLOR=#ff0000]Specific information:[/COLOR][/SIZE][/B]\r\n[B][SIZE=3]The materials you\\'ll need[/SIZE][/B]\r\n[LIST]\r\n[*][COLOR=#fac08f]Gems[/COLOR]: Higher value gems result in more gem dust once they are ground down.\r\n[*][COLOR=#fac08f]Dragon Bone and Dragon Scales[/COLOR]: Bones produce more dragon dust than scales.\r\n[*][COLOR=#fac08f]Soul gems[/COLOR]: Only filled soul gems can be used - the larger/more powerful the soul, the more soul dust you\\'ll end up with.\r\n[/LIST]\r\n\r\n[B][SIZE=3]The items you can create[/SIZE][/B]\r\n[LIST]\r\n[*][COLOR=#fac08f]Ring of Desolation[/COLOR]: Simple and straightforward... it reduces the magicka cost of destruction spells (2%-20% as the ring is upgraded), [I]and[/I] gives them a bonus to damage (15%-150% as the ring is upgraded). \r\n[*][COLOR=#fac08f]Amulet of the Aegis[/COLOR]: Gives a chance to absorb incoming spells (3%-30%), adds magic resistance (5%-50%), as well as disease and poison resistance (10%-100%).\r\n[*][COLOR=#fac08f]Circlet of Rumination[/COLOR]: Gives extra magicka (20-200), magicka regeneration (10%-100%), and adds duration to all alteration spells (10%-100%)\r\n[*][COLOR=#fac08f]Amulet of the Bulwark[/COLOR]: Gives additional armor rating (15-150), health (20-200), health regeneration (10%-100%), and disease resistance (10%-100%)\r\n[*][COLOR=#fac08f]Ring of the Destroyer[/COLOR]: Gives extra stamina (20-200), stamina regeneration (10-100%), and a new \\\"fortify power attack\\\" ability that grants a chance (10%-100%) to do 250% of normal damage with a power attack using any kind of melee weapon.\r\n[/LIST]\r\n\r\n[B][SIZE=3]Other bits of information[/SIZE][/B]\r\n[LIST]\r\n[*]Dust is made at smelters. I didn\\'t want to clutter up the forge recipe listings anymore than necessary, for those using lots of crafting mods. Also note that dusts have no value or weight, so you can keep them on you at all times, or store them in your home - whatever you prefer.\r\n[*]Recipes for the various dusts will only appear if you have the correct item in your inventory.\r\n[*]Only the \\\"next\\\" version of each magic item will show in the forge menu - the \\\"I\\\" version will show if you don\\'t have that item yet, or the next upgraded version will show if you do have it. Note that this looks in your inventory to determine this, so if you leave your ring at home, then the forge will give you the option to craft another \\\"I\\\" version (as if for the first time).\r\n[*]As mentioned elsewhere, it is supposed to take you a good while to get to the higher level versions of any of these items. Building to a \\\"X\\\" from scratch for example would take 69 filled black soul gems (or more smaller soul gems), in addition to the dragon bone/scale and gems required.\r\n[*]You do not actually need a base unenchanted ring/amulet/circlet to create the initial version of each of these. This was a decision made just to simplify things a bit - by the time you have the dusts required, coming up with an unenchanted piece of jewlery shouldn\\'t be enough of a challenge to be interesting at all.\r\n[*]The values of each magic item can get quite high, but are much lower than they would otherwise be based on the power of their enchants. This was done intentionally, since things like the smithing skill is based on the value of items you craft at the forge - and I didn\\'t want this mod to end up hugely inflating player\\'s smithing skill.\r\n[/LIST]\r\n\r\n[B][SIZE=3][COLOR=#92d050]Future plans[/COLOR][/SIZE][/B]\r\n[LIST]\r\n[*]I have a few ideas kicking around for some additional adornments, including a few more directly geared towards sneaky characters.\r\n[*]A related mod that is already in the works, that will introduce craft and upgradable enchanted armor with multiple enchants, using the same dusts for materials.\r\n[*]Depending on popularity of this mod idea, possibly other optional files to add more craftable/upgradable versions of items introduced in other mods (example: craftable \\\"bags of holding\\\" based off of the Bandolier mod)\r\n[*]I would love to also add custom meshes and textures for these adornments, but don\\'t have the knowledge set to create them myself (and have too many other projects going on to learn right now) - if someone with such experience wanted to voulenteer to help out, please feel free to message me.\r\n[/LIST] \r\n\r\n[SIZE=3][COLOR=#ff0000][B]Version info:[/B][/COLOR][/SIZE]\r\n[LIST]\r\n[*]v 1.0 - Initial release. Please report any problems you find, and I\\'ll do my best to resolve them right away.\r\n[/LIST]\r\n \r\n[SIZE=3][COLOR=#ff0000][B]Special thanks to:[/B][/COLOR][/SIZE]\r\n[LIST]\r\n[*]Everyone involved with the Unofficial Patches - not only helping to make Skyrim a better game for everyone, but also providing excellent feedback and helpful comments.\r\n[*]This modding community as a whole - I continue to be impressed by the amount of passion, positive supportive attitude, and flat out talent possessed by this community.\r\n[/LIST] \r\n\r\n[SIZE=3][COLOR=#ff0000][B]Other info:[/B][/COLOR][/SIZE]\r\n[LIST]\r\n[*]Please ask before using any of the work here in another mod, reuploading elsewhere, etc. In general I don\\'t have a problem with such things, but I like to know in advance.\r\n[*]If you enjoy this mod, please do endorse! I mostly mod for myself, but lets be honest - there is a ton of additional work that goes into tidying up, releasing, and supporing mods... and it is just nice to know if there are others out there who actually benefit at all from that additional work.\r\n[/LIST]",
  "categoryId": "102",
  "version": "1.0",
  "author": "DarkUncleBoh",
  "createdUnix": "1379700604",
  "updatedUnix": "1379700276",
  "containsAdultContent": false,
  "uploadedBy": "DarkUncleBoh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000056727",
      "name": "DUT-AdornmentsOfPower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "DUT-AdornmentsOfPower-42606-1-0.7z",
      "uploadedUnix": "1379700276",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e745a4255f3fa6ae03ef3b2a8d9d62726ecca8e58bb3fe32d54006a6b40a22ad/analysis/1407729249/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DUT-AdornmentsOfPower-42606-1-0.7z?fid=1000056727&ttl=1535823459&ri=8192&rs=8192&setec=6196d95cb231fecd79375c91ecfbf355"
    }
  ]
}