{
  "modId": 42626.0,
  "modName": "Anises Cabin Remodeled",
  "summary": "Make this remodeled version of Anise\\'s cabin your home.  The original cabin has a pleasant location, a nice home except for its horrific state of disrepair.  While retaining the original layout and rustic feel, this mod patches up the house and cleans up the cellar, offering both an open-world component (the cabin and surroundings) and the cellar.",
  "descriptionHtml": "Make this remodeled version of Anise\\'s cabin your home in the woods.  Anise\\'s original cabin has a pleasant location and could have been a comfortable player home except for its horrific state of disrepair.  While retaining the original layout and rustic feel, this mod patches up the house and cleans up the cellar, offering both an open-world component (the cabin and surroundings) and the interior cellar.  \r\n\r\nI created this mod for my own use.  It turned out well so I decided to make it available to others. \r\n\r\nCleaned with TES5Edit.\r\n\r\n\r\n[COLOR=#00B0F0][B]What this mod does[/B][/COLOR]\r\n\r\nThe exterior cabin is now in good repair and is still an open-world location.  A cooking pot, chopping block, and smithing anvil are added.  (I almost didn\\'t add the anvil, but I decided that since Anise did enchanting she might have needed to craft jewelry.  The anvil is not limited to jewelry though, so how you use it is up to you.  I wish Skyrim had separated jewelry crafting from smithing, but it is what it is.) \r\n\r\nRain detection is present, so rain falls outside the cabin but not inside.  An alternate ESP is provided without rain detection for those who prefer that.\r\n\r\nAll containers, above and below ground, are safe and not flagged for stealing.  Many new containers added.  \r\n\r\nThe cellar is cleaned up, with better lighting though still dark in places.  To avoid conflicts, the cellar is implemented as a new cell.  The original loot (notably the poisons) is duplicated here.  If you previously looted the original cell, I guess you get a bonus. \r\n\r\nWeapon racks and a shield display mount added.  Perhaps Anise liked to keep trophies.\r\n\r\nIt is navmeshed and works with followers, but it is a fairly tight space.\r\n\r\nIncludes a story from TES: Daggerfall.\r\n\r\nAdded a shrine for removing disease, though its use comes at a price.  It conveys no other blessing, and any existing blessing is not overwritten.  Since a shrine of Talos already exists not far away, this a merely a convenience and a bit of atmosphere. \r\n\r\nMany items that are normally moveable are made static; they\\'re intended to be decorative rather than looted.  I\\'m a clumsy player and I hate accidentally knocking things out of position (the occasional butterfly would also wreak havoc in the open-world area).  A number of items are intentionally moveable, so you can still clear some spaces to display your own items if you wish.\r\n \r\n\r\n[COLOR=#00B0F0][B]What this mod does not do[/B][/COLOR]\r\n\r\nOverwrite any existing game files. \r\n\r\nAdd full crafting services (workbench and grinding wheel).  These don\\'t seem appropriate for a hedge witch, and Riverwood is nearby.\r\n\r\nAdd overpowered items or loot.  There\\'s a little new loot, mainly for flavor, but it\\'s not worth much. \r\n\r\nCause changes to the location after Anise dies or allow you to purchase upgrades.\r\n\r\nThe vanilla game already makes the bed useable after Anise\\'s demise.  Since it\\'s free and easily obtainable at a low level, it has no well-rested bonus.  This mod doesn\\'t change that.\r\n\r\n\r\n[COLOR=#00B0F0][B]Requirements[/B][/COLOR]\r\n\r\nA currently patched version of Skyrim.  That\\'s it.  If you\\'ve already killed Anise, the mod will work just fine.\r\n\r\n\r\n[COLOR=#00B0F0][B]Installation[/B][/COLOR]\r\n\r\nUnzip the files into your skyrim folder.  No existing files will be overwritten.  Do NOT install this mod and immediately load a save from the Anise\\'s Cabin (or cellar) cell.  This can cause odd behavior with the chopping block (a known Skyrim problem).  After installing, start with a save where your character is in a different area.\r\n\r\n \r\n[COLOR=#00B0F0][B]Compatibility[/B][/COLOR]\r\n\r\nAny mod that alters the above-ground area of the cabin might conflict.  Mods that change the cellar won\\'t cause a problem, but you won\\'t see their changes either because this mod uses a different cell.  If you have items in the original cellar that you want, remove them before installing this mod.  Weather mods potentially might cause the cabin\\'s rain detection to not work.  If you experience a problem with that, use the alternate ESP file without rain detection.\r\n\r\n\r\n[COLOR=#00B0F0][B]Troubleshooting[/B][/COLOR]\r\n\r\n* Chopping block isn\\'t working right.  Did you see the installion note about not starting from a save in that area?\r\n\r\n* Odd rain/weather problems.  You might need the alternate ESP without rain detection.\r\n\r\n* Game crashes when fast traveling to the cabin.  Try walking there the first time, from another nearby location. \r\n\r\n* Game crashes when you approach the cabin.  This is probably due to the random-encounter area just to the northeast.  Before I ever built this mod my game would sometimes crash several times in a row when I got near that spot.  It\\'s not caused by this mod; just keep trying.\r\n\r\n\r\n[B][COLOR=#00B0F0]Credits[/COLOR][/B]\r\n\r\n[URL=http://skyrim.nexusmods.com/mods/14134]Open Books[/URL] by Blary (modder\\'s resource)\r\n[URL=http://skyrim.nexusmods.com/mods/12035]Anorith\\'s Shack[/URL] by Trapiki (creative examples of shack remodeling)\r\n[URL=http://skyrim.nexusmods.com/mods/18651]Rain Clipping Tutorial[/URL] by Xilante\r\n[URL=http://www.imperial-library.info]Imperial Library[/URL] for the text of the tale of Ghraewaj\r\n \r\n\r\n[B][COLOR=#00B0F0]Permissions[/COLOR][/B]\r\n\r\nIf you use the Open Book items, give sole credit to Blary for the modder\\'s resource.  You may not use the original work in this mod without permission, and I do require that you obtain permission prior to redistributing or repackaging this mod, or distributing a modified version.  No need to check with me though if you\\'re just doing a language translation.  Do not upload to Steam.",
  "categoryId": "67",
  "version": "1.0",
  "author": "KineticKat",
  "createdUnix": "1379781102",
  "updatedUnix": "1379736970",
  "containsAdultContent": false,
  "uploadedBy": "KineticKat",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000056817",
      "name": "Anises Cabin Remodeled",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "788",
      "fileName": "Anises Cabin Remodeled-42626-1-0.zip",
      "uploadedUnix": "1379736914",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/260bc34841094b358ca0a245d9983f06ea8b1c4d30329dee92d6cc9e3548937c/analysis/1407729757/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Anises%20Cabin%20Remodeled-42626-1-0.zip?fid=1000056817&ttl=1535823481&ri=8192&rs=8192&setec=1a464c2d42166e69fc8aca693798943f"
    },
    {
      "fileId": "1000056818",
      "name": "Anises Cabin Remodeled - no rain detection version",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "781",
      "fileName": "Anises Cabin Remodeled - no rain detection version-42626-1-0.zip",
      "uploadedUnix": "1379736970",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/69474b6f03b32405ecccf5a1c0202b9ca5056de346f72a048f3cf8dc4d2c424e/analysis/1407729761/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Anises%20Cabin%20Remodeled%20-%20no%20rain%20detection%20version-42626-1-0.zip?fid=1000056818&ttl=1535823481&ri=8192&rs=8192&setec=aa3e0a8dcfa12881a5eac13700b245bc"
    }
  ]
}