{
  "modId": 42678.0,
  "modName": "The Dryad-Elf Family",
  "summary": "Two Dryad/Elf hybrid girl followers with player home and family.",
  "descriptionHtml": "This project has been abandoned.  If anyone else wants to take up the mantle, have at it.  Fair warning, the Half Dryad Elf Race masterfile has a wild edit in it which causes hands to disappear on anyone wearing the Dark Brotherhood light armor gauntlets.  Removal of this wild edit only results in the companions hands disappearing, so there is not a good solution to this but to warn you, or remove this mod.\r<br />\r<br />The description here is huge, because there is so much to cover, and i did not want to leave out any relevant information.  This mod adds a LOT of content in many areas. I do understand in this case if you do not read the instructions letter for letter, but if you do run into problems, please come back to the instructions for a solution before making a complaint.\r<br />\r<br />This mod adds two Dryad/Elf hybrid non-identical twin sister companions. All applicable files have been cleaned in TESV edit.  The main file requires nothing but the latest version of Skyrim.  The girls are both located in Osmun&#39;s Farm, located east of Dragonsreach, and north of Battle Born Farm.  You can fast travel there as soon as you see the icon on your map. You do not have to travel there by foot unless you want to.\r<br />\r<br />New:\r<br />The family bow can now be crafted at a forge under the Elven section, and improved at a sharpening wheel.  The glowing green family arrows can also be crafted in the Elven section.  Another bed was added in anticipation of making the home habitable by children.  Anvil and sharpening wheel added to the porch.  Materials chest added to the porch with crafting materials for making the family bow, and arrows.  (Now found in the elven section)\r<br />\r<br />Also New:\r<br />The Jewelry Pack now includes two insanely useful items.  The first item is a piercing which does not take up a normal clothing spot, which gives constant clairvoyance and life detection together.  This is a true clairvoyance item which not only shows the player what direction to go in, but also allows the player to see dangerous life signs ahead.  The second item grants constant invisibility, along with fortified sneak, fortified pickpocketing, and muffles the player to make him/her silent.  This is as close as it gets to true invisibility.  Both items are meant to be added to your favorites, so that you can be super-aware, and or almost undetectable with the click of a button on the keyboard.  I suggest using the invisibility item as little as possible, but i enjoy using the clairvoyance item frequently.  I&#39;ve tried to avoid creating items which help defensively, as i want to create a situation where the player has to be sneaky to survive.  I do suggest trying to avoid beefing up your defenses and focus on making each shot as deadly as possible instead.  Hopefully this will make you think before you rush into a situation, but to be honest the invisibility item is too powerful, and will make game-play boring if you lean on it a lot.  Also, previous versions of the Constant Clairvoyance effect left anomalies behind when going from one cell to another with it turned on.  I recommend saving your game before you begin using it, and test it to make sure this is not happening to you by deliberately going from one cell to another with it turned on several times.  If you don&#39;t see trails of light left behind after you turn it off, you should be good to go.  If you do experience these anomalies, you have two choices.  One, you can make sure it is turned off before going from one cell to another.  Two, you can just refuse to use the item.  Either of these policies should solve the problem entirely.  Also the life detection can be counted on to detect life signs except for gargoyles, but can not be counted on to display enemies in red, and friendly NPCs in blue.  If you use it a lot, you&#39;ll get the hang of it quickly despite this limitation.\r<br />\r<br />Even more new:\r<br />My latest upload is a farm next door to Osmun&#39;s Farm which focuses on poisonous plants.  The home is based on Riverside Farm by burgerman1000, so will definitely conflict with that mod in most unpleasant ways.  The home was so close to Osmun&#39;s Farm that I could actually see it.  It looks innocent on the outside, but things get more sinister as you delve into it.  The top of the farm remains mostly the same, except that I tore down the outdoor living area and used the platform as a base for a planter garden, plus I added an escape hatch from the basement area so that children could have direct access outside.  In the basement though, i thoroughly gutted the house, installing panelling, two aquariums approx 75 gallons each, and many rare poisonous plants. \r<br />\r<br />The are two kanis root plants, slaughterfish eggs in horse troughs, river betty swimming in the underground swimming pool, nightshade, deathbell, and even two harvestable Jarrin Root plants&#33;  There are also other useful plants included.  The main farm looks innocent enough, but enter the basement and find a lavish bedroom designed for two adults and six children.  Also there is an underground swimming pool full of river betty as i mentioned earlier.  There is even a vampire child living in the basement as its guardian, and trainer in sneak.  She is based on Babette, so you will get Babette&#39;s full inventory even if you wiped out the Dark Brotherhood.  Its not the most impressive home ever, but it really is a Poisoner&#39;s Paradise.  This is still a work in progress.  I am well aware it needs polishing  Credit goes to Harvest Jarrin Root by Redbiertje.  Located here http://skyrim.nexusmods.com/mods/20229/?  Once I had it copied, i realized it was the simplest thing to do, but he figured it out before i did, and i learned something very valuable by being given permission to dissect his mod.  Many Thanks To Redbiertje for sharing his work in more ways than one.\r<br />\r<br />Installation:\r<br />Install with Nexus Mod Manager\r<br />Uninstallation:\r<br />Uninstall with Nexus Mod Manager\r<br />If you know what you are doing, you can install and uninstall this file manually.  Please be aware that i do not support doing this, so if you do, you are on your own.\r<br />\r<br />[b][color=red][size=15]The Father[/size][/b][/color]\r<br />[img]http://s5.postimg.org/j61qaxr2v/osmun.jpg[/img]\r<br />\r<br />[b][color=red][size=15]The Dryad Triad[/size][/b][/color]\r<br />[img]http://s5.postimg.org/l9c5ilqvr/dryadtriad.jpg[/img]\r<br />\r<br />[b][color=red][size=15]The Family Home[/size][/b][/color]\r<br />[img]http://s5.postimg.org/5g77253yv/thehome1.jpg[/img]\r<br />[img]http://s5.postimg.org/jb5hklydz/thehome2.jpg[/img]\r<br />[img]http://s5.postimg.org/nzlhfsnkn/thehome4.jpg[/img]\r<br />\r<br />Did you know that the original version of Skyrim had the archery tree benefiting from the thief stone rather than the warrior stone?  Someone who worked on the Unofficial Skyrim Patch decided that this needed to be fixed, and the archery tree has benefited from the warrior stone on PCs ever since.  Having now played as a dedicated archer, I have decided that perhaps Bethesda had it right in the first place.  Archers benefit greatly from stealth skills, and also from a good knowledge of poisons.  Keeping this in mind, I&#39;ve provided everything you need to become a serious archer, and or alchemist within Osmun&#39;s Farm.  You might also want to consider using the thief stone rather than the warrior stone for this one.  You might also want to do the atherial crown quest so that you can have both at the same time.\r<br />\r<br />About my testing.  I don&#39;t have a large following testing my files for me like some of the more popular authors do.  So here are my latest standards for self testing.  I uninstalled all my mods but about a dozen or so, this being one of them that i did keep.  I then reinstalled Skyrim, and tested the file for two days, about 12 hours a day.  The file performed pretty much exactly as i expected it to.  Additionally, my game did not crash or freeze even one time during this testing process.  So, if your game is screwed, it certainly was not my file.  Previous versions have been getting tested for months.  This is just my results for the latest version.\r<br />\r<br />This started out as a simple conversion of the character I have been playing as for over a year, (Poison Ivy) and has grown into something so much more.  There is now a non-identical twin sister named Poison Oak who represents the fall, whereas her older sister Poison Ivy is the representation of spring. Poison Ivy reminds me of one of those green women from Star Trek, while Poison Oak is more like an Elvish Latina.  Ironically, both my sons prefer Poison Oak, even though she was actually an afterthought.  I suspect this will be the case for many other people as well.  Not everyone is into green women, no matter how pretty they are.  (And they are both very pretty.)  Both girls use the same built in CBBE meshes, and are identical except for the skin/clothing colors and hairstyle.  The girls are both based on the Half Dryad-Elf race, and would not exist without that mod&#39;s files.  The main file contains the original race, with a cleaned masterfile.  I suggest using my main file instead of the original race for this reason, and this reason only, as his original masterfile has dirty edits.  You can find the original Half Dryad-Elf race here on nexus, as well as an advanced follower named Lizia.  Lizia can also be installed using my main file as a base instead of the original race.  Yes, I have tested this using the auto follow Oblivion hair edition.  She found me as soon as I fast traveled the first time. It was sort of spooky, she was suddenly just there in Osmun&#39;s Farm.  I consider Lizia to be a cousin to the twins. \r<br />\r<br />Now the file also involves a Wood Elf father named Osmun who trains in archery, and is also a Fletcher, selling arrows and bows.  The Dryad mother is named Chrysopeleia, after one of the famous Dryads from Greek mythology.  She trains in alchemy, sells alchemy ingredients, and also sells special Dryad potions/poisons which are very powerful, but also very expensive.  She is based on a nexus follower named Boudica, because i wanted a character who had her own UNP mesh.  You can find Boudica right here on the nexus.  The parents and daughters are all tied in as relatives in the creation kit.  The parents are both tied to you as friends, while the girls are both tied to you as lovers.  Thusly, they get along well, and the whole family shows up at your wedding should you decide to marry one of the girls.  The girls will tolerate any crime, and participate in some cases.  They are totally loyal to you.  They rarely complain, and when they do it is because they are concerned for your safety.  For instance, when there is danger ahead, one of them might say &#34;i don&#39;t like where this is going...&#34; and will say something like &#34;I wish you wouldn&#39;t do that&#34; when you read a black book.  They very rarely remind you that they are behind you.  Extremely low irritation factor.  Lowest i could achieve.\r<br />\r<br />We aren&#39;t done yet.  Now there is a summon-able horse named Morganstern.  Based on Shadowmere, Morganstern is better in every way.  Morganstern is 50% faster, 15% larger, smarter, and more useful than Shadowmere.  He can climb mountains like nobody&#39;s business.  You can summon Morganstern anywhere, and get right on.  Once you get off, he vanishes with a loud squeal in seconds.  There when you need him, gone when you don&#39;t.  No matter how many times this horse dies, you can just summon him again.  A truly useful Hell-horse with a great intimidating appearance.  I was concerned at first that the Dragonborn might sink into the horse being as he is almost the size of a draft horse, but this does not seem to be the case.  My character, 1.0 height, sits on him perfectly.  The spell tome for summoning Morganstern is Chrysopeleia&#39;s inventory, listed as &#34;A Present For The Dragonborn&#34;.  You can summon him with no magic skill at all.  In order to make it easier to summon him without disengaging a weapon, i assigned his spell to the shout key, so you don&#39;t have to put away your bow to ride.\r<br />\r<br />Next there is the home which the hybrid family lives in.  While this is technically not a player home, it can be used as one.  I noticed that if you marry one of the girls, you can get the lover&#39;s comfort bonus after sleeping in the house.  The house boasts a fairly large collection of non-enchanted vanilla bows, and has two of the &#34;family bows&#34; in an unenchanted state for those who are hardcore, and don&#39;t want overpowered companions.  The family bows are based on the &#34;New Elven Bow&#34; mod available right here on nexus.\r<br />\r<br />The mod is clearly based on archery, with a side order of alchemy, which I think is the perfect combination for Dryad/Elf hybrids.  Poisoned arrows are probably going to be very familiar to anyone who has played a dedicated archer successfully without cheating.  However, you can play as any type of character you want.  The girls will advance faster if you are a dedicated archer, but there is something to be said for using melee/magic with archery backup.  Its obviously your choice.  Playing as an archer requires some combination of stealth, cunning, strategy, and skill.  This mod intends to provide all the tools needed to be a dedicated archer.  If you have dawnguard, crossbows will work as well of course.  In fact, I&#39;ve done another mod with a collection of automatic crossbows which would probably work.  The girls do look better with the family longbows on their backs, but you can give them any kind of weapons you want.\r<br />\r<br />The girls both cast magelight when it is really dark, which is especially helpful when both of them do it simultaneously.  As if this was not enough, the family arrows glow green, which not only lights up dark areas, but also makes it easier to locate fallen arrows.  Not every arrow can be picked up, so there will be a green glow left behind.  However, sooner or later the game makes the arrows disappear, and the glow goes along with them.  The arrows are not enchanted because enchanted arrows require an exploding radius, which can affect nearby NPCs whom you should not want to offend.  They get angry sometimes, and occasionally the only way you can resolve this is to go back a save.  Thus, I will not be providing exploding arrows.  Sorry, but no.  I do not want to cause this problem for someone who did not read the instructions.\r<br />\r<br />Both of the girls will steal a horse if you are on one, and a horse is available to steal.  However, if one of the girls is on a horse, the other one will refuse to get on one.  Thus, i made the girls fast enough to follow you on foot even if you are riding Morganstern.\r<br />\r<br />Being as I&#39;ve made concessions to those really hardcore players by providing unenchanted bows, i am also releasing a plugin which makes the girls more powerful, and look good at the same time.  The new plugin mod is called the Dryad Elf Jewelry Pack, and is based on SVS Jewelry, available right here on nexus.  The jewelry pack is located on a post on the porch of Osmun&#39;s Farm, just before you go up the stairs to the front door.  Very sorry I left this vital piece of information out.  Thanks to those who pointed it out to me.  The jewelry pack is also intended as a betrothal pack, and not only includes jewels, but flowers, and a note from the girls&#39; mother about the betrothal.  Of course, if you don&#39;t want to marry one of the girls, you can just ignore the note, which is sort of sappy.  Poison Oak has four pieces of jewelry in the pack, each of which boosts her bow damage by 25%. with a total of double bow damage if all four pieces are worn.  Poison Ivy has identical pieces, except hers are emeralds instead of rubies.  Poison Ivy also has a crown which Poison Oak does not have, but the crown is unenchanted.  Combine the jewels and either the enchanted, or unenchanted bow in any combination to achieve exactly the strength you want out of a companion.  I don&#39;t really want to hear anybody complain about balance.  That is crap in this case.  I have provided all the balance anyone could want.  If you can&#39;t control yourself any better than to put away some optional items, you are probably using the console anyway.  You just have to decide how many power boosts you want to give the girls, if any.  The enchanted bows have a slightly souped up version of the Nightingale Bow enchantment, with soul trap added.  The non-enchanted family bows are about equivalent to Daedric, as are the arrows.\r<br />\r<br />Another change i made was to remove the plates and forks from the dinner table.  Until I can figure out how to do this with static meshes, the table will only have flagons, fruit, and bread on it.  Reason for this is that when you walked into the room, the plates and forks would go scattering all over the floor.  I would rather deal with this by using static meshes rather than collision layers, and am going to do just that.  There are now many shelves in the downstairs bed area, with lots of potions, one of each, in various strengths.  These are vanilla potions, and you will still have to purchase the hardcore Dryad potions from the mother character.  The mother used to be a trainer in restoration being as i was under the impression that all the alchemy trainers used old woman voices which i did not want to use.  I was wrong, and the mother now teaches alchemy with the female even toned voice.\r<br />\r<br />I intend for this to be the ultimate archery companion mod.  Let me know if it is somehow lacking, and i will see if i can make it even better.  Again, i am certain i covered the balance thing for just about everyone&#39;s tastes, and will not respond to requests for balance.\r<br />\r<br />For those of you who enjoy a story, the Dryads seem to have been an entirely female race like sirens, amazons, or mermaids.  Some of them were nearly Godlike, and extremely powerful.  These forest nymphs revere trees, and belong in the woods.  Some stories even tell of forest nymphs like these having their souls tied into a tree.  Dryads are also generally depicted as wearing very little at all, and never wearing shoes.  It would seem to me that it would be a natural thing for such a being to choose a Wood Elf as a husband, being as there are no Dryad men to be had.  Osmun has to know what a lucky guy he is to be married to a Demigod.  This of course makes the girls each one quarter Goddess.\r<br />\r<br />About the difference between the girls.  I decided there needed to be a reason they were so different, and still twin sisters. \r<br />\r<br />When Osmun and Chrysopeleia fell in love, her mother was none too happy about it.  However, this was the least of their troubles as the Thalmor were even less happy about it.  The Thalmor hunted them like animals until they found sanctuary within the city walls of Whiterun.  Chrysopeleia was pregnant at the time with the twins, and suffered badly from wounds inflicted by Thalmor agents.  The birth did not go well, and the second child was born dead.  Chrysopeleia was very weak, and could not prevent the second child&#39;s soul from leaving for the afterlife, but she was able to restore the child&#39;s life.  In order to keep the child alive, the first daughter, Poison Ivy, had to give up half of her soul.  (Obviously without her consent being as she was an infant.)  In time, the two soul pieces grew into two entire souls, but with a big difference.  Souls based on nature like that do odd things when you split them, and in this case, one child was turned into a representation of spring, while the second daughter became the representation of fall.\r<br />\r<br />So, you have two unique gorgeous companions, a home, archery and alchemy vendors who both train at a master level.  A truly bad-ass horse.  Custom armor, weapons, potions and race.  There is a winter outfit upstairs.  (currently the girls refuse to wear the boots.  Appropriate, but odd, and i would like to fix this.)  You even get an amateur storyline.  What more could you want?  If you can think of something reasonable, tell me.  I did my best to make everything fit in a natural way.  Everything should seem to make sense in some way.\r<br />\r<br />Please note that although this mod does not contain nudity, it accesses a mod which does, especially if you have a follower tweak mod such as UFO or AFT installed.  Therefore, I am labeling this as containing nudity, just to be on the safe side.  If UFO, AFT or something similar is not installed, you should not be able to take her clothes away from her, and should not have to worry about nudity.  For those of you who actually want this, the girls do look great without clothing.\r<br />\r<br />Known Problems and conflicts.\r<br />\r<br />Any mod which places a building in exactly the same spot north of Battle Born Farm is going to conflict with this mod.  Installing the original Half Dryad-Elf race mod will overwrite the cleaned race masterfile with a masterfile containing dirty edits.  If you want to use the original race file, i suggest overwriting his masterfile with the one out of my mod.  There are minor cosmetic issues with the house.  The lighting needs to be worked on.  Some of the potions on the shelves are leaning over.  There is a tuft of grass sticking up through the porch. I need to add skirting around the base of the house.  If you have installed a previous version, this version will not allow the mother to train you in alchemy unless you go back to a save from before you met her.  Wish i could fix that.  When you enter Osmun&#39;s farm, the bows on the wall racks fall on the floor, and then snap right back up into their places on the wall.  Not too concerned about that one.  When you leave the house, the girls don&#39;t actually come out the door behind you, but come running from the south very quickly. The girls are both marriageable, and you can adopt children after marrying either of them, but i did notice one slight difference there.  Using one of my other mods, (Children Of Honorhall Orphanage) i can adopt six daughters or six sons.  Each option includes an adoptable vampire child.  After marrying Poison Ivy, everything went normally, and all six children were at Lakeview manor when i was done adopting.  After marrying Poison Oak, all the children showed up except the vampire child.  The vampire child adoption has always been tricky though, and always seemed to require that the vampire child was adopted last.  The solution to this is to adopt children before you approach anyone about marriage.  I can&#39;t think of one other thing.  This really runs smoothly, and I am quite proud of its level of stability.  All esp and esm files have been cleaned in TESV edit.\r<br />\r<br />Future plans and pipe dreams.\r<br />\r<br />I am almost certainly going to add a small quest which has a courier deliver a note inviting the Dragonborn to Osmun&#39;s farm, from Osmun, which will place a quest marker at the home.  I am going to do minor changes to the aesthetics of the house like skirting, and trim of other sorts.  I may add some sort of time slowing item, and also may provide items which improve stealth in some way.  I am considering making a mischievous brat of a little brother.  This would involve adding ears to a legitimate Skyrim child in the creation kit.  I am not going to shrink an adult to do this for many reasons.  I would like to add an alternate texture for the wedding sandals which is green for Poison Ivy, but can not get any program to convert the files from Photoshop documents to work for me.  BTW, anyone who can lend a hand making this mod better will be credited most prominently should I decide to use your work.  Yes, this project is my baby as far as decisions made, but I would deeply appreciate help from someone who cares about what they are doing, and is skilled at something i am not.\r<br />\r<br />Recommended mods\r<br />\r<br />Pretty much any mod which allows you to use more than one follower, and allow you to undress/dress your companions.  This will allow you to keep both girls, and fine tune how much damage they do by adding items from the Jewelry Pack.  The two most popular mod i know of which do this are UFO (Ultimate Follower Overhaul) and AFT (Amazing Follower Tweaks)  I actually prefer AFT, but it is incompatible with the Hearthfires Multiple Adoptions mod, which I use to adopt six children instead of two.  (One of my other mods COHO, makes six daughters, or six sons available instead of a mixture.)  Be aware that UFO needs to be cleaned, all three files.  UFO does work after the files have been cleaned.\r<br />\r<br />My Home Is Your Home\r<br />This mod allows you to tell your companions where to live.  You can do without this being as they actually come with a home and family, but it is nice to be able to have them live exactly where you want them to.  Be aware that this mod needs cleaning, and does work after it has been cleaned.\r<br />\r<br />DaggerCraft -Shard of Azzinoth by faxivcm - http://skyrim.nexusmods.com/mods/4683/?\r<br />These glowing green daggers also go very well with Poison Ivy&#39;s look.\r<br />\r<br />\r<br />Permissions\r<br />\r<br />As long as i am credited for the original, and more importantly, you get permission from the authors who&#39;s files i included in my mods, you can use my content in your mods as long as they stay on nexus.\r<br />\r<br />i am a staunch nexus supporter, even though i can not pay for premium service.  the system here is the best way to mod games online, period.  Also, this is the best gaming community online in my opinion.  So NO, i do not want to see this on Steam, or anyplace else but Nexus. \r<br />\r<br />Also, if you want to convert any of my files to another game, that is cool, as long as it is a nexus game site you put it on.\r<br />\r<br />I also want to thank CyberghostPL, for the race mod, and his permission to make a companion out of it.  \r<br />\r<br />Also, the people who have been kind enough to point me in the right direction.  i won&#39;t give out those names, as they would get pestered by a lot of people afterwards, but they know who they are, and i am grateful.\r<br />\r<br />Lastly, i want to thank Nexus, for providing us with a free place to share our files, and download other people&#39;s mods too.\r<br />\r<br />Credits\r<br />\r<br />First I want to say that this mod contains a long lineage of fine mods done by masters.  (Why would I pick crappy mods to base mine on?)  What I mean by this is I got permission to use X mod, which has Y mod and Z mod incorporated into it which each belong to other authors who gave their permission and so on.  I have tried hard to include everyone, but i may have missed someone out there.  If anyone sees their content here and wants it removed this can and will be arranged, but i hope you will simply allow me to credit you for your work, as i did not mean to slight you in any way.\r<br />\r<br />The invisibility enhancement is courtesy of CryptHanky.  The original mod can be located here\r<br />http://skyrim.nexusmods.com/mods/10686/?\r<br />\r<br />The clairvoyance, and life detection enhancements are courtesy of johneh87.  The original mod can be located here\r<br />http://skyrim.nexusmods.com/mods/14609/?\r<br />\r<br />Lilium Follower - Standalone - New Spells w Custom Armor and Weapons \r<br />by messiasmummo and maymay1588 - http://skyrim.nexusmods.com/mods/36058/?\r<br />\r<br />I need to credit messiasmummo and maymay1588 for the winter Dryad outfit located in one of the wardrobes.  It is nothing more than a copy of their Silvan armor set renamed as Dryad armor.  The armor is magnificent to say the least, and is a great alternative for someone who thinks women in skimpy clothing doesn&#39;t fit in well with snowy Skyrim.  The girls both look great in them, and this armor set is very nature oriented, so its a perfect match.  Just don&#39;t mix and match with other armor types as this is a UNP based armor set.  Specifically, if the girls are still wearing their anklets, they will refuse to wear the Silvan boots.  The Half Dryad-Elf armor set was designed for more than one body type, and you may still be able to mix it with the Dryad armor set.  I still prefer the armor which shows off their unique skin coloration, but I wanted to provide this for others with different tastes.\r<br />\r<br />\r<br />SCJewelry by Severus616 - http://skyrim.nexusmods.com/mods/35880/?\r<br />The jewelry in this mod was used to make the betrothal pack for the girls.  The exact same files are in this mod as in the Dryad Elf Jewelry pack, except for the esp.  Be aware that this mod needs to be cleaned in TESV edit, and it does work after being properly cleaned.\r<br />\r<br />I need to credit Phygit for the sandals which are included.  i extracted them from his femfeet mod, which is not compatible with cbbe 3, but the sandals are.  This is listed as a free resource as long as i credit the author, and do not upload to any other site but nexus, which i will not do.\r<br />\r<br />The mother character is played by Boudica by rhowington whom you can find here\r<br />http://skyrim.nexusmods.com/mods/37223/?\r<br />\r<br />Poison Ivy&#39;s and Poison Oak&#39;s bows are courtesy of Andrew210488\r<br />http://skyrim.nexusmods.com/mods/25898/?\r<br />\r<br />The Half Dryad-Elf Automatic Crossbow Plugin is courtesy of  Crossbows Basic Collection mod by DJjojo.  The automatic scripts are courtesy of J3X Automatic Crossbows by J3X.\r<br />\r<br />Half Dryad-Elf Race Mod\r<br />This is listed as a free modder&#39;s resource, but I did receive permission for this from CyberghostPL by PM several months ago when i could not pull it off.  Now, i&#39;ve finally figured out how to make a proper companion out of her.  Poison Ivy could not exist without his files.  Poison Ivy was made from scratch, and is not a copy of Lizia, so she should not conflict with Lizia if you also want to install her.  Be aware that the masterfile in this mod contains dirty edits, and needs to be cleaned.  The version of the masterfile in my main file has been cleaned.\r<br />\r<br />CyberghostPL&#39;s race mod is vastly under-rated.  the work done is outstanding.  The Half Dryad-Elf Race Mod does use content from many others.  i will add his list of credits to mine, just to make sure nobody is left out.\r<br />\r<br />His mod uses these mods\r<br />\r<br />The Dryad by zzjay and Xenius\r<br />numenume elf ear by numenume\r<br />ApachiiSkyHair by Apachii\r<br />Fair Skin Complexion Sweaty Body-ADEC-CBBE-UNP-UNPB by HHaleyy\r<br />Temptress Race by Psychos1s and Brokefoot\r<br />Khantus Armor Set by brokefoot\r<br />Gatti 12 Jewelry Outfit for CBBEv3 by Gatti\r<br />My Type of Hair by Meister falls off cliff\r<br />TroubleMakers Clothing UNPB also BBP and BBPx by MrTroubleMaker\r<br />Calientes Female Body Mod Big Bottom Edition -CBBE- by Caliente\r<br />Bodyslide - 15 extra sliders for CBBE by moonballz\r<br />Fabulous Followers - 5 Breton Girls - NO Other Mods Reqd - UNP UNPB CBBE and ADEC Options by Natilde\r<br />several Horses summon mod by JefTheReaper\r<br />RaceCompatibility for Dawnguard plus vanilla version upgrades by TMPhoenix\r<br />Enhanced Character Edit by tktk\r<br />HN66s Long Eye Lashes by humannature66\r<br />XP32 Maximum Skeleton -XPMS by xp32\r<br />Victorias High Heel walk Animation plus BBP by xp32\r<br />Very very pale skin by CERBERUS99\r<br />Benjamin318s Spriggan Retexture by Benjamin318\r<br />Hair packs of TES IV Oblivion for Female Only by Radioragae\r<br />FemFeet by Phygit\r<br />UNP BLESSED BODY UNPB - With Optional BBP Breast Physics by calyps - xp32 - mrtroublemaker -dimon99\r<br />Better Hand Mesh for UNP UNPB UNPC by MrTroubleMaker\r<br />DIMONIZED UNP female body by dimon99\r<br />SG Female Textures Renewal by Hello Santa\r<br />Acdale EyeCandy Body ADEC now TBBP Compatible by AcDale\r<br />Eryniel Elf Reborn- NSFW Nude Patches - UNP - CBBE - ADEC - E55 - Pandora by Urshi and Donnyducky\r<br />CBBEv3M Body Repalacer by MAK\r<br />\r<br />The Poisoner Paradise mod is based on Riverside Farm by burgerman1000 which is located here http://skyrim.nexusmods.com/mods/23313/?\r<br />\r<br />Credit goes to Harvest Jarrin Root by Redbiertje.  Located here http://skyrim.nexusmods.com/mods/20229/?  Once I had it copied, i realized it was the simplest thing to do, but he figured it out before i did, and i learned something very valuable by being given permission to dissect his mod.  Many Thanks To Redbiertje for sharing his work in more ways than one.\r<br />\r<br />The bathhouse area in the poisoner plugin is from the Underground Bathhouse mod.  Andragon has given me permission to use the assets in this mod, so you can probably expect other features from that mod in the future.",
  "categoryId": "66",
  "version": "1.05",
  "author": "kar2nz",
  "createdUnix": "1379811389",
  "updatedUnix": "1381996925",
  "containsAdultContent": false,
  "uploadedBy": "kar2nz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000058180",
      "name": "The Dryad Elf Family Full Version",
      "version": "1.04",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "182855",
      "fileName": "The Dryad Elf Family Full Version-42678-1-04.7z",
      "uploadedUnix": "1380137536",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/492435ddfe78d8de50e8586ab89e36eb5da0a48929dd1363ba9953e94df0094b/analysis/1407734433/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Dryad%20Elf%20Family%20Full%20Version-42678-1-04.7z?fid=1000058180&ttl=1535823542&ri=8192&rs=8192&setec=1de6a7cd4f0b25fef8bff880e3c1e924"
    },
    {
      "fileId": "1000058192",
      "name": "The Dryad Elf Family Update",
      "version": "1.04",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "56",
      "fileName": "The Dryad Elf Family Update-42678-1-04.7z",
      "uploadedUnix": "1380137647",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/c09b1ddee0fb7cdbcb60d5cf822e431edee36de7e0bbe1e9f51bb6b34695beb2/analysis/1407734433/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Dryad%20Elf%20Family%20Update-42678-1-04.7z?fid=1000058192&ttl=1535823543&ri=8192&rs=8192&setec=e37fd2e0d3639349252f0a6fbdd10a96"
    },
    {
      "fileId": "1000058197",
      "name": "The Dryad Elf Family Jewelry Pack",
      "version": "1.04",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "18595",
      "fileName": "The Dryad Elf Family Jewelry Pack-42678-1-04.7z",
      "uploadedUnix": "1380137813",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/02df00494323f5869f0eb64a08708346b0b85dbd0ccf5363d0627f22f5b46368/analysis/1407734441/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Dryad%20Elf%20Family%20Jewelry%20Pack-42678-1-04.7z?fid=1000058197&ttl=1535823543&ri=8192&rs=8192&setec=b1aa47219f8e0f35945db078d460f515"
    },
    {
      "fileId": "1000063754",
      "name": "Poisoner Paradise",
      "version": ".5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "87",
      "fileName": "Poisoner Paradise-42678--5.7z",
      "uploadedUnix": "1381341479",
      "modVersion": ".5",
      "virusScanUrl": "https://www.virustotal.com/file/03e0d4672eed2a5b250dcbb2b9c84d451b906b70e8a54d9f526d9aeb896f06af/analysis/1407750483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Poisoner%20Paradise-42678--5.7z?fid=1000063754&ttl=1535823544&ri=8192&rs=8192&setec=840fff55854556ff538378937c2e0dfb"
    },
    {
      "fileId": "1000067005",
      "name": "The Dryad Elf Family Full Version With Poisoner Hideout",
      "version": "1.05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "182982",
      "fileName": "The Dryad Elf Family Full Version With Poisoner Hideout-42678-1-05.7z",
      "uploadedUnix": "1381996925",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/692a98b671afdaaa0cbcf0e2d5552dcc370c48cdf0d0c41af43c7a52377809fc/analysis/1407758942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Dryad%20Elf%20Family%20Full%20Version%20With%20Poisoner%20Hideout-42678-1-05.7z?fid=1000067005&ttl=1535823544&ri=8192&rs=8192&setec=960df1b67b978bc71b5a12e2ee18856b"
    }
  ]
}