{
  "modId": 42684.0,
  "modName": "Safe Haven Tower",
  "summary": "Small to medium sized tower player home near Riverwood.",
  "descriptionHtml": "Have you ever downloaded a player home and thought to yourself \\\\\\\"this looks great\\\\\\\" and when you start using it there is always some little thing about it that bugs you? \r\nWell that\\\\\\'s exactly what happend to me. Don\\\\\\'t get me wrong. I love all the creative work done by all of you and i understand all the hard work you have been putting down. It\\\\\\'s just that i could never find the perfect home for my character. So i spent a week going through tutorial videos on how to create a home and 3 weeks actually creating it and fixing all my noob bugs. :P\r\n\r\n\r\nSafe Haven Tower? Really? That\\\\\\'s the best you could come up with?\r\nSorry i panicked! I\\\\\\'m terrible with names. My future kid will be called Uuhm or John Doe.\r\n\r\nSo what is Safe Haven Tower?\r\nWell it\\\\\\'s a tower....\r\n\r\nWell duh!\r\nOk it\\\\\\'s a round tower with four floors and almost all the stuff you need.\r\n\r\nAlmost?\r\nWell i left out the smithing stuff because i use the one in Riverwood...and i could\\\\\\'nt really fit more stuff in it without making it too big and i wanted it to feel realistic.\r\n\r\nWhat does this mod require? \r\nSkyrim (ofcourse), Heartfire and Dawnguard.\r\n\r\nDescription:\r\nThis was the hardest home i have ever created. Mostly because there\\\\\\'s actually no real interior cell for towers. Sure there are some but the windows don\\\\\\'t match the model on the outside. Even though it did not end up the way i imagined it, i\\\\\\'m still very pleased with the end result. I tried to make static clutter but failed so expect alot of stuff to fly around if you feel the need to shout Indoors.\r\n\r\nFirst floor:\r\nKitchen, dining area, booze area and crates...some barrels too.\r\n\r\nSecond floor:\r\nLibrary, Alchemy table, Enchanting table, Reading area and some display stuff.\r\n\r\nThird floor:\r\n2 follower beds with dead animal skins, cozy relaxing spot infront of fireplace, display stuff, desk with safe and 2 bookcases for those pesky journals and notes...maybe even spellbooks.\r\n\r\nFourth floor:\r\nMain bedroom, wardrobes, display stuff and a chandeler for the monkeys to hang from.\r\n\r\nTop of tower:\r\nAn outside cell on top of the tower with training area, a nice little item for those of you that did\\\\\\'nt join dawnguard, a chair to watch riverwood from and a long drop down.    \r\n\r\nFuture plans:\r\nMaybe and just maybe i will be adding some smithing stuff. Oh and more clutter. \r\n\r\nCompatibility:\r\nSo far it\\\\\\'s compatible with immersive settlements Riverwood but i don\\\\\\'t know if that will change if it gets updated. Other then that it should be compatible with any mod that dont add any type of building at the ridge just before you cross the bridge heading for whiterun.\r\n\r\nBugs: \r\nI have no idea. I\\\\\\'m new at this remember? I just started using this for my new character and i will fix any bug that i encounter. If you feel like fixing the bugs yourself then go ahead. I will try my best to fix it but my lack of experience and lack of free time may slow down the process. \r\n\r\nCredits:\r\nWell all the credit goes out to all the great modders out there. Without you i would probably not have about 150 mods installed and enjoyed this game so much. \r\nOh and alot of credit to all the people who have made modding tutorials. It helped ALOT.\r\n\r\nLast note:\r\nSorry for my bad spelling but English is\\\\\\'nt my native language. ",
  "categoryId": "67",
  "version": "1.00",
  "author": "Tozze101",
  "createdUnix": "1379819550",
  "updatedUnix": "1379819454",
  "containsAdultContent": false,
  "uploadedBy": "Tozze101",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000057047",
      "name": "Safe Haven Tower",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "101",
      "fileName": "Safe Haven Tower-42684-1-00.zip",
      "uploadedUnix": "1379819454",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/1414644409aceb5f0564546f6bddf666c4f6b1152da8c6dadb20a32c3a1e1c1a/analysis/1407730812/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Safe%20Haven%20Tower-42684-1-00.zip?fid=1000057047&ttl=1535823549&ri=8192&rs=8192&setec=1c4bb5c86a4858e3ef911fb0e4d7be0a"
    }
  ]
}