{
  "modId": 42694.0,
  "modName": "Hearthfire Beds",
  "summary": "Allows followers to use the beds in Hearthfire homes.\r\n",
  "descriptionHtml": "This mod changes the ownership of the beds in the Hearthfire homes so that your followers can use them. It doesn\\'t change the childrens beds.\r\n\r\nInstall using NMM or put the file in your Skyrim\\\\Data folder and then activate it in the \\\"Data Files\\\" section of the default loader or in the \\\"Plugins\\\" section of NMM.\r\n\r\nI use this with:-\r\nHousecarl Sleeps in my bed by Skysan4298\r\nImmersive Beds by Vivant\r\n\r\nUPDATE:- The fault below hasn\\'t happened again since I first made the changes and nobody has reported having the same fault. So I\\'m assuming it was that my character was in 1 of the Hearthfire houses when I made the changes which caused the conflict.\r\n\r\nConflict with Immersive beds:- \r\nIf you are using Immersive beds and your player won\\'t climb into bed and you can\\'t do anything. Press \\\"ESC\\\" and then select Mod Configeration, select Immersive Beds and then select \\\"Reset Controls\\\" then TAB out and player should dress again.\r\nTalk to the follower in the bed and when they get up try getting into bed again. If this works the follower should climb back into bed with you.\r\n\r\nI don\\'t know why this happens but if you press \\\"T\\\" while your player is waiting to get in bed and advance the time past 8am the follower will get up and then the annimation of climing into bed will start, Its as if your character thinks the bed is full and only gets in when a follower gets up.",
  "categoryId": "28",
  "version": "1",
  "author": "Sparhawk",
  "createdUnix": "1379838447",
  "updatedUnix": "1379841741",
  "containsAdultContent": false,
  "uploadedBy": "Sp@rhawk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000057090",
      "name": "Hearthfire",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Hearthfire-42694-1.zip",
      "uploadedUnix": "1379841741",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8f22c0e991d85c30d11d156e5794963f454e61945bf8ba01d545b0ff4794ca81/analysis/1407730982/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfire-42694-1.zip?fid=1000057090&ttl=1535823561&ri=8192&rs=8192&setec=0571a763c0e2ac3dab1e7db918c2fef6"
    }
  ]
}