{
  "modId": 4269.0,
  "modName": "Dragon-Iron Armor",
  "summary": "Recolor of the dragonbone helmet, banded iron armor, banded iron shield, iron gauntlets and iron boots to form a matching set.",
  "descriptionHtml": "-update- This mod has been obsoleted; go [url=http://www.skyrimnexus.com/downloads/file.php?id=6894]HERE[/url] for the latest version.\r\n\r\nThis is a recolor of 5 pieces of armor to make a more visually cohesive set when worn together, composed of the dragonbone helmet, banded iron armor (male only), banded iron shield, iron gauntlets (male only) & iron boots (male only).\r\n\r\nThis recolor was inspired by my appreciation for the visual aesthetic of the iron armor set, particularly with the pauldrons of the banded iron armor, and the full-metal look of the banded iron shield. I was content enough to play one of my characters wearing the original iron and banded iron armor, until I decided to see how it looked when combined with the dragonbone helm, which as you may have noticed does not fit aesthetically with the rest of the dragonbone armor set but complements the iron, ancient nord & daedric armor sets nicely. Nicely that is, except that in the case of the iron armor set, the metal of the helm is a slightly darker hue, and not rusty like the iron armor is. I noticed that several others had created and uploaded darker-hued iron armor recolors, and so I tried a few of them out, but sadly I discovered they were all a bit darker than I had hoped, so I elected to make my own recolor.\r\n\r\nThe dragonbone helmet has been converted to monochrome, so that the bone components are less noticable;\r\nThe banded iron armor, banded iron shield, iron gauntlets & iron boots have all had their metal components converted to monochrome to eliminate the appearance of rust, then darkened slightly and sharpened to bring out the edges.\r\n\r\nThe end result is a fair improvement over the default, as the dragonbone helm now clashes less obviously with the rest of the iron armor set, and looks just as good when combined with ancient nord or daedric armor as well.",
  "categoryId": "54",
  "version": "1.0",
  "author": "QuickFox",
  "createdUnix": "1324467225",
  "updatedUnix": "1324467647",
  "containsAdultContent": false,
  "uploadedBy": "QuickFox",
  "primaryFile": null,
  "files": [
    {
      "fileId": "12605",
      "name": "DragonIron",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3246",
      "fileName": "DragonIron-4269-1-0.zip",
      "uploadedUnix": "1324467647",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6d1142742e438960c38592545756480d47c57ec4b1518a204e1c4588ee62ce55/analysis/1406543464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DragonIron-4269-1-0.zip?fid=12605&ttl=1535759914&ri=8192&rs=8192&setec=58942cc83f1f58932ab98cd1f1dd80c0"
    }
  ]
}