{
  "modId": 42692.0,
  "modName": "Beginners Tomb Player home and Loot",
  "summary": "A Tomb located close to river-wood, in which you can collect loot, and also contains a reasonably sized player home.",
  "descriptionHtml": "[img]http://i.imgur.com/SEx9reZ.jpg[/img]\r<br />[img]http://i.imgur.com/AKwUK0d.png[/img]\r<br />\r<br />[b]:::::::::: Introduction ::::::::::[/b]\r<br />\r<br />Hello. You may not be aware of this, but this is the first mod that i have created within the creation Kit. The mod took me overall around 5 hours, and i am rather happy with the [url=#]result[/url], which is why i have decided to release it as a mod. Just to make sure that you are aware, this mod is primarily for players that have began Skyrim, or have decided to create a new save, and do not want to have [url=#]to start[/url] from scratch. The reason for this is because i have chose a selection of weapons, (Steel Mace, Bandit armour etc.) in which a [url=#]new player[/url] can use, in order to help them in completion of [url=#]the game[/url].\r<br />\r<br />[b]:::::::::: Information ::::::::::[/b]\r<br />\r<br />Within the mod, you will find various ways in order to help beginning players to proceed in [url=#]the game[/url]. When you first enter the tomb, you will see various [url=#]Urns[/url], Chests and barrels which contain items, that will give you various items which will help you proceed in [url=#]the game[/url]. Not only that, there is also a Small player home down a rather large staircase, which you can live there freely, without having to buy the classical Whiterun house, which costs 5000 coins. This allows beginning players to have an area in which they can store there items, which is in a remote location, which can be quite relaxing.\r<br />\r<br />[b]:::::::::: Location ::::::::::[/b]\r<br />\r<br />The location of the Tomb/Player home is [url=#]close[/url] to Riverwood, with an accessible bridge in which you can go across in order to get to it. If you are a player that does not like the general idea of walking, then you can always fast travel to it, as the map marker is already displayed once the mod has been [url=#]installed[/url]. The reason for putting it in Riverwood, was due to the fact that it is the first town that you are in-fact [url=#]introduced[/url] to meaning that you can simply make your way to the Tomb/Player home without having to travel a long distance. This makes it simple for players that are not familiar with the map.\r<br />\r<br />[img]http://i.imgur.com/0tNMOwi.jpg[/img]\r<br />\r<br />[b]:::::::::: List Of Features ::::::::::[/b]\r<br />\r<br />1. A Tomb in which you can explore, to [url=#]collect[/url] various [url=#]valuable items[/url].\r<br />\r<br />2. A player home in which you can settle down in, without having to pay a single coin.\r<br />\r<br />3.An accessible bridge in order to get to the location of the Tomb/Player home efficiently.\r<br />\r<br />4.Map marker already displayed in order to find it quickly.\r<br />\r<br />5.A simple collection of books, which adds a feel of curiosity to the tomb. (The books can be found on the bridge, as well as within a trading cart outside the entrance.)\r<br />\r<br />6.An alchemy table, which you can use to create potions. (Located in the back-room).\r<br />\r<br />[b]:::::::::: Bug issues ::::::::::[/b]\r<br />\r<br />I have observed the mod, and i have fixed any noticeable bugs/issues that there was previously. However, if you do notice a problem, or a bug please can you make sure to contact me, or make a post so that i am aware of the problem, and i can fix it when i come to creating an update. \r<br />\r<br />[b]:::::::::: Plenary ::::::::::[/b]\r<br />\r<br />I am glad that you have taken your time to read this, and i hope that you have some enjoyment within this mod. As it is the first mod that i have created, it may not be the best of my capability, but i will in-fact be releasing mods relatively soon. Please make sure to stay in touch, so that you will be able to take a look at some of my later mods, and i would appreciate it if you endorsed it, if you find that my mod deserves so. Thank you for downloading, and i hope that you will enjoy my mod.\r<br />\r<br />[center][img]http://i.imgur.com/FnRqPjI.png[/img][/center]",
  "categoryId": "67",
  "version": "22.09.13",
  "author": "Fi5h1fishy",
  "createdUnix": "1379839780",
  "updatedUnix": "1379968446",
  "containsAdultContent": false,
  "uploadedBy": "fi5h1fishy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000057086",
      "name": "Beginners Tomb - With Playerhome and Loot",
      "version": "22.09.13",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "70",
      "fileName": "Beginners Tomb - With Playerhome and Loot-42692-22-09-13.rar",
      "uploadedUnix": "1379838848",
      "modVersion": "22.09.13",
      "virusScanUrl": "https://www.virustotal.com/file/46ee4f112f977d44a6be26353f9a6c10a197c5a34e34dd0d25b4f98e25636c51/analysis/1407731001/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beginners%20Tomb%20-%20With%20Playerhome%20and%20Loot-42692-22-09-13.rar?fid=1000057086&ttl=1535823558&ri=8192&rs=8192&setec=107361fe65f1eea4f4373288704936ed"
    },
    {
      "fileId": "1000057462",
      "name": "Beginners Tomb - With Playerhome and Loot Update 1",
      "version": "23.09.13",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "73",
      "fileName": "Beginners Tomb - Update 1-42692-23-09-13.rar",
      "uploadedUnix": "1379968446",
      "modVersion": "23.09.13",
      "virusScanUrl": "https://www.virustotal.com/file/2855ce1391aa2c5d6f8f016b17176500c308e3b5039fdf55d11c71dac751996d/analysis/1407732654/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beginners%20Tomb%20-%20Update%201-42692-23-09-13.rar?fid=1000057462&ttl=1535823559&ri=8192&rs=8192&setec=d1c8fa68e6d90b505e4060f687410f9b"
    }
  ]
}