{
  "modId": 42726.0,
  "modName": "Dynamic Economy of Skyrim",
  "summary": "Adds merchant smithing and enchanting services. Recipes are generated dynamically for all items, including modded weapons and armor.\r\nChanges store inventory based on location. For example, smiths in Markarth and Riften will have different items for sale. Modded items can be added by user or mod author via a text file.",
  "descriptionHtml": "[I] Tired of leveling smithing and enchanting on all characters just to get the cool items that a mod only adds as craftables? Tired of making thousands of iron daggers to hone your daedric bow into a legendary weapon? [/I] [CENTER][B]THIS MOD IS FOR YOU.[/B][/CENTER]\r\n\r\n[IMG]http://i5.photobucket.com/albums/y174/Animunculi/septim_zpsf779f69c.png[/IMG][B][SIZE=+2]MAIN INFO[/SIZE][/B]\r\nDEOS is a mod which allows an NPC to craft and temper equipment for the player (for cash). The dynamic patcher adds recipes for every craftable (checks Forge and Skyforge, possible to add modded workbenches too) and temperable item (checks Workbench and Grindstone) based on the user\\'s active plugins. \r\n\r\nEnchanting services are also provided though the player must bring his own soul gems. It is quite costly (from 1000 to 9000 gold) but the fee is for a session of enchanting, so you may actually disenchant and enchant several items per payment. The most expensive enchanting session allows the player to put two enchantments on one item, as the vanilla perk Extra Effect.\r\n\r\nThese services are provided for the sake of simplicity by a single NPC named Ra\\'thurr, voiced by the excellent [B]RiliththeRogue[/B]!\r\n\r\nRa\\'thurr spends his time in Dragonsreach, on the left from the main entrance. In the current alpha version, the items will be delivered to your inventory immediately upon crafting or tempering. In later versions, they will be considered orders and delivered after a set amount of days.\r\n\r\nThere are also plans to add custom store inventories to represent different availability of materials in the Holds, much like the well-loved mod by [b]Thomas Kaira[/b] - Economics of Skyrim - from which this mod draws most of its inspiration. \r\n\r\n\r\n[IMG]http://i5.photobucket.com/albums/y174/Animunculi/septim_zpsf779f69c.png[/IMG][B][SIZE=+2]INSTALLING QUICKLIST[/SIZE][/B]\r\n[B]1. Unpack to Data folder or install with manager.[/B]\r\n[B]2. Enable DEOS - Base.esp.[/B] [I](Can go anywhere into load list, no modifying of vanilla content.)[/I]\r\n[I]3. [Optional] Change advanced settings from configuration.xml.[/I]\r\n[B]4. Run patcher.[/B] [I](If you have other dynamic patchers, run mine after any that modify weapons, armor or recipes [constructible objects].)[/I]\r\n[B]5. Enable DEOS - Patch.esp.[/B] [I](Goes into load list after all other mods that modify items in any way.)[/I]\r\n[B]6. Start the game.[/B] [I](The NPC is in Dragonsreach to the left of main entrance.)[/I]\r\nEnjoy!\r\n\r\n\r\n[IMG]http://i5.photobucket.com/albums/y174/Animunculi/septim_zpsf779f69c.png[/IMG][B][SIZE=+2]DETAILED INSTALLATION[/SIZE][/B]\r\n[B][SIZE=+1]Plugins and files[/SIZE][/B]\r\nInstall my mod with NMM (or extract to Skyrim/Data folder manually). There will be a DEOS - Base.esp and a .bsa in the data folder. Enable the .esp in your load list. It can go pretty much anywhere, since it doesn\\'t modify vanilla content at all, except adding the NPC to Dragonsreach.\r\n\r\n[B][SIZE=+1]Patcher configuration[/SIZE][/B]\r\nIf correctly unpacked, there will also be a folder at Skyrim/Data/SkyProc Patchers/DEOS-Patcher/. The .JAR file is the patcher itself. You need Java 7 to run it. Configuration files are in DEOS-Patcher/Files/. \r\n\r\nModify configuration.xml to ignore specific recipes or ingredients. There is also an option to ignore all ingredients, enabling you to merchant-craft all items for gold only. With only specific ingredients ignored, you might still have to provide daedric ingots as well as gold to craft daedric armors and weapons. No ingots are needed for tempering.\r\n\r\nDon\\'t use BlockList.txt to block mods at the moment, cause it can bug some recipes. \r\n\r\nMake sure all the mods you wish to use are enabled. Now run the patcher (JAR). \r\n\r\nChange options if you wish. With the default settings, a daedric bow costs ~23000 gp, upgrading it to Legendary (x2 damage) is another 23000 gp. To make the recipes moderately cheaper, reduce base value multiplier to 1-2 and minimum base value to 50-75.\r\n\r\nNow generate the patch. If you are using ReProccer or any other dynamic patcher which adds weapons, armor or recipes, then you ought to generate its patch first and then run DEOS patch. This guarantees that you get temper recipes for special crossbows and refined silver weapons for example. \r\n\r\nPut the patch into your load list after every mod that modifies or adds armor or weapons. \r\n\r\n[B][SIZE=+1]Price formula[/SIZE][/B]\r\nThe formula for craft recipe is as follows:\r\n(ITEM_VALUE + MINIMUM_ITEM_VALUE) * [1 + BASE_VALUE_MULTIPLIER + sqrt (ITEM_VALUE + MINIMUM_ITEM_VALUE) / 10]\r\nThe formula for a temper recipe multiplies the item\\'s craft price by [(TEMPER_VALUE_MULTIPLIER / 100) * QUALITY_IMPROVEMENT ^ 2].\r\n\r\n\r\n[IMG]http://i5.photobucket.com/albums/y174/Animunculi/septim_zpsf779f69c.png[/IMG][B][SIZE=+2]UNINSTALLING[/SIZE][/B]\r\nOpen the console and type \\\"stopquest DEOSCraftingServices\\\" without the quotes.\r\nSave and exit Skyrim. Disable or delete DEOS - Base.esp, DEOS - Patch.esp, DEOS - Base.bsa, and the SkyProc patcher folder DEOS-Patcher.\r\n\r\n\r\n[IMG]http://i5.photobucket.com/albums/y174/Animunculi/septim_zpsf779f69c.png[/IMG][B][SIZE=+2]CREDITS[/SIZE][/B]\r\nRiliththeRogue for voice of Ra\\'thurr.\r\nThomas Kaira for his inspirational mod Economics of Skyrim.\r\nLeviathan1753 for SkyProc library.\r\nSKSE team for Script Extender and its excellent functions.\r\nThe creators of MCM for a must-have feature.\r\nBethesda for providing a great game and a powerful tool to accompany it.",
  "categoryId": "69",
  "version": "0.51",
  "author": "Animunculi",
  "createdUnix": "1380129661",
  "updatedUnix": "1380127162",
  "containsAdultContent": false,
  "uploadedBy": "Animunculi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000058102",
      "name": "DEOS",
      "version": "0.51",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2696",
      "fileName": "DEOS-42726-0-51.zip",
      "uploadedUnix": "1380127162",
      "modVersion": "0.51",
      "virusScanUrl": "https://www.virustotal.com/file/33873ec9acbef15e863649d757cecdb3e8823dc1f0126014f169814091d892e5/analysis/1407734345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DEOS-42726-0-51.zip?fid=1000058102&ttl=1535823593&ri=8192&rs=8192&setec=2243fe2f070a78308fdc4a09558cda53"
    }
  ]
}