{
  "modId": 42740.0,
  "modName": "Artic Khajiit Race Spanish Translation",
  "summary": "Traducción al español del mod Artic Khajiit \r\n\r\nCreditos a Jamface12\r\n\r\nCredits to Jamface12",
  "descriptionHtml": "Traducción al español del mod Artic Khajiit \r\nPerdonen si tiene algún error pero es mi primer traducción \r\n\r\nRequiere el mod original : http://skyrim.nexusmods.com/mods/28413/?\r\n\r\nAgrega una nueva raza Khajita Ártico\r\nUna raza de Khajitas adaptada al frió de Skyrim, Con sus Habilidades\r\nTiene 75% de resistencia a la escarcha\r\nUn menor bonus de sigilo a comparación de los Khajitas, Mejor habilidad con la armadura ligera, Mejor habilidad con Armas de una mano y escudos, Mejor habilidad de elocuencia y un diferente camuflaje del paisaje de Skyrim (Obviamente diferente a elsweyr) \r\n\r\nVentaja: Stamina regenerada muy rapida. pero muy poca stamina, casi sin magia y la salud la de un khajit \r\n\r\nEl Khajita Ártico es descendiente de los Khajitas Mercaderes que vinieron a Skyrim. Durante el invierno, están recolectando comida y recursos , guardan esto dentro de una cueva e hibernan durante el invierno, este grupo de Khajitas no dormir durante el periodo de hibernación, por lo tanto están despiertos durante el invierno, lamentablemente este grupo de Khajitas estaría sin comida todo el invierno. RockJoint desollaría un miembro cada invierno, y otros comerían. Generalmente el ajuste es menor con habilidades de combate. Esto continuo cada año hasta que de la docena quedaron varios. Estos fueron los mas fuertes de los Khajitas que habían emigrado, los ocho hermanos leales que nunca traicionaría  el uno al otro. aunque paranoico del otro vivieron, alguna vez cautelosos luego de ver lo que sus hermanos estaban dispuestos a hacer para sobrevivir. \r\nel próximo invierno, se quedaron afuera y decidieron migrar a una cueva diferente cada noche, cazando ciervos y bebiendo de los lagos. el siguiente invierno 4 murieron por el frio. 2 murieron por el hambre y el 2 hermano murio por una pisada de un gigante. el ultimo hermano volvio a Elsweyr con una historia que contar (Dejo hasta aqui la historia si quieren continuar leyendo esta en ingles en el mod original)\r\n\r\nCreditos a Jamface12 Buen mod \r\n\r\nCredits to Jamface12 good mod",
  "categoryId": "34",
  "version": "V2",
  "author": "Jamface12 Translate of ShadowGFX",
  "createdUnix": "1379893144",
  "updatedUnix": "1379894008",
  "containsAdultContent": false,
  "uploadedBy": "ShadowGFX",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000057269",
      "name": "Artic Khajit Translate V2",
      "version": "V2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Artic Khajit Translate V2-42740-V2.rar",
      "uploadedUnix": "1379894008",
      "modVersion": "V2",
      "virusScanUrl": "https://www.virustotal.com/file/d5f5d5f62827216a8768076bcc866eeb7183a204565315825b6aeda15b8a7ee8/analysis/1407731956/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artic%20Khajit%20Translate%20V2-42740-V2.rar?fid=1000057269&ttl=1535823608&ri=8192&rs=8192&setec=749f80b93dfc93dc96ed01d73bde67c4"
    }
  ]
}