{
  "modId": 42752.0,
  "modName": "Seniors Wear Vanilla",
  "summary": "Finally a simple vanilla body and clothing fixer for both male and female senior citizens of skyrim to protect them when body replacer mods attack! Updated to support independent face details and brows so seniors stay default all the way.",
  "descriptionHtml": "Seniors wear vanilla is an npc mod for ALL members of the \\\"elder\\\" race in skyrim both male and female.\r\n\r\n\r\nUPDATED TO VERSION v1.1\r\n\r\nI started over from scratch to avoid any dirty edits so new esp file in this version.\r\n\r\nI had to resort to using CTRL+F4 to fix the faces of elder npcs male and female with this mod so there is now facegen mesh data in the mod for all npcs affected. The strange thing is that actually there is a default game neck seam for elder race npc to begin with! I was looking at pics of them on uesp and other skyrim related sites that show default game characters and I could see that seam everywhere. I just never noticed it before now but it has been there since the beginning.\r\n\r\nI used the nakedskin list this time instead of making my own nakedskinold list for naked elder body parts so this might not work with save games made with the original version of this mod.\r\n\r\nThis mod now separates the face tint masks of elder npc from the default file paths so they have their own face details textures like warpaint and makeup etc. ALSO they have their own brows which are just default content using different file paths so brow and face mods don\\'t mess them up.\r\n\r\nThere are now THREE files for this mod:\r\n\r\nMain game only is for main game only no dawnguard or dragonborn DLC in use.\r\n\r\nMain game with dawnguard support.\r\n\r\nMain game with dawnguard and dragonborn support included.\r\n\r\nOnly use the file that fits your DLC or lack of situation.\r\n\r\n\r\nALL of the npc on this list use vanilla bodies textures and clothes in this mod: http://www.uesp.net/wiki/Skyrim:Elder\r\n\r\n\r\nThe \\\"elder\\\" race in skyrim is already there in the CK and used by those npc they just needed their own skin and body directories and also clothing directories so I put everything in unique folders for clothes and armor etc and it all works just fine:-) \r\n\r\n\r\nThis comes in handy when using both male AND female body mods. For the clothing I did something different from what similar mods have done. Basically I just made ArmorAddons for the clothes that the elder npc wears instead of making totally new outfit and changing the npc default outfits. I noticed the game gets buggy sometimes if the npc default outfits are altered especially with save games.\r\n\r\n\r\nThis mod should be compatible with ANY custom body mod male and female because of the unique directories used. Adding male body support is sort of a future proofing idea because maybe someone will make default clothes and armor support for custom male bodies NON skimpy versions eventually I hope.\r\n\r\n\r\nFor male bodies I use Mens Underwear Replacer by Imperator3 http://skyrim.nexusmods.com/mods/19159/?\r\n\r\nFor male textures I use sundracon\\'s stuff from Better Males mod http://skyrim.nexusmods.com/mods/2488/?\r\n\r\nFor females as you can see in the images here I use CBBE:-) \r\n\r\n\r\nInstall with mod manager or manually extract to your skyrim data folder. \r\n\r\nFind any bugs? post them in the comments section thanks.",
  "categoryId": "33",
  "version": "V1.1",
  "author": "Dragonslayer2k12",
  "createdUnix": "1379908329",
  "updatedUnix": "1380082345",
  "containsAdultContent": false,
  "uploadedBy": "dragonslayer2k12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000057971",
      "name": "SeniorsWearVanilla Main game ONLY",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28245",
      "fileName": "SeniorsWearVanilla Main game ONLY-42752-v1-1.rar",
      "uploadedUnix": "1380080364",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/614d76ef6370c3171cd3c68d4c1296f22d8f84f160785c77b2d676cf7cb752d7/analysis/1407733975/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SeniorsWearVanilla%20Main%20game%20ONLY-42752-v1-1.rar?fid=1000057971&ttl=1535823622&ri=8192&rs=8192&setec=5f8b6599f2bbc5bcfae72c3f09aba43a"
    },
    {
      "fileId": "1000057975",
      "name": "SeniorsWearVanillaDG",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28886",
      "fileName": "SeniorsWearVanillaDG-42752-v1-1.rar",
      "uploadedUnix": "1380081176",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/90eaa86fe56c6af6596fbcc8fd393ba7e2b757fa3a1d66055035e2f9f463f9e0/analysis/1407733990/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SeniorsWearVanillaDG-42752-v1-1.rar?fid=1000057975&ttl=1535823623&ri=8192&rs=8192&setec=9303f5970106d269f907a44d484d198f"
    },
    {
      "fileId": "1000057987",
      "name": "SeniorsWearVanillaDGDB",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29340",
      "fileName": "SeniorsWearVanillaDGDB-42752-v1-1.rar",
      "uploadedUnix": "1380082345",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/cd0d984dda830813abd9a767cd1288dfc9be9e831ed1206d3ffc64b7e85d2c3a/analysis/1407734057/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SeniorsWearVanillaDGDB-42752-v1-1.rar?fid=1000057987&ttl=1535823623&ri=8192&rs=8192&setec=15a8583d921920a027d40318651f56ef"
    }
  ]
}