{
  "modId": 42788.0,
  "modName": "Alendris - Blade of Winged Flame",
  "summary": "Alendris, a two-handed blade whose strikes have a chance to allow you to use the \\\\\\\"Fire Breath\\\\\\\" shout with no cooldown.",
  "descriptionHtml": "Alendris is a Daedric-Greatsword equivalent (in terms of weight, damage, and attack speed) with a special enchantment. Because of its equivalency to a Daedric Greatsword, I recommend being around level 45 before using the sword, if you care about balance.\r\n\r\nThe enchantment on Alendris is as follows:\r\n\r\nAttacks with Alendris have a chance to immediately reset your \\\\\\\"Fire Breath\\\\\\\" cooldown. In other words, if you use your \\\\\\\"Fire Breath\\\\\\\" shout, and then attack with Alendris, there is a chance that you will be able to immediately use Fire Breath again. Visual and audio notifications will alert you when this happens, so that you know to take advantage of this free shout. The chance is linked to your current stamina percentage, meaning heavy power attacking/bashing will result in a low chance (for balancing reasons).\r\n\r\nAs an added bonus, attacks against you while wielding Alendris that bring your health down considerably will cause you to gain a strong Fire Cloak for 12 seconds (it is passive; you do not have to cast it).\r\n\r\nEssentially, Alendris is designed for the offensive shouter, with a fiery theme. You should take any and all upgrades to \\\"Fire Breath\\\" to make the most use of this weapon.\r\n\r\nAlendris is located in the High Hrothgar Courtyard, near the gates to the Throat of the World. Look for the beam of light shining down.\r\n\r\nThe artwork for Alendris was done by kimono in the following mod:\r\nhttp://skyrim.nexusmods.com/mods/16991//?\r\nIf you like the design of the sword, please uprate kimono\\'s mod.",
  "categoryId": "55",
  "version": "1.0",
  "author": "jonathan0068",
  "createdUnix": "1379977238",
  "updatedUnix": "1379983264",
  "containsAdultContent": false,
  "uploadedBy": "jonathan0068",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000057510",
      "name": "Alendris",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23887",
      "fileName": "Alendris-42788-1-0.zip",
      "uploadedUnix": "1379983264",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a88e53508d975f4f918485c0f5bef0df4977f4a486cec1cf04434c0fb7d0ca0e/analysis/1407736682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alendris-42788-1-0.zip?fid=1000057510&ttl=1535823656&ri=8192&rs=8192&setec=c95084402ee05ad862a7915a96c794a1"
    }
  ]
}