{
  "modId": 42796.0,
  "modName": "Enchanting Awakened",
  "summary": "A unique, extensive overhaul to Skyrim's Enchanting system, emphasizing game balance and specialization in one of three distinct Enchanting styles.<br /><br />(Compatible with SkyRe, Requiem, SPERG, and other major overhauls.)",
  "descriptionHtml": "[center][b][size=6]Enchanting Awakened[/size][/b]\n<br />[color=#878787][size=2][b]&lt;by egocarib&gt;\n<br />[/b][/size][/color][b]\n<br />[size=3]\n<br />A mod that completely reimagines Skyrim's enchanting skill system\n<br />in an immersive, balanced, and lore-friendly way.[/size][/b][size=3]\n<br />[/size][/center][size=3]\n<br />\n<br />[/size][center][size=3][color=#878787]Tired of enchanting being a mindless skill grind with no rewards or replay value? Bothered\n<br />by how those half-dozen banish-enchanted daggers ruined the economy for the rest of your\n<br />play-through? Have tried all the other enchanting mods out there but found them lacking?\n<br />Then welcome, fellow essence-seeker — you've finally arrived where you belong.[/color]\n<br />[/size]\n<br />\n<br />[color=#00e38c][u][/u][/color][u][url=http://tes.riotpixels.com/mods/skyrim/gameplay/enchanting-awakened][color=#00e38c]Russian Translation now available[/color][/url][/u]\n<br />[color=#878787]thanks, [/color][url=http://www.nexusmods.com/skyrim/users/100354][color=#878787]DJ_Kovrik[/color][/url]\n<br />[color=#00e38c][u][/u][/color][u][url=http://www.skycitizen.net/post/980][color=#00e38c]Chinese Translation now available[/color][/url][/u]\n<br />[color=#878787]thanks, [/color][url=http://www.nexusmods.com/games/users/10312195/?][color=#878787]Rebya[/color][/url]\n<br />\n<br />\n<br />[img]http://i.imgur.com/n95AC5y.jpg[/img][/center]\n<br />\n<br />\n<br />[color=DeepSkyBlue][size=3][b]Enchanting Awakened: The Quick List of Features[/b][/size][/color]\n<br />[b]\n<br />[color=#444444]....................[/color][color=DeepSkyBlue]*[/color][color=#444444].[/color]Choose the path you will follow from among three distinct Enchanting styles — [i]Aether[/i], [i]Chaos[/i], and [i]Corpus[/i] —\n<br />[color=#444444].......................[/color]each suited to unique playing styles and designed to allow multiple play-throughs with different characters.\n<br />[color=#444444].......................[/color]Each of the three styles gain bonuses to the enchantments that are aligned with their particular path.\n<br />\n<br />[color=#444444]....................[/color][color=DeepSkyBlue]*[/color][color=#444444].[/color]Gain enchanting experience when trapping souls, and unlock special \"Essence\" perks that add exciting new\n<br />[color=#444444].......................[/color]features to soul trapping. Soul trapping is now of central importance to Enchanting, as Skyrim lore suggests.\n<br />\n<br />[color=#444444]....................[/color][color=DeepSkyBlue]*[/color][color=#444444].[/color]Unlocking perks is now necessary to disenchant more powerful items, trap larger souls, and improve\n<br />[color=#444444].......................[/color]the number of charges your enchantments yield (charges are much more limited to begin with now).\n<br />\n<br />[color=#444444]....................[/color][color=DeepSkyBlue]*[/color][color=#444444].[/color]Experience completely restructured enchanting mechanics: gold values have been reduced, enchantment\n<br />[color=#444444].......................[/color]magnitudes have been rebalanced, and enchantments now scale at their own unique rates — some (like Regen\n<br />[color=#444444].......................[/color]and Carry enchantments) increasing much faster and to significantly higher magnitudes than in vanilla Skyrim.\n<br />\n<br />[color=#444444]....................[/color][color=DeepSkyBlue]*[/color][color=#444444].[/color]Revel in the Skyrim you've grown to love — all has been carefully designed with the aim of enhancing Enchanting\n<br />[color=#444444].......................[/color]with new layers of complexity and excitement, while avoiding any undesirable immersion-breaking changes.\n<br />\n<br />[color=#444444]....................[/color][color=DeepSkyBlue]*[/color][color=#444444].[/color]Enjoy options that allow you to globally modify the power of all enchantments, to a level that [i]YOU[/i]\n<br />[color=#444444].......................[/color]envision to be right for your character, as well as a system that has been optimized behind  the scenes\n<br />[color=#444444].......................[/color]to take you beyond level 100, if you are among those who play with a skill uncapper activated.\n<br />\n<br />[color=#444444]....................[/color][color=DeepSkyBlue]*[/color][color=#444444].[/color]COMPATIBLE with [u]SkyRe[/u], [u]Requiem[/u], [u]SPERG[/u], [u]ACE[/u], and lots of other stuff - see the sticky post.\n<br />[/b]\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[center][color=DeepSkyBlue][size=4][b]Enchanting Awakened[/b]\n<br />The Perk Tree[/size][/color]\n<br />\n<br />[img]http://i.imgur.com/urVcgUE.jpg[/img][/center][color=#878787][center][b](Note: bonuses from separate perks [i]multiply[/i] with one another)[/b][/center][/color]\n<br />[center][url=http://static-4.nexusmods.com/15/mods/110/images/42796-1-1381291249.jpg][color=GhostWhite]&lt;Soul Shaper Perk Descriptions&gt;[/color][/url]\n<br />\n<br />[url=http://i.imgur.com/wXGcDDM.jpg][color=GhostWhite]&lt;A[b]ETHER[/b] Perk Descriptions&gt;[/color][/url][color=#444444]....[/color][url=http://i.imgur.com/gWh2lUN.jpg][color=GhostWhite]&lt;C[b]HAOS[/b] Perk Descriptions&gt;[/color][/url][color=#444444]....[/color][url=http://i.imgur.com/DpKviy0.jpg][color=GhostWhite]&lt;C[b]ORPUS[/b] Perk Descriptions&gt;[/color][/url][/center]\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[center][color=DeepSkyBlue][size=4][b]Enchanting Awakened[/b]\n<br />The Three Schools\n<br />[/size][/color]\n<br />[img]http://i.imgur.com/cRq6RAq.png[/img]\n<br />\n<br />[color=#f0bffd]Channel the unimaginable forces of the stars as you seek the secret of limitless energy and\n<br />unbound magical power. The elusive Aether is your medium, and the invisible transference\n<br />of all soul energies and essences are your domain. Manipulate sound and silence, light and\n<br />darkness, reality and the ethereal planes - terrorizing foes with the unspeakable and unseen.\n<br />[/color]\n<br />[img]http://i.imgur.com/6tIxEaX.jpg[/img]\n<br />\n<br />\n<br />\n<br />\n<br />[img]http://i.imgur.com/uVc4Q4a.png[/img]\n<br />\n<br />[color=#fdb6b6]Enlist the forces of Chaos in your quest to warp souls, unleashing unimaginable power.\n<br />Destruction is both your preferred means and your desired end, and you will do all that\n<br />you can to bring the world to its knees before you. Steal, poison, swindle, and strike\n<br />your foes down with a fluid and fiery rage unmatched by any other enchanter.\n<br />[/color]\n<br />[img]http://i.imgur.com/c0a65PY.jpg[/img]\n<br />\n<br />\n<br />\n<br />\n<br />[img]http://i.imgur.com/VcZOCZP.png[/img]\n<br />\n<br />[color=#e4f1f9]Train your body and mind to resonate in perfect consonance, and become an impenetrable\n<br />fortress of stored soul energies. Strengthening and restoring the purity of the natural\n<br />world with your iron willpower and unmatched attunement to the inner harmonies of\n<br />the body itself, you stand in judgement before all that is perverse and evil in the world.\n<br />[/color]\n<br />[img]http://i.imgur.com/dCQVfxj.jpg[/img][/center]\n<br />\n<br />\n<br />\n<br />\n<br />[size=4]\n<br />[/size][center][color=DeepSkyBlue][size=4][b]Enchanting Awakened[/b]\n<br />The Essence Perks[/size][/color]\n<br />\n<br />[b]Trapping Souls is deeply enmeshed in Skyrim's Enchanting lore, and [i]Enchanting Awakened's[/i] Essence Perks are designed to reassert\n<br />this central importance of Soul Trapping to the Enchanting system.  Each Essence Perk represents the unique intersection of two\n<br />enchanting schools, and has profound effects on a character's style of trapping souls to be used for binding to enchantments.\n<br />\n<br />\n<br />[color=#ff3333]Will you follow the path of [i]Chaos[/i], recklessly trapping the greatest number and variety of souls, then hastily\n<br />binding them to your enchantments with little concern for how they might be more efficiently put to use?[/color]\n<br />\n<br />[color=#19a3ff]Will you choose the respectful path of [i]Corpus[/i], shunning the capture of human souls entirely, and carefully\n<br />extracting every last bit of essence from creatures as part of your reverence for the forces of nature?[/color]\n<br />\n<br />[color=#9933ff]Or will you favor the path of [i]Aether[/i], absorbing the most energy possible from any source that you find,\n<br />prideful of your command of all souls, unconcerned for your victims or the methods used to enslave them?[/color][/b]\n<br />\n<br />\n<br />[img]http://i.imgur.com/yzn8P2G.jpg[/img]\n<br />[youtube]I8Gk6B2DEOI[/youtube][color=#878787]\n<br />(You can see the in-game notifications better if you watch in fullscreen)\n<br />\n<br />\n<br />[img]http://i.imgur.com/8nXwht8.jpg[/img]\n<br />[youtube]iy3YWqIHbqI[/youtube]\n<br />(You can see the in-game notifications better if you watch in fullscreen)\n<br />\n<br />\n<br />[img]http://i.imgur.com/e54MNDC.jpg[/img]\n<br />[youtube]u73bfNUDX2E[/youtube]\n<br />(You can see the in-game notifications better if you watch in fullscreen)[/color][/center]\n<br />\n<br />\n<br />\n<br />[size=4]\n<br />\n<br />[/size][center][color=DeepSkyBlue][size=4][b]Enchanting Awakened[/b]\n<br />Additional Notes and Things to Know[/size][/color][/center]\n<br />\n<br />[size=3]Extended List of Features  &amp;  Vanilla Fixes\n<br />[/size]\n<br />[list][*][u][color=DeepSkyBlue]All previously obtained Enchanting tree perks will be automatically respec'd upon installation[/color][/u], and the perk points will be returned to your character to use in the new tree. (Also true for the SkyRe, Requiem, &amp; SPERG versions if you've invested into any of their Enchanting trees).\n<br />[*][u][color=DeepSkyBlue]The Fortify Magic &amp; Regen enchantment has been rebuilt from the ground up[/color][/u], and it will now add a regen bonus scaled to your current enchantment level when worn. This allows the enchantment to provide much higher levels of Magicka Regen at high skill levels. Unfortunately the exact regen % cannot be shown in the item description as a result, but can be viewed in the magic effects window, or an optional message can be turned on to display it whenever you equip an item enchanted with this (see the Settings section below).\n<br />[*][u][color=DeepSkyBlue]The Fortify Barter enchantment has been replaced by Fortify Persuasion[/color][/u]. Instead of simply increasing selling prices, the new enchantment gives a straight bonus to all Speech skills, resulting in not only better prices, but improved persuasion and intimidation success.\n<br />[*][u][color=DeepSkyBlue]A new enchantment, Fortify Speed, has been added[/color][/u]. It will increase movement speed by about 30-70% depending on your skill level. This addition seemed necessary to balance the Chaos school with the other two, as I couldn't decide on an \"exclusive\" armor enchantment to limit only to Chaos. I plan to eventually add one or two more unique enchantments to this mod (Aether will be the next school I toss a bone to), though I am going to limit new enchantments to a small handful at most.\n<br />[*][u][color=DeepSkyBlue]A completely rewritten Soul Trap script[/color][/u] is integrated into the mod: with the exception of Azura's Star, soul gems will no longer accept souls of a smaller size than they are intended to hold. Black soul gems &amp; the Black Star will now [b][i]only[/i][/b] capture human souls, as they should. Also, your followers will now be able to capture souls correctly if given the appropriate soul gems and a Soul Trap weapon.\n<br />[*][u][color=DeepSkyBlue]A [i][b]highly recommended[/b][/i] soul gem scarcity plugin is also available[/color][/u], which can be activated in the MCM menu. The plugin will will replace 80% of the [b][i]filled[/i][/b] soul gems sold by vendors with empty gems instead, to further promote the use and importance of soul trapping in the game.\n<br />[*][u][color=DeepSkyBlue]Most enchantments now scale at their own custom rates[/color][/u], instead of all enchantments being exactly 3 times stronger than their base magnitude when you reach level 100 (as in vanilla). Some will scale more slowly, and some will improve faster and reach much higher values (Magicka Regen scales to about 10 times its base value, for instance). This should keep almost all enchantments relevant even at higher levels.\n<br />[*][u][color=DeepSkyBlue]The Power of some enchantments has been decreased[/color][/u]. This is intended mostly for the purpose of promoting game balance and eliminating vanilla flukes, like the ability to reduce casting cost to zero (now impossible with the default settings) or the ability to use smithing and alchemy enchantments to vastly improve potions and smithed items.\n<br />[*][u][color=DeepSkyBlue]Weapon enchantments have noticeably less charges to begin with[/color][/u]. This more realistically reflects your skill level and promotes the use of Soul Trap to keep weapons charged (at lower levels especially). Your choice of specialization will affect how much your charge yield increases. Chaos enchanters will find that they burn through charges more quickly, for instance — representing their fiery nature — but they also have the most impressive arsenal of powerful weapon enchantments at their disposal. Skilled enchanters produce significantly more charges for enchantments aligned with their specialty.\n<br />[*][u][color=DeepSkyBlue]You will be unable to use enchanted items before unlocking the required perks[/color][/u]. Weapon enchantments simply wont affect your enemies, and armor enchantments will stop working a few seconds after you equip them. You will gain access to almost all enchantments simply by unlocking all three [i]Soul Shaper[/i] perks (find a list of what each rank of that perk unlocks in the section below, \"Gaining Access to Enchantments\")\n<br />[*][u][color=DeepSkyBlue]The Silent Moons Enchantment has been fixed[/color][/u]. It didn't do any damage in vanilla. (The Unofficial Patch also fixes this, if you have it)\n<br />[*][u][color=DeepSkyBlue]Bound Weapons now have the proper Soul Trap visual effects[/color][/u] after you unlock the Soul Stealer perk. It actually looks like you're absorbing the soul!\n<br />[*][u][color=DeepSkyBlue]A visual projectile has been added to the Soul Trap spell[/color][/u], something that was also missing from vanilla Skyrim. (Now also fixed by the Unofficial Patch)\n<br />[*][u][color=DeepSkyBlue]Extra Enchanting experience will be awarded when disenchanting weapons[/color][/u]. In vanilla, disenchanted weapons already gave less experience than armor generally, but after this mod's price rebalancing, weapons give extremely little experience. To compensate, you will be awarded extra experience when disenchanting weapons to bring them more in line with armor, [b][i]BUT that experience will not show up immediately[/i][/b] in the experience bar until you enchant or disenchant another item. Unfortunately this minor cosmetic issue can't be fixed. You can disable the extra experience in the MCM menu if this bothers you, however.\n<br />[/list][size=3]\n<br />\n<br />Adjustable Settings\n<br />[/size]\n<br />You can adjust many of the mod's settings in the MCM menu. However, for anyone who doesn't have SKSE/SkyUI installed for the MCM features, you can still adjust some of EA's settings through the console. [url=http://img96.imageshack.us/img96/2071/ehky.jpg][u][color=DeepSkyBlue][b]Get the details here.[/b][/color][/u][/url]\n<br />\n<br />\n<br />[size=3]Gaining Access to Enchantments[/size]\n<br />\n<br />Each enchantment requires a particular perk in order to be used &amp; to be disenchanted in [i][b]Enchanting Awakened[/b][/i]. Without the right perk, weapon enchantments will not affect your enemies, and armor enchantments will automatically dispel or fade when worn. However, almost every enchantment will be usable &amp; disenchantable after you've unlocked all three ranks of the first perk, [i]Soul Shaper[/i]. There are six more enchantments — two for each \"school\" of enchanting — that are only available to specialists in that particular school (the ones listed as \"Exclusives\" in the school descriptions above). Here is a list of which enchantments each rank of [i]Soul Shaper[/i] unlocks:[img]http://i.imgur.com/oWoRVdu.jpg[/img]\n<br />\n<br />\n<br />[size=3]Perk Tree Notes\n<br />[/size]\n<br />It is currently impossible to specialize in more than one style of enchanting in [b][i]Enchanting Awakened[/i][/b]. However, the first three ranks of the starter perk for each enchanting style remain available to anyone, regardless of specialization. Thus, you can choose to unlock the Aether Seeker, Chaos Disciple, and Corpus Scholar perks - up to rank three, at any time.Perks that are above those basic starter perks in the tree will only be available to specialists of their associated style. Once you have taken any of the style-specific perks beyond the original starter perks, you will be committed to the style of the perk you choose for the rest of your play-through. For version two of Enchanting Awakened (in the works now), I will most likely implement an MCM menu option that will allow you to respec your perks if you decide you want to change styles, and I am also considering whether allowing specialization in multiple trees might be possible or desirable.\n<br />\n<br />\n<br />[size=3]Compatibility &amp; Installation[/size]\n<br />\n<br />[color=DeepSkyBlue]:: Incompatibilities ::[/color]\n<br />An effort has been made to ensure that Enchanting Awakened alters only elements of the game related to Enchanting and Soul Trapping, to best ensure compatibility with other mods. However, Enchanting Awakened makes tweaks to just about every detail related to those things, so ANYTHING that alters Enchanting or Soul Trap in significant ways will be likely to conflict. If you must use EA in combination with other enchanting mods, it is recommended to put EA later in your load order to ensure the best possible result. [u][color=#94e4ff]See the Sticky Post for a comprehensive list of all known compatibilities and incompatibilities[/color][/u] with other mods (click on the \"Posts\" tab at the top of the page). I will do my best to create patches for interesting &amp; popular mods where possible.\n<br />\n<br />[color=DeepSkyBlue]:: Known Bugs ::[/color]\n<br />All bugs have been terminated. Be prepared for a smooth ride.\n<br />\n<br />[color=DeepSkyBlue]:: Installation ::[/color]\n<br />An installer is included that is compatible with Nexus Mod Manager, Mod Organizer, and Wrye Bash (Fomod/BAIN compatible). The installer will allow you to choose from a number of options and plugins. If you prefer to manually install, take a look at the included readme to find the right esp or plugins to install for your preferences.\n<br />\n<br />[color=Crimson][b]WARNING: [/b][/color][color=#f1a1b1]Installing the mod while your character has the Soul Trap spell equipped, or while Soul Trap is actively affecting targets nearby will result in Soul Trap no longer working after installation. Exit combat &amp; unequip the spell before you install.[/color]\n<br />\n<br />\n<br />[size=3]Uninstallation[/size]\n<br />[color=#ff6600][b]IMPORTANT![/b]\n<br />\n<br />[/color][u]As is true of any mod, it is never recommended to uninstall in the middle of a character\n<br />play-through. However, if you do decide that you would like to uninstall Enchanting Awakened,\n<br />follow these steps carefully to ensure you make a clean removal of the mod:[/u]\n<br />\n<br />[color=#444444]...............[/color][color=#ff7519][b]*[/b][/color] Go somewhere that does not have any enchanting tables or soul gem traps in the loaded area. A\n<br />[color=#444444].................[/color] good place to uninstall would be indoors inside a shop without an enchanting table, for instance.\n<br />[color=#444444]...............[/color][color=#ff7519][b]*[/b][/color] Unequip ALL enchanted items that you are wearing or wielding. It is okay for them to remain\n<br />[color=#444444].................[/color] in your inventory, just ensure they are unequipped.\n<br />[color=#444444]...............[/color][color=#ff7519][b]*[/b][/color] Either go into the MCM Menu (if you've installed it) and choose the option to Uninstall the mod, or\n<br />[color=#444444].................[/color] else open the console with the tilde key (~), type [color=#ff6600][b]StartQuest EAUninstall[/b][/color] and close the console (~).\n<br />[color=#444444]...............[/color][color=#ff7519][b]*[/b][/color] Click the \"Uninstall\" button in the window that pops up. You will see some uninstall notifications.\n<br />[color=#444444]...............[/color][color=#ff7519][b]*[/b][/color] Wait at least 60 seconds. Now save the game. Shut down Skyrim and uninstall Enchanting Awakened.\n<br />[color=#444444].................[/color] If you are using NMM or Mod Organizer, these programs should be able to properly uninstall the mod\n<br />[color=#444444].................[/color] on their own. Otherwise, be sure you've completely removed the esp and bsa files from your directory.\n<br />[color=#444444].................[/color] After uninstalling, restart Skyrim and load the save you just made. Make a new save and overwrite\n<br />[color=#444444].................[/color] the first one. This is your clean save. Now restart Skyrim once more. You will now be able to\n<br />[color=#444444].................[/color] continue playing from your clean save with no problems.\n<br />\n<br />[color=Crimson][b]WARNING:[/b][/color][color=#f1a1b1] Not Following These Instructions Will Break Enchanting Tables For Your Character !!![/color]\n<br />\n<br />\n<br />[size=3]Recommendations\n<br />[/size]\n<br />[color=DeepSkyBlue][b]Enchanting Tweaks:[/b][/color]\n<br />[list][*][b][url=http://www.nexusmods.com/skyrim/mods/52717]Enchantment Reload Fix[/url][/b] - Fixes problems associated with player-made enchantments after game reload. At higher enchanting levels especially, your player-enchanted weapons will consume charges much faster after game load, and the gold value of these items also jumps significantly higher.\n<br />[*][b][url=http://www.nexusmods.com/skyrim/mods/48542]NPC Enchantments Fix[/url][/b] - A SkyProc patcher that will fix all followers and NPCs so that they can completely benefit from any type of enchanted gear. Without a patch like this, many enchantments don't work for your followers, like Fortify One-handed, Fortify Block, Fortify Destruction, [url=http://www.uesp.net/wiki/Skyrim:Followers#Enchanted_Follower_Equipment]and others[/url]. A necessity for those of you who like to deck out your follower with awesome gear!\n<br />[*][b][url=http://skyrim.nexusmods.com/mods/2043]Enchanting Table Retex[/url][/b] — A fantastic higher-def retexture of the wooden enchanting table surface.\n<br />[*][b][url=http://www.nexusmods.com/skyrim/mods/1957]Black Marble Arcane Enchanter[/url][/b] - Changes the surface of the table to look like worn black marble.\n<br />[*][b][url=http://www.nexusmods.com/skyrim/mods/1882]Enchanting Table - Granite Surface[/url][/b] - Very nice polished Granite alternative for conducting your enchanting exploits.\n<br />[*][b][url=http://www.nexusmods.com/skyrim/mods/54291/?]Cherrywood Dragon Enchanting Table[/url][/b] - Another great retexture including a dragon skull holding a soul gem right in the middle. It's very red, so it would work great for a Chaos enchanter!\n<br />[/list][color=DeepSkyBlue][b]Other Skill Tweaks and Overhauls:[/b][/color][list][*][b][url=http://skyrim.nexusmods.com/mods/1175]Elys' Community Uncapper[/url][/b] (Requires SKSE) — Install this and never look back. Removes the 100 level limit from skills, allowing you to set your own new custom limits. But more importantly, also allows you to set the rate of experience gain for every individual skill, amount of health, stamina, magicka &amp; perk points gained each level, and more. Enchanting Awakened is designed to accommodate Enchanting skill gain beyond level 100, allowing you to gain better bonuses to your Essence Perks in particular.\n<br />[*][b][url=http://skyrim.nexusmods.com/mods/28418]Stealth Skills Rebalanced[/url][/b] — AMAZING, highly underrated mod. Choose to install any combination of its Sneak, Lockpicking, and/or Pickpocketing skill overhauls. All of them are fabulous. The lockpicking module in particular and its fewer lockpicks plug-in is a stroke of genius — made me finally appreciate the value of Lockpicking perks, and left me often wishing that I had more lockpicks left at crucial moments. Please Note that the stealth module of this mod requires a PATCH to work with Enchanting Awakened (available in the files section)\n<br />[*][b][url=http://skyrim.nexusmods.com/mods/10456]Path of Shadows[/url][/b] — Another very good Sneak overhaul. Has some of the funnest and most creative perks I've seen in a custom tree, including the ability to jump backwards to evade attacks, and the ability to knock people out for long durations — \"blackjack\" them (while you rob their house, for example). My one reservation is that the sneak multipliers are a bit high, making sneak attacks overpowered at high skill levels (I lowered these on my own version for personal playthrough). If you don't mind that, when this mod is good, it's REALLY good. And worth a try.\n<br />[*][b][url=http://skyrim.nexusmods.com/mods/11481]Phitt's Alchemy &amp; Food Overhaul[/url][/b] — Still one of the best alchemy balance mods out there. It has its shortcomings — like potion prices that seem too low — but its complete removal of enchanting, smithing, and other secondary skill potions from the game has always been a highlight for me, and this feature works well to balance things in combination with Enchanting Awakened.\n<br />[*][b][url=http://skyrim.nexusmods.com/mods/35124]Miko's Alchemy &amp; Food Overhaul[/url][/b] — props to MidnightBreezy for pointing this one out, a sort of \"spiritual successor\" to Phitt's. Features vary a bit between the two mods, but they are both as fantastic as they are comprehensive!\n<br />[*][b][url=http://skyrim.nexusmods.com/mods/10037]ACE Combat &amp; Skill Mods[/url][/b] — A wonderful mod that is always somewhere in my load order, especially because of its modular nature, which lets you choose only to modify the skills that [b][i]you[/i][/b] want to change, and therefore allows you to use ACE modules in combination with many other great skill mods (like Enchanting Awakened, or the mods in this list!)\n<br />[*][b][url=http://skyrim.nexusmods.com/mods/18919]Treebalance - Speech Tree[/url][/b] — One of the few good Speech skill overhauls out there. Subtle but very effective changes to the perk tree. Also introduces a yielding system which adds to roleplay enjoyment if you aren't the sort of person who wants to kill everyone in sight.\n<br />[*][b][url=http://skyrim.nexusmods.com/mods/33860/]The ThirdRace Skill Overhaul - Modular[/url][/b] — A very nice, little known reconstruction of numerous skill trees. Modular so you can choose to change only the skills you want, and you'll inevitably find at least one skill tree in this impressive bunch that will catch your eye. The speech tree with its heavy emphasis on empowering shouts is particularly interesting if you're the sort who relies heavily on your Thu'um.\n<br />[/list][color=DeepSkyBlue][b]Mods appearing in pictures and videos on this page:[/b][/color][list][*][b][url=http://skyrim.nexusmods.com/mods/24941]Dragonbone Ebonsteel Armor[/url][/b]\n<br />[*][b][url=http://skyrim.nexusmods.com/mods/16864]Momo Acrobatic Jump[/url][/b]\n<br />[*][b][url=http://skyrim.nexusmods.com/mods/15122]Nicoroshi Creations[/url][/b]\n<br />[/list]\n<br />[b]\n<br />[/b][size=3][b][color=#9933ff]And finally...[/color][color=#444444] [/color][/b][/size][b][size=3] BIG thanks [/size]going out to all the kind people over at Beth's CK forums for constant support and insight: Inki, mojo, MrJack,s7o, hypno, B1gBad, CDM_, JustinOther, heilghast, and many other folks I'm definitely forgetting. A truly fantastic group.[/b]\n<br />\n<br />\n<br />\n<br />\n<br />[center][url=http://forums.nexusmods.com/index.php?/topic/1148040-enchanting-awakened-poll-aether-vs-chaos-vs-corpus/][color=DeepSkyBlue][b]POLL:[/b][/color][/url]\n<br />[url=http://forums.nexusmods.com/index.php?/topic/1148040-enchanting-awakened-poll-aether-vs-chaos-vs-corpus/][color=DeepSkyBlue]Which of EA's Three Enchanting Styles Do You Prefer?[/color][/url][/center]\n<br />\n<br />\n<br />[img]http://i.imgur.com/kwoOnz1.png[/img]\n<br />\n<br />[color=#444444].[/color]",
  "categoryId": "75",
  "version": "1.61",
  "author": "egocarib",
  "createdUnix": "1380830356",
  "updatedUnix": "1414215364",
  "containsAdultContent": false,
  "uploadedBy": "egocarib",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000063776",
      "name": "Enchanting Awakened Lite - No DLCs Required",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2332",
      "fileName": "Enchanting Awakened Lite - No DLCs Required-42796-1-01.7z",
      "uploadedUnix": "1381343993",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/2aaffeca0325f59cd07aa604feebd490bcfdf2f927cd7ff11dec7597f4a82c44/analysis/1407750621/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened%20Lite%20-%20No%20DLCs%20Required-42796-1-01.7z?fid=1000063776&ttl=1535823665&ri=8192&rs=8192&setec=19404c0ffa123e8b90e64bd645561ad8"
    },
    {
      "fileId": "1000066367",
      "name": "Patch - Animated Weapon Enchantments",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Patch - Animated Weapon Enchantments-42796-1-00.7z",
      "uploadedUnix": "1381860130",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/caf685fb7cc0c39eb428a3647ec06bc8d327c33b1f2e3e8708505dac0388b053/analysis/1407757134/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20-%20Animated%20Weapon%20Enchantments-42796-1-00.7z?fid=1000066367&ttl=1535823665&ri=8192&rs=8192&setec=8ff4713fc4f99387a905a3c7ca163196"
    },
    {
      "fileId": "1000067170",
      "name": "1____41 Enchanting Awakened - MAIN",
      "version": "1.41",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2525",
      "fileName": "Enchanting Awakened - Main v1-41-42796-1-41.7z",
      "uploadedUnix": "1382041869",
      "modVersion": "1.41",
      "virusScanUrl": "https://www.virustotal.com/file/7a604cf3d10bc8abf61ca44d3569bf7733f0c1846da0429a8b8e3821d243e31c/analysis/1407759248/",
      "changelogHtml": " --------------------------------\r<br />Version 1.41 MAIN\r<br />--------------------------------\r<br />\r<br />Fixed the Atronach Stone being dispelled if you didn&#39;t have Soul Shaper rank 2\r<br />\r<br />Fixed about half a dozen Unique/Artifact item enchantments that weren&#39;t yet working without perks as intended (see last version notes)\r<br />\r<br />Modified description of two or three effects on Unique items, to make it clearer that they will be somewhat less effective unless you are a master of the right school (see last version notes)\r<br />\r<br />Also an errata from v1.40:\r<br />Contrary to my statement that you can use all DB items without perks now, the Dark Brotherhood items with a muffle effect WON&#39;T be usable without the Aether Strider perk. This is because they are linked to the same basic muffle enchantment used by common items, and the only fix would be to edit the armor items themselves. I&#39;d like to avoid that for now and stick to editing enchantment effects only, to maintain maximum compatibility.\r<br />\r<br />\r<br />--------------------------------\r<br />Version 1.40 MAIN\r<br />--------------------------------\r<br />\r<br />Altered all unique items and artifacts so that they are now usable without any required Enchanting perks or skill. Until now, many of them were affected by EA&#39;s system of dispelling enchantments you had not yet learned, and so they couldn&#39;t be used without the right perks.\r<br />\r<br />This change is meant to reflect the fact that many of these items are intended to be divine, legendary, or otherworldly - like the Daedric Artifacts, for instance - and so you should be able to use them -- if you can obtain them -- without any Enchanting skill needed. Often, these items require completing a quest to obtain as well, which seems like it is already a worthy prerequisite for their use.\r<br />\r<br />Here is what I have made usable:\r<br />\r<br />All Religious Amulets\r<br />All Daedric Artifacts\r<br />All Thieves&#39; Guild Gear\r<br />All Dark Brotherhood Gear\r<br />All Dragon Priest Masks\r<br />&gt;except for Volsung&#39;s Waterbreathing effect, which will only work for Corpus Masters\r<br />All the unique weapon & armor items I could find (probably 40 or 50). Pretty much any one-of-a-kind weapon or armor will be affected by this change.\r<br />&gt;see the following caveat concerning \"exclusive\" effects though~\r<br />\r<br />\r<br />However, since so many unique weapons and armor use the \"Exclusive\" enchantments that are meant to be limited only to certain schools, I have had to compromise a bit, in order to keep these enchantments feeling exclusive. Here is what I did when such effects were found on unique items:\r<br />\r<br />-Absorb Health: this effect will only work 50% of the time, unless you have the Aether Strider perk\r<br />-Absorb Stamina: this effect will only work 50% of the time, unless you have the Chaos Master perk\r<br />-Paralyze: this effect will only work 3% of the time, unless you have the Corpus Guardian perk\r<br />-Muffle: All muffle effects are cut in half unless you have the Aether Strider perk. This usually means items like Predator&#39;s Grace, Ebony Mail, and the Nightingale Boots will give you only a 50% muffle effect without the perk.\r<br />-Waterbreathing: This won&#39;t work unless you have the Corpus Guardian perk. The one exception is the Deathbrand Helm. But I have altered it so that, if you dont have the Corpus Guardian perk, you must have all 4 pieces of the Deathbrand set in order for the Waterbreathing effect to work on the helm.\r<br />\r<br />\r<br />Other Specific Notes:\r<br />-The Gauldur Amulet will need to be reassembled completely if you want to use it without Enchanting perks.\r<br />-I have decided NOT to make the \"Fortify &lt;Magic&gt;\" effects on these items work without Enchanting perks, mainly because it is necessary to leave them alone for now in order to still provide the installer option to \"empower\" your Fortify Magic enchantments, and to then have that option reflected in these items. (This discrepency will most likely be taken care of in later versions of the mod):\r<br />Vokun Mask\r<br />Miraak&#39;s Robes\r<br />Nightingale Hood\r<br />Archmage&#39;s Robes\r<br />\r<br />\r<br />Compatibility Note:\r<br />Just a remark - I intentionally avoided editing any weapon or armor items themselves to preserve compatibility - these changes were made solely through editing the Enchantment effects associated with all the unique items. EA should remain relatively conflict free.\r<br />\r<br />\r<br />--------------------------------\r<br />Version 1.31 MAIN\r<br />--------------------------------\r<br />\r<br />A few last tweaks to properly move the Fortify &lt;magic&gt; & Magicka Regen enchantments into the domain of Soul Shaper rank 1, as mentioned in the last version changelog. Should be good to go now.\r<br />\r<br />\r<br />--------------------------------\r<br />Version 1.30 MAIN\r<br />--------------------------------\r<br />\r<br />Fixed the bug that was allowing players to benefit from any & all enchanted items when worn. This included ones they shouldn&#39;t have had access to yet because of a lack of Soul Shaper Perks, and also even enchantments that were intended only for other school specialists to use.\r<br />\r<br />Moved all Fortify &lt;magic&gt; & Magicka Regen enchantments into the domain of Soul Shaper rank 1. Early-game mages were at a severe disadvantage I realized as a result of the fact that these enchantments used to require Soul Shaper rank 3 & level 50 in Enchanting to even be able gain a benefit from wearing these enchantments, not to mention to be able to enchant/disenchant them. The value of these Fortify & Regen enchantments was also lowered slightly to compliment this change, as they were one of the most valuable/expensive enchantments available.\r<br />\r<br />\r<br />--------------------------------\r<br />Version 1.20 MAIN\r<br />--------------------------------\r<br />\r<br />Fixed the \"health gain bug\" that caused players to gain 4 health points when the mod was installed.\r<br />\r<br />\r<br />--------------------------------\r<br />Version 1.10 MAIN\r<br />--------------------------------\r<br />\r<br />Renovated and expanded the Installer.\r<br />\r<br />Added an option to the installer that will allow you to change all Fortify &lt;magic type&gt; Enchantments so that they will modify the POWER of spells instead of reducing the cost.\r<br />-this is really meant to be a temporary touch-up until I fully implement some more interesting changes to Fortify Magic enchantments in version 2.0\r<br />\r<br />The \"Fortify &lt;magic&gt; & Magicka Regen\" enchantment remains unchanged, and will still only reduce casting cost, in addition to its high regen effect. However, the power of these enchantments has been buffed slightly as well so that they will lower costs slightly more (if you choose the above fortify power instead of cost option)\r<br />\r<br />Converted the Shield of Solitude into its own unique enchantment called \"Solitude&#39;s Respite.\" It improves magic resistance & blocking skills. This will belong to the Aether Style (I have updated the image listing Aether skills accordingly).\r<br />\r<br />Removed MagicDamageFire keyword from Stamina Damage Enchantment. This was a vanilla bug, and it allowed the enchantment to benefit from the Augmented Flames perk.\r<br />\r<br />Fixed Notched Pickaxe to be disenchantable once again (recently found out that the USKP had changed it so you couldn&#39;t disenchant it anymore). It remains in the Corpus school, and I think its appropriate to keep around.\r<br />\r<br />Removed all Magic Skill linkages from enchantments. This way enchantments will no longer be improved by your Magic Skill levels. This is mostly a balance-oriented change, especially now with the introduction of magic enchantments fortifying power instead of reducing cost.\r<br />\r<br />Reduced XP gain for the Conjuration skill when using Soul Trap. It now only gives half as much XP to Conjuration (since this mod considers it more of an Enchanting skill)\r<br />\r<br />Changed the effect descriptor of Silent Moons Enchantment from \"Light damage\" to \"Moonlight damage\" <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened%20-%20Main%20v1-41-42796-1-41.7z?fid=1000067170&ttl=1535823666&ri=8192&rs=8192&setec=1400b5aa390b9abf9392655ee2491272"
    },
    {
      "fileId": "1000067176",
      "name": "1____41 Enchanting Awakened - SkyRe Edition",
      "version": "1.41SR",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2379",
      "fileName": "Enchanting Awakened - SkyRe v1-41-42796-1-41.7z",
      "uploadedUnix": "1382042026",
      "modVersion": "1.41SR",
      "virusScanUrl": "https://www.virustotal.com/file/df187988902a453976105e79ad93ee3d1da5e6f34a2f65b7fb267b0c22abcae7/analysis/1407759252/",
      "changelogHtml": " -----------------------------------\r<br />v1.41 SkyRe Edition\r<br />-----------------------------------\r<br />\r<br />Expanded installer, including Dawnguard plugin option.\r<br />\r<br />A few last important tweaks to properly move the Fortify &lt;magic&gt; & Magicka Regen enchantments into the domain of Soul Shaper rank 1, as mentioned in the last version changelog. Should be good to go now - you can use and disenchant/enchant them with only Soul Shaper rank 1.\r<br />\r<br />Altered all unique items and artifacts so that they are now usable without any required Enchanting perks or skill. Until now, many of them were affected by EA&#39;s system of dispelling enchantments you had not yet learned, and so they couldn&#39;t be used without the right perks.\r<br />\r<br />This change is meant to reflect the fact that many of these items are intended to be divine, legendary, or otherworldly - like the Daedric Artifacts, for instance - and so you should be able to use them -- if you can obtain them -- without any Enchanting skill needed. Often, these items require completing a quest to obtain as well, which seems like it is already a worthy prerequisite for their use.\r<br />\r<br />Here is what I have made usable:\r<br />\r<br />-All Religious Amulets\r<br />-All Daedric Artifacts\r<br />-All Thieves&#39; Guild Gear\r<br />-All Dark Brotherhood Gear\r<br />&gt;except for shrouded boots & muffle items - I would have had to edit\r<br />the armor pieces themselves, but I decided against this in the\r<br />interests of maintaining maximum compatibility.\r<br />-All Dragon Priest Masks\r<br />&gt;except for Volsung&#39;s Waterbreathing effect, which will only work for\r<br />Corpus Masters\r<br />-Skein of Magnus\r<br />-Archmage&#39;s Robes\r<br />-All the other unique weapon & armor items I could find (probably 40 or 50).\r<br />Pretty much any one-of-a-kind weapon or armor will be affected by this change.\r<br />&gt;see the following caveat concerning \"exclusive\" effects though~\r<br />\r<br />\r<br />However, since so many unique weapons and armor use the \"Exclusive\" enchantments that are meant to be limited only to certain schools, I have had to compromise a bit, in order to keep these enchantments feeling exclusive. Here is what I did when such effects were found on unique items:\r<br />\r<br />-Absorb Health: this effect will only work 50% of the time,\r<br />unless you have the Aether Strider perk\r<br />-Absorb Stamina: this effect will only work 50% of the time,\r<br />unless you have the Chaos Master perk\r<br />-Paralyze: this effect will only work 3% of the time,\r<br />unless you have the Corpus Guardian perk\r<br />-Muffle: All muffle effects are cut in half unless you have\r<br />the Aether Strider perk. This usually means items like\r<br />Predator&#39;s Grace, Ebony Mail, and the Nightingale Boots will\r<br />give you only a 50% muffle effect without the perk.\r<br />-Waterbreathing: This won&#39;t work unless you have the Corpus\r<br />Guardian perk. The one exception is the Deathbrand Helm. But\r<br />I have altered it so that, if you dont have the Corpus Guardian\r<br />perk, you must have all 4 pieces of the Deathbrand set in order\r<br />for the Waterbreathing effect to work on the helm.\r<br />\r<br />\r<br />Other Specific Notes:\r<br />-The Gauldur Amulet will need to be reassembled completely if you want to use it without Enchanting perks.\r<br />\r<br />\r<br />Compatibility Note:\r<br />Just a remark - I intentionally avoided editing any weapon or armor items themselves to preserve compatibility - these changes were made solely through editing the Enchantment effects associated with all the unique items. EA should remain relatively conflict free.\r<br />\r<br />\r<br />-----------------------------------\r<br />v1.30 SkyRe Edition\r<br />-----------------------------------\r<br />Fixed the bug that was allowing players to benefit from any & all enchanted items when worn. This included ones they shouldn&#39;t have had access to yet because of a lack of Soul Shaper Perks, and also even enchantments that were intended only for other school specialists to use.\r<br />\r<br />Moved all Fortify &lt;magic&gt; & Magicka Regen enchantments into the domain of Soul Shaper rank 1. Early-game mages were at a severe disadvantage I realized as a result of the fact that these enchantments used to require Soul Shaper rank 3 & level 50 in Enchanting to even be able to gain a benefit when worn, not to mention to be able to enchant/disenchant them. The value of these Fortify & Regen enchantments was also lowered slightly to compliment this change, as they were one of the most valuable/expensive enchantments available.\r<br />\r<br />Also put some finishing touches on integrating SkyRe&#39;s unique enchantments into the Enchanting Awakened system.\r<br />\r<br />\r<br />---------------------------------------------------\r<br />v1.00, 1.20 & 1.22 SkyRe Edition\r<br />---------------------------------------------------\r<br />Updated everything to be on par with the most recent update of the main mod file. See the changelog for version 1.10 & 1.20 of the main file for details.\r<br />\r<br />\r<br />Contrary to earlier versions of the SkyRe Edition of the mod, SkyRe&#39;s enchantments have all\r<br />been preserved exactly now, including Reflect Damage, Damage Resistance, and Fortify Movement\r<br />Speed.\r<br />\r<br />\r<br />Here is a list of how they have been divided up into Enchanting Awakened&#39;s seperate styles\r<br />of enchanting specialization, and how I renamed one or two of them:\r<br />\r<br />Aether: Deadly Touch (Enchantment used to be called \"Fortify Damage & Ignore Armor\")\r<br />Aether: Conceal Identity (Dark Cowl effect)\r<br />\r<br />Chaos: Fortify Speed (exclusive to Chaos - cannot be used by other specialists. Magnitude buffed considerably)\r<br />Chaos: Reflect Damage\r<br />\r<br />Corpus: Bane of Dragonrend\r<br />Corpus: Resist Damage\r<br />Corpus: Prism (Enchantment used to be called \"Fortify Damage & Magicka Resistance\")\r<br />\r<br />\r<br />All other enchantments and effects were also kept the same as in SkyRE:\r<br />\r<br />For example:\r<br />Chaos: Destruction/&Regen - (still affects MAGNITUDE of Destruction spells)\r<br />Corpus: Restoration/&Regen - (still affects MAGNITUDE of Restoration spells)\r<br />Chaos: Fingersmith - (still affects Pickpocket & Lockpick skills)\r<br />Aether: Fatespinner - (still the unique illusion-based & evasion effect)\r<br />\r<br />\r<br />However, Enchantment Item restrictions that SkyRe edited were restored to vanilla. This allows you to add\r<br />magic, archery, one-handed, two-handed, and other skills on all the same types of items you originally\r<br />could in vanilla skyrim (necessary because Enchanting Awakened&#39;s magnitudes are still a bit lower\r<br />than SkyRe&#39;s, and would be underpowered without the ability to put on numerous armor/clothing items)\r<br />\r<br />\r<br />Other things unique to SkyRe&#39;s soul trapping & Enchanting should all be preserved correctly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened%20-%20SkyRe%20v1-41-42796-1-41.7z?fid=1000067176&ttl=1535823666&ri=8192&rs=8192&setec=01ee5e383850886a8871bb03b5368d13"
    },
    {
      "fileId": "1000067410",
      "name": "Enchanting Awakened No DLCs Dawnguard Plugin",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Enchanting Awakened Lite - No DLCs Required Dawnguard Plugin-42796-1-1.7z",
      "uploadedUnix": "1382074004",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1129dcbe0c0d4a48a48faf42b3bb348b0382ca5cc36cd0af1311e5ed1a6dbb8d/analysis/1407759903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened%20Lite%20-%20No%20DLCs%20Required%20Dawnguard%20Plugin-42796-1-1.7z?fid=1000067410&ttl=1535823666&ri=8192&rs=8192&setec=e50f5379f4989a18d77f579931cd3dd5"
    },
    {
      "fileId": "1000068568",
      "name": "1____41 Enchanting Awakened - Requiem Edition",
      "version": "1.41RQ",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2529",
      "fileName": "Enchanting Awakened - Requiem Edition v1-41-42796-1-41.7z",
      "uploadedUnix": "1382302925",
      "modVersion": "1.41RQ",
      "virusScanUrl": "https://www.virustotal.com/file/7151e5e1ba79f8e0746a6567815a16a35d0bd79d36e63f9becc78540e153dcc9/analysis/1407762727/",
      "changelogHtml": " v1.41 Requiem Edition\r<br />---------------------------------------\r<br />*Fixed a bug that was causing the \"Aether: Dissolve Aura\" enchantment to dispel magic effects on the player instead of the target being hit by the enchanted weapon.\r<br />\r<br />*Added and/or fixed about 20 more unique enchanted items, which will all now be usable without enchanting perks (see the last changelog). I also have set up most of the unique items that use \"exclusive\" enchantments that are meant to be reserved to only the masters of one specific school of enchanting so that they will be slightly less effective. Absorb Stamina/Health, for instance, will only work 50% of the time on unique and artifact items if you don&#39;t have the correct master Enchanting perk that&#39;s normally required to learn those enchantments. Similarly, muffle effects on unique items will only be 50% as effective in most cases, unless you have the Aether Strider perk. For further details, see the main file changelogs for versions 1.40 & 1.41 - the changes to the Requiem edition are pretty much identical.\r<br />\r<br />\r<br />v1.31 Requiem Edition\r<br />---------------------------------------\r<br />*Some extra tweaking to finish transfering Fortify &lt;magic&gt; & Magicka Regen enchantments to be useable with Soul Shaper rank 1. They work as intended now and can be disenchanted after unlocking the perk.\r<br />\r<br />*Fixed a bug that was resulting in Standing Stone powers being dispelled from characters (the Requiem version of the stone powers shared effects with certain enchantments, which was causing the problem).\r<br />\r<br />*Fixed similar bugs relating to several Quest-unique permanent skill buffs being dispelled also.\r<br />\r<br />*Went through ALL unique and artifact-type items, making most of them usable without any skill in enchanting required, in order to signify their divine/unique/one-of-a-kind status, and to allow their use by characters who might not want to invest a lot in enchanting. These items can now all be used without needing to have any particular enchanting perks unlocked:\r<br />\r<br />-All religious amulets\r<br />-All Daedric Artifact Armor & Weapons\r<br />-All Dragon Priest Masks\r<br />&gt;excluding waterbreathing effect mask, which is only usable by Corpus specialists\r<br />-Predator&#39;s Grace boots, Savior&#39;s Hide, Necromancer Amulet, Miraak&#39;s Robes, Frostmere\r<br />-Aetherial (Dwarven) artifacts unique to Requiem\r<br />-All Thieves Guild/Nightingale armor & weapons\r<br />&gt;excluding muffle effect items, which are only usable by Aether specialists\r<br />&gt;excluding Nightingale Sword - its absorb stamina effect will only work for Chaos\r<br />specialists, and its absorb health effect will only work for Aether specialists.\r<br />-All Dark Brotherhood armor & weapons\r<br />-And other stuff I&#39;m probably forgetting\r<br />\r<br />\r<br />v1.30 Requiem Edition\r<br />---------------------------------------\r<br />*Fixed the bug that was allowing players to benefit from any & all enchanted items when worn.\r<br />-This included ones they shouldn&#39;t have had access to yet because of a lack of Soul Shaper perks, and also even enchantments that were intended only for other school specialists to use. The mod&#39;s system of auto-dispelling the effects of these enchanted items now works as intended.\r<br />\r<br />*Moved all Fortify &lt;magic&gt; & Magicka Regen enchantments into the domain of Soul Shaper rank 1.\r<br />-Early-game mages were at a severe disadvantage I realized as a result of the fact that these enchantments used to require Soul Shaper rank 3 & level 50 in Enchanting to even be able to gain a benefit when worn, not to mention to be able to enchant/disenchant them. The value of these Fortify & Regen enchantments was also lowered slightly to compliment this change, as they were one of the most valuable/expensive enchantments available.\r<br />\r<br />*Finished fully integrating the rest of Requiem&#39;s enchantments into EA&#39;s system\r<br />-Illumination now requires rank 3 of soul shaper to be used.\r<br />-The 2nd & 3rd ranks of all enchantments were properly integrated into the auto-dispel system\r<br />\r<br />*Re-added the missing Enchantment Perk features from Requiem, and integrated them into the perk descriptions to make things clear. These additions & changes include:\r<br />-Soul Shaper rank 2: You can now recharge weapons with filled soul gems\r<br />(you can still turn this requirement off in Requiem&#39;s MCM menu if you want)\r<br />-Soul Shaper rank 3: You can now craft soul gems from rare minerals (Petty thru Greater size)\r<br />-Essence Modulation: You can now craft Grand Soul Gems from rare minerals\r<br />-Essence Nemesis: You can now craft Black Soul Gems under the moons (at midnight)\r<br />\r<br />*Soul Gem Crafting Details:\r<br />-Black Soul Gem crafting used to require the Necromancer Amulet, but I have now set it up so you can craft Black Soul Gems -EITHER- if you have the Essence Nemesis perk, -OR- if you have the Necromancers Amulet (seemed good to balance Essence Nemesis against Essence Modulation, since Chaos Enchanters wont be able to create Grand Gems, but they -can- create Black Gems now).\r<br />-Expanded the Black Soul Gem crafting time window from 1 hour to 2 hours (11pm to 1am)\r<br />-Also made the soul gem recipies require one less ingot of moonstone & quicksilver once you reach level 100, and added option to craft Black Gem from these ingots too, so that an empty Grand Gem is not necessarily required to make a Black Gem.\r<br />\r<br />*For any Soul Tomato enthusiasts, I have compensated for the fact that this item will no longer catch souls by editing the recipe slightly and allowing you to still get something fun out of it. I&#39;ll let you figure out the details. :-D\r<br />\r<br />\r<br />v1.00 Requiem Edition\r<br />-----------------------------------\r<br />\r<br />Notes about how ENCHANTING AWAKENED was integrated into REQUIEM:\r<br />\r<br />Requiem-unique Enchantments: What was kept, and what I renamed it to ~\r<br />\r<br />Fireburst -&gt; Chaos: Fireburst\r<br />Arcane Power -&gt; Chaos: Arcane Affliction\r<br />Toxicity -&gt; Chaos: Toxicity\r<br />\r<br />Shockburst -&gt; Aether: Shockburst\r<br />Spellbreaking -&gt; Aether: Dissolve Aura\r<br />Illumination -&gt; Aether: Illumination\r<br />\r<br />Frostburst -&gt; Corpus: Frostburst\r<br />Annihilation -&gt; Corpus: Anguish\r<br />Force (Rank I) -&gt; Corpus: Impact\r<br />\r<br />Force (Rank II)-&gt; [REMOVED]\r<br />Elemental Fury -&gt; [REMOVED] - (Chaos Damage makes this redundant)\r<br />\r<br />\r<br />Also, a new mechanic has been implemented for gaining access to the Requiem-unique enchantments listed above. Instead of gaining a lesser power which you can use to convert 5 daggers & 3 soul gems into a pile of enchanted weapons, as was granted through one of the Requiem perks, this version of the mod will send you a message at the Enchanting Table once you have unlocked the master perk for your particular style/path in the Enchanting Tree.\r<br />\r<br />The message will inform you that if you bring an Iron Dagger & a Grand Soul Gem to the Arcane Enchanter, you will be able to create a new & unique enchantment. You can then repeat this process up to 3 times in total, and you will gain access to the enchantments listed above for your particular style of enchanting (only twice for the Aether style, since \"Illumination\" is already available as an enchantment through vendors & as random loot).\r<br />\r<br />\r<br />Many of the other vanilla-based enchantments have been renamed along the way, as you will see. Mostly to my owntastes (this is part of how I enjoyed myself while making this patch :-D). For instance, I changed all the enchantments that start with \"Ably\" (like \"Ably Berserking\" - probably the silliest-sounding one for me, at least), and I changed a number of other names too. For instance, Spellbane was the name for magicka damage, but Flamebane & Icebane were resist skills. Thus the use of \"bane\" felt a little confusing or inconsistent between these differeing enchantments, so I changed Spellbane. In my opinion the enchantment names are much improved, but still distinct from vanilla names to preserve the uniqueness of Requiem, so I hope you like them&#33;\r<br />\r<br />The percent chance to paralyze with the paralysis enchantment was changed to a default of 2% - to match the way it exists currently in Requiem. If you want to increase this chance, simply change the ParalysisPercentChance variable in the console (see the website for other adjustable EA settings)\r<br />\r<br />Several effects from Enchanting Awakened were made to be more in line with Requiem&#39;s original settings (duration of Fear & Turn effects were reduced significantly, for instance, to be closer to Requiem&#39;s).\r<br />\r<br />Fortify Heavy & Light armor are now known as Steelskin & Skeeverskin. They will fortify your Heavy & Light armor skills once again, instead of your Armor Rating as it was in Requiem originally (too difficult for me to tweak and rebalance the armor rating buffs without causing potential issues).\r<br />\r<br />All the other unique features of Requiem have been preserved in almost every case (like some enchantments having a rank 1 and a rank 2, or their own unique non-vanilla effects, etcetera).\r<br />\r<br />One thing to note: The \"Soul Tomato\" soul gem wont absorb souls anymore after you install Enchanting Awakened. If you don&#39;t know what that is, then this probably isn&#39;t that important, hunh? :-D\r<br />\r<br />Another thing to note: Soul Shaper rank 2 will be needed to recharge weapons with soul gems (instead of Enchanter 20) - (but you can still turn this option off in the MCM menu)\r<br />\r<br />Enjoy the patch everyone&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened%20-%20Requiem%20Edition%20v1-41-42796-1-41.7z?fid=1000068568&ttl=1535823667&ri=8192&rs=8192&setec=0719b09ce8d71ee52555fe7b83fb4fd5"
    },
    {
      "fileId": "1000071678",
      "name": "1____41 Patch - Bane of Souls Power",
      "version": "1.41BoS",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Patch - Bane of Souls Bug-42796-1-41BoS.7z",
      "uploadedUnix": "1382930835",
      "modVersion": "1.41BoS",
      "virusScanUrl": "https://www.virustotal.com/file/5c0bf153d4a549fd6c8ca4bb440f0701fb51fdbdaac810342cd93b2792d2c218/analysis/1407772361/",
      "changelogHtml": " 1.41 Bane of Souls Patch\r<br />----------------------------------------\r<br />\r<br />The Bane of Souls power granted by Essence Modulation was buggy, and had the potential to sometimes produce stacking harmful effects on the player or follower, in addition to the enemies it was intended to affect.\r<br />\r<br />This patch fixes the problem for any current version of Enchanting Awakened. Just install and put after other EA files in your load order, or use BOSS. The fix will be integrated properly into version 2 in the coming months. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20-%20Bane%20of%20Souls%20Bug-42796-1-41BoS.7z?fid=1000071678&ttl=1535823667&ri=8192&rs=8192&setec=c0dd7c0c7ab23faf1c1c64906c4f97ec"
    },
    {
      "fileId": "1000076289",
      "name": "1____41 MCM Menu Addon",
      "version": "1.41MCM",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73",
      "fileName": "Add-on - Enchanting Awakened MCM Menu-42796-1-41MCM.7z",
      "uploadedUnix": "1383844446",
      "modVersion": "1.41MCM",
      "virusScanUrl": "https://www.virustotal.com/file/24934188b8a27e02c6adbfde5c73d778eeed1a44ed58b7f6cd782d8f5042aaea/analysis/1407783908/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Add-on%20-%20Enchanting%20Awakened%20MCM%20Menu-42796-1-41MCM.7z?fid=1000076289&ttl=1535823668&ri=8192&rs=8192&setec=356622d80790f13a8761a845e0ab749a"
    },
    {
      "fileId": "1000077358",
      "name": "1____41 Patch - Soul Gem Traps",
      "version": "1.41SGT",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "Patch - Soul Gem Traps-42796-1-41SGT.7z",
      "uploadedUnix": "1384101294",
      "modVersion": "1.41SGT",
      "virusScanUrl": "https://www.virustotal.com/file/d0a9c57d7e6d428cb807707d3e2eb1ec434a412afb92be8d0f3dc1f997e23078/analysis/1407787530/",
      "changelogHtml": " 1.41 Soul Gem Traps Patch\r<br />----------------------------------------\r<br />\r<br />Those with the Essence Modulation perk sometimes could not absorb any second power from soul gem traps after absorbing the first time. This was the result of a script loop locking up. The patch retroactively fixes the problem if you already have it, and prevents it from happening for everyone else.\r<br />\r<br />This patch also fixes the bug that prevented people from being able to pick up soul gems after knocking them out of the soul gem traps. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20-%20Soul%20Gem%20Traps-42796-1-41SGT.7z?fid=1000077358&ttl=1535823668&ri=8192&rs=8192&setec=5e26994e686d44de22add2043ad69c02"
    },
    {
      "fileId": "1000086780",
      "name": "1___50 Enchanting Awakened - Patch Pack",
      "version": "1.50",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1484",
      "fileName": "Enchanting Awakened - Patch Pack-42796-1-50.7z",
      "uploadedUnix": "1387056476",
      "modVersion": "1.50",
      "virusScanUrl": "https://www.virustotal.com/file/c4290c49b9379de120c1e0a3fcfe93882070a7d9ee6b8bed9f78553d43dab5a4/analysis/1407839323/",
      "changelogHtml": " ********************************\r<br />\r<br />v1.50 Changelog\r<br />\r<br />********************************\r<br />\r<br />\r<br />Table of Contents:\r<br />\r<br />01 - Global Changes\r<br />02 - Requiem Edition\r<br />03 - SkyRe Edition\r<br />04 - SPERG Edition\r<br />05 - Patch Pack\r<br />\r<br />\r<br />\r<br />01 - Global Changes\r<br />===================\r<br />\r<br />- Integrated SKSE into the mod in various ways (not required, but EA will recognize if you have it). Most significantly, this means installation is faster & less intrusive for everyone.\r<br />\r<br />- Several options that used to be in the installer have now been migrated into the game itself:\r<br />- Better sorting is now the default, but can be toggled off in the MCM menu.\r<br />- Soul Gem Scarcity can be toggled in the MCM menu (but not if you install over an old version)\r<br />- If you do not have SKSE installed, you&#39;ll be asked to choose &#34;Fast&#34; or &#34;Compatible&#34; install in-game, instead of in the installer. With SKSE, installation happens automatically with no confirmation needed.\r<br />\r<br />- EA now has an MCM option to toggle between 1st person and 3rd person style messages&#33;\r<br />- An option to kick NPCs off of Enchanting Tables was added to the MCM menu\r<br />- You can now also adjust the Essence Nemesis absorbed power trigger % in the MCM menu\r<br />- Compatibility option added to MCM, which makes the mod ignore backpacks, pouches, etcetera - this should alleviate any remaining compatibility issues with EA dispelling custom effects.\r<br />\r<br />- Moved all the &#34;Fortify &lt;magic&gt; & Regen&#34; enchantments from the domain of Soul Shaper rank 1 into the domain of Soul Shaper rank 2, and in exchange, moved all the &#34;Fortify Magicka&#34; and &#34;Fortify Magicka Rate&#34; enchantments back down to the domain of Soul Shaper 1. This makes more sense, since you can find simple Fortify Magicka/Rate clothing in the opening Helgen scene, so you ought to be able to use it earlier.\r<br />\r<br />- Added support for all Dawnguard armor and weapons, meaning things like vampire armor and crossbows will now be subject to the same usage and disenchantment limitations as everything else.\r<br />\r<br />- SPERG edition of the mod was added to this edition, with a fully redesigned perk tree combining the best from both mods&#33;\r<br />- Installing over ACE is now natively supported (EA will properly respec all ACE Enchanting perks)\r<br />\r<br />BUGFIXES:\r<br />- Fixed bug that caused bound weapons to dispel soul trap effects on the target being hit, if the player did not have the Mystic Binding perk.\r<br />- Fixed Essence Nemesis perk description to better reflect that it applies to ALL forms of soul trap\r<br />- Fixed erroneous stamina damage magnitude for EnchNightingaleSword04 (25 --&gt; 20)\r<br />- Made another edit to the soul gem trap script to help fix the issue with being unable to grab gems\r<br />- Fixed some minor bugs with old installation process that allowed momentary disenchanting of things you shouldnt have been able to disenchant.\r<br />\r<br />\r<br />\r<br />02 - Requiem Edition\r<br />====================\r<br />\r<br />- Dragonborn is no longer required to use Enchanting Awakened&#39;s Requiem Edition&#33;\r<br />\r<br />- As mentioned above, added MCM option to switch over to 1st-person style messages, which seemed particularly important to improve the seamlessness of EA&#39;s integration into Requiem.\r<br />\r<br />- Revamped the soul gem crafting system. Now, instead of requiring Soul Shaper rank 3 before you can even start crafting gems, things are more progressive. You&#39;ll be able to craft petty gems starting with the first rank of soul shaper, lesser & common gems with rank 2, and greater gems with rank 3. Grand Soul Gems will require Essence Modulation to craft, and Black Gems will require Essence Nemesis. Several perk descriptions were updated and clarified to reflect these changes.\r<br />- Added full support for the gem crafting system in Azirok&#39;s Hard Times. All the crafting recipes in Hard Times will be remapped onto the new Enchanting Awakened perk system for Soul Gem Crafting.\r<br />\r<br />BUGFIXES:\r<br />- The Dispel Soulgems spell was removed from the list of Advanced Restoration perk choices, so it should be properly removed from existence now (since it doesn&#39;t work with Enchanting Awakened)\r<br />- Fixed a few enchantment descriptions on Artifacts & unique items to better reflect the fact that they will be less effective when used without the required perks. This should be clear now whenever it is the case (mainly just for Absorb Health, Absorb Stamina, and Paralysis effects)\r<br />\r<br />\r<br />\r<br />03 - SkyRe Edition\r<br />==================\r<br />\r<br />- Dragonborn and Dawnguard are no longer required to use Enchanting Awakened&#39;s SkyRe Edition&#33;\r<br />- fixed some incorrect messages and labels for SkyRe Enchantments (places where &#34;Pickpocket&#34; was still being used instead of &#34;Fingersmith,&#34; Fortify Alchemy instead of Fortify Speed, etcetera..\r<br />- Added installer options to properly set up the mod, depending on whether or not you are using the SkyRe Standing Stones module. The old version set the Atronach Stone back to vanilla Skyrim values even if you were using the Standing Stones module - this is now fixed.\r<br />- A few minor bugfixes to correct erroneous keywords on certain Magic Effects\r<br />\r<br />\r<br />\r<br />04 - SPERG Edition\r<br />==================\r<br />\r<br />- Official release of the SPERG Edition&#33;\r<br />\r<br />- Features a completely revamped PERK TREE:\r<br />- 2 new ranks of Soul Shaper have been added for a total of 5\r<br />- The five ranks of Soul Shaper are the new &#34;Auto Perks&#34; for the Enchanting tree, and will unlock automatically at the same levels as other SPERG perks.\r<br />- This also results in a lower required perk investment overall, to better fit SPERG&#39;s reduced perk points - the new tree has 9 unlockable non-automatic perks for each path, which is the same number as the original SPERG Enchanting tree.\r<br />- Soul Shaper rank 4 is a slightly modified version of the &#34;Glittering Prizes&#34; perk, which will allow you to craft and modify unique items no matter what path you choose, once it is unlocked (this perk seemed essential to keep available as an option for all enchanters).\r<br />- Soul Shaper rank 5 is sort of a combined version of Flames of Unrest/Glacial Introspection/ Stormflux Foresight, as you will see. The old place that these perks held in the perk tree has now been changed, and two SPERG perks have been inserted into the perk tree for each enchanting path instead:\r<br />- AETHER: Enchanted Weave & Artificer\r<br />- CORPUS: Magic Dust (buffed from 2x to 3x duration) & Preserver\r<br />- CHAOS: Imbue Potion (modified to be more random) & a new perk, &#34;Flare Striker,&#34; based loosely on the weapon effect that used to be part of SPERG&#39;s Glittering Prizes.\r<br />\r<br />- Enchanting Awakened will also properly respec all of your SPERG perks for you upon installing, and give you the correct new auto-perks in the Enchanting Awakened tree.\r<br />\r<br />\r<br />05 - Patch Pack\r<br />===============\r<br />\r<br />- Please download the separate Patch Pack to install any of the following plugins:\r<br />\r<br />- Frostfall compatibility patch ::: Edits Frostfall&#39;s portable &#34;Enchanter&#39;s Circle&#34; so that it now works correctly with EA.\r<br />\r<br />- Stealth Skills Rebalanced patch ::: This plugin makes the stealth module of SSR work correctly with Enchanting Awakened. This mostly involved editing SSR&#39;s changes to the muffle enchantment to better fit into EA&#39;s system. Since Aether specializes in muffle, and also gives up some other powerful enchantments in exchange, I have slightly increased the muffle power of items for Aether specialists, and slightly decreased the values for anyone who does not have the Aether Strider perk unlocked. Here is a comparison chart:\r<br />\r<br />SSR Muffle\r<br />20% - 25% - 30% - 40% - 50%\r<br />\r<br />EA Muffle - Without Aether Strider\r<br />10% - 15% - 20% - 30% - 40%\r<br />\r<br />EA Muffle - With Aether Strider\r<br />20% - 25% - 35% - 45% - 60%\r<br />\r<br />\r<br />- To reflect these changes, each item with a muffle effect will now display a value range in its description. For instance, an item that used to muffle the wearer&#39;s noise by 30% in SSR will now have a description that reads: &#34;Wearer moves 20 - 35% more silently&#34; - the first percentage is always the muffle value you will recieve without the Aether Strider perk, and the second value is the one you will recieve if you have the perk.\r<br />- Player-enchanted muffle items will now provide a 40% muffle effect instead of only a 25% effect, since this enchantment is only available to Aether masters. Keep in mind that any items you&#39;ve previously enchanted will have their description changed, but their muffle power will not change - so you may want to get rid of them before installing the patch.\r<br />\r<br />- Apocalypse Spell Package patch ::: Fixes the &#34;Cloak of Souls&#34; spell from Apocalypse so that it properly uses the Enchanting Awakened version of soul trap and benefits from all the Essence Perks.\r<br />\r<br />- Animated Weapon Enchantments patch ::: Slightly updated to work with the new 1.50 version of Enchanting Awakened. As before, this will allow you to use the &#34;Animated Weapon Enchantments&#34; mod with Enchanting Awakened.\r<br />\r<br />- SeeEnchantments patch ::: A new patch that gives you another option for changing the visual effects of enchantments. Will make the &#34;SeeEnchantments&#34; mod by SpiderAkiraC work with Enchanting Awakened. If you haven&#39;t tried this mod out before, I recommend it - the visual effects are quite nice IMHO. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened%20-%20Patch%20Pack-42796-1-50.7z?fid=1000086780&ttl=1535823669&ri=8192&rs=8192&setec=98b2008884df190109429660bdeb6932"
    },
    {
      "fileId": "1000086893",
      "name": "1___50 Enchanting Awakened",
      "version": "1.50",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2169",
      "fileName": "Enchanting Awakened-42796-1-50.7z",
      "uploadedUnix": "1387126152",
      "modVersion": "1.50",
      "virusScanUrl": "https://www.virustotal.com/file/f1bb8a3113739378d6e3fa2a9447e7d05191ed322b7d75095d015b9bf4daa2c0/analysis/1407843623/",
      "changelogHtml": " ********************************\r<br />\r<br />v1.50 Changelog\r<br />\r<br />********************************\r<br />\r<br />\r<br />Table of Contents:\r<br />\r<br />01 - Global Changes\r<br />02 - Requiem Edition\r<br />03 - SkyRe Edition\r<br />04 - SPERG Edition\r<br />05 - Patch Pack\r<br />\r<br />\r<br />\r<br />01 - Global Changes\r<br />===================\r<br />\r<br />- Integrated SKSE into the mod in various ways (not required, but EA will recognize if you have it). Most significantly, this means installation is faster & less intrusive for everyone.\r<br />\r<br />- Several options that used to be in the installer have now been migrated into the game itself:\r<br />- Better sorting is now the default, but can be toggled off in the MCM menu.\r<br />- Soul Gem Scarcity can be toggled in the MCM menu (but not if you install over an old version)\r<br />- If you do not have SKSE installed, you&#39;ll be asked to choose &#34;Fast&#34; or &#34;Compatible&#34; install in-game, instead of in the installer. With SKSE, installation happens automatically with no confirmation needed.\r<br />\r<br />- EA now has an MCM option to toggle between 1st person and 3rd person style messages&#33;\r<br />- An option to kick NPCs off of Enchanting Tables was added to the MCM menu\r<br />- You can now also adjust the Essence Nemesis absorbed power trigger % in the MCM menu\r<br />- Compatibility option added to MCM, which makes the mod ignore backpacks, pouches, etcetera - this should alleviate any remaining compatibility issues with EA dispelling custom effects.\r<br />\r<br />- Moved all the &#34;Fortify &lt;magic&gt; & Regen&#34; enchantments from the domain of Soul Shaper rank 1 into the domain of Soul Shaper rank 2, and in exchange, moved all the &#34;Fortify Magicka&#34; and &#34;Fortify Magicka Rate&#34; enchantments back down to the domain of Soul Shaper 1. This makes more sense, since you can find simple Fortify Magicka/Rate clothing in the opening Helgen scene, so you ought to be able to use it earlier.\r<br />\r<br />- Added support for all Dawnguard armor and weapons, meaning things like vampire armor and crossbows will now be subject to the same usage and disenchantment limitations as everything else.\r<br />\r<br />- SPERG edition of the mod was added to this edition, with a fully redesigned perk tree combining the best from both mods&#33;\r<br />- Installing over ACE is now natively supported (EA will properly respec all ACE Enchanting perks)\r<br />\r<br />BUGFIXES:\r<br />- Fixed bug that caused bound weapons to dispel soul trap effects on the target being hit, if the player did not have the Mystic Binding perk.\r<br />- Fixed Essence Nemesis perk description to better reflect that it applies to ALL forms of soul trap\r<br />- Fixed erroneous stamina damage magnitude for EnchNightingaleSword04 (25 --&gt; 20)\r<br />- Made another edit to the soul gem trap script to help fix the issue with being unable to grab gems\r<br />- Fixed some minor bugs with old installation process that allowed momentary disenchanting of things you shouldnt have been able to disenchant.\r<br />\r<br />\r<br />\r<br />02 - Requiem Edition\r<br />====================\r<br />\r<br />- Dragonborn is no longer required to use Enchanting Awakened&#39;s Requiem Edition&#33;\r<br />\r<br />- As mentioned above, added MCM option to switch over to 1st-person style messages, which seemed particularly important to improve the seamlessness of EA&#39;s integration into Requiem.\r<br />\r<br />- Revamped the soul gem crafting system. Now, instead of requiring Soul Shaper rank 3 before you can even start crafting gems, things are more progressive. You&#39;ll be able to craft petty gems starting with the first rank of soul shaper, lesser & common gems with rank 2, and greater gems with rank 3. Grand Soul Gems will require Essence Modulation to craft, and Black Gems will require Essence Nemesis. Several perk descriptions were updated and clarified to reflect these changes.\r<br />- Added full support for the gem crafting system in Azirok&#39;s Hard Times. All the crafting recipes in Hard Times will be remapped onto the new Enchanting Awakened perk system for Soul Gem Crafting.\r<br />\r<br />BUGFIXES:\r<br />- The Dispel Soulgems spell was removed from the list of Advanced Restoration perk choices, so it should be properly removed from existence now (since it doesn&#39;t work with Enchanting Awakened)\r<br />- Fixed a few enchantment descriptions on Artifacts & unique items to better reflect the fact that they will be less effective when used without the required perks. This should be clear now whenever it is the case (mainly just for Absorb Health, Absorb Stamina, and Paralysis effects)\r<br />\r<br />\r<br />\r<br />03 - SkyRe Edition\r<br />==================\r<br />\r<br />- Dragonborn and Dawnguard are no longer required to use Enchanting Awakened&#39;s SkyRe Edition&#33;\r<br />- fixed some incorrect messages and labels for SkyRe Enchantments (places where &#34;Pickpocket&#34; was still being used instead of &#34;Fingersmith,&#34; Fortify Alchemy instead of Fortify Speed, etcetera..\r<br />- Added installer options to properly set up the mod, depending on whether or not you are using the SkyRe Standing Stones module. The old version set the Atronach Stone back to vanilla Skyrim values even if you were using the Standing Stones module - this is now fixed.\r<br />- A few minor bugfixes to correct erroneous keywords on certain Magic Effects\r<br />\r<br />\r<br />\r<br />04 - SPERG Edition\r<br />==================\r<br />\r<br />- Official release of the SPERG Edition&#33;\r<br />\r<br />- Features a completely revamped PERK TREE:\r<br />- 2 new ranks of Soul Shaper have been added for a total of 5\r<br />- The five ranks of Soul Shaper are the new &#34;Auto Perks&#34; for the Enchanting tree, and will unlock automatically at the same levels as other SPERG perks.\r<br />- This also results in a lower required perk investment overall, to better fit SPERG&#39;s reduced perk points - the new tree has 9 unlockable non-automatic perks for each path, which is the same number as the original SPERG Enchanting tree.\r<br />- Soul Shaper rank 4 is a slightly modified version of the &#34;Glittering Prizes&#34; perk, which will allow you to craft and modify unique items no matter what path you choose, once it is unlocked (this perk seemed essential to keep available as an option for all enchanters).\r<br />- Soul Shaper rank 5 is sort of a combined version of Flames of Unrest/Glacial Introspection/ Stormflux Foresight, as you will see. The old place that these perks held in the perk tree has now been changed, and two SPERG perks have been inserted into the perk tree for each enchanting path instead:\r<br />- AETHER: Enchanted Weave & Artificer\r<br />- CORPUS: Magic Dust (buffed from 2x to 3x duration) & Preserver\r<br />- CHAOS: Imbue Potion (modified to be more random) & a new perk, &#34;Flare Striker,&#34; based loosely on the weapon effect that used to be part of SPERG&#39;s Glittering Prizes.\r<br />\r<br />- Enchanting Awakened will also properly respec all of your SPERG perks for you upon installing, and give you the correct new auto-perks in the Enchanting Awakened tree.\r<br />\r<br />\r<br />05 - Patch Pack\r<br />===============\r<br />\r<br />- Please download the separate Patch Pack to install any of the following plugins:\r<br />\r<br />- Frostfall compatibility patch ::: Edits Frostfall&#39;s portable &#34;Enchanter&#39;s Circle&#34; so that it now works correctly with EA.\r<br />\r<br />- Stealth Skills Rebalanced patch ::: This plugin makes the stealth module of SSR work correctly with Enchanting Awakened. This mostly involved editing SSR&#39;s changes to the muffle enchantment to better fit into EA&#39;s system. Since Aether specializes in muffle, and also gives up some other powerful enchantments in exchange, I have slightly increased the muffle power of items for Aether specialists, and slightly decreased the values for anyone who does not have the Aether Strider perk unlocked. Here is a comparison chart:\r<br />\r<br />SSR Muffle\r<br />20% - 25% - 30% - 40% - 50%\r<br />\r<br />EA Muffle - Without Aether Strider\r<br />10% - 15% - 20% - 30% - 40%\r<br />\r<br />EA Muffle - With Aether Strider\r<br />20% - 25% - 35% - 45% - 60%\r<br />\r<br />\r<br />- To reflect these changes, each item with a muffle effect will now display a value range in its description. For instance, an item that used to muffle the wearer&#39;s noise by 30% in SSR will now have a description that reads: &#34;Wearer moves 20 - 35% more silently&#34; - the first percentage is always the muffle value you will recieve without the Aether Strider perk, and the second value is the one you will recieve if you have the perk.\r<br />- Player-enchanted muffle items will now provide a 40% muffle effect instead of only a 25% effect, since this enchantment is only available to Aether masters. Keep in mind that any items you&#39;ve previously enchanted will have their description changed, but their muffle power will not change - so you may want to get rid of them before installing the patch.\r<br />\r<br />- Apocalypse Spell Package patch ::: Fixes the &#34;Cloak of Souls&#34; spell from Apocalypse so that it properly uses the Enchanting Awakened version of soul trap and benefits from all the Essence Perks.\r<br />\r<br />- Animated Weapon Enchantments patch ::: Slightly updated to work with the new 1.50 version of Enchanting Awakened. As before, this will allow you to use the &#34;Animated Weapon Enchantments&#34; mod with Enchanting Awakened.\r<br />\r<br />- SeeEnchantments patch ::: A new patch that gives you another option for changing the visual effects of enchantments. Will make the &#34;SeeEnchantments&#34; mod by SpiderAkiraC work with Enchanting Awakened. If you haven&#39;t tried this mod out before, I recommend it - the visual effects are quite nice IMHO. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened-42796-1-50.7z?fid=1000086893&ttl=1535823669&ri=8192&rs=8192&setec=9446b6f97efa8b6ffd27a69e04972c78"
    },
    {
      "fileId": "1000087511",
      "name": "1__60 Enchanting Awakened - Patch Pack",
      "version": "1.60",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1484",
      "fileName": "Enchanting Awakened - Patch Pack-42796-1-60.7z",
      "uploadedUnix": "1387513608",
      "modVersion": "1.60",
      "virusScanUrl": "https://www.virustotal.com/file/5c75269ac326cb5bcdc5c0e5c35b8e5343a0ca891ccd31b9052649808fe424c7/analysis/1407849681/",
      "changelogHtml": " ********************************\r<br />\r<br />v1.60 Changelog\r<br />\r<br />******************************** \r<br />\r<br />\r<br />* BAIN installer/wizard now built into the mod file&#33;\r<br />\r<br />* Patch Pack updated to include Sneak-only module of Stealth Skills Rebalanced. An erroneous omission of the SPERG version of AWE & SeeEnchantments patches has also been re-added.\r<br />\r<br />* Significant bugfixes and improvements to soul gem spellcaster traps:\r<br />\r<br /> -- All bugs that prevented picking up soul gems have been FIXED\r<br />\r<br /> -- While I was at it, I also fixed the annoying vanilla bug that allowed soul gems to sometimes dislodge themselves from the pedestal with their own spells. This wont happen anymore while EA is installed.\r<br />\r<br /> -- Majorly improved logic for the Essence Modulation effects, which means that:\r<br /> --- You will no longer confusingly absorb gems through walls (you now must be able to see the gem before you will begin absorbing from it)\r<br /> --- When multiple gem traps are in an area, the tracking script now fluidly shifts among them as you move, preparing to absorb the gem closest to you. (In the past, the single gem you could absorb was chosen at the moment you entered the dungeon or area, and never changed even if others were closer to you later, which led to strange behavior)\r<br />\r<br />* Fixed one message that didn&#39;t change properly when choosing the new 1st Person\r<br />  Messages option in the Requiem edition of the mod.\r<br />\r<br />* Several minor MCM bugfixes, most importantly - some of the Interface options\r<br />  previously looked like they reset after closing the menu, reverting visually to\r<br />  their old value. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened%20-%20Patch%20Pack-42796-1-60.7z?fid=1000087511&ttl=1535823670&ri=8192&rs=8192&setec=6bfe9ce4914e73907df432ec458c6c84"
    },
    {
      "fileId": "1000087756",
      "name": "1__60 Enchanting Awakened",
      "version": "1.60",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2812",
      "fileName": "Enchanting Awakened-42796-1-60.7z",
      "uploadedUnix": "1387663436",
      "modVersion": "1.60",
      "virusScanUrl": "https://www.virustotal.com/file/cb9ae8f5118dae1cf30eb9ec092cbec6779b3432a82cd98ecd35e4d1e7c5c132/analysis/1407852026/",
      "changelogHtml": " ********************************\r<br />\r<br />v1.60 Changelog\r<br />\r<br />******************************** \r<br />\r<br />\r<br />* BAIN installer/wizard now built into the mod file&#33;\r<br />\r<br />* Patch Pack updated to include Sneak-only module of Stealth Skills Rebalanced. An erroneous omission of the SPERG version of AWE & SeeEnchantments patches has also been re-added.\r<br />\r<br />* Significant bugfixes and improvements to soul gem spellcaster traps:\r<br />\r<br /> -- All bugs that prevented picking up soul gems have been FIXED\r<br />\r<br /> -- While I was at it, I also fixed the annoying vanilla bug that allowed soul gems to sometimes dislodge themselves from the pedestal with their own spells. This wont happen anymore while EA is installed.\r<br />\r<br /> -- Majorly improved logic for the Essence Modulation effects, which means that:\r<br /> --- You will no longer confusingly absorb gems through walls (you now must be able to see the gem before you will begin absorbing from it)\r<br /> --- When multiple gem traps are in an area, the tracking script now fluidly shifts among them as you move, preparing to absorb the gem closest to you. (In the past, the single gem you could absorb was chosen at the moment you entered the dungeon or area, and never changed even if others were closer to you later, which led to strange behavior)\r<br />\r<br />* Fixed one message that didn&#39;t change properly when choosing the new 1st Person\r<br />  Messages option in the Requiem edition of the mod.\r<br />\r<br />* Several minor MCM bugfixes, most importantly - some of the Interface options\r<br />  previously looked like they reset after closing the menu, reverting visually to\r<br />  their old value. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened-42796-1-60.7z?fid=1000087756&ttl=1535823670&ri=8192&rs=8192&setec=b6277bea5f85a1adf65984c07ed4eac1"
    },
    {
      "fileId": "1000089273",
      "name": "Test file - Kill Cam Message Delay",
      "version": "ByRequest",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Kill Cam Message Delay-42796-ByRequest.7z",
      "uploadedUnix": "1388543262",
      "modVersion": "ByRequest",
      "virusScanUrl": "https://www.virustotal.com/file/fc1c27a428e01fdf28b703eb41cf5958a755cd2bc74a8b3f07b6ab10cbbede2b/analysis/1407866944/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kill%20Cam%20Message%20Delay-42796-ByRequest.7z?fid=1000089273&ttl=1535823671&ri=8192&rs=8192&setec=c9c8bb93832c043f637cba26622aec51"
    },
    {
      "fileId": "1000089284",
      "name": "1__60 Patch - Apocalypse",
      "version": "1.60",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Apocalypse Patch-42796-1-60.7z",
      "uploadedUnix": "1388554136",
      "modVersion": "1.60",
      "virusScanUrl": "https://www.virustotal.com/file/4ce09d4e8d904a265623e1c8902baabde637b8c02e29fe1bc0669d79948a85cf/analysis/1407867068/",
      "changelogHtml": " ********************************\r<br />\r<br />v1.60 Changelog\r<br />\r<br />******************************** \r<br />\r<br />\r<br />* BAIN installer/wizard now built into the mod file&#33;\r<br />\r<br />* Patch Pack updated to include Sneak-only module of Stealth Skills Rebalanced. An erroneous omission of the SPERG version of AWE & SeeEnchantments patches has also been re-added.\r<br />\r<br />* Significant bugfixes and improvements to soul gem spellcaster traps:\r<br />\r<br /> -- All bugs that prevented picking up soul gems have been FIXED\r<br />\r<br /> -- While I was at it, I also fixed the annoying vanilla bug that allowed soul gems to sometimes dislodge themselves from the pedestal with their own spells. This wont happen anymore while EA is installed.\r<br />\r<br /> -- Majorly improved logic for the Essence Modulation effects, which means that:\r<br /> --- You will no longer confusingly absorb gems through walls (you now must be able to see the gem before you will begin absorbing from it)\r<br /> --- When multiple gem traps are in an area, the tracking script now fluidly shifts among them as you move, preparing to absorb the gem closest to you. (In the past, the single gem you could absorb was chosen at the moment you entered the dungeon or area, and never changed even if others were closer to you later, which led to strange behavior)\r<br />\r<br />* Fixed one message that didn&#39;t change properly when choosing the new 1st Person\r<br />  Messages option in the Requiem edition of the mod.\r<br />\r<br />* Several minor MCM bugfixes, most importantly - some of the Interface options\r<br />  previously looked like they reset after closing the menu, reverting visually to\r<br />  their old value. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Apocalypse%20Patch-42796-1-60.7z?fid=1000089284&ttl=1535823671&ri=8192&rs=8192&setec=d697f8feffe4a60187c8a46f94370cfd"
    },
    {
      "fileId": "1000095516",
      "name": "Enchanting Awakened",
      "version": "1.61",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2804",
      "fileName": "Enchanting Awakened-42796-1-61.7z",
      "uploadedUnix": "1391655499",
      "modVersion": "1.61",
      "virusScanUrl": "https://www.virustotal.com/file/0a2d3a5d1092b4fe950117d6cb8f4b151b573e1ec917cc71dac213740a4c5920/analysis/1407920225/",
      "changelogHtml": " ********************************\r<br />\r<br />v1.61 Changelog\r<br />\r<br />********************************\r<br />\r<br />* Fixed Bound Weapons not soul trapping properly in SPERG Edition of the Mod\r<br />\r<br />* Patch Pack now includes updated patches for the most recent versions of Apocalypse (v5.04) and Stealth Skills Rebalanced (v1.4) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened-42796-1-61.7z?fid=1000095516&ttl=1535823672&ri=8192&rs=8192&setec=1af15b059229ab297c3c59f09052bd23"
    },
    {
      "fileId": "1000095534",
      "name": "1_61 Enchanting Awakened - Patch Pack",
      "version": "1.61",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1485",
      "fileName": "Enchanting Awakened - Patch Pack-42796-1-61.7z",
      "uploadedUnix": "1391665829",
      "modVersion": "1.61",
      "virusScanUrl": "https://www.virustotal.com/file/37878fef3165e931005f867ff9a8c0251060340ed11d41c4be28b354aec718ac/analysis/1407920405/",
      "changelogHtml": " ********************************\r<br />\r<br />v1.61 Changelog\r<br />\r<br />********************************\r<br />\r<br />* Fixed Bound Weapons not soul trapping properly in SPERG Edition of the Mod\r<br />\r<br />* Patch Pack now includes updated patches for the most recent versions of Apocalypse (v5.04) and Stealth Skills Rebalanced (v1.4) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened%20-%20Patch%20Pack-42796-1-61.7z?fid=1000095534&ttl=1535823672&ri=8192&rs=8192&setec=8d12d809b722cf160a0d62f9c6b07a9a"
    },
    {
      "fileId": "1000095905",
      "name": "1_61 Enchanting Awakened - Patch Pack",
      "version": "1.61b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1595",
      "fileName": "Enchanting Awakened - Patch Pack-42796-1-61b.7z",
      "uploadedUnix": "1391869574",
      "modVersion": "1.61b",
      "virusScanUrl": "https://www.virustotal.com/file/c5be9f13ef8138f31843f9996a6151dd15845cd1a97ab670a31631b16af97231/analysis/1407924126/",
      "changelogHtml": " ********************************\r<br />\r<br />v1.61b Changelog\r<br />\r<br />********************************\r<br />\r<br />* Patch Pack now includes updated patches for the most recent versions of Apocalypse (v5.04) and Stealth Skills Rebalanced (v1.4)\r<br />\r<br />* Added Dwemer Certified patch to integrate DC&#39;s enchanting perks into EA&#39;s tree. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened%20-%20Patch%20Pack-42796-1-61b.7z?fid=1000095905&ttl=1535823672&ri=8192&rs=8192&setec=bbe8bae319efef08929e72499cf52377"
    },
    {
      "fileId": "1000105647",
      "name": "Enchanting Awakened - Patch Pack",
      "version": "1.61c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1928",
      "fileName": "Enchanting Awakened - Patch Pack-42796-1-61c.7z",
      "uploadedUnix": "1397941935",
      "modVersion": "1.61c",
      "virusScanUrl": "https://www.virustotal.com/file/8e41a9ac53a7698378470814ed0c295245ac9b92c2932e45cf9675b5d8078e50/analysis/1408030037/",
      "changelogHtml": " ********************************\r<br />\r<br />v1.61c Changelog\r<br />\r<br />********************************\r<br />\r<br />* Patch Pack now includes updated patches for the most recent versions of Apocalypse (version 5.x) and Stealth Skills Rebalanced (v1.4)\r<br />\r<br />* Added Corpse Preparation - True Necromancy patch to integrate the required soul-trap mechanics from both mods.\r<br />\r<br />* Added Dwemer Certified patch to integrate DC&#39;s enchanting perks into EA&#39;s tree. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanting%20Awakened%20-%20Patch%20Pack-42796-1-61c.7z?fid=1000105647&ttl=1535823673&ri=8192&rs=8192&setec=29bda1e48e0a84a8a77820cf7dc430fb"
    },
    {
      "fileId": "1000132404",
      "name": "Enchanting Awakened - Important Hotfix (Required)",
      "version": "1.61",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Required - Soul Gem Trap Hotfix-42796-1-61.7z",
      "uploadedUnix": "1414209331",
      "modVersion": "1.61",
      "virusScanUrl": "https://www.virustotal.com/file/b9b1e7cd235e7a94623560635b11daed21afaabc8d3d19069cab3ff1ce35cbfd/analysis/1414209421/",
      "changelogHtml": " ********************************\r<br />\r<br />v1.61 Changelog\r<br />\r<br />********************************\r<br />\r<br />* Fixed Bound Weapons not soul trapping properly in SPERG Edition of the Mod\r<br />\r<br />* Patch Pack now includes updated patches for the most recent versions of Apocalypse (v5.04) and Stealth Skills Rebalanced (v1.4) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Required%20-%20Soul%20Gem%20Trap%20Hotfix-42796-1-61.7z?fid=1000132404&ttl=1535823673&ri=8192&rs=8192&setec=87912bc9f48d0cc974571dfe3c1765c2"
    },
    {
      "fileId": "1000132411",
      "name": "Do Not Use Unless Instructed",
      "version": "1.61",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "11",
      "fileName": "Do Not Use Unless Instructed-42796-1-61.7z",
      "uploadedUnix": "1414215364",
      "modVersion": "1.61",
      "virusScanUrl": "https://www.virustotal.com/file/5b2467f5da0048b7a56848c52ffff2e8c753b2661e9544c2823cccdb54cbd411/analysis/1414215482/",
      "changelogHtml": " ********************************\r<br />\r<br />v1.61 Changelog\r<br />\r<br />********************************\r<br />\r<br />* Fixed Bound Weapons not soul trapping properly in SPERG Edition of the Mod\r<br />\r<br />* Patch Pack now includes updated patches for the most recent versions of Apocalypse (v5.04) and Stealth Skills Rebalanced (v1.4) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Do%20Not%20Use%20Unless%20Instructed-42796-1-61.7z?fid=1000132411&ttl=1535823674&ri=8192&rs=8192&setec=71cefcab13b985dc7d938847a7808758"
    }
  ]
}