{
  "modId": 42803.0,
  "modName": "The Legend of Zelda Wooden Sword Retexture",
  "summary": "It\\'s dangerous to go alone! Take this.",
  "descriptionHtml": "===README===\r\n\r\nREQUIREMENTS:\r\nOfficial Hearthfire downloadable content.\r\n\r\nINSTALLATION:\r\nExtract to your primary \\\"Skyrim\\\" directory, simple as that.\r\n\r\nLOCATION:\r\nAt the end of the cavern exit of Helghen Keep, it ought to be hard to miss if you\\'ve started a new game and are on your way out. \\'Ought to be easy to find if you\\'re going back in to find it as well, just around the first corner.\r\n\r\nSTATS:\r\n\\'Tis between the Iron Dagger and Iron Sword in terms of usefullness, can be tempered at a grindstone with a piece of firewood; tempering requires no perks.\r\n\r\nDESCRIPTION:\r\nHowdy y\\'all! I have recently acquired myself a copy of the Hearthfire DLC, and after poking around the .ESM files a bit in the creation kit I found a wooden sword; being the Zelda fan that I am the first thing I did was roll over to the Nexus in order to download the retexture that makes it resemble Link\\'s first wooden sword from the original Legend of Zelda... Only to find that no such mod existed.\r\n\r\nWait, what? Why? It would be almost comically easy to make a half-assed retexture that this model was figuratively crying for, would it not? Well yes, turns out it would. I know because it took me about 2 1/2 minutes to do it myself using photoshop\\'s colourize feature; add an additional 15 or so minutes for fiddling around with the Creation Kit.\r\n\r\nIt\\'s shameful that this simple mod wasn\\'t done before now, c\\'mon guys, you can go through the trouble to make models for the Hylian shield, Master Sword, Kokiri Sword, Gilded Sword and Majora\\'s Mask, but not put 17 1/2 minutes aside for this? The humble wooden sword is the first weapon that Link ever wielded! It deserves respect too... ;_;\r\n\r\n===\r\n\r\nCredit for the original wooden sword model goes to Bethesda.\r\n\r\nDISCLAIMER:\r\nI do not take any responsibility to any damage this retexture may cause to you, your dog, your significant other, or your favourate set of feety pajamas.",
  "categoryId": "29",
  "version": "1.0",
  "author": "Red_Mage21",
  "createdUnix": "1380014090",
  "updatedUnix": "1380013936",
  "containsAdultContent": false,
  "uploadedBy": "Red_Mage21",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000057602",
      "name": "Wooden Sword",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3971",
      "fileName": "Wooden Sword-42803-1-0.rar",
      "uploadedUnix": "1380013936",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bd2ddae813cdcd928f076ad8e6ff3dc1276f4c17aca219058770e68b802892d5/analysis/1407732965/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wooden%20Sword-42803-1-0.rar?fid=1000057602&ttl=1535823678&ri=8192&rs=8192&setec=17c1d799a29591b2e7a5f31ef3187ef3"
    }
  ]
}