{
  "modId": 4281.0,
  "modName": "Skyrim rebalance",
  "summary": "This is an attempt at making several of the overpowered skills go from being worth more than any other skills, no matter what kind of toon you play, to being a worthwhile choice.  This should also make master mode less of a joke.",
  "descriptionHtml": "Introduction:\r\n\r\nThis is still a WIP, almost at the end of the beta phase. This has been tested as entirely playable, and possible only a few minor adjustments to make for a stable version.  The main goal is to rebalance abilities, most essentially everything crafting-related. Master mode is a joke with maxed out alchemy, smiting, and enchanting, master these 3 and you need no other skills for the rest of the game. And they\\'re not exactly hard to master, either. \r\n\r\nI\\'ll be making them all harder to master, my target is to make them just as worthwhile as other skills, no more, no less, instead of being able to replace every other skill in the entire game.  Other skills, especially magic, will be rebalanced to be more fun and balanced.  Spells hit for way too little, and this is counter balanced by the impact spell being able to chain stun enemies infinitely.  this makes magic a spam fest of mosquito bites, not exactly the archmage feeling you\\'re looking for.\r\n\r\npick pocket is also way too powerful, i\\'ll make it much harder to pick pocket a boss bandit\\'s equiped armor and weapons, for example.  also harder to practice.  Physical weapons can easily 1shot most unnamed dragons on master difficulty at max level, but that\\'s more due to placksmithing being overpowered.  i\\'ll still raise block to be more valuable, and make weapon/block perks more powerful than just raising the skill.\r\n\r\nOnce the game is properly balanced, and focused on making choices, rather than becoming an ultimate master at everything at once, and once most of the choices are brought to be just as valuable as the others, i will go on and make monsters thougher, making a true hard mode, which is hard, but beatable with skill, without leaving you pidgeon holed into one specific build for your perks.\r\n\r\nInstallation:\r\n\r\n1)\tUse nexus mods manager to automatically install the mod.  Then select which files you want to enable depending on your tastes.\r\n\r\n2)\tUse an archive utility, such as 7zip or winrar, to unpack everything into your data folder, for most people, this will be either C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data or C:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data .  then use either the nexus mod manager, or the game launcher to select which files to load.\r\n\r\n\r\n\r\nFiles:\r\n\r\nStrings folder:  Localized strings for all the mods so that they load in your own language.\r\nskyrim Rebalance.esp\t\t\tGlobal game settings, such as armor cap, leveling curve, etc\r\nskyrim Rebalance alchemy.esp\t\tAlchemy changes, potions power, ingredient prices, etc\r\nskyrim Rebalance Blacksmith.esp\t\tOre and ingots prices for blacksmith.  eventually this is also where i will put the code to change smithing leveling.\r\nskyrim Rebalance Enchanting.esp\t\tEnchanting changes\r\n\r\n\r\n\r\nWhat\\'s done:\r\n\r\nAlchemy:\r\n\r\nRebalance the power of every alchemy items so that with the maximum fortify alchemy enchants, you can only create potions about as strong as the best pre created potions in the game, and slightly lower than the poisons. Considering how even at level 81 there\\'s still lots of lower potions, being able to make the best stuff reliably from stuff you find in your adventures anyway is still really awesome.\r\n\r\nRebalance ingredients\\'s costs to make it a net loss to practice alchemy at lower levels. The point is to make people go out and gather stuff, and play the game, instead of camping vendors for the first 3 hours of the game and coming out of town a walking 2 legged god. At higher lkevel you\\'ll still be able to make a decent profit.\r\n\r\nEnchanting:\r\n\r\nLower the enchanting power of nearly every player-made enchant to a bit above oblivion-level, considering most enchants can only be put on 4 pieces, vs all of em on oblivion. No more being 15 sneak, 15 pick pocket, and yet being able to sneak past anything anyway, and pick pocket stuff worth 1000 gold just cause of your enchants. Enchanting is back to just being a supplement to other skill, instead of being a complete replacer.\r\n\r\nRaising price of filled gems by 2x-5x, empty ones by 1x-2.5x-. Once again, the point is to get people to explore and fill the gems themselves.\r\n\r\nsmiting:\r\n\r\ncombining with the best alchemy and enchanting buffs, you can only make weapons of about 150 strength anymore, and make dragonmail armor a bit shy of armor cap. Will lower the alchemy/enchanting buffs if you can still 1shot most L50 enemies with this.\r\n\r\nRaise the price of all ores and bars by 2x. Once again, leave the shops and go play the game, and mine!\r\n\r\nGeneral:\r\n\r\nLower armor cap to 75% damage reduction and change armor formula so that you need 650 armor rating without shield to reach it.  This means you will take 25% more physical damage when armor caped.\r\n\r\nMade leveling 3x harder than it already is.\r\n\r\nDoubled the cost of training\r\n\r\nDisabled kill cam\r\n\r\nRaised the number of runes to 2 per player.\r\n\r\nChanged chance to drop weapon on death to zero, to make save file size go down a bit, as dropped weapons dever despawn, even when the whole dungeon respawns.\r\n\r\nDoubled the weight factor in pick pocketing chances.\r\n\r\n\r\n\r\nStill to be done:\r\n\r\nAlchemy: Make it 3x harder to master\r\n\r\nEnchanting: Make it 3x harder to master\r\n\r\nRemake all the loot tables enchantments to be in line with what my player-made enchants, with some unique items being more powerful than anything players can craft.\r\n\r\nSmiting: Make it 15x harder to master\r\n\r\nMake more expansive recipes train you several times more than the iron dagger, in a direct relation to cost.\r\n\r\nBlocking: raising the damage blocked. This is to encourage people to actually train it. Hopefuly, if people aren\\'t 1shoting everything with 2handers anymore, and with the changes to armor and resist cap cited under, this skill will be worthwhile again, especially since npc\\'s will block you better too, forcing you to play smart, instead of just being a walking meat grinder.\r\n\r\nResists: Lower the resist cap to 80. That will be an increase in damage taken by 33%. Hopefuly, people who are armor/resist capped will still be hard to kill, but no longer invincible. Will probably have to wait on the CS to do this\r\n\r\nWeapon skills: Making power attacks cost 100% more stamina. No more chain-stunning enemies for 10 straight shots, power attacks are something to get thru people blocking, not the normal attack.\r\n\r\nspells: make the destruction perk impact only 33% effective. No more infinite chain-blocking. With the lower enchants, you also won\\'t be able to get past -80% mana cost before perks, so you can\\'t kill mobs massively more pwoerful than you just cause of infinite mana and peashooter.\r\n\r\nMake your spell skill raise your spell damage directly. Other mods already do this, but i\\'d rather include it in mine anyway, altough it\\'s way down in the queue\r\n\r\n\r\nChangelog:\r\n\r\n0.3\r\n\r\nfix a bug that made the game crash on load with one of the files\r\n\r\nadded all the strings for all international versions, now it will display all the names correctly for all of you, except for alchem,y ingredients, those were already done the english way by the time i discovered strings file, i\\'ll fix it eventually.\r\n\r\nfixed snowberries mistakenly displaying\r\n0.2\r\n\r\nCreating this readme\r\n\r\nLower armor cap to 75% damage reduction and change armor formula so that you need 650 armor rating without shield to reach it.\r\n\r\nMade leveling 3x harder than it already is.\r\n\r\nDoubled the cost of training\r\n\r\nDisabled kill cam\r\n\r\nRaised the number of runes to 2 per player.\r\n\r\nChanged chance to drop weapon on death to zero, to make save file size go down a bit, as dropped weapons dever despawn, even when the whole dungeon respawns.\r\n\r\nDoubled the weight factor in pick pocketing chances.\r\n\r\nDoubled the number of days it takes for vendors to respawn inventory from 2 days to 4 days.  Hopefuly in this mod, you\\'ll go money hungry for a loing time, so having a longer time to gather your money for a rare thing in some merchant\\'s inventory before it refreshes will be useful, and it will hurt those tyring to level their skills mainly through shops instead of adventuring.\r\n\r\nChanged the prices of vampire dust, giant\\'s toe, and luna moth wing, due to the number of insanely high priced potions you can make with them.  they won\\'t be quite as insanely high priced as before, but still very nice profit at high levels.  Once again, go gather them instead of waiting on shops!\r\n\r\nRaised the prices of every ingots.  No need to tell you the motivation here either :P\r\n\r\n0.1\r\n\r\nLower the enchanting power of nearly every player-made enchant to a bit above oblivion-level, considering most enchants can only be put on 4 pieces, vs all of em on oblivion. No more being 15 sneak, 15 pick pocket, and yet being able to sneak past anything anyway, and pick pocket stuff worth 1000 gold just cause of your enchants. Enchanting is back to just being a supplement to other skill, instead of being a complete replacer.\r\n\r\nRaising price of filled gems by 2x-5x, empty ones by 1x-2.5x-. Once again, the point is to get people to explore and fill the gems themselves.\r\n\r\nsmiting: combined with the best alchemy and enchanting buffs, you can only make weapons of about 150 strength anymore, and make dragonmail armor a bit shy of armor cap. Will lower the alchemy/enchanting buffs if you can still 1shot most L50 enemies with this.\r\n\r\nRebalance the power of every alchemy items so that with the maximum fortify alchemy enchants, you can only create potions about as strong as the best pre created potions in the game, and slightly lower than the poisons. Considering how even at level 81 there\\'s still lots of lower potions, being able to make the best stuff reliably from stuff you find in your adventures anyway is still really awesome.\r\n\r\nRebalance ingredients\\'s costs to make it a net loss to practice alchemy at lower levels. The point is to make people go out and gather stuff, and play the game, instead of camping vendors for the first 3 hours of the game and coming out of town a walking 2 legged god. At higher lkevel you\\'ll still be able to make a decent profit.\r\n",
  "categoryId": "24",
  "version": "0.3",
  "author": "Stephane Pare",
  "createdUnix": "1324484279",
  "updatedUnix": "1325919917",
  "containsAdultContent": false,
  "uploadedBy": "StephanePare",
  "primaryFile": null,
  "files": [
    {
      "fileId": "12795",
      "name": "Skyrim Rebalance Beta 0_10",
      "version": "0.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Skyrim Rebalance Beta 0_10-4281-0-10.7z",
      "uploadedUnix": "1324520698",
      "modVersion": "0.10",
      "virusScanUrl": "https://www.virustotal.com/file/ad4424374b063bc5dabf4f23c3df719c2a100afc590e4c60f15d21d967e0e783/analysis/1406545502/",
      "changelogHtml": " Rebalance the power of every alchemy items so that with the maximum fortify alchemy enchants, you can only create potions about as strong as the best pre created potions in the game, and slightly lower than the poisons <br/> \n Rebalance ingredients\\'s costs to make it a net loss to practice alchemy at lower levels. <br/> \n Lower the enchanting power of nearly every player-made enchant to a bit above oblivion-level <br/> \n Raising price of filled gems by 2x-5x, empty ones by 1x-2.5x-. <br/> \n combined with the best alchemy and enchanting buffs, you can only make weapons of about 150 strength anymore, and make dragonmail armor a bit shy of armor cap <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Rebalance%20Beta%200_10-4281-0-10.7z?fid=12795&ttl=1535759936&ri=8192&rs=8192&setec=60fab343e497baf590e5f21045c571cf"
    },
    {
      "fileId": "17121",
      "name": "Skyrim Rebalance Beta 0_2",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Skyrim Rebalance Beta 0_2-4281-0-2.7z",
      "uploadedUnix": "1325836465",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/e87eb4fc995ab63b1be2dc32d6b57e17744ccf897e491b596615508f1f64b867/analysis/1406587090/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Rebalance%20Beta%200_2-4281-0-2.7z?fid=17121&ttl=1535759936&ri=8192&rs=8192&setec=22b90c2093e8844a94861bb8360795cf"
    },
    {
      "fileId": "17443",
      "name": "skyrim Rebalance 0_3",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "skyrim Rebalance 0_3-4281-1.7z",
      "uploadedUnix": "1325919917",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/44434863299b6a06a1538ce5b83c1046f62702a067bcaaa1ab9c78253e4784f9/analysis/1406589907/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/skyrim%20Rebalance%200_3-4281-1.7z?fid=17443&ttl=1535759937&ri=8192&rs=8192&setec=81a0685cc1fef831ab49b26a2553bbff"
    }
  ]
}