{
  "modId": 42832.0,
  "modName": "The Ningheim Race Spanish Translation",
  "summary": "Traducción al español del mod The Ningheim Race.",
  "descriptionHtml": "Me complace anunciar mi primera traducción en está comunidad de mods de Skyrim.\r\n\r\nNECESITAS EL MOD ORIGINAL: http://skyrim.nexusmods.com/mods/35474/\r\n\r\nREQUISITOS:\r\n\r\nThe Elder Scrolls V: Skyrim (Patch 1.8 o superior)\r\nSKSE (Última versión)\r\nRaceCompatibility para Skyrim y Dawnguard\r\nNingheim Brows package (Descargar el archivo opcional \\\"Ningheim Addon\\\")\r\nXP32 Maximum Skeleton (Solo para aquellos que usan BBP)\r\n\r\n\r\nDESCRIPCION:\r\n\r\n\r\nLa raza de Ningheim son una raza de nórdicos quienes fueron bendecidos por los Nueves Divinos, concediéndoles grandes poderes que les permitían interactuar en el mundo de los vivos y a su vez en el mundo de los espíritus, dando como resultados poderes inimaginables.\r\n\r\nEsta traducción solo está realizada sobre los hechizos y sus descripciones, los compañeros creados por el autor de este mod no los he tocado.\r\n\r\n¿Te gusta un mod, pero no está traducido al español?\r\n\r\nMándame un privado con información sobre el mod y será traducido al español cuanto sea posible.\r\n\r\nSI TE HA GUSTADO ESTA TRADUCCIÓN, POR FAVOR NO OLVIDES DE MOSTRAR TU APOYO, DEJÁNDOME UN ENDORSE.\r\n\r\nSI TE HA GUSTADO ESTE MOD, POR FAVOR NO OLVIDES DE MOSTRAR TU APOYO A SU AUTOR ORIGINAL DEJÁNDOLE UN ENDORSE.\r\n\r\n\r\nERRORES O SUGERENCIAS:\r\n\r\nSi tenéis alguna sugerencia o si creéis que alguna traducción esta mal realizada, por favor no dudéis en hacérmelo saber.\r\n\r\nCREDITOS:\r\n\r\nEspecial gracias a:\r\n\r\n- Bethesda por hacer un gran juego como Skyrim.\r\n- Seren4XX por crear un mod de raza tan increíble como este.\r\n\r\n\r\n\r\nPERMISOS:\r\n\r\nEsta traducción ha sido realizada por ness87 y subida bajo el permiso y autorización de su creador, seren4XX, cualquiera que desee modificar esta traducción, es libre de hacerla, pero no se permitirá su subida en otra página y/o por otro usuario en esta web sin su correspondiente permiso de su creador.",
  "categoryId": "34",
  "version": "1.1",
  "author": "ness87",
  "createdUnix": "1380045431",
  "updatedUnix": "1400012469",
  "containsAdultContent": false,
  "uploadedBy": "ness87",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108997",
      "name": "The Ningheim Race Spanish Translation and Scripts",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30",
      "fileName": "The Ningheim Race Spanish Translation and Scripts-42832-1-1.rar",
      "uploadedUnix": "1400012469",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/80628608d3161960cfc75350d7824906a05b74732bf4b082cec972ff136a9351/analysis/1408075866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ningheim%20Race%20Spanish%20Translation%20and%20Scripts-42832-1-1.rar?fid=1000108997&ttl=1535823697&ri=8192&rs=8192&setec=87e658cf2e6efd14777123dc01cd0a6f"
    }
  ]
}