{
  "modId": 4287.0,
  "modName": "Unique Summons",
  "summary": "",
  "descriptionHtml": "\r\nHave an Alternate Spells version of this mod, with more spells, a little better balance, and more. I recommend using either or since I made some changes to this file. It may conflict with the other. Thanks for all of the support. (http://www.skyrimnexus.com/downloads/file.php?id=5283)\r\n\r\nInstallation\r\n\r\nIf you already installed my previous \\\"BUGGY\\\" edition (Version 1-2-3), there is a bat file included in the bat files folder called simply \\\"Remove\\\". Place it in the same folder as your TESV.exe (steamapps/common/skyrim). This will remove all the disgusting, horrible, messy items from your inventory and prevent any crashes when doing a clean install. Again I\\'m sorry, but this will help you cleanly remove the items if any problems come (hopefully none this time). The other bat files go in the same location as the \\\"remove\\\" file. The .esp goes in your skyrim/data folder. Make sure the old (horrible, nasty, disgusting) plugin is unchecked and properly replaced with the new one.\r\n\r\nPlace the bat files in your Skyrim folder, the one where your tesv.exe is located (steamapps/common/skyrim) Bring up the console and type the name of the bat file you put in that folder. For example: bat Giant or bat wispmother. A ring will appear in your inventory with the name of the character you\\'re summoning. Remember, you need to type the bat files as is, correct spelling, no spaces.\r\n\r\n4 released so far: Wispmother, Tsun, Centurion, Nightingale Guardian. Hopefully majority of the old ones will be released again today, since I found my noob issues.\r\n\r\nThanks again\r\n\r\nVersion 4.1\r\n\r\nReleased all the originals from the other (corrupted) release and added a Dremora Priest. Took me forever to get him to be original, and I believe I did just that. Wait until you see this guy in action. He might be more overpowered than a greybeard. Again, let me know of any problems that arise, will work on them as best I can.\r\n\r\nVersion 4.2\r\n\r\nStorm, Frost, Flame shades added. Didn\\'t mind for the atronachs of the same elements, so I created my own to take their place. Much more powerful as well, though they\\'re mostly melee.\r\nEdit: They don\\'t take the place of the originals, the originals are still in the game. Don\\'t want any misunderstandings. \r\n\r\nVersion 4.3\r\n\r\nExperimentation payed off! Now can summon 2 for one... Liette (Ranger Build) and her companion Pegasai are now added. Hope you enjoy.\r\nEdit: Added my experimentation file instead of the main one. Sorry guys, Pegasai should now follow Liette around as intended\r\n\r\nVersion 4.4\r\n\r\nSheogorath now added... He will use his own summoning spell. All you Oblivion fans might be able to recognize the Golden Saint and the Dark Seducer. Well it\\'s the Skyrim version. A lot of work went into this one, so enjoy!\r\n\r\nAlso new in this version, I tweaked the rings so you should be able to give to your followers and the summons will now be able to follow them around as well. Be sure to let me know if there are any problems.\r\n\r\n*Fixed: A small description error with the rings. They should now have their proper names and summons. \r\n\r\n*Added: Readded the enchantment on the Dark Seducer that I intended to have in the first place. Somehow it didn\\'t get added in the initial upload. All should be as intended now.",
  "categoryId": "75",
  "version": "4.4",
  "author": "Concept83",
  "createdUnix": "1324488426",
  "updatedUnix": "1324488426",
  "containsAdultContent": false,
  "uploadedBy": "Concept83",
  "primaryFile": null,
  "files": []
}