{
  "modId": 42935.0,
  "modName": "Tales Of Tragedy Vol 1",
  "summary": "A fairly lore friendly unmarked quest mod, first in a series.",
  "descriptionHtml": "NEWS: I am so, so sorry to the small number of people who have downloaded and enjoyed this. It is going to have to be on an indefinite hold until I can get a new computer, as I think my five year old notebook is finally beginning to die (it has started to refuse to play certain games no matter what I do). I will come back to this eventually, that is a promise, I just don&#39;t know when I will be able to.\r<br />\r<br />Have you ever wondered why there are so few tales in TES that revolve around failed quests? In real life there are many legends of heroes failing, but not in TES. I seek to remedy that. For now this page is fairly bare bones and I will be making it more flashy when the final version of Vol. 1 is out.\r<br />\r<br />Current features:\r<br />\r<br />-An unmarked quest that will bring you through a fairly large area of Skyrim.\r<br />\r<br />-A set of balanced items as a reward that are not enchanted, so you may freely add what you like to them. (currently uses placeholder models and textures from the vanilla game, still looks nice.)\r<br />\r<br />Future features:\r<br />\r<br />-Voiced narration for the quest letters.\r<br />\r<br />-Unique textures for the item set.\r<br />\r<br />Features that will not be available from myself nor on this page:\r<br />\r<br />-There will not be a walkthrough nor any images that give away where the letters or reward are, nor will the item names be revealed on this page to avoid console commands. If you want the items, you will have to seek them out or get very lucky.\r<br />\r<br />-Quest markers will never be implemented by myself and I will never give permission to make an altered ESP file that adds them. If someone wants to make their own ESP that requires this one and does that, that is their choice, so long as it is not simply an altered version of my ESP and work.\r<br />\r<br />-This mod will never feature on the Steam Workshop. If I find it there, I will report it.\r<br />\r<br />And finally a clue to start you on your way:\r<br />\r<br />Look where the Giant Sleeps to start the quest.\r<br />\r<br />\r<br />Install:\r<br />Download and install with NMM, load your game and enjoy.\r<br />\r<br />Known Issues:\r<br />\r<br />-There seems to be an incompatibility with SkyRe, I am planning on correcting this before the textures are through.",
  "categoryId": "35",
  "version": "0.5A",
  "author": "Sepherose",
  "createdUnix": "1380180913",
  "updatedUnix": "1380180812",
  "containsAdultContent": false,
  "uploadedBy": "Sepherose",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000058417",
      "name": "Alpha Version 1",
      "version": "0.5A",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Alpha Version 1-42935-0-5A.rar",
      "uploadedUnix": "1380180812",
      "modVersion": "0.5A",
      "virusScanUrl": "https://www.virustotal.com/file/1c605100a740e170656d3452a839e4c61bd5bc38291a140aecbf7cb80896aa80/analysis/1407735132/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alpha%20Version%201-42935-0-5A.rar?fid=1000058417&ttl=1535823775&ri=8192&rs=8192&setec=3dee09eea198f634c8f0feaed78fc63b"
    }
  ]
}