{
  "modId": 42972.0,
  "modName": "Hidden Village",
  "summary": "",
  "descriptionHtml": "Dawnguard needet \r\n\r\nthis mod is in german but i made english descriptions for every spell \r\nthis will make your destruction tree german if you dont like i cant change it \r\n------------------------------------------------------------------------------------------- \r\n\r\n\r\nDescription: \r\n\r\nThis mod adds A new World Called Hidden Village with, till now, 3 isles \r\non one isle live the bloodmages the other is a isle full of mushrooms the 3th one isnt done yet but you will get there to do the final quest------------- \r\n-------------------------------------- \r\nA quest will be given tru a courier, when you enter any town (if he dont appears go into a house and go back to city), will lead you to the banned mere sit on the stool and wait for someone talk to you.It could take a while when hes dancing or stuff just wait. or stand up and sit again if he stoped dance. \r\nhe will lead you to the village (near riverwood) and you need to talk with alcard. \r\nIf hes in bed just wait till hes working. \r\nHe will give you a quest to kill a cultist on mushroom island. \r\nTo go over there go to little mushroom isle and find the altar. \r\n\r\n\r\nWhat does it add? \r\n\r\n- Some New Perks On Destruction Perk for Blood Mage \r\n\r\n-Destruction Spells are Now Leveling With You means more dmg+ per level \r\n\r\n-New Playable Race The Blood Mage: abilitys +50 healt / power: Controll blood = control a bloodet anything for 120 seconds( just makes them harmless or help you) \r\n\r\n-8 new spells based on bloodmage: \r\nBlood Aura/ blut aura: Incrases your life. Dual cast it for more life / costs life \r\nBlood Sight/ blut sicht : Lets you see anything that has blood / costs life to cast \r\nBlood Converting/ blut umwandlung : Converts life into Stamina and magica \r\nBlood Transfusion : Single fire Area absorb \r\nBloodwall/ blutwall : Concentraitet fire Area absorb \r\nBlood ball Aura : Area absorb only affects enemies / costs life \r\nBlood absorb/ blut absaugen : Absorbs life overtime from an single actor \r\nConjure blood devil : well nothing to say \r\n\r\n- A spell to call odaviing for much more then a few seconds even if u not have completet the quest and a spell to send him away \r\n\r\n- A spell to make odahviing land thx to Journeyman. Talk to odaving and change his skin via placing it in his inventory!! \r\n\r\n- A Quest line fully voice synchronized \r\n- A little village with merchants that have theyr own day with working and stuff \r\n- A sabrecat follower \r\n- A new Bloodmage robe with dechantable destruction damage fortyfy enchantments ( Forgable after ending the quest) \r\n- Bear follower \r\n- A Trasformation : Blood Deamon for you and your warlock follower that can be found in the village ( talk to her after finishing the quests she will have a dialog option that allows her transform when into battle after u told her to transorm she gets another dialog option that forbids her to transform )\r\n\r\n\r\n\r\nAttention!! \r\nThis moddiefies the original call dragon shout so he will stay longer if u shout too \r\nbut it dont conflicts with the quest line \r\n--------------------------------------------------------- \r\nthe village is not complete navmeshed yet \r\n--------------------------------------------------------- \r\nif u have previus editions, disable them make a clean save and install or enable the mod again \r\nto get the new quest rewards by makingthe quest again \r\n--------------------------------------------------------- \r\nIf you have problems with some things dont work propertly be sure my mod is in the load order on the bottom!!! \r\n\r\n!!!!!!Attention!!!!!! \r\nFor the new Dragonborn dlc : tested it removed some stuff works perfect only thing you need to pay attantion at is \r\n\r\n1 if you call the dragon and you break his will to ride him after riding he wil lfly around and you cannot use the spells to make him land except breaking his will again . \r\nyou need to wait then till hes gone then you cast dragon away and dragon call again and he should appear normaly \r\n\r\n2 after ride and call again he will change his appearience to a normal dragon you need to re give him the desired skin with dragon land \r\n\r\nas usualy if you dont want to ride him cast fragon away after landing and dragon call after dragon away to call him again \r\n\r\n\r\ni used Moonpath to Elsweyr by muppetpuppet textures and meshes for the trees \r\nother mods: \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=14052 \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=14172 \r\n",
  "categoryId": "75",
  "version": "2",
  "author": "AluCard",
  "createdUnix": "1380212783",
  "updatedUnix": "1380281966",
  "containsAdultContent": false,
  "uploadedBy": "Silencedoom",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000058705",
      "name": "1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29783",
      "fileName": "1-42972-1.zip",
      "uploadedUnix": "1380212779",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9a164027b4ab45dbc909642335b73b50cc7786e57c1771f9de645461237b13e9/analysis/1407735698/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/1-42972-1.zip?fid=1000058705&ttl=1535823804&ri=8192&rs=8192&setec=e2abdca046bc8efc65c970f4ea2460d5"
    },
    {
      "fileId": "1000059217",
      "name": "2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29092",
      "fileName": "2-42972-2.zip",
      "uploadedUnix": "1380281966",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/1a3092fc5a79ea8eed0c0687bc6feee1be82ec0d3a76073d603cbb4caf0febc8/analysis/1407737145/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/2-42972-2.zip?fid=1000059217&ttl=1535823804&ri=8192&rs=8192&setec=6eab62ff3957c81dc37afe2ad5377b36"
    }
  ]
}