{
  "modId": 43025.0,
  "modName": "Dahar Master Klingon Batleth 1_02",
  "summary": "An original klingon bat&#39;leth fit for a champion of the Empire",
  "descriptionHtml": "WHAT IT DOES\r<br />\r<br />For now it adds an original Klingon Bat&#39;leth, called the Dahar Master&#39;s Bat&#39;leth. (A Dahar Master is a klingon warrior who has become a legend among their peers, because of their heroic deeds.) It is loosely inspired by the legendary Sword Of Kahless, but still an original mesh. It&#39;s supposed to be a great warrior&#39;s bat&#39;leth from the same era, rather than actually the legendary sword of Kahless himself.\r<br />\r<br />It&#39;s avalable in 4 versions, namely in all combinations of black or brown leather for the grip (there are a LOT of brown leather outfits in Skyrim), and with or without the Klingon insignia embossed on the blade. You can decide for yourself which you like best.\r<br />\r<br />The insignia is not mirrored between the blade faces, so the &#34;arms&#34; should bend in the right direction when viewed from either side.\r<br />\r<br />It is roughly 116 cm long (about 46 inches) from tip to tip, and the grip width is 5cm (2 inch), both sizes stated by Jadzia Dax in DS9 Blood Oath, and confirmed by an actual Dahar Master as being &#34;a warrior&#39;s configuration.&#34; Well, that is assuming that a normal human is about 5&#39;10&#34; or so in the game.\r<br />\r<br />From there, though, I used my own aesthetic preferences AND the game animations as a guide. E.g., the choice of 2 grips instead of 1 for the Sword Of Kahless or 3 for a modern bat&#39;leth is largely based on hand positions. E.g., the back of the tips are sharp because at least one Dance Of Death killmove includes a backslash, so I made the sword realistically able to deliver a devastating draw cut with the back.\r<br />\r<br />Balance-wise, it is on par with a daedric greatsword, but does twice the critical damage and has twice the chance to crit. It also has the silver effect, AND can get up to 7.5x damage multiplier from stealth, if you got the 15x dagger multiplier perk. (Though, obviously, no honourable Klingon warrior would do something as dishonourable as sneak and backstab their opponent;))\r<br />\r<br />Basically it&#39;s a very good end-game weapon, but not over the top. It doesn&#39;t outdo the vanilla weapons by much. Well, not unless you sneak and backstab with it.\r<br />\r<br />It can be crafted using steel, corundum and leather strips for the grip. I was at a loss as to what to approximate &#34;composite bakonite&#34; as for a material, and I didn&#39;t want it to be green or yellow like some metals in the game are supposed to be, so I figure steel with extra corundum will have to do.\r<br />\r<br />It is filed under &#34;Imperial&#34; for crafting, because, you know, Klingon Empire :p\r<br />\r<br />It can be enhanced with a steel ingot.\r<br />\r<br />\r<br />KNOWN PROBLEMS\r<br />\r<br />1. Some of the killmove animations, namely the stabbing variety, especially with killmove mods like Dance Of Death, look wrong with this sword shape. There&#39;s nothing I can do about that, sadly, since animations are for all weapons, and even if I could edit them, then the killmoves with everything else would look wrong.\r<br />\r<br />On the bright side, some of the mace and axe animations that such killmove mods add to swords actually look better with a bat&#39;leth than with vanilla swords, IMHO.\r<br />\r<br />2. For balance reasons I kept the reach the same as for the vanilla two-handers. It may look weird to hit enemies across the room with a sword this short.\r<br />\r<br />3. Technically it sits in the same position on the back as any greatsword, with the grip just above the shoulder. However, in this case the grip starts near the centre of the sword, so half the bat&#39;leth will be above the shoulder.\r<br />\r<br />Again, I don&#39;t think I can change the position without editing the animation for two-handers, and that would screw up the position for vanilla weapons.\r<br />\r<br />\r<br />NOTE FOR PURISTS\r<br />\r<br />Yes, this is not canon in any sense. If that bothers you, don&#39;t download it.\r<br />\r<br />\r<br />RETEXTURING\r<br />\r<br />Unlike some of my other mods, this one uses a plain orthogonal projection of the blade. (Albeit of the sword before being bent, to save on texture size.) So it should not pose any extra difficulties if anyone wants to paint a new texture for it.\r<br />\r<br />Alternately, I&#39;m including a B/W mask in the images which can be used as transparency for a layer. Make a new 1024x2048 image, fill a layer with a lighter metal texture for the edges, and one with a darker metal for the rest of the sword blade, and use the mask as alpha for the layer on top. This will blend smoothly between the two metals for you, without requiring ANY graphics skill at all. So just pick whatever two metal textures you like (rusty, shiny, scratched, damascus steel, whatever) and there you go, if you can do a colour-to-transparency in GIMP with the mask, you can get a good enough texture.\r<br />\r<br />Alternately, just use one layer with whatever metal texture you wish, create a second layer on top of it, load the mask in the layer, set its transparency to something like 25% to 50% (use your own eyes there as a gauge). Now when you export as dds and merge layers, it will just whiten the sharpened edges of whatever metal you used for the sword.\r<br />\r<br />Bear in mind that the texture will look brighter in the game than in Photoshop or GIMP, so either way you go about it, you may want to use the brightness/contrast tools to darken the metal textures first a bit.\r<br />\r<br />You can then use the same texture you just created as an environment map for the blade in NifSkope, so you don&#39;t need to generate a new normal map, and the lighter parts shine brighter.\r<br />\r<br />\r<br />HOW TO GET IT\r<br />\r<br />Craft it. You can surely spare 1 perk point for steel smithing to craft an endgame weapon like this.\r<br />\r<br />Or if you can&#39;t be bothered, pull down the console and type &#34;help dahar&#34; (without the quotes.) That tells you all 4 ids, including the ever important first 2 digits, for your current mod load order. Just use the ids verbatim in player.additem and there you go, genuine Klingon bat&#39;leths will be beamed down to you from a cloaked bird of prey in orbit :p \r<br />\r<br />\r<br />REQUIREMENTS\r<br />\r<br />None. As long as you have a patched base game, you&#39;re good to go earn your rightful place in Kahless&#39;s Black Fleet in Sto-Vo-Kor.\r<br />\r<br />\r<br />HOW TO INSTALL IT\r<br />\r<br />Extract the archive, with directories, in your &#34;Data&#34; folder. Select it in the list of plugin files in the launcher.\r<br />\r<br />\r<br />HOW TO UNINSTALL IT\r<br />\r<br />Delete the .esp file from your Data directory.\r<br />\r<br />Delete the DaharMaster directory in both the MeshesWeapons and TexturesWeapons directories.\r<br />\r<br />\r<br />CONFLICTS\r<br />\r<br />It shouldn&#39;t conflict with anything.\r<br />\r<br />\r<br />LICENSE\r<br />\r<br />I release it in the public domain. You can do anything you wish with it. I would, of course, appreciate it if you give credit, but if not, so be it, I can live with that too.\r<br />\r<br />\r<br />VERSION HISTORY\r<br />\r<br />1.02:\r<br />\tAdded the brown wrap versions\r<br />\tAdded the embossed versions\r<br />\tMore blood on the blade\r<br />\tIncreased the blade thickness slightly, to a quarter of an inch, to match replicas of the Sword Of Kahless\r<br />\tIncreased the grip thickness a bit too\r<br />\tIncreased the amount of materials a little, since this has a lot more blade than a normal two-hander\r<br />\tReduced the price, since crafting and selling these was like printing your own money. (Well, it still is, just not as ludicriously profitable as in 1.0)\r<br />\tMinor texture and mesh tweaks\r<br />\r<br />1.0:\r<br />\tFirst Skyrim release",
  "categoryId": "55",
  "version": "1.02",
  "author": "Moraelin",
  "createdUnix": "1380261067",
  "updatedUnix": "1380520014",
  "containsAdultContent": false,
  "uploadedBy": "Moraelin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000059132",
      "name": "DaharMasterKlingonWeapons_1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2910",
      "fileName": "DaharMasterKlingonWeapons_1_0-43025-1-0.7z",
      "uploadedUnix": "1380261064",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/455fcd8185d0c7a8084a651c624f3b139471ac6e73aadc0a2143b32d481d0100/analysis/1407736973/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DaharMasterKlingonWeapons_1_0-43025-1-0.7z?fid=1000059132&ttl=1535823869&ri=8192&rs=8192&setec=1affd44d1574401ea6db8ac896d78289"
    },
    {
      "fileId": "1000059782",
      "name": "DaharMasterKlingonWeapons_1_02",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3613",
      "fileName": "DaharMasterKlingonWeapons_1_02-43025-1-02.7z",
      "uploadedUnix": "1380520014",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/2fd4c3fd034139ab4be2188f97dfe120cab92470886e261bec28425d1d4c8993/analysis/1407740050/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DaharMasterKlingonWeapons_1_02-43025-1-02.7z?fid=1000059782&ttl=1535823870&ri=8192&rs=8192&setec=4e3a58f62435822b51500c7066acc31c"
    }
  ]
}