{
  "modId": 43036.0,
  "modName": "Kevin VanNords Tools of the Trade",
  "summary": "This mod is for Cam Robinson, Seb Ford, and any of their fans and followers (although it\\'s not exclusive.) It adds the Kevin VanSword and the Conjure Chicken spell (recommended for use with exploding chickens mod.",
  "descriptionHtml": "The great Dovahkiin Kevin VanNord, rumored to have the ability to alter the very fabric of Skyrim, has left for his followers a great and powerful sword. This Kevin VanSword is similar to a Dwarven Greatsword, save for two things: For one, it was designed to be light enough to be wielded with one hand, that Kevin VanNord could smite twice as many enemies in half the time. The other, that it is supposedly enchanted with strange magicks unlike any other. Known as the Kevinchantment, this power gives the Kevin VanSword the might of the elements, dealing Fire, Frost, and Shock Damage, while also Soul Trapping any foe unfortunate enough to cross blades with this legendary Dragonborn.\r\n\r\nOne follower of Kevin VanNord, knowing the art of weaponizing chickens much as Kevin VanNord himself was known for doing, attempted to replicate Kevin VanNord\\'s ability to summon chickens. While it is not a perfect replica, as the power of VanNord was such that he could summon hundreds of chickens without wasting a bit of magicka, this spell makes it possible for the common mage to follow in the legendary VanNord\\'s footsteps, to some extent. The anonymous follower has since written a Tome revealing the art of Chicken Conjuring to whosoever should read it.\r\n\r\nNow, Farengar Secret-Fire has discovered these artifacts, and has them displayed not far from the entrance to Dragonsreach. All you need to do is take them and all the might of Kevin VanNord shall be in your hands. (This mod does NOT include the Exploding Chickens mod, nor does it require it. However, it does come highly recommended, as without it there\\'s not much point to the Conjure Chicken spell).\r\n\r\nUpdate v1.1: Fixed the problem with the conjured chickens not exploding, at the price of the spell summoning normal chickens as opposed to spectral chickens\r\n\r\nNOTE: This is NOT the same mod featured in the video. That mod is uploaded as Kevin VanNord\\'s Tools of the Trade OP. This is a version I made to make it less OP, so hopefully this will appeal to those of you who aren\\'t quite so into the whole one-hit-kill thing.",
  "categoryId": "28",
  "version": "1.1",
  "author": "GingahNinja47",
  "createdUnix": "1380295188",
  "updatedUnix": "1380295188",
  "containsAdultContent": false,
  "uploadedBy": "GingahNinja47",
  "primaryFile": null,
  "files": []
}