{
  "modId": 4306.0,
  "modName": "Farmhouse and Villages vanilla based HD textures",
  "summary": "You wished an all in one collection of my vanilla based hd retexture work for farmhouse and villages texture set.\r\nNow here it is. Barset, woodplanks, chairs, tables, cubboards etc. etc.\r\n",
  "descriptionHtml": "Doing high- res textures based on the stock ones is a very time- consuming task.\r\n \r\nit´s much easier to just replace the original textures with existing high- res ones and only tweak the colour, saturation etc.\r\nBut in most cases this method destroys the artwork and the mood the creators intended to generate in users mind.\r\n \r\nMany of the stock textures in skyrim are very well done. There are only a few ones that i consider disturbing. For example the woodstock texture of the farmhouse set with all the markable crackles in it. I maintained the base texture but removed the wood eyes and the deep cuts.\r\n\r\nI hated it, when i see the same cut or the same woodeye on every woodpost or on every bench/table on exactly the same location.\r\n\r\nMy retexture project intends to fix this flaws and to build high- res textures out of vanilla stock ones.\r\n\r\nBut- Pictures say more than 1000 words. Just have a look at them.",
  "categoryId": "29",
  "version": "1.0",
  "author": "Ecmgecko",
  "createdUnix": "1324511080",
  "updatedUnix": "1324512138",
  "containsAdultContent": false,
  "uploadedBy": "ecmgecko",
  "primaryFile": null,
  "files": [
    {
      "fileId": "12766",
      "name": "farmhouseandvillageshd",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36472",
      "fileName": "farmhouseandvillageshd-4306-1.zip",
      "uploadedUnix": "1324512138",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e63d0227a3102a768523fa53c2adc20eb7c87c19a57b6640d057c51a4df18a97/analysis/1406545275/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/farmhouseandvillageshd-4306-1.zip?fid=12766&ttl=1535759974&ri=8192&rs=8192&setec=eeab8c7796762c3a1cf47c6a4558504f"
    }
  ]
}