{
  "modId": 43061.0,
  "modName": "The FPI Gallery for Console Decorators",
  "summary": "The FPI Gallery provides a large collection of static items for the use of players who enjoy decorating their own homes using the in-game console to obtain and place items. Includes resources based on all DLC. A spreadsheet in the documentation package lists and indexes all of the items available and provides the BaseIDs needed by console decorator",
  "descriptionHtml": "[CENTER][IMG]http://i.imgur.com/uxslqpc.gif[/IMG][/CENTER]\r\n\r\n[color=red]==================\r\n1.1 QUICKFIX PATCH!\r\n==================\r\n\r\nIf you have been experiencing game crashes to the desktop while browsing in the Lab Gallery in the area of the scroll shelves, please download and install the QuickFix 1.1 patch. This patch replaces certain models known to be problematical in this regard.[/color]\r\n\r\n\r\n==================\r\nRequirements:\r\n==================\r\n\r\nSkyrim 1.9.32\r\nHearthfire DLC\r\nDawnguard DLC\r\nDragonborn DLC\r\n\r\n*** THIS IS NOT A MODDER\\\\\\'S RESOURCE AND SHOULD NOT BE TREATED AS SUCH!! ***\r\n\r\n==================\r\nDetails:\r\n==================\r\n\r\nConsole decorators: I know you. I\\\\\\'ve BEEN you. I know that you want to decorate the spaces YOU choose in the homes YOU choose for the characters YOU choose according to YOUR OWN tastes, not the whims of some modder who has made a custom version of your preferred home. And you want to do it without becoming a modder yourself, dealing with the Creation Kit and all that goes with it. I know the headaches of trying to place collectibles on shelves, food on the table, and decorations on the walls. And I know the pain when Havok gets hold of them and destroys hours of work in a heartbeat as soon as you leave the house, like an invisible tornado.\r\n\r\nSo, I thought, wouldn\\\\\\'t it be nice if there were truly static versions of all the things we like to use for decoration? Statics that would stay where we put them, come house carls, stewards, friends, foes, and Havok? And, why should I have to settle for just the items Bethesda included in the game, as good as they are? There sure are some Beautiful Things out there in the custom home mods. Wouldn\\\\\\'t it be great if I could decorate using some of those, too? Why can\\\\\\'t I use the same resources that they use to get these things?\r\n\r\nThe FPI Gallery was the result of this thinking. It contains over *** 1,700 items *** for the console decorator. Items ranging from the useful to the purely decorative, including many from Dawnguard, Dragonborn, and Hearthfire that you won\\\\\\'t find anywhere else. Everything from simple apples to zombie spider trophies. Furnishings and tableware with unique finishes and patterns, pristine banners for every city and faction, artworks, knick-knacks ... name it and we have it. Even a fountain that actually founts (if that\\\\\\'s even a word)!\r\n\r\nMany items are ordinary Skyrim items made invisible to Havok. Others were created by some of the finest texturing and modeling talents in the Skyrim modding community, who make their creations available through modder\\\\\\'s resource packs. The Gallery includes resources from more than 30 resource packs created by nearly two dozen authors. The Credits below are a real who\\\\\\'s-who list of creative talent.\r\n\r\nAnd every item is static. Plates will never leave the table. Food will never leave the plates. Collectibles will never fall off your shelves or worm their way out of display cases and disappear through the floor. (Keening, I\\\\\\'m looking at YOU!)\r\n\r\nYes, it makes for a mighty large download. And it requires that you own all of the official content from Bethesda. But I think it\\\\\\'s worth it. I hope you\\\\\\'ll agree!\r\n\r\n[color=cyan]To visit the Gallery, open the in-game console with the \\\"~\\\" key and type \\\"COC FPILobby\\\". You may see every item offered there and obtain the codes needed to replicate them with the console. Or, you may simply use the indexed spreadsheet included in the documentation to obtain the codes. To leave, use the COC command with the destination of your choice, such as \\\"COC Whiterun\\\".[/color]\r\n\r\n[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/YDB0J.gif[/img][/url][/center]\r\n\r\n=========================\r\nInstallation (Manual):\r\n=========================\r\n\r\n1) Extract the contents of the archive to any folder.\r\n2) Copy the FPI Gallery.esp and FPI Gallery.bsa files to the Skyrim Data folder.\r\n3) Check the FPI Gallery.esp in the Launcher.\r\n\r\n============================\r\nUn-Installation (Manual):\r\n============================\r\n\r\n1. Uncheck the FPI Gallery.esp in the Launcher.\r\n2. Delete the FPI Gallery.esp and FPI Gallery.bsa files from the Skyrim Data folder.\r\n\r\n==================\r\nChange log:\r\n==================\r\n\r\n2013.09.26 - Initial Release\r\n\r\n2013.10.17 - Patch 1.1 Release\r\n\r\n    1) Modified all scroll set and chest models, all crate rack models, and the NobleShelf_MoreShelves model used from the Modder\\'s Resource Pack by Oaristys and Tony67 (http://skyrim.nexusmods.com/mods/16525). This will hopefully prevent CTD that occur on some systems when browsing the Lab Gallery near the scroll shelves.\r\n\r\n    2) Optimized the model for the Noble Lectern Shelf to reduce the file size and improve the collision model.\r\n\r\n==================\r\nContact Details:\r\n==================\r\n\r\nBrettM @ http://tesalliance.org\r\n\r\n==================\r\nCredits:\r\n==================\r\n\r\nPlease see the credit notes for a complete list of authors whose resources were used in the creation of the FPI Gallery, and some special thank-yous that are due to a number of people. The download also contains the original ReadMe documents from these authors, who have sources of their own to acknowledge. The authors behind the authors are equally deserving of recognition for their role in making these resources possible.\r\n\r\n==================\r\nTools Used:\r\n==================\r\n\r\nCreation Kit\r\nNifSkope\r\nNifUtils Suite\r\nPaintShop Pro X5\r\nnvidia DDS plug-in\r\nBlender\r\nInsanitySorrow\\\\\\'s ReadMe Generator\r\n\r\n==================\r\nPermissions:\r\n==================\r\n\r\n*** THIS IS NOT A MODDER\\\\\\'S RESOURCE AND SHOULD NOT BE TREATED AS SUCH!! ***\r\n\r\nI will give no permissions for the use of any asset contained within this mod. Please see the permissions notes for more details.\r\n\r\n*** THIS IS NOT A MODDER\\\\\\'S RESOURCE AND SHOULD NOT BE TREATED AS SUCH!! ***\r\n\r\n\r\n",
  "categoryId": "27",
  "version": "1.1",
  "author": "The Fuzzy Physics Institute",
  "createdUnix": "1380373778",
  "updatedUnix": "1382047569",
  "containsAdultContent": false,
  "uploadedBy": "BrettM",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000059369",
      "name": "FPI Gallery",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "405023",
      "fileName": "FPI Gallery-1-0-43061-1-0.zip",
      "uploadedUnix": "1380350867",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FPI%20Gallery-1-0-43061-1-0.zip?fid=1000059369&ttl=1535823896&ri=8192&rs=8192&setec=485e749b9cc563ac1bba2a20db3d1a1d"
    },
    {
      "fileId": "1000067222",
      "name": "FPI Gallery QuickFix",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "851",
      "fileName": "FPI Gallery QuickFix-43061-1-1.zip",
      "uploadedUnix": "1382047569",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/014f9319d02e370f96fc30488317e2f0b9d576a1ea5d646d15826f6b7230393b/analysis/1407759304/",
      "changelogHtml": " 2013.10.17 - Patch 1.1 Release\r<br />\r<br />1) Modified all scroll set and chest models, all crate rack models, and the NobleShelf_MoreShelves model used from the Modder&#39;s Resource Pack by Oaristys and Tony67 (http://skyrim.nexusmods.com/mods/16525). This will hopefully prevent CTD that occur on some systems when browsing the Lab Gallery near the scroll shelves.\r<br />\r<br />2) Optimized the model for the Noble Lectern Shelf to reduce the file size and improve the collision model.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FPI%20Gallery%20QuickFix-43061-1-1.zip?fid=1000067222&ttl=1535823896&ri=8192&rs=8192&setec=26a192eb26e61100706e97fe359a3cb3"
    }
  ]
}