{
  "modId": 43099.0,
  "modName": "Bow of Jin the Ice Master",
  "summary": "Archery, or destruction? How about both? Take possession of the weapon of a legendary BowMage that allows you to use a bow and cast frost spells at the same time.",
  "descriptionHtml": "Jin the Ice Master\r\nVersion 1.0\r\njonathan0068\r\n\r\nREQUIREMENTS:\r\n\r\nSKSE: Skyrim Script Extender\r\nhttp://skse.silverlock.org/\r\n_______________________________\r\n\r\nIntroduction\r\n\r\n_______________________________\r\n\r\n[youtube]2wV4EwvxneA[/youtube]\r\n\r\n\\\\\\\"Jin the Ice Master\\\\\\\" adds a new bow that opens up a completely new frost-based playstyle. Players who have the bow equipped will be endowed with new abilities that fuse the playstyles of destruction and archery.\r\n\r\nPlayers with the bow equipped will be able to cast \\\\\\\"Ice Spike\\\\\\\" or \\\\\\\"Icy Spear\\\\\\\" at any time while the bow is equipped (Icy Spear will be cast if the player has it). This means that you can fire arrows, and cast Ice Spikes, at the same time. \\\\\\\"Eagle Eye\\\\\\\" will work for Ice Spike as it does with arrows. Ice Spikes cast this way will cost the correct amount of mana, and will level up your destruction skill when hitting a valid target.\r\n\r\nArrows fired from Jin\\\\\\'s Bow of Frost have a chance to reset the cooldown on any frost-based shout you have equipped. Attacks against you while wielding Jin\\\\\\'s Bow of Frost that bring you to very low health will grant you Ice Armor, a 50% reduction to damage and an Ice Cloak, for a few seconds. This ability has an internal cooldown.\r\n\r\n_______________________________\r\n\r\nBackstory\r\n\r\n_______________________________\r\n\r\nJin the Ice Master was a dunmer huntsman who always had an affinity for magic. His deadly shot with a bow was matched only by his skill in destruction magic. Jin journeyed to the College of Winterhold to hone his skills in magic. He soon came to learn of the usefulness of frost-based magic as a complement to his archery, due to the slowing effects of frost based magic. Jin became so proficient in weaving in shots with his bow with his frost spells that eventually he was able to do them simultaneously, firing ice spells immediately followed with arrows, for an assault that his enemies could not withstand. \r\n\r\nOne day, Jin journeyed from the college to the frozen wastes of northern Skyrim, seeking the perfect place in seclusion to hone his skills, and he has not been seen since.\r\n\r\n_______________________________\r\n\r\nInstallation\r\n\r\n_______________________________\r\n\r\nExtract the contents of the archive into your Skyrim/Data folder. Activate the ESP via your preferred method. Launch the game with the SKSE launcher.\r\n\r\n_______________________________\r\n\r\nFAQ\r\n\r\n_______________________________\r\n\r\nQ: Where is the bow?\r\nA: The bow is located in the far north of Skyrim, on a small island among the frozen ocean of the north. If you remember Septimus Signus\\\\\\'s outpost,it is directly west of there, located in a small boat.\r\n\r\nQ: How do I use Ice Spike / Icy Spear?\r\nA:  Holding down the [SPACEBAR] and [RIGHT MOUSE BUTTON] will cast the spell. Keeping them held will repeatedly cast the spell. You MUST know Ice Spike / Icy Spear to cast the spell from the bow.\r\n\r\nQ: How does this work with zooming on the bow?\r\nA: If you have an arrow drawn and press the [RIGHT MOUSE BUTTON], you will zoom. Pressing [SPACEBAR] after will cast the spell while you are zoomed and time is slowed. If you do not have an arrow drawn, and press [SPACEBAR] and [RIGHT MOUSE BUTTON], the spell will be cast and you can subsequently shoot the bow without zooming. Thus, it is possible to cast the spell and shoot the bow while zooming, or while not zooming.\r\n\r\n_______________________________\r\n\r\nCREDITS\r\n\r\n_______________________________\r\n\r\nThe bow model use for Jin\\\\\\'s Bow is from \\\\\\\"Insanity\\\\\\'s Glass Bow\\\\\\\" by InsanitySorrow\r\nhttp://skyrim.nexusmods.com/mods/32694//?\r\n\r\nPlease endorse InsanitySorrow\\\\\\'s mod if you are pleased with the artwork for Jin\\\\\\'s Bow.\r\n\r\n_______________________________\r\n\r\nPERMISSIONS\r\n\r\n_______________________________\r\n\r\nAnything done by me can be considered a modder\\\\\\'s resource. This includes everything except for the model and texture of the bow. Please do not upload this mod anywhere, as it is harder to recieve feedback and offer support that way.\r\n\r\nFor permissions regarding the model and texture of the bow, refer to InsanitySorrow\\\\\\'s mod.",
  "categoryId": "55",
  "version": "1.0",
  "author": "jonathan0068",
  "createdUnix": "1380400429",
  "updatedUnix": "1380400419",
  "containsAdultContent": false,
  "uploadedBy": "jonathan0068",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000059470",
      "name": "Bow of Jin the Ice Master",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2601",
      "fileName": "Bow of Jin the Ice Master-43099-1-0.zip",
      "uploadedUnix": "1380400419",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6750042af2f17ead385a812b757894e0862da638843c9fd1422d3b1415ca5a42/analysis/1407738206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bow%20of%20Jin%20the%20Ice%20Master-43099-1-0.zip?fid=1000059470&ttl=1535823935&ri=8192&rs=8192&setec=4654b53b054296be6dee9ed6631a9d27"
    }
  ]
}