{
  "modId": 43115.0,
  "modName": "(Deprecated)Enchanted Treehome - Tree of Ages",
  "summary": "(Deprecated) Live inside of a gigantic magical tree of ages, illustrious details and plenty of named storage. Very lore friendly, nothing will make you rich in this house, nor does it re-spawn. No overpowered buffs or anything crazy, has all your crafting needs in the basement... based on Atomic Dryad's Enchanted Druid Treehome for Oblivion.",
  "descriptionHtml": "Enchanted Treehome - The Tree of Ages(Deprecated)\n<br />\n<br />***This mod is basically unusable as is. Leaving it up just in case anyone wants to fix up the errors that Skyrim updates caused. People are free to do as they wish with this file. Modify and reupload or whatever. \n<br />Fundamentally, a tree this size in the Tamriel exterior is very problematic, and I was very noobish when I created this, so I did not make seperate static items. Overhauls and mesh packs can and will mess with a lot of the work I have done, and that is my fault for using mostly vanilla references. I have learned a lot since, and hope to release something new in the way of playerhomes. Ive been tinkering with a temple I have been building in CK, and when it is polished and to my liking, I will post it up. ***\n<br />\n<br />Live inside of an enormous tree that is enchanted and packed with all your needs. Inspired by a similar mod for Oblivion by Atomicdryad. \n<br />\n<br />Located West of Whiterun along the big river, refer to the screenshots for a map image.\n<br />\n<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n<br />~All known bugs should be corrected!\n<br />~Has a great location, no conflicts with other player houses!\n<br />~Enthusiast-friendly, no godly buffs or over-valued items!\n<br />~Follower Friendly! Except for the VERY top of the tree, that is for the Dragonborn only you see!\n<br />~The treetop entrance is great for flying characters, if that is your thing.\n<br />~Stunning visuals and lighting effects, Sharpshooter's ENB is highly recommended if you have the GFX Card for it!\n<br />~Over 9000% more beautiful at night, definitely a night-time home, shines in the midnight hour!\n<br />\n<br />Note: Leaving and re-entering the main entrance to the tree should get the butterflies and tropical fish to start spawning in there respective locations.\n<br />\n<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n<br />\n<br />Features: \n<br />\n<br />-A beautiful exterior garden based around a giant magical tree\n<br />-Inside the main entrance is plenty of storage, entrance to a basement and an upstairs bedroom, great visuals, and interior butterflies roaming the innards of the tree\n<br />-A bedroom with named unique weapon and armor storage, a bed with some weapon racks and a door to the lower balcony.\n<br />-2 balconies, 1 halfway up the tree, reachable from the tree's bedroom, and a \"sky\" balcony which can overlook 90% of Skyrim at the top of the tree, reachable from a portal in the basement.\n<br />-A subterranean with fantastic visuals, tropical fish in the waters, a decently stocked kitchen for a beginner player(great for basic needs mods!) and an entire crafting area, also features a portal to the VERY top of the tree... yes you can jump off.. if your lucky you will make it into the pond I placed beneath safely!\n<br />\n<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n<br />\n<br />Installation:\n<br />\n<br />-Download and extract all files from the archive into the Skyrim data folder\n<br />-Enable the Enchantedtreehome.esp in your load order, I don't believe it overly matters where in the list.\n<br />-Load Skyrim and enjoy the new home!\n<br />\n<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n<br />\n<br />Recommendations:\n<br />\n<br />I HEAVILY recommend using these mods to enhance the experience of this one.\n<br />\n<br />~83 Willows 101 bugs, will make more butterflies appear, and greatly enhance there appearance and variations!\n<br />~Sharpshooters ENB Graphics if you have a powerful enough Graphics card.\n<br />~A lighting mod like Realisticlighting or EnhancedLightingFX, both GREAT lighting mods!\n<br />\n<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n<br />\n<br />Special thanks to:\n<br />\n<br />~83 willows for the lovely butterflies!\n<br />~Atomicdryad and his Enchanted Druid Treehome for Oblivion.. the amazing idea that inspired this tree all together!\n<br />~Bethesda for this great game!\n<br />~The nexus community for still going strong!\n<br />\n<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
  "categoryId": "67",
  "version": "1.3",
  "author": "TheDoomspell",
  "createdUnix": "1380426528",
  "updatedUnix": "1380426519",
  "containsAdultContent": false,
  "uploadedBy": "ManslayerJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000059538",
      "name": "Enchanted Treehome - Tree of Ages",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21240",
      "fileName": "Enchanted Treehome - Tree of Ages-43115-1-3.rar",
      "uploadedUnix": "1380426519",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/1aa011323726aeafe6ce7f5b42cd315244717fa9d01572a150ef452e0b6c065b/analysis/1407738632/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanted%20Treehome%20-%20Tree%20of%20Ages-43115-1-3.rar?fid=1000059538&ttl=1535823951&ri=8192&rs=8192&setec=67af7b508e9b218c9b20bdc76a2de008"
    }
  ]
}