{
  "modId": 43119.0,
  "modName": "Staff Crafting - Enhanced Mage Armoury",
  "summary": "This mod adds an entire arsenal of crafting recipes for staves into the game. Adding new crafting components and recipes alike.",
  "descriptionHtml": "[IMG]http://i43.tinypic.com/15x7alu.png[/IMG]\r\n\r\n[IMG]http://i39.tinypic.com/2l9pbew.png[/IMG]\r\n\r\nI\\'ve always thought that the mages felt a little \\\"bare bones.\\\" In Skyrim. It was as if Bethesda just made a spells menu and added a bunch of spells into the game. This is why I designed Staff Crafting.\r\n\r\nStaff Crafting has two main plug-ins. Both of them are optimized for different versions of Skyrim. On the one hand, you have the default plug-in that allows for crafting staves in forges, under the miscellaneous category. They have been well balanced with the materials they use, and the smithing perks that they require. Second plug-in is the Dragonborn optimized plug-in. This file is optimized to make the staff crafting added in Dragonborn more of a prominent feature in Skyrim.\r\n\r\nWhat I mean by \\\"optimized\\\" is that you can choose to use this if you want to. You don\\'t have to use this one if you have the Dragonborn DLC, you can use either in that case. I am just pointing out that the original file built for the Skyrim.esm will add two staff crafting functions into the game, making one of them redundant.\r\n\r\nWhat use is this if I have the Dragonborn DLC? The DLC gives me the official staff crafting feature, why should I get your half-baked mod? Well, the short answer to that rhetorical question is that staff crafting in the DLC is crap. The long answer is that it\\'s CRAAAAAAAAAAAAAAAAAAAAAAPPP! Another prominent question you may have now is, \\\"would you care to elaborate.\\\" And I do enjoy typing long winded paragraphs, so yes, I shall. Bethesda\\'s staff crafting only becomes an available features once you get to Tel Mithryn at about level 40 - 50. ergo, you would already have about 2/3 of the game\\'s spells in your spell menu. Another reason is that they overuse Heartstones. I understand that they are valuble magical artifacts but every recipe is \\\"X\\\" number of Heartstones, the staff associated with that school of magic, and the requirement to already knowing the spell prior to crafting the staff. This brings me on to my finale complaint. Staff crafting is made redundant by itself. It requires you to learn the spell first by either reading a spell book or destroying a staff with the same enchantment. And as we all know, if you know the spell, you\\'re only using magicka to cast spells, which regenerates in seconds. Staves have limited charge before they die. This is why I swapped that out with the scroll recipe system.\r\n\r\nthis mod really kills two birds with one stone as it were with this mod, because not only does it make staff crafting more of a useful feature, but you also finally have a use for all of those scrolls that you keep selling to poor Farengar Secret-Fire. In order to craft a staff, you need a type of alchemy ingredient (e.g. fire salts, ectoplasm, bone meal, void salts, etc.), a scroll that has the same magical effect as the staff, and an unenchanted staff from either crafting it, or buying one from Tel Mithryn. While re-working all of the recipes I had come across a rather peculiar thing. Some of the in-game staves did not have a scroll counterpart. I only noticed this with high level staves, so I did a reasonable thing and instead of making new scrolls, integrating them into the level lists, dotting them around the world, and wasting a bunch of time; instead what I did what I used Heartstones in place of the scrolls. Now, you may now be wondering \\\"doesn\\'t that defeat the purpose of using this mod?\\\" Well, no actually. You see, as I mentioned prior to this, it is only high level staves that are missing scrolls. We\\'re talking level 50 high. Which means that you should have already beaten Solsteim by the time you get to a level high enough to wield that spell staff.\r\n\r\nBasic, Sturdy, and Strong Staff Variations - Adding 3 new sets of empty staves, each having the 1 of each school of magic. It ranges from strongest to weakest, and requiring either steel crafting or advanced armours to make these.\r\n\r\n[IMG]http://i42.tinypic.com/2pq03l4.png[/IMG]\r\n\r\nThis Mod is Compatible With:\r\n - Skyre - http://skyrim.nexusmods.com/mods/9286//?\r\n - ACE - http://skyrim.nexusmods.com/mods/10037/?\r\n - Elemental Staffs - http://skyrim.nexusmods.com/mods/15152//?\r\n\r\nHopefully - if I did it right - the empty staves and soul syphon crystal should be added to the leveling lists of court wizards and blacksmiths. What I did with the leveling lists is probably shoddy work but if someone wanted to help me on that matter, private message me.\r\n\r\n[IMG]http://i43.tinypic.com/31325vp.png[/IMG]\r\n\r\nYou Can: \r\n\r\n    Modify any content in the mods, provided you do not re-upload it.\r\n    Make compatibility patches for if they conflict with your mod.\r\n\r\nYou Cannot:\r\n\r\n    Claim and take any credit for this.\r\n    Re-upload my this to any websites.\r\n    Tell me to undo any changes that I make.\r\n\r\nCompatibility Issues:\r\n\r\n    New staves added by other mod authors will not be craftable in the same way. I\\'d suggest you        ask for a compatibility patch from either me or the other mod author.\r\n\r\nPlanned for the Future:\r\n\r\n   [DRAGONBORN VERSION] Add all of the new crafting materials to the leveled lists of shop keepers as well as adding the empty staves to the leveled lists of shop keepers, blacksmiths, and court wizards.",
  "categoryId": "24",
  "version": "V.1.0B",
  "author": "KWorld",
  "createdUnix": "1380426604",
  "updatedUnix": "1380638673",
  "containsAdultContent": false,
  "uploadedBy": "KWorld97",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000059540",
      "name": "Staff Crafting",
      "version": "V.1.0B",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2093",
      "fileName": "Beta Release-43119-V-1-0B.zip",
      "uploadedUnix": "1380426543",
      "modVersion": "V.1.0B",
      "virusScanUrl": "https://www.virustotal.com/file/fe599d4b34c5c1a352afbdb590a793c88aa44554993a88210e89d8a0818ff551/analysis/1407738728/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beta%20Release-43119-V-1-0B.zip?fid=1000059540&ttl=1535823956&ri=8192&rs=8192&setec=21a338b05664d5dc087df9ca98f03b5e"
    },
    {
      "fileId": "1000060006",
      "name": "Staff Crafting - DRAGONBORN OPTIMIZED",
      "version": "V.2.0B",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "66",
      "fileName": "Staff Crafting - DRAGONBORN OPTIMIZED-43119-V-2-0B.zip",
      "uploadedUnix": "1380588059",
      "modVersion": "V.2.0B",
      "virusScanUrl": "https://www.virustotal.com/file/ffc04d1d4682bb7e51190fc601438ceff8a22a8b3d2f0e81ab5cc82cda455582/analysis/1407740949/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Staff%20Crafting%20-%20DRAGONBORN%20OPTIMIZED-43119-V-2-0B.zip?fid=1000060006&ttl=1535823956&ri=8192&rs=8192&setec=49ff79f14024d78384f5730f9cbb3b3c"
    },
    {
      "fileId": "1000060301",
      "name": "Staff Crafting - DRAGONBORN OPTIMIZED",
      "version": "V.2.25B",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "68",
      "fileName": "Staff Crafting - DRAGONBORN OPTIMIZED-43119-V-2-25B.zip",
      "uploadedUnix": "1380638673",
      "modVersion": "V.2.25B",
      "virusScanUrl": "https://www.virustotal.com/file/26d5c4fb4c305b694ae3c90b3b169ca723bd84edf442ced4a32dc31d95e236c1/analysis/1407741615/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Staff%20Crafting%20-%20DRAGONBORN%20OPTIMIZED-43119-V-2-25B.zip?fid=1000060301&ttl=1535823956&ri=8192&rs=8192&setec=1318395743b5f72d0ae0b0d0cbce915a"
    }
  ]
}