{
  "modId": 43123.0,
  "modName": "Smart Cast",
  "summary": "Use SkyUI to get new alternatives to cast magic spells. Smart Spells are the main feature, you can automatically cast any spell if a set of customizable rules met. Spell Rings and Spell Combos can assist you to be an efficient caster. Give it a try if you are looking to improve your magic casting gameplay, it is compatible with SkyRe.",
  "descriptionHtml": "[center][size=5][color=#FF6622]DISCLAIMER[/color][/size]\r<br />[size=3]All the following pictures use the [url=http://www.skyrim.nexusmods.com/mods/27043]Enhanced Lights and FX[/url] and the [url=http://skyrim.nexusmods.com/mods/28428]New Animation for Magic Casting[/url] mods.[/size][/center]\r<br />\r<br />[center][img]http://imageshack.us/a/img20/594/udom.jpg[/img][/center]\r<br />\r<br />[center][img]http://imageshack.us/a/img850/2856/qb3t.png[/img][/center]\r<br />[center][size=3]Many thanks to [url=http://www.youtube.com/user/Brodual]Brodual[/url] for featuring my mod in his youtube channel,[/size]\r<br />[size=3]he explains in great detail each feature of this mod.[/size]\r<br />[size=3]You can follow him on [url=https://www.facebook.com/Brodual]facebook[/url] or [url=https://twitter.com/brodual]twitter[/url].[/size][/center]\r<br />[center][youtube]O1Fgd_PjPFM[/youtube][/center]\r<br />[line]\r<br />[center][size=3]Thanks to [url=http://www.youtube.com/user/novajam]novajam[/url] for making another illustrative video, and to [url=https://twitter.com/Gruntlock]Gruntlock[/url] for making a video going nuts with my mod.[/size][/center]\r<br />[center][youtube]CUq7unNsbP4[/youtube] [youtube]x2opbZtZ71g[/youtube][/center]\r<br />\r<br />\r<br />[center][img]http://imageshack.us/a/img34/4272/p0i2.png[/img][/center]\r<br />\r<br />[size=3]Skyrim follows this magic casting mechanic[/size]\r<br />\r<br />[center][img]http://imageshack.us/a/img822/7858/r2fh.jpg[/img][size=3]Magic casting mechanics[/size][/center]\r<br />\r<br />[size=3]In a fight this mechanic makes the caster a human loop, repeating all the steps over and over, switching spells back and forth. I feel that some spells should have different mechanics, for example, it would be nice that protective spells could be cast just by selecting them on the menu, instead of been equipped, charge and release.[/size]\r<br />\r<br />[size=3]This mod gives you the possibility to improve your magic casting gameplay with the following three alternatives:[/size]\r<br />\r<br />[center][img]http://imageshack.us/a/img51/7269/ex45.png[/img][size=3]You can assign a set of rules to a spell to be cast automatically[/size][/center]\r<br />\r<br />[center][img]http://imageshack.us/a/img194/8732/0lk4.png[/img][size=3]You can customize these special rings to cast spells when you wear them. You don&#39;t have to worry about your gear, the biped slot was not assigned to these rings, meaning that no item will be unequipped from your character[/size][/center]\r<br />\r<br />[center][img]http://imageshack.us/a/img202/7595/m0t4.png[/img][size=3]Cast more spells with just one hand, you can select up to 3 spells to be cast at the same time[/size][/center]\r<br />\r<br />[size=3]You don&#39;t have to be a magic caster to benefit from this mod, if you are a warrior or a thief, you can create Smart Spells or Spell Rings to cast minor spells like [color=#8C99C2][i]Oakflesh[/i][/color] or [color=#8C99C2][i]Fast Healing[/i][/color] without switching your weapons, now you can use your magicka pool more often, even if it is very small.[/size]\r<br />\r<br />\r<br />[center][img]http://imageshack.us/a/img407/6867/c3o6.png[/img][/center]\r<br />[size=3]Before installing this mod, make sure you have [url=http://skyrim.nexusmods.com/mods/3863]SkyUI[/url] 4.1 and [url=http://skse.silverlock.org]SKSE[/url] 1.6.16 installed, you can try using a lower version, but I programmed the scripts using those versions.[/size]\r<br />\r<br />[size=3]I recommend installing this mod with [color=#CCCCFF][i]Nexus Mod Manager[/i][/color], but if you are installing it manually, just extract into your [color=#CCCCFF][i]skyrim/data[/i][/color] folder.[/size]\r<br />\r<br />\r<br />[center][img]http://imageshack.us/a/img845/6486/aers.png[/img][/center]\r<br />[size=3]After a successful installation, wait around 20 seconds for the initialization message to appear and the MCM to announce the registration of 2 mod configuration pages, after that, you will be ready to go.[/size]\r<br />\r<br />[center][img]http://imageshack.us/a/img819/7/v7il.jpg[/img][size=3]Location of the mod configuration pages[/size][/center]\r<br />\r<br />[size=3]The mod revolves around the weapons and spell cache menus to help you customize your spell casting options. It is a little odd to use them, but the limitations of [color=#CCCCFF][i]Papyrus[/i][/color] gave me no other choice, here is the explication:[/size]\r<br />\r<br />[color=#EEFF77][size=4][b]1.[/b][/size][/color] [size=3]To get some spells or weapons up and running with the mod you have to equip them to your character first, powers are supported but shouts are not.[/size]\r<br />[color=#EEFF77][size=4][b]2.[/b][/size][/color] [size=3]Once you enter either of the mod configuration pages those weapons or spells will be registered to their corresponding cache menu.[/size]\r<br />[color=#EEFF77][size=4][b]3.[/b][/size][/color] [size=3]The first spells or weapons in the cache menus will be the ones your character currently has equipped. The limit of either cache menu is 30 slots.[/size]\r<br />\r<br />[center][img]http://imageshack.us/a/img594/7223/ma28.png[/img][size=3]Spells cache menu[/size][/center]\r<br />\r<br />[center][img]http://imageshack.us/a/img24/36/bkoj.png[/img][size=3]Weapons cache menu[/size][/center]\r<br />\r<br />[size=3]The main purpose of the cache menus is to minimize all the switching of spells and weapons to configure the mod, but keeping it as compatible as possible.[/size]\r<br />\r<br />[size=3]You can use any spell to be part of the mod, even the ones that need a target, but I highly recommend using only cast-on-oneself spells and avoid concentration spells, for example, use [color=#8C99C2][i]Fast Healing[/i][/color] instead of [color=#8C99C2][i]Healing[/i][/color]. You have to keep in mind that some spells have a casting range, if the required range is not met, the spell cast will fail and the magicka needed for the spell will be consumed, [color=#8C99C2][i]Conjure Familiar[/i][/color] spell is a good example of a spell with a casting range that will fail if you target an area too far away.[/size]\r<br />\r<br />[center][img]http://imageshack.us/a/img850/5423/dmb9.jpg[/img][size=3]Example of failing and succeeding the [color=#8C99C2][i]Conjure Familiar[/i][/color] spell cast, notice that both screenshots have consumed the magicka for the spell[/size][/center]\r<br />\r<br />\r<br />[img]http://imageshack.us/a/img109/4683/zyz0.png[/img]\r<br />[size=3]Here you can set up rules for the auto casting system, if all the rules you assign to a spell met and you have enough magicka, the spell will be cast without any intervention from the user and the magicka needed for the spell will be consumed. The order for casting spells is from top to bottom (spell 0 to spell 10), this means if you have a spell that consumes a lot of magicka at the top, other spells will not be cast even if the rules met, keep that in mind. I recommend putting [color=#8C99C2][i]Fast Healing[/i][/color] at the very top, you don&#39;t want to die because you cast a big spell instead of a lifesaving [color=#8C99C2][i]Fast Healing[/i][/color] spell.[/size]\r<br />\r<br />[center][img]http://imageshack.us/a/img13/5551/j55n.jpg[/img][size=3]These are the available options for Smart Spells[/size][/center]\r<br />\r<br />[size=3]Smart Spells can be auto dispel too, for a spell to qualify for auto dispelling the duration of its magic effects should be more than 25 seconds. If the character is still in combat or just got out of combat, the dispel option will return some magicka back depending of the time the spell was active, for example, a spell will return more magicka if it is dispelled with 40 seconds than 20 seconds left.[/size]\r<br />\r<br />[size=3]I guess all the other features of this mod configuration page are self-explanatory, besides the page has [color=#CCCCFF][i]Option Highlight Text[/i][/color] to help you through. The [color=#CCCCFF][i]default key[/i][/color] for the mod configuration pages has the role of clear/reset, if you use it at the select spell option it will remove the Smart Spell, if you use it at the numeric options it will reset it at 50%, any other option will reset it to ignore.[/size]\r<br />\r<br />[size=3]Smart Cast use a 5 second loop to enquire your character status, this means that the auto cast will take from 0 to 5 seconds to detect changes in your character status and cast a spell, please keep that in mind. I programed this loop to be as fast as possible, I use a computer with an Intel i5 processor and an AMD Radeon HD 7750 graphic card to play the game, and the loop takes from 0.08 to 0.2 seconds, I think it is good enough.[/size]\r<br />\r<br />\r<br />[img]http://imageshack.us/a/img713/2616/etgw.png[/img]\r<br />[size=3]This mod configuration page helps you to customize your Spell Rings, Spell Combos and to manage your Smart Spells.[/size]\r<br />\r<br />\r<br />[img]http://imageshack.us/a/img266/6374/ku8o.png[/img]\r<br />[center][img]http://imageshack.us/a/img703/7301/4dx1.jpg[/img][size=3]Spell Ring menu, up to 24 customizable rings[/size][/center]\r<br />\r<br />[size=3]When you create a new Spell Ring, that ring will be added to your character&#39;s inventory and will be renamed after the spell you assign to it. These rings will help you cast spells instantaneously, avoiding completely the typical magic cast mechanic, for example, do you want to cast [color=#8C99C2][i]Oakflesh[/i][/color] but you don&#39;t want to switch your sword or shield for a spell?, well, if you have a Spell Ring with [color=#8C99C2][i]Oakflesh[/i][/color] spell assign to it, you only have to equip it and you will be ready to continue your fight. These rings will be unequipped automatically, they are just a way to trigger an event for the mod to cast spells. You can favorite and assign a hot key to any ring if you want a quick access to a spell, and you can spam these rings for instant cast as long as you have enough magicka for the spell.[/size]\r<br />\r<br />[size=3]To remove a Spell Ring you can use the [color=#CCCCFF][i]default key[/i][/color] from the mod configuration page, it will clear the spell from the ring and the ring will be removed from your character&#39;s inventory as well.[/size]\r<br />\r<br />[size=3]There is a dispel ring, this ring will dispel all magic effects cast by a Spell Ring or Spell Combo from your character, and it does not return any magicka, you can use it just to dispel long duration effects that annoys you.[/size]\r<br />\r<br />\r<br />[img]http://imageshack.us/a/img138/5684/v17c.png[/img]\r<br />[center][img]http://imageshack.us/a/img41/5170/77uq.jpg[/img][size=3]Spell Combos menu, up to 10 combos[/size][/center]\r<br />\r<br />[size=3]If you feel Spell Rings can break your game immersion or it is some kind of cheat, Spell Combos are the alternative. Just like any other spell, you still need to equip a Spell Combo to your character to cast it, but you can cast up to 3 spells at the same time, you will consume the magicka needed for all the spells in one go, make sure your magicka pool is big enough to cast all the selected spells or the Spell Combo will fail. After you create a Spell Combo your character will have a new spell in the alteration section of the magic menu, and it will be named after the first spell of the combo. You can use the [color=#CCCCFF][i]default key[/i][/color] to clear spells from a combo, if you clear all the spells of a combo, it will be removed from your magic menu.[/size]\r<br />\r<br />\r<br />[img]http://imageshack.us/a/img59/7110/b8u6.png[/img]\r<br />[center][img]http://imageshack.us/a/img854/2923/axbf.jpg[/img][size=3]Smart Spell Manager menu[/size][/center]\r<br />\r<br />[size=3]This section helps you change the priority of Smart Spells automatic casting by moving spells up or down from the list of spells. You can delete unwanted spells too, or disable the Smart Spell loop, this last option is particularly useful when you engage in a fist fight with someone and casting magic spells is consider cheating. The reset option is just in case you consider the loop have messed up the spell durations of the automatic casting.[/size]\r<br />\r<br />\r<br />[center][img]http://imageshack.us/a/img818/3346/vtq5.png[/img][/center]\r<br />[size=3]I did my best to program this mod to be compatible with any other mod. I tested it with [url=http://skyrim.nexusmods.com/mods/16225]Apocalypse Spell Package[/url], [url=http://skyrim.nexusmods.com/mods/2275]Balanced Magic[/url] and [url=http://skyrim.nexusmods.com/mods/9286]T3nd0s Skyrim Redone[/url].[/size]\r<br />\r<br />\r<br />[img]http://imageshack.us/a/img11/4292/sfeh.png[/img]\r<br />\r<br />[list][size=3][color=#BBFF77][*] How can I clear/reset/remove X option?[/size][/color]\r<br />[size=3]You can use the [color=#CCCCFF][i]default key[/i][/color] from the mod configuration pages. Sorry I forgot to put that information in the description when I uploaded this mod the first time.[/size][/list]\r<br />[list][size=3][color=#BBFF77][*] Where should I put this mod in the load order?[/size][/color]\r<br />[size=3]There is no need for a specific place, but I like to put it after the [url=http://skyrim.nexusmods.com/mods/3863]SkyUI[/url] mod.[/size][/list]\r<br />[list][size=3][color=#BBFF77][*] How can I uninstall this mod?[/size][/color]\r<br />[size=3]You can simply delete the [color=#CCCCFF][i]BSA[/i][/color] and [color=#CCCCFF][i]ESP[/i][/color] files, it should be safe enough. But if you want to take the extra mile, you can stop the Smart Cast loop before uninstalling, by checking the option in [color=#CCCCFF][i]&#34;Smart Cast – Config &gt; Smart Spells Manager &gt; Stop Smart Spell Loop&#34;[/i][/color] or removing all the Smart Spells, either way will run the [color=#CCCCFF][i]UnregisterForUpdate()[/i][/color]. But I am not sure if that is necessary, I used [color=#CCCCFF][i]RegisterForSingleUpdate(time)[/i][/color] instead of [color=#CCCCFF][i]RegisterForUpdate(time)[/i][/color].[/size][/list]\r<br />[list][size=3][color=#BBFF77][*] Is it safe to uninstall this mod?[/size][/color]\r<br />[size=3]As safe as any other mod with scripts, you will have to live with the following log messages:[/size][/list]\r<br />Cannot open store for class &#34;&lt;script&gt;&#34;, missing file?\r<br />warning: Unable to get type &lt;script&gt; referenced by the save game. Objects of this type will not be loaded.\r<br />warning: Could not find type &lt;script&gt; in the type table in save\r<br />\r<br />[size=3]Uninstalling this mod will not break the game, if you don&#39;t have logging enable, you wouldn&#39;t even notice those messages.[/size]\r<br />\r<br />[list][size=3][color=#BBFF77][*] Why are shouts not supported?[/size][/color]\r<br />[size=3]The game treats shouts and spells completely different, even if they use magic effects the exact same way. And there is no way to activate a shout by script. The only workaround that may work is to remake all the shouts into spells, but I am not sure is worthwhile, it might create too many problems. If [url=http://skse.silverlock.org]SKSE[/url] supports shouts in the future, they will be added to this mod.[/size][/list]\r<br />[list][size=3][color=#BBFF77][*] Does the mod supports concentration spells?[/size][/color]\r<br />[size=3]Yes, but there is no way to control them by script, they will have an erratic behavior. If you create a Smart Spell with these type of spells, it might burn all your magicka away, you can add a rule to prevent this, [color=#CCCCFF][i]&#34;if your magicka is greater than &lt;percentage&gt;&#34;[/i][/color], this way you will always have enough magicka stored for other spells.[/size][/list]\r<br />[list][size=3][color=#BBFF77][*] How can I know X spell is a concentration spell?[/size][/color]\r<br />[size=3]Do you need to keep holding the mouse buttons or your controller trigger buttons for the spell to remain active? If your answer is yes, it is a concentration spell. Examples are: [color=#8C99C2][i]Flames[/i][/color], [color=#8C99C2][i]Sparks[/i][/color], [color=#8C99C2][i]Frostbite[/i][/color], [color=#8C99C2][i]Healing[/i][/color], [color=#8C99C2][i]Healing Hands[/i][/color] and ward spells from the restoration magic school.[/size][/list]\r<br />[list][size=3][color=#BBFF77][*] Does the mod supports bound weapon spells?[/size][/color]\r<br />[size=3]Yes. but not at 100%, it looks like the game needs to know which hand cast the spell, and that information cannot be given by script. I can&#39;t find a way to work around this problem. Right now, if you cast a bound weapon spell using a script, it will have some issues; the weapon will not be dispelled when you sheath it, but don&#39;t worry, it will be dispelled after the magic effects of the spell are over; if you cast one handed bound weapons, the left hand will hold an invisible weapon.[/size][/list]\r<br />[list][size=3][color=#BBFF77][*] Does the mod supports long duration spells or auras?[/size][/color]\r<br />[size=3]Yes, but there are some issues, sometimes you can cast these spells without any limitations. The main problem is that some spells have their duration scripted instead of using the normal spell duration in the [color=#CCCCFF][i]Skyrim Creation Kit[/i][/color], the [color=#CCCCFF][i]GetNthEffectDuration(int n)[/i][/color] returns 0, there is no way to obtain the duration of these spells. For version 1.1, I am planning a way to handle this problem.[/size][/list]\r<br />[list][size=3][color=#BBFF77][*] Can you support hotkeys for the next version?[/size][/color]\r<br />[size=3]You can use Spell Rings instead, just favorite and add a hotkey with the quick menu. I find this approach better than hotkeys, it maintains a high level of compatibility with other mods, and you can still have quick access to favorite items by using the quick menu, this is excellent for gamepad users that have limited number of hotkeys.[/size][/list]\r<br />[list][size=3][color=#BBFF77][*] Can you support dual casting for the next version?[/size][/color]\r<br />[size=3]There is no way to dual cast any spell using scripts, if [url=http://skse.silverlock.org]SKSE[/url] supports dual casting in the future, I will update this mod to include it. I have been thinking how to work around this problem, and the only way is to create single handed spells with the same features and power of a dual cast version, but it will break the compatibility of this mod. For example, [color=#8C99C2][i]Oakflesh[/i][/color] works differently in the [url=http://skyrim.nexusmods.com/mods/9286]SkyRe[/url] version than in the vanilla version of the game.[/size][/list]\r<br />[list][size=3][color=#BBFF77][*] When are you going to release version 1.1?[/size][/color]\r<br />[size=3]As soon as I can, I guess in a few days, meanwhile I want to thank everyone for supporting this mod.[/size][/list]\r<br />\r<br />\r<br />[center][img]http://imageshack.us/a/img546/1237/xcqs.png[/img][/center]\r<br />[size=3][url=http://skyrim.nexusmods.com/mods/35178]Vanilla Magic Tweaks[/url][/size][url=http://skyrim.nexusmods.com/mods/35178][center][img]http://imageshack.us/a/img196/1050/q8lf.jpg[/img][/center][/url][size=3][color=#8C99C2][i]Clairvoyance[/i][/color], [color=#8C99C2][i]Detect Life[/i][/color], [color=#8C99C2][i]Detect Undead[/i][/color] and [color=#8C99C2][i]Candlelight[/i][/color] can be fire-and-forget spells with duration of 5 minutes and can be toggled, making them more useful. It is an excellent companion to use with Smart Cast, just keep in mind the toggle feature can be a little tricky to use, if you cast the spell while it is still active, the spell effects will be dispelled, therefore, use Spell Rings instead of Smart Spells, this way you will have more control over the toggle feature.[/size]\r<br />\r<br />\r<br />[size=3][url=http://skyrim.nexusmods.com/mods/34795]Learn Alchemy From Recipes[/url][/size][url=http://skyrim.nexusmods.com/mods/34795][center][img]http://imageshack.us/a/img24/1527/40i9.jpg[/img][/center][/url][size=3]Would you like your alchemy recipes to be more useful?, try this mod.[/size] \r<br />\r<br />\r<br />[size=3][url=http://www.skyrim.nexusmods.com/mods/27043]Enhanced Lights and FX[/url][/size]\r<br />[size=3]This mod creates a more dramatic and realistic mood to the Skyrim lighting.[/size]\r<br />\r<br />[size=3][url=http://skyrim.nexusmods.com/mods/28428]New Animation for Magic Casting[/url][/size]\r<br />[size=3]Very cool animations for magic casting, no more &#34;caveman&#34; animations from magic users.[/size]\r<br />\r<br />\r<br />[center][img]http://imageshack.us/a/img266/4274/ligq.png[/img][/center]\r<br />[b][size=3]Author:[/b] [color=#BBFF77]NeoRunek[/color][/size]\r<br />[b][size=3]Special Thanks to:[/b] [color=#BBFF77]Zeitz[/color][/size]",
  "categoryId": "93",
  "version": "1.0",
  "author": "NeoRunek",
  "createdUnix": "1380796882",
  "updatedUnix": "1380795631",
  "containsAdultContent": false,
  "uploadedBy": "NeoRunek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000061017",
      "name": "Smart Cast",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "422",
      "fileName": "Smart Cast-43123-1-0.7z",
      "uploadedUnix": "1380795631",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fd9f75dae098aefd71b9bd1d939eaac808563c79afdcced4d404fc5a2638c4ac/analysis/1407743656/",
      "changelogHtml": " Smart Spells can be customized using \"Smart Cast - Spells\" and managed by using \"Smart Cast - Config\" mod configuration page. <br/> \n Spell Rings and Spell Combos can be customized at \"Smart Cast - Config\" mod configuration page. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Smart%20Cast-43123-1-0.7z?fid=1000061017&ttl=1535823960&ri=8192&rs=8192&setec=b8ef2c71b5ae2128d193b1bbdde56cb7"
    }
  ]
}