{
  "modId": 43155.0,
  "modName": "Dyeable Cape",
  "summary": "The mod adds a new style of cape that can be dyed 45ish different colours.",
  "descriptionHtml": "[IMG]http://i.imgur.com/CDJqUGMl.jpg[/IMG]\r\n***********\r\nRequired:\r\n***********\r\nLatest Skyrim.\r\n\r\n***********\r\nInstallation:\r\n***********\r\n\r\nPlace the capes.bsa and capes.esp into your data folder and make sure you have the .esp switched on in the game launcher.\r\n\r\n*************\r\nVideo walkthrough by Nozi87\r\n*************\r\n\r\n[youtube]o6tZ9ImQHWM[/youtube]\r\n\r\n***********\r\nDescription:\r\n***********\r\n\r\nThere are a few awesome cape mods on the nexus, having a system where you could dye a cape hadn’t been done before so I decided to squeeze this mod in amongst the other cape mods. I felt it was also a nice way to introduce a new cape style.\r\n\r\nYou have your grey cape, which is your base cape. You can dye it one of 45ish different colours at a dye lab. Then using a dye remover at the dye lab; which Olaf Ironhand sells, you can remove the dye to turn it back into a grey cape ready to be dyed again.\r\n\r\n**********\r\nProcedure:\r\n**********\r\n\r\n1)You can craft a grey cape at any tanning station using two wolf hides.\r\n\r\n2)Check the pictures to find Olaf’s Emporium. It’s located in the Falkreath hold down beside the boarder gate out of Skyrim.\r\n\r\n3)Go inside, buy his book of dyeing knowledge and read it. You now have the knowledge to be able to dye your grey cape on a dye lab.\r\n\r\n4)All you need now are the necessary ingredients to dye your cape any colour you wish, Olaf has a few ingredients he can sell you as well as some capes.\r\n\r\n5)When you dye your grey cape a colour, you can use a dye remover (sold by Olaf Ironhand) on it to turn your cape back into a grey cape – check the Ebony section on the dye lab. Then you’re ready to dye it another colour.\r\n\r\n********\r\nNotes\r\n********\r\nThe dye lab uses the smithing labels, these are hard coded into the game and can not be renamed. Having said that the dye labs menu is seperate from a forge menu, so you can only dye your cape at a dye lab. There are 3 of these, two in Olaf\\'s shop and one outside along with a tanning rack.\r\n\r\nI\\'ve tried to keep the menu tidy so:\r\nEbony has grey, black and white dyes\r\nGlass has green dyes\r\nElven has yellow dyes\r\nHide has brown and orange dyes\r\nImperial has blue dyes\r\nand so on.\r\n\r\n**********\r\nCredits:\r\n**********\r\n\r\nStrotri for the oven type resource.\r\nNikinoodles for his cape mesh. :D\r\n\r\n*********\r\nPermissions\r\n*********\r\n\r\nDo not upload this file anywhere else, any translations must link back to the main mod here and you’ll need my permission to translate it too.\r\n\r\n",
  "categoryId": "60",
  "version": "1",
  "author": "Vlad550077",
  "createdUnix": "1380492681",
  "updatedUnix": "1380491898",
  "containsAdultContent": false,
  "uploadedBy": "vlad550077",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000059703",
      "name": "Dyeable Cape",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "87764",
      "fileName": "Dyeable Cape-43155-1.7z",
      "uploadedUnix": "1380491898",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/11a0309c923787af55d66a5fcca3913d9ab6ae5e51a79bfaf5bb890dae01878f/analysis/1407739657/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dyeable%20Cape-43155-1.7z?fid=1000059703&ttl=1535823997&ri=8192&rs=8192&setec=844fe19c30bb91a1c7974ad4300b8e36"
    }
  ]
}