{
  "modId": 43175.0,
  "modName": "Player Homes Utility Rooms",
  "summary": "Adds a room to each of the 5 vanilla player homes containing an anvil, workbench, tanning rack, grindstone, smelter, alchemy table, enchanting table, and many unique chests for storage. ",
  "descriptionHtml": "[img]http://r69.cooltext.com/rendered/cooltext1212877314.png[/img]\r\n\r\n[img]http://r60.cooltext.com/d.php?renderid=1212864034&extension=png[/img]\r\nThis mod adds a basement to each of the player homes in Skyrim. These homes are Breezhome, Proudspire Manor, Hjierm, Honeyside, and Vilindrel Hall. In each basement contains an anvil (functions just like a forge), a workbench, a grindstone, a tanning rack, a smelter, an alchemy table, and an enchanting table. The basement also contains several different chests for easy and organized storage. In the smithing section there are chests for leather, heavy armor, light armor, melee weapons, ranged weapons, ingots, and gems. In the allchemy section there are chests for ingriedients, potions, and poisons. In the enchanting section there are chests for empty soul gems, full soul gems, and enchanted gear. The chests also act as a \\\"cloud\\\" so whatever you put in a chest in one house will be found in that same chest in all the other houses. Ex. I put an iron sword in the melee weapons chest in breezehome. Then I go to honeyside and in the basement there is an iron sword in the melee weapons chest. I may or may not get rid of this feature in the future. Please leave feedback, suggestions, complaints, issues, or ideas in the comments section. \r\nSincerely,\r\nBozzz123\r\n[img]http://r69.cooltext.com/rendered/cooltext1212864362.png[/img]\r\nNone so far. Please leave them in the comments section if you find any.\r\n\r\n[url=http://skyrim.nexusmods.com/users/6888730/?tb=mods&pUp=1][b][size=5]Check Out My Mods[/size][/b][/url]",
  "categoryId": "67",
  "version": "V1.0",
  "author": "Bozzz123",
  "createdUnix": "1380506642",
  "updatedUnix": "1380506516",
  "containsAdultContent": false,
  "uploadedBy": "Bozzz123",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000059753",
      "name": "Player Homes Storage Rooms",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Player Homes Storage Rooms-43175-V1-0.zip",
      "uploadedUnix": "1380506516",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4419db0a093ca22cdabf5c85635e81b71bc32d2cd01157fd39483985e1690b66/analysis/1407739930/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Player%20Homes%20Storage%20Rooms-43175-V1-0.zip?fid=1000059753&ttl=1535824015&ri=8192&rs=8192&setec=7e478f0f1811d8d9775f9172b336abc0"
    }
  ]
}