{
  "modId": 4328.0,
  "modName": "BAIN Archive Tools - BAT",
  "summary": "BAIN Tools is a utility that makes creating and managing your BAIN Projects easier than using Window Explorer.  In essence it helps you create and manipulate directories and files within the context of Projects and its Sub-Packages rather than the Windows file system.",
  "descriptionHtml": "[font=Verdana][size=7]BAIN Archive Tools[/size]\r<br />\r<br />BAIN Archive Tools (BAT) is designed for Wrye Bash users who like to build their own complex BAIN packages and for mod makers that want to create BAIN-ready packages for their mods.\r<br />\r<br />BAIN Projects (Projects) are packages that have been extracted from their BAIN-ready archives and are what BAT operates on.\r<br />\r<br />BAT is a tool that makes the creation and managing your Projects easier than using Windows Explorer.  In essence it helps you create and manipulate directories and files within the context of Projects and its Sub-Packages rather than the Windows file system.\r<br />\r<br />You can use BAT for Skyrim, Oblivion, Nehrim, Fallout3 and FalloutNV. You only need one copy of BAT installed to deal with these games.\r<br />\r<br />Use the [url=http://forums.bethsoft.com/topic/1321633-relz-bain-tools]BAT topic on Bethesda Softworks Forum[/url] for posting problems and to participate in BAT discussions.\r<br />\r<br />See [url=http://skyrim.nexusmods.com/mods/110/readmes/BAIN%20Archive%20Tools%20-%20BAT_readme.txt]Version History[/url] for more information about changes made since the initial release. \r<br />___________________________________________________________________________________\r<br />\r<br />[b][size=&#34;6&#34;]What [url=http://www.nexusmods.com/skyrim/users/6828711]egocarib[/url] had to say about BAT[/size][/b]\r<br />\r<br />[i]Just used this to throw together my first (somewhat complex) BAIN package. WOW. Really, this is an astoundingly professional interface you&#39;ve created. The extremely detailed readme made it easy to figure out how to build a wizard and set things up right. And the UI was smooth, intuitive, and filled with helpful features to make editing a breeze. I will certainly be using this from now on[/i].\r<br />___________________________________________________________________________________\r<br />\r<br />[b][size=&#34;6&#34;]Key Features[/size][/b]\r<br />BAT provides tools to...\r<br />[list]\r<br />[*]Organise and manage your Projects and their component Sub-Packages\r<br />[*]Create new Projects and Sub-Packages\r<br />[*]Automate many of the tasks associated with Sub-Package numbering\r<br />[*]Create multiple Sub-Package options from an original containing several ESPs - Useful for creating choices\r<br />[*]Generate an ESP option Sub-Package to allow Meshes and Textures to be installed without the ESP\r<br />[*]Create separator Sub-Packages to make your Projects easier to understand and organise\r<br />[*]Sort all or selected Sub-Packages alphabetically - BAT takes care of the renumbering for you\r<br />[*]Wizard Builder to construct your own Wrye Bash installation Wizard without any scripting knowledge\r<br />[*]Generates a Wizard that will install the sub-packages you select in BAT - takes into account new and deleted sub-packages\r<br />[*]Create a Wizard to make installation of conditional patches easier to do\r<br />[*]Background detection of downloaded mods with automatic extract and moving Data-named folder contents up one level to comply with BAIN format (eg Data&#92;Meshes becomes Meshes)\r<br />[*]Group your BAT managed BAIN Projects to match your usage of Wrye Bash Markers in the Installers tab.\r<br />[/list]___________________________________________________________________________________\r<br />\r<br />[b][size=&#34;6&#34;] Required[/size][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/1840]Wrye Bash[/url]\r<br />- BAT is of no use unless you are using Wrye Bash to install BAIN archives\r<br />\r<br />[b][u]Microsoft .NET Framework 4.5[/u][/b] (automatically installed by the setup if not already on your system)\r<br />___________________________________________________________________________________\r<br />\r<br />[b][size=&#34;6&#34;]Credits and Thanks[/size][/b]\r<br />My thanks to the Wrye Bash project team for creating and maintaining this invaluable tool.\r<br />___________________________________________________________________________________\r<br />\r<br />[b][size=&#34;6&#34;]Licensing and Legal[/size][/b]\r<br />[list][*]You may not use the BAIN Tools for commercial purposes\r<br />[*]You may not upload the BAIN Tools without the express permission of Surazal\r<br />[*]You may change and publish something based on the BAIN Tools providing it does not contravene #1. Giving me credit would be nice. \r<br />[/list]___________________________________________________________________________________\r<br />[url=http://www.nexusmods.com/oblivion/users/339693]Surazal[/url][/font]",
  "categoryId": "39",
  "version": "6.4.1",
  "author": "Surazal",
  "createdUnix": "1324548122",
  "updatedUnix": "1439044733",
  "containsAdultContent": false,
  "uploadedBy": "Surazal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000170966",
      "name": "BAIN Archive Tools v6-4-1",
      "version": "6.4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6881",
      "fileName": "BAIN Archive Tools v6-4-1-4328-6-4-1.7z",
      "uploadedUnix": "1439044733",
      "modVersion": "6.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/005def97ec56c0c31381a39d2ecd392c29b76e630be9bccf748cfabe6bf302c4/analysis/1439044749/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BAIN%20Archive%20Tools%20v6-4-1-4328-6-4-1.7z?fid=1000170966&ttl=1535760017&ri=8192&rs=8192&setec=ee56e7addd3914ff49e2816172610945"
    }
  ]
}