{
  "modId": 43329.0,
  "modName": "Lord of the Rings Mod english Version",
  "summary": "This Mod add 3 new Worlds from the Lords of the Ring Trilogie: Mirkwood, Lothlorien and the Mines of Moria.\r\nThis is a english Translation of the Lord of the Rings Mod by Maldaran",
  "descriptionHtml": "!!!This is only a english translation!!!\r\nYou can found the original here (not required):\r\n[url=http://skyrim.nexusmods.com/mods/38025/?tab=2&navtag=%2Fajax%2Fmodfiles%2F%3Fid%3D38025&pUp=1]Lord of the Rings Mod by Maldaran[/url]\r\n\r\nPlease set this mod very high in the modlist (after the unofficial Paches or the high resolutuion packs) to bypass bugs\r\n\r\nAfter a long time, my first Skyrim mod is finally finished. I think it is well worth seeing for any Lord of the Rings fan. Initially, I have created three new areas of Middle Earth.\r\n\r\nPrerequisites: none known\r\n\r\nContents:\r\nOnce you have discovered the dragonsreach in Whiterun, you can travel to the east of Skyrim to new locations.\r\nThe world choice allows the player to travel directly into the respective territories he wishes to enter. The areas themselves are also connected internally.\r\n\r\nMoria\r\nThe Mines of Moria can be entered from the west side of the Misty Mountains through the Hollin Gate. The mine itself is divided into smaller areas such as the lower depths or Khazad Dum.\r\n\r\nLothlorien\r\nThe Golden Forest Lothlorien is entered centrally. The west side includes the treeline and an Orc camp. The eastern half of the forest has the capital city of Caras Galadhon.\r\n\r\nMirkwood\r\nThe Dark forest on the banks of the Anduin. There is also a small outpost of Elves. In the Northern part of the forest there is a spider cave, and far to the east rises the fortress of Dol Guldur. The elves besiege this fortress, but evil has awakened within it and has been waiting for a worthy opponent.\r\n\r\nMore News:\r\nApart from the detailed areas, I also added materials for crafting. In the Mines of Moria, Mithril is everywhere. If you have enough of it, you can forge a sword and a shirt in the great forge of Khazad Dum. The shirt is worn under regular armor, but it offers both armor and enchantment bonuses.\r\n\r\nIn Lothlorien, specifically in Caras Galadhon, you can discover a market and a barracks. Here the player can trade and improve his fighting skills with the Elves.\r\n\r\nAll three areas are accessible with a companion. If there are any problems with the companion, for example. the stairs of the grand staircase, or the companion becomes lost, use the following solution:\r\n\r\n1. open the console with ~\r\n2. Select your companion, either by direct sight targeting, or use: prid-XXXXXXXXX (where X stands for the ID of the companion) - *Note from translator - this is the instance ID, not the form ID. You can get it by selecting the companion when the console is open. Save it. Write it down to use later if needed.*\r\n3. Next, in the console, type \\\"moveto player\\\" and your companion should appear next to you after closing the console .\r\n\r\nI will continue working to expand my knowledge of the Creation Kit. Future projects I am considering are Bree, Rivendell, Weathertop, Eregion, Rohan, Misty Mountains, Mordor, and some others. These will hopefully start to appear in subsequent versions of this mod.\r\n\r\nKnown issues:\r\nAt present I can think of only one thing. In the main quest, you are sent to the cave of Septimus. Unfortunately the cave ceiling is missing. I will try to add it in a later version.\r\n\r\nOtherwise, there should be few problems with this mod. I am not aware of any compatibility issues with other mods.\r\nShould a problem occur, leave a comment.\r\n",
  "categoryId": "30",
  "version": "1.0",
  "author": "Maldaran and GameFreak041",
  "createdUnix": "1380651992",
  "updatedUnix": "1380651391",
  "containsAdultContent": false,
  "uploadedBy": "GameFreak041",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000060353",
      "name": "Lord of the Rings Mod English Version",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1536",
      "fileName": "Lord of the Rings Mod English Version-43329-1-0.zip",
      "uploadedUnix": "1380651391",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3582f3269b482cd5faf76f021cad123c99e15767a0bc3de19b6f5ce4023ee9ac/analysis/1407741666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lord%20of%20the%20Rings%20Mod%20English%20Version-43329-1-0.zip?fid=1000060353&ttl=1535824151&ri=8192&rs=8192&setec=5af738597c3161f54a36ef599fe5fdab"
    }
  ]
}