{
  "modId": 43337.0,
  "modName": "Chest of Enchanting",
  "summary": "Cant be bothered to find each item to enchant or enter the few dozen \\\"additem\\\" commands to get every enchanted item? I couldn\\'t...so I boxed it all up instead.",
  "descriptionHtml": "This mod, simple in what it does, adds a Dwarven Convector into the Jarls Longhouse in Falkreath. Why Falkreath, well everything else people put in usually seems to go in Helgen/ Windhelm/ Whiterun/ Riverwood etc so I fancied there instead. Besides I am growing to like Falkreath...\r\n\r\nThis Convector contains one of each of the generic magical items added by all of the major plugins. I have used all of them to make said mod in the creation kit even though Hearthfire and Dawnguard don\\'t actually have anything in them. It\\'s more down as future proofing in case I have missed something. Reason I did this is that I could never be bothered to use the \\\"additem\\\" command several dozen times to get all the items I needed to disenchant.\r\n\r\nI have added items based on the following priority:\r\n1) Which provides the highest enchanting strength? \r\n2) Which is worth the most gold?\r\n\r\nAll of these items are mostly Daedric or Dragonscale (the odd Stalhrim item for the Warhammer of Ultimate Chaos) and as a result the contents of this box weigh about 1000 units. Luckily though I have placed it next to the enchanting table so you don\\'t have far to walk! It even includes some of the obscure items like the Unique Gloves of the Pugilist for Fortify Unarmed, a Shield of Solitude for the second Resist Magic enchantment and things like a lunar weapon for Moonlight Damage.\r\n\r\nCredit is provided to the Unofficial Elder Scrolls Page (uesp.net) and whomever wrote the \\\"Generic Magical Apparel/Weapons\\\" pages for the main game and Dragonborn plugin.\r\n\r\nI\\'ve done some basic testing of it, I don\\'t think it causes any major pathfinding issues as its somewhat attached to the wall out of the way though I may be wrong. If it breaks anything for anyone\\'s saves, oh dear, I apologise. Also if I have missed something out let me know. This is my first shot at modding so let\\'s see how it goes!",
  "categoryId": "40",
  "version": "1.1",
  "author": "Calgor",
  "createdUnix": "1380658172",
  "updatedUnix": "1387931272",
  "containsAdultContent": false,
  "uploadedBy": "Calgor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000060381",
      "name": "Enchanted Items Cheat Chest",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Enchanted Items Cheat Chest-43337-1-0.zip",
      "uploadedUnix": "1380657957",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ca2772481a39b52c900bdda838da6c203fa664c6845454ad4b8aa0ce965e2eba/analysis/1407741810/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanted%20Items%20Cheat%20Chest-43337-1-0.zip?fid=1000060381&ttl=1535824159&ri=8192&rs=8192&setec=23de647e5ee69b47eda96db1df1d82ca"
    },
    {
      "fileId": "1000088269",
      "name": "Updated Version",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Updated-43337-1-1.zip",
      "uploadedUnix": "1387931272",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c7146cd90efeea6dad6cfe44601e6e9c33019c367d28a00efa0be84e16be4f2b/analysis/1407858006/",
      "changelogHtml": " Adds an unused Briarheart Geis weapon (Foresworn axe) with enchantment of the same name. <br/> \n Includes a Daedric Warhammer of Radiance with the same Sun Damage enchantment granted on Auriels Bow (Doing 10 to normal creatures and a further 20 to undead.) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Updated-43337-1-1.zip?fid=1000088269&ttl=1535824159&ri=8192&rs=8192&setec=84e29f690ae6ea901234fdf5f88b0eb8"
    }
  ]
}