{
  "modId": 43393.0,
  "modName": "SEM Skyrim Encumbrance Mod",
  "summary": "A mod designed to change the vanilla encumbrance system, to a system with beneficial effects and penalties.",
  "descriptionHtml": "[heading][center][size=40]SEM[/size][/center][/heading]\r\n[Heading][center][size=32]Skyrim Encumbrance Mod[/size][/center][/heading]\r\n[Center][size=5][b]Latest update required[/b][/size][/Center]\r\nThis mod is designed to change the vanilla encumbrance system, to a system with beneficial effects and penalties.\r\nI\\'ve designed the mod to give bonuses while under light encumbrance and penalties while under moderate to heavy encumbrance.\r\n\r\nFor example, if you have between 0% and 14% encumbrance, you will move much faster and have an edge while sneaking. While, if you have over 125% encumbrace, you will get crushed under the weight of your bags, rendering you unable to move as you fall to your knees.\r\n\r\nFor further information about the bonuses and penalties, please read the FAQ or READ-ME.\r\n\r\n[Heading]The Future Of The Mod[/heading]\r\nIn the future, I would like to add more features to the mod. Especially when it comes to balance. I have been thinking about adding a attack speed penalty as well, while adding a damage bonus, to resemble the extra weight coming trough your slashes, punches or how ever else you like to massacre the inhabitants of Skyrim.\r\n\r\nIf you have any suggestions regarding the current balance and possible future features feel free to let me know in the comments.\r\n\r\nI am also thinking about adding compatibility with [url=http://skyrim.nexusmods.com/mods/26228/?{url}]Realistic Needs and Diseases[/url]. This could be things such as increasing the tiredness and thirst rating when you are encumbered.\r\n\r\n[Center][b][size=3]What I am working on right now[/size][/b][/center]\r\n[Center]1) Config Menu for people without SKSE - 90% Complete - Finishing and testing[/center]\r\n[center]2) MCM menu - 10% Complete - Started and being worked on[/center]\r\n\r\n[Heading]Compatibility[/heading]\r\nAs far as I know this mod shouldn\\'t be incompatible with any DLC or mod out there, as every thing edited or scripted is fixated on the player and is unique to this mod.\r\n\r\nOf course, if you have a mod with other effects tied to encumbrance or a mod which edits speed mult directly, you could have your speedmult or sneak reach ridiculous values. If any such thing happens, please, let me know via comments with a description of what is going on, the mod in question and so on.\r\n\r\n[heading]Installation With NMM[/heading]\r\n1. Download mod with NMM.\r\n2. Install and make sure SkyEncMod.esp is checked in the plugin list!\r\n3. Play!\r\nIt [b]IS[/b] that easy!\r\n\r\n[heading]Manual Installation[/heading]\r\n1) Download manually\r\n2) Extract the contents of the ZIP folder into your Data folder\r\n3) Make sure the SkyEncMod.esp is checked in the launcher of your choice.\r\n4) Play!\r\n\r\n[heading]Uninstallation[/heading]\r\nAlthough, it is [size=3][b]not recommended to remove a mod from a save game[/b][/size], I have tried my best to shut it down as cleanly as possible, removing what I can.\r\n\r\n1) Go into the console and type in \\\"help aaEncModQuest\\\". This will give you the formid, XX000D62, where the X\\'s is replaced with numbers and/or letters.\r\n2) Type in \\\"SetStage XX000D62 100\\\" (Replacing the X\\'s with the numbers and/or letters received in step 1)\r\n3) Wait for the on screen instructions to tell you you\\'re done.\r\n4) Save your game and exit Skyrim\r\n5) Uninstall either manually or with the launcher of your choice\r\n\r\nThat\\'s the best I can do, but once again, it is [size=3][b]not recommended to remove a mod from a save game[/B][/size], no matter the mod in question.\r\n\r\n[heading]FAQ[/heading]\r\nQ: Where can I go if I want to make a suggestion, found a bug, or otherwise want to share something regarding your mod with you?\r\nA: You can write a comment and make sure you either mention suggestion, bug, etc in your post or you can start it off with [SUGGESTION], [BUG], etc so I can easily search for it. \r\nI\\'m especially open for suggestions regarding the different stages of encumbrance.\r\nIf you are having incompatibility issues, [b]please[/b] give me [b]a short description[/b] and the [b]name of the mod[/b]. Thank you\r\n\r\nQ: What penalties does your mod have?\r\nA: It got several penalties. They are as follows:\r\n1) Enc between 50% and 64% is a 8 movement speed penalty and a sneak penalty of 10%\r\n2) Enc between 65% and 79% is a 16 movement speed penalty and a sneak penalty of 20%\r\n3) Enc between 80% and 89%  is a 25 movement speed penalty and a sneak penalty of 30%\r\n4) Enc between 90% and 99% is a 35 movement speed penalty and a sneak penalty of 40%\r\n5) Enc between 100% and 109% is a 70 movement speed penalty (Standard over-encumbered penalty) and a sneak penalty of 80%\r\n6) Enc between 110% and 124%  is a 85 movement speed penalty and a sneak penalty of 99%\r\n7) Enc over 125% = You will start to stumble and lose health in addition to a 99,99 movement speed penalty and a sneak penalty of 99%\r\n\r\nQ: What bonuses does your mod have?\r\nA: Currently it has 2 bonuses. They are as follows:\r\n1) Enc between 0%-14% gives a 25 movement speed buff along with making you 20% harder to detect.\r\n2) Enc between 15%-24% gives you a 10 movement speed buff along with making you 5% harder to detect.\r\n\r\n[heading]Changelog[/heading]\r\n[03-10-2013] - Initial Release\r\n\r\n[heading]Credits[/heading]\r\nThanks to Bethesda for creating Skyrim.\r\nThanks to InsanitySorrow for his ReadMe Generator.\r\nThanks to egocarib from the Bethesda Forums, who helped me with a spell problem.\r\n\r\n[heading]Licensing & Legal[/heading]\r\nYou must contact me and obtain my permission before altering and/or re-packaging any part of this mod.\r\n\r\nIf I do not respond within 4 weeks, feel free to do whatever you like with this mod, as long as I am credited as the original author.\r\n\r\nIf I am offline for six months or longer and do not respond to any attempts made at contacting me, then you are free to upload \r\n\r\nthis project to another site(s) as long as I am credited as the original author.",
  "categoryId": "24",
  "version": "0.5.2",
  "author": "Track1044",
  "createdUnix": "1380760348",
  "updatedUnix": "1380825217",
  "containsAdultContent": false,
  "uploadedBy": "track1044",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000061153",
      "name": "SEM Skyrim Encumbrance Mod",
      "version": "0.5.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "SEM Skyrim Encumbrance Mod-43393-0-5-2.rar",
      "uploadedUnix": "1380825217",
      "modVersion": "0.5.2",
      "virusScanUrl": "https://www.virustotal.com/file/a53b79ff1a7d1f55e72658ea4b0aaa6801c84f7015699b76e03f88251dd17cb1/analysis/1407744143/",
      "changelogHtml": " Properly packaged the mod (Brain fart) <br/> \n Changed a few other non-important stuff. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SEM%20Skyrim%20Encumbrance%20Mod-43393-0-5-2.rar?fid=1000061153&ttl=1535824202&ri=8192&rs=8192&setec=4d3609a7fc4901e7812e91b12ffc4ca2"
    }
  ]
}