{
  "modId": 43440.0,
  "modName": "Consistent Stars - Climates of Tamriel Patch",
  "summary": "Fixes several inconsistent stars for weathers provided by Climates of Tamriel.",
  "descriptionHtml": "Project Reality Climates of Tamriel is a massive weather overhaul and one of the greatest on the nexus.  However, after playing for a little while I discovered that occasionally at night all of my stars would change colors as well as my galaxy.  I knew this wasn&#39;t an intentional feature of Climates of Tamriel because after all it&#39;s called &#34;Project Reality&#34; and in reality stars and galaxies wont change colors over night.  After further investigation, JJC71 (author of Climates of Tamriel) confirmed that this was not intentional.\r<br />\r<br />[size=5]What This Mod Does[/size]\r<br />\r<br />This patch fixes ALL inconsistent star colors in weathers provided by Climates of Tamriel.  There were approximately 53 weathers at night with incorrect star values resulting in discolored stars and galaxies.  This issue looks much worse when using ENBs and other post-processing features like SMAA.  I went through each and every one of Climates of Tamriel&#39;s weathers (506+) and fixed all 53 weathers.  Experience Climates of Tamriel with breathtaking night skies&#33;  If you appreciate the night skies in Skyrim as much as I do then I know this patch is essential for you.  Enjoy and please don&#39;t forget to ENDORSE this patch as well as Climates of Tamriel.\r<br />\r<br />[size=5]Required Mod:[/size]\r<br />\r<br />Climates of Tamriel (by JJC71) - One of the best weather overhauls.\r<br />http://skyrim.nexusmods.com/mods/17802/?\r<br />\r<br />[size=4]Recommended Mods:[/size]\r<br />\r<br />Enhanced Night Skyrim (by CptJoker) - Awesome stars textures (I recommend high density).\r<br />http://skyrim.nexusmods.com/mods/85/?\r<br />\r<br />HQ Milky way galaxy (by Manesse) - Great galaxy texture.\r<br />http://skyrim.nexusmods.com/mods/810/?\r<br />\r<br />Lorkhans Vision Moons (by Doubloonz) - Best moon textures I&#39;ve come across.\r<br />http://skyrim.nexusmods.com/mods/40785//?\r<br />\r<br />[size=3]Load Order:[/size]\r<br />\r<br />You must load &#34;Consistent Stars - CoT.esp&#34; AFTER all official Climates of Tamriel plugins.\r<br />Load BEFORE any other mods that alter Climates of Tamriel weathers (doing so may cause you to lose some star fixes, but not all of them). \r<br />\r<br />[size=3]Compatibility:[/size]\r<br />\r<br />This patch might conflict with any other mods that alter the Climates of Tamriel weathers.  \r<br />I wont be making any mod compatibility patches so please do not ask.  \r<br />It&#39;s best to load this mod BEFORE any other mods that may conflict.\r<br />\r<br />[b]I&#39;d like to thank the following people...[/b]\r<br />\r<br />[i]JJC71 - He has given me permission to patch his awesome Climates of Tamriel mod.\r<br />ElminsterAU - His tool TES5Edit made it possible for me to edit and create this patch.\r<br />Prod80 - He pointed me towards TES5Edit and gave me a spark of motivation to finish this patch.[/i]",
  "categoryId": "62",
  "version": "1.0",
  "author": "TwoHungLow",
  "createdUnix": "1380778176",
  "updatedUnix": "1380778170",
  "containsAdultContent": false,
  "uploadedBy": "TwoHungLow",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000060956",
      "name": "Consistent Stars - CoT",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "140",
      "fileName": "Consistent Stars - CoT-43440-1-0.7z",
      "uploadedUnix": "1380778170",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7a938ac3133b004f133134aadd2bb3b04d10f3e0fa06cc93196ef1c036617600/analysis/1407743413/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Consistent%20Stars%20-%20CoT-43440-1-0.7z?fid=1000060956&ttl=1535824238&ri=8192&rs=8192&setec=450c810d2601e3cf4640e37a020df657"
    }
  ]
}