{
  "modId": 4344.0,
  "modName": "AllArmorsPlayable",
  "summary": "Makes all armours playable by the character that were previously unplayable.",
  "descriptionHtml": "Update: Skins can\\'t be imported. They are obviously only made for animals. It\\'s better to wait for a mod that makes completely new fur skins to cover your body with. Or a mesh wizard might try to put them on the players skin.\r\n\r\nUpdate2: There is now a .bat files inside the mod, that gives you all armor possible to wear...make sure you\\'re somewhere to drop all the stuff, or you will have a long way home.\r\n\r\nUse the .bat file with console and enter: [b]bat armors[/b]. I\\'ve made some new screens with some very weird finds. I also found out where all that sudden nude male mods came from. I excluded the naked skin, so I don\\'t have to set this file on adult only.\r\n\r\nThis Mod makes it possbile to play any armour you can get in your hands, including the Greybeards clothes/armour, the armour of the companion leader and thoose of the Imperial and Stormcloakes leader.\r\n\r\nThis mod is sure going to have some bugs, since I can\\'t have a look at all the new armors, please let me know if some weird bugs, like armours not showing on body, occurs.\r\n\r\nInstallation&usage:\r\n\r\n1. Copy all files to Skyrim folder (not Data folder) and override \r\n2. In game open console and type: [b]bat armors[/b]\r\n\r\nHow to?:\r\n\r\n- Sure you shouldn\\'t use the Nocturnal Cloth on male characters, or some weird occurings might happen, specially with nude mods enabled.\r\n- In order to make the decapitated person work, you have to use the decapitated head and then put on the decapitated skin\r\n- In order to make your character headless, just use the decpaitated skin\r\n- In order to make Greybeards headless, use the decapitated skin\r\n\r\nIt\\'s generally a good idea to fiddle around with the different settings...you might find even more weird combinations then I did.",
  "categoryId": "54",
  "version": "0.2",
  "author": "DragonBoon",
  "createdUnix": "1324569407",
  "updatedUnix": "1324637525",
  "containsAdultContent": false,
  "uploadedBy": "DragonBoon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "13194",
      "name": "AllArmorsPlayable02",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "AllArmorsPlayable02-4344-0-2.7z",
      "uploadedUnix": "1324637525",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/ce4e3be2ab078c55e6c768b3afcc384495c933e88889c42ed9d6876d50bf311b/analysis/1406550722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AllArmorsPlayable02-4344-0-2.7z?fid=13194&ttl=1535760047&ri=8192&rs=8192&setec=7188a9c9e8f02701f2d0139bff25e24b"
    }
  ]
}