{
  "modId": 43485.0,
  "modName": "Als Barebones Barrow - Unfairly Difficult Dungeon",
  "summary": "A challenging dungeon that starts with all your gear removed... and that&#39;s just the beginning&#33; Hard enemies and harder puzzles.",
  "descriptionHtml": "[b]ALS BAREBONES BARROW - UNFAIRLY DIFFICULT DUNGEON - [i]Requires Dawnguard and Dragonborn DLCs[/i][/b]\r<br />\r<br />Do you look fondly back on the punishing Nintendo games and old school RPGs of yesteryear? Do you download every difficulty mod you can get your hands on? Do you have a masochistic personality?\r<br />\r<br />If you answered yes to any of these questions, then you may like my Barebones Barrow&#33; This was created with the specific intention of being incredibly challenging. Challenges include:\r<br />\r<br />1. No less than 12 extremely powerful Draugr guarding the entrance to the barrow.\r<br />\r<br />2. An entire dungeon (two cells, each medium-sized) filled with challenging enemies at the beginning of which all your gear is removed&#33;\r<br />\r<br />3. Fiendishly frustrating puzzles that are not only challenging to figure out, but also challenging to enact the solution once you do figure it out.\r<br />\r<br />4. A final arch-boss whose evil aura drains you of 75 health per second till you&#39;re dead or he is.\r<br />\r<br />You can find the entrance to the barrow just outside of Bleak Falls Barrow. It&#39;s a small door leading to &#34;Hokoron&#39;s Shrine&#34;. Once you defeat the Shrinelords guarding the entrance, you may enter the barrow, leading to Hokoron&#39;s Oubliette in which your gear is removed. Once this happens, there is no way out of the dungeon until you defeat it; so be very sure before you enter. Some very basic gear and crafting stations are provided in a small safe area at the beginning.\r<br />\r<br />[i][u]BASIC GEAR[/u][/i]\r<br />[b]Armor Sets including Shields[/b]\r<br />--Iron (heavy)\r<br />--Hide (light)\r<br />--Novice Robes\r<br />[b]Weapons[/b]\r<br />--Two (2) One-handed weapons (Iron quality)\r<br />--One (1) Two-handed weapons (Iron quality)\r<br />--One (1) Hunting Bow and some Iron Arrows\r<br />[b]Crafting Gear[/b]\r<br />--Some filled petty soul gems\r<br />--Some iron ingots\r<br />--Some leather strips\r<br />--Some alchemical ingredients with which to make 5 Restore Health, Magicka, and Stamina potions each\r<br />[b]Miscellaneous[/b]\r<br />--Some lockpicks\r<br />\r<br />Choose your loadout well, because this is all you get for the entire dungeon. Enemies will NOT drop weapons or armor, and the only treasure during the dungeon crawl are things like gold and gems. You WILL get your full inventory back at the end of the dungeon. At the end of the dungeon, after the final arch-boss, you will also find fantastic amounts of treasure and loot.\r<br />\r<br />I have played and replayed this over and over in testing. The puzzles work. Sometimes it may seem like something is not working, but trust me, it IS working - just not the way you expect it to. ;)\r<br />\r<br />I cannot stress this enough: you need a high level character, with well chosen Black Book and Doomstone perks, every last spell you can muster, and potentially maxed out skills with powerful perks.\r<br />\r<br />[b]PLEASE NOTE:[/b] Because of a script limitation inherent in Skyrim, you will NOT be stripped of any Quest items you possess at the beginning of the dungeon. In this manner, it is possible to enter the dungeon possessed of some extremely powerful items. If you beat this dungeon using some powerful Quest items, then you have not truly beaten this mod. If you have a powerful Quest item, step up to the challenge and REFUSE to use it for the duration of the dungeon, till you get your gear back. That is the spirit in which this dungeon is intended.\r<br />\r<br />PLEASE DO NOT SPOIL THE PUZZLE SOLUTIONS IN THE COMMENTS. If you are completely stuck, feel free to PM me. Thanks. :)\r<br />\r<br />[b]FAQ[/b]\r<br />\r<br />[i]Q: The dragon claw door isn&#39;t working&#33;[/i]\r<br />A: Trust me, it&#39;s working exactly the way it&#39;s supposed to.\r<br />\r<br />[i]Q: There&#39;s no way to open the portcullis&#33;[/i]\r<br />A: Oh yes, there is, but it&#39;s entirely possible that you&#39;ll never find it.\r<br />\r<br />[i]Q: None of my attacks or spells are affecting the final arch-boss&#33;[/i]\r<br />A: Hmm, fancy that. ;)\r<br />\r<br />[i]Q: This dungeon is too freakin&#39; hard&#33; /ragequit[/i]\r<br />A: The words &#34;Unfairly Difficult&#34; appear in the mod&#39;s title, so you have only yourself to blame.\r<br />\r<br />[i]Q: Have YOU beaten this dungeon?[/i]\r<br />A: I did a playthrough with no mods or cheats, and successfully made it a quarter of the way through, using a rather effective combination of abilities I discovered. At that point, I took a break from Skyrim, and now that I have come back to it to finish and upload this mod, I have not taken the opportunity to go the rest of the way.\r<br />\r<br />Also, I could be extra mean, and insert a method to render that &#34;effective combination&#34; I mentioned completely ineffective... but I won&#39;t. Unless someone requests I upload a version with said meanness. xD\r<br />\r<br />[i]Q: I beat this&#33; Wooooot&#33;[/i]\r<br />A: Without using cheats or Quest items, or looking inside the Creation Kit to find the puzzle answers?\r<br />\r<br />[i]Q: Yup&#33; :D[/i]\r<br />A: Congratulations&#33; Be sure to comment telling me of your success, and maybe share a few tips with how you dealt with the enemies for the benefit of your fellow Dovahkiin&#33;\r<br />\r<br />-----\r<br />\r<br />[b][u]OTHER MODS BY ME[/u]:[/b]\r<br />\r<br />Al&#39;s Completionist Series:\r<br />    1. [url=http://skyrim.nexusmods.com/downloads/file.php?id=9994]Al&#39;s TREASURE VAULT[/url] -- [i]Now you have a place to store all your gold and have it display as treasure&#33;[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/30633]Als Paragon Reward Chest[/url] -- [i]little mod rewarding the completionist player who collects all 5 Paragons[/i]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/30643]Als Konahrik[/url] -- [i]little mod rewarding the completionist player who collects all vanilla dragon priest masks with a previously missing boss fight[/i]\r<br />    4. [url=http://skyrim.nexusmods.com/mods/30765]Als Treasure Map Reward[/url] -- [i]little mod rewarding the completionist player who collects all 11 Treasure Maps in vanilla Skyrim[/i]\r<br />    5. [url=http://skyrim.nexusmods.com/mods/30915]Als Vault of the Old Slayer -- Requires All 10 Dragon Claws[/url] -- [i]modestly sized dungeon rewarding the completionist player who collects all Dragon Claws in vanilla Skyrim with fantastic amounts of treasure[/i]\r<br />\r<br />Al&#39;s Powers and Abilities:\r<br />    1. [url=http://skyrim.nexusmods.com/mods/12859]Al&#39;s Thunder Smite[/url] -- [i]Insta-Kill Enemies, and ONLY Enemies[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/24486[/url]Al&#39;s Eclipse Bloodcurse[/url] -- [i]Tired of shooting arrows at the sun? Now you can get a true eclipse (including removed sun damage) as a power[/i]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/35123]Als Shadow Walk - Automatic Invisibility While Sneaking[/url]\r<br />    4. [url=http://skyrim.nexusmods.com/mods/35045]Als Shout Like a Dragon - Dragonlike Cooldowns[/url] -- [i]Now you can shout as often as dragons can&#33;[/i]\r<br />\r<br />Al&#39;s Conveniences:\r<br />    1. [url=http://skyrim.nexusmods.com/mods/25824]Al&#39;s Elsweyr Rift[/url] -- [i]Teleport to and from a one stop shop for selling loot and crafting items from anywhere&#33;[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/7728]Al&#39;s &#34;Nothing Sells for Zero Gold&#34; Tweak[/url] -- [i]I bet you&#39;re tired of picking up loot that sells for nothing. So am I[/i]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/35234]Als Thuum of the Magesmith[/url] -- [i]Keep the benefits of your enchanted and smithed items even when you switch outfits for a different look&#33;[/i]\r<br />    4. [url=http://skyrim.nexusmods.com/downloads/file.php?id=13355]Al&#39;s -Get 80 Perk Points and All Skills 100- Cheat Ring[/url]\r<br />\r<br />Al&#39;s Dungeons:\r<br />    1. [url=http://skyrim.nexusmods.com/downloads/file.php?id=13121]Al&#39;s Dead Dragon Giant Camp[/url] -- [i]Just as dragon lairs and giant camps are quick and easy (relatively) stops for a rich haul, so is this&#33;[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/30915]Als Vault of the Old Slayer -- Requires All 10 Dragon Claws[/url]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/35295]Als Revakzoor - Lair of Mythic Dragons - Unfairly Difficult Mod[/url] -- [i]A lair laden with treasure, and guarded by six lethal dragons.[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/19697]Al&#39;s Three Stone Watch[/url] -- [i]Lore friendly, non-cheaty, humble starter home[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7444]Al&#39;s Starry Armor and Clothing Retextures[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7648]Al&#39;s Virility - Nude Male - PC Only (Adult Content; NSFW)[/url]",
  "categoryId": "88",
  "version": "1.0",
  "author": "AlCiao",
  "createdUnix": "1380833734",
  "updatedUnix": "1380833607",
  "containsAdultContent": false,
  "uploadedBy": "AlCiao",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000061197",
      "name": "Als Barebones Barrow - Unfairly Difficult Dungeon",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "84",
      "fileName": "Als Barebones Barrow - Unfairly Difficult Dungeon-43485-1-0.7z",
      "uploadedUnix": "1380833607",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/acf95989a3353aa444f8be2d01006c94fe7f1838f18aaa969ae78b439ff8e3f3/analysis/1407744302/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Als%20Barebones%20Barrow%20-%20Unfairly%20Difficult%20Dungeon-43485-1-0.7z?fid=1000061197&ttl=1535824270&ri=8192&rs=8192&setec=9ffe01dedd548db14921e294bc7dee36"
    }
  ]
}