{
  "modId": 43545.0,
  "modName": "Morrowind Music Integration",
  "summary": "Integrates the music from Morrowind into Skyrim&#33;",
  "descriptionHtml": "Morrowind Music Integration aims to make the Morrowind music added by the Dragonborn DLC play alongside the original Skyrim soundtrack while you explore Skyrim.  No more fooling around with audio conversions and Skyrim directories now you can just download and install using NMM.\r<br />\r<br />Installation\r<br />download with Nexus Mod Manager then activate\r<br />Manual: Download and drag the MMI.esp into you data folder then tick the esp in the launcher\r<br />\r<br />Requirements\r<br />Latest Skyrim update\r<br />Dragonborn DLC\r<br />\r<br />Notes\r<br />this file does not break copyright laws it simply takes the Morrowind tracks added by Dragonborn that play while you&#39;re in Solstheim and makes them play while you explore Skyrim&#33; so no more dragging and converting files from your Morrowind game to your Skyrim. Please endorse if you enjoy this mod :)\r<br />\r<br />*UPDATE* Hello everybody, i&#39;m really happy to see how well my mod has been doing since i first created it years ago and i just wanted to apologize to you all for neglecting you. I have a really bad habit of creating mods putting them on the Nexus and then completely forgetting about them. It was only a few weeks ago i remembered i even created this mod in the first place. I will try to be better about this in the future and I&#39;ve read your posts and heard your comments, concerns, and recommendations. With that being said i will try to cater to each and every one of you and release updates to this mod that suits everybody&#39;s personal taste. I&#39;ll also look into creating compatibility patches for all the popular music and sound overhauls. So again i apologize and thank you all for your support and endorsements.\r<br />\r<br />*UPDATE 2* I have converted this mod over to Skyrim SE, So if you enjoyed this mod please also check it out on Skyrim SE at http://www.nexusmods.com/skyrimspecialedition/mods/1457/? Thank you again for all support.",
  "categoryId": "61",
  "version": "1.0",
  "author": "Miulky",
  "createdUnix": "1380900675",
  "updatedUnix": "1397612854",
  "containsAdultContent": false,
  "uploadedBy": "miulky",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105138",
      "name": "MMI",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "MMI-43545-1-0.rar",
      "uploadedUnix": "1397612854",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1023f6776fbe494154aba2c6c8c4d928b37a4d218ce9b16185bb22a5fdd11978/analysis/1408023238/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MMI-43545-1-0.rar?fid=1000105138&ttl=1535824315&ri=8192&rs=8192&setec=c2a9cd3655b3d451ac5b6c9b4d147341"
    }
  ]
}