{
  "modId": 4374.0,
  "modName": "Better Magic",
  "summary": "A series of minimalistic modifications to the magic system in order to better balance it and make magic more fun to use.\r<br />\r<br />Now includes multi-lingual support and NMM installation&#33;",
  "descriptionHtml": "[font=verdana][center][img]http://img.photobucket.com/albums/v464/sushisquid/bettermagic.png[/img][/center]\r<br />The Better Magic series is a group of magic changes that was built simplistically in order to make it compatible with as many mods as possible. In working on this, I&#39;ve had two main goals: improve the balance of magic (compared to similar effects and costs), and make magic feel more fun to use.\r<br />\r<br />Also available from the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=18895]Steam Workshop[/url].\r<br />\r<br />Better Magic is now available in five languages.\r<br />[color=#F0A033]French translation provided by [url=http://skyrim.nexusmods.com/users/2895815]artabanus4[/url].[/color]\r<br />[color=#F0A033]Dutch translation provided by rikvanoostende.[/color]\r<br />[color=#F0A033]Russian translation provided by [url=http://skyrim.nexusmods.com/users/400901]Nihility[/url].[/color]\r<br />[color=#F0A033]German translation provided by [url=http://skyrim.nexusmods.com/users/5124102]Skibble[/url].[/color]\r<br />\r<br />\r<br />[img]http://img.photobucket.com/albums/v464/sushisquid/spellmastery.png[/img]\r<br />In the base game, you can swing a sword for no cost and still do more damage than casting destruction spells, all of which cost magicka to use. That really isn&#39;t fair to destruction. In other schools, things also didn&#39;t seem to last long enough or have enough power.\r<br />\r<br />[list][*]Each mastery perk (novice, apprentice, adept, expert, master) within all five spell schools now has a secondary effect that improves all spells in that school. For alteration, conjuration, and illusion, each perk increases the duration of spells in that school by 15%. For destruction and restoration, each perk increases the magnitude of spells in that school by 15%.\r<br />[size=1]These are multiplicative bonuses: taking all five perks results in (1.15^5), which is about x2.01 to either duration or magnitude. The value 15% was chosen for this reason. Weapon skills can spend five perks to get doubled damage, and now spell schools can also spend five perks for approximately doubled effect.[/size][/list]\r<br />[list][*]The Augmented Element perks now only add 15% damage per rank (down from 25%). To maintain their utility, they also add 15% resistance to that element with each rank.\r<br />[size=1]While the changes to mastery perks were required for most spell schools, bonuses were stacking too high on Destruction. This helps to mitigate that for fairness while still making the augmented element perks very attractive options.[/size][/list]\r<br />[list][*]I&#39;ve also stopped Augment Element perks from affecting weapon enchantments.\r<br />[size=1]This was stupid. Combat doesn&#39;t need to be any stronger.[/size][/list]\r<br />[list][*]Cloak spells had their base range dropped to 8 feet (from 10), but they now grow in both size and damage with mastery and augmented element perks.\r<br />[size=1]I wanted to make these more useful, so they can now get pretty huge. Base range was dropped to match base damage so that they can correctly list their range/damage in description as it changes.[/size][/list]\r<br />[list][*]Paralyze and Mass Paralysis have reduced durations, from 10 and 15 to 7 and 10.\r<br />[size=1]The changes to duration from mastery perks were meant to make Alteration&#39;s utility spells less annoying, not to make these spells overpowered. With the perks, they still last longer than in the base game, but I&#39;ve limited their abuse somewhat. These will be cheaper to cast due to the lowered base duration, so dual cast them if you need them to be longer.[/size][/list]\r<br />[list][*]Dual casting was unlocked for Mass Paralysis.\r<br />[size=1]If you need to have a ridiculous duration on this, you still can.[/size][/list]\r<br />[list][*]Aspect of Terror no longer incorrectly increases the damage of fire spells.\r<br />[size=1]This bugfix has been folded into the Better Spell Mastery group.[/size][/list]\r<br />[list][*]Necromage no longer increases the power of spells you cast on your vampire character.\r<br />[size=1]Admit it, this was silly. Many players liked abusing this, but I&#39;m sure it was never intentional, so I consider this a bugfix.[/size][/list]\r<br />[list][*]Rune spells now benefit from Augmented Element perks.\r<br />[size=1]Just another bugfix.[/size][/list]\r<br />[list][*]Chain Lightning, Fireball, and Ice Storm hit methods were improved.\r<br />[size=1]I wanted to differentiate these from each other and make them more useful. Chain Lightning more reliably arcs in groups and only hits hostiles. Fireball&#39;s explosion now hits everything in the area ignoring obstacles. Ice Storm can be fired straight through obstacles.[/size][/list]\r<br />\r<br />\r<br />[img]http://img.photobucket.com/albums/v464/sushisquid/magearmor.png[/img]\r<br />Each skill category has a defensive skill. Combat has heavy armor, stealth has light armor, and magic has alteration. However, alteration is noticeably less useful for defense, leading most to the understandable conclusion that it&#39;s always best to just wear armor. A pure mage should not feel forced to wear armor&#33;\r<br />\r<br />[list][*]Mage Armor now multiplies the duration of all armor spells in addition to multiplying their magnitude. You need to be wearing no light or heavy armor at the time of casting the spell to see this benefit.\r<br />[size=1]This was done to help mitigate the annoyance of spending time and magicka on these spells. By comparison, armor is free to maintain constantly.[/size][/list]\r<br />[list][*]Each rank of Mage Armor provides a passive +50 armor (6% damage mitigation), up to +150 at rank 3. This disappears immediately if you wear any piece of light or heavy armor.\r<br />[size=1]This helps improve the defense of alteration, plus it&#39;s a big help if you get surprised by combat and don&#39;t have an armor spell active.[/size][/list]\r<br />[list][*]Dragonhide is now a normal armor spell. It provides +150 armor for 60 seconds.\r<br />[size=1]With all three ranks of Mage Armor, you&#39;ll have a passive 150 and Dragonhide will provide another 450. That totals 600 armor (72% mitigation), which is extremely close to the damage cap. Compared to the base game, you&#39;ll have 8% less damage mitigation, but the spell will last six times longer. Additionally, the spell cost is about half of what it was in the base game now that it&#39;s automatically calculated. I think this is more than a fair trade. This stops Mage Armor from going obsolete when you get this spell, but it also helps mitigate the long casting time by giving you a much longer duration.[/size][/list]\r<br />\r<br />\r<br />[img]http://img.photobucket.com/albums/v464/sushisquid/dualcasting.png[/img]\r<br />[list][*]Dual casting no longer reduces efficiency. It is now x2.5 cost for x2.5 magntitude/duration.\r<br />[size=1]Because this is meant to be used with Better Spell Mastery, I don&#39;t think dual casting needs to be very much stronger. Really, I just want it to stop costing more for the same effect, which this does. It&#39;s a simple change, but I think it&#39;s the most fitting.[/size][/list]\r<br />[list][*]Impact&#39;s stagger now happens 1/3 of the time.\r<br />[size=1]This perk was seriously overpowered, but with stronger spells and stronger dual casting, you shouldn&#39;t need to stun lock things anymore. A 33% chance on this is still really useful, but it&#39;s no longer the ridiculous power it once was. I originally chose 50% so that it would match Power Shot, but you can cast spells much faster than you can shoot arrows and Impact&#39;s stagger is stronger than Power Shot (Power Shot is comparable to FUS while Impact is comparable to FUS RO). [b]Note:[/b] the perk&#39;s description has not been changed.[/size][/list]\r<br />\r<br />\r<br />[img]http://img.photobucket.com/albums/v464/sushisquid/spellfinishers.png[/img]\r<br />The spell finisher perks Intense Flames, Deep Freeze, and Disintegrate are certainly cool, but they really aren&#39;t very useful because they only trigger on enemies who are nearly dead anyway. I&#39;ve changed them to instead be something like a critical effect chance. Rather than happening to everything you kill, they&#39;re now rarer effects that can change the course of combat. After further testing, this has been updated with what I feel are fairer values. I&#39;m now very happy with how these feel in-game.\r<br />\r<br />[list][*]Intense Flames and Deep Freeze: Rather than a guaranteed effect when the target is under 20% health, it&#39;s now a 20% chance to trigger once the target is under 50% health.\r<br />[size=1]Now you&#39;ve got a small chance to apply these effects to things while they would still matter&#33; These effects still won&#39;t work on anything that&#39;s normally immune to fear/paralysis.[/size][/list]\r<br />[list][*]Disintegrate: Rather than guaranteed disintegration when the target is under 15% health, it&#39;s now a 15% chance to trigger once target is under 50% health.\r<br />[size=1]Shock spells will no longer always turn things to dust (which is good if you&#39;re a necromancer). They now will have a small chance to perform critical finishers that instantly kill at higher health than normal. As always, some targets cannot be disintegrated.[/size][/list]\r<br />[list][*]Because their constant stream triggers the chance repeatedly, the novice destruction spells (Flames, Frostbite, and Sparks), cloak spells, and the wall spells can no longer perform these finisher effects.\r<br />[size=1]It was simply unfair to allow this on these spells. Speaking of which...[/size][/list]\r<br />[list][*]Blizzard and Fire Storm always trigger these effects, rather than just having a 20% chance. You still need to have the correct perk and reduce the target to under 50% health. Lightning Storm&#39;s chance to disintegrate is 40%, but this is triggered rapidly due to the constant stream. As a bugfix, Lightning Storm also no longer disintegrates without the perk, and will also no longer disintegrate things normally immune, like dragons.\r<br />[size=1]I intentionally did this for the master spells to encourage their use. For Fire Storm and Lightning Storm, targets must be reduced to under 50% health by the spell to trigger the effect as normal. For Blizzard, targets must be under 50% health at the time the spell is cast around them.[/size][/list]\r<br />\r<br />\r<br />[img]http://img.photobucket.com/albums/v464/sushisquid/masterspells.png[/img]\r<br />I&#39;ve heard many players complain about how underwhelming the master destruction spells are. I wanted to help make these spells feel truly mighty, but I knew I needed to be careful with game balance. My objective was to make master destruction spells worth using, not to make them the only things worth using. Illusion has also been improved, and I threw in a boost to Dead Thrall too because that level 40 cap on it was really damn annoying.\r<br />\r<br />[list][*]The master destruction spells can now be dual cast if you hold both hand buttons and happen to possess a huge magicka pool.\r<br />[size=1]When dual cast, they are supposed to benefit from Impact, but only Lightning Storm actually does.[/size][/list]\r<br />[list][*]Fire Storm and Blizzard had very high costs on their effects, far beyond the cost of similar effects. Their effects&#39; base costs have been lowered significantly.\r<br />[size=1]Compared to other fire and frost spells, these two were weaker in damage-per-second and damage-per-magicka than if you had instead dual cast lower level spells. Lowering their cost and allowing dual casting helps mitigate both problems. Fire Storm should be about 28% cheaper to cast. Blizzard will only be about 5% cheaper because in addition to reducing its effect cost, I also increased the duration and thus the total spell cost.[/size][/list]\r<br />[list][*]Fire Storm now ignores line of sight.\r<br />[size=1]This spell takes a lot of time and magicka to cast, and you can get interrupted by stagger effects while casting. It needs to feel useful enough to justify its cost. Additionally, I wanted to differentiate it so it wasn&#39;t just another attack spell. I&#39;ve done this by making it ignore line of sight. Enemies, cover, even walls will no longer block this massive inferno. This adds a huge amount of utility to this spell.[/size][/list]\r<br />[list][*]Blizzard&#39;s duration is increased from 10 seconds to 15 seconds.\r<br />[size=1]Like Fire Storm, this takes too much time and magicka to cast for it to be so weak. Rather than increase the damage per second, I instead made it longer so it maintains its unique feel. Unlike Fire Storm, a rather large improvement was necessary due to how truly pitiful this spell was in the base game. Now it will actually do more damage than Fire Storm if a target remains it in the whole time.[/size][/list]\r<br />[list][*]All Illusion master spells (Call to Arms, Harmony, Hysteria, Mayhem) can now be dual cast.[/list]\r<br />[list][*]Call to Arms now rallies affected targets.\r<br />[size=1]I do not know why this lacked the rally effect of similar lower-ranked spells, so I&#39;ve added it.[/size][/list]\r<br />[list][*]Dead Thrall now works on targets up to level 99. It still only affects NPCs.[/list]\r<br />\r<br />\r<br />\r<br />[color=cyan][b]Install[/b][/color]\r<br />Please install using [url=http://skyrim.nexusmods.com/mods/modmanager]Nexus Mod Manager[/url]. When installing, you [b]must[/b] select the same language that your game is in. Language mismatching will cause the game to crash.\r<br />If you use [url=http://skyrim.nexusmods.com/mods/2730]Better Sorting by headbomb[/url], check the box for compatibility. This is currently only available for the English version.\r<br />\r<br />\r<br />[color=cyan][b]Advertisements[/b][/color]\r<br />Interested in other mods that improve magic but won&#39;t conflict with this? I have some suggestions.\r<br />\r<br />I recommend tejon&#39;s [url=http://www.skyrimnexus.com/downloads/file.php?id=2585]Simple Skyrim Spell Scaling Solution[/url] to help rebalance magic even more.\r<br />[color=FF5522]Note: make sure to load your Better Magic files after tSSSSS. If you do, the two mods are fully compatible. If you don&#39;t, Better Dual Casting and Better Spell Finishers won&#39;t function correctly.[/color]\r<br />\r<br />Kachajal&#39;s [url=http://www.skyrimnexus.com/downloads/file.php?id=3352]Conjuration and Summoning fixes[/url] will stop spell absorption from eating all your summons. This is crucial to anyone who wants to use Dragonskin, the Atronach standing stone, or the Atronach perk without ruining summoning ability.\r<br />\r<br />Want to by a battlemage or spellsword and still be able to block? [url=http://skyrim.nexusmods.com/mods/9247]Dual Wield Parrying[/url] will let you do this. It&#39;s a wonderful mod and I highly recommend using the ScriptDragon version of it.\r<br />\r<br />\r<br />[color=cyan][b]Alternatives[/b][/color]\r<br />Do you want to change the magic system, but my mod just isn&#39;t for you? No problem. Other people in the Nexus have made great mods too&#33;\r<br />\r<br />leasm&#39;s [url=http://skyrim.nexusmods.com/mods/11139]Empowered Magic[/url] is another excellent magic overhaul. Players who don&#39;t like my changes may find what they&#39;re looking for here.\r<br />\r<br />mysty&#39;s [url=http://www.skyrimnexus.com/downloads/file.php?id=2275]Balanced Magic[/url] is a more expansive overhaul that dramatically changes the magic system. It conflicts with a lot of things, but if you&#39;re looking for a more dramatic change to the base system than what I provide, it may be exactly what you&#39;re looking for.\r<br />\r<br />Lautreamont&#39;s [url=http://www.skyrimnexus.com/downloads/file.php?id=1245]Empowered Destruction Magic[/url] is a great choice if you only want to change destruction spells.[/font]\r<br />",
  "categoryId": "24",
  "version": "2.07.43",
  "author": "Kevin Kidder",
  "createdUnix": "1324598989",
  "updatedUnix": "1345161962",
  "containsAdultContent": false,
  "uploadedBy": "sushisquid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "14401",
      "name": "BetterMagic202",
      "version": "2.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "BetterMagic202-4374.zip",
      "uploadedUnix": "1325033440",
      "modVersion": "2.02",
      "virusScanUrl": "https://www.virustotal.com/file/20738d5112ababc4ae6cea087b8f95b8f2eff2fc59d4e511e5a7251aba168f15/analysis/1406567762/",
      "changelogHtml": " Better Spell Finishers has been added <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMagic202-4374.zip?fid=14401&ttl=1535760103&ri=8192&rs=8192&setec=36d0ce94ee0504ff3275cb9ac28ef7d3"
    },
    {
      "fileId": "16118",
      "name": "BetterMagic2035",
      "version": "2.03.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "BetterMagic2035-4374.zip",
      "uploadedUnix": "1325570274",
      "modVersion": "2.03.5",
      "virusScanUrl": "https://www.virustotal.com/file/94566a48f04ef136b6c657da9d35830db212ddd18eaa26373a9ed58d14c76f52/analysis/1406578806/",
      "changelogHtml": " Now fully compatible with tSSSSS. Load this mod after it. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMagic2035-4374.zip?fid=16118&ttl=1535760103&ri=8192&rs=8192&setec=3ec556395510dc9b804e69017395d6dd"
    },
    {
      "fileId": "23809",
      "name": "BetterMagic204",
      "version": "2.04",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "BetterMagic204-4374-2-04.zip",
      "uploadedUnix": "1327794639",
      "modVersion": "2.04",
      "virusScanUrl": "https://www.virustotal.com/file/e82b89e67fee7b47a94d200525bd7a0fdfab0ec1f5b8cd02af76a00646fa6331/analysis/1406642703/",
      "changelogHtml": " Corrected some hex data. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMagic204-4374-2-04.zip?fid=23809&ttl=1535760103&ri=8192&rs=8192&setec=e41af3a5deb8e68ce9dc84cb81147c8f"
    },
    {
      "fileId": "67866",
      "name": "BetterMagic206FULL",
      "version": "2.06",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "BetterMagic206FULL-4374-2-06.zip",
      "uploadedUnix": "1339638929",
      "modVersion": "2.06",
      "virusScanUrl": "https://www.virustotal.com/file/f14e56ab016b2a259039526040a45d12dd75500f918abc6d781f22f112850564/analysis/1406957770/",
      "changelogHtml": " Fire Storm no longer requires a line of sight to hit and only affects enemies. In exchange, its damage was reverted to normal. <br/> \n Lightning Storm no longer disintegrates things normally immune to that. <br/> \n Cloak spells now start at 8 foot range. They grow in size and damage with mastery and augment perks. <br/> \n Because they constantly hit, cloak spells do not trigger finisher effects anymore. It was unfair. <br/> \n Illusion master spells can now be dual cast. <br/> \n Call to Arms now rallies targets. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMagic206FULL-4374-2-06.zip?fid=67866&ttl=1535760104&ri=8192&rs=8192&setec=41e1f8646d037791fa8b45604fdadb3b"
    },
    {
      "fileId": "70853",
      "name": "BetterMagic2072",
      "version": "2.07.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "19",
      "fileName": "BetterMagic2072-4374-2-07-2.zip",
      "uploadedUnix": "1340919553",
      "modVersion": "2.07.2",
      "virusScanUrl": "https://www.virustotal.com/file/3183258d315285e9fc33d94a59cd06b941ca6a340d973bf9104b024e470c7db9/analysis/1406988845/",
      "changelogHtml": " Augmented Element perks improve elemental shouts again. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMagic2072-4374-2-07-2.zip?fid=70853&ttl=1535760104&ri=8192&rs=8192&setec=60f32339c16b287810d4d037455e3ce2"
    },
    {
      "fileId": "75863",
      "name": "BetterMagic2074",
      "version": "2.07.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "148",
      "fileName": "BetterMagic2074-4374-2-07-4.zip",
      "uploadedUnix": "1342927872",
      "modVersion": "2.07.4",
      "virusScanUrl": "https://www.virustotal.com/file/a6f10de687d9bba6135b2d59b76b81dac000402d022b17fdfb364309f73b3840/analysis/1407038227/",
      "changelogHtml": " File is now multi-lingual with support for additional languages to be added in the future. <br/> \n Installation with NMM made much simpler. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMagic2074-4374-2-07-4.zip?fid=75863&ttl=1535760105&ri=8192&rs=8192&setec=43ae11b65511478415189b27f992eaf4"
    },
    {
      "fileId": "75975",
      "name": "BetterMagic20741",
      "version": "2.07.41",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "157",
      "fileName": "BetterMagic20741-4374-2-07-41.zip",
      "uploadedUnix": "1342975820",
      "modVersion": "2.07.41",
      "virusScanUrl": "https://www.virustotal.com/file/c6359b9506d9ae9b7b13c32098ab654b5013bf5ab49e4ce9675f4620715e1ed6/analysis/1407039243/",
      "changelogHtml": " French translation added. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMagic20741-4374-2-07-41.zip?fid=75975&ttl=1535760105&ri=8192&rs=8192&setec=b0799c7be324fee591ced79cc826e667"
    },
    {
      "fileId": "77044",
      "name": "BetterMagic20742",
      "version": "2.07.42",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "170",
      "fileName": "BetterMagic20742-4374-2-07-42.zip",
      "uploadedUnix": "1343454798",
      "modVersion": "2.07.42",
      "virusScanUrl": "https://www.virustotal.com/file/15f3d338058cfd7809ac200da7f45bb5e8fa1ea6e37e8099cbbd87d5328aa8b7/analysis/1407051194/",
      "changelogHtml": " Dutch translation added. <br/> \n Better Sorting compatibility added for English version. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMagic20742-4374-2-07-42.zip?fid=77044&ttl=1535760106&ri=8192&rs=8192&setec=178828a3400665069431ef4e2b4859a5"
    },
    {
      "fileId": "82093",
      "name": "BetterMagic20743",
      "version": "2.07.43",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "190",
      "fileName": "BetterMagic20743-4374-2-07-43.zip",
      "uploadedUnix": "1345161962",
      "modVersion": "2.07.43",
      "virusScanUrl": "https://www.virustotal.com/file/2c0ce2253efa727c23cb14f0ebf545009228e5ae97d6455181f0157c2c26eaa5/analysis/1407101708/",
      "changelogHtml": " Russian translation added. <br/> \n German translation added. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMagic20743-4374-2-07-43.zip?fid=82093&ttl=1535760106&ri=8192&rs=8192&setec=27a18a5f81ee57b5f41830958fd1ef3c"
    }
  ]
}