{
  "modId": 43857.0,
  "modName": "Mastercrafted Dwemer Weaponry",
  "summary": "Able to craft Mastercrafted Dwemer weapons at the forge, equivalent in power to ebony weapons. Retextures of vanilla Dwarven weapons (non-replacer). Requires Dwarven and Ebony Smithing Perks. Each weapon has gem-inlaid variants (Ruby, Sapphire, Emerald, Diamond) that can be crafted with the proper amount of desired gems.",
  "descriptionHtml": "---Mastercrafted Dwemer Weaponry---\r\n\r\n-Created by: Moshadawg-\r\n\r\n\r\nIntroduction:\r\nI have created some personal mods in the past that tweak some things in the game, but this is my first real Skyrim mod and the first that I am uploading. This is a standalone retexture of the Dwarven weapons, meaning that they are not replacers. I did a bit of retexturing for Oblivion and have a couple mods uploaded for that, but this is my first Skyrim retexture.\r\n\r\nI originally thought about making this mod for myself because I made a character that is obsessed with the Dwemer and wanted him to always use Dwarven equipment and collect Dwemer artifacts. So I downloaded some good mods that add Dwemer/Dwarven equipment and such to the game, like the Dwarven Power Armor mod, but I had no Dwemer weapons to match the power of that armor. Standard Dwarven weapons just aren\\'t powerful enough to keep through the whole game. So I began working on this superior set of Dwemer weaponry. I also thought the original Dwarven weapons were lacking in color and saturation, so I made the metal for my weapons darker and more bronze-like than the original.\r\n\r\nDescription:\r\nThis mod makes it possible to craft Mastercrafted Dwemer Weaponry at any forge, given that you have the Dwarven and Ebony Smithing perks. The materials required are a combination of dwarven ingots, steel ingots, ebony ingots, and leather strips. All weapons are able to be tempered at a grindstone with 1 dwarven ingot + 1 ebony ingot. Mastercrafted Dwemer weapons are equal in damage output to Ebony weapons, but weigh a bit less and have a slightly faster attack speed, in addition to being more valuable. They will appear under the \\'Dwarven\\' section in the crafting list after you obtain the ebony smithing perk.\r\n\r\nAll weapons have gem-inlaid variants that can be crafted with the proper amount of said gem, in addition to the base materials. The included gems are Ruby, Sapphire, Emerald, and Diamond. These variants all have the same stats as regular Mastercrafted weapons, but are obviously worth more. I did my best to find suitable places to add the gemstones to the weapons. The mace and war axe were lacking in this respect, as there are no really good spots for gems along the haft or on the head of the weapon, so they each have very large gemstones at the base of the haft, along with small gem studs along the haft. The rest of the weapons, however, have gems in very obvious positions. I did edit the normal and environment maps for the gemmed versions so they have a unique shine and react to the light much more intensely than the metal on the rest of the weapon. \r\n\r\nOf course, if you don\\'t want to pimp out your weapons with flashy expensive gemstones you can still crafted the basic Mastercrafted weapons without gems.\r\n\r\nI also made Mastercrafted Dwemer Arrows that you can craft with firewood and Dwarven ingots. You get 15 arrows per firewood/ingot. I actually did this after I had finished all of the other weapons and everything, after realizing I needed Mastercrafted arrows to fire from my Mastercrafted bows.\r\n\r\nI did add the weapons to the leveled lists but they are extremely rare. You can only find them in the larger rare chests within Dwarven ruins, but you still have to be lucky for them to show up. They will only start showing up after lvl 30. The only way you would find one outside of a Dwarven ruin would be if you found one of those large dwarven chests outside of a Dwarven ruin, but there are very few of these instances.\r\n\r\nPossible Future Plans:\r\n- Add gem-inlaid variants with multiple gem types rather than just all the same gems.\r\n- Hand-place rare instances of weapons in hard-to-reach/hidden places in Dwarven ruins? And/or place powerful enemies wielding them? Might do this because they are so hard to come across in random loot.\r\n- Mastercrafted Dwemer Armor? Possible, but not likely because of things like the Dwarven Power Armor mod\r\n\r\nCompatibility:\r\nI don\\'t anticipate any compatibility issues. I didn\\'t come across any in my testing, but you never know. Please let me know if you come across any compatibility issues with other mods. If there are any, it would likely be with the very small amount of editing I did to the leveled lists, but I use a scaling/leveled loot stopper mod and it still works.\r\n\r\nKnown Bugs:\r\n- **Important**: If you drop any of the Mastercrafted Dwemer Bows they will disappear forever... I do not know why this is, but just do not drop them! You can put them in containers, just don\\'t drop them out in the world. Only bows are affected, all other weapons drop normally. If anyone knows why this might be or figures it out, please let me know so I can fix it.\r\n- If you drop the Mastercrafted Dwemer Swords, they will appear without gemstones in the worldspace. They are normal when equiped and viewed in the menu, but look stupid when dropped.\r\n- The war axe doesn\\'t have a belt loop/sheathe like it should.\r\n\r\n--I will be looking into these bugs and will attempt to resolve them.\r\n--If anyone comes across any other issues or bugs, let me know and I will look into it.\r\n\r\n**If you do happen to drop your bow and it disappears, type (help \\\"mastercrafted dwemer bow\\\") into the console to get ID. There should be five different IDs, one for each bow variant (they all have the same name). The order should be Base, Sapphire, Ruby, Emerald, Diamond, but I am not entirely sure. Type (player.additem <ID number> 1) and bow will be added to your inventory. If its not the right one just remove it with (removeitem) in place of (additem) and keep trying each ID number with (additem) until its the right one... Sorry, I will try to fix this if I can.\r\n\r\nRecommended Mods:\r\n-Dwarven Power Armor - by lautasantenni\r\nhttp://skyrim.nexusmods.com/mods/23530/?\r\n\r\n-Dwemer Goggles and Scouter - by volvaga0\r\nhttp://skyrim.nexusmods.com/mods/13133//?\r\n\r\n-Dwemer Certified - by TheTalkieToaster\r\nhttp://skyrim.nexusmods.com/mods/10442//?\r\n\r\nDwemer Exoskeleton - by SpaceWiking\r\nhttp://skyrim.nexusmods.com/mods/19212//?\r\n\r\n\r\nThanks to Bethesda for Skyrim and all of the Elder Scrolls, one of the best game series ever created!",
  "categoryId": "55",
  "version": "1.0",
  "author": "Moshadawg",
  "createdUnix": "1381126159",
  "updatedUnix": "1381125479",
  "containsAdultContent": false,
  "uploadedBy": "Moshadawg",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000062845",
      "name": "Mastercrafted Dwemer Weaponry",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7005",
      "fileName": "Mastercrafted Dwemer Weaponry-43857-1-0.7z",
      "uploadedUnix": "1381125479",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b9158c0784a8a6f262239b775ba445def74d8eead32cdaf94fdbed2243e18026/analysis/1407748447/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mastercrafted%20Dwemer%20Weaponry-43857-1-0.7z?fid=1000062845&ttl=1535824566&ri=8192&rs=8192&setec=1581b820c18daaad46c7921630768a0b"
    }
  ]
}