{
  "modId": 43913.0,
  "modName": "Bosmer Armour Pack - Patch",
  "summary": "",
  "descriptionHtml": "This changes (balances) the Bosmer Armor Pack 1.3 to my preferences. I thought I would share.\r\n1.4 Note: Mask and Cloaks are now enchantable by hugely popular demand. (Yes that was a joke).\r\n\r\nThe [url=http://skyrim.nexusmods.com/mods/37289]Bosmer Armor Pack[/url] is still required in order to use the graphics assets.\r\n\r\n[u]Weapons[/u]\r\nMost of the weapons had kept the speed of some of the fastest vanilla weapons but had huge bonus damages to them, I have just slowed down the weapons, but they have retained slightly higher damage.\r\n\r\nI changed the various daggers to be like \\\"shortswords\\\" but still considered daggers - very in-line with Bosmer stealth gameplay I think. They have a slightly higher reach (half way between daggers and swords), but also slower speed than daggers (also half way between dagger and sword speeds).\r\n\r\nDamage of all weapons more in line with their crafting trees - they each do either the same or 1 point more than the same weapons of that tier - bows are the same, daggers do 1 more.\r\n\r\n[u]Bows and Arrows[/u]\r\nBows are slightly slower - again in-line with bows of their tier.\r\nArrows are now +100% Faster to fall in line with Arrow and Bolt Tweaks.\r\n\r\n[u]Other[/u]\r\nEbony ingots changed for Malachite in the glass crafted weapons (possibly a typo by author).\r\n\r\n[u]Armour[/u]\r\nNo Armour has been modified at all with the exception of the mask.\r\nMask - enchant removed.\r\n\r\n[u]Installation[/u]\r\nJust install with NMM and overwrite the old esp.\r\n\r\n[u]Uninstalling[/u]\r\nJust remove with NMM old esp will appear.\r\n\r\n[u]Note:[/u]\r\nThis is all purely designed for my own personal taste, I hate having OP things in the game and things I cannot modify myself (like the mask).\r\n\r\nI\\'ve basically made it so that these items can be used from stealth just as they were, but are slightly slower for direct combat. However, to make up for that the daggers are now longer reaching too.\r\n\r\nI think this falls in line with a possible style of weapon crafting and design for this particular race.\r\n\r\nIt all makes sense (to me :)).\r\n\r\n[u]Why make these kinds of patches?[/u]\r\nBecause people who are awesome at graphical design, animation and/or rendering 3d images in 3ds max or blender aren\\'t always the best \\\"dungeon masters\\\" or even that great with the creation kit necessarily. I tend to be more technical (programming/UI) so I am fairly critical of many mods that come with beautiful graphics, but the mod author just had to make his dagger the \\\"dagger of awesome\\\" - the bestest dagger in the whole wide game that beheads dragons and gods in 1 hit.\r\n\r\nAm I trying to get up the original Authors\\' nose? No. I tend to only bother with mods that I find are worth the time to try and make \\\"a little more perfect\\\", and frankly they are amazing to begin with - such as this armour/weapon set.\r\n\r\nEnjoy!",
  "categoryId": "84",
  "version": "1.4",
  "author": "thefinn",
  "createdUnix": "1381182371",
  "updatedUnix": "1382655382",
  "containsAdultContent": false,
  "uploadedBy": "thefinn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000070264",
      "name": "Bosmer Armour Pack - Patch",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18",
      "fileName": "Bosmer Armour Pack - Patch-43913-1-4.7z",
      "uploadedUnix": "1382655382",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/6b700602744891d8c5748cd816a1a077b18720f67cac243cc364ccef24548193/analysis/1407767883/",
      "changelogHtml": " Someone asked for enchantable versions of the mask/cloaks. There they are - probably should&#39;ve done that for 1.3, but I just wanted to get rid of the enchant personally. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bosmer%20Armour%20Pack%20-%20Patch-43913-1-4.7z?fid=1000070264&ttl=1535824620&ri=8192&rs=8192&setec=6bb766132949adde544d68efca3fecbd"
    }
  ]
}