{
  "modId": 43924.0,
  "modName": "Old Riverwood",
  "summary": "The remains of the first section of Riverwood, the original settlement area attacked and raided and razed to the ground.",
  "descriptionHtml": "Just a quick smattering of debris, a rickety bridge, a butt-ton of low level skeletons.  \r\nThis isn\\'t a quest, this isn\\'t even a functional area.  For the most part it\\'s just to give a bit of depth to Riverwood.  A lot of cities have their slum areas both in real life and in fantasy.  I felt Riverwood was missing that, a small town or not, everything looks like it was just built yesterday despite claiming to be quite old, lines like \\\"I\\'ve been living here my whole life\\\"  \r\nSo, I threw down some decrepit farm houses, some rubble, a few rocks, changed the shape of the earth a bit, and bingo-bango.  The Riverwood Slums / original settlement.\r\n\r\nLike I said, it\\'s just a simple atmospheric mod, not meant to be taken seriously.    It doesn\\'t conflict with any of the riverwood houses, BUT it will conflict with the riverwood fishing shack.  Beautiful riverwood and forested riverwood mods are compatible and and soon as I figure out how to link those in my discription to give semi-credit for keeping them in mind while plopping my stuff down I will do so (also because I love forested riverwood and it was the first mod I ever downloaded.)\r\n\r\nanyway, I hope you enjoy it.  Some of the ground is a bit jagged from the landscaping tool but that suits me just fine, kind of adds to the isolation of Old Riverwood.   I was going to do something but then I forgot, so anyway, it\\'s fully navmeshed and the skeletons should react normally,  they did the 15 times I tested their behavior.  One is stuck under a house, impracticle and impossible to reach, can be shot with a bow.  Again I like this because they\\'re undead, so maybe he manifested himself under the house and got stuck and didn\\'t want to end up back in Oblivion.\r\n\r\nCheers.  Endorse if you like it, and even if you don\\'t.\r\n\r\nThanks for downloading. \r\n\r\n\r\nOH and just an fyi, the skeletons won\\'t follow you up the scaffolding, the easiest, laziest way of keeping them from wandering into riverwood by way of the bridge was to not navmesh those objects.  So, yeah.\r\n\r\nAlso, as my wife helped me remember, I was going to add a graveyard, so expect an update ",
  "categoryId": "70",
  "version": "1.0",
  "author": "Loth",
  "createdUnix": "1381185995",
  "updatedUnix": "1381185988",
  "containsAdultContent": false,
  "uploadedBy": "Imahugedonk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000063018",
      "name": "Abandoned Riverwood Settlement",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "146",
      "fileName": "Abandoned Riverwood Settlement-43924-1-0.7z",
      "uploadedUnix": "1381185988",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/62e243168023443b19ebd3cbf3d8691a78eeb0f86a656b97677907c2056c4b6e/analysis/1407749223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Abandoned%20Riverwood%20Settlement-43924-1-0.7z?fid=1000063018&ttl=1535824633&ri=8192&rs=8192&setec=e2ab6aa424278f74704253bab210026d"
    }
  ]
}