{
  "modId": 43950.0,
  "modName": "Reachmans Respite - Player Home",
  "summary": "A modest but fully-equipped Reach Native/Forsworn-themed player home located in the hills opposite Old Hroldan Inn.",
  "descriptionHtml": "[u][b]Reachman\\'s Respite[/b][/u]\r\n\r\nNestled in the craggy hills of the Reach, hidden away from the judging and contemptuous gaze of Markarth\\'s Nordic and Imperial overlords, Reachman\\'s Respite offers sanctuary to weary natives of the Reach. A humble home where true sons and daughters of the Reach can fully embrace their mysterious and ancient culture without fear of oppression.\r\n\r\nShowcase by [url=http://skyrim.nexusmods.com/users/2388835/?]Hodi[/url]:\r\n[youtube]j4vHwZ3zRSs[/youtube]\r\n\r\n[u][b]Features include:[/b][/u]\r\n\r\nShrine to the Old Gods of The Reach (with idle prayer marker)\r\nEnchanting/Alchemy tables\r\nOutside smithing area with Forge Anvil, Armor Workbench, Grindstone and Tanning Rack\r\n[u]Fully Nav-Meshed and Follower-friendly interior[/u]\r\nA pet goat (I call him \\\"Bill\\\".)\r\nSeveral chests and safe-to-use storage containers\r\nPlayer-owned bed (with Well Rested bonus)\r\nUsable cooking pot\r\nVarious alchemical ingredients and reagents for practising spooky Reach Magic\r\nSmall bed by the door for any followers you might wish to accommodate\r\nReach Native themed books and other goodies\r\n\r\n[u][b]Things To Note:[/b][/u]\r\n\r\nI have edited the name of the map marker for Old Hroldan to include the name of the house and positioned the marker in a slightly different spot (middle of the road facing between the inn and the house), so that it is easy to remember where it is located. I didn\\'t make a new marker for it because the home and Old Hroldan Inn are so near to each other.\r\nWhile the interior of the house is nav-meshed, I have not changed any of the exterior nav-meshing in the area around the house because, it\\'s a clusterfudge and I don\\'t want to mess up people\\'s Tamriel space. Followers should still be able to enter and exit the house without problems, though they may sometimes get stuck on the fence for a couple of seconds before sorting themselves out!\r\nI\\'ve noticed that the fireplace light can occasionally flick in and out of view in the room below the hearth. I\\'ve tried to fix this but it seems that the game insists on making firelight visible through floors. It\\'s a very minor and inoffensive bug however.\r\n\r\n[b][u]Installation & De-installation:[/u][/b]\r\n\r\nFor NMM: Install - Simply click to download and start up your game.\r\nUninstall - Turn off the mod in the NMM menu, create a new save and then play as normal.\r\n\r\nFor Manual: Install - Drag the .esp file into your Skyrim [i]Data[/i] folder (typical path - Steam/steamapps/common/Skyrim/Data).\r\nUninstall: Take said .esp folder out of your Data folder, create a new save and play as normal.\r\n\r\n(I would recommend putting this mod [u]below[/u] any follower altering/custom follower mods you might be using.)\r\n\r\n[b]As ever, if you encounter any problems while using this mod, please, contact me and I will try to help.[/b]",
  "categoryId": "67",
  "version": "1.0",
  "author": "Rob_the_Bob",
  "createdUnix": "1381345835",
  "updatedUnix": "1381345550",
  "containsAdultContent": false,
  "uploadedBy": "rcarass1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000063790",
      "name": "Reachmans Respite - Player Home",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "Reachmans Respite - Player Home-43950-1-0.zip",
      "uploadedUnix": "1381345550",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3bf8dc3b50fa1843b6fe4805ff846ad4accf7e1c883293b9cbdc0ed1df52bd6f/analysis/1407750623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Reachmans%20Respite%20-%20Player%20Home-43950-1-0.zip?fid=1000063790&ttl=1535824653&ri=8192&rs=8192&setec=d96a145ff2a4cdab8f65934f2b6f8f05"
    }
  ]
}