{
  "modId": 43991.0,
  "modName": "Shadows Races Redone WIP Version",
  "summary": "A races mod im working on that i figured i should upload to get balancing feedback and such. IT IS CURRENTLY INCOMPLETE. IF THINGS DONT WORK, I AM MOST LIKELY AWARE ALREADY, however, feel free to let me know with a pm or comment.",
  "descriptionHtml": "(Features not currently complete will be noted with a (WIP))\r\nArgonian- Ever wanted to fight underwater? Argonians can now perform combat underwater! (WIP) Once I get this working, expect some underwater dungeons made specifically for Argonians. (Work Not Started Yet, lets not put the cart ahead of the horse here)\r\nBretons- Bretons get a small increase to base magicka (+25) and automatically have the reanimate corpse spell, perfect for people who want to play a necromancer!\r\nDunmer/ Dark Elves- Also get a small boost to base magicka (+25) and automatically have the firebolt spell, perfect for pyromaniacs and destruction magic enthusiasts everywhere!\r\nAltmer/ High Elves- They keep their vanilla +50 Magicka, and in addition their magicka regenerates at the same speed as other races stamina, in exchange for slower stamina regeneration. Perfect for the spellcaster of any type. (Let me know how this balances for you)\r\nImperials- a good all around choice, +25 to health, stamina, and magicka.\r\nKhajit- Didn\\'t really know what to do with them, so they cant be knocked over because cats always land on their feet. So thats a thing. if you have a suggestion, let me know. (Tentative WIP)\r\nNords- The Nordic blood is the blood of heroes. -20% shout recovery time.\r\nOrcs- The Code of Malacath demands near constant battle, as such, Orcs recover health twice as fast as any other race, allowing them to get back into battle much more quickly than other races at the cost of decreased magicka regeneration. Also, +100 carrying capacity. You\\'re welcome. (Once again, let me know how this balances for you)\r\nRedguard- base stamina +50, perfect for the ultimate warriors.\r\nWood Elves/ Bosmer- Can summon a rideable bear. What else could you possibly want? (WIP- the spell currently exists, but it does nothing, so no need to tell me that it does nothing.)\r\n",
  "categoryId": "34",
  "version": "0.01",
  "author": "shadowkaga",
  "createdUnix": "1381268664",
  "updatedUnix": "1381268584",
  "containsAdultContent": false,
  "uploadedBy": "shadowkaga",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000063392",
      "name": "ShadowsRacesRedoneWIPVersion",
      "version": "0.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "51",
      "fileName": "ShadowsRacesRedoneWIPVersion-43991-0-01.zip",
      "uploadedUnix": "1381268584",
      "modVersion": "0.01",
      "virusScanUrl": "https://www.virustotal.com/file/529852ac4d3be9126cba67a4ee077dd6d85660a4c061d621b9b01738d04a172b/analysis/1407749896/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ShadowsRacesRedoneWIPVersion-43991-0-01.zip?fid=1000063392&ttl=1535824695&ri=8192&rs=8192&setec=c09d1147df7757c58c5004fdeda23d3b"
    }
  ]
}