{
  "modId": 44014.0,
  "modName": "Pseudo parry animation",
  "summary": "Adding a \"parry\" like animation to blocking with a weapon. ",
  "descriptionHtml": "[img]http://oi39.tinypic.com/2ut3maf.jpg[/img]\r\n[img]http://i.imgur.com/m24Q6.png[/img]\r\n[b]MODDERS:[/b] I would love to expand the mod farther and i have ideas on how, but for that i need 3D animators who are willing to participate. If there are more animators besides poor krish698 whose busy enough, please PM me :)\r\n\r\n[b]DESCRIPTION:[/b]\r\nI always hated how it looks to block with a weapon - it'd look like the defender is just holding his weapon static in front of his face and hopes for the best. The attacker seems to just swing at the weapon and the defender kinda just takes it.... \r\n\r\nTo alleviate this issue I replaced the tiny animations of \"absorbing a hit with a weapon\" with the bashing animation and with custom made animations made by the awesome krish698. \r\nWhat this means is that once you hold a weapon to block and successfully block a hit than at the moment of impact you will see a short bash or parry animation that will give the illusion that your character changed the angle of the weapon to parry the hit. \r\nThis, of course, also applies to the enemies as well. \r\nThere are 3 different parry moves for 1H weapons and 2H swords and 2 different parry moves for blocking with a 2H axe or hammer.\r\nThe changes will apply to all human NPCs as well as the player. \r\ncheck out the video in the video section. \r\n\r\nAlso, Since the \"absorbing\" animation has changed I also tweaked the parry sound effects to compensate for the lack of sync. \r\n\r\n[b]INSTALLATION:[/b]\r\neither extract the files into the data folder or use NMM. \r\n\r\n[b]UNINSTALLATION:[/b]\r\nIf you are not using NMM than you will need to manually remove the files that came with the mod. To know what to remove just look inside the archive of the mod. \r\n\r\n[b]Updates history:[/b]\r\nV1.3 - updated on 28.10.13-\r\nKrish698 has improved the 2H top-heavy animations (war hammers and war axes) and made a variety of 3 different parries - overhead block, left block and right block. enjoy!\r\n\r\nV1.2 - updated on 19.10.13-\r\nKrish698 has improved the 2H swords animations and made a variety of 3 different parries. thanks again krish! you rock. \r\n\r\nv1.1 - updated on 15.10.13-\r\nKrish698 has refined the 1H animations so the looky better without glitches for the player or repeated bashing animation. Thank you, krish!\r\n\r\nv1.0 - innitial release - \r\nvarious parry animations for blocking with weapons. \r\n\r\n[b]KNOWN BUGS:[/b]\r\nNothing that hurts gameplay but occasionally there are jumps in the parry animation or jerks in the legs, but these fix themselves after a second. \r\nNothing major or noteworthy.\r\n\r\n[b]COMPATIBILITY:[/b]\r\nThis mod changes the animation and sound files of block hit for both 1H and 2H weapons. not with a shield and not the idle pose of blocking. naturally a mod that changes these animations will not be compatible but i dont know of such a mod. \r\nAlso this mod should be compatible with \"duel wield parry\" by borgut1337 and any other animation mod out there. \r\nIf you discover a mod that isnt compatible with this mod - let me know!\r\n\r\nAlso this mod changes the sound effects of the impact of weapon on weapon so any sound mod that changes combat sound effects will not be compatible if the sound mod is installed AFTER my mod. But that is easily solved - all you have to do is install Pseudo parry mod AFTER every sound mod. \r\nIf you installed a combat sound mod after you have my mod installed than you will notice that blocking a hit is out of synch. just uninstall and reinstall my mod and it will be synced again. \r\n\r\nI recommend using this mod with mods that allow time blocking like these awesome gems:\r\nDeadly combat - http://skyrim.nexusmods.com/mods/5485/?\r\nSimple melee tweaks - http://skyrim.nexusmods.com/mods/39054//?\r\n\r\n[b]DISCLAIMER:[/b]\r\nIt's a very simple un-ambitious little mod I wanted for myself. I am the brain and Krish698 is the brawn, since i am no animator in 3Dmax but i really wanted this done, so i improvised and got a tad creative. I decided to upload it so maybe others will enjoy the fruits of my idea and krish698's efforts. :)\r\n\r\n\r\n\r\nit only works in 3rd person. i have no intentions on making a 1st person version. \r\n(if Krish698 would want to do that - i will support it and upload it here, but since he is the animator who created most of the animations and not me - i will leave it for him to decide if that's something he's interested in.) \r\n\r\n\r\n\r\n\r\n\r\n*********************\r\nFirst I want to give a huge shout out to my co-modder here - Krish698 :) He created new variations for parrying with 1H weapons and 2H swords. He endured all my critics and comments and tried to figure out what da heck i wanted from my illustrations, until the animations got to where they are. thanks a lot for the willingness to help and for a great job!\r\n\r\nAlso big kudos to judgefredd who created the mod \"Improved combat sounds\" from which I took the sounds and edited them. it's just a great sound mod. \r\n\r\nAlso big thanks to Xion209 and tiny lampe who helped with questions and nagging. you have been a huge help, guys ;)\r\n\r\nAnd, of course, bethesda, for the awesome game. ",
  "categoryId": "51",
  "version": "1.3",
  "author": "topeira and Krish698",
  "createdUnix": "1381318302",
  "updatedUnix": "1382981581",
  "containsAdultContent": false,
  "uploadedBy": "topeira",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000063694",
      "name": "Pseudo parry animation mod v1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "985",
      "fileName": "Pseudo parry animation mod v1-44014-1.rar",
      "uploadedUnix": "1381329264",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b04a0252a22cb29f636c9c31b95425e173db72f2838bf86ef2f713e8a202be2a/analysis/1407750453/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pseudo%20parry%20animation%20mod%20v1-44014-1.rar?fid=1000063694&ttl=1535824712&ri=8192&rs=8192&setec=5b50b3578ba03196ee1da2936852e652"
    },
    {
      "fileId": "1000067897",
      "name": "Pseudo parry animation mod v1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1006",
      "fileName": "Pseudo parry animation mod v1_2-44014-1-2.rar",
      "uploadedUnix": "1382208167",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/11216b08834fed66dd4c90c01e9ba185856b6090828c7601d367379e20e93c7a/analysis/1407761410/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pseudo%20parry%20animation%20mod%20v1_2-44014-1-2.rar?fid=1000067897&ttl=1535824713&ri=8192&rs=8192&setec=98872438d842f25f4e826bce7d1744a3"
    },
    {
      "fileId": "1000071879",
      "name": "Pseudo parry animation mod v1_3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1037",
      "fileName": "Pseudo parry animation mod v1_3-44014-1-3.rar",
      "uploadedUnix": "1382981581",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/acbef59dd30360e0cee4cf7f3df15fff622c152735d2f7805aa75588fbbf60e7/analysis/1407773001/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pseudo%20parry%20animation%20mod%20v1_3-44014-1-3.rar?fid=1000071879&ttl=1535824713&ri=8192&rs=8192&setec=2de34a0ed456b4364d4088ad8e990dc9"
    }
  ]
}