{
  "modId": 44074.0,
  "modName": "Morsel - The Cursed Halls",
  "summary": "&#39;Long ago, an ancient hall was built below the Throat of the World. Vast mines and caverns deep beneath the earth. For years these halls were inhabited until an ancient evil came to plunder them as well as their treasure. Can you reclaim them for Skyrim?&#39;",
  "descriptionHtml": "&#39;Long ago, an ancient hall was built below the Throat of the World. Vast mines and caverns deep beneath the earth. For years the Ancient Nords lived deep under the Mountain. Seeking new riches and forging new dwellings their craft was surpassed by none. That was until they awoke forces that should never have been disturbed.\r<br />\r<br />King Dralin I led his men in a valiant attack against the evil that besieged the halls. But his brave attempts were futile. The Crown of the Aransel and his mighty blade Kilivur were lost in his defeat. His forces retreating further into the dwellings, until they were finally overrun beyond the 11th Hall.\r<br />\r<br />The Halls were closed off to keep the evil within and were renamed Morsel, or in common speech The Cursed Halls. For hundreds of years they remained sealed, and forgotten until recently when once more they have been reopened by a force not yet known...&#39;\r<br />\r<br />Enter the Halls of Morsel and recover the Crown and Sword of the King. Hunt for the fabled Gem known as the Eye of Mara. Discover the force that has entered the halls after centuries of being closed&#33;\r<br />\r<br />Venture through tight warrens or grand halls within the 8 massive interior spaces designed for this mod. Look upon the huge columned 11th Hall. Gaze upon the wonderous Hall of Fire and Water. Cross the Longspan to the West Gate or brave the Deeps and fight the ancient fear known as The Sentinal. \r<br />\r<br />\r<br />* Version 2 \r<br />1) Includes &#39;The Deeps&#39; - \r<br />\r<br />* Future development: \r<br />1) The Dungeons. For anyone who has seen the Desolation of Smaug, these are based around the design of the Elven King Cells.\r<br />\r<br />\r<br />This mod requires DAWNGUARD in order to play the full edition. Base game edition available as well from Nexus, but many of the newer features are not contained in that version.\r<br />\r<br />The caverns are navmeshed and are follower friendly.\r<br />\r<br />Inspired by my favorite Tolkien places I have designed them around Moria and Goblin Town. I wanted to feel as though I am in a vast dungeon built long ago, something which the dungeons ingame never really gave me. Jacksons vision of Moria is something that will remain with me forever. The way he made the characters feel small in the huge caverns was something I have tried to recreate. \r<br />\r<br />Anyway, I hope you enjoy exploring the halls as much as I have in making them. Just a few requests:\r<br />\r<br />1) Please, no complaining :) This is my second mod, and there may be issues wrong with it. If you find anything, then message me with a screenshot. The dungeons were highly complex to make and to make authentic. I have tested it myself but I can&#39;t get everything. I have navmeshed, but it may need refining. Again just let me know of issues and I will fix them. \r<br />\r<br />2) If anyone would like to script a quest then run the idea by me first. If I like it then I will grant permission for you to create it and publish using the dungeons with you credited. \r<br />\r<br />3) I have made the caverns with various expansion points. I plan to add to it as time allows to make it a lot bigger although it is already very big&#33; \r<br />\r<br />4) To enter the dungeon head to Ivarstead, the doorway is located next to the ruined house across the river. \r<br />\r<br />5) Skyrim Nexus contains a Base Game edition. As Dawnguard is required to play this mod, I have supplied an untested replica specifically created for those without Dawnguard. However future updates will require Dawnguard in order to play upcoming expansions. \r<br />\r<br />Cheers \r<br />Lionbush",
  "categoryId": "88",
  "version": "2.11",
  "author": "Lionbush",
  "createdUnix": "1381358275",
  "updatedUnix": "1383340081",
  "containsAdultContent": false,
  "uploadedBy": "lionbush",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000063849",
      "name": "Morsel",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "565",
      "fileName": "Morsel-44074-1.rar",
      "uploadedUnix": "1381358197",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1d2f8cc8a3b1c6aa54450657c33357e77729e6780c0e43c341df41718117a055/analysis/1407750814/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morsel-44074-1.rar?fid=1000063849&ttl=1535824755&ri=8192&rs=8192&setec=7e3ecbbf7b363697bb0e06d07fcb4622"
    },
    {
      "fileId": "1000064138",
      "name": "Morsel - Base Game Edition",
      "version": "0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "540",
      "fileName": "Morsel - Base Game Edition-44074-0.rar",
      "uploadedUnix": "1381436688",
      "modVersion": "0",
      "virusScanUrl": "https://www.virustotal.com/file/0f7c0443c86b7a9b5b4c16b48e858cc598e4ae80bd8c887f29b28e0b9d9bebac/analysis/1407751519/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morsel%20-%20Base%20Game%20Edition-44074-0.rar?fid=1000064138&ttl=1535824755&ri=8192&rs=8192&setec=be6eb96f18e50edb61c16d37affb6187"
    },
    {
      "fileId": "1000072442",
      "name": "Morsel - The Cursed Halls",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "702",
      "fileName": "Morsel - The Cursed Halls-44074-2-1.rar",
      "uploadedUnix": "1383084017",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/64ab2ef009fd4fe1b861166b3c169a51e0a4b08d8644c31f2e6d47b7701826ea/analysis/1407774432/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morsel%20-%20The%20Cursed%20Halls-44074-2-1.rar?fid=1000072442&ttl=1535824756&ri=8192&rs=8192&setec=2a9fe0e39c92567a336c2db41ca3001f"
    },
    {
      "fileId": "1000073814",
      "name": "Morsel - The Cursed Halls",
      "version": "2.11",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "715",
      "fileName": "Morsel - The Cursed Halls-44074-2-11.rar",
      "uploadedUnix": "1383340081",
      "modVersion": "2.11",
      "virusScanUrl": "https://www.virustotal.com/file/5ff2930b79e242522bedc0b9d2a284736edba3f990ae0ac9fcd57cf4d8499d98/analysis/1407777431/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morsel%20-%20The%20Cursed%20Halls-44074-2-11.rar?fid=1000073814&ttl=1535824756&ri=8192&rs=8192&setec=9907f41428e9743952f2cecb7f2abc6a"
    }
  ]
}