{
  "modId": 44079.0,
  "modName": "The White House",
  "summary": "The first remodel of Breezehome to work in conjunction with TM Phoenix&#39;s Multiple Adoption mod and Hearthfire",
  "descriptionHtml": "[color=blue]The WhiteHouse – A Breezehome Remodel v2.2[/color]\r<br />A Mod by PCGirl Updated June 20, 2016\r<br />\r<br />IN LIGHT OF ALL THE CHANGES THAT HAVE BEEN TAKING PLACE IN THE LAST LITTLE WHILE, I DO NOT WISH THIS MOD OR ANY PART OF IT TO BE RE-UPLOADED\r<br /> ANYWHERE ELSE, AND MORE SPECIFICALLY ANY SITE THAT CHARGES FOR MODS. MY\r<br /> MODS ARE FREE TO DOWNLOAD, BUT I DO NOT GIVE PERMISSION TO CONVERT THIS\r<br /> MOD TO ANY OTHER FORMAT.  THIS MOD IS EXCLUSIVE TO NEXUS AND WILL \r<br />REMAIN AS SUCH IN THE FORESEEABLE FUTURE.  ALL OTHER PERMISSIONS REMAIN \r<br />AS STATED IN THE PERMISSIONS SECTION.\r<br />\r<br />\r<br />[url=http://s744.photobucket.com/user/PCGirl4/media/3b39dad0-ffad-46d2-9f21-765d81e8d9c7_zps3aabe2ce.jpg.html][img]http://i744.photobucket.com/albums/xx82/PCGirl4/3b39dad0-ffad-46d2-9f21-765d81e8d9c7_zps3aabe2ce.jpg[/img][/url]\r<br />\r<br />[color=red]IMPORTANT STUFF TO NOTE:[/color]  This is the first remodel of the original Breezehome with Hearthfire and TMPhoenix Multiple Adoptions compatibility.  You must have Hearthfire installed for the house to work properly as there are criteria and items from that DLC used in my remodel.  This is also my first mod for any game.  If you are using TM Phoenix’s mod make sure it is loaded after my house mod so that the components of his mod will pick up the links in my remodel.  If you are not using TM Phoenix’s Multiple Adoption mod [url=http://skyrim.nexusmods.com/mods/29249/?]TMPhoenix Multiple Adoption Mod[/url] you will not be able to move your children or your spouse into this home, only the player will be able to occupy the house.\r<br />\r<br />SECONDLY:  This house is not 100% lore friendly, so move on if that is what you expect from this remodel.  I will not swap out furniture or other items that people do not like, nor will I make major changes to the room structures or décor.  That is just the way it is, so take it or leave it.  A lot of work went into this mod, as with any mod, and originally was made for my own use.  I did not intend to release this, but TMPhoenix has done such a fantastic job with the Multiple Adoptions Mod, that I decided to release it so that other people can still use the vanilla homes in conjunction with his mod.  I do intend to release all 5 vanilla homes re-modelled to work with Hearthfire and TMPhoenix’s Adoption mod.\r<br />\r<br />[color=Green]NEW UPDATE V2.0:  The house is now equipped with a full smithy, as some of you requested.  A few other minor changes made to decor and fixed some problem areas.  The pool and spa areas are now equipped with lockers that will automatically remove followers gear and store it when you enter the pool or spa.  The gear is returned upon leaving the pool or spa.  The player will have to undress the old fashioned way as I could not put this in with out interfering with favorites categories or anyone using the Skinny Dipping mod.  Also, the main door is set to sheath your weapons automatically should you enter the house with your weapons drawn.  After all there are children and pets running around.\r<br />\r<br />NEW UPDATE V2.2:  Added in a new Patio area at the back of the house.  Update to the Navmesh so followers are more capable of using stairs and lower level.  Also fixed the missing textures on the chest in Smithing Room, and added in a few bits and bobs here and there.  There are some treats and surprises that have been added to the containers throughout the house, just to get you started off.  The childs&#39; toy chest has a few toys in it for them, as well as 1 outfit for a girl and 1 for a boy.  At least you can get them out of the scruffy clothes they have on when adopted.  Check all the containers.  The new shields in the pool room are useable, or you can leave them there as a display. \r<br />\r<br />Hope you enjoy the new changes.[/color]\r<br />\r<br />The home is complete with the ability to house your housecarl, spouse and 6 children.  The main area of Breezehome has not been changed, however, there has been a large basement level added onto the home to provide room for the children and your followers, should you wish to have them.  The housecarl has their own room in the main part of the house.  If you are not using TM Phoenix’s Multiple Adoption Mod, I strongly reiterate that you will not be able to move your children or spouse into this home, only yourself.\r<br />\r<br />There are many storage areas in the home as well as a library on the top floor of the house, personally my favorite room.  Mannequins, weapon storage, crafting areas, treasure storage, bookshelves, and many other little perks throughout the house.  Explore and discover all the special areas the house has to offer.  First off, you do not need General Stores or General Displays for any of the displays in the house. They are self maintained.\r<br />\r<br />The shelf in the living room is only for dragon claws - when you click on the display button it will tell you what the shelf will store and put the item in the appropriate spot. They are set up already, so you only need to have the item in your inventory.\r<br />\r<br />The shelf located in the stairwell landing is for bug jars only and again you must have them in your inventory, and then hit the activator button, it will automatically put the jar in the appropriate location.\r<br />\r<br />The shelves in the master bedroom, one is for books only. The other one will store Thieves Guild Treasures. See picture for what all these shelves will hold if in doubt. \r<br />\r<br />The shelves in the library are all books. The planters in the pool area are plantable with any of the Skyrim or Hearthfire plants. The items must be in your inventory to activate the planters.\r<br />\r<br />For any of the items on the shelves you can also use the console commands to put them into your inventory if you do not want to be bothered collecting them. Just type in console help and the name of the item to get the codes for them. Or you can find the codes on Skyrim Wiki too.\r<br />\r<br />The kitchen offers full storage options, crafting oven, butter churn and many other things that the homeowner considers conveniences.\r<br />\r<br />There are many plantable containers, gardens and flowers that adorn the whole house, as well as a functional hot tub and pool area for your family to relax around.\r<br />\r<br />Followers room has 4 beds, set up for privacy so it doesn&#39;t feel like a hospital ward.  A small dining area and sitting area, weapon storage and access to the pool area and spa.  Now includes a full smithy.\r<br />\r<br />\r<br />INSTALLATION NOTES:   Personally, I found it easier to install this mod from the very outset, in other words before purchasing it from the Steward and before becoming Thane.  You can then take Lydia to the new home immediately without any hiccups.  You can still purchase all the usual upgrades from the Steward at Dragonsreach in case you wish to uninstall my mod and revert back to the vanilla version or simply to try another house mod.\r<br />\r<br />However, if you have already purchased the original Breezehome and have your housecarl moved in, simply have her follow you somewhere else, install this mod and move her back into the new remodel as normal.  The house is recognized as Breezehome.  I simply use the “This is your new Home” option for the housecarl.  You will need to cast the “Bless Home” spell contained with TMPhoenix’s mod in order to have the children recognize the remodel as your new home.  Tell them to move to the “New House” not into Breezehome.  You can only move 2 children into the vanilla homes, this mod allows for a maximum of 6 children to move in and the spell will recognize that requirement.  Your spouse as well will recognize this spell and again you must tell them to move into the “New House” not the vanilla one.  \r<br />\r<br />Sometimes the children will be slow in moving into the home whether it is the vanilla or a remodel version of it.  Be Patient, they will show up. You can also go to another location in game and either sleep or wait for 24 hours and return home at that point.  Everyone should be there.  All the vanilla markers are recognized for outside play time, your spouse’s activities, such as setting up a shop, as well as some special activities that have been added in for Lydia to complete when she is not acting as follower.  She will visit the Bannered Mare, War Maidens, the Shrine of Talos, and some areas in the home that are not normally recognized by the vanilla package, provided she is not accompanying you on a mission somewhere.  They are set on a specific schedule, so you don’t need to do anything, but leave her at home.\r<br />\r<br />If you find the lighting too dark or not to your personal taste I would strongly recommend using (URWL) Ultra Realistic World Lighting    http://skyrim.nexusmods.com/mods/13531/?.  I do not use an ENB for my mods, but rely on the lighting from URWL.  I have no idea how it would look with an ENB, as there are far too many of them out to test, and each one is really a personal preference setting.\r<br />\r<br />[color=green]RUSSIAN TRANSLATION[/color] Modgames has honored my work by translating this house mod into Russian which you can find here:  [url=http://modgames.net/load/tes_v_skyrim/doma_i_lokacii/belyj_dom_pererabotka_doma_teplykh_vetrov/254-1-0-17771]RussianTranslationofTheWhiteHouse[/url]  The translation was done by Murderface(Skvizgar) and I thank him for the great job.\r<br />\r<br />UPDATES:  Over write existing files when asked, but a clean install is recommended.\r<br />\r<br />MY MODS:  [url=http://skyrim.nexusmods.com/mods/45273//?]Riften House - A Honeyside Remodel[/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/54222/?]Hjerim Estate - A Hjerim Remodel[/url]\r<br />\r<br />\r<br />KUDOS & CREDITS\r<br />Where to start, firstly I need to thank the two people who have mentored me throughout learning the CK and helping me trouble shoot problems, spending many long hours on chats with me to sort through things.   Their sense of humor, encouragement and letting me use them as sounding boards when I wanted to give up on the whole thing, kept me going.   Berticus and Gentester, I couldn’t have completed the mod without their instruction and friendship.  It seems so inadequate to say, but Thank you so much to both of you.  I honestly didn’t think it would finally be completed. \r<br />TM Phoenix for the inspiration to do this mod in the first place and for putting together a fantastic mod with his Multiple Adoptions.\r<br />\r<br />I apologize if I have forgotten anyone, there has been so many fantastic resources to choose from.  Let me know and I will add you into the list.   Thank you to all of you as without these resources our mods would not be the best they can be.\r<br />\r<br />Comments & Reviews\r<br />If you enjoy my mod, thank you and feel free to leave a comment in the appropriate section.  I truly appreciate any constructive ideas and comments.  However, if you do not like my mod, that is fine too, simply move on to something else that you will like.  Please don’t leave rude comments as they will be removed and reported, and you face the potential of being banned from the site.  You have been duly warned.\r<br />\r<br />Disclaimer:   You may not use any part of this mod or the resources without express permission from the specific mod author/authors unless stated otherwise in the author/authors permissions.\r<br />\r<br />NOTE:  For anyone interested the name “The White House” came up for several reasons, one “White” is my last name; and two, I thought the idea of the White House of Whiterun was kind of a neat idea.  Just a bit of useless trivia for you.",
  "categoryId": "67",
  "version": "v2.2",
  "author": "PCGirl",
  "createdUnix": "1381363205",
  "updatedUnix": "1404768296",
  "containsAdultContent": false,
  "uploadedBy": "PCGirl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000065082",
      "name": "The White House - A Remodel of Breezehome",
      "version": "v1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "126559",
      "fileName": "The White House - A Remodel of Breezehome-44079-v1-1.rar",
      "uploadedUnix": "1381630060",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/af8bd6402531aebf2ef8b8b5fb60f22fce8ab2b408206fd963deed8a8cbf4718/analysis/1407754281/",
      "changelogHtml": " cleaned up some asthetic issues  <br/> \n got rid of the fog at the end of the pool room <br/> \n eliminated the steam noises from the pool and spa area <br/> \n added in a few wall decorations, more mannequins and weapon racks <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20White%20House%20-%20A%20Remodel%20of%20Breezehome-44079-v1-1.rar?fid=1000065082&ttl=1535824762&ri=8192&rs=8192&setec=42db27ce6dcb3d53351570fbcc623c02"
    },
    {
      "fileId": "1000075321",
      "name": "The White House - A Remodel of Breezehome",
      "version": "v1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "128955",
      "fileName": "The White House - A Remodel of Breezehome-44079-v1-2.rar",
      "uploadedUnix": "1383639031",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/8bb87772adf512243cbe9b31fcf64797b5786e0516f8afa52a0940e6504ce792/analysis/1407781662/",
      "changelogHtml": " added in a new followers room <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20White%20House%20-%20A%20Remodel%20of%20Breezehome-44079-v1-2.rar?fid=1000075321&ttl=1535824762&ri=8192&rs=8192&setec=0a76fc53d78c8005d7d8de7e9127fbef"
    },
    {
      "fileId": "1000105999",
      "name": "The White House - A Remodel of Breezehome",
      "version": "v2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "137429",
      "fileName": "The White House - A Remodel of Breezehome-44079-v2-0.rar",
      "uploadedUnix": "1398117437",
      "modVersion": "v2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9c6fca93d67fcedc3dad69f48ee27211d2657f34d2781912d5526633c1c28046/analysis/1408034125/",
      "changelogHtml": " Added in a new Smithy and forge <br/> \n Minor changes to decor and fixed some small problem areas <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20White%20House%20-%20A%20Remodel%20of%20Breezehome-44079-v2-0.rar?fid=1000105999&ttl=1535824763&ri=8192&rs=8192&setec=e2b992614c94e863b51924f91bd485d7"
    },
    {
      "fileId": "1000116427",
      "name": "The White House - A Remodel of Breezehome",
      "version": "v2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "144780",
      "fileName": "The White House - A Remodel of Breezehome-44079-v2-2.rar",
      "uploadedUnix": "1404768296",
      "modVersion": "v2.2",
      "virusScanUrl": "https://www.virustotal.com/file/b0bd89c51a2611d5eeaed6cb622730a7651a110cce2d527f06bfaedd1a28d509/analysis/1408167154/",
      "changelogHtml": " Nav mesh tweaked on stairs for follower access to lower level <br/> \n Added in a new Patio area <br/> \n Fixed blue chest in smithing room <br/> \n Added in a few bits and bobs <br/> \n Cleaned with TesEdit <br/> \n Updated storage containers, added in specific items <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20White%20House%20-%20A%20Remodel%20of%20Breezehome-44079-v2-2.rar?fid=1000116427&ttl=1535824763&ri=8192&rs=8192&setec=875b39979800d39c68eace8262c3d914"
    }
  ]
}