{
  "modId": 4413.0,
  "modName": "Dalls_Skyrim_Faces",
  "summary": "Skyrim_Faces are face (Normal maps) mod which changes how Skyrim denizens - game races look.",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - Skyrim_Faces\r\n\r\nv1.1\r\n\r\n23/12/2011\r\n\r\nSkyrim_Faces are face mod which changes how Skyrim denizens - game races look.*\r\n\r\n* Word of warning - my \\\"cosmetic\\\" mods - regardless of being adult or not - are made to provide for natural / life-like good looks - so they might not be right for you - if you are seeking some wild / day-dream fantasy!\r\n\r\nAs Creation Kit - aka mod toolset - is, still not with us, there is not much that can be - really - done to improve or remake Skyrim faces for good but luckily, there are few useful n valid methods which can (in-meantime) help - better Normal Maps in this case.\r\n\r\nIf you are familiar with game textures, you\\'ll know what normal maps do n stand for - but if you are not - think of them (in this particular case) as of facial bone-structure - under skin (3d) lumps n bumps. Technically, they are de-facto (micro) extension of main head/body model meshes / models and as such, they are very important face forming element. In practice, they can be considered as main gender and character / race former / face recognition maker. Facial normal maps supplied with game are small (in size) n quite crudely made so all in game characters suffer and look as badly as they do. And that is present n main objective of this mod - full (HD) set of new n improved (facial) normal maps for all (in-game) races n genders - short of cat-folk (Khajit). \r\n\r\nMy aim with them (my facial normal maps) was to preserve race / gender diversity so don\\'t expect only one \\\"pretty face\\\" on them all. Races are on purpose made to be somewhat different - better n prettier ;) - then Bethesda\\'s game offer but along same (traditional lore-races) guide-lines. This files / my mod will work fine with other facial / skin (re-texture) mods but most importantly, they will definitely improve characters in your vanilla game. If you want, good body n face textures (visible / surface skin) as well check my Skyrim_Nords mod or find some other you like better. Only remember - to install this one - last!\r\n \r\nTo install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like this new look, simply delete / remove my male/femalehead_msn texture files from Data/textures/actors/character/ (all except Khajit) and original look will be restored to your game.\r\n\r\nBugs/conflicts: none known - but if you like them - take care not to overwrite them by accident!\r\n\r\nNot on v1.1: Some slight (aesthetics spotting) improvements of human male n female, imperial female and redguard female - otherwise same as v1.0\r\n  \r\nUse:\r\nFree to use but if used for modding ask me for permission!\r\n\r\nEnjoy and try to remember - if you like it even in a part - to give endorsement! \r\n\r\nThanks to Bethesda for great game.\r\n\r\n",
  "categoryId": "26",
  "version": "1.1",
  "author": "Dall",
  "createdUnix": "1324630640",
  "updatedUnix": "1324978836",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "13165",
      "name": "Dalls_Skyrim_Faces",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13780",
      "fileName": "Dalls_Skyrim_Faces-4413.7z",
      "uploadedUnix": "1324631008",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/707542bd753d00f16bb52103b0b161d9ae574885f89ae6360ff92f9e757d873a/analysis/1406550326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Skyrim_Faces-4413.7z?fid=13165&ttl=1535760168&ri=8192&rs=8192&setec=13d3dee3ecb4a7fa4a9ada3b0e71662d"
    },
    {
      "fileId": "14228",
      "name": "Dalls_Skyrim_Faces_v11",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13760",
      "fileName": "Dalls_Skyrim_Faces_v11-4413-1.7z",
      "uploadedUnix": "1324978836",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a643c4ca43990c5a11a61cc5066742941ff38c24380581cadce862d1d94dd2f6/analysis/1406562079/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Skyrim_Faces_v11-4413-1.7z?fid=14228&ttl=1535760169&ri=8192&rs=8192&setec=93666da34e8fc7a7d032c482535094af"
    }
  ]
}