{
  "modId": 44199.0,
  "modName": "Dramatic Mountains - Winter has come",
  "summary": "The long Summer is over and Winter has come. A complete overhaul of all the Mountains brings you Winter vistas in super high definition with no performance cost. The snow has reached the flat grounds and the upper Mountains are frosted in ice and snow.",
  "descriptionHtml": "I have created a new mod which has many solutions to how I could use both special texture effects and realistic snow settling on Mountains. The mod is:\r\n\r\nImmersive Snow and Ice : Mountain and Rock Edition \r\nhttp://skyrim.nexusmods.com/mods/45435\r\n\r\nUntil I incorporate the techniques and do some further work with the lower Mountains in this mod I strongly encourage you to use Immersive Snow and Ice instead.\r\n\r\n[size=6]-== \\\"Dramatic Mountains - Winter has come\\\" ==-[/size]\r\n\r\nThis version is vastly different to the first version (0.1) and seeks to fix most of the problems users had, and is also more of a Winter wonderland. ENBs user should have a better time of it now, and looking forward to some screen shots :) Thanks heaps to user Ravanna for the snow textures!\r\n\r\n[size=6]DESCRIPTION[/size]\r\n\r\nIf I could name this mod technically it would be called \\\"Multi-layered (parallax) for Snowy Rocks, Icy Snow and Super High Definition for Mountains up close for a very stylized look and effects\\\". It didn\\'t fit.\r\n\r\nMountains will be in super high definition up close, but the look of the Mountains has overtones more like a painter doing shades of colouring. This is an artistic, rather than realistic overhaul of the Mountains.\r\n \r\n[size=6]WHO IS THIS MOD FOR?[/size]\r\n\r\nAnybody wanting a change in scenery, literally.\r\n\r\nSkyrim Mountains were designed to look amazing at distances. But if you have explored mountains and noticed that when you get up close to them that the textures become very blocky and this breaks immersion for you, then this mod endeavors to make this a bit more enjoyable when you are actually amongst the Mountain ranges. You know when you jump up Mountain peaks to see whats up the top, Mountaineering mode, we\\'ve all done it :-P But you will also see the changes immediately from the ground, Winter has arrived!\r\n\r\nIts easy to install and uninstall, so no problems with a quick try for something a bit different. Make no doubts that at first you\\'ll be like \\\"Woah, this is very different!\\\". Probably the most ascetically environmental change mod to date, that is still lore-friendly. This is aimed at people who like a change and those who don\\'t like blocky textures from Mountains up close.\r\n\r\n[size=6]WHAT DOES THIS MOD DO?[/size]\r\n\r\nDramatic Mountains is an overhaul of all the Mountains. Its not a retexture, in fact it uses your current set of textures, so its actually a completely new way of rendering the Mountains. But also Lower Mountains are now snow-covered as well.\r\n\r\n[img]http://static2.nexusmods.com/110/mods/110/images/44199-1-1381758621.gif[/img]\r\n\r\nNot to be confused with \\\"parallax\\\" as used by mods like \\\"Vivid Landscapes - Rocking Stones and Mountains Parallax\\\" and \\\"Parallax Rocks and Mountains\\\", which really require ENB to use. This mod uses a graphics shader called Multi-layered (parallax) as used by the glaciers of Skyrim.\r\n\r\n(These are screen shots of when you are touching the surface of the Mountains. The camera/player has not been moved at all between screenshots and this is the same texture)\r\n[img]http://static1.nexusmods.com/110/mods/110/images/44199-1-1381748421.jpg[/img]\r\n \r\nSo here is my claim; this mod has up to 6 times the definition of any Mountain rock texture resolution you are running. It seeks to make Mountains the same resolution as the rocks that surround them (actually a bit better). Now before you scream \\\"snake oil salesman\\\", the effects of this is that the normal Skyrim method of snow settling on ledges is not used. Instead it has all new methods, so results in vastly different look to the Mountains. This will be a personal preference thing. Also the textures do not have normals (bump maps) directly applied to the usual texture, so the will look more flat. Its better to have Mountain textures with added detail to compensate. I have included an optional texture download that I have altered for this type of effect.\r\n\r\n(This is an in game screenshot, of a Rock and Mountain next to each other. You can see that Mountain textures are blocky because they are attempting to cover much larger models. Dramatic Mountains makes the resolutions the same, if not better)\r\n[img]http://static1.nexusmods.com/110/mods/110/images/44199-1-1381761165.gif[/img]\r\n\r\n[b]Icy Snow for Upper Mountains[/b]\r\n \r\n[img]http://static2.nexusmods.com/110/mods/110/images/44199-1-1381756142.gif[/img]\r\n\r\nThe Skyrim engine uses a particular directional material shader that is used to make snow look like its settled on the top of ridges and edges. The same for moss, sulfur and other materials applied to the top of models. Make no mistake this is a very well done part of the Skyrim Mountains. However this effect cannot be used with this mod. The Multi-layered effect of this mod does come with a type of directional shading, and then I\\'ve added a new directional decal for snow settling, but it is by no means the same. Once again this is a stylized look, its more dramatic snow covering. The advantage of this mod is that the snow/moss shaders that are used in vanilla Skyrim are basically solid colour low resolution decals. This mod changes that by having a high definition textures as well a parallax and refraction to give it a subtle depth. \r\n\r\n[img]http://static1.nexusmods.com/110/mods/110/images/44199-1-1381756957.jpg[/img]\r\n\r\nThere is another mod called \\\"Better Dynamic Snow\\\", which gives a high resolution texture to these snow decals. This mod is 100% compatible with it, in fact I\\'d recommend that you use it combination with this mod. However the effect with Dramatic Mountains is that snow has more substance. For the first time I\\'m going to throw in the term that\\'s its \\\"more realistic\\\". Its a break from the normally more powdered look of snow that settles on surfaces as seen in vanilla Skyrim. In this mod, water and snow is frozen to surfaces for a colder harsher looking environment. Also a great bonus is that because it is changeable due to lighting, in clear weather the Mountains have an icy sheen to them, and then in snowy/overcast weather the snow decals stand out more. In sunsets you will have subtle reds and at night a blue tint. It actually dynamically suits the weather.\r\n\r\n[size=6]INSTALLATION[/size]\r\n\r\nUnzip and copy and paste to your Skyrim data folder. Make sure the \\\"DramaticMountains.esp\\\" plugin is checked in your load order.\r\n\r\nThis needs to be at the bottom of the load order in order for it to be priority over some other mods that effect the Mountains, like \\\"Better Dynamic Snow\\\".\r\n\r\nYou may also install with a mod manager, like NMM. This will work just fine, manual installation is not required.\r\n\r\n[size=6]UNINSTALLATION[/size]\r\n\r\nUncheck \\\"DramaticMountains.esp\\\" plugin in your load order.\r\n\r\n[size=6]COMPATIBILITY[/size]\r\n\r\nThese are all new models and textures so nothing is overwritten. Turning this on or off in the data files will switch between vanilla and Dramatic Mountains, so makes it easy to test and simply turn off if you don\\'t like it.\r\n\r\nThe first version had problems with ENBs getting washed out, but this version should be much better. Because of the huge number of different presets users have with ENBs, I\\'ll wait for user feedback, to give a more official comment.\r\n\r\n[size=6]VIDEO REVIEW[/size]\r\n\r\nThanks to Nozi87 for the updated review.\r\n[youtube]Xsc_79kv63E[/youtube]\r\n\r\n[size=6]FREQUENTLY ASKED QUESTIONS[/size]\r\n\r\n[b]This must have retextures?[/b]\r\nIts more of a case that it applies other textures over the top of your existing textures. So you are free to try out different combinations to see what might work best for you.\r\nIMPORTANT! Because diffuse textures no longer have directly mapped normals (bump mapped), its better to have textures that have more contrast and added highlights to make them look less flat.\r\n\r\n[b]Why has Bethesda or some other modder not made Mountains that simply have more textures per piece to get better definition?[/b]\r\nWell the problem is that you end up seeing the pattern of repeated textures and they also lose the shape/shading that makes Mountains stand out at a distance. What this mod does, is that the overall shading is kept relatively intact by using the same size normal (bump mapping) for the Mountain pieces, while being able to condense the diffuse textures 6 times more than normal. This shading helps to hide the repeated patterns. I will say that the repeated patterns are noticeable at times, especially when viewing from above and at a distance. Because the normals are no longer mapped directly, the under surface can appear more flat. To compensated, really the diffuse textures themselves should be highlighted with more adding more shading and contrast to the actual textures themselves. I guess this is a call out for texture people to have a go at a few variations with this in mind. I will add that at viewing ranges that you normally wouldn\\'t notice the lower resolution in vanilla Skyrim, that potentially some overall detail is lost with this mod.\r\n\r\n[b]Users who have graphical settings set to Low or Medium[/b]\r\nFor those users who normally have lower graphical settings, the results will be simply amazing. You\\'ll have almost the same resolution as HD user and no performance cost. I would recommend that you get a HD textures for Mountains however for better results. Mountains are worth it.\r\n \r\n[b]People using 4096 textures[/b]\r\nThose that usually run 4096 textures will not have the same big gains in quality, because you already have more detail when up close. Actually if you can imagine that a 4096 is going to be at 6 times smaller, it ends up becoming too condensed! I will look at optimizing this mod for this resolution in the future.\r\n \r\n[size=6]KNOW ISSUES[/size]\r\n\r\nI have not set any special LOD for these new mountain models. Because of the way models get switched over at distance the transitions are very noticeable. I have spent some time on coming up with a best as possible solution, but at this stage I am not going to release anything until I have something I\\'m happy with.\r\n\r\nWhen any model overlays the lighter snow Mountain pieces the snow decal become very white and bright. This happens mainly with distant clouds and fog.\r\n\r\nWith the lower Mountain models you can still notice repeated patterns of the textures, especially from above viewing and in lower lighting. I am looking to make this less noticeable in the next release (0.3)\r\n \r\n[size=6]NOTES[/size]\r\n\r\nI\\'m making this a BETA version at the moment. There is a lot more I can enhance and I want to hear other peoples experiences to see if I should change aspects or fix bugs.\r\n\r\nThere is a lot of different things that I\\'d like to improve with this mod. Like the directional application of snow settling on ledges, the transition (amount of snow) between the low to high peaks, tweaking textures and shading, and better distant level of detail. I really want to make the upper Mountains a combination of Rocks and Snow, rather than the straight complete Snow cover.\r\nAlso adapting and testing for ENB users comprehensively. But I\\'ll wait to see if this mod is enjoyed before doing further work.\r\n\r\n[size=6]CREDITS[/size]\r\nRavanna for the snow texture, our resident professional modeller on my usual big mod project Skywind.\r\n \r\nIf you enjoy the new look and detail of the Mountains please endorse this mod. Happy Mountaineering! ",
  "categoryId": "78",
  "version": "0.2.2",
  "author": "happychappy",
  "createdUnix": "1381536184",
  "updatedUnix": "1381780388",
  "containsAdultContent": false,
  "uploadedBy": "snapmoderator",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000065811",
      "name": "Dramatic Mountains - Winter has come",
      "version": "0.2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17507",
      "fileName": "Dramatic Mountains - Winter has come-44199-0-2-2.rar",
      "uploadedUnix": "1381779681",
      "modVersion": "0.2.2",
      "virusScanUrl": "https://www.virustotal.com/file/776cc7a3c29719a2d53d7d1c0904af5b10ca4067a60bd0cd23fd75416fc72b59/analysis/1407756310/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dramatic%20Mountains%20-%20Winter%20has%20come-44199-0-2-2.rar?fid=1000065811&ttl=1535824855&ri=8192&rs=8192&setec=ed6729d15a333d09d1296d92d52f409b"
    },
    {
      "fileId": "1000065826",
      "name": "Bug fix for user who downloaded 0-2 and 0-2-1",
      "version": "0.2.2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "94",
      "fileName": "Bug fix for user who downloaded 0-2 and 0-2-1-44199-0-2-2.rar",
      "uploadedUnix": "1381780388",
      "modVersion": "0.2.2",
      "virusScanUrl": "https://www.virustotal.com/file/cd72fc782d3a1a2c45f62a2b8eb8aac07477ca52d8de28498a6ca81a4c34a59e/analysis/1407756315/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bug%20fix%20for%20user%20who%20downloaded%200-2%20and%200-2-1-44199-0-2-2.rar?fid=1000065826&ttl=1535824855&ri=8192&rs=8192&setec=93fbafc5953ac0a17f92848d0872fa30"
    }
  ]
}