{
  "modId": 44212.0,
  "modName": "Morrowloot",
  "summary": "Removes higher tier loot from leveled lists, and hand-places it back in the game&#33; Now you must explore like a proper adventurer. Artifacts from past games are added as well, including Hopesfire, Skullcrusher, and Wraithguard&#33;",
  "descriptionHtml": "DISCLAIMER: Trainwiz made this mod. He offered me to upload it here. \r<br />\r<br />DESCRIPTION\r<br />____________________________________________________________________\r<br />I can&#39;t be the only one who loathes Oblivion and Skyrim&#39;s levelled loot system in its entirety. What&#39;s the point of exploring when every single dungeon has randomly generated loot based off your level? And, after waiting to see if anyone shared my sentiments about this and fixed it, and seeing nothing, I decided to make my own. \r<br />Now, there are a few mods that de-level Skyrim&#39;s loot system. Mine&#39;s a bit different.\r<br />It says &#34;Loot system, nobody likes you&#34; and gets rid of it almost entirely. \r<br />Instead, it takes a Morrowind approach, and puts those armors and weapons out in the world. Now the player may actively explore places to discover objects, as they&#39;ll be hidden in dungeons (and logically hidden, so no more orc weapons in dwemer ruins), worn by people, and similar. It also tweaks a few things to encourage this aforementioned exploration.\r<br />\r<br />FEATURES\r<br />____________________________________________________________________\r<br />+Completely removes higher level (dwemer+) objects from levelled loot lists, though things like potions and scrolls can still be found.\r<br />+Adds these back in as static objects hidden around the world, and in logical places for example:\r<br />         -Dwemer equipment is only found in dwemer ruins and containers,; or by a select few who can afford it.\r<br />         -Orcish equipment is carried by, get this, orcs.\r<br />         -Elven equipment can be found in various places, though most are carried by Thalmor.\r<br />         -Glass equipment is given out to a few Morrowinders who managed to save some, as well as high ranking personnel in various factions.\r<br />         -Only a few sets of Ebony armor and equipment even exist, worn by nobles and the rich.\r<br />         -And finally, only a single normal set of daedric armor exists, much like Morrowind, but spread out and is a serious pain to find. You&#39;ll have to earn it.\r<br />+Higher level equipment may no longer be crafted&#33; Suck it up, it&#39;s weird that the Dragonborn suddenly gains magical star knowledge to craft insane soul-wrenching deatharmor anyways, and objects may still be improved at a forge.\r<br />+Higher level robes are removed, readded to the world as static objects\r<br />+While the majority of higher level generic random magical items (such as an Ebony Bow of Bolts) are gone, a few pieces will still exist, renamed and put in other areas. The rest you&#39;ll have to enchant yourself.\r<br />+Adds in artifacts from past games, such as:\r<br />   -Skullcrusher\r<br />   -Daedric Crescent\r<br />   -Lord&#39;s Mail\r<br />   -Scourge\r<br />   -King Orgnum&#39;s Coffer\r<br />   -Fang of Haynekhtnamet\r<br />   -Fists of Randagulf\r<br />   -Dragonbone Cuirass\r<br />   -Boots of Blinding Speed\r<br />   -Vampiric Ring\r<br />   -Eidolon&#39;s Ward\r<br />   -Stendarr&#39;s Hammer\r<br />   -Cyrus&#39; Saber\r<br />   -Chrysamere\r<br />   -Hopesfire\r<br />   -Wraithguard\r<br />   -Sunder\r<br />   -Seht&#39;s Legs\r<br />   -Threads of the Webspinner\r<br />   -Ice Blade of the Monarch\r<br />   -Goldbrand\r<br />\r<br />INSTALLATION\r<br />____________________________________________________________________\r<br />Copy these files to your Skyrim/DATA folder. In the loose files version, the mesh folder will merge with the mesh folder, the texture folder with the texture folder, etc. Then activate Morrowloot.esp in the launcher of your choosing. From here finding equipment is all up to you. Don&#39;t ask me, because I totally forgot where everything was. \r<br />I&#39;m not kidding I did.\r<br />\r<br />\r<br />COMPATIBILITY AND NOTES\r<br />____________________________________________________________________\r<br />As you might expect, this mod modifies a TON of stuff. The vast majority of interior cells have objects added to them, as do some exterior cells, though so far I&#39;ve found no real conflicts with the host of mods I&#39;ve been using. Some NPCs are also modified, though so far I&#39;ve encountered no errors.\r<br />This mod does NOT completely remove level scaling. It modifies it to be closer to Morrowind&#39;s style. Therefore you will find higher level potions and jewelry at higher levels, but equipment must be located on your own. Enemies (creatures and most bandits and similar) DO NOT have their stats changed. This mod doesn&#39;t touch them. If you want non-scaled enemies, I recommend getting another mod in addition to this.\r<br />This mod also modifies leveled item lists, so anything that modifies them will either be incompatible or will need to be merged via Wyre Bash. If you do not merge things, you will find higher tier loot either appearing where it shouldn&#39;t, or your new, modded items not appearing at all&#33; So merge. Seriously. Merge.\r<br />This mod modifies smithing recipes, getting rid of Daedric, orcish, glass, elven, AND dwemer recipes. Mods that modify those recipes will be incompatible, though mods that modify any other recipes, or add new ones, are fine. No I will not add these recipes back in, stop asking, no I will not add a quest, those recipes are gone, understand? Good.\r<br />Things added by mods, expansions, can all be crafted. You can make the arrows in Dawnguard, Dragonborn, anything from any mod, etc.\r<br />You just cannot make vanilla daedric, dwemer, glass, orcish, and elvish equipment. You can still however, improve it.\r<br />Not every dungeon has hand-placed loot in it, and even those that DO have handplaced loot do not neccesarily have good loot. Much like Morrowind, you&#39;re going to have to explore to find the good stuff.\r<br />Finally, stuff is HIDDEN. Some equipment is out in the open, but I&#39;ve placed stuff in nooks and crannies. You will have to search to find the better stuff.\r<br />\r<br />If you are using Complete Crafting Overhaul by kryptopyr, make sure that Morrowloot loads after CCO.\r<br />\r<br />TRANSLATION\r<br />____________________________________________________________________\r<br />German: [url=http://skyrim.nexusmods.com/mods/45671]http://skyrim.nexusmods.com/mods/45671[/url]\r<br />Italian:\r<br />[url=http://skyrim.nexusmods.com/mods/46584]http://skyrim.nexusmods.com/mods/46584[/url]\r<br />\r<br />\r<br />SPECIAL THANKS AND USAGE\r<br />____________________________________________________________________\r<br />For once, I&#39;m gonna have to be a dick about this, and say you need to contact me about using this mod in your compilation/work/cousin&#39;s birthday party. I mean, I&#39;ll probably say yes, but I want to keep track of what people will do with this.\r<br />Special Thanks to:\r<br />-Oriphier (Hakhnawibblewobble&#39;s Fang and Skullcrusher)\r<br />-Telthalion (Fists of Randagulf)\r<br />-TheMalfazar (Eledion&#39;s Ward and Auri-El&#39;s Shield)\r<br />-Ronniemagnum for his Eledion and Scourges\r<br />-Reaper for the Vampiric Ring\r<br />-Earrindo (Sunder)\r<br />-Insanity Sorrow and StarX (Hopesfire, Goldbrand, Ice Blade of the Monarch)\r<br />-Jured (Stendarr&#39;s Hammer)\r<br />-ArmoredThirteen (Daedric Crescent)\r<br />-Grimeleven for his animated effects overhaul, [url=http://skyrim.nexusmods.com/mods/41875/?]http://skyrim.nexusmods.com/mods/41875/?[/url]\r<br />-urbanshiv92 for Wraithguard\r<br />-Haishao for converting Stendarr&#39;s Hammer, Sunder and Wraithguard.\r<br />For allowing me to use their models and textures for this mod.",
  "categoryId": "92",
  "version": "4.0",
  "author": "Trainwiz",
  "createdUnix": "1381548689",
  "updatedUnix": "1391650033",
  "containsAdultContent": false,
  "uploadedBy": "Caithe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000064523",
      "name": "Morrowloot 4",
      "version": "4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "110622",
      "fileName": "Morrowloot 4-44212-4-0.rar",
      "uploadedUnix": "1381548049",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/387b0b8421a743faaf9fd1c93eefad74fd9f0ae2fdb0899e5e955795301ca527/analysis/1407752609/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morrowloot%204-44212-4-0.rar?fid=1000064523&ttl=1535824870&ri=8192&rs=8192&setec=30ec5d8585ad7b856ed37a6f77064c58"
    },
    {
      "fileId": "1000095499",
      "name": "Morrowloot Meshes Fix",
      "version": "4.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "639",
      "fileName": "Morrowloot Meshes Fix-44212-4-0-1.7z",
      "uploadedUnix": "1391650033",
      "modVersion": "4.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/e408fb19271014506b3a40e1c5d060081ad968b11d1f3f4f544b68584555a5ff/analysis/1407920043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morrowloot%20Meshes%20Fix-44212-4-0-1.7z?fid=1000095499&ttl=1535824871&ri=8192&rs=8192&setec=17c270be4dfb682f42a192a1ac035f96"
    }
  ]
}