{
  "modId": 44216.0,
  "modName": "The Asgardian God Race",
  "summary": "Crazy fast swing speed \r\nOdin\\\\\\'s blessing\r\nGodly Strength ",
  "descriptionHtml": "Inhabiting the Nine Worlds in the other-dimensional Asgardian system are six races of humanoid life forms. Each race is different and intelligent, but the most powerful race is that of the Gods. \r\n\r\nThe gods possess superhuman abilities such as super strength and superhuman endurance. An average male god can lift up to 30 tons while an average female can lift up to 25 tons, but there are those that exceed these specifications. The Gods are also gifted with extremely long life, but are not immortal like the gods of Olympus. They are also immune to all terrestrial diseases and are highly resistant to conventional forms of injury. \r\n\r\nThor\\\\\\'s Armor is here at \r\nhttp://skyrim.nexusmods.com/mods/25709/? \r\n\r\nThis a great worldscape for your Asgardian\r\nAsgard - Kingdom of the Gods by Saint Grimm\r\nhttp://skyrim.nexusmods.com/mods/44421/?\r\n\r\n\r\nHave fun in Skyrim \r\nPlease Rate and Enjoy as always \r\n\r\nThank you Gamespot for featuring my mod as a top 5 of the week \r\n\r\n\r\nA little history \r\n\r\nAccording to Asgardian legend, in the beginning there was nothing, but in time two worlds came into being on opposite sides of the void. The one to the north was named Niflheim, a world of clouds and shadows in whose center surged the fountain Hvergelmir, from which flowed twelve rivers of ice. The one to the south was named Muspelheim, which teemed with rivers of fire. Eventually the warm air from the south carved out the frost giant Ymir from the ice in the north. Ymir became the father of all the giants, and his cow Auðumbla licked out of the ice the first Asgardian, Buri. Buri had a son named Borr, who married the giantess Bestla. Borr and Bestla had three sons named Odin, Vili, and Ve, who were known as the Æsir. Odin and his brothers grew to hate the giants and slew Ymir, and his blood formed a great sea. Odin and his brothers then raised Ymir\\\\\\'s body from the sea and created Midgard between Niflheim and Muspelheim. With Ymir\\\\\\'s bones they created mountains, and with his hair they created trees. They then raised Ymir\\\\\\'s skull upon four pillars to create the heavens. Within the skull contained sparks from Muspelheim, which became the sun, moon, and stars. When Midgard was complete, Odin and his brothers created a home for themselves above it called Asgard. Between the two worlds they stretched a rainbow bridge and called it Bifröst.\r\n\r\n\r\n",
  "categoryId": "34",
  "version": "Latest",
  "author": "KalEltheKryptonian",
  "createdUnix": "1381548697",
  "updatedUnix": "1381548685",
  "containsAdultContent": false,
  "uploadedBy": "KalEltheKryptonian",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000064542",
      "name": "Asgardian",
      "version": "Latest",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Asgardian-44216-Latest.rar",
      "uploadedUnix": "1381548685",
      "modVersion": "Latest",
      "virusScanUrl": "https://www.virustotal.com/file/6a5834eafe2982c1377a383d8c665082c5d1b3c807b0fe4a37b60e0c2bdb1581/analysis/1407752764/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Asgardian-44216-Latest.rar?fid=1000064542&ttl=1535824873&ri=8192&rs=8192&setec=28a40d03a9c9d733b8444955a688d981"
    }
  ]
}