{
  "modId": 44221.0,
  "modName": "breezehomenewlocation",
  "summary": "New to modding but thought to start off with something simple and big. I reworked breezehome to a new location and design to match that of the house. This house is simple and family oriented (Hearthfire is required). Read description as to why.",
  "descriptionHtml": "[size=4]Because of life I have not been able to get back to modding. Feel free to do as you wish with this mod. Just please give credit were credit is due. Thanks[/size]\r<br />\r<br />\r<br />After looking at the breezehomes none worked for me. Either too big, to small, or just made no sense. After reading some posts from people on other mods and looking at videos on how to connect the house to the world I had an idea. Why not just move the door to another house, I tried it and it worked so problem solved, but I wasn&#39;t happy just yet. After doing some thinking and how wonderful Frostfall is I thought how can a house be warm with no insulation? It&#39;s not perfect but it gets the job done.\r<br />\r<br />Another idea after wanting a fire pit was to add a smoke stack to the whiterun buildings, but how can I to make it lore friendly, well they have metal and they can make simple pipes and there you have it. \r<br />\r<br />About the house.\r<br />\r<br />The house may look like it doesn&#39;t have a lot of objects but that&#39;s because I wanted it that way. Most of the markers that the children use in Hearthfire are piled in the middle of the house so thus why there is only a few objects. I was also looking for a good sized simple home. I chose to move the location because the current one allowed very little room to add a home since the homes are prebuilt. The NPC&#39;s use the doors that are theirs and a picture shows Lydia sleeping so they will move in most of the house. \r<br />\r<br />Things that are done.\r<br />\r<br />1. Bottom of book shelf has been fixed and is now working.\r<br />2. Severio Pelagias&#39; House has been resized to the house he&#39;s in now.\r<br />3. Alchemy lab has been added so now you can purchase that or the child bedrooms.\r<br />    a. There are three shelves for potions that are linked to chests, they are called heal potions, stat potions, poison potions. Also a book shelf added that is labeled alchemy books and recipes. I added a barrel that is labeled ingredients to make it easy.\r<br />4. New Items\r<br />    a. Added a few barrels into the kitchen (meat barrel, fruit barrel, vegetable barrel, salt barrel) these are also set up for no respawning.\r<br />    b. Added a safe inside the bedroom that is non respawning.\r<br />    c. The living room design is mostly dependent on if you purchase the alchemy set or the child bedroom set. I fixed the navmesh so the NPC&#39;s will prefer to go around the table and chairs for the alchemy set. If you purchase the children set they will still follow like the table and chairs are still there but the navmesh is there and working so you can make them sit down in the chairs. Just the other route is set to being preferred.     \r<br />5. I also added a wall weapon rack in the bedroom cause it just looked to plane and mounts just didn&#39;t fit right.\r<br />6. The outside of the player house should not disappear during/after the civil war, so far updating the mod has not emptied the containers but I&#39;m still not sure, if it does please tell me.  \r<br />\r<br />Still problems that I know off.\r<br />1. So far starting a game before owning the house works fine but loading an old save with the house purchased seemed to make things disappear.\r<br />2. Still working with a new save. My old saves have been messed up so loading and testing with those was no option for me.\r<br />3. if you have the old file and have things inside the house you will need to remove them before using this file. I changed the types of containers so most are new and will delete the old ones.\r<br />4.The door for Severio Pelagias&#39; House will disappear. The house and him were meant to die during the civil war, still working with this. \r<br />\r<br />Reasons behind the house.\r<br />\r<br />Q: Why is there no enchanting, or smithing stations?\r<br />A: Because smithing can happen at the blacksmith, the enchanting can happen at dragonreach or anywhere depending on the mod you have loaded. I wanted a simple home.\r<br />Q: Will it work with mods?\r<br />A: Read mod section.\r<br />Q: Why choose his house and no one else&#39;s house?\r<br />A: I wanted to be close to the blacksmith and stores.\r<br />\r<br />Mods.\r<br />\r<br />This mod was worked around the Ultimate Whiterun by Captain Swoop mod but does not need it to work. There is no problems so far on my end running that mod with mine. So far as I know as long as there is no mod that changes these locations inside whiterun itself everything should work fine.\r<br />\r<br />Mods that are in the pictures.\r<br />\r<br />Ultimate Whiterun by Captain Swoop\r<br />Frostfall - Hypothermia Camping Survival by Chesko\r<br />XCE - Xenius Character Enhancement by Xenius\r<br />Immersive Armors by hothtrooper44\r<br />SkyUI by SkyUI Team",
  "categoryId": "67",
  "version": "",
  "author": "SGCJackal",
  "createdUnix": "1381556733",
  "updatedUnix": "1381965590",
  "containsAdultContent": false,
  "uploadedBy": "SGCJackal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000064621",
      "name": "Breezehome new location V1",
      "version": "v1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "33",
      "fileName": "Breezehome new location-44221-v1.zip",
      "uploadedUnix": "1381556581",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/1093e037e38798d53d359af06403f153208aa8c293db1d3808c565425d3fbf08/analysis/1407752961/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20new%20location-44221-v1.zip?fid=1000064621&ttl=1535824877&ri=8192&rs=8192&setec=f96e20bd02d5bfe23fa3b06cfd9457de"
    },
    {
      "fileId": "1000066879",
      "name": "Breezehomenewlocationv1_2",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "41",
      "fileName": "Breezehomenewlocationv1_2-44221-.zip",
      "uploadedUnix": "1381965520",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/54f68f2526a47d8bfdbd338038f8d58b734cda73c7986a10bf28d3ed7b13dfba/analysis/1407758230/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehomenewlocationv1_2-44221-.zip?fid=1000066879&ttl=1535824877&ri=8192&rs=8192&setec=ec513a799ada015f0d555b0cf8c6096f"
    },
    {
      "fileId": "1000066881",
      "name": "Breezehomenewlocationv1_1",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "36",
      "fileName": "Breezehomenewlocationv1_1-44221-.zip",
      "uploadedUnix": "1381965590",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d949b15884f24d65c744456ede1c1398e5753f8fbec83cf831fca9434c368199/analysis/1407758343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehomenewlocationv1_1-44221-.zip?fid=1000066881&ttl=1535824878&ri=8192&rs=8192&setec=d4fa0b483b28c02a90e11f0ec5144f90"
    }
  ]
}