{
  "modId": 44267.0,
  "modName": "Book Covers PSD - Modders Resource",
  "summary": "Every single unique texture from Book Covers Skyrim in easy to use PSD format for you to modify for books in your mods. Use in conjunction with Better Book Mesh.",
  "descriptionHtml": "[img]http://www.dcoffey.co.uk/images/bookcoversskyrim/BCP_Banner.jpg[/img]\r\n\r\nThis is an archive of every unique cover that was used in the [url=http://skyrim.nexusmods.com/mods/35399]Book Covers Skyrim[/url] mod in a clean and easy to use Photoshop PSD format. The textures are designed to work with the [url=http://skyrim.nexusmods.com/mods/37113]Better Book Mesh[/url] resource as an easy way to create a high quality texture and model for every book in your own mod. They are based on a 1024x512 image size. There is no practical need to make them larger (2048x1024) as the in-game books are fairly small and the _n.dds normal map would become uneconomically large.\r\n\r\nSince I have no idea which fonts you will want to use on your own books, I have taken all the text off the covers. The best source for fonts will be [url=www.dafont.com]www.dafont.com[/url] where you can search amongst thousands of completely free fonts. I should add that since they are free the kerning may be a bit rough and some characters such as punctuation may be missing.\r\n\r\nI have also removed all the decoration, grunge, dirt, scratches and stains from the covers since many of those resources have \\\"no redistribution without credit\\\" clauses or were paid-for Commercial stock that I had purchased and cannot upload elsewhere. I would advise that you Google for free Photoshop shapes and brushes from sites such as [url=http://www.deviantart.com]www.deviantART.com[/url] although you should check the owner\\'s terms. Some owners require credit before use and others want their work to stay inside deviantART.\r\n\r\nIn short, these covers are clean, neat, tidy and ready to MODIFY.\r\n\r\n===\r\n\r\nSo what can you do with these covers then?\r\n\r\nWell they can be modified in any version of Photoshop (probably from Photoshop CS onwards) since they contain no Smart Objects or filters. There is a neutral background behind each book to show you where the edge of the texture should be. You will also see a set of handy Guide Lines which match exactly the layout of the [url=http://skyrim.nexusmods.com/mods/37113]Better Book Mesh[/url] template.\r\n\r\nOnce you have chosen a cover that matches the content of your book, you should think about whether the basic colour meets your needs. Use a Hue/Saturation adjustment layer to change the base colour, lightness or saturation of the texture. Perhaps a Photo Filter might be appropriate in some cases.\r\n\r\nSelect the font that fits your book. You may find that a slight \\\"Emboss - down\\\" Layer Style makes it look like the words have been tooled into the cover. See if reducing the Fill Opacity makes the text look a little worn by allowing the colour of the cover to show through the letters somewhat.\r\n\r\nDoes your book need decorations? There are many good free Photoshop Brushes available on deviantART which can make your book look special. See the credits I posted on the [url=http://skyrim.nexusmods.com/mods/35399]Book Covers Skyrim[/url] mod for inspiration and check the cover of \\\"Confessions of a Dunmer Skooma Eater\\\" to see how they can enhance your cover.\r\n\r\nSince these covers are all clean, you will certainly want to have a look at dirt, stains and scratches to make them feel more real. If the book came from a mage\\'s library it might realistically be completely new and clean but if it is found on a Bandit\\'s corpse in the bottom of a waterlogged dungeon, it will be mucky, damp and mouldy. Just avoid bright red arterial blood stains - make them dark and brown. Play about with Blend Modes with your grunge brushes. You may find that Colour Burn at 15-25% looks effective. While Colour Burn darkens colours underneath it, Colour Dodge will lighten and bleach. Maybe an Emboss Layer Style with a low Fill Opacity? This can make books look deeply gouged or pock-marked. The Five Far Stars and On Apocrypha - Prying Orbs are good examples of this technique.\r\n\r\nOnce you have got your cover texture looking just how you like it, you have to consider the Normal Map. This dictates the shininess and 3D appearance of the cover when viewed from an angle.\r\n\r\nThere is an nVidia PSD to DDS conversion tool which can be a great time saver but it has its limitations. You can seriously improve your normal map by creating an intermediate Height Map. The simple rule is that white is shiny and sticks up while black is dull and is recessed down. If the text on your cover is supposed to be bright gold but tooled down into the leather, you will want to make it black in your Height Map. This will make it appear carved into the cover.\r\n\r\nIf you don\\'t have access to the nVidia DDS Conversion Tool, you can use CrazyBump and GIMP to achieve the same result.\r\n\r\nWhen using these covers, let your imagination run wild. Don\\'t just paint your text or decorations flat onto the cover. See how they would look with a little Bevel or Emboss. Would a blend mode enhance the effect? A little less Opacity? Add some noise with a Filter? With a bit of playfulness and experimentation, your covers can look stunning!\r\n\r\n\r\n[img]http://www.dcoffey.co.uk/images/bookcoversskyrim/BCS_Credits.jpg[/img]\r\n\r\nThese covers have come from a variety of sources, the principal of which is Phoenix Amon\\'s covers from Oblivion. They have all been cleaned, tweaked and resized to fit the template required by the Better Book Mesh mod. Since it is quite hard to tell which cover comes from which author with this many in the resource, it would be far simpler for you to just include this standard credit list in your mod...\r\n\r\n[b]Phoenix Amon (Daleth)[/b], without [url=http://oblivion.nexusmods.com/mods/5570]Book Jackets: Oblivion[/url] the Book Covers Skyrim mod would not exist.\r\n[b]Grimbot[/b] for [url=http://oblivion.nexusmods.com/mods/16247]Grimbots DLC Book Jackets[/url] for Oblivion.\r\n[b]Metallicow[/b] for his book textures and his resources.\r\n[url=http://www.fuzzimo.com]www.fuzzimo.com[/url] for the Free Stock worn fabric book cover textures.\r\n\r\n\r\n[img]http://www.dcoffey.co.uk/images/bookcoversskyrim/BCS_Permission.jpg[/img]\r\n\r\nYou don\\'t need ask me for permission to use the contents of this mod for any reason. You have it.\r\n\r\nYou can add to, subtract from, alter, enhance, embellish, patch, improve to your hearts content. I only request three things in return.\r\n\r\n1) You acknowledge the work I\\'ve done, and the work of those that I have credited. Rome was not built in a day and neither are mods. We all stand on the shoulders of those who came before us. Give credit where it is due.\r\n\r\n2) Let me know what you have done. I am excited to see what more talented people than I can do to improve this mod.\r\n\r\n3) Keep the distribution on the NEXUS Network. I am not a big fan of Steam. I like complete control of my computer. Steam feels to much like Orwell\\'s \\\"Big Brother\\\". I tolerate it but I don\\'t like it. My heart and soul are with the NEXUS community, it\\'s creators, and it\\'s contributors. I appreciate all that they have done to enhance the games I love to play. This is my way of saying Thank You.",
  "categoryId": "82",
  "version": "1.0",
  "author": "DanielCoffey",
  "createdUnix": "1381601299",
  "updatedUnix": "1381600336",
  "containsAdultContent": false,
  "uploadedBy": "DanielCoffey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000064867",
      "name": "Book Covers PSD",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "127388",
      "fileName": "Book Covers PSD-44267-1-0.7z",
      "uploadedUnix": "1381600336",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5c62f792df297a0b5daa3506584492e42a7cea3eb47d93fb51aeb724b369c085/analysis/1407753698/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Book%20Covers%20PSD-44267-1-0.7z?fid=1000064867&ttl=1535824911&ri=8192&rs=8192&setec=cc01f16b2922de6e59a2f666620c3982"
    }
  ]
}