{
  "modId": 44273.0,
  "modName": "Whitewatch Tower Redux",
  "summary": "A recreation of Whitewatch Tower, North of Whiterun, for the Thane&#39;s Player Home.",
  "descriptionHtml": "Whitewatch Tower is remade, a location North of Whiterun already there with a scripted bandit attack. For the northernmost outpost for Whiterun to defend against the threats of the Pale, I desired to bolster its own defenses, with a few new walls and a liveable tower. \r<br />\r<br />Outside, along with the walls, I attempted to give the illusion that it, like Whiterun, was bigger or more formidable in the past, with now crumbling battlements, and the idea that there was once a ceiling to the tower (where an overgrown throne for the former Thane still resides). A blacksmith&#39;s tools are at the ready, along with chickens and a garden, which would make the already-present guards quite happy. \r<br />\r<br />Inside the Whitewatch Keep, there&#39;s a small 2-story Player Home that&#39;s a tad smaller than the proper home in Whiterun, but nice nonetheless. You can imagine the Jarl had placed the skull of your first dragon kill over the doorway&#33; There are functioning weapon racks, cookery, display case, enchantment and alchemy tables, but no open bookshelves or manikins. Bookshelves hate me. \r<br />\r<br />There is also a ladder down to the basement, which tunnels down into a Nordic ruin, where the secret of the last Thane resides; an ancient meeting ground for Skyrim&#39;s sect of the Mythic Dawn, where the bodies of the deceased are laid to rest, close to a portal that retains a shard of Mankar Camoran&#39;s Paradise&#33; Fight the Daedra guarding the sliver of Oblivion and collect your own copies of Camoran&#39;s Commentaries of the Mysterium Xarxes. \r<br />\r<br />All chests in the keep and basement are safe for storage, both should be properly navmeshed for a player home. The banditry outside respawns in accordance to the regular Whitewatch timer (ten days).\r<br />\r<br />-- INSTALLATION: Thankfully just one file to extract from the .RAR, and place in your Skyrim &gt; Data folder. Groovy.\r<br />\r<br />Thank you for checking it out, and I hope you enjoy&#33; \r<br />\r<br />UPDATE FILE: Ver 1.1 is a cleaned file by the kind KineticKat, as to no longer affect unrelated cells. ",
  "categoryId": "67",
  "version": "1.1",
  "author": "ClefJ",
  "createdUnix": "1381599348",
  "updatedUnix": "1392492203",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000064854",
      "name": "Whitewatch Keep",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "157",
      "fileName": "Whitewatch Keep-44273-1-0.zip",
      "uploadedUnix": "1381599198",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/94111f1f5f5cfa6ad6454f79e2289f0d81b12452886e4495badb66863182f3e2/analysis/1407753665/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whitewatch%20Keep-44273-1-0.zip?fid=1000064854&ttl=1535824916&ri=8192&rs=8192&setec=183a44b3b6464be19dd01b77d5bb91fc"
    },
    {
      "fileId": "1000097226",
      "name": "Whitewatch Tower Redux 1_1",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "155",
      "fileName": "Whitewatch Tower Redux 1_1-44273-1-1.zip",
      "uploadedUnix": "1392492203",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/360a0cb454950ecfef2f7cc7c296a77357292753437337809c26806cc41f463e/analysis/1407934992/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whitewatch%20Tower%20Redux%201_1-44273-1-1.zip?fid=1000097226&ttl=1535824916&ri=8192&rs=8192&setec=a2aa35c7158230a495d9b96b9d8590aa"
    }
  ]
}