{
  "modId": 44291.0,
  "modName": "Red Eagles Sword Replacer and Craftable Reachmans Swords",
  "summary": "This sword replaces the bland and uninspiring vanilla Red Eagle\\'s swords with an appearance that is more befitting of Red Eagle\\'s legacy as a fierce warrior-king of The Reach. It also adds craftable and temperable versions of the sword in a 1h and 2h model.",
  "descriptionHtml": "[i]\\\"A thousand foreigners fell before his flaming sword, and the enemy was routed. Yet, when night fell, so too did he.\\\"[/i]\r\n\r\nThis mod changes the appearance of [u][b]Red Eagle\\'s swords (Fury & Bane)[/b][/u] from the ugly and boring Ancient Nord Sword model to something a little more savage and Forsworn-feeling. It also changes the model of the two-handed sword that Red Eagle wields in his draugr form and [b]adds craftable and temperable non-enchanted versions of the sword[/b] in one and two-handed form.\r\n\r\nI have also made slight tweaks to the inner-workings of the swords. Their base damage has been buffed to that of [b][u]Ebony equivalent[/u][/b] swords and the enchantment on Red Eagle\\'s Bane is something that is a bit more appropriate for a long quest reward, mini boss fight and several loading screens! This also makes the weapons viable for end-game content.\r\n\r\nThe tempering material for the blades has also been changed to a [b][u]Briar Heart[/u][/b], to better reflect the power that made Red Eagle so formidable in his final battle and adds more Reach Native flavour to the swords.\r\n\r\nThe craftable swords can be found under the [u][b]steel smithing[/b][/u] section and are forged using combinations of iron, steel, leather strips and goat hide (another Reach-centric ingredient).\r\n\r\n[b][u]Install & Uninstall:[/u][/b]\r\n\r\nTo install the mod via NMM; click to download and activate the mod in your programme. To uninstall; click the mod off in the programme, create a new save and play as normal.\r\n\r\nTo install manually; unzip the file, and place the Data folder in your Skyrim folder (typical path - Steam/steamapps/common/Skyrim/Data). To uninstall; remove the \\'Red Eagle\\'s Swords replace & craft.esp\\' from your Data file along with the Eagle and Eagle1handSmaller.nif files in your Meshes folder, create a new save and carry on.\r\n\r\nLoad Order: I would probably suggest placing this mod after any texture packs you use (particularly weapon ones), as the appearance of the weapons will change according to the textures you use.\r\n\r\nAs always, if you experience any problems with the mod, let me know and I will try to help.\r\n\r\n[b]A big thank you to [url=http://skyrim.nexusmods.com/users/3297180/?]ghosu[/url] who helped me with making the mesh files for the weapons. Please, if you like this mod, check out the mods on his page and hit him with a \\'Kudos\\'![/b]",
  "categoryId": "36",
  "version": "1.0",
  "author": "Ghosu and Rob_the_Bob",
  "createdUnix": "1381693639",
  "updatedUnix": "1381693339",
  "containsAdultContent": false,
  "uploadedBy": "rcarass1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000065401",
      "name": "Red Eagle Swords replacers and craftables",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "141",
      "fileName": "Red Eagle Swords replacers and craftables-44291-1-0.rar",
      "uploadedUnix": "1381693339",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0758921a77e655eb60aa7c8e8266a81e5a2a34afe8fe1180bcbd2b36ca59447b/analysis/1407755065/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Red%20Eagle%20Swords%20replacers%20and%20craftables-44291-1-0.rar?fid=1000065401&ttl=1535824932&ri=8192&rs=8192&setec=e2b9d1ab79cc6cb308732c5e0016faff"
    }
  ]
}