{
  "modId": 44298.0,
  "modName": "Dovahkiin Sanctuary",
  "summary": "Due to Lack of enthusiasm on nexus this is not the latest version and My other mods will not be published here, feel free to find me on steam. Seven new player homes, one in Falkreath (Sanctum) one in Dawnstar, winterhold, Morthal, Rorikstead (with stables), Riverwood and a hut in Iverstead. Over 200 Mannequines, hundreds of weapon racks, hundreds ",
  "descriptionHtml": "Due to lack of enthusiasm, endorsements etc this is not the latest version and my other mods will not be published here. feel free to find me on steam where I feel more appreciated.\r\nSeven new player homes, one in Falkreath (Sanctum) one in Dawnstar, winterhold, Morthal, Rorikstead (with stables), Riverwood and a hut in Iverstead. Over 200 Mannequines, hundreds of weapon racks, hundreds of usable shelves and all workshop facilities. There are five housecarls, a vendor and an extremely fast horse, I mean like stupidly fast, so fast you have to be careful not to fly. There is a retutrn to sanctum spell. \r\n\r\nUnderneath the Sanctum In Falkreath is a very big area designed to house a collection of eight hundred and seventy five skulls, this could now be used as a library if the Dovahkiin has decided not to collect these skulls (not included with this mod). \r\n\r\nThe Seven player homes are connected to the existing player homes in the game via a transit area. The transit area conatins mannequines weapon racks and storage and is also connected to four seperate armories and a fully equiped workshop with all the crafting essentials and yet more storage on a warehouse scale. \r\n\r\nThe new homes contain curios and some unusual armor and weapons including A usable ancient giants Club (now fossilised) from the giants of old who possesed magic, It has advantages of massive damage plus massive frost damage and lightning fast speed, an Ice Crown, some ebon-Ice Armour and a usable set of exicutioners garb. There are many other curios of interest to be found. \r\n\r\nThis should be compatible with Dovahkiin hideout mods, Collectors Vault and most house conversion mods. \r\n\r\nI was making an extensive quest to go with this but Bethseda have changed some programming which aparantly can be sorted but not realy so I have given up on that until they fix it, until then you might find a charactor or two around who weren\\'t there before, don\\'t worry they don\\'t mess with any other mods, If they start talking please let me know as that would mean Bethseda have sorted the problem and i can get on with some other projects. That aside this is a pretty neat mod as it stands, it makes me want to start a new playthrough, so I will. :) \r\n\r\nI recomend using the mod \\'Unlimited Bookshelves\\' to make the most of the ample book shelves here and the working tables. \r\n\r\nA known Issue: \r\nApparently the following mod fixes the problem of compatability with Hearthfires Breezehome and this mod: v2.7 http://steamcommunity.com/sharedfiles/filedetails/?id=173017115&searchtext=v2.7+BreezehomeTNF-Hearthfire",
  "categoryId": "67",
  "version": "",
  "author": "Gillan2020",
  "createdUnix": "1381608327",
  "updatedUnix": "1381608309",
  "containsAdultContent": false,
  "uploadedBy": "Gillan2020",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000064922",
      "name": "DovahKiin Sanctuary",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "720",
      "fileName": "DovahKiin Sanctuary-44298-.rar",
      "uploadedUnix": "1381608309",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/25393b316551b61f81417e7ab77b56816db9168a2dd30ac1fc0b59cbeac01a7e/analysis/1407753865/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DovahKiin%20Sanctuary-44298-.rar?fid=1000064922&ttl=1535824935&ri=8192&rs=8192&setec=590ca7fc7f74d40277b42f82806760e9"
    }
  ]
}