{
  "modId": 44307.0,
  "modName": "Caele",
  "summary": "Brutal and sometimes beautiful daughter of the Cold North, Caele is a fully voiced, standalone companion with a quest and a real personality.",
  "descriptionHtml": "[center][img]http://i.imgur.com/vjKIfQ7.png[/img]\r<br />\r<br />A Skyrim Companion mod by Antiscamp and Whiteflowerwoman\r<br />\r<br />Version 1.1[/center]\r<br />\r<br />\r<br />\r<br />\r<br />Brutal and sometimes beautiful daughter of the Cold North, Caele is a fully voiced, standalone companion with a quest and a real personality.\r<br />\r<br />Caele has a hard exterior but a soft heart. She wears warpaint rather than makeup, so no pretty little shiny photo model here, no-no. She is a bit paranoid and thinks the rest of the world is out to get her, but she will treat her friends like royalty. She enjoys a good fight (maybe a little too much&#33;) and getting drunk. She has a lot of political opinions about the state of Tamriel.\r<br />\r<br />Caele is a mature, real woman. Her mother died when Caele was young, and she was raised by her father, who was a hardened veteran of the Great War. Caele found religion and joined the Talos Cult. She was appalled by the conditions for Talos Worship in Skyrim, she left for Cyrodiil. There, she fought alongside and trained with the best of the best at the Temple of The Warrior Monks near Bruma. She uses strong language from time to time. Deal with it.\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/HDmI1EN.png[/img][/center]\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/Hf4dVvK.png[/img][/center]\r<br />\r<br />Caele is a standalone companion. No other mods are required to run this mod. None of the Skyrim DLC are required.\r<br />\r<br />Install either through the Nexus Mod Manager or manually. If installing manually, from the ModDB download, for an example, copy the files found in the downloaded .zip file into your Skyrim/Data folder. Make sure Caele.esp is ticked in the Skyrim Launcher before playing. Caele is waiting for you at The Dead Man&#39;s Drink in Falkreath.\r<br />\r<br />\r<br />\r<br />[center][youtube]l6DnAqFhOmc[/youtube]\r<br />\r<br />Thanks, Slothability for this video&#33; The first YouTube presentation to feature Caele.[/center]\r<br />\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/9LBfasw.png[/img][/center]\r<br />\r<br />Caele is indeed compatible with both AFT and EFF. In fact, I recommend using AFT, even. I have not tried testing her with any of the other follower mods such as UFO. An area is added outside Helgen, but Caele seems to work well with Helgen Reborn. A dungeon entrance is added just north of the thalmor Embassy.\r<br />\r<br />Please report your own experiences in this department and any bugs or glitches found with Caele.\r<br />\r<br />Caele still retains her &#34;Follow me. I need your help.&#34; command although she&#39;s already following. Clicking it will result in a &#34;You&#39;ve already got a follower&#34; response from her, but not cause her to leave. I still don&#39;t know yet why the dialogue option isn&#39;t removed when she&#39;s following.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/vnZWASC.png[/img][/center]\r<br />\r<br />Having toyed around a bit with creating followers and companions back when modding Oblivion, I had always thought of creating my own follower for Skyrim as well. I was kind of disappointed in the kind of followers I found for download; they all seemed to be crafted at the same forge. Beautiful, yes, but without content and no personality whatsoever. Plastic. Vilja changed that, in Oblivion and in Skyrim. When the Vilja mod came around, I ended up loving it and never went anywhere without her and many of my ideas for Caele came from hours and hours of long adventuring with Vilja alongside. Dawnguard also supplied us with an official Companion of really high standards, Serana, who also became an inspiration for Caele. \r<br />\r<br />I drafted the idea with my wife to create an own detailed companion and she agreed to do the voice acting. The idea was to create a companion fashioned after Serana in functions and Vilja in personality. The idea with Caele is therefore to have a companion that works pretty much like the vanilla companions, like Serana, without Viljas detailed menus and functions, BUT with a level of personality and reality resembling Vilja&#39;s. It was also important to me to give the character a quest to do alongside the player, since that sets her background quite nicely and truly makes her into a real person in the player&#39;s mind.\r<br />\r<br />We are planning to expand on Caele and she has some bright future plans. First off, will be actually continuing her storyline and in the continuation make her marriable. She will also become more quest-aware. As of now, she doesn&#39;t comment on the vanilla quests much. Also, we&#39;d like to make additions for both the Dawnguard and Dragonborn expansions. Especially Dawnguard-support would be interesting and see her interact with Serana.\r<br />\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/jfc4L7m.png[/img][/center]\r<br />\r<br />Antiscamp did the Creation Kit work.\r<br />Whiteflowerwoman did the voice acting.\r<br />\r<br />Our innermost Thank You and gratitude to the following modders who agreed and permitted us to let us use their work in the creation of Caele&#39;s barbaric and beautiful looks.\r<br />\r<br />HothTrooper44 for Caele&#39;s barbarian armour from his Immersive Armors. http://skyrim.nexusmods.com/mods/19733/\r<br />Thanks also to Exeter and Rahman530 for their work on the UNP versions of this armour.\r<br />Zzjay for Caele&#39;s Celtic Circlet found in KDCirclets Redone by zzjay. http://skyrim.nexusmods.com/mods/27064/\r<br />Apachii for Caele&#39;s red hair featured in SkyHair. http://skyrim.nexusmods.com/mods/10168/\r<br />LogRaam for Caele&#39;s light blue Eyes from The Eyes of Beauty. http://skyrim.nexusmods.com/mods/13722/\r<br />Dimon99 for the Dimonized UNP Female Body and DIMface2 facial textures Caele uses. http://skyrim.nexusmods.com/mods/6709/\r<br />\r<br />Furthermore, we&#39;d like to thank Deck16 whose tutorial on the creation of a voiced character in Skyrim we followed when making Caele. http://deck16.net/post/22645519500/making-a-unique-voiced-follower-in-skyrim-part-1\r<br />\r<br />Thank you (again&#33;) to Tamira for beta testing. She&#39;s been a really faithful beta-companion since Dibella&#39;s Watch. :)\r<br />\r<br />Thank you to Bethesda for a great game, thank you to NexusMods Skyrim and ModDB for hosting and thank you to all of the excellent, friendly Elder Scrolls Community. We&#39;re proud to be a part of all of this&#33;\r<br />\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/ppcgyDc.png[/img][/center]\r<br />\r<br />If you want to mod Caele and release your work, we ask that you send us a PM (so we can also link to your mod&#33;) and of course credit us and link back. We ask that Caele and any derived mods are NOT uploaded anywhere else such as Steam Workshop. All the resources mentioned in the Credits section of this ReadMe are owned by their respective creators. This mod is published only at NexusMods Skyrim and ModDB and is exclusive to these.\r<br />\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/Uc3jyC2.png[/img][/center]\r<br />\r<br />Sept-Oct Limited Beta Release 0.1 and 0.2\r<br />\r<br />12 October 2013, 1.0 Initial Official Release\r<br />\r<br />15 October 2013 1.1\r<br />\r<br />*Moved Caele&#39;s &#34;Follow me&#34; option into her CaeleFollowerQuest, which improves her recruitment procedure. She should now be fully compatible with AFT, UFO and EFF.\r<br />*Made a new Voice Recording for recruitment.\r<br />*Fixed glitching enemy soldiers popping up in wrong locations.\r<br />*Gave her skin texture sets so she now dresses well in all sorts of armours.\r<br />*Cleaned Identical To Master records with TesVEdit.\r<br />\r<br />\r<br />Antiscamp, http://frontierskyrim.wordpress.com/, antiscamp@gmail.com, Sept-Oct 2013",
  "categoryId": "66",
  "version": "1.1",
  "author": "Antiscamp and Whiteflowerwoman",
  "createdUnix": "1381613898",
  "updatedUnix": "1381874496",
  "containsAdultContent": true,
  "uploadedBy": "Antiscamp",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000064947",
      "name": "Caele",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "118025",
      "fileName": "Caele-44307-1-0.zip",
      "uploadedUnix": "1381613490",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3478be17ea1f39e7378510b0b0cf6b492dddb1110921981e366edf7c1fbf951d/analysis/1407753952/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Caele-44307-1-0.zip?fid=1000064947&ttl=1535824941&ri=8192&rs=8192&setec=6ad4f51b84c88d0bc7a0a5aa89f28077"
    },
    {
      "fileId": "1000066438",
      "name": "Caele",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "118199",
      "fileName": "Caele-44307-1-1.zip",
      "uploadedUnix": "1381874496",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e1a61ed651c32e0522a088fae72025878b6954b6d2c76ca6c5a06d18476ce5b3/analysis/1407757306/",
      "changelogHtml": " *Moved Caele&#39;s \"Follow me\" option into her CaeleFollowerQuest, which improves her recruitment procedure. She should now be fully compatible with AFT, UFO and EFF.\r<br />*Made a new Voice Recording for recruitment.\r<br />*Fixed glitching enemy soldiers popping up in wrong locations.\r<br />*Gave her skin texture sets so she now dresses well in all sorts of armours.\r<br />*Cleaned Identical To Master records with TesVEdit. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Caele-44307-1-1.zip?fid=1000066438&ttl=1535824942&ri=8192&rs=8192&setec=0d14a78ffe523306b90202be903045f6"
    }
  ]
}