{
  "modId": 44338.0,
  "modName": "Fur-Lined Skaal Clothing Set",
  "summary": "A very simple mod that adds the Skaal armor as clothing.",
  "descriptionHtml": "This is a very simple mod, nothing new, nothing fancy.\r<br />\r<br />I decided to play a non armor wearing mage and since I use Frostfall I needed a set of warm clothing for her. I have a couple of sets of pretty mage clothing but they seemed very inadequate when my character was in the far north and standing in a blizzard. Since I couldn&#39;t find anything that looked warm enough, I took the Skaal armor and removed the armor stats and armor keywords and turned it into clothing.  I decided to share this in case there were any other freezing mages out there. ;-)\r<br />\r<br />The set includes the coat, gloves, boots and hat and they can be found in a knapsack at the Skyforge in Whiterun. If you use Frostfall you will need to use  &#39;Inspect Equipment&#39; to set the clothing to the desired exposure protection. Frostfall does not recognize it automatically. \r<br />\r<br />This mod requires the DLC Dragonborn and the latest version of Skyrim.  It does NOT require Frostfall.\r<br />\r<br />Install with NMM or if you prefer a manual install just drop FurLinedClothes.esp into Skyrim/data and activate.\r<br />\r<br />To uninstall use the NMM or delete FurLinedClothes.esp. There are no files or scripts attached to this mod.\r<br />\r<br />Cleaned with TES5Edit 3_0_30",
  "categoryId": "60",
  "version": "V1.0",
  "author": "Ithlia",
  "createdUnix": "1381637207",
  "updatedUnix": "1381635540",
  "containsAdultContent": false,
  "uploadedBy": "Ithlia",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000065113",
      "name": "Fur-Lined Clothing",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Fur-Lined Clothing-44338-V1-0.7z",
      "uploadedUnix": "1381635540",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f9ce9a8de591d63c700998275230843b9dc809b3c6f6b2f0cf5d54d3bb4f9ba1/analysis/1407754285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fur-Lined%20Clothing-44338-V1-0.7z?fid=1000065113&ttl=1535824972&ri=8192&rs=8192&setec=e7098eeb58f70bb03c26021fa516ba59"
    }
  ]
}