{
  "modId": 44353.0,
  "modName": "Bigreds Mannequinns",
  "summary": "I got tired of having only a few mannequinns at the player homes. This mod adds an extra display room to Skyrim that is accessed through a trapdoor in all eight of the player homes from the vanilla game and the Heartfire add-on. ",
  "descriptionHtml": "I\\'m not a big fan of typing alot so I will make this short. The room added has a bunch of extra mannequinns and a load of weapon racks. \r\n\r\nThere is a trapdoor in all eight of the player homes in vanilla and Hearthfire. This does offer a bit of a shortcut to all of the other houses, including the ones you do not own. Be advised that while you are in the rooms you do not own them at that time and you cannot leave untill you get the key unless you go out through the display room. Also, I havent played with the workbenches in the hearthfire add-on houses unless I owned them. If you want to play around, its at your own risk. \r\n\r\nThere may be a lot of warnings here but don\\'t dispair. This was built only using vanilla and Hearthfire resources. As such it should work with just about any mod!!!\r\n\r\nWARNING: Skyrim is a glitchy game. As much as I would like to, I am unable to fix glitches associated with the mannequinns or the weapon racks. I have taken every precaution to prevent issues but I still recommend double checking your items before you leave the cell. Occasionally you may put an item in a display and it will lock it out. You can\\'t select the weapon or the plaque. I have tested every rack and mannequinn in this mod several times in the hope that it will not happen but be warned. If you place an item and the option to pick it back up dissapears, simply reload your auto-save and avoid that display for a while. Come back to it later in your game and it may fix itself. If not, I am sorry but I do not know why it does that. If you are playing without autosave enabled, God help you, you brave and foolish person. \r\n\r\nNew!! \r\nYea, I\\'m aware that this hasn\\'t even been uploaded for 24 hours but I got a request already. The comments show someone looking for a more immersive version of this mod. All I did was delete all of the old stairs, put an additional display plaque in their places, and add a single ladder out of the display room. Then I duplicated it eight times, once for each house. A bit of refrencing and navmesh checking later and I\\'m done. As the file says, \\\"not thoroughly tested.\\\" Shouldn\\'t have any problems but it\\'s not the version I\\'m using. In other words, use at your own risk, but you probably guessed that already. Thats cause you\\'re smart.\r\n\r\nAll in all this is not my first mod, just the first I am sharing. Please enjoy it as much as I am. \r\n\r\nInstallation: Copy to your data folder, if you don\\'t know where it is check just about any readme on the site. Those writers care more about teaching than I do.\r\n\r\nIf you decide you are going to go immersive, clean out your old display room. The files are the same and it will overwrite your old display room access and only let you into the duplicated cells. My guess is that may cause an issue if you acctually need anything out of the standard display room. \r\n\r\nManagement is not responsible for any lost, missplaced, or stolen articles. Practice safe modding and always wear a backup copy.\r\n\r\nLegal stuff: Use it if you want and modify it if you must but if it is used somewhere else in any form please give me the credit due. Also please don\\'t upload it elsewhere. If you want others to be able to download it, link them here. Common curtesy, common sence, don\\'t be a douchebag about it, and so on.\r\n",
  "categoryId": "67",
  "version": "itsbrandnew.yay",
  "author": "redzombie",
  "createdUnix": "1381657153",
  "updatedUnix": "1381731172",
  "containsAdultContent": false,
  "uploadedBy": "redzombie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000065203",
      "name": "Bigreds Mannequinns",
      "version": "new.yay",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "116",
      "fileName": "Bigreds Mannequinns-44353-new-yay.7z",
      "uploadedUnix": "1381656540",
      "modVersion": "new.yay",
      "virusScanUrl": "https://www.virustotal.com/file/40dd919d9208fffb1583b3b0deb5c47dbae73fed58005ec710ddc52c3641ba7e/analysis/1407754570/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bigreds%20Mannequinns-44353-new-yay.7z?fid=1000065203&ttl=1535824981&ri=8192&rs=8192&setec=36979c2da8f0cc07d6472473d4b6883c"
    },
    {
      "fileId": "1000065532",
      "name": "Bigreds Mannequins Immersive",
      "version": "new.imm",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "141",
      "fileName": "Bigreds Mannequins Immersive-44353-new-imm.7z",
      "uploadedUnix": "1381731172",
      "modVersion": "new.imm",
      "virusScanUrl": "https://www.virustotal.com/file/c07ea3935a626b3d76cf9ff452b931501192ee6d387282cb61ce1020e7093dff/analysis/1407755702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bigreds%20Mannequins%20Immersive-44353-new-imm.7z?fid=1000065532&ttl=1535824982&ri=8192&rs=8192&setec=6ef50db8bd969d8974aa5098b9856e2a"
    }
  ]
}