{
  "modId": 44406.0,
  "modName": "Vampire follower-Milius Nestell",
  "summary": "Did you ever wanted some hot vampire follower, with some charisma?\r<br />I could&#92;&#39;t find just a one decent looking vampire, that would look nice, so i decided to create my own ;).",
  "descriptionHtml": "Did you ever wanted some hot vampire follower, with some charisma?\r<br />I could&#39;t find just a one decent looking vampire, that would look nice, so i decided to create my own.\r<br />\r<br />\r<br />His Story:\r<br />\r<br />His name is Milius Nestell. He was a farm boy, with his family lived a peacefull life in root of the mountain Throath of the World. But that was a long time ago. One night he heard something strange from mama&#39;s bedroom. He looked in there and his parents and little sister was murder be a vampire. A big scary looking monster looked at him and start laughning. He took papa&#39;s old rake and in insanity attacked. But his foe was too fast and too strong. He grab him by the throat and start suck his blood. But in the end, he started to feel sorry for him. He looked at him a said for himself: &#34;He&#39;s just a child... I&#39;m better better then this..&#34; Vampire released him, turn to the door and was about to leave.\r<br />\r<br />But Milius was full of anger. He took handle from the rake and stab him in the back. Again and again. Poisoned vampiric blood was in his mouth and he lapsed into unconsciousness. When he woke up and go out, to bury his family, the sun scorched him up. He was reading about vampirism, so he knew what he must do. He drinked blood from his parents, so that he can walk among livig humans.\r<br />\r<br />After this terrible experience he went to the college of Winterhold. He learned to everything from them, but he never had enought. When he tried to summon Hermaeus Mora, daedric prince of knowledge and memory, he killed the archmage. He leave with bad conscience and returned to a family house and lived here for a eight hundreds years. In time there was build a city named Helgen...\r<br />\r<br />One day, he was looking at the execution. He saw everything in his long life, kings, queens, jarls. Everyone died eventually. But he felt some power, that he did&#92;&#92;&#92;&#39;nt felt for a long time. Now he was certain about what will happen next. He was looking at the prisoners and that power went from someone, who was under the headsman axe. He wanted to stop them, but then he saw him. Alduin, eater of the worlds. Milius ran away to the nearest village, Riverwood. And he is waiting for the dragonborn, to help him stop this living apocalypse...\r<br />\r<br />Location:\r<br />\r<br />He is located in Sleeping Giant Inn, in Riverwood.\r<br />\r<br />Skills:\r<br />\r<br />He is a sneaky and powerfull mage, with a big arsenal of spells, he is best in Destruction and Conjuration. \r<br />\r<br />Required: ApachiiSkyHair by Apachii, Dawnguard DLC\r<br />\r<br />Reccomended: \r<br />\r<br />SOS - Schlongs of Skyrim by Smurf and VectorPlexus\r<br />http://skyrim.nexusmods.com/mods/35463/?\r<br />\r<br />Smooth Male Body - textures for Better Males - SOS Schlongs of Skyrim by urshi\r<br />http://skyrim.nexusmods.com/mods/26145/?\r<br />\r<br />Stronger Male Skeleton for SOS by VectorPlexus-Smurfette\r<br />http://skyrim.nexusmods.com/mods/36938/?\r<br />\r<br />Better Vampires 6-31 by Brehanin (that&#39;s just for a gameplay, it does&#39;nt change appearance)\r<br />http://skyrim.nexusmods.com/mods/9717/?\r<br />\r<br />DVA Dynamic Vampire Appearance by Aipex8 and TaikoDragon\r<br />http://skyrim.nexusmods.com/mods/41634/?\r<br />\r<br />BVFE - Better Vampire Fangs and Eyes by Aipex8\r<br />http://skyrim.nexusmods.com/mods/38829/?\r<br />\r<br />RaceMenu by Expired\r<br />http://skyrim.nexusmods.com/mods/29624/?\r<br />\r<br />Fine Face Textures for Men by Urshi by urshi\r<br />http://skyrim.nexusmods.com/mods/27815/?\r<br />\r<br />\r<br />\r<br />Thanks for downloading my first mod, hope you&#39;ll like it. And if you do, then please Endorse ;).\r<br />And i don&#39;t speak english by the way so sorry for some mistakes :D.\r<br />\r<br />P.S.: I&#39;m willing to make MALE followers on request.",
  "categoryId": "96",
  "version": "1",
  "author": "pahnrak",
  "createdUnix": "1381704402",
  "updatedUnix": "1381704350",
  "containsAdultContent": false,
  "uploadedBy": "pahnrak",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000065453",
      "name": "Milius Nestell",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "164",
      "fileName": "Milius Nestell-44406-.rar",
      "uploadedUnix": "1381704350",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1c93f7210edf4765ac8f4316f3c2bff61037d2dd5d4a75fedb72b00fc8bd146b/analysis/1407755298/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Milius%20Nestell-44406-.rar?fid=1000065453&ttl=1535825025&ri=8192&rs=8192&setec=dc460d2d891550af83e129ac709724f9"
    }
  ]
}