{
  "modId": 44430.0,
  "modName": "Wealthy Thieves Guild",
  "summary": "Tired of hearing Brynjolf exaggerate about the guilds new found wealth? Wondering why no one has replaced the rotten wood in the Ragged Flagon? Still got bruises on your dovakhiin rear end after that rickety old bench finally collapsed under you? Well then this mod is for you&#33;",
  "descriptionHtml": "SINCE I CAN&#39;T CONTINUE WORK ON THIS MOD I WILL LET ANYONE WHO WANTS TO USE IT AS THEY SEE FIT. ALL I ASK IS FOR CREDIT FOR THE WORK I DID DO, BUT IF YOU WANT TO EXPAND ON IT, USE IT FOR OTHER PROJECTS ETC. GO AHEAD.\r<br />\r<br />First things first, this is my very first mod so there might be bugs in it, I&#39;ve tested it as much as I can, but if you find something, let me know (and if you have suggestions on what&#39;s causing it or how to fix it I&#39;ll be even happier&#33;), so with that said, lets move on to the mod itself.\r<br />\r<br />After finishing the Thieves Guild quest, running errands and buying all the upgrades for the guild I was disappointed, and I&#39;m sure I&#39;m not the only one. The place still looked like a dump to put it mildly. So I went looking for a mod to fix it but couldn&#39;t find anything that fit my tastes, it was either too over the top, not enough, not compatible with my other mods, or just to heavy on my poor old computer. So I did what any determined gamer with to much spare time on her hands would do and set about creating my own mod to fix the problem. \r<br />\r<br />I&#39;ve tried to keep things sensible and while it may not be 100% lore-friendly (if you&#39;re a stickler for lore) it&#39;s pretty close, and if you keep in mind that the new guild leader is the dragonborn suddenly having a dragon skull hanging on the wall should be much more acceptable. Besides, these are thieves we&#39;re talking about, it&#39;s fairly likely they just relocated a few things on a drunken dare. \r<br />\r<br />The major changes really are in the vault however, it bothered me that is was still empty even after the guild got back on it&#39;s feet. Other changes include changing most furniture into their noble counter parts, general tidying up, completely rebuilding the wooden structure over the water in the ragged flagon and just adding some decorations. \r<br />\r<br />All in all this shouldn&#39;t need the DLC&#39;s to run it, but I haven&#39;t tried it without, so if you get CTD issues when trying to load this without the DLC&#39;s that is very likely the issue, please let me know if that happens and I will do my best to look it over.\r<br />\r<br />Please note that this mod is designed to be used AFTER the Thieves Guild quests have been completed and have not been tested with an uncompleted and un-upgraded area. While I expect it should work without any issues it may look strange, some items may have collision issues etc. Once I can figure out how to avoid this I will update it, but for now I recommend not running this mod until you&#39;ve [U]AT LEAST[/U] gotten rid of Mercer.\r<br />\r<br />Also, while you don&#39;t HAVE to have any mods to run this I highly recommend the following, both to get the same effects as me, and for general amazingness:\r<br />[URL=&#34;http://skyrim.nexusmods.com/mods/13429//?&#34;]\r<br />[B][COLOR=&#34;DarkOrchid&#34;]Designs of the Nords[/COLOR][/B][/URL]\r<br />[URL=&#34;http://skyrim.nexusmods.com/mods/29608//?&#34;][COLOR=&#34;DarkOrchid&#34;]Detailed Rugs (with the pelts addition)[/COLOR][/URL]\r<br />[URL=&#34;http://skyrim.nexusmods.com/mods/14227/?&#34;][COLOR=&#34;DarkOrchid&#34;]Ruins Clutter Improved[/COLOR][/URL]\r<br />[URL=&#34;http://skyrim.nexusmods.com/mods/31593/?&#34;][COLOR=&#34;DarkOrchid&#34;]Mitigate HDR Eye Adaptation and disable Bloom[/COLOR][/URL]\r<br />[URL=&#34;http://skyrim.nexusmods.com/mods/41076/?&#34;][COLOR=&#34;DarkOrchid&#34;]Realistic Water Two[/COLOR][/URL]\r<br />[URL=&#34;http://skyrim.nexusmods.com/mods/40551/?&#34;]No More Hay Beds[/URL]\r<br />\r<br />Changelog version 1.1\r<br />Navmesh fixed. NPC&#39;s should not walk into the water in the cistern anymore.\r<br />Chests in the vault now have loot. DO NOT STORE THINGS IN THESE CHESTS. It may disappear.",
  "categoryId": "25",
  "version": "1.1",
  "author": "NikitaDarkstar",
  "createdUnix": "1381731854",
  "updatedUnix": "1383164304",
  "containsAdultContent": false,
  "uploadedBy": "NikitaDarkstar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000065536",
      "name": "Wealthy Thieves Guild",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "36",
      "fileName": "Wealthy Thieves Guild-44430-1-0.rar",
      "uploadedUnix": "1381731548",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/867f089807088eb619f11da303ebaaed4eb52caddf3e97aa0eac65f2985de700/analysis/1407755642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wealthy%20Thieves%20Guild-44430-1-0.rar?fid=1000065536&ttl=1535825047&ri=8192&rs=8192&setec=990e4eb6d535ec065750c820aa888fa6"
    },
    {
      "fileId": "1000072853",
      "name": "Wealthy Thieves Guild",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "Wealthy Thieves Guild-44430-1-1.rar",
      "uploadedUnix": "1383164304",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c6923c02eb5d3dad7a3ae1cbd614f2bf6fd011782f2531504fd450a2fced8960/analysis/1407775502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wealthy%20Thieves%20Guild-44430-1-1.rar?fid=1000072853&ttl=1535825047&ri=8192&rs=8192&setec=d97f50c512f4321f7d5078c47d6706e4"
    }
  ]
}