{
  "modId": 44496.0,
  "modName": "Hill House Returned",
  "summary": "Hill House is a home for the darker character types. The main features such as beds and the dining table can be changed to suite Vampires or non Vampires. These items can be changed back and forth as often as you like.",
  "descriptionHtml": "[quote]&#34;Hill House, not sane, stood by itself against its hills, holding darkness within; it had stood so for eighty years and might stand for eighty \r<br />more. Within, walls continued upright, bricks met neatly, floors were firm, and doors were sensibly shut; silence lay steadily against the wood and stone of Hill House, and whatever walked there, walked alone.\r<br />\r<br />Shirley Jackson, The Haunting of Hill House[/quote]\r<br />\r<br />[center]Greetings and welcome to Hill House[/center]\r<br />After I started releasing house mods for Skyrim I received several requests for a home which would be suitable for the darker characters so I thought I would give it a try. For inspiration I looked to a movie called The Haunting, the 1963 version, in which the main character was the house, Hill House. It was a very old dark house but it still remained grand and beautiful. This is what I was trying to accomplish with this mod, the Gothic version of a creepy home. If you use Hill House as a home for your Vampire character and are a fan of Bethesda’s view of how Vampires live you will be disappointed in Hill House. There are no puddles of blood, no bloody bones and skulls scattered everywhere, no cages to lock up your hapless victims and no torture devices because I was after grand not gruesome These things are not something that I use while playing Skyrim and I have no desire to mod them so Hill House will never have these additions. They will have to be something that you add yourself for your own personal game play. Hill House was built as a grand home for a beautiful young woman, not as a vampire house. It only fell into that roll after years of being abandoned. I wrote a back story that explains why Hill House is where it is, why it was built and how it came to be deserted. I put the story at the very bottom of this page if you are interested in reading it.\r<br />\r<br />==================\r<br />Requirements:\r<br />==================\r<br />\r<br />Patch 1.9.32.0.8\r<br />Dawnguard\r<br />\r<br />==================\r<br />Details:\r<br />==================\r<br />\r<br />While I wanted the home to work for Vampires, I didn&#39;t want it to be just for Vampires. However Vampires have very different eating and sleeping needs than everyone else so I decided that the house needed to be able to change to suite those different needs. Rather then create two different versions of the house I scripted the items in the dining room and in both of the bedrooms to be changeable. You will find two buttons in the dining room and a button for each bed. The bedroom buttons will swap out beds for coffins. The dining room buttons will swap out the standard food for a blood feast as well as some of the furniture colors to match the different table settings. You can change things back and forth as you like and as often as you like. Unfortunately there are no double coffins so those with spouses can’t share a coffin.\r<br />\r<br />- At the southwest end of the East Empire Company docks you will find a new ship which will fast        travel you to the Hill House docks.\r<br />\r<br />- The front gate has a locking bar so you can keep invaders from attacking you in the courtyard. You will need to Fast Travel to Hill House once you have found it and it has been added to your map. This will allow you to get past the locked gate for the first time and unlock it. You may need to repeat that procedure when your game resets itself as this will very probably cause the gate to lock itself again. The bar can be locked and unlocked as needed.\r<br />\r<br />- There is a trash barrel outside by the stables named Respawning Trash Barrel. I am always picking up some bits of trash and needed a place to throw them away. WARNING this barrel respawns so DO NOT put anything in it that you wish to keep. \r<br />\r<br />- There is a large room for enchanting and alchemy\r<br />\r<br />- A dining room with the table that can be changed to suite Vampires or Non Vampires.\r<br />\r<br />- A nice sized kitchen with plenty of named storage and a working sink.\r<br />\r<br />- In the kitchen there are two brooms and a bucket that you can use to clean away the snow, rubble, leaves and cobwebs. If you want any of these things back just use the items again.\r<br />\r<br />- A bathroom with working shower and sink.\r<br />\r<br />- A small office.\r<br />\r<br />- Two large bedrooms which will sleep a total of five. All beds can be changed between standard beds or coffins.\r<br />\r<br />- There is an organ on the main floor of Hill House because what old Gothic style home would be complete without an organ? It plays some short and very cliche&#39; creepy organ riffs...just for fun.\r<br />\r<br />- There are several book cases and lots of safe storage.\r<br />\r<br />- I also included an area for storing and displaying the Dragon Priest masks.\r<br />\r<br />-The smithy is located in a small building next to Hill House. It includes all your blacksmith equipment, named storage, four mannequins and some weapon display.\r<br />\r<br />- There is a small stable and a wood chopping block out front of the house.\r<br />\r<br />- The exterior and interiors have been completely NavMeshed.\r<br />\r<br />- All storage is safe EXCEPT the trash barrel outside.\r<br />\r<br />- Hill House is not set up for adoptions, so no, you can&#39;t have the kids live in Hill House. You will need to make that change yourself. There are also several mods that will allow you to have your spouse live in Hill House.\r<br />\r<br />- The mod has been carefully cleaned with TES5Edit V3_3_3_30\r<br />\r<br />==================\r<br />Installation:\r<br />==================\r<br />\r<br />Use the NMM or if you prefer to install manually use the following instructions.\r<br />\r<br />To install manually\r<br />\r<br />-Download and then open the file.\r<br />\r<br />-Once opened you will have a folder named Hill House Cleaning. Inside that there will be a data folder.\r<br />\r<br />-Drag and drop that data folder into the Steam/steamapps/common/Skyrim folder. NOT Steam/steamapps/common/Skyrim/data folder\r<br />\r<br />-Check the .esp in the Skyrim Data Files or in the Nexus Mod Manager plugins list depending on which system you are using.\r<br />\r<br />[center][youtube]7wHNL9I7bnk[/youtube][/center]\r<br />\r<br />==================\r<br />Version 5.0 Changes:\r<br />==================\r<br />\r<br />- &#33; IMPORTANT PLEASE READ &#33; Removed the three shield racks in the Smithy and replaced them with two Coat of Arms. The shield racks would stop working for some people, myself included. If you update to this version please remove any shields you have placed on the shield racks before updating and remove your character from the Smithy, moving to inside the main house will do. The Coat of Arms need an in game load to set up correctly. \r<br />\r<br />- &#33; IMPORTANT PLEASE READ &#33; Added a locking gate bar to the main gate outside. Please be elsewhere in the game, inside the main house will do, as the bar needs an in game load to set up correctly. If you are in a different area and away from Hill House you will need to do a fast travel to Hill House to bypass the locked gate the first time. The gate can then be unlocked and locked as needed. When the game resets you may need to repeat that procedure as the gate will quite possibly lock itself again. \r<br />\r<br />- The four statues in the entry of the house were replaced. There was some concern that these items were not free to use. While it was never proven that they were a problem I felt that it was in my, and my mods, best interest to replace them. Due to this issue V4.0 has been deleted. The statues were replaced by four ancient Blades statues that Lord Sigmere collected on one of his many travels to the Markarth area. \r<br />\r<br />- Added a trash barrel outside by the stables named Respawning Trash Barrel. I am always picking up some bits of trash and needed a place to throw them away. WARNING this barrel respawns so DO NOT put anything in it that you wish to keep. \r<br />\r<br />- Removed the Dust Mote Effect from the Smithy. \r<br />\r<br />- Added back some ground mist that originally went missing while I was working on landscape. \r<br />\r<br />- Removed the two &#39;mouse traps&#39; aka Bear Traps from the Smithy. They were not cooperating at all. \r<br />\r<br />- Re-positioned the four planters outside to correct plants clipping through walls. \r<br />\r<br />- Re-positioned the two lanterns that are outside of the Smithy door. \r<br />\r<br />-  Re-positioned a light source that was situated on the Gargoyle statues face which made it look rather strange.\r<br />\r<br />==================\r<br />Credits:\r<br />==================\r<br />Arion for Arie Manor Furniture resource\r<br />Artisanix for PAINTINGS and FRAMES modders resource\r<br />Blary for Booksets, Food Container Resource, Ingredient Drawers, Ingredient Jars, Ingredient Wall Art and Open Books.\r<br />Breti for the building resource.\r<br />DarkRider for Celtic Decor Paintings.\r<br />InsanitySorrow for Bath Towels, Folded Blankets, Junkyard, Pillows, Rugs, Static Armor Stands and Soap resources.\r<br />KrimsonLust for his Red Noble Bed resource\r<br />Lilith for ready Clutter 1.1.7 and Ready Clutter .7\r<br />Merilia for Babettes Feast.\r<br />Nart2007 for the glass texture.\r<br />Oaristys and Tony67 for Resource pack 1.7\r<br />Runspect for Resources for Modders.\r<br />soughtaftersounds for the organ music.\r<br />Stroti for his Cannon, Castle Furniture, Manor, Old Mill, Ovens, Small House and Organ Resources.\r<br />A special thank you to Tamira for making it possible to use Stroti&#39;s resources in Skyrim.\r<br />The_Funktasm for TF_Simple Silverware Replacement\r<br />Tueffel for the Crafting Table Resource and the Treffles Resource.\r<br />YNSTBIH for the Oreo Rug Resource.\r<br />\r<br />Thanks to Bethesda for creating Skyrim.\r<br />Thanks to InsanitySorrow for the ReadMe Generator this ReadMe is based on.\r<br />\r<br />A special thank you to Elandra for the German Translation of Hill House\r<br />\r<br />==================\r<br />Tools Used:\r<br />==================\r<br />\r<br />ReadMe Generator\r<br />Creation Kit\r<br />GIMP\r<br />NifSkope\r<br />\r<br />==================\r<br />Back Story:\r<br />==================\r<br />\r<br />[center]WARNING&#33;[/center]\r<br />I can’t write. I make no claims to be any kind of writer other than a very bad one. This was just a back story for Hill House that I used to keep on track with what I was doing in the mod. So read it at your own literary risk&#33; You have been warned.\r<br />\r<br />[center]Hill House[/center]\r<br />In Solitude there once lived a Nord named Lord Sigmere Hill. Lord Sigmere, and his wife of twenty-five years, lived a very comfortable life in a large expensive home near the Blue Palace. Lord Sigmere was a very clever and unscrupulous man and through many underhanded dealings with the East Empire Company had managed to amass a great deal of wealth. During one of his business trips to Markarth Lord Sigmere’s caravan was attacked by Forsworn. His hired guards fought bravely and eventually drove off the Forsworn but not before Lady Hill, who had always travelled with her husband, was mortally wounded.\r<br />\r<br />Fifteen years later Lord Sigmere continued to live in his grand home in Solitude. He had never remarried and, approaching his sixty-first year, no longer even thought of marriage. However while attending to some business in the Blue Palace he saw a young woman that he became totally smitten with. Making inquiries he discovered that she was the daughter of a lord who had died, leaving the young lady a ward of the court. Lord Sigmere was determined to have her at any cost. He whispered in the right ears and pressed gold into the right hands and eventually he married the young woman whose name was Meeka. The beautiful Meeka attracted the attentions of young men where ever she went which was too much for the jealous Lord Sigmere to tolerate. He decided to take Meeka away the city and away from the looks and smiles that constantly followed her. He commissioned a large home to be built in the shadow of Solitude on the edge of the marsh. Lord Sigmere chose this location because he knew that it would only be accessible by boat or through the treacherous marsh. The best craftsmen and artisans were commissioned to build Hill House and fill it with the finest furniture and exotic plants. Meeka moved into Hill House along with a few servants to look after her needs. Confident that his young wife was now safe from unwanted attentions, Lord Sigmere resumed his business trips but leaving his new Lady Hill at home.\r<br />\r<br />One day Lord Sigmere failed to keep a rather important business appointment and several days had passed with no word from him. The merchants that he was suppose to meet with, being more concerned with loss of profits then for Lord Sigmere’s welfare, hired a pair of mercenaries to travel to Hill House and make inquiries. The mercenaries returned very early the next day and rather then reporting back to the merchants they went straight to the Captain of the city guard. The story they told resulted in an immediate trip to Hill House by the Captain, several guards and a very confused priest from the Hall of the Dead. Never before had the priest been called on to accompany the Captain. When they arrive at Hill House what they found in the courtyard was almost beyond words. Lord and Lady Hill had been brutally murdered, their bodies torn apart. The Captain who was visibly shaken, got out his journal, made some notes and then began barking orders. He wanted the bodies buried at Hill House despite the priest’s objections. The priest wanted the bodies returned to the Hall of the Dead to be properly interred. The captain told the priest that the bodies would be buried or burned at Hill House but they would not be leaving Hill House. The reason given was that he did not want to risk the townsfolk seeing what was left of them. So the remains of Lord and Lady Hill were buried beside the house and the guards were ordered not to speak of what they had seen. The Captain decided to check the house before leaving but found that the door was locked. He realized that the house key had probably been buried with the bodies. The Captain’s official report stated that the cause of death was ‘Bear Attack’ though no bears had ever been sighted in that area.\r<br />\r<br />That evening some of the off duty guards who had been at Hill House gathered in The Winking Skeever and after a few mugs of ale they did speak of what they had seen. They described the terrible state of the bodies and of the hurried burial by the ashen faced priest. They spoke of their Captain who none had ever seen so upset before. The townsfolk repeated the guard’s stories in frightened whispers until all had heard the tale. The city tried to sell the property but no one would even go near the place, let alone spend good coin on what everyone now agreed was a cursed property. The years passed and Hill House eventually slipped into the forgetfulness of time and was spoken of no more.\r<br />\r<br />Now almost eighty years have passed and the gardens of Hill House have withered and died. The weather has long since erased all traces of the gruesome murders that happened in the courtyard. Very recently ships sailing into the East Empire docks have been reporting lights in the house windows. The current Captain of the guard dismissed the reports saying “It is just tricks of the mists or the sailors giving in to night terrors. Who would live in that old place that has been empty for so many years?” Mercenaries and soldiers are also reporting seeing lights late at night and these men are not given to night terrors nor are they easily tricked by the mists. So now the old stories are being whispered again. Who or what has moved into old Hill House? Thieves, assassins? Some say a dark necromancer, some say werewolves. None dare to even whisper what they all fear the most...Vampires.",
  "categoryId": "67",
  "version": "V.5.0",
  "author": "Ithlia",
  "createdUnix": "1381778236",
  "updatedUnix": "1417357620",
  "containsAdultContent": false,
  "uploadedBy": "Ithlia",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000069771",
      "name": "Hill House",
      "version": "V5.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50107",
      "fileName": "Hill House-44496-V5-0.7z",
      "uploadedUnix": "1382555321",
      "modVersion": "V5.0",
      "virusScanUrl": "https://www.virustotal.com/file/0f358aabb56ddaa82a0aa73f3b69cfb40f68d0f021dfcf954f73873e85db8ff5/analysis/1407766242/",
      "changelogHtml": " - &#33; IMPORTANT PLEASE READ &#33;  Removed the three shield racks in the Smithy and replaced them with two Coat of Arms. The shield racks would stop working for some people, myself included. If you update to this version please remove any shields you have placed on the shield racks before updating and remove your character from the Smithy, moving to inside the main house will do. The Coat of Arms need an in game load to set up correctly. \r<br />\r<br />-  &#33; IMPORTANT PLEASE READ &#33; Added a locking gate bar to the main gate outside. Please be elsewhere in the game, inside the main house will do, as the bar needs an in game load to set up correctly. If you are in a different area and away from Hill House you will need to do a fast travel to Hill House to bypass the locked gate the first time. The gate can then be unlocked and locked as needed. When the game resets you may need to repeat that procedure as the gate will quite possibly lock again.\r<br />\r<br />- The four statues in the entry of the house were replaced. There was some concern that these items were not free to use. While it was never proven that they were a problem I felt that it was in my and my mods best interest to replace them. They were replaced by four ancient Blades statues that Lord Sigmere collected on one of his many travels to the Markarth area.\r<br />\r<br />- Added a trash barrel outside by the stables named Respawning Trash Barrel.  I am always picking up some bits of trash and needed a place to throw them away. WARNING this barrel respawns so DO NOT put anything in it that you wish to keep.\r<br />\r<br />- Removed the Dust Mote Effect from the Smithy.\r<br />\r<br />- Added in ground mist that originally went missing while I was working on landscape.\r<br />\r<br />- Removed the two &#39;mouse traps&#39; aka Bear Traps from the Smithy. They were not cooperating at all.\r<br />\r<br />- Moved the planters outside to correct plants clipping through walls.\r<br />\r<br />- Re-positioned the two lanterns that are outside of the Smithy door.\r<br /> <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hill%20House-44496-V5-0.7z?fid=1000069771&ttl=1535825094&ri=8192&rs=8192&setec=937d14fb5920bd35dbc7abf28edbb0f9"
    },
    {
      "fileId": "1000137286",
      "name": "Hill House German ",
      "version": "V.5.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "50104",
      "fileName": "Hill House German -44496-V-5-0.7z",
      "uploadedUnix": "1417357620",
      "modVersion": "V.5.0",
      "virusScanUrl": "https://www.virustotal.com/file/8d76ed59c5376131f5dd927339b274e80c6332db20a8dc3b8f18c8d8f77d0e67/analysis/1417357690/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hill%20House%20German%20-44496-V-5-0.7z?fid=1000137286&ttl=1535825094&ri=8192&rs=8192&setec=994a5a9e4ea95539b3f3c545bc0b3fc5"
    }
  ]
}