{
  "modId": 44557.0,
  "modName": "Brhuce Hammar - Legacy",
  "summary": "A new standalone, fully voiced companion, with his own unique equipment, AI, as well as five enormous quests that will take you through the realms of Oblivion, into space, and even give you a giant robot that you may pilot&#33;\r<br />",
  "descriptionHtml": "[youtube]cAZCh8GF6s4[/youtube]                                              [youtube]N4N5xeTBp5w[/youtube]\r<br />\r<br />WARNING AND DISCLAIMER(?): This mod contains harsh language and jokes&#33; Brhuce is not a nice dunmer, and will take every opportunity to belittle you, everything around you, and everything else. If you are the kind of person who is easily offended, or a wuss, do not download this mod, or if you do, do not complain to us if your feelings are hurt afterwards. You have been warned&#33;\r<br /> \r<br />[img]http://i.imgur.com/30BHfSN.png[/img]\r<br />\r<br />So, you&#39;ve scoured the internet, you&#39;ve seen all the follower mods there are to see, and gosh darnit to jeez christ gosh heck, you&#39;re sick of all the glassy-eyed waifus, the big-foreheaded floozies, and the barely-dressed barbies that look like they were designed by a middle-schooler who just discovered the opposite gender. You want a better companion, a trustworthy companion. You want a follower who exudes quality. You want a follower who stands for excellence, integrity, and lore-friendliness.\r<br />Until such a follower exists, why not try out Brhuce Hammar. He throws trains at people&#33;\r<br /> \r<br />Brhuce Hammar: Legacy, is a fully-voiced, standalone quest and companion mod centered around the titular character Brhuce Hammar. An unhinged and disgraced Telvanni magelord, Brhuce Hammar is a snarky, old, and powerful wizard with an unhealthy obsession with machines. Recently arrived in Skyrim, Brhuce and the Dragonborn encounter one another, and forge a friendship that will stand the test of time. And by this, I mean Brhuce thinks you&#39;re a useful idiot. As the player will soon find, Brhuce&#39;s life is nothing like anything they&#39;ve encountered before, and the player will often be dragged along by Brhuce on his various schemes and adventures.\r<br />You, the player, will find themselves traversing planes of Oblivion, fighting off invasions of otherwordly beings, blasting off to space and exploring the secrets of the dwemer, and even piloting your own giant robot. I&#39;m not kidding, we added a giant robot into the game, and you get to drive it and use it to fight giant monsters. Really.\r<br />You&#39;ll also find yourself gaining a vast arsenal of new rewards, artifacts, spells, and weapons&#33; Drink from the fabled Tankard of Why, shoot daedrons from your mouth, convert gems to gem ingredients, and even get your own robotic horse to ride around in&#33;\r<br />Brhuce himself of course, has various commentary, quips, and jokes, all fully voiced. In addition to passive random comments, you can sometimes ask Brhuce his opinion on something, and recieve a variety of observations. Brhuce is also able to be married, has his own mount, spells, and much much more&#33;\r<br /> \r<br /> \r<br />FEATURES\r<br />__________________________________________________________\r<br />-A fully voiced, in-depth companion, who comes with the following features\r<br />        +Over 200 lines, voiced by a professional voicing team, a not-so-professional voicing team, and a goose.\r<br />        +His own unique combat AI, watch as Brhuce dashes around the map, switching spells and combat styles, ramming people and even exploding. Because he explodes.\r<br />        +The ability to change Brhuce&#39;s strength. Just ask him to be less overpowered, and watch as he changes to a more balanced playstyle, or tell him not to, and watch him go nuts.\r<br />        +Custom armor, weapons, and even spells&#33; Watch as Brhuce chucks trains at people, vomits steam, or rams them with the full force of his railroady might.\r<br />        +Able to be married by any gender, if a nerdy 300 year old technomancer interests you like that.\r<br />        +Over a hundred lines of commentary for all cities, most towns, dwemer ruins, draugr ruins, caves, necromancer lairs, and much much more&#33;\r<br />        +His own very special mount, which he will ride on whenever you yourself mount a horse&#33; No other mods required&#33;\r<br />        +The ability to, once you have completed the relevant quest, teleport you to your own giant robot hangar\r<br />        +The ability to convert items into other items&#33; He can also give you other items&#33; Yaaaaay items&#33;\r<br /> \r<br />-Five huge quests offered by Brhuce, that will take you through the planes of Oblivion (including Quagmire&#33;), let you explore a dwemer space station in zero-g, raid the ruins of a daedric prince, fend off an alien invasion, and even pilot your own giant robot&#33;\r<br />-Tons of new locations, new Oblivion realms, the Lost Dwemer Station of Khagrenzell, to the ancient Zhatterdome, and even Sanguine&#39;s secret lair of... things.\r<br />-The ability to pilot your own giant robot&#33; That&#39;s right, you and Brhuce may climb aboard your own mech, and pilot it against kaiju, defending Skyrim from various foes, and claim rewards for doing so&#33;\r<br />-New enemies, from the deadly Brhucebot, the fit Swole Troll, to the mysterious Salmon of Doubt.\r<br />-New armors, weapons, and spells all available through the quests. New artifacts, spells that can be used underwater, and I think we already mentioned the robot horse, but you get one.\r<br /> \r<br />INSTALLATION AND PLAYING\r<br />__________________________________________________________\r<br />Extract the rar wherever you want, then copy the files into your Skyrim/Data folder. It will merge some folders, let it.\r<br />Then activate the esp, and you&#39;re good to go.\r<br />Or just download it with NMM.\r<br />Brhuce may be found in Derelict Pumphouse in Blackreach. This is near the Great Lift at Ralbthar. As you may have guessed, you will have to have access to Blackreach to reach him.\r<br />Brhuce requires nothing else to be your companion however, and will follow you freely.\r<br />After a certain number of fights, Brhuce will offer you one of his quests. The number of fights is, by default, 30. However, you can set the number down by opening the console and typing &#39;set 1__tw_fightNumber to &lt;whatever value you want&gt;&#39; without quotes.\r<br />After you have completed three of these offered quests, Brhuce will then offer you Pacific Skyrim, which is the quest where you may pilot your giant robot.\r<br />If you have completed Sanguine&#39;s quest, Brhuce will offer you the Tankard of Why quest.\r<br /> \r<br /> \r<br />CONFLICTS AND TIPS\r<br />__________________________________________________________\r<br />Load this AFTER any follower tweaks like UFO or ATF or VVMSZTBTYEDZVER2. If you don&#39;t do this, the issues aren&#39;t too bad, Brhuce simply will not ride his horse. Or maybe he will.\r<br />This mod adds things to the Derelict Pumphouse in Blackreach, namely Brhuce. Issues will arise with things that change that area. Do NOT get this confused with the other pumphouse since there&#39;s more than one in Blackreach. The word Derelict will help you distinguish them.\r<br />To enter and exit your Shatterdome hangar, simply talk to Brhuce after Pacific Skyrim is complete.\r<br />The Bigoted Blade and the Axe of Acceptance do not work for custom races. Sorry.\r<br />DO NOT use console commands to place Brhuce next to year, this will cause major problems in his quests. Instead, use this code to teleport to where he is \r<br />player.coc BlackreachZCell07\r<br />\r<br />\r<br />\r<br /> [img]http://i.imgur.com/NjMzYO0.png[/img]\r<br />\r<br />To Haishao, for their help in testing, and mesh conversion\r<br />To Guardly, for uploading the mod to Nexus and making the mod trailer.\r<br />To Dem Waifus and TESG, for testing.\r<br />To InsanitySorrow, for his dwemer meshes\r<br />To Mr. Siika, for his dwemer meshes\r<br />To Ronnie Magnum, for his meshes\r<br />To JCSPencer, for his meshes\r<br />To crysthala, for their texures\r<br />To Mr. Casual, for his waifus\r<br />To jackGa, for his meshes\r<br />To )))), for his meshes\r<br />To Vicn, for his meshes\r<br />To Darthhister, for his textures\r<br />To Razorpony, for his meshes\r<br />Additional credits are given in the readme&#33;",
  "categoryId": "35",
  "version": "1.01",
  "author": "Team Brhuce",
  "createdUnix": "1381806938",
  "updatedUnix": "1382052682",
  "containsAdultContent": false,
  "uploadedBy": "Guardly",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000067239",
      "name": "Brhuce Hammar- Legacy 1_01",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "95888",
      "fileName": "Brhuce Hammar- Legacy 1_01-44557-1-01.rar",
      "uploadedUnix": "1382052682",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/053ba6fbd09474131a40ab43c5560eab9abbd4c3654c7d68d5fa0d11f4e17036/analysis/1407759446/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brhuce%20Hammar-%20Legacy%201_01-44557-1-01.rar?fid=1000067239&ttl=1535825163&ri=8192&rs=8192&setec=6bb986db5f2d9f627b7bd2cfc3149886"
    }
  ]
}