{
  "modId": 44693.0,
  "modName": "A Little Hole in the Ground",
  "summary": "An underground player home near Half-Moon Mill.",
  "descriptionHtml": "I\\'ve always wanted an underground house, but I\\'ve never really liked the ones I\\'ve found. So I decided to make my own.\r\nI might update this in the future, not sure.\r\nI know it does not look good at all. This is my first mod. Most of the floor graphics don\\'t line up, which really bugs me. But I honestly haven\\'t a clue on how to fix it; I\\'ve never made a mod before in my life.\r\n\r\nDETAILS:\r\nThis mod places an underground house called A Little Hole in the Ground near Half-Moon Mill, and for those who don\\'t know where that is, Half-Moon Mill is located just near the Lady Stone. Also, there will be a picture to show you in case you are confused or haven\\'t found those locations.\r\n\r\nThis mod, currently, will probably appeal more to an overpowered character, as there is a table in the bedroom covered in Elder Scrolls. Please continue reading for more info on that.\r\n\r\nIt is comprised of 5 rooms; \r\n1. A main room functioning as a livingroom and kitchen (still needs things added to it).\r\n- Currently only contains a dining table with food and a chair, and a cooking pot with a fire and spit.\r\n- If you have suggestions for things to add to the livingroom/kitchen, please tell me.\r\n\r\n2. A freezer room which holds meat and is completely pointless, I just think it\\'s cool.\r\n- This room seriously is pointless. A friend gave me the idea over the phone and I thought sure, why not.\r\n\r\n3. A smithy.\r\n- Contains 5 mannequins, 2 sword racks, a forge, smelter, workbench, grindstone, and an archery target.\r\n\r\n4. An apothecary.\r\n- Contains an enchantment table, alchemy table, and a small assortment of herbs and such.\r\n- Everything in the apothecary was pulled from Vilendrel Hall. Don\\'t complain about it, I don\\'t care.\r\n\r\n5. And a bedroom.\r\n- Contains 1 bed, 1 wardrobe, 1 chest, 2 bookshelves, and 2 shelves assorted with different cool-looking objects (none of these should move or fall whether you bump them or not, but I have had a few bugs with it).\r\n- Also contains a table and chair; the table is piled with Elder Scrolls. You cannot pick them up and they will not move when hit or bumped. I made this mod mainly for a specific character of mine which is supposed to be very overpowered and wise beyond all others (I roleplay Skyrim quite a lot, \\'cause yolo? Oh no wait, I don\\'t have a life).\r\n\r\nCOMING SOON (maybe):\r\nI would like to add a torture room, maybe branching off from the apothecary. If I do get around to making it, I\\'ll release it as an optional file since not everyone wants a torture room in their house.\r\n\r\nINSTALLATION:\r\nSimply extract the nyk.esp file to your Skyrim Data folder, and make sure to check it in your data files.\r\n\r\nREQUIREMENTS:\r\nYeah, it doesn\\'t rely on any mods. So all you need is Skyrim.\r\n\r\nSUGGESTIONS:\r\nIf you have any suggestions, please follow these guidelines:\r\n\r\n1. If you have suggestions for things that you think other people would benefit from, then please suggest them.\r\n\r\n2. If you\\'re about to suggest something personal to you, say you want the Elder Scrolls taken out, then get on Creation Kit, load up the cell, and take them out yourself. The name of the cell is nyk so just hit those 3 keys to find it. However, if you don\\'t know how to use Creation Kit and would like something personal added, then feel free to suggest it and I\\'ll see what I can do.\r\n\r\n3. IF YOU KNOW HOW TO FIX THE PROBLEM WITH THE FLOORS, PLEASE FOR THE LOVE OF WHATEVER YOU BELIEVE IN, TELL ME!!\r\n\r\nPERMISSIONS:\r\n1. You can modify this file in any way, shape, or form that you\\'d like. I don\\'t really care.\r\n\r\n2. As this mod is far from perfect, if you wish to change it or make it better then reupload it, feel free. Just give me credit for the original design. I\\'d love to see what someone could turn this into, actually.",
  "categoryId": "67",
  "version": "1.0",
  "author": "FunkyCorpse",
  "createdUnix": "1381951954",
  "updatedUnix": "1381978590",
  "containsAdultContent": false,
  "uploadedBy": "FunkyCorpse",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000066954",
      "name": "A Little Hole in the Ground",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "A Little Hole in the Ground-44693-1-0.zip",
      "uploadedUnix": "1381978590",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2716a47fd53f4c738f38e73c28b12d8630bc97cdc8178437b89e9f5d8f49e8b6/analysis/1407758643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Little%20Hole%20in%20the%20Ground-44693-1-0.zip?fid=1000066954&ttl=1535825280&ri=8192&rs=8192&setec=c1aa200c394891aabd98fce81d385702"
    }
  ]
}