{
  "modId": 44708.0,
  "modName": "Huntsman Gear - Hunter-Ranger Weapons and Armor",
  "summary": "A small reworking of some vanilla models into a set of light armor and weapons aimed towards the woodsman/hunter/ranger character.",
  "descriptionHtml": "This is a personal mod, and it will be my first up on the Nexus! I always liked the look of the Mage Hood and Belted Tunic, but they were both practically useless for anything other than appearance. So I went into the Construction Kit and built my own armor out of those two pieces, and the Stormcloak Fur Boots and Gauntlets, and thought it turned out so nicely that I'd put it here for anyone that wants it. I also made some hunter/ranger-specific weapons, and one of them is for dragon hunting! They're all craftable at the forge under Wood, Hide and Steel, and the recipes are not difficult, but you may have to do a little work to gather the materials. They say Tundra Cotton is very durable and warm.... *hint hint*. None of the weapons are improvable or un-enchantable, and the armor can only be improved as much as regular old leather or bandit fur, for my own personal immersion's sake. \r\n\r\nSimple .esp install. Extract, put it in your skyrim/data folder and activate it!\r\n\r\nFeel free to use this in your mod, change it up in the CK, do whatever with it, as long as I'm credited a little :)\r\n\r\n\r\nImgur album of the mod: http://imgur.com/a/MU0Yk\r\n\r\n\r\n_ * List of Items * _\r\n\r\nArmor:\r\n\r\nHuntsman Tunic - Padded Belted Tunic with a base armor of 20\r\n\r\nHuntsman Boots/Gloves - Stormcloak-style Fur Boots and Gauntlets with base armor increased to 10\r\n\r\nHuntsman Hood - Mage Hood, padded and buffed up to a base 10, as well.\r\n\r\nBase Armor Total = 50\r\n\r\n\r\n\r\nWeapons/Custom-ish Enchantments:\r\n\r\nHuntsman Bow (now merged with Dovah Ilmah) - Imperial Bow with base 10 damage that does +10 to animals and dragons, with a bleed effect.\r\n\r\nHuntsman Blade - Steel Dagger with 8 base damage and +5 to animals. Enchantment is called \"Primal Instinct\".\r\n\r\nHuntsman Axe - Woodcutter's Axe with 10 base damage and +5 to animals. Enchantment is also \"Primal Instinct\".\r\n\r\n\r\n\r\nMy Recommended Mods:\r\n\r\nFrostfall - Hypothermia Survival\r\n\r\nBasic Human Needs - Simple yet effective hunger/thirst/sleep mod.\r\n\r\nImmersive Loot - Excellent mod that makes most things above steel very rare or contextualized. \r\n\r\nBetter Hunting Prices - Changes pelt values and weights for better hunting reward.\r\n\r\nImmersive Saturation Boost - COLOR! No performance impact whatsoever, not an ENB.\r\n\r\nDynavision - Dynamic and static depth of field effects, uses MCM for settings.\r\n\r\nMage Backpack and Backpacks Extended - Excellent enchanted backpack mod, brings a lot of depth to the \"Where does all my stuff go?\" issue.\r\n\r\nEK_LimitedItems - Limits items like arrows, lockpicks, potions, weapons and armor via a completely configurable MCM menu. Great for immersion.\r\n\r\n\r\n\r\n\r\n-CHANGE LOG-\r\n\r\n1.1 - Fixed some grammatical errors and removed the Dragonbane sword visual effect from Dovah Ilmah.\r\n\r\n1.2 - Fixed the Huntsman Axe to be recognized as a woodchopping axe.\r\n\r\n1.3 - Nerfed Dovah Ilmah's OP +40 damage to +20.\r\n\r\n1.4 - Changed recipes to use Deer Hide instead of the useless Deer Pelt, and removed/merged Dovah Ilmah with the Huntsman Bow.",
  "categoryId": "54",
  "version": "1.4",
  "author": "Arrythmia91",
  "createdUnix": "1381960522",
  "updatedUnix": "1383992311",
  "containsAdultContent": false,
  "uploadedBy": "Arrythmia91",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000067244",
      "name": "Hunting Gear - Less OP Dovah Ilmah",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Hunting Gear - Less OP Dovah Ilmah-44708-1-2.rar",
      "uploadedUnix": "1382053137",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/ceef60ba2b514e7a9ff3a9f634d08fd6fbda97a7613a10ca92b2a2c30164d717/analysis/1407759447/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hunting%20Gear%20-%20Less%20OP%20Dovah%20Ilmah-44708-1-2.rar?fid=1000067244&ttl=1535825295&ri=8192&rs=8192&setec=02927375bca3a43c2c649983fe0f8ddd"
    },
    {
      "fileId": "1000076903",
      "name": "Huntsman Gear",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Huntsman Gear-44708-1-4.rar",
      "uploadedUnix": "1383992311",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/1dd22d8762b621a6bb84b85f1a7c15ed8acd602ae4e0e54f40dfaeafa6f1f49d/analysis/1407785970/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Huntsman%20Gear-44708-1-4.rar?fid=1000076903&ttl=1535825295&ri=8192&rs=8192&setec=c66d2a337037bdbe603200b89818d1cd"
    }
  ]
}