{
  "modId": 44743.0,
  "modName": "The Alchemists Guide",
  "summary": "Have you ever wished you could hold a book that contains all the recipes for potions? Well, now that wish has been answered. Lore-friendly with new NPC\\'s, including an ingredient merchant. Obtain the five volumes that hold what ingredients go in what potions. Every type of potion. Every one.",
  "descriptionHtml": "[center]\r\n[size=7][B][U]The Alchemist\\'s Guide[/U][/B][/size]\r\n\r\n[size=4]\r\nThe Alchemist\\'s Guide is a simple mod that adds 5 books that contain all recipes for all the types of potions. The books have the potion type and any ingredient that can be used to make that potion. It is a complete guide to Alchemy. The books are retrieved in a lore-friendly way too... Well, they belong to the Varo family and if you want them, you have to steal them.[/size]\r\n\r\n[size=5][color=RoyalBlue][B]Also, now the books can be found in Arcadia\\'s Cauldron in Whiterun. They are spread out through the store.[/B][/color][/size]\r\n\r\n\r\n[size=4]I have been trying to get the merchants around Skyrim to sell these books, but have been unsuccessful. If someone knows how to get merchants to sell custom items, please let me know. I\\'d like buying the books to be able to be an option sometime in the future. Thanks.[/size]\r\n\r\n[size=5][B][U]Books?[/U][/B][/size]\r\n[size=4]\r\nThere are five books. The Alchemist\\'s Guide: Volume One, Volume Two, Volume Three, Volume Four, and Volume Five. They contain all the types of ingredients that can be used to make a certain potion. For example: if you were wanting to know what you would need to create a health potion you would bring up the correct book volume and find the health potion section. It will show you every type of ingredient you can combine to make health potions. Simple and clear.\r\n\r\nThe Alchemist\\'s Guide: Volume One - Restoration and Regeneration Ingredients\r\nThe Alchemist\\'s Guide: Volume Two - Resistance and Weakness Ingredients\r\nThe Alchemist\\'s Guide: Volume Three - Damage and Ravage Ingredients\r\nThe Alchemist\\'s Guide: Volume Four - Fortify Ingredients\r\nThe Alchemist\\'s Guide: Volume Five - Other (Contains: Cure Disease, Waterbreathing, Slow, Invisibility, ect)\r\n\r\n[B][U]Locations:[/U][/B]\r\nYou can find these books in 3 different locations right now. Inside the Varo\\'s Lodge, in a chest outside of that same lodge, and in Arcadia\\'s Cauldron in Whiterun.\r\n\r\nAnd I do plan on making unique book textures sometime in the future. But for now these books are using Vanilla textures. I know some may not agree with the book covers I\\'ve selected for these books, but please keep in mind that like the textures I\\'ve decided to use, these books cannot be found just everywhere. And one of the textures used is only used on one book that you see one time in the game. What\\'s the point in wasting a perfectly unique and neat looking texture, anyway?\r\n[/size]\r\n\r\n[U][size=5][B]The Varo Family[/B][/size][/U]\r\n[size=4]\r\nThe Varo family lives in the family lodge near Falkreath. They are born and raised Imperial alchemists that have mastered Alchemy. Mervial, the husband and father, sells alchemy ingredients and potions.\r\n\r\nI\\'ve gone through the trouble of making a new family because I plan on making them part of a quest that involves this books in the future. [/size]\r\n\r\n[size=5][U][B]Hidden Chest[/B][/U][/size]\r\n[size=4]\r\nI\\'ve placed a small hidden chest somewhere near the lodge that contains extra copies of the books in case you were to lose one. There is a hint on the location in Mervial\\'s Journal.\r\n[/size]\r\n\r\n[size=5][U][B]Future Plans[/B][/U][/size]\r\n[size=4]\r\nI do plan on adding things to this mod in the future. \r\nThe adults in the household will be trainers and I am hoping to involve a quest sometime down the line. There are more things I plan on doing, but I will keep that as a surprise. :P But don\\'t wait for the updates, I don\\'t know when this will be done as of yet.\r\n[/size]\r\n\r\n[U][B]Change Log[/B][/U]\r\n\r\n10/17/13:\r\nAdded V2; Changed the new family NPC\\'s last name to Varo.\r\nAdded the 5 books to Arcadia\\'s Cauldron in Whiterun.\r\n\r\n\r\n[U][B]Problems?[/B][/U]\r\nIf you come across any problems, let me know. :) Thanks.\r\n\r\n[/center]\r\n",
  "categoryId": "94",
  "version": "V2",
  "author": "FatalxSyn",
  "createdUnix": "1381997463",
  "updatedUnix": "1382044640",
  "containsAdultContent": false,
  "uploadedBy": "FatalxSyn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000067008",
      "name": "The Alchemists Guide",
      "version": "V1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20",
      "fileName": "The Alchemists Guide-44743-V1.rar",
      "uploadedUnix": "1381997449",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/b041429369161a87cd1b9f18d59e3b2e59de466e343d7c09552022f6389cb8b5/analysis/1407758943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Alchemists%20Guide-44743-V1.rar?fid=1000067008&ttl=1535825323&ri=8192&rs=8192&setec=f554234c8e07fb4a094f5f579fef146b"
    },
    {
      "fileId": "1000067192",
      "name": "The Alchemists Guide",
      "version": "V2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "The Alchemists Guide-44743-V2.rar",
      "uploadedUnix": "1382044640",
      "modVersion": "V2",
      "virusScanUrl": "https://www.virustotal.com/file/6024655e3ae1b16969a29a6c2c0a0f95d0c55755a7513a58251cdfe05aefc029/analysis/1407759303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Alchemists%20Guide-44743-V2.rar?fid=1000067192&ttl=1535825324&ri=8192&rs=8192&setec=ae9075369fc933c849c6c8b89ccf9b1e"
    }
  ]
}