{
  "modId": 44797.0,
  "modName": "Sinderions Actual Field Laboratory",
  "summary": "A completely revamped version of Sinderion\\\\\\'s Field Lab to give it more functionality and make it an actually usable household. Major additions include mannequins, weapon and shield wall-mounts, dagger shelves, crafting areas, lighting, bookshelves, three followers, a mount, and Nirnroot gardens. Have fun!",
  "descriptionHtml": "A completely revamped version of Sinderion\\'\\'s Field Lab to give it more functionality and make it an actually usable household. Major additions include mannequins, weapon and shield wall-mounts, dagger shelves, organized storage urns, crafting areas, lighting, bookshelves, three followers, a mount, and Nirnroot gardens. \r\n\r\n       The interior has been entirely redone with custom lighting, weapon/shield mounts, dagger mounts, bookshelves, mannequins, a functional bed, dining table, alchemy station, workbench, and custom items pertaining to Skyrim lore. \r\n\r\n       Pertaining to the exterior of the house, a tent has been added with three new followers with different abilities, crafting stations have been added for increased functionality to the household, a new mount has been added so mounted movement and combat is now available in Blackreach (without using other mods to summon the horse), Nirnroot and crimson Nirnroot gardens have been added as I feel as though Sinderion would know enough information about Nirnroot as to be able to plant it, which by my standards makes this lore-friendly.\r\n\r\n       A balcony has been added to the Lab for practice in archery as well as for a greater view of Blackreach. The entrance to the balcony can be found on the roof of the interior of the Lab, as well as an entrance to Whiterun which will prove very useful. To be able to use the Whiterun entrance, one must first visit Sinderion\\'s Field Laboratory by manually going to Blackreach. In addition to this, keys can be located in hidden locations around the game that will open up new pathways back to the house that would theoretically simply be shoots that sent the player back underground to Blackreach; these doors can be located on the balcony. Sinderion\\'s body can be found next to the fireplace, I shrunk the skeleton so it wouldn\\'t interfere with the design of the house, but it is there, and so is his notebook.\r\n\r\n       I made this mod a while ago and thus, there may be problems, yet I have taken up the task of fixing these problems and will be attending other bugs that are found promptly. Be warned, the bookshelf does not work properly with the infinite bookshelves mod.\r\n       *NOTE*: Pictures were taken using the Immersive Weapons mod, Kynesguard/Daedra Hunter armor, and Mistveil ENB autumn edition (with some things turned on/off).\r\n**No-Follower Version available**",
  "categoryId": "67",
  "version": "1.15",
  "author": "Thejimster82",
  "createdUnix": "1382654793",
  "updatedUnix": "1382757577",
  "containsAdultContent": false,
  "uploadedBy": "Thejimster82",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000070254",
      "name": "Sinderions Field Laboratory",
      "version": "1.15",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "152",
      "fileName": "Sinderions Field Laboratory-44797-1-15.zip",
      "uploadedUnix": "1382654612",
      "modVersion": "1.15",
      "virusScanUrl": "https://www.virustotal.com/file/6d46c5cd7e651b31fd2316d0d63e39b6cb8dfcdc3cf611f4ec595f4a091ebc8e/analysis/1407767883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sinderions%20Field%20Laboratory-44797-1-15.zip?fid=1000070254&ttl=1535825374&ri=8192&rs=8192&setec=c2cf222ded3fb6784434cd4044f5d616"
    },
    {
      "fileId": "1000070674",
      "name": "Sinderions Field Laboratory Without Followers",
      "version": "1.1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "154",
      "fileName": "Sinderions Field Laboratory Without Followers-44797-1-1-5.zip",
      "uploadedUnix": "1382757577",
      "modVersion": "1.1.5",
      "virusScanUrl": "https://www.virustotal.com/file/129b0abf8d2e35a1dad7ed350760790f1388e190f8ca2f3b52a2749eee089af6/analysis/1407768963/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sinderions%20Field%20Laboratory%20Without%20Followers-44797-1-1-5.zip?fid=1000070674&ttl=1535825374&ri=8192&rs=8192&setec=8b13a4eef278f19cd09e86a1e878a42b"
    }
  ]
}