{
  "modId": 44804.0,
  "modName": "Shout Travel",
  "summary": "Find new Wordwalls to learn new Dragon Shouts (11) and use Dragon Souls to unlock the new shouts that are used to fast travel to different locations in Skyrim. Works in both 1st and 3rd person just like vanilla shouts. Companions and horses travel with you. No DLCs required.",
  "descriptionHtml": "Shout Travel\r<br /> 4Jan2014\r<br />\r<br />Find new Wordwalls to learn new Dragon Shouts (11) and use Dragon Souls to unlock the new shouts that are used to fast travel to different locations in Skyrim. Works in both 1st and 3rd person just like vanilla shouts. Companions and horses travel with you. No DLCs required.\r<br />\r<br />\r<br />[img]http://static2.nexusmods.com/15/mods/110/images/44804-3-1382075144.jpg[/img]\r<br />\r<br />\r<br />Current Shout Locations\r<br />From anywhere (inside or outside) in Skyrim to;\r<br />\r<br />Sky Haven Temple\r<br />High Hrothgar\r<br />Windhelm\r<br />Falkreath\r<br />Solitude\r<br />Morthal\r<br />Dawnstar\r<br />Markarth\r<br />Riften\r<br />Whiterun\r<br />Winterhold\r<br />\r<br />You can Shout Travel as far away from your destination or get closer to your destination before you use your shout. You choose the type of immersion and justification of using the shouts the way you want.\r<br />\r<br />NOTE: Go to Sky Haven Temple and find The Book of Travel.\r<br />\r<br />REQUIRED MODS\r<br />None, not even any DLCs.\r<br />Just make sure that you have a legal version of Skyrim with all the updates.\r<br />\r<br />Known Issues\r<br />The visual effect coming from the Wordwall and the actual dragon word don’t show up. This is a minor issue I will keep working on, but everything else in this mod works as indicated.\r<br />End of Known Issues\r<br />\r<br />FAQ\r<br />\r<br />Q. Can this mod be added or updated to my game at any time?\r<br />A. Yes, you can add or update this mod at any time during your game play.\r<br />\r<br />Q. Where are the Wordwalls?\r<br />A. I will give you the first Wordwall location, but the others you will have to find. The pictures on the mod page should give you some clues as to their locations. All Wordwalls will be in the general area of their Shout Travel locations. The Sky Haven Temple Wordwall is outside in the training courtyard.\r<br />\r<br />Q. Will my Character do the Voice or are these Silent Shouts?\r<br />A. Right now you only hear the shout audio effect. It&#39;s the effect you hear if you Whirlwind Sprint. In a future update I might add the code in the script to determine what race and gender the character is to use as the voice.\r<br />\r<br />Q. I couldn’t learn the word from a Wordwall. I hear the Wordwall sound, but no word is learnt.\r<br />A. Sometimes this could happen. There are times when Bethesda’s script engine won’t start scripts, so use the following console commands for any word you want to learn. The Wordwall sound will still be heard if you use console commands to learn the word.\r<br />\r<br />XX where XX is the location number in your load order.\r<br />\r<br />For Winterhold - In the console, type the following; teachword xx006ADA\r<br />For Solitude - In the console, type the following; teachword xx005FC5\r<br />For Whiterun - In the console, type the following; teachword xx006ACF\r<br />For High Hrothgar - In the console, type the following; teachword xx002443\r<br />For Riften - In the console, type the following; teachword xx006561\r<br />For Sky Haven Temple - In the console, type the following; teachword xx002442\r<br />For Windhelm - In the console, type the following; teachword xx0054E9\r<br />For Falkreath - In the console, type the following; teachword xx005A56\r<br />For Dawnstar - In the console, type the following; teachword xx005FE0\r<br />For Markarth - In the console, type the following; teachword xx005FEE\r<br />For Morthal - In the console, type the following; teachword xx005FD4\r<br />\r<br />End of FAQ\r<br />\r<br />\r<br />Skyrim Nexus link: http://skyrim.nexusmods.com/mods/44804//?\r<br />\r<br />Steam link: http://steamcommunity.com/sharedfiles/filedetails/?id=186817961\r<br />\r<br />\r<br />Update History -\r<br />\r<br />4Jan2014 – Added the Shout Words to the Form Table so that if a Wordwall didn’t work to give the player the word, the player could use console commands to get the word. A Dragon Soul is still required to unlock the word.\r<br />1Nov2013 – Added Windhelm, Falkreath, Solitude, Morthal, Dawnstar, Markarth, Riften, Whiterun, Winterhold, and The Book of Travel\r<br />18Oct2013 – Added High Hrothgar\r<br />17Oct2013 – Initial Release\r<br />",
  "categoryId": "78",
  "version": "4Jan2014",
  "author": "ItsMeToo on Nexus and klcjr on Steam",
  "createdUnix": "1382077298",
  "updatedUnix": "1388874966",
  "containsAdultContent": false,
  "uploadedBy": "ItsMeToo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000073577",
      "name": "Shout Travel 1Nov2013",
      "version": "1Nov2013",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23",
      "fileName": "Shout Travel 1Nov2013-44804-1Nov2013.zip",
      "uploadedUnix": "1383318223",
      "modVersion": "1Nov2013",
      "virusScanUrl": "https://www.virustotal.com/file/3db401f6459c90f748b6a4c2e272f5018b8c921f8b669b13a5c00f84502e80f3/analysis/1407777243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shout%20Travel%201Nov2013-44804-1Nov2013.zip?fid=1000073577&ttl=1535825380&ri=8192&rs=8192&setec=72fb9fb8b35909d792c0fa160f62402f"
    },
    {
      "fileId": "1000089918",
      "name": "Shout Travel 4Jan2014",
      "version": "4Jan2014",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24",
      "fileName": "Shout Travel by ItsMeToo on Nexus and klcjr on Steam-44804-4Jan2014.zip",
      "uploadedUnix": "1388874966",
      "modVersion": "4Jan2014",
      "virusScanUrl": "https://www.virustotal.com/file/fb91c2d8b1334403ad6e1413b0012bc27e03b4acc2c5e38612a2a0075d81e393/analysis/1407872353/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shout%20Travel%20by%20ItsMeToo%20on%20Nexus%20and%20klcjr%20on%20Steam-44804-4Jan2014.zip?fid=1000089918&ttl=1535825381&ri=8192&rs=8192&setec=8c0ad79608240040d2314bc960ab7c15"
    }
  ]
}