{
  "modId": 44916.0,
  "modName": "Windcallers Pass",
  "summary": "Custom dungeon for Skyrim. An ancient mountain pass thru the depths of High Hrothgar.",
  "descriptionHtml": "Hi everybody. This is my second Skyrim dungeon mod. Here is a short description:\r<br />\r<br />-This map contains Frost Spiders, but as an optional, clearly marked path. Therefore, they can be avoided altogether. As for people who love spiders, well you guys are in for a treat.\r<br />\r<br />-It is an ancient mountain pass that goes thru the depths of High Hrothgar. It has two entrances. North entrance is located east from Whiterun, close to the Stormcloak Whiterun Camp. South entrance is located at the south edge of Ivarstead, right next to the road sign.\r<br />\r<br />-It is of medium difficulty, bordering hard at some points. As such, it is suitable for characters of Level 20 and above. Lower level characters may find it a bit too difficult, but still they will be able to get the loot and avoid most of the fighting by using sneaking.\r<br />\r<br />-It is half the length of my previous dungeon (Ogmund&#39;s Tomb) and provides around 30 minutes of gameplay.\r<br />\r<br />\r<br />Feel free to rate and comment. Again, I am interested to know if this map feels like something that could have been created by Bethesda&#39;s designers for the original Skyrim. Thanks.\r<br />\r<br />\r<br />This map has been cleaned with &#39;TES5 Edit&#39; tool. But if you experience any bugs, crashes, odd loading times or any similar problems, please let me know.\r<br />\r<br />\r<br />NOTE: If you liked this dungeon mod, feel free to check out my other 2 dungeons: \r<br />-Ogmund&#39;s Tomb. \r<br />-Engelmann&#39;s Rest. \r<br />\r<br />",
  "categoryId": "88",
  "version": "1.3",
  "author": "Predrag Pesic",
  "createdUnix": "1382199268",
  "updatedUnix": "1383147859",
  "containsAdultContent": false,
  "uploadedBy": "PredragPesic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000072727",
      "name": "WindcallersPass",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "264",
      "fileName": "WindcallersPass-44916-1-3.rar",
      "uploadedUnix": "1383147859",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/ba6368b33bb1eecebf3b7726422200eb4f009a6fdec2a2197aaa628d0c8b7989/analysis/1407775093/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WindcallersPass-44916-1-3.rar?fid=1000072727&ttl=1535825481&ri=8192&rs=8192&setec=b3a2d1b54b942e37bd75558c8a88eb37"
    }
  ]
}