{
  "modId": 44922.0,
  "modName": "Inferno- Envoys of End",
  "summary": "The Ascended have arisen once more to set their plans in motion, this time accompanied by powerful beings of a world unknown. Only you, the Dragonborn can set the world right once again. \r<br />\r<br />Will you claim the trials of challenge or fall to the voids of death? The fate of all now rests in your hands.\r<br />\r<br />NEW CONTENT NOW AVAILABLE",
  "descriptionHtml": "[url=https://flic.kr/p/npiJk1][img]https://farm3.staticflickr.com/2897/14047230830_a6f8aaa61f_b.jpg[/img][/url]\r<br />\r<br />[center][i]The Ascended have arisen once more to set their plans in motion, this time accompanied by powerful beings of a world unknown. Only you, the Dragonborn can set the world right once again. \r<br />\r<br />Will you claim the trials of challenge or fall to the voids of death? The fate of all now rests in your hands.[/i][/center]\r<br />\r<br />[url=https://flic.kr/p/qJskT9][img]https://farm8.staticflickr.com/7434/16232995058_77242fa5f4_o.png[/img][/url]\r<br />[url=https://flic.kr/p/q5mXgD][img]https://farm9.staticflickr.com/8602/15801916583_5e4ab1de38_b.jpg[/img][/url]\r<br />[center]Inferno: The Blood Marked is now available for download&#33; Click the link below&#33;[/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/61776/?]Inferno: The Blood Marked[/url][/center]\r<br />\r<br />[url=https://flic.kr/p/npmHyA][img]https://farm6.staticflickr.com/5311/14047813590_c51a164ef8_o.png[/img][/url]\r<br />\r<br />[center][youtube]7RxQ642tYGU[/youtube][youtube]yOMMhxNul68[/youtube][youtube]MFKoaRRtFCY[/youtube][youtube]myjQFUQ-lmg[/youtube][youtube]BnUx97hKn9o[/youtube][youtube]hQJYzE8kbhk[/youtube][youtube]zgsxheCZGxc[/youtube][youtube]fXQBdwXUR1s[/youtube][youtube]mAhrhMs6vao[/youtube][youtube]zA5Ts4EvOKI[/youtube][/center]\r<br />\r<br />[center]Thank you MMOxReview, Brodual, Seriezs, Gruntlock, VeeJay4com, Jerry Pool, FlaviusZeno, Moicano,\r<br />Der Karazard, and ナタリアポク口ンスカヤ for the reviews/videos&#33;[/center]  \r<br />\r<br />[url=https://flic.kr/p/nDNwxh][img]https://farm3.staticflickr.com/2918/14211280366_3dab3e3ae5_o.png[/img][/url]\r<br />\r<br />The harshest of trials await as you set forth to stop a band of mages from spreading havoc and chaos across the land. Master their powers, unravel their secrets, and ultimately put an end to their tyranny of evil. \r<br />\r<br />As a re-release of the original Inferno, this mod introduces unique challenges and enemies for both new and returning players alike.\r<br />\r<br />Included in this mod are:\r<br />\r<br />[b]Main Storyline[/b]\r<br />\r<br />Fight to conquer the shadows of the Ascended as you play through this enthralling story. Collecting powerful spells and battling the toughest of bosses along the way.\r<br />\r<br />[b]Dragon Seeker[/b]\r<br />\r<br />Put your skills to the ultimate test as you go head to head with some of the most dreaded dragons Skyrim has to offer. Introduces new combat mechanics to make fighting dragons like no other experience to date.\r<br />\r<br />[b]New Summons and Spells[/b] \r<br />\r<br />Expand your arsenal of magic as you gather mighty summons and spells to lay waste to your foes.\r<br />\r<br />[b]Increased Difficulty[/b] \r<br />\r<br />Dare to brave a new level of difficulty as enemies are stronger than ever before.\r<br />\r<br />[color=red][b]IMPORTANT:[/b][/color] This mod is extremely difficult and may not appeal to everyone. Use your best judgment before installing. Recommended level is 35 and up.\r<br />\r<br />The one requirement for this mod is Skyrim (latest version recommended). No outside mods (skin, hair, clothes, and etc.) are included within this mod. This mod is not quest scripted. \r<br />\r<br />Autosaving is disabled inside the Sphere of Darela. Be sure to save before each new battle. \r<br />\r<br />[url=https://flic.kr/p/nFDrGY][img]https://farm6.staticflickr.com/5502/14232141092_10fa0bd57a_o.png[/img][/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/49144] Inferno Envoys of End: Polish Translation[/url] Credited to [url=http://www.nexusmods.com/skyrim/users/4550105/?] Asmodarius [/url]\r<br />\r<br />[url=https://flic.kr/p/npmuRk][img]https://farm3.staticflickr.com/2937/14047770829_a594085431_o.png[/img][/url]\r<br />\r<br />Start the main quest by heading to Dragonsreach (Whiterun), and searching the study chambers of Farengar Secret-Fire. A journal can be found lying on the floor, and after reading it contents it will direct you to Labyrinthian to meet up with the first member of the Ascended.\r<br />\r<br />[url=https://flic.kr/p/npjmtU][img]https://farm6.staticflickr.com/5531/14047352450_74e923f447_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nFPRGU][img]https://farm3.staticflickr.com/2926/14234172944_1b6a549c5d_o.png[/img][/url]\r<br />\r<br />[color=red][b]IMPORTANT:[/b][/color] Make sure to download the &#34;Facegendata&#34; File in addition to the main file. This will get rid of any grey faces you may see on certain members of the Ascended.\r<br />\r<br />This mod can be installed through the Nexus Mod Manager or downloaded manually and unzipped using an extraction program, which allows you to unpack files (WinRAR, 7-zip, etc).\r<br />\r<br />Extract the contents of the file to a memorable location and either copy or drag the extracted folder (the outside folder called Data) into your Skyrim folder. Depending on how your game was installed the file will be in varying locations:\r<br />\r<br />[b]C:Program Files (x86)SteamSteamAppsCommonSkyrimData[/b] \r<br />\r<br />[b]C:Program FilesSteamSteamAppsCommonSkyrimData[/b]\r<br />\r<br />[b]C:GamesSteamSteamAppsCommonSkyrimData[/b]\r<br />\r<br />Do not forget to activate the esp using the Skyrim Launcher or Nexus Mod Manager. This mod should be placed at the bottom of your load order to prevent possible issues. To remove this mod and its contents you will need to deactivate and uninstall with the Nexus Mod Manager or manually remove:\r<br />\r<br />[b]XAMNANT.ESP[/b]\r<br />\r<br />[color=red][b]IMPORTANT:[/b][/color] If you choose to manually uninstall this mod then please refer to the Readme included within the file of this mod. The only reason it is not posted in this section is because of limited space.\r<br />\r<br />It is recommended to have a clean save as a backup in case of any issues that may occur before and after the installation.\r<br />\r<br />[url=https://flic.kr/p/npmHD5][img]https://farm3.staticflickr.com/2916/14047813850_81a745b10c_o.png[/img][/url]\r<br />\r<br />Due to the amount of effects on the follower included in this mod sometimes dialogue options will not be able to be selected after the follower engages in longwinded combat, this problem can be fixed by creating a save and reloading or merely entering a new cell (cave, house, tavern, etc). \r<br />\r<br />The dragons included within this mod utilize unique meshes that when certain ENBS are applied will give them an almost plastic like appearance (in the default game with no ENBS added this does not occur).\r<br />\r<br />If you encounter any additional issues please send me a message in the comment section and once confirmed I will update this section accordingly.\r<br />\r<br />[url=https://flic.kr/p/npmQ6a][img]https://farm3.staticflickr.com/2920/14047835547_18012d9990_o.png[/img][/url]\r<br />\r<br />This mod and its contents are not compatible with mods that dramatically change the meshes for the Black Wolf, Frostbite Spider, Default Dragon, Blood Dragon, Troll and the Skeleton enemy model. \r<br />\r<br />[color=red][b]IMPORTANT:[/b][/color] Inferno: Envoys of End is not compatible with Inferno: Advents of Flame. Simultaneously running both mods is not recommended.\r<br />\r<br />Inferno: Envoys of End is compatible with mods that edit the behavior of dragons. This includes but is not limited to Deadly Dragons, Enhanced Mighty Dragons, and Dragon Combat Overhaul. Although Dragon Combat Overhaul will overwrite some of the attacks included in this mod.\r<br />\r<br />If you encounter any additional incompatibilities please send me a message in the comment section and once confirmed I will update this section accordingly.\r<br />\r<br />[url=https://flic.kr/p/npmPTr][img]https://farm3.staticflickr.com/2940/14047834867_a9d4e6297a_o.png[/img][/url]\r<br />\r<br />[color=red][b]IMPORTANT:[/b][/color] Inferno: Envoys of End introduces new mechanics to traditional gameplay. It is highly recommended that you read this section, which highlights the changes that are introduced from installing this mod. Please note that only enemies introduced within this mod are affected by these new attributes.\r<br />\r<br />[url=https://flic.kr/p/npmuVP][img]https://farm3.staticflickr.com/2936/14047771089_e88aa8be3c_o.png[/img][/url]\r<br />\r<br />When read, these ancient tomes hold the power to grant the player a specific ability based on varying attributes. These powers can range anywhere from being strictly offensive to focusing purely on defense. Some Xamnants even go beyond these means such as Panoria, an off-worldly ability which boosts the user’s strength at the cost of their life. All Xamnants can be found on the bodies of either mages or dragons included within this mod. \r<br />\r<br />[color=red][b]IMPORTANT:[/b][/color] Many members of the Ascended are immune to the common forms of magic found within Skyrim therefore they can only be harmed through the use and practice of these tomes.\r<br />\r<br />[url=https://flic.kr/p/npmHPA][img]https://farm6.staticflickr.com/5502/14047814460_d1da459e3c_o.png[/img][/url]\r<br />\r<br />The player can collect the [b]&#34;Rage Fires&#34;[/b] the dragon Vokulvokun drops from his attacks, store them in their misc inventory, and drop them to create massive explosions in the surrounding area. Best to use them in the boss fight against him as they will temporarily stun and prevent him from attacking. Simply select [b]&#34;Take Rage Fire&#34;[/b] when the attack is being launched and use as you see fit. \r<br />\r<br />[color=red][b]IMPORTANT:[/b][/color] Use with caution on low-end computers, dropping too many at one time can potentially freeze your game. However, a simple restart will fix the issue.\r<br />\r<br />[url=https://flic.kr/p/nFPRHA][img]https://farm3.staticflickr.com/2924/14234172984_ff2f71ef5c_o.png[/img][/url]\r<br />\r<br />Four dragons included within this mod do not possess souls to absorb. The dragons which fall into this category are Aaldu, Alchemic Dragon, Revaktiid, and Wahdir. \r<br />\r<br />[url=https://flic.kr/p/nDNwyj][img]https://farm3.staticflickr.com/2914/14211280426_92588ddb73_o.png[/img][/url]\r<br />\r<br />Enemies giving you the slip? Stuck on that one boss that seems to be impervious to damage? Your days of worry and woe are over. From the enemies of your past to the foes of your future, claim victory through the helpful guide included below. \r<br />\r<br />[url=https://flic.kr/p/nFB2SY][img]https://farm6.staticflickr.com/5489/14231670712_c924225327_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nFR7ne][img]https://farm3.staticflickr.com/2897/14234417375_0160cf4b88_o.png[/img][/url]\r<br />\r<br />First of the Ascended his specializations in the elements of lightning and electricity grant him the ability to outmaneuver and out speed his opponents in battle. He has four abilities on which he uses throughout battle:\r<br />\r<br />[b]Roaring Spark:[/b] A ball of electricity that causes mass amounts of damage once it explodes. Although lethal, the speed of the projectile is extremely slow. You should be able to easily maneuver through its firing enough to close the gaps between you and Dolan.\r<br />\r<br />[b]Static Burst:[/b] This spell has a real kick to it and more than likely it will completely catch you off guard. There is no true way of avoiding damage from this, serving as a commendable obstacle as it makes Dolan almost completely untouchable in close combat, your best chance of overcoming this spell are shouts like Become Ethereal and attacks which damage from a far. \r<br />\r<br />[b]Lightning Veil:[/b] A veil of electricity, which shields the user from harm. Almost instantaneously Dolan will activate this spell once you engage him in combat. The shielding is magically strong but not physically sturdy as a few good blows will cut through his life providing you can get close enough to land a hit. \r<br />\r<br />[b]Spatial Healing:[/b] Using the fabrics of space to heal his wounds Dolan will continuously cast this spell once his health reaches low. Unless you like the idea of extending this fight you will need to hinder him from casting this spell as much as possible. Any form of Unrelenting Force works wonders, as it will give you enough time to tie up any loose ends and quickly go in for the kill.\r<br />\r<br />[url=https://flic.kr/p/nFDrVo][img]https://farm6.staticflickr.com/5486/14232141812_46b1278aba_o.png[/img][/url]\r<br />\r<br />Ferna is a dark elf with the power of frost and ice at her disposal. She wields her spells in a chilling rage turning all who cross her into shatters of ice. Her attacks are incredibly fast and difficult to dodge. If not careful she will finish you off before the battle even has time to begin. Her attacks consist of:\r<br />\r<br />[b]Frost Armor:[/b] A protective shell of ice, which shields Ferna from the harshest of blows. It strengths her defense and makes her an almost impenetrable force on the battlefield. If you got the muscle you can crack through her shields with the slightest of efforts. Shouts like Marked For Death are a good way of breaking through this otherwise impassable barrier. \r<br />\r<br />[b]Weighted Rime:[/b] A debilitating blast of ice that will quickly bring your stamina to a crawl. This projectile moves with such swiftness and speed that it is merely impossible to evade. Bring plenty of potions that restore stamina, as you will need quite a few to maintain your pace throughout battle.\r<br />\r<br />[b]Frost Bind:[/b] A whirling ball of frost that envelops its victims in an icy shroud. When dealing with this spell it is best you pack potions and equip armor that reduces damage done by frost. With careful planning and the appropriate gear you can easily learn to avoid its fury.\r<br />\r<br />[url=https://flic.kr/p/npmHxd][img]https://farm6.staticflickr.com/5501/14047813510_b3423d0079_o.png[/img][/url]\r<br />\r<br />With an endless pool of magicka and godlike spells at his beck and call the battle with the Great Mage is far from easy. Like his comrades he is immune to almost all magic and teleports in and out of battle when taking damage. His attacks are not only deadly but some are completely unavoidable and will strike you down in a matter of seconds. His spells are as followed: \r<br />\r<br />[b]Timeless Angel:[/b] Despite its name this attack is far from heavenly. Its mass size and sluggish pace serve to limit your movements and set you up for far more devastating blows. You will need speed on your side if you hope on avoiding this spell as it can quickly overtake you in terms of numbers.\r<br />\r<br />[b]Timeless God:[/b] A destructive beam of light that damages anything in its path, its hit ratio is extremely poor so expect a constant stream of hit and miss. Despite this fact the spell is still a pain to deal with. You may need to slow time itself if you hope on not meeting an abrupt end from its assault. \r<br />\r<br />[b]Unbound Realm:[/b] Completely unavoidable the Unbound Realm drains magic, stamina, and depending on how close you are to Samel when this ability goes off, life itself. It will deplete all three bars in a matter of seconds and leave you open for a quick finishing blow. The trick to minimizing the damage is to put distance between you and him, as this will cut back on your pools being ravaged by this effect. Bring plenty of potions to restore all three attributes, as you will definitely be using them throughout this battle. \r<br />\r<br />[b]Time Split:[/b] Time Split grants Samel the ability to create a temporary clone to distract you in battle while he pulls himself out of the fight to mend his wounds. Stay on your toes to avoid the combined spells of the two and continue your entourage of attacks once the clone has subsided. \r<br />\r<br />[b]Gorel:[/b] With its ruinous fireballs and streams of fire Gorel is a form of wraith unlike any you have encountered throughout Skyrim. Landing almost any physical hits on this creature will be tough as it can levitate to a height on which the player cannot reach. To add salt to the wound it has a terrifying ability known as Blood Clone. As an unavoidable effect run for cover and wait for the summoning of Gorel to expire when things start getting chaotic. Remember fire resistance items are a godsend against this formidable foe.\r<br />\r<br />[url=https://flic.kr/p/nDNwt9][img]https://farm3.staticflickr.com/2935/14211280126_e25eeeaf99_o.png[/img][/url]\r<br />\r<br />With her fiery temper and scorching flames Parna is the true embodiment of destruction. Her fixation with all things fire is the direct consequence of a life burdened with cruelty and pain. Her mind fueled only by rage and an undying flame which can never be extinguished. Her spells are as followed:\r<br />\r<br />[b]Incineration:[/b] This spell lets loose a potent burst of flame. Igniting the air and its surrounding currents. As her main form of attack Parna will simultaneously use this attack to try and put a means to your end. Stay on your guard and ready a potion for healing as a single blast can cause significant harm to your health.\r<br />\r<br />[b]Flames of the Phoenix:[/b] Parna will make use of this unique ability once her life begins to reach low, restoring her health at a rapid pace. A strong enough blast of the Unrelenting Force Shout works wonders when attempting to avert certain spells from being cast or activated, and this is the perfect situation to take full use of its power. \r<br />\r<br />[b]Searing Shield:[/b] Flames, which envelope the caster in a fiery cloak. Be wary of close combat when this power is activate as its high radius and immense damage will rapidly whittle your health. Distance is your friend if you wish to keep the fires of these terrible flames at bay. \r<br /> \r<br />[url=https://flic.kr/p/npmPYX][img]https://farm6.staticflickr.com/5539/14047835187_2208bc2792_o.png[/img][/url]\r<br />\r<br />Having heard rumors of their depravity and madness Gaern was hesitant about joining the order. His misplaced trust in his brother Renal led him to follow in his wayward footsteps ultimately finding his way into their devious ranks. Like his partner in crime he uses the strength of the sword to slash his way to victory. Be on your guard as when paired with his brother not a soul alive can match their combined skills and speed.\r<br />\r<br />[b]Thunder Force:[/b] Lightening Strike is a shared ability between Gaern and Renal. Take enough swings from their blades and you will see this spell up close and personal. Not much can be done in terms of avoidance, so remember to take a few minutes to heal when this spell starts making significant strikes on your health as you will be taking twice the amount of damage during the course of this battle.\r<br />\r<br />[url=https://flic.kr/p/nFyeCg][img]https://farm6.staticflickr.com/5120/14231124891_30001571cf_o.png[/img][/url]\r<br />\r<br />Renal is the brother of Gaern. As a swordsman he wields his blades under the name of the Ascended. Not only has he mastered the art of the sword but his ties with the Great Mage has strengthened his skills in the ways of magic. With his legendary speed and a pair of deathly blades to match he is an extremely tough opponent to tangle with. His powers are as followed:\r<br />\r<br />[b]Thunder Force:[/b] Lightening Strike is a shared ability between Renal and Gaern. Please see the description of Gaern for details regarding this ability.\r<br />\r<br />[url=https://flic.kr/p/npmHwG][img]https://farm3.staticflickr.com/2926/14047813480_a14f8e5a45_o.png[/img][/url]\r<br />\r<br />A sadistic soul who takes pleasure in the deaths of his foes; silencing them through stifled screams of drowning cries. His powers are as followed:\r<br />\r<br />[b]Blessing of the Tide:[/b] The ability to raise a wall of water to shield himself from harm is why fighting Sarshel quickly becomes a pain. Luckily the only real threat from this ability is its overwhelming increase to defense. Like Frost Armor this spell is weak to the shout Marked for Death. Make use of the ability to severely cripple his guard.\r<br />\r<br />[b]Sea Sphere:[/b] A surge of water that explodes on impact. What it lacks in damage it makes up for in speed. Watch for its movements, as these blasts can be easily avoided provided you give yourself enough time to react and evade.\r<br />\r<br />[b]Water Rush:[/b] Beware what lies below as this spell sends deadly streams of water spouting from the earth. Speed is enough to win out over this ability. As long as you have a keen sense of timing and movement you should be able to avoid being hit from its fatal spouts. \r<br />\r<br />[url=https://flic.kr/p/npmuWE][img]https://farm3.staticflickr.com/2933/14047771138_386ce025de_o.png[/img][/url]\r<br />\r<br />There are few who know the secrets of this woman, and even fewer who know of her terrifying power. Often referred to as the Cursed Art, this power of manipulation is to control the victim through the flows of their own blood. Ranging from internal rupturing to the complete destruction of the body. Use the utmost caution when entering this fight. You will find this power difficult to dodge and even harder to endure. Her abilities are listed below:\r<br />\r<br />[b]Bloody Wounds:[/b] The power to damage through the means of blood. This frightening spell is well to be feared as its ability to stagger and damage spells the end for almost any foe. Avoid taking multiple shots from this ability for a single blow can severely cripple your health. You will need to either attack from afar or have a companion or summon draw the attention of Lana long enough to land a successful blow. \r<br />\r<br />[b]Accursed Ground:[/b] With this ability in effect Lana can let loose the power of blood to wreak havoc on her foes. Like all spells with lingering effect its important to keep an eye on your main bar to avoid this power creeping through your health.\r<br />\r<br />[b]Blood Puppetry:[/b] When casts the body looses all forms of control. The blood weighted down through debilitating pressure instantly dropping its victim to the floor. In this debilitated state you are open to direct damage. Get acquainted with healing through potions as you will need to be constantly restoring health to have any chances of survival.\r<br />\r<br />[url=https://flic.kr/p/nHCyug][img]https://farm3.staticflickr.com/2919/14254601783_f3e78bce69_o.png[/img][/url]\r<br />\r<br />A mage whose mastery of the earth and its elements make him quite the admirable foe. He wields his spells under the order of the Ascended; crushing all under the weight of his wrath. He has a total of three spells:\r<br />\r<br />[b]Stone Break:[/b] Wonder what its like to get hit by a brick wall? Wonder no more as Stone Break will put your curiosity to rest. Striking with a force so strong it will literally hurl you along the ground if you are unluckily enough to suffer one of its crushing blows. Speed and agility are the keys to its avoidance as walking will earn you a good foot in the grave when dealing with this attack. \r<br />\r<br />[b]Veil of the Earth:[/b] Clouding its user in a blinding veil Rohnin will cast this spell in an effort to distract and confuse. He becomes increasingly difficult to sense or strike when this shroud is up and active. You will need to either wait until the veil is dropped before launching attacks from up-close or utilize arrows and spells to deal damage from a distance. \r<br />\r<br />[b]Upsurge:[/b] A spell that strikes from the bowels of the earth. It harms those who are too slow to avoid its continuous blasts. This will certainly keep you on your feet as running is your only option if you wish to avoid its frequent counts of damage. \r<br />\r<br />[url=https://flic.kr/p/npmvca][img]https://farm3.staticflickr.com/2916/14047771979_9378f2f086_o.png[/img][/url]\r<br />\r<br />Wielder of space, master of chaos. Apostle has far exceeded the mortal realms of magic. His terrifying mastery of the arcane has allowed him to reach the heights of power on which none thought humanly possible. Be weary when challenging this mage to battle; he has ascended to the very epitome of turmoil.\r<br />\r<br />[b]Chaos Space:[/b] So destructive is the nature of this spell that all use and practice of its art is forbidden amongst the magic world. With unfathomable power it tears through the bounds of space casting dimensional ripples throughout time. Ignoring all forms of buffs and defense avoid taking direct hits at all cost for few can survive its horrific blasts. \r<br />\r<br />[b]Chaos Healing:[/b] Unlike standards methods of restoration this power allows the user to regenerate health over a brief extent of time. Keep a constant stream of damage on him if you do not wish on seeing all your hard work go to waste.\r<br />\r<br />[b]Void Damage:[/b] This ability causes significant amounts of damage to your health for as long as it remains in effect. This off worldly power is best neutralized through means of disruption on its caster or by keeping a safe distance from its user. \r<br />\r<br />[url=https://flic.kr/p/nDMiTS][img]https://farm3.staticflickr.com/2907/14211042716_e085d91db4_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/npmPQR][img]https://farm3.staticflickr.com/2908/14047834717_aca54d2265_o.png[/img][/url]\r<br />\r<br />Horrifying beasts that dwell within the void. They are attracted to magic and spiritual energy; feeding off these flows whenever the opportunities may arise.  Immune to almost all magic they are incredibly hard to put down if not near impossible. With their inherent absorption of magical energy you will need to frequently distance yourself between these terrifying creatures if you hope on claiming victory. \r<br />\r<br />[url=https://flic.kr/p/nFDrFW][img]https://farm6.staticflickr.com/5195/14232141032_479c81ef27_o.png[/img][/url]\r<br />\r<br />These ominous beasts are one of the top predators within the void. Like the ogres they feast on the surges of life and magic, unlike the ogres they bear the ability to cast powerful energy to stagger and slay their foes. Be wary of their dreadful roars, they mark the end for any who happen to hear them. Attacks are list below:\r<br />\r<br />[b]Void Blaze:[/b] The darkness of the void gives birth to this malicious power. The forces of fire and shadow are rolled into one. The damage done from this attack is immense. You should be constantly aware of the injuries you sustain from its bursts unless you are contempt on the thought of dying.  \r<br />\r<br />[b]Flames of the Void:[/b] These cryptic flames of the void inflict damage at an unusually high rate. Be on guard as these enigmatic embers will rip through your health in just a few shots.\r<br />\r<br />[b]Void Damage:[/b] In order to weaken its prey the wyvern sends a harmful form of magic throughout their body; consuming the poor soul in its ravenous energy. Getting up close and personal to the dragon while this power is in effect is never a good idea. Better to send forth your summons or companions to duke it out than it is for you to try and deal with this power on your own. \r<br />\r<br />[url=https://flic.kr/p/nHBkGp][img]https://farm6.staticflickr.com/5504/14254363643_681b1b7eb2_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/npmuPA][img]https://farm3.staticflickr.com/2904/14047770728_48e82b355f_o.png[/img][/url]\r<br />\r<br />Stolen of life, devoid of purpose Menien desperately searches for the answers to his past. Wandering the Deadlands until eternity. His skills in archery are unrivaled, firing deadly arrows that ignite into streams of searing flame. Spells and powers which cause the undead to flee are the way to go when dealing with this ghastly foe.\r<br />\r<br />[url=https://flic.kr/p/npmHQ7][img]https://farm6.staticflickr.com/5491/14047814490_9088f723e7_o.png[/img][/url]\r<br />\r<br />Archlords are powerful dremora that dwell within the planes of oblivion. These barbaric warriors of the blade hold no fear. All life is seen as prey in their eyes as not even dragons are safe from their steel. With unimaginable speed and strength they will run you through their blade with little thought or effort. Approach them with caution. A few swings from their fiery swords can easily bring you to death.\r<br />\r<br />[url=https://flic.kr/p/nDNwmA][img]https://farm6.staticflickr.com/5074/14211279746_dcfc9dbb7a_o.png[/img][/url]\r<br />\r<br />Their swords stained in blood, their hearts filled of shadow. These terrifying beings descend upon the battlefield leaving nothing but death and pain in their wake. Faster, stronger, and all around superior to the standard dremora lord you will need to be on your guard when challenging them to battle as they can quickly make work of any warrior.\r<br />\r<br />[url=https://flic.kr/p/nFR7ir][img]https://farm3.staticflickr.com/2937/14234417155_d0be014546_o.png[/img][/url]\r<br />\r<br />The realms of Dagon are where these vile beasts call home. Known for their carnivorous appetite and ferocious behavior you will need to slay them as fast as possible. Potions that heighten your resistance to fire are a must when dealing with these brutal beings. Their abilities are listed below:\r<br />   \r<br />[b]Fire Bombardment:[/b] A potent blast of flame that explodes on contact; dealing significant damage with each burst. Steer clear from the jaws of the beasts when trying to avoid these damaging flames as this attack can only be delivered through a bite or lunge.   \r<br />\r<br />[b]Blood Clone:[/b] One bite is all it takes to initiate this ability. It holds the terrible power of forming clones from the fashions of blood. Worst is the fact that the clones produced from this practice carry this inherent trait as well. You will need to quickly take out the original to stifle their growing numbers. \r<br />\r<br />[url=https://flic.kr/p/npmv32][img]https://farm6.staticflickr.com/5194/14047771449_c85a4bf489_o.png[/img][/url]\r<br />\r<br />Forged from the ashes of flame this potent being lets loose the destructive might of fire to smolder and sear its foes. Where this creature originated from is completely unknown. \r<br />\r<br />[b]Fire Breath:[/b] A deadly stream of fire that will singe away your health while inflicting continuous fire damage in the process. High health and fire resistances are the way to go when attempting to avoid injury. \r<br />\r<br />[b]Great Fire Ball:[/b] In a rage of fire Gorel unleashes this force of flame to demolish his enemies. Having the ability to track his movements makes all the difference when trying to evade this attack as Gorel will spin around in a circle before releasing this blast. Watch for these set of movements and be prepared to launch a counterattack when the time is right. \r<br />\r<br />[b]Blood Clone:[/b] The spillage of blood is what triggers this power, granting the user the ability to create clones from the elements of blood. Think twice before taking on these copies as their bites carry this ability amongst their fangs. \r<br />\r<br />[url=https://flic.kr/p/npmHuC][img]https://farm3.staticflickr.com/2897/14047813360_ca29af38a0_o.png[/img][/url]\r<br />\r<br />Servant of Vokulvokun she governs his realms of fire through fear and sheer brutality, subjugating her spiderlings to the harshest of torture. Her undying loyalty to the great dragon has granted her the powers of the flame on which she uses to exact his anger and rule. Below is a list of her abilities:\r<br />\r<br />[b]Calling of the Minions:[/b] The great spider queen calls upon her servants to protect her at all cost. Avoid getting too close to these little guys when they are summoned. They will instantly explode shelling out a hefty sum of damage.\r<br />\r<br />[b]Fire Pounce:[/b] A massive explosion that hurls fire in every direction; immediately silencing its sufferers in its burning flames. Prevent the queen from lunging or striking with her front legs as these methods of assault will initiate this power being used.\r<br />\r<br />[b]Fire Shot:[/b] A shot of fire not too brutal in its overall damage, but damaging enough to where you will need to watch your health after taking a few blows.\r<br />\r<br />[b]Great Paralysis:[/b] This ability holds the power to paralyze and stun. Beware for not even your dragon blood can protect you from its harm.\r<br />\r<br />[url=https://flic.kr/p/nFDs6o][img]https://farm6.staticflickr.com/5118/14232142392_f7e3a9094d_o.png[/img][/url]\r<br />\r<br />Unknown of its origin this is a being which is not to be trifled with. Its potent ice and deadly frost can bring even the mightiest of warriors to their knees. Its attacks are as followed:\r<br />\r<br />[b]Frost Shroud:[/b] As a form of defense the dragon will shield itself in a field of frost. This frigid veil will cause damage to any who attempt to get close. Potions that resist frost work well on reducing damage sustained from its wrath.\r<br />\r<br />[b]Shard Shot:[/b] A flurry of ice that strikes with such impact that the victim is virtually rendered helpless with each shot. You will need to be fast on recovery and healing after suffering a blow from this barrage.\r<br />\r<br />[b]Frigid Force:[/b] A force of ice so strong it will knock you to your feet if you happen to get caught in its blast. Prevent the usage of this ability by employing ranged spells and attacks as confronting the dragon head-on will result in this potent power being used.\r<br />\r<br />[b]Frost Wave:[/b] An advanced form of Frost Bind. It will toss you through the air with the slightest of ease. Keep an eye on your health as this attack can easily wreak havoc on it. Healing spells and a high enough armor rating of 300 or more will help soften its heavy blows.\r<br />\r<br />[b]Frigid Fang:[/b] With its frigid fangs the Alchemic Dragon unleashes a brutal blast of ice. Keeping a good distance between you and the dragon helps reduce damage from this vicious bite.\r<br />\r<br />[url=https://flic.kr/p/nHCyN2][img]https://farm3.staticflickr.com/2940/14254602813_58555b813e_o.png[/img][/url]\r<br />\r<br />Aaldu is a primordial dragon that guards the inner sanctums of the Sphere of Darela. With towering health and attacks which specifically target the souls of his victims, this enigmatic being is terror in its purest form. Aaldu has a total of six attacks: \r<br />\r<br />[b]Harvester:[/b] A destructive burst of energy that not only hurls you to the ground, but drains your health while leaving your spirit open to further damage. If its speed does not frighten you its frequency will as Aaldu favors this attack amongst all else. Avoid using frontal assaults. There is a 50/50 chance this attack will be the next thing coming your way. \r<br />\r<br />[b]Reaper Volley:[/b] True to its name Reaper Volley is an attack that should be avoided at all cost. You will be spending a good majority of the battle merely dodging this attack and with good reason, it brings immediate death if more than one orb makes contact with the player. The best way to evade this barrage is to use the surrounding environment for coverage. Whirlwind Sprint, Become Ethereal, and Slow time based shouts and spells work well when trying to put distance between you and the dragon. Use shout reducing items like the Amulet of Talos or the Dragon Aspect shout (Dragonborn exclusive) to help in reducing the cool downtime on these abilities. \r<br />\r<br />[b]Soul Disruption:[/b] Get close enough to the dragon and you will experience this attack first hand. Soul Disruption goes off like a bomb, instantly causing area of effect damage to whatever happens to get caught in its fire. In addition to inflicting damage it will drain a good portion of your health depending on how close you are to the blast. Your best option and chance of avoidance is to minimize on frontal assaults as this attack is absolutely devastating up close. Attacking the dragon from a far or centering your attacks to his wings are good ways to avoid being caught in the fire.\r<br />\r<br />[b]Soul Disperse:[/b] With the slam of his tail Aaldu can release the collected energy from the souls it devours as a form of attack. There is no avoiding this ability. The range is set too far to evade. Bring an ample supply of health potions if you wish to recover from the blow. \r<br />\r<br />[b]Departing Soul:[/b] Ever hungry for souls Aaldu will attempt to pull the spirit straight from your body. Left uninterrupted this ability will put a damper on your health while slowly dragging you closer to death. Become Ethereal or a powerful enough blast to disrupt the dragon is your best bet in surviving. \r<br />\r<br />[b]Summon Soul:[/b] With the flap of his wings Aaldu can summon the soul of his once former self to aid him in the heat of battle. Don’t be deceived. The soul of this dragon is not as difficult to deal with as your main concern. Enchantments and potions which reduce frost and magic will allow you to make quick work of this apparition so you can return focus to your main foe.\r<br />\r<br />[url=https://flic.kr/p/npmuKY][img]https://farm6.staticflickr.com/5543/14047770518_42f15bd147_o.png[/img][/url]\r<br />\r<br />This menacing dragon descended from a realm of fire. He once wreaked havoc on the realms of man until his defeat at the hands of the Psjiijc Order. Banished to a desolate plane of existence he awaits the day on where he is free to exact his revenge. Take heed. Even the strongest of souls think twice before challenging this beast to a brawl.\r<br />\r<br />[b]Rage Fire:[/b] Those who do not perish in its explosions are sent soaring from its blast. This dreadful power is compressed within a tiny flame and released as a massive outburst of destruction. When summoning allies for aid you need to factor in their size and weight as light-footed beings will easily get blown away. \r<br />\r<br />[b]Rising Nova:[/b] Immensely powerful in both size and strength Rising Nova crushes its victims in a rage of fire. Being on the receiving end of this attack is absolutely devastating. Keep an eye out for his tail as a single slam can trigger these brutal bursts.\r<br />\r<br />[b]Nova Ball:[/b] An attack nothing short of power. This great blast of fire is ruthless in damage and frightening in speed. A snap of the mouth is all it takes for the dragon to unleash this lethal force. Plan carefully when going for a direct assault otherwise you will defiantly meet your eminent end.\r<br />\r<br />[b]Blaze of the Fire Bird:[/b] A shroud of fire that inflicts damage as long as it remains in effect. Vokulvokun will cloak himself in its fiery veils in an effort to diminish your health as fast as possible. Direct confrontation should be avoided until the spell has completely faded from usage otherwise the consequences are dire. \r<br />\r<br />[b]Conjure Hound of Dagon:[/b] This blazing beast is the personal servant of the great dragon. It floods the fields in fury. Snarling and snapping at anything that moves. Its bite is definitely worse than its bark; allowing it to employ an ability known as Blood Clone. Blood clone allows this hound of hell to form clones from the blood of its foes. You should make use of the explosion “Rage Fire” to scatter and disorient their numbers.\r<br />\r<br />[b]Conjure Sania the Spider Queen:[/b] Sania is a massive spider gifted with the elements of flame. She burns through his adversaries with a vengeance and uses their fallen ashes to feed her young. When facing this eight-legged menace a resistance to fire is not only needed but key in keeping your health and composure throughout this battle. \r<br />\r<br />[b] Conjure Menien Goneld:[/b] When all else fails Vokulvkoun will call this skeletal being to battle. This undead warrior storms the battlefield in a blaze of wrath, firing his mighty bow with the fury of fire itself. Watch your surroundings as Menien will try and conceal himself within the area before launching an attack. A keen eye is key when dealing with this troublesome bag of bones.\r<br />\r<br />[url=https://flic.kr/p/npmPNr][img]https://farm3.staticflickr.com/2922/14047834577_f007c87308_o.png[/img][/url]\r<br />\r<br />A dragon born from the hatred and misery of man. His soul of anger, his heart of bile. Why he has arisen from the depths of darkness is but a mystery unto itself. His attacks are listed below:\r<br />\r<br />[b]Lights of Obliteration:[/b] Find cover when this ability is being used. Lights of Obliteration sends damaging beams of light in multiple directions. You cannot survive numerous hits from this spell so be wary when it’s being employed by the beast.\r<br />\r<br />[b]Endless Return:[/b] An eerie ability that is able to ensnare its victims in a circle of energy; draining health over an extent of time. Bring a sufficient number of potions to recover any health lost from its effect.\r<br />\r<br />[b]Void Flare:[/b] This cryptic force pulls energy straight from the void. Channeling it into one horrifying blast. It is possible to pick up this explosion similar to “Rage Fire”, but the chance and ratio of this occurrence is very rare not to mention an almost fatal notion to attempt. A good idea is to prevent the dragon from getting too close to you as a snap or bite is how he delivers this attack.\r<br />\r<br />[url=https://flic.kr/p/nHCynn][img]https://farm6.staticflickr.com/5583/14254601383_03c726b6cd_o.png[/img][/url]\r<br />\r<br />The path to victory is not always an easy one and on this journey there are definitely a number of bumps and trudges along the way. Find answers for every obstacle this mod may throw at you in the complete walkthrough included below. \r<br />\r<br />[color=red][b]IMPORTANT:[/b][/color] All spells introduced in this mod are located in the book section of you inventory. Simply navigate to this section whenever you wish to learn a new spell or power.\r<br />\r<br />[url=https://flic.kr/p/npjo5i][img]https://farm3.staticflickr.com/2920/14047357809_5b9581da79_b.jpg[/img][/url]\r<br />\r<br />To start head to Dragonsreach in the city of Whiterun. You will need to search the study chambers (the room with the small desk and chair) of Farengar Secret-Fire. Located on the floor near the desk there will be a journal called “from Dolan”. After reading through the message it will point you to the ancient ruins of Labyrinthian; Labyrinthian is located southeast of Morthal. See the map below for a guide to the location:\r<br />\r<br />[url=https://flic.kr/p/nHG7ni][img]https://farm6.staticflickr.com/5039/14255294363_78e9519351_b.jpg[/img][/url]\r<br />\r<br />Once you arrive at Labyrinthian search the grounds near the main entrance to find Dolan, the first member of the Ascended and your starting foe on this perilous quest. He attacks with the elements of electricity. Tricky to deal with but not all too difficult provided you keep your distance and learn to watch his movements. After his defeat search his body for the key to your next location, and a powerful item known as a Xamnant. Xamnants are tomes of mystery, holding forbidden words of magic and power. They are never found within the realms of man. Their arrival signals troubled times for the people of Skyrim.\r<br />\r<br />After learning a new spell take a look at the note that you’ve happened to pick up. It will direct you to a location known as the Abandoned Prison.  The Abandoned Prison is a deserted structure carved into the side of a mountain it rests along the White River and is easily noticeable as you near the Fort Amol. See the map below for a guide to the location:\r<br />\r<br />[url=https://flic.kr/p/nFSzJf][img]https://farm6.staticflickr.com/5560/14234704534_4b606aa22d_b.jpg[/img][/url]\r<br />\r<br />With haste make your way to the Prison. There you will find a strange creature alongside the body of a man. You can either choose to take your new furry friend along for the ride or you can leave him with he stands. The chose is up to you and should be weighed on how you wish to build your team. The most important option in this matter is that you search the body of the man to find a “Strange Book”\r<br />\r<br />Flip through its pages to find a number of locations that are marked with the images of dragons. This is where decision making comes into play. Will you put a stop to the mysterious mage cult or will you investigate the locations of the dragons? (See Dragon Seeker section if you choose to go down this road) \r<br /> \r<br />[url=https://flic.kr/p/nFMuYU][img]https://farm6.staticflickr.com/5478/14233713004_02f59560a3_b.jpg[/img][/url]\r<br />\r<br />If you choose to continue the main story then you will need to head to the location marked on the first page of the journal. The highlighted area is located near Kynesgrove. See the map below for a guide to the location:\r<br />\r<br />[url=https://flic.kr/p/nHFm4i][img]https://farm3.staticflickr.com/2935/14255145303_3f1a7d337f_b.jpg[/img][/url]\r<br />\r<br />Once you arrive you will find two dead Psijic mages and a mysterious sphere hovering above. Search the bodies for clues to their deaths as well as a few Xamnants to add to your growing library. Once you are fully prepared. Enter the realm of Darela and prepare for a fight, and when I say prepare for a fight, prepare for an all-out war&#33; The next enemy, Samel is extremely tough and if you do not have a single dragon to your name this battle will be downright nightmarish to say the least. Although possible to beat without powerful summons it is highly recommended you have at least one dragon before jumping into this brutal battle. \r<br />\r<br />Once you manage to defeat this manic mage. Search his body to find a journal. It is here you will find that his end is only the beginning. You will once again find yourself at a crossroad? Will you venture further into the realms of Darela or will you explore the newly revealed location (see “Dark One” if you choose to investigate the words of Samel).\r<br />\r<br />If you choose to venture further in the realm of Darela a terrible beast will be waiting for you on the other side. The dragon Aaldu is looking on adding your soul to his ever-growing collection. Keep away from this creature at all cost as none can live through the ferocious force of his attack, Reaper Volley. After you slay this decaying dragon the “Sphere of Imprisonment” is now safe to enter, but enter with caution. As the sole reason you came to this realm can be found here, the vile dragon, Vokulvokun. \r<br />\r<br />This dragon is like nothing you have faced before. Make use on using his own “Rage Fire” explosions against him as it will make this brute a lot easier to deal with. Once you have bested the beast search his skeletal remains and then backpedal to the main entrance of this Darela to head home. This part of your journey is over, though the real story has just begun.\r<br />\r<br />[url=https://flic.kr/p/npmv94][img]https://farm6.staticflickr.com/5474/14047771799_bfb64bafc0_o.png[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/npkhdX][img]https://farm6.staticflickr.com/5539/14047533239_a0edeb41db_b.jpg[/img][/url]\r<br />\r<br />Samel&#39;s cryptic words will point you to Ragnvald. These nordic ruins can be found north of Markarth. See the map below for a guide to the location:\r<br />\r<br />[url=https://flic.kr/p/nHFmyM][img]https://farm3.staticflickr.com/2923/14255147013_041be15dd1_b.jpg[/img][/url]\r<br />\r<br />Here you will find Parna. Don’t let her size fool you. Her striking flames can easily bring your journey to a swift close. If you stay alert and watch her movements you should be able to put an end to her fiery rage. Once she has bitten the dust search her body for the next set of clues. The words of Samel are here to lead you once again. This time pointing you to the Sightless Pit. See the map below for a guide to the location:\r<br />\r<br />[url=https://flic.kr/p/nHFmxK][img]https://farm3.staticflickr.com/2916/14255146953_21e6c001a6_b.jpg[/img][/url]\r<br />\r<br />When you arrive at this location do not go into the actual pit. Investigate the area and you will find two figures standing near the entrance. These are the infamous duo Gaern and Renal. They are not always keen on attacking so you may need to provoke them to a fight. If you’re not up for battle then you pilfer their items provided your sneaking and pickpocketing skills are high enough. \r<br />\r<br />[url=https://flic.kr/p/npkfoU][img]https://farm3.staticflickr.com/2928/14047527088_8f644f4a0a_b.jpg[/img][/url]\r<br />\r<br />Whichever choice you opt for, once you have dealt with the troublesome two look through the contents of their journals to find that you now need to head to an area located near the outside perimeters of Whiterun. See the map below for a guide to the location:\r<br />\r<br />[url=https://flic.kr/p/nDRj79][img]https://farm3.staticflickr.com/2906/14211823876_256c3942c2_b.jpg[/img][/url]\r<br />\r<br />It shouldn’t be too difficult to find. Just circle around the gates of Whiterun and you should find what you are looking for. A white haired mage whirling and slinging water at whatever moves… nothing special. Be careful when confronting this mage. As the over usage of magic has drawn terrifying beings from the shadows. These creatures better referred to as beasts of the void are attracted to the properties of magic and unfortunately for you its feeding time&#33; \r<br />\r<br />[url=https://flic.kr/p/npkhg2][img]https://farm3.staticflickr.com/2900/14047533359_77ef2fd44a_b.jpg[/img][/url]\r<br />\r<br />Finish off Sarshel and check his body for a Xamnant and hints to a new location. See the map below for a guide to the location:\r<br />\r<br />[url=https://flic.kr/p/nppm1C][img]https://farm3.staticflickr.com/2896/14048326428_cd620caa57_b.jpg[/img][/url]\r<br />\r<br />I hope blood doesn’t make you squeamish because you’re going to be seeing a lot of it in this battle. Not only is the mage Lana a tough competitor to tackle, but she is joined by your good old friends from the void. Back one again to wreak havoc on you health. Lucky you. \r<br />\r<br />Once brought to her death comb through her corpse for a few new Xamnants and another location. You are slowly nearing the end of your journey only a few more stops to go. Head to the area marked in the note to come face to face with Rohnin, a mage with a mastery in the arts of earth and its elements. See the map below for a guide to the location:\r<br />\r<br />[url=https://flic.kr/p/nFSCBE][img]https://farm6.staticflickr.com/5580/14234714244_e129d99437_b.jpg[/img][/url]\r<br />\r<br />Beware his blasts as they will ravage through your health with a single shot. Speed is the key to prevailing in this fight. If you are too slow then you will die in a matter of seconds. Don’t slow down until he is dead, then you can examine his body for another journal as well as a new Xanmant.\r<br />\r<br />Savor you moment of victory before moving on to the next site, an area that rests south of Dawnstar. See the map below for a guide to the location:\r<br />\r<br />[url=https://flic.kr/p/nFTW8a][img]https://farm3.staticflickr.com/2898/14234968255_be3fced2be_b.jpg[/img][/url]\r<br />\r<br />Once you arrive you will find a sphere similar to the one you found in Kynesgrove as well as a figure guarding the entrance. The mage Apostle has come for one reason and one reason only. To prevent you from entering the sphere at all costs. In this battle he will call upon the off worldly energies of the void for assistance. You will definitely need to watch out for his signature move Chaos Space, an utterly devastating spell that few can survive or endure. \r<br />\r<br />[url=https://flic.kr/p/npjmLW][img]https://farm3.staticflickr.com/2905/14047353438_a749a15950_b.jpg[/img][/url]\r<br />\r<br />When he is down for the count continue where you left off and enter the Sphere of Darela. Here you will face an all too familiar foe with a few noticeable changes. This gruesome adversary will set up you up for a long chain of difficult battles as he is only the start on this road of agony. Once you have conquered this shadowy figure, partake in the standard routine of searching their body and continue down this path of torment. Enter the “Sphere of Time”, the dragon, Revaktiid will be eagerly awaiting your arrival. This dragon of time and space is something to definitely watch out for. Use the surrounding area for coverage as a single hit from his beam can severely slow you down. \r<br />\r<br />With Revaktiid out of the way there is only one option left. Proceed into the last sphere and prepare to face what lies within. Here you will face the toughest boss this mod has to offer (the guide does not offer information on this foe). If you choose to challenge this final boss then know that victory will not come easy, but for those who dare to brave the challenge the reward is great. With his defeat in hand rummage through his remains to find the final journal that will write the closing chapter on this quest.\r<br />\r<br />[url=https://flic.kr/p/npmQ2H][img]https://farm3.staticflickr.com/2918/14047835347_94c40ee1dd_o.png[/img][/url]\r<br />\r<br />Powerful dragons have been let loose throughout Skyrim, causing disaster and ruin across the land. Hunt and battle these scaly beasts as you develop tactics and strategies to better aid you in battle.  Eleven to challenge, eleven to conquer. Do you have what it takes to triumph over these fearsome foes? \r<br />\r<br />[url=https://flic.kr/p/npjmGY][img]https://farm3.staticflickr.com/2934/14047353208_c36ae7f4bf_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/npmPTr][img]https://farm3.staticflickr.com/2940/14047834867_a9d4e6297a_o.png[/img][/url]\r<br />\r<br />[color=red][b]IMPORTANT:[/b][/color] It is highly recommended that you read this section, which highlights the changes that are introduced from installing this mod. Please note that only enemies introduced within this mod are affected by these new attributes. These features include:\r<br />\r<br />[url=https://flic.kr/p/npmQ3V][img]https://farm3.staticflickr.com/2920/14047835417_850ef5a3d0_o.png[/img][/url]\r<br />\r<br />You will need to strategically think about the hour of the day when confronting certain dragons included in &#34;Dragon Seeker&#34;. Some dragons have ideal hours of the day on which they should be fought. Ignoring these elements will leave you with a less than favorable aftermath of each battle. Dragons in &#34;Dragon Seeker&#34; are divided into three categories:\r<br />\r<br />[b]Day Dragons:[/b] Dragons that use invisibility or attacks that hard to see in the dark are best fought during the day. Visibility is extremely poor at night. If you choose to battle these beasts during this time their attacks will easily catch you off guard. \r<br />\r<br />[b]Night Dragons:[/b] These dragons use blinding magic and abilities that are overly bright. They are best confronted at night. If challenged during the day their abilities will make it nearly impossible for you to see clearly.\r<br />\r<br />[b]Dusk Dragons:[/b] Battling these dragons at either day or night makes little to no difference. You can confront them at whatever time you feel.  \r<br />\r<br />[url=https://flic.kr/p/nFR7se][img]https://farm6.staticflickr.com/5153/14234417665_e4c1220bea_o.png[/img][/url]\r<br />\r<br />All dragons in this mod hold a distinct ability known as a [b]&#34;Trigger&#34;[/b]. Usually when fighting these dragons getting them to bite, swat their wings, or slam their tail will result in their trigger being activated.  Most trigger attacks are beams of energy or damaging forms of magic.  \r<br />\r<br />These abilities can be combined with their main forms of attack to create new potent powers. This is referred to as a [b]&#34;Combo&#34;[/b]. There are few dragons that can make use of the combo technique, but the ones that can are extremely lethal to deal with. Combining the force of two into one. \r<br />\r<br />[url=https://flic.kr/p/npmuRk][img]https://farm3.staticflickr.com/2937/14047770829_a594085431_o.png[/img][/url]\r<br />\r<br />“Dragon Seeker” can be started from the main quest after you have made you way to the Abandoned Prison. Search the grounds for the body of a dead man who will be holding a “Strange Book” in his inventory. Open the book to discover various pages with locations scrolled amongst them. These are your starting points (minus the first page with Vokulvokun, and the second page with the Alchemic Dragon). \r<br />\r<br />[url=https://flic.kr/p/npVJwQ][img]https://farm6.staticflickr.com/5478/14054255548_fe5114155f_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/npmv5X][img]https://farm3.staticflickr.com/2907/14047771619_1281d6c0ff_o.png[/img][/url]\r<br />\r<br />Taking on dragons in this mod in no easy task. Fortunately the “Dragon Guide” is here to point you in the right direction. Unlike the strategy guide included within Inferno: Envoys of End the &#34;Dragon Guide&#34; does not outline the attacks or abilities of the dragons. It’s up to you to discover their abilities and powers for yourself. \r<br />\r<br />[url=https://flic.kr/p/nFMJ8E][img]https://farm3.staticflickr.com/2934/14233757244_4eec749969_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nFyeAn][img]https://farm6.staticflickr.com/5521/14231124781_dd7b68ee30_o.png[/img][/url]\r<br />\r<br />The terrible dragon of ash and fire. He longs to set the lands ablaze in his fury. Sosdoyol is a night dragon. His location is listed below: \r<br />\r<br />[url=https://flic.kr/p/nppw9A][img]https://farm3.staticflickr.com/2930/14048360530_3364ee7c46_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nFyeNX][img]https://farm6.staticflickr.com/5577/14231125511_f051dfb3c4_o.png[/img][/url]\r<br />\r<br />The cunning dragon of magic and sorcery. His knowledge is as vast as his power. Drogdolah is a day dragon. His location is listed below:\r<br />\r<br />[url=https://flic.kr/p/nppo6k][img]https://farm3.staticflickr.com/2899/14048333429_9b9f1976ac_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nHCywF][img]https://farm3.staticflickr.com/2897/14254601923_75c4e6e128_o.png[/img][/url]\r<br />\r<br />The mysterious dragon of dark and silence. Her cries carry a horrid fate for many. Nahlotnah is a night dragon. Her location is listed below:\r<br />\r<br />[url=https://flic.kr/p/nppkhy][img]https://farm3.staticflickr.com/2930/14048323988_096b137286_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/npmPMz][img]https://farm3.staticflickr.com/2909/14047834527_4b4cc907f6_o.png[/img][/url]\r<br />\r<br />The sinister dragon of shadow and thunder. All are decimated under the wrath of his roar. Zuvulom is a dusk dragon. His location is listed below:\r<br />\r<br />[url=https://flic.kr/p/nFSE6S][img]https://farm3.staticflickr.com/2940/14234719244_ac47fcc82e_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nFDrKd][img]https://farm6.staticflickr.com/5546/14232141222_010cdeb9b5_o.png[/img][/url]\r<br />\r<br />The malice dragon of lunacy and fear. His shrilling cries can drive even the strongest of souls to madness. Sivaas is a day dragon. His location is listed below: \r<br />\r<br />[url=https://flic.kr/p/nppD8n][img]https://farm6.staticflickr.com/5538/14048384007_eec1f2c6bf_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nFyeLH][img]https://farm3.staticflickr.com/2902/14231125381_78bb443b2b_o.png[/img][/url]\r<br />\r<br />The powerful dragon of earth and stone. The lands shiver in his wake. Golin is a dusk dragon. His location is listed below:\r<br />\r<br />[url=https://flic.kr/p/nFSCZy][img]https://farm6.staticflickr.com/5071/14234715514_4b95b303ba_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nFDs37][img]https://farm3.staticflickr.com/2930/14232142202_ec89929477_o.png[/img][/url]\r<br />\r<br />The tranquil dragon of forest and nature. Her wings spread the gift of life. Britdrem is a dusk dragon. Her location is listed below:\r<br />\r<br />[url=https://flic.kr/p/npphG3][img]https://farm6.staticflickr.com/5116/14048315258_43c324cb95_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nHCykP][img]https://farm6.staticflickr.com/5538/14254601293_99bc7cf936_o.png[/img][/url]\r<br />\r<br />The dreaded dragon of bile and decay. The veils of death never leave his side. Wahdir is a dusk dragon. His location is listed below:\r<br />\r<br />[url=https://flic.kr/p/nFBMz6][img]https://farm6.staticflickr.com/5554/14231817691_c930f2675f_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nFPRNf][img]https://farm6.staticflickr.com/5240/14234173254_3207c6f9be_o.png[/img][/url]\r<br />\r<br />The vile dragon of chaos and war. All fall to the darkness of his soul. Lotkroniid is a day dragon. His location is listed below:\r<br />\r<br />[url=https://flic.kr/p/nFSEmm][img]https://farm3.staticflickr.com/2939/14234720084_313656a008_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nFDrQo][img]https://farm3.staticflickr.com/2928/14232141522_ec4b7c1035_o.png[/img][/url]\r<br />\r<br />The divine dragon of light and radiance. His presence heralds the end for all. Kaaldojun is a dusk dragon. His location is listed below:\r<br />\r<br />[url=https://flic.kr/p/nHFj3p][img]https://farm6.staticflickr.com/5472/14255138523_996a980cdf_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nHCyMv][img]https://farm3.staticflickr.com/2904/14254602783_0c238d544a_o.png[/img][/url]\r<br />\r<br />All life withers in his wings, all kingdoms drown in his fire. He is the great conqueror, the endless flame. Alovokun is a dusk dragon. His location is listed below:\r<br />\r<br />[url=https://flic.kr/p/nFGgrG][img]https://farm3.staticflickr.com/2934/14232691902_70f4cef386_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nDNwF3][img]https://farm3.staticflickr.com/2898/14211280816_9c2e6d894a_o.png[/img][/url]\r<br />\r<br />These files can be found within the file section of this mod. If you encounter any problems with installation please leave a message in the comment section and I will try to get back to you as quickly as possible.\r<br />\r<br />[url=https://flic.kr/p/npqyqz][img]https://farm3.staticflickr.com/2933/14048563297_f235d83063_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/npmPSp][img]https://farm3.staticflickr.com/2900/14047834807_4eb76bb0a1_o.png[/img][/url]\r<br />\r<br />Created by [url=http://www.nexusmods.com/skyrim/users/3461046/?tb=images&pUp=1] Stewcalkins722[/url]. These files add proper normal maps for the original dragons included within Inferno: Envoys of end. Optional files can be found for Ziisizaan, Auszeimrahgol, and Alovokun. These files can be found in the optional file section of this mod for download. \r<br />\r<br />[url=https://flic.kr/p/nDNwsC][img]https://farm6.staticflickr.com/5485/14211280096_57d293e5a4_o.png[/img][/url]\r<br />\r<br />Infenro: Reborn is available for download in the file section (not included in main mod). You can find details regarding this quest by heading to the Arch-Mage&#39;s Quarters in the College of Winterhold (Winterhold) and searching the area near the alchemy workbench. There you will find a journal lying on the floor which will provide further instructions. Listed below is the location of this quest:\r<br />\r<br />[url=https://flic.kr/p/nppfBG][img]https://farm6.staticflickr.com/5158/14048308278_8be3bf349a_b.jpg[/img][/url]\r<br />[url=https://flic.kr/p/nHCyKg][img]https://farm3.staticflickr.com/2922/14254602653_48b5389d62_o.png[/img][/url]\r<br />\r<br />An alternate texture is available for Alovokun (this is a replacer texture). Install through the nexus mod manager or drag into your actor folder (dragon section). This mod requires Inferno: Envoys of End to function properly. \r<br />\r<br />[url=https://flic.kr/p/nFDs3N][img]https://farm6.staticflickr.com/5560/14232142242_c13ab6d806_o.png[/img][/url]\r<br />\r<br />Auszeimrahgol is available for download in the file section (not included in main mod). You can find details regarding this dragon by heading to the Blue Palace (Solitude) and searching the main throne room. There you will find a journal lying on the floor which will provide further instructions. Auszeimrahgol is a night dragon. His location is listed below:\r<br />\r<br />[url=https://flic.kr/p/nFB6bF][img]https://farm3.staticflickr.com/2940/14231681831_22c5d99fc3_b.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/npmuZA][img]https://farm6.staticflickr.com/5581/14047771308_d87dc9a930_o.png[/img][/url]\r<br />\r<br />Ziisizaan is available for download in the file section (not included in main mod). After you have downloaded this file, head to Dragonsreach and enter the main room of Farengar Secret-Fire. Turn left as you enter and you will find a journal sitting near a bookshelf which will point you in the right direction. Ziisizaan is a night dragon. His location is listed below:\r<br />\r<br />[url=https://flic.kr/p/nHFjP4][img]https://farm3.staticflickr.com/2937/14255141113_a1b9624494_b.jpg[/img][/url]",
  "categoryId": "35",
  "version": "Inferno",
  "author": "gorelus89",
  "createdUnix": "1382290210",
  "updatedUnix": "1391578566",
  "containsAdultContent": false,
  "uploadedBy": "gorelus89",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000068343",
      "name": "Inferno- Envoys of End",
      "version": "V.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36287",
      "fileName": "Inferno- Envoys of End-44922-V-1.7z",
      "uploadedUnix": "1382289593",
      "modVersion": "V.1",
      "virusScanUrl": "https://www.virustotal.com/file/6661680045447976f9b37a18e9b93a498f54c631da64e66d0ed5d5a07b911888/analysis/1407762502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inferno-%20Envoys%20of%20End-44922-V-1.7z?fid=1000068343&ttl=1535825488&ri=8192&rs=8192&setec=63d96b9b0ab250e8a39c1498854a3c33"
    },
    {
      "fileId": "1000069816",
      "name": "Face Gen Data- Grey Face Fix",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "301",
      "fileName": "Face Gen Data- Grey Face Fix-44922-1.7z",
      "uploadedUnix": "1382562816",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ffc3f71d73e432e6f53f58f32564603d18340563937358c9413ec157b3827c28/analysis/1407766334/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Face%20Gen%20Data-%20Grey%20Face%20Fix-44922-1.7z?fid=1000069816&ttl=1535825488&ri=8192&rs=8192&setec=8dc93c4edbfe4d5d007dc15293087b9f"
    },
    {
      "fileId": "1000073610",
      "name": "Inferno- Ziisizaan",
      "version": "Inferno",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1302",
      "fileName": "Inferno- Ziisizaan-44922-Inferno.7z",
      "uploadedUnix": "1383321119",
      "modVersion": "Inferno",
      "virusScanUrl": "https://www.virustotal.com/file/b8cb05887ecf8a72ca546e6bdcf18233cfa4b29cde874c847a9cee9c80fe4fa9/analysis/1407777359/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inferno-%20Ziisizaan-44922-Inferno.7z?fid=1000073610&ttl=1535825489&ri=8192&rs=8192&setec=96f298e67ea0c124489e5ff015bbbc82"
    },
    {
      "fileId": "1000088895",
      "name": "Inferno- Auszeimrahgol",
      "version": "Inferno",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1149",
      "fileName": "Inferno- Auszeimrahgol-44922-Inferno.7z",
      "uploadedUnix": "1388367541",
      "modVersion": "Inferno",
      "virusScanUrl": "https://www.virustotal.com/file/40f2ff985a3a626345e0c3aab0dd05b06ee2bbd734100c5d63c775977e650609/analysis/1407864183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inferno-%20Auszeimrahgol-44922-Inferno.7z?fid=1000088895&ttl=1535825490&ri=8192&rs=8192&setec=23c2674cc3b8e3b219a6f994e948494a"
    },
    {
      "fileId": "1000092294",
      "name": "Inferno- Supreme Alovokun",
      "version": "Inferno",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "532",
      "fileName": "Inferno- Supreme Alovokun-44922-Inferno.7z",
      "uploadedUnix": "1390185328",
      "modVersion": "Inferno",
      "virusScanUrl": "https://www.virustotal.com/file/73bf0cb02e1b4684fe89bc35386d8519df133979f3b9ccf7f1f99a9c0c653fff/analysis/1407893458/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inferno-%20Supreme%20Alovokun-44922-Inferno.7z?fid=1000092294&ttl=1535825491&ri=8192&rs=8192&setec=6356233bf8f48aac741bb6e31cc30eed"
    },
    {
      "fileId": "1000094958",
      "name": "Inferno- Reborn",
      "version": "Inferno",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1559",
      "fileName": "Inferno- Reborn-44922-Inferno.7z",
      "uploadedUnix": "1391389577",
      "modVersion": "Inferno",
      "virusScanUrl": "https://www.virustotal.com/file/27e94052effbd2a954068ab7738cbae6a77c413a9ecd3d71e457651eabfb6ae7/analysis/1407915552/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inferno-%20Reborn-44922-Inferno.7z?fid=1000094958&ttl=1535825491&ri=8192&rs=8192&setec=d47b5c4bc30cd682085db2e982f3c6ff"
    },
    {
      "fileId": "1000095325",
      "name": "Defined Maps- Original",
      "version": "Inferno",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "102482",
      "fileName": "Defined Normal Maps -Original-44922-Inferno.7z",
      "uploadedUnix": "1391564699",
      "modVersion": "Inferno",
      "virusScanUrl": "https://www.virustotal.com/file/c40206876f7e9dfbd8aedfab13168a54285adb2d5767c8fcf2203d9bccf66d2e/analysis/1407918803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Defined%20Normal%20Maps%20-Original-44922-Inferno.7z?fid=1000095325&ttl=1535825492&ri=8192&rs=8192&setec=30961f6b12404290b6aa331465c21588"
    },
    {
      "fileId": "1000095336",
      "name": "Defined Map- Alovokun",
      "version": "Inferno",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6260",
      "fileName": "Defined Normal Maps - Alovokun-44922-Inferno.7z",
      "uploadedUnix": "1391577684",
      "modVersion": "Inferno",
      "virusScanUrl": "https://www.virustotal.com/file/bd50e7ac8c8e481a25bfdc8f7c3b3bb928a9a1b60a7a1701b68a15f1531126c3/analysis/1407918905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Defined%20Normal%20Maps%20-%20Alovokun-44922-Inferno.7z?fid=1000095336&ttl=1535825492&ri=8192&rs=8192&setec=c6c718bcc898069ef652db636e677c37"
    },
    {
      "fileId": "1000095337",
      "name": "Defined Map- Ziisizaan",
      "version": "Inferno",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6492",
      "fileName": "Defined Normal Maps- Ziisizaan-44922-Inferno.7z",
      "uploadedUnix": "1391578181",
      "modVersion": "Inferno",
      "virusScanUrl": "https://www.virustotal.com/file/a616b5e52dd5907931480f04e631d31059e7eb7670b45ffab7815a8c8523dff2/analysis/1407918908/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Defined%20Normal%20Maps-%20Ziisizaan-44922-Inferno.7z?fid=1000095337&ttl=1535825493&ri=8192&rs=8192&setec=c6ea23259c45ba84cd60cf19ed4bbb2c"
    },
    {
      "fileId": "1000095338",
      "name": "Defined Map- Auszeimrahgol",
      "version": "Inferno",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6540",
      "fileName": "Defined Normal Map- Auszeimrahgol-44922-Inferno.7z",
      "uploadedUnix": "1391578566",
      "modVersion": "Inferno",
      "virusScanUrl": "https://www.virustotal.com/file/b38ad2dc71e553ba57b63e74b4b0a714603d1b73a4005bacac03b04e36f507d4/analysis/1407918918/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Defined%20Normal%20Map-%20Auszeimrahgol-44922-Inferno.7z?fid=1000095338&ttl=1535825493&ri=8192&rs=8192&setec=52ae54917f1407504473894809d1629f"
    }
  ]
}