{
  "modId": 44957.0,
  "modName": "Proudspire Mansion - House Of Love",
  "summary": "This home is intended for use with the Hearthfires Multiple Adoptions Mod.  While this mod is not actually required, it does allow for the adoption of six children to live in a luxurious home.",
  "descriptionHtml": "This mod requires the latest version of skyrim, with the update.esm, and the latest version of skse, being as it has external scripts.  It also requires hearthfires.  Nothing else should be required that i am aware of.\r\n\r\nThanks to arkayn71 for the screenshots.\r\n\r\nOriginally i intended to use search and replace to replace each on every item in the home to avoid undeleted and/or disabled garbage.  After a month of doing this, i still had 300 items left over, and i was exhausted to the point that i could not think straight enough to even play the game, let alone edit my file.  I took a break for a few days, and decided it was time to mop up.  I may do more to the home later, but for now, it is finally time to enjoy the home that has obsessed me for a month.\r\n\r\nFor those of you that are downloading for the first time, this is an eight bedroom mansion, with room for six children (using the hearthfires adoption mod, not required though)  six companions, one housecarl, one spouse, and a pet.  Pets don't seem to happen in Solitude, so I suggest looking up one of the many pet mods, and trying them out.  One even has domestic house cats in it.\r\n\r\nThere is a mannequin room with male and female mannequins from every playable vanilla race.  The house is fully functional for crafting except that it has an anvil, not a forge.  Renaissance paintings are on the walls, and asian rugs are on the floors.  There is a greenhouse focused on poisonous plants that even on of my most brutal critics called elegant.  All the floor tiles now match.  There is ample storage downstairs next to the Argonian mannequins.  I suggest you focus on putting your items in this area.  Some of the other storage chests are used to remove companion clothing in the companion sleeping quarters, and in the pool area.  Oh yeah, there is an underground swimming pool.  The dining area has a table that seats twelve.  The lighting is now done.  There is even a copy of Romeo and Juliet in the house, yes, the entire play.  This house is for those who like to party, and that means having lots of people around.  15 people can sleep in the house simultaneously, but i am sure you could cram in some more.  Even with all this huge area, it is well divided, and not terribly demanding on a computer.  My computer is still running windows xp, so it should run fine unless your computer can barely handle Skyrim to begin with.\r\n\r\nThere is a stunning set of clothing from Elven Dresses and SCJewelry in one of the strongboxes in the master bedroom.  There is also a box in the same room called Pandora's Box.  Some of the items in this box are tantamount to cheating, so if you want to avoid cheating, stay out of that box, or just remove it in the creation kit if you know how.\r\n\r\nYou can add your own music to the home by downloading the filepath and instructions i left on the download page.\r\n\r\nIn the bedroom is a picture of the mona lisa on one wall, and a picture of my wife from when we were dating on another.  Don't bother asking me to remove the image of my wife, neither will i be offering a patch to do so.  I can't stop you from figuring it out for yourself, and i wouldn't want to, but this was a request from my wife, and i am all for it.  She is after all a very attractive woman, so it certainly doesn't hurt the look of the mansion.  If you don't agree, your tastes are very different from mine.  In any event, this is my dedication to the woman i have been loyal to for 22 years.  I won't claim that i don't look at other women, but i certainly don't touch.\r\n\r\nIf you into simple small homes, this isn't for you.  If you are into vanilla homes that look like slobs live in them, this is not for you.  If you are brutal about the lore friendly thing, this isn't for you as there are Renaissance paintings on the walls.  If the Tardis mentality of being bigger on the inside bothers you, again, this is not for you.\r\n\r\nHowever, if you love keeping lots of companions in one house, if you want to keep lots of children, if you want a fully featured home in Solitude, i think this is for you.  It may not be the most beautiful version of Proudspire, i think that honor goes to Noxide, but it is insanely huge, and elegant in it's own right.  It is not just huge for the sake of being huge either.  The area is well used for the most part.\r\n\r\nThis mansion file has been cleaned with TESV edit.\r\n\r\nKnown conflicts.  \r\n\r\nIf you want to adopt six children for the home, Amazing Follower Tweaks is going to be incompatible.  Use Ultimate Follower Overhaul instead, and be sure to clean all three files if you use all of them, as they all contain dirty edits, or did last time i checked.  If you don't care about adopting six children, and are not going to install Hearthfires Multiple Adoptions, AFT should work just fine, and is a great mod.\r\n\r\nRecommended Mods.\r\n\r\nHearthfires Multiple Adoptions\r\n\r\nThis mod allows you to adopt six children instead of the default two.  not required to use the mansion, but it is required to adopt six children.  Not compatible with Amazing Follower Tweaks, and is also not compatible with Multiple Marriages mods.  If you are more into polygamy than large families, avoid this, but if you like large families like i do, you should definitely give this one a try.\r\n\r\nCOHO - Children Of Honorhall Orphanage\r\n\r\nAnother of my own mods.  This mod allows you to adopt six boys or six girls very quickly after the game starts by replacing some of the boys with girls, or in the other one, replaces girls with boys.  This is the mod which led me to create the mansion in the first place, as i was very uncomfortable with my kids living in Lakeview where monsters were constantly attacking my home.\r\n\r\nMy Home Is Your Home.  This mod will allow you to set the new default location for any companion, which is very useful in a mod designed to hold lots of companions.  Fair warning, last version i checked contained dirty edits, and needs to be cleaned in TESV edit.  works fine for me after cleaning.\r\n\r\nUltimate Follower Overhaul\r\n\r\nThe latest version i checked had dirty edits, so be sure to clean this in TESV edit.  This is compatible with Hearthfires Multiple Adoptions, so if you want six children, this is the one to use.  If you really don't care about having six children, and are not going to install HMA, then you could use Amazing Follower Tweaks instead.  This mod provides all sorts of options which make companions living in your mansion more enjoyable.  I highly recommend this mod for use with the mansion.\r\n\r\nSexy Solitude.  \r\n\r\nThere is a bit of a performance hit here, but wow, this really makes the mansion much brighter and cheerier, as well as the entire city of Solitude.  This isn't for everyone, those who like the darker weathered look of Solitude should skip this one.  also, if you can barely run skyrim to begin with, forget about this one.  really is an amazing re-texture job though.\r\n\r\nDetailed Rugs by raiserfx\r\n\r\nAnother re-texture job which affects the mansion.  The mansion uses hallway rugs from Whiterun, and this mod improves those rugs.  I suggest the \"clean\" version if you are also going to install sexy solitude.  they go very well together.\r\n\r\nSexy Whiterun\r\n\r\nAs mentioned earlier, the mansion uses rugs from Dragonsreach, and Sexy Whiterun replaces those textures with some that are even better than the detailed rugs mod in my opinion.  This will of course affect Whiterun as well, but if you know what you are doing you can if you want isolate the rug textures. After seen Sexy Solitude, i installed all the Sexy City mods, and i think they are great.\r\n\r\nBijin Warmaidens by rxkx22\r\n\r\nUse this mod to make your housecarls a lot more attractive.  This directly affects the mansion by improving the appearance of Jordis, who is the housecarl for that home.  This is in my opinion the best Housecarl overhaul package.\r\n\r\nMultiXwm\r\n\r\nThere are other programs which convert files to xwm format, but this is the only user friendly one i have found.\r\n\r\nProudspire Music\r\n\r\nThis is just a sample filepath with instructions for adding your own music.  Use MultiXwm according to the instructions included in this mod.  Requires the mansion mod to work.\r\n\r\nSky Radio\r\n\r\nThis is a mod which provides a Dwemer radio which you can load about 100 tunes in if i remember correctly.  The house does come with its own music tracks, which you can put your own music tracks into, and this mod does exactly the same thing, but with a lot more options.  This mod will override the house music, so if you don't like what one mod is playing, you can just go to the other one.  In either event, you pick the songs.  For both mods you need to convert the music to xwm format.  There are video  instructions for converting songs on the skyradio page, which might be easier to understand than my written ones.\r\n\r\nCredits\r\n\r\nFirst, i have to say thank you to TMPhoenix, who was an absolute saint helping me to understand how to make this work with his mod.  His patience with someone who really did not know what he was doing was unbelievable.  I could not have done this without his help.\r\n\r\nInsanity is the author who made the custom pillows I used to make bean bags, and couches.  The mod used is found at TES Alliance, where you must be a member in order to download, and use it in your mod.  For this reason, you MAY NOT use the pillows out of my mod.  If you want to use them in your mod, join TES Alliance and download them as a free modder's resource.\r\n\r\nBerticus 0001 wrote the script that removes the companions clothing when the go into the pool area, and when they go to bed.  However, gentester was kind enough to tell me how to use the script, and has offered other tips which i have used to make the home what it is as well.  Thanks to her for the valuable advice, and time she spent explaining things to me.  Her home, Aspen Manor, is an amazing home, and you should try it.  She did an excellent job.\r\n\r\nUrwy is the author who created the mod my agonizers are based on, which are scattered around the home on weapon racks.  the mod is called dwemer control rod.\r\n\r\nI originally had permission to clean and upload Fusiontron's Vanilla home replacements for additional children's beds, which was where i got started.  While his home was not used as a base for this home, i had a really close look at it when I started on my mod.  It was my original intention to simply clean and upload the mod, but I decided that I needed to start from scratch.  Looking at his mod helped me learn, both from his successes, and his mistakes.\r\n\r\nSCJewelry by Severus616 was used to create the jewelry the home now uses.\r\nhttp://skyrim.nexusmods.com/mods/35880/?\r\n\r\nElven Dresses by Naihaan by Naihaan Kragnaidael was used to add the dresses to the home.\r\n\r\nHalf Dryad-Elf Race english - polish ENG - PL - CBBE UNP UNPB ADEC by CyberghostPL was incorporated into the home to provide a race for the companions.\r\n\r\nSexy Mannequins by ch0k3h0ld was the source of my mannequin room.  \r\nhttp://skyrim.nexusmods.com/mods/18689/?\r\n\r\nHis original mannequin mod works better than my mannequins in that his poses.  Also, installing his mod, or any mannequin mod will not affect my mannequins, and his is the best i have found, so i encourage you to try it.  Vyktor is particularly impressive, as he uses the Better Males body, but Vyktoria works quite well too if you prefer female.  I learned a lot from his mod, and intend to continue on by adding the posing function to my own mannequins.\r\n\r\nStephanieRawx has been kind enough to allow me to make Aranya one of the occupants of the home.  Currently, she is the only occupant.",
  "categoryId": "67",
  "version": "1.02",
  "author": "kar2nz",
  "createdUnix": "1382238168",
  "updatedUnix": "1385664482",
  "containsAdultContent": false,
  "uploadedBy": "kar2nz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000068027",
      "name": "Prouspire Mansion House Of Love",
      "version": ".5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "34",
      "fileName": "Prouspire Mansion House Of Love-44957--5.7z",
      "uploadedUnix": "1382235769",
      "modVersion": ".5",
      "virusScanUrl": "https://www.virustotal.com/file/2107d5beb07a76d5dafdc69b8ff0fe5aa6031c651bb0c31d04d15ffb409168e7/analysis/1407761772/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Prouspire%20Mansion%20House%20Of%20Love-44957--5.7z?fid=1000068027&ttl=1535825524&ri=8192&rs=8192&setec=fab9f1d51af0211aef225d01f9d8c7b1"
    },
    {
      "fileId": "1000071863",
      "name": "Prouspire Mansion - House Of Love",
      "version": ".7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10480",
      "fileName": "Prouspire Mansion - House Of Love-44957--7.7z",
      "uploadedUnix": "1382979352",
      "modVersion": ".7",
      "virusScanUrl": "https://www.virustotal.com/file/a3a4fe8f7ac9035c8ad63850634a1df42fd41e001a5ea2f56ee9ad908f939778/analysis/1407772965/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Prouspire%20Mansion%20-%20House%20Of%20Love-44957--7.7z?fid=1000071863&ttl=1535825524&ri=8192&rs=8192&setec=c91b9b85cf62c117f62bd431bba02b8c"
    },
    {
      "fileId": "1000072911",
      "name": "Prouspire Mansion - House Of Love",
      "version": ".7b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16522",
      "fileName": "Prouspire Mansion - House Of Love-44957--7b.7z",
      "uploadedUnix": "1383169923",
      "modVersion": ".7b",
      "virusScanUrl": "https://www.virustotal.com/file/7b7f8d8164fc3321e4e3b459addebc5ef89a7226cc99454d2aa7d97491bbae1a/analysis/1407775532/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Prouspire%20Mansion%20-%20House%20Of%20Love-44957--7b.7z?fid=1000072911&ttl=1535825524&ri=8192&rs=8192&setec=f8ebaac32491d6b2bfb6f58411b61519"
    },
    {
      "fileId": "1000075344",
      "name": "Prouspire Mansion - House Of Love",
      "version": ".7c",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "108160",
      "fileName": "Prouspire Mansion - House Of Love-44957--7c.7z",
      "uploadedUnix": "1383645009",
      "modVersion": ".7c",
      "virusScanUrl": "https://www.virustotal.com/file/bf05e864a4dd663ee6ef1dc6242aab73b1aee640c168bf1220db6f2e953d8f9e/analysis/1407781659/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Prouspire%20Mansion%20-%20House%20Of%20Love-44957--7c.7z?fid=1000075344&ttl=1535825525&ri=8192&rs=8192&setec=33b4f963d2b60ca2cdfa6bc79a79ede8"
    },
    {
      "fileId": "1000080950",
      "name": "Prouspire Mansion - House Of Love",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "136714",
      "fileName": "Prouspire Mansion - House Of Love-44957-1-0.7z",
      "uploadedUnix": "1384917122",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d7426fab91698039bd3a651a4d9a68f46a4057b981beaf7246a7524f616b1ba4/analysis/1407800206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Prouspire%20Mansion%20-%20House%20Of%20Love-44957-1-0.7z?fid=1000080950&ttl=1535825525&ri=8192&rs=8192&setec=375534160a5c56c06262f4c764b24a31"
    },
    {
      "fileId": "1000080953",
      "name": "Music Filepath",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Music Filepath-44957-1-0.7z",
      "uploadedUnix": "1384917186",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/56de2fe04f786f73672fb4917e38641b1d94f00e7fee557dff068e777080b9e6/analysis/1407800207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Music%20Filepath-44957-1-0.7z?fid=1000080953&ttl=1535825526&ri=8192&rs=8192&setec=b01fe4be430358a80abd4af5dc501246"
    },
    {
      "fileId": "1000083673",
      "name": "Prouspire Mansion - House Of Love",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "137794",
      "fileName": "Prouspire Mansion - House Of Love-44957-1-01.7z",
      "uploadedUnix": "1385573795",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/0ca3997abf900c9304fdc455fbc8820e4cae74a6726d03de797f3e0b23e8ad55/analysis/1407810941/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Prouspire%20Mansion%20-%20House%20Of%20Love-44957-1-01.7z?fid=1000083673&ttl=1535825526&ri=8192&rs=8192&setec=611c07fba70882ef365bd4aa63b5fe80"
    },
    {
      "fileId": "1000084025",
      "name": "Proudspire Mansion patch",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "121",
      "fileName": "Proudspire Mansion patch-44957-1-02.7z",
      "uploadedUnix": "1385664482",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/b8a7918e3e778081c64baa50b7185fde5e7956beeb0d92c26a909aa071a3ce67/analysis/1407812403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proudspire%20Mansion%20patch-44957-1-02.7z?fid=1000084025&ttl=1535825527&ri=8192&rs=8192&setec=0c4f84d8ef6eb6a64034e82496c0ac34"
    }
  ]
}