{
  "modId": 4496.0,
  "modName": "Dalls_Skyrim_Hair",
  "summary": "Skyrim_Hair is cosmetics - beauty mod which changes how Skyrim - Hairs and male Beards look.",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - Skyrim_Hair\r\n\r\nv1.0\r\n\r\n24/12/2011\r\n\r\nSkyrim_Hair is cosmetics - beauty mod which changes how Skyrim - Hairs and male Beards look.*\r\n\r\n* Word of warning - my \\\"cosmetic\\\" mods - regardless of being adult or not - are made to provide for natural / life-like good looks - so they might not be right for you - if you are seeking some wild / day-dream fantasy!\r\n\r\nSkyrim has incredibly large stockpile of very good hair n beard models but for some to me unknown reason - these brilliant models were pitifully let down by quite low-grade textures. As I was extremely unhappy with my in-game hair, I have made my variation on theme / my version of Skyrim Hair/s.     \r\n\r\nSo, what is different in my version? Firstly, it doesn\\'t shine like cheap plastic any more and now it looks less like painting and more like real hair. Secondly different colors are there now for real including black n all other dark ones. This as original extreme hair shine was blocking them - so don\\'t get too surprised if your present brown or dark-brown hair becomes very-dark brown or black - as that is its true colour. All Darkers n other Vampire-lore lovers should be finally happy. ;)\r\n\r\n To install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like this new look, simply delete / remove my hair n beard texture files from Data/textures/actors/character/ and original look will be restored to your game.\r\n\r\nBugs/conflicts: none known - but if you like them - take care not to overwrite them by accident!\r\n  \r\nUse:\r\nFree to use but if used for modding ask me for permission!\r\n\r\nEnjoy and try to remember - if you like it even in a part - to give endorsement! \r\n\r\nThanks to Bethesda for great game.\r\n\r\n\r\n\r\n",
  "categoryId": "26",
  "version": "1.0",
  "author": "Dall",
  "createdUnix": "1324743819",
  "updatedUnix": "1324744580",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "13541",
      "name": "Dalls_Skyrim_Hair",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26777",
      "fileName": "Dalls_Skyrim_Hair-4496-1.7z",
      "uploadedUnix": "1324744580",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/033bdc6dd2415b3a0a8f67084436f058fb8b757edaf23c1ee4ccf7515049056f/analysis/1406554766/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Skyrim_Hair-4496-1.7z?fid=13541&ttl=1535760317&ri=8192&rs=8192&setec=9ce1a2fe0192994d062248cc5ecceb4d"
    }
  ]
}