{
  "modId": 45054.0,
  "modName": "Lens Textures for ENB",
  "summary": "A collection of lens/dirt textures to be used with any ENB preset (binary .223 and above). A sample enblens.fx is included.",
  "descriptionHtml": "[CENTER]============================================================\r\n============================================================\r\n\r\n ::  LENS/DIRT TEXTURES FOR ENB - COLLECTION BY AMOEBAE  ::\r\n\r\n============================================================\r\n============================================================\r\n\r\n\r\n\r\n:: DESCRIPTION ::[/CENTER]\r\n\r\nThis is a collection of 34 lens/dirt textures to be used with ENBSeries (.223 or above) in conjunction with an enblens.fx file (example file included - needs binary .229 or above for many of the dynamic effects to kick in). Each was hand-picked and tested in-game - and edited where necessary - to (hopefully) create pleasing results. There should be something here to suit everybody.\r\n\r\nLens/dirt textures add an overlay across the image on your screen, and can be used to simulate dust, scratches, or more commonly as included here \\'fake\\' bokeh - like little translucent \\'bubbles\\' of light. Not all of them will look right in all situations or at the same strength - it is suggested that you spend some time finding a few that you like the most, and using them when the conditions are right. They can make a screenshot come alive!\r\n\r\nTextures come in either 1:1 or 16:9 format. Depending on which you choose, you will need to edit the lens.fx file to match the aspect ratio (described in \\'Installation\\' below). If your enblens.fx file doesn\\'t support changing the aspect ratio of the textures, you are advised to use lenses from the 1:1 folder, otherwise it will be distorted in-game (although that can look good too; why not try it and see?).\r\n\r\nLarge file sizes shouldn\\'t have an impact on your performance, but you can easily reduce their size in any image modification program (for example, GIMP or Paint.NET). If you do so, please ensure you save in the .png format. Images smaller than your screen resolution may cause textures to become blurred or degraded depending on their content.\r\n\r\n\r\n[CENTER][img]http://farm4.staticflickr.com/3819/10384492336_74c86eebc4_c.jpg[/img][/CENTER]\r\n\r\n\r\n[CENTER]:: INSTALLATION/USE ::[/CENTER]\r\n\r\n- You must have an ENB installed, using binary .223 or above. (ENB preset not included.)\r\n\r\n- Choose your preferred texture from one of the folders, change its name to enblensmask.png and paste it into your main Skyrim folder (back up any current textures first that you want to save).\r\n\r\n- If you don\\'t already have a suitable enblens.fx file, paste the one provided into your main Skyrim folder (don\\'t rename it).\r\n\r\n- If your enblens.fx file supports it (the one included here does), open the file in Notepad (or similar) and change the aspect ratio to match the one of the texture you chose (1:1 = square; 16:9 - widescreen). For example, in the enblens.fx included find this line:\r\n\r\n#define USE_EQUAL_RATIO_TEX        0\r\n\r\nand use 0 for 16:9 and 1 for 1:1.\r\n\r\n- You can try out different textures without closing and restarting the game: simply alt+tab out of the game while paused and follow the installation instructions above. When you tab back into the game the new texture will take immediate effect.\r\n\r\n\r\n[CENTER][img]http://farm4.staticflickr.com/3760/10373720783_661a022f52_c.jpg[/img][/CENTER]\r\n\r\n\r\n[CENTER]:: ADVANCED USE ::[/CENTER]\r\n\r\nThe included enblens.fx offers lots of control over various things, such as the colouring of your lens/dirt effects, their contrast/brightness, whether they act dynamically (dimming or pulsing over time) or are static, etc. It\\'s in this file that you should set up the foundation for how you want the effects to look, and then use the values under [LENS] in enbseries.ini to adjust the basic strength of the effects when in-game. \r\n\r\nMost features are toggled to \\'ON\\' in the included enblens.fx. If for example you don\\'t like your textures flickering or changing colour dynamically, you can alter these inside the file.\r\n\r\nThe included enblens.fx may seem daunting at first, but spend some time looking over the various parameters, and it will hopefully become self-explanatory. The enblens.fx also deals with reflections (also controlled under [LENS] in enbseries.ini), and can be fine-tuned to your taste. \r\n\r\nOver the next few days I\\'ll work on creating a slightly better guide for changing the parameters in enblens.fx. In the meantime, please search the comments as many questions have already been asked and answered.\r\n\r\n\r\n[CENTER][img]http://farm8.staticflickr.com/7316/10369615215_fa9412affe_c.jpg[/img][/CENTER]\r\n\r\n\r\n[CENTER]:: PERMISSIONS ::[/CENTER]\r\n\r\nYou may distribute these lens textures with your own ENB presets. Credit to me would be nice, but is not required. Credit to the respective creators of these textures (as listed in the included ReadMe file) is absolutely required. Including the ReadMe in your own files would be a good idea.\r\n\r\n\r\n[CENTER]:: CREDITS ::[/CENTER]\r\n\r\nThe enblens.fx included here is kindly supplied and created by [url=http://skyrim.nexusmods.com/users/3463021]Kyokushinoyama[/url]. You can find more of his excellent shaders [url=http://skyrim.nexusmods.com/mods/44987//?]here[/url].\r\n\r\nThe textures were found, collected, edited and tested by amoebae. They were initially created by  many wonderful artists whose names are too numerous to list on the description page, but their names and links to their websites are listed in the permissions/credits tab and in the included ReadMe. Terms of use have been checked for each image (please check out their work - many have lots of stock images available, but please respect their terms of use).",
  "categoryId": "62",
  "version": "1.0",
  "author": "amoebae",
  "createdUnix": "1382314248",
  "updatedUnix": "1382312857",
  "containsAdultContent": false,
  "uploadedBy": "amoebae",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000068669",
      "name": "Lens Textures for ENB",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "261624",
      "fileName": "Lens Textures for ENB-45054-1-0.7z",
      "uploadedUnix": "1382312857",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lens%20Textures%20for%20ENB-45054-1-0.7z?fid=1000068669&ttl=1535825608&ri=8192&rs=8192&setec=5b40e376c9c47dee0bf5a2f52f386b98"
    }
  ]
}