{
  "modId": 45113.0,
  "modName": "Lootification custom XML plus XML editing TUTORIAL",
  "summary": "This file is not to be used directly, as it lootifies a merged mod i created from various other mods.\r<br />Use the included guidelines to make your own custom XML with great results&#33;",
  "descriptionHtml": "[center][size=3]Tutorial users, and Nexus users in general coming for questions about Lootification, I have two questions for you: \r<br />[b]Do you want an 1.1 update before the major update before the major Lootification update? \r<br />Would you prefer a complete 2.0 update for the next version of Lootification?[/b]\r<br />The 1.1 should include the major lootification patches and some new info reviewed on the tutorial itself, but would be obsolete by the second Lootification is updated. \r<br />Voice your opinion on the comments, please&#33;[/size]\r<br />- - - - -\r<br />[size=1]Due to the nature of Complete Crafting Overhaul, release of Lore Weapon Expansion and the update of both Immersive Armors and Lootification itself, this (and my merged patches) are slowly being reworked - But nearly done and almost ready for lootification magic&#33;\r<br />These two txt files were found on pastebin, and lootify [url=https://www.dropbox.com/s/cboog76tdqdnv7y/more_stuff_lootified%20-%20cco%20included.txt]Complete Crafting Overhaul Remade[/url] and [url=https://www.dropbox.com/s/w4qvq1cazx7qjv1/ia7_lootification_v1.1.txt]Immersive Armors V7[/url], and both, including the original Custom.xml file this was based on shall be used as resources - Some things will be copy/pasted from there, but the shall be much editing and hacking and slashing at the damned code. Feel free to use them while you guys wait for my next file.\r<br />Thanks for your patience.[/size]\r<br />[/center]\r<br />\r<br />Welcome to this small tutorial for usage of [url=http://skyrim.nexusmods.com/mods/32339]Lootification.[/url]\r<br />\r<br />This mod uses as a base the [url=http://skyrim.nexusmods.com/mods/40860]Lootification Custom XML version 1.21[/url] file provided by erchan, available here on the nexus, and personally edited by yours truly. [color=red]That file has been updated with something i don&#39;t use, so, get it and make your own XML with the tutorial and my own file.[/color]\r<br />\r<br />The purpose of this mod is to make the learning curve of how to deal with Lootification much less steep - it took me three whole days to crack the thing up, and I&#39;m bad with codes. So you can guess how frustrating it was. :(\r<br />\r<br />==========================================================================================\r<br />\r<br />So, let&#39;s start with lootification itself. You open it up, it loads your mods and shows a list on the left side, with each esm and esp it recognized. Does anything seems strange? Don&#39;t want something to be touched by it? Then DON&#39;T close it&#33; Hit the cancel button to properly close it. If you try to use the red X button, it&#39;ll make a patch. We don&#39;t want that yet, right??\r<br />\r<br />\r<br />Next, load up the blocklist.txt file. If you installed Lootification correctly, it should be inside your skyrim data folder, SkyProc patchers, LLI, Files folder. In there, you&#39;ll do as it suggests and add anything you don&#39;t want to be read by the patcher. In mine, i added &#34;Closefaced Helms with Circlets&#34;* because while it doesn&#39;t add new helms, it does tweak all headgear in the game. It is intended to work as a patch, understand? Meanwhile, Perkalicious is a perk mod, but had to stay because it has some armors [and because skyrim witchery. LLI.jar would flip out if it was included in the blocklist]. These are just examples, you&#39;ll have to think and test what&#39;s better for you depending on your load order.\r<br />\r<br />\r<br />So, now you&#39;ve blocked all those pesky, unnecessary mods. Yay&#33; Well then, time to start lootifying&#33; When you click on the button besides a mod name, you&#39;ll see a list of all armor and weapon available to be lootified. \r<br />=REMEMBER&#33;= \r<br />It is best if the mod you&#39;re using doesn&#39;t have a leveled list, OR that you clean it by fully deleting the LLIST block in the CK/TES5Edit. [please correct me if this is wrong or if there is a better solution&#33;]\r<br />\r<br />\r<br />Well, how do we go about lootifying stuff? First off, check if the mod is already lootified. When you click on the button, if it shows a message in green, the work is done already. :) If you see the armors or weapons, time to get to work. First thing is to rate something. How to rate depends on how you want things to appear in-game.\r<br />If you have a nice steel-looking sword THAT HAS DAEDRIC STATS, well, you&#39;d better list it as daedric. Or maybe you got that really dark leather light armor... That&#39;s as good as Glass. So you list it as glass. Then, you have that scarf or cape or jewel that fits perfectly with dwemer stuff, but it is just jewelry/accessory... Well, list it as dwemer&#33; Or maybe there&#39;s that crazy lightsaber or super girly pink scarf you don&#39;t want to see normally in the world loot... Well, just mark them with the &#34;none&#34; option and hit the &#34;SET&#34; button near the MATERIAL BOX. The box will be colored red, which means it&#39;s prepared to go into the XML file when you click the PATCH button. [Of course, if you set it to none, it won&#39;t be red...]\r<br />Be sure to check the wikis for info on what are the base values of armors and weapons for each model, and hit the SET button beside the MATERIAL BOX. Don&#39;t touch the ones below yet&#33;\r<br />http://elderscrolls.wikia.com/wiki/Weapons_(Skyrim)\r<br />http://elderscrolls.wikia.com/wiki/Armor_(Skyrim)\r<br />\r<br />\r<br />At this point, if you already gave stats for each item in a mod, you can hit the &#34;PATCH&#34; [or the red X] button to make your first patch. But oooh, what exactly did that exactly do? And what&#39;s that TEXT BOX below each item for? Well, it&#39;s your game, you&#39;ll figure out what you did yourself xD The TEXT BOX will be addressed in a bit - you may want to skip ahead to read about it and make things easier too. But let&#39;s take a look at the XML file right now... Remember, it&#39;s always the custom.xml file&#33;\r<br />\r<br />[code]\r<br />    &lt;item EDID=&#34;ArmorVanguardBoots&#34; type=&#34;armor&#34;&gt;\r<br />      &lt;keyword&gt;ARMOR_FUR&lt;/keyword&gt;\r<br />    &lt;/item&gt;\r<br />[/code]\r<br />\r<br />[this part is a lot less frustrating if you have a proper program to edit code, like notepad++. it is free, portable and does the job pretty well&#33;]\r<br />In here, we see the Vanguard boots from Immersive Armors listed as a FUR armor. This means it&#39;ll appear at very early levels&#33; It&#39;s a bad thing, as you may find unkillable opponents that way&#33; How do we fix that? By selecting a proper gear tier in the program, of course&#33; Or you can type it directly in the XML file while Lootification is turned off. This is a better version:\r<br />\r<br />[code]\r<br />    &lt;item EDID=&#34;ArmorVanguardBoots&#34; type=&#34;armor&#34;&gt;\r<br />      &lt;keyword&gt;ARMOR_ORCISH&lt;/keyword&gt;\r<br />    &lt;/item&gt;\r<br />[/code]\r<br />\r<br />Thanks to this simple edit, the vanguard armor likely won&#39;t appear until levels 25 and onward, because that&#39;s when orcish gear starts to appear. Now you may be asking yourself if that is enough configuration, or if you can make all the new loot more immersive. Or maybe even what that TEXT BOX was for. Well, that&#39;s the next thing we&#39;re going to discuss&#33;\r<br />\r<br />\r<br />The TEXT BOX is to name things. Just that? Well, it does a bit more, but for now, just that :)\r<br />When you type in there, you should give the item a proper name. Like... &#34;IAVanguard&#34;. This helps keep track of things, and also does a nifty thing. It creates outfits&#33; Don&#39;t forget to click the SET button on the right of the TEXT BOX, which will make it red. Red means good in this program, but also means attention&#33; If you make a mistake, you can always change the value/text and click it again. So, anything that&#39;s named &#34;IA_Vanguard&#34; will be part of an outfit. The vanguard armor is a good example, because it has two helmet options, open and closed. Let&#39;s see how it looks in the XML file:\r<br />\r<br />[code]    &lt;item EDID=&#34;ArmorVanguardHelmet&#34; type=&#34;armor&#34;&gt;\r<br />      &lt;keyword&gt;ARMOR_ORCISH&lt;/keyword&gt;\r<br />      &lt;keyword&gt;dienes_outfit_IA_Vanguard&lt;/keyword&gt;\r<br />    &lt;/item&gt;\r<br />    &lt;item EDID=&#34;ArmorVanguardHelmetCLOSED&#34; type=&#34;armor&#34;&gt;\r<br />      &lt;keyword&gt;ARMOR_ORCISH&lt;/keyword&gt;\r<br />      &lt;keyword&gt;dienes_outfit_IA_Vanguard&lt;/keyword&gt;\r<br />    &lt;/item&gt;\r<br />[/code]\r<br />\r<br />As you can see, a new line of keywords has been added by the program. It has three keywords in there. &#34;Dienes&#34;, &#34;outfit&#34; and &#34;IA_Vanguard&#34;. Note that they are sepparated by and underscore ( _ ), and so is the very name we typed&#33; This doesn&#39;t cause any problem to the code, but can be visually confusing. Either way, when all five items have the same name [boots, cuirass, gauntlet and two helmets] they are added to the game as possible outfits. This would probably yeld three outfits: With open helmet, with closed helmet, and without helmet. [I&#39;m ASSUMING this part, just so you guys know] So, the more part options are available, the more variations would appear. The base is of course of one cuirass, glove and boots.**\r<br />\r<br />\r<br />Wait, outfits? Did you say OUTFITS? And why are OUTFITS being written in all caps now? Because it&#39;s the second part of what naming things in the TEXT BOX does.\r<br />When you click the OUTFITS button at the end of the list of loaded mods, in the left, you&#39;ll be presented to the OUTFITS names you created, with a few types of npcs. Bandit Heavy, Bandit Boss, Bandit Light, Thalmor, Necromancer and Warlock. These are the more common enemies you can find in the game. Yes, this list is kinda small, but there might be a way to avoid focus on just them. I already hinted at that in the introduction, but i&#39;m not sure if you were paying attention to this huge wordwall of dov... Er... code and tutorial. XD\r<br />\r<br />\r<br />On to using these little boxes then&#33; You&#39;ll be given a number and a &#34;none&#34; option in these. The none means, of course, nothing will be directed to the specific group. So, what if we give the bandit boss box a number 7 and the Bandit Light a number 8?...\r<br />\r<br />[code]    &lt;item EDID=&#34;ArmorVanguardHelmet&#34; type=&#34;armor&#34;&gt;\r<br />      &lt;keyword&gt;ARMOR_ORCISH&lt;/keyword&gt;\r<br />      &lt;keyword&gt;dienes_outfit_IA_Vanguard&lt;/keyword&gt;\r<br />      &lt;keyword&gt;BanditBoss_Tier_7&lt;/keyword&gt;\r<br />      &lt;keyword&gt;BanditLight_Tier_8&lt;/keyword&gt;\r<br />    &lt;/item&gt;\r<br />[/code]\r<br />\r<br />This is what happens to the XML file. A third line and fourth of keywords is added to EACH item of the OUTFIT. With this, the vanguard outfit is not only set to appear as random loot after a certain level, but it&#39;ll also appear on bandit bosses after level... seven? No&#33; It&#39;ll appear after level 21&#33;&#33; Also on Heavy-type bandits after level 24&#33; Why? The number inserted either in the program or in the XML file is multiplied by three once inside the game - Keep that in mind when choosing your numbers&#33; Note that each enemy type gets its own Keyword line.\r<br />Also, you can name items from different mods with the same outfit name, for instance, HD Armored Circlets by Johnskyrim. It has daedric-themed circlets, so i gave the unarmored daedric circlet the same tags i used in Daedric fashion: &#34;DaedricMage&#34;. The same happened to the dwarven and dragonbone ones, adding respective tags with &#34;Mage&#34; to them, thanks to the dwarven mage and dragonhide robes added by immersive armors.\r<br />\r<br />Another nice thing you can do with outfits [and only by manually editing the xml file] is give a certain gear to a certain group only. As in, the outfit can only be found with the set outfit with the set npcs. NEVER in the loot list. To do that, you&#39;d have to either set the outfit normally in the patcher, giving it a material tier [like mage armor, for example] and then editing the xml file to something like this:\r<br />\r<br />[code]    &lt;item EDID=&#34;TribunalRobesBlackNONARMORCuirass&#34; type=&#34;armor&#34;&gt;\r<br />      &lt;keyword&gt;dienes_outfit_merged special gearThalmorMageTrb&lt;/keyword&gt;\r<br />      &lt;keyword&gt;Thalmor_Tier_0&lt;/keyword&gt;\r<br />   &lt;/item&gt;\r<br />[/code]\r<br />As you can see, this code has been edited to have no material keyword. This means it is NOT on the leveled lists. If you do that on the patcher, you&#39;ll get no code at all on the xml - that&#39;s why your options are giving it a material and editing it out, or manually typing into the xml file, running the patcher again after the edit. So, what does this code means? It says &#34;the black, unarmored tribunal robe will be assigned to any thalmor above level 0&#34; [0*3=0 :D] This also works as a quick fix for naked npcs. As long as you assign them any outfit at level 0 and they are supposed to wear leveled gear, they&#39;ll have something on them.\r<br />\r<br />\r<br />Now, one final thing. When you try to run the patcher after editing the xml file, if it comes up with an error, be sure to try and read it. I&#39;ll give you a number, which is where the error ends. It tends to be on the last line of a mod, which means it can be anywhere inside that mod group.\r<br />\r<br />[code]between \r<br />&lt;mod modName=&#34;thisisanexample.esp&gt; \r<br />and \r<br />&lt;/mod&gt;[/code]\r<br />\r<br />So it can be the last thing you wrote [probably a typo or the lack of a symbol... or worse, lacking or extra group tags [the ones with a slash in them]. Be sure to read the last lines carefully, and run the LLI.jar patcher each time you save an edit to the xml file. Remember to backup&#33;\r<br />\r<br />Also remember that using a non-leveled item mod is better for this, so if there is another esp that distributes the items, ignore it and just use the esm or main esp if available. And remember to rebuild the bashed patch&#33; Wait, you don&#39;t know what the bashed patch is? Sorry, this is a tutorial for Lootification, and it used THAT MUCH SPACE ALREADY D:\r<br />\r<br />\r<br />**It came to my attention that you can put a second outfit keyword line by typing something new in the text box and clicking &#34;SET&#34;, or simply typing a new line below the first outfit keyword line. Seems like more outfits can be mix-matched if you add another outfit line to a single item, like a cuirass.\r<br />\r<br />\r<br />=========================================================================================\r<br />\r<br />[quote name=&#34;Dienes&#34;]Thanks for the tutorial&#33; I&#39;m pretty bad at explaining how to use it because I forget the stuff that&#39;s obvious to me is impenetrable if you didn&#39;t write the damn program yourself.\r<br />\r<br />About outfits: Having multiple of the same armor piece, like two helmets, should make them options within the same outfit. So if you add two helmets and two cuirasses to the same outfit you could get the first helmet + first cuirass, first helmet + second cuirass, second helmet + first cuirass, or second helmet + second cuirass, randomly selected for each npc that uses that outfit. \r<br />\r<br />Also for an outfit group you set in lootification to be added to the game it needs to have all the armor pieces the normal outfit would have, but can have more. Another example: most outfits have helmet, cuirass, gauntlets, and boots but some don&#39;t have the helmet and some are only cuirass and boots (in vanilla, a modder could make gauntlets and helmet and the patcher should work with that too). If you setup matching outfit keywords on boots and a cuirass the patcher will use those in the outfits that are only boots + cuirass. If you have boots, cuirass, and gauntlets the patcher will use it for the boots + cuirass outfits and the boots + cuirass + gauntlets outfits.\r<br />\r<br />Finally whenever you add a keyword in the xml file be careful not to make it outrageously long. At some point it will get too long and the end will be cut off. If you are using variants where the end changes like reallylongkeyword1 and reallylongkeyword2 they could get trimmed down to the same thing which would end up acting strangely. Its got to be pretty long but its possible. I&#39;ll see about trying to figure out just how long they can be and adding a warning if you go over.\r<br />\r<br />Also sorry for being abducted by aliens and unreachable for a while. As an apology I&#39;m working on a new version that doesn&#39;t choke and die if you look at it funny (and doesn&#39;t have nudist mages).[/quote]\r<br />\r<br />This confirms a few things about keywords and other stuff&#33; Thanks for the heads up, Dienes&#33;\r<br />\r<br />=========================================================================================\r<br />\r<br />Yay&#33; Congratulations&#33; You read the whole thing and is at the bottom of it&#33; Good modding initiate&#33; :) [or you cheated and scrolled to the end without reading&#33; boo&#33;]\r<br />\r<br />As a prize, here are the mods that are addressed in my xml file, as well as what&#39;s left out of them. Remember, you shouldn&#39;t directly use it, you&#39;ll have to edit your own XML by using mine as reference&#33;\r<br />\r<br />3rd era weapons Master of Shadow edition\r<br />Armonizer [personal tweaks in the CK too]\r<br />Bosmer Armor Pack\r<br />Daedric Fashion\r<br />Diamond Weapons\r<br />Expanded Jewelry Crafting\r<br />Fur Collar\r<br />Grimoa&#39;s Scarf and Gugel [left the pink scarves out]\r<br />HD Armored Circlets by Johnskyrim [Some are set as jewelry, some as armor, and some in outfits. nothing left out]\r<br />Heavy Armory [dragonborn esm version with dawnguard addon. Left the dawnguard weapons out]\r<br />Immersive Armors\r<br />Immersive Weapons\r<br />Insanity&#39;s third era dwemer weapons\r<br />Jaysus Swords [JSwords.esm - left the dragon ones out. Vanilla is ugly, but those... UGH... The rest of the mod compensates for that&#33;]\r<br />KDcirclets\r<br />Morrowind Glass Armor\r<br />Mystic Gloves [also added crafting recipes to them in the CK]\r<br />Pauldrons [with a few personal edits... the things weren&#39;t even enchantable, so be wary when using that mod]\r<br />Ultimate Assortment [left the wings out]\r<br />EotW Dovahkiins Journeyman Armor\r<br />Fur-lined Skaal clothing set [what? Mages need to look stylish and warm too&#33;]\r<br />Tribunal Robes [special - only the black robes are added as outfits for the thalmor from the start of the game. The unarmored ones. Armored ones are high tier gear]\r<br />All other mods addressed on the original file by Erchan\r<br />\r<br />\r<br />=========================================================================================\r<br />\r<br />Future plans:\r<br />[s]Make thalmor wear black [url=skyrim.nexusmods.com/mods/20077]TRIBUNAL ROBES[/url][/s] and maybe the golden masks too&#33; - Partially done, not sure if the masks are showing.\r<br />Make a more presentable tutorial - but always keeping a text-only version. Some people suffer from internethitis, and can&#39;t bear with video tutorials most of the time. I&#39;m one of them. D:\r<br />Add more basic armors for mages, necromancers and bandits. Any suggestions are welcome&#33;\r<br />Edit most keywords added by the patcher and add new ones for mixing varieties.\r<br />Add the EOTW Dovakiins Journeyman armors to the list - great base armors&#33;\r<br />\r<br />*Closefaced helms made by navida1 and circlets with helms legendary edition by Grimfandang0, successfully merged by me :) ",
  "categoryId": "82",
  "version": "1.04",
  "author": "emieri00",
  "createdUnix": "1382376473",
  "updatedUnix": "1383735937",
  "containsAdultContent": false,
  "uploadedBy": "emieri00",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000069420",
      "name": "Custom xml and tutorial",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "19",
      "fileName": "Custom xml and tutorial-45113-1-01.7z",
      "uploadedUnix": "1382485861",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/613a8e269ebdde5adc60446aeffbca033207ec37bb5fd71e12d9d2ae95d35cea/analysis/1407765363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Custom%20xml%20and%20tutorial-45113-1-01.7z?fid=1000069420&ttl=1535825654&ri=8192&rs=8192&setec=96c826283e79444edd1497de79ecb9ac"
    },
    {
      "fileId": "1000070948",
      "name": "Custom xml and tutorial",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20",
      "fileName": "Custom xml and tutorial-45113-1-02.7z",
      "uploadedUnix": "1382807227",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/8adc29d63c342251a5d714f9fb6e3f93a70dfa0c41d11e60af02b6f256394054/analysis/1407769718/",
      "changelogHtml": " Added a new information on how to handle the outfits <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Custom%20xml%20and%20tutorial-45113-1-02.7z?fid=1000070948&ttl=1535825655&ri=8192&rs=8192&setec=55897272fb14675993d916a9028684c8"
    },
    {
      "fileId": "1000073264",
      "name": "Custom xml and tutorial",
      "version": "1.021",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20",
      "fileName": "Custom xml and tutorial-45113-1-021.7z",
      "uploadedUnix": "1383235044",
      "modVersion": "1.021",
      "virusScanUrl": "https://www.virustotal.com/file/9f886b961add8159e96f63a40860021e40951ea43f4055353d3e2a7e7ac20688/analysis/1407776225/",
      "changelogHtml": " Changed the Daedric mage armor to DAEDRIC instead of necro robes - this made them appear as early as level 1 in loot&#33; Fixed now, hopefully. <br/> \n Another small change i can&#39;t remember right now. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Custom%20xml%20and%20tutorial-45113-1-021.7z?fid=1000073264&ttl=1535825656&ri=8192&rs=8192&setec=efcbb07c2aa833950505237f94c46c30"
    },
    {
      "fileId": "1000073789",
      "name": "Custom xml and tutorial",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20",
      "fileName": "Custom xml and tutorial-45113-1-03.7z",
      "uploadedUnix": "1383335327",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/abe6a96f4259edce6ea77ac8f012cc7f66829ab838f7c7c2de5f7bb4638826b9/analysis/1407777427/",
      "changelogHtml": " Lootified some stray armors that were still set as hide or fur, even tho they weren&#39;t. I doubt there&#39;s any left now. <br/> \n More armors were set on a tier 0 for bandits. Less naked npcs, yay&#33; Now i just need something for the noobish necromancers. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Custom%20xml%20and%20tutorial-45113-1-03.7z?fid=1000073789&ttl=1535825656&ri=8192&rs=8192&setec=5ea5527a8d9f6cd074a5df68a30c94c5"
    },
    {
      "fileId": "1000075790",
      "name": "Custom xml and tutorial",
      "version": "1.04",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "Custom xml and tutorial-45113-1-04.7z",
      "uploadedUnix": "1383735937",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/f391358eea8c928f167c6eefd3a373d6a2d190a3c74d9d39559bfd6fe85ce9c4/analysis/1407782822/",
      "changelogHtml": " EotW Dovahkiin&#39;s Journeyman Armor has been lootified too. <br/> \n Few tweaks to the keywords. <br/> \n The file this xml was based on has been updated, so i&#39;d recommend you use it as a base and, like it is recommended, use this as a guide to make your own file. <br/> \n some mage gloves from the unofficial skyrim patch were added to the xml file <br/> \n The clothing version of the Skaal armor was added to the xml file <br/> \n A few robes from the [now hidden] mod Crafting for mages, alchemists and warriors have been added to the XML file. <br/> \n Pieces of mods that are really simple or really small compared to the rest of the mod will only be mentioned in the changelog from now on. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Custom%20xml%20and%20tutorial-45113-1-04.7z?fid=1000075790&ttl=1535825656&ri=8192&rs=8192&setec=6d65f4613dd604144743add1983aac1d"
    }
  ]
}