{
  "modId": 4514.0,
  "modName": "Overlook Tower Player Home",
  "summary": "Player-Home centrally located; which includes ALL \\'amenities\\' (such as Smithing, Cooking, Alchemy, Enchanting, etc).  Connected to MAJOR LOCATIONS throughout Skyrim.  Plenty of STORAGE and EXTRAs!!!  Hassle-FREE updates & addons!",
  "descriptionHtml": "**********\r\nI, SLuckyD, am no longer developing or supporting this mod.\r\n**********\r\n\r\n\r\nOverlook Tower v1.81b\r\n- a Player Home mod by SLuckyD\r\n\r\n\r\n*** This mod is engineered for \\'effortless upgrading.\\' ***\r\n(once you\\'ve \\'moved\\' all your stuff in, you\\'ll NEVER have to do it again!!)\r\n\r\n\r\nREAD THE INSTRUCTIONS BEFORE DOWNLOADING AND USING.  This Mod is still unfinished, but is 100% usable... there are areas which may SEEM buggy (missing walls, floating doors, etc), but they aren\\'t.\r\n\r\nONLY POST COMMENTS IF: you have something politely constructive to say, have a technical problem, or want to express your truthful opinion on the Tower (don\\'t forget I READ this stuff, and may respond accordingly!).\r\n\r\n\r\n[FEATURES]\r\n- Player-Owned Storage; so items placed in containers will stay there permanently.\r\n- All of the Doom Stones\r\n- All of the Nine Divine Shrines\r\n- All the \\'Amenities\\' (smithing, cooking, alchemy, enchanting, smelting, etc)\r\n- Player-Owned Bed, for that well-rested bonus\r\n- Rooftop Garden; with all the plants\r\n- Throne Room and Trophy Room\r\n- Mushroom Cave, FishPond, Butcher Room, Petting Zoo\r\n- Mead Hall and Wine Vault\r\n- \\'War Room\\' with a UNIQUE teleporter map of Skyrim\r\n- Salt Mine for spicing up your cooking/alchemy\r\n- Mining for ALL types of ores and Soul Gems\r\n- Several animals and creatures throughout the place, for harvesting their ingredients.\r\n- A view from the Rooftop of MOST of Skyrim\r\n- Followers/Companions will follow you anywhere you want to lead them\r\n\r\nTry this STANDALONE mod to help move your belongings to your home:\r\nRing of Boost Carry Weight Maximum +10,000 (Ring of Himalayan Hauling)\r\nhttp://skyrim.nexusmods.com/mods/8520\r\n\r\nTry this STANDALONE mod to decorate your home with 65 different types of Mannequins (change races/gender, movement and scaling options, even POSE THEM):\r\nSLuckyD\\'s Portable On-demand Disposable Unlimited Mannequins\r\nhttp://skyrim.nexusmods.com/mods/10578\r\n\r\n\r\n[REQUIRED]\r\n= Latest Skyrim Update/Patch (v1.5.26.05 or higher).  \r\n- Overlook Tower BASEv1: installed and enabled\r\n- Overlook Tower MAINvX: installed and enabled (newest version is v1.81b)\r\n= BOTH of the above need to be installed and enabled for this mod to work.\r\n- If upgrading from an OLD version: DISABLE the PREVIOUS version of Overlook Tower MAINvX.esp!\r\n- DO NOT disable or rename the Overlook Tower - BASEv1.esm!!!\r\n\r\n\r\n[UPGRADING FROM A PREVIOUS VERSION]\r\n(if ungrading from the preCK v1.0 of this mod, see way below for special directions)\r\n*** AS WITH ANY MOD; before installing, enabling, and/or playing a new version you SHOULD:\r\n- load your newest saveGame with the OLD version still loaded\r\n- fast-travel your Player away from ANYWHERE the mod changes or places something\r\n- save a NEW saveGame, exit Skyrim\r\n- uninstall the OLD version, install the NEW version\r\n- load the NEW saveGame, play\r\n*** This ensures you have a relatively CLEAN saveGame to bridge versions.  If you do NOT do this, and saved your game in the same area a mod alters, STRANGE THINGS may happen - potentially DAMAGING your future saveGames\\' data.\r\n\r\n\r\n[FRESH INSTALLATION]\r\n- copy this mod\\'s DATA folder to your game\\'s installation folder\r\n- be sure to have a copy of \\\"Overlook Tower - BASEv1\\\" package properly installed in your game\\'s DATA folder (ESM file, Meshes & Textures folders)\r\n- run the game; and in the Skyrim Launcher, click \\\"Data Files\\\"\r\n- make sure the box next to this mod\\'s ESP is CHECKED\r\n- make sure the box next to \\\"Overlook Tower - BASEv1.esm\\\" is CHECKED\r\n- click \\\"OK\\\" then click \\\"Play\\\"\r\n= load order shouldn\\'t make a difference, nothing should conflict as I don\\'t change anything Vanilla (except navMeshes, and a couple dragon perches near the Tower, maybe a few other minor tweaks)\r\n\r\n\r\n[HOW TO PLAY & WHERE TO FIND IT]\r\n- FAST TRAVEL there, this version\\'s mapMarker is pre-discovered\r\n- OR navigate Player to Drelas\\' Cottage, head up the mountainside immediately behind it to the right\r\n- OR find an one of more than a dozen Ysgramor Garden Gnomes, located in spots throughout Skyrim\r\n- OR <the cheat method> ~ coc aaSLuckOTBasement\r\n(capital letters do NOT matter)\r\n\r\nStrategic Operations Center (War Room) - Activate the little banner posts on the 3D Map to travel instantly across all of Skyrim!  All the Player-Owned Homes are included, as well as the Winterhold College and Jorrvaskr.  Some of the smaller towns, spouse-homes, and other significant locations are included as well.  To RETURN to the Tower: each location is return-linked through the little Ysgramor Garden Gnomes, found in easy to spot yet inconspicuous places.\r\n\r\n* There is a \\'Housecarl-Cat\\' which is set to PlayerFaction.  It will NOT attack you, no matter what kind of front it puts up.  This is the only violent creature in the Tower that will never attack!  There is also a Giant out front - he WILL attack you, but only if you are within a couple steps.\r\n\r\n* EVERYTHING in the Tower RESPAWNS except for Player-Storage.  This means all the creatures, critters, fish, animals, flora, ore, salt, fungi, etc - so kill em & harvest their ingredients whenever you remember to!\r\n\r\n\r\n[TROUBLE SHOOTING & FAQ]\r\n\\\"Can\\'t find it\\\"\r\n\\\"Not working\\\"\r\n\\\"How do I...\\\"\r\n- place \\\"skyrim3dmap.nif\\\" in the folder \\\"DATA/Meshes/SLuckyD/OverlookTower/\\\"\r\n- place \\\"skyrimLOD16.dds\\\" and \\\"skyrimLOD16_n.dds\\\" in the folder \\\"DATA/Textures/SLuckyD/\\\"\r\n- place \\\"drsc_wardrobe_close_02.wav\\\" in the folder \\\"DATA/Sound/FX/DRSC/Wardrobe/Close/\\\"\r\n- place \\\"drsc_wardrobe_open_03.wav\\\" in the folder \\\"DATA/Sound/FX/DRSC/Wardrobe/Open/\\\"\r\n- place \\\"Overlook Tower - BASEv1.esm\\\" in the folder \\\"DATA/\\\"\r\n- place \\\"Overlook Tower - MAINvXX.esp\\\" in the folder \\\"DATA/\\\" (\\\"XX\\\" is a version #)\r\n- in the Skyrim Launcher, click \\\"Data Files\\\" then check-mark the boxes next to the above files\r\n- click \\\"OK\\\" then click \\\"Play\\\"\r\n- check your worldMap for a mapMarker near Labyrinthian (seeing THIS indicates the Tower mod is running)\r\n\r\n\r\nDo NOT panic if you see strange things, such as floating doors or missing walls:  These are NOT a glitch or bug!  These are places I haven\\'t placed or arranged any objects in yet.  If you fall, you won\\'t die, you\\'ll just be transported back to the \\'start\\' of that particular interior, unharmed.\r\n\r\nTorture Area - is attached to the SOC (the \\'war room\\'), on the other side of the room are barracks for any troops you may want to garrison against (or for) impending invasion. Neither area was completed.\r\n\r\nTraining Area - try my Moving Target Practice mod (linked to below).. I wanted to link that mod to this, but never got to it.\r\n\r\nNether Regions - (formerly known as the Shroom Cave) This area is nearly empty because I never placed all the clutter objects.  I have included most of the animals, fish, and fungi down there.  A quick walkthrough harvests everything - or eventually have one of the servants go and do it FOR you...  but be careful - you may get lost, and not everything is as friendly as the chickens.\r\n\r\nTrophy Room - Currently empty, but eventually the walls will be covered with mounted heads and trophies (most of which will be scripted to Player\\'s stats, such as number of kills, and for different animals)... as well as mannequins/displays strategically placed.  In the center will be a ball-pit for oversized gemstones, as well as piles of boullion after having acquired certain levels of wealth (all specially scripted to Player\\'s stats).\r\n\r\nMead Hall/Kitchen - The \\'dining area\\' will be placed on the balcony which skirts the walls of the hall at the top of the second floor.\r\n\r\nBedroom, and other areas which seem EMPTY - There would have been MUCH more \\\"clutter\\\" and decorations.\r\n\r\nRooftop garden - there are quite a bit of things to harvest up there already.  The Summit\\'s guardian is a dragon which can be seen for miles around.  Don\\'t worry though, it won\\'t attack unless YOU attack IT first.\r\n\r\nSPOUSES - I looked into this, and I think I can do it; but the changes I would have to make might interfere with other mods which mess with spouses.  Soooo.. I decided to leave this alone, and let the people already working hard on the anywhere-spouses and such mods get their stuff working properly, then use it in conjunction with the Tower.\r\n\r\nMANNEQUINS - try my SPODUM Mannequin mod (linked below)\r\n\r\nWEAPON RACKS & PLAQUES, DISPLAYS - I never go to these either.\r\n\r\nNPCs: \r\n- There would have been humanoid NPCs eventually. Starting with the main person of the Tower... kinda like the caretaker or such thing.\r\n\r\n- There would have been basic servants throughout the place - which Player may order \\'away\\' should their presence offend (assign them to always stay in their rooms or wherever). These people may also be given tasks like harvesting the garden, cooking, potions, merchants or trainers, etc..\r\n\r\n\r\n*** For those who may be experiencing CRASHES TO DESKTOP (CTDs):\r\n- This is usually caused by one of three things... 1- the ESM is not enabled, 2- my Data/ folder wasn\\'t copied over in its entirety (usually by modman software), 3- the saveGame you are attempting to load is potentially corrupt\r\n- Be aware that #1 applies to ALL ESMs... if you have a saveGame dependent on some other mod\\'s ESM which you\\'ve since uninstalled, this will cause CTDs\r\n- If you think it\\'s #3, try opening the console at the Title Screen (without loading a saveGame), type \\\"coc aaSLuckOTMain\\\", then try going to the location which makes it CTD.  If it works, you SURELY know your saveGame is to blame.\r\n- Remember that saveGames should be made in areas NOT changed or added to by this mod,and ideally ANY mod... some obscure interior or the West Watchtower usually works good.  Sometimes simply saving the mod in a different location works (while the older version of this mod enabled and the newer is disabled).\r\n- If you tried that and it still doesn\\'t work... sometimes, though relatively rare, there is another mod which is interfering with the game in ways it shouldn\\'t be.  Try disabling other mods to narrow down any problems.\r\n\r\n\r\n[BUGS, GLITCHES, or QUIRKS]\r\n- Some walls or other objects appear to be missing or floating, but they AREN\\'T... they haven\\'t been PLACED yet.  This will be finished in future versions... see below for details.\r\n- Distant LOD is VERY glitchy, this is a known bug in the CK (\\\"Update Distant LOD Data\\\" doesn\\'t work).\r\n- If an NPC is talking to Player while a Garden Gnome is activated, that NPC MIGHT come through to the SOC (into the Tower) with Player, speak another line, then go back from whence they came.  This doesn\\'t seem to be a problem, but it may freak some people out.\r\n- Followers will not go down into the Grand Cavern area of the Nether Regions (the area which has the waterfall and animals).  This latest navMesh bug thing with v1.5 struck just as I was working on this area, so I didn\\'t tweak it out of fear I might have to do it all over again.\r\n\t* If your follower gets stuck somewhere, they will always appear right next to you when you make an int/ext cell change (ie: go through a door from inside to outside).\r\n- I was unable to get Ivarstead connected to the Tower\\'s 3DMap.  Everytime I tried, the CK corrupted the entire town\\'s navMeshes (making the whole area, ummm... unusable).  So I decided to omit this town (there was an unlinked banner-post over it in the earlier version).\r\n- Lighting inside the Tower is all custom, but it seems not to trigger when it should.  Also, when it finally does trigger, it remains on even after fast-travel to another location.  This is because I use a custom weather scheme, and I haven\\'t gotten to applying a solution to correctly transition it from place to place.  I think I know of how to fix it... hopefully for the next version.\r\n\t* Until I can get this working flawlessly (just so you know), lighting is NOT permanently messed up, it will correct itself after a cell change or two, or by waiting (in-game) for an hour.  This is prob\\'ly an inconvenience to some more than anything. *\r\n\t\r\n\r\n[POTENTIAL CONFLICTS]\r\n- Any other mod which alters the areas I have placed my Garden Gnomes.\r\n- Any other mod which alters the cells directly behind Drelas\\' Cottage\r\n- Any other mod which uses any FormIDs between 01555000 and 01560000\r\n- Any other mod, INI setting, or software which alters the game of Skyrim\r\n- NMM or other modman software may not install the mod correctly, if you have problems: use the above directions for a manual installation.  It\\'s usually because my Data/ folder wasn\\'t extracted.\r\n\r\n(for specific conflicts and how to resolve them, see the discussion areas; there are solutions to common problems, but some types of problems require special attention.  Post if you get stuck!)\r\n\r\n\r\n[VERSION HISTORY]\r\nv1.81b - CURRENT version\r\n- replaced the navMeshes deleted to fix the 1.5.24 bug\r\n\t- Followers will now escort you right up to the front door, and to the Summit\r\n\t- Followers also escort you to and from any location on the 3DMap in the SOC\r\n\t- fast-travel markers are fixed and moved, horse now arrives in or near the stable\r\n- couple minor, esthetic changes & additions\r\n\r\nv1.8b\r\n- added to the Shroom Cave, changed it\\'s name to the \\\"Nether Regions\\\"\r\n\t- adds the Petting Zoo & Butcher Area\r\n\t\t- dumbwaiter up to the Mead Hall\r\n\t\t- slaughterfish, etc in the water\r\n\t- adds the Fish Pond, with insects\r\n\t\t- attached is the Shroom Farm Room\r\n\t- changes and adds to the Salt Mines\r\n\t\t- minable salt, minable soul-gems\r\n\t- adds various creatures in various places\r\n\t- adds the Grand Cavern, with waterfall\r\n\t\t- various animals are placed here\r\n\t\t- respawning nirnroots\r\n\t- area is optimized with rooms & portals for performance\r\n- adds the Torture Area to the SOC\r\n- adds the Stables and some archiecture to the front entrance area\r\n\t- approach up the mountain has been better nerfed for followers\r\n- finishes the Mead Hall architecture\r\n\t- rocks and water below the waterfall were unnerfed and are for real now\r\n- tweaked the Summit Tower approach for better nerfing\r\n- attempts to get custom ambient lighting for the interior of the Tower\r\n\t- may be buggy, see the known issues section of this doc\r\n\t- I\\'m talking about the day/night effect, NOT torches and other dynamic lighting \r\n- links the rest of the locations which were placed but unlinked on the 3D Map Teleporter\r\n\t- most of the major areas are now linked (except one, see known issues & bugs)\r\n- adds water & candlelight to the Throne Room\r\n\r\nv1.7b\r\n- added to the Shroom Cave\r\n- added back the Summit Tower (& a Dragon to \\'guard\\' it)\r\n- changed the SOC\\'s architecture & layout, added some beds for the barracks area\r\n- tweaked the placement of a couple Garden Gnomes so the bushes don\\'t interfere with activating them\r\n- HOPEFULLY fixed the issue of random people using the Garden Gnomes (showing up inside the Tower)\r\n- removed Distant LOD, I found out this IS a KNOWN bug with the CK (as I thought)\r\n- added back the Thrones, changed the layout of the Throne Room\r\n- added some door frames and tweaked some placement of architecture which was \\'off\\'\r\n\r\nv1.6b\r\n- added a bunch more architecture to different areas\r\n- added a giant and snow cat\r\n- added more warRoom doors\r\n\r\nv1.5b - First postCK version (this version, and all since, use Overlook Tower - BASEv1.esm)\r\n- Mod was completely remade from scratch, using the Skyrim Creation Kit, and tweaked using TESvSnip v4.2\r\n- Player Storage is FULLY functional and will NOT be affected by future updates or changes\r\n\r\nv1.0 - initial preCK release (used OverlookTower v1.0 by SLuckyD.esm)\r\nShould be replaced with the newest version; USING THE PROCEDURE DESCRIBED to prevent loss of items in the old version\\'s storage\r\n\r\n\r\n[UPGRADING FROM THE preCK VERSION]\r\n- if you were using the v1.0 I released around Christmas, you must go to the Tower; remove everything from storage, exit the Tower and fast-travel somewhere. Save to a NEW saveGame; restart and load that saveGame with the new version\\'s files enabled and ALL the old ones disabled. Play as you like, as now you have no worries of ever losing your stored items again.\r\n\r\n\r\n[LEGAL]\r\nBethesda (or \\\"Licensor\\\" as defined in the Skyrim EULA) is not the author of the \\\"Customized Game Materials\\\" included in this package.\r\n“THIS MATERIAL IS NOT MADE, GUARANTEED OR SUPPORTED BY THE PUBLISHER OF THE SOFTWARE OR ITS AFFILIATES.”\r\n\r\nSLuckyD is not responsible for any damage these materials may cause, and/or failure to successfully deliver any stated products or services.\r\n\r\n\r\n\r\n[OTHER SLuckyD RELEASES]\r\n(availability may be limited until I can update them to 100% compatible Skyrim Creation Kit versions)\r\n\r\n- Portable On-demand Disposable Unlimited Mannequins (SPODUM)\r\nhttp://skyrim.nexusmods.com/mods/10578\r\n\r\n- Moving Target Practice\r\nhttp://skyrim.nexusmods.com/mods/28336\r\n\r\n- Vanilla Mannequin Script Fix\r\nhttp://skyrim.nexusmods.com/mods/10652\r\n\r\n- Overlook Tower Player-Home\r\nhttp://skyrim.nexusmods.com/mods/4514\r\n\r\n- Gokstad Sailable Viking Ship & Portable Player Home\r\nhttp://skyrim.nexusmods.com/mods/5432\r\n\r\n- Faster Woodland Creatures\r\nhttp://skyrim.nexusmods.com/mods/4799\r\n\r\n- Wounded Knee Gulch\r\nhttp://skyrim.nexusmods.com/mods/3787\r\n\r\n- Ring of Fortify Carry Weight plus 10000\r\nhttp://skyrim.nexusmods.com/mods/8520\r\n\r\n- Bullseye\r\nhttp://skyrim.nexusmods.com/mods/2945\r\n",
  "categoryId": "68",
  "version": "1.81b",
  "author": "SLuckyD",
  "createdUnix": "1324761579",
  "updatedUnix": "1333390477",
  "containsAdultContent": false,
  "uploadedBy": "SLuckyD",
  "primaryFile": null,
  "files": [
    {
      "fileId": "14005",
      "name": "Overlook Tower Original preCK Version ESM",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Overlook Tower Original preCK Version ESM-4514.rar",
      "uploadedUnix": "1324924357",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8102ccce65368f9b5b5d892541550b4b30c3d8b9c670f6b197e103c3c1ffd796/analysis/1406559911/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Overlook%20Tower%20Original%20preCK%20Version%20ESM-4514.rar?fid=14005&ttl=1535760349&ri=8192&rs=8192&setec=3df1bee93a95b536e037c1d325437b02"
    },
    {
      "fileId": "15205",
      "name": "Overlook Tower Summit Addon for Original Version",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Overlook Tower Summit Addon for Original Version-4514.rar",
      "uploadedUnix": "1325278076",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7f37c03d8d16445fa46f617c1e1bad030e70dd4ca48942cf986c7b6181102a08/analysis/1406571189/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Overlook%20Tower%20Summit%20Addon%20for%20Original%20Version-4514.rar?fid=15205&ttl=1535760349&ri=8192&rs=8192&setec=d271223e6ca76cdfc5c6a3eebac8f19e"
    },
    {
      "fileId": "30821",
      "name": "Overlook Tower - BASEv1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2633",
      "fileName": "Overlook Tower - BASEv1-4514-1-0.rar",
      "uploadedUnix": "1329193395",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a18c4b8179182d91a2d7cb5fefbe3c9dbc16ca08f8ec76c4f611366973124381/analysis/1406680806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Overlook%20Tower%20-%20BASEv1-4514-1-0.rar?fid=30821&ttl=1535760350&ri=8192&rs=8192&setec=229d5278b7bd070de1b23928ab6e07f2"
    },
    {
      "fileId": "30848",
      "name": "Overlook Tower - MAINv1_5beta",
      "version": "1.5b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "458",
      "fileName": "Overlook Tower - MAINv1_5beta-4514.rar",
      "uploadedUnix": "1329196959",
      "modVersion": "1.5b",
      "virusScanUrl": "https://www.virustotal.com/file/6c6e8bd796fb4591505dfc1b7fc0e1d96ece9ca75c568c45b6bf2b2c3447c35b/analysis/1406680868/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Overlook%20Tower%20-%20MAINv1_5beta-4514.rar?fid=30848&ttl=1535760351&ri=8192&rs=8192&setec=846d5999a505f3552b6985de2ccad661"
    },
    {
      "fileId": "31902",
      "name": "Overlook Tower - MAINv1_6beta",
      "version": "1.6b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "688",
      "fileName": "Overlook Tower - MAINv1_6beta-4514.rar",
      "uploadedUnix": "1329365408",
      "modVersion": "1.6b",
      "virusScanUrl": "https://www.virustotal.com/file/90345ee7111de582d7014f70efa7b0cae6ad8b43c2133e6f723b80fa668b030d/analysis/1406686399/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Overlook%20Tower%20-%20MAINv1_6beta-4514.rar?fid=31902&ttl=1535760351&ri=8192&rs=8192&setec=567aa2cb88c02e777d2be237d0ddc986"
    },
    {
      "fileId": "41084",
      "name": "Overlook Tower - MAINv1_7beta",
      "version": "1.7b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "668",
      "fileName": "Overlook Tower - MAINv1_7beta-4514.rar",
      "uploadedUnix": "1331147087",
      "modVersion": "1.7b",
      "virusScanUrl": "https://www.virustotal.com/file/21e710bae81da3a130577b870bfb099b906b59bfef490c99dd7a5abe9599ee6d/analysis/1406736489/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Overlook%20Tower%20-%20MAINv1_7beta-4514.rar?fid=41084&ttl=1535760352&ri=8192&rs=8192&setec=768f7d6bf9af056b9f947ef0fd67b5f9"
    },
    {
      "fileId": "47588",
      "name": "Overlook Tower - MAINv1_8beta",
      "version": "1.8b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "467",
      "fileName": "Overlook Tower - MAINv1_8beta-4514.rar",
      "uploadedUnix": "1332915567",
      "modVersion": "1.8b",
      "virusScanUrl": "https://www.virustotal.com/file/f4df5a3e17fabfac62d54fe9d85ef7de60cfc2d31c06f528a1a4c9f5d6221282/analysis/1406783827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Overlook%20Tower%20-%20MAINv1_8beta-4514.rar?fid=47588&ttl=1535760352&ri=8192&rs=8192&setec=2ab58da74c75a0743ddfb57d0dbcb96d"
    },
    {
      "fileId": "49409",
      "name": "Overlook Tower - MAINv1_81beta",
      "version": "1.81b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1120",
      "fileName": "Overlook Tower - MAINv1_81beta-4514.rar",
      "uploadedUnix": "1333390477",
      "modVersion": "1.81b",
      "virusScanUrl": "https://www.virustotal.com/file/ce69141c1d086f4a6f2320b40208c7b0c394dc17943f77224483e7b915c4d21a/analysis/1406793724/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Overlook%20Tower%20-%20MAINv1_81beta-4514.rar?fid=49409&ttl=1535760352&ri=8192&rs=8192&setec=b20ee1c720b3a71fcb33e0e7dcf53615"
    }
  ]
}