{
  "modId": 45167.0,
  "modName": "Zion Follower",
  "summary": "A new Nord follower that is in The Bannered Mare inside Whiterun.",
  "descriptionHtml": "ATTENTION! ATTENTION! The clothes he is wearing in the second picture is called Duelists Longcoat by str8maverick. It can be found here, http://skyrim.nexusmods.com/mods/34051//?\r\n\r\nThis is my first attempt on a mod. I created a follower in honor of my friend. Named after his Skyrim character, we always told stories of how we wish we could play Skyrim together. So I made a follower. Close enough I guess.\r\n\r\nINFORMATION: This is Zion, a Nord. He hangs around The Bannered Mare that is located in Whiterun. When you approach him he should be around the Bannered Mare. He is wearing some normal clothes. He starts out with, Zion\\'s Bow (Hunting Bow that does 20 damage), 600 steel arrows, and 9 Lock picks. The rest is for you to decide.\r\n\r\nINSTALLATION: Just drop BetterNPC\\'S.esp in your Data folder. Which is usually located here, C:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\Skyrim\\\\Data \r\n\r\nThanks for downloading/viewing my mod. This was my first attempt at modding. I plan on learning much more and releasing a bunch of more mods.\r\n\r\nAlright everybody, Since my first mod alright got 25+ Downloads in two days, I think I\\'m going to become a modder. After some training and practice, I think I could create some pretty neat stuff! Right now I\\'m working on a, Better NPC\\'s mod. In it I will be editing some NPC looks. And making them Marriable or A follower. So I should have that sometime this week. Or, by Sunday. At least a early version.\r\nSo far I have slightly edited,\r\n\r\nAela The Huntress\r\n\r\nHroki\r\n\r\nYsolda\r\n\r\nAnd, Lydia.\r\n\r\nMORE TO COME!",
  "categoryId": "96",
  "version": "V1",
  "author": "Dylan Latarewicz",
  "createdUnix": "1382404722",
  "updatedUnix": "1382404719",
  "containsAdultContent": false,
  "uploadedBy": "WeirdAssassin8",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000069139",
      "name": "Zion Follower",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Zion Follower-45167-V1.rar",
      "uploadedUnix": "1382404719",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/46306283b0e47013e5cdc7681f5a54872b1dca45950d294941cc18017639341c/analysis/1407764464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Zion%20Follower-45167-V1.rar?fid=1000069139&ttl=1535825704&ri=8192&rs=8192&setec=dfb23cd8006f37761e5c416131e72e4f"
    }
  ]
}