{
  "modId": 45273.0,
  "modName": "Riften House - A Honeyside Remodel",
  "summary": "The first remodel of Honeyside to work in conjunction with HF and TM Phoenix&#39;s Multiple Adoption Mod.  ",
  "descriptionHtml": "[color=green]RIFTEN HOUSE - A Honeyside Remodel v4.0[/color]\r<br />\r<br />A Mod by PCGirl Updated June 20, 2016\r<br />\r<br />IN LIGHT OF ALL THE CHANGES THAT HAVE BEEN TAKING PLACE IN THE LAST LITTLE WHILE, I DO NOT WISH THIS MOD OR ANY PART OF IT TO BE RE-UPLOADED\r<br /> ANYWHERE ELSE, AND MORE SPECIFICALLY ANY SITE THAT CHARGES FOR MODS. MY\r<br /> MODS ARE FREE TO DOWNLOAD, BUT I DO NOT GIVE PERMISSION TO CONVERT THIS\r<br /> MOD TO ANY OTHER FORMAT.  THIS MOD IS EXCLUSIVE TO NEXUS AND WILL \r<br />REMAIN AS SUCH IN THE FORESEEABLE FUTURE.  ALL OTHER PERMISSIONS REMAIN \r<br />AS STATED IN THE PERMISSIONS SECTION.\r<br />\r<br />[url=http://s744.photobucket.com/user/PCGirl4/media/2013-10-22_00012_zps9890c1b9.jpg.html][img]http://i744.photobucket.com/albums/xx82/PCGirl4/2013-10-22_00012_zps9890c1b9.jpg[/img][/url]\r<br />\r<br />\r<br />[color=red]IMPORTANT STUFF TO NOTE[/color]:  This is the first remodel of the original Honeyside with Hearthfire and TMPhoenix Multiple Adoptions compatibility.  You must have Hearthfire installed for the house to work properly as there are criteria and items from that DLC used in my remodel.  This is the second house mod in the series of vanilla houses.  If you are using TM Phoenix’s mod make sure it is loaded after my house mod so that the components of his mod will pick up the links in my remodel.  However, if you are not using TM Phoenix’s Multiple Adoption mod you will not be able to move your children or your spouse into this home, only the player will be able to occupy the house.\r<br />SECONDLY:  This house is not 100% lore friendly, so move on if that is what you expect from this remodel.  I will not swap out furniture or other items that people do not like, nor will I make major changes to the room structures or décor.  That is just the way it is, so take it or leave it.  A lot of work went into this mod, as with any mod, and originally was made for my own use.  I did not intend to release this, but TMPhoenix has done such a fantastic job with the Multiple Adoptions Mod, that I decided to release it so that other people can still use the vanilla homes in conjunction with his mod.  I do intend to release all 5 vanilla homes re-modelled to work with Hearthfire and [url=http://skyrim.nexusmods.com/mods/29249/?]TMPhoenix’s Adoption mod.[/url]  \r<br />\r<br />\r<br />The home is complete with the ability to house your housecarl, spouse, and 6 children.  There is also new room for other followers. The main area of Honeyside has not been changed, however, the basement level has been expanded to run underneath the garden area.  A new followers room has been added in the house for 4 followers. If you are not using TM Phoenix’s Multiple Adoption Mod, I strongly reiterate that you will not be able to move your children or spouse into this home, only yourself.\r<br />\r<br />There are many storage areas in the home.  Mannequins, weapon storage, crafting areas, treasure storage, bookshelves, and many other little perks throughout the house.  Explore and discover all the special areas the house has to offer. Outside the porch is equipped with full smithing abilities, plantable containers, and a few other little perks. \r<br />\r<br />The kitchen offers full storage options, crafting oven, butter churn and many other things that the homeowner considers conveniences.\r<br />\r<br />[color=red]NEW UPDATE v3.0: A brand new crafting area, library, followers bedroom, pool, lounge area, gallery and archery range has been added in the house.  Some other small minor changes were made.  Bookcases were all redone and much more display room now.  Check out the new photos posted.  The new update has a few new things to watch for.  The pool room now has locker storage and will store your followers gear automatically upon entering the pool.  The gear will be returned to you once you get out of the pool.  Also, if you enter the house with weapons drawn, they will automatically sheath upon entering.  After all their are children and pets running around.  New displays cases for Thieves Guild Treasures and Dragon Claws, see pictures for what the shelves will hold.\r<br />\r<br />NEW UPDATE v4.0  This is a fairly substantial update as I redid a lot of the nav mesh and lighting.  Hopefully, this will help followers move around a little better and brighten the whole house.  I also added items into the storage containers to help your NPC get started, as well as a few new static items to fill out the decor.  There is 9 new plantable containers in the pool room now as well as the original ones outside on the patio. A few new idles, mostly in the followers area. Also, the pool is set for Frostfall users.   The mod has also been cleaned with TesEdit.[/color]\r<br />\r<br />I was given the honor of being featured on YouTube Daily Skyrim Mod Shout Outs. You can catch it here or through the video link on the mod page.\r<br />\r<br />[url=https://www.youtube.com/watch?v=x1SjR82Ky38]VideoFeaturedonYoutube[/url]\r<br />\r<br />[color=red]RUSSIAN TRANSLATION[/color]  Modgames has honored my work by translating this house mod into Russian, which you can find here: [url=http://modgames.net/load/tes_v_skyrim/doma_i_lokacii/dom_v_riftene_pererabotannyj_medovik/254-1-0-17757]RussianVersionofRiftenHouse[/url]  The translation was done by Murderface(Skvizgar) and I thank him for the great job.\r<br />\r<br />[b]IT IS IMPORTANT TO NOTE THAT YOU SHOULD NOT PURCHASE THE PORCH UPGRADE FROM THE STEWARD AS SOME OF THE ITEMS FROM THE UPGRADE WILL OVER-RIDE THIS MOD[/b]. I have tried and tried to get these items to not appear in game, and the only way I have been successful is to not purchase the porch upgrade.  However, if you have already purchased the porch upgrade, and find that some items are still appearing you can get rid of them one of two ways: either, put your cursor on them and open the console and disable them, or you can mark the items that you want to get rid of by marking them for delete.  Hover the cursor on them, open the console and type in “MarkForDelete”, save, reload the save and they will have gone from the game. Make sure you have a back up save in case you accidentally delete the wrong things.  This does work, but you have to be careful of what you are deleting.  \r<br />\r<br />INSTALLATION NOTES:   Personally, I found it easier to install this mod from the very outset, in other words before purchasing it from the Steward and before becoming Thane.  You can then take Iona to the new home immediately without any hiccups.  You can still purchase all the usual upgrades from the Steward, except the porch of course, in case you wish to uninstall my mod and revert back to the vanilla version or simply to try another house mod. The porch upgrade can be purchased afterwards if you wish to.\r<br />\r<br />However, if you have already purchased the original Honeyside, and have your housecarl moved in, simply have her follow you somewhere else, install this mod and move her back into the new remodel as normal.  The house is recognized as Honeyside.  I simply use the “This is your new Home” option for the housecarl, or any other followers as contained within the mod  [url=http://skyrim.nexusmods.com/mods/18045/?]My Home is Your Home[/url].  \r<br />\r<br />If Iona is not at the house at all you may have to go into the original vanilla Honeyside to retrieve her. Type in console &#34;coc riftenhoneyside&#34; this will take you to the original vanilla house in cyber space. Tell Iona to follow you, this is very important to do as she won&#39;t show up if you don&#39;t. Once you have Iona following, then again in console type in &#34;coc riverwood&#34; unfortunately you cannot go back to Riften directly, but fast travel to the stables outside Riften Iona will be with you. Make sure you have told her to follow you before you leave the vanilla house or this will not work. Once you go into the new house with Iona following you, you can use the command that this is your new home and she will now stay there. I use the the mod My Home is Your Home which works perfectly for any followers.\r<br />  \r<br />You will need to cast the “Bless Home” spell contained with TMPhoenix’s mod in order to have the children recognize the remodel as your new home.  Tell them to move to the “New House” not into Honeyside.  You are only able to have 2 children move into the vanilla homes, while this mod allows for a maximum of 6 children to move in, and the spell will recognize that requirement.  Your spouse as well will recognize this spell, and again you must tell them to move into the “New House” not the vanilla one.  \r<br />\r<br />Sometimes the children will be slow in moving into the home whether it is the vanilla or a remodel version of it.  Be Patient, they will show up. You can also go to another location in game and either sleep or wait for 24 hours and return home at that point.  Everyone should be there.  All the vanilla markers are recognized for outside play time, your spouse’s activities, such as setting up a shop, as well as some special activities that have been added in for Iona to complete when she is not acting as follower.  She will visit the Bee and Bard, the Temple of Mara, and some areas in the home that are not normally recognized by the vanilla package, provided she is not accompanying you on a mission somewhere.  They are set on a specific schedule, so you don’t need to do anything, but leave her at home.\r<br />\r<br />UPDATES:  overwrite existing files or use a clean install for updating the mod.  I find a clean install works the best. In console type &#34;resetinterior riftenhoneyside&#34; once the mod is removed and before installing the new update.  Save your game in between.  Most of you know the drill.\r<br />\r<br />\r<br />My Breezehome remodel can be found here [url=http://skyrim.nexusmods.com/mods/44079//?]The Whitehouse – A Breezehome Remodel[/url]\r<br />My Hjerim remodel can be found here [url=http://www.nexusmods.com/skyrim/mods/54222/?]Hjerim Estate - A Hjerim Remodel[/url]\r<br />\r<br />\r<br />[color=blue]KUDOS & CREDITS[/color]\r<br />Where to start, firstly I need to thank the two people who have mentored me throughout learning the CK and helping me trouble shoot problems, spending many long hours on chats with me to sort through things.   Their sense of humor, encouragement and letting me use them as sounding boards when I wanted to give up on the whole thing, kept me going.   Berticus and Gentester, I couldn’t have completed the mod without their instruction and friendship.  It seems so inadequate to say, but Thank you so much to both of you.  I honestly didn’t think it would finally be completed. \r<br />TM Phoenix for the inspiration to do this mod in the first place and for putting together a fantastic mod with his Multiple Adoptions.\r<br />\r<br />I apologize if I have forgotten anyone, there has been so many fantastic resources to choose from.  Let me know and I will add you into the list.   Thank you to all of you as without these resources our mods would not be the best they can be.  See actual credits for a full list of resources.\r<br />\r<br />Comments & Reviews\r<br />If you enjoy my mod, thank you and feel free to leave a comment in the appropriate section, or endorse if you wish to.  I truly appreciate any constructive ideas and comments.  However, if you do not like my mod, that is fine too, simply move on to something else that you will like.  Not everyone has the same taste, which is why there are thousands of files to choose from. Please don’t leave rude comments as they will be removed and reported, and you face the potential of being banned from the site.  You have been duly warned.\r<br />\r<br />Disclaimer:   You may not use any part of this mod or the resources without express permission from the specific mod author/authors unless stated otherwise in the author/authors permissions.",
  "categoryId": "67",
  "version": "V4.0",
  "author": "PCGirl",
  "createdUnix": "1382512332",
  "updatedUnix": "1405237012",
  "containsAdultContent": false,
  "uploadedBy": "PCGirl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000069544",
      "name": "Riften House - A Honeyside Remodel",
      "version": "v1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "250177",
      "fileName": "Riften House - A Honeyside Remodel-45273-v1-0.rar",
      "uploadedUnix": "1382512323",
      "modVersion": "v1.0",
      "virusScanUrl": null,
      "changelogHtml": " main version release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riften%20House%20-%20A%20Honeyside%20Remodel-45273-v1-0.rar?fid=1000069544&ttl=1535825781&ri=8192&rs=8192&setec=8bc60231644d344b5117d982cd8d6185"
    },
    {
      "fileId": "1000075453",
      "name": "Riften House - A Honeyside Remodel",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "250163",
      "fileName": "Riften House - A Honeyside Remodel-45273-.rar",
      "uploadedUnix": "1383675876",
      "modVersion": null,
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riften%20House%20-%20A%20Honeyside%20Remodel-45273-.rar?fid=1000075453&ttl=1535825781&ri=8192&rs=8192&setec=ce06e80819f4144ddf3e27036c92dd9c"
    },
    {
      "fileId": "1000105993",
      "name": "Riften House - A Honeyside Remodel",
      "version": "v3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "279939",
      "fileName": "Riften House - A Honeyside Remodel-45273-v3-0.rar",
      "uploadedUnix": "1398114472",
      "modVersion": "v3.0",
      "virusScanUrl": null,
      "changelogHtml": " Added in new crafting area <br/> \n Added in a new followers area and pool <br/> \n Added in a new display gallery and archery range <br/> \n Fixed some minor issues with some items and bookcases <br/> \n Added in some new exterior planters and lighting  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riften%20House%20-%20A%20Honeyside%20Remodel-45273-v3-0.rar?fid=1000105993&ttl=1535825782&ri=8192&rs=8192&setec=0d31da46cd0fee7072c39eb349da4a9c"
    },
    {
      "fileId": "1000117253",
      "name": "Riften House - A Honeyside Remodel",
      "version": "V4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "281646",
      "fileName": "Riften House - A Honeyside Remodel-45273-V4-0.rar",
      "uploadedUnix": "1405237012",
      "modVersion": "V4.0",
      "virusScanUrl": null,
      "changelogHtml": " Updated nav mesh and lighting <br/> \n Added in a few statics to fill out decor <br/> \n Cleaned with TesEdit <br/> \n Added more plantable containers inside <br/> \n Added items into storage containers <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riften%20House%20-%20A%20Honeyside%20Remodel-45273-V4-0.rar?fid=1000117253&ttl=1535825782&ri=8192&rs=8192&setec=a1625f55ffb92892a0d1252957558957"
    }
  ]
}