{
  "modId": 4528.0,
  "modName": "Possessive Corpses no more lazy zombies and shy nirnroots",
  "summary": "Diminish the increase in save size, by eliminating of the causes, killed NPCs loosing weapons, ALL ash like remains permanence and nirnroot glow and root spawning. Also, reduces arrow spamming. 100% compatible with 1.4 (and previous versions).",
  "descriptionHtml": "Possessive corpses, no more lazy zombies and shy nirnroots.\r\n[url=http://forums.bethsoft.com/topic/1326580-rel-possesive-corpses-no-more-lazy-zombies-and-shy-nirnroots]Link to Betsoft thread[/url]\r\n---------------------\r\n[u][b]WHAT THIS MOD DOES:[/b][/u]\r\n---------------------\r\n1.\t-Weapons from dead actors are cleaned properly by the game on respawning.\r\n2.\t-Reanimated actors won\\'t left ash piles. Instead they will fall dead again (you can raise them again). This feature, is optional and no longer necessary. As I like it a lot, I\\'m extending it in the off-spin of possessive corpses [url=http://skyrim.nexusmods.com/downloads/file.php?id=9726]Necromancy 101[/url] (you can just overwrite the pex file from this mod with the one from Necromancy 101, it only adds more features).\r\n3.\t-Nirnroot plants won\\'t generate new glows. Previous ones will be removed. So, you won\\'t need to delete them from the game on your own.\r\n4.\t-All body remains like ash piles (from creatures and from reanimated actors if you delete the script avoiding this), ice piles, ghostly remains and wisp cores will be correctly deleted from the game once you are far enough from the cell where they have been originated.\r\n5.     -The amount of arrows per cell (not counting the ones in inventories, droped or attached to actors has been reduced from 15 to 5.\r\nThis mod, changes the iDeathDropWeaponChance game setting from 100 to 0. This way, actors won\\'t drop their weapons when killed (the weapon may appear separated from them, but they are considered not dropped by the game). What you will notice is that you won\\'t have the option to take a just dead actor\\'s weapon from the floor, to do so you\\'ll need to access the actor inventory, activating either the actor or the weapon.\r\n\r\n-----------\r\n[b][u]WHY?:[/u][/b]\r\n-----------\r\nWhen a dead actor drops a weapon, while the actor is removed from game at cell respawning, the weapon is not removed. \r\n\r\nWhen a dead actor is reanimated, when the effect fades, it crumble to ashes and those ash piles aren\\'t removed and even create more ash piles (The ash pile from wisp mother though IS removed properly, both types of ghostly remains, ice piles and wisp cores remain in game forever -I\\'ll try solving this in next releases-). \r\n\r\nThe glow of the nirnroot is applied even if you haven\\'t harvest it and when you do harvest the plant only the last applied glow is removed, this way, each time a nirnroot you didn\\'t harvest have a respawn a new non-removable glow bloats the saved game.\r\n\r\nTalking further about the weapons case, in theory, this effect shouldn\\'t be very noticeable, as the only needed data are the weapon base ID, Ref ID, X, Y and Z positions and the angles. But as you can see in the objects placed in the world in previous games, there are other variables that while won\\'t be used in this case are reserved and occupy space. \r\n\r\nWith all of this, I think each weapon dropped weights around 200 bytes (unless object data parts are assigned dynamically, in which case unused ones wouldn\\'t have a reserved space and the file could be as small as 36 bytes, but I found this quite improbable). \r\n\r\nEven this way, 5000 weapons must be dropped to increase your savegmage 1 Mb. But again, it\\'s not that simple.\r\n\r\nUsing myself as an example, in 139 hours my character killed 570 persons, 454 undead and 15 daedra, for a total of 1039 actors that could have dropped weapons. Supposing I wouldn\\'t use sneak attacks and collect weapons, that would mean around 200 Kb. Now considering that I have been using followers and that Sometimes actors kill each other not always in your presence (I suppose this can\\'t happen in a different cell than the one you are in, but the terrain didn\\'t always let you see all happening around you). \r\n\r\nSo, in my game as an example around 300-500 Kb from my save could be only weapons on the floor. I have been avoiding a lot of combats because of a misunderstanding, so check your own game data in general stats to have a better idea of how this influence your save file size, considering your playing style.\r\n\r\nThe same is applied to ash piles, other remains and nirnrooth plants glow.\r\n\r\nIn previous games, cels where only respawned when you visit them again after the spawning time has passed. This may or may not be the case of this game, but despite what you do with the interior cells, you will be passing constantly by many exterior areas and there is where nirnroot plants and fight between NPCs from different factions will left all their remains (along the remains you produce yourself). So, it\\'s wise to have care with those factors.\r\n\r\n----------------------------------------------------------------------------------------------------------------------------\r\n\r\n\r\nI used SkyEdit for the weapon part. I have tested this mod for various days without any ill effect.\r\n\r\nIf you want to see this working, go to do some killing, then go to a non adjacent cell and wait until the respawn happens. With this mod no \\'orphaned\\' weapon should remain on the floor after its owner has been deleted, while without it only the weapons of people killed by treason (a non hostile target or a someone killed by a sneak attack) will be deleted. \r\n\r\nI made both the reanimated actors and the nirnroot part with pex decompiler (http://www.skyrimnexus.com/downloads/file.php?id=2909) and pex compiler (http://www.skyrimnexus.com/downloads/file.php?id=4058) from Onelessname and using a HEx editor to fix a problem I have.\r\n\r\nNow all has been upgraded to CK version.\r\n---------------------------------------------------------------------------------------------------------------------------\r\n[u][b]INSTALATION: [/b][/u]\r\n\r\nDrop the esp file and the scripts folder in your data directory. If you didn\\'t install one of the scripts or the esp, the corresponding part of the mod won\\'t be working but the rest will do. So, this mod is modular.\r\n\r\nThe only dependence relation is the one between Posesivecorpses.esp towards Defaultdeleteselfonreset, if you want the ash piles, ice piles and gostly remains deleted. \r\n\r\n[list]\r\n-[u]posesivecorpses.esp:[/u] controls the weapons reference not unattaching from deceased actors and ashes and similar deleting. Also, reduces the number of arrows per cell.\r\n[*]   -if you take this file from any version previous to 1.6, it will only handle the weapons part.\r\n-[u]nirnrootactivatorscript.pex:[/u] Avoid the nirnroot glow and root accumulation. there are four versions:\r\n[*]   -By default, nirnroots will work as intended. only one glow at a time.\r\n[*]   -If you delete nirnrootactivatorscript.pex from the scripts folder, nirnroots won\\'t glow at all.\r\n[*]   -No regrowing: Like default. Once you take a nirnroot won\\'t grow again. Lore friendly.\r\n[*]   -No nirnroots: you won\\'t see more nirnroots in the game.\r\n[u]-reanimateashpile.pex:[/u] avoids reanimated corpses generating ash piles. Not needed now, but I think it\\'s an improvement.\r\n-[u]Defaultdeleteselfonreset.pex:[/u] Needed for posesivecorpses.esp ashlike remain deletion. Also eliminates stacked nirnroot junk.\r\n-[u]Wispcorescript.pex:[/u] Eliminates the wisp core remain (from wisps, it\\'s different from ashlike ones) when the cell is unloaded.\r\n-[u]dragonpriestactorscript.pex:[/u] Avoids the dragon priests leaving an ash pile. Not needed now, but having a corpse and a pile...\r\n-[u]icewraithparticlesscript.pex:[/u] (from icewraith_no_icepile separate download): Icewraiths leave a corpse. not needed now. \r\n[/list]\r\n\r\nAny esp file must go in the Skyrim/data folder and any pex file in the Skyrim/data/scripts folder. \r\n\r\n----------------------------------------------------------------------------------------------------------------------------\r\n\r\n[u][b]There are various things bloating savegames. Here is what you need to do with the known ones:[/b][/u]\r\n\r\n·\t-Nirnroot: This mod,s nirnrootactivatorscript.pex avoid more glows to be generated and removes the ones already created. Of course there is a way to eliminate them without using this mod, but it\\'s very annoying. For that, with the console active, put your cursor over the glow zone, press left mouse button and type disable. If the glow diminish you have disabled a glow instance, type markfordelete and repeat the operation until there are no more glow instances. If the glow didn\\'t diminish then you have disable another thing, type enable and keep in mind that the object may not reappear until you close the console, so don\\'t freak out if you disable a rock and didn\\'t reappear when you type enable. But this is only if you didn\\'t use this mod, that eliminate them for you.\r\n\r\n\r\n·\t-Arrows: Missed arrows aren\\'t deleted by the game, but there is a max number of arrows allowed in the world. Once you (or another actor) fires an arrow pass that limit, the first one being generated is removed. This way, arrows can last months but won\\'t ever pass the limit number. In my game that number is 15, but Those of you with ultra settings may have a greater number (I really don\\'t know what controls this number and if can be changed at all).\r\n\r\n·\t-Any remain different than an actual corpse (ash piles, ghostly remains, ice piles...), won\\'t disappear AND in some cases creates duplicates. Disable them with the console and then (once you ensured their disappearance) type markfordelete. Then wait a couple of seconds to ensure that a replicate isn\\'t created and if so, delete as the previous one. Now this mod will make all of them (including the ones in your game previously to installing this) will disappear once their cell is loaded and then unloaded (pay them a visit and go far enough).\r\n\r\n·\t-If you don\\'t want to use posesivecorpses.esp, when someone is killed in combat, take their weapons from the ground and place them in their inventory (or in a different respawning one). If you found weapons from combats between NPCs on the floor, take them and put in the inventory of the next enemy you kill (or the same NPCs if hasn\\'t disappeared yet). When you kill someone before has time to react, this may not be necessary, just put your crossair on the weapon and if instead of the option to take it you have the option to access the corpse inventory the weapon will be erased properly anyway. \r\n---------------------------------------------------------------------------------------------------------------------------\r\n[u][b]HOW THE STACKED NIRNROOT GLOW ELIMINATION WORKS:[/b][/u]\r\nThis file will eliminate from your game at long last the remaining nirnroot glows stacked over and over again. Yes, you will finally get rid of the old glows! \r\n\r\nNext time you approach one of those sun glowing nirnroot, you will be able to see it\\'s annoying glow again, but next time the cell is unloaded, not respawned just unloaded, the glow will have gone for good. \r\n\r\nThis means that you don\\'t need to go to a remote place and wait until the cells respawn. Remember how far away you can see one of those hell spawns? Now that you are so far, go a bit farther until you can\\'t see it, then return, and voila! no glow at all.\r\n\r\nTo be more precise, you only need to be close enough for the cell the nirnroot is in to be loaded in memory. Then once that cell has been unloaded the glows will cease to exist. \r\n\r\nThis may affect other objects Bethesda assigned the script I edited. This is a good thing, as the purpose of the original script was to delete things when the respawn happens. This only makes it delete without you needing to wait and makes the deleting actually work. So, if there are other objects using this script in vanilla they are things supposed to be deleted but being stuck while you where using vanilla. Anyway, don\\'t overexcite, I am been looking for things using this script and so far, nirnroot glows are the only things I had found using it.\r\n\r\nNow you can relax, knowing that the nirnroot glows will be all deleted or you could use a single game session to pass near enough to each water shore you have previously visited to eliminate all the extra glows at once.\r\n\r\nThe only disadvantage of this change, is that while you have it installed (once you deleted the deleted nirnroot plants will remain deleted, so you can uninstall it safely, as far as you have one of the files avoiding further glow stacking), if you are using one of the versions of the nirnroot part of my mod, that make them glow without stacking, you will only see them glowing when you return to their cell after a respawn. Then once you go, the glow will disappear until you return after another respawn happened (if you are using a short spawn time mod, this won\\'t matter at all).\r\n\r\nThe first version I made deleted the glows on loading the cell, meaning you wouldn\\'t even see them for starter, but as it could be used by other objects, I decided to make this lighter version instead, to avoid unnecessary risks.\r\n\r\n---------------------------------------------------------------------------------------------------------------------------\r\n[u][b]CHANGELOG:[/b][/u]\r\n·\t-version 1: Avoids weapons from actors killed in combat from remaining after the corpse are cleaned.\r\n·\t-version 1.1: Reanimated corpses fall dead again, instead of crumbling to ashes.\r\n·\t-version 1.2: Nirnroot plants will stop generating glows.\r\n·\t-Version 1.3: The already created glows will be eliminated.\r\n·\t-Version 1.4: the wisp core (the remain of dead wisps) will disappear on unloading their cell (no need to wait for the respawn). Dragon priests won\\'t leave an ash pile. Only their armor (unusable. Is a corpse that will disappear as other corpses). \r\n·\t-Version 1.5: updated the nirnroot script, to eliminate the roots that where acumulating the same way as the glows, but becoming invisible instead. This didn\\'t eliminate the already created ones, BUT the script  eliminating the glows already created, does. So, this update is for people that after starting a new game, preffer not using that script (I would -and will- use it anyway, there could be other objects having the same problem).\r\n·\t1.6: All non-corpse remains (ash piles, ice piles, ghostly remains and wisp cores) are correctly handled. When you point your crosshair on them instead of \\\"take ash pile\\\" you will see \\\"take (ASCII characters)\\\", but once you open the inventory, you will see the name of the creature as always.\r\n·\t1.7: This fixes the little issue with reamining names in previous version. Now when you point your crosshair on a remain like an ash pile or an ice pile, the propper name will appear.\r\n·\t1.8: reduced arrow bloating, extra glows are deleted before you see them. Root deletion has been improved also. All nirnroot versions plus a new one without nirnroots has been added to the main download, which now is 100% CK made. Source codes are been added.\r\n\r\nOptional downloads:\r\n\r\n·\t-There is an optional download where ice wraiths left a corpse that eventually disappear instead of the ice pile. Not sure what do you think about it (actually dragging the corpse is surprising funny, it\\'s like a paper dragon from Chinese new year festivals), so I placed in the optional download area. \r\n\r\n[b][u]FUTURE PLANS:[/u][/b]\r\n·\t-Add BAIN support.\r\n·\t-I\\'ll try fixing also the arrow problem entirely.\r\n·\t-Will try to improve the garvage collection to avoid the need to return to a cell to remove things that the game didn\\'t need anymore like corpses and other clutter. (as some research I done suggest most corpses may not increase the save size -need to make some testing yet-,  they inventory and dead flag could do -in a smaller extent though-)\r\n------------------------------------------------------------------------------------------------------------------------\r\n[u][b]CREDITS:[/b][/u]\r\n\r\nThis file previous versions has been made using SkyEdit, PEX Compiler and PEX Decompiler and TesVSnip. So, thanks to Dave Humphrey (dave@uesp.net) and anyone helping him, for Skyedit, as well as OneLessName, for both PEX Compiler and PEX Decompiler and TheFigment for TesVSnip.\r\n\r\nThanks also to Xilver, for teaching me to access a script from an object in the esp using Tessnip.",
  "categoryId": "95",
  "version": "1.8",
  "author": "Amgepo",
  "createdUnix": "1324772394",
  "updatedUnix": "1329506696",
  "containsAdultContent": false,
  "uploadedBy": "amgepo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15495",
      "name": "posesivecorpsesnomorelazyzombiesshynirnroots",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "posesivecorpsesnomorelazyzombiesshynirnroots-4528.rar",
      "uploadedUnix": "1325357408",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/1623f937414f56bc58769488ba30025308e6ed97da68bc928b385b1efc2a4c9c/analysis/1406573767/",
      "changelogHtml": " Nirnroot plants will stop generating glows. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/posesivecorpsesnomorelazyzombiesshynirnroots-4528.rar?fid=15495&ttl=1535760377&ri=8192&rs=8192&setec=8b74c679ab801b6de92cde7829dab263"
    },
    {
      "fileId": "17149",
      "name": "Nirnroot as intended",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Nirnroot as intended-4528.rar",
      "uploadedUnix": "1325852502",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e8abb35a0b0c7ae06f0b6cfc0b8ddc9d3582a486a686373c8e7ca9989b39cc56/analysis/1406587337/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nirnroot%20as%20intended-4528.rar?fid=17149&ttl=1535760377&ri=8192&rs=8192&setec=412ce06e003b54344e7148e8c90c93c8"
    },
    {
      "fileId": "18759",
      "name": "No regrowing nirnroots",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "No regrowing nirnroots-4528.rar",
      "uploadedUnix": "1326252901",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ed73f583f92b984038eb1e739db93f19cb6a5479016110448b2d48ec0737d4d4/analysis/1406601938/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20regrowing%20nirnroots-4528.rar?fid=18759&ttl=1535760378&ri=8192&rs=8192&setec=00b00f0617a57bdc2a8b9f369d7e1275"
    },
    {
      "fileId": "19866",
      "name": "By By Glows",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "By By Glows-4528.rar",
      "uploadedUnix": "1326588864",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/749ea40ca848c088d1d536d1770635bec2ccbde349bf60e4fae558e3c296537f/analysis/1406611382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/By%20By%20Glows-4528.rar?fid=19866&ttl=1535760378&ri=8192&rs=8192&setec=57eb672823276d3a8b85c4cb5e9aa5d5"
    },
    {
      "fileId": "20206",
      "name": "Possessive corpses_1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Possessive corpses_1_3-4528.rar",
      "uploadedUnix": "1326674186",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/0ac5e9c67e4f38d9cb6df6d6a469c4985cffebddea492d03442264a65a7baaad/analysis/1406614447/",
      "changelogHtml": " The already created glows will be eliminated. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Possessive%20corpses_1_3-4528.rar?fid=20206&ttl=1535760379&ri=8192&rs=8192&setec=754d6f0892ad6e498e710d58a5b59508"
    },
    {
      "fileId": "20547",
      "name": "Ice wraith without ice piles",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Ice wraith without ice piles-4528.rar",
      "uploadedUnix": "1326771121",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/9b13491696b314d5005cf3d0c8d7bde95b0f056ffdb3b446e3beaec59a3322a3/analysis/1406618282/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ice%20wraith%20without%20ice%20piles-4528.rar?fid=20547&ttl=1535760380&ri=8192&rs=8192&setec=cb2a5010cdc5799b65232e59b0c7f29a"
    },
    {
      "fileId": "20549",
      "name": "Possessive corpses 1_4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10",
      "fileName": "Possessive corpses 1_4-4528.rar",
      "uploadedUnix": "1326771371",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/fce44e2aae6ac35552a84bb835414d54074bec03c3f0a27214c6ed2cd8a08d55/analysis/1406618283/",
      "changelogHtml": " the wisp core (the remain of dead wisps) will disappear on unloading their cell (no need to wait for the respawn) <br/> \n Dragon priests won\\'t leave  armor (unusable. Is a corpse that will disappear as other corpses).  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Possessive%20corpses%201_4-4528.rar?fid=20549&ttl=1535760380&ri=8192&rs=8192&setec=304adc60541ebd7a8201f1bcc8ea5b05"
    },
    {
      "fileId": "20805",
      "name": "posesivecorpses 1_5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10",
      "fileName": "posesivecorpses 1_5-4528.rar",
      "uploadedUnix": "1326858387",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/dfe6a6a0d621c6e74a9bbd2096e5d43eb2389d304606214b4d328474ed0c985f/analysis/1406620035/",
      "changelogHtml": " updated the nirnroot script, to eliminate the roots that where acumulating the same way as the glows, but becoming invisible instead. This didn\\'t eliminate the already created ones, BUT the script  eliminating the glows already created, does. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/posesivecorpses%201_5-4528.rar?fid=20805&ttl=1535760381&ri=8192&rs=8192&setec=2d0e20f3e3cc20f6daafb459f1f2b489"
    },
    {
      "fileId": "21024",
      "name": "Nirnroot as intended 1_5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Nirnroot as intended 1_5-4528.rar",
      "uploadedUnix": "1326933200",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/2d91bde898bf00a235c2ffdbf3c8af18e46360283bf3cf5bd5b891d63a4d5730/analysis/1406622182/",
      "changelogHtml": " updated the nirnroot script, to eliminate the roots that where acumulating the same way as the glows, but becoming invisible instead. This didn\\'t eliminate the already created ones, BUT the script  eliminating the glows already created, does. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nirnroot%20as%20intended%201_5-4528.rar?fid=21024&ttl=1535760381&ri=8192&rs=8192&setec=452ba6a4a855b0dc4896fc43981c2592"
    },
    {
      "fileId": "21046",
      "name": "No regrowing nirnroots 1_5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "No regrowing nirnroots 1_5-4528.rar",
      "uploadedUnix": "1326937980",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/3f7c33de34e5fb266e7a50628b86610b62e009f8b1aa5e74828724b22f0e8bb3/analysis/1406622423/",
      "changelogHtml": " updated the nirnroot script, to eliminate the roots that where acumulating the same way as the glows, but becoming invisible instead. This didn\\'t eliminate the already created ones, BUT the script  eliminating the glows already created, does. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20regrowing%20nirnroots%201_5-4528.rar?fid=21046&ttl=1535760382&ri=8192&rs=8192&setec=cc9ac41f05c7a072c534a5d392801ed2"
    },
    {
      "fileId": "21323",
      "name": "Clean ashes",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Clean ashes-4528.rar",
      "uploadedUnix": "1327025667",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/34b4978ba746d65982a6891312c3f419b3c9fe6264c7a36c292f60902d047d96/analysis/1406624706/",
      "changelogHtml": " Avoids weapons from actors killed in combat from remaining after the corpse are cleaned. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clean%20ashes-4528.rar?fid=21323&ttl=1535760383&ri=8192&rs=8192&setec=3f67434fe8d794753d1cf1d18d68d7d0"
    },
    {
      "fileId": "21631",
      "name": "test version",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "test version-4528.rar",
      "uploadedUnix": "1327118532",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a81b4d8c9f8084a024c9d5b68bbb4d6c1224bdddf70cfaa04a87ac87cd37783c/analysis/1406626812/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/test%20version-4528.rar?fid=21631&ttl=1535760383&ri=8192&rs=8192&setec=a0f7fdb9003147ac31e723cbfea48792"
    },
    {
      "fileId": "21870",
      "name": "Possessive corpses 1_6",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Possessive corpses 1_6-4528.rar",
      "uploadedUnix": "1327193518",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/a97d95787f028aed395fbd80a86ff8c2bb05692c73714d30c1f1a8b6cd57d62b/analysis/1406628678/",
      "changelogHtml": " All non-corpse remains (ash piles, ice piles, ghostly remains and wisp cores) are correctly handled. When you point your crosshair on them instead of \\\"take ash pile\\\" you will see \\\"take (ASCII characters)\\\" <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Possessive%20corpses%201_6-4528.rar?fid=21870&ttl=1535760384&ri=8192&rs=8192&setec=fe5642c0ef07dac8f648eb4e7976043e"
    },
    {
      "fileId": "22266",
      "name": "Possessive corpses 1_7",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "Possessive corpses 1_7-4528.rar",
      "uploadedUnix": "1327279966",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/5347b6573e2dfae0a4cf3ee31668830889318fb3dccb6e5ee0363896833b12c7/analysis/1406632443/",
      "changelogHtml": " This fixes the little issue with reamining names in previous version. Now when you point your crosshair on a remain like an ash pile or an ice pile, the propper name will appear.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Possessive%20corpses%201_7-4528.rar?fid=22266&ttl=1535760384&ri=8192&rs=8192&setec=509ef94c53e6f903f5785d9fc1df312b"
    },
    {
      "fileId": "22519",
      "name": "let the ashes be",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "let the ashes be-4528.rar",
      "uploadedUnix": "1327369260",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e460332833edfc663b47ee89d2b1c0f4c841bc911d5074b2df940d7667a9d09b/analysis/1406634407/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/let%20the%20ashes%20be-4528.rar?fid=22519&ttl=1535760385&ri=8192&rs=8192&setec=6dc0443f9008cbfa38fdead147213250"
    },
    {
      "fileId": "22521",
      "name": "unattached weapons",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "unattached weapons-4528.rar",
      "uploadedUnix": "1327369529",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ed999c36062c1c23a1db309f4a4c0cff3f9fcfd124af2f1da4aba6a84a0ed202/analysis/1406634408/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/unattached%20weapons-4528.rar?fid=22521&ttl=1535760385&ri=8192&rs=8192&setec=e1fb21fff6eddd71e38d97199892eb4a"
    },
    {
      "fileId": "27450",
      "name": "Update using CK and improving arrow handling",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Update using CK and improving arrow handling-4528.rar",
      "uploadedUnix": "1328750501",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d2f885a47c4740982f2f479cfc365f2955bd4de8aa672079e50154b9e3ed5e9b/analysis/1406662749/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20using%20CK%20and%20improving%20arrow%20handling-4528.rar?fid=27450&ttl=1535760386&ri=8192&rs=8192&setec=1d6b323f41015afb67eb66fb4cd90932"
    },
    {
      "fileId": "29393",
      "name": "nirnroot as intended 1_8",
      "version": "1.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "nirnroot as intended 1_8-4528.rar",
      "uploadedUnix": "1329023965",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/0f70c4bc950070474ae6b0b03ffff548c3e06ca7916d090ebed7187efd779ea7/analysis/1406672299/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/nirnroot%20as%20intended%201_8-4528.rar?fid=29393&ttl=1535760387&ri=8192&rs=8192&setec=c90deda72de462389d1308a56269f1ee"
    },
    {
      "fileId": "31427",
      "name": "Possessive Corpses 1_8",
      "version": "1.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "Possessive Corpses 1_8-4528-1-8.rar",
      "uploadedUnix": "1329292596",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/5d6dd5e5f0fe33b2079e6196d1cc7fc75ed4c187a4cf63c3361cd908344665b9/analysis/1406683748/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Possessive%20Corpses%201_8-4528-1-8.rar?fid=31427&ttl=1535760387&ri=8192&rs=8192&setec=ae848e31c2e4b5a1311338e3e3a0efa2"
    },
    {
      "fileId": "32735",
      "name": "less arrows",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "less arrows-4528-1.rar",
      "uploadedUnix": "1329506696",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2082ee483ee5d468e669555ec6ea0dc6322f5266b00ed91a2677db038cd14e33/analysis/1406690878/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/less%20arrows-4528-1.rar?fid=32735&ttl=1535760388&ri=8192&rs=8192&setec=e8216c6219b239cf43898bc692aa9d40"
    }
  ]
}