{
  "modId": 45358.0,
  "modName": "Black Argonian horns and colors - DELETED - DELETED",
  "summary": "Turns the horns, nails, and Tails spines on Argonians black.\r\n\r\nAdds aditional colors to the character creation slider",
  "descriptionHtml": "Besides black horns looking cool I have a more practical reason I did it. The current Argonian colors are kinda dull and washed out. For a reason though. I found when adding custom colors to argonians like bright reds and deep blues, the horns would change to the same color. And as cool as a red Argonian is it kinda bugged me when he would have redish pink horns all of the sudden. \r\n\r\nBecause of the way the textures and color overlays are I can\\\\\\'t make the horns white. So I made them black instead. Now if you have a mod that adds additional Argonian colors you can have one that\\\\\\'s bright neon pink without his horns following suit.\r\n\r\nObviously this won\\\\\\'t work if you already have a mod retexturing Argonians. Sorry.\r\n\r\nI included a file that adds some more colors to the Argonian slider if you want to use it. You can delete it otherwise. It adds all the colors not only to the base colors but all the other facial sliders like cheek color and such. I also may have slipped in four new Khajiit colors as well... Can\\\\\\'t help it. I love Khajiit too.",
  "categoryId": "26",
  "version": "1.0",
  "author": "KidneyFail",
  "createdUnix": "1382594788",
  "updatedUnix": "1382595368",
  "containsAdultContent": false,
  "uploadedBy": "KidneyFail",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000069985",
      "name": "Black Argonian horns and colors",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "14335",
      "fileName": "Black Argonian horns and colors-45358-1-0.zip",
      "uploadedUnix": "1382595368",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1b31d13d8972f669ae03940f28960f6930ecd72f4fc4bcec719a34ff3b151621/analysis/1407767060/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Argonian%20horns%20and%20colors-45358-1-0.zip?fid=1000069985&ttl=1535825852&ri=8192&rs=8192&setec=b791aff5eb3a87c41d38d5b944bfbbad"
    }
  ]
}