{
  "modId": 45374.0,
  "modName": "LOTR-The Nazgul and the Ring of Power",
  "summary": "If you are a Lord of the Rings fan that would love to have the Black Riders in Skyrim to fight against or even become one yourself; this mod is for you.\r\nThe Nazgul and the Ring of Power Mod; like the title says brings to the world of Skyrim the Nine Ringwraiths; the One Ring and several other features.",
  "descriptionHtml": "[img] http://static2.nexusmods.com/110/mods/110/images/45374-1-1382630202.jpg [/img]\r\n[img] http://static1.nexusmods.com/110/mods/110/images/45374-1-1382630867.jpg [/img]\r\n\r\nIf you are a Lord of the Rings fan that would love to have the Black Riders in Skyrim to fight against or even become one yourself; this mod is for you.\r\nThe Nazgul and the Ring of Power Mod; like the title says brings to the world of Skyrim the Nine Ringwraiths; the One Ring and several other features that will be described down  below.\r\n\r\n[img] http://static1.nexusmods.com/110/mods/110/images/45374-1-1382631026.jpg [/img]\r\n\r\nThe storyline for the mod is based upon the character Bilbo Baggins after the events taken place in the Hobbit and before the Fellowship of the Ring. The player will recieve a mysterious letter in his inventory and from there the player will know more about it as he continues playing. This was the most lore friendly way that i have come up with to bring the Nazgul and the Ring of Power into Skyrim.\r\n\r\n[img] http://static1.nexusmods.com/110/mods/110/images/45374-1-1382631194.jpg [/img]\r\n\r\nThe following section will describe the Nine in some detail:\r\nNazgul Race:\r\nThe Nazgul are Undead creatures skilled in Destruction; Illusion; Light Armor and One Handed Combat.\r\nThey have 50% Weakness to Fire; 25% Resistance to Magic;  100% Resistance to Poison; \r\n100%  Resistance to Disease; 50% Resistance to Frost and are immune to Paralysis.\r\nThe Nazgul have the same Stats has the Ancient Dragons; except for the Witch King that has the same Stats has Alduin.\r\nThey use a shout called Nazgul Black Breath that deals 100 points of Health Damage ; strikes Fear up to level 25 creatures in an area of 250 for 30 seconds and Paralysis for 3 seconds. \\\"Some races maybe immune to this shout\\\".\r\n\r\n[img] http://static1.nexusmods.com/110/mods/110/images/45374-1-1382631362.jpg [/img]\r\n \r\nThe Ring of Power when equipped will give the player :\r\nA Power called \\\"Wear the Ring of Power\\\":\r\nThis Power will give the player the ability to become Invisible.\r\n(Being invisible will make the Nazgul  chase the player; the time they take to get to the player will depent how far away they are from the player while he is invisible. To test this feature just wait a few hours while invisible and very soon they will appear).\r\nThe ring will also give the player +100 points of Health and Stamina; but will make Health and Stamina regenerate 50% slower.\r\n(This is the \\\"Unnatural Long Life \\\" and \\\"Burden\\\" effect that the ring gives its wearer).\r\nNote: Being invisible won\\'t mean that everybody won\\'t see you; this will also depent on your illusion and sneak levels just like in the vanilla game.\r\n\r\n[img] http://static2.nexusmods.com/110/mods/110/images/45374-1-1382631512.jpg [/img]\r\n\r\nIn The Nazgul and the Ring of Power Mod the player will be able to become a Nazgul himself:\r\nBy defeating the Nazgul the player will get all their gear that includes all the clothing; the weapons and each Nazgul has its own Ring with its own enchantment.\r\nThe player will also be able to learn the Nazgul Black Breath Shout that shares the same words of power from another vanilla shout.\r\n \r\n[img] http://static2.nexusmods.com/110/mods/110/images/45374-1-1382631691.jpg [/img]\r\n\r\nYou have three files to choose from; each one with a different type of robe for the Nazgul:(check out the picture and decide the one you want to install)\r\n[img] http://static2.nexusmods.com/110/mods/110/images/45374-1-1382633794.jpg [/img]\r\nThe Nazgul and the Ring of Power Normal Robes (adds a black version of the vanilla robes).\r\nThe Nazgul and the Ring of Power Greybeards (replaces with a black version of the robes).\r\nThe Nazgul and the Ring of Power True Nazgul Armor ( requires True Nazgul Armor Mod).\r\nInstall with NMM or Manually:\r\nNMM: Just use the Download with Manager button and go to NMM Mods section and activate it.\r\nManually: Select the Download Manually button and extract the files to your Skyrim folder.\r\n \r\n[img] http://static2.nexusmods.com/110/mods/110/images/45374-1-1382631879.jpg [/img]\r\n[img] http://static1.nexusmods.com/110/mods/110/images/45374-2-1382631879.jpg [/img]\r\nAll downloadable files Require LOTR Weapons by Isilmeriel V4: \r\nhttp://skyrim.nexusmods.com/mods/5727/?tab=2&navtag=%2Fajax%2Fmodfiles%2F%3Fid%3D5727&pUp=1\r\n[img] http://static1.nexusmods.com/110/mods/110/images/45374-1-1382633171.jpg [/img] \r\nNazgul and the Ring of Power True Nazgul Armor downloadable file requires True Nazgul Armor Mod by platyhelminthes:\r\nhttp://skyrim.nexusmods.com/mods/43753//? \r\n[img] http://static2.nexusmods.com/110/mods/110/images/45374-1-1382647648.jpg [/img] \r\nThe One Ring a LOTR mod by 514Y32 http://skyrim.nexusmods.com/mods/35920//?\r\n(This has great meshes and textures for the Ring of Power)\r\nReturn of the Witch King by LeGioN675 http://skyrim.nexusmods.com/mods/24124//?\r\n(This mod adds the Witch King Helmet to Skyrim; this is a must have for any Nazgul fan).\r\nHD PMR Retexture - Shadowmere by BingoMorris http://skyrim.nexusmods.com/mods/4124//?\r\n(This mod makes Shadowmere darker; making the Nazgul horses a perfect match to go along with the Nazgul).\r\n\r\nI\\'ve contacted this modders in order to add their work to this mod but unfortunately they didn\\'t reply.\r\nIf you know your way around the creation kit; you can add them yourself to the mod and make it even more immersive.\r\n\r\n[img] http://static1.nexusmods.com/110/mods/110/images/45374-1-1382633619.jpg [/img] \r\nUninstall with NMM or Manually:\r\n IMPORTANT: Before you uninstall the mod in any way i suggest that in game you first dismiss the follower Bilbo Baggins if you have him has a companion; and go to an interior cell like a player home; save your game and exit. Next deactivate the mod and then load your game again. In the interior cell or player home wait 15 days and then save your game.\r\nThat should make the Nazgul not to appear again in the world space.\r\nNMM: In the Mods section click on the Mod to deactivate it. This will uninstall the Mod.\r\n              If you want ot delete it click on the red cross in the column at your left  after          \r\n              uninstalling the mod.\r\nManually: First deselect the mod on the data files menu or in the Pluggins section on NMM.\r\n                     Delete (WanderingNazgulRedone.esp) folder in  \r\n                     Data/meshes/actors/character/facegendata/facegeom\r\n                     Delete (Nazgul) folder in Data/Sound/fx\r\n                     Delete (WanderingNazgulRedone.esp) folder in \r\n                     Data/textures/actors/character/facegendata/facetint\r\n                     Delete (NormalRobes) folder in Data/textures/clothes/Nazgul\r\n                     Delete these picture files \r\n (Nazgul_Frodo_Baggins.png/Nazgul_Map_of_Middle_Earth.png/Nazgul_Map_of_Skyrim.png)\r\n                     in Data/textures/interface/books\r\n                     (There are also the following Script Files:   \r\n                   (FxNazgulScript.pex/NazgulDetectLifeAndDead.pex/NazgulRingOfPower.pex)\r\n                     in Data/Scripts\r\n                    and the script source files\r\n                   (FxNazgulScript.psc/NazgulDetectLifeAndDead.psc/NazgulRingOfPower.psc)\r\n                     in Data/Scripts/Source\r\n                    I thing that there will be no problem in deleting this files beacause they are scripts \r\n                    that have to do with the Nazgul Npc\\'s and the objects of the mod and not with game \r\n                    changing scripts; but there are modder\\'s that say that deleting any scripts will be   \r\n                    harmful to the game. So i leave this desicion up to you.\r\n\r\n[img] http://static1.nexusmods.com/110/mods/110/images/45374-1-1382634060.jpg [/img] \r\nThe credits go for all the modders listed below that helped this mod become a reality:\r\nGreat thanks to Isilmeriel for one of greatest mods on the Nexus; without is cooperation this mod may have not had become a reality.\r\nMy personal thanks to platyhelminthes  for letting me include is True Nazgul Armor\r\nAlthough i haven\\'t used is work on the mod i give credit also to MadNuttah from the Rings of Tamriel Mod for being helpfull in letting me use is work on the mod.\r\nCheck out is mod at: http://skyrim.nexusmods.com/mods/2915//?\r\n\r\n[img] http://static2.nexusmods.com/110/mods/110/images/45374-2-1382634061.jpg [/img] \r\nTo use this mod in any manner you will have to ask me first; and only with my permission and  the ones of the other mod authors may you have permission to use our work.\r\n\r\n\r\n\r\n \r\n\r\n                     ",
  "categoryId": "35",
  "version": "1.0",
  "author": "Sergeynest",
  "createdUnix": "1382634442",
  "updatedUnix": "1382629166",
  "containsAdultContent": false,
  "uploadedBy": "Sergeynest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000070075",
      "name": "The Nazgul and the Ring of Power Normal Robes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11519",
      "fileName": "The Nazgul and the Ring of Power Normal Robes-45374-1-0.rar",
      "uploadedUnix": "1382625666",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e07c8216d2f7ef5b8c75d22138936afd1ccd9c16a238bafc140c70798d461f1e/analysis/1407767369/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Nazgul%20and%20the%20Ring%20of%20Power%20Normal%20Robes-45374-1-0.rar?fid=1000070075&ttl=1535825875&ri=8192&rs=8192&setec=8bfef395b36f98a12dd0594bbaaaabf7"
    },
    {
      "fileId": "1000070078",
      "name": "The Nazgul and the Ring of Power Greybeards Robes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13454",
      "fileName": "The Nazgul and the Ring of Power Greybeards Robes-45374-1-0.rar",
      "uploadedUnix": "1382625941",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4a2bf1f71b3f6510adf1e3418c8c18fd001ddef7c61c036d943287fef0bce7f0/analysis/1407767377/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Nazgul%20and%20the%20Ring%20of%20Power%20Greybeards%20Robes-45374-1-0.rar?fid=1000070078&ttl=1535825876&ri=8192&rs=8192&setec=25104e8860784868cc14d9243e2a5118"
    },
    {
      "fileId": "1000070093",
      "name": "The Nazgul and the Ring of Power True Nazgul Armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11519",
      "fileName": "The Nazgul and the Ring of Power True Nazgul Armor-45374-1-0.rar",
      "uploadedUnix": "1382629166",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/af60c976515a36c665d83cf52b3039f14c4bb44899531f0b4493949688e8dd6f/analysis/1407767410/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Nazgul%20and%20the%20Ring%20of%20Power%20True%20Nazgul%20Armor-45374-1-0.rar?fid=1000070093&ttl=1535825876&ri=8192&rs=8192&setec=8cab83f9460f5565aeb0d6dccbacc905"
    }
  ]
}