{
  "modId": 45420.0,
  "modName": "Crossbows Do Not Stagger",
  "summary": "This is a quick mod to remove the innate ability of crossbows to stagger opponents without the Power Shot perk.",
  "descriptionHtml": "This is a quick mod to remove the innate ability of crossbows to stagger opponents without the Power Shot perk. This does not affect bows as they cannot stagger without the perk anyway. This also does not affect your ability to stagger opponents with a bash while using a crossbow; you can still do that. If you take the Power Shot perk, you can use a crossbow to stagger enemies with the same chance that a bow with the Power Shot perk would.\r\n\r\nI had not seen a mod on the Nexus that accomplished this, so I ended up creating this one. I enjoy crossbows, but the ability of them to basically stunlock everything to death via staggers was about as boring as stunlocking everything to death with dualcasted Destruction spells. Thus, I created this mod to remove that effect so that crossbows behave more like bows in regards to staggering. Naturally, staggers come back with the presence of the Power Shot perk, but there are other mod solutions to that problem such as one that switches the perk locations around or using the console command to skip / remove that perk. Overall, I just wanted to release a simple mod that addressed this one and only one issue.\r\n\r\nTo accomplish this, I opened DLC1abCrossbowStagger (Crossbow Bonus) in the spells section and deleted the effect associated with it. In my testing, this has caused no issues at all in-game and functions with all the crossbows perfectly.",
  "categoryId": "77",
  "version": "1.0",
  "author": "Jinn006",
  "createdUnix": "1382649454",
  "updatedUnix": "1382648526",
  "containsAdultContent": false,
  "uploadedBy": "Jinn006",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000070199",
      "name": "Crossbows Do Not Stagger",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Crossbows Do Not Stagger-45420-1-0.zip",
      "uploadedUnix": "1382648526",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7bf63d988f8bf8bd463e2f20dfa5ff151d7ccc56bcc3cafa5a668d19f4481bd7/analysis/1407767582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Crossbows%20Do%20Not%20Stagger-45420-1-0.zip?fid=1000070199&ttl=1535825903&ri=8192&rs=8192&setec=39bddf99dfd48f1f98f80a9eef561671"
    }
  ]
}