{
  "modId": 45435.0,
  "modName": "Immersive Snow and Ice",
  "summary": "A remaster of the snow shaders on the Mountains and Rocks for a dramatic difference.\r<br />\r<br />I have a new mod called &#34;Regional Snow and Ice&#34;, which overhauls everything this mod would do, its just does a lot more and a lot better.\r<br />\r<br /> http://www.nexusmods.com/skyrim/mods/65882?fir=1 ",
  "descriptionHtml": "\r<br />[size=6]I actually have a follow up to this mod, which overhauls everything this mod would do, its just does a lot more and a lot better.\r<br />\r<br />It&#39;s called &#34;Regional Snow and Ice&#34; and can be found here -  http://www.nexusmods.com/skyrim/mods/65882[/size]\r<br />\r<br />\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/45435-2-1384837498.jpg[/img]\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/45435-1-1384845082.gif[/img]\r<br />\r<br />For those that were disappointed with the painted on look of snow for a lot of Skyrim, would have probably used &#34;Better Dynamic Snow&#34; to improve it. Immersive Snow and Ice goes a step further in a number of ways, by applying a special shader to the Snow for Mountains and Rocks, so that&#39;s its more translucent, giving it depth, reflection and refraction. Its the same shaders that are used for the glaciers of Skyrim, but this has been customized for Snow and Ice.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/45435-1-1382657841.jpg[/img]\r<br />\r<br />[img]http://static-1.nexusmods.com/15/images/110/5510600-1382659026.jpg[/img]\r<br />\r<br />This is a complete overhaul of the Mountains and Rocks that are snow-covered. This is much more than a texture re-placer.\r<br /> \r<br />This mod uses a graphics shader called &#34;Multi-layered (parallax)&#34;. Not to be confused with &#34;heightmap parallax&#34; as used by mods like &#34;Vivid Landscapes - Rocking Stones and Mountains Parallax&#34;.\r<br />It uses two layers of textures to give it a look of depth. The sub-surface is the main texture and the top layer is translucent to give the appearance of depth.\r<br /> \r<br />I was going to name the mod &#34;Realistic Snow and Ice&#34;, but this is a subjective personal choice of what is deemed more &#34;realistic&#34;. This mod assumes that you are already aware of &#34;Better Dynamic Snow&#34;. If you are not then I recommend that you use both these mods to enhance the look of Snow on surfaces. They are 100% compatible and recommend that you use in combination with Immersive Snow and Ice.\r<br />\r<br />Light has special qualities of reflecting the snow surfaces, so weather and sky lighting (sunsets, nights, sunshine, etc) play a role in the coloring and look. Because its slightly translucent, snow has close qualities to ice. If you can imagine its snow that has been melted and frozen again.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/5510600-1382659197.jpg[/img]\r<br />\r<br />Unzip and copy and paste to your Skyrim folder. Make sure the &#34;ImmersiveSnowIce.esp&#34; plugin is checked in your load order.\r<br />\r<br />This needs to be at the bottom of the load order in order for it to be priority over some other mods that effect the Mountains, like &#34;Better Dynamic Snow&#34;.\r<br />\r<br />You may also install with a mod manager, like NMM. This will work just fine, manual installation is not required.\r<br />\r<br />UNINSTALLATION\r<br />\r<br />Delete the  &#34;ImmersiveSnowIce.esp&#34; plugin in the data folder.\r<br />Delete &#34;meshes/immersive_environments&#34; folder from your data folder.\r<br />Delete &#34;textures/immersive_environments&#34; folder from your data folder.\r<br />\r<br />Or you can simple uncheck &#34;ImmersiveSnowIce.esp&#34; in your load order to switch back to your previous setup.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/5510600-1382659381.jpg[/img]\r<br />\r<br />These are all new models and textures so nothing in your current setup will be overwritten. Turning this on or off in the data files will switch between your current setup and Immersive Snow and Ice, so makes it easy to try out and simply uncheck it in your load order if you don&#39;t like the new effects.\r<br />\r<br />I tried it with a number of ENBs; RealLike ENB, E ENB, Seasons of Skyrim ENB, Project ENB, RealVision ENB.\r<br />\r<br />The best results I had for me personally was RealVision.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/5510600-1382659576.jpg[/img]\r<br />\r<br />You&#39;ll notice that rocks get stretched on some surfaces. This is a bug with the game engine itself. Better Dynamic Snow has the same problem, but rather than for the rocks it does it for the snow. Its possible why Bethesda did not use this method in the first place. I spent an enormous amount of time trying to get it to be as unnoticeable as possible, but there is little I can do to prevent it entirely.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/45435-1-1382659796.jpg[/img]\r<br />\r<br />[b]Why is this just for Mountains and Rocks?[/b]\r<br />It requires special editing of every model that will have this effect, so I have started with the models that have the most impact. Also from a technical point of view each model needs to be specifically reviewed for best looks. Its a lot more involved than just applying a blanket effect that can be used for everything. In time I&#39;ll release further editions that will cover more areas.\r<br />\r<br />[b]I really like the effect, can you add it to the snow on the ground?[/b]\r<br />No. The land textures cannot have this effect applied to them, only actual models can.\r<br />\r<br />[b]Why do the snowy mountain rocks look a bit different to the non snow-covered ones?[/b]\r<br />I have specially edited the normal (bump mapped) texture for Mountains (snow-covered) so that they are more customized for the snow.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/images/110/5510600-1382778948.jpg[/img]\r<br />\r<br />0.4.1   Removed some navigation mesh conflicts\r<br />0.4      Better snow coverage by making west and east facing Mountains so that snow scattering is more visible on most surfaces. Mountains in warmer regions have smoother snow from previous versions and the transitions between distant and near Mountains is much better. Minor fix for a missing bridge texture.\r<br />0.3      Lighter snow falls on the Mountains in warmer regions for better transitions between non-snow covered and the thicker blanketed areas of snow. Created North and South facing Mountains for better displaying of snow coverage. Tweaked the way snow settles.\r<br />(Areas marked in white have had mountains changed to lighter snow coverage to reflect warmer regions and better transitions between snow coverage on ground.)\r<br />[img]http://static-2.nexusmods.com/15/images/110/5510600-1384498764.jpg[/img]\r<br />0.2.1   Fix for missing Mountain piece\r<br />0.2      Less Snow coverage on the Mountains and Rocks and Snow is darker. Tweaked better for ENBs\r<br />0.1.1   Fix for Riverwood CTD\r<br />0.1      Beta Release\r<br />\r<br />[heading]FUTURE UPDATES[/heading]\r<br />0.5\r<br />[list]\r<br />[*]New object LOD for Skyrim, to include more impressive vistas and better transitions between near and far Mountains.\r<br />[*]Improve snow coverage on the rocks.\r<br />[/list]\r<br />0.6 and beyond\r<br />[list]\r<br />[*]New Mountain types for different regions and altitudes. Icy Rocks and Icy Snow for Northern coast and higher regions. Soft powered Snow for Southern region.\r<br />[*]General customization of Mountains and Rocks to suit surroundings with manual editing of landscape.\r<br />[*]Customized version for ENB users to maximize potential of special shaders.\r<br />[*]Further editions for other objects that have snow covering. This includes things like buildings, bridges, clutter, landscape, etc. There are over 1700 of these models that have dynamic snow covering, so editions will be released over time as it requires a lot of work.\r<br />[*]Caustic reflections for the Glaciers.\r<br />[*]Dynamic changing of Snow covering changing over the calendar months, also based on weather and region. Light Snow, Heavy Snow, Melting Snow, Melting Ice, Frozen Snow, Frozen Ice, Powdered Snow, Icy Rocks.\r<br />[/list]\r<br />\r<br />[heading]CREDITS[/heading]\r<br />\r<br />Better Rocks and Mountains - UV Tweak by Four Leaf Clover\r<br />\r<br />Tes5Edit team (shout out to Zilav for all the scripts he has done for modders)\r<br />\r<br />NifUtils team\r<br />\r<br />I&#39;d like to thank anybody who has ever made a mod. Thanks for making Skyrim so awesome.\r<br />\r<br />This is the combination of over a months work, so if you enjoy this mod please remember to endorse.",
  "categoryId": "62",
  "version": "0.4.1",
  "author": "happychappy",
  "createdUnix": "1382660501",
  "updatedUnix": "1384709828",
  "containsAdultContent": false,
  "uploadedBy": "snapmoderator",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000080117",
      "name": "Immersive Snow and Ice - Mountain and Rock Edition",
      "version": "0.4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23959",
      "fileName": "Immersive Snow and Ice - Mountain and Rock Edition-45435-0-4-1.rar",
      "uploadedUnix": "1384709828",
      "modVersion": "0.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/1a6eb58e74cd4b5a88d631e3a31519e0767db7e3ce1b0e0866bc374b62e756c7/analysis/1407796891/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Snow%20and%20Ice%20-%20Mountain%20and%20Rock%20Edition-45435-0-4-1.rar?fid=1000080117&ttl=1535825916&ri=8192&rs=8192&setec=fe1188ddb6b716711273fee57ea192e0"
    }
  ]
}