{
  "modId": 45462.0,
  "modName": "SkyRock",
  "summary": "This is a mod i have been working on for some time now. It adds the province of high rock to the game. Right now it only adds the eastern portion of high rock however i will eventually try and make the entire land. ",
  "descriptionHtml": "WHAT IT IS\r\n============================================================================================\r\nCurrently i have created about 45% of the landmass of high rock. All of the exterior landscapes are finished aside from some small tweaks and fixes i may do in the future. There are currently three cities Jehhana, Farrun, and Evermore. Jehhana currently has multiple finished interiors and even a few NPC\\'\\'s walking around. Farrun is not at all ready yet. Right now it\\'s pretty much just a bunch of farmhouses. Evermore is almost ready, it will be ready in the next update. Currently there is no LOD so things that are far away will simply fade in which can be pretty immersion breaking. \r\n\r\nWHAT IT WILL BE\r\n============================================================================================\r\nI am going to finish the entire landscape of high rock along with all of the cities. This of course is a very ambitious project and will take a very long time however i am hoping to maybe get some more people working on this. I am going to re-texture a lot of the landscape and interiors in order to make it look like a different country from skyrim. I am going to add a lot of dungeons and things to do.\r\nOnce i have finished all the landscape, dungeons and cities i will move onto making NPC\\'s and quests. I do not have much experience in this field yet so it will likely take some time for quests to start coming out. After that i may add some new weapons and armors specific to high rock. \r\n\r\nHOW LONG WILL THIS TAKE\r\n============================================================================================\r\nProbably a very long time. I am hoping to be finished the landscapes, cities, and interiors by the end of this year, quests and NPC\\'s will take longer. However i am looking for other modders to maybe join in on this project if anybody is interested. So if you want to help out contact me at game_evolver@live.com. With more people working on this it will likely go a lot faster. \r\n\r\nCREDIT\r\n============================================================================================\r\nthe music that plays when in high rock is my dad\\'s. Big thanks to him for letting me use it.\r\n\r\nBig thanks to Bethesda for making skyrim.\r\n\r\nAnd a thanks to MXO review for getting me interested enough in skyrim modding to screw my ps3, build a gaming PC, get skyrim on PC and start modding. ",
  "categoryId": "30",
  "version": "1.0",
  "author": "Sam Dowdall",
  "createdUnix": "1382682879",
  "updatedUnix": "1382682879",
  "containsAdultContent": false,
  "uploadedBy": "samd14",
  "primaryFile": null,
  "files": []
}