{
  "modId": 45505.0,
  "modName": "WIP Blacklight Still BETA - DELETED",
  "summary": "Travel to the city of Blacklight",
  "descriptionHtml": "Adds Blacklight city to Skyrim, Still beta. \r<br />\r<br />In need of a nevmasher, and someone with knowledge of creating quests and scripting.\r<br />-----------\r<br />\r<br />On the road from Raven Rock to Fort Frostmoth theres a ship heading to Raven Rock with supplies, enter it and it&#39;ll take you to Blacklight. get back the same way you entered, from the gate. planning to change that, so the player can activate a boat, rather than enter a cell.\r<br />\r<br />This mod is intended to be played after finishing the main quest and the Dragonborn dlc, therefore you shouldn&#39;t travel if you&#39;re a low level as most enemies will be tough for you to handle. you can of course try, you might survive but generally this is intended for high leveled characters.\r<br />\r<br />Its better to wait for a while before heading to Blacklight, do a small quest or wander around for bit.\r<br />\r<br />Things to do: \r<br />add more NPCs and structures\r<br />make the silt strider service available\r<br />[s]add a guide to blacklight book, similar to the ones in Morrowind.[/s] Added  \r<br />add more dialogue and quests, (see below)\r<br />add a boat near windhelm, fort frostmoth, and a carriage near the Dunmeth pass in windhelm. as well as adding map markers for faster teleport.\r<br />\r<br />For now this mod is not voiced, all voices are vanilla, some characters have dialogues that you can expand but its all written without voice recording.\r<br />\r<br />by minor quests i mean quests with no log, you may find a note, an item that tells you about something and you can go discover it. but the quest wont be added to your journal.\r<br />\r<br />Concerning the lore: im very strict when it comes to lore related stuff, so i tried to stay as much as i can away from the current events. in any case the gab Bethesda leaves between each game is an advantage. either ways lore discussions are welcome in the comments section so if you feel like something isnt very lore friendly or you feel like something should be added, post it up.\r<br />\r<br />Requires the Dragonborn and Hearthfire & Dawnguard DLC.\r<br />\r<br />This is still work in progress, and im adding new cells and new stuff each day. as of now its a big city with NPCs and buildings in it but with not quests yet, im also still struggling to find proper redoran buildings, the things in Dragonborn were only meant for one small island. so if anyone has made custom made ones, and would like to share them please contact me.\r<br />\r<br />The reason i put this here is so people can test it and tell me if they want a mod like that finished, so i can keep working on it. a feedback would be appreciated.\r<br />\r<br />What this mod contains:\r<br />-Half finished city, bigger than solitude and windhelm combined. \r<br />-New items/spells from the vanilla and dlc that were set to unplayable state are now accessible. \r<br />-New npcs, merchants, enemies etc..\r<br />\r<br />Permissions:\r<br />Improve it, test it, stare at it, Do whatever the heck you want with it.\r<br />\r<br />Credits:\r<br />Link815 for the extra Bonemold armor versions.",
  "categoryId": "30",
  "version": "1.0",
  "author": "Overkill55",
  "createdUnix": "1382847334",
  "updatedUnix": "1406824316",
  "containsAdultContent": false,
  "uploadedBy": "Overkill55",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120046",
      "name": "Blacklight BETA 1",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "15332",
      "fileName": "Blacklight BETA 1-45505-1-0.rar",
      "uploadedUnix": "1406824316",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/474909210514e64cb5e213f67fc8121330753b759a9a729a1cc9536da1dc6f66/analysis/1406824358/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blacklight%20BETA%201-45505-1-0.rar?fid=1000120046&ttl=1535825974&ri=8192&rs=8192&setec=052056763a1be72cc46fde5409c066db"
    }
  ]
}