{
  "modId": 45509.0,
  "modName": "Garrett Thief Armor",
  "summary": "This mod adds a new craftable armor (male-only) inspired by the protagonist of the Thief series, Garrett. A retexture of protese's Hunter Archer armor.",
  "descriptionHtml": "[img]http://i.imgur.com/fLi6d4y.jpg[/img]\r\n\r\nIf you're as die-hard a fan of the Thief series as I am, you've played as a Garrett-inspired character in TES since the old days. You've probably spent enough time trying to retcon the One-Eyed Thief into the Elder Scrolls universe, but in the back of your mind, you know he wouldn't be caught dead in a set of taffin' Thieves Guild armor. Well, lament no more, foul heathens, thine prayers to the Master Builder hath been answered!\r\n\r\nGarrett's Thief Armor is a standalone, craftable armor set, retextured with permission from protese's excellent Hunter Archer armor ([url=http://skyrim.nexusmods.com/mods/43649/]http://skyrim.nexusmods.com/mods/43649/[/url]), that will give your [male-only, sorry ladies] character the look and feel of a master thief. The stats are based on Linwe's Armor (the only remotely acceptable Vanilla armor for his sneaksiest), providing ample protection without turning a nimble thief into an overprotected tank. This armor's look and feel is closest to that of the titular \"Thief\" in the free-to-play standalone Doom 3 mod known as The Dark Mod (check it out if you haven't yet!), if possible, I hope to add more variations inspired by the original games.\r\n\r\n[img]http://i.imgur.com/MjtQHqS.jpg[/img]\r\nScreenshot courtesy of Portalcube\r\n\r\n[img]http://i.imgur.com/tzdq0xa.jpg[/img]\r\n[list][+] All black everything! Balanced brightness, sharp 2K textures, not too dark (ENB-permitting), yet drinks the shadows!\r\n[+] New from-scratch chain mail optimized from the original Hunter Archer armor!\r\n[+] Garrett's Thief Glyph Bracers are carved with authentic Glyphs from the Thief series!\r\n[+] More leather wraps above and below the arm, for added sneaksies![/list]\r\n\r\n[i]New Features in v0.11:[/i]\r\n[+] Leather armor variants that can be mixed and matched!\r\n[+] Garrett's Thief Bracers are now glyph-free, there is now a separate pair of Glyph Bracers!\r\n\r\n[img]http://i.imgur.com/gx5qB3u.jpg[/img]\r\n[+] Garrett's Thief Boots\r\n[+] Garrett's Thief Cuirass (Chain Mail under Linen Tunic)\r\n[+] Garrett's Thief Bracers (glyphs removed in v0.11)\r\n[+] Garrett's Thief Hood\r\n\r\n[i]Armor PIeces Added in v0.11:[/i]\r\n[+] Garrett's Thief Leathers (Leather Armor under Linen Tunic)\r\n[+] Garrett's Thief Leather Cuirass (Leather Armor under Leather Tunic)\r\n[+] Garrett's Thief Mail (Chain Mail under Leather Tunic)\r\n[+] Garrett's Thief Leather Hood\r\n[+] Garrett's Thief Glyph Bracers (has double-backstab enchantment)\r\n\r\n\r\n[img]http://i.imgur.com/exccHbL.jpg[/img]\r\n[center][youtube]zVtqEHUm_UQ[/youtube] [youtube]kVdAYWOPVNY[/youtube] [youtube]yPx9Y9QIWCU[/youtube][/center]\r\n[img]http://i.imgur.com/qTh1MQy.jpg[/img]\r\nScreenshot courtesy of JJUSA12\r\n\r\n[img]http://i.imgur.com/IngwxBQ.jpg[/img]\r\n1.) This armor set is craftable at any forge, under the \"Leather\" category. The cuirass and hood require a few special miscellaneous items (linen wraps and lockpicks).\r\n\r\n2.) You can find a set of this armor in the Ratway beneath Riften, in the small dead-end alcove next to that sweet room with the battleaxe on the chopping block and the green vines.\r\n\r\n3.) Open your console and type \"help garrett\" then use \"player.addItem XXXXXXXX 1\" to add each piece to your inventory, where XXXXXXXX is the item's ID from the help results.\r\n\r\n[img]http://i.imgur.com/uHC6Uhb.jpg[/img]\r\nBandolier - Bags and Pouches - [url=http://skyrim.nexusmods.com/mods/16438/]http://skyrim.nexusmods.com/mods/16438/[/url]\r\n\r\nBosmer Armor (for the capes)- [url=http://skyrim.nexusmods.com/mods/37289/]http://skyrim.nexusmods.com/mods/37289/[/url]\r\n\r\nBlackjack - A Thief Weapon - [url=http://skyrim.nexusmods.com/mods/33034/]http://skyrim.nexusmods.com/mods/33034/[/url]\r\n\r\nWater Arrows - [url=http://skyrim.nexusmods.com/mods/12555/]http://skyrim.nexusmods.com/mods/12555/[/url]\r\n\r\n[img]http://i.imgur.com/Cmh7VZe.jpg[/img]\r\nI have a few plans I might explore, which can help expand the Thief universe into that of Skyrim:\r\n\r\n[+] A follower NPC with Garrett's armor [s]and the voice of Stephen Russell[/s] - turns there aren't any voices from Stephen Russell for followers which is a senseless tragedy. [s]There will be a drunken-voiced Garrett follower, however, in the next update[/s]. I've managed to locate some authentic voice samples which I am actively working on incorporating!\r\n\r\n[+] I plan to release a separate version for SkyRe users that re-classifies the Armor Type as Glass (instead of the current Leather type), but want to include it in the v0.12 release.\r\n\r\n[+] A female version of this armor is largely dependent on protese releasing a female version of his Hunter Armor, which this mod is a retexture of. Either that or me learning how to model, which for the last 12 years I've mostly avoided! If only there were more hours in the day...like 60 more and I'd be fine.\r\n\r\n[+] Adding some of the sentient artifacts from T3DS - the Builder's Chalice, the Jacknall's Paw, the Eye, the Burrick's Heart Ruby, etc.\r\n\r\n[+] Present a Mechanist-like faction as an offshoot of the Vigilant of Stendarr, who take great interest in Dwemer technology, which harnesses soul-energy, for some dastardly purpose.\r\n\r\n[+] Thief Mechanical Eye texture -- a very simple mod that adds Garrett's golden/green \"Mechanical Eye\" to the Char Gen screen...would be cool if it could zoom in and everything, huh?\r\n\r\nIf you know of other armor models that with author permission could be re-textured for the G-man, please feel free to suggest in the comments.\r\n\r\n[img]http://i.imgur.com/u85VYrK.jpg[/img]\r\nThis is my first release for Skyrim, it was the one I was born to do...I appreciate your feedback, suggestions, and endorsements! \r\n\r\nMy laptop setup is not ideal for taking screenshots, so please-- if you have a sweet, souped-up rig, please take some screens of Garrett's Thief Armor in-action and share them here!\r\n\r\nThanks and happy thieving!\r\n\r\n[img]http://i.imgur.com/SerFvuy.jpg[/img]\r\n\r\nNMM Installation:\r\n\r\n1. Click the Download (NMM) Button\r\n2. ???\r\n3. Profit\r\n\r\nManual Installation:\r\n\r\n1. Extract file\r\n2. Copy content of the file in your SkyrimData folder, matching the folder structure\r\n3. Open the Skyrim launcher and check the GarrettThiefArmor.esp section Data Files\r\n\r\nManual Uninstallation:\r\n\r\n1. Uncheck the plugin .esp\r\n2. Delete all the files that came with the mod (you can use the original .zip for reference if you downloaded manually)\r\n\r\n[b]Requirements:[/b]\r\nNone!\r\n\r\n[img]http://i.imgur.com/e3dBD2m.jpg[/img]\r\n\r\nThank you to protese for permission to retexture his Hunter Archer armor, and for guidance in making this a standalone release.\r\n\r\nThank you to whoever wrote the Nexus Wiki tutorial articles showing me how to make this mod!\r\n\r\nCredit for the Thief Glyphs used on this page and on Garrett's Thief Bracers goes to DeviantArt user ForestGirl\r\n\r\nThank you to L0rd0fWar for allowing protese use of its port Witcher and CaBaL120 for allowing use one of their textures in his original release.\r\n\r\nThanks to Bethesda, Looking Glass, Ion Storm, Eidos, and the TDM mod team for the amazing games!",
  "categoryId": "54",
  "version": "0.11",
  "author": "h34dup",
  "createdUnix": "1382745075",
  "updatedUnix": "1382926945",
  "containsAdultContent": false,
  "uploadedBy": "h34dup",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000070644",
      "name": "Garrett Thief Armor v010",
      "version": "0.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16777",
      "fileName": "Garrett Thief Armor-45509-0-10.rar",
      "uploadedUnix": "1382745062",
      "modVersion": "0.10",
      "virusScanUrl": "https://www.virustotal.com/file/5edd8dd3c91985c37ebf0b1b9679341252ab2ee821cba90b2cd0367ab729d983/analysis/1407768813/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Garrett%20Thief%20Armor-45509-0-10.rar?fid=1000070644&ttl=1535825977&ri=8192&rs=8192&setec=2898feb9a48bb43ba132f6271e24633d"
    },
    {
      "fileId": "1000071655",
      "name": "Garrett Thief Armor v011",
      "version": "0.11",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27026",
      "fileName": "Garrett Thief Armor v011-45509-0-11.rar",
      "uploadedUnix": "1382926945",
      "modVersion": "0.11",
      "virusScanUrl": "https://www.virustotal.com/file/19d5005998898db1a9cb9b7a77dd1d445b1ac8c53e57d4b353606a75785aa960/analysis/1407772343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Garrett%20Thief%20Armor%20v011-45509-0-11.rar?fid=1000071655&ttl=1535825978&ri=8192&rs=8192&setec=3fd6913d7dcd6d0291a4e091430731bd"
    }
  ]
}