{
  "modId": 45514.0,
  "modName": "Auriels Crossbow concept",
  "summary": "A concept idea of Auriel\\'s crossbow, modders resource.",
  "descriptionHtml": "     After seeing Auriel\\'\\'s bow and how elegant it looked and because of my love of crossbows i thought i should attempt to make Auriel\\'s bow into a crossbow. Unfortunatly i am a terrible texturer so i am releasing this as a modders resource. Some of the original texturing should be intact, however it may be require to be unwrapped and re-textured. I also took the liberty of making a version of the bow being flexed for any who is interested. Being that this is a weapon made by a god, it would stand to reason that it doesn\\'t work exactly like a mortal weapon would. The placement of the charging handle and other mechanisms, and general size are based on the standard Dawnguard crossbow. The files and animations used for the Dawnguard crossbow would probably be best when using this file. The models  are formatted for .obj and .3ds.\r\n\r\n Part of the model has been modified for the bolt to go into and there is an additional peice, a cylinder for the charging handle to pivot on, other than that the bow is made entirely out of the original Auriel\\'\\'s bow mesh.\r\n\r\nI please ask anyone who downloads this and makes it into a proper mod please send me a link. :)\r\n\r\n\r\nCredits\r\nBethesda for the original design of Auriel\\'s bow.\r\n\r\nI only take credit for turning it into a crossbow concept.",
  "categoryId": "82",
  "version": "1.0",
  "author": "U653748",
  "createdUnix": "1382753454",
  "updatedUnix": "1382752946",
  "containsAdultContent": false,
  "uploadedBy": "U653748",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000070659",
      "name": "Auriels crossbow",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "677",
      "fileName": "Auriels crossbow-45514-1-0.rar",
      "uploadedUnix": "1382752946",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2d249787ee3c644e518aec2a460fdda2ef1e7be6f39d9786b9eca1a9b2650f7d/analysis/1407768843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Auriels%20crossbow-45514-1-0.rar?fid=1000070659&ttl=1535825982&ri=8192&rs=8192&setec=22a162e5e60da4c581e12c271cbeea61"
    }
  ]
}