{
  "modId": 45530.0,
  "modName": "Daughter of war",
  "summary": "new armor for the female characters.\r\nCompactible with all body replacers.\r\n",
  "descriptionHtml": "new armor for the female characters.\r\nCompactible with all body replacers.\r\nAs always: the all new and highly detailed models.\r\n\r\nadditional mod: http://skyrim.nexusmods.com/mods/45662//?\r\n\r\nversion 1.01:\r\nadded one more variant light armor, without pauldrons\r\nnew optional meshes \"armor without swastika\"\r\nnew optional meshes \"more larger boots\" for those who think that boots have a small size\r\ncorrectly gauntlets enhanted perk\r\n\r\nvideo by Slothability \r\n[youtube]ZHe20cQ3Zek[/youtube]\r\n\r\nHow to play:\r\nCan be found in the forge in the Miscellaneous section.\r\nor near Whiterun, under the bridge near Honningbrew Mediary\r\n\r\nOptional files:\r\n\r\n -optional esp - for those who think that heavy armor is more beautiful than light armor.\r\noptional file is a compromise - light and heavy do not have differences, but Light and Heavy armor have two variants for your choice.\r\n\r\n -optional textures: recommended for easy and medium PC, and for those who have problems.\r\nquality is not reduced. there is only the normal map for the metal in the size 1024. tested on medium PC without ENB. problems not found.\r\n\r\ninstallation:\r\nopen the archive and copy the folder \"date\" in the game folder \"Skyrim\"\r\noptional textures: copy the folder \"optional textures\" into game folder \"data\"\r\noptional esp: copy the file \"Daughter of war.esp\" into game folder \"data\"\r\n\r\nCredit and Thanks:\r\nBethezda Softworks\r\n3DStudioMax\r\nAdobe Photoshop\r\n\r\n\r\n[color=#ffd700][b]A direct note from the owner of the Nexus sites on the use of the Swastika in this mod[/b]\r\nThis mod has caused some controversy among users due to its use of a swastika on one of the shoulder pads. It's sparked several debates on the subject, and despite considering myself a WW2 buff who's done extensive travelling through France, Belgium, Germany, Italy, The Netherlands and Poland to visit battlegrounds, museums and locations where atrocities were committed (including Auschwitz), it has caused me to do some further reading on the subject where I've learnt some new things.\r\n\r\nThe inherent problem is thus; due to a lack of education and understanding in the matter people are looking at the swastika in the mod and immediately concluding that it is a Nazi symbol. Let me lay this to rest right now: the swastika used in this mod is NOT the same as the swastika the Nazi's used. In case you didn't know the swastika symbol has been used, literally, for thousands of years. The earliest record of it's use dates back as far as 10,000 BC, so over 12,000 years ago. The Nazi's used a variation of it just under 100 years ago. To this day the swastika is still used in many cultures, especially in India.\r\n\r\nAfter having personal conversations with the author of this mod on the topic he was even kind enough to present me with a chart showing some of the widely used swastika symbols, which you can [url=http://static1.nexusmods.com/110/images/110/1-1383137163.jpg]see here[/url], which clearly marks out the swastika he has used and the swastika that the Nazi's used. You can easily see the difference between the two.\r\n\r\nBefore the Nexus staff stepped in on this matter some of the uneducated and intolerant posts that people made were, frankly, appalling. You people, and you know who you are, should be utterly ashamed of yourselves. That stops now. I choose to allow this mod to remain on these sites because I think educating people on this symbology is more important than burying our heads in the sand and wiping our hands clean of a situation that has caused some drama. The Nazis made their own version of the swastika, tainting the original swastika in the process. They stood for censorship, intolerance and hatred. The very things some of the comments on this file page exuded in abundance against this mod. The swastika in this mod is NOT THAT SWASTIKA.\r\n\r\nNow, you can choose to remain ignorant to the facts and attempt to claim this supports Nazism. You'll be wrong. If you continue to spread your hatred in this file's comments, or on this network of sites then you will be shown the door. You have been warned.[/color]",
  "categoryId": "54",
  "version": "1.01",
  "author": "Severus616",
  "createdUnix": "1382772434",
  "updatedUnix": "1383139472",
  "containsAdultContent": false,
  "uploadedBy": "Severus616",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000072675",
      "name": "Daughter of W",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53626",
      "fileName": "Daughter of W-45530-1-01.rar",
      "uploadedUnix": "1383139472",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/f33315c6537128823474fc829083ddaf48b366dee9c1faa6a84c0bc12d468e83/analysis/1407775035/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daughter%20of%20W-45530-1-01.rar?fid=1000072675&ttl=1535825998&ri=8192&rs=8192&setec=4d2d2c2b981831595bccdac667288f3b"
    }
  ]
}