{
  "modId": 45532.0,
  "modName": "Forest of Silence - Draculas Castle Player Home And Quest",
  "summary": "Remake of the Castle from Castlevania 64. Epic battles to Earn your home + New follower!",
  "descriptionHtml": "[Center][IMG]http://imageshack.us/a/img196/2503/nesm.jpg[/IMG]\r\n\r\n[I]What is a man? A miserable little pile of secrets![/I]\r\n-Dracula\r\n\r\n[IMG]http://imageshack.us/a/img545/8817/55si.jpg[/IMG][/Center]\r\n\r\nParts of the Description with a * by them are MUST READ parts. DO NOT EVEN DOWNLOAD this mod without reading them!\r\n\r\n1. Description*\r\n2. Home Details*\r\n3. Requirements*\r\n4. Highly Suggested Mods\r\n5. Story\r\n6. Friends\r\n7. Enemies\r\n8. Hints\r\n9. Known Issues*\r\n10. Explanation to CV64 Fans\r\n11. Credits\r\n12. Changelog\r\n\r\n[Center][IMG]http://imageshack.us/a/img194/7387/5bx8.jpg[/IMG][/Center]\r\n\r\nThis is initially a remade of the Nintendo 64 Game, Castlevania. The quest is unmarked. There actually isnt a quest, but you will need to find keys, clear out the enemies (or risk getting attacked by them randomly), and progress to a final boss battle to fully unlock the entire castle. \r\n\r\nTo get to the Forest of Silence and begin your quest, go to the Hall of the Dead in Whiterun and find the 2 teleport spells. They are near the door, not hard to find, but if for some reason, you cant find them, search through the pictures and youll find a screenshot of them. Be sure to get BOTH of them, as without the Teleport to Skyrim spell, you will not be able to return to Skyrim without console commands. The Teleport to Skyrim spell places you right at the big tree in the center of Whiterun, so it could be useful outside of this mod as well.\r\n\r\nUpon defeating Dracula, you will find behind his coffin is a room that has teleport spells that will be very useful as the Castle is separated by quite a few load doors, so getting from the Forest of Silence to the final room after you clear the castle, could be a bit unenjoyable.\r\n\r\nI have broken some of the rules Ive learned to make this more like the Castlevania game. Long story short, dont go get a drink or take a piss during loading screens, you wont like the result.\r\n\r\nIn all, this is an epicly HUGE mod! The castle has 14 areas:\r\n1. The Forest of Silence\r\n2. Villa (Outside)\r\n3. Villa (Interior)\r\n4. Villa 2\r\n5. The Hedge Maze\r\n6. Crypt\r\n7. Tunnel\r\n8. Castle Center\r\n9. Castle Center 2\r\n10. Duel Towers\r\n11. Deaths Tower\r\n12. Deaths World\r\n13. Castle Keep\r\n14. Throne Room\r\n\r\nEach area has enemies to fight. They will NOT respawn so that you may easily live in your new home (except the Forest of Silence Monsters. They will Respawn). \r\n\r\n[Center][IMG]http://imageshack.us/a/img69/2946/bvig.jpg[/IMG][/Center]\r\n\r\nLike I said in the description, the home is EPIC in size. 14 Areas. However, not all of them are up to living in. Here are the living areas and their details:\r\n\r\nVilla Interior - 3 mannequins 3 display cases\r\nVilla Interior 2 - 8 mannequins 10 display cases Renon the Demon Merchant full forge alchemy and enchanting stations\r\ncrypt - 2 mannequins\r\ncastle center - 14 mannequins 10 display cases 4 vampire cattle\r\ncastle center 2 - dragon priests busts, 7 mannequins 1 display case\r\nDeath\\'s Tower - 10 Mannequins\r\nThrone Room - 6 mannequins, 2 display cases 2 vampire cattle\r\n\r\nThe throne room also has all 3 Elder Scrolls, but they are static. I had meant for it to be a display area, so once you obtain the scrolls you could place them onto the stands, but I was unable to do so with my limited scripting knowledge, and just placed static models into the Throne Room.\r\n\r\n[Center][IMG]http://imageshack.us/a/img69/5480/o477.jpg[/IMG][/Center]\r\n\r\nSkyrim V1.9.32\r\nDawngaurd\r\n[url=http://skyrim.nexusmods.com/mods/10168//?]ApachiiSkyHair[/url]\r\n[url=http://skyrim.nexusmods.com/mods/10168//?]ApachiiSkyHairMales[/url]\r\n[URL=http://skyrim.nexusmods.com/mods/5577/?]Asharas Romantic Outfit[/URL]\r\n\r\n[Center][IMG]http://imageshack.us/a/img594/2299/7yiw.jpg[/IMG][/Center]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/39765/?]No Ugly Vampires Tutorial[/url]\r\n[url=http://skyrim.nexusmods.com/mods/21689/?]Bat Travel Vampire[/url]\r\n[url=http://skyrim.nexusmods.com/mods/23890/?]True Death - A Vampire Slaying Mod[/url]\r\n\r\n[Center][IMG]http://imageshack.us/a/img43/415/9ney.jpg[/IMG][/Center]\r\n\r\nWhen I was a kid, I played Castlevania 64 on the back-then new Nintendo 64. It was probably one of my favorites. I loved the puzzles, the monsters, the blood, the killing, and back then, those were some nice graphics. Later on, I played Castlevania: Legacy of Darkness, which takes places 8 years before the original 64 game. It was pretty much the same game with updated graphics, a new character, and a slightly different story.\r\n\r\nIn Legacy of Darkness, Dracula is the end. The final boss. After beating him once, he transforms into a gargoyle thing and you have to kill him again. In the original, the boss is similar. The first form fight is the same, but there isnt a second form. And he isnt Dracula. Hes Gilles De Rais disguised as Dracula, and Malus is Draculas reincarnation.\r\n\r\nSo I took a mix of both games, slapped them together and made a mod for Skyrim!\r\n\r\n[Center][IMG]http://imageshack.us/a/img853/1060/559q.jpg[/IMG][/Center]\r\n\r\nThere are currently only 3 friendly characters in my mod. I may eventually add more, but for now, this is it!\r\n\r\n[IMG]http://imageshack.us/a/img22/2582/6jdn.jpg[/IMG]\r\nAlucard is the son of Dracula. (His name is even Dracula spelled backwards!) His mother is a human woman, and the gentleness of his human sides drives him to hate his father, and work to destroy him. He is a fierce vampire warrior and will aid the player in hopes of the player defeating his father.\r\n\r\nNotes: I seem to have messed up on navmeshing somewhere or another, and Alucard disappeared during testing, at least I think its because of my navmesh. I have had similar problems happen in the vanilla game, so it might simply be a problem from another mod. He should follow you through the teleports, so he can aid you in Skyrim as well.\r\n\r\n[IMG]http://imageshack.us/a/img826/8233/n24v.jpg[/IMG]\r\nRosa is a vampire with a kind-side. She tends to the roses in the Villa, and it is all she cares to do (for now). She will not speak to the player, but she will not attempt to harm him either.\r\n\r\n[IMG]http://imageshack.us/a/img32/7166/ae81.jpg[/IMG]\r\nRenon the Demon Merchant. He sells high-powered gear to help you in your adventures as well as potions. Dont worry, he wont turn into his demon form and attempt to take your soul to the devil if you spend over 30,000 gold this time. Thats a Castlevania exclusive.\r\n\r\n[Center][IMG]http://imageshack.us/a/img855/4845/6pt5.jpg[/IMG][/Center]\r\n\r\n[IMG]http://imageshack.us/a/img15/610/xi15.jpg[/IMG]\r\nThe King of the night. Some say the Devil himself. Dracula is the leader of this dark, evil land. His power is greater than Skyrim has ever seen. If you want his castle for your own, you must defeat him. (And it might just take Renons entire stock!)\r\n\r\n[IMG]http://imageshack.us/a/img22/7736/rkwa.jpg[/IMG]\r\nDraculas close friend and second in command. He has his own minions and own master plans. A dangerous foe. He controls much from behind the scenes.\r\n\r\n[IMG]http://imageshack.us/a/img716/8564/o8td.jpg[/IMG]\r\nIf Death would be called Draculas right hand, this evil witch would have to be his left. Nearly as powerful as Death, she is capable of paralyzing her foes while she viciously attacks them.\r\n\r\n[IMG]http://imageshack.us/a/img849/7566/6c32.jpg[/IMG]\r\nBalthazar the Dark is a high ranking Demon general. He is said to be the General of Draculas army and controller of everything evil. A tough tank in thick armor, though his attacks lack punch, his defense is nearly unbreakable.\r\n\r\n[IMG]http://imageshack.us/a/img401/9785/z6pl.jpg[/IMG]\r\nThe top Vampire in Draculas army. He was once a living man accused of killing HUNDREDS of young children near his castle. Gilles is ruthless, angry, and a foe to be feared.\r\n\r\n[IMG]http://imageshack.us/a/img826/5053/6onr.jpg[/IMG]\r\nCarmilla is Gilles\\' female rival. She is rumored to be much more powerful than he is, but with much less brain-power. Gilles and Carmilla often face off to prove themselves better than the other to their Dark Master.\r\n\r\n[IMG]http://imageshack.us/a/img534/3143/7fuo.jpg[/IMG]\r\nCarmillas daughter, they are never seen apart from each other. She is not Carmillas biological daughter, but she calls her her mother and was turned into the powerful Vampiric entity by Carmilla.\r\n\r\n[IMG]http://imageshack.us/a/img189/5191/o1z5.jpg[/IMG]\r\nBehemoth the Mammoth Bull Demon. He is greatly powerful and thick skinned. His only weakness is the brain of a bull without much thinking at all. Despite his great power, he is seen as a lower follower of Dracula, as he cannot even speak.\r\n\r\n[IMG]http://imageshack.us/a/img820/8461/llwg.jpg[/IMG]\r\nThe Frankenstein Gardener is back, and just as invincible as ever! He stalks through the hedge maze, watching after the plants. He is built from the parts of different Nord men to form the giant of a man. He is lifeless, and thus cannot be killed. The ideal approach is to run away.\r\n\r\n[IMG]http://imageshack.us/a/img856/8539/f82n.jpg[/IMG]\r\nVampire Knights are the higher ups in the Dark Army. They are not powerful enough to be known by name, but are still greatly powerful beings. They often gather in groups of two.\r\n\r\n[IMG]http://imageshack.us/a/img600/4117/kbiv.jpg[/IMG]\r\nThe being simply known as Vampires are the lowest of Draculas cursed soldiers. They follow the orders of the upper-vamps blindly, but are still far more powerful than the normal Vampires of Skyrim.\r\n\r\n[IMG]http://imageshack.us/a/img132/60/m30n.jpg[/IMG]\r\nThe man-beasts. They can sniff out intruders and dispose of light threats easily with their great physical prowess and agility.\r\n\r\n[IMG]http://imageshack.us/a/img703/4161/vnc3.jpg[/IMG]\r\nWeretigers are usually weaker than Werewolves, but faster and smarter. They are equally as dangerous and should be approached with caution.\r\n\r\n[IMG]http://imageshack.us/a/img6/6956/l08m.jpg[/IMG]\r\nLizardmen are known to be weak and smelly. They are among the weakest of Draculas servants, but usually gather in large groups in order to take down their foes.\r\n\r\n[IMG]http://imageshack.us/a/img405/112/24ew.jpg[/IMG]\r\nHellhounds are weak, but loyal to their Vampiric masters. They attack anything their masters would.\r\n\r\n[Center][IMG]http://imageshack.us/a/img571/3382/atfw.jpg[/IMG][/Center]\r\nAll keys required for doors are carried by enemies. If you havent found a required key, you may not have defeated all of the enemies in the area, or forgot to search them.\r\n\r\nThere is no map in order to make this quest harder. But I can see how the hedge maze should be an exception. If you want to cheat, or just cant figure it out, look up a map of the Castlevania 64 Hedge Maze. They are identical. The required keys are all found in the Top-Left most area.\r\n\r\nThe enemies in this mod are OVERPOWERED. You will need A LOT of potions and high level gear to defeat them. Or try sneaking.\r\n\r\nIt is often best to avoid the strongest attacker and quickly dispose of the weaker ones to lessen the DPS on yourself when you fight the strongest ones in the same area.\r\n\r\nLearn to use a shield. They are very helpful.\r\n\r\nI wasnt kidding when I said the Gardener was invincible, so dont even waste the time.\r\n\r\n[Center][IMG]http://imageshack.us/a/img818/2117/k12c.jpg[/IMG][/Center]\r\n\r\nThe female Vampire Knights bodies do not match their face color. I know very little about character creation aside from the basics. It isnt my area of expertise, so I cant fix this.\r\n\r\nThere are seams here and there that got over-looked. Just ignore them.\r\n\r\nThe Gardeners face is skin-colored while his body is a green-frankenstein color. See the issue about Vampire bodies to know why this is so.\r\n\r\nSometimes the Hell Hounds in the Villa exterior do not move. I dont know why. Same goes for the Ghosts.\r\n\r\nSometimes the Skeletons in the Forest of Silence will kill the Weretiger at the gate, this I could fix, but it isnt a big enough issue for me to put in the extra time, sorry.\r\n\r\nThe Hedge Maze is HUGE, so lower-end computers might lag a little bit during the maze, but dont worry, you only have to do it once. After you get through the maze you wont need to return and after defeating Dracula you will obtain teleport spells to allow you to bypass it all together.\r\n\r\n[Center][IMG]http://imageshack.us/a/img7/7751/9hnk.jpg[/IMG][/Center]\r\n\r\nIm sure some of you, or possibly all of you who are downloading this, have played the game I based it on. And Im sure your thinking to yourself this doenst look right at all, nothing looks like it did in the real game! Well, I feel I should explain that to you.\r\n\r\nFirstly, I am absolutely not a modeler or texturer. I cant do any of that stuff, never even tried it, so I had to use things from vanilla, or that I found here on the Nexus. As for the elevators, I do realize there are Dwemer ones I could have used, but Ive never messed with those, not sure how the activators or anything works, didnt want to bother with it, so I left them out.\r\n\r\nThe tunnel level, with what skyrim provides, is completely impossible to recreate. If a small, short tunnel filled with spiders isnt good enough for you, make it yourself. (Yeah, I didn\\'t think so.)\r\n\r\nThe Duel towers had a lot of obstacles in the CV game, and that is pointless in Skyrim. You cant jump and hold onto a ledge in Skyrim, so I thought the level was pointless except for the 4 minibosses. And again with not knowing how to model or texture things, I couldnt really create a werehorse or werecow, whatever the thing was, so instead, you got 2 werewolves instead of 1.\r\n\r\nI also took out the tower of execution all together, as it was nothing but obstacles. And Ive honestly never played through the game with Carrie, so I didnt create her levels, or the extra level Cornell has in the Legacy of Darkness, so consider this a Reinhardt play through.\r\n\r\nI personally find this mod a great success, much larger, more complex and possibly funner than anything Ive created in the past. Other mods Ive created I didnt play through the quest, as by the time I had created it, tested it and got it uploaded on here, I was sick of it and didnt even install them back into my game, however, this one is installed and is going to be played while it uploads onto here. :P\r\n\r\n[Center][IMG]http://imageshack.us/a/img35/7097/4zfp.jpg[/IMG][/Center]\r\n\r\nThis mod wouldnt have been possible without the other great modders on this website. The mods I used I have put as non-playable. So you cant obtain any of the gear from me, you have to get the original mod. I know this may be inconvenient to some people, but it helps the original modders get the download count they deserve! Here are the mods, modders and a link to the mods in no particular order!\r\n\r\nBethesda for creating skyrim & the creation kit\r\nKonami for creating Castlevania\r\nMathanas for Gilles De Rais outfit: [URL=http://skyrim.nexusmods.com/mods/11986/?]Butler Uniform[/URL]\r\nLordKarnak for Alucards Outfit: [URL=http://skyrim.nexusmods.com/mods/23633/?]Alucard Clothes[/URL]\r\nSydneyB for the Male Vampire Outfit & Roses Outfit: [URL=http://skyrim.nexusmods.com/mods/5577/?]Ashara\\\\\\'s Romantic Outfit[/URL]\r\nUrshi for the Female Vampire Outfit: [URL=http://skyrim.nexusmods.com/mods/39588/?]Noble Wedding Dress[/URL]\r\nnewermind43 for Lauras Dress: [URL=http://skyrim.nexusmods.com/mods/28736/?]Queen of the Damned Dress[/URL]\r\nnewermind43 for the Female Vampire Knights Armor: [URL=http://skyrim.nexusmods.com/mods/37000/?]Female Vampiric Knight Armor[/URL]\r\nnewermind43 for Balthazars Armor: [URL=http://skyrim.nexusmods.com/mods/22407/?]Avatar of Balthazar[/url]\r\nnewermind43 for Deaths & his Minions Armor: [url=http://skyrim.nexusmods.com/mods/23165/?]Avatar of Grenth[/URl]\r\nkempalot for Deaths Head: [URl=http://skyrim.nexusmods.com/mods/22296/?]Grim Reaper Hoods[/url]\r\nshacklemyfackle for Deaths Wings: [url=http://skyrim.nexusmods.com/mods/34522//?]Wearable Dragon Wings[/URL]\r\nMive357 for Deaths Scythe: [url=http://skyrim.nexusmods.com/mods/18255//?]Classic Scyther[/url]\r\nzerofrost for Dracula & Medusa\\\\\\'s Armors: [url=http://skyrim.nexusmods.com/mods/31229//?]Medusa & Drakul Armors[/URL]\r\nzerofrost for the Male Vampire Knights Armor: [url=http://skyrim.nexusmods.com/mods/38386/?]Contractor Armor[/url]\r\nJohnSkyrim for Renons Hat & Glasses: [url=http://skyrim.nexusmods.com/mods/40179/?]Heisenberg Accessories[/url]\r\nvie101010 for Renons suit: [url=http://skyrim.nexusmods.com/mods/44237/?]Suit & Classical Clothes[/url]\r\nlewisdude for Alucard & Gilles weapons: [url=http://skyrim.nexusmods.com/mods/17228/?]Emerald Rapier[/url]\r\nTamira for the Blood waterfalls: [url=http://skyrim.nexusmods.com/mods/39263/?]Bloodfalls[/url]\r\nlazyskeever for the windows: [url=http://skyrim.nexusmods.com/mods/40676/?]Window Resources[/url]\r\nRunspect for MANY models & Textures: [url=http://skyrim.nexusmods.com/mods/26132/?]Resources for Modders[/url]\r\n\r\n[Center][IMG]http://imageshack.us/a/img580/6831/85ar.jpg[/IMG][/Center]\r\n\r\nV1.0 - Nexus Release",
  "categoryId": "67",
  "version": "1.0",
  "author": "Saint Grimm",
  "createdUnix": "1382787628",
  "updatedUnix": "1382787614",
  "containsAdultContent": false,
  "uploadedBy": "saintgrimm92",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000070871",
      "name": "Draculas Castle N64",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "306177",
      "fileName": "Draculas Castle N64-45532-1-0.rar",
      "uploadedUnix": "1382787614",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Draculas%20Castle%20N64-45532-1-0.rar?fid=1000070871&ttl=1535826000&ri=8192&rs=8192&setec=d9e0a15fee7814524bcf48ea225da244"
    }
  ]
}