{
  "modId": 4554.0,
  "modName": "Skyrim NPC Editor 0_75_1",
  "summary": "Edit every NPCs in the game. Change their hairstyle, beards, eye color, skills, inventory, etc.",
  "descriptionHtml": "_____________________________________________________________________________________________________\r\n\r\n VERSION INFO\r\n_____________________________________________________________________________________________________\r\n\r\nVerion 0.75.1  **Please read FAQs below, most questions are answered there, read first!**\r\n\r\n***NON INSTALLER VERSION AVAILABLE FOR THOSE WHO ARE HAVING INSTALL ISSUE***\r\n\r\nIF YOU ARE USING THE NON INSTALLER VERSION PLEASE MAKE SURE YOU HAVE XNA 4.0 REDIST INSTALLED ON YOUR COMPUTER. YOU ALSO NEED .NET 4.0 CLIENT PROFILE OR MAIN FOR THE PROGRAM TO RUN. OTHERWISE THE PROGRAM WILL CRASH. MAKE SURE TO INCLUDE THE CONTENT FOLDER AS WELL.\r\n\r\nTHE INSTALLER VERSION HAVE EVERYTHING THE PROGRAM NEED PACKAGED.\r\n\r\n.Net Framework 4.0: http://www.microsoft.com/download/en/details.aspx?id=17718\r\nXNA 4.0 Refresh: http://www.microsoft.com/download/en/details.aspx?id=27599\r\n\r\n\r\nRelease Version 0.75.1\r\n\r\nNOTE: If you want your language added, send me all the files in the STRINGS folder.\r\n\r\n Added Features:\r\n - ***0.75.1 Fixes placement ID conflicts causing NPC not to show up.***\r\n - ***0.75 Other minor bugs fixes.***\r\n - ***0.75 Fixed Nif File\\'s NPC face mesh texture path.***\r\n - ***0.75 Fixed crash bug when using the Default Race and other facegen races without a head mesh.***\r\n - ***0.75 Fixed unable to find mesh issue when loading previously saved New NPC.***\r\n - ***0.75 Added support for Windows-1251 encoding. (Languages that use Cyrillic script: Russian, Bulgarian, Serbian Cyrillic and others)***\r\n - 0.74 Fixed FormID Conflict when having more than one New NPC\r\n - 0.74 Fixed crash when loading certain plugins that are incorrectly formed\r\n - 0.73 Added New NPC Placement Selection\r\n - 0.73 More bug fixes\r\n - 0.72 fixes a few bugs, otherwise it is the same as 0.71\r\n - NPC Renaming and New NPC Creation. (See FAQs below for New NPC issues)\r\n - Warpaints/Makeups/Skintone Editing.\r\n - Perks Editing.\r\n - Relationship editing.\r\n - Leveling and stats mechanics editing. \r\n - Load plugins (.esp) and master files (.esm) data. \r\n - Editable plugins load order for editor, include/exclude setting page. \r\n - Saving textures and meshes to BSA files. \r\n - Fixed several bugs.\r\n\r\n\r\n Additional Info:\r\n\r\n - Not compatible with Extended Color Sliders. Not recommended to include this mod in the plugin load list.\r\n\r\n\r\n Features not implemented and known issues:\r\n\r\n - Problem rendering hair and facial hair with tranparency. (See Technical below)\r\n\r\n\r\n \r\n\r\n\r\n_____________________________________________________________________________________________________\r\n\r\n WHAT DOES IT DO?\r\n_____________________________________________________________________________________________________\r\n\r\n\r\nDespite the name, this program is actually a NPC mods generator. Mods generated by this program are modified copies of existing NPC records in the Skyrim game data.\r\n\r\nNPC record holds data for a multitude of NPC attributes such as A.I. behaviours, skills, hairstyles, eye color, factions, inventory content, spells, abilities and many more.\r\n\r\nBy overriding original records with mods, you can actually make changes to NPCs in game.\r\n\r\nThis program strictly produces mods and do not alter you original Skyrim data in any way. Further details are illustrated below:\r\n\r\n\r\n\r\n_____________________________________________________________________________________________________\r\n\r\n HOW DOES IT WORK?\r\n_____________________________________________________________________________________________________\r\n\r\n\r\n\r\nWhen playing the Skyrim game, it often requires information of NPCs to do various tasks such as displaying an NPC that just appeared or when the player start a conversation with the NPC.\r\n\r\nThe game will first try to get that data from your save game (loaded when you starts the game) and when it cannot find it, it retrive the info from Skyrim\\'s data files. This is illustrated below:\r\n\r\n\r\nIn Game ------> Save Game ------> Skyrim Data\r\n\r\n\r\nThis program creates mod files with extension .nif and .esp. When you these files are put in the right place, the game will use info in these files instead of Skyrim Data.\r\n\r\n\r\nIn Game ------> Save Game ------> Mod Files ------> Skyrim Data\r\n\r\n\r\nFinally, if the desired info does not exist in the Mod Files, the game will continue to look for it in the Skyrim Data as shown.\r\n\r\nIn case you are wondering, the game must always try to get the data from Save Game first before the Mod Files. (Otherwise all your game progress such as NPC stats increase, new locations, states, equipements etc will always be fixed by the Mod Files and cannot be altered by the player everytime the game loads.)\r\n\r\nAs you can see, the Save Game might hold NPC data the game needs before it can get to the Mod Files. To force the game to retrieve data from the Mod Files, several console commands can be used.\r\n\r\n(~) Commands: disable, enable, resurrect, player.placeatme, markfordelete, recycleactor.\r\n\r\nThe general idea is to get the NPC to be erased from the game and force the game to load the NPC anew. Note that NOT ALL NPC information will be refreshed. And sometimes the information loaded will be immediately altered by game scripts.\r\n\r\nRelationships, Stats, and Leveling mechanics will not be loaded from plugins once the NPC is saved in your savegame.\r\n\r\nFor more commands and what they do see here: http://mod.gib.me/skyrim/functions.html\r\n\r\nOr a less complete but more friendly source: http://www.uesp.net/wiki/Skyrim:Console\r\n\r\nUsing Mod Files is a safe way to alter NPC information. It will not break your savegame (mostly) and Skyrim Data will not be changed in ways you might regret. Remember - by default there is no Skyrim Data backup and who wants to backup a > 2 GB file anyways?\r\n\r\nConsider then when the Mod Files are then removed:\r\n\r\nIn Game ------> Save Game ------> Skyrim Data\r\n\r\n\r\nWill all the data you edited be safety removed? - Not quite.\r\n\r\nIf you save the game (autosaves included) when Mod Files are active, the new Save Game will still hold some information that is altered by the Mod Files even when they are removed. You might need to refresh the NPC again using the aforementioned console commands. Some information such as factions might need to be manually removed. See \\'removefaction\\', \\'removeallfactions\\' and \\'addfaction\\'. PLEASE be careful when you change NPC factions. As mentioned, not all data altered can be removed.\r\n\r\nTo be safe, DO NOT save your game if you are not happy with your mods. Or at least have a previous save to revert to.\r\n\r\nKEEP IN MIND: I only provide the tools and will not be held responsible for how the tool is applied - YOU ARE.\r\n\r\n\r\n\r\n_____________________________________________________________________________________________________\r\n\r\n INSTRUCTIONS:\r\n_____________________________________________________________________________________________________\r\n\r\n\r\n\r\nExtract and run setup.exe and follow on screen instructions.\r\n\r\nThis editor requires XNA 4.0 framework and .Net framework 4.0. This will be automatically installed if your system does not already have them.\r\n\r\nYou also need Skyrim game installed on your machine. If the program cannot find your Skyrim Data files, it will prompt you for it.\r\n\r\nIf you encounter a \\'File In Use\\' alert, please close any programs that is using Skyrim\\'s data files at the time. This can include other modding tools such as nifskope and FOMM or even the Skyrim game itself. After the data files are released by other applications and data is retrieved, you can re-launch those application again.\r\n\r\nMaking changes to the NPC should be intuitive enough.\r\n\r\nTo load a previously saved .esp file click on the button labeled \\\"Load from File\\\". To load another file, first click \\\"Restore Selection\\\" to switch back to Skyrim Data and then \\\"Load from File\\\" again.\r\n\r\nTo switch the selected NPC\\'s entire head to match another, use the Head selector under the Appearance tab. i.e. making Aela look like Lydia. After the new defaults are loaded, you can make changes to the new head again.\r\n\r\nTo create Mod Files, click on the button labeled \\'Create Mod\\'.\r\n\r\nIt is recommended to have \\'Save to BSA\\' checked so that the mesh and texture need by the NPC is saved onto a BSA file. If \\'Save to BSA\\' is not checked, the texture and mesh will be created and place correctly structured into meshes and textures folders.\r\n\r\nIf you want to make a new NPC, check the \\'Save as New NPC\\' checkbox. You will see no change to the old NPC because you are creating a new one.\r\n\r\n\r\n\r\n----IMPORTANT:---------------------------------------------------------------------------------------\r\n\r\nPlease put ALL FILES AND FOLDERS CREATED to you skyim game\\'s Data folder. If there is a BSA file, both .esp and .bsa must be moved to the data folder. If \\'Save as BSA\\' is not checked, please move the .esp, meshes folder and textures folder to the data folder instead.\r\n\r\nIf you use \\'Save as BSA\\' (which is recommended) you might need to remove mesh and textures overrides that \\'override\\' your .bsa and everything else.\r\n \r\nFor example - if the NPC is AelaTheHuntress, her FormID is 0001a696 - You need to remove: \r\n\r\ntextures\\\\actors\\\\character\\\\facegendata\\\\facetint\\\\skyrim.esm\\\\0001a696.dds \r\n\r\nAND \r\n\r\nmeshes\\\\actors\\\\character\\\\facegendata\\\\facegeom\\\\skyrim.esm\\\\0001a696.nif \r\n\r\nFrom your Skyrim\\'s Data folder. Otherwise these files will keep overriding your new mesh and texture in the BSA file and you get discolored heads.\r\n\r\nUsually you get these files from older versions of this editor or other NPC or Companion mods. **If you are a modder I seriously advice you not to use overrides anymore, it stays (and keeps overriding) even when the plugin is disabled - unlike BSA file which is disabled when plugin is disabled.**\r\n\r\n\r\nNOTE: At this time, the editor will only generate Mesh and Texture for the current NPC only. If you have more NPCs in the created plugins, you need to merge those mesh and textures into the BSA file as well. You can use Archive.exe that came with the CK to do this. Weapons meshes and textures are usually overrides, but if you intend to distribute your NPCs with custom weapons and armors, then you might need to add those meshes and textures as well.\r\n\r\n\r\nThe .esp file can also be conflicted by another .esp file or mods you have already placed in game which cause the data mismatch with the .nif file. For best results separate your NPC\\'s .esp to one for each NPC, preventing and showing conflicts at once. It is also much easier to remove mods for one particular NPC when desired. Note that you can name the .esp file to whatever you like, but the .nif file must not be moved or renamed.\r\n\r\nTO REMOVE MODS, REMEMBER to remove the .nif file in the meshes folder with the .esp file. The .nif file is named according to the NPC\\'s FormID. i.e. type \\'help aela 0\\' at the console. It will show you that Aela the Huntress have the ID of 0001a696. Therefore the .nif file is 0001a696.nif. Be careful not to remove the whole meshes folders when you havemore than one NPC modded. This applies to the texture .dds file too. If you are using BSA, just remove both BSA and ESP file.\r\n\r\n\r\n\r\n----BEFORE YOU START THE GAME:-----------------------------------------------------------------------\r\n\r\nUse the game launch to register the Mod you just added. Click on \\'Data\\' on the launcher and make sure .esp file is \\'ticked\\'. You only need to do this once for each new .esp.\r\n\r\nIf the \\'Data\\' folder is greyed out. Go to <Your Drive>:\\\\Users\\\\<Your User Name>\\\\Documents\\\\My Games\\\\Skyrim.\r\n\r\nInside you will find SkyrimPrefs.ini. Open it make sure there is a line under [Launcher] that says\r\n\r\nbEnableFileSelection=1 \r\n\r\nIf not, change or add it.\r\n\r\nIf you do not see your NPC changes, see HOW DOES IT WORK? above.\r\n\r\n\r\n\r\n\r\n----IMPORTANT THINGS TO KNOW:------------------------------------------------------------------------\r\n\r\n\r\n1. BSA files vs. Overrides\r\n \r\nIf you place files in textures, meshes or scripts, those are overrides. At the same time, those file can be archived / \\'zipped\\' in Bethesda\\'s BSA. The game will look for overrides FIRST, if not found - look in <PluginName>.bsa - IF - <PluginName>.esp is enable. You can see why .BSA files are recommended over overrides.\r\n \r\n2. NPC textures and meshes filenames and locations\r\n \r\nMeshes and Textures are named according to NPC\\'s FormID. AelaTheHuntress is 0001a696.\r\n \r\nSo the mesh is 0001a696.nif, the texture is: 0001a696.dds\r\n \r\n Default NPCs meshes goes in: meshes\\\\actors\\\\character\\\\facegendata\\\\facegeom\\\\skyrim.esm\\\\\r\n Default NPCs textures goes in: textures\\\\actors\\\\character\\\\facegendata\\\\facetint\\\\skyrim.esm\\\\\r\n \r\n New Created NPCs meshes goes in: meshes\\\\actors\\\\character\\\\facegendata\\\\facegeom\\\\<plugin\\'s name .esp or .esm>\\\\\r\n New Created NPCs textures goes in: textures\\\\actors\\\\character\\\\facegendata\\\\facetint\\\\<plugin\\'s name .esp or .esm>\\\\\r\n \r\n\r\n3. Discolored NPC heads are caused by the Game not able to match the .esp\\'s description of the NPC to the meshes or textures. Or some \\'visual\\' entries in the NPC record is incorrect.\r\n \r\nSo if you use BSA files, you need to remove the older meshes and textures overrides or they wont match. Remember that the game will look for overrides first. If you are going to transport your plugin to another machine, make sure they remove those overrides too.\r\n \r\n\r\n\r\n\r\n\r\n\r\n\r\n_____________________________________________________________________________________________________\r\n\r\n FREQUENTLY ASKED QUESTIONS:\r\n_____________________________________________________________________________________________________\r\n\r\n\r\n----The Editor crashed or is stuck at the loading screen, what can I do?----------------------------------------\r\n\r\nClose and start the editor again. The plugin screen will show up again and lets you choose which plugins to load. At this point you need to remove the plugins and try to figure out which plugin is causing this issue.\r\n\r\nRemove suspect plugins and try again with a different plugin list.\r\n\r\nLet me know which plugins are giving you problem, I will attempt to fix the editor. Most of the time it is not the plugin\\'s fault but the editor\\'s bug.\r\n\r\n***Please know that you only need to load plugins you needed to edito the NPC, you can leave non-related plugins out. You also do not need any color selection plugins as the editor allow you to customize your own colors.\r\n\r\n\r\n\r\n\r\n----The loaded hair looks weird and out of place, help!----------------------------------------------\r\n\r\nYou can adjust hair position and scale using the Hair Fix controls.\r\n\r\n\r\n\r\n\r\n----The CK complains about multiple master files when loading the plugin created, help?--------------\r\n\r\n\r\nAdd bAllowMultipleMasterLoads=1 under [General] in SkyrimEditor.ini in your /Skyrim folder\r\n\r\n\r\n\r\n\r\n\r\n----Why is custom mods (i.e. hair) not showing up?---------------------------------------------------\r\n\r\n\r\nMake sure the plugins are included in the Load Order section of the plugins settings page. Click on \\'Plugin Settings\\' on the top right corner of the editor.\r\n\r\nThey will automatically show up in drop-down menus after loading.\r\n\r\n\r\n\r\n\r\n----When I edit a NPC, his/her head is browned/discolored in game.. why?-----------------------------\r\n\r\n\r\nDiscolored NPC heads are caused by the Game not able to match the .esp\\'s description of the NPC to the meshes or textures. Or some \\'visual\\' entries in the NPC record is incorrect.\r\n\r\nSee Instructions above. And \\'IMPORTANT THINGS TO KNOW\\'.\r\n\r\n\r\n\r\n\r\n----Why is the skills and stats changes I made not reflected in game? (Including Weight)-------------\r\n\r\n\r\nMany reasons. Your savegame overrides some stats data. There might be another script that control the stats in game. Previous commands, such as setav or forceav might force the stats to a different value. Another mod (i.e. body mod) might have overriden the values.\r\n\r\nRelationships, leveling mechanics and stats are ignored once the NPC is saved to your savegame. Going back to an earlier save or starting a new game will cause the game to load the NPC stats from the plugin as it cannot find it in your savegame.\r\n\r\nThis makes sense because NPC will not remain as described by the plugin or master file, but will be altered by events in the game. If the game loads the data from the plugin instead of savegame, your NPC will never grow in Stats or Relationship with the player.\r\n\r\nSee HOW DOES IT WORK? above.\r\n\r\nYour best bet are setting them manually using console commands.\r\n\r\nCommands listed here: http://www.uesp.net/wiki/Skyrim:Console\r\n\r\n\r\n\r\n\r\n----Why does my NPC start punching instead of using weapons?-----------------------------------------\r\n\r\n\r\nThanks to thediddy:\r\n\r\nDo not delete the standard weapon the NPC\\'s inventory.\r\n\r\n\r\n\r\n\r\n----The edited NPC or new NPC will not start dialog with me, why?------------------------------------\r\n\r\n\r\nYou have selected a Voice Type that does not have the required voice files for that particular conversation. Becareful which NPC you change voicetypes as some quest might become broken because the quest NPC could not start his/her conversation.\r\n\r\n\r\n\r\n\r\n\r\n----How do you fix the neck seam that appeared after some editing?-----------------------------------\r\n\r\n\r\nThe NPC weight might be altered in your savegame, by another mod or by yourself using console command. Whatever the altered value is, it needs to match the one you set in the editor. If you have this problem i.e. you set the weight of the NPC to be 75, and a neck seam appears in game - you must then use the console command setnpcweight to set the NPC weight to 75 to match it. This will make the seam go away.\r\n\r\nIf you notice a slight texture mismatch between the head and neck, it is probably the texture of a body mod not match the head\\'s textures. Remove the body mod and it should go away. I believe you can also look for head textures mod that provides matching texture to the body mod.\r\n\r\n\r\n\r\n\r\n\r\n----Why dont the NPC casts higher level spells I gave her?-------------------------------------------\r\n\r\n\r\nThanks to samsingletree:\r\n\r\nThe NPC need higher skills level. You might need to set the skill level using console. Put those spells higher up in the list too.\r\n\r\n \r\n\r\n\r\n----What does weight do?-----------------------------------------------------------------------------\r\n\r\n\r\nWeight affects the NPC\\'s appearance in girth / bust sizes. The more weight, the larger ...\r\n\r\n\r\n\r\n\r\n----After I set the NPC\\'s scale to 50, he disappeared!?----------------------------------------------\r\n\r\n\r\nLook up, way up.\r\n\r\n\r\n\r\n\r\n----How do I enable an NPC to be a spouse or follower?-----------------------------------------------\r\n\r\n\r\nThere are two conditions to be met. First add the NPC to the Marriage / Follower faction. Second, the NPC\\'s disposition rank must satisfy certain levels.\r\n\r\nIf the relationship rank is alter changed by the save game, this editor cannot change it.\r\n\r\nIf this NPC is not saved in your savegame, you can set relationship levels in the relationship tab.\r\n\r\nIf setting relationship to \\'Ally\\' or above doesnt work for you, click on the NPC in console and type:\r\n\r\nplayer.setrelationshiprank 3 (or 4 if you really want to be sure) 4 is usually auto-set after marriage.\r\n\r\n\r\n\r\n\r\n----How do I change the NPC\\'s fighting style to exactly what I want?---------------------------------\r\n\r\n\r\nI cannot give you the correct answer. The best approach is to observe the settings of another NPC whose fighting style you want to emulate. i.e. Mercer Fey has been mentions in the comments for people who want to dual-wield.\r\n\r\n\r\n\r\n\r\n----Why don\\'t the NPC use the weapon/magic I gave him/her?-------------------------------------------\r\n\r\n\r\nKnow that usually it is better to a more generic weapon to an NPC with enemies fighting style. Thats because the programmed A.I. do not expect the NPC to have that \\'unique special bow\\' and is not programmed to equiped it. Stick to using Hirelings/Housecarl \\'s AI /Combat Style because they are programmed to expect the player to give them better weapons. For magic they need Magicka to cast spells, not forget stamina too for special moves. Won\\'t work if they run out too. Finally please ask around and experiment.\r\n\r\nYou might also try to set the Combat Style to NONE. This may in fact be better in some cases.\r\n\r\n\r\n\r\n\r\n\r\n----Why is some features I want not added?-----------------------------------------------------------\r\n\r\n\r\nSome location for those values are as yet known.\r\n\r\nSee: http://www.uesp.net/wiki/Tes5Mod:Mod_File_Format/NPC\r\n\r\nOr the data is saved in the save game which this program do not cover.\r\n\r\nOr let me know if I missed anything.\r\n\r\n\r\n\r\n\r\n\r\n----What does Energy do?-----------------------------------------------------------------------------\r\n\r\n\r\nIn previous Elder Scroll games, it was the frequency of how often the NPC check for a reaction. Setting this value high to many NPCs will decrease CPU performance because the NPCs will now \\'think\\' more often.\r\n\r\n\r\n\r\n\r\n\r\n\r\n----Why isnt the NPC equiping the armor I gave him/her? / How to change outfit?----------------------\r\n\r\n\r\nNPC other than Hirelings and Housecarls usually wear what is selected at Default Outfit at the Info tab. If the default outfit does not have what you want, you can always create new outfit sets in the CK and load the plugin with this editor for it to be available.\r\n\r\n\r\n\r\n\r\n\r\n----Why are .net framework 4.0 and XNA 4.0 needed?---------------------------------------------------\r\n\r\n\r\n.Net framework is used to make time to deploy this program much faster than any other winforms platform API out there. Know that large part of this program are window forms objects. 4.0 is used because I need it to run XNA 4.0 which powers the model preview. Again the reason is speed and productivity.\r\n\r\nRemember that I made this program in 3 weeks with starting with no knowledge of Bethesda\\'s NPC record format and no idea of 3D and shaders programming. All this with a job and leisure time to spare.\r\n\r\n\r\n\r\n_____________________________________________________________________________________________________\r\n\r\n TECHNICAL STUFF:\r\n_____________________________________________________________________________________________________\r\n\r\n\r\n\r\nI need help from people with good XNA and HLSL shaders knowledge. There are current rendering problems with NPC\\'s translucent hair and beards. If you think you can help, please contact me, foretrenty @ skyrimnexus.com\r\n\r\nI shader I wrote is a 2 pass shader that takes textures, bump, and specular maps.\r\n\r\nFirst pass renders solids, second pass renders transparents.\r\n\r\nCulling is set to CW because, Skyrim meshes are made in left-handed coordinates where XNA is in right-handed coordinates.\r\n\r\nAlso, I want to especially thank the people at www.uesp.net who documents an incredible amount of Bethesda\\'s file format. No small part of the data used in making this program comes from them. Great job guys!\r\n\r\nPlease help and contribute if you find out / know more about Bethesda\\'s file format here:\r\n\r\nhttp://www.uesp.net/wiki/Tes5Mod:Mod_File_Format\r\n\r\n\r\n\r\n_____________________________________________________________________________________________________\r\n\r\nAll bug reports, suggestions, comments welcomed at:\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=4554\r\n\r\nforetrenty @ skyrimnexus.com ",
  "categoryId": "39",
  "version": "0.75.1",
  "author": "foretrenty",
  "createdUnix": "1324813114",
  "updatedUnix": "1525009883",
  "containsAdultContent": false,
  "uploadedBy": "foretrenty",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41110",
      "name": "Skyrim NPC Editor 0_67",
      "version": "0.67",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "49163",
      "fileName": "Skyrim NPC Editor 0_67-4554.rar",
      "uploadedUnix": "1331151317",
      "modVersion": "0.67",
      "virusScanUrl": "https://www.virustotal.com/file/9a67aecd3b5e012382472b76c7302c64d80cdc2e4b692bc9f9834a24c4429eb4/analysis/1406736521/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20NPC%20Editor%200_67-4554.rar?fid=41110&ttl=1535760428&ri=8192&rs=8192&setec=0438734cea13c742366cf78d14f436ad"
    },
    {
      "fileId": "1000271780",
      "name": "Skyrim NPC Editor",
      "version": "0.75.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "49245",
      "fileName": "Skyrim NPC Editor-4554-0-75-1.zip",
      "uploadedUnix": "1525009883",
      "modVersion": "0.75.1",
      "virusScanUrl": "https://www.virustotal.com/file/00baef659c0c57a4b75ee396d2123b663c895ee312027214aa494d0b54b56a8c/analysis/1525009988/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20NPC%20Editor-4554-0-75-1.zip?fid=1000271780&ttl=1535760428&ri=8192&rs=8192&setec=4d5d2db1116decc5b2eee6dcb1b2a889"
    }
  ]
}