{
  "modId": 4558.0,
  "modName": "Better Aura Whisper and New Detect spell",
  "summary": "Improves Aura Whisper and adds a new master alteration spell: Detect Aura",
  "descriptionHtml": "I got the general Idea(and only the GENERAL IDEA, all the work for this mod was done by yours truly) for this mod from this mod(http://skyrimnexus.com/downloads/file.php?id=3482) I found it somewhat useful and i thought i\\'d expand on that idea, while failing to create a way to enchant detect life into various items(wasted about 3 days on this project and i don\\'t think i\\'ve gotten anywhere), I failed so far with that, but gained some knowledge from the experience, and thought it\\'d be a waste to do nothing with it. So I made this mod.\r\n\r\nEffects\r\nAura Whisper - added an effect to tell the difference between allies and foes at the 3rd level(using all 3 words of power within the shout), increased the duration of the shout by 100x on all levels(might need nerfing but i figure why bother when it only applies from the casted location rather than player\\'s everchanging location, at least that\\'s my experience with it)\r\n\r\nDetect Aura - can be bought from Tolfdir after Alteration Ritual Spell quest, Detects everything and has a greater range than aura whisper(3x normal detect spell range 300 interior 600 exterior numerically) while outside, but has a huge mana cost(about 2x of other detect spells) to sustain(wouldn\\'t advise using it unless you have alteration master perk, along with fortify alteration enchants on your items) to balance it\\'s effects with other detect spells.",
  "categoryId": "75",
  "version": "1.0",
  "author": "Yoo203",
  "createdUnix": "1324820666",
  "updatedUnix": "1324820816",
  "containsAdultContent": false,
  "uploadedBy": "yoo203",
  "primaryFile": null,
  "files": [
    {
      "fileId": "13718",
      "name": "Better Aura Whisper and a New Detect Spell",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Better Aura Whisper and a New Detect Spell-4558-1-0.zip",
      "uploadedUnix": "1324820816",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ed5e1c2d80759b83c00d1631372de8954ee38298ae5eb9d8a588bb754ef70372/analysis/1406556842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Aura%20Whisper%20and%20a%20New%20Detect%20Spell-4558-1-0.zip?fid=13718&ttl=1535760441&ri=8192&rs=8192&setec=c9af55ed7a1c1b23b98e823386b53716"
    }
  ]
}