{
  "modId": 45605.0,
  "modName": "Weapon Perks Plus",
  "summary": "Adjusts scaling of weapon damage perks (Armsman, Barbarian, Overdraw), adds critical chance to Bullseye, increases bow sneak attack damage, and adds a whole new perk, Duelist, to the One Handed tree.  ",
  "descriptionHtml": "Installation:\r\nUse NMM or manually drop the .esp into your Data folder.\r\n\r\n[u]Description[/u]\r\n\r\nBows:\r\nOverdraw - 40/80/120/160/200% damage (up from 20/40/60/80/100%).\r\nDeadly Aim - 5x Sneak Attack damage (up from 3x).\r\n\r\nTwo Handed:\r\nBarbarian ranks 1-4: 50/100/150/200% damage (up from 20/40/60/80%).\r\nBarbarian rank 5: 250% damage, also increases blocking by 60% when using Two Handed weapons. Skill req changed from 80 to 85.   \r\n\r\nOne Handed:\r\nArmsman -  25/50/75/100/125% damage (up from 20/40/60/80/100%)\r\nNew Perk \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\"Duelist\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\" -  Requires Fighting Stance and 75 One Handed.\r\nGives a 15% chance to dodge melee attacks. Increases damage by 50% and blocking by 25% with an empty offhand.\r\n\r\nThis is a (somewhat) simple mod that adjusts the values of the scaling weapon damage perks.  \r\n\r\nTwo Handed weapons are much more powerful and increases the damage they can block, making it a viable alternative to sword and shield (for defense) or dual wielding (for offense).  With vanilla base values, dual wielding daedric swords gives more damage (28) than a daedric greatsword (24).  This mod pumps Two Handed damage up so that Two Handed weapons are now slow and powerful, instead of slow and mediocre.  \r\n\r\nBows always felt underwhelming at higher levels / difficulties... especially the [i]whopping[/i] 3x (up from 2x base) Sneak attack damage.   Now you get 5x Sneak attack damage with bows, and better base damage.  \r\n\r\nOne Handed gains slightly increased scaling (compared to Bows and Two Handed) with this mod, allowing for more damage should you favor \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\"Sword & Board\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\" style.  This also gives dual wielding a little boost so that Two Handed doesn\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t get [i]too[/i] far ahead.  \r\n\r\nThe biggest change to One Handed is the new Duelist perk.  With Vanilla perk trees, using a single One Handed weapon was pretty useless.  The blocking was bad, and the damage was tiny (compared to dual wield or two handed).  You basically nerf yourself just to look cool.  This is a perk for anyone who wants to be a ninja, or samurai, etc and just use one weapon.  Dual Wielding and Two Handed will still offer more damage, this just makes a single One Handed weapon a little better.  Note that if you have a spell, shield, or another weapon the offhand the damage and block increase will [b]not[/b] be active, but the chance to avoid attacks still [b]will[/b] be.  This is intentional, and is mostly a role-playing element.  \r\n\r\nCompatibility Issues:\r\n\r\nThe only issues should be if you have a mod that already modifies the vanilla perks (Armsman, Overdraw, Barbarian, Deadly Aim).  It might cause issues with mods that add other custom perks to the One Handed tree, but since I don\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t have any (or care to dl any) I don\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t know.  If it does, just use TESSnip to merge the .esp of this mod and the other mod that adds new perks.  \r\n\r\nRecommended Mods:\r\n\r\nThese are other mods that I recommend, and will run in conjunction with this one.  \r\n[url=http://skyrim.nexusmods.com/mods/19647//?]Deadarmours Weapon Perk Overhaul[/url]\r\n[url=http://skyrim.nexusmods.com/mods/12895//?]Dual Flurry to Flurry[/url]\r\n\r\nAuthor\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s Notes:  \r\n\r\nNo, I will not make separate a .esp for each weapon.  Besides the Duelist perk, these are super simple adjustments that take 5 mins in Creation Kit that you can do yourself if you only want to buff one weapon.  No, I will not replace the Block enhancement in the Duelist perk to an attack speed increase.  This is covered by the above Dual Flurry to Flurry mod.  ",
  "categoryId": "77",
  "version": "1.0",
  "author": "KelbornX",
  "createdUnix": "1382817976",
  "updatedUnix": "1382817976",
  "containsAdultContent": false,
  "uploadedBy": "KelbornX",
  "primaryFile": null,
  "files": []
}