{
  "modId": 45652.0,
  "modName": "From the Ashes - Lost Enchantments of the Sixth House",
  "summary": "Small Morrowind-themed pack of enchantments.",
  "descriptionHtml": "From the Ashes\r<br />Lost Enchantments of the Sixth House\r<br />v1.2\r<br />\r<br />UPDATE 1.2:\r<br />- New weapon effect, Dagoth&#39;s Sting.\r<br />- Numerous minor tweaks to Dagoth&#39;s Fury\r<br />\r<br />This is a set of enchantments geared towards lore-hounds and Morrowind enthusiasts, and perhaps roleplayers as well.\r<br />They are thematically based on the now-extinct House Dagoth of Morrowind. I tried to make use of several of Dragonborn&#39;s new ash and wind-based magics accordingly.\r<br />Please remember to endorse if you like the mod, I&#39;m working on a couple of others and support/constructive criticism is always appreciated. You&#39;ve also probably noticed that I suck at screen caps, sorry about that.\r<br />\r<br />This mod requires the Dragonborn DLC.\r<br />\r<br />\r<br />\r<br />The Enchantments:\r<br />\r<br />Dagoth&#39;s Sting:\r<br />Placed on weapons, this enchantment lowers the target&#39;s armor rating slightly [similar to Bloodscythe] and applies Weakness to Poison [25%], both effects last for five seconds. They also seem to stack with successive hits. Also poisons the target for 20 points. Should be infinite-use unless combined with other enchantments.\r<br />This enchantment is intended to soften a target up somewhat for your counter-attacks, and to help make poisoned weapons a bit more useful.\r<br />Remember in Morrowind when there was a Disintegrate Armor enchantment and an enchantable poison effect? Pepperidge Farms remembers. \r<br />\r<br />\r<br />Dagoth&#39;s Fury:\r<br />Placed on weapons, its effect slows opponents down for a few seconds.\r<br />Attacks also have a 20% chance to knock enemies backwards or stagger them, and a 10% chance to paralyze them for two seconds.\r<br />The enchantment should be infinite-use without the need for the recharging unless combined with other enchantments.\r<br />\r<br />Dagoth&#39;s Blight:\r<br />Casts a version of Whirlwind Cloak in combat, similar to the Ebony Mail&#39;s enchantment. Extremely useful for fighting groups of enemies.\r<br />Like the cloaks from my other enchantment mods, this spell will disable automatically when you are brawling, sparring with Vilkas, sneaking, or swimming.\r<br />\r<br />Dagoth&#39;s Contempt:\r<br />An enchantment which grants a minor resistance to physical damage, this time I focused on what a racist member of House Dagoth might regard as their enemies.\r<br />Namely, Nords, Imperials, and Bretons, against whom you are now 10% more resistant to physical damage.\r<br />I found it somewhat useful during the Civil War and when fighting Forsworn. Most NPC&#39;s in Skyrim are Nords so this should prove useful to nearly everyone though.\r<br />\r<br />Dagoth&#39;s Cunning:\r<br />Focuses on the seductive power by which Dagoth Ur created his armies of Sleepers.\r<br />Namely, it gives a boost to both the magnitude [not spell cost] of Illusion spells and a buff to Speechcraft.\r<br />It also has a chance to heal the player if their health gets low, cast a Fire Cloak, and summon a unique Ascended Sleeper.\r<br />The Ascended Sleeper is a Seeker with a unique spell package focused on knocking back or disabling opponents instead of harming them. He&#39;s more of a defensive summon as a result, and can be greatly useful against large groups of enemies.\r<br />Consider this like a special version of Konahrik.\r<br />\r<br />Dagoth&#39;s Grace:\r<br />You swim 20% faster, and take 10% less damage from falling. I wanted to mimic Morrowind&#39;s Swift Swim and Slowfall spells to the best of my ability.\r<br />\r<br />Dagoth&#39;s Hand:\r<br />Your speed with all weapons is increased by 20%, and the spell cost of all magic is reduced by 10%.\r<br />In my opinion, this is overpowered if used on more than one piece of gear.\r<br />\r<br />Dagoth&#39;s Tomb:\r<br />A simple bashing spell that casts Ash Shell on the target for 1 second.\r<br />Enough to knock someone off their feet, but the shell effect also protects them for a moment as well, which IMHO made this a little more balanced than a standard Paralyze spell.\r<br />Blocking both casts a Fire Floak similar to the Dunmer racial power, and opponents who strike you with weapons or spells while blocking may become paralyzed for ten seconds.\r<br />\r<br />\r<br />\r<br />Where to find them:\r<br />On Horker Island off the Eastern coast of Solstheim, there is a unique horker named Lord Tusk.\r<br />Kill him to obtain the items, the &#34;Sixth House Battlemage&#34; set. It&#39;s not hard and can be done at pretty much any level you want.\r<br />He also respawns, if I&#39;m not mistaken. So don&#39;t worry too much if you&#39;ve already killed him.\r<br />\r<br />If you would prefer to obtain them via console, you&#39;re looking for boots, a helmet, gauntlets, armor, a shield, a sword, a bow, and a ring.\r<br />\r<br />Use:\r<br />Feel free to use for anything you want, include in your own mod, release a tweak for it, etc. Just remember to give me credit.\r<br />If you enjoyed the mod please remember to endorse.\r<br />\r<br />Also, check out my other mods:\r<br />\r<br />Black Against Night [vampire-themed enchantment set]\r<br />http://skyrim.nexusmods.com/mods/41255\r<br />\r<br />New Day Rising [paladin-themed enchantment set]\r<br />http://skyrim.nexusmods.com/mods/47988\r<br />\r<br />Dark Dragonbone Weapons Retexture\r<br />http://skyrim.nexusmods.com/mods/31430 \r<br />\r<br />Queen of the Damned - Deadlier Serana\r<br />http://www.nexusmods.com/skyrim/mods/49465",
  "categoryId": "75",
  "version": "1.2",
  "author": "xunderxdosedx",
  "createdUnix": "1382882042",
  "updatedUnix": "1387868843",
  "containsAdultContent": false,
  "uploadedBy": "xunderxdosedx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000071336",
      "name": "From the Ashes 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Sixth House Enchantments-45652-1-0.zip",
      "uploadedUnix": "1382882039",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ffbecfd584335b06d9f5c195ce50bf4b01efa91f80c0380415524b5e5086a496/analysis/1407770864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sixth%20House%20Enchantments-45652-1-0.zip?fid=1000071336&ttl=1535826105&ri=8192&rs=8192&setec=5a89ae86b8b65050a7562caa8f2c6b38"
    },
    {
      "fileId": "1000085781",
      "name": "From the Ashes 1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "From the Ashes 1-1-45652-1-1.zip",
      "uploadedUnix": "1386456543",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6537f126d78ea3eeb06dc6ff10c355d31a6921617b0659ab53d4c0bb45b418b8/analysis/1407824285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/From%20the%20Ashes%201-1-45652-1-1.zip?fid=1000085781&ttl=1535826105&ri=8192&rs=8192&setec=b427bfe0b3686bec9f4a0a921a717fe4"
    },
    {
      "fileId": "1000088150",
      "name": "From the Ashes 1-2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "From the Ashes 1-2-45652-1-2.zip",
      "uploadedUnix": "1387868843",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/c1d7ecdfd35bbbb325358699f2b540073c988f43ee3099c2f7fa49625c691b25/analysis/1407856622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/From%20the%20Ashes%201-2-45652-1-2.zip?fid=1000088150&ttl=1535826106&ri=8192&rs=8192&setec=b3ab4b6701d0e435986cc8a5cab58bf0"
    }
  ]
}