{
  "modId": 45676.0,
  "modName": "The Last line of Old Atmora",
  "summary": "If your followers lack steel in their spines, ice in their blades and Atmoran fury in their hearts, clan Grey-Winter may be able to help with that.",
  "descriptionHtml": "The Grey-Winters of Windhelm are the sum of my player characters from the Morrowind, Oblivion and Skyrim.  These 3 men are each gifted with a unique power from their past ordeals that will make them a cut above other followers (and unsuitable for difficulty levels below legendary).\r<br />\r<br />   Bergen is a Nordic Barbarian found in Windhelm in the service of Ulfric Stormcloak, based on my own character from The Elder Scrolls V: Skyrim.  He becomes available as a follower once the Dragonborn has reached the rank of Snowhammer with the Stormcloak army.  His armor, passed down from the clanfathers who survived The Freezing in Atmora, grants him access to the immense power of Atmora&#39;s frigid winters.  The power of Fimbulwinter, The Winter of Wolves, will call forth a blizzard prowled by the specters of wolves who didn&#39;t survive their last winter.  His blade, Chill, is a Stalhrim greatsword with the power to freeze foes solid.  There is no more stalwart companion, and Bergen is prepared to lay down his life in service to the chosen of Akatosh, knowing that Sovngarde awaits. (If the Dragonborn sides with the Imperials, one of the others in the clan will have to talk Bergen down, otherwise you will have an incredibly difficult fight in Ulfric&#39;s throne room.) \r<br />\r<br />   Gregor is a mysterious man who spends a great deal of time wandering the coast of the Sea of Ghosts between Dawnstar and Winterhold, seldom approaching populated areas.  Based on my character from The Elder Scrolls IV: Oblivion, Gregor seems a bit touched in the head for some reason, and occasionally hints at knowing more of the blessing of the Dragonborn than any book or monk could tell.  Wearing the armor that once belonged to Pelinal Whitestrake, the Divine Crusader, he is a true force against the influence of the many daedric princes seeking to gain a foothold in Mundus since the death of Emperor Martin at the end of the Oblivion crisis.  He does not appear in game until after the conclusion of the quest &#34;The Mind of Madness&#34;, and his powers include banishing daedra, turning enemies on one another (on occasion turning them into sweetrolls), healing the Dragonborn and repelling the undead.  Unlike all other followers, Gregor will accompany you to the planes of Oblivion, though he neglects to inform you of how this is possible.  If he falls in battle, he will vanish in a cloud of smoke, only to rejoin you at his leisure.\r<br />\r<br />   Rodrik is a seemingly ageless warrior who spends his time in the College of Winterhold until the disappearance of Arniel Gane during an experiment with soul gems.  At this time he will simply travel the roads of Skyrim, stopping in whatever tavern he arrives at when the sun sets.  He wears an aging but well cared for set of nordic iron armor, although the helm seems much newer than the rest of the set.  He carries a hammer called Sunder, which after Keening is obtained and given to him he will use to improve and enchant equipment for the Dragonborn.  In combat, he uses the claymore Chrysamere, which he claims was once thought of as one of the best blades ever made.  He is not forthcoming about his past, beyond saying that unlike the others in the clan he actually has a documented pardon for his crimes.",
  "categoryId": "66",
  "version": "1",
  "author": "macgaills",
  "createdUnix": "1382893304",
  "updatedUnix": "1382893304",
  "containsAdultContent": false,
  "uploadedBy": "macgaills",
  "primaryFile": null,
  "files": []
}