{
  "modId": 45725.0,
  "modName": "Twilight Watch - Nightingale Player Home",
  "summary": "The perfect player home for a Nightingale. Overlooking the entrance to the Twilight Sepulcher, Twilight Watch is a comfortable, convenient and secretive place to live, surround by the beautiful scenery of Falkreath. Inside the house is an entrance to a secret cave which contains within a full working forge, a pool and waterfall and a statue of Noct",
  "descriptionHtml": "[img]http://static1.nexusmods.com/110/mods/110/images/45725-1-1382942157.jpg[/img]\r\n\r\nTwilight Watch was a place designed to be the perfect hideout / house for a nightingale character. It contains within it all the features and functions that one would expect from a house mod and presents them in stylized and immersive way that stays true to the Nightingale character.\r\n\r\nThe house is found in a secret alcove just above the entrance to the Twilight Sepulcher. From the Sepulcher, it is a short climb up past two waterfalls to get to the house, which is hidden in the vegetation. The house has its own Map Marker which is shown in the pictures. From the house you can enjoy the beautiful surroundings and keep a close watch on the Sepulcher.\r\n\r\nFlick through the pictures to get an idea of what the house looks like, inside and out. However I must warn you that the pictures do not accurately represent the true beauty of the location.\r\n\r\nSome features of the house include:\r\n\r\n- Forge\r\n- Armour Workbench\r\n- Weapon Grindstone\r\n- Tanning Rack\r\n- Smelter\r\n- Alchemy Lab\r\n- Enchanting Table\r\n- Weapon Racks\r\n- Mannequin\r\n- Cooking Pot\r\n- Loads of Storage\r\n- Cave Pool\r\n- Cave Waterfall \r\n- Bed\r\n- Amazing Scenery\r\n\r\nAlso, the house is fully Navmeshed. This means that you are able to take your followers inside.\r\n\r\nTo get up to the house you will initially have to do some platform leaping, this is due to the difficulty of placing stairs in the environment in that location. Once you get past the first waterfall, there are stair to take you the rest of the way. The jumps are not difficult, and they further reinforce the notion of this location as being owned by a stealthy and agile character.\r\n\r\nIt is not a requirement for you to be a Nightingale to use this house, however it is much more lore friendly if you are one. Also you do not need to fulfill any requirements or complete any quests to earn the house. Just turn up and it is yours.\r\n\r\n\r\nHope you enjoy! A fair amount of effort went into this mod. Don\\'t forget to rate if you subscribe! :)\r\n\r\n[youtube]hSjeiRBTPH4[/youtube]\r\n\r\nThankyou to Randisaurux for the great vid! Check out her vids and subscribe to her channel! [url=http://www.youtube.com/channel/UCamR-YYMkXYrPKmYhgigzWQ?feature=watch]Randisaurux\\'s channel[/url].",
  "categoryId": "67",
  "version": "1",
  "author": "TheGreyLight",
  "createdUnix": "1382928138",
  "updatedUnix": "1382928061",
  "containsAdultContent": false,
  "uploadedBy": "TheGreyLight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000071663",
      "name": "Twilight Watch",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "201",
      "fileName": "Twilight Watch-45725-1-0.7z",
      "uploadedUnix": "1382928061",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0766bd667af9cedf366c16a5729323ce6ea13d9aa29211dff0252e9e4e860a79/analysis/1407772344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Twilight%20Watch-45725-1-0.7z?fid=1000071663&ttl=1535826171&ri=8192&rs=8192&setec=0efeb8385e010b95afa4db3a78c7ba81"
    }
  ]
}