{
  "modId": 45721.0,
  "modName": "Spidercraft - Spider Scrolls Unleashed",
  "summary": "Like spiders? This may be the mod for you!\r\n\r\nThis mod adds lots of Spider Scroll related changes to make them more accessible and enjoyable.",
  "descriptionHtml": "[img]http://static1.nexusmods.com/110/mods/110/images/45721-1-1382941982.jpg[/img]\r\n\r\n[b]REQUIRES DRAGONBORN[/b]\r\n\r\nIf you dont know what spider scrolls are you should [url=http://lmgtfy.com/?q=spider+scrolls]research[/url] them for a little while before reading this description.\r\n\r\nThe spider scrolls that Dragonborn added were a great idea and they worked quite well, however they were a bit limited. Spider pods were not easy to find and once you used them all up you couldn\\'t craft anymore spiders. To make things worse, there was only one place you could make these spiders and that was in the middle of nowhere. This mods aims to make spider scrolls and spider crafting much more accessible and viable.\r\n\r\n\r\nWHAT THIS MOD ADDS:\r\n\r\n[b]Saveri:[/b] Saveri is a female dunmer NPC. She is a follower and also marriageable. She sells spider crafting supplies in her shop near whiterun. She has fled Solsthiem, bringing her knowlege of spider imbuing to skyrim.\r\n\r\n[b]Saveri\\'s Spiders:[/b] Saveri\\'s spiders is a new shop located in a cave near the entrance of whiterun (pics show the location). Saveri lives here and sells many different things to the player. Every spider crafting ingredient is featured in her shop, as well as completed sider scrolls if you don\\'t like crafting them. This way you will never run out of spider pods! Saveri\\'s Spiders also features an imbuing chamber so that it is not necesary to travel to a different country to create some scrolls.\r\n\r\n[b]Craftng fixes:[/b] For some reason the crafting recipies for glowing spiders and pack spiders exist, but Bethesda never made them craftable. I have corrected this and now both of these spiders can be crafted.\r\n\r\n\r\n\r\n[b]Something you may not know about spider scrolls[/b], as well as all of the \\'elemental\\' spiders you can create (fire, frost, shock, poision) there are four more unique spiders that are craftable.\r\n\r\n[b]Mind Control Spiders[/b] - Work as seen in white ridge burrow. Throw it on an enemy and they will be controlled.\r\n\r\n[b]Oil Spiders[/b] - Leave trails of ignitable oil behind them while in combat. \r\n\r\n[b]Pack Spiders[/b] - Follow you around wherever you go. They can carry all of your items for you. \r\n[b]NOW CRAFTABLE[/b]\r\n\r\n[b]Glowing Spiders[/b] - Follow you around wherever you go. They glow brightly and light up dungeons.\r\n[b]NOW CRAFTABLE[/b]\r\n\r\n\r\nFor more information on spider scrolls: [url=http://elderscrolls.wikia.com/wiki/Spider_Scrolls]http://elderscrolls.wikia.com/wiki/Spider_Scrolls[/url]\r\n\r\n\r\nFinal Note: I am using a mod called Towns and Villages Enhanced - Whiterun Exterior Enchanced. An amazing mod, I highly reccomend it. This is why my whitrerun looks all foresty, and why there are so many trees around.\r\n",
  "categoryId": "69",
  "version": "1.0",
  "author": "TheGreyLight",
  "createdUnix": "1382923857",
  "updatedUnix": "1382923852",
  "containsAdultContent": false,
  "uploadedBy": "TheGreyLight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000071645",
      "name": "Main File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "85",
      "fileName": "Main File-45721-1-0.7z",
      "uploadedUnix": "1382923852",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/80534ba92682b225dd96f63aba144304f1e749d7c7001c4eb28ad6090c3ea324/analysis/1407772268/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-45721-1-0.7z?fid=1000071645&ttl=1535826167&ri=8192&rs=8192&setec=4a7d49605f40c974012affed02c41ce7"
    }
  ]
}