{
  "modId": 45739.0,
  "modName": "The Summoning Enchantment",
  "summary": "Adds a new armor enchantment which allows an increased number of summoned creatures.",
  "descriptionHtml": "[img]http://static1.nexusmods.com/110/mods/110/images/45739-1-1382941786.jpg[/img]\r\n\r\n- Have you ever thought that you deserve more than one measly summon at a time? \r\n\r\n- Do you hate the fact that conjuration gets bum deal in enchanting? \r\n\r\n- Are you too bloody lazy to finish the conjuration tree? \r\n\r\n\r\nIf you answered yes to the above then this is a mod you will enjoy! \r\n\r\n\r\n\r\n\r\nWOT: \r\n\r\nThis mod adds a ring called \\'Ring of the Summons\\' to the game. This ring has a never before seen enchantment which allows the wearer to summon an additional creature. \r\n\r\nWhat\\'s more, this ring can be disenchanted! The enchantment can then be placed on rings, necklaces, head pieces and body pieces. \r\n\r\nThe standard number of creatures per enchanted piece is one, however if you have a high enough enchanting skill and a big enough soul gem you can get that value up to two creatures per piece! \r\n\r\nThis stacks with the \\'Twin Souls\\' perk and all of the bonuses achieved through my other mods. \r\n\r\nThe ring is found in an urn on a necromancers alter. See the pictures for details, the map shows the location which is near the Guardian Stones. \r\n\r\n\r\n\r\nSpecial Note: \r\n\r\nThere is only one tiny catch with this mod. For the enchantment to function, the very first enchanting perk must be taken. This is done simply to remove the need for scripts and to make it a cleaner and simpler mod. This perk was chosen as I assumed most people who were planning on using this enchantment would take this perk anyway. If you try to use the enchantment without the perk, the enchantments will be ignored and you will only be able to summon the regular amount of creatures. \r\n\r\n\r\nEnjoy! :)",
  "categoryId": "75",
  "version": "1.0",
  "author": "TheGreyLight",
  "createdUnix": "1382929747",
  "updatedUnix": "1382929743",
  "containsAdultContent": false,
  "uploadedBy": "TheGreyLight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000071667",
      "name": "The Summoning Enhcantment",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "The Summoning Enhcantment-45739-1-0.7z",
      "uploadedUnix": "1382929743",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5a52244c0585bed5e48aa90ad81cfc99f70643f6a86e294708073e50948551c2/analysis/1407772345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Summoning%20Enhcantment-45739-1-0.7z?fid=1000071667&ttl=1535826179&ri=8192&rs=8192&setec=58f9746702f5f2a2f68fda135b622817"
    }
  ]
}