{
  "modId": 45751.0,
  "modName": "A Tragedy in Black - Enchanting Remastered",
  "summary": "This mod aims to empower the Enchanting tree and to provide versatility and power to the dedicated enchanter.This mod rewards commitment to the skill with a range of powerful choices.",
  "descriptionHtml": "[img]http://static1.nexusmods.com/110/mods/110/images/45751-5-1382943169.jpg[/img]\r\n\r\nThis mod is a reworking of the Enchanting tree. As stated in the brief, this mod rewards commitment with power. It is aimed at the dedicated and hardcore enchanter. It is quite perk demanding, but has great rewards. \r\n\r\n\r\nPERK CHANGES: \r\n\r\nENCHANTER: Now has TEN ranks. \r\n\r\nRank 1: New enchantments are 20% more effective. \r\n\r\nRank 2: New enchantments are 40% more effective. - Lvl 20 needed. \r\n\r\nRank 3: New enchantments are 60% more effective. - Lvl 30 needed. \r\n\r\nRank 4: New enchantments are 80% more effective. - Lvl 40 needed. \r\n\r\nRank 5: New enchantments are 100% more effective. - Lvl 50 needed. \r\n\r\nRank 6: New enchantments are 120% more effective. - Lvl 60 needed. \r\n\r\nRank 7: New enchantments are 140% more effective. - Lvl 70 needed. \r\n\r\nRank 8: New enchantments are 160% more effective. - Lvl 80 needed. \r\n\r\nRank 9: New enchantments are 180% more effective. - Lvl 90 needed. \r\n\r\nRank 10: New enchantments are three times more effective. - Lvl 100 needed. \r\n\r\n\r\n\r\nFIRE ENCHANTER: Now has TWO ranks. \r\n\r\nRank 1: Fire enchantments on weapons and armor are 25% stronger.- Lvl 30 needed. \r\n\r\nRank 2: Fire enchantments on weapons and armor are 50% stronger. - Lvl 60 needed. \r\n\r\n\r\n\r\nFROST ENCHANTER: Now has TWO ranks. \r\n\r\nRank 1: Frost enchantments on weapons and armor are 25% stronger.- Lvl 40 needed. \r\n\r\nRank 2: Frost enchantments on weapons and armor are 50% stronger. - Lvl 80 needed. \r\n\r\n\r\n\r\nSTORM ENCHANTER: Now has TWO ranks. \r\n\r\nRank 1: Shock enchantments on weapons and armor are 25% stronger.- Lvl 50 needed. \r\n\r\nRank 2: Shock enchantments on weapons and armor are 50% stronger. - Lvl 100 needed. \r\n\r\n\r\n\r\nINSIGHTFUL ENCHANTER: Now has TWO ranks. \r\n\r\nRank 1: Skill enchantments on armor are 25% stronger. - Lvl 50 needed. \r\n\r\nRank 2: Skill enchantments on armor are 50% stronger. - Lvl 80 needed. \r\n\r\n\r\n\r\nCORPUS ENCHANTER: Now has TWO ranks. \r\n\r\nRank 1: Health, magicka, and stamina enchantments on armor are 25% stronger. - Lvl 70 needed. \r\n\r\nRank 2: Health, magicka, and stamina enchantments on armor are 50% stronger. - Lvl 100 needed. \r\n\r\n\r\n\r\nEXTRA EFFECT: Now has THREE ranks. \r\n\r\nRank 1: Can put two enchantments on the one item. - Lvl 100 needed. \r\n\r\nRank 2: Can put three enchantments on the one item. - Lvl 100 needed. \r\n\r\nRank 3: Can put five enchantments on the one item. - Lvl 100 needed. \r\n\r\n\r\n\r\nSOUL SQUEEZER: Now has FIVE ranks. \r\n\r\nRank 1: Each soul gem provides extra free petty soul worth of magicka for recharging. - Lvl 20 \r\n\r\nRank 2: Each soul gem provides extra free lesser soul worth of magicka for recharging. - Lvl 40 \r\n\r\nRank 3: Each soul gem provides extra free common soul worth of magicka for recharging. - Lvl 60 \r\n\r\nRank 4: Each soul gem provides extra free greater soul worth of magicka for recharging. - Lvl 80 \r\n\r\nRank 5: Each soul gem provides extra free grand soul worth of magicka for recharging. - Lvl 100 \r\n\r\n\r\n\r\nSOUL SIPHON: Now has THREE ranks. Power increased. \r\n\r\nRank 1: Death blows to creatures, but not people, trap 10% of the victim\\'s soul, recharging the weapon. - Lvl 40 needed. \r\n\r\nRank 2: Death blows to creatures, but not people, trap 20% of the victim\\'s soul, recharging the weapon. - Lvl 70 needed. \r\n\r\nRank 3: Death blows to creatures and people, trap 30% of the victim\\'s soul, recharging the weapon. - Lvl 100 needed. \r\n\r\n\r\n\r\nNOTES: \r\n\r\n- Mods that alter the Enchanting tree will conflict. Move this mod to the bottom of the load list to use this tree. \r\n\r\n- The reading of the book is due to a mod called \\'Dovakiin Relaxes too\\'. Top mod, check it out :) \r\n\r\n- If you find a bug please report it! I have tested it to the best of my ability and have found none so far. \r\n\r\n- Dont forget to rate! Enjoy :)",
  "categoryId": "79",
  "version": "1.0",
  "author": "TheGreyLight",
  "createdUnix": "1382943333",
  "updatedUnix": "1382943317",
  "containsAdultContent": false,
  "uploadedBy": "TheGreyLight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000071713",
      "name": "A Tragedy in Black",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "A Tragedy in Black-45751-.7z",
      "uploadedUnix": "1382943317",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6d637180b2c125bf1d9edd9b6c4be62d8a8a70041d766fba2f5e0b3b60bfa552/analysis/1407772598/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Tragedy%20in%20Black-45751-.7z?fid=1000071713&ttl=1535826189&ri=8192&rs=8192&setec=3ecf7be1c645fb06b495f434e7b97ddd"
    }
  ]
}