{
  "modId": 45764.0,
  "modName": "Pyromage",
  "summary": "A fire-themed spell pack to add versatility and functionality of a Pyromancer type character. Includes both combat and utility spells with creative effects and custom visuals. Aims to make the Pyromancer type playthrough both more viable and more enjoyable. \r\n",
  "descriptionHtml": "[img]http://static2.nexusmods.com/110/mods/110/images/45764-1-1382949424.jpg[/img]\r\n\r\nA fire-themed spell pack to add versatility and functionality of a Pyromancer type character. Includes both combat and utility spells with creative effects and custom visuals. Aims to make the Pyromancer type playthrough both more viable and more enjoyable.\r\n\r\n\r\n[b]La version française ici: [url=http://steamcommunity.com/sharedfiles/filedetails/?id=184580094]Pyromancien[/url][/b]\r\n\r\n\r\n[youtube]zpekN51Y08E[/youtube]\r\n\r\n\r\nLike fire? \r\n\r\n\r\nAs the brief stated, this mod adds a veriety of new fire-based spells for the aspiring pyromanic.\r\n\r\n[b]SPELL LIST[/b]\r\n\r\n[b]ENKINDLE AND ENFLAME:[/b] These are a unique idea which combines the stealth and subterfuge of assassination with the destructive fun of fire spells. These are concentration spells where tartgets are slowly cooked alive without thier knowlege! It has no projectile, just hold you cursor over the target and continously cast the spell to inflict damage. They will not register this action as an attack and so they will just continue on with thier loves oblivious to thier impending doom. This spell can affect people very far away, so it is perfect for steathly assassination. The spell has unique visuals, targets will begin to smoke as they are being cooked. They will also continue smouldering for a short time after they have died. :)  Pictures 2, 3 and 4 showcase these spells.\r\n\r\n[b]Enkindle[/b]\r\nEffect: Targets are stealthily burned from a distance for 5 points per second.\r\nBase Cost: 2 per second.\r\nRank: Novice\r\n\r\n[b]Enflame[/b]\r\nEffect: Targets are stealthily burned from a distance for 25 points per second.\r\nBase Cost: 17 per second.\r\nRank: Adept\r\n\r\n\r\n\r\n[b]FLARE:[/b] A spell with a similar idea to magelight, however you will find this one infinitely more useful. As well as having a much larger light radius than the standard magelight, you can have an unlimited amount of these lights in the environment at once! The flares themselves look like small fireballs, and look great sticking to cave walls, trees etc. Picture 5 shows a few of them stuck to a wall in dragonsreach, but to see them at thier best, go to a dark cave and cast a few :)\r\n\r\n[b]Flare[/b]\r\nEffect: Ball of illuminating fire that lasts 60 seconds and sticks where it strikes. Many can be placed at once.\r\nBase Cost: 21\r\nRank: Novice\r\n\r\n\r\n\r\n[b]HEAT SHIELDS:[/b] With these spells it is possible to create a shield out of heated air which can block incoming magical attacks. Functions similar to a ward, however the costs are much lower at the expense of not increasign your armour rating as restoration wards do. These spells have a very beautiful and immersive custom visual, the shield is formed out of shimmering air in fron of you whilst it is being cast! Pictures 6 and 7 show this spell in use, however it is difficult to see the effect in a still image.\r\n\r\n[b]Lesser Heat Shield[/b]\r\nEffect: Negates up to 40 points of spell damage or effects.\r\nBase Cost: 23 per second.\r\nRank: Novice\r\n\r\n[b]Steadfast Heat Shield[/b]\r\nEffect: Negates up to 60 points of spell damage or effects.\r\nBase Cost: 36 per second.\r\nRank: Apprentice\r\n\r\n[b]Greater Heat Shield[/b]\r\nEffect: Negates up to 80 points of spell damage or effects.\r\nBase Cost: 49 per second.\r\nRank: Adept\r\n\r\n[b]Grand Heat Shield[/b]\r\nEffect: Negates up to 100 points of spell damage or effects.\r\nBase Cost: 63 per second.\r\nRank: Expert\r\n\r\n\r\n\r\n[b]POTENT SPELLS:[/b] I also created a few higher level versions of vanilla spells, to add more choice later in game. Firespout is similar to the novice \\'\\'Flames\\'\\' concentration spell, howver deals higer damage. The Potent Fire Rune is also much like the standard Fire Rune, but as well as doing more damage it can also be placed further away. The Potent Flame Cloak is similar to the standard, however does much more damage and also has a new visual effect. The 8th picture shows this spell (notice the smoke). As you run around you leave a trail of smoke in your wake which I find amusing :)\r\n\r\n[b]Firespout[/b]\r\nEffect: A gout of fire that does 24 points per second. Targets on fire take extra damage.\r\nBase Cost: 49 per second.\r\nRank: Adept\r\n\r\n[b]Potent Fire Rune[/b]\r\nEffect: Cast on a nearby or distant surface, it explodes for 100 points of fire damage when enemies come near.\r\nBase Cost: 503\r\nRank: Expert\r\n\r\n[b]Potent Flame Cloak[/b]\r\nEffect: For 60 seconds, opponents in melee range take <24> points fire damage per second. Targets on fire take extra damage.\r\nBase Cost: 289\r\nRank: Expert\r\n\r\n\r\n\r\n\r\n[b]A few other things to note:[/b]\r\n\r\n- All of the spells can be bought from both Faralda and Enthir at the College of Winterhold.\r\n\r\n- All of the \\'Fire and Forget\\' (not concentration) spells have cast times (time it takes to charge a spell in the hand) of 0.2 seconds. This is done so that it will be consistant with my mod [url=http://steamcommunity.com/sharedfiles/filedetails/?id=172975640]A Hypothetical Treachery[/url]. For a comparison, vanilla unmodded destruction spells have cast times of 0.5 seconds.\r\n\r\n- This mod was made with my other mod [url=http://steamcommunity.com/sharedfiles/filedetails/?id=172975640]A Hypothetical Treachery[/url] in mind. Although it is not necessary, I highly recommed using them both together.\r\n\r\n- I will be adding a few more spells to this pack in the future, so keep checking back every now and then.\r\n\r\nThat\\'s all! Enjoy! :)",
  "categoryId": "75",
  "version": "1.0",
  "author": "TheGreyLight",
  "createdUnix": "1382949599",
  "updatedUnix": "1382949596",
  "containsAdultContent": false,
  "uploadedBy": "TheGreyLight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000071761",
      "name": "Pyromage",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Pyromage-45764-1-0.7z",
      "uploadedUnix": "1382949596",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bbe8285930a446dffe20bdede311102398a31a53acf8bdea241e6a229bc41dec/analysis/1407772745/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pyromage-45764-1-0.7z?fid=1000071761&ttl=1535826199&ri=8192&rs=8192&setec=e58c7e89b6ec72edc3062b32fce75aff"
    }
  ]
}