{
  "modId": 45772.0,
  "modName": "Dark Mansion - A Vampire Player Home and Companions",
  "summary": "Player Home with two FAMOUS companions!",
  "descriptionHtml": "NOTE: This mod CLAIMS to require asaharamerchant.esm, but I tested it without that (it uses NOTHING from that files, not sure how it even got in there) and it did NOT crash. However, if your game CTDs on startup with this mod installed, try getting this mod: http://skyrim.nexusmods.com/mods/5577//?\r\n\r\n\r\n\r\nOk, so here is a pretty large player home located just outside of falkreath (see map image for location).\r\n\r\nI have it listed as adult only because there is A LOT of gore involved, and the 2 companions have a pretty sick background, which I will explain shortly.\r\n\r\nThe house has 6 areas. Ground floor, basement, 2nd floor, attic, east wing, west wing.\r\n\r\nThe ground floor has 2 towers leading to the 2nd floor. The kitchen, which has a dead meat sack in it (lol). The dining room, which also has a dead meatsack spread out on a table, waiting to be ate by any passing vampires. In the eastern tower, you will find a trapdoor leading to the basement.\r\n\r\nIn the basement is 3 more meat sacks, and the companion Gilles De Rais.\r\n\r\nThe east wing is accessible from the ground floor. It is mostly empty. There are 4 usable beds for your other followers/servants, a sitting area and Elizabeth Bathory\\'s room. None of the items in her room are usable, they are all static, except for her. She is the second follower.\r\n\r\nThe second floor hosts the library where you can find a secret entrance to the attic. (Turn the candle stick). The living area is also found on the second floor, as well as the door to the west wing.\r\n\r\nIn the attic, you\\'ll find 4 meat sacks and 3 usable coffins to sleep in, as well as a blood crying angel and a strange shrine.\r\n\r\nIn the west wing is the display and work area. 15 diaplay cases (mix of large and dagger size), 1 wall palque, 12 mannequins, fully functional forge, enchantment table, alchemy lab and dragon priest busts! You\\'ll also find a chest filled with EVERY enchantment available in base/dawngaurd! (If you think the chest is a cheat chest, just don\\'t use it...)\r\n\r\nNow, for a little history lesson....\r\n\r\nLord Gilles De Rais. He fought along side Saint Joan of Arc. He was in love with her. And when they burned her at the stake for crimes she didn\\'t commit, he went a little bit crazy. He turned his back on god and began worshiping demons (and the devil). He is the first ever recorded serial killer in history. He supposedly murdered over 200 children from a village nearby his manor (or castle?). Some believe he did not commit the crimes of which he was accused, and the church used their power to have him killed due to his hatred for them due to the death of his beloved. He was accused of worshiping Beelzebub, the murders and rape of countless children, and put to death in the year 1440.  He has since been depicted as a vampire in things such as Castlevania video games, movies, and the Death metal band, Cradle of Filth, have an entire album dedicated to him (Godspeed on the Devils Thunder) and the crimes he (supposedly) committed.\r\n\r\nCountess Elizabeth Bathory. The Blood Countess. Countess Bathory. She was accused of sickening crimes as well, though again, there are those who believe the accusations were fraud. She was accused of hiring young women without families as servants in her castle after her husbands death, and killing them. Then, she would supposedly bathe in their blood. Bathing in the blood of virgins, a ritual in attempt to make herself remain young forever, eternally beautiful. One witness claimed over 650 victims, though she was convicted for 80. Due to her rank as Countess, she was supposedly never actually tried nor convicted, but promply imprisoned upon her arrest in 1610. She was imprisoned in her own castle, also due to her rank of Countess, until her death 4 years later.\r\n\r\nThe conspiracy about Bathory is not that of the church, but a king who owed her late-husband a large sum of money he could not pay. Some believe this is what led to her being accused of such atrocities. \r\n\r\n\r\nCREDITS:\r\n\r\ntamira & stroti for manor resource\r\nyourenotsupposedtobeinhere for rug resource\r\nlazyskeever for windows\r\nrunspect for many, many resources\r\ntroti & tamira for organ\r\nmadamspades for gothica dress\r\nmathanas for butler outfit",
  "categoryId": "67",
  "version": "1.0",
  "author": "Saint Grimm",
  "createdUnix": "1382968067",
  "updatedUnix": "1382966332",
  "containsAdultContent": true,
  "uploadedBy": "saintgrimm92",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000071819",
      "name": "Vampire Mansion",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "152260",
      "fileName": "Vampire Mansion-45772-1-0.rar",
      "uploadedUnix": "1382966332",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bdb9b773b1d672b85fbebd78751dd18072fad718a9cad0e773f36d20d700441f/analysis/1407772874/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampire%20Mansion-45772-1-0.rar?fid=1000071819&ttl=1535826205&ri=8192&rs=8192&setec=bc543ea8280d622440e790185feaf617"
    }
  ]
}