{
  "modId": 45780.0,
  "modName": "Linear Smithing Tree",
  "summary": "Linear Smithing alters the Smithing perk tree in such a way that removes the need to choose between heavy and light. Relevant perks have been combined into new ones that allow you to craft items from both sides of the tree. No more having to choose between heavy and light Smithing. Works on existing characters.",
  "descriptionHtml": "[center][img]http://i.imgur.com/Oh1KZft.png[/img][/center]\r<br />\r<br />For my first foray into modding, I decided to fix something that has always annoyed me about Skyrim. In the vanilla Smithing tree, you have two paths: light and heavy. This means that if you followed the heavy side of the Smithing tree, you would have the ability to craft high-level armor and weapons such as Ebony or Daedric, but be completely unable to craft anything from light materials, such as Elven or Glass items. Linear Smithing replaces the existing perk tree with one that&#39;s completely linear, so you get benefits from both sides of the perk tree for the same amount of perk points. \r<br />\r<br />One of the goals of this mod was to keep the original balance of the game intact, so all the new perks have the same skill prerequisites as their original counterparts, with the exception of Expert Smithing, which has a Smithing prerequisite of 75 (between Ebony and Glass). This mod does not affect the ability to improve weapons and armor.\r<br />\r<br />New perks added by Linear Smithing:\r<br />\r<br />- Novice Smithing. Allows you to craft Steel items.\r<br />\r<br />- Apprentice Smithing. Allows you to craft both Dwarven and Elven items. Requires a Smithing skill of 30.\r<br />\r<br />- Journeyman Smithing. Allows you to craft Orcish, Plate, and Scaled items. Requires a Smithing skill of 50.\r<br />\r<br />- Expert Smithing. Allows you to craft both Ebony and Glass items. Requires a Smithing skill of 75.\r<br />\r<br />- Master Smithing. Allows you to craft Daedric items. Requires a Smithing skill of 90.\r<br />\r<br />- Dragon Smithing. Allows you to craft Dragon armor and Dragonbone weapons. Requires a Smithing skill of 100.\r<br />\r<br />- Arcane Smithing. Untouched from the vanilla game. Remains an optional perk that can be found at the base of the tree. Allows you to improve magical weapons and armor. Requires a Smithing Skill of 60.\r<br />\r<br />Novice Smithing, Apprentice Smithing, Journeyman Smithing, and Expert Smithing will also allow you to craft their Solstheim equivalents from the Dragonborn DLC: Bonemold, Chitin, Nordic, and Stalhrim.\r<br />\r<br />All perks are completely compatible with existing items [color=red][b]as well as items added by mods, such as Immersive Armors and Immersive Weapons.[/b][/color] Each perk you purchase unlocks the corresponding perks from the vanilla game behind the scenes to ensure full compatibility with all items made to function with them.\r<br />\r<br />In addition, this mod is fully compatible with existing characters. The mod will automatically detect what vanilla perks you have unlocked, and grant you the corresponding perks from this mod.\r<br />\r<br />This mod [b]requires Dawnguard[/b] in order to work.\r<br />\r<br />This mod, at least in theory, should be compatible with any mod that doesn&#39;t alter the Smithing perk tree. But I&#39;m a rookie modder, so unexpected results are possible.\r<br />\r<br />Installation is simple. Just add the LinearSmithing.esp to your Skyrim/Data folder. You can also use the Nexus Mod Manager. To uninstall, just remove the LinearSmithing.esp from your Skyrim/Data folder. The worst possible side effect is you having some extra Smithing perks upon uninstallation, which can easily be removed using the console.\r<br />\r<br />I hope you all enjoy this mod as much as I do. It was something I&#39;ve always wanted fixed, and I&#39;m glad I was able to do it.\r<br />\r<br />[b][SIZE=7]My Other Mods:[/SIZE][/b]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/53751/?][center][img]http://i.imgur.com/kSAnZiF.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/65607/?][center][img]http://i.imgur.com/uX3g6JA.jpg[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/76949/?][center][img]http://i.imgur.com/wt24bOb.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/79045/?][center][img]http://i.imgur.com/bh3nfCC.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66995/?][center][img]http://i.imgur.com/0fPggDT.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66055/?][center][img]http://i.imgur.com/KK7LOim.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50294/?][center][img]http://i.imgur.com/o1vzSpP.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66196/?][center][img]http://i.imgur.com/hObIhrQ.png[/img][/center][/url]\r<br />[center][img]http://i.imgur.com/V0ICmGW.png[/img][/center]",
  "categoryId": "73",
  "version": "v1.0",
  "author": "Robbie922004",
  "createdUnix": "1382985245",
  "updatedUnix": "1382985049",
  "containsAdultContent": false,
  "uploadedBy": "Robbie922004",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000071901",
      "name": "Linear Smithing",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Linear Smithing-45780-v1-0.rar",
      "uploadedUnix": "1382985049",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4b1fe0ae185a8ea0203af263e4f24907803cfb971aae9d7ea117b6781bc4a6d3/analysis/1407773010/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Linear%20Smithing-45780-v1-0.rar?fid=1000071901&ttl=1535826213&ri=8192&rs=8192&setec=7144fa13b6c4bf815798c1f20aca0112"
    }
  ]
}