{
  "modId": 45795.0,
  "modName": "Sleep in their beds - Brill and Vignar Companions Edition",
  "summary": "Allows you to make use of Brill and Vignar\\'s bedroom by using their beds and removing ownership of items in the room",
  "descriptionHtml": "So you\\'re now a \\'Companion\\', maybe even the Harbinger! What does that mean?\r\nIt means evenings spent eating and drinking well into the night, until you\\'re so drunk you can barely stand!\r\nWell, now you don\\'t have to stagger down the stairs and attempt to navigate the hallways of the downstairs bedrooms in your drunken state anymore! You can simply head on in to Brill and Vignar\\'s room and crash on one of their beds, picking up all their stuff along the way! :D\r\n\r\n---WHAT THIS MOD DOES---\r\n- enables you to sleep in both beds in Brill\\'s and Vignar\\'s room. The double bed will now sleep two, so you\\'re able to sleep there with your spouse as well.\r\n- removes ownership of the items in their rooms, so now you can take their stuff without having to steal it. (and if you find any I\\'ve accidentally missed, please let me know!)\r\n- Have placed a new book on the desk, as a tribute to \\'Ki\\'Darga\\' (for whom this mod was originally made) The book is titled \\'A Tale of Intrique\\' and is written by Ki\\'Darga himself. :)\r\n\r\n****\r\nThis mod is fully compatible with my other Sleep in their Beds - Farkas & Vilkas\r\n\r\nhttp://skyrim.nexusmods.com/mods/34823/?\r\n\r\n****\r\nIf you\\'d like to get to know Ki\\'Darga and have him as a follower, you can find him here\r\n\r\nhttp://skyrim.nexusmods.com/mods/45464/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D45464%26preview%3D&pUp=1\r\n\r\n****\r\n---REQUIREMENTS---\r\nNo DLC is required. However you do need to have joined the Companions to be able to take their stuff without stealing it.\r\n\r\n---PROBLEMS/COMPATIBILITY ISSUES---\r\nThe only issue is that other Companions will also use this room & may also decide to sleep in the beds. So don\\'t be surprised if you wake up beside Skjor...or Tilma! XD\r\n\r\n---INSTALL---\r\ndownload with NMM or for manual install, simply download, unzip and drop file into Skyrim/DATA directory\r\n\r\n---UNINSTALL---\r\nto uninstall manually, simply delete .esp file from skyrim/DATA directory\r\n\r\n======================================================================\r\n\r\nConstructive feedback and bug/issue reports are always welcome! Trolling IS NOT!\r\n\r\n==========================CREDITS==============================\r\n\r\nA HUGE THANKYOU to Binmaru - not only for testing this mod for me, but also for allowing me to use \\'Ki\\'Darga\\'s story\\'. Your feedback, suggestions and support is greatly appreciated! :)\r\n\r\nand of course, credits and thanks to Bethesda for Skyrim and the Creation Kit!",
  "categoryId": "25",
  "version": "1.0",
  "author": "Lordess",
  "createdUnix": "1383010201",
  "updatedUnix": "1383010189",
  "containsAdultContent": false,
  "uploadedBy": "Lordess",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000072009",
      "name": "Sleep in their beds - Brill and Vignar",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Sleep in their beds - Brill and Vignar-45795-1-0.rar",
      "uploadedUnix": "1383010189",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6025256151cd94a43ed6e9ad4cd4e88f5d6db514d2f18958db77ad50b03bde1a/analysis/1407773419/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sleep%20in%20their%20beds%20-%20Brill%20and%20Vignar-45795-1-0.rar?fid=1000072009&ttl=1535826226&ri=8192&rs=8192&setec=744c0507d0c4b442f6ea59d8bc7c2d64"
    }
  ]
}