{
  "modId": 45796.0,
  "modName": "Larceny - Pickpocketing Remastered",
  "summary": "Larceny aims to fix everything wrong with pickpocketing. With this mod installed, pickpocketing will not only be a viable and worthwhile skill, but one of your favorite and most used, I assure you. ",
  "descriptionHtml": "[img]http://static2.nexusmods.com/110/mods/110/images/45796-5-1383012434.jpg[/img]\r\n\r\nFeel like raking in the dough? This mod is for you! \r\n\r\n\r\nThe main idea behind it was to give pickpocketing a much needed boost in effectiveness and usefulness. This is achieved through multiple changes to the overall pick-pocketing system as well as several new and very useful perks. You will find pick-pocketing to be now an enjoyable and highly worthwhile experience, but most importantly, it will be VERY rewarding. \r\n\r\n\r\n\r\nWHAT IT DOES: \r\n\r\n- Raises the pickpocket chance \\'cap\\' from 90% to 99% \r\n\r\nNow when you are a master pickpocket, you will only have a very very small chance of getting caught compared to the substantial 10% chance that plagued the skill previously. \r\n\r\n\r\n\r\n- Adds a new rank to the perk \\'Extra Pockets\\' \r\n\r\nIn my opinion, one of the greatest perks in the game. \\'Extra Pockets\\' now has two ranks, the second being unlocked at skill level 70 and grants an extra 150 points of carry weight coming to a total of 250 points between the two perks. \r\n\r\n\r\n\r\n- Adds an entirely new perk \\'Larceny\\' \r\n\r\nPerhaps the most important aspect of this mod, Larceny is a perk that functions in a similar way to \\'Golden Touch\\' in the lock-picking perk tree. In essence, it will allow you to find MUCH much more money and items on nearly all NPCs. The amount of money and expensive items a particular NPC has is randomly generated in a similar style to how their inventories are normally calculated, so you will find a different amount each time. NPCs can now have up to 120+ gold on their person along with several pieces of jewelry (possibly enchanted) and perhaps a gem or two. This is obviously a significant increase and will affect nearly all NPCs. Some exceptions exist, mostly due to them having special quest related inventories. Guards will now also carry hefty wallets full of money, with this perk enabled. Remember, the perk is required for all of this to occur. The perk can be taken at level 50 if \\'Cutpurse\\' has been taken. \r\n\r\n\r\n\r\nNOTE: If you take the \\'Larceny\\' perk and notice no increase in the amount of gold people are carrying, it is because you need to give the NPC\\'s time to reset. Their inventories won\\'t change automatically as soon as you take the perk. I recommend going to a different area that you haven\\'t been to in a while or perhaps waiting a few days (in game). \r\n\r\n\r\n\r\nThis video was not made by me. I simply found it on youtube, but It shows the main feature of the mod pretty well. Hopefully the uploader doesn\\'t mind.\r\n[youtube]Yn3NgE4wQ8Q[/youtube]",
  "categoryId": "79",
  "version": "1.0",
  "author": "TheGreyLight",
  "createdUnix": "1383012891",
  "updatedUnix": "1383012888",
  "containsAdultContent": false,
  "uploadedBy": "TheGreyLight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000072030",
      "name": "Larceny",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Larceny-45796-1-0.7z",
      "uploadedUnix": "1383012888",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7423ee350d93a3f1e8ac5973389519e96df41c893f3c5b86b77ecfc9c0fe6572/analysis/1407773495/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Larceny-45796-1-0.7z?fid=1000072030&ttl=1535826227&ri=8192&rs=8192&setec=260ce9e0f125929d5d8d9e7f73a31277"
    }
  ]
}