{
  "modId": 45791.0,
  "modName": "The Decrepit Tower",
  "summary": "A short, three cell dungeon which is a part of a larger mod. ",
  "descriptionHtml": "The Decrepit Tower is an old, collapsed imperial fort which has been overrun by a group of necromancers and warlocks.  The majority of the fort was constructed underground and, as a result, the dungeon is extremely dark.  This is intentional.  The fort is also located near a small lake, so it's possible that portions of it may be flooded...\r\n\r\nThis dungeon was inspired by Zelda's dungeon layouts, specifically the usage of \"small keys.\"  Within the Decrepit Tower are a series of keys which unlock all the doors, and they cannot be unlocked without them.  In order to progress through the dungeon, you will need to find the three keys.  There is not specific lore or scenes associated with this mod, it was customized to be a stand-alone dungeon.  \r\n\r\nIt is located across the river from the Guardian Stones, as shown in the map.  \r\n\r\n\r\nIt is also part of a larger mod which will be released at a later date.  I want to periodically release portions of what I've been working on to a) receive feedback and b) have something to show for my work.  This dungeon should be fully compatible with all the DLC and any mods, unless there is a mod which manipulates the land where the tower is located.  Keep in mind; however, the dungeon is extremely dark, so if you use a lighting mod, it may be too much.  \r\n\r\nHope you guys and gals enjoy it!  Leave comments for feedback!\r\n\r\nDecrepitTower01\r\nDecrepitTower02\r\nDecrepitTower03\r\n",
  "categoryId": "91",
  "version": "1.0",
  "author": "Zetterbeard",
  "createdUnix": "1383001487",
  "updatedUnix": "1383001482",
  "containsAdultContent": false,
  "uploadedBy": "burkemi5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000071994",
      "name": "DecrepitTower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "98",
      "fileName": "HVGQuest1Dungeon-45791-.zip",
      "uploadedUnix": "1383001482",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4e0745ea6c0a63ee7126fad2f021bb27cf8c379952986c4adc205f3e05312042/analysis/1407773291/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HVGQuest1Dungeon-45791-.zip?fid=1000071994&ttl=1535826223&ri=8192&rs=8192&setec=053063465ee6f8ca6da0d2e74e10742a"
    }
  ]
}