{
  "modId": 45891.0,
  "modName": "Lakeview Manor - WarlockBGone",
  "summary": "Despite the fact that the area around Lakeview Manor is swarming with bandits, giants, and magical animals, people seem to REALLY get worked up about the Warlock that hangs out at Conjurer's Altar. There's a mod that eliminates the Altar altogether, but I thought it might be better to just disable the Warlock in the creation Kit so you can 1) still",
  "descriptionHtml": "Name: Lakeview Manor - WarlockBGone \r\nVersion: 1.0\r\nDate: 10/29/2013\r\nCategory: Locations - Vanilla\r\nAuthor(s): Mogomra\r\n\r\nDescription\r\n===========\r\n\r\nDespite the fact that the area around Lakeview Manor is swarming with bandits, giants, and magical animals, people seem to REALLY get worked up about the Warlock that hangs out at Conjurer's Altar. There's a mod that eliminates the Altar altogether, but I thought it might be better to just disable the Warlock in the creation Kit so you can 1) still pick up the Conjuration Skill Book at the altar and 2) retain the altar for your own character's uses. This mod comes in two different versions; the Default Version leaves Conjurer's Altar as it is in the un-modded game, while the Clean Altar variant cleans up all of the bones, skulls, and embalming tools that normally litter the area.\r\n\r\nPlease note that if you install this mod AFTER you have already started a new game, there is a good chance that a Warlock will have spawned in the time interval between the last time you visited the Conjurer's Altar and when you installed this mod. In that case, you'll just need to kill the Warlock one last time, and then you *shouldn't* have to worry about seeing him again.\r\n\r\n\r\nInstall\r\n=======\r\n\r\n1. Copy the .esp files to (install folder)\\Skyrim\\Data.\r\n2. Start the Nexus Mod Manager, click 'Data Files', and place a checkmark beside the .esp file that you want to use.\r\n3. You only want to use ONE of the included .esp files - activating both will lead to instability and possible CTDs!\r\n\r\n\r\nUninstall\r\n=========\r\n\r\n1. Start the Nexus Mod Manager, click Data Files, and uncheck the .esp file you originally selected.\r\n2. Delete the .esp file from (install folder)\\Skyrim\\Data.\r\n\r\n\r\nIncompatibility\r\n===============\r\n\r\nThis mod will probably conflict with mods that change the Conjurer's Altar or any of the objects and creatures in the immediate vicinity of the altar.\r\n\r\n\r\nHistory\r\n=======\r\n\r\n1.0 - 10/29/2013 - Initial release.\r\n\r\n\r\nCredits\r\n=======\r\n\r\nThanks to Bethesda for creating The Elder Scrolls Series and the Creation Kit!\r\n\r\nThanks to the Nexus for providing a one-stop-shop resource for authors and players AND providing an excellent tool for easily installing and removing Mods!\r\n\r\nThanks to everyone on Youtube and the internet at large for putting together videos and tutorials about the Creation Kit to help people create their own mods!\r\n\r\nSpecial thanks to DanielCoffey and doccdr for creating the excellent \"Book Covers Skyrim\" mod, which can be seen in the screen shot focusing on the copy of '2920, Volume 09 - Hearth Fire' that you can find at this location! It's one of the best mods on the Nexus and will make you fall in love with the books in Skyrim all over again!\r\n\r\nThanks to LHammonds for the Readme Generator this file was based on!",
  "categoryId": "90",
  "version": "1.0",
  "author": "Mogomra",
  "createdUnix": "1383107682",
  "updatedUnix": "1383107679",
  "containsAdultContent": false,
  "uploadedBy": "Mogomra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000072575",
      "name": "Lakeview Manor - WarlockBGone",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Lakeview Manor - WarlockBGone-45891-1-0.7z",
      "uploadedUnix": "1383107679",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ee795ac4a72ebd818590817f7acc6611ac628a20a42a02c08bf6cca94d04579a/analysis/1407774795/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20Manor%20-%20WarlockBGone-45891-1-0.7z?fid=1000072575&ttl=1535826291&ri=8192&rs=8192&setec=1658d75ded7f112f438612f646489faa"
    }
  ]
}