{
  "modId": 45911.0,
  "modName": "DLC Weapon and Armor Weight Overhaul",
  "summary": "Adjusts the weight values of weapons and armor in the Dragonborn DLC to realistic values and in line with adjustments made by JBSchroeds in his Complete Weight Overhaul and Complete Mundane Overhaul mods.  (Links in the description.)",
  "descriptionHtml": "Because I love the mods made by JBSchroeds and because he does not own the two main DLCs for Skyrim, I went ahead and learned how to make some very basic mods that adjust the weight values of weapons and armor to be in line with the adjustments he made in his mods.  If he ever decides to make patches for his mods to include Dawnguard and Dragonborn, I will take these mods down.  This mod is nowhere near as ambitious as those mods and only adjusts weapon and armor values.  If there is demand for it, I will extend those adjustments to other items in the expansions.\r\n\r\nHere is a list of some armor and weapon materials I adjusted for the Dragonborn expansion:\r\n\r\n-Nordic  (Made them slightly heavier than steel, as steel is a major component for this type of equipment.)\r\n\r\n-Stalrim  (Made the light version equivalent to glass, as they are almost identical in weight in the vanilla version of the game.  The heavy version is similar to ebony in weight, with some variations.)\r\n\r\n-Bonemold  (Standard version is slightly lighter than steel and the improved version is slightly lighter then Dwarven)\r\n\r\n-Chitin  (After reading the book \"Ice and Chitin\", which can be found in Morrowind, Oblivion, and Skyrim, I decided to make chitin armor similar in weight to elven armor.)\r\n\r\nI also included as many artifacts as I could think of and matched them to there material weights.  I'm sure I may have missed some though, so if you notice any, leave a comment in the comment section.\r\n\r\nAt this point, I have only made adjustments to Dawnguard weapons and armor, including the crossbows.  I have adjusted some of the artifacts, but not all.  I will update this mod when I get the chance to modify the rest and the vampire armor.  Dawnguard weapons and armor were made the equivalent of improved steel armor in weight, with some small exceptions.\r\n\r\nHere are the links to JBSchroeds mods:\r\nhttp://skyrim.nexusmods.com/mods/17465/?\r\n\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=72349152&searchtext=complete+mundane+overhaul\r\n\r\nsteamcommunity.com/sharedfiles/filedetails/?id=15572\r\n",
  "categoryId": "79",
  "version": "1.0",
  "author": "Information769",
  "createdUnix": "1383146994",
  "updatedUnix": "1383146346",
  "containsAdultContent": false,
  "uploadedBy": "kanick3000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000072715",
      "name": "Weight Overhaul DB",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Weight Overhaul DB-45911-1-0.zip",
      "uploadedUnix": "1383146295",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b1968a9e42728fc554305051d5306f9c791d4dce383e3b32d5d4a63bd849dfcb/analysis/1407775089/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weight%20Overhaul%20DB-45911-1-0.zip?fid=1000072715&ttl=1535826304&ri=8192&rs=8192&setec=50eaba0c3d91798596e638d23bd02de1"
    },
    {
      "fileId": "1000072717",
      "name": "Weight Overhaul DG",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Weight Overhaul DG-45911-1-0.zip",
      "uploadedUnix": "1383146346",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8fbcda22ae863b3e514cb6db77e2db0b4375634cb8049cd2ac47d373cb68db24/analysis/1407775090/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weight%20Overhaul%20DG-45911-1-0.zip?fid=1000072717&ttl=1535826305&ri=8192&rs=8192&setec=f2bcb7986b756ebed1e5a2970ae748ec"
    }
  ]
}