{
  "modId": 46035.0,
  "modName": "Nor-Elves Race",
  "summary": "War between the Nords and the Elves has raged for generations in one form or another. Prejudice abounds. Out of that fighting comes the Nor-elves, a mixed race of Elves and Norse. Will they step into the role of Dragonborn to preserve or destroy Skyrim?",
  "descriptionHtml": "Often, war results in the mixing of races as differing people become introduced to each other. Most recently a mixed race to emerge is the Nor-Elves. Often, they live alone in the forests of Skyrim, cast out by shamed family members, who for one reason or another, had children of mixed race. Some Nor-elves are bitter about their lot, others prefer the freedom that solitude provides. It is up to you to decide how your Nor-elf will feel and act as Dragonborn!\r\n\r\nStarting skills:\r\nAlteration 5\r\nArchery 5\r\nDestruction 10\r\nEnchanting 10\r\nIllusion 5\r\nLight Armor 10\r\nSneak 10\r\nPlus a bit more life and a bit more magica. My goal was to have them hardy and able to fight, but not be so overpowered that the game isn't fun.\r\n\r\nNOTE: This is really a re-make of my favorite race, the Bretons. I just thought it would be nice if they were a little more elvish, with a few tweaks here and there.  \r\n\r\nIf you want your Dragonborn to look like mine, I suggest these luscious mods and all of them are on Nexus so please copy the name and paste in the search and viola! (don't forget to endorse!). Not having these mods shouldn't cause it to not work, however, it will make them kinda not so pretty:\r\n-ApachiiSkyhair by Apachii (THIS IS THE ONLY ONE THAT IS REQUIRED - GET THEM) http://skyrim.nexusmods.com/mods/10168/?\r\n\r\n-The Eyes of Beauty by Lograam\r\nhttp://skyrim.nexusmods.com/mods/13722//?\r\n\r\n-Better Male Presets by Sundys\r\nhttp://skyrim.nexusmods.com/mods/15641/?\r\n\r\n-Bretonnia by Fastest dog \r\nhttp://skyrim.nexusmods.com/mods/35678//?\r\n\r\n-Fallout Hair pack Fixed with NPCEditor Support Standalone by Dragonage7\r\nhttp://skyrim.nexusmods.com/mods/22816/?\r\n\r\n-Better males - beautiful nudes and faces - new hairstyles - Favored Soul Meshes Flaccid version\r\n\r\n-Dimonized UNP Female body by Dimon99\r\nhttp://skyrim.nexusmods.com/mods/6709/?\r\n\r\n-Ethereal Elven Overhaul (a must for elves that don't look weird) by Nuska\r\nhttp://skyrim.nexusmods.com/mods/24273/?\r\n\r\n-SG Female Textures Renewal - SG Textures Renewal UNP\r\nhttp://skyrim.nexusmods.com/mods/35267//?\r\n\r\n-Smooth Faces for Ladies and Gents (Males only pack)\r\nhttp://skyrim.nexusmods.com/mods/1971/?\r\n\r\n-Joseph Anthony's lip gloss for better females by Joseph anthony\r\nhttp://skyrim.nexusmods.com/mods/13860/?\r\n\r\n-Fine face textures for men by Urshi\r\nhttp://skyrim.nexusmods.com/mods/27815\r\n\r\nI also have used:\r\n-Race Menu by Expired6978 (works best wit Ethereal overhaul)\r\n-Random Alternate Start by Syclonix (because I like to shake things up)\r\n\r\nThis is my first time releasing something like this. AKA I DON'T KNOW WHAT I'M DOING. That said, I'll do my best to support you and listen to people's thoughts and comments.",
  "categoryId": "34",
  "version": "1.0",
  "author": "Mclinorama",
  "createdUnix": "1383278414",
  "updatedUnix": "1383278405",
  "containsAdultContent": false,
  "uploadedBy": "mclinorama",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000073459",
      "name": "Nor Elves",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Nor Elves-46035-1-0.zip",
      "uploadedUnix": "1383278405",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7550d8da1bfbb35f1fc46930c7cce21285dbf50b229e7e22d9f3b9ecddafd83d/analysis/1407776974/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nor%20Elves-46035-1-0.zip?fid=1000073459&ttl=1535826395&ri=8192&rs=8192&setec=b262e07fd0d68c5c457bc9680f338cce"
    }
  ]
}