{
  "modId": 46081.0,
  "modName": "Path of the Divine",
  "summary": "Tread the path of the pilgrim in this small quest which aims to expand the the presence of the Nine Divines in Skyrim. Complete a pilgrimage to the shrines of the divine, discover lost scriptures and unlock the power of the Divine Prayer. A powerful and fully customisable ability which will greatly increase your combat prowess.",
  "descriptionHtml": "[center][color=Red][font=Tahoma][size=10][b]Path of the Divine[/b][/size][/color][/font][/center]\r\n[center][color=Red][font=Tahoma][size=6][b]May the Nine smile upon you[/b][/size][/color][/font][/center]\r\n\r\n[center][color=Red][font=Tahoma][size=4][b]Introduction[/b][/size][/font][/color][/center]\r\n[line]\r\nWhen it comes to the Nine Divines in Skyrim, they are little overlooked in terms of their effects on gameplay. Beyond wearing an amulet and praying at a shrine, the presence of their religion is a little lacking. Path of the Divine aims to remedy this with a small quest and a new ability, the Divine Prayer. “What’s so special about a new ability?” I hear you ask. Well the Divine Prayer is an expandable and fully customisable spell which will grow as the quest progresses. By finding ancient scriptures and completing pilgrimages you will be able expand the Prayer to suit your needs.  \r\n\r\n[center][color=Red][font=Tahoma][size=4][b]Walk-through[/b][/size][/font][/color][/center]\r\nI would recommend reading the entire walkthrough before using the mod in order to get the best understanding as to how it works. However if you are impatient then you could just skip to summary at the end.\r\n\r\n[u][B]Starting the quest[/b][/u]\r\nTo begin the quest, journey to Forgotten Shrine location located to the north of Solitude. Search for the hatch, it can easily be missed so look carefully, and enter the shrine. This will begin the quest, from here simply follow the instructions given in the journal.\r\n\r\n[u][B]The Divine Prayer[/b][/u]\r\nThe prayer is granted after reading the Translation Notes, however at this point it is useless. You will first need to complete a pilgrimage or find a scripture in order to get any effects. The Prayer itself consists of a god dedication and three verses, with each of the four parts granting a buff. \r\n[b]The God Dedication[/b] will provide you with a blessing you would receive from a standard shrine.\r\n[b]Verse One[/b] will provide you with a boosts in either your health, magicka or stamina regeneration.\r\n[b]Verse Two[/b] will provide a boost to the damage dealt by either your melee weapons, ranged weapons or spells\r\n[b]Verse Three[/b] will provide you with a resistance against either physical harm, elemental damage or poison & disease.\r\n\r\n[u][B]Using the Prayer[/b][/u]\r\nThe Prayer lasts for 4 hrs and is classed as a power, so it can only be used once per day. Initially, however, the prayer will be useless as no options having been chosen for the God or the Verses. Once you have acquired some scriptures or completed some pilgrimages then the prayer is ready to be customised at the Forgotten Shrine.\r\n\r\n[u][B]Using the Shrine[/b][/u]\r\nThe shrine consists of two main parts; the [b]God Shrines[/b] and the [b]Doctrine of Invocation[/b]. They will both need to  \r\n\r\n[b]God Shrines:[/b] These shrines first require a Pilgrimage to be performed in order to activate them. The locations that you will need to travel to are shown in the quest. Once activated they will dedicate your prayer to the chosen god. Having the Divine Prayer dedicated to a god will grant you their blessing when the prayer is used. E.g. having it dedicating to Talos will reduce the time between shouts when the prayer is used.\r\n\r\n[b]The Doctrine of Invocation[/b] when activated will allow you to change which scripture has been assigned to each of the three Verses. It will also detail which scriptures are currently assigned to the Divine Prayer. Should you find any testaments, litany's or tomes in your journeys, this is where you return them to. Additionally, any scriptures you find will automatically be placed on the shelves in the side chamber of the Forgotten Shrine. Activating these will display the effects of each of scroll.\r\n\r\n [u][B]Summary[/b][/u]\r\nThe following steps list the basic steps that you will need to perform in this mod. Once again, I strongly recommend reading the whole walkthough first.\r\n[list]\r\n[*]1. Head to the Forgotten Shrine, found North of Solitude.\r\n[*]2. Enter the shrine to begin the quest, find both of the books that the quest points to.\r\n[*]3. Journey to a wilderness shrine (quest markers will point these out) and activate it and/or continue your adventures until you find some scriptures (can be found in 'boss chests' or as special loot.\r\n[*]5. Return to the Forgotten Shrine, activate the Doctrine of Invocation to store any found scriptures.\r\n[*]6. Use the menu to customise the Verses, and the God shrines to change the God Dedication.\r\n[*]7. Use Divine Prayer.\r\n[*]8. Repeat steps 3-7 until you have visited all shrines and found all of the scriptures.\r\n[/list]\r\n\r\n[center][color=Red][font=Tahoma][size=4][b]Requirements & Compatibility[/b][/size][/font][/color][/center]\r\nThe Path of the Divine requires no other mods or DLC to work. There are also no known compatibility issues.",
  "categoryId": "35",
  "version": "1.0.1",
  "author": "Madrilous",
  "createdUnix": "1384007620",
  "updatedUnix": "1384091034",
  "containsAdultContent": false,
  "uploadedBy": "Madrilous",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000077010",
      "name": "Path of the Divine ",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "131",
      "fileName": "Path of the Divine -46081-1-0-0.rar",
      "uploadedUnix": "1384007614",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/68806b322833d5e8d66cf3ab4e43290158e6b1bfcc6039bf02432317836c8c1f/analysis/1407786429/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Path%20of%20the%20Divine%20-46081-1-0-0.rar?fid=1000077010&ttl=1535826436&ri=8192&rs=8192&setec=c3c23752634b4ffb03c491a2bfd2d82a"
    },
    {
      "fileId": "1000077284",
      "name": "Path of the Divine ",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "131",
      "fileName": "Path of the Divine -46081-1-0-1.rar",
      "uploadedUnix": "1384091034",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/d2c9e8e63facf4c1c59fc906a3b17cea650f35f031eaee98eabc054a0092428e/analysis/1407787221/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Path%20of%20the%20Divine%20-46081-1-0-1.rar?fid=1000077284&ttl=1535826436&ri=8192&rs=8192&setec=df7b1a7e87e58e6dbadad547d51be7e4"
    }
  ]
}