{
  "modId": 46107.0,
  "modName": "Saviors Tower - No Load Doors - Lore Friendly Starter Home",
  "summary": "Starting Player Home with no Load Doors, provided by the people of Whiterun to their Savior.\r\nShould function with Wet & Cold/Frostfall as I've added fires on 2 levels and one right beside the bed. Currently testing those mods to verify.",
  "descriptionHtml": "Short update/question:\r\nWednesday I'm hoping to release a version that allows you to use the Mod Manager to create your own progression of completion meaning, you get it bare - add patch 1 which will add a few things and then patch 2 when you want, and it will only add things, not alter chests or current manikins that way it will be the base for the quest oriented one - and I can get your opinions on the progression. \r\n\r\nAlso - I'm considering moving the tower to the small empty space to the left of the Whiterun gate, let me know your thoughts, as I feel this may be more central and a realistic location for the tower, just a thought. \r\n\r\nVer 0.03 Update Added: \r\n\r\nFully navmeshed, so followers are now welcome. \r\nFinished armoury off, added more weapon racks and storage including dagger holders and such (Note that duel sword and shield display isn't functioning - spent an hour working on it and will go back to it later)\r\nAdded Torch holder - so you can grab one whenever you need one\r\nAdded Chest on Desk that holds some lock picks off the get go, just as a little helper\r\nMoved assault plans during main battle quest line, so I don't foresee any conflicts during that quest anymore - please tell me if you have an issue\r\nAdded note from Whiterun Jarl on door \r\nAdded key for door - currently located on front step thanks to clumsy guard :)\r\n\r\n***I have noticed that the weapon rack ends are not aligned properly, must have happened while moving them - will be fixed in next patch or update along with shield and sword weapon plaque.\r\n\r\nNow all that I see left is making it quest locked, and then selectable upgrades. \r\n\r\nI apologies to those that have downloaded it, this is a fully new version, I was going to make just a small update to go over top but I kept adding and adding, and decided to make it its own, so I recommend removing all items from storage, creating as \"Clean\" a save as you can then installing this version. THANKS!!!\r\n\r\n\r\nFirst off a thank you to anyone that takes time out of their day to look into my mod. \r\n\r\nI've made quite a few player homes but thought I'd share this one with you guys, it's in \"Beta\" stage as I have tons of ideas that I would love, but want to know what the general modding community would like to see.\r\n\r\nThis is a Player Tower that is quite bare located on the outside of the Whiterun City walls. \r\n\r\nThe storyline would go as such:\r\n\r\nYou've slain your first dragon, and as a token of their appreciation the Jarl of Whiterun would provide you access to the tower which they were about to take down. At first it would be very bare, only furnished with a bedroll and chest, as you complete quests for Whiterun they would provide you more and more Items, till you earn the right to choose your own furnishings through an NPC. \r\n\r\nI plan on coding all of this, but as I am the only current user, I could just change it in Creation Kit, but if players like the concept I'd like to make it a reality. \r\n\r\n\r\nSo Far the home Provides:\r\n\r\nBed, Cooking Station, Alchemy Station, Enchanter, Pickaxe, Wood Axe, Two Player Chests, Two Manikins, Display Case, and gorgeous scenery.\r\n\r\n\r\nI've navmeshed up to the front door so your followers can't come inside yet, this is top priority at the moment. Then  I plan to update by adding the escalation of furnishing through quest chain. \r\n\r\nLet me know your thoughts and if you find any bugs. \r\n\r\nCurrently I believe it will have issues with the battle for Whiterun in the Main war quest line. Would not recommend installing if you plan on doing that quest soon, install after. \r\n\r\n\r\nLeave any and all constructive comments you can, thanks again! \r\n\r\n\r\nBig thanks to Gopher, for making such amazing videos to help so many of us further enjoy Skyrim!!\r\n\r\n\r\n",
  "categoryId": "67",
  "version": "0.03",
  "author": "Metzler626",
  "createdUnix": "1383322903",
  "updatedUnix": "1383358380",
  "containsAdultContent": false,
  "uploadedBy": "Metzler626",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000073615",
      "name": "Saviors Tower",
      "version": ".01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "50",
      "fileName": "Saviors Tower-46107--01.rar",
      "uploadedUnix": "1383322809",
      "modVersion": ".01",
      "virusScanUrl": "https://www.virustotal.com/file/6f89130427c9ccbf6526ee1604266dc978ebfbfb9376e6600d36caecb0fdbc35/analysis/1407777360/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saviors%20Tower-46107--01.rar?fid=1000073615&ttl=1535826456&ri=8192&rs=8192&setec=f41c0c0c65ca84e73df10f880bc58932"
    },
    {
      "fileId": "1000073953",
      "name": "Saviors Tower ",
      "version": "0.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "92",
      "fileName": "Saviors Tower -46107-0-03.rar",
      "uploadedUnix": "1383356290",
      "modVersion": "0.03",
      "virusScanUrl": "https://www.virustotal.com/file/3e030946e5b48bec03419170e9107d756d20f21b65a9f84f6f851f140a086ab0/analysis/1407777847/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saviors%20Tower%20-46107-0-03.rar?fid=1000073953&ttl=1535826456&ri=8192&rs=8192&setec=6b5927d28ea6994f7511b4b5de79170a"
    },
    {
      "fileId": "1000073967",
      "name": "Saviors Tower Vis from inside whiterun Patch",
      "version": ".03",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "13",
      "fileName": "Saviors Tower Vis from inside whiterun Patch-46107--03.rar",
      "uploadedUnix": "1383358380",
      "modVersion": ".03",
      "virusScanUrl": "https://www.virustotal.com/file/50bdd2a1c0420445d11d605b2a15a5fe5f8c019cf40c7419a6928cef8745bd39/analysis/1407777848/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saviors%20Tower%20Vis%20from%20inside%20whiterun%20Patch-46107--03.rar?fid=1000073967&ttl=1535826457&ri=8192&rs=8192&setec=5826e7f90df60722189283b946d0031a"
    }
  ]
}