{
  "modId": 46132.0,
  "modName": "The Ponderosa",
  "summary": "Small Player home I made for myself.  I based the house off of Arcadia's Cauldron in Whiterun.",
  "descriptionHtml": "The house is a small house I made for myself because.....well, just because I could.  The house is not one made for showing off all the stuff you collect, but there should be a storage spot for everything.  The house was really designed with more of a thought of people of have RN&D and Frostfall installed.  There is a map marker for the house just south of Whiterun, just below the farm.  There is a mine that is connected to the house where you have:\r\n\r\n3 Moonstone veins\r\n3 Ebony veins\r\n3 Quicksilver veins\r\n2 Malachite veins\r\n2 Gold veins\r\n1 Silver vein\r\n\r\nThe re-spawn times for the veins have not been touched so they re-spawn the same as the other ores in the game. I may make a version without the mineshaft, I don't know, opinions are welcome about it.  There are different storage cabinets for foods, alchemy, soul gems, books, etc behind the bar.  The woodpile on the floor is used for firewood, the cask on the bar is used for water storage.  There is only 1 mannequin upstairs in the main bedroom, with a shield rack, and a weapon plaque above the door.  The house if fully navmeshed so followers can come into the house.\r\n\r\n-----------------------\r\nKNOWN ISSUE\r\n-----------------------\r\nThe only issue I've found so far is the \"trash can\" in the corner.  Even though, the barrel is set to re-spawn, it never seems to.  But it was something that never really bothered me.  If you want or know how to correct it with Creation Kit, feel free to do so, or message me with how and I will fix it.\r\n\r\nOther than that, please enjoy.  Any feed back is welcome about the house.",
  "categoryId": "67",
  "version": "1.1",
  "author": "Atdano",
  "createdUnix": "1383341345",
  "updatedUnix": "1383346211",
  "containsAdultContent": false,
  "uploadedBy": "atdano",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000073870",
      "name": "The Ponderosa",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "142",
      "fileName": "The Ponderosa-46132-1-1.rar",
      "uploadedUnix": "1383346211",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4b7c1f0db01241b75fa58c78503a059bcc2c0252e53f4d2ef153d3c4cdd78a96/analysis/1407777673/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ponderosa-46132-1-1.rar?fid=1000073870&ttl=1535826473&ri=8192&rs=8192&setec=34c7a38af5db03671eaaaa4d4d14199e"
    }
  ]
}