{
  "modId": 46230.0,
  "modName": "The Shield of Martin",
  "summary": "Adds the shield of Martin the Warrior from the Redwall book series by the late, great Brian Jacques, for all your skeever-bashing needs.",
  "descriptionHtml": "[center][i]By the moonlight, on the hour,\r\nIn my threshold space lay me.\r\nWatch the beam reflect my power,\r\nUnite once more my sword with me.\r\nI--am that is, stand true for all.\r\nO Warrior Mouse, protect Redwall.[/i][/center]\r\n\r\nAfter making Ratdeath, the sword of Martin the Warrior from the Redwall book series, I realized it was missing something. It was all alone without Martin's shield, and while it took me a bit I've now rectified that little matter. :3\r\n\r\nThis mod adds, of course, the shield of Martin the Warrior, modeled after its appearance on the book's 10th anniversary cover. The shield is classified as light armor and, protection-wise, it's roughly halfway between an elven shield and a glass shield. The shield's fully temperable and also has a perk attached to it that reduces damage dealt by skeevers, so it's fully enchantable as well. The shield can be found in Lund's Hut, which is some ways from Rorikstead on top of a hill. You'll know you've found it when you run into a house with skeevers chillin' out in front of it. Give the house a thorough search once you get inside, shouldn't be hard to find the shield there ;)\r\n\r\n[u][b]With 1.1, now you can make a heavy version![/b][/u] To do so you will, of course, need to get the shield, then 3 steel ingots and the Steel Smithing perk, and drag 'em all to a forge to hefty up the shield. It's functionally identical to the standard version, but of course weighs a bit more and offers more defense (just a smidge more than an orcish shield). You can also revert the shield back to the light version by taking it to a smelter, in case you want to switch it back for whatever reason. [b]BE ADVISED[/b], doing this will strip off any tempering or enchanting you've done to the shield, so choose carefully.\r\n\r\nIt ain't complete without Ratdeath! G'won and give it a looksee [url=http://skyrim.nexusmods.com/mods/37166/?]here[/url]\r\n\r\n[u]Known Issues[/u]\r\n\r\nNone\r\n\r\n[b][u]Moving Pictures For Your Eyes[/u][/b]\r\n\r\n[youtube]wluS0Ka0ijc[/youtube] [youtube]8NGlHvdvO5E[/youtube]\r\n\r\n[b][u]Future Plans[/u][/b]\r\n\r\nNone at present.",
  "categoryId": "54",
  "version": "1.1",
  "author": "DMagnus",
  "createdUnix": "1383455012",
  "updatedUnix": "1383783795",
  "containsAdultContent": false,
  "uploadedBy": "DMagnus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000074348",
      "name": "Shield Of Martin",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11564",
      "fileName": "Shield Of Martin-46230-1-0.zip",
      "uploadedUnix": "1383454914",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/af2646649359608b59e5be127226ecfbede2bb081c4415441274b8522ca5ac1f/analysis/1407779246/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shield%20Of%20Martin-46230-1-0.zip?fid=1000074348&ttl=1535826559&ri=8192&rs=8192&setec=23258074f23a87d2c064ab7278bf23f5"
    },
    {
      "fileId": "1000076033",
      "name": "Shield of Martin 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11323",
      "fileName": "Shield of Martin 1_1-46230-1-1.zip",
      "uploadedUnix": "1383783795",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6a3395dae9d0b085275d3125a7a3ca450c24e812d278b05abf92398d5d5af506/analysis/1407783318/",
      "changelogHtml": " Lowered the mesh a tad and angled it to minimize gauntlet clipping.\r<br />\r<br />Heavy version now available&#33; This one you craft, but to do so you&#39;ll need to find the shield first, get yo mitts on 3 steel ingots and the Steel Smithing perk, and drag it all to a forge to make the hefty version. You can also bring the heavy version to a smelter and revert it back to the light version if you don&#39;t want the heavy version no &#39;mo. (though be advised, this will remove any tempering you&#39;ve done to the shield. There&#39;s nothing that can be done about that, so make your choice carefully) The heavy version is just a smidge better than an orcish shield\r<br />\r<br />Reduced the depth on the shield&#39;s normal maps, so the metal isn&#39;t as rough looking.\r<br />\r<br />Boosted the specular too, to give it a more polished sheen. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shield%20of%20Martin%201_1-46230-1-1.zip?fid=1000076033&ttl=1535826559&ri=8192&rs=8192&setec=16f998e031578ac5df672d9791db2b72"
    }
  ]
}