{
  "modId": 46284.0,
  "modName": "Child Followers Liette and Caenlyn",
  "summary": "Two Bosmer/ wood elf child followers (boy and girl, both mages) plus their adoptable little sister Natesse, located in Riften",
  "descriptionHtml": "[b]Major note:[/b] the original RCOTS (which this requires) has been deleted. There&#39;s a new RCOTS, and a different mod Skykids, which both add elven child races. Eventually I&#39;ll be making a new version of these three using RS Children rather than RCOTS (it&#39;s overall better quality, fewer issues; I&#39;d used RCOTS because it included cute elven children. Instead I&#39;ll just add elven ears to them as armor add-ons); it&#39;ll be posted to this, and the current file will be moved to &#34;old files&#34; for anyone who&#39;s kept the original RCOTS. I&#39;ve finally gotten back into modding, but I have midterms coming up, so expect the update within the next two to three weeks. Given the major problems they&#39;ve experienced with hair color, I&#39;ll be just stick with a vanilla hair color - their hair colors looked fine on my old rig, but with my new one I&#39;ve realized they&#39;re greener than intended.\r<br />\r<br />(There is a standalone version of Liette and Natesse at http://skyrim.nexusmods.com/mods/48052//?. Doesn&#39;t include Caenlyn, and they don&#39;t look quite as child-like. Plus the file&#39;s like four times as big). \r<br />\r<br />Updating from v1.1 to v2: (assuming you didn&#39;t just delete Liette when you updated RCOTS).  Dismiss Liette, open console, target her, then type &#39;disable&#39;. Save, exit, delete everything involving her. Then update your RCOTS to the esm version. Then download the new file\r<br />\r<br />All three are located in the Bee and the Barb Inn in Riften\r<br />\r<br />Liette is a custom Bosmer child follower, using the Revised Children of the Sky mod as her base. She&#39;s a destruction-orientated mage, although she can also use conjuration (atronachs and familiar) and alteration spells. She&#39;ll level with the player (like most followers, you need to use console commands to force this - it isn&#39;t auto). She has the Lightfoot perk (so she won&#39;t set off traps&#33;), plus Muffled Movement, all of the Destruction-costs-less-magicka-line (Novice..., Adept..., etc), and Destruction Dual Casting. She&#39;s willing to commit any crime, and won&#39;t report the character. She has RIDICULOUS stealth. Seriously, she hits 100 ranks at level 24. I gave her basically every destruction spell, with the notable exception of area-of-effects and Chain Lightning, because those hit bystanders\r<br />\r<br />Caenlyn is her twin brother and uses a mixture of conjuration/necromany and one-handed weapons, though he also knows a handful of destruction and alteration spells. He&#39;ll also level with the player. He has the Lightfoot, all Mage Armor, Muffled Movement, all Conjuration-costs-less-magicka, and Conjuration Dual Casting parks. He&#39;s willing to commit any crime, and won&#39;t report the character. He has every single conjuration spell, including the DLC ones (explanation is in his story at the bottom). His stealth levels like Liette&#39;s\r<br />\r<br />(If you want to adopt them, and don&#39;t want them as a follower, target either and use the command &#34;addfac xx004290 1&#34;, where xx is the position of Hearthfires in your load order (should be 03). It&#39;ll disable the follower dialogue, though, and if either&#39;s already your follower, you&#39;ll have to dismiss them first, then add them to the adoptable faction. Unfortunately both can&#39;t be active at the same time, and it looks like making them adoptable and as a potential follower will require a lot of work... Also, DON&#39;T GIVE THEM CHILD&#39;S CLOTHES)\r<br />\r<br />Natesse is their baby sister. She&#39;s adoptable, though using console commands to remove her from the adoption faction will allow you to have her as your follower (type &#34;addfac xx004290 -2&#34; after targeting her in console). In case you decide to do that, she has ridiculous stealth, pickpocket, and lockpicking, and is set as a thief for combat.\r<br />\r<br />They all have a custom combat class, which affects their leveling. All three are very heavily weighted towards stealth. Liette will gain a lot of magicka as she levels, some health, but no real stamina, and her destruction skill advances faster than her other combat skills. Her onehanded will increase very slowly. Caenlyn won&#39;t gain as much magicka, but he&#39;ll gain stamina and health far faster than Liette. His conjuration skill will advance less quickly than Liette&#39;s destruction, but his onehanded increases faster than Liette&#39;s. Natesse can use stealth, pickpocket, lockpicking, and marksman very well, and her health is ridiculous.\r<br />\r<br />I just gave them all spells they&#39;ll need at the outset. They&#39;ll use them as they get enough magicka.\r<br />They&#39;re now using a child voice&#33; Though note: this requires the More Follower Voices Mod (findable on the Nexus) to be installed and loaded if you want them to have the right dialogue.\r<br />\r<br />You can adopt all three using console commands, but you can&#39;t have them as your follower at the same time\r<br />\r<br />Requirements:\r<br />Hearthfires\r<br />Dawnguard\r<br />RaceCompatibility \r<br />Reworked Children of the Sky (not on the Nexus. I&#39;ve directly linked to the main download file in the Mirrors section. All credit goes to Glouf for this) (THE NEW ESM VERSION)\r<br />More Follower Voices Mod at (http://skyrim.nexusmods.com/mods/36913/) \r<br />\r<br />INSTRUCTIONS FOR CHILDREN OF THE SKY: Usually called RCOTS in the mod files (and often in this), which is short for &#34;Reworked Children of the Sky.&#34; The link in the mirrors takes you to mega.co.nz, where you can download the main file. Use Nexus Mod Manager to open the file (or installer of your choice). You NEED to have the associated plugin (the esm) active alongside ChildFollowersWoodElves.esp or your game will CTD.\r<br />\r<br />CREDITS:\r<br />All of their hairs are taken from the Oblivion Hair Packs by rodeorage, who gave blanket permission to repackage and redistribute individual hairs, and who did the amazing work of converting Oblivion custom hairs to Skyrim. Credit also goes to the massive list of modders rodeorage got permission from, although I couldn&#39;t figure out which modder went with which hair\r<br />To the amazing Glouf, of course, for the RCOTS mod and for all the help with Liette\r<br />To Jittek, for the original CotS mod\r<br />To the plethora of online guides for character creation\r<br />\r<br />Compatibility:\r<br />They should be compatible with just about everything, with the possible exception of any other mod that changes the Bee and the Barb. I&#39;ve tested them with the Extensible Follower Framework (they should therefore also be compatible with any other multi-follower mod) and Convenient Horses. I&#39;ve tested them in combat at level 1, level 7, level 30, and level 70.\r<br />They&#39;re incompatible with everything that MFVM is (unfortunately this includes My Home is Your Home). \r<br />\r<br />Problems:\r<br />None that I&#39;ve noticed stand-alone (except for occassionally resizing while sandboxing - this only happens with the &#34;lean against the wall/rail&#34; animations). Also, DON&#39;T try editing them in the Skyrim NPC editor&#33; It causes the race to change to &#34;fox race&#34; and basically breaks the mod.\r<br />BUT the main Children of the Sky file does have its own problems. If you use a mod to change her default outfit to &#34;none&#34; and you have a nude-body replacer mod she will be naked, so don&#39;t do that. There might be clipping problems with some custom armors, and the RCOTS-Armor Pack&#39;s Expert and Master Destruction robes cause her body to disappear. If you have an armor replacement mod, it might change her body (I have CBBE, with a CBBE-compatible armor mod. Having her equip altered armor gives her a miniturized CBBE body, which is weird. I basically recommend keeping her in enchanted clothes)\r<br />ALSO MAJOR POTENTIAL PROBLEM: if (and only if) you have both a body-replacement mod and an armor-replacer for males (I have Schlongs of Skyrim with an SOS-compatible armor replacer), and you have Caenlyn equip a replaced armor, YOUR GAME WILL CTD. So don&#39;t do that. The vampire armors and dawnguard armors don&#39;t seem to be touched by any male armor replacer, so those are probably safe, as are most clothes\r<br />\r<br />DON&#39;T GIVE THEM CHILD&#39;S CLOTHES. Seriously, don&#39;t. (This is after you adopt Natesse, or all of them using commands). Weird problems will happen with feet+hands, and they&#39;ll be naked. (This is a problem with all custom children using custom bodies)\r<br />\r<br />Sometimes after adopting her Natesse will just stay in the Bee and the Barb and won&#39;t have the typical dialogue. Might be a conflict between RCOTS and one of my adoption mods, though, or between RCOTS and the vanilla adoption system. Working on figuring this out\r<br />\r<br />This is my first mod, so there are probably other issues. Please report any you notice&#33;\r<br />\r<br />Future changes:\r<br />Custom voice and dialogue, including awareness of location and current quest\r<br />Possibly hireable or including a quest to get them to follow you\r<br />Adoptable and followers at the same time\r<br />\r<br />Their story:\r<br />They were born in Valenwood, and spent their early years there. When the twins Liette and Caenlyn were nine, and little Natesse was five, their mother died. Their father decided to travel to Skyrim, taking his three children with him. Liette and Caenlyn were excited about the chance for adventure, although Natesse wanted to stay home. All three are child prodigies, taught the art of fighting by their pyromaniac father and necromancer mother. Liette takes more after their father, Caenlyn after their mother, while Natesse wasn&#39;t really interested in magic, and instead practiced her archery and playing pranks. Liette hoped to enroll in the College of Winterhold, but was rejected because of her age. Their father, a year into their stay in Skyrim, met a charismatic Stormcloak woman, who talked him into joining the cause. They moved to Riften, and their father joined the fight, only to die as one of the many casualties in the civil war. All three were sent to Honorhall, but almost immediately ran away. They use what&#39;s left of their father&#39;s money, doing odd jobs on the side to supplement their income, to rent a room in the Bee and the Barb, where Caenlyn and Liette spend their days in hopes of a proper job. Natesse, to her sibling&#39;s despair, has taken to pick-pocketing. Liette spends what little money she can save on spell tomes, while Caenlyn saves for a better sword. The twins long for travel and adventure, and once they heard of the return of the dragons, they started dreaming of fighting them. They jumps at the first chance for adventure, eagerly following their new boss into the greatest danger as long as Natesse&#39;s safety is secured. Caenlyn and Liette are currently eleven years old, accompanied by their seven-year-old sister. All three are as much of prodigies as ever.",
  "categoryId": "66",
  "version": "2.2",
  "author": "Shinkoku",
  "createdUnix": "1383501799",
  "updatedUnix": "1385415617",
  "containsAdultContent": false,
  "uploadedBy": "Shinkoku",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000074607",
      "name": "Child Follower Liette",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Child Follower Liette-46284-1-0.zip",
      "uploadedUnix": "1383501745",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8cd607da93ab9fb93f784ed062b5d61d9d0e9a32055faf37fe8baeb2e0b534f5/analysis/1407779594/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Child%20Follower%20Liette-46284-1-0.zip?fid=1000074607&ttl=1535826610&ri=8192&rs=8192&setec=94d11340a28b0be5d760ae89f63e2ce5"
    },
    {
      "fileId": "1000074808",
      "name": "Child Follower Liette v 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Child Follower Liette v 1_1-46284-1-1.zip",
      "uploadedUnix": "1383535352",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7060fa22e93bf0ccfc787427a88418cbb15594bdb1c3b95ed728795657a64f5a/analysis/1407780161/",
      "changelogHtml": " Needs MFVM <br/> \n Changed voice to FemaleChild <br/> \n Gave her a unique CombatStyle <br/> \n Changed default outfit to normal clothes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Child%20Follower%20Liette%20v%201_1-46284-1-1.zip?fid=1000074808&ttl=1535826611&ri=8192&rs=8192&setec=c1ff5f1b8929758efe88eceaf30e7b22"
    },
    {
      "fileId": "1000080690",
      "name": "Child Follower Liette plus Siblings v2",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1854",
      "fileName": "Child Follower Liette plus Siblings v2-46284-2-0.zip",
      "uploadedUnix": "1384842284",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/de23792f6d58d63c3dce4d4963bfc938d159e2f71f3361b81d09cfec1fdfa6bd/analysis/1407799084/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Child%20Follower%20Liette%20plus%20Siblings%20v2-46284-2-0.zip?fid=1000080690&ttl=1535826611&ri=8192&rs=8192&setec=95dfb84286e1307bb47d26d5962d749f"
    },
    {
      "fileId": "1000080754",
      "name": "Child Follower Liette plus Siblings v2_1",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4022",
      "fileName": "Child Follower Liette plus Siblings v2_1-46284-2-1.zip",
      "uploadedUnix": "1384865992",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/70427beccbb84d52dac5c7226a832081cb7afee9ff5682f3494cbc2145d3c01f/analysis/1407799387/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Child%20Follower%20Liette%20plus%20Siblings%20v2_1-46284-2-1.zip?fid=1000080754&ttl=1535826612&ri=8192&rs=8192&setec=f869e80cd64bedd6d55b8eb2a97b9aff"
    },
    {
      "fileId": "1000083086",
      "name": "Child Follower Liette plus Siblings v2_2",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6019",
      "fileName": "Child Follower Liette plus Siblings v2_2-46284-2-2.zip",
      "uploadedUnix": "1385415617",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/b40fa76fc4ffbfd391609ec115fa5d6c97658f3897bc2989c23dc4a9628684e2/analysis/1407808451/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Child%20Follower%20Liette%20plus%20Siblings%20v2_2-46284-2-2.zip?fid=1000083086&ttl=1535826612&ri=8192&rs=8192&setec=f3fe7edfde341a9a986ade56466f3bd6"
    }
  ]
}