{
  "modId": 46445.0,
  "modName": "Contrasty - blinding snow and overly dark shadows fix",
  "summary": "A simple adjustment to help cut some of that blinding glare on light colors and also to make the detail in dark items actually visible.",
  "descriptionHtml": "Snow in Skyrim is blinding, as is anything else even remotely light colored. Conversely, anything dark is so black all the detail gets obliterated in the shading. This mod offers several tweaks you can apply to the game using the console to lessen the glare and too-deep shadowing.\r\n\r\nWhy the console? No conflicts. None. You can use this with any lighting overhaul you feel like. The only thing that probably won't play nice with this is certain ENB mods, though I don't use them so I can't point out which ones.\r\n\r\nThis was meant to help save my eyes without being too over the top. Snow in the noon sun on a clear day is still bright, just not -blinding-. Shadows still look like shadows but now you can see the actual fur on a black Khajiit.\r\n\r\nScreenshots were taken with Skyrim at the default brightness. Outside day shots are at around noon with a clear sky. Outside night shots are at midnight with a clear sky. The cave is the very last part of Helgen keep. And yes that Khajiit has raptor talons and blue hair. I'm weird like that.",
  "categoryId": "62",
  "version": "1.0",
  "author": "Akumutsuki",
  "createdUnix": "1383651699",
  "updatedUnix": "1383651283",
  "containsAdultContent": false,
  "uploadedBy": "Akumutsuki",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000075370",
      "name": "Contrasty",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16545",
      "fileName": "Contrasty-46445-1-0.7z",
      "uploadedUnix": "1383651283",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a9c0f47ac732e5493a7de6271bf7d8a108409628609b76074885a93c907cdf58/analysis/1407781681/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Contrasty-46445-1-0.7z?fid=1000075370&ttl=1535826737&ri=8192&rs=8192&setec=79a07e11a0d55296b6c4bce6a6f081b8"
    }
  ]
}