{
  "modId": 46523.0,
  "modName": "USURE - Intelligence Outfits and Duels RPG v10_4 - FRANCAIS and ENGLISH",
  "summary": "L&#39;habit ne fait pas le moine &#33; Donne à vos tenues le rôle d&#39;appartenance à la faction.\r<br />Your Outfit makes the roling game.\r<br />French + English versions",
  "descriptionHtml": "[img]http://static-1.nexusmods.com/15/mods/110/images/26569-1-1352282189.jpg[/img]\r<br />\r<br />[size=4]Needs the last Skse &#33;&#33;\r<br />Requiert le dernier skse &#33;&#33;\r<br />\r<br />Version 10.4\r<br />-&gt; Corrige le bug des gardes qui vous ré-attaquaient même en tenue neutre lorsque ils vous avaient une fois détecté en tenue ennemie:\r<br />Une fois détecté et attaqué comme ennemi (ex parjure ou bandit) par des gardes, fuyez et semez les gardes - ou planquez-vous - jusque stopper l&#39;alarme, changez votre tenue en neutre  (Attention seulement une fois l&#39;alarme résolue &#33;) et revenez: ils ne vous reconnaîtront pas.\r<br />\r<br />Version 10.3\r<br />-&gt; Bug des animations corrigées\r<br />-&gt; Option &#34;Reset Original Faction&#34; adaptée au bug ancien (de version antérieure) laissant des groupes ennemis pacifiques..Utiliser l&#39;option résolvera le problême.\r<br />\r<br />Version 9.0 francais\r<br />\r<br />-&gt; Refonte complète du mod ayant découvert ce qui a posé des soucis aux joueurs &#33;\r<br />\r<br />-&gt; Il n&#39;est pas nécessaire de recommencer une partie lors de la première installation de cette version &#33;&#33; \r<br />\r<br />-&gt; Pour les joueurs updatant d&#39;une version antérieure:\r<br />1) Remplacer les fichiers .bsa et .esp par les nouveaux de la version 9.0 \r<br />2) Charger une sauvegarde (veiller à être en tenue neutre)\r<br />3) effectuer un aller-retour en voyage rapide d&#39;un bout de la carte à l&#39;autre, et revenez à votre endroit initial.\r<br />4) La nouvelle version est active.\r<br />\r<br />-&gt; Bug corrigé: Les duels désactivés en option enlèvent bien la proposition des duels dans les dialogues.\r<br />\r<br />-&gt; La Désinstallation du mod comme décrite ci-dessous va fonctionner sans laisser de séquelles car aucune des factions de base n&#39;est modifiée dans cette version &#33;&#33;\r<br />\r<br />Encore désolé pour les joueurs ayant eu des soucis, cette version devrait définitivement tout règler.\r<br />enjoy &#33;\r<br />[/size]\r<br />-------------------------------------\r<br />MOD INSTALLATION: (english)\r<br />\r<br />-&gt; .bsa et .esp in skyrim-data\r<br />\r<br />-&gt; I highly recommand to START A NEW GAME WITH THE LAST VERSION CHECKED &#33;\r<br />\r<br />-&gt; ATTENTION; YOUR OUTFIT WILL BE RECOGNIZED A FEW SECONDS AFTER THE MOD CHECK &#33;\r<br />\r<br />\r<br />+++++++++++++++++++++++++\r<br />PROCÉDURE POUR DÉSINSTALLER:\r<br />--&gt; passer en jeu en tenue NEUTRE et SELECTIONNER l&#39;option &#34;reset factions original&#34; du livre Tenues RPG-Menu\r<br />---&gt; sauvegarder &#34;jeu1&#34; + quitter le jeu\r<br />---&gt; décocher le mod\r<br />---&gt; charger &#34;jeu1&#34;, c&#39;est bon.\r<br />\r<br />Desinstallation:\r<br />--&gt; Ingame, wear an NEUTRAL OUTFIT\r<br />---&gt; make a save &#34;game 1&#34; + quit the game\r<br />---&gt; uninstall the mod\r<br />---&gt; load &#34;game1&#34;, it&#39;s okay.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />--------------------------------\r<br />V8.0\r<br />Version mise en place pour un lancement dès le début du jeu, nécessaire pour un initialisation correcte des factions.\r<br />Le mod s’initialisera automatiquement après avoir vos mains libérées dans l&#39;intro.\r<br />\r<br />Version adapted for been checked by starting a new game, necessery for a good factions initialisation.\r<br />MOd will be automatically initialised, as your hands are free after the intro.\r<br />\r<br />v7.7\r<br />Outfit thalmor now corrected\r<br />La tenue Thalmor fonctionne comme il faut.\r<br />\r<br />v7.6\r<br />- Bug vampire feed corrigé\r<br />- les relations entre factions intègrent maintenant votre cheval aussi.\r<br />\r<br />v7.3\r<br />Les gardes n&#39;interviennent plus lors des duels en ville &#33;\r<br />\r<br />V7.2\r<br />Tous les bugs signalés ont été corrigés.\r<br />Duels stables.\r<br />Les harfreuses réagissent maintenant aux tenues; sont du côté des parjures, donc avec vous si vous êtes déguisé en parjure &#33;\r<br />\r<br />v5.1\r<br />in english coming soon\r<br />\r<br />- quelques debuggages\r<br />- le programme reconnait maintenant votre tenue lors de la toute première charge du mod aussi.\r<br />- Ajout d&#39;une OPTION dans le livre menu principal &#34; reset factions original&#34; afin de remettre les relations des factions telles qu&#39;à l&#39;origine pour en cas de bug ou avant une desinstallation du mod &#33;\r<br />----------------------------------\r<br />v5.0\r<br />\r<br />- Fin de la messagebox interrompant le jeu, les dialogues des duels sont maintenant intégrés à la liste des dialogues tels qu&#39;on les connait.\r<br />- Correction du bug empêchant d&#39;engager des duels après avoir terminé la quête engageant définitivement le joueur du côté sombrage ou impérial.\r<br />\r<br />+++++++++++++++++++++++\r<br />v4.6\r<br />Plus de proposition de duels aux chevaux &#33;\r<br />No propose duels to horses anymore &#33;\r<br />\r<br />\r<br />+++++++++++++++++++++++\r<br />v4.5\r<br />-&gt; Werewolfs are managed\r<br />-&gt; Menu Book Bug corrected\r<br />-&gt; Imperial+Stormcloak factions are now right reacting when killed during a duel.\r<br />\r<br />v4.3\r<br />Version compatible with mod random alternate start.\r<br />\r<br />v4.2\r<br />more corrected version\r<br />\r<br />v4.1\r<br />--&gt; Followers do not fight with you while duels\r<br />--&gt; bug corrected player did sometimes die while bleeding out\r<br />\r<br />v4.0 Outfits and duels system upgraded:\r<br />--&gt; Fighting without warning with a member of the faction you are wearing the outfit will declare you as ennemy of the faction.\r<br />--&gt; Talk to a non-hostile actor and engage a duel, so fight with him &#34;friendly&#34; (without killing), the looser will be bleeding out at the bottom and the winner become gold bets. The looser survives.\r<br />--&gt; To kill a duel-partner declares you as ennemy.\r<br />--&gt; No risk for the player to be killed while a duel anymore.\r<br />--&gt; Challenge duels with all NPCs, guards too, to win gold &#33;\r<br />--&gt; Become duel proposed events from others actors that you encounter in the game.\r<br />--&gt; Options old book in your inventory called &#34;options mod outfit RPG&#34;\r<br />\r<br />+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\r<br />Francais:\r<br />\r<br />V7.1\r<br />Encore un bug d&#39;hostilité corrigé.\r<br />\r<br />V7.0\r<br />Tout le mod a été stabilisé: Duels, factions, bug des NPC ennemis n&#39;attaquant pas fixé.\r<br />Par contre retrait de la possibilité de duels avec les gardes.\r<br />\r<br />v4.5\r<br />-&gt; Les loupgarous sont pris en compte.\r<br />-&gt; Le bug du livre Menu est corrigé (utilisable plusieurs fois)\r<br />-&gt; ILes factions impériales et sombrages réagissent correctement si on les tue pendant un duel.\r<br />\r<br />\r<br />v4.1\r<br />--&gt; Vos compagnons resteront à l&#39;écart des duels.\r<br />--&gt; bug corrigé: le joueur mourait parfois en phase de saignement parterre.\r<br />v 4.0 = système de tenues et duels refondu et amélioré:\r<br />--&gt; attaquer sans prévenir un membre de la faction dont vous portez la tenue vous signalera comme ennemi &#33;\r<br />--&gt; en parlant à un acteur, proposer lui un duel en misant de l&#39;or.\r<br />Battez-vous &#34;amicalement&#34; (sans le tuer),\r<br />Le premier à tomber épuisé parterre a perdu l&#39;argent en mise.\r<br />--&gt; tuer un dueliste à terre entraîne un signalement ennemi &#33;\r<br />--&gt; Il n&#39;y a plus aucun risque que vous soyiez tué au cours d&#39;un duel.\r<br />--&gt; proposer des duels à tous les acteurs non-hostiles même les gardes pour gagner de l&#39;or &#33;\r<br />--&gt; recever des évènementsde de propositions de duels de la part d&#39;acteurs non-hostiles de temnps en temps.\r<br />--&gt; Gérer les options grâce au vieux livre &#34;Config Tenue RPG&#34; dans l&#39;inventaire.\r<br />(Duels/propositions/son d&#39;avertissement)\r<br />\r<br />v3.0\r<br />Un problême apparaissait lorsque le joueur, déguisé, attaquait le groupe d&#39;appartenance: Les bandits, les sorciers ne se retournaient plus contre vous.\r<br />Voilà ce que propose la version 3.0 :\r<br />- Si (par exemple) vous êtes en tenue de bandit et vous attaquez un confrère bandit, celui-ci entrera dans un mode combat duel-training\r<br />cad se bagarrera avec vous mais sans vous tuez, de même, le joueur sera averti que le duel est gagné avant que le confrère ne soit tué.\r<br />- Le bandit boira ensuite une potion pour récupérer son énergie vitale (avec animation programmée) \r<br />- Si vous décidez de tuer le bandit - le groupe présent saura votre tromperie et vous attaquera.\r<br />- Le mod duel fonctionne aussi avec les impériaux et sombrages et même toutes les factions mais veillez à porter leur tenue sans quoi ils vous attaqueront &#33;\r<br />- Attention il y a des duels qui pourraient mal tourner. Chaque meurtre fera le groupe vous considérer comme un ennemi &#33;\r<br />\r<br />V2.1\r<br />Bug de l&#39;intro corrigé: Le joueur bloquait et la scène cessait de progresser &#33;\r<br />\r<br />v2.0\r<br />--&gt; Enfin les gardes réagissent adéquatement selon les tenues du joueur,\r<br />--&gt; intégration des factions alliées,\r<br />--&gt; regroupement des mages-sorciers et nécromanciens en une tenue de &#34;sorciers&#34; puisque de toute facon ils sont alliés dans le jeu &#33;\r<br />\r<br />V2.1 (english)\r<br />Bug corrected: Scene in the intro stopped and game was blocked.\r<br />\r<br />V2.0 \r<br />--&gt; Now guards are reacting just as expected depend on player Outfits &#33;\r<br />--&gt; Allies factions are integrated to outfit system\r<br />--&gt; Necromant and Sorcerers are now only one warlock group, as they are friends in game.\r<br />\r<br />\r<br />READY IN ENGLISH TOO &#33;\r<br />\r<br />Welcome to the mod &#34;Intelligent-Outfits-RPG&#34;\r<br />\r<br />If you too, you was surprised..\r<br />..that you can talk to Ulfric with an imperial outfit,\r<br />..you can cross a imperial military camp with stormcloak outfit: No reaction.\r<br />..Forsworn Bowman are shooting on you even though you are 50 meter from him with a forsworn outfit.\r<br />(Wow am I famous that all recognize me through my helmet ??)\r<br />\r<br />Or if you wished to play skyrim as necromant, bandit or forsworn..\r<br />\r<br />---&gt; This mod is for you &#33;\r<br />\r<br />Effectively, this mod give an RPG impact at your outfits; change the outfit, and so change the fation:\r<br />So try hide or camouflage in imperial, stormcloak, thalmor, sorcerer, forsworn, necromant, bandits: Just put the right outfit &#33;&#33;\r<br />\r<br />Attention:\r<br />- All factions are going to react depends on your outfit, no matter what the story tells, so if your are with Ulfric, do not wear imperial outfit in front of his soldier or they are ging to attack &#33;\r<br />- You can cross or visit now peaqefully a bandit or forsworn camp, or sorcerer castel: With the right outfit, they are going to speak with you as a friend of.\r<br />- But if members of a faction begin to fight with you, it won&#39;t run to quickly wear the factions outfit to make them stop attacking. So think to be hide when you change your outfit &#33;\r<br />\r<br />- An outfit to be perceived as friendly from the owner faction, the player has to equip the cuirass piece and two pieces of the rest of armor: Helmet, gauntlets, shield, or boots.\r<br />- When you change your outfit, a sound will be to hear in the game and a message warning.\r<br />- If your outfit is incomplete or mixed, your outfit will be set as &#34;neutral&#34;.\r<br />- you can click on an old book &#34;check outfit&#34; in your inventory to tell you which outfit you are actually wearing.\r<br />\r<br />Now you are a normal warrior, anonymous, able to be dissimulated, to betray your friends or ennemies, undercovered.\r<br />Really, the Outfit do not make the soldier &#33;\r<br />\r<br />\r<br />-----\r<br />\r<br />No problem wit  compatibility, all changed are a few factions.\r<br />Installation classic: .esp and .bsa in skyrimdata\r<br />Mod compatible with WarZones and usure - degradation.\r<br />\r<br />+[size=4]+++++++++++++++++++++++++++++++++++\r<br />+++++++++++++++++++++++++++++++++++\r<br />\r<br />Bienvenue au mod &#34;Intelligent-Outfits-RPG&#34;\r<br />\r<br />fonctionne avec le dernier skse &#33;\r<br />------\r<br />\r<br />Si vous aussi Vous vous êtes étonnés..\r<br />\r<br />..d&#39;apparaître devant Ulfric en tenue complète impériale sans pour autant qu&#39;il ne bronche,\r<br />..de pouvoir traverser un camp militaire impérial en tenue de sombrage sans que personne de bouge,\r<br />..de vous faire attaquer par des archers parjures à 50 mètres alors que vous portez une tenue parjure &#33;\r<br />(Mince suis-je si connu que tous me reconnaissent sous mon casque ?)\r<br />\r<br />Ou bien auriez-vous souhaiter pouvoir jouer un moment en tant que bandit, voire traverser tout le jeu comme parjure ou nécromancien ?&#33;\r<br />\r<br />---&gt; Ce mod est fait pour vous.\r<br />\r<br />En effet ce mod donne des conséquences très RPG à votre accoutrement, reliant votre identité dans le jeu à votre tenue. Ainsi déguisez-vous, imposez-vous ou camouflez-vous en bandit, impérial, sombrage, thalmor, mage-sorcier, parjure, nécromancien, à votre guise: Enfilez simplement leur tenue &#33;\r<br />\r<br />Attention:\r<br />- chaque faction va réagir à votre accoutremement de facon conséquente: Amis/ennemis, peu importe le fil de votre histoire, de facon réaliste, si vous vous trouvez parmi des impériaux, ne mettez pas une tenue sombrage devant eux sous peine de les provoquer; ils engageront immédiatement le combat &#33;\r<br />- Vous pourrez désormais traverser pacifiquement un camps de bandit, parjure ou nécromanciens, revêtu de leur accoutrememnt typique: ils vous considéreront dès lors comme l&#39;un d&#39;entre eux.\r<br />- Si un groupe d&#39;une faction particulière a engagé un combat avec vous, cela ne vous sauvera PAS d&#39;enfiler à la va-vite leur accoutrement sous leur yeux; une fois repéré, ils continueront de vous attaquer..Pensez-donc à vous camoufler caché, avant le combat &#33;&#33;\r<br />\r<br />- Un accoutrement, pour être reconnu complet par la facion auquel il appartient, doit se composer de la cuirasse de la faction (équipée) et de deux pièces au moins de l&#39;armure au choix: Bouclier, gants, casque, bottes.\r<br />- Chaque changement d&#39;appartenance de votre tenue vous sera signaler en cours de jeu par un son caractéristique et une info écrite au coin supérieure gauche de l&#39;écran.\r<br />- Votre accoutrememnt si incomplet ou composé de différentes pièces sera considéré comme &#34;neutre&#34;.\r<br />- Cliquez sur un vieux livre appelé &#34;check Outfit&#34; que vous trouverez dans les &#34;autres objets&#34; de votre inventaire pour consulter quelle tenue vous affichez actuellement.\r<br />\r<br />Vous voilà désormais un guerrier anonyme, capable de se dissimuler, de tromper amis comme ennemis sous l&#39;apparence. Vraiment, l&#39;habit ne fait pas le moine...\r<br />[/size]\r<br />-----\r<br />\r<br />\r<br />FACTIONS QUI ENTRENT EN JEU:\r<br />MANAGED FACTIONS:\r<br />\r<br />-   sombrages / stormcloak\r<br />-   imperiaux / imperial\r<br />-   thalmor \r<br />-   bandits -&gt; tenue de fourure / outfit= fur armor\r<br />-   necromanciens / necromancers\r<br />-   parjures / forsworn\r<br />-   bandit - allies\r<br />-   necro - allies\r<br />-   parjure chiens / forsworn dogs\r<br />-   sorciers, mages / warlocks\r<br />-   skelettes / skeletons\r<br />\r<br />\r<br />SI VOUS ÊTES SOMBRAGES - IF YOU ARE STORMCLOAKS:\r<br />\r<br />-   sombrages / stormcloak      -&gt; AMIS/FRIENDS\r<br />-   imperiaux / imperial         -&gt; ENNEMIS/ENEMY\r<br />-   thalmor    -&gt; ENNEMIS/ENEMY\r<br />-   bandits   -&gt; ENNEMIS/ENEMY\r<br />-   necromanciens / necromancers   -&gt; ENNEMIS/ENEMY\r<br />-   parjures / forsworn   -&gt; ENNEMIS/ENEMY\r<br />-   bandit - allies   -&gt; ENNEMIS/ENEMY\r<br />-   necro - allies   -&gt; ENNEMIS/ENEMY\r<br />-   parjure chiens / forsworn dogs   -&gt; ENNEMIS/ENEMY\r<br />-   sorciers, mages / warlocks   -&gt; ENNEMIS/ENEMY\r<br />-     skelettes / skeletons   -&gt; ENNEMIS/ENEMY\r<br />\r<br />SI VOUS ÊTES IMPERIAUX - IF YOU ARE IMPERIAL:\r<br />\r<br />-   sombrages / stormcloak      -&gt; ENNEMIS/ENEMY\r<br />-   imperiaux / imperial         -&gt; AMIS/FRIENDS\r<br />-   thalmor    -&gt; AMIS/FRIENDS\r<br />-   bandits   -&gt; ENNEMIS/ENEMY\r<br />-   necromanciens / necromancers   -&gt; ENNEMIS/ENEMY\r<br />-   parjures / forsworn   -&gt; ENNEMIS/ENEMY\r<br />-   bandit - allies   -&gt; ENNEMIS/ENEMY\r<br />-   necro - allies   -&gt; ENNEMIS/ENEMY\r<br />-   parjure chiens / forsworn dogs   -&gt; ENNEMIS/ENEMY\r<br />-   sorciers, mages / warlocks   -&gt; ENNEMIS/ENEMY\r<br />-     skelettes / skeletons   -&gt; ENNEMIS/ENEMY\r<br />\r<br />SI VOUS ÊTES THALMOR - IF YOU ARE THALMOR:\r<br />\r<br />-   sombrages / stormcloak      -&gt; ENNEMIS/ENEMY\r<br />-   imperiaux / imperial         -&gt; AMIS/FRIENDS\r<br />-   thalmor    -&gt; AMIS/FRIENDS\r<br />-   bandits   -&gt; ENNEMIS/ENEMY\r<br />-   necromanciens / necromancers   -&gt; ENNEMIS/ENEMY\r<br />-   parjures / forsworn   -&gt; ENNEMIS/ENEMY\r<br />-   bandit - allies   -&gt; ENNEMIS/ENEMY\r<br />-   necro - allies   -&gt; ENNEMIS/ENEMY\r<br />-   parjure chiens / forsworn dogs   -&gt; ENNEMIS/ENEMY\r<br />-   sorciers, mages / warlocks   -&gt; ENNEMIS/ENEMY\r<br />-     skelettes / skeletons   -&gt; ENNEMIS/ENEMY\r<br />\r<br />SI VOUS ÊTES BANDITS - IF YOU ARE BANDITS:\r<br />\r<br />-   sombrages / stormcloak      -&gt; ENNEMIS/ENEMY\r<br />-   imperiaux / imperial         -&gt; AMIS/FRIENDS\r<br />-   thalmor    -&gt; ENNEMIS/ENEMY\r<br />-   bandits   -&gt; ENNEMIS/ENEMY\r<br />-   necromanciens / necromancers   -&gt; ENNEMIS/ENEMY\r<br />-   parjures / forsworn   -&gt; ENNEMIS/ENEMY\r<br />-   bandit - allies   -&gt; AMIS/FRIENDS\r<br />-   necro - allies   -&gt; ENNEMIS/ENEMY\r<br />-   parjure chiens / forsworn dogs   -&gt; ENNEMIS/ENEMY\r<br />-   sorciers, mages / warlocks   -&gt; ENNEMIS/ENEMY\r<br />-     skelettes / skeletons   -&gt; ENNEMIS/ENEMY\r<br />\r<br />SI VOUS ÊTES NECROMANCIEN OU SORCIER - IF YOU ARE NECROMANCER OR WARLOCK:\r<br />\r<br />-   sombrages / stormcloak      -&gt; ENNEMIS/ENEMY\r<br />-   imperiaux / imperial         -&gt; ENNEMIS/ENEMY\r<br />-   thalmor    -&gt; ENNEMIS/ENEMY\r<br />-   bandits   -&gt; ENNEMIS/ENEMY\r<br />-   necromanciens / necromancers   -&gt; AMIS/FRIENDS\r<br />-   parjures / forsworn   -&gt; ENNEMIS/ENEMY\r<br />-   bandit - allies   -&gt; ENNEMIS/ENEMY\r<br />-   necro - allies   -&gt; AMIS/FRIENDS\r<br />-   parjure chiens / forsworn dogs   -&gt; ENNEMIS/ENEMY\r<br />-   sorciers, mages / warlocks   -&gt; AMIS/FRIENDS\r<br />-     skelettes / skeletons   -&gt; AMIS/FRIENDS\r<br />\r<br />SI VOUS ÊTES PARJURE - IF YOU ARE FORSWORN:\r<br />\r<br />-   sombrages / stormcloak      -&gt; ENNEMIS/ENEMY\r<br />-   imperiaux / imperial         -&gt; ENNEMIS/ENEMY\r<br />-   thalmor    -&gt; ENNEMIS/ENEMY\r<br />-   bandits   -&gt; ENNEMIS/ENEMY\r<br />-   necromanciens / necromancers   -&gt; ENNEMIS/ENEMY\r<br />-   parjures / forsworn   -&gt; AMIS/FRIENDS\r<br />-   bandit - allies   -&gt; ENNEMIS/ENEMY\r<br />-   necro - allies   -&gt; ENNEMIS/ENEMY\r<br />-   parjure chiens / forsworn dogs   -&gt; AMIS/FRIENDS\r<br />-   sorciers, mages / warlocks   -&gt; ENNEMIS/ENEMY\r<br />-     skelettes / skeletons   -&gt; ENNEMIS/ENEMY\r<br />\r<br />SI VOUS ÊTES NEUTRE - IF YOU ARE NEUTRAL:\r<br />\r<br />-   sombrages / stormcloak      -&gt; AMIS/FRIENDS\r<br />-   imperiaux / imperial         -&gt; AMIS/FRIENDS\r<br />-   thalmor    -&gt; AMIS/FRIENDS\r<br />-   bandits   -&gt; ENNEMIS/ENEMY\r<br />-   necromanciens / necromancers   -&gt; ENNEMIS/ENEMY\r<br />-   parjures / forsworn   -&gt; ENNEMIS/ENEMY\r<br />-   bandit - allies   -&gt; ENNEMIS/ENEMY\r<br />-   necro - allies   -&gt; ENNEMIS/ENEMY\r<br />-   parjure chiens / forsworn dogs   -&gt; ENNEMIS/ENEMY\r<br />-   sorciers, mages / warlocks   -&gt; ENNEMIS/ENEMY\r<br />-       skelettes / skeletons   -&gt; ENNEMIS/ENEMY\r<br />\r<br />Marcoousik",
  "categoryId": "24",
  "version": "10.4",
  "author": "marcousik",
  "createdUnix": "1383770053",
  "updatedUnix": "1429715459",
  "containsAdultContent": false,
  "uploadedBy": "marcousik",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000124254",
      "name": "Tenues RPG 8.0 francais",
      "version": "8.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24",
      "fileName": "Tenues RPG 8.0 francais-46523-8-0.zip",
      "uploadedUnix": "1409208980",
      "modVersion": "8.0",
      "virusScanUrl": "https://www.virustotal.com/file/d20eeb6c8263050926f7898a130321358be1600cbda0d4c3c1f342e9ca44a7ae/analysis/1409209082/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tenues%20RPG%208.0%20francais-46523-8-0.zip?fid=1000124254&ttl=1535826856&ri=8192&rs=8192&setec=4181a0a8f1bd46568fd64ff012ee1385"
    },
    {
      "fileId": "1000124255",
      "name": "Outfits-RPG v8.0",
      "version": "8.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24",
      "fileName": "Outfits-RPG v8.0-46523-8-0.zip",
      "uploadedUnix": "1409209143",
      "modVersion": "8.0",
      "virusScanUrl": "https://www.virustotal.com/file/f7c88d2c88b90bd9bbe02d2063e69983ae7604760072a438e82970dd6e96c1d5/analysis/1409209262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Outfits-RPG%20v8.0-46523-8-0.zip?fid=1000124255&ttl=1535826857&ri=8192&rs=8192&setec=c392c6f5e2570fc08511296f8b1fa8b4"
    },
    {
      "fileId": "1000140169",
      "name": "Tenues RPG 9.0 francais",
      "version": "9.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23",
      "fileName": "Tenues RPG 9.0 francais-46523-9-0.zip",
      "uploadedUnix": "1419537428",
      "modVersion": "9.0",
      "virusScanUrl": "https://www.virustotal.com/file/be3c18d832bb53899f1c2228d3277fed0645447bc4826c6850db4acf0b23f729/analysis/1419537481/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tenues%20RPG%209.0%20francais-46523-9-0.zip?fid=1000140169&ttl=1535826857&ri=8192&rs=8192&setec=9586314315cfb8fbfc5f316d796a6386"
    },
    {
      "fileId": "1000140194",
      "name": "Tenues RPG 9.1 francais",
      "version": "9.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23",
      "fileName": "Tenues RPG 9.1 francais-46523-9-1.zip",
      "uploadedUnix": "1419572847",
      "modVersion": "9.1",
      "virusScanUrl": "https://www.virustotal.com/file/93a042e8dad9f7beb2bf15a189789b1b0d330ad120aa06fbf1141b548b57b134/analysis/1419572942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tenues%20RPG%209.1%20francais-46523-9-1.zip?fid=1000140194&ttl=1535826857&ri=8192&rs=8192&setec=9f5d362de171111bdbaa4722e727f8c9"
    },
    {
      "fileId": "1000143102",
      "name": "Tenues RPG 10.0 francais",
      "version": "10.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "Tenues RPG 10.0 francais-46523-10-0.zip",
      "uploadedUnix": "1421415778",
      "modVersion": "10.0",
      "virusScanUrl": "https://www.virustotal.com/file/1ac6d47538ee67edc198d56f161a8a8e8bdb4e605fbfddeb67fef04dec1ed520/analysis/1421415782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tenues%20RPG%2010.0%20francais-46523-10-0.zip?fid=1000143102&ttl=1535826858&ri=8192&rs=8192&setec=d070ea301320f6c847adfa73322388f4"
    },
    {
      "fileId": "1000143690",
      "name": "Tenues RPG 10.1 francais",
      "version": "10.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27",
      "fileName": "Tenues RPG 10.1 francais-46523-10-1.zip",
      "uploadedUnix": "1421751303",
      "modVersion": "10.1",
      "virusScanUrl": "https://www.virustotal.com/file/8c6e18cfc9458fb1ac13cbbac227899d6c0acc8ba0c34eb8d85f5c16a6ed4b6f/analysis/1421751363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tenues%20RPG%2010.1%20francais-46523-10-1.zip?fid=1000143690&ttl=1535826858&ri=8192&rs=8192&setec=a876e4b03f8ecb109bce25ea610b2c35"
    },
    {
      "fileId": "1000145463",
      "name": "Tenues RPG 10.2 francais",
      "version": "10.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27",
      "fileName": "Tenues RPG 10.2 francais-46523-10-2.zip",
      "uploadedUnix": "1422743934",
      "modVersion": "10.2",
      "virusScanUrl": "https://www.virustotal.com/file/afed4579057bbbab3e97e6693839aef286619822cee02587d6029efd254f684a/analysis/1422743943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tenues%20RPG%2010.2%20francais-46523-10-2.zip?fid=1000145463&ttl=1535826859&ri=8192&rs=8192&setec=74adcb4b799cc64f016da1a64bbe4356"
    },
    {
      "fileId": "1000156672",
      "name": "Tenues RPG Version francaise 10-4",
      "version": "10.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27",
      "fileName": "Tenues RPG Version francaise 10-4-46523-10-4.zip",
      "uploadedUnix": "1429715459",
      "modVersion": "10.4",
      "virusScanUrl": "https://www.virustotal.com/file/f99e306713669cf1bf0635b1ba2100e8b5a324a8a8a2cf147296655a2be47338/analysis/1429715463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tenues%20RPG%20Version%20francaise%2010-4-46523-10-4.zip?fid=1000156672&ttl=1535826860&ri=8192&rs=8192&setec=5d545f4a47ef966083817fcaebe4c675"
    }
  ]
}