{
  "modId": 46533.0,
  "modName": "Thalmor Followers",
  "summary": "This mod adds 8 followers in total. The two main ones are marriageable. They are at the Embassy.",
  "descriptionHtml": "This mod adds 8 Thalmor Followers to the world of Skyrim. Two of these followers are marriageable. \r\n\r\nThere is Angalmur, who comes with 2 Aldmeri Marines and an Arch-Wizard. He has his own barracks beside the Thalmor Embassy. This companion is Marriageable.\r\n\r\nThen there is Lilinia, who also comes with 2 Aldmeri Marines and an Arch-Wizard. She has a solar on a hill very close to the Embassy. She is very young for an Altmer and Unlike many other Elves. This one was based on my Thalmor Role-Playing character. NOTE: Her hair may look grey but it is a light, shiny lime.\r\n\r\nInside the Barracks and Solar, you will find a journal and a key, in both buildings. This just explains a little back-story to the characters themselves. The 'Key to Thalmor Embassy' is very buggy, and sometimes won't work. If it doesn't bring up the console, click on the door and type 'unlock' and enter. The door to the Thalmor Embassy is like this.\r\n\r\nBoth Characters have their Own pair of Marines.\r\n\r\nNOTES:\r\nIf you are using this for role-playing and are currently playing as an Altmer (Male or female is doesn't matter) bring up your console and type 'player.addfac 39F26, then press enter. The massive advantages to this is the Thalmor will aid you in combat if nearby, they won't attack you after a conversation and BEST OF ALL: Every few swings from a sword your player will shout thalmor combat dialogue such as 'Bow to your death' or 'Fear the Thalmor!' I found this absolutely essential for my Role-Playing Character.\r\nI am no supporter of the Thalmor, I am waiting for TES: Online to come out so I can take up arms with the Ebonheart Pact and Put the Dominion In it's place. Personally I hate the attitude of the Members of the Thalmor towards other races.\r\n\r\nENB I USE: RealVision ENB by SkyrimTuner, have pity for me because I play on a laptop, with 60+ mods.\r\n\r\nPLEASE TAKE A STRONG READ OF THE AUTHORS OF THE MODS BELOW. THEY ARE ALL OUTSTANDING WORK!!!\r\n\r\nREQUIRED MODS:\r\n-Apachii Sky hair by Apachii\r\n-Hair packs of TES IV Oblivion for Female Only by Radioragae\r\n-Better Females by Bella\r\n-Update.esm (Should be second on the load order in Nexus Mod Manger)\r\n-Extensible Follower Framework by Expired (Essential for when you want to lead the 3 Marines and the Main Follower)\r\n\r\nMods I highly recommend:\r\n-Real Girls Realistic Body Texture for UNP UNPB and SeveNBase - WIP by Zonzai and Seren4XX (The best body texture I have ever come across)\r\n-Cloaks of Skyrim by Noodles\r\n- Highly transparent and refracting Glass armor weapon CBBE UNP UNPB by Skysan4298\r\n-Medusa Drakul armors and Thanatos dragon by Zerofrost Satyr\r\n-SkyUI by SkyUI Team\r\n-Animated Enchantments Overhaul by GRIMELEVEN\r\n-Hell Sword by adaptation by Newermind43\r\n-Bijin Warmaidens by rxkx22\r\n-Aetherium Armor and Weapons Compilation by lautasantenni\r\n-A Matter of Time - A HUD clock widget by SkyAmigo\r\n-Miraak Devour Dragon Soul Shout - Zii Los Dii Du by Rossobud (My other mod xD)\r\n\r\nIF YOU ENCOUNTER ANY BUGS PLEASE TELL ME\r\n\r\nKnown Bugs (PLEASE READ):\r\n-When the Followers exit their barracks', they will exit from the Embassy instead, but they will come to you very fast.\r\n\r\n-Sometimes they wont wear their cloaks from the cloaks of skyrim mod. Simply click on them in comsole and type : help thalmor, then scroll up with PgUp and find the cloaks id, find the bottom one of the 4. Then type 'equipitem <The id of the cloak>\r\n\r\n-The followers will enter and exit the Embassy barracks after being dismissed. Simply wait a few times of a few hours, and they will be in their barracks'\r\n\r\n-(Not a bug as such just an important note) None of them are voiced by Altmer voices. Yes I am fully aware of this and am sorry. Bethesda didn't voice for Altmer companions, and I ain't voice acting, so I had to use dark elf voices. Again I apologize but if you guys don't like dark elf voices very much, suggest other voices.\r\n(Due to Lilinia being young for her race (Altmer/High elves have a lifespan of up to 400 years I read somewhere) she has 'female young eager' voice which I think suits her best.\r\n\r\nThis mod was inspired by DashingKnight's Kitiara. It was outstanding and he really should bring it back.\r\n\r\n",
  "categoryId": "96",
  "version": "1.0",
  "author": "Rossobud",
  "createdUnix": "1383783537",
  "updatedUnix": "1383783434",
  "containsAdultContent": false,
  "uploadedBy": "Rossobud",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000076022",
      "name": "MarriageableThalmors",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2570",
      "fileName": "MarriageableThalmors-46533-1-0.rar",
      "uploadedUnix": "1383783434",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4002d6cecba818e28f8403fc3dbd7d853fc4c4c66c3ec24e4e16f063766452cd/analysis/1407783326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MarriageableThalmors-46533-1-0.rar?fid=1000076022&ttl=1535826867&ri=8192&rs=8192&setec=078b4cbdfd42011b478be43c314d3f8f"
    }
  ]
}