{
  "modId": 46538.0,
  "modName": "Castle of Blood - Large Vampire Player Home",
  "summary": "Big Castle. Full Court. Cattle. Extremely Overpowered Companion. Back story. FUN FUN FUN!!!",
  "descriptionHtml": "NPC VERSION IS RELEASED!! LET ME KNOW IN THE COMMENTS IF IT IS STILL MISSING ANY MESHES/TEXTURES!!\r\n\r\n\r\n\r\n[center]The Castle of Blood[/center]\r\n\r\n[i]A castle in a world shrouded in forever darkness. The sun does not rise. The moon does not set. Welcome to Forever Night.[/i]\r\n\r\nDescription:\r\nThere have been sightings of a vampire entering and leaving a strange cave north east of Dawnstar. Maybe you should check it out?\r\n\r\nThis castle has a rich history. It belongs to a secretive group of Vampires. Their leader is known as the King or Queen of Night. The King/Queen of Night is bound to the castle for life. The only way to become the King of night, is to kill the current one. And the only way to get rid of the castle once a Vampire becomes the King of Night, is to be killed.\r\n\r\nIt is rumored that Lamae Beolfag, the first ever Vampire was the first ruler of the Castle of Blood, though it is unknown if there is any truth behind this rumor. The one sure truth, is whoever the first Queen of Night was, Molag Bal was close to her. He created the beast that protects the beast known as Belial to protect her. In turn Belial used his darkly divine power to create the Forever Night realm for her. The realm is barren and empty, void of life except for the Castle of Blood. Belial still protects the King/Queen of Night to this day.\r\n\r\nAt the castle center is the Blood Court. The Blood Court holds the King/Queen of Nights throne as well as the seats of the nine counts and the Advisors throne. The Advisor is there simply to advice the King/Queen of Night in his/her actions. The Counts each come from one of Skyrim's holds. The Counts have their own clans and powers. They watch over their designated hold and keep their clan in line while also keeping the Forever Night realm a secret from any Vampire that may want to harm the King/Queen of Night for his/her throne. Though only a select few Vampires know they have a single Vampire King, the ones who do know are powerful enough to uphold the Kings law.\r\n\r\nThough Belial is the main source of the King of Nights protection, there are three other great warriors who watch over the great Castle of Blood. Thorne, a Frost Drake and Necromancer. He is the head of protection for the castle. Thorne's younger brother, Ramoth, a Fire Drake, assists Thorne in his duties. Turgg, a powerful Minotaur is the physical muscle of the three and knows only animal instinct.\r\n\r\nThornes two perfect creations are the undead corpses of two Drake's that stand on a ledge watching over the Blood Throne to guard it with their undying lives. The castle is also tightly guarded by the Dracoliches, skeletal Drakes also brought into unlife by Thorne.\r\n\r\nThe Butcher, a giant of a Nord watches over the Torture Chamber. It is unknown exactly what/who he is. Some of the Vampires of the Castle claim he is undead, others claim he is a vampire, but he shows no signs of being anything more than a normal Nord with an unnatural love for torture. He prepared the meals, torturing any unlucky enough to be taken to the castle. He then extracts their blood into large buckets and returns them to their cells. When one of his victims becomes to weak to continue living, he gives the dying man or woman to Turgg, who throws the body onto firepit in the Blood Court to cook for the denizens of the castle to eat.\r\n\r\nREQUIREMENTS!!! READ THIS!!\r\nSkyrim.esm\r\nUpdate.esm\r\nDawnguard.esm\r\n\r\nFunctions:\r\nThe Blood Court has four rooms branching off of it, two on each side. These rooms each have a portal that leads to either the Forge, the magic tower, the torture chamber or the display hall. Behind the throne the Court branches off again leading to three more portals, which lead to the player bedroom, the follower bedroom and the library.\r\n\r\nThe Dark Forge - \r\nAn outdoor forge. Has a skyforge, smelter, tanning rack, armor workbench and a grindstone.\r\n\r\nThe Magic Tower -\r\nA tall tower with an alchemy lab, barrels to store alchemy ingredients, an enchanters table, a weapon plaque and a chest to store enchanted gear.\r\n\r\nThe Torture Chamber - \r\n16 cattle to feed from.\r\n\r\nDisplay Hall-\r\n9 display cases, 9 mannequins, dragon priest busts\r\n\r\nArchives -\r\na HUGE amount of bookshelves. The ones like in the college of winterhold. I didn't have the patience to make 100 of the normal bookshelves, it takes a lot more work. They may NOT be safe to leave books in. I don't recall ever putting books in them on my game.\r\n\r\nLiving Quarters -\r\n6 coffins for followers, 4 book cases, same as the archives.\r\n\r\nMaster Chambers -\r\n2 coffins, 3 personal cattle for the king/queen, and a really cool door.... (lol after I first made the door, I seriously opened and closed it like 10 times because I liked it so much, lame I know!)\r\n\r\n\r\nNotes, bugs and warnings:\r\nThis castle is HIGHLY inspired by the shrouded lair POH by mrstiffy. Her POH was the full inspiration for this mod. Don't get me wrong, I'm not publishing this because I think it's better than the shrouded lair, in fact, the shrouded lair is probably twice as good of a POH, but it just didn't suit my taste. So I made this mod instead, and have been using it for a few months and decided I might as well let the wonderful members of the Nexus try it out too!\r\n\r\nThe Nord Count, Count of Eastmarch, is your stereotypical Nord. Hes vulgar, barbaric and uses some bad language. So if you just CANNOT stand dirty language, avoid talking to him.\r\n\r\nThe bookcases in BOTH the archives and the living quarters may not be safe to store things in. I never use them so they haven't been tested and even if they aren't safe, I probably won't ever fix them.\r\n\r\nSometimes, when going to one of the exterior areas, such as the forge, the sovengarde sky doesn't show, and it actually looks like a daytime sky. I don't THINK vampires will be damaged by this, I use a mod that completely removes the effects of the sun on my vampire, so if you use any kind of mod that does something like instant death by sun for vamps, be careful when going into the forge, (and possibly the magic tower).\r\n\r\nCREDITS:\r\n\r\nRunspect - Many of the used resources: [url=\"http://skyrim.nexusmods.com/mods/26132//?\"]Modders Resources[/url]\r\nZerofrost - Counts Clothing: [url=\"http://skyrim.nexusmods.com/mods/25476//?\"]Evil Mastermind Armor[/url]\r\nAmethystDeciever - Countess clothing: [url=\"http://skyrim.nexusmods.com/mods/25852//?\"]Lustmord Armor[/url]\r\nxxxNEOxxx - Advisors robe: [url=\"http://skyrim.nexusmods.com/mods/40758//?\"]JoOs Gothic Robes[/url]\r\nLifestorock and Grohiik - Monster NPCs: [url=\"http://skyrim.nexusmods.com/mods/24913//?\"]Skyrim Immersive Creatures[/url]\r\nVicn - The Butchers Helmet: [url=\"http://skyrim.nexusmods.com/mods/35902//?\"]The Mad Masker[/url]",
  "categoryId": "67",
  "version": "1.1",
  "author": "Saint Grimm",
  "createdUnix": "1383841597",
  "updatedUnix": "1383927342",
  "containsAdultContent": false,
  "uploadedBy": "saintgrimm92",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000076636",
      "name": "Castle of Blood NPC Version",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "492396",
      "fileName": "Castle of Blood NPC Version-46538-1-1.rar",
      "uploadedUnix": "1383926312",
      "modVersion": "1.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20of%20Blood%20NPC%20Version-46538-1-1.rar?fid=1000076636&ttl=1535826872&ri=8192&rs=8192&setec=d788d59a9b189595f44de5c19d7c9d35"
    },
    {
      "fileId": "1000076644",
      "name": "Castle of Blood No NPC Version",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "116801",
      "fileName": "Castle of Blood No NPC Version-46538-1-1.rar",
      "uploadedUnix": "1383927342",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6cb0033e3557cb66801724312f1b49722579931804e692bc1b7f5add3ff0550c/analysis/1407785070/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20of%20Blood%20No%20NPC%20Version-46538-1-1.rar?fid=1000076644&ttl=1535826872&ri=8192&rs=8192&setec=257cf0a5580362da4b991cc4b35f6cce"
    }
  ]
}