{
  "modId": 46548.0,
  "modName": "Sigil Stones And Other Enchanting Artifacts",
  "summary": "Adds Sigil Stones, Enchanting Skulls, Knowledge Tomes, and various other magical artifacts to Skyrim with the intention of making Enchanting more interesting.",
  "descriptionHtml": "[center][img]http://static2.nexusmods.com/110/images/110/5460035-1383792389.png[/img]\r\n[/center]\r\n[b]V1.3, Requires Dragonborn\r\n\r\nRequires a Bashed Patch to be made using Wrye Bash (http://skyrim.nexusmods.com/mods/1840/?) for maximum compatibility with other mods which change Boss Chest loot tables.[/b]\r\n\r\nBalance feedback would be appreciated!\r\n\r\nThis is primarily a test of my own modding skills, and as a result, it isn't just about Sigil Stones; you'll also find my experiment with creating a Boss Battle, my attempt at a short dungeon, and perhaps a few special artifacts.\r\n\r\nIs it Lore-Friendly? Not really, I suppose, but neither do I see it as terribly unfriendly.\r\n\r\nAlso Available on the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=192993853/]Steam Workshop![/url] This is a legitimate release using my Steam account for distribution, and will be kept updated alongside the Nexus version.\r\n\r\n[b]\r\n1. Summary\r\n2. Description\r\n3. Known Issues and Bugs\r\n4. Disclaimer\r\n5. Change Log\r\n6. Installation/Updating\r\n[/b]\r\n\r\n[size=28][b]1. Summary[/b][/size]\r\n\r\nEnchanting is such a sad, sad School of Magic. Unlike other Schools of magic, it does not have anything resembling Spell Scrolls, is a rather boring Skill, and is sometimes difficult to justify using on a primarily non-magical roleplay. \r\n\r\nThis mod aims to make Enchanting a bit more fun and accessible to non-Mages, while at the same time adding special Enchantments that will be worth a Mage's time to get. Boss Chests now have a chance to contain Knowledge Tomes and magical Enchanting Gems, and in some special locations there are even Sigil Stones, powerful magical artifacts from the realms of Oblivion. \r\n\r\n[size=28][b]2. Description[/b][/size]\r\n\r\nThe inspiration of this mod is the Sigil Stone, which in TESIV: Oblivion, could be used in the inventory to Enchant an item with a predefined Enchantment. This mod adds something similar. \r\n\r\n[i]SIGIL STONES[/i]\r\nThe greatest and most powerful of all Enchanting artifacts. Activate it in your misc tab and then exit your inventory to use it. This will open an Enchanting menu. You can either exit out and save the Sigil Stone, or use it to Enchant an item. Perks put into the Enchanting skill do not apply to items enchanted with a Sigil Stone, but all Sigil Stones provide a 2.5x Enchantment strength multiplier.\r\n\r\nUnlike in Oblivion, Sigil Stones can be used to apply any Enchantment. This is a limitation of Skyrim's Enchanting system, and I can't really get around it easily.\r\n\r\nSigil Stones can only be found in predefined locations; they have not been added to leveled lists. Look around a certain Museum in Dawnstar for a journal that might help you find a few.\r\n\r\nAs of right now, there are a pitifully small number hidden around Skyrim, but I will add more in future versions.\r\n\r\n[i]ENCHANTING GEMS[/i]\r\nEnchanting Gems are a more common, but weaker alternative to using Sigil Stones.\r\n\r\nEnchanting with an Enchanting Gem is unaffected by Enchanting Skill perks, and the Gem will only grant a 1.35x bonus to Enchantment Strength, but each Gem will also provide an additional perk, whether it be increased strength of specific Enchantments, to multiple Enchantments, to twice as much Enchantment charge on weapons.\r\n\r\n[i]ENCHANTING SKULLS[/i]\r\nThese Skulls are identical to the Enchanting Gems in function, but there are only three, hidden in Ancient Nordic Ruins on Solstheim. \r\n\r\nBoth Sigil Stones and Enchanting Gems will not increase the Enchanting Skill when used to learn or place Enchantments. Your Enchanting Skill displayed when using Sigil Stones and Gems is dependent on your current Level, and will be returned to normal upon exiting the Enchanting menu. This is done so that Enchantment strength will scale with your level, to some degree.\r\n\r\n[i]KNOWLEDGE TOMES[/i]\r\nKnowledge Tomes are Enchanted books. They cannot be equipped (though they will appear in your Armor or Weapons tab depending on what type of Enchantment they have) and are used to learn Enchantments without the need to destroy a piece of armor or weaponry. They can be found in Boss Chests, or bought from Urag Gro-Shub. \r\n\r\nMost contain vanilla Enchantments, but there are some special Knowledge Tomes hidden throughout Skyrim that hold special Enchantments, which can only be applied when used with a Sigil Stone or Enchanting Gem. \r\nArmor Enchantments of this special type will kill you when worn if applied using a normal Arcane Enchanter, and special weapon Enchantments cannot be applied with a normal Arcane Enchanter at all; however, all Knowledge Tomes, whether common or special, can be disenchanted at a normal Arcane Enchanter.\r\n\r\nList of Special Enchantments:\r\n\r\nDetect Life (Armor, allows user to Detect living and undead creatures) -Possibly buggy. Please report any issues you find.\r\n\r\nFrost Shield (Armor, +90 Armor Rating, 25% Resist Frost)\r\n\r\nFire Shield (Armor, +90 Armor Rating, 25% Resist Fire)\r\n\r\nShock Shield (Armor, +90 Armor Rating, 25% Resist Shock)\r\n\r\nChameleon (Armor, Decrease Light Level and Movement Detection by ~25% Per piece of armor equipped, up to 90% more difficult to detect while in a lit location and moving. Is not identical to and can be used effectively without Sneaking, but augments Sneaking very well. May need balancing depending on feedback.)\r\n\r\nAll-Maker's Blessing(Jewelry, Allows All-Maker Stone Powers to be kept as abilities, but all abilities, whether used or unused, are removed on unequip)\r\n\r\nDestroy Armor(Weapon, Decrease Target's Armor Rating dramatically for a few seconds)\r\n\r\nNecromancy(Weapon, On kill, Men/Mer/Beastfolk killed will be disintegrated, and their Skeletons resurrected to fight for you for 5 minutes, does not affect Conjured creature cap)\r\n\r\n[i]MISCELLANEOUS[/i]\r\nThis mod also adds some few artifacts, and a small dungeon with a possibly difficult boss fight.\r\n\r\nTo find the dungeon, look around the north-eastern parts of the Reach; there's a Mysterious House by the side of a small road that may have something interesting in the basement.\r\n\r\n[size=28][b]3. Known Issues and Bugs[/b][/size]\r\n\r\nThis mod will conflict with any that modify the All-Maker Stone Spells or the Conjure Werebear Spell Effect, as one of my special Enchantments requires that I add a perk condition in them.\r\n\r\nThis mod also edits the leveled lists used by most Skyrim and Solstheim Boss Chests, as well as Urag Gro-Shub's vendor chest.\r\n\r\nPlease, report any bugs or problems you may encounter. If you run a heavily modded Skyrim, please make sure that any issues you are experiencing are not a result of other mods.\r\n\r\nKnown Issues:\r\n\r\nSigil Stones/Enchanting Gems will allow the use of Enchanting perks if using an Enchanting overhaul such as Egocarib's Enchanting Awakened. I plan on releasing an optional patch for this, but would like to wait until I get more feedback and bug reports.\r\n\r\nBugs:\r\nNone reported yet.\r\n\r\n[size=28][b]4. Disclaimer[/b][/size]\r\n\r\nDownload at your own risk; I cannot promise that this will not do horrible things to your saves, so back them up when installing. This is my first mod, and is somewhat script-heavy, though there are no scripts which constantly run or are attached to the Player via Quest Alias. Uninstallation should be possible, but I cannot foresee what may happen when doing so. I have had no apparent instability when using this mod myself, but I cannot foresee the unforeseen, and I am not skilled enough at modding to predict disasters yet far off.\r\n\r\nThis mod adds Enchantments, and uninstalling this mod while keeping or using items with said Enchantments shall likely, if not inevitably, cause CTDs. If you wish to remove these Enchantments, I would recommend the Enchantment Cleanser mod, by SirReality: http://skyrim.nexusmods.com/mods/9894//?\r\n\r\n[size=28][b]5. Change Log[/b][/size]\r\nV1.3:\r\n-Added Dagon's Flame, Vampire's Touch, and Oblivion Energies Enchantments. They are identical to the Fire, Frost and Shock base Enchantments, and are given to you when using Sigil Stones. They can only be used with Sigil Stones. They will not be given when using a Sigil Stone obtained before updating to 1.3, but any Sigil Stones collected after the update will work properly. (This is an experiment with making Sigil Stones more similar to the ones of Oblivion, and any major overhauls of this mod will make further use of it. For now, however, Sigil Stones will remain as portable, one-use Enchanting Tables)\r\n-Fixed Chameleon Enchantment not being deadly when applied with normal Arcane Enchanters.\r\n-Tweaked the Reconstruct Spell, which was supposed to be secret but I feel compelled to add this to the change log.\r\n-Modifed the Detect Life Enchantment script to ensure that any objectreferences left undeleted at the end of the script are deleted when it re-starts. Please report any issues you may have.\r\n\r\nV1.2:\r\n-Added more Sigil Stones to the world.\r\n-Added experimental Chameleon special Enchantment.\r\n-Increased base Enchantment Strength multiplier on Enchanting Gems by 10%, for a total of 135% Enchanting power.\r\n-Fixed bug causing scripted Enchantments to stay, even when all items conferring them are unequipped\r\n\r\nV1.1:\r\n-Reconstruct spell costs a reasonable amount of Magicka.\r\n-Fixed bug having to do with grabbing Sigil Stones.\r\n-Changed Enchantment Skulls into Enchantment Gems; they are identical in function, but the file size of the .BSA has been decreased. 3 special Enchanting Skulls have been left with their original models and names, and hidden in Nordic Ruin dungeons on Solstheim.\r\n\r\nV1.0: \r\nReleased.\r\n\r\n[size=28][b]6. Installation/Updating[/b][/size]\r\nInstallation is simple, use NMM or drop all the files in the .zip into your Skyrim/Data directory.\r\n\r\nTo upgrade, unequip any items using my Enchantments, place them in a container, save, install the update, and then take your items back. This is to insure that any Scripts used by my Enchantments reset properly.\r\n\r\n\r\n\r\nThis mod's .ESP has been cleaned with TES5Edit.\r\n\r\nCredits:\r\nBethesda, for the Skyrim and Dragonborn resources used and modified by me.\r\n\r\nExnem's RuneSkulls mod for Oblivion (http://oblivion.nexusmods.com/mods/9412/?) inspired me to create my own similar items in Skyrim.\r\n\r\nEgocarib, for script help and inspiration.\r\n\r\nYoshh, for the idea to add something akin to the Rune Skulls of Exnem's mod.",
  "categoryId": "75",
  "version": "V1.3",
  "author": "VirNemo",
  "createdUnix": "1383796806",
  "updatedUnix": "1384454309",
  "containsAdultContent": false,
  "uploadedBy": "VirNemo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000076081",
      "name": "SigilStonesAndOtherArtifacts",
      "version": "V1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5269",
      "fileName": "SigilStonesAndOtherArtifacts-46548-V1-0.zip",
      "uploadedUnix": "1383796358",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cefcf46975c7d46ecb849a12f938ea896d239ccaf6da3a31afec79f39dc1e40a/analysis/1407783375/",
      "changelogHtml": " Mod Released. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SigilStonesAndOtherArtifacts-46548-V1-0.zip?fid=1000076081&ttl=1535826879&ri=8192&rs=8192&setec=f89fff2bc9dfad0870f041e537c1722c"
    },
    {
      "fileId": "1000076342",
      "name": "SigilStonesAndOtherArtifactsV1point1",
      "version": "V1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3255",
      "fileName": "SigilStonesAndOtherArtifactsV1point1-46548-V1-1.zip",
      "uploadedUnix": "1383851895",
      "modVersion": "V1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3c671784d63921ec6a6d24763bbd4021d5f75c0a46008c4a4ecac911b9bf97f7/analysis/1407784013/",
      "changelogHtml": " -Reconstruct spell costs a reasonable amount of Magicka.\r<br />-Fixed bug having to do with grabbing Sigil Stones.\r<br />-Changed Enchantment Skulls into Enchantment Gems; they are identical in function, but the file size of the .BSA has been decreased. 3 special Enchanting Skulls have been left with their original models and names, and hidden in Nordic Ruin dungeons on Solstheim. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SigilStonesAndOtherArtifactsV1point1-46548-V1-1.zip?fid=1000076342&ttl=1535826880&ri=8192&rs=8192&setec=b3d8dda3abda167c66a26d8d6cfe29b2"
    },
    {
      "fileId": "1000077474",
      "name": "SigilStonesAndOtherArtifactsV1point2",
      "version": "V1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3258",
      "fileName": "SigilStonesAndOtherArtifactsV1point2-46548-V1-2.zip",
      "uploadedUnix": "1384114497",
      "modVersion": "V1.2",
      "virusScanUrl": "https://www.virustotal.com/file/2307706353ac1ab73163f217c57ab78afc330d111a58f9af3370aabf67016f61/analysis/1407787782/",
      "changelogHtml": " -Added more Sigil Stones to the world.\r<br />-Added experimental Chameleon special Enchantment.\r<br />-Increased base Enchantment Strength multiplier on Enchanting Gems by 10%, for a total of 135% Enchanting power.\r<br />-Fixed bug causing scripted Enchantments to stay, even when all items conferring them are unequipped <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SigilStonesAndOtherArtifactsV1point2-46548-V1-2.zip?fid=1000077474&ttl=1535826880&ri=8192&rs=8192&setec=a8e969ebc06076e880de5e31376a7e73"
    },
    {
      "fileId": "1000078923",
      "name": "SigilStonesAndOtherArtifactsV1point3",
      "version": "V1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3808",
      "fileName": "SigilStonesAndOtherArtifactsV1point3-46548-V1-3.zip",
      "uploadedUnix": "1384454309",
      "modVersion": "V1.3",
      "virusScanUrl": "https://www.virustotal.com/file/6a1099ea1e095ccae6ec1f378b9e53deda5a43c6c9120138b615933d5c148204/analysis/1407792369/",
      "changelogHtml": " -Added Dagon&#39;s Flame, Vampire&#39;s Touch, and Oblivion Energies Enchantments. They are identical to the Fire, Frost and Shock base Enchantments, and are given to you when using Sigil Stones. They can only be used with Sigil Stones. They will not be given when using a Sigil Stone obtained before updating to 1.3, but any Sigil Stones collected after the update will work properly.\r<br />-Fixed Chameleon Enchantment not being deadly when applied with normal Arcane Enchanters.\r<br />-Tweaked the Reconstruct Spell, which was supposed to be secret but I feel compelled to add this to the change log.\r<br />-Modifed the Detect Life Enchantment script to ensure that any objectreferences left undeleted at the end of the script are deleted when it re-starts. Please report any issues you may have. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SigilStonesAndOtherArtifactsV1point3-46548-V1-3.zip?fid=1000078923&ttl=1535826881&ri=8192&rs=8192&setec=baa102df21a0707ff751a37d52279653"
    }
  ]
}