{
  "modId": 46586.0,
  "modName": "Snow Gate Farm",
  "summary": "This is a small lore style nord home. With unique storage, a forge, and a beautiful location.\r<br />It is meant for a nord talos worshiper play through, can be for a ranger, warrior, or mage, but generally for a &#34;good&#34; play through rather than a thief or assassin character. ",
  "descriptionHtml": "[center][color=#92CDDC][font=Impact][size=6]Snow Gate Farm\r<br />[/size][/font][/color][/center]\r<br />[center]I will be working on a skyrim SE version for all of my mods as well as mods that i have not finished and uploaded, so new mods may be coming as\r<br /> well, please be patient as i begin testing.[/center]\r<br />\r<br />[color=#92CDDC][font=Impact][size=5][color=#92CDDC][font=Impact][size=5]What is it[/size][/font][/color][/size][/font][/color]\r<br />[size=2][left]This is a small lore style nord home. With unique storage, a forge, and a beautiful location. It is meant for a nord talos worshiper playthrough, can be for a ranger, warrior, or mage, but generally for a &#34;good&#34; character rather than a thief or assassin character.[/left][/size][line]\r<br />\r<br />[color=#92CDDC][font=Impact][size=5]Why it was made[/size][/font][/color]\r<br />This house mod was created because I wanted a nord themed home close to both Windhelm and Whiterun but not finding anything that fit my particular wants from a home I created my own.\r<br />[line]\r<br />[color=#92CDDC][font=Impact][size=5]\r<br />Location[/size][/font][/color]\r<br />In order to find the home you need to go just past mix water mill outside Windhelm, and stop when you see a stack of stones with a nordic banner attached, follow these banners up the cliff until you reach the home. Then you will need to read the note near the door, and solve the quest of finding and getting the key; then the home is yours.\r<br />[line]\r<br />[color=#92CDDC][font=Impact][size=5]\r<br />What it is[/size][/font][/color]\r<br />It is a small house with a farm, by a lake in front of one of the secret Talos shrines. It has full crafting stations, and a small archery range to the side of the farm. inside the house there is an upstairs bedroom portion; underneath is a alchemy and enchanting workstation; in the basement is the kitchen area, as well as a small bedroom area for followers, and hopefully children when i figure it out. \r<br />\r<br />the home includes many custom containers and most other things are covered in named storage, as well as some un-named storage space for other items. \r<br />\r<br />The home also has a manikin, lots of shield racks in the main room, weapon placks and weapon racks. \r<br />This was designed in mind of frostfall and realistic needs and diseases, you do not need these mods to have this one, but the location of the house as well as placement of items has been effected by these. \r<br />\r<br />I have tried to not give to many items, the outside has had plenty of ingredients added, some obvious, some hidden, but inside most movable clutter doesn’t have much value, except some rare books, pertaining to nord lore.\r<br />[line]\r<br />[color=#92CDDC][font=Impact][size=5]\r<br />Requirements[/size][/font][/color]\r<br />It requires Skyrim (obviously)\r<br />As well as Hearthfire\r<br />fetures from &#34;Hearthfire multiple adoptions - Now with custom home support for kids and spouse&#34;\r<br />will be a later feature in the next release, however it will NOT be a requirement\r<br />[line]\r<br />\r<br />[color=#92CDDC][size=5][font=Impact]\r<br />Incompatibility[/font][/size][/color]\r<br />The book shelves in the home are static, so they have the look of a bookshelf, or a small container for notes, however this means the static bookshelves are incompatible with the popular Book Covers mod, they still work together, however the books in the bookshelf are not effected by the retexture, because of how the mod changes the textures, anything that changes the vanilla textures, like a texture pack, should still work however.\r<br />\r<br />Also any mod that changes the same area the where the house is located will also not work.\r<br />[line]\r<br />Please do not edit and distribute this mod without my permission, and please do not re-distribute it on any sight other than the Skyrim nexus if permission is given",
  "categoryId": "67",
  "version": "2.3",
  "author": "Nord Kitten",
  "createdUnix": "1383854619",
  "updatedUnix": "1383854226",
  "containsAdultContent": false,
  "uploadedBy": "NordKitten",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000076323",
      "name": "Snow Gate Farm",
      "version": "2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27669",
      "fileName": "Snow Gate Farm-46586-2-2.zip",
      "uploadedUnix": "1383849886",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/8441d359662f4629f00d94b50ee740e059945c152af32fc2e05c0260ec177dee/analysis/1407784003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Snow%20Gate%20Farm-46586-2-2.zip?fid=1000076323&ttl=1535826921&ri=8192&rs=8192&setec=02bef45dc4d2e31d1d501a838bf17a05"
    },
    {
      "fileId": "1000076350",
      "name": "Snow Gate Farm",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27669",
      "fileName": "Snow Gate Farm-46586-2-3.zip",
      "uploadedUnix": "1383854226",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/66db5fa21e584c1950c9e5a85400a1366bbf3013f59341ab231d241c489ed19f/analysis/1407784104/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Snow%20Gate%20Farm-46586-2-3.zip?fid=1000076350&ttl=1535826922&ri=8192&rs=8192&setec=22c926d2b0ddd98055930a44e60f3fcf"
    }
  ]
}