{
  "modId": 46687.0,
  "modName": "Walk On Water",
  "summary": "Simple mod, adding a \"walk on water\" spell to Skyrim. ",
  "descriptionHtml": "[size=200]Description[/size]\r\n\r\nThis is the first mod I have ever made for any game. It is very simple and adds a chest near Dawnstar with a spell tome for a sustained walking on water spell. \r\n\r\nI have found several water walking mods out there, but they mostly seem to be spells with active effects, meaning you cast the spell once and can walk on water for X amount of seconds. This version uses a sustained spell, meaning you must be constantly casting as you are walking on water or you will fall in. This allows higher level players to walk on water for longer and also means your combat options are more limited when walking on water. \r\n\r\n[size=200]Location[/size]\r\n\r\nThe chest is located on the north coast of Skyrim, just east of Dawnstar. It is located near some washed ashore debris from the vanilla game, so I imagine it washed ashore from that very same ship that crashed. Check the short video below to see exactly where it can be found.\r\n\r\nhttp://www.youtube.com/watch?v=7mkqRS97Sw0\r\n \r\n[size=200]Requirements[/size]\r\n\r\nJust the main Skyrm esm. Nothing else is needed.\r\n\r\n[size=200]Installation[/size]\r\n\r\nNothing special. Just download the esp with your favourite mod manager and activate the file or download manually and drop the esp in your Skyrim data folder. \r\n\r\n[size=200]Compatibility[/size]\r\n\r\nUses no scripts, so should be safe to install/uninstall as you like. It should also be compatible with almost every mod out there. Mods that alter the vanilla waterwalking effect likely won't be compatible. Also any mods that modify the area where the chest is located may not be compatible. Everything else should work without a problem. \r\n",
  "categoryId": "75",
  "version": "1.1",
  "author": "TheHyperBole",
  "createdUnix": "1383962448",
  "updatedUnix": "1384160835",
  "containsAdultContent": false,
  "uploadedBy": "TheHyperBole",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000077718",
      "name": "WalkOnWater",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "WalkOnWater-46687-1-1.zip",
      "uploadedUnix": "1384160835",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/57fdf5573af61890dee4f52eb364430a313c4a45c7527788c0472fd1d97a10cd/analysis/1407788438/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WalkOnWater-46687-1-1.zip?fid=1000077718&ttl=1535826997&ri=8192&rs=8192&setec=70a0798dd44323547ab536c5218252dd"
    }
  ]
}