{
  "modId": 46680.0,
  "modName": "Lively College of Winterhold",
  "summary": "Adds 20+ NPCs to Winterhold's College, each with a unique schedule.",
  "descriptionHtml": "I always thought the College was a little threadbare. There are a lot of people that *were* in the College, revealed through the story. The High Elf you rescue from the mages because he stole the books, the missing students, and rogue wizards makes it seem like the College is diverse and a hub of magic activity, but there are only a few people in the College. I aimed to change that by adding, as of now, around 21 characters to the College. This includes:\r\n\r\n9 Arcane Students (Ranging from Novice to Adept, signified by their robes)\r\n3 Maids who clean up after the messy experiments\r\n6 Scholars who come from across Tamriel, currently visiting the Arcaenium for various reasons.\r\n2 'Special' NPCs, a Hagraven professor and a witch who accidentally turned herself into a chicken.\r\n\r\nAll NPCs are named accordingly for their races. No immersion breaking will be found in a Nord called Charles. \r\n\r\nAs of now most everyone has a unique backstory that you can discover by asking \"What brings you to the College?\". Based on their personality they'll give you a varying level of answers revealing many things about themselves. There's a treasure hunter in the Arcaenium looking for references on his next mark, a refugee from Hammerfell among the students, and more. This isn't voiced, but is only a few lines long at most.\r\n\r\nThe AI packages are also fully functioning. Most NPCs will now eat in the Inn in Winterhold, sleep in bedrolls in the Hall of Attainment, and wander around the College during the day. \r\n\r\nI may later expand upon this mod if I feel like it, adding more wizards and visiting people from across the world.",
  "categoryId": "33",
  "version": "1.0",
  "author": "ArchMageMatt",
  "createdUnix": "1383955264",
  "updatedUnix": "1383957897",
  "containsAdultContent": false,
  "uploadedBy": "ArchMageMatt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000076792",
      "name": "Lively College",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "Lively College-46680-1-0.zip",
      "uploadedUnix": "1383957897",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/05d6a523c08647c965603510b5176055fe093d2890ec295051c47d2653aea7c9/analysis/1407785413/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lively%20College-46680-1-0.zip?fid=1000076792&ttl=1535826987&ri=8192&rs=8192&setec=abd0a00a9e91b1efc77f7d698014aec4"
    }
  ]
}