{
  "modId": 46740.0,
  "modName": "Dovah Brewery",
  "summary": "Skyrim has Blackbriar, Honningbrew, Firebrand, and numerous other types of beverages for the hard working adventurer. The only thing missing? Beer!  To quote an all familiar term: \"...mead, mead, mead... kill him to get some beer every now and then? Stupid bees and their stupid honey...\".<br /><br />Step into Dovah Brewery and start m",
  "descriptionHtml": "Shortly after making your escape from Helgen, you will find that someone has paid a courier to deliver advertisements to Skyrim's inhabitants. Your adventures will introduce to you a man who hap-hazardously operates his brewery, and his trusty assistant who is at his wits end with his job.\n<br />\n<br />Dovah Brewery has the following features after completing the main quest-line:\n<br />1. Brewing equipment capable of making over 100 varieties of ale stemming from three base varieties. For instance, you can make a base Pale Ale, then add honey to the boil to produce \"Dovah Honey Pale\" that will restore stamina and improve your block ability for a while. You will have to experiment with alchemical ingredients and raw food ingredients to discover more on your own. Be careful though, you might waste two weeks worth of brewing on a skunked batch of beer.\n<br />2. A courtyard with a hops trellis and barley bundles ripe for the picking. You will also find soil capable of growing hops and barley, respectively. The original hops vines and barley bundles will respawn during regular cell respawn intervals, but the soil will be ready to harvest on the same time intervals as Heartfire planter soils. (Which I believe is three days)\n<br />3. In addition to the brewing equipment, the basement also houses the following: an Arcane Enchanter, Smelter, Tanning Rack, Blacksmith Anvil, Workbench, Grinding Wheel, Wood Chopping Block, and plenty of storage for all of your crafting needs.\n<br />4. The main floor has furnishings for an Inn complete with rooms and tables for all of your revelers. (There will be a quest-line later that introduces these features to Dovah Brewery)\n<br />5. The top floor is reserved for the owner of Dovah Brewery, you! The top floor contains bedroom furnishings that would rival even the wealthiest of nobles' bedrooms. This floor also contains an armory complete with weapon racks, weapon plaques, and mannequins. Additionally, this armory contains planter boxes (four of which are capable of growing Nirnroot), an alchemy table, a satchel, and a potion cabinet for your alchemical needs.\n<br />\n<br />So, download Dovah Brewery and experience what it is like to make the greatest brew in all of Skyrim!\n<br />\n<br />Author's Note: This is my first mod, well, the first mod I've completed to a useable extent anyhow. This mod has been cleaned of any dirty edits using TES5Edit. The reason I mention this, is, gathering all of the files for packaging into my .bsa has been a chore and as far as my testing in concerned, I got every file I needed included. I am keeping this in a Beta stage as I will be fixing any reported bugs, glitches, or whatever else I see fit to make Dovah Brewery a great brewing experience.\n<br />\n<br />In regard to the brewing process, I created the process to come as close as possible to making real beer! I have been a home brewer for well over ten years and it has been the single-most rewarding hobby I have every gotten into. I created Dovah Brewery to mimic this process as close as possible without it being over-the-top in regard to specific processes and techniques.\n<br />\n<br />Known Issues:\n<br />1. The main water supply valve to the windmill pump can take up to 10 seconds to actually animate and activate the water supply valve script. Simply activate it, and wait 10 seconds or so it will do what it is suppose to do.\n<br />2. There is some clipping with a few pieces of pipe for the brewing equipment. Not game breaking, but it has been noted.\n<br />\n<br />Required DLC/Mods:\n<br />1. Hearthfires\n<br />\n<br />***********UPDATE INFORMATION****************\n<br />Dovah Brewery 1.1 Changelog:\n<br />\n<br />1. Weapon plaques should now properly allow weapons to be returned.\n<br />2. Set the Brewery to a NoResetZone, this fixed issues with containers respawning and mannequins unequipping/removing gear.\n<br />3. Replaced the following containers with new custom containers that are player owned and do not respawn:\n<br />   a. Chest in hallway near wardrobe\n<br />   b. Satchel near alchemy table on top of the potion cabinet\n<br />   c. Four \"empty\" barrels\n<br />   d. Apothecary's satchel on the bookshelf\n<br />\n<br />4. Fixed the alchemical properties for barley, it should now have (Restore Health, Restore Magicka, Fortify Health Regen, Fortify Magika Regen). Both barley and hops are intentionally created to produce extremely weak potion effects to discourage use in alchemy.\n<br />5. Removed the bandit in the basement, this was accidentally left enabled after I was testing navmeshes for the brewery.\n<br />6. Reworked the navmesh for the brewery exterior, any transients should now move around the brewery rather than through it. ***Requires further testing***\n<br />7. Fixed a cosmetic issue with the exterior portion of the house with the alcove in the courtyard.\n<br />8. Made some scripting changes to a few brewery parts which may help with a few reported issues.\n<br />9. Scaled down pottery in the brewery to a more \"realistic\" size\n<br />10. Scaled down the model for planted barley to a more realistic size.\n<br />11. Cleaned up a few ITM errors in TES5Edit\n<br />\n<br />\n<br />Dovah Brewery Upcoming Changes:\n<br />1. Working with RND to make an additional plugin with Dovah Brewery.\n<br />2. Lighting re-work for the interior of the brewery\n<br />3. Possible retexturing of ale bottles.\n<br />\n<br />Special Thanks To:\n<br />aussie500 - For many glitch reports/suggestions\n<br />UWShocks - For pointing out a few missed ITM errors in TES5Edit\n<br />\n<br />Dovah Brewery 1.2 Changelog:\n<br />\n<br />1. Fixed an issue with the main quest-line that cause players not to be able to proceed if they acquired the amber ale case or pale ale case before being asked to by Olaf. ***IF YOU ARE STILL ON THE QUEST THIS FIX WILL NOT APPLY, SEE THIS MOD'S POSTS FOR THE WORKAROUND***\n<br />2. Fixed a cosmetic issue by disabling a rock near the windmill in the river that had a main water line going \"through\" it.\n<br />3. Olaf's bedroll should not be Owned after certain unforeseeable circumstances.\n<br />4. Added lighting effects to the main brewery! Keep an eye out for flickering lights and lighting glitches. (I think I got them all, but you never really know)\n<br />5. Fixed a few issues with missing floor pieces in some corners of the brewery.\n<br />6. Disabled interaction with the \"hidden door\" in the brewery and added two pull chains, one inside and one outside of the door.\n<br />\n<br />Dovah Brewery Upcoming Changes:\n<br />1. Still working on RND integration via additional file.\n<br />2. Possible re-texturing of the ale bottles.\n<br />\n<br />Special Thanks To:\n<br />aussie500 - For his/her awesome attention to detail\n<br />UWShocks - For a few nice suggestions \n<br />\n<br />Dovah Brewery 1.3 Changelog:\n<br />\n<br />1. Added a Strongbox named \"Gold\" to the armory table, for those who would like to stash his or her wealth. (Or if you have a mod that gives weight to currency)\n<br />2. Added a mannequin to the master bedroom.\n<br />3. Added a few pieces of clutter\n<br />4. Fixed an issue that caused the courier not to show up to start the questline.\n<br />5. Added a copy of the Dovah Brewery Advertisement to the countertop of the Sleeping Giant Inn in Riverwood. Those who have loaded the mod and have not had the courier arrive should have a look at this advertisement to start the main questline.\n<br />6. Fixed an issue on the stairs for the brewery exterior that caused people to fall through the top two planks.\n<br />7. Added a sign post to the brewery in preparation for a custom sign for Dovah Brewery. This also remedied the issue with the floating rope that seemed to not be attached to anything.\n<br />8. Fixed a bug with the brewery scripting that caused special ingredients to sometimes not be used.\n<br />9. Changed the failure rate on special ingredients to be more forgiving when you add a wrong ingredient.\n<br />10. Removed the bucket and broom from the pantry and added some foodstuffs.\n<br />11. Added three display cases to the master bedroom below the shrines.\n<br />\n<br />Dovah Brewery Upcoming Changes:\n<br />1. Tweaking of Navmesh for the Brewery",
  "categoryId": "69",
  "version": "1.3",
  "author": "adarbyem",
  "createdUnix": "1384031997",
  "updatedUnix": "1386098985",
  "containsAdultContent": false,
  "uploadedBy": "adarbyem",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000080853",
      "name": "IMCN Patch - Dovah Brewery",
      "version": "1.2b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "IMCN Patch - Dovah Brewery-46740-1-2b.7z",
      "uploadedUnix": "1384892707",
      "modVersion": "1.2b",
      "virusScanUrl": "https://www.virustotal.com/file/7cd8eefe1c47c2e35dca88265a8bfcec50f150a290c6fca1b6b7d71fe8987e8a/analysis/1407799763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/IMCN%20Patch%20-%20Dovah%20Brewery-46740-1-2b.7z?fid=1000080853&ttl=1535827039&ri=8192&rs=8192&setec=5b78f1b9e6e271a0b546ce76f0c621e1"
    },
    {
      "fileId": "1000085273",
      "name": "Dovah Brewery",
      "version": "1.3b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30503",
      "fileName": "Dovah Brewery-46740-1-3b.zip",
      "uploadedUnix": "1386098985",
      "modVersion": "1.3b",
      "virusScanUrl": "https://www.virustotal.com/file/a93b4e0cc60ba5ffb1d0e6c6b977e7151da9787a7a6e33ff18e689230e365667/analysis/1407818316/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovah%20Brewery-46740-1-3b.zip?fid=1000085273&ttl=1535827040&ri=8192&rs=8192&setec=269842f4db98329f01507e5e701d886f"
    }
  ]
}