{
  "modId": 46751.0,
  "modName": "Under Skyrim - Alternate Travel System of Tunnels - beta",
  "summary": "Navigate Skyrim underground in this ancient abandoned tunnel system. Do be careful!",
  "descriptionHtml": "*Project Statement* \n<br />I am currently looking for a lead designer/project manager (someone who knows the right people that can get the job done).  This project is in desperate need of programmers (scriptors), animators and character designers, and audio/special FX gurus.  If you have any talent at all in these areas of specialty, then contact me asap.  Of course there is no capital to be had.  But this could be an amazing project if only the right people were to see the development to fruition. Please give this mod a test run.  It doesn't conflict with any \"known\" mods and it doesn't require any DLC.  Thanks, now on to the mod:\n<br />\n<br />(BETA)\n<br />\n<br />Background: An ancient tunnel system has been discovered in Whiterun just behind Breezehome via a well.  Once entered you are instantly overwhelmed by the dark and dank creepy surroundings.  But beware the darkness may consume and drive one mad!  You find this to be a new experience unlike any other mod has presented before.  This is indeed an alternate way of navigating Skyrim, but underground!  In a vast labyrinth of ancient sewage system.  What lies beneath?  What will you discover?  \n<br />\n<br />Behind the scenes: There is no music in the tunnels.  This was meant for adding immersion.  Currently the tunnels connect Whiterun to Lorius Farm to Windhelm, Whiterun to Honningbrew, to Riverwood, to Falkreath (Lake Inalta).  Beware of the sewer rats!  Just kidding, they're rather timid little creatures much like real rats.  EDIT: I just tried the mod and the rats aren't timid.  I will have to fix that as they are supposed to be little wimps that are just roaming around and (being rats). You will however discover there are some dangers to be watchful of.  There is currently NO follower support!!  Nav meshing will be added soon.\n<br />\n<br />Please test and report any bugs.  All feedback negative/good is welcome and appreciated :)  Keep in mind, this is an EVOLVING MOD.  If you have any bright ideas share them.  If something should be scrapped say so!  \n<br />\n<br />Thanks for looking at my mod.  It is currently in development stages and if enough kudos are given it will be continued further.  As is, a test mod.",
  "categoryId": "78",
  "version": "0.01",
  "author": "SkyriManiak",
  "createdUnix": "1384039640",
  "updatedUnix": "1384132275",
  "containsAdultContent": false,
  "uploadedBy": "SkyriManiaK",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000077094",
      "name": "UnderSkyrim - ATS Beta",
      "version": ".01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "786",
      "fileName": "UnderSkyrim - ATS Beta-46751--01.7z",
      "uploadedUnix": "1384039631",
      "modVersion": ".01",
      "virusScanUrl": "https://www.virustotal.com/file/0e7dbeb2bb16fe61ee4931b6e933c0bf5606db80d2a9200888708052c2a1d212/analysis/1407786792/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UnderSkyrim%20-%20ATS%20Beta-46751--01.7z?fid=1000077094&ttl=1535827047&ri=8192&rs=8192&setec=169493228ae28c3d5d80d6d15545f47e"
    },
    {
      "fileId": "1000077623",
      "name": "UnderSkyrim - Difficult",
      "version": ".01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "100",
      "fileName": "UnderSkyrim - Difficult-46751--01.7z",
      "uploadedUnix": "1384132275",
      "modVersion": ".01",
      "virusScanUrl": "https://www.virustotal.com/file/8e02149d51ba5bac6f2a214b2c5155ec42a338b377d820ee953a1a00a1273d07/analysis/1407788102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UnderSkyrim%20-%20Difficult-46751--01.7z?fid=1000077623&ttl=1535827048&ri=8192&rs=8192&setec=6a30e1ab28287463141702d7b242a3df"
    }
  ]
}