{
  "modId": 46767.0,
  "modName": "The Noble Chaurus",
  "summary": "Follow a madman into the heart of a Chaurus nest and emerge with powerful (but small) new allies!",
  "descriptionHtml": "[center]\r\n[youtube]EHTueVrcH3c[/youtube]\r\n[/center]\r\n[color=#CCCCFF][size=3]\r\n[i]Word has reached me of a Reaper sighting in Shimmermist cavern. For reasons I cannot fathom, the Argonian hunter that proved so helpful to me throughout the early stages of my research refuses to accompany me on this expedition. I have explained that after I extract the pheromone from an adult, the Chauruses of the colony will treat me as one of their own, but he says he will have no part in it. \r\n\r\nSo be it. The loss is entirely his. Scholars will record that Nevio Vermis was the first man to tame the Chaurus, and that he did so alone. I go now to Shimmermist cavern, where my destiny awaits me.\r\n\r\n- Nevio Vermis[/i]\r\n[/size]\r\n\r\n\r\n[center][b][size=4]The Noble Chaurus[/size][/b][/center]\r\n\r\nThe Noble Chaurus is, fundamentally, a mod that lets you summon and command small Chauruses called nymphs. If you've ever played Half-life 2, specifically the invasion of Nova Prospekt using antlions, then you know exactly what I was aiming for when I started this mod. Of course, this is a very powerful skill, so I couldn't just [i]give[/i] it to you, now could I?\r\n\r\n[b]Now available in German, courtesy of [url=http://forums.nexusmods.com/index.php?/user/3507075-nahkin/]Nahkin[/url]![/b]\r\n\r\nAlso available on Steam Workshop: http://steamcommunity.com/sharedfiles/filedetails/?id=194040411\r\n\r\n[size=3]Getting started[/size]\r\n\r\nIf you are level 30 or higher, the courier should track you down near any major city. He'll deliver a note and a book; read the note to start the quest.\r\n\r\n\r\n[size=3]Using the pheromone canister[/size]\r\n\r\n[list]\r\n[*]As long as the canister is in your inventory, chauruses will not attack you, even if you attack them. Chauruses within aggro range of you will come to your aid if you are attacked, and may follow you briefly as you go by. \r\n[*]If you equip the canister (it is a one-handed staff), you can summon Chaurus nymphs by firing it where there is soil or mud. If you fire it at an enemy, the nymphs will immediately attack them. Otherwise, they will follow you around until they get bored and wander off (about 30 seconds). \r\n[*]Control where the nymphs go by firing blobs of pheromone. Any creature that is hit by or wanders through the pheromone cloud while it lingers will be a target for them.\r\n[*]NPCs will treat a direct hit by pheromones as an assault, but if they simply wander through the cloud and get attacked, you will not be blamed.\r\n[*]If a friendly chaurus is blocking your path, you can give it a shove with the Activate button (E by default). This does not work on Chaurus Hunters, but if you stand near them, they should move after a moment. You could kill them to get them out of the way, but you would be a horrible person for doing so. Remember, they all think you're their mommy!\r\n[*]Right now the canister has infinite ammo; this will probably change in a future update.\r\n[/list]\r\n\r\n[size=3]Mod Control Manager[/size]\r\n\r\nIf you're running SkyUI, you can set how many nymphs you can command at once (from 4 to 9, if you want more than that see the FAQ below), as well as disable some of the visual effects and integration with Chaurus Lights. \r\n\r\n[size=3]Notes[/size]\r\n\r\n[list]\r\n[*]The boss of the quest is fairly tough. Although you can do the quest starting at level 30, you may be better off waiting until level 35 or so. For more detailed info, see the FAQ below.\r\n[*]The final sequence spawns a large number of actors. If your system can barely run Skyrim under normal circumstances, you may experience major performance issues here. \r\n[/list]\r\n\r\n[size=3]Compatibility[/size]\r\n\r\n[list]\r\n[*]This mod modifies Shimmermist Cave, which is sometimes a radiant quest destination. Though I have been careful not to modify the vanilla NPCs, it is possible that if you get a random radiant quest for Shimmermist, it may be difficult to complete. \r\n[*]This mod can use features from my other chaurus-related mod, Chaurus Lights, though it is not needed to enjoy The Noble Chaurus.\r\n[*]This mod is compatible with Immersive Creatures (including the humanoid Chaurus Warriors) and Automatic Variants. \r\n[/list]\r\n\r\n\r\n[size=3]Todo[/size]\r\n[list]\r\n[*]Add an easier option for defeating the Queen if you're a stealth-centric character. \r\n[*]Make the canister refillable. Right now it has infinite ammo, which makes it extremely overpowered.\r\n[*]Tweak some minor quirks in the nymph behavior.\r\n[*]Provide a method for pushing or otherwise moving Chaurus Hunters (see Known Bugs section).\r\n[*]Clean up Shimmermist better after the quest. Right now it stays rather... crawly.\r\n[/list]\r\n\r\n\r\n[size=3]Known bugs[/size]\r\n\r\n[list]\r\n[*]On some, but not most, systems, summoning the nymphs may cause a random CTD. If you experience this, go into the MCM and uncheck the option marked \"Use Dirt pile effect\". This should improve matters for you. If for some reason you're not using MCM, you can use the console: \"set CHPHOptionUseDirtPile to 0\" should be the command.\r\n[*]It is possible to deliberately \"sequence break\" the cave and screw up the final battle, but there should be no way to do it by accident without god-moding.\r\n[/list]\r\n\r\n\r\n[size=3]FAQ[/size]\r\n\r\n Q. The courier hasn't given me anything.\r\n A. Make sure you're at least level 30, then hang out in one of the big cities. He should show up quickly. If not, check your quest log and see if you have any quests listing Shimmermist Cave as a destination. If you do, you'll have to complete them before he'll show up.\r\n\r\n Q. How do I kill the Queen?\r\n A. She's tough, and she has a lot of friends. Bring health potions. If you read the journal you find in the cave, you'll know where to find some Poison Resist potions, too. They'll help a lot. If you're decent at alchemy, bring some extras with you just in case. She should be killable with almost any skill set, but be warned there is not much cover and no completely safe place to stand or hide. If you are a stealth character, be prepared to spend a lot of time running. Remember, she doesn't need to see you... she can smell you. If you're a mage, cloak spells will make quick work of the nymphs she summons without draining your magicka too much. If you're melee, be careful. Her attacks are quite strong, and going toe-to-toe with her will probably go badly for you. Float like a butterfly, sting like a bee.\r\n\r\n Q. But her health keeps refilling!\r\n A. She's invulnerable when she curls up. But you see her bleeding? She's weaker after each invulnerable interval, and your attacks will do more damage. You'll get her.\r\n\r\n Q. Isn't the canister awfully overpowered? \r\n A. Yeap. I'm probably going to make it consume some hard-to-find resource with each use, though in the interest of fun, I'll add an MCM option to toggle the infinite ammo back on. Sometimes it's fun to lay waste to a bandit fort by watching tiny chauruses tear them to shreds.\r\n\r\n Q. I want to summon more than 9 nymphs at a time!\r\n A. Ok. The maximum number of nymphs you can have is controlled by the GlobalVariable CHPHNymphMaxCount. From the console, type \"set CHPHNymphMaxCount to X\" where X is the number of nymphs you want. Note that only 9 of the nymphs will respond to your commands. The rest will follow you around and attack your enemies but will not respond to the pheromone cloud. I've set it as high as 100, but I made 9 the max because they rapidly begin to body-block each other rather than attack.\r\n\r\n Q. I can't change the number of nymphs in MCM.\r\n A. It's locked until you have obtained the canister. If you have the canister and it's still locked, do \"set CHPHCanisterObtained to 1\". \r\n\r\n[size=3]History[/size]\r\n2013/11/10 - Initial release.\r\n\r\n[/color]\r\n\r\n",
  "categoryId": "35",
  "version": "1.0",
  "author": "Verteiron",
  "createdUnix": "1384073183",
  "updatedUnix": "1384233956",
  "containsAdultContent": false,
  "uploadedBy": "verteiron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000077221",
      "name": "TheNobleChaurus100",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6017",
      "fileName": "TheNobleChaurus100-46767-1-0.7z",
      "uploadedUnix": "1384071121",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9da4d28414736606377cf66bc709f111d9b216854543364abb22f6f88db5fbdf/analysis/1407787176/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheNobleChaurus100-46767-1-0.7z?fid=1000077221&ttl=1535827073&ri=8192&rs=8192&setec=411b1bbe7733a8e3b4cd8bdb81e1bac0"
    },
    {
      "fileId": "1000077981",
      "name": "TheNobleChaurus100German",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "65",
      "fileName": "TheNobleChaurus100German-46767-1-0.7z",
      "uploadedUnix": "1384233956",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8f0ac562fce6fb802b456bc8abac54e32eefb6f33678224f54a9f5751056fb9d/analysis/1407789506/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheNobleChaurus100German-46767-1-0.7z?fid=1000077981&ttl=1535827073&ri=8192&rs=8192&setec=fdff6fce24df053af22e952442ca2020"
    }
  ]
}