{
  "modId": 46828.0,
  "modName": "Hatreds Heart and Hatreds Soul Return",
  "summary": "Remakes the Hatred weapons, a unique daedric bow and mace with custom enchantments and the Hatred&#39;s Soul Arrow into the game.",
  "descriptionHtml": "REQUIRES THE LATEST SKYRIM UPDATE&#33;\r<br />\r<br />UPDATE- Ver 1.1.0 Leveling Fix (3/2/14)\r<br />Today I finally took it upon my self to fix a error within this mod. I assumed that  Merhunes Dagon&#39;s quest started at level 10. Well I was wrong it starts at level 20. This made some of the earlier versions of the weapon completely unobtainable and made the leveling unbalanced. This fix ups the level requirements for all versions of the weapon by 10 levels making the first version obtainable at level 20 and the best version at level 39. Therefore this makes the leveling more balanced removes the earlier versions from being unobtainable. Happy hunting and stay frosty&#33;\r<br />\r<br />THE BACKGROUND AND PLACEMENT:\r<br />\r<br />Hello,\r<br />I&#39;m sure if you played Oblivion you will remember these weapons especially Hatred&#39;s Soul as combined with it special Hatred&#39;s Soul Arrows, at least in the vanilla game of Oblivion it was the best bow in the game. I have basically recreated this and added Hatred&#39;s Heart the unique mace, Hatred&#39;s Soul the unique bow, and the Hatred&#39;s Soul Arrows into Skyrim. To find them you will need to be at the very least level 10 and will need to do the quest &#34;Pieces of the Past&#34; and gain entry into the Shrine of Mehrunes Dagon. Inside you will find a chest called the Hatred Chest with it you can obtain a leveled version of the bow and mace all the way up to level 29 which yields the best and highest level of the bow and mace. The arrows aren&#39;t leveled and will stay the same no matter what level you are at. The chest also respawns so this should make you able to obtain more of the arrows later on if you run out and also should allow you to get a higher level of the bow later on after you do the quest.\r<br />\r<br />THE ENCHANTMENTS:\r<br />\r<br />Here is how the enchantment on the Bow and Mace work: Each have their own unique enchantment that levels with each level of the bow and mace that progressively become stronger however the higher level the bow and mace get the less uses you will get from its powerful enchantments.\r<br />\r<br />Hatred&#39;s Soul (Bow) Enchantment- Hatred&#39;s Curse at Lv 39:\r<br />Does 35pts of Fire Damage and 30pts of speed damage for 45 seconds.\r<br />\r<br />Hatred&#39;s Heart (Mace) Enchantment- Hatred&#39;s Curse at Lv 39:\r<br />Does the same thing as Hatred&#39;s Soul how ever I made the Enchantment&#39;s Separate for no reason.\r<br />\r<br />Hatred&#39;s Soul Arrows Enchantment- Hatred&#39;s Snare:\r<br />Soul Trap&#39;s target for 15 seconds.\r<br />\r<br />FUTURE PLANS:\r<br />-Would like to see if the community would like to upload a custom texture for the bow and arrows. (I&#39;d do it my self, however texturing really isn&#39;t my strong suit).\r<br />\r<br />Thanks for taking time to look at my mod&#33; This took me time to do and create. If you like please leave an endorsement. If you also have any suggestions, please leave them in the comments. Your feedback is really important to me.\r<br />\r<br />Thanks-\r<br />cdogs55",
  "categoryId": "55",
  "version": "1.1.0",
  "author": "cdogs55",
  "createdUnix": "1384115976",
  "updatedUnix": "1393792479",
  "containsAdultContent": false,
  "uploadedBy": "cdogs55",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000077480",
      "name": "Hatred Heart and Soul Version 1_0_0",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Hatred Heart and Soul Version 1_0_0-46828-1-0-0.zip",
      "uploadedUnix": "1384115951",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/d05f977cb8264bec02846e1502374b2ab4e0e120aa40a6c95c7f1770159240b5/analysis/1407787782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hatred%20Heart%20and%20Soul%20Version%201_0_0-46828-1-0-0.zip?fid=1000077480&ttl=1535827128&ri=8192&rs=8192&setec=f4fd594c49793897a902010103f6ebef"
    },
    {
      "fileId": "1000099515",
      "name": "Hatreds Heart and Soul Weapon Leveling Fix",
      "version": "1.1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Hatreds Heart and Soul Weapon Leveling Fix-46828-1-1-0.zip",
      "uploadedUnix": "1393792479",
      "modVersion": "1.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/680bb8d977e933aabe4ecdcd9a405b9fa3b60f1cd4b5c1d24f82741114180dc6/analysis/1407957436/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hatreds%20Heart%20and%20Soul%20Weapon%20Leveling%20Fix-46828-1-1-0.zip?fid=1000099515&ttl=1535827129&ri=8192&rs=8192&setec=8a5116a69378a3644768006819db853b"
    }
  ]
}