{
  "modId": 46820.0,
  "modName": "Underworld Hybrid race",
  "summary": "A Hybrid with a Lycan dominant side resembles a Lycan in appearance. However, their faces are only slightly elongated, and their eyes are completely black. Their ribcages are also slightly extended. They have little or no fur and blue skin. These Hybrids have the talons and animalistic posture of a Lycan. They also possess the Lycan's signature roa",
  "descriptionHtml": "This is a beta race for know I need help with it so if you would like to hlep me with a few fixes let me know Thanks everyone.\r\n\r\nA Hybrid with a Lycan dominant side resembles a Lycan in appearance. However, their faces are only slightly elongated, and their eyes are completely black. Their ribcages are also slightly extended. They have little or no fur and blue skin. These Hybrids have the talons and animalistic posture of a Lycan. They also possess the Lycan's signature roar. \r\n\r\nThis is a work in progress so telll me if there are bugs \r\n\r\nI will be working on a Custom skeleton for beast form but for now it is just werewolf form with vampire abilities if you have better vampires you will be able to feed right away and change to beast form from the start of the game. \r\n\r\nNo other mods are required for this mod to work but it is recommended to use \r\n\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=15998 \r\n\r\nFor a more immersive vampire experience \r\n\r\nPlease Rate and Enjoy \r\n\r\nBig update is not finished yet. But for those of you that are familiar with the Creation Kit you can see what I am doing just type in Hybrid for the search and go to all. New meshes and textures for the Hybrid race beast form. I will have this finished by the end of the week. \r\n\r\nThank you Bethseda for making a wonderful game",
  "categoryId": "34",
  "version": "1",
  "author": "KalEltheKryptonian",
  "createdUnix": "1384111784",
  "updatedUnix": "1384112183",
  "containsAdultContent": false,
  "uploadedBy": "KalEltheKryptonian",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000077445",
      "name": "Hybrid race",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11651",
      "fileName": "Hybrid race-46820-1.rar",
      "uploadedUnix": "1384112183",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/a007e84f1e1755a4e054f9ac7e267a35d813d59ce26b0d203759b9c1820bcd24/analysis/1407787696/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hybrid%20race-46820-1.rar?fid=1000077445&ttl=1535827117&ri=8192&rs=8192&setec=5199cf341dbbdc6979fd32a224f38519"
    }
  ]
}