{
  "modId": 46831.0,
  "modName": "Realistic Boat Travel",
  "summary": "Adds several boats along rivers and the coast to use as a fast-travel system.  Boats must be purchased or repaired before they can be used.",
  "descriptionHtml": "[b][Dragonborn version now available, click here -----&gt;  [url=http://www.nexusmods.com/skyrim/mods/48518/?]Dragonborn Boat Travel[/url]][/b]\r<br />\r<br />This mod adds several boats to rivers and one on the coast that can be used as a fast travel system.  They are similar to the carriages in how they work.  Simply activate the boat and choose your destination.  \r<br />\r<br />[list]\r<br />[*]Boats must be purchased or repaired before they can be used (one time only).\r<br />[*]There is only one boat per &#39;route&#39;.  e.g.  If you take the boat from Riverwood to the Guardian stones, the boat will stay at the guardian stones until you use it again.\r<br />[*]If you can&#39;t remember where you left your boat, open up your world map and you will see its location as a map marker.\r<br />[/list]\r<br />\r<br />*[b][u]Important, please read[/u]:  When you activate the boat outside Whiterun it says you can craft the items at a smelter.  This was a mistake and the recipes are actually found under the forge menu.  I apologise for any confusion this causes.[/b]\r<br />\r<br />[u][b]FAQ[/b][/u]\r<br />\r<br />[color=orange][i]Where are the boats located?[/i][/color]\r<br />\r<br />The aim of this mod is for you to explore and find the boats on your own, however there is a list at the bottom of this page and a map in the images section if you want to know more.\r<br />\r<br />[color=orange][i]Do I need to worry about exposure / hunger if I&#39;m using realism mods?[/i][/color]\r<br />\r<br />The boats work in a similar way to fast travel, so yes you may have to take them into account.  You should check your realism mod&#39;s options to see how exposure / hunger during fast travel is handled.\r<br />\r<br />[color=orange][i]I can&#39;t see the recipes for the parts I need to fix the boat.  What do I do?[/i][/color]\r<br />\r<br />The recipes will not appear until you inspect the boat at least once.  The recipes will be removed once the boat has been repaired.\r<br />\r<br />[color=orange][i]How do I get the boat near Riften?[/i][/color]\r<br />\r<br />Read the note on the boat to get you started.  You [u]must[/u] read the note to progress the mini &#39;quest&#39;.  If you want the full solution, click on the &#39;read me&#39; tab.\r<br />\r<br />[color=orange][i]Why is the purchasing done with menus?  Why didn&#39;t you use an NPC?[/i][/color]\r<br />\r<br />I&#39;m not familiar with dialogue in the construction kit.  Even if I knew what I was doing, I&#39;d rather not create new NPCs.  Skyrim can get very cluttered, especially if you are using mods like inconsequential NPCs.  Adding dialogue to existing NPCs opens the door to conflicts and problems with other mods.  Using menus was the most simple way I could think to do it.  \r<br />\r<br />[color=orange][i]Are any vanilla assets changed?[/i][/color]\r<br />\r<br />The are 4 static items in the vanilla game that end up disabled.\r<br />\r<br />[color=orange][i]What kinds of scripts does this mod use?[/i][/color]\r<br />\r<br />There is one script for each &#39;route&#39; (seven in total).  These are only used when you activate the boats to use them.  There are eight extra scripts that handle the purchasing and repairing.  These extra scripts are only used once and then never used again.  There are no scripts that run in the background.\r<br />\r<br />[color=orange][i]Why are certain sections of river not available?[/i][/color]\r<br />\r<br />The routes were chosen based on natural obstacles such as waterfalls.  Small weirs and falls could be easily traversed by picking up your boat and moving a few feet.  Very high or long stretches of falls would be very inconvenient or difficult to get past.  In cases like these, it would be easier to walk a small distance and take a different boat.  e.g. The waterfalls between Riverwood and Whiterun.  \r<br />\r<br />\r<br />[b][u]Boat Starting Locations[/u][/b]\r<br />\r<br />Riverwood - On the same island as the sawmill in the middle of the river. (Purchase)\r<br />\r<br />Whiterun - At the start of the stream that flows out of Whiterun, near to the stables (Repair)\r<br />\r<br />Windhelm - South side of the river to the east of the stables. (Purchase)\r<br />\r<br />Riften - North side of the lake, near to the north city gate. (Mini &#39;Quest&#39;)\r<br />\r<br />Kolskeggr Mine - At the bottom of a steep hill, in between the two bridges. (Purchase)\r<br />\r<br />Solitude Sawmill - Next to the sawmill ramp. (Repair)\r<br />\r<br />Solitude Docks (Coastal Boat) - Next to the East Empire Company Warehouse (Purchase) \r<br />\r<br />\r<br />[color=#A9BCF5][u]OPTIONAL FILES[/u][/color]\r<br />\r<br />[color=#A9BCF5][u]Woodsman&#39;s Shack Optional Patch[/u]\r<br />This optional file will create a new destination next to the campsite of the Woodsman&#39;s Shack mod.\r<br />[list]\r<br />[*]Install [url=http://skyrim.nexusmods.com/mods/18489/?]Woodsman&#39;s Shack[/url] and Boat Travel first.\r<br />[*]Install the patch and make sure the .esp is after BoatTravel.esp and WoodsmanShack.esp in your load order.  When installing the patch with NMM, chose the &#39;No&#39; option if you see the upgrade prompt.\r<br />[*]Go to your Skyrim--&gt;Data--&gt;Scripts folder and remove BTTheRift.pex\r<br />[*]Go to your Skyrim--&gt;Data--&gt;Scripts--&gt;Source folder and remove BTTheRift.psc\r<br />[/list]\r<br />I would recommend moving the two script files to a backup folder, rather than deleting them.  You [u]must[/u] remove the two files or it will cause the boat menu to appear twice and may result in the boat not changing position correctly.\r<br />\r<br />*[u]Uninstallation[/u]\r<br />If you wish to remove the Woodsman&#39;s shack patch please follow these steps carefully.\r<br />[list]\r<br />[*]Move your boat in the Rift to a location that ISN&#39;T the Woodsman&#39;s Shack.  If you leave it here before uninstalling, the boat will disappear when you next load up your game.\r<br />[*]Uninstall the patch.\r<br />[*]Move &#39;BTTheRift.pex&#39; and &#39;BTTheRift.psc&#39; back into their appropriate folders.  If you don&#39;t do this, you will not be able to activate the boat.[/list][/color]\r<br />\r<br />[color=orange]*If you are planning to uninstall the actual &#39;Woodsman&#39;s Shack&#39; mod, make sure you remove this patch first, as it uses the original mod as a master.  If this patch is used without the Woodsman&#39;s Shack mod installed, you will get a crash to desktop.*\r<br />\r<br />*As with most mods, you should be wary of installing / uninstalling them in the middle of a playthrough.  Always keep regular backups of your saves&#33;*[/color]\r<br />\r<br />[color=#A9BCF5][u]Riverwood Reborn Patch[/u]\r<br />This patch moves a few rocks in the &#39;Riverwood Reborn&#39; mod to avoid clipping with the rowboat.  Make sure the patch is placed after &#39;Riverwood Reborn&#39; in your load order.[/color]",
  "categoryId": "78",
  "version": "1.0",
  "author": "Thicketford",
  "createdUnix": "1385739678",
  "updatedUnix": "1385939953",
  "containsAdultContent": false,
  "uploadedBy": "Thicketford",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000084067",
      "name": "Boat Travel - Realistic Version",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54",
      "fileName": "Boat Travel - Realistic Version-46831-1-0.rar",
      "uploadedUnix": "1385674536",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2be0d99111c79c8d98139a2fbd730779883e6ea5dd6ab1729d454b687f882299/analysis/1407812527/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Boat%20Travel%20-%20Realistic%20Version-46831-1-0.rar?fid=1000084067&ttl=1535827137&ri=8192&rs=8192&setec=93546723e495cced03f2b381f3c760e6"
    },
    {
      "fileId": "1000085041",
      "name": "Riverwood Reborn Patch",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Riverwood Reborn Patch-46831-.rar",
      "uploadedUnix": "1385931700",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f0ebd16d4889b49f722e7f2b8b2f5701b9e589df76007251038de1f6d2e66951/analysis/1407816848/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverwood%20Reborn%20Patch-46831-.rar?fid=1000085041&ttl=1535827137&ri=8192&rs=8192&setec=c311f9aea01f16a6bf05b1d83474ed20"
    },
    {
      "fileId": "1000085063",
      "name": "Woodsmans Shack Patch",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "Woodsmans Shack Patch-46831-.rar",
      "uploadedUnix": "1385939953",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/255febfec9e570e64c16a4679d964f8a93a0d938c8ebe4f0bbe40e0f5b0e35a4/analysis/1407816923/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Woodsmans%20Shack%20Patch-46831-.rar?fid=1000085063&ttl=1535827138&ri=8192&rs=8192&setec=84d838aaf01e97bcea6f69f0c78ee9d6"
    }
  ]
}