{
  "modId": 46847.0,
  "modName": "Asian race in Skyrim",
  "summary": "Ever wanted an Asian-looking girl in Skyrim with minimal number of new mods?\r<br />How about this being also lore-friendly? This tutorial will explain everything to you.",
  "descriptionHtml": "This tutorial shows, how to create an Asian-looking girl almost without mods.\r<br />The file available for download is just for show - it&#39;s simply a copy of the description below.\r<br />Still - don&#39;t hesitate to download it, if you feel like keeping it on your hard drive.\r<br />\r<br />LORE-FRIENDLINESS\r<br />A lot of people assume, that Akaviri are Asians. It&#39;s a common mistake, because:\r<br />- Akavir is east from Tamriel (like Asia is east from Europe)\r<br />- Blades use armor and weapons, that look totally asian and are called &#34;Akaviri&#34;\r<br />Let me explain - long time ago, in the early years of the Blades organization, most of its members were - Tsaesci. They hailed from Akavir, and hence the tradition among the Blades to use Akaviri weapons and armors. The thing is Tsaesci are not asian-looking. None of Akaviri races look asian. Actually all Akaviri races are in fact beast races. Tsaesci are described as snake-folk. There are also Ka Po&#39; Tun (tiger-folk), Tang Mo (monkey-people) and Kamal (snow demons). Also - dragons. It is assumed, that if there were actual humans in Akavir, they were eaten by beast races somewhere around the First Era (Morrowind is the Third Era, Oblivion marks the end of Third Era and Skyrim is the Fourth Era). So all mods that add Asians as &#34;Akaviri Race&#34; are NOT lore-friendly. Now you know.\r<br />So, the only way to have a lore-friendly Asian is to make a Breton/Imperial/Nord, that LOOKS ASIAN. Period.\r<br />\r<br />RECOMMENDED MODS\r<br />Mods below are listed in order of importance. You can ignore all of them, but I strongly recommend to use at least the top position, which makes the process much easier.\r<br />1. [url=http://skyrim.nexusmods.com/mods/29624]RaceMenu[/url] (requires [url=http://skse.silverlock.org/]SKSE[/url])  \r<br />2. [url=http://skyrim.nexusmods.com/mods/10168]Apachii&#39;s SkyHair[/url]\r<br />3. Some kind of body replacer ([url=http://skyrim.nexusmods.com/mods/6709]UNP[/url], CBBE, ADEC or something else)\r<br />4. [url=http://skyrim.nexusmods.com/mods/32986]Mature Skin Texture and Body[/url] (version for your body replacer)\r<br />\r<br />STEP 1: ACCESSING RACE MENU\r<br />You define your character&#39;s look in Race Menu. You can access it during the prologue of the game or call it with console command &#34;showracemenu&#34;.\r<br />If you use RaceMenu mod, you can see the numerical values for almost every slider. Adjust them to be exactly the same as mine. If not, use my estimation tips (if it&#39;s a percentage value, then 0% means all the way to the left, 50% is the middle of the bar and 100% is all the way right.)\r<br />\r<br />STEP 2: CHOOSING THE RACE\r<br />The trick is to make the best of available resources. Asians have a very characteristic look - their hair has different structure, skull bones and head shape are also different. We can&#39;t replicate all of that without a new head mesh, but we can trick the observer&#39;s eyes (e.g. we can&#39;t make the head more round, but we can choose a haircut, that will pronounce the roundness).\r<br />First choose your race. From the lore perspective, if there were ever any humans in Akavir, their genes are most likely to be found among Imperials. Hence, they are my personal preference. The whole tutorial is based on them. If you don&#39;t use RaceMenu mod, you might consider Bretons, since their females have the smallest height value from all human races (a characteristic trait for Asians as well). The least preferable pick is Nord race - tall, bulky and mostly fair haired (but you can still build on Nord).\r<br />Redguards are not a pick at all. Just no.\r<br />\r<br />STEP 3: SETTING THE VALUES\r<br />Some positions are not listed. This means they either should be left as they are or they don&#39;t matter at all. At first leave them untouched, and get back to tweaking them at the very end, once your character looks - say - 90% like the screenshot.\r<br />All color sliders (except for Skin Tone and Hair Color) should be set to the left end of the slider.\r<br />Don&#39;t add any additional parts (tattoos, warpaints, dirt and so on).\r<br />Other values:\r<br />Sex: 1 (female)\r<br />Skin Tone: 2 (third from the left)\r<br />Weight: 0.95 (don&#39;t use less than this)\r<br />Complexion, Dirt, Scars, War Paint: all sliders to the left end\r<br />Nose Type: 2 (third from the left)\r<br />Nose Height, Nose Length: -1 (left)\r<br />Jaw Width: -0.5 (slider at 25%)\r<br />Jaw Height: 0 (center)\r<br />Jaw Forward: -1 (left)\r<br />Cheekbone Height: 1 (right)\r<br />Cheekbone Width: 0.5 (slider at 75%)\r<br />Eye Shape: 16 (first from the right)\r<br />Eye Color: 4 (the darkest brown you can get)\r<br />Eye Height: -1 (left)\r<br />Eye Width: 0 (center)\r<br />Eye Depth: 1 (right)\r<br />Brow Type: 6 (seventh from the left)\r<br />Brow Height: 0.6 (slider at 80%)\r<br />Brow Width: 0 (center)\r<br />Brow Forward: -1 (left)\r<br />Mouth Shape: 5 (sixth from the left)\r<br />Mouth Height: -1 (left)\r<br />Mouth Forward: 0 (center)\r<br />Chin Width: -1 (left)\r<br />Chin Length, Chin Forward: 0\r<br />Hair: 33 (if you don&#39;t have Apachii&#39;s SkyHair, pick whatever feels best, but nothing from vanilla will look asian enough)\r<br />Hair Color: custom value (see screenshot or if you don&#39;t have RaceMenu mod just pick the darkest black available)",
  "categoryId": "82",
  "version": "1.0",
  "author": "Erundil",
  "createdUnix": "1384127365",
  "updatedUnix": "1384346512",
  "containsAdultContent": false,
  "uploadedBy": "erundil444",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000078420",
      "name": "Tutorial in text file",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Tutorial in text file-46847-1-0.7z",
      "uploadedUnix": "1384346512",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c0f846fb7926fd110baa1f7e07c22cfcd82e253813ea50c4471ca836bc048d73/analysis/1407790990/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tutorial%20in%20text%20file-46847-1-0.7z?fid=1000078420&ttl=1535827150&ri=8192&rs=8192&setec=836b71b363fd0b026c85ea5515294f8b"
    }
  ]
}