{
  "modId": 46941.0,
  "modName": "Biggest One Standalone Khajiit Follower",
  "summary": "Standalone Khajiit Follower.\r<br />-Two-handed weapon trainer\r<br />-Amazing textures and skeleton\r<br />-Unrelenting Force Shout",
  "descriptionHtml": "Description: \r<br />Biggest One is a standalone Khajiit follower. He is based off my sister&#39;s cat, the largest one we have. He has a custom race to support a beafier skeleton (courtesy of A Better body scale for Khajit and Argonian Male by TS) and custom textures (from ShinglesCat&#39;s amazing: SC - Khajiits Improvement - Males Only).\r<br />He is skilled at two-handed and ranged combat. He can train the player in two-handed weapons. Most importantly, he has the Unrelenting Force Shout. He can be found in Whiterun, in the Dragonsreach dungeon, pacing around. This is my first mod, but I have done my research and learned from the work of others.\r<br />\r<br />Background: \r<br />Do&#39;Cotbiigl&#39;wik (Biig) is of the Cathay-raht subspecies of Khajiit. His name means &#34;biggest one&#34; in his native language with the prefix &#34;Do&#34; indicating his warrior prowess. He is larger and more powerfully built than any of his kin more commonly seen in Tamriel. He has been exploring Tamriel for many moons, and most recently has found himself in Skyrim, studying the way of the voice and forging a name for himself.\r<br />\r<br />Purpose:\r<br />There are lots of great follower mods, but a surprising lack of Khajiit (Inigo is the most awesome exception). I designed Biig to be an epic khajiit warrior who can provide genuine assistance to a Dragonborn playing at a high level with such mods installed as Deadly Dragons, Deadly Monsters, Dragon Combat Overhaul, and Duel: Combat Realism. For this reason, he may seem a bit overpowered at lower levels, but not as much as many custom followers. \r<br />\r<br />Features: \r<br />Custom Race: -uses special skeleton(from A Better body scale for Khajit and Argonian Male by TS);    \r<br />                     -special eyes (from The Eyes of Beauty by LogRaam);\r<br />                     -special fur textures (SC - Khajiits Improvement - Males Only by ShinglesCat).\r<br />Essential\r<br />Doesn&#39;t affect stealth meter\r<br />Levels with the player from 5 to 300\r<br />Custom Class: focuses on health; primary skills:1-handed, 2-handed, heavy armor, light armor, sneak.\r<br />Trainer: trains player in two-handed weapon skill\r<br />AI Notes: Aggression level: aggressive, Confidence: Foolhardy, Morality: Property Crime only (Won&#39;t report crimes).\r<br />Combat Type: Berserker\r<br />Custom Armor: Ancient Nord Armor set with Ebony Armor values. Uses special textures (courtesy of Gamwich&#39;s Bethesda Performance Textures - Armor - Clothes - Weapons), not meant to be used by player.\r<br />Starting Inventory: steel warhammer, hunting bow, lots of elven arrows.\r<br />Spells and Powers: Fast Healing, Unrelenting Force Shout.\r<br />Perks: Lightfoot, Shieldwall, Barbarian 4, Juggernaut 3, Champion&#39;s Stance, Skullcrusher, Armsman, Overdraw, Agile Defender 4, Silent Roll\r<br />\r<br />Notes: \r<br />Works with UFO, but do not, DO NOT, attempt to remove his armor using UFO or similar ways to remove the default outfit of an NPC. Biig&#39;s armor was made for him and him alone. You have been warned.\r<br />He should work with most other mods as he edits nothing vanilla and uses all his own or vanilla resources. \r<br />\r<br />Issues: \r<br />removing his default outfit using UFO&#39;s &#34;you could dress better&#34; does NOT work. \r<br />Due to a vanilla issue, sometimes Biig will &#34;grab&#34; out his melee weapon to engage an enemy, and the weapon will be invisible. This usually happens when he shouts immediately after striking with melee weapon. It causes no problems, but may look odd. \r<br />Biig may do an excessive amount of shouting. Sometimes he will finish off an enemy and then shout at their corpse. This is how the vanilla combat AI works. Think of it as his personality coming out.\r<br />\r<br />Installation:\r<br />Manually Download and use NMM to install.\r<br />Or extract with 7zip and drop TheBiig esp and bsa into Skyrim&#39;s &#39;data&#39; folder.\r<br />\r<br />Uninstallation:\r<br />delete TheBiig esp and bsa from skyrim&#39;s &#39;data&#39; folder.\r<br />\r<br />Credits:\r<br />I am eternally indebted to the following Mod Authors:\r<br />Body Textures: [url=http://www.nexusmods.com/skyrim/mods/39278/] SC - Khajiits Improvement - Males Only [/url] by ShinglesCat      \r<br />Skeleton: [url=http://www.nexusmods.com/skyrim/mods/6239/] A Better body scale for Khajit and Argonian Male [/url] by TS   \r<br />Armor textures: [url=http://www.nexusmods.com/skyrim/mods/42360/] Bethesda Performance Textures - Armor - Clothes - Weapons [/url] by Gamwich   \r<br />Eyes: [url=http://www.nexusmods.com/skyrim/mods/13722/] The Eyes of Beauty [/url] by Gabriel Mailhot  \r<br />\r<br />Recommended Mods:\r<br />Anduniel - Quest Aware Custom Voiced Follower Companion by Anduniel\r<br />Dragon Combat Overhaul by ApolloDown\r<br />Duel - Combat Realism by Gabriel Mailhot as LogRaam\r<br />UFO - Ultimate Follower Overhaul by fLokii\r<br />Immersive Armors by hothtrooper44\r<br />Apocalypse Spell Package by Enai Siaion\r<br />",
  "categoryId": "66",
  "version": "1.0",
  "author": "DarthNexus1",
  "createdUnix": "1384230815",
  "updatedUnix": "1384230553",
  "containsAdultContent": false,
  "uploadedBy": "DarthNexus1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000077976",
      "name": "The Biggest One ver 1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11273",
      "fileName": "The Biggest One ver 1-46941-1.7z",
      "uploadedUnix": "1384230553",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/62a34ea60e50416a49b9e156572f143b458eef98a31a444ff015a8c9a26bc1d6/analysis/1407789504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Biggest%20One%20ver%201-46941-1.7z?fid=1000077976&ttl=1535827255&ri=8192&rs=8192&setec=09d28cd83bbf64cd359a9be2286b233d"
    }
  ]
}