{
  "modId": 46972.0,
  "modName": "GMO - Guild Members Overhaul",
  "summary": "GMO - Guild Members Overhaul is a series of modular overhauls that add Apachii hairs to the main NPC&#39;s of every guild as well as improving facial appearance, boosting their stats, raising their level cap, and making many of them recruit-able followers. The overhauls are standalone and include everything you need so you can pick and choose&#33;",
  "descriptionHtml": "[center][heading] Skyrim Guilds Unite&#33; [/heading][/center]\r<br />[center]GMO - Guild Members Overhaul (not unlike yet not to be confused with, Genetically Modified Organism) is a series of modular overhauls that add Apachii hairs to the main NPC&#39;s of every guild as well as improving facial appearance, boosting their stats, raising their level cap, and making many of them recruit-able followers. Previously the overhauls were posted under different mods (Better Bards, Better Companions, etc) but are now brought together for the sake of completion and convenience. The depth and degree of changes made vary from guild to guild but I tried to remain as non-invasive as possible (no scripting) and preserve the nature and character of each NPC when selecting the face and hair changes (rather than make every NPC a blonde glamazon). Each guild is standalone and includes everything you need so that you can pick and choose between the ones that are to your liking (check &#34;misc&#34; files section) or download the entire archive &#34;GMO - Guild Members Overhaul&#34; to reduce clutter, its up to you. \r<br />\r<br />Hroki, Mjoll the Lioness, and Muiri follower from [url=http://skyrim.nexusmods.com/mods/46027/?/]MKs Muiri Follower[/url] (which were previously individual follower mods) have now been added to GMO - Hirelings Housecarls and Maidens and GMO - Hirelings Housecarls Maidens and Gentlemen but can still be downloaded separately and are located under &#34;misc&#34; files. A new game must be started for many of the gear and stat changes to go into effect so read everything below carefully. Overall the primary purpose of this series of mods is to add more followers to Skyrim and enhance already existing followers while offering a aesthetic upgrade from vanilla gameplay.\r<br />\r<br />[i]A special thanks goes out to Apachii for her great work with ApachiiSkyHair, for permission to use her hairs in this series of mods, and for her tutelage (without which I would have most likely not gotten far).[/i]\r<br />\r<br />\r<br />[b][u]If you want your NPC&#39;s to appear as they do in the screenshots install these mods:[/u][/b]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/10168//?/]ApachiiSkyHair by Apachii[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/2666//?/]Caliente Female Body Mod BBE[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/12273/?/]Caliente&#39;s Vanilla Outfits for CBBE[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/2812/?/]Better Females by Bella[/url][/center]\r<br />\r<br />\r<br />\r<br />[center] [heading] Better Bards [/heading] [/center]\r<br />[img=center] http://i123.photobucket.com/albums/o299/shinmuriel/Nexus/BardsBanner.jpg [/img]\r<br />\r<br />[center]Better Bards changes 12 NPC&#39;s that previously had uneventful lives into competent and attractive companions that will go adventuring, level with you up to 100, and even settle down and marry you (should you desire). All of the tavern dwelling bards in the main cities as well as several from the bards college can now be recruited, have a much wider array of skills and classes than before, and more importantly... they look better&#33; To get the most out of your companions pay attention to their class and skills. If you download but only one of these files, this should be the one.[/center]\r<br />\r<br />[center]This mod makes changes to the following NPC&#39;s.\r<br />\r<br />Pantea Ateia (Bards college in Solitude) - Priest\r<br />Illdi (Bards college in Solitude) - Priest\r<br />Aia Arria (Bards college in Solitude) - Necro\r<br />Karita (Windpeak Inn in Dawnstar) - Spellsword\r<br />Lauffyn (Candlehearth Hall in Windhelm) - Necro\r<br />Lisette (WInking Skeever in Solitude) - Spellsword\r<br />Delacourt (Dead Man&#39;s Drink in Falkreath) - Rogue\r<br />Mikael (Bannered Mare in Whiterun) - Priest\r<br />Ogmund (Silver-Blood Inn in Markarth) - Fighter\r<br />Ataf (Bards college in Solitude) - Spellsword\r<br />Sven (Sleeping Giant Inn in Riverwood) - Rogue\r<br />Lurbuk (Moorside Inn in Morthal) - Rogue[/center]\r<br />\r<br />\r<br />[center][b][u]Recommended mods for use with Better Bards[/u][/b][/center]\r<br />[center][url=http://skyrim.nexusmods.com/mods/13641//?/]The Asteria by Mattcm919[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/3100/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D3100&pUp=1/]Now follower bards sing everywhere[/url][/center]\r<br />\r<br />[center][b][u]Armor mods used in screenshots[/u][/b][/center]\r<br />[center][url=http://skyrim.nexusmods.com/mods/15156//?/]Succubus By Hentai -CBBE3 Gift By Nausicaa[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/28887//?/]Vampire leather armor set by RavenDier[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/13067/?/]Dark Lilith Sexy Armor for CBBE by Nikitaa and Hentai[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/25852/?/]Lustmord Vampire Armor by AmethystDeceiver\r<br />[/url][/center]\r<br />\r<br />\r<br />[center][color=red]- PLEASE NOTE -[/color]\r<br />\r<br />With both [url=http://skyrim.nexusmods.com/mods/18045//?/]My Home Is Your Home[/url] and [url=http://www.nexusmods.com/skyrim/mods/3100/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D3100&pUp=1/]Now follower bards sing everywhere[/url] installed you can leave your bards in your home and have them play requested songs for you. &#34;Now follower bards sing everywhere&#34; can be found under [url=http://skyrim.nexusmods.com/mods/3100//?/]Female bard for you house by stsg[/url] in the files section.\r<br />\r<br />Sven and Lurbuk are not marriage material for lore related reasons so you cannot wed them. Each have a quest that raises your relationship with them and you must complete their vanilla quests in order to recruit them (or target them in the console and type &#34;setrelationshiprank player 4&#34; to speed things up). \r<br />\r<br />Lurbuk is NOT set to essential for quest related purposes but you can use UFO to set him to essential if you like. I have set Lurbuk to &#34;protected&#34; meaning that he cannot be killed by NPC&#39;s, monsters, or environmental damage but the player can still kill him so be careful with friendly fire&#33;\r<br />\r<br />I have removed Aia&#39;s hood but it will most likely require a new game to take effect.\r<br />\r<br />A few of the NPC&#39;s are included in &#34;side&#34; quests and should you need to access their normal dialogue just return them to their original homes and dismiss them, then speak to them again.\r<br />\r<br />Also... I have included a standalone Hroki (destruction mage) follower as a bonus. it somewhat breaks away from the storyline but I think this is a much more suitable career than sweeping up her parents tavern while dirty old men hit on her. =P[/center]\r<br />\r<br />\r<br />\r<br />[center] [heading] Better Companions [/heading] [/center]\r<br />[img=center] http://i123.photobucket.com/albums/o299/shinmuriel/Nexus/CompanionsBanner.jpg [/img]\r<br />\r<br />[center]Better Companions is a slight overhaul of the fighters guild NPC&#39;s that improves the stats and perks of all of the companion followers, raises the level cap, and changes the hair of all members of the guild to Apachii hair styles. Aela, Ria, and Njada are MUCH cuter now (in my opinion), Farkas and Vikas look like they can eat nails, and Torvar... Well, Torvar kinda looks like Chuck Norris.\r<br />\r<br />More specifically, no changes are made to NPC class or gear, however, base attributes (health, magicka, and stamina) are elevated slightly (requires a new game to be started to receive these benefits), perks were added for all weapons and armor to increase follower survivability and effectiveness (trainers have elevated skill in their perspective specialties), and the level cap has been raised to 100 for Aela, Farkas, Vikas, Athis, Njada, Ria, and Torvar.\r<br />\r<br />\r<br />This mod makes changes to the following NPC&#39;s.\r<br />\r<br />Aela (follower)\r<br />Athis (follower)\r<br />Eorlund\r<br />Farkas (follower)\r<br />Kodlak\r<br />Njada (follower)\r<br />Ria (follower)\r<br />Skjor\r<br />Tilma\r<br />Torvar (follower)\r<br />Vignar\r<br />Vikas (follower)[/center]\r<br />\r<br />[center][b][u]Recommended mods for use with Better Companions[/u][/b][/center]\r<br />[center][url=http://skyrim.nexusmods.com/mods/35470//?/]Moonlight Tales - Werewolf and Werebear Overhaul by Brevi and Al99 [/url]\r<br />[url=http://skyrim.nexusmods.com/mods/22274//?/]Predator Vision - Vampire Werewolf and Khajiit by Gopher[/url][/center]\r<br />\r<br />\r<br />[center][color=red]- PLEASE NOTE -[/color]\r<br />\r<br />The Companion NPC&#39;s will not follow you at the start of the game, you must raise your faction with them by doing the vanilla fighters guild quest line. If you would like any of the NPC&#39;s to follow you at the start of the game before completing the vanilla quests that raise faction then open the console and target the NPC and type &#34;setrelationshiprank player 4&#34; (without the parenthesis) and hit enter.\r<br />\r<br />I have removed Njada&#39;s helmet but you may have to start a new game for the changes to take effect.\r<br />\r<br />All followers have been set to essential, hopefully that does not cause issues to arise but if it does just report it please and it will be fixed immediately.\r<br />\r<br />Also... I have included an optional Adrianne Avenicci follower here as a bonus (see screenshots). She no doubt has quest related scripts so just return her safely home and release her from being a follower should you need to access her base sub-routines (quests). Her class has been changed to warrior, she will level with you up to 100, has added perks and her attributes buffed slightly, and now wears a somewhat more appealing outfit. You may have to start a new game to get her gear changes to show up, however. Unfortunately she is already married folks so treat her with respect&#33; \r<br />\r<br />[color=yellow]Be aware that the &#34;optional&#34; Adrianne Avenicci mod removes her from the blacksmith faction, so make sure you are comfortable with one less blacksmith in Skyrim before installing. This mod may require a new game for all the changes to take effect (mainly gear and faction).[/color][/center]\r<br />\r<br />\r<br />\r<br />[center] [heading] Better Thieves [/heading] [/center]\r<br />[img=center] http://i123.photobucket.com/albums/o299/shinmuriel/Nexus/ThievesBanner.jpg [/img]\r<br />\r<br />[center]Better Thieves raises the level cap of Brynjolf, Vex, Karliah, and all followers to 100 and sets those NPC&#39;s to level with the character, which I think is nice if you are using one of the total Skyrim overhauls such as Skyre and harmless if you are playing vanilla Skyrim, so no harm done. Aside from that the base attributes of all follower and some core NPC&#39;s have been raised slightly as well as their perks (along with the cosmetic changes).\r<br />\r<br />Something that struck me as odd during my first play through was the complete lack of thieves guild followers so I tried to correct that here by changing the NPC&#39;s that the vanilla games scripting would allow without changing the scripting itself. The main 4 are Garthar, Rune, Vipir, and Sapphire but I also included Dirge in the final version. Some of the NPC&#39;s altered to be followers are trainers but the same is true for the vanilla fighters guild NPC&#39;s and with the attribute and perk bonuses, along with the increased level cap, they should serve as competent companions.[/center]\r<br />\r<br />[center]This mod makes changes to the following NPC&#39;s.\r<br />\r<br />Brynjolf (see recommended mods)\r<br />Delvin\r<br />Dirge (follower)\r<br />Enthir\r<br />Garthar (follower)\r<br />Karliah (see recommended mods)\r<br />Mallus\r<br />Mercer\r<br />Niranye\r<br />Ravyn (follower)\r<br />Rune (follower)\r<br />Sapphire (follower)\r<br />Thrynn\r<br />Tonilia\r<br />Vekel\r<br />Vex (see recommended mods)\r<br />Vipir (follower)[/center]\r<br />\r<br />[center][b][u]Recommended mods for use with Better Thieves[/u][/b][/center]\r<br />[center][url=http://skyrim.nexusmods.com/mods/13059//?/]Brynjolf and Vex - Thieves Guild Followers by kryptopyr[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/13632/?/]Nightingale Hall - Karliah as a Follower by kryptopyr[/url][/center]\r<br />\r<br />\r<br />[center][color=red]- PLEASE NOTE -[/color]\r<br />\r<br />The follower NPC&#39;s will start out on as an ally with the player character, which may seem odd (at the start of the game) because their dialogue will often be more positive than it should be given the length of time they have known you. In version 1.2 I have added Dirge and Sapphire to the follower faction but did not raise there player relationship rank so when and if you decide to use them as followers open the console and target them then type &#34;setrelationshiprank player 4&#34; then hit enter.\r<br />\r<br />If you want Byrnjolf and Vex to be a follower after completing the thieves guild quest line then download and install [url=http://skyrim.nexusmods.com/mods/13059//?/]Brynjolf and Vex - Thieves Guild Followers by kryptopyr[/url]. It makes script changes but it seems to work well in my game and compliments this mod. I went ahead and buffed both Brynjolf and Vex as I did the other followers (increasing perks and attributes, etc) in anticipation of using this mod. Make sure Better Thieves is loaded AFTER kryptopyr&#39;s mod.\r<br />\r<br />I have raised Karliah&#39;s stats, perks, etc also and for a reason, while my mod doesn&#39;t change scripting to allow for her to become a follower I made sure it is compatible with another mod that does. If you want Karliah to become a recruit able follower once the thieves guild quest line is over then download and install [url=http://skyrim.nexusmods.com/mods/13632/?/]Nightingale Hall - Karliah as a Follower by kryptopyr[/url] and make sure my mod is loaded AFTER it in your load order.\r<br />\r<br />Also... I have made a Mjoll the Lioness follower mod that gives her Apachii hair, raises her level cap to 100, improves her base attributes and perks, changes her face paint color (see screenshots), and overall just makes her look better. I felt she is semi-related to the thieves guild, I mean... she hates their guts after all.[/center]\r<br />\r<br />\r<br />\r<br />[center][heading] Better Mages [/heading][/center]\r<br />[IMG=center]http://i123.photobucket.com/albums/o299/shinmuriel/Nexus/d52cfa5f-01ea-4567-a7a4-9a7bc73d1e92.jpg[/IMG]\r<br />\r<br />[center]Better Mages adds Apachii hairs to all members of the College of Winterhold, raises the base attributes of all followers, adds perks to J&#39;Zargo, Onmund, and Brelyna to increase their effectiveness, sets them to essential and removes their hoods. \r<br />\r<br />\r<br />This mod makes changes to the following NPC&#39;s.\r<br />\r<br />Ancano\r<br />Arniel\r<br />Brelyna (follower)\r<br />Colette\r<br />Drevis\r<br />Faralda\r<br />J&#39;Zargo (follower)\r<br />Mirabelle\r<br />Nirya\r<br />Onmund (follower)\r<br />Phinis\r<br />Sergius\r<br />Tolfdir\r<br />Urag[/center]\r<br />\r<br />[center][b][u]Recommended mods for use with Better Mages[/u][/b][/center]\r<br />[center][url=http://skyrim.nexusmods.com/mods/16225/?/]Apocalypse Spell Package by Enai Siaion[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/3413/?/]Midas Magic - Spells in Skyrim by Xilver[/url][/center]\r<br />\r<br />\r<br />[center][color=red]- PLEASE NOTE -[/color]\r<br />\r<br />This series of mods makes changes to gear for several NPC&#39;s and you may have to start a new game for these changes to go into effect. Better Bards removes Aia&#39;s hood, Better Companions removes Njada&#39;s helmet, Better Mages removes the hoods of all three student followers (Brelyna, J&#39;Zargo, and Onmund), and Better Thieves removes Karliah&#39;s hood. If any of these NPC&#39;s appear naked or without armor is is NOT a bug. This will only happen if you have already entered a room with one of these NPC&#39;s before installing this mod. Starting a new game will correct any issues and if you don&#39;t want to start a new game then simply give them something to wear. In the case of the three student followers in the College of Winterhold... you may have to do their quests first in order to access their inventory. [/center]\r<br />\r<br />\r<br />\r<br />[center][heading]Better Assassins[/heading][/center]\r<br />[IMG=center]http://i123.photobucket.com/albums/o299/shinmuriel/Nexus/54a53677-b23a-4527-8c46-2d9e691a5339.jpg[/img]\r<br />\r<br />[center]Better Assassins is the last and least of the Apachii hair replacers, changing only 6 NPC&#39;s. No changes are made in any other way except for Cicero who is a &#34;potential&#34; follower. His base attributes have been raised, perks added, and his level cap is now 100.\r<br />\r<br />\r<br />This mod makes changes to the following NPC&#39;s.\r<br />\r<br />Arnbjorn\r<br />Astrid\r<br />Cicero\r<br />Festus\r<br />Gabriella\r<br />Nazir[/center]\r<br />\r<br />[center][b][u]Recommended mods for use with Better Assassins[/u][/b][/center]\r<br />[center][url=http://skyrim.nexusmods.com/mods/8121//?/]DB Shrouded Robe for Babette by TheDragonking82[/url][/center]\r<br />\r<br />\r<br />[center][color=red]- PLEASE NOTE -[/color]\r<br />\r<br />In version 1.1 of Better Assassins I have removed the Dark Brotherhood NPC&#39;s hoods and eliminated the need for a separate patch. Just like Better Mages states above, a new game must be started for gear changes to take effect. Sorry if this is an inconvenience.  \r<br />\r<br />Also... I have included [url=http://skyrim.nexusmods.com/mods/46027/?/]MKs Muiri Follower[/url] in the &#34;GMO - Optional Followers&#34; file along with Adrianne, Hroki, and Mjoll the Lioness.[/center]\r<br />\r<br />\r<br />\r<br />[center] [heading] GMO - Hirelings Housecarls Maidens (and Gentlemen)[/heading] [/center]\r<br />[IMG=center]http://i123.photobucket.com/albums/o299/shinmuriel/Nexus/BetterHousecarlsGroupBanner210px.jpg[/IMG]\r<br />\r<br />[center]Choose only one of the following mods to install along with the Hearthfires Addon.\r<br />\r<br />GMO - Hirelings Housecarls and Maidens REQUIRES [url=http://skyrim.nexusmods.com/mods/10168/?/]ApachiiSkyHair[/url] and replaces the vanilla hairs on nearly all female NPC&#39;s in the major cities and surrounding villages along with improving the base attributes, perks, spell lists, etc of all hirelings and housecarls. I made this mod to compliment GMO - Guild Members Overhaul and for those who want an Apachii hair replacer for females ONLY.\r<br />\r<br />GMO - Hirelings Housecarls Maidens and Gentlemen  REQUIRES [url=http://skyrim.nexusmods.com/mods/10168/?/]ApachiiSkyHair[/url] and includes all of the changes in the above mentioned mod plus adds Apachii hair styles to roughly 3 out of every 4 male NPC&#39;s in the major cities and surrounding villages. I didn&#39;t feel there were enough male Apachii hairstyles to do a full overhaul so I blended them with vanilla hairs for more variety.\r<br />\r<br />This mod makes changes to over 250 NPC&#39;s. If you notice any female NPC&#39;s that I have overlooked and would like their vanilla hair replaced just report them in the comments section.[/center]\r<br />\r<br />\r<br />\r<br />\r<br />[center][heading]Technical[/heading][/center]\r<br />\r<br />[u][b]Requirements[/b][/u]\r<br />\r<br />No requirements for GMO - Guild Members Overhaul but UFO - Ultimate Follower Overhaul comes highly recommended. \r<br />\r<br />All of the hair replacer files listed under &#34;Optional Files&#34; REQUIRE [url=http://skyrim.nexusmods.com/mods/10168//?/]ApachiiSkyHair by Apachii[/url].\r<br />\r<br />\r<br />[u][b]Installation[/b][/u]\r<br />\r<br />I recommend using Nexus Mod manager for installation, easy peasy, no fuss. Feel free, however, to manually install by unzipping the downloaded file(s) to your data directory, merging the textures and meshes folders, then activate the .esp file(s) in your Skyrim launcher.\r<br />\r<br />Place the .esp file(s) at the bottom of your load order with the rest of your companion mods in the order shown below. If you do not use UFO just ignore it and keep everything else the same. \r<br />\r<br />[color=yellow]You should use EITHER GMO - Hirelings Housecarls and Maidens or GMO - Hirelings Housecarls Maidens and Gentlemen along with the GMO - Hirelings Housecarls and Maidens Hearthfires Addon.\r<br />\r<br />[color=yellow]NOTE: LOOT will NOT order Guild Members Overhaul correctly. You have to make exceptions and arrange the GMO files yourself [color=yellow][color=yellow] (as shown below) [/color][/color]after running LOOT.[/color][/color]\r<br />\r<br />-------------------------------\r<br />-------------------------------\r<br />MksHrokiFollowerSA.esp=1\r<br />MKsMuiriFollowerSA.esp=1\r<br />UFO - Ultimate Follower Overhaul.esp=1\r<br />UFO - Dawnguard AddOn.esp=1\r<br />UFO - Heartfire AddOn.esp=1\r<br />UFO - Dragonborn AddOn - Unofficial.esp=1\r<br />GMO-HirelingsHousecarlsandMaidensHF.esp=1\r<br />GMO-HirelingsHousecarlsandMaidens.esp=1\r<br />MKsAdrianneFollowerSA.esp=1\r<br />MKsMjollFollowerSA.esp=1\r<br />MKsBetterAssassinsSA.esp=1\r<br />MKsBetterBardsSA.esp=1\r<br />MKsBetterCompanionsSA.esp=1\r<br />MKsBetterMagesSA.esp=1\r<br />MKsBetterThievesSA.esp=1\r<br />-------------------------------\r<br />-------------------------------\r<br />Bashed Patch, 0.esp=1\r<br />\r<br />\r<br />if you are using the COMPLETE package &#34;GMO - Guild Members Overhaul&#34; then it should look like this:\r<br />\r<br />\r<br />-------------------------------\r<br />-------------------------------\r<br />UFO - Ultimate Follower Overhaul.esp=1\r<br />UFO - Dawnguard AddOn.esp=1\r<br />UFO - Heartfire AddOn.esp=1\r<br />UFO - Dragonborn AddOn - Unofficial.esp=1\r<br />GMO-HirelingsHousecarlsandMaidensHF.esp=1\r<br />GMO-HirelingsHousecarlsandMaidens.esp=1\r<br />GMO-GuildMembersOverhaul.esp=1\r<br />-------------------------------\r<br />-------------------------------\r<br />Bashed Patch, 0.esp=1\r<br />\r<br />\r<br />[u][b]Uninstallation[/b][/u]\r<br />\r<br />Make a clean save without any followers then simply remove the files or deactivate the mod using NMM.\r<br />\r<br />\r<br />[u][b]Known Issues[/b][/u]\r<br />\r<br />- When using the &#34;you could dress better&#34; command in Ultimate Follower Overhaul the NPC will reappear as just a naked (unarmored) body with no head. This is a bug I have seen in other companion mods and I am actively seeking a solution. There is an easy fix however, simply open the console and target the headless NPC then type &#34;resurrect&#34; and hit enter.\r<br />\r<br />- I have altered the NPC&#39;s base attributes some (raising health, magicka, and stamina but in order to get the changes it seems you must start a new game with the mod installed or at least have it installed the first time you enter the room with one of them. \r<br />\r<br />- Dark face textures appear on some NPC&#39;s from time to time depending on what mods you have installed and your load order. For some reason it seems centered around UFO - Ultimate Follower Overhaul. If you experience any issues try moving the bugged mod down in your load order so that it is below any UFO esp&#39;s. Problems should be few and far between.",
  "categoryId": "66",
  "version": "1.4",
  "author": "Murielkai",
  "createdUnix": "1384569984",
  "updatedUnix": "1385700820",
  "containsAdultContent": false,
  "uploadedBy": "Murielkai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000078678",
      "name": "Better Companions",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "27801",
      "fileName": "Better Companions-46972-1-0.7z",
      "uploadedUnix": "1384396490",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/aa1b45b5b8861fc21997148ebac8ca956e32f49116e834382a4a5eb6f9ae8d7d/analysis/1407791615/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Companions-46972-1-0.7z?fid=1000078678&ttl=1535827276&ri=8192&rs=8192&setec=e699493f05f87b1faaed8f350be65f04"
    },
    {
      "fileId": "1000079116",
      "name": "MKs Adrianne Follower",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "967",
      "fileName": "Adrianne Follower-46972-1-0.7z",
      "uploadedUnix": "1384507615",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b02a8ac61755d8deb1f99ec2c13a1cda54da71d3f2f47b79e1c84e4df36d3a63/analysis/1407793143/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Adrianne%20Follower-46972-1-0.7z?fid=1000079116&ttl=1535827276&ri=8192&rs=8192&setec=2155fb2c6d6b5bf4bae19d76464c7071"
    },
    {
      "fileId": "1000079130",
      "name": "Better Mages",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "46783",
      "fileName": "Better Mages-46972-1-0.7z",
      "uploadedUnix": "1384509335",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6f5791e2bff954660ff3ac19307b03a404e6e0123582e055e1f25561495b8610/analysis/1407793179/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Mages-46972-1-0.7z?fid=1000079130&ttl=1535827277&ri=8192&rs=8192&setec=e6fda01efb297690cb90f45db7908d14"
    },
    {
      "fileId": "1000079518",
      "name": "Better Assassins",
      "version": "1.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "20513",
      "fileName": "Better Assassins-46972-1-1.7z",
      "uploadedUnix": "1384590941",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/85f885d3ae55bceba16b8d69140ab69dab8238f96c087d90459ae965b2c730c2/analysis/1407794360/",
      "changelogHtml": " Better Thieves version 1.1 - Added Karliah <br/> \n Better Assassins version 1.1 - Removed all guild members hoods eliminating the need for a separate patch. <br/> \n GMO - Hirelings Housecarls and Maidens - Added Matlara, Ingrid, Elenwen, Hermir, Benor, Kharjo, Reldith, Taarie, and Lilith. <br/> \n GMO - Hirelings Housecarls and Maidens Hearthfires Addon - Replaced vanilla hairs on the 3 carriage drivers added in the Hearthfires DLC with Apachii hair styles. <br/> \n MKs Hroki Follower - Added impact and mage armor perks. <br/> \n MK Mjoll Follower - Tweaked perks. <br/> \n GMO - Hirelings Housecarls Maidens and Gentlemen - Added Apachii hairs to several NPC&#39;s. Added mage armor and impact to Hroki. Tweaked Mjoll&#39;s perks. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Assassins-46972-1-1.7z?fid=1000079518&ttl=1535827277&ri=8192&rs=8192&setec=714c94caeafaf7cc44157da71cb61f76"
    },
    {
      "fileId": "1000080648",
      "name": "Better Thieves",
      "version": "1.2",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "36202",
      "fileName": "Better Thieves-46972-1-2.7z",
      "uploadedUnix": "1384824990",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/7fe8b36ce405a591438a8f8e6c9488967e653e5fba4cf63aeb416f274fae5e1c/analysis/1407798861/",
      "changelogHtml": " GMO - Guild Members Overhaul 1.2 - Removed Dirge and Sapphires \"ally\" status but left them on the follower faction. This ellimates the need for a seperate update/patch to remove them. <br/> \n Better Thieves 1.2 - Removed Dirge and Sapphires \"ally\" status but left them on the follower faction. This ellimates the need for a seperate update/patch to remove them. <br/> \n GMO - Hirelings Housecarls and Maidens - Added missing textures for Ysolda. Added Erandur changes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Thieves-46972-1-2.7z?fid=1000080648&ttl=1535827278&ri=8192&rs=8192&setec=a2ed9c812d7242de62785b00e8857151"
    },
    {
      "fileId": "1000081914",
      "name": "GMO - Hirelings Housecarls and Maidens Hearthfires Addon",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1139",
      "fileName": "GMO - Hirelings Housecarls and Maidens Hearthfires Addon-46972-1-1.7z",
      "uploadedUnix": "1385164558",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/90c279b7d3304fd3a9e6ceba4102c48c960a1a8fb6f5bd2173ab241e1953f6c7/analysis/1407803842/",
      "changelogHtml": " Better Thieves version 1.1 - Added Karliah <br/> \n Better Assassins version 1.1 - Removed all guild members hoods eliminating the need for a separate patch. <br/> \n GMO - Hirelings Housecarls and Maidens - Added Matlara, Ingrid, Elenwen, Hermir, Benor, Kharjo, Reldith, Taarie, and Lilith. <br/> \n GMO - Hirelings Housecarls and Maidens Hearthfires Addon - Replaced vanilla hairs on the 3 carriage drivers added in the Hearthfires DLC with Apachii hair styles. <br/> \n MKs Hroki Follower - Added impact and mage armor perks. <br/> \n MK Mjoll Follower - Tweaked perks. <br/> \n GMO - Hirelings Housecarls Maidens and Gentlemen - Added Apachii hairs to several NPC&#39;s. Added mage armor and impact to Hroki. Tweaked Mjoll&#39;s perks. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GMO%20-%20Hirelings%20Housecarls%20and%20Maidens%20Hearthfires%20Addon-46972-1-1.7z?fid=1000081914&ttl=1535827278&ri=8192&rs=8192&setec=5d7efba3ddc8f3b7ab4683b15213bfbc"
    },
    {
      "fileId": "1000084157",
      "name": "GMO - Guild Members Overhaul",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "103373",
      "fileName": "GMO - Guild Members Overhaul-46972-1-3.7z",
      "uploadedUnix": "1385698843",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/c65c870e76c4945f268db647df9b694b4d863b784e4dd37e2ff7f31e071ec24d/analysis/1407812787/",
      "changelogHtml": " GMO - Hirelings Housecarls and Maidens - Merged the previously optional followers mod (Hroki, Mjoll the Lioness, and Muiri) to reduce clutter. <br/> \n Better Bards - Changed the spellswords (Lisette, Karita, and Ataf) AI so they perform better. <br/> \n GMO - Guild Members Overhaul - Changed the spellswords (Lisette, Karita, and Ataf) AI so they perform better. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GMO%20-%20Guild%20Members%20Overhaul-46972-1-3.7z?fid=1000084157&ttl=1535827279&ri=8192&rs=8192&setec=2bd5b659bf522603f588a95b630db986"
    },
    {
      "fileId": "1000084161",
      "name": "GMO - Hirelings Housecarls and Maidens",
      "version": "1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "33430",
      "fileName": "GMO - Hirelings Housecarls and Maidens-46972-1-4.7z",
      "uploadedUnix": "1385699333",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/ea1a19f024d54f130ae78a4337df62ff41f5ae0a5dce97006e7a7f6e78e572b5/analysis/1407812804/",
      "changelogHtml": " GMO - Hirelings Housecarls and Maidens - Added Apachii hairs to several NPC&#39;s. Added mage armor and impact to Hroki. Tweaked Mjoll&#39;s perks. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GMO%20-%20Hirelings%20Housecarls%20and%20Maidens-46972-1-4.7z?fid=1000084161&ttl=1535827279&ri=8192&rs=8192&setec=504a801edfb2275d4242f347b3b730f7"
    },
    {
      "fileId": "1000084164",
      "name": "GMO - Hirelings Housecarls Maidens and Gentlemen",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "65721",
      "fileName": "GMO - Hirelings Housecarls Maidens and Gentlemen-46972-1-1.7z",
      "uploadedUnix": "1385700229",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/87a8a13a5c43c0f4c99f9664b211b45d59cd5f59480b9c44123e8af7c7737d93/analysis/1407812819/",
      "changelogHtml": " Better Thieves version 1.1 - Added Karliah <br/> \n Better Assassins version 1.1 - Removed all guild members hoods eliminating the need for a separate patch. <br/> \n GMO - Hirelings Housecarls and Maidens - Added Matlara, Ingrid, Elenwen, Hermir, Benor, Kharjo, Reldith, Taarie, and Lilith. <br/> \n GMO - Hirelings Housecarls and Maidens Hearthfires Addon - Replaced vanilla hairs on the 3 carriage drivers added in the Hearthfires DLC with Apachii hair styles. <br/> \n MKs Hroki Follower - Added impact and mage armor perks. <br/> \n MK Mjoll Follower - Tweaked perks. <br/> \n GMO - Hirelings Housecarls Maidens and Gentlemen - Added Apachii hairs to several NPC&#39;s. Added mage armor and impact to Hroki. Tweaked Mjoll&#39;s perks. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GMO%20-%20Hirelings%20Housecarls%20Maidens%20and%20Gentlemen-46972-1-1.7z?fid=1000084164&ttl=1535827280&ri=8192&rs=8192&setec=f323ffdb9c906ee72d89d573e6d36ea7"
    },
    {
      "fileId": "1000084167",
      "name": "Better Bards",
      "version": "1.3",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "28483",
      "fileName": "Better Bards-46972-1-3.7z",
      "uploadedUnix": "1385700643",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/05d490d0f9306c0a30ca3350ae72f59e1d6122def71fe02f343be87d117991cc/analysis/1407812833/",
      "changelogHtml": " GMO - Hirelings Housecarls and Maidens - Merged the previously optional followers mod (Hroki, Mjoll the Lioness, and Muiri) to reduce clutter. <br/> \n Better Bards - Changed the spellswords (Lisette, Karita, and Ataf) AI so they perform better. <br/> \n GMO - Guild Members Overhaul - Changed the spellswords (Lisette, Karita, and Ataf) AI so they perform better. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Bards-46972-1-3.7z?fid=1000084167&ttl=1535827280&ri=8192&rs=8192&setec=1de69e43a4e0e42ccb3d58c4e9f2d464"
    },
    {
      "fileId": "1000084171",
      "name": "MKs Hroki Follower",
      "version": "1.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "846",
      "fileName": "MKs Hroki Follower-46972-1-1.7z",
      "uploadedUnix": "1385700758",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8bccb8d550de9a14f17112aba815d2ded7b9465e1af8ef61a4144903dee62501/analysis/1407812883/",
      "changelogHtml": " Better Thieves version 1.1 - Added Karliah <br/> \n Better Assassins version 1.1 - Removed all guild members hoods eliminating the need for a separate patch. <br/> \n GMO - Hirelings Housecarls and Maidens - Added Matlara, Ingrid, Elenwen, Hermir, Benor, Kharjo, Reldith, Taarie, and Lilith. <br/> \n GMO - Hirelings Housecarls and Maidens Hearthfires Addon - Replaced vanilla hairs on the 3 carriage drivers added in the Hearthfires DLC with Apachii hair styles. <br/> \n MKs Hroki Follower - Added impact and mage armor perks. <br/> \n MK Mjoll Follower - Tweaked perks. <br/> \n GMO - Hirelings Housecarls Maidens and Gentlemen - Added Apachii hairs to several NPC&#39;s. Added mage armor and impact to Hroki. Tweaked Mjoll&#39;s perks. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MKs%20Hroki%20Follower-46972-1-1.7z?fid=1000084171&ttl=1535827281&ri=8192&rs=8192&setec=53163b2f9936ea9559e9c632ed1c6e13"
    },
    {
      "fileId": "1000084173",
      "name": "MKs Mjoll Follower",
      "version": "1.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "894",
      "fileName": "MKs Mjoll Follower-46972-1-1.7z",
      "uploadedUnix": "1385700820",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0f2c1b83ad257683af5d5aa789d59f6241a82a600d7ca291d0ee8e364936d880/analysis/1407837270/",
      "changelogHtml": " Better Thieves version 1.1 - Added Karliah <br/> \n Better Assassins version 1.1 - Removed all guild members hoods eliminating the need for a separate patch. <br/> \n GMO - Hirelings Housecarls and Maidens - Added Matlara, Ingrid, Elenwen, Hermir, Benor, Kharjo, Reldith, Taarie, and Lilith. <br/> \n GMO - Hirelings Housecarls and Maidens Hearthfires Addon - Replaced vanilla hairs on the 3 carriage drivers added in the Hearthfires DLC with Apachii hair styles. <br/> \n MKs Hroki Follower - Added impact and mage armor perks. <br/> \n MK Mjoll Follower - Tweaked perks. <br/> \n GMO - Hirelings Housecarls Maidens and Gentlemen - Added Apachii hairs to several NPC&#39;s. Added mage armor and impact to Hroki. Tweaked Mjoll&#39;s perks. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MKs%20Mjoll%20Follower-46972-1-1.7z?fid=1000084173&ttl=1535827281&ri=8192&rs=8192&setec=44666d8310a5e5a56f8d6276f65e3917"
    }
  ]
}