{
  "modId": 47020.0,
  "modName": "Cyrodiilic Imperial Legionnaire Uniform - An armor variety mod",
  "summary": "Changes the outfit and leveled lists of the Imperial Legion soldiers.\r<br />Inspired by the &#34;Imperial Legion Armor Variety&#34; by Person numbered 275 and gechbal&#39;s &#34;Emperors Will&#34; mod, this plugin aims to improve the gear of the legionnaires.",
  "descriptionHtml": "According to the lore, &#34;... the Imperial Legion, also known as the Imperial Army, is the terrestrial component of the armed forces of the Empire of Tamriel. It operates under the auspices and with the authority of the Emperor himself, and, with its vast numbers, quality training, and rigid discipline, is considered one of the most powerful fighting forces ever assembled in history.\r<br />\r<br />While in peacetime the Legion serves primarily as a garrison force, manning forts, patrolling roads, and providing guardsmen for towns, cities, counties, and nobles, in wartime the Legion&#39;s responsibilities and powers are greatly increased. During conflicts, the Legion serves as an invading and occupying force, overwhelming opposition with numerical superiority and strict economy of force.\r<br />\r<br />The primary mission of the Imperial Legion is to preserve the peace and rule of law in the Empire.&#34;\r<br />\r<br />And yet looking at the pathetic state of the army stationed in Skyrim during the 4th Era, one gets the impression that it&#39;s a miracle they weren&#39;t overrun by common bandits, let alone the Aldmeri Dominion, or the Stormcloak rebels. Undisciplined, poorly trained and equipped, their logistics and equipment seems to have devolved drastically since the fall of the Septim dynasty.\r<br />\r<br />While this may be intentional, the changes made by Bethesda are little too drastic, with only two types of armor, light and heavy.\r<br />\r<br />This mod aims to change that.\r<br />\r<br />Inspired by the &#34;Imperial Legion Armor Variety&#34; by Person numbered 275, but not using any asset from said mod, and gechbal&#39;s &#34;Emperors Will&#34; mod, this plugin aims to improve the gear of the legionnaires, by randomizing their leveled lists and outfits. \r<br />\r<br />\r<br />[heading]Leveled lists formula[/heading]\r<br />The formula used by me is as follows:\r<br />\r<br />Legionary steel armor with simple steel helmet: 15%\r<br />Legionary steel armor with officer&#39;s steel helmet: 5%\r<br />Legionary steel armor with Imperial Dragoon&#39;s Steel helmet: 10%\r<br />Legionary studded leather cuirass with steel gauntlets and steel shin boots: 10%\r<br />Legionary studded leather cuirass with leather bracers and boots: 10%\r<br />Legionary light leather uniform: 10%\r<br />Legionary Cyrodiilic steel cuirass with with steel gauntlets and steel shin boots and steel armored wolf skin hood : 5%\r<br />Legionary ebony armor (legionnaire cuirass, boots and helmet, assets from &#34;Emperor&#39;s will&#34; mod): 5%\r<br />Haafingar soldier uniform: 10\r<br />Markarth soldier uniform: 10%\r<br />Hjaalmarch soldier uniform: 5%\r<br />Falkreath soldier uniform: 5%\r<br />\r<br />The following NPC outfits have also been edited:\r<br />Legates: Legionarry cuirass and boots, fancy bear fur cloak\r<br />Tullius: Legionarry cuirass, boots and cape \r<br />Titus Mede II, the real one, not the decoy: cuirass, boots, bracers and cape, ornate bear fur cloak.\r<br />\r<br />The hold soldiers and the soldiers wearing imperial light armor will have a chance of wearing an armored or simple wolf skin hood, besides the vanilla helmets. This change has also been applied to the town guards not affected by Winter is Coming (Solitude, Markarth, Falkreath, Riften, and Whiterun).\r<br />\r<br />[heading]Requirements[/heading]\r<br />WARNING: You cannot use the plugin from [url=http://skyrim.nexusmods.com/mods/9222/?]Imperial Legion Armor Variety by Person Numbered 275[/url] at the same time with my mod, since they both edit the leveled lists of the soldiers. \r<br />[url=http://skyrim.nexusmods.com/mods/6085//?]Perfect Legionnaire - Imperial Armor Reforged 4-0 by Ali Bengali[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/46672//?]Emperors Will by Christian Paskota[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/13486/?]Winter Is Coming - Cloaks by Nivea[/url]\r<br />\r<br />\r<br />[heading]Installation[/heading]\r<br />Install the above three mods, then install my plugin, and if prompted to replace, do it, because I&#39;ve edited the impgen.esp plugin file, with Chris&#39; permission.\r<br />\r<br />[heading]Bugs[/heading]\r<br />Legate Rikke will for the duration of the Civil War, on the Empire&#39;s side, wear her vanilla officer armor. I can&#39;t seem to fix this because she is scripted to change outfits. She will revert back to wearing the Legate outfit after the Civil War has finished. Bothersome, yes, but think of it this way, Rikke is a practical woman, she wouldn&#39;t be wearing a cumbersome armor, and would opt to use something she feels more agile and comfortable in.\r<br />\r<br />\r<br />[heading]Credits[/heading]\r<br />Ali Bengali because his mod deserves more love, Christian Paskota because he is awesome, Nivea for her cloaks and hoods, and Person Numbered 275 for the inspiration for this mod.\r<br />\r<br />",
  "categoryId": "54",
  "version": "1.2",
  "author": "Julian Varga",
  "createdUnix": "1384297928",
  "updatedUnix": "1398182146",
  "containsAdultContent": false,
  "uploadedBy": "thordir",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106104",
      "name": "Cyrodiilic Imperial Legionnaire Uniform",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Cyrodiilic Imperial Legionnaire Uniform-47020-1-2.rar",
      "uploadedUnix": "1398182146",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/4ca88acd9f20c5cef224f97d23e7db47fbec03e177df141254524b496d504c72/analysis/1408035185/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cyrodiilic%20Imperial%20Legionnaire%20Uniform-47020-1-2.rar?fid=1000106104&ttl=1535827309&ri=8192&rs=8192&setec=366f69736a7916faf8f9e9f39a8b76db"
    }
  ]
}