{
  "modId": 47031.0,
  "modName": "Ultimate Item Extender",
  "summary": "Adds a total of 150+ new items to the world for the player to obtain. Tweaks the looting system for a more immersive experience.",
  "descriptionHtml": "[color=#FF8000][center][size=5]Ultimate Item Extender v1.20[/size][/center][/color]\r\nBy: SpiderAkiraC(AC3C)\r\n\r\nBeen getting sick of the same old same old items popping up all the time?\r\nWell I don’t know about you but I have been getting annoyed with the vanilla Skyrim items/loot. You always know what’s going to pop up. \r\n\r\nNon important note:\r\nI am getting my teeth pulled out so I guess this was an okay time to release this mod. I have been working on it here and there for a while and decided it was good enough for release. I will still be adding a lot more stuff. Recommendations/suggestions are welcome.\r\n\r\n[heading][size=3]What this mod does:[/size][/heading]\r\n\r\nObviously it adds tones of new items the player can obtain. It also fixes the looting system. So your enemies and random people will drop the randomist of loot. Almost every creatures drop list has been tweaked so they will also have some unpredictable things that are still relative to them.\r\n\r\n[size=3]UIE Currently Adds:[/size]\r\n\r\n-60 new custom notes\r\n-2 new books 10+ pages\r\n-40+ new potions and foods\r\n-20+ new ingredients\r\n-30+ new misc items\r\n-10+ new crafting recipes\r\n-6 new armors\r\n\r\nIn total [size=3]150+[/size] new items the player can obtain. ALL items are lore friendly and balanced in weight and price. If you feel though as if there is something off, please let me know.\r\n\r\n-Wonder what people are up too? See if they have notes on them and find out!\r\n\r\n-Where did Chainmail and Ringmail go? I have no idea but I re-added them anyway.\r\n\r\n-Like to cook? Well now there are some new recipes to dive into!\r\n\r\n-Like to read? 2 New books have been added. One on how to craft arrows the other a mind bending story! Working on part 2. (If you can figure out what movie the story is based off of I will make an Easter egg dedicated to you!)\r\n\r\n-Want more of a selection other than just nord mead and “Wine”? You got it!\r\n\r\n-Like to make potions? More ingredients can be found or dropped by creatures!\r\n\r\n-Like to collect coins? Well now there are dwemer and platinum coins to find!\r\n\r\n-children all wear the same clothing? No more! 8 new clothing varieties for kids! \r\n\r\n-Easter eggs? You’re joking right? No, there are a few eastereggs I have added, can you find them? (I think theres 3)\r\n\r\nNotes:\r\nUlfric's got a new axe fit for a king.\r\nPainted troll fat can only be bought. Deep in the Elder scrolls lore it is said the guy, who's name i forget is harvesting the painted trolls fat for a living.\r\nGolden candles can be picked up and dropped. They will light up and illuminate the area.\r\n\r\n[size=3][heading]Compatibility:[/size][/heading]\r\n\r\nI highly recommend using BOSS to sort the load order\r\n\r\nRealistic Needs and diseases is not compatible\r\nI will not be making a patch sorry\r\n\r\nOther mods that edit the leveled lists shouldn't be a problem again BOSS is salvation.\r\n\r\nI will be making Heartfire, Dawnguard and Dragonborn DLC patches too.\r\n\r\nI have poured my heart and soul into learning how to make every single custom texture and model, etc. With the exception of one of course. Thanks to insanity for the amazing dwemer coin resource.\r\n\r\nInstallation:\r\nExtract or copy & paste the .esp, Textures and Meshes to the Skyrim Data folder.\r\n\r\nUninstall:\r\n Delete .esp remove any files that start with UIE in textures and meshes.\r\n\r\nI do not take any donations, moral support is much appreciated.\r\n\r\nPlease check out my other mods!\r\n                   ||||\r\n                   VVVV\r\nhttp://skyrim.nexusmods.com/users/1354307/?tb=mods&pUp=1\r\n\r\nSoftware Used:\r\nNifskope\r\nBSA Browser\r\nPhotoshopCC\r\nCreation Kit\r\n\r\nCredits:\r\nInsanitySorrow for dwemer coin resource  \r\n\r\n[size=4]Permissions:[/size]\r\n\r\nYou may use any asset used in this mod so long as you give proper credit. (See credits for items not created by me)\r\nTranslating is great! No permission needed.\r\nWant to upload elsewhere? Go ahead. I’d appreciate if you left a comment stating where.\r\n\r\nThank you for downloading! And I hope you enjoy!\r\n\r\nCheers.",
  "categoryId": "85",
  "version": "1.20",
  "author": "SpiderAkiraC",
  "createdUnix": "1384307689",
  "updatedUnix": "1384307680",
  "containsAdultContent": false,
  "uploadedBy": "SpiderAkiraC",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000078353",
      "name": "Ultimate Item Extender",
      "version": "1.20",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14557",
      "fileName": "Ultimate Item Extender-47031-1-20.zip",
      "uploadedUnix": "1384307680",
      "modVersion": "1.20",
      "virusScanUrl": "https://www.virustotal.com/file/9f820206476c21df7e3c8e393691f53d2044f736bc2963518867eebfdca974b6/analysis/1407790702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ultimate%20Item%20Extender-47031-1-20.zip?fid=1000078353&ttl=1535827318&ri=8192&rs=8192&setec=2b347037eac3013b16feefb293966d15"
    }
  ]
}