{
  "modId": 47091.0,
  "modName": "Annikae - Female Bosmer Follower",
  "summary": "The follower version of my female Bosmer preset.",
  "descriptionHtml": "I was piddling around in Skyrim one day when I thought \"How would it impact my gameplay to RP a blind character?\" Thus, I created Annikae. She was one of my best games, but one of my mods got corrupted and I lost the ability to continue. I still had the (corrupted) save though, and I managed to create a custom follower out of the wreckage.\r\n\r\nTHE STORY\r\nAnnikae is a Bosmer who was born without sight. Facing many difficulties, she turned her back on the religious practices of her parents and begged any deity who was listening to help ease her struggles. Annikae claims that she heard the voice of Kynareth that day, calming her sorrows and granting a small gift to her: The ability to \"see\" using the motion of the air and the rumbling of the ground around her. Annikae now wears an amulet of Kynareth at all times, a way to honor the individual that helped in her time of need.\r\n\r\nWith her new abilities, Annikae became very agile. Her strength of sense has grown so great that she has become a fairly adept archer, able to feel the vibrations of an elk walking from a hundred feet away. She chose to travel after the unfortunate death of her parents, eventually winding up finding at least a temporary home at the Sleeping Giant Inn in Riverwood. Ask her as many times as you like, her young kinsman in the village has nothing to do with it. Really!\r\n\r\nHER STATS\r\nShe starts at level 30 and levels with the player until level 100. She has the Light Foot perk to prevent any pesky trap-triggering. She's skilled in Archery, Light Armor and Sneak and she's set to essential. She's also a marriage candidate, if you choose!\r\n\r\nI'm very new to modding so since I don't know how it works I'm going to put a warning that THIS FOLLOWER MAY REQUIRE CBBE. I was also using ApachiiSkyHair at the time but since she uses a vanilla hair I think you're fine there.",
  "categoryId": "96",
  "version": "1.0",
  "author": "Lola",
  "createdUnix": "1384387122",
  "updatedUnix": "1384387112",
  "containsAdultContent": false,
  "uploadedBy": "lore715",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000078652",
      "name": "annikae_follower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "142",
      "fileName": "annikae_follower-47091-1-0.zip",
      "uploadedUnix": "1384387112",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/407b15ad4fc1ede1bfbf15a0a6dd906f96f17aec8b2569db3ef0456e51af89c5/analysis/1407791495/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/annikae_follower-47091-1-0.zip?fid=1000078652&ttl=1535827369&ri=8192&rs=8192&setec=da59c0d11e20a4ded8d70f436d3b46ac"
    }
  ]
}