{
  "modId": 47098.0,
  "modName": "Karma Reworks - Magic Rebalancing",
  "summary": "Karma Reworks - Magic is part of a bundle of modules focused into rebalancing the default (vanilla) game, without adding, removing or editing too much of it. The main focus of this module is removing gamebreaking mechanics like the mana cost and lack of scaling of magic, while also making tweaks to make it balanced.",
  "descriptionHtml": "Before installing any of the Karma Reworks mods, please read the whole description. The mods may break your game if you don't read the recommendations. Hard backup of save data is also recommended, to make sure you can revert to your unmodded save if anything goes wrong or if you don't want the mods.\r\n\r\n[size=5][b]About Karma Reworks[/b][/size]\r\nKarma Reworks, as the pun in the name suggests, is a bundle of mods made by me, Karmaworks, aiming to fix, change and rebalance Skyrim mechanics, without adding/removing/editing too much of the game.\r\n\r\nThe goal of these mods are to [b]make the game balanced for all kinds of characters[/b], while [b]retaining most of Skyrim default mechanics[/b]. If you want a mod that changes thing completely, this mod may not be for you.\r\n\r\nFor now, I've split the Karma Reworks mods into 2 modules: Magic and Weapon & Armors. Each of them were made to fix and balance certain aspects of the game.\r\n\r\n[size=5][b]Compatibility & Recommendations[/b][/size]\r\nThis mod requires both the last Official Skyrim Patch made by Bethesda and the last [url=http://skyrim.nexusmods.com/mods/19/]Unofficial Skyrim Patch[/url] made by the Unofficial Patch Project Team. Both add fixes to the game, and I wouldn't want to break their fixes.\r\n\r\n• [b]Karma Reworks – Magic[/b] should work with any mod that doesn't change the Magic Effects, Enchantments and Potions that this module modifies. Just make sure to load this AFTER your mods. However, balancing is not guaranteed. This mod was designed to work together with the other modules of Karma Reworks for the best results, so I highly suggest to use them as well.\r\n\r\n[size=5][b]Karma Reworks – Magic[/b][/size]\r\n[color=red][b]WARNING:[/b] Before installing this mod, make a hard Save backup of your game and make sure the save you will load has the character [u]COMPLETELY STRIPPED OF EQUIPMENT[/u] (armors, clothing, necklaces, rings, everything). If you wear an item that had the old Fortify School enchantment, for example, your character will be glitched forever with passive Magicka Cost reduction. You have been warned.[/color]\r\n\r\nThis module focus in changing Enchantments and Potions related to Magic. It basically swaps Enchantment effect of Reduced Magicka Cost with Amplify effects, while also making Potions reduce Mana Cost (maximum reduction is approximately 40%). It also changes the Robes Fortify School & Magicka Regen enchantments to a 50% fixed magnitude of Magicka Regen (compared to vendor/loot enchantments).\r\n\r\nWith these changes, there is no way to get 100% magicka cost reduction anymore, even if you have many stacking Magicka Cost Reduction sources (Enchantments, Perks, temporary effects, etc). Some changes to magnitude of potions and enchantments were also made to improve balance, since the magic scaling is usually bad in Skyrim.\r\n\r\nTo change these issues, I've done changes both to the Enchanting and Alchemy system regarding Magic, as detailed below.\r\n\r\n[color=#4C9AED][b]Changes to Alchemy[/b][/color]\r\n\r\n[b]Magic School Potions[/b]\r\n• Effect changed to reduce Magicka Cost of the related magic school. Instead of making the spells X% stronger or make they last X% longer, they now reduce the Magicka Cost for the school by X%.\r\n• Base Magnitude changed to 1.5 from 4. That means that potions are 5/8 weaker (37,5% of original magnitudes).\r\n• The maximum value of Magnitude for brewed potions is at 100 Alchemy skill is 40% Magicka cost reduction.\r\n• The fixed Magnitude of the 4 potion Tiers (Potion, Draught, Philter and Elixir) are now 14%, 21%, 28%, 35%. They were previously 25%, 50%, 75%, 100%. Price formula remain unchanged.\r\n\r\n[color=#4C9AED][b]Changes to Enchanting[/b][/color]\r\n\r\n[b]Spell School enchantments[/b] \r\n• Effect renamed to Amplify <School>, to distinguish it from the other Fortify Enchantment and the Potion effect of the same name, that reduces Magicka Cost.\r\n• Effect changed to amplify spells of the related school, making them X% stronger or last X% longer, instead of giving X% mana cost reduction. \r\n• Base Magnitude changed to 6% from 8%. That means that these enchantments are 1/4 weaker (75% of original magnitudes).\r\n• The maximum value of Magnitude for crafted Enchantments, at 100 Alchemy skill with all Perks that increase the effect, without Fortify Enchanting potion is around 20%. With Fortify Enchanting potion, the value increases to around 25%.\r\n• The fixed Magnitude of the 6 enchantment Tiers (Minor School, School, Major School, Eminent School, Extreme School, Peerless School) are now 10%, 12%, 14%, 16%, 18%, 20%. They were previously 12%, 15%, 17%, 20%, 22%, 25%. Price formula remain unchanged.\r\n\r\n[b]Fortify School & Magicka Regen enchantments[/b]\r\n• The fixed magnitude of the Magicka Regen effect is now 50%, instead of 10%. It's now compared to the vendor/loot Robes.\r\n• The Fortify part of the enchantment wasn't altered.\r\n• [u]NOTE[/u]: College Robes weren't altered and they still have the scaling Mana Regen, but a slightly weaker Fortify effect (mana cost reduction).",
  "categoryId": "24",
  "version": "0.1",
  "author": "Karmaworks",
  "createdUnix": "1384383534",
  "updatedUnix": "1384383530",
  "containsAdultContent": false,
  "uploadedBy": "Karmaworks",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000078646",
      "name": "Karma Reworks - Magic",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Karma Reworks - Magic-47098-0-1.rar",
      "uploadedUnix": "1384383530",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/092852b3d85e60627256367a25166219a813ecb6835c0958439fd6937ce5272d/analysis/1407791479/",
      "changelogHtml": " Magic Effects (Enchanting-related)\r<br />\r<br />• EnchFortifySchoolConstantSelf magic effects names changed to Amplify School (was Fortify School).\r<br />• EnchFortifySchoolConstantSelf magic effects&#39; Associated Item 1 changed to SchoolPowerMod (was SchoolMod).\r<br />• EnchFortifyAlterationConstantSelf and EnchFortifyConjurationConstantSelf descriptions changed to \"School spells last &lt;mag&gt;% longer.\"\r<br />• EnchFortifyDestructionConstantSelf, EnchFortifyIllusionConstantSelf and EnchFortifyRestorationConstantSelf description changed to \"Restoration spells are &lt;mag&gt;% stronger.\"\r<br />\r<br />\r<br />Enchantments\r<br />\r<br />• EnchArmorFortifySchool now uses SchoolPowerMod instead of SchoolMod.\r<br />• EnchArmorFortifySchool&lt;suffix&gt; names were changed to \"Amplify School\" (was \"Fortify School\").\r<br />• EnchArmorFortifySchoolBase enchantments were changed to Magnitude 6 (was 8).\r<br />• EnchArmorFortifySchool01, 02, 03, 04, 05 and 06 were changed in Magnitude to 10, 12, 14, 16, 18 and 20, respectively. They were previously 12, 15, 17, 20, 22 and 25.\r<br />• EnchRobesSchoolBase enchantments&#39; Regenerate Magicka effect were changed to 50 Magnitude (was 10).\r<br />\r<br />\r<br />Magic Effects (Alchemy-related)\r<br />\r<br />• AlchFortifySchool magic effects&#39; Associated Item 1 changed to SchoolMod (was SchoolPowerMod).\r<br />• AlchFortifySchool descriptions changed to \"School spells cost &lt;mag&gt;% less to cast for &lt;dur&gt; seconds.\"\r<br />\r<br />\r<br />Potions\r<br />\r<br />• FortifySkillSchool01, 02, 03, 04 potions were were changed in Magnitude to 14, 21, 28 and 35, respectively. They were previously 25, 50, 75 and 100.\r<br />\r<br />\r<br />Ingredients\r<br />\r<br />• Ingredients with FortifyAlteration were changed in magnitude to 1.5 (was 4 or 5). CritterPondFish03Ingredient (River Betty), SpikyGrass01 (Grass Pod) and SprigganSap (Spriggan Sap) were modified.\r<br />• Ingredients with FortifyConjuration were changed in magnitude to 1.5 (was 4 or 5). HagravenFeathers (Hagraven Feathers), MothWingBlue (Blue Butterfly Wing), MountainFlower01Blue (Blue Mountain Flower), BoneMeal (Bone Meal), FavorThadgeirAshes (Berit&#39;s Ashes), Lavender and FrostSalts (Frost Salts) were modified.\r<br />• Ingredients with FortifyDestruction were changed in magnitude to 1.5 (was 4 or 5). GlowingMushroom (Glowing Mushroom), Ectoplasm, WispWrappings (Wisp Wrappings), glowDust (Glow Dust), BeeHiveHusk (Beehive Husk) and Nightshade were modified.\r<br />• Ingredients with FortifyIllusion were changed in magnitude to 1.5 (was 4 or 5, except for Dragon&#39;s Tongue which was 1). DwarvenOil (Dwarven Oil), ScalyPhiliotaBits (Scaly Philiota), Taproot, DragonsTongue (Dragon&#39;s Tongue) and MoraTapinellaBits (Mora Tapinella) were modified.\r<br />• Ingredients with FortifyRestoration were changed in magnitude to 1.5 (was 4 or 5). CritterPondFish04Ingredient (Cyrodilic Spadetail), MS03BlackBriarSecretIngredient (Salt Pile), SaltPile (Salt Pile), AntlersSmall (Small Antlers), PearlSmall (Small Pearl) and CritterPondFish02Ingredient (Abecean Longfin) were modified. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Karma%20Reworks%20-%20Magic-47098-0-1.rar?fid=1000078646&ttl=1535827374&ri=8192&rs=8192&setec=dd04c04181b86aec8c2c1f5e688e1652"
    }
  ]
}