{
  "modId": 472.0,
  "modName": "Essential Followers",
  "summary": "Set followers as essential or not.",
  "descriptionHtml": "Hello! Once again I\\'m here to bring you a person series of bat files I created for myself during the tedious task of killing my own followers. Well no more! With these bat files you will be able to set ALL or NONE of your followers as essential. I will be uploading more bat files to allow for the ability to set only one follower as essential while deactivating the essential mark for your other followers. Meaning you can choose to have ALL, NONE, or ONE follower set to essential.\r\n\r\nSteps:\r\nStep 1: Put EssALL.txt and EssNo into your Skyrim directory\r\nStep 2: Open up the console (~)\r\nStep 3: Type \\\"bat EssALL\\\" without quotes to set all potential followers (That I found Base ID\\'s for) as essential.\r\nStep 4: Type \\\"bat EssNo\\\" without quotes to set all potential followers (That I found Base ID\\'s for) as killable.\r\nStep 5: Go on adventures.\r\nStep 6: Use your invincible follower as a packmule.\r\n\r\nI will be uploading a series of bat files later on that will allow you to set only one follower as essential while removing the essential mark for the other followers. I was unable to find 6 followers Base IDs check the Followers List included in the .Rar file. Use of these bat files will probably break your game, and it is possible that bugs may occur during certain quests. If you find any followers that I have not listed in the Followers List, let me know and I will be actively seeking the Base IDs for the missing followers. Expect updates.\r\n\r\nv.4\r\n\r\n*Edit, there seems to be a problem with the comments section of this mod, it appears as though the topic is \\\"locked\\\" and it shouldn\\'t be >_<\r\n\r\nv1\r\n\r\nAll followers are now able to essential including dogs and Farkas. Previous missed characters which are now included are: Derkeethus, Eola, Golldir, Grelka, Meeko, Vigilance, Barbas, Ogol, Ugor and Lob.\r\n\r\nF.A.Q\r\n\r\nQ: Do I have to use this every time I start the game?\r\nA: You only need to use it once per character. If you use the batch and save, it will remain forever on that save. \r\n\r\nQ: But I don\\'t want all my followers Essential, what do I do?\r\nA: Find out their BaseID yourself?\r\n\r\nQ: I tried clicking on them and setting them essential it didn\\'t work\r\nA: You need to use the Base ID. When you select a NPC via console you get their Ref ID\r\n\r\nQ: The batch didn\\'t work\r\nA: Did you use it correctly?\r\n\r\nQ: Can\\'t you just make this an ESM file?\r\nA: Without the creation kit I\\'m too lazy to do anything of the sort. Also you type in Ten letters [I counted the space] into the console, do you really need it easier?\r\n\r\nQ: Why did it take you so long to update this?\r\nA: My life is complicated with school and work and ex-girlfriend troubles. Also my computer exploded. Oh and Anime.\r\n\r\n~Thanks to Graxster  for helping me get the missing BaseIDs",
  "categoryId": "40",
  "version": "v1",
  "author": "Nekocatz",
  "createdUnix": "1321550787",
  "updatedUnix": "1327609748",
  "containsAdultContent": false,
  "uploadedBy": "Nekocatz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1076",
      "name": "Essential Followers",
      "version": "v.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Essential Followers-472.rar",
      "uploadedUnix": "1321550885",
      "modVersion": "v.4",
      "virusScanUrl": "https://www.virustotal.com/file/9092f77bb8308be8b83c5af47b7d20e4390661857b72203ae4f07cb970d113d1/analysis/1406414284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Essential%20Followers-472.rar?fid=1076&ttl=1535753377&ri=8192&rs=8192&setec=345d7efa06b4064c3b0fa3de26307fbe"
    },
    {
      "fileId": "23242",
      "name": "Essential Followers N Stuff",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Essential Followers N Stuff-472.rar",
      "uploadedUnix": "1327609748",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ab945b4dea37e32fb0cae7748769c10dc8cca5b529e6bc2014a8eeab3972cc65/analysis/1406639489/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Essential%20Followers%20N%20Stuff-472.rar?fid=23242&ttl=1535753378&ri=8192&rs=8192&setec=74a9daad3d6b036ae1c9ea51af80a53d"
    }
  ]
}