{
  "modId": 47227.0,
  "modName": "Beauty Mark",
  "summary": "A simple template file for creating a standalone UNP companion without all the fuss.",
  "descriptionHtml": "This file shouldn't need anything but the latest updated version of skyrim.  being as it doesn't use external scripts, it shouldn't even require skse, and i intend to keep it that way for this and all future versions of Beauty Mark.\r\n\r\nWhile working on another mod, I was given permission to use Aranya as an occupant. Little did StephieRawx realize that I was learning a lot from this, so my thanks go to her first for giving me the idea.  There is a step by step tutorial at the bottom of the page which will clearly need some tweaking.  I would very much like for someone with little or no experience using the creation kit to attempt to follow it, and voice any difficulties figuring it out in the forum section of this mod.  I want an open dialogue on this subject.\r\n\r\nI would also like to thank Shadowtigers at this point.  He is not feeling well at the moment, and has retired from modding until he does feel better.  He was quite ill when i was writing him letters, but responded anyway, and always with good advice.  I owe much of what i have learned to him, but don't blame him for my shortcomings, he did his best to get advanced concepts into my thick skull.  He spent an enormous amount of time tutoring me, and I will never forget that kindness.  I can never repay him, as I lack any skills he might even be interested in, but I can sure pass it on.\r\n\r\nMeet your new companion.  Don't know what her name will be, or what she will look like, but she already adores you, and will follow you anywhere a companion is allowed to accompany you. She will tolerate any crime you commit, and in most cases participate, no questions asked.  You could change these things, but i can't imagine why.\r\n\r\nBy the way, Yvonne is my wife's name.  I felt it appropriate that I name the base model after her. I have been married to her for over twenty two years, and I have never loved anyone so much.  I do appreciate that she allows all the pretty girls to run around in my game.  Two of the characters from COHO are named after my youngest son, Victor as well.\r\n\r\nIronically, there are no beauty marks in the mod.  No tattoos either.  That is for another day if I ever figure that out.\r\n\r\nThis is a simple companion template file.  Not sure if this has ever been done before, if so I sure haven't seen it.  The concept is simple.  included in the mod is a file called renamethisfile.esp.  big hint there, rename the file so that everyone isn't overwriting each others companions.  This is one of the requirements for using the file.  Included within is a sample companion named Yvonne located in the winking skeever.  She is intended to be renamed, duplicated, modified, and or moved to another cell of your choice.\r\n\r\nYvonne can easily be duplicated for mods with groups of companions.  Currently the mod is intended to work on human race females only.  Nord, Breton, Imperial and Redguard.  You will find within the kit a lot of resources with the keyword beautymark somewhere in the name.  for this reason it should be easy to create a companion with this keyword in the filter during the entire process.\r\n\r\nCurrently there are 7 ears, 14 hairs, 40 eyes, one outfit with several choices of boots, jewelry, daggers, and a built in UNP mesh that Yvonne uses.  All of the clothing items are made for the UNP body.\r\n\r\nbig hint, the ears are actually clothing items, so put them into an outfit that the companion wears if you want the elven ears. This is a lesson I learned from StephieRawx, and I like the option quite a bit.  It may not be the most ideal way to add ears, but it sure makes it easier for less experienced people to do, which is one of the goals I am going for here.  The example companion has the ears applied in this way.\r\n\r\nThe file works fine, and I see no reason to put a beta number on it, but I am not so arrogant to believe that my work couldn't use some improvement.  I do make mistakes.  I am learning like pretty much everyone else here who create mods.  This is a hobby, or I would be working for a game company and making money.\r\n\r\nI would also like for someone to attempt to use Enhanced Character Edit on this mod, and report back to me on how it works. Unfortunately ECE gives me script errors and just does not function, even if I remove all other mods from nexus mod manager except for live another life, and I am just not willing to give that mod up being as i also work on vanilla homes.\r\n\r\nOne other thing I can think of that lots of people could help with.  My computer runs Skyrim comfortably, but just can't handle certain graphic mods including the best lighting mods.  I would dearly love to see lots of screenshots done of companions made with this mod using a nice video card and lighting mod.  I left the upload images option wide open for this reason.  I will then go through them later to trim the images down to the best examples, also trimming out anything questionable.\r\n\r\nI really want to make this easy and fun for people who just lack the skills needed to create a companion, but this mod could easily be of use to experienced companion modders as well.  it definitely brings the learning curve to its knees, but also organizes things in such a way that experienced modders might find it fun and less frustrating to start with.  You are definitely welcome to add your own modifications to the file.  don't feel restricted to what is already in there.  The keyword beautymark has been added to all the items in the esp file, so you could probably create a companion with that keyword in the filter at all times.\r\n\r\n[b]Credits:[/b]\r\nFirst to StephieRawx, without her consent to use Aranya in my mansion project, I would never have thought of doing this.\r\n\r\nDimon99 for the dimonized unp female body\r\n\r\nApachii - Skyhair\r\n\r\nNoUserHere and Badmagic - elven ears\r\n\r\nFaxivcm - daggercraft\r\n\r\nInnova889 - Runic Eyes\r\n\r\nGabriel Mailhot - The Eyes Of Beauty\r\n\r\nPetrovich - leather clothing and jewelry\r\n\r\nR18PN 11 - Fiona Armor for HGEC\r\n\r\nNikitaa - CBBE Fiona Armor\r\n\r\nR18pn - UNP Fiona Armor\r\n\r\nHentai - Void armor\r\n\r\nNewerMind43 - Light Elven Armor\r\n\r\nAndrew210488 - New Elven Bow\r\n\r\nLastly, myself, (kar2nz) for compiling the work, which was no small task in itself.\r\n\r\nIf I forgot to add someone to the credits list please don't be offended.  Please feel free to contact me if you have been inadvertently neglected.  I am quite amiable about this situation I assure you.  I did my best to only include content I had express permission for, or was listed as a free modder's resource, but if something is in there somehow that I did not have permission for, I will remove it if that is your desire.\r\n\r\n[b]Permissions:[/b]\r\nYou are free to use this mod as you see fit under three conditions.  First, you must rename the esp file and zip it up in a compressed file of your own naming.  I do not want companions running around overwriting each other.  I really don't need the headaches involved in that, so by using this file you agree to rename the package.\r\n\r\nSecondly, all the credits must appear on your mod page.\r\n\r\nThirdly, this involves content from modders who do not want to see their content on other websites, so do not upload to steam or any other website other than skyrim nexus.  Please note that this last condition also covers the content being used in another game. I did specify skyrim nexus, not the entire nexus network.\r\n\r\n\r\n[b]Step By Step Tutorial[/b]\r\n\r\nBefore you get started on the kit, start a new game of Skryim, and generate a character who's appearance you would like to use on your companion.  Available races to work with are Breton, Imperial, Nord, and Redguard.  Do a nice makeup job, and adjust the facial features.  This is what your companion is going to look like, so take your time.  Once you are done creating your character, open the console by pressing the tilde key \"~\".  Once the console is open, type SPF yourcharacternamehere.  Unless you get an error message indicating that you did something wrong, you just generated a face file which you will be using later, exit the game.\r\n\r\nKeep in mind that most of the content has had the keyword beautymark inserted somewhere in the name, so pasting this keyword into any filter will probably make finding the custom content a lot easier.  Most of the items have been prefixed with two zeros to place them at the top of the list for the same reason, but some of the items do not have the leading zeros.\r\n\r\nStep 1:  Install the creation kit.\r\n\r\nStep 2:  Unzip Beauty Mark to a folder on your desktop or somewhere you can easily access.\r\n\r\nStep 3:  Rename renamethisfile.esp to the name of your companion or group of companions.  You MUST NOT skip this step.  It is one of the conditions for using the file.  If I find any companion mods out there with a renamethisfile.esp file in them, I will do my best to have the mod removed for failure to adhere to the conditions of the usage agreement.  I do want to make things easier for you, very much, but I will have no mercy on this situation.  I have made it very clear that I do not want the headache involved with several different mod overwriting each other.  Unless nexus makes it clear that this is not a problem, I am going to assume it is.  the mod manager does ask if you want to replace files during installation, and esp files are included in this. Please do not ignore this.\r\n\r\nStep 4:  Right click the data folder containing your renamed esp file and use your compression software to make a rar, zip, or 7z file.  Name the file accordingly.\r\n\r\nStep 5:  Use Nexus Mod Manager to install the new files you just made.  If you jumped the gun and installed first, you can still go in your skyrim data folder to rename the esp file.  You can then go into Nexus Mod Manager to activate the file.\r\n\r\nStep 6:  Open the creation kit, setting your new esp file as active.\r\n\r\nStep 7:  Open the companion which matches the race you want to use.  It is important that you don't get mixed up and change the race of a companion you already made, because they each use a different skin.  This was neccessary to get all the races working.  While this can be fixed, the intention here is to stick to the basics.\r\n\r\nStep 8:  If you have chosen to duplicate one of the files, the relationship will have to be repaired.  Your companion should still be open, so go to the relationships tab to create a new relationship if there is not one already there.  Parent NPC should be set at the companion's editor ID, leave this as is. Child NPC should be player.  I recommend that you set the rank at lover, and the type at conspirators.  Other settings will work, but again, the basics.\r\n\r\nStep 9:  Go to the inventory tab, and choose an outfit for your companion.  There is one sample outfit which the companion is already wearing, but you can alter this outfit, duplicate it and make small changes.  Being an example, this default outfit includes elven ears, but these can easily be removed if you do not desire a Lord Of The Rings style elf.  There are 7 different ears to choose from.  You can also choose one of the vanilla outfits from the game, but it might not fit the UNP body correctly  Trial and error on this point.\r\n\r\nStep 10:  While still in the inventory tab, drag a weapon from the object window into the box in the center of this tab.  By default, there are two of the Mutilator daggers which are included in the package, but you can choose to give her any weapon you want.  you can remove the mutilator daggers by simply selecting them, and pressing the delete key, or you can right click and choose delete.\r\n\r\nStep 11:  OK, she is dressed, armed, and wearing the ears of your choice if any at this point if all went well.  Now we move on to the Character Gen Parts tab where we will alter her appearance.  Remember that face file you generated?  Click the import button and look for the file you generated by name.  the extension of the file will be .npc  Voila, the companion should look a great deal like the one you generated in Skyrim, but the creation kit shows this poorly, so understand that she will look very different in the game from what you are about to see in the character render window.\r\n\r\nStep 12:  at the bottom of this tab are two checkboxes.  Select full.  If all went well, she should look roughly like what you generated in Skyrim, but you will have to make some adjustments.  In the base head parts section of this tab are several slots.  First, select the eyes, then go to the dropdown list to change the default eye color to one of the 40 eyes I included in the package, or you can just choose one of the vanilla eye sets.\r\n\r\nStep 13:  While still in the base parts section, select the hair.  Now go to the dropdown list below again, and choose one of the 14 apachii hairstyles I included.  Keep in mind these will be named beautymark, not apachii, to speed up development using this mod.  You can also choose one of the vanilla hairstyles, but i really can't understand why you would want to do that.  The apachii hairstyles are so much cleaner looking.  While still in the character gen parts tab, you can also select the haircolor from the dropdown list if you want to change that.  I will probably work on some odd colorform objects for exotic haircolors for punk rockers and people who just like exotic skin and hair colors later.\r\n\r\nOK, as far as I know your companion should be ready for the final step, placing her somewhere.  Click the OK button.to exit the character window., for the purposes of this tutorial, you are done with her.  Go to the cell view window to remove her from the winking skeever.  just the first two letters of the city is usually enough to bring up the buildings found there.  Select one of the cells by single clicking it, then type in the name of the city you want to go to, for example solitude. So, type so, and the list of solitude buildings come up.  browse to the winking skeever, and double click it.  Remove your companion from the winking skeever before placing her somewhere else.  I do very much want that character removed from winking skeever, so that there are not several copies of her running around in there. Please do not neglect to do this, just select her in the render window, and click the delete key. This removes her from the winking skeever, and does not delete her entirely.\r\n\r\nI recommend an interior cell for your first companion. Companions are most commonly found at inns and taverns, but they can be placed just about anywhere, for example a temple, palace, or castle.  You could even put her in a store.  Obviously some places are more appropriate than others.  One very imaginative location I found a companion in was Evergleem Sanctuary.  Lilium was placed in this cell in such a position that you had to complete a vanilla quest to reach her. Try to think like that when placing a companion.  Be imaginative.\r\n\r\nDouble click the cell you want to place her in.  By default, she is located at the winking skeever, but she can also be removed from that cell, and placed somewhere else.  Drag the companion from the object window into the cell view where the cell is loaded which you chose to place your companion in.\r\n\r\nBe sure to double check the game name of your character within the character window.  It is not super important that you change the game name, or editor ID, but if you don't want to have one of 12 Yvonnes running around around on nexus, I suggest you change the game name at least.  Changing the editor ID after dragging her into a cell is probably not a good idea.\r\n\r\nOK, I am sure I missed a few points, so let me know where I am lacking.  I do expect for you to make some effort at learning the creation kit, but not much.  If you can really think of important things which I did not cover, or can point out where something was worded badly, I am glad to accept good advice.\r\n\r\nThe very last thing I can think of is to go back into your skyrim data folder, and copy the esp file you just modified.  paste it back into the data folder of the mod you first unzipped onto your desktop, removing the original file if for some odd reason it is still there.  Right click the data folder containing your new esp file, and compress it.  You should be ready to upload to nexus.\r\n\r\nBe sure you look over the credits on the description page, and include them in the credits for your companion mod.  I will ask politely once for this to be fixed, but after that I will seek the mod's removal if this has not been done.  some of the other authors involved might not be as patient as I am about this issue, and I can't say I would blame them for that attitude.\r\n\r\nFinal word of redundant warning, the contents of this file are not to be uploaded to other sites, even though you modified it.  I will do my best to have the file removed from other sites which were not authorized.  Many of the mod authors whose content i used express this desire, and I intend to honor it.",
  "categoryId": "66",
  "version": "1.1",
  "author": "kar2nz - StephanieRawx",
  "createdUnix": "1384614252",
  "updatedUnix": "1384772690",
  "containsAdultContent": false,
  "uploadedBy": "kar2nz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000079600",
      "name": "Beauty Mark",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "63637",
      "fileName": "Beauty Mark-47227-1-0.7z",
      "uploadedUnix": "1384613442",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ec4fa42ce9ce7be4ecdb47f64fd9fa180a65884d3b6b8195eaf28e8f8e73f0c4/analysis/1407794600/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beauty%20Mark-47227-1-0.7z?fid=1000079600&ttl=1535827498&ri=8192&rs=8192&setec=96be2a2bf5b5380bae3efa20c47157c4"
    },
    {
      "fileId": "1000080312",
      "name": "Beauty Mark - Heavy Duty",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "94824",
      "fileName": "Beauty Mark - Heavy Duty-47227-1-1.7z",
      "uploadedUnix": "1384762660",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6f8c5182e941361cf0b33a0d933523432a5ca85a8be02a37c4ba243dedb0efee/analysis/1407797812/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beauty%20Mark%20-%20Heavy%20Duty-47227-1-1.7z?fid=1000080312&ttl=1535827498&ri=8192&rs=8192&setec=5ddc0ce3b69f38b0ae835b2545b8ba31"
    },
    {
      "fileId": "1000080344",
      "name": "Beauty Mark - Heavy Duty - Shard Of Azzinoth Patch",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Beauty Mark - Shard Of Azzinoth Patch-47227-1-1.7z",
      "uploadedUnix": "1384772209",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ae4147265aad9e76b2f4a8f255102b5b687b7ad2676520a08683da5666331dba/analysis/1407797976/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beauty%20Mark%20-%20Shard%20Of%20Azzinoth%20Patch-47227-1-1.7z?fid=1000080344&ttl=1535827498&ri=8192&rs=8192&setec=1481dd01944c31821762c07f7aea09f6"
    },
    {
      "fileId": "1000080345",
      "name": "Greek Goddesses",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "95017",
      "fileName": "Greek Goddesses-47227-1-0.7z",
      "uploadedUnix": "1384772523",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/02010927563f998009e03cd3c75d0d467a28042589277b6e8d86ca8ecb45a660/analysis/1407798026/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Greek%20Goddesses-47227-1-0.7z?fid=1000080345&ttl=1535827499&ri=8192&rs=8192&setec=f668b9ac34c28ccbf76491099a716e12"
    },
    {
      "fileId": "1000080346",
      "name": "Face Files and Filepaths",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Face Files and Filepaths-47227-1-0.7z",
      "uploadedUnix": "1384772690",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/48abb5cc5c2c82d91a5179c31c9044745395baafd3dc51b00ee91403cec2a6ff/analysis/1407798008/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Face%20Files%20and%20Filepaths-47227-1-0.7z?fid=1000080346&ttl=1535827500&ri=8192&rs=8192&setec=2b9fe3f6fcdeb1c1b1756f353c02a307"
    }
  ]
}