{
  "modId": 47284.0,
  "modName": "LOTR - Uruk-Hai Lurtz Follower and Uruk Warpaint for Orcs",
  "summary": "Adds an Orc Follower named Lurtz at Dushnik-Yal with a custom Facepaint - WIP",
  "descriptionHtml": "This mod adds a Orc Follower named Lurtz based of the Uruk Commander in The first film.\r\n\r\nHe is skilled in Archery - Onehanded and heavy Armour. \r\nLurtz has a lot of HP BUT is not essential. Uruk-hai are strong, powerful but not invincible.\r\n\r\nLurtz is in Dushnik-Yal, the \"Capital\" Orc Stronghold of Skyrim (in my opinion anyway)\r\n\r\nThis mod also includes two new custom Orc face paints that are male only so far, mimicking the White hand paint of Saruman based of the Uruk-hai face paints seen in the movie.\r\n\r\nThese face paints do not have a normal map currently, I would like to make a request for somebody to do one?\r\n\r\nNote: Some errors may appear e.g. the white paint appearing over your face first time around but go to the selection of face paints e.g. via \"show facegenmenu\" or if you have Dawnguard installed, seek out the face sculptor lady in Riften Ragged Flagon to choose you new face paint.\r\n\r\nThis does edit the Orc race and Orc Vampire race (adding 2 new facepaints) BUT should work fine with other mods that alter the Orc races e.g. I have Apachii Hair installed and I can select both facepaint and hairstyles together.\r\n\r\nBest load your Orc race changing mods first before this one (Just in case ^^ )\r\n\r\nUruk-Hai Armor by mandarin\r\nhttp://skyrim.nexusmods.com/mods/28793/",
  "categoryId": "66",
  "version": "1",
  "author": "Beth",
  "createdUnix": "1384636093",
  "updatedUnix": "1384637909",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000079735",
      "name": "Uruk-Hai Lurtz follower and Uruk Facepaints",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "340",
      "fileName": "Uruk-Hai Lurtz follower and Uruk Facepaints-47284-1.rar",
      "uploadedUnix": "1384637909",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/43469c0091dec95373d8fc315dec680dc6b5c62377c459fb27f8996be670c909/analysis/1407795062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Uruk-Hai%20Lurtz%20follower%20and%20Uruk%20Facepaints-47284-1.rar?fid=1000079735&ttl=1535827559&ri=8192&rs=8192&setec=dadd46389989084935559066c93b9e82"
    }
  ]
}