{
  "modId": 47303.0,
  "modName": "World of Women",
  "summary": "This mod changes MOST of the males in skyrim to females. everyone in each of the primary cities and several of the outlying areas. Also several of the bandit factions and the like. ",
  "descriptionHtml": "     This is a mod I made for my own use. I wanted to make a mod,and this was one of the easier things to do, change base properties of characters. After I changed a few people in Whiterun, I decided to see how many I could change. The complette mod took me two months or so to \r\nfinish. It was a hobbie, not an obsesion.\t\r\n\t\r\n     The guards and the bad guys, are mostly generated in a tree like formation. There is only a base group of eight or so, then the \r\ngame levels them up from time to time, based on the characters level. \r\n\r\n     This means that the changes made to the bandits and others should carry on for a while.\r\n\r\n\tBe warned, I can't change the voices. it would BREAK several of the quests that relly on certain things being said for the quest to advance. That means the changed characters will appear female but still use a male voice. Rediecting the individual characters to female voice files would also break several quests.\r\n\r\n\tI've run across a few NPCs that have a missing hair texture, I've fixed all the ones I've seen. There hair would show up as a flat blue color, like their hair had been dipped in paint, lol.\r\n\r\n\tThe only characters edited by this mod are VANILLA skyrim NPCs. It will NOT change anybody from the expansions.\r\n\t\r\nRequirements:\r\n\tI was using Calientes CBBE at the time i made this mod. It MAY be needed to make the faces match the bodies, although i never loaded it in the Creation Kit.\r\n\tThe ESP file can be used separately, but the meshes and textures are needed to make the face texture match the bodies. \r\n     \r\n        If you use a different body texture, it may not match.\r\nNothing else is required.\r\n\r\n\t\r\nCompatibility:\r\n\tThis mod should be compatible with nearly everything. The only conflicts may come from the fact everyone is listed as a female. Mods that require males may have trouble. \r\n\r\n\tAny mod that ALSO changes NPCs in some aspect may not function correctly if loaded in the wrong order.\r\n\r\n\tThanks and have fun with this mod. I have no further plans to change anything in it.\r\n\r\n",
  "categoryId": "33",
  "version": "1.0",
  "author": "Soundstream1969",
  "createdUnix": "1384651713",
  "updatedUnix": "1384652032",
  "containsAdultContent": false,
  "uploadedBy": "soundstream1969",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000079885",
      "name": "World of Women",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "104502",
      "fileName": "World of Women-47303-1-0.rar",
      "uploadedUnix": "1384652032",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9fb54acdc4b753ae53d4870ef57eb8ccba815811566f28f7c0dbe5ada98f23c8/analysis/1407795442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/World%20of%20Women-47303-1-0.rar?fid=1000079885&ttl=1535827573&ri=8192&rs=8192&setec=c1bff229078cbf01feae9ce6d5adeb29"
    }
  ]
}