{
  "modId": 47320.0,
  "modName": "Fortify Armor Rating Enchantment by Oppaiko",
  "summary": "Adds an enchantment to boost armor rating magically, and two craftable items that can be disenchanted.",
  "descriptionHtml": "B A C K G R O U N D\r\n\r\nI like the idea of wearing armor increasing jewelry, but \"adding an armor rating\" to a ring, without magic seems cheep and cheezy to me.  So I got tired of not having any means to enchant jewelry with an armor boost.  So in frustration, I made my own mod.\r\n\r\n*Please note: My images use Better Circlets HQ V1o1 by Yuril, which I HIGHLY recommend, found here:  \r\n\r\nhttp://skyrim.nexusmods.com/mods/6495//?\r\n\r\nA Q U I S I T I O N\r\n\r\nThere are two recipies that can be created:\r\n\r\nThe circlet\r\nThis requires several daedra hearts, a filled grand soul gem, and a silver and moonstone circlet.  It will produce an armor boost of 100.\r\n\r\nThe Ring\r\nThe ring requires the componants for a silver and amythest ring (silver ingot, and amythest,) a single daedra heart, and a filled greater \r\nsoul gem.  The ring will produce an armor boost of 15.\r\n\r\n\r\nThese can be disenchanted, and the enchantment learned.  My in-story thinking is that creating the new spell required a deadra heart, and particular materials to focus them.  The newly created ring will produce a little more armor than enchanting a ring once the spell has been created, due to the daedra heart.  \r\n\r\nThis is sort of a quick and dirty mod.  It should be highly compatible with other mods.  I only used the primary skyrim.esp file as the base, and created all new form IDs.\r\n\r\nI hope you enjoy!\r\n\r\n- Emily (AKA: Oppaiko)\r\n\r\nUpdated to v1.01:  Renamed the circlet and changed the visual effect, which is also now temporary.\r\nItem names:  \r\n    Ring: \"Ring of Minor Armor\"  \r\n    Circlet:  \"Major Circlet of Armor\"\r\n",
  "categoryId": "75",
  "version": "1.01",
  "author": "Oppaiko",
  "createdUnix": "1384660860",
  "updatedUnix": "1384662300",
  "containsAdultContent": false,
  "uploadedBy": "oppaiko",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000079938",
      "name": "Main File",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Main File-47320-.zip",
      "uploadedUnix": "1384662300",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d6c95f9be339f0e794d6d71a507da9a1bae20c953a84864c75cdc4ef4a8b7156/analysis/1407795610/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-47320-.zip?fid=1000079938&ttl=1535827589&ri=8192&rs=8192&setec=159f4ce57f681dc5d737524fd5b5e8f6"
    }
  ]
}