{
  "modId": 4735.0,
  "modName": "Master Enchant Disenchant and more powerful Enchanting",
  "summary": "Master Enchanter - Allows you to disenchant 15 unique/artifact weapons/armor and adds them to your enchant menu. Also optional mod increases number of charges/power of enchants! ",
  "descriptionHtml": "Master Enchanter by gid2525\r\n\r\nVersion 2.1 (cleaned up description)\r\n\r\n\r\n*Added The Gauldur Amulet*\r\n\r\n\r\nREMOVED Spellbreaker and Ebony mail as they simply are bugged with no way to fix. You CAN however get and Ebony mail RING with Boethiahs embrace and a Spellbreaker ring that is modded to NOT count toward you wearing it (so you can still wear other rings) HERE:\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2026\r\n\r\nand download both. They work great!\r\n\r\n\r\nNOTE!! The screenshots show 4 enchantment slots because I am using this mod here:\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=990\r\n\r\nNOTE: It is possible to create an item with so many charges/power that the charges \\\"flip over\\\" and the item reverts to normal. Experiment.\r\n\r\nMy mod only has this:\r\n\r\nAdds the ability to disenchant several Unique items and Artifacts and adds the effects to your enchant menu so you can use them just like any other enchantments. 16 OF THEM! In addition, all of the Armor enchantments in this package can be used on ANY piece of armor or jewelry- no restrictions to type. I would also recommend the \\\"I put a spell on you\\\" mod at skyrim nexus so you use all the other default armor enchantments on any piece of armor with no restrictions as well.In addition, with this mod you can dramitically increase the power/ number of charges with the optional mod files included in the zip. \r\n\r\nThe Enchantpower mod changes the amount that your enchantment skill is multiplied by  (one of the parts of the equation) to get your overall charge amount/power. Just choose which one you want x1.75, x2.25, x3, x5, x10, x15. Say you have an enchantment skill of 50. The X5 mod would make the game calculate it like your enchantment skill is 250. In addition I have tweaked a few of the base enchantments to be more powerful have better effect, like the Stagger enchantment. Stagger does\r\nnot have a description but it will stagger the opponent you are hitting so he staggers back, even when he is blocking. VERY useful. \r\n\r\nOn the multieffect items though only one of the stats is ajustable with the slider when enchanting. Not sure exactly how to make it so all stats change when you increase or decrease charge amount/power. In any case the multieffect enchantments\r\nonly take up 1 enchantment slot on your item. For instance the Archmage robes which has 7 different enchantments on it only counts toward 1 of your item enchantment slots beause all of those are wrapped into the enchantment \\\"Archmage.\\\" \r\n\r\nHere is the list:\r\n\r\nItems:                           Adds to Your Enchantment Menu:\r\n\r\n[Uniques]\r\n\r\nBriarheart Geis                  Nordbane: extra damage vs Nords\r\nGhostblade                       Insubstantial: Does extra damage, ignoring armor \r\nNotched Pickaxe\t\t\t Smithing Expertise (5 points), does extra shock damage\r\nPoacher\\'s Axe\t\t\t Huntsman\\'s Prowess: extra Damage to animals\r\nWindshear\t\t\t Stagger: Stagger Attacker <<<--\r\nNightingale Bow\t\t\t Nightingale: Target takes frost damage to Health and Stamina,Frost Damage, Shock Damge, Slow\r\nDragonbane\t\t\t Dragonbane: extra damage vs dragons, extra shock damage to others. \r\nKynes Token\t\t\t Damage taken from animals is reduced 10%\t\r\n\r\n[Artifacts]\r\n\r\nDawnbreaker\t\t\tMeridia\\'s Retribution: Burns for X points, and when killing undead, a chance to cause a fiery explosion that turns or destroys nearby undead (30 seconds).\r\nKeening\t\t\t\tKeening: Absorb 10 points of magicka, Drain Magicka, Absorb Health, Absorb Stamina\r\nMace of Molag Bal\t\tMolag Bal: Stamina Damage, Magicka Damage, Soul Trap\r\nMehrunes\\' Razor\t\t\tInstant Kill: Hits have a small chance to instantly kill\r\nWuuthrad\t\t\tElfbane: Especially deadly to elves\r\nKonahrik\t\t\tKonahrik\\'s Privilege: When health is low, has a chance to heal wearer and damage nearby enemies and very rarely summons a dragon priest to your aid.\r\nArchmage\\'s Robes\t\tArchmage: All spells cost 15% less to cast, +50 magicka, and magicka regenerates 100% faster (7 different enchantments in one!)\r\nRing of Namira \t\t\tNamiras Blessing: Stamina is increased. Feeding on corpses grants you increased Health and Health regeneration.\r\nShield of Ysgramor\t\tYsgramo\\'s Protection: Resist Magic,  Fortify Health\r\nThe Gauldur Amulet\t\tGaldur\\'s Fortress - Fortify Magicka, Health, and Stamina.\r\n\r\nINSTALLATION: Copy the Data folder to your main Skyrim folder and merge it with your current data folder. (optional) Copy Choose !ONE! of the Enchantpower files from the enchant folder and copy to skyrim\\\\Data folder for increased charges/power. (optional)- COPY THE enchant.txt file to your skyrim\\\\data folder and ingame open colsole and type: bat enchant \r\nThis will give you one of each of all of these items so you can quickly disenchant and gain all these new enchantments immediately! ",
  "categoryId": "75",
  "version": "2.1",
  "author": "gid2525",
  "createdUnix": "1325042044",
  "updatedUnix": "1326558827",
  "containsAdultContent": false,
  "uploadedBy": "gid2525",
  "primaryFile": null,
  "files": [
    {
      "fileId": "19723",
      "name": "Master Enchant Disenchant and more powerful Enchanting",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Master Enchant Disenchant and more powerful Enchanting-4735-2-1.zip",
      "uploadedUnix": "1326558827",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/2266b210a3b5cb0381a986c9b340baba7f8e34c87b05bbef8ba13a4470a7c740/analysis/1406610486/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Master%20Enchant%20Disenchant%20and%20more%20powerful%20Enchanting-4735-2-1.zip?fid=19723&ttl=1535760850&ri=8192&rs=8192&setec=ad5bb44c21b57dfd835dcb32ae421ea9"
    }
  ]
}