{
  "modId": 47397.0,
  "modName": "More Player Homes - with General Stores cloud storage",
  "summary": "More Player Homes adds 5 brand new obtainable homes in Riverwood, Ivarstead, Rorikstead, Shor's Stone, and Dragon Bridge. All of them are complete with cloud storage (via General Stores) so you'll never have to leave any of your valuables behind.",
  "descriptionHtml": "DESCRIPTION\r\n-------------\r\nWere you ever in a village like Riverwood or Shor's Stone wishing you had a place to sleep, somewhere to put your stuff, or just more crafting resources? If so, this mod is for you. More Player Homes adds 5 brand new obtainable homes in Riverwood, Ivarstead, Rorikstead, Shor's Stone, and Dragon Bridge. All of them are complete with cloud storage (via General Stores) so you'll never have to leave any of your valuables behind! Every house also comes with an anvil, smelter, grindstone, workbench, enchanting table and alchemy lab to turn all the ingredients, ores and pelts you're carrying into something more useful. Each home is locked until you find the key for the respective one. Information on where to find them can be found below or in the in-game note on the small table of each house.\r\n\r\n\r\nKEY LOCATIONS\r\n---------------------\r\nRiverwood: Bleak Falls Barrow - Near the rear exit, check the pedestal\r\nRorikstead: Swindler's Den - Lying on a dark barrel near the boss chest\r\nIvarstead: Pinepeak Cavern - in a kettle behind the only chest inside\r\nShor's Stone: Torvald's Cave - In Torvald's Gap right before entering the crossing. Check the boulders at the end of the short stream\r\nDragon Bridge: Folgunthur - After the word wall, before entering the door, check the large bowl to the right.\r\n\r\n\r\nINSTALLATION\r\n------------------\r\nNote: [url=http://skyrim.nexusmods.com/mods/18340//?]General Stores[/url] is REQUIRED for this mod to run, as well as patch 1.9\r\nJust download the latest version and extract it to your Skyrim \"Data\" folder.\r\n\r\n\r\nUNINSTALLATION\r\n-----------------------\r\nDeactivate and/or delete \"MorePlayerHomes.esp\" and you're finished. Make sure you don't leave anything important in any of the houses.\r\n\r\n\r\nFUTURE UPDATE PLANS\r\n-------------------------------\r\n1. Make all homes unique rather than all the same duplicated cell.\r\n2. Add quests to obtain each key.\r\n3. Possibly more cool features, if I can come up with any others. Suggestions welcome!\r\n\r\n\r\nCREDITS\r\n----------\r\nEverything in this mod relating to the cloud storage system (scripting, models, textures, menus, etc.) are part of the General Stores mod by Harvey2112\r\nOtherwise, everything else was edited, placed, built, etc. by myself.",
  "categoryId": "67",
  "version": "1.0",
  "author": "ninjamunky83",
  "createdUnix": "1384758699",
  "updatedUnix": "1384758647",
  "containsAdultContent": false,
  "uploadedBy": "ninjamunky83",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000080306",
      "name": "More Player Homes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "151",
      "fileName": "More Player Homes-47397-1-0.rar",
      "uploadedUnix": "1384758647",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/81150a038df69f4efa8fb7cfae8f34b8a71d9979e51081cdc2a66b41f47362b8/analysis/1407797709/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Player%20Homes-47397-1-0.rar?fid=1000080306&ttl=1535827658&ri=8192&rs=8192&setec=ced76332de6ac6c057ab52baeb250ba6"
    }
  ]
}