{
  "modId": 47437.0,
  "modName": "Mod Mercante di vestiti rari o inottenibili - Mod Italiana",
  "summary": "Vai al negozio Radiose Vesti a Solitude per incontrarla",
  "descriptionHtml": "Questa mod l'ho fatta per me, ma tanto che ci sono la pubblico.\r\nNon ho voglia di fare gli screenshot, quindi credetemi sulla parola, scaricatela ed andate nel negozio Radiose Vesti a Solitude.\r\nI prezzi di molti vestiti sono alti, ma secondo me sono adeguati siccome non sarebbero ottenibili in alcun modo.. E vi ricordo che la mod l'ho fatta per me, quindi mod mia, regole mie ahahah\r\nHo aggiunto anche i vestiti che sono ottenibili tramite quest che non farò mai con il mio pg che ha bisogno di questi vestiti (per esempio quelli delle quest della confraternita oscura tipo quella del matrimonio e l'ultima).\r\nSono in vendita delle vesti di vaermina con un peso ridotto (1 al posto di 5).\r\nNell'inventario certi vestiti non hanno dei modelli propri e quindi ne usano altri (per esempio le vesti di nocturnal che appaiono come normali vesti), ma fidatevi che sono quello che il loro nome dice.\r\nI vestiti da boia non sono indossabili dai personaggi femmina (compreso il cappuccio)",
  "categoryId": "60",
  "version": "",
  "author": "Vunter",
  "createdUnix": "1384793039",
  "updatedUnix": "1384792970",
  "containsAdultContent": false,
  "uploadedBy": "Vunter",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000080432",
      "name": "Mercante di vestiti rari o inottenibili",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "124",
      "fileName": "Mercante di vestiti rari o inottenibili-47437-1-0.rar",
      "uploadedUnix": "1384792970",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/90ac747245201ab6cc732073ec04582023fb068c393b16281fa2946cad793cef/analysis/1407798303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mercante%20di%20vestiti%20rari%20o%20inottenibili-47437-1-0.rar?fid=1000080432&ttl=1535827689&ri=8192&rs=8192&setec=1a1a2dbc83687ca40de7014cd3b62eb4"
    }
  ]
}