{
  "modId": 47440.0,
  "modName": "Trickster",
  "summary": "Use as a Weapon enchantment or as a Trick Bound Bow with five Tricks: Disrobe (with chance of friendship), Chicken Morph, Slow, Disarm, and Disintegration. Features include: Combat Chickens, Loot transport on kill shot to High Hrothgar, Conditional Soul Traps, Elite Thralls, Kippi the Orphan ward of the Greybeards, and the Trickster Shadow Ring.",
  "descriptionHtml": "THE TRICKSTER \r\n         By\r\n    Shring Ri\r\n \r\n\r\nThis mod took over six months to develop in hopes of making a very polished and refined submission to the Nexus community.\r\n\r\nThe core of the Trickster is a Chance of Trick, which can be applied to weapons as an enchantment. But the Trickster also manifests as a bound bow offering four distinct modes of functionality depending how it is used. These modes are: \r\n\r\n1) Barnyard fun and magic with tricks and prizes (like a kick ass exploding arrow). Comes with two races of magical chickens, combat and medic, that can go indoors and swim.  Though Trickster Chickens can be viewed as being novel, they have been groomed and developed to be serious comrades and try really hard to be helpful. This aspect of the Trickster is configurable and can be turned off. \r\n\r\n2) Stealth play with enhanced sniping. The Trickster can be used as an integrated stealth weapon when combined with the Trickster Shadow Ring.  The ability to craft the ring is a reward for completing the Way of the Clean Kill, an optional Trickster challenge for stealth enthusiasts.  With this ring a set of stealth related magical effects and perks kick in when conjuring the Trickster. Not only does this streamline stealth play in casting one spell instead of several, but it enables you to have a bow equipped and drawn while being invisible -- not possible with Skyrim's stock invisibility spell which dispels as soon as you equip a bow.   Trickster Chickens are also stealth compatible in that they have a high level of sneak and may remain undetected where thralls cannot.  They also will stay put when commanded while you sneak around. Chicken prizes (found in dead chickens) may include useful alchemy ingredients for poisons. \r\n\r\n3) Enhanced reanimation. The Trickster goes beyond vanilla master reanimation spells in that it is stronger and can reanimate creatures that otherwise resist reanimation such as Giants, Mammoths and certain Death Lords. By placing specific rare items into an NPC's corpse, you can also create Elite Thralls.  These Elite Thralls have boosted attributes, spells and armor, as well as the ability to conjure Flame Atronachs  simultaneously with a bound bow. Chickens of Mercy (the ones that morph from female NPCs) help out in that they will heal Trickster thralls which are otherwise unable to regenerate health on their own. \r\n\r\n4) Spontaneous inventory recovery and transport when hitting corpses or upon a kill shot with a Trickster enchanted weapon. Combine this with a cash laden full service merchant near the retrieval point (who also meditates) and you have an intuitive, streamlined means of recovering and processing loot including items you may otherwise miss, leave behind, or spend way too much time sifting through and sorting out trying to decide what to take and what to leave behind. This is perhaps the slickest feature of the Trickster and should not be underrated. Save precious game time, use Auto-Stow. This feature is especially handy in recovering loot from distant targets, such as a corpse floating down a deep ravine.\r\n\r\nThough somewhat complex, these features have been thoughtfully woven together where once learned and with a little practice, they should become intuitive and easy to use. Nonetheless, the Trickster is ready to go at first use and its extended features can be ignored until you are ready to explore them. Furthermore, the Trickster is highly configurable where tricks and other features can be individually toggled on and off on the fly.       \r\n\r\nSummary of Features:\r\n \r\nTHE TRICKSTER has 5 and 1/2 semi-randomly generated tricks to pester your enemies with: \r\n \r\n1.       Chicken morph\r\n2.       Slow - entirely unique effect developed from scratch, superior to vanilla poison slow effects.\r\n3.       Disarm \r\n4.       Disintegration\r\n5.       Disrobe with a chance of Friendship\r\n \r\nThe Trickster has the following utilitarian features to streamline your game playing experience:\r\n \r\n•         Daedric and Iron fired arrow retrieval (upon sheathing the bound bow).\r\n•         Auto-Stow of loot on kill shots or corpse shots to the chest outside High Hrothgar.\r\n \r\n Some other features of the Trickster include…:\r\n \r\n•         Selective Petty Soul Sucker if player has vacant Petty Gems.\r\n•         Selective Grand Soul Trap if player has vacant Grand or Black Soul Gem.\r\n•         Kippi the Orphan, a full service cash laden merchant near the auto-stow retrieval point.\r\n•         Combat chickens and medic chickens to aid you in battle.\r\n•         “Permanent” reanimation that works on most creatures that don’t self destruct.\r\n•         Enhanced Elite Thralls that conjure bound daedric bows and Flame Atronachs.\r\n•         The Arrow of Insufferable Intolerance, a highly destructive exploding arrow.\r\n•         \"Sure Shot Chicken\" and \"Sure Shot Friendly\" crafted potions.\r\n•         A book \"Of Dragons and Chickens\" a biography of the Trickster and how his powers evolved.\r\n•         The Way of the Clean Kill, a challenge with rewards for the disciplined, including...\r\n•         ...the Trickster Stealth Set and eventually the Trickster Shadow Ring tailored for stealth players.\r\n\r\n\r\nTo install the Trickster: \r\n \r\nUse the Nexus Mod Manager, or just copy “Trickster.bsa”, “Trickster.esp” and Trickster’s Script folder into your Skyrim Data folder.\r\n \r\nTo get the Tome of the Trickster:\r\n \r\nGo to High Hrothgar and take the Tome of the Trickster from the conference room table.  Once you learn the Trickster Spell, you will gain a Shout for toggling features on and off. You will also gain a Shout for making chickens stay in place or resume following you. A Trickster Field Guide will be added to your inventory providing a quick reference to Trickster essentials. A Trickster bow for disenchanting will be added to your inventory with which you may enchant other weapons, such as a dagger, with a partial set of the Trickster’s features, including Auto-Stow. \r\n \r\n \r\nThere is a cheat to get the Tome of the Trickster at the onset of a new game so as to not have to wait for access to High Hrothgar:\r\n \r\n          player.additem ##0012c7 1\r\n \r\n“##” is the hex load order of the Trickster plug in. \r\n  \r\nFor a quick reference on how to access the Trickster’s features, and to learn more about the Trickster Stealth Set, go in game and activate the Tome of the Trickster, then find the Trickster Field Guide in your inventory.  Alternatively, for a more in depth reference including cheats (such as how to bypass the Clean Kill Challenge and get the Trickster Shadow Ring) see the Trickster Readme file included with the download.",
  "categoryId": "75",
  "version": "0.90b",
  "author": "Shring Ri",
  "createdUnix": "1384851803",
  "updatedUnix": "1384850447",
  "containsAdultContent": false,
  "uploadedBy": "ShringRi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000080716",
      "name": "Trick Bow - Combat Chickens - Auto Stow - Way of the Clean Kill",
      "version": "0.90b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2187",
      "fileName": "The Trickster-47440-0-90b.zip",
      "uploadedUnix": "1384850447",
      "modVersion": "0.90b",
      "virusScanUrl": "https://www.virustotal.com/file/652394f6971549ac62d627bfc5f5f5f24a319b6cb1bbb90c7510acc298969a3b/analysis/1407799129/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Trickster-47440-0-90b.zip?fid=1000080716&ttl=1535827692&ri=8192&rs=8192&setec=782ce97ba6d9291a2dfda2c73395683b"
    }
  ]
}