{
  "modId": 47489.0,
  "modName": "All Cells Respawn -Dungeons Dwemer Ruins Caves etc-",
  "summary": "Respawns all the Caves, Nordic Ruins, Dwemer Ruins, Military Forts and Mines in Skyrim (even ones that are set to &#34;Never Reset&#34;)",
  "descriptionHtml": "Update 13/10/2016 - Removed Glydenhul Barrow and White Ridge Barrow from the respawn list (both from Dragonborn DLC) it was causing spiders and ghosts to spawn next to the player after 30 days (or whatever your respawn timer is set too). File should be compatible with Skyrim Special Edition, providing they haven&#39;t changed or merged the ESPs (very unlikely) \r<br />\r<br />\r<br />Respawns all the Caves, Nordic Ruins, Dwemer Ruins, Military Forts and Mines in Skyrim (even ones that are set to &#34;Never Reset&#34;). Sort of like Oblivion used to be, everything respawned. That&#39;s the goal I was heading toward with this mod.\r<br />\r<br />\r<br />Does what it says on the tin pretty much, I have missed approximately 3 locations as I am having issues finding the encounter zones in the Creation Kit.\r<br />\r<br />Bit of a warning here so please read - I have no idea how this will effect quests, obviously there was a reason for certain areas not resetting but I was tired of walking into a ruin to plunder and having to leave empty handed.\r<br />I have tested Mzulf (Dwemer Ruin) before and after the quest for the College of Winterhold and nothing went wrong, so it should be all good, but please backup your saves&#33; I have also tested &#34;Hillgrunds Tomb&#34; I completed the quest with this mod active (no issues encountered) except one the cell had reset, a unique character (the Necromancer at the end) respawned, whether this is good or bad is down to personal preference as this will happen in any cell with unique (named) spawns.\r<br />\r<br />I&#39;m gonna work on Dawngaurd and Dragonborn next, however most of the areas in these DLC reset anyway so I&#39;ll only rush this for high demand.\r<br />\r<br />---Installation---\r<br />\r<br />1.Take the AllCellsRespawn.esp file and drag and drop it from the 7zip archive into the &#34;Data&#34; folder\r<br />2. Activate the ESP before launching the game through the Skyrim Launcher or Nexus Mod Manager\r<br />3. You&#39;re good to go&#33;\r<br />\r<br />---Uninstallation---\r<br />1. Delete AllCellsRespawn.esp in the Data directory\r<br />\r<br />--Compatibility---\r<br />This mod changes the &#34;Encounter Zone&#34; attribute which is assigned to cells (such as caves and Dwemer Ruins) it should be compatible with most mods (including mods that change the spawn rate which is not handled in &#34;Encounter Zones&#34;)\r<br />\r<br />Have fun, feedback and criticism is welcome&#33;\r<br />\r<br />\r<br />Want to know which areas respawn but don&#39;t want to modify them, try my other mod: http://skyrim.nexusmods.com/mods/31714",
  "categoryId": "24",
  "version": "3.0",
  "author": "Aurora555",
  "createdUnix": "1384824035",
  "updatedUnix": "1476388135",
  "containsAdultContent": false,
  "uploadedBy": "Aurora555",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000224102",
      "name": "Locations Respawn (Vanilla and DLC)",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Locations Respawn (Vanilla and DLC)-47489-3-0.zip",
      "uploadedUnix": "1476388135",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/fef2adbc89e87c2ee5f80d7e2f3d682a0202abe6e67a707ac32a1cca6275ad97/analysis/1476388142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Locations%20Respawn%20%28Vanilla%20and%20DLC%29-47489-3-0.zip?fid=1000224102&ttl=1535827721&ri=8192&rs=8192&setec=1a96d0515d0bd577de2a68e195f9ce58"
    }
  ]
}