{
  "modId": 47487.0,
  "modName": "Behemoth and Thanatos Dragons addon plus Apex Werewolf",
  "summary": "Description English/Francais\r<br />Add Zerofrost creatures to the leveled list with their alternate texures.\r<br />Rajoute les creatures de Zerofrost au leveled list ainsi que leurs textures alternatives.",
  "descriptionHtml": "Description English/Francais\r<br />\r<br />\r<br />Future update: Correct some minor spelling error. (i forgot a space in a name)\r<br />Add a few more screenshot.\r<br />\r<br />\r<br />What it does:\r<br />Add Zerofrost creatures to the leveled list with their alternate texures.\r<br />The Behemoth Dragon has two variations, The Thanatos Dragon has three variation\r<br />and there is only a single Apex Werewolf.\r<br />You can find the dragons at level 82 and each has a difference of 10 level betwen them,\r<br />so you can find new dragon up to level 122.\r<br />Then you will be able to meet them all&#33; The werewolf can be find at level 62.\r<br />I recomend you to get random encounter http://skyrim.nexusmods.com/mods/32394/,\r<br />so you can fin the werewolf more often, otherwise it will be hard to find unless\r<br />you have a mod that make werewolf apear in skyrim wild or something,\r<br />cause like you should already know werewolf are hard to find in the vanilla skirim,\r<br />if someone request to i may also make an optionnal download to add them to the wild\r<br />in the forest with the others werewolfs all in the same esp.\r<br />\r<br />Ce que ca fait:\r<br />Rajoute les creatures de Zerofrost au leveled list ainsi que leurs textures alternatives.\r<br />Le Dragon Behemoth a deux variantes, le Dragon Thanatos en a deux et\r<br />il n&#39;y a qu&#39;une seule version du Loup-Garoup Apex.\r<br />Les dragons peuvent être rencontrés dès le niveau 82 et ont chacun une différance\r<br />de 10 niveaux. Ils y en aurra donc un qui ne pourra être rencontré seulement au niveau 122&#33;\r<br />Le loup-garoup quand a lui pourra être rencontré dès le niveau 62.\r<br />Pour ce qui est du loup-garoup je vous suggere un mod comme Random Encounters\r<br />http://skyrim.nexusmods.com/mods/32394/, autrement il vous sera bien difficile\r<br />d&#39;en rencontré étant donné la rareté des loup-garoup dans skyrim,\r<br />si quelqu&#39;un le demand je pourrai aussi uploader un téléchargement optionnel\r<br />dans lequel les loup-garoup ainsi que le loup garoup Apex\r<br />bien entendu pourrai être rencontré dans les forêt de skyrim.\r<br />\r<br />Notes:\r<br />I only posted some random pictures i already had, i didn&#39;t even think it was necessary because\r<br />if you want to see what they look like you can go check that out on the Zerofrost modpage,\r<br />but if you want to post your pictures go ahead. And don&#39;t forget if you like this mo\r<br />to go endorse his original work at Zerofrost modpage.\r<br />http://skyrim.nexusmods.com/users/3140055/?\r<br />\r<br />Notes:\r<br />Je n&#39;ai mis que des images aléatoires que j&#39;avais déja, si vous voulez mettre les votre n&#39;hésitez pas&#33;\r<br />vous pouvez aussi allez endosser les mods original de Zerofrost a leurs adresses d&#39;origine.\r<br />Si vous voulez voir plus d&#39;images, vous pouvez toujours allez voir sur leurs pages d&#39;origine.\r<br />http://skyrim.nexusmods.com/users/3140055/?\r<br />\r<br />Installation:\r<br />Do like other download, use nmm or install manually, should be easy.\r<br />If someone get lost or something is missing, youuan send me a message.\r<br />Ho and before i forget, you may need the official DLC the dragons are placed through\r<br />the two leveled list the standard one and the DLC one.\r<br />You will need a merged patch if you use mod that edit the dragon leveled list,\r<br />to do that use wrye bash, mods like deadly dragons or other that add new dragons variations\r<br />to the leveled list.\r<br />\r<br />Installation:\r<br />Faite comme les autres téléchargement, utilisé nmm ou installez manuellement,\r<br />ca devrait être facile. Si quelqu&#39;un se perd ou que quelque chose manque,\r<br />vous pouvez manvoyer un message. Ho et avant que j&#39;oublie il est possible\r<br />que vous ayez besoin des DLC officiel, les dragon sont non seulement placé dans\r<br />le leveled list de skyrim standard mais aussi dans celui du DLC.\r<br />Si quelqu&#39;un me le confirme en m&#39;anvoyant un message je le rajouterai dans ce message\r<br />comme obligatoire.\r<br />Vous aurez besoin d&#39;un merged patch si vous utilisé d&#39;autres mods qui éditent le leveled list,\r<br />pour ce faire utilisé wrye bash, les mods comme deadly dragons ou tout autres mods qui\r<br />rajoutent de nouveaux dragons qui ne sont pas déja placé sur la cartes.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Permission:\r<br />To use any meshes or textures in this mods you must ask Zerofrost permission first.\r<br />http://skyrim.nexusmods.com/users/3140055/?\r<br />\r<br />Permission:\r<br />Pour utiliser n&#39;importe quel meshes ou textures dans ce mod, vous devez tout sdabord demander\r<br />la permission de Zerofrsot. http://skyrim.nexusmods.com/users/3140055/?\r<br />\r<br />\r<br />\r<br />Credit:\r<br />All credit goes to Zerofrost for the meshes and textures.\r<br />\r<br />The rest goes to me for placing them in the leveled list and giving them custom stats.\r<br />\r<br />\r<br />\r<br />Credit:\r<br />Tous les credits pour les meshes et les textures vont a Zerofrost.\r<br />\r<br />Le reste va a moi pour les avoir inclut dans le leveled list\r<br />avec des stats et des attaque personnalisé.\r<br />\r<br />Peut être des credits a l&#39;équipe de bethesda pour ce jeu qui aurai dû\r<br />s&#39;appeler skyrim bêta a sa sortie mais qu&#39;il, ont tout de même préféré nommer Skyrim,\r<br />(C&#39;étais probablement plus vendeur comme nom, quoi que moins honête.)\r<br />(Je ne joue pas a skyrim pour ses bugs mais pour ses mods qui sont encore plus nombreux heureusement.)",
  "categoryId": "83",
  "version": "1.0",
  "author": "JouinShinKitake",
  "createdUnix": "1384828400",
  "updatedUnix": "1384827605",
  "containsAdultContent": false,
  "uploadedBy": "JouinShinKitake",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000080657",
      "name": "Thanatos and Behemoth Dragons plus Apex Werewolf",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "191916",
      "fileName": "Thanatos and Behemoth Dragons plaus Apex Werewolf-47487-1-0.7z",
      "uploadedUnix": "1384827605",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f5f7905920289cdad4b9dd43e99bf152b94f8c03324f4ecec090d1511b4555c0/analysis/1407799009/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thanatos%20and%20Behemoth%20Dragons%20plaus%20Apex%20Werewolf-47487-1-0.7z?fid=1000080657&ttl=1535827718&ri=8192&rs=8192&setec=902933e9cda7fe330e630b9faf2c2d14"
    }
  ]
}