{
  "modId": 47511.0,
  "modName": "Better Bandits by Iconic",
  "summary": "Upon reaching the higher levels and crafting that enchanted dragonbone armor, the fur-clad bandits of Skyrim can become quite a pushover. Better Bandits aim to fix this by adding more leveled variety to the bandit item sets as well as a few new bandit types just to keep things new. ",
  "descriptionHtml": "[u]\r\n[color=red]\r\n[size=15] Better Bandits [/size]\r\nBy Iconic985\r\n[/color]\r\n[/u] \r\n\r\n[u]\r\n[color=red] \r\n[size=14] Introduction: [/size] \r\n[/color]\r\n[/u] \r\n\r\nBetter Bandits is a mod that aims to improve the leveling and items of the bandits of Skyrim rather like that of Oblivion's. If you have played Oblivion then you will know that as you level up and unlock better weapons and armor, so do the all the other NPC's in the world. Now when you unlock that fancy Dwarven armor so will the bandits meaning that they should still provide a suitable challenge for the player with the weaker level one bandits equipped with simple clothes and iron weapons up to the Bandit Marauders clad in Dwarven armor with mighty elven weapons.  \r\n\r\n[u]\r\n[color=red]\r\n[size=14] Features: [/size]\r\n[/color]\r\n[/u] \r\n\r\nFull list of Features: \r\n- Bandits use scaled armor and weapons, the higher up the bandit the better the weapons and armor. NOTE: bandits will not use \"rare\" armors such as daedric, dragonbone or glass. \r\n- Deserters may now be found in bandit encampments. These leveled NPC's wield armor and weapons appropriate to what army they deserted from (Imperial and Stormcloak)    \r\n- Hostile Dogs can also be found in bandit lairs as well. These animals have a good sense of spell to provide a greater challenge for stealthy characters. \r\n- Bandit wizards now actually wear robes and have a chance of getting a leveled staff as well \r\n- Some bandits may duel-wield a dagger with their primary weapon.\r\n- Some bandits wear hoods instead of helmets. \r\n- Slight changes to the bandit wizard spell list. \r\n- If you have Dawnguard, bandit archers will use steel crossbows at lower levels and Dwarven crossbows at higher ones. \r\n\r\nNOTE: In order to accommodate for the armor changes, some bandits have had their stats either lowered or raised to make sure they aren't TOO much of a challenge yet still may require some careful planning should you intend to take out a bandit stronghold. \r\n\r\n\r\n[u]\r\n[color=red]\r\n[size=14] Install/Uninstall: [/size]\r\n[/color]\r\n[/u] \r\n\r\nJust copy the Better Bandits.esp file and the Dawnguard patch (if you have it) into your Data folder. Just delete the esps if you wish to uninstall. Seeing as this mod uses no custom meshes, textures or scripts the only compatibility issues with this mod are other mods that change bandit item sets.  \r\n\r\n[color=red]\r\n[u]\r\nTHIS MOD DOES NOT REQUIRE SKSE! \r\nTHIS MOD DOES NOT REQUIRE DRAGONBORN! \r\nTHIS MOD DOES NOT REQUIRE HEARTHFIRE! \r\nTHIS MOD ONLY REQUIRES DAWNGUARD IF YOU WISH TO USE THE DAWNGUARD PATCH!\r\nDon't forget to endorse the mod!\r\n[/u]\r\nEnjoy!\r\n[/color]",
  "categoryId": "33",
  "version": "1.0",
  "author": "Iconic985  ",
  "createdUnix": "1384850235",
  "updatedUnix": "1384850235",
  "containsAdultContent": false,
  "uploadedBy": "Iconic985",
  "primaryFile": null,
  "files": []
}