{
  "modId": 47596.0,
  "modName": "Skyforged Skyforge Weapons",
  "summary": "Gives the bland old Skyforge Steel Weapons a more unique look which make them stand out from normal Steel.",
  "descriptionHtml": "=== Also on the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=195241476/]Steam Workshop[/url], for those who prefer!\r\n\r\nTo be honest, I’m afraid that the comparison screenshots doesn’t quite do the weapons justice. As shown on the screenshots with the weapons equipped, the glow effects are MUCH more prominent up close/in first person view.\r\nSorry for this oddity, but I felt like the screenshots had to be taken at the Skyforge, which incidentally is a relatively bright place at night.\r\n\r\n--------------------------------------------------\r\nSummary:\r\n--------------------------------------------------\r\n\r\nSo I was disappointed when I was acquainted with the Skyforge; this supposedly legendary smithy capable of honing steel like none other, just to find that it made steel weapons…\r\nAlbeit, slightly stronger steel weapons, but still just steel weapons.\r\n\r\nThis mod aims to make the weapons stand out, while keeping the lore in place.\r\nThe weapons are still of steel, but now they are imbued with the special properties of the forge, making their ornamentation glow in even the darkest of places.\r\n\r\nScrew lore and logic, you know that it’s awesome!\r\n\r\nPlease report any problems you find, and I’ll see what I can do about it :)\r\n\r\n--------------------------------------------------\r\nExactly what it does:\r\n--------------------------------------------------\r\n\r\n - REPLACES the Skyforge steel weapons with ones whose decoration glows in the dark. The glow-textures I’ve made are very high quality (2048x2048 pixels) and should fit right in, even on high settings.\r\n - DOES NOT alter the stats of any of the existing weapons.\r\n - ADDS the thus far missing Skyforge Steel Mace and Skyforge Steel Warhammer, complete with their own glowing textures to go with the rest of the weapons (if you buy into the fact that they were left out for a reason, then you are more than welcome not to use them. However, they’re in the mod, and they’re there to stay). The new weapons have been given stats in accordance with the vanilla Skyforge Weapons, but cannot be chosen as the free Skyforge Steel Weapons received at the end of the Companion quest ‘Take Up Arms’, as this would be poorly implemented at best, missing the voiced responses from Eorlund that the other wepons have.\r\n- Adds the two new weapons to Eorlund’s inventory, so they can be purchased from him along with the retextured vanilla weapons.\r\n- Makes all the Skyforge steel weapons craftable (including the new mace and warhammer). Because why not?\r\nThe weapons can be crafted at the skyforge after the completion of Companions (warrior’s guild) quest ‘Take Up Arms’, after which the player receives his complementary Skyforge Steel Weapon from Eorlund Grey-Mane.\r\nAs of release, the weapons require the Steel Smithing Perk and they cost the same to make as regular old steel weapons, and while I would love to make them more expensive in some way, I want it to make sense. They don’t use more steel than normal steel weapons, so doubling/tripling the cost would not be ideal.\r\nAll Ideas are welcome.\r\n - FIXES the Skyforge Steel Dagger to be temperable. I think it was intended to be.\r\n\r\n--------------------------------------------------\r\nPlans:\r\n--------------------------------------------------\r\n\r\nAs I see the Skyforge Steel Weapons as more refined versions of the Steel Weapons, made of stronger, cleaner quality material, I would like to make blood-splatters fade from them more rapidly. However, I have been unable to find out how to do this on the internet, so if anyone has an idea of how to change this variable, you are very welcome to contact me (:\r\n\r\n--------------------------------------------------\r\nBugs:\r\n--------------------------------------------------\r\n\r\nI have encountered one: Whether the cause of shoddy game development or entirely on purpose, I know not, but for some reason the glow texture will fail to load within certain interiors (most notably I’ve noticed Jorrvaskr and Dragonsreach , but certainly others as well). The runes on the weapons will still appear as white, but they will not glow the same way they do outside. Fortunately caves, dungeons and the like seems to be unaffected.\r\nI would LOVE to fix this, but I have absolutely no Idea how.\r\nIf ANYONE has a clue and knows how to fix this one, please let me know.\r\n\r\n--------------------------------------------------\r\nCompatibility:\r\n--------------------------------------------------\r\n\r\nThis mod will conflict with any that alters the Skyforge Steel Weapons.\r\n\r\n--------------------------------------------------\r\nFAQ:\r\n--------------------------------------------------\r\n\r\nQ: How?\r\nA: See [url=http://skyrim.nexusmods.com/mods/7069] this tutorial[/url] and [url=http://www.loverslab.com/topic/15629-add-glow-effect-to-weapons-solved/] forum topic[/url] for further help. Retexturing weapons to glow is a very easy [and awesome] thing to do. I was able to make my first glowing weapon within two or three hours, and I’m not really that smart. Give it a go!\r\n\r\nQ: Bow and arrows?\r\nA: I was actually surprised to find out that there is no steel bow. For that reason, neither bow nor arrow will be made in the future.\r\n\r\nQ: Armor?\r\nA: As of now, I have no intention of making Skyforge Armor; simply because it, for some reason, is not in the game. I never say never, but I don’t see it coming in the future.\r\n\r\nQ: Non-replacer version?\r\nA: the only imaginable case in which that would be needed, would be if one’s Skyforge weapons have already been altered by another mod. I’ll succumb to the people, if that indeed turns out to be their wish.\r\nIf I get enough requests for a non-replacer, I’ll make one…\r\n\r\nQ: I have found a place in one of the textures that looks weird/out of place. What do I do?\r\nA: Throw me a comment wherever, and I will try to keep up to date and fix whatever problems might come up texture-wise.\r\n\r\n--------------------------------------------------\r\nPermissions:\r\n--------------------------------------------------\r\n\r\nPlease do contact me if you have any wish to involve my work in another project. Then we’ll have a chat and see what we can do ;)\r\n\r\nThank you :)",
  "categoryId": "55",
  "version": "1.0",
  "author": "Graesholt",
  "createdUnix": "1384948276",
  "updatedUnix": "1384947596",
  "containsAdultContent": false,
  "uploadedBy": "graesholt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000081062",
      "name": "Skyforged Skyforge Weapons",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29722",
      "fileName": "Skyforged Skyforge Weapons-47596-1-0.rar",
      "uploadedUnix": "1384947596",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c61ca09103d0f990adc8e7930e3edbf6f28d6b5e0f020c5c161b89a855cb6f08/analysis/1407800654/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyforged%20Skyforge%20Weapons-47596-1-0.rar?fid=1000081062&ttl=1535827824&ri=8192&rs=8192&setec=7d538007dd56d28467d9feb6dfd5f14b"
    }
  ]
}