{
  "modId": 47643.0,
  "modName": "Greek Bronze Age",
  "summary": "",
  "descriptionHtml": "The Skyrim Mythology Mod\r\n\r\nThis mod intends to create the worldspace of Greece during the mythological time period of the Trojan War. In order to do this, certain items and actors, etc.. must be integrated into the gamespace. The changes below, are key, and more minor changes may be added at a later date. \r\n\r\nRaces - The mod intends to include several playable race types, and some unplayable, such as Centaurs, Cyclops, and  Demi-Gods, Demi-Gods abilities, and stats will vary according to which god they are related to. \r\nCreatures - Minotaur, nymphs, satyrs, and many other creatures are intended to be implemented into the game. Some may be integrated into player quests, or simply huntable characters, or friendly NPC’s.\r\nTowns - Major Greek states such as Troy, Sparta, and Athens are to be implemented as new towns in which players can fast travel, rest, and restore their supplies inside. \r\nLandscape -  The Vanilla landscape of Skyrim will be altered to resemble Ancient Greece at the ‘mythical’ date of the Trojan War. With key cities, and notable areas mentioned in Greek mythology.\r\nWeapons - The ancient Achaean weapons will be integrated as craftable, and realistic statistically and visually. \r\nArmour - Ancient Achaean armour will also become available as craftable, price correct, and visually and statistically appealing. \r\nQuests - Famous Quests undertaken by notable characters from Greek Mythology will become available for you to complete yourself. Be it for gold, favour, fame, or other reasons.\r\nFood - Common foods around the date of the Ancient ‘mythic’ Trojan War will also become available, with correct pricing, and in some cases realistic bonuses and ingredients. \r\nLoading Screens - For visual appeal, vanilla loading screens will be replaced with extracts of Homer, and new in-game models. \r\nItems - Notable mythological items, and historically accurate real items will be integrated in the gamespace also, be it the Golden Fleece, or a piece of bronze ore. \r\n",
  "categoryId": "79",
  "version": "0.1",
  "author": "VortexModTeam",
  "createdUnix": "1385005178",
  "updatedUnix": "1385005178",
  "containsAdultContent": false,
  "uploadedBy": "NZVortex",
  "primaryFile": null,
  "files": []
}