{
  "modId": 47672.0,
  "modName": "Rapids Overlook - Player Home",
  "summary": "Rapids Overlook is a fully functional playerhome just SE of The Honningbrew Meadery near Whiterun.",
  "descriptionHtml": "Note for v1.6 Update: In NMM, remove 1.5 and replace with 1.6 to use with the same save. No containers were altered, so you do not need to pick up everything for this update. (Phew&#33; Am I right?)\r<br />* If you performed a manual install, easiest thing to do would be to just overwrite the existing files with the new ones.\r<br />\r<br />Note for v1.8 Update (from any version): As with v1.6, no containers have altered, so you do not have to empty anything to update to this rev. However, the 3 troughs on the Crafting Deck (that hold Dynamo Cores in the video) have been slightly increased in size to reduce the chance of random item displacement. You may wish to pick those items up before upgrading to v1.8.\r<br />---------------------------------------------------\r<br />Hello All&#33;\r<br />\r<br />I have done extensive modding for Fallout, but this is my first for Elder Scrolls.\r<br />I hope you enjoy it. I know I will :)\r<br />\r<br />Rapids Overlook is a fully functional playerhome just SE of The Honningbrew Meadery near Whiterun.\r<br />\r<br />My goals with this house were such:\r<br />-----------------------------------\r<br />1/ As interactive & amenity heavy as possible without it looking cluttered.\r<br />2/ An overall small footprint, both inside & out as I&#39;m not a fan of cavernous homes.\r<br />3/ Location picked for early game access, preferably in an aesthetically pleasing riverside locale.\r<br />4/ An outdoor crafting deck overlooking said river&#33;\r<br />5/ A fully functional Teleporter.\r<br />\r<br />Pretty much the only things I didnt include:\r<br />--------------------------------------------\r<br />   * A Flour Grinder\r<br />   * A Fish Hatchery (as this realistically needs an ocean)\r<br />   * Inventory Auto-Sorting (Besides the fact that that is a daunting addition, I&#39;ve yet to run across a Skyrim auto-sorter that worked properly as compared with the one I used in Fallout. Makes me thinks it&#39;s a Gamebryo Skyrim Edition problem.)\r<br />\r<br />List of Amenities\r<br />-----------------\r<br />/ Exterior crafting deck overlooking the spillway rapids against the mountainside.\r<br />   * Dragon perches on the Crafting Deck roof and Main House.\r<br />   * All Blacksmithing/Armoring stations (including a Dawnguard Forge).\r<br />   * 2x Triple Soil Planters + 7x Individual Soil Planters around the Decking.\r<br />   * 1x Shield/Weapon Combo Rack in the Blacksmith bunkhouse.\r<br />   * 1x Weapon Rack in the Blacksmith Bunkhouse.\r<br />   * 1x Triple Soil Planter in the Blacksmith Bunkhouse.\r<br />   * Firewood Chopping Block with nearby Single Weapon Rack (I like to place an axe there).\r<br />   * Unique Blacksmith Merchant (tagged as General Merchant) who additionally sells unenchanted Nightingale Armor & Bows (restocks).\r<br />   * 2x Triple-Shelved fully interactive Shelves.\r<br />   * 1x Interactive Mannequin on the Crafting Deck.\r<br />   * Apiary in the back.\r<br />   * Several named safes near the Smelter for ease of sorting.\r<br />   * Insect Spawner near Chopping Block.\r<br />   * All containers do not respawn and are tagged against NPC&#39;s digging into them.\r<br />\r<br />/ Main house interior includes the standard amenities. Well, my standard anyway :)\r<br />   * 6x Single Soil Planters around the house.\r<br />   * 4x Hanging Harvestable Racks around the house (respawns).\r<br />   * Oven in the Kitchen.\r<br />   * 1x Dual-Shelved fully interactive Shelf in the Kitchen.\r<br />   * 2x Toggleable Ember Fires in the Kitchen.\r<br />   * 12x 5unit Weapon Racks in the armory.\r<br />   * 10x Shield Racks in the Armory.\r<br />   * 2x Interactive Bow Display Cases in the Armory.\r<br />   * 5x Interactive Dagger Display Cases in the Armory.\r<br />   * 3x Single Weapon Racks in the Follower/Children&#39;s Quarters.\r<br />   * 1x Shield/Weapon Combo Rack in the Follower/Children&#39;s Quarters.\r<br />   * 8x Interactive Mannequins in the main room.\r<br />   * 4x Single Weapon Racks in the main room.\r<br />   * 1x Interactive Mannequin in the Master Bedroom.\r<br />   * 2x Interactive Dagger Displays in the Master Bedroom.\r<br />   * 2x Triple-Shelved fully interactive Shelves in the Master Bedroom.\r<br />   * Alchemy & Enchanting Tables in the Lab.\r<br />   * 1x Triple Soil Planter in the Lab.\r<br />   * 2x Dual-Shelved fully interactive Shelves in the Lab.\r<br />   * Insect Spawner in the Lab.\r<br />   * Fully featured Bard. Her songs list updates as you complete the associated quests.\r<br />   * Food/Drink Vendor who additionally sells the Tavern Wench & Barkeeper Clothing (restocks).\r<br />   * A plethora of named containers around the various rooms, as well as several generic containers.\r<br />   * All containers do not respawn and are tagged against NPC&#39;s digging into them.\r<br />   * All pick-upable items in the house are tagged not to respawn so that it is safe to decorate.\r<br />\r<br />/ The Basement is a small area, but with some nice features.\r<br />   * All standard Shrines, plus Nocturnal.\r<br />   * All Doomstones.\r<br />   * Toggleable Dwemer lighting powered by the outside Waterwheel.\r<br />   * A Unique spellbook that gifts you a teleportation spell.\r<br />\r<br />/ Recently added (in 1.80) a mountainside Gazebo above the house.\r<br />   * 2x 4shelf Bookshelves\r<br />   * 2x Mannequins\r<br />   * 3x 1unit Weapon Racks\r<br />   * 2x Triple Soil Planters\r<br />   * En route to the Gazebo is a small mine with a few veins.\r<br />\r<br />Details on the Teleportation Spell\r<br />----------------------------------\r<br />   * Uses Alteration: Base Level\r<br />   * Includes 3 presets: Foyer of the house. Whiterun Market. College of Winterhold (courtyard).\r<br />   * Includes 2 Mark & Recall sets for specifying custom locations. \r<br />   * Can be used inside a dungeon while encumbered (kinda the point :))\r<br />   * This one gates your follower with you. They will not have to come running from the nearest zone-in point.\r<br />   * Cannot be used in-combat (it&#39;s only fair).\r<br />\r<br />Notes: \r<br />------\r<br />   * Overall, there are 26 Interactive Shelves, 31 Soils, 12 Mannequins, 12 Shield capable Racks, 72 Weapon Racks, 2 Interactive Bow Display Boxes & 7 Interactive Dagger Display Boxes.\r<br />   * My Weapon Racks do not suffer from that non-interactivity bug that comes when you place two racks too close together vertically.\r<br />   * I went ahead and included the unencrypted PSC scripts in case a potential modder wants to look up my skirt in lieu of reinventing the wheel. Every single thing I made starts with an &#34;RO1&#34;.\r<br />   * The mannequins will wander. Nothing to do about that except apply the mannequin fix and rezone if a mannequin has wandered too far.\r<br />   * The Dual Shelved Bookshelves that are also containers are a custom work of mine. They will require taking a few more steps back than normal to get access to the shelf menu.\r<br />   * Skyrim does not appear to have been made for toggleable lights. It is possible to &#34;double-click&#34; the light switches fast enough so that the switch graphic moves into an On position while the actual light turns on and then back off again. I recommend single clicking the lights to let them toggle normally.\r<br />\r<br />Recommended Mods I Use: \r<br />-----------------------\r<br />   * Unlimited Bookshelves: http://skyrim.nexusmods.com/mods/10891/?\r<br />   * Wandering Mannequin Fix: http://skyrim.nexusmods.com/mods/10652/?\r<br />   * Female Mannequins: http://skyrim.nexusmods.com/mods/28850/?\r<br />   * CBBE (NSFW): http://skyrim.nexusmods.com/mods/2666/?\r<br />   * BBP(NSFW): http://skyrim.nexusmods.com/mods/4888/?\r<br />   * Apachii SkyHair: http://skyrim.nexusmods.com/mods/10168/?\r<br />   * Spouses Can Live Anywhere: http://skyrim.nexusmods.com/mods/11370\r<br />   * Immersive Skyrim Thunder: http://skyrim.nexusmods.com/mods/1702/?\r<br />   * Lightning During Thunderstorms: http://skyrim.nexusmods.com/mods/15506/?\r<br />\r<br />Requirements:\r<br />-------------\r<br />   * Skyrim\r<br />   * Update.esm (I believe this one comes down from Steam automatically)\r<br />   * Dawnguard\r<br />   * Hearthfire\r<br />   * (Dragonborn is not required&#33;)\r<br />   * I do have SKSE landed, but I dont believe it&#39;s required for this mod as I moved the exe out of the directory and all my scripts worked without it. But just in case, thought I&#39;d mention. Especially since it&#39;s an easy install anyway ( http://skse.silverlock.org/ ).\r<br />\r<br />Accreditations:\r<br />---------------\r<br />/ Bethesda (of course&#33;)\r<br />/ DarkFox127 ( http://darkfox127productions.weebly.com/downloads.html ) - For his many spectacularly useful YouTube Tutorials, several of which I used to help me create this mod in only two weeks.\r<br />/ IsharaMeradin - For some 11th hour scripting assistance.",
  "categoryId": "67",
  "version": "1.8",
  "author": "Lord Xayd",
  "createdUnix": "1385055021",
  "updatedUnix": "1386979833",
  "containsAdultContent": false,
  "uploadedBy": "LordXayd",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000081430",
      "name": "Rapids Overlook v1-5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "277",
      "fileName": "Rapids Overlook-47672-1-5.7z",
      "uploadedUnix": "1385054556",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/328f6d9c9216f4becd5096671317a88809de91f36b9e69795ba7a661b3ec0b4c/analysis/1407801943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rapids%20Overlook-47672-1-5.7z?fid=1000081430&ttl=1535827890&ri=8192&rs=8192&setec=69c89758697dfbf1859d140c1291c832"
    },
    {
      "fileId": "1000083084",
      "name": "Rapids Overlook v1-6",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "600",
      "fileName": "Rapids Overlook-47672-1-6.7z",
      "uploadedUnix": "1385414649",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/7c956bea281b13164588302fc6e4393aa8f5189f04880d1e75bf765d66538ed9/analysis/1407808394/",
      "changelogHtml": " / Fixed Owned bed in Master Bedroom disallowing sleep.\r<br />/ Run the mod through the TES5edit cleaner.\r<br />/ Ran the FaceGen fix for all 3 NPCs.\r<br />* Some users were experiencing blacked out faces.\r<br />/ Removed the shadowing from the main room campfire.\r<br />* Conflicts from other light sources were pixelating shadows.\r<br />* This can be reduced with shadow optimization, but it was pretty pronounced in the center room.\r<br />/ Fixed Innkeeper Vendor issue that was preventing clothing sale.\r<br />/ Fixed Blacksmith Vendor issue that was preventing Nightingale armor sale.\r<br />/ Replaced several food/drink items tagged as \"Steal\" with unclaimed versions.\r<br />/ Remeshed NPC patrol path in front of the house to resolve any potential pathing issues. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rapids%20Overlook-47672-1-6.7z?fid=1000083084&ttl=1535827890&ri=8192&rs=8192&setec=2f4b78037094aab424f1d6d566ba662b"
    },
    {
      "fileId": "1000086655",
      "name": "Rapids Overlook v1-8",
      "version": "1.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "616",
      "fileName": "Rapids Overlook v1-8-47672-1-8.7z",
      "uploadedUnix": "1386979833",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/24caa1b0ccd881453a5f5e936b7170af02e8528a5d4d6f2747e2e2144de7ca7b/analysis/1407835744/",
      "changelogHtml": " / Added a 3 soil planter on the Crafting Deck (at stairs of bunkhouse).\r<br />/ Rotated Crafting Deck chest (on safes) so that it opens the right way.\r<br />/ Added Nightingale Sword to Blacksmith merchant (enchantable, repurchasable).\r<br />/ Increased Crafting Deck trough size to reduce chance of placed item displacement.\r<br />/ Fixed Innkeeper gold replenishment.\r<br />/ Added Mine Shaft with several ore veins.\r<br />/ Added Mountainside Balcony (with mapmarker) (accessible initially via Mine Shaft).\r<br />   * Several ammenities included (mannequins, bookshelves, weapon racks, planter soils). <br/> \n Forgot to mention a few fixes:\r<br />/ Fixed navmesh at the stairs leading to the house (to help with NPCs becoming stuck).\r<br />/ Resolved a clipping issue inside the house in the main room. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rapids%20Overlook%20v1-8-47672-1-8.7z?fid=1000086655&ttl=1535827891&ri=8192&rs=8192&setec=839bb02daa0e7a6617811626a606e203"
    }
  ]
}