{
  "modId": 47699.0,
  "modName": "Skeleton BBP-Two Handed Sword On Hip",
  "summary": "This mod will allow players to equip two handed weapon on hip.",
  "descriptionHtml": "i always wanted my character to be able to have two handed sword wielded on hip, since i thought two handed swords were two long to be wielded on back. so i did something about it, and able to modify the BBP skeleton-female i had to have a two handed sword on hip wielding. But then another problem came up, the animation was still using two handed sword on back, so i did-again something about it. i used the immersive animation behavior file (1hm_locomotion.hkx) to make the one handed animation (both equip and unequip) be applied to two handed sword on hip wielding. i also renamed the one handed sword equip and unequip animations file to have the same name with two handed sword equip and unequip animations, and removed the original ones. and then it went ok... but then another thing came up..other NPC and followers have their two handed sword on hip also. so did-again-something about it.. i used the Custom Races mod to make my character special and it went OK. Another problem came up again...i couldn't modify my character face properly in the racemenu.. so i used the Chargen Extension Mod for Custom Races.. and it went OK...and then another problem came up.... and then another....and then another...\r\n\r\nThis mod will allow players to equip two handed weapon on hip. the skeleton i use is not my work, credit entirely goes to XP32 for the maximum skeleton and Skulltyrant for Custom Skeleton Replacers. Both of them make my character able to have BBP and ATTT mod compatible. And also thanks to Bootaka for the XP32 katana style, (i use Bootaka's WeaponSword branch for the one handed sword). thanks to Immersive animation Mod by bergzore, Chargen Extension Mod by Expired, and Custom Races Mod by d_rail.\r\n\r\nThanks to the below author and their mods that make my mod possible:\r\n\r\nimmersive animation\thttp://skyrim.nexusmods.com/mods/34950//?\tbergzore\r\nCustom Skeleton Replacers\thttp://skyrim.nexusmods.com/mods/16712//?\tskulltyrant\r\nXP32 Maximum Skeleton Katana Style\thttp://skyrim.nexusmods.com/mods/30760//?\tXP32 edit by Bootaka\r\nCustom Races\thttp://skyrim.nexusmods.com/mods/8720//?\td_rail\r\nCharGen Extension\thttp://skyrim.nexusmods.com/mods/36925//?\tExpired\r\n\r\nmod i use in my screenshots:\r\nCBBE Body BBP\r\nReal Vision ENB\r\nHattori Hanzo Katana \r\nSmart Cast\r\nFR Girls Follower\r\nand UFO\r\n\r\n",
  "categoryId": "84",
  "version": "1",
  "author": "mayhem007x",
  "createdUnix": "1385092148",
  "updatedUnix": "1385092122",
  "containsAdultContent": false,
  "uploadedBy": "mayhem007x",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000081608",
      "name": "2HonHipSkeleton_femaleBBP",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "2HonHipSkeleton_femaleBBP-47699-1.7z",
      "uploadedUnix": "1385092122",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/fbc4825cddbc17b7a144c0042b326d72ed69ef72280f00af00dedd32a9d102e2/analysis/1407802689/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/2HonHipSkeleton_femaleBBP-47699-1.7z?fid=1000081608&ttl=1535827911&ri=8192&rs=8192&setec=4bf2c5dce3b26e535cbc70b48db829c7"
    }
  ]
}