{
  "modId": 47701.0,
  "modName": "The Emerald Palace by M7",
  "summary": "The Emerald Palace ~ A New Player Home in Solstheim\r\n\r\nby: Iapana7-M7.\r\n\r\nREQUIRES: DRAGONBORN DLC, UPDATES, SKYRIM Games.\r\n\r\nversion 1.2\r\nM7-11.15.2013",
  "descriptionHtml": "The Emerald Palace ~ A New Player Home in Solstheim\r\n\r\nby: Iapana7-M7.\r\n\r\nREQUIRES: DRAGONBORN DLC, UPDATES, SKYRIM Games.\r\n\r\nversion 1.0\r\nM7-11.15.2013\r\n\r\nStory: Your distant relative, a Prince of Emerald Isle, was recently killed by a malevolent Dragon. He mentioned You in his Last Will as his heir. You can fast-travel to the Emerald Isle as it is on the coast near Raven Rock, Solstheim. Look for a Mysterious Chest near the entrance.\r\n\r\n\r\nFeatures: \r\n\r\nLevel 1:\r\n\r\nEmerald Isle has 3 levels.  The first level [after entrance with the fake Dragon waterfall] begins in the well-guarded Main Hall. There is a Library (with Fence Vendor), Royal Forge (with Blacksmith vendor, forge, grinding stone, workbench, chopping block, staff maker), Ammunition Storage Room/Archery Range, Hidden Rooms, Barracks with Guards & beds/forge, Great Hall (Pantry, Kitchen, Dining, Throne; alchemy, cooking,) Petting Zoo (please do not feed the animals), Hidden Wine cellar, Printer & Tailor shop (Vendor), Chapel with Priest (vendor).\r\n\r\nLevel 2: \r\n\r\nThe second level features: 2nd Floor Main Hall, A Living room with Enchant Station, Boiler Engine room, Green House with plants and Grain Mill, Bakery, Museum of Fine Art, Storage Room, 3 Guest Rooms, Royal Mausoleum (with hidden vault), Teleport Stations to Emerald Palace. Master Suite with private Bathroom with Shower/toilet.  \r\n\r\nLevel 0: (Subterranean) Includes a hot tub, cold swimming pool, (Steam room) Sauna, tower, waterfall, crystals, tents with bedrolls, statuary, cave.  \r\n\r\nThe Emerald Palace is accessible by Teleport Stations.  It is for the most part a Night Club.  NPCs included.\r\nPlus it has beverages for sale and a vendor.\r\n\r\nThis Mod took 1.3 weeks to complete; please Rate.\r\n\r\nIssues:\r\n\r\nThe Mannequins (being listed as living actors in the CK) will occasionally move off platforms, but will stay put with clothing on them, click the base of the mannequin to activate. On loading the CK the usual error warnings occur, mostly to do with Navmeshing or Quest information missing. So do all quests before playing this Mod for safety.  Back up your saves when updating.  The Weapons racks, player book cases, Mannequins, etc. are copied from Solitude's Proudspire Manor. When I added an auto-load door to the teleport stations I had this caption follow me around after exiting; so to cure this I deleted the auto-load door and substituted a Lift door; that's the rooms with the blue column of light. All chests or cupboards that are Marked \"Safe player Chest\" are non-respawn, meaning, things will not disappear when placed there.  I took off the aggro distance, behavior and walking distance from the animals in the Petting Zoo to make them docile and not violent. Scripts are added for playability and for information purposes. Constructible items are in Cooking, Vending machines (Wine Cask, Coffee Maker; Drinks, Etc.), and Tailoring/Book Publishing. Other containers respawn (supplies, treasure, Museum salary, etc.). \r\n\r\nM7.",
  "categoryId": "67",
  "version": "1.2",
  "author": "Morsepone7",
  "createdUnix": "1385095451",
  "updatedUnix": "1385095325",
  "containsAdultContent": false,
  "uploadedBy": "morsepone7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000081617",
      "name": "The Emerald Palace",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "418",
      "fileName": "The Emerald Palace-47701-1-2.rar",
      "uploadedUnix": "1385095325",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d0955bf16fc0a63cb23cf3954d8d89fc74d0497c7daf1fb594cfa764ef7f5662/analysis/1407802814/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Emerald%20Palace-47701-1-2.rar?fid=1000081617&ttl=1535827913&ri=8192&rs=8192&setec=dbaa6b5ad3d224eaff9cbca92435c35e"
    }
  ]
}