{
  "modId": 47775.0,
  "modName": "Mostly lore friendly Dunmer eye colors - DELETED - DELETED",
  "summary": "I just wanted to add on some new dunmer eye colors without adding any too outlandish colors",
  "descriptionHtml": "The dunmer only came with three eye color choices. Yeah they tried to pad it out with blindness, partial blindness and demon eyes but still. Humans get 22 choices total and all the other races seem somewhat shafted. elves especially. So I wanted to add additional choices.\r\n\r\nThis was kinda really hard since dunmers only really have red eyes. I tried to vary it the most I could and added a few colors that are borderline if not impossible for dunmer. The two purples I did I think are fine. They are still towards the red spectrum enough that I think its okay if dubious. The orange ones maybe not so much but they are cool.\r\n\r\nThese aren't replacers so only the player can use them. Also I'm still relatively new to modding. It should work but if anything goes wrong or it doesn't please tell me or otherwise I'm never gonna know since it works for me.\r\n\r\nJust drop the texture folder and dunmereyecolor.esp into the data folder and it should sort itself all out. with any luck anyways.",
  "categoryId": "26",
  "version": "1.0",
  "author": "KidneyFail",
  "createdUnix": "1385169328",
  "updatedUnix": "1385169319",
  "containsAdultContent": false,
  "uploadedBy": "KidneyFail",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000081932",
      "name": "Dunmer eye colors",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1688",
      "fileName": "Dunmer eye colors-47775-1-0.zip",
      "uploadedUnix": "1385169319",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/14d494450777e9ce3aca7650535eb710057247f7bac77f549d0d7ee853c84d2c/analysis/1407803907/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dunmer%20eye%20colors-47775-1-0.zip?fid=1000081932&ttl=1535827972&ri=8192&rs=8192&setec=34f64c809a52e7bcdd460b39ad1a1494"
    }
  ]
}