{
  "modId": 47857.0,
  "modName": "Grinding Cheat",
  "summary": "Magically(console) increase your skills",
  "descriptionHtml": "I hate low level grinding. Its tedious to find crabs and wolves to kill. Tried to find a mod that will allow you start at higher then 1.. No luck. This cheat utilise the console command [i]AdvancePCSkill[/i]\r\n\r\nThese 4 text files should go into your data folder. Then, ingame, open your console and type\r\n\r\n[b]bat mage[/b]\r\n-this increase all your magic skills (all 5 schools).. if you do this at level 1.. each will level to around lvl 25-30 in 1 skill. this is with 0 starting skill. Prolly will go higher if you already have some skills. Tested on Breton, so Orcs prolly will gain less conjuration skills - but then, why play an orc mage, Go away you brute!\r\n\r\n[b]bat warrior[/b]\r\n- this increase your melee skills (heavy, 1h, 2h, block).. same as before.. around 25-30, prolly higher on your guys.. ive tested on a breton, who have 0 melee skills... breton is awesome!\r\n\r\n[b]bat rogue[/b]\r\n- markman, stealth, lockpick, pickpocket,lightarmor.guineapig a breton, so your thieving bosmer prolly get higher then 25-30 assuming he starts at 0, which most likely you wont.\r\n\r\n[b]bat noncombat[/b]\r\n- speech, alchemy, smithing, enchanting. boring craps.\r\n\r\nIdeally, you'll only need 2 calls, 1 from either mage/warr/rogue and 1 noncombat.. At level 1.. running 2 bat files always ends up around level 10, 7 if you ignore the noncombat. if you run all 4 bat files once, you'll be around lvl 13-14 range. but nothing stops you from repeating them, each will gives you less skill levels tho.\r\n\r\nWord of advice, this only gives you skills and levels and perk points accordingly.. you'll be undergeared once the world resets to your new level. So mage, good luck getting those advance spells.\r\n\r\nIts console command only. Compatible with everything before you ask. No, no NMM installer, I dont use it.Dont bother asking.",
  "categoryId": "40",
  "version": "1.0",
  "author": "Deane",
  "createdUnix": "1385218027",
  "updatedUnix": "1385217936",
  "containsAdultContent": false,
  "uploadedBy": "deane9850",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000082134",
      "name": "Grinding",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Grinding-47857-1-0.rar",
      "uploadedUnix": "1385217936",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5aa6df82bf9a8689da84b12e6d57728f9e3200486a081c5b8b15cfefcc2121aa/analysis/1407804631/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grinding-47857-1-0.rar?fid=1000082134&ttl=1535828044&ri=8192&rs=8192&setec=0fc574154bbdd664db02df3a2ad6e7b8"
    }
  ]
}