{
  "modId": 47875.0,
  "modName": "Bound Atronach and Bound in Blood",
  "summary": "Adds a total of 32 new bound weapons plus shields in 4 groups. All of the weapons have custom enchant shaders (based upon my Enchantments Upgraded mod). Otehrwise, they work exactly the same as a normal bound weapon.",
  "descriptionHtml": "Adds a total of 32 new bound weapons plus shields in 4 groups. All of the weapons have custom enchant shaders (based upon my Enchantments Upgraded mod). Otherwise, they work exactly the same as a normal bound weapon. \r\n\r\nThe weapon and shield spells only equip in the right hand due to the mechanics of the spell but will summon both the weapon and the shield from one cast. Both items dispel if you sheath your weapon though this does leave your left hand empty (sorry but I'm working to fix this).\r\n\r\nThe 3 types of Bound Atronach spells are Destruction Spells and the Blood spells are Restoration spells. \r\n\r\nFor each group, this mod adds:\r\n\r\nBound Dagger\r\nBound Sword\r\nBound Mace\r\nBound War Axe\r\nBound Greatsword\r\nBound Warhammer\r\nBound Great Axe\r\nBound Bow\r\nBound Sword & Shield\r\nBound Mace & Shield\r\nBound War Axe & Shield\r\n\r\nAll weapons have 4 power levels that range from iron weapons (equivalent to vanilla bound weapons) through to roughly the same physical damage as a legendary smithed dragonbone weapon. The weapons level based on whether (or not) you have the Mystic Binding perk and your level in the appropriate skill (Destruction for the Atronach weapons and Restoration for the Blood weapons) - reaching level 60 in the appropriate skill gives the enhanced weapon. \r\n\r\n\r\nThe new groups are:\r\n\r\nFire Atronach Binding - grants bound fire-based weapons that do fire damage and have a chance to cause the target to generate a fiery explosion when killed. These weapons also provide resistance to fire based on the level of the weapon (from 10% for a basic one-handed weapon to 100% for top level weapon and shield). You are (deliberately) not immune to the explosion yourself so be careful!\r\n\r\nFrost Atronach Binding - grants bound frost-based weapons that do frost damage, slow the target and have a chance to freeze them solid. These weapons also provide resistance to frost based on the level of the weapon (from 10% for a basic one-handed weapon to 100% for top level weapon and shield).\r\n\r\nStorm Atronach Binding - grants bound shock-based weapons that do shock damage and have a chance to disintegrate the target. These weapons also provide resistance to shock based on the level of the weapon (from 10% for a basic one-handed weapon to 100% for top level weapon and shield).\r\n\r\nBlood Bound - grants blood / bone themed weapons that absorb health from the target, have a chance to cause fear and will reanimate dead bodies to fight for you if you hit a corpse with them. These weapons are intended for vampires and if you cast the spell when you are not a vampire, they will damage your health and stamina for as long as you hold the weapons.\r\n\r\n\r\n\r\nYou cannot purchase these spells as normal. To get the spells, you need to visit the cellar of Anise's cabin (along the river to the West of Riverrun). On the table near the enchanter, you will find a book that grants the 3 Atronach dagger spells (and levels your Desctruction). All of the rest of the spell book are forged at the Skyforge. The forging recipies are only visible once you know the dagger spells and will disappear once you have read each tome.\r\n\r\nThe Novice Tome grants all of the appropriate one-handed spells, Apprentice gives the two-handed weapons, Shielded should be obvious and Adept gives the Bows.\r\n\r\nEach set of tomes is only available once you reach the appropriate skill level:\r\n\r\nNovice are available as soon as you learn the dagger spells\r\nApprentice are available once your skill reachs 20\r\nAdept are available once you reach 45",
  "categoryId": "75",
  "version": "v1.1",
  "author": "Warden01",
  "createdUnix": "1385232276",
  "updatedUnix": "1385245747",
  "containsAdultContent": false,
  "uploadedBy": "warden01",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000082220",
      "name": "Bound Atronach V1",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "71856",
      "fileName": "Bound Atronach V1-47875-v1-0.rar",
      "uploadedUnix": "1385232257",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/872ea16a122860a6380374207e45b1ee91a1f2a1c075289ff827da5e8f01ad3e/analysis/1407805287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bound%20Atronach%20V1-47875-v1-0.rar?fid=1000082220&ttl=1535828057&ri=8192&rs=8192&setec=9fb657b680da2219d0c6bff78d481568"
    },
    {
      "fileId": "1000082318",
      "name": "Bound Atronach and Bound in Blood V1",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20155",
      "fileName": "Bound Atronach and Bound in Blood V1-47875-v1-1.rar",
      "uploadedUnix": "1385245747",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0e9c4555b0acee76e8dbd211a79343456078d1ece8c6cf8ababc9cf23bf43889/analysis/1407805641/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bound%20Atronach%20and%20Bound%20in%20Blood%20V1-47875-v1-1.rar?fid=1000082318&ttl=1535828057&ri=8192&rs=8192&setec=894b1eb9f7fb2db3b62a28976397bb40"
    }
  ]
}