{
  "modId": 4787.0,
  "modName": "A How to Guide - Changing in-game music",
  "summary": "This tutorial will explain the nooks and crannies of changing your in-game music in Skyrim. I recommend following all instructions in this guide, unless you have done this before. In that case you\\'ll probably find this obsolete. Keep in mind too that there may be many different methods of doing this. This is the working (once again, WORKING) metho",
  "descriptionHtml": "Welcome friend. This short tutorial will, as the description stated, explain how to change your in-game music to fit your pallette. Don\\'t worry. This will be a free and non-stressful (well, I hope XD) process for you. Continue further if you want to learn more.\r\n\r\n---The Works---\r\n\r\nOkay, the first thing to note is that you will need to select your music. This is the single, most important step of all. Now, I\\'m not one to criticize, but my recommendation is to select (a) piece(s) that will go well in a fantasy game like Skyrim. To me, Lil\\' Wayne\\'s...umm...WONDERFUL lyrics playing while I kill Alduin do not provide immersion for me. If you do find that your music does not fit, you can always uninstall your file (I will detail this in the UNINSTALLATION section).\r\n\r\nNow, to actually download some music, you will need any type of music converter / downloader / library. iTunes is excellent if you already have your track on hand for immediate conversion (fancy words, eh ;]), or if you need the song (provided you can find it on YouTube), you\\'ll need some software. I personally use RealPlayer at http://www.real.com/realplayer/search because it is completely free and very easy to use. You can now download any song off of YouTube (and yes, it is legal, as long as you do not distribute the song). When you finish your download by clicking the upper right hand button above the video that appropriately says \\\"RealPlayer download this video\\\" or something along those lines, you can then click \\\"convert\\\" to begin the proces of turning this .flv video into a perfect MP3 audio copy. You will be taken to another box that will start your conversion. Various options at the bottom of this box dictate the audio\\'s quality, kb per sec, device to use...a whole plethora of options. You\\'ll want to navigate your way to devices. Now, I personally have an iPhone, but just about every smartphone is listed. Before you start saying that you do not own a smartphone, YOU DO NOT NEED A PHONE TO DO THIS! This is just a method to make the file MP3. Check any device, and select it to be audio only, not a video. Next, select MP3 instead of the default MP4 AAC. I have no idea what other devices use in terms of MP3 files, but to be on the safe side, I\\'d use an iPhone 4 setting, for I know that this is a way to make the file MP3. Now that you video is converted, you can find the now audio file in your RealPlayer library. For easy access, drag the video to your desktop.\r\n\r\nOkay, so you now have your file. You cannot however simply place this file into Skyrim. See, Bethesda does not want pirates (arr!) getting their dirty hands on a masterpiece like this and putting it for free in the \\'Bay. Those that try will usually find themselves knee-deep, if you catch my drift. This is simply because skyrim uses music files in an .xwm format, and not MP3. I know you are probably wondering why I told you to ensure that the file is in MP3 format in the first place. This is where the next step comes in. IlanF has created a beautiful and user friendly program for converting those pesky MP3 files into .xwm format. Here is the link: http://www.skyrimnexus.com/downloads/file.php?id=4494\r\n\r\nTo use Ilan\\'s program though, you will need some files found here:\r\n\r\nhttp://www.4shared.com/file/tb_Yajfq/ffmpeg.html\r\n\r\n...and here:\r\n\r\nhttp://www.microsoft.com/download/en/confirmation.aspx?id=6812\r\n\r\nPut the files called xWMAencode and ffmpeg in the same folder as the xwm converter and you should be good to go. more info can be found on Ilan\\'s page.\r\n\r\nNow, open the converter and move the MP3 file into it by means of dragging the file from your desktop. After the file has been converted, you should be able to find the file in the same location that your MP3 file was.\r\n\r\nAh yes...the final part in this (and I quote Mr. Burke) enthralling experience. Now cames the truly technical side of the tutorial. You should know that in order to view the music files in the first place, you\\'ll need a .bsa opener such as FOMM, or you could follow this link: http://pastebin.com/v0aDknYu \r\n\r\nWhen you have found the musical piece that you want to replace, follow these steps:\r\n\r\n-Navigate your way into Skyrim\\'s data folder (steam / steamapps / common / skyrim / data)\r\n\r\n-Create a folder named \\\"music\\\" with another folder inside named after the category listed above the song you will be replacing (special, combat, ect.)\r\n\r\n-Change the name of your .xwm file to the EXACT name of the current in-game file (for instance, to replace the main menu track, name the file \\\"mus_maintheme\\\")\r\n\r\n-Copy and paste this file into the \\\"special\\\" folder\r\n\r\nNow, test your experiment. I recommend to first try out main menu tracks as they can be easily heard (obviously). If you do replace another file, you may need to do some walking in-game first to hear your track. If it worked congrats, if not, do not fret: post a comment! \r\n\r\nNote: Sometimes tracks will overlay with eachother. This is because the tracks are combined unlike Oblivion, so you may be getting some issues in this field. When I find ways to correct this, I will ellaborate upon them in this tutorial.\r\n\r\n---Merging Tracks for the Inexperienced---\r\n\r\nIf you want to add a series of tracks to say...the main menu, this step is for you. Firstly, select your tracks. Next, download this easy to use software called Merge MP3 at http://download.cnet.com/Merge-MP3/3000-2169_4-10410936.html\r\n\r\nNow, you will need to unpack the contents of this file. As I said, everything will be free, and I do realize that most unpackers are anywhere from $15 to $45. Do not fear, for I do not lie XD. I used IZArc, an unpacker for just about everything. You can find it here: http://www.izarc.org/download.html\r\n\r\nUnpack the contents of Merge MP3 in IZArc or any other unpacker, and run the mergemp3.exe file. Do not do the update. Select your tracks and add them to Merge MP3\\'s application. The files will go in descending order (for example, I have tracks 1, 2, and 3. If I put 3 first, then 2, then 1, they will play in that order). You can change the order inside of the app if you would like.\r\n\r\nFinally, combine these files, and save them as you would another MP3 file in an easy access place such as the desktop. You can now use these in the xwmConverter as you would with another MP3.\r\n\r\n---Editing the Songs---\r\n\r\nYou probably don\\'t need this, but if you just like one part of the song, RealPlayer has a trimming feature for the inexperienced like me. It\\'s easy to use, but if you have any questions, post them in the comments, as I have used this feature multiple times.\r\n\r\n---Safety First!---\r\n\r\nIf you\\'re like me, and don\\'t trust many websites (which could be good or bad), read this. After I downloaded and tested all of these files, I ran a full Norton Internet Security scan (yes, the FULL scan that takes 3 hours). This is my first \\\"mod\\\" persay, and as with any other subsequent mods I do, I will always ensure that any file, from me, another website, or otherwise, is safe. If you do not trust my word, you can use any virus scanner to scan your computer for malicious content ater downloading these files. While I do not expect you to find anything, if something does pop-up, DO NOT use the file. I am not begging for recognition, and I put you and your computer\\'s safety above my own Nexus fame.\r\n\r\n---Downloads---\r\n\r\nFor easy access I placed all links to to other pages below:\r\n\r\nhttp://www.real.com/realplayer/search\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=4494\r\n\r\nhttp://www.4shared.com/file/tb_Yajfq/ffmpeg.html\r\n\r\nhttp://www.microsoft.com/download/en/confirmation.aspx?id=6812\r\n\r\nhttp://pastebin.com/v0aDknYu \r\n\r\nhttp://download.cnet.com/Merge-MP3/3000-2169_4-10410936.html\r\n\r\nhttp://www.izarc.org/download.html\r\n\r\n---Unsinstallation---\r\n\r\n\\\"But Flint, you don\\'t have any files for download. Why would we need to unistall???\\\"\r\n\r\nThis will detail how to get rid of your music if you do not like it in-game. It is very simple really. Just delete the file out of the music / special folder in the Skyrim data folder. Now that wasn\\'t hard, now was it? If you must uninstall a program, always go through the proceedure in the Control Panel, as it ensures no files are present on your computer from the file.\r\n\r\n---Closure---\r\n\r\nEnjoy your custom music! I will be making more tutorials upon request or if I spend hours on something that may be useful. I may also begin my actual mods shortly. If you have any questions, feel free to add them to the comments section.\r\n\r\n---Copyright Stuff---\r\n\r\nThis tutorial is not meant to endorse any product. It is meant to provide easy access to changing in-game music. I give full credit to the makers of all these products I have provided links for as well as Bethesda for making such a great game.\r\n\r\nRecognition also goes to miked79 for figuring out the shennanigans behind naming your folder. \r\n\r\nIf you ever have any info you\\'d like to share with me like miked79, feel free to enlighten me in the comments, and I will post it in the tutorial as soon as I can.\r\n\r\n",
  "categoryId": "61",
  "version": "1.0",
  "author": "Flint925",
  "createdUnix": "1325101671",
  "updatedUnix": "1325101671",
  "containsAdultContent": false,
  "uploadedBy": "Flint925",
  "primaryFile": null,
  "files": []
}