{
  "modId": 47899.0,
  "modName": "Stormcloak Equipment Rebalanced",
  "summary": "Changes values of Stormcloak Armor, Stormcloak Officer Armor, and Ulfric&#39;s Clothes.  Adds recipes and tempering where needed.  Adds items to Gunjar&#39;s body in Helgen Keep.  Changes Ulfric and Galmar&#39;s weapons.",
  "descriptionHtml": "STORMCLOAK EQUIPMENT REBALANCED\r<br />\r<br />Tired of Stormcloak gear feeling like a bit of a letdown?  This mod aims to correct that.\r<br />\r<br />- Stormcloak Armor stats match Imperial Light Armor, including the Stormcloak Sleeved Armor and a Stormcloak Shield variant of the Eastmarch Guard Shield.  Added forge and tempering recipes where needed (requires Steel Smithing perk).\r<br />\r<br />- Stormcloak Officer Armor stats match Scaled Armor.  Added forge recipes (requires Advanced Armors perk).\r<br />\r<br />- Ulfric&#39;s Clothes made Light Armor, with stats in between Scaled and Glass.  Added forge and tempering recipes (requires Advanced Armors perk).\r<br />\r<br />- Gunjar&#39;s body now includes both the standard and sleeved variant versions of Stormcloak Armor, Fur Boots, Fur Gauntlets, Hide Helmet, Hide Shield, Iron War Axe, Iron Battle Axe, Long Bow, and 20 Iron Arrows.\r<br />\r<br />- Upon joining the Stormcloaks you will receive both sleeved and sleeveless versions of Stormcloak Armor, Fur Gauntlets, Fur Boots, Stormcloak Helmet, and Stormcloak Shield.\r<br />\r<br />- Galmar now carries a Steel Battleaxe, and Ulfric carries a Steel War Axe Of Fear.\r<br />\r<br />Feel free to post any questions or requests in the comments section, and constructive criticism is welcomed&#33;",
  "categoryId": "24",
  "version": "1.0",
  "author": "Sinistas",
  "createdUnix": "1385244360",
  "updatedUnix": "1385244329",
  "containsAdultContent": false,
  "uploadedBy": "Sinistas",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000082304",
      "name": "Improved Stormcloak Equipment",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Improved Stormcloak Equipment-47899-1-0.7z",
      "uploadedUnix": "1385244329",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/572aaa55411e895e19f63c6a0a510d06d2bc72df8edfb9ae23f3796cd15b6436/analysis/1407805566/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Stormcloak%20Equipment-47899-1-0.7z?fid=1000082304&ttl=1535828083&ri=8192&rs=8192&setec=7161ce843b9b6ab9d179aed1993910f7"
    }
  ]
}