{
  "modId": 47923.0,
  "modName": "XBOX Controller Profile for ENB More",
  "summary": "Expands your controller functionality and works great with ENB and Customizable Camera. Set up with ENB tweakers in mind.",
  "descriptionHtml": "This profile requires Xpadder and offers some unique functionality such as on-the-fly Purge Cell Buffer, open the ENB menu, Free VRAM and more from your Xbox controller for Windows PC. As far as I know, if you want to use keyboard commands and macros for mods from your controller, you need a program like Xpadder.\r<br />[b]\r<br />If you can install a basic program you can install Xpadder. Xpadder is easy to use and will allow you to add your own hotkeys for other mods that work outside the regular game control inputs.[/b]\r<br />\r<br />  This profile also slightly alters the vanilla control configuration for what I feel is a better set up.\r<br />\r<br />  \r<br />  YOU WILL NEED XPADDER version 5.3. MajorGeeks is a good place to look, just search online.\r<br />\r<br />  If you do not want to mess with Xpadder, and do not use ENB, you can still give my controlmap gameplay settings a try. \r<br />\r<br />  This configuration is set up to support regular Skyrim&#39;s SkyUI, iHUD, and Customizable Camera. If and when they get ported I will adjust if necessary.\r<br />\r<br />This configuration uses a second profile in Xpadder is toggled by holding the &#34;A&#34; button. Using xpadder, you control any hotkeys set up by mods. You can also trigger macros to use on the fly console commands other than PCB, such as adding items, toggling clipping, etc etc. \r<br />\r<br />When you use these A-Button combo commands be sure you are not facing anything you can activate like a door or lootable, stealable items, etc. \r<br />\r<br />Here is the control configuration for basic game play and the custom controls.  This configuration is set up using the vanilla key settings for ENB in the enblocal.ini file. Triggers and joysticks are unchanged:\r<br />\r<br />\r<br />Hold LS: Sprint\r<br />Press RS: Jump\r<br />LB: Change View\r<br />RB: Shout/Spell power\r<br />Y: Menu\r<br />X: Ready weapon (same as vanilla)\r<br />B: Sneak\r<br />Dpad Up: toggle ENB FPS counter \r<br />Dpad down: favorites menu\r<br />Dpad Left: toggle HUD (requires iHUD)\r<br />Dpad Right: same as vanilla\r<br />A: Activate (same as vanilla)\r<br />Hold A+Dpad Up: take ENB screenshot  \r<br />Hold A+Dpad Left: toggle ENB  keyfreevram\r<br />Hold A+Dpad Right:Purge Cell Buffers\r<br />Hold A+Press LS: Opens ENB configuration (opens and closes ONLY)\r<br />Hold A+LB: toggle overhead view mode (requires Customizable Camera)\r<br />\r<br />\r<br />\r<br />\r<br />Installation:\r<br />\r<br />1. If you already have Xpadder skip this step. Otherwise, go online and download Xpadder 5.3. This is the last free version of Xpadder, and it is old. However it works fine for me on Windows 7 if I use compatibility mode for XP (right click on .exe . properties&gt; compatibility tab). If you have issues you can also try running it as an administrator or in different compatibility modes. \r<br />    I will not offer a link for Xpadder here because there are several available and I do not wish to link to 3rd party download sites other than community related ones like enb. Just enter &#34;Xpadder 5.3&#34; in a search engine and get it from a trustworthy site such as cnet. \r<br />\r<br />\r<br />  2.  I recommend to install manually. If you use NMM the xpadder files will end up in your Skyrim Data folder.  I would suggest keeping these files in your Xpadder folder.\r<br />\r<br />  Backup your existing controlmap.txt file in your Skyrim Data Interface controls pc folder. Copy the &#34;Data&#34; folder from this mod to your Skyrim folder and overwrite.\r<br />\r<br />3.  Run Xpadder. Click the controller icon in the upper left of the window, click open and navigate to where you extracted the Xpadder files. Select the file called  &#34;Skyrim Controller (XBOX 360 PC).xpaddercontroller&#34;  and load it. Then click on the little document icon in Xpadder in the middle of the top toolbar. Click open and navigate to the Xpadder file called &#34;SkyProfile.xpadderprofile&#34;. Load it. Make sure that profile 1 (green number at bottom right of Xpadder) is selected before running Skyrim.\r<br />\r<br />I use Windows 7. Xpadder runs best in windows XP compatibility mode. To change the compatibility mode of any program, right click the .exe, go to Properties&gt;compatibility tab and check the box for compatibly mode. Select Windows XP Service pack 2. \r<br />\r<br />4. Go to your your enblocal.ini file in your Skyrim root folder. Make sure the following settings under [INPUT] are like so:\r<br />\r<br />[INPUT]\r<br />//shift\r<br />KeyCombination=16\r<br />//f12\r<br />KeyUseEffect=123\r<br />//home\r<br />KeyFPSLimit=36\r<br />//num /       106\r<br />KeyShowFPS=106\r<br />//end\r<br />KeyScreenshot=35\r<br />//enter\r<br />KeyEditor=13\r<br />//f4\r<br />KeyFreeVRAM=115\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />5. Run Skyrim. \r<br />\r<br />\r<br />\r<br />\r<br />Little issues: Heads up&#33;\r<br />\r<br /> ENB seems to revert the screenshot key back to the &#34;printscreen&#34; key. For now I have assigned the enb funtion to the END key, activated with Dpad Right. If you already have the END key assigned for something else, you will need to choose.\r<br />\r<br />   Some of these control settings will &#34;leak&#34; over into other game interfaces like menus. For example, if you navigate a menu with the Dpad Up you will see the FPS counter go on and off. \r<br />\r<br />     If you are already in 3rd person view mode when  toggling View Mode in Customizable Camera, you will switch to first person mode. No big deal, just press LB (without holding A) to see View Mode.\r<br />\r<br />   When using the PCB function, (Hold A+ Dpad right) you MUST hold down the A button until you see the console interface disappear. Otherwise you will get stuck in console mode. If this happens simply re-input the PCB command and hold the A button until it finishes. \r<br />\r<br /> \r<br />  This profile is set up for a WIRELESS XBOX controller for Windows PC.  I do not know if it will work with a corded Xbox controller for Windows PC.\r<br />\r<br />\r<br />Resources and Required files:\r<br />\r<br />Xpadder 5.3 (search online)\r<br />\r<br />I also highly recommend:\r<br />\r<br />\r<br />Xbox 360 Controller Remapper with Controller Input  http://skyrim.nexusmods.com/mods/35405/?\r<br />\r<br />  ",
  "categoryId": "39",
  "version": "1.0",
  "author": "Mallimoosh",
  "createdUnix": "1385262648",
  "updatedUnix": "1385261682",
  "containsAdultContent": false,
  "uploadedBy": "MALLIMOOSH",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000082386",
      "name": "Mallis Controller Profile 1-0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Mallis Controller Configuration-47923-.zip",
      "uploadedUnix": "1385261682",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/59b5871107f320a18320decb25849e12269b188d96dabe82fdc6b04e0bc8f85a/analysis/1407805791/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mallis%20Controller%20Configuration-47923-.zip?fid=1000082386&ttl=1535828103&ri=8192&rs=8192&setec=d868a8ea9361819cb22a37d6ac1031f8"
    }
  ]
}