{
  "modId": 47931.0,
  "modName": "Partner",
  "summary": "Part of me always wished that followers felt more like people rather than your \"Tank\" or \"Mage\".\r\nThis mod adds a follower that can speak to you more tactically, immersible, and my personal favorite. Referring to you by your own name.",
  "descriptionHtml": "This is John, he is a new follower added into the game by this mod, but he isn't merely some meat sack with a sword. He is a person. A living breathing and separate human being from you with his own morals and his own goals. Designed to be a blank canvas for you to choose who he finally ends up as. Whether he is rampantly sarcastic, funny, flirtatious , quiet, out-going, smart, statistical, cold, harsh, brutal, rude. If you go into town he might not follow you around like some sort of dog. instead he'll ask and based on your response he might stop in at the tavern for a drink, stop by the blacksmith to sharpen his sword or to restring his bow (all depends on the class you want him to be), steal a few things from a local residence, skip rocks on a body of water, get in a fight with one of the locals, get arrested for insulting the Jarl, or read at the library. There is even the option for him to set out on a different quest for you (does not work with main story or guild for obvious reasons). He will constantly ask you for your thoughts and opinions, most of which will be through the new conversation system, Smart Talk. taping or holding the buttons you assign in the MCM menu you'll be able to give a positive or negative response (always looking for advice for improvements for this). Smart Talk is also useful in combat to get him to perform tasks such as attack, distract, and pull. Stealth builds will also get the benefit of this tool, by telling him to lure enemy in to a ambush or stealth kill other targets. However to me the most important implication of Smart Talk is the ability to have long conversations as you and him travel Skyrim as Partners",
  "categoryId": "96",
  "version": "0.1",
  "author": "Lore Shout",
  "createdUnix": "1385269920",
  "updatedUnix": "1385269920",
  "containsAdultContent": false,
  "uploadedBy": "Rioes",
  "primaryFile": null,
  "files": []
}