{
  "modId": 47967.0,
  "modName": "Helios-Reanimate-STANDALONE",
  "summary": "Greetings Again!\r\n\r\nJust a High lvl (100 without Necromage perk), \"end game\" players reanimation spells.",
  "descriptionHtml": "First of all: i never learned EN (no joke) so pls dont troll me by my writing, obviously i maybe speak strange sometimes, but this isnt by i not respect the community or etc.!\r\n\r\nFinaly figured out  how to \"make spells\".\r\n\r\nThis is 2 spells what Phinis sells in Winterhold, (if you high enough in conjuration, !putted into his level scale merchant items)!\r\n\r\nThey are the alternative of Dread Zombie and  Dead Thrall. This 2 vanilla spells \"stops\" working if you are higher than level 40, especially if you use (like me) some mods which sets enemies level scale with you all the time! Even vanilla enemies above level 40 (about) resisted this spells...\r\n\r\nSo now you can buy  Call The Fallen = Level 100 cap spell reanimate any (human/creature) dead for a limited time. And can buy  Charm The Fallen = Level 100 cap Reanimate (humanoid ONLY) dead for unlimited time.\r\n\r\nSimplified: work like Dread Zombie and Dead Thrall in Vanille, just NEW, separated spells, with BOTH a level 100 cap (without vanilla Necromage perk, so should be lvl 125 with it, never tested) versions of that spells!\r\n\r\nInstall: simple file just copy into your Data folder (no manager supported im very noob, so only manual works)!\r\n\r\nPS.: if someone missed   The spells cab obtained only From Phinis in Winterhold (conjuration mage in the collage)\r\n\r\nTake care!",
  "categoryId": "75",
  "version": "1.0",
  "author": "HeliosElSOL_SUN",
  "createdUnix": "1385313255",
  "updatedUnix": "1385313076",
  "containsAdultContent": false,
  "uploadedBy": "HeliosElSOLSUN",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000082666",
      "name": "Helios-Reanimate-STANDALONE",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Helios-Reanimate-STANDALONE-47967-1-0.zip",
      "uploadedUnix": "1385313076",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d196b5eacd3a7bb6a5bfd9c5f7bf494dc8cf62a773f320d0c4410df6b57890dc/analysis/1407806779/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Helios-Reanimate-STANDALONE-47967-1-0.zip?fid=1000082666&ttl=1535828145&ri=8192&rs=8192&setec=a01e44dd1f1b75ebd0473dd8321819ea"
    }
  ]
}