{
  "modId": 47988.0,
  "modName": "New Day Rising - Enchantments of the Paladins",
  "summary": "A small package of enchantments aimed at virtuous crusaders and vampire hunters.",
  "descriptionHtml": "New Day Rising\r<br />Enchantments of the Paladins\r<br />Version 1.1\r<br />by xunderxdosedx\r<br />\r<br />\r<br />UPDATE: This mod is now available in French, courtesy of LeonhartLoire\r<br />The translation can be downloaded at: http://www.confrerie-des-traducteurs.fr/skyrim/mods/magie/lever_du_jour.php\r<br />\r<br />UPDATE 1.1:\r<br />- Changed the summoning spell carried by Champion&#39;s Power, added a Guardian Circle spell effect to it, and adjusted all Repel Undead/Banish/etc enchantments to work at higher levels.\r<br />\r<br />What it does: Adds some custom enchantments geared towards &#34;crusader&#34; or &#34;paladin&#34; type characters, partly for roleplaying purposes and partly for the lack of useful enchantments in the vanilla game.\r<br />You must obtain the Ancient Paladin armor set [armor, boots, gauntlets, helmet, shield, ring] and sword, then disenchant them in order to learn these new enchantments.\r<br />\r<br />Where to find the items: I&#39;ve placed them in the inventory of Vulthuryol, the hidden dragon found in Blackreach. You must defeat him, or use console commands if you&#39;ve already defeated him.\r<br />If you don&#39;t know how to find Vulthuryol, numerous walkthroughs are available online which can explain it easier than I can here.\r<br />\r<br />\r<br />Requires: Dawnguard and Dragonborn\r<br />\r<br />\r<br />The enchantments:\r<br />\r<br />- Champion&#39;s Aura [placed on Ancient Paladin Armor, can be placed on any item which can hold a Fortify Health enchantment]\r<br />In combat, the player is surrounded by a sun cloak inspired by Stendarr&#39;s Aura. Unlike Stendarr&#39;s Aura, however, it deals 5 pts of non-elemental magical damage per second to nearby opponents, 15 to undead, and doesn&#39;t have the visually obnoxious swirling effect.\r<br />Hits against the player also have a chance to trigger an explosion of sun fire which deals 50 points of damage to enemies within range, triple damage against undead. Very similar to the effect on Miraak&#39;s robes.\r<br />The cloak ability automatically disables when the player is sneaking, swimming, brawling, or sparring with Vilkas. The explosion disables when brawling or fighting Vilkas.\r<br />\r<br />- Champion&#39;s Resolve [placed on Ancient Paladin Boots, can be placed on any item which can hold a Resist Fire enchantment]\r<br />The player resists 30% of incoming Magic, Poison, and Diseases.\r<br />\r<br />- Champion&#39;s Might [placed on Ancient Paladin Gauntlets, can be placed on any item which can hold a Fortify One-Handed enchantment]\r<br />Weapon strikes do an additional 15 points of damage, Ward spells aborb 50% of the magic cast at them.\r<br />\r<br />- Champion&#39;s Power [placed on Ancient Paladin Helmet, can be placed on any item which can hold a Fortify Restoration enchantment]\r<br />Similar to Konahrik. If you are low on health, this enchantment has a chance to cast a custom healing spell, a high-power Guardian Circle, cast a Fire Cloak, and conjure a Flaming Familiar which will engage nearby enemies and explode.\r<br />\r<br />- Champion&#39;s Resistance [placed on Ancient Paladin Ring, can be placed on any item which can hold a Fortify Health enchantment]\r<br />The player resists 10% of incoming physical damage from undead [ghosts, draugr, vampires, etc], lycanthropes [werewolves and werebears], and Daedra [Dremora, Atronachs, etc].\r<br />\r<br />- Champion&#39;s Ward [placed on Ancient Paladin Shield, can be placed on any item which can hold a Fortify Block enchantment]\r<br />When blocking, casts an additional Sun Cloak, this time with the swirly effects and the magic light effect. The damage is identical to the Champion&#39;s Aura enchantment, using the two of them in tandem will produce 10 points of damage per second to most enemies and 30 to undead.\r<br />The effect also boasts a Ward spell while blocking similar to what Spellbreaker does, except the Ward itself is actually invisible. Think of it like the cloak itself is what&#39;s blocking the spells.\r<br />Bashing attacks repel undead and banish Daedra.\r<br />\r<br />- Champion&#39;s Justice [placed on Ancient Paladin Sword, can be placed on any weapon]\r<br />Weapon strikes do 10 points of Sun Damage, triple against Undead, Lycanthropes, and Daedra. When killing undead, there is a chance to trigger Dawnbreaker&#39;s special Repel Undead explosion.\r<br />Not visible in the item description but still worth note, I&#39;ve included a similar physical damage bonus to that of the Silver weapons, which comes into play against undead and lycanthropes but is subtle and hardly noticeable.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />If you enjoyed the mod, please remember to endorse, thanks&#33;\r<br />\r<br />\r<br />\r<br />You might also like to check out my other mods:\r<br />\r<br />Black Against Night - Enchantments for the Discerning Adventurer\r<br />http://skyrim.nexusmods.com/mods/41255\r<br />\r<br />From the Ashes - Lost Enchantments of the Sixth House\r<br />http://skyrim.nexusmods.com/mods/45652\r<br />\r<br />Dark Dragonbone Weapons Retexture\r<br />http://skyrim.nexusmods.com/mods/31430 \r<br />\r<br />Queen of the Damned - Deadlier Serana\r<br />http://www.nexusmods.com/skyrim/mods/49465",
  "categoryId": "75",
  "version": "1.1",
  "author": "xunderxdosedx",
  "createdUnix": "1385331386",
  "updatedUnix": "1387867456",
  "containsAdultContent": false,
  "uploadedBy": "xunderxdosedx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000088148",
      "name": "New Day Rising 1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "New Day Rising 1-1-47988-1-1.zip",
      "uploadedUnix": "1387867456",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b5dab90725349ac3030edd6a713f410e312ec1574ae38260f501035ac39fee86/analysis/1407856566/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Day%20Rising%201-1-47988-1-1.zip?fid=1000088148&ttl=1535828164&ri=8192&rs=8192&setec=6c57346de04b523ebe914b2c4934fe44"
    }
  ]
}