{
  "modId": 47993.0,
  "modName": "Immersive Naked Comments",
  "summary": "Makes ALL NPCs comment on the fact that you are naked (if you are) before they say anything else.",
  "descriptionHtml": "[size=6][color=red][center]Immersive Naked Comments[/size][/color][/center]\r\n\r\n[size=4]This is a very simple mod. It makes everyone you come in contact with comment on the fact that you are naked (if you are) before they say anything else.  In vanilla Skyrim, less than 25% of the NPCs would react, then there was a cooldown period before anyone else would say anything. Now every one will react when they see you, even if they just did.  It also works when you activate them to start a conversation.  You will be able to continue with the normal conversation after their initial comment, so don't worry about not being able to trade with vendors, train with trainers, or begin any quests.\r\n\r\nAn additional feature of this mod, is NPCs who are walking will comment as they walk by.  They will not stop unless you activate them to start a conversation. If you don't activate them, they won't stop (if the only reason they stop is to say you're naked).  So a guard on patrol will stroll by and say \"put some clothes on\" and keep walking. Just walk through town naked and see what happens. Your followers will also react to your nakedness when they are in the \"relax\" state.[/size]\r\n\r\n\r\n[size=5][color=red][center]This mod does not affect any quests, or change any scripts.[/size][/color][/center]\r\n\r\n\r\n[size=5][center][color=yellow]Compatible with Dawnguard, Hearthfire, & Dragonborn[/size][/center][/color]\r\n\r\n\r\n[size=5][color=red]My reason for making this mod...[/size][/color]\r\n\r\n[size=4]I don't know about you, but I have a few different sets of armor/clothing.  I have an alchemy outfit, a smithing outfit, and a combat outfit. I even have a warm weather armor set and a cold weather set...just to add to the immersion. Occasionally, I'll forget to \"wear\" my default armor when leaving my house.  I play in the 1st person view 99% of the time, so I would only realize that I was naked when NPCs would comment.  \r\n\r\nI don't have recording software on my computer, so if someone wants to make a video, I'll upload it.[/size] \r\n\r\n\r\n[size=5][color=red]Requirements:[/size][/color]\r\n\r\n[size=4]-Latest Version of Skyrim\r\n-Nothing else[/size]\r\n\r\n[size=4][color=yellow][center]All pictures were taken in the same area in less than one minute.  The first two are followers in a \"relax\" state[/size][/color][/center]",
  "categoryId": "78",
  "version": "1.0",
  "author": "JeremeW5257",
  "createdUnix": "1385348100",
  "updatedUnix": "1385348019",
  "containsAdultContent": false,
  "uploadedBy": "JeremeW5257",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000082801",
      "name": "Immersive Naked Comments",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Immersive Naked Comments-47993-1-0.rar",
      "uploadedUnix": "1385348019",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f3c54d8e87e1b443ac8dcbc1ec70ff639b08267fcf7124047057983408931cd0/analysis/1407807549/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Naked%20Comments-47993-1-0.rar?fid=1000082801&ttl=1535828168&ri=8192&rs=8192&setec=44b81fbaee1b36076a87432754d37ae4"
    }
  ]
}