{
  "modId": 47996.0,
  "modName": "Helios-Familiar-REPLACE",
  "summary": "Simple as name suggest: replacing the vanilla Familiar, with my tweaked one!",
  "descriptionHtml": "Welcome!\r\n\r\n\r\nVery simple mod, which REPLACE the vanilla Familiar.\r\n\r\n\r\nFamiliar now autolevel with PC, and looks like the Flaming Familiar (Fire Wolf skin). Furthermore acts like a flame Atronach, BUT melee only! (So have fire dmg ignore, have a little burning trail, if you watch carefully... and ignites enemies in melee,\r\n\r\nThey got smaller, because to me (even original Familiar and Wolf animals too) looked too big... (like a small horse :D ,they were too \"tall\")\r\n\r\n\r\nIts a little sub-project for my PERSONAL arsenal ( i made myself and some followers, Anti-Vampire \"spellswords\" (melee/fire magic) so for THEM, wanted a proper conjuration spell, which more close to the Hircine / Wolf aspect. (like Vampires Gargoyle or Death hounds...)\r\n\r\n\r\nWARNING: use at your own risk, because its a REPLACER, so may conflicting ANY other mods, which changing vanilla Familiars! (or full magic overhauls, which include direct changes to the Familiars)\r\n\r\n\r\nInstallation:  Simple .esp again (im very very newbie, cant say it hard enough :D) so just copy to your Skyrim  Data folder!\r\n\r\n\r\nP.S.: i used skyrim.esp + update.esp when made!\r\n\r\nArranged with BOSS (which places always last in load order, and said unrecognized). I use many, many mods from this amazing community!\r\n\r\nSo far i dont have ANY problems with my mods. Point is: if you place my mod to the LAST place manually, to the load order, i think everything should be fine.\r\n\r\n---------------------------------------------------------------------------------------\r\n\r\nUpdates!\r\n\r\nIf you never used this before, use ONLY \"HOTFIX\" version! \r\nRemoved the wrong file, so only HOTFIX avaiable anyway... to avoid accidently downloads of BAD version!\r\n\r\nIm new to even the website, (from the modders side) sry if i do not manage very professional :)\r\n\r\n-------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nEXTENDED:\r\n\r\n\"Extended\" version is an alternative version, never use BOTH Hotfix, and Extended!\r\n Choose only one!\r\n\r\n\r\nThis is an ALTERNATIVE (do not download, if dont want the included changes) version of my Familiar replacer, STRONGLY recommended ONLY for players, who plays all DLC + mods which auto scales enemies too from lvl 50-100 (about, so a High lvl, end game variation)\r\n\r\n\r\nWhat i did: i simply just extended my Familiar replacer, so now your Thralls autolevel with you!\r\n\r\nThis means in vanilla they were max 30-35 lvl max, but when you play a modified version (especially if have all DLC which gives many oppurtuinity  to lvl up your char, virtualy forever :D) of high lvl mods+gameplay, your summoned ATronachs dies very fast even from Bandits (just an example if have mods like me, even lamiest Bandits autolevel and can rape you :D)\r\n\r\nBeware this ONLY affect THRALLS (the PERMANENT versions!) NOT Potent ones (the \"maxed\", timed variations)!\r\n\r\nInstall: just simply copy to the Skyrim Data folder! (if you have my old Familiar only replacer, and wanna try it: delete the Familiar only, \"old\" one and put this! Never use both, this already have the old features too!\r\n\r\nStill conflict (like original Familiar Replacer) with any mods which directly affect Familiars (and now the Atronachs,,,)!\r\n\r\nOh. before i forgot: i Scale them ALL down (Atronachs included)! I think its lore friendly they arent tiny, but more effective in dungeons.\r\n\r\nSome NPCs summon level scaled Atronachs! :P\r\n\r\n-----------------------------------------------------------------\r\n\r\nIMPROVED:\r\n\r\nIf anyone need better Atronachs, maybe this is for them.\r\n\r\n-Now Potent ones autolevel too.\r\n\r\n-ALL Atronachs (and the replaced Familiars too) have Lightfoot perk.\r\n\r\n-ALL Atronach have his/her own elemental cloak dmg if enemy is close to them (yes flame/frost/strom dmg, but weak  to not be op), NO FX on them (like on NPCs), but noticable on enemies the FX when they hurt by it!\r\n\r\n-Flame atronach now in mid or close range using flames  (you know the flamethrower hands :D) insted of melee.\r\n\r\n-I dont know if its even matters (they recognize it), but all got their proper augment of their elemental! (augmented flames/frost/storm)\r\n\r\n\r\nSometimes the flame atronach (i noticed if she in a corner or something) when cast flames, well the flames \"act\" like got stuck into something, and not reach the target.\r\n\r\nThis never happens in open areas. I Think its the AI+the tight corridors\r\n\r\nHonestly for me not even a problem, by next attack will be a regular firebolt (if enemy got away), or by everyone moves in midfights, next attack hit properly, by turning after her victim :P\r\n\r\nSry i know i lame in explanations, (i never learned EN) but you (who use/try) will see its not really a problem...\r\n\r\nEven vanilla NPCs (human) hit walls with Ice spike :D insted of the enemy :)\r\n\r\nWith vanilla  maybe too easy, btw i originaly recommended even the base replacer with hard difficulty+high lvl scaled enemies, etc!\r\n\r\n\r\nP.S.: Like always this still a replacer, so try it only if already used mine earlier version, or dont have (or care :D) mods which already edit vanilla Familiars/Atronachs!\r\n\r\nCan be simply replace if already have the Atronach (extended) version, if only the BASE familiar replacer, then delete that, and use this!\r\n\r\n\r\nThnx. have a nice day!",
  "categoryId": "75",
  "version": "1.1",
  "author": "HeliosElSOL_SUN",
  "createdUnix": "1385348714",
  "updatedUnix": "1385413259",
  "containsAdultContent": false,
  "uploadedBy": "HeliosElSOLSUN",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000082812",
      "name": "Helios-Familiar-HOTFIX",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Helios-Familiar-HOTFIX-47996-1-01.zip",
      "uploadedUnix": "1385350555",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/fb8b48bcd4fc2bc1c620b932966198907a2dac182f2cbc8b5efaa2f4ceabe678/analysis/1407807551/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Helios-Familiar-HOTFIX-47996-1-01.zip?fid=1000082812&ttl=1535828170&ri=8192&rs=8192&setec=fef880b4e49558713287880077584a1c"
    },
    {
      "fileId": "1000082948",
      "name": "Helios-Replacer-EXTENDED",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Helios-Replacer-EXTENDED-47996-1-0.zip",
      "uploadedUnix": "1385395386",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2b3de0a11b8a299fc8ae2d12fdc4a95cd3101298769d333f8d5874d280284b1a/analysis/1407808084/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Helios-Replacer-EXTENDED-47996-1-0.zip?fid=1000082948&ttl=1535828171&ri=8192&rs=8192&setec=51666ab9595f3aacb98265d85c249e1c"
    },
    {
      "fileId": "1000083070",
      "name": "Helios-Replacer-EXTENDED-improved",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Helios-Replacer-EXTENDED-improved-47996-1-1.zip",
      "uploadedUnix": "1385413259",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1c2148113df96fa769217b228ea42966ae48e016a5e3823ffd420a924507eae8/analysis/1407808390/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Helios-Replacer-EXTENDED-improved-47996-1-1.zip?fid=1000083070&ttl=1535828171&ri=8192&rs=8192&setec=d5b93d8caed56a78a8e8fb2a58efeb6d"
    }
  ]
}