{
  "modId": 48012.0,
  "modName": "Solitude LOTR Retexture based on Minas Tirith - Gondor",
  "summary": "Solitude Retexture to mimic Minas Tirith from the LOTR universe - inspired mostly from The Return of the King flim of the Peter Jackson Trilogy.",
  "descriptionHtml": "[img]http://static1.nexusmods.com/110/mods/110/images/48012-1-1385359053.jpg[/img]\r\n\r\nThis has been a many hour project I have done in one go. Retexturing the majority of Solitude so that it is a brilliant white (not too brilliant I hope) to mimic the fabled City of Kings that is\r\n\r\nMinas Tirith from the Tolkien Universe.\r\n\r\nSince Skyrim has many similarities to the LOTR series, for example, Whiterun is very, very similar to Rohan (top of a hill, norse based designs) but interestingly the gildergreen tree is based of the White tree in Minas Tirith. \r\n\r\nThe Solitude City Banner (Red cross with wolf) has been replaced with the white tree of Gondor as see in the images. Copyright Tolkien Estate.\r\n\r\nTo have a Solitude without the Moss on the walls to have a better feel to the City, \r\nget this - No More Moss - Solitude by Dragten: \r\n\r\nhttp://skyrim.nexusmods.com/mods/4771/\r\n\r\nAnd for the roads, Solitude no grass on road by Yoraphcool:\r\nhttp://skyrim.nexusmods.com/mods/33450/\r\n\r\n\r\nNotice: The armors and guards seen in the pictures are NOT included. I just added them to add to the flavour of the mod. The armors seen are:\r\n\r\nMERPs Gondorian Armament by BGS: http://skyrim.nexusmods.com/mods/43641/?\r\n\r\nGondor Armor by Maty743:               http://skyrim.nexusmods.com/mods/31019/?\r\n\r\nGet them there.\r\n\r\nThese textures have been scaled down and are not HD I am afraid. They are based of vanilla/base game textures and should not be taxing anybody's computer too much.\r\n\r\nI would not say these are finished but who knows.\r\n\r\n*This is a non-profit mod and is not intended for sales of any sort. It is in no way affliated with, or sponsored or approved, by Tolkien Enterprises, the heirs or estate of J.R.R. Tolkien Warner Brothers or any of their respective affiliates or licenses. I make no claim to  designs that are trademarked, copyrighted or otherwise protected by law. This work is produced solely for the personal, uncompensated enjoyment for myself and other Tolkien fans as well those of the TES series created by Bethesda Softworks.\r\n\r\nCredits:\r\nEstate of J.R.R. Tolkien\r\nWarner Bros\r\nPeter Jackson for outstanding LOTR Trilogy as well as The Hobbit series.\r\nBethesda for Skyrim and the rest of the TES series.",
  "categoryId": "29",
  "version": "1",
  "author": "Based on the works of JRR Tolkien - textures by bethesda softworks",
  "createdUnix": "1385358632",
  "updatedUnix": "1385358586",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000082831",
      "name": "LOTR Minas Tirith based retexture of Solitude",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16329",
      "fileName": "LOTR Minas Tirith based retexture of Solitude-48012-1.rar",
      "uploadedUnix": "1385358586",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f191912d4ea27be75371c2cb794300fc680bd8f251755e031aebfa69378cf56c/analysis/1407807681/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LOTR%20Minas%20Tirith%20based%20retexture%20of%20Solitude-48012-1.rar?fid=1000082831&ttl=1535828184&ri=8192&rs=8192&setec=8d1ebe7fa29131a65c521c3e37423c50"
    }
  ]
}