{
  "modId": 48035.0,
  "modName": "College of Winterhold Staff Enchanter and Merchant",
  "summary": "This mod adds a Staff Enchanter to the College of Winterhold, instead of it only being available to Neloth in Solstheim. It also adds a merchant will sell the ingredients to enchant staves. Requires Dragonborn DLC.",
  "descriptionHtml": "This mod adds a Staff Enchanter to the Arch Mage's quarters in the College of Winterhold, instead of it only being available to Neloth in Tel Mithryn, Solstheim.\r\n\r\nIt also adds a merchant named Aronil to the Arcaneum who will sell you the ingredients to make the staves (amongst other items) between 8am and 10pm. He may not have the staffs or Heart Stones all the time however, so return after a couple of days to see if he has stocked up\r\n\r\nI thought this would be a nice idea to make staves more valuable that in the vanilla game, because I don't know about anybody else, but I would never use them before. The added choice in the staves used could make it a more viable option than before.\r\n\r\nSome people may argue that it isn't \"lore friendly\" but the way I see it there are many staffs in Skyrim and they can't all have been enchanted by Neloth in Solstheim. The best magic institute in Skyrim should have access to these facilities.\r\n\r\nRequires Dragonborn DLC and latest version of Skyrim.\r\n\r\nPlease report any bugs so I can fix them, but I doubt there is any. Thanks",
  "categoryId": "75",
  "version": "1.0",
  "author": "ConnorTaylor97",
  "createdUnix": "1385402065",
  "updatedUnix": "1385402063",
  "containsAdultContent": false,
  "uploadedBy": "ConnorTaylor97",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000082985",
      "name": "College of Winterhold Staff Enchanter and Merchant",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "College of Winterhold Staff Enchanter and Merchant-48035-1-0.rar",
      "uploadedUnix": "1385402063",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/171bef5f2ae6932b43db93de40b32c8465eccb295a54d9c8c8beff0a3d1283fc/analysis/1407808253/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/College%20of%20Winterhold%20Staff%20Enchanter%20and%20Merchant-48035-1-0.rar?fid=1000082985&ttl=1535828208&ri=8192&rs=8192&setec=3cdf4dc0ba60fcf1d12ebdfec743dbd9"
    }
  ]
}