{
  "modId": 48052.0,
  "modName": "Child Followers Liette and Natesse STANDALONE",
  "summary": "Standalone version of my other mod - only requires main Skyrim and MFVM. Two Bosmer/ wood elf child followers (adoptable with console commands), an 11-year-old mage named Liette and her little sister, a nine-year-old thief named Natesse. ",
  "descriptionHtml": "This is a standalone version of my other mod at http://skyrim.nexusmods.com/mods/46284/ (which requires Revised Children of the Sky plus some DLCs, but has them looking more childlike, includes a brother, and allows you to play as a child race)\r<br />\r<br />Requirements:\r<br />Skyrim\r<br />More Follower Voices Mod (http://skyrim.nexusmods.com/mods/36913/) - needed for them to have the right dialogue (not needed if you just want to adopt them)\r<br />\r<br />Their bodies are standalone (they use a custom race) and so won&#39;t be affected by any body mod you have (exceptions are listed under &#34;Compatibility&#34;)\r<br />\r<br />They&#39;re both located in Riften, in the Bee and the Barb Inn.\r<br />\r<br />Liette is a custom Bosmer child follower, and a prodigy to boot. She&#39;s a destruction-orientated mage, although she can also use conjuration (atronachs and familiar) and alteration spells. She&#39;ll level with the player (like most followers, you need to use console commands to force this - it isn&#39;t auto). She has the Lightfoot perk (so she won&#39;t set off traps&#33;), plus Muffled Movement, all of the Destruction-costs-less-magicka-line (Novice..., Adept..., etc), and Destruction Dual Casting. She&#39;s willing to commit any crime, and won&#39;t report the character. She has RIDICULOUS stealth. Seriously, she hits 100 ranks at level 24. I gave her basically every destruction spell, with the notable exception of area-of-effects and Chain Lightning, because those hit bystanders. She&#39;s foolhardy and loves fighting, and really doesn&#39;t get the concept of &#34;retreat.&#34; (I gave her all the spells she needs at the outset; she starts using them once she has enough magicka). \r<br />\r<br />Liette is carrying her deceased father&#39;s journal, which she has contributed a few pages to. \r<br />\r<br />Natesse is her baby sister. She&#39;s a bit different from Liette - less of a prodigy, doesn&#39;t really have a knack for magic. She&#39;s also far more cautious. Natesse&#39;s talents like in shadow and sword - she&#39;s an excellent thief, with some ability in light armor, archery, and one-handed, also making her a good assassin. She has the Light Foot, Muffled Movement, Backstab, Deadly Aim, Silent Roll, Silence, and several lockpicking and pickpocketing perks. She has far more health and stamina than her older sister, but no magicka and she doesn&#39;t know any spells. \r<br />\r<br />(If you have Hearthfires and want to adopt them, and don&#39;t want them as a follower, target either and use the command &#34;addfac xx004290 1&#34;, where xx is the position of Hearthfires in your load order (should between 01 and 03). It&#39;ll disable the follower dialogue, though, and if either&#39;s already your follower, you&#39;ll have to dismiss them first, then add them to the adoptable faction. Unfortunately both can&#39;t be active at the same time, and it looks like making them adoptable and as a potential follower will require a lot of work... Also, DON&#39;T GIVE THEM CHILD&#39;S CLOTHES)\r<br />\r<br />They both have a custom combat class, which affects their leveling. All three are very heavily weighted towards stealth. Liette will gain a lot of magicka as she levels, some health, but no real stamina, and her destruction skill advances faster than her other combat skills. Her onehanded will increase very slowly. Natesse has ridiculous health and sneak. Her lockpicking and pickpocketing level up at a decent rate. Her combat skills - onehanded, marksman, and lightarmor - don&#39;t level up quite as quickly, but they&#39;ll be sufficient for most uses, especially if she has good gear.\r<br />\r<br />CREDITS:\r<br />All of their hairs are taken from the Oblivion Hair Packs by rodeorage, who gave blanket permission to repackage and redistribute individual hairs, and who did the amazing work of converting Oblivion custom hairs to Skyrim. Credit also goes to the massive list of modders rodeorage got permission from, although I couldn&#39;t figure out which modder went with which hair\r<br />To LogRaam for their eyes (from the Eyes of Beauty mod)\r<br />To tktk for their faces/eyebrows (from the Pretty Face mod)\r<br />To triplex2011 for the AMAZING Book Creator for Skyrim - BCFS mod that I used to make the journal. \r<br />To narphous, for the freckles\r<br />To caliente for CBBE, and to stuffed_bunny for Bodyslide++, both of which I used to create their bodies (using the NeverNude base)\r<br />\r<br />Compatibility:\r<br />I&#39;ve tested them in combat at level 1, 12, 24, and 65. Tested them with Effective Follower Framework (so they should be fine with other multi-follower mods) and with Convenient Horses (some clipping problems, but not much). Because of MFVM, they are NOT compatible with My Home is Your Home\r<br />They&#39;re semi-incompatible with armor replacers - for instance, I have a CBBE body, with a CBBE-compatible armor replacer. Having either of them equip a replaced armor forces their body to conform to the body I have at the moment, resulting in various levels of weirdness. They&#39;re fine with vanilla armors, though, and with some custom armors. (Boots, gauntlets, and helmets are almost always fine, too, as are most clothes)\r<br />There is a small chance they&#39;ll conflict with other mods editing the Bee and the Barb. I didn&#39;t touch anything, so if you just place ChildFollowersBosmerStandalone.esp after whatever in your load order you should be fine\r<br />I would strongly recommend against trying to turn them into vampires. Very, very strongly. \r<br />\r<br />They were having a bug earlier where their lips wouldn&#39;t move when they spoke. I did have other stuff affecting animations loaded at the time. I think I fixed it, but I&#39;m not sure. If it happens to you, please report it&#33;\r<br />\r<br />Their story: details in Anorien&#39;s Journal. I actually put a good bit of effort into making this lore-friendly and consistent with the timeline\r<br />\r<br />File paths (for manual uninstall, or if you want to mod them; all the things I added in the CK are prefixed with &#34;aaa&#34; and usually contain &#34;child&#34;):\r<br />...Meshes/Actors/character/ChildFollowersLiettePlusSibs     &lt;----contains head, body, hands, and feet nif files, plus the FemaleHeadRaces.tri file\r<br />...Meshes/Actors/character/ChildFollowersLiettePlusSibs/Hair      &lt;-------meshes for their hair\r<br />...Meshes/Actors/character/facegendata/facegeom/ChildFollowersBosmerStandalone.esp     &lt;----FaceGenData meshes\r<br />...Textures/Actors/character/ChildFollowersLiettlePlusSibs    &lt;-----contains textures for head, body, hands, feet, eyes, and freckles\r<br />...Textures/Actors/character/ChildFollowersLiettlePlusSibs/Hair     &lt;------contains Natesse&#39;s hair texture. Couldn&#39;t find the one for Liette\r<br />...Textures/Actors/character/facegendata/facetint/ChildFollowersBosmerStandalone.esp\r<br />...Textures/BookCreator/Anorien&#39;s Journal/     &lt;-----png files for the book",
  "categoryId": "96",
  "version": "1.0",
  "author": "Shinkoku",
  "createdUnix": "1385419691",
  "updatedUnix": "1385418692",
  "containsAdultContent": false,
  "uploadedBy": "Shinkoku",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000083101",
      "name": "Standalone Bosmer Child Followers v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26816",
      "fileName": "Standalone Bosmer Child Followers v1_0-48052-1-0.zip",
      "uploadedUnix": "1385418692",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cf7bdc378c7cf291de06086dc23777d1b34036c494f854975d2b066c149a0265/analysis/1407808468/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Standalone%20Bosmer%20Child%20Followers%20v1_0-48052-1-0.zip?fid=1000083101&ttl=1535828220&ri=8192&rs=8192&setec=2524694e185dffaba33ceb9f0c8cd28d"
    }
  ]
}