{
  "modId": 48220.0,
  "modName": "Taledens Lifelike ENB for RLO and CoT",
  "summary": "Taleden&#39;s Lifelike ENB for RLO+CoT",
  "descriptionHtml": "[heading][color=cyan]WHAT IS AN ENB PRESET?[/color][/heading]\r<br />\r<br />The short version is, it makes the game look better. The most obvious changes are in the intensity and color of various kinds of lights and visual effects, but there are a lot of nice improvements that are subtler too, like better shadows, ambient occlusion, better skin tones, and so on. See [url=http://www.enbdev.com]www.enbdev.com[/url] for more information.\r<br />\r<br />[heading][color=cyan]WHY DID YOU MAKE YET ANOTHER ENB PRESET?[/color][/heading]\r<br />\r<br />A lot of ENB presets seem intended specifically for machinima, or taking pretty screenshots, or something. Even among the ones that say they&#39;re meant for regular play, I never found one that made the world look quite the way I thought it should. That&#39;s not to say they don&#39;t look lovely in their own ways, it&#39;s just that they all had one characteristic or another that made me think &#34;that doesn&#39;t look right&#34; to an extent that it was distracting from the game experience.\r<br />\r<br />[heading][color=cyan]WHAT&#39;S DIFFERENT ABOUT THIS ENB PRESET?[/color][/heading]\r<br />\r<br />Taleden&#39;s Lifelike ENB (for RLO+CoT (hey that rhymes&#33;)) is meant for actually playing Skyrim, while still making it as beautiful, immersive and lifelike as possible. Above all, I tried to adjust or eliminate any lighting or visual effects which remind you that you&#39;re playing a game and not looking at a real place. But here are some more specific features and visual principles that went into the design of this preset.\r<br />\r<br />[b][color=yellow]The Sun is Bright[/color][/b]\r<br />\r<br />Like, really bright. This manifests in a few different ways; surfaces lit by direct sunlight are much brighter, of course, but even shadows are not very dark on bright sunny days, because all that light bouncing around makes for fairly high ambient light.\r<br />\r<br />Also, if you try using a flashlight or even car headlights on a sunny day, you&#39;ll notice that the sun is MUCH brighter than any artificial light source, even with modern bulbs and reflectors. Torches and firepits cast so little light compared to the sun that their effect is barely visible at all next to direct sunlight. This is probably the single most noticeable change that makes the world look (to me) much more realistic and lifelike on bright sunny days.\r<br />\r<br />[b][color=yellow]The Night is Dark[/color][/b]\r<br />\r<br />Most importantly, there are no shadows at night. This was one of my biggest peeves in vanilla Skyrim which is not fixed by many ENB presets I&#39;ve seen; why would there be shadows at night? What&#39;s casting them? The moons aren&#39;t that bright, and even if they were, Skyrim&#39;s nighttime shadows are not at the right angle to be cast by the moons. So they seem to be cast by nothing, which looks awful (to me).\r<br />\r<br />[b][color=yellow]No Sun in Oblivion[/color][/b]\r<br />\r<br />The Soul Cairn and Apocrypha both originally have day-night cycles, complete with shadows that change direction as if the sun were rising and setting. But these are alternate planes of reality where there should be no sun at all, so now they are timeless and shadowless as (I think) they ought to be.\r<br />\r<br />[b][color=yellow]No Eye Adaptation[/color][/b]\r<br />\r<br />This is the effect that makes the whole screen get darker when you look at a bright light, and brighter when you look at a dark corner. It sounds nice in theory and of course it&#39;s inspired by how our eyes really work, but I&#39;ve never seen it executed in Skyrim in a way which wasn&#39;t distracting and weird. So I just turned it off entirely, and instead tuned all of the light levels to work out without needing this &#34;adaptive&#34; adjustment.\r<br />\r<br />[b][color=yellow]No Bloom[/color][/b]\r<br />\r<br />This also seemed nice in theory but always just looked blurry to me. Maybe somebody out there has a great bloom shader which gives really bright things that nice glow without also softening and blurring the entire screen, but all my attempts with bloom just looked like a greased camera lens. So I turned it off entirely.\r<br />\r<br />[b][color=yellow]No Depth Of Field or Lens Flare[/color][/b]\r<br />\r<br />When I play Skyrim I like to pretend that I am a character in the world. I do not like to pretend that I am a video camera, so it makes no sense to me to see visual artifacts that are specific to how mechanical video cameras work. These effects are great for machinima so it feels like you took a camera into Skyrim and filmed something, but if you want the screen to look like what your own eyes would see, these effects are weird and distracting. So I turned them off.\r<br />\r<br />Note that there are some weathers which apply a blur to everything in the distance. This isn&#39;t the same as Depth of Field because it doesn&#39;t try to guess where you&#39;re focusing your eyes, it&#39;s just a distance blur (such as during heavy rain), so these are still enabled.\r<br />\r<br />[b][color=yellow]Night Eye Works[/color][/b]\r<br />\r<br />Many other ENBs seem to make things super dark and also prevent Night Eye from working, which is awkward for actual gameplay. The conventional workaround was all-or-nothing; either you had to enable all vanilla post-processing (most of which looks bad when mixed with ENB), or you had to do without Night Eye. My workaround does require an extra plugin file, but it makes Night Eye work without also screwing up the color balance in general.\r<br />\r<br />[heading][color=cyan]KNOWN BUGS[/color][/heading]\r<br />\r<br />[b][color=yellow]No Sky Lighting or Particle Lights[/color][/b]\r<br />\r<br />I like how both of these effects look, unfortunately they both have bugs which Boris has not yet been interested or able to fix. Sky Lighting exhibits a very distracting flicker when turning the camera near a shadow, and Particle Lights cause some dynamic particles (such as the snow on some mountain rock surfaces) to be visible through otherwise solid embers. Both of these issues were reported, so if they&#39;re ever fixed, I&#39;ll happily turn them back on and fine-tune the levels.\r<br />\r<br />[b][color=yellow]Flickering Reflections in Exterior Water During Cloudy Weather[/color][/b]\r<br />\r<br />This seems to be caused by a particular combination of Sky and Water settings, and only during fully overcast weathers, but Boris was not able to reproduce it himself. So it&#39;s unknown whether this is a bug in ENB or caused by some video driver or other factor.\r<br />\r<br />[b][color=yellow]Sourceless Highlights in Some Interiors, Dim Sunlight in Others[/color][/b]\r<br />\r<br />Some interior imagespaces misuse (in my opinion) the directional ambient light parameters in a way that looks like there is some sourceless light shining from below everything. I think this looks really bad, but unfortunately I can&#39;t turn it off because otherwise, &#34;fake&#34; exteriors (i.e. interior caves or buildings which have large openings to the &#34;outside&#34;) often have no other light, so they would then appear unnaturally dark even when it looks like broad daylight through the opening. It&#39;s a tradeoff that I went back and forth on many times but ultimately decided that the sourceless highlights looked less bad than the missing sunlight.\r<br />\r<br />[heading][color=cyan]INSTALLATION[/color][/heading]\r<br />\r<br />[b][color=yellow]1. Install Realistic Lighting Overhaul and Climates of Tamriel[/color][/b]\r<br />\r<br />This ENB preset is designed specifically around the lighting changes that are already made by RLO and CoT. If you don&#39;t already use (or want to start using) both of those mods, I suggest you find a different ENB preset, because this one won&#39;t look right without them.\r<br />\r<br />RLO: [url=http://skyrim.nexusmods.com/mods/30450]skyrim.nexusmods.com/mods/30450[/url]\r<br />Do NOT use Adaptive Interiors or RLO Weathers, they will conflict with CoT.\r<br />\r<br />CoT: [url=http://skyrim.nexusmods.com/mods/17802]skyrim.nexusmods.com/mods/17802[/url]\r<br />I suggest nights level 3. Also get the DLC patches if needed.\r<br />\r<br />[b][color=yellow]2. Install Boris Vorontsov&#39;s ENBSeries for Skyrim (version 0.226 or later)[/color][/b]\r<br />\r<br />It is not allowed to include it in this package, so you must download it for yourself from [url=http://enbdev.com/download_mod_tesskyrim.htm]enbdev.com/download_mod_tesskyrim.htm[/url]. The only files you need to extract are &#34;d3d9.dll&#34; and &#34;enbhost.exe&#34;, and you must put them in your Skyrim game folder alongside &#34;SkyrimLauncher.exe&#34; and &#34;TESV.exe&#34;. Do NOT put them inside your Data folder with your mods; ENB is not a mod.\r<br />\r<br />I have tested this preset with ENBSeries versions 0.226 through 0.236, which is the latest at the time of writing. Versions before 0.226 don&#39;t support the ENB Helper (below), so they&#39;ll look wrong in certain situations. Versions after 0.236 will hopefully work fine, but it depends what Boris changes in ENBSeries.\r<br />\r<br />[b][color=yellow]3. Install Alexander Blade&#39;s ENB Helper (version 1.1 or later)[/color][/b]\r<br />\r<br />It is also not allowed to include it in this package, so you must download it for yourself from [url=http://www.dev-c.com/skyrim/enbhelper/]www.dev-c.com/skyrim/enbhelper/[/url]. The only file you need to extract is &#34;enbhelper.dll&#34;, put it alongside &#34;d3d9.dll&#34; in your Skyrim game folder.\r<br />\r<br />This is technically optional, but if you don&#39;t install it then sunrise and sunset lighting won&#39;t be synchronized with what the sun is actually doing at that time of day, and you may see other lighting which is wrong for the time of day (like glowing windows inside at night when it&#39;s dark out).\r<br />\r<br />[b][color=yellow]4. Turn off Antialiasing, Anisotropic Filtering and FXAA in the Skyrim Launcher[/color][/b]\r<br />\r<br />ENB will handle these for you, so you have to turn off Skyrim&#39;s version of both effects. If you don&#39;t, everything will look wrong and your framerate will be terrible.\r<br />\r<br />Antialiasing and Anisotropic Filtering are on the main options screen in the launcher; FXAA is a checkbox in the Advanced options.\r<br />\r<br />[b][color=yellow]5. Edit your SkyrimPrefs.ini[/color][/b]\r<br />\r<br />These are the same changes that are required for all ENB presets. If you change anything else in this file, things might not look right; if you have any trouble, the first you should do is delete your Skyrim.ini and SkyrimPrefs.ini, re-do step #4 (above), and then make ONLY these changes.\r<br />\r<br />Add or edit these lines in the [Display] section:\r<br />[quote]\r<br />bFloatPointRenderTarget=1\r<br />bTreesReceiveShadows=1\r<br />bDrawLandShadows=1\r<br />bShadowsOnGrass=1[/quote]\r<br />\r<br />Add or edit this line in the [Imagespace] section:\r<br />[quote]\r<br />bDoDepthOfField=1[/quote]\r<br />\r<br />[b][color=yellow]6. Extract everything from this package into your Skyrim game folder[/color][/b]\r<br />\r<br />There is only one file that should go in your Data folder with other mods, and that is &#34;ENBNightVision.esp&#34;. Everything else should go in your Skyrim game folder.\r<br />\r<br />You may want to edit &#34;enblocal.ini&#34; to set &#34;VideoMemorySizeMb&#34; to whatever is appropriate for your hardware. I use 8192 myself because I have 8GB system RAM plus 4GB video RAM; if you have less, 4096 may be safer.\r<br />\r<br />[b][color=yellow]7. Enable &#34;ENBNightVision.esp&#34; in your load order[/color][/b]\r<br />\r<br />The only thing this plugin does is alter the Night Eye effect in such a way that the ENB shader code can detect it and apply a similar &#34;see in the dark&#34; lighting effect. If you don&#39;t install and enable this plugin, then Night Eye will do nothing while this ENB is active (except blur your screen). But if you don&#39;t plan to play a Khajiit, werewolf, vampire or anything else that grants Night Eye or a similar ability, then this isn&#39;t necessary.\r<br />\r<br />If you uninstall this ENB, make sure to also remove &#34;ENBNightVision.esp&#34; from your load order&#33; Otherwise Night Eye will turn your screen completely black. It should be safe to add or remove the plugin at any time, since it contains no scripts or other save-sensitive changes; the only form it modifies is the NightEyeImod imagespace modifier.\r<br />\r<br />[b][color=yellow]8. Turn your in-game brightness all the way down[/color][/b]\r<br />\r<br />The way Skyrim applies brightness tends to make all colors look a little washed out, so I prefer to keep the in-game slider all the way down (to the left). All light levels in this ENB preset have been tuned with that in mind.\r<br />\r<br />[heading][color=cyan]UNINSTALLATION[/color][/heading]\r<br />\r<br />[b][color=yellow]1. Delete or rename &#34;d3d9.dll&#34; in your Skyrim game folder[/color][/b]\r<br />\r<br />[b][color=yellow]2. Delete or disable &#34;ENBNightVision.esp&#34; from your load order[/color][/b]\r<br />\r<br />[b][color=yellow]3. Delete all the other files you installed along with this ENB (Optional)[/color][/b]\r<br />\r<br />You don&#39;t technically have to delete them, since they&#39;ll be ignored anyway as long as &#34;d3d9.dll&#34; is removed or renamed. But if you want to tidy up, delete (or move to another folder, just in case you make a mistake) everything whose name starts with &#34;enb&#34;, plus &#34;injector.ini&#34;, &#34;SMAA.fx&#34; and &#34;SMAA.h&#34;.\r<br />\r<br />[heading][color=cyan]OTHER SUGGESTED MODS[/color][/heading]\r<br />\r<br />[b][color=yellow]mindflux&#39;s texture and mesh fixes for ENB[/color][/b]\r<br />[url=http://enbseries.enbdev.com/forum/viewtopic.php?f=6&t=1499]enbseries.enbdev.com/forum/viewtopic.php?f=6&t=1499[/url]\r<br />There are two, make sure to install both the &#34;PARTICLE PATCH ALL-IN-ONE&#34; and the &#34;SUBSURFACE SCATTERING PATCH&#34;.\r<br />\r<br />[b][color=yellow]Climates of Tamriel - Weather Patch - Fog Rain Overcast[/color][/b]\r<br />[url=http://skyrim.nexusmods.com/mods/39799]skyrim.nexusmods.com/mods/39799[/url]\r<br />\r<br />[b][color=yellow]Texture Pack Combiner[/color][/b]\r<br />[url=http://skyrim.nexusmods.com/mods/20801]skyrim.nexusmods.com/mods/20801[/url]\r<br />[url=http://code.google.com/p/skyrim-tpc/]code.google.com/p/skyrim-tpc/[/url]\r<br />Includes SMIM, WATER, and thousands of hand-picked textures from dozens of various texture packs. It takes awhile to get everything downloaded and built, but the result looks fantastic.\r<br />\r<br />[b][color=yellow]Project Parallax Remastered[/color][/b]\r<br />[url=http://skyrim.nexusmods.com/mods/40512]skyrim.nexusmods.com/mods/40512[/url]\r<br />If you&#39;re also using the Texture Pack Combiner (above), make sure to get the correct version of Project Parallax Remastered, down in the Optional Files section (&#34;PPR TPC 1-3&#34;).\r<br />\r<br />[b][color=yellow]Lanterns of Skyrim[/color][/b]\r<br />[url=http://skyrim.nexusmods.com/mods/18916]skyrim.nexusmods.com/mods/18916[/url]\r<br />Nights are a bit darker with CoT and this ENB, so it&#39;s nice to have lanterns along the roads.\r<br />\r<br />[heading][color=cyan]CREDITS[/color][/heading]\r<br />\r<br />Bethesda Softworks for Skyrim\r<br />Boris Vorontsov for ENBSeries\r<br />Alexander Blade for ENBHelper\r<br />Andrej Dudenhefner for injectSMAA\r<br />Jorge Jimenez, Jose I. Echevarria, Tiago Sousa, Diego Gutierrez for SMAA",
  "categoryId": "97",
  "version": "1.0",
  "author": "taleden",
  "createdUnix": "1385615937",
  "updatedUnix": "1385661606",
  "containsAdultContent": false,
  "uploadedBy": "taleden",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000084009",
      "name": "Taledens Lifelike ENB v1-0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "186",
      "fileName": "Taledens Lifelike ENB for RLO and CoT v1-0-48220-1-0.7z",
      "uploadedUnix": "1385661606",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9880c3eb6c682e51a2e7e0293583e8905d52075bb84fcbd9e6161ad6efd3f199/analysis/1407812351/",
      "changelogHtml": " First release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Taledens%20Lifelike%20ENB%20for%20RLO%20and%20CoT%20v1-0-48220-1-0.7z?fid=1000084009&ttl=1535828355&ri=8192&rs=8192&setec=2edc9e12570f903db0b5dec5ce068821"
    }
  ]
}