{
  "modId": 48233.0,
  "modName": "The Game  - A tale of mystery and intrigue",
  "summary": "Attention fellow Skyrim book-hoarders!  This mod adds a new series of short stories rooted in the world of Skyrim and The Elder Scrolls universe to your shelves.",
  "descriptionHtml": "[i]\"When he stooped down to her to grope for his ring, his hands were shaking.  Not because he was nervous - oh no! Everything was so clear now (why hadn't he known it sooner?) - but rather because he was still giddy after his First.  He couldn't seem to control his nervous excitement, and the sheer thrill coarsing through his veins as he stood over her corpse. He saw her face again: so stern and imperious such a short time ago, now set in stone with that same imploring, pitiable look, her eyes peering directly into his...\"[/i]\r\n\r\nTHE GAME is a new series of short stories recounting the dangerous new life of a hapless Bosmer trader in over his head.  \r\n\r\n[u][b]SYNOPSIS:[/b][/u]\r\n\r\nIn the cold, xenophobic province of Skyrim - far from his roots in Valenwood - this young Wood Elf trader had always struggled to make ends meet in the city of Whiterun, using his skills as a counter and a haggler to finally make a name for himself and gain the respect of his Nord peers.\r\n\r\nHowever, just when things start to look up, he is mysteriously sucked into a world of bloody murder, betrayal, conspiracy and lies.  However, being a dodgy trader and, shall we say, a \"negotiator\" himself (\"swindler\" is such a callous word...),  he will soon find that his own talents in the realms of mendacity, subterfuge and perception are surprisingly well-suited to his new circumstances...\r\n\r\nCaught up in what seems to be some sort of Thalmor conspiracy, Huan must discover the true identity of a young Altmer woman who purports to be his new ally, and must decide if he can really trust some of his closest friends, or if he truly is an outsider, utterly alone in this frigid northern wasteland.\r\n\r\n[u][b]TECHNICAL DETAILS about the books in game:[/u][/b]\r\n\r\nThe series is comprised of seven books in total (eight if you include a short \"post-scriptum\" by the authour), and are sold by Urag Gro-Shub at the College of Winterhold Arcaneum.  Most of them grant skill points, but this is subject to change if it is too unbalanced.\r\n\r\nEach book is only about a dozen or so pages long and should only take a couple minutes to read; \r\nhowever, if you are like me and really like to absorb the atmosphere of novels, it could take longer.\r\n\r\nIf you do not wish to purchase the books, you can of course use the console commands by typing:\r\n\r\nhelp \"the game\"\r\n\r\nand using player.additem with the codes given.\r\n\r\nYou will notice that the tale is presently unfinished.  This mod is still in its \"beta\" release, since I want to see what kind of reaction (if any) this will get from the Nexus community.\r\n\r\nFuture plans would be to (a) finish the story and (b) incorporate some kind of quest or quest(s) involving finding the actual books scattered throughout Skyrim; however my modding skills are nothing to brag about, so I can't promise anything here.\r\n\r\nFeedback would be greatly appreciated, whether it be praise, constructive criticism, typos, or whatever.  I don't want to put too much time and energy into this if nobody reads the books or cares about it.\r\n\r\nBut in the meantime... Enjoy! :)\r\n\r\n\r\n\r\n*NOTE* Two of the images in the description were taken from a google image search.  If you are the owner of this content and wish either to be credited for it or to deny me permission to use it, let me know.",
  "categoryId": "98",
  "version": "0.1",
  "author": "Dahveed",
  "createdUnix": "1385624900",
  "updatedUnix": "1385624850",
  "containsAdultContent": false,
  "uploadedBy": "Dahveed",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000083871",
      "name": "TheGame",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "TheGame-48233-0-1.rar",
      "uploadedUnix": "1385624850",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/2e4ef9a92b99a51104b73307845be81b5b44db8e1f0f2bad23a8bffa6925321c/analysis/1407811825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheGame-48233-0-1.rar?fid=1000083871&ttl=1535828367&ri=8192&rs=8192&setec=9eba65f766a5ba399e72ce29927b6626"
    }
  ]
}