{
  "modId": 48271.0,
  "modName": "Fireworks",
  "summary": "Create and use your very own fireworks&#33;",
  "descriptionHtml": "Fireworks\r<br />\r<br />Farengar has descovered a new branch of alchemy - pyrotechnics, after reading his book you too will be able to create your own fireworks at any alchemy workbench.\r<br />\r<br />Requirements: Skyrim V1.9\r<br />\r<br />Location: You will find Farengar&#39;s book on his table in Dragonsreach.\r<br />\r<br />Conflicts: May conflict with mods that alter alchemy or alchemy benches.\r<br />\r<br />Notes: There is a selection of fireworks you can create and they are designed for outdoor use, however you can use them indoors but it is not recommended for two reasons. First the effects can create mass havok apart from shouting there is no better way to make a complete mess of a place. Secondly I have a beast rig and after firing some of them off inside my cooling fans went into hyperdrive so be it on your own head if you melt your graphics card/s.\r<br />\r<br />Sparklers are re-niffed torches and behave similar, they to can be created at alchemy stations.\r<br />\r<br />You may notice a very short period between lighting the fuse where the firework goes invisible I had to do a positioning bug work around, annoying and I shouldn&#39;t have had to do it in the first place.\r<br />\r<br />Yes there are scripts on a great many spawned objects which may labour your computer, most of these are simple wait functions and then delete. There are recursive loops on some of the firework sripts so don&#39;t go pulling this mod out in the middle of a fireworks night. Not a clever idea to go pulling mods out with scripts anyway unless you plan a fresh game or go back to a save before the mod was installed. \r<br />\r<br />Upgrading: The perk that covers the fireworks has split into 2, the perk that existing players have now only covers the lighting of them and in order to create them yourself you need to read Farengar&#39;s book. If you already have read the book the mod adds the crafting perk at the start. \r<br />\r<br />Issues: I realised that there is a small problem with buying sparklers, due to the way the game applies scipts to only the 1st item in an stack buying more than the 1st will result in you having a set of non-functioning sparklers, if you do just sell them back and wait for respawn for more. I&#39;ll fix that in an update by simply reducing the number down to 1 lot of 12.\r<br />\r<br />Future plans: Fix any bugs that come up and I&#39;ll consider making more types of fireworks at a later stage.\r<br />\r<br />V1.1 Added Khajiit traders (Rango and Rislay) just outside Honningbrew meadery who sell fireworks (I decided this might be the best spot to reduce the risk of mod clashes). If you don&#39;t want to craft fireworks or have the perk simply don&#39;t read Farengar&#39;s book.",
  "categoryId": "27",
  "version": "V1.1",
  "author": "Mindboggles",
  "createdUnix": "1385694315",
  "updatedUnix": "1385848903",
  "containsAdultContent": false,
  "uploadedBy": "mindboggles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000084138",
      "name": "Fireworks",
      "version": "V1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "991",
      "fileName": "Fireworks-48271-V1-0.7z",
      "uploadedUnix": "1385694243",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5ef44991bc660c3737816077d1739b387577be5dd38dc8ca99d2b2c06dc443b2/analysis/1407812764/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fireworks-48271-V1-0.7z?fid=1000084138&ttl=1535828398&ri=8192&rs=8192&setec=b72e13d8a906a552de868b1c49d3113c"
    },
    {
      "fileId": "1000084679",
      "name": "Fireworks",
      "version": "V1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1339",
      "fileName": "Fireworks-48271-V1-1.7z",
      "uploadedUnix": "1385848903",
      "modVersion": "V1.1",
      "virusScanUrl": "https://www.virustotal.com/file/557ad1e01561fcfae32696b9786b34e562a91c61a0fa196f3613cd50d2adc91b/analysis/1407815120/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fireworks-48271-V1-1.7z?fid=1000084679&ttl=1535828399&ri=8192&rs=8192&setec=98c619084a8debfbca8e881f95a748ef"
    }
  ]
}