{
  "modId": 48281.0,
  "modName": "Family Life Series - Hjerim",
  "summary": "Modified version of Hjerim intended to work with Hearthfire Multiple Adoptions to provide a home for six children, instead of just two.",
  "descriptionHtml": "This file requires Hearthfires.  It is intended to work with Hearthfire Multiple Adoptions, but that mod is not required.\r\n\r\nMy first mod in this series is actually called Proudspire Mansion, which is a ridiculously large expansion of proudpire manor.  I spent way too much time on that mod, and have no intention of doing that again, but i did want to provide a realistic living situation in the other vanilla homes for a family of eight, namely, you, one spouse, and six children.  If you want room for lots of companions, and extra features, you might want to add the mansion to your collection as well.\r\n\r\nVery little to say about this mod.  all i really did was to expand the children's bedroom, add an extra dining table, set it up for six children, and fix the navmeshing for the new layout.  i really don't expect to do much more at this point.  only little touches like re setting the dining room table.\r\n\r\nSo far the testing has gone as follows.  I started a new game, went through the blood on the ice quest, and completed it just to make sure it wasn't bugging out that quest.  Then i purchased the home, moved six children in, and made sure they were all sleeping in their beds.  so far, everything has worked out fine, and i don't expect major troubles unless you do not follow instructions.\r\n\r\nFirst, if you have ever been in Hjerim in your current save, there might very well be problems with the home.  i suggest starting a new game with any modified vanilla home.  if you can find a way around this, please let me know.\r\n\r\nsecond, adopting six children can be kind of tricky.  the adoption system is buggy to begin with.  i suggest following instructions from one of my other mods, Children Of Honorhall Orphanage.  you can probably find ways of deviating from those instructions, but they are a good guideline anyway.\r\n\r\nRecommended mods\r\n\r\nHearthfire Multiple Adoptions\r\n\r\nNeutral Hjerim\r\n\r\nThis mod allows you to purchase Hjerim after completing the blood on the ice quest.  if you have troubles getting that quest to start, go to the console and type in help \"beware the butcher\" and additem that letter into your inventory.  voila, the quest starts.\r\n\r\nThis is the mod which got me started on COHO.  It provides the ability to adopt six children, instead of just two.\r\n\r\nCOHO (Children Of Honorhall Orphanage)\r\n\r\nAnother of my own mods.  This mod provides a simple way to adopt six sons, or six daughters quickly after starting a new game.\r\n\r\nStorefront\r\n\r\nThis mod gives your spouse an outside booth to operate her store from, where she will be during daylight hours whenever not in follower service.  this mod does not work with companions who have high level AI routines, but does work with simpler companions.  a truly fantastic idea, i highly recommend it.\r\n\r\nCredits\r\n\r\nTMPhoenix\r\n\r\nThe author of Hearthfire Multiple Adoptions.  TMPhoenix spent a lot of time getting me to have a functional understanding of making a home work with six children.  without his help, i would probably never have made it work.  unbelievable how patient he was with me.  i can not repay him, but i am willing to pass the favor on if someone else is bent on creating a home for use with his mod.\r\n\r\nPermissions.\r\n\r\nYeah, i don't owe anyone anything for this one, so feel free to do with it as you wish as long as you credit me.",
  "categoryId": "67",
  "version": "0.6",
  "author": "kar2nz",
  "createdUnix": "1385701869",
  "updatedUnix": "1385850139",
  "containsAdultContent": false,
  "uploadedBy": "kar2nz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000084178",
      "name": "Family Man Series - Hjerim",
      "version": ".5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Family Man Series - Hjerim-48281--5.7z",
      "uploadedUnix": "1385701838",
      "modVersion": ".5",
      "virusScanUrl": "https://www.virustotal.com/file/ba047372503569a12c4153c86d755bf5ceb2b883b13a3965765b95e225871ff0/analysis/1407812895/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Family%20Man%20Series%20-%20Hjerim-48281--5.7z?fid=1000084178&ttl=1535828408&ri=8192&rs=8192&setec=cfbdae7a7d28604a7f97aca013efab05"
    },
    {
      "fileId": "1000084690",
      "name": "Family Life Series - Hjerim",
      "version": ".6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Family Life Series - Hjerim-48281--6.7z",
      "uploadedUnix": "1385850139",
      "modVersion": ".6",
      "virusScanUrl": "https://www.virustotal.com/file/ec621255487f26447b386b846e39e0334dac5772a9bcc038c2f79e631ff844bc/analysis/1407815121/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Family%20Life%20Series%20-%20Hjerim-48281--6.7z?fid=1000084690&ttl=1535828408&ri=8192&rs=8192&setec=3f12f7c91945c928c1b7888184efe423"
    }
  ]
}