{
  "modId": 48290.0,
  "modName": "SkyFix - Unique Inn Signs HD",
  "summary": "Lore-enhancing, true HD retexture for all inn signs. Artwork and background textures are all unique to each sign and style is based on location/settlement. All artwork is handcrafted and all textures based on real-world HD photographs.\r<br />\r<br />3rd in SkyFix series",
  "descriptionHtml": "[center][img]http://i.imgur.com/mSNrnNK.png[/img]\r<br />\r<br />\r<br />[img]http://i.imgur.com/uhiDK1w.png[/img][/center]\r<br />[center][u][b][size=4]Unique Inn Signs HD[/size][/b][/u][/center]\r<br />\r<br />[center][b]Featured on Hot Files Dec 2013[/b]\r<br />[img]http://i.imgur.com/aAwlXXQ.jpg[/img][/center]\r<br />\r<br />[center][b]Current Version:[/b] [color=deepskyblue]1.4[/color][color=grey]\r<br />\r<br />[color=grey]If you like any mod and have a spare moment, why not hit that [img]http://i.imgur.com/avH9qSO.png[/img] button? It helps more than you might think&#33;[/color][/color][/center]\r<br />\r<br />[size=5][b][color=yellow]Introduction[/color][/b][/size]\r<br />\r<br />\r<br />[color=deepskyblue][size=5][u]The problems with Skyrim&#39;s vanilla inn signs.[/u][/size][/color]\r<br />\r<br />[size=5]&bull;[color=orange]1[/color]&bull;[/size] Firstly, they are low res and it looks as though none of the innkeepers bother to maintain the condition of their signs. The names on the signs are very faded and quite hard to read especially from a distance. It feels like the same artist did the artwork for all of the signs, because of the same &#39;black and white/washed-out&#39; drawing style. Some signs like the Vilemyr Inn do not even have distinct logos or artwork at all, making them look a little plain. Also having the same  &#39;frothy pint of mead&#39; logo on several of the signs was just cliché and generic (namely The Ragged Flagon and Dead Man&#39;s Drink and also Black-Briar Meadery if you count that as an inn).\r<br />\r<br />[size=5]&bull;[color=orange]2[/color]&bull;[/size] Secondly, the inn owners all, coincidentally, used the same low res weathered, moudly wooden background for their signs (you know that cardboard-ish thing) - hardly realistic or immersive Bethesda. We love you, but duplication does not equal realism nor immersion.\r<br />\r<br />[size=5]&bull;[color=orange]3[/color]&bull;[/size] Lastly, some of the sign artwork made little sense according to the lore of its inn, and instead Bethesda just came up with some random Norse design to make it look a bit more interesting. In some cases, the similarity of some of the inn logos to real-life ones is [u][b]uncanny[/b][/u] - [url=http://i.imgur.com/hLqlh4t.jpg]compare the sign logo for Nightgate Inn with the logo for the real-life Premier Inn [/url] (you know the chain with the Lenny Henry ads - watch it [url=http://www.youtube.com/watch?v=Y4Wrjh3cSWk]here[/url] if you are interested). Having a real-life inn chain in my Skyrim was not particularly immersive.\r<br />\r<br />[color=deepskyblue][size=5][u]How this mod fixes these problems (check the Features section for more details).[/u][/size][/color]\r<br />\r<br />[size=5]&bull;[color=orange]1[/color]&bull;[/size] All sign artwork is now 2k HD quality. All signs now have their own logos. The sign paintwork including lettering is all fully restored and redesigned (some are more redesigned than others). Duplicated artwork has been removed so each sign is more unique.\r<br />\r<br />[size=5]&bull;[color=orange]2[/color]&bull;[/size] Each sign has its own 2k HD unique background texture based on real-world HD photographs (Metal, Paint or Wood). Unique art style for all signs. Condition of background material is different for each sign, depending on the climate of the location and the standard of maintenance of the location (look in the Features section below for more information).\r<br />\r<br />[size=5]&bull;[color=orange]3[/color]&bull;[/size] I have tried to make the artwork fit better in to the lore of the inns, especially the signs with very generic, random artwork. Hopefully this will add that much-needed unique touch to the inns of Skyrim.\r<br />\r<br />The following inns are those that I felt did not convey the theme of their lore very well and were way too generic. The lore-themes for the inns are now as follows:\r<br />\r<br />&bull; [color=orange]Braidwood Inn[/color] has a Mining theme as it is in a mining settlement, Kynesgrove; \r<br />&bull; [color=orange]Silver-Blood Inn[/color] has a Dwemer/Mining theme as it is in Markarth and owned by the silver-mining family, the Silver-Bloods (instead of the vanilla&#39;s vampiric and bloody theme which I found slightly disturbing and unwelcoming. Travellers and visitors to the city would probably not be very attracted by this);\r<br />&bull; [color=orange]Windpeak Inn[/color] has a Pale Hold theme (with the four Pale stars representing each of the Old Holds);\r<br />&bull; [color=orange]Old Hroldan[/color] has a Tiber Septim theme as Eydis the inn-owner states that this is where Septim defeated an army of Reachmen in the Second Era and consequently rested;\r<br />&bull; [color=orange]Vilemyr Inn[/color] and [color=orange]Frostfruit Inn[/color] both have Rural/Natural themes as they are out in the countryside.\r<br />\r<br />[size=5][b][color=yellow]Features[/color][/b][/size]\r<br />\r<br />&bull; New 2k HD custom textures for all inn signs in Skyrim. Uncompressed to ensure minimal loss of quality and minimal texture artifacts (blockiness).\r<br />&bull; Unique inn sign background texture for each individual sign (Metal, Paint or Wood). No two inn signs use the same textures now (as opposed to vanilla Skyrim&#39;s duplicated wood texture for all of the inn signs).\r<br />&bull; Custom handcrafted painting for each sign (in many of the signs you can see the watercolor brushstrokes).\r<br />&bull; Sign name lettering now clearly legible instead of the old &#39;faded&#39; style of lettering.\r<br />&bull; Unique, distinctive and lore-enhancing theme for each sign.\r<br />&bull; Background textures are based on real-world HD photographs.\r<br />&bull; Background textures are unique to the architecture style of the settlement where the inn is located.\r<br />&bull; Background textures vary in their condition depending on the region. For example, inns in Imperial zones are well-maintained, like the inns in Dragon Bridge and Solitude. On the other hand, inns in harsher climates like those in Dawnstar and Winterhold or those in poorly-run settlements like Riften, have a more weathered and run-down look about them.\r<br />&bull; [b]This mod is [u]lore-friendly[/u] and [u]does not hurt FPS[/u]&#33;[/b]\r<br />\r<br />[size=5][b][color=yellow]Installation[/color][/b][/size]\r<br />\r<br />Use NMM or if installing manually just drag the data folder into your root Skyrim folder (the one with the.exe&#39;s).\r<br />\r<br />[size=5][b][color=yellow]Credits[/color][/b][/size]\r<br />\r<br />&bull; No assets from other mod authors are used in this mod, as the textures are all made from scratch, using real life photographs.\r<br />\r<br />[size=5][b][color=black]Sky[/color][color=white]Fix[/color][/b][/size] &bull; [size=5][b]Series[/b][/size]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/57959/?][img]http://i.imgur.com/vMZBD54.jpg[/img][/url]\r<br />[url=http://skyrim.nexusmods.com/mods/47036/][img]http://i.imgur.com/B8SWIyb.jpg[/img][/url]\r<br />[url=http://skyrim.nexusmods.com/mods/47488/?][img]http://i.imgur.com/BFFeJhV.jpg[/img][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/48290/][img]http://i.imgur.com/gwhiyrk.jpg[/img][/url]\r<br />\r<br />[size=5][b]Other Skyrim mods by the author:[/b][/size]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/40651/][img]http://i.imgur.com/FYzRA9Q.jpg[/img][/url]\r<br />\r<br />[size=5][b]Other mods by the author:[/b][/size]\r<br />\r<br />[url=http://www.nexusmods.com/farcry3/mods/50/][img]http://i.imgur.com/mBvuedc.jpg[/img][/url]",
  "categoryId": "29",
  "version": "1.4",
  "author": "CovertKish",
  "createdUnix": "1386820256",
  "updatedUnix": "1401474312",
  "containsAdultContent": false,
  "uploadedBy": "CovertKish",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086407",
      "name": "SkyFix_Unique Inn Signs HD 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "79049",
      "fileName": "SkyFix_Unique Inn Signs HD 1_0-48290-1-0.rar",
      "uploadedUnix": "1386814830",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1ea96a40c73ea6cb6c3cb1751e30b3daf1deef737e33aefa5a424f15732c8e9/analysis/1407832064/",
      "changelogHtml": " • Initial Release. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyFix_Unique%20Inn%20Signs%20HD%201_0-48290-1-0.rar?fid=1000086407&ttl=1535828417&ri=8192&rs=8192&setec=bac376f686b79baa7c5db29a7717802a"
    },
    {
      "fileId": "1000086463",
      "name": "SkyFix_Unique Inn Signs HD 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "89470",
      "fileName": "SkyFix_Unique Inn Signs HD 1_1-48290-1-1.rar",
      "uploadedUnix": "1386867596",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/54ee99c8e9673a7c621fa58a0946d27f424d774987d1d352596174a0992b3d5a/analysis/1407833011/",
      "changelogHtml": " • NEW FEATURE: Made sign artwork look more worn and aged by lowering the opacity and changing filters of paint layers.\r<br />• NEW FEATURE: Reduced color saturation a bit on most signs, especially Dead Man&#39;s Drink, Four Shields Tavern, Winking Skeever and Bannered Mare, Old Hroldan, Moorside Inn and Nightgate Inn.\r<br />• NEW FEATURE: Increased font size and changed font type of the Nightgate Inn sign, to look more lore-friendly and legible.\r<br />• NEW FEATURE: Changed font type of Four Shields Tavern sign in Dragon Bridge.\r<br />• NEW FEATURE: Added new sign: The Ragged Flagon in Riften of the Thieves Guild. Has unique HD artwork and background slate texture, relevant to the Thieves Guild lore. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyFix_Unique%20Inn%20Signs%20HD%201_1-48290-1-1.rar?fid=1000086463&ttl=1535828417&ri=8192&rs=8192&setec=21ff05f52a371a989bf52dc6a85ca5ad"
    },
    {
      "fileId": "1000086530",
      "name": "SkyFix_Unique Inn Signs HD 1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "89182",
      "fileName": "SkyFix_Unique Inn Signs HD 1_2-48290-1-2.rar",
      "uploadedUnix": "1386900542",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/04104a708061e87d223a0be3cbbf3fb2b3dec709c09411230078dfe6baa82d20/analysis/1407833976/",
      "changelogHtml": " • NEW FEATURE: Further reduced saturation on several of the signs to fit in better with Skyrim world, especially Dead Man&#39;s Drink.\r<br />• NEW FEATURE: Fixed the off-set artwork outline for the Bannered Mare sign. Restored color to horse and dragonborn but reduced color saturation of red lettering and white banner.\r<br />• NEW FEATURE: Added a lot of fine detail to Silver-Blood Inn sign and reduced color saturation quite a bit too.\r<br />• NEW FEATURE: Removed snowflakes from Frozen Hearth inn sign for a more Nordic and simple feel. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyFix_Unique%20Inn%20Signs%20HD%201_2-48290-1-2.rar?fid=1000086530&ttl=1535828418&ri=8192&rs=8192&setec=42092cf8d398f6476861780c00cb3d8a"
    },
    {
      "fileId": "1000087806",
      "name": "SkyFix_Unique Inn Signs HD 1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "105196",
      "fileName": "SkyFix_Unique Inn Signs HD 1_3-48290-1-3.rar",
      "uploadedUnix": "1387682392",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/fab0dbc40aaf3dafc6627409ede9ef329b47b871c20a24b476c46096a68f780b/analysis/1407852413/",
      "changelogHtml": " • NEW FEATURE: New sign: Black-Briar Meadery. HD, unique background texture and staying with vanilla design but removed the cliché and tacked-on &#39;frothy pint of beer&#39; below the flowers.\r<br />• NEW FEATURE: New sign: Honningbrew Meadery. HD, unique background texture and staying with vanilla design.\r<br />• NEW FEATURE: New sign: The Sleeping Giant Inn. HD, unique background texture and staying with vanilla design.\r<br />\r<br />• NEW FEATURE: Overhauled sign: Bannered Mare - made paintwork more natural and fitting to vanilla Skyrim by reducing color saturation slightly and adding a Grain Merge filter to the banner paintwork.\r<br />• NEW FEATURE: Overhauled sign: The Bee and Barb - rendered design much more natural-looking as if it has actually been painted on the wood beneath and weathered a lot. Reduced brightness of scrap wood background and added more dirt to the bottom of the sign in tune with the run-down reputation of Riften.\r<br />• NEW FEATURE: Overhauled sign: Braidwood Inn - brought back the vanilla Nordic design but upscaled it to HD and added two pickaxe heads to either side (as Kynesgrove is a mining settlement).\r<br />• NEW FEATURE: Overhauled sign: Candlehearth Hall - increased contrast and reduced brightness of background wood texture to look more natural and made paintwork on the wood merge better (added Grain Merge filter and reduced opacity slightly).\r<br />• NEW FEATURE: Overhauled sign: Dead Man&#39;s Drink - changed background texture to a natural cut oak to fit in with the woodland surroundings of Falkreath. Desaturated all color from paintwork and opted for a stencil and simplified design for a more unique style of logo and to look more natural.\r<br />• NEW FEATURE: Overhauled sign: Frozen Hearth Inn - brought back the vanilla Nordic design but upscaled it to HD and added some white and orange color to the artwork to give it more warmth.\r<br />• NEW FEATURE: Overhauled sign: Old Hroldan - removed white background of Tiber Septim painting to look more natural and less &#39;poster-ish&#39;. Changed font of lettering to more natural and fitting type. Made all paintwork merge better with background texture.\r<br />• NEW FEATURE: Overhauled sign: Ragged Flagon - made paintwork look more natural and merged with the material beneath. Made the eye part of the logo look more fitting to vanilla style.\r<br />• NEW FEATURE: Overhauled sign: Silver-Blood Inn - changed the texture of the dwemer shield to look much more vibrant and expensive-looking (sort of shiny) and added a slight 3D depth to the logo. Increased contrast of background for more detail and added a pickaxe behind the shield with the head visible at the top of the shield (as the Silver-Bloods who own the inn make their wealth from the silver mines).\r<br />• NEW FEATURE: Overhauled sign: Vilemyr Inn - made paintwork look more natural and merged with the material beneath. Increased contrast of background for more detail and vibrancy.\r<br />• NEW FEATURE: Overhauled sign: Windpeak Inn - drastically increased detail on all the paintwork and made it merge better with slate material beneath by adding a Grain Merge filter to it. Reduced brightness of the four star symbols. Increased contrast of background for more detail and vibrancy. Also added Grain Merge filter to the lettering for more a more detailed and natural look. Reduced opacity of font a little to look a bit faded from the cold climate&#39;s weathering effect. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyFix_Unique%20Inn%20Signs%20HD%201_3-48290-1-3.rar?fid=1000087806&ttl=1535828418&ri=8192&rs=8192&setec=4963ba4e7a0a77b6772f9f23eebb5280"
    },
    {
      "fileId": "1000111118",
      "name": "SkyFix_Unique Inn Signs HD 1_4",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "105976",
      "fileName": "SkyFix_Unique Inn Signs HD 1_4-48290-1-4.rar",
      "uploadedUnix": "1401474312",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/ac7e276679f85c6538085ae651265c9773e023136df3182f35d192a04060cb8d/analysis/1408103009/",
      "changelogHtml": " • NEW FEATURE: Overhauled sign: Moorside Inn - brought back vanilla art design, rendered HD with a unique wooden display board underneath the artwork with visible nail heads at the edges. Rendered to give impression of 3D depth.\r<br />• NEW FEATURE: Overhauled sign: Nightgate Inn - brought back vanilla font type and made new HD design more natural looking and weathered by reducing the opacity and adding a grain merge filter. Removed black and white border around the wolf and moon to look more simple and stylish. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyFix_Unique%20Inn%20Signs%20HD%201_4-48290-1-4.rar?fid=1000111118&ttl=1535828419&ri=8192&rs=8192&setec=7a45df7eb79bbd5252eaa03e62eb4cd2"
    }
  ]
}