{
  "modId": 48313.0,
  "modName": "Aetherius - The Ultimate Night Sky Moon and Galaxy Overhaul",
  "summary": "&#34;Our world was born from magicka, the creative force that informs and sustains all life. The sources of magic are the many and diverse heavens beyond the void, collectively known as the Aetherius.&#34;",
  "descriptionHtml": "[center][size=5][color=#6495ED][b]\r<br />[img]http://static2.nexusmods.com/110/mods/110/images/48313-1-1385830733.jpg[/img]\r<br />&#34;Our world was born from magicka, the creative force that informs and sustains all life. The sources of magic are the many and diverse heavens beyond the void, collectively known as the Aetherius. Aetherius, ancestral seat of the Nine Divines and the other original spirits, is the plane of pure magicka. Whereas Oblivion may surround us every night, it is aetherial energy that infuses our daily existence, from highest to lowest, and gives all the races of men, mer, and beast common purpose. Its magic brings the rain to the fields, love to our hearths, and scientific principles to our technological industries. It gives us the very Sun itself. Finally, Aetherius is the home to the Aedra, those cornerstones of the Mundus whose aspects we see in temple, in lordship, and the high walk of heroes.&#34; - Pocket Guide to the Empire, 3rd Edition\r<br />\r<br />&#34;The planets are the gods and the planes of the gods, which is the same thing. That they appear as spherical heavenly bodies is a visual phenomena caused by mortal mental stress. Since each plane(t) is an infinite mass of infinite size, as yet surrounded by the Void of Oblivion, the mortal eye registers them as bubbles within a space. Planets are magical and impossible.&#34;\r<br />\r<br />The plane of Aetherium is a strange and wondrous place. The lore, so it be called, is left open to interpretation, even those who stare up at the night sky each and every night, admit they do not really see what their eyes behold. For each and every being on Nirn the sky is said to appear slightly different, as it&#39;s actual appearance is far to difficult for the average mortal mind to understand. It is said the Dwemer in all their vast understanding, never once described seeing Massar and Secunda, one may simply brush this off as a simple disinterest in these dead plane(t)s. But another possible answer is, the Dwemer saw the sky more for what it is then the average mortal, and that Massar and Secunda are but what the average mind creates when staring up into the countless plane(t)s of Aetherius. But, the Dragonborn is not the average mind. You see, the blood of the god of Aetherius, Akatosh himself runs through your veins, and thus the illusion of the lesser mind is not placed upon you. So you, and you alone in this age can observe the plane(t)s of Aetherius in their true, indescribable majesty.\r<br />\r<br />Though the 8 Aedra are called the Gods, and that these 8 Gods make up the 8 Plane(t)s of the Gods, it is also said they are not the only beings in the Aetherial plane. They are many. They are diverse. The Aedra are what we call the 8 who selflessly created out world, but the Deadra are what we call the ones that selfishly meddle in our world. The Deadric planes are the Deadric gods and the planets of the gods, which is the same thing, just as they are the same as Aedra, just lesser. As lesser as one infinite thing can be from another. The Aedra and Deadra are not the only beings in the Aetherius, but the only ones that have an effect on the Mortal plane(t), in truth, there are countless diverse plane(t)s and gods, many of which keeps to themselves, and their own machinations.\r<br />\r<br />-----------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[u]Installation[/u]\r<br />\r<br />Download the file, and extract the &#34;Data&#34; folder from the &#34;Core - Main Files&#34; folder, and merge it with the &#34;data&#34; folder in your &#34;Skyrim&#34; folder (The one that contains SkyrimLauncher.exe) and make sure it overrights EVERY file it asks to overright&#33; (they are all texture files) This mod will NOT work or look right without every single one of these files. Then, open the folder for every option you want or need to install and extract the &#34;Data&#34; folder from each one, one by one, and merge it with your &#34;Data&#34; folder in the same exact manner described above. Install &#34;Low Res Galaxy DDS&#34; if you want to save FPS(make sure to install AFTER the main file then say YES when it asks to overright&#33;) install &#34;Climates of Tamriel&#34; folder if you use [url=http://skyrim.nexusmods.com/mods/17802/]Climates of Tamriel[/url], and install &#34;Moon Size ESP&#34; folder if you want to have larger moons like in the screenshots&#33;\r<br />\r<br />[url=http://static1.nexusmods.com/110/mods/110/images/48313-1-1385828970.jpg]HERE[/url] is a visual example of what your Data/Textures/Sky folder should look like, and how to make sure the mod is installed correctly&#33;\r<br />\r<br />-----------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[u]Questions and Answers[/u]\r<br />\r<br />Q] What happened to my stars?/Why are my stars shining through my planets? \r<br />A] This mod removes stars. If you try to install a star texture with this mod, the result will be very very glitchy and horrible looking, this is thanks to a limitation in skyrim&#39;s way of handling the sky, and there is nothing I can do about it without totally destroying every aspect of how this mod works. If you want a simple galaxy replacer with no planets and normal stars, go download one&#33; ^_^ There are about 50 of them.\r<br />\r<br />Q] My ENB exploded when I installed this&#33;\r<br />A] ENBs do that. It&#39;s not my fault. They are very finicky and glitchy, I designed this mod to work with them if they are reasonably designed, but as some have INSANE amounts of bloom there is simply nothing I can do to make this mod work with all of them short of making 900 patches for every ENB on the nexus.\r<br />\r<br />Q] Will this work with.... ?\r<br />A] Probably. This should work with anything that does not edit the night sky. This replaces EVERY texture in the night sky, and thus, you should not attempt to combined it with any mod that edits the NIGHT sky, or the sun texture. \r<br />\r<br />Q] How does it look with Climates of Tamriel?\r<br />A] AMAZING. Because it is designed to be used with it, and in fact the sun texture is edited from it&#39;s sun texture (with permission of coarse) Make sure to install the CoT optional files, or your sun might randomly change colors on you&#33;\r<br />\r<br />-----------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[u]Suggested Mods[/u]\r<br />\r<br />This is the Spiritual Successor to my other mod [url=http://skyrim.nexusmods.com/mods/32972//?]More Alien Skyrim[/url] if you like this mod, give that mod a look&#33; Please note, that these two mods are VERY incompatible with one another&#33;\r<br />\r<br />This mod is designed to work with [url=http://skyrim.nexusmods.com/mods/17802/]Climates of Tamriel[/url] and will look much better with it. It does not at all require it to work though, it just looks better then vanilla.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/27043/]Enhanced Lights and FX[/url] also looks great with this mod.\r<br />\r<br />I suggest the SweetFX mod [url=http://skyrim.nexusmods.com/mods/37846/]Ultimate Lighting Overhaul[/url] and my preset for it [url=http://skyrim.nexusmods.com/mods/48000/]Dramatic Cinematic[/url]. Combine this with ELFX and COT to get the exact look of my screenshots.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/33612/]Random Mod Title[/url] is another of my mods that allows you to play as Deadmau5 in skyrim. It has NOTHING to do with this mod, but what harm does a little self promotion on my own mod page do?\r<br />[/size][/color][/center][/b]",
  "categoryId": "74",
  "version": "0.91",
  "author": "ArtMurder",
  "createdUnix": "1385769181",
  "updatedUnix": "1385859131",
  "containsAdultContent": false,
  "uploadedBy": "ArtMurder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000084743",
      "name": "Aetherius",
      "version": "0.91",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8607",
      "fileName": "Aetherius-48313-0-91.7z",
      "uploadedUnix": "1385859131",
      "modVersion": "0.91",
      "virusScanUrl": "https://www.virustotal.com/file/97ee86d5eb5527f7be834a87271231bd3b66f6f68cd90a8278ddf3108f10dda7/analysis/1407815410/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aetherius-48313-0-91.7z?fid=1000084743&ttl=1535828438&ri=8192&rs=8192&setec=ba6b37e20c831c844013422bd22d25c8"
    }
  ]
}