{
  "modId": 4831.0,
  "modName": "Gives you all perks all ingredients and muuuch more",
  "summary": "This bat file gives you all perks, every ingredient 999 times (including the rare ones) 500 dragon souls, all ignots, dragonscales and bones, gold (99999), all enchantments (trough disenchant), all mapmarkers,soul gems and a much higher carryweight so you can carry that all!",
  "descriptionHtml": "This file is used to give people a great start in the game! It gives you basicly everything you need. Here\\'s a complete list of what this files brings to you:\r\nCarryweight will be set to 99999999+your starting carryweight\r\nYou will receive 99999 gold\r\nYou will get 99999 lockpicks\r\nYou will get 500 dragonsouls\r\nYou will get all the ingredients, including the rare ones (for example the jarrinroot) 999 times\r\nYou will get every single perk\r\nAll mapmarkers will be visible\r\nYou will get a lot of dragonscales and bones\r\nYou will get a lot of soulgems\r\nYou will get all enchantments (you will receive items, just disenchant and you will get the enchantment)\r\n\r\nInstalling and using:\r\nDownload the file, than move the Master.txt to your install direction.\r\nFor example: copy the file, and paste it to Computer>C>programfiles(x86)>TheElderScrollsV\r\nTo use it when your in game press the tile button (the button under escp and above tab) and type in bat master.\r\n\r\nDo NOT eat all the ingredients without godmode on! You will get killed instantly becuase theres a ingredient that deals around the 10k damage! So before eating open the console and type in tgm. That command enables godmode, so you cant die. When you are done eating, use the tgm command again, to turn off godmode.\r\n\r\nIf theres anything what needs improvemnt, comment and ill look it up. If I missed any item, comment. For the enchantments I know there is to a enchantment what gives extra damage to dragons, but for some reason you cant disenchant that item (dragonbane). If you wish anything else added to this file, comment! endoresments will be apreciated!\r\n\r\nI have not ripped off anything for this file. Ive made this all by myself using some skyrim sites for the ids of the items.",
  "categoryId": "40",
  "version": "1",
  "author": "BossB",
  "createdUnix": "1325155231",
  "updatedUnix": "1325155566",
  "containsAdultContent": false,
  "uploadedBy": "bossb",
  "primaryFile": null,
  "files": [
    {
      "fileId": "14769",
      "name": "Master",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Master-4831-1.rar",
      "uploadedUnix": "1325155566",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/468a4ebf43fcae0c0e8ae257855439b376d5eb43c44c234b2fc78d4a3bc328ff/analysis/1406567348/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Master-4831-1.rar?fid=14769&ttl=1535761059&ri=8192&rs=8192&setec=55e8d77b49c574e39e89b94e159d2cf6"
    }
  ]
}