{
  "modId": 48330.0,
  "modName": "Improved Fish by Blitz54 - Polish translation",
  "summary": "This is Polish translation of mod Improved Fish created by Blitz54, (original ENGLISH version\r<br />http://skyrim.nexusmods.com/mods/14320/ )\r<br />",
  "descriptionHtml": "This is Polish translation of mod Improved Fish by Blitz54, for original ENGLISH version\r<br />[url=http://skyrim.nexusmods.com/mods/14320/]http://skyrim.nexusmods.com/mods/14320/[/url]\r<br />Jest to spolszczenie modu Improved Fish autorstwa Blitz54 [url=http://skyrim.nexusmods.com/mods/14320/]http://skyrim.nexusmods.com/mods/14320/[/url]\r<br />\r<br />\r<br />Informacje:\r<br />Plugin dodaje do świata gry 19 gatunków dużych ryb oraz 33 gatunki małych rybek (w większości są to gatunki pasujące bardziej do akwariów, niż zimnych wód Skyrim, ale nie ma co wybrzydzać ;-) Niezwykle wzbogacają one rozgrywkę, dodając m.in. szereg składników alchemicznych i spożywczych, a po zastosowaniu patcha: [url=http://skyrim.nexusmods.com/mods/29620/]http://skyrim.nexusmods.com/mods/29620/[/url] stają się użyteczne w grze z RND. Poza tym (mimo mojego utyskiwania na ewidentne absurdy klimatyczno-geograficzne) jest on w istocie bardzo dobry i nie bardzo da się znaleźć dla niego alternatywę – a zatem należy brać to co najlepsze.\r<br />Więcej informacji na stronie moda: [url=http://skyrim.nexusmods.com/mods/14320/]Improved Fish[/url]\r<br />\r<br />Kilka słów o tłumaczeniu:\r<br />W przypadku wielkich gatunków starałem się konsekwentnie zachować ich polskie odpowiedniki nazw gatunkowych, a w przypadku gatunków japońskich (wg mnie odrobinę egzotycznie i zaskakująco wyglądają w realiach Skyrim) przywołałem ich oryginalne brzmienie (np. Amago i Tanago). W odniesieniu do Suma amurskiego (Amur Catfish) zdecydowałem się na formę - Sum północny (pokrewny gatunek), jako że przecież przez Skyrim żaden Amur nie przepływa.\r<br />Jeśli chodzi o małe gatunki, to jako się rzekło, pomysł by pływały w zimnych skyrimskich wodach jest dla wg mnie osobliwy, a osobiście wolałbym zobaczyć raczej jakieś okonie, uklejki, czy też pospolite śledzie w morzu, ale taka jest wola autora i inaczej być nie może :D \r<br />Przy tłumaczeniu ich nazw starałem się zachować oryginalną nazwę w polskim brzmieniu, ale najczęściej zmuszony byłem improwizować, odwołując się do nazw znanych ryb akwariowych dopasowując jedynie w części nazewnictwo gatunkowe do brzmienia oryginalnego (np. Plum Foby w wersji polskiej prezentuje się jako Kirysek śliwkowy). Oczywiście jednemu będzie to odpowiadało, a innemu nie; nic nie stoi na przeszkodzie by dopasować je do własnych wymagań za pomocą Translatora - rzecz jasna na osobisty użytek&#33; Jeżeli w tłumaczeniu znalazły się (co zawsze możliwe) rażące błędy, proszę o uwagi na ten temat.\r<br />\r<br />\r<br />Instalacja:\r<br />Do działania potrzebujesz oryginalny mod w wersji 3.3. Po zainstalowaniu go, pobierz i nadpisz spolszczenie.\r<br />Jeżeli Autor umieści kolejne wersje moda, spolszczenie zostanie uzupełnione.\r<br />\r<br />Uwagi końcowe:\r<br />Proszę o wszelkie uwagi odnośnie jakości tłumaczenia. Jeżeli autor modu zamieści kolejną jego wersję, postaram się możliwie szybko zaktualizować tłumaczenie.",
  "categoryId": "83",
  "version": "3.3",
  "author": "rytumich",
  "createdUnix": "1385813053",
  "updatedUnix": "1385813050",
  "containsAdultContent": false,
  "uploadedBy": "rytumich",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000084507",
      "name": "Improved Fish by Blitz54 polish translation",
      "version": "3.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Improved Fish by Blitz54 polish translation-48330-3-3.rar",
      "uploadedUnix": "1385813050",
      "modVersion": "3.3",
      "virusScanUrl": "https://www.virustotal.com/file/54d5da870304b7e8bb4291d8c178ee59769b7eb35611fa85113e18f61ea9fbb1/analysis/1407814394/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Fish%20by%20Blitz54%20polish%20translation-48330-3-3.rar?fid=1000084507&ttl=1535828455&ri=8192&rs=8192&setec=badd6aa297c61357055a6d2db6e795c6"
    }
  ]
}