{
  "modId": 48355.0,
  "modName": "Atomic Bomb Mod",
  "summary": "Adds three new spells, Atomic Bomb, Phantom Wind, and Flame On. All spell tomes found in Breezehome on the ground in front of fire pit.",
  "descriptionHtml": "\"Is your skyrim tedious? Do you charge into a Dragon's face, just to become food? DO YOU LIKE MUDK-I MEAN MAGIC? Then let me introduce the Doomball 2.0. It will let you nuke a dragon from a safe distance, no more dragon food.  And if you buy today You get an extra bang for your buck, Cosmic Gust, Guaranteed to Fus your enemies into oblivion. And there is more, you also get a handy-dandy flamethrower, so you can stay warm in those cold arctic areas. Stop by Gus' Magic Emporium, located inside the Famous College of Breezehome.\r\n\r\nWarning: may cause Extreme pain, Third Degree Burns, loss of hair, and possibly life. Gus' Magic Emporium is not an actual shop, nor is it located in the college of breezehome, nor does said college exist. consult Septimus for any questions regarding symptoms and effects they might have on the body...also cheese.\r\n \r\nThis message has been approved by the Lord of Fun, and Cheese, The Deadric Prince Sheogorath.\" \r\n\r\n Adds three new spells, Atomic Bomb, Phantom Wind, and Flame On. All spell tomes found in Breezehome on the ground in front of fire pit. Atomic Bomb is a fireball that has a huge blast, Flame on is equally powerful but easier to target one enemy, and Phantom Wind is a devastating gust of wind that will throw enemies at least 1000 ft!!! ",
  "categoryId": "75",
  "version": "1.0",
  "author": "UpRiZ3N",
  "createdUnix": "1385838303",
  "updatedUnix": "1385838289",
  "containsAdultContent": false,
  "uploadedBy": "upriz3n",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000084624",
      "name": "Phantom Wind",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Phantom Wind-48355-1-0.zip",
      "uploadedUnix": "1385838289",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6a86f834b58bbd70d019255ce871f69b0d370758465998a160184cb46a227c84/analysis/1407814904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phantom%20Wind-48355-1-0.zip?fid=1000084624&ttl=1535828488&ri=8192&rs=8192&setec=a48d36543ecc8397e7103c82f10a54dd"
    }
  ]
}