{
  "modId": 48379.0,
  "modName": "Stealing Sovngarde",
  "summary": "The Thalmor have discovered certain artifacts that allow them to launch an assault on Sovngarde, the realm of Skyrim&#39;s honored dead. Only one person is crazy enough to stop them -- you.",
  "descriptionHtml": "The dark taint of the Thalmor has corrupted Sovngarde&#39;s Hall of Valor, its effects rippling through the realms to the land of the living. In Stealing Sovngarde, you must journey to a mysterious island and discover what the altmer have been trying to keep hidden; a massive underground complex built atop an ancient Nordic crypt. Many foes, some elven, some not quite alive, will try to stop you \r<br />\r<br />Stealing Sovngarde is my third mod for [i]The Elder Scrolls V: Skyrim[/i]. With it, I have branched out from previous mods and have learned a few new tricks such as creating world spaces, scripting more complex encounters, and generating LOD. As such, it is by no means a masterpiece, but do try to have some fun with it&#33;\r<br />\r<br />[b]Installation[/b]\r<br />To install, simply extract the contents of the .zip file into your Skyrim/Data folder (usually found at Program Files/Steam/steamapps/common/Skyrim). When the game&#39;s launcher loads up, make sure the stealingsovngarde.esp data file is enabled before starting the game.\r<br />\r<br />[b]Questions/Comments[/b]\r<br />Please feel free to drop a comment below or message me privately with any questions you may have, bugs you&#39;ve encountered, comments or feedback. \r<br />\r<br />[b]Changelog[/b]\r<br />Version 1.1: Added a quest marker to the entrance of the crypts\r<br />\r<br />Version 1.2: Removed the portcullis leading to Ersantus&#39;s room\r<br /> ",
  "categoryId": "35",
  "version": "1.2",
  "author": "Lysogen",
  "createdUnix": "1385860690",
  "updatedUnix": "1421597815",
  "containsAdultContent": false,
  "uploadedBy": "Lysogen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000143397",
      "name": "Stealing Sovngarde",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5082",
      "fileName": "Stealing Sovngarde-48379-1-2.rar",
      "uploadedUnix": "1421597815",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6451ec962ed868a632950e883bd08ab8b337cf4a948ac32131ced704c1018f4d/analysis/1421597833/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stealing%20Sovngarde-48379-1-2.rar?fid=1000143397&ttl=1535828514&ri=8192&rs=8192&setec=3bc3f76552ad8240a7ebd2a420815fd6"
    }
  ]
}