{
  "modId": 48387.0,
  "modName": "REAL uGRIDS to load SOLUTION and MORE",
  "summary": "After 2 years of trying i finally work around uGridstoload problem.",
  "descriptionHtml": "                              ===== =SOLUTION FOR STABLE UGRIDS and MORE========= \r<br />                                                                including \r<br />no CTD&#39;s, improved performance, smoooth gameplay, more effective handling with scripts, very far effective range of view , smooth cell transitions etc.   ========================================================================================\r<br />             ========== Dedicated  to all passionate people who loves Elder Scrolls =============\r<br />                               \r<br />[url=http://www.nexusmods.com/fallout4/mods/238/?][b][color=#ffff00][size=5][u][CLICK HERE&#33;] FALLOUT 4 VERSION - WORKING GREAT - [CLICK HERE&#33;][/u][/size][/color][/b][/url]\r<br />\r<br />\r<br />[Better use PDF file in download section as it contains more info (extras) and is very clear to read]\r<br />\r<br />\r<br />Updated 11th of Evening Star , version 1.8 (7th update from 1st of Evening Star ) \r<br />\r<br />[all it is still working and kickin&#33;]\r<br />\r<br />[Changes into 1.8 :\r<br />ive introduced really stable for everyone (not only some people like before) solution , which is based on having view range etc. like at ugrids set even on 9-11 BUT with keeping deafult uGridstoload=5, really worth a try if other solutions are not working for Your config\r<br />ive made small changes into this document, making it even more clear\r<br />ive introduced two new lines into ini, which will take Your breath away ;)  ]\r<br />\r<br />It is not a .esp mod , it requires some reading and understanding, it is Solution and it also describes way i get to that solution .   \r<br />It is working for me and i ve tested it for many days without single CTD or hard freeze, i don&#39;t have any scripting problems etc. and im speaking the truth. \r<br />\r<br />Ive done it for myself and decided to share my ideas with the rest of our community becouse im just happy i get it to proper working at least after 2 years of &#34;ugrids frustration&#34; ;) \r<br />\r<br />I will be happy to help anyone i could to get it working if i only have time and skill to do that becouse every setting is different from another. \r<br />\r<br />Overall idea:\r<br />As i said before i don&#39;t treat this as a MOD , it is OUR solution fo US all , the people who want stable ugrids=7 at wide range of configs or at all ;) and smooth working Skyrim with many mods and heavy scripts.\r<br />\r<br />Everyone who will help or write his or her comments, findings, notes, is author of this solution as good as i am. I decided to place and  share my personal Solution and ideas to the community becouse it works for me and i hope we can make it work for anyone else&#33; \r<br />\r<br />We are , after all, best crpg community on the web for Elder Scrolls greatest cRPG series ever created.\r<br />(yes, i was playing Ultima too, many years ago ;)  )\r<br />\r<br />POSITIVE SIDE EFFECTS even if MAIN SOLUTION and ALTERNATIVE SOLUTIONS doesn&#39;t work for your configuration yet:\r<br />\r<br />\r<br />1- You will notice much less stuttering in places with lot of scripts and actors going on for example:\r<br />useful when playing with Tundra defense mod,  helping on large battles with a lot of npc, useful when using Populated cities mod, and so on, overall it will help you in these cases.\r<br />\r<br />2- Your Skyrim will use more available resources in more efficent way and handle better\r<br />(for example with many heavy scripted mods aboard , and still give You more stable gameplay) . \r<br />\r<br />3- You will gain more knowledge how to proper manage mods and Skyrim at all.\r<br />\r<br />4- You will have less CTD from scripts and complicated mods\r<br />PREFACE:\r<br />\r<br />Well, im playing with ugrids from Oblivion times, and a lot from Skyrim 11.11.2011 release.\r<br />(Whole series from orginal Arena)\r<br />\r<br />I have nice rig, quad 2 intel Q9550 overclocked, 8gb ram, asus geforce 780 direct2cu oc . \r<br />Im also big fan of Elder Scrolls and modding too.\r<br />\r<br />For Skyrim , right now i have around 240 mods installed and active (hell lot of hd tex, ENB , weather etc. too) , i know how to use Wrye Bash, TesEdit, call me experienced user.\r<br />[Load order in extras too , at the end of PDF]\r<br />\r<br />Getting Started:\r<br />\r<br />For general , be sure your Skyrim have was checked by Wrye Bash, you have no conflicting mods (missing masters, right instalation method and load order etc.), you made bashed patch, and etc.\r<br />Here you have great tutorial, please spend these 5 minutes to read:\r<br />BE SURE when playing with mods to READ Wrye Bash Pictorial Guide, and create Bashed Patch and later use MOD CHECKER from Wrye Bash to eliminate all errors. Then go to play with given ugrids solution&#33;\r<br />\r<br />Pictorial Guide for Wrye Bash on Nexus:\r<br />http://oblivion.nexusmods.com/mods/35230\r<br />It is great too for Wrye Bash for Skyrim too&#33;&#33;&#33;\r<br />\r<br />I will not say anything more about BOSS and correct load order as it is for sure well known for everyone who know that mods for Skyrim exists.\r<br />\r<br />For some extra clearing you can use TESEDIT too.\r<br />\r<br />Also you will need at least quite good PC (minimum 4gb ram, and 1gb GPU, and quad like processor) for main solution, ive already done some solutions for lower spec Pcs too.\r<br />\r<br />If you don&#39;t care about mod load order, lack of mod conflicts and not even know what is BOSS or Wrye Bash start from the 0 and learn about them, make your Skyrim with mods pretty clean, without any conflicts. Then advance further. \r<br />It is extremely important&#33; For example , when i have long break from Skyrim and get back to it i spend at least few hours (it often takes me 2-3 days becouse i lack time for gaming) just for updating mods and chceck thier structure (load order, comptability etc.). \r<br />Only after that im sure i can play.\r<br />\r<br />\r<br />\r<br />My discovery (short story about very long research and experience):\r<br />\r<br />Now finally i have stable ugrids but AFTER i made small tweak to well known settings, and using this dll file helped me a lot becouse i was free to experiment without taking care of saves\r<br />[great file btw Altimor – endorsed], i ve also my Skyrim working smooth as butter and CTD free .\r<br />\r<br />Im using ugrids 7 becouse rest of higher ugrids makes bad things happens at various mods (quests/scripts) and vanilla quests , trust me im playing with these settings for 2 years ;) and having a few weaks of gaming fuc..d up is not worth using 9 instead of 7 without editing specific ugrids (read later on). After introducing new lines few days ago now, im able to get back to ugrids 5 with range of view from ugrids even at 9 ;).\r<br />\r<br />\r<br />\r<br />\r<br />But there WAS ONE THING I NEVER TRIED for Skyrim uGrids, i always followed that stupid formula for exterior cell buffer : 36 / 64 /100 / 144 etc. \r<br />And i was thinking only on ugrids &#33; But it is a lot wider thing, and we need correct perspective to\r<br />make that game working good.\r<br />Well , even with this litttle mod (AltimorFP &#34;StableuGrids&#34;) i still get crashes while zone transitions (when engine was forced to load new cells - its a simple limitation of engine).\r<br />\r<br />I ALSO COMPLETLY CHANGED attitude to PRELOADSIZELIMIT read further for details.\r<br />\r<br />I know its completely unlogic but HEY, SCREW THE MATHEMATICS for a moment (it&#39;s joke only, i love maths)&#33; \r<br />Its working, and yes keeping high range detail views&#33;\r<br />\r<br />It looks like engine was choking and don&#39;t have enough &#34;air&#34; at exterior cell buffer set to 64 while ugrids was 7 while having preloadsize limit at default or just too low modified. \r<br />But not only that so please read further.\r<br />\r<br />=======================================================================\r<br />MAIN SOLUTION \r<br />[ UPDATED becouse discovery of new lines, made modifing uGridsToLoad line just an extra thing] :\r<br />(which is working for me and my configuration, and also a lot of people)\r<br />\r<br />[[[[[[[[[[[[[[[[[[[[[[[[[[[ READ CAREFULLY]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]\r<br />\r<br />What is a Exterior cell?\r<br />„Exterior cells belong to a Worldspace, and are part of the worldspace&#39;s landscape, which is basically a grid that extends infinitely in all directions. \r<br />Each exterior cell is 4096 units by 4096 units (or approximately 192x192ft or 58.5x58.5m). \r<br />Each vertex in an exterior cell is 128 units (6ft) apart. „ (cit. from official CK Wiki)\r<br />\r<br />What is a Worldspace?\r<br />„A world space is simply an entire world, with its own landscape, sky and weather. All exterior cells belong to a worldspace -- in Skyrim, most of the exterior is in the Tamriel worldspace, but there are many more worldspaces used in the game, and adding a new worldspace is relatively simple.\r<br />Worldspaces can share landscape with a Parent worldspace (for example, all the city worldspaces in Skyrim have Tamriel as a parent), or they can use an entirely different landscape (for example, the Sovngarde worldspace).” (cit. from official CK Wiki)\r<br />\r<br />FIRST STEPS:\r<br />So enter your Skyrim.ini look under [General] section and copy/paste below 3 lines \r<br />(JUST FOR START it will be changed later&#33; It is for making you better at modifing lines and know anything about these lines):\r<br />\r<br />uGridsToLoad=7                      / [modified in other solutions now]\r<br />uExterior Cell Buffer=64         / [modified in other solutions now]\r<br />bPreemptivelyUnloadCells=1  / [If we set it to 1 it can offer more stable gameplay]\r<br />\r<br />Then save, and check ingame.\r<br />\r<br />OF course use mod by AltimorFP &#34;StableuGrids&#34; becouse it let you revert to previous safe uGrids settings (ugrids=5 /cell buffer = 36) without losing save or character or using console \r<br />[place .dll file into SKSE plugins directory] and freely experiment with various settings.\r<br />LINK for the mod: http://skyrim.nexusmods.com/mods/41592\r<br />\r<br />Im using SafetyLoad by Kaeper also (little mod here on Skyrim Nexus, (download extract and put into SKSE / plugins folder in Skyrim data directory) .\r<br />\r<br />&#34;BUFFER&#34; means place for temporary storing something, well it looks logical to me when we use hell a lot of textures, supported by ENB profiles and other graphical and heavy scripted mods (like quest mods, mechanic mods) , each cell of the world (and in this engine whole world of Skyrim is divided into cells) takes more place than programmers planned. \r<br />\r<br /> EXTERIOR CELL BUFFER is STRONGLY CONNECTED with  PRELOADSIZELIMIT\r<br />\r<br />\r<br />I also changed (hidden) line in Skyrim.ini , to match my setting.\r<br />Im talking about &#34;iPreloadSizeLimit= &#34; , default like in Oblivion was funny low (around 25mb , up to 250mb&#33; on some forums ;-) ) \r<br />\r<br />Why it is important, becouse it is strictly connected with Cell Buffer Size , imagine it is a power reserve for working cells, when it gets low all breaks up.\r<br />I decided to go full (i have 8gb RAM) and set it to 4 GB Ram from for matching my exterior buffer value. \r<br />So we must do some maths here,just think this way  lets take often given &#34;max&#34; value for\r<br />\r<br />iPreloadSizeLimit= 262144000   \r<br />(funny low anyway, but we are brave, huh?) what it is , how much it is?\r<br />Well it is simple : divide it by 1024 to get number of kB, and then divide again by 1024 to get MB. \r<br />\r<br />So it is only 250Mb .\r<br />\r<br />What the hell is 250mb? I have more memory in my phone:) .\r<br />\r<br />I decided to make it 4gb so i need value 1gb first, so 1gb is 4x250mb , so 4 x 262144000 = 1048576000\r<br />so now i need 4x1 gb so 4 x 1048576000=4194304000\r<br />\r<br />So value we need for 4gb Ram for preloaded size is 4194304000,\r<br />so in the end this line should look like that (i keep in mind that i have 8gb ram in my computer):\r<br />iPreloadSizeLimit= 4194304000\r<br /> If it is too much try 2gb (so 4194304000 divided by 2 = 2097152000)\r<br />If that is too much too , then try 1gb  (so 1048576000)\r<br />\r<br />I have also discovered new lines (it takes me a lot of time, especially for uStaticNeverFade....), which will change a lot, even for previous (already working for many people) solutions, so please read further&#33;\r<br />\r<br />\r<br />We have similar (but hidden) INTERIOR BUFFER for interior cells, while buffer from above is for EXTERIOR cells (everything outside dungeons, homes, castles, inns) for open world.\r<br />\r<br />And i just imagined that we let that old engine handle 7 grids full of cells to work at once , with all that mods and oly 64 of &#34;somethnig&#34; buffer and i know that (HIDDEN normally) line of preload size limit gives us about 25 up to 50 mb memory for „operating” these buffer and cells.\r<br /> And what if that means some kind of memory space? Why not let it use more and see what happen? ;) \r<br />\r<br />\r<br />Now i don&#39;t have any freezes and CTD, only delicate, lasting 1-5 miliseconds freezes while i have cell transition, and not every time, also my  game behaves better in terms of stuttering and other crashes /slowdowns or scripting errors when using high density npc mods, or just heavy scripted mods (read futher )\r<br />\r<br />My current [modified after new lines discoveries][General] section of Skyrim.ini looks like that (included below in extras too):\r<br />\r<br />[General]\r<br />sLanguage=ENGLISH\r<br />\r<br />uGridsToLoad=5\r<br />uExterior Cell Buffer=64\r<br />bPreemptivelyUnloadCells=0\r<br />iPreloadSizeLimit= 4194304000\r<br />bUseHardDriveCache=0\r<br />bUseBackgroundFileLoader=1\r<br />bSelectivePurgeUnusedOnFastTravel=1 \r<br />uStaticNeverFade=1\r<br />iPostProcessMillisecondsLoadingQueuedPriority=5\r<br />bForceFullLOD=1\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />                   M A I N SOLUTION                                \r<br />                     – updated in 1.8 –                                 \r<br />                NEW LINES are here&#33;                                        \r<br />\r<br />[General]\r<br />sLanguage=ENGLISH\r<br />\r<br />uGridsToLoad=5\r<br />uExterior Cell Buffer=36\r<br />bPreemptivelyUnloadCells=0\r<br />iPreloadSizeLimit= 4194304000      /if You have 4gb Ram only then divide by 2\r<br />bUseHardDriveCache=0\r<br />bUseBackgroundFileLoader=1\r<br />bSelectivePurgeUnusedOnFastTravel=1 \r<br />uStaticNeverFade=1\r<br />iPostProcessMillisecondsLoadingQueuedPriority=5\r<br />bForceFullLOD=1         /not for weak GPU\r<br />\r<br />If that gives you no desired effect go below and read ALTERNATIVE SOLUTIONS for previous methods  which are working too  for  a lot of people,  just read further.  \r<br />\r<br />                              \r<br />\r<br />\r<br />\r<br />                          NEW LINES WORKSHOP and DISCOVERIES                           \r<br />                     as i tweak engine „lines” a bit for myself, today:                                      \r<br />\r<br />\r<br />1. uStaticNeverFade=1     I&#39; ve  introduced that line yesterday, it should make all „Static” class objects (for example elements of landscape like bridges, buildings, sculptures, rocks, etc.) should remain always visible, no more pop-ups. It works for me very well .  \r<br />\r<br />\r<br />AND WHAT IT IS MORE INNOVATIVE it should let You keep ugrids=5 \r<br />(at default level ) - while KEEPING VIEW range of even uGRIDS = 9 and not using SCRIPTS in more distance than SAFE 5-7 ugrids;)\r<br />so it should be safe for those with weak computer&#39;s configs.\r<br />\r<br />Try for example:\r<br />uGridsToLoad=5                    \r<br />uExterior Cell Buffer= 36      \r<br />bPreemptivelyUnloadCells=0\r<br />iPreloadSizeLimit= 4194304000              /  for systems with 4GB ram divide by 2\r<br />bUseHardDriveCache=1\r<br />bUseBackgroundFileLoader=1\r<br />bSelectivePurgeUnusedOnFastTravel=1 \r<br />uStaticNeverFade=1                    /  NEWLY INTRODUCED\r<br />iPostProcessMillisecondsLoadingQueuedPriority=5\r<br />\r<br />2. bForceFullLOD=1  this line will take your breath away as good as that one above;), for example it will make trees visible in high details from very very far [do You like looking at Throat of the World from Solitude castle ? ;) ] \r<br />\r<br />I will introduce some more of my own lines soon.\r<br />\r<br />\r<br />??????????????????????QUICK EXTRA TIP AND ANOTHER SOLUTION????????????\r<br />\r<br />Maybe some of You  don&#39;t scroll to the last lines of description (or PDF file) , just do it, i spend some hours over my Oblivion times notes, it maybe extra workaround for those with small amount of ram (2gb for example). I almost sure engine in Skyrim is mainly based on Oblivion one, with small adjustments.\r<br />\r<br />In Oblivion there was (also hidden) line for ugrids were we can control not WHOLE GRID but elements of it&#39;s cells.\r<br />\r<br />For example i was interested in seeing only more trees at longer distances not whole grid and all &#34;cells&#34; elements inside:\r<br />\r<br />\r<br />so i could add (into ini file, in that example oblivion.ini) :\r<br />\r<br />uGridDistantTreeRange=20 - given tree visible distance\r<br />uGridDistantCount=30 - kind of controller of real viewable distance without it you will see no difference\r<br />\r<br />Feel free to experiment with value =20 give it 30/40/50 maybe more , but always \r<br />remember to make value of  uGridDistantCount higher.\r<br />\r<br />\r<br />so maybe try (i can&#39;t say it will work in Skyrim but it should as the engine is almost the same) and make possible addons under [general] in Skyrim.ini :\r<br />\r<br />uGridDistantTreeRange=20 \r<br />\r<br />uGridDistantRocksRange=20 (don&#39;t know maybe rock/rocks/something, check editor for engine names)\r<br />\r<br />uGridDistantFloraRange=20\r<br />\r<br />uGridDistantObjectsRange=20\r<br />\r<br />uGridDistantGrassRange=20\r<br />\r<br />uGridDistantActivatorRange=20\r<br />\r<br />uGridDistantActorRange=20\r<br />\r<br />for example:\r<br />\r<br />uGridDistantStaticRange=20 \r<br />\r<br />(or something like that you must dig into  engine trough CK editor for specific  names) \r<br />for example:\r<br />\r<br />\r<br />IN CK (Creation Kit) all „static” have „Flags” that describes that they are visible or not from specific distance, they are as follows : \r<br />\r<br />Has Distant LOD: „Check if this object should be visible in LOD beyond the 5x5 loaded area. \r<br />You must specify LOD meshes if this is checked.”\r<br />\r<br />AND maybe it is a MAIN reason for some elements like rocks/waterfalls etc. not being visible for us , maybe we don&#39;t need to play with ugrids but instead we should „give” all other „elements” that could be visible like actors, trees, rocks,buildings, animals, etc. ,  Has Distant LOD factor (at least in CK), but it looks like serious addon for creation kit and engine itself.\r<br />Maybe Beth can do that or some skilled modder/programmer\r<br />\r<br />Look for example at element in CK Object Window/World Objects/Static/Landscape/Bridge01\r<br />\r<br />Click RMB on Bridge01 and see it has unselected  values:\r<br /> „Has distant Lod”\r<br />„Uses high detail LOD Texture”\r<br />„Never fades” \r<br />\r<br />just tick them on save and see what happens ;)\r<br />\r<br /> Specify Distant LOD Meshes...  Opens a new dialog to let you pick LOD meshes for an object.\r<br />\r<br />\r<br />Never Fades: „ Instances of this object will ignore distance fade settings, thus always being displayed.  „    it also need to be implemeted to other „elements of the cells” \r<br />\r<br />Generally looks like we have one another workaround for good distance view without cell elements poping up out of nowhere and having good LOD at higher distances.\r<br />\r<br />\r<br />Feel free to make them and also other objects visible manually and make some great ESP if you have a lot of time, i think that editing vanilla objects will be enough for start.\r<br />If you make it and create best mod in the world just remeber to credit me ;).\r<br />Im also slowly working for kind of that mod but it&#39;s a secret ;).\r<br />\r<br />uGridDistantCount=30 (for general view distance (try to keep proportions with above settings this must be always little more than above distances for specific elements)\r<br />Best sneak and dig into Creation Kit for Skyrim and take names of elements you wish to make visible, (this way i think we can make only some elements visible and bypass SCRIPTING errors with ugrids settings over safe 7 too. (for example when we set ugrids=9 or ugrids=11 it makes a whole lot of bad hings to the scripts (events, quests, mechaincs), this way i think we could benefit of selectable elements being viewable from high distance WITHOUT setting MAIN uGRID to 7 or more. Worth checking,especially on cofigs where MAIN SOLUTION doesn&#39;t work fully.\r<br />\r<br />BUT FIRST DISCOVER HOW THESE ELEMENTS ARE NAMED FOR THE ENGINE (rocks, mountains, buildings etc.) , i will start from Creation Kit or some engine wikis etc.\r<br />??????????????????????????????END of QUICK TIP?????????????????????????????\r<br />\r<br />OLD FASHIONED WAY\r<br />&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;ALTERNATIVE SOLUTIONS &#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;\r<br />\r<br />for Those who don&#39;t want to use newly introduced lines and want to use my „old” [it was just 1st December ;)  ] solutions :\r<br />\r<br />(A)  For people with only 4gb ram , older CPU (like core2duo , older quads and other) and quick harddrive like ssd or &#34;old&#34; normal harddrive , and medium range or low-end GPU\r<br />\r<br />uGridsToLoad=7\r<br />uExterior Cell Buffer=34 (you can try setting it lower [keep +/- 2 rule 34/32/30 or 38/40/42]  or higher) it may look stupid to set this to 34 or default 36 but please read futher ;)\r<br />bPreemptivelyUnloadCells=1\r<br />iPreloadSizeLimit= 2097152000  (if you have 1gb ram , God bless you, but you can still try to fight just set it to nothing more than 1048576000 and better divide it by 2 , be sure then to set hard rive cache to 1 too)\r<br />bUseHardDriveCache=1      (set to 0 if you have normal, &#34;old&#34; hard drive, or something is wrong)\r<br />bUseBackgroundFileLoader=1\r<br />iPostProcessMillisecondsLoadingQueuedPriority=5\r<br />\r<br />(B)  For people with 8gb ram and quick harddrive like ssd or &#34;old&#34; normal harddrive and GPU with 1gb vram\r<br />\r<br />uGridsToLoad=7\r<br />uExterior Cell Buffer=36    (as above in point A, you can slightly modify this and look above for specific ugrids visible -extra tip- ) it may look stupid to set this to 34 or default 36 but please read futher ;)\r<br />bPreemptivelyUnloadCells=1\r<br />iPreloadSizeLimit= 4194304000\r<br />bUseHardDriveCache=1      (set to 0 if you have normal, &#34;old&#34; hard drive)\r<br />bUseBackgroundFileLoader=1\r<br />iPostProcessMillisecondsLoadingQueuedPriority=5\r<br />\r<br />(C)  For people with 8gb or more ram and quick harddrive like ssd or &#34;old&#34; normal harddrive and GPU with 2 gb or more vram  and quick modern proc (like quad core 2 , i7, i5 etc)\r<br />uGridsToLoad=7\r<br />uExterior Cell Buffer=36    (as above in point A, you can slightly modify this and look above for specific ugrids visible -extra tip- , if you have no problems set it like in main solution ) it may look stupid to set this to 34 or default 36 but please read futher ;)\r<br />bPreemptivelyUnloadCells=1\r<br />iPreloadSizeLimit= 4194304000 (you can multiply it x2 for 16gb operational Ram systems , then you will have 8gb ram used )\r<br />bUseHardDriveCache=1      (set to 0 if you have normal, &#34;old&#34; hard drive)\r<br />bUseBackgroundFileLoader=1\r<br />iPostProcessMillisecondsLoadingQueuedPriority=5\r<br />\r<br />&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;           END OF ALTERANTIVESOLUTIONS         &#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;\r<br />               \r<br />\r<br />It looks like we have been searching cure for that problem for 2 years from completly wrong side. \r<br />It is not matter of our hardware or Skyrim engine limitations , but matter of harmony between our hardware and that engine.\r<br />It&#39;s not kind of magic its pure logic. \r<br />\r<br />All these guides about ugrids were pure myth leading nowhere, i always wonder why i can&#39;t use more ugrids in this game \r<br />while i can see and use whole gigantic map full of scripts in arma 3 for example wihout any crash and great visual range (many kilometers).\r<br /> All info we get from all uGrids guides on different forums was that &#34;we must use exterior buffer 36/64/100/ etc. &#34; , but why so little i asked today? Why only that? \r<br />And i was right, i feel so stupid that this simple question takes me 2 years to ask ;).\r<br />\r<br />\r<br />Trust me when i&#39;ve reached first 4hours of gameplay on uGrids7range of view without CTD and while my Skyrim is working with more fps, more smooth transitions between cells and etc. etc. \r<br />\r<br />\r<br />For : &#34;Don&#39;t touch it&#34; advices : \r<br />Hey we must touch it&#33; We must search for solutions, i gave up my experiments with uGrids for a long time, becouse it had no effect until yesterday.\r<br />Well if you can use AltimorFP , great little mod (it is 1 .dll file into SKSE plugins folder) called &#34;Stable uGridstoLoad&#34; you can freeley experiment , even if you don&#39;t know how to safely change ugrids. Why? \r<br />You can exit game, enter &#34;my documents&#34; open Skyrim.INI and just give lower ugrids/exterior cells values and LOAD SAME SAVE with HIGHER values WITHOUT ANY CRASH or destroying your game progress (i wrote about it in main post). \r<br />LINK to the AltimorFP mod: http://skyrim.nexusmods.com/mods/41592\r<br />\r<br />I think the same until yesterday (naah, another silly &#34;ugrids miracle&#34;), please trust me.\r<br />Just read my solution in the whole text, and understand what i wrote. \r<br />It is not another , bullsh..t guide how to raise ugrids and have crashes still but also a new view on ugrids philosphy.\r<br />I also gave up with experimenting with ugrids, after, many tries and reading a lot of &#34;theories&#34; , using only &#34;stable&#34; mods for ugrids alos doesn&#39;t help, but until yesterday and i reach what i wanted, a working game with stable ugrids at 7 or a view like having ugrids at 7 or more (7 is perfectly safe for quests and other scripts), my fault was to depend on others ideas and don&#39;t develop my own, right now i have my dreams come true, working 7ugrids ,very heavy modded skyrim, and im playing Elder Scrolls game from Arena , and games from Amiga500 times , i don&#39;t give a bullsh...t to you Lads&#33;\r<br />You can go everywhere you want to, even above ugrids5, just don&#39;t loose faith. \r<br />\r<br />Using &#34;SafetyLoad&#34; mod helps too. Use them both then start experiments i&#39;ve described.\r<br />\r<br />HAPPY GAMING&#33;\r<br />Umbrecht\r<br />\r<br />\r<br />\r<br />\r<br />PS. Im not a IT guy , in real life im an architect so please forgive me lack of professional IT nomenclature, computers are only one of my side hobbies (which my wife can&#39;t understand ;) ).\r<br />\r<br />I want to sorry for my fatal english language also, im doing my best but it is not my native. \r<br />\r<br />I will try to help anyone in the comments sections as long as i can and have enough skill or time let me do that, feel free to write there&#33;\r<br />\r<br />In similar way i&#39;ve made simple fix for Requiem and Deadly Mutilation which let both mods works togehter (check my files section if You are interested). \r<br />And it is really working for 80% of users, and at start nobody belived it can be done. \r<br />Sometimes bit of curiosity can give us great results ;)\r<br />\r<br />I hope i made nice present for other UGriders , call me Santa Claus&#33; Ho ho ho.\r<br />I hope it will work for You too&#33;\r<br />\r<br />\r<br />Have a nice Merry Christmas and happy New Year soon too;)\r<br />Spend your time with families, close people, \r<br />and don&#39;t forget about anyone who could need Your help",
  "categoryId": "39",
  "version": "1.8",
  "author": "Umbrecht",
  "createdUnix": "1385872649",
  "updatedUnix": "1386799157",
  "containsAdultContent": false,
  "uploadedBy": "Umbrecht",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086365",
      "name": "REAL uGrids SOLUTION and MORE",
      "version": "1.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "164",
      "fileName": "REAL uGrids SOLUTION and MORE-48387-1-8.rar",
      "uploadedUnix": "1386799157",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/5cb5a211b88f8d952dcf904a1258df7dbf50dc1a14f60228ee711dda3e1c9614/analysis/1407831617/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/REAL%20uGrids%20SOLUTION%20and%20MORE-48387-1-8.rar?fid=1000086365&ttl=1535828519&ri=8192&rs=8192&setec=c1018798fbfe4c9d287e6a5c4e139934"
    }
  ]
}