{
  "modId": 48415.0,
  "modName": "Family Life Series - Breezehome",
  "summary": "Re Design of Breezehome for six children.",
  "descriptionHtml": "This file requires Hearthfires.\r\n\r\nThe third installment in my Family Life series, this is a re designed version of breezehome to function with Heartfire Multiple Adoptions.  HMA is not required to use this home, but i wonder what the point would be, being as i really did not change much other than to add more beds.  Also, this home is designed to work with the purchase of the child's bedroom.  There is no need to purchase the alchemy area being as i have provided the alchemy workstation free of charge upstairs.  If you are determined to purchase the alchemy lab instead of the child's bedroom, there really is no point at all in using this mod.\r\n\r\nInstall with Nexus Mod Manager.\r\n\r\nPurchase the home as normal, along with the child's bedroom.  This home was designed specifically for the purchase of the child's bedroom, and may or may not function correctly if you purchase the alchemy area, which wipes out the child's bedroom stuff.  The alchemy area has been provided for free upstairs, so there is no point in purchasing it.  In fact, i added quite a few crafting stations which did not come originally with the home.\r\n\r\nAnyone using this file as a modder's resource will notice editor errors when loading the cell.  All of these errors were there before i even got started, and were generated by Bethesda.  The creation kit is notorious for complaining about things that don't seem to make a difference in the game at all, so in this case i would take those errors with a grain of salt.\r\n\r\nMy other mods\r\n\r\nProudspire Mansion\r\nThe first installment in the Family Life series, and my most ambitious mod to date.  This is a fully featured mansion, with eight bedrooms, a trasportation system to the other homes, an underground bathing area, mannequin room, crafting area, and much much more.  This home makes the other homes a lot easier to work with, moving your family from one home to another, so i do highly recommend this mod for use with the other Family Life homes.  However, keep in mind that this home, unlike the others, is overkill, involving a lot of fancy features.  If you want simple homes, this one is not for you.\r\n\r\nFamily Life Series - Hjerim\r\n\r\nThe second installment in the family life series.\r\n\r\nCOHO - Children Of Honorhall Orphanage\r\n\r\nProvides six daughters or six sons for adoption quickly after the game starts.\r\n\r\nCredits\r\n\r\nTMPhoenix\r\n\r\nTMPhoenix taught me everything i know about getting six children to sleep in one home simultaneously.  The amount of patience he showed me was unbelievable.  I would never have been able to do these homes without his help.",
  "categoryId": "67",
  "version": "0.5",
  "author": "kar2nz",
  "createdUnix": "1385918592",
  "updatedUnix": "1385918586",
  "containsAdultContent": false,
  "uploadedBy": "kar2nz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000084986",
      "name": "Family Life Series - Breezehome",
      "version": ".5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Family Life Series - Breezehome-48415--5.7z",
      "uploadedUnix": "1385918586",
      "modVersion": ".5",
      "virusScanUrl": "https://www.virustotal.com/file/dcd31b2d558cd82136b2ff153d5275e6bc2794f8610ba7a7b78abf1557737448/analysis/1407816400/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Family%20Life%20Series%20-%20Breezehome-48415--5.7z?fid=1000084986&ttl=1535828540&ri=8192&rs=8192&setec=18f0bbc18c4bedc8b6d952711bd847a0"
    }
  ]
}