{
  "modId": 4844.0,
  "modName": "Moonstone Alpha",
  "summary": "Replacers for Iron Warhammer, greatsword and shortsword. Also Steel Greatsword replaced with a spear. Animations are off but it still works for an alpha.",
  "descriptionHtml": "Installation.\r\n\r\n\r\nUnpack into skyrim folder X:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim \r\n\r\n\r\nMoonstone Alpha 1.0\r\n\r\n\r\nJust a small release with weapons featured in the old game. Every mesh and texture is made by me from scratch.\r\n\r\nTextures are very mediocre and will be tuned/remade. If you find the old amigagame intresting or the idea just of the mod, support me at http://tinyurl.com/dxzsevg \r\nI\\'ll make everything as fast as I can but as I\\'m working solo atm it can take some time to get out new material. Also waiting for the CK is a big deal.\r\n\r\nIf you are intrested in helping message me at deflex1@hotmail.com or PM me at skyrimnexus.com, username d0kefish.\r\n\r\n\r\nI will need help with coding/scripting once the kit gets out. Another modeller/texture artist would be awesome aswell.\r\n\r\n\r\n-- Moonstone --\r\n\r\nSo it\\'s final, I\\'ve decided to put actions to words and the mod is slowly on it\\'s way. The first release will likely contain mostly equipment and other props. \r\nPlan is to recreate and expand events from the old amigagame Moonstone: A hard days knight.\r\n\r\nAs of now It\\'s mostly me working on this mod. Help is always appreciated, but I will do as much as I can myself. I being helped by NexusAngel with the armor models.\r\nI have a great storywriter helping me aswell, so I think this will turn out excellent.\r\n\r\nAs for additional help, I would really enjoy someone that could do a better job making textures than what I currently can. I can produce mediocre/dull textures so if someone would be \r\nup for the task of remaking the once I\\'ve done so far. Or make new once, just message me or post in the thread.\r\n\r\nAny other kind of help is also appriciated, if you message me, I\\'m sure I can find some use for you. \r\nI\\'ll of course credit you for everything done and helped with, even tho I feel I shouldn\\'t have to write this bit.\r\n\r\nIf you feel that you are interested in helping out or, just want to give me a pointer or something PM me or email to deflex1 [at] hotmail [dot] com.\r\n\r\n\r\n-- Story --\r\n\r\nMoonstone Is my first played RPG and I will try to keep the story as close to the original as possible. Four brave knights are once again sent out to find the long lost Moonstones. \r\nSir Godber, Sir Richard, Sir Jeffrey and Sir Edward are once again summoned by the old druids to gather the moonstones.\r\nYou will take on a the roll of one of these knights. You need to be the one to get your hands on the moonstone. Every knight is sent out to different locations, however its very likely their paths \r\n\r\nwill cross. As there can only be one keeper of the moonstones.\r\nAny means are necessary, there can only be one true keeper of the moonstones, the one that claims them will have to surpass anything of anyone who stands in this path... \r\n\r\nWeather you gain interest in this mod or not, I recommend you to play the old game and read a bit more about it\\'s background.\r\n\r\nLink: http://www.moonstone....uk/knights.htm\r\n\r\n\r\n*** - Progress - ***\r\n\r\n* Weapon * \r\n- Knight\\'s shortsword. * DONE *, needs texture overhaul.\r\n- Knight\\'s claymore. * DONE *, needs texture overhaul.\r\n- Heatershield * DONE *, needs texture overhaul.\r\n- Trogg\\'s Mace 2H. * DONE * \r\n\r\n- Trogg\\'s Mace 1H. \r\n- Sword of sharpness. \r\n- Trogg\\'s Spear \r\n- Troll mace \r\n\r\n\r\n\r\n\r\n\r\n* Armor * \r\n- Full Knight armor set. NexusAngel \r\n\r\n* Optional *\r\n- Ring of protection. Me(d0kefish).\r\n- Talisman (protection from dragons fire). Depending how this can be done. Me(d0kefish).\r\n- Druid equipment (im sure the ingame robes will do just fine for the time beeing) ** Unclaimed **\r\n\r\n\r\n\r\n*** - Full modification features - ***\r\n\r\n\r\n- Story -\r\n\r\n* Longer story and more detail to it. Adding conflicts and maby alliances (with that betrayl) between the knights. Baseline story will be the same. Four knights goes on a race to find the four \r\n\r\nkeys to later be able to get their hands on the moonstones. Completing this quest will add a permanent (if possible) starconstilation to the nightsky. \r\n\r\nSome kind of other reward would ofcourse also be viable, maby the ability to summon the dragon or the three other knights to help you in combat.\r\n\r\n\r\n- General - \r\n\r\n* Gore, i find this to be a big deal for the old game. If made possible by the devkit I new deathanimation by dragon, trogg, balok could be added. Also the ability to cut troggs in half (finishing \r\n\r\nmove.. well duuh).\r\n\r\n\r\n- Character -\r\n\r\n* Warewolf would be reskinned as a Balok (Mixture of man and beast) Link: http://youtu.be/9qhODhw0QHM\r\n\r\n* Ratmen, remade skeevers maby with a jumping attack. Ratmen should also apply disease and come in packs. Link: http://youtu.be/t5-dvMGi9F0\r\n\r\n* Troggs would be the regular enemy weilding spears, axes and warhammers. This would not be a prio i would think existing enemys would do the job at the start.\r\n\r\n* Trolls, the old game calls them trolls, i guess giants would be a better fit. Link: http://youtu.be/uf2gxe6etjk\r\n\r\n\r\n- Equipment -\r\n\r\n* Custom models for the all the swords\r\n\r\n* Knights shortsword - the basic weapon.\r\n* Knights claymore - chance to decapitate (or ability to decapitate kneeling enemy).\r\n* Sword of sharpness - Chance on hit to slice through the enemy causing massive bleeding.\r\n\r\n* Different kinds of armor, from a quite lightweight chainmailbased armor to a full plate armor. Every armor should have the cape or atleast clear signs of what color of knight you chose.\r\n\r\n* Talisman with fireresistance. Would be good if there would be a way to make the boss dragons fire some kind of special fire, unholy fire or thermitefire (or something way coolar than that), so \r\n\r\nthat one could not benfit from other earlyer obtained fireresistance items. \r\n\r\n* Throwingknives would be a given, and im sure there will be an \\'easy\\' way doing this when the kit gets out.\r\n\r\n* Ring of protection. Basic stamina boosting ring. Could add something fancy for the fun of it tho.\r\n\r\nAnything else anyone would like to add? Im really getting fired up about this. Btw, should this be moved or is this on the right thread. At the start i was just requesting it but as time went by \r\n\r\nim getting more and more exited about it and would love to atleast try to lead it myself.\r\n\r\nMore updates will follow, im at work now so this is not really the kind of work i should be putting my mind to.\r\n\r\nd0kefish",
  "categoryId": "55",
  "version": "1.0",
  "author": "d0kefish",
  "createdUnix": "1325169474",
  "updatedUnix": "1325172989",
  "containsAdultContent": false,
  "uploadedBy": "d0kefish",
  "primaryFile": null,
  "files": [
    {
      "fileId": "14822",
      "name": "Moonstone alpha",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4370",
      "fileName": "Moonstone alpha-4844-1.rar",
      "uploadedUnix": "1325172989",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/877fae134674c91dc65ffab018441cdfcbbbf93f00755ce8cdfd7109230de6a4/analysis/1406567921/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moonstone%20alpha-4844-1.rar?fid=14822&ttl=1535761088&ri=8192&rs=8192&setec=790c4a197ef2d03dca880aa23191afe2"
    }
  ]
}