{
  "modId": 48449.0,
  "modName": "OBIS - Organized Bandits in Skyrim  - Requiem Patch OUTDATED",
  "summary": "OUTDATED&#33; Designed to unlevel OBIS bandits and add requiem perks to them.",
  "descriptionHtml": "[center][color=#6495ED][i][size=5]OUTDATED&#33; Designed for an older version of Requiem&#33;\r<br />Can&#39;t confirm it is in fact BROKEN, since it just unlevels OBIS\r<br />No longer supported either, use at your own risk&#33;&#33;\r<br />\r<br />EDIT: Feb 1st 2014\r<br />I am discontinuing support for this mod because I have encountered an error in TES5Edit that keeps deleting references without any command, and when I reported the error to the TES5Edit team they insulted me, told me to leave, and deleted my post, so I am no longer going to use or support this program in any way, and since this mod was made in this program, that means I can not continue development of it.\r<br />\r<br />I am very sorry to everyone who enjoys this patch and was looking forward to the update, but I simply will not put up with this kind of unprofessional childish behavior, when I put so much work into my mods and listen to every comment everyone posts to better my mods as much as possible, and will not support mods created using the program made my such a team. I will leave this mod up in it&#39;s current form for the time being, but I do eventually plan on taking it down, so please download it now while you have the chance, if you want it...\r<br />\r<br />Again, I am very sorry about this, but I already have a had a huge workload on my shoulders with this patch, Requiem Redone, and my sky overhaul mods before TES5Edit had a melt down and undone months of work on me, and I simply can not make myself start over using a program when the creators of the program can not even admit their program is at fault. =[[/size]\r<br />\r<br />[size=4]This is a replacer ESP for [url=http://skyrim.nexusmods.com/mods/31264/]OBIS - Organized Bandits in Skyrim[/url] by Inigioblade, designed to work with [url=http://skyrim.nexusmods.com/mods/19281/]Requiem[/url] by ogerboss and requires both of those files to be installed before this mod for it to work. Please note, neither of these users had any hand in making this, and all issues involving using these two mods together should be directed at me, not them, and I do not have any part in either of those mods, and general questions about them individually should be directed towards the respective uploaders of these mods.\r<br />\r<br />Please note, I am not a &#39;pro modder&#39;, I am however a fan of these two mods and find that Requiem needs a little spice in the bandit department. I remade this patch several times until I was happy with it, and tested it in game and haven&#39;t noticed any problems. Requiem has a very delicate balance, and I did my best to keep it, without sacrificing any OBIS features&#33;\r<br />\r<br />This is made in TES5Edit, and should by no means be considered &#34;perfect&#34; but should be a major improvement in trying to run the two together with no patch.\r<br />\r<br />What does this patch do exactly? \r<br />- Unlevels most, if not all of the bandits, and replaces them with the bandit leveling system\r<br />- Edits their stats and inventory a little, to match requiems closer, to balance them\r<br />- Adds over Requiem perks. The perks are the ones the requiem bandits use, so they may not fit as perfectly as the vanilla perks would have, but it&#39;s better then them having NO PERKS. Which is mostly what you get if you use the two together without this patch. \r<br />\r<br />To install, just replace the .esp included in the download with OBIS.esp and OBISDB.esp in your data folder. I will work on making a &#34;none replace patch&#34; later, but I personally like to keep ESPs down, and I can simply remake the patch if OBIS comes out with an update. ^_^\r<br />\r<br />If you notice any problems, PLEASE report them. While this should be fully playable, consider yourself a beta tester, report back with any errors you encounter, or any fixes I missed. lol\r<br />\r<br />This is done with the knowledge of Inigoblade, maker of OBIS in skyrim, and requires OBIS to be downloaded and installed, BEFORE installation of this mod. This is NOT a stand alone patch. Also, don&#39;t be silly, you will get a CTD if you install this and do not have Requiem installed, this mods adds requiem to OBIS master list. again, I will work on making a separate .esp for this mod in the future, for now I am more worried about getting it to work right.\r<br />\r<br />Lastly, make sure to install the DragonBorn options if you use OBISDB, Requiem- Dragonborn, and Dragonborn. I have not tested it yet, but it was made in the same way as the main patch.[/size][/i][/color][/center]",
  "categoryId": "78",
  "version": "0.1",
  "author": "ArtMurder",
  "createdUnix": "1385950588",
  "updatedUnix": "1385951023",
  "containsAdultContent": false,
  "uploadedBy": "ArtMurder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085112",
      "name": "OBIS - Requeim Patch BETA",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "852",
      "fileName": "OBIS - Requeim Patch BETA-48449-0-2.7z",
      "uploadedUnix": "1385951023",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/07ce2e73564dfcc4ca65fc5647fcedab91ec4e0eb26e4681eb4549e49fa8eefb/analysis/1407817030/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OBIS%20-%20Requeim%20Patch%20BETA-48449-0-2.7z?fid=1000085112&ttl=1535828580&ri=8192&rs=8192&setec=e049392f6393075c7e182f8cdf59ee4f"
    }
  ]
}