{
  "modId": 48479.0,
  "modName": "Dominion the Unofficial Expansion- recruiting talents",
  "summary": "This is still a WIP project and there&#39;s no file to download. \r<br />I suppose many of you are unsatisfied on the Thalmor stories in Skyrim, yet just in the middle of this year, they announced that there won&#39;t be anymore DLC for Skyrim. So why don&#39;t we fulfill our wish ourselves?",
  "descriptionHtml": "Greetings everyone. I am anbeegod from Hong Kong, or you can just call me NB God.\r<br />I suppose many of you are unsatisfied for the Thalmor stories in Skyrim. Such a badass villain, and yet such little contents about them. We had ever hoped Bethesda to complete their &#34;unfinished&#34; work, yet just in the middle of this year, they announced that there won&#39;t be anymore DLC for Skyrim.\r<br />\r<br />Therefore, I&#39;m gathering talents to make an unofficial Dominion Expansion for Skyrim, to replenish the &#34;missing&#34; things of the Aldmeri Dominion. Please keep in mind on this page if you&#39;re interested.\r<br />\r<br />Currently need......\r<br />\r<br />Systemic (requires basic knowledge on CK):\r<br />3D Modellers\r<br />World Maker (To make the world that the world designer designed in CK)\r<br />Scripters\r<br />Shout and Magic Designers\r<br />\r<br />Lore and Arts:\r<br />Story Designers\r<br />Dialogue Designers\r<br />Lore Expert (To check if there&#39;s any conflict between the story of Dominion and the lore, and give advices to the story)\r<br />World Designer (best if the candidate has ever played Arena, though everything can change after 200 years)\r<br />Creatures Designer\r<br />Musicians\r<br />\r<br />Requirements of joining the project:\r<br />1. Legally purchase Skyrim.\r<br />2. Completed the Alduin, Harkon and Miraak quests, and at least 5 Daedra quests.\r<br />3. Can communicate with others, not being quiet or self-working all the time.\r<br />4. Take your works serious.\r<br />5. Have at least 10 hours for Dominion works every WEEK.\r<br />6. Patient.\r<br />If you&#39;ve ever played any of Arena, Daggerfall, Morrowind, Oblivion or all of the above, it would be great, great, super super great.\r<br />\r<br />One person can have more than one duties, but don&#39;t take too much, or you will get yourselves exhausted.\r<br />\r<br />\r<br />About Our Work......:\r<br />\r<br />This project is made to &#34;replenish&#34; the missing stories of the Aldmeri Dominion (Thalmor). In the Dominion Expansion, you can choose to join the Dominion or the Skyrim Crusaders, after completing the Civil War quests.\r<br />\r<br />Dominion (Thalmor):\r<br />After completing the Civil War quests, a courier will deliver you a letter, which is written by the Thalmor ambassador (Elenwen or new NPC Anryan if you killed Elenwen after Dragonslayer). She is interested by your Dragonborn power and your heroic actions in Skyrim, and she wants to make this power and honor a part of the Dominion. For Eras the descendants of Aldmers await for the time to get back their own land, and now, with your godlike power, they can finally achieve this.\r<br />Once you get to the Thalmor Embassy, you can talk to the ambassador to join the Dominion and continue to work in the Legion/Rebellion as a spy, or you can just attack any Thalmor member in the embassy to show your stance. Yet, the ambassador is invulnerable.\r<br />\r<br />Skyrim Crusaders (Legion or Stormcloak):\r<br />After you receive the letter from the Thalmor ambassador, if you attack a Thalmor member in the embassy, you will automatically join the Skyrim Crusaders. It is impossible to clear the whole embassy in that moment, or I better say, it&#39;s impossible to survive if you stay at there. (Ignore it if you are using tgm and making glitches)\r<br />After your escape from the embassy, you will go find General Tullius or Ulfric Stormcloak. They tell you that the Moot is coming, and you will have to go to the Moot with Elisif/Ulfric. During the Moot, some mysterious creatures will interrupted it. Once you defeat them, you will have to investigate the matter.\r<br />\r<br />New Lands:\r<br />Skyrim: The Great Hall, Tomb of Krothun, Cathedral of Arkay\r<br />Cyrodiil: Jerall Mountains, Valus Mountains, West Weald\r<br />Elsweyr: Riverhold, Dune\r<br />Summerset Isle: whole of it\r<br />\r<br />\r<br />FAQ:\r<br />\r<br />Q1. Why would the Legion start fighting against the Aldmeri Dominion again? The last time they tried that the whole Empire almost was erased, and odds aren&#39;t any better by now, the Dominion still is strong enough to force their religeous ideals on the Legion, defying them would only lead into total destrucion.\r<br />A1. I&#39;ve already considered this before I made it. It will be explained during the quests.\r<br />\r<br />Q2. Why don&#39;t you simply ignore the old fractions then and simply let these Crusaders rise from the people&#39;s hate towards the Dominion? Just let them be made out of former Legioneers/Stormcloaks, and everything would be set.\r<br />Well, &#34;planning&#34; a massive, epic and logical story is an easy thing to say.\r<br />A2. Trust me, there will be conflicts between the lore of Skyrim and the lore of this expansion if it simply let these Crusaders rise from the people&#39;s hate towards the Dominion. Also, if the expansion really does this, the story won&#39;t be as interesting as it was supposed to be.\r<br />In fact, the story is already planned, not planning, but it can be improved. Perhaps it&#39;s a bit arrogant to say &#34;massive, epic and logical&#34;, if this make you feel bad, ignore it. \r<br />\r<br />Q3. So you already thought about every way how the story should be played and created a logical and lorefriendly way to reach the ending(s)?\r<br />Why you need a story-designer then?\r<br />A3. For improvements and ideas on the main quests, and also the development of side quests.\r<br />\r<br />Q4. Is &#34;Skyrim Crusaders&#34; an Imperial-Stormcloak alliance?\r<br />A4. Skyrim Crusaders is not an Imperial-Stormcloaks alliance. The events of Dominion happen after the civil war of Skyrim, which means Skyrim is already unified by either the Imperial Legion or Stormcloaks before the battle between the Dominion and Skyrim.\r<br />The Imperial Legion in Skyrim call themselves as Skyrim Crusaders after an important event (I cant tell), the Stormcloaks call themselves as Skyrim Crusaders to increase their legality.\r<br />You need to complete the whole civil war questline before Dominion starts.\r<br />\r<br />Q5. What will be the starting point? Can you tell me something about the story?\r<br />A5. The starting point of this project would be world and creatures designing. I&#39;ve already got some ideas. \r<br />For example, on creatures, an arcane creature created by an exiled Thalmor wizard Lit&#39;renthur (boss of a side quest), is threatening the safety of Alinor and the reign of Thalmor.\r<br />During Dominion, you will have the opportunity to side with this mad wizard and use his foul pets to siege on Alinor (if you didn&#39;t kill him).\r<br />Another example of creatures is Ulthes, intelligent creatures which claim themselves as descendants of Arkay and Kynareth. During Dominion, you will reveal the truth of it.\r<br />As for world designing, Chorrol, which used to be a wealthy city on Cyrodiil, became the poorest one because of Aldmeri and Redguard attack. The city has been in chaos since the assassination of Countess Arriana Valga (ruler of Chorrol during TEV4: Oblivion), and the emperors were powerless to control it. Till now, Redguard bandits and Bruma scoundrels keep bothering Chorrol, whilst almost all citizens of Chorrol attempt to take over the place as the ruler of this city.\r<br />Under Count Mathalon&#39;s reign, there are people framed and killed everyday, and no people were allowed to leave the city.\r<br />Another example of designed place is Skingrad. Count Janus Hassildor is the ruler of this city, who is thought to be an extremely powerful wizard who can maintain his life by magic. People who have ever played Oblivion should know his true face as a vampire, and this will be revealed before the citizens of Skingrad.\r<br />Under the vampire count&#39;s reign, Skingrad survives the Great War and keep wealthy, but what will the citizens choose when they know the truth of their beloved ruler? \r<br />One of the interesting features of Dominion, is that there&#39;s no certain hero or villain in the story. Even the great hero Dragonborn, does not truly represent justice and hope; even the hated Aldmeri Dominion, does not truly represent ambition and evil.\r<br />\r<br />Q6. Do you have time? The work sounds massive.\r<br />A6. I&#39;ve got more than 20 hours during weekends.\r<br />\r<br />Q7. How large will the total area added by this expansion be?\r<br />A7. Summerset Isle- about 2/5 of Skyrim\r<br />Cyrodiil Region- about 1/3 of Skyrim\r<br />Elsweyr Region- about 1/20 of Skyrim\r<br />(Dungeons were not included)\r<br />So it will be about 78.3% of Skyrim. I don&#39;t know if the authors of Skyblivion or Moonpath to Elsweyr will allow us to borrow their work on credit, or even join the project. If this comes true, the total area of this expansion will be even larger than Skyrim.\r<br />\r<br />\r<br />This is a MASSIVE project, and I believe that nobody can finish it by only several people. If anyone is interested and wants to take a part, please leave comments or send eMail to &#34;gahatimdragon@hotmail.com&#34; so that I can know.\r<br />I will take part in Story Design, World Design and Creatures Design.\r<br />\r<br />And also, this is a voluntary work, which means you won&#39;t get any physical reward for working on it (but maybe you will become famous on the internet after that...... I presume.) To take part in, you might need to have strong love on Skyrim.\r<br />\r<br />Thanks for your time on this. Wish you good lifes.\r<br />\r<br />\r<br />\r<br />Soft Reminder:\r<br />This is still a WIP project.",
  "categoryId": "30",
  "version": "WIP",
  "author": "Anbeegod and his team",
  "createdUnix": "1386060576",
  "updatedUnix": "1386060576",
  "containsAdultContent": false,
  "uploadedBy": "kahasana",
  "primaryFile": null,
  "files": []
}