{
  "modId": 48488.0,
  "modName": "Dragonborn Nordic Sword with Scabbard",
  "summary": "This is a small mod that adds a visible sheath to the Nordic Sword.",
  "descriptionHtml": "Overview:\r<br />I really like the Dragonborn weapons and armor. They&#39;re highly detailed, and unique. I find them as some of the best weapons and armor sets in the entire franchise. The only thing that bothered me was the total lack of scabbards for the weapons.\r<br />I didn&#39;t think too much of it until I opened the BSA, and noticed something a little odd. it seems there was some confusion with the third and first person models for the weapons. The third person models are named as 1stperson. I believe these weapons were originally suppose to have sheathes and scabbards, but due to a mix up, they were never implemented into the game.\r<br />\r<br />Discription:\r<br />This mod adds a scabbard to the Nordic Sword added by the Dragonborn DLC. The scabbard is simply an Orcish scabbard remodeled and textured to fit the look and color of the Nordic Carved armor and weapons set.\r<br />\r<br />Requirements:\r<br />This mod requires the Dragonborn DLC. Otherwise, this mod does nothing.\r<br />\r<br />Install:\r<br />Install with NMM, or move the folders to your data folder.\r<br />\r<br />Future Plans:\r<br />[s]I want to make a scabbard for the Stalhrim sword. I may also try to add sheathes and scabbards to all of the other weapons.[/s]\r<br />This mod is superseded by Leanwolfs&#39; [url=http://www.nexusmods.com/skyrim/mods/39870/?]Better shaped Weapons[/url]. It not only adds sheaths to nearly all of the swords, but also shapes almost all of the weapons to be sleeker and sharper. If you still want to use this mod along side BSW, install this one after installing that one.",
  "categoryId": "29",
  "version": "1.0",
  "author": "Aranas",
  "createdUnix": "1386084219",
  "updatedUnix": "1386084027",
  "containsAdultContent": false,
  "uploadedBy": "Aranas23",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085263",
      "name": "Dragonborn Nordic Sword with Scabbard",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "465",
      "fileName": "Dragonborn Nordic Sword with Scabbard-48488-1-0.rar",
      "uploadedUnix": "1386084027",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ec56d9a15e899a891b5b8741be2af9002d0cdbcd36f10081dea9c31f112817b5/analysis/1407818104/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Nordic%20Sword%20with%20Scabbard-48488-1-0.rar?fid=1000085263&ttl=1535828638&ri=8192&rs=8192&setec=fb285ce63417b8099122b5bc2bcfbd08"
    }
  ]
}