{
  "modId": 48498.0,
  "modName": "Special Events of Tamriel",
  "summary": "Set your own birthday and receive gifts. You can give NPCs gifts on their own birthdays. Receive notifications of special events both outside and inside of Skyrim. On special events within Skyrim, take part in sale events, and speak with any innkeeper to receive lore-friendly items for that day.",
  "descriptionHtml": "[center][b][size=7][color=green]Special Events of Tamriel:[/color][/size]\r<br />[size=5][color=yellow]Special Events and Birthdays of Skyrim[/b][/size][/color]\r<br />[b][size=6][color=pink]Current Version: 1.31 - See changelog[/color][/size]\r<br />[size=4]Uploaded February 28, 2014[/size][/b]\r<br />\r<br />[size=6][color=white]Features[/size][/color]\r<br />\r<br />[size=5][color=orange]- Set your own in-game birthday, receive gifts -\r<br />- NPCs have unique, one-day birthdays - give gifts to your closest friends -\r<br />- Take part in 19 unique Skyrim sales, and receive seasonal care-packages of items -\r<br />- Receive notifications and background on all special events and holidays in Tamriel -\r<br />- Read through 2 new books -[/color][/size][/center]\r<br />\r<br />[b]Contents:[/b]\r<br />1. What is this mod?\r<br />2. Component breakdown:\r<br />- - i) Special Events of Tamriel\r<br />- - ii) Birthdays of Skyrim\r<br />- - ii.5) Settings and Options\r<br />3. Changelog\r<br />4. Issues, Notes, Compatibility\r<br />5. Requirements\r<br />6. Installation\r<br />7. Updating\r<br />8. Uninstallation\r<br />9. Upcoming\r<br />10. Questions/FAQ\r<br />11. Credit and thanks\r<br />12. Permissions\r<br />\r<br />[center][b][size=5][color=red]1. What is this mod?[/color][/size][/b][/center]\r<br />\r<br />SEoT is an attempt to give meaning to the passage of time in Skyrim. This is done by drawing a variety of special events and holidays from Elder Scrolls lore and associating them with in-game Skyrim days. The hope is that on these days, the player will feel greater attachment to the world around them.\r<br />\r<br />The current version of SEoT informs the player of non-Skyrim events through debug notifications, and Skyrim events through quest objectives. On Skyrim days, speaking with an innkeeper will yield a variety of lore-friendly items, and the ability to &#34;complete&#34; that day&#39;s objective (providing the player with a &#34;checklist&#34; or history of special events during their game, in the form of their quest log). The player can also set their own birthday via a census form, and receive gifts on their birthday that are tailored to the player&#39;s skills at the time of acquisition. Finally, most/all vanilla NPCs have been assigned a unique birthday, and the player can seek these individuals out and give them a gift, if they choose.\r<br />\r<br />You have a variety of in-game options that allow you to disable many features of this mod at your leisure. SEoT is also fully compatible with Wet and Cold: Holidays (which is highly recommended) through a simple settings option in-game.\r<br />\r<br />[center]Version 1.00 was featured in Skyrim Mods Weekly 15 by misalen:\r<br />[youtube]AY7jqzQO24k[/youtube][/center]\r<br />\r<br />[center][b][size=5][color=red]2. Component Breakdown[/color][/size][/b]\r<br />[b][size=5][color=orange]i) Special Events of Tamriel[/color][/size][/b][/center]\r<br />\r<br />Install Mod:\r<br />- Receive [i]BOOK[/i]: [b]Special Event Guidebook.[/b]\r<br />- Read book -&gt; Receive [i]QUEST[/i]: [b]Special Events of Tamriel[/b]\r<br />---&gt; On special event days [i]outside[/i] of Skyrim, you receive a debug notification telling you as such.\r<br />---&gt; Your quest entry also changes, giving you a bit of history about the day. You will NOT receive a quest objective.\r<br />---&gt; [u]You can turn these notifications OFF.[/u]\r<br />\r<br />---&gt; On special events day [i]in[/i] Skyrim, you receive a quest objective.\r<br />---&gt; Your quest entry will change, and provide history. It will also suggest the &#34;bonus&#34; or &#34;buff&#34; for that day.\r<br />---&gt; If you speak to an innkeeper and choose the holiday dialogue option, your objective is COMPLETED. You receive a small assortment of items tailored to the particular day, but nothing major: every citizen receives them, after all.\r<br />---&gt; If you fail to speak to an innkeeper, your objective is FAILED for that day (no consequence).\r<br />---&gt; [u]You can turn quest objectives OFF. You can turn the ability to fail objectives OFF.[/u]\r<br />\r<br />---&gt; 19 days are celebrated in Skyrim with SEoT. Each has a sale, where prices are 20-50% lower. Your guidebook lists when all special days will occur.\r<br />\r<br />[center][b][size=5][color=orange]ii) Birthdays of Skyrim[/color][/size][/b][/center]\r<br />\r<br />- Speak to any innkeeper Re: Skyrim census. You receive a QUEST: [b]A Citizen&#39;s Birthday[/b]\r<br />- You receive a BOOK: [b]Official Skyrim Biography[/b]\r<br />- You receive a BOOK: [b]Official Skyrim Census[/b]\r<br />\r<br />- Read [b]Official Skyrim Biography[/b]: Receive QUEST: [b]Birthdays of Skyrim[/b]\r<br />\r<br />- Open your Official Skyrim Census. The following options appear:\r<br />- Start -&gt; Fill out your birthday information, and choice of gift.\r<br />- Change other settings -&gt; Change a variety of settings (more later)\r<br />- Exit\r<br />\r<br />- After filling out your birthday information, you must [u]submit[/u] it to an innkeeper by asking about the census. Your quest will update.\r<br />- On your birthday, if you mention your birthday to any innkeeper, you receive a selection of items tailored to your skills and/or level, in-line with your census choice.\r<br />- Failing to speak to an innkeeper on your birthday will FAIL your quest objective.\r<br />- [u]You can turn failure OFF[/u]\r<br />- [u]You can set your birthday as often as you like[/u]\r<br />\r<br />- The quest Birthdays of Skyrim updates [i]everyday[/i], but without any indication. Check your quest log each day, and it will list a new set of NPCs that have a birthday on that day. Seek them out, and give them a gift.\r<br />- Doing so grants the player a &#34;karma point.&#34; In later releases, this will contribute to various other things. You can start collecting them now.\r<br />- Roughly 700 vanilla NPCs have a birthday. This does not extend to DLC NPCs at this time, but will eventually.\r<br />\r<br />[center][b]Gave everyone a random birthday\r<br />\r<br />Forgot that Farkas and Vilkas are twins[/b]\r<br />\r<br />[img=50x100]http://www.blogcdn.com/wow.joystiq.com/media/2012/06/mg-580-tableflip.jpg[/img]\r<br />\r<br />[b][size=5][color=orange]ii.5) The Census Form, and Settings Options[/color][/size][/b][/center]\r<br />\r<br />Settings are controlled through the census form (versions &lt;= 1.31)\r<br />\r<br />The questions relate to your birthday.\r<br />\r<br />As of 1.3, the additional settings available to you have changed, and you can now do the following:\r<br />a) Do you use Wet and Cold: Holidays?\r<br />b) Do you want to receive upper-left notifications of events occurring outside of Skyrim (Journal entries still update regardless)?\r<br />c) Do you want to receive objectives for events occurring in Skyrim (Journal entries, sales, and items still available regardless)?\r<br />d) You can toggle the ability to fail these objectives ON or OFF\r<br />e) Do you need another copy of the Special Event Guidebook?\r<br />f) Do you need another copy of the Offical Skyrim Biography?\r<br />\r<br />As always, you don&#39;t need to submit your census for these changes to take effect: they are saved immediately. Birthday changes MUST be submitted to be saved.\r<br />\r<br />[center][b][size=5][color=red]3. Changelog[/color][/size][/b][/center]\r<br />\r<br />[b]v1.31[/b] - Current release\r<br />\r<br />- Added a new setting option to the census Setting menu. Toggle it to YES if running Wet and Cold: Holidays. Leave it at the default, or choose NO at a later time if you are not running Wet and Cold: Holidays.\r<br />\t-&gt; Disables redundant sales to avoid erroneous pricing.\r<br />\r<br />v1.30\r<br />- Guidebook no longer updates with current day information as notification - all controlled by Journal entries now\r<br />- Add 3 quests to control different aspects of mod (Special Events, PC Birthday, NPC Birthdays) - discussed in above write-up\r<br />- Added gift menus/inventories to dialogues involving giving or receiving of items (innkeepers, and NPC birthdays)\r<br />- Added Official Skyrim Biography v1.00\r<br />- Holiday and birthday dialogue now day-conditional. Present only when relevant\r<br />- Added 1-2 NPC birthdays/day - all vanilla NPCs, exceptions being rarely used or dead NPCs. No DG, HF, DB NPCs added yet\r<br />- Introduced karma system to gift-giving - maximum 1 point/day\r<br />- Notifications, log entries, objectives all now read in 1st person\r<br />- Overhauled settings options for notifications and objectives + failure of objectives\r<br />- Can get new copies of the books through the census form settings\r<br />- Fixed issue with needing to drop the census when updating. Also works with all other in-game documents\r<br />- Re-formatted/re-sized/re-wrote some of the text in each of the in-game documents associated with this mod\r<br />\r<br />v1.22\r<br />- You&#39;ll need to drop or submit all copies of the census prior to updating to 1.22 from 1.21 or 1.20. It also works if you drop it and ask for a new one. Will fix in next release.\r<br />- Added the ability to toggle notifications OFF based on type through the census form. You don&#39;t need to submit the census for the choice to take effect, just make your choice.\r<br />- Tweaked the birthday gifts a bit.[/b]\r<br />\r<br />v1.21\r<br />- Fixed a stupid oversight - some people might not actually receive a birthday gift, depending on their stats. This has been fixed. Sorry&#33;\r<br />\r<br />v1.2 - removed from the files section - had an error\r<br />- Player birthday functionality added - added more innkeeper dialogue\r<br />- Added the Skyrim census form.\r<br />- Hopefully fixed spinning book issue\r<br />\r<br />v1.1\r<br />- Added buffs/debuffs to 19 days throughout the year - notifications are changed to reflect this\r<br />- Added new dialogue to all innkeepers in Skyrim. This dialogue will add items to your inventory on the mentioned 19 days.\r<br />- Added a new page to the Guidebook as a &#39;cheat-sheet.&#39;\r<br />- Fixed issue with messageboxes, rather than notifications, displaying messages. Tweaked some information.\r<br />- Please see Compatibility Section, particularly if you are using a mod than modifies inn rental rates.\r<br />\r<br />v1.0 - Initial Release\r<br />- Added notifications to many days throughout the year\r<br />- Added a Guidebook for reference\r<br />\r<br />[center][b][size=5][color=red]4. Issues, Notes, Compatibility[/color][/size][/b][/center]\r<br />[center][b][size=4][color=orange]Notes[/color][/size][/b][/center]\r<br />\r<br />[b]- Birthday and settings options reset as of V1.3. You must reset them, if updating from a version &lt;1.3.[/b]\r<br />- Innkeeper dialogue options don&#39;t appear on first installation. Save and reload. Done.\r<br />- Census must be [u]submitted[/u] for your birthday information to save.\r<br />- When changing options, you do not have to submit your census for changes to be saved. It&#39;s just for your birthday info.\r<br />- After 1+ in-game year, old quest log entries disappear and reappear at the top (only 1 Saturalia entry per log, in other words). Not an issue, just a warning.\r<br />- Dialogues are unvoiced, so you won&#39;t see them without subtitles on. They aren&#39;t important, just a warning.\r<br />- Not all innkeepers have these dialogues. See README tab at the top of this page.\r<br />- You might get a strange papyrus log entry if you turn objectives and failure ON, if they were previously off, and you turn them ON during a special event day. Harmless, just a heads-up.\r<br />- Some of the NPC birthday log entries might have strange formatting. Please report any instances of this. Thanks.\r<br />\r<br />[center][b][size=4][color=orange]Compatibility[/color][/size][/b][/center]\r<br />\r<br />[b]- No gamebreaking issues. Just some preference issues, or things to be aware of:[/b]\r<br />\r<br />- Wet and Cold - Holidays: V1.31 adds a Settings option. Choose YES if running Holidays as well. Be aware of the following things, as well:\r<br />-&gt; Holidays and SEoT deal with notifications differently, the former by courier, etc, the latter by quest objectives and debug notifications. You can turn off SEoT notifications (and/or quest objectives) with a Settings option, otherwise you&#39;ll get courier + debug notifications, which is fine. Just a preference thing.\r<br />-&gt; Holidays and SEoT use different birthday systems, so you have to set your birthday in both. You&#39;ll also receive your gifts differently in WaC than in SEoT (SEoT: speak to an innkeeper). Using both gives 2 distinct sets of gifts, which is nice.\r<br />-&gt; Load order? No issues. Other conflicting issues will occur regardless of load order, due to the designs of the mods. Put mine after Holidays, maybe, but it doesn&#39;t matter.\r<br />\r<br />- Book Covers Skyrim - BCS might give strange covers to my books. Will fix in future version.\r<br />- Compatible with all BARTER mods.\r<br />- Compatible with RENTAL mods, BUT: If using Perseids Inns and Taverns (which I do), your room won&#39;t be free on Heart&#39;s Day. You&#39;ll need to use the Holiday dialogue first, THEN buy your room. Neither mod is broken, it&#39;s just a convenience thing.\r<br />- Rental text WON&#39;T reflect the free room. Just know that the room is/should be free.\r<br />\r<br />- Overall load order for SEoT isn&#39;t important. Load it after rental mods, I suppose.\r<br />\r<br />[center][b][size=5][color=red]5. Requirements[/color][/size][/b][/center]\r<br />\r<br />Skyrim v. 1.9.32.0.8 (Skyrim.esm, Update.esm)\r<br />Does NOT require SKSE, SkyUI, or any DLC.\r<br />\r<br />Some of the upcoming versions will have optional DLC-dependent versions as well. I will maintain a version with no DLC dependencies.\r<br />\r<br />[center][b][size=5][color=red]6. Installation[/color][/size][/b][/center]\r<br />\r<br />1. &#39;Download with manager,&#39; activate in NMM, activate .esp, play.\r<br />OR 2. &#39;Download manually,&#39; activate in NMM, WryeBash, etc, activate .esp, play.\r<br />OR 3. &#39;Download manually,&#39; extract files, place manually (follow folder structure), activate .esp, play.\r<br />\r<br />[center][b][size=5][color=red]7. Updating[/color][/size][/b][/center]\r<br />\r<br />1. Uninstall currently loaded version (try to wait until a day with no special buff active. Get rid of your census, guidebook, etc, if you want)\r<br />2. Install new version\r<br />3. In-game, you should get a notification indicating success. If not, let me know.\r<br />\r<br />I don&#39;t recommend clean-saving, etc. I&#39;m not sure what would happen.\r<br />\r<br />[center][b][size=5][color=red]8. Uninstallation[/color][/size][/b][/center]\r<br />\r<br />V 1.4 will add a &#39;proper&#39; uninstallation option. I therefore recommend waiting until that is done. If you want.\r<br />\r<br />If you want an alternative to uninstalling, just open a copy of the census and choose the two options to disable notifications. This will disable the things that jump out at your and say &#34;I&#39;m installed.&#34; The dialogue options, events will still occur, but this is safer than uninstalling, like with any other script mod. However, if this doesn&#39;t work for you...\r<br />\r<br />While I don&#39;t recommend it:\r<br />\r<br />console command\r<br />stopquest SpecialEventJournal\r<br />stopquest SpecialEventNPCBDayJournal\r<br />stopquest SpecialEventQuest\r<br />stopquest SpecialEventPBDayJournal\r<br />\r<br />As applicable:\r<br />player.removeitem SpecialEventCensusForm x\r<br />player.removeitem SpecialEventBiography x\r<br />player.removeitem SpecialEventBirthdayCard x\r<br />player.removeitem SpecialEventBook x\r<br />\r<br />player.removespell SpecialEventSpellScript\r<br />\r<br />As applicable:\r<br />player.removespell ______\r<br />\r<br />In the above, use help specialevent, help &#34;special event&#34;, help *spell name*, etc to find the above words. Replace these words with the IDs listed by help. Remove the # of items you currently possess in your inventory. Remove any buffs you might have (in addition to SpecialEventSpellScript). Again, I don&#39;t recommend this, or guarantee anything. Post or message me for additional guidance if necessary.\r<br />\r<br />[center][b][size=5][color=red]9. Upcoming[/color][/size][/b][/center]\r<br />Refer to the sticky post.\r<br />\r<br />1.4:\r<br />- New Settings, including: Uninstallation, stop/start various quests\r<br />- New Event Awareness system\r<br />\r<br />&gt;1.4\r<br />- Expand current systems\r<br />- Introduce entirely new systems\r<br />- Add new items\r<br />\r<br />Options are currently being evaluated. Suggestions are always welcome.\r<br />\r<br />[center][b][size=5][color=red]10. FAQ[/color][/size][/b][/center]\r<br />\r<br />Q: Will you add __ feature?\r<br />A: If I can, I will. Preferably, said feature has to fit into my vision. Which is in my head. Suggest a feature, I&#39;ll probably add it to my list of things to do. If I can&#39;t get it working, I&#39;ll let you know.\r<br />\r<br />Q: Hey, you forgot x NPC&#39;s birthday&#33;\r<br />A: [youtube]umDr0mPuyQc[/youtube]\r<br />\r<br />Q. Will later versions require the DLC/other mods?\r<br />A. No. I&#39;ll make vanilla versions available.\r<br />\r<br />Q. Will this mod ever require SKSE or SkyUI?\r<br />A. No.\r<br />\r<br />Q. Will you ever add an MCM menu?\r<br />A. Probably not.\r<br />\r<br />[center][b][size=5][color=red]11. Credits and Thanks[/color][/size][/b][/center]\r<br />\r<br />Creationkit.com for great tutorials\r<br />UESP.net, Elderscrolls.wikia.com (and by the transitive property, thanks also to Arena and Daggerfall) for much of the information about the Special Events used in this mod\r<br />Bethesda for Skyrim\r<br />Skyrim Nexus (and nexusmods in general)\r<br />You for playing/trying my mod&#33; Thank you&#33;\r<br />\r<br />[center][b][size=5][color=red]12. Permissions[/color][/size][/b][/center]\r<br />\r<br />Please do not reupload this anywhere else. Please do not use parts of this elsewhere without talking to me first.",
  "categoryId": "78",
  "version": "1.31",
  "author": "EoDeXistence",
  "createdUnix": "1386184227",
  "updatedUnix": "1393649396",
  "containsAdultContent": false,
  "uploadedBy": "EoDeXistence",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085372",
      "name": "d Special Events of Tamriel v1_00",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Special Events of Tamriel v1_00-48498-1-00.7z",
      "uploadedUnix": "1386184183",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/ef33b3124fb1b0cf4d57ffc1ccd640c59b0664274d5b973305a6224a9953cff4/analysis/1407819366/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Special%20Events%20of%20Tamriel%20v1_00-48498-1-00.7z?fid=1000085372&ttl=1535828652&ri=8192&rs=8192&setec=bfb75283f904a81ad50c05b030790705"
    },
    {
      "fileId": "1000086218",
      "name": "c Special Events of Tamriel V1_10",
      "version": "1.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18",
      "fileName": "Special Events of Tamriel V1_10-48498-1-10.7z",
      "uploadedUnix": "1386706971",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/07000582a489b62aff7bccfd9933c0e3c32bf636cdd9cf57b213fc8e8a192ebe/analysis/1407830102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Special%20Events%20of%20Tamriel%20V1_10-48498-1-10.7z?fid=1000086218&ttl=1535828652&ri=8192&rs=8192&setec=8bd881b4e8ecf322c687355caa997ca1"
    },
    {
      "fileId": "1000088767",
      "name": "b Special Events of Tamriel v1_21",
      "version": "1.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "31",
      "fileName": "Special Events of Tamriel v1_21-48498-1-21.7z",
      "uploadedUnix": "1388285837",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/e6add02d62a5e0def8f2ed0b6eeb0d1b4f10dede68bf0aa89e0e3bb17a7f8c53/analysis/1407862879/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Special%20Events%20of%20Tamriel%20v1_21-48498-1-21.7z?fid=1000088767&ttl=1535828653&ri=8192&rs=8192&setec=33b6cdec8b0e38fe40ee7df6bd9dcbe6"
    },
    {
      "fileId": "1000090558",
      "name": "a Special Events of Tamriel v1_22",
      "version": "1.22",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "33",
      "fileName": "Special Events of Tamriel v1_22-48498-1-22.7z",
      "uploadedUnix": "1389238710",
      "modVersion": "1.22",
      "virusScanUrl": "https://www.virustotal.com/file/bfc6d900337189b6fc71177763b7909f4615d6913003a3a5bf2ef943c4e7d0b5/analysis/1407878427/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Special%20Events%20of%20Tamriel%20v1_22-48498-1-22.7z?fid=1000090558&ttl=1535828653&ri=8192&rs=8192&setec=b91a2a648512eb470c8ff3d239fe8aa3"
    },
    {
      "fileId": "1000093588",
      "name": "aa Special Events of Tamriel v1_30",
      "version": "1.30",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "74",
      "fileName": "Special Events of Tamriel v1_30-48498-1-30.7z",
      "uploadedUnix": "1390767601",
      "modVersion": "1.30",
      "virusScanUrl": "https://www.virustotal.com/file/a7137a01aee1cfaf0fb67bd4387c8db4d253529bed8e5e812f62cb689ff62a58/analysis/1407903184/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Special%20Events%20of%20Tamriel%20v1_30-48498-1-30.7z?fid=1000093588&ttl=1535828654&ri=8192&rs=8192&setec=4636bb4d6f63ac25b7d1ce20f9ced1fd"
    },
    {
      "fileId": "1000099216",
      "name": "Special Events of Tamriel v1_31",
      "version": "1.31",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "75",
      "fileName": "Special Events of Tamriel v1_31-48498-1-31.7z",
      "uploadedUnix": "1393649396",
      "modVersion": "1.31",
      "virusScanUrl": "https://www.virustotal.com/file/3479667099be77c4e9d1730556775c090d931a8774f400b4acef7fe2727bab14/analysis/1407954565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Special%20Events%20of%20Tamriel%20v1_31-48498-1-31.7z?fid=1000099216&ttl=1535828654&ri=8192&rs=8192&setec=e76d0dde6a0eb91e412d404e29977936"
    }
  ]
}