{
  "modId": 4850.0,
  "modName": "Deadly Serious Tutorial HD Normal Textures in Photoshop",
  "summary": "This is a brief tutorial on working with photoshop and stock photography to increase the level of detail in Normal maps for DDS game textures.",
  "descriptionHtml": "This is a brief tutorial on working with photoshop and stock photography to increase the level of detail in Normal maps for DDS game textures.\r\n\r\nI am writing this under a few assumptions:\r\n1: You are experienced in use of multi-layered raster editing programs (Photoshop or GIMP) which can create and export DDS textures (DXT5) with embedded alpha channels. \r\n\r\nThe techniques discussed herein require some knowledge of photoshop. As there are a number of great photoshop tutorials out there, I will not be covering that.\r\n\r\n2: You have HD stock photography to work with. You may find this at any number of stock sale sites if you don\\'t have a camera and your own collection as I do. Taking your own stock images is the professional way to do it but starting out it\\'s fine to use other sources too!\r\n\r\nThere are also a bunch of stock photography sources for free which you can find with some dedicated searching. Try looking around on deviantart (you can visit me there too at nitocris.deviantart.com too!), but remember that every stock collection has its own usage permissions. You wouldn\\'t want someone else ripping off your work, so respect stock artists too.\r\n\r\n3: You have a game texture you want to work with. I\\'ll be working with textures derived from the standard male player face in this tutorial but you could just as easily use this tutorial\\'s methods on any texture, even one made from scratch or from an entirely different game.\r\n\r\n4: You have a Photoshop CS5.1 or can muddle through with a similar program. There are trial licenses and student licenses for a lot of these programs, as well as low cost alternatives. I won\\'t be looking at compatibility methods for GIMP but based on what I do and say, someone experienced with GIMP (which I am not) should be able to follow along and gain from this tutorial.\r\n\r\nThat\\'s how I do it, in three steps (lol) as requested by doomfunk. Maybe you have your own way and would like to share it with the rest of us!\r\n\r\n\r\nI hope this has been helpful to you, remember to endorse this file and leave a comment to let me know what a radical awesome lady I am in the comments section of this upload. Thanks in advance for being kind, I am a shy and sensitive robot.\r\n-Nitocris",
  "categoryId": "82",
  "version": "1.0",
  "author": "nitocris",
  "createdUnix": "1325173739",
  "updatedUnix": "1325174093",
  "containsAdultContent": false,
  "uploadedBy": "DeadlySeriousGames",
  "primaryFile": null,
  "files": [
    {
      "fileId": "14829",
      "name": "Deadly Serious Tutorial-  HD Normal Textures in Photoshop",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3546",
      "fileName": "Deadly Serious Tutorial-  HD Normal Textures in Photoshop-4850-1-0.rar",
      "uploadedUnix": "1325174093",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d174634fa2a086adc5a3f2aa19ee57fc713ec087d29517f4a500c1e84dcb924b/analysis/1406568023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deadly%20Serious%20Tutorial-%20%20HD%20Normal%20Textures%20in%20Photoshop-4850-1-0.rar?fid=14829&ttl=1535761095&ri=8192&rs=8192&setec=3d34c9aa604643db5d94ae65dcca53ea"
    }
  ]
}