{
  "modId": 48524.0,
  "modName": "Better Red Eagles Bane",
  "summary": "Changes the stats of Red Eagles Bane to be stronger and make more sense with how it is described in The Legend of Red Eagle.",
  "descriptionHtml": "I was searching for a mod that I thought would be quite easy to find. I wanted to bring the sword Red Eagle&#39;s Bane in line with the way it was described in lore, a powerful flaming sword, and to make it a better quest reward without unbalancing it. I was surprised to find that while there were several great new models for the sword, there were no mods that changed its stats. This is an extremely simple mod and I was surprised that no one else had made it already, so I made it myself. This was originally for personal use but I thought I would release in case anyone else wanted it. This mod only changes the stats of Red Eagle&#39;s Bane, the quest reward you get when you pull the sword out of the stone, not Red Eagle&#39;s Fury, the sword you get at the start of the quest. It you are using a model replacer for Red Eagle&#39;s Fury, put this mod first in your load order.\r<br />\r<br />Old Stats:\r<br />Damage: 11\r<br />Enchant: undead up to level 13 are set on fire and run away for 30 seconds\r<br />\r<br />New Stats:\r<br />Damage: 11 &lt;-- unchanged\r<br />Enchant: 25 fire damage and undead up to level 16 run away for 30 seconds\r<br />\r<br />With these changes Red Eagle&#39;s Bane is now a fire-type counterpart to the Pale Blade which has similar stats but does frost damage and causes humans to flee instead of undead. \r<br />\r<br />If you like mod, saying something in the comments. If you hate something about the mod, say something in the comments. Feedback is useful.\r<br />\r<br />Other Great Mods:\r<br />Unique Uniques- to complete the other side of the equation and make Red Eagle&#39;s Bane look powerful as well",
  "categoryId": "55",
  "version": "1.0",
  "author": "Lordcynic",
  "createdUnix": "1386211407",
  "updatedUnix": "1386211401",
  "containsAdultContent": false,
  "uploadedBy": "Lordcynic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085405",
      "name": "Better Red Eagles Bane",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Better Red Eagles Bane-48524-1-0.7z",
      "uploadedUnix": "1386211401",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8805e1261faaa1f5c6e70044a0b86e8273810d072772cc79ba9e9cce0e19dff5/analysis/1407819936/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Red%20Eagles%20Bane-48524-1-0.7z?fid=1000085405&ttl=1535828687&ri=8192&rs=8192&setec=11267a366029e23ee5a061cf4bbede96"
    }
  ]
}