{
  "modId": 48544.0,
  "modName": "Combat Drama Overhaul Beta",
  "summary": "Save the drama fo yo mama.",
  "descriptionHtml": "[center][b][size=15][color=blue]DO YOU LIKE MY WORK?[/center][/b][/size][/color]\r<br />[CENTER][i][size=4]Feel free to return the favor by listening to my favorite people in the world:[/size]\r<br />[size=5][color=red]Driver Friendly&#33;[/color][/size]\r<br />(Screaming and taking off your bra is optional, but recommended)[/i]\r<br />\r<br />[youtube]MOrAic-vuoM[/youtube][/center]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center][b][size=15][color=pink]COMBAT DRAMA OVERHAUL[/color][/center][/b][/size]\r<br />\r<br />\r<br />[center][b][size=4]THIS MOD REQUIRES SKSE AND THE LATEST SKYRIM UPDATE.[/size][/b][/center]\r<br />\r<br />\r<br />[size=4][center]\r<br />[url=http://skyrim.nexusmods.com/mods/32597/?]Dragon Combat Overhaul[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/37216/?]Civil War Overhaul[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/43241/?]Fire and Ice Overhaul[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/48544/?]Combat Drama Overhaul[/url]\r<br />[/size][/center]\r<br />\r<br />\r<br />[center]Bro-jewel did a review of this mod before I was ready&#33;  Whatevs, he explains it far better than I can.\r<br />\r<br />[youtube]yOgg36fJ84Q[/youtube][/center]\r<br />\r<br />\r<br />\r<br />[b][size=5]INSTALLATION NOTES[/b][/size]\r<br />\r<br />DO NOTHING OTHER THAN THIS.\r<br />\r<br />Install with or without mod manager.  Profit.\r<br />\r<br />If you are not seeing killcams like you should and have tried using the MCM menu to test if they work at all, then you may be having trouble with your skyrim.ini file.  Open it up, and if you don&#39;t already have this section, copy it in VERBATIM.  If you already have it then you don&#39;t need the [VATS] line, but overwrite everything else with this.  These are the ini values I am using and it works fin(CDO overwrites these changes dynamically).\r<br />\r<br />[VATS]\r<br />uVATSRangedPercentSneak=100\r<br />uVATSRangedPercentGlobal=100\r<br />bVATSMultipleCombatants=1\r<br />;bVATSIgnoreProjectileTest=1\r<br />bVATSAllowNoKill=1\r<br />bVATSForceRanged=0\r<br />;bVATSSmartCameraCheckDebug=1\r<br />;bVatsDebug=1\r<br />fVATSKillMoveEnd=1.0000\r<br />\r<br />IF YOU ARE UNINSTALLING\r<br />\r<br />It&#39;s all good.  I think.\r<br />\r<br />\r<br />[size=3][i]\r<br />DRAMA QUEEN: &#34;Someone who turns something unimportant into a major deal. Someone who blows things way out of proportion when ever the chance is given.&#34;\r<br />\r<br />~ Urban Dictionary\r<br />[/size][/i]\r<br />\r<br />[center][size=8][color=purple]TL;DR[/COLOR][/SIZE][/CENTER]\r<br />\r<br />[size=3][b][center]OG LIKE PRETTY CAMERA ANGLES[/center][/b][/size]\r<br />\r<br />\r<br />[b][size=5][color=pink]DRAMA MAMA[/b][/size][/color]\r<br />VATS camera shots no longer require a kill, the epic &#34;Bow killmoves&#34; can now occur when the target is at full health.  Chances are user-controlled by a MCM menu.  For that matter, all ranged killmoves are now controlled by MCM, you can just use this mod to turn them off without having to resort to ini edits.\r<br />\r<br />[img]http://24.media.tumblr.com/tumblr_lpztatsAiE1qlh28io1_500.gif[/img]\r<br />\r<br />\r<br />[b][size=5][color=pink]I&#39;M READY FOR MY CLOSE-UP, MR. DEVILLE[/b][/size][/color]\r<br />I now have somewhat-total control of all camera angles, so that means I can now create new killcam shots for regular and ranged killmoves.  I&#39;ve so far very basically expanded vanilla ranged killmoves and opened up normal camera angles for sabrecat and bear non-ranged killmoves(because they annoyed me).  I have also restored killcams for firestorm and other cast on player area of effect spells.  This will be dramatically expanded on in future versions.  \r<br />\r<br />[b][size=5][color=pink]MAKE IT STOP[/b][/size][/color]\r<br />Vanilla camera pathing can leave you staring inexplicably at your leg or a patch of dirt for a long time.  CDO adds new parameters in so that a) you&#39;re less likely to stare at dirt and b) all camera paths have been dramatically reduced in length.  Non-kill ranged killmoves(the terminology is stupid, I know, but DANGIT ONE THING AT A TIME) are significantly faster than their &#34;kill&#34; killmove counterparts(see?  confusing?  I HATE MY LIFE.  MAKE IT STOP.  MAKE DANE COOK STOP)\r<br />\r<br />[img]http://assets.diylol.com/hfs/fec/e79/a9c/resized/vengeance-dad-meme-generator-they-liked-dane-cook-they-had-to-die-5969e1.jpg[/img]\r<br />\r<br />[b][size=5][color=pink]VARIETY IS THE SPICE OF LIFE.  SO ARE DRUGS.[/b][/size][/color]\r<br />As always, the main goal of my mods is to make it so no two things are ever alike.  While this is not achieved yet, camera shots for ranged killmoves, especially for dragons, have been dramatically increased in variability.  New versions will expand this even further.\r<br />\r<br />\r<br />[youtube]qmO5IxbUpTE[/youtube]\r<br />\r<br />\r<br />[b][size=5]I STILL DON&#39;T UNDERSTAND - WHAT IS THIS AND WHAT DOES IT DO?[/b][/size]\r<br />\r<br />This mod does 4 things: \r<br />#1 It unlocks the ability to do ranged killmoves without actually killing the target \r<br />#2 It gives you control over how often ranged killmoves play \r<br />#3 It adds new ranged killmoves and makes vanilla ranged killmoves more fluid \r<br />#4 It expands camera angle variation for non-ranged killmoves.\r<br />\r<br />Think of it this way - a non-ranged killmove in Skyrim is simply an animation, the actual killmove you see is an animation PLUS camera angles to show off the effect.  A ranged killmove on the other hand has no new animation, it simply adds new camera angles to the normal animation.  What CDO does is play with those camera angles and expands their variety greatly while making the entire killmove process feel more fluid and more conditionalized so you get the best dramatic experience.  For example, all vanilla camera angles simply take a camera shot from a single perspective for the entire duration of the killmove.  My new camera paths combine multiple perspectives, for example, one added killmove pans around the player as the player fires, then follows the projectile to its target, stops in mid air and spins around the target just prior to landing, and then following the target once it has been hit.  CDO allows me to make killmoves feel fresh and varied without having to go through the process of creating new animations - instead I use vanilla animations and repurpose them to fully utilize all the cool tricks bethesda gave themselves but didn&#39;t use.  *le sigh* so much power....wasted.\r<br />\r<br />I hope that kind of explained it to you.  As I said before, the only way to really understand what it does is to just sit down and use it and get a feel for it.  The default values should be good enough to make your combat feel overall more dramatic.\r<br />\r<br />\r<br />[b][size=5]KNOWN ISSUES[/b][/size]\r<br />\r<br />Projectiles may turn toward their targets midflight because they can&#39;t handle the awesomeness I wield with my crotch.  You&#39;ll only really notice with fireballs and the like.\r<br />\r<br />Concentration spells like Sparks will break in concentration if a killmove makes it past the primary killmove chance barrier and gets stopped by the secondary killmove barrier.  This is why I have a concentration toggle(it is a secondary barrier though, I couldn&#39;t make it primary) and one of the reasons why magic is separated in the primary barrier.  If it&#39;s a big deal, just turn down the primary magic chance and turn up the secondary chance to even it out.  Otherwise, prepare to get stopped every once in a while and have to recast.\r<br />\r<br />\r<br />\r<br />[b][size=5]KNOWN INCOMPATIBILITIES[/b][/size]\r<br />\r<br />Somebody tell me if this causes issues with Dance of Death.  I don&#39;t think it will, I&#39;m running this with Dance of Death to test it.\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=5]FREQUENTLY ASKED QUESTIONS[/b][/size]\r<br />\r<br />&#34;Your description sucks.&#34;\r<br />Write your own mods and you can make whatever descriptions you want.\r<br />\r<br />&#34;Seriously, your description sucks.&#34;\r<br />\r<br />[youtube]VuGiK-X9-0A[/youtube]\r<br />\r<br />\r<br />&#34;I don&#39;t understand, why would anybody want this?&#34;\r<br />I don&#39;t understand why anybody would NOT want this.  If you like killcams, this lets you have as many of them as you want, lets you control when and how they play, and they&#39;re better than vanilla.  If you don&#39;t like killcams, you can use this mod to reduce how often they play or turn them off entirely.  This mod entails almost no CPU usage/script lag, is compatible with everything, and won&#39;t break your game(as far as I know).  The only reason not to have this mod is if you hit the 255 mod limit and you have killcams turned off in your ini file already.\r<br />\r<br />&#34;This is obviously not done: why did you release the beta and when is the first version coming out?&#34;\r<br />There&#39;s certainly much more work to do, but I needed to release the beta because I need your opinions on the increased fluidity of killcams, how to describe things in the MCM so you understand them, and which cams may not be working as intended.  The full release will likely be near the end of January, and I&#39;d like to get some opinions in that time.\r<br />\r<br />&#34;So wait, you&#39;re saying that Dance of Death and CDO are similar, why not just have DoD and are they compatible?&#34;\r<br />Think of it this way, DoD and CDO operate on opposite sides of the same coin.  DoD concerns itself with mainly the animations that you can use, and how often the non-ranged killmoves play.  CDO affects camera paths and ranged killmoves - this means that I can still edit the other half of killmoves(the camera paths) without running afoul of DoD.  On that note, compatibility should not be an issue.  I do vaguely remember that DoD edits one or two camera paths, but from initial testing it doesn&#39;t look like a problem.  Regardless, let CDO overwrite DoD if you&#39;re having problems.\r<br />\r<br />\r<br />[b][size=5]GLOWING TESTIMONIALS[/b][/size]\r<br />\r<br />&#34;Skyrim as directed by Uwe Boll&#34; - ebutouY skcuS (I see what you did there)\r<br />\r<br />&#34;Will this help me see up my character&#39;s skirt?&#34; - BAD INTERNET NO DONUT",
  "categoryId": "51",
  "version": "1",
  "author": "Apollodown",
  "createdUnix": "1386307336",
  "updatedUnix": "1386370186",
  "containsAdultContent": false,
  "uploadedBy": "Apollodown",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085557",
      "name": "Combat Drama Overhaul - BETA",
      "version": "BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17",
      "fileName": "Combat Drama Overhaul - BETA-48544-BETA.7z",
      "uploadedUnix": "1386305975",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/54cce97a6fee610e6b728e517d7931097d2583fe8ed92ee9d8375e102dee3683/analysis/1407821890/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Combat%20Drama%20Overhaul%20-%20BETA-48544-BETA.7z?fid=1000085557&ttl=1535828744&ri=8192&rs=8192&setec=1c12538d3d671e1efedf5f1a90d95b22"
    },
    {
      "fileId": "1000085560",
      "name": "Combat Drama Overhaul Beta Build 2",
      "version": "BetaBuild2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17",
      "fileName": "Combat Drama Overhaul Beta Build 2-48544-BetaBuild2.7z",
      "uploadedUnix": "1386308895",
      "modVersion": "BetaBuild2",
      "virusScanUrl": "https://www.virustotal.com/file/f738c9f21d661640e3235baf17e099b5254673cd3d7df9b1297fbf31a7ef0b2e/analysis/1407822064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Combat%20Drama%20Overhaul%20Beta%20Build%202-48544-BetaBuild2.7z?fid=1000085560&ttl=1535828744&ri=8192&rs=8192&setec=6ce20343148c7a11fc5b0e1b4dfb2fee"
    },
    {
      "fileId": "1000085655",
      "name": "Combat Drama Overhaul Beta Build 3",
      "version": "BetaBuild3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "Combat Drama Overhaul Beta Build 3-48544-BetaBuild3.7z",
      "uploadedUnix": "1386370186",
      "modVersion": "BetaBuild3",
      "virusScanUrl": "https://www.virustotal.com/file/970c7d06d9be8ac128089f0b8557692059e765b6dc799f227850e1c4b0397d76/analysis/1407823167/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Combat%20Drama%20Overhaul%20Beta%20Build%203-48544-BetaBuild3.7z?fid=1000085655&ttl=1535828745&ri=8192&rs=8192&setec=346e602936994b26e0849e44340b886a"
    }
  ]
}