{
  "modId": 48541.0,
  "modName": "Paladin Auras and Elemental Aspects",
  "summary": "Adds unique Lesser Powers that enhance combat variety and complexity: Auras that support a paladin-type playstyle, and Aspects that grant bonuses and penalties to melee and Destruction magic.  Switch between powers mid-combat without the use of spells or items.  Aims for maximum compatibility with existing combat and magic mods.",
  "descriptionHtml": "[center][color=#ffcc66][size=6][b]Aspects and Auras - BETA[/b][/size][/color][/center]\r<br />\r<br />[center][b][color=#ff3333]Updated 12/7/2013.  See Changelog for list of changes.[/color][/b][/center]\r<br />\r<br />\r<br />[center][b]THIS MOD IS STILL IN BETA STAGE.  Please help me improve it by reporting any bugs or major issues.[/b][/center]\r<br />\r<br />[center]This mod adds six abilities to the game that can be acquired by any Dragonborn with sufficient skill in [b]Alteration[/b] or [b]Restoration[/b] magic.  The intent is to add effects that complement and enhance existing combat and magic mods, rather than adding/changing entire perk trees or creating yet another mod that adds a huge amount of new spells.[/center]\r<br />\r<br />[center]The abilities fall into two categories: Three Alteration-based &#34;[b]Aspects[/b]&#34; and three Restoration-based &#34;[b]Auras[/b].&#34;  [b]Aspects[/b] are akin to &#34;stances&#34; that enhance both physical and magic-based combat power, but with penalties that make them situational.  [b]Auras[/b] grant recurring combat bonuses to yourself and nearby allies.  The intent of Auras is to support a classic Paladin-type playstyle, granting semi-passive Restoration-like abilities without needing (or in addition to) vanilla Restoration spells.[/center]\r<br />\r<br />[center][b]Only one Aspect or Aura may be active at any time.[/b][/center]\r<br />\r<br />\r<br />[center][b][size=5]Who Might Like This?[/size][/b][/center]\r<br />\r<br />Let&#39;s face it: No matter what your playstyle or difficulty setting, combat in Skyrim can get pretty boring.  This mod intends to encourage active and intelligent gameplay, making it possible to face tougher odds or higher difficulty settings.  For example:\r<br />\r<br />* Aura of Fortitude and Aura of Light keep your fellow Civil War soldiers alive longer.  Keep both of them up to greatly increase their survivability and turn the tide of battle.\r<br />\r<br />* Use Aura of Valor to make your summons and melee/archer followers as pwnsauce as you are.  Or at least add a little helping of pwnsauce, because they will never be quite as pwnsauce as you.\r<br />\r<br />* Facing a bunch of bandits in a tight space?  Use Aspect of Ice to &#34;turtle up&#34; while you heal yourself and your companions, then jump back into the fray.\r<br />\r<br />* Dragon Priests are pesky buggers if you&#39;re melee.  Use Aspect of Lightning to chase them down and destroy their magicka while you shrug off their spell damage.\r<br />\r<br />* Need to fire off a Blizzard while getting pounded?  Turn on Aspect of Ice to reduce your chances of getting interrupted, then switch to Aspect of Flame just before casting to lay the hurt down.\r<br />\r<br />* Maybe pissing off that Giant wasn&#39;t such a good idea.  Use Aspect of Ice to freeze him, then switch to Aspect of Lightning to run away with your tail between your legs, you wuss.\r<br />\r<br />* Twisting Aura of Light -&gt; Aspect of Ice at regular intervals can keep you on your feet in even the worst of situations, as well as offsetting Ice&#39;s stamina penalty.\r<br />\r<br />* Aura of Valor -&gt; Aspect of Flame at regular intervals will make you a physical-damage wrecking ball.  Just try not to get hit.\r<br />\r<br />\r<br />[center][b][size=5]Acquisition[/size][/b][/center]\r<br />\r<br />[center]Aspects: Just outside of &#34;your room&#34; in the Hall of Attainment at the College of Winterhold, you&#39;ll find a book on a pedestal called &#34;Elemental Aspects.&#34;  Activate the book to acquire these new abilities.[/center]\r<br />\r<br />[center]Auras:  To the left of the main shrines in the Temple of the Divines (Solitude) and the Temple of Talos (Windhelm), you&#39;ll see a pedestal with a book titled &#34;Dragonborn Auras&#34; on it.  Activate the book to learn Auras.[/center]\r<br />\r<br />[center][b]Each Aspect or Aura requires 5 Dragon Souls to learn.[/b][/center]\r<br />\r<br />\r<br />\r<br />[center][b][size=5]What They Do[/size][/b][/center]\r<br />\r<br />[center][color=#33ffff][b]Arcane Aspects[/b][/color] grant bonuses and penalties when active.  To activate an Aspect, equip it (under &#34;Lesser Powers&#34;) and hit Z.  To deactivate it, press Z again while it is equipped (or wait an hour for it to expire).[/center]\r<br />\r<br />[color=#33ffff][size=3][b]Aspect of Ice[/b][/size][/color]\r<br />[b]Requirements:[/b] 30 Alteration\r<br />[b][i]Bonuses:[/i][/b]\r<br />You take 35% less damage from melee attacks and 50% less damage from ranged attacks.\r<br />You have a 50% chance to avoid stagger effects.\r<br />Spells and potions that restore health are 50% more effective.\r<br />[b][i]Enchantment:[/i][/b]\r<br />Melee and ranged attacks deal 10 frost damage and slow the target for 6 seconds.\r<br />Sideways power attacks freeze the target for up to 12 seconds.  The effect is dispelled if the target takes damage.  This ability can only be used once every 15 seconds.  [This is especially fun with Sweep.]\r<br />[b][i]Penalties:[/i][/b]\r<br />[color=#ff3333]Movement speed decreased by 20%.[/color]\r<br />[color=#ff3333]Melee and ranged damage reduced by 20%.[/color]\r<br />[color=#ff3333]Stamina regeneration reduced by 80%.[/color]\r<br />[color=#ff3333]You take 25% more damage from Destruction spells and effects.[/color]\r<br />\r<br />[color=#33ffff][size=3][b]Aspect of Lightning[/b][/size][/color]\r<br />[b]Requirements:[/b] 40 Alteration, Aspect of Ice\r<br />[b][i]Bonuses:[/i][/b]\r<br />You deal 20% more damage with physical attacks and Destruction spells.\r<br />You take 35% less damage from Destruction spells and effects.\r<br />Magicka regeneration increased by 100%.\r<br />Movement speed increased by 20%.\r<br />[b][i]Enchantment:[/i][/b]\r<br />Melee and ranged attacks deal 10 shock damage.\r<br />Melee and ranged attacks have a 50% chance to cause a Power Surge, draining 35% of the target&#39;s maximum magicka and inflicting half the amount drained as direct health damage.\r<br />[b][i]Penalties:[/i][/b]\r<br />[color=#ff3333]Armor rating reduced by 50%.[/color]\r<br />[color=#ff3333]You take 25% more damage from physical attacks.[/color]\r<br />\r<br />[b][color=#33ffff][size=3]Aspect of Flame[/size][/color][/b]\r<br />[b]Requirements:[/b] 50 Alteration, Aspect of Lightning\r<br />[b][i]Bonuses:[/i][/b]\r<br />You deal 50% more damage with physical attacks and Destruction spells.\r<br />Magicka and Stamina regeneration increased by 200%.\r<br />Spells and power attacks cost 25% less.\r<br />[b][i]Enchantment:[/i][/b]\r<br />Melee and ranged attacks deal 10 fire damage.\r<br />Melee and ranged attacks inflict Immolation on targets, reducing their fire resistance by 25% and armor by 125 for 6 seconds.\r<br />[b][i]Penalties:[/i][/b]\r<br />[color=#ff3333]You take 25% more damage from physical attacks and Destruction spells.[/color]\r<br />[color=#ff3333]You cannot be healed by Restore Health effects (potions or spells).[/color]\r<br />\r<br />[center][b][color=#ffff88]Holy Auras[/color][/b] last for 1 minute.  While active, they cast a 12-second Blessing every 10 seconds on you and your nearby allies.  To activate an Aura, equip it and press Z.  Pressing Z again will refresh the Aura&#39;s duration and immediately refresh its Blessing.[/center]\r<br />\r<br />[color=#ffff88][size=3][b]Aura of Fortitude[/b][/size][/color]\r<br />[b]Requirements:[/b] 40 Restoration\r<br />[b][i]Bonuses:[/i][/b]\r<br />Armor rating increased by 250.\r<br />Magic resistance increased by 30%.\r<br />Block 40% more damage with your weapon or shield.\r<br />\r<br />[color=#ffff88][size=3][b]Aura of Valor[/b][/size][/color]\r<br />[b]Requirements:[/b] 50 Restoration, Aura of Fortitude\r<br />[b][i]Bonuses:[/i][/b]\r<br />One-handed, Two-handed, and Archery damage increased by 40%.\r<br />\r<br />[color=#ffff88][size=3][b]Aura of Light[/b][/size][/color]\r<br />[b]Requirements:[/b] 60 Restoration, Aura of Valor\r<br />[b][i]Bonuses:[/i][/b]\r<br />Base magicka and stamina regeneration is doubled.  Regenerate 2% of your maximum health per second while in combat.\r<br />\r<br />The bonuses from Aura of Light are multiplicative with enchantments.  In other words, if you have enchantments that grant +100% magicka regeneration, it effectively becomes +200% while Aura of Light is active.\r<br />\r<br />\r<br />[center][b][size=5]Tips and Notes[/size][/b][/center]\r<br />\r<br />- The vanilla game (NOT the mod) has an internal cooldown on Lesser Powers of about 3 seconds.  This means that you can&#39;t &#34;use&#34; the same Aspect/Aura more than once every 3 seconds.  You can switch [i]between[/i] them as quickly as you like.\r<br />\r<br />- If you are adept enough with hotkeys, you can manage to have all three Blessings active at the same time - without needing to unequip any weapons or spells.\r<br />\r<br />- Refreshing a Blessing can be useful if you find yourself moving around a lot, with allied NPCs entering and leaving your Aura range.\r<br />\r<br />- Since the Aura of Light healing effect is not a Restore Health effect, you can try using Aspect of Flame until you get low on health, switch to Aura of Light to apply its healing blessing, then switch back to Aspect of Flame.\r<br />\r<br />- To skip the requirements and add the abilities via console, use -Player.AddSpell [SpellID]-, where [SpellID] is one of the following:\r<br />Aspect of Ice: xx005386\r<br />Aspect of Lightning: xx0058F8\r<br />Aspect of Flame: xx004347\r<br />Aura of Fortitude: xx007423\r<br />Aura of Valor: xx007429\r<br />Aura of Light: xx00741F\r<br />You will need to replace &#34;xx&#34; with the appropriate code for your load order.\r<br />\r<br />- You can add 5 Dragon Souls with the console command -Player.ModAv DragonSouls 5-.\r<br />\r<br />\r<br />[b][size=4]Requirements[/size][/b]\r<br />\r<br />Requires Skyrim patch 1.8 or higher.  There are no other formal requirements, but I have not tested this without the Unofficial Patches.\r<br />\r<br />[b][size=4]Recommended Mods[/size][/b]\r<br />SkyUI ([url=http://www.nexusmods.com/skyrim/mods/3863/?]http://www.nexusmods.com/skyrim/mods/3863/?[/url]): Lets you know when effects are active.\r<br />Magic mods that make Destruction suck less.\r<br />Mods that increase combat difficulty and number of enemies.\r<br />\r<br />[b][size=4]Installation[/size][/b]\r<br />\r<br />Use Nexus Mod Manager, or extract the file contents into your Skyrim directory.\r<br />\r<br />[b][size=4]Uninstallation[/size][/b]\r<br />\r<br />Use Nexus Mod Manager, or delete Aspects_and_Auras.bsa and Aspects_and_Auras.esp from your Data directory.\r<br />\r<br />I HIGHLY RECOMMEND MAKING A CLEAN SAVE BEFORE USING THIS MOD.  Skyrim has a bad habit of saving script information in save game files, so future updates to this mod may not &#34;take&#34; properly if applied to a save game with an older version.\r<br />\r<br />[b][size=4]Compatibility Issues[/size][/b]\r<br />No known compatibility issues.  Mods that change the Hall of Attainment in the College of Winterhold  or either of the Temples may conflict.\r<br />\r<br />With a few minor exceptions, this mod only makes use of custom scripts, perks, and spell effects, and does not modify anything in the base game except the Hall of Attainment and the two Temples.  There should be nearly no chance of conflicts with other mods that affect gameplay, but the interaction of this mod&#39;s intended effects with other mods may produce some strange results.\r<br />\r<br />[b][i]Changelog:[/i][/b]\r<br />[i]v0.2:[/i]\r<br />Removed armor penetration from Aspect of Ice.\r<br />Aspect of Ice now increases the effectiveness of Restore Health spells and potions by 50%.\r<br />Increased Deep Freeze duration to 12 seconds.\r<br />Fixed an issue with the Book where it was possible to proceed to the &#34;select ability&#34; page with no abilities available.\r<br />Aura duration decreased to 1 minute.\r<br />Aspects and Auras are now learned via separate books.  The Aspect book is still in the Hall of Attainment at Winterhold College.  Aura books can now be found to the left of the main shrines in the Temple of the Divines (Solitude) and the Temple of Talos (Windhelm).\r<br />Modified Power Surge visual effects to make it more apparent when it activates.\r<br />Modified Aspect of Lightning penalty to reduce armor rating by 50%, rather than a fixed amount.\r<br />Increased armor and magic resistance bonus from Blessing of Fortitude.\r<br />Increased damage bonuses for Aspect of Flame and Aspect of Lightning.\r<br />Increased cost reduction bonuses for Aspect of Flame.\r<br />\r<br />[i]v0.1:[/i]\r<br />Initial version.",
  "categoryId": "24",
  "version": "0.2",
  "author": "Rynas",
  "createdUnix": "1386304944",
  "updatedUnix": "1386458409",
  "containsAdultContent": false,
  "uploadedBy": "Rynas",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085550",
      "name": "Aspects and Auras BETA",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Aspects and Auras BETA-48541-0-1.rar",
      "uploadedUnix": "1386299252",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/08b52c10b860b276d83ae2c38d3b9b89a460db3231b067c4ac344530084282ef/analysis/1407821887/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspects%20and%20Auras%20BETA-48541-0-1.rar?fid=1000085550&ttl=1535828736&ri=8192&rs=8192&setec=3ff07076c793446211806c8da9f418e5"
    },
    {
      "fileId": "1000085784",
      "name": "Aspects and Auras BETA 2",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Aspects and Auras BETA v02-48541-0-2.rar",
      "uploadedUnix": "1386458409",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/dbc5b9654a0319423c93c77ef6368dec71da4b1c64cf8ec492948c0f422edf82/analysis/1407824408/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aspects%20and%20Auras%20BETA%20v02-48541-0-2.rar?fid=1000085784&ttl=1535828737&ri=8192&rs=8192&setec=477aec88259739a713a0ff9b7353e755"
    }
  ]
}