{
  "modId": 48561.0,
  "modName": "Mammoth Loot",
  "summary": "Adds a few new loot items involving mammoths.",
  "descriptionHtml": "    This mod adds mammoth pelts (which can be made into leather) to the obtainable loot from mammoth corpses, as well as adding the options to carve mammoth tusks into slightly more valuble (and nicer looking for decoration) scrimshaw, and grind them into powdered mammoth tusk. It takes one tusk and a forge to make a scrimshaw, and four tusks and a forge to make powdered mammoth tusk.\r<br />    I made this mod basically to add a little to the immersion of the game. I always thought it was weird that so many animals you can hunt have pelts but mammoths do not. I also didn&#39;t like that a fairly powerful ingredient was called &#34;powdered mammoth tusk&#34;, but you couldn&#39;t make it from regular mammoth tusks. As for the scrimshaw, I liked the carvings used on the mammoth tusk models for the giants&#39; herded mammoths, and thought it would be cool to have a tusk that looked like that for decoration.\r<br />\r<br />    If anyone finds any bugs in this mod (missing/glitched textures, missing recipes, etc.) please let me know in the discussion, and I&#39;ll fix it as soon as possible.",
  "categoryId": "85",
  "version": "1.0",
  "author": "Gerokeymaster",
  "createdUnix": "1386372805",
  "updatedUnix": "1386372470",
  "containsAdultContent": false,
  "uploadedBy": "Gerokeymaster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085657",
      "name": "Mammoth Loot",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "521",
      "fileName": "Mammoth Loot-48561-1-0.rar",
      "uploadedUnix": "1386372470",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7017af2ec8cf2237eeff58a7e26f5bb1cdf5cc0b874c11946f438a756d017e51/analysis/1407823325/",
      "changelogHtml": " Uploaded The Mod <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mammoth%20Loot-48561-1-0.rar?fid=1000085657&ttl=1535828769&ri=8192&rs=8192&setec=7343120552aea304995b26fabde1f823"
    }
  ]
}