{
  "modId": 48570.0,
  "modName": "Ultimate Immersive Classes",
  "summary": "UIC provides a choice of class and subsequent class loadout in the start of the game, ranging from farmer to Alik&#39;r to assassin to cleric. There are a total of 38 loadouts, each with unique advantages and skills. UIC also utilizes resources from many mods without annoying dependencies and requirements.",
  "descriptionHtml": "[center][size=5][b][/b][/size][size=3]Sorry for taking so long getting back, but the website is up&#33;  All the art assets are entirely temporary, but the site itself is ready for use: [/size][url=http://dragondudemods.forumotion.ca/][u][color=#0066cc][size=3]http://dragondudemods.forumotion.ca/[/size][/color][/u][/url][/center]\r<br />\r<br />[img]http://www.mediafire.com/convkey/8520/pct9hqh81gzax1pfg.jpg[/img]\r<br />\r<br />&#34;Ultimate Immersive Classes&#34; provides a choice of class and subsequent class loadout in the start of the game, ranging from farmer to Alik&#39;r to assassin to cleric. There are a total of 38 loadouts, each with unique advantages and skills. UIC also utilizes resources from many mods without annoying dependencies and requirements.  By identifying installed mods, such as Frostfall, on runtime UIC is able to provide the ultimate specialized class system.  Designed for seamless integration, spectacular immersion, and definite compatibility.\r<br />\r<br />[img]http://www.mediafire.com/convkey/d83e/7y8dfa7f6gcs2g5fg.jpg[/img]\r<br />\r<br />The classes include Commoner, Faction, Warrior, Thief, Mage, and Nomad.  Each class has a multitude of loadouts to choose from.  Each loadout has relavant armor, weapons, spells, potions, books, and more.  Be sure to browse through your inventory after choosing your loadout because they have more items than just what you see equiped&#33;\r<br />\r<br />[size=5][b]Commoner[/b][/size]\r<br />Loadouts: Farmer, Miner, Blacksmith, Merchant, Alchemist, Noble, Bard, Seaman, Chef\r<br />\r<br />Commoners are the every day people who inhabit the cities and outskirts of Skyrim.  They are the backbone of Skyrim&#39;s work force and mercantilism.  These starting sets focus a great deal on immersive role-playing, but can also be a huge help when starting in Skyrim&#39;s varios cities and mines.  Take the merchant for example, they don&#39;t start off with any weapons, but they have some gold that you could spend on anything, or maybe use to get more money: &#34;The rich get richer&#33;&#34; - Bender. Farmers are probably the hardest option, but don&#39;t let that stop you. Be a legend and play farmer mode&#33; Miners get some resources and, you guessed it, a pickaxe. Blacksmiths get materials and other useful things to help them towards mastering the skyforge&#33;\r<br />\r<br />[size=5][b]Faction[/b][/size]\r<br />Loadouts: Alik&#39;r, Psijic, Thalmor, Silver Hand, Forsworn, Vigilant of Stendar\r<br />\r<br />The land of Tamriel is filled with various factions and guilds, each with their own history and influence.  Some of these loadouts are native to Skyrim, such as the Forsworn and Silver Hand, while others hail from regions far away.  The Alik&#39;r, a ruthless group of nomadic warriors from Hammerfall, are one of these factions, retreating to Skyrim due to the &#34;holy war&#34; in their homeland.  The Psijic are an ancient order of Mystics from the Summerset archipelago and are reclusive worshippers of the Old Ways.  Imperials, Stormcloaks, members of the Thieves Guild, members of the Dark Brotherhood, and Companions are not featured in UIC because they are major joinable factions within the game.\r<br />\r<br />[size=5][b]Warrior[/b][/size]\r<br />Loadouts: Berserker, Warden, Brawler, Knight, Paladin, Dark Knight\r<br />\r<br />&#34;Unafraid of light weaponry, they plow into the fray with little regard for injury. Masters of all melee tools, they put little faith in the magical arts.&#34;  Berserkers, wardens, brawler, and knights are all wield the power of raw strength, asserting their might through sword and fist.  Unafraid of large weapons and shields; warriors wear the thickest armor.  Paladins and Dark Knights are warrior-mage dual classes, practicing opposing magical arts to one another.\r<br />\r<br />[size=5][b]Thief[/b][/size]\r<br />Loadouts: Assassin, Ranger, Mugger, Swindler, Agent, Acrobat\r<br />\r<br />&#34;Profiting from the losses of others is their love. Able to be swift in shadow, and crafty in bartering. Locks are enemies, and lock-picks are their swords.&#34;\r<br />Assassins, the venomous serpents hired by Skyrim&#39;s infamous organizations, strike daggers into unsuspecting foes.  Rangers are masters of distanced combat and can eradicate most foes before they have a chance to draw their swords.  Equiped with a formidable array of arrows, rangers have countermeasures for all targets.  Muggers are the intimadators, oppressing all disagreements and opposition, with or without armed conflict.  Swindlers are lowlife dealers, with little respect from or for others.  Agents and Arcrobats are thief-mage dual classes, representing surreptitious and ranged combat, respectively.\r<br />\r<br />[size=5][b]Mage[/b][/size]\r<br />Loadouts: Wizard, Sorcerer, Cleric, Necromancer, Illusionist, Warlock\r<br />\r<br />&#34;Preffering to use their extensive knowledge of all things magical, they wield a might more powerful than the sharpest blade.&#34;  The wizard is a master of the arcane, not to be mistaken for a scholar.  Destruction rains upon all during their anger, few withstanding their flame, chill, and shock.  Sorcerers find magical power threw enchantments, wielding elemental weapons and arcane clothing.  Wielding maces and magic, clerics are prepared to lend an helping hand when support is needed.  Masters of healing, clerics can cheat death itself during and after a fight.  Necromancers raise zombies from the graves, except that dead stormcloak in the Helgen keep. He&#39;s immune, or rather his corpse is immune, lol wat.  They specialize in death, whether it be undoing it or causing it.  Illusionist rely on the weapons of their enemies, pitting even the strongest of foes against his own allies.  Capable of disorienting and fooling foes into states of confusion, wrath, or absolute fear.  Warlocks alter the matter of Nern, with skills ranging from turning gold to stone, surpassing any landscape or ocean, or even shielding oneself with magic. \r<br />\r<br />[size=5][b]Nomad[/b][/size]\r<br />Loadouts: Wanderer, Hunter, Sell Sword, Pilgrim\r<br />\r<br />Little is known about the nomadic wanderers, other than their legendary survival skills.  Constructing camps, besting weather, and living in any environment are their specialities.  Equipped with fur and cloaks rather than steel, nomads are adept at besting one of Skyrim&#39;s most ruthless enemies: Cold.  Designed for Frostfall, this loadout will keep you from freezing  to death in Skyrim&#39;s northern climates.  Sell swords are nomadic warriors who have excellent survival skills, yet still wield a sword with deadly precision.  Hunters are nomadic thieves and pilgrims are nomadic mages.\r<br />\r<br />[img]http://www.mediafire.com/convkey/898e/k69kt6tuj3sjkirfg.jpg[/img]\r<br />\r<br />- NMM: No explanation needed, that&#39;s the point.\r<br />- Manual: Just copy/merge the RARs content into your Skyrimdata folder and activate the esp\r<br />\r<br />[img]http://www.mediafire.com/convkey/c202/7shm6c5c687vg7pfg.jpg[/img]\r<br />\r<br />- Everything&#33;\r<br />- Compatible with alternate start mods like Live Another Life\r<br />- The only way there could be a conflict is if a mod entirely removed the MQ101 quest form, which would seriously break the game anyways\r<br />- Sounds of Skyrim and Ultimate Immersive Classes are scripted to have their message boxes appear at the same time. This means my mod may appear while sieving through Sounds of Skyrim&#39;s messages (and vice versa). No conflict, but it may be confusing.\r<br />\r<br />[img]http://www.mediafire.com/convkey/9a7c/26618iqm782wdalfg.jpg[/img]\r<br />\r<br />- Legit and updated Skyrim copy else I will not provide support\r<br />- Ultimate Immersive Classes checks on runtime to see which mods are installed (thanks Chesko&#33;), so if you have one of the integrated mods listed below, UIC will know about it and how to use it\r<br />- See Recommended Mods - Integrated Mods for a list of non-required integrated mods\r<br />\r<br />[img]http://www.mediafire.com/convkey/6264/g83otctie7cvtm3fg.jpg[/img]\r<br />\r<br />- None\r<br />\r<br />[img]http://www.mediafire.com/convkey/bc79/d4b2h1op3ll5rrkfg.jpg[/img]\r<br />\r<br />[size=5][b]Planned Features For Next Release[/b][/size]\r<br />[b]I&#39;m working on these as we speak.[/b]\r<br />[b]Minor Content[/b]\r<br />- Give more ingredients and potions to alchemist\r<br />- Redo some misc items for a few loadouts\r<br />[b]Major Content[/b]\r<br />- Completely redo Mages class\r<br />- Lots of improvements to thief class\r<br />- Integrate Realistic Needs and Diseases\r<br />- Randomizer for thieves and mages (maybe)\r<br />- Integrate Winter is Coming\r<br />- Integrate Cloaks of Skyrim\r<br />- Integrate Become a Bard\r<br />\r<br />[size=5][b]Planned Features For Future Release[/b][/size]\r<br />[b]These may or may not be present in the next release, but I plan to do them.[/b]\r<br />- Give class loadout based items (rewards) when the player reaches certain points in the game (ex. Cool daggers for assassin when they hit level 40). Still undecided if I&#39;ll do this, but if I did I&#39;d make it immersive and use the courier or a quest or something.\r<br />\r<br />[size=5][b]Possible Features For Future Release[/b][/size]\r<br />- Stat increases/decreases depending on your class loadout\r<br />- Stat hindrance depending on your class loadout (for example, berserkers have trouble learning conjuration magic among other things)\r<br />- Perks depending on your class loadout\r<br />- In game NPCs in various location with these classes (ex. you find a brawler in an inn)\r<br />- Werewolves and vampires? Maybe, still undecided. Probably not though, this is something for Alternate Start: Live Another Life.\r<br />\r<br />[img]http://www.mediafire.com/convkey/1ec7/71saiua4x7r0mfffg.jpg[/img]\r<br />\r<br />[size=5][b]V3.8[/b][/size]\r<br />- Integrated Immersive Armors\r<br />- Diversified all armor\r<br />- Overhauled some RP loadouts\r<br />- Changed the alchemist&#39;s basket to a flower basket (that is what it was originally meant to be)\r<br />- Switched up some class enchantments items\r<br />- Integrated Immersive Weapons\r<br />- Revamped Paladin armor\r<br />- Completely redid Immersive Weapons setup\r<br />- Gave some torches to various loadouts\r<br />- Integrated Blessings of the Hunt\r<br />- Integrated Dragonborn DLC\r<br />- Added Hunter (Nomad-Thief)\r<br />- Added Sell Sword (Nomad-Warrior)\r<br />- Added Pilgrim (Nomad-Mage)\r<br />- Full Master of Weapons integration\r<br />- Added misc items all loadouts, revamped immersion\r<br />- Full Imp&#39;s More Complex Needs integration\r<br />- Gave non-Frostfall axes to nomads who don&#39;t have Frostfall installed\r<br />- Added Chef Loadout\r<br />These are features that are only on my version and have not yet been pushed into a dev version. See top of page for ETA on version push.\r<br />- Rudimentary Realistic Needs integration\r<br />- Pseudo-randomizer for warrior equipment\r<br />- Equipment predisposition algorithm for pseudo-randomizer for warrior equipment\r<br />- Changed the assassins helmet\r<br />- Temporarily disable Seaman from using IA equipment\r<br />- Randomizer between preset IW and preset vanilla weapons for warrior\r<br />\r<br />[size=5][b]V2.0[/b][/size]\r<br />- Removed dependencies, esp now checks for Frostfall, Immersive Armors/Weapons, and VaBhodi&#39;s Class Enchantments on runtime (thanks Chesko&#33;)\r<br />- Changed Bowman loadout to Ranger\r<br />- Changed Guardian loadout to Knight\r<br />- Added Nomad Class, to which Wanderer belongs\r<br />- Added Commoner Class, splitting factions (moved miner, blacksmith, farmer, merchant)\r<br />- Added Bard commoner loadout\r<br />- Added Noble commoner loadout (lol oxymoron)\r<br />- Added Alchemist commoner loadout\r<br />- Added Seaman (ship crew) commoner loadout\r<br />- Added Vigilant of Stendarr faction loadout\r<br />- Added Forsworn faction loadout\r<br />- Added Silverhand faction loadout\r<br />- Added Paladin warrior loadout\r<br />- Added Dark Knight warrior loadout\r<br />- Added Agent thief loadout\r<br />- Added Acrobat thief loadout\r<br />- Added Illusionist mage loadout\r<br />- Added Warlock mage loadout\r<br />- Gave the farmers some cabbage and stuff\r<br />- Revamped various mage spells\r<br />- Added a massive variety of books to the loadouts, some for immersion, some for skills\r<br />- Integration of VaBhodi&#39;s Class Enchantments mod\r<br />\r<br />[img]http://www.mediafire.com/convkey/9881/z3y79sdpusu87nsfg.jpg[/img]\r<br />\r<br />[size=5][b]Integrated Mods[/b][/size]\r<br />\r<br />[b][u]NOTE:[/u] None of these are required, but they will enhance UIC if they are installed.  Some of these are not in the current release, but will be in a future release.[/b]\r<br />\r<br />- Dragonborn DLC: [url=http://bethsoft.com/en-us/games/dragonborn]http://bethsoft.com/en-us/games/dragonborn[/url]\r<br />&#34;With this official add-on for The Elder Scrolls V: Skyrim, journey off the coast of Morrowind, to the island of Solstheim.&#34; - Bethesda\r<br />\r<br />- Frostfall - Hypothermia Camping Survival: [url=http://www.nexusmods.com/skyrim/mods/11163]http://www.nexusmods.com/skyrim/mods/11163[/url]\r<br />&#34;The three main components of Frostfall are Hypothermia, Cold Water Survival, and Camping Equipment.&#34; - Chesko\r<br />\r<br />- Class Enchantments: [url=http://www.nexusmods.com/skyrim/mods/46435]http://www.nexusmods.com/skyrim/mods/46435[/url]\r<br />&#34;Class [e]nchantments [r]ecraftable on any armor, clothing, or jewelry.&#34; - VaBhodi\r<br />\r<br />- Immersive Armors: [url=http://www.nexusmods.com/skyrim/mods/19733]http://www.nexusmods.com/skyrim/mods/19733[/url]\r<br />&#34;It adds many new armor sets that have been seamlessly integrated into the world.&#34; - Hothtrooper44\r<br />[b][u]NOTE: [/u][/b]Has not been tested with latest IA version.\r<br />\r<br />- Immersive Weapons: [url=http://www.nexusmods.com/skyrim/mods/27644]http://www.nexusmods.com/skyrim/mods/27644[/url]\r<br />&#34;It adds many new custom weapons that have been seamlessly integrated into the world.&#34; - Hothtrooper44\r<br />\r<br />- Blessings of the Hunt: [url=http://www.nexusmods.com/skyrim/mods/48794]http://www.nexusmods.com/skyrim/mods/48794[/url]\r<br />&#34;Hircine will grant power and artifacts to those who hunt in his name.&#34; - HeirOfTheSeptems\r<br />\r<br />- Master of Weapons - All in One: [url=http://www.nexusmods.com/skyrim/mods/37623]http://www.nexusmods.com/skyrim/mods/37623[/url]\r<br />&#34;And now *almost*everyone has a weapon that suits him/her.&#34; - Daren\r<br />\r<br />- Imp&#39; More Complex Needs: [url=http://www.nexusmods.com/skyrim/mods/10639]http://www.nexusmods.com/skyrim/mods/10639[/url]\r<br />&#34;This is a realism oriented hunger/thirst/sleep mod for Skyrim.&#34; - Imp of the Perverse\r<br />\r<br />[size=5][b]Relevant Mods[/b][/size]\r<br />\r<br />- Alternate Start - Live Another Life: [url=http://www.nexusmods.com/skyrim/mods/9557]http://www.nexusmods.com/skyrim/mods/9557[/url]\r<br />&#34;Live Another Life provides an alternative means to start the game.&#34; - Arthmoor\r<br />NOTE: Ultimate Immersive Classes was designed with this mod in mind. They go hand in hand.\r<br />\r<br />- Better MessageBox Controls: [url=http://www.nexusmods.com/skyrim/mods/28170]http://www.nexusmods.com/skyrim/mods/28170[/url]\r<br />&#34;This mod lets you navigate the message boxes with the keyboard.&#34; - ecirbaf\r<br />\r<br />[size=5][b]My Other Mods[/b][/size]\r<br />\r<br />- Equipping Overhaul: [url=http://www.nexusmods.com/skyrim/mods/49784]http://www.nexusmods.com/skyrim/mods/49784[/url]\r<br />&#34;Equipping Overhaul is a complete overhaul on Skyrim&#39;s system of swapping, equipping, and dropping items.&#34;\r<br />\r<br />- Death Souls: [url=http://www.nexusmods.com/skyrim/mods/49294]http://www.nexusmods.com/skyrim/mods/49294[/url]\r<br />&#34;Death Souls adds a costly method to avoid death that is unique to Dovahkiin.&#34;\r<br />\r<br />- Main Menu Music: [url=http://www.nexusmods.com/skyrim/mods/49092]http://www.nexusmods.com/skyrim/mods/49092[/url]\r<br />&#34;A simple main menu music replacer that changes the main menu [i]Dovahkiin[/i] song to various other songs, including several works from Malukah.&#34;\r<br />\r<br />- Ranger Elite Work in Progress: [url=http://www.youtube.com/watch?v=3Fqst0ny5bY]http://www.youtube.com/watch?v=3Fqst0ny5bY[/url]\r<br />&#34;Featuring dual arrows, cone arrow firing, hail of arrows.  Be Legolas&#33;&#34;\r<br />\r<br />- Courier Between Worlds Work in Progress\r<br />&#34;Send messages via the in game courier to your friends in other worlds.&#34;\r<br />\r<br />- Classes of Winterhold Work in Progress\r<br />&#34;Attend classes and lessons at the college of Winterhold, and later teach them for experience and income.  Also featuring College of Winterhold quest line extension.&#34;\r<br />\r<br />- Weapon Degradation and Repair Work in Progress\r<br />&#34;Weapons will degrade as you use them, like an inverse to improving items as a grindstone.  Grindstones and whetstones can be used to get your items good as new, or give them to a smith to do it for you.  Different things cause faster degradation, such as hitting enemies wearing heavy armour.  Let your weapon become too degraded and it may break.&#34;\r<br />\r<br />[img]http://www.mediafire.com/convkey/e23b/ngrlzr5gajejlkufg.jpg[/img]\r<br />\r<br />- Bethesda for Skyrim and the Creation Kit&#33;\r<br />- Chesko for Frostfall&#33; One of the best mods on the Nexus&#33;\r<br />- VaBhodi for Class Enchantments&#33;\r<br />- Hothtrooper44 for Immersive Armors and Immersive Weapons&#33;\r<br />- HeirOfTheSeptems for Blessings of the Hunt&#33;\r<br />- dlobo1999 for Master of Weapons&#33;\r<br />- Imp of the Perverse for Imp&#39;s More Complex Needs&#33;\r<br />- Solgath for requesting this mod&#33;\r<br />\r<br />[img]http://www.mediafire.com/convkey/cf3a/bzuj2ozx407h5cgfg.jpg[/img]\r<br />\r<br />[size=5][b]Testers&#33;[/b][/size]\r<br />\r<br />- VaBhodi&#33;&#33;&#33;&#33;  Thanks a bunch&#33;\r<br />- Esoteric_Monk&#33;&#33;&#33;  I can&#39;t thank you enough&#33;\r<br />\r<br />[center][size=4][url=http://www.nexusmods.com/skyrim/images/377540]Please check this out&#33;[/url][/size][/center]\r<br />[center][size=4][url=http://www.nexusmods.com/skyrim/mods/49690]And this&#33;[/url][/size][/center]",
  "categoryId": "34",
  "version": "3.8",
  "author": "DragonDude1029",
  "createdUnix": "1386400597",
  "updatedUnix": "1390853653",
  "containsAdultContent": false,
  "uploadedBy": "DragonDude1029",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085700",
      "name": "Ultimate Immersive Classes",
      "version": "1.16",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Ultimate Immersive Classes-48570-1-16.rar",
      "uploadedUnix": "1386397196",
      "modVersion": "1.16",
      "virusScanUrl": "https://www.virustotal.com/file/f9e9ba99e49e17b6a9ac9d4ecf1877149bcd612d11c654cc17acaec0dcf28b7d/analysis/1407823701/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ultimate%20Immersive%20Classes-48570-1-16.rar?fid=1000085700&ttl=1535828794&ri=8192&rs=8192&setec=8193258edfd0a64d713d44d491d9bc88"
    },
    {
      "fileId": "1000085701",
      "name": "Ultimate Immersive Classes - Frostfall Edition",
      "version": "1.16",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Ultimate Immersive Classes - Frostfall Edition-48570-1-16.rar",
      "uploadedUnix": "1386397249",
      "modVersion": "1.16",
      "virusScanUrl": "https://www.virustotal.com/file/5cb9290b373afc0639124b9a1c61a0848289723e101d91c3a6c64e4f524e2628/analysis/1407823702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ultimate%20Immersive%20Classes%20-%20Frostfall%20Edition-48570-1-16.rar?fid=1000085701&ttl=1535828795&ri=8192&rs=8192&setec=256ebfdaa03f5ca35153412fe5bd79a9"
    },
    {
      "fileId": "1000086654",
      "name": "Ultimate Immersive Classes",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "Ultimate Immersive Classes-48570-2-0.rar",
      "uploadedUnix": "1386978178",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/0328a33dd74ee6552b0e3a30bda45735092b36b20e35cb9dcdca8923d32245e1/analysis/1407835565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ultimate%20Immersive%20Classes-48570-2-0.rar?fid=1000086654&ttl=1535828795&ri=8192&rs=8192&setec=e0a2ebe87b132c66f20a273da00422a7"
    },
    {
      "fileId": "1000093781",
      "name": "Ultimate Immersive Classes",
      "version": "3.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Ultimate Immersive Classes-48570-3-8.rar",
      "uploadedUnix": "1390853653",
      "modVersion": "3.8",
      "virusScanUrl": "https://www.virustotal.com/file/151a556bc3b92aace5850452f6125f30b9d2e0a1f6bda82834bb22292c40d411/analysis/1407905042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ultimate%20Immersive%20Classes-48570-3-8.rar?fid=1000093781&ttl=1535828796&ri=8192&rs=8192&setec=5ea55a8d1b82968b1b3a2f4a39aee675"
    }
  ]
}