{
  "modId": 48588.0,
  "modName": "Master Chief in Skyrim",
  "summary": "This add Master Chief as a follower for you. Created by jpdoctor not me.",
  "descriptionHtml": "MOD CREATED BY jpdoctor&#33; All credit  goes to him&#33; http://steamcommunity.com/profiles/76561198083469316/myworkshopfiles/?appid=72850\r<br />\r<br />This mod adds Master Chief from the Halo series as a fully voice acted follower to Skyrim. Both Chief and Cortana will talk to you as well as eachother. You&#39;ll find him near the shrine to Talos in Whiterun. \r<br />He is essential and levels with the player. He has an extra set of armor in his inventory. \r<br />\r<br />PLEASE READ: If anyone decides to make a video about this mod then all I ask is that you give a shout out to the two voice actors who voiced Chief and Cortana. \r<br />&#39;DawnEntirely&#39; is the voice of Cortana and &#39;Karl William&#39; is the voice of Master Chief. Thanks in advance =) \r<br />\r<br />-Original armor mesh created by DarkSeeker117 \r<br />\r<br />NOTE: Be sure to wait on the launch screen after downloading the mod for the data files to finish updating before starting the game. \r<br />\r<br />ALSO: there is a chance that for the script to start working properly you may need to quick save in front of Chief and quick load to get him talking. Also make sure you have no other followers with you. If that doesn&#39;t work then you may need to start a new game. It&#39;s a common dialogue bug in Skyrim that as of yet I don&#39;t know how to fix. \r<br />\r<br />Finally a big thank you to Deck16/ Nichevo for his awesome tutorial on voiced followers. Check it out here: \r<br />http://deck16.net/post/22645519500/making-a-unique-voiced-follower-in-skyrim-part-1 \r<br />\r<br />DawnEntirely&#39;s Youtube channel: http://www.youtube.com/user/DawnEntirely \r<br />Karl William&#39;s Youtube channel: http://www.youtube.com/user/ChurchGCF \r<br />\r<br />For those who would like it, Gravity Hammer mod by cordelephant \r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=188633130",
  "categoryId": "96",
  "version": "1.0",
  "author": "jpdoctor",
  "createdUnix": "1386454562",
  "updatedUnix": "1386454562",
  "containsAdultContent": false,
  "uploadedBy": "ChaceEllis",
  "primaryFile": null,
  "files": []
}