{
  "modId": 48591.0,
  "modName": "Festive Flight - A Flying Mount for Christmas",
  "summary": "A fully controllable flying mount, in the spirit of the holidays&#33; Land on the rooftops of your neighbors to deliver Saturalia joy, or in the midst of your foes to deliver some festive PAIN&#33;",
  "descriptionHtml": "[color=#FFCCCC]\r<br />A fully controllable flying mount, in the spirit of the holidays&#33; Land on the rooftops of your neighbors to deliver Saturalia joy, or in the midst of your foes to deliver some festive PAIN&#33;\r<br />\r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=203029180]Also available on Steam Workshop[/url]&#33;\r<br />\r<br />Festive Flight has been featured in Seriez&#39;s Skyrim Mod Review #20 (starts at 2:18, but watch the whole thing for lots of other great festive mods&#33;)&#33;\r<br />[youtube]Qa7Y2L4I04s[/youtube]\r<br />\r<br />Also featured in DustReviews Skyrim Mods Weekly #4. View it here&#33;\r<br />[youtube]b5TqvcrVemY[/youtube]\r<br />\r<br />[/color]\r<br />[color=#FF0000]\r<br />IF YOU ARE EXPERIENCING SCRIPT LAG (Rudolph falling a lot, etc) OR ARE CRASHING WHEN YOU TRY TO SAVE AFTER UNINSTALLING, AND ARE RUNNNG 1.05, SEE THE UPDATE NOTES BELOW&#33;\r<br />[/color]\r<br />[color=#FFCCCC]\r<br />\r<br />[b][size=4]Getting Started[/size][/b]\r<br />\r<br />The courier should track you down near any major city. He&#39;ll deliver a note and the Golden Bell. The note will tell you what to do, but basically go somewhere and ring the bell. You will gain a new Power called Happy Thoughts, and automatically use it. After that, just use Happy Thoughts to summon Rudolph wherever you are.\r<br />\r<br />Some people are having trouble getting the Courier to show up. It&#39;s the same courier that the vanilla game uses and works the same way: if you&#39;re in a town when you first load the mod, you may need to travel to another town before he&#39;ll appear.\r<br />\r<br />Although SKSE and SkyUI are not required to use this mod with its default settings, they are required to edit the controls and options. To be clear: You can install this mod and fly around on Rudolph WITHOUT SKSE. \r<br />\r<br />[b][size=4]Flying on Rudolph[/size][/b]\r<br />\r<br />Flight controls are similar to the swimming controls. Point the camera where you want to go, and your new mount will do his best to take you there, whether it&#39;s on the ground or in the air. \r<br />\r<br />If you have SKSE (and you really, really should&#33;) you can hold down the Jump button (spacebar by default) to gain altitude no matter where the camera is pointed. This is the easiest way to get airborne.\r<br />\r<br />If you want to get down quickly, you can stop in mid-air and aim the camera STRAIGHT down. After a couple of seconds (this interval can be adjusted in MCM) you will land VERY quickly immediately where you are standing. \r<br />\r<br />As of version 1.05, Rudolph now will vanish back to whence he came after standing around, unridden, for an hour of game time. This interval can be changed or disabled entirely in the MCM.\r<br />\r<br />[b][size=4]Updates[/size][/b]\r<br />\r<br />v1.07 - The &#34;Hey, look, no game-breaking bugs&#34; release&#33; Fixed a typo that was messing up one of the MCM options, and hopefully made Rudolph a bit easier to steer.\r<br />v1.06 - Fixed an issue which caused an extra load on the script engine. [b]See update notes.[/b]\r<br />v1.05 - Fixed a bad cleanup on the summoning script that could leave empty objects in the savegame. Rudolph now optionally vanishes after being dismounted.\r<br />v1.04 - Resolved an issue with the update script that meant some previous fixes weren&#39;t getting applied.\r<br />v1.03 - Hopefully resolved the problem with Rudolph going berserk and attacking everybody.\r<br />v1.02 - Optimized the hoofprint effects script. It should now place considerably less load on the script VM.\r<br />v1.01 - Fixed a bug where changes made in MCM weren&#39;t always taking effect.\r<br />v1.00 - Initial release.\r<br />\r<br />\r<br />[b][size=4]Update Notes[/size][/b]\r<br />\r<br />Version 1.05 may cause the script engine to lag rather badly if you enter an interior cell any time after having killed Potema, the Wolf Queen (yeah I know, weird, huh?). This is fixed in 1.06, but if you are noticing script lag (Rudolph is falling a lot, doesn&#39;t show up when summoned, other scripts are being delayed) you may need to give the engine time to &#34;catch up&#34;. [b]I strongly recommend you load a save game from before 1.05; this bypasses the problem entirely.[/b] If this is not an option, you have two possible solutions. \r<br />\r<br />1) You can either do a clean save (remove the mod, load your game, travel to another location, save, then reinstall the mod), or, if this causes a crash...\r<br />\r<br />2) Upgrade to 1.06, then go somewhere quiet in-game and leave it running for an hour or so of REAL (not game) time. You can hit ESC so the game is on the menu if you don&#39;t want time to pass in-game. In my tests, this gave the papyrus engine enough time to clear out the problem. [b]This is a last-ditch solution to avoid losing your save, and loading from a save before you installed 1.05 is recommended.[/b]\r<br />\r<br />These is only needed if you have entered an interior cell while running 1.05, you have fought Potema on your save game, AND you are noticing script lag. Otherwise, you almost certainly won&#39;t have this problem.\r<br />\r<br />\r<br />[b][size=4]A Note on Orphaned Objects[/size][/b]\r<br />\r<br />You&#39;ll get a note about this as soon as you upgrade from 1.03 or lower. Here are some more details.\r<br />\r<br />Earlier versions of the mod had a bug in the summoning spell that could leave extra objects in memory. This could unnecessarily increase the size of your saved game by a few bytes. They were NOT objects with running scripts and thus do not cause save game corruption. Version 1.05 fixes the original bug and can clean up the offending objects when you reenter the cell they are in.\r<br />\r<br />In other words, yes, you might have a few bytes of the dread &#34;save game bloat&#34; if you summoned Rudolph repeatedly in version 1.03 or lower. Here&#39;s a few reasons not to panic and uninstall:\r<br />1) It&#39;s fixed (yes, I&#39;m sure).\r<br />2) It only happened if you used the summoning spell repeatedly. It didn&#39;t happen as a result of simply riding/flying around on him or anything else, only actually summoning him.\r<br />3) It&#39;s not the sort of object that corrupts your save game.\r<br />4) It&#39;ll get cleaned up as you keep playing.\r<br />\r<br />So no worries, and sorry about the oversight&#33;\r<br />\r<br />\r<br />[b][size=4]Compatibility[/size][/b]\r<br />\r<br />This mod is compatible with everything, as far as I know. It has been specifically tested with Convenient Horses though you may want to hold off on flying until after the faction registration is complete.\r<br />\r<br />It does place a fair load on the scripting engine, but all the scripts are self-limiting and will not bloat your save game. I&#39;m a careful scripter, and whatever other faults my mods have, my scripts are safe.\r<br />\r<br />Also tested as compatible with these other festive mods:\r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=203337068]Father Christmas follower[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/48498/?]Special Events of Tamriel[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/28093/?]Saturalia - Christmas in Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27845/?]Christmas Lanterns[/url]\r<br />\r<br />[b][size=4]Troubleshooting[/size][/b]\r<br />\r<br />Problem: Rudolph keeps falling to the ground while flying.\r<br />Fix: This is probably due to some other mod placing a heavy load on your script engine or your system is having trouble keeping up with the load speed as you rapidly change cells. Try reducing the speed multiplier in the MCM menu: 80% is a good starting point. This both reduces the memory load and allows the script engine more time to catch up. If that doesn&#39;t do it, try disabling the sparkling hoofprint effect in MCM.\r<br />\r<br />Problem: I keep bouncing high into the air while I&#39;m trying to fly straight.\r<br />Fix: This is a collision problem and happens most often while flying downward at a very shallow angle. Increasing the “Flight Smoothing” in the MCM may help. It&#39;s pretty rare; if you find it happening to you a lot, let me know.\r<br />\r<br />Problem: The “emergency landing” engages randomly or throws me at weird angles.\r<br />Fix: I haven&#39;t tracked this one down yet, but you can avoid it 100% by not looking straight down (angles are ok). You can also just disable the Emergency Landing altogether or increase the delay to 5 seconds.\r<br />\r<br />Problem: The mod is crashing my game&#33; \r<br />Fix: It&#39;s probably not my mod, but the load caused by rapidly changing cells. If you used the console to speed up the player and ran around you&#39;d probably encounter the same problem. Skyrim just does not handle heavy memory usage very well. Reduce the speed multiplier, or fly higher: if you&#39;re high enough most objects don&#39;t get loaded and you may have an easier time. \r<br />\r<br />Other problems? Let me know about them&#33;\r<br />\r<br />[b][size=4]Notes[/size][/b]\r<br />\r<br />The visual effects, including the glowing nose, can be disabled in the MCM panel. So if you want a flying reindeer mount but aren&#39;t digging the red nose, I&#39;ve got you covered.\r<br />\r<br />[b][size=4]Known Bugs[/size][/b]\r<br /> \r<br />Like most (all?) mount mods, there are some animation bugs that occur when climbing on the mount, and if you take Rudolph swimming. These are due to a lack of animation files for climbing onto a reindeer (as opposed to a horse). For the same reason, the player&#39;s posture is very stiff while riding and looks rather comical when viewed from the side. Unfortunately, there&#39;s little I can do about this.\r<br />\r<br />[b][size=4]History[/size][/b]\r<br />\r<br />12/24/2013 - 1.07: Fixed a typo that was messing up one of the MCM options, and hopefully made Rudolph a bit easier to steer.\r<br />12/22/2013 - 1.06: Fixed an issue which caused an extra load on the script engine. \r<br />12/19/2013 - 1.05: Released, fixed bug in update script and possible orphaned objects.\r<br />12/15/2013 - 1.03: Fixed Rudolph going berserk sometimes\r<br />12/12/2013 - 1.02: Optimized the hoofprint effects script\r<br />12/09/2013 - Fixed bug where changes made in MCM might not take effect.\r<br />12/07/2013 - Initial release.\r<br />[/color]",
  "categoryId": "83",
  "version": "1.07",
  "author": "Verteiron",
  "createdUnix": "1386463062",
  "updatedUnix": "1387943747",
  "containsAdultContent": false,
  "uploadedBy": "verteiron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085787",
      "name": "FestiveFlight100",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2058",
      "fileName": "FestiveFlight100-48591-1-00.7z",
      "uploadedUnix": "1386461288",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/23fc2d4e39ac98d31e7240480cc13a0a3a692eb6fb69301dcce71bce13839638/analysis/1407824413/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FestiveFlight100-48591-1-00.7z?fid=1000085787&ttl=1535828828&ri=8192&rs=8192&setec=ed6082b9b7726f3ea56ba14b6047da3c"
    },
    {
      "fileId": "1000085993",
      "name": "FestiveFlight101",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1298",
      "fileName": "FestiveFlight101-48591-1-01.7z",
      "uploadedUnix": "1386570641",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/ae38e4f1801721b1c5848f2f7aece59b1c63ae44fad27c8a29333c1f773a4d1e/analysis/1407827160/",
      "changelogHtml": " Fixed bug where changes made in MCM might not take effect. <br/> \n Removed some extraneous files from the BSA <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FestiveFlight101-48591-1-01.7z?fid=1000085993&ttl=1535828828&ri=8192&rs=8192&setec=eb0275a301646e4f3f7972ff14869020"
    },
    {
      "fileId": "1000086492",
      "name": "FestiveFlight102",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1301",
      "fileName": "FestiveFlight102-48591-1-02.7z",
      "uploadedUnix": "1386883928",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/68393a475a93e3833006fae896b2724873cc99e3fa3b3646c64fd3a61f5d16ec/analysis/1407833292/",
      "changelogHtml": " Optimized the hoofprint effects script <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FestiveFlight102-48591-1-02.7z?fid=1000086492&ttl=1535828829&ri=8192&rs=8192&setec=6ddd503cec27c1cd65abbbd6f38bae98"
    },
    {
      "fileId": "1000086940",
      "name": "FestiveFlight103",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1301",
      "fileName": "FestiveFlight103-48591-1-03.7z",
      "uploadedUnix": "1387148846",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/7e23f4e9dbc3bb35693fa1ab65650fc3503984d4b0ba56ceeee0b406ed23d65a/analysis/1407844208/",
      "changelogHtml": " Fixed (hopefully) a bug that made Rudolph sometimes go berserk and attack everyone. Now, even if he gets attacked, he&#39;ll just run away instead. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FestiveFlight103-48591-1-03.7z?fid=1000086940&ttl=1535828829&ri=8192&rs=8192&setec=373e1a830fb7473613f29abdc4dc3bd4"
    },
    {
      "fileId": "1000087995",
      "name": "FestiveFlight106",
      "version": "1.06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1309",
      "fileName": "FestiveFlight106-48591-1-06.7z",
      "uploadedUnix": "1387767890",
      "modVersion": "1.06",
      "virusScanUrl": "https://www.virustotal.com/file/ba94d717367e5c0fc214702fd3010762c5de20626507b0c41a5a02d2f3802c8f/analysis/1407854649/",
      "changelogHtml": " Fixed a rare but serious script loop bug introduced by 1.05. Upgrade from 1.05 as soon as possible and see the update notes in the description for details <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FestiveFlight106-48591-1-06.7z?fid=1000087995&ttl=1535828830&ri=8192&rs=8192&setec=270170d58f4f1c68c707e91c1732833d"
    },
    {
      "fileId": "1000088287",
      "name": "FestiveFlight107",
      "version": "1.07",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1306",
      "fileName": "FestiveFlight107-48591-1-07.7z",
      "uploadedUnix": "1387943747",
      "modVersion": "1.07",
      "virusScanUrl": "https://www.virustotal.com/file/1db3366800afeac225a70c6b59b3d1d69c72e69728962e6a6d97bcfcede2f227/analysis/1407858184/",
      "changelogHtml": " The &#34;Look, no game-breaking bugs this time&#33;&#34; release <br/> \n Fixed a typo in the MCM panel that was causing a variable name to show when Descent Angle was changed <br/> \n Tweaked Rudolph&#39;s MT to improve his turning radius a bit. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FestiveFlight107-48591-1-07.7z?fid=1000088287&ttl=1535828831&ri=8192&rs=8192&setec=b2a13260bbf3498840a26e14dde6d8a1"
    }
  ]
}