{
  "modId": 48612.0,
  "modName": "Dragonborns Sawmill Hut",
  "summary": "A small home located at Aeri&#39;s sawmill, giving the Dragonborn a chance to rest after a long day of work alongside Aeri and her workers at the Sawmill. ",
  "descriptionHtml": "[img]http://i.imgur.com/uF0C3gY.jpg[/img]\r<br />\r<br />[b]::::: Description :::::[/b]\r<br />\r<br />Hello. This is the second mod that i have produced within the creation kit. This mod was actually going to be kept for [url=#]personal[/url] use only, but i decided to release it to the public as it may benifit people that would like to work at Aeri&#39;s sawmill, and be able to have a place where they can stay after a long day at work. \r<br />\r<br />[b]::::: Location ::::: [/b]\r<br />\r<br />The Sawmill hut is located near windhelm, at Aeri&#39;s sawmill. The sawmill gives the player an opportunity in order to cut wood, and then sell it to Aeri for a profit. The main function of this home is to be able to work for a few hours, and then when it goes dark, and Aeri and the rest of the workers go inside to sleep in their homes, you also have a comforting place to stay whilst you wait until the sun rises once again. \r<br />\r<br />[img]http://i.imgur.com/TzEUOSX.jpg[/img]\r<br />\r<br />[b] ::::: Features ::::: [/b]\r<br />\r<br />1. Chests, Drawers and an Alchemy stand for players to be able to entertain themselves while in their hut. \r<br />2. Simple design and easily accessed from the sawmill, via a bridge. \r<br />3. Lighting and ambient sound in the background as well as music, giving the home a better feel. \r<br />4. Loot for players to be able to obtain. (NOTE: This loot is for medium based players. The loot isn&#39;t necessarily valuable to players that have obtained the best of weaponry/armour.) \r<br />\r<br />[b]::::: Bugs/Glitches :::::[/b]\r<br />There are currently no bugs. Please notify me if you spot any.\r<br />\r<br />[b]::::: Appreciation :::::[/b]\r<br />\r<br />It would be appreciated if you were to give some kind of support, as im needing this support in order to make more advanced mods. Currently this is my second mod and more advanced/In depth mods will be created in the future. I hope that you enjoy this mod, and please make sure to give me feedback if you feel it is necessary. Thank you.\r<br />\r<br />[img]http://i.imgur.com/IXDjm80.jpg[/img]\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/FnRqPjI.png[/img][/center]",
  "categoryId": "67",
  "version": "",
  "author": "Fi5h1fishy",
  "createdUnix": "1386497401",
  "updatedUnix": "1386504031",
  "containsAdultContent": false,
  "uploadedBy": "fi5h1fishy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085877",
      "name": "Dragonborns Sawmill Hut -Update 1-",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "73",
      "fileName": "Dragonborns Sawmill Hut -Update 1--48612-.rar",
      "uploadedUnix": "1386504031",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3ebd5ef47704b8d7b000f1e89a385e95898834756b80e9d730183906cb0e314c/analysis/1407825314/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborns%20Sawmill%20Hut%20-Update%201--48612-.rar?fid=1000085877&ttl=1535828852&ri=8192&rs=8192&setec=21a8f04414d040d941ce3e71469fe513"
    }
  ]
}