{
  "modId": 48630.0,
  "modName": "Lakeview Mannor Realistic Basement Lighting",
  "summary": "a mod to improve the available lighting in the basement of the the hearthfire Lakeview Manor House this in turn allows the removal of all ambient light for a more realistic feel.",
  "descriptionHtml": "My first attempt at a MOD for any game.\r<br />\r<br />i have decided I like the look of ELFX and the way it reduced ambient light to produce more realistic environments. I however noted that this change wasn&#39;t reflected within the Lakeview Manor House in hearthfire. I therefore took it upon myself to rearrange the lighting to give a more realistic feel.\r<br />\r<br />However with the complexity of the main Lake view house I decided it would be better if for my first MOD I started with a smaller challenge. Therefore I have started by remodelling the lighting in the basement for the Lakeview Manor House.\r<br />\r<br />As this is my first attempt at a mod I cannot confirm its compatibility with any other Mods to the Lakeview Property or elsewhere. But I have run it with my current selection of mods without any problems.\r<br />\r<br />Again as this is my first MOD my apologies but I will unlikely be able to help anyone with any compatibility issues or queries, but I would appreciate any questions and/or feedback the community has to offer on my first attempt\r<br />\r<br />",
  "categoryId": "78",
  "version": "1.00",
  "author": "Stevros",
  "createdUnix": "1386536392",
  "updatedUnix": "1386536379",
  "containsAdultContent": false,
  "uploadedBy": "stevros1903",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085935",
      "name": "Lakeview Manor Basement Realistic Lighting ",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Lakeview Manor Basement Realistic Lighting -48630-1-00.7z",
      "uploadedUnix": "1386536379",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/e44d4a5d8b2bf2ee77e7a3c39b58f5157b70165c68886f4a68c4dc9fcb878e5e/analysis/1407826084/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20Manor%20Basement%20Realistic%20Lighting%20-48630-1-00.7z?fid=1000085935&ttl=1535828908&ri=8192&rs=8192&setec=c940feaf4fb44b065a8f9e053db04cb8"
    }
  ]
}