{
  "modId": 48636.0,
  "modName": "NPC Enchanter",
  "summary": "Adds a NPC Enchanter when using Yohane&#39;s FCC-Followers Can Craft mod.",
  "descriptionHtml": "[center][img]http://i359.photobucket.com/albums/oo37/ferogain/npcenchant.jpg[/img]\r<br />\r<br />[size=200]A Working Work In Progress[/size][/center]\r<br />\r<br />\r<br />So pretty much since I started playing Skyrim, I (like so many others) wanted an NPC who would enchant things for me so I would not have to spend points in the Enchanting skill. Because skill points get rare (short of using mods that give you more). But nobody really seemed to get one going mod wise. I am what I would call a mid level modder. I have made several, am comfortable using the CK and enjoy doing it, and have learned (mostly through trying things) how to do many things with the CK. However, creating a NPC Enchanter was WAY out of my league. Then lo and behold an AWESOME mode from Yohane called FCC-Followers Can Craft appeared to my eyes. And after trying it out, found that I COULD whip up an NPC Enchanter mod (of sorts). \r<br />\r<br />I call this a Working Work In Progress, because currently it is working completely, however, I think there are others that could make it WAY better. I feel this is, essentially, a &#34;workaround&#34; if you will to the NPC Enchanter issue. Yes, she does work, but not without another Mod, she is slightly over-powered in that she does not charge a fee for her service (as she is a follower), and she could be &#34;abused&#34;, if you will, in many ways.\r<br />\r<br />The things I think that could make her so much better, but are out of my league to do based on my modding skill are,\r<br />\r<br />-- Make her NOT be a follower, but still enchant for you.\r<br />-- Make her charge a fee for her service.\r<br />-- Make the enchantments based on the players level as opposed to solely based on the soul gem being used.\r<br />-- Give Nidara the ability to have ALL the available enchantments, and not rely on the player to have them.\r<br />\r<br />I hope some enterprising fellow modder with coding experience takes this and adds to it.\r<br />\r<br />All that being said here are the ins and outs of the mod.\r<br />\r<br />She is located in Winterhold, in what was a destroyed house just behind the Frozen Hearth Inn. She is level 80 and has an Enchanting skill of 100 with all the needed Enchanting Perks. After you have downloaded and installed Yohane&#39;s awesome [url=http://www.nexusmods.com/skyrim/mods/23690]FCC-Followers Can Craft[/url] mod, all you do is go to her house and take her on as a follower. Then ask her to do something for you via the normal Follower Controls menu, and ask her to use the Enchanting Table. Per Yohane&#39;s mod the enchanting menu will appear and you can create an item. Note, your character MUST have un-enchanted an item to have Nidara enchant something. She does not have all the possible enchantments in her. They have to be part of YOUR character. However, since she has all the appropriate enchanting skill perks, as well as an enchanting skill of 100, what you do enchant will be top notch. And can have 2 enchantments on it. After you are done enchanting you will have to dismiss her as a follower, or she will follow you out like a normal follower.\r<br />\r<br />The power of the enchanted item is still based on the gem being used. If using that filled black soul gem gives you an enchantment you feel is too strong, use a smaller one and the numbers will go down a bit.\r<br />\r<br />Also, she is set up to be a Merchant. She sells filled soul gems at normal rates, between the hours of 8AM to 8PM. (NOTE: If taken out of her house she loses the merchant ability. This is by design)\r<br />\r<br />\r<br />NOTE: As this is a WWIP, I have not &#34;cleaned&#34; it with anything. Her house is fully operable, and navmeshed of course, and since I do have experience in modding there are not many unnecessary dependencies, but like all WIP files, proceed at your own risk. Also, she has no custom AI so she will only sandbox around her house. \r<br />\r<br />--== Requirements ==--\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/23690/]FCC-Followers Can Craft[/url] by Yohane\r<br />Dragonborn add-on (because I wanted her to have a staff enchanter in her house as well)\r<br />\r<br />\r<br />--== Conflicts ==--\r<br />\r<br />Only ones I can think of are location ones if that area behind the Inn is being used by another mod.\r<br />\r<br />\r<br />--== Thanks ==--\r<br />\r<br />Yohane for his awesome FCC mod.\r<br />Bethesda for the fun world we play in",
  "categoryId": "96",
  "version": "1",
  "author": "Ferogain",
  "createdUnix": "1386543544",
  "updatedUnix": "1386543281",
  "containsAdultContent": false,
  "uploadedBy": "ferogain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085960",
      "name": "Enchanter NPC",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Enchanter NPC-48636-1.7z",
      "uploadedUnix": "1386543281",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e498671786de66fac2d8f6c17a7ed664388de030d1dd879a794bbc20d620c208/analysis/1407826384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanter%20NPC-48636-1.7z?fid=1000085960&ttl=1535828917&ri=8192&rs=8192&setec=c18a8713713a46c22cf162af61d65401"
    }
  ]
}