{
  "modId": 48634.0,
  "modName": "AKM - Advanced KillMoves - fixed Dragon music and drop book bug",
  "summary": "Advanced Kill Moves, Dawnguard compatible and Dragon battle music fixed. Also fixed the dropped book bug.",
  "descriptionHtml": "[color=#ff0000][b]UPDATE:[/b][/color]\r<br />========\r<br />\r<br />Finally fixed the bug that caused the book to be dropped then re-added to your inventory indefinitely. Sorry it took me so long to update it. I also uploaded new videos I recorded myself, showing the configuration menu wizard, and some game play demos of the mod in action.\r<br />\r<br />Also, bear in mind that Grassman (the original mod author) has updated his mod recently, so you can use his if you want instead. Here is the link:\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/10291/?]http://www.nexusmods.com/skyrim/mods/10291/?[/url]\r<br />\r<br />I believe his now requires MCM to work though. So it&#39;s up to you.\r<br />\r<br />DESCRIPTION:\r<br />============\r<br />\r<br />This is Advanced Kill Moves, created by Grassman, updated by DJ_Kovrik and superrandombros28 to be compatible with the latest version of Skyrim and Dawnguard, and finally, updated by myself to correct the broken Dragon battle music.\r<br />\r<br />I love the AKM mod, I deem it essential for my Skyrim. However, the latest version, although compatible with the latest Skyrim and Dawnguard, had a bug that drove me nuts. Whenever a dragon would appear in the sky, no music would play at all. \r<br />\r<br />It took me alot of trial an error, learning the creation kit, but I finally was able to figure out the problem and fix it. This was a big thing for me and so I decided to share it with my fellow Skyrim fans.\r<br />\r<br />WHAT IS AKM?\r<br />=============\r<br />\r<br />This is a mod that enables you to do a killmove on almost every opponent you fight. It bypasses the &#34;last enemy&#34; restriction, enabling you to do killmoves in the middle of battle, not only on the last enemy.\r<br />\r<br />No SKSE or ScriptDragon required. Straight and to the point.\r<br />\r<br />HOW DOES IT WORK?\r<br />===================\r<br />\r<br />Once you install the mod, start your game and go to your inventory to find the AKM book. Read it, and launch the AKM Wizard. Follow the prompts to set the mod to your liking.\r<br />\r<br />Please refer to the readme included in the download for more details on all the features.\r<br />\r<br />INSTALLATION:\r<br />==============\r<br />\r<br />If you already have versions 2-0b or 2-0b Dawnguard installed, simply extract and overwrite those files with this version. No clean save needed.\r<br />\r<br />If this is your first time installing AKM, again simply extract the files to your Skyrim Data folder. No clean save needed.\r<br />\r<br />IF YOU HAVE A PREVIOUS VERSION OF AKM (Anything before the versions mentioned above), you will need to create a CLEAN SAVE before using this version.\r<br />\r<br />- Remove mod completely\r<br />- Start game\r<br />- Save once\r<br />- Quit game\r<br />- Install mod\r<br />- Start game (with the mod enabled) \r<br />\r<br />TROUBLESHOOTING:\r<br />===================\r<br />\r<br />I have been using AKM since before all official DLC, and the newest versions from DJ_Kovrik and superrandombros28 have worked without any issues for me on my multiple character saves. This is just a small bug fix to correct the Dragon music not playing, so essentially, it is the same and I have had no problems.\r<br />\r<br />That being said:\r<br />\r<br />1 - If you have issues with the book&#39;s menu not working properly, when you choose an option in the wizard and it goes blank and you cannot continue:\r<br />\r<br />This is because you have a previous version of AKM and have not created a clean save. Follow the steps above and create a clean save to correct this.\r<br />\r<br />2 - If you get a message saying somethings like &#34;Silly player, you only need one copy of the book&#34; or &#34;Don&#39;t drop the book&#34;\r<br />\r<br />This is a known bug with this mod. I&#39;ve been looking into getting rid of it, but I&#39;m not there yet. Still a beginner at modding Skyrim\r<br />\r<br />3 - &#34;I&#39;ve installed the mod but I barely get any killmoves on opponents.&#34;\r<br />\r<br />- Set the Killmove ratio to the highest setting (120)\r<br />- Try to be on the same level as your opponent when attempting a killmove (same height on the ground, not above or below him)\r<br />- Use a strong standing strike, more than enough to kill him, and you should do a killmove on him.\r<br />\r<br />CREDITS:\r<br />========\r<br />\r<br />Once again, I am not the creator of this mod. Grassman made it a long while back, but has since abandoned it. DJ_Kovrik made it compatible to the latest version of Skyrim, and superrandombros28 made it work with Dawnguard crossbows. I simply fixed a bug with Dragon music not playing.\r<br />\r<br />DISCLAIMER:\r<br />===========\r<br />\r<br />I am very new to modding Skyrim. Please do not harass me with requests. I have a busy life so I will give no guarantees of support to anything you download from me. Post something in the Posts section and if I have time, I&#39;ll try to come by and check once in a while.",
  "categoryId": "77",
  "version": "2.0b",
  "author": "Grassman - DJ_Kovrik - SuperRandombros28 - Bushin1",
  "createdUnix": "1386623433",
  "updatedUnix": "1410696057",
  "containsAdultContent": false,
  "uploadedBy": "Bushin1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000126842",
      "name": "AKM - Advanced KillMoves - fixed Dragon music and drop book bug",
      "version": "2.0b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "357",
      "fileName": "AKM - Advanced KillMoves - fixed Dragon music and drop book bug-48634-2-0b.zip",
      "uploadedUnix": "1410696057",
      "modVersion": "2.0b",
      "virusScanUrl": "https://www.virustotal.com/file/ca5f012b459415b9798cb1f8817d4ca6ac86bd2ed466f18fe0fc40d6cbc8800b/analysis/1410696125/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AKM%20-%20Advanced%20KillMoves%20-%20fixed%20Dragon%20music%20and%20drop%20book%20bug-48634-2-0b.zip?fid=1000126842&ttl=1535828913&ri=8192&rs=8192&setec=b910f31ad421403c8c24584739963955"
    }
  ]
}