{
  "modId": 48641.0,
  "modName": "Ravenscale Castle",
  "summary": "The inviting ice of the Sea of Ghosts hosts a castle for the Dragonborn, abandoned and in need of a Lord. ",
  "descriptionHtml": "RAVENSCALE CASTLE - A lore-friendly-ish player home&#33;\r<br />\r<br />My last few mods have been pretty good in my book, and I&#39;ve been honing my skills a little trying to make a real Quest mod down the line. Until then, I&#39;ve taken the island near Dawnstar and placed upon it a real castle that those seeking the &#39;right size&#39; might enjoy. \r<br />\r<br />Included in the castle should be all the crafting tables desired, fair storage, but most of all a beautiful location and design that I hope takes a few breaths away. There is a large history to the castle, as described in an inheritance note and a book by the Ravenscale Throne. I suppose the place is catered more to those preffering a royal and/or alchemical touch. The Keep itself hosts the living quarters, audience hall, garden, crafting tables, etc. The Tower has very little practicality except an excellent view, and an aesthetic parlour with a painting set. I missed that about Oblivion, y&#39;know? I loved those lil paint jars.\r<br />\r<br />There is also a &#39;very&#39; minor dungeon beneath the Keep and Tower, for a tiny exploration. Should I add more here, perhaps? \r<br />\r<br />INSTALLATION--\r<br />\r<br />Only a minor difference from placing it all in your Data folder, there is a folder as well for your Data -&gt; Meshes.\r<br />\r<br />There is no additional files besides Skyrim Vanilla that&#39;s needed&#33; All parts besides those given are from the original pack. \r<br />\r<br />INCOMPATIBILITY-- \r<br />\r<br />I do say, DO NOT use this mod in conjunction with other mods using this island near Dawnstar (The leftmost in a group of four), including my first castle mod. I recommend, if you are using that, take what you want and then uninstall that previous manor, before this one should lay its foundations. \r<br />\r<br />Also, there was some experimentation in the area of Blue Creek Estate, so I recommend that it be placed above this one in load order. \r<br />\r<br />\r<br />Thank you, and I hope you enjoy&#33; Please note me any problems or issues you see around here. Everything should be follower and no-respawn friendly, navmeshed and the like. \r<br />\r<br />--UPDATE--\r<br />\r<br />A somewhat new interior for the castle has been made and uploaded as the main file, as well as a new section to the dungeon. I&#39;d recommend, if you download it to replace the old one, that you remove any stuff you have in there, as one would. Thank you, I hope the changes are to your liking&#33;\r<br />\r<br />",
  "categoryId": "68",
  "version": "2.0",
  "author": "ClefJ",
  "createdUnix": "1386556903",
  "updatedUnix": "1388393345",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000085983",
      "name": "Ravenscale Castle",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5615",
      "fileName": "Ravenscale Castle-48641-1-0.zip",
      "uploadedUnix": "1386556693",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cc5a7306ecc7dc4cdaf90006322f6a9f686c88c24c44796fd929b0476c218e32/analysis/1407826748/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ravenscale%20Castle-48641-1-0.zip?fid=1000085983&ttl=1535828924&ri=8192&rs=8192&setec=bf24cc4be019761961f90ed28bf96478"
    },
    {
      "fileId": "1000088930",
      "name": "Ravenscale Updated",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5924",
      "fileName": "Ravenscale Updated-48641-2-0.zip",
      "uploadedUnix": "1388393345",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9d31b0833126090dfc680e69dfae39e84fb8bbe3e1882cfc8bc8d3f18cfe197d/analysis/1407864439/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ravenscale%20Updated-48641-2-0.zip?fid=1000088930&ttl=1535828925&ri=8192&rs=8192&setec=8cb8661886be3fd4a1e30f48b6209b5e"
    }
  ]
}