{
  "modId": 48654.0,
  "modName": "Skyrim Gets Guarded",
  "summary": "Is Skyrim feeling too unguarded or lifeless to you? This mod can help. It adds tons of guards around the province and optionally provides respawn flag fixes and/or guard enhancements. Multiple .esps so you choose what you want.",
  "descriptionHtml": "[center][size=6]Skyrim Gets Guarded\r<br />[/size][size=2]\r<br />[/size][/center][size=2][size=3]Overview[/size]- This mod addresses some problems of Skyrim - the lack of life, lack of NPCs where you&#39;d think they should be, how easy Skyrim is, and partly the lack of reaction of the world to your&#39;s or other&#39;s actions. It does this by adding lots of guards across the province in what I hope is in a lore friendly way. While only a beta, I have added over a hundred guards all around. Some of the features of this mod:\r<br />[/size][list][*][size=2][/size][size=3][size=2]Guards that patrol, wander around, stand around, or hang out in the barracks. Hopefully added in a lore friendly way.\r<br />[/size][/size][/*]\r<br />[*][size=3][size=2]Bodyguards to all Jarls and potential Jarls as well as General Tullius. These guards are protected and can only be killed by you or your followers.[/size][/size][/*]\r<br />[*][size=3][size=2]Guards that may change where they patrol depending on certain quests (only minor ones at the moment).[/size][/size][/*]\r<br />[*][size=3][size=2]Equivalent amount added guards regardless of who holds the hold (excluding the Pale for lore reasons. It has less Stormcloak guards than Imperial ones)[/size][/size][/*]\r<br />[*][size=3][size=2]The guards do not have schedules. This due to me wanting to keep the added NPC count down and me not wanting to change cells by adding beds and changing navmeshes.\r<br />[/size][/size][/*]\r<br />[*][size=3][size=2]All added guards respawn[/size][/size][/*]\r<br />[*][size=3][size=2]Entirely scriptless for easier removal[/size][/size][/*]\r<br />[*][size=3][size=2]Multiple .esps so you can choose what you want\r<br />[/size][/size][/*]\r<br />[*][size=3][size=2](optional) Guard combat improvements. This includes some perks, very minor health regeneration, a damage increase, increased level range, more health and stamina, and a better combat style.[/size][/size][/*]\r<br />[*][size=3][size=2](optional) Some guard respawn fixes. Not all the guards in the vanilla game lack respawn flags. While I heard that they respawn regardless, I flagged them just in case.[/size][/size][/*]\r<br />[*][size=3][size=2]A general increase in difficulty (esp. for criminals) due to more guards.\r<br />[/size][/size][/*]\r<br />[*][size=3][size=2]And more[/size][/size][/*]\r<br />[/list][size=3][size=2]As I said this mod is still in beta, but I have gotten plenty done. Breakdown of my progress by hold\r<br />[/size][/size][list][*][size=2]Haafingar - mostly done, but it needs work. I need guards to be sent to Dragon Bridge due Elisif&#39;s actions in &#34;The Man who Cried Wolf&#34;. Also[/size] [size=2]I need to to name the guards out in the country of Haafingar to be named &#34;Haafingar Guard&#34;. Also Solitude and the surrounding areas could use more guards[/size]. [size=2]Otherwise, it is the major hold with the most work done on it.[/size][/*]\r<br />[*][size=2]Hjaalmarch - It&#39;s done. Beside tweaks or bug fixes, it&#39;s likely final.[/size][/*]\r<br />[*][size=2]The Reach - only Markarth and its outlying areas need guards added. Everything else is done.[/size][/*]\r<br />[*][size=2]Falkreath - same as Hjaalmarch.[/size][/*]\r<br />[*][size=2]Whiterun - Same as the Reach.[/size][/*]\r<br />[*][size=2]The Pale - [size=2]same as Hjaalmarch.[/size][/size][/*]\r<br />[*][size=2][size=2]Winterhold - [size=2]same as Hjaalmarch.[/size][/size][/size][/*]\r<br />[*][size=2][size=2][size=2]The Pale - [size=2]Same as the Reach.[/size][/size][/size][/size][/*]\r<br />[*][size=2][size=2][size=2][size=2]Eastmarch - [size=2]Same as the Reach.[/size][/size][/size][/size][/size][/*]\r<br />[/list][size=2][size=2][size=2][size=2]Due to request, I am adding a general overview of what places the mod has added to:\r<br />[/size][/size][/size][/size][list][*][size=2]all cities, towns, and villages (Markarth, Riften, Windhelm[/size], Whiterun, [size=2]and their surrounding areas are not added at the moment. They will be added to in later versions)[/size][/*]\r<br />[*][size=2]All mines owned by civilians or the governments. Amount varies based on size of the mine.\r<br />[/size][/*]\r<br />[*][size=2]Some individual homes or settlements (in the exterior)[/size][/*]\r<br />[*][size=2]Some special areas like the Solitude Lighthouse or the Chill (Winterhold jail)[/size][/*]\r<br />[*][size=2]etc.[/size][/*]\r<br />[/list]I am open to additional suggestions after I&#39;m done with the initial 1.0 release. Some ideas I have are guards that patrol the coutryside, more reactions to quest based actions (when it makes sense), additional guard buffs, etc.\r<br />\r<br />[size=2][size=2][size=2][size=2][size=3]Installation - [/size]Download the file and put the .esp you want in your Skyrim directory&#39;s (wherever that is) &#92;Data folder. Activate the mod in your preferred method (Skyrim Launcher, editing the plugins list, a mod manager, etc.). Lauch up the game and enjoy. This goes without saying, but don&#39;t load up all the .esps. That will cause lag, crashing, and doubles.\r<br />\r<br />[size=3]Incompatibilities[/size] [size=3]- [/size]While I want this mod to be compatible with most mods, there are going to be incompablities somewhere. Anything that eidts the base guard records are going to be incompatible. In that case use the no Guard Fixes or Improvements .esp. Also I cannot guarantee compatiblity with city, landscape, etc. overhauls. Use this with those at your own risk. Also, since this mod adds over a hundred NPCs, it might add slow down to your computer; especially with lower end machines, heavily modded setups, graphics enhancers, and so on. Use at your risk with this.\r<br />\r<br />[size=3]Credits -[size=2] Bethesda for making the game, its DLCs[/size][/size], and the Creation Kit\r<br />\r<br />[size=3]Extras -[size=2] Finally I get one these out&#33; I have working Morrowind, Solstheim, and Falskaar guard add ons that could are mostly done. It&#39;s just I work on these so slowly. I mean really slowly. They&#39;ll come out when I finally work up the [/size][/size]effort to upload them. I plan on updating this mod, but I no make guarantees when they&#39;ll be released. I work at my own pace so expect irregular updates. Feel free to modify this mod for personal use, but ask me for permission first if you want to use it in another mod or upload it elsewhere. Also feel free to ask me to upload pictures of your own. My ingame screenshots turn out all screwy for some reason. Finally, I hope that you enjoy the mod and finally have a reasonable amount of guards in your game.\r<br />[/size][/size][/size][/size]\r<br />[size=2]\r<br />[/size]",
  "categoryId": "33",
  "version": "0.5",
  "author": "King Feraligatr",
  "createdUnix": "1410253592",
  "updatedUnix": "1410253479",
  "containsAdultContent": false,
  "uploadedBy": "KingFeraligatr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000126131",
      "name": "Skyrim Gets Guarded 0.5 beta",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "329",
      "fileName": "Skyrim Gets Guarded 0.5 beta-48654-0-5.zip",
      "uploadedUnix": "1410253479",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/1695c883b2f42393d7208b17e10dd8a5dc04e1756aa4b252318c0bca2a24abc2/analysis/1410253562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Gets%20Guarded%200.5%20beta-48654-0-5.zip?fid=1000126131&ttl=1535828951&ri=8192&rs=8192&setec=370bc16d5dbd3e75a1d038a27a35c925"
    }
  ]
}