{
  "modId": 48658.0,
  "modName": "The Band of the Pale Crow",
  "summary": "Traverse the River Bjoulsae and explore the Dragontail Mountains of Hammerfell… Delve deep into dungeons where unspeakable evil lies… Hunt for bounties throughout the lands…\r<br />The Band of the Pale Crow aims to add diverse content from new lands and storyline, new armors/weapons/items, to followers and other companions.\r<br />",
  "descriptionHtml": "Currently a WIP...\r<br />\r<br />So far, I&#39;ve only managed to finish a fraction of what I have written down and planned for this mod. \r<br />I&#39;ve included custom skins/textures for everything from landscape and vegetation to actors and creatures, weapons and armor to miscellaneous items and literature. \r<br />\r<br />I&#39;ve also included custom music composed by myself with the aid of &#34;Magix Music Studio&#34; to add some personal/unique/immersive feelings to the new spaces. \r<br />\r<br />I aim to make this as lore friendly as possible, but with limited information available (especially related to Hammerfell), I&#39;ve had to fill in a few gaps (within reason, of course)...\r<br />\r<br />-------------------------\r<br />\r<br />The Key is that I&#39;ve always been a lurker; downloading mods from other very talented modders... and felt that the only way I could truly repay them for enhancing my gaming experience was to try to enhance theirs. Which is why when I complete this mod, I hope for people to think of it as an expansion, rather than just a mod (to give you the idea of the size)...\r<br />\r<br />Now, I am just one man (with VERY limited scripting abilities; and voice acting skills) and I must admit that I&#39;m still learning alot about CK, but I AM highly motivated and have WAY too much time on my hands... So hopefully we&#39;ll get to see some progress very soon.\r<br />\r<br />-------------------------\r<br />\r<br />Credits:\r<br />\r<br />I&#39;d personally like to thank the following people/companies for providing the various tools I&#39;ve used in making this mod:\r<br />\r<br />Everyone at Bethesda - Of course for making the game... \r<br />The team at Magix Music Studio \r<br />The team at Adobe (for Photoshop; where would i be without you?)\r<br />Tamira - For the Modder&#39;s resource &#34;New Plants 1_2&#34;\r<br />Vicn - For the Modder&#39;s resource &#34;Vicn Creature Resources&#34;\r<br />\r<br />(The following are people I&#39;m required to credit per Tamira&#39;s request:)\r<br />\r<br />Yughues aka Nobiax (http://www.sharecg.com/pf/full_uploads.php?pf_user_name=yughues) for creating almost all of the original models and textures\r<br />Birdy (http://www.sharecg.com/pf/full_uploads.php?pf_user_name=birdy) for creating the decidious tree mesh.\r<br />The Niftools team for giving us Nifskope\r<br />Bethesda for Skyrim and the Creation Kit\r<br />\r<br />(The following are people I&#39;m required to credit per Vicn&#39;s request)\r<br />\r<br />Bethesda\r<br />ECE Team\r<br />dimon99\r<br />Radioragae\r<br />REN\r<br />Peggy\r<br />NewSea\r<br />SKS\r<br />Planeswalker Author\r<br />Dwemer letter Author\r<br />dongle\r<br />\r<br />((I&#39;m very sure I&#39;ll have to end up thanking/crediting alot more people before I&#39;m done))\r<br />\r<br />",
  "categoryId": "30",
  "version": "",
  "author": "Solomon",
  "createdUnix": "1386621355",
  "updatedUnix": "1386621355",
  "containsAdultContent": true,
  "uploadedBy": "S0LOMON",
  "primaryFile": null,
  "files": []
}