{
  "modId": 48716.0,
  "modName": "gooboos vanilla walk and run tbbp animations UNPK",
  "summary": "A tbbp compatible breast/butt bounce animation replacer for the regular walking and running animations. The animations are optimized for the UNPK body replacer, though they will work with any tbbp compatible and xp32 compatible body. ",
  "descriptionHtml": "There are a lot of tbbp walking and running animations out there, but a lot of them are too feminine looking for me. I always thought the vanilla walk and run animations for women were just fine, so I added breast and butt animations to both, and left the rest of the animations the same. I uploaded a preview video for those who want to see what the animations look like before installing the file. Here is a link to dailymotion if you&#39;d rather watch that instead-\r<br />\r<br />http://www.dailymotion.com/video/x18aesp_unpktbbp_videogames\r<br />\r<br />*****READ THIS BEFORE ASKING ME WHY SOMETHING DOESN&#39;T WORK*****\r<br />\r<br />While this mod requires the xp32 skeleton and a TBBP compatible body, it should be noted that MANY TBBP BODIES (such as ADEC) DO NOT HAVE BUTT WEIGHTING ON THEM. THE BUTT WILL NOT MOVE WITHOUT IT&#33;\r<br />\r<br />If you are using a tbbp body other than my unpk body, you must CHECK AND MAKE SURE IT ACTUALLY HAS BUTTWEIGHTING ON IT. I REPEAT, MANY OF THEM DO NOT. There isn&#39;t a lot of booty love here on the Nexus.\r<br />\r<br />The ONLY things you need to make these animations work are the XP32 skeleton and a tbbp compatible body WITH butt weighting- that&#39;s it. It isn&#39;t anymore complicated than that. \r<br />\r<br />I designed the animations to go with my UNPK body (http://www.nexusmods.com/skyrim/mods/32540) although it should work with any body that&#39;s properly weighted for tbbp and uses the xp32 skeleton. I haven&#39;t tested this mod on any other body types, so I have no idea how they&#39;ll look. Maybe people in the comments section can say if they look good or not on other body types.\r<br />\r<br />Currently this mod only replaces the walkforward and runforward animations. I am still working on the other walking and running animations. (walking to the left, right, backwards, etc.)\r<br />\r<br />***UPDATE 3/27- ***\r<br />\r<br />I originally said I was going to be doing animations for all of the other walking and running directions as well, but after watching HDT physics develop and come a long way I think doing all of the other animations is kind of redundant at this point. Personally, I think having a good hand-animated walking and running animation, and letting HDT physics take care of everything else, works best, so I don&#39;t think I&#39;m going to work on the other walking and running directions. Instead I&#39;ve uploaded the HDT version I&#39;m currently using which I think looks the best for the UNPK body. Just drag and drop to your Skyrim Data folder. Requires SKSE if you don&#39;t already have it installed. \r<br />\r<br />\r<br />INSTALLATION- Just install to your Skyrim DATA folder. Easy peasy.\r<br />\r<br />USER PERMISSIONS- Do whatever you want. I don&#39;t give a shit. ",
  "categoryId": "51",
  "version": "",
  "author": "gooboo",
  "createdUnix": "1386780350",
  "updatedUnix": "1395949288",
  "containsAdultContent": true,
  "uploadedBy": "gooboo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086329",
      "name": "vanilla walk and run replacer",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "vanilla walk and run replacer-48716-.rar",
      "uploadedUnix": "1386780162",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7bf3e61b6bc033964904cf932d545781b98f82243d1987c0a614903939d43f82/analysis/1407831303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/vanilla%20walk%20and%20run%20replacer-48716-.rar?fid=1000086329&ttl=1535829063&ri=8192&rs=8192&setec=6f4004e14f804ad0174b01306df33f16"
    },
    {
      "fileId": "1000086330",
      "name": "preview video",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17061",
      "fileName": "preview video-48716-.rar",
      "uploadedUnix": "1386780332",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3c32972d6bfbd336d407441c6201232be6b630395cd04209696961901b3ff25d/analysis/1407831310/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/preview%20video-48716-.rar?fid=1000086330&ttl=1535829063&ri=8192&rs=8192&setec=078c9ad7cf8fb4df83612151a8a77a2f"
    },
    {
      "fileId": "1000102628",
      "name": "HDT physics for UNPK",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2277",
      "fileName": "HDT physics for UNPK-48716-.rar",
      "uploadedUnix": "1395949288",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/69bc127ce89ca025a86be5c261318dde7210eb7e7e2be4c8c0ec337ae1dd2f5e/analysis/1407997207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20physics%20for%20UNPK-48716-.rar?fid=1000102628&ttl=1535829064&ri=8192&rs=8192&setec=bc079f39f46873f0680b6de590833a35"
    }
  ]
}