{
  "modId": 48721.0,
  "modName": "Harbinger Retreat",
  "summary": "A lore friendly, immersive, medium size home with a Harbinger theme.",
  "descriptionHtml": "Update Notes: Version 1.0 is out&#33; The previous version works great, however it was lacking some things that have been added for the release version.  IF YOU ARE UPDATING DO NOT JUST LOAD THE NEW VERSION&#33;  I recommend a clean save.  Grab all your items, run outside, save, load the new file, run back in, let the auto sorter do it&#39;s thing :)\r<br />\r<br />Update Changes: \r<br />-Deleted weapon plaques upstairs in main bedroom and followers bedroom as they are resource intensive and not in main traffic areas.\r<br />- Added two more mannequins to crafting area.\r<br />- Changed all weapon racks from 4 weapons to five.\r<br />- Added two single racks in the armory.\r<br />- Added Weapon plaque and rack to the crafting area\r<br />- Changed some taxidermy animals in the main room\r<br />- Added some clutter items to table tops\r<br />- Added a non sorted container next to the auto sorter for convenience\r<br />- Added two new containers to the crafting room for convenience\r<br />- Replaced weapon plaque in bedroom with hold shields\r<br />- Adjusted some lighting\r<br />\r<br />Description:\r<br />A medium size home outside of Whiterun with a Harbinger theme.  This house is fully equipped and lore-friendly.  This house caters to us pack rats, features a “museum” room, and has a sensible amount of clutter to look “lived in.”  I noticed that while there are some amazing house mods out there, I was looking for something more immersive to a hard drinking Harbinger / Werewolf character.  I also wanted a house that would feature plenty of storage, crafting, a display room, auto sorting and bedrooms for my followers.   Use the home for it’s functionality or sit by the fire and enjoy a good book.\r<br />\r<br />Feature:\r<br />-\tItemized Storage\r<br />-\tAuto Sorting\r<br />-\tAll Crafting Stations\r<br />-\tDisplay Room\r<br />-\tDragon Priest busts\r<br />-\tFollower Bedrooms\r<br />-\tWine Cellar\r<br />\r<br />Before we move on, I DID NOT SCRIPT THE AUTO SORTING.  I cannot stress this enough.  All credit goes to [url=http://www.nexusmods.com/skyrim/users/3924910/]Sjogga[/url] for his incredible scripting resources he put out to us modders.  If you want to use his scripts, go  [url=http://www.nexusmods.com/skyrim/mods/24678/]here[/url].\r<br />\r<br />Backstory:\r<br />I am doing a full Werewolf playthrough with Brevi’s [url=http://www.nexusmods.com/skyrim/mods/12687/]Tales of Lycanthropy[/url], which makes my transformations coincide with the moon.  I thought it was silly to be the Thane of Whiterun, yet put its citizens in danger from my more beastly side, so I moved out of Whiterun.  From there I can still protect my city from both outside threats, and myself.\r<br />\r<br />Installation:\r<br />Use NMM or extract to your data folder.  \r<br />Load this mod in the same order as other house mods, I recommend after any changes to Whiterun (around the same order as Ebonvale).\r<br />Enjoy.\r<br />\r<br />Known Issues - \r<br />-This file can make some map mods lose their reference.  Please move any map mods lower in load order.  \r<br />- This mod may interfere with any mod that puts other buildings around this area.  I have not tested it with Whiterun Mansion or any mod that adds more structures.\r<br />\r<br />\r<br />Special Thanks:\r<br />This is my first mod, so I would like to thank Sjogga again for his scripts which I used.  Also I would like to thank the incredible modding community for their plethora of creation kit tutorials.  I was able to put this out in a month with absolutely zero modding experience so all credit goes to them dumbing it down enough for even me to understand it.\r<br />\r<br />",
  "categoryId": "67",
  "version": "1.0",
  "author": "Tyrion10",
  "createdUnix": "1386785657",
  "updatedUnix": "1387405371",
  "containsAdultContent": false,
  "uploadedBy": "Tyrion10",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087336",
      "name": "Harbinger Retreat v1a",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "179",
      "fileName": "Harbinger Retreat v1a-48721-1-0.7z",
      "uploadedUnix": "1387405371",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d7dc170b4d3ad670f40c3bbb0487d31be53b1bde095392e7a969a8e5b3e7272d/analysis/1407848171/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harbinger%20Retreat%20v1a-48721-1-0.7z?fid=1000087336&ttl=1535829072&ri=8192&rs=8192&setec=6226a8a724d26d4d45784c448cdda915"
    }
  ]
}