{
  "modId": 48755.0,
  "modName": "Convenient Horses Polish",
  "summary": "This is full translate version [url=http://www.nexusmods.com/skyrim/mods/14950/?]”Convenient Horses” mod by Alek[/url]\r<br />\r<br />\r<br />[b]NOTKA TŁUMACZA[/b]\r<br />\r<br />Mod „Convenient Horses PL” jest działającym całkowicie niezależnie od oryginalnej (anglojęzycznej) wersji, w związku z czym nie wymaga wgrywania dodatkowo moda [",
  "descriptionHtml": "This is full translate version [url=http://www.nexusmods.com/skyrim/mods/14950/?]”Convenient Horses” mod by Alek[/url]\r<br />\r<br />\r<br />[b]NOTKA TŁUMACZA[/b]\r<br />\r<br />Mod „Convenient Horses PL” jest działającym całkowicie niezależnie od oryginalnej (anglojęzycznej) wersji, w związku z czym nie wymaga wgrywania dodatkowo moda [url=http://www.nexusmods.com/skyrim/mods/14950/?]”Convenient Horses” mod by Alek[/url]\r<br />W celu pełnego spolonizowania moda oryginalnego potrzebna była również polonizacja pliku „convenient horses.bsa”, w związku z tym sama podmiana pliku „convenient horses.esp na polską wersję jest niewskazane.\r<br />\r<br />PC_Maniac\r<br />\r<br />\r<br />[b]INFORMACJE[/b]\r<br />\r<br />- Konie dla towarzyszy ( UFO , AFT i EFF kompatybilne , koni dla 15 towarzyszy , skrypty SI, zaawansowane funkcje ) .\r<br />- Walka konna dla towarzyszy &#33;\r<br />- Pancerz dla konia zarówno gracza jak i towarzyszy.\r<br />- Szarża konna.\r<br />- Automatyczne zbieranie przedmiotów z konia w czasie jazdy.\r<br />- Błyskawiczne przywołanie konia.\r<br />- Zagwizdanie na konia w celu jego przyzwania.\r<br />- Rozbudowane okno rozmów dotyczących koni oraz automatyczne zbieranie przedmiotów.\r<br />- Zbieranie ziół z siodła.\r<br />- Szybki zsiadanie i automatyczne wyposażanie w broń podczas walki.\r<br />- Funkcje ustawienia wyposażenia koni oraz łatwy dostęp do wyposażenia .\r<br />- Przełączane stosunków frakcji dla koni na przyjazne ( lub neutralne).\r<br />- Inteligentne podążanie konia.\r<br />- SI zachowania koni w przypadku walki ( tchórzliwe lub ryzykowne ).\r<br />- Ustawienia nieśmiertelności koni i premie do zdrowia/wytrzymałości/prędkości.\r<br />- Łatwa konfiguracja za pomocą przycisków menu i konfiguracji klawiszy dostępu.\r<br />- Ustawianie klawiszy dostępu lub zaawansowanych klawiszy (Multiklawisz wymaga SKSE).\r<br />\r<br />\r<br />[b]PIERWSZE KROKI[/b]\r<br />\r<br />[b]Instalacja:[/b]\r<br />1. Upewnij się, że prawidłowo usunąłeś wszystkie poprzednie wersje tego moda , zatrzymując zadanie za pośrednictwem konsoli , a zapisałeś czysty save ( zob. Rozwiązywanie problemów).\r<br />2. Zaktualizuj Skyrim do minimalnej wersji 1.9.32.0.\r<br />3. Zainstaluj [url=http://skse.silverlock.org/](link do) SKSE 1.6.15 +[/url] , jeśli chcesz skorzystać z zaawansowanych funkcji i klawiszy. Jeśli potrzebujesz pomocy w instalacji i działaniu SKSE [url=http://www.youtube.com/watch?v=xTGnQIiNVqA&feature=youtu.be]zobacz ten film[/url]. \r<br />SKSE nie jest wymagana dla tego moda do pracy lecz wskazane by wykorzystać wszystkie jego funkcje.\r<br />4. Możesz teraz pobrać , zainstalować i używać Convenient Horses PL.\r<br />\r<br />\r<br />[b]Deinstalacja[/b]\r<br />(do poprawnej pracy wymaga czystego Save podczas uaktualniania zobacz część Rozwiązywanie problemów - patrz niżej) :\r<br />\r<br />\r<br />1. Otwórz konsolę i wpisz ( StopQuest CH ) do zatrzymania wszystkich uruchomionych skryptów. Upewnij się, nie rób tego, w trakcie gdy frakcje są aktualizowane przez mod lub wszelkie inne działania jakie mod wykonuje w tym czasie .\r<br />2. Zapisz grę pod nową nazwą. Wszystkie poprzednie zapisy wykonane gdy mod był aktywny są uważane za brudne  i nie zaleca się ich używania po deinstalacji moda lub jego aktualizacji.\r<br />3. Odinstaluj mod.\r<br />\r<br />\r<br />[b]Konfiguracja:[/b]\r<br />Przed rozpoczęciem korzystania z moda poświęć kilka chwil, aby przejść przez proces konfiguracji. Możesz uzyskać dostęp do menu konfiguracyjnego w grze za pomocą Konfiguracja modów -&gt; &#34;Convenient Horses&#34; lub poprzez interfejs SkyUI - MCM . Jeśli chcesz korzystać z trybu „Osobne klawisz” upewnij się, że w konfiguracji wyłączyłeś funkcję „Pojedynczy klawisz”. Jeśli chcesz korzystać z koni dla swoich towarzyszy musisz najpierw włączyć tę funkcję.\r<br />\r<br />[b]Tryby kontroli :[/b]\r<br />\r<br />    Osobne klawisze: Ustaw pięć niestandardowych klawiszy w Rozmawiaj/przeszukaj, Zbierz przedmioty , Szybkie zsiadanie, Juki konia , Podążaj. Wymaga SKSE i wyłączenia trybu Gamepad. Jeśli nie są spełnione w/w warunki mod automatycznie wyłączyć tryb „Osobne klawisze” i wybierze tryb „Pojedynczy klawisz”.\r<br />    Pojedynczy klawisz: Użyj przycisku by włączyć tryb ( domyślnie : Klawiatura E, Gamepad A) , aby aktywować konkretnego konia razy (jak podwójne kliknięcie w systemie Windows) . Jedno kliknięcie , aby aktywować / dezaktywować wierzchowca by go dosiąść lub zsiąść, podwójne kliknięcie by otworzyć ekwipunek , potrójne kliknięcie aby przełączyć podążanie, wielokrotne kliknięcie otwiera okno rozmowy / przeglądanie / zabieranie. Tryb ten sprawia, że wsiadanie / zsiadanie mniej skomplikowane, aby program prawidłowo wykrywał  ilość kliknięć i opóźnień może być potrzebne dokładne skonfigurowanie tej opcji w menu konfiguracyjnym modułu .\r<br />\r<br />\r<br />\r<br />Przewodnik Kompatybilności Dla moderów  (opis na stronie http://www.nexusmods.com/skyrim/mods/14950/?):\r<br />\r<br />\r<br />\r<br />[b]Zmiany fabularne[/b]\r<br />\r<br />(tłumaczenie wkrótce)\r<br />Followers&#39; Horses (order of preference):\r<br />•\tEFF - Extensible Follower Framework by Expired\r<br />•\tUFO - Ultimate Follower Overhaul by fLokii\r<br />•\tAFT - Amazing Follower Tweaks by Dheuster\r<br />\r<br />Supporting vanilla followers and up to fifteen followers from either of these mods. Installed mod will be detected automatically so there is no need for any additional tweaking. This feature is disabled by default and has to be enabled in configuration menu.\r<br />Once enabled each follower will be provided with a personal named horse that nobody else can ride. If horse is killed a new one will be provided. This whole system is automatic and you don&#39;t have to worry about their horses at all. When you mount mod will make sure they do too and same goes for dismount. Complex scripting is used in order to be able to control their AI, make mounting/dismounting more responsive and add features like horse call and fast dismount in combat.\r<br />Few notes about UFO: If you use UFO 1.2b or higher you can disable its horses by talking to Skulvar the hostler at Whiterun stables via &#34;You know...&#34; dialogue. There is also incompatibility with UFO relax mode so do not use it while followers&#39; horses are enabled.\r<br />\r<br />You can choose which horse each follower will ride via &#34;I want you to ride...&#34; dialogue topic or use configuration menu to select global horse skin type and horse armor which will apply to all followers&#39; horses. Horse types and horse armor assigned via dialogue will be remembered for each follower even if they are dismissed. Serana is the only follower that cannot have horse chosen for her, until Dawnguard main quest line is completed.\r<br />\r<br />Bethesda didn&#39;t expect NPCs actively using the horses so they made a slight mistake with horse mounted combat camera changes and its conditioning. You will experience mounted combat camera reset to riding position when followers mount the horse and swithching back and forth when they draw or sheathe weapons in mounted combat. This is not possible to fix because camera behavior is hard coded and only way to work around the problem is to re-draw or re-sheathe the weapon yourself. Convenient Horses can re-draw the weapon for you if you enable that option in config. If you use SKSE, camera position will be updated without re-drawing the weapon and you can also manually force camera to update by pressing &#34;Horse Follow Toggle&#34; key in BoundKey mode while mounted.\r<br />\r<br />Mounted Combat For Followers:\r<br />By default game does not support mounted NPCs using weapons in any way. I worked really hard on this feature which is something that is not supposed to work in this game at all. Every attack and every detail is simulated and heavily scripted from the point of followers drawing the weapon while riding to sheathing it. Scripted behavior include combat target selection, collision distance detection, timing attack animations, left/right attack decision, use of mounted power attacks, taunting of opponents at start of combat and voice exertions. Each follower will be given special melee weapon for the purpose of mounted combat which deal no damage and produce no hit effects in order to leave that behavior to be simulated by the script, otherwise they would miss the attacks 90% of the time. These weapons are modified variants of regular weapon materials and types: Iron, Steel, Elven, Dwarven, Orcish, Glass, Ebony, Daedric and Dragonbone. Weapon choice is made for each follower at the beginning of each mounted combat session by matching their current weapon material and type. If they don&#39;t have melee weapon equipped or it cannot be matched then script will decide which weapon type is best for their skill set and material will be chosen according to player&#39;s level which is purely cosmetic. Mounted combat damage is not related to weapon material but only to weapon type, follower skills, magical buffs, game settings, opponent armor rating and player level modifier to base damage which simulate weapon material and smithing upgrades. If you play on different difficulty settings and find damage too low or too high you can alter the final damage percentage via config where you can go as low as no damage and up to 300% but I advise to leave it at 100% for balance because damage will increase as you level up anyway.\r<br />\r<br />Horse Armor:\r<br />Horse Armor can be changed via configuration menu, separately for player&#39;s horse and followers&#39; horses. Available armors are: Leather, Nordic, Dwemer, Ebony, Daedric and Dragonbone. None of them give actual armor rating to the horse and are purely cosmetic addition to the game.\r<br />\r<br />Mounted Combat Horse Charge:\r<br />Horse can charge at other actors if sprinting during the mounted combat, knocking them and dealing damage. Damage done takes into consideration player level, current horse speed, angle of impact and target&#39;s armor rating, ranging from 5 to 160 damage approximately. On each successful knockdown horse will lose 15-20% of its base stamina which in return will keep you from abusing this feature by sprinting repeatedly. Charge will not work on already knocked targets and might be hard to use if target is chasing you. It is best used to initiate combat or if target is distracted by attacking someone else. Note that both friends and foes can be charged and knocking friendly actors is considered to be the act of crime.\r<br />\r<br />Horse Call:\r<br />Before you can start using a horse call you must buy Horsecaller&#39;s Horn from any stable master for 500 gold. Once you buy the horn Horse Call ability will be available as a power. Use it to call your horse and you should appear mounted after a short cinematic. Only works in Tamriel outdoor worldspace, when not in combat. Avoid using it in tight and closed locations. Followers will also use Horse Call and it is fully synchronized if you are the initiator. If you have Convenient Horse Herding mod installed use your horse call power while sneaking and you will be able to call any horse from your herd by its name. It is your responsibility not to leave horses in Solstheim, Soul Cairn, Blackreach or near fort Dawnguard as horses cannot pass through zoning points by themselves.\r<br />\r<br />Horse Whistle:\r<br />Alternative and more lore friendly way of calling your horse and is best used if horse is set not to follow you or if using smart follow mode and horse stops following due to location filtering. There are no tricks used here to speed up the process so horse should come to you eventually by using standard game AI pathing. Waiting one hour game time will speed up the process if horse is too far away. Horse Whistle is available as a power but in order to obtain it you will need to learn how to whistle and that is something that you will have to find out on your own through the regular gameplay.\r<br />\r<br />Mounted Conversations And Corpse Looting:\r<br />This doesn&#39;t work by targeting with crosshair as you might suspect but by using a radius search method. You must pay attention to the relative position between the target actor and your horse (see picture). You can also talk to mounted actors because if horse has been found as a target additional search will be performed in order to find the person who might be riding it. With the inclusion of mounted combat and possibility to kill opponents while riding, in order to make things more convenient you may loot dead bodies the same way you would initiate in conversation with live actors. In case of using Multi Tap control mode this feature is shared with Herb Harvesting and will take precedence over it if any of the valid actors has been found.\r<br />\r<br />Mounted Herb Harvesting:\r<br />Similar to mounted conversations this feature works by scanning for nearby harvestable. Due to the nature of script functions returning only one plant at a time and without possibility to filter out harvested ones I had to code for multiple passes and each pass scanning different sector around the player. If you&#39;re using Multi Tap control mode you can keep tapping to harvest while moving and if you stop moving then attempt will be made to collect all nearby herbs in one pass. Bound Key mode allows continuous harvesting if button is being held and uses even more sophisticated logic. One more addition to Bound Key mode is &#34;Consolidate&#34; option which disables Harvest key and assigns it as a secondary function to Mounted Conversations (similar to how Multi Tap mode combines these two features by prioritizing talk/loot over harvesting).\r<br />\r<br />Fast Dismounting:\r<br />This doesn&#39;t add any new custom animations but intercepts the default dismount animation instead and replaces it with jump animation or weapon draw animation if in combat, while translating the rider behind the horse at the same time, giving an illusion of jumping off the horse back. In Multi Tap mode this will replace the default dismount action and can be configured to work all the time, only in combat or competely disabled. Bound Key mode uses separate key for fast dismount. If being used during mounted combat it will force the game to ignore weapon sheathe animation in order to perform fast dismount without any delays.\r<br />\r<br />Horse Inventory:\r<br />All items will be stored in a remote container called Large Horse Sack. By default it allows unlimited capacity but you can set custom carry weight limit in config and then mod will access main container via remote actor called Small Horse Sack. Bound Key mode allows remote inventory access to help with the issue of being over-encumbered when you want to take all the items in order to sell them to a merchant or store in your house. Remote inventory access only works while in major cities, shops, player houses, guild houses, castles and inns.\r<br />There is additional feature in BoundKey mode for quick transfer of common crafting materials. Materials are broken into three categories, each for corresponding profession: Alchemy, Blacksmithing and Enchanting. Opening horse inventory via quick transfer menu will always directly access Large Horse Sack, bypassing any carry weight limit. To access quick transfer menu hold down modifier key while opening horse inventory. Modifier key is dynamic and choosen in following order: 1.Alt, 2.Ctrl, 3.Shift depending on which keys are in use by standard CH features so first available key is always used. If all three modifier keys are already bound to CH features then this feature will not work.\r<br />\r<br />Hot Air Balloon Kit:\r<br />This useful item can be crafted at any forge under misc section. If carried in inventory it will be automatically deployed when over-encumbered which gives 10000 carry weight for 5 minutes.\r<br />\r<br />Faction Relations:\r<br />When you first time load the mod new friendly faction relations will be established and horse should never attack or participate in combat. This is a lengthy procedure because there are over thousand of factions and it might take up to a minute to complete. You will be notified of the progress and it is best not to save the game while faction relations are being updated but you may continue to play normally. If you use a battle mount or wish to turn off this feature you can queue for faction relation update by using the configuration menu. Followers&#39; horses are also affected by these faction relations. Faction relations will update automatically if new factions from supported mods/DLCs are detected on game load.\r<br />\r<br />Smart Horse Follow:\r<br />By default horses will not follow their owners. Can be toggled via Follow key if using Bound Key mode or dismounted Triple Tap if using Multi Tap mode. Additional option is available in config menu where you can choose between Smart and Always. &#34;Smart&#34; means that horses will temporarily stop following if their owners are sneaking or within a specific location (more than 200 handpicked locations like bandit camps, forsworn camps, giant camps, hagraven nests, military camps/forts, orc strongholds, ship wrecks, etc.). You can also select one of three presets (Short, Medium, Long) which forces the horse to maintain the specific distance when following you.\r<br />\r<br />Horse Combat AI Behavior:\r<br />While there are only two options (Cowardly and Foolhardy) they change a great deal of how your horse will perform when it comes to combat situations. It is best used in combination with faction relations to achieve desired results. Cowardly will never initiate in combat, will always flee from threats and will not help anyone in combat. Foolhardy will attack enemies on sight, will never flee from combat, will help friends/allies and will have its damage increased as 20+PlayerLevel. For example having friendly faction relations and foolhardy behavior will result in horse that does not participate in combat but also does not flee from other combatants. On the other hand if you set factions to netural, keep foolhardy behavior and enable horse follow it then becomes a fearless battle companion.\r<br />\r<br />Tips & Tricks\r<br />\r<br />•\tHold &#34;Walk&#34; key when you want to make short turns while riding a horse. Very useful when standing near the edge of a cliff, need to position better for a melee weapon swing in mounted combat or want to do quick 180 degree turn for another Horse Charge run.\r<br />\r<br />\r<br />Troubleshooting\r<br />\r<br />False Errors:\r<br />Some people like to dig into script logs or use third-party tools to scan mods for dirty edits. Note that I always check script logs for errors and while some of them are normal to appear on game load (e.g. &#34;error: File &#34;XFLMain.esm&#34; does not exist or is not currently loaded.&#34;) if you find any error in log related to CH that repeats itself many times after one game load then you probably have problems with old scripts being stuck in your save because you did not follow the update or clean save procedure.\r<br />Unique Frost use CH as dependancy and some third-party tools might report missing RACE records. This is completely normal and should be ignored.\r<br />&#34;Identical to master&#34; records related to horse skins reported by TES5Edit are there on purpose and should not be cleaned.\r<br />\r<br />Compatibility:\r<br />•\tConflicts with Better Horses, Horse Inventory or similar mods which deal with activation blocking on the horse.\r<br />•\tConflicts with mods that use Variable01 actor value on followers, which is used by CH to store horse skin and armor selection.\r<br />•\tMinor conflicts with mods that alter default horse skin armor addons (not re-texture mods). Conflict will cause horse tail to be always black when using horse armors.\r<br />•\tMust be loaded after SkyTEST-RealisticAnimals&Predators.esp if you want dynamic mane on SkyTEST&#39;s wild horses.\r<br />\r<br />\r<br />Finding Source Of The Problem:\r<br />Mod has been thoroughly tested through the lengthy beta test period. If you experience any kind of problems then you should check for any of the following:\r<br />•\tRequirements - Skyrim v1.9.32.0+ and optional SKSE v1.6.15+. Make sure your game is up to date and SKSE script files installed correctly (PEX script files are inside .DataScripts folder in the SKSE archive). Most common problem with this is that mod cannot load if Skyrim is too old, some of the features are not working and that you cannot dismount.\r<br />•\tConflicts - With so many mods available it is not possible to know which ones are in conflict. Similar mods or mods that put scripts on the horse might cause a conflict and some conflicts can even cause CTDs. Having too many scripts running or scripts that are not optimized or badly coded can slow Papyrus down and leave litle to no free resources for Convenient Horses to work properly (you might experience delays and bad responsiveness). Only way to find out is to disable all other mods and then enable half by half until you pinpoint the source of the problem.\r<br />•\tDirty Save - Can be caused by other mods you used in the past as well as previous versions of this mod that are not uninstalled correctly by following instructions. Start a new game with a new character and try to replicate the problem. If everything works fine then you know it was the problem with a dirty save.\r<br />•\tSomething Else - Sometimes people come here to report problems related to horses and mounted animations. While their concerns are logical they were always wrong to come here and it was always another mod causing the problem. Simply remove this mod by following the instructions and see if you still have the problem.\r<br />\r<br />\r<br />Script Latency Issues:\r<br />Convenient Horses will not work properly if you&#39;re suffering from increased script latency. Latency Test is provided with the mod and is a good way to see if Papyrus event manager is responsive or not. Latency should at best stay below 50ms and never peak above 100ms. Increased script latency is usually related to dirty saves and build up of unexecuted code which can prevail even after the mod that was causing it has been removed.\r<br />SKSE 1.6.7+ has come with the way of cleaning orphaned OnUpdate() events from saved games which should help in fighting the save bloat. SKSE console command &#34;ClearInvalidRegistrations&#34; should be called when game is loaded and it will attempt to process all queued events that are stuck in the save. This might take hours depending on amount of bloat. You can queue this command to execute automatically on each game reload by adding following lines to DataSKSEskse.ini file:\r<br />\r<br />[General]\r<br />ClearInvalidRegistrations=1\r<br />\r<br />\r<br />Save Game Cleaning:\r<br />\r<br />Load the save you want to make clean.\r<br />Release the running scripts by typing in console (StopQuest CH).\r<br />Overwrite the save.\r<br />Repeat steps 1, 2 and 3 for all saves you want to make clean.\r<br />Disable/Uninstall the mod in mod manager.\r<br />Load the saves you made in step 3 and overwrite them again one by one, this time without the mod being loaded.\r<br />\r<br />If you were upgrading the mod with clean save procedure everything you&#39;ve set up in config will be lost along with horse call power and whistle quest. To regain these powers artificially use console to change few global values (set CHBuyHornCompleted to 1) and (set CHLearnWhistleCompleted to 1). After you change these values restart the quest by typing (StopQuest CH) followed by (StartQuest CH) and you will gain access to these powers as if you had gained them the natural way. I strongly recommend not to use this procedure if you are installing the mod for the first time as you gonna miss the real fun of learning the whistle.\r<br />\r<br />\r<br />Remoivng Non-Playable Items:\r<br />If you think you were a victim of v4.7 advanced auto loot bug then follow these steps to check and get rid of any non-playable items that might have ended up in your inventory:\r<br />\r<br />Save the game to a new slot in case you make a mistake and remove a wrong item.\r<br />Find an empty container in the world and make sure it is not owned (no &#34;steal&#34; red text appears).\r<br />Open console and click on that container so its ID is displayed on the top of the console.\r<br />Type in console (player.removeallitems containerID) to move all playable non-quest items to that container.\r<br />Check your carry weight and if it is 0 then everything should be fine and you can get your items back, skip other steps and continue playing.\r<br />If carry weight is greater than 0 then type in console (player.inv) and it will list all items that remain in your inventory.\r<br />Check your inventory menu for existence of each listed item. You should only see quest items but not the unplayable ones.\r<br />When you pinpoint the unplayable item that needs to be removed type in console (player.removeitem itemID quantity) where itemID can be seen in console for each item displayed after typing (player.inv) and quantity is number of items in the stack.\r<br />Repeat steps 6 to 8 until you remove all unplayable items and carry weight is 0, retrieve your items from that container and continue playing.\r<br />",
  "categoryId": "83",
  "version": "5.0",
  "author": "PC_Maniac",
  "createdUnix": "1386879290",
  "updatedUnix": "1388433868",
  "containsAdultContent": false,
  "uploadedBy": "pcmaniac1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086481",
      "name": "Convenient Horses v4_9 PL",
      "version": "4.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38949",
      "fileName": "Convenient Horses v4_9 PL-48755-4-9.zip",
      "uploadedUnix": "1386878843",
      "modVersion": "4.9",
      "virusScanUrl": "https://www.virustotal.com/file/5d199bde44fe1252fb5a93de63c84f6d0f681d56857bca1b2797c20d27f4506a/analysis/1407833242/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_9%20PL-48755-4-9.zip?fid=1000086481&ttl=1535829127&ri=8192&rs=8192&setec=aadd260b72014b04a6c2072d4c07e8f8"
    },
    {
      "fileId": "1000089057",
      "name": "Convenient Horses v5_0 PL",
      "version": "5.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48254",
      "fileName": "Convenient Horses v5_0 PL-48755-5-0.rar",
      "uploadedUnix": "1388433868",
      "modVersion": "5.0",
      "virusScanUrl": "https://www.virustotal.com/file/2dd1a328a0b735827d1ed979badd0687a1dd500a447cad5e48444ae2a175fa5c/analysis/1407865176/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v5_0%20PL-48755-5-0.rar?fid=1000089057&ttl=1535829128&ri=8192&rs=8192&setec=4c051cd09d9f299c2f01b1b133d42aa1"
    }
  ]
}