{
  "modId": 48752.0,
  "modName": "Convenient Horse Herding Polish",
  "summary": "Info od tłumacza\r<br />Mod &#34;Convenient Horse Herding v1_1 PL&#34; jest w pełni działającym spolszczonym oryginalnym modem &#34;Convenient Horse Herding v1_1&#34;, dzięki temu do poprawnej pracy nie wymaga instalacji oryginalnego moda.",
  "descriptionHtml": "[b]Info od tłumacza[/b]\r<br />Mod &#34;[b]Convenient Horse Herding v1_1 PL[/b]&#34; jest w pełni działającym spolszczonym oryginalnym modem &#34;Convenient Horse Herding v1_1&#34;, dzięki temu do poprawnej pracy nie wymaga instalacji oryginalnego moda.\r<br />Dla uatrakcyjnienia zabawy polecam zainstalowanie wcześniej modułu [url=http://www.nexusmods.com/skyrim/mods/48755/?]&#34;Convenient Horses v4_9 Polish&#34; lub wyższej[/url].\r<br />\r<br />[b]INFORMACJE[/b]\r<br />\r<br />- Łatwe zarządzanie stadem złożonym do 30 koni.\r<br />- Zmiana nazwy zebranych koni i nadanie im dowolnych nazw.\r<br />- Ustawienie pastwiska w każdym miejscu Skyrim, aby zgromadzić wszystkie konie w jednym miejscu.\r<br />- Zostań zarządcą stada i posiadaj wszystkie podróżne konie w jednym miejscu.\r<br />- Szybka podróż z powrotem do obozu poprzez dynamiczne markery na mapie.\r<br />- Kolejne konie otrzymują unikalną nazwę automatycznie po przyłączeniu do stada.\r<br />- Zakup do 3 psów pasterskich w celu ochrony stada.\r<br />- Pełna integracja z modem [url=http://www.nexusmods.com/skyrim/mods/48755/?]&#34;Convenient Horses Polish[/url].\r<br />\r<br />[b]O czym musisz wiedzieć[/b]\r<br />\r<br />Minimalne wymagania:\r<br />[b]Skyrim v1.8.151.0.7 +  Skyrim Script Extender ( SKSE ) v1.6.5 +[/b] są wymagane do uruchomienia tego moda.\r<br />\r<br />Ten mod nieodwracalnie kasuje nazwy zakupionych koni, gdy są one dodawane do stada. Wszystkie konie o nazwie &#34;koń (nazwa gracza)&#34; otrzymają swoje nazwy zmienione na &#34;(nazwa konia)&#34;,  które utrzymują się nawet po odinstalowaniu modułu. Reset Nazwy jest wymagany w celu umożliwienia używania nazw niestandardowych koni.\r<br />\r<br />Jeśli używasz wersji nieanglojęzycznych koni Skyrim nie będą nadawane losowe nazwy, ale ich nazwa zresetuje się. Nadal można je zmienić.\r<br />\r<br />Sprzęt pasterski został opracowany jako integralna część modułu &#34;Convenient horses&#34; lecz postanowiłem go użyć oddzielnie ze względu na wymogi SKSE i konieczności zresetowania nazw zakupionych kon.\r<br />\r<br />\r<br />[b]Pierwsze kroki[/b]\r<br />\r<br />Instalacja\r<br />1. Zaktualizować Skyrim do wersji minimum 1.8.151.0.7.\r<br />2. Zainstalować lub zaktualizować SKSE do wersji 1.6.5 lub wyższej.\r<br />3. Możesz teraz pobrać i zainstalować mod.\r<br />\r<br />[b]Odinstalowanie[/b]\r<br />1. Otwórz konsolę (znak tyldy w grze ~)i wpisz:\r<br />\r<br />StopQuest CHHerding\r<br />\r<br />2. Zapisz grę.\r<br />3. Odinstaluj mod.\r<br />\r<br />\r<br />[b]Uruchamianie[/b]\r<br />Aby jak najszybciej móc korzystać z gry modem konie używane przez gracza zostaną dodane do stada jako pierwsze. Aby dodać inne konie po prostu użyj je do jazdy. Jeśli koń nie posiada unikalnej nazwy, będzie mieć losową, którą można później zmienić. Oprócz unikalnej nazwy nic innego się nie zmieni, dopóki nie kupisz sprzętu pasterskiego dostepnego u dowolnego sprzedawcy koni.\r<br />\r<br />\r<br />[b]Zmiany fabularne[/b]\r<br />\r<br />[b]Sprzęt pasterski[/b]\r<br />Po zakupie &#34;Pełnego wyposażenia pasterskiego&#34; (plecak z flagą) będziesz w niego wyposażony automatycznie, a wszystkie twoje konie będą mogły podróżować z tobą. Twój udźwig zostanie zwiększony o 100 punktów podczas noszenia tego sprzętu. Teraz jest najlepszy moment, aby zdecydować, gdzie należy ustanowić pastwisko, czy poza swoim majątkiem czy gdzieś w dziczy. \r<br />\r<br />Pamiętaj, że możesz ustawić obóz tylko w głównej strefie gry (aka Tamriel). Aby oznaczyć miejsce pastwiska po prostu rzuć sprzęt &#34;Pełne wyposażenie pasterskie&#34;. Jeżeli wszystkie warunki są spełnione, Twoim oczom ukaże się flaga pastwiska umieszczona przed tobą, zaś plecak zwrócony jako &#34;Podstawowe wyposażenie pasterskie&#34; (plecak bez flagi), co pozwala na utrzymanie premii do udźwigu. Jeśli nie zostanie oznaczone miejsce pastwiska i nie będziesz posiadał w ekwipunku obiektu &#34;Podstawowe wyposażenie pasterskie&#34; po prostu poczekaj w bieżącej lokalizacji, a jeśli przechowujesz swój sprzęt pasterski gdzie indziej wszystkie konie będą podróżować do ich oryginalnych lokalizacji początkowych.\r<br />\r<br />[b]Flaga pastwiska[/b]\r<br />Oznacz pastwisko flagą, w miejscu w którym będą&#34;zebrane wszystkie twoje konie. Flaga zostanie wyświetlona na mapie jako znacznik i można wykorzystać ją do &#34;szybkiej podróży&#34;. Po użyciu widocznej flagi będziesz miał dostęp do podręcznego menu, w którym można zmienić nazwę lub usunąć swoje konie. \r<br />\r<br />Można również zabrać flagę i przewieźć ją w inne miejsce.\r<br />\r<br />[b]Zmiana nazwy konia[/b]\r<br />Można rozpocząć procedurę zmiany nazwy konia poprzez menu Flagi. Wszystko odbywa się za pośrednictwem systemu dialogu, więc nie trzeba nawet korzystać z klawiatury. Dialog wyboru konia pojawi się pierwszy jeśli posiadasz tylko jednego konia. \r<br />\r<br />Gdy posiadasz ich więcej, będziesz musiał zdecydować którego konia pragniesz zmienić nazwę. Po wybraniu konia nowy dialog ukaże, w jaki sposób można zmienić nową nazwę, minimum 3 znaki, maksymalnie 40 znaków. Skonstruuj swoją nazwę z kolejnych liter i zaakceptuj po zakończeniu. Należy pamiętać, że gra nie nie rozróżnia wielkości liter w ciągu z powodu buforowania nazw, więc musiałem użyć kilku sztuczek, aby to zmienić dlatego pierwsze litery nazw będą zmieniane automatycznie na duże litery. Zwróć uwagę, aby przed przyjęciem wymyślonej przez Ciebie nazwy, choć to rzadko się zdarza, że jest to ciąg znaków z pamięci podręcznej, której pierwsza litera jest ignorowana i jeśli ciąg ten jest już zarezerwowany dla innego obektu będziesz musiał użyć innej nazwy.\r<br />\r<br />[b]Odesłanie konia[/b]\r<br />Funkcja dostępna również za pośrednictwem menu Flagi. Wybierz konia, który ma zostać usunięty ze stada. Nie można usunąć konia, którego jeździłeś ostatnio, gdyż będzie on i tak automatycznie dodany do tak stada.\r<br />\r<br />[b]Psy pasterskie[/b]\r<br />Możesz kupić do 3 psów u każdego handlarza końmi. Ich jedynym celem jest ochrona stada przed zagrożeniami i nie powinny one pomóc w walce graczowi. Psy Starają trzymać się blisko stada, losowo krążą między końmi i patrolują teren by chronić Twoje konie. Po zakupie każdego konia  i przyłączeniu do stadzie otrzyma on 3% premii do regeneracji zdrowia oraz możliwość ucieczki od zagrożenia. Jedynym wyjątkiem jest aktualny koń, na którym obecnie jeździsz, który nie otrzymuje żadnych bonusów i nie będze mieć wpływu na zachowanie stada. By to zmienić należy użyć mod &#34;Convenient Horses&#34; lub inny mod kontroli koni obsługującego aktualnie używanego przez gracza konia.\r<br />\r<br />[b]Utrata Sprzętu Pasterskiego[/b]\r<br />Jeśli zgubisz lub zagubisz swój ekwipunek można porozmawiać z którymkolwiek handlarzem końmi by łatwo go odzyskać. Jeśli sprzęt jest na stałe utracony w grze lub zniszczony trzeba będzie ponownie uruchomić zadanie za pomocą konsoli ( [b]StopQuest CHHerding[/b] ), a następnie ( [b]StartQuest CHHerding[/b] ) .\r<br />\r<br />[b]Integracja z modem Convenient Horse[/b]\r<br />Przywołanie i jazda konna nigdy nie było jeszcze tak proste. \r<br />Jeśli używasz mod &#34;Convenient Horse v4.5&#34; lub wyższą poczujesz moc połączonych modułów obsługi koni podczas skradania się oraz będziesz w stanie przywołać każdego konia ze stada poprzez jego nazwę.\r<br />\r<br />\r<br />[b]zgodność[/b]\r<br />\r<br />- Mod modyfikuje quest &#34;stajnie&#34; umożliwiający zmianę nazw koni resetując go. Jeżeli którykolwiek z modów modyfikuje ten sam quest, nazwy zakupionych koni nie możesz zmienić, musisz umieścić taki mod umieścić na liście wczytywanych modów przed &#34;Convenient Horses Herding&#34;.\r<br />\r<br />- Konie z dodatku Hearthfire nie mają możliwości zmiany nazw, gdyż dodatek ten nie używa questu &#34;Stajnia&#34; by zmienić ich nazewnictwo.\r<br />\r<br />- Mod działa ze wszystkimi modami wykorzystującymi system vanilla, również niestandardowe konie z innych modów, z wyjątkiem wyczarowanyc koni ( Blaze działa jako wykorzystanie niestandardowej mechaniki przyzwania).\r<br />\r<br />- Przeznaczony do stosowania z modem Convenient Horses.\r<br />\r<br />\r<br />[b]Podziękowania[/b]\r<br />Lorelai - za wielkie wsparcie i stworzenie nazewnictwa kolekcji koni.\r<br />\r<br />\r<br />[b]Zmiany (wersja oryginalna)[/b]\r<br />\r<br />[b]V1.1:[/b]\r<br />- Greatly reduced the chance of having duplicate random names assigned when horse is being herded.\r<br />- Horses will now walk while traveling to the flag instead of running.\r<br />- Fixed bug with herded horses sometimes running their default AI packages causing them to leave horse camp.\r<br />- Fixed bug causing herded horses to be dismissed during name update on game load.\r<br />- Fixed bug where health regeneration bonus would increase past the intended values if horse is in combat and where only first 5 horses would receive it.\r<br />\r<br />[b]V1.0.1:[/b]\r<br />- Fixed CTD when dropping equipment due to corrupted BSA package.\r<br />\r<br />[b]V1.0:[/b]\r<br />- Initial release.",
  "categoryId": "83",
  "version": "1.1",
  "author": "PC_Maniac",
  "createdUnix": "1386872346",
  "updatedUnix": "1386871848",
  "containsAdultContent": false,
  "uploadedBy": "pcmaniac1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086466",
      "name": "Convenient Horse Herding PL",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2569",
      "fileName": "Convenient Horse Herding Polish-48752-.zip",
      "uploadedUnix": "1386871848",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d859ec27230151499c8e4de3b863ea4039c08bef07f27fd425b7c8bb3f110bba/analysis/1407833013/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horse%20Herding%20Polish-48752-.zip?fid=1000086466&ttl=1535829119&ri=8192&rs=8192&setec=40d7e78cefaa1369383e2e7003963314"
    }
  ]
}