{
  "modId": 4876.0,
  "modName": "Bow Engine Redone -Idea-",
  "summary": "This is an idea I have for when the CK comes out to redo the bow engine for the game. I have absolutely no modding experience whatsover, and I\\'m hoping some of you fantastic modders out there could have a look at my idea and discuss with me some ways it can come about.",
  "descriptionHtml": "[center][size=32]Bow Engine Redone[/size][/center]\r\nI am an archer in real life, and yes, it\\'s not that big of a deal. But Archery, in turn, has a lot of elements going for it rather than simply pulling back a string and firing an arrow. I have no modding experience whatsoever, and I do not know how to mod at all. I want to make it my goal to pitch off an idea to a great modder on this here Nexus and come up with a plan to redo the bow engine for the game when the [b]Creation Kit[/b] comes out.\r\n\r\n[size=3][b]Goal:[/b][/size]\r\nTo heighten the level of immersion for archers in and out of game.\r\n\r\n[u][b]Outline:[/b][/u]\r\n\r\n[b]Poundage:[/b] the amount of poundage in a bow determines the amount of stamina used, how fast the arrow goes, how much damage is done, and how far the arrow goes. Remember, poundage is how many pounds of force it takes to pull back the string, in turn, this relates to how much stamina is consumed.\r\n- higher poundage bows will coincide with the archery skill level.\r\n- any bow can be used at any level, but stamina can rapidly drain as a consequence.\r\n\r\nNovice: 20lbs - 30lbs\r\nApprentice: 32lbs - 48lbs\r\nAdept: 50lbs - 68lbs\r\nExpert: 70lbs - 85lbs\r\nMaster: 88lbs - 110lbs + (120lbs, 130lbs, 140lbs, 150lbs)\r\n\r\n[b]Accuracy:[/b] the higher the poundage, the more accurate the bow. However, at any skill level you can use any bow. But, if you have level 25 Archery and you go to use a Master 110lb bow, your stamina will automatically be sucked dry and you won\\'t be able to fire (trust me, I can\\'t even pull a 60lb bow in real life). With the same circumstance you use an Adept bow, your stamina will drain (not as quick) and you chance staggering yourself after firing and perhaps losing some accuracy if your stamina is low enough, but you can still fire.\r\n- given a real circumstance, a low poundage bow will yield a shorter length of shot, less power, and less accuracy.\r\n\r\n[b]Stamina:[/b] like I said before with the previous circumstance, if you\\'re a low level and decide to shoot a Master bow, good luck, because it won\\'t work. Now, if you\\'re a higher level, let\\'s say level 60 Adept Archer, you\\'ll be able to fire all bows lower than you, and most Master bows, but you chance staggering and losing all your stamina in the end. Stamina could possibly work in this way.\r\nGiven that you\\'re a level 60 Adept Archer, stamina reduces in the following:\r\n\r\nNovice: 20lbs - 30lbs (- 0stam)\r\nApprentice: 32lbs - 48lbs (- 0stam)\r\nAdept: 50lbs - 68lbs (- 0stam, - 8stam/sec)\r\nExpert: 70lbs - 85lbs (- 10stam/sec, - 25stam/sec)\r\nMaster: 88lbs - 110lbs + (120lbs, 130lbs, 140lbs, 150lbs) \r\n(- 28stam/sec, - 50stam/sec, - 60stam/sec, - 70stam/sec, - 80stam/sec, - 90stam/sec, - 100stam/sec)\r\n\r\n[b]Damage:[/b] damage is dependant on your skill level, the poundage of the bow, and how much stamina you have in order to fire that bow at full draw. Also, your arrows will affect how much damage is delt to your unsuspecting foes.\r\n- consider any bonuses that can also be added to up your damage level. The numbers plugged in below are only outlines of what can be tweaked and embellished.\r\n\r\nNovice: 20lbs - 30lbs (20 - 25 dmg)\r\nApprentice: 32lbs - 48lbs (26 - 34 dmg)\r\nAdept: 50lbs - 68lbs (36 - 40 dmg)\r\nExpert: 70lbs - 85lbs (42 - 48 dmg)\r\nMaster: 88lbs - 110lbs + (120lbs, 130lbs, 140lbs, 150lbs) (50 - 70 dmg, 75dmg, 85dmg, 95dmg, 105dmg)\r\n\r\n[b]Arrows:[/b] these guys can be your best friend or your worst enemy in reality. Arrows have certain strengths, and these strengths are called the \\\"spine\\\" of the arrow. In reality, if you use a 20lbs spined arrow on an 80lbs bow, the arrow is going to shatter on release of the string and imbed itself deep into your forearm (don\\'t believe me, go to google and type in \\\"splintered arrow accident\\\"). This has never happened to me, and I remain thankful of that, because I use to specified arrow spine on my bow. Perhaps it could be made so if you use a 50lbs spined arrow on a 100lbs bow, you\\'ll risk breaking the arrow and hurting yourself by some meager 20 points of health.\r\n- arrows can have specific spines (it\\'s all dependant on the arrow)\r\n- there could be 50lbs spined Iron arrows, and 100lbs spined Iron arrows.\r\n\r\n",
  "categoryId": "78",
  "version": "",
  "author": "Hectoris",
  "createdUnix": "1325196783",
  "updatedUnix": "1325200095",
  "containsAdultContent": false,
  "uploadedBy": "Hectoris",
  "primaryFile": null,
  "files": [
    {
      "fileId": "14945",
      "name": "Readme",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Readme-4876-1.zip",
      "uploadedUnix": "1325200095",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d1cb48942cf0303a5be92caa812cdd87b51eb99137fb7b975728298dd8af3722/analysis/1406568964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Readme-4876-1.zip?fid=14945&ttl=1535761153&ri=8192&rs=8192&setec=adf80526b18cc9ab82317f60e0a99658"
    }
  ]
}