{
  "modId": 48783.0,
  "modName": "Fixed level - DELETED",
  "summary": "Fixes your level and world level.",
  "descriptionHtml": "[b]DESCRIPTION[/b]:\r<br />It may sound crazy but i don&#39;t like the concept of player level. So this mod fixes your and world levels at some value. You will no longer gain any experience or level up. Of course your overall strength is not fixed: you can still raise your skills, invest in perks and attribute points. What does it give?\r<br />\r<br />1. Level and statistics of all NPCs is fixed at a given value. Most bosses have 50+ level and are almost impossible to kill in early game stages. Honestly in the beginning even regular bandits will be hard to kill.\r<br />2. Items of of all levels are available from the start, but it doesn&#39;t make the early game easier. Higher level armors and weapons are expensive and rare so don&#39;t count on them in the beginning of your playthrough. Even though no longer limited by level, your capabilities are determined by the gold you&#39;ve gathered.\r<br />3. You can train your skills as many times as you want, but bear in mind that it will take time to get enough money to pay for it.\r<br />4. You can&#39;t get more perk points and attribute points than your level, which is now constant. If you choose a value fixed at 90 (recommended), max number of perk points will be 90. Current number of perk points is based on overall progress in all skills. For example, you will gain 50% of all perk points when your average skill level will be 50. All perk points are granted for reaching 100 in all skills.\r<br />\r<br />So you are a weak child among the strong foes. What to do? How to survive?\r<br />First you can try to gather gold for good equipment and skill lessons. How? I dont know :) Sell potions, try your hand at thievery, plunder or something...\r<br />\r<br />[b]INSTALLATION AND USAGE:[/b]\r<br />1. Unpack the mod to the Data folder. In addition to fixing your level standard version also reduces skill increases. If you&#39;re satisfied with the vanilla skill increase rate, use Fast version.\r<br />2. It is recommended to start a new game, but not necessary, if player&#39;s leveling wasn&#39;t affected by other mods.\r<br />3. [u]IMPORTANT:[/u] Unfortunately mods are not allowed to change player&#39;s level, so you need to set it manually via the console. Command is: [u]player.setlevel 90[/u] (90 is recommended, but you can specify any another. Set your level after character creation or later).\r<br />4. If you have progressed your skills far enough, you will get some perk points and attribute points. It means you will be able to unlock some perks after making enough progress in any skill.\r<br />\r<br />[b]SION&#39;S CODE:[/b]\r<br />All my mods/programs are safe to try and safe to delete at any moment. Vanilla records are changed only if there is no other way. Maximum performance and compatibility.\r<br />",
  "categoryId": "73",
  "version": "0.1",
  "author": "Sion",
  "createdUnix": "1386952146",
  "updatedUnix": "1386952132",
  "containsAdultContent": false,
  "uploadedBy": "Sion4",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086607",
      "name": "Fixed level",
      "version": "0.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "9",
      "fileName": "Fixed level-48783-0-1.zip",
      "uploadedUnix": "1386952041",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/0e61c1175331fd349852941885c100866a96a0bcfb2d91cdf0ca8f49e8cac83f/analysis/1407834910/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fixed%20level-48783-0-1.zip?fid=1000086607&ttl=1535829168&ri=8192&rs=8192&setec=04cc8f60f7ca2f530cb55592a6d0ae9f"
    },
    {
      "fileId": "1000086608",
      "name": "Fixed level Fast",
      "version": "0.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "9",
      "fileName": "Fixed level Fast-48783-0-1.zip",
      "uploadedUnix": "1386952132",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/ece165d4c2e1c9c79966bababdee66fe1e110825b50c32a898ff382d48f3e979/analysis/1407835024/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fixed%20level%20Fast-48783-0-1.zip?fid=1000086608&ttl=1535829169&ri=8192&rs=8192&setec=13e56eaad5978cbaee9f69e9d5fe8ba0"
    }
  ]
}