{
  "modId": 48781.0,
  "modName": "Sleeping Tree Sanctuary - Improved Crafting Addon",
  "summary": "Adds Dawnguard and Dragonborn support for Sleeping Tree Sanctuary&#39;s automatic item storage along with a few other improvements",
  "descriptionHtml": "[url=http://www.nexusmods.com/skyrim/mods/17289/?]Sleeping Tree Sanctuary[/url] is my favorite player home of all time. I especially like it for the automatic crafting storage, which in the original version only worked with vanilla Skyrim ingredients. With this patch, the alchemy station will now recognize all ingredients from Dawnguard and Dragonborn, and the smithing chest will now recognize stalhrim and firewood (for arrow crafting). I&#39;ve also made it so that your smithing supplies will be accessed while you&#39;re using both the grindstone and armor bench. Previously it only worked with the anvil.\r<br />\r<br />Note: I&#39;ve noticed a bug with the alchemy station where sometimes it will not automatically return the DLC ingredients to the shelf if you&#39;ve crafted a lot of potions in that session. I&#39;m not sure what causes this, but if you just activate the actual shelf afterwards and tell it to store your ingredients it will take them out of your inventory normally.\r<br />\r<br />As a bonus, if you&#39;ve done the secret &#34;scavenger hunt&#34; quest to get the overcharged power core, I&#39;ve increased the time it stays overcharged to 7 days instead of the original 2 days.\r<br />\r<br />Obviously you need to have the final version of Sleeping Tree Sanctuary as well as Dawnguard and Dragonborn all installed in order to use this file.\r<br />\r<br />Enjoy and let me know if there are any crafting supplies from Dawnguard or Dragonborn I missed, and I will try to add them in an update.",
  "categoryId": "67",
  "version": "1.0",
  "author": "Gilgamesh",
  "createdUnix": "1386947891",
  "updatedUnix": "1386947365",
  "containsAdultContent": false,
  "uploadedBy": "guerillamoderno",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086603",
      "name": "STS Crafting Addon",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "STS Crafting Addon-48781-1-0.zip",
      "uploadedUnix": "1386947365",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/99e60e59568cb80495789f45d73e8710fe5837ab2bff32a0c5d618c34185876b/analysis/1407834853/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/STS%20Crafting%20Addon-48781-1-0.zip?fid=1000086603&ttl=1535829166&ri=8192&rs=8192&setec=48f82356d64d1604f9c60e3d88e624a1"
    }
  ]
}