{
  "modId": 4879.0,
  "modName": "FF style Jobs -- ALPHA",
  "summary": "a few .txt files to use with the Bat command for Rp-ers",
  "descriptionHtml": "ESP\r\n--------------------------------------------------------------\r\nThe included ESP is an Alpha Version of what\\'s to come!\r\n\r\nIt includes 3 perks added to the two-handed skill tree, we are still ironing out the details on the Monk centered Perks, while balancing and building a proper tree off of Two-Handed solely for them.\r\n\r\nWe are also trying to get Pet Dragons to behave the way we want. Right now they like to fly around for a few minutes before attacking hostiles.\r\n\r\nI am working on quests to implement gear for the classes and designing them, We will be doing a class at a time, please be patient, and I look forward to feedback, which will be forwarded to Koga_Ryu\r\n\r\n\r\n\r\nTXT Files\r\n----------------------------------------------------------------\r\nThese files only Alter your skills and magic if applicable! i feel that there is enough selection of gear during the Prelude to gear you for whichever you want to RP as\r\nThe Bat files use FFXIs builds and abbreviations, if you are unfamiliar what is what I will list them here!\r\n\r\nMonk (MNK) - Their fists are as precise and deadly as the sharpest of Deadric swords\r\n\r\nWhite Mage(WHM) - Solely a healer and buffer (If you RP this class, I would advise you to get a Companion!)\r\n\r\nBlack Mage(BLM)   - A hard core nuker (if you use this class base, You should really look into a Destruction magic mod!)\r\n\r\nRed Mage(RDM)    - A jack of all trades, Master of none!\r\n\r\nWarrior(WAR)         - A frontline Fighter Able to dish out and take Damage\r\n\r\nPaladin(PLD)         - A warrior who has chosen the path of Light, Able to eat massive damage while keeping their allies alive\r\n\r\nDark Knight(DRK)  - A warrior who has chosen the path of Darkness, Able to dish out massive damage while turning tides with Destruction Magic\r\n\r\nSummoner(SMN)   - A master of the forbidden arts of Summoning Magic(Conjuration)\r\n\r\nRanger(RNG)        - The wood their home, Their bow their ally and brother dishes out damage from afar\r\n\r\nThief(THF)            - I think the name is self-explanatory\r\n\r\nNinja(NIN)             - An eastern assassin, Like a Thief with Illusion magic\r\n\r\nScholar(SCH)        - Pretty much your \\\"Mixed Mage\\\" allthough physically weak\r\n\r\nBerserker(BRS)     - A warrior on steroids, Less stamina only 10 magicka, Alot of health\r\n\r\nInstallation\r\n------------------------------------------------------------------\r\nPlace the batch files into your Skyrim Data Directory \r\n\r\n\r\nOperation\r\n-----------------------------------------------------------------\r\nOpen the console and type:\r\n\r\nbat FF<Abbreviated class name>\r\n\r\nExample bat FFWAR\r\n\r\nSide note: when using these files, race only affects your looks and racial powers & bonuses since the files jumble up your skills.\r\n",
  "categoryId": "73",
  "version": "0.01",
  "author": "Koga_Ryu-Nadezhda90",
  "createdUnix": "1325197772",
  "updatedUnix": "1329170344",
  "containsAdultContent": false,
  "uploadedBy": "Nadezhda90",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30612",
      "name": "Alpha",
      "version": ".01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Alpha-4879--01.zip",
      "uploadedUnix": "1329170344",
      "modVersion": ".01",
      "virusScanUrl": "https://www.virustotal.com/file/8071b5f6c0463f6a59f54e8ca970d77f9aa20c0017f6595788b23549f94c9614/analysis/1406679662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alpha-4879--01.zip?fid=30612&ttl=1535761159&ri=8192&rs=8192&setec=63e14bf9a1518c9442fc2efbe22626fd"
    }
  ]
}