{
  "modId": 48798.0,
  "modName": "Vocal Mehrunes Razor",
  "summary": "It appears that Mehrunes Dagon likes to play with dice, and as any gambling daedra lord would, he can get a bit excitable. Vocal Mehrunes Razor (VMR) allows Dagon to share this excitement with his champion by commenting on the kills you perform with his Razor. ",
  "descriptionHtml": "Vocal Mehrunes&#39; Razor v1.0 by arunsundibob\r<br />http://www.nexusmods.com/skyrim/mods/48798/?\r<br />\r<br />---------------------------\r<br />Description\r<br />---------------------------\r<br />It appears that Mehrunes Dagon likes to play with dice, and as any gambling daedra lord would, he can get a bit excitable. Vocal Mehrunes&#39; Razor (VMR) allows Dagon to share this excitement with his champion by commenting on the kills you perform with his Razor. As the killing of mortals is not exactly something new to him, he&#39;ll usually just chuckle a little, but catch him in the right mood and you&#39;ll find him somewhat more expressive...\r<br />\r<br />[center]BEFORE WATCHING: \r<br />This mod DOES NOT make the comments happen after every kill&#33;\r<br />Comments occur 50 TIMES LESS OFTEN than the video&#33;\r<br />[youtube]eWHjHMAIaQ0[/youtube][/center]\r<br />\r<br />---------------------------\r<br />Purpose and Functionality\r<br />---------------------------\r<br />VMR allows for the player to know when a kill was made due to to the Razor&#39;s enchantment without being as immersion breaking as a message at the top of the screen. It also brings some life into the weapon itself.\r<br />\r<br />The appearance and functionality of Mehrunes&#39; Razor is exactly the same as it was in the vanilla version. This means that the 1.98% chance of killing a target has not changed. This mod only adds the sounds that will occur when a target is killed by Mehrunes&#39; Razor&#39;s enchantment.\r<br />\r<br />There are 9 possible lines for Dagon to say and their probability of being said are\r<br />\r<br />80% for the laugh\r<br />2.5% each for the other 8  (total 20%)\r<br />\r<br />This should make Dagon&#39;s remarks seem less repetitive and intrusive.\r<br />\r<br />---------------------------\r<br />Installation\r<br />---------------------------\r<br />The mod is BAIN-ready for those who use Wrye-Smash, but if you prefer to install it manually, simply copy everything into your Skyrim data folder.\r<br />\r<br />---------------------------\r<br />Compatibility\r<br />---------------------------\r<br />This mod only changes the entry for the &#34;magic effect&#34; of mehrunes&#39; razor. This means that if a mod does not change this magic effect it will probably work. Similarly, if a mod changes the actual weapon or enchantment but they still refer to the vanilla magic effect this mod should still work.\r<br />\r<br />---------------------------\r<br />Feedback\r<br />---------------------------\r<br />As my first mod, this was more of an exercise to become familiar with Papyrus before I make another mod that I&#39;ve been conceptualizing but I still intend to tweak with this one to get the sounds/probabilities just right. Please post on the nexus page to let me know what works and how i could improve things&#33;\r<br />\r<br />---------------------------\r<br />Permissions\r<br />---------------------------\r<br />IF you wish to use this mod or any of its components in a mod of your own all you need to do is notify me about how you plan to use it and give credit where it is due (ie. in the readme and nexus description). If you fulfill those TWO things you have my permission.",
  "categoryId": "55",
  "version": "1.0",
  "author": "arunsundibob",
  "createdUnix": "1386984651",
  "updatedUnix": "1386984560",
  "containsAdultContent": false,
  "uploadedBy": "arunsundibob",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086665",
      "name": "Vocal Mehrunes Razor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3126",
      "fileName": "Vocal Mehrunes Razor-48798-1-0.rar",
      "uploadedUnix": "1386984560",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ff1ae8532c8dc4a962a67f4990ecebda941cf93ff8f9e0730a1954d71c5f1bf7/analysis/1407835936/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vocal%20Mehrunes%20Razor-48798-1-0.rar?fid=1000086665&ttl=1535829190&ri=8192&rs=8192&setec=6c88ba497691a85a3fa64fd91ac96551"
    }
  ]
}