{
  "modId": 48805.0,
  "modName": "HighHrothgar Shelter",
  "summary": "This mod adds a small cabin half way up the mountain path to the Monastery, aimed at players using Frostfall by Chesko. A classic mountain rescue shelter.",
  "descriptionHtml": "[color=#f1c232][size=6]Kursan Presents:   HighHrothgar Shelter  \r<br />\r<br />[/size][/color]                                                                                    [img]http://i.imgur.com/VFlvwAI.png[/img]\r<br />\r<br />\r<br />[color=#00ff00][size=3]This mod places a small shelter or cabin along the path about half way up to \r<br />&#34;the throat of the World&#34; or HighHrothgar known by the locals as &#34;Trolls Rest&#34;.\r<br />I did this particularly for those players that use Frostfall by Chesko, as depending on your\r<br />characters race and setting of Frostfall, getting up to the top of the mountain can be a bit \r<br />of a challenge, especially in a blizzard.\r<br />\r<br />This mod offers a small cabin with very basic amenities, mainly shelter, heat and food. It is not intended as a player home although there is safe storage in a chest and you could set up there for awhile.\r<br />Besides a place to sleep and cook, there is also a tanning rack inside and a wood chopping block outside.\r<br />There are some food supplies in the cabin and a couple of books but not much else; it is sparse on purpose because it is supposed to be a realistic rugged mountain shelter. There is a wood chopping ax and a Pickax inside the cabin, in case you forgot yours :) [/size][/color]\r<br />\r<br />\r<br />[color=#ffff00]Special Notes:\r<br />There is one special item, a very useful Ring, if you can find it; read the note on the bedside table to get a hint for where to look. \r<br />The cabin is Navmeshed so it should work for followers and there are two beds.\r<br />The physics throw stuff sometimes when you enter and the note may not be where it should, but it is a small place so you should be able to find it.\r<br />\r<br />This mod also makes a small change with a big impact in another location; it adds a large cooking spit over the fire pit in Jorrvaskr the Companions hall. I felt that a place to cook was sorely lacking at Jorrvaskr, after all it is a feasting hall&#33;\r<br />This is such a small change I made for my own game that I did not want to create a separate esp to add to my long load order just for a single cooking spit, so I attached it to this small mod... I hope you will like it too.\r<br />\r<br />If you go up the mountain for the first time, you will have to deal with the Troll in the ravine before reaching the cabin; the cabin is located under the overhang within the ravine. You may be able to get in before the Troll and there are healing potions inside, but then you have to deal with it on the way out.\r<br />At night you can see the stars through the smoke hole in the roof, even though the cabin sits under an overhang, but that is a cosmetic detail that does not bother me, besides its romantic :)\r<br />[/color]\r<br />[color=#ffff00][size=3]I hope you enjoy the place and please endorse&#33;\r<br />\r<br />There is another version available (1.3) that adds another cabin at the top of High Hrothgar and also gives the Dovah a bed at the Monastery. You can link to that here:  [/size][/color][url=http://www.nexusmods.com/skyrim/mods/49076/?]http://www.nexusmods.com/skyrim/mods/49076/?[/url]\r<br />\r<br />[color=#00ffff]Installation:\r<br />Best to use the NMM button and activate in your load order; or for manual installation just drop the esp file into your Skyrim Data folder and make sure its box is ticked in your Load order menu.\r<br />\r<br />Conflicts:\r<br />\r<br />None I am aware of for the mountain location, so far I do not think there is other real estate in that part of the mountain.\r<br />As for the cooking spit in the companions hall, any mod that alters that hall is likely to conflict but  not necessarily, you just have to try it out. If you do not want the cooking spit then just delete it in the CK. Mod has been cleaned with TES5Edit.[/color]",
  "categoryId": "78",
  "version": "1.1",
  "author": "Kursan",
  "createdUnix": "1387000375",
  "updatedUnix": "1387000366",
  "containsAdultContent": false,
  "uploadedBy": "Kursan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086690",
      "name": "HighHrothgar Shelter - Trolls Rest",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "HighHrothgar Shelter - Trolls Rest-48805-1.zip",
      "uploadedUnix": "1387000366",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/048478b86f06e03475e4d9887574c939ce1fc1b352229cc35f33185d7f98f8a1/analysis/1407836230/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HighHrothgar%20Shelter%20-%20Trolls%20Rest-48805-1.zip?fid=1000086690&ttl=1535829199&ri=8192&rs=8192&setec=75ce03939793ca92d97fd5af33b07575"
    }
  ]
}