{
  "modId": 48823.0,
  "modName": "Improved Aetherial Staff",
  "summary": "Makes the Aetherial staff more useful by allowing it to summon Dwemer Centurions while still retaining its ability to occasionally fail and produce piles of scrap.",
  "descriptionHtml": "This is the second in a set of mods designed to power up some of the more useless unique items and quest rewards in both skyrim and its expansions. See Better Red Eagle&#39;s Bane for the first mod in the set which focuses on the reward for &#34;The Legend of Red Eagle&#34;.\r<br />\r<br />--Description--\r<br />The quest &#34;Lost to the Ages&#34; is quite unique in that it lets you pick your own reward. You are free to choose the item that best fits your character, however there is a problem. Namely that while the crown is extremely powerful and useful for almost any character, and the shield is useful in certain situations, the staff is overshadowed in almost every way by most conjuration staffs that you find in normal loot. I have attempted to correct this problem by changing the behavior of the staff as listed below.\r<br />\r<br />Vanilla:\r<br />Summons a Dwarven Spider or Dwarven Sphere for 60 seconds, or rarely creates a pile of scrap. Has enough charge for about 13 uses before recharging.\r<br />\r<br />Mod:\r<br />Summons a Dwarven Centurion for 60 seconds, or rarely creates a pile of scrap. Has enough charge for 25 uses before recharging.\r<br />\r<br />I believe that this mod should make the choice of which reward to take a bit more difficult while keeping it balanced as compared to high level conjuration spells and the other aetherial items. The staff retains the unique visuals when summoning dwemer machines that differs from normal conjuration spells. This mod requires the dawnguard expansion to function.\r<br />\r<br />--Make sure to comment if something seems broken or even if the mod is working correctly, feedback is useful",
  "categoryId": "55",
  "version": "1.0",
  "author": "Lordcynic",
  "createdUnix": "1387051251",
  "updatedUnix": "1387051245",
  "containsAdultContent": false,
  "uploadedBy": "Lordcynic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086766",
      "name": "Improved Aetherial Staff",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Improved Aetherial Staff-48823-1-0.zip",
      "uploadedUnix": "1387051245",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8b00c69870bc2c421ac92202f07ad6a341a3eb7d77cf6607051ebb6f1159b0c6/analysis/1407839232/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Aetherial%20Staff-48823-1-0.zip?fid=1000086766&ttl=1535829223&ri=8192&rs=8192&setec=4c5f26b7acfd6c554f82c685ddb9716a"
    }
  ]
}