{
  "modId": 48852.0,
  "modName": "Nthardom",
  "summary": "A new Dwemer Dungeon with two unique rewards, and one Towering Boss.",
  "descriptionHtml": "-------What is it?-------\r<br />If I were to sum up this dungeon in a sentence, I&#39;d say: Short, difficult, and most definitely worth it.\r<br />Nthardom is a small Dwemer ruin quite near Raldbthar. Filled with more than a few automatons, it&#39;s a challenge for any hardy adventurer - it has the spoils for one too.\r<br />During your journey through the decrepit ruin, you&#39;ll encounter Nthardium - a huge machine that incinerates any fool that would get anywhere close to it - accompanied by two stout Centurions. This will be rather difficult, so come prepared and at the right level - 25 and upwards should be right as rain.\r<br />\r<br />-------Is There Anything Special in this Mod?-------\r<br />Why yes, yes there is.\r<br />2 things really, one spell, and one axe.\r<br />The Spell:\r<br />This will allow you to summon the legendary Nthardium, and have it fight any foe for you. You&#39;ll need a Conjuration level of 100 to cast it. Be warned: This can be very over-powered, especially with SkyRe installed. Max out your Conjuration and take the necessary perks, you&#39;ll be able to conjure 3 of the guys to aid you. Dragons are no match.\r<br />The Axe:\r<br />Nthardol&#39;s Axe, it is said to have been owned by the Dwemer Nthardol himself - right before all the Dwarves disappeared. Isn&#39;t that a coincidence? Anyway, the axe has a few powerful enchantments that someone like you could take advantage of.\r<br /> \r<br />-------INSTALLATION-------\r<br />It&#39;s so very simple. Throw the .esp file into your Data file, or just use the Nexus Mod Manager - it&#39;s your choice.\r<br />\r<br />-------Bugs...?-------\r<br />Don&#39;t worry, no bugs here. But, on the off chance you do encounter any, message me of what you have found and I&#39;ll investigate - it will be... fun.\r<br />\r<br />-------Is it Lore-Friendly?-------\r<br />Maybe. That&#39;s for you to decide.\r<br />\r<br />As always, have fun.\r<br />PorkiousMaximus",
  "categoryId": "88",
  "version": "v1.0",
  "author": "PorkiousMaximus",
  "createdUnix": "1387125262",
  "updatedUnix": "1387125103",
  "containsAdultContent": false,
  "uploadedBy": "PorkiousMaximus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086890",
      "name": "Nthardom",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "77",
      "fileName": "Nthardom-48852-v1-0.rar",
      "uploadedUnix": "1387125103",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c313233fe49e8e6b86e9889e658865eead8b26d3200896b2b1d6329bef1695c1/analysis/1407843553/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nthardom-48852-v1-0.rar?fid=1000086890&ttl=1535829280&ri=8192&rs=8192&setec=2a020602638a5e86d5ede1493ff7c307"
    }
  ]
}