{
  "modId": 48850.0,
  "modName": "Mini Quest - Pelagius Wing Player Home",
  "summary": "Become the rightful owner of the Pelagius Wing in Solitude&#33;",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img]\r<br />[/url][/center][center][img]http://i.imgur.com/aExUAta.png[/img][/center]\r<br />\r<br />\r<br />Have you ever wished you could live in the Blue Palace? Do you wish you could claim ownership of the abandoned Pelagius Wing? Then you&#39;re in luck&#33; \r<br />\r<br />This started as a simple plan to restore the Pelagius Wing, but as always I allowed myself to go overboard... And after almost a week of work, here we are. I know it may sound like a lot of time for something some people may think is not even that grand, but I&#39;m not very good at dungeon building, I guess.\r<br />\r<br />Featuring an amusing short quest (possibly) and a nifty new dungeon (allegedly), this mod will require you to pit your brains (probably) and your brawn (presumably) to crack the riddle that will lead to an amazing reward (hopefully).\r<br />\r<br />I know I&#39;m not showing pictures of the quest itself, and it must be weird starting by showing you the final reward. To be honest, at this point I feel the whole adventure is more satisfying than the house&#33;\r<br />\r<br />The file has been cleaned with TES5EDIT, does not require any DLC, and has no scripts, so it should be safe for everybody to use. Still, you should always make a backup save before installing ANY mod, in case something goes wrong.\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/UMTptSI.png[/img][/center]\r<br />As you may have figured out already, the main objective of this mod is to rebuild the Pelagius Wing of the Blue Palace in Solitude, turning it into a suitable player home. \r<br />\r<br />Despite the fact that the Pelagius Wing is a quest location, you don&#39;t need to have completed [url=http://www.uesp.net/wiki/Skyrim:The_Mind_of_Madness]The Mind of Madness[/url] to install my mod. As I did with some other quest-related locations turned into homes in my previous mods, all the quest markers have been left intact and the door simply leads to a duplicate cell, to avoid causing issues. I left some of the important loot, including a Lockpicking skill book, around so you don&#39;t miss out on anything important.\r<br /> \r<br />The house itself is not overpowered or anything of the sort. You have 3 floors; first one has the kitchen, library and master bedroom; second floor has dining area and display hallway, and the basement has the staff quarters. There&#39;s a cooking spit, a sharpening wheel and an anvil in the basement, alchemy and enchanting tables, shrines to Dibella, Kynareth and Julianos, a chopping block, and no other crafting stations. I will not put any more, so don&#39;t ask. You have a bunch of bookcases, as I love to collect books, a mannequin, and two simple display cases for your trophies. I also added an extra door in the Blue Palace courtyard, so you don&#39;t have to go through two loading screens to get in.\r<br />\r<br />I tried to give the restored Pelagius Wing a noble feel by using fine furniture, warm music and lighting, nice rugs and silver tableware. Many of the items around the dining area are static because I absolutely despise how you can sit at the table and cause everything to explode, so the food is basically just decoration in most cases. I apologize in advance.\r<br />\r<br />You will have some housekeeping personnel at your disposal, including two servants, a bard to entertain your meals, a barkeeper who will sell fresh food and drink, a cook, and two guards to keep the house safe. All of them have their own AI packages and routine. The guards are not set to be followers, as I wanted them to have the regular guard dialogue and apparel.\r<br />\r<br />The house is fully navmeshed and has several idle markers and furniture for NPCs to use. There are beds for all personnel, three extra beds for followers or guests, and plenty of safe storage. Everything [u]except for the sacks and barrels[/u] is set to never respawn, so make sure you don&#39;t store important items in sacks or barrels&#33;\r<br />\r<br />In general, I tried to put some not-too-invasive references to Oblivion and Daggerfall here and there, mostly in the text and rewards. I hope someone gets them...\r<br />\r<br />And, finally, is the dungeon&#39;s treasure room overdone, overpowered, and with way too much gold? You betcha&#33; Most of the containers will not respawn, so it&#39;s not like it&#39;s an endless source of wealth. If you do not like this, feel free to just breeze by and ignore all the shiny stuff. Works like a charm.\r<br />\r<br />You can find a Japanese translation of the mod [url=http://skyrim.2game.info/detail.php?id=48850]here[/url].\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/4eUh3wV.png[/img][/center]\r<br />\r<br />If you find yourself stumped and have no idea of where things are, check the readme tab for instructions to get all the items. SPOILERS BE THERE&#33; And make sure you look around carefully as you explore the new area, as the quest relies on notes to guide the player and they may be easy to miss. Besides, you don&#39;t wanna miss out on all of the sweet loot, do you?\r<br />\r<br />As I am an absolutely nooby noob in the Creation Kit - and I really dislike the baby-proof easy-peasy quest system in Skyrim - this quest does not have quest markers or journal entries. You&#39;ll have to rely on Sheogorath&#39;s riddle to complete it. I&#39;d recommend trying to visit the locations in the order they are written, but it&#39;s not really mandatory.\r<br />\r<br />To get started, look for a brightly-colored carved chest jammed somewhere around the prow of the [url=http://www.uesp.net/wiki/Skyrim:Red_Wave]Red Wave[/url], at the Solitude Docks. As it is stuck in there, you may have a bit of trouble opening it, but don&#39;t give up&#33; Your old pal Sheogorath wants you to become the owner of the Pelagius Wing, but he is not willing to make it easy - he wants to make it fun. Which may or may not be fun for you, too.\r<br />\r<br />Besides looking for the special items you need for the key, you can also collect the pages of an old book about Pelagius&#39; last days. Most of them are in the final location of your quest; you&#39;ll need to look very carefully to find them all. Bring them to a tanning rack to rebind them, and enjoy the tale&#33; \r<br />\r<br />As you can see, the fascinating rewards for your efforts are not limited to the house - you&#39;ll also get plenty of loot, an interesting book, and a nifty new weapon, among some other goodies&#33;\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/57JL2v6.png[/img][/center]\r<br />I don&#39;t think there could be many issues with compatibility with other mods, unless they make MASSIVE changes to places such as the Solitude Docks. I am personally using [url=http://steamcommunity.com/sharedfiles/filedetails/?id=124354800]Enhanced Cities: Docks of Solitude[/url] and [url=http://www.nexusmods.com/skyrim/mods/39453/?]Dustbound[/url] with no problems.\r<br />\r<br />In the final area, you may find yourself inside a room with a lot of baskets, so make sure to jump on top of them; otherwise you may get shoved off the map. If this happens, open the console and type [font=courier]  &#34;TCL&#34;  [/font] to disable player collision and get back into the map&#39;s boundaries.\r<br /> \r<br />For some reason, the Bard refuses to sleep. I&#39;ve checked and rechecked her AI packages, made sure the bed was unobstructed, and everything seems to be set correctly, but she still stays up playing all night long. If anybody is willing to help me with this, I&#39;d be thankful. The guards also have sleep outfits set but like to sleep wearing their armor, bless them.\r<br />\r<br />The final area of the quest is hard to navigate for followers. I navmeshed it carefully, but they may still get stuck in some areas. Feel free to shout them around if needed.\r<br />\r<br />Another strange thing is that the effects from the new meal tend to refuse to show up under Active Effects. As the effect is based on the one from the [url=http://www.uesp.net/wiki/Skyrim:Homecooked_Meal#Homecooked_Meal]Homecooked Meal[/url], there isn&#39;t much I can do about it, I&#39;m afraid.\r<br />\r<br />The new food model has a bit of a strange collision, and may float a bit above the ground or roll around. I&#39;ve tried to fix it, but I&#39;m not sure if it&#39;s really behaving as it should. In any case, it&#39;s meant to be eaten, not put on display&#33;\r<br />\r<br />The weapon displays are also a bit finicky, so you may have a bit of trouble retrieving your weapons once you place them, but it is possible - you&#39;ll probably just need to wiggle your crosshair around a bit until you catch the activator.\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/qDF63vZ.png[/img][/center]\r<br />Extract the contents of your downloaded file to your &#34;Steam/SteamApps/Common/Skyrim/Data&#34; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp. Or you can use the Mod Manager to download the mod automatically. \r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/PvsbIEV.png[/img][/center]\r<br />Simply delete the files with the name [font=courier]  &#34;PelagiusWing_PlayerHome&#34;  [/font] from your Data folder, and you&#39;re good to go. Although I worked on it so hard, why would you want to do that? ;_;\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/mP1grfa.png[/img][/center]\r<br />- [b]Dec 15, 2013[/b]: [i]Initial release.[/i]\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/v6jSb1z.png[/img][/center]\r<br />Special thanks go to my dearest [url=http://oddlyunadventurous.tumblr.com/]Zhivko[/url], who helped me with some textures with his amazing Photoshop skillz and dealt with me being engrossed in my work almost all day. And thanks also go to [url=http://www.nexusmods.com/skyrim/users/5650734/?]mrpdean[/url], who kindly helped me out with some issues with the weapon plaques. \r<br />\r<br />I used plenty of modder&#39;s resources from around the Nexus to furnish the interior cells I worked on:\r<br />\r<br />- [url=http://www.nexusmods.com/skyrim/mods/36756/?]Berts Bits And Bobs[/url] by berticus0001.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/39263/?]Bloodfalls[/url] by Tamira.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/14133/?]FoodContainer Resource[/url] by Blary.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/43143/?]FPI Experiment Pack 1[/url] by The Fuzzy Physics Institute.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/33392/?]Hanas Blank Roadsigns - Resource[/url] by Hanaisse.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/16525/?]Modders Resource Pack[/url] by Oaristys and Tony67.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/24883/?]Morrowind Style Clutter and More[/url] by The_Funktasm.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/46454/?]Noble Silver Cutlery[/url] by LilaMue.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/35351/?]Real Double Sided Animated Banner Models[/url] by baronf.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/26132/]Resources for modders[/url] by Runspect.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/42690/?]Strotis Kitchen Tools[/url] and [url=http://www.nexusmods.com/skyrim/mods/36969/?]Strotis Resource Pack[/url] by Stroti and Tamira.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/36703/?]Tueffels Misc Resources[/url] by Tueffel.\r<br />\r<br />And, finally, for textures I used here and there: \r<br />\r<br />- Create a black and white illustration by [url=http://www.nexusmods.com/skyrim/mods/26937/]Yuril[/url].\r<br />- Skull Paint Splatter PSD by [url=http://www.officialpsds.com/Skull-Paint-Splatter-PSD40567.html]ZERO[/url] at OfficialPSDS.com.\r<br />- Vintage book cover texture by [url=http://fotobg.ru/download/3035]FotoBG[/url].\r<br />- Free Jester Hat vector courtesy of [url=http://petshopboxstudio.com/goodies/free-vector-jester-hat/]PetShopBox Studio[/url].\r<br />\r<br />Thank you for reading this huge wall of text, and I hope you enjoy the adventure&#33; \r<br />\r<br />\r<br />[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "35",
  "version": "1.00",
  "author": "Jokerine",
  "createdUnix": "1387125975",
  "updatedUnix": "1387123546",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000086883",
      "name": "Mini Quest - Pelagius Wing Player Home",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14897",
      "fileName": "Mini Quest - Pelagius Wing Player Home-48850-1-00.rar",
      "uploadedUnix": "1387123546",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/58b06edefa805610e98e6de8c073470c2c3dbb4a4ec0a393303529971a1317e1/analysis/1407843551/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mini%20Quest%20-%20Pelagius%20Wing%20Player%20Home-48850-1-00.rar?fid=1000086883&ttl=1535829277&ri=8192&rs=8192&setec=0cae3d69d5a8fe4fb3f1590962d9537a"
    }
  ]
}