{
  "modId": 48885.0,
  "modName": "Whiterun Gatehouse Home and Skooma Den",
  "summary": "This mod is for those who want a simple and convenient place to sleep, store stuff and do a bit of crafting.  It’s located in a loft area just above Whiterun’s main gate.  ",
  "descriptionHtml": "With this mod, upon entering the main gate of Whiterun, look to your right in the small guard passage and you will find several storage barrels obscuring a ladder.  Go up the ladder and you will find a storage area for junk: baskets, pots, pelts nothing fancy except for an alchemy table and an enchanting table, both fully functional. It&#39;s possible these were ordered by someone and never got delivered.  You may have to clean up things a bit before you get too comfortable.  There is also a bedroll, table and mead keg close by.  Perhaps the guards come here for breaks from nightly guard duty.  If you look carefully you might notice a door obscured by some ivy.  If you can pick the lock it will lead to a passage through the walls to and old, enclosed reservoir.  A broken rope hanging over the water can be climbed up a shaft leading to a well cover outside the city walls.  This would appear to be an extra source of water only used during sieges of the city.  Next to the reservoir someone has set up a small living area.  Whoever it is seems to have a bit of a skooma habit, judging by the full and empty bottles.  Perhaps those Khajiit merchants come in here through the well when they are visiting Whiterun.  There is also a locked door which opens to one of the outer guard houses of the drawbridge.  Those guards have apparently given up looking for the key to the door and have shoved a bunch of boxes up against it, but if you find the key you may be able to squeeze past the boxes.  Just don’t let the guards notice you or you may never be able to enjoy your peaceful gatehouse home and skooma den.\r<br />\r<br />Practical information:  There is no need to purchase this; it is just a storage area after all. This home is all about convenience.  You have the alchemy and enchanting tables here which are more convenient than even Breezehome.  For smithing, you can just leap down to Warmaiden’s.   The upper door to the skooma den has an easy to pick lock.  The lower door needs the key found on the table close by.  If you don’t pick locks, you can climb the rocks outside the main gate or run across the roof above the drawbridge to the well cover.  To get back out this way run along the ledge on the side of the pool, and jump to the rope.   The skooma den has a cooking pot and bedrolls for three individuals.  No spousal beds here.  Besides, do you really want your spouse to know you live in a skooma den?  Save up for that nice place in Solitude, and then get married. That’s just my advice.   When in need of curing there is also a shrine to Zenithar (10% better prices).  Hmm, those Khajiits are crafty.  All crates and barrels are non-respawning.  There are many types of ingredients to be found in all the areas.  All areas are fully nav-meshed and there are lots of idle markers to keep your followers busy, although I noticed that Lydia spent most of her idle time in front of the mead keg.  She said the crates impeded her efforts to move around, but I don’t really believe her.  \r<br />\r<br />Conflicts:  Any mods (and I know there are some) that use the loft above the main gate, the guard area to the right of the gate (upon entering) or the two guard houses on either side of the drawbridge.  The vanilla game doesn’t use these areas except a bit during the civil war.  I have tried to keep all the mod elements from interfering with those elements, although I have not done the civil war quest and I am not sure what will happen then.  Perhaps the whole abode will wind up in flaming ruins.  Maybe someone could try it and tell me what happens.  \r<br />",
  "categoryId": "67",
  "version": "1.0",
  "author": "scon27",
  "createdUnix": "1387323599",
  "updatedUnix": "1387322262",
  "containsAdultContent": false,
  "uploadedBy": "scon27",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087204",
      "name": "Whiterun Gatehouse Home and Skooma Den",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "116",
      "fileName": "Whiterun Gatehouse Home and Skooma Den-48885-1-0.rar",
      "uploadedUnix": "1387322262",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/20dad6ea02565dd0fef2334d11811406c8675596eedf4277ad977e9ad2f201c7/analysis/1407846964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whiterun%20Gatehouse%20Home%20and%20Skooma%20Den-48885-1-0.rar?fid=1000087204&ttl=1535829329&ri=8192&rs=8192&setec=425e5d65393f1b9ef6644a13aabd64d6"
    }
  ]
}