{
  "modId": 4888.0,
  "modName": "CHSBHC - BBP - Nude and Jiggly Mod",
  "summary": "CHSBHC (Cherry Hotalings Super Busty H Cup) mod, Breast Physics for the first time in skyrim! Butt Physics for the first time!",
  "descriptionHtml": "[center][img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/CHSBHCBBP_Title.png[/img][/center]\r\n[center]Female body replacer and body physics mod for Skyrim[/center]\r\n\r\n[color=#DB7900][b][u]Table Of Contents[/u]:[/b]\r\nDescription\r\nFeatures\r\nBugs\r\nVersions\r\nClothes\r\nInstallation\r\nFAQ\r\nVideos\r\nTutorials\r\nLinks\r\nCredits\r\n[/color]\r\n\r\n[img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/Description.png[/img]\r\nThis originally started as a modification of Calientes mesh to make a much curvier and bustier version of that mod but soon turned into much more.\r\nThe body is very curvy and has been modified to work with the in game weight slider, this allows for a broader range of looks even on the NPC\\'s.\r\nThe body physics (Jiggly breasts and butt) I created from scratch and is the first of its kind in skyrim. The physics allow for the breasts and butt of your character and npc\\'s to bounce and move with animations/armor/clothing made for this mod.\r\nTextures made for CBBE will work with this mod as well, allowing for a wide range of options. The purpose of this mod to allow people to have more options then were originally available for skyrim and I hope you enjoy it as much as I enjoyed working on it!\r\nKeep your eyes peeled as updates happen often and will be posted in the versions section.\r\n\r\n[img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/Features.png[/img]\r\n-30+ animations for Physics for females and females that use male animations as well\r\n-Left and Right Breast bones\r\n-Left and Right Butt bones (Butt bones disabled in 2.2 to prevent Elf Race Crashing)\r\n-Separate bones for control of individual breast and butt cheeks. This allows animators to create much more dynamic animations with the breasts or butt.\r\n-Original Havok bones kept intact allowing all standard animations to work normally. (standard animations will not have body physics though. Those are created seperatly)\r\n-Included CHSBHC mod is weight painted already for the new bones\r\n-Weight slider controls how thin or how curvy the character is.\r\n-Weight paint for breasts and butt are different for femalebody_0 and femalebody_1. This allows the weight slider to not only allow the breasts to get larger\r\nand smaller, but it also makes the amount of physics on the breasts and butt smaller or greater depending on the slider! (More wiggle and\r\njiggle the higher the weight slider is, less the lower the slider is) !!For modders that made armour for the original CHSBHC mod you will have to paint new weights for the breasts and butt to work with any new animations made for physics!!\r\n-A small amount of automated breast flow has been created with the Pre Breast bones using Lag controllers (Huge thank you goes to Twiggy for this find) \r\n-Updated Level of Detail for Breast and butt bones to allow the rendering of breast bounce from a further distance.\r\n-No Need to overwrite the original game files. (I painstakingly created brand new files that go into your data directory)\r\n-3ds max 2012 file with bone rig to create your own animtions (see more below)\r\n\r\n[img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/bugs.png[/img]\r\n(!Bugs listed are always as of the latest version released!)\r\n-Sound: footstep noises do not play when walking or running in 3rd person.\r\n-Breasts show in first person if you are an elf race\r\n-Some minor animation glitches which include (None of them have any effect on gameplay as you still hit/block/etc):\r\n--Sneaking and holding a 2 handed weapon holds it in one hand.\r\n--Casting spells and sneaking doesnt cause your hands to animate.\r\n--Running and blocking raises your sword but does not play the shield block animation (But yes you still block and you will hear the block sound)\r\nNot animated related:\r\n-Butt weighting on mesh causes elf race to crash now (I am going to try really hard to see if I can fix this as the Breasts are working in my tests now, but if I cant get it then I may have to shelve it until the CK)\r\n-Seam issues have creeped up again, I will be adjusting the arms, legs and neck to fit the Vanilla mesh again after I complete my other testing. But this will need to be tested as well.\r\n\r\nBugs Not related to my mod:\r\n-realistic ragdolls mod will cause the breasts to have VERY odd behavior because the breasts use the the built in physics for some movement.\r\n\r\n[img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/versions.png[/img]\r\n[b]Version V2.4.1 \\\"CHSBHC-Body-Physics-ModV2.4.1\\\"[/b]\r\n-Quick Male Idle animation fix. (This stops the staring into space while idle on the male characters)\r\n\r\n[b]Version V2.4 \\\"CHSBHC-Body-Physics-ModV2.4\\\"[/b]\r\n-17 Female Animations added with physics: mt_idle, mt_runbackward, mt_runbackwardleft, mt_runbackwardright, mt_runforward, mt_runforwardleft, mt_runforwardright, mt_runleft, mt_runright, mt_walkbackward, mt_walkbackwardleft, mt_walkbackwardright, mt_walkforward, mt_walkforwardleft, mt_walkforwardright, mt_walkleft, and mt_walkright\r\n-17 Male Animations added with physics: mt_idle, mt_runbackward, mt_runbackwardleft, mt_runbackwardright, mt_runforward, mt_runforwardleft, mt_runforwardright, mt_runleft, mt_runright, mt_walkbackward, mt_walkbackwardleft, mt_walkbackwardright, mt_walkforward, mt_walkforwardleft, mt_walkforwardright, mt_walkleft, and mt_walkright\r\n-Physics distance render has been adjusted for machines running lower graphics settings.\r\n-Fixed issue with some latent crashes related to the elf race in certain circumstances.\r\n-All Females that use male animations will now have Breast and butt physics as well\r\n\r\n[b]Version V2.3 \\\"CHSBHC-Body-Physics-ModV2.3\\\"[/b]\r\n-Female Walking animtions now included (I may create a less jiggly walk animation for these next)\r\n-Updated Level of Detail for Breast and butt bones to allow the rendering of breast bounce from a further distance. (you must reinstall the entire mod for this as it uses the skeleton files)\r\n-Melty Breasts fixed for some. I hope to have this completely fixed by next release. (Some say if you move the body a little then the breasts are fine when nude)\r\n-Idle animation tweaked a little.\r\n-First person breasts fixed (Removed them from first person, this was an unintended bug that caused strange effects in first person mode)\r\n-Skin weights adjusted a bit for smooth breast animations. (there was a problem around the areola in the last release)\r\n\r\n[b]Version V2.2 \\\"CHSBHC-Body-Physics-ModV2.2\\\"[/b]\r\n-Breast Melting after you kill an NPC has been fixed.\r\n-Butt Physics has been disabled as it will not work with the Elf races properly. (I will look into this some more, But this will probably require the Creation Kit)\r\n-A small amount of automated breast flow has been created with the Pre Breast bones using Lag controllers (Huge thank you goes to Twiggy for this find) But the full breast bounce/movement relies on new animations.\r\n-Elf Race game crash has been fixed! YAY! Now get out there and play those elves!\r\n-Orc Female now prepped to take new animtions (Expect to see some new physics animations for Orc females soon)\r\n-New Updated animation file for 3Ds Max 2012 included for people to animate from. (includes new bone setup)\r\n\r\n[b]Version V2.1 \\\"CHSBHC-Body-Physics-ModV2.1\\\"[/b]\r\n-Fix for beast races included\r\n\r\n[b]Version V2.0 \\\"CHSBHC-Body-Physics-ModV2.0.rar\\\"[/b]\r\nBody physics is here!!\r\n-Physics allowing breast bounce and butt bounce with custom animations\r\n-Weight slider will affect physics amount along with bust and butt size.\r\n-New Bone rigging for the female characters\r\n\r\n[b]Version V1.1 \\\"CHSBHC-Body-ModV1.1.rar\\\"[/b]\r\n-Redid the Legs.\r\n-Redid the hips for more what the community as a whole was looking for.\r\n-Redid the Butt to be a little more put together and rounder.\r\nThis should be the final shape change for the end result unless there is a seam issue.\r\n\r\n[b]Version V1.0 \\\"CHSBHC-Body-ModV1.0.rar\\\"[/b]\r\n-Fixed seam issues\r\n-Made sliders work properly\r\n-Fixed vertex count issue\r\n\r\n[img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/Clothes.png[/img]\r\n(These clothes are the clothes available in the \\\"Optional Files\\\" section of this download that I modified to fit CHSBHC BBP mod)\r\n(All Clothing is compatible with CHSBHC BBP 2.4 and up. Versions are just the version of the clothing)\r\n-Dark Brotherhood Armor\r\n-Prisoners Clothing\r\n-Chefs Outfit\r\n-Barkeeps outfit\r\n\r\nClothes by Others:\r\n-[url=http://skyrim.nexusmods.com/downloads/file.php?id=7394]NPC Clothes Replacer[/url] (whiterabbit0)\r\n-[url=http://skyrim.nexusmods.com/downloads/file.php?id=7576]Daedric Female[/url] (whiterabbit0)\r\n-[url=http://skyrim.nexusmods.com/downloads/file.php?id=6714]Nightingale Armor[/url] (whiterabbit0)\r\n-[url=http://skyrim.nexusmods.com/downloads/file.php?id=6897]Forsworn Armor[/url] (whiterabbit0)\r\n-[url=http://skyrim.nexusmods.com/downloads/file.php?id=7475]Killer_Keos_Skimpy Armor[/url] (nimbonius)\r\n-[url=http://skyrim.nexusmods.com/downloads/file.php?id=6166]Dynasty Armor[/url] (drakishar)\r\n-[url=http://skyrim.nexusmods.com/downloads/file.php?id=5648]Golden Elven Palace Armor[/url] (Apogee777)\r\n-[url=http://skyrim.nexusmods.com/downloads/file.php?id=5209] Snow Leopard Forsworn[/url] (Apogee777)\r\n-[url=http://skyrim.nexusmods.com/downloads/file.php?id=7411]Lace Lingerie[/url] (soplet)\r\n-[url=http://skyrim.nexusmods.com/downloads/file.php?id=5857]Nude Khajiit_Human Hybrid[/url] (bluedraggy)\r\n\r\n[img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/Installation.png[/img]\r\nSimply extract the contents of this file into your skyrim\\'s data directory.\r\n(this should make files go into this directory \\\"C:\\\\Program Files (x86)\\\\The Elder Scrolls V Skyrim\\\\Data\\\\meshes\\\\actors\\\\character\\\\character assets\\\" This depends on your installation and if your using windows 7 or not or steam installed version etc)\r\nStart up your game and get naked or download armors, clothing that is compatible with CHSBHC!\r\nYou should be able to go into the showracemenu in the console to play around with the weight slider.\r\n\r\n[img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/faq.png[/img]\r\n[u][b]Q:[/b][/u] Will you make a version with bigger, smaller, rounder, skinner, fatter, thinner, taller, shorter, flatter, muscular, implants, realistic, fake, breasts or butt or hips or legs or love handles or stomach etc etc etc.\r\n[u][b]A:[/b][/u] NO! The mod is created the way that I wanted it to be with some user input. Every one has different tastes and I have received every request for opposite shapes that you can imagine. No and don\\'t ask or IM me requesting a different body change, it will be ignored. Sorry.\r\n[u][b]Q:[/b][/u] How do I change the Weight of my character (Curvy or less curvy, busty or less busty shape) ?\r\n[u][b]A:[/b][/u] If you want to get to the character creation menu after you have already created your character simply press the ~ key on your keyboard (Next to the 1, on your keyboard)\r\nThis will open your console. Type in: showracemenu\r\nThis will open your character creation menu where you can edit your character (Dont forget to hit ~ again so you can click on the menus)\r\n[u][b]Q:[/b][/u] How do I change the size(weight) of an NPC?\r\n[u][b]A:[/b][/u] Open the console with your ~ key, click on the NPC you want to change the size of, then type \\\"setnpcweight <1-100>\\\" with 1 being totally flat/thin and 100 being max\r\n[u][b]Q:[/b][/u] How do I move the camera so I can see the front of me while walking, running etc?\r\n[u][b]A:[/b][/u] Open your console and type: \\\"animcam\\\" (Without the quotes) This will allow you to rotate the camera while you walk etc. However you cannot turn your character so you might have to type animcam again to put your camera to default again to turn.\r\n[u][b]Q:[/b][/u] Will CBBE armor/clothing work with this mod?\r\n[u][b]A:[/b][/u] Yes and No. You will see the armor and clothing but it will be the CBBE shape you will be looking at not CHSBHC shape. Also the physics will not work on CBBE Armor/Clothing.\r\n[u][b]Q:[/b][/u] Will the BBP Physics you made work with CBBE or any other body mod.\r\n[u][b]A:[/b][/u] I currently do not provide support of the physics mod on other body types at the moment. I will probably provide a development pack to the other modders like Caliente. But currently there are many pieces required to make the physics mod work properly. Once I can iron out enough to feel comfortable creating a dev pack I will. When? Not sure possibly after the Creation Kit comes out.\r\n[u][b]Q:[/b][/u] Will CBBE skin textures work on CHSBHC?\r\n[u][b]A:[/b][/u] Yes they should work perfectly fine as they both use the same UV template. So as long as the mod is just a texture it will work fine.\r\n[u][b]Q:[/b][/u] Will hand and feet mods work with CHSBHC?\r\n[u][b]A:[/b][/u] If the hands and feet mod were either made for CBBE or CHSBHC they should work fine. If not then no.\r\n\r\n[img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/Videos.png[/img]\r\nVideo (NSFW!!):\r\n[url=\\\"http://www.dailymotion.com/video/xniuh4_chsbhc-body-physics-complete-skyrim_videogames\\\"]Weight menu slider and Idle animation (Dailymotion)[/url]\r\n\r\n[img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/tutorials.png[/img]\r\n------------------\r\nArmor and Clothing Creation tutorial\r\n------------------\r\nArmor and Clothing Creation tutorial for CHSBHC mod in 3DS Max for beginners!!\r\nhttp://www.thenexusforums.com/index.php?/topic/534407-modding-armor-for-chsbhc-bbp-tutorial-for-3ds-max/\r\n\r\n------------------\r\nAnimation Creation Tutorial\r\n------------------\r\nTools needed:\r\n3ds max 2011 (Sorry its the only version i have)\r\nHavok\\'s 3ds max exporter http://www.havok.com/try-havok (Its free but you have to fill out some info)\r\nNiftools 3dsmax plugin (Build created by figment) !Very important plugin! http://www.skyrimnexus.com/downloads/file.php?id=5622 or here: http://niftools.sourceforge.net/forum/viewtopic.php?f=20&t=3196&hilit=3ds+max+plugin#p21708 \r\nFallout mod manager or a BSA extract tool to extract the files out of the BSA files: http://www.fallout3nexus.com/downloads/file.php?id=640 (The BSA browser is awesome and you can install this without having fallout installed just pick fallout 3 when you open the browser and browse to skyrim)\r\nHkxcmd tool for extracting animations from the game files (not for importing yet).\r\nSkeleton Text file for havok (Included in this file)\r\n3ds max Bone rig (included in this file) (A giant thank you goes out to SaidenStorm from the bethesda forums for helping me with the missing bone parameters in my 3dsmax file!!)\r\n\r\nOk fewwwwww thats a lot of tools!\r\nOnwards.....\r\n\r\nSteps: (assuming you installed all the tools above)\r\n1) Open the fallout mod manager BSA Browser --> select fallout 3 fromt he popup --> Click the open button --> browse to Program Files\\\\The Elder Scrolls V Skyrim\\\\Data (Or wherever your Skyrim install is) --> click on the Animations.bsa --> click open\r\n2) On the left pane click the + next to skyrim --> + Meshes --> + actors --> + character --> + animations --> Click on female\r\n3) on the right pane click on the animation you want or Highlight a bunch of them and then click extract (dont click extract all) select a folder you want to extract to (I suggest you make a new one on your C: root drive if you havent already, it will make the next step easier(Steps below on what folders to make) ((Im using mt_idle.hkx as my example))) then click ok.\r\n3a) For the steps above I recommend making a few NEW directories on your C: drive. Make the following:\r\nC:\\\\Skyrim , and C:\\\\Skyrim\\\\data . \r\n-Put the animation.hkx you extracted above into the C:\\\\Skyrim\\\\data folder.\r\n-Put the Skeleton.hkx file that comes with my mod into the C:\\\\Skyrim\\\\data folder \r\n-Put the hkxcmd.exe tool in the C:\\\\Skyrim folder.\r\n4) Open a command window in windows 7 type cmd then enter in the start bar, other windows version then its: start --> run --> type in cmd then enter\r\n5) in the command window type “cd ..” (without the quotes and keep typing “cd ..” until you get to just the C:\\\\ prompt. \r\n6) Now type “cd Skyrim” (again without the quotes) you should now be in the C:\\\\Skyrim directory that you copied the hkxcmd.exe into.\r\n7) Now type(WITH the quotes this time): hkxcmd ExportKF \\\"c:\\\\Skyrim\\\\Data\\\\Skeleton.hkx\\\" \\\"c:\\\\Skyrim\\\\Data\\\" \\\"c:\\\\Skyrim\\\\Data-out\\\"\r\n7a) Ignore the warning message about bones not found, its why we did the step above, it creates the missing bones for you. Fancy huh?\r\n8) This will create a new folder: C:\\\\Skyrim\\\\Data-out , You will find the animations you extracted to the C:\\\\Skyrim\\\\data (In step 3) now exported in the .kf format in the C:\\\\Skyrim\\\\Data-out directory which you can import into 3ds max.\r\n9) Open 3Ds Max 2011 and open the 3dsmax bones file that was included with this package (\\\"CHSBHC-Vx.x-Physics-Bone-T-Pose.max\\\"). (Once loaded you should see a bunch of bones standing there staring at you ...... waiting)\r\n9a) (Optional) You can import the mesh I modded that comes with this file so you can see whats going on with the animation. Click The 3ds max icon top left --> import --> Browse to the femalebody_1.nif (if you want to use that body shape) --> click ok --> UNCHECK cameras and UNCHECK import skeleton(Very important those 2 are unchecked) leave everything else thats already checked --> click import (The body should be imported and using the bones, yay!)\r\n10) Import the new animation into 3ds max. Click the Max icon top left --> Import --> browse to the mt_idle.kf --> click import on the popup (Leave everything checked)\r\n11) Animate! whooo hooo im animating, im animating! Dont forget the new Left Breast, Right Breast, Left Butt, and Right Butt bones! Move them around for whacky fun!\r\n12) Now its time to export our animation with the havok plugin for 3dsmax (The save file has all the filter settings built in so no fretting!) Click the Disk icon on the Laft top of your screen (If you hover over it, it says export its left of the viewport name and near the Graphite modelling tools text or about an inch strait down from the 3ds max top left button)\r\n13) In the Havok popup window under the Configuration set section click the dropdown and select Animations (if it isnt already selected)\r\n14) click on the Create Skeletons text, this will populate the right pane with info. under where it says Build rigg on the right pane, make sure \\\"from file is checked and \\\"use file order\\\" is checked. --> click on the ... next to the \\\"From File\\\" section and browse to my \\\"CHSBHC bone Rig Breasts and Butt.txt\\\" file that was included with this file.\r\n15) click the Create Animations text in the Configuration section of the Havok popup --> on the right pane make sure \\\"From File\\\" is checked --> click the ... next to the \\\"From File\\\" area and select my \\\"CHSBHC bone Rig Breasts and Butt.txt\\\" again.\r\n16) Click on the Write To Platform text under the Configuration section of the Havok window popup --> on the right pane under \\\"Filename\\\" click the ... --> Specify a new location and filename for your animation (in my case I used mt_idle.hkx !!VEry important you select a location to save in this step or you will get an error that it cannot save it!!)\r\n17) Put your new shiney and polished animation in your \\\"The Elder Scrolls V Skyrim\\\\Data\\\\meshes\\\\actors\\\\character\\\\animations\\\\female\\\" (If it’s a female animation) folder and load the game!\r\n\r\nViola! your done!\r\nOnce you have done this the first time you only really have to do steps 10 - 17 from here on out to create your animations!\r\n\r\nHave fun!!\r\n\r\n[img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/Links.png[/img]\r\nModify Armor for CHSBHC Discussion thread:\r\nHow to modify armor to fit CHSBHC BBP mod tutorial using 3ds max\r\nhttp://www.thenexusforums.com/index.php?/topic/534407-modding-armor-for-chsbhc-bbp-tutorial-for-3ds-max/\r\n\r\nMod Discussion Thread:\r\nCHSBHC and BBP Mod Discussion Thread\r\nhttp://www.thenexusforums.com/index.php?/topic/522154-chsbhc-body-breast-and-butt-physics-mod/\r\n(Please report any bugs, concerns, and any other info in that forum)\r\n\r\n[img]http://216.105.128.240/Cherry/Skyrim/CHSBHC/Nexus/Images/Credits.png[/img]\r\nCaliente CBBE Mesh and textures. His original CBBE mod can be downloaded here: http://www.skyrimnexus.com/downloads/file.php?id=2666\r\nSaidenStorm from the bethesda forums for helping me with the missing bone parameters in my 3dsmax file and being patient with all my questions!\r\nTwiggy for helping with the lagg bone controller for some automatic movement to my custom bones.",
  "categoryId": "29",
  "version": "v2.4",
  "author": "CherryHotaling",
  "createdUnix": "1325203873",
  "updatedUnix": "1328387385",
  "containsAdultContent": true,
  "uploadedBy": "CherryHotaling",
  "primaryFile": null,
  "files": [
    {
      "fileId": "17781",
      "name": "CHSBHC-Body-Physics-ModV2-0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5353",
      "fileName": "CHSBHC-Body-Physics-ModV2-0-4888.rar",
      "uploadedUnix": "1326005775",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/209bd4b241c41a084769290749143bf7b32e9cbb261b33a41969b9566f8d93e5/analysis/1406593030/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CHSBHC-Body-Physics-ModV2-0-4888.rar?fid=17781&ttl=1535761169&ri=8192&rs=8192&setec=e359d68ba18cc2fecd71f77773f5cbd9"
    },
    {
      "fileId": "17991",
      "name": "CHSBHC-Body-Physics-ModV2-1",
      "version": "V2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5404",
      "fileName": "CHSBHC-Body-Physics-ModV2-1-4888.rar",
      "uploadedUnix": "1326053709",
      "modVersion": "V2.1",
      "virusScanUrl": "https://www.virustotal.com/file/88763dfed81b67276c393c34e2dda5cc04159576f6ea5b5f82bd85ae7d2f7083/analysis/1406595005/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CHSBHC-Body-Physics-ModV2-1-4888.rar?fid=17991&ttl=1535761169&ri=8192&rs=8192&setec=325ef85c70b2dbfa27fee06c38034903"
    },
    {
      "fileId": "18696",
      "name": "CHSBHC-Body-Mod-NOPHYSICS-V1-1",
      "version": "V1.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "5236",
      "fileName": "CHSBHC-Body-Mod-NOPHYSICS-V1-1-4888.rar",
      "uploadedUnix": "1326237295",
      "modVersion": "V1.1",
      "virusScanUrl": "https://www.virustotal.com/file/57be717d872c59aef819ae41dbce5b952fe61d7438cd919ca7c89a37dcd072cd/analysis/1406601310/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CHSBHC-Body-Mod-NOPHYSICS-V1-1-4888.rar?fid=18696&ttl=1535761170&ri=8192&rs=8192&setec=3a9177b8bde3bf36c68ec97d26762b80"
    },
    {
      "fileId": "20273",
      "name": "CHSBHC-Body-Physics-ModV2-2",
      "version": "V2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5387",
      "fileName": "CHSBHC-Body-Physics-ModV2-2-4888.rar",
      "uploadedUnix": "1326695945",
      "modVersion": "V2.2",
      "virusScanUrl": "https://www.virustotal.com/file/58fae3ba407262744c0bec8250d1e9d1dd72658f9efa5f9c6c3231161cf9370e/analysis/1406615175/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CHSBHC-Body-Physics-ModV2-2-4888.rar?fid=20273&ttl=1535761170&ri=8192&rs=8192&setec=b8dd03f3f4f2d88225f778bdfa925a8d"
    },
    {
      "fileId": "20821",
      "name": "CHSBHC-Body-Physics-ModV2-3",
      "version": "V2.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5430",
      "fileName": "CHSBHC-Body-Physics-ModV2-3-4888.rar",
      "uploadedUnix": "1326864815",
      "modVersion": "V2.3",
      "virusScanUrl": "https://www.virustotal.com/file/1973c3791f42154302fdfc3c151a6c8c229e6e3b44b61ba86ff17c2d848be33c/analysis/1406620217/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CHSBHC-Body-Physics-ModV2-3-4888.rar?fid=20821&ttl=1535761171&ri=8192&rs=8192&setec=8b1c0501104d6b9642ce31ef07e94f32"
    },
    {
      "fileId": "21067",
      "name": "prisonerclothes_f",
      "version": "V1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1809",
      "fileName": "prisonerclothes_f-4888-V1-0.rar",
      "uploadedUnix": "1326945195",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/663cf67e5476b0e9d653dc4148bd2f3f364173640498ce19727d2779560d9d25/analysis/1406622545/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/prisonerclothes_f-4888-V1-0.rar?fid=21067&ttl=1535761171&ri=8192&rs=8192&setec=fdf5ae6f14c0916b81b9b6e45e7e0163"
    },
    {
      "fileId": "21303",
      "name": "CHSBHC-V2-3-Physics-Bone-T-Pose-2010",
      "version": "V2.3",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "28",
      "fileName": "CHSBHC-V2-3-Physics-Bone-T-Pose-2010-4888-V2-3.rar",
      "uploadedUnix": "1327021480",
      "modVersion": "V2.3",
      "virusScanUrl": "https://www.virustotal.com/file/a554d0630bbb798b929a3185efa65a27bbb4ad48cd30a5118175c2ce6e449e51/analysis/1406624584/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CHSBHC-V2-3-Physics-Bone-T-Pose-2010-4888-V2-3.rar?fid=21303&ttl=1535761172&ri=8192&rs=8192&setec=d5a9b8cc6bd9902a363f1304ed03fd81"
    },
    {
      "fileId": "21606",
      "name": "chefV1-0",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1673",
      "fileName": "chefV1-0-4888-1-0.rar",
      "uploadedUnix": "1327110298",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/40d61b29357f0fd94052a1e072229b3f1a0dba71d7f15f2aded444e819c546a9/analysis/1406626510/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/chefV1-0-4888-1-0.rar?fid=21606&ttl=1535761172&ri=8192&rs=8192&setec=4e8a8f63878a2da7de88e3e6a30e96b7"
    },
    {
      "fileId": "21607",
      "name": "BarkeeperV1-0",
      "version": "v1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "840",
      "fileName": "BarkeeperV1-0-4888-v1-0.rar",
      "uploadedUnix": "1327110355",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/746998764733fe4a2d6353063bb46634d6f7995dca9cb1a4490ac0677c5110ff/analysis/1406626511/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BarkeeperV1-0-4888-v1-0.rar?fid=21607&ttl=1535761173&ri=8192&rs=8192&setec=2ae00e470dad82d9d149d3653eb24d5f"
    },
    {
      "fileId": "22815",
      "name": "CHSBHC-Body-Physics-ModV2-4",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5912",
      "fileName": "CHSBHC-Body-Physics-ModV2-4-4888.rar",
      "uploadedUnix": "1327460081",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/63c6c92c980567a71ec1336e341fc1ddf744d8fa048a13261f8ef528ddb7b5be/analysis/1406636053/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CHSBHC-Body-Physics-ModV2-4-4888.rar?fid=22815&ttl=1535761173&ri=8192&rs=8192&setec=abafe35b9006629b45a31713d515aaa1"
    },
    {
      "fileId": "25913",
      "name": "CHSBHC-Body-Physics-ModV2-4-1",
      "version": "v2.4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5910",
      "fileName": "CHSBHC-Body-Physics-ModV2-4-1-4888-v2-4-1.rar",
      "uploadedUnix": "1328387385",
      "modVersion": "v2.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/312d9d02ca0261af38a0a8e80cf308ea0b428745d6a68127172a6781b9192d63/analysis/1406653903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CHSBHC-Body-Physics-ModV2-4-1-4888-v2-4-1.rar?fid=25913&ttl=1535761174&ri=8192&rs=8192&setec=3e9fe087c42eb9d493944659791cafdb"
    }
  ]
}