{
  "modId": 48927.0,
  "modName": "Steel and Skyforge Steel Weapons HD",
  "summary": "FINALLY no more used up sand paper textures for steel swords&#33; SHINY REFLECTIVE HD 2K TEXTURES for STEEL and SKYFORGE STEEL weapons they have separate textures including scabbards. Tempering for skyforge steel dagger fixed. Normal maps on some weapons are not compressed so no blocky normals.",
  "descriptionHtml": "Finally finished this mod&#33; I am so sick and tired of looking at the default steel sword textures they look like used up sand paper not steel&#33; Now things look better with this mod there are reflecting effects that actually look like metal or what I call &#34;video game metal&#34; and all skyforge steel weapons are fixed too they have better textures than the standard steel with additional engraving that is relevant to the companions. This mod fixes ALL STEEL WEAPONS including steel bow &#34;hunting bow&#34; and the quiver for steel arrows. This also includes the 1hander meshes that are seen when fighting from horseback.\r<br />\r<br />Why red for skyforge weapons? Well the companions have this &#34;companions red&#34; color theme going on with their home in whiterun so the color goes along with that.\r<br />\r<br />THIS MOD DOES NOT WORK WITH ENB&#33;&#33;&#33;&#33;&#33; \r<br />\r<br />Because I use an _m texture in ALL THINGS in this mod, if you try to use this mod with ENB it will look bad and if you leave out the _m file then all detail is LOST. This mod is meant for people NOT RUNNING ENB. The ONLY way to make this mod work with ENB is to retexture it so that it works with ENB and I am not doing that. I don&#39;t run ENB I use the game engine like most people. \r<br />\r<br />\r<br />Running this mod with a 1gb vram video card will probably cause some slowdown because of non compressed normal maps in this mod. Using a 3gb or better vram video card is better.\r<br />These weapons have non compressed normal maps...\r<br />\r<br />steel dagger\r<br />steel sword\r<br />steel mace\r<br />steel waraxe\r<br />steel greatsword\r<br />\r<br />skyforge steel dagger\r<br />skyforge steel sword \r<br />skyforge steel waraxe\r<br />skyforge steel greatsword\r<br />skyforge steel battleaxe\r<br />\r<br />Install with nexus mod manager or install manually.\r<br />\r<br />I wanted to use texture sets but they don&#39;t work right so the model files were used instead.\r<br />\r<br />Found any bugs? Post them in the comments section thanks:-)",
  "categoryId": "55",
  "version": "v1.0",
  "author": "dragonslayer2k12",
  "createdUnix": "1387340671",
  "updatedUnix": "1387338963",
  "containsAdultContent": false,
  "uploadedBy": "dragonslayer2k12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087222",
      "name": "SteelSkyforgeSteelWeaponsHD",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "125573",
      "fileName": "SteelSkyforgeSteelWeaponsHD-48927-v1-0.rar",
      "uploadedUnix": "1387338963",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7aa5997bfe5dc02c4089159de87087a20f845bf08ddd0d68d26af85f7e48b917/analysis/1407847373/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SteelSkyforgeSteelWeaponsHD-48927-v1-0.rar?fid=1000087222&ttl=1535829385&ri=8192&rs=8192&setec=096484800e26083e844218da74e4c5d5"
    }
  ]
}