{
  "modId": 48971.0,
  "modName": "Mod Information Archive",
  "summary": "Want to know the correct Bash Tags to use for your mods or DLC? \r<br />How about knowing if your mods or DLC needs to be cleaned with Tes5Edit or not?\r<br />Perhaps you would like to know which of your mods or DLC is causing a warning, error or some other problem in your Papyrus Logs?\r<br />Then the Mod Information Archive is for you.\r<br />",
  "descriptionHtml": "[size=3][color=orange][b][u][color=#ff0000]This mod is currently outdated, I may decide to update it again in the future.[/color][/u]\r<br />\r<br />Want to know the correct Bash Tags to use for your mods or DLC?\r<br />How about knowing if your mod or DLC needs to be cleaned with Tes5Edit or not?\r<br />Perhaps you&#39;d like to know which of your mods or DLC is causing a warning, error or some other problem in your Papyrus Logs?[/b][/color][/size] \r<br />\r<br />[size=5][color=#01C5BB][b]Then the Mod Information Archive is for you&#33;[/b][/color][/size]\r<br />[b]This will become a community project with the help of others, possibly even leading to integration with BOSS & Mod Manager Programs.[/b]\r<br />\r<br />\r<br />\r<br />[size=3][color=#00EE76][b]Instructions & Information:[/b][/color][/size]\r<br />Download the text document which is the Mod Information Archive, \r<br />in the text document there is a listing of Mods & DLC ordered alphabetically by name.\r<br />Each listing will contain a possible reply or statement from the author or the community, along with any Papyrus Log errors & Bash Tags specific to the mod or DLC. Tes5Edit information will be included as well.\r<br />\r<br />\r<br />\r<br />[size=3][color=#00EE76][b]Why was this project created?:[/b][/color][/size] \r<br />To further aid a gathering of information in respect of modifications for a functional Skyrim. The information the archive contains was not always easy to obtain before it was created, furthermore having it all available alphabetically ordered is a great perk when searching for information on a specific mod, as well as being able to use the search function to look up a specific error or warning that appears in your logs and have it tell you exactly which mod is causing it and possibly why. The creation of the Archive also helps ensure Mod Authors and future Mod Authors to clearly state this information in their mod description, which aids mod users drastically. It also helps to ensure that Mod Authors fix any errors & warnings within their Mods that cause them to appear in the Papyrus Logs, along with helping ensure Mod Authors try to provide clearer and more accurate information than they are currently. It is a surprising fact, that many Mod Authors have no idea what Tes5Edit, Wrye Bash & BOSS even are&#33; This project will help make them more aware and aid the Skyrim Mod Community in the process. We want BOSS to be the main mod projection that helps you with your mod load order, however we would like to work together complimenting BOSS while also providing information for Mod Managers to use as well.\r<br />\r<br />[size=3][color=#00EE76][b]According to the Mod Information Archive, what mods are the safest mods to use for my game? What do the colors mean?:[/b][/color][/size] \r<br />The safest mods will be colored green in all sections; green means that section is considered good. The least safe mods will be colored red in all sections; red means that section is considered bad. Yellow generally means that section is considered unknown, and yellow is worse than neutral & green. Purple generally means that section is a statement and is considered neutral. Greys means replies and are considered neutral. Blue means that section is for highlighting errors & warnings in the papyrus logs, and is considered worse than yellow and almost as bad as red. The sections are as follows:\r<br />- [b]Does the mod require bash tags?[/b]\r<br />- [b]Does the mod need to be cleaned with Tes5Edit? [/b]\r<br />- [b]Does the mod have papyrus log errors, warnings etc?[/b]\r<br />- [b]Has the mod author made a statement or reply about all of this information?[/b]\r<br />\r<br />[b]Color Codes From The Safest To The Least Safe:[/b] [color=green]Green[/color]|[color=purple]Purple[/color]-[color=grey]Greys[/color]-[color=yellow]Yellow[/color]-[color=blue]Blue[/color]-[color=red]Red[/color].\r<br />\r<br />\r<br />[size=3][color=#00EE76][b]READ:[/b][/color][/size] \r<br />[b]The current version only contains a smaller selection of popular mods & DLC, however future versions with the help of the community will contain many more mods & information.[/b]\r<br />\r<br />If you&#39;d like to help with the Mod Information Archive in some form please let me know&#33; Please submit any and all Papyrus Log Errors you find in your logs that haven&#39;t been covered by the Mod Information Archive yet, along with your mod load order list. If you know if a specific mod or DLC needs certain Bash Tags or needs to be cleaned or should not be cleaned with Tes5Edit please let us know&#33; Included in the Mod Information Archive are unknown warnings & errors, this means that we don&#39;t know which Mod, DLC or otherwise are causing these specific warnings & errors, and if you know what is causing them and why, as well if you know how to fix any errors or warnings found throughout the Mod Information Archive, please submit this information to us&#33; Those of you who want to help more than the average mod user can activate one mod at a time while playing Skyrim and checking their Papyrus Logs then posting any new information that they find, this ensures that we know exactly which mod is causing an error or warning or otherwise.\r<br />\r<br />\r<br />\r<br />[size=3][color=#00EE76][b]Are You A Mod Author?[/b][/color][/size]\r<br />If you are a mod author, please consider submitting to us, the Tes5edit, Bash Tags, and Papyrus Log information about your mod&#33; \r<br />Why should you include your mod information in the Mod Information Archive? It advertises your mod, as there will even be a link directly to your mod page. It will potentially stop people from posting about all of the papyrus log errors, warnings, & crashes on your mod page, as well as stop the posts asking about bash tags or cleaning with Tes5Edit. If your mod does not need to be cleaned by mod users, and you give us the correct bash tag information, and your mod has no papyrus log warnings or errors, imagine how many more downloads and endorsements your mod may have given that anyone who downloads this Mod Information Archive will see this information about your mod.\r<br />\r<br />\r<br />[size=3][color=#00EE76][b]Vital Mods To Use For The Skyrim Mod User:[/b][/color][/size]\r<br />\r<br />\r<br />[b]Skyrim Crash Compendium[/b] - Crash proof your game.\r<br />http://www.nexusmods.com/skyrim/mods/48262/\r<br />\r<br />[b]BOSS[/b] - Automatically sort your load order according to the BOSS Team & the community.\r<br />http://www.nexusmods.com/skyrim/mods/6/\r<br />\r<br />[b]BOSS Userlist Manager[/b] - If you use BOSS, you must get this as well, it&#39;s a great tool to customize your load order if you don&#39;t always agree with what BOSS sorts it as&#33;\r<br />http://www.nexusmods.com/skyrim/mods/311/\r<br />\r<br />[b]Tes5Edit[/b] - If you know what you are doing, cleaning your mods will make your Skyrim work so much better&#33;\r<br />http://www.nexusmods.com/skyrim/mods/25859/\r<br />\r<br />[b]Wrye Bash[/b] - create a bash patch using bash tags, this will help ensure more of your mods will work together&#33;\r<br />http://www.nexusmods.com/skyrim/mods/1840/\r<br />\r<br />[b]Safety Load[/b] - stop infinite loading screens.\r<br />http://www.nexusmods.com/skyrim/mods/46465/",
  "categoryId": "95",
  "version": "1.00",
  "author": "Ovot",
  "createdUnix": "1387491973",
  "updatedUnix": "1387491932",
  "containsAdultContent": false,
  "uploadedBy": "Ovot",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087479",
      "name": "Mod Information Archive 1",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Mod Information Archive 1-48971-1-00.rar",
      "uploadedUnix": "1387491932",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/5939bdd959ecb37f606f4850d29f812b81976c2b75166fefe030053fbadfe07f/analysis/1407849374/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mod%20Information%20Archive%201-48971-1-00.rar?fid=1000087479&ttl=1535829458&ri=8192&rs=8192&setec=308d8f38d3b494d366a6617406f56a8b"
    }
  ]
}