{
  "modId": 48985.0,
  "modName": "Iron Raven Hunters in the shadows",
  "summary": "Adds armor, merchant/follower leveled to player, and 2 unique swords\r<br />requires dawnguard and dragonborn",
  "descriptionHtml": "HOLY CRAP JUST CRESTED 1000 VIews&#33; \r<br />This is awesome since this is my FIRST ATTEMPT AT A MOD.... EVER&#33;\r<br />I know 1000 views doesn&#39;t mean much seeing how roughly 975 (at the moment of writing this) decided not to download this. \r<br />But the fact that that many people decided to drop by and window shop a bit is awesome\r<br />and I also take into account that I only uploaded this at 7:58 pm est TODAY (12/19/13)\r<br />To everyone that stopped by thank you and to everyone who downloaded this, you guys make my day\r<br />and have single handed-ly validated the 9 hours it took for me to both learn to do this and make it happen. thank you and please to everyone else who has yet to download this, give it a go and give me some feedback. \r<br />ALSO&#33; don&#39;t forget to endorse if you like it and to leave a comment and post a pic of you in the armor&#33;\r<br />\r<br />Hello&#33;&#33;&#33;\r<br />\r<br />This mod adds a few new things to skyrim for your enjoyment\r<br />\r<br />1. A new vendor/follower&#33;&#33;&#33;&#33;\r<br />The vendor can be found in fort dawnguard next to the archery targets in the back\r<br />and with the Almost-everyone-is-an-adventurer mod found on the nexus he becomes a leveled to the player companion with 2 unique swords that he dual wields&#33;\r<br />He sells all the armor pieces and is the only way to obtain them at this moment\r<br />\r<br />2. A New armor set&#33;&#33;&#33;\r<br />The Iron Raven Armor set is full ebony light armor with decently balanced stats and may make you slightly op at lower levels... however I&#39;m sure you&#39;ll find that as you progress higher and higher\r<br />the armor begins to really find its niche and you&#39;ll see just how balanced each piece is.\r<br />\r<br />3.A new faction&#33;&#33;&#33;&#33; While currently unjoinable I do plan to eventually (once my skills are up to par) to make it fully joinable with ranks, quests, and an assortment of vampire hunting followers.\r<br />\r<br />To install just move everything to your data folder choose to merge the texture folder and the mesh folder.\r<br />Then tick the esp included in your load order.\r<br />REMEMBER&#33;&#33;&#33;&#33; THIS MOD REQUIRES BOTH DAWNGUARD AND DRAGONBORN\r<br />\r<br />Please understand that while I do stand by my work with confidence I may have made some errors somewhere. \r<br />Also while each part of the armor is individually equipable it may clip with pieces from other armor sets.\r<br />This is not my fault nor can I fix it.\r<br />\r<br />\r<br />Please show some love to mancika and natterforme. Without their permission for the use of their assets you wouldn&#39;t be enjoying this mod I&#39;ve made.\r<br />\r<br />\r<br />I hope I&#39;m not forgetting anything, endorse if this is something you like and thank you for checking it out.\r<br />\r<br />\r<br />\r<br />ALSO&#33;&#33;&#33;&#33;&#33;\r<br />\r<br />Any screenshots you might want to upload of the armor, or the vendor would be greatly appreciated&#33;&#33;&#33;\r<br />\r<br />Here are some mods that enhance this armor or add to the overall theme\r<br />ps. I own none of the mods listed here\r<br />\r<br />DCR shadowbuckler\r<br />http://www.nexusmods.com/skyrim/mods/4330/?\r<br />\r<br />Almost everyone is an adventurer\r<br />http://www.nexusmods.com/skyrim/mods/41629/?\r<br />\r<br />Combat Cross (its the cross in my hand in the pictures)\r<br />http://www.nexusmods.com/skyrim/mods/46902/?\r<br />\r<br />ENJOY&#33;&#33;&#33;\r<br />\r<br />\r<br />-Bluebishop - a.k.a. - Steeleyedblue",
  "categoryId": "54",
  "version": "v1.0",
  "author": "BlueBishop",
  "createdUnix": "1387501132",
  "updatedUnix": "1387498366",
  "containsAdultContent": false,
  "uploadedBy": "bluebishop",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087485",
      "name": "Iron Raven v1",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34400",
      "fileName": "Iron Raven v1-48985-v1-0.7z",
      "uploadedUnix": "1387498366",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6f15a370885d663c6fb439bed0161283dc9660338dcc64e16bb2a8dc685edcea/analysis/1407849647/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Iron%20Raven%20v1-48985-v1-0.7z?fid=1000087485&ttl=1535829473&ri=8192&rs=8192&setec=2cddab4f793ab149020980a3e3e87d38"
    }
  ]
}