{
  "modId": 49006.0,
  "modName": "Nettlewreath Shack",
  "summary": "A starter home situated on the shores of Lake Ilnata, ideally themed for an Alchemist or Hunter.\r<br />Not a large home, and not overly opulent, but has nice features for those looking for something minimal rather than extravagant. ",
  "descriptionHtml": "REQUIRES:  HEARTHFIRE, DAWNGUARD AND DRAGONBORN TO FUNCTION PROPERLY.\r<br />\r<br />This housing mod places a small minimalist home themed around an Alchemist, though it \r<br />could also be suitable for hunters or hermit mages as well.  \r<br />You’ll find it situated on the shores of Lake Ilnata, just South of the Lady Stone and far \r<br />West of Riverwood if you follow the road to Falkreath.  The site features a grand view of \r<br />the misty lake which can be seen from the shack’s porch or from the firepit near the exterior oven.\r<br />An exterior greenhouse for planting alchemical herbs or humble crops is fully functional \r<br />and a tanning rack with leather storage is placed near the main entrance of the home.  \r<br />\r<br />Interior features include a fully navmeshed area for followers.  \r<br />A Kitchen complete with Cooking Pot and Storage (please note that ALL barrels and burlap \r<br />sacks inside and outside the premises are NOT safe for storage.)  \r<br />\r<br />An alchemy nook with plenty of organised storage space.\r<br />\r<br />Two Weapon Racks near the main entrance.  \r<br />\r<br />Plenty of chests, shelves, wardrobes, knapsacks and end tables to store gear, books and supplies.  \r<br />\r<br />I don’t see it necessary, but if people desire it, I may add a basement to the property. \r<br />\r<br />\r<br />The home is designed to be a starter home or something in mind for those tired of seeing \r<br />overly extravagant features in their dwellings.  As such, players who are devoted Collectors of \r<br />unique items in the game, won’t find a lot of space to showcase their trophies.  I may upgrade \r<br />the place into something bigger, but that will be a separate mod for another time.",
  "categoryId": "67",
  "version": "Latest",
  "author": "Sundaysmile - Deacon",
  "createdUnix": "1387556235",
  "updatedUnix": "1387556230",
  "containsAdultContent": false,
  "uploadedBy": "Deacon87",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087572",
      "name": "Nettlewreath Shack",
      "version": "Latest",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "116",
      "fileName": "Nettlewreath Shack-49006-Latest.rar",
      "uploadedUnix": "1387556230",
      "modVersion": "Latest",
      "virusScanUrl": "https://www.virustotal.com/file/bdf7de558dd343489d5287be3e6e5cb76c37ab2a91dec8b27cfcb43b38ca5311/analysis/1407850324/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nettlewreath%20Shack-49006-Latest.rar?fid=1000087572&ttl=1535829511&ri=8192&rs=8192&setec=a3207d0560688a9af4f70af0bc1f7ba1"
    }
  ]
}