{
  "modId": 49017.0,
  "modName": "LOT -- The Effects of Alchemy",
  "summary": "A small quest that gives you a counter for each ingredient based on the UESP page for alchemy to learn all 56 base effects.",
  "descriptionHtml": "[center][size=44]LOT -- The Effects of Alchemy[/size][/center]\r<br />[size=4]Description[/size]\r<br />This mod adds a book to the game that, when read, starts a quest that will count each of the 56 base ingredients off the list from the UESP.net page for Alchemy.\r<br />\r<br />I made this quest so that I could count the ingredients off in-game. Unfortunately, I cannot guide the player through the potions to make but this will make certain that you have enough of each ingredient on the list for vanilla.\r<br />\r<br />The counter will go on until you have obtained all your ingredients in their max form, for example, the Abecean Longfin requires you to obtain 3. Once you have 3, if you you keep hold of them until you have all others, then you&#39;ll advance to the next step: Finding an Alchemy Workbench to create the potions.\r<br />\r<br />If you drop any, the quest should note this and drop the objective back to active instead of completed.\r<br />\r<br />I wrote the book myself in about 10 minutes, it details a complex list of the ingredients, hence the use of the quest system for tracking. It also details each recipe the player should work through in order to obtain all 56 base effects..\r<br />\r<br />Please be aware, this will not complete your ingredient effect list&#33; It will unlock only the 56 base effects and about 82% of all effects for all ingredients in the game.\r<br />\r<br />This is my first custom quest mod and has taken a great many hours. I would appreciate an endorse if you enjoyed/found this mod useful.",
  "categoryId": "35",
  "version": "v1",
  "author": "LegendOfThunder",
  "createdUnix": "1387579454",
  "updatedUnix": "1387579454",
  "containsAdultContent": false,
  "uploadedBy": "LegendofThunder",
  "primaryFile": null,
  "files": []
}