{
  "modId": 49032.0,
  "modName": "Spellmaking in Skyrim - The Last Altar",
  "summary": "A mod that reintroduces Spellmaking to Skyrim by adding a fully functional Altars of Spellmaking to combine spell effects, adjusting magnitude duration and range, as well as a lore-friendly Fan fiction Questline to retrieve the altar.",
  "descriptionHtml": "[center][size=7]****Important Note****[/size]\r<br />[size=5]When updating to version 1.0.6 or later from existing saves, please remember to use the Reset/Reinitialize Spellmaking option from the MCM Settings menu (or Spellmaking Settings Power for those without skyui) after installing the new version.[/size][/center]\r<br />\r<br />[center][img]http://imageshack.us/a/img547/1619/nsu6.jpg[/img][/center]\r<br />\r<br />[color=#00d9eb]Spellmaking, a lost art of Tamriel\r<br />At the dawn of the 4th era, a silent purging took place; the altars and knowledge of spellmaking throughout the land, vanished. No one knows how or why, and the study of magic itself has limped on through Tamriel ever since.\r<br />But legends tell of the existence of the Last Altar, seemingly untouched by the silent purge.\r<br />\r<br />Now the Dovakiin, newly appointed as Archmage of the College of Winterhold, must piece together the clues of the third Era, unlock the mysteries of the Altar&#39;s location, and unravel a conspiracy 200 years in the making, to control the fate of Magic throughout Nirn.[/color]\r<br />\r<br />[youtube]YqgLXDTVlD8[/youtube]\r<br />\r<br />Change Log\r<br />1.0 intial Release\r<br />************************\r<br />1.0.1\r<br />\r<br />- Fixed Bug with dragon twin quest markers\r<br />- Repaired issue with quest scene dragon not retreating.\r<br />- Issue with dragon quest not starting.\r<br />- Fixed issue where last battle would not progress if boss never entered bleedout before dying. \r<br />------------------------\r<br />1.0.2\r<br />-Fixed Issue with Olmary Dialogue not advancing properly\r<br />-fixed issues with Olenveld scene not advancing properly\r<br />----------------------\r<br />1.0.3 \r<br /> Fixed issue with Archive-packaged script causing glitches throughout the mod.\r<br />---------------------\r<br />1.0.4\r<br />-fixed issue with Dragontwins quest not starting if you had DLC/dragon altering mods\r<br />-fixed issue causing living bomb spells in the right hand to fail.\r<br />-fixed issue causing new dark elf enemy to show as playable race in race menu.\r<br />-fixed Gramatical errors:)\r<br />-fixed issue with the player not being able to drop the Exodus book until the end of the questline.\r<br />-FIXED error causing Last boss scene to trigger early, with no quest progression.\r<br />-fixed issue causing players with dawnguard installed to see the Vralla Phylactery on Olenveld Docks to be floating in midair. rather than on the second floor of inn.\r<br />-fixed issue causing Altar Chargers to be full and unchargeable.\r<br />-fixed issues with Olenveld dragon scene not completing.\r<br />-FIXED issue with Merrari&#39;s Research book texture not appearing in item menu.\r<br />\r<br />---------------------\r<br />1.0.5 \r<br />\r<br />fixed bug in altar causing long duration spell to have extemely high magicka costs\r<br />\r<br />---------------------\r<br />1.0.6\r<br />\r<br />fixed issues with regualar cloaks only doing 1-3 damage.\r<br />fixed Quest progression issues with vralla Dragon twin quest starting. \r<br />Fixed issues with progression of final Scene. \r<br />fixed issue causing some to Experience random CTDs in exterior cells.\r<br />\r<br />---------------------\r<br />1.0.7 \r<br />\r<br />Fixed minor bug preventing Merrari from leaving the college quest progression.\r<br />Fixed script error causing players to have the Altar charger reset to 0 charge after charging.\r<br />\r<br />---------------------\r<br />1.0.8\r<br />-Fixed waterwalking tome sold by Otheral, will correctly allow for waterwalking spell.\r<br />-Fixed issue with skeletal mage spell title and description\r<br />-Fixed issue causing crafted fire and frost runes to not apply damage correctly.\r<br />-Fixed issue causing stone bear spellto not appear as option in regular spellcrafting menu\r<br />-Fixed potential issue with evelyne brolus fight.\r<br />-Fixed issue causing jump spells to persist their effect when loading a savegame.\r<br />-Fixed issue causing magetallaow staff appearing as stolen item.\r<br />-Fixed issue causing muffle effects to cancel other buffs.\r<br />-Fixed issue causing immunity effects to be reported as hostile.\r<br />-Added failsafes to olenveld scene to ensure steady progression.\r<br />-Fixed quest advancement bugs. All quests should run regardless of load status.\r<br />-Otheral&#39;s shard spell should now properly ignore resistances and spell absorption.\r<br />-Fixed bugs causing npc cloaks to cancel abruptly.\r<br />-Fixed clipping issues in keep.\r<br />-Fixed clipping issues in roombounds of olenveld keep cells.\r<br />-Fixed questmarkers throughout mod, quest progression should be much easer to follow.\r<br />\r<br />***************\r<br />\r<br />Special Thanks to pat_sch for helping to pinpoint the quest bugs on the Dragon Twins Quest:)\r<br />\r<br />\r<br />[color=#00d9eb]    As the name implies, this is a mod that seeks to re-introduce spellmaking to skyrim, in all its Spreadsheety glory&#33;&#33;&#33;  \r<br />      It also aims to improve on spell creation by integrating the new spell achtypes in Skyrim. I wanted to make this mod as an answer to my own frustrations at the removal of what was one of my favorite features, and it is the first mod I have made for public use(so go easy on me......)\r<br />The mod also includes a magic-oriented questline to attain the ability to make spells.\r<br />\r<br />The player will be able to combine up to 4 effects on a single spell, and select the magnitude and duration and range of each applicable effect.[/color]\r<br />\r<br />[color=#00e1ff][size=6][u][b]The Altar of Spellmaking[/b][/u][/size]\r<br />\r<br />    To elaborate, the mod works like this; you will be able to choose one primary effect (which is how the spell will look and cast) and the combine up to 3 secondary effects onto it, adjusting their magnitude, and duration. I&#39;ve also added a number of new and unique effects to the game to make up for the lack of customizable area. Fireballs that paralyze enemies in their blast radius, runes that apply weakness to magic and fear, Wall/barrier spells that absorb magicka from enemies who cross them, Cloak spells that silence and drain stamina from enemies that get to close,  even  flamethrower spells that make enemies invisible, all are possible with this mod. \r<br />\r<br />    You may ask yourself; “Why would any right-minded mage want a flames spell that would turn an enemy invisible.”\r<br />\r<br />The answer of course is: BECAUSE YOU CAN&#33; It’s your game, get creative, go nuts.\r<br />\r<br />The spell creation system has been designed to eliminate some of the more ridiculous exploits of spell creation from the ground up\r<br />-no consecutive stacking (spellstacking)\r<br />-spells created thru the altar are tied to ALL Magic skills(not just the first effect)\r<br />-perks still upgrade the applicable aspects of your spells\r<br />-higher magnitude and durations to select\r<br />-The ability to delete unwanted spells\r<br />-Customizeable runes, cloaks, sprays, barriers, AOE AND Wards\r<br />Also Spellmaking, though awesome in its potential, is inherently unpredictable; your Crafted spells can mis-cast, backfire, and even kill you outright if you&#39;re not careful. \r<br />\r<br />[size=3]BE WARNED:[/size] the nature of spellmaking makes it more useful to characters with high skill levels and perk investments in magic. also higher level magic characters, will naturally have access to more spell effects both from the original game and those introduced/re-introduced by the mod so more magically-oriented characters will benefit exponentially. \r<br />\r<br />The better you are with magic the more robust and efficient crafted spells will be to cast for you. Gone are the days of whipping up something 6 times more efficient than base game spells with no skill in magic. in many cases (depending on your skill levels and perks), it may be more beneficial to use basegame spells rather than their crafted counterparts until you acquire more proficiency with magic.[/color]\r<br />\r<br />  - for more in depth info on how spell costs are calculated consult the readme file.\r<br />\r<br />\r<br />[color=#ffdd24][size=5][u][b]Temporary Immunity Effects[/b][/u][/size]\r<br />\r<br />    As an optional limitation them to prevent abuse, the mod features Temporary Immunity effects on Paralysis and illusion effects crafted thru spell making. \r<br />\r<br />    The reason for this, is that before you can make a balanced spellmaking system, you need to have balanced base game effects.\r<br />\r<br />    These effects render the victim of such spell effects immune to subsequent applications for a moderate duration (Example: An enemy who has just been paralysed by a crafted spell would become immune to paralysis for 30secs – 2 mins). \r<br />\r<br />    Again, this is an optional limitation, with different durations selectable through the MCM Settings menu. These effects only work with crafted spells, so base game spells would still be viable.[/color]\r<br />\r<br />[color=#23ff34][size=6][u][b]The Questline[/b][/u][/size]\r<br />\r<br />The quest is fully-voiced. It becomes available after the Player has become Archmage of Winterhold, learned there first shout,  and has attained an expert level one school of magic schools of magic. once you&#39;ve achieved these requirements a wood elf courier will find you as you travel the world. \r<br />I wanted the player to get an appreciation for the limits of the magic system before being able to make spells. Also, one of the reoccurring notions in consideration for spellmaking was that in previous games, spellmaking was too accessible for all characters and play styles from the GO. \r<br />The quest does require a high proficiency in magic and has been made very challenging for this reason. Expect enemies to use silence, paralyse, weakness to magic/fire frost shock, and summon small armies to keep you from reaching the altar. Good magic resistance is a must.\r<br />\r<br />For those who would prefer skip the questline, their is a cheat:[/color](click and drag mouse over empty space to show)\r<br />\r<br />[color=#333333]open the console and enter: SETSTAGE KSMQ10 3 you will be given a quest, a series of books on Spellmaking, and a spell. follow the MARKER to the location and cast the last Altar spell.  [/color]\r<br />\r<br />[color=#23ff34]\r<br />[b]Features:[/b]\r<br />-   A new and hidden worldspace\r<br />-   Lethal magic - based enemy encounters, \r<br />-   2 new shouts\r<br />-   5 new dungeons\r<br />-   Easter egg hunts for new effects...[/color]\r<br />\r<br />\r<br />[color=#DBb900][size=6][u][b]Spells Confirmed in and integrated with spellmaking(so far)[/b][/u][/size]\r<br />\r<br />[size=4][u][b]Destruction effects[/b][/u][/size]\r<br />-All destruction effects for fire frost and shock\r<br />Runes, cloaks, walls sprays, master, ranged, AND ranged aoe,\r<br />\r<br />Damage Health\r<br />Damage Magicka\r<br />Damage Stamina\r<br />Weakness to Magic\r<br />Weakness to Fire\r<br />Weakness to Frost\r<br />Weakness to Shock\r<br />Weakness to Poison\r<br />\r<br />\r<br />[b]New:[/b] High-Powered spells Archetypes,\r<br />[b]New:[/b] Targeted blizzard \r<br />[b]New:[/b] Flamestrike \r<br />[b]New:[/b] Corona\r<br />[b]New:[/b] Thunderbomb, \r<br />[b]New:[/b]Chain Lighning Storm, \r<br />[b]New:[/b]channeled blizzard, \r<br />[b]New:[/b]controlled blizzard.\r<br />\r<br />[size=4][u][b]Restoration Effects[/b][/u][/size]\r<br />\r<br />Turn undead\r<br />Fortify\r<br />Fortify health\r<br />Fortify health regen\r<br />Fortify Magicka\r<br />Fortify Magicka regen\r<br />Fortify Stamina\r<br />Fortify Stamina regen\r<br />Fort skill (All, with the exception of magic skills)\r<br />\r<br />Absorb health\r<br />Absorb magicka\r<br />Absorb stamina\r<br />Wards\r<br />master spells\r<br />New: guardian wards\r<br />Restore\r<br />Close wounds\r<br />Grand healing\r<br />Heal other\r<br />\r<br />[size=4][u][b]Illusion Effects[/b][/u][/size]\r<br />\r<br />invisiblity\r<br />Light\r<br />Fear (all types)\r<br />Fury (all types)\r<br />Pacify (all types)\r<br />Rally (all types)\r<br />Muffle\r<br />Silence\r<br />NEW: Sleep\r<br />New: Hatred\r<br />New: mind control\r<br />New: Living Bomb\r<br />\r<br />[size=4][u][b]Conjuration Effects[/b][/u][/size]\r<br />\r<br />Soul trap\r<br />Banish Daedra\r<br />Command Daedra\r<br />Reanimate\r<br />Dremora Lord\r<br />Frost Atronach\r<br />Fire Atronach\r<br />Storm Atronach\r<br />New: 12 hidden summons\r<br />New:  Ring of the Ethereal\r<br />New: CUSTOM teleport spells\r<br />Blink, BlinkStrike, stone Escape, and Remote recall\r<br />\r<br />[size=4][u][b]Alteration Effects[/b][/u][/size]\r<br />\r<br />Shields (armor)\r<br />Light\r<br />Resist Fire\r<br />Resist Frost\r<br />Resist Shock\r<br />New: jump, haste, slowfall\r<br />feather(fortify carry)\r<br />And hidden customizable effects and Weapons As well...[/color]\r<br />\r<br />[color=#dd33cc][size=6][u][b]Limitations of Spellmaking[/b][/u][/size]\r<br />\r<br />Exclusivity\r<br />\r<br />With the exception of Ritual or Master level Spells, Crafted Spells are Cast-source exclusive; this means that a spell Crafted for your left hand can ONLY be cast from your left hand, and vice versa for your right. Keep this in mind when choosing the cast source of your spell.\r<br />\r<br />Spell limits and Archetypes\r<br />\r<br />There is a limit to the number of spells one can learn of the Same Archetype per casting source. \r<br />For instance, a fireball spell has an Archetype limit of 6 this means you can use a fireball as the primary effect for a spell 12 times (6 for your left hand and 6 for your right). Runes are more complex and thus have an archetype limit of 3; this means a total of six different crafted spells can be made using one type of rune. Etc\r<br />Consult the spell details for info on Achetype limits for each spell.\r<br />\r<br />There is also currently a limit to the number of crafted spells your player can learn of 54.  At this point you will have to delete spells before creating new ones. [/color]\r<br />\r<br />\r<br />================\r<br />1. INSTALLATION\r<br />================\r<br />\r<br />THIS MOD REQUIRES THE LATEST VERSION OF SKYRIM SCRIPT EXTENDER (SKSE)\r<br />\r<br />- Extract folder &#34;Data&#34; into your Skyrim root directory, which is the folder where your TESV.exe is located.\r<br />\r<br />- Run Skyrim launcher and make sure the KhalSpellmakingMod.esp is activated.\r<br />Always run in a &#34;clean&#34; save. \r<br />\r<br />\r<br />==============================\r<br />2. UPGRADING TO NEW VERSIONS\r<br />==============================\r<br />\r<br />   THE MOD SHOULD BE ABLE TO SUPPORT UPGRADES WITHOUT REQUIRING A &#34;clean&#34; save, but the mod also includes a reset feature, available through the settings power of MCM settings menu.  Upon updating, remember to use this feature. Updates on this may follow with subsequent versions.\r<br />\r<br />\r<br />=====================\r<br />3. UNINSTALATION, \r<br />=====================\r<br />\r<br />To uninstall the mods exit game and deactivate KhalSpellmakingMod.esp in your load order.\r<br />\r<br />For those who wish to uninstall from ongoing savesgames.\r<br />\r<br />-Enter a save where you wish to uninstall the mod and use the uninstall Spellmaking feature in the settings power or the MCM Menu of the mod.  \r<br />-Confirm the save once the completion message is displayed. From here you can exit game and deactivate the mod in your load order.\r<br />\r<br />***Note it is NEVER a good idea to uninstall mods and continue using saves in this way, so results may vary.\r<br />\r<br />\r<br />[size=6][u][b]MCM Support[/b][/u][/size]\r<br />\r<br />This mod also feature an MCM Based Spellmaking menu, with sliders and drop menus for those who prefer to see changes to their spells real-time.\r<br />\r<br />\r<br />[size=6][u][b]Customizing Spellmaking (FISS Required)[/b][/u][/size]\r<br />\r<br />Balancing this mod has been something of a nightmare. and I still don’t feel it is perfect, so the mod also comes with a rebalancing feature for those less skittish about numbers. The mod comes packaged with a text file, (KSMBaseCosts.xml) that includes the base costs for each effect in the spellmaking system.  You can tweak base costs in this file, and load them using the SpellCost Adjustment feature in the mod or MCM settings menu. You can also restore the default settings from the menu as well.\r<br /> This Feature Requires FileAccess Interface for Skyrim Scripts (Fiss.esp), and can be downloaded with instructions [url= http://www.nexusmods.com/skyrim/mods/48265/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D48265%26preview%3D&pUp=1 ]here[/url]. \r<br />\r<br />[size=4][b][u]Load order[/u][/b][/size]\r<br />\r<br />If you plan to modify the base cost values, the mod should be loaded after FISS.esp.\r<br />\r<br />Skyrim.esm\r<br />*....\r<br />*....\r<br />FISS.esp\r<br />*...\r<br />TheLastAltar.esp\r<br />\r<br />[color=#ff2300][size=6][b][u]Possible Conflicts[/u][/b][/size]\r<br />\r<br />This mod makes use of unused player actor values. It will conflict with any mod that uses these values on the player:\r<br />\r<br />BYPASSVENDORKEYWORDCHECK\r<br />BLINDNESS   \r<br />ENERGY\r<br />fAVORPOINTSBONUS   \r<br />VARIABLE05\r<br />VARIABLE04\r<br />VARIABLE07\r<br />VARIABLE08\r<br />VARIABLE10\r<br />VOICEPOINTS   \r<br />BYPASSVENDORSTOLENCHECK\r<br />vARIABLE01   \r<br />VARIABLE02\r<br />vARIABLE03\r<br />VARIABLE06\r<br />VARIABLE09 \r<br />\r<br />This mod is confirmed compatible with Third era Attributes.\r<br />\r<br />The mod uses its own resources and does not change or altar any of the base game spells, enchantments or effects.\r<br />\r<br />\r<br />[size=4][b][u]Known issues[/u][/b][/size]\r<br />\r<br />\r<br />[b]Note:[/b]  Followers will not return home if dismissed in the new world space, and will remain where they were dismissed.\r<br />\r<br />-Some Surfaces in the new worldspace will cause summons to fail when cast upon.\r<br />\r<br />-Naming Spells produces Random letter Capitalizations. Still looking into resolving this issue.\r<br />\r<br />[size=5]BIG NOTE:[/size] [size=3][b]Crafted Spells Are designed to be integrated into the BASE GAME Magic PERK SYSTEM. This means that any mods that dramatically change/ rebalance the Perk layout of magic skills system may have effects on the magnitude and durations of crafted spells. if your spells are doing vastly increased damage/healing magnitudes, this is the most likely reason.\r<br />\r<br /> I will be working on new plugins and FISS files that can be loaded for rebalancing with the more popular overhauls  but for now, YOU HAVE BEEN WARNED. [/b][/size]\r<br />[/color]\r<br />\r<br />\r<br />Currently working on:\r<br />-Resolving quest and Altar bugs\r<br />-Patches for SkyRe(to confirm fucntionality with new perks), SPERG,  AND SkyPE.  \r<br />-Confirming if patches are necessary for requiem and ACE Magic.\r<br />\r<br />[center][color=#fffd00][size=6][b][u]Credits[/u][/b][/size]\r<br />\r<br />[size=6][b][u]Voice Talents[/u][/b][/size][/color]\r<br />[size=4]\r<br />[b]Anna Castiglioni (Anduniel)[/b] [color=#dbb100]as[/color] [b]Olmary[/b]   [url=http://tesalliance.org/forums/index.php?/topic/6143-anduniels-archive/]http://tesalliance.org/forums/index.php?/topic/6143-anduniels-archive/[/url]\r<br />[b]Christine Slagman[/b] [color=#dbb100]as[/color] [b]Mistress Vralla[/b] and [b]Evelyne[/b]\r<br />[b]Mark Enticknap[/b] [color=#dbb100]as[/color] [b]Otheral[/b][url=http://www.themarkenticknap.com]www.themarkenticknap.com[/url] \r<br />[b]Matthew Wade[/b] [color=#dbb100]as[/color] [b]Magelord Gavos[/b]   [url=http://www.matthewwade.co.uk/]http://www.matthewwade.co.uk/[/url]\r<br />[b]Nathan Marlowe[/b] [color=#dbb100]as[/color] [b]Commander GunGhol[/b], [b]Ontnan[/b] and [b]Erandur[/b]\r<br />[b]RiliththeRogue[/b] [color=#dbb100]as[/color] [b]Ugrul-Gro-Shak[/b]\r<br />[b]Vulon[/b] [color=#dbb100]as[/color] [b]Lord Bangral[/b] and [b]Sadril[/b][/size][/center]\r<br />\r<br />[color=#ffdd00][center][size=6][b][u]Special thanks to:[/u][/b][/size][/center]\r<br />\r<br />[size=4][center]Bethesda for making an awesome game&#33;[/center][/size]\r<br />[/color][center][color=#ffdd00]\r<br />[size=6][b][u]These folks for help with the CK and Scripting:[/u][/b][/size]\r<br />\r<br />Cipscis\r<br />Justinother\r<br />BigBadDaddy\r<br />DienesToo\r<br />s70\r<br />egocarib\r<br />Mojo22\r<br />Skyviper\r<br />\r<br />\r<br />[size=4][b][u]And these folks for the wealth beneficial insights of their posts.[/u][/b][/size]\r<br />\r<br />[size=3]TheGreatSquare\r<br />Otheral\r<br />Gorbadps3\r<br />Merari[/size]\r<br />[size=4][b][u]And last but not least...[/u][/b][/size]\r<br />\r<br />[size=3]Xarnac the Conqueror[/size][/color][/center]\r<br />\r<br />[size=6][center]*******Don&#39;t be Coarse,  Please COMMENT&#33;&#33;******** :)[/center][/size]&lt;======This sounded so much cooler in my head:(",
  "categoryId": "75",
  "version": "1.0.8",
  "author": "KhalEdos",
  "createdUnix": "1389170590",
  "updatedUnix": "1392286945",
  "containsAdultContent": false,
  "uploadedBy": "KhalEdos",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090435",
      "name": "The Last Altar Initial Release",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "65067",
      "fileName": "The Last Altar Main File-49032-1-0.7z",
      "uploadedUnix": "1389156357",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/02252dffe0111a32e4bfae462d498ab7bbd5a94c6e1c9f051d88cb3d741cee68/analysis/1407877236/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar%20Main%20File-49032-1-0.7z?fid=1000090435&ttl=1535829550&ri=8192&rs=8192&setec=5ebdd7139a72f4d2e8d2151826ebe68c"
    },
    {
      "fileId": "1000091249",
      "name": "The Last Altar-1-0-1",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "52833",
      "fileName": "The Last Altar Main File-49032-1-0-1.7z",
      "uploadedUnix": "1389569016",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/535a05da7a17e38648012343a0871fe31a6843be2cbefb06648fd78c403a6e20/analysis/1407884127/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar%20Main%20File-49032-1-0-1.7z?fid=1000091249&ttl=1535829550&ri=8192&rs=8192&setec=6a10e9e2baa3bc65b2076840bb8f19ed"
    },
    {
      "fileId": "1000091347",
      "name": "The Last Altar-1-0-2",
      "version": "1.0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "52820",
      "fileName": "The Last Altar-1-0-2-49032-1-0-2.7z",
      "uploadedUnix": "1389632733",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/c83f162582d3e6865f93268efe21e656c6e2bbde1a690724bd41c92d8ce8d124/analysis/1407884968/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar-1-0-2-49032-1-0-2.7z?fid=1000091347&ttl=1535829551&ri=8192&rs=8192&setec=70a1c649f135fae0d5fc13a614f47b0a"
    },
    {
      "fileId": "1000091370",
      "name": "The Last Altar-1-0-3",
      "version": "1.0.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "54361",
      "fileName": "The Last Altar-1-0-3-49032-1-0-3.7z",
      "uploadedUnix": "1389654814",
      "modVersion": "1.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/2af11b4eb55f4a5c5d4fa25f5c48afaf1783eef0aafbe0ec05850f22c09b5f7f/analysis/1407885150/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar-1-0-3-49032-1-0-3.7z?fid=1000091370&ttl=1535829551&ri=8192&rs=8192&setec=019807710a91492a2fc2e965e67ff5e4"
    },
    {
      "fileId": "1000092841",
      "name": "The Last Altar 1-0-4",
      "version": "1.0.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "54437",
      "fileName": "The Last Altar Main File-49032-1-0-4.7z",
      "uploadedUnix": "1390442130",
      "modVersion": "1.0.4",
      "virusScanUrl": "https://www.virustotal.com/file/a55bb0ffe467fb1623fb9c6257d4fc09864d828bb08bdade12b374500139cd86/analysis/1407897742/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar%20Main%20File-49032-1-0-4.7z?fid=1000092841&ttl=1535829552&ri=8192&rs=8192&setec=19b380db3b025838c157f10744d977a5"
    },
    {
      "fileId": "1000093230",
      "name": "The Last Altar 1-0-5 patch",
      "version": "1.0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2331",
      "fileName": "The Last Altar 1-0-5 patch-49032-1-0-5.7z",
      "uploadedUnix": "1390614348",
      "modVersion": "1.0.5",
      "virusScanUrl": "https://www.virustotal.com/file/c805c9aec4a48cca79002c9cb14f80ecdd4540bda8ccd8f5624ce0d4181cbd27/analysis/1407900499/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar%201-0-5%20patch-49032-1-0-5.7z?fid=1000093230&ttl=1535829552&ri=8192&rs=8192&setec=023edc956085a01a6babf631b0e5a6b6"
    },
    {
      "fileId": "1000093234",
      "name": "The Last Altar 1-0-5",
      "version": "1.0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "54439",
      "fileName": "The Last Altar 1-0-5-49032-1-0-5.7z",
      "uploadedUnix": "1390616975",
      "modVersion": "1.0.5",
      "virusScanUrl": "https://www.virustotal.com/file/6944ec09c309029fcdebb9520efc339767394006e29ee33fc6ee48bf8d419061/analysis/1407900570/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar%201-0-5-49032-1-0-5.7z?fid=1000093234&ttl=1535829552&ri=8192&rs=8192&setec=64b4d6af13a0cac8e6465806ef7d1aa5"
    },
    {
      "fileId": "1000093606",
      "name": "The Last Altar 1-0-6 patch",
      "version": "1.0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2534",
      "fileName": "The Last Altar 1-0-6 patch-49032-1-0-6.7z",
      "uploadedUnix": "1390771284",
      "modVersion": "1.0.6",
      "virusScanUrl": "https://www.virustotal.com/file/12ff4abff34bb95a07b3cddd27ba85ccfeecc5bd0d11a62dcee8eaaf55fc33d4/analysis/1407903429/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar%201-0-6%20patch-49032-1-0-6.7z?fid=1000093606&ttl=1535829553&ri=8192&rs=8192&setec=8bf2eb42e4bbf6fa92741990e7b0e246"
    },
    {
      "fileId": "1000093609",
      "name": "The Last Altar 1-0-6",
      "version": "1.0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "54422",
      "fileName": "The Last Altar 1-0-6-49032-1-0-6.7z",
      "uploadedUnix": "1390772106",
      "modVersion": "1.0.6",
      "virusScanUrl": "https://www.virustotal.com/file/4450c306ff2c665509033345808534b5c58ee75ea5e40914fe3fa60de3b646cb/analysis/1407903477/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar%201-0-6-49032-1-0-6.7z?fid=1000093609&ttl=1535829553&ri=8192&rs=8192&setec=8ce08b588f3f8ce7a9264b927f3532e1"
    },
    {
      "fileId": "1000094394",
      "name": "The Last Altar 1-0-7 patch",
      "version": "1.0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2356",
      "fileName": "The Last Altar 1-0-7 patch-49032-1-0-7.7z",
      "uploadedUnix": "1391144007",
      "modVersion": "1.0.7",
      "virusScanUrl": "https://www.virustotal.com/file/a30affa312e84b36a6dabb00418512456c1cdb4e3249b63cd1624dbac3437ec8/analysis/1407910326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar%201-0-7%20patch-49032-1-0-7.7z?fid=1000094394&ttl=1535829554&ri=8192&rs=8192&setec=bb07a1b6626cb3727b2ece7b14a90583"
    },
    {
      "fileId": "1000094395",
      "name": "The Last Altar 1-0-7",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "54440",
      "fileName": "The Last Altar 1-0-7-49032-.7z",
      "uploadedUnix": "1391145694",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c6747c12f88bd131945389e2bfa0d373c318e1d4458bac004d67debc83967d46/analysis/1407910344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar%201-0-7-49032-.7z?fid=1000094395&ttl=1535829555&ri=8192&rs=8192&setec=154fd82630b36705b88960004f6120d9"
    },
    {
      "fileId": "1000096836",
      "name": "The Last Altar 1-0-8",
      "version": "1.0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54456",
      "fileName": "The Last Altar 1-0-8-49032-1-0-8.7z",
      "uploadedUnix": "1392286686",
      "modVersion": "1.0.8",
      "virusScanUrl": "https://www.virustotal.com/file/8256624b023e783ef159df24480f345309c5a3b9f43cee6f1fba5f2a14865cdc/analysis/1407931772/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar%201-0-8-49032-1-0-8.7z?fid=1000096836&ttl=1535829555&ri=8192&rs=8192&setec=66d3d5baf65f3319d4bf1d05c91fbc5f"
    },
    {
      "fileId": "1000096837",
      "name": "The Last Altar 1-0-8 patch",
      "version": "1.0.8",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "2535",
      "fileName": "The Last Altar 1-0-8 patch-49032-1-0-8.7z",
      "uploadedUnix": "1392286945",
      "modVersion": "1.0.8",
      "virusScanUrl": "https://www.virustotal.com/file/e653f46adb6cd3886f889a709f0a02fe12341e6a8d5f322912b92be12f1349d9/analysis/1407931775/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Altar%201-0-8%20patch-49032-1-0-8.7z?fid=1000096837&ttl=1535829555&ri=8192&rs=8192&setec=e34af2e61b3485236eaef3d82986ceef"
    }
  ]
}