{
  "modId": 49037.0,
  "modName": "Improved Lower Hrothgar",
  "summary": "Medium sized player-home. Everything is nicely placed, warm lights, storage for you and your follower. Containers are labeled for easier storage/finding. Take a look for more information.",
  "descriptionHtml": "[center]Description updated: May 8, 2017\r<br />\r<br />Please use [url=http://forum.valixx-online.de]my forum[/url] for support. Thank you.[/center]\r<br />\r<br />[center][url=http://twitter.com/ValixxOnline][img]http://valixx-online.de/wp-content/uploads/2017/04/twitter-small.png[/img][/url][url=http://facebook.com/ValixxOnline][img]http://valixx-online.de/wp-content/uploads/2017/04/facebookLogo-small.png[/img][/url][/center]\r<br />\r<br />\r<br />A modest home gifted to the Dragonborn studying under the tutelage of the Greybeards. Set into the mountain side the home is a short distance from High Hrothgar and Ivarstead. This is an improved version of the mod by en3raider. Permission and approval is given. Thank you again. :)\r<br />\r<br />Take a look on the changelog to see what has changed between his and my version.\r<br />\r<br />\r<br />\r<br />[b]v1.1.1[/b]\r<br />\r<br />Added a sharpening wheel to the crafting room.\r<br />\r<br />[b]v1.1.0[/b]\r<br />\r<br />The crafting room is now bigger&#33;\r<br />\r<br />Added a new container for Crossbows. You can find it near the container for Bows ( Crafting Room ).\r<br />Added a new container for Crossbow Ammo.\r<br />Added a new container for Paragons ( Dawnguard Items )\r<br />Added a new container for Rings. ( Armory Room )\r<br />Added a new container for Circlets. ( Armory Room )\r<br />Added a new container for Crowns. ( Armory Room )\r<br />Added a new container for Necklaces. ( Armory Room )\r<br />Added 6 safe containers to the crafting room.\r<br />Added 8 more mannequins. ( Requested by pithonas, thanks. )\r<br />Added 12 rugs to make it an even more warmer place.\r<br />Added two static greybeards to honor them. They let you live in a home of them afterall. :)\r<br />Added more decorations.\r<br />Added a smelter to the crafting room.\r<br />Added a small table with a note to the main hall.\r<br />Added some idle markers.\r<br />Added a new merchant to the crafting room. Meet Mo&#39;Zah Hannumahni, the Blacksmith & Merchant.\r<br />\r<br />Replaced the book container with an actual book shelf. Your placed books are now visible.\r<br />Replaced some forgotten non-flickering lightings with flickering ones.\r<br />Replaced some rugs.\r<br />Replaced SoVThrone01 with NorThroneShadow. You couldn&#39;t sit on it.\r<br />\r<br />Deleted a plant/decoration to make place for a mannequin.\r<br />Deleted two misplaced light sources.\r<br />\r<br />Fixed position of the Heavy Armor container.\r<br />Fixed position of the Meridia Statue.\r<br />\r<br />[b]v1.0.0[/b]\r<br />\r<br />[INSIDE]\r<br />Fixed a misspelled word of a container.\r<br />Fixed light overlapping. Hopefully no more texture flickering.\r<br />Fixed one light at entrance from FXfireWithEmbersHeavy to FXFireWithEmbersOff.\r<br />Fixed/Added navmesh in some places.\r<br />Fixed the gap outside.\r<br />\r<br />Replaced three FXfireWithEmbersHeavy to FXfireWithEmbersLight at the entrance.\r<br />Replaced the staff container model with the same model as the survival container.\r<br />Replaced the enchanting table. The previous one was not high enough so that the player was not able to lean his hands on the table.\r<br />Replaced some of the plants so that there is more variety.\r<br />Replaced the wall behind the shields to better match the other walls around.\r<br />Replaced some light sources with other ones. ex: DefaultTorch01NS_NoMove to DefaultTorch01NS\r<br />\r<br />Changed one door to inaccessible. It led nowhere.\r<br />Changed the position of four banners to align better with the environment.\r<br />Changed the map marker. Now you can fast travel even if you haven&#39;t discovered it yet.\r<br />\r<br />Increased the radius and brightness of some lightning sources.\r<br />\r<br />Removed one banner. It was a duplication and not needed.\r<br />Removed a misplaced potion floating in the air.\r<br />Removed the bluelightFX above the DaedricArtifacts container.\r<br />Removed fog in some positions.\r<br />Removed 2 benches to replace with 2 display cases.\r<br />Removed one light source near the enchanting table to fix lighting overlapping.\r<br />\r<br />Added fog to some positions.\r<br />Added COC marker to the entrance. ( Console: coc LowHrothgar )\r<br />Added 2 new shelfs with decorations.\r<br />Added a few more sconges.\r<br />Added soil to all the planters. Plants can&#39;t grow without soil.\r<br />Added 2 planters to align nicely to the rest.\r<br />Added 4 lightpedestals with light sources.\r<br />Added a second NobleWallShelf01 with soulgems behind the enchanting table.\r<br />Added 9 more lightning sources for a warmer ambient.\r<br />Added a fireplace infront of the shieldwall.\r<br />Added 2 occlusion planes for performance.\r<br />Added 5 display cases for weapons.\r<br />Added 2 books on a wallshelf near the alchemy station. They act as a container&#33;\r<br />Added a firepit to the crafting room.\r<br />Added some more clutter to the dining table in the middle.\r<br />Added 6 coin purses throughout the mod. Happy Hunting. :)\r<br />Added a statue of Dibella as clutter.\r<br />\r<br />Added a complete new room called &#34;Armory&#34; to the mod. Nicely integrated to match the rest of the mod.\r<br />Added 6 mannequins to the armory.\r<br />Added 4 weapon racks with each 3 holders to the armory. ( 3x4 = 12 weapons )\r<br />\r<br />All light sources with no flickering changed to flickering. ex: Torches.\r<br />\r<br />[OUTSIDE]\r<br />Added a campfire.\r<br />Added four more fire/light sources.\r<br />Added a few more trees.\r<br />Added an empty food barrel.\r<br />Added a road sign to Ivarstead.\r<br />Added a abandoned cart with a human body. Sadly.\r<br />Added some more clutter as decoration.\r<br />\r<br />Removed SkyrimCloudDistant. Casting spells like &#34;Flames&#34; were not proberly shown if used on/in the area with SkyrimCloudDistant.\r<br />\r<br />Note: I&#39;ll probably release an addon to the mod which is aimed for people who use the &#34;Frostfall - Hypothermia Camping Survival&#34; mod.\r<br />\r<br />\r<br />[b]Other Mods[/b]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/48478/]Essential Housecarls[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/33637/]Sapphire Archery Necklace and Ring for Hunters[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/33508/]Hearthfire Items Chest - Materials for building your House[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/32927/]Monaghan Camp - A Hunter&#39;s Shack[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/31462/]Honey Moon Hall[/url]\r<br />\r<br />\r<br />[b]Credits[/b]\r<br />\r<br />en3raider for giving me permission to improve and upload the mod.\r<br />\r<br />\r<br />\r<br />\r<br />In addition to the social profiles above, you can follow me on [url=http://valixx-online.de]my website[/url] and stay tuned for updates and other mods.",
  "categoryId": "67",
  "version": "1.1.1",
  "author": "Valixx",
  "createdUnix": "1387634531",
  "updatedUnix": "1388670302",
  "containsAdultContent": false,
  "uploadedBy": "Fluxec",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089523",
      "name": "Improved Lower Hrothgar",
      "version": "1.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "288",
      "fileName": "Improved Lower Hrothgar-49037-1-1-1.zip",
      "uploadedUnix": "1388670302",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/378a4575db5eebc6c612b9615f4dcebfc537a489f350803849b696e7ea1f669d/analysis/1407868705/",
      "changelogHtml": " Added a sharpening wheel to the crafting room. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Lower%20Hrothgar-49037-1-1-1.zip?fid=1000089523&ttl=1535829564&ri=8192&rs=8192&setec=cd9bd90e962cec1d30b58e08994dd2df"
    }
  ]
}