{
  "modId": 49045.0,
  "modName": "Reforging Magnus",
  "summary": "An immersive method of upgrading the Staff of Magnus from its rather weak vanilla version, to a version worthy of having belonged to the god of magic.",
  "descriptionHtml": "Reforging Magnus is a Staff of Magnus improvement mod with a difference. Rather than simply replace the Magnus effect with a different or more powerful version right off the bat, this mod makes you work to get that bonus. When you first retrieve the staff, you will find it to be the normal vanilla version. However, when you first equip the staff, you will notice and write down an inscription on the staff. This inscription will guide you on how to unlock the staff&#39;s true potential.\r<br />\r<br />==========Installation==========\r<br />\r<br />Just place the files in your Skyrim/Data directory and activate with the Skyrim Launcher or a mod manager.\r<br />\r<br />==========Notice==========\r<br />\r<br />Make sure not to upgrade the staff until after completing the College of Winterhold questline, as the upgraded version cannot interact with the barriers, the eye of magnus, etc. like the vanilla staff can. A fix for this is on the way.\r<br />\r<br />==========Spoilers==========\r<br />\r<br />When you first equip the staff, an Atronarch Forge recipe of sorts is added to your inventory. This recipe tells you to use the staff and ten filled grand or black soul gems in the Atronarch Forge. When you do so, you will recieve a &#34;Powered&#34; version of the staff with the following change:\r<br />\r<br />Absorbs 100 points of magicka from the target per second. When the target is out of magicka, absorbs health instead. Unlimited charges.\r<br />\r<br />Significantly more powerful, and tested to still be balanced (on a level 50 character).\r<br />\r<br />\r<br />When you equip the powered version for the first time, you will recieve another recipe. This one calls for 10 dragon bones/scales. The result is as follows:\r<br />\r<br />Absorbs 100 points of magicka from the target per second. When  the target is out of magicka, absorbs health instead. If used on a dragon, forces the dragon to land. Unlimited charges.\r<br />\r<br />highly useful, especially when used with mods such as Deadly Dragons with its &#34;assault&#34; feature that can lead to significantly more dragon encounters (and the monsters just won&#39;t land sometimes).\r<br />\r<br />==========No Script Version==========\r<br />\r<br />As per user request, I have uploaded a no-script version that removes the script that adds the recipe to your inventory when you equip the staff for the first time. This version is less immersive, as I just put the recipes in a chest in the atronarch forge room, but some users prefer no scripts, so here it is.\r<br />\r<br />==========Future Plans==========\r<br />\r<br />I hope to update this mod for version 2.0 to have unique models for the Powered and Draconic versions of the staff. I have no modeling experience, but if anyone who has created, or who is planning to create, a magnus model replacement mod wishes to give me permission to use their model for this mod, I would be grateful and be sure to credit your models.",
  "categoryId": "55",
  "version": "1.0",
  "author": "LID919",
  "createdUnix": "1387652208",
  "updatedUnix": "1387668389",
  "containsAdultContent": false,
  "uploadedBy": "LID919",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087753",
      "name": "Reforging Magnus",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Reforging Magnus-49045-1-0.7z",
      "uploadedUnix": "1387656732",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/40da58bfff2a0d31c489d553acf3ed575b1affb0b6a8464ee96bad11441a16c0/analysis/1407852022/",
      "changelogHtml": " Initial Version <br/> \n Added script file to archive (mistakenly did not add it) <br/> \n Added no script version as per user request <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Reforging%20Magnus-49045-1-0.7z?fid=1000087753&ttl=1535829580&ri=8192&rs=8192&setec=469e1c9025db53d823280e2e4f5373a8"
    },
    {
      "fileId": "1000087775",
      "name": "Reforging Magnus - No Scripts",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Reforging Magnus - No Scripts-49045-1-0.7z",
      "uploadedUnix": "1387668389",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/00b7d5e5d7e993030b5fcce805f1a8b6f9080a781949024c67d86eac7195a6a2/analysis/1407852077/",
      "changelogHtml": " Initial Version <br/> \n Added script file to archive (mistakenly did not add it) <br/> \n Added no script version as per user request <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Reforging%20Magnus%20-%20No%20Scripts-49045-1-0.7z?fid=1000087775&ttl=1535829580&ri=8192&rs=8192&setec=c322bdfbfdf369363a5bcea1cb0a4565"
    }
  ]
}