{
  "modId": 49058.0,
  "modName": "Draconis Birthright the Revenge of Ninvus",
  "summary": "ever wanted a new land with new npcs? new castle designs? new massive worlds to explore? well this mod might be for you, this mod is still in Alpha settings and is in the process of being transferred over to a new clean ESP that is not filled with error messages for better performance for both you and my self. Draconis Birthright the Revenge of Nin",
  "descriptionHtml": "[IMG]http://i.imgur.com/gTZxtzm.jpg?2[/IMG]\r<br />\r<br />\r<br />_____________________________NEED TO KNOW INFO FOR THIS TO WORK______________________\r<br />1). you NEED DAWNGUARD, DRAGONBORN, and HEARTHFIRE\r<br />\r<br />2). In order to get to the world spaces in order to cut down on any chance of a open world conflict you must Press ~, then type coc qasmoke this will take you to the dev testers room ( the cheat room) look for the dawnguard style portal door.\r<br />\r<br />3) the 1st island has a working would map there is currently 1 other area on that would map from the other mod i am bringing them over 1 by one. i have part of the Brahven city up. \r<br />4). once i add a few monsters i will be adding a new door at the central door location. this will ensure that you can Look at each one and marvel in how sexy they are.. also beware for the NPC known as Child of Oblivion... now you will feel even more gulty killing a demon possessed \r<br />\r<br />[size=200]Draconis[color=red][b]Birthright[/b][/color]The Revenge of Ninvus[/size]\r<br />\r<br />This mod Will aim to bring new life into skyrim with 4 brand new world spaces, new creatures, new building meshes, and much much more. i am Ironriverskyrim and i bring you Draconis Birthright: The Revenge of Ninvus&#33;\r<br />\r<br />[size=200]the story[/size]\r<br />\r<br />   The story for my mod is going to be a grand epic. you might be wondering &#34; ironriver what do you mean?&#34; well what makes a good story? i will tell you, Drama, Plot Twists, Moral confusing choices that will leave you thinking on their outcomes for days to come. me and our writers are working hard to bring you a very long and engaging story we hope and plan to add a good 60-150 hours of repeatable game play to the world of skyrim. and like any good adaptation we are going to stick as close to the lore of skyrim as possible while also sticking out as our own thing.\r<br />\r<br />[size=200]FAQ[/size]\r<br />\r<br />Q: how long until you are finished with the landscaping?\r<br />A: it will be one of the 1st things to be finished\r<br />\r<br />Q: when will you be adding those NPC in the pictures?\r<br />A: i will be adding them into a new testing interior base on each type of creature (example: the undead that use the dragon priest files will be in a different room than the dwarven creatures)\r<br />\r<br />Q: can we use anything from your mod for our own?\r<br />A: yes and no, no you may not use my mod items but yes you may use the modders resources i used in the credits tab near the end of this page.\r<br />\r<br />Q: if we need help putting these monsters into our own mod will you make a video showing us how?\r<br />A: no, because i have nothing to make a video with but i will give you a very easy down tutorial i was given that helps true noobs at modding. say thank you to ironman5000 creator of the monster wars and monster mod for that tutorial ill put up soon.\r<br />\r<br />[size=200]Special thanks[/size]\r<br />\r<br />Ninvus: bro you will be missed this mod if for you man&#33;&#33; rest in peace\r<br />\r<br />Ironman5000: for giving me a very easy to use tutorial for adding new creatures into the creation kit and allowing them to be placed in the world\r<br />Vicn: for his creature resources give this a look if you want them&#33; - http://www.nexusmods.com/skyrim/mods/37413/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D37413%26preview%3D&pUp=1\r<br />Chiaro22: for his awesome world space help \r<br />Stroti: for their many modders resource&#39;s - link will be posted shortly\r<br />- \r<br />Kraeten: for his griffon fortress resource&#33; - Link will be posted shortly\r<br />_____________________Other credits________________________________________\r<br />\r<br />Enhanced Character Edit by ECE Team\r<br />\r<br />Hair packs of TES IV Oblivion for Female Only by Radioragae\r<br />REN\r<br />Peggy\r<br />NewSea\r<br />SKS\r<br />\r<br />DIMONIZED UNP female body by dimon99\r<br />\r<br />[size=200]my old mod link[/size]\r<br />\r<br />[url]http://www.nexusmods.com/skyrim/mods/48666/?[/url]\r<br />\r<br />\r<br />________________________________[size=200]CONTEST[/size]_______________________________________\r<br />\r<br />also i am adding a contest for this mod. if you can make a lore friendly type city or small town to add to this ( by lore friendly i mean nothing so out of control like you would find in an anime city) the winner of the contest i will buy for them any of the three dlc&#39;s for skyrim Dawnguard, Hearthfire, and Dragonborn\r<br />\r<br />total of cities or towns i will add are __3__ the top 3 castles or towns will be added and rewarded with DLC from skyrim or and PC game see rules for more info&#33;\r<br />\r<br />\r<br />_____________________RULES__________________________\r<br />\r<br />1) you must make the outside and inside of the castle or town. landscapes are not needed just the castle or town\r<br />2) do not steal from a mod and send it to me. i WILL be checking the mods that are not master files\r<br />3) if you own a mod that has a large castle or town in it do not send me it. example- become king of riverhelm if he sent that to me for my mod i would decline it. you must make it from scratch.\r<br />4) there is not time limit for this conest it will end once i finish the mod.\r<br />5) you cannot pick a MMO DLC or other game like an MMO. stick with steam games like skyrim or fallout or what ever.\r<br />6) (optional) send me a message via private chat if you want to give me a heads up saying &#34;hello ironriverskyrim&#33; i would like to make a town or castle for your mod, i am working on it now &#34; messages like this will let me know if you are truly interested in competing and will allow me to track your name for when you send it to mw i know to add a browny point to your score&#33;\r<br />7) be creative but still friendly to the lore, any type of city will work. also if you make your own building meshes and objects via other programs that adds a bigger chance for you to win.\r<br />\r<br />_________________________________Contact info_________________________________\r<br />my mod yahoo account info is\r<br />\r<br />ironriverskyrim@yahoomail.com\r<br />\r<br />[size=200]________________Update Info___________________[/size]\r<br />\r<br />Read the Sticky in the comments section. it will be released sometime in January. \r<br />  We want to release as much as possible each update.\r<br />\r<br />---- every once in a while you will see a DO NOT DOWNLOAD file added to the files section. please do not download it. it may or may not ruin a save game. and the     Oogoar modding Team     are not responsible for any error&#39;s you get to your save game if you download the ones marked as &#34;DO NOT DOWNLOAD&#34; \r<br />\r<br /> also it is recommended not just for my mod but for all mods to use the tool here on the nexus called &#34;Mod Organizer&#34; it will save your life. and install mods in a new folders out of your skyrim folder for safety. and also helps with some pesky mods that clash with other mods and helps most of them work.\r<br />",
  "categoryId": "30",
  "version": "Alpha",
  "author": "IronriverSkyrim",
  "createdUnix": "1387710203",
  "updatedUnix": "1387709817",
  "containsAdultContent": false,
  "uploadedBy": "Ironriverskyrim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087835",
      "name": "Draconis Revenge of ninvus_001",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "112543",
      "fileName": "Draconis Revenge of ninvus_001-49058-.zip",
      "uploadedUnix": "1387709817",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b43ccabfcfd96576d76236ecd45caaa50d80a3a48b3ee67ef79d28f3262c5fec/analysis/1407852773/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Draconis%20Revenge%20of%20ninvus_001-49058-.zip?fid=1000087835&ttl=1535829603&ri=8192&rs=8192&setec=996cd986b3a76b45460595a62624b53c"
    }
  ]
}