{
  "modId": 49056.0,
  "modName": "Stackable Stones of Barenziah with Optional Quest Markers",
  "summary": "This mod is an overhaul of No Stone Unturned using the magic of SKSE that allows the Stone(s) of Barenziah to stack properly in your inventory.  No longer shall &#34;Stone of Barenziah&#34; occupy multiple rows&#33;  Because many players appreciate quest markers on their stones, I have also made quest markers optionally available via an MCM menu.",
  "descriptionHtml": "[b][color=#1e84cc][size=4]OVERVIEW[/size][/color][/b]\r<br />\r<br />This mod overhauls the No Stone Unturned quest using SKSE functions to allow the Stone(s) of Barenziah to stack properly in your inventory. Because quest markers on the Stones of Barenziah are also fairly popular, and this mod won&#39;t be compatible with other mods that add quest markers, I took the liberty of adding them, too. They&#39;re optional, and can be enabled and disabled via an MCM menu or by setting the value of a global variable at the console.\r<br />\r<br />[color=#1e84cc][size=4][b]REQUIREMENTS[/b][/size][/color]\r<br />\r<br />[list=1][*]SKSE[/*]\r<br />[*]SkyUI 4.1 (for the Mod Configuration Menu)[/*]\r<br />[/list]\r<br />[b][color=#1e84cc][size=4]LOCALIZED VERSIONS\r<br />[/size][/color][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/62996/]German[/url] - 9Strike\r<br />\r<br />[b][color=#1e84cc][size=4]INSTALLATION\r<br />\r<br />[/size][/color][/b]I DO NOT recommend installing this mod on an existing save, as it modifies start game enabled quest scripts.  Only install before starting a new game.  As brought up in the comments, this goes for updating to the new version, as well.\r<br />\r<br />Recommended: install and uninstall with NMM.\r<br />\r<br />To install manually, copy SSoB.esp and SSoB.bsa to your Skyrim/Data directory.  To uninstall manually, remove those two files.\r<br />\r<br />[b][color=#1e84cc][size=4]USAGE[/size][/color][/b]\r<br />\r<br />To enable quest markers, use the MCM menu (called &#34;SSoB,&#34; for &#34;Stackable Stones of Barenziah&#34;).  You may also use the console (&#39;`&#39; - the backtick or tilde key, by default):\r<br />\r<br />(to enable)\r<br />set SSoBGemMarkers to 1\r<br />\r<br />(to disable)\r<br />set SSoBGemMarkers to 0\r<br />\r<br />[b][color=#1e84cc][size=4]KNOWN ISSUES/INCOMPATIBILITIES\r<br />[/size][/color][/b]\r<br />It&#39;s been reported that this mod is NOT compatible with &#34;Non quest locations for Stones of Barenziah.&#34; I currently don&#39;t plan to fix this incompatibility.\r<br />\r<br />This mod will also be incompatible with any mod that modifies the No Stone Unturned quest, which includes other quest marker mods and droppable/sellable gem mods.\r<br />\r<br />[color=#1e84cc][size=4][b]CHANGES FROM v0.1[/b][/size][/color]\r<br />\r<br />[list=1][*][size=2]Added MCM menu.[/size][/*]\r<br />[*][size=2]Fixed bugged quest marker on stone in Pinewatch (marker would persist after the gem was picked up).[/size][/*]\r<br />[*][size=2]Optimized the vanilla quest script: replaced 25 instances of Game.GetPlayer() with a Player Actor alias.[/size][/*]\r<br />[/list]\r<br />[color=#1e84cc][size=4][b]THE GORY DETAILS[/b][/size][/color]\r<br />\r<br />What is &#34;stacking,&#34; exactly?  Previously, if you collected multiple Stones prior to speaking with Vex, they would appear in your inventory as a &#34;stack.&#34;  If you had collected four Unusual Gems, you would open your inventory and see:\r<br />\r<br />    Unusual Gem (4)\r<br />\r<br />After you spoke with Vex, however, the four gems would be renamed to Stone of Barenziah - and then any further stones you collected would NOT continue to stack, instead appearing on their own row in your inventory:\r<br />\r<br />    Stone of Barenziah (4)\r<br />    Stone of Barenziah\r<br />    Stone of Barenziah\r<br />    Stone of Barenziah\r<br />\r<br />I stumbled upon the reason for this obnoxious behavior as I was making a different mod, and decided to take a day to use SKSE to correct it. So, how does it work?  The vanilla No Stone Unturned quest renamed the gems by forcing them into new aliases at the appropriate quest stage. It gets the job done, but the new containers used by the quest don&#39;t stack normally.\r<br />\r<br />To fix it, I used the magic of SKSE: rather than force the Unusual Gems into new aliases, I directly rename them with SKSE&#39;s &#34;SetName&#34; Form Script function. Since the new gem object is the same as the old gem object, just renamed, it stacks properly, just like the old gem object&#33;\r<br />\r<br />The one drawback SetName has it that its changes only last for the duration of the game session.  When you quit the game and restart, the gems go right back to being called &#34;Unusual Gems.&#34;  So, every time you load a game - and ONLY when you load a game - SSoB checks on your No Stone Unturned quest status and, if appropriate, goes through and renames all the Unusual Gems to Stone of Barenziah all over again.  This is a trivial operation.  If you happen to save and quit with your crosshair focused on a Stone of Barenziah somewhere in the world, then restart Skyrim and reload your game, you&#39;ll see &#34;Unusual Gem,&#34; because the mod hasn&#39;t yet had a chance to rename all the gems.  Move your crosshair away and back again, and it should read &#34;Stone of Barenziah.&#34;\r<br />\r<br />What has the impact on the overall quest structure been?  Since I no longer need the new aliases that the old gems used to be forced into, they&#39;ve been removed.  That&#39;s 48 entire reference aliases, deleted.  These aliases were ONLY used in the renaming step of the quest, so their removal doesn&#39;t affect any other stage of the quest.  Even so, the removal of 48 aliases is a fairly major overhaul, which means that you absolutely SHOULD NOT enable this mod in the middle of a playthrough.  At best, it won&#39;t work; at worst, it will screw up your No Stone Unturned progress in all sorts of unpredictable ways.  Since No Stone Unturned is Start Game Enabled, you should only activate SSoB prior to starting a brand new game.  I had no success getting it to work in an existing clean save - even one in which I hadn&#39;t touched any of the Thieve&#39;s Guild quests.\r<br />\r<br />[b][color=#1e84cc][size=4]MY OTHER WORK[/size][/color][/b]\r<br />\r<br />[list][*][size=2][url=http://www.nexusmods.com/skyrim/mods/59619/]QuickDrop[/url]: Use hotkeys to quickly keep or drop the last few items you picked up without ever having to open your inventory.[/size][/*]\r<br />[/list]",
  "categoryId": "95",
  "version": "1.0",
  "author": "thegeekofalltrades",
  "createdUnix": "1387700130",
  "updatedUnix": "1414806169",
  "containsAdultContent": false,
  "uploadedBy": "thegeekofalltrades",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087820",
      "name": "Stackable Stones of Barenziah with Optional Quest Markers",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Stackable Stones of Barenziah with Optional Quest Markers-49056-0-1.7z",
      "uploadedUnix": "1387699104",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/3f82ecc3c260098c3c5d2257049b07da59384d773a05173f7c85f528c8a16c22/analysis/1407852592/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stackable%20Stones%20of%20Barenziah%20with%20Optional%20Quest%20Markers-49056-0-1.7z?fid=1000087820&ttl=1535829599&ri=8192&rs=8192&setec=4d3cd50a7fa0a5124c6debdb0945d1a4"
    },
    {
      "fileId": "1000132548",
      "name": "Stackable Stones of Barenziah with Option Quest Markers",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Stackable Stones of Barenziah with Option Quest Markers-49056-1-0.7z",
      "uploadedUnix": "1414293243",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bc912a126382e31b8f2e7d0fcf77413490786955a59cede06c9f0dc713cfbe43/analysis/1414293362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stackable%20Stones%20of%20Barenziah%20with%20Option%20Quest%20Markers-49056-1-0.7z?fid=1000132548&ttl=1535829599&ri=8192&rs=8192&setec=4499ade3dcd92eae3b9aa5e6a6cfca62"
    },
    {
      "fileId": "1000133438",
      "name": "Stackable Stones of Barenziah with Optional Quest Markers - No MCM Version",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Stackable Stones of Barenziah with Optional Quest Markers - No MCM Version-49056-1-0.7z",
      "uploadedUnix": "1414806169",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/78937367f6f4f7dec93bf488baa31cc7ec5eb67d006516bb412532797d11d011/analysis/1414806242/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stackable%20Stones%20of%20Barenziah%20with%20Optional%20Quest%20Markers%20-%20No%20MCM%20Version-49056-1-0.7z?fid=1000133438&ttl=1535829600&ri=8192&rs=8192&setec=02b234917c4e667ab0ba9a6747106895"
    }
  ]
}