{
  "modId": 49083.0,
  "modName": "BA_AlchemistArsenal - Arrows Bolts and Bombs",
  "summary": "Welcome to the Bad Ass Alchemist Arsenal&#33;&#33;&#33; WHOOOOOOOOO&#33;&#33;&#33; This mod uses Alchemy ingredients to create logical compounds, and then attach those compounds to arrows and bolts (or place them in flasks for bombs) to create immersive ammunition with a variety of alchemical effects.\r<br />",
  "descriptionHtml": "[b]Name: BA_AlchemistArsenal\r<br />Author: Shiholude\r<br />Category: Weapons[/b]\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]DESCRIPTION:[/b][/color][/size]\r<br />Welcome to the Bad Ass Alchemist Arsenal&#33;&#33;&#33; WHOOOOOOOOO&#33;&#33;&#33; This mod uses Alchemy ingredients to create logical compounds, and then attach those compounds to arrows and bolts (or place them in flasks for bombs) to create immersive ammunition with a variety of alchemical effects.\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]LATEST UPDATES:[/b][/color][/size]\r<br />(12-27-2013)\r<br />- Cleaned up main page to flow more sensibly. It seemed to jump all over the place before, and I was quite the chatterbox when writing this up originally.\r<br />- Added TO DO items: Patches for Spinning Arrows, Closer Quivers & Longer Arrows, and SkyRe\r<br />\r<br />(12-22-2013)\r<br />- Initial release&#33;&#33;&#33; WHOOOOOOOOOOOO&#33;&#33;&#33;\r<br />- Added tons of pictures.\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]REQUIREMENTS:[/b][/color][/size]\r<br />Skyrim\r<br />Dawnguard\r<br />Hearthfire\r<br />Dragonborn\r<br />Sneak Tools - only for the optional file features\r<br />Throwing Weapons Redux - only for the optional file features\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]FILE INFORMATION:[/b][/color][/size]\r<br />\r<br />[size=4][u]Main Files:[/u][/size]\r<br />\r<br />[b]BA_AlchemistArsenal.esp[/b]\r<br />This is always required for the mod to work. Download and install all contents of this file.\r<br />\r<br />\r<br />[size=4][u]Optional Files:[/u][/size]\r<br />\r<br />[b]BA_AlchemistArsenal+SneakTools.esp[/b]\r<br />This file supports the [url=http://www.nexusmods.com/skyrim/mods/19447/]Sneak Tools[/url] mod ONLY. Download this in addition to the MAIN FILE.\r<br />\r<br />[b]BA_AlchemistArsenal+ThrowingWeaponsRedux.esp[/b]\r<br />This file supports the [url=http://www.nexusmods.com/skyrim/mods/36147/]Throwing Weapons Redux[/url] mod ONLY. Download this in addition to the MAIN FILE.\r<br />\r<br />[b]BA_AlchemistArsenal+TWR+ST.esp[/b]\r<br />This file supports both [url=http://www.nexusmods.com/skyrim/mods/19447/]Sneak Tools[/url] AND [url=http://www.nexusmods.com/skyrim/mods/36147/]Throwing Weapons Redux[/url] mods. Download this in addition to the MAIN FILE. This version has all of the features above, combined into a single file that allows functionality between them both.\r<br />\r<br />\r<br />[size=4][u]Miscellaneous Files:[/u][/size]\r<br />\r<br />[b]BA_AlchemistArsenal - Guides.zip [/b]\r<br />This file has the Excel guide in it, as well as JPEG versions of the guide to be used as supporting material to the mod. All my thoughts and planning stemmed from these documents. The book that you can get in-game has similar material, but this is much more organized and formatted better IMHO&#33;&#33;\r<br />\r<br />\r<br />THE KEY HERE IS THE OPTIONAL FILES. Within these files is a commonly named script file (BAAAArmorSCRIPT). This single script is overwritten, depending upon which version you are running. As there can only be ONE of this script active, you must be sure to use the correct one. Furthermore, if you install one version, save your game, and then decide to play a different version - you will be required to conduct a CLEAN SAVE. This means that you will lose your inventory of anything created in order to switch over. I have no fix for this, as it is the way that the game saves scripted features, and not my doing.\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]THE AMMUNITION:[/b][/color][/size]\r<br />\r<br />[size=4][u][b]Arrows / Bolts[/b][/u] (items highlighted in [color=magenta]PINK[/color] require the SNEAK TOOLS mod)[/size]\r<br />\r<br />[color=aqua][b][i]CALM:[/i][/b][/color] Releases a powder into the air upon impact, removing hostility from all people or creatures within range for &lt;30&gt; seconds.\r<br />\r<br />[color=aqua][b][i]ENRAGE:[/i][/b][/color] Injects a volatile serum into a target upon impact, causing them to instantly frenzy on anything nearby for &lt;60&gt; seconds.\r<br />\r<br />[color=aqua][b][i]FIRE:[/i][/b][/color] Explodes for Fire damage, burning all targets within range for &lt;5&gt; seconds, and sets a small pyre trap that lasts &lt;10&gt; seconds.\r<br />\r<br />[color=aqua][b][i]FLARE:[/i][/b][/color] Ignites a slow burning powder which radiates a small light source at the point of impact for about &lt;2&gt; minutes.\r<br />\r<br />[color=aqua][b][i]GLUE:[/i][/b][/color] Ruptures a viscous substance on a target, slowing their movement speed and draining their Stamina over &lt;15&gt; seconds.\r<br />\r<br />[color=magenta][b][i]NOISE:[/i][/b][/color] Ignites a fast burning compound which emits a loud crackling sound as it burns, attracting the attention of anything nearby.\r<br />\r<br />[color=magenta][b][i]OIL:[/i][/b][/color] Shatters into a small pool of oil upon impact. If ignited, the oil explodes for Fire damage, burning all targets for &lt;10&gt; seconds.\r<br />\r<br />[color=aqua][b][i]POISON:[/i][/b][/color] Injects a poison into the target, paralyzing them for a short time, and inflicting Poison damage over &lt;30&gt; seconds.\r<br />\r<br />[color=magenta][b][i]ROPE:[/i][/b][/color] Drops a climbable rope at the point of impact.\r<br />\r<br />[color=aqua][b][i]SHOCK:[/i][/b][/color] Explodes for Shock damage, staggering all targets within range and draining their Magicka over &lt;15&gt; seconds.\r<br />\r<br />[color=aqua][b][i]SILVER:[/i][/b][/color] Undead, Ghosts, and Were-beasts are afflicted with silver - causing them Physical damage upon impact, and continued damage over &lt;20&gt; seconds.\r<br />\r<br />[color=magenta][b][i]WATER:[/i][/b][/color] Extinguishes all fire sources: candles, torches, lanterns, burning oil, and campfires (excluding bonfires).\r<br />\r<br />\r<br />[size=4][u][b]Bombs[/b][/u] (all bombs require the THROWING WEAPONS REDUX mod)[/size]\r<br />\r<br />[color=aqua][b][i]FIRE:[/i][/b][/color] Explodes for Fire damage, burning all targets within range for &lt;5&gt; seconds, and sets a pyre hazard that lasts &lt;10&gt; seconds.\r<br />\r<br />[color=aqua][b][i]FLASH:[/i][/b][/color] A non-lethal bomb that explodes with immense force, knocking down all targets within range and blinding them for &lt;10&gt; seconds.\r<br />\r<br />[color=aqua][b][i]GAS:[/i][/b][/color] Shatters as a liquid, which quickly evaporates into a vapor cloud. If ignited, the gas burns all targets within range for &lt;5&gt; seconds.\r<br />\r<br />[color=aqua][b][i]GLUE:[/i][/b][/color] Discharges a viscous liquid in the area, slowing the movement of all targets within range and draining their Stamina over &lt;15&gt; seconds, and sets a glue hazard that lasts &lt;10&gt; seconds.\r<br />\r<br />[color=aqua][b][i]INCENDIARY[/i][/b][/color] Shatters into a small pool of oil and immedaitely explodes for Fire damage, burning all targets within range for &lt;10&gt; seconds, and sets a burning hazard that lasts &lt;10&gt; seconds.\r<br />\r<br />[color=aqua][b][i]OIL:[/i][/b][/color] Shatters into a large pool of oil. If ignited, the oil explodes for Fire damage, burning all targets within range for &lt;15&gt; seconds, and sets a burning hazard that lasts &lt;10&gt; seconds.\r<br />\r<br />[color=aqua][b][i]PLAGUE:[/i][/b][/color] Shatters into a large toxic cloud that lasts &lt;20&gt; seconds, choaking and inflicting Poison damage over &lt;30&gt; seconds to anyone that enters the area.\r<br />\r<br />[color=aqua][b][i]SHOCK:[/i][/b][/color] Explodes for Shock damage, staggering all targets within range and draining their Magicka over &lt;15&gt; seconds, and sets a electric hazard that lasts &lt;10&gt; seconds.\r<br />\r<br />[color=aqua][b][i]STERLING:[/i][/b][/color] Explodes for Physical damage to all targets within range. Undead, Ghosts, and Were-beasts are afflicted with silver - causing additional Physical damage upon impact, and continued damage over &lt;20&gt; seconds.\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]THE INGREDIENTS:[/b][/color][/size]\r<br />\r<br />[size=4][u][b]Tools[/b][/u][/size]\r<br />\r<br />[color=aqua][b][i]ALCHEMIST ARSENAL KIT:[/i][/b][/color] A portable crafting kit that contains all the tools needed to construct specialized arrows, bolts, bombs, vessels, and compounds. This is the item that you will equip to create, convert, dismantle, and conduct any &#34;special&#34; actions like getting a copy of the guide, a water pouch, etc.\r<br />\r<br />\r<br />[size=4][u][b]Compounds[/b][/u][/size]\r<br />\r<br />[color=aqua][b][i]BLOOD:[/i][/b][/color] This volatile liquid is harvested directly from the blood of others. Through distilliation and revivification, a serum is produced that when injected into a target, will cause their blood to quicken, forcing them to lose control and attack anyone around them.\r<br />\r<br />[color=aqua][b][i]EXPLOSIVE:[/i][/b][/color] Explosives are carefully created by grinding down flammable materials into finer crystals. Be careful though, for if they are struck with a spark, they will ignite, and detonate.\r<br />\r<br />[color=aqua][b][i]GLUE:[/i][/b][/color] Glue is developed through the process of glutination and congelation: slowly mixing and heating various sticky and viscous substances until they become gelatinized. In its new form, anything that comes into contact with this material will have its movement impaired greatly - and the efforts it takes to break free will require a moderate amount of stamina.\r<br />\r<br />[color=aqua][b][i]OIL:[/i][/b][/color] This thicker liquid is drawn from various fatty and flammable sources. When ignited by a flame, it burns longer and more intensely than the above explosive compounds.\r<br />\r<br />[color=aqua][b][i]POWDER:[/i][/b][/color] Many flowers and other flora can be crushed into a powder. In this dusty state, they can be thrown in an opponent&#39;s face, or slipped into a drink with ease. The purpose of this? Well, if inhaled or ingested, these powders will cause dizziness, confusion, and a state of carefree euphoria - often causing the target to completely forget what they were doing.\r<br />\r<br />[color=aqua][b][i]SILVER:[/i][/b][/color] Pure silver is volatile to Dragon Priests, Draugr, Ghosts, Skeletons, Vampires, Were-beasts, and Zombies - causing  high damage initially (in addition to any type of normal physical damage from the weapon used). Once smelted, it can be applied to the sharp end of a weapon or chipped into shrapnel to be used in bombs. Upon impact with such creatures, the material will begin to dissolve, causing long term damage as well.\r<br />\r<br />[color=aqua][b][i]SPARK:[/i][/b][/color] Spark is developed by taking harvested fibers from various objects and crystallizing them using specific bonding liquids and a slow evaporation process. If violently disturbed (say, when smashing against a target or wall), they will send out pulses of static electricity - shocking / staggering anything within range and draining a large amount of concentration (magicka) in the process.\r<br />\r<br />[color=aqua][b][i]SULFUR:[/i][/b][/color] Sulfur is created through the processes of desiccation and lixiviation of harvested roots and radioactive objects - which carefully scraps, crushes, dries, and oxidizes objects into a coarse vitriol material. This material can then be used in in two ways. If lit on fire, it will provide a slow burning bluish light that can illuminate dark areas. If combined with other chemicals, it will either become unstable and explode with a powerful force and bright light, or will bond with the other agent and become light and airy like a spore.\r<br />\r<br />[color=aqua][b][i]TOXIN:[/i][/b][/color] Toxic compounds are extracted from all types of wild fungi and poisonous plants. Some items provide a direct liquid, whereas others need to go though a prolectation process to draw out their venom. Be warned that several cases have reported that if this liquid is exposed to skin or armor, that it is highly corrosive, aggressively painful over a long period of time, and can cause short-term paralysis if the poison reaches the bloodstream or the vapors reach the airways.\r<br />\r<br />[color=aqua][b][i]WATER:[/i][/b][/color] Water is a readily available resource in most  locations in Tamriel, and is collected for use when creating items that require it.\r<br /> \r<br />\r<br />[size=4][u][b]Vessels[/b][/u][/size]\r<br />\r<br />[color=aqua][b][i]CLOTH STRIPS:[/i][/b][/color] Several thinly cut strips of cloth material for use as a small pouch, binding, or wick.\r<br />\r<br />[color=aqua][b][i]EMPTY FLASKS:[/i][/b][/color] A few medium-sized glass containers, vitrified from crystal ores and other glass-type materials, which can hold a moderate amount of liquid.\r<br />\r<br />[color=aqua][b][i]EMPTY VIALS:[/i][/b][/color] A dozen small glass containers, forged from crystal ores and other glass-type materials, that can hold a small amount of liquid.\r<br />\r<br />[color=aqua][b][i]ROPE:[/i][/b][/color] A small entwined rope, sturdy enough to carry the weight of one person - and some gear.\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]BACKGROUND and RANDOM BABBLE:[/b][/color][/size]\r<br />\r<br />[size=4][u]Concept[/u][/size]\r<br />This add-on has evolved from wanting to provide a personalized version of all of the awesome specialized arrows available on the Nexus, to a full-blown revamp of how these types of arrows work. \r<br />\r<br />I am both very happy and very sad with my results of the project. I am happy because I feel that I&#39;ve developed a very good interpretation of how these items could/should be made - while keeping it immersive, realistic, and fulfilling for an adventurer. But I am sad because, due to the limitations of the game design, I cannot implement this change how I would have liked - through the use of the Alchemy Lab. Since I cannot uncover how to add recipes to the lab, all the construction of components and crafting of ammunition will be done via a portable crafting kit.\r<br />\r<br />The entire idea stemmed from my dislike of how the basis of magicka is inherent for everyone in Tamriel. Somehow, this base knowledge allows people to buy and use magickal items, wear magickal gear, and wield magickal weapons. The limited enchanting system helps this some, draining the imbued properties each time the item is used, but the underlying problem remains that this powerful source is too easily controlled by those that have not dedicated their lives to the study and mastery of such power - such as mages, warlocks, and witches. \r<br />\r<br />Again, this is only my opinion here, but I find it hard to believe that any melee-based character would decide to undertake the enormous commitment and time to learn magick - over honing their skills with weapons. I believe that if they did, they would be poor magick users at best - as well as a weaker combatant.\r<br />\r<br />With that said, I believe that Alchemy should require similar dedication to become a true master of the art. However, it is much easier to understand and manipulate physical chemical elements than ethereal arcane elements. \r<br />\r<br />This mod takes this attitude and helps &#34;encourage&#34; a person down the path of Alchemy, urging them to use it for more than simple health potions, fortifying elixirs, and a few poisonous blades here and there - and then actually rewards them for do so&#33;\r<br />\r<br />As I mentioned earlier, this started out as an alternative to magick arrows or exploding Dwemer bolts. The more I studied the many mods out there that add such features to the game, the more I kept longing for the diversity and functionality that they provided - like with Sneak Tools. This mod not only provided some very effective ammunition, but they were very practical as well. BUT (there is always a big butt after a complement, isn&#39;t there?), I wanted more than what was available by the mod, and I disliked how simplistic the ammunition was able to be created. So, I borrowed several ideas from his and other people&#39;s awesome works, and then added additional content - Bad Ass style...\r<br />\r<br />The result is this: an immersive approach to creating functional ammunition that will scale with the player as they progress in level and skill&#33;\r<br />\r<br />\r<br />[size=4][u]How It Works:[/u][/size]\r<br />It all starts with harvesting the needed components. Chances are that if you have been picking up and chewing on some Imp Stool for its psychedelic properties, or wondering what to do with all that Troll Fat oozing out of your backpack, or trying to figure out why you spent the time and effort to collect and drag all that Linen Wrap back to town - then you&#39;re likely half-way towards creating some new and exciting ammunition&#33; \r<br />\r<br />Once harvested, these items can be broken down into compounds. These, in turn, can be combined with a vessel and attached to an arrow or bolt - making a new piece of ammunition with awesome abilities&#33; \r<br />\r<br />One of the best parts about this &#34;ammunition of pure awesomeness&#34; is how they will never get old and outdated. The way it works is like this: there is a single recipe for each type of ammunition, always requiring the same exact quantity and type of ingredients. \r<br />\r<br />As your character increases their experience through leveling and working on their Alchemy skill, the ammunition on hand and created is automatically upgraded - giving it the highest possible capability. My logic behind this feature is this: as your skills in Alchemy increase, so would your ability to make your results more powerful, with no need for additional materials&#33;\r<br />\r<br />The next step is to visit an alchemist vendor and purchase the &#34;Alchemist Arsenal Kit&#34;. This is an armor looking item that you simply equip to trigger its functions.\r<br />\r<br />\r<br />[size=4][u]Documentation[/u][/size]\r<br />I have two forms of documentation available for use:\r<br />(1) There is a book that you can get by simply opening the kit (after you purchase it from an Alchemy vendor), and selecting the option to get the guide. Within this manual, you will be told about every feature available, as well as information on how to build the arsenal, and what to harvest to make the compounds.\r<br />\r<br />(2) There is an optional file download available which contains an Excel Workbook. In this workbook is a large amount of data on all the ingredients and items available from each mod (Default, Sneak Tools, and Throwing Weapons Redux). This is extremely useful and something to print out. I saved it as an XLS file for best compatibility for most everyone. However, just in case you don&#39;t have a way to view the file, I did create some pictures of the data as well.\r<br />\r<br />\r<br />[size=4][u]Other Random Thoughts:[/u][/size]\r<br />- I have limited the yield amounts for all arrow/bolt creations to twelve (12) for two reasons - a) so that the user would not have to make a large batch of ammo that they would potentially not use very often, and b) because I wanted to keep the compound usage to one piece.\r<br />\r<br />- I tried to keep the yield to value ratio as close as I could for most compounds and vessels, but some things were just too silly not to change. Therefore, the yield amounts are ultimately based on the items size, how much it should produce when broken down, as well as its general value if sold. This means that some items will be much more valuable in their compound or vessel form than their original form. Please don&#39;t abuse this&#33; Since I had to set a single value for all items I used as an input, it was very difficult to determine the least common multiple without over/under-valuing some items.\r<br />\r<br />-  Many of the ammo will place a standard steel arrow or bolt on the ground at the point of impact. This is present for two explicit reasons: a) to protect my immersive experience of shooting an arrow with a glass vial on the end of it that explodes, and not seeing the full model of the arrow with the glass vial still intact laying on the ground afterwards... and b) so that I don&#39;t need to create &#34;depleted&#34; versions of each arrow/bolt to allow them to be picked up. I only require steel arrows and bolts for these items in the first place, so it *should* follow logic that upon shooting the ammo, that we would still be able to recover something. \r<br />\r<br />Unfortunately, no matter what I do, I cannot control arrows and bolts being automatically placed into the inventory of the mob in their &#34;Alchemist Arsenal&#34; form. This means that you will, for example, find a fully intact Fire Arrow on the mob, ready and able to be used again - even though it exploded the first time. Immersion breaking, I understand. The silver lining part about this is: archery mobs that are hit by this ammo will often use this same ammo against the player, adding to the challenge... somewhat.\r<br />\r<br />-  Regarding the components and vessels: they will not clutter your crafting menu if you do not have the components to make the item. There are a helluvashitloada (yes, that&#39;s a real word that I just made up) of components to craft from, so be sure to download and keep the EXCEL guide handy to help you recognize items that are used. In general, it&#39;s a safe bet to simply keep most ingredients (as you will need them to create alchemical items anyways), and then the few miscellaneous items can be remembered.\r<br />\r<br />If you have a problem with any of the above, then in the immortal words of Arnold Schwarzenegger I say, &#34;STOP WHINING&#33;&#34; and &#34;GO&#33; NOWWW&#33; GET TO THE CHOPPA&#33;&#33;&#34;\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]MOD MODIFICATIONS:[/b][/color][/size]\r<br />Early after release, I was asked exactly what changes that made to the other mods - other than changing the ammo names. So here you are:\r<br />\r<br />[size=4][b][u]Sneak Tools[/u][/b][/size]\r<br />\r<br />GENERAL CHANGES:\r<br />[list][*]Changed all arrows and bolts to steel.\r<br />[*]Changed textures to reflect the ammo being used. I am NOT an artist, so don&#39;t expect uber graphics from these, just generalized colorings. :)\r<br />[*]Changed the names of the ammo to match the naming convention of the other items.\r<br />[*]Changed the keywords to steel.\r<br />[*]Changed the value and damage to match the rest of the set.\r<br />[*]Changed the descriptions to provide more detail.\r<br />[*]Silenced as much as possible for the utility ammo. I&#39;m still not sure how the sounds work in game, because no matter what, mobs are still startled and investigate the impacts.\r<br />[*]Disabled combat aim correction. I don&#39;t believe in assisted aiming and magical arrows that hone in on a target. Perhaps in magick usage, but not with physical items.\r<br />[*]Removed ability to pick up the ammo. This isn’t possible anyways, but it helps my sanity to remove the possibility entirely. Player will get enough returns from picking them off dead bodies and the ground.\r<br />[*]Modified the merchant inventory to have my BAAA fire arrows instead of the ST ones.[/list]\r<br />\r<br />\r<br />SPECIFIC CHANGES:\r<br />\r<br />ROPE\r<br />[list][*]No changes[/list]\r<br />\r<br />WATER\r<br />[list][*]Increased the detection event for the nearest light source from a radius of 50 to 100. This means that you need to be close, but not directly in the flame to extinguish it. My reason for this is that there are several situations where there are multiple items aflame, but only one of these is the light source and in the list of extinguishable items, so I found myself having to shoot every single one of them to find the one that will go out. Now you just shoot the middle of the bunch and it finds the one it can put out and does so.\r<br />[*]Reduced the explosion radius, as the splash nif has a rumble effect associated with it and was quite annoying if it &#34;exploded&#34; nearby me. [/list]\r<br />\r<br />NOISE\r<br />[list][*]Added the BONE TRAP ALARM to the explosion. Previously, the noise wouldn&#39;t attract mobs from very far away. Adding this effectively increased the reaction of mobs to 3x the distance. Created a local version of this so that if the main bone trap radius is changed, it wouldn&#39;t affect this system.\r<br />[*]Changed the sound of the explosives to be more distant and echoing. They don’t sound proper up close, but they sound excellent in the distance. [/list]\r<br />\r<br />FIRE\r<br />[list][*]No changes to the Sneak Tool&#39;s Fire Ammo. Instead, I changed the already-present BAAA Fire Ammo to use the ST Explosion event that links the detection feature for relighting fires. \r<br />[*]Modified the detection event script to place the original BAAA fire explosion at the point of impact, so that we can still have the 10 second pyre trap.\r<br />[*]Modified the script to detect a radius of 100 instead of the default 50, just like the water ammo. [/list]\r<br />\r<br />OIL\r<br />[list][*]Changed the FIND GROUND script to only place a single decal / spell on the ground. The original mod placed 8 of these in the ground, effectively making the spell 8x as powerful. Far too OP to me.\r<br />[*]Changed the textures use to be more consistent and larger to cover a similar area as the multiple puddles did before.\r<br />[*]Changed the ground oil explosion to set MY activator that emulated the default OilTrap script instead of ST&#39;s which seemed to go six different directions.\r<br />[*]Modified the OilTrap script to create the explosion after the trap is damaged by fire (it does this to itself upon detecting an object from various form lists)\r<br />[*]Created my own explosion, hazard, and corresponding spell - as to control the effects more easily.\r<br />[*]Added the BA Progression Level capabilities to the oil ammo, so that the player can benefit from this like everything else.\r<br />[*]Altered the effects so that the player can be affected by the hazard and explosion. Previously the player was immune to the effect since they are considered the &#34;caster&#34; of the effect.\r<br />[*]Altered the magic effect for the explosion so that it shows for the player as a damaging effect if they are hit by the explosion or the hazard (upper right corner). [/list]\r<br />\r<br />\r<br />[size=4][b][u]Throwing Weapons Redux[/u][/b][/size]\r<br />\r<br />GENERAL CHANGES:\r<br />[list][*]Changed the names of the weapons from &#34;Grenade&#34; to &#34;Bomb&#34;.\r<br />[*]Changed naming convention to match the other arsenal items.\r<br />[*]Changed the value and weight to better correlate to the rest of the set.\r<br />[*]Added descriptions to provide more information (none present previously).\r<br />[*]Changed the meshes and textures of the items to all be made of glass bottles (flasks). \r<br />[*]Remodeled all items to have proper names and colorized differences. Again, I&#39;m not artist, and for some reason the names and the &#34;tag&#34; both appear faded in game - unlike how they are in Nifscope. I don&#39;t know how to fix this. Perhaps someone can help me???\r<br />[*]Changed all the global values to the proper starting level. The player can still alter these in the configuration menu of TWR, and they will override.\r<br />[*]Changed the TWR custom Form Lists back to default features, so that all the mods play nice together, and there is no need to maintain/update a separate list.\r<br />[*]Set all TWR constructible grenades to &#34;Initially Disabled&#34;, and created my own new ones for each item. TWR&#39;s other items operate and are constructible via normal means; just the bombs are required to be created via the Portable Alchemy Lab.\r<br />[*]Altered the effects of all the grenades so that the player can be affected by the hazard and explosion. Previously the player was immune to the effect since they are considered the &#34;caster&#34; of the effect. This meant that the player could literally throw a bomb at his/her feet and the ensuing explosion and effect wouldn&#39;t touch the player. Can you say, &#34;wahtthefrigginhellisthatshitaboutyoucrazyfrigginbethesdaprogrammers&#33;&#33;&#34; I knew ya could...\r<br />[*]Modified the scripting functions of the mod to allow for the BAAA Progression Level system to be used. Previously, TWR simply took the players Alchemist skill and added 75% of the skill level to the damage output of the grenade. That is seriously OP to me, so I added a proper progression system based off my mod to the explosion value, while still using TWR&#39;s functionality. Furthermore, I was able to add all Damage Over Time (DoT) effects to the explosion via scripting&#33; Oh yes, by the way, all existing perk benefits still apply&#33;&#33;\r<br />[*]Standardized all impact sounds to have a &#34;breaking glass&#34; type sound.\r<br />[*]Removed all vertical offset from all explosions. I haven&#39;t found a functional use for this setting yet. [/list]\r<br />\r<br />\r<br />SPECIFIC CHANGES:\r<br />\r<br />FIRE (formerly &#34;FLAME&#34;)\r<br />[list][*]Repurposed this bomb from a &#34;Molotov Cocktail&#34; type bomb to a flask bomb.\r<br />[*]Increased the explosion radius from 160 units to 300 units (roughly 15ft). This means that the effective radius of the explosion is about 8 ft., and dissipates quickly from there.\r<br />[*]Reduced the IMAD effect from 800 units to 500 units. All the IMAD effect does is have a visual impact on the player, like the screen flashing slightly due to the explosion. This distance, like the explosion itself, has a diminishing return the further out the effect travels - meaning that at 500 units the effect is barely noticeable.\r<br />[*]Add DoT effect to scripting.\r<br />[*]Added the fire pyre trap to the explosion. The hazard lasts 10 seconds.\r<br />[*]Added a &#34;Knock Down By Formula&#34; flag[/list]\r<br />\r<br />FLASH (formerly &#34;STUN&#34;)\r<br />[list][*]Changed the model from the torch/cup to a potion bomb.\r<br />[*]Transferred as much of my Concussion Grenade features from Fallout 3 to this bomb. This includes the IMAD effect and a blinding feature.\r<br />[*]Changed sound of the explosion. Former one was too loud and echoed to be believable.\r<br />[*]Increased force from 60 to 200 for a good push.\r<br />[*]Reduced IMAD from 800 to 600 units. \r<br />[*]Changed sound level from Silent to Loud.\r<br />[*]Added a &#34;Knock Down - Always&#34; flag[/list]\r<br />\r<br />GAS\r<br />[list][*]Added damage back into the explosion. Since this bomb does not follow a scripted damage assessment, it should have its damage applied to the explosion itself. Unfortunately, this means that the damage is always the same.\r<br />[*]Increased explosion radius from 300 to 450.\r<br />[*]Reduced IMAD radius from 800 to 650.\r<br />[*]Changed the sound level from silent to normal. The contents are now gaseous, and will have a flare up, but not explosive sound, when ignited.\r<br />[*]Changed the object effect of the explosion to a custom tiered effect, based on the players progression level.\r<br />[*]Added a &#34;Knock Down By Formula&#34; flag[/list]\r<br />\r<br />GLUE (formerly &#34;FROST&#34;)\r<br />[list][*]Removed all frosty effects from features.\r<br />[*]Increased blast radius from 160 to 300 units.\r<br />[*]Reduced IMAD from 800 to 300. This is exploding glue, so it should not have any effect beyond its maximum blast radius.\r<br />[*]Changed sound level from loud to silent. It&#39;s just explosive glue, not napalm.\r<br />[*]Added a sticky glue hazard that lasts for 10 seconds. Anything entering the area will be effected as if they were hit by the original blast. Think of it as if you stepped in a puddle of goo - it would still slow someone down and take energy to get free of it (stamina drain).\r<br />[*]Added a model for the hazard effect. [/list]\r<br />\r<br />INCENDIARY\r<br />[list][*]Changed model from the potion bomb to the &#34;Molotov Cocktail&#34; looking one from Flame above.\r<br />[*]Increased explosion radius from 200 to 300.\r<br />[*]Increased IMAD radius from 400 to 500.\r<br />[*]Reduced force from 60 to 50.\r<br />[*]Added a &#34;GetHit&#34; IMAD effect to give some sort of visual effect.\r<br />[*]Changed sound level from silent to loud. This will explode and burn, so the sound should be louder.\r<br />[*]Add DoT effect to scripting.\r<br />[*]Added a hazard effect that lasts 15 seconds. [/list]\r<br />\r<br />OIL\r<br />[list][*]I had to add two loops of explosion to activator to explosion to activator to explosion in order to get this working properly. EXHAUSTING&#33;\r<br />[*]Created my own explosions to handle the oil trap trigger and actual explosion.\r<br />[*]Increased explosion radius from300 to 450.\r<br />[*]Decreased IMAD radius from 800 to 650.\r<br />[*]Add DoT effect to scripting.\r<br />[*]Increased the burning hazard time from 9 to 15 seconds. [/list]\r<br />\r<br />PLAGUE (formerly &#34;POISON&#34;)\r<br />[list][*]Removed paralysis effect from effects.\r<br />[*]Added a coughing effect since the bomb is now an airy spore instead of in a liquid form.\r<br />[*]Increase explosion radius from 160 to 450.\r<br />[*]Reduced IMAD from 800 to 650. There isn&#39;t any IMAD effect, but I like consistency. :)\r<br />[*]Add DoT effect to scripting.\r<br />[*]Added a hazard effect that lasts 20 seconds before dissipating. [/list]\r<br />\r<br />SHOCK\r<br />[list][*]Changed the model from the torch/cup to a potion bomb.\r<br />[*]Increased explosion radius from 200 to 250.\r<br />[*]Reduced IMAD radius from 800 to 500.\r<br />[*]Reduced force from 60 to 25. Anyone affected will be staggered, but not thrown amiss.\r<br />[*]Changed sound level from silent to normal, as shocking sounds are sound-worthy.\r<br />[*]Added a hazard effect that lasts 10 seconds before dissipating. This one is a bit different, whereas it places a constant drain of magicka on all subjects in range, for as long as they remain in range of the hazard. [/list]\r<br />\r<br />STERLING (formerly &#34;FRAGMENTATION&#34;)\r<br />[list][*]Changed the model from the torch/cup to a potion bomb.\r<br />[*]Added an explosion effect that will damage ANYONE. Think of this as the fragmentation portion of this bomb. It is chunks of silver packed into a jar. When it explodes, the silver acts like shrapnel from a grenade and will damage anyone it hits.\r<br />[*]Added specialized DoT effects to scripting for undead only mobs.\r<br />[*]Added specialized additional damage for undead mobs.\r<br />[*]Add damage and DoT effects to scripting.\r<br />[*]Increased initial explosion from 200 to 450 units.\r<br />[*]Added the &#34;GetHit&#34; IMAD.\r<br />[*]Increased the IMAD radius from 600 to 650.\r<br />[*]Added a &#34;Knock Down By Formula&#34; flag[/list]\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]INSTALL:[/b][/color][/size]\r<br />This only requires the standard Nexus installation method:\r<br />1) Download the MAIN FILE and, if you want, ONE of the OPTIONAL FILES either manually or use the NMM DL Manager.\r<br />2) Activate the MAIN FILE first, and then activate the OPTIONAL FILE within NMM. They will both is now part of your load order.\r<br />3) Reposition mod to compliment other mods (BOSS is suggested).\r<br />If you are not using NMM to manage your files, then use the installer of your choice, or manually install and track the mod.\r<br />\r<br />\r<br />\r<br />[size=5] [color=yellow][b]UN-INSTALL:[/b][/color][/size]\r<br />1) Un-equip any items used in the mod.\r<br />2) Use NMM to deactivate the mod. It is now no longer in your load order or Skyrim file structure.\r<br />3) Delete the mod (optional).\r<br />\r<br />\r<br />\r<br />[size=5] [color=yellow][b]COMPATIBILITY:[/b][/color][/size]\r<br />There should be zero compatibility issues with other mods. This has been created from the ground up.\r<br />Aside from the mods that have compatibility patches built in, there are no other mods that this will interact with.\r<br />\r<br />\r<br />\r<br />[size=5] [color=yellow][b]KNOWN BUGS / ISSUES:[/b][/color][/size]\r<br />1) If using the SNEAK TOOLS addon, the Oil Arrows and Bolts leave a puddle of oil behind. This is a decal that is placed on the ground, and there is no way to delete it&#39;s occurrence that I know of. This same issue is present within SNEAK TOOLS itself, so this bug is due to the original mod.\r<br />\r<br />2) If using the THROWING WEAPONS REDUX mod, the Oil Bomb places a shinny oil puddle near the ground. If thrown against a sloping surface, it will not angle itself to the landscape as it inherits the default oil trap pool - which is only used on flat areas by the game engine. Therefore, the result is odd looking, with a reflective pool of oil above the plane it lands on that extends out into thin air, and completely invisible below that same plane. This is a game engine mechanic that I do not know how to alter.\r<br />\r<br />3) There are no actual glass vials or bags of powder meshed onto the ammo. I do not possess the artistic talent to add these things to the meshes. I do have, however, enough knowledge of Nifscope and Gimp to create alternative looking versions for the arrows and bolts and bombs, and have done so to offer some distinction between the items.\r<br />\r<br />No other known issues at this point, please let me know if you find any.\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]TO LIST LIST:[/b][/color][/size]\r<br />Patch for Spinning Arrows\r<br />Patch for Closer Quivers / Longer Arrows\r<br />Patch for SkyRe?\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]CONTACT INFO:[/b][/color][/size]\r<br />[url=http://thenexusforums.com/index.php?act=Msg&CODE=4&MID=1090316]Private Message - Shiholude[/url]\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]CREDITS:[/b][/color][/size]\r<br />Thank you to Bethesda for creating Skyrim&#33;\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/19447/]Sneak Tools by Borgut1337[/url]: This was my inspiration to create this mod. I loved the vast functionality that went into this mod. Thank you Borgut1337 for all your efforts&#33;\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/36147/]Throwing Weapons Redux by Madrilous[/url]: This is another mod that I took great interest in. I wanted to offer an alternative to just archery arsenal items, and Madrilous hit it right on the head - both literally and figuratively&#33;&#33;\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/23574]Torch Arrows by Joolander[/url]: I got the idea for lighting items in flight from him, as well as the hazard traps left by ammo after they hit (like the fire arrow and most bombs).\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/9349]Explosive Arrows by eric31415[/url]: Props are due for teaching me various ways to explode the ammo. Some worked, some didn&#39;t, additional ideas for types of ammo came from here.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/9799]Arrows of Magicka by deadmccoy[/url]: Here is where I got the ideas for calm and enrage arrows, as well as some functionality of scripts. Thank you deadmccoy&#33;\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/10723]Arrows Of Light by Charrio[/url]: Between AoM above and this mod, I was able to get arrows to glow in flight and after hitting a target. From there, I discovered how to make the light only last for a finite period of time.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/28551]The Archers Arsenal - Special Arrows and More by Kali - McNaggers[/url]: I was going to call my mod &#34;Alchemist Ammunition&#34;, but then I came across this mod, and was inspired to change it to &#34;Alchemist Arsenal&#34; - it sounds much more &#34;Bad Ass-ish&#34;. Plus, some of the functions they used help bridge the gaps of learning what to do (and not to do). Thanks Kali&#33;\r<br />\r<br />Thank you to all the other modders that continue to make this game playable, over and over again&#33;\r<br />\r<br />Thank you to everyone that continues to support and download my mods&#33; I love this community&#33;\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]TOOLS USED:[/b][/color][/size]\r<br />[url=http://www.nexusmods.com/skyrim/mods/modmanager/]NMM[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/25859/]TESV Edit[/url]\r<br />[url=http://www.creationkit.com/]Creation Kit[/url]\r<br />[url=http://niftools.sourceforge.net/wiki/NifSkope]NifScope[/url]\r<br />[url=http://www.gimp.org/]GIMP[/url]\r<br />\r<br />\r<br />\r<br />[size=5][color=yellow][b]LICENSE / LEGAL:[/b][/color][/size]\r<br />Use it as you wish, just give credit to my creation here, and to those that I&#39;ve learned and borrowed from as well.\r<br />",
  "categoryId": "78",
  "version": "v13.12.22",
  "author": "Shiholude",
  "createdUnix": "1387762672",
  "updatedUnix": "1387812399",
  "containsAdultContent": false,
  "uploadedBy": "shiholude",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087977",
      "name": "BA_AlchemistArsenal_v13_12_22",
      "version": "v13.12.22",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1914",
      "fileName": "BA_AlchemistArsenal_v13_12_22-49083-v13-12-22.zip",
      "uploadedUnix": "1387762244",
      "modVersion": "v13.12.22",
      "virusScanUrl": "https://www.virustotal.com/file/db826a806a98a410cb1e621c2d1f335d5fafb4a5b1ec84ea73009569c0a8b942/analysis/1407854466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BA_AlchemistArsenal_v13_12_22-49083-v13-12-22.zip?fid=1000087977&ttl=1535829640&ri=8192&rs=8192&setec=4ee5d0353a40e1786183bf908267ab00"
    },
    {
      "fileId": "1000087979",
      "name": "BA_AlchemistArsenal_SneakTools_v13_12_22",
      "version": "v13.12.22",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "757",
      "fileName": "BA_AlchemistArsenal_SneakTools_v13_12_22-49083-v13-12-22.zip",
      "uploadedUnix": "1387762319",
      "modVersion": "v13.12.22",
      "virusScanUrl": "https://www.virustotal.com/file/0d42e37ddc3c53aa793b8c18093c16aa7fa90226fce1fa8acb44965ffb809712/analysis/1407854467/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BA_AlchemistArsenal_SneakTools_v13_12_22-49083-v13-12-22.zip?fid=1000087979&ttl=1535829640&ri=8192&rs=8192&setec=65f3de56d7fe5c2490c6c0c4e5e1acf4"
    },
    {
      "fileId": "1000087980",
      "name": "BA_AlchemistArsenal_ThrowingWeaponsRedux_v13_12_22",
      "version": "v13.12.22",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1555",
      "fileName": "BA_AlchemistArsenal_ThrowingWeaponsRedux_v13_12_22-49083-v13-12-22.zip",
      "uploadedUnix": "1387762382",
      "modVersion": "v13.12.22",
      "virusScanUrl": "https://www.virustotal.com/file/a5dd99c8b5c985540c59418f4cd051477e14fda62bb286b1dd21cb6218ec895e/analysis/1407854474/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BA_AlchemistArsenal_ThrowingWeaponsRedux_v13_12_22-49083-v13-12-22.zip?fid=1000087980&ttl=1535829641&ri=8192&rs=8192&setec=db4e0ee040a66896ecfa5e4a79e4e102"
    },
    {
      "fileId": "1000087981",
      "name": "BA_AlchemistArsenal_TWR_ST_v13_12_22",
      "version": "v13.12.22",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2298",
      "fileName": "BA_AlchemistArsenal_TWR_ST_v13_12_22-49083-v13-12-22.zip",
      "uploadedUnix": "1387762469",
      "modVersion": "v13.12.22",
      "virusScanUrl": "https://www.virustotal.com/file/ef21e7444cd8fc5019c97c9eedb8fe9b3d2cfc5313ea31301310921b234da941/analysis/1407854482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BA_AlchemistArsenal_TWR_ST_v13_12_22-49083-v13-12-22.zip?fid=1000087981&ttl=1535829641&ri=8192&rs=8192&setec=bab77248cca45ccce106a0f8f6f03c02"
    },
    {
      "fileId": "1000088067",
      "name": "BA_AlchemistArsenal - Guides",
      "version": "v001",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2638",
      "fileName": "BA_AlchemistArsenal - Guides-49083-v001.zip",
      "uploadedUnix": "1387812399",
      "modVersion": "v001",
      "virusScanUrl": "https://www.virustotal.com/file/0662838a6fe2f08c5c378a973db45ad5791edd1a3e6e0e2ea1f2c0adffbb2036/analysis/1407855424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BA_AlchemistArsenal%20-%20Guides-49083-v001.zip?fid=1000088067&ttl=1535829642&ri=8192&rs=8192&setec=d7198903d8ac7a4fa300b576ce76624b"
    }
  ]
}