{
  "modId": 49090.0,
  "modName": "The Aether WIP",
  "summary": "A new worldspace (99% finished&#33;) that will hold an ok-length non-canon quest (just started) and unique meshes and textures from &#34;Credo WIP&#34; and others (not yet implemented).  ",
  "descriptionHtml": "INSTALL:\r<br />\r<br />Just drop the .esp in your data folder for now. I haven&#39;t done enough with the new meshes or textures for them to be necessary yet.\r<br />\r<br />REQUIREMENTS:\r<br />\r<br />***IN ORDER TO PLAY WITHOUT THE &#34;COC&#34; COMMAND, A SMALL CHANGE IN THE skyrim.ini FILE IS NECESSARY. THE LINE bBorderRegionsEnabled=0 WILL NEED TO BE ADDED TO THE [general] SECTION OF skyrim.ini, OTHERWISE, TO SKIP THE PATH TO THE NEW WORLDSPACE, ONE WOULD NEED TO USE THE COMMAND &#34;coc aetherswitchstation&#34; TO BEGIN. ***\r<br />\r<br />Unfortunately I did not notice until after and I&#39;m not sure I want to fix this because of location. To enter the new worldspace, I&#39;ve built a series of platforms and staircases leading to it. The problem is that it&#39;s out of bounds, but this can be fixed or avoided with the solutions above. Not very much is there anyhow, only a unique way to reach the new worldspace. \r<br />\r<br />CONFLICTS WITH OTHER MODS:\r<br />\r<br />As far as I know, there should be none. If, by chance, a mod uses the same location I did (unlikely) then there will of course be a conflict. Otherwise, since it is an entirely new worldspace, there shouldn&#39;t be any such problems. \r<br />\r<br />\r<br />\r<br />TO START: \r<br />\r<br />Travel to &#34;Bloodlet Throne&#34;, a castle/dungeon in the South part of the map, Southeast of Falkreath and Southwest of Helgen. From there, you will have to travel as far South as you can and then up the mountains to the West. If you get to the right place, you&#39;ll easily know it. \r<br />\r<br />THE STORY:\r<br />\r<br />I might add this later. I have it all thought out, but I&#39;m not sure I want to spoil anything&#33; \r<br />\r<br />CREDITS:\r<br />\r<br />Since nothing is implemented that I myself haven&#39;t done creatively utilizing Skyrim or the Creation Kit, and as I haven&#39;t yet made much use of custom meshes or textures, I do not have anyone to credit - YET. \r<br />\r<br />I do plan on using Credos WIP armors to give a more &#34;Germanic&#34; or &#34;Viking&#34; feeling to it, and potentially some other resources mods. I don&#39;t want to go overboard and end up with a thousand meshes and textures making the file-to-be-downloaded enormous, but I would like to incorporate more than Vanilla Skyrim. \r<br />\r<br />\r<br />\r<br />If anyone is willing to help me, send me a PM and I will read it. I&#39;m very meticulous with my work and wouldn&#39;t want just anybody - for my sake and theirs&#33; - but if someone were to having quest scripting?/writing experience, dialogue writing, etc. then I would be at their mercy.\r<br />\r<br />Thank you, and enjoy. ",
  "categoryId": "35",
  "version": ".9",
  "author": "leeknivek",
  "createdUnix": "1387767065",
  "updatedUnix": "1387767059",
  "containsAdultContent": false,
  "uploadedBy": "leeknivek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000087991",
      "name": "Aether",
      "version": ".9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "253",
      "fileName": "Aether-49090--9.rar",
      "uploadedUnix": "1387767059",
      "modVersion": ".9",
      "virusScanUrl": "https://www.virustotal.com/file/6e5d54f3acf92d5cbec0db294bc9d5fbb7e18be8102625c39013208f09786fd1/analysis/1407854579/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aether-49090--9.rar?fid=1000087991&ttl=1535829653&ri=8192&rs=8192&setec=04e1aa767a5c33d477c350a8adff642a"
    }
  ]
}