{
  "modId": 49095.0,
  "modName": "Stealthier Illusion",
  "summary": "Stealthier Illusion makes it so enemies dont track you down when you hit them with an illusion spell while sneaking. Also adds in a custom sneak spell.",
  "descriptionHtml": "[center][img]http://img541.imageshack.us/img541/92/xlcj.jpg[/img][/center]\r<br />\r<br />[center][youtube]MNBNYDFIgVs[/youtube][/center]\r<br />\r<br />\r<br />This is a mod I made for myself a long, loooong time ago.I haven&#39;t seen anything like it on the Nexus, but then I haven&#39;t been looking. Because I already have one.\r<br />\r<br /> [b]The video explains this:[/b] Stealthier Illusion removes the projectile from the three main illusion spells, Fear, Frenzy, and Calm. By doing this, enemies won&#39;t follow the trail back to you while you&#39;re sneaking, making it more effective for the classes illusion was designed for. It also makes it so there is a spell for each level, from Novice to Master, hopefully making it so you never have a problem where enemies are &#34;Too high level.&#34; All have been added to leveled item lists, so they can be bought from merchants, and found as loot in dungeons. It also adds two custom spells, Shroud of Shadows, which increases sneak by 30%. The idea is to give you something similar to invisibility to tide you over until you can actually buy the spell. And Muffle Other, which allows you to cast Muffle on other people.\r<br />\r<br />[b]Do note, however:[/b] These spells had to be changed to Target Actor to work, which means you must be aiming at a person/monster/animal, or it won&#39;t work. Also, it can still be stopped by objects, as though it has a projectile. Like how frenzy would &#34;pop&#34; on the back of a chair. It does not, however, give you away. But it does look like a glitch, when its not.\r<br />\r<br />All spells, except master level, work at a range of 100 ft.",
  "categoryId": "75",
  "version": "1.3",
  "author": "KotaShini",
  "createdUnix": "1387772700",
  "updatedUnix": "1398228239",
  "containsAdultContent": false,
  "uploadedBy": "KotaShini",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106182",
      "name": "Stealthier Illusion",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Stealthier Illusion-49095-1-3.rar",
      "uploadedUnix": "1398228239",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/19abdbddba4f4577d0005c3205e483e9e1888bfc8b14ed5fbbd006ee132e0d8c/analysis/1408036212/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stealthier%20Illusion-49095-1-3.rar?fid=1000106182&ttl=1535829662&ri=8192&rs=8192&setec=f4acf1e4487d2231f7a9a5707ecf9eb8"
    }
  ]
}