{
  "modId": 49106.0,
  "modName": "Phinix Geomantie DE",
  "summary": "Translation of Phinix Geomancy (short)",
  "descriptionHtml": "[img]http://www.iparadigm.org/pages/phigeomancy/phigeomancy.jpg[/img]\r<br />\r<br />[b][size=+1][Color=yellow]Dies ist die deutsche Version von [/Color] [URL=http://www.nexusmods.com/skyrim/mods/48802/?] Phinix Geomancy im Original von phinix[/URL][/size][/b]\r<br />[b][size=+1]Auf [URL=http://www.nexusmods.com/skyrim/mods/48802/?] seiner Seite[/url] findet ihr auch eine detailierte Beschreibung der Rezepte und Materialien.[/size][/b]\r<br />\r<br />\r<br />[b][size=+2][Color=orange]Über Geomantie[/Color][/size][/b]\r<br />\r<br />Durch das Lesen des Buches “Über Geomantie” wird die Kraft der Geomantie dem Spiel hinzugefügt. Durch diese können aus Edelsteinen (auch Seelensteine) Seelenstäube erzeugt werden. Aus diesen können dann in Verbindung mit weiteren Edelsteinstäuben magische Alchemiezutaten erzeugt werden. Es können auch aus Seelenstaub und Seelensteinfragmenten neue, leere Seelensteine erzeugt werden. Es gibt auch noch Möglichkeiten, Schmucksachen zu zerlegen, Metalle, Erze, Drachenknochen und –schuppen zu wandeln.\r<br />\r<br />[b][Color=orange]Wichtig:[/Color][/b] Ihr müsst wirklich erst das Buch “Über Geomantie” finden und lesen, damit ihr diese Kraft auch bekommt und die Handlungen auch ausführen könnt. Eine Kopie von diesem Buch kann in der Nähe von Calcelmo in der Festung Unterstein in Markarth gefunden werden. Seht euch dort im Bereich des Alchemietisches und des Arkanen Verzauberers um.\r<br />\r<br />[b][color=orange]Mit Version 1.4[/color][/b] wurden die 4 verschiedenen Formen der Geomantie eingeführt um verschiedene Aktionen dafür ausführen zu können. Das wären: zerlegen von Seelensteinen, erzeugen von Erzen, entladen von Gegenständen, erzeugen der verschiedensten Seelenstäube. \r<br />\r<br />[b][color=orange]Mit Version 1.56[/color][/b] wurde eine Art Preisvorschau eingeführt, der die ökonomischen Entscheidungen etwas einfacher macht. Wenn in der Liste Gegenstände erscheinen, die entladen und zerlegt werden können, dann wird zum einen der Gegenstand selbst angezeigt und ein Wert, der der Summe aller aus dem Gegenstand erzeugten Materialien entspricht. Auf diesem Wege kann man sich besser eine Meinung bilden,  ob es sich mehr lohnt, den Gegenstand an sich zu verkaufen oder die daraus erzeugten Materialien.\r<br />\r<br />Um ein Gefühl für den Umfang zu bekommen, könnt ihr euch diese Videos ansehen:\r<br />\r<br />[URL=http://www.youtube.com/watch?v=RK9wBbMZp-8]Geomantie der Edelsteinstäube[/URL]\r<br />[URL=http://www.youtube.com/watch?v=1rd2zc-cSvM]Geomantie der Seelensteine[/URL]\r<br />[URL=http://www.youtube.com/watch?v=KB39sbjIsFs]Geomantie der Materialwandlung[/URL]\r<br />[URL=http://www.youtube.com/watch?v=CMfXVkF85M4]Geomantie der Basismaterialien[/URL]\r<br />\r<br />[URL=http://www.youtube.com/watch?v=n5J07Iuhw2w]Materialien abbauen[/URL]\r<br />\r<br />\r<br />[b][Color=orange][size=+1]Dieser Mod hat einiges zu bieten:[/size][/Color][/b]\r<br />[b]Erzeugen von verschiedenen Mengen (schwarzem) Seelenstaub in Abhängigkeit des gefüllten Seelensteins.[/b] Dieser Seelenstaub könnte zwar für die normale Alchemie benutzt werden, aber weitaus nützlicher ist er als Grundstoff für Rezepte in Verbindung mit verschiedenen weiteren Seelenedelsteinstäube oder Metallstäube um Zutaten mit besseren magischen Eigenschaften zu erzeugen. Stäube können aus geladen sowie auch entladenen Gegenständen erzeugt werden, geladene Gegenstände ergeben dazu noch Seelenstaub.\r<br />\r<br />[b][Color=yellow]Erzeugen von verschiedenen Edelsteinstäube in Abhängigkeit des Edelsteins und Kombinierung mit Seelenstaub.[/Color][/b] Damit können neue Kombinationen von alchemistischen Effekte für Tränke und Gifte gefunden werden, [u]welche im Standardspiel nicht möglich sind[/u].\r<br />\r<br />[b][Color=yellow]Erzeugen von leeren Seelensteinen aller Art[/Color][/b] indem aus Seelensteinfragmenten Fragmentstaub erzeugt wird und in der Kombination mit verschiedenen Mengen Seelenstaub diese leeren Seelensteine dann letztendlich erzeugt werden. Diese Rezepte sind natürlich ausgewogen und abgestimmt (balanced), so daß z. B. mit einem gefüllten großen Seelenstein mehr Seelenstaub erzeugt wird, als für das Erzeugen eines leeren großen Seelenstein benötigt werden würde. Dies wurde so gewählt, damit es sich für euch auch lohnt, gefüllte Seelensteine zu zerlegen. [u]Ihr könnt natürlich aus leeren Seelensteinen auch Seelensteinfragmente erzeugen[/u]. \r<br />\r<br />[b][Color=yellow]Erzeugen von Metallstaub aus Erzen und Barren.[/Color][/b] Werden diese Metalstäube dann mit Seelenstaub vermengt, bekommt man erweiterte Stäube, die dann wiederum als Grundlage in der Alchemie verwendet werden können. Ganz wie bei den Edelsteinstäuben.\r<br />\r<br />\r<br />[b][Color=yellow]Entziehen der kleinen magischen Restessenz aus nicht magischen oder magischen Ringen, Halsketten oder Diademen[/Color][/b] um Basisstäube zu erhalten. Geladene Schmuckstücke geben dabei noch zusätzlich Seelenstaub ab, so dass nicht nur Seelensteine dafür benutzt werden müssen.\r<br />\r<br />Zusätzlich zu der Möglichkeit im Geomantiemenü diese Zutaten zu erzeugen, werdet ihr diese auch überall in der Welt zerstreut finden können. Ganz so, wie die Standardalchemiezutaten gefunden werden können (in Truhen und Fässern, bei Händlern und NPC’s etc). Manchmal findet man auch gleich ganz besondere Rezepte. \r<br />Die Qualität der Stäube, die ihr finden werdet, sind in direkter Abhängigkeit zu eurer Stufe und sind umso mächtiger, je höher eure Stufe ist. [u]Für mehr Informationen über die Wissenschaft der Geomantie, siehe im Buch „Über Geomantie“ nach[/u], welches in der Nähe von Calcelmo in der Festung Unterstein in Markarth gefunden werden kann. Manchmal stolpert man aber auch in der Welt von Himmelsrand über Abschriften davon.\r<br />\r<br />Die Jar Modelle wurden alle mittels Blender erzeugt und optimiert um ein gutes Verhältnis von Grösse und Auflösung zu bekommen. Die Qualität der Meshes ist mit denen von Mods wie z.B. [URL=http://www.nexusmods.com/skyrim/mods/8655/?]SMIM[/URL] durchaus zu vergleichen.\r<br />\r<br />[b][Color=orange][size=+1]INSTALLATION & UPDATE[/size][/Color][/b]\r<br />Kopiert phigeomancy.esp und phigeomancy.bsa in euren Skyrim-&gt;Data Ordner und aktiviert die esp in eurer Mod Liste. Es ist absolut notwendig mit [URL=http://www.nexusmods.com/skyrim/mods/1840/]Wrye Bash[/URL] eine „zusammengeführte Leveled List“ (merged leveled list = Bashed Patch) zu erzeugen, damit die in der Welt verstreuten Dinge auch wirklich gefunden werden können. Deshalb ist es wichtig bei JEDER Veränderung der Ladeliste diesen Bashed Patch mit [URL=http://www.nexusmods.com/skyrim/mods/1840/]Wrye Bash[/URL] neu zu erzeugen, ansonsten wird die Mod nämlich nicht richtig funktionieren.\r<br />[b]Beim updaten wird kein Cleansave, Skriptstop etc benötigt, also simples überschreiben. [color=red]Lediglich der Bashed Patch ist mit [/Color] [URL=http://www.nexusmods.com/skyrim/mods/1840/]Wrye Bash[/URL] [color=red]unbedingt neu zu erzeugen.[/Color][/b]\r<br />\r<br />[b][Color=orange][size=+1]SEELENSTEINE AUS FRAGMENTE ERZEUGEN[/size][/Color][/b]\r<br />Seelensteinfragmente können kombiniert werden um ganze Seelensteine zu erzeugen. Dafür müsst ihr zuerst aus den Seelensteinfragmenten Fragmentstaub machen und diesen dann mit weiteren Zutaten kombinieren um dann als Ergebnis ungefüllte Seelensteine zu bekommen. Für höherwertigere Seelensteine wird dabei auch mehr Seelenstaub benötigt als wiederum für niederwertigere. Dieser Seelenstaub kann wiederum auch mittels der Geomantie erzeugt werden und zwar in dem gefüllte Seelensteine magisch zerlegt werden. Für die verschiedenen Seelensteine werden die folgenden Zutaten benötigt:\r<br />  \r<br />[b][Color=yellow]Winziger Seelenstein[/Color][/b]\r<br />•\tSeelensteinfragment x2\r<br />\r<br />[b][Color=yellow]Kleiner Seelenstein[/Color][/b]\r<br />•\tSeelensteinfragment x2\r<br />•\tSeelenstaub x1\r<br />\r<br />[b][Color=yellow]Gewöhnlicher Seelenstein[/Color][/b]\r<br />•\tSeelensteinfragment x3\r<br />•\tSeelenstaub x1\r<br />\r<br />[b][Color=yellow]Großer Seelenstein[/Color][/b]\r<br />•\tSeelensteinfragment x4\r<br />•\tSeelenstaub x2\r<br />\r<br />[b][Color=yellow]Mächtiger Seelenstein[/Color][/b]\r<br />•\tSeelensteinfragment x5\r<br />•\tSeelenstaub x2\r<br />\r<br />[b][Color=yellow]Schwarzer Seelenstein[/Color][/b]\r<br />•\tSeelensteinfragment x5\r<br />•\tSchwarzer Seelenstaub x2\r<br />\r<br />\r<br />[b][Color=orange][size=+1]SEELENSTAUB[/size][/Color][/b]\r<br />Der Seelenstaub für die ganzen oben stehenden Rezepte wird auch wiederum mittels der Geomantie erzeugt und zwar in dem gefüllte Seelensteine magisch zerlegt werden. Dabei werden die folgenden Mengen bei den verschiedenen, gefüllten Seelensteinen erzeugt: \r<br />\r<br />[b][Color=yellow]Gefüllter winziger Seelenstein[/Color][/b]\r<br />•\terzeugt Seelenstaub x1\r<br />\r<br />[b][Color=yellow]Gefüllter kleiner Seelenstein[/Color][/b]\r<br />•\terzeugt Seelenstaub x2\r<br />\r<br />[b][Color=yellow]Gefüllter gewöhnlicher Seelenstein[/Color][/b]\r<br />•\terzeugt Seelenstaub x3\r<br />\r<br />[b][Color=yellow]Gefüllter großer Seelenstein[/Color][/b]\r<br />•\terzeugt Seelenstaub x4\r<br />\r<br />[b][Color=yellow]Gefüllter mächtiger Seelenstein[/Color][/b]\r<br />•\terzeugt Seelenstaub x5\r<br />\r<br />[b][Color=yellow]Gefüllter schwarzer Seelenstein[/Color][/b]\r<br />•\terzeugt schwarzer Seelenstaub x4\r<br />\r<br />\r<br />[b][Color=orange][size=+1]SEELENEDELSTEINSTAUB & ALCHEMIE[/size][/Color][/b]\r<br />Seelenedelsteinstaub wird erzeugt indem Edelsteine mittels Geomantie zerlegt werden. Diese können dann mit allen in Himmelsrand vorkommenden Alchemiezutaten kombiniert werden um damit die verschiedensten Rezepturen zu erzeugen.  Ihr werdet in der Welt verstreut auch immer mal wieder Rezepte für solche Mixturen finden können.\r<br />\r<br />\r<br />[b][Color=orange][size=+1]CHANGELOG des originalen Mod[/size][/Color][/b]\r<br />[b]v1.0[/b]\r<br />[list][*]Initialer Release\r<br />[/list]\r<br />[b]v1.1[/b]\r<br />[list][*]Fügte die Möglichkeit hinzu, daß aus den verschiedenen leeren Seelensteinen eine unterschiedliche Anzahl an Fragmente erzeugt werden.\r<br />[*]Fügte die Möglichkeit hinzu, aus diesen dann Fragmentstaub zu erzeugen und bei der Vermischung mit Seelenstaub wiederum neue Edelsteine zu erzeugen. Mit dieser Methode kann man Steine aufwerten\r<br />[/list]\r<br />[b]v1.2[/b]\r<br />[list][*]Fügte die Kraft „Geomantie“ hinzu, mit der über ein Menü die Aktionen erledigt werden können\r<br />[/list]\r<br />[b]v1.2b[/b]\r<br />[list][*]Geomantie kann jetzt nur erlernt werden, wenn auch das Buch gelesen wird\r<br />[/list]\r<br />[b]v1.4[/b]\r<br />[list][*]Fügte die Möglichkeit hinzu, aus Erzen und Barren Stäube zur Weiterverarbeitung zu erzeugen\r<br />[*]Fügte die Möglichkeit hinzu, Schmuckstücke in ihre Bestandteile zu zerlegen. Dabei wird bei magischen Schmuckstücken auch Seelenstaub erzeugt\r<br />[*]Buch „Über Geomantie“ bei Calcelmo in Markarth plaziert\r<br />[/list]\r<br />[b]v1.4a[/b]\r<br />[list][*]Fügte die neuen Metallstäube zu den Leveled Lists hinzu. Unbedingt den Bashed Patch erneuern, damit diese auch erscheinen&#33;\r<br />[/list]\r<br />[b]v1.5[/b]\r<br />[list][*]Fügte Dwemermetall, Stahl, Drachenknochen und –schuppen zur Materialwandlung hinzu\r<br />[*]Fügte die Möglichkeit hinzu, daß an Schmelzöfen Stäube wieder zu Barren geschmolzen werden können\r<br />[/list]\r<br />[b]v1.54[/b]\r<br />[list][*]Fügte Mammutknochenstaub zur Materialwandlung hinzu. Ein Mammutstoßzahn ergibt 4 Stäube\r<br />[*]Fügte alle Amulette der Göttlichen zur Geomantieliste hinzu\r<br />[*]Fügte einige weitere Gegenstände zur Geomantieliste hinzu, wie z.B. Questbelohnungen\r<br />[*]Änderte das Geomantiemenü ab, so daß alle möglichen Rezepte angezeigt werden, egal ob man die Zutaten im Inventar hat oder nicht\r<br />[/list]\r<br />[b]v1.54a[/b]\r<br />[list][*]Seelensteinfragmentstaub wird nun unter der Geomantie der Seelensteine erzeugt. So ist es logischer und damit wird das Ändern von Steinen zu Staub und wieder zu Steinen viel einfacher, da immer im gleichen Menü\r<br />[/list]\r<br />[b]v1.55[/b]\r<br />[list][*]Effekte der meisten Zutaten neu ausbalanciert\r<br />[*]Granat- und Rubintexturen waren vertauscht\r<br />[*]Fügte viele neue Rezepturen hinzu die überall zu finden sind [URL=http://www.nexusmods.com/skyrim/mods/48802/?](siehe Original Seite)[/url]\r<br />[*]Preise für die meisten Zutaten neu ausbalanciert\r<br />[*]Erhöhte die Anzahl der Stäube die sich erzeugen lassen\r<br />[/list]\r<br />[b]v1.56[/b]\r<br />[list][*]Goldwertvorschau als Summe der Goldwerte der möglichen erzeugten Materialien eingeführt bevor der Gegenstand wirklich zerlegt wird\r<br />[/list]\r<br />[b]v1.57[/b]\r<br />[list][*]Ein paar kleinere Bezeichnungskorrekturen, änderte manche Namen der Tränke und Giftrezepte\r<br />[*]Fügte Knochenstaub aus Troll- und menschlichen Schädeln hinzu\r<br /> [/list]\r<br />[b]v1.58[/b]\r<br />[list][*] Allgemeine Rezepturen für das erzeugen der Stäube und Steine geändert, so daß die erzeugten Materialien mehr dem hineingesteckten entsprechen. \r<br />[*] Fehler bei der Summenberechnung der voraussagenden Preisberechnung behoben\r<br />[/list]\r<br />[b]v1.58a[/b]\r<br />[list][*] Goldene Statue der Dibella kann nun auch extrahiert werden\r<br />[/list]\r<br />[b]v1.58b[/b]\r<br />[list][*]veränderte ein wenig die Anzahl der erzeugten Knochenstäube. Menschliche Schädel ergeben jetzt 2 anstatt 3, Trollschädel 3 anstatt 5\r<br />[/list]\r<br />\r<br />\r<br />[b][Color=orange][size=+1]CHANGELOG der Übersetzung[/size][/Color][/b]\r<br />[b]v1.54.0[/b]\r<br />[list][*]Initialer Release\r<br />[/list]\r<br />[b]v1.54a.0[/b]\r<br />[list][*]original Version 1.54a übersetzt und veröffentlicht\r<br />[/list]\r<br />[b]v1.55.0[/b]\r<br />[list][*]original Version v1.55 übersetzt und veröffentlicht\r<br />[/list]\r<br />[b]v1.56.0[/b]\r<br />[list][*]original Version v1.56 übersetzt und veröffentlicht\r<br />[/list]\r<br />[b]v1.57.0[/b]\r<br />[list][*]original Version v1.57 übersetzt und veröffentlicht\r<br />[/list]\r<br />[b]v1.58.0[/b]\r<br />[list][*]original Version v1.58 übersetzt und veröffentlicht\r<br />[/list]\r<br />[b]v1.58a.0[/b]\r<br />[list][*]original Version v1.58a übersetzt und veröffentlicht\r<br />[/list]\r<br />[b]v1.58b.0[/b]\r<br />[list][*]original Version v1.58b übersetzt und veröffentlicht\r<br />[/list]\r<br />\r<br />\r<br />",
  "categoryId": "78",
  "version": "1.58b.0",
  "author": "mditsch",
  "createdUnix": "1387869345",
  "updatedUnix": "1388218164",
  "containsAdultContent": false,
  "uploadedBy": "mditsch",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000088504",
      "name": "Phinix Geomantie DE",
      "version": "1.58.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2336",
      "fileName": "Phinix Geomantie DE-49106-1-58-0.7z",
      "uploadedUnix": "1388097059",
      "modVersion": "1.58.0",
      "virusScanUrl": "https://www.virustotal.com/file/27d57a603d739df4ab083714694b8b6c77591bd3120dc3bfd0f992fe16595076/analysis/1407860110/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phinix%20Geomantie%20DE-49106-1-58-0.7z?fid=1000088504&ttl=1535829692&ri=8192&rs=8192&setec=914fab0fd2d7ded4f95fba1ce5b824b0"
    },
    {
      "fileId": "1000088547",
      "name": "Phinix Geomantie DE",
      "version": "1.58a.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2336",
      "fileName": "Phinix Geomantie DE-49106-1-58a-0.7z",
      "uploadedUnix": "1388131218",
      "modVersion": "1.58a.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f271a6619dd5a2c813c4f93f747c2c5d8c55b2beb34332bb338a4cc4bc0be89/analysis/1407860593/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phinix%20Geomantie%20DE-49106-1-58a-0.7z?fid=1000088547&ttl=1535829692&ri=8192&rs=8192&setec=17e7aa9f40a1766e8104493441a76679"
    },
    {
      "fileId": "1000088669",
      "name": "Phinix Geomantie DE",
      "version": "1.58b.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2336",
      "fileName": "Phinix Geomantie DE-49106-1-58b-0.7z",
      "uploadedUnix": "1388218164",
      "modVersion": "1.58b.0",
      "virusScanUrl": "https://www.virustotal.com/file/85e4aafef1e134e4266ef0eca492654d821d98fe6f881fe2bd4592aecab07e44/analysis/1407861909/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phinix%20Geomantie%20DE-49106-1-58b-0.7z?fid=1000088669&ttl=1535829693&ri=8192&rs=8192&setec=0f62cad85b2f384d84f31197e2f8530a"
    }
  ]
}