{
  "modId": 49128.0,
  "modName": "XunAmarox Colored Map Markers",
  "summary": "Contest winning map marker design based on EzEs Colored Map Markers. SkyUI 4.1 & all DLC compatible. Colored compass & unvisited markers included.",
  "descriptionHtml": "[center][img]http://static1.nexusmods.com/15/mods/110/images/49128-1-1387873756.png[/img][/center]\r<br />[color=#5ea2e5][b][size=6]Summary:[/size][/b][/color]\r<br />[url=http://forums.nexusmods.com/index.php?/topic/830104-wip-colored-map-markers-next-set/]Contest winning map marker design[/url] based on [url=http://www.nexusmods.com/skyrim/mods/26556]EzEs Colored Map Markers[/url]. SkyUI 4.1 & all DLC compatible. Colored compass & unvisited markers included.\r<br />\r<br />[color=#5ea2e5][b][size=6]Required:[/size][/b][/color]\r<br />[url=http://www.nexusmods.com/skyrim/mods/3863]SkyUI 4.1[/url] - May not actually be required... If you don&#39;t use it, let me know if it works alright without it.\r<br />I&#39;m not sure how it&#39;ll do on older versions of Skyrim since there are markers from Dragonborn & Dawnguard. I&#39;m also not sure if not having those DLC will affect it.\r<br />\r<br />[color=#5ea2e5][b][size=6]Design:[/size][/b][/color]\r<br />I started out with the idea that not everything needed unique colors because it becomes overwhelming and confusing and similar places should share colors to reduce clutter and make things easier to find on the map. So to do that I went through and reorganized the whole thing to make sure it all made sense. I tried to use mostly desaturated warm colors to that end. As for the coloring itself... I went with a yellow/orange (same spectrum) combination for the Major Cities & Palaces because I wanted them to be visible but not obnoxiously colorful, but still look related (e.g. same spectrum). They could have been about any color, but I thought a warm color would go best with the rest of the colors I chose which were also in the warm color spectrum.\r<br />\r<br />I went with a very desaturated light brown color to indicate settlements because they&#39;re things that shouldn&#39;t really stand out that much and aren&#39;t a threat, so they should have a very mild color. For dungeons (e.g. very dangerous places) I gave them red as per the natural color response stimuli of red meaning danger so it indicates that the places is probably going to be hostile and dangerous, but I kept it very light and desaturated since these places are numerous as to not overwhelm the map with colors and become overly obnoxious... For the other world locations I went with a darker brown since they&#39;re more important than settlements though generally not as hostile as the more dangerous locations. The dark brown is a bit more vibrant, but brown tends to not be a color people associate with colorful and vibrant, so I figured it wouldn&#39;t draw too much attention other than making them noticeable.\r<br />\r<br />As for the couple of special things, I wanted them to be very identifiable. Daedric Shrines are very rare in the world and attributed to Daedric Princes, so I wanted that to really stand out on its own. Dragon Lairs, a very dangerous and very unique set of places on the map and there aren&#39;t that many of them. With the Doomstones, I wanted these to have their own color and stand out more than other things because being able to find and change one&#39;s sign is pretty important. Giant Camps I made a lighter slightly more saturated red than the dungeons because they aren&#39;t really dungeons, but they&#39;re still extremely dangerous places. As for Stormcloak/Imperial camps, I wanted to give them their side&#39;s respective colors: red and blue.\r<br />\r<br />Now, the player markers... Those are things the player is going to be seeing all the time and they tend to be vitally important. That&#39;s why I chose to go with green for the markers indicating places the player needs to go, since I made sure not to use the green spectrum anywhere else on the map so they would be noticeable. I left the generic markers a desaturated green, but made the player&#39;s custom marker a very bright green to be still in the same spectrum of normal markers, but to really pop out. I made the locked door thing an orange-ish color to indicate you can&#39;t go that way or it needs a key or whatever so it would be obvious but not stand out too much. And the player marker itself... I was actually really iffy on that. At first I had it a really bright red to make it stand out, but after I went with red for dungeons and Imperial camps I decided it might get too washed out and be hard to find... so I gave it a unique color. I went with the blue spectrum since very few things used that, but went much brighter so it&#39;d be immediately noticeable and really pop out.\r<br />\r<br />[color=#5ea2e5][b][size=6]History:[/size][/b][/color]\r<br />Back in November of 2012 I won a design contest for the next new design of EzEs Colored Map Markers (linked above). I&#39;ve used it ever since - I love it. Unfortunately when xEightballx updated his mod for SkyUI 4.1, much to my dismay, mine was never included. I completely understand -- it took me [i]hours[/i] to do just this [u]one[/u] while xEightballx was juggling 12 different versions. Insanity&#33;\r<br />\r<br />It makes sense to me in retrospect why only a handful were chosen to be updated and also why he does not include unvisted markers or the vast majority of compass markers. If you just do the map&#39;s discovered markers that&#39;s 1/2 of one page. If you do what I&#39;ve done however, it&#39;s a full page for both the discovered and undiscovered markers, and then that is doubled because I did them for the compass as well. So my one map marker set that I&#39;m uploading now is probably equivalent to about 4 of the others in terms of how much was done.\r<br />\r<br />Making these colored map markers [u]is not[/u] hard. It [i]is[/i] however tedious and time consuming. If you want to know how to do it yourself, it&#39;s really so simple anyone could do it; xEightballx [url=http://www.nexusmods.com/skyrim/articles/1367]has a video tutorial on how to do it, so check it out[/url] if you&#39;re interested. I couldn&#39;t have made this without it.\r<br />\r<br />The biggest problem for me using SWF Decompiler is that it doesn&#39;t play nice. Ctrl+A and Ctrl+V don&#39;t work so I have to manually highlight then right click and choose paste every time and every single time I have to select Solid from a drop down on what type of fill I want to do. Then, pretty frequently all the thumbnails will just disappear so I&#39;d have to close the program and re-open it. Then, sometimes it refused to fill some markers at all and I had to go into select and individual groups and ninja my way around it. Tedious, time consuming, and a lot of work done exclusively with one hand since your other is completely useless.\r<br />\r<br />All of that said, with the stark reality that EzEs markers will likely never be updated with mine ever again and xEightballx&#39;s video tutorial found I decided to just do it all from scratch myself, updated for SkyUI 4.1 and all the DLC&#39;s.\r<br />\r<br />I actually had to redo the compass markers 3 times because first I started on the one included with EzE&#39;s which was horribly outdated, then I did it on the one extracted from my Interface bsa file, and then finally once more on the one from my Update bsa file. I&#39;d gotten at least 80% done on each of those so yeah.. I was ready to start banging my head against the wall.\r<br />\r<br />[color=#5ea2e5][b][size=6]Changelog:[/size][/b][/color]\r<br />1.1 - Shape 307 which was previously thought unused (3 quest pointers stuck together) was colored (it&#39;s used one time, when you&#39;re sent to talk to Arngeir for the Peace Council I believe, or something like that). So, just minor update. You probably won&#39;t even notice, but I&#39;ve got you covered anyways. :P\r<br />1.0 - Initial release\r<br />\r<br />[color=#5ea2e5][b][size=6]Credits:[/size][/b][/color]\r<br />xEightballx&#39;s [url=http://www.nexusmods.com/skyrim/articles/1367]video tutorial[/url] on how to edit Skyrim SWF & GFX files. I couldn&#39;t have made this without it. Also, he should be credited for the contest which inspired me to originally design my own map marker scheme.",
  "categoryId": "42",
  "version": "1.1",
  "author": "XunAmarox",
  "createdUnix": "1387862997",
  "updatedUnix": "1388571920",
  "containsAdultContent": false,
  "uploadedBy": "XunAmarox",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000088144",
      "name": "XunAmarox Colored Map Markers",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "190",
      "fileName": "XunAmarox Colored Map Markers-49128-1-0.7z",
      "uploadedUnix": "1387862677",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7b90f6d87f17be9fa820789f05f08d5023b700e0936cdcd4409e51109d752a3b/analysis/1407856507/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XunAmarox%20Colored%20Map%20Markers-49128-1-0.7z?fid=1000088144&ttl=1535829733&ri=8192&rs=8192&setec=08187151d1706c597c8970648e902f15"
    },
    {
      "fileId": "1000089310",
      "name": "XunAmarox Colored Map Markers 1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "190",
      "fileName": "XunAmarox Colored Map Markers 1-1-49128-1-1.7z",
      "uploadedUnix": "1388571920",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9f3e7774b339b07c82834435cc60136fc3b887e6e1f5c6c0a5e67c91808861a8/analysis/1407867250/",
      "changelogHtml": " Shape 307 which was previously thought unused (3 quest pointers stuck together) was colored (it&#39;s used one time, when you&#39;re sent to talk to Arngeir for the Peace Council I believe, or something like that). So, just minor update. You probably won&#39;t even notice, but I&#39;ve got you covered anyways. :P <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XunAmarox%20Colored%20Map%20Markers%201-1-49128-1-1.7z?fid=1000089310&ttl=1535829733&ri=8192&rs=8192&setec=d19d3bdafb54749cfe021b224b014b05"
    }
  ]
}