{
  "modId": 49162.0,
  "modName": "Fine Goods from Morrowind_The Gray Quarter - Dragonborn",
  "summary": "I thought the Gray Quarter would be a haven for my kind...",
  "descriptionHtml": "[i]It&#39;s seven in the morning - one hour before opening times - and Ambarys, having finished to refill the shelves with drinks, leans on the counter with a feeling of self-congratulation. Things have been going well for the Cornerclub lately, thanks to the many generous patrons who frequently visit; and as their numbers grow, so do the coins gather in Ambarys&#39;s secret money jar. He steps on the loose end of one of the planks on the floor - which one it is of the many, only he knows - and takes the jar from underneath. It&#39;s almost full. It will not be long until he can leave this dirthole in high style, just like he always wanted.\r<br />He muses over this thought. Hire a ship, no less, and ride into New Gnisis on the back of a Silt Strider like a lord, leaving this shameful pit by the same name with all its old, rotten furniture to Malthyr to manage it however he wishes. \r<br />Now that he thinks of it - what&#39;s up with all this snowback furniture anyway? \r<br />Most of it was left over from a time when this place was still called the Snow Quarter - and they pretty much look like it, too. He was about to get some new stools, because the old ones were in danger of crushing in under the next dancing drunkard&#39;s feet any moment now; he had thought of a carpenter at the other end of the city who works fast and cheap... but now he&#39;s completely revolted by his own idea. To support those Nords with his own coin?&#33; That&#39;s completely ridiculous. He runs his eyes through the shabby pub and all he sees is Nord shelves, Nord seats, Nord chandeliers... even their sight makes him feel sick. No Dunmer in their right mind could ever feel at home in a place like this. \r<br />\r<br />The idea that struck him was not more than a passing thought, but it&#39;s enough to set his imagination blazing alight and he needs to sit down a minute. Close the Cornerclub for a few days... three-four at most. And when the door opens and his fellow mer come back again, their jaws would drop open at the sight. ....But - first he would need to write to some people. \r<br />\r<br />As if in a fever, he quickly grabs a paper roll, tears it in half, and scribbles a message on each pieces. One of them is for an old friend who stayed in the homeland. He hasn&#39;t talked to her in decades and doesn&#39;t know what have become of her since, but there was a time once when she had the best alcohol to touch Dunmeri lips in all of the known world. The other message is for Sadri: he knows some Dunmer merchant from Riften with good connections. Having finished, he stops, playing with the quill in deep thought. He folds the sheets - will try to find a courier later - and takes the jar into his hands. Once this venture is over, its content will vastly decrease. One more year in the Nord prison. But his feelings of resentment begin to dissolve in a vision of  warm lanternlight and sparkling smolders. He hides the jar in its proper place and kicks the loose plank in as well. \r<br />&#34;Malthyr.&#34; There&#39;s no response. &#34;Malthyr&#33; Dagon take you, are your ears on your feet or what?&#33;&#34; \r<br />&#34;I wish they were. What now, boss?&#33;&#34; comes a croak from the upmost floor. \r<br />&#34;We used to have some old banners. A whole box of them, somewhere laying around.&#34; \r<br />&#34;Yeah? What with it?&#34; \r<br />&#34;Move your gods-damned ass and get it over here. This instant. I&#39;ve got a job for you...&#34;[/i]\r<br />[line]\r<br />A NOTE \r<br />The mod has been sitting around near-ready for some time now and it is no coincidence that I present it to you exactly today. I would like you to think of this as a Christmas/[what you celebrate, if anything] present for all of you. On the one hand, it was created from a feeling of gratefulness for the overwhelming positive response and encouragement that my first mod has received; and while I always only tinkered with the CK for my own enjoyment, now thanks to you I feel very confident about coming out of the modding closet. To make a Gray Quarter overhaul has been requested by many people independently, and I obliged. (Know it that because I spend far more time modding this game than playing it, prior to making this mod I had never visited Windhelm - thus I have made a conscious sacrifice by having a large area of the city spoiled before its appointed time. Bask in the beauty of the place in a minute of silence contemplating my selfless act as you walk the streets.) It is also a thanks to the modders to whom I owe a tremendous amount of fun in the past two years which could have never been possible without them, and who have all contributed making a legendary game series, without doubt, the best in the world. Thanks all people of Tamriel, and merry Saturalia&#33;\r<br />[line]\r<br />[b]That all sounds very sweet, but what does this mod do?[/b] \r<br />Here are the many changes that this mod does:\r<br />\r<br />THE CORNER CLUB - The Gray Quarter has put every effort together to create one little corner of Skyrim feel like home. The furniture is shiny and new, but modelled after the ones they craft in Morrowind, and praises the work of immigrant carpenters. Every surplus banner and rug from the family collections ended up here. Decorative braziers heat the freezing Windhelm air and fill it with thick smoke. Unless you are a Dunmer yourself, better prepare your lungs - this is not Kyne&#39;s fresh air from High Hrothgar&#33; The Dunmer of Windhelm no longer seek anyone&#39;s approval but their own. Remember: you can get in, if you CAN get in. Decoration aside, Ambarys has renewed some long-lost connections from the homeland and thanks to them, he will now stock an amount of Morrowind food that may largely vary between 3 and 15 food items or beverages (each).\r<br />\r<br />SADRI&#39;S USED WARES - The interior of this shop has been vastly redecorated as well, so that you can really feel like you&#39;ve just bought some shit from the thrift shop, whenever you visit. Other than whatever he normally sells, he is now \r<br />10% likely to sell 1-2 spell tomes,\r<br />50% likely to sell 1-3 pieces of enchanted weapons, 1-5 pieces of unenchanted clothes or weapons, 1-10 potions and 1-30 ingredients,\r<br />75% likely to sell 1-12 pieces of crafting material and 1-20 books,\r<br />and will always sell 2 pieces of Dunmeri clothing.\r<br />\r<br />THE ROOFTOPS - An area which had not been used before is now open for the public to access - if they dare. The following furniture has been added:\r<br />~ a Cooking Pot\r<br />~ a Cooking Spit\r<br />~ a Wood Chopping Block\r<br />~ a bedroll for anyone to use\r<br />~ quite a few places to sit.\r<br />\r<br />DUNMER HOMES - The interiors of Dunmeri houses are modestly decorated with as little as they managed to save from the home country. Just like their inhabitants, they stand tattered and weather-worn, but proud, clinging onto what is left - a memory of old glory. \r<br />\r<br />THE DUNMER OF WINDHELM - Certain characters now decide to express their culture by their clothing as a form of silent resistance in oppression. \r<br />\r<br />THE STREETS - The Dunmer have been having problems with keeping the streets clean, especially since some vagrants started to deliberately litter the place. If you decide to help them clean, no one will give you a sweetroll; however, doing such a selfless good deed is a reward on its own. (And you can never know what you might end up finding. One mer&#39;s trash is another man&#39;s comeup...)\r<br />\r<br />THE GUESTBOOK - It lays on a table in the Cornerclub. Don&#39;t forget to sign it&#33;\r<br />[line]\r<br />KNOWN ISSUES\r<br /> ~ You should know that during the making of this mod, a gratuitous amount of mead has been consumed (no, I really mean it); if there is anything off, you&#39;ll know which Daedric Prince to blame. \r<br /> ~ I very strongly do not recommend harvesting the plants on the streets. Even though it is not visibly marked in the game for ownership, the inhabitants will take offense, and the Nord guards, who care so little about the life of their fellow citizens, will suddenly seem very sensitive about the plants they raise in front of their homes. It is all quite strange, but the Gray Quarter is indeed a strange place, playing by its own rules. \r<br /> ~ If you wish to remove one of the Scathecraw buckets, you can try but you will find they are nailed onto the surface below them and cannot be moved. \r<br /> ~ In the Cornerclub&#39;s food storage room, the pile of Ash Hopper Legs sometimes decide to hop out of their proper place and I have given up to try to keep order among them.\r<br /> ~ If you walk the rooftops, know that you tread on grounds that were originally not intended to walk on. Some odd behaviours like standing &#34;above&#34; ground floating, or clipping into it are bound to happen, but so far I had no experience of followers getting stuck or any other issue that was not purely cosmetic. Odd clippings are especially due in the rooftops of the central area; to be on the safe side, your followers even in spite of having seen some shit will find it way too risky and dangerous to follow you there. Because you are the Dragonborn and you have no fear of dead wood, you are welcome to explore it however; your ankles might sink into the pile of planks, but they will not crack under your feet (I&#39;ve tested). Quite a few small surprises were left there to discover as well.\r<br /> ~ There is one more minor issue relating to the central rooftops; some of the items are placed there are not visible from all angles, and you might see their shadows at first before the actual items would come to your sight. I think this has something to do with the odd meshes on the rooftop and therefore is out of my power to fix. Krosis.\r<br />\r<br />COMPATIBILITY\r<br />This mod requires Dragonborn and is likely to crash your game instantly if you don&#39;t have it, or you accidentally left it out of your load order. \r<br />If you have such a mod as for example Open Cities, the city streets will be unchanged. You can still enjoy the rest of the functionality of the mod; the interiors and shops will work as normal. \r<br />\r<br />SIMILAR AND RECOMMENDED MODS\r<br />This mod might not work for everybody, or could clash with other mods you use for voodoo reasons; if you know of any mods you can recommend besides or instead of this mod, please let me know and I will link it here. \r<br />[url=http://www.nexusmods.com/skyrim/mods/31491/?]Morrowind Imports[/url] - from the practical point of view, pretty much the same mod in my understanding but focuses less on the Dunmeri swag (might be useful if the gazillion decorations make your computer slow) If anyone can confirm whether Morrowind Imports is compatible with this mod, I would be grateful. \r<br />[url=http://www.nexusmods.com/skyrim/mods/40817/?]Fine Goods From Morrowind[/url] - Just in case somebody has missed.\r<br />[url=http://www.nexusmods.com/skyrim/mods/30450/?]Realistic Lighting[/url] - If you want your Gray Quarter to look the exact same way as seen in my screenshots, this is a little graphic addition that I use. Mind you that it makes interiors quite dark. Torches/Staff of Magelight/Candlelight spell will finally have a good use in dungeon-delving, if you decide to use this mod.\r<br />If you wish to make your Gray Quarter and all around Skyrim a bit more populated and lively, I could recommend such mods as [url=http://www.nexusmods.com/skyrim/mods/36334/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D36334%26preview%3D&pUp=1]Inconsequential NPCS [/url] or [url=http://www.nexusmods.com/skyrim/mods/13837/?]Randomly-Generated Generic Townsfolk [/url]- these are the two I use at the moment and I can comfirm to be compatible. \r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=390129&searchtext=skyradio]SkyRadio[/url] - In case you would like [url=http://www.youtube.com/watch?v=QK8mJJJvaes]this song[/url] to play in Sadri&#39;s Used Wares, or want to party to [url=http://www.youtube.com/watch?v=2Y-O9_HC9RQ]this song[/url] in the Cornerclub. Slip into your Temple Priest Robes/Padded Fur-trimmed Cloak, put the Dwemer boombox on your shoulder and let the Gray Quarter hear who&#39;s got this bitch locked down. More suggestions for songs are VERY welcome. EDIT. Someone stole your sweetroll, and the Windhelm guards don&#39;t give a damn? They&#39;ve searched you for skooma already the second time this week, just because you are a Dunmer? [url=https://www.youtube.com/watch?v=51t1OsPSdBc]Here&#39;s the eternal classic[/url] to wind off with at the Club - or blast into a damned guard&#39;s face at full volume, whichever you prefer. Thanks for reminding me to [url=http://www.nexusmods.com/skyrim/users/4242918/?]dpgillam[/url].\r<br />[url=http://www.nexusmods.com/skyrim/mods/43701/?]Dawn of Windhelm[/url] and [url=http://www.nexusmods.com/skyrim/mods/22730/?]Nernies Thief Pack[/url] are two very warmly recommended mods. The first adds three merchants on the streets, a shrine, and some decoration on its own; the latter adds a bookstore, a gem shop and even a player home in the Quarter. Warning: the main file version of the mod is NOT fully compatible with either of them. I have uploaded a compatible version that you can find in the file list. \r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=119305443]Faction: Pit Fighters[/url] - adds a whole faction to the game in a fully voice-acted, brilliant and quite large mod. Soap not included.\r<br />[url=http://www.nexusmods.com/skyrim/mods/16637/?]Ashland Amulets[/url] brings back a piece of Morrowind in a slightly different way: three of the beautiful artifacts return with a little story/treasure hunting game fabricated around them.\r<br />These latter two mods seem to be fully compatible, as far as I could judge; but I haven&#39;t yet looked very thoroughly - if anybody can confirm this for certain, I&#39;ll be grateful.\r<br />Elianora&#39;s [url=http://www.nexusmods.com/skyrim/mods/50067/?]Vetrheim[/url] has been confirmed to be compatible with this mod. Thanks for this to [url=http://www.nexusmods.com/skyrim/users/6795772/?]Gilten[/url].\r<br />\r<br />THANKS TO\r<br />[url=http://www.nexusmods.com/skyrim/users/2975289/?]MoonSweets[/url] for helping me with an issue with the navmesh that made half my hair fall out; if it weren&#39;t for him, I would now be completely bald. Also for testing and making a few very useful suggestions.\r<br />\r<br />[url=http://www.youtube.com/user/MMOxReview?feature=watch]MMOxReview[/url] for making [url=http://www.youtube.com/watch?v=sYCpgm4vuYY]a very aesthetic review[/url] of this mod in his series&#33; Thank you for the honour&#33; Also thanks to [url=http://steamcommunity.com/id/Akeidamos]Arzen Blood-Storm[/url] for drawing my attention to this&#33; (Review begins at 5:58.)\r<br />\r<br />[youtube]sYCpgm4vuYY[/youtube]\r<br />\r<br />FAQ\r<br />~ Can you make a version that does not require Dragonborn?\r<br />Unfortunately this is not possible. The game files work in a way that 99% of the required files are packed into Dragonborn.bsa.\r<br />~ Why do you use such terrible slurs as snowback? Are you racist?\r<br />I&#39;m a snowback myself. It&#39;s reappropriation. Ironic use. \r<br />~ I like the drawings, where do they come from?\r<br />I made them myself. If you are interested, visit my profile where you can find two links if you want to see more.\r<br />\r<br />CHANGES\r<br />Will be documented here. I am planning to make a Stalhrimless version of this mod just like I did with Fine Goods from Morrowind, but for that you will have to wait until I unwrap my presents and eat my Salmon Steak with Baked Potatoes. (I swear to you guys, that is legit our Christmas dinner.)\r<br />EDIT: The Stalhrimless version is up and running. \r<br />\r<br />- Jan 20th, 2014 - This update should change nothing other than making the file more reliable and less likely to conflict with other mods. Think of it as a thorough sweeping of the streets without touching any furniture or objects. In the next update I have scheduled a small player home. Stay tuned. \r<br />\r<br />SUGGESTIONS\r<br />Are welcome. Leave your comments below.",
  "categoryId": "90",
  "version": "1.2",
  "author": "felroki",
  "createdUnix": "1387964193",
  "updatedUnix": "1400972326",
  "containsAdultContent": false,
  "uploadedBy": "felroki",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000088319",
      "name": "Fine Goods from Morrowind - the Gray Quarter - v1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73",
      "fileName": "Fine Goods from Morrowind - the Gray Quarter - v1_0-49162-1-0.rar",
      "uploadedUnix": "1387963880",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5ba04a0df11df23b267725cc8cc41b65940ce52a079872436531f4ffe85f50ca/analysis/1407858430/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20Goods%20from%20Morrowind%20-%20the%20Gray%20Quarter%20-%20v1_0-49162-1-0.rar?fid=1000088319&ttl=1535829800&ri=8192&rs=8192&setec=0cd2c721221ba133829c7ba976ab3fb6"
    },
    {
      "fileId": "1000088606",
      "name": "Fine Goods from Morrowind - the Gray Quarter - v1_0a No Stalhrim",
      "version": "1.0a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73",
      "fileName": "Fine Goods from Morrowind - the Gray Quarter - v1_0a No Stalhrim-49162-1-0a.rar",
      "uploadedUnix": "1388171236",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/318e2158e9b858e1516ba5e63bb6e7ef1f64d0ab5cd691827dd9fe123a6d089c/analysis/1407861154/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20Goods%20from%20Morrowind%20-%20the%20Gray%20Quarter%20-%20v1_0a%20No%20Stalhrim-49162-1-0a.rar?fid=1000088606&ttl=1535829800&ri=8192&rs=8192&setec=0914f1f67c7435d3c6aede2f20911473"
    },
    {
      "fileId": "1000088609",
      "name": "Fine Goods from Morrowind - the Gray Quarter - v1_0b Nexus Friendly",
      "version": "1.0b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "111",
      "fileName": "Fine Goods from Morrowind - the Gray Quarter - v1_0b Nexus Friendly-49162-1-0b.rar",
      "uploadedUnix": "1388171566",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/e80ab2f6c7997da73743c27e3885063d5aa8a49af4c89c277c1331158995fedd/analysis/1407861183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20Goods%20from%20Morrowind%20-%20the%20Gray%20Quarter%20-%20v1_0b%20Nexus%20Friendly-49162-1-0b.rar?fid=1000088609&ttl=1535829801&ri=8192&rs=8192&setec=0f951b7ac67c7540c4da68662b0099cb"
    },
    {
      "fileId": "1000092543",
      "name": "Fine Goods from Morrowind - the Gray Quarter - v1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "75",
      "fileName": "Fine Goods from Morrowind - the Gray Quarter - v1_1-49162-1-1.rar",
      "uploadedUnix": "1390301982",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7152f1155e6b68c8928a7632f6c1854b710dc97748ca857016cbcbeaaefc22e2/analysis/1407895533/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20Goods%20from%20Morrowind%20-%20the%20Gray%20Quarter%20-%20v1_1-49162-1-1.rar?fid=1000092543&ttl=1535829802&ri=8192&rs=8192&setec=ce71d6c9efd0a523dcee4ebb6d957b8b"
    },
    {
      "fileId": "1000110342",
      "name": "Fine Goods from Morrowind - the Gray Quarter - v1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "73",
      "fileName": "Fine Goods from Morrowind - the Gray Quarter - v1_2-49162-1-2.rar",
      "uploadedUnix": "1400972004",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/fbd73137e7051473884587fa766845032f753a84b3c6e4c44bece6032062cda4/analysis/1408095489/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20Goods%20from%20Morrowind%20-%20the%20Gray%20Quarter%20-%20v1_2-49162-1-2.rar?fid=1000110342&ttl=1535829802&ri=8192&rs=8192&setec=7e4ab377df7d0f8c450e156ae8ee8e0b"
    },
    {
      "fileId": "1000110343",
      "name": "Fine Goods from Morrowind - the Gray Quarter - v1_2a No Stalhrim",
      "version": "1.2a",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "73",
      "fileName": "Fine Goods from Morrowind - the Gray Quarter - v1_2a No Stalhrim-49162-1-2a.rar",
      "uploadedUnix": "1400972224",
      "modVersion": "1.2a",
      "virusScanUrl": "https://www.virustotal.com/file/df6505c4bf359f41049d9774de18856e531d321fe8dcc716ac713ad8adb07f14/analysis/1408095491/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20Goods%20from%20Morrowind%20-%20the%20Gray%20Quarter%20-%20v1_2a%20No%20Stalhrim-49162-1-2a.rar?fid=1000110343&ttl=1535829803&ri=8192&rs=8192&setec=f9a1efb87d8340f6991e36a2a4e936f8"
    },
    {
      "fileId": "1000110345",
      "name": "Fine Goods from Morrowind - the Gray Quarter - v1_2b Nexus Friendly",
      "version": "1.2b",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "111",
      "fileName": "Fine Goods from Morrowind - the Gray Quarter - v1_2b Nexus Friendly-49162-1-2b.rar",
      "uploadedUnix": "1400972326",
      "modVersion": "1.2b",
      "virusScanUrl": "https://www.virustotal.com/file/bc5057a657ea7a34fd2d8923a2ad167d4f378a05c4d73d6553dac682b1d713bb/analysis/1408095542/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20Goods%20from%20Morrowind%20-%20the%20Gray%20Quarter%20-%20v1_2b%20Nexus%20Friendly-49162-1-2b.rar?fid=1000110345&ttl=1535829804&ri=8192&rs=8192&setec=a7e60c6ffd685be5ab69cb6a5862a48b"
    }
  ]
}