{
  "modId": 49164.0,
  "modName": "Enb optimized for AMD (including crossfire config)",
  "summary": "A Enb for players of skyrim on Large resolutions (1440P, 2.5K, 3K, and 4K) . Optimized for AMD graphics cards in Crossfire Configurations. WIll work for anyone but the target audience is stated above. A Sharp, colorful and bright outdoors enb with realistic lighting for indoors. ",
  "descriptionHtml": "[size=5]Introduction:[/size]\r<br />Skyrim has it&#39;s limitation, It is best played in my experience on a 1080P monitor with a single Good Nvidia Gpu. But what do you do if you don&#39;t fall into this catagory, Do it yourself ofcourse, This enb is designed for Players of skyrim playing at larged resolutions like 1440p and bigger. It is also optimized for AMD GPU&#39;s in crossfire configuration. It should work for anyone but i just want to make sure who will get the best out of this.\r<br />\r<br />[size=4]Update log:\r<br />[/size]V1.38 - LOL, okay 1.37 wasn&#39;t the final version. Only a small change to Interior Point lights was made, the light was made a it softer.\r<br />V1.37 - FINAL VERSION, I am very satisfied how this enb looks and consider it just as good as any other Overly popular Enb. I cleaned up some of the rendering and got performance about 15% better. Enjoy.\r<br />V1.36 - Made more subtle improvements and touch ups to all areas of skyrim.\r<br />V1.35 - Enabled and configured all effects for enb 0.265, Officially this is now a Full-Enb producing some spectacular visuals. Many improvements since last update and im thinking this might be the final release.\r<br />V1.30 - Updated for latest Enb version 0.265 and included MANY improvements to environment lighting, color realism, shadows and sky. This enb isn&#39;t really a &#34;performance&#34; enb anymore but rather a near full featured enb. Turn off SSAO and reflections in enbseries.ini if your FPS is suffering.\r<br />V1.28 - more gameplay done and more subtle improvements performed (much in the outdoors department this time), Also turned off Ambient occlusion (aka SSAO-SILL) and SMAA the performance hit these two bring just arn&#39;t worth their visual improvements. You can activate them back on in the enbseries.ini and sweetfx_settings.txt files respectively. Added a note on CCC settings for AMD users, see below.\r<br />V1.27 - More game exposure means more improvements, Subtle changes to saturation, interior light and Sharpening technique.\r<br />V1.26 - Adjusted Contrast grey to grey levels and modified contrast, Moved Desaturation from Sweetfx to Enbeffect.fx, Image and color POPS more now&#33;\r<br />V1.25 - Slight adjustment to overall image, reduced desaturation from 25% to 20%, Increased sharpening from 1.5 to 1.8, Added SMAA layer.\r<br />V1.24 - lol, always a way to improve it seems. Lighting optimizations about 5% improvement on my system, Added Enb rain and Sky.\r<br />V1.23 - Added some more eye candy features, this version looks better but also needs a bit more gpu horsepower. Fixed black sky bug in certain weather conditions.\r<br />V1.22 - Optimized effects, got 11% performance improvement. \r<br />V1.21 - Significant&#39;y improved subsurface scattering and added SSAO-SSIL\r<br />V1.20 - Re-Branded for specific audience and optimized for latest enb version 0.264\r<br />V1.16 - Adjusted gamma levels in enbeffect.fx, better color representation.\r<br />V1.15 - Remastered all lighting sources and adjusted glare levels to produce no more glaring.\r<br />V1.13 - Updated Enb to include latest features of 0.243 env.\r<br />- Optimized and balanced AA settings. Performance is even better now with more AA.\r<br />V1.12 - Rebalance exterior daylight. Sun less red and less intense. \r<br />V1.11 - Optimized Lumasharpen formula to not have any remainders in calculation. No more grainy effect.\r<br />V1.10 - Adjusted Subsurfacescattering for interiors with ALOT of incoming light during daytime. No more radioactive skin, eyes and plants. \r<br />V1.09 - Adjusted Specularity for night and day interiors. Still very much fantasy but everyone isn&#39;t covered in gel anymore.\r<br />V1.08 - Adjusted Specularity for night and day exteriors. More realistic now.\r<br />V1.07 - Furthur adjusted interior day lighting. Finally it looks real now.\r<br />V1.06 - Adjusted light from sun for interiors during day time.\r<br />V1.05 - Re-mastered lighting for all sources. It&#39;s more beautiful than ever&#33;\r<br />V1.02 - Adjusted Torch and floating point light radius to better match human eye adaptation for indoors during nighttime and outdoors during nighttime.\r<br />         - Updated Page description.\r<br />V1.01 - Adjusted SSS during daytime to prevent glowing skin on redguards.\r<br />V1.00 - Original Release\r<br />\r<br />*NOTE*: Im bad at screen archery so the uploaded images are way worse looking than what you will get in game. \r<br />\r<br />[size=4]Description:[/size]\r<br />For latest Enb version 2.65.\r<br />\r<br />- This enb leans towards more fantasy colors and sharp images with shiny armor but provides realistic lighting.\r<br />- THis enb was built with a gamma setting of 1.0 in skyrim (ie. brightness bar at 50% in display menu). \r<br />- I also found this enb looks best with warm environments, like Seasons of skyrim SUmmer and tropical skyrim.\r<br />\r<br />[size=5]Compatibility:[/size]\r<br />- Works fine with COT (climates of tamriel), ELEF (Enhanced Lighting and effects) and Vanilla skyrim. Not recommended with other lighting modifiers. \r<br />- [size=3][b]I strongly suggest you have Imaginator mod installed to make find adjustments&#33;[/b][/size]\r<br />\r<br />[size=4]Settings for CCC (catalyst control center, the AMD GPU settings application)[/size]\r<br />- Make sure these settings are in place to get optimal frame rates, this is especially important if you are running Crossfire&#33; .. Under Gaming --&gt; 3d application settings\r<br />- Wait for Vertical refresh = ALWAYS OFF\r<br />- OpenGL Triple Buffering = OFF\r<br />- Frame Pacing = ON\r<br />- Everything else can be left on default or fine tuned to your system.\r<br />*Special Note* - For every additional Graphics card you have drop your memory speeds by 50-100Mhz on all active cards. For example, you have a Quad-fire configuration (4x7970 or 2x7990 or 1x7990+2x7970) and their default memory speed is 1500Mhz reduce that to 1300Mhz across all cards; this will ensure a smoother play experience for you. This knowledge can be applied across any game that supports crossfire.\r<br />\r<br />[size=5]Installation and understanding enb:[/size]\r<br />- Extract all the files in my compressed files into your skyrim root folder NOT the data folder.\r<br />- goto http://www.enbdev.com/download_mod_tesskyrim.html  and download the enb engine. Extract only the d3d9.dll file from the wrapper folder and put it into the skyrim root folder.\r<br />\r<br />PS. Please Post some of your images, i really want to see how it is appearing on your machines.\r<br />\r<br />Credits:\r<br />- Boris (enb dev)\r<br />- Ceejay (Sweetfx Dev)\r<br />- Somber Enb creator\r<br />- I can&#39;t belive it&#39;s not an enb creator.",
  "categoryId": "97",
  "version": "1.38",
  "author": "Remilafo",
  "createdUnix": "1387942185",
  "updatedUnix": "1422201874",
  "containsAdultContent": false,
  "uploadedBy": "remilafo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144522",
      "name": "remilafo&#39;s enb 1.38",
      "version": "1.38",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "659",
      "fileName": "remilafo's enb 1.38-49164-1-38.rar",
      "uploadedUnix": "1422201874",
      "modVersion": "1.38",
      "virusScanUrl": "https://www.virustotal.com/file/1bc4ed3a56fef72e00839e2169b4f334fa8999330ac079835e2a93fb62c4ce39/analysis/1422201902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/remilafo%27s%20enb%201.38-49164-1-38.rar?fid=1000144522&ttl=1535829807&ri=8192&rs=8192&setec=a49038a4d08283c77674da745b1df17c"
    }
  ]
}