{
  "modId": 49199.0,
  "modName": "Legends of Nchuak",
  "summary": "Before their disappearance the Dwarves once ruled over Solstheim. They had cities on every coast, where they built great machines to rival the gods themselves. There are many stories about these dwarves, however one in particular has always drawn adventures to Solstheim seeking fame, fortune, and great power: the legend of Nchuak.",
  "descriptionHtml": "Description:\r<br />---------------\r<br />Before their disappearance the Dwarves once ruled over Solstheim. They had cities on every coast, where they built great machines to rival the gods themselves. There are many stories about these dwarves, however one in particular has always drawn adventures to Solstheim seeking fame, fortune, and great power: the legend of Nchuak.\r<br />\r<br />Among some of the best known of the Dwemer engineers are Kagrenac (The Master Crafter of the dwemer), Dahrk Mezalf, and Yagrum Bagarn (the last living Dwarf). However most have never heard of perhaps the greatest of the Tonal Architects: Lord Nchuak, the last Dwarf king of Solstheim. Nchuak was the closest thing the Dwemer had to a God, all dwarves respected and revered him. During his rule of Solstheim Nchuak took it upon himself to pass on his knowledge to his five students: Dhzark, Kangthmz, Rkund, Irkmaz, and Mzund. To these five students Nchuak taught all he knew about crafting, enchanting, alchemy, and magic. Nchuak&#39;s teachings were of great benefit, not only to his students, but to all of his people. In return for his teachings Nchuak&#39;s students crafted him a set of armor, fit for a ruler of his stature. They used all of the techniques Nchuak had taught to them: they used alchemy to extract the hardest ebony from the earth, they used their knowledge of crafting to form the metal into the most solid of shapes, they used magic to harden the metal beyond any compare, and they used Nchuak&#39;s teachings of enchanting to weave enchantments of great power into the armor. Most believed Nchuak to be invincible, but none could know that one of his own students would turn on him. Jealous of Nchuak&#39;s power Irkmaz fashioned an automaton to slay Nchuak. Pretending to want Nchuak&#39;s opinion on his latest creation Irkmaz lured Nchuak into his workshop, impressed with the automaton Nchuak begain to examine it. While Nchuak was examining his machine Irkmaz activated the automaton. All it took was one swing of the machine&#39;s arm to kill the great Nchuak. Irkmaz called for Nchuak&#39;s other students, claiming that there had been an accident with one of Nchuak&#39;s own creations. But the others saw through Irkmaz&#39;s lie, as Rkund had seen him working on the very same machine the day before. Nchuak&#39;s students destroyed Irkmaz for his treachery then, mourning the loss of their teacher, they divided Nchuak&#39;s armor to be displayed in the major cities of Solstheim. Legend has it that Nchuak&#39;s armor still exists somewere on solstheim, as well as the giant automaton that slew him. \r<br />\r<br />This story has drawn many adventurers to Solstheim in search of Nchuak’s armor, authough not all are prepared for what awaits them in the Dwemer ruins of Solstheim. Are you ready to face the perils of Solstheim’s ruins in search of the Dwarves’ greatest creation?\r<br />\r<br />Content:\r<br />-----------\r<br />New unmarked quest to retrieve the armor of Nchuak\r<br />New full armor set (difficult to get, but equal to Daedric)\r<br />New weapons and spells\r<br />Three new dungeons on Solstheim\r<br />New enemies to face\r<br />A new book to read.\r<br />And a whole new adventure, fit for the Dragonborn.\r<br />\r<br />Requirements:\r<br />-------------------\r<br />Skyrim\r<br />Dragonborn DLC\r<br />\r<br />Change log:\r<br />---------------\r<br />1.0   – Initial release\r<br />\r<br />Notes: Any feedback on this mod is welcome.\r<br />\r<br />Also check out my new mod: [url=http://www.nexusmods.com/skyrim/mods/74245/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D74245&pUp=1]Nightwielder Spire[/url]&#33;",
  "categoryId": "54",
  "version": "1.0",
  "author": "HeirOfTheSeptems",
  "createdUnix": "1388068539",
  "updatedUnix": "1388068113",
  "containsAdultContent": false,
  "uploadedBy": "HeirOfTheSeptems",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000088454",
      "name": "Legends of Nchuak",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20010",
      "fileName": "Legends of Nchuak-49199-1-0.zip",
      "uploadedUnix": "1388068113",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/96f0bf6232ff838d323246764a5b954cee6bef2a08c232d57f10cdd58c616e47/analysis/1407859823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legends%20of%20Nchuak-49199-1-0.zip?fid=1000088454&ttl=1535829867&ri=8192&rs=8192&setec=1e829dba5a6ee295b2181ed25516863b"
    }
  ]
}