{
  "modId": 49240.0,
  "modName": "The Sky Residence",
  "summary": "Adds an entire new custom Worldspace called Sharp Edge Mountains, with unique quests and more.",
  "descriptionHtml": "Sharp Edge Mountains\r<br />\r<br />             Let me introduce you the new Sky Residence, the second project of this floating manor.\r<br />It is a new custom worldspace. It contains an unique quest line and leads you through an artistic and beautiful nature. The characters have their own and unique voice and dialogues, and they tell an interesting story about the Sharp Edge Mountains. On the end you will gain access to the beautiful player home &#34;The Sky residence&#34;, wich contains crafting tables and storage. \r<br />The new land also contains custom music.\r<br />\r<br />Story\r<br />\r<br />             Two stars fell of the sky, disrupted gravity and life. The large craters raised large mountains from the seafloor, sharper than swords edge. It was a waste land with floating rocks, until a warlord named Kardris Blackbane saw potential in the Island and planted a seed in the earth wich created life on the land, the great Yggdrassil. Before Kardris died he build up a residence on the floating rocks to rest for the few remaining years of his life.\r<br />\r<br />Installation\r<br />\r<br />Copy the &#34;data&#34; folder in the skyrim directory and merge and replace everything it asks.\r<br />Activate the .esp in the launcher&#39;s Data Files.\r<br />\r<br />Things to know\r<br />\r<br />-I&#39;ve posted a trailer of this mod   http://www.youtube.com/watch?v=Jj3fTSrRwQY\r<br />-I think I will work further on this mod;\r<br />-I not that good with scripting things, so if any one is interested to make additional quests or expand the mod with scripts let me know;\r<br />-I am the only one who made the mod, I alone :-(\r<br />\r<br />The questline starts at the Lady Stone (see the images), just speak with the Dragon.\r<br />You can get to the Island with a boat under solitude, you can&#39;t miss a boat like that :-)\r<br />",
  "categoryId": "30",
  "version": "",
  "author": "Same Dee",
  "createdUnix": "1388231508",
  "updatedUnix": "1388231030",
  "containsAdultContent": false,
  "uploadedBy": "baltazzar777",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000088686",
      "name": "The Sky Residence - The second project",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "107636",
      "fileName": "The Sky Residence - The second project-49240-.rar",
      "uploadedUnix": "1388231030",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0f80130c872adc1db644756bac2da770853e755a0d7f22669c7571bd5de21ae8/analysis/1407862005/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Sky%20Residence%20-%20The%20second%20project-49240-.rar?fid=1000088686&ttl=1535829967&ri=8192&rs=8192&setec=39185837ef36e0c5d196ba8523e02de4"
    }
  ]
}