{
  "modId": 4927.0,
  "modName": "Lords Mail WIP",
  "summary": "A Work In Progress To Recreate The Lords Mail",
  "descriptionHtml": "This is my WIP to recreate the lords mail from morrowind, arena and daggerfall, this will take time and atm is a heavy WIP. and yes i know it looks pretty crappy right now but as i said Heavy Wip, the final version will hopefully be looking fairly professional, but i thought i would release this to the world now so they can see some of my progress :)\r\n\r\nIn the final version it will still be a replacer for general tullius\\'s armor as i wish it to be an artifact and therefore unique so it will give people more of an incentive to Crush the Legion! as that will be the only way to legitimately obtain it, of course u culd just use console commands :P\r\n\r\nI shall also work on bringing back some other artifacts such as chrysamere and some others, and one of these shall be for ulfric to have, again so theres more incentive to Crush the Rebellion!\r\n\r\nTo Do;\r\nRedo Meshes to make plates stand out more and remove chainmail hood\r\ncarry on updating textures, make them much higher quality\r\nadd enchantments similar to original enchantments\r\nrename the item\r\n\r\nVersion Log;\r\nV0.01 Alpha - total overhaul of tullius armor, atm fairly low quality textures and normal map, removed skirt and shoulder pleats, added shoulder pauldron and chainmail hood, extended shoulder plates to cover shoulders, added chainmail to replace red fabric, added basic neckguard, removed decals from main body and added plates on the legs\r\n\r\nInstallation;\r\nNMM:\r\nI Reccomend Using Nexus Mon Manager, just activate and accept any overwrites\r\nManual:\r\nJust unpack and move the Textures folder into your data folder and say yes to any overwrites\r\nUninstallation;\r\nJust delete the files added by this mod\r\n\r\nThis is only my third mod to be released so feedback is much appreciated and if you enjoy this, Endorse It!\r\n\r\nMy Other Mods;\r\nRetextures For Jaysus Swords; http://skyrimnexus.com/downloads/file.php?id=4871",
  "categoryId": "54",
  "version": "Alpha0001",
  "author": "Hrusai",
  "createdUnix": "1325268228",
  "updatedUnix": "1325269432",
  "containsAdultContent": false,
  "uploadedBy": "hrusai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15183",
      "name": "Alpha Version 0001",
      "version": "alpha0001",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1603",
      "fileName": "Alpha Version 0001-4927-alpha0001.7z",
      "uploadedUnix": "1325269432",
      "modVersion": "alpha0001",
      "virusScanUrl": "https://www.virustotal.com/file/6d039fae8e9c5e88b0aa5df9099620edbd48a3dfe31a0a7e74e0b58de958dc39/analysis/1406570898/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alpha%20Version%200001-4927-alpha0001.7z?fid=15183&ttl=1535761270&ri=8192&rs=8192&setec=c4a1d1d5d8af7c90e8edd070a02f4ce4"
    }
  ]
}