{
  "modId": 49279.0,
  "modName": "Northborn Scars",
  "summary": "Detailed replacer for vanilla scars. The true mark of a warrior.",
  "descriptionHtml": "[center][img]http://static1.nexusmods.com/15/mods/110/images/49279-1-1388294169.png[/img]\r<br />\r<br />[youtube]enQnhxAM-xU[/youtube]\r<br />Thanks to Brodual for the video above&#33;[/center]\r<br />\r<br />[heading][b]Description[/b][/heading]\r<br />1.1 - Now comes with additional custom scars including more gashes, burn scars and a glasgow smile scar, rising the count up to 20 options for humanoid male and female. Included are some alpha/seam fixes and additional details to the original texture replacer. This is released in one complete package that includes the replacers, the previously optional female scar fix, and the new scars.\r<br />\r<br />1.0 - NB-Scars replaces vanilla textures with new detailed 1024x1024 textures and normal maps for more realistic scars. Each scar was hand drawn with the original scar patterns in mind. Much like real life scars, no one scar heals the same way. This is reflected in these new textures: some scars pop, others are sunken, smooth or mottled. New normal maps allow for proper lighting and shadows.\r<br />\r<br />[b]Note:[/b] Scars for the beast races (Khajiit/Argonian) are forthcoming. (No ETA provided)\r<br />\r<br />[heading][b]Future Plans[/b][/heading]\r<br />Future updates will include more custom scars in addition to full-face and body scars. The full-face and body scars will require use of the Racemenu mod, as it makes use of its overlay feature. The basic replacer and basic custom scars will continue to be available without Racemenu installed.\r<br />\r<br />[heading][b]FAQ[/b][/heading]\r<br />Q: Why 1k textures and not 2k resolutions or above?\r<br />A: There&#39;s such a thing as overkill. I opted for a balance of close-up detail and vram usage.\r<br />\r<br />Q: Do you plan to upgrade the scars for the beast races?\r<br />A: Absolutely, its all part of the plan. However, I cannot provide an ETA for the time being.\r<br />\r<br />Q: Why are there no scars above the eyes or over the bridge of the nose?\r<br />A: This is a limitation thanks to the way the game handles scars. This will be remedied in future upgrades via the Racemenu mod&#39;s overlay feature.\r<br />\r<br />Q: Why are you screenshots so dark? Are displaying lighting or your scars?\r<br />A: I&#39;ll be the first to admit, I tend to forget I&#39;m working on a professionally calibrated screen (I&#39;m a graphic designer), which tends to be lighter, less contrasted than the average user&#39;s screen. With the screenshots, I&#39;m trying to showcase how the scars react with light at different angles. Plus, I&#39;m trying to show how the scars apply to various different character designs. I don&#39;t much care to spend time doing &#34;mugshots&#34; for every scar made. My time is better spent designing new scars than trying to sell a free, small-sized, harmless mod. That being said, I will strive to release better lit screenshots in future updates.\r<br />\r<br />Q: Could make this custom scar for me?\r<br />A: While the initial release only replaces vanilla scars, I do intend to release additional custom ones. You&#39;re welcome to hit the comments section and inspire me. Just make sure its lore-friendly, and not protected by some copyright (ie. Exact replica of Azog the Defiler&#39;s scars). I make no promises though. I do what I can.\r<br />\r<br />Q: Will you include scars that cover more of the face?\r<br />A: Absolutely. These will become available via the complexion slider due to limitations in the way Skyrim handles scars (They use a separate model). Working with complexions require more time and effort and are specific to each race and gender. Wish me luck. \r<br />\r<br />[heading][b]Compatibility[/b][/heading]\r<br />This mod replaces the original scars and is incompatible with any mod that does the same. It should, however, be compatible with any mod that ADDS new scars.\r<br />\r<br />[heading][b]Known Bugs[/b][/heading]\r<br />None\r<br />\r<br />[heading][b]Details[/b][/heading]\r<br />Simply install the mod via NMM (Nexus Mod Manager) or manually install the files.\r<br />\r<br />[heading][b]Install[/b][/heading]\r<br />Recommended: Install via NMM (Nexus Mod Manager)\r<br />\r<br />For manual installation: Extract the files to the Data folder (folder hierarchy must remain intact)\r<br />\r<br />[heading][b]Uninstall[/b][/heading]\r<br />1. Delete the files included with this mod\r<br />\r<br />[heading][b]Licensing/Legal[/b][/heading]\r<br />- This file is a Nexusmods.com exclusive and should not be uploaded to any other websites or services.\r<br />- Contact the author is you wish to use any included ressources in your own mods",
  "categoryId": "29",
  "version": "1.1",
  "author": "Northborn",
  "createdUnix": "1388301876",
  "updatedUnix": "1388954764",
  "containsAdultContent": false,
  "uploadedBy": "Northborn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000088789",
      "name": "NBScars",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4254",
      "fileName": "NBScars-49279-1-0.rar",
      "uploadedUnix": "1388301062",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fb5d1037cf95bb1735400361c51bd1a961e6c97a630a01c34f08458910a410f9/analysis/1407863088/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NBScars-49279-1-0.rar?fid=1000088789&ttl=1535830037&ri=8192&rs=8192&setec=b4f7b98e2a09d558ee5524c36f96c144"
    },
    {
      "fileId": "1000088868",
      "name": "NBScars Female Scar Fix",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "NBScars Female Scar Fix-49279-1-0.rar",
      "uploadedUnix": "1388349370",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/73df428d4be441e063ccc23f8f1ee64f720f478f652a3bf7cc967abe47138752/analysis/1407863710/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NBScars%20Female%20Scar%20Fix-49279-1-0.rar?fid=1000088868&ttl=1535830038&ri=8192&rs=8192&setec=3df3e8dc939867c66b7e4e15f6183e8a"
    },
    {
      "fileId": "1000090071",
      "name": "NBScars",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13823",
      "fileName": "NBScars-49279-1-1.rar",
      "uploadedUnix": "1388954764",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/269cdce92edc0bd05d970a623ad21b1a2c8be51bf1f029aca992fd6392a9447a/analysis/1407873734/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NBScars-49279-1-1.rar?fid=1000090071&ttl=1535830038&ri=8192&rs=8192&setec=1a0e5bdf543f931d50b3896e90f098ae"
    }
  ]
}