{
  "modId": 49286.0,
  "modName": "OCR - Omnisway Clothing Replacer - CBBE BodySlide BBP TBBP",
  "summary": "Adds breast physics (BBP/TBBP) to all vanilla female clothing in Skyrim, enhances meshes (more polys), and conforms them to any character shape you like with BodySlide2.",
  "descriptionHtml": "New version 0.3 includes 2 new packs: The Finery Pack and The Misc Pack, which include the following outfits: Fine Clothes (x2), Wedding Dress, Noble Clothes, Embellished Robes, Refined Tunic, Fur-Trimmed Cloak, Fine Raiment, Embroidered Garment, Redguard Clothes (Hammerfell Garb), and Jester&#39;s Clothes (Cicero&#39;s Clothes). v03 also fixes clipping issues in the CVC Pack present in v02. Finally, v03 adds the &#34;OCR - Petite-Buxom&#34; Bodyslide preset to the main file.\r<br />\r<br />New add-on &#34;Petite Elves & Busty Redguards&#34; added to the &#34;Optional Files&#34; section&#33;\r<br />\r<br />\r<br />Note: This mod, for the most part, is [b]not[/b] adult-only, but it requires mods that are.  Any clothing conversion that [i]does[/i] contain nudity will have a non-nude alternative included. Additionally, I will only add nudity to an outfit if I deem it context-appropriate; I don&#39;t want naked people walking around the towns - it&#39;s immersion-breaking.\r<br />\r<br />[b]QUICK INSTALL (TL;DR) FOR ADVANCED (OR CURRENT) USERS[/b]:\r<br />If you already have a T/BBP working and are comfortable with BodySlide2, simply install this mod (overwrite previous) and and use BodySlide2 to Batch Build either the &#34;OCR_Omnisway Clothing Replacer (TBBP)&#34; Group or the &#34;OCR_Omnisway Clothing Replacer (BBP)&#34;. Also, activate the included ESP file from your mod manager.\r<br />-------\r<br />\r<br />[b]DETAILS:[/b]\r<br />\r<br />[b]WHAT IS THIS?[/b]\r<br />Omnisway Clothing Replacer (henceforth OCR) aims to 1) add breast physics (BBP or TBBP) to all vanilla FEMALE clothing in Skyrim, 2) enhance the vanilla meshes (more polys), 3) correct weighting problems inherent to the vanilla models (e.g. clipping problems and dresses that move like pants), and 4) give the player the ability to easily conform all of them to any character shape they desire using BodySlide2. This clothing is meant to be as lore-friendly as possible and usually won&#39;t be much skimpier than the vanilla outfit. These conversions are currently for clothing only, not armor.  Since players usually wear armor, the main purpose of this mod is to add realism to all of the characters around you.\r<br />\r<br />[b]WHY WOULD I WANT THIS?[/b]\r<br />Why wouldn&#39;t you?\r<br />\r<br />[b]WILL YOU CONVERT MALE CLOTHING?[/b]\r<br />You mean add bouncing ding-dongs to clothing? Nah, that&#39;ll be a project for another modder.\r<br />\r<br />[b]WHY ONLY CLOTHING AND NO ARMORS?[/b]\r<br />Because armor is rigid. There would be no point in making it bounce, unless I made it skimpy (and therefore nonfunctional).  When all of the clothing is converted, I&#39;m considering adding T/BBP to a few of the non-rigid armors and convert some armors to TBBP WITHOUT boucing simply for scaling (skeleton) reasons.  In the meantime, if you want BBP armor, you can check out ChronoTrigger77&#39;s [url=http://www.nexusmods.com/skyrim/mods/25259]Remodeled Armor[/url]. It looks great. It also shows lots of skin.\r<br />\r<br />[b]WHAT IF I JUST WANT THE HQ BODYSLIDE CLOTHING, NOT THE BOUNCING?[/b]\r<br />That is possible.  If you follow the other installation steps, but don&#39;t install any BBP/TBBP animations (or HDT Physics), that is exactly what you will have. You still need to have a skeleton that supports T/BBP, though, or the game will crash.\r<br />\r<br />[b]WHAT IS INCLUDED?[/b]\r<br />This is a modular WIP; I will be routinely adding more conversions until all vanilla clothing is converted.\r<br />\r<br />PROGRESS:\r<br />\r<br />Phase 1:  Total conversion of the clothing aspect of [url=http://www.nexusmods.com/skyrim/mods/12273]Caliente&#39;s Vanilla Outfits[/url] to BBP\r<br />-DONE\r<br />[youtube]alZz9S62j4I[/youtube]\r<br />\r<br />Phase 2: Conversion of Phase 1 to TBBP\r<br />-DONE\r<br />\r<br />Phase 3: Manual conversion of remaining vanilla clothing not included in CVO\r<br />-IN PROGRESS\r<br />[youtube]A6ued-GWJFU[/youtube]\r<br />\r<br />Phase 4: Conversion of clothing from Dawnguard (BBP/TBBP). I don&#39;t think there&#39;s anything in Hearthfire, but if there is I&#39;ll get it too.\r<br />-TBA\r<br />\r<br />Phase 5: Conversion of clothing from Dragonborn (BBP/TBBP)\r<br />-TBA\r<br />\r<br />Phase 6: Mage Outfits Plus (optional)- replace vanilla mage outfits with a variety of high-quality robes from other modders (converted by me to Bodyslide CBBE + BBP), reflecting different meshes for the different levels of mastery and different textures for the different schools of magic.\r<br />-TBA: Awaiting Permissions\r<br />\r<br />Phase 7: Conversion of select non-rigid armors.\r<br />-TBA\r<br />\r<br />Phase 8: Conversion of clothing from some Major Mods (TBD) (BBP/TBBP)\r<br />-TBA\r<br />-----------\r<br />\r<br />[b]WHAT DO I *HAVE* TO HAVE TO RUN THIS?[/b]\r<br />\r<br />1. Textures for the CBBE Body. You can get them by installing the original [url=http://www.nexusmods.com/skyrim/mods/2666]CBBE[/url]\r<br />OR, do a search on the nexus for &#34;cbbe texture&#34;; there are a lot of texture replacements for CBBE by other modders - pick one you like.\r<br />\r<br />2. [url=http://www.nexusmods.com/skyrim/mods/49015]Bodyslide2 / Outfit Studio[/url] by Caliente\r<br />\r<br />3. A skeleton that supports T/BBP. The most popular choice is the [url=http://www.nexusmods.com/skyrim/mods/26800]XP32 Maximum Skeleton.[/url]\r<br />\r<br />[b]IS THAT IT?[/b]\r<br />Well, that will get your improved clothing into the game and support for BBP, but it won&#39;t cause anything to bounce on its own. You basically have two ways to do that:\r<br />\r<br />1. BBP Animations.  There are some animation replacers out there that manually update Skyrim&#39;s vanilla animations to include breast movement. The main one is CherryHotaling&#39;s [url=http://www.nexusmods.com/skyrim/mods/4888]CHSBHC Nude and Jiggly Mod[/url]. This will add bounce to almost every action your female character takes.  I actually don&#39;t use this, because I prefer method #2, but it&#39;s still a popular choice.  Another BBP animation mod that I highly recommend (and actually use) is DarkAngel1265&#39;s [url=http://www.nexusmods.com/skyrim/mods/35035]Natural Breast Animation[/url]. This looks great and actually works well in conjunction with method #2.\r<br />\r<br />2. HDT Physics Extensions. Per Nexus policy, I can&#39;t actually link to this, but google is your friend.  This is the new generation of BBP.  This is a SKSE plugin that uses the game engine&#39;s physics to make the breasts move in real time, in response to your actions. (Other things too, there&#39;s a great hair mod already available - seen in my demo video).\r<br />\r<br />[b]OKAY, NOW IS THAT IT?&#33;[/b]\r<br />Not quite. If you added animations, you might need [url=http://www.nexusmods.com/skyrim/mods/11811]FNIS[/url]. Even if you didn&#39;t, it&#39;s probably a good idea to get it. FNIS is a framework that helps modders to add new animations to the game. It also fixes a problem when using the XP32 Skeleton.  Download it, install it, and run GenerateFNISforUsers.exe every time you add new animations to the game.\r<br />\r<br />Finally, you want these outfits to look as great as possible, right?  My meshes are higher-poly than the vanilla meshes, but there&#39;s only so far you can go with crappy textures.  I highly recommend getting Kobayashi345&#39;s [url=http://www.nexusmods.com/skyrim/mods/5603]2X Clothing Re-Mix[/url]. There are a few download options, but I personally think the &#34;Kobayashis Mix&#34; main file plus the optional &#34;Filthy Beggars&#34; works the best.\r<br />\r<br />\r<br />[b]PHEW&#33; THAT&#39;S A LOT OF CRAP&#33; CAN I INSTALL NOW?[/b]\r<br />By all means&#33; The easiest way is directly through the Nexus Mod Manager, but you can also copy the contents of the archive into your Skyrim data folder and activate the included ESP file. This is a low-profile ESP; it has no scripts and no performance impact. It fixes a couple of vanilla Skyrim outfit bugs and remaps a few meshes/textures needed to make the OCR outfits work correctly, and it should probably be loaded after any other mods that alter vanilla outfits.\r<br />After the files are in place (and activated), run BodySlide 2 (Bodyslide.exe, probably in your Skyrim data folder under the &#34;CalienteTools&#34; subfolder). Once it&#39;s running, click the box that says &#34;Group Filter&#34; and choose one (or more) of the following groups from OCR:\r<br />\r<br />The easiest way to install is to pick ONE(&#33;) of the 4 main OCR Groups:\r<br />1. OCR_Omnisway Clothing Replacer (TBBP)\r<br />-This (or its BBP equivalent) is probably the file you want.  It is the master file for OCR. It will always contain every clothing outfit available.  Currently, it contains Caliente Vanilla Clothing (CVC) Pack, the Finery Pack and the Misc Pack.\r<br />\r<br />2. OCR_Omnisway Clothing Replacer (TBBP)(NoNude)\r<br />-Same as #1, but with no possible nudity.\r<br />\r<br />3. OCR_Omnisway Clothing Replacer (BBP)\r<br />Same as #1, but BBP instead of TBBP. What&#39;s the difference? Well, BBP is simpler than TBBP: it has no jiggling buttocks and only a single bone associated with each breast (as opposed to the 2 in TBBP). You might prefer BBP if you want a (slightly) more subtle bounce or if you are having clipping issues with the TBBP version.\r<br />\r<br />4. OCR_Omnisway Clothing Replacer (BBP)(NoNude)\r<br />-Same as #2, but with BBP.\r<br />\r<br />\r<br />If you don&#39;t want the full package, OCR also has a modular installation; you can install outfit packs individually. The following Groups are provided for batch-building (during the batch build, you can uncheck any individual outfit you don&#39;t want):\r<br />\r<br />(Note that there are also TBBP versions of the following)\r<br />1. OCR-Caliente_Clothing_BBP\r<br />-This is CVC Pack (Caliente Vanilla Clothing Pack); it includes the BBP conversions for all of clothing (not armor) in Caliente&#39;s Vanilla Outfits.\r<br />\r<br />2. OCR-Caliente_Clothing_BBP_NoNude\r<br />-Same as above, but contains no nudity. The only nudity in my Caliente_Clothing set is in the &#34;Roughspun Tunic&#34;, which is the prisoner outfit you begin the game with.  I added some holes in it to make it more ragged. I intended this to be used with the [url=http://www.nexusmods.com/skyrim/mods/9557]Alternate Start mod[/url] where you start as an actual long-term prisoner.  If you prefer the more traditional variant, go with the NoNude option.\r<br />\r<br />3. OCR-Finery_BBP\r<br />-Includes the following outfits: Fine Clothes (x2), Wedding Dress, Noble Clothes, Embellished Robes, Refined Tunic, Fur-Trimmed Cloak, Fine Raiment, and Embroidered Garment\r<br />\r<br />4. OCR-Misc_BBP\r<br />-Includes the following outfits: Redguard Clothes (Hammerfell Garb) and Jester&#39;s Clothes (Cicero&#39;s Clothes)\r<br />\r<br />\r<br />After you have chosen your OCR Group(s), you need to select a Slider Preset (determines the shape of bodies). If you don&#39;t know what this is, just select &#34;OCR - Petite-Buxom&#34;.\r<br />\r<br />Next press the &#34;Batch Build&#34; button on the bottom left corner of the window. A list will pop up; keep all of the selected items checked and say &#34;OK&#34;.  Congrats, your clothing outfits have been updated.\r<br />\r<br />Now you want to make sure that the characters&#39; bodies underneath the clothing matches.  Keeping the same preset you just selected, clear the Group Filter (middle button on the top, where you selected the OCR- group).  Then, in the Outfit/Body list, select &#34;CalienteBodyAdvancedTBBP&#34; (or &#34;CalienteBodyAdvancedBBP&#34;).  Then click the &#34;Create Bodies&#34; button on the bottom of the screen, which will generate a nude T/BBP-enabled body that matches the clothing you just created.\r<br />\r<br />If you&#39;ve done everything right, you should be ready to play&#33; Enjoy, and stay tuned for more clothing updates&#33;\r<br />\r<br />\r<br />[b]OPTIONAL ADDONS[/b]\r<br />\r<br />[i]Vilja in Skyrim[/i]: This adds T/BBP Bodyslide Conversions for Emma&#39;s [url=http://www.nexusmods.com/skyrim/mods/26393]Vilja in Skyrim[/url] mod&#33;  There are 4 Bodyslide Groups to choose from:\r<br />OCR-Vilja_BBP\r<br />OCR-Vilja_BBP_NoNude\r<br />OCR-Vilja_TBBP\r<br />OCR-Vilja_TBBP_NoNude\r<br />\r<br />Pick only one; these represent the various BBP/TBBP Normal/NoNude options.  The only difference between the Normal and the NoNude versions is that the NoNude Night Gown is completely opque, while the normal version is slightly transparent, which I feel is appropriate for sleepwear.\r<br />\r<br />Also included in the Vilja addon is an ESP file which fixes a bug in the original Vilja mod (The Night Gown had a broken weight slider).  In the future, I think I will update this file to add the night gown to some merchant&#39;s inventory, that way you and Vilja can both have one. :)  Gotta brush up on my papyrus first, though.\r<br />\r<br />----\r<br />\r<br />[i]Petite Elves & Busty Redguards[/i]: Changes NPC weights to make elves slim/petite and Redguards curvy/busty. Adds variety to game.  This should work for both new and saved games, though in saved games you might not see the changes for npc&#39;s you&#39;ve already met.\r<br />\r<br />This mod alters the weights of Skyrim&#39;s female Elves and Redguards, lowering the weights for elves (range ~ 0-30) to make them slim/petite and raising them for Redguards (range ~ 50-100) making them buxom/busty.  It is a stand-alone mod, but is intended to be used in conjunction with OCR and a BodySlide body, which together make possible a wide range of body sizes/shapes in the game.\r<br />\r<br />All female elves and Redguards (including vampires) are covered from vanilla Skyrim, plus the following:\r<br />Dawnguard DLC\r<br />Hearthfire DLC\r<br />Dragonborn DLC\r<br />Falskaar MOD\r<br />\r<br />This mod includes a scripted installer that will detect which DLC (and Unofficial Patches) you have and automatically install the correct files. Although automatic installation via Mod Manager is preferred, it is possible to install manually - instructions included in archive readme.\r<br />\r<br />\r<br />As a possible supplement/alternative to PE&BR, you can try [url=http://www.nexusmods.com/skyrim/mods/50846]NPC ReWeHeighter[/url] by tASE.  This is a SkyProc patcher.  The benefits over PE&BR: changes heights in addition to weights, works for males in addition to females, applies to all races not just Elves and Redguards.  The downside is that characters who have their weight significantly changed will have noticeable gaps between their necks and bodies.  One possible tradeoff might be to use PE&BR for female elves and redguards and NPC ReWeHeighter for changes to other races and males.\r<br />\r<br />----\r<br />\r<br />[b]HOW DO I UNINSTALL THIS?[/b]\r<br />What? That&#39;s crazy talk&#33; *sigh* Well, if you installed via NMM, you can deactivate the mod and that will get rid of most of the files.  But the Bodyslide-generated outfits will still be in your game folder.  To remove those, I have provided a &#34;Mesh Remover&#34; package in the Misc Files section. It includes batch files to automatically remove OCR Bodyslide generated meshes, or you can use the included file/folder structure as a reference for manual file removal.\r<br />\r<br />\r<br />--------\r<br />[b]CREDITS[/b]\r<br />\r<br />[b]Caliente[/b] - creator of [url=http://www.nexusmods.com/skyrim/mods/2666]CBBE[/url], [url=http://www.nexusmods.com/skyrim/mods/49015]BodySlide[/url], and [url=http://www.nexusmods.com/skyrim/mods/12273]Caliente&#39;s Vanilla Outfits[/url] - all used in the creation of this mod.\r<br />\r<br />[b]Wedding Dress[/b]: Adapted from Urshi&#39;s [url=http://www.nexusmods.com/skyrim/mods/39588]Noble Wedding Dress[/url]. Incorporates meshes and textures from Ashara&#39;s (aka SydneyB) [url=http://www.nexusmods.com/skyrim/mods/5577]Romantic Outfit[/url] and KURESE&#39;s (aka NPR) [url=http://www.nexusmods.com/skyrim/mods/13082] Fiona Armor[/url]. Textures have been heavily modified by wavion to alter the color scheme and incorporate patterns from the vanilla Skyrim Wedding Dress.\r<br />\r<br />[b]Jester&#39;s Clothes[/b]: Incorporates a texture (with alpha channel modified by wavion) from Kobayashi345&#39;s [url=http://www.nexusmods.com/skyrim/mods/5603]2X Clothing Re-Mix[/url] mod.",
  "categoryId": "60",
  "version": "0.3b",
  "author": "wavion2",
  "createdUnix": "1388322846",
  "updatedUnix": "1391637584",
  "containsAdultContent": true,
  "uploadedBy": "wavion2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000088808",
      "name": "OCR",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6337",
      "fileName": "OCR-49286-0-1.7z",
      "uploadedUnix": "1388316423",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/5948501023a2ecbcba26a928fbf85fb1db3480cc897d9d91e0c0083d89b7eaff/analysis/1407863299/",
      "changelogHtml": " Initial Release <br/> \n CBBE Bodyslide BBP Conversions for all of Caliente&#39;s Vanilla Clothing <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OCR-49286-0-1.7z?fid=1000088808&ttl=1535830046&ri=8192&rs=8192&setec=7497f873a46c82defc4f6625c6b4c231"
    },
    {
      "fileId": "1000089412",
      "name": "OCR",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11127",
      "fileName": "OCR-49286-0-2.7z",
      "uploadedUnix": "1388617766",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/b8dd707e611bfb0bcf5a8470ce887b3e0c97096f7f81eb421ccf995fb4fb764e/analysis/1407868028/",
      "changelogHtml": " Added TBBP Conversions for all of Caliente&#39;s Vanilla Clothing <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OCR-49286-0-2.7z?fid=1000089412&ttl=1535830046&ri=8192&rs=8192&setec=ad6d0d833930b54629541c210629bda3"
    },
    {
      "fileId": "1000090097",
      "name": "Vilja in Skyrim Clothing",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "9111",
      "fileName": "Vilja in Skyrim Clothing-49286-1-0.7z",
      "uploadedUnix": "1388962636",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/19d6b85426ac630015d5b0e830f920715ff1fe615e47870e2b316de6dc6eef9d/analysis/1407873926/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vilja%20in%20Skyrim%20Clothing-49286-1-0.7z?fid=1000090097&ttl=1535830046&ri=8192&rs=8192&setec=a91f598fc65ff43b626d3c699b0bdc7b"
    },
    {
      "fileId": "1000093440",
      "name": "OCR",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34992",
      "fileName": "OCR-49286-0-3.7z",
      "uploadedUnix": "1390706257",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/149c17ed5ef36cda8914e9bf1cdb06dfbd0794dbedd9f3d8fdd7eea13b707d7b/analysis/1407902049/",
      "changelogHtml": " Added &#34;OCR - Petite-Buxom&#34; Bodyslide Preset. Has a good range of sizes and will always be &#34;safe&#34; for OCR outfits. <br/> \n Fixed and reweighted all of the outfits from the CVC Pack to substantially reduce (hopefully eliminate) clipping issues with large bust sizes.  The Bodyslide BreastsSH (Silly Huge) and BreastsSSH (Super Silly Huge) should be safe to use now. <br/> \n New Outfit Pack: Finery Pack.  The finery pack includes the following outfits (plus variants): Fine Clothes (x2), Wedding Dress, Noble Clothes, Embellished Robes, Refined Tunic, Fur-Trimmed Cloak, Fine Raiment, and Embroidered Garment <br/> \n New Outfit Pack: Finery Pack.  The finery pack includes the following outfits (plus variants): Redguard Clothes (Hammerfell Garb) and Jester&#39;s Clothes (Cicero&#39;s Clothes) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OCR-49286-0-3.7z?fid=1000093440&ttl=1535830047&ri=8192&rs=8192&setec=2abe033cd1b9d838d5cefb698bd6b2e4"
    },
    {
      "fileId": "1000093851",
      "name": "Petite Elves and Busty Redguards",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5997",
      "fileName": "Petite Elves and Busty Redguards-49286-1-1.7z",
      "uploadedUnix": "1390896707",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/721c1ea50b8017dc8851461b6c9d13227606dfa8a9a169050c50bc5b7f89e500/analysis/1407905665/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Petite%20Elves%20and%20Busty%20Redguards-49286-1-1.7z?fid=1000093851&ttl=1535830047&ri=8192&rs=8192&setec=022ba5556e5e559cac21b64d1eaa56fa"
    },
    {
      "fileId": "1000095306",
      "name": "Blacker Black Robes",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "410",
      "fileName": "Blacker Black Robes-49286-1-0.7z",
      "uploadedUnix": "1391553384",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e3d2e7c172d3351c95bd78feffd896afecbeec8712ca435a6defc76e3c58fce8/analysis/1407918603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blacker%20Black%20Robes-49286-1-0.7z?fid=1000095306&ttl=1535830048&ri=8192&rs=8192&setec=6e8e24614be64f9704c0118b052a9d5f"
    },
    {
      "fileId": "1000095323",
      "name": "OCR Update",
      "version": "0.3b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1923",
      "fileName": "OCR Update-49286-0-3b.7z",
      "uploadedUnix": "1391563661",
      "modVersion": "0.3b",
      "virusScanUrl": "https://www.virustotal.com/file/56742dd2ef1d8e261a9f303fd715510b45af49fdb3c1f49a534b00ba545d5b36/analysis/1407918787/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OCR%20Update-49286-0-3b.7z?fid=1000095323&ttl=1535830048&ri=8192&rs=8192&setec=7ad6dacaae01c9ccbf543e354c7fb8f0"
    },
    {
      "fileId": "1000095469",
      "name": "OCR - Bodyslide Mesh Remover",
      "version": "0.3",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2",
      "fileName": "OCR - Bodyslide Mesh Remover-49286-1-1.7z",
      "uploadedUnix": "1391637584",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/d43a19068f59fc1c216b11fb515bcde87aee20b528238a2bd248c3e10f24c065/analysis/1407919813/",
      "changelogHtml": " Added &#34;OCR - Petite-Buxom&#34; Bodyslide Preset. Has a good range of sizes and will always be &#34;safe&#34; for OCR outfits. <br/> \n Fixed and reweighted all of the outfits from the CVC Pack to substantially reduce (hopefully eliminate) clipping issues with large bust sizes.  The Bodyslide BreastsSH (Silly Huge) and BreastsSSH (Super Silly Huge) should be safe to use now. <br/> \n New Outfit Pack: Finery Pack.  The finery pack includes the following outfits (plus variants): Fine Clothes (x2), Wedding Dress, Noble Clothes, Embellished Robes, Refined Tunic, Fur-Trimmed Cloak, Fine Raiment, and Embroidered Garment <br/> \n New Outfit Pack: Finery Pack.  The finery pack includes the following outfits (plus variants): Redguard Clothes (Hammerfell Garb) and Jester&#39;s Clothes (Cicero&#39;s Clothes) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OCR%20-%20Bodyslide%20Mesh%20Remover-49286-1-1.7z?fid=1000095469&ttl=1535830049&ri=8192&rs=8192&setec=af4636e6eca75e9e96a51b98c811fc88"
    }
  ]
}