{
  "modId": 49295.0,
  "modName": "Jarvan - Unique Voiced Companion - Exemplar of Akatosh",
  "summary": "Jarvan, The Exemplar of Akatosh. A unique voiced companion with a grievous story to tell. ",
  "descriptionHtml": "[size=4][FONT=Palatino Linotype][center][color=Mediumseagreen][I]The reach of the nine divines spreads beyond the borders of Skyrim and the North,\r<br />into lands hitherto undiscovered and unknown. It is from one of these lands that came\r<br />Prince Jarvan, seeking in this bitter land what he could find in his own; deliverance \r<br />for his people. He has journeyed far to seek one who could put an end to the dragons\r<br />that slaughter his people, and at last he has found you.[/center][/font][/color][/size][/I]\r<br />[IMG]http://i.imgur.com/uTs2xuP.png[/IMG]\r<br />[quote][font=Book Antiqua][size=3]Demacia is dying. The once fertile and prosperous fields now lay barren and scorched from the unrelenting inferno that are the beasts in the sky. Since men could raise arms my forefathers have battled the wretched abominations that terrorise our people but to no avail. No matter how many Dragons have perished at the righteous spear of a Demacian, they always seem to return.  No matter how many of their allies fall, their attacks never cease. But let them send what forces they may; Demacia will never yield.[/size][/font] - [i]Extract from Jarvan&#39;s Journal[/i][/quote]\r<br />[IMG]http://i.imgur.com/tUT9G8n.png[/IMG]\r<br />[font=Arial][size=2.4][color=deepskyblue]Jarvan, the Exemplar of Akatosh. A unique follower hailing from the lands of Demacia, north of Skyrim. You will find Jarvan in the Sleeping Giant Inn, but why is he there and why is he alone? Read his expansive journal in game to learn of the horrific events that have terrorised his homeland, and discover what drove him to venture from his home and the horrible fate of the battalion of soldiers that had accompanied him.\r<br />\r<br />Jarvan comes to Skyrim with his own voice as well as custom armour and weapons (Yes the sword is opaque). Jarvan&#39;s character development through his Journal, voice and attire alone make him a worthwhile companion and brother in arms. As well as bringing a fresh personality to Skyrim. Besides, he needs you as much as you would need him. Jarvan brings a new, lore-friendly storyline to the game, and shows the Dragonborn how Alduin’s power extends far past the borders of Skyrim.[/font][/size][/color]\r<br />[quote][font=Book Antiqua][size=3]...one moment it was a man, then a Dragon, and then a man again. From this mysterious entity I felt something emanating, a power that felt completely unknown and yet strangely familiar at the same time. I felt something swell up within my chest, a sound that came from somewhere far deeper than my mortal soul. I felt the strength of my ancestors, the Demacian warriors of old, who would rather die than fail their people. It was as if I was a man possessed by a beast, one who felt no pain, and knew no goal other than victory. From my chest spread a golden barrier, brighter than the sun and so intense I could feel its glare even with my eyes firmly shut. When I opened them again, the battle had ceased.[/size][/font] - [i]Extract from Jarvan&#39;s Journal [/i][/quote]\r<br />[IMG]http://i.imgur.com/0EtYIfC.png[/IMG]\r<br /> \r<br />[b][u]Examples of his quotes are below:(He has multiple lines for these options, these are just one of many)[/b][/u]\r<br />[b]Taunt[/b] - [i]&#34;You like my weapon? Come on over for a closer inspection&#34;[/i]\r<br />\r<br />[b]I need you to do something[/b] - [i]&#34;I love a challenge&#34;[/i]\r<br />\r<br />[b]Normal to Combat[/b] - [i]&#34;Who dares defy my will?&#34;[/i]\r<br />\r<br />[b]Wait here[/b] - [i]&#34;We shall rest when we are dead&#34;[/i]\r<br />\r<br />[b]Combat to Normal[/b] - [i]&#34;Find me greater foes&#34;[/i]\r<br />\r<br />He also has a 10% chance to say an epic line once a day.\r<br />\r<br />[b][u]Installation:[/b][/u]\r<br />To bring Jarvan into your game, select download with NMM then select the mod and hit activate on the left hand side. You do not need any other mods or dlc, he is standalone.\r<br />If not using NMM, download the file manually, then extract the contents to your Skyrim directory.\r<br />(Dont forget to activate the JarvanFollower.esp if installing manually)\r<br />\r<br />[b][u]Compatibility:[/b][/u] \r<br />Note: make sure you SAVE AND RELOAD WHEN YOU FIRST INSTALL JARVAN OR THEN HE WONT TALK.\r<br />Jarvan should be compatible with any mod. If you use him with follower overhauls such as AFT, EFF or UFO make sure Jarvan is below them in load order. If you have any problems try loading him last. I really don&#39;t recommend using UFO, try one of the other two instead.\r<br />\r<br />[b][u]Change log:[/b][/u]\r<br />-30/12/2013: Version One uploaded.\r<br />-2/1/2014: FaceGen data added as an optional download.\r<br />\r<br />[u][b]To do list:[/b][/u]\r<br />-Had to re-install windows, don&#39;t have access to steam, will work on Jarvan ASAP.\r<br />-Finish up Jarvan&#39;s custom powers (one of them being the barrier ability described in his journal), hopefully released in the next version. (You could count it as already working if it crash the game after 5 seconds. Its that epic ;)\r<br />\r<br />-Create more voiced lines so Jarvan can comment on the world around him\r<br />\r<br />[b][u]Special mentions:[/b][/u]\r<br />Special thanks to iceberg for allowing me to adapt his royal nordic texture for Jarvan&#39;s armour. Check out his mods [url=http://www.nexusmods.com/skyrim/users/1398716/?tb=mods&pUp=1]here[/url]\r<br />\r<br />[center]Here is a main menu (available as an optional download) to accompany the main mod[/center]\r<br />[center][youtube]pIBUJaSrIJ4[/youtube][/center]\r<br />\r<br />\r<br />\r<br />[b][u]For those pesky people out there, Riot Games terms on adapting their content:[/b][/u]\r<br />[quote]Hi -------------------,\r<br />\r<br />Thank you for taking the time to contact me. While we do not grant commercial rights to our content, we have a fairly thorough explanation of our stance on the use of the League of Legends IP here:\r<br />\r<br />http://www.riotgames.com/legal-jibber-jabber\r<br />\r<br />Basically, as long as your endeavor is not for-profit, we are fine with you using League as the basis for a fan project. Be sure to read the legal page carefully, though, as there are some exceptions.\r<br />\r<br />If you have other questions or concerns, please let me know.\r<br />Thanks&#33;\r<br />\r<br />Warmest regards,\r<br />\r<br />orochikyo\r<br />Player Support Specialist\r<br />Riot Games[/quote]\r<br />To summaries what they call Jibber-Jabber, you can use their content as long as it is for non-commercial use and you do not use their logo; as long as it is available to the League player base to access.",
  "categoryId": "66",
  "version": "1",
  "author": "RampagingGamer",
  "createdUnix": "1388430358",
  "updatedUnix": "1388695982",
  "containsAdultContent": false,
  "uploadedBy": "RampagingGamer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089014",
      "name": "Jarvan Follower ",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9954",
      "fileName": "Jarvan Follower -49295-1.rar",
      "uploadedUnix": "1388422733",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/67c66f3ea3f71f822df514427642e5a8f08cbc5b0dd8329c3fbc9afdcf904a73/analysis/1407864840/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jarvan%20Follower%20-49295-1.rar?fid=1000089014&ttl=1535830066&ri=8192&rs=8192&setec=155ad152b235eaef66bce1f39d359e52"
    },
    {
      "fileId": "1000089034",
      "name": "Jarvan - Main Menu",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1928",
      "fileName": "Jarvan - Main Menu-49295-1.rar",
      "uploadedUnix": "1388429161",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b7d7b2a5c09a40d2dfffacbdadcadd8cd10cc70ebad005d9159d28428fef8b28/analysis/1407865088/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jarvan%20-%20Main%20Menu-49295-1.rar?fid=1000089034&ttl=1535830067&ri=8192&rs=8192&setec=4842d94483b157c937162671af406cf1"
    },
    {
      "fileId": "1000089578",
      "name": "Jarvan Face Gen Data",
      "version": "1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "147",
      "fileName": "Jarvan Face Gen Data-49295-1.rar",
      "uploadedUnix": "1388695982",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8171a0bd1e42350482106850629932e68836626c63dd8bdd2b4411760e894e11/analysis/1407869228/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jarvan%20Face%20Gen%20Data-49295-1.rar?fid=1000089578&ttl=1535830067&ri=8192&rs=8192&setec=6bb31020a1da024fbb4efd3ec2810e0d"
    }
  ]
}