{
  "modId": 49302.0,
  "modName": "More Useful Staves",
  "summary": "Many of the default staves that appear in skyrim&#39;s loot are far less powerful than their counterpart spells. This means that magic using characters would rather use their spells and nonmagic using characters often find staves too weak to bother with, especially in terms of staves of restoration and illusion magic. This mod increases the power o",
  "descriptionHtml": "A GRAND staff only affects enemies up to level 8???\r<br />\r<br />After playing Skyrim for several years, I noticed that I had never bothered to pick up a restoration or illusion staff except to sell. I initially assumed that due to my characters not having perks in those schools, and that the staves would be more effective on a different character build. However I soon realized that even without perks, most staves in the game have weaker effects than the spells that they are based on. This means that staves are essentially useless. They are useless to characters who don&#39;t have perks in their school of magic as the effects are pathetically weak and they are also useless to characters that do have perks in their school as the spells they already know are strictly better. I created this mod to correct the problem by increasing the power of the staves found in random loot to have effects that are as powerful as their counterpart spells. The amount of enchantment power that the staves use per cast was kept the same so the staves have the same number of uses as vanilla and aren&#39;t any harder to recharge. The Destruction, Alteration, and Atronach summoning staves already had parity with their spells and so remain unchanged.\r<br />\r<br />==Change Log==\r<br />Vanilla Effect -&gt; Modded Effect\r<br />\r<br />--Conjuration Staves--\r<br />-Staff of Banishing- Banish up to lvl 7 -&gt; lvl 15 as per the spell Banish Daedra\r<br />-Staff of Zombies- Reanimate up to lvl 3 -&gt; lvl 6 as per the spell Raise Zombie\r<br />-Staff of Reanimation- Reanimate up to lvl 6 -&gt; lvl 13 as per the spell Reanimate Corpse\r<br />-Staff of Revenants- Reanimate up to level 9 -&gt; lvl 21 as per the spell Revenant\r<br />-Staff of Dread Zombies- Reanimate up to lvl 12 -&gt; lvl 30 pts as per the spell Dread Zombie\r<br />\r<br />--Illusion Staves--\r<br />-Staff of Fear- Fear up to lvl 8 -&gt; lvl 9 as per the spell Fear\r<br />-Staff of Vanquishment- Rout up to lvl 12 -&gt; lvl 20 as per the spell Rout\r<br />-Staff of Fury- Fury up to lvl 4 -&gt; lvl 6 as per the spell Fury\r<br />-Staff of Frenzy- Frenzy up to lvl 8 -&gt; lvl 14 as per the spell Frenzy\r<br />-Staff of Calm- Calm up to lvl 8 -&gt; lvl 9 as per the spell Calm\r<br />-Staff of Courage- Courage 6pts -&gt; Courage 100pts as per the spell Courage\r<br />-Staff of Inspiration- Rally 10pts -&gt; Rally 100pts as per the spell Rally\r<br />\r<br />--Restoration Staves--\r<br />-Staff of the Healing Hand- Restore 4 health per second -&gt; Restore 10 health per second as per the spell Healing Hands\r<br />-Staff of Mending- Restore 45 health to target -&gt; Restore 75 health as per the spell Heal Other\r<br />-Minor Staff of Turning- Turn undead up to lvl 4 -&gt; lvl 6 as per the spell Turn Lesser Undead\r<br />-Staff of Turning- Turn undead up to lvl 8 -&gt; lvl 13 as per the spell Turn Undead\r<br />-Grand Staff of Turning- Turn undead up to lvl 12 -&gt; lvl 21 as per the spell Turn Greater Undead\r<br />-Staff of Repulsion- Repel Undead up to lvl 4 -&gt; lvl 8 as per the spell Lesser Repel Undead\r<br />-Grand Staff of Repulsion- Repel Undead up to lvl 8 -&gt; lvl 16 as per the spell Repel Undead\r<br />\r<br />--Unique Staves--\r<br />-Halldir&#39;s Staff- Pacify 12pts -&gt; 20pts as per the spell Pacify\r<br />-Staff of Arcane Authority- Fear 8pts -&gt; 9pts same as the normal Staff of Fear \r<br />",
  "categoryId": "55",
  "version": "1.0",
  "author": "Lordcynic",
  "createdUnix": "1388359428",
  "updatedUnix": "1388358641",
  "containsAdultContent": false,
  "uploadedBy": "Lordcynic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000088883",
      "name": "More_Useful_Staves",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "More_Useful_Staves-49302-1-0.7z",
      "uploadedUnix": "1388358641",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d18f9f2ed5f7505cb699d8877415727fc6b286035782850b25734a2db204f06e/analysis/1407864002/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More_Useful_Staves-49302-1-0.7z?fid=1000088883&ttl=1535830076&ri=8192&rs=8192&setec=4c017b0a2fa72b3b8aad7b17b86b7f76"
    }
  ]
}