{
  "modId": 49325.0,
  "modName": "Steel Armor HD2k",
  "summary": "Steel armor with HD 2k textures shiny reflections and cleaner look. No more boring grey defaults, steel should be somewhat shiny. Leather looks like leather, fur looks like hairy fur and finally PANTS&#33; no more puke green goat hair crotch&#33; Made this mod to go along with my steel and skyforge steel weapons mod.",
  "descriptionHtml": "Steel armor retexture with 2k resolution and high res cube map. Reflections are definitely noticable and no need for enb&#33; No more boring blurry steel shield textures totally replaced the wood in that shield looks very different from defaults. Now you won&#39;t feel the need to immediately re armor your housecarl when you first meet them.\r<br />\r<br />I was so sick and tired of looking at that puke green goat hair texture so I got rid of it and replaced the fur with real fur then added pants with stitches down the sides of the legs and all that. Leather areas look like leather and they are different based on what they are for. \r<br />\r<br />Some leather looks like it is made for constant movement and some is made for some kind of armor or combat leather effect. Trying to figure out what combat leather looks like is really hard actually, should it be hardened or softer and more ablative? These kind of questions are hard to answer quickly. I put a lot of detail into the different leather areas and stitches. The bottom of the boots has a steel or metal tread, defaults looked like the wearer would slip all over the place when it rained. I added some chain mail around the waist because how can a stiff piece of STEEL bend and move like cloth? it makes more sense to have some chain mail there with the leather around that area for better agility of the wearer.\r<br />\r<br />\r<br />There is no esp file this is just a retexture but the cube map is custom with custom nif file settings so the default nif files are included but for people using custom bodies for male and female you will have to adapt the custom nif file settings to your custom armor meshes for CBBE or whatever you are using. \r<br />\r<br />Just look at the nif files included and copy the custom cube map paths to your armor meshes and copy the environment scale map settings of 1.5 so the cube map works properly.\r<br />\r<br />There are two files in this mod, white fur and brown fur versions check the screenshots for details.\r<br />\r<br />Install with NMM or manual install should work fine either way.\r<br />\r<br />There is some clipping for female boots for CBBE users I have yet to find a remodeled default looking female boots. I use CBBE curvy and it is very noticeable but default body users won&#39;t see much or any clipping. \r<br />\r<br />For custom male bodies like sos or sos light there is some clipping around the gauntlets very hard to see near the top and the left side of the steel armor the armpit is really messed up probably because of bone weight differences between the armor and custom skeletons. All the bugs of the default meshes really shows when custom bodies of any kind are used in this game.\r<br />\r<br />Find any bugs? Post them in the comment section so I can fix them thanks:-)",
  "categoryId": "54",
  "version": "v1.0",
  "author": "Dragonslayer2k12",
  "createdUnix": "1388422213",
  "updatedUnix": "1388421242",
  "containsAdultContent": false,
  "uploadedBy": "dragonslayer2k12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089005",
      "name": "SteelArmorHD2kwhite",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25834",
      "fileName": "SteelArmorHD2kwhite-49325-v1-0.rar",
      "uploadedUnix": "1388420536",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/05535a9edfa859584b055260fd161aa2cc7b31325af5922fbace04353ee6ada7/analysis/1407864808/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SteelArmorHD2kwhite-49325-v1-0.rar?fid=1000089005&ttl=1535830109&ri=8192&rs=8192&setec=6fb196bcd66eea4ed62653f83709a4b8"
    },
    {
      "fileId": "1000089006",
      "name": "SteelArmorHD2kbrown",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25817",
      "fileName": "SteelArmorHD2kbrown-49325-v1-0.rar",
      "uploadedUnix": "1388421242",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/198edc0716b8b5dac7d4eb7765331ce761bc5bce278b77a5d409d5562de1bd4d/analysis/1407864830/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SteelArmorHD2kbrown-49325-v1-0.rar?fid=1000089006&ttl=1535830109&ri=8192&rs=8192&setec=48f48c2b0fc59ee68617935119b18e54"
    }
  ]
}