{
  "modId": 49332.0,
  "modName": "Even Better Quest Objectives German",
  "summary": "German translation of WilliamImms Even Better Quest Objectives. A unofficial update to whickus Better Quest Objectives. Enhances the quest descriptions in the vanilla game.",
  "descriptionHtml": "[size=5][b]Hinweis des Übersetzers[/b][/size]\r<br />\r<br />Ich bin [u]nicht[/u] der Mod-Autor sondern nur der verantwortliche Übersetzer der deutschen Version von [url=http://www.nexusmods.com/skyrim/mods/32695]Even Better Quest Objectives[/url]. Alle Verantwortlichkeiten und Rechte liegen bei [url=http://www.nexusmods.com/skyrim/users/4363416]WilliamImm[/url]. Weitere Informationen zur Übersetzung findest du im FAQ Teil der Beschreibung. Dort ist auch ein wichtiger Hinweis bezüglich der Patches.\r<br />\r<br />[size=3][b][url=http://www.nexusmods.com/skyrim/mods/32695]Ich bitte darum das ihr nicht vergesst WilliamImm ein Endorsement zu geben.[/url][/b][/size]\r<br />\r<br />Ich wünsche viel Spaß mit dem Download und bis zur nächsten Übersetzung.\r<br />Riknar alias rick.dangerous\r<br /> \r<br />[b][size=5]Beschreibung[/size][/b]\r<br />\r<br />Diese Mod verbessert die Questbeschreibungen im Vanilla-Game, so dass du eine klare Vorstellung davon hast wo du hingehen sollst und was du dort neben der Suche nach dem Questmarker zu tun hast. Seien wir mal ehrlich - die Questbeschreibungen waren ziemlich schlecht, spezifizierten nicht genau wo du hinzugehen hattest und zwingen einen die ganze Zeit mit sichtbaren Questmarkern zu spielen. Das betrifft annähernd 250 Questsziele und -beschreibungen, die sich über 160 Quests ziehen, Beschreibungen die ziemlich vage waren oder gar nicht existierten.\r<br />\r<br />Wenn du möglicherweise Whickus&#39; Better Quest Objectives gesehen hast, dann wirst du sein Konzept hier wieder erkennen, da dieser Mod größtenteils durch ihn inspiriert wurde. Aufgrund Whickus&#39;s verschwinden vom Nexus, verwahrloste seine Mod immer mehr und veraltete im Laufe der Zeit - beinhaltete nicht die Korrekturen der inoffiziellen Patches, Änderungen bei den DLC und selbst durch offizielle Updates von Bethesda. Die Wiederaufbereitung dieser Mod wurde auch dadurch erschwert, dass der Autor den Quellcode für die Scripts nicht beilegte.\r<br />\r<br />Nun zum Mod. Eine aktualisierte Neuauflage von Whickus&#39; Mod, beinhaltet die Korrekturen der inoffiziellen Patches und offiziellen Updates, so dass sich diese Änderungen nicht mehr zurücksetzen. Aber auch die Verbesserungen der Questbeschreibungen und -ziele.\r<br />\r<br />Ein paar Dinge gibt es zu beachten: Ein paar Quests mit mehrdeutigen Beschreibungen wurden so belassen wie sie waren, da sie als Rätsel zu verstehen sind. (Anm. d. Übers.: Hier folgte ein Idiom aus der engl. Version von Batman: Arkham Asylum. Was selbst als ein Rätsel zu verstehen war, quasi das Rätsel liegt im Text selbst. &#34;It&#39;s as likely as me cutting myself on a sharply observed portrait.&#34;) Auch Quests in Tagebüchern, welche die Informationen über einen Ort selbst liefern wurden direkt darin bearbeitet und nicht anstelle der Questbeschreibungen.\r<br /> \r<br />\r<br />[b][size=5]Installation[/size][/b]\r<br />\r<br />Du musst die inoffiziellen Skyrim Patches installiert haben. Sonst wird das Spiel beim Start abstürzen, da diese Mod die Patches als Master-Files nutzt (weil einige dieser Korrekturen in den Mod integriert wurden). Aber du solltest sie sowieso installiert haben, da sie wirklich eine ganze menge Fehler beheben, was Bethesda nicht hinbekommen hat. Alle DLC-Plugins erfordern die jeweiligen inoffiziellen Patches. (Anm. d. Übers.: Hier sei für deutsche User das [url=http://www.scharesoft.de/joomla/index.php?option=com_remository&Itemid=27&func=fileinfo&id=2500]Skyrim Directors Cut[/url] (SDC) zu empfehlen, da dort die Fixes auch Übersetzt wurden.)\r<br />\r<br />Lade Datei herunter uns installiere sie mit einem Mod Manager. Manuelle Installation ist auch möglich, aber nicht zu empfehlen. Der Mod wurde für eine einfache Installation mit Mod Organizer, Wrye Bash und NMM vorbereitet. Wenn du ihn also mit einem davon verwendest wird sich alles schön automatisch Installieren. (Empfehle dir ehrlich den Mod Organizer zum installieren zu verwenden - NMM ist zu stark vereinfacht und Wry, obwohl es gut ist hat man doch eine starke Lernkurve.)\r<br />\r<br />Wegen der Ladereihenfolge, BOSS sollte die meisten Plugins korrekt sortieren. Wenn ein Kompatibilitätspatch für diesen Mod raus kommt, wird er vor erscheinen zur BOSS masterlist hinzugefügt.\r<br /> \r<br />\r<br />[b][size=5]Deinstallation[/size][/b]\r<br />\r<br />Deinstalliere und Lösche den Mod mit deinem Mod Manager oder lösche jede Datei im Skyrim/Data-Ordner welche mit &#34;BetterQuestObjectives&#34; anfängt.\r<br /> \r<br /> \r<br />[size=5][b]Kompatibilität[/b][/size]\r<br />\r<br />Alles was die Vanilla Quests modifziert kann auch die besseren Beschreibungen überschreiben. Wenn das dein Mod macht emfehle ich einen Kompatibilitätspatch zwischen den beiden Mods zu machen (z.b. mit TES5Edit).\r<br />\r<br />\r<br />[size=5][b]Frequently Asked Questions (FAQ) / Häufig gestellte Fragen[/b][/size]\r<br />\r<br />[b]Bietest du Hilfe bei Problem mit diesem Mod an?[/b]\r<br />Kurz und schmerzlos: Nein.\r<br />\r<br />[b]Mit was hast du den Mod übersetzt?[/b]\r<br />Siehe bei den Credits.\r<br />\r<br />[b]Darf ich deine Übersetzung weiter verwenden?[/b]\r<br />Nein, bis auf eine Ausnahme. Viele der Kompatibilitätspatches von WilliamImm sind auf Mods bezogen die noch nicht übersetzt wurden. Ich habe die ID Einträge in seinen Patches aber so behandelt, was würden sie existieren. Falls also jemand diesen englischen Mod nutzt, wird er durch die Patches zum Teil wieder deutsche Texte haben. Ich gehe davon aus, das über kurz oder lang diese Mods übersetzt werden, von mir oder jemand anderes. Daher dürfen diese Textstellen aus Gründen des Stils, gerne verwendet werden. Dies betrifft aber nicht die Hauptbestandteile des Mods. Sollte ich aus persönlichen Gründen den Mod nicht mehr aktuell halten können, werde ich eine Abänderung der Bedingungen hier eintragen. Desweiteren benötgt ein anderer Modder so oder so zusätzlich die Genehmigung von WillamImm.\r<br />\r<br />[b]Übersetzt du mir Mod XY?[/b]\r<br />Was ich übersetze mache ich einzig und allein von meiner persönlichen Lust abhängig. Generell bin ich großer Fan des STEP-Projekts, daher werden wohl noch ein paar Übersetzungen von da kommen. Auch empfehle ich auch mal jedem selbst an eine Mod für die Selbstnutzung (ohne Veröffentlichung irgendwo) hand mit TESVTranslator zu legen. Es ist nicht so schwer wie manche denken. Bei vielen Mods gibts oft nur eine Hand voll Einträge zu übersetzen und gut die Hälfte wenn nicht sogar 2/3 übersetzt das Tool selbstständig, wenn die Einträge so auch in den dt. Original String-Files von Bethesda stehen, es gibt sogar auch eine Art heuristisches Übersetzungsverfahren, was auf Grundlage der angelegten Datenbank (aus den Files oder eigenen arbeiten) versucht Einträge zu übersetzen. Das ist zwar nicht ganz exakt, nimmt einen aber auch schon einen großen Teil der Arbeit ab. Nicht jede Mod ist so komplex und Zeitaufwendig in der Übersetzung wie z.b. diese hier oder SkyRe. Wenn überhaupt sind es nur Mods die Quests, Perks, Bücher, Scripts und Dialoge im großen Stil verändern wirklich aufwendige Arbeit. Also nur mal so als Tipp, für die jenigen die unbedingt Übersetzungen wollen, aber von Mod XY keine finden.\r<br />\r<br />[b]Warum hast du manche Dinge nicht übersetzt?[/b]\r<br />Innerhalb des Mods habe ich alles gemäß der Atmosphäre übersetzt. Außerhalb davon halte ich nichts davon jeden Furz zu übersetzen, es gibt sinngemäße Dinge die im deutschen Sprachgebrauch übernommen wurden und sich oftmal nur sehr schlecht übersetzen lassen oder die dt. Entsprechungen sind selbst keine Umgangssprache. Des weiteren werde ich auch nicht Mod-Namen wie Even Better Quest Objectives übersetzen, da ich behaupte das 99% der Leute die eine Suchfunktion (hier oder Google) mit den englischen Begriffen nutzen und das eher mehr für Verwirrung sorgen würde. Desweiteren hat mich der Modautor gebeten, bei der Übersetzung seinen Sprachstil beizubehalten. Vorallem beim Installer und der Beschreibung.\r<br /> \r<br />\r<br />[size=5][b]Verantwortliche / Credits[/b][/size]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/4363416]WillamImm [/url]für [url=http://www.nexusmods.com/skyrim/mods/32695]Even Better Quest Objectives[/url] & Modbeschreibung & Installer - Author des viel besseren Originals ^_^\r<br />[url=http://www.nexusmods.com/skyrim/users/2291595]whickus[/url] für [url=http://www.nexusmods.com/skyrim/mods/11135]Better Quest Objectives[/url] - Author des original Mods\r<br />[url=http://www.nexusmods.com/fallout3/users/167469]ElminsterAU[/url], [url=http://www.nexusmods.com/skyrim/users/4147439]Sharlikran [/url]und [url=http://www.nexusmods.com/oblivion/users/156622/]Zilav [/url]für [url=http://www.nexusmods.com/skyrim/mods/25859]TES5Edit [/url]- Bester Editor für ESP/ESM vorallem für schnelle Korrekturen\r<br />[url=http://www.nexusmods.com/skyrim/users/3408338]mcguffin [/url]für [url=http://www.nexusmods.com/skyrim/mods/29148]TESVTranslator [/url]- Es gibt kein besseres Werkzeug um Datenbank gestützt zu übersetzen\r<br />Don Ho für [url=http://notepad-plus-plus.org/]Notepad++[/url] - Er verdient Gottstatus für dieses überlebenswichtige Tool\r<br />[url=http://bethsoft.com/]Bethesda Softworks [/url]für Skyrim - Das wohl beste modular modifizerbare PC Game auf dem Planeten",
  "categoryId": "78",
  "version": "1.4",
  "author": "by whickus and by William Imm and German translation by Riknar",
  "createdUnix": "1388436428",
  "updatedUnix": "1388435916",
  "containsAdultContent": false,
  "uploadedBy": "Riknar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089068",
      "name": "Even Better Quest Objectives German",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10232",
      "fileName": "Even Better Quest Objectives German-49332-1-4.7z",
      "uploadedUnix": "1388435916",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/76a5f942ad86644b5f0d98511fc7ef6ae78ec2f61fc6fe49d7bdcf33e886dc19/analysis/1407865303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Even%20Better%20Quest%20Objectives%20German-49332-1-4.7z?fid=1000089068&ttl=1535830120&ri=8192&rs=8192&setec=9f9b028e119f55ac80d10c2e66a59949"
    }
  ]
}