{
  "modId": 49333.0,
  "modName": "Areyans Dragonmod",
  "summary": "Generally enhances dragons to retain them as a lethal threat througout the game.\r<br />\r<br />I have tried to keep my changes logical, lore-friendly (where applicable), and non-exotic, in order to stay close to the intended vanilla feel of dragons.\r<br />So there are no rainbow-breathing, glowing in the dark or whatnot dragons to be found here.",
  "descriptionHtml": "[b][color=#EE400D][size=5]General info[/size][/color][/b]\r<br />This is a simple mod that in short generally enhances dragons to keep them as dangerous foes and a potent threat for all levels and most play-styles.\r<br />I&#39;ve also tried to keep my changes logical, lore-friendly (where applicable), and non-exotic, so that the mod doesn&#39;t make the dragons feel to different, strange, weird or just crazy compared to vanilla.\r<br />For instance, even though I&#39;ve added a few extra shouts, the shouts they use the most are still their default fire/frost shouts. They mostly restrict their use of the new shouts where appropriate or logical.\r<br />\r<br />You&#39;ll probably enjoy this mod if you, as me, like the vanilla feel of dragons, but think they are too easy, and think other dragonmods do to much crazy stuff.\r<br />\r<br />[b][color=#EE400D][size=5]Installation, uninstallation etc[/size][/color][/b]\r<br />Just download the main file and any optional files you may want and exctract to your Skyrim/Data folder. Or let the NMM do it for you.\r<br />Then make sure to enable the esm and any other esps you downloaded.\r<br />To uninstall just do the above in reverse.\r<br />No extra fuss or voodo-magic should be needed.\r<br />\r<br />Load order shouldn&#39;t be any fuss either. \r<br />If you&#39;re having issues however, see if it helps to put all of the mod files after any official DLCs in the load order, with VAF_DragonMod01.esm before any associated esps.\r<br />And please ensure that no other mods are installed that make any changes to dragons.\r<br />\r<br />[b][color=#EE400D][size=5]Compatability[/size][/color][/b]\r<br />The mod is compatible with both Dawnguard and Dragonborn official DLCs, just download the extensions.\r<br />\r<br />Due to the simple nature of the mod and it&#39;s implementation details, it&#39;s unlikely that all of its changes will be fully applied to dragons that may be added by other mods.\r<br />As it usually is with most mods.\r<br />This is however a somewhat intentional choice by me, as I don&#39;t want my mod to inadvertently make changes to dragons that other modders have created that they have intended to be excactly as they are.\r<br />However, as I&#39;ve packed all the data in the main file (VAF_DragonMod01) and made it a master file (.esm), it should be relatively easy to extend compatability to other mods if necessary.\r<br />\r<br />Other than that it&#39;s definetely incompatible with any other dragonmod. \r<br />\r<br />[b][color=#EE400D][size=5]Technical details[/size][/color][/b]\r<br />[color=#EE400D][size=3]Generic changes:[/size][/color]\r<br />[list]\r<br />[*] Increased health and some other stats of all dragons.\r<br />[*] Dragons regenerate health in combat, slowly, but noticable if it don&#39;t suffer damage for a small period of time.\r<br />[*] Slightly increased speed of all dragons.\r<br />[*] Added a knockback effect to their wing attack similar to the werewolf power attacks. (It can be countered by blocking)\r<br />[*] All common dragons have a constant dismay effect on NPCs (ranging from &lt;=10 to &lt;=35) within 250 feet.\r<br />[/list]\r<br />[color=#EE400D][size=3]Resistance changes (Not Alduin and some other special dragons):[/size][/color]\r<br />[list]\r<br />[*] 100% Resist disease\r<br />[*] 10% - 80% Resist poison\r<br />[*] 0% - 30% Resist magic\r<br />[*] 10% - 50% Resist damage\r<br />[*] 30% - 90% Resist fire or frost\r<br />[/list]\r<br />[color=#EE400D][size=3]Dragon shout changes (All dragons unless specified otherwise):[/size][/color]\r<br />[list]\r<br />[*] Added Unrelenting force shout.\r<br />[*] Added Dismay shout with area effect that will, depending on level, affect deadra, undead and dragons as well.\r<br />[*] Added Disarm shout. Not yet fully sure about wether this shout adds challenge or is simply annoying, and thus wether it will be removed or not in the future.\r<br />[*] Removed Drain vitality shout from dragons added by Dawnguard, except for Durnevhiir. I found that they used it far to often, and I&#39;m not really into the dragons talking all the time.\r<br />[*] Added new stronger Fire/Frost-ball shouts to dragons added by Dawnguard as replacement for their Drain vitality shout.\r<br />[/list]\r<br />\r<br />Note: Other than stats and adding shouts I&#39;ve done few other changes to Alduin and other special dragons as some of my changes may have side-effects with their intended role in the game.\r<br />\r<br />[b][color=#EE400D][size=5]Possible future changes[/size][/color][/b]\r<br />Note: These are just ideas I&#39;m experimenting with, and may or may not be implemented in the future.\r<br />[list]\r<br />[*] Might add the player variant of fire- and frostbreath shouts to dragons.\r<br />[*] Might add a Bend will shout that affects follower and/or summoned followers/creatures to higher level Solstheim dragons.\r<br />[*] Might add a shout with similar effects as the banish deadra and/or command deadra spells to higher level dragons.\r<br />[*] Might consider changing some of the internal design of the mod for better compatability/extendability with other mods if necessary.\r<br />[/list]",
  "categoryId": "77",
  "version": "1.0",
  "author": "Areyan",
  "createdUnix": "1388432718",
  "updatedUnix": "1388511965",
  "containsAdultContent": false,
  "uploadedBy": "Areyan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089070",
      "name": "VAF_DragonMod02",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "VAF_DragonMod02-49333-1-0.zip",
      "uploadedUnix": "1388436212",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2eea5928f94bdaf38320a6e0367965f25acb209480c687e741c6b24b87afc5d1/analysis/1407865303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VAF_DragonMod02-49333-1-0.zip?fid=1000089070&ttl=1535830122&ri=8192&rs=8192&setec=242ab5c14db3dba8c8262e338fd3a7ca"
    },
    {
      "fileId": "1000089071",
      "name": "VAF_DragonMod03",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "VAF_DragonMod03-49333-1-0.zip",
      "uploadedUnix": "1388436300",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/604be2e776b4744eea17f00198df88884c1df46ad68fddc4186704cdf0ca02fb/analysis/1407865330/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VAF_DragonMod03-49333-1-0.zip?fid=1000089071&ttl=1535830122&ri=8192&rs=8192&setec=62d5301f0f9d9dcb0e7545ad064a4f89"
    },
    {
      "fileId": "1000089217",
      "name": "VAF_DragonMod01",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3715",
      "fileName": "VAF_DragonMod01-49333-1-3.zip",
      "uploadedUnix": "1388511965",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3fdd882482426e46036d53aac255a94e31c37746672a1cad4ce0b2d23dbc120e/analysis/1407866525/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VAF_DragonMod01-49333-1-3.zip?fid=1000089217&ttl=1535830123&ri=8192&rs=8192&setec=ea6dc853a6427405dea3887192ce8e5b"
    }
  ]
}