{
  "modId": 49343.0,
  "modName": "Galens Repose",
  "summary": "Galens Repose is an old, repurposed fort on the eastern outskirts of Whiterun offering simplistic custom storage, readily accessible crafting stations in a cozy environment. For the immersive roleplayer, there are a few tidbits of backstory hidden throughout the small fort, waiting to be found.",
  "descriptionHtml": "Small, repurposed fort-home offering custom storage, immersive crafting stations, and a bit of hidden backstory. \r<br />\r<br />\r<br />[STORY]\r<br />\r<br />Galen&#39;s Repose is a small, once-abandoned fort found just outside Whiterun on it&#39;s eastern outskirts. It&#39;s had it&#39;s share of experiences, some backstory of which can be found if you look around the area hard enough. During one point in Skyrim&#39;s history, it served as a scouting outpost for the city as well as an external holding ground for criminals waiting to be tried and (or) sentenced.\r<br />\r<br />Nowadays it sits quiet. Wasting away to the elements. Fortunately, every so often an adventurer comes around and cleans up the place a little. Or, uh. Just further messes things up. It really depends on who and why they&#39;re stopped by.\r<br />\r<br />\r<br />\r<br />[FEATURES]\r<br />\r<br />Custom Named Storage* (Hide and Leathers below the Ingots and Ores)\r<br />\r<br />Alchemy Table\r<br />\r<br />Cooking Stone (Pot)\r<br />\r<br />Workbench\r<br />\r<br />Grinding Stone\r<br />\r<br />Shrine of Arkay\r<br />\r<br />Three Weapon Racks\r<br />\r<br />Plenty of Herbs Outside\r<br />\r<br />General, Chest Storage*\r<br />\r<br />Tanning Rack and Anvil (on the roof)\r<br />\r<br />Custom Enchanting Apparatus (bowl on the altar)\r<br />\r<br />Bed\r<br />\r<br />*None of the storage has a respawn so feel safe putting up your valuables, here.\r<br />\r<br />\r<br />\r<br />[KNOWN ISSUES]\r<br />\r<br />Characters can sometimes might get temporarily stuck on the ladder if they hug the wall.\r<br />\r<br />Couple of Soul Gems are intended to be static, but still display use text.\r<br />\r<br />\r<br />\r<br />[Author&#39;s Note]\r<br />\r<br />This is my first mod -- and it&#39;s a housing mod&#33; There are probably dozens upon dozens of wonderful Skyrim houses offered already, but nothing I found really clicked with me in terms of size, offering, and location. To cut a long story short, I finally decided to watch a few videos, read up a couple of tutorials and try my own hand at making a place to call my own.\r<br />\r<br />Of course. I can&#39;t guarantee there aren&#39;t bugs. This is a work in progress for sure. Please be aware that while the layout may be quite friendly to all types of folk and adventurer alike, the navmesh is an absolute mess and it will be a short while before I can get all of the kinks out. Regardless, please post if you encounter any bugs or errors and I&#39;ll do what I can to get on them and get the place further polished. Thanks&#33;",
  "categoryId": "67",
  "version": "1.1",
  "author": "Rakumn",
  "createdUnix": "1388456382",
  "updatedUnix": "1388456041",
  "containsAdultContent": false,
  "uploadedBy": "Rakumn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089114",
      "name": "Galens Repose",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "41586",
      "fileName": "Galens Repose-49343-1-1.rar",
      "uploadedUnix": "1388456041",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f1085d7e906cae1fc036a00f77148a0f85743787c849b73ad36814cda2def241/analysis/1407865729/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Galens%20Repose-49343-1-1.rar?fid=1000089114&ttl=1535830140&ri=8192&rs=8192&setec=5378e0bf31c808f9d13510da28827d5c"
    }
  ]
}