{
  "modId": 49352.0,
  "modName": "Many Great Textures",
  "summary": "Guide linking you to all the best textures mods, using the Mod Packager utility to create a high quality  texture set. ",
  "descriptionHtml": "[u][b]What is MGT?[/b][/u]\r<br />This mod takes many of the great works done by the talented texture artists on the nexus, and combines them together to make one big, super awesome texture mod. It is similar to the TPC tool that was under development for a while, but much larger and more ambitious. [u]This mod does not include any textures of its own[/u], instead you download the textures from the authors themselves.  Using the Automated Mod Package utility, it combines the thousand of files included in the pack, so that only the textures of the highest quality make it into your game. This mod servers two purposes; first it directs you to the best content on the nexus, and second it arranges these mods in a specific way so you get the best visual experience. Many texture mods cover the same objects. There are at least three mods in the MGT package that texture furniture, for example. This mod makes it so that the best one is in you game, and not any of the others. Arranging texture mods in the best and most optimal way is a tedious task. Fortunately MGT handles all of that for you with a meticulous attention to detail&#33;\r<br />\r<br /> Nearly every object in the skyrim universe have been remade with high quality, high resolution textures. This includes the landscapes, terrain, trees, plants, and flora, all the cities and towns, clothing, weapons, armor, NPCs face and bodies, and much much more. The utility supports multiple versions of many of the mods, so you can pick and choose between versions of the highest quality, and the leanest and most resource efficient for lower end PCs. Many of the mods included have already been optimized by the mod authors, so you can expect great performance in addition to awesome visuals.\r<br />\r<br />The files from each of these great mods has been painstakingly sorted through. More than just putting one mod on top of another, individual pieces have been removed and some texture mods have been given priority over others. Its an ambitious effort to create a custom texture package with meticulous attention to detail. \r<br />\r<br />\r<br />\r<br />[u][b]Installation Intructions[/b][/u]\r<br />To install MGT, first download the user package from [url=http://www.nexusmods.com/skyrim/mods/49367/?]Automated Mod Packager[/url] utility.\r<br />\r<br />Extract that archive anywhere you like. Download the MGT source files from the download section, and extract them in a different place. Place the source folder included in the download for this mod into the user folder. \r<br />\r<br />[u]The MGT Guide included in the download lists all the mods MGT supports and directs you to where you can download them.  Its a lot, to much to list on this page.[/u]\r<br />\r<br />Place all the mods you downloaded for MGT into the user folder as well. Double click on the ModPackageBuilder.exe. It will take about an hour for the utility to finish, so be patient. When that is done, an archive called &#34;MGTv1.0&#34; will be in the user directory, as well as folder called &#34;Skyrim&#34;. You can use a mod organizer to install the archive. I recommend Mod Organizer (MO) because the nexus mod manger sometimes has problems with archives that are really big. For a manual installation, drag and drop the skyrim folder into your steam directory. \r<br />\r<br />[img]http://i303.photobucket.com/albums/nn153/mothergoose729/installationinstructionMGT_zps3ecad8e6.png[/img]\r<br />\r<br />[u][b]How are the &#34;best&#34; Textures Selected?[/b][/u]\r<br />This mod strongly reflects my opinions on what makes an attractive game. Many mods on the nexus are simply vanilla textures that have been upscaled and sharpened with photoshop. They are not an improvement at all, and often times they actually look worse in game than the vanilla textures. None of these are included in MGT.\r<br />\r<br />Many popular mods on the nexus have [b]too[/b] many tiny and intricate details in their textures, so much to the point that it becomes messy, and busy. In my opinion it takes a lot of skill to make a very detailed texture that looks equally good in game as in screenshots, and there is a needs to be a balance between details that are meant to look good up close, and those that look good from a distance (after all, you don&#39;t spend much time with your nose against thing&#33;). I can&#39;t say that all of the textures in MGT are wonderful examples of appropriate detail, but I tried to do my best to include textures that both look good and don&#39;t create a visual strain while playing.\r<br />\r<br />Lastly, consistency is important. Dirt should look good everywhere. If one wall has certain details on it, all the walls in that city should look about the same. I am a huge fan of some of the texture mods out there, but I didn&#39;t include them in MGT because they just didn&#39;t &#34;fit&#34; in with the rest of the world as well as some others did. Pieces of some mods were excluded simply to make some areas of the game be more consistent with other areas, even if the textures were a little better. Lastly, there are blending issues as well. If the texture in one object doesn&#39;t flow appropriately into another object that is a problem. Nearest I can tell, all the mods in MGT have great blending and flow very nicely. \r<br />\r<br />If you are using MGT and you notice a texture that seems out of place, please leave a comment so I can fix it. If you think a different mod would be better for MGT, post some screenshots so I can check it out. If I agree with you, I will updated MGT accordingly. \r<br />\r<br />[u][b]Other Thoughts[/b][/u]\r<br />A lot of effort was made to try and include the best visual mods possible, while conflicting with other mods and impacting performance as little as possible. The great thing about texture mods is that, so long as you have enough video memory, it will impact your fps very little. It gives you a great &#34;bang for buck&#34; for graphics. If you are using MGT and you are having performance issues, I recommend lowering your view distance, lowering your gaming resolution, and/or reinstalling MGT with lower resolution versions of the included mods. As a last resort, you can use a tool like DDSopt to optimize the textures. Resizing all textures to 1024x1024 will improve performance dramatically for some users, at the cost of a significant loss in graphics fidelity. \r<br />\r<br />There are only a few plugins included in this mod, and none of them have any scripts. The plugin included for Radiant and Unique Potions can have minor conflicts with some overhaul mods. One of the mods included in SMIM require dragonborn, so you would definitely want to disable that if you don&#39;t have dragon born. All of the plugins included in this mod can be disabled without a much of any loss in quality or content. \r<br />\r<br />The plugins for aMidianBorn Book of Silence - Weapons and Armors have been intentionally excluded, as they aren&#39;t much needed. If you would like them in your game, reinstall those mods after you have complete MGT and overwrite MGT where any conflicts exist. \r<br />\r<br />[u][b]More Cool Mods[/b][/u]\r<br />All of these mods go great with MGT\r<br />\r<br />I highly recommend the [url= http://www.nexusmods.com/skyrim/mods/11/?]STEP guide[/url]\r<br />Unofficial Patches - Everybody should use this\r<br />-&gt;[url=http://www.nexusmods.com/skyrim/mods/23491/?]Skyrim[/url]\r<br />-&gt;[url=http://www.nexusmods.com/skyrim/mods/31083/?]dragonborn[/url]\r<br />-&gt;[url=http://www.nexusmods.com/skyrim/mods/25127/?]hearthfire[/url]\r<br />-&gt;[url=http://www.nexusmods.com/skyrim/mods/23491/?]dawngaurd[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/41076/?]Realistic Water 2[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/141/?]Vurts Skyrim Flora Overhaul[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/12866/?]Distant Detail[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/40564/?]Skyfalls and Mills[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/4929/?]A quality world map with roads[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/3863/?]Sky UI.[/url]",
  "categoryId": "62",
  "version": "1.0",
  "author": "mothergoose729",
  "createdUnix": "1388542535",
  "updatedUnix": "1388538715",
  "containsAdultContent": false,
  "uploadedBy": "mothergoose729",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089264",
      "name": "MGT Source Files V1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "MGT Source Files V1_0-49352-1-0.7z",
      "uploadedUnix": "1388538715",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/786b329bc62d0594e2752d280b1203968d191a6496b8ab571354725860a71a11/analysis/1407866897/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MGT%20Source%20Files%20V1_0-49352-1-0.7z?fid=1000089264&ttl=1535830158&ri=8192&rs=8192&setec=2ecd9b458db31952bad64edc689d978b"
    }
  ]
}