{
  "modId": 4935.0,
  "modName": "Categorized Favorites Menu - ITALIANO",
  "summary": "Il menu dei preferiti è stato diviso in più colonne, suddivise per categoria (armi, pozioni, magie ecc...). La selezione è più veloce e ampia. Diversi stili di menu disponibili per venire incontro al vostro stile di gioco. Italian translation of the original mod by favmenumodder.",
  "descriptionHtml": "[center][size=20]Categorized Favorites Menu[/size][/center]\r\n[center][size=20][b][color=green]IN IT[/color][color=white]ALI[/color][color=red]ANO[/color][/size][/center][/b]\r\n\r\n\r\nCiao a tutti, questo è il mio primo piccolo contributo alla comunità di Skyrim Nexus: spero che vi piaccia!\r\nHi all, this is my first little contribute to the Nexus community. I hope you enjoy!\r\n\r\n[size=14]GENERAL NOTES AND PERMISSIONS[/size]\r\nThis mod is just a translation and an adaptation to italian language I made for the \\\"Categorized Favorites Menu\\\" mod by [url=http://www.skyrimnexus.com/modules/members/index.php?id=3562925]FavMenuModder[/url]. All the glory for the code goes to him :)\r\nI\\'m publishing these files with the written permission of the author.\r\nThis is the link of the original english version by favmenumodder:\r\n[url=http://www.skyrimnexus.com/downloads/file.php?id=4862]http://www.skyrimnexus.com/downloads/file.php?id=4862[/url]\r\nFor the version number, I\\'ll use the same base version of the original mod (like 0.1.4): this indicates the version of the swf file (the code by favmenumodder); I\\'ll add the IT tag and the number of my cfg revision for that base version.\r\n[center]--------------------------------------------------------------------------------------------------------------------------------------[/center]\r\n\r\n\r\n[size=14]COSA C\\'È DI NUOVO?[/size]\r\n[b]01/04/2012 - Nuova versione 0.1.14.IT1[/b] compatibile con Skyrim 1.5.26 e SKSE 1.4.15\r\n\r\n[b]01/02/2012 - Nuovo package di installazione![/b] Se installate tramite [url=http://tes.nexusmods.com/content/modmanager]Nexus Mod Manager[/url], un menu di installazione vi guiderà per aiutarvi a scegliere lo stile del menu che preferite! Semplicissimo e veloce!\r\nHo preparato 3 nuove versioni di menu, in aggiunta a quello standard. Tutti questi menu opzionali sono a 5 colonne invece che a 4. A meno che preferiate lo stile a 4 colonne del menu predefinito, che non occupa tutto lo schermo, o che non utilizziate una risoluzione video molto bassa, i nuovi menu sono senz\\'altro da preferire rispetto al classico. Scegliete quello che più si adatta al vostro stile di gioco:\r\n[list][*]Menu con Magie estese: 5 liste dedicate alle 5 diverse scuole di magia; mantenenute e ampliate leggermente le altre liste; ridotta a sole tre righe la lista \\\"Altro\\\".\r\n[*]Menu con Inventario esteso: le liste \\\"Vestiario\\\" e \\\"Pozioni\\\" si estendono in basso e possono visualizzare fino a 22 elementi contemporaneamente; invariate le altre liste.\r\n[*]Menu con Equip Sets: introduce la funzionalità per creare combinazioni di inventario personalizzate da richiamare rapidamente (vedi \\\"Come utilizzare gli Equip Sets\\\" più avanti); Lista pozioni amlpiata a 22 elementi; invariate le altre liste.[/list]\r\n\r\n\r\n[size=14]PRESENTAZIONE[/size]\r\nGrazie a Categorized Favorites Menu di favmenumodder, il menu rapido dei preferiti risulta notevolmente ampliato e suddiviso in diverse categorie: invece di avere tutti gli oggetti preferiti dell\\'inventario in una sola colonna, è possibile configurare colonne multiple. Questo consente da un lato una selezione molto più veloce di armi, pozioni, magie e quant\\'altro, mentre da la possibilità di aumentare il numero di oggetti nella lista dei preferiti mantenendo il menu ordinato. Guardate le immagini postate per avere un\\'idea. Categorized Favorites Menu migliorerà la qualità del vostro gioco!\r\n\r\nOra vi dirò brevemente come funziona questo mod, così potrete capire alcune delle sue limitazioni, ma anche, se vorrete, imparere a personalizzarlo. Il mod legge i NOMI degli oggetti preferiti e li smista all\\'interno delle varie colonne utilizzando dei FILTRI DI TESTO. Mi sono soffermato su queste due parole per farvi capire che il mod stesso non ha alcun accesso ai tipi di oggetti che sono nella lista dei preferiti: per esempio può leggere \\\"Pozione di cura\\\", tuttavia non ha alcuna informazione per stabilire che l\\'oggetto è in effetti una pozione. L\\'oggetto però comparirà nel menu delle pozioni perché tale lista è programmata per intercettare gli oggetti che contengono la parola \\\"pozione\\\" (la parola deve essere intera ma non c\\'è distinzione tra lettere maiuscole e minuscole). Vi è anche un\\'altra cosa da comprendere: come l\\'ordine delle liste influenzi l\\'output finale. Per capirlo facciamo di nuovo l\\'esempio della \\\"Pozione di cura\\\": questo oggetto contiene anche la parola \\\"cura\\\" che invece è programmata per essere intercettata dalla lista degli incantesimi. Dunque se la lista delle magie si trovasse prima della lista delle pozioni, l\\'oggetto \\\"Pozione di cura\\\" sarebbe visualizzato assieme alle magie. Fortunatamente, a partire dalla versione 0.1.5, c\\'è anche la possibilità di stabilire un elenco di esclusioni per ciascuna lista: questo consente di programmare le liste con grande cura. Ulteriori migliorie sono state portate dalla versione 0.1.7 nella quale c\\'è la possibilità di impostare la ricerca di una parola che deve combaciare perfettamente con il nome dell\\'oggetto (ad es. in modo che \\\"Furia\\\" e non intercetti anche \\\"Furia Elementale\\\"), nonché è adesso possibile definire un ordine con il quale le liste vengono visualizzate che sia indipendente dall\\'ordine nel quale le liste vengono compilate.\r\n\r\nSe avete capito il funzionamento del mod, allora comprendete come esso debba essere attentamente configurato per funzionare al meglio con ogni lingua. Ho trovato subito molto utile questo mod, quindi ho deciso di tradurlo, adattarlo e renderlo disponibile a tutti i giocatori italiani.\r\n\r\nTroverete diversi menu, già configurati nel migliore dei modi: \r\n[list][*][b][color=#3490d7]Rapidi[/b][/color] contiene tutti gli elementi ai quali è stato associato un tasto di scelta rapida (1-8). Gli oggetti che compaiono nella lista dei rapidi, non compaiono nelle altre liste;\r\n[*][b][color=#3490d7]Armi/Pergamene[/b][/color] insomma tutto ciò che può essere maneggiato, compresi gli scudi;\r\n[*][b][color=#3490d7]Vestiario[/b][/color] comprende tutto ciò che può essere indossato, comprese le maschere. La lista è divisa in varie sottoliste per ciascuna parte del corpo, in modo da rendere evidente che per ogni raggruppamento si può scegliere un solo indumento;\r\n[*][b][color=#3490d7]Pozioni[/b][/color]. Sono raggruppate nel seguente modo: pozioni che ripristinano o incrementano la rigenerazione della magicka, della salute, del vigore, i veleni e altro (tutte le altre pozioni);\r\n[*][b][color=#3490d7]Urli/Poteri[/b][/color];\r\n[*][b][color=#3490d7]Magie DIS/EVO[/b][/color] comprende le magie delle scuole di distruzione e di evocazione; scaricate il menu opzionale \\\"Magie Estese\\\" se preferite avere 5 liste dedicate a ciascuna scuola di magia;\r\n[*][b][color=#3490d7]Magie ALT/ILL/REC[/b][/color] comprende le magie delle scuole di alterazione, illusione e recupero; scaricate il menu opzionale \\\"Magie Estese\\\" se preferite avere 5 liste dedicate a ciascuna scuola di magia;\r\n[*][b][color=#3490d7]Altro[/b][/color] contiene tutti gli elementi che non compaiono nelle precedenti liste.\r\n[*][b][color=#3490d7]Combinazioni[/b][/color] è disponibile solo scegliendo il menu opzionale \\\"Equip Sets\\\". Si tratta di una lista interattiva dove l\\'utente può creare combinazioni rapide di inventario da richiamare ed equipaggiare con un solo click; vedi \\\"Come usare gli Equip Sets\\\" più avanti;\r\n[/list]\r\n\r\nMa la cosa non finisce qui perché il mod è sempre in aggiornamento grazie anche al vostro aiuto, ai vostri consigli e richieste. In particolare con la versione 0.1.6.IT01 è stato fatto un grosso lavoro di catalogazione e sono stati aggiunti alle liste un gran numero di oggetti leggendari unici e ricompense di missioni (armi, armature, amuleti ecc) che altrimenti sarebbero stati messi in \\\"Altro\\\". Dovrebbero essere tutti e ringrazio molto 7400 per il suo inestimabile aiuto con la lista.\r\nSu vostra richiesta, sono stati anche aggiunti molti nomi (generici) per armi e vestiario in lingua ilnglese, in modo da assicurare una certa compatibilità con i mod non tradotti, tuttavia alcuni mod potrebbero richiedere un maggiore lavoro di adattamento. Questo può essere fatto per i mod più popolari e con il vostro aiuto.\r\nCon la versione 0.1.7.IT01 ho aggiunto alla release un file esp che va finalmente a risolvere il problema del potere \\\"Anello di Hircine\\\" che avendo lo stesso nome dell\\'anello \\\"Anello di Hircine\\\" non poteva essere categorizzato correttamente. Per questo file dobbiamo ancora una volta ringraziare l\\'ottimo 7400 che si è preso la briga di realizzarlo. Questo file, quando è attivo, va a modificare il nome nella versione italiana del suddetto potere in \\\"Potere di Hircine\\\", rendendolo quindi univoco. Grazie, grazie, grazie!\r\n\r\nConsigli: \r\n[list][*]Quando incantate un\\'arma o un oggetto personalizzato, è consigliabile mantenere nel nome la parola \\\"spada\\\", oppure \\\"arco\\\", \\\"corazza\\\" e così via di modo che l\\'oggetto risulti poi nella giusta categoria; diversamente esso sarà messo in \\\"Altro\\\".\r\n[*]Meglio non aggiungere oggetti di vestiario all\\'inventario rapido (tasti 1-8) poiché essi sono più facilmente individuabili e selezionabili tramite la lista \\\"Vestiario\\\" e le sue sottoliste. Gli scudi NON fanno parte del vestiario in questa mod.\r\n[/list]\r\nCome utilizzare gli Equip Sets:\r\nLe configurazioni salvate vengono memorizzate nel file Data\\\\Interface\\\\favoritesmenu_equipsets.cfg. Questo file è presente nella release come \\\"opzionale\\\" e non viene installato a meno che non siate voi a sceglierlo, per evitare di sovrascrivere le impostazioni personali dell\\'utente a seguito di un futuro aggiornamento. La prima volta che utilizzate gli equip sets però, è necessario installarlo per creare un file cfg di base con codifica compatibile con la lingua italiana: se utilizzate Nexus Mod Manager, seguite la procedura guidata e alla domanda \\\"Creo nuovo file Equip Sets?\\\" rispondete \\\"Sì\\\"; per l\\'installazione manuale, trovate il file e le istruzioni nella cartella \\\"Optionals\\\" del pacchetto di installazione. L\\'integrazione del menu dei preferiti con il suddetto file è realizzata tramite [url=http://skse.silverlock.org]Skyrim Script Extender (SKSE)[/url], che dovete scaricare e installare. Senza SKSE, gli Equip Sets funzionano ma dovrete apportare manualmente tutte le modifiche al file di configurazione.\r\nPer creare una nuova combinazione, premere Alt+F, quindi immettere un nome per la combinazione; la casella \\\"equipment list\\\" non fa altro che notificare tutti gli oggetti che verranno inclusi nella combinazione, cioè tutti gli oggetti correntemente equipaggiati; se volete potete scegliere un hotkey (da 0 a 9); c\\'è anche la possibilità di scegliere se disequipaggiare alcuni oggetti, diversamenti gli oggetti equipaggiati che non sono in conflitto con quelli presenti nella combinazione saranno mantenuti. Facciamo click su \\\"Create\\\" per concludere.\r\nIn linea di massima quindi, prima di creare un nuovo equipset, conviene sempre rimuovere tutto l\\'equipaggiamento ed equipaggiare solo gli oggetti che vogliamo includere nella combinazione, altrimenti rischiamo di coinvolgere anche altre cose senza volerlo.\r\nAppena creata la combinazione il tasto di scelta rapida non funzionerà subito: chiudere il menu e poi riaprirlo. Ad ogni modo è bene ricordare che i tasti di scelta rapida per gli equipsets funzionano solo dopo aver aperto il menu dei preferiti, non direttamente dal gioco!\r\nPer rimuovere un equipsets, bisogna passarci sopra col mouse e premere Alt+Canc.\r\nPer richiamare un equipsets, aprire il menu dei preferiti, quindi fare click su di esso oppure usare Alt+(0-9).\r\nPer alcune cose sarà ancora necessario editare il file favoritesmenu_equipsets.cfg manualmente tramite notepad: ad esempio se volete effettuare modifiche ad un equipset salvato senza doverlo cancellare e ricrearlo, oppure se si vuole inserire una pozione da bere appena selezionata la combinazione.\r\nPerché un equip set salvato funzioni a dovere, tutti gli oggetti coinvolti devono essere marcati come preferiti nell\\'inventario.\r\n\r\n[size=14]REQUISITI E COMPATIBILITA\\'[/size]\r\nPersonalmente testato con la versione 1.3.10 di Skyrim e non ha dato problemi di alcun genere. \r\nSi consiglia di utilizzare una risoluzione video di almeno 1024x768. Per i menu opzionali a 5 colonne si consiglia l\\'utilizzo di monitor \\\"wide\\\" con risoluzione di almeno 1280x720.\r\n[url=http://skse.silverlock.org]Skyrim Script Extender (SKSE)[/url] richiesto per il corretto funzionamento del menu opzionale con Equip Sets.\r\nPotrebbe avere delle incompatibilità con mod che modificano i caratteri o l\\'interfaccia di gioco.\r\nCompatibile con [url=http://www.skyrimnexus.com/downloads/file.php?id=3863]SkyUI[/url].\r\nPer una lista completa e più aggiornata delle compatibilità, rimando alla pagina originale:\r\n[url=http://www.skyrimnexus.com/downloads/file.php?id=4862]http://www.skyrimnexus.com/downloads/file.php?id=4862[/url]\r\n\r\n[size=14]COSA CONTIENE[/size]\r\nIl mod si compone dei seguenti files:\r\n[list][*]favoritesmenu.swf -> è il file del codice sorgente creato da favmenumodder\r\n[*]favoritesmenu.cfg -> è il file di configurazione adattato da me per la lingua italiana\r\n[/list]Questi due file vanno messi nella sottocartella Data\\\\Interface\\\\ di Skyrim\r\n[list][*]CatFavMenu_ITA_HircineFIX.esp -> è un file che modifica il nome del potere \\\"Anello di Hircine\\\" in \\\"Potere di Hircine\\\" per distinguerlo dall\\'anello \\\"Anello di Hircine\\\" e per fare in modo che esso compaia nella giusta lista. Grazie a 7400, autore del file. Questo file deve stare nella sottocartella Data di Skyrim.\r\n[*]CFM_extensions.dll -> plugin creato dall\\'autore originale favmenumodder per il funzionamento delle equiplists collegato con Skyrim Script Extender (SKSE)\r\nQuesto file va nella sottocartella Data\\\\SKSE\\\\Plugins\\\\ di Skyrim.\r\n[*]CFM_config_guide.html -> guida completa per la personalizzazione scritta dall\\'autore FavMenuModder (in inglese)[/list]\r\n\r\n[size=14]INSTALLAZIONE[/size]\r\nÈ possibile installare sia tramite [url=http://tes.nexusmods.com/content/modmanager]Nexus Mod Manager[/url] che manualmente. L\\'installazione tramite Mod Manager è ora consigliata perché ho impostato una procedura guidata grazie alla quale potrete scegliere lo stile del menu che preferite, in modo semplice e veloce. Ad ogni modo l\\'installazione manuale è sempre disponibile.\r\n\r\nINSTALLAZIONE MANUALE:\r\nCome al solito, estraete la cartella \\\"Data\\\" e tutto il suo contenuto nella cartella principale di Skyrim, tipicamente:\r\nC:\\\\programmi\\\\steam\\\\steamapps\\\\common\\\\skyrim\r\nLa prima volta che avviate il gioco, fate click su \\\"File di dati\\\" dal menu di lancio di Skyrim e assicuratevi che \\\"CatFavMenu_ITA_HircineFIX.esp\\\" sia selezionato.\r\nTutto qui.\r\nSe volete provare i menu alternativi, li trovate nella cartella \\\"Optionals\\\" del pacchetto di installazione: seguite le istruzioni che trovate all\\'interno delle rispettive cartelle.\r\nSe intendete utilizzare una versione di cfg che abilita gli equipsets (disponibile come download opzionale), dovete scaricare e utilizzare Skyrim Script Extender (SKSE) dal sito [url=http://skse.silverlock.org]http://skse.silverlock.org[/url]\r\n\r\n[size=14]AGGIORNAMENTO DA UNA VERSIONE PRECEDENTE[/size]\r\nCome al solito, estraete la cartella \\\"Data\\\" e tutto il suo contenuto nella cartella principale di Skyrim, tipicamente:\r\nC:\\\\programmi\\\\steam\\\\steamapps\\\\common\\\\skyrim\r\nSovrascrivi tutto.\r\nAttenzione! Se avete effettuato delle personalizzazioni al file cfg, esse saranno perse con la sovrascrittura! In tal caso fate una copia di riserva del file cfg prima di procedere e poi eventualmente recuperate le personalizzazioni copiandole all\\'interno del nuovo cfg.\r\nIl file di configurazione degli equip sets non sarà sovrascritto.\r\nPer gli utenti di Nexus Mod Manager: la disattivazione del mod causerà la perdita del file di configurazione degli equip sets.\r\n\r\n[size=14]DISINSTALLAZIONE[/size]\r\nRimuovere i seguenti file dalla cartella principale di skyrim\r\n[list][*]Data\\\\Interface\\\\favoritesmenu.swf\r\n[*]Data\\\\Interface\\\\favoritesmenu.cfg\r\n[*]Data\\\\Interface\\\\CFM_config_guide.html\r\n[*]Data\\\\Interface\\\\favoritesmenu_equipsets.cfg\r\n[*]Data\\\\Interface\\\\favoritesmenu_overrides.cfg\r\n[*]Data\\\\CatFavMenu_ITA_HircineFIX.esp\r\n[*]Data\\\\SKSE\\\\Plugins\\\\CFM_extensions.dll\r\n[/list]\r\n[size=14]PERSONALIZZAZIONE[/size]\r\nIl file cfg può essere aperto con notepad e modificato secondo le proprie esigenze; nella stessa cartella troverete una guida dettagliata in html scritta dall\\'autore FavMenuModder.\r\n\r\n[size=14]REDISTRIBUZIONE[/size]\r\nIn accordo con l\\'autore:\r\n[list][*]Versioni modificate del file cfg possono essere distribuite liberamente;\r\n[*]Per la redistribuzione del file di codice swf o altre parti del programma principale, contattate direttamente l\\'autore FavMenuModder;\r\n[*]Se volete ridistribuire il mio cfg, anche su altri siti, o includerlo in una vostra distribuzione o raccolta, per favore chiedetemelo prima.[/list]\r\n\r\n[size=14]PROBLEMI NOTI[/size]\r\n[list][*]Alcuni utenti hanno riferito di problemi con la selezione di armi e magie con i pulsanti destro e sinistro del mouse e la relativa assegnazione alla mano desiderata; sul sito del mod originale è on line una patch che POTREBBE risolvere il problema. Per maggiorni informazioni e per scaricare la patch, [url=http://www.skyrimnexus.com/downloads/file.php?id=4862]fare click qui.[/url]\r\n[/list]\r\nSe riscontrate associazioni errate o omissioni fatemi sapere e vedrò cosa posso fare.\r\n\r\n[size=14]NOTE DI VERSIONE[/size]\r\n\r\n0.1.14.IT1 (01/04/2012)\r\n[list][*]Ora basato sulla nuova versione di Categorized Favorites Menu v.0.1.14 (compatibile con Skyrim 1.5.26 e SKSE 1.4.15)[/list]\r\n------------------------\r\n0.1.13.IT1 (30/03/2012)\r\n[list][*]Ora basato sulla nuova versione di Categorized Favorites Menu v.0.1.13 (compatibile con Skyrim 1.5.24 e SKSE 1.4.14)[/list]\r\n------------------------\r\n0.1.12.IT1 (06/03/2012)\r\n[list][*]Ora basato sulla nuova versione di Categorized Favorites Menu v.0.1.12 (compatibile con Skyrim 1.4.27 e SKSE 1.4.13)[/list]\r\n------------------------\r\n0.1.11.IT1 (04/02/2012)\r\n[list][*]Ora basato sulla nuova versione di Categorized Favorites Menu v.0.1.11.2 (compatibile con Skyrim 1.4.21 e SKSE 1.4.10)[/list]\r\n------------------------\r\n0.1.8.IT01 (24/01/2012)\r\n[list][*]Ora basato sulla nuova versione di Categorized Favorites Menu v.0.1.8.2\r\n[*]Disponibili come download opzionali le configurazioni a 5 colonne: \\\"Magie Estese\\\", \\\"Inventario Esteso\\\", \\\"Equip Sets\\\"\r\n[*]Fixed: \\\"Pozione di resistenza al veleno\\\" compariva nella sottolista dei veleni[/list]\r\n------------------------\r\n0.1.7.IT02 (22/01/2012)\r\n[list][*]In \\\"Vestiario\\\" rinominate le sottoliste \\\"Corpo\\\" e \\\"Gambe\\\" in \\\"Tronco\\\" e \\\"Piedi\\\"\r\n[*]\\\"Pantaloni logori\\\" spostati nella sottolista \\\"Tronco\\\" in \\\"Vestiario\\\"\r\n[*]Fixed: \\\"Skooma\\\" e \\\"il legame del matrimonio\\\" comparivano in \\\"Altro\\\" per errore di battitura[/list]\r\n------------------------\r\n0.1.7.IT01 (10/01/2012)\r\n[list][*]Ora basato sulla nuova versione di Categorized Favorites Menu v.0.1.7\r\n[*]Modificato nel gioco il nome del potere \\\"Anello di Hircine\\\" in \\\"Potere di Hircine\\\" (grazie al file CatFavMenu_ITA_HircineFix.esp creato da 7400)\r\n[*]Aggiunto \\\"Potere di Hircine\\\" alla lista \\\"Urli/Poteri\\\"\r\n[*]Fixed: gli anelli \\\"Anello di Hircine\\\" e \\\"Anello di Hircine maledetto\\\" sono adesso elencati in \\\"Vestiario\\\"\r\n[*]Adesso ciascuna lista può visualizzare contemporaneamente un oggetto in più (10 invece di 9)\r\n[*]Lo sfondo del menu adesso è leggermente più opaco per facilitare la lettura (115/255)[/list]\r\n------------------------\r\n0.1.6.IT02 (07/01/2012)\r\n[list][*]Aggiunti raggruppamenti per le liste \\\"Pozioni\\\" e \\\"Vestiario\\\"\r\n[*]Aggiunte e categorizzate le parole inglesi principali per le categorie \\\"Armi\\\" e \\\"Vestiario\\\" in modo da guadagnare compatibilità verso eventuali mod che aggiungono armi o vestiario in lingua inglese non tradotti (Parole aggiunte: shield, sword, greatsword, mace, hammer, warhammer, axe, battleaxe, dagger, bow, arrows, blade, staff, scroll, armor, cuirass, shoes, boots, bracers, gauntlets, helmet, robes, ring, necklace, circlet, clothes, tunic, apron, garment, hat, hood, cap, gloves, amulet, mask)\r\n[*]Aggiunta la parola \\\"Armatura\\\" alla lista \\\"Vestiario\\\" per dare la possibilità di usare questa parola quando si rinominano corazze incantate\r\n[*]Aggiunta \\\"Skooma\\\" alla lista delle pozioni\r\n[*]Fixed: \\\"Frammento dell\\'amuleto di Gauldur\\\" compariva in \\\"Altro\\\"[/list]\r\n------------------------\r\n0.1.6.IT01 (03/01/2012)\r\n[list][*]Ora basato sulla nuova versione di Categorized Favorites Menu v.0.1.6\r\n[*]Aggiunti alle categorie un gran numero (spero tutti) di oggetti unici leggendari e ricompense di missioni (armi, corazze, amuleti ecc.)\r\n[*]Il potere \\\"Anello di Hircine\\\" e gli anelli \\\"Anello di Hircine\\\" e \\\"Anello di Hircine maledetto\\\" sono stati spostati in \\\"Altro\\\", in attesa del creation kit e della possibilità di creare una patch per essi\r\n[*]Fixed: gli incantesimi \\\"Respingi non-morto\\\", \\\"Respingi non-morto minore\\\" e \\\"Sventura del non-morto\\\" erano elencati in \\\"Altro\\\" per errore di battitura\r\n[*]Fixed: la maschera \\\"Nahkriin\\\" era elencata in \\\"Altro\\\" per errore di battitura\r\n[*]Fixed: \\\"Copricapo dei rinnegati\\\" era elencato in \\\"Altro\\\"[/list]\r\n------------------------\r\n0.1.5.IT02 (01/01/2012)\r\n[list][*]Fixed: corretto un problema della release precedente per il quale le pergamene di evocazione comparivano in \\\"Altro\\\"[/list]\r\n------------------------\r\n0.1.5.IT01 (01/01/2012)\r\n[list][*]Ora basato sulla nuova versione di Categorized Favorites Menu v.0.1.5\r\n[*]Fixed: adesso gli incantesimi \\\"Ascia da guerra evocata\\\", \\\"Evoca spada\\\" e \\\"Evoca arco\\\" compaiono correttamente nella lista delle magie di evocazione anziché in quella delle armi\r\n[*]Cambiato l\\'ordine delle liste[/list]\r\n-------------------------\r\n0.1.4.IT02 (31/12/2011)\r\n[list][*]Aggiunta compatibilità con Nexus Mod Manager\r\n[*]Adesso lo sfondo del menu è leggermente più opaco per facilitare la lettura (110/255)[/list]\r\n-------------------------\r\n0.1.4.IT01 (30/12/2011)\r\n[list][*]Prima versione italiana, basata su Categorized Favorites Menu v.0.1.4[/list]\r\n-------------------------\r\n\r\nPer visionare le note di versione del programma originale[url=http://www.skyrimnexus.com/downloads/file.php?id=4862] fare click qui[/url].\r\n\r\n\r\n[size=14]CREDITI[/size]\r\nGrazie a [url=http://www.skyrimnexus.com/modules/members/index.php?id=3562925]FavMenuModder[/url] per aver realizzato il mod originale\r\nGrazie a [url=http://www.skyrimnexus.com/modules/members/index.php?id=3535369]7400[/url] per il file \\\"CatFavMenu_ITA_HircineFIX.esp\\\" e per il suo prezioso aiuto con la lista degli oggetti unici/ricompense di missioni\r\n\r\n[size=12][color=yellow]Non dimenticate di approvare!\r\n(Endorse :P)[/size][/color]",
  "categoryId": "42",
  "version": "0.1.14.IT1",
  "author": "MrY81",
  "createdUnix": "1325277966",
  "updatedUnix": "1333312648",
  "containsAdultContent": false,
  "uploadedBy": "mry81",
  "primaryFile": null,
  "files": [
    {
      "fileId": "22156",
      "name": "Categorized_Favorites_Menu_ITA_OLD_0_1_7",
      "version": "0.1.7.IT02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "75",
      "fileName": "Categorized_Favorites_Menu_ITA_OLD_0_1_7-4935.zip",
      "uploadedUnix": "1327260211",
      "modVersion": "0.1.7.IT02",
      "virusScanUrl": "https://www.virustotal.com/file/c33456da2c07458a53973db664a79a89b966acc869cf971535276f0eff5520b7/analysis/1406631370/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Categorized_Favorites_Menu_ITA_OLD_0_1_7-4935.zip?fid=22156&ttl=1535761281&ri=8192&rs=8192&setec=5dd31b4867ceb8f6fe88d740b4b95855"
    },
    {
      "fileId": "24969",
      "name": "Categorized_Favorites_Menu_ITA_OLD_0_1_8",
      "version": "0.1.8.IT01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2525",
      "fileName": "Categorized_Favorites_Menu_ITA_OLD_0_1_8-4935.zip",
      "uploadedUnix": "1328110769",
      "modVersion": "0.1.8.IT01",
      "virusScanUrl": "https://www.virustotal.com/file/e462694cdb95350b6b6406b41a989a47ba9c8fa67d25bea302d1c1a8c662a1d2/analysis/1406648480/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Categorized_Favorites_Menu_ITA_OLD_0_1_8-4935.zip?fid=24969&ttl=1535761282&ri=8192&rs=8192&setec=0fa0e9f84fbe13ffb75dcec8c165cc61"
    },
    {
      "fileId": "25649",
      "name": "Categorized_Favorites_Menu_ITA_OLD_0_1_11",
      "version": "0.1.11.IT1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2520",
      "fileName": "Categorized_Favorites_Menu_ITA_OLD_0_1_11-4935.zip",
      "uploadedUnix": "1328311855",
      "modVersion": "0.1.11.IT1",
      "virusScanUrl": "https://www.virustotal.com/file/8e9eb5aa2bc0192cbb4a6acdbd992fbd8a047201b2c3dc74b762cc52110b9321/analysis/1406652311/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Categorized_Favorites_Menu_ITA_OLD_0_1_11-4935.zip?fid=25649&ttl=1535761282&ri=8192&rs=8192&setec=2eb2e1a1646e3ed49fbf06db17cbde5b"
    },
    {
      "fileId": "40824",
      "name": "Categorized_Favorites_Menu_ITA_OLD_0_1_12",
      "version": "0.1.12.IT1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2531",
      "fileName": "Categorized_Favorites_Menu_ITA_OLD_0_1_12-4935.zip",
      "uploadedUnix": "1331062273",
      "modVersion": "0.1.12.IT1",
      "virusScanUrl": "https://www.virustotal.com/file/a0f99ed5b4075dd21970c19a1f569b30530f6b7b20d0733b3587032a45ac8ee3/analysis/1406735054/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Categorized_Favorites_Menu_ITA_OLD_0_1_12-4935.zip?fid=40824&ttl=1535761283&ri=8192&rs=8192&setec=2599957f3ad259e9618054a4a3ec18e8"
    },
    {
      "fileId": "48310",
      "name": "Categorized_Favorites_Menu_ITA_OLD_0_1_13",
      "version": "0.1.13.IT1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2524",
      "fileName": "Categorized_Favorites_Menu_ITA_OLD_0_1_13-4935.rar",
      "uploadedUnix": "1333141764",
      "modVersion": "0.1.13.IT1",
      "virusScanUrl": "https://www.virustotal.com/file/8923554ee380d49fb994bf7050e077e7e14514a1d33049cae88d2377acc048fb/analysis/1406788041/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Categorized_Favorites_Menu_ITA_OLD_0_1_13-4935.rar?fid=48310&ttl=1535761284&ri=8192&rs=8192&setec=2c24e712b9bdaf923936777633bc3a08"
    },
    {
      "fileId": "49054",
      "name": "Categorized_Favorites_Menu_ITA",
      "version": "0.1.14.IT1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2520",
      "fileName": "Categorized_Favorites_Menu_ITA-4935.zip",
      "uploadedUnix": "1333312648",
      "modVersion": "0.1.14.IT1",
      "virusScanUrl": "https://www.virustotal.com/file/0031a752eb5a30c2d94755417e65af831e3caa289ca0a18da45dfca1667f9517/analysis/1406792001/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Categorized_Favorites_Menu_ITA-4935.zip?fid=49054&ttl=1535761284&ri=8192&rs=8192&setec=25616f524aee15ee2d173649590f7372"
    }
  ]
}