{
  "modId": 49368.0,
  "modName": "Bone Weight Copy Tool",
  "summary": "This is a stand-alone tool designed to automate weight-paint copying.\r<br /> \r<br />The tool automates tasks as simple as copying a single bone, to completely rigging a raw mesh, including generating a scene root, generating NiSkinInstance/BSDismemberSkinInstance for each trishape as needed, adding bones, and all needed weightpainting.",
  "descriptionHtml": "[size=5][color=#b22222]Bone Weight Copy Tool[/color][/size]\r<br /> \r<br />This is a stand-alone tool designed to automate weight-paint copying for [color=#daa520]Skyrim[/color], [color=#daa520]Fallout[/color] and [color=#daa520]Oblivion[/color] meshes.\r<br /> \r<br />The tool automates everything from tasks as simple as copying a single bone, to a task as complex as rigging a raw mesh, including generating a scene root, generating NiSkinInstance or BSDismemberSkinInstance for each trishape as needed, copying or generating the appropriate skin/dismember partitions, adding bones to the nif, and finally copying all needed weightpainting.\r<br /> \r<br />This can be done to a single nif, multiple nifs, or even an entire directory structure at once.\r<br /> \r<br />You can now add one or more bones to an entire clothing collection with a couple of quick clicks.\r<br /> \r<br />And rigging a raw mesh is a simple as running the tool.\r<br /> \r<br />[color=#b22222]Core Functions[/color]\r<br /> \r<br />1. Copy scene.root, bones, and weightpainting from a fully rigged mesh to an unrigged mesh\r<br />2. Selectively copy individual bones from a rigged mesh to any other mesh.\r<br /> \r<br />[color=#b22222]Features and Options:[/color]\r<br /> \r<br />[color=#b22222]File Menu:[/color]\r<br /> \r<br />[color=#40e0d0]Select Template[/color]: Choose the .nif file that you want to use as your bone weight template.\r<br />[color=#40e0d0]Target Mesh Options: [/color]\r<br />[color=#daa520]* Select Target Folder:[/color] Copy weights to all of the nifs found in the chosen Target folder\r<br />[color=#daa520]* Include subbolders:[/color] If checked, the tool will also process all of the nifs found in the subfolders of the source \r<br />[color=#daa520]* Process Selected Meshes Only[/color]: Opens a window that allows you to select 1 or more nifsin the same folder.  If selected, the Bone Weight Copy tool will only copy weights to those nifs.\r<br />[color=#40e0d0]Select Destination folder[/color]: Choose the folder where the nifs should be saved to.\r<br /> \r<br />Help Menu:\r<br /> \r<br />[color=#40e0d0]About:[/color] Does nothing.  Placeholder for in-line tutorials that will be added later\r<br /> \r<br />[color=#40e0d0]Vertex Targets:[/color] Set this value to higher numbers to get an averaged match for the weight painting, lower values to get more precise matches for the weight painting.  In general, 5 -10 is a good range for copying weights\r<br /> \r<br />[color=#40e0d0]Search Distance:[/color] How far should each vertex on the Target mesh search for a nearest neighbor.\r<br /> \r<br />[color=#40e0d0]Override Search Distance:[/color] Force each vertex to find at least one partner.  Recommended setting if you are rigging a raw mesh (unweighted verts are bad).\r<br /> \r<br />[color=#40e0d0]Select Bones To Copy:[/color] Copy only those bones that you selece\r<br /> \r<br />[color=#40e0d0]Delete Existing Weights:[/color] Before copying a given bone weight, delete the existing weightpainting for that bone.\r<br /> \r<br />[color=#40e0d0]Cancel[/color]: Close the tool and don&#39;t do anything (same as closing the window)\r<br />[color=#40e0d0]Load Defaults[/color]: Reset settings to factory default\r<br />[color=#40e0d0]OK[/color]: Accept the settings and begin processing meshes\r<br />\r<br />[color=#b22222]Installation:[/color]\r<br /> \r<br />1. Install Python 3.2.\r<br />2. Install Pyffi 3K\r<br />3. Extract the Boneweight Copy Tool to your preferred location in your computer.\r<br /> \r<br />To run the tool:\r<br />1. Double Click on copy_boneweights.py located in your Boneweight Copy Tool folder.\r<br /> \r<br />This should open the bone weight copy menu.\r<br /> \r<br />*If* the this does not happen, then your OS is probably trying to launch the tool using an older version of Python (2.x instead of 3.x).\r<br /> \r<br />To work-around this, download the optional launch_copy_boneweights.bat file.\r<br />Now, edit the file using a text editor.  \r<br /> \r<br />You should see:\r<br /> \r<br />C:PythonPython32python.exe C:nif_toyscopy_boneweights.py\r<br /> \r<br />Change &#39;C:PythonPython32&#39; to the path to your Python 3.2 install folder\r<br />Change &#39;C:nif_toys&#39; to the path to your boneweight copy install folder\r<br /> \r<br />Save the bat file and double click it to launch the boneweight copy tool\r<br /> \r<br />[color=#b22222]Requirements:[/color]\r<br />Python 3.2: [url=http://www.python.org/download/releases/3.2/]Python 3.2[/url] (other versions of Python 3 should work, however Pyffi prefers Python 3.2)\r<br />Pyffi for Python 3k: [url=http://sourceforge.net/projects/pyffi/files/pyffi-py3k/]Pyffi 3k[/url]\r<br /> \r<br />Note, this package can be installed in the same folder as the stand-alone seam mender.  However, because both projects are in beta, for the time being I recommend installing them to separate folders.\r<br /> \r<br />[color=#b22222]Change Log:[/color]\r<br /> \r<br />Beta 0.04 to 0.05\r<br />1. Skin partitions are now correctly copied from the Template mesh to the Target mesh\r<br />2. Dismember skin partitions are now correctly copied, assigned to the appropriate regions of the mesh, and assigned the correct body part codes.\r<br /> \r<br />Beta 0.01 to 0.04\r<br />1. Resolved error when using multi-file selection\r<br />2. Existing scene roots will no longer be overwritten when skinning a partially skinned nif\r<br />3. Target nifs that contain multiple meshes will now be processed properly \r<br />4. Template nifs that contain multiple meshes will now be processed properly and provide boneweight copying as if they were merged into a single nif\r<br />5. BSDismemberSkinInstance are now used if the template mesh included them\r<br />6. Nifs that contain corrupt skins should no longer cause the tool to crash\r<br />7. Source Mesh menu items have been renamed to Target Mesh\r<br />8. Delete Existing Bone Weights option had been inverted.  Enabling the button will not properly delete existing bone weights as they are copied from the template mesh.  Disabling the button will mean that any existing weights that are not overwritten will remain.\r<br /> \r<br />[color=#b22222]*****Current Known Bugs*****[/color]\r<br /> \r<br />1. The Nifskope spell, &#39;Update Partitions&#39; must be run after fter adding a dismember skin partition to a Skryim nif.\r<br />Status: Under development.",
  "categoryId": "39",
  "version": "Beta.05",
  "author": "kormgar",
  "createdUnix": "1388523682",
  "updatedUnix": "1388523682",
  "containsAdultContent": false,
  "uploadedBy": "kormgar",
  "primaryFile": null,
  "files": []
}