{
  "modId": 49381.0,
  "modName": "death Trap dungeon",
  "summary": "dwemer and falmer death trap dungeon mod needs quests and finished link to world entrance etc basically need help anyone :)",
  "descriptionHtml": "Hey guys I Have been making a mod for some time now and is nearly complete and still needs alot of work. And basically i need  help  completing quest lines and creating  unique followers and npcs.  Lighting and someone to look over my navamesh. All quests story and lore has been researched and written down and actors are here to do all story sentences.  All DLC is required \r<br />which is a dwemmer dungeon with a story behind it. Falmer have begun to venture close to the surface inside this ruin. And they have begun to make prisoners and slaves of any that may enter. They have let few survive to speak of their travels. They tell tales of an endless dwemer ruin filled with traps and slaves.  Although in all the chaos they also speak of riches beyond their wildest dreams.\r<br />The falmer Left twisted, driven mad, betrayed they have rigged this whole dwemmer dungeon to become a death trap dungeon. They have challenged all bandits and warriors to enter their ruin and face them for their treasure they have collected from souls who have entered over.  Over the years to this day no man has came out alive. In the dwemers absence the falmer have sought out every means of power from  daedric worship to vampirism  who know what unspeakable evil awaits those  who enter.\r<br />Please tell me what you think suggestions and questions\r<br />The ruin is 2 main areas and the rest is dwemer ruins leading to dead ends and your death\r<br />1 blackreach cavern\r<br />One altar one arena  and throne room\r<br />1 underground  temple\r<br />Jail Cells \r<br />1 dwemer dungeon\r<br />\r<br />The Falmer have also made new allies or maybe slaves\r<br />Reiklings \r<br />Hagravens\r<br />Daedra \r<br />Lurkers , seekers",
  "categoryId": "88",
  "version": "1.0",
  "author": "3nz0",
  "createdUnix": "1388554756",
  "updatedUnix": "1388554756",
  "containsAdultContent": true,
  "uploadedBy": "meenzo",
  "primaryFile": null,
  "files": []
}