{
  "modId": 49428.0,
  "modName": "Power Attacks Require Stamina",
  "summary": "Makes power attacks actually require more stamina than just 0 + ε. So, you can&#39;t spam power attacks and bashes after eating a bit of vegetable soup anymore.",
  "descriptionHtml": "[center][b][size=1][color=#FF0000]ATTENTION:[/color] While I reserve the right to delete off-topic comments and trolling from my threads, I WILL [u]NEVER[/u] BAN [u]ANY USER[/u] FROM ACCESSING [u]ANY[/u] OF MY FILES, NO MATTER WHAT THEY POST IN THE COMMENT THREAD. THERE ARE [u]NO[/u] EXCEPTIONS TO THIS RULE.[/size][/b][/center]\r<br />\r<br />[center][b][size=24]POWER ATTACKS REQUIRE STAMINA[/size][/b][/center]\r<br />\r<br />[b]What it does:[/b]\r<br />\r<br />This mod changes the requirements for power attacks (right, left, dual, and two-handed) and bashing (normal and power) so that it requires 30 stamina. 30 stamina seems to be the minimum stamina a power attack will consume, with a very light weapon and the Fighting/Champion&#39;s Stance perks, which is why that number was chosen. (If you disagree, please let me know in the comments and explain your reasoning - if you are correct I will update the mod.)\r<br />\r<br />[b][i]Note[/i][/b] that this mod [b][i]does not[/i][/b] change the amount of stamina such attacks [b][i]consume[/i][/b], only what they [b][i]require to initiate[/i][/b]. In vanilla, you can initiate power attacks as long as your stamina &gt; 0. So, you can have a bit of vegetable soup, or anything else that continuously restores your stamina, and spam power attacks and bashes with no cooldown. This mod raises that requirement to &gt; 30, so there will always be a cooldown.\r<br />\r<br />This makes items like restore stamina potions, various alcoholic beverages, etc., a lot more useful in combat now, where previously they were pretty much useless in the face of that ultimate of combat consumables, the mighty vegetable soup. It also makes raising your stamina quite a bit more worthwhile, whereas before the main reason to do that was to increase carry weight.\r<br />\r<br />[url=http://forums.bethsoft.com/topic/1482617-relz-power-attacks-require-stamina/]Thread on Bethesda forums[/url]\r<br />\r<br />[b]Installation:[/b]\r<br />\r<br />Place the contents of the archive in your Skyrim/Data directory. Works with Nexus Mod Manager.\r<br />\r<br />The mod can be uninstalled at any time.\r<br />\r<br />[b]Compatibility:[/b]\r<br />\r<br />I don&#39;t use any other combat mods, so I can&#39;t speak for them. You&#39;ll want to check for conflicts yourself in TES5Edit, before posting in the comments thread. This mod only changes four records, and it doesn&#39;t use any scripts, so the risk of conflict is low but not zero.\r<br />\r<br />[b]History:[/b]\r<br />\r<br />1.0 - Initial release.",
  "categoryId": "77",
  "version": "1.0",
  "author": "bluedanieru",
  "createdUnix": "1388635184",
  "updatedUnix": "1388634975",
  "containsAdultContent": false,
  "uploadedBy": "bluedanieru",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089458",
      "name": "Power Attacks Require Stamina",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Power Attacks Require Stamina-49428-1-0.zip",
      "uploadedUnix": "1388634975",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7a752b729d926e3cff7e221bf36f9015028e262eba673ab495d6c2610d0b38a2/analysis/1407868214/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Power%20Attacks%20Require%20Stamina-49428-1-0.zip?fid=1000089458&ttl=1535830286&ri=8192&rs=8192&setec=3a7485559a3573b182fee57a7f3f14b2"
    }
  ]
}