{
  "modId": 49432.0,
  "modName": "Aghemmor Nakh - Dwemer Archetecture in Aetherius",
  "summary": "This is something of a personal challenge and a proof-of-concept, all because of one mod - an incredibly simple yet perfectly executed idea that hit me like a brick - Why hadnt I thought of that? - The Mayan Pyramid - by 514Y32, and a tiny comment made by ZSTestament - Angkor Wat would be...",
  "descriptionHtml": "[IMG]http://i.imgur.com/9e7vF.png[/IMG]\r<br />\r<br />[size=+1][color=#5ea2e5][b]Aghemmor Nakh - Dwemer Architecture in Aetherius[/b][/color][/size]\r<br />\r<br />[color=#5ea2e5][b]Circumambulation[/b][/color] (from Latin circum around + ambulātus to walk) - the act of moving around a sacred object or idol.\r<br /> \r<br />Circumambulation of temples or deity images is an integral part of devotional practice.\r<br />\r<br />[b][Lore Premise][/b]\r<br />\r<br />When Kagrenac used his tools on Lorkan&#39;s heart, the Dwemer were indeed transferred from the mortal plane of Mundus to the higher plane of Aetherius, shedding their corporeal form for one of pure energy. Dwemer is no longer an accurate name for them, as they have become something other than a Mer. In Aetherius, the unbounded possibilities of the plane with it&#39;s flow of pure magic energy, and the ability to create anything that their minds can conceive of, give rise to fantastical creations from the essence of the Aether. Hence, this megastructure was born out of the energies by the joined minds of some of their greatest [Tonal] Architects.\r<br />\r<br />The main temple of Wat itself is dedicated to a long forgotten battle called [b]&#34;The Battle Of The TwentyFour&#34;[/b], between the Dwemer and some unknown force(s). On the South Wall is to be found a memorial to those Brave Few who  fought and surmounted against all odds a force much greater \r<br />than theirs. On the other walls are: East - the Support Forces ready at the Dawn of the Battle, North - Those Who Gave Succour to the damaged automatons, and West - the Forces At Rest, ready to fight another day. At the end of each wall are tablets recording important events that led up to the battle. Empty coffins that represent the Brave TwentyFour are located within the temple itself. The central Snow Elf idol appears to be in acknowledgement of their assistance in the Battle, almost as if the Dwemeri felt regret, if it was possible. Monks meditate upon Higher Energies. \r<br />\r<br />Fountains come to life as you approach them. Behind the idol in the main sanctum is a teleportation stone to a view from the top of the central spire.\r<br />\r<br />Within the walls of each of the four Cardinal Directions is a Hall dedicated to each of the Four Elements: South is the Entrance Hall, where in lies the Temple of the Blue Flame (Energy), East is the Gardens and Preserve (Earth), North is the Aquatorium (Water) with it&#39;s many active displays, and West is the Oratory Hall (Air), where the Dwemer meet to be entertained and to discuss and debate things Dwemeri.\r<br />\r<br />Boro is a half-size replication, as the full size was not attainable. The Bagan Plain has some ground cover tweaking left to do, but is overall complete. Bagan is only partially navmeshed, enough for a follower to arrive and be told to wait near the main temple.\r<br />\r<br />The Sky Palisades is where the Dwemer research their many arcane pursuits. Along with the interiors of the Bagan temples, these interiors are going to be fleshed-out with more &#34;dwemerization&#34; as I proceed. I wanted to release what I have added, and could go on forever working the interiors, but I had to say &#39;enough&#39; and release this. The association with Malacath will be further elaborated upon...\r<br />\r<br />Aurora flow constantly overhead. Silent Dwemer perform their eternal circumambulation of the temples. \r<br />\r<br />[size=+1][color=#5ea2e5][b]Take a Leap of Faith from anywhere on the Sky Palisades&#33;[/b][/color][/size]\r<br />\r<br />More of the story will be revealed, in time... \r<br />\r<br />To travel there, go to &#39;Deep Folk Crossing&#39;. On the bridge a teleportation stone is to be found. It does not interfere with any DLC. It is completely navmeshed. NO ENB was used in the screenshots.\r<br />\r<br />[IMG]http://i.imgur.com/dRinh.jpg[/IMG]\r<br />\r<br />[b][Installation Notes][/b]\r<br />\r<br />This mod is dependant only on Skyrim itself, and does not require any DLC to be installed. \r<br />\r<br />As to the Skyrim display options: I use AA & AF @ 2X, Fades @ 11, Light Fade @ 28, Grass Fade N/A, Object Detail Fade unchecked.\r<br />\r<br />Just install to your Skyrim directory and activate the mod in your launcher. There should be absolutely no conflicts. Please advise me if you encounter conflicts.\r<br />\r<br />[IMG]http://i.imgur.com/74f0oOX.jpg[/IMG]\r<br />\r<br />[b][Mod Notes][/b]\r<br />\r<br />Please see the mod notes on how to best navigate my monstrous creations...\r<br />\r<br />This is the third release of what I still plan on to ba a larger undertaking. I have scoured the Nexus and Steam, and I could not find any other &#39;megastructures&#39; of this nature...\r<br />\r<br />The Wat temple & Bagan plain are the size of 5 X 5 outdoor quads - Solitude would fit comfortably within the walls. It takes 2 1/2 minutes, with endless stamina, to run the perimeter of the Wat complex. Running through the entire Wat temple and through only one side of each of the four halls, again with endless stamina and without stopping to notice anything, takes 15 minutes. I spend an average of an hour just walking through that temple, gazing at the architecture, and watching the temple&#39;s denizens.\r<br />\r<br />This is something of a personal challenge and a proof-of-concept, all because of one mod - an incredibly simple yet perfectly executed idea that had me say, &#39;Why hadn&#39;t I thought of that?&#39;: The Mayan Pyramid - by 514Y32, and a tiny comment made by ZSTestament - &#34;Angkor Wat would be an awesome addition.&#34; That was all that it took, and now after spending four months of my time on nothing other than this - two weeks of desperately trying to figure out how the original structure that it is modelled after is laid out (There used to be an online &#39;virtual tour&#39; from a company that one could stream down from the web in a browser that coincidentally used the Gamebryo engine), ten in its creation, another six optimizing and adding &#39;Dwemerization&#39;, this is what I have created. The center of the temple is just a guess at what is in the real temple, as I found 0 photographs and no description of what the center of Angkor held (holds)...\r<br />\r<br />A medium system is probably needed to use this mod. On my system (i7, nVidia 760GTX w/ 2 Gb VRAM, 8 Gig RAM), I get *nearly* the same frame rate that I do while in Skyrim itself in the halls and down the sides of the perimeter. HOWEVER, you will find that as one gazes at the main structure itself, &#39;Time itself seems to slow down&#39; - read: major frame-rate hit (I get about 10 FPS while looking directly at the Temple). I have found the upper limit of the Gamebryo engine itself, as there are over 4,500 pieces to the Wat temple structure, and the video card&#39;s GPU has little to do with the rendered framerate.\r<br />\r<br />I greatly appreciate all feedback...\r<br />\r<br />This temple has the same architect as my other mod (in dire need of an update):\r<br />\r<br />[size=+1][url=http://skyrim.nexusmods.com/mods/24451]Uguz[/url][/size]\r<br />\r<br />I highly suggest using anonykitty&#39;s [url=http://www.nexusmods.com/skyrim/mods/5827]More Dwemered Textures[/url] for all of your Dwemer \r<br />\r<br />beautification needs. anonykitty&#39;s method showed me the way to having a more beautiful mod to present to you.\r<br />\r<br />[b][ToDo][/b]\r<br />\r<br />I plan on continuing this if for no other reason than my own personal satisfaction. My knowledge of the Creation Kit and the game engine has been \r<br />\r<br />expanded exponentially during the creation of this mod.\r<br />\r<br />[b][Extras][/b]\r<br />\r<br />[list]\r<br />  [*]Seven unique books, three being from Akavir.\r<br />  [*]Retexturing is unique to my mod, and does not overwrite any vanilla files.\r<br />  [*]New Plants.\r<br />  [*]A unique set of silver Dwarven armor, and an enchanted helm.[/list]\r<br />\r<br />[list]\r<br />  \r<br />  [*]More Dwemer Dravidian style structures to the world. (Next: Somnath & Ashkardam)\r<br />  [*]Fine-tune the some 975 roof pieces to eliminate texture blinking (yeah, right...).\r<br />  [*]Further refine Lore and Naming.\r<br />  [*]Create quests for entering the Worldspace.\r<br />  [*]Create a Living City for mortals.\r<br />  [*]Finish the accompanying music tracks I am creating for this world.\r<br />  [*]Create unique spells tought by Dwemer Master Gurus.[/list]\r<br />\r<br />[b][In Progress][/b]\r<br />\r<br />[list]\r<br />  [*]Finish the control rooms.\r<br />  [*]Finish the Dwemer female account.\r<br />  [*]Finish the voiced lines.\r<br />  [*]Create a intro quest.\r<br />  [*]New ore to mine & craft.\r<br />  [*]Continue on the three in-place spaces for the next two temples to be built[/list]\r<br />\r<br />[b][Known Issues][/b]\r<br />\r<br />[list]\r<br />  [*]Spots of blinking textures.\r<br />  [*]Sometimes an individual monk can appear &#39;iced&#39;. I do not know why this happens...\r<br />  [*]Frame rate issues from the game engine handling 4500+ models at a time \r<br />  [*]While walking over some parts of the temple, the floor or wall in the Wat temple plaza can blink out for a moment. This is an issue related to \r<br />\r<br />system/video memory, and my need to revisit the &#39;optimization&#39; of the Wat temple.[/list]\r<br />\r<br />[size=+1][color=#5ea2e5][b]Happy Travelling&#33;[/b][/color][/size]",
  "categoryId": "89",
  "version": "0.8",
  "author": "minimonster",
  "createdUnix": "1388639846",
  "updatedUnix": "1400353046",
  "containsAdultContent": false,
  "uploadedBy": "minimonster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089465",
      "name": "Aghemmor Nakh esp and bsa",
      "version": "0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30954",
      "fileName": "Aghemmor Nakh esp and bsa-49432-0-7.zip",
      "uploadedUnix": "1388639836",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/6509a7a436e759d1a82f02f9e8e9b75f9563f9c8d3ad075d5e23ae06ca6d5bcc/analysis/1407868345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aghemmor%20Nakh%20esp%20and%20bsa-49432-0-7.zip?fid=1000089465&ttl=1535830293&ri=8192&rs=8192&setec=6b7984bd99a14539a7ddb4ad8a508858"
    },
    {
      "fileId": "1000109402",
      "name": "Aghemmor Nakh",
      "version": "0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "109243",
      "fileName": "Aghemmor Nakh-49432-0-8.zip",
      "uploadedUnix": "1400353046",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/ab25c3ac6814836335d5e88a6dc5525a269fba3ff0155fc99c1b69b0456a3746/analysis/1408081347/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aghemmor%20Nakh-49432-0-8.zip?fid=1000109402&ttl=1535830294&ri=8192&rs=8192&setec=1c499a53859f74be0f27ff759f5ef176"
    }
  ]
}