{
  "modId": 49435.0,
  "modName": "Beaded Bikini for Khmera",
  "summary": "The Beaded Bikini originally by Japanarou, UNPed by Mr. Troublemaker, and ported to Khmera by me. One of my favorites.",
  "descriptionHtml": "[img]http://reaver.5gbfree.com/images/description.jpg[/img]\r<br />There was once a man named Japanarou. It is said he could craft garments worn by women that could make men drool and stumble with just a single glance. He is believed to be lost to us now, rumored to have been eaten by saber cats. His creations have been passed about Skyrim to and fro, now with only a few still remaining. One of his creations, the Beaded Bikini, is believed to be a personal item of an elf named Taarie. She works as a merchant at the Radiant Rainment in Solitude. Seek her out. If you find a black bag bearing the aspect of fangs and a crown, you will find the Beaded Bikini.\r<br />\r<br />[img]http://reaver.5gbfree.com/images/installation.jpg[/img]\r<br />Unrar the archive and place in &#34;Data&#34; folder. If you have any conflicts or issues with any aspect of your game upon installing this mod, please uninstall using the same method, but backwards.\r<br />\r<br />Please be aware this outfit is for the [url=http://www.nexusmods.com/skyrim/mods/48406/?]Khmera[/url] body style, which is a UNP-based body. It is compatible ONLY with a UNP-type skin textures such as [url=http://www.nexusmods.com/skyrim/mods/30181/?]Navetsea UNP[/url],  [url=http://www.nexusmods.com/skyrim/mods/32986/?]Mature Skin[/url], etc. The outfit is not for CBBE, Pandora, and Ladybody-type bodies, as they use a different UV to map their textures.\r<br />\r<br />[img]http://reaver.5gbfree.com/images/credits.jpg[/img]\r<br />I must thank firstly Japanarou for posting the original Beaded Bikini mod here at Nexus. I also would like to thank Mr. Troublemaker for his blessing to port his UNP version of the costume to Khmera. If it is ever proven that Japanarou was NOT indeed eaten by sabercats, and they return, I, like Mr.Troublemaker, will be happy to abide by any wishes they may have concerning this fine Skyrim mod.\r<br />\r<br />[IMG]http://reaver.5gbfree.com/images/permissions.jpg[/IMG]\r<br />You may not upload, or distribute any parts of this Skyrim mod without the expressed permission of myself and any other authors who may have contributed to the creation of this mod. ",
  "categoryId": "60",
  "version": "1.0",
  "author": "Reaverlord - MrTroubleMaker - Japanarou",
  "createdUnix": "1388642429",
  "updatedUnix": "1388642367",
  "containsAdultContent": false,
  "uploadedBy": "ReaverLord",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089467",
      "name": "Beaded Bikini for Khmera",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7532",
      "fileName": "Beaded Bikini for Khmera-49435-1-0.zip",
      "uploadedUnix": "1388642367",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4a17d99abbcf8cfca84776e4c0c6cf20aba9b13cfbc19ffcb9a48680538d4e97/analysis/1407868355/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beaded%20Bikini%20for%20Khmera-49435-1-0.zip?fid=1000089467&ttl=1535830298&ri=8192&rs=8192&setec=e9f99f0dc0f94f855e249e2b438714c2"
    }
  ]
}