{
  "modId": 49430.0,
  "modName": "Chapman Tomb Raider",
  "summary": "Grave Striding is another name for tomb raiding or crypt hording, you get the idea. This gear is designed to get you to through every twist and turn of those creepy caverns.",
  "descriptionHtml": "[img]http://reaver.5gbfree.com/images/description.jpg[/img]\r<br />The Grave Strider gear is a collection of outfits that were inspired by that famous raider we all know and love. Keep reading to find out more...\r<br />\r<br />[img]http://reaver.5gbfree.com/images/location.jpg[/img]\r<br />Arvel is a man of many talents, none of which are legal in the land of Skyrim. With that understood, it&#39;s no surprise to learn he&#39;s even stolen from the dead. It so happens, that one day, not too long ago, Arvil came upon the corpse of a woman, who had apparently fallen down a crevace and died upon impact. She was wearing strange clothing and possessed odd metallic objects, bound within compartments strapped to her legs. Arvel pinched every article and item the girl possessed. If you desire what she owned, you can find it all within the stolen satchel of Arvel, who now calls himself the Grave Strider. He was last seen entering Bleakfalls Barrow. Find him buried in a web spun perfectly for his taste... literally.\r<br />\r<br />[img]http://reaver.5gbfree.com/images/installation.jpg[/img]\r<br />Unrar the archive and place in &#34;Data&#34; folder. If you have any conflicts or issues with any aspect of your game, please uninstall using the same method, but backwards.\r<br />\r<br />[img]http://reaver.5gbfree.com/images/credits.jpg[/img]\r<br />I would like to thank Onigiri023. It was several of their parts that I used to craft the Grave Strider gear. Without their priceless permission, this mod would not have happened.\r<br />\r<br />I would like to thank another great artist, Izumiko, for their permission in allowing me to port parts of their Oblivion mod to use with this mod. \r<br />\r<br />And last but not least, I&#39;d like to thank Jeff Chapman, the man who inspired me to ever create this mod. His art is unbelievable. See first screen pic&#33;\r<br />\r<br />PS: The images you find here that DON&#39;T have a copper skull on the belt buckle depict the outfits on the prototype I made before finalizing what you get. I took the shots of it, and thought they were good, so I posted them too. What you get when you DL, however, is the version that&#39;s like in the first screenshot. Just FYI.\r<br />\r<br />[IMG]http://reaver.5gbfree.com/images/permissions.jpg[/IMG]\r<br />You may not upload, or distribute any parts of this Skyrim mod without the expressed permission of myself and any other authors who may have contributed to the creation of this mod.",
  "categoryId": "60",
  "version": "1.0",
  "author": "ReaverLord - Onigiri023 - Izumiko",
  "createdUnix": "1389063498",
  "updatedUnix": "1499617978",
  "containsAdultContent": false,
  "uploadedBy": "ReaverLord",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090280",
      "name": "Grave Strider for Khmera",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24120",
      "fileName": "Grave Strider for Khmera-49430-1-0.zip",
      "uploadedUnix": "1389065368",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a0044b776c07656bb4675ad73b29583d03e4abd09153204f2f3b220a72905bfc/analysis/1407875564/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grave%20Strider%20for%20Khmera-49430-1-0.zip?fid=1000090280&ttl=1535830288&ri=8192&rs=8192&setec=e43cd2ee46319588c2f8de6363c966c2"
    },
    {
      "fileId": "1000248940",
      "name": "TEXTURES",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "13015",
      "fileName": "TEXTURES-49430-1.zip",
      "uploadedUnix": "1499617978",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/19f65745d4808d003a846529734b4bec8d193b88a5103255930d57b0019f15f7/analysis/1499618088/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TEXTURES-49430-1.zip?fid=1000248940&ttl=1535830288&ri=8192&rs=8192&setec=db39e55b15e893a798d6e8470436cbb0"
    }
  ]
}