{
  "modId": 49434.0,
  "modName": "Wonder Woman",
  "summary": "The famed Princess Diana has been to Skyrim before. Now she&#39;s back in two unique red, blue, and gold costumes, along with a brand new body&#33;",
  "descriptionHtml": "[img]http://reaver.5gbfree.com/images/description.jpg[/img]\r<br />This mod is of three types. The first is a direct port of the awesome Wonder Woman costume posted by fellow artist Izumiko for Oblivion and Skyrim. It contains her tiara, boots, and corset in all its glory. The second is an older version of Wonder Woman, which I call Princess Lynda&#39;s Uniform.And the third is a variant of the second, with more-lore friendly textures.\r<br />\r<br />[img]http://reaver.5gbfree.com/images/location.jpg[/img]\r<br />It is rumored one can find the Princess Diana&#39;s colorful uniform hidden in the noble Lady Vittoria Vici&#39;s manor house in Solitude--likely her bedroom wardrobe. It is also rumored Miss Vici is a fan of everything the lovely Princess once did in her life. So don&#39;t be surprised if more articles of wondrous clothing are hidden in her wardrobe.\r<br />\r<br />[img]http://reaver.5gbfree.com/images/installation.jpg[/img]\r<br />Unrar the archive and place in &#34;Data&#34; folder. If you have any conflicts or issues with any aspect of your game upon installing this mod, please uninstall using the same method, but backwards.\r<br />\r<br />There is also a container you may spawn with the console at any time called &#34;Vittoria Vici&#39;s Secret Bag&#34;. It will have every part of the mod inside it.\r<br />\r<br />[img]http://reaver.5gbfree.com/images/credits.jpg[/img]\r<br />I would like to thank Izumiko for their help and priceless permission in porting this amazing Wonder Woman oufit to Khmera. For now, I would like for you all to use Izumiko&#39;s original textures with the modified meshes. Later on, however, I will release a more lore-friendly version of Wonder Woman&#39;s presence in Skyrim.\r<br />\r<br />[IMG]http://reaver.5gbfree.com/images/permissions.jpg[/IMG]\r<br />You may not upload, or distribute any parts of this Skyrim mod without the expressed permission of myself and any other authors who may have contributed to the creation of this mod.",
  "categoryId": "60",
  "version": "2.0",
  "author": "Reaverlord - Izumiko",
  "createdUnix": "1388722288",
  "updatedUnix": "1389466742",
  "containsAdultContent": false,
  "uploadedBy": "ReaverLord",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090967",
      "name": "Wonder Woman for Khmera",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "44371",
      "fileName": "Wonder Woman for Khmera-49434-2-0.zip",
      "uploadedUnix": "1389466742",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/cd0d5d1680bc57795c3b51b8d5aae8a20562d0c40095a06f661b4e63d4f4dd6d/analysis/1407881982/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wonder%20Woman%20for%20Khmera-49434-2-0.zip?fid=1000090967&ttl=1535830297&ri=8192&rs=8192&setec=4eec0a8f7f2626d49541dfe6367f21e6"
    }
  ]
}