{
  "modId": 49472.0,
  "modName": "Realistic Nights",
  "summary": "Tired of pseudo-nights? Want something more believable? Something more fun? Something much darker? Want to make Skyrim&#39;s nights beautiful yet scary as hell? You, my friend, have come to the right place. Now with ENB support and brightness levels&#33;",
  "descriptionHtml": "[center][img]http://i40.tinypic.com/ibbcwh.png[/img] \r<br />[b][i]Tailored for use with ENB, COT, RLO, and Vanilla Skyrim[/i][/b]\r<br />\r<br />[COLOR=#ffcc33][SIZE=6]Description[/COLOR][/SIZE]\r<br />If you&#39;re looking for a darker, more immersive nighttime Skyrim experience, you&#39;ve come to the right place. I want something where you&#39;re actually scared to travel at night, where the woods of Skyrim are crawling with hidden beasts, and where the player can truly blend in wtih the shadows at night. The goal of this mod is to make Skyrim&#39;s nights realistic, fun, lore-friendly, role-play friendly, and beautiful. \r<br />\r<br />\r<br />[COLOR=#ffcc33][SIZE=6]Features [/COLOR][/SIZE]\r<br />This mod goes about bringing realistic, dark nights to Skyrim using the actual lighting of the game engine. I wanted something that made nights dark and scary but still completely functional, where you could still play at night so long as you used a torch. I created this mod since the only options I could find simply forced the player to essentially don tinted sunglasses at night, which darkens [i]everything [/i](including torchlight), rather than what should be. This mod takes the long route of using the game engine&#39;s lighting mechanics rather than going the quick and dirty route of simply dimming the entire screen.[/center]\r<br />[LIST][*]Multiple levels of brightness. Make your own experience&#33; Choose a darker option to exprience realistic nights like those in our own world, or a brighter one to simulate living in Skyrim under the watch of Tamriel&#39;s massive moons. There is also a casual option available for those not looking for dark nights- this option preserves the beauty of this mod, as the land fades out realistically in the distance and nighttime colors are more subtle, while preventing the need to have a torch or light source.\r<br />[*]Varied night lighting according to the weather. On a clear night, Tamriel&#39;s massive moons will provide enough light to make things out in the open, so long as you&#39;re close. Aurorae will realistically reflect off water, snow, and other materials when present and paired with the right weather. On the other end of the spectrum, you won&#39;t be seeing much of anything in the middle of an all-out blizzard. \r<br />[*]Torches and lights work. Changes to torches and magic lights are boxed in with this mod. Survival at night becomes a game of its own - navigation is challenging without a light source, but opportunities are available to conquer the darkness. Light magic spells are now the most coveted form of light in the game with their supreme illumination capabilities, but a torch will do just fine.\r<br />[*]Eye adjustment. When you&#39;re standing in or looking into bright light at night, everything else will become realistically pitch black. Move out away from the light and your eyes will adjust. (Of course, it still might be pitch black depending on the weather, your surroundings, the region you&#39;re in, etc.)\r<br />[*]Realistic NPC reaction and sneaking. For once, it actually makes sense to carry out covert operations at night. Since the actual lighting is changed, NPCs will react realistically. No more being assaulted at all turns by enemies you can&#39;t see who can see you. Now, if you&#39;re outside at night and away from any light sources, you really can blend in with the shadows. (That being said, enemies can still locate you by noise - which is quite easy if you&#39;re running through the dead silence of night wearing armor- so make sure you still remember to sneak and tread carefully.)[*]Differences in region. Snow reflects a heck of a lot of light. As such, on a night with a full moon and clear skies, you&#39;ll actually be able to see comparatively decently in a snowy area. Move to a forested region or under a rocky outcrop and you&#39;ll have a lot more trouble seeing anything.\r<br />\r<br />[*]Overall appearance. All of the aspects of Skyrim&#39;s nights have been meticulously balanced to ensure everything blends well, looks simultaneously realistic and beautiful, and reacts to changing conditions correctly. Water, for example, reflects a very different intensity and color depending upon weather situations.\r<br />\r<br />[*]Custom Night Eye/ Vampire Hunter&#39;s Sight. My take on the night eye effect is boxed in with the mod, since vanilla night eye isn&#39;t useful when nights are darker. ENB users, please see the &#34;Tuning for ENB&#34; section.\r<br />\r<br />[/LIST]\r<br />\r<br />Please be sure to have your monitor or screen at the correct viewing angle when using this mod. The lighting is fine-tuned; you might not be seeing subtle changes you&#39;re supposed to if you have a bad viewing angle going. \r<br />\r<br />Finally, there are versions of this mod for users of Climates of Tamriel, Dawnguard, Dragonborn, and cut-and-dry vanilla Skyrim. (Hearthfire works with any version.) I HIGHLY recommend you go and get yourself [url=http://www.nexusmods.com/skyrim/mods/17802/?]Climates of Tamriel[/url] if you haven&#39;t. That beauty will add hundreds of different weathers and thousands of unique days, nights, sunrises, and sunsets to Skyrim and allow you to experience hundreds more unique nights from this mod. As of version 3.0, it is required that users of Climates of Tamriel also install Climates of Tamriel Weather Patch, Supreme Storms for COT, and Expanded Snow Systems for COT, all located at the bottom of this page. These mods are simple installs which add tremendously to the atmosphere.\r<br />\r<br />\r<br />[COLOR=#ffcc33][SIZE=6]Installation [/COLOR][/SIZE]\r<br />[LIST] \r<br />[*]This mod requires Skyrim version 1.9.32.0.8. \r<br />[*]Download the main file. Note that any file will work with or without Hearthfire. \r<br />[*]Enable with NMM, Mod Organizer, or Wrye Bash, or follow the included readme to install manually.\r<br />[*][b]LOAD-ORDER[/b]: I recommend you use LOOT; just ensure that this mod&#39;s files are loaded after any files they patch.\r<br />[/LIST] \r<br />\r<br />[COLOR=#ffcc33][SIZE=6]Updating[/COLOR][/SIZE]\r<br />\r<br />[LIST]\r<br />\r<br />[*]If you&#39;d like, view the changelog through the link at the top of the page to see what&#39;s been added.\r<br />\r<br />[*]This mod can be updated without issue, just uninstall the old version, and install the new one. As with any mod, there is a chance that other mods can be broken if one changes their load order mid-game; but this is rare; please always keep a backup save handy and test when updating/installing/uninstalling mods mid-game.\r<br />\r<br />\r<br />\r<br />[COLOR=#ffcc33][SIZE=6]Uninstallation[/COLOR][/SIZE]\r<br />\r<br />\r<br />\r<br />[*](AUTOMATIC) Disable the mod with NMM, Wrye Bash, or Mod Organizer. \r<br />[*](MANUAL) Go into your Skyrim/Data folder and simply delete all files beginning &#34;RealisticNights...&#34;.[/LIST] \r<br />\r<br />[COLOR=#ffcc33][SIZE=6]Tuning for ENB[/COLOR][/SIZE]\r<br />\r<br />As of version 3.0, this mod is tuned for ENB out-of-the-box. However, several possible additions:\r<br />\r<br />To tune the brightness levels of this mod for your particular ENB, open up your &#34;enbseries&#34; .ini located under the Skyrim folder. Scroll down to Environment and adjust &#34;DirectLightingIntensityNight&#34; and &#34;AmbientLightingIntensityNight&#34;. This mod was built using values of 1.0 for both, so you may want to try starting there.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/50731/?]Enhanced ENB Night Eye by scegielski[/url]   -Night Eye is deactivated with ENB; use this mod to bring it back and fine-tune it. Works with Gopher&#39;s excellent [url=http://www.nexusmods.com/skyrim/mods/22274/?]Predator Vision[/url].\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/53799/?]Remove Camera Attachments by BluemaxDR[/url]   -Night Eye fix: some fog clouds are attached directly to your character and can be blinding when using Night Eye. BluemaxDR has created a fix.\r<br />\r<br />\r<br />[COLOR=#ffcc33][SIZE=6]Compatibility [/COLOR][/SIZE]\r<br />Should be compatible with all lighting mods; generally, load this mod&#39;s files after lighting mods (i.e. RLO, ELFX) Weather mods are incompatible and need patches. (Patches for COT/COTWP and RLO Weathers are included in the download)\r<br />\r<br />[COLOR=#ffcc33][SIZE=6]Merging Patches [/COLOR][/SIZE]\r<br />Depending on which options you select, you might end up with a several different plugins from this mod. All plugins from this mod are completely mergeable with TES5Edit and the Merge Plugins script available on the Nexus. (if you want to save plugin space, reduce clutter etc.) Here are instructions to do so: [LIST]\r<br />[*]Download TES5Edit version 3.0.32 [url=http://www.nexusmods.com/skyrim/mods/25859/?]here[/url] \r<br />[*]Download TES5Edit Merge plugins script [url=http://www.nexusmods.com/skyrim/mods/37981/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D37981%26preview%3D&pUp=1]here[/url] \r<br />[*]Open TES5Edit. Right click in the box that appears showing all of your plugins and click &#34;Select None&#34;. \r<br />[*]Find all plugins beginning &#34;RealisticNights&#34; and check the box to the left of them. \r<br />[*]Click OK \r<br />[*]Wait for TES5Edit to load the files. In the messagebox, it will read &#34;Background Loader: Finished&#34; when it is ready. \r<br />[*]Hold control down and click all Realistic Nights files to highlight them all. \r<br />[*]Right click on one of the files and select &#34;Apply Script.&#34; \r<br />[*]Select script &#34;Merge Plugins V1.65&#34; \r<br />[*]Click OK \r<br />[*]Ensure only the Realistic Nights plugins are checked. Select &#34;Copy intelligently&#34; and&#34;Renumber FormIDs&#34; \r<br />[*]Click OK; Create New File, Enter &#34;RealisticNightsMerged&#34; or whatever file name you&#39;d like \r<br />[*]Wait for the script to finish. \r<br />[*]Right-click the resultant plugin and click &#34;Check For Errors.&#34; If it throws any errors (which it shouldn&#39;t), retry merging the plugins, see if you can figure out what went wrong, or comment here for help. \r<br />[*]Click the red exit button on TES5Edit. Only check the box for the plugin you made to save it. \r<br />[*]You&#39;re done&#33; Now, you can enable only the merged plugin and get rid of the rest&#33; Sort this plugin where the lowest one would have been (or put it at the bottom of your load order/right above a bashed patch for convenience. \r<br />[*]Go give the fine folks who made TES5Edit and the Merge Plugins script an endorsement, and enjoy the game. \r<br />[/LIST]\r<br />[COLOR=#ffcc33][SIZE=6]FAQ [/COLOR][/SIZE]\r<br />Q: My game crashes on the main menu screen&#33; \r<br />A: This is due to missing master files. Please make sure you have all the masters you need to use for any files from my mod, and are loading the masters higher in your load order than the files from this mod. To do this, you can use Wrye Bash (click on the mod and look at the box on the right which displays the file&#39;s masters) or TES5Edit (load up my mod&#39;s files, click the plus sign next to the file, click on header, and look at the masters) to view the masters of each of my files.\r<br />\r<br />\r<br />Q: The landscape flickers when I look around - i.e. the ground will be dark when I&#39;m looking one way and bright when I&#39;m looking another way.\r<br />A: This is a game engine limitation on the number of lights allowed to be activated at once in a scene.\r<br />\r<br />Q: Will this mod lower my FPS? \r<br />A: This mod uses existing vanilla lighting to achieve its effect and will not affect performance. \r<br />\r<br />Q: Waterfalls and whitewater glow at night. Fix it&#33; \r<br />A: This is a vanilla issue. Another modder already has fixed it&#33; :D Go [url=http://enbseries.enbdev.com/forum/viewtopic.php?f=6&t=1499]here[/url] to download this fix. Note that this &#34;particle patch&#34; will greatly alleviate the issue, though not fix it entirely, as doing so would mess up how water looks in the daytime.\r<br />\r<br />Q: Some small plants and grasses do not light up, even when next to a light source. \r<br />A: This is another game engine limitation. Procedurally generated grasses do not respond to point lights (i.e. torches, light spells). Changing the meshes of these plants results in immediate crashing.\r<br />\r<br />Q: Where to put optional files in the load order? \r<br />A: Below one of the main files and any mods the optional file patches address. \r<br />\r<br />[COLOR=#ffcc33][SIZE=6]Complimentary Mods[/COLOR][/SIZE]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/30450/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D30450%26preview%3D&pUp=1]Realistic Lighting Overhaul[/url] by The Realistic Lighting Team \r<br />[url=http://www.nexusmods.com/skyrim/mods/17416/?]Wearable Lanterns[/url] by Chesko\r<br />[url=http://www.nexusmods.com/skyrim/mods/17802/?]Climates of Tamriel[/url] by JJC71 with [url=http://www.nexusmods.com/skyrim/mods/39799/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D39799%26preview%3D&pUp=1]Climates of Tamriel Weather Patch[/url] by prod80, Aiyen, and Saerileth \r<br />[url=http://www.nexusmods.com/skyrim/mods/27022/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D27022%26preview%3D&pUp=1]Supreme Storms for Climates of Tamriel[/url] by MannyGT \r<br />[url=http://www.nexusmods.com/skyrim/mods/28110/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D28110&pUp=1]Expanded Snow Systems Climates of Tamriel Version[/url] by JonusL2D \r<br />[url=http://www.nexusmods.com/skyrim/mods/18916/?]Lanterns of Skyrim[/url] by MannyGT \r<br />[url=http://www.nexusmods.com/skyrim/mods/35631/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D35631%26preview%3D&pUp=1]Monster Mod[/url] by Dogtown1 and Ironman5000 \r<br />[url=http://www.nexusmods.com/skyrim/mods/49784/?]Equipping Overhaul[/url] by DragonDude1029 - Allows you to drop lit torches without a clumsy power. Also, can be configured so that when you unsheathe a weapon, you automatically drop your torch. \r<br />\r<br />[COLOR=#ffcc33][SIZE=6]Videos[/COLOR][/SIZE]\r<br />\r<br />[url=http://www.youtube.com/watch/?v=FAdwPtSzRZI][img]http://img.youtube.com/vi/FAdwPtSzRZI/1.jpg[/img]\r<br />Click here to play video[/url] \r<br />Thanks to Gruntlock for this video&#33; It gives a nice quick overview of the visuals of the mod. \r<br />[url=http://www.youtube.com/watch/?v=eyhob1lJdEQ][img]http://img.youtube.com/vi/eyhob1lJdEQ/1.jpg[/img]\r<br />Click here to play video[/url] \r<br />Thanks to StarduskLP for this one&#33; This is an excellent, comprehensive 15-minute in-depth review of the mod which explains it extremely well. \r<br />[url=http://www.youtube.com/watch/?v=JrAXOpc2JNc][img]http://img.youtube.com/vi/JrAXOpc2JNc/1.jpg[/img]\r<br />Click here to play video[/url] \r<br />Thanks to SkyttsTV for this vid&#33; Review starts at 5 minutes into the vid. Great explanation of many features of the mod. \r<br />\r<br />\r<br />\r<br />\r<br />I hope you enjoy the mod. Happy adventuring&#33;",
  "categoryId": "78",
  "version": "3.0",
  "author": "MountainFisherman",
  "createdUnix": "1388730646",
  "updatedUnix": "1405039161",
  "containsAdultContent": false,
  "uploadedBy": "MountainFisherman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091395",
      "name": "Realistic Nights",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "442",
      "fileName": "Realistic Nights-49472-2-1.7z",
      "uploadedUnix": "1389673699",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/dc47d4ca4bfe829997bfef281e6fc60ee6d475c95ed325caf1237d58b75fc6f9/analysis/1407885498/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Realistic%20Nights-49472-2-1.7z?fid=1000091395&ttl=1535830387&ri=8192&rs=8192&setec=aa1c230a9eb3c29265b244beb0b040eb"
    },
    {
      "fileId": "1000116943",
      "name": "Realistic Nights",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "916",
      "fileName": "Realistic Nights-49472-3-0.7z",
      "uploadedUnix": "1405039161",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/49dc5b8707a1b6c65e435fdfa88e2e915b4c17e65f83cf107aea85837c9c490c/analysis/1405039209/",
      "changelogHtml": " /////Realistic Nights by MountainFisherman/////\r<br />//\t\tChangelog\t\t     //\r<br />\r<br />\r<br />///Version 3.0:///\r<br />A major rebuilding of the mod.\r<br />-Reworked all nights. Created five brightness levels using vanilla lighting system. Brighter levels created in order to provide more lore-friendly options and ENB-friendly options.\r<br />-Tuned brightness levels for use with ENB\r<br />-Fixed all glowing skies&#33; No more rain/snow storms with extremely bright, white skies.\r<br />-Fixed magicka cost value of candlelight and magelight spells. (For good now&#33;&#33; :)) Now magicka cost is same as vanilla.\r<br />-Reworked night eye to a more realistic, useful, and lore-friendly point (affecting Khajiit Night Eye and Vampire Hunter Sight)\r<br />-Reworked torches & magic lights to be as close as possible to inverse square law. Both are now stronger and brighter and optimized for comfortable use in both third and first person viewpoints. Magic lights are more useful than torches.\r<br />-Supreme Storms (SS) and Expanded Snow Systems (ESS) weathers reworked and correctly implemented\r<br />-Torches, magic lights, and night eye plugins are now packaged in with the mod\r<br />-Removed &#34;Moon Phase Affects Brightness&#34; patch. With reworking of mod patch is obselete; said mod can be used without needing a patch\r<br />-Removed &#34;IS patches&#34; (imagespace adjustments intended to set the table for the mod&#39;s lighting) ; no longer needed\r<br />-Renamed .esps to be more BOSS/LOOT-friendly\r<br />-Removed support for COT-only configurations. Now COT must be used with COTWP, SS, and ESS; this config is easy to upgrade to, more atmospheric, and much less work to build and tune this mod for.\r<br />\r<br />\r<br />///Version 2.1: ///\r<br />A small update. \r<br />-Improved &#34;torches and magic lights&#34; optional file. Fixed light spells costing way more than they should. Now, torches have an extended radius of 1300. However, they fade in intensity a bit faster to help them blend better. Light spells now have an extended radius of 1450 in addition to the previous increase of their magnitudes to 25. Now, light spell scrolls and staves are also affected. \r<br />\r<br />///Version 2.0: ///\r<br />-Created automated fomod installer to greatly ease installation. \r<br />-Added manual installation support \r<br />\r<br />///Version 1.2: ///\r<br />-Added brightness levels patches. You do not have to use any of these; I suggest you try the mod without one of these patches first at least. These patches brighten the nights for those who thought the original nights were too dark. Files including/ending in &#34;op4&#34; are the brightest versions; ones ending in &#34;op1&#34; are darkest. These brightness levels use vanilla lighting, not just a brightness modifier for the whole picture. Look for comparison shots in the images section. \r<br />-Fixed an issue with RLO Weathers that was causing nights to be darker than they should be. \r<br />-Added files that improve torches, light spells, night vision, vampire sight, and predator vision to help navigate at night. \r<br />-Added patch for &#34;Moon Phase Affects Brightness.&#34; \r<br />\r<br />///Version 1.1: ///\r<br />-Added support for Climates of Tamriel Weather Patch, Expanded Snow Systems, and Supreme Storms. See optional downloads. \r<br />-Added support for Realistic Lighting Overhaul Weathers. See optional downloads. \r<br />-(Only affects users of COT+DB or COT+DB+DG versions.) Fixed Realistic Nights COT Dragonborn patch. The mod did not specify the COT DB patch as a master, causing my nights to not show up when displaying the weathers added by COT DB.\r<br /> <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Realistic%20Nights-49472-3-0.7z?fid=1000116943&ttl=1535830388&ri=8192&rs=8192&setec=ca1cdd433ae00eda4179f94f014803ee"
    }
  ]
}