{
  "modId": 49476.0,
  "modName": "Dead Kings Armory",
  "summary": "Set of gear belonging to a legendary king.",
  "descriptionHtml": "Hello all,\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;This is my first mod and I hope that everyone enjoys it. It should work with all of the skyrims (add ons included) and that I know of does not clash with other mods. If there is a problem with it just let me know and I&#39;ll try and fix it. All it is is a set of gear (helm,gloves,boots,chest, 2 reg sword, greatsword, bow, necklace, ring, and mace) all tricked out and heavily enchanted also if there is a very good graphic designer on here I&#39;d like to talk to them so I can update the look of all of the gear (I can barely draw let alone try to make stuff on computer XD) currently is the look of Daedric. Thanks again for stopping buy and hope u enjoy. UPDATED INFO: sorry about the lack of info folks was really late at my time when I uploaded it so was a bit scatter brained so here we go. The Gear has all the enchantments that each piece would usually be allowed to have in the game (minus the firey soul trap and the huntsman&#39;s prowess couldn&#39;t find them) don&#39;t mind the low armor and weapon number because the enchantment on it more then makes up for them (even though I could have sworn I put them at the highest I could). Like i said above I want to change the look or have a completely new look for the armor to be more skeletal in nature so if anyone can help with that I&#39;d be grateful cause i have no graphic prowess to speak of. Hope y&#39;all enjoy the gear and let me know if there is anything else you&#39;d like me to do. Also I will try and upload some screen shots either of the enchantment bonuses or when I get the new new look. Thanks again for the look and hopefully you&#39;ll enjoy my mod. One more thing I had entertained the idea of making the enemies you killed come back to life and fight at your side. If you like the idea let me know and I&#39;ll add it also someone mentioned a constant fear effect which I&#39;ll add if you would like and any more ideas you have and wont to see let me know. I love hearing what people want or like. I also created a forum so that if anyone wants to add what they would like to see they can once again thank you for checking this out and hope u enjoy. I have created a discussion for this Mod so that whoever wants can give ideas as to what they would like to see on this mod or what kind of mod you would like to see in the future\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;The Dead King",
  "categoryId": "40",
  "version": "1",
  "author": "The Dead King",
  "createdUnix": "1388730851",
  "updatedUnix": "1388730845",
  "containsAdultContent": false,
  "uploadedBy": "magi13",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089640",
      "name": "Dead Kings Armory",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Dead Kings Armory-49476-1.rar",
      "uploadedUnix": "1388730845",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/7ff1d53b911be582f026d0cbf45368c43a865022d692342d1bfb76c78644455a/analysis/1407869762/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dead%20Kings%20Armory-49476-1.rar?fid=1000089640&ttl=1535830393&ri=8192&rs=8192&setec=09c0fe71cbcc220529f8cb69cdf32bc3"
    }
  ]
}