{
  "modId": 49486.0,
  "modName": "Bandolier - Bags and Pouches Spanish Translate",
  "summary": "Traducción al español del mod Bandolier - Bags and Pouches de Dragten",
  "descriptionHtml": "[size=5][center][color=red]NECESITAS EL [/color][url=http://www.nexusmods.com/skyrim/mods/16438/?]MOD ORIGINAL[/url][/center][/size]\r<br />\r<br />\r<br />\r<br />\r<br />[color=orange]Descripción:[/color]\r<br />\r<br />¿Estas cansado de dejar atrás cosas que te son muy útiles porque no tienes suficiente capacidad de carga en tu personaje?\r<br />¿Cuantos huesos de dragon, chatarra Dwemer o cosas valiosas has dejado?\r<br />Demasiadas veces, ¿cierto?.\r<br />Pero ahora, hay una solución para tus problemas, &#34;Bandolier - Bags and Pouches&#34; de Dragten, te ofrece una amplia selección de elementos para tu equipación, que te aumentan la capacidad de carga.\r<br />¡Se puede usar con todas las armaduras&#33;\r<br />\r<br />\r<br />Este mod ofrece objetos que al equiparlos, aumentan tu capacidad de carga. Por el momento, hay 7 nuevas ranuras de equipamiento para estas bolsas: Pecho, Espaldar Izquierdo, Espaldar Derecho, Frontal Izquierdo, Frontal Derecho, Lado Izquierdo y Lado Derecho. Cada objeto puede ser equpiado en una ranura distinta, por lo que podemos combinar siete piezas de bolsas y bandoleras diferentes en nuestro personajes. El mod ofrece un total de 67 objetos diferentes.\r<br />\r<br />\r<br />Todos los objetos se frabican en un soporte para curtir pieles. Sin embargo, algunos de estas bolsas y bandoleras necesitas de elementos extras que solo son creados en forjas.\r<br />\r<br />- Cuero teñido de negro: se fabrica combinando una pieza de cuero con un veneno de [url=http://es.elderscrolls.wikia.com/wiki/Ara%C3%B1a_congeladora]Araña congeladora[/url]\r<br />- Surtido de Hebillas: se frabican en una forja con barra de acero.\r<br />- Para crear una bandolera con hombreras, primero debes crear una bandolera normal, y luego la combinas con una pieza extra de cuero en el soporte para curtir pieles, consigues crear una bandolera con hombreras.\r<br />- Para crear objetos de la Hermandad Oscura, deberás aprender la receta en su santuario. Si no puedes encontrarlo, ve a la sección de Spoiler situado mas abajo de la página.\r<br />- Puedes mejorar las bandoleras pequeñas en bandoleras grandes. [color=red]La receta se mostrará solo si tienes bandoleras pequeñas en tu inventario.[/color]\r<br />\r<br />\r<br />\r<br />[color=red]CREDITOS[/color]\r<br />\r<br />- Dragten, por su trabajo y dedicación en hacer este grandioso mod, y por darme su permiso en compartir esta traducción en Nexus.\r<br />\r<br />\r<br />\r<br />[color=red]SPOILER[/color]\r<br />\r<br />- Localización de la receta de La Hermandad Oscura\r<br />\r<br />[spoiler]La receta está en el estante de libros de la primera habitación (la habitación con el mapa de SKYRIM en la mesa de piedra), en el santuario de Falktreath.[/spoiler]",
  "categoryId": "60",
  "version": "1.2",
  "author": "ness87",
  "createdUnix": "1388786691",
  "updatedUnix": "1388786312",
  "containsAdultContent": false,
  "uploadedBy": "ness87",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089759",
      "name": "Bandolier - Bags and Pouches Spanish Translate",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Bandolier - Bags and Pouches Spanish Translate-49486-.rar",
      "uploadedUnix": "1388786312",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/86f053a1f9544b81ee9b760e0bb0ecb4bee13d7baf000fbb58deed0aa7f1787f/analysis/1407870732/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bandolier%20-%20Bags%20and%20Pouches%20Spanish%20Translate-49486-.rar?fid=1000089759&ttl=1535830406&ri=8192&rs=8192&setec=1a549d3ab97ee1e466564aae32229cc7"
    }
  ]
}