{
  "modId": 49485.0,
  "modName": "Hunter Retreat -- Player Home - New Worldspace",
  "summary": "This mod adds a new player home complete with a custom lore friendly backstory to discover. It is simple yet elegant with many unique features. It is obviously aimed at a hunter type character, but anyone can live here. It also has a lot of little miscellaneous add ins. These include Notes, lore on the worldspace, and treasure. And it is all comple",
  "descriptionHtml": "[u]Description[/u]\r<br />\r<br />This is a completely lore friendly player home mod. The house is hunter themed and has many little features and nice touches that make it stand out. While the house may be small, it is tucked in a cozy little area of a worldspace that is about the size of Whiterun. This worldspace has wildlife, lots of extra things so you&#39;ll think it was made by Bethesda, and it has lots of plants and flowers. It has a completely lore friendly way to get to and from it. There are no enemies as of now in the general worldspace. You can safely stay there all you want. If you happen to encounter a dragon or something, it may be another mod. There should be no dragons or any other enemy in there. It is completely encompassed by mountains making it seem closed off from all the troubles of everyday life. And inside the house, there are a collection of four books that tell the backstory, and pave the way for an upcoming quest. Also, downstairs there is a hunting room. This is a room with lots of pedestals that hold stuffed forms of various creatures throughout Skyrim. These all use vanilla resources so you don&#39;t have to download any external mods. Check the screenshots for a preview of what it is. It also adds lots of little notes and journals. I suggest you read them as they teach you a skill and are interesting.\r<br />\r<br />[u]Features[/u]\r<br />\r<br />-New worldspace the size of Whiterun\r<br />-Cozy player home\r<br />-Beautiful Landscape\r<br />-Plenty of Weapon Racks and display cases\r<br />-Small Trophy Room\r<br />- Arcane Enchanter\r<br />-Alchemy Table\r<br />-Full Smithy\r<br />-Custom Storage\r<br />-Map Marker\r<br />-Lore Friendly Integration\r<br />-Fully Navmeshed\r<br />-Lots of Clutter\r<br />-Lots of Secrets to Discover\r<br />-Full Backstory\r<br />-Plenty of Hidden Treasure.\r<br />-New (dead) NPCs\r<br />-Lots of little notes from your furnisher\r<br />-New Journals\r<br />-Bookcases + a little Reading Area\r<br />____________________________________________________________________________________________\r<br />\r<br />[u]To Do List[/u]\r<br />-New (alive) NPCs\r<br />-New Quest\r<br />-Improve Landscape\r<br />-Add more miscellaneous things and lore\r<br />-Add Ore Veins\r<br />-More Treasure\r<br />-Fix LOD\r<br />\r<br />[u]Installation[/u]\r<br />\r<br />Manual:\r<br />Download manually\r<br />Open with WinRar or similar archiver\r<br />Extract files to your Skyrim Data folder (steam/steamapps/common/Skyrim/Data)\r<br />Activate in Data Files or Mod Manager\r<br />\r<br />NMM:\r<br />Click download with Mod Manager\r<br />Wait for it to download in NMM\r<br />Double click the downloaded file\r<br />Make sure it is activated\r<br />\r<br />[u]Un-Installation[/u]\r<br />Remove ALL items from the containers that you want to keep. Leave the worldspace. Then you can uninstall. This mod comes script free so their is no save game bloat and it is easy to uninstall. But, if you aren&#39;t sure about uninstalling if you are scared it will hurt your game, don&#39;t. Like I said, it is lore friendly. If you never go back, all you will see is a boat.\r<br />\r<br />[u]How to get There[/u]\r<br />To get their go to the solitude docks and find the little rowboat. Map Marker. When you get inside, it should say enter Hunter&#39;s retreat. If it doesn&#39;t, you&#39;re in the wrong rowboat. Once again, you can check the screenshots to see where it is. Once you get to the new land, you have to go on a scavenger hunt. You need to find a dead hunter. He is in the worldspace. He has some gold, possibly, 2 keys to the house, and a note detailing his final moments. \r<br />\r<br />[u]Incompatibilities[/u]\r<br />\r<br />This house mod alters none of the original Skyrim landscape, it use a naming system where everything added starts with hunter, and it is in a new worldspace. This mod also as no scripts. This should mean there are no incompatibilities anywhere out there. \r<br />\r<br />[u]Credits[/u]\r<br />Thanks to Oaristys and Tony67 for the [url=http://www.nexusmods.com/skyrim/mods/16525/?] Modder&#39;s Resource[/url]\r<br />\r<br />Enjoy the mod&#33;&#33;&#33;\r<br />\r<br />\r<br />",
  "categoryId": "67",
  "version": "1.00",
  "author": "flamingdiaper4U",
  "createdUnix": "1388759972",
  "updatedUnix": "1388759877",
  "containsAdultContent": false,
  "uploadedBy": "flamingdiaper4U",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089680",
      "name": "Hunter Retreat - Main Version ",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37080",
      "fileName": "Hunter Retreat - Main Version -49485-1-00.rar",
      "uploadedUnix": "1388759877",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/2c90891ba827bc42302990f17ff09c953812a4f8f2569e436ccf0ff1d192360e/analysis/1407870173/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hunter%20Retreat%20-%20Main%20Version%20-49485-1-00.rar?fid=1000089680&ttl=1535830404&ri=8192&rs=8192&setec=22932ab457bd0612957781da7a79ca8f"
    }
  ]
}