{
  "modId": 49519.0,
  "modName": "Cursed Camelot and Excalibur",
  "summary": "A short adventure to unlock a new player home, new followers, new mount, new weapons, and new armor.",
  "descriptionHtml": "Mod Description by ApokKnight\r<br />\r<br />What this mod does: It adds a hidden quest to unlock the ancient secrets of the Cursed Camelot. It adds special retextured armor and weapons, a very unique player house, several new followers, and a new horse mount. NOTE: All of the weapons and armor are designed for endgame use. If you get them in the beginning they will seem overpowered. However if you do try to get them early in the game you will be in for one heck of a fight. Please endorse this mod if you enjoy it.\r<br />\r<br />Requirements: This mod requires the Dawngaurd and Dragonborn DLC\r<br />\r<br />Lore: Morgana has returned from the dead driven by her pure hatred of the Pendragon descendant, the Knights of the Round descendants, and her desire for revenge. Since her return she managed to revive Mordred from the dead and placed a frigid curse on Camelot. All in an effort to retrieve Excalibur from its stone where Arthur placed it to prevent the plotters from using the blades awesome power to rule. Mordred managed to steal the key from the Knights of the Round and enter Camelot but the sword can only be retrieved by a living Pendragon. So both Mordred and Morgana have now taken refuge in Greywater Grotto to come up a plan and to locate all possible Pendragon heirs. Can the Dragonborn be the last descendant of the Pendragon family? Can the Dragonborn be strong enough to defeat this evil once and for all?\r<br />\r<br />Before I talk about the weapons and armors, I ApokKnight, would like to thank Avatar1971 for all the help on retexturing the weapons and armors and say that the Armor was inspired by Legion: The Legend of Excalibur. He did a great job, and then he helped me test out all this mess. Thanks Avatar&#33; \r<br />\r<br />Also, if you do not like any enchantments, there are un-enchanted versions of everything inside Camelot&#33; So NO complaining about that, you can enchant it however you want to&#33; Ha-ha\r<br />\r<br />Weapons:\r<br />\r<br />Clarent - a unique enchanted sword stolen from the first Pendragon (Arthur) that Mordred used to kill his king. (Retextured from a dragonbone sword). Now also there is a spell to summon this sword using the restoration school of magic to keep with the knight theme of this mod.\r<br />\r<br />Carnwennan - A unique dagger used by Arthur. (Retextured from a dragonbone dagger)\r<br />\r<br />Excalibur - a unique enchanted great sword that Arthur placed into stone with his dying breath to keep it out of Morgana and Mordred plotting hands (retextured from a dragonbone great sword). Now also there is a spell to summon this sword using the restoration school of magic to keep with the knight theme of this mod.\r<br />\r<br />Armor:\r<br />\r<br />Aegis - A unique enchanted shield (retextured from ebony armor)\r<br />\r<br />Pendragon Armor - A unique enchanted set of armor that Arthur wore (retextured from ebony armor)\r<br />\r<br />Knights of the Round Armor - An un-enchanted set of Pendragon armor for the player and worn by the 3 NPC&#39;s followers. (retextured just like the Pendragon armor)\r<br />\r<br />Knight Ranger Armor - A uniquely enchanted set of Nightingale armor for the light armor folks out there. (This set is not retextured) Warning this armor allows the PC to become invisible until you attack or activate anything like the standard spell. To reset this ability you have to un-equip then re-equip the armor.\r<br />\r<br />Knights of the Round Descendants:\r<br />\r<br />Gwen - She is Guinevere&#39;s descendent and will be a loyal follower. She is also fully marriageable and can be your lover, plus she and Lance will not have an affair on you.\r<br />\r<br />Sir Percy - He is Percival&#39;s descendent and will be a loyal follower. He has taken a vow of celibacy and will not marry.\r<br />\r<br />Lance - He is Lancelot&#39;s descendent and will be a loyal follower. He can be a lover and can be married, and will not be unfaithful either.\r<br />\r<br />Horse Mount:\r<br />\r<br />Hengroen - This was Arthur&#39;s best steed that has risen from the dead to aid the Dragonborn. He is double the speed of normal horses and is invulnerable&#33; Now accidentally falling off a mountain is not an issue as both he and the Dragonborn will live to tell the tale. NOTE if he doesn&#39;t allow you to ride him at first, then you must earn his trust by killing Mordred and Morgana.\r<br />\r<br />Player House:\r<br />\r<br />Cursed Camelot has your crafting needs taken care of and the place looks very unique to say the least...\r<br />\r<br />Cheater Box- Yes for all you cheaters out there, there is a cheater box .esp file you can download. The key to Camelot is inside…And some other super powered surprises for the cheaters out there…\r<br />\r<br />I hope everyone enjoys this mod. I HONESTLY believe that this mod has something for everyone in this mod.\r<br />\r<br />Permissions: Please ask ApokKnight and Avatar1971 before using anything from this mod.\r<br />\r<br />Credits: ApokKnight for the NPC&#39;s, Cursed Camelot House, and Cheat Chest contents, and Avatar1971 for the weapons and armor textures and meshes. Avatar1971 has some other Mods for Skyrim that can be found here:\r<br />\r<br />Gold Dragonbone Weapons and Heavy Armor - http://www.nexusmods.com/skyrim/mods/40206/?\r<br />\r<br />Gold Dragonbone Armor -  http://www.nexusmods.com/skyrim/mods/40379/?\r<br />\r<br />From Avatar1971\r<br />\r<br />I would like to thank ApokKnight for allowing me to work with him on this mod and I hope you all enjoy it. Both of us would like to thank Bethesda for creating Skyrim and allowing us all to mod the heck out of it&#33; I would like to also give a big thanks to Nexus Mods for maintaining this website and supporting the mod community.\r<br />\r<br />There is a book inside Warmaiden&#39;s and The Bannered Mare in Whiterun that explains the situation of Cursed Camelot and where to find Mordred and Morgana (that is also listed in this mods description so you don&#39;t have to read the book). This is an invisible quest and will not have map markers nor will it be listed in your quest journal. You must complete it in order to get the key to Cursed Camelot. Unless you DL the cheat chest to get the key that is.\r<br />\r<br />NOTE both files have the BSA textures and meshes attached to them so there is no need to install both files. Please choose one or the other to install and do not install both files. \r<br />\r<br />Version 1.1 improves the gold textures on the armor making it shine like polished gold.\r<br />Version 1.2 fixed issue with not being able to upgrade all of the armor types.\r<br />Version 1.3 made textures on weapons match armor color. Changed the scabbard from brown leather to black leather to better match armors. NPC&#39;s now wear armor without having to make them equip it and should not have grey faces. Added spells to summon Excalibur and Clarent. Added new item to cheat chest. Fixed noise from Knight Ranger Armor.\r<br />Version 1.4 Adjusted summoned swords to do more damage. Made Morgana more powerful for a tougher fight.\r<br />Version 1.5 Changed spell color for summoned swords to look more holy. Made new armor on Morgana upgradeable.",
  "categoryId": "35",
  "version": "1.5",
  "author": "ApokKnight and Avatar1971",
  "createdUnix": "1388847206",
  "updatedUnix": "1391022738",
  "containsAdultContent": false,
  "uploadedBy": "Avatar1971",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093684",
      "name": "Cursed Camelot with Cheater Box OLD FILE",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30977",
      "fileName": "Cursed Camelot with Cheater Box-49519-1-4.rar",
      "uploadedUnix": "1390811255",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/b33b6798091267d3cd64e04a8a7437c538c1b14d09e87e8e52462b96612771c4/analysis/1407904224/",
      "changelogHtml": " Increased damage to summoned swords. <br/> \n Made Morgana more powerful. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cursed%20Camelot%20with%20Cheater%20Box-49519-1-4.rar?fid=1000093684&ttl=1535830468&ri=8192&rs=8192&setec=6b766360c2e6474100573da2fb1b5658"
    },
    {
      "fileId": "1000093817",
      "name": "Cursed Camelot Old File",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "31115",
      "fileName": "Cursed Camelot-49519-1-4.rar",
      "uploadedUnix": "1390880935",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/0045766925ceff0067844fb7b699b0c47911fba939be9fd28a30664e3dcc5124/analysis/1407905536/",
      "changelogHtml": " Increased damage to summoned swords. <br/> \n Made Morgana more powerful. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cursed%20Camelot-49519-1-4.rar?fid=1000093817&ttl=1535830468&ri=8192&rs=8192&setec=3888fb513070120ba9b4553f6b0c87b8"
    },
    {
      "fileId": "1000094101",
      "name": "Cursed Camelot",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31115",
      "fileName": "Cursed Camelot-49519-1-5.rar",
      "uploadedUnix": "1391022462",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/ce6b3223a99bf00b8daa3209716d2782795fb5df198bc1ede1f405cd07831924/analysis/1407907584/",
      "changelogHtml": " Made armor on Morgana upgradeable. <br/> \n Changed color of summon sword spells from blue to white to look more holy. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cursed%20Camelot-49519-1-5.rar?fid=1000094101&ttl=1535830469&ri=8192&rs=8192&setec=561cad18dcabb3b970aff6c04ccd36d4"
    },
    {
      "fileId": "1000094102",
      "name": "Cursed Camelot with Cheater Box",
      "version": "1.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "30977",
      "fileName": "Cursed Camelot with Cheater Box-49519-1-5.rar",
      "uploadedUnix": "1391022738",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/9c67349c72884e8cf0e96b332929d9b14cf4b133dd1102464661a84da0f0a498/analysis/1407907606/",
      "changelogHtml": " Made armor on Morgana upgradeable. <br/> \n Changed color of summon sword spells from blue to white to look more holy. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cursed%20Camelot%20with%20Cheater%20Box-49519-1-5.rar?fid=1000094102&ttl=1535830470&ri=8192&rs=8192&setec=fd5ce6f2dd5aac96e6ffc3fba742aecc"
    }
  ]
}