{
  "modId": 49510.0,
  "modName": "Warriors Way---A Starter Home for Hardened Adventurers",
  "summary": "Adds a small house north of Dragonsreach, that functions as a decent player home.",
  "descriptionHtml": "This mod is a work in progress. This is the first release, and I am releasing it to gather feedback and ideas. This house features a simple first floor, containing a fireplace, a kitchen, and some simple decor. The second floor, features a living area, with a fireplace some tables chairs and various decor, and the bedroom. It also includes an alchemy workbench, and an enchanting workbench. It is located north of Whiterun, and just past the &#34;Halted Stream Camp&#34;. When you have the mod installed, if you haven&#39;t discovered the location, it will show up on your map, instead of having to hunt it down. Upon arrival at the gate it will be locked and require a key. Right beside the gate there is a hollowed out rock, inside of which is a gate key, and a handful of gold. Once inside, you can approach the house, and see that it is also locked, the key is on top of a barrel next to the door. Also outside there are two, USEFUL horses. They&#39;re ticked as essential, and they have large amounts of stamina, so they are more practical than the vanilla horses. There is also a ton of smithing benches outside (forge, smelter, etc.). I hope you enjoy this home, as it is not very advanced, but it is my first house mod for Skyrim, and I&#39;m working to get better at it. Please leave comments on whether or not I should continue to update this mod, and if so, what would you like to see? Leave it in the comments and enjoy&#33;\r<br />\r<br />***Known Bugs***\r<br />1. The chair upstairs at the front of the table, currently has the wrong animation. **FIXED**\r<br />2. The BIGGEST issue, the horses, are always located in weird spots. There are some images of this in the uploaded images from users tab.\r<br />\r<br />If you notice any other bugs, please let me know, and I will do what I can to work them out&#33;\r<br />\r<br />***(Hopefully) Things to Come***\r<br />1. A custom dog companion named Rebel. Currently working on the scripting for him, however, he isn&#39;t functioning right at the moment, so he isn&#39;t in-mod yet.\r<br />2. A small quest system. This is a huge toss up as I&#39;m A: Not good with papyrus, and B: Not sure I want a quest as a part of it, let me know what you all think&#33;\r<br />3. Hearthfire compatibility. I would like to make this home compatible with Hearthfire so that player can move their families into this home. **UPDATE ON THIS&#33; PLEASE READ THIS** I have been working hard on making this mod Hearthfire compatible, and I AM making progress, but very very little. So, this being said, I&#39;m still working on it, but it&#39;s gonna take longer than expected to get an update out, res assured though, there WILL be an update soon&#33;\r<br />4. Potentially an expansive basement. Would you guys enjoy that? Please let me know about what you think in the comments, I would really like some community driven ideas in this home, as I&#39;m not entirely sure where to go with it.\r<br />\r<br />-Any Ideas?-\r<br />I would like this home mod to be community driven. I would really like the opinions of other modders and players, so please PLEASE, post your idea in the comments, and I&#39;ll see what I can do. I would really appreciate it&#33;\r<br />\r<br />***Installation***\r<br />\r<br />1. Open the .rar archive, you downloaded from the Nexus.\r<br />2. Drag the &#34;StarterHome.esp&#34; and the meshes and textures folders into &#34;C:Program Files (x86)SteamSteamAppscommonSkyrimData&#34; (Or wherever your Skyrim directory is, as long as its in the DATA folder&#33;)\r<br />3. Make sure it&#39;s all done correctly, launch the game, and enjoy&#33;\r<br />\r<br />***CREDITS***\r<br />\r<br />Bethesda: For releasing the Creation Kit to this wonderful mod community. Thank you&#33;\r<br />\r<br />Oaristys: For her wonderful, and highly detailed non-vanilla meshes and textures. She did a wonderful job, and this mod wouldn&#39;t quite be the same without her resource, you can download it here ---&gt;  http://www.nexusmods.com/skyrim/mods/16525/?\r<br />\r<br />Artisanix: For his wonderful lore friendly paintings that decorate the home, he did a wonderful job with them, and you can download his resource here ---&gt;  http://www.nexusmods.com/skyrim/mods/17423/? \r<br />\r<br />supernastypants: For creating the resource containing the files I used for the bookshelves, display cases, and mannequins. If you don&#39;t know who he is, he made the Buildable Home Mod, you can find it here ---&gt;  http://www.nexusmods.com/skyrim/mods/18480/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D18480%26preview%3D&pUp=1\r<br />\r<br />",
  "categoryId": "67",
  "version": "1.1",
  "author": "999333555",
  "createdUnix": "1388814743",
  "updatedUnix": "1388974779",
  "containsAdultContent": false,
  "uploadedBy": "999333555",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089826",
      "name": "Warriors Way Starter Home v1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "152395",
      "fileName": "Warriors Way Starter Home v1_0-49510-1-0.rar",
      "uploadedUnix": "1388814669",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d1a38eda0b8772862056e15306e45c52e4f821696ea1d7808ada40af529578ee/analysis/1407871334/",
      "changelogHtml": " Base mod, nothing fixed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Warriors%20Way%20Starter%20Home%20v1_0-49510-1-0.rar?fid=1000089826&ttl=1535830445&ri=8192&rs=8192&setec=7e3703cfb42ee531dee306a5088c3419"
    },
    {
      "fileId": "1000090120",
      "name": "Warriors Way Starter Home v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "152393",
      "fileName": "Warriors Way Starter Home v1_1-49510-1-1.rar",
      "uploadedUnix": "1388974779",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/83f5aec1e9a08b0e09316d4e5828ce24cbd773bf8e74cb679c7a7e178bc78ec9/analysis/1407874244/",
      "changelogHtml": " Fixed chair animation on upstairs chair to a &#34;both sides&#34; animation. <br/> \n Wall sconces at front door changed to torces (not takeable). <br/> \n Added a candlehorn chandelier in the Armory, as well as wall sconces. <br/> \n Added a chandelier to the bedroom. <br/> \n Added a dynamic lighting effect to the forge outside of the house. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Warriors%20Way%20Starter%20Home%20v1_1-49510-1-1.rar?fid=1000090120&ttl=1535830446&ri=8192&rs=8192&setec=8e97b59a7033bd572af3805d34207616"
    }
  ]
}