{
  "modId": 49530.0,
  "modName": "Valkyrie Followers",
  "summary": "Adds 5 high leveled followers to the game, nothing special except for these are all the followers I created during my play through. So I thought I would share them on your adventures. Must have Apachii skyhair, and apachii skyhair female versions.",
  "descriptionHtml": "VALKYRIE FOLLOWERS\r<br />\r<br />5 followers who pack a punch.\r<br />All followers have a sandbox AI, and stay at current position, so when you dismiss them they will stay where they are, and use the resources around them, as sitting, or using a crafting station... you can keep them in your home, so when you dismiss them their they will stay in your home.\r<br />\r<br />Requirments:\r<br />Apachii SkyHair\r<br />Apachii SkyHair Female\r<br />\r<br />Here are their stories:\r<br />\r<br />Alayna The Vix: \r<br />More and likely the most dominant bandit of all time, but one thing bandits never count on is trust from within their own group. Alayna, betrayed by her once partner Arvel The Swift, followed in pursuit of revenge. Looking for aid by other bandits she was betrayed yet again as Arvel, already gained their confidence. Locked in a cell in Embershard Mine, she vows to fight by your side, in hopes to exact revenge on Arvel.\r<br />\r<br />You will find Alayna in Embershard Mine-in a new cell, her gear will be across from it in the other cell, you need Embershard Mine Key to unlock the cell. One Handed and shield, Level 65, commander voice.\r<br />\r<br />Xelora Duel-Wind:\r<br />Not the type of girl you&#39;d expect adventuring. Brought up as to be a farmer and house wife, Xelora looked up the wonders of the world, and left home, and traveled and studied the arts of combat. She trained with the Whiterun guards, and has been there on duty, but her time is done, and is looking to a new adventure, will it be with you?\r<br />\r<br />Xelora is off duty, at The Drunken Huntsmen, in Whiterun,  She is a Skyforge Axe Duel Wielding vixen who also uses oakflesh because of her duel wielding style, comes with a sultry voice style, that is level 54.\r<br />\r<br />Kyme Spirit-Lifter:\r<br />Known as (K i&#39;m ie)  Looked for peace and tranquility, but instead found a world tearing itself apart, studying the arcane arts, she tries to use her magic to show people the goodness in the world, and though she is an imperial, her devotion to Azura, helps try to keep the balance from light and darkness.\r<br />\r<br />Kyme, was kind of a quick put together, and I put her in the Temple of Kynereth. She will use staffs of calm or courage or frostbite to slow a person down, and allow you or other followers to make the kill. She has a Dark Elf voice though she is an Imperial, and is level 46.\r<br />\r<br />The Sisters:\r<br />Lizzana Warrior-Princess: \r<br />The oldest, a master at destruction and alteration. She will use anything to be successful. Always likes to challenge herself, and joined the Imperial Legion as a mage scout. Her hunting ways have helped her in that field. Much like her sister...\r<br />\r<br />Lizzana is in Sleeping Giant Inn, traveling back from Cyrodil, after her father passed on, she returned to her favorite area to rejoin with her sister. She is a masterful Shield Mage, that has the power of Ebony flesh and shock. Level 72, with an even toned voice type.\r<br />\r<br />Lizzelle Feather-Strike: \r<br />Daddy&#39;s little girl, but one that can shoot the tail feathers off a flying hawk from hundred yards below. That was how she got her name, as a young huntress, and guide, she is very talented in marksmenship, much like Lizzana, she challenges herself, to be the best, and was also trained by Angi, before she exiled herself from Helgen.\r<br />\r<br />Lizzelle is in The Bannered Mare, in Whiterun, who uses her skills in hunting and tracking to help other hunters, and provide food for the inn. She is skill in Archery, level 42 with a Young and Eager voice.\r<br />\r<br />Permissions: you may do what you want after downloading but any publishing of anything must be okayed by me, because their are other peoples work here as well.\r<br />\r<br />BUGS:\r<br />None really, just the fact that I am making this adult, depicting your body mods or not. Plus Alayna may be locked up in the shackle wall when you first meet her, which some can find disturbing.\r<br />\r<br />One side note Lizzana&#39;s and Lizzelle&#39;s hair is may be different colors, this is due to Grace Darkling&#39;s Hair mod. If their hairs have highlights in them, its because these are the textures I used, if not then its okay, but I recommend Grace daklings Dyed hairs mod, they look awesome. If you choose to use a different hair color I suggest using one of her colors, or choose a different hair. So I still wanted to give credit to her and her work.\r<br />\r<br />Editing in the CK:\r<br /> If you want to edit them yourselves, you may do so, I have my own file in which I use other facepaints and attires, but none that are on here, and they work with them. But everything should be on top of the order, as 00Valkyrie, if you use the all tab, or use the character set up. Be sure to use the Cntrl F4 set up so you don&#39;t get the grey head\r<br />\r<br />Check out my other mods:\r<br />\r<br />Hair under Head Gear:\r<br />http://www.nexusmods.com/skyrim/mods/36517/?\r<br />\r<br />Starburst- A player Horse:\r<br />http://www.nexusmods.com/skyrim/mods/48619/?",
  "categoryId": "96",
  "version": "1",
  "author": "Jrew",
  "createdUnix": "1389185430",
  "updatedUnix": "1388863172",
  "containsAdultContent": true,
  "uploadedBy": "Jrew",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089904",
      "name": "Valkyrie Followers",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32",
      "fileName": "Valkyrie Followers-49530-1.rar",
      "uploadedUnix": "1388863172",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/553dfdb259d806f8c9cf7f1c9053ccd54fda5e2f9348021275a5fed44498467d/analysis/1407872106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Valkyrie%20Followers-49530-1.rar?fid=1000089904&ttl=1535830511&ri=8192&rs=8192&setec=c62a4395bc05a4ba1beafa4cbcc9408c"
    }
  ]
}