{
  "modId": 49560.0,
  "modName": "Frozen Mammoth Camp",
  "summary": "Is a camp in Skyrims harshest Climate, the frozen tundra. \r<br />",
  "descriptionHtml": "I really, really like cheese.\r<br />[URL=http://s580.photobucket.com/user/Death811/media/200px-EidarCheeseWheel_zps2865cb1a.png.html][IMG]http://i580.photobucket.com/albums/ss242/Death811/200px-EidarCheeseWheel_zps2865cb1a.png[/IMG][/URL]\r<br />\r<br />http://www.youtube.com/watch?v=AI6mM3an6n4#t=13\r<br />Thank ya&#39; kindly NILLOC916.  MightyBoosh &lt;3 \r<br />\r<br />[b]❄NOW TES5EDIT CLEAN&#33;❄[/b]\r<br />\r<br />[b]❄RE UPLOADED❄[/b]\r<br />So some of you may be asking, Bill. Why did you delete the whole file and not just place this on &#34;Hide Mod&#34;? Well after having two helpful comments about this file needing to be cleaned with the Tes5Edit, I did just that. BUT&#33; It seem&#39;d that there was a more serious problem I oversaw, which is fixed now, thankfully&#33; I didn&#39;t have to do any major changes. But to the point. I just decided to make a clean re upload again.\r<br />\r<br />[b]❄INTRODUCTION❄[/b]\r<br />Frozen Mammoth Camp is something that I&#39;ve been working on in my spare time. I always thought it&#39;d be interesting to have a camp out in Skyrim&#39;s harshest and most unforgivable climate. So after a few cups of coffee, I&#39;m proud to present the nexus with, Frozen Mammoth Camp.\r<br />\r<br />[b]❄DESCRIPTION❄[/b]\r<br />Frozen Mammoth Camp is between Yngvild and a few steps away from The Tower Stone. It&#39;s map marker is also visible and fast traveled enabled. When you arrive you&#39;ll notice that it has a nice walled entrance with a gate. This it to keep out the tundras many unfriendly critters and folks that may try to pay you a visit. As you enter through the gate, you&#39;ll see that I have well placed crafting tables scattered about for the player to use as well as a few safe containers for the player to store his/her&#39;s items in. As you look about, you may notice that you can see Yngvild off in the distance, if you turn around, you&#39;ll see the beautiful Shrine of Azura. Erm, well... Her backside that is. But nonetheless a beautiful view&#33;\r<br />\r<br />[b]❄OUTSIDE CRAFTING TABLES❄[/b]\r<br />Smelter\r<br />Anvil\r<br />Armor Workbench\r<br />Sharpening Wheel\r<br />Alchemy Tabletop\r<br />Tanning Rack\r<br />\r<br />[b]❄THE POORLY CONSTRUCTED HOVEL❄[/b]\r<br />Now, after your nipples are completely frozen hard, I suggest you hop in my horribly constructed hovel&#33; Huzzuh&#33; And a heads up to those who have/use followers, you&#39;ll have to keep them outside. I know, I know. I&#39;m a horrible person because they&#39;ll freeze. BUT&#33; If you&#39;ve downloaded my other abodes, you&#39;ll know that I don&#39;t use followers so I don&#39;t bother navmeshing my interiors. Anyway&#33; Once your inside it&#39;ll be slightly cramped. For some odd reason I believe I have a obsession for only making small, cramped interiors. So, with that out and in the air, let&#39;s continue&#33; You&#39;ll also noticed I&#39;ve cluttered and furnished the inside to attempt to make it feel cozy and warm. 90% of the clutter is decor, just for looks.\r<br />\r<br />[b]❄FURNITURE❄[/b]\r<br />A comfortable, warm, snug bed.\r<br />Cooking Pot\r<br />Book Shelf\r<br />Dresser\r<br />Weapon Rack\r<br />Weapon Plaque\r<br />FoodSack \r<br />Shrine of Arkay\r<br />Chair&Table (It&#39;s slightly wonky, you&#39;ll see when you sit down. Though when in first person, it looks pretty awesome.)\r<br />Strongbox\r<br />\r<br />[b]❄MODS I RECOMMEND TO HAVE A TRULY BRUTAL EXPERIENCE❄[/b]\r<br />[b]❄Frostfall❄[/b] http://www.nexusmods.com/skyrim/mods/11163/?\r<br />[b] ☠Requiem ☠[/b] http://www.nexusmods.com/skyrim/mods/19281/?\r<br />\r<br />[b]❄END❄[/b]\r<br />Thanks for downloading and trying, Frozen Mammoth Camp. If you enjoyed this abode feel free to show your support and endorse it. Also if you have a suggestion or a bug to report, place it in the comments selection or PM me and I&#39;ll reply as soon as possible.",
  "categoryId": "67",
  "version": "1.0",
  "author": "BillNyeTheScienceGuy",
  "createdUnix": "1388916136",
  "updatedUnix": "1388916131",
  "containsAdultContent": false,
  "uploadedBy": "BillNyeTheScienceGuy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089992",
      "name": "Frozen Mammoth Camp",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Frozen Mammoth Camp-49560-1-0.rar",
      "uploadedUnix": "1388916131",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0071255ecec3eb71cd1ffce500c12be917fac6dad7ef4b3d1fefd781ca56ae30/analysis/1407872853/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Frozen%20Mammoth%20Camp-49560-1-0.rar?fid=1000089992&ttl=1535830568&ri=8192&rs=8192&setec=d6bcef0a0600ee0fd572176b83b06d6d"
    }
  ]
}