{
  "modId": 49586.0,
  "modName": "Bandit Empires",
  "summary": "Drink mead, laugh, shout, sing, and fight with the free folk of Skyrim&#33; With fur on your boots, an axe in your hands, and a bounty on your head, take what you want, give nothing back&#33;\r<br />This mod allows you to live outside the law, become a bandit of Skyrim, and lead your own warband of cutthroats and outlaws.",
  "descriptionHtml": "[b][i]You wake up, you eat some bread and cheese. You leave your house, you chop wood for an ungrateful shopkeeper, you mend armour for some self obsessed adventurer, you sweep floors for a nagging wife and you drown your boredom in a flagon of mead in the same seat of the same tavern as yesterday. You stumble home, you eat some bread and some cheese, you sleep.\r<br />\r<br />You wake up. You have no bread or cheese. You leave your house, you spend your coin on food. You bring the food to a nagging wife, you leave again to chop wood for an ungrateful shopkeeper, mend armour for-\r<br />&#34;Do you get to the cloud district often? Oh.. what am I saying, of course you don&#39;t&#34;\r<br />\r<br />The guards want 40 gold. You don&#39;t know what happened but witnesses say you hit a man, you guess that must be true. You haven&#39;t got 40 gold. You&#39;ve got a nagging wife, an ungrateful boss, and an empty belly.\r<br />\r<br />And an axe...\r<br />\r<br />What will it be? [/b][/i]\r<br />\r<br />Live your life free of rules&#33; Out from under the thumb of guards and Jarls, a life of freedom and adventure in the wild&#33; Sink your axe in that fetcher, spill his guts on the floor, grab his purse, and run&#33; Turn your back on thatched roofs and market stalls, drink mead, laugh, shout, sing, and fight with the free folk of Skyrim&#33; With fur on your boots, an axe in your hands, and a bounty on your head, take what you want, give nothing back&#33;\r<br />\r<br />FEATURES:\r<br />This mod allows you to live outside the law, and become a bandit of Skyrim, and lead your own warband of cutthroats and outlaws.\r<br />\r<br />- Recruit bandits to aid you as you plunder and pillage across Skyrim. Unique followers and randomised hirelings are available.\r<br />- Access to merchants, hunters, fences, and skooma dealers, who won&#39;t ask questions about bounty, just that you have the gold.\r<br />- Numerous locations to be overhauled into your own bandit camp (see below).\r<br />\r<br />MAIN FILE:\r<br />This main file contains all NPCs required; loyal bandits, merchants, followers, hirelings, bosses, prisoners, and others in one ESM file. It also contains everything those NPCs require in terms of faction data, items, outfits and weapons.\r<br />All the locations require this main file as their master, they will not work without it&#33; It&#39;s a large file as it contains hundreds of new NPCs all requiring facegen data, without which they&#39;d all have mismatched skin tones, and missing warpaint. It also means any updates to the main ESM will apply to the NPCs in each location. This means you can pick and choose which locations you want to use. Only want Valtheim Towers as your personal camp? Fine&#33; Want to turn Whiterun Hold into your Outlaw Kingdom? Also fine&#33; The only thing required by each individual location esm, is this master file.\r<br />For this mod to do anything in your game however, you require at least one location mod. These are required for the new NPCs to spawn in the areas you choose to download.\r<br />\r<br />The locations will each be uploaded under separate mod pages. This makes it far easier for you and myself, to keep track of updates, changes, and issues with specific locations, as well as the mod&#39;s version number for NMM users.\r<br />\r<br />BANDIT CAMPS:\r<br />Here will be links to each individual location for you to choose from. See the respective mod pages for full details on what each location includes.\r<br />WHITERUN HOLD\r<br />- Valtheim Towers\r<br />- Half Moon Camp [WIP]\r<br />- Halted Stream Camp [WIP]\r<br />\r<br />INSTALLATION:\r<br />\r<br />COMPATIBILITY:\r<br />The main file does not alter anything from the vanilla game. Furthermore the loyal bandits use the same leveled lists for their equipment as regular bandits, any mod affecting this will also apply to the loyal ones, e.g. Cloaks of Skyrim, Frostfall, Immersive Armor.\r<br />I may make some additional addons to make use of the DLCs, or certain other mods resources, e.g. equiping unique followers with specific armours. Again addons specific to certain locations will be included in their own mod pages. I may also provide a version allowing use of the new bandits added by OBIS.\r<br />Possible conflicts with the actual locations will be listed in their respective pages.\r<br />\r<br />TROUBLESHOOTING:\r<br />I&#39;ve tested extensively, but i&#39;m only one man&#33; Version 1.0 is likely going to contain bugs and other issues, so please feel free to report them in the comments and I can take a look into it, especially regarding the NPCs themselves, their behavior etc. Anything pertaining to the locations specifically should be reported in those respective mod pages. \r<br />\r<br />CREDITS:\r<br />\r<br />PERMISSIONS:",
  "categoryId": "25",
  "version": "1.0",
  "author": "Ain0nline",
  "createdUnix": "1388974148",
  "updatedUnix": "1388974148",
  "containsAdultContent": false,
  "uploadedBy": "Ainulindale",
  "primaryFile": null,
  "files": []
}