{
  "modId": 49592.0,
  "modName": "Faction Amulets",
  "summary": "A small mod that adds Faction amulets.",
  "descriptionHtml": "***** NOW with Imperial/Stormcloak Amulets.  Intermittent Update, the BETA release will be pushed back a bit as a change I made completely borked things over, and I&#39;ve got to hunt down where I screwed it up.  My apologies. *****\r<br />\r<br />Have you ever wanted to just breeze through a Draugr-infested dungeon just to get that one item or word wall you need to find?  Need to get that piece of Mehrunes&#39; Razor, but the Hagraven is just beating you all over the place, and the Forsworn are smacking you around at the same time?  Want to investigate that interesting cave, but tired of having to hack through 50+ vampires?\r<br />\r<br />THIS mod aims to fix that&#33;\r<br />\r<br />What the mod does is simple (for the most part).  It adds several amulets and rings to the game.  These amulets and rings will dynamically add you to a specific faction while worn.  When removed, it dynamically removes you from that faction.  \r<br />\r<br />This is my method of getting around dialogue bugs when you manually add the player character to a faction.\r<br />\r<br />Example: Male Orc, added to the Bandit faction manually, runs up to an NPC, and says &#34;I&#39;m gonna slit your belly like an old woman&#39;s purse&#33;&#34;.  Not what we were going for.\r<br />\r<br />Example: Female Nord, added to the Forsworn faction manually, shouting &#34;For the Reach&#33;&#34; when attacking.  Again, not quite what we were going for.\r<br />\r<br />The factions that these amulets give you are factions that are &#34;non-player factions&#34;, meaning they are factions that you cannot join by completing a quest/sidequest, or as a result of doing favors for others.\r<br />\r<br />*** What does equipping them actually DO? ***\r<br />As mentioned above, they dynamically add you to certain factions.  When in these factions, you have the option to converse with them (yes, even draugr), but since most of them have no dialogue, you won&#39;t get a menu.  They will ignore your existence, or if they do see you, won&#39;t bother attacking you, but just stand and wander about.\r<br />\r<br />They won&#39;t even turn on you if you kill one of them right in front of the others.  Naturally, this makes it easier to get through various dungeons and areas, and can kind of be considered &#34;easy mode&#34; for Skyrim.  A faction&#39;s allies also treat you like this, so for example, with the &#34;Amulet of the Forsworn&#34; equipped, Hagravens will not attack you.\r<br />\r<br />Example: \r<br />[spoiler]\r<br />Running through &#34;The Heart of Dibella&#34; quest, you have to go and recover a young girl named Fjotra, and bring her back to the Temple of Dibella in Markarth.  If you equip the &#34;Amulet of the Forsworn&#34;, you can literally walk in, go through the entire keep, either pick the lock, or kill the guard in the last room with the key, talk to Fjotra, and walk out right past all those Forsworn without having to draw your blade a single time (except for killing the guy with the key, if you&#39;re not thief-inclined).\r<br />[/spoiler]\r<br />\r<br />*** So what factions will this mod allow me to &#34;buddy up&#34; with? ***\r<br />\r<br />There are 10 factions that this mod will allow you to join temporarily.  The first 8 were present in Version 2.0.\r<br />\r<br />Forsworn (Adds you to ForswornFaction, which is friendly with HagravenFaction)\r<br />Bandit (Adds you to BanditAllyFaction, most bandits will ignore your presence.)\r<br />Draugr (Adds you to DraugrAllyFaction, most undead/skeletons will ignore your presence)\r<br />Warlock (Adds you to WarlockAllyfaction, most sorcerers/necromancers will ignore your presence)\r<br />Vampire (Adds you to VampireFaction, most vampires will ignore your presence. **DOES NOT WORK WITH DAWNGUARD FACTIONS**)\r<br />Silver Hand (Adds you to a custom SilverHand faction. Silver Hand members are friendly, Companions are all considered enemies. This can easily break the Companions quests if you are doing them with it equipped, as all of my tests resulted in my Companion follower (Farkas) turning hostile. So, don&#39;t wear it if you&#39;re doing Companions Quests.)\r<br />Thalmor (Adds you to ThalmorFaction, you can walk around the Thalmor Embassy and related areas without being stopped at all.)\r<br />Guard (Adds you to a custom GuardFaction that has all hold guards as &#34;Friend&#34;, so they won&#39;t collar you for trespassing in their barracks, not sure about crime yet, preliminary tests indicate that small crimes they won&#39;t bother you for.)\r<br />Imperial Legion (Adds you to CWImperialFaction, which from tests will let you walk around in other holds if you support the others, affects some NPC&#39;s reactions to you.1)\r<br />Stormcloak (Adds you to CWSonsFaction, same as above, except for Stormcloaks.)\r<br />\r<br />SPECIAL NOTE: After testing, The Imperial Legion and Stormcloak Amulets actually work with CWO&#39;s Greasers Vs. Jocks, preventing you from being attacked by the opposing side. \r<br />\r<br />*COMING SOON*\r<br />Amulet/Ring of World Peace - Adds you to ALL factions this mod covers at the same time.\r<br />Adding universal bounty in all holds while wearing the Bandit Amulet.\r<br />Adds very large (2000+) bounty in The Reach while wearing the Forsworn Amulet.\r<br />Amulet of World Hatred - Adds you to a special faction that is an enemy with EVERY (and I do mean EVERY) faction.  Nowhere you will go, if there is somebody there, will you be safe.  But this will require extensive testing, and won&#39;t work with mods added by various New Land mods, unless I make a version that has it as a requirement.  If there is interest in this, I will work on it.\r<br />\r<br />*** Each of them says at the end, &#34;Seems to boost other things/other Abilities as well....&#34; ***\r<br />\r<br />I have added custom enchantments to each Amulet to make it kind of more suited for what you would *conceivably* be doing as a member of that Faction.  The way the CK works is each effect has a Magnitude.  I setup a limit of 300 points to be spread among the magnitude for each ability I gave it.  In addition, now ALL amulets can be disenchanted. (Rings cannot be, as they have the same enchantments, and it would be pointless.)\r<br />\r<br />Bandit Amulet/Ring - Speechcraft +75, Light Armor +75, Pickpocket +50, Lockpicking +50, Sneak +50\r<br />Warlock Amulet/Ring - All Schools of Magic +50, Magicka +50\r<br />Draugr Amulet/Ring - Magicka +100, Destruction +50, Conjuration +50, Regenerate Magicka +100\r<br />Guard Amulet/Ring - Health, Heavy Armor, Light Armor all +100\r<br />Forsworn Amulet/Ring - Marksman +50, Light Armor +75, Health +100, One-Handed +75\r<br />Silver Hand Amulet/Ring - Speechcraft +50, Light Armor +75, One-handed +100, Restoration +75\r<br />Thalmor Amulet/Ring - Illusion +75, Speechcraft +125, Destruction +100   \r<br />Vampire Amulet/Ring - Vampire Fortify Dmg Resist +75, Fortify Health +125, Carry Weight +100\r<br />\r<br />The next 2 have a total of 425 magnitude, and that was me throwing a bone to the players who wanted \r<br />to disenchant them.\r<br />\r<br />Imperial Amulet - Fortify Two-Handed +75, Fortify Heavy Armor +150, Carry Weight +200\r<br />Stormcloak Amulet - Fortify One-Handed +75, Fortify Light Armor +150, Carry Weight +200\r<br />\r<br />If you&#39;ve disenchanted them, the enchantments are named as follows:\r<br />Bandit - Bandit&#39;s Guile\r<br />Draugr - Draugr&#39;s Infestation\r<br />Guard - Guard Power\r<br />Forsworn - Forsworn Blessing\r<br />Imperial - Legion&#39;s Strength\r<br />Stormcloak - Stormcloak&#39;s Cunning\r<br />Thalmor - Thalmor&#39;s Betrayal\r<br />Vampire - Vampire&#39;s Strength\r<br />Warlock - Warlock&#39;s Intelligence\r<br />\r<br />*** Okay, I&#39;m sold&#33;  I want to give this mod a try, what do I do next? ***\r<br />\r<br />Install the mod.  If you&#39;re using 2.0, this is a pretty painless update, and is safe to download, and when you enable it, it&#39;ll ask you if it&#39;s an update, and tell it yes.\r<br />\r<br />**** Installing using NMM ****\r<br />Click &#34;Download (NMM)&#34; at the top of the screen.  The mod is setup to put the files in the right places.\r<br />\r<br />**** Installing Manually ****\r<br />Extract the contents of the file to your Skyrim Data Directory in the following places:\r<br />\r<br />In the Skyrim data directory, you need to put the acpAmulets.esp file.\r<br />In the scripts directory, you need to put acpEquipFaction.pex, and acpEquipMultipleFaction,pex files.\r<br />In the scriptsSource directory, you need to put acpEquipFaction.psc and acpEquipMultipleFaction.psc files.\r<br />\r<br />\r<br />**** Getting the Items in Game ****\r<br />There are 3 methods.  \r<br />\r<br />1) Craft them&#33;  Each Amulet requires Silver Ore, as well as other items that kind of make sense, based on what the faction is. To craft these items (since they are enchanted), you need to have the Arcane Blacksmithing perk.  The Imperial and Stormcloak Amulets are NOT craftable.\r<br />\r<br />All amulets require 1 silver ore, and 1 filled common soul gem.\r<br />All rings require 1 silver ore, 1 filled common soul gem, and 1 regular amethyst.\r<br />\r<br />The additional list of items you need for each is:\r<br />Name      Amulet            \r<br />----------------------------------------\r<br />Bandit   10 Gold\r<br />\r<br />Draugr   5 Bone Meal\r<br />\r<br />Forsworn   2 Hagraven Claw\r<br />      3 Hagraven Feathers\r<br />\r<br />Guard   250 Gold\r<br />\r<br />Silver Hand   1 Werewolf Pelt\r<br />\r<br />Thalmor   5 Elves Ear\r<br />\r<br />Vampire   5 Vampire Dust\r<br />\r<br />Warlock   1 Ectoplasm\r<br />      1 Fire Salts\r<br />      1 Frost Salts\r<br />      1 Void Salts\r<br />      1 Glow Dust\r<br />\r<br />2) Find the Faction Chest&#33;  There is a chest, hidden in almost plain sight.  It is located within Dragonsreach, in a publicly accessible area.  It&#39;s a large chest.  The chest is named &#34;Faction Items (You Cheater&#33;) :D&#34;  It is set to player ownership, so taking the items should not count as stealing.   However, this chest now respawns, so it is NOT safe for use as player storage.  [b]Thank you to those who brought the chest ownership thing to my attention&#33;[/b]\r<br />\r<br />3) The biggest cheat method: Use the Console&#33;  Open the console, and type help &#34;amulet of the&#34; 4, and press enter it will display the IDs of each item.  Then, you simply type player.additem &lt;id&gt; 1, and it will add that item to your inventory.  \r<br />\r<br />You do the same with &#34;Ring of the&#34;, and add them as well.\r<br />\r<br />**** Removing the Mod &#33;&#33;&#33;&#33; IMPORTANT &#33;&#33;&#33;&#33; ****\r<br />Make sure you have removed any of these amulets from your inventory before uninstalling, to avoid any potential issues.  \r<br />\r<br />Use the player.removeitem &lt;id&gt; command to make sure all of them are removed.\r<br />\r<br />**** Removing using NMM ****\r<br />Double-click the mod to deactivate it.\r<br />Delete the mod afterwards.\r<br />\r<br />**** Removing Manually ****\r<br />Delete acpAmulets.esp in the Data folder, acpEquipFaction.pex and acpEquipMultipleFaction.pex from Datascripts, and acpEquipFaction.psc and acpEquipMultipleFaction.psc from DatascriptsSource.\r<br />\r<br />Change Log:\r<br />1.0 - Initial Release\r<br />2.0 - Version 2.0\r<br /> - Changed the name of the scripts that affect the amulets/rings.\r<br /> - Added new factions.  In Vanilla gameplay, these work just fine, mods that modify factions may cause issues (I can&#39;t\r<br />   test with every mod out there that changes factions.  If you find one that is majorly incompatible, let me know,\r<br />   and I will try to address and fix it.)\r<br /> - Added versions of the amulets as rings. (So you can be allied with Draugr and Bandits at the same time, for example.)\r<br /> - Added enchantments to ALL amulets/rings, based on what I felt their major skills were.\r<br /> - Removed the ability to disenchant any of the amulets.\r<br /> - All amulets/rings have a total point value of bonuses capping at 300.\r<br />\r<br />2.25 - Newest Version\r<br />- Added amulets for Imperial and Stormcloak factions.\r<br />- Added the enchantments for a few items that were missing them.\r<br />- *IMPORTANT* Enabled disenchanting of all amulets.  Disenchanting rings is pointless, as they are the same enchantments.",
  "categoryId": "60",
  "version": "2.25",
  "author": "ACAkutare",
  "createdUnix": "1388994566",
  "updatedUnix": "1409457623",
  "containsAdultContent": false,
  "uploadedBy": "ACAkutare",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090157",
      "name": "Faction_Amulets_1_dot_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "917",
      "fileName": "Faction-Amulets-1-dot-0-49592-1-0.7z",
      "uploadedUnix": "1388994535",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d23ea1edb6ad3d9208ac167ee73201a2934dc2c557f2cc0345149dd6b45afe5b/analysis/1407874485/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Faction-Amulets-1-dot-0-49592-1-0.7z?fid=1000090157&ttl=1535830618&ri=8192&rs=8192&setec=9479508aeac0c4c51e78a345c8b5f716"
    },
    {
      "fileId": "1000102766",
      "name": "Faction_Amulets_2_dot_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Faction_Amulets_2_dot_0-49592-2-0.7z",
      "uploadedUnix": "1396038000",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a407c4080bc08fa03429151993425854a9989e37b67eb2bba276b6e0a4a70bca/analysis/1407998470/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Faction_Amulets_2_dot_0-49592-2-0.7z?fid=1000102766&ttl=1535830618&ri=8192&rs=8192&setec=b563ff1537c34ddc167817bbb276b3dc"
    },
    {
      "fileId": "1000124628",
      "name": "Faction Amulets 2.25",
      "version": "2.25",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Faction Amulets 2.25-49592-2-25.7z",
      "uploadedUnix": "1409457623",
      "modVersion": "2.25",
      "virusScanUrl": "https://www.virustotal.com/file/8cc1675f2a72fc2b1576d05df22157ca72fa96f45c5b74a43e2dc10f56cfbdfd/analysis/1409457721/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Faction%20Amulets%202.25-49592-2-25.7z?fid=1000124628&ttl=1535830619&ri=8192&rs=8192&setec=5305f0ef36ca9e69340f40a24d513c84"
    }
  ]
}