{
  "modId": 49608.0,
  "modName": "Pauldrons and Greaves WIP",
  "summary": "A mod which adds Pauldrons and Greaves to the game",
  "descriptionHtml": "Remember when in Morrowind you could have differing pauldrons? And how shocked you were when you discovered greaves were not in Skyrim? Well grief no longer&#33; This mod aims to bring it all back&#33; No longer will you be forced to wear one piece suits&#33; No longer will you be forced to download tons of armour mods just to get some variation&#33; No longer will your character look so stale and plain&#33; Because now, you can truly design your character and feel awesome with your own customized set of armour&#33;\r<br />\r<br />Overview:\r<br />\r<br />Adds new greaves, cuirasses and pauldrons.\r<br />\r<br />Vanilla chest armour will take up greaves, cuirass and both pauldron slots. \r<br />Robes and clothes will only use up cuirass slots. (Dat Battlemage look&#33;)\r<br />Pauldrons can differ and be worn without a cuirass. (Dat Gladiator look&#33;)\r<br />\r<br />They are both craftable and temperable.\r<br />Both unenchanted and enchanted versions can be found.\r<br />\r<br />Additional Features:\r<br />There are sliders to adjust the weight of the armour in the SkyProc patcher.\r<br />There are sliders to adjust the tempering and armour rating of armour in an MCM menu.\r<br />\r<br />Optional, but required for the MCM menue:\r<br />SKSE 1.6.13 or higher\r<br />SkyUI 3.4 or higher\r<br />\r<br />\r<br />\r<br />Help finish the project:\r<br />The cuirass meshes came from Topvman so they still have pauldrons attached to them (however, you can place other pauldrons on top of them). If a modeler could so kindly remove them it would be very appreciated.\r<br />Any help will be appropriately credited of course.\r<br />\r<br />If you plan on wearing a cuirass without any type of greaves, your legs will disappear unless you add the &#34;wearable legs&#34; item through console commands and equip it.\r<br />So if someone could also fix that, it would also be appreciated and credited. \r<br />",
  "categoryId": "54",
  "version": "0.3",
  "author": "Mopel",
  "createdUnix": "1389036976",
  "updatedUnix": "1389036775",
  "containsAdultContent": false,
  "uploadedBy": "Mopel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090220",
      "name": "Pauldrons And Greaves",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16291",
      "fileName": "Pauldrons And Greaves-49608-0-3.rar",
      "uploadedUnix": "1389036775",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/d311ff24a3a029136d974e054ecaeb134ac0ca1bebdbb9994ee652b48e38fcb8/analysis/1407875074/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pauldrons%20And%20Greaves-49608-0-3.rar?fid=1000090220&ttl=1535830649&ri=8192&rs=8192&setec=23e83d98e8d27ab0badeb949c0cf0ee8"
    }
  ]
}