{
  "modId": 49616.0,
  "modName": "Guards of the Hold",
  "summary": "REPLACES all guard armour in all nine holds with meshes imported from The Witcher II (custom, lore-friendly textures)",
  "descriptionHtml": "\r<br />***09/09/2016: Thank you everyone who supported this mod. I&#39;m sorry I haven&#39;t been actively replying to your comments. If in doubt, read the FAQs and check you load orders or check the comment replies on the Steam Guards of the Hold pages***\r<br />\r<br />\r<br />\r<br />This is a lore-friendly mod which REPLACES all Guard armour in all nine holds with models imported from The Witcher II.\r<br />\r<br />AS A REPLACER THIS FILE WILL WORK BEST WITH A NEW GAME. \r<br />\r<br />*************************\r<br />UPDATE: This mod is now available on Steam, broken down into individual holds (with no scripting)&#33;\r<br />\r<br />UPDATE: Apologies, I have been very bad at keeping track of questions about this mod. Thank you to everyone who has stuck with it&#33;\r<br />\r<br />*************************\r<br />\r<br />Guards were quite short-changed in Vanilla, basically being given Stormcloak armour with different colours. Not the best if you&#39;re a guard facing down a Stormcloak charge and get mistaken for the wrong side... This mod creates a unique look for each hold, based on its prosperity and history. Solitude guards swan around in expensive half plate and ceremonial helms, whilst Morthel guards must make do with old maille and battered roundshields.\r<br />\r<br />All guard armour is CRAFTABLE. However, before you can craft it, you have to find old discarded versions of each hold&#39;s cuirass. CLUE: check the barracks&#39; and guard houses in each hold. This will unlock all crafting for that hold. Some require unlocks and the more expensive armours require ADVANCED SMITHING.\r<br />\r<br />Example images of some holds are on the images tab, but the remaining guards I leave to you to see for yourselves ;)\r<br />\r<br />Solitude: Full (bodyguard only) or half plate, ceremonial helmet, pavise shield, ADVANCED SMITHING\r<br />Markarth: Half plate, pavise shield, ADVANCED SMITHING (not for helmet)\r<br />\r<br />Remaining helmets: STEEL SMITHING\r<br />\r<br />Riften: Maille and gambeson, pavise shield, blackened helm, IRON SMITHING\r<br />Whiterun: Maille and gambeson, pavise shield, IRON SMITHING\r<br />Windhelm: Maille and gambeson, pavise shield, IRON SMITHING\r<br />Falkreath: Maille and gambeson, round shield, IRON SMITHING\r<br />Dawnstar: Maille and gambeson, round shield, IRON SMITHING\r<br />\r<br />Winterhold: Old maille, kite shield, IRON SMITHING\r<br />Morthal: Old maille, round shield, IRON SMITHING\r<br />\r<br />_________________________________________________________________________ \r<br />\r<br />Installation: \r<br />\r<br />Download with NMM or:\r<br />\r<br />Download the .esp and .bsa files and place in your Skyrim/Data folder. Activate the .esp file in your Data Files option on the load screen.\r<br />\r<br />_________________________________________________________________________ \r<br />\r<br />Comments: \r<br />\r<br />Does NOT require any DLC. \r<br />\r<br />As it is only a replacer, this mod is compatible with all mods which affect the Guard faction (e.g. More War in the Wild), save for other replacers.\r<br />\r<br />Suggest that this is placed near the END of your load order.\r<br />\r<br />Equipment has been made slightly stronger and more expensive to compensate for its more robust construction. Guards are now not to be trifled with, especially so where they can afford better kit&#33;\r<br />\r<br />Designed to complement my &#34;Rebirth of an Empire&#34; and &#34;The Stormcloak Rebellion&#34; mods on Steam.\r<br />\r<br />_________________________________________________________________________ \r<br />\r<br />Credit to: \r<br />\r<br />LordOfWar - TW2 imports (nexus: http://www.nexusmods.com/skyrim/mods/5588/) \r<br />TH3WICK3D1 - TW2 imports (nexus: http://www.nexusmods.com/skyrim/mods/7807/)",
  "categoryId": "54",
  "version": "1.00",
  "author": "Becheman",
  "createdUnix": "1389312159",
  "updatedUnix": "1389264158",
  "containsAdultContent": false,
  "uploadedBy": "Becheman121",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090589",
      "name": "Becheman_Guards",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "139500",
      "fileName": "Becheman_Guards-49616-1-00.zip",
      "uploadedUnix": "1389264158",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/7ba4903d92adef75fcab0597418ce9058488b7727add827f41942ce29b936330/analysis/1407878843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Becheman_Guards-49616-1-00.zip?fid=1000090589&ttl=1535830675&ri=8192&rs=8192&setec=c8a4a7f1326d13a6e6a5f2cc2a109f3a"
    }
  ]
}