{
  "modId": 4963.0,
  "modName": "Skyrim Rebalanced",
  "summary": "A growing mod compilation designed to balance and improve Skyrim!",
  "descriptionHtml": "[b][size=5]Skyrim Rebalanced[/size][/b]\r\n\r\nSkyrim Rebalanced aims to provide an improved, more balanced, and altogether more fun Skyrim experience.\r\n\r\nThis is not a single mod but rather a collection of individual mods. Most of them are my own.\r\n\r\n[color=red]If you check the permissions for \\\"Balanced Magic\\\", it states that the author gives permission for his file to be reused in other mods provided he is given credit for his work.\r\nPermission for Deadly Dragons was given via the comments board for that file.[/color]\r\n\r\nSkyrim Rebalanced is not all or nothing. All the mods are separate in the file that you download, so that you can pick and choose which plug-ins to use.\r\n\r\n-Balanced Magic (by mysty)\r\n-Better Bound Weapons\r\n-Better Weapon Enchantments\r\n-Deadly Dragons (by 3jiou)\r\n-Falmer Shield Fix\r\n-Werewolves Rebalanced\r\n\r\n[b][size=4]The Mods[/size][/b]\r\n\r\n[u][size=3]Better Weapon Enchantments[/size][/u]\r\n\r\nThis mod has two versions.\r\n\r\n[u]\\\"20\\\" version V2[/u]\r\n-Increases all destruction enchantment effects for weapons by 20%\r\n-Except for \\\"damage stamina\\\" effects, which are increased by 50%\r\n-All weapon charge capacities have been increased by 20% as well, because a greater effect uses more charge. \r\n                        -If you want weapons to keep their original charge caps anyway, download V1.\r\n\r\n[u]\\\"50\\\" version[/u]\r\n-Increases all destruction enchantment effects for weapons by 50%\r\n-Except for \\\"damage stamina\\\" effects, which are increased by 100%\r\n\r\nCustom weapons may not be affected by this mod.\r\n\r\n[u][size=3]Werewolves Rebalanced[/size][/u]\r\n\r\nThis mod provides three options for rebalancing werewolves in skyrim.\r\n\r\n1. Weaker Werewolves: howling makes enemies level 15 or lower flee, instead of 25 and lower.\r\n\r\n2. Stronger Werewolves: hand-to-hand (claws) damage bonus increased by ~50%.\r\n\r\n3. Combination: included effects of both of the other versions in one plug-in\r\n\r\n[u][size=3]Better Bound Weapons[/size][/u]\r\n\r\nThis mod is designed to make bound weapons more powerful. It has three versions:\r\n\r\n1. Stronger bound weapons, with no other balancing effects.\r\n\r\n2. Stronger bound weapons, but bound weapons spells cost 50% more magicka to compensate.\r\n\r\n3. Stronger bound weapons, but bound weapons last only 2/3 as long to compensate.\r\n\r\n[u][size=3]Falmer Shield Fix[/size][/u]\r\n\r\nThis just adjusts the Falmer shield to make it more realistic.\r\n\r\nIt weighs less, but also provides less protection. I though this\r\nfit better with its classification as light armor.\r\n\r\n[u][size=3]Balanced Magic[/size][/u]\r\n\r\nThis is NOT MY MOD. This is a popular mod made by mysty. \r\n\r\n--from file README\r\n\r\nThis mod is intended to make pure mages a force to be reckoned with in battle. While melee fighters get increased damage as they improve their primary offensive skill, mages simply get reduced casting cost. When you consider the options to improve weapons via smithing, enchanting, and poisons - heavily armored warriors are far outclassing squishy mages in damage. Dual wielding melee fighters with power attacks and rogues with sneak attacks have a major offensive advantage. Additionally, pure mages must use their magicka for both offensive and defensive skills, meaning that many of the master level spells can be prohibitively expensive without enchanting all gear for reduced magicka cost. Since pure mages don\\'t have enchantable weapons, there is less gear to enchant, and I believe the player should be able to diversify their enchantments without losing the ability to deal reasonable high end damage.\r\n\r\nThis mod attempts to address these issues without making Mages overpowered.\r\n\r\n[u][size=3]Deadly Dragons[/size][/u]\r\n\r\nThis is NOT MY MOD. This is a popular mod made by 3Jiou. \r\n\r\n--from mod page\r\n\r\nDeadly Dragons is a mod that aims to improve Skyrim\\'s dragons fights. This mod is created for people who wish to increase the challenge provided by dragons fights. Main goal of the mod is to make dragons true to their power in lore. If a giant or a group of 3-4 bandits can take down a dragon, then there\\'s no need for dragonborn.\r\n\r\nInstalling this mod you agree to participate in epic challenging battles with dragons. DD will provide you a great challenge where your strength, knowledge, wits and how cunning you are will decide if you survive the battle or be forgotten in the annals of Elder Scrolls. Utilize every skill and item at your disposal to survive the battle, feel the power and glory that you are the one and only in the Elder Scrolls world, who can survive dragon battle and kill the mighty beasts of legends.\r\n\r\n-- also Includes higher quality textures for dragons.\r\n\r\n[b][size=4]Future Plans[/size][/b]\r\n\r\nOnce the creation kit is released, I will make more extensive mods to rebalance NPCs and creatures. My immediate plans are a mod to rebalance the Falmer (to make them do a bit less damage) and to add balancing mods for shouts.",
  "categoryId": "24",
  "version": "0.9",
  "author": "Pocoloon-Bulljump",
  "createdUnix": "1325303492",
  "updatedUnix": "1325347203",
  "containsAdultContent": false,
  "uploadedBy": "Pocoloon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15318",
      "name": "SKYRIM REBALANCED",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28",
      "fileName": "SKYRIM REBALANCED-4963.rar",
      "uploadedUnix": "1325304804",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/89156985eb790f3b3e9a71bb504849d0ce8c16e7e5c9c83957fce002b2b8b6d5/analysis/1406572504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SKYRIM%20REBALANCED-4963.rar?fid=15318&ttl=1535761346&ri=8192&rs=8192&setec=c18277769867dd0fb3ea51f1cb42bbf9"
    },
    {
      "fileId": "15423",
      "name": "SKYRIM REBALANCED v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18639",
      "fileName": "SKYRIM REBALANCED v1-4963-1-0.rar",
      "uploadedUnix": "1325347203",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/485edcb91fd238203b2a35e9f1be05409553b9b446ab70e6521362b5cbc84dcb/analysis/1406573133/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SKYRIM%20REBALANCED%20v1-4963-1-0.rar?fid=15423&ttl=1535761347&ri=8192&rs=8192&setec=3e64d62a3f0393e0fcd9f90a1f112b49"
    }
  ]
}