{
  "modId": 49654.0,
  "modName": "Dark Maneuvers - Harkon shield  Undead Lords and more",
  "summary": "The vanilla Vampire Lord is a bit clumsy and predictable. He can&#39;t be compared to the creatures of the night from classic horror stories. If you want to become a true nightmare, this mod is for you. This project aims to make the Vampire Lord form more valuable for the player.",
  "descriptionHtml": "Review thanks to Brodual\r<br />[youtube]Ab6oX5kufSo[/youtube]\r<br />\r<br />The final trailer:\r<br />[youtube]KXm3Sfod8UI[/youtube]\r<br />\r<br />The vanilla Vampire Lord is a bit clumsy and predictable. He can&#39;t be compared to the creatures of the night from classic horror stories. I tried to fix this without making VL too overpowered. If you want to become a true nightmare, this mod is for you. This project aims to make the Vampire Lord form more valuable for the player.\r<br />\r<br />[b][color=red][size=3]This is NOT a “minor” change[/size][/color]\r<br />\r<br />This mod took several months to make. It provides a a completely new system, a new gameplay[/b]\r<br />\r<br />Pay for using the spells with the blood of your enemies.  [b][color=red]Each ability is unique and designed from the scratch.[/color][/b] You won’t find ANY of these in other mods.\r<br />\r<br />[b][color=yellow][size=3]Designed to be compatible with almost ALL OTHER vampire mods[/size][/color][/b]\r<br />\r<br />[b][u]IMPORTANT&#33;[/u] Not compatible with Vampiric Thirst by default&#33;\r<br />Use the following patch:\r<br />[url=http://www.nexusmods.com/skyrim/mods/63373/?]http://www.nexusmods.com/skyrim/mods/63373/?[/url]\r<br />\r<br />[/b]\r<br />YES, it works fine with [color=yellow]MIV, Royal Bloodline, Better Vampires[/color], etc… you name it. Doesn&#39;t change the vanilla scripts or perks (just the transformation spells are affected).\r<br />\r<br />\r<br />\r<br />[b][color=yellow]Respect to balance.[/color][/b] Each ability has it flaws. [b]This mod will NOT make your life easier in ANY way.[/b] Instead, It provides additional opportunities to  survive the most dangerous battles. There will be no new direct attack spells in this mod. This project focuses mostly on protection and maneuvers.\r<br />\r<br />[b]NO SKSE[/b] or other script extenders are required for this plugin.\r<br />\r<br />[color=yellow][b]Installing and Uninstalling. “OMG, no, no, no. I’m too scared of installing the scripted mods, because there is no proper way to uninstall it in the future, scripts will be forever baked in my savegame”[/b][/color]\r<br />\r<br />I can understand your paranoia, but this is NOT true. As you know, I have [url=http://www.nexusmods.com/skyrim/mods/31675/?]a lot of experience[/url] in this subject. Scripts are NOT stored in the savegame for no reason, there always should be some kind of dependency. Good programming practices, assertions, safety counters, safety conditions can reduce the risk of occuring some unresolvable dependencies which can affect your savegame in a negative way. None of my mods ever caused save game bloat.\r<br />\r<br />\r<br />[color=yellow][size=5][b]So, how to play with this?[/b][/size][/color]\r<br />\r<br />[b]YOU MUST EARN ALL THE VAMPIRE LORD PERKS FIRST[/b]\r<br />If you have all the perks, you will continue to use the consumed blood, but in another way. Each time the Vampire Lord feeds on the enemy, the Blood level increases. With non-zero blood level you are able to get access to advanced abilities. \r<br />\r<br />[b]Close combat Bite[/b]: +10 points \r<br />[b]Drain Life[/b]: +1 point \r<br />[b]Consume blood while sprinting in Darkness (if success)[/b]: Points depends on the enemy level \r<br />You are unable to raise your blood level in human form. You blood level is shown on feeding or in transformation.\r<br />\r<br />Again, in short:\r<br />You gain blood (each time you feed in the VL form)\r<br />You spend blood (each time you cast a spell)\r<br />Or... You keep blood and have cool passive abilities\r<br />\r<br />[b][color=yellow]Here are the abilities:[/color][/b]\r<br />\r<br />[color=red][b][size=4]Mass Telekinesis[/size][/b][/color]\r<br />\r<br />\r<br />\r<br />Launch random garbage into the air and &#34;freeze&#34; it with your mind\r<br />\r<br />Note: You must &#34;know&#34; the object in order to &#34;grab&#34; it. To study objects, use [b]&#34;Attract Shape&#34;. \r<br />[/b]Always use single hand for the Attract Shape\r<br />1) Right hand - remember the object\r<br />2) Left hand - forget the object\r<br />\r<br />It can serve as another layer of protection from different projectiles or as a barricade to block your enemies\r<br />\r<br />Stages:\r<br />1. Use full magicka to select random height. Or you can spend some magicka to specify the exact target height at which items will be located in the end. Height is relevant to the player.\r<br />\r<br />LOW magicka percentage - HIGH border.\r<br />HIGH magicka percentage - LOW border\r<br />\r<br />2. Blood Magic Mode, Magic is drawn. Cast the spell\r<br />3. Don&#39;t run, wait until you grab enough items. Pay attention to the magic percentage. Spend magic to keep the exact height level.\r<br />4. Start running. You won&#39;t grab new items, but you can contol the active ones. The item&#39;s velocity is low while you are running.\r<br />5. Hide your paws. All the items will reach the target height and then become static.\r<br />6. You can now cast the spell second time to grab a new set of items. The first set WON&#39;T be lost.\r<br />7. Switch to the melee mode to drop all the items.\r<br />\r<br />Sprint to throw all the items to the enemy\r<br />\r<br />[youtube]fmkKvA0FJCo[/youtube]\r<br />\r<br />[color=red][b][size=4]Coldharbour&#39;s Mist[/size][/b][/color]\r<br />\r<br />Coldharbour&#39;s Mist will call the Mist which doesn&#39;t belong to Nirn. It will instantly absorb the magicka of any creature staying inside. Any creature that Shout inside the mist can lose it&#39;s Voice for a while.\r<br />\r<br />If some creature enters the Mist, it will start to power it with it&#39;s own magicka. You can create multiple Mist&#39;s, all the magicka will be accumulated.\r<br />\r<br />If the Mist absorbed enough magicka, it can merge two worlds (Nirn and Coldharbour)  for a few minutes. The amount of magicka required to open the portal is non-constant and space dependent.\r<br />\r<br />When the worlds are merged, most creatures (except the essential characters) won&#39;t leave the Mist. It will take them to Coldharbour.\r<br />\r<br />You can release these creatures by opening the portal in ANOTHER place (it will still require magicka to absorb)\r<br />\r<br />[youtube]UJ8B7vapabw[/youtube]\r<br />[youtube]9k8LUBrzXVI[/youtube]\r<br />[youtube]DuTorHk96iE[/youtube]\r<br />\r<br />[color=red][b][size=4]Memory Absorption (Passive ability, Learn enemy spells)[/size][/b][/color] \r<br />Vampires with true power not just aborb lifeforce of their enemies, they can also absorb fragments of the memory.\r<br />\r<br />Finish your victim when he/she is casting some spell. You will absorb the memory and temporary LEARN this spell, it will be automatically equipped into your left hand. When you change the spell you will forget it, but until then you can keep using it even after several transformations.\r<br />\r<br />Some spells are equipped in the right hand because of restrictions. To re-equip Drain Life again, simply enter the melee mode and then return to the magic mode.\r<br />\r<br />The stronger the spell the more blood level you should acquire to get it (this is the only restriction). \r<br />\r<br />You can use ANY spell from ANY enemy from ANY mod. Mages, Spriggans, Wisps, other creatures - anything goes. All magic is yours... if you have blood.\r<br />\r<br />[youtube]-AzRe7VH3L0[/youtube]\r<br />\r<br />[color=red][b][size=4]Shadow Shield[/size][/b][/color] \r<br />[The more light you receive the more blood points it will cost] \r<br />\r<br />\r<br />The same shield that Harkon used in the final battle. Use as a temporary shelter. \r<br />\r<br />- Nothing can penetrate the shield \r<br />- NPC, creatures and other objects are unable to move through the shield \r<br />- Player can&#39;t move the shield or attack \r<br />\r<br />To release the shield, simply start moving again. The Shadow Shield is cheap in the shadows and expensive in the light areas.\r<br />\r<br />[youtube]KV-flrEan4M[/youtube]\r<br />\r<br />[color=red][b][size=4]Take no fall damage while levitating[/size][/b][/color] \r<br />[Must have full health]\r<br />\r<br />You won’t take fall damage if you have positve blood level and you are in the magic mode. However, you WILL take damage when falling in the sunlight or injured.\r<br />\r<br />[color=red][b][size=4]Nightmare[/size][/b][/color] \r<br />[Human form, each sleeping enemy costs one blood point, consume more blood to support longer distances] \r<br />\r<br />Send nightmares to sleeping characters (must be non-essential). Victims will be tortured both physically and mentally until the player starts moving. They will awake frightened to death and will give up to you in combat without any resistance.\r<br />\r<br />Your blood level affects the maximum distance. It also affects how easily your victim will give up. The glowing represents the internal struggle. Once the glowing is gone, the victim becomes a coward. Characters with high confidence are harder to dominate.\r<br />\r<br />If the character is not an enemy and already scared, use the Nightmare ability second time to affect his mind and raise relationship. Don&#39;t get caught in the process, better to hide behind the door. If the victim detects you, the relationship will be LOWERED (you will see a glowing in such case).\r<br />\r<br />Usually, it will require 4 nights to raise relationship to the max level. However, some characters with high Aggression and Morality will resist the process. The more blood level you have the easier it will be for you to break their will.\r<br />\r<br />Vampires created from such chraracters can become marriage partners and followers\r<br />\r<br />[youtube]c8Crv9clXkQ[/youtube]\r<br />[youtube]z_sVosxeG-w[/youtube]\r<br />\r<br />[color=red][b][size=4]Feed on characters from the back[/size][/b][/color] \r<br />...WITHOUT using the Vampire’s Seduction. \r<br />\r<br />But… don’t get caught in the process, otherwise everyone can start attacking you. Works well with bandits or other NPCs that can’t report your actions to guards.\r<br />\r<br />You can feed on every character only once.\r<br />\r<br />[color=red][b][size=4]Make Thralls[/size][/b][/color]\r<br />[non-zero blood level, Human form]\r<br />\r<br />When your enemy starts to flee (usually, on low health), activate him and select the option &#34;Make Thrall&#34;. Some thralls can attack or distract your enemies (guards usually refuse to do that). Some thralls can be used as followers. Works only with non-unique human characters (must be alive, you can&#39;t make thralls from vampires). You can feed on your thralls any time. \r<br />\r<br />Thralls won&#39;t stay forever in version 2.2. You can use them for 80 seconds. After that they become enemies again.\r<br />\r<br />[b]NEVER GIVE IMPORTANT GEAR TO YOUR THRALL[/b], HE WILL LOSE IT&#33; \r<br />\r<br />[youtube]08xt_fdh-kM[/youtube]\r<br />\r<br />[color=red][b][size=4]Rush[/size][/b][/color] \r<br />[decreases the blood level]\r<br /> \r<br />Works like the Bats spell, but you can select the exact destination. Supports VERY long distances. \r<br />\r<br />[youtube]SNMult-_BM4[/youtube]\r<br />\r<br />[color=red][b][size=4]Possession and Seduction[/size][/b][/color]\r<br />[decreases the blood level, enemy level must be lower than thrall&#39;s level]\r<br />\r<br />\r<br />Control the mind of your Thrall remotely. Use him or her to seduce your enemies (Vampire Lord stays in place). \r<br />\r<br />1) After you gain control move and DON’T stop until you reach the enemy. \r<br />2) Stop running to activate Seduction. Thralls can seduce enemies to take off their armor and take their weapon. \r<br />3) Start running again to return to Vampire Lord \r<br />\r<br />After the seduction the selected Thrall will die. Moral and Level values affect the chance of seduction. Bandits can be seduced more easier than Guards, because they have weak Moral. The level of your Thrall and your Blood level also matters. Drink more blood to seduce more advanced characters.\r<br />You can’t seduce essential characters.\r<br />\r<br />[youtube]93PC1owY7oI[/youtube]\r<br />\r<br />[color=red][b][size=4]Shadow Step[/size][/b][/color] \r<br />[non-zero blood level, dark areas]\r<br />[color=yellow][b]THREE modes&#33;[/b][/color]\r<br />\r<br />\r<br />Use shadows as portals. Enter one shadow and exit from another. Materialize right from the back of your enemies. Can be used for hit-and-run tactics, so Vampire Lord now suits the stealthy gameplay. \r<br />\r<br />1) Cast the spell while [u]standing still[/u] in the shadow to teleport to your enemy (if there is one) or any of the closest characters. The target NPC [b]must stand in the shadow too[/b]. If a player is not levitating, the Lord will bite the enemy, but not to death. The more blood points you have, the longer distances are supported. It will take few seconds to search the target. Start running to cancel.\r<br />\r<br />If you already made any steps previously, with casting shadow step [paws dowm, blood magic mode] you can select a \r<br />previous shadow to teleport in.\r<br />\r<br />2) Cast the spell while [u]RUNNING[/u] in the shadow. You will unite with the Darkness. While time is frozen, move to any shadow where you can materialize and wait a few seconds (you can&#39;t attack or activate anything in this mode). You are not allowed to appear in the light areas, Vampire Lord will be immediately teleported back to initial shadow.\r<br />\r<br />3) Invisibility. If your blood level is twice higher than your regular level, you will become invisible if you failed to enter the shadow. There is no time limit. Invisibliity will stay until you start running or until you walk into the very bright area.\r<br />\r<br />[youtube]MVLW2WJ16uo[/youtube]\r<br />\r<br />[color=red][b][size=4]Darkness[/size][/b][/color]\r<br />[non-zero blood level, dark areas]\r<br />\r<br />\r<br />Darkness protects you. [b]You take no damage in the dark areas[/b], but with each hit your blood level decreases. Also the range of melee attack will increase in the dark areas.\r<br />\r<br />You take [b]additional damage in the light[/b]. [u]ANY OBJECT IN THE GAME[/u] that provide additional lighting (like fire or torch) will negate the spell effect and the player will be vulnerable again.\r<br />\r<br />[youtube]ZQF3qZMTrV4[/youtube]\r<br />\r<br />[b]Speed Levitating in Darkness[/b] [non-zero blood level, full health, full magicka, no sunlight]. The more blood you consumed the faster you will move. \r<br />\r<br />With higher blood levels you can [b]regenerate your health[/b] in the shadows [full magicka, no sunlight]. The more blood you have the faster you regenerate.\r<br />\r<br />[b]Sprint to push away your enemies[/b] [full health, full magicka, no sunlight]. \r<br />If the enemy have low health, his flesh [b]will be dissolved by the Darkness[/b], human creatures will be dissolved completely leaving just a skeleton behind. The victim&#39;s blood will be instantly absorbed by the Lord, increasing your Blood level. But if the enemy is too strong, the Blood level will decrease.\r<br />\r<br />[youtube]s2EbPfn8K1Y[/youtube]\r<br />\r<br />The exit this mode, simply [b]approach the very bright light or return to human form[/b].\r<br />\r<br />[color=red][b][size=4]Dominance[/size][/b][/color]\r<br />[passive ability, Life Blood level higher than the enemy level. The enemy is not unique character] \r<br />\r<br />\r<br />There is a possibility to dominate the will of your enemies just by looking at them. Your enemy will instantly become your ally.\r<br />\r<br />Conditions: \r<br />- Take damage from the enemy \r<br />- DO NOT RUN \r<br />- DO NOT draw magic or claws \r<br />- You must look at the enemy and the enemy must look at you \r<br />-Must have full health \r<br />-Must have full magicka\r<br />\r<br />The difference between levels affects the chance of success or failure.\r<br />It’s possible to dominate Daedra or even Dragons, but you should have A LOT of blood points.\r<br />\r<br />Dominated creatures won&#39;t stay forever in version 2.2. You can dominate any creature for about a min or so. However, most human creatures will be paralysed via the animation. \r<br />\r<br />[youtube]cQgvOvwVkUg[/youtube]\r<br />\r<br />[color=red][b][size=4]Turn ANY non-essential NPC into a vampire[/size][/b][/color]\r<br />[blood level &gt; NPC&#39;s level]\r<br />\r<br />The Magicka will increase to fit your level. Frost Resistance/ Weakness to fire and other vampiric spells will be added. The stronger your blood, the stronger vampires you can create.\r<br />1)   Unequip your weapons and hide your hands\r<br />2)   Activate the NPC and select the option\r<br />\r<br />NOTE: [b]NPCs WON’T BE ABLE TO CURE VAMPIRISM&#33;&#33;[/b] The appearance may be changed drastically if the NPC have some custom race.\r<br />\r<br />[youtube]uT5nRay3ZCU[/youtube]\r<br />\r<br />[color=red][b][size=4]Telepathy[/size][/b][/color] \r<br />[The more blood level you have the more advanced spells you can give]\r<br />\r<br />\r<br />If your friend (usually, follower) is a vampire, you can teach him any spell you have (except powers and shouts). Master spells are supported and NPCs WILL use them. Equip the spells in your hands and activate the NPC.\r<br />\r<br />[youtube]IBRlKTLjmXw[/youtube]\r<br />\r<br />[color=red][b][size=4]Takeoff[/size][/b][/color]\r<br />[non-zero blood level, magic mode]\r<br />[color=yellow][b]Two Modes[/b][/color]\r<br />\r<br />\r<br />Cast while [u]RUNNING[/u] in the levitate mode to fly in the form of Bats [blood level will decrease in time]. Use sprint and jump to fly over the landscape. Exit the levitating mode (switch from magic to melee mode) to stop &lt;This is a new simple flying technique, collisions are fully supported, no global settings, races or objects are affected&gt;\r<br />\r<br />[youtube]AqJAYKLnZ8Y[/youtube]\r<br />[youtube]nx97oXw_KAU[/youtube]\r<br />\r<br />Cast while [u]STANDING STILL[/u] to rush into the air. If the player is in the magic mode, VL will stay in the air for a while (player is able to attack or cast but unable to move). If you want to drop to the ground - simply jump or exit the levitating mode (switch from magic to melee mode). \r<br />\r<br />[youtube]tQMlkCE2Hik[/youtube]\r<br />\r<br />[color=red][b][size=4]Blood & Stone[/size][/b][/color]\r<br />\r<br />\r<br />You can create Gargoyles from Ore and your own blood.\r<br />1) Find &#34;Iron Dagger&#34; \r<br />2) UNEQUIP weapons and magic from your hands, hide your hands \r<br />3) Drop the dagger and some ore to the ground. Create a pile. Keep the stones as close as possible. \r<br />4) Take the dagger (keep yourself as close as possible to the stones). Your character will cut himself and will drop some blood on the stones.\r<br />5) Turn into Vampire Lord. Your blood will give life to these stones and all the piles you created will turn into Gargoyles. \r<br />\r<br />[Distance matters. If you walk away from the pile, the effect will be lost Drink more blood to enlarge the maximum distance] These self-made gargoyles are not perfect (for the balance purposes). The creature will [b]turn into a stone for a few seconds on each hit[/b]. The more light it receives the longer it will be stoned.\r<br />\r<br />The more stones you put into the pile, the stronger your dark companion will become. This affects size, attack power and speed. The bigger gargoyles consumes more blood points. The quality of the Ore also affects the flexibility of the resulting creature. The more expensive Ore you put into the gargoyle, the healthier it will become and the faster it will be animated from the stone after hits. \r<br />\r<br />You can create as many as you want. There is no time limit, so they will protect the area until they die.\r<br />\r<br />[youtube]Yo6n5dePj2g[/youtube]\r<br />[youtube]jSd8o3riLZY[/youtube]\r<br />\r<br />[color=#ff0000][b][size=4]Unleash Death[/size][/b]\r<br />[/color]\r<br />Prepare Death Hounds from dead dogs and wolves and unleash them in the Vampire Lord form when nessesery. The corpses \r<br />should match the conditions: fresh corpses are too warm, old corpses are not good. If you kill the creature with \r<br />powerful magic or weapon, the corpse will be too damaged to perform a ritual. So, you should kill accurately.\r<br />Hounds arrive in a pack of 6. Vampire Lord recieves direct control over the pack. Can be used to explore the area and \r<br />track enemies.\r<br />\r<br />Once reborn, the Hound will follow you until death. You can also order it to guard the place.\r<br />\r<br />Hounds are weak, but require just 1 blood point and you can create as many as you want. \r<br />Compatible with [url=http://www.nexusmods.com/skyrim/mods/64021/?]&#34;Useful Dogs&#34;[/url]. Hounds can search items for you.\r<br />\r<br />[youtube]ivuHN131O8E[/youtube]\r<br />\r<br />[color=red][b][size=4]Raise Undead Lords[/size][/b][/color]\r<br />\r<br />Undead Lords are like Overlords from Starcraft. The more Lords you have, the more zombies you can raise.\r<br />\r<br />Each Undead Lord will automatically raise minions from nearby corpses. Note: Undead Lord can&#39;t raise zombie from a creature with higher level; also, he will refuse to raise minions from weak corpses. The maximum amount of raised zombies depends on how many Undead Lords you have.\r<br />\r<br />Blood level affects: \r<br />- Max distance between raising minion and the Undead Lord\r<br />- How many minions each Lord can raise and command\r<br />\r<br />So, for example: If you have 200 blood points, then each UL can raise ~15 corpses. If you want 45 corpses with you, you should create at least 3 Undead Lords.\r<br />\r<br />Technically, the size of such Undead army is [b]UNLIMITED...[/b] BUT you should have enough blood points. Higher level Lords requires more blood (this is not a cheap spell)\r<br />\r<br />When every Undead Lord fall, all the minions will fall too. Same happens when you revert to human form.\r<br />\r<br />[youtube]VrwsrItfgxg[/youtube]\r<br />[youtube]dEz-VRWWYAM[/youtube]\r<br />\r<br />[color=yellow][b]For cheaters and reviewers:[/b][/color]\r<br />\r<br />\r<br />To raise your blood level simply type in the console: \r<br />Set VLFullyAwaken to N.\r<br />\r<br />If you cheat to get the perks, don&#39;t forget to adjyst the global variable. Type in the console\r<br />[b]help dlc1vampiremaxperks[/b]\r<br />Usually, it&#39;s 11\r<br />\r<br />Then set the perks variable to your value\r<br />[b]set DLC1VampireTotalPerksEarned to 11[/b]\r<br />\r<br />\r<br />Thank you for your attention. Please, check my other mods.",
  "categoryId": "24",
  "version": "2.2",
  "author": "flexcreator",
  "createdUnix": "1389146546",
  "updatedUnix": "1459601415",
  "containsAdultContent": false,
  "uploadedBy": "flexcreator",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090416",
      "name": "Dark Maneuvers 0_9 EN",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "Dark Maneuvers 0_9 EN-49654-0-9.rar",
      "uploadedUnix": "1389142442",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/2cba66a1e0b10216c3c4bc5f5a60e9d6c1bcf2e2df3425eb2107e77d1ff42cc5/analysis/1407876870/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%200_9%20EN-49654-0-9.rar?fid=1000090416&ttl=1535830755&ri=8192&rs=8192&setec=e2e6b68ba6069ffd83d1fd41dce3086a"
    },
    {
      "fileId": "1000090454",
      "name": "Dark Maneuvers 0_9 RU",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "Dark Maneuvers 0_9 RU-49654-0-9.rar",
      "uploadedUnix": "1389183288",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/99df2e36392c6470e2f8bec77829eb5fc1e6d3caaec86213cee3635834d362ce/analysis/1407877383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%200_9%20RU-49654-0-9.rar?fid=1000090454&ttl=1535830755&ri=8192&rs=8192&setec=5ce69a834cf83c8fd890f64dc79cceb1"
    },
    {
      "fileId": "1000090825",
      "name": "Dark Maneuvers 1_0 EN",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "37",
      "fileName": "Dark Maneuvers 1_0 EN-49654-1-0.rar",
      "uploadedUnix": "1389401113",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/78b1926affc7cf7e7004b38dd4bbcead00e719fbdbf616e1e53ee47c012a2063/analysis/1407880761/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%201_0%20EN-49654-1-0.rar?fid=1000090825&ttl=1535830756&ri=8192&rs=8192&setec=eb72cd36ea7ea6135a1db2b4b1543d41"
    },
    {
      "fileId": "1000090826",
      "name": "Dark Maneuvers 1_0 RU",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "36",
      "fileName": "Dark Maneuvers 1_0 RU-49654-1-0.rar",
      "uploadedUnix": "1389401161",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f79a9866a5fe113d15408db97170ebffe4da96a4a17ca675750bdb87763b475c/analysis/1407880762/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%201_0%20RU-49654-1-0.rar?fid=1000090826&ttl=1535830756&ri=8192&rs=8192&setec=ecdd8457bb826f041f49241b77732c8c"
    },
    {
      "fileId": "1000098285",
      "name": "Dark Maneuvers 1_5 EN",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "199",
      "fileName": "Dark Maneuvers 1_5 EN-49654-1-5.rar",
      "uploadedUnix": "1393099766",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/941890a6ea8f852bfd056a97a8c22fb6a49c2ca1d39328eb5e91f76fb9d66006/analysis/1407945606/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%201_5%20EN-49654-1-5.rar?fid=1000098285&ttl=1535830757&ri=8192&rs=8192&setec=50c4d0e926acf96c53b1f72fa48639b6"
    },
    {
      "fileId": "1000098286",
      "name": "Dark Maneuvers 1_5 RU",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "199",
      "fileName": "Dark Maneuvers 1_5 RU-49654-1-5.rar",
      "uploadedUnix": "1393099839",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/7e68c66b5636f7b92666f4c9940f4408a612d600db8e070a0c7665e233903e58/analysis/1407945607/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%201_5%20RU-49654-1-5.rar?fid=1000098286&ttl=1535830757&ri=8192&rs=8192&setec=00b495864f38f839a32327e3ebb66d29"
    },
    {
      "fileId": "1000099514",
      "name": "Dark Maneuvers 1_5 Spanish",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "199",
      "fileName": "Dark Maneuvers 1_5 Spanish-49654-1-5.rar",
      "uploadedUnix": "1393791298",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/b5f2cb3320dd1d3e2d6d8fac329c7a4ebde9719f99fcd477f19a825c8d5d20ab/analysis/1407957359/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%201_5%20Spanish-49654-1-5.rar?fid=1000099514&ttl=1535830758&ri=8192&rs=8192&setec=cd35fb72be5f78a44b19075658013ea3"
    },
    {
      "fileId": "1000101722",
      "name": "Dark Maneuvers 1_5 PT",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "Dark Maneuvers 1_5 PT-49654-1-5.rar",
      "uploadedUnix": "1395234042",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/c53212123574048d9dd81502930b5259a71265ec28425d89c7bac8e7b83914fa/analysis/1407988028/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%201_5%20PT-49654-1-5.rar?fid=1000101722&ttl=1535830758&ri=8192&rs=8192&setec=d196ba906a2f43f8422dfffc401e152d"
    },
    {
      "fileId": "1000143088",
      "name": "Dark Maneuvers 1_5 Sources",
      "version": "1.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "212",
      "fileName": "Dark Maneuvers 1_5 Sources-49654-1-5.rar",
      "uploadedUnix": "1421394200",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/0130799390e98692c1bc1075b3277401be52ab03cf94d9f81b81e0a20ff52820/analysis/1421394242/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%201_5%20Sources-49654-1-5.rar?fid=1000143088&ttl=1535830758&ri=8192&rs=8192&setec=b1f50ddcc6a4773065c5ca3d9b660294"
    },
    {
      "fileId": "1000184412",
      "name": "Dark Maneuvers 2_0 English",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "180",
      "fileName": "Dark Maneuvers 2_0 English-49654-2-0.rar",
      "uploadedUnix": "1447102714",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/3238a869163eda735498011c290f6cb19537b0921ce3fa4095c8359a8b2ec076/analysis/1447102743/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%202_0%20English-49654-2-0.rar?fid=1000184412&ttl=1535830759&ri=8192&rs=8192&setec=3466e2a56d09336fef68849499bea065"
    },
    {
      "fileId": "1000184413",
      "name": "Dark Maneuvers 2_0 Russian",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "180",
      "fileName": "Dark Maneuvers 2_0 Russian-49654-2-0.rar",
      "uploadedUnix": "1447102816",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/5eb27de299da128a57a2567f5979fd2e236e14347b9ccd48b80531b87fd23030/analysis/1447102863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%202_0%20Russian-49654-2-0.rar?fid=1000184413&ttl=1535830759&ri=8192&rs=8192&setec=db6b62a6a03223d5db1980f81d57c1b2"
    },
    {
      "fileId": "1000184464",
      "name": "Dark Maneuvers 2_0 Portuguese",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "180",
      "fileName": "Dark Maneuvers 2_0 Portuguese-49654-2-0.rar",
      "uploadedUnix": "1447158047",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/878d2e630f52700ae4b6a73467606cd63bbcf7e275bd7f0b29e93cbea43d0266/analysis/1447158974/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%202_0%20Portuguese-49654-2-0.rar?fid=1000184464&ttl=1535830760&ri=8192&rs=8192&setec=9a88b1b1fe19026332dcc08e3dd41081"
    },
    {
      "fileId": "1000197423",
      "name": "Dark Maneuvers 2_1 Factions Hotfix",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "25",
      "fileName": "Dark Maneuvers 2_1 Factions Hotfix-49654-2-1.rar",
      "uploadedUnix": "1456603285",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/5b19eb4598c45ad2436d989a15ed9ee4cdfc025ed7b67ddd0eb48069c6b1ea3a/analysis/1456603324/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%202_1%20Factions%20Hotfix-49654-2-1.rar?fid=1000197423&ttl=1535830760&ri=8192&rs=8192&setec=90fefc4495e3b2a5b2da232671dc372e"
    },
    {
      "fileId": "1000201518",
      "name": "Dark Maneuvers 2_2 EN",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "203",
      "fileName": "Dark Maneuvers 2_2 EN-49654-2-2.rar",
      "uploadedUnix": "1459601415",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/7718f955690aca6cc0ed3e199144b071a78c2a4c79939f10c5fe168391598a7c/analysis/1459601463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Maneuvers%202_2%20EN-49654-2-2.rar?fid=1000201518&ttl=1535830761&ri=8192&rs=8192&setec=99d98323aac71462da2a65ea5b727095"
    }
  ]
}