{
  "modId": 49681.0,
  "modName": "Skyrim Rearmament",
  "summary": "A compilation of inventory changes for various NPC including stormcloaks, imperial soldiers, the silver-hand, and hold guards.",
  "descriptionHtml": "This mod impacts the items and clothing of several NPCs and factions to make the game feel more immersive. A few individual NPCs were affected including some dark elf NPCs in skyrim who were given &#39;dark elf clothing&#39; that was featured in the Dragonborn DLC. The changes mostly impact the following factions:\r<br />\r<br />1) Stormcloaks: Instead of wearing the colours of windhelm the stormcloak soldiers can wear the colours of each hold that supports the rebellion. Furthermore, nordic carved armour is &#39;claimed&#39; by the stormcloaks as their heavy armour and is harder to come by on bandits. Thus, the stormcloaks can have either of the 5 outfits (4 stormcloak holds and nordic carved) but have a lesser chance of appearing in the heavy armour.\r<br />\r<br />Stormcloak soldiers no longer have a chance to be given an iron weapon or shield, instead each soldier has a chance of getting either a steel weapon or a nordic carved weapon with the shield always being steel. This goes for all weapons except the bow and the two handed sword (as it was bugged).\r<br />\r<br />2) Imperial Soldiers: Imperial soldiers now have a chance of wearing either light, studded or heavy imperial armour. The chance of wearing either one is equal.\r<br />\r<br />Imperials use imperial swords as they did before but have a chance of using a crossbow instead of the imperial bow. The chances of getting a bow or a crossbow are the same.\r<br />\r<br />3) Silver-Hands: The silver hands were given armour to match their weapons and hatred for Lycanthropes. Instead of wearing generic bandit gear the silver-hand now have a chance to either wear a full set of steel or leather armour featuring no-helm, helm, and dawnguard helm versions. Furthermore, the leather armour may come instead with a leather hood on the silver-hands, effectively adding an unused item back into the game. \r<br />\r<br />The silver-hand no longer carry leveled bows but have a chance to either get a hunting bow or a crossbow; these chances are equal.\r<br />\r<br />4) Hold Guards: The guards in the holds controlled by the empire will wear an imperial helmet instead of their hold helmet along with imperial bracers and boots. Guards in Solitude will also have a chance to wear full imperial heavy armour along with the full-face imperial helm. Guards in Markath wear the light version of the imperial helmet, bracers, and boots instead but have a chance to wear a full set of dwarven armour with the helmet replaced by a circlet.\r<br />\r<br />The Markath guards are all given dwarven weapons, while the guards in the stormcloak holds have the same weapon choices as the stormcloak soldiers. No changes are made to the stormcloak guards other than a chance for the windhelm guards to wear a full set of nordic carved armour. Guards in places that are more or less neutral to the conflict, namely Whiterun and Ivarstead, have a chance to appear in full steel armour.\r<br />\r<br />Version 1.1 of this mod allows the player to forge the full version of the imperial helm. This feature was added at the request of the user daventry.",
  "categoryId": "78",
  "version": "1.1",
  "author": "Makoodzaka",
  "createdUnix": "1389224212",
  "updatedUnix": "1389279592",
  "containsAdultContent": false,
  "uploadedBy": "makoodzaka",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090535",
      "name": "Rearmament of Skyrim",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "97",
      "fileName": "Rearmament of Skyrim-49681-1-0.rar",
      "uploadedUnix": "1389224019",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a3ac193268bdd9f65b2c7f50a3b6c1ef4b762d81f865f3cb8bfd76e977bfd0e4/analysis/1407878137/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rearmament%20of%20Skyrim-49681-1-0.rar?fid=1000090535&ttl=1535830844&ri=8192&rs=8192&setec=12d1757dcbfc6ee73c63c4c6dc1bf612"
    },
    {
      "fileId": "1000090610",
      "name": "Rearmament of Skyrim",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "97",
      "fileName": "Rearmament of Skyrim-49681-1-1.rar",
      "uploadedUnix": "1389279592",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9f475f6c47cf602b1378d4d0cd1be6743891c73a108759d041ffc312e57326dc/analysis/1407878939/",
      "changelogHtml": " Added a feature to smith imperial full helmets. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rearmament%20of%20Skyrim-49681-1-1.rar?fid=1000090610&ttl=1535830844&ri=8192&rs=8192&setec=29ca6ac072218ce92f63ac78d23883a5"
    }
  ]
}