{
  "modId": 49685.0,
  "modName": "My Little Vampire-Haema Save",
  "summary": "A little save game for a sexy, young Vampire Nord female.",
  "descriptionHtml": "It&#39;s been a while since my last Save Game upload. But I figured that it was time to release this one for the community.\r<br />I present to you, Haema Black-Wolf. A young, slender Nord female on the run. Sometime during her time in the wilds near Skyrim, a Vampire attack on a darker than usual night left her scarred and infected with Vampiris Sanguinare without her knowing. Lucky to escape and running for her life, she runs through the night only to stumble right into an imperial ambush and the rest of her destiny...\r<br />\r<br />\r<br />\r<br />Here&#39;s a list of all the mods used in conjuction to make this save game work properly and get her looking just like in the photo. \r<br />\r<br />XP32 Maximum Skeleton -XPMS by xp32\r<br />Lustmord Vampire Armor by AmethystDeceiver\r<br />Superior Lore-Friendly Hair - HD textures\r<br />The Eyes Of Beauty by Gabriel Mailhot\r<br />Calientes Beautiful Bodies Edition -CBBE- by Caliente (I use the Slim option)\r<br />Detailed Lips by Xenius\r<br />Female Vampires Have Fangs by Acdale\r<br />RaceMenu Freckle Overlay by TheOniNinja (Use this one specifically, as the one mentioned in his mod page with other support works on UNP only. I found this out the hard way with a corrupted game save&#33; &gt;.&lt;&#39;)\r<br />THEHAGs Privat Tattoos for CBBE v3d2 by THEHAG and BladeSinger06\r<br />THEHAGs Privat Wartattoos - Facial Warpaints for Females by THEHAG and BladeSinger06\r<br />Better Vampires 6-5 by Brehanin (I can&#39;t stress this enough. If you want a fantastic, immersive and AWESOME Vampire experience. I recommend using this mod in tune with Haema. Brehanin and his mod make playing a Vampire challenging, fulfilling and rewarding.)\r<br />Sneak Tools by Borgut1337 ( I highly suggest this mod, only because Haema is not only a Vampire, she&#39;s a Thief as well. And a damn good one. So for Stealthy types, this mod brings major awesomeness to the table as well.)\r<br />RaceMenu by Expired (This is a MUST HAVE mod in order to get the Freckles and tattoos to work. No exceptions.)\r<br />\r<br />I can give a few others that I think would fit really well with Haema but they&#39;re optional and I&#39;ll only suggest them if asked directly.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />(Disclaimer: She isn&#39;t completely infected right at the start of the Helgen sequence. If you want to be completely infected at that point, open up your console and type &#34;help vampire&#34;. Locate a Master Vampire NPC code and type in &#34;player.placeatme &#34;NPCCODEHERE&#34; 1&#34;. Let the slimy bastard wail on you a couple of times til you&#39;re infected, then use the KILL command in console after clicking him. Do your usual Golden Claw, Bleak Falls Barrow, Dragonstone for Farengar and defeating Mirmulniir sequences and by that time, you&#39;ll be ready to become a full, complete dragon slaying Vampire sex goddess&#33;)",
  "categoryId": "43",
  "version": "",
  "author": "The Tidewalker",
  "createdUnix": "1389228785",
  "updatedUnix": "1389228774",
  "containsAdultContent": true,
  "uploadedBy": "Tidewalker117",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090542",
      "name": "Vampiress Haema Black-Wolf",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1797",
      "fileName": "Vampiress Haema Black-Wolf-49685-1-0.rar",
      "uploadedUnix": "1389228774",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dd143fcf28b3a2e876869c2f43e17be3811a0feaff6cf5e3e7f46200592dc58d/analysis/1407878225/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiress%20Haema%20Black-Wolf-49685-1-0.rar?fid=1000090542&ttl=1535830859&ri=8192&rs=8192&setec=874dbbc3d396169f9c8c970081f3b08d"
    }
  ]
}