{
  "modId": 49698.0,
  "modName": "The Immersion Effect - Bigger Dragons",
  "summary": "I&#39;ve seen a lot of people that simply wanted larger dragons without the glitching movement from increasing size. This mod was made to (hopefully) remedy that.",
  "descriptionHtml": "[size=2][color=#BF0000]NOTE: This will only work for Vanilla dragons at this time. If there is a dragon mod you have that adds other dragons to the game, this may not work for you. However, the mod should be compatible with any dragon mods that do not alter the size of the dragons.\r<br />____________________________________________________________________________________________[/color][/size]\r<br />\r<br />\r<br />\r<br />[font=scribble][center][size=5][color=#008000]&#34;TIE: Bigger Dragons&#34;[/color] is my first attempt at modding. It&#39;s a simple mod created with the sole purpose of making all the dragons in Skyrim larger (without all the glitching movement you see from increasing dragon size via console) so that you can genuinely [color=#FF0000][i][b]FEAR[/b][/i][/color] those majestic beasts when you see them.\r<br />\r<br />This is a very basic mod and I&#39;ve left alone the difficulty of the dragons as the difficulty settings in the game itself do a pretty good job of making them harder if you&#39;d like to REALLY fear them to no end, and I wanted to make sure even the most casual player could experience the heart-sinking terror of witnessing a dragon big enough to swallow you whole land in front of you.\r<br />\r<br />Hopefully I&#39;ve managed to sink all the dragons into this one. If you have any suggestions feel free to let me know, and if you find any dragons that aren&#39;t fixed, or bugs within the mod, please let me know.[/size]\r<br />\r<br />Update: I have been trying to find someone to assist with fixing some of these bugs, but unfortunately do not have the knowledge to fix them myself. I will continue to communicate with others in regards to these issues. However my real life has become increasingly busy and my available downtime diminished, so the work is taking... well, forever. I haven&#39;t forgotten, just haven&#39;t fixed it all yet.[/center][/font]\r<br />\r<br />[size=2][color=#FF8000]Reported Bugs (&#39;m not sure how to fix these):\r<br />-Certain scenes (especially the intro) are having alignment issues. (Alduin appears to be burning everything except what he&#39;s supposed to&#33;)\r<br />-Dragon Kill moves (i.e. biting people and tossing them) are not lining up properly\r<br />-Ohdaviing is a tad too big for Dragonsreach . . . Just a tad.\r<br />-Breath meshes seem to be small in comparison to the dragon[/color][/size].",
  "categoryId": "78",
  "version": "1.0",
  "author": "LordBlufier",
  "createdUnix": "1389255590",
  "updatedUnix": "1389255365",
  "containsAdultContent": false,
  "uploadedBy": "LordBlufier",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090581",
      "name": "TIE Skyrim Bigger-Dragons v1-0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "TIE Skyrim Bigger-Dragons v1-0-49698-1-0.rar",
      "uploadedUnix": "1389255365",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/50128f6a9db3ef24b7911d05530f69ee1109a41f94ec94f50a9deb53cc0c29d3/analysis/1407878767/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TIE%20Skyrim%20Bigger-Dragons%20v1-0-49698-1-0.rar?fid=1000090581&ttl=1535830880&ri=8192&rs=8192&setec=92145f0584109238554cdb6a6a7a8143"
    }
  ]
}