{
  "modId": 4971.0,
  "modName": "Hax Arrows and Non-Damaging Arrows",
  "summary": "Just a simple mod which adds two new arrows - Hax Arrows and Non-Damaging Arrows. Hax arrows do, well, Hax damage (2 billion). Non-Damaging Arrows negates bow damage (except enchantments and poison). Mainly for fun only.. or getting out of a difficult monster situation.",
  "descriptionHtml": "[i]TL;DR at bottom[/i]\r\n\r\n[b][u]What are Hax Arrows?[/b][/u]\r\n\r\nEver had that time when you met a dragon at a inconvenient time, say, Riverwood, and Alvor the dumb blacksmith keeps getting himself killed? (TRUE NORDS NEVER BACK DOWN!)\r\nOr maybe you just want to feel how does One-shotting everything feels like? (Without having to make over 9000 restoration potions?)\r\n\r\nThen this arrow is perfect for you, if you ever need to get out of a sticky spot quick!\r\nDragon attacking Rorikstead or Ivarstead and citizens are in danger of getting killed? Just whip out your Bow, nock on a Hax Arrow and deal 2 BILLION damage to that pesty dragon once and for all.\r\n\r\n\r\n[u]Benefits[/u]\r\n\r\n- KO anything (except essential NPCs, but will cause them to incapacitate)\r\n- Give it to your follower for double the power.\r\n\r\n[u]Consequences[/u]\r\n\r\n- Somewhat game-breaking\r\n- If your opponent somehow happens to get a Hax Arrow (maybe you shot on the floor), he can OHKO you too.\r\n- If you give your follower a Hax Arrow your follower might accidentally shoot you in squeezy places.\r\n\r\n[u]Recipe to make 5 Hax Arrows[/u]\r\n\r\n[i]Too many ores?[/i]\r\nOption a)\r\n1) Get 1 ingot of EVERY kind.\r\n2) Smelt the ingots for an Ingot Mixture at a furnace.\r\n3) Make using an Ingot Mixture and a Firewood at a Forge.\r\n\r\n[i]Too many Soul Gems?[/i]\r\nOption b)\r\n1) Get 5 petty soul gems, 4 lesser soul gems, 3 common soul gems, 2 greater soul gems and 1 grand soul gem. They can either be filled or empty. (Black Soul Gems will NOT work.) (Soul gems which have a higher value than usual which are bought from shops CANNOT be used.)\r\n2) Smelt the 15 soul gems at a furnace for a Soul Gem Mixture.\r\n3) Make using a Soul Gem Mixture and a Firewood at a Forge.\r\n\r\n[i]Too many jewels?[/i]\r\nOption c)\r\n1) Get 1 garnet, 1 amethyst, 1 ruby, 1 sapphire, 1 emerald and 1 diamond. (Flawless gems will NOT work.)\r\n2) Smelt the 6 gems at a furnace for a Jewel Mixture.\r\n3) Make using a Jewel Mixture and a Firewood at a Forge.\r\n\r\n\r\n[u][i]NOTE[/i][/u]\r\n[b]While you can choose what you want to do with it, should it rip you off of your challenging gameplay experience, don\\'t come to me since you\\'re the one who is playing the game. You can abuse the arrow anyway you want, it doesn\\'t matter to me.\r\nYou notice that I didn\\'t add any 100 smithing requirement to make Hax Arrows. This is because Hax Arrows are meant to be fun, or to get you out of a tough situation quick. When you already have 100 smithing taking down a dragon would be relatively easy already.[/b]\r\n\r\n\r\n\r\n[b][u]What are Non-Damaging Arrow?[/b][/u]\r\n\r\nLike the name suggests, this arrow is the opposite of the Hax arrow. Instead of putting on 2 billion damages, it negates 2 billion damages. So you want some aiming lessons, just get a few of these arrows and start shooting away. NPCs will not get aggressive if you hit them with these arrows, since they literally do 0 damage.\r\n\r\nThe bad thing is it does NOT negate ENCHANTMENTS or POISONS. If you have a bow with 29 fire damage enchantment, it will still deal the 29 fire damage. If you kill someone with your enchantments, nearby guards who witnessed the death will still place a 1000 bounty on you.\r\n\r\nAlso, since the Archery skill is leveled up by damaging someone, attacking with the ND Arrow will not increase your Archery skill level.\r\n\r\n\r\n[u]Benefits[/u]\r\n\r\n- Distract monsters away\r\n- If far enough, monsters will not be able to detect you\r\n- Poisons will still have effect\r\n- No damage to NPCs; NPCs will not turn hostile to you (unless; See Consequences)\r\n- Vent your frustration at guards without getting bounty by shooting arrows in their knee.\r\n\r\n[u]Consequences[/u]\r\n\r\n- If your bow has a fire/ice/shock enchantment, NPCs will still get damaged. If you kill them via poisons/enchantments in a friendly town, guards will put a 1000 bounty on you and turn hostile as usual.\r\n\r\n\r\n[u]Recipe to make 10 Non-Damaging Arrows[/u]\r\n\r\n1 Firewood\r\n\r\n\r\n\r\n[b][u]So why should I use this mod?[/b][/u]\r\n\r\nTo be honest, it\\'s up to you what you want to do with it. I like shooting random NPC with arrows for fun, but damaging them will cause them to turn hostile towards me. That\\'s when the ND Arrow comes in. I use the Hax Arrow when I can\\'t be bothered to fight with something.\r\nNevertheless, it is up to your own imagination on what you can do with it.\r\n[spoiler]Karliah - \\\"Once you notice that the potential has no boundaries, the possibilities are endless.\\\" (Or something like that.)[/spoiler]\r\n\r\n\r\n\r\n[b][u]How to Install?[/b][/u]\r\n\r\n1. Download HaxArrows.esp\r\n2. Place HaxArrows.esp in your Data folder\r\n3. Start SkyrimLauncher and click Data Files\r\n4. Activate HaxArrows.esp\r\n5. Play!\r\n\r\n[b][u]How to Uninstall?[/b][/u]\r\n\r\n1. Remove HaxArrows.esp from your Data folder.\r\n\r\n\r\n\r\n[b][u]Bugs?[/b][/u]\r\n\r\n1) There is a slight visual bug when you use Hax Arrows and Marksman Potions. When you equip Hax Arrows, the damage shown is near the damage cap. When using a Marksman potion, the final damage will be higher than the damage cap, thus your damage will be shown as a negative. Nevertheless, even though the damage shown is negative, positive damage is still applied when you hit a monster.\r\n\r\n2) When you shoot the arrows out (either Hax or ND) and miss, and afterwards when going to pick up the arrows again, the name of the arrow will be Iron Arrow, not Hax Arrow or Non-Damaging Arrow. This is because I used Iron Arrow as the base mesh and texture. Nevertheless, when picked up, you will not get any iron arrow, but a Hax or ND Arrow, depending on which you shot.\r\n\r\n\r\n[i][u]TL;DR[/i][/u]\r\n\r\nHax Arrow does 2 billion damage though it might be tedious to get it. (1 ingot of every kind and 1 firewood.)\r\n\r\nNon-Damaging Arrows do no damages unless your bow has an enchantment which damage. Poisons still take effect and if your enchantment/poison kills an innocent citizen when onlookers are present you will still get 1000 bounty on your head.\r\n\r\nThey can be made at any blacksmith forge, under the MISC section.\r\nMixtures are made at a furnace.\r\n\r\n\r\n\r\n[spoiler]Forthosewhocan\\'tbebotheredtogohuntingfortheingredients,youcanusetheconsolecommand.TakesawaythefunIMO,sinceit\\'sanoverpowereditem.[/spoiler]",
  "categoryId": "55",
  "version": "1.0",
  "author": "Excrucius",
  "createdUnix": "1325311115",
  "updatedUnix": "1325337878",
  "containsAdultContent": false,
  "uploadedBy": "Excrucius",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15377",
      "name": "HaxArrowsFull",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "HaxArrowsFull-4971.rar",
      "uploadedUnix": "1325333843",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2f02baeaddc2603ad09ce37739a8f485014a23890646f915bce0ac0392c2dc75/analysis/1406572856/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HaxArrowsFull-4971.rar?fid=15377&ttl=1535761360&ri=8192&rs=8192&setec=1af30248e71f4082afeca1e3576a212e"
    },
    {
      "fileId": "15385",
      "name": "Non-Damaging Arrows Only",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Non-Damaging Arrows Only-4971.rar",
      "uploadedUnix": "1325337842",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/748d69444a824461b3c7cd4773e71855fee7d26142d2068c7f3ed4df68b9f48f/analysis/1406572924/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Non-Damaging%20Arrows%20Only-4971.rar?fid=15385&ttl=1535761361&ri=8192&rs=8192&setec=f48f3838d717a3416df45baeb8e1d0a4"
    },
    {
      "fileId": "15387",
      "name": "Hax Arrows Only",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Hax Arrows Only-4971.rar",
      "uploadedUnix": "1325337878",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4305965832f0f6228f1c4de01da243893a15239a4b1b1fd35a56fa35aabde22a/analysis/1406572942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hax%20Arrows%20Only-4971.rar?fid=15387&ttl=1535761361&ri=8192&rs=8192&setec=86b30600b960eb39482f0370694b7241"
    }
  ]
}