{
  "modId": 49712.0,
  "modName": "Dread Fort",
  "summary": "No DLC Required&#33;\r<br />Far to the south of Skyrim, between Falkreath and the border of Cyrodiil, there lies a long forgotten fort of the name; The Dread Fort. Recently, a group of warriors have claimed it as their own, awaiting a time when a great hero would rise and lead them to battle&#33;\r<br />",
  "descriptionHtml": "[img]http://oi42.tinypic.com/90niup.jpg[/img]\r<br />\r<br />[b]No DLC Required&#33;[/b]\r<br />Far to the south of Skyrim, between Falkreath and the border of Cyrodiil, there lies a long forgotten fort that might have once been a beacon of civilization to those in Cyrodiil. Now it is of the name; The Dread Fort. Recently, a group of warriors have claimed it as their own, awaiting a time when a great hero would rise and lead them to battle once again&#33;\r<br /> \r<br />This mod adds a customizable player home and four followers with their own special skills and armor enchantments.  \r<br />\r<br />If you are looking for a new place to hang your axe at the end of the day, then try out the fort/dungeon lifestyle of the Dread Fort.\r<br />\r<br /> \r<br />[img]http://i42.tinypic.com/5lt18l.jpg[/img]\r<br />The Dread Fort followers are listed below:\r<br />      &gt;\tFea Rana: I added this character from one of my other mods since I enjoyed having this follower. I tried to match what I did in the previous mod as well as add some new features.\r<br />      &gt;\tLucien: A Breton who favors the short sword and shield combo. Also has a cool visual enchantment to his armor. He often is traveling back and forth between the Dread Fort and Solitude.\r<br />      &gt;\tKendov: An Imperial who trusts in the sword and shield as well. His shield produces a ward when blocking.\r<br />       &gt;Ildoni Lacius: Has an otherworldly look about him and is a fearsome spectacle when in battle with is mighty greatsword.\r<br />\r<br />     Note: all these followers have the light foot perk so they should not set off any traps. When in the Dread Fort, they will all wonder around on a loose schedule.\r<br />\r<br />The Dread Fort Features:\r<br />       &gt;Lots of storage (safe, no re-spawn) chests as well as well as some custom containers\r<br />       &gt;Custom Enchanting and Alchemy workbenches\r<br />       &gt;Kitchen fitted out with cooking pots, fireplace, tables, storage, food, mead, and many other common kitchen items.\r<br />       &gt;Crafting room for forge, smelter, tanning rack, workbench, grinding wheel, and storage compartments.\r<br />       &gt;Great Hall with shield racks and statue.\r<br />       &gt;Tower Beacon that can be customized by changing the beacon type\r<br />       &gt;Tower room\r<br />       &gt;Battlements \r<br />       &gt;Common living area with lots of odds and ends (storage, beds, dining table, and some other special bits)\r<br />       &gt;Non-Skyrim music from Game of Thrones\r<br />       &gt;The door is initially locked, but the key is around the entrance (look under rock and stone)\r<br />There are a lot of little features that can be changed by activating them. \r<br />\r<br />\r<br />[img]http://i40.tinypic.com/2h5tx6o.jpg[/img]\r<br />     &gt;\tSkyrim\r<br />         Yep, that’s it&#33; No DLC or script extender is required for this mod.\r<br />\r<br />\r<br />[img]http://i43.tinypic.com/2128ns6.jpg[/img]\r<br />Being my first house mod, I want to make a project of it where you can make requests on some other features that should be added to this mod and I will see what I can do. Also, I intend to continue to update this mod as I learn.\r<br />I fully intend to update this mod and would like to hear suggestions on what you guys might like to see in some future versions. Be sure to post and comments or concerns in the comments section. \r<br />\r<br />Also, feel free to post any screenshots of this mod&#33;\r<br />Let me know what you think of it&#33;\r<br />\r<br />Check out my other Mods:\r<br />Fea Rana Follower\r<br />Istalindir Follower\r<br />Vares Rarem Follower\r<br />The Ilfirin Sgiathatch\r<br />Real Daedric Artifacts\r<br />\r<br />If you like this mod, don’t forget to endorse&#33;\r<br />\r<br />",
  "categoryId": "96",
  "version": "v1.0",
  "author": "Ghostrunner24",
  "createdUnix": "1390273865",
  "updatedUnix": "1390271087",
  "containsAdultContent": false,
  "uploadedBy": "Ghostrunner24",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092505",
      "name": "Dread Fort",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "114642",
      "fileName": "Dread Fort-49712-v1-0.zip",
      "uploadedUnix": "1390271087",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/83e256241226db5f1b90407608129170a3df943370aac89198f692d29d300f86/analysis/1407894994/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dread%20Fort-49712-v1-0.zip?fid=1000092505&ttl=1535830907&ri=8192&rs=8192&setec=d8e57135f198dfb8232f97ecda6e935f"
    }
  ]
}