{
  "modId": 49714.0,
  "modName": "A Night On the Rift",
  "summary": "A home-on-the-road that takes immersion to another level.",
  "descriptionHtml": "Don&#39;t you just hate it when you get out in the middle of nowhere and realize you forgot to put your tent, axe, and sleeping bag in your hip pocket?  And night&#39;s falling .. wolves are howling.\r<br />Well if you&#39;re in the Rift take heart and look to your map for the &#34;Rift Den&#34;.  It&#39;s a special place and once you&#39;ve used it you just might plan your next trip about using it again.\r<br />[list]\r<br />[*]17 points of activation that you use to change a large, deserted animal den into a cozy, functional, and secure &#34;home on the road&#34;.\r<br />[*]No need to rely on that which you don&#39;t have.  Essentials have been supplied by an altruistic (or heavy laden) previous tenant.\r<br />[*]No DLC or mod dependencies. It&#39;s all vanilla but far from common - one script, no bloat; no drop in Fps.\r<br />[*]Navmeshed and Cleaned with TES5edit for peace of mind.\r<br />[/list]\r<br />Welcome to\r<br />\r<br />[center][img]http://static-5.nexusmods.com/15/mods/110/images/49714-1-1389301100.jpg[/img][/center]\r<br />\r<br />[color=#ffff00]Location:[/color]\r<br />Turns out my old grandfather Yorik was a bit of a wanderer as well as an old seadog and I can only guess what else.  He had this map tucked into the fur-lining of an old iron cuirass he&#39;d left for me at [url=http://www.nexusmods.com/skyrim/mods/47152/?]Hindalok[/url].  Pure luck I found it.\r<br />The map shows several locations and a cave drawing with the words &#34;Rift Den&#34; next to it.  It appears to be due west of Riften by the base of the mountains and just north of a place called Avanchnzel..least I think that&#39;s what it says deciphering his scrawl.  Since I found this map it seems as though I can think of little else.  Tomorrow I&#39;m off on my next adventure.\r<br />\r<br />[color=#ffff00]Discovery:[/color]\r<br />This appears to be nothing more than a rather large and deserted animal den .. though there are definitely signs that somebody has been here before:  an old fire ring; empty wine bottles laying about...that figures.  Yorik was here&#33;  Camilla said they had to get a cart to haul away all the empty wine bottles when they cleaned out the house.  And here..behind this log..are some good looking hides.  He must have planned on using this place for more than one occassion to have left these behind.  \r<br />I see what he liked about this place.  With a little work this could be ideal for spending a night or two ... and will you look at that view&#33;  Anyway it&#39;s starting to get dark, and I should probably get things set up. \r<br />\r<br />[color=#ffff00]Preparations:[/color] (Points of Activation.)\r<br />[list]\r<br />[*]Get the campfire started. (Activator for the fire will only appear once the logs have been put in place.)\r<br />[*]Clean out some branches, bark, and a root plug to access supplies.\r<br />[*]You can choose to set up one or two sleep spots. The deer skins stashed near the chest will set up as windbreaks when you lay out the ground covers and bedding.\r<br />[*]Find the cookpot Yorik stashed and get it going.  Salt is in the pouch next to it but you&#39;ll need to provide the main course.  There should be plenty of game afoot in this area.\r<br />[*]There&#39;s water just below the entrance of the den.  Get some before dark &#39;cause you&#39;re probably not the only one that knows it&#39;s there.\r<br />[*]Before nightfall it might also be a good idea to take some precautions against intruders.  Check one end of the hollow log for some punji sticks the old man prepared. Finish by barricading the entrance.\r<br />[/list]\r<br />\r<br />[color=#ffff00]Other features:[/color]\r<br />[list]\r<br />[*]No actual chairs are provided but there are several places to sit: logs, rocks, on the bedding once it&#39;s set; even one in the mountain runoff pond for a &#39;polar plunge&#39;.\r<br />[*]Yorik left an old longbow, some arrows and an axe for emergency use in another end of the hollow log in a burlap sack behind a root plug.\r<br />[*]There&#39;s also a unique chopping log below the den. (It&#39;s not necessary to gather extra wood for this particular mod but maybe you just like the animation or need to restock for &#39;Frostfall&#39;.)\r<br />[*]Got a horse?  Don&#39;t leave your ride out in the cold.  There&#39;s enough room in the den and even some hay and apples to lay out for him.\r<br />[*]No bathroom? Poor soul, you&#39;re going to have to drop &#39;em in the woods.  Butt..there&#39;s a place for it.  Look for the shovel. Dig a hole first then sit on the branch if you must. :)\r<br />[*]There are only 3 containers you can use that are safe.  The one for fresh water will respawn. (If it wasn&#39;t clear before: this den is for overnights..not a home, so requests for MORE will likely receive LESS attention.)\r<br />[/list]\r<br />\r<br />[b]A bit more about the activators and sitting locations:[/b]  They&#39;re invisible but in likely locations.  Those that aren&#39;t (likely) are near one of the empty bottles laying about.  Find a bottle and you&#39;ll find an activator or seat very nearby. Again - not all activators have bottles next to them.\r<br />Several activators won&#39;t materialize until a previous action has been taken - ie. wood placed in fire ring before lighting; accessing the chest only after branches have been moved; etc.\r<br />If you wish to put things back you&#39;ll find you&#39;re best doing them in reverse order to be able to access all required activators. (A text-capture in the image section lists all activators and their dependencies.)\r<br />\r<br />[b]One issue:[/b]\r<br />Though carefully navmeshed to allow for companion use be aware they typically require time to adjust to a new nav especially in a new exterior.  Be prepared for some initial unusual behavior (like trying to walk over, under and through where they&#39;ve been blocked from walking).  It&#39;s a little disconcerting, but just try and ignore it.  They&#39;ll acclimate and settle down.\r<br />\r<br />I&#39;m just going to assume you know how to install a mod, so I&#39;ll wrap this up. \r<br />I hope you&#39;ll choose to support this mod, and if you do you have my deepest gratitude.\r<br />\r<br />-----------------\r<br />Update v2 1/11/14 corrects a major blunder I made while testing the chopping block to change its overall appearance.  I set it as a marker to test it and forgot to uncheck it when I made the unique version.  I noticed it when I went to use the block behind my house and it was gone ... though I could still chop wood.  So very sorry for the grief.  Second time I&#39;ve done something like that in my modding life, so I guess I should quit working on these so late. \r<br />-------------------\r<br />\r<br />Many thanks to Bethesda, the Dark One and his staff on the Nexus, TES5edit, and ALL who do support this community.\r<br />\r<br />Take care.\r<br />gary\r<br />\r<br />-----------------\r<br />Mods by gary62 for Bethesda/Obsidian games:\r<br />-----------------\r<br />On the Fallout4nexus -\r<br />[list]\r<br />[*][url=http://www.nexusmods.com/fallout4/mods/7307/?]Legends _ Saves[/url]\r<br />[/list]\r<br />\r<br />On the skyrimnexus - \r<br />[list]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/57944/?]The Cabin[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/56700/?]Providence _ A Settlement Near Ivarstead[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/54738/?]Skyview[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/53988/?]The Snowline[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/47152/?]Hindalok - Grandfather&#39;s Farm[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/49714/?]A Night On the Rift[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/59092/?]Legends Presets _ Famous Heroes and Heroines _ ECE CME saves[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/66989/?]Red Sonja _ Origins[/url]\r<br />[/list]\r<br />\r<br />On the newvegasnexus - \r<br />[list]\r<br />[*][url=http://newvegas.nexusmods.com/mods/46004]Rancho Villa[/url] - (Mod of the Month for May 2012)\r<br />[*][url=http://newvegas.nexusmods.com/mods/49173/?]Phoenix Point[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/46591]Ravens Nest[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/46862]Rathers Camp[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/50333/?]Legends Presets[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/50710/?]gary62 version of Fees Realistic Portable Tent[/url]\r<br />[/list]\r<br />\r<br />On the tesnexus - \r<br />[list]\r<br />[*][url=http://oblivion.nexusmods.com/mods/43084]Silverfish River Cabin[/url]\r<br />[/list]\r<br />\r<br />On the fallout3nexus -\r<br />[list]\r<br />[*][url=http://fallout3.nexusmods.com/mods/18055]Megaton Return[/url] - (Mod of the Month for Aug 2012)\r<br />[*][url=http://fallout3.nexusmods.com/mods/17492]Camp Meridian[/url] \r<br />[*][url=http://fallout3.nexusmods.com/downloads/file.php?id=17444]Hunters Ridge[/url]\r<br />[*][url=http://fallout3.nexusmods.com/downloads/file.php?id=16922]The Dockside Inn_v1b_Redux[/url]\r<br />[*][url=http://fallout3.nexusmods.com/downloads/file.php?id=16201]The g62 Housing Compilation[/url]\r<br />[*][url=http://fallout3.nexusmods.com/mods/19137/?]Legends Presets[/url]\r<br />[/list]",
  "categoryId": "67",
  "version": "v2",
  "author": "gary62",
  "createdUnix": "1389303593",
  "updatedUnix": "1389502625",
  "containsAdultContent": false,
  "uploadedBy": "gary62",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090658",
      "name": "A Night On the Rift",
      "version": "v1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "345",
      "fileName": "A Night On the Rift-49714-v1.7z",
      "uploadedUnix": "1389303307",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/c2e4173b292a64bc2cbe6222d961ffb672544011bf0200c58725e4d1e59a4c50/analysis/1407879393/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Night%20On%20the%20Rift-49714-v1.7z?fid=1000090658&ttl=1535830911&ri=8192&rs=8192&setec=02f3a7e0e3b78e4712b5d2bc4c882592"
    },
    {
      "fileId": "1000091022",
      "name": "A Night On the Rift",
      "version": "v2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "345",
      "fileName": "A Night On the Rift-49714-v2.7z",
      "uploadedUnix": "1389502625",
      "modVersion": "v2",
      "virusScanUrl": "https://www.virustotal.com/file/d2ae58804e4515255c8970f863ce0350fce21be7c7483ade44b3364ffd3b4dd4/analysis/1407882682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Night%20On%20the%20Rift-49714-v2.7z?fid=1000091022&ttl=1535830912&ri=8192&rs=8192&setec=77202423717a5bb7753bf6b7616d4c50"
    }
  ]
}