{
  "modId": 49713.0,
  "modName": "Cycle of the Silencer",
  "summary": "New quest, new player home, new spells.\r<br />A Silencer is a professional ghost hunter. There are five Silencers in Tamriel, and each time one of them dies they have to be replaced. Skyrim&#39;s Silencer was killed recently, and you were chosen to replace her. However, things just keep getting more complicated, until you realize those complication",
  "descriptionHtml": "YOU MUST ABSOLUTELY READ THE PART ENTITLED #The Quest BEFORE PLAYING\r<br />Otherwise, you will miss an important part of the content of this mod.\r<br />\r<br />CYCLE OF THE SILENCER\r<br />\r<br />\tA Silencer is a professional ghost hunter. There are five Silencers in Tamriel, and each time one of them dies they have to be replaced. Skyrim&#39;s Silencer was killed recently, and you were chosen to replace her. However, things just keep getting more complicated, until you realize those complications might lead you to much more than you expected...\r<br />\tMaster the Silencer&#39;s tactics, chase down ghosts both in Tamriel and in the mysterious plane of Oblivion called the Realm of the Lost, become Skyrim&#39;s new Silencer and inherit of the previous Silencer&#39;s mansion in the middle of the Veiled Woods, and perform your duties throughout radiant quests.\r<br />\r<br />-- Content --\r<br />\r<br />#The Quest\r<br />An original fully voice-acted quest (about three hours of gameplay) with choices and their consequences. \r<br />To start the quest, visit one of the main cities of Skyrim (Solitude, Windhelm, Whiterun, Riften or Markarth). No minimum level.\r<br />The quest is divided in four parts. You become a Silencer and get your new home at the end of the third part (&#34;Deeper Than Silence&#34;). However, the fourth part, named &#34;The Power of Beyond&#34;, is essential to fully profit from the mod. It might not start straight after the third part is finished. In that case, try asking people questions.\r<br />Cycle of the Silencer is the result of about 1300 hours of work in total.\r<br />\r<br />#The Mansion\r<br />A big (Windhelm palace style) mansion focused on comfort and style, where those two elements are combined with a number of containers, display racks, etc (you won&#39;t find a room filled with randomly scattered weapon racks and mannequins). The mansion holds everything a house can have in Skyrim, plus:\r<br />- An ingredient crafting table: allows you to make ingredients out of other ingredients or miscellaneous items.\r<br />- A soul gem forge: you can make bigger soul gems out of smaller ones (useful for enchanting), or you can make black soul gems out of black soul gems fragments.\r<br />You can move your spouse & children to this mansion if you want to by using this mod: Custom Family Home\r<br />www.nexusmods.com/skyrim/mods/47621/\r<br />The house has an underground, but you must furnish it first.\r<br />\r<br />#Become a Silencer\r<br />By becoming a Silencer, you will obtain:\r<br />- A set of light armor with enchantments to which you can add your own, plus a fast (realistic speed) two-handed sword. None of it is overpowered.\r<br />- One perk for each one of the three Silencer&#39;s skills: light armor, two-handed, and conjuration. Those perks allow you to make a better, more original and fun use of the Silencer&#39;s spells and equipment.\r<br />- A number of radiant quests with their own dungeons, suiting Silencer work.\r<br />- New spells and powers: some meant for ghost hunting (but they can be improved), a power making you stronger and conjuring allies for 3 minutes and a spell to go with it, that allows you to teleport to an enemy (throwing them away) while this power is active.\r<br />\r<br />-- Bugs / conflicts / requirements -- \r<br />\r<br />#Requirements\r<br />No requirements. \r<br />\r<br />#Compatibility\r<br />May conflict with mods concerning some areas around Winterhold. However, most of the quest (including all radiant quests) takes place in separate worldspaces, independent from the rest of Skyrim. \r<br />\r<br />#Known issues\r<br />- Might cause a floating grass bug (common bug in Skyrim) that you can fix by going somewhere there is no floating grass, saving and re-loading. \r<br />- When coming back from the mysterious place where you had to find three keys, Gregor might not be in his cave. In that case, just re-load the last auto-save.\r<br />- If you are unable to cast Mass Binding, make sure you have equipped the ring.\r<br />- If Mass Binding doesn&#39;t work after you killed all three bound ghosts, just load the last auto-save and try again. If the problem persists, enter in the console &#34;coc csrotl08village&#34;.\r<br />- If, after the assault in the graveyard, you talked to Gregor and then nothing happens, go into the haunted house and go back out.\r<br />- At the end of the final combat, the Beam of Power might not work when presenting the right gem. In that case, just save your game and re-load.\r<br />- If your game is crashing before a combat with Uskan: open the console, enter &#34;tcl&#34;, click on your follower (if there is any), approach Uskan, enter &#34;moveto player&#34; (if you had a follower), then enter &#34;tcl&#34; again and close the console. Do not get close to the door you came from again.\r<br />\r<br />-- Credits --\r<br />\r<br />#Developer\r<br />WitchRiser, AKA VitchRazor\r<br />\r<br />#Voice-actors\r<br />- Neffy &#39;Avese&#39; Acheson as Fadril Vandalas\r<br />- Bobshadow as Raddin\r<br />- WitchRiser (Vitchrazor) as Gregor Varlos & Uskan Seal\r<br />- Eline as Metteri & Haeva\r<br />\r<br />\r<br />-- Check out... --\r<br />\r<br />#The Warpers (looking for female voice-actors&#33; contact me at witch.riser@live.fr)\r<br />http://www.nexusmods.com/skyrim/mods/32873/\r<br />\r<br />#A Cure for the Nightmare\r<br />http://www.nexusmods.com/skyrim/mods/53153",
  "categoryId": "35",
  "version": "1.1.1",
  "author": "VitchRazor AKA WitchRiser",
  "createdUnix": "1390144021",
  "updatedUnix": "1404309339",
  "containsAdultContent": false,
  "uploadedBy": "WitchRiser",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092153",
      "name": "Cycle of the Silencer",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "62187",
      "fileName": "Cycle of the Silencer-49713-1-0.zip",
      "uploadedUnix": "1390124744",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/02e600f3b78f4973b0ed0022fceda0aa7c9872f70c0e642dc4ad585ac31830f2/analysis/1407892209/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cycle%20of%20the%20Silencer-49713-1-0.zip?fid=1000092153&ttl=1535830908&ri=8192&rs=8192&setec=76be498202916458899f63999c820aef"
    },
    {
      "fileId": "1000092735",
      "name": "Cycle of the Silencer",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "62188",
      "fileName": "Cycle of the Silencer-49713-1-0-1.zip",
      "uploadedUnix": "1390404519",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/41ee32dbd79441c686a6de1a846110bb9ff33896f9a749503ae4290cbd6123cd/analysis/1407897161/",
      "changelogHtml": " Silencer&#39;s vision: larger area, shorter duration, and will turn off correctly.   <br/> \n Radiant quests will no longer give multiple rewards. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cycle%20of%20the%20Silencer-49713-1-0-1.zip?fid=1000092735&ttl=1535830909&ri=8192&rs=8192&setec=f365522860d5a6a444354cbbe7a8968b"
    },
    {
      "fileId": "1000093274",
      "name": "Cycle of the Silencer",
      "version": "1.1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "62188",
      "fileName": "Cycle of the Silencer-49713-1-1-0.zip",
      "uploadedUnix": "1390644062",
      "modVersion": "1.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c4ebb284b493686a69bccf550df9bb35c4be21868b34016c61ba236379d569ee/analysis/1407900996/",
      "changelogHtml": " The Silencer&#39;s vision will now make the quest advance correctly. <br/> \n Added no hood armor option: you can get it in the entrance hall of Starmist Mansion. You need to have the original armor first. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cycle%20of%20the%20Silencer-49713-1-1-0.zip?fid=1000093274&ttl=1535830909&ri=8192&rs=8192&setec=01fe307b9c73ca633c8fb388ba1154d9"
    },
    {
      "fileId": "1000115564",
      "name": "Cycle of the Silencer",
      "version": "1.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "62190",
      "fileName": "Cycle of the Silencer-49713-1-1-1.zip",
      "uploadedUnix": "1404309339",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c60d53226efac78173bc98ecf8fde12eb1727d107281f34943bfbf483f065936/analysis/1408157629/",
      "changelogHtml": " Silencer jobs fixed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cycle%20of%20the%20Silencer-49713-1-1-1.zip?fid=1000115564&ttl=1535830910&ri=8192&rs=8192&setec=7d8cbcdde390aec75d5b7f9aafdae868"
    }
  ]
}