{
  "modId": 49728.0,
  "modName": "Jessiesgotafriend",
  "summary": "Redid several aspects at once (( could say taking several earlier mods and combining them to a single mod )) Armor breakdown, craftable Herthfire, craftable stormcloak gear, weightless misc and ingredients...",
  "descriptionHtml": "After talking with friends, about the weights of bees and other things, I started working on this little project, as it goes, new sections of the file set will be added to Optional till the final release. If you happen to choose to download everything, you can activate, deactivate the ones you want to keep through the mod mannager, or just unpack the ones you want into your Data folder of your Skyrim Data.\r<br />\r<br />IT REQUIRES ALL DLCs Update, Dawnguard, Hearthfires, Dragonborn.\r<br />\r<br />Each of the fallowing can be found in the mod, and each should be able to be turned on or off...\r<br />~   Apoth&#39;s Satchel of Holding.. All DLC content weights for ingredients = 0.0000 as the satchel is a bag of holding.\r<br />~   Misc Bag of Holding... Sets most of the Miscellaneous weights to 0.000\r<br />~   BYOH_Materials... adds the wooden sword, and doll to the Forge lists. Baskets into straw, 5 girl and 5 boys clothes to the tanning rack. Smelt empty bottles into glass or Clay into Queried stone.\r<br />~   Recipes.. With enough ore, it adds smelting 10 and 50 ingots at a time to speed up the stop at the smelter. Also adds the ability to make Storm Cloak Armor.\r<br />~  (Added Feb 16, 2014) ForgesArmor2Leathers.esp = Adds to the forge, the ability to break down leather, fur, and hide armors into Leather, or Leather strips, and adds a component that allows you to make 1 leather from 6 strips. Key component also protects the wearer from loosing the item if being worn, so if you are wearing the armor, you don&#39;t accidentally loose it and become naked.\r<br />\r<br />Update to come...\r<br />  Smelters... Melting Ingots from various armors...\r<br />  (( If anyone can help me to make a script that allows you to get most of the materials from the armors and weapons, I would be most appreciative, as I know nothing about scripts for Skyrim. ))\r<br />\r<br />   Installing is easy, just use the Nexus Mod Manager to load and unpack it into the data directory of your skyrim folder. Go into the Mod Manager list, check to activate, (or uncheck to deactivate) the (un)desired mods and Enjoy&#33;\r<br />\r<br />~Update\r<br />~Feb 19 ~ Added more Recipes \r<br />_Recipes : Forge Wooden items into firewood (bowls, plates...)\r<br />_Recipes : Smelt Dwarven bowls,plates ect. into ingots\r<br />_Recipes : Smelt castiron into ingots\r<br />_ForgeArmor2Leathers : Added Imperial Light Armor and Studded Armors to the list\r<br />\r<br />~Combining the Forge list with the rest of the pack, cleaning up the downloads\r<br />\r<br />(( The original file, if you still have it, JessiesGotAFriend.esp, required you to have Race Compatabillity, and would crash Skyrim without it. please remove my old file, as it is obsolete. ))\r<br />\r<br />((Modders, be sure to credit me for the work, if you use one or more of the mods in one of your works))\r<br />\r<br />sorry I been away for a while, got busy with other things.\r<br />\r<br />Update Feb 16 2015 - Working on (may not kick in with an area you have recently been at till the cell resets my own experience tells me that a new game might work better for this mod)\r<br />Adding an optional file, includes one script that I wrote, changes it so chopping wood is non stop, I got tired of getting kicked off after the 3rd swing all the time, Now I can cook dinner while my character chops wood, that I can carry to one of the NPC to sell... &#34;Chop all the wood you can carry&#34; now in one sitting. (this is my first script for Skyrim) WARNING: This optional file WILL conflict with any mod that changes the scripts/settings for chopping blocks.\r<br />NonstopChopping - Requires Hearthfires (for the time being)\r<br />Done, I think: Add chopping block for every player home in Skyrim, so saved games has access to a non stop chopping blocks not far from homes. Not far from every player home for Skryim and hearthfires, I have added one of the chopping blocks, on a saved game, you know when you land on one of mine, it won&#39;t kick you off after the 3rd swing. (If I missed any of the vanilla and hearthfires DLC homes, let me know)",
  "categoryId": "28",
  "version": "0.23",
  "author": "AiriannaWW",
  "createdUnix": "1389327734",
  "updatedUnix": "1424234799",
  "containsAdultContent": false,
  "uploadedBy": "AiriannaWW",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097811",
      "name": "MultiBatchData",
      "version": "0.23",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30",
      "fileName": "MultiBatchData-49728-0-23.rar",
      "uploadedUnix": "1392829685",
      "modVersion": "0.23",
      "virusScanUrl": "https://www.virustotal.com/file/433a78d51b6c7f78e4e40d02f6f781626d8bafbe38990d60530b8b15f8c581d0/analysis/1407940618/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MultiBatchData-49728-0-23.rar?fid=1000097811&ttl=1535830941&ri=8192&rs=8192&setec=27e2737b29fa848a172019bd0d1ab1ec"
    },
    {
      "fileId": "1000147911",
      "name": "Non Stop Chopping",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "52",
      "fileName": "Non Stop Chopping-49728-.rar",
      "uploadedUnix": "1424234799",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/825509ea9038ae1c230488f36eabaa60a2e0e2bb47e4a3ac2027ca3740e46d97/analysis/1424234822/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Non%20Stop%20Chopping-49728-.rar?fid=1000147911&ttl=1535830941&ri=8192&rs=8192&setec=4bdd577252472ed0bd1d0beb5daf363f"
    }
  ]
}