{
  "modId": 49757.0,
  "modName": "Paradise island worldspace",
  "summary": "New island worldspace from an abandoned mod. Mod resource for use in creating a finished mod out of it.",
  "descriptionHtml": "This is an island worldspace from an abandoned mod I was working on. Has a town complete with NPC&#39;s and basic AI packages. Interiors are fully decorated and navmeshed. Has a small village far in the north. A fort and mine. Theres a hunters camp and a fishermans shack as well. allot of decore outside is complete. Many many details throughout. The world itself I would say is over 90% complete, but could use your decorating.\r<br />\r<br />Temporary door outside the Whiterun gate near the drawbridge that leads to a door on the docks outside the main village. I never got around to placing a boat at one of the ports for use as the travel point.\r<br />\r<br />LOD needs to be redone after exterior changes are done, one is included but there are some issues with it that was never fixed. The included LOD is just to help see whats there and not meant for finished mod.\r<br />\r<br />Uses only Skyrim resources and no DLC right now so no need to strip it of DLC items and remove the master. It can easily have masters added and items from those used.\r<br />\r<br />Free to use to create a new island world, modify it as you wish. Once modified and made into a mod you have full permission host it wherever you wish. Odd I have been asked about that before, you use it then it is yours to do with as you please. All i want is a thank you in the description for the begining creation of the island. ",
  "categoryId": "82",
  "version": "1",
  "author": "jet4571",
  "createdUnix": "1389421181",
  "updatedUnix": "1389420981",
  "containsAdultContent": false,
  "uploadedBy": "jet4571",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090865",
      "name": "Paradise Island",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32568",
      "fileName": "Paradise Island-49757-1.zip",
      "uploadedUnix": "1389420981",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4980d24b19bb0d0964265773171539c1c2cfe8c39dd80d1350645691394973cd/analysis/1407881270/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paradise%20Island-49757-1.zip?fid=1000090865&ttl=1535830996&ri=8192&rs=8192&setec=a7e6308694c6c7a64da7d297b927e208"
    }
  ]
}