{
  "modId": 49777.0,
  "modName": "CM Wooden Bows",
  "summary": "Turns the metal bows in Skyrim into wooden bows with metal reinforcing.",
  "descriptionHtml": "CM WOODEN BOWS\r<br />\r<br />DESCRIPTION\r<br />Metal is a very poor material to use to make a bow.  Historically, bows have always been constructed with wood which is much more pliable and easy to use.  This mod turns the metal bows in Skyrim into wooden bows with metal reinforcing which produces much more elegant, much more beautiful weapons.\r<br />\r<br />VERSION 2 MAIN FILE\r<br />\r<br />CM Wooden Bows - All-in-One: This is a compilation of all the replacer files including the Daedric, Dwarven, Ebony, Elven, Falmer, Glass, Orcish, Nordic, Stalhrim, and Auriel&#39;s Bow. DLC bows are supported, but DLCs are not required for this mod since unused textures in the bsa won&#39;t hurt anything. \r<br />\r<br />Wooden bows AND multiple choice options removed to reduce the size and simplify the mod.  \r<br />\r<br />VERSION 2 iNSTALLATION\r<br />\r<br />Extract CM Wooden Bows - All-in-One, place the files into your Skyrim Data folder, and activate the esp from your launcher window. Or install with your favorite mod manager. \r<br />\r<br />VERSION 1 INSTALLATION\r<br />\r<br />CMWB Replacer - All in One: Replaces all metal and wooden bows in the game.  \r<br />\r<br />1. Extract CMWB Replacer - All-in-One, place the files into your Skyrim Data folder and activate the esp from your launcher window.  Or install with your favorite mod manager.\r<br />\r<br />2. Conflicts: The replacer versions of this mod will conflict with any mods that replace the same items. By &#34;same items&#34; I mean any of the textures from the bows listed above, or the daedric bow mesh (I needed to remove the glow from the bottom of the daedric bow or else it would&#39;ve looked strange against the wood...other than that, no other meshes were changed). There are no conflicts however with bows that are changed in the Creation Kit. In other words, if you have a mod that changes the stats on the bows, this mod won&#39;t conflict with it.  \r<br />\r<br />\r<br />BUGS\r<br />\r<br />-Not really a bug but a notation: I haven&#39;t changed the forsworn bow because, in keeping with my need for uniformity, I would&#39;ve ended up changing all the forsworn weapons to match (as I did with the nord hero weapons). Since I don&#39;t really like the forsworn weapons to begin with, I decided to hold off for now.\r<br />\r<br />-Please report any bugs you find.\r<br />\r<br />RECOMMENDED MODS\r<br />\r<br />Immersive Sounds - Weaponry: This mod contains my favorite bow sounds overhaul, as well as fantastic new sounds for all the weapons. The entire Immersive Sounds suite of mods is exceptional. Find it here:  http://www.nexusmods.com/skyrim/mods/45314/?\r<br />\r<br />Thinner Ebony Bow: Not shown in my screenshots, but it&#39;s an excellent re-mesh of the ebony bow.   http://www.nexusmods.com/skyrim/mods/6940/? ",
  "categoryId": "55",
  "version": "2.0",
  "author": "Cutthroat Mods",
  "createdUnix": "1389460189",
  "updatedUnix": "1389473211",
  "containsAdultContent": false,
  "uploadedBy": "Blackie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090930",
      "name": "CM Wooden Bows - All in One",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "55728",
      "fileName": "CM Wooden Bows - All in One-49777-1-0.rar",
      "uploadedUnix": "1389453899",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fa880153edc8bbd8262f32ba279e39e1a07de23e6195cfb9dd777b58fad11494/analysis/1407916614/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CM%20Wooden%20Bows%20-%20All%20in%20One-49777-1-0.rar?fid=1000090930&ttl=1535831027&ri=8192&rs=8192&setec=cfe2265911dd8a21969ee634e4fd8ab4"
    },
    {
      "fileId": "1000090978",
      "name": "CM Wooden Bows - All in One",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13710",
      "fileName": "CM Wooden Bows - All in One-49777-2-0.rar",
      "uploadedUnix": "1389473211",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/e0ba38677dc0b8bca884758c7e6964549b1d552f052ba42546471e8c04d067fc/analysis/1407882201/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CM%20Wooden%20Bows%20-%20All%20in%20One-49777-2-0.rar?fid=1000090978&ttl=1535831027&ri=8192&rs=8192&setec=5d2296e00cdba8577b4d58a7adcd12e5"
    }
  ]
}