{
  "modId": 49770.0,
  "modName": "Bookshelves Updated SKSE Script",
  "summary": "The mod re-does the way bookshelves work to allow placement of up to 48 books. In practice this number is usually never reached, because depending on book size, usually less than 30 fit in the wide bookshelves (otherwise they&#39;d be on the floor). So you can use the entire bookshelf now is the end result.",
  "descriptionHtml": "Two immediate issues I&#39;ve noticed: [s]Placing a book with no bounds will place it on top of the previous book, which will make things go crazy as the books try to work out the physics of two objects occupying one point in space = paradox (AFT Readme book for example has no boundary info). The other issue is about the end book, it&#39;s meant to have physics disabled so it stays standing, but for some reason I must have been testing other ways and left the physics enabled so the books topple over IF the end book is not &#34;large&#34; (4.0+ bounds on I forget which axis).\r<br />\r<br />I will add a safety check for books with no boundary info, and those will just get returned to the player. I will fix the end book toppling over by disabling the physics on that book again.[/s]\r<br />\r<br />These issues are fixed in 1.3.1, with the caveat that if you manually remove the left most book, then you will wind up having a duplicate copy when you open the bookshelf container. As always, if you manually remove the right most book, there is nothing to keep the other books from falling over for the most part. (By manually remove, I mean activating the book itself and taking it instead of going into the bookshelf as a container to take it.)\r<br />\r<br />Maybe I will add a book-end object that can be placed and moves with the books when one in taken out, especially the far end book.\r<br />\r<br />I&#39;ve also noticed the books seem to topple in the [url=http://www.nexusmods.com/skyrim/mods/10891/?]Unlimited Bookshelves[/url] script, so I will look at making my script compatible once its working as intended again.\r<br />\r<br />[b]Status Update on July 14th, 2016: [/b]I haven&#39;t been playing Skyrim for the past two years, ever since my 2TB storage drive with all my hundreds of cleaned/sorted/patched mods failed. I&#39;ve gotten interested in playing again this month, so I will look this over and see if I can fix any issues. I&#39;m still surprised how many people have used and endorsed this simple script I made for what I thought wasn&#39;t something most other people cared about, so that&#39;s really cool to know other people like their books to stay on the shelves too. Someone even called this an &#34;elegant&#34; solution, which made me laugh but is also appreciated.\r<br />\r<br />I&#39;ve seen that [url=http://www.nexusmods.com/skyrim/mods/10891/?]Unlimited Bookshelves[/url] is back, so I expect everyone is using that now. I will keep this around for people who just want books fixed, but by no means do I want to deter people from using that much more exhaustive bookshelf mod. I haven&#39;t used it yet, but I will be trying it out myself this week.\r<br />[line]\r<br />[b]Description of the mod:[/b]\r<br />The mod re-does the way bookshelves work to allow placement of up to 48 books. In practice this number is usually never reached, because depending on book size, usually less than 30 fit in the wide bookshelves (otherwise they&#39;d be on the floor). So you can use the entire bookshelf now is the end result.\r<br />\r<br />The books appear in the order they are put into the shelf, and are added left to right when another book is placed. Unfortunately, this means you have to take every book out first in order to place books to the left side of the current placed books. I will see if there is some way to possibly pick where to put books in the shelf order, but I am new to papyrus and skse&#39;s features and limits.\r<br />[line]\r<br />[b]Requirements:[/b]\r<br />SKSE is required. This mod will work with or without any dlc, and it should work with almost all mods. It only alters two scripts, and is only called when you activate a bookshelf or remove a book from it by reading and taking without opening the shelf itself.\r<br />\r<br />Mods which place new bookshelves or alter existing bookshelves may or may not work as intended. I have tested Dev Aveza and the bookshelves on board are not working with this mod. The reason, from what I can tell, is that these are normal shelves which have had the special bookshelf displays placed over them, and they don&#39;t have the trigger script for removing books by &#34;reading + take&#34; instead of opening the bookshelf and taking it from the container. As long as you don&#39;t take books directly off the shelf, they should otherwise work fine.\r<br />\r<br />[b]Installing:[/b] Extract the folder Scripts of the 7zip file to your SkyrimData folder. You should have 2 files with .pex extensions to move to SkyrimDataScripts. The optional source folder is not needed for the mod (.psc extension) and can be deleted if you don&#39;t plan on modifying the scripts yourself. You can leave books on any bookshelves you own if you are using either vanilla or mcguffin&#39;s scripts, and the new scripts will seamlessly handle the transition. I think.\r<br />\r<br />If you are using a different mod, first remove all books from any bookshelves, save, and follow the uninstall instructions for that mod. Then install this one and start placing your books as desired.\r<br />\r<br />[b]Updating:[/b] Overwrite the old files in the same way as before, and there is no need to remove books from the bookshelf first.\r<br />\r<br />[b]Uninstalling:[/b] First remove all books from any bookshelves you are using and save the game.\r<br />Next delete the files &#34;playerbookshelfcontainerscript.pex&#34; and &#34;PlayerBookShelfTriggerSCRIPT.pex&#34; from SkyrimDataScripts\r<br />\r<br />Also delete the two optional source files &#34;playerbookshelfcontainerscript.psc&#34; and &#34;PlayerBookShelfTriggerSCRIPT.psc&#34; from SkyrimDataScriptsSource if you moved them there.\r<br />\r<br />Now you can load the game and it will use the old bookshelf system or any other modded system you install.\r<br />\r<br />The two .psc files are included for anyone who wants to edit the scripts, and can safely be deleted at any point while using the mod because they are not used by the game.\r<br />[line]\r<br />[b]Recommended mods:[/b]\r<br />[i]Book Covers Skyrim[/i] by DanielCoffey at [url=http://skyrim.nexusmods.com/mods/35399/?]http://skyrim.nexusmods.com/mods/35399/?[/url]\r<br />The important reason to get this mod is to fix the book boundary values (which are missing or wrong on a lot of books) so that the books will fit appropriately against each other and occupy the right amount of shelf space. The added benefit is that this mod makes books look really fantastic (I recommend desaturated colors). When I first heard about it, I thought it would be adding tacky covers to the book the way they do with modern books (glossy, ugly things taped on with flashy pictures that hide the actual book), but that isn&#39;t what it does as it turns out. It makes the books look more unique and detailed, and stylish (legible) titles on the covers/spines. It changes notes and letters as well, adding many interesting varieties. This mod should be placed near the end of your load order to ensure no book fixes are overwritten.\r<br />\r<br />[s][i]Dragonborn Book Bounds Fix[/i] by lessens at [url=http://skyrim.nexusmods.com/mods/39671/?]http://skyrim.nexusmods.com/mods/39671/?[/url][/s]\r<br />Book Covers Skyrim fixes many book boundaries, but it doesn&#39;t touch Spell Tome boundaries. That&#39;s where this mod comes in, as it has fixes on spell tomes that are useful if you plan to place them on bookshelves. [s]Place this mod before Book Covers Skyrim in your load order or you will lose the improved book cover models/textures on many books.[/s] These fixes are in [url=http://www.nexusmods.com/skyrim/mods/71214/?]USLEEP (Unofficial Skyrim Legendary Edition Patch)[/url], and everyone should already have that as your first mod to download.\r<br />[line]\r<br />[b]Issues:[/b]\r<br />[list][*]Sometimes the last book to the right doesn&#39;t show up if the remaining space is a close to maximum and its size is barely able to fit, but it still is treated as having fit by the code that returns books to the player, so I will work on that.[b].[/b]\r<br />[*]Sometimes the normal/smaller books (which have dynamic physics enabled) will lean into larger books which are static, and clip slightly into it. This is only a small amount, and its not as bad as would happen in the previous script when the books would sometimes &#34;fuse together&#34; into inseparable blobs of books.\r<br />[/list][line]\r<br />[b]Suggestions:[/b]\r<br />[list][*]You can try opening a closing the bookshelf to get different results if the books shift the wrong way during rendering. Sometimes the big books fall wrong and then don&#39;t drop to the shelf before the physics is altered, so they need reset. I will try to find a way to check for whether or not they are a certain distance higher than the other books and move them automatically. With the normal/small books, you can drag them and nudge them around since they have the havok re-enabled after loading up, but it can be mixed results and mess them up worse. You only need to open and close the shelf to try again.[b].[/b]\r<br />[*]Try to find a large book with good bounds and put it after any smaller books and before any larger books (which tend to have the least accurate bounds it would seem). The normal size books tend to lean to the right, but fortunately they don&#39;t lean into the other normal/small size in most cases. The bounds + physics enabled seems to keep the normal sized books properly supported against each other, but unfortunately they lean into books set static. The problem is that the large books become distorted when they are set to use dynamic physics; the covers pop out and crease in the bidnings and the pages try to escape into the adjacent books. I am not sure if this could be fixed by adjusting the bounds on the larger books or by playing with the physics more, but I am looking into it.\r<br />[/list][line]\r<br />[b]Update 1.3.0:[/b] Improved the physics by treating large books as thin boxes, so there should be no clipping as smaller books lean against them and the large books can be moved by the player grabbing them (plus they fall down to proper height if they are higher than they should be from a glitch with the papyrus MoveTo() function). The same is done for the end book, so now it shouldn&#39;t fall over but it can still be moved by the player* (I was wrong, the end book does still tip over, but its not really noticeable if its a large book so use a large book on the end for now.)\r<br />\r<br />Note: The books are 1 unit above the shelf because that is where Bethesda put the invisible marker that tells the physics the surface is, so if I move the books down to the real surface they will just pop up to the current spot when physics is enabled (or sooner if they move before the disable script runs when placing the books). This could probably be fixed in the CK by editing the bookshelf model.\r<br />\r<br />The script won&#39;t have to be changed if that is fixed, because it places the books on whatever spot is set as the surface, so it would just be a separate .esp to be loaded.\r<br />[line]\r<br />[b]More on Bookshelves[/b]\r<br />The bookshelf has a container part like any normal chest which is where the books are held (references to the books that can be used to load them into your inventory to be more precise). The the game collects the model information from the books in this container using magic and renders them on the shelf, but essentially the book (if it were a tangible object) is still safe in a chest while another copy of it is sitting proudly on display. So even if a book isn&#39;t showing up on the shelf, it&#39;s still going to be in that container and able to be retrieved by opening/activating it. Any book not actually able to be displayed (no more room for it on the shelf) should return to the player&#39;s inventory. Books that do show up on the shelf can either be picked up normally by using it or retrieved by activating the chest to look in the container. I think that&#39;s accurate information, but I&#39;m making assumptions from looking at code and trying out things in the game.\r<br />[line]\r<br />[b]Other notes:[/b]\r<br />Sometimes you will get an error in papyrus logs which I&#39;ve posted at the bottom of this description, but it only means the script is not finishing loading a book before trying to modify the book&#39;s physics. This will happen when you have other scripts taking up resources, and isn&#39;t anything harmful aside from books possibly moving out of position. If some books fall too much and look out of place, just try opening and closing the bookshelf again until it works right. I&#39;ve tried to find a balance between waiting long enough to ensure the book has rendered and not waiting too long for the book to fall out of place.\r<br />\r<br />The script disables the physics of each book shortly after rendering the book, then renders the next book. After all books have been rendered, each book from left to right has its physics re-enabled (so they will appear to jump up and down a bit and shift into usually a better fit). I have decided to keep the physics on large books disabled, because they tend to distort and mess up themselves and the books around them; its best to group large books together and preferably at the end of a row. The right end book is also kept static so that it doesn&#39;t fall and acts as a bookend.\r<br />\r<br />This script was tested in Breezehome, so if you have shelves it doesn&#39;t work well on, please post a comment. If the boundaries of a book are incorrect, it will possibly overlap other books or have a large gap around it depending on the amount of error. Please report any books with issues that are not covered by the recommended mods in the comments and I will try to make a patch for them.\r<br />\r<br />Please post any issues in the comments, since I have only tested it on my own save game and only in Breezehome. I am using 200+ mods and a number of them are scripted, so it should work for most people. I will release any further tweaks I make to improve positioning of books or patches for book bounds/sizes or bookshelf bounds.\r<br />[line]\r<br />[b]This error can be ignored.[/b]\r<br />Error:  (FF001C6B): has no 3d, and so cannot have its motion type changed.\r<br />stack:\r<br />   [ (FF001C6B)].ObjectReference.SetMotionType() - &#34;&lt;native&gt;&#34; Line ?\r<br />   [ (00102A81)].playerbookshelfcontainerscript.UpdateBooks() - &#34;PlayerBookShelfContainerScript.psc&#34; Line 328\r<br />   [ (00102A81)].playerbookshelfcontainerscript.OnActivate() - &#34;PlayerBookShelfContainerScript.psc&#34; Line ?",
  "categoryId": "78",
  "version": "1.3.1",
  "author": "mdr",
  "createdUnix": "1389438522",
  "updatedUnix": "1468727050",
  "containsAdultContent": false,
  "uploadedBy": "eventHandler",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091331",
      "name": "Bookshelves Updated SKSE Script",
      "version": "1.2.0a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14",
      "fileName": "Bookshelves Updated SKSE Script-49770-1-2-0a.7z",
      "uploadedUnix": "1389622273",
      "modVersion": "1.2.0a",
      "virusScanUrl": "https://www.virustotal.com/file/586c268c3a595803316a3be05d7defe2a7c5f18ebceb011a8633728f2efce7ea/analysis/1407884778/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bookshelves%20Updated%20SKSE%20Script-49770-1-2-0a.7z?fid=1000091331&ttl=1535831014&ri=8192&rs=8192&setec=3ef3a9ca3ac7de653003ad8c2d648853"
    },
    {
      "fileId": "1000091335",
      "name": "Bookshelves Updated SKSE Script",
      "version": "1.3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14",
      "fileName": "Bookshelves Updated SKSE Script-49770-1-3-0.7z",
      "uploadedUnix": "1389624084",
      "modVersion": "1.3.0",
      "virusScanUrl": "https://www.virustotal.com/file/500e7a6a69609ee21bba0f9c9122818a0162c820c597f57946c4b3927beef1ce/analysis/1407884780/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bookshelves%20Updated%20SKSE%20Script-49770-1-3-0.7z?fid=1000091335&ttl=1535831015&ri=8192&rs=8192&setec=8bae9fcd0b6fede611f04312a10848de"
    },
    {
      "fileId": "1000213448",
      "name": "Bookshelves Updated SKSE Script",
      "version": "1.3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Bookshelves Updated SKSE Script-49770-1-3-1.7z",
      "uploadedUnix": "1468727050",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/15582daa4d54ebb37244bb6818bccc793c862ddc161309b04a480d19786a2ebd/analysis/1468727103/",
      "changelogHtml": " added safeguard against books with no boundaries defined, so they are now returned to the player <br/> \n fixed right-end book not staying up, so other books won&#39;t fall now unless disturbed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bookshelves%20Updated%20SKSE%20Script-49770-1-3-1.7z?fid=1000213448&ttl=1535831015&ri=8192&rs=8192&setec=2d00bf50f0a9218f7be56803094d9228"
    }
  ]
}