{
  "modId": 49780.0,
  "modName": "Ayleid Armory",
  "summary": "Full set of Ayleid armor and several weapons, located at the College of Winterhold.",
  "descriptionHtml": "Hey, guys&#33; As anyone who knows me knows well, I am absolutely obsessed with Ayleids. So I decided to make this and share it with everyone&#33; \r<br />\r<br />All equipment has the same minimum stats as Dragonscale Armor/Dragonbone Weapons, and it&#39;s unenchanted so that you can add enchantments relevant to your own style of gameplay. I’m a bit of a lore stickler, so I put them in the only place they might have any business being – with nosy mages. They can be found in the College of Winterhold, to the left of Urag gro-Shub’s desk in the Arcanaeum. There’s a picture up there in case you need any more direction :) And if you aren’t a member of the college/don’t want to be/don’t give a hoot about realism, here are the object IDs for each. (In case you don’t know, you can add them to your inventory by pressing the `/~ key and typing “player.additem _______”.) \r<br />\r<br />xx002f9a – Armor \r<br />xx002f9b – Boots \r<br />xx002f9c – Gauntlets \r<br />xx002f9d – Helm \r<br />xx002fa4 – Shield \r<br />xx002f9e – Bow \r<br />xx002f9f – Dagger \r<br />xx002fa0 – Sword \r<br />xx002fa0 – Amulet \r<br />\r<br />Unfortunately, this mod requires Dawnguard, so if you don’t have that, I’m very sorry. If you do, then rest assured that nothing should conflict with this (but let me know if something does come up, I’ll try to help you out&#33;) \r<br />\r<br />To that end, you can contact me here for help – or, if you would like a reply as fast as possible, you can inbox me on Tumblr. I also take requests, so let me know if you want anything&#33; \r<br />\r<br />Cheers, \r<br />Tabytha C\r<br />\r<br />v 1.0: Initial release. \r<br />v 1.1: Added high-resolution cuirass. \r<br />v 1.2: Replaced missing texture for male cuirass mesh.\r<br />v 1.3 (not yet released): Add Ayleid battleaxe, war axe, and longsword.",
  "categoryId": "54",
  "version": "1.2",
  "author": "tabythablabytha",
  "createdUnix": "1389460339",
  "updatedUnix": "1389460339",
  "containsAdultContent": false,
  "uploadedBy": "tabythablabytha",
  "primaryFile": null,
  "files": []
}