{
  "modId": 49784.0,
  "modName": "Equipping Overhaul",
  "summary": "Equipping Overhaul is a complete overhaul on Skyrim&#39;s system of swapping, equipping, and dropping items.  Complete with a MCM menu, all features can be reconfigured (or even disabled) to your liking&#33;  The mod can be broken down into four major features: Dual Sheaths, Geared Up, Realistic Unequip, and Lit Torches.",
  "descriptionHtml": "[size=3][center]Sorry for taking so long getting back, but the website is up&#33;  All the art assets are entirely temporary, but the site itself is ready for use: [url=http://dragondudemods.forumotion.ca/]http://dragondudemods.forumotion.ca/[/url]\r<br />\r<br />E.T.A. For [url=http://www.nexusmods.com/skyrim/articles/49653]Next Update[/url]: Unknown[/center][/size]\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/sSbds.png[/img][/url][/center]\r<br />[center][b]G.E.M.S. January 2014 Mod Of The Month[/b][/center]\r<br />[center][b]Nexus Mods 3rd F.O.T.M. January 2014[/b][/center]\r<br />\r<br />[img]http://www.mediafire.com/convkey/5aa6/f7z1t2uv8cz8679fg.jpg[/img]\r<br />\r<br />Equipping Overhaul is a complete overhaul on Skyrim&#39;s system of swapping, equipping, and dropping items.  Complete with a MCM menu, all features can be reconfigured (or even disabled) to your liking&#33;  The mod can be broken down into four major features: Dual Sheaths, Geared Up, Realistic Unequip, and Lit Torches.\r<br />\r<br />[line]\r<br />[size=3][b][center]Version 4.xx Videos[/center][/b][/size]\r<br />[center][youtube]7SKj1Y5c11Y#t=256[/youtube][/center]\r<br />[center][b]By [url=http://www.youtube.com/user/shinji72skyrim?feature=watch]shinji72[/url]&#33;  Spectacular showcase of the Alpha release, thanks&#33;[/b][/center]\r<br />[line]\r<br />[size=3][b][center]Pre 4.xx Videos[/center][/b][/size]\r<br />[center][youtube]ZOMMFLLo59s[/youtube][youtube]OKBt1x_P1SA[/youtube][/center]\r<br />[center][b]Left by [url=http://www.youtube.com/user/Brodual?feature=watch]Brodual[/url]&#33;  Right by [url=http://www.youtube.com/user/GophersVids?feature=watch]Gopher[/url]&#33;  Thanks for the videos, they are awesome&#33;&#33;[/b][/center]\r<br />[center]Note: Gopher&#39;s suggestions have been accomplished&#33;&#33;[/center]\r<br />[line]\r<br />\r<br />[img]http://www.mediafire.com/convkey/f0f1/eyrdg4u8rttuw8pfg.jpg[/img]\r<br />\r<br />[b]NOTE:[/b] This feature is only present in the 4.25 alpha build.\r<br />\r<br />Equipping Overhaul&#39;s only mandatory feature is Dual Sheaths.  This feature makes the sheathes for left hand equipment, including swords, maces, and war axes.  Additionally, sheathed staffs are also displayed&#33;  I operates in a similar manner to Dual Sheath Redux, but without a patcher.  It is also integrated into the Geared Up feature.\r<br />\r<br />Currently, shields do not sheath onto the player&#39;s back while equipped.  Instead, they only appear on the player&#39;s back when they are favourited via the Geared Up feature and not equipped.\r<br />\r<br />[img]http://www.mediafire.com/convkey/029a/kemn7k8pjebdbhefg.jpg[/img]\r<br />\r<br />Within the Skyrim INI settings there is an option called geared up, or more commonly Armed to the Tooth - Easy.  By activating this INI setting you can become fully armed.  One favourited weapon of each type (bow, two-handed, sword, mace, etc.) will become visible on your character.  This shows off your equipment while being more immersive.  Unfortunately, the ini setting is plagued with major bugs, including a major issue when you swap weapons while they are drawn.  Many people combat this by tediously sheathing their weapons before equipping/unequipping anything, at the cost of immersion and time.\r<br />\r<br />Be bothered no more&#33;  Equipping Overhaul achieves the same feature, but without the bugs&#33;  Not only that, but it can be toggled and configured on the fly&#33;  Just get Equipping Overhaul and open the MCM menu&#33;  You don&#39;t even have to touch your INIs&#33;  Equipping Overhaul completely and entirely fixes all bugs with Geared Up with no drawbacks&#33;  Are you excited yet&#33;?&#33;  This well known geared up setting can be used seamlessly and now there is a long wanted fix for all of its issues&#33;  Go ahead, swap your weapons while they are drawn&#33;  Other miscellaneous bugs are also fixed, including disappearance of favorite weapons while unequipping&#33;  Race transformations like Vampire Lord and Werewolf have also been fixed&#33;  But wait, there&#39;s more&#33;\r<br />\r<br />In addition, there is also an optional hotkey to fast toggle between Geared Up.  This means you can now hide your weapons while still maintaining immersion and ease of use.  This works especially well if you don&#39;t want to waltz into a town looking as though you plan to murder everyone.  You can also configure the mod via the MCM menu to only display certain types of equipment&#33;\r<br />\r<br />It also utilizes the Dual Sheaths feature to display multiple one handed weapons of the same type.  Moreover, favourited shields are displayed on your back when no shield is equipped.  Favourited staffs are displayed on your back too&#33;\r<br />\r<br />[img]http://www.mediafire.com/convkey/19d5/w9srhs5tqaiemjffg.jpg[/img]\r<br />\r<br />The second part of the mod is called Realistic Unequip.  It&#39;s a realistic form of unequipping that adds to Geared Up or vanilla play.  It makes you drop the item in your hand when you unequip/swap it [b]while it&#39;s drawn[/b].  Your weapons will switch as normal without dropping if you sheathe them first&#33;  It&#39;s definitely more immersive because when in intense combat you won&#39;t sheathe your sword and mace to pull out your bow or staff, you&#39;ll drop them and grab the new weapon.  Same thing goes for shields and torches too.  It adds a whole new level to immersive fighting.  Think about it... I&#39;m fighting a dragon, shooting it with my bow.  The dragon lands right in my face, I&#39;m not going to sheathe my bow and get out my sword.  I&#39;m going to drop the bow and pull out my sword.\r<br />\r<br />It works at all times, whether you use the favourite menu, the inventory menu, or hotkeys&#33;  The mod also works with hotkey changing mods like SkyUI and More Hotkeys Please&#33;  This feature can also be disabled in the MCM menu if you like.\r<br />\r<br />Now you can also immersively search for your auto-dropped item.  If you want the full animation make sure your left is not holding a torch or shield&#33;  Your character will attempt to point you in the direction of one of your auto-dropped items, though he can only remember 10.  There are optional hotkeys to start the search as well as cycle through all the auto-dropped items.  There is also a power obtained via the MCM menu that allows you to quickly gather all the dropped equipment at once&#33;\r<br />\r<br />Also auto-dropped items will now be remembered as favorites&#33;&#33;  This will only be true for the remembered items (the first 10) though.  Please note that the remembered auto-dropped items (the first 10) will be generic versions while on the ground.  This means your Dwarven Bow (Fine) will be a Dwarven Bow.  When you pick it up it will be a Dwarven Bow (Fine), so don&#39;t worry.  This will remain as such until the SKSE team implements favorites related functions (when that happens crossbow issue will be fixed quickly as well).\r<br />\r<br />Another new feature is a fix of the disappearing items&#33;  Due to issues in the game engine, sometimes items that are dropped via script will fall through the world, fall through a wall, or simply disappear...  You may have noticed this from being disarmed in vanilla or during the last version.  This mod now fixes this issue for auto-dropped equipment&#33;&#33;\r<br />\r<br />[img]http://www.mediafire.com/convkey/1dd6/nqamzzv794u134jfg.jpg[/img]\r<br />\r<br />This is something that bugged me for a long time.  When you drop a torch in Skyrim, it&#39;s unlit.  The only real mods for this requires fiddling around with powers and the like.  Not any more&#33;  With Lit Torches enable, all torches dropped, whether done from the realistic unequipping or from you dropping them in you inventory, are lit&#33;  That&#39;s right, now you can have a placable light source.  When used in conjunction with Realistic Unequip, Lit Torches becomes the most immersive and useful edit ever&#33;  When cave delving, especially with Realistic Lighting Overhaul and/or ENBs, torches become a necessity.  What happens when you encounter some enemies?  Without Equipping Overhaul you would unequip the torch for your combat equipment, but then you are left in the dark.  With this mod, you quick swap your torch (aka swap torch while weapons are drawn) for you combat piece, and bam&#33;  You&#39;ve dropped your torch in favour of the combat stuff, but the torch is lit&#33;  No more fighting in the dark&#33;\r<br />\r<br />A new feature is now present as well&#33;  An optional hotkey to drop torches&#33;&#33;  It can also be toggled to favor equipped or unequipped torches.\r<br />\r<br />There are several planned aspects of this feature, mainly relating to the realism of the torches being lit.  The first, which is now implemented into the mod, is torches that are dropped in water are not lit.  Notably, torches dropped and then placed in water to not extinguish, but torches dropped out of the inventory into water are not lit.  Planned features include torch fire spread as well as torch extinguishing from time, damp, and water.\r<br />\r<br />[img]http://www.mediafire.com/convkey/0ccd/55gw0a7ionb2zd4fg.jpg[/img]\r<br />\r<br />[b]NOTE:[/b] This only applies to the 4.25 alpha build.\r<br />\r<br />[size=5][b]Scripters[/b][/size]\r<br />\r<br />- There is a global variable (FormID: 0200BFA3) to suspend the Realistic Unequip function.  Use the GlobalVariable.Mod(Float) function to add the amount of unequips you wish to skip.  The skip is definite, even if you don&#39;t end up unequipping something.  This means you must be certain a corresponding amount of the proper type (not armor, excluding shields) that you mod the variable by occur.  This function can be useful for scripted events.\r<br />- The same GlobalVariable can be used to monitor is an auto-drop occurs.  When the variable lowers by one a drop has occurred (it will return to 0 if the value becomes negative).\r<br />- If a piece of equipment should be ignored by my mod entirely (including favouriting) then add it to the EquipExceptions FormList (FormID: 0200BFA2)\r<br />- If a piece of equipment should only be ignored by the realistic unequip function then add it to the DropExceptions FormList (FormID: 02009F39)\r<br />\r<br />[size=5][b]Modellers[/b][/size]\r<br />\r<br />- Non-existant meshes will result in the item not being visible only in the situation in which it should be displayed.  It will appear in other instances.\r<br />- Use DSR protocol for your meshes\r<br />- Additionally, meshes for shields on the back distanced for backpacks can use the name system MyShieldOnBackBkp.nif (similar to cloak distanced being MyShieldOnBackClk.nif)\r<br />\r<br />[img]http://www.mediafire.com/convkey/2893/vp5vw1jvpip1y10fg.jpg[/img]\r<br />\r<br />[size=5][b]Main Build[/b][/size]\r<br />\r<br />- SKSE\r<br />- SkyUI\r<br />- Legit updated copy of Skyrim, else I will not provide support\r<br />\r<br />[size=5][b]Alpha Build[/b][/size]\r<br />\r<br />[b]Note:[/b] These requirements are only required for the 4.25 alpha build.\r<br />\r<br />- XPMS or a similar skeleton mod\r<br />- Mesh packs (see below)\r<br />\r<br />[size=5][b]Mesh Packs[/b][/size]\r<br />\r<br />- For all left hand equipment, all shields on back, and all staffs on back, mesh packs are required.\r<br />- These can be found on the Dual Sheath Redux page.  DSR is not required, nor is a patcher, but mesh packs are required.\r<br />- Currently the Vanilla mesh from DSR are even required.  I will contact Neovalen asap to see about including vanilla meshes in the mod.  For now, manually download DSR and copy/merge the Meshes folder in the DSR archive into you Skyrim Data folder.  DO NOT install DSR, it is incompatible.\r<br />[b]HOW TO GET DSR&#39;S VANILLA MESHES:[/b]\r<br />1.  Download DSR manually to a location of your choice (ex. desktop).\r<br />2.  Open the downloaded file.  It is a ZIP (.zip) file, so windows can open it natively.\r<br />3.  Delete all the files EXCEPT the contents of the Meshes folder.  Those are the needed files.\r<br />4.  Close the ZIP file and rename it to Dual Sheath Vanilla Meshes or Equipping Overhaul Vanilla Meshes.\r<br />5.  Open the Nexus Mod Manager.  Hit add mod from file and select the ZIP file.\r<br />6.  Install the &#39;mod&#39; added by NMM.  It can be uninstalled and reinstalled as a mod as you please.\r<br />7.  The original ZIP file (ex. the one on the desktop) can now be deleted because the NMM has already duplicated it.\r<br />\r<br />[img]http://www.mediafire.com/convkey/7289/n69jj0x408kr8nefg.jpg[/img]\r<br />\r<br />[size=5][b]Installing[/b][/size]\r<br />\r<br />- Install with whatever method you prefer.\r<br />- When updating or installing it can take a long time for the MCM to register.  This is not the fault of this mod, but is an issue with all MCM menus.  To force the script to check for new menus and register them open the console and type:\r<br />[quote]setstage ski_configmanagerinstance 1[/quote]\r<br />\r<br />[size=5][b]Uninstalling[/b][/size]\r<br />\r<br />- To ensure you get back your auto-dropped equipment pick up any auto-dropped equipment or type into the console\r<br />[quote]COC ddunequipChestRoom[/quote]\r<br />and retrieve the contents of the chests.\r<br />\r<br />[size=5][b]Updating To Version 4.xx[/b][/size]\r<br />\r<br />- The instructions below should be valid, but have not been tested\r<br />- If you are having unexplainable bugs my suggestion is to hit the uninstall button and re-download the files.  Reinstall and use the above commands to restart the mod.\r<br />\r<br />[size=5][b]Updating To Anything Under Version 4.xx[/b][/size]\r<br />\r<br />- No actions from the users are required.  No clean saves, no new saves, nothing.  It will work on the fly.\r<br />- [b]Don&#39;t[/b] hit the Uninstall button if you are just updating.  That is only for if you are removing the mod entirely.\r<br />- If you hit the uninstall button, reinstalling the mod files will not do anything.  To restart Equipping overhaul after uninstallation use the following commands in the console:\r<br />[quote]StopQuest ddUnequipHandler\r<br />StopQuest ddUnequipMCM\r<br />StartQuest ddUnequipHandler\r<br />StartQuest ddUnequipMCM[/quote]\r<br />\r<br />[img]http://www.mediafire.com/convkey/b141/w1nix43a9bblkiffg.jpg[/img]\r<br />\r<br />[size=5][b]Incompatible[/b][/size]\r<br />\r<br />- Dual Sheath Redux*\r<br />- Mods that utilize slots 44, 49, 54, 56, and/or 60*\r<br />\r<br />[b]*Note:[/b] Starred incompatibilities are only incompatible with the 4.25 alpha build.\r<br />\r<br />[size=5][b]Compatible[/b][/size]\r<br />\r<br />- Bandolier\r<br />- Backpacks (ex. Frostfall) and cloaks (ex. Cloaks of Skyrim)\r<br />- Hotkey mods like SkyUI and More Hotkeys Please\r<br />- Works for all mod weapons/equipment/lights\r<br />- Compatible with equip slot changers like Frostfall Quiver\r<br />- Compatible with Skeleton changers like XMPS\r<br />- Compatible with mods like Dual Swords on Back\r<br />- Compatible with all animation changers like Immersive Animations\r<br />\r<br />[img]http://www.mediafire.com/convkey/5f2f/1m4to1pckzop02ofg.jpg[/img]\r<br />\r<br />[u][b]NOTE[/b][/u]: If you are having a bug or issue there is a 95% chance it will be fixed by the next update&#33;  Track and stay tuned&#33;\r<br />\r<br />[size=5][b]CTDs[/b][/size]\r<br />\r<br />- Due to the nature of this mod, it is very unlikely that it will cause crashes.\r<br />- Try updating to the SKSE alpha and ensure it is configured for the correct memory amounts.\r<br />- If you have more than 3.5GB of RAM installed on your computer use [url=http://www.nexusmods.com/skyrim/mods/50305]SSME - Skyrim Startup Memory Editor[/url]\r<br />\r<br />[size=5][b]Bugs[/b][/size]\r<br />\r<br />- If you have major issues the cause may be that your scripts are lagging.  Check the Discussions tab and find the thread on speeding up Papyrus for help.\r<br />- If you find any please let me know in the comments&#33;  Don&#39;t speculate, but [b]if you&#39;re [u]sure[/u] it&#39;s my mod[/b], then tell me&#33;\r<br />- Development into this mod is active.  If bugs are found and reproducible, I will fix them :)\r<br />\r<br />[b]*Note[/b]: Anything starred has been fixed in my version.  The fixes will be present in the next update.\r<br />[b]Note:[/b] See the sticky post in the comments thread for alpha build bugs.\r<br />\r<br />[img]http://www.mediafire.com/convkey/9b39/50azms548pqj52jfg.jpg[/img]\r<br />\r<br />[size=5][b]Q: [/b][/size]I think feature X would be great and/or I found a bug&#33;\r<br />[size=5][b]A: [/b][/size]Check the description and sticky posts [u]fully[/u].  If I know about it or I am working on it there is no need to tell me.  Otherwise, post it up&#33;\r<br />\r<br />[size=5][b]Q: [/b][/size]I&#39;m currently trying to keep my script performance under control.  Is this mod script heavy?\r<br />[size=5][b]A: [/b][/size]This mod has absolutely zero polling (times updates)&#33;  It is completely event based and is very optimized&#33;  There is no way this will slow down your scripting at all.  TL;DR: No.\r<br />\r<br />[size=5][b]Q: [/b][/size]A lot of the things you&#39;ve fixed are built into the engine.  How&#39;d you do it?\r<br />[size=5][b]A: [/b][/size]Many people think modding is restrictive due to the bounds of the engine.  I prefer to think it as simply more challenging to your ingenuity.  I personally assess an issue systematically and identify what I know until a solution comes to me.  For example, there are no functions in vanilla papyrus or SKSE related to favorites other than seeing if an item is a favorite.  This means I can&#39;t actually change favorites.  How did I do it?  Check it out\r<br />[quote]COC ddUnequipChestRoom[/quote]\r<br />\r<br />[size=5][b]Q: [/b][/size][s]What&#39;s with the boot flicker when swapping weapons on horseback?[/s] Ok, I fixed that issue, but I&#39;m keeping this video here&#33;\r<br />[size=5][b]A: [/b][/size]\r<br />[center][youtube]tbt9AKiTz9E[/youtube][/center]\r<br />\r<br />[img]http://www.mediafire.com/convkey/42f1/6snh9lwk4r2229nfg.jpg[/img]\r<br />\r<br />[size=5][b]Relevant Mods[/b][/size]\r<br />\r<br />- SkyUI: [url=http://www.nexusmods.com/skyrim/mods/3863]http://www.nexusmods.com/skyrim/mods/3863[/url]\r<br />&#34;SkyUI is a mod that aims to improve Skyrim&#39;s User Interface.&#34;\r<br />\r<br />- XMPS:[url=http://www.nexusmods.com/skyrim/mods/26800]http://www.nexusmods.com/skyrim/mods/26800[/url]\r<br />&#34;A multi purpose skeleton for animation in skyrim.&#34;\r<br />\r<br />- Realistic Weapon Positions: [url=http://www.nexusmods.com/skyrim/mods/50096]http://www.nexusmods.com/skyrim/mods/50096[/url]\r<br />&#34;So I was tired of seeing weapons and shields floating in the air like magic, and even worse, clipping like it&#39;s going out of style. This mod aims to fix a large majority of that. &#34;\r<br />\r<br />[size=5][b]My Other Mods[/b][/size]\r<br />\r<br />- Ultimate Immersive Classes: [url=http://www.nexusmods.com/skyrim/mods/48570]http://www.nexusmods.com/skyrim/mods/48570[/url]\r<br />&#34;Ultimate Immersive Classes&#34; provides a choice of class and subsequent class loadout in the start of the game.&#34;\r<br />\r<br />- Death Souls: [url=http://www.nexusmods.com/skyrim/mods/49294]http://www.nexusmods.com/skyrim/mods/49294[/url]\r<br />&#34;Death Souls adds a costly method to avoid death that is unique to Dovahkiin.&#34;\r<br />\r<br />- Main Menu Music: [url=http://www.nexusmods.com/skyrim/mods/49092]http://www.nexusmods.com/skyrim/mods/49092[/url]\r<br />&#34;A simple main menu music replacer that changes the main menu [i]Dovahkiin[/i] song to various other songs, including several works from Malukah.&#34;\r<br />\r<br />- Ranger Elite Work in Progress: [url=http://www.youtube.com/watch?v=3Fqst0ny5bY]http://www.youtube.com/watch?v=3Fqst0ny5bY[/url]\r<br />&#34;Featuring dual arrows, cone arrow firing, hail of arrows.  Be Legolas&#33;&#34;\r<br />\r<br />- Courier Between Worlds Work in Progress\r<br />&#34;Send messages, fixed trades, gifts, barters, and more to other Skyrim players&#33;  In game&#33;&#33;  An immersive and lore-friendly postal system allows you to interact with gamers everywhere, not just locally&#33;  The framework allows for endless possibilities, ranging from auction houses to alliances&#33;&#34;\r<br />\r<br />- Classes of Winterhold Work in Progress\r<br />&#34;Attend classes and lessons at the college of Winterhold, and later teach them for experience and income.  Also featuring College of Winterhold quest line extension.&#34;\r<br />\r<br />- Weapon Degradation and Repair Work in Progress\r<br />&#34;Weapons will degrade as you use them, like an inverse to improving items as a grindstone.  Grindstones and whetstones can be used to get your items good as new, or give them to a smith to do it for you.  Different things cause faster degradation, such as hitting enemies wearing heavy armour.  Let your weapon become too degraded and it may break.&#34;\r<br />\r<br />- Inventory Overhaul Work In Progress: [url=http://www.nexusmods.com/skyrim/articles/49620]http://www.nexusmods.com/skyrim/articles/49620[/url]\r<br />&#34;The sister mod to Equipping Overhaul.  This mod will completely redefine Skyrim&#39;s inventory system, making it based upon volume, slots, as well as weight.  Backpacks and bandoliers will work as containers and when dropped will contain your items.  It links the player to the inventory in the sense that the player is carrying what is in the inventory.  Designed for extreme immersion.&#34;\r<br />\r<br />[img]http://www.mediafire.com/convkey/5842/460dov1to8h517efg.jpg[/img]\r<br />\r<br />[size=5][b]V4.25 ALPHA[/b][/size]\r<br />\r<br />- Complete code rewrite\r<br />- Scrapped Bethesda&#39;s Geared Up function\r<br />- Shields on back\r<br />- Staffs on back\r<br />- Dual sheaths implemented\r<br />- Support for all hotkey mods, such as SkyUI and More Hotkeys Please\r<br />- Realistic Unequip now runs real-time in menu.\r<br />- Unlit torches in water\r<br />- Large changes\r<br />- Squashed a lot of bugs\r<br />\r<br />[size=5][b]V3.13[/b][/size]\r<br />\r<br />- Made version 3.12 actually work\r<br />- Fixed some Lit Torch related bugs\r<br />\r<br />[size=5][b]V3.12[/b][/size]\r<br />\r<br />- Advanced and rearranged MCM menu\r<br />- Added favorites remembering\r<br />- Added search for items\r<br />- Added gather items power\r<br />- Added drop torch hotkey\r<br />- Added geared up hotkey\r<br />- Squashed [b]a lot[/b] of bugs\r<br />\r<br />[size=5][b]V2.6[/b][/size]\r<br />\r<br />- Annihilated free goods bug\r<br />\r<br />[size=5][b]V2.5[/b][/size]\r<br />\r<br />- Fixed transformation\r<br />- Fixed a lot of bugs\r<br />- Added some support to Dual Sheath\r<br />- Fixed NPCs\r<br />\r<br />[size=5][b]V1.52[/b][/size]\r<br />\r<br />- Fixed several fundamental bugs\r<br />\r<br />[size=5][b]V1.49[/b][/size]\r<br />\r<br />- Accidental bugged release\r<br />\r<br />[img]http://www.mediafire.com/convkey/077e/kj8kyiwjjjntc6zfg.jpg[/img]\r<br />\r<br />Note: The main version is currently being changed to be multilingual.\r<br />\r<br />[size=5][b]Chinese[/b][/size]\r<br />\r<br />- Nexus (Preferred): [url=http://www.nexusmods.com/skyrim/mods/49944[/url]http://www.nexusmods.com/skyrim/mods/49944[/url]\r<br />- Mirror (ANKTEAM): [url=http://www.ankteam.com/thread-1112-1-1.html]http://www.ankteam.com/thread-1112-1-1.html[/url]\r<br />\r<br />[size=5][b]Russian[/b][/size]\r<br />\r<br />- Tamriel Chronicles: [url=http://tes.riotpixels.com/mods/skyrim/gameplay/equipping-overhaul]http://tes.riotpixels.com/mods/skyrim/gameplay/equipping-overhaul[/url]\r<br />\r<br />[img]http://www.mediafire.com/convkey/cda1/5vrmqprg39recypfg.jpg[/img]\r<br />\r<br />- Bethesda for Skyrim&#33;&#33;\r<br />- The SKSE Team for the spectacular Skyrim Script Extender&#33;\r<br />- The SkyUI Team for the Mod Configuration Menu&#33;\r<br />- The numerous Nexus forum members who requested this mod&#33;\r<br />\r<br />[img]http://www.mediafire.com/convkey/d249/qt01j2ljniamt51fg.jpg[/img]\r<br />\r<br />- The Nexus Team for this amazing website&#33;&#33;&#33;\r<br />- Neovalen for Dual Sheath Redux&#33;\r<br />- VonDarkness for the constant encouragement&#33;  Also thanks for the help with managing the comments&#33;  This mod would not have been done without you&#33;\r<br />- EProctor for all the screenshots in the comments&#33;  They showcase this mod and some other mods very well&#33;  Also thanks for the support&#33;\r<br />- edmccain86 for the poetic verse telling me to get stuff done&#33;  Very well written&#33;\r<br />- All the encouraging people who have supported me and the Equipping Overhaul&#33;  I would list names, but I don&#39;t want to miss any.",
  "categoryId": "78",
  "version": "4.25",
  "author": "DragonDude1029",
  "createdUnix": "1389514196",
  "updatedUnix": "1393035587",
  "containsAdultContent": false,
  "uploadedBy": "DragonDude1029",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091039",
      "name": "Equipping Overhaul",
      "version": "1.49",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "113",
      "fileName": "Equipping Overhaul-49784-1-49.rar",
      "uploadedUnix": "1389513314",
      "modVersion": "1.49",
      "virusScanUrl": "https://www.virustotal.com/file/98118b27e367180fa4d00a89686ca93a2a75df24dc36b3e457b97818a2e2a766/analysis/1407882814/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equipping%20Overhaul-49784-1-49.rar?fid=1000091039&ttl=1535831036&ri=8192&rs=8192&setec=1d7c5f6f5d929bd90cbc74b319e71472"
    },
    {
      "fileId": "1000091070",
      "name": "Equipping Overhaul",
      "version": "1.52",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "114",
      "fileName": "Equipping Overhaul-49784-1-52.rar",
      "uploadedUnix": "1389522865",
      "modVersion": "1.52",
      "virusScanUrl": "https://www.virustotal.com/file/457f134ad1766ab3ae7d76dd051e7b3c033fec9324f8c2b12734a18fef4b42ae/analysis/1407882954/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equipping%20Overhaul-49784-1-52.rar?fid=1000091070&ttl=1535831036&ri=8192&rs=8192&setec=9666f41fd5857a23276981143ac9f9d8"
    },
    {
      "fileId": "1000091270",
      "name": "Equipping Overhaul",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "114",
      "fileName": "Equipping Overhaul-49784-2-5.rar",
      "uploadedUnix": "1389579826",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/87a91c8df661cd3daadf853a9d0293ed804ffb65face9972f4cc4d5f3e72a97e/analysis/1407884225/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equipping%20Overhaul-49784-2-5.rar?fid=1000091270&ttl=1535831037&ri=8192&rs=8192&setec=dba1ed05397ad2cbf2cfc79f0d385c97"
    },
    {
      "fileId": "1000091274",
      "name": "Equipping Overhaul",
      "version": "2.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "114",
      "fileName": "Equipping Overhaul-49784-2-6.rar",
      "uploadedUnix": "1389582349",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/70c009710ab16dd69d08a7b5260f5a4d0430361399ee2d5a8e7e89613db9b497/analysis/1407884227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equipping%20Overhaul-49784-2-6.rar?fid=1000091274&ttl=1535831037&ri=8192&rs=8192&setec=c45b2d85597cef1cf82f4f00046418b3"
    },
    {
      "fileId": "1000093384",
      "name": "Equipping Overhaul",
      "version": "3.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "132",
      "fileName": "Equipping Overhaul-49784-3-12.rar",
      "uploadedUnix": "1390685096",
      "modVersion": "3.12",
      "virusScanUrl": "https://www.virustotal.com/file/2934452897bad6b6c2064dfbf9e46735b78a1bc125a7fd48f564a9a59db95b3f/analysis/1407901696/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equipping%20Overhaul-49784-3-12.rar?fid=1000093384&ttl=1535831037&ri=8192&rs=8192&setec=134256e2a312de5bdb498fcf8455e768"
    },
    {
      "fileId": "1000093605",
      "name": "Equipping Overhaul",
      "version": "3.13",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "132",
      "fileName": "Equipping Overhaul-49784-3-13.rar",
      "uploadedUnix": "1390770101",
      "modVersion": "3.13",
      "virusScanUrl": "https://www.virustotal.com/file/7cf531c313812a0ec7346fa7e2cec18be11be41debd9f6e878ea788b5debe0b2/analysis/1407903335/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equipping%20Overhaul-49784-3-13.rar?fid=1000093605&ttl=1535831038&ri=8192&rs=8192&setec=7889af7cce4c6e362f15dfd31c34d964"
    },
    {
      "fileId": "1000098139",
      "name": "Equipping Overhaul Alpha Build",
      "version": "4.25",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "134",
      "fileName": "Equipping Overhaul-49784-4-25.rar",
      "uploadedUnix": "1393035587",
      "modVersion": "4.25",
      "virusScanUrl": "https://www.virustotal.com/file/fb19f5f020a692fa08c9b4afe1e187b7270ed218fcdc952efe8c8512e9735314/analysis/1407944283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equipping%20Overhaul-49784-4-25.rar?fid=1000098139&ttl=1535831039&ri=8192&rs=8192&setec=9493bfa234030d36c1f4c41257dad137"
    }
  ]
}