{
  "modId": 49792.0,
  "modName": "Lotr Elven Hunting Knife",
  "summary": "The wonderful elven hunting knife used by Aragorn in Lotr movies.",
  "descriptionHtml": "I always liked this wonderful knife since i saw it for the first time in Lotr movies, and even if here you can find almost every weapon from the movie trilogy, i was sad about don&#39;t finding it...\r<br />One day searching through Nexus i saw the wonderful mod &#34;Witch Battle Armor and Weapons&#34; from NewerMind43, in which there is a knife and short sword version of this beautiful weapon, entirely created by himself, meshes and textures; in this mod both the knife and the short sword are only temperable and can be only found together with the armor...\r<br />\r<br />So i asked, and had permission from NewerMind43, to make a standalone craftable, temperable and uploadable on Nexus version of the knife, that i&#39;d like to share :)\r<br />\r<br />The knife is standalone, so you don&#39;t need other mods, and doesn&#39;t require any DLCs.\r<br />It&#39;s craftable under iron category, and doesn&#39;t require any smithing perk.\r<br />\r<br />I hope you enjoy it, and if you like it, please endorse it :)\r<br />\r<br />About permissions:\r<br />You are not allowed to upload my file to other sites.\r<br />You are not allowed to convert my file so that it works on similar games.\r<br />You must ask me permission first of modify my file, including the releasing of bugfixes or the improving of the features my file adds to the game, and upload it as a separate file.\r<br />You must ask me permission first to use assets contained in my file in your own files.\r<br />\r<br />About credits:\r<br />Credits and Thanks to NewerMind43 for the amazing work on his mod &#34;Witch Battle Armor and Weapons&#34;, that can be found here: http://www.nexusmods.com/skyrim/mods/35048/? \r<br />and for his permission to use the knife and its assets from his mod.\r<br />Credits and Thanks to Bethesda for creating The Elder Scroll series and the Creation Kit.\r<br />\r<br />\r<br />",
  "categoryId": "55",
  "version": "1.0",
  "author": "Alduin78",
  "createdUnix": "1389486377",
  "updatedUnix": "1389483885",
  "containsAdultContent": false,
  "uploadedBy": "alduin78",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000090994",
      "name": "Lotr Elven Hunting Knife",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3708",
      "fileName": "Lotr Elven Hunting Knife-49792-1-0.zip",
      "uploadedUnix": "1389483885",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1a75da5969b9e2dbade9de80136d0f15bafd6a89c968feb89b0e185de5db7c44/analysis/1407882372/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lotr%20Elven%20Hunting%20Knife-49792-1-0.zip?fid=1000090994&ttl=1535831054&ri=8192&rs=8192&setec=c341ec71251e21d859ee3a47baf9bb2e"
    }
  ]
}