{
  "modId": 49790.0,
  "modName": "Quackos Exotic weaponry",
  "summary": "A few new items to slash your way through skyrim with.",
  "descriptionHtml": "V3 Update log\r<br />\r<br />Added a kama to the mix to which you again need advanced armors to craft.\r<br />Also I fixed a screwup on the scimitar, where it used the normal map from the kukri instead of its own.\r<br />Besides that I also changed the screw on the machete to a rivet for which I will upload some new pictures later.\r<br />\r<br />V2 Update log\r<br />\r<br />Added three new weapons:\r<br />Silver scimitar\r<br />Steel Kukri\r<br />Steel machete\r<br />\r<br />Changed the requirement for crafting the weapons as follows:\r<br />Silver katar and scimitar, aswell as the steel kukri now requires advanced armors to craft.\r<br />The steel machete requires steel smithing and stem mortis remains at arcane crafting.\r<br />\r<br />Changed some stats on the weapons to balance them out a bit.\r<br />\r<br />Also added the weapons (except stem mortis) to some leveled lists, so that they should appear on\r<br />various random encounters between level 16-19\r<br />\r<br />and more weapons will be added in the future, aswell as material variations on those that are already there.\r<br />---------\r<br />This is a couple of weapons i have had lying around for quite some time now that just needed finishing up before I could add them to another mod I have had lying around for ages that will take a lot more work to finish up. So I decided to just release some of the weapons as a separate mod which is what we have here. At the moment all you get is a silver katar and a rather gory sword called Stem Mortis, both of hes can be crafted at the smithy as any other weapon, but requires the arcane blacksmith perk.\r<br />\r<br />Other than this I will just mention that i plan to add a few more weapons to the pack within the week if nothing else gets in the way.\r<br />\r<br />So for now all there is left to say is that I hope you all enjoy this.\r<br />\r<br />\r<br />PS: I could and should probably have done a little more stuff on the textures, but I just wanted them up now, since they have been lying and laughing up in my face for too long now.",
  "categoryId": "55",
  "version": "3",
  "author": "Quacko",
  "createdUnix": "1389481119",
  "updatedUnix": "1389850183",
  "containsAdultContent": false,
  "uploadedBy": "quacko",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091699",
      "name": "Quackos exotic weaponry",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33515",
      "fileName": "Quackos exotic weaponry-49790-3.zip",
      "uploadedUnix": "1389850183",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/8bb9157ba7ac66282ca045f91976e083d9e2bb2d0800fbdac5cb9935090612ce/analysis/1407887683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Quackos%20exotic%20weaponry-49790-3.zip?fid=1000091699&ttl=1535831052&ri=8192&rs=8192&setec=43949024894da9b6ac5cb32d6af6895a"
    }
  ]
}