{
  "modId": 49854.0,
  "modName": "Unrestricted Magicka",
  "summary": "Modify spell powers of all five magic schools based on own magicka. Fully configurable, very compatible, vanilla friendly, not overpowered.",
  "descriptionHtml": "[heading]Unrestricted Magicka[/heading]\r<br />[i]If you like it - endorse it. Feedback appreciated[/i]\r<br />\r<br />[u][b]Description:[/b][/u]\r<br />\r<br />Want to play a mage but wondering why you want to invest in magicka?  Wondering about the bad scaling in lategame by most of the spells in comparison to combat skills? Using enchantments and/or an uncapper and shake your head in disbelief about zero spell costs and less power? Laughing about the &#34;fortify magicka&#34; enchantments with little to no use?\r<br />\r<br />Then this is for you. Playing a mage means investing points in magicka. Having more magicka results in some more spellpower for all five magic schools (destruction, restoration, alteration, illusion, conjuration).\r<br />Choosing magicka instead of life and stamina makes sense again.\r<br />Enchanting gear with &#34;Fortify Magicka&#34; is useful for the first time\r<br />\r<br />Using other magic mods already? No problem. This mod alter no attributes and files and should be highly compatible to nearly any other mod, that modifies magic.\r<br />\r<br />Don&#39;t like my default settings? Altered some values this mod uses for calculation? Don&#39;t worry. Just open the Mod Menu and change the values by yourself\r<br />\r<br />[u][b]Detailed Description:[/b][/u]\r<br />\r<br />For every 10 points over your starting magicka you gain 2,5% spellpower in:\r<br />- Destruction\r<br />- Restoration\r<br />- Alteration\r<br />- Illusion\r<br />- Conjuration\r<br />\r<br />Playing with vanilla perk trees and spells this usually means:\r<br />- Destruction =&gt; more spell damage\r<br />- Restoration =&gt; less magicka costs\r<br />- Alteration =&gt; longer spell duration\r<br />- Illusion =&gt; affecting higher levels\r<br />- Conjuration =&gt; longer spell duration\r<br />\r<br />You can fully configure these values if unhappy with the default preset:\r<br />- For each school the possible values range from  -10% to +10% in 0.5% steps. Default: 2.5%. Set to 0% means deactivate effect for that school\r<br />- Default vanilla starting magicka is 100. Freely configurable from 10 to 500 if needed. ONLY change if you altered those values yourself. This value is only for calculation\r<br />- Default magicka per level choice is 10. Freely configurable from 5 to 50 if needed (e.g. using an uncapper and changed those values). ONLY change if you altered those values yourself. This value is only for calculation\r<br />\r<br />You can activate and deactivate the mod any time by using the ingame button. No lingering scripts cluttering your save after removing this mod\r<br />\r<br />You can freely use other magic mods that howsoever modify the magic system, the perk trees, add new spells, etc. This mod won&#39;t conflict with them. \r<br />Yes, most of the schools and/or spells need an overahul themself but there are plenty of mods for that already ;)\r<br />\r<br />[u][b]FAQ:[/b][/u]\r<br />\r<br />Requirements: SkyUI\r<br />Mod conflicts: There should be none\r<br />Languages: compatible with all. ModMenue is in english but everyone will be able to understand two lines of english ;)\r<br />Clean: Yes. Cleaned with TES5Edit\r<br />\r<br />There is no difference ingame? Wait some seconds (not in menu) and the values are altered. Even using fortify stamina potions will get you some more power (for a limited time)\r<br />\r<br />The mod menue sliders use no decimal points? They use, SkyUI just don&#39;t show it but you will notice moving slowly that there are decimal points\r<br />\r<br />[u][b]Installation:[/b][/u]\r<br />\r<br />Use Nexus Mod Manager\r<br />\r<br />Alternatively download and unpack files to your Skyrim/Data directory and activate the .esp. \r<br />The dependencies comes as a .bsa-archive. Easy deinstallation, no cluttering of your Skyrim installation\r<br />\r<br />[u][b]Distribution permission:[/b][/u]\r<br />\r<br />Please do not upload this file elsewhere.  For the time nexus exlusive release\r<br />",
  "categoryId": "75",
  "version": "1.0",
  "author": "Drullo321",
  "createdUnix": "1389582269",
  "updatedUnix": "1389581974",
  "containsAdultContent": false,
  "uploadedBy": "Drullo321",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091273",
      "name": "Unrestricted Magicka",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Unrestricted Magicka-49854-1-0.7z",
      "uploadedUnix": "1389581974",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/40ffacd39dfabc11cb6fe2dcb5f83036992aca2751ba55a445a40c576f739153/analysis/1407884227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unrestricted%20Magicka-49854-1-0.7z?fid=1000091273&ttl=1535831173&ri=8192&rs=8192&setec=ae25bb78ffb045cab55ec7a227644a8f"
    }
  ]
}