{
  "modId": 49878.0,
  "modName": "Bathing Suit in a pool Script and files",
  "summary": "Gives mod makers scripts and the CK work done for adding a trigger that makes NPC&#39;s wear a bathing suit when in a pool. This also can be used to make an NPC wear any armor or clothing when in a specific location, such as a bartender wearing farm clothes when off duty and merchant clothes when on duty.",
  "descriptionHtml": "This is based off of a tutorial posted by Ac3s but modified for wearing a bathing suit rather than naked.\r<br />\r<br />This can be used to make an NPC wear any armor or clothing when in a specific location, such as a bartender wearing farm clothes when off duty and merchant clothes when on duty.\r<br />\r<br />\r<br />Package includes 2 .esp files, one is an example with a cell and NPC&#39;s, the other only includes what is to be copied. Also includes an Activator, Armor addon, Armor, script files, Sample cell, Magic effect,  spell, 2 NPC&#39;s for the example..\r<br />\r<br />For non advanced users:\r<br />\r<br />Activator is a box created in the room by selecting an object and clicking the &#34;Create Trigger&#34; button and selecting AARiftPoolActivator in the list. \r<br />\r<br />Armor and Armor Addon. This is the bathing suit. I included the vanilla bodies with underwear in a folder for examples. I expect you will probably have a bathing suit in mind but if not the bodies will work. If you have a new suit both male and female models put the .nif files in that folder and name the same as what&#39;s there, or discard that folder altogether and change the Armor Addon to use other models.\r<br />\r<br />Magic effect and Spell. No need to change these at all. \r<br />\r<br />Script files. the .pex files must be included with the mod when you upload. .psc are there for advanced users and because not all of the code is mine. I used a tutorial to completely strip NPC&#39;s when they enter the pool for the basic script then modified it to put on a bathing suit instead. Original tutorial is at: \r<br />\r<br />http://forums.nexusmods.com/index.php?/topic/1081510-tutorial-by-subtanker-on-how-to-make-npcs-go-skinny-dipping/ \r<br />\r<br />To see the example cell named AAExample load the BathingSpell.esp into Skyrim then open the console in game and type coc AAExample . It is navmeshed and the 2 sample NPC&#39;s will go in and out of the pool to use the chairs and benches in the room. As they enter the pool they will put on a &#34;bathing&#34; suit. When they leave the pool they will put on the default outfit.\r<br />\r<br />To get the activator and spell into your mod is simple but make sure to backup your mod now. Add BathingSpellForTes5edit.esp to your load order and above your mod, this is important because tes5edit will not copy over the info without being in the proper order. Open Tes5edit and load your mod and BathingSpellForTes5edit.esp. Once loaded expand BathingSpellForTes5edit so you see all the categories. Start at the top and select each category in turn while right clicking and choosing Deep copy as override into... That will add BathingSpellForTes5edit.esp as a master, this is expected and OK. When you click OK you may get an error message saying something is missing. Thats normal because the file you are copying into does not have it yet, thats what you are doing now. Click OK on the missing items errors. Once you have copied all expand your mod and check to make sure they all copied over.\r<br />\r<br />When they are all copied over select File Header of your mod so you have a list of the masters on the right hand window. Right click in the box directly above where it says  BathingSpellForTes5edit.esp. Make sure it is in the same line as Master File. Select Remove to remove BathingSpellForTes5edit.esp from the master list. Save and exit tes5edit.\r<br />\r<br />We can remove the BathingSpell.esp and BathingSpellForTes5edit.esp from the load order at this point, and DO NOT open your mod in the CK with either of those files at the same time. That will change all the ID numbers and make you either reset everything manually or just redo the tes5edit part. I did that once with a backup.. Never again&#33;\r<br />\r<br />Now open your mod in the CK. We need to check a few things to make sure it worked, this is quick to do. In the Armor section edit AABathingSuit01. Check to see if AABathingSuitAA is listed in Models. If not check to see if it is in the Armor Addon section and if it is add it to the Armor&#39;s Models box.\r<br />\r<br />Next we need to check the Magic Effect to see make sure the script has the properties set. So open the Magic effect section and edit AARiftPoolEffect. In the bottom right corner is Scripts which will have AARiftPoolEffectscript listed. select it and click properties or double click it. Select a property in the box in the new window and click the Auto-Fill button. repeat for the next one.\r<br />\r<br />Next is verifying the Spell, so open the Spell section and edit AARiftPoolSpell. Check to see if RiftPoolEffect is listed under effects. If not add AARiftPoolEffect and give it a long duration like 10000 seconds.\r<br />\r<br />Next verify the Activator. Open the Activators section and edit AARiftPoolActivator. On the right hand side is Scripts and AARiftPoolActivator should be listed. Set the properties the same way you did the Magic Effects.\r<br />\r<br />Done and ready to add the activators to your pools If all the steps were done correctly and nothing was missing. If anything was missing please start over from tes5edit.\r<br />\r<br />To make an activator for your pool I usualy drag and drop a wall item like FarmBWall01 into the pool. Move it to a corner of the pool and where it&#39;s floor is just below the pools floor. preferably the corner should be on the edge the NPC&#39;s will be coming and going from. Then while the item is selected click the &#34;Create Trigger&#34; button and selecting AARiftPoolActivator in the list. Then adjust the box size to fill in the rest of the pool and just below the ceiling. You can add multiple if the pool is not square but have them overlap so the bathing suit does not come on and off.\r<br />\r<br />After placing the activator and adjusting it to fit where you want edit it and open the Scripts tab. Double click the script AARiftPoolActivator or select it and click the properties button. Select one of the properties and click the Auto-Fill button and repeat with the other. Click OK.\r<br />\r<br />Done&#33; Save and check the pool in the game to see if NPC&#39;s will wear a bathing suit in the pool and default outfit when not. If all went correct you can add activators to other pools the same way.\r<br />\r<br />For Advanced users:\r<br />\r<br />Why are you reading this? just do it...\r<br />\r<br />Enjoy&#33;\r<br />\r<br />Thank you Ac3s and subtanker for the tutorial on making a nude pool script. Without that I wouldnt have made the bathing suit script.",
  "categoryId": "82",
  "version": "1",
  "author": "Jet4571",
  "createdUnix": "1389659162",
  "updatedUnix": "1389661747",
  "containsAdultContent": false,
  "uploadedBy": "jet4571",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091381",
      "name": "Bathing suit in pool script and files",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "425",
      "fileName": "Bathing suit in poll script and files-49878-1.zip",
      "uploadedUnix": "1389661747",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/31f40c9f8ffc54b3fedb1c8fa1bcd8d89ad8c06c9b51cb3f8107da446c8f64fc/analysis/1407885345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bathing%20suit%20in%20poll%20script%20and%20files-49878-1.zip?fid=1000091381&ttl=1535831206&ri=8192&rs=8192&setec=bd5a50be413c16df1fd297d4d2964a94"
    }
  ]
}