{
  "modId": 49875.0,
  "modName": "Dovahkiin Branded",
  "summary": "New war paint tint mask. Not a replacer. NEW COMBO PACKAGE WITH AKAVIRI DRAGONBORN EMBLEM (tombs). Confirmed compatibility with CBBE and SevenBase (see images).",
  "descriptionHtml": "There are multiple stories where a child of destiny is born with a prophesized birthmark.\r<br />There are also cultures that brand children with their cult or tribal insignia.\r<br />Then, there is also stigmata.\r<br />\r<br />This war paint, when properly colored and given a slight transparency via the Race Menu mod,\r<br />will give your character a brand/birthmark bestowed by Akatosh.\r<br />Such a bestowment is suited for a child of destiny; DOVAHKIIN&#33;\r<br />\r<br />This war paint bears the sign of Akatosh on the right cheek, and legit Dragon Script font across the neck that translates into &#34;DOVAHKIIN.&#34;\r<br />\r<br />Edit:\r<br />Added separated war paints&#33; Now you can have both, or one or the other. All 3 will be available in-game, and as before, should be compatible with vanilla Skyrim... Well, it may look bad with vanilla.\r<br />\r<br />Edit 2:\r<br />Added the Akaviri Dragonborn emblem as an additional war paint. The shape wwas easy to obtain; I just took a screenshot of the huge version that&#39;s on every Dragon Wall, then Photoshop-ed that sucker into a tint. Bam. Enjoy&#33;\r<br />\r<br />Note:\r<br />This was tested using CBBE, and may have unintended appearances on non-CBBE head models.\r<br />Also, the shape of the Akatosh emblem may appear distorted depending on cheekbone settings.\r<br />Lastly, I only tested it on the Nord race. The war paint should be compatible with only female Bretons, Imperials, Nords, and Redguards. If you use Race Menu (highly recommended), you may be able to apply it to men or other races, but I doubt it&#39;ll look correct.\r<br />\r<br />NOTICE:\r<br />Horse combat issue resolved thanks to Daftcnut.\r<br />If anyone would like to help optimize the file for Race Menu,\r<br />once again you have my permission to modify any files except\r<br />the actual artwork. Again, credit will be given where due.\r<br />\r<br />PS:\r<br />If anyone is looking for voice talent in their upcoming mod, please inform me as I do\r<br />amatuer voice acting with pro quality. Thanks&#33;\r<br />\r<br />Recommended mods:\r<br />Race Menu\r<br />CBBE\r<br />Precache Killer\r<br />Latest SKSE version\r<br />SKSE HD tint mask tweak",
  "categoryId": "26",
  "version": "4",
  "author": "ItsDolomiteBaby",
  "createdUnix": "1389653640",
  "updatedUnix": "1389908917",
  "containsAdultContent": false,
  "uploadedBy": "ItsDolomiteBaby",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091799",
      "name": "DOVAHKIIN Branded War Paint Combo Package",
      "version": "4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "123",
      "fileName": "DOVAHKIIN Branded War Paint Combo Package-49875-4.zip",
      "uploadedUnix": "1389908917",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/0d52e8837ffa8d5af611ba451c4af5b3afe0cdeb2282c3b8af7d7394023452ce/analysis/1407889085/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DOVAHKIIN%20Branded%20War%20Paint%20Combo%20Package-49875-4.zip?fid=1000091799&ttl=1535831202&ri=8192&rs=8192&setec=799e4ad56fd6f306a57ddab5344bd147"
    }
  ]
}