{
  "modId": 49886.0,
  "modName": "R18Pn 02 Leere and Royal texture bug fix and conversion to Daedric",
  "summary": "",
  "descriptionHtml": "*Fixed an error where the non-Royal version required the Royal retexture as a dependency. Sorry about any trouble this may have caused people*\r<br />\r<br />This mod rebalances, debugs, and ports KURESE&#39;s excellent &#34;Leere&#34; armor as a standalone Deadric armor (both heavy and light) set that is fully craftable. enchantable, and upgradeable.\r<br />The second mod also ports messiasmummo&#39;s stunning &#34;Royal&#34; retexture into Daedric armor. Both the Leere and the Royal armors are in the second mod letting you mix and match parts.\r<br />\r<br />The original armor was unbalanced (required too much material, did not require any Smithing perks, was too powerful), had seemingly arbitrary values, non-unique item/file names, and the download files all contained what appeared to be UNP only light armor and a heavy helmet. Installation was confusing, and the armor did not provide matching set bonus. There was also a bug that causes your head to vanish when you equip the helmet.\r<br />\r<br />In my opinion, light ebony armors are not &#34;lore friendly.&#34; Light daedric armors do make a bit of sense though since they are Daedric in origin. This mod simply adds recipes to makes both heavy and light Daedric armors that use KURESE&#39;s Leere models. The light version unlocks with glass smithing, the heavy unlocks with daedric smithing, both are available with dragon smithing so you do not need to take both sides of the smithing tree if you want both armors. You will need daedric smithing to upgrade to legendary though, adding a flag to allow legendary with glass or dragon smithing causes the matching set bonus to give nearly a double bonus. The heavy set has the same stats as basic Daedric armor, the light set has the same stats as D4ynee&#39;s Light Daedric Armor (same as dragonplate). The recipes are the same as Daedric armor, with the exception that the &#34;Leere B&#34; requires an iron ingot for the chain mesh.\r<br />\r<br />All perks are working more or less correctly, however you get about 20 extra armor from the matching set bonus, not game breaking imo since you are getting close enough to the armor cap for it not to matter.\r<br />\r<br />\r<br />---------------\r<br />---------------\r<br />READ THIS PART&#33;&#33;&#33;\r<br />You will need KURESE&#39;s original mod because this mod does not contain any of his original work.\r<br />http://skyrim.nexusmods.com/mods/11756\r<br />Download the &#34;LeereUNPv1dot5&#34; file.\r<br />I tested this using both UNP skinny and UNPB models and it worked just fine. I have no plans to use or adapt this to the CBBE body, so please do not ask.\r<br />The original mod was a mess in terms of item names (heavy and light stuff had same names, texture files not referenced, etc.). If you have ever installed the Leere armor mod in the past, I strongly recommend opening the Data folder located in C:Program Files (x86)SteamsteamappscommonSkyrimData, and search for &#34;Leere&#34; and &#34;naito.&#34; Delete all files that contain either of these key words. NMM will not clean these references for you. Then reinstall the &#34;LeereUNPv1dot5&#34; mod either manually or using NMM.\r<br />---------------\r<br />---------------\r<br />\r<br />Notes:\r<br />I chased the &#34;disappearing head&#34; bug in circles for quite a while before I finally fixed it. Hopefully this is fixed for good.\r<br />\r<br />maniczombie&#39;s &#34;Helmet Toggle - Show Hide&#34; (http://www.nexusmods.com/skyrim/mods/22765/?) does not recognize this helmet, so it will not be able to hide the helmet. This is one of the very few helmets in the game that I do not hate, so I am fine with it showing. I presume other helmet hiding mods will also not work with this mod. If someone knows how to reliably get the Helmet Toggle to work, keep the matching set bonus, and not reintroduce the missing head bug, send me detailed instructions and I will update this mod. I love maniczombie&#39;s Helmet Toggle and I highly recommend it.\r<br />--------------\r<br />--------------\r<br />\r<br />INSTALLATION:\r<br />Install Kurrese&#39;s &#34;LeereUNPv1dot5&#34; http://skyrim.nexusmods.com/mods/11756\r<br />--&gt; SEE ABOVE&#33;&#33;\r<br />If installing the Royal Leere version, you also need to install messiasmummo&#39;s Royal armor http://www.nexusmods.com/skyrim/mods/19788/?\r<br />Download and install this mod using NMM.\r<br />or\r<br />Manually download, and drop the .esp file into your data file located at C:Program Files (x86)SteamsteamappscommonSkyrimData\r<br />Start Skyrim from Steam, click the &#34;data files&#34; button, check the &#34;Leere armor&#34; box, and exit. Start the game in your normal manner.\r<br />\r<br />-------------\r<br />-------------\r<br />Credits:\r<br />Full credit for the amazing mesh and textures goes to KURESE who created this armor originaly\r<br />http://skyrim.nexusmods.com/mods/11756\r<br />Extra credit goes to messiasmummo for the stunning retextures, these really have to be seen in game to be appreciated.\r<br />http://www.nexusmods.com/skyrim/mods/19788\r<br />Special mention to the folks who post in the modding forum, I was able to find answers to all my questions just by reading past answers.\r<br />I want to thank the authors of this site http://isharameradin.zxq.net/MakingAPlayerBasedMannequin.html#ESPparents for explaining how to make a plug-in dependent on two other plug-ins.\r<br />\r<br />",
  "categoryId": "54",
  "version": "1.1",
  "author": "joshua43214",
  "createdUnix": "1389678929",
  "updatedUnix": "1390143318",
  "containsAdultContent": false,
  "uploadedBy": "joshua43214",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091400",
      "name": "Leere Daedric Armor",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Leere Daedric Armor-49886-1-1.zip",
      "uploadedUnix": "1389678855",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e7de570d590cc81b9494672757960a89eb55ac0c0d0eea4a65e1f91b64d1f68e/analysis/1407885553/",
      "changelogHtml": " Fixed an error where the non-Royal version required the Royal retexture file <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Leere%20Daedric%20Armor-49886-1-1.zip?fid=1000091400&ttl=1535831216&ri=8192&rs=8192&setec=8bccf88a30d869770362aa81d5e88560"
    },
    {
      "fileId": "1000091402",
      "name": "Royal Leere Daedric Armor",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Royal Leere Daedric Armor-49886-1-1.zip",
      "uploadedUnix": "1389678922",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0aa1da06bf236031743a9b274b72459c7e3b1bcdebafd4a805e0700a0d9141a0/analysis/1407885556/",
      "changelogHtml": " Fixed an error where the non-Royal version required the Royal retexture file <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Royal%20Leere%20Daedric%20Armor-49886-1-1.zip?fid=1000091402&ttl=1535831216&ri=8192&rs=8192&setec=b8af8596afb6af8e9c0aa0d168c1a7a8"
    },
    {
      "fileId": "1000092185",
      "name": "Leere Daedric Armor _fixed_",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Leere Daedric Armor _fixed_-49886-1-1.zip",
      "uploadedUnix": "1390143318",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5695c81720371e755159ddd6105d77b720fc696a69d96a6ba06d216df7878bcc/analysis/1407892471/",
      "changelogHtml": " Fixed an error where the non-Royal version required the Royal retexture file <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Leere%20Daedric%20Armor%20_fixed_-49886-1-1.zip?fid=1000092185&ttl=1535831217&ri=8192&rs=8192&setec=54e5ec1177e42a46a100495b08cf6dc3"
    }
  ]
}