{
  "modId": 49888.0,
  "modName": "Dragonborn Crafting Hall",
  "summary": "If you are tired of grinding every time you want to make a new character then this is your mod. It included everything you need to start the game however you want this time, including a special Potion of Leveling that you can make that increases every skill by 15 points. All the crafting items respawn so you will always have the things you need.",
  "descriptionHtml": "[color=#00ff00] [size=5]  Dragonborn Crafting Hall Legendary Edition[/size][/color]\r<br />\r<br />This mod was created with the main goal of reducing grinding in the game, especially for experienced players that just want to try new characters builds and not have to do the boring stuff over again. If you are new to Skyrim, then welcome, and feel free to reduce the grinding so you can focus on exploration and story over making 10,000 daggers to level up your smithing. The main version of the mod requires Dawngaurd, Hearthfire, and Dragonborn. There is an optional file for people to use with no DLC requirements, please see special install notes below. \r<br />\r<br />[color=#ff0000] NOTE: This mod includes respawning chests next to each crafting station so you will always have every item you need. NOTE it takes 10 in game days for items to respawn inside the Hall and the timer resets to 0 every time you enter the Hall. So if you need the items to respawn make sure you wait for 10 in game days before you enter the hall.[/color]\r<br />\r<br />[color=#ff0000] NOTE: If you are updating from version 1.9 or below please read the special note on installing as the ESP file has changed&#33;[/color]\r<br />\r<br />Features include: \r<br />\r<br />- Every crafting station in the game for Spider Scrolls, Staffs, Enchanting, Potions, and Smithing. Each has a respawning chest next to it that has every item you need for that station and it is all in one room. \r<br />\r<br />- A Special Ring of Enchanting with a learnable Fortify Enchanting effect. \r<br />\r<br />- A learn enchantments chest that has 1 of every enchantment so you can learn them all \r<br />\r<br />- Every Spell book in the game \r<br />\r<br />- Teleport Spells to every Skyrim house, including all the DLC houses and one to the hall. NOTE: The teleport spells to the Heartfire houses are to the outside so you can use them even if you have not built the house yet; the rest teleport you inside the houses using markers near the default COC markers so should work with any house overhaul mods out there. \r<br />\r<br />- 36 new spells (including the teleport spells) that can help wizards survive even on Legendary Difficulty. Has new spells from every school of magic, most at the master level.\r<br />\r<br />- A new Potion of leveling you can craft using Scaly Pholiots and Hagraven Feathers that increases every skill by 15 points. \r<br />\r<br />- A chest next to every Hearthfire house that includes everything you need to build the house inside and outside. All you will need to do is buy some sawn logs and there is plenty of gold in the Hall for you to do that. \r<br />\r<br />- A Dragonpriest mask chest \r<br />\r<br />- An Artifacts chest (If your using a mod that lets you disenchant artifacts and the masks then this way you do not have to destroy the real items in your game anymore) \r<br />\r<br />- A Special Armor chest with the armors that can not be crafted, such as Wolf, Thieves Guild, Blades, Ancient Nord, etc. \r<br />\r<br />- A merchant with 30,000 gold to sell off your unwanted items. \r<br />\r<br />- A living area to sleep in and cook food \r<br />\r<br />- A storage room \r<br />\r<br />- Included Linen Wraps, paper, and baskets in the smithing chest to support mods that add cloaks like Winter is Coming and Cloaks of Skyrim.\r<br />\r<br />You will notice that some chests are marked Player and the others are labeled with a name and either No Respawn or Respawns. You can safely store items in the chests labeled as no respawn and all the player chests, bookcases, and wardrobes. [u]Do not store any items you want to keep inside the chests labled as Respawing.[/u] \r<br />\r<br />This area is called Dragonborn Crafting Hall on the world map and is next to Riverwood so you can access it right after you leave Helgen in the very beginning of the game. You have to discover it on the world map, so if you&#39;re traveling north from Helgen follow the road to the right in the middle of Riverwood and you should see it. You can see the photos of the map and outside entrance for help locating it. If you still have trouble finding it you can always use this command, COC ADragonbornCraftingHall to get there. \r<br />\r<br />For those of you that don&#39;t like any kind of mods that give you an advantage or way to cheat, remember just because the option to cheat is there, it doesn&#39;t mean you have to use those options. It is no different then choosing not to use the TGM command when playing the game, so feel free to try the mod out for the other features that are not cheats like the spells. This mod to me is all about having choices to replay Skyrim however you want to and minimizing grinding, so please go have some fun with this mod. .\r<br />\r<br />[color=#ff0000] NOTE: Dawngaurd, Hearthfire, and Dragonborn are required for the Main file. There is an optional file for people to use that removes all the DLC so now everyone can use this mod. Please make sure you download the file that is right for you. If you do not have Hearthfire but have Dragonborn and Dawngaurd I will keep up version 1.9 so you can use that version.[/color]\r<br />\r<br />[color=#00ff00] [size=5]  If you like this mod then please endorse it. Thank you to all of you that have already, and I hope you&#39;re all still enjoying this mod. [/size] [/color]\r<br />\r<br />[color=#ff0000] Special notes on installing: [/color] Please only choose one file, either the Main file or the Optional file for people with no DLC, they are stand alone files and do not work together. When updating from version 2 you will be safe to update the file you have with no special actions needed. If using NMM then just click on the Download with Manager button and install. If updating when asked by NMM if you want to install the new version, say yes. \r<br />\r<br />For a manual install just extract the files to the Data section of your Skyrim folder and make sure to active the ESP file for the mod called &#34;Dragonborn Crafting Hall LE&#34; for the DLC version or &#34;Dragonborn Crafting Hall No DLC&#34; for that version.\r<br />\r<br />[color=#ff0000] If you have version 1.9 or below please read this on how to update to version 2 or higher. Current version is 2.2[/color]\r<br />[u]If you are updating from any version of 1.9 or earlier (No DLC, No Teleport, or Main) then you will need to grab any of your stored items that you want to keep from inside the Hall (if you wish to upgrade to version 2) since I have made a new ESP file do to the major changes.[/u] After grabbing all your stored items you wish to keep from inside the Hall, please make a save right outside the Hall (do not be inside it). Exit the game and then you should uninstall version 1.9 of this mod before installing version 2. You may notice the new ESP file now says Dragonborn Crafting Hall LE or Dragonborn Crafting Hall No DLC instead of Cheat Chest Home like the earlier versions did. You will also have to read the spells books form the mod again to learn all the Master Spells and Teleport Spells as the game gives them new ID&#39;s. If you disenchanted the Fortify Enchanting Ring you will have to relearn that enchantment as well. I am very sorry for the inconvenience this causes over the normal updating procedure. It was necessary to consolidate the ESP files to reduce versions, to not break anyone&#39;s game that doesn&#39;t have Hearthfire but was using this mod, and do to the changes made by adding a living area and moving item storage chests around. Your game will say it is now missing content when you first load it, just ignore that, it is only because I changed the ESP file name for the reasons listed above.\r<br />\r<br />[color=#00ff00]Other Skyrim mods by Avatar1971:[/color]\r<br />\r<br />If 15 points is not enough for you I have another potion of that can be found here that gives you 85 points, just click this link: [url=http://www.nexusmods.com/skyrim/mods/49969]Potion of Ultimate Leveling [/url]\r<br />\r<br />If your looking for some Gold Plated Dragonbone Weapons and Armor to craft in this new hall you can find them at this link: [url=http://www.nexusmods.com/skyrim/mods/40206]Gold Dragonbone Weapons and Heavy Armor [/url]\r<br />\r<br />Cursed Camelot a mod made with my friend ApokKnight. It is a hidden quest mod to unlock the ancient secrets of Cursed Camelot. It adds special retextured armor and weapons, a very unique player house, several new followers, and a new horse mount.\r<br />[url=http://www.nexusmods.com/skyrim/mods/49519/]Cursed Camelot and Excalibur[/url]\r<br />\r<br />[u]Change Log:[/u]\r<br />1.1 adds a few items that I missed in the smithing chest (bone hawk, shellbug, and chitin plate) plus the crimson nirnroot to the ingredients chest.\r<br />\r<br />1.2 fixed spider crafting and added all items needed for every type of spider to spider crafting chest. Added Daedra Hearts to smithing chest for Daedric crafting (they are still in ingredients chest too for potions).\r<br />\r<br />1.3 Fixed issue with spells not displaying at correct level and made a few minor adjustments to them. Also changed master file load order for increased stability.\r<br />\r<br />1.4 Added 4 missing spells, 2 from Dawngaurd and 2 from Dragonborn. From Dawngaurd, Heal Undead and Necromantic Healing. From Dragonborn, Conjure Ash Spawn and Conjure Seeker. They will spawn in the DLC spell chests even if you have stored new items in them already, or have used all the other spell tomes already.\r<br />\r<br />1.5 Added Gloves of the Pugilist to disenchanting chest and added a merchant.\r<br />\r<br />1.6 Added 5 one of a kind items to disenchant for unique enchantments, Briarheart Geis, Lunar Steel Sword, Notched Pickaxe, Poacher&#39;s Axe, and Steel Battleaxe of Fiery Souls. \r<br />New optional file added with no DLC requirements.\r<br />\r<br />1.7 Teleporter now allows followers to teleport with you. You will notice a slight pause before teleporting and maybe a quick load screen. (No changes had to be made to &#34;No Teleport&#34; version so it will stay at version number 1.6)\r<br />\r<br />1.8 Added teleport spells to each standard house, added blink spell, and added invisibility master spell. Added unenchanted Crossbow and 1000 steel bolts to enchantment learning chest for you archers out there since it can not be crafted.\r<br />\r<br />1.9 Added Ring of Enchantment to enchantment chest, ring can be disenchanted to learn Fortify Enchanting enchantment.\r<br />\r<br />2.0 Added living area, Spell hand effects for the Teleport Spells, a Faction Armor Chest, an Artifact Chest, a Dragonpriest Mask Chest. Added linen wraps to Smithing chest to support mods that add cloaks. Please view installing notes on how to upgrade from 1.9 to version 2 as the ESP file now has a new name.\r<br />\r<br />2.1 Added more armors that can not be crafted, including Thieves Guild, Ancient Nord, and several more. Added 3 bird egg ingredients to ingredient chest, fixed backwards facing chest in living area. (all versions) Added teleport spell to Severin Manor in Solstheim. (LE version only).\r<br />\r<br />2.2 Added 3 chests for the Hearthfire DLC houses that have every item you need to build the houses inside and outside. You only have to buy logs since they can not be placed in a chest. This is for the Legendary Edition only, no changes have been made to the NO DLC version so it will remain 2.1 for now.\r<br />\r<br />2.3 Added a chest that holds all the mods spells in one container now. Added new spells including Fortify Carry Weight, Cure Disease, Conjure Soul Horse, Master Ward, and many more. Added roles of paper to the smithing chest to create the book you need for the Cloaks of Skyrim mod. Changed the display name for some Master level spells so they will now appear like Master Fireball instead of Fireball Master. You do not need to relearn the spells, any that you know already should automatically change in your magic menus. NOTE the No DLC version will be updated soon, many of the new spells are dependent on the DLC and I have not had time to update the No DLC version yet.",
  "categoryId": "40",
  "version": "2.3",
  "author": "Avatar1971",
  "createdUnix": "1389681480",
  "updatedUnix": "1416984800",
  "containsAdultContent": false,
  "uploadedBy": "Avatar1971",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105384",
      "name": "Dragonborn Crafting Hall",
      "version": "1.9",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "185",
      "fileName": "Dragonborn Crafting Hall-49888-1-9.rar",
      "uploadedUnix": "1397805527",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/150c6567facec85f41d2da094e4516332ba5ff7e4e785b1cc32c5be04d5dadca/analysis/1408027341/",
      "changelogHtml": " Added Ring of Enchantment to enchantment chest, ring can be disenchanted to learn new Fortify Enchanting enchantment. <br/> \n Fixed spelling error. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Crafting%20Hall-49888-1-9.rar?fid=1000105384&ttl=1535831219&ri=8192&rs=8192&setec=46f0570caec80e33fefd633223a08840"
    },
    {
      "fileId": "1000105385",
      "name": "Dragonborn Crafting Hall no Teleport Version",
      "version": "1.9",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "177",
      "fileName": "Dragonborn Crafting Hall no Teleport Version-49888-1-9.rar",
      "uploadedUnix": "1397805603",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/e20c8b42928ebbddfc1d365514de07b8ef4c86bf5d481ea82dc6a0d06d3c505e/analysis/1408027342/",
      "changelogHtml": " Added Ring of Enchantment to enchantment chest, ring can be disenchanted to learn new Fortify Enchanting enchantment. <br/> \n Fixed spelling error. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Crafting%20Hall%20no%20Teleport%20Version-49888-1-9.rar?fid=1000105385&ttl=1535831220&ri=8192&rs=8192&setec=d0385d857c1ca869eb207131a99ef894"
    },
    {
      "fileId": "1000127384",
      "name": "Dragonborn Crafting Hall LE",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "186",
      "fileName": "Dragonborn Crafting Hall LE-49888-2-0.rar",
      "uploadedUnix": "1411057144",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/b5185d525655b7818c44cdb3d77795342f81188642129f146e76fd625546fc29/analysis/1411057263/",
      "changelogHtml": " Please read the installation notes on upgrading from version 1.9 or before to version 2. (All versions) <br/> \n Eliminated the Teleport Stone to Breezehome since there are now teleport spells. (All Versions) <br/> \n Added teleport spells to the 3 Hearthfire houses (main file only, and it is to right outside the house, not inside the house so you can get there even if you have not built it yet.) <br/> \n Added a living area complete with places to cook and a small storage room. (All versions) <br/> \n Added Dragonpriest Mask chest, Faction Armor chest, and Artifact chest. (All versions) <br/> \n Added a spell effect to your hand for all teleport spells. (all versions) <br/> \n Added Linen wraps to Smithing chest to support mods that add cloaks. (all versions) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Crafting%20Hall%20LE-49888-2-0.rar?fid=1000127384&ttl=1535831220&ri=8192&rs=8192&setec=245cffbdb67bc55d1f05000f8c5fd2a2"
    },
    {
      "fileId": "1000127386",
      "name": "Dragonborn Crafting Hall No DLC Version",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "188",
      "fileName": "Dragonborn Crafting Hall No DLC Version-49888-2-0.rar",
      "uploadedUnix": "1411057396",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/5939aaa216cd0fdba90fec2eb8a2654b17c740ceb3671427e3ae12ef65e9ab35/analysis/1411057503/",
      "changelogHtml": " Please read the installation notes on upgrading from version 1.9 or before to version 2. (All versions) <br/> \n Eliminated the Teleport Stone to Breezehome since there are now teleport spells. (All Versions) <br/> \n Added teleport spells to the 3 Hearthfire houses (main file only, and it is to right outside the house, not inside the house so you can get there even if you have not built it yet.) <br/> \n Added a living area complete with places to cook and a small storage room. (All versions) <br/> \n Added Dragonpriest Mask chest, Faction Armor chest, and Artifact chest. (All versions) <br/> \n Added a spell effect to your hand for all teleport spells. (all versions) <br/> \n Added Linen wraps to Smithing chest to support mods that add cloaks. (all versions) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Crafting%20Hall%20No%20DLC%20Version-49888-2-0.rar?fid=1000127386&ttl=1535831221&ri=8192&rs=8192&setec=13d83200bce838489aa1801d10f04ce7"
    },
    {
      "fileId": "1000128191",
      "name": "Dragonborn Crafting Hall LE",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "186",
      "fileName": "Dragonborn Crafting Hall LE-49888-2-1.rar",
      "uploadedUnix": "1411502628",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/38251f3e89386ec809a5afde1aa3fb2264f5815866761317743f5b3227cc2f6d/analysis/1411502702/",
      "changelogHtml": " Added several armors to Special Armor chest, including Thieves Guild, Ancient Nord, etc. (all versions) <br/> \n Added 3 bird eggs ingredients to Ingredients chest. (all versions) <br/> \n Fixed backwards facing chest in living area. (all versions) <br/> \n Added teleport spell to Severin Manor in Solstheim (part of the Dragonborn DLC so only for the LE version) <br/> \n If updating from version 1.9 or older please read special install notes, if updating from version 2 no special action is needed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Crafting%20Hall%20LE-49888-2-1.rar?fid=1000128191&ttl=1535831221&ri=8192&rs=8192&setec=ff5677bc98911fc90f1d4f981aa9962d"
    },
    {
      "fileId": "1000128192",
      "name": "Dragonborn Crafting Hall No DLC Version",
      "version": "2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "186",
      "fileName": "Dragonborn Crafting Hall No DLC Version-49888-2-1.rar",
      "uploadedUnix": "1411503238",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/6c679a2aeb2ae315ad2f7c3411a2ef90b41d2ba1253eea1275b927aa8a8d507c/analysis/1411503303/",
      "changelogHtml": " Added several armors to Special Armor chest, including Thieves Guild, Ancient Nord, etc. (all versions) <br/> \n Added 3 bird eggs ingredients to Ingredients chest. (all versions) <br/> \n Fixed backwards facing chest in living area. (all versions) <br/> \n Added teleport spell to Severin Manor in Solstheim (part of the Dragonborn DLC so only for the LE version) <br/> \n If updating from version 1.9 or older please read special install notes, if updating from version 2 no special action is needed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Crafting%20Hall%20No%20DLC%20Version-49888-2-1.rar?fid=1000128192&ttl=1535831222&ri=8192&rs=8192&setec=2a17afd30b1fc5aa6f4ddb41f2902413"
    },
    {
      "fileId": "1000130956",
      "name": "OLD VERSION Dragonborn Crafting Hall LE",
      "version": "2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "188",
      "fileName": "Dragonborn Crafting Hall LE-49888-2-2.rar",
      "uploadedUnix": "1413276219",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/cb84ecd80f0fed0d7c23ed613e0ec77731a71f5bed2f1c693c6d72a2854e34fe/analysis/1413276302/",
      "changelogHtml": " Added 3 chests for the Hearthfire DLC houses. 1 is at each house near the drafting table and workbench where you build the home. Chest have all the items you need to build entire house inside and outside. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Crafting%20Hall%20LE-49888-2-2.rar?fid=1000130956&ttl=1535831222&ri=8192&rs=8192&setec=e8da045e95c5ac2d6f9160468b3cfa31"
    },
    {
      "fileId": "1000136807",
      "name": "Dragonborn Crafting Hall LE",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "191",
      "fileName": "Dragonborn Crafting Hall LE-49888-2-3.rar",
      "uploadedUnix": "1416984800",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/5d9264729063b668ac37d97ab559417e64836af19c6ea6ce0f51f3813a1179f5/analysis/1416984903/",
      "changelogHtml": " Added a chest that holds all the mods spells in one container now, chest does not respawn. <br/> \n Added several new spells including Fortify Carry Weight, Cure Disease, Master Ward, and many more. <br/> \n Added paper rolls to smithing chest to create book needed for Cloaks of Skyrim. <br/> \n Changed display names for old master level spells, they now say Master Fireball instead of Fireball Master for example. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Crafting%20Hall%20LE-49888-2-3.rar?fid=1000136807&ttl=1535831222&ri=8192&rs=8192&setec=d13b995fd0f938b6431855cc0016eb6d"
    }
  ]
}