{
  "modId": 49897.0,
  "modName": "Summon Dremora and other spells",
  "summary": "Some spells and a couple of items to play with.",
  "descriptionHtml": "This mod only adds spells, etc and doesn&#39;t change existing perks/spells, so it should be 100% compatible with any other mod.\r<br />This mod requires Dawnguard, Dragonborn and possibly Hearthfire (by mistake).\r<br />\r<br />Items/spells are found in a barrel in Jorvasskr (In White Run)-  to the left from the main entrance near the isolated bedroom.\r<br />\r<br />A lot of this I was testing on, but found I liked most of the spells and maybe you will too.\r<br />\r<br />Summon spells:\r<br />Karstaag is lvl 90, I believe I set all other summons to scale to Player&#39;s current level.\r<br />Dremora Archer-  Might be considered balanced.  Extra fast bow speed and shoots firey arrows.\r<br />Dremora Warlock-  A bit OP or strong at high lvls/legendary.  Lots of mana and the icy spears he throws are really that plus incinerate and thunder bolt all wrapped up into the icy spear animation and spell damage/effect.\r<br />Felsworn Briarheart-  Just left this guys as he was.. He dual wields those spiky bone swords and does a TON of dmg on his own.\r<br />Ebony Warrior: Left him as he was originally (scales with your lvl though).  He doesn&#39;t really ever die.  I haven&#39;t let him loose on solitude guards though, I&#39;d assume he would die then.\r<br />Karstaag-  He&#39;s not as fun as I&#39;d hoped when playing with him.  Most of the time he doesn&#39;t appear when you click the spell cause he pretty large and you need to point your spell to an area that he has room to exist in.  Just keep trying to cast in different spots.\r<br />\r<br />Regrowth-  A heal spell- It is a Heal over Time spell and heals 10 health and stamina over 30 seconds base cost of 400 (before perks and enchants reduce it).  It stacks if you keep casting it.\r<br />\r<br />Dot Rune-  A pretty OP rune but costs a lot.  At high lvls and on legendary one rune probably will not one shot a mob but fun to use.  110 damage over 25 sec and base cost of 1500.  You need fortify destruction a bit to even be able to cast this.\r<br />\r<br />\r<br />God Boots- 80% magicka cost reduction on all 5 schools.  Comes in cloth and daedric armor version.\r<br />God Necklace- All shouts have no cooldown.\r<br />\r<br />Oh by the way when I say &#34;legendary&#34; when referring to the enemies these summons go up against I mean with the High Level Enemies mod with the hardcore sub mod that goes with it, which scales the enemies with you and makes you do 20% damage and receive 500% damage on legendary.\r<br />\r<br />Please comment so I&#39;ll get an idea if people like it.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />",
  "categoryId": "65",
  "version": "1.0",
  "author": "tdv",
  "createdUnix": "1389708456",
  "updatedUnix": "1389708430",
  "containsAdultContent": false,
  "uploadedBy": "tdv",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091456",
      "name": "OPsummoning",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "OPsummoning-49897-.zip",
      "uploadedUnix": "1389708430",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1d7d2c966b23af81601a384ad12c6681faca4d8d164b902f9ab63da13038a374/analysis/1407885859/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OPsummoning-49897-.zip?fid=1000091456&ttl=1535831263&ri=8192&rs=8192&setec=a734d1555763787b8862d7ee5af4096e"
    }
  ]
}