{
  "modId": 49900.0,
  "modName": "The Rock",
  "summary": "It&#39;s a small warrior themed home in the Rift, on an island near Heartwood mill. Storage,crafting,sleep,eat,peace and quiet. What else could a warrior need? Oh,yeah&#33; NO LOAD DOORS.",
  "descriptionHtml": "First: English is not my native language,so sorry if I spelled something wrong.\r<br />\r<br />Second: I made this mod for myself when I couldn&#39;t find a suitable home for my character. Funny how often I read the same line in someone else&#39;s mod:)\r<br />Since I rarely use followers and I REALLY suck at navmeshing this mod hasn&#39;t been navmeshed.\r<br />This means that this island home is all yours and yours alone&#33;\r<br />You can ride a horse  in your bedroom though&#33;&#33;&#33;:D\r<br />\r<br />Requirements:\r<br />Skyrim with the latest update\r<br />\r<br />Description:\r<br />Placed on an island near heartwood mill, this warrior&#39;s home will provide all the basic needs for your character. Full forge is placed outside,cooking and enchanting station insade. There is also a chopping block nearby to the north. There are a few named chests for easy sorting plus a number of sacks,barrels and other nonrespawnable storage containers. You also get a safe with a few items inside.There isn&#39;t much clutter,I wanted to keep it simple,but there are 4 weapon racks and 2 mannequins though. For more info check the screenshots. There is a set of custom armor and a sword,if you don&#39;t like it disenchant or sell or throw it in the water,your choice.\r<br />\r<br />Conflicts:\r<br />It may confict with mods that edit the location or items used in this mod.\r<br />\r<br />Bugs:\r<br />None that I know of except the mannequin wandering of(that&#39;s just skyrim being skyrim:))\r<br />There&#39;s a mannequin bug fix somewhere on nexus if you don&#39;t have it yet\r<br />\r<br />Permissions:\r<br />If anyone wants to do the navmesh be my guest,just credit the author and keep it on the nexus.\r<br />The same applies to any other work done to this mod.\r<br />\r<br />Credits:\r<br />To Bethesda,The makers of an awesome game & the creation kit\r<br />To all the modders who inspire many of us to try\r<br />creating something different\r<br />",
  "categoryId": "67",
  "version": "1.0",
  "author": "RyoHab",
  "createdUnix": "1389743094",
  "updatedUnix": "1389742843",
  "containsAdultContent": false,
  "uploadedBy": "RyoHab",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091523",
      "name": "The Rock",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "The Rock-49900-1-0.zip",
      "uploadedUnix": "1389742843",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d126f7ab746e5eb3414b778e7aa9d96170fd2042d1edb9065715c9813bd24665/analysis/1407886356/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Rock-49900-1-0.zip?fid=1000091523&ttl=1535831266&ri=8192&rs=8192&setec=95cc7ec77fcbda921c58cddaa601057c"
    }
  ]
}