{
  "modId": 49964.0,
  "modName": "LOTR Epic battles Armies Mod (Lord of The Rings) WIP",
  "summary": "Spawn Armies Instantly through spells, Create small/Huge battles instantly\r<br />Spawn different factions from lord of the rings creating epic battles instantly\r<br />Automatic spawns through spells no console commands\r<br />Spawn the Nazgul, Witchking, Undead, Urak-hai, Orcs/Goblins, Dragons, Elven/Gondor/Dwarf soldiers, Giant Spiders, Ents.",
  "descriptionHtml": "*********Description************\r<br />\r<br />This mod lets you automatically spawn different factions inspired from lord of the rings & lets you create epic Army battles instantly. Automatic spawns through spells, no console commands.\r<br /> Spawn the Undead, Nazgul, Witch King, Orcs/Goblins, Dragons, Giant Spiders, Giant Ents, Elven/Gondor soldiers, Fountain Guard, Urak-hai & Lord Sauron himself.\r<br />\r<br />&#33;&#33;NO SCRIPTS&#33;&#33;&#33; so its safe, not game breaking.\r<br />\r<br />&#33;&#33;&#33;IMPORTANT&#33;&#33;&#33;&#33; --- I wouldn&#39;t recommend trying to spawn spam everything at once. Go slow at first see how it goes and what your computer can handle.\r<br />\r<br />Would like constructive feedback. What do you want to see in the mod? What can be improved etc. there definitely is some balancing issues I&#39;m not a great on that stuff\r<br />**DoomxShadow** - while Sparky adds new content, I’ll be tweaking and making it as leveled as possible, my main aim is to make it a challenge at higher levels (after 50) on legendary difficulty as everything else seems too easy, but also playable at level 20 (you can reach level 20 in 2 hours of playing) still recommendations and Endorsements are very welcome.\r<br />Thanks for the feedback. \r<br />\r<br />*********Compatibility************\r<br />\r<br />Tested mod compatibility added with &#34;Wars of the Third Era LOTR&#34; works fine. \r<br />Also with The Fellowship in Skyrim (works really well together)\r<br />\r<br />*********Location************\r<br />\r<br />The spells are located in the Whiterun. \r<br />Located in a chest behind the guard house below the steps in white run, near the entrance. They are in a numerical order as well as strongest Evil factions first to strongest Allied factions last, so they are at the top of the spells list under the alteration Tab. (Personally I favorite them for even easier access)\r<br />\r<br />********RECOMMENDED MODS****** \r<br />\r<br />Pretty much any LOTR mod, too many to mention.\r<br />I.e. wars of the third era, The Fellowship in Skyrim, Isilmeriel LOTR Weapons Collection\r<br />\r<br />1. AMAZING FOLLOWER TWEAKS - to allow spawned factions to become followers (currently not fully compatible, still some bugs to work out)\r<br />2. DANCE OF DEATH: to disable enemy quick death on you and go through the awesome kill animations\r<br />3. DEADLY MUITLATION: to decapitate, dismember enemies, and churn through them quickly\r<br />4.  ENHANCED BLOOD for the blood and gore, the way a battle should be\r<br />5.  REALISTIC PIEARCING ARROWS name says it all\r<br />\r<br />********Change Log****** \r<br />\r<br />(update) added  a small update, extra chests locations for those having isssues. Added two New chest locations\r<br />1.one inside dragons reach just as you enter on the right. \r<br />2. the other at High Hrothgar outside the door on the right entrance on\r<br />\r<br />(1.7 Update)added Numenorean & Army of the dead factions, aswell as adding decent sol swords for nazgul\r<br />\r<br />(1.6 Update) has been added, there has been allot of balancing/tuning thanks to Doomxshadow. \r<br />-the factions don&#39;t try to kill each other anymore including you, the bad guys stick with the bad guys and will try to kill you instead of each other (some of the good guys are pansies and will run)\r<br />-each summoned class had a renaming of the units as well as a definitive class arrangements (warriors/archers/commanders/warlocks) they will also fight as there class archers will shoot arrows at you, but if you get to close will pull out there sword fight while backing away and begin shooting arrows at you again (Uruk-Hai are a perfect example of this)\r<br />-changed Uruk-Hai to vampires in order to make the eyes glow (look more evil)\r<br />-instead of summoning 2 dragons I separated the spells and now you only summon one each. (I don&#39;t recommend summoning them at all especially if you have a dragon overhaul as there seems to be complications with the dragon skeleton when it lands as it looks halfway imploded, that and you can’t absorb their souls, I have to play around with them a little more but consider yourselves warned.)\r<br />- Reordered spell List from strongest baddie to strongest ally depending on units strength and how many summoned\r<br />- Made Ents a huge boss only 1 summoned but hard to kill (still trying to figure out how to make it an ally and not attack as creatures are different from people) also made creatures summoned separately.\r<br />-Re-organized armor sets and weapons, dwarfs actually look like dwarfs, weapons actually do damage (no more Uruk-Hai damage nerf, there actually a challenge) \r<br />- if you attack an ally all allies won’t come charging at you, just that one, and no bounty will be put on you for killing allies, so feel free to kill them and take their stuff\r<br />- Haradrim, lord Sauron, Mirkwood elves, Rohan soldiers, now have copies of vanilla And Daedric artifacts lookalikes, all leveled. (still tweaking)\r<br />- took all spell books out of whiterun Beezehome, can now be found in a chest behind the guardhouse in Whiterun next to the river, to the Left of the entrance.\r<br />-witch king as well as the Nazgul have better attire (true Nazgul version incorporated but not used, just needs Tweaking)\r<br />-added FUS RO DAH to Lord Sauron’s mace, he now flings people like crazy. (Still tweaking to get it just right) he’s Also much stronger (More health / Damage)\r<br />-Player version of Lord Sauron’s mace now drops, still needs to be leveled, but can be un-enchanted for “Sauron’s strength” (FUS-RO-DAH on any un-enchanted weapon)\r<br />-Dwarfs had a retexturing of the helmets so they now match the ebony armor\r<br />\r<br />(1.5 Update) \r<br />-Galadrim armor added, changed Galadrim appearance to look like LOTR elves.\r<br />-Creatures, Giant Ent & Giant Spiders Added\r<br />\r<br />(1.4 Update) \r<br />-Fountain guard, Mirkwood Elven rangers & Witch-king of Angmar Summons added\r<br />-Dwarves have more weapons selection and an added helmet \r<br />-Nazgul / Lord Suaron have ghost script turn into pile of ash upon death. \r<br />-Goblins made smaller\r<br />\r<br />(1.3 update) \r<br />-Haradrim, Nazgul, Dwarf Warriors Added\r<br />-Rohan Warriors have been updated. New shields helmets. (Hoping to get my own helmets in at some point)\r<br />-Full Gondor armor added. First Summon takes a little longer. (About 5-10 seconds depending on your machine)\r<br />\r<br />*********IMPORTANT NOTE******** \r<br />\r<br />&bull;   Lord Sauron’s armor files will not be included in the mod if it breaches TOS, nor information how to get them. However if you already have them (not that hard to find) you will be able to spawn him \r<br />(I will be looking to include an alternative ASAP)\r<br />\r<br />*********Future Projects********\r<br />\r<br />-The Dark forces of Mordor seem to be overcoming the realm of men. So I might add some extra factions. The army of the undead and work on Numenoreans, to help out as well as some extras also.\r<br />-Been saying for ages but I’m going to work on a video for the mod since it has gotten more popular.  Really want to add my own Rohan helmets in the future & find some good model assets for Trolls / Balrog Summons.\r<br />\r<br />*********Credits********\r<br />\r<br />-   Enpremis Galadhrim Gear, credit and thanks to Enpremi\r<br />\r<br />-   Urak-Hai armor mod, credit and thanks to mandarin\r<br />\r<br />-   Gondorians armor credit and thanks to BGSMERP / Maty\r<br />\r<br />-   Spell of spawn mod credit and thanks to Skydrawn33\r<br />\r<br />-   Viking shields set mod credit and thanks to Matherthebec\r<br />\r<br />-   north man Armor credit and thanks to ActusReus\r<br />\r<br />-   Open helmets for guards\r<br />\r<br />-   Armored Nightingale by DoODABoOM\r<br />\r<br />-   Aragorn Ranger Armor- Standalone and Craftable - LOTR\r<br />    by BurnInHeaven aka Mister Fahrenheit\r<br />\r<br />-   Sol swords by Zikoru\r<br />\r<br />-       Dogtown01  balrog/troll\r<br />\r<br />-   DoomxShadow for helping me improve the mod considerably with balancing/tuning and organizing the mess it was in the .esp using the CK.",
  "categoryId": "25",
  "version": "1.7",
  "author": "Sparky - DoomxShadow",
  "createdUnix": "1389959691",
  "updatedUnix": "1469815645",
  "containsAdultContent": false,
  "uploadedBy": "sparky84",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097962",
      "name": "Sparkys Version 1.5 LOTR Epic battles Armies Mod",
      "version": "1.5",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "128692",
      "fileName": "dsfdfdfdsf-49964-1-5.7z",
      "uploadedUnix": "1392921923",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/32c8badde7795c06bb27b7ba4b5c996ea7866dccdfa78a2e2c0b63b47ae29928/analysis/1407942402/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/dsfdfdfdsf-49964-1-5.7z?fid=1000097962&ttl=1535831362&ri=8192&rs=8192&setec=3f57f996f4706c4157f4cdd39e620f17"
    },
    {
      "fileId": "1000117830",
      "name": "Sparkys-Doomxshadow. Version 1.6 LOTR Epic battles Armies Mod",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "128672",
      "fileName": "Sparkys-Doomxshadow. Version 1.6 LOTR Epic battles Armies Mod-49964-1-6.7z",
      "uploadedUnix": "1405529493",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/90e2e43989bf6ff5f04321055ad1f4e3be11180e6429e1b6e7a31a1723b17d5a/analysis/1405529560/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sparkys-Doomxshadow.%20Version%201.6%20LOTR%20Epic%20battles%20Armies%20Mod-49964-1-6.7z?fid=1000117830&ttl=1535831363&ri=8192&rs=8192&setec=817164148e5e97def8ad529e1b84419d"
    },
    {
      "fileId": "1000119392",
      "name": "Sparkys-Doomxshadow. Version 1.7 LOTR Epic battles Armies Mod",
      "version": "1.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "134485",
      "fileName": "Sparkys-Doomxshadow. Version 1.7 LOTR Epic battles Armies Mo7-49964-1-7.7z",
      "uploadedUnix": "1406411440",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/ca4c2f63cab8e1db446ba23c1e6ddfa671414e1887e36b7e087889644ef12af2/analysis/1406411501/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sparkys-Doomxshadow.%20Version%201.7%20LOTR%20Epic%20battles%20Armies%20Mo7-49964-1-7.7z?fid=1000119392&ttl=1535831363&ri=8192&rs=8192&setec=47905aa432fadc89e1b70eef378a1550"
    },
    {
      "fileId": "1000185202",
      "name": "lOTR EPIC BATTLE NEW CHEST LOCATIONS",
      "version": "One is inside Dragons reach, just as you enter on the right. the other at High Hrothgar, outsie the door on the right entrance",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "68",
      "fileName": "lOTR EPIC BATTLE NEW CHEST LOCATIONS-49964-.zip",
      "uploadedUnix": "1447775409",
      "modVersion": "One is inside Dragons reach, just as you enter on the right. the other at High Hrothgar, outsie the door on the right entrance",
      "virusScanUrl": "https://www.virustotal.com/file/7e831df2c32f36d22385db53ff07a115f7e419e0b7432c506c7b4db18d336068/analysis/1447775463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/lOTR%20EPIC%20BATTLE%20NEW%20CHEST%20LOCATIONS-49964-.zip?fid=1000185202&ttl=1535831364&ri=8192&rs=8192&setec=6b8b39a9675f8619ddb46b8d49447d2f"
    },
    {
      "fileId": "1000214910",
      "name": "Sparkys-Doomxshadow. Version 1.8 LOTR Epic battles Armies Mod",
      "version": "1.8",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7128",
      "fileName": "Sparkys-Doomxshadow. Version 1.8 LOTR Epic battles Armies Mod-49964-1-8.rar",
      "uploadedUnix": "1469815645",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/cb409df42980780dfdad8d532e9dce71020f9584333f206419fb3db3e9e5a5e2/analysis/1469815688/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sparkys-Doomxshadow.%20Version%201.8%20LOTR%20Epic%20battles%20Armies%20Mod-49964-1-8.rar?fid=1000214910&ttl=1535831364&ri=8192&rs=8192&setec=62cc1347fc1ac5de0e76529518cffcbb"
    }
  ]
}