{
  "modId": 49965.0,
  "modName": "Noble Plate Armour",
  "summary": "This mod adds a new set of plate armour to the game. The cuirass and grieves are separate to the under-garments, so you can take off your armour and walk around town in your gambeson",
  "descriptionHtml": "[u][b]Noble Plate Armour (v1.0) by Hypno[/b][/u]\r<br />\r<br />\r<br />\r<br />[u]Description[/u]\r<br />\r<br />This mod adds a new set of plate armour to the game. The stats are slightly stronger then the vanilla steel plate armour, but also slightly lighter as it comes from the Skyforge. The thing that makes it unique is that the cuirass and grieves are separate to the under-garments and take up two of the unused body slots. I made it like this for the small amount of immersion of being able to take off the armour plates, while continuing to walk around town still wearing the under-garments. Lastly, there is a choice of 10 colours and three materials for the under-garments, resulting in 30 different combinations.\r<br />\r<br />\r<br />\r<br />[u]Acquiring The Armour[/u]\r<br />\r<br />Paulus Marinus, an Imperial Master Blacksmith, has recently traveled to Whiterun to see the Skyforge. For the majority of his life, he has been travelling all over the continent to hone his smithing skills. You will find him around the Skyforge during the day and then in the Bannered Mare at night. The full set or armour + under-garments costs 2000 gold and takes 5 game days to produce.\r<br />\r<br />\r<br />\r<br />[u]Known Issues[/u]\r<br />\r<br />The mod was primarily made for male characters. There are some issues with the weight painting of the cuirass when worn by female characters, making the mesh distort in weird ways. \r<br />\r<br />Secondly, because the folks at Bethesda decided to change the UV mapping for the under-garment between the male and female mesh (even though the meshes themselves are pretty much identical&#33;), my re-textures didnt work when used on the female mesh. I couldn&#39;t bring myself to create a whole new set of 30+ textures, especially with the previously mentioned issue haunting matters. At a later date, I might come back and fix these issues if there is a demand for it, but for the time being I&#39;m committed to a new project. \r<br />\r<br />Lastly, the NPC added by the mod uses silent audio files, so you&#39;ll need to turn on subtitles to understand what he&#39;s saying. If there are any voice actors out there, please get in touch. \r<br />\r<br />As a side note, I will be the first to admit that I am not the best texture artist when it comes to making brand new textures from scratch. If any artists out there wish to do a better job, please send me a PM and I&#39;ll send you the photoshop files.\r<br />\r<br />\r<br />\r<br />[u]Recommended Mods[/u]\r<br />\r<br />Duke Patrick&#39;s Archery And Heavy / Light Weapons Combat\r<br /> \r<br />(http://tesalliance.org/forums/index.php?/files/file/1567-duke-patricks-archery-and-heavy-weapons-combat/)\r<br />\r<br />This is a combat overhaul which aims to make things far more realistic when it comes to all things fighting related. This mod deserves a special mention as the author has kindly gone the extra mile of making his mod work with my unorthadox use of the extra body slots for the cuirass and grieves. He has real life experience in medieval style combat and is tailoring his mod to try and reflect this. I highly recommend you give it a go.\r<br />\r<br />\r<br />\r<br />[u]Permissions[/u]\r<br />\r<br />Please respect my decision of where I choose to upload this mod, so do not re-upload it elsewhere. The new meshes and textures provided in the archive remain my property. If anybody wishes to include them in their own mods, please get into contact with me either on the Nexus or the Bethesda Forum.\r<br />\r<br />\r<br />\r<br />[u]Credits[/u]\r<br />\r<br />Bethesda - for an awesome game and giving us the tools to mod it\r<br />Duke Patrick - for modifying his mod to be compatible with this armour\r<br />All the regulars in the Bethesda Forums - you know who you are&#33;",
  "categoryId": "54",
  "version": "1.0.1",
  "author": "Hypno",
  "createdUnix": "1389831812",
  "updatedUnix": "1389838076",
  "containsAdultContent": false,
  "uploadedBy": "hypno88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091677",
      "name": "NoblePlateArmourV1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35435",
      "fileName": "NoblePlateArmourV1-49965-1-0.7z",
      "uploadedUnix": "1389833245",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0afc8c887c401d67803111a43c496319fe484ab51119228c9085d948b4bc6b62/analysis/1407887535/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NoblePlateArmourV1-49965-1-0.7z?fid=1000091677&ttl=1535831366&ri=8192&rs=8192&setec=edc5418afa54c22b6cdc875a9de09d46"
    },
    {
      "fileId": "1000091681",
      "name": "NoblePlateArmourV1_0_1",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35435",
      "fileName": "NoblePlateArmourV1_0_1-49965-1-0-1.7z",
      "uploadedUnix": "1389838076",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/f9806f29a05b75799465eb6d2441dd21bdcd2da0b06bc10a90b06c5e80098fa2/analysis/1407887542/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NoblePlateArmourV1_0_1-49965-1-0-1.7z?fid=1000091681&ttl=1535831366&ri=8192&rs=8192&setec=b2e9b39e4ac25aefaf85faa277abe1f7"
    }
  ]
}