{
  "modId": 49997.0,
  "modName": "Plastered Farmhouses",
  "summary": "Plasters the bare plank walls of common farmhouses",
  "descriptionHtml": "Plastered Farmhouses, a mod by Kohdi\r<br />\r<br />-Description-\r<br />The Romans did it. The English did it. The Chinese did it. The Maya did it so much they nearly ran out of trees to burn. It&#39;s still done across the world. Even those sissy Imperials figured it out in Cyrodiil, yet the common Nord farmer hasn&#39;t seemed to apply it to his advantage. I&#39;m talking, of course, about plastering the walls of buildings. You may not have noticed, but the various farmhouses and wooden structures scattered across Skyrim are built from bare planks of wood, appropriate in some cases but not especially resistant against weather and time. The simple addition of plaster over these surfaces helps resist sun and rain, and keeps in vital heat during the winter. It would make sense, then, that such a simple innovation would be within the scope of the peasantry, and so I have decided to assist them all. Every farmhouse mesh, from blacksmiths&#39; patios to jarls&#39; longhouses, have been spread with a coat of white plaster over their bare planks, giving them an overall lighter, more sophisticated look without sacrificing that rough, simple construction which defines Skyrim.\r<br />\r<br />Optional Update - By popular demand I have added a &#34;weathered plaster&#34; version which darkens and roughs up the plaster texture. Note that this will also affect the look of a few Whiterun interiors, but it should not be an objectionable change. Simply install the update over the main file and overwrite as necessary.\r<br />\r<br />-Compatibility-\r<br />The plaster texture is from an underused Whiterun resource, and all others on the farmhouses are left alone, meaning this should play nicely with both vanilla games and those using texture overhauls. Just be sure to install this over those files. I have also included several LOD texture options for those using vanilla, Vurt&#39;s summer overhaul, or corresponding versions for those using Grieche&#39;s [url=http://www.nexusmods.com/skyrim/mods/19446/?]Skyrim Distance Overhaul[/url]. Aside from these considerations there may easily be conflicts with other mods, so it will be up to you to identify this potential and decide which to install. If you want a patch made, let me know and I&#39;ll think about it.\r<br />\r<br />The texture change will also affect Hearthfire home pieces if you have the DLC, so it will be up to you to decide whether this is a good change for you.\r<br />\r<br />-Installation-\r<br />1. Drag the Textures and Meshes folders inside the Core directory to your Data folder (overwrite if necessary)\r<br />2. Select your choice from the LOD Options directory and do the same\r<br />3. Enjoy your new farmhouses&#33;\r<br />\r<br />-Uninstallation-\r<br />1. Remove the files you dragged into Meshes and Textures, being sure to replace your LOD files if you use SDO\r<br />2. Cackle as you throw simple Nord farmers back into the dark ages\r<br />\r<br />-F.A.Q.-\r<br />Q: The farmhouses still look the same&#33;\r<br />A: Make sure you extracted everything properly, meshes and textures going into their respective folders. Also make sure you overwrite when prompted.\r<br />\r<br />Q: I don&#39;t like the change, and I didn&#39;t make backups&#33;\r<br />A: You should be able to reset your farmhouses by deleting the mod files, just make sure to replace any that came from mods other than mine (SDO textures, summer LOD versions, etc.)\r<br />\r<br />Q: This is dumb and you&#39;re dumb for releasing it&#33;\r<br />A: Thanks for the input.\r<br />\r<br />-Credits-\r<br />Mesh re-pathing and LOD editing by myself\r<br />Original SDO textures by Grieche\r<br />All other work by Bethesda\r<br />\r<br />-Contact-\r<br />Leave a comment or send me a PM, I&#39;ll try to respond in a timely fashion.",
  "categoryId": "53",
  "version": "1.1",
  "author": "Kohdi",
  "createdUnix": "1389917509",
  "updatedUnix": "1390124815",
  "containsAdultContent": false,
  "uploadedBy": "Kohdi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091813",
      "name": "Plastered Farmhouses",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24900",
      "fileName": "Plastered Farmhouses-49997-1-0.rar",
      "uploadedUnix": "1389917384",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f4dd2706e9103a116e6cb7d29ddd5490c611b69e840c79e9b72ac41f6f8355df/analysis/1407889255/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Plastered%20Farmhouses-49997-1-0.rar?fid=1000091813&ttl=1535831426&ri=8192&rs=8192&setec=a7b5574385d79a17e953fe69accda196"
    },
    {
      "fileId": "1000092154",
      "name": "Weathered Plaster",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7105",
      "fileName": "Weathered Plaster-49997-1-1.rar",
      "uploadedUnix": "1390124815",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/09a6e83588a8c121d70203d8cc4882552ca82628aed7f57031e4321eaabe8651/analysis/1407892211/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weathered%20Plaster-49997-1-1.rar?fid=1000092154&ttl=1535831426&ri=8192&rs=8192&setec=be56f2b1447fcaf9ba64392a5485478c"
    }
  ]
}