{
  "modId": 50020.0,
  "modName": "Quest Grave Danger Wave style combat",
  "summary": "When an alchemist&#39;s son has run off to attempt a dangerous experiment in the middle of an old nordic burial ground, it&#39;s up to the dragonborn to save the day&#33; This mod features &#34;wave&#34; style fights where you&#39;ll be facing off tons of enemies spawned in &#34;waves&#34;, including boss fights&#33;",
  "descriptionHtml": "SKSE required\r<br />\r<br />Grave Danger is a quest mod that pits you up against waves of enemies. It is designed to challenge the player with tasks of combat that may also involve certain objectives such as defending an NPC. The story has you chasing after the son of an alchemist whom is attempting a dangerous experiment. You will have to protect him from draugr while he works on his concoction. Can you do it? Bonus fights accessible after the quest currently including: a fight within a Dwarven recycling plant.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />When I made Grave Danger, I wanted to introduce a new way of playing into the game. I had the idea of having large wave spawning fights across massive areas. It&#39;s been a lot of hard work to properly finagle the system into letting this work and the mod does have a few bugs for some users, but mostly it works. I gave the mod a quest just to add some narrative interest, and to recruit some of my friends into doing some voice acting. I also added some bonus content to kind of show how the wave script can be used to make more interesting fights then the typical move through a dungeon and run into an enemy, which I feel is still a fun way to play, but the wave spawning fights are to spice things up in a fresh way. By that I mean, imagine, for instance, going through a long interesting quest and having the final battle at the top of a temple while fighting through countless draugr in order to stop a ritual from completing. Or having to do a quest in the middle of a war between two factions, or having to shut down the BBEG&#39;s magic device while fighting off his spawns of demon minions. The script in this mod aims to make such scenarios possible by enabling the ability to spawn enemies by credentals(set by the modder), and extending NPC&#39;s ability to see other creatures during these fights, so that you can have them on a large scale area.\r<br />\r<br />These are the kinds of things I hoped to make possible when I made Grave Danger.\r<br />\r<br />\r<br />\r<br />As a side note, I like to hear from players. If you enjoyed the mod or you have a cool story, I&#39;d love to hear you post it. If you have any feedback or any bug finds, I&#39;d love to hear that too. I am a modder and I aspire to become a game developer some day, so I appreciate any opportunity I can find to grow.\r<br />\r<br />Also, a big thanks to the users on the nexus forums and my friends and family for playtesting\r<br />Special thanks to Pheo3309 and IsharaMeradin\r<br />and to my brother and his friend for voice acting",
  "categoryId": "35",
  "version": "V1.1",
  "author": "subtanker",
  "createdUnix": "1389988172",
  "updatedUnix": "1390638328",
  "containsAdultContent": false,
  "uploadedBy": "subtanker",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000091912",
      "name": "Quest Grave Danger Wave Style Combat",
      "version": "V1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16800",
      "fileName": "Quest Grave Danger Wave Style Combat-50020-V1-0.rar",
      "uploadedUnix": "1389987765",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/69bcbaaa03374ba37001024e0c4bd8fb7a12df2510e5ddce424aa2a23591f791/analysis/1407890208/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Quest%20Grave%20Danger%20Wave%20Style%20Combat-50020-V1-0.rar?fid=1000091912&ttl=1535831461&ri=8192&rs=8192&setec=ea1d66464ff598ca9597e91579716269"
    },
    {
      "fileId": "1000093260",
      "name": "Quest Grave Danger Wave Style Combat",
      "version": "V1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16641",
      "fileName": "Quest Grave Danger Wave Style Combat-50020-V1-1.rar",
      "uploadedUnix": "1390638328",
      "modVersion": "V1.1",
      "virusScanUrl": "https://www.virustotal.com/file/616a799e2d071ead7cfd2f7a432f4a314c1abe3642ce5b3e0ca6d43a0c00d927/analysis/1407900910/",
      "changelogHtml": " Added options for Normal and Hard mode <br/> \n No more &#34;invisible barrier&#34; for archers to shoot behind <br/> \n Dovahkiin&#39;s lines have been slightly changed, to be better, and certain lines of dialogue are now required to go through the quest. This is so when characters are mentioned later on, it is not so out of the blue. <br/> \n The main quest no longer uses the civil war music, it now simply uses the music from being in combat. This is to avoid a rare issue where the combat music does not stop playing. <br/> \n The &#34;pit of death&#34; will now simple lower a follower&#39;s health to 1 hp and place them back at the surface. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Quest%20Grave%20Danger%20Wave%20Style%20Combat-50020-V1-1.rar?fid=1000093260&ttl=1535831462&ri=8192&rs=8192&setec=eb5e37636366abf19593052dc250b074"
    }
  ]
}