{
  "modId": 50042.0,
  "modName": "TDF Equipment Restriction",
  "summary": "This mod seeks to mirror the level/skill restrictions found in some RPGs and MMOs regarding usable equipment. Weapons, armor and magic will now have skill requirements to be usable.",
  "descriptionHtml": "[b][u]Short Description[/u][/b]\r<br />This mod seeks to mirror the level/skill restrictions found in some RPGs and MMOs regarding usable equipment. Weapons, armor and magic will now have skill requirements to be usable.\r<br />\r<br />[b][u]Long Description[/u][/b]\r<br />When equipping weapons and armor, this mod will check to see if the player character meets skill requirements. As of v2.0, weapons are dealt with in the style of Dark Souls: the player can still attempt to swing the weapon, but will deal less damage, suffer heavy stamina damage, and be staggered/stunned temporarily. As of v2.5, armors are also no longer simply unequipped. Higher-level armor can still used, but at the cost of decreased effectiveness and, in the case of Heavy Armor, increased encumbrance. With the MCM menu, the skill requirements for each material type can be modified, and the mod can be made to affect or not affect Heavy Armor, Light Armor, Archery Weapons, One-Handed Weapons, Two-Handed Weapons, equipment used to block, and Magic. v2.6 adds support for shields and magic spells. Higher-level shields (and weapons for which the player fails the Block skill test) will cause staggering to the wielder when they block or bash. Higher-level magic can be used at the cost of lower effectiveness (Destruction and Restoration), lower duration (Conjuration and Illusion), and higher cost (Alteration).\r<br />\r<br />To explain the mod with an example, assume that the player has set the skill requirement for Iron equipment to 50; for the purposes of the example, this player has a One-Handed skill of 60, a Two-Handed skill of 40, a Block skill of 45, and a Heavy Armor skill of 35. The player may equip an Iron Sword without issue. As of v2.0, attempting to swing an Iron Warhammer will have the player deal significantly less damage and suffer staggering and stamina damage. In Dark Souls, the concept is that you lack the strength/dexterity to effectively wield the weapon, which results in your epic-ly failed swings. Bows which the player cannot use effectively will not cause the stamina damage and staggering, but will also deal significantly reduced damage. As of v2.5, the player&#39;s attempt to equip an Iron Helmet will result in the helmet being 15% less effective and increasing encumbrance. Similarly, higher-level Light Armor pieces are 30% less effective, but don&#39;t affect encumbrance. As of v2.6, the player&#39;s attempt to block or bash with the Iron weapons will cause the player to be staggered.\r<br />\r<br />By default, the mod affects Heavy Armor, Light Armor, Archery Weapons, One-Handed Weapons, Two-Handed Weapons, equipment used to block, and Magic, and the level requirements are as follows:\r<br />Draugr, Hide (and Forsworn), Imperial, Iron, Leather (and Thieves Guild), Stormcloak, Wood - 0\r<br />Bonemold, Steel (and Dawnguard), Studded - 20\r<br />Chitin, Elven, Falmer, Glass - 30\r<br />Aetherium, Dwarven, Nordic, Orcish - 40\r<br />Ebony, Stalhrim - 50\r<br />Daedric, Dragon - 60\r<br />Novice - 0\r<br />Apprentice - 20\r<br />Adept - 40\r<br />Expert - 60\r<br />Master - 80\r<br />\r<br />v2.6.5 adds a new MCM option that incorporates a minor feature. Now, weapon swings when the player has 0 stamina will cause a staggering effect, if the feature is enabled.\r<br />\r<br />[b][u]Requirements[/u][/b]\r<br />Latest Official Skyrim Patch (v1.9.32.0.8)\r<br />Dawnguard and Dragonborn DLCs (optional, RE: Files)\r<br />SKSE\r<br />SkyUI (Highly recommended to allow customization and safer uninstallation)\r<br />\r<br />[b][u]Installation[/u][/b]\r<br />Extract and merge contents with Data folder.\r<br />Can be placed anywhere in load order because it does not edit any Vanilla objects, and is thus fully compatible with all other mods.\r<br />\r<br />[b][u]Updating[/u][/b]\r<br />Unequip all equipment and save. Overwrite the files.\r<br />\r<br />[b][u]Uninstallation[/u][/b]\r<br />Unequip all equipment, and use the Uninstall option in the MCM (if possible, otherwise a clean uninstall is not really possible).\r<br />Save, quit, uninstall the mod, reload, and save again.\r<br />\r<br />[b][u]FAQ (or, at least, good concept-related questions)[/u][/b]\r<br />[i]Isn&#39;t this mod useless since Skyrim levels with the player, so they won&#39;t see higher-level equipment until they are a higher level?[/i]\r<br />A lot of people use mods that delevel the world, like SkyRe and Requiem, so they can encounter higher-level equipment at low levels. Even without these mods, consider a high-level character specializing in Two-Handed weapons. They will be able to pick up some high-level One-Handed weapons, but probably would not be able to use them due to this mod. In a sense, this mod discourages multi-classing and encourages specialization. Additionally, even the the Vanilla game, many unique items that would qualify as higher-level items are available early in the game, so this mod discourages their premature use.\r<br />\r<br />[i]Isn&#39;t a sword just a sword? Why should you wield one more effectively than another?[/i]\r<br />Consider that high-level swords are heavier. That means that you need more experience to deal with the new weight properly, which explains why a lower-level player will wield a higher-level sword less effectively.\r<br />\r<br />[i]Isn&#39;t this sort of system better suited to games based on skill investment rather than skill progression?[/i]\r<br />I agree, but I feel that it still works quite well with Skyrim&#39;s system despite this. You could always use a mod like Skyrim Experience Mod if you prefer skill investment.\r<br />\r<br />[i]Does this affect custom equipment from other mods?[/i]\r<br />If the mod author added Keywords properly, it should affect that equipment or magic.\r<br />\r<br />[i]Does this mod conflict with any mods?[/i]\r<br />This mod was designed for maximum compatibility. I didn&#39;t edit any existing perks/weapons/armor/quests/etc. The only conflicts might be stylistic. For example, if you use a mod that gives you stamina as you swing a weapon (which doesn&#39;t make any sense), it will cancel out the stamina damage that my mod causes.\r<br />\r<br />[b][u]Bugs[/u][/b]\r<br />- [s]When the script unequips armor pieces, the change may not appear in the menu, but it is a purely aesthetic problem.[/s] This feature was removed in v2.5.\r<br />- [s]If a mod attempts to force you to use a specific weapon/armor to complete a quest or complete some action, for example, and the weapon/armor is (as far as my mod is concerned) requires higher skill levels, you won&#39;t be able to equip the item and thus won&#39;t be able to complete the quest. A Vanilla example would be with Nettlebane. My mod accounts for Vanilla conditions (i.e. gives Nettlebane, the Rusty Mace, and the Blade of Sacrifice exemption), but cannot account for equipment from other mods. In that case, you&#39;d just have to temporarily disable my mod&#39;s feature(s).[/s] v2.0 is not based on weapon unequipping anymore.\r<br />- [s]I forgot to add a line to the translation file that causes the &#34;dollar-sign&#34; bug with the MCM header &#34;Apply restriction to...&#34;.[/s] Fixed in v2.0.\r<br />- The new spell magnitudes and durations may not display properly in SkyUI, but I don&#39;t think there is anything I can do about that.\r<br />\r<br />[b][u]Thanks[/u][/b]\r<br />[b]R0R0N0[/b] for the mod idea.\r<br />[b]CGi[/b] for help with the MCM localization.\r<br />[b]ww13[/b] for the German translation of the MCM.\r<br />[b]monbabii[/b] for help with the mod concept.\r<br />[b]Chesko[/b] for a script that prevents the unequip-enchantment-charge bug.\r<br />\r<br />[b][u]Version History[/u][/b]\r<br />v1.0 caused weapons/armors, that the player lacked the skill to use effectively, to be automatically unequipped.\r<br />v2.0 developed the weapon aspect. It allowed the equipping of weapons that the player lacked the skill to wield, but using the weapon in combat would have consequences. Inspired by Dark Souls, such weapon swings would deal significantly reduced damage and cause the player to suffer staggering and stamina damage. I removed v1.0 because I felt that the original concept was very bland and too removed from what is realistic.\r<br />v2.1 made minor tweaks. It causes staggering and stamina damage from failed two-handed weapon swings to be more severe than their one-handed weapon counterparts. To combat the Vanilla game bug where the player can attack while staggered, this version also causes weapon swings to slow dramatically to mimic the inability to swing the weapon again temporarily.\r<br />v2.5 allows the use of higher-level armor pieces, but at the cost of decreased effectiveness (15% for Heavy and 30% for Light). Also higher-level Heavy Armor will increase encumbrance. It also adds support for lesser-used Armor/Weapon types that I missed earlier.\r<br />v2.6 added support for Bound Weapons. Specialized support for Magic and Shields (and weapons used for blocking) was also added. The player can choose level requirements for Novice, Apprentice, Adept, Expert, and Master level spells. Failing the level requirements in the respective school causes Alteration spells to cost more Magicka, Illusion and Conjuration spells to not last as long, and Destruction and Restoration spells to be less strong. For Blocking, failing the level requirement causes attempted bashing and blocking to stagger the wielder while blocking effectiveness is reduced by 25%.\r<br />v2.6.5 adds a new minor feature that can be enabled/disabled through the MCM. When the player has 0 stamina, weapon swings will cause staggering to the player. v2.6.5b is for non-DLC users.\r<br />v2.6.6 and v2.6.6b fix an issue with one-handed Bound Weapons being affected by the incorrect level requirement variable.\r<br />v2.6.7 and v2.6.7b (for Dawnguard and Dragonborn DLC users, and non-DLC users, respectively) add a new option to cause a chance to be disarmed after a failed weapon swing, block, or bash. By default, the chance is 10%, but the chance can be modified in the MCM.\r<br />v2.6.8 and v2.6.8b finished up any keywords I missed. The No-DLC version (b) added support for Stormcloak Officer armor; the DLC version added support for Dawnguard armor sets and Falmer Hardened armor sets.\r<br />\r<br />[b][u]Notes[/u][/b]\r<br />You&#39;ll have to excuse a couple things. First, if you&#39;ve taken a look at the screenshots, you&#39;ll notice that they aren&#39;t the sort of pictures that should be used to advertise a regular gameplay mod. I&#39;m in the middle of a joke playthrough playing as a pimp (I alternate between serious and joke playthroughs, and I happen to be on a joke playthrough right now) with my prostitution mod, which is not on the Nexus. This leads me to my second point. You might ask, why is the name preceded by &#34;TDF&#34;? That&#39;s my username in another modding community where this mod was first released.\r<br />\r<br />[b][u]Permissions[/u][/b]\r<br />Modify/Edit/Upload anywhere as you wish, but credit me.",
  "categoryId": "24",
  "version": "2.6.8",
  "author": "BrotherBob",
  "createdUnix": "1390021966",
  "updatedUnix": "1453841441",
  "containsAdultContent": false,
  "uploadedBy": "BrotherBob",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092140",
      "name": "TDF Equipment Restriction v2_6_6",
      "version": "2.6.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38",
      "fileName": "TDF Equipment Restriction v2_6_6-50042-2-6-6.rar",
      "uploadedUnix": "1390116566",
      "modVersion": "2.6.6",
      "virusScanUrl": "https://www.virustotal.com/file/419cb8942023e35197f860a57beee38b9b34683309a18070a63564e0d3a09425/analysis/1407892022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TDF%20Equipment%20Restriction%20v2_6_6-50042-2-6-6.rar?fid=1000092140&ttl=1535831497&ri=8192&rs=8192&setec=5d4c5eaa75e0ded535a5eb7e7c46150a"
    },
    {
      "fileId": "1000092141",
      "name": "TDF Equipment Restriction v2_6_6b - No DLC",
      "version": "2.6.6b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "37",
      "fileName": "TDF Equipment Restriction v2_6_6b - No DLC-50042-2-6-6b.rar",
      "uploadedUnix": "1390116612",
      "modVersion": "2.6.6b",
      "virusScanUrl": "https://www.virustotal.com/file/94704db9de05e2f858b252a0ac9f35d822cf12313493725d1c2bcd7a85a0ed2c/analysis/1407892084/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TDF%20Equipment%20Restriction%20v2_6_6b%20-%20No%20DLC-50042-2-6-6b.rar?fid=1000092141&ttl=1535831498&ri=8192&rs=8192&setec=f999f9028e9d84afe0d9f7ae3133a323"
    },
    {
      "fileId": "1000092255",
      "name": "TDF Equipment Restriction v2_6_7",
      "version": "2.6.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40",
      "fileName": "TDF Equipment Restriction v2_6_7-50042-2-6-7.rar",
      "uploadedUnix": "1390166863",
      "modVersion": "2.6.7",
      "virusScanUrl": "https://www.virustotal.com/file/b68c4168bfd0e74d1a8906044a10fe3ef90e7a06b006d95354674a8784295a7e/analysis/1407893060/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TDF%20Equipment%20Restriction%20v2_6_7-50042-2-6-7.rar?fid=1000092255&ttl=1535831498&ri=8192&rs=8192&setec=e19631cf862311158bd5b0721fbfc095"
    },
    {
      "fileId": "1000092256",
      "name": "TDF Equipment Restriction v2_6_7b - No DLC",
      "version": "2.6.7b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "39",
      "fileName": "TDF Equipment Restriction v2_6_7b - No DLC-50042-2-6-7b.rar",
      "uploadedUnix": "1390166905",
      "modVersion": "2.6.7b",
      "virusScanUrl": "https://www.virustotal.com/file/87a62c0579b827a812fae32d8691c64f1d957375b40364b4d619273950b53dbd/analysis/1407893061/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TDF%20Equipment%20Restriction%20v2_6_7b%20-%20No%20DLC-50042-2-6-7b.rar?fid=1000092256&ttl=1535831499&ri=8192&rs=8192&setec=a9f861a32dff1ab362a19e77a44d883a"
    },
    {
      "fileId": "1000093018",
      "name": "TDF Equipment Restriction v2_6_8",
      "version": "2.6.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "41",
      "fileName": "TDF Equipment Restriction v2_6_8-50042-2-6-8.rar",
      "uploadedUnix": "1390526539",
      "modVersion": "2.6.8",
      "virusScanUrl": "https://www.virustotal.com/file/ad54acdc788efd74c1c400912465dca7ee22d4de572658bb914198ef6f912353/analysis/1407898884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TDF%20Equipment%20Restriction%20v2_6_8-50042-2-6-8.rar?fid=1000093018&ttl=1535831499&ri=8192&rs=8192&setec=a29a0374e7fc3a57ffab7957864c68eb"
    },
    {
      "fileId": "1000093019",
      "name": "TDF Equipment Restriction v2_6_8b - No DLC",
      "version": "2.6.8b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40",
      "fileName": "TDF Equipment Restriction v2_6_8b - No DLC-50042-2-6-8b.rar",
      "uploadedUnix": "1390526579",
      "modVersion": "2.6.8b",
      "virusScanUrl": "https://www.virustotal.com/file/c5fe4df46f718dc811181819f28e58299e7f5e79841a8f8912dcc3c76f5cc81a/analysis/1407898886/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TDF%20Equipment%20Restriction%20v2_6_8b%20-%20No%20DLC-50042-2-6-8b.rar?fid=1000093019&ttl=1535831500&ri=8192&rs=8192&setec=966810455142e5bb2a2591a766134be4"
    },
    {
      "fileId": "1000139344",
      "name": "FISS Load and Save Options in MCM - for v2_6_8",
      "version": "2.6.8",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "9",
      "fileName": "FISS Load and Save Options in MCM - for both v2_6_8-50042-2-6-8.rar",
      "uploadedUnix": "1418936057",
      "modVersion": "2.6.8",
      "virusScanUrl": "https://www.virustotal.com/file/018735d16c58c6eee4d85b26c5d6591a594ddf1c51ea7a248bb29df2f79c7134/analysis/1418936103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FISS%20Load%20and%20Save%20Options%20in%20MCM%20-%20for%20both%20v2_6_8-50042-2-6-8.rar?fid=1000139344&ttl=1535831500&ri=8192&rs=8192&setec=97d5da8140d3f439d895c517c08ab633"
    },
    {
      "fileId": "1000139346",
      "name": "FISS Load and Save Options in MCM - for v2_6_8b",
      "version": "2.6.8b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "9",
      "fileName": "FISS Load and Save Options in MCM - for v2_6_8b-50042-2-6-8b.rar",
      "uploadedUnix": "1418936245",
      "modVersion": "2.6.8b",
      "virusScanUrl": "https://www.virustotal.com/file/45a473acf6b4d7f994075ff3cfc6e2a651f5f8ef27ea6d700f5ff591e986aabb/analysis/1418936284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FISS%20Load%20and%20Save%20Options%20in%20MCM%20-%20for%20v2_6_8b-50042-2-6-8b.rar?fid=1000139346&ttl=1535831501&ri=8192&rs=8192&setec=7374f5f2411365753d7b99a176c9f1f0"
    },
    {
      "fileId": "1000192919",
      "name": "TDF Equipment Restriction - German Translation for MCM",
      "version": "2.6.8",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "TDF Equipment Restriction - German Translation-50042-2-6-8.rar",
      "uploadedUnix": "1453841441",
      "modVersion": "2.6.8",
      "virusScanUrl": "https://www.virustotal.com/file/2a5458078e195dfcad8b71a658a169d5845c2564f400426edf678c2e94823436/analysis/1453841466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TDF%20Equipment%20Restriction%20-%20German%20Translation-50042-2-6-8.rar?fid=1000192919&ttl=1535831501&ri=8192&rs=8192&setec=190bdfdb09f995052e73364ebaec6db5"
    }
  ]
}