{
  "modId": 50077.0,
  "modName": "Ultimate Whiterun - German Version",
  "summary": "Weißlauf ist jetzt viel größer. Vergrößerte Fläche der Stadt. Wie man es in einer alten Handelsstadt erwarten würde, ist Weißlauf nun viel lebendiger und gefüllter. Vergrößert Weißlauf um ca. 40%.",
  "descriptionHtml": "THIS IS ONLY THE GERMAN TRANSLATION&#33;&#33;&#33;\r<br />&lt;br /&gt;Der ganze Dank geht an den Autor der Mod.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Beschreibung\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Weißlauf wird stark vergrößert. Es wurde eine extra Fläche innerhalb der Mauern geschaffen. Es gibt jetzt mehr Läden, Häuser und Höfe. Wenn man durch die Straßen geht und sich dann verläuft, hat man das Gefühl, in einer echten, alten Handelsstadt zu sein.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Die meisten Leute beschweren sich, dass die Städte in Skyrim zu klein und leer sind. Es gibt zwar viele Mods, die versuchen, die Städte mit Häusern zu vergrößern, aber keiner hat es so richtig geschafft, die Raum einer Stadt zu vergrößern. Also habe ich es versucht. \r<br />&lt;br /&gt;Ultimate Whiterun vergrößert Weißlauf, indem es mehr Fläche innerhalb der Stadt hinzufügt (ca. 40%).\r<br />&lt;br /&gt;Es werden mehr als 20 Häuser hinzugefügt, darunter eine Brauerei, einen Schmied, einen Bücherladen, ein Kleidungsgeschäft, ein Möbelgeschäft, eine Bäckerei und mehrere Wohnhäuser.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Nicht alle Häuser sind schon genutzt, ihr könnt dem Autor gerne Empfehlungen, wie sie genutzt werden sollen, schreiben.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Kompatibilität\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Weil die Mod die Mauern und Türme der Stadt ziemlich verändert, wird sie nicht mit anderen Mods kompatibel sein, die etwas innerhalb der Mauern verändern.\r<br />&lt;br /&gt;Alles andere sollte gut klappen.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Schaut euch auch die anderen Mods vom Autor an:\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Complete Solitude (http://www.nexusmods.com/skyrim/mods/36061/?)\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Foxchase Manor Player Home and Village (http://www.nexusmods.com/skyrim/mods/19435/?)\r<br />&lt;br /&gt;",
  "categoryId": "53",
  "version": "1.1",
  "author": "Captain Swoop - translation by BlackLeaves",
  "createdUnix": "1390140822",
  "updatedUnix": "1390140822",
  "containsAdultContent": false,
  "uploadedBy": "BlackLeaves",
  "primaryFile": null,
  "files": []
}