{
  "modId": 50091.0,
  "modName": "TheBeasts New Creatures in Skyrim",
  "summary": "currently 2 packs of new creatures&#33;\r<br />Undead Risen Pack: Adds 4 new undead themed creatures&#33;\r<br />The greymarch Pack: Adds 3 new creatures/monsters to skyrim&#33;",
  "descriptionHtml": "So ever since i found this wonderful modders resource pack here on nexus\r<br />http://www.nexusmods.com/skyrim/mods/37413/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D37413%26preview%3D&pUp=1\r<br />i had fallen in love with many of the creatures in the pack and decided to use them in my army. i figured since ive had so much fun with them i might as well release them to the public :D\r<br />--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />so i have 2 packs so far here is whats in them. i suck at lore but ill try my best to make the descriptions  sound interesting.\r<br />\r<br />\r<br />\r<br />[center][size=5][b]Undead Risen Pack: Provides a few creatures to aid a necromancer in his dark arts.\r<br />[/b][/size][/center]\r<br />[size=4]Bone Falmer[/size]: uses sword and invisible shield for armor protection, mostly used as foot infantry by Necromancers as their is a abundance of falmer to reanimate.\r<br />\r<br />[size=4]Bone Looper[/size]: The remains of a skeleton hastily put together by a necromancer to serve him, used as a artillery/archer, that spits poisonous liquids.\r<br />\r<br />[size=4]Bone Strider[/size]: The Remains of a Mammoth, bones magically sown back together and hardened in place. These mighty creatures can soak up huge amounts of damage before falling, making them a great asset to any necromancers army.\r<br />\r<br />[size=4]Shambles[/size]: A assortment of bones put together to form a hulking monstrosity that will instill terror upon even the most hardened warriors, these are a great asset to any necromancers army and act as shocktroopers.\r<br />\r<br />\r<br />[center][size=5]The Greymarch Pack: For those of you who prefer serving the daedra, or just want some cool soldiers of your own.[/size][/center]\r<br />\r<br />[size=4]Knight of Order[/size]: Knight made of a crystalline material, obeys orders without thought of self preservation and exists only to serve.\r<br />\r<br />[size=4]Priest of Order:[/size] A crystalline humanoid with the power to cast spells, usually acts as a sort of artillery.\r<br />\r<br />[size=4]Protector of Order[/size]: These hulking Soldiers are a fearsome sight on the battlefield and one no one would ever want to meet. They serve their master and obey orders without any thought of self preservation, their huge amounts of armor provide them with great protection.\r<br />\r<br />Note: i have another one that is not really &#34;official&#34; its a sort of  royal guard, they talk and will follow you anywhere. These Royal guards have been granted some intelligence in order to speak and plan out attacks, their main purpose is to protect their lord from harm. \r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />please note: none of these guys are hostile to the player or friendly NPC&#39;s as i have been using them as guards in towns etc...\r<br />they will protect the player from ANYTHING if nearby. Any hostile npc they will attack on sight, including if you go into a town and punch someone these guys will attack ANYONE who dares to attack you.\r<br />Also none of these guys are officially ingame, you must add them with the placeatme command or go into the creation kit and place them where you want. for the placeatme command:\r<br />go ingame, hit the console key ` then type in &#34;help&#34; and then the name of the bone creature you want, or for the gremarch pack all you have to do is type in &#34;help Order&#34; and it will show you all them and there number codes, just type in player.placeatme ######## and they should spawn at you\r<br /> i didn&#39;t want to add them to the leveled list as i don&#39;t want to mess with those of you who have monster mod, or immersive creatures.\r<br />However if any of you want to add these guys to a levelled list, please PM me before you do so and let me know what you&#39;ll be doing.\r<br />\r<br />now i hope you guys have as much fun as i did taking over skyrim&#33; :D \r<br />i wouldn&#39;t recomend this on a real playthrough as the placeatme causes save game bloat over time, unless you delete the bodys of the soldiers when they die or have the game clean them up. \r<br />\r<br />i personally think its worth it though ;)\r<br />\r<br />Also another note: if you want these guys to be hostile to you and everyone like normal enemys, just go into the creation kit and type in the name of the creatures (IE, Bone Falmer) and then edit him, set his Aggression to Very aggressive and then open up the faction i have for them, (you can see what faction im talking about in the faction tab) and remove the player faction as a ally.\r<br />same goes for the Knights of Order, just set their aggression to very aggresive and remove the player faction as a ally from them. only the player faction, if you remove them from their own faction they will attack each other. if anyone needs more help on that just PM me, or if i get enough comments about it i will just make a HOSTILE version.\r<br />\r<br />if you want more creatures i have the Shoggoth here\r<br />http://www.nexusmods.com/skyrim/mods/41834/?\r<br />\r<br />Credits:\r<br />Vicn Creature Resource pack\r<br />http://www.nexusmods.com/skyrim/mods/37413/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D37413%26preview%3D&pUp=1",
  "categoryId": "83",
  "version": "1",
  "author": "TheBeast505",
  "createdUnix": "1390162962",
  "updatedUnix": "1390162889",
  "containsAdultContent": false,
  "uploadedBy": "thebeast505",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092240",
      "name": "Undead Risen 1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3289",
      "fileName": "Undead Risen 1-50091-1.rar",
      "uploadedUnix": "1390162783",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/20f1b17728ed45ce5f902859fe8efbfc6de2839af437e448bae89c891bca4d65/analysis/1407892889/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Undead%20Risen%201-50091-1.rar?fid=1000092240&ttl=1535831606&ri=8192&rs=8192&setec=91cdc72d27161f318e18d41f36aadd28"
    },
    {
      "fileId": "1000092243",
      "name": "The Greymarch",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1378",
      "fileName": "The Greymarch-50091-1.rar",
      "uploadedUnix": "1390162889",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/614f540eed35d755892db05636588a2be4dc7f7e47fb4424c06ed844c294c756/analysis/1407892904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Greymarch-50091-1.rar?fid=1000092243&ttl=1535831607&ri=8192&rs=8192&setec=c24ef6ce6ba475f0a8d3fee56c8fa46a"
    }
  ]
}