{
  "modId": 50099.0,
  "modName": "Khmera Skin for Khmera UNP CBBE",
  "summary": "The Khmera Skin, designed to be high resolution, yet smooth choice for female skin in Skyrim. Dirty version also available.",
  "descriptionHtml": "[img]http://reaver.5gbfree.com/images/description.jpg[/img]\r<br />These skin textures are a hyper amalgamation of Dimon’s, Navesea’s, and my own recipe of skin hues/accents—designed to provide a high resolution, yet smooth skin choice for the Khmera body type. My original idea was to take a solid base texture that has no seams and fill in the parts(knees,eyes, etc) until I had a smooth skin devoid of errors. It is the &#34;CLEAN&#34; version included in the package. I also have included a more &#34;dirty&#34; version if you desire that more outdoorsy, lore-friendly look, as well as a &#34;HAIRY-DIRTY&#34; version, which is essentially an unkept girl.\r<br />\r<br />As Khmera is based on the original UNP body, you can use this texture pack with any UNP-based body style. You might get a few misplaced shadows here or there if you use a special variant of the UNP, but shouldn’t with the normal ones.\r<br />\r<br />There is also a CBBE version included in the download package.\r<br />\r<br />[img]http://reaver.5gbfree.com/images/installation.jpg[/img]\r<br />The download contains what you should need to get the skin working in-game, no matter your machine&#39;s power. I have included 4096 res as well as 2048 res textures, with all dds being compressed down from their original 86MB size. To test your system, always grab one of the 4096 sets and copy/paste the &#34;Data&#34; folder over your&#39;s. Make sure you back up your originals in case you wanna revert back later.\r<br />\r<br />If you still get the &#34;purplies&#34;, grab one of the 2048 sets and just overwrite the 4096 set. Only the large files will be overwritten. Those are only 4MB files too, so if they don&#39;t work, you need more memory&#33;\r<br />\r<br />[img]http://reaver.5gbfree.com/images/credits.jpg[/img]\r<br />I would very much like to thank Dimon, for their original basically seamless skin textures I started working from, Navetsea and alt3rn1ty, whose textures I further built from, and Shutterstock for just frickin being there for us to use when we need to create digital magic&#33;\r<br />\r<br />[IMG]http://reaver.5gbfree.com/images/permissions.jpg[/IMG]\r<br />You may not upload, or distribute any parts of this Skyrim mod without the expressed permission of myself and any other authors who may have contributed to the creation of this mod.\r<br />\r<br />",
  "categoryId": "29",
  "version": "2.0",
  "author": "Reaverlord",
  "createdUnix": "1390180827",
  "updatedUnix": "1390235108",
  "containsAdultContent": true,
  "uploadedBy": "ReaverLord",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092395",
      "name": "Khmera Skin Pack for  Khmera - UNP - CBBE Body Types",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "212061",
      "fileName": "Khmera Skin Pack for  Khmera - UNP - CBBE Body Types-50099-2-0.zip",
      "uploadedUnix": "1390235108",
      "modVersion": "2.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Khmera%20Skin%20Pack%20for%20%20Khmera%20-%20UNP%20-%20CBBE%20Body%20Types-50099-2-0.zip?fid=1000092395&ttl=1535831620&ri=8192&rs=8192&setec=ec3bd3ef6a4c2d29941bc343b24dc887"
    }
  ]
}