{
  "modId": 50101.0,
  "modName": "High Hrothgar - Arcwind Point Fix",
  "summary": "If you have Dawnguard installed and ask in High Hrothgar about the location of any Words of Power, Arngeir will eventually point you towards Arcwind Point&#39;s new Word Wall.  However, learning the word there won&#39;t end the quest, and even though going to another specific Word Wall or using the console will finish the quest, Arngeir will happil",
  "descriptionHtml": "If you have Dawnguard installed and ask in High Hrothgar about the location of any Words of Power, Arngeir will eventually point you towards Arcwind Point&#39;s new Word Wall.  However, learning the word there won&#39;t end the quest, and even though going to another specific Word Wall or using the console will finish the quest, Arngeir will happily send you to Arcwind Point again and again...\r<br />\r<br />This mod disables the reference at Arcwind Point that identifies it as a Word Wall.  So if you use this mod before Arngeir sends you there, he&#39;ll never send you there.  If you use the console to finish the quest after you&#39;ve learned the word there, then save and enable this mod, it&#39;ll prevent him from trying to send you there again.  The Unofficial Dawnguard Patch is supposed to fix this problem, but some users have reported that it doesn&#39;t; hence, this mod.  If the (otherwise excellent) unofficial patch is working for you, then you don&#39;t need this mod.\r<br />\r<br />Obviously requires Dawnguard, since this is only an issue once Dawnguard creates the new Word Wall at Arcwind Point.  This is my first and only Skyrim mod, so I don&#39;t know if there will be any lasting effects from this change, or if my mod will delete all of your saves or anything else.  Use at your own risk.",
  "categoryId": "95",
  "version": "",
  "author": "chiasticslide",
  "createdUnix": "1390170760",
  "updatedUnix": "1390170705",
  "containsAdultContent": false,
  "uploadedBy": "chiasticslide",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092264",
      "name": "ArcwindPointWordWallFix",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "ArcwindPointWordWallFix-50101-.zip",
      "uploadedUnix": "1390170705",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3c987ec1454dde27b746247d05787b14b5a8f4b188931adc55b747c20f9431b2/analysis/1407893127/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArcwindPointWordWallFix-50101-.zip?fid=1000092264&ttl=1535831624&ri=8192&rs=8192&setec=3f07829627dc8c4b9f7370be92de091e"
    }
  ]
}