{
  "modId": 50111.0,
  "modName": "Marsh-Rest - Argonian Themed Player Home",
  "summary": "A cave home with an underwater entrance, created to help add immersion for the often overlooked Argonian race",
  "descriptionHtml": "Marsh-Rest is a player home created to help add immersion for the often overlooked Argonian race, hailing from marshlands and boasting the ability to breathe underwater. \r<br />\r<br />The home is a cave with an underwater entrance located at the end of the river to the East of Morthal. It has a sort of bandit cave/mine aesthetic and aims for a vanilla Skyrim appearance... sort of like the cave has been there all along and you just haven&#39;t noticed it yet. \r<br />\r<br />All crafting furniture is included, with the exception of a smelter... because how on earth would one transport and install a huge smelter in an underwater cave? \r<br />\r<br />Other amenities include two mannequins, several weapon racks, and a generous amount of book shelf space. All containers in the home are set to not respawn, so you will never lose any items regardless of where you choose to store them&#33;\r<br />\r<br />There is also a small statue of a Hist tree, which can be activated like a shrine to receive some minor stat boosts.\r<br />\r<br />Please inform me of any small bugs that I may have overlooked, and I will quickly update the file so play is as smooth as possible. I&#39;m also open to any suggestions on how this home could be improved&#33;\r<br />\r<br />Special thanks to VailXX for coming up with the idea of an underwater Argonian home.",
  "categoryId": "67",
  "version": "1.01",
  "author": "Konrann",
  "createdUnix": "1390191727",
  "updatedUnix": "1390194336",
  "containsAdultContent": false,
  "uploadedBy": "Konrann",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092307",
      "name": "Marsh-Rest Player Home",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "221",
      "fileName": "Marsh-Rest Player Home-50111-1-01.zip",
      "uploadedUnix": "1390194336",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/bea64fc2e213a1e8e37c6d9d44d98a42a854960d07cc1a98147ffb29654b71c1/analysis/1407893553/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marsh-Rest%20Player%20Home-50111-1-01.zip?fid=1000092307&ttl=1535831640&ri=8192&rs=8192&setec=c46e97f9a3c47634f9ba67f2a159b723"
    }
  ]
}