{
  "modId": 50117.0,
  "modName": "Complete Crafting Vil",
  "summary": "Completely overhauls crafting recipes for consistency, and adjusts the weight and value of raw materials to have some relation to the finished item. Recipes for various faction items added, dependent on membership in the faction. Leveled items can be upgraded to match your current level. Incomplete sets (e.g. Elven Gilded) completed.",
  "descriptionHtml": "[b]OVERVIEW[/b]\r<br />I found myself dissatisfied with both the original [url=http://www.nexusmods.com/skyrim/mods/8003/?]Complete Crafting Overhaul[/url] (out of date) and the newer [url=http://www.nexusmods.com/skyrim/mods/49791/?]Complete Crafting Overhaul Remade[/url] (see bottom for comparison), so I&#39;ve created my own lightweight mod that addresses many of the same issues. The highlights:\r<br />[list]\r<br />[*]weapon and armor recipes have been modified for consistency across materials\r<br />[*]ore and ingot weights have been increased, and values adjusted\r<br />[*]leveled items can be upgraded to match your current level\r<br />[*]faction items can be crafted by faction members or after certain quests\r<br />[*]incomplete sets (Elven Gilded armor, Skyforge Steel weapons) have been completed\r<br />[/list]\r<br />I strongly recommend the use of the excellent [url=http://www.nexusmods.com/skyrim/mods/43053/?]Clothing and Clutter Fixes[/url], [url=http://www.nexusmods.com/skyrim/mods/33959/?]Smithing Perks Overhaul Remade[/url], and [url=http://www.nexusmods.com/skyrim/mods/34093/?]Weapon and Armor Fixes Remade[/url], all by the amazing kryptopyr. With the exception of ores and ingots, I have avoided any alterations made by these mods to maintain compatibility. While not strictly required, they will substantially enhance the functionality of the items made available by this mod.\r<br />\r<br />\r<br />[b]SMITHING RECIPES[/b]\r<br />Weapon and armor recipes are (mostly) standardized across materials; for example, most cuirasses require 5 ingots of a primary material, 3 ingots of a secondary material, 2 leather, and 4 leather strips, while most swords require 2 ingots of a primary material, 1 ingot of a secondary material, and 1 leather strips. Numerous changes have been made to material requirements:\r<br />[list]\r<br />[*]Leather: uses steel as its secondary component and requires Steel Smithing, as it is the light armor equivalent to steel in quality\r<br />[*]Dwarven: no longer requires steel\r<br />[*]Nordic: uses orichalcum as its secondary component instead of quicksilver, and is tempered with orichalcum\r<br />[*]Ebony: uses silver as its secondary component\r<br />[*]Glass: uses corundum as its secondary component instead of moonstone\r<br />[*]Stalhrim: light armor uses quicksilver as a secondary component instead of ebony\r<br />[/list]\r<br />Recipes are added for circlets, faction equipment, and other previously unavailable items. Faction gear is quest-locked, generally requiring that you join the appropriate faction. Temper recipes are also added for a handful of items that aren&#39;t included in the Unofficial Patches.\r<br />\r<br />A full set of elven gilded armor, the missing Skyforge steel weapons, and unenchanted sets of Dark Brotherhood and Thieves Guildmaster armors are added. These items can only be acquired by smithing. Their stats are based on the changes made by WAF-R, but are quite close to vanilla values.\r<br />\r<br />Leveled items can be upgraded at the forge by combination with a soul gem. Note that they will have to be re-tempered after the upgrade.\r<br />\r<br />\r<br />[b]RAW MATERIALS[/b]\r<br />Ore and ingots have been made substantially heavier, with ore weights ranging from 5 to 10 and ingot weights from 2 to 8. The most valuable materials (ebony, gold, and malachite) require 3 ore to make 1 ingot, while iron only requires a single iron ore, and steel requires charcoal instead of corundum, which can be made from firewood at the smelter. Their values have been adjusted as well, such that each stage of crafting should usually increase the value of the item and decrease its weight. There are exceptions (jewelry crafting is terribly uneconomical) but without editing the items themselves I&#39;ve done the best I could. \r<br />\r<br />For convenience, I&#39;ve added some recipes to the smelting and tanning menus. Leather strips can now be manufactured directly from pelts, and both dwemer scrap metal and bent dwemer scrap metal can be refined into dwemer ingots (you&#39;ll need a lot of it, though&#33;). Thieves Guild members can also craft lockpicks from iron ingots at the smelter.\r<br />\r<br />\r<br />[b]WHY USE THIS MOD OVER COMPLETE CRAFTING REMADE?[/b]\r<br />There are three main differences between this mod and CCO Remade. First, this mod includes a number of minor balance changes, such as the requirement of Steel Smithing to craft leather armors. Second, this mod leaves out many of the secondary features of CCO-R such as variable mining speeds, gemstone variations, and equipment mods not directly related to crafting. Finally, the formulas I&#39;ve used for the weapons and armor are simply different. If my changes aren&#39;t to your taste or you want the extra features of CCO-R, then I recommend you use it rather than my version.\r<br />\r<br />\r<br />[b]SKYRE PATCH[/b]\r<br />I&#39;ve added a patch for users of t3nd0s&#39;s [url=http://www.nexusmods.com/skyrim/mods/9286/?]Skyrim Redone[/url] in the latest version. For now, it only rectifies direct conflicts: perk requirements for melting down dwarven metal, jewelry recipes, and a handful of miscellaneous weapon and armor recipes. A later version will adjust all of the SkyRe recipes for better agreement with my modifications.",
  "categoryId": "24",
  "version": "1.1",
  "author": "Vil-hatarn",
  "createdUnix": "1391435698",
  "updatedUnix": "1394378153",
  "containsAdultContent": false,
  "uploadedBy": "Vilhatarn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095055",
      "name": "Complete Crafting Vil",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24",
      "fileName": "Complete Crafting Vil-50117-1-0.7z",
      "uploadedUnix": "1391435393",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e56b8fac1cd9b1c7da9ab7f386a2bbf1e015edd5f3888c1ad7c364408d8c9ee5/analysis/1407916270/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Complete%20Crafting%20Vil-50117-1-0.7z?fid=1000095055&ttl=1535831649&ri=8192&rs=8192&setec=827ca26c65fe991bd27bef90976fc343"
    },
    {
      "fileId": "1000100497",
      "name": "Complete Crafting Vil",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26",
      "fileName": "Complete Crafting Vil-50117-1-1.7z",
      "uploadedUnix": "1394378153",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/62c3d565cf86a96fa23d2470a37d32a0398c4d50d371a7bd3d6a190d4a60856a/analysis/1407974078/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Complete%20Crafting%20Vil-50117-1-1.7z?fid=1000100497&ttl=1535831650&ri=8192&rs=8192&setec=ffdc191404ac48c2a1443489d22c0ae9"
    }
  ]
}