{
  "modId": 50121.0,
  "modName": "Marriage Mod - To Have And To Hold",
  "summary": "This mod is designed to enhance the current marriage system in Skyrim; specifically the Wedding Scene at the Temple of Mara, fix various marriage related bugs, add mechanics to remarry and allow multiple spouses.",
  "descriptionHtml": "Firstly NOT MY MOD. All credit goes to joeThinkStudios. Great modder, great mod. Just making it more available. I do have permission&#33;&#33;&#33; I&#39;m not maintaining, updating or doing anything to it. \r<br />\r<br />There is a hearthfire patch on the steam workshop for this mod. The mod works fine for me and some others without the patch, while having hearthfire installed though. It seems to vary from user to user...  you can give it a shot without but its probably best if you have the patch installed\r<br />\r<br />If you want it, it can be found here &gt; http://steamcommunity.com/sharedfiles/filedetails/?id=153407826   \r<br />&lt;note&gt; I can&#39;t put it in optional files because the author of the patch hasn&#39;t given me permission. Sorry\r<br />\r<br />Compatible with \r<br />AFT, UFO, Spouses Can Live Anywhere, \r<br />\r<br />This mod is designed to enhance the current marriage system in Skyrim; specifically the Wedding Scene at the Temple of Mara, fix various marriage related bugs, and add mechanics to remarry. The idea of this mod, is to bring the Dragonborn and their Spouse more close together and have a much more robust and interactive experience within the marriage system. Considered an overhaul of the marriage system in Skyrim; this mod will likely conflict with any other Mods that make changes to the Temple of Mara within Riften or “The Bonds of Matrimony” Quest as well, but should be Follower Mod friendly. \r<br />\r<br />--Feature Summary— \r<br />1.) Marriage to a new spouse via death or Intentional divorce of old spouse. \r<br />2.) Fixes to the wedding ceremony and a reception afterwards with dynamic events depending on the Dragonborn’s completion of specific quests; Tending the Flames, Blindsighted, The Eye of Magnus, and Glory of the Dead. \r<br />3.) Three sub quests, which help aid the Dragonborn during the marriage events. \r<br />4.) A basic version of the “Dress Up” feature allows the Dragonborn to ask their spouse to change the default outfit they have on (the one under the equipped armor) to one of a hand-full of predetermined outfits. \r<br />5.) Fixes to various NPCs related in part to Marriage. \r<br />6.) The Dragonborn may now marry multiple spouses (to a Maximum of 11) with the help of the Aspect of Love. One can also easily locate each of their spouses with the aid of a new book, titled “Mara’s Tear”, which details each spouse’s location. \r<br />7.) The Dragonborn’s spouse(s) can now move to one of the four faction homes depending on completion of their respective Questlines. \r<br />\r<br />\r<br />--A more detailed Feature List can be found at the link below:-- \r<br />https://docs.google.com/document/d/11LwIbzMnXxqby623u4d-r-H5gK8QTq1dReSGa5LkZck/edit \r<br />\r<br />--Update History (Change Log) & Currently Known Bugs:-- \r<br />https://docs.google.com/document/d/1gHO0NsTfe7ZIo6ZjAfqBRLudTCusRq4_6MLZ1sUrx8k/edit \r<br />\r<br />--Frequently Asked Questions and Troubleshooting Guide-- \r<br />https://docs.google.com/document/d/1nn73gFX1sgnJD7SU-T9pGRKgcomeCKayblZE1Ccy2q8/edit \r<br />\r<br />As with any mod that is an overhall, like this one; it is recommended to perform a hard save in Skyrim before you begin using it. The hard save will give you something to fall back on in worse-case scenarios. \r<br />\r<br />--Special Thanks&#33;-- \r<br />joeThinkStudios for making the mod\r<br />foop - for helping beta test the mod and choosing not to remain anonymous. \r<br />AprilDraven - for making an awesome marriage mod logo for this mod. \r<br />Bakufu001 - for reviewing the mod in the video above. \r<br />Bethesda - for making such a masterpiece of a game. \r<br />You - for taking the time to read this&#33; \r<br />\r<br />\r<br />Visit joeThinkStudio&#39;s steam workshop\r<br />              -----&gt; http://steamcommunity.com/sharedfiles/filedetails/?id=11579\r<br />\r<br />Works on the latest version. Enjoy\r<br />",
  "categoryId": "33",
  "version": "1.9.32.0.8",
  "author": "joeThinkStudios",
  "createdUnix": "1390211479",
  "updatedUnix": "1390211361",
  "containsAdultContent": false,
  "uploadedBy": "Marty114",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092339",
      "name": "Marriage Mod - To Have And To Hold",
      "version": "1.9.32.0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18841",
      "fileName": "Marriage Mod - To Have And To Hold-50121-1-9-32-0-8.rar",
      "uploadedUnix": "1390211361",
      "modVersion": "1.9.32.0.8",
      "virusScanUrl": "https://www.virustotal.com/file/2a07686b1ed317247dc6fd474dc47a3dec7078bacbdc0f1f8a07298147ea04b6/analysis/1407893651/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marriage%20Mod%20-%20To%20Have%20And%20To%20Hold-50121-1-9-32-0-8.rar?fid=1000092339&ttl=1535831656&ri=8192&rs=8192&setec=b7a3403d559e8a596bcff8e0adcce672"
    }
  ]
}