{
  "modId": 50151.0,
  "modName": "Full blacksmith equipment in every town",
  "summary": "You always wanted to smelt down ore while stumbling around Solitude? You tried to improve your new daedric armor, but Dawnstar lacks a working bench? No more unnecessary loadingscreens&#33;",
  "descriptionHtml": "Who doesn&#39;t know that situation: You want to sell some picked up junk on your way through the world and remember something terribad; Morthal lacks a blacksmith AND a general goods store&#33; \r<br />\r<br />FEAR NOT MY DEAR FRIENDS,\r<br />\r<br />because this little file adds a lot of missing blacksmith equipment to the towns of Skyrim, making a blacksmiths life even more comfortable.\r<br />\r<br />\r<br />Content:\r<br />+ a smelter in Solitude. It&#39;s right in front of the forge, directly under the chimney.\r<br />+ a smelter in Falkreath. Search near behind the blacksmiths house.\r<br />+ a smelter in Riften. You&#39;ll find it in Balimunds basement.\r<br />+ a working bench in Dawnstar. Located right beneath the forge.\r<br />+ an entire forge, including a whetstone, working bench, smelter and Blacksmith for Morthal. His name is Bern Adaman and he&#39;s even selling items to you. You&#39;ll find it next to Falions House, under the open roof, similar to dawnstar.\r<br />\r<br />I left out Winterhold for now, since a working blacksmith would overshadow the &#34;city&#39;s&#34; miserable condition.\r<br />\r<br />Compability:\r<br />Obvious incompability with other town overhauls. Also, try loading it after any civil war overhauls, since a few spawnpoints had to be moved a few meters.\r<br />\r<br />Bugs:\r<br />The Blacksmith might has a hard time walking past the forge, since he keeps walking into the water cooler. \r<br />\r<br />Installation:\r<br />Unzip it into the Skyrim folder (not Skyrimdata) or use the mod manager.",
  "categoryId": "53",
  "version": "1.0",
  "author": "BlueTobimon56",
  "createdUnix": "1390256603",
  "updatedUnix": "1390256598",
  "containsAdultContent": false,
  "uploadedBy": "BlueTobimon56",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092474",
      "name": "Townoverhaul",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "215",
      "fileName": "Townoverhaul-50151-1-0.7z",
      "uploadedUnix": "1390256598",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/964b91aec3f1f1f933ffdf20a6a0d9e12af036aeb0af80c85865e81f35ca8e88/analysis/1407894571/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Townoverhaul-50151-1-0.7z?fid=1000092474&ttl=1535831702&ri=8192&rs=8192&setec=c62e9df6e3e492e659a22c92e6c0b171"
    }
  ]
}