{
  "modId": 50150.0,
  "modName": "Blades armory",
  "summary": "Just another Blades armor n sword retex. Brighter sword, white scabbard and handle with red inlays, red samurai style armor.",
  "descriptionHtml": "NMM safe. Well...since I WROTE the description on how to make mods NMM safe MINE should be right?\r<br />\r<br />Many thanks to all who download, like and endorse this retex-remesh.\r<br />Pics are bright cause I dropped like 10 torches around the room to view.\r<br />\r<br />NEXUS EXCLUSIVE ONLY\r<br />\r<br />Just another Blades armor n sword retex. Brighter sword, white scabbard and handle with red inlays, red samurai style armor.  1024X DXT5 for easy downsizing if needed. I have NO way to take ingame pictures now so image uploads are open. Images are from grand daughters computer running on medium resolution.\r<br />\r<br />This is more of a sample of what someone with entirely tooooo much time on thier hands can do with an old Windows 2000 laptop computer. \r<br />\r<br />If you DON&#39;T want the samurai&#39;ish style armor just delete the Meshes-Armor-Blades folder.\r<br />If you want nearer to default HQ swords I suggest Kohdi&#39;s. His is also a darker blade.\r<br />Better Shaped Weapons Meshes safe. I didn&#39;t notice a difference.\r<br />\r<br />DOS Uninstaller is included.\r<br />\r<br />Mesh edits goto the guy who did the Samurai styled armor mesh.  Used it so long now I don&#39;t even know the mod number or author name.\r<br />\r<br />Sword retex is from various sources and just compiled by myself. There weren&#39;t many decent qual handle textures in white that I could use. White scabbard fully done by myself. Brighter blade and white handle edit by myself.\r<br />\r<br />Shield came from the blades HD mod but also...lost the author and number. All credit for the shield goes to him.  I even used this shield on my Whiterun companions hall outside.  Wish I could find a matching &#34;red&#34; to match the armor but it works.\r<br />\r<br />Armour retex is also from various sources.  Maps and Normals were all pretty much the same so I just grabbed one from each of the sources I had avail.   CABAL is used heavily in my retexes so his will be the final word in whether or not this edit stays up on Nexus.  If you really want super quality retextures try aMidianborn for the best.\r<br />\r<br />CREDITS:\r<br />I have NO idea WHY this is on the upload mod page and doesn&#39;t actually SHOW up so I&#39;ll just re-copy my post here...All credits go to Cabal, Hothtrooper, Langley02 and all of you other excellent modders and retexers out there who love and enjoy the game.",
  "categoryId": "36",
  "version": "1.0",
  "author": "Thorne67",
  "createdUnix": "1390258481",
  "updatedUnix": "1390261903",
  "containsAdultContent": false,
  "uploadedBy": "Thorne67",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092490",
      "name": "Blades Armory by Thorne",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14651",
      "fileName": "Blades Armory by Thorne-50150-1-0.rar",
      "uploadedUnix": "1390261903",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d97db3f4c30ad882b4d380ed9f7b8a2633fcff820d0ac9fca36b0c552d08c585/analysis/1407894698/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blades%20Armory%20by%20Thorne-50150-1-0.rar?fid=1000092490&ttl=1535831700&ri=8192&rs=8192&setec=eaa94f79904f8f425c1b4b36a7a7f0a3"
    }
  ]
}