{
  "modId": 50164.0,
  "modName": "Immolated Blade",
  "summary": "Adds a new craftable sword with a unique model that is engulfed in blue light similar to the style of Hopesfire&#39;s enchanted from Morrowind.",
  "descriptionHtml": "Adds a new craftable sword with a unique model that is engulfed in blue light similar to the style of Hopesfire&#39;s enchanted from Morrowind.\r<br />\r<br />I originally set out to recreate Hopesfire but as I kept learning more I decided just to go for a semi-unique design instead.  The sword itself is a heavily modified version of the normal Daedric sword model, made much longer with many changes to the blade, hilt and handle.\r<br />\r<br />The sword comes with a strong visual effect attached to it that keeps it constantly immolated with blue-green light.  This is part of the model and not an enchanted in itself -  you are free to enchant the sword however you&#39;d like.\r<br />\r<br />The Immolated Ebony Blade can be crafted under the Ebony category of the crafting list for the same materials as an ebony sword plus 1 void salt.  The stats of the sword itself are identical to that of a normal ebony sword and it can be tempered up to the same level.\r<br />\r<br />Installation:\r<br />\r<br />Just drop the textures and meshes into the folders as layed out in the zip file, turn the ESP on and you&#39;re good to go. \r<br />\r<br />Known Bugs:\r<br />\r<br />The only issue I&#39;m aware of is that if you lay the sword on the ground the magical effect around the blade will halt after a few moments. It doesn&#39;t cause any issues but can look sort of strange to see the effect stop in mid-animation while it&#39;s laying around.  ",
  "categoryId": "55",
  "version": "1",
  "author": "Senlur",
  "createdUnix": "1390284430",
  "updatedUnix": "1390284423",
  "containsAdultContent": false,
  "uploadedBy": "Senlur",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092517",
      "name": "Immolated Blade",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1098",
      "fileName": "Immolated Blade-50164-1.7z",
      "uploadedUnix": "1390284423",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/fe317debfa4c0cf07d1ddd7d6a9ec76868b6b5a8c66df9c3987a6ac30bc09ceb/analysis/1407895158/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immolated%20Blade-50164-1.7z?fid=1000092517&ttl=1535831723&ri=8192&rs=8192&setec=b8f96e399230cf7babe63bdad153e5b8"
    }
  ]
}