{
  "modId": 50161.0,
  "modName": "Dragon Armory",
  "summary": "Dragonbone, Dragonscale and weapons retex.",
  "descriptionHtml": "NEXUS EXCLUSIVE ONLY\r<br />\r<br />REQUIRES DAWNGUARD FOR ACCESS TO DRAGONBONE WEAPONS. Unless you have a mod that&#39;ll add em of course.\r<br />\r<br />CURRENTLY UNWORKING WITH DRAGONBONE EBONSTEEL MOD. \r<br />http://www.nexusmods.com/skyrim/mods/24941 by DREOGAN and high praise and credits goto that person. Their mod was the base for this one and if you really want excellent armor use theirs. This is just a simple texture replacer with pauldrons. Reason for THIS mod was the family wanted REPLACERS, which the ebonsteel mod wasn&#39;t unfortunately.\r<br />\r<br />If you want default without the pauldrons just remove DBONEARMS.ESP but I dunno which meshes are associated with that mod so I couldn&#39;t remove it. The ESP just adds pauldrons to the armor. No FORM IDs or anything so it&#39;s compatible with anything except the above as they have their own.\r<br />\r<br />Was also informed that the Ebonsteel mod is included in the new Immersive Armors 7 by Hoth and Eckss so if you CTD after installing that delete the ESP included with this.\r<br />\r<br />1024X DXT5 for easy downsizing if needed xcept for the pauldrons. Don&#39;t touch em.\r<br />\r<br />Just another Dragon bone and scale armor n Weaps retex. \r<br />If any modder feels that I am violating their work please post and I will remove this mod.\r<br />\r<br />Modified weapons from the white dragonbone weapons mod. \r<br />Modified Armours from the Dragonbone Ebonsteel mod.\r<br />Modified meshes I&#39;ve used for so long that I don&#39;t even have links but I&#39;ve edited the Dragonbone Male to have less of a skirt without clipping-see thru areas with vanilla. Grandkids say there&#39;s no clipping with FavouredSouls males.\r<br />Modified meshes Dragonscale to give women a &#34;bust.&#34; Been using those meshes so long dunno where they&#39;re from.\r<br />Weapon meshes, if any are from worldwide parties but texs are still default so Better Shaped Weapons mod will work fine. This might already be using those meshes.\r<br />DBONEARMS.ESP gives pauldrons to the dragonbone armorset. Unmodified and also at 2048x so if you can NOT use the full armorset try removing the ESP. Many many praises to the modded who created the pauldrons and all credit goes to them.  I just don&#39;t know which files to REMOVE to actually take thier mod out of this one and I apologize forthright. \r<br />\r<br />I have NO way to take ingame pictures now so image uploads are open. Images are from Great Grand daughters laptop on low qual/med qual in options.\r<br />\r<br />This is more of a sample of what someone with entirely tooooo much time on thier hands can do with an old Windows 2000 laptop computer.\r<br />\r<br />Uninstaller is included but be WARNED that the uninstaller wipes ONLY the files that were used in this retex:\r<br />Meshes Armor dragonbone\r<br />Meshes Armor dragonscale\r<br />Meshes DLC01 Weapons Dragonbone\r<br />Textures Armor dragonbone\r<br />Textures Armor dragonscale\r<br />Textures DLC01 Weapons Dragonbone\r<br />so if you have ANY other mods that ADDED OVER these files they&#39;ll get wiped out. I personally haven&#39;t run into any but hey...you never know. Running the uninstall BEFORE you uninstall thru NMM is tons quicker as it&#39;s DOS based.\r<br />\r<br />Mesh edits goto the person or people who originally made them and all credits and praise goto them but I&#39;ve used them so long now I don&#39;t even know the mod numbers or author names.\r<br />\r<br />Better Shaped Weapon meshes...I didn&#39;t really notice any difference so it should be compatible.\r<br />http://www.nexusmods.com/skyrim/mods/39870  Highly recommended.\r<br />\r<br />All retextures are from various sources and just compiled and re-edited by myself. Most of these came from Dragonbone Ebonsteel mod which you should really download for the great options is has. This is JUST a modified TEXTURE REPLACER for the default game. \r<br /> \r<br />CREDITS: Praise and credits goto ALL the excellent texture creators, mod creators and mesh editors out there who love the game enough to keep it alive and interesting. CABAL of Amidianborn is used heavily in my retexes and edits for his high quality belts, cloth textures, boot soles and so much more.",
  "categoryId": "36",
  "version": "1.0",
  "author": "Thorne67",
  "createdUnix": "1390283604",
  "updatedUnix": "1390332089",
  "containsAdultContent": false,
  "uploadedBy": "Thorne67",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092516",
      "name": "Dragon Armoury by Thorne",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "52834",
      "fileName": "Dragon Armoury by Thorne-50161-1-0.rar",
      "uploadedUnix": "1390283542",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1ed3cd8e388ce66e37ee440cda561f2ba39b8939fd956bce2a4d5bbc43bcd365/analysis/1407895156/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Armoury%20by%20Thorne-50161-1-0.rar?fid=1000092516&ttl=1535831719&ri=8192&rs=8192&setec=b6566100aba61c7645ea651a430696f3"
    },
    {
      "fileId": "1000092595",
      "name": "Bow File request with end Spikes removed",
      "version": "1.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1335",
      "fileName": "Bow File request with end Spikes removed-50161-1-5.rar",
      "uploadedUnix": "1390332089",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/660a6b7b5fd27ebac5eab0a1030497cdc3f699c98f5c12fa36ce37e92c6c0e6c/analysis/1407895872/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bow%20File%20request%20with%20end%20Spikes%20removed-50161-1-5.rar?fid=1000092595&ttl=1535831719&ri=8192&rs=8192&setec=510ad744bf156fb469c9382ad445eb9f"
    }
  ]
}