{
  "modId": 50196.0,
  "modName": "Fort Rivermount",
  "summary": "An estate formerly belonging to a member of the Elder Council.",
  "descriptionHtml": "Situated on a ridge north of Nilheim and northeast of Ivarstead, a fort renovated by a member of the Elder Council and historian of Daedra worship lies next to the powerful waterfalls of the Rift. His studies with the Greybeards have gifted him with visions of the return of the Dragonborn, and has set aside his estate for their arrival. \r<br />\r<br />This castle gifts your player with many things from the expansions, a luxurious home that makes a fine base of operations for your Dragonborn, leaned towards more of the nobility. It comes with plenty of storage, places for your armor and weapons, a Housecarl and hound. Fine place for a spouse but no room for children yet -- I&#39;ve still not gotten the hang of the Hearthfire codes -- but there is a mod floating around here to have your children move in with you anywhere I&#39;m sure. This was an experiment to cater to my own personal Dragonborn, and I hope you enjoy it too. \r<br />\r<br />Requires all three expansions, uses only in-game data. Eroven Haven, a lovely player home, seems to be incompatible with this mod&#39;s real-estate.\r<br />",
  "categoryId": "68",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1390351884",
  "updatedUnix": "1390351874",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092640",
      "name": "Fort Rivermount",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "181",
      "fileName": "Fort Rivermount-50196-1-0.zip",
      "uploadedUnix": "1390351874",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1c7d0ea7d434e9708570000edba72b388c0156a7f6616e46b4b6afa1ad84879d/analysis/1407916640/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fort%20Rivermount-50196-1-0.zip?fid=1000092640&ttl=1535831757&ri=8192&rs=8192&setec=11ef3847bbf136ef71a1c7beba24fae4"
    }
  ]
}