{
  "modId": 50195.0,
  "modName": "Amirah the Redguard Princess Follower",
  "summary": "Adds a Redguard Female Companion to your game. ",
  "descriptionHtml": "There are rumors that some political changes in Hammerfell has turn into bloody conflict. The whole nobel families has been killed by conspirators, assassins and rebels. Some of the survivors has left Hammerfell and escaped into other provinces. One of the fugitives is Amirah - the princess of the noble House Adar. She is taking refuge at Skyrim wilds, but she is not safe&#33; Redguards mercenaries are tracking her. Will you help her to fight dangerous mercs?\r<br />\r<br />This mod adds a young redguard princess follower into Skyrim. She can be found at her refuge (marked on map) near Sky Haven Temple. She is with two of her Khajiit servants but it is not enough to fight with armed and deadly Redguard warriors. After killing merc, Amirah will offer you some gold as a reward. Also you can travel with her just after meeting.\r<br />\r<br />Amirah is spellsword classed. She is essential (immortal) and vanilla, so you don&#39;t need any other mods to make it work. She can be married but try to avoid friendly-fire with her.\r<br />\r<br />NOTE: If you will approach any issues and bugs with this mod, let me know by writing a comment\r<br />Remember to copy all files into your Skyrim directory (textures and meshes are very important)\r<br />\r<br />If you have got any ideas about this mod: share it.\r<br />If you like my mod and want to be informed about new versions and fixes: endorse/track it.\r<br />Check also my other mods&#33;\r<br />\r<br />Thanks for downloading. Enjoy&#33; : )\r<br />\r<br />\r<br />\r<br />",
  "categoryId": "96",
  "version": "1.0",
  "author": "chujec",
  "createdUnix": "1390347319",
  "updatedUnix": "1390347310",
  "containsAdultContent": false,
  "uploadedBy": "chujec",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092632",
      "name": "Amirah Redguard Princess Follower v-1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1056",
      "fileName": "Amirah Redguard Princess Follower v-1-50195-1-0.rar",
      "uploadedUnix": "1390347310",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1b8c5246f7b42ad80b67cad6a7b55159018c0a17124e535bc93db0bf7bde0e8a/analysis/1407896167/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Amirah%20Redguard%20Princess%20Follower%20v-1-50195-1-0.rar?fid=1000092632&ttl=1535831756&ri=8192&rs=8192&setec=cda8a423f93e58dcb5fb60d043d7084f"
    }
  ]
}