{
  "modId": 50208.0,
  "modName": "Gandalfs Staff with Special Enchantment",
  "summary": "Gandalf&#39;s Staff - Model by  Quechus9  - Especial Effects by Me - Special & Unique Enchantment - Take a look&#33; If you like Wabbajack you&#39;d make good use of the Special Edition. I&#39;m telling, take a look... ",
  "descriptionHtml": "Inspired by LOTR and on a eager to create new mods I present this, the Gandalf&#39;s Staff. It&#39;s a custom staff (model by  Quechus9) which can be found (http://www.nexusmods.com/skyrim/mods/27790/?) here on nexusmods and the images up there as well, when I saw him at first time I said: &#34;Oh, cool. Gandalf&#39;s staff, what it does ?&#34;. Well, a candlelight, so I asked permission to edit the staff and here I&#39;m. I added a special enchantment that pushes the target away but not only that, there&#39;s a chance of a &#34;force explosion&#34; pushing a lot of targets in 50 ft range.\r<br />One more thing. I made a SPECIAL EDITION, this one requires SKSE, and adds to the enchantment the following:\r<br />A. There&#39;s a chance to instantly kill the target. \r<br />B. A Random spell is cast on the target.\r<br />You can think: &#34;Only that?&#34; and I must say, IF you ever thought that Wabbajacking someone is a mess it&#39;s because you didn&#39;t try this. IT&#39;S NOT MY FAULT IF YOU TYPE &#39;PSB&#39; ON CONSOLE AND TRY THIS (But it&#39;s funny as hell). Please look up that the staff isn&#39;t for intense battle purposes, if you&#39;re killing a rabbit or a wolf fine (the wolf only if you&#39;re not playing on Legendary difficulty level), otherwise you may make a mess xD. For real, give it a try, but caution while messing with the SKSE version. It can give some strange result if you have used &#39;psb&#39; or you are an Afraid of Akatosh&#39;s Light. May the ground fart as you pass.\r<br />There is only a know bug as far as I could see:\r<br />If you&#39;re using The Special Edition AND you&#39;re a vampire you can cast a vampire spell that is only possible in vampire mod, so you&#39;re be unable to access menus /I will try to fix this. \r<br />\r<br />Thank folks :) Soon I&#39;ll post a new mod to get this better, it&#39;s called Necromancy, a set of spells there are original, yes, you read right, and I think, personally that they make somehow it all funny. So this way I can fulfill the void that consumes me from inside.\r<br />\r<br />\r<br />I THINK THAT THERE WON&#39;T BE MANY PROBLEMS IF YOU USE BOTH FILES AT SAME TIME BUT THERE ARE NOT ANY WARRANTIES ABOUT IT. THIS SOFTWARE IS DISTRIBUTED &#34;AS IS&#34;. I&#39;M NOT RESPONSIBLE IF YOU OVERLOAD SOMETHING WITH SOMETHING THAT IS ANYTHING OR ANYTHING THAT IS SOMETHING. I hope you understand, get me some cookies and have a nice day. ",
  "categoryId": "55",
  "version": "0.1a",
  "author": "Kernnunnos",
  "createdUnix": "1390373357",
  "updatedUnix": "1390372956",
  "containsAdultContent": false,
  "uploadedBy": "Kernnunnos",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092672",
      "name": "Gandalfs Staff Traditional",
      "version": "0.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1574",
      "fileName": "Gandalfs Staff Traditional-50208-0-1a.rar",
      "uploadedUnix": "1390372831",
      "modVersion": "0.1a",
      "virusScanUrl": "https://www.virustotal.com/file/469f30f8c49ba0b1a01eea258c37bf7da7e7faf66fdafde612823da8016f77ff/analysis/1407896643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gandalfs%20Staff%20Traditional-50208-0-1a.rar?fid=1000092672&ttl=1535831772&ri=8192&rs=8192&setec=89b4561940aa10aedfc32c343b39d2ed"
    },
    {
      "fileId": "1000092674",
      "name": "Gandalfs Staff Special Version",
      "version": "0.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1574",
      "fileName": "Gandalfs Staff Special Version-50208-0-1a.rar",
      "uploadedUnix": "1390372956",
      "modVersion": "0.1a",
      "virusScanUrl": "https://www.virustotal.com/file/73d025a301044615fbcd91d238b7bf99d9431d2ea649f0fe9b860f9e4042dc26/analysis/1407896652/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gandalfs%20Staff%20Special%20Version-50208-0-1a.rar?fid=1000092674&ttl=1535831773&ri=8192&rs=8192&setec=5a2a65951fce040073fa88cc974363b5"
    }
  ]
}