{
  "modId": 50214.0,
  "modName": "Speed and Stability Guide for ENB",
  "summary": "This guide should fix many CTDs, bugs, and low FPS issues. Think of it like the penicillin shot of Skyrim.",
  "descriptionHtml": "[font=Georgia][center][size=6]Speed and Stability Guide for ENB[/size]\r<br />These processes will solve (many) CTDs, bugs, and low FPS issues.\r<br />I highly suggest reading the whole article. Pay attention to the notes in yellow.\r<br />I&#39;ve tried to keep it as brief as possible. Happy modding&#33;\r<br />\r<br />[size=4][color=red]Check out my [url=http://www.nexusmods.com/skyrim/mods/56894/?]Modding Beginner&#39;s Guide[/url]&#33;[/color][/size][/center][line]\r<br />[b][u]BACKUP EVERYTHING FIRST.[/u][/b]\r<br />Endorsements Welcome ;) The more people that see this, the less confused and upset users there&#39;ll be.\r<br />\r<br />Info below is courtesy of [url=http://enbdev.com/contact_en.htm]Boris Vorontsov[/url], [url=http://www.nexusmods.com/skyrim/users/6794116/?]keithinhanoi[/url] (endorsed), [url=http://www.nexusmods.com/skyrim/users/3155782/?]Sheson[/url] (endorsed), [url=http://www.nexusmods.com/skyrim/users/1632043/?]Mangaclub[/url] (endorsed), [url=http://www.nexusmods.com/skyrim/users/5755326/?]SkyrimTuner[/url] (endorsed), [url=http://www.nexusmods.com/skyrim/users/4425231/?]ewi65[/url] (endorsed), [url=http://www.nexusmods.com/skyrim/users/7030278/?]firemanaf[/url] (endorsed), [url=http://www.nexusmods.com/skyrim/users/3211380/?]artem1s[/url], [url=http://wiki.step-project.com/Main_Page]The STEP Project[/url], and [url=http://www.nexusmods.com/skyrim/users/4681482/?]adelinadragonborn[/url] (endorsed).\r<br />\r<br />\r<br />[line]\r<br />\r<br />[center][size=5]Fixing Your Vanilla Settings[/size]\r<br />This section of the guide will make sure that you&#39;ve got the optimal settings in your vanilla game to run an ENB.\r<br />Some of these settings are actually required by ENB to function properly.[/center]\r<br />[line]\r<br />1. Make sure that all of the required mods for your ENB are installed.\r<br />2. In your video driver&#39;s settings for TESV.exe, turn Antialiasing, Anisotropic Filtering, FXAA, and SSAO off or defaulted to Skyrim&#39;s settings. Turn on VSync. Mine is set to &#34;Adaptive.&#34;\r<br />3. Go to Steam/steamapps/common/Skyrim/enbseries and look for enbhelper.dll. If there isn&#39;t one, download ENB Helper from the downloads section, extract it, and add it.\r<br />[color=yellow]*This provides ENB with more info from the Skyrim engine to base its rendering off of. This is required for ENBSeries 0.250+.[/color]\r<br />4. MO users go to Mod Organizer/profiles/[your profile]/.\r<br />4. Everyone else go to Documents/My Games/Skyrim/.\r<br />5. Edit [url=http://pastebin.com/r0TNnPu1]these lines[/url] in your SkyrimPrefs.ini file.\r<br />[color=red]THESE CANNOT BE COPY AND PASTED. ONLY LINES THAT HAVE BEEN CHANGED ARE INCLUDED.[/color]\r<br />6. Download and install the Update.ini file from the downloads section of this guide.\r<br />7. Download and install [url=http://www.nexusmods.com/skyrim/mods/57353/?]Optimized Vanilla Textures[/url].\r<br />8. Download and install [url=http://www.nexusmods.com/skyrim/mods/4834/?]High Quality LODs[/url].\r<br />9. Download and install Particle Patch All-in-One and Subsurface Scattering Patch in the downloads section of this guide.[line]\r<br />\r<br />[center][size=5]Bug Fixing/Memory Management[/size]\r<br />This section of the guide will help sort, clean, and amend your mod list as well as optimize your memory usage.\r<br />[line]\r<br />[size=3]Sorting, Cleaning, and Emending your Mod List[/size][/center]\r<br />1. Download [url=http://loot.github.io/]LOOT[/url], [url=http://www.nexusmods.com/skyrim/mods/25859/?]TES5Edit[/url], [url=http://www.nexusmods.com/skyrim/mods/1840/?]Wrye Bash[/url], and [url=http://www.nexusmods.com/skyrim/mods/53045/?]Savegame script scalpel[/url].\r<br />[color=yellow]*If you use MO, you have to run these within MO. To do this, click on the gears icon in the toolbar. Select their respective .exe files as the binaries and enter the name of the program as the title. You can now run these programs like you would SKSE or Skyrim.[/color]\r<br />2. Run LOOT, select &#34;Sort Plugins,&#34; and click apply.\r<br />[color=yellow]*Norton thinks that LOOT is malicious. Check the most common problems for a solution.\r<br />*As of MO version 1.2.1, LOOT is integrated into the sort button.\r<br />*LOOT 0.6 requires Internet Explorer 11 to generate the reports. This requirement will go away with LOOT 0.7.[/color]\r<br />3. Go to the &#34;Details&#34; tab and check to see if LOOT recommends any mods be cleaned with TES5Edit. Do not close the results. You&#39;ll have to know the order of which ones need cleaning.\r<br />4. Run TES5Edit and leave all of your mods checked. Make sure that it doesn&#39;t have any errors loading them all.\r<br />[color=yellow]*If it does, you probably have a mod that you shouldn&#39;t be using. Find out which it is, get rid of it, and run LOOT again.[/color]\r<br />5. Close TES5Edit.\r<br />6. Run TES5Edit again and ONLY CHECK THE FIRST MOD IN THE LIST THAT LOOT SAYS NEEDS CLEANING.\r<br />[color=yellow]*Other mods will load with it. This is normal.[/color]\r<br />7. When it loads, right click the mod that needs cleaned and select &#34;Apply Filter for Cleaning.&#34;\r<br />8. Right click again and select &#34;Remove &#39;Identical to Master&#39; Records.&#34; (Yes, you&#39;re sure.)\r<br />9. Right click again and select &#34;Undelete and Disable References.&#34;\r<br />10. Close TES5Edit and save. (No, I didn&#39;t mess up the order on that. The save dialog pops up when you hit the close button.)\r<br />11. Repeat steps 6-10 for each mod that needs cleaning. DO NOT DO MORE THAN ONE MOD AT ONCE.\r<br />12. Re-run LOOT and check for any more tips other than Bash Tag suggestions. Obey all of them.\r<br />13. Run Wrye Bash and find &#34;Bashed Patch, 0.esp.&#34;\r<br />14. Right click on it and select &#34;Rebuild Patch...&#34;\r<br />15. Skip the step about disabling mods first.\r<br />16. Uncheck &#34;Merge Patches.&#34;\r<br />17. Click &#34;Build Patch&#34; and close Wrye Bash.\r<br />[color=yellow]*LOOT will still give you Bash Tag suggestions after this. Don&#39;t worry, what you did in Wrye Bash fixed these. LOOT just likes to keep these suggestions there.\r<br />*The following steps are only useful for those who have uninstalled a mod since they started playing their current character.[/color]\r<br />18. Play your current save and go to a boring basement somewhere by yourself. Yes, that includes dismissing your followers. Wait a while (in real life, not in game) and save the game.\r<br />19. Run Savegame script scalpel (PDTWrapper.exe) and click &#34;Select ESS.&#34;\r<br />20. Point PDTWrapper to your game save located at Documents/My Games/Skyrim/Saves. \r<br />21. MO users add your Mod Organizer/mods/ folder as an additional Data folder.\r<br />22.Click &#34;Load Papyrus Section.&#34;\r<br />23. Wait for the message &#34;Analysis Complete;&#34; then click &#34;Remove Unattached instances&#34; (yes, you&#39;re sure) followed by &#34;Remove Instances.&#34; Be sure to check &#34;Remove instances with undefined classes only&#34; before selecting &#34;Remove&#34; on the popup.\r<br />24. PDTWrapper will create a new save in your save folder named &#34;EDIT_[date and time].ess.&#34; Move your original save to wherever you keep your backup files and rename your EDIT_[date and time].ess to the name of your save i.e. &#34;Save 123 - Prisoner  Whiterun  12.34.56.ess.&#34;\r<br />25. Load up your cleaned game. Stay in the basement. Wait a few more seconds and save the game again.\r<br />26. Repeat steps 19-24. There should be a lot more instances to remove.\r<br />27. If your analysis says &#34;Scripts from the following resources still have active threads,&#34; (at the top of the analysis) keep a note of what mods they are. You have to decide whether it makes sense for these mods to be running scripts right now. If it doesn&#39;t, terminate them. They&#39;re probably stuck.\r<br />28. If one mod is spamming an unusually high number of threads, it&#39;s probably stuck or broken.\r<br />[color=yellow]*If this applies to you, uninstall the mod, save. Reinstall the mod, save. See how the number of active threads compares.\r<br />*If that mod is still running a ton of scripts, stop using the mod and bring it up to the mod author. They have some coding to do.\r<br />\r<br />*You&#39;ll have to repeat this section each time you add or remove a mod but you&#39;ll see a lot less CTDs and bugs.[/color][line]\r<br />[center][size=3]ENBoost Settings[/size]\r<br />The reason Skyrim has a 3.1GB RAM cap is because that&#39;s the RAM cap for all 32 bit programs.\r<br />ENBoost, which is included in ENB, uses some nifty tricks to get around this.[/center]\r<br />Set the following values in your enblocal.ini file in Steam/steamapps/common/Skyrim:\r<br />\r<br />\r<br />[PERFORMANCE]\r<br />SpeedHack=true\r<br />[color=gray]Turns ENBoost on.[/color]\r<br />EnableOcclusionCulling=true\r<br />[color=gray]Stops Skyrim from loading things that aren&#39;t in camera view.[/color]\r<br />[MEMORY]\r<br />ExpandSystemMemoryX64=true\r<br />[color=gray]Adds some cache space in Skyrim&#39;s memory for dynamically loaded stuff.[/color]\r<br />ReduceSystemMemoryUsage=true\r<br />[color=gray]Moves dynamic object geometry and texture loading to another program (enbhost.exe) so they don&#39;t contribute to the 3.1 cap.[/color]\r<br />DisableDriverMemoryManager=false [color=yellow]&lt;-- Setting to true will improve stability but reduce performance.[/color]\r<br />[color=gray]Decides whether to have your driver or ENB manage the memory of cached textures.[/color]\r<br />DisablePreloadToVRAM=false [color=yellow]&lt;-- Setting to true will decrease load times but cause stuttering.[/color]\r<br />[color=gray]Enables/Disables preloading objects/geometry into the VRAM.[/color]\r<br />EnableUnsafeMemoryHacks=false [color=yellow]&lt;-- Set to true if you have 4GB+ video card.[/color]\r<br />[color=gray]Overrides ReduceSystemMemoryUsage with better options for extreme users (requires ReduceSystemMemoryUsage=true)[/color]\r<br />ReservedMemorySizeMb=[color=red]XXX[/color] [color=yellow]&lt;-- Start with 128 and increase in increments of 128 as necessary until raising doesn&#39;t help with stuttering anymore.[/color]\r<br />[color=gray]Determines the amount of memory not to be used by ENBoost (and therefore used by Skyrim for dynamic resource loading). Any reserved memory will be copied into RAM. Therefore, you should set it high enough to be able to handle the dynamic resources but not any higher.[/color]\r<br />VideoMemorySizeMb=[color=red]XXXX[/color] [color=yellow]&lt;-- Setting to (RAM + VRAM - 2048) will take advantage of all of your available memory. Setting to (VRAM - 128) will prevent stuttering from processes being moved into/out of RAM. 1GB=1024.[/color]\r<br />[color=gray]Determines the total amount of memory that ENBoost can play with. ReservedMemorySizeMb is subtracted from this amount.[/color]\r<br />EnableCompression=true [color=yellow]&lt;-- False if you experience stuttering or use ENBSeries 0.246 or older.[/color]\r<br />AutodetectVideoMemorySize=false [color=yellow]&lt;-- Because it keeps guessing wrong.[/color]\r<br />[ENGINE]\r<br />ForceAnisotropicFiltering=true\r<br />MaxAnisotropy=16\r<br />EnableVSync=false [color=yellow]&lt;-- Your driver&#39;s VSync is better.[/color]\r<br />AddDisplaySuperSamplingResolutions=false\r<br />VSyncSkipNumFrames=0\r<br />[LIMITER]\r<br />WaitBusyRenderer=false [color=yellow]&lt;-- True if you experience stuttering and can take the FPS hit.[/color]\r<br />EnableFPSLimit=false[line]\r<br />[center][size=3]Skyrim Project Optimization[/size][/center]\r<br />Download and install [url=http://www.nexusmods.com/skyrim/mods/32505/?]Skyrim Project Optimization[/url] for more FPS indoors.\r<br />[color=yellow]*This can have a lot of incompatibilities with mods that modify buildings in major cities.[/color][line]\r<br />\r<br />[center][size=3]Decrease That Grass[/size][/center]\r<br />Download and install [url=http://www.nexusmods.com/skyrim/mods/58268/?]Decrease That Grass (with rocks and shrubs)[/url] for more FPS outdoors.[line]\r<br />\r<br />[center][size=5]Sheson&#39;s Memory Patch[/size]\r<br />A major source of CTDs/ILSs for modders is reaching the maximum memory allocation for Skyrim.\r<br />Skyrim tries to fix this by allocating another memory block; but usually it just crashes.\r<br />Sheson&#39;s memory patch actually fixes the issue by allocating more memory in the first place.\r<br />[line]\r<br />[size=3]SKSE/Memory Blocks Log[/size]\r<br />SKSE has integrated Sheson&#39;s memory patch into their framework but have it disabled by default. This is the form of the patch that we&#39;ll be using because you probably have mods that require SKSE anyway. If you don&#39;t, you will. In order to activate the patch in SKSE, we must use an ini file.[/center]\r<br />[color=red]*This will not work for pirates. Pirates will not receive any help in the forums or by PM.[/color]\r<br />1. Download and install [url=http://skse.silverlock.org/]SKSE 1.7.1[/url]\r<br />2. Go to Steam/steamapps/common/Skyrim/Data and see if you have a SKSE folder with an SKSE.ini file inside. If you do, add these values to SKSE.ini:\r<br />\r<br />[General]\r<br />ClearInvalidRegistrations=1\r<br />[Display]\r<br />iTintTextureResolution=2048\r<br />[Memory]\r<br />defaultHeapInitialAllocMB=768\r<br />scrapHeapSizeMB=256\r<br />\r<br />If you don&#39;t have an SKSE.ini file, download and install SKSE ini from the downloads section.\r<br />[color=yellow]*If you use MO and one of your mods supplies its own SKSE.ini file, it will overwrite this one. Add the aforementioned values to that mod&#39;s SKSE.ini file. You can find it in Mod Organizer/mods/(your mod)/SKSE/.[/color]\r<br />3. If you previously used SSME, delete d3dx9_42.dll and ssme.ini from your Steam/steamapps/common/Skyrim folder.\r<br />4. Delete [url=http://www.nexusmods.com/skyrim/mods/46465/?]Safety Load[/url] and [url=http://www.nexusmods.com/skyrim/mods/33526/?]ShowRaceMenu Precache Killer[/url] if you have them installed. They&#39;re not needed once the memory blocks are configured correctly.\r<br />5. Download and install [url=http://www.nexusmods.com/skyrim/mods/50471/?]Memory Blocks Log[/url].\r<br />6. Go to the Windhelm docks and pick a fight with a guard. This is pretty much the most memory intensive thing you could do and will max your usage.\r<br />7. NMM/Wrye users go to Skyrim/Data/SKSE/Plugins/.\r<br />7. MO users go to Mod Organizer/overwrite/SKSE/Plugins/.\r<br />8. Open up MemoryBlocksLog.log and check to see that the value directly under Block 1 is 512.\r<br />[color=yellow]*If it isn&#39;t, you&#39;ve installed SKSE wrong or your SKSE.ini is getting overwritten (MO users only).[/color]\r<br />9. Check the last number in the Block 1 column. We&#39;ll call this value Z.\r<br />10. In SKSE.ini, set defaultHeapInitialAllocMB to (Z + 276.) Do not set lower than 512.\r<br />[color=yellow]*MO users that downloaded SKSE ini, this will be in Mod Organizer/mods/SKSE ini/.[/color]\r<br />11. Fight that guard again and make sure that Block 1 is roughly 20 higher than your peak usage.\r<br />[color=yellow]*This value may need adjusted over time as you add more texture mods, NPCs, or increase your uGridsToLoad.[/color][line]\r<br />\r<br />[center][size=5]Optimizing Your Mod Textures[/size]\r<br />Optimizing your textures is a great way of getting some free FPS.\r<br />This process involves reducing your textures&#39; file sizes so that your GPU has less to load.\r<br />The file size is what&#39;s changing, not the dimensions of your textures (unless you want them to.)[line]\r<br />\r<br />There are three common tools which can be used to optimize your mods&#39; textures. The first two, [url=http://www.nexusmods.com/skyrim/mods/13529/?]Skyrim Mods Complex Organizer - SMCO[/url] and [url=http://www.nexusmods.com/skyrim/mods/12801/?]Optimizer Textures[/url], are basically the same. They&#39;re quick and easy to use, but will optimize all of your textures the same way. Face texture will get compressed/resized just as much as landscape textures. The third option,[url=http://www.nexusmods.com/skyrim/mods/5755/?]DDSopt[/url], is time consuming and tedious, but will optimize your textures at different levels based on the texture type. This will give the best looking result.\r<br />\r<br />[size=3]SMCO/Optimizer Textures[/size][/center]\r<br />\r<br />[b][u]NMM/Wrye Users[/u][/b]\r<br />1. Create a temporary folder full of your mods&#39; BSA files, Texture folders, and Meshes folders like you did for the Optimizing Your Vanilla Textures section. They can be found in Steam/steamapps/common/Skyrim/Data as well as the Textures and Meshes folders within the Data folder.\r<br />[color=yellow]*You should not optimize parallax files. If you know that your mod uses parallax, don&#39;t optimize it.[/color]\r<br />2. Run your optimizer of choice directed at this temporary folder and walk away. Make sure that the options to optimize BSA files are checked.\r<br />3. When it&#39;s done, replace the original files in your Data folder with the ones from the temporary folder. Backup the originals first in case you don&#39;t like the way the new ones look.\r<br />\r<br />[b][u]MO Users[/u][/b]\r<br />1. If you chose Optimizer Textures, download the Modified INI by Thorne67 in the optional downloads section of Optimizer Textures. Replace the Ordenador.ini with it.\r<br />2. Copy and paste all of the mods that you want optimized from Mod Organizer/mods into a temporary folder.\r<br />[color=yellow]*You should not optimize parallax files. If you know that your mod uses parallax, don&#39;t optimize it.[/color]\r<br />3. Direct SMCO or Optimizer Textures to this temporary folder.\r<br />4. If you chose SMCO, change the folder option &#34;skyrim root&#34; to &#34;standalone.&#34;\r<br />5. Run your optimizer of choice directed at this temporary folder and walk away. Make sure that the options to optimize BSA files are checked if you don&#39;t have MO setup to automatically extract BSA files.\r<br />6. When it&#39;s done, replace the original mods in Mod Organizer/mods with the ones from the temporary folder. Backup the originals first in case you don&#39;t like the way the new ones look.[line]\r<br />[center][size=3]DDSopt[/size][/center]\r<br />\r<br />1. Download and install [url=http://www.nexusmods.com/skyrim/mods/5755/?]DDSopt[/url] - pre-release - update 4.\r<br />2. Copy [url=http://wiki.step-project.com/Guide:DDSopt_%26_Texture_Overhauls/DDSoptINI]these lines of code[/url] and replace the contents of your DDSopt.ini with them.\r<br />3. Now here comes the tedious work. All of the textures you want to optimize need to be loose. If you use the BSA versions of texture mods, you&#39;ll have to extract them.\r<br />[color=yellow]*Mod Organizer users that have MO set to automatically extract BSA files, skip steps four through seven. Instead, rename the mods folder under Mod Organizer to &#34;Mod Extracted&#34;[/color]\r<br />4. Make a file directory that looks like this:\r<br />\r<br />Working\r<br />&gt;&gt;Mod Extracted\r<br />&gt;&gt;&gt;&gt;A folder for each mod you want to optimize. Examples Below\r<br />&gt;&gt;&gt;&gt;Skyrim HD 2K Textures\r<br />&gt;&gt;&gt;&gt;Serious HD Retexture Skyrim\r<br />&gt;&gt;&gt;&gt;Another mod you want optimized...\r<br />\r<br />5. Download and install [url=http://www.nexusmods.com/skyrim/mods/247/?]BSAopt[/url].\r<br />6. NMM/Wrye users go to Steam/steamapps/common/Skyrim/Data\r<br />6. MO users that aren&#39;t set to automatically extract BSAs go to Mod Organizer/mods/\r<br />7. Follow [url=http://wiki.step-project.com/Guide:BSA_Extraction_and_Optimization]this guide[/url] to extract each mod&#39;s BSA into their corresponding folders that you just made in the Mod Extracted folder.\r<br />8. Download and extract [url=http://wiki.step-project.com/images/d/d1/Batch_Files_for_DDSopt_guide_v2.77.7z]these batch files[/url] into the same folder that contains your Mods Extracted folder.\r<br />9. Run 4_Mod_Sorting_Pre-optimization_2.75.bat. It will make sure that &#34;Mod Extracted&#34; is in the same folder. Remember, all of your extracted mods should be in their own sub-folders in &#34;Mod Extracted&#34;\r<br />10. As it runs, hit any key when it tells you to and type &#34;Y&#34; when it asks. Don&#39;t exit out. It will close itself on the last prompt to hit another key to continue.\r<br />11. When it&#39;s done, a log.txt file will be made. Make sure that there are no errors that are level 4 or higher.\r<br />12. Along with &#34;Mod Extracted&#34; and your batch files, there should be new folders titled Mod Optimized, Mod Ordinary Textures, Mod Normal Maps, Mod Body Textures, Mod Exterior Textures, and Mod Exterior Normal Maps. Each of these folders should contain sub-folders named the same as the folders you made in Mod Optimized.\r<br />13. Start DDSopt and change the game to Skyrim in the &#34;Game&#34; tab.\r<br />14. Hit the &#34;Browse&#34; button next to &#34;.&#92;in,&#34; point it to Working/Mod Exterior Normal Maps/, and hit &#34;Use Folder.&#34;\r<br />15. Hit the &#34;Browse&#34; button next to &#34;.&#92;out,&#34; point it to Working/Mod Optimized/, and hit &#34;Use Folder.&#34;\r<br />16. In the &#34;Ignore&#34; menu, untick &#34;Copy unprocessed and ignored files (passthrough).&#34;\r<br />17. In the &#34;Constraints&#34; tab, change all of the file types to lossless and set both Resolution-limits to your preference.\r<br />Personally, I use these Resolution-limits:\r<br />\r<br />Mod Body Textures - 2048x2048\r<br />Mod Exterior Normal Maps - 1024x1024\r<br />Mod Exterior Textures - 1024x1024\r<br />Mod Normal Maps - 2048x2048\r<br />Mod Ordinary Textures - 2048x2048\r<br />\r<br />18. Tick &#34;Show Recursive&#34; in the &#34;Browser&#34; tab and hit &#34;Process.&#34;\r<br />19. Repeat steps 14-18 for each of these folders.\r<br />20. Run 5_Compress_Mods_7z_2.71.bat. Once again, don&#39;t exit out. It will close itself on the last prompt.\r<br />21. When it&#39;s finished, you should have a new folder titled &#34;Mod Optimized Archive.&#34; This folder contains your new optimized textures&#33; Move these .7z archives to wherever you put your manually downloaded mods. You can install these like any other mod.\r<br />[color=yellow]*Note: These archives contain loose files. Loose files will overwrite all BSA archives. Because of this, these optimized textures will overwrite all other mods that use BSA files. Even if those mods are later in the load order.[/color]\r<br />22. Mod Organizer users that renamed their &#34;mods&#34; folder to &#34;Mod Extracted&#34; should change it back at this point.\r<br />23. After your optimized texture .7z files have been moved, you can delete your &#34;Mod Whatever&#34; folders.\r<br />\r<br />[line]\r<br />\r<br />That&#39;s it&#33; You&#39;re done&#33; Enjoy your game. (But you should keep reading to see if you have any special circumstances that need accounted for)\r<br />\r<br />[center][img]http://replygif.net/i/1014.gif[/img]\r<br />\r<br />\r<br />[line]\r<br />\r<br />[size=5]Most Common Problems[/size][/center]\r<br />[line]\r<br />1. Optimus cards aren&#39;t recognized in ENB. Use the injector version of ENB to avoid this.\r<br />2. &#34;Why do I get sun reflections on the water? The sun is behind a mountain right now.&#34; - Sorry. It was the only way to get the sun to reflect in flat areas. If someone could make a mod that lets mountains cast shadows, that&#39;d be great.\r<br />[color=yellow]*Some users have reported that using the injector can fix this.[/color]\r<br />3. Some users have reported issues with SLI. Try turning it off if you&#39;re having issues.\r<br />4. MSI Afterburner/EVGA Precision/Rivatuner OSD need some tweaking to use shader mods. Look below to see what you have to do.\r<br />5. If you use [url=http://www.nexusmods.com/skyrim/mods/40706/?]OneTweak[/url], you have to set BWmode to 2 in OneTweak.ini. You can find it in Steam/steamapps/common/Skyrim/Data/SKSE/Plugins or Mod Organizer/mods/OneTweak/SKSE/Plugins if you&#39;re a MO user.\r<br />6. Sometimes Norton will prevent LOOT from downloading because of a &#34;suspicious.cloud.7.ep&#34; warning. Turn off &#34;Antivirus Auto Protect&#34; to fix it.\r<br />[color=yellow]&#34;But won&#39;t that give me all the viruses of teh internetz?&#34;[/color] - Yep. Probably. Do it.\r<br />7. &#34;My game keeps stuttering&#33;&#34; - Try turning on WaitBusyRenderer and turning off EnableCompression in your enblocal.ini.[line]\r<br />\r<br />[center][size=5]Injector Guide[/size]\r<br />The injector enables ENB features that would not work with your Optimus card or conflicting program.\r<br />It&#39;s basically a workaround for people who&#39;s wrapper won&#39;t function properly.[/center]\r<br />[line]\r<br />1. If you have d3d9.dll in your Steam/steamapps/common/Skyrim folder, delete it.\r<br />2. Extract the ENBSeries archive and move the the files from “Injector” to Steam/steamapps/common/Skyrim. DO NOT OVERWRITE WHEN ASKED.\r<br />3. Set the following values in enbinjector.ini:\r<br />\r<br />[LIBRARY]\r<br />LibraryName=enbseries.dll\r<br />[TARGETPROCESS]\r<br />ProcessName0=skse_loader.exe\r<br />ProcessName1=SkyrimLauncher.exe\r<br />ProcessName2=tesv.exe\r<br />\r<br />4. Run the ENBinjector.exe.\r<br />5. Start your game and enjoy&#33;\r<br />[color=yellow]*You have to run ENBinjector.exe before you start your game every time you play from now on. I suggest making a shortcut somewhere more accessible. If you still have some missing features, try setting ForceFakeVideoCard in enblocal.ini to true.[/color][line]\r<br />\r<br />[center][size=5]MSI Afterburner/EVGA Precision/\r<br />Rivatuner OSD Guide[/size]\r<br />Normally, these don&#39;t work with shader mods. Let&#39;s fix that.[/center]\r<br />[line]\r<br />The steps below are for MSI Afterburner but all 3 are based on the same program so the steps will be similar, if not identical. (thanks [url=http://www.nexusmods.com/skyrim/users/5755326/?]SkyrimTuner[/url])\r<br />\r<br />1. Update and start MSI Afterburner\r<br />2. Switch to the &#34;MSI On-Screen Display Server&#34; window.\r<br />3. Create a new profile for your game and change to it.\r<br />4. Click the big wrench icon to change advanced settings.\r<br />5. Go to General -&gt; Compatibility properties and turn on &#34;Enable compatibility with modified Direct3D runtime libraries&#34;.[/font]",
  "categoryId": "95",
  "version": "3.0",
  "author": "tony971",
  "createdUnix": "1390403222",
  "updatedUnix": "1412486508",
  "containsAdultContent": false,
  "uploadedBy": "tony971",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092729",
      "name": "Subsurface Scattering Patch",
      "version": "1.0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6158",
      "fileName": "Subsurface Scattering Patch-50214-1-0.zip",
      "uploadedUnix": "1390401934",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/e963dc767b83d15e730e080b981c44e6ac707002fe747c2e7d08245127d14832/analysis/1407897073/",
      "changelogHtml": " Added Particle Patch All-in-One - Patched to replace using old particle patches. <br/> \n Added SMCO as an option for texture optimization <br/> \n Added Skyrim Project Optimization as a suggested VRAM/FPS helping mod. <br/> \n Added ENB Helper as a suggested VRAM/FPS helping mod <br/> \n Added Stable uGridsToLoad as a suggested mod for those with higher uGridsToLoad <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Subsurface%20Scattering%20Patch-50214-1-0.zip?fid=1000092729&ttl=1535831778&ri=8192&rs=8192&setec=d9ae4f4c0d54dca77d40f0eec23dadb4"
    },
    {
      "fileId": "1000092906",
      "name": "ENB Helper",
      "version": "1.0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "33",
      "fileName": "ENB Helper-50214-1-0.zip",
      "uploadedUnix": "1390482998",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/01c9ce0227d767c66383f6854b216b088df7a66c452a4a5029159fa9415ed0ea/analysis/1407898169/",
      "changelogHtml": " Added Particle Patch All-in-One - Patched to replace using old particle patches. <br/> \n Added SMCO as an option for texture optimization <br/> \n Added Skyrim Project Optimization as a suggested VRAM/FPS helping mod. <br/> \n Added ENB Helper as a suggested VRAM/FPS helping mod <br/> \n Added Stable uGridsToLoad as a suggested mod for those with higher uGridsToLoad <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20Helper-50214-1-0.zip?fid=1000092906&ttl=1535831779&ri=8192&rs=8192&setec=e990cc5fdf52b800f9c404675c6304bf"
    },
    {
      "fileId": "1000094851",
      "name": "SKSE ini",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "SKSE ini-50214-1-2.rar",
      "uploadedUnix": "1391364061",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/c7b669cab422bf1014623ddda85426b4d486988e8706fb7540fefd81ad2558ce/analysis/1407914583/",
      "changelogHtml": " Added Memory Blocks Log as part of the memory patch guide. All memory patch users please read. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SKSE%20ini-50214-1-2.rar?fid=1000094851&ttl=1535831780&ri=8192&rs=8192&setec=553fc4c03b67ca13f906e3497e4d2b33"
    },
    {
      "fileId": "1000111933",
      "name": "Particle Patch All-in-One",
      "version": "2.2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7373",
      "fileName": "Particle Patch All-in-One-50214-2-2a.rar",
      "uploadedUnix": "1402021440",
      "modVersion": "2.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/84c5908c06323c49d58bf5aa4b87f7aea765e5584682299b7d57f04fff1f40b7/analysis/1408114180/",
      "changelogHtml": " Updated Savegame script scalpel instructions. <br/> \n Removed text images from guide. <br/> \n Updated Particle Patch All-in-One to latest version. <br/> \n Added recommended mod list as an article. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Particle%20Patch%20All-in-One-50214-2-2a.rar?fid=1000111933&ttl=1535831780&ri=8192&rs=8192&setec=10be789858ed7ae79cee070808ff7692"
    },
    {
      "fileId": "1000129666",
      "name": "Update ini",
      "version": "3.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Update ini-50214-3-0.7z",
      "uploadedUnix": "1412485648",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/740a7085049a6d839e22af30391507f3a4797684bcfc3a3a72d49749d2786261/analysis/1412485741/",
      "changelogHtml": " Changed settings recommendations. <br/> \n Added Decrease That Grass. <br/> \n Removed EWIs High SkyrimPrefs and inis. <br/> \n Minor updates reflecting tool updates. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20ini-50214-3-0.7z?fid=1000129666&ttl=1535831780&ri=8192&rs=8192&setec=09c07aa751a3e7a9ece20a9571a9630c"
    },
    {
      "fileId": "1000129669",
      "name": "ENB Preset Authors Pack",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10069",
      "fileName": "ENB Preset Authors Pack-50214-3-0.7z",
      "uploadedUnix": "1412486415",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/93436d3d4d92a95c1d653a6f89188cad749d0d31424480092b249a010ea7f0a2/analysis/1412486529/",
      "changelogHtml": " Changed settings recommendations. <br/> \n Added Decrease That Grass. <br/> \n Removed EWIs High SkyrimPrefs and inis. <br/> \n Minor updates reflecting tool updates. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20Preset%20Authors%20Pack-50214-3-0.7z?fid=1000129669&ttl=1535831781&ri=8192&rs=8192&setec=709831ee34ebdc926133e00c696354ca"
    },
    {
      "fileId": "1000129670",
      "name": "Speed and Stability Guide",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Speed and Stability Guide-50214-3-0.7z",
      "uploadedUnix": "1412486508",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/887e4b2eccbbac9e9d4aea05d7c39a6f5043690cdb50016511b7436b7688e950/analysis/1412486582/",
      "changelogHtml": " Changed settings recommendations. <br/> \n Added Decrease That Grass. <br/> \n Removed EWIs High SkyrimPrefs and inis. <br/> \n Minor updates reflecting tool updates. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Speed%20and%20Stability%20Guide-50214-3-0.7z?fid=1000129670&ttl=1535831781&ri=8192&rs=8192&setec=59ed5e5bce267d824a91009cbdbf911e"
    }
  ]
}