{
  "modId": 50221.0,
  "modName": "Skyrim exe - The Way It Should Have Been",
  "summary": "This is an attempt to fix the unpleasant experience it is working with Skyrim in a window. The project is simply called &#34;Skyrim.exe&#34; because it provides the experience one would have expected from this game but was left out. For example, you can launch &#34;Skyrim.exe&#34; to enter the game directly without the launcher&#33; ",
  "descriptionHtml": "[size=5]Skyrim.exe - The Way It Should Have Been[/size]\r<br />\r<br />[u][size=4]What is it?[/size][/u]\r<br />\r<br />This is an attempt to fix the unpleasant experience it is working with Skyrim in a window. The project is simply called &#34;Skyrim.exe&#34; because it provides the experience one would have expected from this game but was left out. For example, you can launch &#34;Skyrim.exe&#34; to enter the game directly without the launcher&#33; \r<br />\r<br />The motivation for this project was my interest in modding which required the frequent starting/stopping of Skyrim and interacting with it in a window which is very cumbersome using the window provided by Bethesda. The addition of this executable to your game folder is meant to provide a seamless experience. Just drop it in and go. \r<br />\r<br />An additional feature is the inclusion of a tool &#34;NoLauncher.exe&#34; which Skyrim.exe uses to run the game without displaying the launcher window. Using this program instead of Skyrim.exe will skip the launcher but will not provide any of the window modifications of Skyrim.exe. \r<br />\r<br />One side effect I&#39;ve noticed is that it is now possible to run multiple instances of Skyrim at the same time. However, I only realized this after I&#39;d finished and there are bugs. For example, if you have multiple instances open and you close one of them then they will ALL close. It is also possible that your cursor will disappear if they are not closed in the reverse order. Please note that multiple instances is NOT working with the latest 1.1 release. If you really want this functionality then use an older version. Unless you know what you&#39;re doing I strongly advise against running multiple instances&#33;&#33;\r<br />\r<br />[u][size=4]Features[/size][/u]\r<br />\r<br />[list][*]Resizable window from all corners\r<br />[*]Standard system menu (min/max/close)\r<br />[*]Standard &#34;Alt-Enter&#34; functionality to enter or exit full-screen\r<br />[*]Support for multiple monitors at arbitrary sizes and resolutions\r<br />[*]Support for upscaling lower resolutions to match the primary monitor or even spanned across multiple monitors\r<br />[*]Skip the Skyrim launcher to get right into the game\r<br />[*]The ability to alt-tab out of the game during loading screens (where it really matters&#33;)\r<br />[*]The game no longer pauses when focus is lost while in windowed mode\r<br />[*]Instant feedback when starting Skyrim by providing a fully-customizable splash screen\r<br />[*]The cursor is no longer gobbled up when hovering over the titlebar or anywhere else within the window\r<br />[*]Dragging the window around by its titlebar does not capture the cursor to the game window on mouse-up\r<br />[*]Guaranteed fix to ensure that the cursor is invisible when Skyrim is active and visible when it is not\r<br />[*]Perfect &#34;Alt-Tab&#34; functionality with smart detection of foreground window\r<br />[*]Force full-screen and windowed mode with alternate resolutions (native window 800x450 scaled to full-screen 1920x1080)\r<br />[*]High frame rate linear-interpolated downscaling to provide a high quality windowed experience\r<br />[*]Aspect ratio is preserved on window sizing from any side and at all corners\r<br />[*]Automatic letterboxing on maximize to preserve aspect ratio[/list]\r<br />\r<br />[u][size=4]Is SKSE supported?[/size][/u]\r<br />\r<br />SKSE compatibility is provided. When launching Skyrim.exe, it will load SKSE automatically via the skse_loader.exe if it is found.\r<br />\r<br />[u][size=4]Does this work with ENB?[/size][/u]\r<br />\r<br />I tested it with both the wrapper and injector and both work fine.\r<br />\r<br />[u][size=4]Can the splash image be changed?[/size][/u]\r<br />\r<br />The image used for the splash is fully customizable. Simply place a file with the name &#34;splash.png&#34; in the same directory as Skyrim.exe and it will be loaded automatically. \r<br />\r<br />[u][size=4]Installation[/size][/u]\r<br />\r<br />Simply drag and drop the contents of this zip file into your Skyrim directory and launch Skyrim.exe. That&#39;s it&#33; \r<br />\r<br />[u][size=4]Troubleshooting[/size][/u]\r<br />\r<br />[list][*]Why do I only see a black background while in windowed mode?[/list]\r<br />Windowed mode makes use of the Desktop Window Manager for compositing which requires Aero to be enabled. If you are using classic mode on Windows Vista or Windows 7 then it will not work. This means that, for the time being, Windows XP is not supported. For Windows XP or a non-Aero desktop, use version 1.0. \r<br />\r<br />[u][size=4]Disclaimer[/size][/u]\r<br />\r<br />This project utilizes native Win32 functionality to modify the Skyrim window experience at runtime and does not contain any code from Bethesda or the TESV.exe executable. It does not bypass Steam or any other DRM or copy protection. \r<br />",
  "categoryId": "39",
  "version": "1.1.5",
  "author": "Kahenraz",
  "createdUnix": "1390415840",
  "updatedUnix": "1390415840",
  "containsAdultContent": false,
  "uploadedBy": "Kahenraz",
  "primaryFile": null,
  "files": []
}