{
  "modId": 50235.0,
  "modName": "Chicken_Boom_v1_0",
  "summary": "Summonable exploding chicken spell and staff.",
  "descriptionHtml": "Chicken BOOM&#33; v1.0\r<br />by Joe Fenton\r<br />\r<br />Once upon a time, a crazy conjurer was kicked out of the College of\r<br />Winterhold due to his experiments in summoning chickens. He wandered\r<br />the land until he found a home with some less reputable warlocks in\r<br />an old Stormcloak fort. First he perfected his spell, and then made\r<br />a staff to compliment it. You will take the spell tome and staff from\r<br />his cold, lifeless body&#33;\r<br />\r<br />Notes: This mod has no scripts. I wanted it as simple and foolproof\r<br />as possible. This mod was made to be complemented by the Multiple\r<br />Summon mod (http://www.nexusmods.com/skyrim/mods/6093/?). Without it,\r<br />you are limited to one chicken, or two with the Twin Souls perk. While\r<br />not required, it&#39;s not nearly as fun without it. The spell will summon\r<br />one chicken at a time, while the staff will summon up to five at a time,\r<br />depending on your Conjuration level (with the Multiple Summons mod), or\r<br />whether or not you have the Twin Souls perk (without the Multiple\r<br />Summons mod).\r<br />\r<br />Install: Copy the esp to your Data directory and enable with the Mod\r<br />Manager.\r<br />\r<br />Uninstall: Disable the esp with the Mod Manager, then delete the esp\r<br />from your Data directory.\r<br />\r<br />License: Feel free to do what you like with it. While I wouldn&#39;t mind\r<br />a thank you, it isn&#39;t required.\r<br />\r<br />Changes:\r<br />2014-01-22: v1.0. Please post if you find any problems.\r<br />\r<br />\r<br />I was inspired by Explosive Chickens (www.nexusmods.com/skyrim/mods/17427/?)\r<br />and Tiny Angry Trolls (www.nexusmods.com/skyrim/mods/9004/?), but made\r<br />this completely from scratch. I duplicated the entry for the chickens\r<br />since I didn&#39;t want ALL chickens to explode, then duplicated the Conjure\r<br />Flame Atronach spell to make the Conjure Chicken spell. I also duplicated\r<br />the Conjure Flame Atronach spell tome and staff. A bit of editing and\r<br />Bob&#39;s your uncle&#33; Very simple stuff. Adding the Chicken Master to the\r<br />fort was the toughest part, and for that I thank my brother Mike for\r<br />his help in using the Creation Kit.\r<br />\r<br />\r<br />Extra Note on how you use this mod: You summon a chicken for 60 seconds like &#34;normal&#34; for summoned beings. Within that time, the chicken can explode if attacked. The chickens are set to unagressive, but foolhardy. So if they are left alone, they&#39;ll simply follow the player for 60 seconds. If there are any agressive enemies around, they will charge them and &#34;attack&#34;. Naturally, a chicken attack is nothing to worry about, but enemies will ALWAYS attack the chickens when attacked by the chickens. The chickens have no health to speak of, and no armor, of course, so one attack will kill the chicken. Being set as destructable objects, the chicken then goes BOOM&#33;&#33;&#33; If there are other chickens in range, the explosion will kill them, causing them to explode as well. So while one chicken won&#39;t kill anything more than a mudcrab (or similar level creature), several chickens all exploding together is rather effective. You can explode the chickens at any time by killing one yourself. For example, from a ledge above the enemy, summon the chickens among them, and if they don&#39;t attack, just shoot one with an arrow.\r<br />",
  "categoryId": "75",
  "version": "1.0",
  "author": "JL Fenton",
  "createdUnix": "1390445941",
  "updatedUnix": "1390445931",
  "containsAdultContent": false,
  "uploadedBy": "JLF65",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092848",
      "name": "Chicken_Boom_v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Chicken_Boom_v1_0-50235-1-0.7z",
      "uploadedUnix": "1390445931",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2ebc04ec1cb2028113b46454e795da4b01a6525e5ea62a37b2f48f12db1a6f06/analysis/1407897795/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chicken_Boom_v1_0-50235-1-0.7z?fid=1000092848&ttl=1535831810&ri=8192&rs=8192&setec=0c52daa1033ef998dbaeb5e5eb94e2d8"
    }
  ]
}