{
  "modId": 50244.0,
  "modName": "Skyrim Stability Guide",
  "summary": "A short guide to remove harmful tweaks and to recommend essential mods to actually fix most CTD and ILS issues.",
  "descriptionHtml": "[center][size=3][url=http://www.nexusmods.com/skyrim/mods/55921/?]Skyrim Graphics Guide[/url][/size][/center]\r<br />\r<br />Skyrim has been out for over two years now, and throughout that time we have had many INI tweaks revealed over time. Unfortunately, too many have been posted that can do far more harm than good. Most of this comes from inexperience or not knowing what these variables are meant to do. This guide is to simply remove some of these harmful settings. Many know these already, but many still don’t.\r<br />\r<br />This is a short guide, its two main goals are to make sure the core mods to fix Skyrim’s memory management are installed correctly, and to remove specific harmful tweaks to your system. There&#39;s also a section on cleaning the buggy Bethesda DLC files and a section with some tips when installing mods.\r<br />\r<br />I recommend testing the game after each mod, and each INI section, so if you have issues for whatever reason, you can narrow it down.\r<br />\r<br />[color=#ffcc33][size=3]If this guide helps you, please download and endorse to help more people fix their CTD issues.[/size][/color]\r<br />\r<br />[size=7]ESSENTIAL MODS[/size]\r<br />[color=#ffcc33][size=6]ENBoost[/size][/color]\r<br />Separates Skyrim’s Video RAM usage into a separate process with its own 64 bit memory allocation, allowing Skyrim to use focus its 3.1GB RAM limit on System RAM and thus allowing ENBoost to use virtually unlimited VRAM.\r<br />\r<br />It can be used without the ENBSeries graphical features (and works with MSAA (Anti-aliasing)). If you have installed an ENB Preset for graphical reasons, you already have these files and can modify the memory values as instructed below. ENBoost is part of the non-graphical core of ENBSeries.\r<br />\r<br />If you don&#39;t have the files, go to [url=http://enbdev.com/download_mod_tesskyrim.htm]http://enbdev.com/download_mod_tesskyrim.htm[/url]. Select the newest version from the list (usually at the top of it). Once selected, scroll to the bottom and click the Download button.\r<br />\r<br />Once downloaded, open the RAR and dump the entirety of the contents of the WrapperVersion folder into your Skyrim folder (if it fails, try the InjectorVersion as a last resort), and if all you want is ENBoost, only two lines have to be changed. Otherwise, configure ENBoost for your system. (Configuring it yourself (not using an existing file) is highly recommended)\r<br />\r<br />All ENBoost lines are in the [b]enblocal.ini[/b] file (use CTRL+F to find the lines below)\r<br />\r<br />[color=#ffcc33][size=3]For NO ENB Graphical features[/size][/color]\r<br />[size=2][font=Courier New]UsePatchSpeedhackWithoutGraphics=true (setting to true ends loading of all graphical effects, loads only game fixes + memory patch)\r<br />UseDefferedRendering=false (used for graphical effects, harms performance without them)[/font][/size]\r<br />\r<br />Changing UsePatchSpeedhackWithoutGraphics disabled the functions of the enbseries.ini file, and Anti-Aliasing techniques ENB offers, while everything else stays available for use. No Skyrim INI tweaks are needed when the graphical functions are disabled, nor is the helper mod needed.\r<br />\r<br />[color=#ffcc33][size=3]Memory Variables[/size][/color]\r<br />[size=2][font=Courier New]VideoMemorySizeMb= (set to your video memory (VRAM), minus the last two digits, so 2000 for 2GB, 1000 for 1GB, etc. Keep a small amount of memory free)\r<br />ReservedMemorySizeMb=64 (change to 128 as a baseline, increase to 512 as an experiment if experiencing stutter.)\r<br />ExpandSystemMemoryX64=true (set to false if you have a 32 bit Windows install.)\r<br />AutodetectVideoMemorySize=false (set to true if you don&#39;t want to worry about having the right value for VideoMemorySizeMb, highly recommended unless you disabled your pagefile. If you did (you&#39;ll know), set this to false and VideoMemorySizeMb to the size of your Video RAM in MB rounded to three zeroes. (2000, etc))[/font][/size]\r<br />\r<br />Quick side note about ReservedMemorySizeMb. In older versions of ENBoost, Boris had these at a high level. In later versions he optimized ENBoost to use much smaller amounts for this, and that&#39;s why by default it&#39;s at a low level (64).\r<br /> \r<br />If your suffering serious stuttering when walking as new objects/cells are loaded after installing this, the command that controls this is:\r<br />[size=2][font=Courier New]EnableCompression=true[/font][/size]\r<br />Set this to false to remove this stutter at the cost of less RAM compression (closer to pre-ENBoost levels), and increased risk of CTD with a memory hungry setup.\r<br />\r<br />[color=#ffcc33][size=3]Other variables[/size][/color]\r<br />An important variable you should change is:\r<br />[size=2][font=Courier New]EnableVSync=false (change to true)[/font][/size]\r<br />\r<br />[b]VSync will be disabled unless this is set to true.[/b] Additionally, ENB VSync has been claimed to help reduce the severity of the 1.9 lip sync bug. I highly recommend changing this to true.\r<br />\r<br />Now, quick warning, if you have driver (Nvidia/AMD) Anisotropic Filtering enabled, disable it, and use ENB Anisotropic Filtering, as ENB knows which textures should and shouldn&#39;t have linear filtering. Knowing this fixes many bugs from having it forced everywhere from the driver, especially with Parallax effects. Verify ENB Anisotropic Filtering is enabled by making sure the following lines in enblocal.ini match what&#39;s below:\r<br />[size=2][font=Courier New]ForceAnisotropicFiltering=true\r<br />MaxAnisotropy=16[/font][/size]\r<br />\r<br />If your underwater looks messed up post install for some reason, install the Underwater fix here [url=http://www.nexusmods.com/skyrim/mods/14007/]http://www.nexusmods.com/skyrim/mods/14007/[/url]\r<br />\r<br />[color=#ffcc33][size=6]Skyrim Memory Patch[/size][/color]\r<br />[b]SKSE IS REQUIRED[/b]\r<br />[b]ENBOOST IS HIGHLY RECOMMENDED[/b]\r<br />\r<br />Fixes your core ILS and CTD issues. The true fix for cell transition crashes, infinite loading screens, crashing when nearing Whiterun, etc. \r<br />\r<br />SKSE has included a function to enable the Memory Patch in SKSE 1.7+. There is a SKSE.ini file which applies these values in the File section, download through NMM or place this in your Skyrim/Data/SKSE folder. Then make sure TESV.exe and skse_loader.exe (both in your Skyrim folder) are running as Administrator (Right-click the EXE&#39;s, properties, compatibility tab, tick Run as Administrator, press OK).\r<br />\r<br />Skyrim Memory Patch is completely differently different to safety load. When Skyrim is loaded, it sets up two blocks of memory to use. Both are given 256MB. When the game fills up that primary block, it creates another 256MB block, and moves/places the memory there. The CTD&#39;s and ILS&#39;s are arising from the fact that the core 256MB block on PC fills up way to fast, and the game can&#39;t handle switching such core game data (cell data, etc.) to the second block, which causes the CTD/ILS.\r<br />\r<br />The Memory Patch changes that first block of memory Skyrim assigns to a 512MB block (double), which is more than enough for uGrids 19. The extreme majority of people who have used it have reported that their CTD&#39;s or ILS&#39;s have mostly ceased to exist, and they can walk through normally CTD heavy areas without the game flinching. I have verified this, as have many others, by setting the game speed to 10x speed (1000), and flying from somewhere like Riverwood to Solitude to Windhelm to Riften to Whiterun, and then the whole loop again, with no CTD. This is with the engine rapidly switching data and unloading/reloading game objects. \r<br />\r<br />[color=#ffcc33][size=3][b]Uninstall Safety Load if used[/b][/size], this replaces that.[/color]\r<br />\r<br />[b]Original source here:[/b] [url=http://enbdev.com/ctdfix.html]http://enbdev.com/ctdfix.html[/url]\r<br />\r<br />[color=#ffcc33][size=6]Skyrim Project Optimization[/size][/color]\r<br />A mod I highly recommend to improve performance in interiors by optimizing rendering, it will help keep CPU/GPU load down, possibly helping reduce crashes, all while providing a large free performance boost. [url=http://skyrim.nexusmods.com/downloads/file.php?id=32505]http://skyrim.nexusmods.com/downloads/file.php?id=32505[/url]\r<br />\r<br />If your using many mods which edit the interiors of houses (layout of the house, moving major objects), this may cause issues. Lighting Overhauls or minor changes (Unofficial Patches) work fine with it.\r<br />\r<br />\r<br />[size=7]HARMFUL TWEAK REMOVAL[/size]\r<br />If you have added/modified any of the variables below in your Skyrim.ini (in My Documents/My Games/Skyrim), I highly recommend you follow the next section, otherwise, enjoy a stable Skyrim :).\r<br />\r<br />If you don&#39;t have the lines in any of these sections, there is no need to add them. Removing them sets them to their default values.\r<br />\r<br />[color=#ffcc33][size=6]Papyrus (Skyrim.ini)[/size][/color]\r<br />First section is the most important. Papyrus, which is the scripting system Skyrim uses, is very fragile. The most popular tweak for it will overload it, and can hurt performance, and overwork the CPU.\r<br />\r<br />Replace anything you have here (in Skyrim.ini) with the default settings (vanilla master Skyrim.ini uses these numbers):\r<br />[size=2][font=Courier New][Papyrus]\r<br />fUpdateBudgetMS=1.2\r<br />fExtraTaskletBudgetMS=1.2\r<br />fPostLoadUpdateTimeMS=500.0\r<br />iMinMemoryPageSize=128\r<br />iMaxMemoryPageSize=512\r<br />iMaxAllocatedMemoryBytes=76800\r<br />bEnableLogging=0\r<br />bEnableTrace=0\r<br />bLoadDebugInformation=0\r<br />bEnableProfiling=0[/font][/size]\r<br />\r<br />Notice that the MS values is ~660x smaller than what some recommend (800)?  To put it simply, 60fps requires around 16.6ms max to be spent on rendering each frame. Allowing up to 800ms of CPU time to one task is not a good idea, it needs to share CPU time with other things. Also notice the small memory values. Setting these larger is not a good idea, just read the link below to know why.\r<br />\r<br />If you are running a script-heavy setup (you shouldn&#39;t be), and your scripts start to misbehave/perform badly, you could increase the fUpdateBudgetMS value in increments (to 1.6, then 2.0 at max). This will help prevent the additional time in fExtraTaskletBudgetMS being allocated to the CPU, instead adding a smaller amount to additionally always be allocated to the CPU. This will ensure all scripts have sufficient time to run.\r<br />\r<br />[color=#ffcc33]Explanation of these settings is here:[/color] [url=http://www.creationkit.com/INI_Settings_(Papyrus)]http://www.creationkit.com/INI_Settings_(Papyrus)[/url]\r<br />\r<br />[color=#ffcc33]Bethesda Developer confirming this:[/color] \r<br />[url=http://forums.bethsoft.com/topic/1487930-getting-a-lot-of-script-lag-going-over-10000-ms-sometimes/?p=23340131]http://forums.bethsoft.com/topic/1487930-getting-a-lot-of-script-lag-going-over-10000-ms-sometimes/?p=23340131[/url]\r<br />\r<br />[color=#ffcc33][size=6]General (Skyrim.ini)[/size][/color]\r<br />There are often changes to many variables here to apparently increase memory usage. These values should be left alone, especially the iPreloadSizeLimit variable, as this variable is actually related to the preloading of the intro video. Allocating 4GB to that is obviously going to mess with your game. The Skyrim Memory Patch and Stable uGridsToLoad are combined the true solution to uGridstoLoad crashing. Also, the uInterior Cell Buffer variable should not be changed, uGridstoLoad has no effect on it.\r<br />\r<br />[color=#ffcc33]Remove these lines if you have added them to your Skyrim.ini:[/color]\r<br />[size=2][font=Courier New][General]\r<br />iPreloadSizeLimit=\r<br />uInterior Cell Buffer=\r<br />fMasterFilePreLoadMB=[/font][/size]\r<br />\r<br />If you have this variable added, if your game is working well after the Skyrim Memory Patch try removing this variable, as it is by default 1000, (some recommend 99999+ for some reason). This may have helped in the past, but now the Memory Patch should have properly fixed it.\r<br />\r<br />[color=#ffcc33]Remove this line if you have added it to your Skyrim.ini:[/color]\r<br />[size=2][font=Courier New]iLargeIntRefCount=[/font][/size]\r<br />\r<br />The next variable is one many people will instantly ignore changing if you&#39;ve changed uGridsToLoad, but this variable in newer Skyrim patches is automatically changed by the engine depending on your current situation (including your uGridsToLoad variable). Changing it above its default is again not helping your game at all.\r<br />\r<br />[color=#ffcc33]Restore this back to 36 if you&#39;ve changed it.[/color]\r<br />[size=2][font=Courier New]uExterior Cell Buffer=36[/font][/size]\r<br />\r<br />I can confirm this variable doesn&#39;t need changing. uGridsToLoad=7, uExterior Cell Buffer=36, Speed at x10, Collisions off. Flying around the map at high speeds with cells loading/unloading. No CTD, works fine.\r<br />\r<br />[color=#ffcc33][size=3]Threading Changes[/size][/color]\r<br />Following is the DEFAULT settings Skyrim uses:\r<br />[size=2][font=Courier New]iNumHWThreads=4\r<br />iHWThread6=5\r<br />iHWThread5=5\r<br />iHWThread4=5\r<br />iHWThread3=4\r<br />iHWThread2=4\r<br />iHWThread1=4\r<br />iAIThread2HWThread=5\r<br />iAIThread1HWThread=3\r<br />iRenderingThread2HWThread=1\r<br />iRenderingThread1HWThread=0[/font][/size]\r<br />\r<br />Here&#39;s the simple truth. [b][color=#ffcc33]If you have 4 cores, or 2 cores, don&#39;t change this. Just don&#39;t. Remove it from your INI file if you have.[/color][/b]\r<br />\r<br />Skyrim by default uses 4 cores of your CPU ([size=2][font=Courier New]iNumHWThreads=4[/font][/size]). These cores/threads are each allocated to different tasks. The variables are perfectly set to leave room for different tasks by default. For example, notice the gap between Rendering and AI, there is one thread free. This is used for the audio thread. There is a gap between the AI threads too, used for 3 of the HWThread&#39;s. 5 is shared with AI Thread 2. This is a wildcard of sorts. This works for 4 cores, and should be left alone.\r<br />\r<br />If you have 8 cores however (Hyperthreaded too if you&#39;re brave), you have the option of moving the work of iHWThread4, 5 and 6 to a separate core from iAIThread2HWThread, and telling Skyrim that you have 8 cores, not 4.\r<br />\r<br />Add these if you have 8 cores.\r<br />[size=2][font=Courier New]iHWThread6=6\r<br />iHWThread5=6\r<br />iHWThread4=6\r<br />iNumHWThreads=8[/font][/size]\r<br />\r<br />[color=#ffcc33][size=3]uGridsToLoad[/size][/color]\r<br />Lets just leave it at this: If you really want to change this value, if you&#39;ve followed this guide correctly, just change it. There is no additional tweaking needed. No uExteriorCellBuffer change (engine auto-changes this), no messing with memory variables, no increasing the size of the memory patch values, just change it and launch.\r<br />\r<br />[color=#ffcc33]There are serious [b]risks[/b] when changing this variable.[/color] Papyrus (scripts) will become overloaded with work, and will eventually start performing badly. (uGridsToLoad 9+, 7+ on a script-heavy setup). The engine will be working harder rendering many objects will full detail (uGridsToLoad 9+). VRAM usage will begin to rise in large amounts (uGridsToLoad 7+). Quests with events that trigger on cell load will trigger before your close (uGridsToLoad 7+). Most importantly, your save will slowly become cluttered with more data slowly being stored in your save as more AI and objects in the distance update and change, and as quest scripts trigger and run (uGridsToLoad 7+)\r<br />\r<br />[color=#ffcc33]Change if you want a higher view distance with the risks above:[/color]\r<br />[size=2][font=Courier New]uGridsToLoad=5 (change to what you desire at your own risk, [b]use only odd numbers[/b])[/font][/size]\r<br />\r<br />[color=#ffcc33][b][size=2]Stable uGridsToLoad[/size][/b][/color]\r<br />[b]SKSE IS REQUIRED[/b]\r<br />This mod is recommended if you are serious about changing your uGrids value (which you shouldn&#39;t do). Will allow you to revert back if you wish to without issues. Don&#39;t bother if you&#39;re not changing it.\r<br />[url=http://www.nexusmods.com/skyrim/mods/41592/]http://www.nexusmods.com/skyrim/mods/41592/[/url]\r<br />\r<br />[color=#ffcc33][size=6]Havok (Skyrim.ini)[/size][/color]\r<br />Believe it or not, changing this value is not a good idea. Havok is set to 1 thread by default because there&#39;s only one thread to spare. Increasing this to 4 will cause Havok to share thread&#39;s with tasks like AI and Rendering, which will ultimately hurt your CPU more. Even with an 8 core CPU, just leave it to 1 thread. We don&#39;t know enough about Skyrim&#39;s thread allocation to be sure that it won&#39;t share the second thread with tasks like AI.\r<br />\r<br />[color=#ffcc33]Remove the following from your file if you&#39;ve added it.[/color]\r<br />[size=2][font=Courier New][HAVOK]\r<br />iNumThreads=[/font][/size]\r<br />\r<br />[color=#ffcc33][size=6]BudgetCaps (Skyrim.ini)[/size][/color]\r<br />I&#39;ll be short and direct. [color=#ffcc33]Remove this section from your INI file if you&#39;ve added it.[/color] There is no need to change these variables, there is no concrete evidence this helps anything, and a majority have people have had great success with the Skyrim Memory Patch without changing these variables. Please just remove this entire section from your file if you&#39;ve added it, you&#39;re likely increasing memory usage for no reason.\r<br />\r<br />\r<br />[size=7]DLC/UPDATE ESM CLEANING[/size]\r<br />The DLC .esm&#39;s and Update.esm&#39;s are delivered to us by our trusty Bethesda unclean, which causes mods to not function correctly and can cause CTD&#39;s with some mods.\r<br />\r<br />I will leave this one to our good friend... Gopher :).\r<br />\r<br />[youtube]fw3g_N1jcZQ[/youtube]\r<br />\r<br />[color=#ffcc33][b]TES5EDIT Download:[/b][/color] [url=http://www.nexusmods.com/skyrim/mods/25859/]http://www.nexusmods.com/skyrim/mods/25859/[/url]\r<br />\r<br />[color=#ffcc33][b]Manual guide (for those who don&#39;t want to watch an easy video):[/b][/color] [url=http://wiki.step-project.com/TES5Edit]http://wiki.step-project.com/TES5Edit[/url]\r<br />\r<br />\r<br />[size=7]Save Cleaning[/size]\r<br />If you have removed a mod that involves scripts, or have an old save you want to recover, use this tool. Will removed orphan scripts, can&#39;t guarantee it will fix the save.\r<br />\r<br />It&#39;s simple to use. Make sure you have a save that was saved after the mod was removed. Download, extract into a folder. Run the tool. In the top right, locate your save. Once open, at the top, click Fix All#, then FixScriptInstances, then Reset havok, then Save it, allow it to backup the save. Done.\r<br />\r<br />[color=#ffcc33][b]Download:[/b][/color] [url=http://www.nexusmods.com/skyrim/mods/52363/]http://www.nexusmods.com/skyrim/mods/52363/[/url]\r<br />\r<br />\r<br />[size=7]MOD STABILITY[/size]\r<br />[size=3][b]1. No such thing as a clean save.[/b][/size]\r<br />Two quick things on this issue. One, once you install scripts into your save, they have left their mark, they have spawned their stuff, and they have made their imprint on your game. The only clean save is the one before your mod was installed. Save game cleaner can help here, but often the script has still left a mark somewhere in your save, and can cause issues if its a major mod. Secondly, mods like Civil War Overhaul or the Unofficial Patches need a NEW save to take effect, as they alter important scripts run from the very start of your save. You will experience failure of scripts and even a possible CTD without a new save.\r<br />\r<br />[size=3][b]2. Script Mod Overload.[/b][/size]\r<br />Look, we all want location damage, footprints, a complete old school overhaul plus every single minor addition that makes the game more immersive. Papyrus, the scripting engine, can&#39;t handle too much. It&#39;s simple logic that too many script mods will overload the engine. Mods that are really, really old, or have a comment section with 500 warnings saying don&#39;t use this mod, they have scripts that will kill your game eventually. ESPECIALLY if you use uGridsToLoad (two additional grids in your radius to process scripts from.) Be careful with these mods.\r<br />\r<br />[size=3][b]3. Distant Detail[/b][/size]\r<br />Short warning about these, but flagging models to load at full distance with full detail will really hurt your GPU. Skyrim Distance Overhaul accomplishes this using actual LOD&#39;s (reduced quality models, like vanilla Skyrim), so that the models don&#39;t need every twig loaded in full texture resolution. Compromise for your GPU&#39;s sake :).\r<br />\r<br />[size=3][b]4. Sound Mods.[/b][/size]\r<br />Many newer sounds mods are stable, work well, and are good for your saves (such as Audio Overhaul), but many of the older ones will cause serious issues, break down, run rampant scripts, use over-sized sound files and more. It&#39;s best you read ~2 pages of the comment section to understand the general opinion and issues with the mod (there might not even be any).\r<br />\r<br />[color=#ffcc33][b]Some known unstable mods:[/b][/color]\r<br />Crimson Tide - Blood\r<br />Locational Damage (when used with many script mods)\r<br />\r<br />[color=#ffcc33][b]Some unstable mods possibly fixed by the Memory Patch:[/b][/color]\r<br />Open Cities Skyrim\r<br />Deadly Spell Impacts\r<br />\r<br />\r<br />[size=7]TIMESCALE CHANGES[/size]\r<br />In Skyrim, timescale is basically in-game time compared to real world time (how many seconds in the game world pass in one second of our world). By default this is set at 20. This is what every NPC, script, event and even dragon attacks are designed around. Many lower this variable to allow the game to feel more realistic, with the days passing by less frequently, taking more time.\r<br />\r<br />Instability can arise when you lower the timescale beyond 6. Scripts will begin to seriously misbehave, many NPC&#39;s may stop their schedules, cell&#39;s wont clean-up as often, AI may get stuck, and encounters may not work. Even at 6, some events may not work.\r<br />\r<br />The mod linked here will dynamically change the timescale based on interactions with the NPC&#39;s and events that have issues below a timescale of the vanilla 20, and at all other times will keep it at 6.\r<br />\r<br />Use this mod only if you wish for the timescale to be lowered, and for in-game days to pass by slower.\r<br />[url=http://www.nexusmods.com/skyrim/mods/21552/]http://www.nexusmods.com/skyrim/mods/21552/[/url]\r<br />\r<br />\r<br />I hope this guide fixes many of the irritant CTD&#39;s/lag misguided tweaks can cause, and ensures as many people as possible fix the true root of the vast majority of CTD&#39;s (Skyrim Memory Patch).\r<br />\r<br />[color=#ffcc33][size=3]If this guide helped you, please download and endorse to help more people fix their CTD issues.[/size][/color]",
  "categoryId": "95",
  "version": "1.4a",
  "author": "FireFreak111",
  "createdUnix": "1390475033",
  "updatedUnix": "1404867115",
  "containsAdultContent": false,
  "uploadedBy": "FireFreak111",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092894",
      "name": "Skyrim Stability Guide - 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14",
      "fileName": "Skyrim Stability Guide - Word version-50244-1-0.rar",
      "uploadedUnix": "1390475922",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/157d55a371fcff66de817ef826b1e1a7bd6844e1f41059ac0c1b4b0caece869b/analysis/1407898142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Stability%20Guide%20-%20Word%20version-50244-1-0.rar?fid=1000092894&ttl=1535831823&ri=8192&rs=8192&setec=f5b8db4c95ec0d15090e6f67c751a5cc"
    },
    {
      "fileId": "1000093032",
      "name": "Skyrim Stability Guide - Update 1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "19",
      "fileName": "Skyrim Stability Guide - Update 1-50244-1-1.rar",
      "uploadedUnix": "1390535427",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1ed685b384b969defe4aa8191c0ee9e5713b993305f9e8f2cd66f16c646ac75a/analysis/1407899102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Stability%20Guide%20-%20Update%201-50244-1-1.rar?fid=1000093032&ttl=1535831823&ri=8192&rs=8192&setec=42e671b8642eeb5f3d70992dabd80186"
    },
    {
      "fileId": "1000093718",
      "name": "Skyrim Stability Guide - Update 2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "25",
      "fileName": "Skyrim Stability Guide - Update 2-50244-1-2.rar",
      "uploadedUnix": "1390830213",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/66791ef22cc3afa9844ea8611ba3e9160f9a27077abb6662ac8fffd443f54466/analysis/1407904442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Stability%20Guide%20-%20Update%202-50244-1-2.rar?fid=1000093718&ttl=1535831824&ri=8192&rs=8192&setec=ca909519bd21e3eb243cc5a1a10b33f6"
    },
    {
      "fileId": "1000096803",
      "name": "Skyrim Stability Guide",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28",
      "fileName": "Skyrim Stability Guide-50244-1-3.rar",
      "uploadedUnix": "1392274669",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/538af9a1314c2fdd18981c1fdff94c4b0cc1979fe3747cfce92dbc40c07fb773/analysis/1407931395/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Stability%20Guide-50244-1-3.rar?fid=1000096803&ttl=1535831824&ri=8192&rs=8192&setec=b160671604a932830128d5e16a3222e9"
    },
    {
      "fileId": "1000116539",
      "name": "SKSE.ini - Enables Memory Patch",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "SKSE.ini - Enables Memory Patch-50244-1-4.zip",
      "uploadedUnix": "1404837000",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/78d019d44e42055e4e3740f3211a71691163de6bfc6ecf525b6e2e4c2c6f9efc/analysis/1408168624/",
      "changelogHtml": " First Changelog so far\r<br />- Moved Stable uGridsToLoad down to INI tweaks section, no longer recommended without any uGrids modifications.\r<br />- Changed Memory Patch method to SKSE, uploaded SKSE.ini file.\r<br />- Clarfication of ENBoost memory variables.\r<br />- Clarifcation on Papyrus MS variables.\r<br />- 8 Core settings in INI Tweaking section\r<br />- Small section on save game cleaning\r<br />- Removed Detailed Shadows optional, updated version will be included in next guide. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SKSE.ini%20-%20Enables%20Memory%20Patch-50244-1-4.zip?fid=1000116539&ttl=1535831824&ri=8192&rs=8192&setec=532042e447dc6fa9b43645328273ee80"
    },
    {
      "fileId": "1000116540",
      "name": "Skyrim Stability Guide",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27",
      "fileName": "Skyrim Stability Guide-50244-1-4.zip",
      "uploadedUnix": "1404838664",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/981aee194df1ac7c3a1f0d0b77cc40044223f44724c67038c6ae432de08de943/analysis/1408168625/",
      "changelogHtml": " First Changelog so far\r<br />- Moved Stable uGridsToLoad down to INI tweaks section, no longer recommended without any uGrids modifications.\r<br />- Changed Memory Patch method to SKSE, uploaded SKSE.ini file.\r<br />- Clarfication of ENBoost memory variables.\r<br />- Clarifcation on Papyrus MS variables.\r<br />- 8 Core settings in INI Tweaking section\r<br />- Small section on save game cleaning\r<br />- Removed Detailed Shadows optional, updated version will be included in next guide. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Stability%20Guide-50244-1-4.zip?fid=1000116540&ttl=1535831825&ri=8192&rs=8192&setec=bb4ba7a83b07ca7f32438b6a54fa95c2"
    },
    {
      "fileId": "1000116595",
      "name": "SKSE.ini - Enables Memory Patch",
      "version": "1.4a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "SKSE.ini - Enables Memory Patch-50244-1-4a.rar",
      "uploadedUnix": "1404865884",
      "modVersion": "1.4a",
      "virusScanUrl": "https://www.virustotal.com/file/b60dc76f2a92ced2cee33454ed595d2aba569fbae67d6e2846a6d42f5cd8eb9b/analysis/1408169474/",
      "changelogHtml": " - Fixed recommendations for SKSE, should ensure SKSE.ini loads.\r<br />- Fixed an old reference to SSME in the uGridsToLoad section.\r<br />- Converted SKSE.ini upload to NMM enabled upload. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SKSE.ini%20-%20Enables%20Memory%20Patch-50244-1-4a.rar?fid=1000116595&ttl=1535831825&ri=8192&rs=8192&setec=440d13c7555ac50ac83731c1f301c20f"
    },
    {
      "fileId": "1000116604",
      "name": "Skyrim Stability Guide",
      "version": "1.4a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "297",
      "fileName": "Skyrim Stability Guide-50244-1-4a.zip",
      "uploadedUnix": "1404867115",
      "modVersion": "1.4a",
      "virusScanUrl": "https://www.virustotal.com/file/16f15966b595bab1060f85c4829ff788f5c4506b78e7a47afcb2ff4d474c9e0b/analysis/1408169670/",
      "changelogHtml": " - Fixed recommendations for SKSE, should ensure SKSE.ini loads.\r<br />- Fixed an old reference to SSME in the uGridsToLoad section.\r<br />- Converted SKSE.ini upload to NMM enabled upload. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Stability%20Guide-50244-1-4a.zip?fid=1000116604&ttl=1535831826&ri=8192&rs=8192&setec=2edd53680524ef74605d9362ea27c6c5"
    }
  ]
}