{
  "modId": 50240.0,
  "modName": "More Racism in Windhelm",
  "summary": "Adds six unique voiced bigoted NPCs to the Windhelm and a bookseller with some unique books.\r<br />Optional file adds six unnamed Nords with already present, but rarely heard xenophobic dialogue. \r<br />",
  "descriptionHtml": "Version 5.0 - Merged the books addon to the main file.\r<br />\r<br />Optional &#34;generic&#34; file adds four non-named Nords and two Stormcloak guard officers with modified rarely heard dialogue from vanilla.\r<br />\r<br />Main description:\r<br />\r<br />If you think that the supposed &#34;Windhelm xenophobia&#34; is a bit of an Informed Attribute, this mod rectifies it somewhat by adding six NPC&#39;to Windhelm, who have varying levels of bigotry towards some races. \r<br />\r<br />Hriskarr is a more straightforward racist, while Alvar is the more faux-benevolent &#34;why are these people so whiny?&#34; one. \r<br />\r<br />Asgald is a bard with a very high option of himself. His initial dialogue with the player explains why the xenophobic Elda Early-Dawn hired a Dunmer as a bard in her Hall. \r<br />\r<br />Fenrens is a retired Stormcloak minor officer and Suvaris Atheron&#39;s colleague. He is meant as sort of counter-point to Solaf from Falkreath. \r<br />\r<br />Ringvild Fire-Hair is a noblewoman and a minor quest giver. \r<br />\r<br />Gundlar Bloody-Mace is a bigoted Stormcloak officer in the Palace of the Kings. His injury prevents him from actively fighting. If you win the war for the Imperials, you can find him in the Temple of Talos. \r<br />\r<br />They are fully voiced (Hriskarr is voiced by voice actor DonutsStrongJaw; Ringvild is voiced by voice actress katubug, Alavar by voice actor Gawd Clan).  \r<br />\r<br />Also, the supposedly &#34;tolerant&#34; Brunwulf is now actually tolerant - he no longer gives his excuse about not letting Argonians wander the streets, and the lizards will wander them if Brunwulf becomes the Jarl. \r<br />\r<br />Regardless of who rules the city, Scouts-Many-Marshes will sneak to the New Gnisis Cornerclub in 14:00 on the weekday, where he&#39;ll discuss racial relationships in the city with Ambarys (the discussion is an already-existing Vanilla scene that didn&#39;t trigger because Marshes was never near the Cornerclub). \r<br />\r<br />Rangela the Bookseller sells some books with different degrees of xenophobia.\r<br />\r<br />Optional file features four non-named Nords who make use of vanilla xenophobic guard dialogue that was rarely heard in-game. Winning the war for the Stormcloaks will make them stop insulting your Argonian/Khajiit/Elvish character. Winning the war for the Imperials will make them stop saying how only loyal Nords are truly welcome in the city, but will, of course, not stop the insults. Defeating Alduin will stop them regardless of your alignment. \r<br />\r<br />As usual with Skyrim mods, unzip the files to the Data folder. If you&#39;re upgrading over the old version, overwrite. ",
  "categoryId": "33",
  "version": "5.0",
  "author": "LoneWolf",
  "createdUnix": "1390465169",
  "updatedUnix": "1427739730",
  "containsAdultContent": false,
  "uploadedBy": "LoneWolfEburg",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000150942",
      "name": "More Generic Racism in Windhelm",
      "version": "4.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "801",
      "fileName": "More Generic Racism in Windhelm-50240-4-1.rar",
      "uploadedUnix": "1426015651",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/a86a60c3915e704202fe0b649ba02c4d7ee82f5d8abcd9906057067a8ed72e82/analysis/1426015684/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Generic%20Racism%20in%20Windhelm-50240-4-1.rar?fid=1000150942&ttl=1535831815&ri=8192&rs=8192&setec=41b98d09a32eff2e402893a20bb3c87a"
    },
    {
      "fileId": "1000153639",
      "name": "More Racism in Windhelm",
      "version": "5.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36200",
      "fileName": "More Racism in Windhelm-50240-5-0.rar",
      "uploadedUnix": "1427739730",
      "modVersion": "5.0",
      "virusScanUrl": "https://www.virustotal.com/file/908aca53f1de4ab26b208f24e11f26a6893ad2da6cfb89226492e1ff1ab1d7ce/analysis/1427739790/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Racism%20in%20Windhelm-50240-5-0.rar?fid=1000153639&ttl=1535831816&ri=8192&rs=8192&setec=dac297506dfb79607218a5d48aa2441c"
    }
  ]
}