{
  "modId": 50246.0,
  "modName": "Falskaar Wildlife add-on",
  "summary": "This simple mod adds more wildlife around the island of Falskaar so that the wilderness area fells more lively.",
  "descriptionHtml": "Falskaar is a well-done, very polished mod but i found the wilderness area on the island felt a bit empty and devoid of life especially in the forest around Amber Creek. \r<br />\r<br />This mod adds spawn points for passive animals ad predators throughout the island. It&#39;s more of an atmosphere mod as it won&#39;t significantly change the gameplay of Falskaar itself.\r<br />\r<br />I&#39;ve added chickens around farms, mudcrabs and horkers along the coast, predators and preys in the wilderness. You&#39;ll also encounter the odd bear lying on the road waiting for the daring adventurer to cross his path.\r<br />\r<br />The mod uses only the vanilla leveled lists so it should be compatible with pretty much anything. I personnally use it with Requiem and skyrim immersive creatures with no problem. On my high-end system there is no performance hits, though for low-end systems it could decrease performance.\r<br />\r<br />The mod has been cleaned using tes5edit. It should be safe to remove as no scripts are involved, the mod only adds spawn points.",
  "categoryId": "83",
  "version": "1.0",
  "author": "Dean Corso",
  "createdUnix": "1390481366",
  "updatedUnix": "1390481321",
  "containsAdultContent": false,
  "uploadedBy": "deancorso666",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000092901",
      "name": "Falskaar Wildlife add-on",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Falskaar Wildlife add-on-50246-1-0.7z",
      "uploadedUnix": "1390481321",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/26caf9b17a8726f34e2e9c3430566700b5a79609713212776da9aca310433176/analysis/1407898149/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Falskaar%20Wildlife%20add-on-50246-1-0.7z?fid=1000092901&ttl=1535831828&ri=8192&rs=8192&setec=912b7de53d8c0001b5c9dbbe6de90947"
    }
  ]
}