{
  "modId": 50256.0,
  "modName": "Ragnaroks Revenge",
  "summary": "A small-medium sized quest line that has the Dragonborn take on a new faction. The mod adds unique armors, robes, weapons and spells.",
  "descriptionHtml": "I want to dedicate this mod to my brother. Even going through a rough time, he still helped me develop the concepts and lore of this mod. PLEASE ENDORSE IF YOU LIKE IT&#33;&#33;&#33; It gives me the motivation to keep uploading mods to the Nexus.\r<br />\r<br />UPDATED to Version 1.1-All items added in the mod are fully temperable-before some of them was not able to get to legendary.\r<br />Please DO NOT POST any spoilers&#33; If anyone is having issues with the where to go in the quest, PM me&#33; If you post spoilers, they will be deleted&#33; Feel free to upload images, but again, NO SPOILERS&#33;\r<br />\r<br />[youtube]nmmUqJO9sJQ[/youtube]\r<br />Thanks Shinji72 for the video&#33; Make sure everyone subscribes to his awesome YouTube Channel&#33;&#33;&#33;\r<br />(He didn&#39;t show one of the best weapons in the video on purpose...He did not want to post spoilers...you have to play the mod to get the weapon....)\r<br />\r<br />What this mod does: Adds a hidden quest, new weapons, armor, robes, and spells.\r<br />Note: The items and spells are meant for end-game use. If you acquire them early they will seem overpowered. The quest should defeat most early players though…\r<br /> \r<br />Requirements: Dragonborn and Dawnguard DLCs. Player level should AT LEAST in the twenties. Not required, but recommended because of the difficulty. \r<br />\r<br />Lore: The Ragnarok Clan is a faction that was started when the Stormcloak rebellion began. However, their tactics were too cruel even for the Stormcloaks and Ulfric banished them for that reason. That did not deter them from trying to accomplish their goals. The group regularly attacks the Imperials for trying to take over Skyrim. Being true Nords, they dislike the Elven kind and that made them enemies with the Thalmor. Lastly, they hate the Companions for being “weak blooded”. The Ragnaroks believe they are the “True Sons of Skyrim”, and will kill anyone who stands in their way. Will they set their sights on the Dragonborn?\r<br />\r<br />How to start the quest: Outside the Whiterun Stables, by the carriage driver, there is a dead courier with a satchel near him. Inside the satchel, a note tells the Dragonborn to go to Meeko’s Shack. There will be no map updates or quest markers, as this is a hidden quest. Check the images for more details.\r<br />\r<br />I have added too many items to describe them all in the description&#33; All items are modified vanilla items. No new textures or meshes. Just be on the look out for some new or altered gear…\r<br />\r<br />The Summon Fenrir spell might just look like a normal summon familiar, but its stats are boosted to a substantially higher level. Gungnir is a novice spell, but it&#39;s affected by the expert perk.\r<br />\r<br />Permissions: Please ask me if you want to use any of my resources for other mods and please do not upload it to other sites. But do not hesitate&#33; I a want to help people make their own modding experience more enjoyable&#33;\r<br />\r<br />Other Mods:\r<br />Cursed Camelot-(with collaboration from Avatar1971)\r<br />http://www.nexusmods.com/skyrim/mods/49519/?\r<br />New Camelot in Fallout New Vegas- http://www.nexusmods.com/newvegas/mods/54435/?\r<br />I also check out Avatar1971&#39;s other mods. They are awesome&#33;\r<br />Credits: Avatar1971 for helping test this mod out.\r<br />Bethesda for making such awesome games and modding tool kits.\r<br />",
  "categoryId": "35",
  "version": "1.1",
  "author": "ApokKnight",
  "createdUnix": "1390504486",
  "updatedUnix": "1390597153",
  "containsAdultContent": false,
  "uploadedBy": "ApokKnight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093186",
      "name": "Updated Ragnarok- All Items Fully Temperable",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45",
      "fileName": "Updated Ragnarok- All Items Fully Temperable-50256-1-1.zip",
      "uploadedUnix": "1390597153",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d68fa76aacea35353c2318019cfff974e8636ffb13e7261b30e1a709decb4b2e/analysis/1407900184/",
      "changelogHtml": " All items in the Mod are fully temperable. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Updated%20Ragnarok-%20All%20Items%20Fully%20Temperable-50256-1-1.zip?fid=1000093186&ttl=1535831843&ri=8192&rs=8192&setec=a0778be52691c0c99ed24293ad5017e6"
    }
  ]
}