{
  "modId": 50263.0,
  "modName": "Pinetree Lodge",
  "summary": "A new player home near Falkreath. The home contains many features and a MCM has been implemented to allow them to be toggled on or off of for certain things to be selected. These include: banners, light/dark themes, horse and cart driver, Hearthfire style garden or normal garden, bards, vampire coffin and much more. The home is Hearthfire adoption ",
  "descriptionHtml": "[color=#ff7700][center][size=5][b][u]This mod is no longer being supported and should be taken as it is. I will not be returning to this page to assist users and will ignore any personal messages regarding this mod. The fact that this mod is no longer supported does NOT give anyone the right to re-publish my work with or without credit. The rules regarding asset use still apply however the answer to all requests for permission to use my assets contained within this mod should be assumed to be NO.[/u][/b][/size][/center][/color]\r<br />\r<br />[img]http://i.imgur.com/GyhIXRn.png[/img]\r<br />\r<br />[img]http://i.imgur.com/d20xLnW.png[/img]\r<br />\r<br />A new player home near Falkreath. The home contains many features and a MCM has been implemented to allow them to be toggled on or off of for certain things to be selected. These include: banners, light/dark themes, horse and cart driver, Hearthfire style garden or normal garden, bards, vampire coffin and much more. The home is Hearthfire adoption compatible.\r<br />\r<br />[img]http://i.imgur.com/Q56lZo9.png[/img]\r<br />\r<br />Basics:\r<br />- Bards: Choice of either or both female and male bard\r<br />- Trash: A container that deletes its contents on leaving the home for use in getting rid or useless junk\r<br />- Item reset font: Removes player applied enchantments in the even that you desire to change the enchantment or accidentally enchant the item.\r<br />- Dynamic or static storage: The option of static storage (closed chests) or dynamic storage which will be open chests that display a static overlay when an item is placed inside. Note that the statics will only appear when a correct item is placed e.g. a ingot placed in the ingredient chest wont trigger the overlay but an ingredient will\r<br />- Staff enchanter: Option to have a staff enchanter\r<br />- Spider crafting: Option to have a spider crafting station\r<br />- Adoption: Option to have a three bed childs room or a three bed followers room\r<br />- Hearthfire or normal garden: Choice of having a pre-planted or Hearthfire style garden\r<br />- Horse and cart: Option to have a card and driver to take you to where you need to go\r<br />- Mill, Apiary and Fishery: Options for a mill, apiary and fishery \r<br />- Vampire coffin: option of a vampire coffin in the basement\r<br />- Shrine base: A shelf that hold the 9 shires of the 9 divines each of which become active once a correct amulet of the god is placed in the shrine base\r<br />- Archery range: Option of having a functional moving archery range\r<br />- Chess board: Option of having a static or gambling board, gambling allows you to bet on the winner\r<br />- Strange spider: Option of a spider that gets items for you at merchant cost however you need to wait for a day for the spider to procure the items\r<br />\r<br />Advanced:\r<br />- Displays: Dragon claws and masks as well as paragons, thieves guild trophies, black book and elder scrolls, daedric artifacts and misc trophies. Displays will show a transparent version indicating empty and a full version indicating item has been placed\r<br />- Remote access: A spell that allows you to access chests in the home without being in the home. There is a limit to the amount of times chests can be accessed before you will need to pay dragon souls to reset the limit. The payment interval and cost is customisable in the MCM\r<br />- Mirror: Choice of a static, basic or full mirror to which each shows wither none, basic or full race menu for altering appearance\r<br />- Heart of the Forest or Black Book transport system: A stone or book that allows you to store up to five locations at the cost of dragon souls and then travel to them at will free of charge. The storage cost is customisable\r<br />- Amber soul gem: a reusable soul gem that is intended to be a replacement for the black star or azura&#39;s star for when it is placed in the displays. The size of the gem is customisable from petty to black\r<br />- Decoration: Choice of over 15 banners and two themes, light or dark. \r<br />\r<br />[img]http://i.imgur.com/in4Bap9.png[/img]\r<br />\r<br />There are two versions of the mod, one by Elianora and one by Lrsamways. All features and aspects are the same in both versions except for a few small aesthetic changes. The main noticable changes are as follows, some other small changes do exist however.\r<br />\r<br />Curtains:\r<br />- Elianora: Yes\r<br />- Lrsamways: No\r<br />\r<br />Ceramic pot colour:\r<br />- Elianora: Red\r<br />- Lrsamways: Blue\r<br />\r<br />Rugs:\r<br />- Elianora: Straight long rugs used predominantly throughout the home\r<br />- Lrsamways: Rectangle and round rugs used together throughout the home\r<br />\r<br />Paintings:\r<br />- Elianora: Fantasy style \r<br />- Lrsamways: Direct pictures taken during Skyrim gameplay\r<br />\r<br />[img]http://i.imgur.com/5MWYShC.png[/img]\r<br />\r<br />All Skyrim DLC (Dawnguard, Dragonborn and Hearthfire) are required in order for this mod to work. To be able to use the features you will need SKSE and SkyUI to enable MCM functionality.\r<br />\r<br />[img]http://i.imgur.com/t64w1Mc.png[/img]\r<br />\r<br />NMM: \r<br />1 - Install the core components\r<br />2 - Install the selected version\r<br />\r<br />NOTE: Installation via NMM should work by default install process however we offer no support for it in case it doesnt.\r<br />\r<br />Manual:\r<br />1 - Download the core archive and your choice of version and extract the contents of the two archives to a specific location\r<br />2 - Copy or move the four files extracted from the two archives to the Skyrim &#34;Data&#34; folder\r<br />3 - Run the Skyrim launcher and ensure that &#34;LrsamwaysModFeatures.esm&#34; and &#39;PinetreeLodge.esp&#34; are ticked\r<br />\r<br />Updating:\r<br />For updates a clean install is required. This involves the following:\r<br />- Removing all items you wish to keep from the lodge\r<br />- Exit the lodge and cavern\r<br />- Save and shut down to your desktop\r<br />- Uncheck the mod in the data files section of the normal Skyrim launcher\r<br />- Load the game with the mod inactive and save\r<br />- Shutdown to your desktop and install the new version using the above methods\r<br />\r<br />[img]http://i.imgur.com/sWRNZkd.png[/img]\r<br />\r<br />Some users encounter a strange phantom water that appears and disappears again. It has been encountered outside the lodge however so at this stage is assumed to be a game issue that affects the lodge among other places.\r<br />\r<br />[img]http://i.imgur.com/v4xPYBZ.png[/img]\r<br />\r<br />Pinewood Manor - Incompatible\r<br />Alchemists&#39; Cavern - Incompatible\r<br />\r<br />[img]http://i.imgur.com/s1j2NN2.png[/img]\r<br />\r<br />V1:\r<br />- Initial release\r<br />\r<br />V2:\r<br />- The nexus file system has been changed such that the three unchanging core files are downloaded and work with both Elianora and Lrsamways versions and then the esp of the desired version is simply installed after. This allows updates to be done without requiring to download more then just the updated esp.\r<br />- Fixed the MCM script to prevent it from trying to change the amber soul gem once the menu is closed even when the settings for it were not touched.\r<br />- Banner sounds removed to prevent water sounding noise in the home.\r<br />- Altered the ownership of the remote access chest such that accessed items arent flagged as stolen if accessed in a non-player owned cell. \r<br />\r<br />V3:\r<br />- Removed the issue with remote access spell moving items to only the second chest if items are added to two different chests in quick succession.\r<br />- Fixed banner spelling in the MCM. \r<br />- Added a toggle option for &#34;Extra Banners&#34; to allow you to have: Faction banners only, Faction and Generic Banners, No Banners and Generic Banners Only (The colour of the banner is still dictated by the light or dark theme). \r<br />- Added another remote access chest named &#34;To Sell&#34; for items gathered that are just going to be sold at the next available time and not stored or displayed.\r<br />- Menu option to choose between Elianora and Lrsamways version in-game. \r<br />- Vault door for the display room or a wall if no displays are active. \r<br />- Option to have a black book instead of the Heart of the Forest travel stone. \r<br />- Changes to some static overlays to make them more visible in their chests.\r<br />- Fixed the transparent displays from returning when closing the MCM even without altering those options.\r<br />- Overhauled the displays such that the item is stored in a chest and not simply removed into thin air and then a copy created when its removed.\r<br />\r<br />V3 Update:\r<br />- Fixed an issues with the Heart of the Forest stone caused by implementing the Black Book.\r<br />\r<br />V4:\r<br />- Changed the look of the archery range and added to ability to gain experience for shooting the targets.\r<br />\r<br />[img]http://i.imgur.com/MZCAac8.png[/img]\r<br />\r<br />- [b]Q: [/b]Can you add X or Y?\r<br />- [b]A:[/b] No, this mod is as is and will not likely change. If you wish to add something we suggest you get the Creation Kit and learn how to use it.\r<br />\r<br />[img]http://i.imgur.com/EGfPwd2.png[/img]\r<br />\r<br />- Use of the Pinetree Lodge bsa assets is permitted providing the original resource creator has been credited.\r<br />- Use of the all other mod assets is strictly forbidden\r<br />\r<br />[u][b]Under no circumstances is this mod to be uploaded to sites other than the nexus[/b][/u]\r<br />\r<br />[img]http://i.imgur.com/JiA8q2g.png[/img]\r<br />\r<br />Bethesda for Skyrim and the Creation Kit\r<br />Blary: Alchemy clutter, book sets and other resources\r<br />Oaristys & Tony67: Modder&#39;s Resource Pack\r<br />The_Funktasm: Morrowind textures and clutter\r<br />InsanitySorrow: Blankets, charts, painting, pillows, rugs, towels, lantern, new textures, Ayleid clutter and washing items\r<br />tueffelachtein: Modder&#39;s resources\r<br />Lilith: Ready clutter and catering resources\r<br />Runspect: Resources for modders (fruit, toys, decor)\r<br />Tamira/stroti: Kitchen clutter, craftsman tools\r<br />TESA: Resource Kit\r<br />BrettM: FPI project resource (statics and display)\r<br />breti: Rochester meshes\r<br />LilaMue: Mew silver cutlery\r<br />mrpdean: New lakeview manor meshes\r<br />DarkRider: Paintings\r<br />Mindboggles: Round Water mesh\r<br />mikegemini: Noble bed retexture \r<br />VilniusNastavnik: Testing and the idea for the strange spider\r<br />Ga-Knomboe Boy: New trees",
  "categoryId": "67",
  "version": "V4",
  "author": "Elianora and Lrsamways",
  "createdUnix": "1390521760",
  "updatedUnix": "1405481591",
  "containsAdultContent": false,
  "uploadedBy": "Lrsamways",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117767",
      "name": "Pinetree Lodge",
      "version": "V4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "159271",
      "fileName": "Pinetree Lodge-50263-V4.rar",
      "uploadedUnix": "1405481591",
      "modVersion": "V4",
      "virusScanUrl": "https://www.virustotal.com/file/08d74da777d8ba741a383b607858a0e2498e9ba7664b406e3b3986f7cd7c465d/analysis/1405481731/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pinetree%20Lodge-50263-V4.rar?fid=1000117767&ttl=1535831860&ri=8192&rs=8192&setec=b3b1ff6c1868a9ae880e55a06e3c2287"
    }
  ]
}