{
  "modId": 50284.0,
  "modName": "Inconsequential NPCs - Russian",
  "summary": "Плагин добавляет назовем их - &#34;Незначительных NPC&#34;, эти граждане живут в Скайриме своей жизнью, они в большинстве своем, понятия не имеют кто такой Довакин",
  "descriptionHtml": "Опубликованно с письменного разрешения автора оригинального мода Inconsequential NPCs by Ripple\r<br />http://www.nexusmods.com/skyrim/mods/36334/?\r<br />Локализация на русский язык - kopasov\r<br />\r<br />На заметку:\r<br />- Так как в моде использована абсолютно новая,авторская озвучка для всех новых NPC,все звуковые диалоги будут на английском,а весь текст будет на русском\r<br />- Не забудьте в игре включить титры\r<br />- В озвучке принимало участие 8 актёров,все диалоги не игровые и поэтому русской озвучки нет (мы это не можем сделать)\r<br />\r<br />[url=http://jpegshare.net/][img]http://jpegshare.net/images/b3/40/b34016c32bf608f547220f3b1c2fe51f.jpg[/img][/url]\r<br />\r<br />Прочитайте всё внимательно,мод в своем роде уникальный\r<br />\r<br />Описание:\r<br />- Плагин добавляет назовем их - &#34;Незначительных NPC&#34;, эти граждане живут в Скайриме своей жизнью, они в большинстве своем, понятия не имеют кто такой Довакин, чем он занимается и насколько он велик и славен. Они занимаются своими делами и не собираются сломя голову мчаться вам на помощь бросив эти самые свои дела по первому вашему зову. Скорее всего, они пошлют вас вежливо (а иногда и нет) куда подальше попросив не мешаться под ногами. Задумайтесь сами, а вы к примеру общаетесь со всеми, кого видите в общественном транспорте? Пристаете с вопросами и спрашиваете имя и род занятий у любого встреченного на улице? Так почему каждый NPC в Скайриме готов бросить все, на что он тратит свое драгоценное время, чтобы отвечать на идиотские вопросы Драконорожденного, когда у них вероятно есть свои более важные для них дела. ну и задумайтесь также, а где находятся большинство жителей Скайрима? Почему во всей стране населения чуть ли не меньше, чем в местном пабе в субботу ночью?\r<br />- Данная модификация ненавязчивым способом добавляет в Скайрим множество NPC, которым нет дела до того, что вы - Драконорожденный. Они действительно не желают с вами общаться, большинство на ваши приставания к ним, вымолвят не более двух слов, но они и сами не будут к вам приставать принести, достать, спасти и прочими подобными просьбами, они не будут перед вами исповедоваться рассказывая истории своей жизни, потому что они просто не желают с вами знакомиться. Они не пожелают стать вашими последователями( ну если только вы им хорошо не заплатите), мысль о браке с вами для них смешна. Все что они желают - это чтобы вы оставили их в покое.\r<br />Но это не просто &#34;случайные&#34; NPC, все они &#34;уникальны&#34; и предназначены для заполнения существующих &#34;пробелов&#34; в социальной среде Скайрима. Как часто вы заходили в какое-либо городское помещение Скайрима, ожидая найти там множество жителей, но на деле встречали лишь пару-тройку в пустой комнате? Этот плагин, как и другие модификации аналогичного ряда, предназначен для внесения в Скайрим визуальной атмосферы игры, чтобы игрок лучше прочувствовал этот мир, погрузившись в происходящее вокруг....\r<br />\r<br />Подробнее:\r<br />\r<br />*Соблюдение закона*\r<br />- Под властью Ульфрика Буревестника, Аргонианам и Каджитам запрещено находится в стенах Виндхельма. Но, страже наплевать, они охотятся за вами, как за злокрысом, который убивает сельскохозяйственных животных.\r<br />- &#34;Несущественные NPC&#34;, то есть охранники, теперь стоят на каждых воротах Виндхельма, они фактически будут соблюдать закон. К вам будут приставать стражники на воротах при въезде в город.\r<br />- Если вы Аргонианен или Каджит, вы будете оперативно проинформированы о законах, и охрана стоящая на воротах попытается сопроводить вас за пределы города, то есть выдворить вас. Для всех остальных рас будет выдаваться специальное предупреждение, чтобы вы знали, насколько Братья бури ценят присутствие иноземцев в Виндхельме, за исключением Нордов, которые смогут свободно приходить в Виндхельм и уходить. Это не безумие - это Виндхельм&#33;\r<br />\r<br />*Талморские агенты*\r<br />- Пустую Штаб квартиру Талморцев в Солитьюде сейчас занимают Талморсике агенты и часовые.Подобно всем Юстициарам,их миссия - запугать население Скайрима и вырезать приверженцев Талоса. Но &#39;страх&#39;,а не &#39;насилие&#39; - вот оружие этих агентов\r<br />- Юстициары не носят обмундирования Талморцев,которые будут выдавать их как очевидные цели у недовольных местных жителей. Вместо этого, они скрываются в городе и работают &#39;под прикрытием&#39;,чтобы вести контроль над населением.Если вы будете внимательны,вы,возможно сможете увидеть тайные встечи между Юстициарами и их осведомителями\r<br />- И если вы поможете Ондолемару в Маркарте,они узнают о вашем подвиге,то возможно они станут &#39;вежливыми&#39; в своем поведении по отношению к Драконорожденному. Если Солитьюд будет под контролем Братьев бури,то агенты Талмора и их часовые забаррикадируются внутри Штаб-квартиры Талмора. Вы можете оставить их в покое или...\r<br />\r<br />*Охрана конных повозок*\r<br />- А как собственно конные повозки так лихо перемещаются по Скайриму? Ведь кругом полно бандитов и опасных тварей.. Как медленно едущей повозке с одним вооруженным извозчиком удается увернуться от всех этих неприятных встреч и добраться до места назначения?\r<br />- Теперь в каждую повозку добаляется опытный охранник из рядов отставных вояк. Боевые ветераны или амнистированные преступники выглядят ( по крайней мере стараются так выглядеть..) достаточно крутыми, чтобы небольшая горстка бандитов дважды подумала прежде чем напасть на повозку (в Маркарте охранников двое, Изгои такие каннибалы - совсем без тормозов..)\r<br />\r<br />*Девушки легкого поведения*\r<br />- Разве похож Рифтен на гнездо порока? Тут нет азартных игр, нет борделей, а до ближайшего рассадника скуумы почти полдня пути к Айварстеду.\r<br />- &#34;Несущественные NPC&#34; заполняют по крайней мере два из этих компонентов. Если вы достаточно смелы, чтобы прогуляться с наступлением темноты по самым злачным переулкам города, то там вы столкнетесь с ними.. с девушками на час, если пожелаете уплатить их цену. Да, вы можете их купить, но не ожидайте увидеть роскошных принцесс украшенных ювелирными изделиями в экзотической одежде, готовых ублажать вас многие часы подряд. Нет, эти девушки не куртизанки высокого пошиба, они порождение темных улиц которым нужно быстро менять клиентов, чтобы накопить достаточную сумму для покупки новой порции скуумы или погасить свои долги перед сутенером. Так что на &#34;качество&#34; обслуживания не рассчитывайте, это скорее - &#34;быстрый секс&#34;...\r<br />\r<br />*Наркодилеры*\r<br />- Продолжая разговор о пороках, отметим и других NPC, которые являются дилерами скуумы и которые просят за нее абсурдные суммы. Их можно найти в Рифтене и Маркарте, в этих городах самые коррумпированные стражники и самое бедное и эксплуатируемое население, которое больше всего нуждается в том, чтобы &#34;убежать&#34; от рутинного существования.\r<br />\r<br />*Вориш...ээээ, я хотел сказать, сироты*\r<br />- Ульфрик не перестает призывать жителей Скайрима на свою гражданскую войну и многие из них покинули свои дома и семьи. Некоторые из этих мужчин и женщин уже никогда не вернутся домой, а военные действия лишь усугубляют ущерб наносимый социальной структуре страны. - Однако, в Скайриме есть только маленькая горстка детей-сирот, которые почти все находятся в &#34;заключении&#34; в Приюте Рифтена. Где все те, которые должны заботиться о осиротившех вследствии войны детях и приводить их в сиротский дом? Их нет, да и некогда этим заниматься когда за вашим окном гремит война. Установив этот плагин, вы столкнетесь на улицах городов с бездомными детьми-попрошайками\r<br />- Советую вам следить за своими кошельками, если вы пожелаете откликнутся на их просьбы о милостыне...\r<br />\r<br />*Посетители королевского двора*\r<br />- Королевский двор верховного короля в Скайриме - это сердце правительства страны, символ ее власти, даже если эта власть несколько подорвана из-за бушующей гражданской войны. Здесь должно быть множество просителей и чиновников требующих разрешения споров, утверждении властью договоров и прочего всего что мы называем &#34;придворной суетой&#34;. Но где, черт возьми, они все?\r<br />- &#34;Несущественные NPC&#34; добавляют некоторые признаки жизни королевскому двору. В Синем Дворце появятся иностранные послы, которые будут время от времени &#34;приставать&#34; к Элисиф со своими просьбами и чванливо держаться в разговоре с Драконорожденным, ведь даже он должен заметить насколько они благородны...\r<br />\r<br />*Новые наемники*\r<br />- Скайрим в разгаре гражданской войны, все кто умеет правильно держать меч должны стекаться сюда как пчелы на мед. Ванильная игра предоставляет вам возможность нанять некоторое количество наемников, но довольно странно то, что наемники такого калибра имеют проблемы с трудоустройством в это неспокойное время, просиживая задницы в тавернах и наполняя свое брюхо дешевым пойлом, пока к ним не явится какой-то драконорожденный с сомнительным прошлым и позовет их поучаствовать в суицидальном &#34;походе&#34;, например поохотиться на дракона.\r<br />- Плагин добавляет несколько других типов наемников, они не настолько круты и вполне себе могут погибнуть на первом же серьезном сопернике, они даже не отличаются особой храбростью (но и не трусы, правда..). Им абсолютно все равно кто вы есть такой\r<br />(поэтому вам придется им платить каждый раз при найме), однако их внешний вид будет полезен если вам нужно будет кого-то &#34;запугать&#34;, либо разобраться с не слишком существенной проблемой по-быстрому.\r<br />- Скорее всего вам не стоит их брать с собой на охоту на драконов, хотя... может и наоборот, ведь это их работа - побеждать ваших врагов...\r<br />\r<br />*Телохранитель Мавен*\r<br />- Кто такая Мавен? Она по существу &#34;теневой&#34; Ярл Рифтена. При этом она постоянно расхаживает по городу и выговаривает в резкой грубой форме каждому своему встречному.\r<br />- Каждый раз, когда я встречал ее в игре, у меня было желание разбить голову этой напыщенной тетки о ближайшую стену, но я знал что её смерть создаст &#34;вакуум власти&#34; в Рифтене, чем не преминет воспользоваться по идее группа амбициозных людей или организация, но таких в игре не существует. Однако, откуда обычному игроку это известно, что их нет? Поэтому у Мавен появится новый телохранитель, взамен того которого она услала охранять никчемный склад в порту.\r<br />- Он следует за ней повсюду, отпугивая возможных ее врагов, кроме тех случаев когда Мавен отправляется для ежедневной болтовни с Ярлом, в этом случае он как хорошая гончая будет ждать ее снаружи...\r<br />\r<br />*Наркоманы*\r<br />- В процессе обсуждения и роста этого плагина некоторые пользователи просили добавить &#34;проституток&#34;-мужчин, другие считали что в городах Скайрима должно быть больше нищих. Эти две проблемы здесь убиваются одним камнем.\r<br />- В течении дня, в самых захудалых районах Рифтена, вы встретите наркоманов зависящих от скуумы -готовых на все людей, для того чтобы потратить заработанное на новую порцию сладкого дыма.\r<br />\r<br />*Студенты Коллегии*\r<br />- Ну я не буду вам рассказывать как тяжело студенту на первом курсе..(не в плане учебы, ага..) Короче говоря, существует такой тип людей, что когда их ранг и статус чуть выше вашего, они насаждают новичкам &#34;дедовщину&#34;, подвергая тех в принципе тому, что когда-то испытали и на своей собственной шкуре.\r<br />- &#34;Несущественные NPC&#34; добавляют таких &#34;старичков&#34; в Коллегию Винтерхолда, которые никогда не забудут напомнить Драконорожденному, что они выше его в ученической иерархии Коллегии - пока.. пока он не станет Архимагом. Тогда их тон изменится... значительно.\r<br />\r<br />*Жители..хммм..Винтерхолда*\r<br />- Опять же в обсуждениях этой модификации было предложено пользователями попытаться извлечь какую-либо выгоду из добавления в Винтерхолд NPC. Мы знаем о том, что здесь произошел &#34;Великий Коллапс&#34; и весь город обрушился в Море Призраков погребя под своими обломками всех его жителей.\r<br />- &#34;Несущественные NPC&#34; добаляют в игру &#34;призраков&#34; этих несчастных, чьи потерянные души пытаются что-то найти, не обращая внимания на то, что происходит вокруг и что их когда-то цветущий город давно уже исчез с лика земли. Их действия и слова - это то чем они занимались в мгновения перед катастрофой...\r<br />\r<br />*Слуги*\r<br />- Вас посещала мысль, что в Скайриме почему-то дворян больше чем их слуг? История учит нас, что должно быть как раз наоборот. Вы также не задумывались о том, что в Гильдии Воров до вашего прихода были одни бездари, ведь так легко прокрасться в дом любого дворянина и спереть оттуда все. что только вам вздумается?\r<br />- Плагин добавляет в игру слуг дворян в их резиденции, некоторые из этих слуг даже сопровождают своих работодателей, когда они идут в такие места, как например городской рынок. Более того, когда вы заявляетесь к ним в &#34;гости&#34; и если они ничем не заняты они будут следить за гостем, чтобы убедится в том, что он не вор.\r<br />- Так что потенциальным &#34;домушникам&#34; я советую после установки модификации проводить свои операции более осторожно, заранее узнать свою цель и желательно дождаться ночи, когда все улягутся спать.\r<br />- А, и кстати, в Винтерхолде теперь будет садовник (но он не будет следить за вами, чтобы убедиться что вы не вор)\r<br />\r<br />*Посетители таверн*\r<br />- В оригинальной игре достаточно моментов, когда вы зайдя в постоялый двор или таверну слышите поющего баллады барда, однако при этом таверна пуста. Странно ожидать что при таком малом заселении Скайрима в небольших поселках и городках будет много посетителей в этих местах, пожалуй за исключением вечера.\r<br />- Постоялые дворы в городах и существуют для того, чтобы привлекать к себе людей со всего света для торговли и различной коммерции. &#34;Несущественные NPC&#34; добавляют в игру обитателей таверн и постоялых дворов. Они не будут особенно заинтересованы в том чтобы выпить с вами, так как ведут здесь свой сомнительный бизнес и в этом бизнесе нет места для Драконорожденного. Также некоторые из них могут быть встречены на городском рынке и в других различных городских магазинах.\r<br />\r<br />*Скупщики краденого*\r<br />- Вас не бесит, что Гильдия Воров наложила монополию на скупку краденого? Правдиво ли то, что все воры, карманники и грабители Скайрима состоят в одном преступном синдикате,чья штаб-квартира находится в канализации Рифтена?\r<br />- &#34;Несущественные NPC&#34; добавляют скупщиков краденого в каждый город Скайрима, за исключением Рифтена ( по вполне понятным причинам). Эти скупщики никак не связаны с Гильдией, так что ваш статус в Гильдии не окажет на них и их расценки никакого влияния, а так как они являются &#34;свободными пиратами&#34; их основной интерес не скупать у вас все награбленное вами, а быстро столкнуть тот краденый товар который они уже закупили ранее.\r<br />- Эти скупщики не так глупы, чем те кто &#34;расслабляется&#34; в тоннелях Рифтена. Они не носят воровских одежд чтобы не выдать себя перед стражниками и они не живут в канализации как &#34;черепашки-ниндзя&#34;, предпочитая выглядеть наподобие добропорядочных граждан, так что вам придется держать ухо востро, если вы захотите воспользоваться их услугами...\r<br />\r<br />*Торговцы*\r<br />- Города существуют для того, чтобы в них происходила безопасная торговля и различная коммерческая деятельность, но количество торговцев в игре явно не соответствует этому утверждению\r<br />- Поэтому модификация добавляет новых торговцев в тех областях игры, которые как будто предназначены для этого.. однако вы не найдете рядом с ними телег с товарами,торговых киосков или прилавков заваленных рыбой, плагин просто добавляет торговцев в эти места без размещения тонны объектов и не влияя на производительность игры.\r<br />- В настоящее время пока добавлены скорняк Флетчер в Солитьюде и рыбак Мунгер в Доках Виндхельма. Дополнительные торговцы будут добавляться по мере обновления модификации.\r<br />\r<br />*Рабочие*\r<br />- Чтобы сгладить дворянское перенаселение Скайрима, плагин добавляет в игру рабочих и трудящихся во все крупные города Скайрима.\r<br />- Они трудятся днем в режиме нон-стоп, чтобы обеспечивать атмосферную поддержку действующей социальной городской инфраструктуры.\r<br />- В течении дня они занимаются черновой работой...ремонтируют окна, таскают воду,рубят дрова, разносят почту и так далее.\r<br />- Ночью они собираются в тавернах и постоялых дворах для того чтобы еще более &#34;оживить&#34; эти места. некоторые из них истовые веропоклонники и предпочитают вечером отправляться в ближайший храм чтобы вознести своим богам молитвы.\r<br />\r<br />*Родственники*\r<br />- В Скайриме бушует гражданская война и посещая некоторые районы возникает чувство что здесь только что прокатилась чума. Почему многие &#34;селяне&#34; которых вы встречаете во время ваших приключений живут в одиночку? Где пожилые и молодежь? Если взрослые отправились на войну, то где все старики и дети?\r<br />- &#34;Несущественные NPC&#34; добавляют в игру некоторое количество родственников таким одиноким семьям в крупные поместья вокруг городов, если члены этих семей не задействованы в квестах.\r<br />- Все они имеют одну или более &#34;сцен&#34; диалогов с ванильным NPC-родственником.\r<br />- Если любой из членов этой семьи умрет по каким-либо причинам, диалоги оставшихся в живых членов будут отражать эту утрату.\r<br />\r<br />*Сторож Коллегии*\r<br />- Маги в Коллегии Винтерхолда в действительности должны не любить Драконорожденного. Например, они ведь послали не кого-нибудь, а преподавателя Фаральду ко входу в Коллегию чтобы та остановила егоее и никого другого, ведь остальные студенты на территорию Коллегии допускаются свободно.\r<br />- Исходя из этого видимо, не настолько уж и важно, что Ярл Корир и местные  жители могут сколько угодно обвинять магов в Великом Коллапсе уничтожившим их город, ведь кроме Драконорожденного никто не сможет причинить вреда Коллегии, верно?\r<br />- Теперь в Коллегии появится &#34;сторож&#34;, который является ярким прмером того, чего можно добиться если относится к учебе спустя рукава. В его обязанности входит следить за теми кто приходит в коллегию и предупреждать об этом магов.\r<br />- В перерывах между &#34;доносами&#34; на студентов нарушающих комендантский час и сдерживании местных пьянчужек от попыток разрушения моста он будет ругать последними словами Драконорожденного всякий раз когда вы будете пересекать мост.\r<br />\r<br />*Глашатай*\r<br />- Солитьюд столица Скайрима и сердце администрации Империи. До смерти верховного короля, все законы принимались в Солитьюде и только после этого информация о них доносилась до жителей других городов. Как столица, город должен привлекать большое количество туристов и гостей из дальних стран и отдаленных уголков Скайрима, больше чем любой другой город в стране.\r<br />- &#34;Несущественные NPC&#34; добавляют в Солитьюд городского глашатая, который ответственен за донесение важной информации до горожан и городских гостей.\r<br />- Глашатай в настоящее время имеет в общей сложности 12 различных комплектов выступлений, некоторые из которых зависят от того какая в данный момент политическая ситуация в стране и обновляются по мере развития этой ситуации с гражданской войной. И да, ему безразлично кто такой Драконорожденный...\r<br />\r<br />*Окружение Ульфрика*\r<br />- В действительности речи Ульфрика невероятно скучны и предназначены непонятно для кого, ведь как правило их выслушивают Йорлейф и Галмар. Если у него нет аудитории, перед которой он может потренироваться в своих речах, то как он может произвести впечатление на свой королевский двор?\r<br />- Плагин добавляет в тронный зал Ульфрика пару Танов,потомственных влиятельных дворян, которым не нужно рисковать своей жизнью, сражаясь вместе с Братьями Бури, но которые будут читать всем нотации (в том числе и Ульфрику)о том, что истинный норд должен бороться за свое будущее.\r<br />- Они преисполнены бахвальством, что как известно убавляет храбрость, поэтому не ожидайте что они отдадут свои жизни защищая Ульфрика при штурме Виндхельма Империей. Они должны пережить этот момент, чтобы впоследствии ругать Драконорожденного за его роль в лишении их высокого статуса.\r<br />\r<br />Требования:\r<br />Версия игры 1.9.32.0.8 и выше\r<br />\r<br />Рекомендации (необязательно, это чтобы NPC имели различные одежды):\r<br />- Зимние плащи - Winter is Coming\r<br />- Наборы брони - Immersive Armor\r<br />- Патч для этих модов будет работать только если они у вас установлены оба мода сразу\r<br />\r<br />Установка:\r<br />- Скачайте &#34;Основной мод&#34; и опциональный патч для пользователей модами &#34;Зимние плащи - Winter is Coming&#34; и &#34;Наборы брони - Immersive Armor&#34; (для данного патча у вас должны быть установлены оба мода сразу &#34;Winter is Coming&#34; и &#34;Immersive Armor&#34;, по отдельности патч не будет работать)\r<br />- Сделайте чистое сохранение в новом слоте сохранений перед установкой данного плагина\r<br />- Поместите файлы из основного мода в папку Data в игре и подключите esp-файл в лаунчере\r<br />- Если у вас установлены моды &#34;Зимние плащи - Winter is Coming&#34; и &#34;Наборы брони - Immersive Armor&#34;, то установите патч\r<br />- Если у вас установлены эти моды, то данный мод &#34;Несущественных NPC&#34; должен в лаунчере стоять ниже модов на плащи и броню\r<br />\r<br />Как обновится с предыдущей версии:\r<br />1) Отпустите любых наемников или NPC из этого мода которых вы завербовали\r<br />2) Зайдите в любой интерьер, в любом городе,(кроме Виндхельма), помещение где нет NPC и сделайте новое сохранение в новый слот сохранений (не F5)\r<br />3) Удалите предыдущую версию мода,файлы Inconsequential NPCs.esp и Inconsequential NPCs.bsa из папки Skyrim/data/\r<br />4) Установить новую версию мода и загрузитесь с чистого сохранения которое вы сделали\r<br />\r<br />Удаление:\r<br />- Расстаньтесь с любым из нанятых вами наемников из этого плагина\r<br />- Если вы недавно пользовались услугами &#34;девочек&#34; или &#34;наркоманов&#34;, подождите пока рассеется эффект &#34;расслабление&#34; (он длится один игровой час, проверить можно на вкладке &#34;Активные эффекты&#34;)\r<br />- Сделайте новый сейв где-нибудь в интерьере без NPC\r<br />- Удалите файлы плагина из папки &#34;Data&#34;\r<br />\r<br />Совместимость:\r<br />- Не совместим с модами которые полностью изменяют города,за исключением ретекстуров городов\r<br />- Совместим с модами добавляющих NPC\r<br />- Совместим с модом &#34;Expanded Towns and Cities&#34; - патч имеется в моде &#34;Expanded Towns and Cities&#34;\r<br />\r<br />Порядок загрузки в лаунчере:\r<br />\r<br />- Если у вас установлены моды Winter is Coming и Immersive Armor,то порядок следующий\r<br />- 1nivWICCloaks - мод Winter is Coming (если установлен данный мод)\r<br />- hothtrooper44_ArmorCompilation.esp - мод Immersive Armor (если установлен данный мод)\r<br />- Cutting Room Floor.esp - мод &#34;Cutting Room Floor&#34;\r<br />- Inconsequential NPCs.esp - данный основной мод &#34;Несущественные NPC&#34;\r<br />- Inconsequential NPCs - CRF Compatibility Patch.esp - патч для мода &#34;Cutting Room Floor&#34;\r<br />- Inconsequential NPCs – Enhancement.esp - патч для Winter is Coming и Immersive Armor\r<br />\r<br />==============\r<br />Озвучка:\r<br />==============\r<br />Anna Castiglioni / Anduniel - Female College Student (http://annaincharacter.webs.com)\r<br />Emma Moon / Hotemochick1992 - Child Apparition\r<br />Jeremy King / Vulon - Foreign Envoys, Maven&#39;s Bodyguard, Solitude Town Crier (https://www.youtube.com/watch?v=8u9ou8NmRSY)\r<br />Matthew Wade / lomekian - Male Thalmor Agent (http://www.matthewwade.co.uk)\r<br />Mauri Majanoja / Darkblade - Windhelm Thane\r<br />Nathan Wilkinson / Flanxei - Male Apparition, Male College Student\r<br />Phillipa Robinson / Evil Seedlet - Female Thalmor Agent\r<br />Serithi - Windhelm Thane\r<br />\r<br />================\r<br />Credits:\r<br />================\r<br />- Thanks for the great TW2 conversions, LordOfWar.\r<br />- Thanks to the voice actors and their excellent work.\r<br />- Thanks to the Oblivion/Fallout 3/Fallout: NV/Skyrim modding community for all the advice and assistance over the years.\r<br />- Thanks to the &#39;meta-modders&#39; for their work on bringing modding tools and utilities to the Skyrim community.\r<br />- Thanks to DarkOne and Nexus staff for making the Nexus the best site for Skyrim mods.\r<br />- Thanks to Bethesda for Skyrim. ",
  "categoryId": "33",
  "version": "1.9e",
  "author": "by ripple translated by kopasov",
  "createdUnix": "1390562662",
  "updatedUnix": "1435218539",
  "containsAdultContent": false,
  "uploadedBy": "kopasov",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000110401",
      "name": "Inconsequential NPCs - Cutting Room Floor Compatibility Patch-v1-0",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "Inconsequential NPCs - Cutting Room Floor Compatibility Patch-v1-0-50284-1-0.7z",
      "uploadedUnix": "1401006246",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/82d6c361f69f203d5972e0ecfda59ee5f80e1097f03b5f4ff86a1dccc63dc482/analysis/1408096037/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inconsequential%20NPCs%20-%20Cutting%20Room%20Floor%20Compatibility%20Patch-v1-0-50284-1-0.7z?fid=1000110401&ttl=1535831892&ri=8192&rs=8192&setec=8a791e399650d29e819d647ce02713a6"
    },
    {
      "fileId": "1000112608",
      "name": "Inconsequential NPCs Enhancement Module-1-3e",
      "version": "1.3e",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Inconsequential NPCs Enhancement Module-1-3e-50284-1-3e.7z",
      "uploadedUnix": "1402480136",
      "modVersion": "1.3e",
      "virusScanUrl": "https://www.virustotal.com/file/a657a47a550ee90ed7eed1a8918de567f5feef1a5e768102b98a2da9438cbdba/analysis/1408121831/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inconsequential%20NPCs%20Enhancement%20Module-1-3e-50284-1-3e.7z?fid=1000112608&ttl=1535831892&ri=8192&rs=8192&setec=49a289dbb40f55e39c3d7bc73b2fa747"
    },
    {
      "fileId": "1000112721",
      "name": "Inconsequential NPCs-1-9a",
      "version": "1.9a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51926",
      "fileName": "Inconsequential NPCs-1-9a-50284-1-9a.7z",
      "uploadedUnix": "1402559208",
      "modVersion": "1.9a",
      "virusScanUrl": "https://www.virustotal.com/file/830b037483fa40fbae061537a32a8e3cef27df072da1488858863c2598ddcd14/analysis/1408123080/",
      "changelogHtml": " Обновление:1-9а\r<br />- Исправлена ошибка когда у стражников которые стоят возле ворот при входе в доки Виндхельма отстутствовал пакет диалогов и приветствий, также исправлена проблема сопровождения неугодных за ворота. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inconsequential%20NPCs-1-9a-50284-1-9a.7z?fid=1000112721&ttl=1535831893&ri=8192&rs=8192&setec=8cd8135b85e3991d46145124acbe4098"
    },
    {
      "fileId": "1000118200",
      "name": "Inconsequential NPCs-1-9b",
      "version": "1.9b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51926",
      "fileName": "Inconsequential NPCs-1-9b-50284-1-9b.7z",
      "uploadedUnix": "1405756640",
      "modVersion": "1.9b",
      "virusScanUrl": "https://www.virustotal.com/file/504b50aa29ae350b75d3472a6694f42c30cbd32b9aa4c1cb9812b379708ff928/analysis/1405756707/",
      "changelogHtml": " Обновление:1-9b\r<br />- Исправлена ошибка с убеждением стражников у ворот в Виндхельме, когда если у вас красноречие прокачано на 100, то вы все равно не могли убедить стражу и не могли пройти в город\r<br />- Сниженено требование к уровню &#34;Красноречия&#34; для убеждения\r<br />- Добавлена система приветствия для некоторых NPC, которые бездействуют и ничего не делают <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inconsequential%20NPCs-1-9b-50284-1-9b.7z?fid=1000118200&ttl=1535831893&ri=8192&rs=8192&setec=0423ea0e46a54408af69363847eeb24b"
    },
    {
      "fileId": "1000127812",
      "name": "Inconsequential NPCs-1-9c",
      "version": "1.9c",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51928",
      "fileName": "Inconsequential NPCs-1-9c-50284-1-9c.7z",
      "uploadedUnix": "1411289775",
      "modVersion": "1.9c",
      "virusScanUrl": "https://www.virustotal.com/file/ba9d9682d762bf1462f5bf80926e4b3f663b7fba5f2bb4c41b4817edcb2d22b7/analysis/1411289889/",
      "changelogHtml": " - Добавлены спальники и кровати для некоторых NPC и отредактированы AI пакеты у NPC соответственно\r<br />- Исправлены мелкие недочеты и некоторые AI пакеты у NPC\r<br />- Поправлен перевод в названиях, &#34;Беспризорники&#34; в игре были как &#34;Урчин&#34;, теперь будут &#34;Беспризорники&#34;, а так же поправлены названия наркоманов, мужской NPC был как &#34;Наркоманка&#34; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inconsequential%20NPCs-1-9c-50284-1-9c.7z?fid=1000127812&ttl=1535831893&ri=8192&rs=8192&setec=15c5a617d7f0421a82b52bb0d585b674"
    },
    {
      "fileId": "1000161075",
      "name": "Inconsequential NPCs 1 dot 9d",
      "version": "1.9d",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51954",
      "fileName": "Inconsequential NPCs 1 dot 9d-50284-1-9d.7z",
      "uploadedUnix": "1432285216",
      "modVersion": "1.9d",
      "virusScanUrl": "https://www.virustotal.com/file/e1c4e9a064cdd683f3946098fe7c6ecee07e9af56c1f9b52673b2bdd5050ac90/analysis/1432285271/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inconsequential%20NPCs%201%20dot%209d-50284-1-9d.7z?fid=1000161075&ttl=1535831894&ri=8192&rs=8192&setec=b4dbf463f2f80e22627b63ade7c6b0a9"
    },
    {
      "fileId": "1000165360",
      "name": "Inconsequential NPCs-1-9e",
      "version": "1.9e",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "51954",
      "fileName": "Inconsequential NPCs-1-9e-50284-1-9e.7z",
      "uploadedUnix": "1435218539",
      "modVersion": "1.9e",
      "virusScanUrl": "https://www.virustotal.com/file/58bb3be9085cab1b7ef96a47a3520606b82c12f84978e901ff2286522b4ed80b/analysis/1435218611/",
      "changelogHtml": " - Изменена система переключения стражников Виндхельма которые стоят у ворот, во время Гражданской войны, сражники не менялись после захвата города Имперцами <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inconsequential%20NPCs-1-9e-50284-1-9e.7z?fid=1000165360&ttl=1535831894&ri=8192&rs=8192&setec=f6fd8582207f605243621bae17f677aa"
    }
  ]
}