{
  "modId": 50282.0,
  "modName": "Dagons Legions - Dremora Overhaul",
  "summary": "Meet the new Dremora armies.",
  "descriptionHtml": "Dremora have taken huge steps backward from both Morrowind and in Oblivion, in terms of both looks and functionality.\r<br />\r<br />So I&#39;m taking them in a new direction in both areas. I&#39;m playing up the fearsome, demonic aspect of the Dremora over the weird, frail-looking goats Bethesda gave us in Skyrim, and I&#39;m bringing them diversity and new weapons.\r<br />\r<br />These are...\r<br />\r<br />[size=8][color=orange][center]Dagon&#39;s Legions[/center][/color][/size]\r<br />\r<br />[size=6][color=red]Where did you get that?[/color][/size]\r<br />\r<br />Rather than wield glass battleaxes or iron daggers that they got from who-knows-where, Dremora will now only carry three types of weapons: Dremora, Ebony, or Daedric. Dremora weapons are scaled similar to Oblivion. They are slightly better than Elven weapons, but come at a disadvantage with their very large weight and poor speed. They cannot be tempered or crafted, but they can be looted.\r<br />\r<br />[size=6][color=red]Grunts don&#39;t have Gravity Hammers[/color][/size]\r<br />\r<br />Churls will now carry maces, mages will carry daggers, higher ranks will wield swords and sometimes shields, and Markynaz and Valkynaz will have a chance of carrying enchanted weapons. Kynmarchers will have a chance of wielding ebony, while Valkynaz will only ever wield Daedric. Oh, and the Valkynaz--well--let&#39;s just say for every one you kill there is a small chance of finding a very powerful throwback to Oblivion.\r<br />\r<br />[size=6][color=red]They&#39;re horny&#33;[/color][/size]\r<br />\r<br />Low ranks of Dremora have the tiny goat horns from Bethesda, but as you work your way up their horns will change until you face the fearsome crown of the Dremora Lord. Eyes and facial tats (HD face tats made by Hallgerth) now signify rank as well, although they are much more subtle.\r<br />\r<br />[size=6][color=red]Which one is the she-elf?[/color][/size]\r<br />\r<br />Before all Dremora had the same face. The EXACT. SAME. FACE. This mod livens it up a bit with different hairstyles, hair colors, facial proportions, and new HD facial tattoos for Dremora by Hallgarth. No two Dremora look the same (unless they both spawn that way). Valkynaz look particularly ferocious, as they should.\r<br />\r<br />[size=6][color=red]Don&#39;t forget to wear a helmet[/color][/size]\r<br />\r<br />Now most Dremora will have a 50% chance of spawning with a helmet. Just like in Oblivion. Also, low ranks of Dremora will carry a Dremora Shield.\r<br />\r<br />[size=6][color=red]A pirate&#39;s life for me[/color][/size]\r<br />\r<br />Yes, I did him too.\r<br />\r<br />[size=6][color=red]Seven is the perfect number[/color][/size]\r<br />\r<br />Adds back in the 5th rank of Dremora, the Kynmarcher, making seven in total.\r<br />\r<br />[size=6][color=red]Now where did I put that?[/color][/size]\r<br />\r<br />Dremora archers were fully rigged up and ready to go in the CK, but it turns out they never spawn anywhere. Warlocks, too, had limited spawn points. Now with every Dremora spawn there is a good chance he&#39;ll be an archer or a mage.\r<br />\r<br />HIGHLY RECOMMENDED:\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/30612/?]Glorious Daedric Retexture[/url]\r<br />\r<br />It is what I am using in these screenshots.\r<br />\r<br />[size=5][color=yellow]I&#39;d like to say a big thank you to the following artists for the use of their work in this mod:[/color][/size]\r<br />\r<br />Pema Mendez and Xenius for eye assets\r<br />Hallgarth for HD Dremora Detail Maps - http://www.nexusmods.com/skyrim/mods/45407/?\r<br />NPR, KURESE, and Th3Mut4nt for Astaroth Horns and Suit (I modified the textures for this mod) - http://www.nexusmods.com/skyrim/mods/49847/?\r<br />nuska for normalmap\r<br />mackom for face texture\r<br />\r<br />Everything in this mod can be used freely, as the work I used was also free.",
  "categoryId": "79",
  "version": "1.0",
  "author": "BetrayalSeeker",
  "createdUnix": "1390589529",
  "updatedUnix": "1390578969",
  "containsAdultContent": false,
  "uploadedBy": "BetrayalSeeker",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093117",
      "name": "Dagons Legions - Dremora Overhaul",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8381",
      "fileName": "Dagons Legions - Dremora Overhaul-50282-1-0.7z",
      "uploadedUnix": "1390578969",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0d92120efccecdad6442e2ff6816fc8b4ed12c550347743715aa6ceebbd06bb3/analysis/1407899731/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dagons%20Legions%20-%20Dremora%20Overhaul-50282-1-0.7z?fid=1000093117&ttl=1535831888&ri=8192&rs=8192&setec=a12879dc48893d77b8cb05b571fc1632"
    }
  ]
}