{
  "modId": 50317.0,
  "modName": "King of Bandits ADULT PLAYER HOME",
  "summary": "Be the King/Queen of a group of Bandits/Slavers",
  "descriptionHtml": "&#33;&#33;&#33;&#33;ATTENTION&#33;&#33;&#33;&#33;\r<br />I am aware of the big gaping hole at the entrance of the den&#33; The den currently really has no use except the merchants and One-Eye. PLEASE bare with me and ignore it until the next update. If it is just impossible for you to look at, after leaving through the den back door (onto the bridge) you will gain a map marker and won&#39;t have to use the den&#39;s trap door again. I promise this will be fixed in the soon-to-come update&#33;&#33;\r<br />\r<br />\r<br />NOTE: The EMPTY version has an empty slave pit and empty sex-slave area. This is for users who use Paradise Halls and wish to put their own slaves in the prisons&#33; To install the EMPTY version, install the main file, then install the EMPTY version, when asked to over-write the BanditKing.esp say YES.\r<br />\r<br />NOTE 2: I have noticed that One-Eye might be a bit TOO over powered. So in the next update I will be nerfing his power slightly. (On a level 100 novice test run he was 1-hitting leveled creatures&#33;)\r<br />\r<br />\r<br />This mod was started for simply personal use to brush up on my modding skills due to going over a month or two without even opening the CK, but by the time I started creating the One-Eye follower, I decided I would share it with the Nexus.\r<br />\r<br />Before I get into what this mod is about, keep in mind the home is in a very popular home area, the Dark Water Pass area. It will most likely conflict with any mod in the same area. If that is the case, but you want to use the followers I&#39;ve added, I made a standalone version of one of the followers, One-Eye. To get him without using this home mod, you can find him here: One-Eye Follower\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Ok, now, onto what this is about&#33;&#33;\r<br />\r<br />I built this mod for personal use along-side the Adult Prostitution and Paradise Halls Slavery mods, however this mod does not, nor will it ever, require either of those mods.\r<br />\r<br />It is a pretty large player home, consisting of 2 main interiors (parts of the second interior being separated by load doors) as well as an exterior. To get to the exterior area, you must first go through the first interior (only the first time, after that you will be able to fast travel to the exterior area).\r<br />\r<br />The Bandit&#39;s Den - The first area\r<br />\r<br />This area consists of many things. One thing to keep in mind is this is NOT a safe area. Do NOT store your items in the Bandit&#39;s Den&#33; They will disappear&#33;&#33;\r<br />\r<br />The Bandit&#39;s Den consists of the Entrance, which is guarded by a brutish doorman. A tavern filled with friendly Bandits and a merchant to sell you all of your alcoholic and skooma needs&#33; \r<br />\r<br />A sex shop, filled with women and a single man sex-slave, as woman and men who do not like women (sorry, I&#39;m not up to date on politically correct terms) also play this game. The sex slaves are currently not functional. There is a merchant NPC in the area, but will not sell sex to players or other NPCs at this time.\r<br />\r<br />Two gambling areas. The first, a dog fight zone. At some point, I, or possible someone else, may add scripts to let players and NPCs alike bet on dog fights, this area currently has no function at all, there is not even dogs in the cages. The second gambling area is the Slave Fights. Same as the dog fights, this area currently does not function, as the needed scripts are beyond my knowledge, however, there is a single slave in the cage, One-Eye. I&#39;ll get into more information about One-Eye shortly.\r<br />\r<br />The final area is a large room filled with beds where all the Bandits sleep. Nothing big, just put it there for realism reasons, even though the Bandits&#39; AI packages do not currently permit them to sleep at night, but instead just sandbox in the above listed areas.\r<br />\r<br />The exterior of the home consists of a large Bandit cache tower filled with crates and daedric/ebony weapons&#33; (Sorry about no dragonbone, I didn&#39;t want to use any DLCs in the mod). The weapon wracks holding the daedric/ebony weapons are NOT safe to store your own weapons in. They should respawn their currently held weapons instead. For cheaters, this could be a nice money maker, for hardcore gamers, it&#39;s purely decorative. \r<br />\r<br />The next interior is the Bandit King&#39;s Fortress. It is safe to store all of your items in this interior&#33; As well as the other interiors connected by load-doors. This area holds 4 other followers, as well a nice, big throne for the King/Queen of Bandits, surrounded by the 4 most beautiful slave girls in the entire mod&#33;\r<br />\r<br />The door to the Vault can be tricky. There is a lock to the lower left of the door, if you can&#39;t find it, refer to the screenshots. Inside the vault is 5 mannequins, a massive gold pile, barrels filled with gold, all 8 vanilla dragonpriest busts, 2 weapon plaques, 1 shield plaque and 8 display cases. A vault truly fit for the leader of Bandits/Slavers, eh?\r<br />\r<br />The Chambers has a double bed, another beautiful slave, enchanting/alchemy labs, 1 mannequin and a lot of storage room.\r<br />\r<br />The Slave pits is filled with slaves (16 all together). From a roleplaying perspective, these are slaves who are awaiting their time in the fight pits or the sex shop (Male Slaves are forced to fight, female slaves are forced to be... erm... you get the idea).\r<br />\r<br />\r<br />\r<br />\r<br />The Followers\r<br />\r<br />One-Eye\r<br />[img]http://s30.postimg.org/cl45erfmp/One_Eye12.jpg[/img]\r<br />\r<br />\r<br />If you&#39;ve seen the movie Valhalla Rising, you already know this guy is a MONSTER&#33;&#33; But if you haven&#39;t, I suggest you do so immediately. One-Eye is a mute slave, and a bloodthirsty one. Because of his absolute ability to kill anyone or anything in his way, he is slightly over-powered. Not TOO much, at higher levels, dragons might still make him bleed-out, MIGHT. His max level is 500 and his HP/Stamina/MP all go up 2,000 each level, and he levels with the player. You can find a chest with his gear in it near the entrance to the Slave Fighting area. The chest is called One-Eyes gear. It will give you his axe and clothing, which is probably better than any armor you would give him anyway.\r<br />\r<br />\r<br />Bjorn\r<br />[img]http://s10.postimg.org/4ilwgqhpl/Bjornhead.jpg[/img]\r<br />\r<br />Bjorn, as well as the next 3 followers are Bandits. They are strong, but One-Eye could probably take all 4 of them on by himself. They have default responses (no custom dialogue/voices) but they&#39;re mean and look pretty scary too, as all bandits should. He didn&#39;t get that Glasgow Smile or blind eye because he&#39;s too happy, thats for sure.\r<br />\r<br />Borhilda\r<br />[img]http://s27.postimg.org/rlhmttjnn/Borhildahead.jpg[/img]\r<br />\r<br />Borhilda may be even more beautiful looking than some of the King&#39;s personal slaves, but she&#39;s too mean to keep captive. She&#39;s a cut-throat bandit, and like the other 3, is a potential marriage candidate, so ready your ring fingers for this wild-cat.\r<br />\r<br />Gluck\r<br />[img]http://s27.postimg.org/h7ul5t32b/Gluck_Head.jpg[/img]\r<br />\r<br />Gluck&#39;s a blind Orc. Blind but powerful. And, seemingly his other senses have advanced enough that you won&#39;t even realize he&#39;s blind if you don&#39;t look at his eyes&#33;\r<br />\r<br />Grashak\r<br />[img]http://s29.postimg.org/8x98hcogn/Grashak_Head.jpg[/img]\r<br />\r<br />Devious, powerful, cut-throat, angry..... and not bad looking for an Orc made of pixels&#33; Go ahead, take her with you. She&#39;s sure to kill stuff.\r<br />\r<br />\r<br />\r<br />\r<br />Future Plans/Hopes:\r<br />1. Integration with Paradise Halls Framework so that the collars remain decorative without PHalls installed, but registers the slaves automatically when it is.\r<br />\r<br />2. Functional Dog/Slave fights with gambling.\r<br />\r<br />3. Possible integration with Alternative Start (or similar mod) to allow the criminal start to start the player off inside the home as King of Bandits with both mods installed.\r<br />\r<br />4. Freeing One-Eye from being a slave and inviting him as a follower for winning so many fights after the Slave Fights is functional. (current dialoge to ask to follow and etc is default, he just replies with silence).\r<br />\r<br />5. Who knows...\r<br />\r<br />\r<br />\r<br />PERMISSIONS:\r<br />NONE&#33;&#33; If you wanna use anything in this mod, you have to ask me directly. If the assests belong to someone else (check the credits) you have to ask them directly.\r<br />\r<br />PM me if you would like to/be willing to help create the scripts to make the dog fights and slave fights work, as well as make the sex slaves cost gold through the merchant NPC with AP integration. Full credit will be given to any help.\r<br />\r<br />\r<br />CREDITS:\r<br />Northborn for One-Eyes and Bjorn&#39;s scars - Northborn Scars\r<br />Layam for the slave collars - Paradise Halls\r<br />FranklinZunge for One-Eye&#39;s clothing - Colovian Leather Armor\r<br />Misanthropia for One-Eye&#39;s axe - Viking Weaponry\r<br />Runs & Stroti for many of their resources. I can&#39;t remember which items came from which resources, so just know without them and their meshes/textures, this mod would be lacking a lot of the static stuff&#33;",
  "categoryId": "67",
  "version": "1.0",
  "author": "Saint Grimm",
  "createdUnix": "1390623400",
  "updatedUnix": "1391024524",
  "containsAdultContent": true,
  "uploadedBy": "saintgrimm92",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093244",
      "name": "Bandit King Full Main 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "45252",
      "fileName": "Bandit King Full Main 1_0-50317-1-0.rar",
      "uploadedUnix": "1390623276",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f6e8542bb59969aef5de86c78344fb7a747056949183492e346730ae37145136/analysis/1407900656/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bandit%20King%20Full%20Main%201_0-50317-1-0.rar?fid=1000093244&ttl=1535831952&ri=8192&rs=8192&setec=4b316b6a3f899182b0fd98935530170d"
    },
    {
      "fileId": "1000093245",
      "name": "Bandit King EMPTY 1_0",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Bandit King EMPTY 1_0-50317-1-0.rar",
      "uploadedUnix": "1390623375",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cb00d33111457acd7d9c51d011a963dd156b25d29aa7cf713a8b7ba6bea09cef/analysis/1407900722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bandit%20King%20EMPTY%201_0-50317-1-0.rar?fid=1000093245&ttl=1535831953&ri=8192&rs=8192&setec=093c9dccf8366d59c6e6a5590d771cfb"
    },
    {
      "fileId": "1000094110",
      "name": "Bandit King Full Main 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45253",
      "fileName": "Bandit King Full Main 1_1-50317-1-1.rar",
      "uploadedUnix": "1391024524",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/94e0f5619a0b5976a5c0a1b91dc1036b0b58be1362a7e498f83bba88b32f1fbf/analysis/1407907634/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bandit%20King%20Full%20Main%201_1-50317-1-1.rar?fid=1000094110&ttl=1535831954&ri=8192&rs=8192&setec=abeab6fa0b6a2808861811977312d633"
    }
  ]
}