{
  "modId": 50311.0,
  "modName": "Fire Emblem Hero Companions",
  "summary": "This mod adds an assortment of heroes from a variety of Fire Emblem games. Mainly from Path of Radiance right now, and several from earlier games.",
  "descriptionHtml": "This mod adds an assortment of heroes from a variety of Fire Emblem games. Mainly from Path of Radiance right now, and several from earlier games. I will be adding more from requests and from heroes I like in the different games.\r<br />\r<br />All of these heroes are Followers, Essential, Marriageable, and have Local Dismissing.\r<br />\r<br />Most of them have Light foot to avoid traps (A scatter one might be missing it who I forgot to give it to).\r<br />\r<br />Right now includes:\r<br />\r<br />Ike - 1-Handed Warrior (Blades, Armsman) - Riverwood\r<br />\r<br />Soren - Mage (Destruction, Conjure, Alteration) - Bleak Falls\r<br />\r<br />Mist - CombatMonk (Restoration, Alteration) - Riverwood\r<br />\r<br />Elincia - 1-Handed Warrior (Blades, Armsman) - Whiterun\r<br />\r<br />Boyd - 1-Handed Warrior (Armsman, Hack, Axes) - Farm outside of Whiterun\r<br />\r<br />Oscar - 1-Handed Warrior (Blades, Armsman) - Farm outside of Whiterun\r<br />\r<br />Wolt - Scout (Ranger. Bows) - Farm outside of Whiterun\r<br />\r<br />Gatrie - 1-Handed Warrior (Armsman, Shieldwall) - Whiterun\r<br />\r<br />Nephenee - 1-Handed Warrior (Blades) - Ivarstead\r<br />\r<br />Astrid - Ranger (Bow, Stealth) - Trying to run away... never got far, imprisoned. Engaged to Harrald (Ack&#33;)\r<br />\r<br />Lucia - Assassin (Blades, Dual, Stealth) - Whiterun\r<br />\r<br />Micaiah - Mage (Destruction, Conjure, Alter, Restoration) - Winterhold\r<br />\r<br />Sothe - Lockpick Rogue (Dual, Blades, Lockpick, Stealth) - Imprisoned\r<br />\r<br />Lyn - Nightingale (Swords, Bows, Dual) - Dawnstar\r<br />\r<br />Nils - Bard (Blades, Bow, Illusion) - Working for a Jarl.\r<br />\r<br />Ninian - Bard (Blades, Bow, Illusion) - Bard College\r<br />\r<br />Lucina - I-Handed Warrior (Blades, Shields) - Solitude\r<br />\r<br />Jaffar - Assassin (Blades, Assassin, Stealth, Dual) - Secret Mission\r<br />\r<br />Heather - Rogue (Blades, Bows, Stealth, Dual) - Spy Mission\r<br />\r<br />Beowolf - 2-Handed Warrior (Greatsword, War Hammer, Batteaxe) - Markath\r<br />\r<br />Ayra - Assassin (Dual, Stealth, Blades) - Markath\r<br />\r<br />Sigurd - 1-Handed Warrior (Blades, Shields) - Solitude Palace\r<br />\r<br />\r<br />There are several secret characters hidden away, right now 3 others. I consider them Easter Eggs, and will be adding more later. You can find clues to where to find them through journals/notes in follower inventory. (Not completely added yet, see Sigurd in-game for an example).\r<br />\r<br />Companions are not just found in inns, check a variety of buildings, areas related to the towns listed.\r<br />\r<br />Forum Talk:\r<br />\r<br />-Only provide constructive suggestions. Anything I  decide is remotely rude I will block and report. I don&#39;t need to deal with people crap.\r<br />\r<br />-Don&#39;t ask questions about requirements or crash to desktops, this mod acts like any other companion mod and works fine.\r<br />\r<br />-Make sure you have the required files or you will CRASH. Get over it and fix it, not my problem.\r<br />\r<br />-If you don&#39;t like my choices in recommended mods or creative adaptations, that&#39;s your issue, not mine (Again block coming your way).\r<br />\r<br />REQUIRED FILES:\r<br />\r<br />-Apachihair Full 1.5\r<br />-Apachii Females 1.3\r<br />-Apachii Males 1.1\r<br />-More Hair Colors - http://www.nexusmods.com/skyrim/mods/14713/?\r<br />\r<br />Recommended but not required (I use these):\r<br />\r<br />-UFO\r<br />-Female Body Type, Calientes\r<br />-Better Males (Younger faces merged with men)\r<br />-Bella&#39;s Makeup\r<br />-Urshi Smooth face testures (Males)\r<br />-TERA Armor&#39;s\r<br />-Netherwalks Hirelings, Companions, and Housecarls.\r<br />-Bandana&#39;s (Ike and Boyd)\r<br />-Jaysus Swords\r<br />\r<br />INSTALLATION:\r<br />\r<br />-Copy the .esp file (Fire Emblem Companions Assorted) to your Data folder.\r<br />-Copy and paste the mesh and texture folders as well to data folder, merge with mesh and texture there when prompted.\r<br />-Activate in NMM \r<br />-(Or download via mod manager and install)\r<br />\r<br />REQUESTS:\r<br />\r<br />-Feel free to make any requests for followers from the worlds of Fire Emblem through the mods forum or PM me.\r<br />\r<br />Disclaimer:\r<br />\r<br />All of these characters are the properly of Nintendo Intelligent Systems. This version is my homage to their creations. They are merely adaptions in how I believe those characters would look in the world of Skyrim.\r<br />\r<br />Thank you to Bethesda, and to the many talented modders of the Nexus.\r<br />",
  "categoryId": "66",
  "version": "1.0",
  "author": "Scorpiovaeden",
  "createdUnix": "1390614540",
  "updatedUnix": "1390611507",
  "containsAdultContent": false,
  "uploadedBy": "scorpiovaeden",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093227",
      "name": "Fire Emblem Heroes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12157",
      "fileName": "Fire Emblem Heroes-50311-1-0.rar",
      "uploadedUnix": "1390611507",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5b9c7768af448d4127bc3a789157617cf4786d344dd4923761a47a41ae7d43da/analysis/1407900488/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fire%20Emblem%20Heroes-50311-1-0.rar?fid=1000093227&ttl=1535831945&ri=8192&rs=8192&setec=bc8ef6bbe80adb376a3edbf76592b196"
    }
  ]
}