{
  "modId": 50331.0,
  "modName": "Pale Elves",
  "summary": "Makes high and woods elf player characters have light-toned skin instead of yellowish or gray-brown.",
  "descriptionHtml": "Elves are pale right? Except those dark elves. Not in TES though, here they made high elves yellow (because being high they are valuable like gold?) and woods elves brownish gray (because they are made of wood?) Of course, they are free to do what they want with their fantasy world, like converting dwarves into absent elves of another variety, and orcs into a playable civilized race instead of the traditional monsters of fantasy. However, we don&#39;t need to like it, and that&#39;s what mods are for. \r<br />This mod makes High and Woods elves to have pale skin. It totally replaces the vanilla skins, so you can&#39;t go back to having jaundiced skin for your elves. There are other mods like More Elven Skin Tones by DataRomance, which do something similar, however they do so by adding pale skins to vanilla skins side by side (so you can still choose from both). This causes conflict with many mods that change faces, hair, presets etc for some reason. In Pale Elves I took a different approach that avoids these conflicts as far as I can tell. \r<br />\r<br />Incompatibilities \r<br />Probably with any other mod that directly modifies the High Elf or Woods Elf races in any way. \r<br />Version \r<br />1.0 Initial release",
  "categoryId": "34",
  "version": "1.0",
  "author": "Caralampio",
  "createdUnix": "1390657306",
  "updatedUnix": "1390656885",
  "containsAdultContent": false,
  "uploadedBy": "caralampio",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093301",
      "name": "Pale Elves",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Pale Elves-50331-1-0.zip",
      "uploadedUnix": "1390656885",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8173b2bc72eff2bc62194f1981b74708157dec6ab2c784bb06ff8621f6c569d0/analysis/1407901223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pale%20Elves-50331-1-0.zip?fid=1000093301&ttl=1535831978&ri=8192&rs=8192&setec=d180a3b240cef14b41f7dc0c3640aa77"
    }
  ]
}