{
  "modId": 5033.0,
  "modName": "Crests Mod Clan Hannay",
  "summary": "Another in my Line of Crests Mods",
  "descriptionHtml": "firstly, a few points.\r\n\r\n1) sorry for the Lack of activity recently, computer problems which lead to a full system restore, therefore i lost photoshop which is kind of essential.\r\n\r\n2) the Crests Mods are made to specifications of the person/s who requested its creation, if you dont like it, dont bitch about it in the comments, i dont care if YOU like it. this is made by request, not popular demand.\r\n\r\n3) any requests are to be PM\\'d (Private Messaged) i will NOT accept requests left via a comment because chances are i\\'ll forget about it before i get round to starting it. no PM, no mod.\r\n\r\n4) comment and endorse if you like, give feedback if not, (i realise this is a contradiction to point 2, but point 2 refers to people commenting \\'if you take the crest out it will look cooler\\' yeah... good Crest mod that!)\r\n\r\nnow, those points are LAW! if you break these rules your insides will turn purple and i\\'ll eat your soul. :)\r\n\r\nthis was a request by CrowDawg11 to change the Texture for the Whiterun guards to wear the Clan Hannay Tartan which in my humble opinion looks sweet as hell! check the screenshots and see what you think!\r\n\r\nbefore anyone asks, yes, i will be implementing this into my Tartan Stormcloaks mod. and the Stormcloaks in the Green Tartan in the \\'Pah\\' screenshot are from said mod.\r\n\r\nCallaghan04\r\n\r\nPermissions:\r\n\r\nask me if you want to use my Textures. if i agree to you using them, give me Credit and send me a link to your finished mod. use of my textures or uploading it without my permission will lead to a horrible death.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Callaghan04",
  "createdUnix": "1325382775",
  "updatedUnix": "1325382884",
  "containsAdultContent": false,
  "uploadedBy": "Callaghan04",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15590",
      "name": "Clan Hannay Whiterun",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1595",
      "fileName": "Clan Hannay Whiterun-5033-1-0.7z",
      "uploadedUnix": "1325382884",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/80200a3b3462eda796b53958355ab1380ed6e2d8cf5339f3b7c88085529cb4af/analysis/1406620842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clan%20Hannay%20Whiterun-5033-1-0.7z?fid=15590&ttl=1535761455&ri=8192&rs=8192&setec=47ce245f187094609c3f08d996c88543"
    }
  ]
}