{
  "modId": 50378.0,
  "modName": "Disband the Thieves Guild",
  "summary": "Want to get rid of the Thieves Guild in Riften, but you find killing them to harsh. Now you can arrest them and put them in jail. Be the Commander of the Guards in Riften and get rid of Riften&#39;s scum once and for all.",
  "descriptionHtml": "Translations\r<br />---------------\r<br />[url=http://www.nexusmods.com/skyrim/mods/57653/?][img]http://upload.wikimedia.org/wikipedia/commons/2/23/Flag_of_Poland_%28bordered%29.png[/img][/url]\r<br />Polish by LordTorus\r<br />\r<br />\r<br />Want to get rid of the Thieves Guild in Riften, but you find killing them to harsh. Now you can arrest them and put them in jail. Be the Commander of the Guards in Riften and get rid of Riften&#39;s scum once and for all by putting them in jail. NO SKSE or DLC required.\r<br />\r<br />Installation\r<br />---------------\r<br />Download and install with NMM (recommended). Install manually by placing the content of the mod in your Skyrim&#39;s Data directory and activate it through Wrye Bash or Skyrim Launcher &gt; Data Files.\r<br />\r<br />Requirements\r<br />-------------------\r<br />Latest version of Skyrim (1.9.32.0.8). NO DLC required, NO SKSE required and fully compatible with [url=http://www.nexusmods.com/skyrim/mods/28880/?]Destroy the Thieves Guild[/url]\r<br />\r<br />How to start the quest\r<br />--------------------------------\r<br />Talk to Jarl Laila Law-Giver in Riften&#39;s Mistveil Keep and ask her about the Thieves Guild. She will respond you that Maven is taking care of this but you should know better, tell her you will take this job upon your humble self and you will soon be approached by a corrupt guard which will tell you to back off. Report back to Laila, choose which fate should be called upon the corrupt guard (exile (Candlehearth Hall in Windhelm, execute or send him to prison). She will be impressed by your loyalty and grant you the title of Commander of the guards in Riften, your job : arrest all thieves one by one while wearing guards clothes (shield is optional/not required) by either persuading or brawling a Thieves Guild member and send them to the jail cell appointed by the quest marker. Do this until all thieves are behind bars and you get the objective to report back to Laila, receive you reward from her (3000 gold) and you can do the optional and experimental redemption part.\r<br />\r<br />EXPERIMENTAL & OPTIONAL REDEMPTION\r<br />--------------------------------------------------------\r<br />After you have finish the Disband the Thieves Guild quest, you can redeem one or several Thieves one at the time by typing setstage TGDisbandPost 10 in the console, persuade Jarl Laila Law-Giver of your intentions and haul a thief you want to redeem to the jarl, she will grant you permission to release the prisoner to be your follower (even unique ones like Brynjolf, Maven, Vex, Delvin Mallory, ...).\r<br />\r<br />Compatibility\r<br />------------------\r<br />The mod itself is compatible with most mods here on Skyrim Nexus, except for mods which alter the quest TG00 (because it fails this quest upon starting Disband the Thieves Guild), Thieves Guild member&#39;s stats or properties (a simple texture replacer of a TG member should be no problem), the quest DialogueRiften, the Riftenjail01 cell and RiftenMistveilKeep cell (only if you select the execution option for the corrupt guard) and mods which change all the male guards to female ones. Do not install mods which makes Brynjolf or any unique voiced TG member follower material, this mod already does this for you.\r<br />\r<br />Known issues\r<br />------------------\r<br />Sometimes the Thieves Guild members will not react to the intimidate/brawl invite and will remain non-hostile until leaving the cell or using the coc command (this is usually when you have too many scripts running at the same time).\r<br />\r<br />You can take only 1 thief at the time with you even if you have a follower mod installed which overrides the &#34;one follower only&#34; threshold, as seen in the video (I&#39;m using the Extensible Follower Mod), forcing two Thieves Guild members following you at the same time will result in the first follower leaving you.\r<br />\r<br />The corrupt guard may say his dialogue twice due the quest not being in stage 20 at the time of the Forcegreet triggering (as seen in the video).\r<br />\r<br />Maven, Brynjolf, Vex, Mercer Frey and Delvin Mallory have custom dialogue lines when you win the brawl but sometimes they use the generic dialogue line : &#34;You&#39;re tougher than you look. You got me, fair and square.&#34;\r<br />\r<br />Thrynn, Sapphire and Tonilia are not part of the VoicesTypeBrawling so you won&#39;t hear them say the generic dialogue line.\r<br />\r<br />Some of the Thieves Guild members won&#39;t go into the jail boxes themselves and need to be pushed all the way in or just a little push to make them move towards the jail marker.\r<br />\r<br />The quest keeps track of all the Thieves Guild members which are performing the PrisonersSandbox0x0 AI Package, if the value of thieves performing this sandbox is equal to fifteen the quest will progress to stage 40 (Return to Jarl Laila Law-Giver to receive your reward), it may occur that due stacking issues some Thieves Guild members return to the Ragged Flagon or the Ragged Flagon - Cistern performing other AI packages, resulting in a preemptive trigger of stage 40 when there is still one or more thieves on the loose or in a failure of triggering stage 40 at all due the condition of 15 thieves arrested not being fulfilled.\r<br />\r<br />As seen in the video, some Thieves Guild members may leave the jail box area, although this is exceptional (the recording was the first and only time this has happened), push them all the way to the outer wall to prevent them leaving the jail box.\r<br />\r<br />Unmid or Laila may not start the execution AI package, reload a save before selecting an option and select the execute option when neither Unmid is leaning on the wall and Laila or Unmid is in a Dialogue Scene.\r<br />\r<br />Credits\r<br />----------\r<br />To all beta testers, who make it possible to fix bugs in the early versions.\r<br />\r<br />View my other mods\r<br />------------------------\r<br />[url=http://www.nexusmods.com/skyrim/mods/34829/?]KratosRace with unique body texture by volvaga0[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/28880/?]Destroy the Thieves Guild - Final version[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/25443/?]WIP - Destroy the Thieves Guild [/url] (obsolete, final version released)\r<br />[url=http://www.nexusmods.com/skyrim/mods/22219/?]Invisible Aetherial Crown[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/24103/?]Enchanted versions of the Steel Horned Helmet[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/19631/?]Lie to Degaine about Dibella Statue[/url](remade)\r<br />[url=http://www.nexusmods.com/skyrim/mods/19614/?]Alternative quest end Lights Out after first killing leader Broken Oar Grotto[/url] (remade)",
  "categoryId": "24",
  "version": "RC2Fix",
  "author": "bruce142",
  "createdUnix": "1390757239",
  "updatedUnix": "1431773210",
  "containsAdultContent": false,
  "uploadedBy": "bruce142",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093549",
      "name": "Disband the Thieves Guild - RC version",
      "version": "RC",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16033",
      "fileName": "Disband the Thieves Guild - RC version-50378-RC.rar",
      "uploadedUnix": "1390756973",
      "modVersion": "RC",
      "virusScanUrl": "https://www.virustotal.com/file/d7fc6c5599d28875e483a30bf17ee2628f6a4193c887d0b35299860f32fb3fdb/analysis/1407902845/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Disband%20the%20Thieves%20Guild%20-%20RC%20version-50378-RC.rar?fid=1000093549&ttl=1535832055&ri=8192&rs=8192&setec=f4918d5ebc997443fc9e8420ff59d38e"
    },
    {
      "fileId": "1000097020",
      "name": "Disband the Thieves Guild RC2",
      "version": "RC2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16035",
      "fileName": "Disband the Thieves Guild RC2-50378-RC2.rar",
      "uploadedUnix": "1392388925",
      "modVersion": "RC2",
      "virusScanUrl": "https://www.virustotal.com/file/2bc8916d868723b386c85f8f6b28dd21c6bb9f61586cdb0c0063579de34308c5/analysis/1407933331/",
      "changelogHtml": " Fixed Brynjolf&#39;s invulnerability issue <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Disband%20the%20Thieves%20Guild%20RC2-50378-RC2.rar?fid=1000097020&ttl=1535832055&ri=8192&rs=8192&setec=3f8be1fdee35c3dd0590fe9643098752"
    },
    {
      "fileId": "1000145416",
      "name": "Disband the Thieves Guild RC2 Fix",
      "version": "RC2Fix",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "28",
      "fileName": "Disband the Thieves Guild RC2 Fix-50378-RC2Fix.rar",
      "uploadedUnix": "1422729333",
      "modVersion": "RC2Fix",
      "virusScanUrl": "https://www.virustotal.com/file/96f34f1d7d935a73a59e6f81d1d38ecec8372cbd367394be5dc651f4e3f1dc6d/analysis/1422729363/",
      "changelogHtml": " Fixed redemption Jarl Laila Lawgiver sometimes not firing & always guarding (thanks to ZZhukov <br/> \n Fixed prisoner not following when he/she says : &#34;I didn&#39;t mean nothing by it&#33; Just... leave me alone&#33; What do you want?&#34; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Disband%20the%20Thieves%20Guild%20RC2%20Fix-50378-RC2Fix.rar?fid=1000145416&ttl=1535832056&ri=8192&rs=8192&setec=70af5a785dd905f30b4a02d839d397e9"
    },
    {
      "fileId": "1000160296",
      "name": "Disband the Thieves Guild SEQ",
      "version": "SEQ",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Disband the Thieves Guild SEQ-50378-SEQ.rar",
      "uploadedUnix": "1431773210",
      "modVersion": "SEQ",
      "virusScanUrl": "https://www.virustotal.com/file/3318ce933c8e7f478856101bd3862c69b194d7ecb4d67e9f3ca65c5c86dbd931/analysis/1431773222/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Disband%20the%20Thieves%20Guild%20SEQ-50378-SEQ.rar?fid=1000160296&ttl=1535832056&ri=8192&rs=8192&setec=f8bef89ea4734e49f8a38c69094d456b"
    }
  ]
}