{
  "modId": 50381.0,
  "modName": "Acadian Race",
  "summary": "The Acadian Race. The race has unique abilities....",
  "descriptionHtml": "Please endorse if you like this mod&#33;\r<br />\r<br />What this mod does: Adds a new race to the game.\r<br />\r<br />*This is not a god or cheat mod, but their abilities are stonger than the default races. They look like nords with different eyes, and they glow.*\r<br />\r<br />Lore:An almost extinct race, Acadians are strong warriors who have unique abilities. Being the descendants of Atlanteans, they can breathe underwater. Thy also have the power to summon a sword to aid them in battle. They need to acquire their sword before adulthood on a unique journey or they are exiled from their community. Acadians have evolved to resist magic, since that was their weakness at some point. Most Acadians become knights, whether good or evil, because their race is bound to their honor. \r<br />\r<br />Abilities Defined- \r<br />Summon Acadian Blade- Conjuration spell that summons a spectral blade that does 30 damage that ignores armor and 10 default 1H damage.\r<br />Acadian Underwater breathing-Breath under water.\r<br />Acadian Spirit- The Acadian spirit glows softly. (Like the Sovengarde effect)\r<br />Acadian Blood- 50 percent resistant to magic.\r<br />Plus some minor stat buffs. Extra carry weight, slightly increased health regen, health regen during combat, etc.\r<br />NOTE-* I have not tested this mod extensively with the female gender. There might be some issues with that.\r<br />NOTE* I was only going to use this for myself and decided to upload it-just because some other people might enjoy the mod. Not allowing posting, because of trolls.\r<br />\r<br />Credits- Bethesda for their awesome games and modding tools.\r<br />Permissions- Use this all you want in your mods, just please give me credits in your description and private message me first so I can check out your mod&#33;",
  "categoryId": "34",
  "version": "",
  "author": "ApokKnight",
  "createdUnix": "1390761737",
  "updatedUnix": "1390761680",
  "containsAdultContent": false,
  "uploadedBy": "ApokKnight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093569",
      "name": "Acadian Race",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Acadian Race-50381-.zip",
      "uploadedUnix": "1390761680",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b4c9a0a4982f1edd23dc98169a61ed6e51e8fb742f5bea015c918009c9e42028/analysis/1407902972/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Acadian%20Race-50381-.zip?fid=1000093569&ttl=1535832063&ri=8192&rs=8192&setec=bbe5f161acfb206cf95cdc454bca6002"
    }
  ]
}