{
  "modId": 50395.0,
  "modName": "Inuyasha Weapons - Tessaiga Tenseiga Tokijin Bakusaiga Sounga Banryu",
  "summary": "Four weapons from the Anime Inuyasha; Tessaiga, Tenseiga, Tokijin and Bakusaiga.",
  "descriptionHtml": "NOTE: If you want these weapons to fire projectiles before I finish making them that way and you have the Dragonborn DLC, download the imbued weapon mod. You can change the color of the projectile to match the intended colors (tessaiga-gold, tokijin-blue, bakusaiga-green) However when I finish updating Bakusaiga, I&#39;m thinking it should shoot a green fireball instead of the bloodskaal attack.\r<br />\r<br />Download here: [url=http://www.nexusmods.com/skyrim/mods/32237/?]Imbued Weapons[/url]\r<br />\r<br />TO UPDATE&#33;&#33;&#33;: Uninstall my mod, Load game. Save game. Install new version. Just updating with NMM without a clean save could cause problems as much is different in this version.\r<br />\r<br />\r<br />\r<br />Changelog:\r<br />V1.1 - Added So&#39;unga and Banryu weapons\r<br />V1.0 - Initial Release\r<br />\r<br />\r<br />WHATS NEW IN V1.1:\r<br />Sesshomaru and Inu no Taisho have been removed. You can now find all the weapons in a chest on the west side of Dragonsreach. This isn&#39;t permanent, but will have to do for now.\r<br />\r<br />\r<br />\r<br />Description:\r<br />\r<br />If you&#39;re a fan of Inuyasha, you can probably skip the description. If you&#39;re just here because the swords are bad ass, keep reading.\r<br />\r<br />Tessaiga: Iron-Crushing Fang. This is Inuyashas signature weapon. It was created from a fang of his father, Inu no Taisho. It holds many powers, such as the Wind Scar, throwing a large blast of power that destroys the target. The Tessaiga is able to easily kill 100 enemies with a single swing.\r<br />\r<br />Bakusaiga: Explosive Crushing Fang. This is Sesshomarus signature sword (Inuyashas older half brother). The sword was created from his own body. It decomposes any organic material the blade cuts. Once cut, the target becomes infected with spontaneous destruction that disintegrates the body. In addition, the decomposition will continue to spread to any organic matter that comes into physical contact with the original target, similar to a virus. In addition to this ability, the Bakusaiga can also fire off explosive blasts of green-colored power capable of destroying many enemies with ease.\r<br />\r<br />Tenseiga: Heavenly Rebirth Fang. This sword, like the Tessaiga, was created froma fang of Inu no Taisho. Their father left this sword to Sesshomaru. It cannot deal damage, only heal. It can also bring the recently deceased back to life.\r<br />\r<br />Tokijin: Demon Fighting God. This sword was created from the fang of Goshinki, an ogre demon. Sesshomaru brought the demon&#39;s head to a wicked sword smith to create a sword that could match the power of Inuyashas Tessaiga. It is able to fire blasts of power, similar to the Bakusaiga and the Tessaigas Wind Scar.\r<br />\r<br />\r<br />CURRENT WEAPON POWERS\r<br />\r<br />Tessaiga: No enchantments. At current time it is simply a powerful, over-sized sword. Comes in 1h and 2h versions. Inu no Taisho drops enough ingredients to make both.\r<br />\r<br />Tenseiga: It can bring dead NPCs back to life, and heal damaged NPCs, however, it will turn NPCs hostile toward you, so it should only be used to heal followers who don&#39;t mind friendly fire.\r<br />\r<br />Tokijin: No enchantments. Just a powerful sword.\r<br />\r<br />Bakusaiga: Damage 10 points of health until the enemy finally dies, meaning 1 strike WILL kill ANYTHING given enough time. This SHOULD stack each time the target is hit with the sword, but it may not.\r<br />\r<br />So&#39;unga: Immensely powerful. It can kill most NPCs with a single hit. Resurrects their corpse and posses their mind to make them into a thrall. Currently only able to control 1 thrall at a time.\r<br />\r<br />HOW TO OBTAIN THE WEAPONS\r<br />\r<br />They are in a chest on the west side of Dragonsreach, refer to location screenshot.\r<br />\r<br />FUTURE PLANS\r<br />\r<br />Note: The current version will remain available forever. It is the only version that will not require DLCs, as the following abilities will require Dragonborn and possibly Dawnguard as well.\r<br />\r<br />Tessaiga: The ability to use the Wind Scar. A golden version of the Bloodskaal Blade power attack. I will attempt to make it fire 3 of these projectiles in order to better resemble the anime Wind Scar, but that may be beyond my ability.\r<br />\r<br />Tokijin: The ability to use the Bloodskaal Blade power attack. Blue re-color.\r<br />\r<br />Bakusaiga: Some sort of green blast, perhaps just a green Bloodskaal Blade power attack, or maybe something more like the tentacles from Miraak&#39;s sword. Currently undecided.\r<br />\r<br />Tenseiga: It will not be changing, unless I find a way to make NPCs not hostile when healed by the attacks.\r<br />\r<br />Make the swords only craftable at Demon Forge.\r<br />\r<br />\r<br />KNOWN ISSUES\r<br />\r<br />Tenseiga makes NPCs hostile if you attack them to heal them. So only use the sword to revive dead NPCs, or heal followers.\r<br />\r<br />\r<br />CREDITS\r<br />\r<br />InsanitySorrow for Tenseiga - [url=http://www.nexusmods.com/skyrim/mods/15955/?]Insanitys Dragon Katana[/url]\r<br />InsanitySorrow for Tokijin - [url=http://www.nexusmods.com/skyrim/mods/15545/?]Insanitys Chrysamere[/url]\r<br />Kirkieball for Bakusaiga - [url=http://www.nexusmods.com/skyrim/mods/1784/?]Ivory and Blue- Rudra Katana[/url]\r<br />Wolveski for creating the So&#39;unga and Banryu meshes for Oblivion and me for converting them to Skyrim.\r<br />\r<br />And most importantly, my good buddy Jackson for creating Tessaiga. He is an amateur 3d modelist who had never worked with skyrim mods (doesn&#39;t even own the game). This mod would be 100% impossible without him being nice enough (and loving anime enough) to create the models and textures for Tessaiga and email them to me&#33;",
  "categoryId": "55",
  "version": "1.1",
  "author": "Saint Grimm and Jackson Tonic Productions",
  "createdUnix": "1390789454",
  "updatedUnix": "1390938277",
  "containsAdultContent": false,
  "uploadedBy": "saintgrimm92",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093658",
      "name": "Inuyasha Weapons - VANILLA",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10254",
      "fileName": "Inuyasha Weapons - VANILLA-50395-1-0.rar",
      "uploadedUnix": "1390789258",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0d526136f5162f2271a8825deafdeb0325c8d5f19db4ba9fbf643775c05f11b1/analysis/1407903856/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inuyasha%20Weapons%20-%20VANILLA-50395-1-0.rar?fid=1000093658&ttl=1535832075&ri=8192&rs=8192&setec=916eedd5a60614259522109566787658"
    },
    {
      "fileId": "1000093945",
      "name": "Inuyasha Weapons V1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12432",
      "fileName": "Inuyasha Weapons V1_1-50395-1-1.rar",
      "uploadedUnix": "1390938277",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/dbca7f9e3c0144861acc0ae806cde5b2aa085829e69bf2b91de817d89a6b50e1/analysis/1407906477/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inuyasha%20Weapons%20V1_1-50395-1-1.rar?fid=1000093945&ttl=1535832075&ri=8192&rs=8192&setec=42539e3267c2da194d2b23c8dd0c07ff"
    }
  ]
}