{
  "modId": 50412.0,
  "modName": "LSB Blunts",
  "summary": " Four new blunt weapons added to the game.",
  "descriptionHtml": "LSB Blunts by Lord Banewrath Sunblade   1/27/2014\r<br />\r<br />      This mod adds four new blunt weapons to Skyrim. Three one handed hammers and one spiked mace. All the weapons can be upgraded and are unique, so there is only one of each in the gameworld.I have placed them at various Shrines of Talos in the game so these weapons are considered freebies but you need to find which shrines the weapons can be found at. I really miss finding the best weapons in the game like you could in Morrowind so I did it this way.\r<br />\r<br />\r<br />The weapons are steel in appearance but have the damage equal to daedric weapons.After all, Talos was hardcore and he wouldn`t use just any lesser steel weapon. I love the look and feel of the steel equipment in the game and did my best to try and replicate the feel and style so they would feel like the stock weapons do.I wanted an unmodded appearance and feel to the new models and I feel I came pretty close. I hope you enjoy them as much as I do and have fun with them.\r<br />\r<br />\r<br />\r<br />     Please do not use my work in other mods without permission. You may translate the mod to your national modding site if you want.",
  "categoryId": "55",
  "version": "1",
  "author": "Lord Banewrath Sunblade",
  "createdUnix": "1390838203",
  "updatedUnix": "1390838062",
  "containsAdultContent": false,
  "uploadedBy": "hammerhorde",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093755",
      "name": "LSB Blunts",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3122",
      "fileName": "LSB Blunts-50412-1.7z",
      "uploadedUnix": "1390838062",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e1df8c72720923ce0946f11db85134199125fae02f24b5e8c8bb0852a6f7becf/analysis/1407904866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LSB%20Blunts-50412-1.7z?fid=1000093755&ttl=1535832107&ri=8192&rs=8192&setec=22902d196fee2e073210f55263513708"
    }
  ]
}