{
  "modId": 5045.0,
  "modName": "Craft Upgrade Enchant ALL Unique and Artifact Weapons UPDATE",
  "summary": "Craft Upgrade Enchant ALL Unique and Artifact Weapons 51 of them - Updated added Nightingale Bow. \r\ngid2525\r\n\r\n\r\n***WARNING**\r\nIf you downloaded my Craft Upgrade Enchant Dawnbreaker mod (craftdawnbreaker.esp) DELETE it first before you install this mod (its included in this one)\r\n\r\n\r\nWow this took a lot of work!\r\n\r\n\r\nCraft, Upgrade, and Enchant ALL",
  "descriptionHtml": "Craft Upgrade Enchant ALL Unique and Artifact Weapons 51 of them\r\ngid2525\r\n\r\nOk, first of all you need THIS MOD to go with my mod:\r\n\r\nLegendary Smithing Upgrades by Lucubration\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=1690\r\n\r\nThats very important because the material type is set to studded for all my items so the would appear nice and neat in that studded catagory. Legendary Smithing add \\\"studded\\\" to the Steel smith perk (allow improving items 2x as much). So go get it!!\r\n\r\n\r\nTo LEARN all the unique and artifact ENHCANTMENTS (to DISENCHANT them) you need my other mod Master Enchant Disenchant . HERE:\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=4735\r\n\r\nUpdate: FIXED Nightingale Blade to use One handed PErks (it was set as a dagger for some reason)\r\nUpdated: added Nightingale Bow\r\n***WARNING**\r\nIf you downloaded my Craft Upgrande Enchant Dawnbreaker mod (craftdawnbreaker.esp) DELETE it first before you install this mod (its included in this one)\r\n\r\nWow this took a lot of work!\r\n\r\nAlmost forgot, ha! ALL these weapons are under the \\\"Studded\\\" category in your crafting menu. Why studded? Because for me at least I only had one studded item in there so it was perfect.\r\n\r\nCraft, Upgrade, and Enchant ALL Unique/Artifact/Quest Weapons!\r\n\r\n51 weapons, virtually all of the unique, artifacts, and quest weapons! You can craft them, you can upgrade/temper them and you can enchant them and make them your own. ALL Unique/Artifacts/Quest weapons have thier own unique formids so they won\\'t interfere with the vanilla game versions of these weapons and should not (hopefully) interfere with other mods (unless by some off chance they numbered their form ids the same as me and in that case I ain\\'t changing mine WAY too much work!).\r\n\r\nInstallation:\r\n\r\nDrop data folder into your main skyrim folder or put the esp file in wherever you put your other mods.\r\n",
  "categoryId": "75",
  "version": "1.1",
  "author": "gid2525",
  "createdUnix": "1325388781",
  "updatedUnix": "1325464393",
  "containsAdultContent": false,
  "uploadedBy": "gid2525",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15836",
      "name": "Craft Upgrade Enchant ALL Uniques and Artifact Weapons new FIXED and UPDATE ",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Craft Upgrade Enchant ALL Uniques and Artifact Weapons new FIXED and UPDATE -5045-1-2.zip",
      "uploadedUnix": "1325464393",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/8ec3076d5f0c3e302322a7aebfc12302dd431400c50b0b293b2d0d98afe1ab89/analysis/1406576382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craft%20Upgrade%20Enchant%20ALL%20Uniques%20and%20Artifact%20Weapons%20new%20FIXED%20and%20UPDATE%20-5045-1-2.zip?fid=15836&ttl=1535761468&ri=8192&rs=8192&setec=c8bd0fdfcc1abf8b8804588b04519f6e"
    }
  ]
}