{
  "modId": 50467.0,
  "modName": "Eastern Style Body Art",
  "summary": "Adds Arabesque and Henna-inspired body art designs for use with RaceMenu&#39;s overlay system. For males, and females&#33;",
  "descriptionHtml": "[center]\r<br />[img]http://i.imgur.com/AD64K1b.png[/img][/center]\r<br />[font=tahoma][size=3][color=#ffcc99][color=#ffff00][b]Users of RaceMenu 3.0+, the menu options have changed&#33; My paints will continue to show up, however, you will need to press the right arrow to scroll through options until you get to &#34;body paint&#34;. This is at the very top of the sliders menu, NOT grouped with the other options in the far right corner&#33; So hooray, this is compatible after all.[/b][/color]\r<br />\r<br />[img]http://i.imgur.com/4PU2yzQ.png[/img]\r<br />\r<br />I can&#39;t remember what spurred this, initially, but here we are&#33; A body art mod that contains [s]12[/s] 18 female designs and [s]11[/s] 15 male ones (though you can mix and match regardless of your character&#39;s physical sex).\r<br />\r<br />The &#34;tattoos&#34; contained in this mod were made with henna pigment in mind, and most of them draw from Arabesque and Indian paisley designs. There&#39;s not very much straight-up paisley, but rather you will find elements of paisley making up most of these: lotus flowers, leaves, etc. They range from very simple to moderately complex, and they are all high res files.\r<br />\r<br />Now, I don&#39;t harbor any grand delusions as to the quality or beauty of these things. I like them, maybe you will, too. Many hours (that I didn&#39;t exactly have lol) went into these, so I just thought it would be lame to keep them to myself.\r<br />\r<br />[img]http://i.imgur.com/FcXJG2L.png[/img]\r<br />\r<br />This is absolutely required, no if&#39;s and&#39;s or but(t)&#39;s:\r<br />\r<br />*Current version of [url=http://www.nexusmods.com/skyrim/mods/29624]RaceMenu[/url] AND the Loose Base Scripts located on its download page.\r<br />\r<br />The following aren&#39;t technically requirements, but they are useful things to know.\r<br />\r<br />*The female textures were made using the [url=www.nexusmods.com/skyrim/mods/6709]UNP[/url] body replacer, and the male textures were made using [url=skyrim.nexusmods.com/mods/2488]Better Males Favored Soul[/url] replacer. You can use these overlays on any body, but differing normal maps and models may make them look just slightly different from the screenshots. Shouldn&#39;t be anything too terrible, though.\r<br />\r<br />*It&#39;s also worth mentioning that you can actually use the male textures on female characters and vice versa. Again, they might look a little odd, but it won&#39;t be anything awful. Some look quite nice, actually. So go nuts, is what I&#39;m saying. There are, in fact, some lovely user pics showcasing a male hand design on female characters, and the girl in my second screenshot is wearing the male sleeves, if you want some sort of idea of any difference which may exist in practice. \r<br />\r<br />[img]http://i.imgur.com/VQ5bjd1.png[/img]\r<br />\r<br />Use NMM or dump the ESP and BSA files into your Skyrim/Data folder.\r<br />\r<br />To uninstall, remove any overlays you have on your character, then remove the above files.\r<br />\r<br />[img]http://i.imgur.com/FuTJr3a.png[/img]\r<br />\r<br />[u]February 2, 2014[/u]\r<br />v1.1 - Added 5 new hand designs (3 female, 2 male), 1 sleeve (male), 3 leg designs (2 female, 1 male), and 1 back design (female). Legs, hands, and arm designs follow the same pattern the existing ones do: left, right, and left/right variants. In total men have 15 designs and women now have 18.\r<br />\r<br />Again, the designs can be used for either sex; the M/F designation only refers to the model I was working with.\r<br />\r<br />If you&#39;re updating from the original, just overwrite the files. No muss, no fuss.\r<br />\r<br />\r<br />[img]http://i.imgur.com/gZSNIhY.png[/img]\r<br />\r<br />[s]This version is not compatible with RaceMenu 3.0 and I&#39;m going to need to figure out what to do to make a version that is. Your patience is much appreciated and I apologize for the inconvenience.[/s] It&#39;s compatible, it&#39;s just located in a different place. At the top of the sliders menu (not grouped at the far right like it used to be) there&#39;s left and right arrows. Scroll right until you get to &#34;body/hand/etc paint&#34; and my paints will show up so long as you&#39;re looking at the right body part. Arms and legs count as &#34;body&#34;, hands are &#34;hands&#34;. \r<br />\r<br />[img]http://i.imgur.com/z9iM8zI.png[/img]\r<br />\r<br />Report bugs in the appropriate forum (under the forums tab up there, not the post tab).\r<br />\r<br />If you have any suggestions or would like to see more of something or something specific, let me know, again, in the appropriate forum thread on this page.\r<br />\r<br />Also, if you take a neat screenshot and want to share, that&#39;d be awesome.\r<br />\r<br />[img]http://i.imgur.com/2G774t4.png[/img]\r<br />\r<br />Do whatever you like with this mod; the world is your oyster&#33;\r<br />\r<br />[center][img]http://i.imgur.com/VFlvwAI.png[/img][/center]\r<br />\r<br />[img]http://i.imgur.com/yeMvayN.png[/img]\r<br />\r<br />[u]Tools Used[/u]\r<br />Photoshop CS5\r<br />Nifskope\r<br />[url=www.nexusmods.com/skyrim/mods/49349]vwr Racemenu Mod Maker[/url] by vinniewryan\r<br />\r<br />[u]Brushes[/u]\r<br />Many of the smaller designs are mine, the rest are as follows:\r<br />\r<br />Paisley elements and Arabesque designs by [url=http://designersbrush.deviantart.com]DesignersBrush[/url] - The brushes of his that I used have been around for years. His site (not dA) these days seems to be practically unusable, though if you want some beautiful brushes he has quite the hoard.\r<br />\r<br />Henna Mehndi Brushes by [url=http://falln-brushes.deviantart.com]Falln-Brushes[/url]\r<br />\r<br />Henna by [url=http://surrealistix.deviantart.com/]Surrealistix[/url]\r<br />\r<br />[u]Thanks also to...[/u]\r<br />Misslexi for the hotfiles image (which can also be seen in the user gallery; they show off the hand designs better than mine do :P)\r<br />All you Nexus folks\r<br />Bethesda\r<br />[/color][/size][/font]",
  "categoryId": "29",
  "version": "1.1",
  "author": "RefurbMadness",
  "createdUnix": "1390960539",
  "updatedUnix": "1391378749",
  "containsAdultContent": true,
  "uploadedBy": "RefurbMadness",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000093986",
      "name": "Eastern Body Art",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1700",
      "fileName": "Eastern Body Art-50467-1-0.7z",
      "uploadedUnix": "1390960101",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/79fa38637adbd5325e07071f4afff88f17fa3fb254a5c03497578fb917831b01/analysis/1407906847/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Eastern%20Body%20Art-50467-1-0.7z?fid=1000093986&ttl=1535832198&ri=8192&rs=8192&setec=a1b013e605a092fcdd018bc814cd02df"
    },
    {
      "fileId": "1000094909",
      "name": "Eastern Body Art",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3701",
      "fileName": "Eastern Body Art-50467-1-1.7z",
      "uploadedUnix": "1391378749",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/507503531e568836102df5c1bfea9a4fbaa7c44e438c92883dd266621da716cd/analysis/1407915130/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Eastern%20Body%20Art-50467-1-1.7z?fid=1000094909&ttl=1535832199&ri=8192&rs=8192&setec=5d3936e05f01d7b8177a1256bf912131"
    }
  ]
}