{
  "modId": 50477.0,
  "modName": "Raven&#39;s Rest - Memorial to My Father",
  "summary": "Riddle me this, Riddle me that...Solve the riddles of your childhood friends, Kita and Anja Ivar in order to gain entrance to the manor.\r<br />The player must use their geographical knowledge of Skyrim in order to solve the riddles.\r<br />",
  "descriptionHtml": "[center][/center]\r<br />\r<br />[center][/center]\r<br />\r<br />[center][/center][center][b][b][u]Version 1.31 is now available in the Files Tab[/u][/b][/b][/center][center][size=4][color=#00b050][b]Thank you very much for taking the time to visit my Raven&#39;s Rest Mod Page here at the Nexus&#33;\r<br />If you enjoy this mod, please remember to Endorse it.\r<br />Raven&#39;s Rest was created in Tribute to my Father who passed from this world onto the Land of our Forefathers in October of 2012. \r<br />\r<br />This house mod is not your typical &#34;Player House Mod&#34;. The home actually belongs to the Ivar Family. I want the player to feel as if they were in someone else&#39;s house. Comfortable but not entirely &#34;at home&#34;...A feeling as if the owners may return at any moment.\r<br />\r<br />[u]This mod, Raven&#39;s Rest gives a little back story as to why the player was crossing the border into Skyrim at the beginning of the game. Please be aware of that while you are playing. It is intended for Skyrim player such as myself...who are purists when it comes to the Elder Scrolls Lore.[/u]\r<br />\r<br />This house and the accompanying riddle quest gives a simple back story as to why the player may have been crossing the border into Skyrim. That being said, this mod&#39;s story line [u]will most likely conflict[/u] with any &#34;alternate-Start&#34; to the game that you may have installed.\r<br />\r<br />Along with a home and land that offers many secrets for the player to discover, there is also a quest that involves solving riddles. Only by solving these riddles will you gain entrance to the home and to all of the mysteries that lie within Raven&#39;s Rest.\r<br />Please see the video section to see how to start Raven&#39;s Rest.[/b][/color][/size][/center]\r<br />\r<br />[center][size=6][color=#00B050]Requirements: (Please Read)[/color][/size][/center]\r<br />[center][size=4]Skyrim v1.9.32.0\r<br />Required DLC - Hearthfire, Dragonborn and Dawnguard\r<br />[/size][/center]\r<br />\r<br />[color=#NaNNaNNaN][b][color=#FF0000][u][size=5]MOD CONFLICT INFORMATION PLEASE READ&#33;[/size][/u][/color][size=5][color=#FF0000][u]\r<br />THIS MOD WILL NOT WORK IF YOU ALREADY HAVE ANY MODS THAT CHANGE OR ADD TO THE AREA OF IVARSTEAD. [url=http://static-1.nexusmods.com/15/mods/110/images/50477-1-1402440853.jpg]CLICK HERE TO SEE AREA EFFECTED BY RAVEN&#39;S REST[/url]  [/u][/color]\r<br />[/size][/b][/color]\r<br />\r<br />[color=#00B050][b][size=5]Introduction:[/size][/b]\r<br />[size=4]Raven&#39;s Rest is VERY LORE ORIENTATED....This quest is started by visiting any town or city.....a courier will find you.\r<br />Raven&#39;s Rest is a plot of land and homestead of the Ivar family. It is located to the North East of Ivarstead and directly North of Shroud Hearth Barrow. Ivarstead, a town named after the long standing residents of Raven&#39;s Rest, the Ivar family. Ivarstead is a small community located far to the West from Shor&#39;s Stone and North West from Riften. Ivarstead serves as a resting place for pilgrims before they make the long journey up the Seven Thousand Steps to High Hrothgar.\r<br />Raven&#39;s Rest sits at the base of Throat of the World and it has been owned by the Ivar family for hundreds of years. The Ivar family are an old and very proud Breton family who were granted land in Skyrim by the Emperor Tiber Septim in the year 877 of the 2nd Era.\r<br />The Ivar family were originally Lords from the Barony of Dwynnen, a region on the southern coast of High Rock, near the area of Iliac Bay. The military force of Barony of Dwynnen was and still is named the Order of the Raven. The Order of the Raven is a legendary fighting order bound to the blood of the Dragon Emperors by Royal Right and by blood-lineage, having married into the Septim family in the early years of Tiber Septim&#39;s Reign.\r<br />Hundreds of year later, Knights and warriors of the Order of the Raven had the honor of leading the battle against the Camoran Usurper in 3E 267. At the Battle of Firewaves, Baron Othrok and Heniel Ivar led the Imperial armies against the usurper and then liberated half of Tamriel from Camoran the Usurper&#39;s tyranny. The Knights of the Order of the Raven still remain the vanguards of the Barony of Dwynnen, protecting the whole region and beyond.\r<br />Being related to through blood to Septim Dynasty, it is said that some in the Ivar family are able to use the Thu&#39;um or the Way of the Voice. They were specially trained in the using the Way of the Voice by the Masters themselves, the Greybeards. Early in the 3rd Era, the Emperor Tiber Septim was well aware of the bravery and loyalty of the Ivar family and took full advantage of the Ivar family&#39;s natural and spectacular talents for using the Thu&#39;um. The Ivar family are honored keepers of that knowledge and protectors of those who live in High Hrothgar, the Greybeards.\r<br />Only two members of the Ivar family still live in Skyrim at Raven&#39;s Rest, Kita and Anja Ivar, your childhood friends. It was upon their request that you were trying to cross the border into Skyrim. There you were caught up in an Imperial ambush and taken prisoner...Along with Ulfric Stormcloak.\r<br />That was where your story in Skyrim began....\r<br />\r<br />......this is where your story continues\r<br />\r<br />Raven&#39;s Rest.[/size][size=4]\r<br />[/size][/color]\r<br />\r<br />[center][color=#FF0000][size=5][b]ONCE THE COURIER DELIVERS THE NOTE, YOU WILL GET A QUEST NOTIFICATION. AFTER YOU HAVE SOLVED THE FIRST RIDDLE, YOU THEN WILL HAVE TO RELY ON YOUR OWN WITS IN KEEPING TRACK OF THE RIDDLES AND THEIR SEQUENCES. THERE IS NO POINT IN HAVING RIDDLES TO SOLVE IF THE MAP MARKER SHOWS YOU WHERE TO GO.[/b][/size][/color][/center][center][color=#FF0000][size=5][b]YOUR QUEST JOURNAL WILL NOT BE UPDATED WHEN YOU SOLVE A RIDDLE. NO MAP MARKERS WILL BE SHOWING THE LOCATION OF THE NEXT RIDDLE. WHAT IS THE POINT OS SOLVING A RIDDLE IF THERE IS A MARKER SHOWING YOU WHERE TO GO?[/b][/size][/color][/center]\r<br />\r<br />\r<br />[center][size=4][color=#FFFFFF][b]\r<br />Thanks to the lovely and talented [url=http://www.ravenquinn.net/]Raven Quinn\r<br />[/url] and [url=http://www.amazon.com/Raven-Quinn/dp/B00382GLEG]Her Music.[/url]\r<br />[url=http://www.ravenquinn.net/][/url] Thank you so much for all of your support and contributions. [/b][/color][/size][/center]\r<br />\r<br />[center][font=Verdana][size=4]Thanks to [url=http://belhene.deviantart.com/]Belhene[/url] forthe High Resolution Tamriel Map.[/size][/font][/center]\r<br />\r<br />[center][b][color=#ff0000][size=5]:Known Mod Conflicts:[/size][/color][/b][/center][center][font=Verdana][size=5][color=#ff0000][b][url=http://www.nexusmods.com/skyrim/mods/51188/?]No snow under the roof[/url]\r<br />--- [url=http://www.nexusmods.com/skyrim/mods/18106/?http://]\r<br />Guarded Borders\r<br />[/url]  --- [url=http://www.nexusmods.com/skyrim/mods/33162/?]\r<br />Immersive Settlements\r<br />[/url][/b][/color][/size][/font][/center]\r<br />[center][/center]",
  "categoryId": "67",
  "version": "1.31",
  "author": "Johnnie Estill - aka The ATOMIC Cafe",
  "createdUnix": "1402429310",
  "updatedUnix": "1403031661",
  "containsAdultContent": false,
  "uploadedBy": "TheAtomicCafe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112907",
      "name": "Raven&#39;s Rest v1.31 ",
      "version": "1.31",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "145103",
      "fileName": "Raven's Rest v1.31 - Patch 1-50477-1-31.zip",
      "uploadedUnix": "1402706528",
      "modVersion": "1.31",
      "virusScanUrl": "https://www.virustotal.com/file/67eea064f408053bd7d573aee9c458bd746011a30e19b19a5e3bec2fb1abcb1a/analysis/1408125276/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Raven%27s%20Rest%20v1.31%20-%20Patch%201-50477-1-31.zip?fid=1000112907&ttl=1535832214&ri=8192&rs=8192&setec=c5ed8d4ef220a0274eabcb85924ec7ce"
    },
    {
      "fileId": "1000113370",
      "name": "666 - SPOILERS",
      "version": ".666",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "6930",
      "fileName": "666 - SPOILERS-50477--666.zip",
      "uploadedUnix": "1403031661",
      "modVersion": ".666",
      "virusScanUrl": "https://www.virustotal.com/file/f20c742ed082272d0e799950e1783ef99163b1bc8e8c68a9b4f91fbe8fa6faf8/analysis/1408131074/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/666%20-%20SPOILERS-50477--666.zip?fid=1000113370&ttl=1535832214&ri=8192&rs=8192&setec=baddf065da73186041e5d64111b25563"
    }
  ]
}