{
  "modId": 50487.0,
  "modName": "Spanish Guia de estabilidad de Skyrim para ENB y mods pesados",
  "summary": "Esta guía trata paso a paso como hacer que tu skyrim corra perfectamente con los mods mas pesados de texturas, scripts y spawn masivo",
  "descriptionHtml": "Bueno creo esta guia ya que después de muchas pruebas encontré una combinación de mods y modificaciones que hacen que tu skyrim no se cierre inesperadamente cuando se usan mods de texturas pesadas o scripts pesados. También por los reiterados mensajes que me llegaban pidiendo ayuda sobre este tema.\r<br />\r<br />\r<br />[u][b]PRIMEROS PASOS[/b][/u]\r<br />\r<br />\r<br />Primero vamos a comprobar que todo está como debería para realizar este proceso, primero asegurarse de tener desactivado el filtro anisótropo y los fxaa, se recomienda no usar mods que afecten a la luz como pueda ser [b]Project Reality - Climates Of Tamriel V3.1 ; Realistic Lighting Overhaul 4.0.8.02  ; Enhanced Lights and FX 0.4.2[/b] pueden desactivarlos para probar y luego volver a activarlos para ver las diferencias (si es que las hay, para mi es totalmente innecesario) hay otro enb diferente al que voy a exponer aquí que combina muy bien con estos mods  [url=http://www.nexusmods.com/skyrim/mods/30936/?][b]RealVision ENB [/b][/url]\r<br />Pero probablemente de un peor rendimiento.\r<br />\r<br />\r<br />[u][b]INSTALACION[/b][/u]\r<br />\r<br />\r<br />Asegurarse que no hay otros archivos de otros enb en nuestra carpeta de skyrim, se ser así los cortamos y los pegamos en otra carpeta (así tendrán una copia de seguridad).\r<br />\r<br />Bien nos descargamos  los [url=http://forum.skyrimtuner.com/viewtopic.php?f=16&t=99]ENB SERIES[/url]lo normal es descargarse la última versión que es la [b]v0.246[/b] pero esto va a funcionar con cualquier versión a partir de la [b]v0.192[/b], una vez descargado, descomprimimos y  copiamos los archivos d3d9.dll y enbhost.exe de la carpeta WrapperVersion a nuestra carpeta skyrim del juego.\r<br />\r<br />Ahora tendríamos que descargarnos el enb que tenga las características que buscamos y que mínimo sea compatible con la [b]v0.192[/b], mi recomendación es que uséis el opcional de  [url=http://www.nexusmods.com/skyrim/mods/22056/?][b]RealLike ENB[/b][/url] v0.2xx support  .\r<br />\r<br />Una vez este descargado, descomprimen, van a la carpeta CORE y eligen un tipo de noche (brillante, oscura o normal) y copian su contenido en la carpeta skyrim de su juego, luego se dirigen a la carpeta ENBOOS (que está en la misma ubicación que core) y escogen la carpeta según el tipo de tarjeta gráfica que tengan (AMD, INTEL o NVIDIA)  en caso de ser NVIDIA o AMD tendrán 2 carpetas que hacen referencia a la capacidad en GB o MB de su tarjeta gráfica (por ejemplo yo tengo una 760GTX de 2 GB de RAM así que uso el archivo enblocal.ini de la carpeta 1-6GB_VRAM) y copian el archivo enblocal.ini a su carpeta skyrim del juego y sobrescriben.\r<br />\r<br />Una vez realizado esto pasamos a los mods que van a mejorar la estabilidad y el rendimiento del equipo.\r<br />\r<br />El primero seria [url=http://www.nexusmods.com/skyrim/mods/50305/?][b]SSME - Skyrim Startup Memory Editor[/b][/url]\r<br />Descargamos manualmente, descomprimimos y copiamos los archivos d3dx9_42.dll y ssme.ini a la carpeta skyrim de nuestro juego.\r<br />\r<br />Ahora descargamos el siguiente mod [url=http://www.nexusmods.com/skyrim/mods/41592/?][b]Stable uGridsToLoad[/b][/url] (Solo necesario si aumentamos los uGridsToLoad)\r<br />Y lo instalamos Con el manager de nexus (Nexus mod manager)\r<br />\r<br />Bien el siguiente paso sería modificar los archivos ini (skyrim.ini y skyrimprefs.ini) Estos archivos suelen encontrarse en: mis documentosmy gamesskyrim o en “nombre del usuario”mis documentosmy gamesskyrim. Si usan mis archivos modifiquen el modelo de targeta grafica.\r<br />\r<br />Primero, yo recomiendo usar los archivos por defecto que te crea el juego sin ninguna modificación adicional, si ya tenemos creados estos archivos recomiendo moverlos a otra carpeta y así tendremos una copia de seguridad y ejecutar el launcher de Skyrim.\r<br />\r<br />[b]SKYRIM.INI[/b]\r<br />\r<br />Añadir:\r<br />\r<br />[Papyrus]\r<br />fUpdateBudgetMS=1.2\r<br />fExtraTaskletBudgetMS=1.2\r<br />fPostLoadUpdateTimeMS=500.0\r<br />iMinMemoryPageSize=128\r<br />iMaxMemoryPageSize=512\r<br />iMaxAllocatedMemoryBytes=76800\r<br />bEnableLogging=0\r<br />bEnableTrace=0\r<br />bLoadDebugInformation=0\r<br />bEnableProfiling=0\r<br />\r<br />Bien ahora vamos con el otro\r<br />\r<br />[b]SKYRIMPREFS.INI[/b] (esto es más opcional)\r<br />\r<br />bTreesReceiveShadows=1 (solo si tiene una tasa de frames alta)\r<br />bDrawLandShadows=1 (solo si tiene una tasa de frames alta)\r<br />bShadowsOnGrass=1 (solo si tiene una tasa de frames alta)\r<br />También podemos probar este valor\r<br />iPresentInterval=0 (solo si tiene una tasa de frames baja)\r<br />\r<br />\r<br />[u][b]OTROS MODS,  FUENTES Y RECOMENDACIONES[/b][/u]\r<br />\r<br />\r<br />Con todo lo anterior a mí me funciona perfectamente he solucionado todos los problemas de estabilidad y rendimiento de mi juego con los mods más pesados (tengo unos 200 o más, 117 gráficos y 114 con esp) texturas máximas, script pesados y spawn masivo. Pero aún puede modificar algunas cosas más.\r<br />\r<br />Yo recomiendo configurar el brillo de su juego al mínimo (esto se puede hacer desde el menú del juego o en skyrimprefs.ini  fGamma=1.2000 o fGamma=1.0000 ) \r<br />\r<br />Los que vengan de versiones de enb como la v0.113 o similares notaran que el saturado ya no es el que era, y los colores se ven mas pálidos en la versión v0.246 mi recomendación es usar el mod [url=http://www.nexusmods.com/skyrim/mods/32064/?][b]Immersive Saturation Boost[/b][/url] .Va a dejar un aspecto muy parecido a la versión v0.113 del RealLike Enb \r<br />\r<br />Aunque la versión de enb series 0.246 pueda intimidar por tener un consumo alto de recursos según las pruebas que hice este enb con esta configuración va a tener un impacto mucho menor en el rendimiento que usar el enb series en solitario (por ejemplo o usar con el enb bleak o unbleak y a mi juicio también va a dar una calidad grafica mayor)\r<br />\r<br />[b]Skyrim Memory Patch 3.0[/b]\r<br />No utilice este mod pero si alguien quiere seguir investigando puede realizar sus propias pruebas.\r<br />\r<br />[b]ENBoost[/b]\r<br />Este “mod” lo único que tiene es una serie de archivos enblocal.ini para los diferentes tipos de tarjetas gráficas, yo no lo use ya que el que viene en el enb RealLike me funciona perfectamente, pero pueden hacer sus propias pruebas.\r<br />\r<br />Paso a poner las fuentes donde podrán encontrar muchas más información y recomendaciones para hacer que su juego corra más fluido (también pueden encontrar información en todos los link anteriores incluidos en esta guía).\r<br />\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/50214/?]Speed and Stability Guide for ENB[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50244/?]Skyrim Stability Guide[/url]\r<br />[url=http://enbseries.enbdev.com/forum/viewtopic.php?f=13&t=2729]Lin 1[/url]\r<br />[url=http://forums.bethsoft.com/topic/1484719-psa-a-new-memory-fix-ilsctd-alternative-to-safety-load/]Link 2[/url]\r<br />[url=http://forums.bethsoft.com/topic/1485263-shesons-memory-fix-ctdils-thread-2/]Link 3[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50471/?]Link 4[/url]\r<br />\r<br />\r<br />[u][b]MI EXPERIENCIA IN GAME[/b][/u]\r<br />\r<br />\r<br />Tras instalar mis mods básicos y prácticamente todos los mejores mods de texturas usando el ENB RealLike y series v0.113 mi juego funcionaba de una manera bastante fluida y aunque no era muy común en algunas ocasiones me echaba al escritorio (sin despedirse ni  na) a de más de esto cuando el juego necesitaba cargar una nueva celda del juego a veces pegaba un pequeño tirón. Cuando quise cumplimentar mis mods con otros de scripts pesados es donde realmente el juego ya no podía mas (Immersive Creatures y Skyrimmorespawns) y eran salidas al escritorio constantes aunque los había compatibilizado para evitar problemas (cada 20 o 30 minutos en campo abierto) y la situación era insostenible.\r<br />\r<br />Después de instalar y configurar las opciones de instalación que vienen en esta guía el resultado fue una mejora sustancial incluso en los frames/segundo, 0 salidas al escritorio y carga de nuevas celdas sin el más mínimo tirón. No puedo asegurar que todos los cambios y mods descritos en instalación sean realmente necesarios, pero es una configuración que me funciona a las mil maravillas y si no da problemas lo mejor es dejarlo así. Estoy ultra  :)  :)  :)  :] .\r<br />\r<br />\r<br />[u][b]CARACTERISTICAS DE MI PC[/b][/u]\r<br />\r<br />\r<br />Procesador: I5 3,1Ghz\r<br />Placa: MSI GAMING (no recuerdo el modelo exacto cuando pueda lo pongo)\r<br />Memoria RAM: 8GB DDR3 2400Mhz\r<br />T.Grafica: Gforce 760GTX 2GB DDR5 \r<br />\r<br />\r<br />[u][b]ESPECTATIVAS Y AGRADECIMIENTOS[/b][/u]\r<br />\r<br />\r<br />Espero que esto pueda ayudar a más de uno, y pueda  usar todo el potencial de su máquina para este gran juego y moldearlo a su gusto sin muchos problemas.\r<br />\r<br />Aunque pensaba añadirlo en este tema creo que finalmente hare otro con los mods gráficos que yo recomiendo para poner skyrim en full HD.\r<br />\r<br />Agradecer a la comunidad nexus, a todos los integrantes y a todas las personas que aportaron información referente a este tema que son unos verdaderos genios.\r<br />\r<br />Recopilacion de mods y mas informacion [url=http://www.3djuegos.com/comunidad-foros/tema/19228710/0/mods-skyrim-29-11-2013/]Mods Skyrim[/url]",
  "categoryId": "95",
  "version": "1.0",
  "author": "Incata",
  "createdUnix": "1391003850",
  "updatedUnix": "1391014952",
  "containsAdultContent": false,
  "uploadedBy": "incata",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000094076",
      "name": "ARCHIVOS INI",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "ARCHIVOS INI-50487-1-0.rar",
      "uploadedUnix": "1391014952",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/802fdaaedc2920d1f9d3a1260974208d3f1a39750045f26b81257f13aa8f2804/analysis/1407907399/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ARCHIVOS%20INI-50487-1-0.rar?fid=1000094076&ttl=1535832228&ri=8192&rs=8192&setec=4c2e71f59c9e83d2f3ff494ca16b0cbc"
    }
  ]
}