{
  "modId": 5049.0,
  "modName": "Give Smithing Ingredient text files",
  "summary": "Gives 50 of almost everything.For those times you wanna try out a new weapon mod and don\\'t have the materials.",
  "descriptionHtml": "Description: This mod is for those who download a new weapon mod for fun that requires you to craft the weapon, you get it started, and find out you don\\'t have enough materials. All ingots, leather pieces, dragon drops, and deadric hearts AND ores if you are making a bunch of different new weapons and need more ores afterwards. Not likely seeing as how you get fifty of each thing but still.\r\nInstallation and instructions of use: For you new modders, there are two files solely because I wanted to see if a microsoft word file worked for bat console commands like notepad does, just put it in your installation folder, not the data folder. If it has folders like meshes, textures, video, etc. you\\'ve gone too far and you need to go back one folder and put it in the area where your skyrim launcher is. \r\n\r\nNow, when you launch the game and open the console type bat (insert text name) in this case that would be \\\"bat givesmithing50\\\". I capitalised Give and Smithing like so in the microsoft word one, and literally saved the notepad version as (name).txt for good measure to ensure one didnt overwrite the other, though the .txt won\\'t show up in the name. when you type bat its pretty much telling the game to load the following txt file and follow the scripted directions that said file entails, both text files are the same with the same player.additem commands. Its really simple.\r\n\r\nrights and permissions: If this was a texturing job or something bigger that i actually CREATED, I would want some credit but all I did was compile a scripted command to make testing weapon mods more convenient for impatiant souls like me so frankly, go upload it at rapidshare and take credit for it for all I care. I didn\\'t do anything special. :)\r\n\r\nUpdate: I know for sure the Notepad one works, I\\'m curious on whether or not microsoft word text files work so could someone try that one out and tell me, its why I uploaded it in microsoft word as well.\r\n\r\nThis is me saying this description has undergone a brief change, I realised the txt file needed to not have spaces in the name or it wouldn\\'t work so I replaced the file with one where it was renamed but didnt mention it until now. If you\\'ve gotten this far down you won\\'t notice anything in more becasue I changed it in directions where it now says to type, \\\"bat givesmithing50\\\" instead of \\\"bat give smithing 50\\\". But you wouldn\\'t know that because history has been rewritten. *jedi mind trick* Just bringing it to your attention if you already downloaded and you\\'re revisiting this page to ask why not and are now reading this very last line of this very last bit of this description. ;D Also, I just deleted the file and replaced the archive with one with the readme in thier if you don\\'t know what to do with text files. Chances are you do.",
  "categoryId": "40",
  "version": "",
  "author": "7vincent7black7",
  "createdUnix": "1325395821",
  "updatedUnix": "1325451736",
  "containsAdultContent": false,
  "uploadedBy": "7vincent7black7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15798",
      "name": "GiveSmithing50",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "GiveSmithing50-5049-1.zip",
      "uploadedUnix": "1325451736",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/cf07dbdabc16c71575417d9f13527bb5fb7846675be21b39e20a64fb8bdd920f/analysis/1406576110/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GiveSmithing50-5049-1.zip?fid=15798&ttl=1535761478&ri=8192&rs=8192&setec=ee581ddd4334bf32183799823dbfa2d7"
    }
  ]
}