{
  "modId": 5050.0,
  "modName": "Epic Skyforge Steel Weapons",
  "summary": "A mod that actually changes the appearance of Skyforge Steel weapons to make them stand out when compared to standard steel weapons...",
  "descriptionHtml": "Just a note to all.  This mod is no longer supported and simply offered as is.  It was created pre-CK and many much better mods for Skyforge weapons have since been released, and honestly I don&#39;t have the time to revisit and play with this.\r<br />\r<br />Skyforge Weapons v.1.0\r<br />\r<br />This mod is simply meant to give the Skyforge Steel weapons a better appearance in comparison to normal steel weapons.  I&#39;ve seen lots of requests for such a mod, and have seen lots of suggestions for such with many of the Steel Weapon retextures, and one mod that claimed to change the Skyforge weapons but actually just changed all the steel weapons.  This mod actually includes an .esp to redirect the Skyforge weapons to the retextured meshes so they actually do appear different.\r<br />\r<br />This mod includes a fix for the Skyforge Steel Dagger as well, which can&#39;t be tempered in the vanilla game, allowing it to be upgraded on the grindstone like all the other Skyforge Weapons.  I also plan to expand the mod later to possibly include a Skyforge Warhammer, Mace, and Bow with Arrows, though SkyEdit currently can&#39;t alter projectile meshes.  Once such a capability is available, or the CK is released, this mod will be expanded so that all the Steel weapons and ammo have Skyforge counterparts.\r<br />\r<br />ExProsiveGaming gets credit for the textures used from the ExProsiveMods - EPIC STEEL - Weapons mod (http://www.skyrimnexus.com/downloads/file.php?id=2148).  I simply extracted the steel weapon meshes, copied them to a new folder, and placed his textures in one as well and redirected the texture paths on the meshes, then created an .esp to point the Skyforge weapons to these meshes instead of the normal steel weapons.\r<br />\r<br />If ExProsiveGaming wishes me not to use their textures for my mod, then I&#39;ll remove the mod and create my own for this.  If there is no protest, then I thank you for making these textures which I felt worked perfectly for the Skyforge Steel weapons.\r<br />\r<br />The usual disclaimers apply here.  I&#39;m not responsible for breaking your game if there is some sort of mod conflict, and if you use a mod that alters Skyforge weapons, there WILL be a conflict, so pick one.  You can&#39;t have it all.  I haven&#39;t altered the stats on any of the weapons.  Simply redirected the mesh paths and fixed the dagger upgrade problem.  That&#39;s it.  Last but not least, I hope you all enjoy.\r<br />\r<br />Thanks to ExProsiveGaming for the textures, and to Bethesda for a wonderful and epic game.  Please endorse if you like this mod, and for those who download it, thank you.  If you find this mod on ANY site other than the Nexus, or uploaded by anyone other than myself (rage0976) and I&#39;m not credited, then it&#39;s a rip-off and I&#39;d appreciate being informed of such.  Feel free to use this mod as part of your own, or to improve on it if you have tools that I don&#39;t and are able to make the alterations that I couldn&#39;t (such as adjusting the projectile data so the arrows can be fully converted when the mod is expanded to include them).  The meshes and textures for all the steel weapon counterparts are included in the mod, though only the vanilla versions are currently in game.  As stated before, I&#39;ll be expanding to include Skyforge versions of ALL steel weapons soon.  I just wanted to get this release out as a trial run to see what people think and get some feedback.  All I ask is to be credited, as well as having credit given to those whose resources were used for the creation of this mod, if you use this mod as part of your own or alter/expand/upgrade and re-release it.  Thank you.\r<br />\r<br />To Install:\r<br />Extract the Data folder in the archive to your default Skyrim folder (where the SkyrimLauncher and  TESV .exe files are located as well as the Data folder) and say yes to any overwrites (though there shouldn&#39;t be any since this file redirects rather than replaces meshes and textures) and combine permissions.  Tick the .esp in your preferred data file manager to activate, play, enjoy.\r<br />\r<br />To Uninstall:\r<br />Delete the SkyforgeWeapons.esp, then go into the Meshes and Textures folders under Weapons and delete the SkyforgeSteel folders and all their contents for both.",
  "categoryId": "55",
  "version": "v.1.0",
  "author": "rage0976",
  "createdUnix": "1325396038",
  "updatedUnix": "1325398918",
  "containsAdultContent": false,
  "uploadedBy": "rage0976",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15634",
      "name": "Skyforge Weapons",
      "version": "v.1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4689",
      "fileName": "Skyforge Weapons-5050-v-1-0.7z",
      "uploadedUnix": "1325398918",
      "modVersion": "v.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/58fac047de9b15949dae1fd9c39f9e3db4b7e86778be4837971bd153e0e8251d/analysis/1406574726/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyforge%20Weapons-5050-v-1-0.7z?fid=15634&ttl=1535761479&ri=8192&rs=8192&setec=281825068932d2bac3592fa4dbeb91c1"
    }
  ]
}